{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Teaching vs Learning (long) Sunday school and baseball too","postDate":"1026092753","msgId":39077,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGE2LjI4YTliYzYyLjJhNWE0OGQxQGFvbC5jb20+"},"prevInTopic":39063,"nextInTopic":0,"prevInTime":39076,"nextInTime":39078,"topicId":39063,"numMessagesInTopic":0,"msgSnippet":"In a message dated 7/7/02 1:05:02 PM, herbtea@gte.net writes: ","messageBody":"<div id=\"ygrps-yiv-2117952059\">In a message dated 7/7/02 1:05:02 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:herbtea@...\">herbtea@...</a> writes:<br/>\n<br/>\n&lt;&lt; Whereas &quot;learning&quot; to<br/>\nme implies &quot;following a track or furrow&quot; (that someone else put there)<br/>\nsince that is its derivation. &gt;&gt;<br/>\n<br/>\nYou can&#39;t just look at the Indo European roots and say the first one listed <br/>\nis &quot;its derivation.  Under Germanic-to-English (in American Heritage) it <br/>\nlists &quot;lore&quot; which is knowledge.  That&#39;s the origin given in the Oxford <br/>\nEnglish Dictionary.   And another type of meaning in the various <br/>\nre-constructed Indo-European roots has to do with footprints or tracks in <br/>\nTHAT way--a path.<br/>\n<br/>\nThe origin of the word for &quot;book&quot; had to do with a stick, but when someone <br/>\nuses the word book, it doesn&#39;t imply &quot;stick.&quot;<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":257127,"authorName":"Deb","from":"Deb &lt;herbtea@...&gt;","profile":"live_oak2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Teaching vs Learning (long) Sunday school and baseball too","postDate":"1026069371","msgId":39063,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNEMjg5MzdCLjlERENENDZCQGd0ZS5uZXQ+","referencesHeader":"PDEwMjYwMDM5NTAuODk0LjE1NjcwLm03QHlhaG9vZ3JvdXBzLmNvbT4="},"prevInTopic":0,"nextInTopic":39077,"prevInTime":39062,"nextInTime":39064,"topicId":39063,"numMessagesInTopic":0,"msgSnippet":"As a lover of the English language, as well as kids and learning, I have to jump into this one. Philosophically, I agree with what Mary said very ... loves to","messageBody":"<div id=\"ygrps-yiv-105362138\">As a lover of the English language, as well as kids and learning, I have<br/>\nto jump into this one. Philosophically, I agree with what Mary said very<br/>\nwell:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Teaching to me is a role we all play. Learning is a growth process. My son<br/>\n </span></blockquote>loves to teach me how to scooter. He shows me how to put on a helmet, to<br/>\nraise<br/>\nmy handle bars, to start and stop. He shows me just how to go off a<br/>\ncurb, to<br/>\ntwirl and pop wheelies. I know these things already. I have learned<br/>\nthem. He<br/>\ngets great joy showing me all the fine details he himself has learned.<br/>\nHe is<br/>\npracticing being an expert and someone who can explain an activity to<br/>\nanother<br/>\nperson. We all learn, we all get taught things from others and we all<br/>\nteach<br/>\nwhen asked. A goal of unschooling my kids is to show them to believe in<br/>\nthemselves and everyone they interact with. We all have something<br/>\nvaluable to<br/>\nshare. I hope they learn this. <br/>\nMary &gt;&gt;&gt;&gt;<br/>\n<br/>\n<br/>\nMy kids and myself, we all think we &quot;learn&quot; things even more deeply when<br/>\nwe try to explain it or show it to someone else so they can enjoy it or<br/>\ndo it or understand what we mean, too. And it is a natural human process<br/>\nthat works both ways. Only with a structured school society does<br/>\nteaching mean from adult &quot;person with the power&quot; to child and not vice<br/>\nversa. I would sorely miss it if I didn&#39;t have the chance to learn<br/>\nthings from my kids and other kids. And they have fun teaching me. It is<br/>\ndelightful as each person has their own unique viewpoint and insights.<br/>\nSadly that is what we lose when &quot;mass teaching&quot; occurs. THe information<br/>\nand ideas flow only in one direction and that always will jam up and<br/>\nbuild resistance, or sheep, eventually.<br/>\n<br/>\n<br/>\nWords may have one connotation to one person and a different connotation<br/>\nto another person. Both are valid as connotations. Since &quot;raise<br/>\nyourself&#39; cannot be said any other way by the structure of Spanish,<br/>\ntalking about whether it was done with enforcement and domination were<br/>\nused or a laissez faire attitude that encouraged self-discovery, the<br/>\ndifferentiation between these would have to be made using other words. I<br/>\nunderstand Liza&#39;s response that &quot;teaching yourself&quot; is a good thing. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I understand you meant to point out the philosophical difference<br/>\n&gt;between  *teach* and *learn*. Nevertheless, I particularly like the<br/>\n&gt;authority reversal of my kids being their own teachers as opposed to<br/>\n&gt;somebody else.<br/>\n<br/>\n </span></blockquote>When I first read this thread, I thought to myself &quot;oh, teach oneself&quot;<br/>\nwould be better than just &quot;learning&quot; as to me it emphasizes that concept<br/>\nthat I decide WHAT and HOW and HOW MUCH I learn. Whereas &quot;learning&quot; to<br/>\nme implies &quot;following a track or furrow&quot; (that someone else put there)<br/>\nsince that is its derivation. My parents used to ask me what I was<br/>\n&quot;learning&quot; in school or if I had or hadn&#39;t &quot;learned&quot; something<br/>\nworthwhile when doing  a thing. So to me that word has had less of an<br/>\n&quot;infinite possibilities&quot; connotation. I can see both views of it, and it<br/>\ncan have both of these ideas.<br/>\n<br/>\nLooking at the development and meanings of the words one can see that it<br/>\nreally isn&#39;t fixed one way or the other, and just depends on which<br/>\nmeaning you choose to use. So a discussion of ways to relate to your<br/>\nkids and how they relate to the world and things they are learning may<br/>\nbe more helpful to expand someone&#39;s understanding of how to do<br/>\nunschooling than limiting the meaning of a word to one connotation. I<br/>\nappreciate finding out someone&#39;s idea of it, but if I think &quot;learning&quot;<br/>\nis going down a furrow made by others, and you tell me that that is the<br/>\nbest thing to do, it might come out different for me than what you had<br/>\nin mind at all. Clarifying what each person is trying to say without<br/>\nlimiting the words may be most helpful.<br/>\n<br/>\nThe roots of the word &quot;teach&quot; go way back before an &quot;enforced school&quot;<br/>\nsituation was entrenched in our society (and I myself have been so far<br/>\naway from the established schools and that mindset for so long that I<br/>\nforgot that it could be the only way some see &quot;teaching&quot;). The roots of<br/>\n&quot;teach&quot; go ultimately back to &quot;to show&quot; in Proto-Germanic. (Warning: I<br/>\nlove languages, the roots of our English language, and learning about<br/>\nthe mindsets demonstrated by different words and languages. I personally<br/>\nkeep pursuing knowledge in this field. You can stop reading at this<br/>\npoint if you wish to avoid this!) &quot;Teach&quot; is also related to &quot;token&quot;<br/>\nwhich, before it came to be used for a &quot;stamped metal piece&quot; in about<br/>\n1598, meant a sign, evidence, symbol, wonder, miracle (as in Beowulf,<br/>\n725 AD). Not too pedantic or dry a word. IT was the showing of something<br/>\nspecial, perhaps miracles! A demonstration of perhaps supernatural<br/>\nability -- and my kids can teach me the miracle of their viewpoints<br/>\nanytime! So can any person actually - everyone here in fact. (I<br/>\nappreciate it when it is miraculous!;)) <br/>\n<br/>\nDefinitions of &quot;teach&quot; from the Encarta World English Dictionary<br/>\ninclude:<br/>\n<br/>\n1.verb transitive - To impart knowledge or skill to somebody by<br/>\ninstruction or example. (Hmm... example is good; I learn by example all<br/>\nthe time and my kids wanted to see others with skill perform whenever<br/>\navailable. we went to rodeos, theatrical shows, pizza flipping<br/>\ndemonstrations, Russian speaking people, animal training shows,<br/>\nstorytelling concerts, etc, etc including any kind of good<br/>\npuzzle-solvers and thinkers too.)<br/>\n<br/>\n2. verb intransitive - to give lessons in a subject, or to give lessons<br/>\nto a person or animal (yucckk! This sounds like the lessons are given<br/>\nwhether the person or &quot;animal&quot; wishes it or not or has anything useful<br/>\nhe wants to do with it or not).<br/>\n<br/>\n3.verb transitive - To bring understanding to somebody, especially<br/>\nthrough an experience. (Yeah, we like experiences form which we learn<br/>\nsomething, or we each us something. DOn&#39;t want to waste time with<br/>\nexperiences which don&#39;t teach us something useful or enjoyable.)<br/>\n<br/>\n4. verb intransitive -To engage in imparting knowledge or instruction<br/>\nfor a period of time in a particular place &quot; he teaches college&quot;.<br/>\n<br/>\n<br/>\nI&#39;d like to say that receiving input is valid as a learning process. I<br/>\ndon&#39;t appreciate programmed enforced teaching, but as Mary said there is<br/>\nteaching going on all the time. The word doesn&#39;t intrinsically mean to<br/>\ndominate or enforce something. If our kids have never been in a school<br/>\nor not for a long long time, why keep that connotation of the word? If<br/>\nit means that for you, it does. If it means other things to you, that&#39;s<br/>\nvalid too. And the way, the spirit in which you do it is more important<br/>\nthan the term. Wouldn&#39;t you let your child go visit with a grandparent<br/>\nwho is an awesome fisherman who&#39;ll teach him stuff about fishing if he<br/>\nwants to learn it? Or would he have to figure it all out for himself<br/>\nwithout any help or input, even if he wanted to go with Grandpa?<br/>\n<br/>\nA brief linguistic &#39;treatise&#39; on &quot;learn&quot; - &quot;Learn&quot; is used both as an<br/>\nintransitive verb and a transitive verb in the dictionary. <br/>\n<br/>\n1. verb intransitive - To come to know something, acquire knowledge of a<br/>\nsubject or  skill through education or experience. (I am learning to<br/>\nplay piano or I am learning all the time.)<br/>\n<br/>\n2. verb intransitive - To gain information about somebody or something.<br/>\n(I just learned that Jim is arriving tomorrow.)<br/>\n<br/>\n3. verb transitive - To memorize something, e.g., facts, poem, a piece<br/>\nof music, or a dance. (I learned the hokey-pokey.)<br/>\n<br/>\n4.  verb intransitive - To teach somebody something (non-standard). (A<br/>\nla Tom Sawyer and Huckleberry Finn: &quot;He learned me how to write.&quot;)<br/>\n<br/>\nAnd &quot;learned&quot; means &quot;well-educated and very knowledgeable&quot;.<br/>\n<br/>\nNote: The Encarta World Dictionary also says that the underlying idea of<br/>\n&quot;learn&quot; from its derivation &quot;track&quot; is to &quot;follow a course of<br/>\ninstruction&quot;. &quot;Learn&quot; comes also from Proto-Germanic root, the same root<br/>\nthat formed into the Modern German words &quot;lernen&quot; meaning to study or<br/>\nlearn and &quot;lehre&quot; meaning rule, doctrine, system, science, lesson,<br/>\nwarning,and as a verb - to teach, instruct or show. And &quot;Lehrer&quot; meaning<br/>\nteacher, master, boss and related words.<br/>\n<br/>\nSo, it depends really on you are trying to express, rather than one word<br/>\nmeaning inherently what you are trying to say and another always<br/>\nexpressing something else, not as good, by definition. DOn&#39;t expect all<br/>\nothers to share your connotations. This discussion is so valuable<br/>\nbecause we all are trying to handle our own circumstances and can ask<br/>\nquestions and share ideas and experiences that can give others new<br/>\ninsights. But I wouldn&#39;t say one word or the other inherently mean &quot;the<br/>\nbad&quot; thing to do. I&#39;m new to this list and maybe ai am stepping on toes<br/>\nhere of people I don&#39;t even know. It seemed like an interesting<br/>\ndiscussion and I hope what I have added to it isn&#39;t distasteful. I<br/>\nreally hate schools, public schools in particular, and the warehousing<br/>\nof kids. THe teacher texts I have seen are so full of psychology terms<br/>\nlike &quot;operand and operand&quot;, it is a no wonder that trained teachers<br/>\nhaven&#39;t a clue what they are doing. But I have always enjoyed learning<br/>\nfrom an insightful friendly individual who knows more than I do in an<br/>\narea I am interested in. I don&#39;t think kids&#39; learning is really much<br/>\ndifferent than that. There&#39;s some learning you do on your own and some<br/>\nyou do with others..... Man is a social being who likes to live in<br/>\ngroups. <br/>\n<br/>\nWhich brings me to comment on the Sunday school teacher who thought the<br/>\nboy needed to be like the other kids ......... what an idiot. &#39;Nuff<br/>\nsaid. Is your son getting enough out of the Sunday school class in his<br/>\nopinion to be worth the negative aspects of the class and teacher?<br/>\nSometimes there is enough to put up with the junk. If not, is there an<br/>\nalternative to satisfy your family&#39;s reasons for taking the class? <br/>\n<br/>\nIt seems to me that people are talking about unschooling meaning letting<br/>\nyour child learn what and as he wants without limiting him (or her) to<br/>\nlearning what and how someone else wants him to. Is that right? And we<br/>\nas parents learning to let go and not interfering with that. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; &gt; this is something I&#39;m really trying to grip myself!  Granted, we have only been unschooling for a very short while, but the more we do, the more dh relaxes, and the better things flow (I&#39;m the one whose dh really wanted a school-at-home atmosphere). But I&#39;m still running into all kinds of unexpected snags, even though I am a staunch supporter of all the things you&#39;ve mentioned above.  I am continually berating myself for not unschooling properly!&gt;&gt;&gt;&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>It seems to me that &quot;learning to work with a group&quot; would be a normal<br/>\ndesired part of anyone&#39;s growing up, - such as learning to sail with a<br/>\ncrew, learning to play baseball as a team, learning to exchange things<br/>\nof value with others and work together on a project or business,<br/>\nlearning to get along as a family and contribute to its survival. On<br/>\nother hand, this society is so far off the rails with control by<br/>\npower-hungry people and psychological tools employed to achieve that,<br/>\nand just general personal aberration,  that we do have to be wary of<br/>\nputting our kids in group situations where someone who doesn&#39;t respect<br/>\nthe rights of others may have undue influence. &quot;Teaching&quot; our kids that<br/>\ncharacter in the face of pressure matters, that we can maintain our<br/>\nindividuality and survival and how some have succeeded in that, and how<br/>\nto approach interpersonal problems when one decides to stay in a group<br/>\nwhere there are some (pretty much any human group!) - those are all<br/>\nthings to discuss with our kids as they get older especially. And hold<br/>\nup some good examples, or read some good stories where characters dealt<br/>\nwith such things for ideas of what people do.<br/>\n<br/>\nTo me the actual learning of things a kid wants to do is pretty easy and<br/>\nnatural. It&#39;s where we come head to head with others and how to sort<br/>\nthat out and manage to survive as individuals and also as a groups, and<br/>\nas mankind all together, that is the trick .... <br/>\n I let my daughter just stay home so she wouldn&#39;t have to deal with a<br/>\nlot of *** so young. BUt as the kids get a little older, there it is to<br/>\nhandle. They&#39;ll form our society when we are old, and let&#39;s hope we&#39;ve<br/>\nhelped them do better for themselves, and for us as a whole race.<br/>\n<br/>\noh my gosh! I am on a mountain-high soapbox and don&#39;t know how to get<br/>\ndown..!! Help!<br/>\n<br/>\nDebbie R.<br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\nDirector, Live Oak Academy<br/>\nVisit our website <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.newhealth.net/liveoak/\">http://www.newhealth.net/liveoak/</a><br/>\n<br/>\n ~Flexible Alternative Schooling for Families~ <br/>\nLive Oak Academy provides year-round enrollment in private independent<br/>\nstudy programs for homeschoolers.  Tutoring is also available.</div>","specialLinks":[]}],"prevTopicId":39071,"nextTopicId":38998}}