{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":40,"messages":[{"userId":116488337,"authorName":"Gold Standard","from":"&quot;Gold Standard&quot; &lt;jacki@...&gt;","profile":"jackiknouse","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [AlwaysLearning] Re: ideas, facts, thoughts, and feelings","postDate":"1155773625","msgId":26817,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFBLRUhKR0NJR05QUEFCRlBCS0xHS0VOQURPQUIuamFja2lAYm9hcmRwcmVwLm5ldD4=","inReplyToHeader":"PDIwMDYwODE2LjA2NTIwNi4yNTQ0LjAuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":26814,"nextInTopic":26818,"prevInTime":26816,"nextInTime":26818,"topicId":26700,"numMessagesInTopic":0,"msgSnippet":"... Just wanted to note that seizures aren t this clear-cut. There are parameters for seizures and driving. I have a friend with petit mal seizures, considered","messageBody":"<div id=\"ygrps-yiv-1917588727\"><blockquote><span title=\"ireply\">&gt;&gt;I hope you don&#39;t have a seizure disorder because there&#39;s a risk to anti<br/>\n&gt;&gt;seizure medications and they can cause birth defects and if you have<br/>\n&gt;&gt;seizures they won&#39;t let you drive anymore and it could complicate you<br/>\n&gt;&gt;being alone with your kid.&lt;&lt;<br/>\n<br/>\n </span></blockquote>Just wanted to note that seizures aren&#39;t this clear-cut. There are<br/>\nparameters for seizures and driving. I have a friend with petit mal<br/>\nseizures, considered epileptic, and he is allowed to drive as long as he<br/>\ntakes his medication. There is a variety of treatments and medications for<br/>\nthe variety of seizure disorders,  from no treatment at all to heavy-duty<br/>\ndrugs. A person could have a seizure disorder and not know it, and it could<br/>\nbecome evident through something like flicking lights or TV.<br/>\n<br/>\nJacki, whose oldest had lots of petit mal seizures as a young child, shown<br/>\non an eeg, but never took anything and grew out of them...tv-watching still<br/>\nunlimited, self-regulating still occurred.</div>","specialLinks":[]},{"userId":74604204,"authorName":"Deb Lewis","from":"Deb Lewis &lt;ddzimlew@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: ideas, facts, thoughts, and feelings","postDate":"1155732725","msgId":26814,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwODE2LjA2NTIwNi4yNTQ0LjAuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":26813,"nextInTopic":26817,"prevInTime":26813,"nextInTime":26815,"topicId":26700,"numMessagesInTopic":0,"msgSnippet":"***There are many forms of epilepsy, many of them do not cause that kind of seizure .*** My mom began having seizures during a recent illness and they seem to","messageBody":"<div id=\"ygrps-yiv-1468548227\">***There are many forms of epilepsy, many of them do not cause that kind<br/>\nof &quot;seizure&quot;.***<br/>\n<br/>\nMy mom began having seizures during a recent illness and they seem to be<br/>\ncontinuing.  She becomes perfectly still and makes a snoring/blowing<br/>\nsound, pupils dilate and when it&#39;s over she pees herself.   I took care<br/>\nof a woman for a couple of weeks whose seizures took the form of eerie<br/>\nhumming and hand motions.    <br/>\n<br/>\nI hope you don&#39;t have a seizure disorder because there&#39;s a risk to anti<br/>\nseizure medications and they can cause birth defects and if you have<br/>\nseizures they won&#39;t let you drive anymore and it could complicate you<br/>\nbeing alone with your kid.    <br/>\n<br/>\nBut lots of people stare, myself included.  I sometimes stare until the<br/>\nscreen saver comes on.  My screen saver is set to start after three<br/>\nminutes but I can adjust it if I want to stare longer. &lt;g&gt;  Last time we<br/>\nwent camping I stared at the camp fire for an hour, just sitting and<br/>\nstaring and quiet.  I could have spent a lot of money and a week at a spa<br/>\nfor that kind of relaxation.   I knew a recovering alcoholic who stared;<br/>\nit&#39;s apparently common during symptoms of alcohol withdrawal, too.   Some<br/>\npeople in deep thought stare.   Some people who consistently don&#39;t get<br/>\nenough sleep stare.  Some people who are depressed stare. <br/>\n<br/>\nIt&#39;s so common a thing in the brains of humans that we have slang<br/>\nterminology for it.  Spacing out.  Zoning out.  <br/>\n<br/>\nIf I was zoning out more often than I thought was normal I&#39;d check my<br/>\nwater intake and my fuel consumption.  Food helps almost everything. &lt;g&gt; <br/>\n My employer crashes about four in the afternoon and she resolves it with<br/>\na bottle of water and a handful of peanuts.  Without her &quot;fix&quot; she will<br/>\nsit and stare.   Isn&#39;t that why the Brits embraced High Tea?  <br/>\n<br/>\nSome people can get comfortable with the way they are and understand<br/>\neveryone has quirks and sensitivities and some people look for things to<br/>\nbe wrong.   Some people haven&#39;t examined their lives enough to understand<br/>\nwhat residual emotional pain might be contributing to their seemingly<br/>\nautomatic behaviors.   Some people never think about consciously<br/>\naddressing those things about themselves that could use attention.  Some<br/>\npeople think they&#39;re more interesting if their different or sick.    <br/>\n<br/>\n***I do think that if parents notice unusual behaviours in their<br/>\nchildren,<br/>\nlike watching TV to the point of being in a &#39;trance&#39;, then they might<br/>\nget some tests done,***<br/>\n<br/>\nPeople already do that and kids are medicated into conformity.   If they<br/>\ndon&#39;t read enough, if they don&#39;t sit still long enough, if they aren&#39;t<br/>\nquiet when we want them to be, if they aren&#39;t busy when we want them to<br/>\nbe, if they seem angry, if they&#39;re too energetic, if they draw pictures<br/>\nwe don&#39;t like, if they want foods we don&#39;t want them to have...<br/>\n<br/>\nWe don&#39;t get to be inside the heads of our kids.  They have a right to<br/>\nthink their own thoughts and feel their own feelings and we don&#39;t have<br/>\nany right to know exactly what our kids are thinking and feeling at all<br/>\ntimes. We might wish we had ownership of their brains and that we could<br/>\nturn over little bits of it to them if they could prove they would use it<br/>\nthey way we want them to, but what&#39;s inside their head belongs to them. <br/>\nIf a kid is deeply engrossed in something on TV and the mom doesn&#39;t<br/>\nunderstand why someone would watch it, let alone watch with deep interest<br/>\nthat doesn&#39;t mean the kid is in a trance.   The kids who are made to feel<br/>\nlike something is wrong with them become psychologically altered by the<br/>\nintervention.   They hand over responsibility of themselves and their<br/>\nactions to a diagnosis.  They feel and internalize a &quot;disorder&quot; that<br/>\nisn&#39;t real.   <br/>\n<br/>\nDeb L</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: ideas, facts, thoughts, and feelings","postDate":"1155659039","msgId":26813,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZBNzMwQzQwLTc0QjQtNEI4NS04QkE1LUE4MjhCNTZDNkM4MkBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDIwMDYwODE1MDkxNTA4Ljc3NjczLnFtYWlsQHdlYjMyODEyLm1haWwubXVkLnlhaG9vLmNvbT4=","referencesHeader":"PDIwMDYwODE1MDkxNTA4Ljc3NjczLnFtYWlsQHdlYjMyODEyLm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":26812,"nextInTopic":26814,"prevInTime":26812,"nextInTime":26814,"topicId":26700,"numMessagesInTopic":0,"msgSnippet":"-=-Actually, I can and do, on occasion, stare without moving at my computer screen saver for an hour or more. -=- Does your daughter? If this is a problem in","messageBody":"<div id=\"ygrps-yiv-1086217827\">-=-Actually, I can and do, on occasion, stare without moving at my<br/>\ncomputer screen saver for an hour or more. -=-<br/>\n<br/>\nDoes your daughter?<br/>\n<br/>\nIf this is a problem in you, maybe get a TV for her and some therapy  <br/>\nfor you.  But the therapy might be &quot;Stand up and walk if you know  <br/>\nyou&#39;re just sitting there staring.&quot;<br/>\n<br/>\n-=-Obviously, I was staring at<br/>\nit for long enough for the screen saver to start up in the first  <br/>\nplace.-=-<br/>\n<br/>\nStaring without reading or moving your hands?  Staring and thinking  <br/>\nabout something else?  Asleep?  Screensavers don&#39;t usually take an  <br/>\nhour to turn on.<br/>\n<br/>\n-=-Generally, because the computer is more &#39;interactive&#39; than a TV,  <br/>\nwhich<br/>\nis usually pretty passive, I can avoid this.-=-<br/>\n<br/>\nI haven&#39;t found TV to be so passive with my kids or with me.   <br/>\nEspecially if I&#39;m watching with someone else, we&#39;re interacting about  <br/>\nwhat we&#39;re seeing.<br/>\n<br/>\n-=-I can&#39;t stand electrical noise, like if the screen is left on  <br/>\nafter the<br/>\ncomputer is turned off, the noise drives me crazy (most people can&#39;t<br/>\neven hear it). Flourescent lights make me feel ill in a nervous kind<br/>\nof way. -=-<br/>\n<br/>\nI&#39;m that way about a lot of little sounds others don&#39;t hear.  There  <br/>\nare places and things I avoid.  If someone&#39;s going to use nail  <br/>\nclippers, I leave the building (or get at least two rooms away).  I  <br/>\ncannot be in the room where someone else clips nails with nail  <br/>\nclippers.  Clipping my own isn&#39;t as bad, but I only do it after a  <br/>\nbath or shower, and I don&#39;t usually do toes AND fingers, just the  <br/>\nworst places and then I stop.<br/>\n<br/>\nBecause of that I could forbid nail clippers in my home, or refuse to  <br/>\nbuy them for people, or tell my family they could clip their nails at  <br/>\nother people&#39;s houses but not mine.<br/>\n<br/>\n-=-I often have the sensation of being very large or very small or<br/>\nvery far away from things, like my sense of spatial perception just had<br/>\na fit.-=-<br/>\n<br/>\nI know those things--other objects look far away, and the room  <br/>\ndistorts in your mind.<br/>\n<br/>\nThat can be from lack of protein.  Are you vegetarian, or do you not  <br/>\neat very often?  Try to see if that&#39;s happening when you&#39;re hungry.   <br/>\nAlso breathe more deeply more often.  Shallow breathing for too long  <br/>\nat a time can make one &quot;light-headed&quot; and light headedness can bring  <br/>\nthose kinds of perceptual oddities.  If you breathe deeply a few  <br/>\ntimes each half hour or so, and if you have a small protein snack (an  <br/>\negg, a handful of nuts, an ounce of cheese) every two hours or so, I  <br/>\nbet that will decrease or go away completely.<br/>\n<br/>\n-=-I do think that if parents notice unusual behaviours in their  <br/>\nchildren,<br/>\nlike watching TV to the point of being in a &#39;trance&#39;, then they might<br/>\nget some tests done,-=-<br/>\n<br/>\nNO!  Absolutely not.  Because being intensely  involved in hearing a  <br/>\nstoryteller or listening to live music or reading a book can produce  <br/>\nwhat appears to others to be like a trance, but being &quot;entranced&quot; by  <br/>\nsomething isn&#39;t epilepsy.  It&#39;s an intense interest that some people  <br/>\nnever really experience.  And it&#39;s a wonderful thing.   And just  <br/>\nbecause the people outside you can&#39;t see what you&#39;re thinking or hear  <br/>\nwhat you&#39;re hearing or feel what you&#39;re feeling doesn&#39;t mean you&#39;re  <br/>\n&quot;doing nothing.&quot;<br/>\n<br/>\n-=-My parents didnt notice this in me growing up because they werent  <br/>\nthere<br/>\nmost of the time, unschooling parents would definately notice something<br/>\nlike that in their child.-=-<br/>\n<br/>\n From the things you&#39;re writing, it seems you&#39;re having a hard time  <br/>\nseeing your child directly, but you&#39;re seeing her through a filter of  <br/>\nyour experiences and fears and justifications.<br/>\n<br/>\nIf you really can sit in front of a computer for an hour in a trance,  <br/>\nwhere is she during that time?  Can you spend more time with her  <br/>\nseeing what she really likes and wants and needs?<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":109103970,"authorName":"lerato majikfaerie","from":"lerato majikfaerie &lt;elamajikfaerie@...&gt;","profile":"elamajikfaerie","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: ideas, facts, thoughts, and feelings","postDate":"1155633308","msgId":26812,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwODE1MDkxNTA4Ljc3NjczLnFtYWlsQHdlYjMyODEyLm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":26804,"nextInTopic":26813,"prevInTime":26811,"nextInTime":26813,"topicId":26700,"numMessagesInTopic":0,"msgSnippet":"I shall let you know, when i know more. Deb, sorry you feel that way. There are many forms of epilepsy, many of them do not cause that kind of seizure . (I ve","messageBody":"<div id=\"ygrps-yiv-139407053\">I shall let you know, when i know more.<br/>\nDeb, sorry you feel that way.<br/>\nThere are many forms of epilepsy, many of them do not cause that kind<br/>\nof &quot;seizure&quot;.<br/>\n(I&#39;ve been on my google all morning)<br/>\nActually, I can and do, on occasion, stare without moving at my<br/>\ncomputer screen saver for an hour or more.  Obviously, I was staring at<br/>\nit for long enough for the screen saver to start up in the first place.<br/>\n Generally, because the computer is more &#39;interactive&#39; than a TV, which<br/>\nis usually pretty passive, I can avoid this.<br/>\n<br/>\nI can&#39;t stand electrical noise, like if the screen is left on after the<br/>\ncomputer is turned off, the noise drives me crazy (most people can&#39;t<br/>\neven hear it).  Flourescent lights make me feel ill in a nervous kind<br/>\nof way. I often have the sensation of being very large or very small or<br/>\nvery far away from things, like my sense of spatial perception just had<br/>\na fit.  I have a LOT of deja vu and some sensory hallucinations, like<br/>\nsmells that arent there. I can just stop suddenly and stand,<br/>\nmotionless, thoughtless for half a minute or more without noticing.<br/>\n<br/>\nI do think that if parents notice unusual behaviours in their children,<br/>\nlike watching TV to the point of being in a &#39;trance&#39;, then they might<br/>\nget some tests done, but I wouldnt want to scare parents with visions<br/>\nof epileptic fits just because their kids watch a lot of TV.<br/>\nMy parents didnt notice this in me growing up because they werent there<br/>\nmost of the time, unschooling parents would definately notice something<br/>\nlike that in their child.<br/>\n<br/>\nEla<br/>\n<br/>\n<br/>\n\t\t<br/>\n____________________________________________________ <br/>\nOn Yahoo!7 <br/>\nThe new Yahoo!7 home page - scan your email inbox, start an IM conversation or update your blog <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://au.yahoo.com/\">http://au.yahoo.com/</a></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] age difference","postDate":"1155512092","msgId":26804,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxM0M1RjA0LTU0QkYtNEE1My1COEUyLUZFMUM5M0EzNUM3QUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDAwMGEwMWM2YmYyZSQyOTc3OGY2MCQ2MTAxYThjMEBTUEFNPg==","referencesHeader":"PDAwMGEwMWM2YmYyZSQyOTc3OGY2MCQ2MTAxYThjMEBTUEFNPg=="},"prevInTopic":26802,"nextInTopic":26812,"prevInTime":26803,"nextInTime":26805,"topicId":26700,"numMessagesInTopic":0,"msgSnippet":"-=-I really did think this list was for help, not just for confirmed radicals to share stories.-=- Many people are helped by the stories of confirmed radicals.","messageBody":"<div id=\"ygrps-yiv-1057887254\">-=-I really did think this list was for help, not just for confirmed<br/>\nradicals to share stories.-=-<br/>\n<br/>\nMany people are helped by the stories of confirmed radicals.<br/>\n<br/>\n-=-Can&#39;t you just hand out the wisdom without the condescending bs?-=-<br/>\n<br/>\nI can share stories, as a confirmed radical.  It&#39;s not bullshit.  Not  <br/>\nsure it&#39;s wisdom, but I&#39;m sure it&#39;s not bullshit.<br/>\n<br/>\n-=-Can&#39;t I just get a simple answer, -=-<br/>\n<br/>\nHow much would you pay for a simple answer?<br/>\nWhere would you go to get one?  Child psychologist?  Policeman?<br/>\n<br/>\nBecause for FREE I think there were half a dozen stories told by  <br/>\npeople who did have experience, and potential reasons for the woman&#39;s  <br/>\nobjection.  I thought the responses were quick and good.<br/>\n<br/>\nWhat we cannot do is state a rule that can be carried back to the  <br/>\nother mom to make her change her mind.  There isn&#39;t a rule that says  <br/>\nshe has to let anyone else&#39;s kid visit.<br/>\n<br/>\nA request for a simple answer and complaints about complicated answer  <br/>\nwhich are (if you&#39;re LUCKY, stories from confirmed radicals) seems to  <br/>\nme to be someone saying &quot;I don&#39;t want to think about this or  <br/>\nunderstand it, just TELL me.&quot;<br/>\n<br/>\n-=-I try REALLY, REALLY hard to not say the wrong thing, step  <br/>\nlightly, use<br/>\nthe right words the first time (because God knows there is no going<br/>\nback).-=-<br/>\n<br/>\nThat&#39;s good in any situation, isn&#39;t it?  Shouldn&#39;t all of life be  <br/>\nthat way?<br/>\n<br/>\nI just got back from a wedding.  There were social complications  <br/>\nprior to this.  There were many friends of the ex boyfriend,  <br/>\nrelatives who liked him better than this guy, people wanting this to  <br/>\nwork, but still... there was more mystery and tension than most other  <br/>\nweddings that don&#39;t involve shotguns (real or figurative).   People  <br/>\nwere trying hard not to say the wrong thing, to step lightly and use  <br/>\nthe right words the first time.<br/>\n<br/>\n<br/>\n-=-Can&#39;t you just hand out the wisdom without the condescending bs?-=-<br/>\n<br/>\nThis list isn&#39;t for the handing out of wisdom.  It&#39;s not a drive  <br/>\nthrough window.  It&#39;s a place for people who want to examine  <br/>\nunschooling deeply and carefully can learn.  Some learn fast and some  <br/>\nlearn slowly, but   I didn&#39;t think many wanted to be taught, or  <br/>\ndelivered simple wisdom quick by Friday.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":248194505,"authorName":"Rod Thomas","from":"&quot;Rod Thomas&quot; &lt;rodneykathy@...&gt;","profile":"flyerkat","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [AlwaysLearning] age difference","postDate":"1155510840","msgId":26802,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMGEwMWM2YmYyZSQyOTc3OGY2MCQ2MTAxYThjMEBTUEFNPg==","inReplyToHeader":"PEE1MTU3REQzLTMyNTYtNDZCRS1BODRDLUE0N0NENTkwNTc4MkBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":26801,"nextInTopic":26804,"prevInTime":26801,"nextInTime":26803,"topicId":26700,"numMessagesInTopic":0,"msgSnippet":" I just wanted advice on a simple question.  The other parent is the one","messageBody":"<div id=\"ygrps-yiv-173148772\">&lt;&lt;&lt;&lt;What kind of answer do you want?<br/>\nIf you want rules, you came to the wrong list!&gt;&gt;&gt;&gt;<br/>\n<br/>\nI just wanted advice on a simple question.  The other parent is the one<br/>\nwith the age difference problem.  I thought you all might know of an<br/>\nangle this mother is thinking of that I hadn&#39;t considered. Can&#39;t I just<br/>\nget a simple answer, without the arrogance, implied stupidity?<br/>\n<br/>\nI try REALLY, REALLY hard to not say the wrong thing, step lightly, use<br/>\nthe right words the first time (because God knows there is no going<br/>\nback).<br/>\n<br/>\nCan&#39;t you just hand out the wisdom without the condescending bs?  I<br/>\nsense frustration.  That last exchange with Ela was brutal.<br/>\n<br/>\nI really did think this list was for help, not just for confirmed<br/>\nradicals to share stories.<br/>\n<br/>\nI have gained a lot from other posters.  But at this point I should look<br/>\nelsewhere for what I need.  No response necessary.<br/>\n<br/>\nFlyerkat</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: ideas, facts, thoughts, and feelings","postDate":"1155510425","msgId":26801,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkwNTEwNEIzLUJBQkEtNDMzQS1BRkFELUNCQjI1MDk1MDVEQkBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDIwMDYwODEzMTUzOTE2Ljg5MjMwLnFtYWlsQHdlYjMyODAzLm1haWwubXVkLnlhaG9vLmNvbT4=","referencesHeader":"PDIwMDYwODEzMTUzOTE2Ljg5MjMwLnFtYWlsQHdlYjMyODAzLm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":26800,"nextInTopic":26802,"prevInTime":26800,"nextInTime":26802,"topicId":26700,"numMessagesInTopic":0,"msgSnippet":"-=-It s an idea group and is intended to lean more toward pure unschooling than neutral, general homeschooling discussion—there are hundreds of general ","messageBody":"<div id=\"ygrps-yiv-1575769174\">-=-It&#39;s an<br/>\nidea group and is intended to lean more toward pure unschooling than<br/>\nneutral, general homeschooling discussion�there are hundreds of general<br/>\nhomeschooling discussions for newcomers.-=-<br/>\n<br/>\nThe mention of how many general discussions for newcomers was  <br/>\nintended to contrast this with those.<br/>\n<br/>\nI could make it clearer, I suppose.<br/>\nI don&#39;t mind new unschoolers who want to read and think and talk  <br/>\nabout how learning works.  I definitely don&#39;t want it to be anything  <br/>\nlike &quot;Which states are good to move to&quot; or &quot;How do I register in  <br/>\nFlorida.&quot;<br/>\n<br/>\n-=-Anyway, All this discussion did teach me a lot, and also got me<br/>\nthinking about my TV problem (which is not an addiction in the sence<br/>\nthat I get withdrawls and cravings for it, but if there&#39;s a TV on in<br/>\nthe room I Physically (almost) cannot tear my eyes from it). So I went<br/>\nto my doctor today, I&#39;m going to be tested for some form of epilepsy<br/>\nthat could be causing such a problem (I&#39;m also showing other typical<br/>\nsymptoms).-=-<br/>\n<br/>\nLet us know, when you know more, which form of epilepsy sticks people  <br/>\nto the TV.<br/>\nIt would be worth knowing that there could be something like that  <br/>\nthat parents could test their TV-watching kids for.<br/>\nMaybe there&#39;s medication.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":109103970,"authorName":"lerato majikfaerie","from":"lerato majikfaerie &lt;elamajikfaerie@...&gt;","profile":"elamajikfaerie","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: ideas, facts, thoughts, and feelings","postDate":"1155483556","msgId":26800,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwODEzMTUzOTE2Ljg5MjMwLnFtYWlsQHdlYjMyODAzLm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":26789,"nextInTopic":26801,"prevInTime":26799,"nextInTime":26801,"topicId":26700,"numMessagesInTopic":0,"msgSnippet":"Well, I must say, when I first started searching and researching on the web about unschooling, finding Sandra s website and a seeminly endless list of yahoo","messageBody":"<div id=\"ygrps-yiv-1178109113\">Well, I must say, when I first started searching and researching on the<br/>\nweb about unschooling, finding Sandra&#39;s website and a seeminly endless<br/>\nlist of yahoo and google groups and tribes... I joined most all of the<br/>\ngroups I could find and lurked around till I found ones that I felt<br/>\nwere appropriate to me.<br/>\nAt first and even second glance, a lot of them look more-or-less very<br/>\nsimilar, I am on Always Unschooled.  I did read the main page of<br/>\nAlwaysLearning, and it just doesnt mention anything about being an<br/>\n&quot;experienced&quot; unschoolers&#39; list.  it says:<br/>\n<br/>\nDiscussion for homeschooling fans of John Holt, whose books Learning<br/>\nAll the Time, Never Too Late, and Teach your Own have made unschooling<br/>\na sweet and viable option for thousands of families. This is a<br/>\nmoderated group, with trapdoors for the uncooperative. (Not moderated<br/>\nin the advance-approval way, but in the be-nice-to-play way.) It&#39;s an<br/>\nidea group and is intended to lean more toward pure unschooling than<br/>\nneutral, general homeschooling discussionthere are hundreds of general<br/>\nhomeschooling discussions for newcomers. It&#39;s to focus more toward how<br/>\npeople learn no matter where in the world they are, rather than on<br/>\nwhat&#39;s legal in any particular country or jurisdiction. If you have<br/>\nquestions or complaints, write to...<br/>\n<br/>\nPerhaps you like to edit it to mention something about being more for<br/>\nexperienced folk.  If I&#39;d known that, I probably would have held off on<br/>\nposting.<br/>\n<br/>\nAnyway, All this discussion did teach me a lot, and also got me<br/>\nthinking about my TV problem (which is not an addiction in the sence<br/>\nthat I get withdrawls and cravings for it, but if there&#39;s a TV on in<br/>\nthe room I Physically (almost) cannot tear my eyes from it). So I went<br/>\nto my doctor today, I&#39;m going to be tested for some form of epilepsy<br/>\nthat could be causing such a problem (I&#39;m also showing other typical<br/>\nsymptoms).<br/>\n<br/>\nSo thanks for everything, I&#39;ll just go back to my lurking ;-)<br/>\n<br/>\nEla<br/>\n<br/>\n<br/>\n\t\t<br/>\n____________________________________________________ <br/>\nOn Yahoo!7 <br/>\nPhotos: Unlimited free storage  keep all your photos in one place! <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://au.photos.yahoo.com\">http://au.photos.yahoo.com</a></div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: age difference","postDate":"1155395573","msgId":26789,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVia3I1bCtvOHBqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwMDIwMWM2YmQ4ZSQ2MTZiMzc2MCQ2MTAxYThjMEBTUEFNPg=="},"prevInTopic":26788,"nextInTopic":26800,"prevInTime":26788,"nextInTime":26790,"topicId":26700,"numMessagesInTopic":0,"msgSnippet":"... said ... 1/2 ... My dd s a lot younger (5) but she has friends who range in age from 2.5 to 26! Part of the school-mindset that has pervaded our culture is","messageBody":"<div id=\"ygrps-yiv-1598218432\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Rod Thomas&quot; <br/>\n&lt;rodneykathy@...&gt; wrote:<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; My son was going to visit and stay over with a friend and his mom <br/>\n </span></blockquote>said<br/>\n<blockquote><span title=\"ireply\"> &gt; no, that her son needs to find friends his own age.  My son is 13 <br/>\n </span></blockquote>1/2<br/>\n<blockquote><span title=\"ireply\"> &gt; and hers is 16 (in one week).<br/>\n<br/>\n </span></blockquote>My dd&#39;s a lot younger (5) but she has friends who range in age from <br/>\n2.5 to 26! Part of the school-mindset that has pervaded our culture <br/>\nis that kids &quot;need&quot; to be with same-age peers. It&#39;s not true, but it <br/>\ncan be hard to argue with, if someone has really bought into it. <br/>\n<br/>\nIt&#39;s also possible, under the circumstances, that the mom was <br/>\nconcerned that she was going to be &quot;babysitting&quot; a younger kid - <br/>\nhave the boys hung out together at her house before? How much time <br/>\nhave y&#39;all spent hanging out with them as a family? Would the boys <br/>\nbe willing to hang out at y&#39;all&#39;s house instead? Maybe the issue <br/>\nisn&#39;t really age but something else and mom is just pulling out <br/>\na &quot;truism&quot; as a quick-and-dirty &quot;reason&quot;. Coming at the issue from a <br/>\ndifferent angle may be more helpful in terms of facilitating the <br/>\nboys spending time together.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":2523747,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: ideas, facts, thoughts, and feelings","postDate":"1155391184","msgId":26788,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY0RTc2QjY2LTdDMUQtNDk0MC05MTY2LTFCQjQ1MUNCODdENUBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGViajdyMStxMmZwQGVHcm91cHMuY29tPg==","referencesHeader":"PGViajdyMStxMmZwQGVHcm91cHMuY29tPg=="},"prevInTopic":26783,"nextInTopic":26789,"prevInTime":26787,"nextInTime":26789,"topicId":26700,"numMessagesInTopic":0,"msgSnippet":"... I assume they re picturing their children living as adults in the third world societies they re growing up in, yes? Or do they feel it s equally likely","messageBody":"<div id=\"ygrps-yiv-991702118\">On Aug 11, 2006, at 8:36 PM, elamajikfaerie wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  Being<br/>\n&gt; there 100% to support them without getting in the way.  Letting them<br/>\n&gt; involve themselves in real life. Providing a loving and nurturing<br/>\n&gt; home. In a nutshell.<br/>\n<br/>\n&gt; That is what these families I mentioned are doing. That is what I am<br/>\n&gt; doing, as best I can.<br/>\n<br/>\n </span></blockquote>I assume they&#39;re picturing their children living as adults in the  <br/>\nthird world societies they&#39;re growing up in, yes? Or do they feel  <br/>\nit&#39;s equally likely that their kids will follow in their parents&#39;  <br/>\nfootsteps as be a corporate lawyer in Paris?<br/>\n<br/>\nSome parents  *do* choose in America to live away from technology.  <br/>\nThey feel the advantages out weigh the disadvantages. They feel the  <br/>\ngood things they gain outweigh the good things they give up.<br/>\n<br/>\nThat&#39;s true of every choice we make. There are good parts and bad  <br/>\nparts of every choice. Good and bad parts of the choice we make. Good  <br/>\nand bad parts of the choices we reject. When we choose we choose  <br/>\n(hopefully!) because the good stuff we gain outweighs the good stuff  <br/>\nwe lose.<br/>\n<br/>\nUnschooling is the same. We could gain a chunk of free time during  <br/>\nthe day if we sent our kids to school. We could have the comforting  <br/>\nfeeling (the illusion ;-) that they are being well prepared by  <br/>\nexperts. We wouldn&#39;t have to work so hard to find activities and  <br/>\nfriends and be involved in their lives. We could give them access to  <br/>\nopportunities that many kids have fond memories of  that aren&#39;t  <br/>\neasily recreated outside of school: school newspaper, yearbook,  <br/>\nmarching band, cheerleading, school sports (in some areas). (I could  <br/>\ngo on. Though it was hard coming up with those ;-)<br/>\n<br/>\nMost unschoolers will say &quot;Yeah, but ...&quot; to that list. In many cases  <br/>\nunschoolers found something better. In some cases unschoolers decided  <br/>\nit&#39;s not as important as something else they&#39;ve gained.<br/>\n<br/>\n*Every* choice we make we give good things up. Even heroin. If there  <br/>\nweren&#39;t good parts of drugs and alcohol, no one would do them!<br/>\n<br/>\nI think if you were able to step back and look at your posts  <br/>\nobjectively, what you&#39;re trying to argue and get people to agree with  <br/>\nis that unschooling without TV is just as good as unschooling with  <br/>\nTV. And your supporting evidence is that TV is bad for you. That  <br/>\nthose in loving homes without technology grow up just fine. That she  <br/>\ncan have TV away from your home and TV-like things at home.<br/>\n<br/>\nPerhaps, for right now, the best thing for your family is to not have  <br/>\nTV while you work out your issues. The bad effect of having a TV  <br/>\ncould outweigh the good effect. That&#39;s personal to you and your  <br/>\nfamily. Only you can really know (though others can point out where  <br/>\nyou aren&#39;t be objective.) But I think it will help you think about  <br/>\nthe issue clearly if you accept that you *are* giving something  <br/>\nvaluable up. It will help you to look at the situation objectively  <br/>\nand see clearly what you&#39;re giving up to get something else (time to  <br/>\nwork out your problems with TV.)<br/>\n<br/>\nIt *won&#39;t* help you to try to get others to agree with you. It  <br/>\n*won&#39;t* help you to try to deny that what you&#39;re giving up isn&#39;t  <br/>\nimportant.<br/>\n<br/>\nIt will also help you see the situation clearly to see that you don&#39;t  <br/>\nhave years and years to work through your issues. At 3 my daughter  <br/>\nwasn&#39;t much interested in broadcast TV. She watched some videos and  <br/>\nmovies. But by 6 she had favorite shows. In between 3 and 6 she did  <br/>\nsome exploring and experimenting to find those shows.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: ideas, facts, thoughts, and feelings","postDate":"1155346907","msgId":26783,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFBNzE4REUxLTY1NTktNDFCMC1BNDhGLTVBMTJERkY0MDYwNkBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGViajdyMStxMmZwQGVHcm91cHMuY29tPg==","referencesHeader":"PGViajdyMStxMmZwQGVHcm91cHMuY29tPg=="},"prevInTopic":26782,"nextInTopic":26788,"prevInTime":26782,"nextInTime":26784,"topicId":26700,"numMessagesInTopic":0,"msgSnippet":"This probably seems crankier than it is.  I m calm, just frustrated. Maybe part of the problem here is that it s back to school time so we will have more new","messageBody":"<div id=\"ygrps-yiv-1372933180\">This probably seems crankier than it is.  I&#39;m calm, just frustrated.<br/>\nMaybe part of the problem here is that it&#39;s &quot;back to school time&quot; so  <br/>\nwe will have more new unschoolers.  I&#39;ve been assuming that people  <br/>\nwho join this list have read the intro at Yahoogroups, but there are  <br/>\nways to join directly (and there&#39;s one on my  main page, I see)  <br/>\nwithout knowing anything but someone said &quot;join this group.&quot;<br/>\n<br/>\nI don&#39;t mind having new unschoolers here, but if the list is  <br/>\ndominated by newcomers it loses the focus of experience.<br/>\n<br/>\n-=-Since I&#39;m NOT waiting to work on it, but actively seeking help, and<br/>\nimproving, then this question seems a little irrelevant.-=-<br/>\n<br/>\nI think most of the post was irrelevant, not being about unschooling  <br/>\nat all, but about defending particular statements that also weren&#39;t  <br/>\nreally about unschooling.<br/>\n<br/>\nThere are entire unschooling lists that are anti-TV, I&#39;ve been told.   <br/>\nIf anyone here knows of one, please post it here so Ela can check it  <br/>\nout and see if it feels more comfortable.<br/>\n<br/>\n-=-&gt; Do you seriously think, even a teensy bit, that anyone on this list<br/>\n<blockquote><span title=\"ireply\">  &gt; leaves a three year old home alone?<br/>\n &gt; A four or five year old?<br/>\n </span></blockquote>Do you seriously think that I think that?-=-<br/>\n<br/>\nThe way you worded what you wrote did seem that way.  You seemed to  <br/>\nbe apologizing for not leaving yours at home.  I don&#39;t want to argue  <br/>\nwith you about it, I was trying to point out that your way of asking  <br/>\nwas odd and seemed to suggest that others here DID leave theirs home,  <br/>\nbut you weren&#39;t ready to do that.<br/>\n<br/>\n-=-What do you, as unschoolers do, if your toddlers refuse to wear their<br/>\nseatbelts? -=-<br/>\n<br/>\nWhen the topic has come up people have told stories about like yours.<br/>\n<br/>\n-=-Is my GD method totally off-base? -=-<br/>\n<br/>\nI don&#39;t know what GD is, but  I was hoping to help you see that it&#39;s  <br/>\nnot about toddlers that you&#39;d ask a passenger to wear a seatbelt.   <br/>\nWouldn&#39;t you want ANYone in your car to wear a seatbelt?<br/>\n<br/>\n-=-not a question to answer<br/>\n<blockquote><span title=\"ireply\">  &gt; on the list, just to consider in light of principles and how they<br/>\n &gt; operate in regular life.-=-<br/>\n<br/>\n </span></blockquote>Seriously.  I was putting things out that you might want to consider,  <br/>\nprivately, quietly, not argue about.<br/>\n<br/>\n-=-Sorry, but I really dont understand what you mean by<br/>\n&quot;All of those have aspects that will make unschooling easier to do,<br/>\nbut they are not the things that happen after a family decides not to<br/>\nput a child in school at compulsory school age...&quot;<br/>\n-=-Could you perhaps rephrase or clarify this for me?-=-<br/>\n<br/>\nNursing a baby is what you would have done even if you were going to  <br/>\nput your child in school.<br/>\nThe things you&#39;re describing that you have done with your child are  <br/>\nthings you would be doing even if you were going to put your child in  <br/>\nschool, aren&#39;t they?<br/>\n<br/>\n-=-Why does my daughter&#39;s freedom go if I and her father die?<br/>\n3 of her 4 grandparents are retired and they are very open to our<br/>\n&quot;radical&quot; parenting ideas. I have every reason to believe that if we<br/>\ndie, they will care for her with unschooling.-=-<br/>\n<br/>\nThey can choose to give her freedom or they can choose not to.  The  <br/>\nstate can decide someone is giving a child too much freedom, and  <br/>\nremove the child from the home.  Parents have duties and  <br/>\nresponsibilities and can&#39;t delegate those entirely to the children.   <br/>\nThey can share generously, but the child doesn&#39;t have equal  <br/>\nresponsibilities or freedom.<br/>\n<br/>\nThat&#39;s not about unschooling either.  It&#39;s about clarity.<br/>\n<br/>\n-=-Sorry, I got a bit lost here,<br/>\n&quot;but it&#39;s less helpful for those without any real unschooling<br/>\nexperience not to tell us what we could be doing better or how<br/>\nunschooling can or does or should work.<br/>\nDid you mis-type one negative too many? I assume the &quot;not&quot; that comes<br/>\nbetween &quot;experience&quot; and &quot;to tell&quot; shouldnt be there. help me out<br/>\nhere if I&#39;m wrong.<br/>\n-=-<br/>\n<br/>\nYes.  I&#39;m sorry.  There was one negative too many.  What I meant was  <br/>\nplease don&#39;t post so much as you don&#39;t have much real experience and  <br/>\nyour posts are mostly argumentative and critical and defensive.  Your  <br/>\nresponse to that was to post a really, really long post.<br/>\n<br/>\n-=-I don&#39;t deign to make any assumption as to how people that I dont<br/>\nreally know will interpret my words. I am LEARNING how this group<br/>\ninterprets my words, and I&#39;m doing my best to make myself as clear as<br/>\npossible. -=-<br/>\n<br/>\nThis group probably doesn&#39;t interpret your words any special way.   <br/>\nMore likely people in most groups don&#39;t bother to really read and  <br/>\nanalyze things.  They just make friendly noise whether they read the  <br/>\nposts or not.  Because this group exists to be analytical, that&#39;s how  <br/>\nit goes here.  We&#39;ve never made anyone post; couldn&#39;t if we tried.   <br/>\nThere&#39;s no way to do it.<br/>\n<br/>\n-=-WHOA!!!! how can you say that? I let the very strange cockroach<br/>\ncomment slide-=-<br/>\n<br/>\nYou let my comment slide?  Here?  Thanks.<br/>\n<br/>\nYou&#39;re welcome to be on the list, but as it&#39;s intended for more  <br/>\nexperienced unschoolers I would appreciate it if you would hang back  <br/>\nfor a while.  When you do post, share stories about successes and  <br/>\ngood days and personal experiences with unschooling, please.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":177721839,"authorName":"Angela S.","from":"&quot;Angela S.&quot; &lt;game-enthusiast@...&gt;","profile":"autonomousangela","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [AlwaysLearning] age difference","postDate":"1155343752","msgId":26779,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNGMwMWM2YmRhOSQyMGMxMDA4MCQ2NTAwYThjMEBlYm9ueT4=","inReplyToHeader":"PDAwMDIwMWM2YmQ4ZSQ2MTZiMzc2MCQ2MTAxYThjMEBTUEFNPg=="},"prevInTopic":26777,"nextInTopic":26782,"prevInTime":26778,"nextInTime":26780,"topicId":26700,"numMessagesInTopic":0,"msgSnippet":" My girls (ages 9 and 11) have two friends","messageBody":"<div id=\"ygrps-yiv-1828294356\">&lt;What is the opinion on kids hanging out with other kids that may be 2 or<br/>\nmore years older or younger than them? &gt;<br/>\n<br/>\n <br/>\n<br/>\nMy girls (ages 9 and 11) have two friends who are both almost 14 and come<br/>\nplay here regularly.  It isn&#39;t a big deal at all.  They have a common<br/>\ninterest that draws them together.  <br/>\n<br/>\n <br/>\n<br/>\n <br/>\n<br/>\nAngela<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:game-enthusiast@...\">game-enthusiast@...</a><br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":109103970,"authorName":"elamajikfaerie","from":"&quot;elamajikfaerie&quot; &lt;elamajikfaerie@...&gt;","profile":"elamajikfaerie","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: ideas, facts, thoughts, and feelings","postDate":"1155343009","msgId":26782,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGViajdyMStxMmZwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEQ0MzZCQTQyLTlDNkQtNDlENi05MEVFLUU0OTlFQUVFMDNDMEBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":26779,"nextInTopic":26783,"prevInTime":26781,"nextInTime":26783,"topicId":26700,"numMessagesInTopic":0,"msgSnippet":"... of course, that s what I m here for, and what I m learning. ... I don t deign to make any assumption as to how people that I dont really know will","messageBody":"<div id=\"ygrps-yiv-998365980\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; The background information is interesting but it won&#39;t prevent the  <br/>\n&gt; need for being as clear as you can be when you&#39;re writing, and for  <br/>\n&gt; knowing that the purpose of the list is to examine ideas.<br/>\n&gt;<br/>\n </span></blockquote>of course, that&#39;s what I&#39;m here for, and what I&#39;m learning.<br/>\n <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If you&#39;re going to cling to what you meant to write instead of  <br/>\n&gt; accepting that what you post WILL be interpretted by people who see  <br/>\n&gt; it and respond to it, I don&#39;t think you&#39;ll enjoy this list.<br/>\n<br/>\n </span></blockquote>I don&#39;t deign to make any assumption as to how people that I dont<br/>\nreally know will interpret my words.  I am LEARNING how this group<br/>\ninterprets my words, and I&#39;m doing my best to make myself as clear as<br/>\npossible.  I think I&#39;m getting better, and I accept any tips that<br/>\nmight come my way.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; -=-I was talking about children who have loving homes, large extended<br/>\n&gt; families, plenty to eat, excellent quality of life, and fantastic<br/>\n&gt; education, without school. Children who are happy and healthy, who<br/>\n&gt; help in their family farming or fishing or weaving or whatever, as<br/>\n&gt; they like. Children who are loved and respected by their elders, who<br/>\n&gt; aren&#39;t &quot;seen and not heard&quot; or banished to play-rooms and day-care.<br/>\n&gt; Children who learn by watching and being a part of the world around<br/>\n&gt; them. -=-<br/>\n&gt; <br/>\n&gt; You don&#39;t live there, though, nor does your daughter.  I&#39;m not sure  <br/>\n&gt; anyone does.  Do you have a real-life place in mind, or is this an  <br/>\n&gt; idealized fantasy world?  That&#39;s a serious question you should ask  <br/>\n&gt; yourself, but you don&#39;t need to answer it on the list.<br/>\n<br/>\n </span></blockquote>WHOA!!!! how can you say that?  I let the very strange cockroach<br/>\ncomment slide, but you dont know where I live and you dont know where<br/>\nI have lived.  You do know that I lived for a long time in the third<br/>\nworld, I did say when I first brought it up in a previous post, which<br/>\nyou quoted from, &quot;I have a long experience living in the third world<br/>\nand seen loads of families...&quot;<br/>\n<br/>\nWhen i made this comment I was talking about real people in real<br/>\nplaces that I have been to.  I&#39;m mentioning specifically families I<br/>\nspent time with in Lesotho in Africa, in Laos in South East Asia and<br/>\nin Brazil. I was living in such an environment in Brazil when my<br/>\ndaughter was born.  I spent 5 years living in various places in the<br/>\nthird world.  Right now we live in Israel (currently trying to bomb<br/>\nitself into the thrid world ;) (and just to make sure its clear, that<br/>\n was a joke) )<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; As to  -=- Children ... who<br/>\n&gt; aren&#39;t &quot;seen and not heard&quot; or banished to play-rooms and day-care.<br/>\n&gt; Children who learn by watching and being a part of the world around<br/>\n&gt; them,-=-   you&#39;re not talking about unschoolers, either.<br/>\n<br/>\n </span></blockquote>No, I was comparing these wonderful children to the &quot;stereotype<br/>\nmainstream kids&quot;, thinking that it would highlight the similarity to<br/>\nwestern unschoolers.<br/>\nI really am under the impression that unschooling is not &#39;keeping kids<br/>\nfrom school&#39; (although unschoolers do not go to school), but allowing<br/>\nthem to learn how/ what/ when they like at their own pace.  Being<br/>\nthere 100% to support them without getting in the way.  Letting them<br/>\ninvolve themselves in real life. Providing a loving and nurturing<br/>\nhome. In a nutshell.<br/>\n<br/>\nThat is what these families I mentioned are doing. That is what I am<br/>\ndoing, as best I can.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Those without any real unschooling  <br/>\n&gt; experience can ask questions or tell applicable stories, but it&#39;s  <br/>\n&gt; less helpful for those without any real unschooling experience not to  <br/>\n&gt; tell us what we could be doing better or how unschooling can or does  <br/>\n&gt; or should work.<br/>\n<br/>\n </span></blockquote>Sorry, I got a bit lost here, <br/>\n&quot;but it&#39;s less helpful for those without any real unschooling<br/>\nexperience not to tell us what we could be doing better or how<br/>\nunschooling can or does or should work.<br/>\nDid you mis-type one negative too many?  I assume the &quot;not&quot; that comes<br/>\nbetween &quot;experience&quot; and &quot;to tell&quot; shouldnt be there.  help me out<br/>\nhere if I&#39;m wrong.<br/>\n<br/>\nI&#39;m working my way through reading everything at Sandradodd.com, as<br/>\nwell as everything I can get my hands on from Holt (difficult in<br/>\nIsrael, most online booksellers (including Amazon) wont ship out of<br/>\nprint books here and I cant really afford to import books too much) as<br/>\nwell as anything else I can find on unschooling.<br/>\n<br/>\nI agree that those with little experience shouldn&#39;t be doling out<br/>\nadvice on how to do things better or how unschooling works.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Contrary to warm feelings, nursing a baby isn&#39;t the same as  <br/>\n&gt; unschooling.  Nursing a baby is a great thing!  Attachment parenting  <br/>\n&gt; is a great thing.  Being a gentle, attentive parent is a great  <br/>\n&gt; thing.  All of those have aspects that will make unschooling easier<br/>\n&gt; to do, but they are not the things that happen after a family<br/>\n&gt; decides not to put a child in school at compulsory school age, or at <br/>\n&gt; the age all their neighbors are putting the toddlers into academic<br/>\n&gt; pre-schools.<br/>\n<br/>\n </span></blockquote>hang on, Sorry, but I really dont understand what you mean by <br/>\n&quot;All of those have aspects that will make unschooling easier to do,<br/>\nbut they are not the things that happen after a family decides not to<br/>\nput a child in school at compulsory school age...&quot;<br/>\n<br/>\nCould you perhaps rephrase or clarify this for me?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; -=-My dd has her freedom. I dont &quot;allow&quot; her to take it, or &quot;give&quot; it to<br/>\n&gt; her, I just dont stand in her way-=-<br/>\n&gt; <br/>\n&gt; That&#39;s your decision to make, and so you give it to her.  If you and  <br/>\n&gt; your husband die, her freedom goes with you.  Constructs that don&#39;t  <br/>\n&gt; reflect reality aren&#39;t helpful to people.<br/>\n<br/>\n </span></blockquote>Okay, so I&#39;m phrasing things wrong again... Learning to say it better,<br/>\nto think about things differently.  <br/>\nWhy does my daughter&#39;s freedom go if I and her father die? <br/>\n3 of her 4 grandparents are retired and they are very open to our<br/>\n&quot;radical&quot; parenting ideas.  I have every reason to believe that if we<br/>\ndie, they will care for her with unschooling.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Do you let adult passengers decide whether to wear their seatbelts?   <br/>\n&gt; Do you offer to tell them stories?  Again, not a question to answer  <br/>\n&gt; on the list, just to consider in light of principles and how they  <br/>\n&gt; operate in regular life.<br/>\n<br/>\n </span></blockquote>What do you, as unschoolers do, if your toddlers refuse to wear their<br/>\nseatbelts?  Is my GD method totally off-base?  <br/>\nAnd actually, I do offer to tell stories to adults.  I used to be a<br/>\ntravelling story-teller, before I had my dd. (though to be honest, the<br/>\nsituation of an adult refusing to wear a seat-belt never came up)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Do you seriously think, even a teensy bit, that anyone on this list  <br/>\n&gt; leaves a three year old home alone?<br/>\n&gt; A four or five year old?<br/>\n </span></blockquote>Do you seriously think that I think that? I was merely pointing out<br/>\nthat there are some things that my dd actually *doesnt* have &quot;freedom&quot;<br/>\nin.  if we drive, she MUST wear a seat belt.  If I go out, she MUST<br/>\ncome with me.  I just do my best to make these MUSTs happen without<br/>\nforcing.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If you have any  <br/>\n&gt; thoughts like that in your mind, please consider counseling.<br/>\n </span></blockquote>I DON&#39;T have thoughts like that, and I am seeing a therapist.  Its<br/>\nhelping a lot.<br/>\n<br/>\n  If your  <br/>\n<blockquote><span title=\"ireply\"> &gt; past traumas are all mixed up in you and you have healing to do  <br/>\n&gt; that&#39;s keeping you from seeing clearly, the best thing you could do  <br/>\n&gt; for your daughter would be to untangle as much of that confusion and  <br/>\n&gt; fear as you can, as soon as possible.<br/>\n<br/>\n </span></blockquote>As I said, I am working on it.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; -=-But for now I feel that for me the best thing<br/>\n&gt; is not to have a TV in the house, the same way that alcoholics choose<br/>\n&gt; not to have alcohol in their homes when they choose to heal  <br/>\n&gt; themselves.-=-<br/>\n&gt; <br/>\n&gt; I think it belittles alcoholism to compare it to a $100 appliance--a  <br/>\n&gt; radio with pictures. <br/>\n<br/>\n </span></blockquote>Okay, you think that, But I dont. I have a problem.  Alcohol doesnt<br/>\nneed a remote control with a mute and an off switch. It&#39;s even cheaper<br/>\nthan a TV, its just fermented juice. Just dont buy a drink. Switching<br/>\noff the TV is just as hard for me as not buying a drink is for<br/>\nalcoholics.  I know its just as hard, I have been a drug addict.  and<br/>\nI know I can beat this, but I also know that while I&#39;m working on it,<br/>\nit&#39;s better for me not to have a TV in my home.<br/>\n<br/>\nI know it&#39;s not a common addiction, but there are those that are<br/>\nsexaholics, those that are obsessive compulsive, those that are<br/>\naddicted to sniffing glue, to cigarettes, all kinds of people with<br/>\nserious addictions.  some physiological, all psychological.<br/>\n<br/>\nWhen I have had a TV in my home (and I have had one, and I know when I<br/>\nstay at my in-laws&#39; or my parents&#39; where there&#39;s TV, its VERY hard for<br/>\nme to stay away from it), I didnt take responsibility for myself. I<br/>\nsat staring, I skipped meals, skipped sleep, I got angry and<br/>\nfrustrated if anything interrupted me, I made excuses to my friends<br/>\nwhy I couldnt go and do things with them. I neglected myself and my life.<br/>\n<br/>\nFor me, being able to have a computer, and to managing to stay with my<br/>\nfamily where there is TV for weekends is a big improvement.  I&#39;m<br/>\nworking on it. Its a remarkable achievement, its a lot of work.<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; I JUST PLAN TO LIVE IT OUT HERE IN THIS BEAUTI-<br/>\n&gt; FUL PLACE AND STICK WITH MY A.A. MEETINGS.  I<br/>\n&gt; GOT SOBER HERE 12/23/76 AND A GREAT BUNCH OF<br/>\n&gt; US FROM BACK THEN ARE STILL AROUND AND GLAD<br/>\n&gt; I AM BACK.  A.A. IN NASHVILLE IS WONDERFUL TOO<br/>\n&gt; BUT IT WAS JUST TIME TO COME HOME IN SPITE OF<br/>\n&gt; HAVING NO CENTRAL VISION AND THE BLOOD AND<br/>\n&gt; BONE MARROW CANCER THAT SENT ME AWAT FROM<br/>\n&gt; THIS THIN AIR AND TOO HIGH FOR ME ALTITUDE.<br/>\n </span></blockquote>I agree, your friend&#39;s statement is beautiful.  She doesnt keep<br/>\nalcohol in her home.  Congratulations to her. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; There&#39;s not all that much on the internet to download, I don&#39;t  <br/>\n&gt; think.  <br/>\n </span></blockquote>Well, I have to correct you on that one.  You can download virtually<br/>\nany TV show. You can watch a lot of live and &#39;podcast&#39; stuff. Check<br/>\nout EMule for one of the more basic and widespread file sharing sites.<br/>\n<br/>\nShe can&#39;t go visiting by herself, as she&#39;s three.  Do you  <br/>\n<blockquote><span title=\"ireply\"> &gt; have an example of a place she&#39;s ever been where she could watch as  <br/>\n&gt; much TV as she likes?  Do you ever leave her at anyone else&#39;s house?   <br/>\n&gt; She&#39;s three.<br/>\n<br/>\n </span></blockquote>She sure does go visiting by herself (well, I or someone has to drop<br/>\nher off and pick her up). She has a couple of regular play-dates each<br/>\nweek where she goes to another child&#39;s home and stays there 5 hours or<br/>\nso.  The family are also AP and GD and leaning toward Unschooling<br/>\n(their kids aren&#39;t yet of school age).  They allow the kids to do as<br/>\nthey like.<br/>\n <br/>\nShe also spends a lot of time at her grandparents, where she is<br/>\nallowed to watch as much TV as she likes.  She even has her own room<br/>\nwith a TV in it there. We go there most weekends, for Friday night<br/>\ndinner and stay the weekend.  Sometimes I choose not to go, she goes<br/>\nwith her dad, sometimes she stays there without her father and I, at<br/>\nher request.  A lot of the time at the end of the weekend when we<br/>\nprepare to go home, she asks to stay, we let her. We come pick her up<br/>\nwhen she asks to come home, usually after a day or 2.<br/>\n<br/>\nSo far, she has never considered or questioned that we dont have a TV<br/>\nat home.  If/ When she does, we will talk with her openly about it. <br/>\nIf she wants a TV, we will get her one.<br/>\n  <br/>\n<blockquote><span title=\"ireply\"> &gt; How long would you wait to work on it if you felt unable to share  <br/>\n&gt; books with her?<br/>\n<br/>\n </span></blockquote>Since I&#39;m NOT waiting to work on it, but actively seeking help, and<br/>\nimproving, then this question seems a little irrelevant.<br/>\n<br/>\nEla</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] age difference","postDate":"1155336203","msgId":26777,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE1MTU3REQzLTMyNTYtNDZCRS1BODRDLUE0N0NENTkwNTc4MkBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDAwMDAwMWM2YmQ5MyQyNDcxZmM5MCQ2MTAxYThjMEBTUEFNPg==","referencesHeader":"PDAwMDAwMWM2YmQ5MyQyNDcxZmM5MCQ2MTAxYThjMEBTUEFNPg=="},"prevInTopic":26776,"nextInTopic":26779,"prevInTime":26776,"nextInTime":26778,"topicId":26700,"numMessagesInTopic":0,"msgSnippet":"-=-Is there a situation where you could see it being a potential problem?-=- What kind of answer do you want? If you want rules, you came to the wrong list! ","messageBody":"<div id=\"ygrps-yiv-80090210\">-=-Is there a situation where you could see it being a potential  <br/>\nproblem?-=-<br/>\n<br/>\nWhat kind of answer do you want?<br/>\n<br/>\nIf you want rules, you came to the wrong list!<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/rules\">http://sandradodd.com/rules</a><br/>\n<br/>\nThere is no rule on earth that will keep a kid safe.  If your child  <br/>\nis 13.5 and you find friends who were born the same day, will they be  <br/>\n&quot;safer&quot; than someone born three years earlier?  three yeard later?<br/>\n<br/>\nIf it&#39;s sexual maturity you&#39;re worried about, that doesn&#39;t come on  <br/>\nany schedule whatsoever.<br/>\n<br/>\nDo you want a guarantee that the other kid isn&#39;t jumpstarted by  <br/>\nsexual molestation?    Some people don&#39;t even realize or remember for  <br/>\nyears.   If Holly makes a friend today, he might be abused over the  <br/>\nweekend.<br/>\n<br/>\nThere are no guarantees.<br/>\n<br/>\nMaking rules only reduces people&#39;s ability to use good judgment and  <br/>\ngives them the false impression that rules create safety or that  <br/>\nchoices and good judgment can be avoided.<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":132859234,"authorName":"Paula Sjogerman","from":"Paula Sjogerman &lt;sjogy@...&gt;","profile":"psjogy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] age difference","postDate":"1155335842","msgId":26776,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE2NThFMzU4LUJFRjctNDRBRS1BRDhFLTgwMzU1OUFCMjAyM0BzYmNnbG9iYWwubmV0Pg==","inReplyToHeader":"PDAwMDIwMWM2YmQ4ZSQ2MTZiMzc2MCQ2MTAxYThjMEBTUEFNPg==","referencesHeader":"PDAwMDIwMWM2YmQ4ZSQ2MTZiMzc2MCQ2MTAxYThjMEBTUEFNPg=="},"prevInTopic":26774,"nextInTopic":26777,"prevInTime":26775,"nextInTime":26777,"topicId":26700,"numMessagesInTopic":0,"msgSnippet":"... My daughter s two best friends are two years older than her. My son, 12,  hangs with a group of boys on the block ages 13, 15, 16 and 16. No problem at","messageBody":"<div id=\"ygrps-yiv-1912967206\">On Aug 11, 2006, at 4:37 PM, Rod Thomas wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; What is the opinion on kids hanging out with other kids that may be  <br/>\n&gt; 2 or<br/>\n&gt; more years older or younger than them?<br/>\n<br/>\n<br/>\n </span></blockquote>My daughter&#39;s two best friends are two years older than her.<br/>\n<br/>\nMy son, 12,  hangs with a group of boys on the block ages 13, 15, 16  <br/>\nand 16.<br/>\n<br/>\nNo problem at all. That woman is limited.<br/>\n<br/>\n<br/>\nPaula<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] age difference","postDate":"1155334919","msgId":26774,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI0RTAyQkYxLUU3QTMtNDg4Qy1BQ0QwLTczNzcwMDdBRkQ3NkBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDAwMDIwMWM2YmQ4ZSQ2MTZiMzc2MCQ2MTAxYThjMEBTUEFNPg==","referencesHeader":"PDAwMDIwMWM2YmQ4ZSQ2MTZiMzc2MCQ2MTAxYThjMEBTUEFNPg=="},"prevInTopic":26773,"nextInTopic":26776,"prevInTime":26773,"nextInTime":26775,"topicId":26700,"numMessagesInTopic":0,"msgSnippet":"-=-What is the opinion on kids hanging out with other kids that may be 2 or more years older or younger than them?-=- We haven t had any problems with it. If","messageBody":"<div id=\"ygrps-yiv-1923730500\">-=-What is the opinion on kids hanging out with other kids that may  <br/>\nbe 2 or<br/>\nmore years older or younger than them?-=-<br/>\n<br/>\nWe haven&#39;t had any problems with it.<br/>\n<br/>\nIf that other kid goes to school, he&#39;s been told for years to leave  <br/>\nthe little kids alone.  They worry about bullying and sexual issues  <br/>\nwith kids at school.  We&#39;ve had kids hang out with others five years  <br/>\ndifferent and never any problems at all, but most of those kids were  <br/>\nalso homeschooled, or neighbors.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":248194505,"authorName":"Rod Thomas","from":"&quot;Rod Thomas&quot; &lt;rodneykathy@...&gt;","profile":"flyerkat","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [AlwaysLearning] age difference","postDate":"1155334309","msgId":26773,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDAwMWM2YmQ5MyQyNDcxZmM5MCQ2MTAxYThjMEBTUEFNPg==","inReplyToHeader":"PDlhYjE3ZDg4MTdhNTFmYTAyMmY5NjU0ZWQwZmUxMGJjQGNveC5uZXQ+"},"prevInTopic":26772,"nextInTopic":26774,"prevInTime":26772,"nextInTime":26774,"topicId":26700,"numMessagesInTopic":0,"msgSnippet":"Is there a situation where you could see it being a potential problem? ... It s interests, not age, that make friends.  Heck, I just went on a road trip to","messageBody":"<div id=\"ygrps-yiv-1426817598\">Is there a situation where you could see it being a potential problem?<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Aug 11, 2006, at 2:37 PM, Rod Thomas wrote:<br/>\n<br/>\n&gt; What is the opinion on kids hanging out with other kids that may be 2 <br/>\n&gt; or<br/>\n&gt; more years older or younger than them?<br/>\n&gt;<br/>\n&gt; My son was going to visit and stay over with a friend and his mom said<br/>\n&gt; no, that her son needs to find friends his own age.  My son is 13 1/2<br/>\n&gt; and hers is 16 (in one week).  I didn&#39;t want to press the issue but<br/>\n&gt;<br/>\n<br/>\n<br/>\nIt&#39;s interests, not age, that make friends.  Heck, I just went on a <br/>\nroad trip to Oregon for a horseback riding clinic with my 19 y.o. <br/>\ndaughter and my 64 y.o. horsey friend  (we let her rent the hotel <br/>\nrooms, since she has AARP discounts!). </span></blockquote></div>","specialLinks":[]},{"userId":166322738,"authorName":"Nancy Wooton","from":"Nancy Wooton &lt;nancywooton@...&gt;","profile":"ikonstitcher","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] age difference","postDate":"1155333255","msgId":26772,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlhYjE3ZDg4MTdhNTFmYTAyMmY5NjU0ZWQwZmUxMGJjQGNveC5uZXQ+","inReplyToHeader":"PDAwMDIwMWM2YmQ4ZSQ2MTZiMzc2MCQ2MTAxYThjMEBTUEFNPg==","referencesHeader":"PDAwMDIwMWM2YmQ4ZSQ2MTZiMzc2MCQ2MTAxYThjMEBTUEFNPg=="},"prevInTopic":26771,"nextInTopic":26773,"prevInTime":26771,"nextInTime":26773,"topicId":26700,"numMessagesInTopic":0,"msgSnippet":"... My 16 y.o. son s friends are either from park day and pretty close in age, or from Pokemon League.  Since he plays in the 14 and up category, he has","messageBody":"<div id=\"ygrps-yiv-1137442637\">On Aug 11, 2006, at 2:37 PM, Rod Thomas wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; What is the opinion on kids hanging out with other kids that may be 2 <br/>\n&gt; or<br/>\n&gt; more years older or younger than them?<br/>\n&gt;<br/>\n&gt; My son was going to visit and stay over with a friend and his mom said<br/>\n&gt; no, that her son needs to find friends his own age.  My son is 13 1/2<br/>\n&gt; and hers is 16 (in one week).  I didn&#39;t want to press the issue but<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>My 16 y.o. son&#39;s friends are either from park day and pretty close in <br/>\nage, or from Pokemon League.  Since he plays in the 14 and up category, <br/>\nhe has friends of all ages.  The guy he wants to invite over to spend <br/>\ntonight is 19.  One of the other players he visits often is the dad of <br/>\na kid in the 12 to 14 level; they&#39;ve all traveled together to places <br/>\nlike Las Vegas and Phoenix for tournaments.<br/>\n<br/>\nIt&#39;s interests, not age, that make friends.  Heck, I just went on a <br/>\nroad trip to Oregon for a horseback riding clinic with my 19 y.o. <br/>\ndaughter and my 64 y.o. horsey friend  (we let her rent the hotel <br/>\nrooms, since she has AARP discounts!).</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"TV again WAS: Re: ideas, facts, thoughts, and feelings","postDate":"1155332803","msgId":26771,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDODhCQTZDNTQ1MTlFOS1BOTAtNTM1QG1ibGstcjI0LnN5c29wcy5hb2wuY29tPg==","inReplyToHeader":"PGViZzQwdis3Zzh1QGVHcm91cHMuY29tPg=="},"prevInTopic":26770,"nextInTopic":26772,"prevInTime":26770,"nextInTime":26772,"topicId":26700,"numMessagesInTopic":0,"msgSnippet":"... From: elamajikfaerie@yahoo.com.au To be honest, I dont think it is, I have a long experience living in the third world and seen loads of families who are","messageBody":"<div id=\"ygrps-yiv-1157194776\">-----Original Message-----<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:elamajikfaerie@...\">elamajikfaerie@...</a><br/>\n<br/>\nTo be honest, I dont think it is, I have a long experience living in<br/>\nthe third world and seen loads of families who are &quot;unschooling&quot;<br/>\nwithout calling it that.  They&#39;re all just doing what everyone did<br/>\nbefore universal schooling was invented.  and the vast majority of<br/>\nthem do NOT have TV.  many dont even have electricity, let alone<br/>\ncomputers with internet access.  Many of these kids, without any<br/>\nschool, speak half a dozen languages, read and write, and have skills<br/>\nthat astound me (like that 4 year old who drives in India).<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nYeah---but is that where *you* live? If I lived there, I would make my <br/>\nchildren&#39;s worlds as big as I could *there*---without tv or video games <br/>\nor electricity even. But I don&#39;t. I live where all that stuff is <br/>\nreadily available. It&#39;s common, and it&#39;s stuff they like. I&#39;m not going <br/>\nto deprive them of something I&#39;m not wild about but that&#39;s readily <br/>\navailable.<br/>\n<br/>\nI don&#39;t like peas. I DO make them available for my boys because they <br/>\nlike them. There&#39;s almost always a can in the cupboard or a frozen <br/>\npackage in the freezer. It&#39;s available.<br/>\n<br/>\nI don&#39;t like Jazz, but I buy jazz CDs and DVDs and go to jazz bars with <br/>\nmy son because *he* likes them. I don&#39;t like cycling, but I bought my <br/>\nhusband his first bike (well, his first &quot;big boy&quot; bike! &lt;G&gt;), and I <br/>\nSAGed him and a friend when they went cycling the Natchez Trace last <br/>\nspring. I don&#39;t like Manga or ANime, but I buy and read Manga books to <br/>\nmy younger son, I bought him a costume to wear at the CosPlay funshop, <br/>\nand I painted his room in YuGiOh! characters.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nEven here in the West, lots of families dont have a computer at home,<br/>\nthey have to go to their local library to get online, they dont have<br/>\n a swimming pool, they have to make do with the public one, they dont<br/>\nhave a yard with a garden or an encyclopedia or a lot of books or all<br/>\nkinds of things.  They get this stuff outside the home, and that<br/>\ndoesnt mean it&#39;s being &quot;restricted&quot;.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\n*WHY* do they not have a computer? Because they can&#39;t afford it or <br/>\nbecause they are afraid of the gamma rays?<br/>\n*WHY* do they not have a swimming pool? Because they can&#39;t afford it or <br/>\nthey live where it&#39;s impractical or because pools have sharks?<br/>\n*WHY* do  they not have a garden? Because they couldn&#39;t afford a house <br/>\nwith a yard and garden or because gardens attract giant  grasshoppers?<br/>\n*WHY* do they not have encyclopedias---wait---Does *anyone* have <br/>\nencyclopedias any more? &lt;Bwg&gt;<br/>\n<br/>\nThe things IS: tv is soooo inexpensive. I can see not being able to <br/>\nafford a very high end computer, but there are plenty of old, cheap, or <br/>\nrebuilt ones for a song. Pools? HUGE expense---even if it came with the <br/>\nhouse. Yards and gardens? Lots of work and $$$ to maintain. <br/>\nEncyclopedias? Sorry---still laughing. &lt;g&gt; But tv is CHEAP. Really <br/>\ncheap.<br/>\n<br/>\nThe other stuff you mentioned can easily be excused with high cost. Tvs <br/>\nare cheap and an *excellent* way to receive information. We don&#39;t live <br/>\nwhere things like tv are cost-prohibitive. Cheap, cheap, cheap!<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\n They get this stuff outside the home, and that<br/>\ndoesnt mean it&#39;s being &quot;restricted&quot;.<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nSure. But are they *afraid* of those things? Third world doesn&#39;t always <br/>\nmean abject poverty---mostly is, but certainly not always---but it&#39;s <br/>\nthe FEAR FACTOR that&#39;s stopping you from having a TV.<br/>\n<br/>\nPeople are terrified that if they had unlimited access to M&Ms that <br/>\nthey would ONLY eat M&Ms. I have a challenge that several people have <br/>\ntaken me up on with incredible results: put a *large* bowl of M&Ms on <br/>\nyou kitchen counter or in your foyer. Keep it FULL! You may need to <br/>\nhave a drawer with 2-3 more bags nearby so that it&#39;s never, ever even <br/>\nhalf empty (or half-full---however you like to visualize it! &lt;G&gt;). <br/>\nChances are, the M&Ms will be quickly devoured the first few days. Keep <br/>\nit FULL, and I promise your consumption of M&Ms to go waaaay down to <br/>\nnext to nothing by the end of a month. I have two huge bowls out in my <br/>\nfoyer now---one with plain and peanut. One with dark chocolate M&Ms. I <br/>\nhaven&#39;t had one in days and days and days. My guests this week couldn&#39;t <br/>\nstop eating them! &lt;G&gt;<br/>\n<br/>\nI know that&#39;s not TV, but at the same time, you could do that too. Get <br/>\nyour absolute fill of TV---24/7. Eventually, you will not have that <br/>\nintense attraction. But I won&#39;t recommend that you try that with a <br/>\nthree year old in the house---she needs you too much! &lt;G&gt; I suggest <br/>\nthat with teens and with childless adults who feel that it is <br/>\naddictive. It&#39;s NOT. *YOU* get to choose. You really do. There&#39;s <br/>\nnothing on TV that can *make* you watch. Nothing.<br/>\n<br/>\nYou think it has some kind of control of you. It&#39;s because you&#39;ve <br/>\ndenied yourself TV for so long. When you turn it on, say, &quot;*I* get to <br/>\nchoose what to watch and when.&quot; It&#39;s a BOX! It doesn&#39;t have that <br/>\ncontrol. Only *YOU* do. ONLY YOU!<br/>\n<br/>\nThe restriction problem comes in the idea that it scares you. She&#39;ll <br/>\npick up on that. She&#39;ll know you&#39;re fearing sometihng that she finds <br/>\ndelight in. She&#39;s small enough to have difficulty <br/>\nunderstanding/comprehending that dichotomy.<br/>\n<br/>\nLose the fear. It&#39;s a BOX! *YOU* are the all-powerful OZ! &lt;G&gt;<br/>\n<br/>\nHell, you kicked HEROIN! You&#39;re scared of a damned box??? &lt;G&gt;<br/>\n<br/>\n~Kelly<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________________________________________________<br/>\nCheck out AOL.com today. Breaking news, video search, pictures, email <br/>\nand IM. All on demand. Always Free.</div>","specialLinks":[]},{"userId":248194505,"authorName":"Rod Thomas","from":"&quot;Rod Thomas&quot; &lt;rodneykathy@...&gt;","profile":"flyerkat","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"age difference","postDate":"1155332263","msgId":26770,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDIwMWM2YmQ4ZSQ2MTZiMzc2MCQ2MTAxYThjMEBTUEFNPg==","inReplyToHeader":"PEQ0MzZCQTQyLTlDNkQtNDlENi05MEVFLUU0OTlFQUVFMDNDMEBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":26769,"nextInTopic":26771,"prevInTime":26769,"nextInTime":26771,"topicId":26700,"numMessagesInTopic":0,"msgSnippet":"What is the opinion on kids hanging out with other kids that may be 2 or more years older or younger than them? My son was going to visit and stay over with a","messageBody":"<div id=\"ygrps-yiv-988680116\">What is the opinion on kids hanging out with other kids that may be 2 or<br/>\nmore years older or younger than them?<br/>\n<br/>\nMy son was going to visit and stay over with a friend and his mom said<br/>\nno, that her son needs to find friends his own age.  My son is 13 1/2<br/>\nand hers is 16 (in one week).  I didn&#39;t want to press the issue but<br/>\n<br/>\nFlyerkat</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: ideas, facts, thoughts, and feelings","postDate":"1155328430","msgId":26769,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQ0MzZCQTQyLTlDNkQtNDlENi05MEVFLUU0OTlFQUVFMDNDMEBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGViaWs4ditlYWs2QGVHcm91cHMuY29tPg==","referencesHeader":"PGViaWs4ditlYWs2QGVHcm91cHMuY29tPg=="},"prevInTopic":26768,"nextInTopic":26770,"prevInTime":26768,"nextInTime":26770,"topicId":26700,"numMessagesInTopic":0,"msgSnippet":"-=-So, in the hopes that there s not gonna be too many future mis-interpretations and such...-=- The background information is interesting but it won t prevent","messageBody":"<div id=\"ygrps-yiv-476351848\">-=-So, in the hopes that there&#39;s not gonna be too many future<br/>\nmis-interpretations and such...-=-<br/>\n<br/>\nThe background information is interesting but it won&#39;t prevent the  <br/>\nneed for being as clear as you can be when you&#39;re writing, and for  <br/>\nknowing that the purpose of the list is to examine ideas.<br/>\n<br/>\n-=-okay, again, Sandra, you have made an assumption way off the mark. No<br/>\nproblem. Perhaps I wasn&#39;t clear enough. &quot;Third world&quot; doesn&#39;t<br/>\nnecessarily mean poverty. in means that a country doesnt have a<br/>\nnational economy to match those in the &quot;first world&quot; (who happen to be<br/>\nthe ones doing the counting). It definatley does NOT mean &quot;without a<br/>\nfamily&quot;. Why did you assume I was talking about homeless kids living<br/>\nin poverty without a family?-=-<br/>\n<br/>\n1930 didn&#39;t necessarily mean poverty either, but to say &quot;During the  <br/>\nDepression&quot; is often shorthand for the reminder that people tended to  <br/>\nbe hungry, unemployed, and maybe dying of fever.<br/>\n<br/>\nSaying &quot;Pioneer days&quot; doesn&#39;t necessarily mean poverty either, but  <br/>\nonce that phrase is used, the reasonable assumption is that nobody&#39;s  <br/>\ntalking about a family living in a large stone house that&#39;s been  <br/>\nthere 300 years, with hundred year old trees and their great- <br/>\ngrandparents&#39; souvenirs in a trunk upstairs.<br/>\n<br/>\nIf you&#39;re going to cling to what you meant to write instead of  <br/>\naccepting that what you post WILL be interpretted by people who see  <br/>\nit and respond to it, I don&#39;t think you&#39;ll enjoy this list.<br/>\n<br/>\n-=-I was talking about children who have loving homes, large extended<br/>\nfamilies, plenty to eat, excellent quality of life, and fantastic<br/>\neducation, without school. Children who are happy and healthy, who<br/>\nhelp in their family farming or fishing or weaving or whatever, as<br/>\nthey like. Children who are loved and respected by their elders, who<br/>\naren&#39;t &quot;seen and not heard&quot; or banished to play-rooms and day-care.<br/>\nChildren who learn by watching and being a part of the world around<br/>\nthem. -=-<br/>\n<br/>\nYou don&#39;t live there, though, nor does your daughter.  I&#39;m not sure  <br/>\nanyone does.  Do you have a real-life place in mind, or is this an  <br/>\nidealized fantasy world?  That&#39;s a serious question you should ask  <br/>\nyourself, but you don&#39;t need to answer it on the list.<br/>\n<br/>\nAs to  -=- Children ... who<br/>\naren&#39;t &quot;seen and not heard&quot; or banished to play-rooms and day-care.<br/>\nChildren who learn by watching and being a part of the world around<br/>\nthem,-=-   you&#39;re not talking about unschoolers, either.<br/>\n<br/>\nSometimes we do mention mainstream modern western culture.  MOSTLY we  <br/>\nneed to talk about unschoolers.  Those without any real unschooling  <br/>\nexperience can ask questions or tell applicable stories, but it&#39;s  <br/>\nless helpful for those without any real unschooling experience not to  <br/>\ntell us what we could be doing better or how unschooling can or does  <br/>\nor should work.<br/>\n<br/>\nContrary to warm feelings, nursing a baby isn&#39;t the same as  <br/>\nunschooling.  Nursing a baby is a great thing!  Attachment parenting  <br/>\nis a great thing.  Being a gentle, attentive parent is a great  <br/>\nthing.  All of those have aspects that will make unschooling easier  <br/>\nto do, but they are not the things that happen after a family decides  <br/>\nnot to put a child in school at compulsory school age, or at the age  <br/>\nall their neighbors are putting the toddlers into academic pre-schools.<br/>\n<br/>\n-=-My dd has her freedom. I dont &quot;allow&quot; her to take it, or &quot;give&quot; it to<br/>\nher, I just dont stand in her way-=-<br/>\n<br/>\nThat&#39;s your decision to make, and so you give it to her.  If you and  <br/>\nyour husband die, her freedom goes with you.  Constructs that don&#39;t  <br/>\nreflect reality aren&#39;t helpful to people.<br/>\n<br/>\n-=-I do insist that we dont drive<br/>\nunless she&#39;s in her seat belt, but that generally means that I sit and<br/>\nwait patiently trying to find creative solutions to help her to be<br/>\nhappy in the seat belt on times that she&#39;s not into it, rather than<br/>\nforcing her into it. (ie, what if I tell you a story while you&#39;re in<br/>\nyour seat, or what if we paint your seat belt with nice colours? etc)-=-<br/>\n<br/>\nDo you let adult passengers decide whether to wear their seatbelts?   <br/>\nDo you offer to tell them stories?  Again, not a question to answer  <br/>\non the list, just to consider in light of principles and how they  <br/>\noperate in regular life.<br/>\n<br/>\n-=-I admit,<br/>\nat this age I&#39;m still not comfortable about leaving her home alone, so<br/>\nif she doesn&#39;t want to go where I&#39;m going...-=-<br/>\n<br/>\nDo you seriously think, even a teensy bit, that anyone on this list  <br/>\nleaves a three year old home alone?<br/>\nA four or five year old?<br/>\n<br/>\n-=-I do have a problem with TV, in the same way<br/>\nthat some have a probelm with alcohol. I had a quite abusive childhood<br/>\nand spent much of my teenage years heavily addicted to Heroin.-=-<br/>\n<br/>\nBut those things are not between your daughter and her need for input  <br/>\nand exposure to ideas, voices, music, stories.   Heroin didn&#39;t make  <br/>\nyou watch TV, nor did TV make you use heroin.  If you have any  <br/>\nthoughts like that in your mind, please consider counseling.  If your  <br/>\npast traumas are all mixed up in you and you have healing to do  <br/>\nthat&#39;s keeping you from seeing clearly, the best thing you could do  <br/>\nfor your daughter would be to untangle as much of that confusion and  <br/>\nfear as you can, as soon as possible.<br/>\n<br/>\n-=-But for now I feel that for me the best thing<br/>\nis not to have a TV in the house, the same way that alcoholics choose<br/>\nnot to have alcohol in their homes when they choose to heal  <br/>\nthemselves.-=-<br/>\n<br/>\nI think it belittles alcoholism to compare it to a $100 appliance--a  <br/>\nradio with pictures.  I have a friend who just wrote to me with this:<br/>\n<br/>\nI JUST PLAN TO LIVE IT OUT HERE IN THIS BEAUTI-<br/>\nFUL PLACE AND STICK WITH MY A.A. MEETINGS.  I<br/>\nGOT SOBER HERE 12/23/76 AND A GREAT BUNCH OF<br/>\nUS FROM BACK THEN ARE STILL AROUND AND GLAD<br/>\nI AM BACK.  A.A. IN NASHVILLE IS WONDERFUL TOO<br/>\nBUT IT WAS JUST TIME TO COME HOME IN SPITE OF<br/>\nHAVING NO CENTRAL VISION AND THE BLOOD AND<br/>\nBONE MARROW CANCER THAT SENT ME AWAT FROM<br/>\nTHIS THIN AIR AND TOO HIGH FOR ME ALTITUDE.<br/>\n<br/>\nDon&#39;t compare TV to alcoholism.  Alcohol doesn&#39;t have a remote  <br/>\ncontrol with a mute and an off switch.  For her to be going to  <br/>\nmeetings still after nearly 30 years, to have been sober for nearly  <br/>\n30 years, is a remarkable achievement and a LOT of work.<br/>\n<br/>\n-=-I am not limiting my dd from watching TV, as I said in an earlier<br/>\npost, she if free to watch as much as she likes in places where it is<br/>\navailable, as well as being free to watch whatever DVDs or download<br/>\nwhatever shows she likes.-=-<br/>\n<br/>\nThere&#39;s not all that much on the internet to download, I don&#39;t  <br/>\nthink.  She can&#39;t go visiting by herself, as she&#39;s three.  Do you  <br/>\nhave an example of a place she&#39;s ever been where she could watch as  <br/>\nmuch TV as she likes?  Do you ever leave her at anyone else&#39;s house?   <br/>\nShe&#39;s three.<br/>\n<br/>\nWhat if someone wrote  &quot;I am not limiting my dd from looking at  <br/>\nbooks. She is free to read as much as she likes in places where books  <br/>\nare available, as well as being free to order whatever books she  <br/>\nlikes from Amazon or interlibrary loan....&quot; others might well ask how  <br/>\nshe would even know which end of a book was up, or how she might go  <br/>\nabout browsing Amazon.<br/>\n<br/>\n&quot;If my dd asks for a book, she can have one, she can keep it in her room<br/>\nand read to her heart&#39;s content. At some point I will be able to<br/>\nread with her in a healthy way. I&#39;m working on it.&quot;<br/>\n<br/>\nHow long would you wait to work on it if you felt unable to share  <br/>\nbooks with her?<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":109103970,"authorName":"elamajikfaerie","from":"&quot;elamajikfaerie&quot; &lt;elamajikfaerie@...&gt;","profile":"elamajikfaerie","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: ideas, facts, thoughts, and feelings","postDate":"1155322974","msgId":26768,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGViaWs4ditlYWs2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PENEMDBCQUY5LTgwRDItNDYxRi1BODk3LTAxQTE2NjdEM0REOUBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":26746,"nextInTopic":26769,"prevInTime":26767,"nextInTime":26769,"topicId":26700,"numMessagesInTopic":0,"msgSnippet":"All rightey! I m learning a LOT here, and after all, that s what I m here for. So, in the hopes that there s not gonna be too many future mis-interpretations","messageBody":"<div id=\"ygrps-yiv-322834224\">All rightey!<br/>\nI&#39;m learning a LOT here, and after all, that&#39;s what I&#39;m here for.<br/>\n<br/>\nSo, in the hopes that there&#39;s not gonna be too many future<br/>\nmis-interpretations and such, as are prone to come up when relative<br/>\nstrangers are communicating through electronic printed words, I shall<br/>\nbare a bit of my soul and give you a little intro and background from<br/>\nmy life...<br/>\n<br/>\nMy daughter is 3 1/3 years old (3.3).  I am 27.<br/>\nI have definately never considered the idea of sending my daughter to<br/>\nschool of any kind for more than the split-second it took me to see<br/>\nthat I&#39;m sure its a waste of her time, intelligence, passion, spirit,<br/>\nlearning potential, etc.  I said as much to her dad before she was<br/>\nborn.  I did consider homeschooling, in some natural alternative kinda<br/>\nway, without knowing anything much about that, but didnt really give<br/>\nit much thought as I figured, I&#39;ve got 5 or 6 years before that<br/>\nbecomes an issue.<br/>\n<br/>\nThen I heard about unschooling, and I instantly knew, yep, that&#39;s what<br/>\nwe&#39;re gonna do, and I realised that we are, in fact, ALREADY doing it.<br/>\n<br/>\nMy dd has her freedom.  I dont &quot;allow&quot; her to take it, or &quot;give&quot; it to<br/>\nher, I just dont stand in her way.  I do insist that we dont drive<br/>\nunless she&#39;s in her seat belt, but that generally means that I sit and<br/>\nwait patiently trying to find creative solutions to help her to be<br/>\nhappy in the seat belt on times that she&#39;s not into it, rather than<br/>\nforcing her into it.  (ie, what if I tell you a story while you&#39;re in<br/>\nyour seat, or what if we paint your seat belt with nice colours? etc)<br/>\n<br/>\nMy dd chooses what she eats when she eats it, she chooses what she<br/>\nwears, (even if its nothing, though I do insist on sunscreen or<br/>\nstaying indoors if that&#39;s her choice). She goes to be when she is<br/>\nsleepy, and wakes up when she likes, I often find myself tired and<br/>\nleave her playing on the internet or watching DVDs while I go to bed.<br/>\n She is free to come to sleep when she likes.  She nursed on demand<br/>\n24/7 until she was 2 years 7 months, and she stopped very easily, by<br/>\nherself.  I&#39;m a SAHM, I work a few hours a week from home.<br/>\n<br/>\nThere are no punishments or discipline in our home, and likewise no<br/>\nrewards.  I often bring my dd presents, just because I saw something<br/>\nthat she would like and I felt like getting it.  Sometimes a present<br/>\ncan be something as simple as a piece of junk mail with a nice picture<br/>\nof a butterfly on it.  I take her with me most places, I let her work<br/>\nthe ATM for me, help me fill in forms, interact with sales people and<br/>\noffice clerks, or just sit on the floor hanging in the background, or<br/>\nwhatever, as she feels.  Its all life and its all learning.  I admit,<br/>\nat this age I&#39;m still not comfortable about leaving her home alone, so<br/>\nif she doesn&#39;t want to go where I&#39;m going, again, I spend time<br/>\npatiently working with her to find a solution, maybe we just go later.<br/>\n<br/>\nYesterday our next-door neighbour was doing some home-improvement and<br/>\nthere was a lot of loud banging.  My dd came to me and said she was<br/>\nafraid of the noise.  I gave her a hug and we talked about it for a<br/>\nbit.  In then end, we came up with the idea to go next door and see<br/>\nwhat the noise is.  So we went, knocked on the door, explained<br/>\nourselves, saw what the guy was doing.  We examined his hammer and<br/>\nother tools and stuff.  Then we went home, dd no longer afraid, and<br/>\nvery curious about woodwork.  So I got our a hammer and an old cut-off<br/>\npiece of wood and nails and we played with that for a while.  then I<br/>\nhad an idea and hammered nails about a cm apart all along 2<br/>\nperpendicular edges of the wood and then we wove string in and out<br/>\ncreating patterns.  Then I left dd alone to explore with the wood,<br/>\nhammer, nails, string, and the whole tool cupboard and went to the<br/>\nkitchen.  When she wanted some help, she called me...<br/>\n<br/>\nThis is a pretty typical example of how our days go.  I&#39;m still pretty<br/>\nnew to the idea of &quot;UNSCHOOLING&quot;.<br/>\n<br/>\nYes, I dont have a TV.  I do have a problem with TV, in the same way<br/>\nthat some have a probelm with alcohol. I had a quite abusive childhood<br/>\nand spent much of my teenage years heavily addicted to Heroin. I<br/>\nmanaged to clean myself up, put some physical distance between myself<br/>\nand my family and turn my life around. Still, if I get in front of a<br/>\nTV, I have a very hard time excersising the restraint and will-power<br/>\nneeded to get away from it. I am working on healing this within<br/>\nmyself, healing and moving on from the past traumas and I find new joy<br/>\nin my life every day.  But for now I feel that for me the best thing<br/>\nis not to have a TV in the house, the same way that alcoholics choose<br/>\nnot to have alcohol in their homes when they choose to heal themselves.<br/>\n<br/>\nIf my dd asks for a TV, she can have one, she can keep it in her room<br/>\nand watch to her heart&#39;s content.  At some point I will be able to<br/>\nwatch with her in a healthy way.  I&#39;m working on it.<br/>\n<br/>\nWhen I asked if it is impossible to unschool without TV, and said that<br/>\nI dont think it is, I was genuinely opening myself up to the<br/>\npossibility that in order to succesfully unschool, we need TV, not to<br/>\ndebate it, just to hear others&#39; opinions, facts, experiences, that<br/>\nkind of stuff.  I read so many stories about how so many unschoolers<br/>\nare watching unlimited TV and how parents who limit TV are not on the<br/>\nbest path... I was wondering if anyone had experience from the other side.<br/>\n<br/>\nI am not limiting my dd from watching TV, as I said in an earlier<br/>\npost, she if free to watch as much as she likes in places where it is<br/>\navailable, as well as being free to watch whatever DVDs or download<br/>\nwhatever shows she likes.  She plays around a lot on the internet, she<br/>\nhas no problem manipulating the mouse and knows how to navigate to<br/>\ndifferent sites, she likes www.poissonrouge.com and the teletubbies<br/>\nsites a lot.  she knows how to open a paint or word document and play<br/>\naround typing.  She knows ther ABCs in English and Hebrew and the<br/>\npositions of the keys, and the functions of SHIFT and DEL etc.  I<br/>\nhaven&#39;t &quot;taught&quot; her any of this, she worked it out herself, by<br/>\nwatching me and having the freedom to work it out, and the confidence<br/>\nto ask when she has a question.  <br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n<br/>\n&gt; Living a subsistance life in poverty, maybe without a family and  <br/>\n&gt; maybe without a house, is not &quot;unschooling without calling it that.&quot;   <br/>\n&gt; If you think no more of unschooing than that, please read everything  <br/>\n&gt; here before you post anymore.<br/>\n&gt; <br/>\n<br/>\nokay, again, Sandra, you have made an assumption way off the mark.  No<br/>\nproblem.  Perhaps I wasn&#39;t clear enough.  &quot;Third world&quot; doesn&#39;t<br/>\nnecessarily mean poverty.  in means that a country doesnt have a<br/>\nnational economy to match those in the &quot;first world&quot; (who happen to be<br/>\nthe ones doing the counting).  It definatley does NOT mean &quot;without a<br/>\nfamily&quot;.  Why did you assume I was talking about homeless kids living<br/>\nin poverty without a family?<br/>\n<br/>\nI was talking about children who have loving homes, large extended<br/>\nfamilies, plenty to eat, excellent quality of life, and fantastic<br/>\neducation, without school.  Children who are happy and healthy, who<br/>\nhelp in their family farming or fishing or weaving or whatever, as<br/>\nthey like.  Children who are loved and respected by their elders, who<br/>\naren&#39;t &quot;seen and not heard&quot; or banished to play-rooms and day-care. <br/>\nChildren who learn by watching and being a part of the world around<br/>\nthem.  <br/>\n<br/>\nJust because someone doesnt have a lot of money or an electricity<br/>\nconnection doesnt mean they are living in poverty.<br/>\n<br/>\nAnyway, I am learning a lot, every day! and I love it!<br/>\nThanks, <br/>\nEla </span></blockquote></div>","specialLinks":[]},{"userId":126919745,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: ideas, facts, thoughts, and feelings","postDate":"1155274396","msgId":26746,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEZERUUzNzkwLUNGOUQtNEEyNS04MzNELTBCMDAyQjIyODQ2OEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGViZzQwdis3Zzh1QGVHcm91cHMuY29tPg==","referencesHeader":"PGViZzQwdis3Zzh1QGVHcm91cHMuY29tPg=="},"prevInTopic":26738,"nextInTopic":26768,"prevInTime":26745,"nextInTime":26747,"topicId":26700,"numMessagesInTopic":0,"msgSnippet":"... You have to expect people will take you at your word, on a list like this one. When you said tv is evil, I understood you didn t mean in the devil","messageBody":"<div id=\"ygrps-yiv-129365926\">On Aug 10, 2006, at 1:13 PM, elamajikfaerie wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I DID say that I feel TV is evil, but I ALSO qualified that by saying<br/>\n&gt; not &quot;evil&quot; in the &quot;devil&quot; sense, but just something bad for me,<br/>\n&gt; personally.<br/>\n<br/>\n </span></blockquote>You have to expect people will take you at your word, on a list like  <br/>\nthis one. When you said &quot;tv is evil,&quot; I understood you didn&#39;t mean in  <br/>\nthe &quot;devil&quot; sense, but, instead, in the usual sense of the word  <br/>\nmeaning extremely malevolent and harmful.<br/>\n<br/>\nAs for whether or not you can unschool without a tv? Sure.  But tv&#39;s  <br/>\nare inexpensive and offer a more glorious and bountiful window to a  <br/>\nwider world than any other resource, so to choose not to have one  <br/>\nbecause you think it is &quot;evil,&quot; is not a particularly &quot;create-a-rich- <br/>\nenvironment&quot; kind of unschooling parent approach.<br/>\n<br/>\nAlso, people &quot;can&quot; live without all kinds of things. My husband grew  <br/>\nup with literally only one toy - he received one small toy bear as a  <br/>\ngift and that was the ONLY toy he ever had. He played in the  <br/>\ncountryside with rocks and sticks and he had a wonderful childhood.  <br/>\nSo, should we have decided to let our children have only one toy? Why  <br/>\nshould we decide to deprive our children, on purpose, of wonderful  <br/>\njoy-bringing things - things we can afford?<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: ideas, facts, thoughts, and feelings","postDate":"1155253129","msgId":26738,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEZEMDExNUEwLTZERkItNDQ3OC04RUQ3LTRGMEFFMTczQzE3MEBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEVBNjhERTkzLUI3MzctNDgyRi1CMkQ4LTBCRkRDNzE3RDE5OEBlYXJ0aGxpbmsubmV0Pg==","referencesHeader":"PGViZzQwdis3Zzh1QGVHcm91cHMuY29tPiA8RUE2OERFOTMtQjczNy00ODJGLUIyRDgtMEJGREM3MTdEMTk4QGVhcnRobGluay5uZXQ+"},"prevInTopic":26737,"nextInTopic":26746,"prevInTime":26737,"nextInTime":26739,"topicId":26700,"numMessagesInTopic":0,"msgSnippet":"-=-There are unschoolers who live beyond the range of decent TV reception.-=- I live so close to decent reception that we don t have cable, which seems to some","messageBody":"<div id=\"ygrps-yiv-1743321502\">-=-There are unschoolers who live beyond the range of decent TV<br/>\nreception.-=-<br/>\n<br/>\nI live so close to decent reception that we don&#39;t have cable, which  <br/>\nseems to some of the other unschoolers like we&#39;re watching sticks and  <br/>\nrocks. &lt;g&gt;<br/>\n<br/>\n-=-We can help you create an environment of freedom. But we<br/>\ncan&#39;t help you counteract a deliberate limiting of your child&#39;s<br/>\nworld. -=-<br/>\n<br/>\n&quot;At this very instant the young fairy came out from behind the  <br/>\nhangings, and spake these words aloud: &quot;Assure yourselves, O King and  <br/>\nQueen, that your daughter shall not die of this disaster. It is true,  <br/>\nI have no power to undo entirely what my elder has done. The princess  <br/>\nshall indeed pierce her hand with a spindle; but, instead of dying,  <br/>\nshe shall only fall into a profound sleep, which shall last a hundred  <br/>\nyears, at the expiration of which a king&#39;s son shall come and awake  <br/>\nher.&quot;<br/>\n<br/>\nSo like in Sleeping Beauty, we can be the eleven fairies (or seven,  <br/>\ndepending on the version you like) and we can help you find beauty,  <br/>\nmusic, kindness, peace, art... but we can&#39;t undo the curse of  <br/>\nnegativity.<br/>\n<br/>\nDon&#39;t make your child wait 100 years or until a prince chops down a  <br/>\nthorny hedge, or even until she&#39;s fifteen to have as full and free a  <br/>\nlife as she can have.<br/>\n<br/>\nWe would like for you to live happily ever after (starting now, I mean).<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2523747,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: ideas, facts, thoughts, and feelings","postDate":"1155252032","msgId":26737,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVBNjhERTkzLUI3MzctNDgyRi1CMkQ4LTBCRkRDNzE3RDE5OEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGViZzQwdis3Zzh1QGVHcm91cHMuY29tPg==","referencesHeader":"PGViZzQwdis3Zzh1QGVHcm91cHMuY29tPg=="},"prevInTopic":26730,"nextInTopic":26738,"prevInTime":26736,"nextInTime":26738,"topicId":26700,"numMessagesInTopic":0,"msgSnippet":"... I think a better question is Am I expanding or contracting my child s world by what I m doing? It s not that kids can t learn without TV. Kids have been","messageBody":"<div id=\"ygrps-yiv-793313502\">On Aug 10, 2006, at 4:13 PM, elamajikfaerie wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; my question is: Is is really such an &quot;unschooling no-no&quot; to have a<br/>\n&gt; home without a TV?<br/>\n<br/>\n </span></blockquote>I think a better question is &quot;Am I expanding or contracting my  <br/>\nchild&#39;s world by what I&#39;m doing?&quot;<br/>\n<br/>\nIt&#39;s not that kids can&#39;t learn without TV. Kids have been learning  <br/>\never since their only toys were sticks and rocks!<br/>\n<br/>\nThere are unschoolers who live beyond the range of decent TV  <br/>\nreception. There&#39;s a whole world of options that aren&#39;t TV. And we  <br/>\ncan talk about options for bringing the world to kids when broadcast  <br/>\nisn&#39;t available.<br/>\n<br/>\nBut, when TV is available, when *parents* make the conscious choice  <br/>\nnot to bring it into their homes, it is the same as deciding not to  <br/>\nuse books or not to use the internet or not to go to plays. It&#39;s  <br/>\ndeliberately cutting off a resource.<br/>\n<br/>\nAnd a secondary effect is that *when parents think TV is bad*, it&#39;s  <br/>\nvery difficult for children not to pick up that message. No matter  <br/>\nhow careful the parents are. No matter how much they insist that if  <br/>\nthe child asks for it, they&#39;ll get a TV. The child *can&#39;t* freely  <br/>\nchoose TV without knowingly choosing something she knows her parents  <br/>\nthink is bad.<br/>\n<br/>\nSame goes for non-organic food. Other religions. Plastic. Anything  <br/>\nthe parents have decided is *bad*, that they don&#39;t for themselves  <br/>\nwant in the house, can&#39;t be freely chosen by a child.<br/>\n<br/>\nThat&#39;s not an absolute pronouncement that every parent who feels  <br/>\nuncomfortable about TV will have children who feel uncomfortable  <br/>\nabout watching it. But the atmosphere is there, nonetheless. And it  <br/>\ntakes a lot of extra, special interaction to counteract the message  <br/>\nthe parents are silently sending.<br/>\n<br/>\nSo it isn&#39;t truthful to say &quot;Yes, you can choose not to have TV and  <br/>\nyour child will grow up without picking up your fears and will be  <br/>\njust as knowledgeable as those who have free access.&quot; You&#39;re creating  <br/>\na situation that is likely to lead to a child feeling she can&#39;t  <br/>\nfreely choose TV when she wants. Can you counteract that? It will  <br/>\nentirely depend on your awareness and sensitivity of your daughter,  <br/>\nyour awareness of yourself impact and your ability to counteract what  <br/>\nyou&#39;re creating. It will be dependent on your personalities and your  <br/>\nenvironment.<br/>\n<br/>\nWe can help you see what the world looks like from your child&#39;s point  <br/>\nof view. We can help you create an environment of freedom. But we  <br/>\ncan&#39;t help you counteract a deliberate limiting of your child&#39;s  <br/>\nworld. That&#39;s work you&#39;ll have to do yourself because what&#39;s needed  <br/>\n-- if it&#39;s possible -- will entirely depend on the personalities and  <br/>\nabilities in your family.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":205483142,"authorName":"Melissa","from":"Melissa &lt;autismhelp@...&gt;","profile":"multimomma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: [AlwaysLearning] Re: ideas, facts, thoughts, and feelings","postDate":"1155245361","msgId":26730,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhCQ0E4OTY3LTZEMkQtNEJDNy05QzBGLTAwQkQzQUEwNTE4REBjb3gubmV0Pg==","inReplyToHeader":"PENEMDBCQUY5LTgwRDItNDYxRi1BODk3LTAxQTE2NjdEM0REOUBzYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGViZzQwdis3Zzh1QGVHcm91cHMuY29tPiA8Q0QwMEJBRjktODBEMi00NjFGLUE4OTctMDFBMTY2N0QzREQ5QHNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":26725,"nextInTopic":26737,"prevInTime":26729,"nextInTime":26731,"topicId":26700,"numMessagesInTopic":0,"msgSnippet":"quote: When you have completed some or most of the exercises above and you no longer tense up at the thought of whether your child could possibly get into","messageBody":"<div id=\"ygrps-yiv-1422772636\">quote: When you have completed some or most of the exercises above  <br/>\nand you no longer tense up at the thought of whether your child could  <br/>\npossibly get into college, and when you can hear �math worksheets�  <br/>\nwithout thinking �Maybe we should get some of THOSE!� you can  <br/>\nconsider yourself a graduate of Sandra Dodd�s Advanced School of  <br/>\nDeschooling.<br/>\n<br/>\nThanks Sandra, I needed the reminder. A friend stopped by yesterday,  <br/>\nwith a whole box of homeschooling books. She&#39;s going to HS her son  <br/>\nthis year, he has backsurgery in September and will be flat on his  <br/>\nback for maybe two months, and then restricted movement for another  <br/>\nfew. I talked to her a bit about just living life (he has degeorge  <br/>\nsyndrome, and is &#39;behind&#39; on school work) and she seemed to think it  <br/>\nwas a good idea, esp after I pointed out that she said he learns  <br/>\nbetter by doing!<br/>\n<br/>\nBut after she left, I was thinking about all those nifty worksheets  <br/>\n(which Emily and I personally love doing). Fortunately the kids were  <br/>\nat a friends house swimming, and I was able to breath and talk myself  <br/>\nthrough it ;-)  I know I have a lot of work to do on *my*  <br/>\ndeschooling. The kids are there! Our house is so awesome, and I love  <br/>\nthat we sit and watch TV and play video games, and dig up clay, and  <br/>\nbuild houses out of cornstalks, and paint the table, and a bunch of  <br/>\nother things we&#39;ve done just today.<br/>\n<br/>\nMelissa<br/>\nMom to Josh (11), Breanna (9), Emily (7), Rachel (6), Sam (5), Dan  <br/>\n(3), and Avari Rose<br/>\n<br/>\nshare our lives at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://360.yahoo.com/multimomma\">http://360.yahoo.com/multimomma</a><br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Aug 10, 2006, at 4:01 PM, Sandra Dodd wrote:<br/>\n<br/>\n&gt;<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/nest\">http://sandradodd.com/nest</a><br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/deschooling\">http://sandradodd.com/deschooling</a><br/>\n&gt;<br/>\n&gt; Sandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: ideas, facts, thoughts, and feelings","postDate":"1155243699","msgId":26725,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENEMDBCQUY5LTgwRDItNDYxRi1BODk3LTAxQTE2NjdEM0REOUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGViZzQwdis3Zzh1QGVHcm91cHMuY29tPg==","referencesHeader":"PGViZzQwdis3Zzh1QGVHcm91cHMuY29tPg=="},"prevInTopic":26723,"nextInTopic":26730,"prevInTime":26724,"nextInTime":26726,"topicId":26700,"numMessagesInTopic":0,"msgSnippet":"-=-many dont even have electricity, let alone computers with internet access. Many of these kids, without any school, speak half a dozen languages-=- People","messageBody":"<div id=\"ygrps-yiv-830961625\">-=-many dont even have electricity, let alone<br/>\ncomputers with internet access. Many of these kids, without any<br/>\nschool, speak half a dozen languages-=-<br/>\n<br/>\nPeople spoke long before schools were invented.<br/>\nSchools have rarely helped ANYone learn a language.  They  have  <br/>\ncaused millions of people to endure two years or more of conjugation  <br/>\nof verbs and writing out dialogs about where the library is, but  <br/>\nthat&#39;s &quot;studying a language,&quot; not learning to speak it in any real- <br/>\nworld way.<br/>\n<br/>\nKids could learn languages more easily from DVDs now than they could  <br/>\nfrom school.<br/>\n<br/>\n-=-not &quot;evil&quot; in the &quot;devil&quot; sense-=-<br/>\n<br/>\nWhat kind of sense then?  Please define evil not in the devil sense.<br/>\nAnd if you have to look it up to do that, please remember that any  <br/>\nand every word you use has a dictionary definition and it&#39;s not okay  <br/>\nto say later &quot;I didn&#39;t mean that.&quot;<br/>\n<br/>\nYou can choose your worse as carefully as you want to, but if you  <br/>\nchoose some and post them here others will assume (sensibly and  <br/>\nrightly) that you intended to read feedback on what you posted.<br/>\n<br/>\n-=I DID point out that I realised (too late) that I shouldn&#39;t really be<br/>\nposting feelings here in that way.-=-<br/>\n<br/>\nIf by feelings you mean thoughts, post all you want.<br/>\nIf by feelings you mean bullshit, don&#39;t post that stuff.<br/>\nJust don&#39;t post anything you don&#39;t want to defend or that you don&#39;t  <br/>\nwant discussed.<br/>\n<br/>\nThose things, you can write on paper and tape to the wall at your  <br/>\nhouse  What is sent to this list, though, is ours to dissect and play  <br/>\naround with.<br/>\n<br/>\n-=-I definately NEVER said that I project anything onto my daughter if<br/>\nshe eats popsicles or anything else for that matter, just that *I*<br/>\npersonally wouldnt eat them-=-<br/>\n<br/>\nIn this case, sorry to say, it doesn&#39;t matter what you said or what  <br/>\nyou would like to claim you wish you had said or thought you were  <br/>\nsaying.  If your daughter is aware in any way that you disapprove of  <br/>\nher choices, you are doing emotional damage.  If she knows because  <br/>\nshe overheard  you, or you breathed in and out in a meaningful way,  <br/>\nor rolled your eyes, or said &quot;Do you REALLY want to watch this?&quot; or  <br/>\n&quot;Ugh&quot; or any of a thousand ways you could indicate negative thoughts  <br/>\nor feelings, it doesn&#39;t matter one bit what you write here to try to  <br/>\nconvince us you didn&#39;t say you had done that.<br/>\n<br/>\n-=-SO:<br/>\nmy question is: Is is really such an &quot;unschooling no-no&quot; to have a<br/>\nhome without a TV?-=-<br/>\n<br/>\nI don&#39;t think that&#39;s the question anymore.<br/>\n<br/>\nThe questions are bigger and broader than that.<br/>\n<br/>\n-=-To be honest, I dont think it-=-<br/>\n<br/>\nThen there&#39;s your answer.<br/>\n<br/>\n-=-I have a long experience living in<br/>\nthe third world and seen loads of families who are &quot;unschooling&quot;<br/>\nwithout calling it that. They&#39;re all just doing what everyone did<br/>\nbefore universal schooling was invented. -=-<br/>\n<br/>\nLiving a subsistance life in poverty, maybe without a family and  <br/>\nmaybe without a house, is not &quot;unschooling without calling it that.&quot;   <br/>\nIf you think no more of unschooing than that, please read everything  <br/>\nhere before you post anymore.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/nest\">http://sandradodd.com/nest</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/deschooling\">http://sandradodd.com/deschooling</a><br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":30983993,"authorName":"Lesa McMahon-Lowe","from":"&quot;Lesa McMahon-Lowe&quot; &lt;lesajm@...&gt;","profile":"lesamlowe","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: ideas, facts, thoughts, and feelings","postDate":"1155243028","msgId":26723,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTExNS1EQVY5NjlCNDVEOEQ4QkRDQzBGODA3RjhEMzRBMEBwaHguZ2JsPg==","referencesHeader":"PGViZzQwdis3Zzh1QGVHcm91cHMuY29tPg=="},"prevInTopic":26721,"nextInTopic":26725,"prevInTime":26722,"nextInTime":26724,"topicId":26700,"numMessagesInTopic":0,"msgSnippet":"Ela, How old is your DD?  I think you mentioned before but after all the\nresponses, I ve misplaced that fact. Lesa http://lifeacademy.homeschooljournal.net ","messageBody":"<div id=\"ygrps-yiv-1923742042\">Ela,\r<br/>\n\r<br/>\nHow old is your DD?  I think you mentioned before but after all the<br/>\nresponses, I&#39;ve misplaced that fact.\r<br/>\n \r<br/>\n \r<br/>\nLesa\r<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://lifeacademy.homeschooljournal.net\">http://lifeacademy.homeschooljournal.net</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":109103970,"authorName":"elamajikfaerie","from":"&quot;elamajikfaerie&quot; &lt;elamajikfaerie@...&gt;","profile":"elamajikfaerie","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: ideas, facts, thoughts, and feelings","postDate":"1155240799","msgId":26721,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGViZzQwdis3Zzh1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIyODM3MjgzLUU5MjUtNEYzNC1CRTMxLUM3QkFCQjY5QjY0RkBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":26700,"nextInTopic":26723,"prevInTime":26720,"nextInTime":26722,"topicId":26700,"numMessagesInTopic":0,"msgSnippet":"okay, I DID say that I feel TV is evil, but I ALSO qualified that by saying not evil in the devil sense, but just something bad for me, personally.  Not","messageBody":"<div id=\"ygrps-yiv-1292193046\">okay, <br/>\nI DID say that I feel TV is evil, but I ALSO qualified that by saying<br/>\nnot &quot;evil&quot; in the &quot;devil&quot; sense, but just something bad for me,<br/>\npersonally.  Not bad for anyone else, not bad for my daughter, not bad<br/>\nfor unschooling.  Sorry if anyone here assumed that was what I meant.<br/>\n<br/>\nI DID point out that I realised (too late) that I shouldn&#39;t really be<br/>\nposting feelings here in that way.<br/>\n<br/>\nI definately NEVER said that I project anything onto my daughter if<br/>\nshe eats popsicles or anything else for that matter, just that *I*<br/>\npersonally wouldnt eat them.  I also dont like Brussels Sprouts ;-)  I<br/>\neat a bunch of things my daughter doesn&#39;t like, she doesn&#39;t have to<br/>\neat them.  and vice versa, no issue.<br/>\n<br/>\nSO:<br/>\nmy question is: Is is really such an &quot;unschooling no-no&quot; to have a<br/>\nhome without a TV?<br/>\n<br/>\nTo be honest, I dont think it is, I have a long experience living in<br/>\nthe third world and seen loads of families who are &quot;unschooling&quot;<br/>\nwithout calling it that.  They&#39;re all just doing what everyone did<br/>\nbefore universal schooling was invented.  and the vast majority of<br/>\nthem do NOT have TV.  many dont even have electricity, let alone<br/>\ncomputers with internet access.  Many of these kids, without any<br/>\nschool, speak half a dozen languages, read and write, and have skills<br/>\nthat astound me (like that 4 year old who drives in India).<br/>\n<br/>\nEven here in the West, lots of families dont have a computer at home,<br/>\nthey have to go to their local library to get online, they dont have <br/>\n a swimming pool, they have to make do with the public one, they dont<br/>\nhave a yard with a garden or an encyclopedia or a lot of books or all<br/>\nkinds of things.  They get this stuff outside the home, and that<br/>\ndoesnt mean it&#39;s being &quot;restricted&quot;. <br/>\n<br/>\nSo that&#39;s where I&#39;m at now, I am, in all honesty, open to hear your<br/>\nresponses.<br/>\n<br/>\nEla</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"ideas, facts, thoughts, and feelings","postDate":"1155153491","msgId":26700,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIyODM3MjgzLUU5MjUtNEYzNC1CRTMxLUM3QkFCQjY5QjY0RkBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEJBWTExNS1EQVYxOUU5QTJCMzQ3NzEzRkVCNDA1RTY4RDM1NTBAcGh4LmdibD4=","referencesHeader":"PGViZDA3bysyZ2hlQGVHcm91cHMuY29tPiA8QkFZMTE1LURBVjE5RTlBMkIzNDc3MTNGRUI0MDVFNjhEMzU1MEBwaHguZ2JsPg=="},"prevInTopic":0,"nextInTopic":26721,"prevInTime":26699,"nextInTime":26701,"topicId":26700,"numMessagesInTopic":0,"msgSnippet":"-=-~~Okay, I forgot that ideas facts and thoughts are generally preferred over feelings on this group. My only intention was to share another perspective~~ ","messageBody":"<div id=\"ygrps-yiv-1446856288\">-=-~~Okay, I forgot that ideas facts and thoughts are generally  <br/>\npreferred<br/>\nover feelings on this group. My only intention was to share another<br/>\nperspective~~<br/>\n<br/>\n-=-that&#39;s because feelings are not reliable! feelings do not always  <br/>\nexpress<br/>\nthe truth of the matter. -=-<br/>\n<br/>\nRight.  Others&#39; feelings won&#39;t really help me with my kids.<br/>\n<br/>\n<br/>\nI&#39;m not sure something that&#39;s just &quot;a feeling&quot; even qualifies as  <br/>\n&quot;perspective.&quot;<br/>\n<br/>\nIf there&#39;s nothing objective or logical about it, it&#39;s not  <br/>\n&quot;perception&quot; in the way that a viewpoint and its relationship to the  <br/>\nobjects out there is a perception.  Feelings are involved in the  <br/>\nanalysis of perception.<br/>\n<br/>\nIdeas are what we can discuss.<br/>\n<br/>\n  Facts help sometimes, if what you mean by &quot;facts&quot; is gathered data  <br/>\nand statistics.  Sometimes those facts just help us understand how to  <br/>\ninterpret weird &quot;statements of fact.&quot;<br/>\n<br/>\nIf someone says &quot;We got a horse,&quot; I would really like to trust that  <br/>\nthat is a fact.  It&#39;s not a creative writing list.  When I say &quot;Marty  <br/>\nhas a job,&quot; that&#39;s an absolute fact.  Those anecdotes of daily lives,  <br/>\nthe stories we share, are necessary to this kind of discussion.    <br/>\nWe&#39;re  not discussing the theories so much as we&#39;re showing how the  <br/>\ntheories play out in real ways.<br/>\n<br/>\nWe can&#39;t share thoughts, just words.<br/>\n<br/>\n-=-If my daughter wants to have a<br/>\nTV and she asks for one, then she&#39;ll get it. Just like she gets<br/>\nraspberry popsicles when she wants one, even though I find them<br/>\nrepulsive and wouldnt have one myself.-=-<br/>\n<br/>\nIf she knows you find them repulsive, as WE all know you find them  <br/>\nrepulsive, she will feel that she&#39;s eating something you wish she  <br/>\nwasn&#39;t eating.  That&#39;s not good for digestion.  That&#39;s not good for  <br/>\nmother-love.  That&#39;s not good for ANYthing, really.  Can&#39;t you take  <br/>\njoy in the fact that she likes them?   Could you take joy in her  <br/>\nenjoyment of TV?<br/>\n<br/>\n-=-I&#39;m just a parent who is genuinely committed to unschooling, and I<br/>\njoin these groups for support and learning. I didnt come here to<br/>\ncriticize you, there&#39;s no need to be so defensive.<br/>\n-=-<br/>\n<br/>\nIt&#39;s a hard concept to consider, but this isn&#39;t a support group, in  <br/>\nthe traditional sense.   People here will support you becoming more  <br/>\nmindful on your daughter&#39;s behalf, and will help you learn more about  <br/>\nunschooling, but few will support your desire to defend your personal  <br/>\ntraumas and fears.  Undo them!  Examine them.  Lay them out to dry.   <br/>\nDon&#39;t save them and recite them and justify them.  That advice is for  <br/>\nyour daughter&#39;s sake first, for unschooling&#39;s sake, but it WILL  <br/>\nbenefit you.  If you think of your daughter first, the benefit to you  <br/>\nwill be huge.  If you think of your own feelings and revulsions  <br/>\nfirst, it will harm you, her, the relationship you could share, and  <br/>\nunschooling.<br/>\n<br/>\n-=-I didnt come here to criticize you, there&#39;s no need to be so  <br/>\ndefensive.-=-<br/>\n<br/>\nIt&#39;s not about me.  My family&#39;s unschooling life is securely thriving.<br/>\nI WILL defend unschooling.  I will defend those things that make it  <br/>\nwork, and when things that don&#39;t help are brought to this list, I  <br/>\nwill shine a light on them if someone else doesn&#39;t beat me to it.<br/>\n<br/>\nI will defend the time people spend helping others here, and will  <br/>\ndefend the integrity of the list and of my site.  It&#39;s not personal,  <br/>\nit&#39;s philosophical.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":26831,"nextTopicId":26375}}