{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":96795689,"authorName":"Tuckervill@aol.com","from":"Tuckervill@...","profile":"tuckervill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: I&#39;m the Parent","postDate":"1049206317","msgId":13187,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyZi4yNmRkNDVkOS4yYmJhZjgyZEBhb2wuY29tPg=="},"prevInTopic":13184,"nextInTopic":0,"prevInTime":13186,"nextInTime":13188,"topicId":13153,"numMessagesInTopic":0,"msgSnippet":"In a message dated 3/31/2003 9:36:11 PM Central Standard Time, ... You should have pointed that out to them. My mother criticised my parenting the other day.","messageBody":"<div id=\"ygrps-yiv-431760709\">In a message dated 3/31/2003 9:36:11 PM Central Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:joylyn@...\">joylyn@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; And I think that was the strangest thing to <br/>\n&gt; me, here I was talking to lesbian moms, gay dads, one couple (no kids) <br/>\n&gt; the one woman had obviously been born a male and she&#39;d been made <br/>\n&gt; surgically a woman, and *I* was the one that was alternative in terms of <br/>\n&gt; my parenting and education of my children.  They were so mainstream in <br/>\n&gt; how they parented, how they educated their kids, it wasn&#39;t even funny. <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>You should have pointed that out to them.  <br/>\n<br/>\nMy mother criticised my parenting the other day.  She was telling me how <br/>\nwrong she thought it was that my oldest son Jake, 20, had just recently moved <br/>\nin with his fiance Mandy, 19, without the benefit of marriage.  First of all, <br/>\nI&#39;m rolling my eyes anyway because these are the 00&#39;s, you know.  But I <br/>\nreally, really, REALLY wanted to ask her to compare the success of her method <br/>\nof parenting (me pregnant before I was married, which was precisely what she <br/>\nwas hoping to avoid) with mine (Jake & Mandy in a committed relationship for <br/>\n3 YEARS, no pregnancy in sight).  You know, that smartass (yet right on <br/>\ntarget) comment that would have made her stop talking to me for a few months? <br/>\n I restrained myself, because I like talking to my mom, for the most part.<br/>\n<br/>\nSurely some of those GLBT folks you met have had issues with the way they <br/>\nwere parented!  <br/>\n<br/>\nTuck<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":118406848,"authorName":"Joylyn","from":"Joylyn &lt;joylyn@...&gt;","profile":"joylynrsf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: I&#39;m the Parent","postDate":"1049167987","msgId":13184,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNFODkwODczLjMwMDA2MDlAZWFydGhsaW5rLm5ldD4=","referencesHeader":"PDEwNDkwMjkyMDMuMTc1My4zNDI1OC5tMTJAeWFob29ncm91cHMuY29tPiA8MDNkMjAxYzJmNmQxJDExZGYyNjcwJGY0ZDhmZWE5QGFsbGVudjZiaWlmMTU5Pg=="},"prevInTopic":13181,"nextInTopic":13187,"prevInTime":13183,"nextInTime":13185,"topicId":13153,"numMessagesInTopic":0,"msgSnippet":"... I had confirmation this last weekend that they aren t right.  We are at a camp with about 6 or so other families and a few other couples, no kids.  It was","messageBody":"<div id=\"ygrps-yiv-549904542\">Janet Hamlin wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Somedays I feel taken advantage of and drained by it all and wonder if <br/>\n&gt; those<br/>\n&gt; other &quot;controlling&quot; parents are right. <br/>\n<br/>\n </span></blockquote>I had confirmation this last weekend that they aren&#39;t right.  We are at <br/>\na camp with about 6 or so other families and a few other couples, no <br/>\nkids.  It was sad, because most of the families were not &quot;mindful&quot; <br/>\nparents (as one mom, who was mindful, said).  They were controlling. <br/>\n Janene and Lexie ruled the roost.  At the talent show, Janene was the <br/>\nyoungest to perform, and Lexie directed the other two in a skit she had <br/>\nseen on Zoom.  She also had a &quot;rock&quot; show where she described rocks they <br/>\nhad found as other things &quot;this rock looks like a piano, this one looks <br/>\nlike a bed for a baby, this one is a door stop.&quot;  It was very cute and <br/>\nfunny, but Lexie was feeding the other kids their lines, and was <br/>\nobviously at ease in front of a bunch of people while the other kids <br/>\nwere nervous.  Lexie and Janene made lots of friends, talked to <br/>\neveryone, introduced themselves, were quite at ease in a situation where <br/>\nthey really didn&#39;t know anyone.  The other kids were obviously not as <br/>\nrelaxed nor did they seem to possess the ability to talk to people they <br/>\ndidn&#39;t know.  Everyone commented on how self assured and confident the <br/>\ngirls were.  <br/>\n<br/>\nEveryone else also schooled, except for the one young mom with a 17 <br/>\nmonth old--she was also the only one who was really open to <br/>\nhomeschooling.  One of the dads and his partner were both teachers, and <br/>\ntheir son was in school.  Another mom and her partner (this was a <br/>\nrainbow family camp, most of the attendees were gay, but not all) had a <br/>\n7 year old who had serious developmental delays, didn&#39;t talk until 3, <br/>\nand now is still pretty behind.  She was adopted from Brazil.  One of <br/>\nthe moms was a special ed teacher.  Lots of traditional school stuff. <br/>\n We didn&#39;t tell (have a chance, not that we witheld the info) that Lexie <br/>\nand Janene were homeschooled, let alone unschooled, until after most <br/>\npeople had commented on how self assured, smart, etc. the girls were. <br/>\n So they really couldn&#39;t say that what we were doing wasn&#39;t working,a nd <br/>\nyou could tell that one man was a bit annoyed by this.  At first when we <br/>\nwere talking about homeschooling, I was saying things like &quot;with <br/>\nhomeschooling, you don&#39;t HAVE to have your child in school 7 hours a <br/>\nday, plus 2-3 afternoons for homework help, and then still have them <br/>\ncome home and have another hour or two of homework.  You can help them <br/>\nlearn in just a few hours, and enjoy life.&quot;  They came up with the <br/>\nnormal &quot;most parents can&#39;t teach their children, the kids just learn <br/>\nbetter from the authority of a teacher.&quot; bull shit as well as other <br/>\ncrap.  At one point they were saying that MOST kids NEED, MUST HAVE <br/>\nrepetition of facts, information, math, etc. to learn.  That they CANNOT <br/>\nlearn some things unless they do 100 math problems a day, read about <br/>\nGeorge Washington every year, etc.  I said I disagreed with that, and <br/>\ntalked about how many unschooled kids learn to read at age 9-10 and <br/>\nnever go through the primer reading stages, they simply go from not <br/>\nreally reading to being able to read whatever they want easily, no need <br/>\nfor repetitive phonics lessons.  Also, how Lexie has learned <br/>\nmultiplication by understanding the concept and when she needs to <br/>\nmemorize the facts she will, but knowing the concept is os much better <br/>\nthan just memorization.  Most of these parents just didn&#39;t get it.  The <br/>\npoor little girl who was DD and 7, well, she can&#39;t remember her letters <br/>\nfrom day to day.  Does she need to now? was a question these people had <br/>\nnever thought to even question, and so instead of spending their days <br/>\nloving and being with their daughter, instead she spends it in a <br/>\nclassroom and in various special ed situations, and also she goes to <br/>\nafter school homework help 3x a week for another 1 1/2 horus a day. <br/>\n Amazing.  <br/>\n<br/>\nWhen I really did explain how lexie learns, they really couldn&#39;t get it <br/>\nso I explained the example i always use (how she took Island of the Blue <br/>\nDolphins at age 6 from just reading the book to reading the sequel, <br/>\nfinding out about the author, the Chumas Indians, geography, islands, <br/>\ncatholic missions, the inslavement of the Chumash, driving to Santa <br/>\nBarbara, etc. etc.) and their response was that Lexie and Janene are <br/>\nremarkable children who are obviously gifted and they have a wonderful <br/>\nmother who has a background in Education and was a teacher and so that <br/>\nis why unschooling works for us, but that most kids could never learn <br/>\nthis way, and most kids need the structure of school and teachers and <br/>\nhomework.  I almost wanted to throw up.  I know Lexie and Janene are <br/>\nremarkable (what kind of mother would I be if I didn&#39;t think that) but <br/>\ntheir kids were pretty remarkable too.  One of the older kids overheard <br/>\nsome of this and later asked me how come Lexie could learn algebra stuff <br/>\nat age 8, and when I explained how we learn in our house, he just said <br/>\n&quot;that&#39;s really cool, wish I could do that.&quot; but his tone was such that <br/>\nhe obviously knew that he never would &quot;do that.&quot;  <br/>\n<br/>\nI tried to explain that one reason I really think school fails kids is <br/>\nthat it teaches kids that they can only learn in school and that they, <br/>\nthe kids, are not responsible for their learning but that they need to <br/>\njust sit and let someone teach them.  Lexie doesn&#39;t think that, she is <br/>\nresponsible for her own learning and she sees learning as something that <br/>\nhappens all the time, and that learning is fun.  I think that might have <br/>\nmade an impression, but I&#39;m not sure.  I had just forgotten how totally <br/>\nunmainstream I have become.  And I think that was the strangest thing to <br/>\nme, here I was talking to lesbian moms, gay dads, one couple (no kids) <br/>\nthe one woman had obviously been born a male and she&#39;d been made <br/>\nsurgically a woman, and *I* was the one that was alternative in terms of <br/>\nmy parenting and education of my children.  They were so mainstream in <br/>\nhow they parented, how they educated their kids, it wasn&#39;t even funny. <br/>\n So controlling, strict bedtimes (even though we were at a camp), eat <br/>\nyour vegies, no you may not have pudding (how can you have any pudding <br/>\nif you don&#39;t eat your meat!) (this was a real conversation, I kid you <br/>\nnot, which I overheard), I even overheard one mom threaten to spank.  I <br/>\njust thought that within a community where parenthood was so much harder <br/>\nto obtain that there would be parents who parented more thoughtfully, <br/>\nbut it seemed that at least with this limited control group that this <br/>\nwas not the case.  <br/>\n<br/>\nAnd what is really scary is that I will be back in the classroom, as a <br/>\nteacher on Monday.  I have gotten a job, as a full time long term sub <br/>\nfor I&#39;m not sure what yet (I&#39;ll find out tomorrow).  I&#39;m glad to have a <br/>\njob, I needed to have a job, but I&#39;m sad to have a job and not be at <br/>\nhome any longer and I&#39;m wondering how I will do in the classroom.  My <br/>\nentire outlook on education has changed since I was a teacher last.  <br/>\n<br/>\nOK enough rambling...<br/>\n<br/>\nOne very funny moment was when I was talking to the 70ish man with the <br/>\nlong gray/silver beard who was wearing a very pretty denim dress with <br/>\nflowers down the front, and the other four year old came running up, in <br/>\na dress (I was in my jeans, as were my girls and most everyone else) and <br/>\nhe said &quot;I&#39;m sure glad to see someone else wearing a dress.&quot;  I kinda <br/>\nchuckled and I said with the rock climbing that my girls were doing, <br/>\njeans were more appropriate for the activies of the camp.  We had a nice <br/>\nconversation about dressing children and trying not to put our own <br/>\nvalues into them, and he told me about his desire to wear dresses at a <br/>\nvery young age and his grandmother reading from the bible why his mother <br/>\ncouldn&#39;t wear slacks to work and how he knew that he probably shouldn&#39;t <br/>\ntell his grandmother that he wanted to wear her dresses.  <br/>\n<br/>\nJoylyn</div>","specialLinks":[]},{"userId":39764976,"authorName":"Alan & Brenda Leonard","from":"Alan & Brenda Leonard &lt;abtleo@...&gt;","profile":"abtleo","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] I&#39;m the Parent","postDate":"1049139642","msgId":13181,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBQUUxRDA5LjIyNzclYWJ0bGVvQGVhcnRobGluay5uZXQ+","inReplyToHeader":"PDEwNDkxMTc0MTIuNzIzLjQ2NTE1Lm0xMkB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":13168,"nextInTopic":13184,"prevInTime":13180,"nextInTime":13182,"topicId":13153,"numMessagesInTopic":0,"msgSnippet":"... Oh, Diane!!!!!  ((((((((((((HUG)))))))))))) Like you, I only do the periodically single parent thing, so I don t have a list.  But I know how it can pour","messageBody":"<div id=\"ygrps-yiv-2045901213\">3/31/03 15:30:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m feeling drained. Seems like when something major happens that shorts<br/>\n&gt; Mom&#39;s circuits, it usually shorts out the kids&#39; circuits too, and they<br/>\n&gt; need Mom more than ever.<br/>\n<br/>\n </span></blockquote>Oh, Diane!!!!!  ((((((((((((HUG))))))))))))<br/>\n<br/>\nLike you, I only do the periodically single parent thing, so I don&#39;t have a<br/>\nlist.  But I know how it can pour with all the stress at once.<br/>\n<br/>\n I hope your dh is better and home soon, and that things go ok with your<br/>\nmil, whatever treatment she might need.  Hang in there!<br/>\n<br/>\nbrenda</div>","specialLinks":[]},{"userId":129679134,"authorName":"Tia Leschke","from":"Tia Leschke &lt;leschke@...&gt;","profile":"leschke2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: I&#39;m the Parent","postDate":"1049085978","msgId":13168,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxNzUwMWMyZjc0MSRlMzZlODA4MCQwOTAwYThjMEB3ZXN0Pg==","referencesHeader":"PCF+IVVFTkVSa1ZDTURrQUFRQUNBQUFBQUFBQUFBQUFBQUFBQUJnQUFBQUFBQUFBb3RjOXlYdVBJRXV3MzdFd2ZJRzhMTUtBQUFBUUFBQUEvWENaK2dNcGxFS29maXo5RlU4b2ZBRUFBQUFBQGF0dGJpLmNvbT4gPDNFODdBRENBLjcwMjA2QHZvbC5jb20+"},"prevInTopic":13167,"nextInTopic":13181,"prevInTime":13167,"nextInTime":13169,"topicId":13153,"numMessagesInTopic":0,"msgSnippet":"... I can t offer help, but at least I can offer a big hug. {{{{{{{{{{{{{{{{{{{{{{{{{Diane}}}}}}}}}}}}}}}}}}}}}}}}}}} Tia They that can give up essential","messageBody":"<div id=\"ygrps-yiv-652271410\"><blockquote><span title=\"ireply\">&gt; Right now my dh is sick and in the hospital and it seems like everyone<br/>\n&gt; in the world is leaning on me. I started out leaning on my mil, but she<br/>\n&gt; got sick too and now found out it&#39;s cancer. When it rains, it pours, and<br/>\n&gt; it&#39;s been pouring over here.<br/>\n<br/>\n </span></blockquote>I can&#39;t offer help, but at least I can offer a big hug.<br/>\n{{{{{{{{{{{{{{{{{{{{{{{{{Diane}}}}}}}}}}}}}}}}}}}}}}}}}}}<br/>\nTia<br/>\n<br/>\n &quot;They that can give up essential liberty to obtain a little temporary<br/>\nsaftety deserve neither liberty nor safety.&quot;  Ben Franklin<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:leschke@...\">leschke@...</a></div>","specialLinks":[]},{"userId":101672438,"authorName":"Bill and Diane","from":"Bill and Diane &lt;cen46624@...&gt;","profile":"thegreatdiane","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: I&#39;m the Parent","postDate":"1049079242","msgId":13167,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNFODdBRENBLjcwMjA2QHZvbC5jb20+","referencesHeader":"PCF+IVVFTkVSa1ZDTURrQUFRQUNBQUFBQUFBQUFBQUFBQUFBQUJnQUFBQUFBQUFBb3RjOXlYdVBJRXV3MzdFd2ZJRzhMTUtBQUFBUUFBQUEvWENaK2dNcGxFS29maXo5RlU4b2ZBRUFBQUFBQGF0dGJpLmNvbT4="},"prevInTopic":13162,"nextInTopic":13168,"prevInTime":13166,"nextInTime":13168,"topicId":13153,"numMessagesInTopic":0,"msgSnippet":"... I m feeling drained. Seems like when something major happens that shorts Mom s circuits, it usually shorts out the kids circuits too, and they need Mom","messageBody":"<div id=\"ygrps-yiv-1610167980\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt;<br/>\n&gt;On the other hand, it CAN be very draining.  When my I am feeling that<br/>\n&gt;way, my husband will step in and nurture me, as well as dealing with the<br/>\n&gt;kids&#39; needs for a while. (Of course, I&#39;ll do the same for him.)<br/>\n&gt;Everybody needs to be &#39;mothered&#39; sometimes :0).  ~Rue  <br/>\n&gt;<br/>\n<br/>\n </span></blockquote>I&#39;m feeling drained. Seems like when something major happens that shorts <br/>\nMom&#39;s circuits, it usually shorts out the kids&#39; circuits too, and they <br/>\nneed Mom more than ever.<br/>\n<br/>\nRight now my dh is sick and in the hospital and it seems like everyone <br/>\nin the world is leaning on me. I started out leaning on my mil, but she <br/>\ngot sick too and now found out it&#39;s cancer. When it rains, it pours, and <br/>\nit&#39;s been pouring over here.<br/>\n<br/>\nDoes anyone here have a single mom&#39;s list they can recommend?<br/>\n<br/>\nThanks!<br/>\n<br/>\n:-) Diane<br/>\n(tired, wan smile)</div>","specialLinks":[]},{"userId":106031689,"authorName":"Jon and Rue Kream","from":"&quot;Jon and Rue Kream&quot; &lt;skreams@...&gt;","profile":"jonkream","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [AlwaysLearning] Re: I&#39;m the Parent","postDate":"1049061392","msgId":13162,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PCF+IVVFTkVSa1ZDTURrQUFRQUNBQUFBQUFBQUFBQUFBQUFBQUJnQUFBQUFBQUFBb3RjOXlYdVBJRXV3MzdFd2ZJRzhMTUtBQUFBUUFBQUEvWENaK2dNcGxFS29maXo5RlU4b2ZBRUFBQUFBQGF0dGJpLmNvbT4=","inReplyToHeader":"PDAzZDIwMWMyZjZkMSQxMWRmMjY3MCRmNGQ4ZmVhOUBhbGxlbnY2YmlpZjE1OT4="},"prevInTopic":13153,"nextInTopic":13167,"prevInTime":13161,"nextInTime":13163,"topicId":13153,"numMessagesInTopic":0,"msgSnippet":"I think it helps me that I really vividly remember being a kid.  I remember that no other peanut butter toast tastes just like my mom s does.  It may have been","messageBody":"<div id=\"ygrps-yiv-1812503211\">I think it helps me that I really vividly remember being a kid.  I<br/>\nremember that no other peanut butter toast tastes just like my mom&#39;s<br/>\ndoes.  It may have been the exact amount of golden brown-ness she gave<br/>\nthe toast, or the perfect, not too thin, not too thick layer of peanut<br/>\nbutter, or the way she cut it into special shapes for me and put it on a<br/>\ntray.  But really it&#39;s that all of those things made me feel loved. When<br/>\nmy kids ask me to do something that they &#39;can&#39; do for themselves, I know<br/>\nthat it&#39;s not only a glass of chocolate milk they want - it&#39;s me,<br/>\nputting it in a special cup with a special straw and delivering it to<br/>\nthem with a kiss. It&#39;s me showing them I love them.  We all try to keep<br/>\nin mind that love is a verb. <br/>\n<br/>\nOn the other hand, it CAN be very draining.  When my I am feeling that<br/>\nway, my husband will step in and nurture me, as well as dealing with the<br/>\nkids&#39; needs for a while. (Of course, I&#39;ll do the same for him.)<br/>\nEverybody needs to be &#39;mothered&#39; sometimes :0).  ~Rue  <br/>\n<br/>\n&quot;Pay no attention to the man behind the curtain.&quot;<br/>\n<br/>\n<br/>\n-----Original Message-----<br/>\nFrom: Janet Hamlin [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jefhdvm@...\">jefhdvm@...</a>] <br/>\nSent: Sunday, March 30, 2003 10:24 AM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nSubject: [AlwaysLearning] Re: I&#39;m the Parent<br/>\n<br/>\nThanks for posting this, Rue.  A good reminder for ME.  Dh and I try<br/>\nvery hard to do this, but I find myself sometimes feeling like I&#39;ve<br/>\nwaited on them hand and foot all day, and the second I sit down to do<br/>\nsomething for me (watch the news, read a book) they keep right on with<br/>\ntheir requests.  Mind you, my kids are 8 & 4 and are capable of doing<br/>\nthings for themselves (the 4 yr old was getting his own food and getting<br/>\ndressed on his own at 2 (his choice - very independent and determined)<br/>\nbut lately they won&#39;t do anything for themselves at all.</div>","specialLinks":[]},{"userId":120262857,"authorName":"Janet Hamlin","from":"&quot;Janet Hamlin&quot; &lt;jefhdvm@...&gt;","profile":"jefhdvm","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: I&#39;m the Parent","postDate":"1049037814","msgId":13153,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAzZDIwMWMyZjZkMSQxMWRmMjY3MCRmNGQ4ZmVhOUBhbGxlbnY2YmlpZjE1OT4=","referencesHeader":"PDEwNDkwMjkyMDMuMTc1My4zNDI1OC5tMTJAeWFob29ncm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":13162,"prevInTime":13152,"nextInTime":13154,"topicId":13153,"numMessagesInTopic":0,"msgSnippet":"... and I are both cranky, and feeling bickery, I try to remember that I m the parent, and I have more of a reserve of patience than she does.  I m the parent,","messageBody":"<div id=\"ygrps-yiv-1102675245\"><blockquote><span title=\"ireply\">&gt;&gt;There are times when I try to remember who the parent is.  When Dagny<br/>\n </span></blockquote>and I are both cranky, and feeling bickery, I try to remember that I&#39;m<br/>\nthe parent, and I have more of a reserve of patience than she does.  I&#39;m<br/>\nthe parent, so I can step back and change how I&#39;m acting more easily<br/>\nthan she can.  When Rowan wants me to get up for the hundreth time to<br/>\nget her something in the kitchen, I remember that I&#39;m the parent, and<br/>\nshe can&#39;t do everything she wants to without asking for help.  I can<br/>\nmake her feel good or bad about that.  I&#39;m the parent, and I can choose<br/>\nto happily help her when she wants me to.  When either one of them wants<br/>\nme to drop what I&#39;m doing to do something with her, I remember that I&#39;m<br/>\nthe parent of two kids who won&#39;t be kids forever.  I remember that I<br/>\ndon&#39;t want to miss one minute of being their parent. &lt;&lt;<br/>\n<br/>\nThanks for posting this, Rue.  A good reminder for ME.  Dh and I try very<br/>\nhard to do this, but I find myself sometimes feeling like I&#39;ve waited on<br/>\nthem hand and foot all day, and the second I sit down to do something for me<br/>\n(watch the news, read a book) they keep right on with their requests.  Mind<br/>\nyou, my kids are 8 & 4 and are capable of doing things for themselves (the 4<br/>\nyr old was getting his own food and getting dressed on his own at 2 (his<br/>\nchoice - very independent and determined) but lately they won&#39;t do anything<br/>\nfor themselves at all.<br/>\n<br/>\nSomedays I feel taken advantage of and drained by it all and wonder if those<br/>\nother &quot;controlling&quot; parents are right.<br/>\n<br/>\nI know they&#39;re not.<br/>\n<br/>\nJanet, struggling for more patience and balance.....</div>","specialLinks":[]}],"prevTopicId":13183,"nextTopicId":13196}}