{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1294635,"authorName":"HEM-Online-Newsletter  by way of Home Ed","from":"HEM-Online-Newsletter &lt;HEM-Editor@...&gt; (by way of Home Education Magazine)","profile":"hemhelen","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"HEM&#39;s Online News -  April 2002","postDate":"1017693651","msgId":33986,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PHAwNTAwMTk0MGI4Y2U3NWVhOTEwMkBbMjA4LjI2LjIzNS4yMDRdPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":33985,"nextInTime":33987,"topicId":33986,"numMessagesInTopic":0,"msgSnippet":"^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^ HOME EDUCATION MAGAZINE S ONLINE NEWS April 2002 ^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^ Welcome to HEM S ONLINE NEWS, a free","messageBody":"<div id=\"ygrps-yiv-496211671\">^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^<br/>\n<br/>\nHOME EDUCATION MAGAZINE&#39;S ONLINE NEWS<br/>\nApril 2002<br/>\n<br/>\n^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^<br/>\n<br/>\nWelcome to HEM&#39;S ONLINE NEWS, a free monthly newsletter published by <br/>\nHome Education Magazine and full of the best internet resources, <br/>\nhomeschooling news, announcements and article excerpts. For more <br/>\ninformation on Home Education Magazine, see the end of this <br/>\nnewsletter or visit our web site at <a rel=\"nofollow\" target=\"_blank\" href=\"http://home-ed-magazine.com\">http://home-ed-magazine.com</a> For <br/>\nsubscription information for the newsletter, scroll to the end, <br/>\nreading everything in between. Send your comments and questions to <br/>\neditor Carol Narigon at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Newsletter@...\">HEM-Newsletter@...</a>.<br/>\n<br/>\nIn the April issue:<br/>\n<br/>\n~ A Tribute ~<br/>\n~ Marilyn&#39;s Response ~<br/>\n~ Make Your Own Bumper Sticker ~<br/>\n~ Unschooling Friendship ~<br/>\n~ Illustration Contest ~<br/>\n~ A Guide for Parent/Teacher Conferences ~<br/>\n~ National Poetry Month ~<br/>\n~ Homeschoolers Build Bridges ~<br/>\n~ The Final Word ~<br/>\n<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\n&quot;I dropped the idea that I was an expert, whose job it was to fill <br/>\nthe little heads with my expertise, and began to explore how I could <br/>\nremove those obstacles that prevented the inherent genius of children <br/>\nfrom gathering itself.&quot; ~~ John Taylor Gatto ~~<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nA Tribute to John Taylor Gatto<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com/HEM/192/magatto.html\">http://www.home-ed-magazine.com/HEM/192/magatto.html</a><br/>\n<br/>\nKesey&#39;s magnificent novel, as well as the excellent movie featuring a <br/>\nyoung Jack Nicholson (not recommended until you&#39;ve read the book!), <br/>\nis the story of a rebel - one Randall Patrick McMurphy -- who finds <br/>\nhimself (or rather finds a way to get himself) inside a state <br/>\npsychiatric institution in the 1960s. Once within, he discovers <br/>\nhimself bound by a web of rules, procedures, and protocols - really, <br/>\nkid gloves -- behind which stands an iron fist of violence and <br/>\nrepression, all designed of course for &quot;the patient&#39;s own good.&quot; In <br/>\nscene after scene, McMurphy probes against the boundaries of the <br/>\nforces that stand behind the institution - &quot;the Combine&quot; -- which <br/>\ncomes to be symbolized by &quot;the Big Nurse&quot; who controls the ward, and <br/>\nultimately holds the fate of each of the patients in her hands. Let <br/>\nme not ruin the book for you. I suggest you go out and read it, <br/>\nalongside your teenager if you have one, or, if you&#39;ve read it once <br/>\nbefore, read it again, with new eyes.<br/>\n<br/>\nKesey&#39;s novel takes place against a backdrop of relentless <br/>\ninstitutional conditioning. While meetings on the ward may seem to be <br/>\ndemocratically organized -- and while inmates - no, here they are <br/>\ncalled &quot;patients&quot; - are urged toward accountability - one quickly <br/>\nrealizes that there is no democracy at work in the asylum, and that <br/>\naccountability is a sham. Inmates are tracked, without their consent, <br/>\ninto well-demarcated groups as acutes and chronics - and further <br/>\nsubdivided into walkers, wheelers, and vegetables (we all do remember <br/>\nBluebirds and Robins from first grade, don&#39;t we?) The highest value <br/>\nto the Combine is neither democracy nor accountability, but <br/>\ncompliance, pure and simple, and its favorite stratagem is divide and <br/>\nconquer. And if that doesn&#39;t work, there are always drugs. Hmm.<br/>\n<br/>\nI doubt that a set of Monarch Notes has ever been heaped with <br/>\nliterary praise before, but Gatto&#39;s are much deserving. His <br/>\ndescription of the Keseyan institutional world contained in this <br/>\nincendiary set of crib notes, (he even quotes Che Guevara - &quot;Educate <br/>\nyour enemy, don&#39;t kill him, for he is worth more to you alive than <br/>\ndead&quot;), is as compelling as the novel itself. He describes the <br/>\nCombine that controls this little world as &quot;an all-powerful, <br/>\nearth-girdling, brain-destroying association of technocrats...intent <br/>\non building a world of precision, efficiency, and tidiness...a place <br/>\nwhere the schedule is unbreakable.&quot; &quot;In such a world,&quot; writes John, <br/>\n&quot;there is neither grief nor happiness; nobody dies - they only burn <br/>\nout and are recycled; actually, it is a rather safe place, everything <br/>\nis planned - there are neither risks nor surprises.&quot; Gatto continues <br/>\nthat within this little world, &quot;Words and meaningless routines <br/>\ninsulate people from life itself, blind them to what is happening <br/>\naround them, and deaden the moral faculties.&quot; The defense to this <br/>\ncharge, ironic of course as John notes, is that the Big Nurse <br/>\ndelivers charity baskets to the poor. Pivotal to Kesey&#39;s novel, <br/>\naccording to Gatto, &quot;is the cataclysmic revelation that the inmates <br/>\nof the asylum are not committed but are there of their own free <br/>\nwill.&quot; And the way they are controlled, ultimately, is through guilt, <br/>\nshame, fear, and belittlement. Double hmmm.<br/>\n<br/>\nAnd now, Gatto, in telescoping the next 25 years of his own career, <br/>\ntells us the way out. &quot;The way out of the asylum,&quot; he writes, &quot;is <br/>\nliterally to throw out the control panel, on a physical level <br/>\nsmashing the reinforced windows, on a symbolic spiritual level <br/>\nbecoming independent of rules, orders, and other people&#39;s urgencies.&quot; <br/>\n&quot;Self-reliance,&quot; concludes John, &quot;is the antidote to institutional <br/>\nstupidity.&quot; ~~ from David Albert&#39;s tribute to John Taylor Gatto ~~<br/>\n<br/>\nYou can read the rest of this article, as well as a couple of <br/>\narticles and columns from the March/April issue at the address above, <br/>\nbut you&#39;ll have to get the magazine--the one you hold in your <br/>\nhands--to read them all! See subscription information at the end of <br/>\nthis newsletter or visit your local bookseller to get your copy today.<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nMARILYN&#39;S RESPONSE<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://local.parade.com/columns/askmarilyn.lasso\">http://local.parade.com/columns/askmarilyn.lasso</a><br/>\n<br/>\nEvidently Marilyn vos Savant received numerous letters from happy <br/>\nhomeschoolers, but sorry, folks, she&#39;s not convinced. She says we <br/>\ndidn&#39;t answer the question she asked. Here&#39;s an excerpt from her <br/>\nlatest response on Parade&#39;s website:<br/>\n<br/>\n&quot;...Many home-schoolers described how well their kids are doing and <br/>\ntheir high hopes for them, but almost no one addressed my concern <br/>\nthat a large percentage of the kids would never use their educations <br/>\nif they became home-schoolers themselves. Gifted violinists would <br/>\nnever be heard in a concert hall; great leaders would never be able <br/>\nto change society; brilliant scientists would never have a shot at <br/>\ncuring cancer.<br/>\n<br/>\nHere&#39;s a question to ask yourself: Would you want to home-school your <br/>\nsons and then watch them become home-schooling parents themselves <br/>\ninstead of having careers? This is a serious philosophical issue: If <br/>\nyou stay at home and teach your child rocket science, and he stays at <br/>\nhome and teaches his child rocket science, and he stays at home and <br/>\nteaches his child rocket science, when does anyone ever become a <br/>\nrocket scientist? In short, home-schooling is easy to recommend for <br/>\ncertain individuals, but hard to recommend for society...&quot; (e-mail: <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:marilyn@...\">marilyn@...</a>)<br/>\n<br/>\nHmmmm. Maybe she needs to talk with Madeleine Albright and Sandra Day <br/>\nO&#39;Connor, who didn&#39;t homeschool their children, but who were SAHMs <br/>\nfor many years. Albright took her first full-time job when she was 39 <br/>\nyears old. Personally, I&#39;m not only homeschooling my kids, I&#39;ve <br/>\nstarted a writing career while I&#39;ve been homeschooling, a dream of <br/>\nmine since I learned to read at age 4. I plan to continue living, <br/>\nworking, and writing even after my kids have grown and are ruining <br/>\ntheir kids&#39; lives by homeschooling.<br/>\n<br/>\nI must be the exception though. I assume Marilyn, being so smart and <br/>\nall like she is, knows how utterly and pathetically the rest of you <br/>\nare wasting your lives away. And the example you&#39;re setting for your <br/>\nchildren! For shame! If world peace isn&#39;t attained within our <br/>\nchildren&#39;s lifetime, we&#39;ll know exactly where to point the finger. <br/>\nHomeschooling. Thanks, Marilyn. (CN)<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nMAKE YOUR OWN BUMPER STICKER<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://65.165.2.251/stickers/bumperstickerstyles.asp\">http://65.165.2.251/stickers/bumperstickerstyles.asp</a><br/>\n<br/>\nHaving trouble finding that perfect homeschool bumper sticker? Here&#39;s <br/>\na place where you can make your own. Even if you decide not to make <br/>\nyour own bumper sticker, send me your ideas for great homeschool <br/>\nbumper stickers and I&#39;ll include the best of them in future issues.<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nUNSCHOOLING.COM<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n<br/>\nDoes he think the pain of school is worth a few friendships? If they <br/>\nare true friendships, they will last. If not, they weren&#39;t meant to <br/>\nbe. With unschooling, you will be able to show him a new world, a new <br/>\nside of life. And from opening up your previously enclosed circle of <br/>\nlife to expand to the whole world (instead of just school), you will <br/>\nhave the potential to develop truer friendships than your son has <br/>\never known.<br/>\n<br/>\nHe will be able to play with and talk to his friends without fear of <br/>\npunishment for socializing. He will be able to talk about his true <br/>\npassions in life, not just talk about what everyone else is talking <br/>\nabout. He will be able to know Who He Truly Is, share that with <br/>\nfriends and receive the same in return. He can even choose to not be <br/>\naround someone if he doesn&#39;t want to be, or not continue a friendship <br/>\nif it doesn&#39;t feel right to him...that&#39;s an empowering thing for a <br/>\nchild to decide for himself.<br/>\n<br/>\nFriendship inside of school has a totally different meaning from <br/>\nfriendship totally devoid of school influences, in my opinion. ~~ <br/>\nAnne Ohman, in a post on the unschooling.com message boards ~~<br/>\n<br/>\nUnschooling.com offers message boards, essays, an email list and more <br/>\njust for unschoolers. Check it out!<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nBOOK COVER ILLUSTRATION CONTEST FOR HOMESCHOOLERS!<br/>\n<br/>\nHomeschoolers ages 1-16 are invited to submit illustrations to appear <br/>\non the cover of the forthcoming book: Homeschooling and the Voyage of <br/>\nSelf-Discovery: A Journey of Original Seeking, by David H. Albert, to <br/>\nbe published by Common Courage Press in 2002.<br/>\n<br/>\nSubmissions should be in full color, in any medium, prepared in an <br/>\n8.5&quot; by 11&quot; format (regular sheet of paper) or equivalent. (Editor&#39;s <br/>\nnote: vertical presentation)<br/>\n<br/>\nRequired elements: the illustration should have a boat or ship in it. <br/>\nThere can be either a single child, child and parent, or multiple <br/>\nchildren in the illustration, which must convey the idea of a voyage. <br/>\nIf there are multiple children, please let them reflect the rainbow <br/>\ncolors of children on our planet. The rest is up to your imagination!<br/>\n<br/>\nThe winner will receive $100, and, if they choose, have their photos <br/>\nas the cover artist and a 3-4 line biography appear inside the book.<br/>\n<br/>\nAddress and Deadline: Submissions must be made to Homeschool Cover <br/>\nContest, Common Courage Press, P.O. Box 702, Monroe, ME 04951. <br/>\nEntries MUST be by snail mail. You are welcome to email copies of <br/>\nyour snail mail submissions (as long as you send a snail mail version <br/>\nseparately) to Greg at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:gbates@...\">gbates@...</a>. Questions can <br/>\nbe directed to this address as well.<br/>\n<br/>\nPack your submission well so that it will not be damaged in transit. <br/>\nPlease be sure to include your name, address, phone number, e-mail <br/>\naddress, and age. Deadline is June 10, 2002. All submissions become <br/>\nthe property of Common Courage Press, and, except for the winner, <br/>\nwill not be acknowledged or returned. Some of the artwork of the <br/>\nnon-winners may appear on the publisher&#39;s website. If you wish to <br/>\ncontact the author directly, send an e-mail to <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:shantinik@...\">shantinik@...</a>.<br/>\n<br/>\n  &lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nGUIDE FOR PARENT/TEACHER CONFERENCES<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com/wlcm_brds.html\">http://www.home-ed-magazine.com/wlcm_brds.html</a><br/>\n<br/>\n&quot;Reading through a recent newsletter put out by our school system, I <br/>\ncame across something I found quite telling. The following is an <br/>\nexcerpt from an article about the upcoming parent/teacher conferences:<br/>\n<br/>\n&quot;Studies show education is enhanced when home and school work together.&quot;<br/>\n<br/>\nHmmm, how surprising. Sounds like a good argument for homeschooling to me.<br/>\n<br/>\nIt then continued:<br/>\n<br/>\n&quot;Questions You [the parent] May Wish to Ask:<br/>\n<br/>\n* What are my child&#39;s strengths?<br/>\n* Is my child performing up to his/her potential?<br/>\n* Is my child reading at grade level? Are his/her math skills?<br/>\n* How are my child&#39;s work habits? Is he/she motivated?<br/>\n* Does my child complete assignments?<br/>\n* Does my child ask questions and participate in class?<br/>\n* Is my child respectful of others?<br/>\n* Have you noticed any major changes in my child&#39;s emotional, social, <br/>\nor physical well-being?<br/>\n* How can I continue to support my child&#39;s success?<br/>\n* In what ways can I become more involved in my child&#39;s classroom and school?<br/>\n* What opportunities are available during the summer?<br/>\n* What can I do over the summer to help my child? &quot;<br/>\n<br/>\nAt first reading, I was absolutely shocked that parents would need to <br/>\nask these questions. After all, shouldn&#39;t the parents already know <br/>\nthese things? Apparently not.<br/>\n<br/>\nAfter thinking about it for a while, I realized that should a school <br/>\nsuggest *I* needed to ask them else these questions, I&#39;d be offended. <br/>\nWhy on earth would the school think it was the appropriate ones to <br/>\nmake these judgment calls?<br/>\n<br/>\nThe whole think sums up so well why I am a homeschooler.&quot;<br/>\n<br/>\n~~ Deborah Peasley, Michigan homeschooler on the HEM message boards. <br/>\nAccess the boards at the address above. ~~<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nNATIONAL POETRY MONTH<br/>\n<br/>\nDuring the month of April, National Poetry Month, celebrate by <br/>\nreading, writing and listening to poetry. Here&#39;s a cool website where <br/>\nyou can watch videos about real people and to listen to them read <br/>\ntheir favorite poetry. I&#39;m sure you&#39;ll enjoy this unique and <br/>\nwonderful site. <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.favoritepoem.org\">http://www.favoritepoem.org</a><br/>\n<br/>\nAnother great site is the Academy of Poets website at <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.poets.org\">http://www.poets.org</a> There you&#39;ll find lesson plans and other ideas <br/>\nfor learning about and enjoying poetry.<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nHOMESCHOOLERS BUILD BRIDGES<br/>\n<br/>\nIn the October 2001 issue of HEM&#39;s Online News, I included a couple <br/>\nof bridge building contests. I received the following letter from <br/>\nCathy Bale, coordinator of the Engineering<br/>\nDesign Contest and a homeschool parent, about the results of one of <br/>\nthose contests:<br/>\n<br/>\n&quot;I am writing with an update about the West Point Bicentennial <br/>\nEngineering Design Contest. See our scoreboard at <br/>\nwww.usma.edu/bridgecontest. Two of our finalist teams are <br/>\nhomeschooled students. A third team, the one from Lincoln Christian <br/>\nAcademy, was also homeschooled for a good portion of their <br/>\neducations. More than 19,000 teams entered the contest! The <br/>\nsemi-final round is March 16, 2002. Hats off to homeschoolers!&quot;<br/>\n<br/>\n^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^<br/>\n<br/>\nHEM ONLINE NEWS UNCLASSIFIED ADVERTISING<br/>\n<br/>\nFor information on purchasing unclassified advertising space in this <br/>\nnewsletter, please contact the editor at <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Newsletter@...\">HEM-Newsletter@...</a>.<br/>\n<br/>\n________<br/>\n<br/>\nFREE ONLINE VEGETABLE GARDENING TRAINING FOR HOMESCHOOLERS!<br/>\ngrowfood.com<br/>\n<br/>\nGet world renowned Dr. Jacob R. Mittleider&#39;s &#39;Mittleider Basics <br/>\nCourse&#39; free at www.growfood.com.  Go to Online Education section and <br/>\nenjoy.  Books, Natural Mineral Nutrients & CD ROM&#39;s also available. <br/>\nAlso, look at the Garden Master CD, with $70 in Mittleider gardening <br/>\nbooks and manuals and a great program to take your children through <br/>\nevery step of the gardening process.  Took 3 years & $100,000 to <br/>\ncreate and costs only $29.95.  Look in Products under Garden Master.<br/>\n_________<br/>\n<br/>\nGIVE YOUR CHILD THE HEADSPROUT READING ADVANTAGE<br/>\nHeadsprout.com<br/>\n<br/>\nHeadsprout Reading is the fun, Internet-delivered beginning reading <br/>\nprogram that will give your child a real advantage by systematically <br/>\nteaching essential skills and strategies ensuring reading success and <br/>\nconfidence. Your child will really enjoy our fun, animated, <br/>\ninteractive episodes.  After just five 20-minute episodes, children <br/>\nread their first Headsprout books. Act quickly.  For a limited time, <br/>\nHeadsprout Reading is available free at: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.headsprout.com\">http://www.headsprout.com</a> . <br/>\nPlease enter the promotional code: HEND4<br/>\n_________<br/>\n<br/>\nUSBORNE<br/>\nUsborneAmerica.com<br/>\n<br/>\nNew science and art books for spring and summer are in...several new <br/>\nseries to engage and delight your children and you. Shop online and <br/>\nearn FREE books at: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.UsborneAmerica.com\">http://www.UsborneAmerica.com</a> For personal <br/>\nshopping service, email <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SharonVE@...\">SharonVE@...</a> or call 888-474-8499 toll <br/>\nfree. Sharon Vander Ende, Supervisor, Usborne America.<br/>\n________<br/>\n<br/>\nGNARLY MATH<br/>\ngnarlymath.com<br/>\n<br/>\n2700 FOLKS IN THESE COUNTRIES LAUGH AT MATH: Australia, Bahamas, <br/>\nBelgium, Brazil, Canada, China, Cyprus, England, Greece, Hungary, <br/>\nIndonesia, Ireland, Italy, Israel, Japan, Korea, Latvia, Malaysia, <br/>\nMexico, Nauru, New Zealand, Netherlands, Norway, Philippines, Qatar, <br/>\nSouth Africa, Singapore, Taiwan, Thailand, Tonga, and the US. They <br/>\nsubscribe to our free hilarious math newsletter, at <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.gnarlymath.com\">http://www.gnarlymath.com</a> . There you can also download free examples <br/>\nof our CD-ROM Gnarly Math. For a refresher course in Math, or to <br/>\nintrigue your kids, try our moneyback-guaranteed CD.<br/>\n_________<br/>\n<br/>\nTHE RESOURCEFUL HOMESCHOOLER<br/>\nresourcefulhomeschooler.com<br/>\n<br/>\nAttention unschoolers and eclectic homeschoolers! Looking for <br/>\nsomething to do? The Resourceful Homeschooler carries great books, <br/>\nscience materials and kits, learning games, and the most interesting <br/>\nsoftware. AND here is your opportunity to clear some shelf space! <br/>\nList or consign your surplus or used homeschooling materials. Store <br/>\ncredit available for consignments. Visit <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.resourcefulhomeschooler.com\">http://www.resourcefulhomeschooler.com</a> or call (877)523-0494. <br/>\nMaterials to involve, inspire and support independent learners of all <br/>\nages!<br/>\n_________<br/>\n<br/>\nHOME EDUCATION MAGAZINE<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com\">http://www.home-ed-magazine.com</a><br/>\n<br/>\nIn the March/April issue of Home Education Magazine, you&#39;ll enjoy <br/>\narticles on John Taylor Gatto, dragons, setting sail, make believe <br/>\nand charter schools. Columns include: Peter Kowalke works with Jamie <br/>\nHopkins; Linda Dobson pulls up a chair and drinks tea; Laura Weldon <br/>\nbrings home an ADD teen; Ann Zeise learns to drive; and Barbara <br/>\nTheisen births a colt. Other columnists include Larry and Susan <br/>\nKaseman, Sandra Dodd, Becky Rupp and Carol Narigon. HEM also offers <br/>\nclassified ads, letters and discussion, pen pals and networking, and <br/>\nmore.<br/>\n<br/>\nSubscriptions to Home Education Magazine are currently $32.00 for one <br/>\nyear/6 issues; single issue $6.50. Home Education Magazine, PO Box <br/>\n1083, Tonasket WA 98855; for orders: toll-free 1-800-236-3278; email <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:orders@...\">orders@...</a>. MC/Visa cards accepted. DON&#39;T MISS IT!<br/>\n_________<br/>\n<br/>\n^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^<br/>\n<br/>\nFINAL WORD<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.dhmo.org\">http://www.dhmo.org</a><br/>\n<br/>\nApril Fool!<br/>\n<br/>\n^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^<br/>\n<br/>\nThanks for reading HEM&#39;s Online News! Pass it on to your friends! To <br/>\nsubscribe, visit our web site at <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com/wlcm_hemnewsltr.html\">http://www.home-ed-magazine.com/wlcm_hemnewsltr.html</a> or send an email <br/>\nto <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:majordomo@...\">majordomo@...</a> with the words subscribe <br/>\nhem-online-newsletter followed by your name@your address.com in the <br/>\nbody of the email. (e.g. subscribe hem-online-newsletter <br/>\nyouremailaddress). To unsubscribe, send an email to <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:majordomo@...\">majordomo@...</a> with the words unsubscribe <br/>\nhem-online-newsletter followed by your name@your address.com in the <br/>\nbody of the email. (e.g. unsubscribe hem-online-newsletter <br/>\nyouremailaddress). To change the address at which you receive the <br/>\nnewsletter, unsubscribe your old address and then subscribe to your <br/>\nnew one.<br/>\n<br/>\nSee you next month!<br/>\n<br/>\nCarol Narigon, Newsletter Editor<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Newsletter@...\">HEM-Newsletter@...</a><br/>\nMark and Helen Hegener, Publishers of Home Education Magazine</div>","specialLinks":[]}],"prevTopicId":33877,"nextTopicId":26048}}