{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"choices (was Choosing Names   was: Nearly Gone)","postDate":"1071245945","msgId":86121,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFhOC4xZDc4YjY4Yy4yZDBiNDQ3OUBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":86120,"nextInTime":86122,"topicId":86121,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-568091170\">&lt;&lt;     I&#39;ve never written my dd&#39;s or ds&#39;s real names on the Internet <br/>\nanywhere -- maybe someone can persuade me this is a foolish precaution even <br/>\nfor a <br/>\nworrywart like me? &gt;&gt;<br/>\n<br/>\nI think you should do what seems comfortable and wise for you yourself.<br/>\n<br/>\nThere has been some side discussion lately about whether we should maybe have <br/>\nhad a policy added that told people not to reveal personal information about <br/>\ntheir children.  (That&#39;s a bad paraphrase, but I don&#39;t want to quote.)<br/>\n<br/>\nIt came up because I told my suspicions about Kirby&#39;s experiences.<br/>\n<br/>\nMy kids&#39; lives have been lived in an unschooling spotlight.  They know.  We <br/>\ndiscuss it.  They know they&#39;re &quot;poster children.&quot;  If they weren&#39;t there would <br/>\nbe people who might have wanted to unschool but couldn&#39;t grasp how it might <br/>\nwork, and so just bought a curriculum and then after a while put their kids back <br/>\nin school.     Not just my kids, but other people&#39;s kids.  Julian getting a <br/>\nB+.  Roya and Roxana Sorooshian taking college courses.  Lots of parents tell <br/>\nlots of stories.<br/>\n<br/>\nI don&#39;t think a rule or policy or even a reminder is appropriate.   Each <br/>\nperson who writes and hits &quot;send&quot; has made a decision.  We can&#39;t legislate common <br/>\nsense.   If one person thinks I&#39;m telling too much about my kids and that it <br/>\nwill come back to bite me in the butt, I just know that it&#39;s a person who <br/>\ndoesn&#39;t know me and my kids.   If my stories are making any individuals <br/>\nuncomfortable, should I stop telling them or shouldn&#39;t that person stop reading them?<br/>\n<br/>\nHome Education Magazine is full of parents telling real stories about their <br/>\nreal children.  It&#39;s the only way others can see it.  We don&#39;t have test scores <br/>\nand statistics.  We don&#39;t have scientific proofs.  We have evidence, but it&#39;s <br/>\nnot anonymous, &quot;objective&quot; evidence.  It&#39;s real life real people.<br/>\n<br/>\nWe don&#39;t have to agree on the level of sharing we do.  I&#39;m going to continue <br/>\nto do my level.  Some lurk only, and they can continue to do their level.  <br/>\nSome are vague and that&#39;s fine too.<br/>\n<br/>\nMy only objection is when someone comes to the list and seems to be here with <br/>\na purpose or agenda other than sharing their personal knowledge of <br/>\nunschooling.  Then I want them to show their hand (not necessarily with full names of <br/>\nchildren!  just to tell us enough about their own experience so that we can <br/>\ndecide whether to listen to their opinions or to run them off, and sometimes just <br/>\nasking makes thems skulk on away).<br/>\n<br/>\nI wouldn&#39;t go to La Leche League without a nursing baby or without a <br/>\npregnancy.  I wouldn&#39;t go to Parents Without Partners while I was married.   I don&#39;t <br/>\nthink people should be on unschooling lists without involvement or serious <br/>\ninterest in unschooling.<br/>\n<br/>\nIt doesn&#39;t happen often, but it happened lately.<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":86057,"nextTopicId":86130}}