{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1658973,"authorName":"Barb Eaton","from":"Barb Eaton &lt;homemama@...&gt;","profile":"homesmama","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Happy New Year!","postDate":"1072964272","msgId":17760,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJDMTk4Q0RGLjFDOUYyJWhvbWVtYW1hQGluZmluZXQuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":17759,"nextInTime":17761,"topicId":17760,"numMessagesInTopic":0,"msgSnippet":"To all of you! It s been months since I ve posted. We moved to a wonderfully larger home. Three times the size of our first house. Each of the boys have their","messageBody":"<div id=\"ygrps-yiv-510059607\">To all of you! It&#39;s been months since I&#39;ve posted. We moved to a<br/>\nwonderfully larger home. Three times the size of our first house. Each of<br/>\nthe boys have their own room which has been great all around for everyone.<br/>\nWe got moved (end of Oct) and settled. Then I started the job hunt.<br/>\n<br/>\n  I found a fulltime seasonal job for my oldest ds and myself. It ended<br/>\nright before Christmas. (I&#39;m hoping they call me back for Valentines Day<br/>\nshipping) Whew was it rough working and making time for the boys but we did<br/>\nit. Dh and Jonathan, some of you may remember him from the conference,<br/>\npitched in and helped a lot. I must say that Michael, my oldest, was a real<br/>\ntrooper. He got pretty sick right after we started but he hung in there and<br/>\ndidn&#39;t miss a day or anything. Didn&#39;t really surprise me much but I did<br/>\nexpect more complaining. Even with his college classes the first two week he<br/>\ndid well getting up and ready at 6am. I&#39;m glad that last week he didn&#39;t have<br/>\nclass. We are both not at all morning people. ;-)<br/>\n<br/>\n  I&#39;ll do my traditional thing of putting the tree and decorations away. At<br/>\nleast this year I don&#39;t have to do the dance to stay out of the way of the<br/>\nfootball game on TV. LOL! Playing with the kids has become more of a joy<br/>\nafter 3 1/2 weeks of not having that option. I missed them terribly and they<br/>\ntryed to do a catch up with me each evening. I&#39;m weeks behind on these lists<br/>\nbut you are all there when I get a few minutes when the boys are asleep and<br/>\nI&#39;m not. Which hasn&#39;t been often. LOL! I thanks you for being there. :-)<br/>\n<br/>\n  I plan to work at our old house painting and such to get it ready to sell<br/>\nsooner. I can paint and clean but Jim (dh) will need to refinish the wood<br/>\nfloors and a few other thing. The sooner we get it on the market the sooner<br/>\nI won&#39;t have to work for $$. Oh, how I miss having my time to spend freely<br/>\nwith my boys. <br/>\n<br/>\nHappy New Year<br/>\nBarb E<br/>\n&quot;Birds fly, fish swim, man thinks and learns.  Therefore, we do not need to<br/>\nmotivate children into learning by wheedling, bribing or bullying.  We do<br/>\nnot need to keep picking away at their minds to make sure they are learning.<br/>\nWhat we need to do, and all we need to do, is bring as much of the world as<br/>\nwe can into their lives.  Give children as much help and guidance as they<br/>\nask for; listen respectfully when they feel like talking; and then get out<br/>\nof the way.  We can trust them to do the rest.&quot;<br/>\n- John Holt<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":17750,"nextTopicId":17761}}