{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":56051484,"authorName":"grlynbl@aol.com","from":"grlynbl@...","profile":"jaeschool","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"MERRY CHRISTMAS","postDate":"1040738213","msgId":52796,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMzLjMxY2MyOTA5LjJiMzljMWE1QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":52795,"nextInTime":52797,"topicId":52796,"numMessagesInTopic":0,"msgSnippet":"Just a reminder of what Christmas REALLY means.. lol.. A Parents Night Before Christmas Twas the night before Christmas when all through the house I searched","messageBody":"<div id=\"ygrps-yiv-1227327985\">Just a reminder of what Christmas REALLY means.. lol..<br/>\n<br/>\n <br/>\nA Parents Night Before Christmas <br/>\n<br/>\n&#39;Twas the night before Christmas when all through the house <br/>\nI searched for the tools to hand to my spouse. <br/>\nInstructions were studied and we were inspired, <br/>\nIn hopes we could manage &quot;Some Assembly Required.&quot; <br/>\n<br/>\nThe children were quiet (not asleep) in their beds, <br/>\nWhile Dad and I faced the evening with dread: <br/>\nA kitchen, two bikes, Barbie&#39;s town house to boot! <br/>\nAnd, thanks to Grandpa, a train with a toot! <br/>\n<br/>\nWe opened the boxes, my heart skipped a beat...<br/>\nLet no parts be missing or parts incomplete! <br/>\nToo late for last-minute returns or replacement; <br/>\nIf we can&#39;t get it right, it goes in the basement! <br/>\n<br/>\nWhen what to my worrying eyes should appear, <br/>\nBut 50 sheets of directions, concise, but not clear,<br/>\nWith each part numbered and every slot named, <br/>\nSo if we failed, only we could be blamed. <br/>\n<br/>\nMore rapid than eagles the parts then fell out,<br/>\nAll over the carpet they were scattered about. <br/>\n&quot;Now bolt it! Now twist it! Attach it right there! <br/>\nSlide on the seats, and staple the stair!<br/>\nHammer the shelves, and nail to the stand.&quot; <br/>\n&quot;Honey,&quot; said hubby, &quot;you just glued my hand.&quot; <br/>\n<br/>\nAnd then in a twinkling, I knew for a fact<br/>\nThat all the toy dealers had indeed made a pact<br/>\nTo keep parents busy all Christmas Eve night <br/>\nWith &quot;assembly required&quot; till morning&#39;s first light.<br/>\n<br/>\nWe spoke not a word, but kept bent at our work,<br/>\nTill our eyes, they went bleary; our fingers all hurt.<br/>\nThe coffee went cold and the night, it wore thin <br/>\nBefore we attached the last rod and last pin. <br/>\n<br/>\nThen laying the tools away in the chest,<br/>\nWe fell into bed for a well-deserved rest.<br/>\nBut I said to my husband just before I passed out, <br/>\n&quot;This will be the best Christmas, without any doubt. <br/>\n<br/>\nTomorrow we&#39;ll cheer, let the holiday ring, <br/>\nAnd not have to run to the store for a thing! <br/>\nWe did it! We did it! The toys are all set <br/>\nFor the perfect, most perfect, Christmas, I bet!&quot;<br/>\n<br/>\nThen off to dreamland and sweet repose I gratefully went, <br/>\nThough I suppose there&#39;s something to say for those self-deluded...<br/>\nI&#39;d forgotten that BATTERIES are never included! <br/>\n    <br/>\n    <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":52794,"nextTopicId":52793}}