{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":65261722,"authorName":"ladyeliza_r","from":"&quot;ladyeliza_r&quot; &lt;ladyeliza_r@...&gt;","profile":"ladyeliza_r","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Hello, Again!","postDate":"1100385054","msgId":101074,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNuNjF1dSs5bXZ1QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":101073,"nextInTime":101075,"topicId":101074,"numMessagesInTopic":0,"msgSnippet":"Well, I thought I d say Hello again to everyone! Sarah just came home earlier this week after a few very difficult weeks in public school. For those of you","messageBody":"<div id=\"ygrps-yiv-1542251043\">Well, I thought I&#39;d say &quot;Hello&quot; again to everyone! <br/>\n<br/>\nSarah just came home earlier this week after a few very difficult <br/>\nweeks in public school. For those of you who may not remember us, <br/>\nSarah is 8. We first pulled her out of school after a disastrous year <br/>\nin Kindergarten in which she was medicated for ADHD, and we had to <br/>\ndeal with Social Services over taking her off of it, and our refusal <br/>\nto test her for Asperger&#39;s Sydrome, ODD, and OCD. We spent first <br/>\ngrade fighting over various curriculae, then were unschooling when <br/>\nsecond grade began. However, we still were dealing with DSS, and I <br/>\nended up letting Sarah go back to school. It was her choice. She <br/>\nseemed to be happy, but she wasn&#39;t really learning much as far as I <br/>\ncan tell. <br/>\n<br/>\nWe moved to NYC this summer. Sarah went back and forth on being home <br/>\nand going to school, and ultimately went back to school. This time <br/>\nhowever it did not work out very well at all, and so she is home once <br/>\nagain. <br/>\n<br/>\nThe past couple days have been wonderful with her! It is so good to <br/>\nsee her waking up smiling again on her own time, rather than having <br/>\nto argue to get her to the bus on time earlier than either of us <br/>\nwanted to be awake. Instead of ignoring her drawing materials, she <br/>\nhas drawn a great picture of a rooster sitting on a nest (she <br/>\nsays &quot;Well, Daddy Hens have to take care of the chicks too!) of eggs. <br/>\n<br/>\nWe just found out that we have the opportunity to move back to NC for <br/>\na couple of years, which will be nice. <br/>\n<br/>\nThe odd thing is, even though we weren&#39;t homeschooling here, someone <br/>\n(keep in mind, please, that we are living in military base housing!)<br/>\ncalled social services complaining that we weren&#39;t homeschooling <br/>\nSarah properly because she was out playing during the day!! She <br/>\ndidn&#39;t start school on the first day of school because she was going <br/>\nthrough the placement tests for the district. But geez! Even if we <br/>\nWERE homeschooling, there is no law saying a homeschooled child MUST <br/>\nbe indoors from 9 to 2! <br/>\n<br/>\nTHEN...Tuesday was her last day. I was supposed to be taking her up <br/>\nto a different school on Wednesday (because they wanted her in a <br/>\nspecial ed class, which isn&#39;t offered at her districted school). We <br/>\ndidn&#39;t go first thing in the morning, and by afternoon Sarah was a <br/>\ncrying wreck, and she told me it was too much to change schools AND <br/>\nclass, and she wanted to be home because school wasn&#39;t as much fun as <br/>\nshe thought and she missed us. <br/>\n<br/>\nMy husband Paul was on duty on Wednesday and Thursday, and I didn&#39;t <br/>\ntell him about Sarah&#39;s decision to stay home until Thursday <br/>\nafternoon. Not an hour later, as we were at the playground, another <br/>\nchild asked Sarah why she was being homeschooled and didn&#39;t she want <br/>\nto go back to school? <br/>\n<br/>\nSarah&#39;s reply &quot;No, I don&#39;t want to go back. I love homeschooling! <br/>\nIt&#39;s lots more fun!&quot; and they went over to the other side of the <br/>\nplayground, so I didn&#39;t hear anything else they said. (Although not <br/>\ntwo hours later, the mom of one of Sarah&#39;s other friends emailed me <br/>\nasking me if it was true Sarah wasn&#39;t going back to school AND if we <br/>\nwere moving - so apparently Sarah mentioned our move to her friend on <br/>\nthe playground as well). <br/>\n<br/>\nUGH. I look forward to leaving this place. I&#39;d like to decide what <br/>\nI&#39;m doing without hearing my decision questioned ten minutes later <br/>\nfrom people who aren&#39;t even my friends!!<br/>\n<br/>\nANYWAY...that&#39;s what we&#39;re up to right now. <br/>\n<br/>\nElizabeth</div>","specialLinks":[]}],"prevTopicId":101071,"nextTopicId":101076}}