{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"MorelFam@aol.com","from":"MorelFam@...","replyTo":"LIST","senderId":"Q7BbypvVHY089KCb7eyzb2L6wtKE3bFR-jILgveGgSdTSeKkfrCwWMoHA8jWY5TGA3UQIxJSgQ","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Digest Number 845","postDate":"972880017","msgId":13818,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdhLmJkZmIxMjEuMjcyZTUyOTFAYW9sLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":13817,"nextInTime":13819,"topicId":13818,"numMessagesInTopic":0,"msgSnippet":"i am off list right now, but thought this was worth sending to you guys.  do any of you know who to credit it to?  it is an encouragement you can pass on to","messageBody":"<div id=\"ygrps-yiv-846595714\">i am off list right now, but thought this was worth sending to you guys.  do <br/>\nany of you know who to credit it to?  it is an encouragement you can pass on <br/>\nto any homeschoolers you know.  maybe mix a little unschooling into their <br/>\nlives...  if i find out the credits, i will let you know.  if you know who <br/>\nwrote it, or YOU wrote it (!) pls email me privately so i can know.  ty, erin<br/>\n<br/>\n<br/>\n<br/>\nDear Homeschoolers,<br/>\n<br/>\nIf you are a new homeschooler and your life is running<br/>\non schedule you may have felt the first tendrils of flame<br/>\nlicking around your feet.  In February it could burst into<br/>\nfull blaze and you will recognize that you are in the midst<br/>\nof a BURN-OUT!  I thought today might be a good day to hear<br/>\nmy sure-fire burn-out avoidance theory.  Just like the<br/>\nseasons we have in nature, a homeschooler has seasons.<br/>\nIf you recognize the natural pitfalls, maybe you can prolong<br/>\nthe welcome seasons and minimize the uncomfortable ones.<br/>\n<br/>\nThe first season of the year usually comes in the fall.<br/>\nSince most of us are somewhat institutionalized, we believe<br/>\nschool should start September 5, or so.  Remember that<br/>\nschools originally started in the fall to allow for students<br/>\nto help with the farm work and harvest.  When summer was<br/>\nover most students couldn&#39;t wait to get into the classroom<br/>\nwhere the hard work was over.  It passed down to the rest of<br/>\nus and even K-Mart is into the swing of it.  I love<br/>\nback-to-school sales and take full advantage.  There is<br/>\nsomething so promising about a full packet of clean paper<br/>\nand 20 sharpened pencils.  The exciting new lunch boxes,<br/>\npencil boxes and notebook designs always inspire me.  My<br/>\nkids and I pour over the left-overs in late September when<br/>\nthey are even cheaper.  The smell and feel of school<br/>\nsupplies are actually inspirational.  We have some of our<br/>\nbest work enshrined in my kids &quot;baby boxes&quot; on My Pretty<br/>\nLittle Pony and Strawberry Shortcake notebooks with only<br/>\n5 or 6 pages used.  This fall season is when you should make<br/>\nhay while the sun shines!  Go for it!  Those wonderful plans<br/>\nto make a timeline, or study world geography by making your<br/>\nown map and having penpals over the e-mail...YES!  Start<br/>\nthose unit studies, or do 10 pages a day in your workbooks.<br/>\nLet yourselves go, because winter is around the bend and<br/>\nwinter sometimes brings burn-out.<br/>\n<br/>\nHere is where my Burn-Out Avoidance Theory (or BOAT) takes<br/>\nshape.  Some people use plain old endurance to get through<br/>\nburn-out, but I get in my BOAT and take a ride.  I love kids<br/>\nand usually have a few extras around.  One thing I&#39;ve noticed<br/>\nis how they love to catch a ride on my passions.  I garden,<br/>\ndraw a little, write, quilt, read, collect things, re-work<br/>\nold junk, junk store shop, talk to old people, crochet, watch<br/>\nbaseball, arrange flowers, and  home decorate to name a few<br/>\ninterests.  Each is very educational.  Gardening alone covers<br/>\nLatin, botany, writing, art, science, P.E., math, history,<br/>\nand geology.  Whatever passion I am currently indulging in,<br/>\nbecomes our curriculum.  Not that I take it and turn it into<br/>\na unit study.  That would be great, but would only increase<br/>\nthe burn-out.  Do that in a building season, not a rest<br/>\nseason like winter.  Just take your passion and indulge<br/>\nin it.<br/>\n<br/>\nDO NOT LET YOUR KIDS WATCH TV WHILE YOU ARE INDULGING.  And<br/>\nif your passion is TV, (excuse me while I am a little blunt)<br/>\nget a life.  From the time you were a little kid there were<br/>\nthings you liked more than other things.  What are they?  If<br/>\nyou are a type A parent you probably have forgotten them in<br/>\nthe passion of parenting.  Try giving that a rest for a few<br/>\nminutes and think about something that you like to do.  If<br/>\nyou are really stuck, go to the library and walk up and down<br/>\nthe non-fiction aisles and pull out titles that interest you<br/>\njust a little.  Take them home and put them in a convenient<br/>\nlocation.  If you feel you must, assign your children their<br/>\nwork while you look at the pictures.  When you see something<br/>\nthat gives you that little thrill of passion, do something<br/>\nabout it.  Go to the craft store and buy a birdhouse kit, for<br/>\nexample, anything to start the motion.  You will see that the<br/>\nenergy of the project will carry you along.  And your kid&#39;s<br/>\ninterest will also excite you.  Double impetus.<br/>\n<br/>\nAnd what are your kids learning during this time?  That life<br/>\nis an exciting place with vast possibilities.  That learning<br/>\nis something that starts at birth and goes on for a lifetime<br/>\nif you stay interested.  That gaining new knowledge is fun<br/>\nand only takes place in a text book in a very small part of<br/>\nlife.  That information gained from life experiences can be<br/>\nsupplemented by study, which is the real basis for learning.<br/>\nWe institutionalized people think that we should give<br/>\nchildren a whole bunch of information with no place to store<br/>\nit and hope that if they ever need it they may be able to<br/>\nfind the place they put it.  Outside of school, learning<br/>\ntakes place with experience and we go to a resource to find<br/>\nthe information that we are lacking.  School can be a cart<br/>\nbefore the horse sort of thing.  Your interests and passions<br/>\nare God-given and keep you on the learning edge.  If you give<br/>\nthem up to homeschool your children, you may be doing them a<br/>\ndis-service.  So, for Burn-Out avoidance, I recommend you<br/>\nstart thinking about what interests you.<br/>\n<br/>\nMy classic example of passion leading to usefulness is the<br/>\nwonderful story of George Washington Carver.  His adopted<br/>\nparents, previously his owners, allowed him to follow his<br/>\ninterests outdoors with plant life when he was done with his<br/>\nkitchen chores.  George went on to be a world famous botanist<br/>\nand scientist.  He told everyone who came to him, black or<br/>\nwhite, &quot;If I can do it, you can do it.&quot;<br/>\n<br/>\nAnother fascinating illustration is Winston Churchill, the<br/>\ngreat leader of England during the Second World War.  Winston<br/>\nwas raised to be a peer in pre-war England.  He was part of<br/>\nthe royal family.  He was taught at home and then sent to<br/>\nprestigious schools.  He had a passion for military history,<br/>\nin fact, his only good grades as a student came from<br/>\nmemorizing military poetry and fencing.  His father<br/>\ncompletely washed his hands of Winston the last time he was<br/>\nkicked out of school and the boy spent most of his time<br/>\nplaying soldier games with the servants&#39; children.  He would<br/>\norganize the staff children against the village children<br/>\nusing his cousins for generals of the village.  In one<br/>\nextravagant game he was surrounded by his &quot;enemies&quot; on a<br/>\n20 foot high bridge.  He jumped to avoid capture and nearly<br/>\nkilled himself.  The next months he was completely bedridden<br/>\nand &quot;found himself&quot; academically.  He was 17.  Not only is<br/>\nWinston credited with coming from behind and saving<br/>\nGreat Britain from the German war machine, he was an officer,<br/>\njournalist, artist, novelist, and devoted husband.<br/>\n<br/>\nI recently watched portraits being done of my husband and my<br/>\nyoungest son.  Watching the hands of the 17 year-old girl so<br/>\ndeftly capturing my loved-ones faces, I asked her, &quot;Where do<br/>\nyou go to school?&quot;  &quot;Oh, I don&#39;t take art lessons.  I never<br/>\nhave.  My father&#39;s an artist.  I&#39;ve just watched him all my<br/>\nlife.&quot;  &quot;Oh,&quot; I said, &quot;a homeschooler, huh?&quot;  She laughed and<br/>\nsaid, &quot;I guess I am.  I never thought of it that way before.<br/>\nBut I graduate from real school this year.  I&#39;m a senior.<br/>\n&quot;Real school?  I guess it&#39;s a perspective thing.<br/>\n<br/>\nLove, Mary</div>","specialLinks":[]}],"prevTopicId":13816,"nextTopicId":13819}}