{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1798873,"authorName":"PSoroosh@aol.com","from":"PSoroosh@...","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"interesting math thing","postDate":"1022568245","msgId":37579,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY2LjFiZDA2ZjVhLjJhMjQ4MTM1QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":37578,"nextInTime":37580,"topicId":37579,"numMessagesInTopic":0,"msgSnippet":"One of my sisters took the CBEST a month or so ago and failed the math part. This is the test that all teachers and credential-seekers have to take to teach in","messageBody":"<div id=\"ygrps-yiv-1310544070\">One of my sisters took the CBEST a month or so ago and failed the math part. <br/>\nThis is the test that all teachers and credential-seekers have to take to <br/>\nteach in California. My sister has severe math phobia.<br/>\n<br/>\nShe can take it again on June 8th. She has a WONDERFUL job offer for fall - <br/>\nat 3 times her current pay rate and a job she really really wants to do. But <br/>\nshe can&#39;t have the job if she doesn&#39;t pass this test on June 8th. <br/>\n<br/>\nSo I&#39;ve been intensively tutoring her, every chance we get. <br/>\n<br/>\nShe has a REALLY hard time being willing to TAKE time to think about the <br/>\n&quot;sense&quot; of what she&#39;s doing. She wants to just memorize computational <br/>\ntechniques and not &quot;think&quot; about meaning at all. But --- it doesn&#39;t work. She <br/>\ncan&#39;t retain the methods of doing the computations and she can&#39;t figure out <br/>\nwhich to use in what problems AND the multiple choice test answers are all <br/>\nbased on common mistakes in applying computational techniques - so when she <br/>\nmakes one of those common mistakes, the answer IS there and she chooses that <br/>\nand then gets the problem wrong. (We have lots of practice tests.)<br/>\n<br/>\nSo - finally, today, we had MANY hours together in an empty house- no <br/>\ninterruptions. I convinced her to just play along with me - give me a couple <br/>\nof hours to NOT just show her how to do computations, but to help her get the <br/>\nunderlying meaning of what she was doing. <br/>\n<br/>\nWe played games. Now, these were very pointedly math games - we didn&#39;t play <br/>\njust any old games - I made these up or got them from books and they were <br/>\nvery specifically designed to build an understanding of specific mathematical <br/>\nideas. (Remember, she isn&#39;t a kid and we don&#39;t have time for these concepts <br/>\nto build up, slowly and naturally, over time. AND she suffers from truly <br/>\nsever math phobia.)<br/>\n<br/>\nBut - they were games. I mean - they were NOT really obviously and directly <br/>\nshowing her how to solve problems on the test.<br/>\n<br/>\nWe played one game that helped her understand fractions, for example. I made <br/>\nstrips of colored paper -- one 12 inches long, cut one into 2 6-inch pieces, <br/>\ncut another into 4 3-inch pieces, another into 8 pieces and another into 16 <br/>\npieces. All different colors. I made a spinner with the numbers 1/2, 1/4, <br/>\n1/8, 1/8, 1/16 and 1/16 on it. To start, I covered the long strip with the <br/>\ntwo halves. Then she spun and had two choices --- she could &quot;trade&quot; one of <br/>\nthe pieces on the long strip for other strips - as long as they were <br/>\nequivalent to the one she took off the long strip AND contained at least one <br/>\nstrip that was the fraction she&#39;d spun. The other option was to simply remove <br/>\nthe fraction she&#39;d spun from the long strip IF she had such a piece there. <br/>\nThe goal was to uncover the long strip in as few spins as possible. I had her <br/>\nplay it a bunch of times just as a solitaire game while I made strips for <br/>\nmyself and then we played against each other, trying to be the one to get our <br/>\nlong strip uncovered first - alternating turns.<br/>\n<br/>\nBy the time she&#39;d played a while, she had a MUCH better &quot;number sense&quot; about <br/>\nfractions. Before that, she&#39;d constantly made the mistake of thinking things <br/>\nlike 1/8 was smaller than 1/10 -- because instead of understanding about <br/>\nfractions, she&#39;d just see the 8 and 10 and think 10 is bigger and so 1/10 <br/>\nmust be bigger. After we&#39;d played this game, it was obvious to her that the <br/>\nbigger denominator, the smaller the fraction since it meant something is <br/>\ndivided into more, and therefore smaller, pieces. She no longer has to try to <br/>\nMEMORIZE that a bigger denominator means a smaller fraction - it is just <br/>\nsomething that is clear to her. She also &quot;gets&quot; the relationship between <br/>\nfractions. <br/>\n<br/>\nAfter she&#39;d played a while with those pieces, I added 1/3, 1/6, and 1/12 <br/>\npieces and created a new spinner with those added (took off 1/2 from the <br/>\nspinner).  <br/>\n<br/>\nLater, when we were working on using fractions - I kept these pieces all <br/>\nsitting out, lined up in strips, so she could look at them while adding or <br/>\nsubtracting. Having spent time PLAYING with them, they were her friends and <br/>\nit was automatic for her to reach for them to figure out things like 1/3 plus <br/>\n1/4. (She covered both the 1/3 and the 1/4 strips up with 12ths so she could <br/>\nsee that the 1/3 strip was equivalent to 4 1/12ths and the 1/4 strip was <br/>\nequivalent to 3 1/12ths and so together they were 7/12ths.)<br/>\n<br/>\nNow, I have &quot;taught&quot; her how to do this umpteen times, but this time she <br/>\n&quot;discovered&quot; it for herself, using &quot;toys&quot; she&#39;d been playing with. I could <br/>\nsee the light go on and that was it -- she quickly absorbed all the other <br/>\nstuff about fractions. We covered everything else in another hour or two and <br/>\nthen went on to play some decimal games and covered decimals and percentages. <br/>\n<br/>\n<br/>\nSHE was amazed at how quickly she was able to really TRULY learn so much <br/>\nmaterial after she&#39;d spent some time &quot;just playing.&quot; She felt the difference <br/>\nin her grasp -- the difference between UNDERSTANDING and memorizing a <br/>\ncomputational technique.<br/>\n<br/>\nShe&#39;s also gone to a psychologist recently, at my suggestion, to get help <br/>\nwith techniques to reduce her panic during math tests. She got LOTS of help - <br/>\nbreating and physical muscle relaxing exercises and self-talk exercises to <br/>\npractice several times a day, which she&#39;s been doing for almost 2 weeks.  It <br/>\nseems to have really really helped - even during our study session her <br/>\nanxiety seemed far less obstructive today.<br/>\n<br/>\nJust thought this was something some of you might find interesting.<br/>\n<br/>\n--pam</div>","specialLinks":[]}],"prevTopicId":37573,"nextTopicId":37508}}