{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":8151304,"authorName":"rubyprincesstsg@aol.com","from":"rubyprincesstsg@...","profile":"rubyprincesstsg","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Another parenting question  (was Re: [Unschooling-dotcom] The Christian A...","postDate":"1050321970","msgId":64815,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyLjM3NjVmMzI0LjJiY2JmZTMyQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":64814,"nextInTime":64816,"topicId":64815,"numMessagesInTopic":0,"msgSnippet":"In a message dated 4/14/2003 4:48:55 AM Eastern Daylight Time, ... I have older children (and at the risk of posting TOO much, I will tell you about how we","messageBody":"<div id=\"ygrps-yiv-1944931901\">In a message dated 4/14/2003 4:48:55 AM Eastern Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:litlrooh@...\">litlrooh@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I realize that some of you will answer that its not an issue at your home.  <br/>\n&gt; But it *is* an issue here at the present moment and I could use some ideas.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I have older children (and at the risk of posting TOO much, I will tell you <br/>\nabout how we handled these situations, keeping in mind they were not <br/>\nhomeschooled children, but I haven&#39;t changed that much in my philosophy of <br/>\nchild rearing that this might be of help).<br/>\n<br/>\nIf they were going anywhere I had three questions, Who are you going with?  <br/>\nWhen will you be back?  Where will you be?  Those are important questions, <br/>\nthey often led down paths the further needed to be discovered.<br/>\n<br/>\nThere are times when one of them was adamant about going somewhere that I <br/>\nknew was an unsafe place, were things would go on that I was not approving <br/>\nof.  I didn&#39;t just say, well go ahead, your decision. BUT I didn&#39;t just say <br/>\nno, because I said so and I&#39;m the mother.<br/>\n<br/>\nI would tell them it really is their choice, after all what can I do?  Tie <br/>\nthem to a chair, their bed?  Call the police?  BUT I would be VERY <br/>\ndisappointed if they made such a poor choice because I know they are much <br/>\nsmarter than to want to be _______________.  Then I would ask them to think <br/>\nit over for an hour and let me know their decision.<br/>\n<br/>\nAre we allowed to be disappointed in our kids decisions?  Of course we are.  <br/>\nNot for going to the mall or something innate like that.  But there are REAL <br/>\ndangers out their that teenagers often think they can handle and often they <br/>\ncan&#39;t.<br/>\n<br/>\nI&#39;m talking about older teens, not 12 or 12 or maybe even 14 year olds.  At <br/>\nthose ages we pretty much were their way to get anywhere, after that, friends <br/>\ndrive, they know people, they get around.<br/>\n<br/>\nSometimes my kids rethought their wanting to go and it was usually simply <br/>\nbecause one of their friends was trying to persuade them to go and they knew <br/>\nthey shouldn&#39;t already.  Sometimes they went and sometimes they called me to <br/>\ncome get them and sometimes afterward they wished they had not went. (Like a <br/>\nconcert/festival in downtown DC where the bleachers collapsed and he took the <br/>\nwrong metro train home at midnight and I had to drive 120 miles roundtrip to <br/>\npick him up because it was the last train of the night)  Sometimes things <br/>\nhappen and they just aren&#39;t prepared for it.  Not enough life experiences to <br/>\nmake some decisions quickly that need to be made.<br/>\n<br/>\nBut I do know that if I simply said they were not going or demanded they stay <br/>\nhome it would never have worked because they would have immediately become <br/>\ndefensive and nothing would have stopped them from going, not even their own <br/>\nthoughts.<br/>\n<br/>\nIt&#39;s a hard thing raising teenagers, some of them anyway.  But if they know <br/>\nyou love them and only want the very best for them it&#39;s easier for them to <br/>\naccept your opinions.  My son once said to me that I am probably the only <br/>\nperson in the world that doesn&#39;t have some hidden agenda when it comes to <br/>\noffering him advice.  Everyone else has a reason that is usually something to <br/>\ndo with getting what THEY want.  I only want what is best for them to grow up <br/>\nhappy and healthy and well.<br/>\n<br/>\nGood luck to you, I know this is a difficult time for you.<br/>\n<br/>\nglena<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":64104,"nextTopicId":64747}}