{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1294635,"authorName":"HEM-Online-Newsletter  by way of Helen H","from":"HEM-Online-Newsletter &lt;HEM-Editor@...&gt; (by way of Helen Hegener)","profile":"hemhelen","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"HEM&#39;s Online News -  November 2002","postDate":"1036455451","msgId":49157,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PHAwNTAwMTk0YmI5ZWNiZTk4NzlhN0BbMjA4LjI2LjIzNS4xMjBdPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":49156,"nextInTime":49158,"topicId":49157,"numMessagesInTopic":0,"msgSnippet":"^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^ HOME EDUCATION MAGAZINE S ONLINE NEWS November 2002 ^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^ Welcome to HEM S ONLINE NEWS! For","messageBody":"<div id=\"ygrps-yiv-1978557512\">^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^<br/>\n<br/>\nHOME EDUCATION MAGAZINE&#39;S ONLINE NEWS<br/>\nNovember 2002<br/>\n<br/>\n^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^<br/>\n<br/>\nWelcome to HEM&#39;S ONLINE NEWS! For more information on Home Education <br/>\nMagazine, read further into this newsletter or visit our web site at <br/>\nhttp://home-ed-magazine.com. Send your comments and questions to <br/>\neditor Carol Narigon at HEM-Newsletter@....<br/>\n<br/>\nIn the November issue:<br/>\n<br/>\n~ Lessons at Four ~<br/>\n~ GEORGE W. ~<br/>\n~ Ask Carol ~<br/>\n~ unschooling.com ~<br/>\n~ Instant Muse ~<br/>\n~ HEM&#39;s Current Issue ~<br/>\n~ Writing Letters to the Editor ~<br/>\n~ Bembo&#39;s Zoo ~<br/>\n~ Philharmonic for Kids ~<br/>\n~ Final Word ~<br/>\n<br/>\nIf you&#39;re shopping for the holidays or need to give the grandparents <br/>\nsome ideas, check out our fine advertisers further on in this <br/>\nnewsletter. Grandparents love to know they&#39;re helping out with the <br/>\nkids&#39; education, while you make the choices that suit your family. <br/>\nAnd isn&#39;t shopping easy online? What did we do without it?<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\n     In times of change, learners inherit the earth, while the learned <br/>\nfind themselves beautifully equipped to deal with a world that no <br/>\nlonger exists. ~~ Eric Hoffer ~~<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nLESSONS AT FOUR<br/>\nhttp://home-ed-magazine.com/HEM/196.html<br/>\n<br/>\n&quot;Should you be concerned if your 4-year-old can only do lessons in <br/>\n15-minute intervals? Is it as effective to do short lessons <br/>\nthroughout the day or do you need to have schooling for long <br/>\nuninterrupted periods (1-2 hours)?&quot;<br/>\n<br/>\nI&#39;m more concerned about the idea of doing lessons with a 4-year-old <br/>\nthan I am about his attention span. While there are times a <br/>\n4-year-old might be interested in something for 15 minutes, I don&#39;t <br/>\nbelieve it would happen during a planned, <br/>\nsit-down-at-the-kitchen-table lesson period. If, during the course of <br/>\nthe day, something comes up that interests him and you study or <br/>\ndiscuss it together for 15 minutes, I&#39;d say you had a highly <br/>\nmotivated four-year-old on your hands...<br/>\n<br/>\nIf you want to spend 15 minutes with your 4-year-old, put on a fun CD <br/>\nor tape of kids music and dance to it. Make animal noises. Get <br/>\nmoving and laughing. Read a book together. Talk about the pictures. <br/>\nRead it in a funny voice. Act it out together. If he can&#39;t sit still <br/>\nwith a book, read to him while he plays with his Lego Bricks? Let him <br/>\nlead you in a pretend game with his dinosaur toys. Help build a fairy <br/>\nhouse under your tree. Construct a castle in the sandbox. Go to the <br/>\npark, swing as high as you can and slide down the slide.<br/>\n<br/>\nGo for walks and talk about what you see (language). Stop to examine <br/>\nsmall things like spiders or groups of ants (science). Pick up <br/>\ncolorful leaves and stones (small motor development). See how far you <br/>\ncan kick a rock down the street (large motor development). See how <br/>\nmany of your feet you kicked the rock and how many of his (math). <br/>\nRead the signs you see along the way (reading, spelling and <br/>\ngeography). His attention won&#39;t stay on one thing for long. Keep <br/>\nmoving. When you get home, press your leaves in big books, then make <br/>\ncollages with them in the winter (art). Make a display of stones <br/>\nyou&#39;ve collected and count how many you have (math). Use the kitchen <br/>\ntable only for eating (common sense).<br/>\n<br/>\nI know parents are eager to start &quot;teaching&quot; their children. (I&#39;ve <br/>\nbeen there.) I&#39;m sorry to tell you it just isn&#39;t necessary, <br/>\nespecially at age 4. Oh, sure, there&#39;s a large industry perpetuating <br/>\nitself on the idea that children need professionals to teach them how <br/>\nto survive in the big, bad world. Nonsense. Children need parents who <br/>\nfollow more than they teach and know how to get out of their <br/>\nchildren&#39;s way so they can get on with the business of growing up.<br/>\n<br/>\nIt will happen fast enough. You don&#39;t want to spend those years doing <br/>\nlessons at the kitchen table. ~~excerpt from Ask Carol in the <br/>\nNovember/December issue of Home Education Magazine ~~<br/>\n<br/>\nYou can read the rest of this column, as well as a couple of articles <br/>\nand columns from the current HEM at the address above, but you&#39;ll <br/>\nhave to get the magazine--the one you hold in your hands--to read <br/>\nthem all! See special subscription information in this newsletter, or <br/>\nvisit your local bookseller to get your copy today.<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nGEORGE W.<br/>\n<br/>\nThe Smithsonians National Portrait Gallery is celebrating the legacy <br/>\nof our first president with its traveling exhibit, &quot;George <br/>\nWashington: A National Treasure.&quot; It centers on the renowned <br/>\n&quot;Landsdowne&quot; portrait saved from auction with a generous $30 million <br/>\ngift from the Donald W. Reynolds Foundation. This exhibit <br/>\ndemonstrates Washington&#39;s character of patriotism, heroism and <br/>\ncourage--traits especially important for today&#39;s citizens--as it <br/>\ntours eight major cities across the nation.<br/>\n<br/>\nPortrait Poster and Teaching Guide: Teachers across America can <br/>\nrequest this free kit by internet or phone. It includes a full-color, <br/>\nmuseum quality reproduction of the &quot;Lansdowne&quot; portrait of George <br/>\nWashington by Gilbert Stuart and a 30-page teaching guide. The <br/>\ncomprehensive guide includes lesson plans for grades 2-12 and is <br/>\nlinked to National History Standards. This guide can be used for <br/>\nteaching elementary students, as well as high school history and <br/>\ncivics classes.<br/>\n<br/>\nEducation materials can be obtained free of charge by calling <br/>\n1-866-NPG-KITS or visiting the website at: <br/>\nhttp://www.georgewashington.si.edu.<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nASK CAROL<br/>\n<br/>\nIn addition to editing this newsletter, I write a column for Home <br/>\nEducation Magazine. Now, I don&#39;t want to take Dear Abby&#39;s place, but <br/>\nI will take those thorny questions and problems you struggle with and <br/>\ntry to give you some options or information that might help you. <br/>\nAlthough I don&#39;t answer the questions in this newsletter (this month <br/>\nis an exception), I do answer them in every issue of HEM, the <br/>\noriginal print version where homeschoolers have found support for <br/>\nover 20 years. A couple of them are online <br/>\n(http://www.home-ed-magazine.com), but most you have to read in the <br/>\nmagazine.<br/>\n<br/>\nI really like to get your questions-any questions at all, even if you <br/>\nthink your question is too stupid and you&#39;re the only one who has <br/>\nyour particular problem (probably not true). So, don&#39;t be shy; don&#39;t <br/>\nprocrastinate; send me your questions. I even have a special email <br/>\naddress: askcarol@... . Of course, I don&#39;t promise I <br/>\ncan answer every question in the magazine (especially if you don&#39;t <br/>\nsend one!), but I try to respond to each one, whether I use it for a <br/>\ncolumn or not. Don&#39;t wait! (~ CN ~)<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nUNSCHOOLING.COM<br/>\nhttp://www.unschooling.com<br/>\n<br/>\nOne of the cheapest foods to play with (cooking and otherwise): EGGS.<br/>\n<br/>\nOne year I saved egg shells that had broken really cleanly. Washed <br/>\nthem and saved the two halves together in a milk carton. I filled <br/>\nthem with little notes and confetti or little toys, and used super <br/>\nglue to put them back together. I wouldn&#39;t do that now, I would just <br/>\nuse Elmer&#39;s on some tissue paper or crepe paper probably. I fear <br/>\nsuper glue.<br/>\n<br/>\nBut anyway.... that wasted no food, and the eggs didn&#39;t have to be <br/>\nblown out, and we could break them to get the insides out. That was <br/>\nwhen Marty was little. My kids don&#39;t much care about Easter egg stuff <br/>\nany more.<br/>\n<br/>\nEggs aren&#39;t very expensive, and so when I&#39;ve had kids want to throw <br/>\none at something (the compost pile corner is good ), I&#39;ve let them. <br/>\nLike to throw in the road and see how it looks as it dries or, in the <br/>\nsummer, cooks. And I&#39;ve told them truly and really never throw eggs <br/>\nat a house or a car, because as it dries it messed up the paint badly.<br/>\n<br/>\nI remember wanting to cook when I was a kid and rarely having the <br/>\ningredients for anything more than maybe peanut butter cookies (which <br/>\nI think are gross).<br/>\n<br/>\nLetting kids use real foods is like getting them good art supplies <br/>\ninstead of &quot;school supply&quot; quality stuff. Even if a kid wanted to <br/>\nexperiment with some fairly expensive food, it&#39;s cheaper than bought <br/>\nscience kits from an educational supply place. ~~ Sandra Dodd posting <br/>\non the unschooling.com message boards ~~<br/>\n<br/>\nUnschooling.com offers a free monthly newsletter, message boards, an <br/>\nemail list and more just for unschoolers. To subscribe to the email <br/>\nlist send a blank email to:<br/>\nUnschooling-dotcom-subscribe@yahoogroups.com<br/>\nOr visit the email list website at: <br/>\nhttp://groups.yahoo.com/group/Unschooling-dotcom .<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nINSTANT MUSE<br/>\nhttp://www.webcom.com/wordings/artofwrite/inspiration.html<br/>\n<br/>\nNow that cool weather is here and we&#39;re spending more time indoors, <br/>\nit&#39;s fun to turn to our muses and do some creative writing. Instant <br/>\nMuse offers both a story starter and a poetry generator to give your <br/>\nmuse a jumpstart.<br/>\n<br/>\nThe story starter gives you a list of criteria for your story based <br/>\non the main character&#39;s sex, the main character&#39;s job or profession, <br/>\nan archetype, a key object or symbol, setting and a theme. For <br/>\ninstance, my story starter gave me the following start: &quot;My main <br/>\ncharacter/protagonist is a female. My main character is a social <br/>\nworker. An archetype present in my story is Cain/Able. A key object <br/>\nor symbol in my story is a feather. My story will be set in a train <br/>\nstation. My story is about mystery.&quot;<br/>\n<br/>\nThe poetry generator gives you one line of poetry and you do the <br/>\nrest, although the site offers some tips to help ensure success. My <br/>\npoetry start was &quot;In the narrows of idleness the soldiers unfold,&quot; <br/>\nand it kind of made me think of the laundry languishing in the dryer.<br/>\n<br/>\nYou can send your creations to the Instant Muse contest where you&#39;ll <br/>\nhave a chance to be included in The Art of Writing e-newsletter. Or <br/>\njust do it for fun. (Editor&#39;s note: If you decide to enter your <br/>\npoetry in any contest that promises money, first check it out at the <br/>\nfollowing website: http://windpub.org/literary.scams . Many poetry <br/>\ncontests are nothing but scams.)<br/>\n<br/>\n  &lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nHEM&#39;S CURRENT ISSUE<br/>\n<br/>\nIn the November/December issue of Home Education Magazine, you&#39;ll <br/>\nenjoy articles on how to run a self-directed conference, how one <br/>\nfamily dealt with a debilitating illness, homeschooling a special <br/>\nneeds child, placemat learning and more. Columns include: Linda <br/>\nDobson finds the gift of flow; Laura Weldon addresses record keeping; <br/>\nAnn Zeise shops online; and Elizabeth McCullough reviews two new <br/>\nhomeschool handbooks. Other columnists include Larry and Susan <br/>\nKaseman, Sandra Dodd, Becky Rupp, David Albert and Carol Narigon. HEM <br/>\nalso offers a popular essay by publisher Helen Hegener, classified <br/>\nads, letters and discussion, pen pals and networking, and more.<br/>\n<br/>\nSubscriptions to Home Education Magazine are regularly $32.00 for one <br/>\nyear/6 issues; single issue $6.50. To subscribe, visit our website at <br/>\nhttp://home-ed-magazine.com/ORD/_introsub.html or send a check to <br/>\nHome Education Magazine, PO Box 1083, Tonasket WA 98855; for orders: <br/>\ntoll-free 1-800-236-3278; email orders@.... MC/Visa <br/>\naccepted.<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nWRITING LETTERS TO THE EDITOR<br/>\nby Christine Webb and Laura Derrick<br/>\n<br/>\nYour voice really does count, so don&#39;t be shy when it comes to writing letters!<br/>\n<br/>\nWriting letters to the editors of newspapers and magazines is an <br/>\nimportant part of keeping homeschooling issues in the public eye. <br/>\nLetters to the editor columns are often the most widely read section <br/>\nof a newspaper or magazine, and public policy officials usually <br/>\nconsider them a good barometer of public opinion. You really don&#39;t <br/>\nhave to be an exceptional writer to get noticed if you speak from the <br/>\nheart and focus on expressing yourself clearly.<br/>\n<br/>\nHere are 6 important tips to get you started:<br/>\n<br/>\n1.) Be timely - If you are responding to a particular article, <br/>\nwriting immediately will increase the chances your letter will be <br/>\nprinted.<br/>\n<br/>\n2.) Keep it short - Most newspapers limit letters to the editor to <br/>\n200-300 words. A brief letter is more likely to be published and less <br/>\nlikely to be edited. Say what you want, but briefly.<br/>\n<br/>\n3.) Get to the point - Clearly state your subject and try to make <br/>\njust one main point. If you find you have too much to say in two or <br/>\nthree short paragraphs, consider writing an op-ed (guest editorial) <br/>\npiece instead. If you have trouble getting to the point, ask a friend <br/>\nfor help.<br/>\n<br/>\n4.) Make it snappy - Use humor, facts, or a personal viewpoint to add <br/>\ninterest to your letter. Encourage your children to write from their <br/>\npoints of view as well.<br/>\n<br/>\n5.) Have it proofread - Nothing makes a worse impression than poorly <br/>\nwritten pieces. Any editor will tell you that having someone else <br/>\nproofread your work is much better than doing it yourself. Polish it <br/>\nup and then ask a friend to check for grammar or spelling mistakes, <br/>\nrambling sentences, unclear points and other writing issues.<br/>\n<br/>\n6.) Identify yourself - Give your name, address and phone number so <br/>\nthe newspaper can contact you to check facts or verify that you sent <br/>\nthe letter.<br/>\n<br/>\nFind links with more tips for writing to the media, suggestions for <br/>\nwriting op-ed pieces, and information about writing letters to the <br/>\neditor at http://www.nhen.org/main/default.asp?id=76 .<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nBEMBO&#39;S ZOO<br/>\nhttp://www.bemboszoo.com<br/>\n<br/>\nThis is the coolest alphabet site I&#39;ve ever seen. You have to have <br/>\nFlash, and it takes forever to load, but it&#39;s worth the wait. Knit or <br/>\neat while it&#39;s loading. The first time you&#39;ll get a cute line of <br/>\nalphabet to play with, but that&#39;s not the good part. When you click <br/>\non the letters, which all make real animal noises, the letter will <br/>\ntransform into a sophisticated artistic rendition of an animal whose <br/>\nname starts with that letter. This is truly an amazing abecedary. <br/>\n(Note: Go to this website before you show it to your kids, so you can <br/>\nplay with it first. This is the voice of experience.)<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nPHILHARMONIC FOR KIDS<br/>\nhttp://www.nyphilkids.org/main.phtml?<br/>\n<br/>\nMany philharmonics offer special educational programs to <br/>\nhomeschoolers as well as the public schools. Some will come to your <br/>\ngroup with a variety of programs. Other times they give special <br/>\nperformances during the day or on weekends that are open to <br/>\nhomeschoolers. If you&#39;re planning a visit to the philharmonic near <br/>\nyou, check out this site and help your kids become familiar with what <br/>\nthey may see and hear there. Sponsored by the New York Philharmonic, <br/>\nthe site offers a composers gallery, news, an instrument storage <br/>\nroom, make your own instrument, a composer&#39;s workshop and more. It&#39;s <br/>\nnot a site with a lot of bells and whistles, but it will make your <br/>\nvisit more interesting. Even if you&#39;re not planning an evening of <br/>\nclassical music, this site is worth checking out.<br/>\n<br/>\n^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^<br/>\n<br/>\nHEM ONLINE NEWS UNCLASSIFIED ADVERTISING<br/>\n<br/>\nFor information on purchasing unclassified advertising space in this <br/>\nnewsletter, please contact the editor at <br/>\nHEM-Newsletter@....<br/>\n<br/>\n________<br/>\n<br/>\nUSBORNE<br/>\nUsborneAmerica.com<br/>\n<br/>\nInternet-linked history and science books, and a wonderful series on <br/>\ndrawing. Want science projects you can do with materials you already <br/>\nhave at home? Check out Big Book of Experiments!  Shop online and <br/>\nearn FREE books at: http://www.UsborneAmerica.com. For personal <br/>\nshopping<br/>\nservice, e-shows or e-book fairs, email SharonVE@... or call <br/>\n888-474-8499 toll free. Sharon Vander Ende, Independent Supervisor, <br/>\nUsborne<br/>\nAmerica.<br/>\n________<br/>\n<br/>\nGNARLY MATH<br/>\ngnarlymath.com<br/>\n<br/>\nMATH PROF WRESTLES HIPPOS IN HIS KITCHEN! Greek geometer Euclid <br/>\nliving in Australia! Talented turtle is expert in Algebra! Burglars <br/>\narrested for faulty math! Read all about it in our FREE hilarious <br/>\nmath newsletter, the Gnarly Tabloid (whoops! I mean, Gnews). <br/>\nSubscribe now to the Gnews, download free examples of our <br/>\nmoneyback-guaranteed CD-ROM Solid Gold Gnarly Math, refresh your own <br/>\nmath, and show your children how easy and fun Algebra, Geometry, <br/>\nTrig, Topology, and Probability can be, all at <br/>\nhttp://www.gnarlymath.com<br/>\n_________<br/>\n<br/>\nTHE RESOURCEFUL HOMESCHOOLER<br/>\nresourcefulhomeschooler.com<br/>\n<br/>\nAttention unschoolers and eclectic homeschoolers! Looking for <br/>\nsomething to do? The Resourceful Homeschooler carries great books, <br/>\nscience materials and kits, learning games, and the most interesting <br/>\nsoftware. AND here is your opportunity to clear some shelf space! <br/>\nList or consign your surplus or used homeschooling materials. Store <br/>\ncredit available for consignments. Visit <br/>\nhttp://www.resourcefulhomeschooler.com. Materials to involve, inspire <br/>\nand support independent learners of all ages!<br/>\n_________<br/>\n<br/>\nTEACH YOUR CHILD TO READ!  TRY ONLINE LESSONS NOW FOR FREE!<br/>\nHeadsprout.com<br/>\n<br/>\nHeadsprout Reading is the fun, Internet-delivered beginning reading <br/>\nprogram that will give your child a real advantage by systematically <br/>\nteaching essential skills and strategies ensuring reading success and <br/>\nconfidence. Outstanding fast results!  After just five 20-minute <br/>\nanimated, interactive episodes, children read their first Headsprout <br/>\nbook. Act quickly! For a limited time you can try out Headsprout <br/>\nReading FOR FREE!<br/>\nhttp://www.headsprout.com Please enter the promotional code: HENP11<br/>\n_________<br/>\n<br/>\nTHE GREAT WORD RACE<br/>\nTheGreatWordRace.com<br/>\n<br/>\nAre you getting ready for the holidays?  Give the gift that gives <br/>\nback.  The Great Word Race is a board game that challenges your <br/>\nspelling skills to race to the finish.  You&#39;ll never believe spelling <br/>\ncan be so much fun!  This colorful new board game is like playing <br/>\nScrabble but it&#39;s a lot more fun.  Special playing cards enhance your <br/>\nability to build words throughout the game.  We&#39;ll even gift wrap <br/>\nyour game and send it with a card to that favorite someone. <br/>\nhttp://www.TheGreatWordRace.com<br/>\n_________<br/>\n<br/>\nHomeSchool FreeStuff<br/>\nHomeschoolFREEStuff.com<br/>\n<br/>\nEvery week this FREE email newsletter brings you FREE curriculum, <br/>\nresources, lesson plans, unit studies, interactive online studies and <br/>\nmore! It&#39;s even FREE to subscribe! Because Everyone Deserves A Treat <br/>\nOnce In A While! <br/>\nhttp://www.homeschoolfreestuff.com/html/home.asp?adid=26<br/>\n_________<br/>\n<br/>\n^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^<br/>\n<br/>\nFINAL WORD<br/>\n<br/>\nhttp://www.millan.net/funp/60/momdictionary.htm<br/>\n<br/>\n^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^<br/>\n<br/>\nThanks for reading HEM&#39;s Online News! Pass it on to your friends! To <br/>\nsubscribe, visit our web site at <br/>\nhttp://www.home-ed-magazine.com/wlcm_hemnewsltr.html or send an email <br/>\nto majordomo@... with the words subscribe <br/>\nhem-online-newsletter followed by your name@your address.com in the <br/>\nbody of the email. (e.g. subscribe hem-online-newsletter <br/>\nyouremailaddress). To unsubscribe, send an email to <br/>\nmajordomo@... with the words unsubscribe <br/>\nhem-online-newsletter followed by your name@your address.com in the <br/>\nbody of the email. (e.g. unsubscribe hem-online-newsletter <br/>\nyouremailaddress). To change the address at which you receive the <br/>\nnewsletter, unsubscribe your old address and then subscribe to your <br/>\nnew one.<br/>\n<br/>\nSee you next month!<br/>\n<br/>\nCarol Narigon, Newsletter Editor<br/>\nHEM-Newsletter@...<br/>\nMark and Helen Hegener, Publishers of Home Education Magazine<br/>\nCopyright 2002</div>","specialLinks":[]}],"prevTopicId":49132,"nextTopicId":49153}}