{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Demands!!","postDate":"1489697662","msgId":77913,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU5REY0NjlFLURFNjctNDBEMy1BNjhCLUI1RkNDMTU2RUM0MkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":77912,"nextInTime":77914,"topicId":77913,"numMessagesInTopic":0,"msgSnippet":"My e-mail has been stuck.  Mail came in but I couldn’t respond. It’s fixed, so I’m celebrating by sending something non-pressing to this group. From a","messageBody":"<div id=\"ygrps-yiv-1109297886\">My e-mail has been stuck.  Mail came in but I couldn’t respond. It’s fixed, so I’m celebrating by sending something non-pressing to this group.<br/>\n<br/>\nFrom a set of reports of humorous (or irritating) things teachers have heard from parents:<br/>\n___________<br/>\n<br/>\n11. 3rd grader&#39;s parents come in, with a notarized list of demands.<br/>\n<br/>\nChildren in my class must be prohibited from bringing in gluten, ever.<br/>\n<br/>\nThey said they didn&#39;t want her to feel left out because other kids were eating gluten. No, she didn&#39;t have celiac, it was just the family&#39;s personal choice.<br/>\n<br/>\nI let their daughter choose who she sits next to each day (the class had a carefully coordinated seating plan.)<br/>\n<br/>\nShe be exempt from history class because she was too advanced for our history class but not advanced enough for an AP class.<br/>\n<br/>\nLong story short they switched her to a private school before years end.<br/>\n_____________<br/>\n<br/>\nSome people like that become homeschoolers.  Some of that group will become unschoolers.<br/>\n<br/>\nIt reminded me that some unschoolers come all a-twitch, having first rejected one school, then another, then school-at-home, and THEN they find us.  And they might be all raw and rasty at that point.<br/>\n<br/>\nYears back when my kids were little there were a few instances of another parents telling me, when her child visited, what I must do.  Sometimes I smiled and said I’ll try.  Sometimes I gave the wrinkly, rared back face of “Yeah, no.”  Sometimes I dodged.  If she said “I don’t want them to watch TV,” I would say “We set up a wading pool and bubbles outside.”    She stated a truth; I stated a truth.  Like a conversation between one-year-olds who can talk really well.  <br/>\n<br/>\nAt my house at the moment are three kinds of bread, white flour tortillas, and three kinds of cookies.  We shopped yesterday.  Also, my kids are grown, so their playdates can involve driving to a restaurant if they have a picky friend over, wherever they are.<br/>\n<br/>\nIt’s bad enough for a parent to demand that another family live as the visiting child’s family would like to be seen as living, but VERY CRAZY to demand that the families of all the kids in a classroom live in such a way as not to disturb the fantasy “personal choice” life of the parents.  <br/>\n<br/>\nThis is another example, I think, of how peace and prosperity skew people’s priorities.  Some people need an enemy, need to feel beset, so they can exercise whatever biochemicals create the feeling of life-saving heroism.  Because their lives are safe and they have too much money and can’t figure out how to save their child’s physical actual life, they set up a mental construct of the Immediate DANGER to her future, and combat it.<br/>\n<br/>\nIf you, anyone who has read this far, have that urge, try to turn it toward fun, good things you can provide for your child and maybe some guest kids!  For me it’s easier and healthier to see my own illogical slips as “the enemy,” or to defend my home and family from my own bad moods.   And maybe that’s another reason I think “support” creates problems in a person and for a family.  Telling an illogical mom with bad moods that she is awesome and her children are lucky to have her causes them to look for other enemies.<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":77900,"nextTopicId":77914}}