{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":180440915,"authorName":"Pam","from":"&quot;Pam&quot; &lt;weatherse@...&gt;","profile":"mymorningdovebj","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"[AlwaysLearning] Quitting Things (Kinda Long)","postDate":"1081908175","msgId":19289,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQwN0M5QkNGLjAwMDAwNy4wMTU0OEBTVFJFR0FOT05BPg==","referencesHeader":"PEJBWTUtREFWOTBaOFR3MEE3VjEwMDAwNjcwNUBob3RtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":19288,"nextInTime":19290,"topicId":19289,"numMessagesInTopic":0,"msgSnippet":"... From: AlwaysLearning@yahoogroups.com Date: 04/13/04 21:13:28 To: alwayslearning Subject: [AlwaysLearning] Quitting Things (Kinda Long) Hi Folks, I","messageBody":"<div id=\"ygrps-yiv-1267914740\">-------Original Message-------<br/>\n <br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nDate: 04/13/04 21:13:28<br/>\nTo: alwayslearning<br/>\nSubject: [AlwaysLearning] Quitting Things (Kinda Long)<br/>\n <br/>\nHi Folks,<br/>\nI apologize for being so behind on this thread. I took a little break from<br/>\nreading my digests. I have been preoccupied with Fabric lately - dyeing,<br/>\nquilting, making clothes, coveting more fabric...<br/>\nI read the digest for the 5th of April and just had to write. I guess a<br/>\nlight bulb lit up over my head &lt;G&gt;. Quitting things has been a major source<br/>\nof upset in our family for years. Quitting was thrown in my face a bunch as<br/>\nI was growing up, so of course I felt it was something I should guard<br/>\nagainst with our child. I too would attempt to coax, wheedle, shame, show<br/>\nlogic, whatever - our sensitive daughter to stick with many activities over<br/>\nthe years. The ones that come to mind are violin lessons, girl&#39;s soccer,<br/>\nIrish dance, Hula, and most of all SCHOOL!<br/>\nIn looking over some of the reflections from you folks and chewing over some<br/>\nof mine, I came to the opinion that our daughter is amazing. She is teaching<br/>\nme to unschool. Her clarity about the personal value of any class or group<br/>\nactivity has always been there. In the early years when she was still in<br/>\nschool alternative programs; fear, illness and anxiety were the tools she<br/>\nhad available to exit from an uncomfortable situation. <br/>\nSoccer had the same issues for us that I see reiterated here - letting the<br/>\nteam down, making a commitment,  not being a quitter. In a few years she<br/>\nwanted to rejoin the team, but the coach was not interested because he<br/>\nneeded girls who come to every game. The number of players allowed on each<br/>\nteam was strictly regulated. Actual consequences in the real world I suppose<br/>\n<br/>\nI never was able to force her to go to anything once she decided not to go.<br/>\nHer clarity and ability to see into other people&#39;s hidden agendas gives her<br/>\na strength of will that was evident from her first years. She has way more<br/>\npersistence on these issues than I can manage and now I understand that that<br/>\nis so much to the good.  Some activities fit for her, or fit for a while,<br/>\nand others just don&#39;t. At first she couldn&#39;t articulate about the details in<br/>\nher desire to quit things. She would say she didn&#39;t know why, but she just<br/>\ncouldn&#39;t be there anymore - or at least  not when she was tired or ill. If I<br/>\npushed, tension and tears and anger were the menu for the rest of the day.<br/>\nAfter we had been homeschool people for several months, she wanted to quit<br/>\nIrish dance. I went through all my litany of obstacles to leaving it behind:<br/>\nthe money invested in classes & costumes, the great homeschool families in<br/>\nour dance group, not being a quitter (of course), the opportunities to<br/>\nperform regularly. Her response was, &quot;Mom, I thought when we became<br/>\nhomeschoolers the idea was I would try new things and have new experiences.<br/>\nJust because I did the dance for a while doesn&#39;t mean I always have to do it<br/>\n Why can&#39;t I quit this? I loved it for a while, but now it doesn&#39;t feel good<br/>\nto be there.&quot; The growing tensions between the parent group and the teachers<br/>\nwas some of the source of her discomfort there. I felt stunned and proud and<br/>\na bit angry too I guess.  She was better at getting the homeschooling<br/>\nmindset than I was &lt;G&gt;. <br/>\nIn a later conversation about dance I expressed my sadness at not seeing<br/>\nthose nice families every week. I enjoyed chatting with the moms. Our sweet<br/>\nchild said firmly to me, &quot;You need to have friends that are not dependant on<br/>\nmy activities!&quot; <br/>\nIn looking back at these sorts of upsets, I see a pattern of my unconscious<br/>\npersonal need to have a child who is liked and respected and even admired. I<br/>\npull a thread in these dramas and see a connection raveling down the<br/>\ngenerations. I was shamed to be a quitter, thus I, ever so obediently<br/>\nattempted to shame my child into not being a quitter. I see her now, (maybe<br/>\non a hilltop silhouetted in the sunlight) standing firm - in her self worth<br/>\n- in her self awareness - making choices and finding energy to pursue her<br/>\nown challenges. Hooray!!!<br/>\nThanks for your sharing you guys, and allowing me the space to get a little<br/>\nclearer on how strong and  wonderful our daughter has always been.<br/>\nUnschooling on purpose rather than thru lack of organization, and reading<br/>\nall the emails and just being full of trust and respect for some months now<br/>\nis great (and sometimes difficult). Our daughter seems to be finding new<br/>\nperspective and confidence. Old hidden memories of the unhappy tensions and<br/>\nboredom and pain in her school years are slowly surfacing. The guilt and<br/>\nshame she experienced over leaving school is gradually clearing up. Deep<br/>\nsigh...<br/>\nThanks for sharing your journeys,<br/>\nSheri<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\nTo visit your group on the web, go to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/AlwaysLearning/\">http://groups.yahoo.com/group/AlwaysLearning/</a><br/>\n  <br/>\nTo unsubscribe from this group, send an email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning-unsubscribe@yahoogroups.com\">AlwaysLearning-unsubscribe@yahoogroups.com</a><br/>\n  <br/>\nYour use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":19287,"nextTopicId":19293}}