{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":94797851,"authorName":"Karin","from":"&quot;Karin&quot; &lt;curtkar@...&gt;","profile":"kc85022","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] doing your job","postDate":"1016567379","msgId":32756,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNmIwMWMxY2Y3ZiQzNTRmYzEyMCQ2NDAwYThjMEBnb2R6aWxsYT4=","referencesHeader":"PDE3ZC41MWU3ZmM1LjI5YzQxMTRjQGFvbC5jb20+IDwwMDdhMDFjMWNlYTgkZjdlMDhhODAkNjQwMGE4YzBAZ29kemlsbGE+IDwwMDRmMDFjMWNlZjEkYzliNjZhYTAkYzBmZTMyM2ZAVEhJTktQQUQ3NjBYTD4="},"prevInTopic":0,"nextInTopic":32771,"prevInTime":32755,"nextInTime":32757,"topicId":32756,"numMessagesInTopic":0,"msgSnippet":"Hi Heather, I m glad that you found something useful in my story and that you can relate. Your struggles and conflicts you are feeling sound so familiar to me.","messageBody":"<div id=\"ygrps-yiv-4555228\">Hi Heather,<br/>\nI&#39;m glad that you found something useful in my story and that you can relate. Your struggles and conflicts you are feeling sound so familiar to me. I always felt better after we &quot;accomplished&quot; something during the day. But achieving the accomplishment was always our problem. I think you are well on your way to unschooling, you are listening to your children! Now you just have to work on deschooling yourself a bit more. For me, that entailed reading and reading. Learning about how others went through the same experience and how happy they were now. Knowing that I wanted those things for my family, too. And learning to let go and trust and respect my kids. To live our lives joyfully without chains dragging us down.<br/>\n<br/>\nI&#39;m not sure if I can do this, but I hope Sandra won&#39;t mind. It&#39;s something she wrote about what moms can do if they feel the need of accomplishing something, or checklisting their day while still unschooling. I saved it and refer to it sometimes if I feel the need. I really like the ideas she had. <br/>\n<br/>\nKarin<br/>\n<br/>\n------------------------<br/>\n<br/>\nSandra, I hope I have your permission to post this.<br/>\nIf you would rather that I not do this in the future, just let me know.<br/>\n<br/>\nSandra wrote:<br/>\nOne way for moms who love to checklist their days to provide without managing <br/>\nis to go afield of verbal presentation.  Go through a list of the senses.  <br/>\nAnd if each day you try to provide something interesting to taste, touch, <br/>\nhear, see and smell, his day will be more full than flat.  Too many families <br/>\nstop at things to hear and see. (Because school stops there, I guess.)<br/>\n<br/>\nBut you don&#39;t have to do this until he&#39;s 17.  You can do it until you&#39;re <br/>\nconfident that he&#39;s filled with experiences to cross-reference at his own <br/>\nleisure (in dreams, in fantasies, in future incidents which remind him of <br/>\nthose, etc.) and you feel satisfied that you&#39;re not a slacker.<br/>\n<br/>\nIf just &quot;the five sense&quot; seems a lame checklist and you want four dimensional <br/>\ninstead of three, maybe each day work into conversation something about the <br/>\npast and something about the future.  (I can hardly imagine a day without <br/>\nthose coming up naturally in my own family, but in case you&#39;re not really <br/>\ntalkative or something, it&#39;s something for the checklist.)  If it comes up <br/>\nnaturally in conversation you could say &quot;They didnt&#39; even have chainsaws <br/>\nuntil... [whenever little gasoline engines were common, or whatever the <br/>\nseminal technological feature is] and would have had to do all this with a <br/>\nhand saw, or an axe.  (That&#39;s if you cut firewood with a chainsaw, not if <br/>\nyou&#39;re sitting around working a jigsaw puzzle of tiger cubs in the forest.)  <br/>\nOr you could say &quot;How long do you think we will have these dishes?  When too  <br/>\nmany are broken, what kind should we get next?&quot; (if you have a girl with <br/>\nthose sorts of interests).  Various kinds of mind-casting conversations into <br/>\nthe past (personal past or technological past or cultural past or planetary <br/>\npast) or into the future (tomorrow, next year, next century) help kids build <br/>\ntheir internal model of the universe.  I know I&#39;ve used that phrase half a <br/>\ndozen times talking about unschooling, but I think it&#39;s one of the coolest <br/>\nideas.  <br/>\n<br/>\n<br/>\n--------------------------------------<br/>\n<br/>\n<br/>\nHeather wrote:<br/>\n<br/>\nKarin,<br/>\n<br/>\nThanks so much for writing this - I am going through this exact thing myself. I feel this tremendous guilt sometimes that if I am not &quot;schooling&quot; - then I am not doing my job... Today for example, my 7yr old has a drama class - she loves it. They are doing The Tempest by Shakespeare and the woman who is doing it is wonderful - She gets the kids moving and doing all kinds of fun things while she is introducing the story and the plots - they don&#39;t even feel like they are &quot;learning&quot; Shakespeare.  Today it snowed and though it wasn&#39;t too bad, they must have cancelled class . I come home and feel somehow that we should DO something... and start suggesting - when all she really wants to do is go out and play in the snow. So of course, she does - it may be the last snow for us in New England - but I feel that I have somehow failed to do my job today... as if the day was a waste...   I struggle with this constantly... I think I am not totally won over to the unschooling philosophy. I love the idea of it - but when it comes down to it - I think it is that I am impatient and unsure of myself. I love this list - I hope I will get to the point that you did... and really believe it whole heartedly. Thanks for your story - it does help some of us that are struggling with the same issue - to hopefully overcome it :)<br/>\n<br/>\nHeather<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] doing your job","postDate":"1016565217","msgId":32771,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE2My5hOTdmZmQwLjI5YzhlN2UxQGFvbC5jb20+"},"prevInTopic":32756,"nextInTopic":0,"prevInTime":32770,"nextInTime":32772,"topicId":32756,"numMessagesInTopic":0,"msgSnippet":"In a message dated 3/19/02 10:48:33 AM, curtkar@cox.net writes: ","messageBody":"<div id=\"ygrps-yiv-1093270853\">In a message dated 3/19/02 10:48:33 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:curtkar@...\">curtkar@...</a> writes:<br/>\n<br/>\n&lt;&lt; Sandra, I hope I have your permission to post this.<br/>\nIf you would rather that I not do this in the future, just let me know. &gt;&gt;<br/>\n<br/>\nOnce things are put out in public they&#39;re public!  <br/>\nPosting it back to a similarly public place (or the same one, I don&#39;t <br/>\nremember &lt;g&gt;) is fine.</div>","specialLinks":[]}],"prevTopicId":32761,"nextTopicId":32708}}