{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":56,"messages":[{"userId":411981224,"authorName":"apprentice_mom","from":"&quot;apprentice_mom&quot; &lt;justine@...&gt;","profile":"apprentice_mom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Selfishness","postDate":"1332300359","msgId":66300,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGprYmhvNys5MzRmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGprOGdjYyszcDd2QGVHcm91cHMuY29tPg=="},"prevInTopic":66299,"nextInTopic":66301,"prevInTime":66299,"nextInTime":66301,"topicId":66232,"numMessagesInTopic":0,"msgSnippet":"... I think this is a great way to look at it. Awhile back Sandra wrote something about how if she was in a store and her kids asked for something and she","messageBody":"<div id=\"ygrps-yiv-698743893\"><blockquote><span title=\"ireply\">&gt; Another way of thinking of that is - if your kids started swimming lessons, would you take the money out of their allowance? A magazine subscription? A book club? If your budget was tight enough, you might, but a lot of times a family budget has a certain amount of wiggle room in it.<br/>\n<br/>\n </span></blockquote>I think this is a great way to look at it.<br/>\n<br/>\nAwhile back Sandra wrote something about how if she was in a store and her kids asked for something and she thought it was something that was going to contribute to their learning, she would just buy it for them - no issue about making the kids use their allowance or anything like that (sorry, Sandra, if I haven&#39;t remembered your exact wording, but I think this is what you meant).<br/>\n<br/>\nI do try to do this also.  When my kids ask for something, I try to say yes, but sometimes, if it is something I think is a bit pricey and perhaps not likely to be used once we get it home, I falter a bit.  It&#39;s kind of impossible to have a discussion with a 6 and 3 year old in the store in full view of the item, but what we have started doing is writing down the things they say they want, so that we can talk about whether or not it is something we can buy a bit later and/or something they really want?  The oldest does understand that things sometimes look more attractive in the store than they do once you actually have them, and she is getting that we need to make decisions about what we spend our money on, so that we can afford the things she really wants to have.<br/>\n<br/>\nI think allowances are a great thing, but my oldest has no interest in having money of her own - which I used to think was kind of weird, because she does indeed want to buy things in the store, but she told me later that she would rather just ask me to buy it for her, because, mostly, she gets things she really wants.  On reflecting, I think also that she finds being confronted with so many things that look so nice and feeling strongly &quot;the wants&quot; is kind of stressful, and so by leaving the decision to buy with me for now, it helps her with that. I&#39;m quite sure she&#39;ll let me know when she changes her mind and wants money of her own! :)<br/>\n<br/>\nI find also that the two kids are much worse in stores about wanting to buy &quot;something, anything&quot; when they are together - when I go into places with only one, there is much more ability to just look, enjoy, think about what we want for later, that sort of thing.  This is true for both the 3 and 6 year old.</div>","specialLinks":[]},{"userId":170380942,"authorName":"Lisa","from":"&quot;Lisa&quot; &lt;lisa@...&gt;","profile":"cslisacs","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Selfishness","postDate":"1332292692","msgId":66299,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGprYmE4aytzYjhvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGprOGNqbitqcDEzQGVHcm91cHMuY29tPg=="},"prevInTopic":66296,"nextInTopic":66300,"prevInTime":66298,"nextInTime":66300,"topicId":66232,"numMessagesInTopic":0,"msgSnippet":"I just wanted to share how we do the money thing! Joe, my 9 year old, gets 1% of our income.  Our income varies month to month so that 1% varies too.  We don t","messageBody":"<div id=\"ygrps-yiv-841226225\">I just wanted to share how we do the money thing!  <br/>\n<br/>\nJoe, my 9 year old, gets 1% of our income.  Our income varies month to month so that 1% varies too.  We don&#39;t tie it to anything.<br/>\n<br/>\nHe has asked me to further split up that 1% so I save 30% of it for a mansion for him when he&#39;s older and then some goes into a &#39;play&#39; jar, some goes into a &#39;gaming&#39; jar, and some goes into a &#39;toy&#39; jar.<br/>\n<br/>\nIf I have the money, I will most times just buy Joe what he wants.  If I don&#39;t, it sure is nice to be able to take the money from his jar and get him what he wants.  If he has no money and I have no money he is just fine with waiting till we have money.  He&#39;s really good about it actually.<br/>\n<br/>\nWhen Joe was younger, he wanted everything he saw, and we bought him a LOT of stuff.  Now that he is 9, he rarely wants anything except video games and he doesn&#39;t even want many of those.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Selfishness","postDate":"1332287900","msgId":66296,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZGQzM5QTc5LUUyRkMtNEIwRi1CNTRCLTc2OTczODIwMzFDQkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PENBTTZBM04wR20wU2d5MFRGTlNxQ1NBYnpGRFlFNUFpQmh4X2Q4dVFLTUVGRGlLb08zUUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PGprOGdjYyszcDd2QGVHcm91cHMuY29tPiA8ams4a2J2K2k4ZHFAZUdyb3Vwcy5jb20+IDxDQU02QTNOMEdtMFNneTBURk5TcUNTQWJ6RkRZRTVBaUJoeF9kOHVRS01FRkRpS29PM1FAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":66295,"nextInTopic":66299,"prevInTime":66295,"nextInTime":66297,"topicId":66232,"numMessagesInTopic":0,"msgSnippet":"-=-On her last birthday she asked to go to her favourite restaurant; on the way there my husband James (her father) gave her £100 in cash, so she was able to","messageBody":"<div id=\"ygrps-yiv-1814331372\">-=-On her last birthday she asked to go to her favourite restaurant; on the<br/>\nway there my husband James (her father) gave her £100 in cash, so she was<br/>\nable to pay for the meal and leave the tip.-=-<br/>\n<br/>\nThat&#39;s a great idea.  <br/>\nSometimes our kids asked for money to buy other kids gifts, like at Christmas or around a birthday.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":221591978,"authorName":"Bernadette Lynn","from":"Bernadette Lynn &lt;bernadette.lynn@...&gt;","profile":"bwalyalynn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Selfishness","postDate":"1332261153","msgId":66295,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBTTZBM04wR20wU2d5MFRGTlNxQ1NBYnpGRFlFNUFpQmh4X2Q4dVFLTUVGRGlLb08zUUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGprOGtiditpOGRxQGVHcm91cHMuY29tPg==","referencesHeader":"PGprOGdjYyszcDd2QGVHcm91cHMuY29tPiA8ams4a2J2K2k4ZHFAZUdyb3Vwcy5jb20+"},"prevInTopic":66285,"nextInTopic":66296,"prevInTime":66294,"nextInTime":66296,"topicId":66232,"numMessagesInTopic":0,"msgSnippet":"... ===================================== My eldest loves spending money on the others, and giving them chocolate or sweets. Sometimes I give her a stack of","messageBody":"<div id=\"ygrps-yiv-529343345\">On 20 March 2012 00:52, batesfamily5 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:MATT_LISABATES@...\">MATT_LISABATES@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; &gt;&gt;My middle child will buy a candy bar every payday but saves the rest<br/>\n&gt; of his money.<br/>\n&gt; &gt; **************<br/>\n&gt; &gt;<br/>\n&gt; It&#39;s something he likes to do.  Sometimes he will want to buy everyone a<br/>\n&gt; candy bar too.  He shows great pride in himself to be able to do this.  Not<br/>\n&gt; my other boys!<br/>\n&gt;<br/>\n </span></blockquote>=====================================<br/>\n<br/>\nMy eldest loves spending money on the others, and giving them chocolate or<br/>\nsweets. Sometimes I give her a stack of chocolate bars to keep in her<br/>\ndrawer and she gives them out as presents when she wants. We usually have<br/>\nchocolate in a bag in the kitchen for people to help themselves but the<br/>\nyounger three love being given bars as presents. Or when we go to the shops<br/>\nI&#39;ll give her some money and ask her to buy something for everyone -<br/>\nfivepenny lollipops from the sweetshop are the current favourite. That<br/>\nway Charlotte can be generous without spending her own money.<br/>\n<br/>\nOn her last birthday she asked to go to her favourite restaurant; on the<br/>\nway there my husband James (her father) gave her £100 in cash, so she was<br/>\nable to pay for the meal and leave the tip. We were prepared to pay the<br/>\ntip, having told her to keep the change, but she wanted to do that bit as<br/>\nwell. She loved asking for the bill and the experience of having taken us<br/>\nout to dinner. She&#39;s asked if, for her next birthday, she can be given<br/>\nmoney to take us out to dinner as well.<br/>\n<br/>\nBernadette.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":199094060,"authorName":"batesfamily5","from":"&quot;batesfamily5&quot; &lt;MATT_LISABATES@...&gt;","profile":"batesfamily5","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Selfishness","postDate":"1332206506","msgId":66285,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGprOG0zYSttaXY3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzMzIyMDEzNzAuMTUwMTMuWWFob29NYWlsTmVvQHdlYjgxNTA2Lm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":66284,"nextInTopic":66295,"prevInTime":66284,"nextInTime":66286,"topicId":66232,"numMessagesInTopic":0,"msgSnippet":"... Lisa","messageBody":"<div id=\"ygrps-yiv-1262236488\"><blockquote><span title=\"ireply\">&gt; Do they only buy things they want or get a candy when they have money or do you also sometimes, within your budget, give them things and candy they want freely? <br/>\n&gt; <br/>\n&gt; Hi Alex!  We are pretty generous with our children however our boys seem to take a real pride in themselves in being able to buy something for themselves.  We buy clothing, electronics, family games and everything but they enjoy being able to buy that special toy, candy bar or whatever is on their hearts themselves.  As I think about it, I did the love language quiz with my guys and their love language is quality time and touch.  Maybe that is why we have so many games in the house!<br/>\n<br/>\n </span></blockquote>Lisa</div>","specialLinks":[]},{"userId":199094060,"authorName":"batesfamily5","from":"&quot;batesfamily5&quot; &lt;MATT_LISABATES@...&gt;","profile":"batesfamily5","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Selfishness","postDate":"1332204735","msgId":66284,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGprOGtiditpOGRxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGprOGdjYyszcDd2QGVHcm91cHMuY29tPg=="},"prevInTopic":66283,"nextInTopic":66285,"prevInTime":66283,"nextInTime":66285,"topicId":66232,"numMessagesInTopic":0,"msgSnippet":"... It s something he likes to do.  Sometimes he will want to buy everyone a candy bar too.  He shows great pride in himself to be able to do this.  Not my","messageBody":"<div id=\"ygrps-yiv-2081686385\"><blockquote><span title=\"ireply\">&gt; &gt;&gt;My middle child will buy a candy bar every payday but saves the rest of his money.<br/>\n&gt; **************<br/>\n&gt; <br/>\n </span></blockquote>It&#39;s something he likes to do.  Sometimes he will want to buy everyone a candy bar too.  He shows great pride in himself to be able to do this.  Not my other boys!</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Selfishness","postDate":"1332203040","msgId":66283,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYwRTJFOEQwLTcxM0EtNDBFRS04NDlBLTcxMkM2MEM5OTcwOUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PENBT09UYVhPMWs0NUV0ZStlVGVDazNXUWhXSjVtK05xUWFvKzFEK3ZuMUtaVDFROXJfZ0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PENBRkxLeTMzbWF1ZGV5VE45ZnU9TWErdXU1Y0t6WWkrZ3VXaFpxY3JXNUpuWWVnVnpld0BtYWlsLmdtYWlsLmNvbT4gPGprOGNqbitqcDEzQGVHcm91cHMuY29tPiA8Q0FPT1RhWE8xazQ1RXRlK2VUZUNrM1dRaFdKNW0rTnFRYW8rMUQrdm4xS1pUMVE5cl9nQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":66282,"nextInTopic":66284,"prevInTime":66282,"nextInTime":66284,"topicId":66232,"numMessagesInTopic":0,"msgSnippet":"-=-They are all super good at handling money now, in their 20 s. They save, they spend happily, they earn money. They don t seem to have any issues about","messageBody":"<div id=\"ygrps-yiv-1614438597\">-=-They are all super good at handling money now, in their 20&#39;s. They save,<br/>\nthey spend happily, they earn money. They don&#39;t seem to have any &quot;issues&quot;<br/>\nabout money - they are responsible and careful with it, but not miserly.-=-<br/>\n<br/>\nMy kids are 20(Holly), 23 (Marty) and 25 (Kirby).<br/>\n<br/>\nThe 23 year old is currently unemployed, but he&#39;s over fixing the fence of a neighbor for $50, in some very cold weather.<br/>\nThe 25 year old was here for a week.  Holly and I were admiring his coat, when he wasn&#39;t looking.  He brought his warmest jacket, so we could go up to the top of the mountain with Jill and her kids early in the week.  It&#39;s really nice--nicer than any we ever bought him.<br/>\n<br/>\nHolly said she thought it was nice that he treats himself, now that he lives away from home.  He bought a nearly-new car (two years old, I think? maybe mor) from Carmax, he keeps an iPhone, and bought liquor for a party here.   Yet he also has savings, and though we offered to pay for some dental work he needed, he accepted half and will pay half.<br/>\n<br/>\nMarty&#39;s (the 23 year old&#39;s) computer is four years old and was running slowly.  I had offered in January to get him a computer for his birthday, but he said no, it was okay.  Kirby sat and upgraded and de-fragged and messed with it for a long time one day, having first backed up what looked important on to his own (Kirby&#39;s) back-up drive (which he brought for music purposes, I think; he didn&#39;t bring a computer).  I told Kirby that if the computer wasn&#39;t going to be better, maybe he could go with Marty to pick another one.  He shrugged and shook his head, and worked it back into smooth operations.<br/>\n<br/>\nEach of them had a job, as a teen, from 14 or 15 on, enough that their allowance was a minor part of their funding in those days.  Both Holly and Marty have also gone longish periods without jobs, but they&#39;re so careful with money when they are making it that they tend to have savings to last many months.<br/>\n<br/>\nThey&#39;re all better with money than I ever have been.  Some of it is genetic, I think.  Keith&#39;s family is very thrifty and mathematical.  Some of it, though, is the calm that comes with a feeling of abundance, and with knowing that if they really needed something, we would help them.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":504505579,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Selfishness","postDate":"1332201833","msgId":66282,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBT09UYVhPMWs0NUV0ZStlVGVDazNXUWhXSjVtK05xUWFvKzFEK3ZuMUtaVDFROXJfZ0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGprOGNqbitqcDEzQGVHcm91cHMuY29tPg==","referencesHeader":"PENBRkxLeTMzbWF1ZGV5VE45ZnU9TWErdXU1Y0t6WWkrZ3VXaFpxY3JXNUpuWWVnVnpld0BtYWlsLmdtYWlsLmNvbT4JPGprOGNqbitqcDEzQGVHcm91cHMuY29tPg=="},"prevInTopic":66281,"nextInTopic":66283,"prevInTime":66281,"nextInTime":66283,"topicId":66232,"numMessagesInTopic":0,"msgSnippet":"Basing it on age works okay when they are little. But when they are older, it isn t necessarily true that the older child will have more expensive wants","messageBody":"<div id=\"ygrps-yiv-188902701\">Basing it on age works okay when they are little. But when they are older,<br/>\nit isn&#39;t necessarily true that the older child will have more expensive<br/>\nwants compared to a younger one.  So I&#39;d suggest being flexible about that<br/>\nidea of age being the determining factor. If it is working, then fine, but<br/>\nmaybe don&#39;t assume that it is somehow more fair than other methods might be<br/>\nfor your particular kids.<br/>\n<br/>\nWhen my kids were older, we worked out with each of them individually how<br/>\nmuch they needed and we could afford. Roya is my oldest and when she was 13<br/>\nwe added up how much she typically spent on clothes, gifts for her friends,<br/>\npostage, cd&#39;s, books, stationary, cosmetics, and other things that she<br/>\noften wanted to buy. These were things that she would want a LOT of - and<br/>\nit was too hard for her to know how much was reasonable to spend so she<br/>\nasked a lot. And so, with her asking a lot, I felt like I was saying no<br/>\nquite often and that &quot;I&quot; was too concerned and worried about what she<br/>\nbought. She had a lot of friends and wanted to buy gifts for them. I didn&#39;t<br/>\nlike discouraging generosity, but we couldn&#39;t afford the amount of<br/>\ngenerosity she wanted to engage in. The first time we added it all up I<br/>\nthink it was an average of about $35 per month so we gave her $35 per month<br/>\nto spend on any of those items without me having the say-so over how she<br/>\nspent it. The deal was that that was the money we had to spend on those<br/>\nkinds of things for her and she had full control over the breakdown. So the<br/>\nfirst month she bought a single piece of clothing and had no more money and<br/>\nshe was fine with that. After that she budgeted and shopped thrift stores a<br/>\nlot in order to have more to spend on other things. We bought her things<br/>\ntoo, but they were more like gifts.<br/>\n<br/>\nThis system worked extremely well for us. My kids each reached an age where<br/>\nthey were interested in clothes, in particular, and instead of constantly<br/>\nasking if it was okay to buy something, they could decide if it was worth<br/>\nspending their money on it.<br/>\n<br/>\nThe best thing about it - since I didn&#39;t have final say-so over whether<br/>\nthey&#39;d buy it or not, I could give advice and they could consider my advice<br/>\nmore easily. For example, previously when I held the purse strings, if they<br/>\nwanted to buy a dress that I could see was badly constructed and I knew was<br/>\nnot a very good fit on them, it would be hard for me to be willing to spend<br/>\nthe money, but they would not see it as a trade-off of this dress for<br/>\nsomething else - when the something else came up, they&#39;d ask for that, too.<br/>\nWith their own money, they could listen to my opinion and make their own<br/>\ndecision. VERY quickly they began to take my advice, for the most part,<br/>\nbecause they came to realize that it wasn&#39;t worth spending their own money<br/>\non something that they would not wear often in the future.<br/>\n<br/>\nThis was never a hard and fast rule - we were always flexible and we always<br/>\ncontinued to get stuff for them....but having money that was clearly theirs<br/>\nreally helped them understand how buying one thing meant giving up buying<br/>\nsomething else.<br/>\n<br/>\nThey are all super good at handling money now, in their 20&#39;s. They save,<br/>\nthey spend happily, they earn money. They don&#39;t seem to have any &quot;issues&quot;<br/>\nabout money - they are responsible and careful with it, but not miserly.<br/>\nSeems to have worked out well.<br/>\n<br/>\n-pam<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Mon, Mar 19, 2012 at 3:39 PM, batesfamily5 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:MATT_LISABATES@...\">MATT_LISABATES@...</a>&gt;wrote:<br/>\n<br/>\n&gt; We give according to their age.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Selfishness","postDate":"1332201370","msgId":66281,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMzIyMDEzNzAuMTUwMTMuWWFob29NYWlsTmVvQHdlYjgxNTA2Lm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PGprOGNqbitqcDEzQGVHcm91cHMuY29tPg==","referencesHeader":"PENBRkxLeTMzbWF1ZGV5VE45ZnU9TWErdXU1Y0t6WWkrZ3VXaFpxY3JXNUpuWWVnVnpld0BtYWlsLmdtYWlsLmNvbT4gPGprOGNqbitqcDEzQGVHcm91cHMuY29tPg=="},"prevInTopic":66280,"nextInTopic":66282,"prevInTime":66280,"nextInTime":66282,"topicId":66232,"numMessagesInTopic":0,"msgSnippet":"  Hi, I m Lisa, I m new to the unschooling group.  We ve been relaxed homeschoolers and I m still trying to wrap myself around all of it.  I ve been reading","messageBody":"<div id=\"ygrps-yiv-578328008\">  <br/>\nHi, I&#39;m Lisa, I&#39;m new to the unschooling group.  We&#39;ve been &quot;relaxed&quot; homeschoolers and I&#39;m still trying to wrap myself around all of it.  I&#39;ve been reading and learning quite a bit so far.  I have a ways to go though.  I hope that I might add something here to contribute.<br/>\n<br/>\n&lt;&lt;&lt;&quot;I did receive some wonderful advice from a wonderful woman about this subject not too long ago.  My children have paydays.  It&#39;s the same as their dads paydays.  We went to the bank and picked up those registers you use for your checkbook.  The boys each have one.  On payday I write in their &quot;pay&quot;.  It&#39;s not attached to chores.  We give according to their age.  Each birthday receives a raise.  My 4 year old receives $2 each payday,  my 5 year old receives $2.50 each payday and my 8 year old receives $8.  They prefer to keep their &quot;checkbooks&quot; in my purse so that when we are at the store and they see something they want we can check to see if they have enough money.  My sons love this whole process and feel very impowered.  My 4 year old is waiting until the end of the month so he can purchase a new app and my 8 year old is saving for rollerblades.  He is researching prices right now so he can get a great deal.  My middle child will buy a candy bar<br/>\n every payday but saves the rest of his money.&quot;&gt;&gt;&gt;&gt;<br/>\n<br/>\nDo they only buy things they want or get a candy when they have money or do you also sometimes, within your budget, give them things and candy they want freely? <br/>\n<br/>\nI think it is great that kids can have their own money and do what they want with it but some parents go to extremes and they will not give the kids anything  other than birthday presents, Christmas presents and necessities. <br/>\n They want to create a lesson so the child is sure to learn how to spend their money and save.  <br/>\n I do give my kids money but I also give them things , within our budget , or save to give them things they want.<br/>\nI see them learning  and better yet they do not seem needy and hungry and feeling like they do not get what they want.<br/>\nThey wait, they look with me for sales and used items, they evaluate what they really want.<br/>\nOne thing I did when my kids were between 3-5 ( and maybe even today but I remember that age being very into buying many toys ) was to go<br/>\nto Goodwill with a budget  and fill the cart with everything they saw they wanted and then in the end they would pick what they most wanted up to the<br/>\namount we could spend. <br/>\n<br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Selfishness","postDate":"1332200960","msgId":66280,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZBMkZCMjY3LUUwNDQtNDkwOS1CQTk2LTI5RjFDNEU3NkQzM0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGprOGdjYyszcDd2QGVHcm91cHMuY29tPg==","referencesHeader":"PGprOGdjYyszcDd2QGVHcm91cHMuY29tPg=="},"prevInTopic":66279,"nextInTopic":66281,"prevInTime":66279,"nextInTime":66281,"topicId":66232,"numMessagesInTopic":0,"msgSnippet":"-=- We give according to their age. -=-I ve heard of that and it doesn t make a whole lot of sense to me other than in the sense that when my kids were","messageBody":"<div id=\"ygrps-yiv-88123811\">-=-&gt;&gt; We give according to their age. <br/>\n<br/>\n-=-I&#39;ve heard of that and it doesn&#39;t make a whole lot of sense to me other than in the sense that when my kids were younger I did more buying for them, especially when they were little and their interest in spending was pretty immediate. -=-<br/>\n<br/>\nWe raised the amount on each child&#39;s birthday.  They learned a ton of math from it. :-)   <br/>\nThey wanted something to happen on their birthdays, and I think that raise in allowance was the biggest thing, but they were good about saving money and being careful with it.  And it there was something I really thought was great, I&#39;d buy it for them myself.<br/>\n<br/>\nI wrote some about a time when one of them had a lot of money, one had none, and we went to Disneyland.<br/>\nJust this morning, Kirby was looking around for things he wanted to take home with him to Austin (he was here a week, and left this afternoon, to drive back there).  He was looking for some gaming supplies, and I asked him if he had the Elvis.  That&#39;s mentioned in this article.  (He had gotten it on a previous trip.)<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/spoiled\">http://sandradodd.com/spoiled</a><br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Selfishness","postDate":"1332200652","msgId":66279,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGprOGdjYyszcDd2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGprOGNqbitqcDEzQGVHcm91cHMuY29tPg=="},"prevInTopic":66277,"nextInTopic":66280,"prevInTime":66278,"nextInTime":66280,"topicId":66232,"numMessagesInTopic":0,"msgSnippet":"... *************** For awhile Mo liked to be able to carry her own money and hold it in her hands but had a tendency to lose it, so we made our own play","messageBody":"<div id=\"ygrps-yiv-2057355372\">&quot;batesfamily5&quot; &lt;MATT_LISABATES@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;My children have paydays.  It&#39;s the same as their dads paydays.  We went to the bank and picked up those registers you use for your checkbook.  The boys each have one.<br/>\n </span></blockquote>***************<br/>\n<br/>\nFor awhile Mo liked to be able to carry her own money and hold it in her hands but had a tendency to lose it, so we made our own play money. I&#39;d carry the actual cash and she&#39;d trade it to me at the cash register for her play money. A couple times she lost the play money in the store, but since I had the real cash, it wasn&#39;t a big deal. It was fun for awhile. If you don&#39;t tend to use cash, then a running account for kids makes sense. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; We give according to their age. <br/>\n<br/>\n </span></blockquote>I&#39;ve heard of that and it doesn&#39;t make a whole lot of sense to me other than in the sense that when my kids were younger I did more buying for them, especially when they were little and their interest in spending was pretty immediate. I&#39;d get them things they weren&#39;t likely to run across at the local dollar store. As they&#39;ve gotten older their wants are more specific so I do less of the buying - but the overall spending reflects our household budget more than the ages of the various family members. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;My middle child will buy a candy bar every payday but saves the rest of his money.<br/>\n </span></blockquote>**************<br/>\n<br/>\nThis is an interesting thing, because if I noticed I was buying something once a week - like a cup of fancy coffee - I&#39;d look for a way to work that in to the budget in a more cost effective way. To use the coffee example, I&#39;d start making my own coffee, or upgrade to a nicer brand, or buy fancy additives for my home coffee and drop the once-a-week expense. In terms of the overall budget, that would make sense. Similarly, when one of my kids is consistently buying... oh what have they bought? Most recently for Mo it&#39;s been Cheetos, so we added those to the grocery list and found a less costly brand at our grocery store than what&#39;s available at the convenience store (Mo doesn&#39;t like to go grocery shopping). Those sorts of additions tend not to make a big difference in the grocery bill, but they do make for more options and a greater sense of abundance in terms of pocket money. If I don&#39;t get that fancy coffee any more, I can get... a new book, some nice shower soap, incense, a cute candle, or some really fun new yarn. If Mo&#39;s not spending so much on Cheetos, she can get a bigger lego kit, or a new movie, or a new game rather than a used one. <br/>\n<br/>\nAnother way of thinking of that is - if your kids started swimming lessons, would you take the money out of their allowance? A magazine subscription? A book club? If your budget was tight enough, you might, but a lot of times a family budget has a certain amount of wiggle room in it.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Selfishness","postDate":"1332197763","msgId":66277,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZFRDI0QTlGLTIwRUYtNDVCMy05MUI2LUJFOTIxQzM1ODdEN0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGprOGNqbitqcDEzQGVHcm91cHMuY29tPg==","referencesHeader":"PGprOGNqbitqcDEzQGVHcm91cHMuY29tPg=="},"prevInTopic":66276,"nextInTopic":66279,"prevInTime":66276,"nextInTime":66278,"topicId":66232,"numMessagesInTopic":0,"msgSnippet":"-=-My middle child will buy a candy bar every payday but saves the rest of his money.-=- This might seem off topic, and I know you re still new to radical","messageBody":"<div id=\"ygrps-yiv-701335203\">-=-My middle child will buy a candy bar every payday but saves the rest of his money.-=-<br/>\n<br/>\nThis might seem off topic, and I know you&#39;re still new to radical unschooling, but if candy bars are in the same category as major personal purchases, it seems it might be something you might want to add to regular grocery purchases.  <br/>\n<br/>\nMy kids sometimes took cash, and sometimes we wrote it on the calendar and it was &quot;in the bank of Dad.&quot;  I like the idea of having the records available at stores.   There are some ideas about kids and money and allowances here:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/money\">http://sandradodd.com/money</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/math/allowance\">http://sandradodd.com/math/allowance</a><br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":199094060,"authorName":"batesfamily5","from":"&quot;batesfamily5&quot; &lt;MATT_LISABATES@...&gt;","profile":"batesfamily5","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Selfishness","postDate":"1332196791","msgId":66276,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGprOGNqbitqcDEzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBRkxLeTMzbWF1ZGV5VE45ZnU9TWErdXU1Y0t6WWkrZ3VXaFpxY3JXNUpuWWVnVnpld0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":66275,"nextInTopic":66277,"prevInTime":66275,"nextInTime":66277,"topicId":66232,"numMessagesInTopic":0,"msgSnippet":"Hi, I m Lisa, I m new to the unschooling group.  We ve been relaxed homeschoolers and I m still trying to wrap myself around all of it.  I ve been reading","messageBody":"<div id=\"ygrps-yiv-715541781\">Hi, I&#39;m Lisa, I&#39;m new to the unschooling group.  We&#39;ve been &quot;relaxed&quot; homeschoolers and I&#39;m still trying to wrap myself around all of it.  I&#39;ve been reading and learning quite a bit so far.  I have a ways to go though.  I hope that I might add something here to contribute.<br/>\n<br/>\n  I did receive some wonderful advice from a wonderful woman about this subject not too long ago.  My children have paydays.  It&#39;s the same as their dads paydays.  We went to the bank and picked up those registers you use for your checkbook.  The boys each have one.  On payday I write in their &quot;pay&quot;.  It&#39;s not attached to chores.  We give according to their age.  Each birthday receives a raise.  My 4 year old receives $2 each payday,  my 5 year old receives $2.50 each payday and my 8 year old receives $8.  They prefer to keep their &quot;checkbooks&quot; in my purse so that when we are at the store and they see something they want we can check to see if they have enough money.  My sons love this whole process and feel very impowered.  My 4 year old is waiting until the end of the month so he can purchase a new app and my 8 year old is saving for rollerblades.  He is researching prices right now so he can get a great deal.  My middle child will buy a candy bar every payday but saves the rest of his money.<br/>\n<br/>\nLisa</div>","specialLinks":[]},{"userId":392995157,"authorName":"Kristin Ames","from":"Kristin Ames &lt;kristinames@...&gt;","profile":"kristinames","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Selfishness","postDate":"1332195095","msgId":66275,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBQ3B0TUc9NWQ9Uk0taXk2MlF0djJteE04Y0xjVlNzUEtmRl9YdF9SaTV2WDFyVkQxUUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":66271,"nextInTopic":66276,"prevInTime":66274,"nextInTime":66276,"topicId":66232,"numMessagesInTopic":0,"msgSnippet":"from Sandra- (I m making fun of you, but not meanly. The second you have a positive attitude, even fleetingly, your life is better, right then.) yes! ","messageBody":"<div id=\"ygrps-yiv-792841122\">from Sandra-<br/>\n<br/>\n(I&#39;m making fun of you, but not meanly. The second you have a positive<br/>\nattitude, even fleetingly, your life is better, right then.)<br/>\n<br/>\nyes!<br/>\n<br/>\nhttp://sandradodd.**com/mindfulparen**ting&lt;http://sandradodd.com/mindfulparenting&gt;<br/>\n<br/>\nPeople don&#39;t need to google or go to other lists to learn about mindful<br/>\nparenting and positive attitudes.<br/>\n<br/>\nhttp://sandradodd.**com/joy &lt;http://sandradodd.com/joy&gt;<br/>\n<br/>\nso sorry! & I love both of those articles.<br/>\n<br/>\nYes, I&#39;m so green;)<br/>\nthank you.<br/>\nkristin<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":261223738,"authorName":"Claire Darbaud","from":"Claire Darbaud &lt;cdarbaud@...&gt;","profile":"cdarbaud","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Selfishness","postDate":"1332185384","msgId":66271,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBRzB1Vzhub2hoWUdvTTNSUFR1WDB0QmZnOD13NzVPTHBuRFF1aUt3RkdfS19xN0hYUUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDEzMzIxNjY3NjguNzcyOTEuWWFob29NYWlsTmVvQHdlYjgxNTA0Lm1haWwubXVkLnlhaG9vLmNvbT4=","referencesHeader":"PENBQ3B0TUc9VXFiVkg5TlFjVDYtVHdIazVnWFdrT2NrVFNtVWY0TmgyTVprRmUyN2Ird0BtYWlsLmdtYWlsLmNvbT4JPEEzOTQ5RDdBLUZDQkYtNEM1Ni04MENELTcyODUzRjJBMjVDNkBTYW5kcmFkb2RkLmNvbT4JPENBT09UYVhNN1NFQ0ZMTjRldUtpX0dnNG05UUNtODg3aUJCRV83VlA0NlRPN3lDM0ExZ0BtYWlsLmdtYWlsLmNvbT4JPENBRzB1VzhtZDNvMkphVlp0Q2FGR0RXUEtBQ0hta1l1a045PXVlMWtPMGs3MXVWOEctQUBtYWlsLmdtYWlsLmNvbT4JPDEzMzIxNjY3NjguNzcyOTEuWWFob29NYWlsTmVvQHdlYjgxNTA0Lm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":66265,"nextInTopic":66275,"prevInTime":66270,"nextInTime":66272,"topicId":66232,"numMessagesInTopic":0,"msgSnippet":"2012/3/19 BRIAN POLIKOWSKY  ... True, I totally agree with that :-) I guess I should rephrase: I have mentioned one or twice, very","messageBody":"<div id=\"ygrps-yiv-398266548\">2012/3/19 BRIAN POLIKOWSKY &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:polykowholsteins@...\">polykowholsteins@...</a>&gt;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; **<br/>\n&gt; &lt;&lt;&lt;&quot;I have mentioned once or twice, very casualy, that ads lie to try and<br/>\n&gt; get<br/>\n&gt; you to buy their stuff.  &quot;&gt;&gt;&gt;&gt;<br/>\n&gt;<br/>\n&gt; But that is  a huge generalization that is not even accurate!<br/>\n&gt; Some things that look amazing in adds are exactly what the add says!<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>True, I totally agree with that :-)<br/>\n<br/>\nI guess I should rephrase: &quot;I have mentioned one or twice, very casualy (as<br/>\nin not a buig deal) but in specific occasions when they noticed that toy so<br/>\nand so looks alive in the ad and is just a peace of plastic in real life,<br/>\nthat ads sometimes lie to make things look ultra appealing.&quot; I am not<br/>\nactually sure what woding I used, but I do know I don&#39;t demonize ads :-)<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Selfishness","postDate":"1332180853","msgId":66265,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGprN3QxbCs0aGI1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzMzIxNjY3NjguNzcyOTEuWWFob29NYWlsTmVvQHdlYjgxNTA0Lm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":66262,"nextInTopic":66271,"prevInTime":66264,"nextInTime":66266,"topicId":66232,"numMessagesInTopic":0,"msgSnippet":"... Sometimes ads are deceptive, not always. Rather than making sweeping statements about advertising, I ve pointed out the fine print in ads, like some","messageBody":"<div id=\"ygrps-yiv-401697896\">&lt;&lt;&lt;&quot;I have mentioned once or twice, very casualy, that ads lie to try and get<br/>\n<blockquote><span title=\"ireply\"> &gt; you to buy their stuff.  &quot;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>Sometimes ads are deceptive, not always. Rather than making sweeping statements about advertising, I&#39;ve pointed out the fine print in ads, like &quot;some elements sold separately&quot; - that was a big deal with Mo for play sets. She loooooves the idea of play sets, but was disappointed at how often they were shown with extra pieces added from other kits, or fabricated for the ad. In the end, she decided &quot;if you can&#39;t beat them, join them&quot; and started making her own &quot;play sets&quot;. She&#39;ll get Parts of things and combine them. She&#39;s also intrigued by the artistry behind making things look the way they do in ads - again, that was something I mentioned and pointed out, but not in terms of &quot;ads lie&quot; so much as &quot;this is how they do the special effects&quot; much the same way I talk about monster or sci fi effects in movies. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":284087656,"authorName":"Karen","from":"&quot;Karen&quot; &lt;semajrak@...&gt;","profile":"semajrak","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Selfishness","postDate":"1332176973","msgId":66262,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGprN3A4ZCtwNGlhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBT09UYVhQb3BOMkRUTzNraXdCMFVOTGtmVlpGTjBvOXI2Nkp3TEZfSD1CTF82ZHJad0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":66258,"nextInTopic":66265,"prevInTime":66261,"nextInTime":66263,"topicId":66232,"numMessagesInTopic":0,"msgSnippet":"... *********** Working through not feeling shame for wanting things has been a big part of my deschooling.  I m not sure it is called deschooling.  It may not","messageBody":"<div id=\"ygrps-yiv-1451493343\"><blockquote><span title=\"ireply\">&gt; There is nothing<br/>\n&gt; wrong with &quot;want&quot; - we don&#39;t have to justify wanting stuff. We don&#39;t have<br/>\n&gt; to talk about their underlying needs to make it okay for them to want<br/>\n&gt; stuff. We can honor that they are young humans and humans WANT stuff.<br/>\n&gt; <br/>\n&gt; -pam<br/>\n </span></blockquote>***********<br/>\n<br/>\nWorking through not feeling shame for wanting things has been a big part of my deschooling.  I&#39;m not sure it is called deschooling.  It may not be a school relic from my past, but rather a conventional upbringing relic.  <br/>\n<br/>\nAnyway, when I was a girl, I loved Lego (among many other things).  One friend of mine had a huge collection, but I wasn&#39;t allowed to play with them when I went over to her house because they were always being built into something big, fabulous and untouchable.  When I cautiously asked for some Lego of my own, my mom didn&#39;t see the purpose in it, didn&#39;t have a spot for it, and didn&#39;t want the mess.  I only asked once or twice.  I had learned early that when my mom said no, she meant no.  No point asking again.  So, I longed for Lego and many other things, and felt confused about where that longing came from--a bit selfish for it, and a bit ashamed.  <br/>\n<br/>\nWhen Ethan was born, I was so excited to play with toys again.  Ironically, when Ethan was old enough to walk around a toy store, he would look at and play with lots of different things.  I would say, &quot;Do you want to bring that home?&quot;  He would say, &quot;No.&quot;  What??  I would go ahead and pick out a toy for him, but I soon realized that I was picking out a toy for myself.  <br/>\n<br/>\nHe is nine now.  He can still take or leave most things.  I think it is just part of his personality.  My dad is that way.  Ethan loves virtual things.  He loves imaginative things.  He doesn&#39;t have a big desire for real world toys, although he did just pick out for himself a big nerf gun from the Toys R Us wonderland in NYC recently!  We have a lot of toys here at home.  They are mostly mine.  In fact, I&#39;ve now started openly requesting Lego kits for presents.  I no longer disguise them as gifts for Ethan.  Ethan likes to watch me build.  Sometimes he likes to help, but mostly he just likes to watch.  I like to see his friends disassemble my Lego creations after I have completed them.  Often the parents of the children will say, &quot;Oh, no!  Don&#39;t take that appart!&quot;  But I remember what it felt like to see those wonderful curiosities and want to explore.  It gives me great joy to encourage that to happen in my home.  <br/>\n<br/>\nBest of all, it feels good to have less negative self-judgement about my wants and needs.  It has taken me a long time to get here.  I still have a ways to go, but I am hopeful that Ethan will not have to travel this particular journey.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Selfishness","postDate":"1332167305","msgId":66258,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk4NEZBREVBLThBQ0QtNDRCRC1CQTdELTZBNkUwREY1NjAwRkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDEzMzIxNjY3NjguNzcyOTEuWWFob29NYWlsTmVvQHdlYjgxNTA0Lm1haWwubXVkLnlhaG9vLmNvbT4=","referencesHeader":"PENBQ3B0TUc9VXFiVkg5TlFjVDYtVHdIazVnWFdrT2NrVFNtVWY0TmgyTVprRmUyN2Ird0BtYWlsLmdtYWlsLmNvbT4gPEEzOTQ5RDdBLUZDQkYtNEM1Ni04MENELTcyODUzRjJBMjVDNkBTYW5kcmFkb2RkLmNvbT4gPENBT09UYVhNN1NFQ0ZMTjRldUtpX0dnNG05UUNtODg3aUJCRV83VlA0NlRPN3lDM0ExZ0BtYWlsLmdtYWlsLmNvbT4gPENBRzB1VzhtZDNvMkphVlp0Q2FGR0RXUEtBQ0hta1l1a045PXVlMWtPMGs3MXVWOEctQUBtYWlsLmdtYWlsLmNvbT4gPDEzMzIxNjY3NjguNzcyOTEuWWFob29NYWlsTmVvQHdlYjgxNTA0Lm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":66257,"nextInTopic":66262,"prevInTime":66257,"nextInTime":66259,"topicId":66232,"numMessagesInTopic":0,"msgSnippet":"-=-But there are also things we bought that look super amazing in the ads and were the same in real life.-=- Some are even better.  iPads, for example. :-) ","messageBody":"<div id=\"ygrps-yiv-638398000\">-=-But there are also things we bought that look super amazing in the ads and were the same in real life.-=-<br/>\n<br/>\nSome are even better.  iPads, for example. :-)<br/>\n<br/>\nSome things are boring in ads, or don&#39;t even have ads, and are really nice, so I think ads are just one part of the way people find things to buy.  Sometimes they shop in person, or ask for recommendations from friends, or read reviews in magazines, or on online catalog sites.  Many online stores now have customer reviews of the clothes or toys or gadgets right on the same page as their descriptions.  <br/>\n<br/>\nSome people (even people selling things) are way more honest than others.  Some companies (and people) are unscrupulous bullshitters, but that doesn&#39;t mean everyone is.  It means part of learning to live in the world is to be discerning and selective, and to learn to tell sensible, plain information from dressed-up poo.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Selfishness","postDate":"1332166768","msgId":66257,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMzIxNjY3NjguNzcyOTEuWWFob29NYWlsTmVvQHdlYjgxNTA0Lm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PENBRzB1VzhtZDNvMkphVlp0Q2FGR0RXUEtBQ0hta1l1a045PXVlMWtPMGs3MXVWOEctQUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PENBQ3B0TUc9VXFiVkg5TlFjVDYtVHdIazVnWFdrT2NrVFNtVWY0TmgyTVprRmUyN2Ird0BtYWlsLmdtYWlsLmNvbT4gPEEzOTQ5RDdBLUZDQkYtNEM1Ni04MENELTcyODUzRjJBMjVDNkBTYW5kcmFkb2RkLmNvbT4gPENBT09UYVhNN1NFQ0ZMTjRldUtpX0dnNG05UUNtODg3aUJCRV83VlA0NlRPN3lDM0ExZ0BtYWlsLmdtYWlsLmNvbT4gPENBRzB1VzhtZDNvMkphVlp0Q2FGR0RXUEtBQ0hta1l1a045PXVlMWtPMGs3MXVWOEctQUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":66255,"nextInTopic":66258,"prevInTime":66256,"nextInTime":66258,"topicId":66232,"numMessagesInTopic":0,"msgSnippet":" But that is  a huge generalization that is not","messageBody":"<div id=\"ygrps-yiv-2112159810\">&lt;&lt;&lt;&quot;I have mentioned once or twice, very casualy, that ads lie to try and get<br/>\nyou to buy their stuff.  &quot;&gt;&gt;&gt;&gt;<br/>\n<br/>\n<br/>\nBut that is  a huge generalization that is not even accurate!<br/>\nSome things that look amazing in adds are exactly what the add says!<br/>\n<br/>\nMy kids also know that things may not be what the add portrays and we do read reviews too. They know that adds can exaggerate and not <br/>\ngive you an accurate description of the item it is trying to sell.<br/>\nMy kids have experienced that. <br/>\n<br/>\nBut there are also things we bought that look super amazing in the adds and were the same in real life.<br/>\n<br/>\nGigi wanted the Perfect Brownie Pan so I saw it on Target  and got it. It is really amazing and it does make absolutely <br/>\nperfect brownies. We love that pan!<br/>\n<br/>\nSo we are careful, we read reviews and we see videos of it so we can check it out if there is something we want.<br/>\nWe do not just think that all ads are lying and they are out to get us.<br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":261223738,"authorName":"Claire Darbaud","from":"Claire Darbaud &lt;cdarbaud@...&gt;","profile":"cdarbaud","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Selfishness","postDate":"1332151225","msgId":66255,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBRzB1VzhtZDNvMkphVlp0Q2FGR0RXUEtBQ0hta1l1a045PXVlMWtPMGs3MXVWOEctQUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PENBT09UYVhNN1NFQ0ZMTjRldUtpX0dnNG05UUNtODg3aUJCRV83VlA0NlRPN3lDM0ExZ0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PENBQ3B0TUc9VXFiVkg5TlFjVDYtVHdIazVnWFdrT2NrVFNtVWY0TmgyTVprRmUyN2Ird0BtYWlsLmdtYWlsLmNvbT4JPEEzOTQ5RDdBLUZDQkYtNEM1Ni04MENELTcyODUzRjJBMjVDNkBTYW5kcmFkb2RkLmNvbT4JPENBT09UYVhNN1NFQ0ZMTjRldUtpX0dnNG05UUNtODg3aUJCRV83VlA0NlRPN3lDM0ExZ0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":66254,"nextInTopic":66257,"prevInTime":66254,"nextInTime":66256,"topicId":66232,"numMessagesInTopic":0,"msgSnippet":"2012/3/18 Pam Sorooshian  ... Yes! And I was very surprised to see that develop pretty fast in my children. I would have thought they","messageBody":"<div id=\"ygrps-yiv-554336440\">2012/3/18 Pam Sorooshian &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pamsoroosh@...\">pamsoroosh@...</a>&gt;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; *** And they will come to know about marketing and how it is intended to<br/>\n&gt; persuade<br/>\n&gt; them to want certain things over others. ***<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Yes!<br/>\n<br/>\nAnd I was very surprised to see that develop pretty fast in my children. I<br/>\nwould have thought they would be well in their teens before they caught the<br/>\nmarketing persuasion scam for what it is. But they notice it right now<br/>\n(they&#39;re 8 and 6). There is an add on TV These days for a spiderman web<br/>\nprojection device. In the add, the kid has the device on his wrist and<br/>\nthrows a web onto his bed. My daughter picked it up right away, she said:<br/>\n&quot;mummy, I bet that&#39;s another of those advertisement lying to kids, it&#39;s<br/>\njust dumb plastic and it just throws yucky stuff that will make the bed all<br/>\nmessy and disgusting&quot;.<br/>\nI have mentioned once or twice, very casualy, that ads lie to try and get<br/>\nyou to buy their stuff. We got a robot for christmas, the kids chose it by<br/>\nwatching videos and ads online. They were disapointed because it was way<br/>\ncooler in the ad then in real life. We went online and checked for reviews.<br/>\nSome reviewers were equally disapointed. And then the other day, my<br/>\ndaughter saw a toy she thought could be cool, a toy helicopter with a<br/>\ncamera, and she asked &quot;can you check online if it&#39;s really cool?&quot;. Turns<br/>\nout a lot of reviewers said it&#39;s fun but very fragile and it brakes very<br/>\nfast. She said &quot;I don&#39;t want it then&quot;! :-)<br/>\n<br/>\nAbout 6 to 8 months ago, applying the principles found here, I started to<br/>\nalways say yes, with a kind smile, when my kids ask me to buy something I<br/>\ncan afford. And I am really surprised how things are turning out. My kids<br/>\nare actually starting to make thoughtful decisions about what we should buy<br/>\nand when. For Christmas, I said &quot;ok we can buy a PS3, but it costs A LOT of<br/>\nmoney and we won&#39;t be able to afford anything else&quot; and the kids said &quot;drop<br/>\nit, we&#39;ll have skylander for the wii and a bunch of figures instead&quot;.<br/>\n<br/>\nI used to arbitrarily say yes or no, say &quot;we can&#39;t afford this&quot; when we<br/>\nreally could... Now I really try, as best as I can to say yes if I can find<br/>\nthe money for it, an extra chocolate bar, sweets, cheap toys... etc is<br/>\nalways a yes. And my kids are becoming very thoughttful and very very<br/>\nreasonable with money, and it&#39;s amasing to watch!<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":504505579,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Selfishness","postDate":"1332117425","msgId":66254,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBT09UYVhQb3BOMkRUTzNraXdCMFVOTGtmVlpGTjBvOXI2Nkp3TEZfSD1CTF82ZHJad0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDg1QTdFMzg0LTUwNkUtNDg1Ni04N0U4LTlEQTAyMDA0RkM3MEBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PENBQ3B0TUc9VXFiVkg5TlFjVDYtVHdIazVnWFdrT2NrVFNtVWY0TmgyTVprRmUyN2Ird0BtYWlsLmdtYWlsLmNvbT4JPEEzOTQ5RDdBLUZDQkYtNEM1Ni04MENELTcyODUzRjJBMjVDNkBTYW5kcmFkb2RkLmNvbT4JPENBT09UYVhNN1NFQ0ZMTjRldUtpX0dnNG05UUNtODg3aUJCRV83VlA0NlRPN3lDM0ExZ0BtYWlsLmdtYWlsLmNvbT4JPDg1QTdFMzg0LTUwNkUtNDg1Ni04N0U4LTlEQTAyMDA0RkM3MEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":66249,"nextInTopic":66255,"prevInTime":66253,"nextInTime":66255,"topicId":66232,"numMessagesInTopic":0,"msgSnippet":"I understand what Joyce meant. What Joyce said was that kids asking for lots of things is not selfishness, it is need. I m saying it is more clear to call it","messageBody":"<div id=\"ygrps-yiv-1363999982\">I understand what Joyce meant. What Joyce said was that kids asking for<br/>\nlots of things is not selfishness, &quot;it is need.&quot; I&#39;m saying it is more<br/>\nclear to call it &quot;want&quot; than &quot;need.&quot; When we&#39;re in a store with children<br/>\nand rollin&#39; down an aisle and they are asking, &quot;Can I have that? Can I have<br/>\nthat?&quot; and pointing to things that happen to catch their eye, I don&#39;t think<br/>\nreferring to those as &quot;needs&quot; is helping people think more clearly about it<br/>\nbecause we&#39;re talking about wanting to buy things on a sort of whim.<br/>\n<br/>\nJoyce went on to talk about kids have needs that go beyond material goods,<br/>\netc., and that&#39;s true for sure. I&#39;m not saying there are no needs. I&#39;m<br/>\nsaying that it is FINE for kids to simply want what they see. It is natural<br/>\nand healthy and human - not sinful or greedy or selfish.  There is nothing<br/>\nwrong with &quot;want&quot; - we don&#39;t have to justify wanting stuff. We don&#39;t have<br/>\nto talk about their underlying needs to make it okay for them to want<br/>\nstuff. We can honor that they are young humans and humans WANT stuff.<br/>\n<br/>\n-pam<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sun, Mar 18, 2012 at 1:37 PM, Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; wrote:<br/>\n<br/>\n&gt; -=-I&#39;m a little bit bothered by Joyce&#39;s use of the word &quot;need&quot; for<br/>\n&gt; everything<br/>\n&gt; anybody ever wants. I do think &quot;need&quot; has a meaning that goes beyond want<br/>\n&gt; and I don&#39;t use it for every want - for example I wouldn&#39;t use it when I&#39;m<br/>\n&gt; talking about the impulse to buy a cup of coffee when I smell the aroma as<br/>\n&gt; I walk by a Starbucks. I don&#39;t think every want is best referred to as a<br/>\n&gt; need. But that&#39;s not an good reason to be dismissive about another person&#39;s<br/>\n&gt; wants.-=-<br/>\n&gt;<br/>\n&gt; I don&#39;t think Joyce said that people need everything they want.<br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Selfishness","postDate":"1332103041","msgId":66249,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg1QTdFMzg0LTUwNkUtNDg1Ni04N0U4LTlEQTAyMDA0RkM3MEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PENBT09UYVhNN1NFQ0ZMTjRldUtpX0dnNG05UUNtODg3aUJCRV83VlA0NlRPN3lDM0ExZ0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PENBQ3B0TUc9VXFiVkg5TlFjVDYtVHdIazVnWFdrT2NrVFNtVWY0TmgyTVprRmUyN2Ird0BtYWlsLmdtYWlsLmNvbT4gPEEzOTQ5RDdBLUZDQkYtNEM1Ni04MENELTcyODUzRjJBMjVDNkBTYW5kcmFkb2RkLmNvbT4gPENBT09UYVhNN1NFQ0ZMTjRldUtpX0dnNG05UUNtODg3aUJCRV83VlA0NlRPN3lDM0ExZ0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":66247,"nextInTopic":66254,"prevInTime":66248,"nextInTime":66250,"topicId":66232,"numMessagesInTopic":0,"msgSnippet":"-=-I m a little bit bothered by Joyce s use of the word need for everything anybody ever wants. I do think need has a meaning that goes beyond want and I","messageBody":"<div id=\"ygrps-yiv-99223112\">-=-I&#39;m a little bit bothered by Joyce&#39;s use of the word &quot;need&quot; for everything<br/>\nanybody ever wants. I do think &quot;need&quot; has a meaning that goes beyond want<br/>\nand I don&#39;t use it for every want - for example I wouldn&#39;t use it when I&#39;m<br/>\ntalking about the impulse to buy a cup of coffee when I smell the aroma as<br/>\nI walk by a Starbucks. I don&#39;t think every want is best referred to as a<br/>\nneed. But that&#39;s not an good reason to be dismissive about another person&#39;s<br/>\nwants.-=-<br/>\n<br/>\nI don&#39;t think Joyce said that people need everything they want.<br/>\n<br/>\nShe wrote &quot;Second, it&#39;s not even accurate. It&#39;s need. Though not, as is often assumed, a<br/>\nneed for &quot;material wealth.&quot; The world is full of fascinating looking things and<br/>\nthey want to sample it all! Don&#39;t look at some end point where you want them to<br/>\nbe, like kids who don&#39;t want everything they see. Give them a *variety of ways*<br/>\nto sample and explore the world rather than bringing one tiny bit home at a<br/>\ntime.&quot;<br/>\n<br/>\nNot need for the thing itself, but a need to touch, hold, try out, experience things they see.  <br/>\n<br/>\nThey have a need to learn, and that learning looks like acquisition and collecting sometimes.  <br/>\n<br/>\nAnd if a child isn&#39;t feeling abundance, there are things parents can do other than buy everything he points at.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":504505579,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Selfishness","postDate":"1332101691","msgId":66247,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBT09UYVhNN1NFQ0ZMTjRldUtpX0dnNG05UUNtODg3aUJCRV83VlA0NlRPN3lDM0ExZ0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PEEzOTQ5RDdBLUZDQkYtNEM1Ni04MENELTcyODUzRjJBMjVDNkBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PENBQ3B0TUc9VXFiVkg5TlFjVDYtVHdIazVnWFdrT2NrVFNtVWY0TmgyTVprRmUyN2Ird0BtYWlsLmdtYWlsLmNvbT4JPEEzOTQ5RDdBLUZDQkYtNEM1Ni04MENELTcyODUzRjJBMjVDNkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":66246,"nextInTopic":66249,"prevInTime":66246,"nextInTime":66248,"topicId":66232,"numMessagesInTopic":0,"msgSnippet":"I used to keep a little notebook in my purse to write down things we wanted to consider buying later. These days, I d use my phone and take a photo and keep a","messageBody":"<div id=\"ygrps-yiv-729572978\">I used to keep a little notebook in my purse to write down things we wanted<br/>\nto consider buying later.<br/>\n<br/>\nThese days, I&#39;d use my phone and take a photo and keep a &quot;want this&quot;<br/>\npinterest board.<br/>\n<br/>\nI&#39;m a little bit bothered by Joyce&#39;s use of the word &quot;need&quot; for everything<br/>\nanybody ever wants. I do think &quot;need&quot; has a meaning that goes beyond want<br/>\nand I don&#39;t use it for every want - for example I wouldn&#39;t use it when I&#39;m<br/>\ntalking about the impulse to buy a cup of coffee when I smell the aroma as<br/>\nI walk by a Starbucks. I don&#39;t think every want is best referred to as a<br/>\nneed. But that&#39;s not an good reason to be dismissive about another person&#39;s<br/>\nwants.<br/>\n<br/>\nPeople do want things - they always want things. There is no limit to our<br/>\nwants - we are an insatiable bundle of wants.  I think this reality is so<br/>\n&#39;out there&#39; in children, they express it so rawly and openly, that it makes<br/>\nparents uncomfortable because they are in denial about the reality that it<br/>\nalso exists in themselves. I think it bothers parents when their children<br/>\nvociferously express so many wants. But, instead of trying to stop them<br/>\nfrom wanting, better to support them - get catalogs to look through<br/>\ntogether, get online and look at online catalogs together, talk about dream<br/>\nvacations and travel, imagine buying the snazziest coolest and most<br/>\ninteresting houses you might see. Revel in the wanting!! We sometimes go<br/>\nfor walks in the super fancy snazzy neighborhoods with the multi-million<br/>\ndollar homes (we live in Southern California) and we pretend we are<br/>\nshopping for a house. We analyze which ones we like and which we would have<br/>\n(ha). We do the same in the super expensive department stores where we<br/>\ncan&#39;t really afford to shop. We try on clothes and take surreptitious<br/>\nphotos in the dressing room. Some people test drive cars for fun.<br/>\n<br/>\nSome people are so anti-consumerism that they are appalled by their<br/>\nchildren&#39;s materialism -- but children are concrete and it is in their<br/>\nnature to want the cool things they see. Don&#39;t make them feel bad for<br/>\nhaving those wants! Over time, they will come to terms with the reality<br/>\nthat we can&#39;t have everything we want and that choice is part of life. AND<br/>\nthey will come to understand that there are better and worse choices. And<br/>\nthey will come to know about marketing and how it is intended to persuade<br/>\nthem to want certain things over others. And they will learn about<br/>\nenvironmental issues and things like excessive packaging and wasted<br/>\nresources and so on. There is time for them to learn all that. They are not<br/>\n&quot;being bad&quot; because they don&#39;t know things already and because they want<br/>\nthings now.<br/>\n<br/>\nAnd, it isn&#39;t selfishness - that would be wanting to have everything and<br/>\nnot caring at all about anybody else having anything. It is desire. It is<br/>\nwant! &quot;Want&quot; drives us. It is our motivation for everything. We want<br/>\nphysical goods and we want services and we want other things like attention<br/>\nand peace of mind and challenge and relationship and so on.<br/>\n<br/>\nPsychologists do talk about needs and the most useful of what they talk<br/>\nabout is Maslow&#39;s hierarchy of needs. It is a really good idea for parents<br/>\nto understand the kinds of needs children do have.<br/>\n<br/>\nIn the meantime, though, my advice is to try to find a way to enjoy the<br/>\n&quot;wanting&quot; of children - they take such pure and unadulterated joy in what&#39;s<br/>\naround them - toys and games and pretty things - and the fact that they<br/>\nwant those things to take home is quite a reasonable reaction. The more we<br/>\nunderstand and try to help them achieve it to the extent we (reasonably)<br/>\ncan do so, the more we are supporting their happiness.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Selfishness","postDate":"1332092404","msgId":66246,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGprNTZsaytnbzZiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGprM291aytndnRyQGVHcm91cHMuY29tPg=="},"prevInTopic":66244,"nextInTopic":66247,"prevInTime":66245,"nextInTime":66247,"topicId":66232,"numMessagesInTopic":0,"msgSnippet":"... ************ Go to cheaper stores. That may come across as flippant, but when Mo was younger, she would want to get something in every store we went to -","messageBody":"<div id=\"ygrps-yiv-96620883\">&quot;cimsha&quot; &lt;cimsha@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; How do you deal with selfishness in your children?  Specifically, wanting things in a store ALL the time.<br/>\n </span></blockquote>************<br/>\n<br/>\nGo to cheaper stores. That may come across as flippant, but when Mo was younger, she would want to get something in every store we went to - so I didn&#39;t take her to stores where I couldn&#39;t afford something. I&#39;d arrange to go without her and instead take her to yard sales, or the bank (free balloon or candy) or a dollar store. I&#39;d work out how much spending money there was and kind of divvy it up in my head so I could tell her an amount for each store - and I&#39;d adjust the amount based on costs of things, so maybe she&#39;d have $5 to spend at the grocery store but $2 at the dollar store, because the grocery prices things higher. <br/>\n<br/>\nBut part of that process also included getting away from the idea of selfishness and instead seeing learning - learning about generosity, but also about exploration and discovery and economics and budgeting. I didn&#39;t make it a lesson, I worked on being honest with myself about how much money there was to spend and to communicate that to my kid in a way that made sense to her. She didn&#39;t want the breakdown of the income/spending for the whole family (some kids do, not Mo) she wanted a hard number to work with when we walked through the door of each shop. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I am still trying to learn and wrap my head around the unschooling philosophy and not saying &quot;no&quot;.<br/>\n </span></blockquote>**************<br/>\n<br/>\nIt&#39;s not a rule that unschoolers shouldn&#39;t say no ;) &quot;Say yes more&quot; is a starting point, but it&#39;s better to understand the underlying principles so that you know why you&#39;re saying yes or no - it&#39;s a thoughtful decision on your part, rather than an effort to do &quot;what you&#39;re supposed to do&quot;.<br/>\n<br/>\nIt can help, with something like spending money, to think of ways to take your personal baggage out of the mix. A lot of adult decision making about money is tied up in personal baggage - we make a lot of &quot;should I buy this?&quot; decisions based on very fuzzy criteria in our heads which often comes down to what feels good in the moment. That&#39;s not helpful to kids who are trying to learn about the world - and it&#39;s one of the reasons kids will ask for Everything, in order to try and figure out those fuzzy criteria. <br/>\n<br/>\nAn allowance is one way to get your baggage out of the mix - kids can buy Anything they want with the money, no argument... although it&#39;s kind and thoughtful to point out that something else would be a better buy, or help kids divide up the money among stores. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;We will go broke if I say yes to material things all of the time.<br/>\n<br/>\n </span></blockquote>One of the advantages of being broke is it makes the math easy ;)<br/>\n <br/>\nThere are real limits in life. Where unschooling takes a different philosophical slant is by seeing that statement as a starting point rather than an end-game. For most parents &quot;life has limits&quot; is a reason to say No. But if your goal is to be your child&#39;s partner, &quot;life has limits&quot; is an invitation to help your child navigate a complex and sometimes frustrating world. Too little money can be a chance to talk about wish lists, savings, and comparative shopping And it can be a chance to be generous and offer up part of your own spending money to stretch the budget, And it can be a chance to commiserate with your child when you can&#39;t find another option. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Selfishness","postDate":"1332087869","msgId":66244,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEEzOTQ5RDdBLUZDQkYtNEM1Ni04MENELTcyODUzRjJBMjVDNkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PENBQ3B0TUc9VXFiVkg5TlFjVDYtVHdIazVnWFdrT2NrVFNtVWY0TmgyTVprRmUyN2Ird0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PENBQ3B0TUc9VXFiVkg5TlFjVDYtVHdIazVnWFdrT2NrVFNtVWY0TmgyTVprRmUyN2Ird0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":66243,"nextInTopic":66246,"prevInTime":66243,"nextInTime":66245,"topicId":66232,"numMessagesInTopic":0,"msgSnippet":"-=-... that talks about these kids of positive attitudes having an actual positive effect on your life. Part of mindful parenting. It takes practice but it s","messageBody":"<div id=\"ygrps-yiv-324080548\">-=-... that talks about these kids of<br/>\npositive attitudes having an actual positive effect on your life. Part of<br/>\nmindful parenting. It takes practice but it&#39;s worthwhile for me.-=-<br/>\n<br/>\nMaybe you want to rephrase or re-think whether positive attitudes can have an actual positive effect on your life. :-)<br/>\n<br/>\nWhen would that effect begin?<br/>\n<br/>\n(I&#39;m making fun of you, but not meanly.  The second you have a positive attitude, even fleetingly, your life is better, right then.)<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/mindfulparenting\">http://sandradodd.com/mindfulparenting</a><br/>\n<br/>\nPeople don&#39;t need to google or go to other lists to learn about mindful parenting and positive attitudes.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/joy\">http://sandradodd.com/joy</a><br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":392995157,"authorName":"Kristin Ames","from":"Kristin Ames &lt;kristinames@...&gt;","profile":"kristinames","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Selfishness","postDate":"1332084854","msgId":66243,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBQ3B0TUc9VXFiVkg5TlFjVDYtVHdIazVnWFdrT2NrVFNtVWY0TmgyTVprRmUyN2Ird0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":66242,"nextInTopic":66244,"prevInTime":66242,"nextInTime":66244,"topicId":66232,"numMessagesInTopic":0,"msgSnippet":"Joyce said: Let them pick out things to carry around the store and then return them when you re ready to leave. Often just having something new for that amount","messageBody":"<div id=\"ygrps-yiv-720654960\">Joyce said:<br/>\nLet them pick out things to carry around the store and then return them<br/>\nwhen you&#39;re ready to leave. Often just having something new for that amount<br/>\nof time is enough.<br/>\n<br/>\nJoyce&#39;s suggestions helps us most times. We do this almost everytime we go<br/>\ninto any store; Eli (3 yrs) will find something he &quot;wants&quot; & I&#39;ll say<br/>\nthat&#39;s a great &quot;store toy&quot;, you can play with until we leave. Then after<br/>\ncheck out (sometimes before if it&#39;s crowded & we&#39;re late) we&#39;ll make the<br/>\nlast activity of shopping be to return it to it&#39;s place in the store<br/>\ntogether. This satisfies him most times, or he&#39;ll bring another & another<br/>\nto my attention & we&#39;ll  repeat this until we have to go.<br/>\n<br/>\nAt times his desire of some large something goes beyond the &quot;store toy&quot;<br/>\ntreatment and I&#39;ll usually agree with him that it&#39;s a terrific toy & I&#39;d<br/>\nlike to play with it too, we&#39;ll talk about saving up for it, say how we&#39;d<br/>\nlike to play with it & generally talk about it until we&#39;re out of the<br/>\nstore. Often this makes him feel fine about not being able to play with it<br/>\nor buy it  but other times, he&#39;ll be sad about not being able to get it &<br/>\nI&#39;ll validate those feelings expressing my own feelings of sadness about<br/>\nnot being able to get it. Then we&#39;ll play on the way home, or some other<br/>\nactivity happens & usually after that, he&#39;ll be fine again.<br/>\n<br/>\nWe also make a point to go to the toy store just for a toy, (or book, cape,<br/>\netc...& for us this can be a real toy store or Rite Aid, at 3 there are<br/>\ntoys everywhere he&#39;s interested in)<br/>\n<br/>\nThere&#39;s an idea about thinking yes even when you&#39;re saying no that helps me<br/>\nin this situation. I&#39;m thinking yes, that is a fun thing, even as I know we<br/>\nwon&#39;t be buying it & my attitude seems less no-y, if that makes any<br/>\nsense.......There&#39;s a web site by a man named Scott Noelle called &quot;<br/>\nenjoyparenting.com&quot; that you can google that talks about these kids of<br/>\npositive attitudes having an actual positive effect on your life. Part of<br/>\nmindful parenting. It takes practice but it&#39;s worthwhile for me.<br/>\n<br/>\n-- <br/>\nKristin Ames<br/>\n(917) 345-0111 Cel<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kristinames@...\">kristinames@...</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":327852347,"authorName":"Tress Miles","from":"Tress Miles &lt;milesdt@...&gt;","profile":"abacaxi7476","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Selfishness","postDate":"1332080103","msgId":66242,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBRkxLeTMzbWF1ZGV5VE45ZnU9TWErdXU1Y0t6WWkrZ3VXaFpxY3JXNUpuWWVnVnpld0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGprM291aytndnRyQGVHcm91cHMuY29tPg==","referencesHeader":"PGprM291aytndnRyQGVHcm91cHMuY29tPg=="},"prevInTopic":66238,"nextInTopic":66243,"prevInTime":66241,"nextInTime":66243,"topicId":66232,"numMessagesInTopic":0,"msgSnippet":"My daughter, now 9, has always become overwhelmed in a store.  It s all the clutter, the colors, the lights, the noises.  So I just don t take her.  If she has","messageBody":"<div id=\"ygrps-yiv-1550316331\">My daughter, now 9, has always become overwhelmed in a store.  It&#39;s all the<br/>\nclutter, the colors, the lights, the noises.  So I just don&#39;t take her.  If<br/>\nshe has a little money to spend, then we talk about how much it is and we<br/>\ngo specifically to let her pick out what she wants.  I don&#39;t do household<br/>\nshopping on those trips.  She can&#39;t handle going up and down all the<br/>\naisles.  Her response to overwhelm is to become demanding.<br/>\n<br/>\nMy elderly father lives with us, so I can leave the two of them home when I<br/>\nneed to shop.  Or I sometimes get a babysitter.<br/>\n<br/>\nJust my personal experience and what has worked for us.<br/>\n<br/>\nTress<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sun, Mar 18, 2012 at 12:39 AM, cimsha &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:cimsha@...\">cimsha@...</a>&gt; wrote:<br/>\n<br/>\n&gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; How do you deal with selfishness in your children? Specifically, wanting<br/>\n&gt; things in a store ALL the time. I am still trying to learn and wrap my head<br/>\n&gt; around the unschooling philosophy and not saying &quot;no&quot;. Unfortunately, I<br/>\n&gt; think I created this monster by saying Yes too much and I wasn&#39;t even on<br/>\n&gt; this journey yet. We will go broke if I say yes to material things all of<br/>\n&gt; the time.<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Selfishness","postDate":"1332070626","msgId":66238,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENCNjI5Q0ZDLUY1REMtNEI1Ny1CMUQ1LUI0RjhCRjJGMzNBOUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGprM291aytndnRyQGVHcm91cHMuY29tPg==","referencesHeader":"PGprM291aytndnRyQGVHcm91cHMuY29tPg=="},"prevInTopic":66236,"nextInTopic":66242,"prevInTime":66237,"nextInTime":66239,"topicId":66232,"numMessagesInTopic":0,"msgSnippet":"... First step: Don t call it selfishness. Really. Don t. First it causes you to see your kids as broken, filling you with a desire to fix them. Second, it s","messageBody":"<div id=\"ygrps-yiv-2021620275\">On Mar 18, 2012, at 12:39 AM, cimsha wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; How do you deal with selfishness in your children?<br/>\n<br/>\n </span></blockquote>First step: Don&#39;t call it selfishness. Really. Don&#39;t.<br/>\n<br/>\nFirst it causes you to see your kids as broken, filling you with a desire to fix them.<br/>\n<br/>\nSecond, it&#39;s not even accurate. It&#39;s need. Though not, as is often assumed, a need for &quot;material wealth.&quot; The world is full of fascinating looking things and they want to sample it all! Don&#39;t look at some end point where you want them to be, like kids who don&#39;t want everything they see. Give them a *variety of ways* to sample and explore  the world rather than bringing one tiny bit home at a time.<br/>\n<br/>\nBe understanding. Join in on the marveling. Look at the wealthy through their eyes. See what they see. Take time to be with them as they look at things.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Specifically, wanting things in a store ALL the time.<br/>\n<br/>\n </span></blockquote>Take them to the dollar store. Take them to Salvation Army, Goodwill, yard sales, or other used stuff store.<br/>\n<br/>\nOr take them to the regular store often with the express purpose of looking at stuff with no rush to leave.<br/>\n<br/>\nLet them pick out things to carry around the store and then return them when you&#39;re ready to leave. Often just having something new for that amount of time is enough.<br/>\n<br/>\nAvoid taking them shopping if they can&#39;t spend time looking at things and playing. Go when your husband&#39;s home.<br/>\n<br/>\nIf they want big things that you can save up for or things you&#39;ve come to realize will be abandoned soon after you arrive home, put them on a list. If you have a camera on your phone, take a picture of it. Put the list up where the kids can see it so they feel you&#39;re taking their needs seriously.<br/>\n<br/>\nGive them some money to spend in the store. Do still buy things for them when you can, when you feel it&#39;s something that will get a lot of use. But give them the power to make their own decisions too.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Selfishness","postDate":"1332070064","msgId":66236,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlEQUE0RDlGLTVEQTgtNEU5Mi1BQkMwLUE5RjlCNDM4QUQ3NEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGprM291aytndnRyQGVHcm91cHMuY29tPg==","referencesHeader":"PGprM291aytndnRyQGVHcm91cHMuY29tPg=="},"prevInTopic":66232,"nextInTopic":66238,"prevInTime":66235,"nextInTime":66237,"topicId":66232,"numMessagesInTopic":0,"msgSnippet":"-=-How do you deal with selfishness in your children?-=- Don t think of it or call it selfishness. -=- Specifically, wanting things in a store ALL the time.","messageBody":"<div id=\"ygrps-yiv-1881938059\">-=-How do you deal with selfishness in your children?-=-<br/>\n<br/>\nDon&#39;t think of it or call it &quot;selfishness.&quot;<br/>\n<br/>\n<br/>\n-=- Specifically, wanting things in a store ALL the time. -=-<br/>\n<br/>\nDon&#39;t take the kid to so many stores.  Go to thrift stores, yard sales.<br/>\n<br/>\nMaybe keep a list of things he&#39;s asked for, and occasionally look at the list together and see what he really still wants most.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":113475365,"authorName":"cimsha","from":"&quot;cimsha&quot; &lt;cimsha@...&gt;","profile":"cimsha","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Selfishness","postDate":"1332045588","msgId":66232,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGprM291aytndnRyQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":66236,"prevInTime":66231,"nextInTime":66233,"topicId":66232,"numMessagesInTopic":0,"msgSnippet":"How do you deal with selfishness in your children?  Specifically, wanting things in a store ALL the time.  I am still trying to learn and wrap my head around","messageBody":"<div id=\"ygrps-yiv-1165594367\">How do you deal with selfishness in your children?  Specifically, wanting things in a store ALL the time.  I am still trying to learn and wrap my head around the unschooling philosophy and not saying &quot;no&quot;.  Unfortunately, I think I created this monster by saying Yes too much and I wasn&#39;t even on this journey yet.  We will go broke if I say yes to material things all of the time.</div>","specialLinks":[]}],"prevTopicId":66691,"nextTopicId":66560}}