{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":112038769,"authorName":"Shyrley","from":"&quot;Shyrley&quot; &lt;shyrley.williams@...&gt;","profile":"bobalinga","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Did ya see this?","postDate":"1028142168","msgId":8267,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIwNzMxMTkwMjM5LkdZUFUxOTUzLm91dDAwNy52ZXJpem9uLm5ldEBtYXJrc2NvbXB1dGVyPg==","inReplyToHeader":"PDAwMjcwMWMyMzhhZiQ3YzEzMGExMCQxMWZlYThjMEBzcGVlZGRlYW1vbj4="},"prevInTopic":8250,"nextInTopic":0,"prevInTime":8266,"nextInTime":8268,"topicId":8233,"numMessagesInTopic":0,"msgSnippet":"Tutoring Gives Pupils an Edge . . . for Preschool July 31, 2002 By MAREK FUCHS Sophie Spencer, 5 and headed to kindergarten in the fall, has a tutor. Sophie","messageBody":"<div id=\"ygrps-yiv-90810566\">Tutoring Gives Pupils an Edge . . . for Preschool<br/>\n<br/>\nJuly 31, 2002<br/>\nBy MAREK FUCHS <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\nSophie Spencer, 5 and headed to kindergarten in the fall,<br/>\nhas a tutor. <br/>\n<br/>\nSophie does not need remedial work, which involves catching<br/>\nup or addressing learning disabilities and is the more<br/>\ntraditional form of tutoring for a child her age. <br/>\n<br/>\nBut she had shown great interest in reading and writing,<br/>\nand her mother, Suzanne Spencer, who lives in East Hampton,<br/>\nN.Y., thought that an hour a week with a reading specialist<br/>\nwould help Sophie along her way. <br/>\n<br/>\nAiming to give their young children a jump-start on their<br/>\nacademic experience, parents are having them work with<br/>\nprivate tutors. The goal is to have the children enter<br/>\nschool with a toehold on reading. <br/>\n<br/>\nSuch private tutoring, which costs $75 to $150 an hour, is<br/>\na cottage industry, with many tutors working on their own,<br/>\nso there are no accurate industry numbers. But educators,<br/>\ntutors and parents in well-to-do areas say the trend is<br/>\ngrowing. <br/>\n<br/>\n&quot;Nonremedial tutoring for children entering school is a<br/>\nrelatively new phenomenon,&quot; said Arthur Levine, the<br/>\npresident of Teachers College at Columbia University, &quot;but<br/>\nlike every type of tutoring, it is growing. Anything<br/>\nparents can do to give their children an edge, they are<br/>\ninterested in.&quot; <br/>\n<br/>\nThe trend is especially strong in Manhattan, Dr. Levine<br/>\nsaid, where the private school application process is so<br/>\ncompetitive. &quot;Once upon a time, parents prepared their<br/>\nchildren for the best university,&quot; he said. &quot;Now they<br/>\nprepare them for the best preschool.&quot; <br/>\n<br/>\nBut such tutoring elicits sharp divisions on the questions<br/>\nof whether it is effective or appropriate. One side<br/>\ncontends it is no different from sending a child to a<br/>\ngymnastics class to learn to do a handspring, and at the<br/>\nvery least can do no harm. The other side sees it as<br/>\nemblematic of a society that seems to be putting undue<br/>\npressure on children even as it farms out parental duties. <br/>\n<br/>\nFor Mrs. Spencer, Sophie&#39;s tutoring has been a success.<br/>\nSophie&#39;s tutor is her former nursery school teacher, who is<br/>\nalso a reading specialist. Mrs. Spencer said that she and<br/>\nher husband still read to Sophie and that the arrangement<br/>\nhad not put undue pressure on her. <br/>\n<br/>\n&quot;I wouldn&#39;t want to put her in a class every day,&quot; said<br/>\nMrs. Spencer, adding that in the summer, an hour a week was<br/>\nplenty of time &quot;to supplement what I&#39;m doing with her and<br/>\nencourage her.&quot; <br/>\n<br/>\nIn Chappaqua, N.Y., Linda Silbert runs the Strong Learning<br/>\nCenter, a private tutoring business, which focuses mainly<br/>\non remedial tutoring but also does nonremedial work. It<br/>\ncharges $75 an hour for instruction in its offices and $85<br/>\nif the tutor travels to the child&#39;s house. Dr. Silbert said<br/>\nthat nonremedial tutoring could be helpful in two<br/>\nparticular circumstances. When a child has advanced reading<br/>\nskills, a private tutor can help tailor a challenging<br/>\nprogram that keeps the student interested in reading. &quot;We<br/>\nhave a 5-year-old student who is reading on a fourth-grade<br/>\nlevel, but with such a higher cognitive level, was bored in<br/>\nschool,&quot; she said. &quot;We were able to put together a program<br/>\nfor her, and it&#39;s hard for a child like that to reach their<br/>\noptimal level unless you have one-on-one tutoring.&quot; <br/>\n<br/>\nDr. Silbert also said that many parents were drawn to early<br/>\ntutoring to pick up signs of problems. If a young child is<br/>\ntaught under close supervision, potential problems can be<br/>\nidentified and dealt with, which could head off larger ones<br/>\nor a loss of confidence once school starts, she said. <br/>\n<br/>\nSarah Chamlin tutors privately in Manhattan and Westchester<br/>\nCounty. She frequently receives calls inquiring about<br/>\nnonremedial tutoring for prekindergartners. But if there<br/>\nare no disabilities involved, she does not take the work. <br/>\n<br/>\n&quot;The impetus,&quot; she said, &quot;comes from so many parents being<br/>\nso concerned about getting kids ready for high-powered<br/>\nsystems. They say, `What does it mean that my child is not<br/>\nreading? I know that there are others out there who are.&#39; &quot;<br/>\nBut, she added, such tutoring &quot;is a waste, even if it&#39;s<br/>\ndone in a quote unquote fun way.&quot; <br/>\n<br/>\nFor one thing, she said, there is a stigma attached to<br/>\nreceiving summer tutoring that all children, even young<br/>\nones, can feel. &quot;Even if you say, `Mrs. J is coming over<br/>\nand you will have so much fun reading,&#39; kids know what&#39;s<br/>\ngoing on,&quot; she said. &quot;They say, `Oh my God, what&#39;s wrong<br/>\nwith me? Why do I have to go to a tutor in the summer?<br/>\nBilly isn&#39;t going.&#39; It&#39;s very hard for kids who need<br/>\ntutoring to come to terms with it, let alone those who<br/>\ndon&#39;t.&quot; If remedial tutoring is needed later in the child&#39;s<br/>\nacademic career, &quot;it can be complete burnout by then,&quot; she<br/>\nsaid. <br/>\n<br/>\nSome parents, Mrs. Chamlin said, look to early tutoring to<br/>\ncompensate for the hours they spend at work. <br/>\n<br/>\n&quot;Working parents might not feel that they can give their<br/>\nchildren what a tutor can,&quot; she said. &quot;But, in fact, they<br/>\ncan. All you need is 20 minutes, a half-hour a day to read<br/>\nto a child, and that will get them reading.&quot; <br/>\n<br/>\nBut Mark Pingitore, the director of the Tompkins Square<br/>\nMiddle School on the Lower East Side, said that private<br/>\ntutoring might give children an advantage, as well as send<br/>\na beneficial message. &quot;It can show them,&quot; he said &quot;that the<br/>\nparents value education.&quot; <br/>\n<br/>\nPam Wershba-Gershan, the lower school psychologist at the<br/>\nLittle Red Schoolhouse in Greenwich Village, said that<br/>\nnonremedial tutoring was not something she would<br/>\nparticularly recommend, especially if it came at the<br/>\nexpense of recreation. That is not to say it does not work,<br/>\nshe added. Such tutoring could help by providing a<br/>\nstructure for children to explore literature, words and<br/>\nprint. As they become ready to read, she said, the children<br/>\nare likely to jump into the structure and thrive. <br/>\n<br/>\nMrs. Spencer also sees an advantage in the fact that her<br/>\ndaughter &quot;is hearing she&#39;s doing really well from someone<br/>\nwho is not a parent.&quot; This summer&#39;s tutoring has even<br/>\nexpanded into math, which she said Sophie was enjoying too.<br/>\nIf, in the fall, Sophie already knows what is being taught,<br/>\nshe can involve herself in something else in the classroom,<br/>\nMrs. Spencer said. And even if the school&#39;s reading<br/>\nstrategy does not suit Sophie&#39;s learning style, she will<br/>\nstill have the skills in hand. <br/>\n<br/>\nReferring to the debate over such approaches to reading as<br/>\nwhole language and phonics, David Leonard, the associate<br/>\ndirector of the Child Development Institute at Sarah<br/>\nLawrence College in Yonkers, said: &quot;The reading wars have<br/>\ngiven some parents battle fatigue. They are anxious and<br/>\nconfused about what is happening in the schools with these<br/>\nliteracy fads that come and go.&quot; <br/>\n<br/>\nIf this is the case, he said, &quot;and they can find a tutoring<br/>\nprogram that approaches reading in a way they like, then<br/>\nI&#39;m probably in the camp that it can do no harm.&quot; <br/>\n<br/>\nThat said, Mr. Leonard added that some parents had been<br/>\naffected by the fact that the reading wars had created a<br/>\nmore complicated, and commercially competitive, sense of<br/>\nwhat it takes to learn reading. <br/>\n<br/>\n&quot;On television,&quot; he said, &quot;we see beaming actors who play<br/>\nparents say that their 3 1/2-year-old reads four books a<br/>\nday, thanks to this method or that. It&#39;s put a lot of<br/>\nparents under constant pressure.&quot; <br/>\n<br/>\n&quot;It makes the parent feel better,&quot; he added, &quot;to be able to<br/>\nsay, my child is getting tutoring so that they can read so<br/>\nmany words in 10 minutes or so many books, rather than have<br/>\nto say that their child seems to enjoy thumbing through<br/>\nbooks and they&#39;re pretty sure that their reading ability<br/>\nwill sort of come together.&quot; <br/>\n<br/>\nTo allay the pressure parents feel, Mrs. Chamlin tells<br/>\nparents who call for prekindergarten tutoring that, from<br/>\nwhat she sees, 90 percent of the children will be reading<br/>\nby the end of the school year. &quot;If not,&quot; she tells them,<br/>\n&quot;then call me.&quot; <br/>\n<br/>\nAnd Mr. Leonard said there were no substitutes for the old<br/>\nstandbys: imaginative play, drawing, storytelling and the<br/>\nendless reading of books on the couch and before bedtime.<br/>\nHe has two daughters and between them, he said, they did<br/>\nnot receive &quot;30 seconds of nonremedial tutoring.&quot; But they<br/>\nboth grew into avid readers. <br/>\n<br/>\n&quot;I just figured that if it was a good enough method for<br/>\nThomas Jefferson, it was good enough for my daughters,&quot; he<br/>\nsaid. <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.nytimes.com/2002/07/31/education/31TUTO.html?ex=10\">http://www.nytimes.com/2002/07/31/education/31TUTO.html?ex=10</a><br/>\n29133363&ei=1<br/>\n&en=dc58565781fce1b2<br/>\n<br/>\n<br/>\nI think, therefore I am dangerous.</div>","specialLinks":[]},{"userId":112382817,"authorName":"Jamie Lemon","from":"&quot;Jamie Lemon&quot; &lt;zanhawk@...&gt;","profile":"jamielemon2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] kid sleeping arrangements","postDate":"1028132986","msgId":8250,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMjcwMWMyMzhhZiQ3YzEzMGExMCQxMWZlYThjMEBzcGVlZGRlYW1vbj4=","referencesHeader":"PDFhYi42MDBmOWRkLjJhNzk0YmM5QGFvbC5jb20+IDwwMDNiMDFjMjM4OWYkZjUxZjliNDAkNjcwMGE4YzBAbGlzYT4="},"prevInTopic":8243,"nextInTopic":8267,"prevInTime":8249,"nextInTime":8251,"topicId":8233,"numMessagesInTopic":0,"msgSnippet":" Me too! I love BIG beds.  A few years ago I attempted to design a homemade bed that would","messageBody":"<div id=\"ygrps-yiv-154440130\">&lt;&lt;Lisa Breger wrote:<br/>\nI want a bed like the one in the movie Arthur!&gt;&gt;<br/>\n<br/>\n<br/>\nMe too! I love BIG beds.  A few years ago I attempted to design a homemade<br/>\nbed that would fill a whole room, with lots of pillows. I never got it<br/>\ncompletely worked out tho.<br/>\n<br/>\nDuring the first few years of marriage we lived in 1 bedroom apartments.<br/>\nWhen Max was born and Sam was 3yo we had a double bed, a cradle, and a<br/>\ntoddler bed side by side in a very small room.  We actually had to step over<br/>\nthe corner of the double bed to get to the bathroom.  All the beds were<br/>\nclose to the floor so when I needed to breastfeed max I just rolled over and<br/>\nlifted him into our bed.  This was great because I had a c-section and<br/>\ngetting up and down in the bed really hurt at first.  When we tell the kids<br/>\nhow we used to live when they were young they cannot believe it.<br/>\n<br/>\nNow we have a 4 bedroom townhome.  Max sometimes will sleep on our bedroom<br/>\nfloor if he wants to.  Sam likes her space and always sleeps in her room.<br/>\nWe have a king size bed now, very comfy.  But our very large dog sleeps with<br/>\nus and once he is asleep no one but me can make him move.  So hubby gets<br/>\nfrustrated about that sometimes. He&#39;s been known to say &quot;It&#39;s either me or<br/>\nthe dog!&quot; hahaha  Then the dog gets the floor.  :-)<br/>\n<br/>\nZan</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] kid sleeping arrangements","postDate":"1028129923","msgId":8243,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ2LjJiNGFiNWY5LjJhNzk1ZTgzQGFvbC5jb20+"},"prevInTopic":8238,"nextInTopic":8250,"prevInTime":8242,"nextInTime":8244,"topicId":8233,"numMessagesInTopic":0,"msgSnippet":"In a message dated 7/31/02 9:15:28 AM, leschke@islandnet.com writes: ","messageBody":"<div id=\"ygrps-yiv-1069579299\">In a message dated 7/31/02 9:15:28 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:leschke@...\">leschke@...</a> writes:<br/>\n<br/>\n&lt;&lt; Gee, I wouldn&#39;t mind having a hard bony side.  &lt;g&gt;  *All* of me is the <br/>\nsoft <br/>\nside. &gt;&gt;<br/>\n<br/>\nMe too nowadays.  I picked up the belt/sash from my wedding dress the other <br/>\nday.  It wasn&#39;t with the rest of the dress.  I made the mistake of holding it <br/>\nup to my waist.  eeeyew.  I&#39;m not wedding-dress size anymore for sure!!!<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":1509055,"authorName":"Tia Leschke","from":"Tia Leschke &lt;leschke@...&gt;","profile":"leschke2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] kid sleeping arrangements","postDate":"1028127684","msgId":8238,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUuMC4yLjEuMC4yMDAyMDczMTA4MDA0Mi4wMWMwYTNlMEBwb3AuaXNsYW5kbmV0LmNvbT4=","inReplyToHeader":"PDFhYi42MDBmOWRkLjJhNzk0YmM5QGFvbC5jb20+"},"prevInTopic":8236,"nextInTopic":8243,"prevInTime":8237,"nextInTime":8239,"topicId":8233,"numMessagesInTopic":0,"msgSnippet":"... Gee, I wouldn t mind having a hard bony side.    *All* of me is the soft side. Tia No one can make you feel inferior without your consent. Eleanor","messageBody":"<div id=\"ygrps-yiv-592622439\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt;Once when Marty was a baby and nursing and I was sleeping between them Kirby<br/>\n&gt;(3) said, &quot;Why does Marty get the soft side of you all the time and I get the<br/>\n&gt;hard bony side?&quot;<br/>\n<br/>\n </span></blockquote>Gee, I wouldn&#39;t mind having a hard bony side.  &lt;g&gt;  *All* of me is the soft <br/>\nside.<br/>\nTia<br/>\n<br/>\nNo one can make you feel inferior without your consent.<br/>\nEleanor Roosevelt<br/>\n*********************************************<br/>\nTia Leschke<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:leschke@...\">leschke@...</a><br/>\nOn Vancouver Island</div>","specialLinks":[]},{"userId":4754561,"authorName":"Lisa Breger","from":"&quot;Lisa Breger&quot; &lt;lisa@...&gt;","profile":"lisabreger","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] kid sleeping arrangements","postDate":"1028126317","msgId":8236,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwM2IwMWMyMzg5ZiRmNTFmOWI0MCQ2NzAwYThjMEBsaXNhPg==","referencesHeader":"PDFhYi42MDBmOWRkLjJhNzk0YmM5QGFvbC5jb20+"},"prevInTopic":8233,"nextInTopic":8238,"prevInTime":8235,"nextInTime":8237,"topicId":8233,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-173696565\">&lt;&lt;If everyone&#39;s sleeping with you except him, that could be part of the deal&gt;&gt;<br/>\n<br/>\nNope, got one more, Shaina 10 years old, who sleeps in her own room next door to him.  My husband used to sleep in Adam&#39;s room, but does not anymore. <br/>\n<br/>\nWhen Adam was born, we all slept cross wise in a king sized bed.  Adam first, against the headboard, them me, then Shaina and Tiffany.  My feet hung off, but those are great memories! <br/>\n<br/>\nI want a bed like the one in the movie Arthur!<br/>\n<br/>\nI love what Kirby said about your soft and bony sides!  Very cute, but it also points out that as parents, as hard as we try to do our best, sometimes it is not enough.  Or the child is perceiving it differently.<br/>\n<br/>\nLisa<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"kid sleeping arrangements","postDate":"1028125129","msgId":8233,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFhYi42MDBmOWRkLjJhNzk0YmM5QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":8236,"prevInTime":8232,"nextInTime":8234,"topicId":8233,"numMessagesInTopic":0,"msgSnippet":"In a message dated 7/30/02 10:28:41 PM, lisa@breger.com writes: ","messageBody":"<div id=\"ygrps-yiv-118907528\">In a message dated 7/30/02 10:28:41 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:lisa@...\">lisa@...</a> writes:<br/>\n<br/>\n&lt;&lt;  Can&#39;t sleep with him in my bed though.  Tiffany and Mariah sleep there <br/>\nwith me, but I&#39;ll invite him to camp out on the floor, or put the baby on the <br/>\nfuton for as long as she&#39;ll sleep there and have him in bed.  &gt;&gt;<br/>\n<br/>\nMaybe you could lie down with him in his bed until he goes to sleep, or let <br/>\nthe girls sleep on one side and him on the other?<br/>\n<br/>\nIf everyone&#39;s sleeping with you except him, that could be part of the deal.  <br/>\nI know Kirby missed sleeping next to me when Holly was born.  We got a two <br/>\ndown and one on top bunk bed, but he was still on the top by himself.  I <br/>\ndidn&#39;t have a good solution, but it wasn&#39;t good for him OR me or our <br/>\nrelationship for him to be eliminated.<br/>\n<br/>\nOnce when Marty was a baby and nursing and I was sleeping between them Kirby <br/>\n(3) said, &quot;Why does Marty get the soft side of you all the time and I get the <br/>\nhard bony side?&quot;<br/>\n<br/>\nWould he have any interest in sleeping with his dad?<br/>\n<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":8205,"nextTopicId":8251}}