{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":0,"authorName":"Bonknit@xxx.xxx","from":"Bonknit@...","replyTo":"LIST","senderId":"ktmk8v_Jk3gAa3oz77PbJ9wBXk9saQS13ix-E_UhIOr5tekhdaqwryUVhw1NAtU5xqCjfZpo","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Interesting study","postDate":"944447743","msgId":5143,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4zMjkuNTE0My45NTkyNjk3NDRAZUdyb3Vwcy5jb20+"},"prevInTopic":5130,"nextInTopic":0,"prevInTime":5142,"nextInTime":5144,"topicId":5130,"numMessagesInTopic":0,"msgSnippet":"In a message dated 12/4/99 11:28:45 PM Eastern Standard Time, shantinik@earthlink.net writes: ","messageBody":"<div id=\"ygrps-yiv-1627210230\">In a message dated 12/4/99 11:28:45 PM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:shantinik@...\">shantinik@...</a> writes:<br/>\n<br/>\n&lt;&lt;  even on the school&#39;s own terms, what happens in<br/>\n the classroom is irrelevant to children&#39;s future success, even as it is<br/>\n damaging to the child&#39;s quality of life in the here and now.<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>    Then how do we explain why my older kids and many like them are <br/>\ncompletely turned off to &quot;learning,&quot; and reading?<br/>\n<br/>\nLaura</div>","specialLinks":[]},{"userId":0,"authorName":"David Albert","from":"David Albert &lt;shantinik@...","replyTo":"LIST","senderId":"PD6HVFHf8LlZtyBtPo1gtQ1BtfAL_4_Bh4mV_qHaqWIzvdd1pVUTsDSCck_7hsBHa5BHiNEZ1SMixFIuhefh69t997Cvg-YMb7tvtNY","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Interesting study","postDate":"944367987","msgId":5130,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4zMjguNTEzMC45NTkyNjk3NDRAZUdyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":5143,"prevInTime":5129,"nextInTime":5131,"topicId":5130,"numMessagesInTopic":0,"msgSnippet":"On Friday, as part of my professional work (public policymaking around alcohol and drug issues -- especially drug treatment), I got to attend a lecture by the","messageBody":"<div id=\"ygrps-yiv-1955986878\">On Friday, as part of my professional work (public policymaking around<br/>\nalcohol and drug issues -- especially drug treatment), I got to attend a<br/>\nlecture by the head of the Civitan International Research Center at the<br/>\nUniversity of Alabama at Birmingham.<br/>\n<br/>\nThey have been conducted a 20-year-study on &quot;school outcomes&quot; in several<br/>\nsouthern cities and towns.  Specifically, they have been tracking<br/>\nchildren and families where the mothers became pregnant in their teens.<br/>\n85% of them were high school dropouts; average IQ of the mothers was 71<br/>\n(bordering on retarded.) Their main question is what could be done to<br/>\nensure &quot;school success&quot; among the children -- such success defined as<br/>\n&quot;normal&quot; scores for reading and math, and at least high school<br/>\ngraduation.  All of this under the assumption that &quot;school success&quot; was<br/>\na good thing, because it would lead to improved lives in the next<br/>\ngeneration.  Given the families they were working with, I think it is<br/>\nfair not to question the assumption (even though we&#39;d all likely agree<br/>\nit is quite narrow.)<br/>\n<br/>\nThey divided the mothers into two groups -- one to receive intensive<br/>\nhome services for both mother and children in preschool years -- not<br/>\njust academics for kids, but working with moms to get them to interact<br/>\nbetter with their children, etc. etc.  The other group was a control<br/>\ngroup.  Lo and behold, the provision of these intensive services proved<br/>\na great success, 5, 10, and even 15 years later.  The kids ended up with<br/>\nIQs exactly at the mean, same with reading and math scores, same with<br/>\nhigh school graduation rates, etc., etc.  Interesting too, 78% of those<br/>\nmothers in families who received services went back and got their<br/>\nG.E.D.s (as opposed to only about 20% of the control group.)  In the<br/>\ncontrol group, average IQ ended up at around 72, and there was a 75%<br/>\nhigh school drop out rate, etc., etc.  (you can find all these results<br/>\non the Civitan website, which I think is www.circ.uab.edu<br/>\n<br/>\nBut now the researchers tried something interesting.  They divided both<br/>\ngroups -- those receiving intensive services in preschool and the<br/>\ncontrol group -- in half again.  Half of each group received intensively<br/>\n&quot;academic&quot; services in schools in grades K-3.  They specially trained<br/>\nthe teachers, provided &quot;one-on-one&quot; time with the teachers, smaller<br/>\nclass sizes, reading specialists, math specialists, the whole nine<br/>\nyards.  For the control group, they treated the kids in school like<br/>\neveryone else.<br/>\n<br/>\nGuess what?  Providing the intensive services in school had NO EFFECT<br/>\nupon future &quot;school success&quot;!  Not a whit - and neither for those who<br/>\nreceived the intensive pre-school services or the control group.  I&#39;ll<br/>\nsay that again -- for this population, intensive school services had no<br/>\neffect on school success -- neither on reading, math, high school<br/>\ndropout rates, etc.<br/>\n<br/>\nNaturally there are those who will say this proves the need for<br/>\nintensive interventions in families, at least for at-risk kids.  I won&#39;t<br/>\ndebate the point -- for kids in families like these, it probably is a<br/>\ngood thing.  But turn it around -- the studies show that it is the<br/>\nquality of family life, not what goes on in school, that makes the big<br/>\ndifference in &quot;academic success&quot;.  Asked about this, the researchers<br/>\nsaid it is clear that, for the child, especially the young child, there<br/>\nis no useful distinction to be made between education and life -- they<br/>\nare all of a piece and cannot be usefully distinguished.<br/>\n<br/>\nI know there are homeschooling parents out there who sometimes worry<br/>\nabout those things which their kids might be &quot;missing&quot; by not attending<br/>\nschool.  This study and lots of others should help allay fears -- what<br/>\nis important is what is happening in your family.  Don&#39;t let all that<br/>\ntalk about &quot;education reform&quot; fool you -- it is all a smokescreen for a<br/>\nsystem which is failing, and failing fast.  And at best, as this study<br/>\nwould seems to indicate, even on the school&#39;s own terms, what happens in<br/>\nthe classroom is irrelevant to children&#39;s future success, even as it is<br/>\ndamaging to the child&#39;s quality of life in the here and now.<br/>\n<br/>\nDavid Albert<br/>\n<br/>\n<br/>\n--<br/>\nJohn Taylor Gatto calls &quot;And the Skylark Sings with Me: Adventures in<br/>\nHomeschooling and Community-Based Education&quot; &quot;a treat you should not<br/>\nmiss!&quot; To read a sample chapter, reviewers&#39; comments, or the foreword,<br/>\nand to order (cheaper than Amazon, and I&#39;ll sign it for you too!), visit<br/>\nmy website at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.skylarksings.com\">http://www.skylarksings.com</a></div>","specialLinks":[]}],"prevTopicId":5131,"nextTopicId":5141}}