{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":779600,"authorName":"KathrynJB@aol.com","from":"KathrynJB@...","profile":"kathrynbeth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Wonderful, exhausting Weekend","postDate":"1053348789","msgId":69879,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJkLjJlY2M1ZGJjLjJiZmEyZGI1QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":69878,"nextInTime":69880,"topicId":69879,"numMessagesInTopic":0,"msgSnippet":"I wanted to share the weekend we had because it s just so cool. It was a busy weekend. Julian, who is 13, has been preparing to sign with the cool group called","messageBody":"<div id=\"ygrps-yiv-1294465759\">I wanted to share the weekend we had because it&#39;s just so cool.<br/>\n<br/>\nIt was a busy weekend. Julian, who is 13, has been preparing to sign with the <br/>\ncool group called the Mystic Chorale. It&#39;s a group of over 200 singers, then <br/>\na jazz band and drummers, all older than him, only one other teen. It&#39;s been <br/>\nten weeks of getting him to Arlington for rehearsals, which is just far <br/>\nenough to be a pain in the ass. (Whoever drives ends up sitting around for <br/>\nhours during the rehearsal.) But he had two concerts this weekend and it was <br/>\nincredible. Really amazing music. And Julian just glowed up there!<br/>\n<br/>\nThe other thing that happened this weekend was we had Children&#39;s Sunday at <br/>\nthe Unitarian Universalist church where I am the Director of Religious <br/>\nEducation. I do Children&#39;s Sunday a bit differently than a lot of <br/>\nchurches...it tends to be mostly adult-driven, with the kids doing <br/>\npresentations for the adults. Instead, I have the kids lead a real, regular <br/>\nservice for the adults. Usually I work out the details, and the kids sign up, <br/>\nbut this year, the kids did most of the planning. They chose the hymns and <br/>\nreadings, they figured out homilies, etc. They also did original artwork on <br/>\neach of the covers for the orders of service.  Julian sang &quot;The Circle Game,&quot; <br/>\nand other kids did other music, including one kid who wrote a welcome song <br/>\nand sang it. <br/>\n<br/>\nSome of the kids wrote and performed a short play on Creation, this hilarious <br/>\nthing that started with the Bible Creation story (God said, Let there be <br/>\nlight. And a kid comes out and puts a flashlight on the worship table. On the <br/>\nseventh day, God rested, and one kid came out with a teddy bear and blankie, <br/>\nlooked around at all the props taken out earlier, gave a smile and a <br/>\nthumbs-up, then curled up on the floor with a yawn.), then a Chinese creation <br/>\nmyth of an egg, then, using one of those popper things that makes a loud <br/>\nnoise and send out streamers, we had The Big Bang, followed by a rain of <br/>\nbeanie babies. The end line was &quot;And it was good.&quot;<br/>\n<br/>\nThey were amazing!!!!  The adults of the congregation were so impressed with <br/>\nwhat an incredible job they did. <br/>\n<br/>\nNow Kathryn must rest (and play with her new expansion for The Sims!!!!)<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":69836,"nextTopicId":69881}}