{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":74604204,"authorName":"ddzimlew@juno.com","from":"ddzimlew@...","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Field trip","postDate":"1029851250","msgId":8592,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIwODIwLjA3NDczNi4tMTIxMTAzLjIuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":8591,"nextInTime":8593,"topicId":8592,"numMessagesInTopic":0,"msgSnippet":"Dylan and I went on a small mammal ecology field trip Saturday.  It was a program offered through the university in a town about forty miles from us.  We re on","messageBody":"<div id=\"ygrps-yiv-2140474985\">Dylan and I went on a small mammal ecology field trip Saturday.  It was a<br/>\nprogram offered through the university in a town about forty miles from<br/>\nus.  We&#39;re on their mailing list for special classes and programs. <br/>\n <br/>\nThis field trip was to show what biologists in the field do when they are<br/>\nstudying a particular critter.  Dylan has actually done field work before<br/>\nfor the geology department at this same university, monitoring seismic<br/>\nsites and writing down what he observed, and once, for a month,<br/>\nmonitoring cut worm populations.<br/>\n<br/>\nThe biologist on this trip is studying huanta(sp) virus in deer mice<br/>\npopulations in western Montana.    The night before the trip she had set<br/>\nout live traps in two locations in a high mountain meadow.  One of the<br/>\nsites was the cabin of a friend of hers,  as she was hoping to show how<br/>\ncommon deer mice are in our living spaces.  ( seven mice out of eight<br/>\ntraps ) <br/>\n <br/>\nWe had to be there at the crack of early because these little critters<br/>\nmay have been stuck in the traps all night and she didn&#39;t want to inflict<br/>\nmore stress than necessary on them.   At the first place we stopped her<br/>\nfirst trap had a pack rat in it, so now we&#39;re in love with pack rats<br/>\naround here and there are at least six drawings of the little guy stuck<br/>\nto the kitchen walls.  <br/>\n<br/>\nThe whole trip was amazing, but the most amazing thing was how different<br/>\nthe kids on the trip were.  There were three other kids there, older than<br/>\nDylan, who looked like they&#39;d rather be anywhere else.  Dylan asked<br/>\nquestions, wanted to know how she took blood samples, weighed the mice,<br/>\nasked about huanta virus, asked about West Nile virus in small mammals,<br/>\nasked about protected species,  how long do deer mice live, how do you<br/>\ntell the sex, and on and on.   I didn&#39;t ask the other kids but wondered<br/>\nif they had any say about being there that day.<br/>\n<br/>\nAt the end of the trip the biologist gave Dylan the deer mice ear tags<br/>\nshe had and said he could pierce his ears with them if he wanted.   <br/>\n<br/>\nShe finally asked what school he went to and was science his favorite<br/>\nsubject and when he told her he&#39;d never been to school she said &quot; Well,<br/>\nthat explains it! &quot;<br/>\nShe said last year one of her students at the university was a fourteen<br/>\nyear old girl who&#39;s &quot;hippy&quot; parents had never sent her to school, just<br/>\nlet her play, and that she was the smartest kid she&#39;d ever seen. <br/>\n<br/>\nDylan has asked for a good, basic book on biology.  He&#39;s been on the<br/>\nInternet and discovered that the first ever southern bog lemming was<br/>\ndiscovered in Montana, greatly expanding their previously known range. <br/>\nThere are drawings of bog lemmings here too, one&#39;s wearing a hat, like a<br/>\nbig, floppy sun hat (is that the southern belle bog lemming, I wonder?)  <br/>\nMy mom cut an article out of the paper about black footed ferrets and now<br/>\nhe&#39;s asking questions about plague.  <br/>\n<br/>\nThe cool thing is, on the weekend we&#39;re going picnicking and to a<br/>\nconcert, and then he&#39;ll be digging his dad&#39;s guitar out and strumming and<br/>\nlife will be bringing him something new. <br/>\n<br/>\nDeb L</div>","specialLinks":[]}],"prevTopicId":8588,"nextTopicId":8569}}