{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Just had to share this with you all  -\tsomething for the heart and mind!","postDate":"1075381410","msgId":18555,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJDM0U2RUQxLjI0MEQyJWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PEJDM0UzQURDLjI0MENCJWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":18554,"nextInTopic":0,"prevInTime":18554,"nextInTime":18556,"topicId":18551,"numMessagesInTopic":0,"msgSnippet":"... I clicked on the link to George Carlin s site and here s what he has to say about The Paradox of Our Time. (Warning, contains some of seven words you can","messageBody":"<div id=\"ygrps-yiv-895385527\">on 1/29/04 4:21 AM, Fetteroll at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; (If you go to the original you can click on the links<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.snopes.com/politics/soapbox/paradox.asp)\">http://www.snopes.com/politics/soapbox/paradox.asp)</a><br/>\n<br/>\n </span></blockquote>I clicked on the link to George Carlin&#39;s site and here&#39;s what he has to say<br/>\nabout The Paradox of Our Time. (Warning, contains some of seven words you<br/>\ncan never (or used to not be able to! ;-) say on television. BTW he now has<br/>\n2443 dirty words collected at his website to expand on those initial 7.)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &quot;PARADOX OF OUR TIME&quot;<br/>\n&gt; One of the more embarrassing items making the internet/e-mail rounds is a<br/>\n&gt; sappy load of shit called &quot;The Paradox of Our Time.&quot; The main problem I have<br/>\n&gt; with it is that as true as some of the expressed sentiments may be, who really<br/>\n&gt; gives a shit? Certainly not me.<br/>\n&gt; <br/>\n&gt; I figured out years ago that the human species is totally fucked and has been<br/>\n&gt; for a long time. I also know that the sick, media-consumer culture in America<br/>\n&gt; continues to make this so-called problem worse. But the trick, folks, is not<br/>\n&gt; to give a fuck. Like me. I really don&#39;t care. I stopped worrying about all<br/>\n&gt; this temporal bullshit a long time ago. It&#39;s meaningless. (See the preface of<br/>\n&gt; &quot;Braindroppings.&quot;)<br/>\n&gt; <br/>\n&gt; Another problem I have with &quot;Paradox&quot; is that the ideas are all expressed in a<br/>\n&gt; sort of pseudo-spiritual, New-Age-y, &quot;Gee-whiz-can&#39;t-we-do-better-than-this&quot;<br/>\n&gt; tone of voice. It&#39;s not only bad prose and poetry, it&#39;s weak philosophy. I<br/>\n&gt; hope I never sound like that.<br/>\n<br/>\n </span></blockquote>Joyce</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Just had to share this with you all  -\tsomething for the heart and mind!","postDate":"1075368108","msgId":18554,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJDM0UzQURDLjI0MENCJWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGJ2OTRhZStnaXN2QGVHcm91cHMuY29tPg=="},"prevInTopic":18551,"nextInTopic":18555,"prevInTime":18553,"nextInTime":18555,"topicId":18551,"numMessagesInTopic":0,"msgSnippet":"... That s been circulating for a long time with George Carlin s name on it. But he didn t write it. A great place to check out urban legends is","messageBody":"<div id=\"ygrps-yiv-1905019392\">on 1/28/04 2:59 PM, Louise Robbins at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:loueliandguy@...\">loueliandguy@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Isn&#39;t it amazing that George Carlin - mouthy comedian of the 70&#39;s,<br/>\n&gt; 80&#39;s and 90&#39;s - could write something so very eloquent ... and so<br/>\n&gt; very appropriate post 9-11. A wonderful Message by George Carlin:<br/>\n<br/>\n </span></blockquote>That&#39;s been circulating for a long time with George Carlin&#39;s name on it. But<br/>\nhe didn&#39;t write it.<br/>\n<br/>\nA great place to check out urban legends is <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.snopes.com\">http://www.snopes.com</a><br/>\n(If you go to the original you can click on the links<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.snopes.com/politics/soapbox/paradox.asp)\">http://www.snopes.com/politics/soapbox/paradox.asp)</a> (If you read down past<br/>\nthe original, it mentions what an inspiring kind of guy the original author<br/>\nwas.)<br/>\n<br/>\nHere&#39;s what Snopes has to say:<br/>\n===========================<br/>\nOrigins:   In  May 1998, Jeff Dickson posted the &#39;Paradox of Our Time&#39; essay<br/>\nto his Hacks-R-Us online forum, loosing it upon the Internet. The essay has<br/>\nsince been attributed to comedian George Carlin, an unnamed Columbine High<br/>\nSchool student, and that most prolific of scribes, Anonymous.<br/>\nGeorge Carlin very emphatically denied he had had anything to do with<br/>\n&quot;Paradox,&quot; a piece he referred to as &quot;a sappy load of shit,&quot; and posted his<br/>\ncomments about being associated with this essay on his own web site.<br/>\nThe true author of the piece is neither George Carlin nor Jeff Dickson, nor<br/>\nis he anonymous. Credit belongs with Dr. Bob Moorehead, former pastor of<br/>\nSeattle&#39;s Overlake Christian Church. (He retired in 1998 after 29 years in<br/>\nthat post). The essay appeared under the title &quot;The Paradox of Our Age&quot; in<br/>\nWords Aptly Spoken, Dr. Moorehead&#39;s 1995 collection of prayers, homilies,<br/>\nand monologues used in his sermons and radio broadcasts:<br/>\n<br/>\nThe Paradox of Our Age<br/>\n<blockquote><span title=\"ireply\"> &gt; We have taller buildings but shorter tempers; wider freeways but narrower<br/>\n&gt; viewpoints; we spend more but have less; we buy more but enjoy it less; we<br/>\n&gt; have bigger houses and smaller families; more conveniences, yet less time; we<br/>\n&gt; have more degrees but less sense; more knowledge but less judgement; more<br/>\n&gt; experts, yet more problems; we have more gadgets but less satisfaction; more<br/>\n&gt; medicine, yet less wellness; we take more vitamins but see fewer results. We<br/>\n&gt; drink too much; smoke too much; spend too recklessly; laugh too little; drive<br/>\n&gt; too fast; get too angry quickly; stay up too late; get up too tired; read too<br/>\n&gt; seldom; watch TV too much and pray too seldom.<br/>\n<br/>\n&gt; We have multiplied our possessions, but reduced our values; we fly in faster<br/>\n&gt; planes to arrive there quicker, to do less and return sooner; we sign more<br/>\n&gt; contracts only to realize fewer profits; we talk too much; love too seldom and<br/>\n&gt; lie too often. We&#39;ve learned how to make a living, but not a life; we&#39;ve added<br/>\n&gt; years to life, not life to years. We&#39;ve been all the way to the moon and back,<br/>\n&gt; but have trouble crossing the street to meet the new neighbor. We&#39;ve conquered<br/>\n&gt; outer space, but not inner space; we&#39;ve done larger things, but not better<br/>\n&gt; things; we&#39;ve cleaned up the air, but polluted the soul; we&#39;ve split the atom,<br/>\n&gt; but not our prejudice; we write more, but learn less; plan more, but<br/>\n&gt; accomplish less; we make faster planes, but longer lines; we learned to rush,<br/>\n&gt; but not to wait; we have more weapons, but less peace; higher incomes, but<br/>\n&gt; lower morals; more parties, but less fun; more food, but less appeasement;<br/>\n&gt; more acquaintances, but fewer friends; more effort, but less success. We build<br/>\n&gt; more computers to hold more information, to produce more copies than ever, but<br/>\n&gt; have less communication; drive smaller cars that have bigger problems; build<br/>\n&gt; larger factories that produce less. We&#39;ve become long on quantity, but short<br/>\n&gt; on quality. <br/>\n<br/>\n&gt; These are the times of fast foods and slow digestion; tall men, but short<br/>\n&gt; character; steep in profits, but shallow relationships. These are times of<br/>\n&gt; world peace, but domestic warfare; more leisure and less fun; higher postage,<br/>\n&gt; but slower mail; more kinds of food, but less nutrition. These are days of two<br/>\n&gt; incomes, but more divorces; these are times of fancier houses, but broken<br/>\n&gt; homes. These are days of quick trips, disposable diapers, cartridge living,<br/>\n&gt; thow-away morality, one-night stands, overweight bodies and pills that do<br/>\n&gt; everything from cheer, to prevent, quiet or kill. It is a time when there is<br/>\n&gt; much in the show window and nothing in the stock room. Indeed, these are the<br/>\n&gt; times! <br/>\n<br/>\n </span></blockquote>Those intent upon taking inspiration from &quot;Paradox&quot; should consider the<br/>\nfollowing: during Bob Moorehead&#39;s tenure as pastor of Overlake Christian<br/>\nChurch, seventeen members of his congregation reported that he had sexually<br/>\nassaulted them. These allegations, which surfaced in 1997, prompted his<br/>\nresignation in 1998. After a year of publicly supporting Moorehead the<br/>\nchurch elders withdrew their support, their own investigation into the<br/>\ncharges having led them to conclude their pastor had indeed been guilty of<br/>\nmolesting a number of male churchgoers.<br/>\n<br/>\nIts true authorship aside, the piece picked up its attribution to an unnamed<br/>\nstudent who witnessed the killings at Littleton in the aftermath of 20 April<br/>\n1999, while America was still struggling to make sense of that day&#39;s<br/>\nhorrific events. The killings at Columbine shook us deeply, leaving behind a<br/>\nnation of survivors looking for the one set of answers which could begin to<br/>\nexplain the horrifically inexplicable. Having this essay flow from the pen<br/>\nof an unnamed student who bore witness to this unspeakable act of violence<br/>\nmade sense  surely such a teen would have valuable words of wisdom or<br/>\ncautions we all should heed. The oft-repeated header &quot;A Columbine High<br/>\nSchool student wrote&quot; infused the essay with the significance and meaning<br/>\nfolks thirsted for. (This belief that witnessing a tragedy or losing a loved<br/>\none imbues a person with special insight into the causes and cures of<br/>\nsociety&#39;s ills also fuels the Internet version of the testimony given before<br/>\nthe House judiciary committee by Darrell Scott, father of Rachel Scott, one<br/>\nof the teens murdered at Columbine High School.)<br/>\n<br/>\nIt felt right that this essay emerge from the horror that was the Columbine<br/>\nmassacre. Certainly someone somewhere had to be able to make sense of all<br/>\nthis. Certainly some good, some protection against future acts of random<br/>\ninsanity, had to come out of all this grief and loss, else what had it all<br/>\nbeen for? Yet that was not the case. The essay which has come to be called<br/>\n&quot;The Paradox of Our Time&quot; was written at least four years before the<br/>\nkillings in Littleton, Colorado. There was no association between the essay<br/>\nand the shootings, though many felt at least momentarily comforted by the<br/>\nnotion that there had been.<br/>\n<br/>\nWe like pieces such as &quot;The Paradox of Our Time&quot; because they summarize all<br/>\nthe problems of modern society into a neat laundry list of &quot;What Has Gone<br/>\nWrong&quot; while presenting possible solutions by way of juxtaposition. The<br/>\npairing of &quot;We have multiplied our possessions, but reduced our values,&quot; for<br/>\nexample, implies that increased affluence is responsible for a decline in<br/>\nmorality and carries the underlying implication that if we turn our backs on<br/>\nthe almighty dollar, our kids will no longer murder one another.<br/>\n<br/>\nClear-cut cause-and-effect pairings provide far more comfort than does<br/>\naccepting the harsh reality that we live in a world of no assurances at all,<br/>\na world where bad things can happen at any moment, to anyone, for no<br/>\ndiscernable (and thus no preventable) reason. Our ancestors coped with that<br/>\nfeeling of powerlessness by inventing myths about petty, lust-filled,<br/>\nvengeful gods who, even if they were capricious in their actions and<br/>\ninsensible to the human misery their warring caused, were at least tangible<br/>\nentities who could be identified as the cause of otherwise unfathomable<br/>\ncatastrophes. Our sophistication has loosed us from our belief in those<br/>\nmyths, leaving us vulnerable to a sense of a world careening out of control.<br/>\nBarbara &quot;chaos theory&quot; Mikkelson<br/>\nLast updated:   30 May 2003<br/>\n===========================<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":157848909,"authorName":"Louise Robbins","from":"&quot;Louise Robbins&quot; &lt;loueliandguy@...&gt;","profile":"soulribbons","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Just had to share this with you all  - something for the heart and mind!","postDate":"1075319950","msgId":18551,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJ2OTRhZStnaXN2QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":18554,"prevInTime":18550,"nextInTime":18552,"topicId":18551,"numMessagesInTopic":0,"msgSnippet":"Isn t it amazing that George Carlin - mouthy comedian of the 70 s, 80 s and 90 s - could write something so very eloquent ... and so very appropriate post","messageBody":"<div id=\"ygrps-yiv-1029062299\">Isn&#39;t it amazing that George Carlin - mouthy comedian of the 70&#39;s, <br/>\n80&#39;s and 90&#39;s - could write something so very eloquent ... and so <br/>\nvery appropriate post 9-11. A wonderful Message by George Carlin:<br/>\n<br/>\n <br/>\n<br/>\nThe paradox of our time in history is that we have taller buildings <br/>\nbut shorter tempers, wider freeways, but narrower viewpoints. We <br/>\nspend more, but have less, we buy more, but enjoy less. We have <br/>\nbigger houses and smaller families, more conveniences, but less <br/>\ntime. We have more degrees but less sense, more knowledge, but less <br/>\njudgment, more experts, yet more problems, more medicine, but less <br/>\nwellness.<br/>\n<br/>\n <br/>\n<br/>\nWe drink too much, smoke too much, spend too recklessly, laugh too <br/>\nlittle, drive too fast, get too angry, stay up too late, get up too <br/>\ntired, read too little, watch TV too much, and pray too seldom. We <br/>\nhave multiplied our possessions, but reduced our values. We talk too <br/>\nmuch, love too seldom, and hate too often.<br/>\n<br/>\n <br/>\n<br/>\nWe&#39;ve learned how to make a living, but not a life. We&#39;ve added <br/>\nyears to life not life to years. We&#39;ve been all the way to the moon <br/>\nand back, but have trouble crossing the street to meet a new <br/>\nneighbor. We conquered outer space but not inner space. We&#39;ve done <br/>\nlarger things, but not better things.<br/>\n<br/>\n <br/>\n<br/>\nWe&#39;ve cleaned up the air, but polluted the soul.. We&#39;ve conquered <br/>\nthe atom, but not our prejudice. We write more, but learn less. We <br/>\nplan more, but accomplish less. We&#39;ve learned to rush, but not to <br/>\nwait. We build more computers to hold more information, to produce <br/>\nmore copies than ever, but we communicate less and less.<br/>\n<br/>\n <br/>\n<br/>\nThese are the times of fast foods and slow digestion, big men and <br/>\nsmall character, steep profits and shallow relationships. These are <br/>\nthe days of two incomes but more divorce, fancier houses, but broken <br/>\nhomes. These are days of quick trips, disposable diapers, throwaway <br/>\nmorality, one night stands, overweight bodies, and pills that do <br/>\neverything from cheer, to quiet, to kill. It is a time when there is <br/>\nmuch in the showroom window and nothing in the stockroom. A time <br/>\nwhen technology can bring this letter to you, and a time when you <br/>\ncan choose either to share this insight, or to just hit delete.<br/>\n<br/>\n <br/>\n<br/>\nRemember, spend some time with your loved ones, because they are not <br/>\ngoing to be around forever. Remember, say a kind word to someone who <br/>\nlooks up to you in awe, because that little person soon will grow up <br/>\nand leave your side. Remember, to give a warm hug to the one next to <br/>\nyou, because that is the only treasure you can give with your heart <br/>\nand it doesn&#39;t cost a cent.<br/>\n<br/>\n <br/>\n<br/>\nRemember, to say, &quot;I love you&quot; to your partner and your loved ones, <br/>\nbut most of all mean it. A kiss and an embrace will mend hurt when <br/>\nit comes from deep inside of you. Remember to hold hands and cherish <br/>\nthe moment for someday that person will not be there again. Give <br/>\ntime to love, give time to speak, and give time to share the <br/>\nprecious thoughts in your mind.<br/>\n<br/>\n <br/>\n<br/>\nLife is not measured by the number of breaths we take, but by the <br/>\nmoments that take our breath away.<br/>\n<br/>\nThanks for your welcome!<br/>\nLouise</div>","specialLinks":[]}],"prevTopicId":18484,"nextTopicId":18576}}