{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Question about deschooling and workbooks","postDate":"1299975438","msgId":60246,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkzMTI4Ni4xNDk1MC5xbUB3ZWIxMTA0MDQubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PEQ1QTdFRTkzLTE0RDctNEQ0Ny04M0M2LUE5MTA0N0I4OTBDREB2ZXJpem9uLm5ldD4=","referencesHeader":"PGlsZW9vbSs1M2UzQGVHcm91cHMuY29tPiA8RDVBN0VFOTMtMTRENy00RDQ3LTgzQzYtQTkxMDQ3Qjg5MENEQHZlcml6b24ubmV0Pg=="},"prevInTopic":60240,"nextInTopic":0,"prevInTime":60245,"nextInTime":60247,"topicId":60237,"numMessagesInTopic":0,"msgSnippet":"***Let your daughter have them and decide what value they hold for her. Initially she may assign a fairly high value. But living a life of choice in an","messageBody":"<div id=\"ygrps-yiv-1790598796\">***Let your daughter have them and decide <br/>\nwhat value they hold for her. Initially she may assign a fairly high <br/>\nvalue. But living a life of choice in an environment where there are <br/>\nlots of things she enjoys to choose from, and where she doesn&#39;t feel <br/>\nany pressure from you to value them, her interest will very likely fade.***<br/>\n<br/>\n<br/>\nEventually she might not place any value on them.  Sometimes I can accurately <br/>\nput a value on something when I have x amount of dollars to spend and then <br/>\ndecide what I&#39;m going to spend it on.  I&#39;ve done that with both of my kids. <br/>\n They may really want something, but when given a handful of cash, they will <br/>\nchoose something else entirely.<br/>\n<br/>\nIt&#39;s an interesting idea to play with.  I&#39;m not sure how well a brand new to <br/>\nunschooling kid might handle it.  Way back when Chamille was in the 5-7 age <br/>\nrange, we used to visit an educational supply store a lot because I was teaching <br/>\ndance classes and handed out stickers at the end of class.  That store had the <br/>\nbest and coolest sticker supply.  Sometimes I&#39;d give Chamille $5 to spend any <br/>\nway she wanted to at that store.  Sometimes she&#39;d buy coloring books, sometimes <br/>\nstickers, or some other oddity, and sometimes she&#39;d request to spend her money <br/>\nelsewhere.  Workbooks, in the whole range of choices, were pretty low on her <br/>\nlist once she had that cash on hand!<br/>\n<br/>\nMargaux wants to get one of the new Pokemon games.  I don&#39;t have the cash for it <br/>\nat the moment, but my guess is that if I gave her $35 to spend, with the option <br/>\nto buy the game, she&#39;d choose to spend it on Liv dolls instead.  It helps put <br/>\nthings in perspective.  I will end up getting both I&#39;m sure!<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Question about deschooling and workbooks","postDate":"1299926481","msgId":60240,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQ1QTdFRTkzLTE0RDctNEQ0Ny04M0M2LUE5MTA0N0I4OTBDREB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGlsZW9vbSs1M2UzQGVHcm91cHMuY29tPg==","referencesHeader":"PGlsZW9vbSs1M2UzQGVHcm91cHMuY29tPg=="},"prevInTopic":60239,"nextInTopic":60246,"prevInTime":60239,"nextInTime":60241,"topicId":60237,"numMessagesInTopic":0,"msgSnippet":"... Actually, that questioning is more for the mom who is certain her unschooling child loves workbooks. (And feels compelled to tell other unschoolers that","messageBody":"<div id=\"ygrps-yiv-7555009\">On Mar 11, 2011, at 10:19 PM, DeborahM wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  I understand that if a recently-schooled child wants to use a  <br/>\n&gt; workbook, it&#39;s worth looking at why, and trying to make sure it&#39;s  <br/>\n&gt; not because they believe that&#39;s what math (or whatever subject) IS.<br/>\n<br/>\n </span></blockquote>Actually, that questioning is more for the mom who is certain her  <br/>\nunschooling child loves workbooks. (And feels compelled to tell other  <br/>\nunschoolers that Yes, workbooks can be a part of unschooling ;-)<br/>\n<br/>\nIf the child wants them, sure get some. If the mom doesn&#39;t see  <br/>\nworkbooks as more important than coloring books, doesn&#39;t feel they  <br/>\nneed to be completed or done &quot;by the rules&quot;, is fine if they get  <br/>\nturned into paper airplanes ;-) Let your daughter have them and decide  <br/>\nwhat value they hold for her. Initially she may assign a fairly high  <br/>\nvalue. But living a life of choice in an environment where there are  <br/>\nlots of things she enjoys to choose from, and where she doesn&#39;t feel  <br/>\nany pressure from you to value them, her interest will very likely fade.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Question about deschooling and workbooks","postDate":"1299903327","msgId":60239,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAzRkY1Rjc4LTIwNDAtNDVBRi1CNDJCLUIyMEU1MTEzNzAxNUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGlsZW9vbSs1M2UzQGVHcm91cHMuY29tPg==","referencesHeader":"PGlsZW9vbSs1M2UzQGVHcm91cHMuY29tPg=="},"prevInTopic":60238,"nextInTopic":60240,"prevInTime":60238,"nextInTime":60240,"topicId":60237,"numMessagesInTopic":0,"msgSnippet":"Also, if she think she d like to have workbooks, buy more than one, if she wants.  And she might prefer things that are too easy for her, if they re more","messageBody":"<div id=\"ygrps-yiv-1004395317\">Also, if she think she&#39;d like to have workbooks, buy more than one, if she wants.  And she might prefer things that are &quot;too easy&quot; for her, if they&#39;re more colorful and amusing.   Besides educational supply houses, there are also workbooks at office supply stores (at Staples, anyway) and at Toys R Us, and maybe at other toy stores.  There are lots of maze and puzzle books at Dover Books, which is now (finally) online.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Question about deschooling and workbooks","postDate":"1299903192","msgId":60238,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhBNkZENzZGLTlEM0YtNEFBMS05NzdDLTdGNjQxMTdFMDdCOEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGlsZW9vbSs1M2UzQGVHcm91cHMuY29tPg==","referencesHeader":"PGlsZW9vbSs1M2UzQGVHcm91cHMuY29tPg=="},"prevInTopic":60237,"nextInTopic":60239,"prevInTime":60237,"nextInTime":60239,"topicId":60237,"numMessagesInTopic":0,"msgSnippet":"-=- It s a little weird to me that she wants a workbook. But maybe she would feel more relaxed about it. When I ask her why she wants one, she says it would be","messageBody":"<div id=\"ygrps-yiv-71611982\">-=- It&#39;s a little weird to me that she wants a workbook. But maybe she would feel more relaxed about it. When I ask her why she wants one, she says it would be fun, and that it would give her something to do. When I ask her if she feels like she *should* have a workbook, she says maybe so. Why? Well, one of her schooled first-grade friends has a fourth-grade workbook that she can do. It seems clear to me that she does have the attitude that one learns things from doing worksheets, and that being advanced in math (at least) is good for its own sake.-=-<br/>\n<br/>\nI would take her with you to get a workbook, but maybe find some other things at the same place, without making a big deal.  Don&#39;t even ask her about whether she thinks she should.  Don&#39;t talk to her about unschooling much.  Just move from happy moment to happy moment.  Maybe mazes would be fun, or fancy dot-to-dot books.  Coloring books from Dover or Bellerophon.  Store them all together.  Get some nice crayons and markers or whatever she likes.  Do them with her. Don&#39;t relegate coloring or puzzles to being &quot;kid stuff.&quot;<br/>\n<br/>\nMeanwhile, you and your husband could begin to see math in many other places.   Rummy, or the dedicated card game Five Crowns.  Mastermind Jr.  (much nicer than regular Master Mind; prettier, a little easier, better plastic).  Maybe Plants vs. Zombies.  Lots of logic, deduction and patterns.  Few numerals involved.<br/>\n<br/>\n-=-Do you have any thoughts about what I say to her or ask her in this situation, or how to approach a fruitful conversation about it, or how to respond? -=-<br/>\n<br/>\nI wouldn&#39;t talk about it at all.  No &quot;fruitful conversations.&quot; :-)<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":474555866,"authorName":"DeborahM","from":"&quot;DeborahM&quot; &lt;deborah-alwayslearning@...&gt;","profile":"deborahmensch","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Question about deschooling and workbooks","postDate":"1299899990","msgId":60237,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlsZW9vbSs1M2UzQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":60238,"prevInTime":60236,"nextInTime":60238,"topicId":60237,"numMessagesInTopic":0,"msgSnippet":"Hello! This is my first post, but I ve been keeping up with the list for several weeks. My daughter Petra and I have been discussing for a couple of months the","messageBody":"<div id=\"ygrps-yiv-1949611417\">Hello! This is my first post, but I&#39;ve been keeping up with the list for several weeks. My daughter Petra and I have been discussing for a couple of months the idea of her leaving first grade and beginning to unschool, and after some back-and-forth, she has decided she wants to do it. We are one week into our two weeks&#39; notice to leave school, so one week of school is left. We&#39;ve already started some practices inspired by my reading here, like starting to say &quot;yes&quot; more often about more things.<br/>\n<br/>\nI&#39;ve followed recent discussions here of whether workbooks have any place in unschooling. I have no desire to use them. I understand that if a recently-schooled child wants to use a workbook, it&#39;s worth looking at why, and trying to make sure it&#39;s not because they believe that&#39;s what math (or whatever subject) IS. But Petra is firmly insistent that she wants to get a math workbook (or sometimes she says a general 2nd-grade-level workbook) to use when she leaves school. <br/>\n<br/>\nPetra and I have spent some time, at her request, playing with arithmetic and number sense. She really wanted to learn addition of 2-digit numbers, so I showed her some different ways to do it and think about it. She seemed very excited (in a good way, a way I remember as some of the cool stuff about numbers assembled itself in my head when I was first learning it), but also very tense, as we were doing this. I never really figured out what the tension was about; Petra couldn&#39;t explain it to me, and I was being very patient and not pushing, or being negative about missteps, or doing anything else I associate with tension about learning. (I used to teach math to 7th graders and up, and I&#39;ve had several math-phobic students to help me learn about sources of tension related to learning as it happens in school; often I was able to help those students relax and find their groove.) She mentioned the experience positively many times afterward, and we&#39;ve done a few more bits of playing with math stuff that she was interested in learning how to do. It&#39;s a little weird to me that she wants a workbook. But maybe she would feel more relaxed about it. When I ask her why she wants one, she says it would be fun, and that it would give her something to do. When I ask her if she feels like she *should* have a workbook, she says maybe so. Why? Well, one of her schooled first-grade friends has a fourth-grade workbook that she can do. It seems clear to me that she does have the attitude that one learns things from doing worksheets, and that being advanced in math (at least) is good for its own sake.<br/>\n<br/>\nBoth my husband and I had a lot of fun learning various parts of math, some in school, some independently, and saw math as a bunch of interesting puzzles until it actually became useful in our lives. We still sometimes do math for fun, when an interesting problem suggests itself from something we&#39;re thinking about. So from his point of view, getting her a math workbook is a lot like getting her a book of mazes or crossword puzzles. I&#39;m not sure, because I don&#39;t think Petra would feel she &quot;should&quot; get a book of crossword puzzles.<br/>\n<br/>\nWhat would you experienced unschoolers suggest that I do, in the interest of effective deschooling so we can get to the rich earth of unschooling in the best way? (I started to say the fastest way, but I&#39;m not sure whether that is generally best. Advice welcome.) Do you have any thoughts about what I say to her or ask her in this situation, or how to approach a fruitful conversation about it, or how to respond? Right now my hunch is that I should just get her the workbook she&#39;s asking for, but not follow up on it or expect it to be used, and in the meantime strew our lives with lots of other interesting options. What do you think? Other suggestions?<br/>\n<br/>\nThanks,<br/>\nDeborah Mensch</div>","specialLinks":[]}],"prevTopicId":60210,"nextTopicId":60241}}