{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":4043487,"authorName":"Halo5964@aol.com","from":"Halo5964@...","profile":"halo5964","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"sparkling house","postDate":"1068470365","msgId":84362,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMwLjQ5YjNkZTcxLjJjZTBlYTVkQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":84361,"nextInTime":84363,"topicId":84362,"numMessagesInTopic":0,"msgSnippet":"People are more important than a sparkling house. It took me quite a while to come to this conclusion, and when I finally did, it took my husband even longer.","messageBody":"<div id=\"ygrps-yiv-713433856\">People are more important than a sparkling house.<br/>\n<br/>\nIt took me quite a while to come to this conclusion, and when I finally did, <br/>\nit took my husband even longer.  Why are we raised that our houses should be <br/>\nsparkling clean at the expense of our children?  I missed so much time with my <br/>\nlittle ones because of the pressure to have a clean home, and I have a friend <br/>\nright now that if her husband comes home and the house isn&#39;t clean, he starts <br/>\nyelling and throwing things, upsetting everyone.  I think it is something we <br/>\nallow society to impose on us as &quot;women&quot; , and once we are free of it, our <br/>\nhusbands are so conditioned to believe it as one of our wifely duties that it <br/>\ncontinues to become a struggle until they are liberated.  My son was born with a <br/>\nkidney problem and had to have surgery straight after early induced labor.  It <br/>\ntook a lot of care in the early years of his life, just to keep him alive.  <br/>\nI&#39;ll never forget my husband coming home from work one day and telling me he <br/>\njust couldn&#39;t love me if he had to live in a dirty house.  Mind you, we&#39;re just <br/>\ntalking messy, not pigsty.  No health risks, just piled laundry-dinner not <br/>\ncooked, you know that kind of stuff you go through with a new baby.  Now please <br/>\ndon&#39;t start jumping on my husband.  He has come a long way since then or we <br/>\nwould not be together!  My point is, I see that happening to so many young <br/>\nmothers-suffering the pressures of having their houses clean, especially by their <br/>\nhusbands and mothers and mothers-in-law.  I will encourage and help in anyway to <br/>\nsee that my children grow up and enjoy their children and not worry about <br/>\nthose insignificant things.  I must say, I now do flylady, and have much better <br/>\ncontrol over the house, but even when things get busy and the stuff doesn&#39;t get <br/>\ndone, I just don&#39;t care.  Don&#39;t even think about it.  I&#39;ve watched my older <br/>\ntwo grow up and I can&#39;t hardly remember their lives because I was so &quot;busy&quot;.  <br/>\nI&#39;m not making the same mistake with the last one.  He has my undivided <br/>\nattention 90% of the time, and I enjoy every single minute of it.  My mother always <br/>\nsaid &quot;Things are not as important as people.&quot;  The house is a thing!  Thanks for <br/>\nsaying this, Pam!<br/>\n<br/>\nCarol</div>","specialLinks":[]}],"prevTopicId":84245,"nextTopicId":84349}}