{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Thad Martin","from":"Thad Martin &lt;tmartin@...","replyTo":"LIST","senderId":"a6Aof7vfR4xg90UTQxHC5HeyR5hy_1qs_z7snCd4O0SrsaJb7zzplNPO-v18Vjq6EVeSFuAx6gXdKYEf0TUq7yPd4w7QDyH0IQ","spamInfo":{"isSpam":false,"reason":"0"},"subject":"witnessing/childhood trauma (children charged...thread)","postDate":"943439856","msgId":4800,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4zMTIuNDgwMC45NTkyNjk3NDRAZUdyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":4799,"nextInTime":4801,"topicId":4800,"numMessagesInTopic":0,"msgSnippet":"hi, i m new to this group (not yet one week).  to this point i ve only been skimming this thread, but the concept of witnessing is very interesting.   i grew","messageBody":"<div id=\"ygrps-yiv-2120486598\">hi,<br/>\n<br/>\ni&#39;m new to this group (not yet one week).  to this point i&#39;ve only been<br/>\nskimming this thread, but the concept of witnessing is very interesting.   i<br/>\ngrew up the youngest of 5 kids in 6 years (4 girls & 1 boy).  we were, in<br/>\nanyone&#39;s definition, abused, primarily through neglect but that was accompanied<br/>\nby frequent unpredictable outbursts of aggressive and violent behavior.   most<br/>\npeople want to believe that this kind of thing is perpetrated due to cold<br/>\nheartedness, the need for control or disdain for the kids.  my experience is<br/>\nthat it&#39;s actually not that personal (but it&#39;s extremely difficult not to take<br/>\nit that way),  that it&#39;s the parents&#39; inability to handle the stresses of their<br/>\nown choices.  it&#39;s not that they don&#39;t love you or that you are not lovable,<br/>\nit&#39;s just that their own needs are so big and out of control they can&#39;t even<br/>\nbegin to realize you have any.   hence they do not model for their children how<br/>\nto handle or release the natural occurring stress that build up in all our<br/>\nlives but model a sort hypersensitivity which can  either produce a paralyzed<br/>\nsort of personality and/or a highly combative/defensive one (personally i flip<br/>\nflop).<br/>\n<br/>\nneither my father nor my mother were abused in this sense but for various<br/>\nreasons they were not taught how to not put themselves at the very center of<br/>\nevery situation.  this they did successfully model.  it has been interesting to<br/>\nsee how each us have lived our lives and the choices we&#39;ve made.  what i can<br/>\nconfidently say is that we, my siblings and i,  all have developed an emotional<br/>\ninstability that some of us &#39;witness&#39; and some struggle to.  to me this is an<br/>\ninvaluable skill, to be able to emotionally distance yourself so you can<br/>\nrelease the stress,  but one that has been incredibly difficult, at least for<br/>\nme, to acquire and maintain because my unconscious understanding of the world<br/>\n(as a scary unpredictable place where your needs are never met- an emotionally<br/>\nunstable view) often overrides my conscious understanding of love and<br/>\ncompassion (which i experience daily with my son).<br/>\n<br/>\ni can relate to the story about the dogs that pam sent (see below) i felt that<br/>\nway by the time i was thirteen ( i was so tired i prayed to sleep forever)  but<br/>\nat that point my parents&#39; own personal internal problems blocked me from their<br/>\nview and i was virtually on my own (divine intervention:)   but that feeling of<br/>\nresignation - there is a point were you just stop desiring anything at all and<br/>\nit takes a long time to get it back.  but i whole heartedly believe one can<br/>\novercome anything and for me the way to do that is to be kind to yourself,<br/>\ncomplete and nonjudgmental acceptance for you as a whole flawed person (much as<br/>\na parent naturally does for their children) .  this releases stress then<br/>\nperhaps some clear new understandings can come through.  otherwise your life<br/>\nwill maintain itself just exactly the way it has been and the cycle continues.<br/>\nit really does come down to making conscious choices.<br/>\n<br/>\n-susan<br/>\naustin,tx<br/>\nthad (husband)<br/>\nrene&#39; (4)<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; From: &quot;Lisa Bugg&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:LisaBugg@...\">LisaBugg@...</a>&gt;<br/>\n&gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; Yes people make choices.  People&#39;s choices are shaped by their previous<br/>\n&gt; &gt; experience.  It is very difficult to make choices about which you have<br/>\n&gt; limited<br/>\n&gt; &gt; or no experience. People struggle within the limitations of their<br/>\n&gt; experience.<br/>\n&gt; &gt; Effective &quot;therapy&quot; is in fact a little world of alternate experience<br/>\n&gt; which<br/>\n&gt; &gt; allows people to have experiences that they would never &quot;choose&quot; because<br/>\n&gt; those<br/>\n&gt; &gt; experiences are outside their &quot;box&quot; of choices.<br/>\n&gt;<br/>\n&gt; Do not people also struggle within the limitations of their inexperience?<br/>\n&gt; And therapy would allow us to become experienced at analyzing the choices we<br/>\n&gt; didn&#39;t/couldn&#39;t make?<br/>\n&gt; &gt;<br/>\n&gt;<br/>\n&gt; &gt; The question of why people with similar experiences make different choices<br/>\n&gt; is<br/>\n&gt; &gt; of course central to this discussion.  I believe that people who make<br/>\n&gt; &gt; constructive choices in spite of their painful experiences have had (to<br/>\n&gt; borrow<br/>\n&gt; &gt; from Alice Miller) &quot;witnesses&quot; to what was done to them.  People who<br/>\n&gt; choose<br/>\n&gt; &gt; &quot;destructive&quot; roads have not had &quot;witnesses&quot;.  this is at least one piece<br/>\n&gt; of<br/>\n&gt; &gt; the puzzle.<br/>\n&gt;<br/>\n&gt; I have read only one Alice Miller book, a compendium of stories.  I think I<br/>\n&gt; understand the use of the word  *witness* here, but would love for you to<br/>\n&gt; explain more anyway.<br/>\n&gt;<br/>\n&gt; My childhood was pretty rotten....when went over the edge of rotten and into<br/>\n&gt; abuse it was becuase of who *I* am/was.  Another child might not have had a<br/>\n&gt; second thought about things my parents said or did.   I am a better parent<br/>\n&gt; to three of my children than I am to the 4th.  I struggle to parent that 4th<br/>\n&gt; child.<br/>\n&gt;<br/>\n&gt; &gt; I am really glad that (thus far) this discussion (this time) has not<br/>\n&gt; resulted<br/>\n&gt; &gt; in anyone going off in a snit.  I find that this conversation gets people<br/>\n&gt; &gt; really excited and often &quot;mad as hell&quot;.<br/>\n&gt;<br/>\n&gt; Ya, know, this list has never had a long lived snit.  We all seem hungry for<br/>\n&gt; more indepth discussions.  Some of us have unschooled for a long time and we<br/>\n&gt; need to analyze where we&#39;ve been and where we&#39;re going.  The face of<br/>\n&gt; homeschooling has changed more than once in the last 20 years and the next 5<br/>\n&gt; are going to see it change yet again.  Frankly, we now have some very clear<br/>\n&gt; insights that the rest of the culture should take a long hard look<br/>\n&gt; at......is they&#39;ll sit still long enough.  &lt;g&gt;<br/>\n&gt;<br/>\n&gt; LisaKK<br/>\n<br/>\n </span></blockquote>from: &quot;Pam Hartley&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pamhartley@...\">pamhartley@...</a>&gt;<br/>\n<blockquote><span title=\"ireply\"> &gt;WARNING TO GENTLER SOULS, READ NO FURTHER.<br/>\n&gt;<br/>\n&gt;They took a series of dogs and put them on a metal plate in a square area<br/>\n&gt;with no exits. They began shocking the dogs (electrically) and of course<br/>\n&gt;each dog would run around desperately trying to get off the hot plate, to<br/>\n </span></blockquote>no<br/>\n<blockquote><span title=\"ireply\"> &gt;avail. The dogs tried *really* hard, including spectacular feats of<br/>\n </span></blockquote>jumping,<br/>\n<blockquote><span title=\"ireply\"> &gt;digging, etc. No way out.<br/>\n&gt;<br/>\n&gt;Next day, they took the same dogs, did the same thing, same response.<br/>\n&gt;<br/>\n&gt;At some point (I don&#39;t remember how many days), they would put the dogs<br/>\n </span></blockquote>into<br/>\n<blockquote><span title=\"qreply\"> &gt;the room, and the dogs would simply sit down or lay down, utterly defeated,<br/>\n&gt;and let themselves be shocked without resistance.<br/>\n&gt;<br/>\n&gt;The day after each dog &quot;gave up&quot;, they put the dog in the square room, but<br/>\n&gt;this time, major difference: they left a CLEAR AND OBVIOUS EXIT (the same<br/>\n&gt;door they would take the dogs in and out every day to get into the room).<br/>\n&gt;<br/>\n&gt;None of the dogs, when the electrical shocks began, attempted to escape.<br/>\n&gt;None.<br/>\n&gt;<br/>\n&gt;That&#39;s learned helplessness. That&#39;s what at least some kids in school are<br/>\n&gt;feeling, probably many, maybe most.<br/>\n&gt;<br/>\n&gt;Pam<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &gt; Message boards, timely articles, a free newsletter and more!<br/>\n&gt; Check it all out at: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> </span></blockquote></div>","specialLinks":[]}],"prevTopicId":4639,"nextTopicId":4806}}