{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1512150,"authorName":"Peggy","from":"Peggy &lt;peggy@...&gt;","profile":"waptia","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Convictions Overturned","postDate":"1039208793","msgId":11160,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNERjExMTU5LjIyNDU2ODQzQGxpbm1heC5zYW8uYXJpem9uYS5lZHU+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":11159,"nextInTime":11161,"topicId":11160,"numMessagesInTopic":0,"msgSnippet":"Isn t this incredible? I just can t help thinking of the one boy who *didn t* sign a confession because he mother had told him if he ever got hauled in for ","messageBody":"<div id=\"ygrps-yiv-551100302\">Isn&#39;t this incredible? I just can&#39;t help thinking of the one boy who *didn&#39;t*<br/>\nsign a confession because he mother had told him if he ever got hauled in for<br/>\nsomething he didn&#39;t do to, &quot;...let them crush his hands before he signed<br/>\nanything.&quot; I guess DNA evidence has its downside as far as the entrenched<br/>\npolice policy is concerned.<br/>\n<br/>\nPeggy<br/>\n<br/>\n<br/>\nFrom:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://athena.tbwt.com/content/article.asp?articleid=2082\">http://athena.tbwt.com/content/article.asp?articleid=2082</a><br/>\n<br/>\nConvictions Overturned<br/>\n<br/>\n<br/>\nBy Herb  Boyd <br/>\nTBWT National Editor <br/>\nArticle Dated 12/6/2002<br/>\n<br/>\n <br/>\n<br/>\nNew York--It took the justice system 13 years and 58 pages to decide that the<br/>\nfive<br/>\nblack youths convicted of raping and beating a Central Park jogger were not<br/>\nguilty of<br/>\nthe crime. <br/>\n<br/>\nEnding an 11-month long investigation of the re-opened case, Manhattan<br/>\nDistrict<br/>\nAttorney Robert Morgenthau filed a 58-page report on Thursday (Dec. 5) to<br/>\nState<br/>\nSupreme Court asking that all charges against the men, who were teenagers when<br/>\nthey were tried, be set aside. The recommendation was based mainly on the<br/>\nconfession of Matias Reyes, who said he is solely responsible for raping the<br/>\ninvestment banker on April 19, 1989. <br/>\n<br/>\nIn effect, the D.A. joined the defense&#39;s motion to vacate the case on the<br/>\ngrounds<br/>\nthat new evidence, &quot;could not have been produced by the defendants at the<br/>\ntrial<br/>\neven with due diligence...which is of such character as to create a<br/>\nprobability...that<br/>\nthe verdict would have been more favorable to the defendants,&quot; the lawyers,<br/>\nMichael Warren and Roger Wareham submitted. <br/>\n<br/>\n&quot;Assessing the newly discovered evidence, as we are required to do,&quot; District<br/>\nAttorney Morgenthau&#39;s report concluded, &quot;...there is a probability that the<br/>\nnew<br/>\nevidence, had it been available to the juries, would have resulted in verdicts<br/>\nmore<br/>\nfavorable to the defendants, not only on the charges arising from the attack<br/>\non the<br/>\nfemale jogger, but on the other charges as well.&quot; <br/>\n<br/>\nMoreover, the D.A. believed no useful purpose would be served by a retrial on<br/>\nany of<br/>\nthe charges contained in the original indictment against the youths. &quot;We<br/>\nalways<br/>\nmaintained our children&#39;s innocence,&quot; said Sharrone Salaam, the mother of<br/>\nYusef<br/>\nSalaam, one of the so-called Central Park Five. &quot;Now, victory is ours.&quot; <br/>\n<br/>\nSince District Attorney Morgenthau&#39;s report is merely a recommendation, the<br/>\ndefendants will have to wait and to see if Judge Charles Tejada accedes to the<br/>\nrequest in February. Ordinarily, according to several lawyers familiar with<br/>\nthe case,<br/>\nthe judge goes along with the prosecution&#39;s recommendation. <br/>\n<br/>\nIf Judge Tejada&#39;s ruling is favorable, it may set in motion another round of<br/>\nlitigation<br/>\nas the defendants-Yusef Salaam, Kharey Wise, Kevin Richardson, Antron McCray<br/>\nand<br/>\nRaymond Santana (who remains in prison on different charges)--all of whom have<br/>\nserved prison terms from 7-1/2 to 13-1/2 years, prepare lawsuits of wrongful<br/>\nconviction. <br/>\n<br/>\nSuch lawsuits are customarily difficult in the state of New York, which<br/>\nenacted a law<br/>\nin 1984 requiring plaintiffs to prove in a high and convincing manner that<br/>\nthey are<br/>\ninnocent and in no way did anything to contribute to their convictions. In the<br/>\nprevious wrongful conviction cases-some 175 since 1985 with 163 of them being<br/>\ndismissed-a false confession is tantamount to contributing to conviction, and<br/>\nit was<br/>\nthe confessions of the youths that the prosecution based its case. However,<br/>\ndefense lawyers will charge, as they have done throughout the re-examination<br/>\nof<br/>\nthe case, that the confessions extracted from four of the defendants, were<br/>\ncoerced.<br/>\n<br/>\nWere it not for an accidental meeting between Reyes, 31, who is serving a<br/>\n33-to-life<br/>\nsentence for another rape and murder, and Wise while incarcerated, the case<br/>\nwould<br/>\nhave never aroused the public again as it did 13 years ago. Reyes said he had<br/>\na<br/>\nreligious epiphany upon seeing Wise and felt compelled to confess to the<br/>\ncrime. His<br/>\naccount was corroborated by his accurate recall of information only the police<br/>\nknew,<br/>\nas well as DNA testing from semen taken from the victim&#39;s socks and cervic. <br/>\n<br/>\n&quot;I just had to have her,&quot; Reyes said of the victim as she jogged through<br/>\nCentral Park<br/>\nnear the 102nd Street Transverse. He said he stalked her through the park as<br/>\nshe<br/>\nran, accosted her and dragged her into a ravine where he beat her with a tree<br/>\nlimb<br/>\nand then a rock before raping her. The woman lost 75 percent of her blood and<br/>\nremained in a coma for 12 days. &quot;I thought I had left her dead,&quot; he added. &quot;I<br/>\ndeserve<br/>\neverything that has happened to me.&quot; Because the statue of limitations has<br/>\npassed<br/>\nReyes cannot be tried for the crime. In the spring, the victim will be<br/>\npublishing a<br/>\nbook about the incident and revealing her identity. <br/>\n<br/>\nMeanwhile, Police Commissioner Raymond Kelly and the NYPD are conducting their<br/>\nown investigation of the incident, and they are decidedly opposed to the<br/>\nD.A.&#39;s<br/>\nrecommendation. They are of the opinion that the youths in their &quot;wilding&quot; are<br/>\nto<br/>\nsome degree culpable, perhaps even precipitating the attack that Reyes<br/>\nfinished. Dr.<br/>\nRobert Kurtz, who treated the victim after the attack, contends that her<br/>\ninjuries<br/>\nwere too severe and extensive to have been committed by Reyes alone. <br/>\n<br/>\nDuring a television interview, Professor Richard Uviller of Columbia<br/>\nUniversity Law<br/>\nSchool was asked his impressions of the case and he said the District<br/>\nAttorney, from<br/>\nthe very beginning, &quot;should have been more detached from the NYPD. And they<br/>\nshould have been more suspicious,&quot; he said, mildly berating the department for<br/>\nnot<br/>\nconnecting previous rapes in Central Park to Reyes. Two days before the youths<br/>\nrampaged through the park there was a rape incident, which Reyes later<br/>\nconfessed<br/>\nhe did. <br/>\n<br/>\nShould an apology be forthcoming from the D.A&#39;s office, the professor was<br/>\nasked?<br/>\n&quot;This was not a personal matter, so no apology should be expected,&quot; Professor<br/>\nUviller<br/>\nanswered. &quot;They were operating purely on the evidence.&quot; <br/>\n<br/>\nNone of the defendants were among the demonstrators outside the court when the<br/>\nreport was announced. McCray, according to his mother, Linda, has resumed his<br/>\nlife<br/>\noutside the city with his wife and children; Salaam is a student of computer<br/>\nscience<br/>\nsomewhere in New York; Richardson is working as a night watchman and pursuing<br/>\nan<br/>\nundergraduate degree; Wise, who served the longest sentence, lives with his<br/>\nmother<br/>\nin Manhattan; and Santana is serving time on an unrelated crime, but is<br/>\nexpected to<br/>\nbe released soon, if Judge Tejada&#39;s ruling conforms with the D.A.&#39;s request. <br/>\n<br/>\n <br/>\n<br/>\nCopyright © 2002  The Black World Today.<br/>\nAll Rights Reserved.</div>","specialLinks":[]}],"prevTopicId":11157,"nextTopicId":11133}}