{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":48,"messages":[{"userId":169340192,"authorName":"Lyle W.","from":"&quot;Lyle W.&quot; &lt;unschoolingdad@...&gt;","profile":"lyle_perry","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re:  Learning to see differently","postDate":"1077425129","msgId":91279,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwMjIyMDQ0NTM4LkM0MEIzMkFBRDhAd3MxLTYudXM0Lm91dGJsYXplLmNvbT4="},"prevInTopic":91276,"nextInTopic":91281,"prevInTime":91278,"nextInTime":91280,"topicId":91221,"numMessagesInTopic":0,"msgSnippet":"... You should print out your post and put it away for about a year.  Then take it out, read it, and see how much further your eyes have opened in that time.","messageBody":"<div id=\"ygrps-yiv-1273549134\">Rheta wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I hadn&#39;t thought of unschooling as a complete change in attitude, it&#39;s very eye-opening.&lt;&lt;<br/>\n<br/>\n </span></blockquote>You should print out your post and put it away for about a year.  Then take it out, read it, and see how much further your eyes have opened in that time.  You&#39;ll be surprised.  Unschooling tends to seep into every aspect of your lives and your thinking, and it can open your eyes in ways you probably can&#39;t even imagine yet.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;So the YuGiOh cards . if your child develops an interest in them, let them be unless they ask you for help or want you to join them .&lt;&lt;<br/>\n<br/>\n </span></blockquote>Well, I don&#39;t like the way &quot;let them be&quot; sounds.  Showing joy simply because your child is doing something seems better.  You don&#39;t have to horn in on what they&#39;re doing, but showing satisfaction in their activities would be good.  Well wait, that&#39;s not right.  Don&#39;t &quot;show&quot; satisfaction, BE satisfied.  There&#39;s a difference.  <br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;How does everyone else handle grandparents and others testing your<br/>\n </span></blockquote> children.&lt;&lt;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;my mother makes her watch while she writes it neatly and in caps and lower case and then makes her sit and do it her way.&lt;&lt;<br/>\n<br/>\n </span></blockquote>I &quot;explained&quot; to my inlaws that they could either stop with the testing, or stop seeing us.  Either one was fine with me.  If they want to come over to have a good time, fine, come on over.  But if they&#39;re coming over to quiz the kids, don&#39;t bother knocking.  <br/>\n<br/>\nYour mom is being disrespectful to you and your daughter, and that has to stop.  It may not be intentional, and she may be trying to help in the only way she knows how, but it still has to stop.  Whether you do it bluntly or gently, you have to let her know that what she&#39;s doing is not acceptable.  Don&#39;t let her, or anyone else, disrespect your choices.  <br/>\n<br/>\nLyle<br/>\n<br/>\n***Always remember, Lead By Example***<br/>\n<br/>\n-- <br/>\n___________________________________________________________<br/>\nSign-up for Ads Free at Mail.com<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://promo.mail.com/adsfreejump.htm\">http://promo.mail.com/adsfreejump.htm</a></div>","specialLinks":[]},{"userId":113787562,"authorName":"Mark and Rheta Wallingford","from":"&quot;Mark and Rheta Wallingford&quot; &lt;wallingford@...&gt;","profile":"belnvivmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:  Learning to see differently","postDate":"1077415955","msgId":91276,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDQwMWMzZjhlOSQ1NmFhMGZjMCQ3NmQwMDVjZkBXYWxsaW5nZm9yZD4="},"prevInTopic":91275,"nextInTopic":91279,"prevInTime":91275,"nextInTime":91277,"topicId":91221,"numMessagesInTopic":0,"msgSnippet":"I hadn t thought of unschooling as a complete change in attitude, it s very eye-opening.  Before I started reading this thread, I had thought of unschooling","messageBody":"<div id=\"ygrps-yiv-668237538\">I hadn&#39;t thought of unschooling as a complete change in attitude, it&#39;s<br/>\nvery eye-opening.  Before I started reading this thread, I had thought<br/>\nof unschooling more as taking your child&#39;s interests and turning them<br/>\ninto &quot;teaching&quot; moments.  What is being said is more that your child&#39;s<br/>\ninterests lead them to learn what they need to know whether you take it<br/>\nfrom them and make it a teaching moment.  Am I getting that correctly?<br/>\nAnd yes, I see what I wrote and realized that just saying &quot;take it from<br/>\nthem&quot; sounded awful although that&#39;s what I was doing.  So the YuGiOh<br/>\ncards . if your child develops an interest in them, let them be unless<br/>\nthey ask you for help or want you to join them . don&#39;t look at one of<br/>\nthe cards and start showing them how they relate to math.  That&#39;s<br/>\nsomething I have done (with other things).  But you can still put things<br/>\nout that could lead to interests and then just let them go with it and<br/>\nfollow their lead (enjoy it with them as they would).   <br/>\n <br/>\nThe mindset of &quot;where is the educational value&quot; is a hard one to break.<br/>\nHow does everyone else handle grandparents and others testing your<br/>\nchildren.  When I decided to Homeschool, my parents were ok with the<br/>\ndecision but figured I&#39;d be doing school at home.  I had already decided<br/>\nto unschool.  I explained to my parents I was not going to be doing<br/>\nschool at home and tried to explain the basics of unschooling.  Now when<br/>\nmy 5 yo, Isabel, brings my mom a piece of paper with her name written on<br/>\nit, my mother makes her watch while she writes it neatly and in caps and<br/>\nlower case and then makes her sit and do it her way.  I love my parents<br/>\nbut hate going over there.  How does everyone else deal with these<br/>\nsituations.  Not to mention the testing of knowledge for her &quot;grade&quot;<br/>\nlevel.  <br/>\n <br/>\nRheta<br/>\n <br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":171268986,"authorName":"Tracey Inman","from":"&quot;Tracey Inman&quot; &lt;traceyinman@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] Learning to see differently","postDate":"1077415185","msgId":91275,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PElNRUJJS0JGS0lBQ0pHRkFMSUxMS0VFTUVKQUEudHJhY2V5aW5tYW5AZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PDIwMDQwMjIxMTM1MjM0LkRFMjc5MjJFQ0VAd3MxLTgudXM0Lm91dGJsYXplLmNvbT4="},"prevInTopic":91269,"nextInTopic":91276,"prevInTime":91274,"nextInTime":91276,"topicId":91221,"numMessagesInTopic":0,"msgSnippet":"If it is any consolation Wendy, I am new to unschooling too.  I have to not just daily remind myself to back off and allow my girls to enjoy life, but ","messageBody":"<div id=\"ygrps-yiv-1235690691\">If it is any consolation Wendy, I am new to unschooling too.  I have to not<br/>\njust daily remind myself to back off and allow my girls to enjoy life, but<br/>\nsometimes moment after moment.  HOWEVER.......One of the biggest blessings<br/>\nfor me has been relaxing enough to enjoy them.  This for me has been the key<br/>\nto it all.  Before I brought them home from public school I didn&#39;t have the<br/>\ntime or energy left to really KNOW them.  As I watch my 8 yo watch tv all<br/>\nday and I do mean all day sometimes,  I now go and snuggle up in her bed or<br/>\non the couch and watch tv with her.  Those have been some priceless times.<br/>\nShe enjoys cooking so I give her full access to the kitchen and boy can she<br/>\ncook!  My 11yo daughter&#39;s passion is drawing/painting and horses.  She is<br/>\nreally an amazing artist and her mind never shuts off.  She also loves her<br/>\nhorses .  She wears horse ears, a horse tail and has huffs she has made to<br/>\nkeep up with her growing taller.  I had someone a couple of months ago tell<br/>\nme I shouldn&#39;t allow her to walk like a horse or wear the tail and ears.<br/>\nWhy? I thought.  That is who she is, why would I take that from her?  But an<br/>\n11 yo running around like a horse isn&#39;t sociable acceptable I guess....who<br/>\ncares?!   She too will wake me or interupt me to show a horse she has found<br/>\non Stablemates.com and how if she sells &quot;x&quot; amount of paintings at &quot;x&quot; price<br/>\nshe could buy the horse.  Now, why did I tell you all of this?......I used<br/>\nto think she needed to be reading, doing a math related activity (like a<br/>\nworksheet I guess) or writing a report on horses instead.  What I now<br/>\nrealize is that she is learning all the time.<br/>\n<br/>\nI agree with the others who have said, your son  is learning and taking in<br/>\nso much.  Our job as the parent is to be a resource for our children.  Be<br/>\nresourceful, show him where he can learn more about the Yu-Gi-Oh cards or be<br/>\nbetter at playing.  I am not real up on these cards but I know there is much<br/>\nhe can do with them.  I hope you will take time to enter your sons world,<br/>\nyou will find a world of blessings waiting on you there.<br/>\n<br/>\nTracey<br/>\n<br/>\n<br/>\n<br/>\nTracey Inman<br/>\nLegacy for Life<br/>\n336.580.1844<br/>\nhttp://TraceyInman.com<br/>\n<br/>\n<br/>\n<br/>\n---<br/>\nOutgoing mail is certified Virus Free.<br/>\nChecked by AVG anti-virus system (http://www.grisoft.com).<br/>\nVersion: 6.0.593 / Virus Database: 376 - Release Date: 2/20/2004</div>","specialLinks":[]},{"userId":140408439,"authorName":"Erika Nunn","from":"&quot;Erika Nunn&quot; &lt;erikanunn@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Learning to see differently","postDate":"1077403491","msgId":91269,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTctRjEwOEdLZXlUMGxncmMwMDAyMzk2Y0Bob3RtYWlsLmNvbT4="},"prevInTopic":91268,"nextInTopic":91275,"prevInTime":91268,"nextInTime":91270,"topicId":91221,"numMessagesInTopic":0,"msgSnippet":"In response to... He really does have an OCD personality. But I guess as long as he doesn t wash his hands until they fall off, he s ok! HA! Wendy Carr Does","messageBody":"<div id=\"ygrps-yiv-1609734991\">In response to...<br/>\n<br/>\n&quot;He really does have an OCD personality. But I guess as long as he doesn&#39;t <br/>\nwash his hands until they fall off, he&#39;s ok! HA!<br/>\n<br/>\nWendy Carr&quot;<br/>\n<br/>\nDoes your son really have OCD?  I really did have OCD as a child, which has <br/>\nturned into anxiety problems today.  For some reason the above line kind of <br/>\nrubbed me the wrong way - not so much that I am upset, just that I wish you <br/>\ncould understand how it feels to deal with that type of mindset (perhaps you <br/>\nalready do? - often it runs in families).<br/>\n<br/>\nAnyway, my point is that my parents were always very controlling.  In <br/>\naddition, they also would look down on activities that I did that they <br/>\ndidn&#39;t think were &quot;worthwhile.&quot;  They would charge into my room and turn on <br/>\nthe light if I slept in too long.  My mother also forced me to practice <br/>\nviolin for 8 years even though I obviously hated it because she believed <br/>\nthat someday I would &quot;thank&quot; her.  (I know she meant well at the time.)<br/>\n<br/>\nI am not blaming my parents for my having OCD; more that if they had not <br/>\nbeen so nit picky, controlling, and constantly in my space that I would <br/>\nprobably have not been such an extremely uptight and unhappy child (and I <br/>\nguess, yes, I don&#39;t really think that my OCD would have amounted to much of <br/>\nanything).  Even today, my mother can say one slightly negative thing and I <br/>\nwill immediately feel extremely stressed and start doing some of my old OCD <br/>\nhabits.<br/>\n<br/>\nSo I am not at all saying that you are the cause of your son having OCD!!!  <br/>\nJust that I have been there, and the best thing you can do for your son is <br/>\nto RELAX and let him feel in control of himself and be happy with what he <br/>\ndoes.  Believe me, dealing with OCD is no joke and it is horrible to live <br/>\nwith.  In addition, a person who does OCD-type behavious is generally a <br/>\nconsequence of them feeling a personal lack of control.<br/>\n<br/>\nErika  :)<br/>\n<br/>\n_________________________________________________________________<br/>\nTake off on a romantic weekend or a family adventure to these great U.S. <br/>\nlocations. <a rel=\"nofollow\" target=\"_blank\" href=\"http://special.msn.com/local/hotdestinations.armx\">http://special.msn.com/local/hotdestinations.armx</a></div>","specialLinks":[]},{"userId":166495566,"authorName":"Have a Nice Day!","from":"&quot;Have a Nice Day!&quot; &lt;litlrooh@...&gt;","profile":"rooh_","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Learning to see differently","postDate":"1077401939","msgId":91268,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMmEwMWMzZjhjOCRiNGYwNGEyMCQwMjAxYThjMEBhby5sb3AuY29tPg==","referencesHeader":"PDFjNS4xNGNkMTFhZi4yZDY4NTE0Y0Bhb2wuY29tPiA8MDNkZTAxYzNmODhkJGQ1MjQ5ZWQwJDAzMDBhOGMwQFRpbmtlcmJlbGw+"},"prevInTopic":91265,"nextInTopic":91269,"prevInTime":91267,"nextInTime":91269,"topicId":91221,"numMessagesInTopic":0,"msgSnippet":"Part of the journey to unschooling, or learning to see differently, is let go of ALL your preconceived, schoolish notions about learning and really just be","messageBody":"<div id=\"ygrps-yiv-244486246\">Part of the journey to unschooling, or learning to see differently, is let go of ALL your preconceived, &quot;schoolish&quot; notions about learning and really just be with your kids while they are doing what they enjoy.  I think that&#39;s the biggest first step.  *******<br/>\n<br/>\n<br/>\nI think this is the *whole* step LOL.  This is where the paradigm shift is.<br/>\n<br/>\nKristen<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":160969203,"authorName":"Wendy Carr","from":"&quot;Wendy Carr&quot; &lt;WendyWCarr@...&gt;","profile":"wendycarrga","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Learning to see differently","postDate":"1077394780","msgId":91265,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTUtREFWNjg0Q2ZuZ1Zkd24wMDAwMGIzMUBob3RtYWlsLmNvbT4=","referencesHeader":"PDEzMS4yYTQ5NTRiNi4yZDY5MTMwM0Bhb2wuY29tPg=="},"prevInTopic":91263,"nextInTopic":91268,"prevInTime":91264,"nextInTime":91266,"topicId":91221,"numMessagesInTopic":0,"msgSnippet":"Sandra, I love how you put everything into perspective! It always make perfect sense!  Thank you for your Honesty. Wendy Wendy Carr When the first baby laughed","messageBody":"<div id=\"ygrps-yiv-1407920355\">Sandra, I love how you put everything into perspective! It always make perfect sense!  Thank you for your Honesty. <br/>\n<br/>\nWendy <br/>\nWendy Carr<br/>\nWhen the first baby laughed for the first time, the laugh broke into a thousand pieces and they all went skipping about, and that was the beginning of fairies. - Barrie<br/>\nMom to Austyn(9) and Caitlin(6 months)<br/>\n<br/>\nProud  To Home-school!<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Learning to see differently","postDate":"1077393667","msgId":91263,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMS4yYTQ5NTRiNi4yZDY5MTMwM0Bhb2wuY29tPg=="},"prevInTopic":91261,"nextInTopic":91265,"prevInTime":91262,"nextInTime":91264,"topicId":91221,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/21/04 12:04:45 PM, WendyWCarr@msn.com writes: ","messageBody":"<div id=\"ygrps-yiv-1240097946\">In a message dated 2/21/04 12:04:45 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:WendyWCarr@...\">WendyWCarr@...</a> writes:<br/>\n<br/>\n&lt;&lt; Oh you know, I think they have VALUE... But when that&#39;s ALL he does, its <br/>\nhard for me to see the educational value.  &gt;&gt;<br/>\n<br/>\nYou&#39;re making noise-screen.<br/>\nIt&#39;s okay to relax and look and think without defending your indefensible <br/>\nposition. &lt;g&gt;<br/>\n<br/>\n&lt;&lt;Its partly outside pressure from my mother. She is always asking me what he <br/>\nis learning and I have nothing to tell her&gt;&gt;<br/>\n<br/>\n#1, you need to make the transition from being your mother&#39;s child<br/>\nto being your child&#39;s mother.<br/>\n<br/>\n#2, once you see value in what he does (not SAY that you see it, but quietly <br/>\nand honestly SEE it) you can start taking notes and send your mom a letter <br/>\nevery week or so telling her what you have seen.<br/>\n<br/>\n&lt;&lt;I cant tell her mine can, cause he cant. He knows HOW to do it, but doesn&#39;t <br/>\nhave them memorized. That&#39;s ok with me, but not ok for her. &gt;&gt;<br/>\n<br/>\nSee both above; noise screen, and make your transition.<br/>\n<br/>\n&lt;&lt;I&#39;m not as far into this as others here. We just started this in Sept. Its <br/>\nan everyday struggle! &gt;&gt;<br/>\n<br/>\nWe&#39;re trying every day to help you stop struggling and relax into it.  You <br/>\nhave to relax.  You can&#39;t unschool better by worrying, holding your breath or <br/>\nbuilding a wall of defensive words.  You need to quietly relax and breathe.  <br/>\nStop struggling.<br/>\n<br/>\n&lt;&lt;He really does have an OCD personality. But I guess as long as he doesn&#39;t <br/>\nwash his hands until they fall off, he&#39;s ok! HA!&gt;&gt;<br/>\n<br/>\nPlease try to stop labelling him. <br/>\nHe has HIS personality.  Maybe if you relax, he can relax.<br/>\n<br/>\nSome of his energy is being spent trying to guess what will make you happy, <br/>\nprobably.  Give him a break.  Let him live his own life.<br/>\n<br/>\nIf he washes his hands until they fall off, they&#39;re his hands.  <br/>\nDo you think he could wash his hands until they fall off?<br/>\nIf not, you&#39;re wasting mental energy and brain storage even picturing it, let <br/>\nalone writing it down.   <br/>\n<br/>\nIf he washes his hands once a week or thirty times a day, let him do it <br/>\nwithout your review and comment.  You&#39;ll both be happier and healthier.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":77522235,"authorName":"Julie Bogart","from":"&quot;Julie Bogart&quot; &lt;julie@...&gt;","profile":"juliecinci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Learning to see differently","postDate":"1077392449","msgId":91261,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGMxOGM4MSs3MjA2QGVHcm91cHMuY29tPg=="},"prevInTopic":91260,"nextInTopic":91263,"prevInTime":91260,"nextInTime":91262,"topicId":91221,"numMessagesInTopic":0,"msgSnippet":"Thanks for starting this thread Sandra. One of the other issues I d like to bring out is the measuring tools used in education. Grades, prizes for fact","messageBody":"<div id=\"ygrps-yiv-244817233\">Thanks for starting this thread Sandra. One of the other issues I&#39;d like to bring out is the <br/>\nmeasuring tools used in education. Grades, prizes for fact mastery, privileges, <br/>\npunishments.... Unfortunately for us, my son started part time enrollment at the local high <br/>\nschool before we made the unschooling decision. During that year, I watched my <br/>\nconfidence in my son (that he is incredibly talented, able to teach himself loads of <br/>\ncomplicated stuff, motivated and competent) slowly drain. I watched him do poorly in <br/>\nalgebra II and I&#39;ve watched him continue to &quot;not care&quot; in two other classes that he chose to <br/>\ntake this year. To my surprise, my feelings about him were impacted by his school <br/>\nperformance which I had assumed would be stellar, in the tradition of all those <br/>\npropaganda articles that homeschoolers put out. :) I took his lack of success there as a <br/>\nreflection on both me as his teacher and on him as a learner.<br/>\n<br/>\nMeanwhile, he&#39;s taught himself to play electric guitar without ever taking a lesson (showed <br/>\nus how to go up and down the scales in finger picking at top speed last night), he&#39;s <br/>\nlearned two computer languages well enough to play around with them and create <br/>\nprograms, he plays X Box round the clock, dislikes inane TV but watches loads of movies, <br/>\nreads classics and science magazines, is learning Klingon and bought four books with his <br/>\nown money to learn it... And more. He is a sponge when he has the time and space to be.<br/>\n<br/>\nAnd yet I still find myself &quot;disappointed&quot; when his grades aren&#39;t &quot;high&quot; in those couple of <br/>\nschool classes he chose to take. Horrid! <br/>\n<br/>\nWe recently sat down with him and he shared just what he wants from life and how he&#39;d <br/>\nprefer to spend his time.  He dropped a class, quit his job, quit the sport&#39;s team he&#39;s on <br/>\nand promptly looked up job requirements for game programming. Then he borrowed a <br/>\nC++ programming book from his computer teacher.<br/>\n<br/>\nIt&#39;s odd, but in our attempts to &quot;prepare&quot; him for real life, real life got left out. But now <br/>\nthat he&#39;s putting his goals ahead of grades or requirements or college admissions, he&#39;s <br/>\nback to his happy, thriving self.<br/>\n<br/>\nI&#39;m glad our family is getting the chance to rethink what learning is and to let go of the <br/>\nouside voices that want to rob us of what we know about our kids.<br/>\n<br/>\nJulie</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Learning to see differently","postDate":"1077392354","msgId":91257,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFkZC4xYWE2NTY5YS4yZDY5MGRlMkBhb2wuY29tPg=="},"prevInTopic":91256,"nextInTopic":91259,"prevInTime":91256,"nextInTime":91258,"topicId":91221,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/21/04 7:30:00 AM, danielle.conger@comcast.net writes: ","messageBody":"<div id=\"ygrps-yiv-860953107\">In a message dated 2/21/04 7:30:00 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:danielle.conger@...\">danielle.conger@...</a> writes:<br/>\n<br/>\n&lt;&lt; This is one of the main reasons why I think it is easier to unschool from <br/>\nthe beginning and why I feel so lucky to have come to it this early (kids 6, 5 <br/>\nand 3). I&#39;ve learned to see the value in everything my kids do because I&#39;ve <br/>\nalways been with them, participating in their lives and listening to their <br/>\npassions.  &gt;&gt;<br/>\n<br/>\nI know for certain that unschooling has worked wonderfully for us in large <br/>\npart because my kids were school-free.<br/>\n<br/>\nBut to soften this, I want to say that Danielle is lucky.  It doesn&#39;t mean <br/>\npeople who have once had their kids in school might as well leave them there, <br/>\nand I could just sense hackles going up when I read what she wrote. &lt;g&gt;  Maybe I <br/>\njust have too much imagination, but maybe I have the experience to know that <br/>\nsome people will think, say or write &quot;SO you&#39;re saying that unless our kids <br/>\nhave always been home that we can&#39;t really unschool?&quot;<br/>\n<br/>\nHere&#39;s what Danielle&#39;s testimonial is good for:<br/>\n<br/>\nWhen someone is considering unschooling but saying &quot;But I think I&#39;ll let him <br/>\ngo to preschool because he wants to,&quot; or &quot;I didn&#39;t figure just kindergarten <br/>\nwould hurt, because they just play,&quot; it might help future advisors and helpers <br/>\nto say &quot;Well, there seem to be other advantages to kids never being schooled.&quot;<br/>\n<br/>\nYES people can get to unschooling after years of school, but what if they <br/>\nhave NO school to overcome, and all the deschooling is just in the parents&#39; minds <br/>\nand attitudes, rather than in the children&#39;s minds, sleep schedules, ideas, <br/>\nfears, the bookshelf, the relatives...   SO much smoother and whole.<br/>\n<br/>\nSo for those who haven&#39;t been to school or have been, we work where we are.  <br/>\nBut for those who are undecided, we have more evidence to offer them.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":6770123,"authorName":"BonKnit@aol.com","from":"BonKnit@...","profile":"pampmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Learning to see differently","postDate":"1077391261","msgId":91256,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQ4LjNmM2Y2OGQuMmQ2OTA5OWRAYW9sLmNvbT4="},"prevInTopic":91254,"nextInTopic":91257,"prevInTime":91255,"nextInTime":91257,"topicId":91221,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/21/2004 1:04:45 PM Central Standard Time, ... Yes, this is a hard one for many people, it was for me, separating what I think from what my","messageBody":"<div id=\"ygrps-yiv-826027161\">In a message dated 2/21/2004 1:04:45 PM Central Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:WendyWCarr@...\">WendyWCarr@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  That&#39;s ok with me, but not ok for her. I have not told her we (Un)School. <br/>\n&gt; She would probably tell me I am neglecting him!! I know your response will be <br/>\n&gt; to ignore her, and worry about my own child...its just hard.<br/>\n<br/>\n </span></blockquote>Yes, this is a hard one for many people, it was for me, separating what I <br/>\nthink from what my mother or MIL (or anyone else but mothers are a biggie for <br/>\nmany) thinks I should think.  Although I have made that break I remember how hard <br/>\nit was to get to where I am. For me it happened when I learned to trust what <br/>\nI think, I then found the courage to stand by my convictions. For me this was <br/>\nin the last 6 years and I am in my 40&#39;s. I imagine others make it sooner, I <br/>\ncame to it late.<br/>\nLaura<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":77522235,"authorName":"Julie Bogart","from":"&quot;Julie Bogart&quot; &lt;julie@...&gt;","profile":"juliecinci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Learning to see differently","postDate":"1077390745","msgId":91254,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGMxOGFpcCtxanI2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJBWTUtREFWMjFvbVJYZjJMVHIwMDAwMDU1N0Bob3RtYWlsLmNvbT4="},"prevInTopic":91252,"nextInTopic":91256,"prevInTime":91253,"nextInTime":91255,"topicId":91221,"numMessagesInTopic":0,"msgSnippet":"... everyday when he is playing his game boy, or thumbing through his huge stack of Yu-gi- yo cards, I wonder when he will ever learn anything! It just seems","messageBody":"<div id=\"ygrps-yiv-1723430699\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, &quot;Wendy Carr&quot; &lt;WendyWCarr@m...&gt; <br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I am still not to this point. I envy you! Ive had my son out of school since Sept, and <br/>\n </span></blockquote>everyday when he is playing his game boy, or thumbing through his huge stack of Yu-gi-<br/>\nyo cards, I wonder when he will ever learn anything! It just seems that&#39;s all he wants to do. <br/>\nThat&#39;s all he talks about. Yu-Gi-Yo Cards.... And he doesn&#39;t know how to play the game, <br/>\nand I am so not interested in trying to teach the game. Those games are hard even for me <br/>\nto understand. <br/>\n<blockquote><span title=\"ireply\"> &gt; I am ready for his Obsession with these cards to be gone. He&#39;s always been a little OCD <br/>\n </span></blockquote>about things he likes. <br/>\n<blockquote><span title=\"ireply\"> &gt; But really when I look at it from another point of view...he reads the cards, counts up <br/>\n </span></blockquote>and subtracts the life points and attack points they have ect... but still, Id rather him not <br/>\nbe sooooo obsessed. He has woke me up at night just to tell me about a card!<br/>\n<blockquote><span title=\"ireply\"> &gt; He is 9 by the way.<br/>\n<br/>\n </span></blockquote>Can I jump in here? Our unschooling odyssey began with Yu-Gi-Oh cards. My then 8 yo <br/>\nson loved them and the show too. I asked him to teach me how to play (I so didn&#39;t want to <br/>\nlearn) and got confused immediately. He did too. So I took out the playbook and learned <br/>\nwith him. Do you know the game became fun, even for me? I mean, I won&#39;t go out and play <br/>\non my own, but I suddenly saw the genius of this game and why it&#39;s compelling to my son, <br/>\nwhich in turn helped me to understand  him better (and who he is and why this stuff <br/>\nfascinates him and how it stimulates his imagination...) I also discovered that the math <br/>\nbook we had been using just a month prior was waaaay under his ability. I just hadn&#39;t <br/>\nknown because I had never seen him using math in context. He was adding and <br/>\nsubtracting complex four digit numbes in his head (at 8) when I thought he had to learn <br/>\nhow to carry or borrow in two digit operations.<br/>\n<br/>\nOne of the most important shifts in my attitude toward unschool came when I took <br/>\nSandra&#39;s advice - spend all day with your kids doing what they&#39;re doing. I did this for <br/>\nmonths and it made all the difference in the world. I stopped worrying about what they <br/>\nwere learning because I got to know them as they are and saw learning in all its variety.<br/>\n<br/>\nJulie</div>","specialLinks":[]},{"userId":141102765,"authorName":"Mary","from":"&quot;Mary&quot; &lt;mummy124@...&gt;","profile":"mummyone24","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Learning to see differently","postDate":"1077387912","msgId":91249,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNjEwMWMzZjhhOCQwYmE1OTEyMCQ2MTAxYThjMEBsYXVuY2htb2RlbS5jb20+","referencesHeader":"PGQ3LjNlNTMzM2MuMmQ2ODE5OWJAYW9sLmNvbT4gPDAwMmYwMWMzZjgyNCQyZjU4ZGQ5MCQwMjAxYThjMEBhby5sb3AuY29tPiA8QkFZNS1EQVYyMW9tUlhmMkxUcjAwMDAwNTU3QGhvdG1haWwuY29tPiA8MDAyMTAxYzNmODg0JGY5MTk2YjMwJDY1MDFhOGMwQGpnazY5MDA+"},"prevInTopic":91246,"nextInTopic":91252,"prevInTime":91248,"nextInTime":91250,"topicId":91221,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-872742127\">&lt;&lt; Wendy wrote:<br/>\n&lt;&lt;I am still not to this point. I envy you! Ive had my son out of school<br/>\nsince Sept, and everyday when he is playing his game boy, or thumbing<br/>\nthrough his huge stack of Yu-gi-yo cards, I wonder when he will ever learn<br/>\nanything! It just seems that&#39;s all he wants to do. That&#39;s all he talks<br/>\nabout. Yu-Gi-Yo Cards.... And he doesn&#39;t know how to play the game, and I am<br/>\nso not interested in trying to teach the game. Those games are hard even for<br/>\nme to understand.<br/>\nI am ready for his Obsession with these cards to be gone. He&#39;s always been a<br/>\nlittle OCD about things he likes.<br/>\nBut really when I look at it from another point of view...he reads the<br/>\ncards, counts up and subtracts the life points and attack points they have<br/>\nect... but still, Id rather him not be sooooo obsessed. He has woke me up at<br/>\nnight just to tell me about a card!&gt;&gt;<br/>\n<br/>\n<br/>\n<br/>\nI had a YuGiOh freak here in the house. Freak as in that seemed to be his<br/>\nonly passion. It isn&#39;t any longer, but if it still was, it would be no big<br/>\ndeal. He enjoyed it so much and got so much out of it, how could I possibly<br/>\nobject to him enjoying and having fun?<br/>\n<br/>\nHis memory with that game was astounding to me. I couldn&#39;t believe how he<br/>\nknew all the stats on each card. Just from looking at the picture or hearing<br/>\nthe name of the card, he could recite everything on the card. He watched the<br/>\nshow, collected the cards, played the game at home and with friends, taught<br/>\nthe game and went to a gaming store to play and trade. He still plays every<br/>\nonce in awhile but not like he did before. I too had no interest in YuGiOh<br/>\nitself. I couldn&#39;t get the hang of it and couldn&#39;t see the fascination. That<br/>\ndidn&#39;t stop me from listening to him in regard to the game and the cards. It<br/>\ndidn&#39;t stop me from driving him all over looking for cards, setting up days<br/>\nso he could play the game with friends and  from taking him to the gaming<br/>\nstore when he wanted. Those were things that were very important to him, for<br/>\nreasons I didn&#39;t understand, but still important to me that he was doing<br/>\nwhat he loved. I was totally taken aback when I went with him for the first<br/>\ntime to the gaming store. His dad took him before. So here&#39;s my quiet little<br/>\n7 year old boy walking into the gaming store with more confidence than I<br/>\nhad. He went up to kids he never met before, some as old as 19 and 20, and<br/>\nasked to trade or play the game. Wow!!!! Whatever he was getting out of this<br/>\ngame was certainly influencing him in a good way. I let him run with it,<br/>\njust like I do when he gets into anything else that peaks his interest.<br/>\n<br/>\nHe&#39;s 9 now and off into other directions. But YuGiOh was definitely a good<br/>\nthing for him.<br/>\n<br/>\n<br/>\nMary B.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.homeschoolingtshirts.com\">http://www.homeschoolingtshirts.com</a></div>","specialLinks":[]},{"userId":160969203,"authorName":"Wendy Carr","from":"&quot;Wendy Carr&quot; &lt;WendyWCarr@...&gt;","profile":"wendycarrga","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: 9 yo boy and Yu-Gi-Oh","postDate":"1077384549","msgId":91260,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTUtREFWODluMDJteEZLblgwMDAwMDhhZEBob3RtYWlsLmNvbT4=","referencesHeader":"PDIwMDQwMjIxMTYwMTUzLjYzMzYxLnFtYWlsQHdlYjEyNjA3Lm1haWwueWFob28uY29tPg=="},"prevInTopic":91259,"nextInTopic":91261,"prevInTime":91259,"nextInTime":91261,"topicId":91221,"numMessagesInTopic":0,"msgSnippet":"I am on it right now,,,, reading the instruction book! Im gonna try. He is excited! Have you taken the time to sit and try to play with him? let him show you","messageBody":"<div id=\"ygrps-yiv-182957489\">I am on it right now,,,, reading the instruction book! Im gonna try. He is excited!<br/>\n<br/>\nHave you taken the time to sit and try to play with him? let him show you what he knows? Even if it isn&#39;t your preferred way of interacting with him, you&#39;ll both be making a memory to treasure<br/>\nWendy Carr<br/>\nWhen the first baby laughed for the first time, the laugh broke into a thousand pieces and they all went skipping about, and that was the beginning of fairies. - Barrie<br/>\nMom to Austyn(9) and Caitlin(6 months)<br/>\n<br/>\nProud  To Home-school!<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":162967824,"authorName":"Dawn Adams","from":"&quot;Dawn Adams&quot; &lt;Wishbone@...&gt;","profile":"bluenosegoddess","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Learning to see differently","postDate":"1077384428","msgId":91246,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMjMwMWMzZjg5ZiRlZjQ4N2VhMCQ3NTRjZGUxOEBhb2xkc2wubmV0Pg==","referencesHeader":"PDFjNS4xNGNkMTFhZi4yZDY4NTE0Y0Bhb2wuY29tPiA8MDNkZTAxYzNmODhkJGQ1MjQ5ZWQwJDAzMDBhOGMwQFRpbmtlcmJlbGw+"},"prevInTopic":91244,"nextInTopic":91249,"prevInTime":91245,"nextInTime":91247,"topicId":91221,"numMessagesInTopic":0,"msgSnippet":"Wendy writes:  If you","messageBody":"<div id=\"ygrps-yiv-2128925526\">Wendy writes:<br/>\n&lt;&lt; when he is playing his game boy, or thumbing through his huge stack of <br/>\nYu-gi-yo cards, I wonder when he will ever learn anything! &gt;&gt;<br/>\n<br/>\nIf you need to see learning at times and can&#39;t see any at all then remind yourself of this. He&#39;s learning a) his happiness and leisure are important and b) how to make himself happy. That&#39;s something that far too many many people never learn.<br/>\n<br/>\nDawn (in NS)<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":160969203,"authorName":"Wendy Carr","from":"&quot;Wendy Carr&quot; &lt;WendyWCarr@...&gt;","profile":"wendycarrga","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Learning to see differently","postDate":"1077384060","msgId":91259,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTUtREFWNjZ0SXptUVZ1UlcwMDAwMDhlZkBob3RtYWlsLmNvbT4=","referencesHeader":"PDIwMDQwMjIxMTM1MjM0LkRFMjc5MjJFQ0VAd3MxLTgudXM0Lm91dGJsYXplLmNvbT4="},"prevInTopic":91257,"nextInTopic":91260,"prevInTime":91258,"nextInTime":91260,"topicId":91221,"numMessagesInTopic":0,"msgSnippet":"This make perfect sense to me! Thanks! ","messageBody":"<div id=\"ygrps-yiv-1899830302\">This make perfect sense to me! Thanks!<br/>\n<br/>\n&lt;You&#39;re still looking for the learning, and I know that&#39;s a tough habit to get out of.  But, you can do it, with a lot of conscious effort on your part.  Going to the aquarium is not better than dueling or playing a GameBoy.  Different, but not better.  I&#39;ll bet that the kids he knows talk more about dueling or video games than they do about fish and wildlife.  He&#39;s in touch with what goes on around him, the people he knows and the things that they do.  Including you.  He enjoys Yu-Gi-Oh AND the aquarium.  If you try real hard, you can do that too!  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n </span></blockquote>Wendy Carr<br/>\nWhen the first baby laughed for the first time, the laugh broke into a thousand pieces and they all went skipping about, and that was the beginning of fairies. - Barrie<br/>\nMom to Austyn(9) and Caitlin(6 months)<br/>\n<br/>\nProud  To Home-school!<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":164396504,"authorName":"Elizabeth Roberts","from":"Elizabeth Roberts &lt;mamabethuscg@...&gt;","profile":"mamabethuscg","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: 9 yo boy and Yu-Gi-Oh","postDate":"1077379313","msgId":91244,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwMjIxMTYwMTUzLjYzMzYxLnFtYWlsQHdlYjEyNjA3Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDY4LjNiNWYzYmZkLjJkNjhjOWY2QGFvbC5jb20+"},"prevInTopic":91241,"nextInTopic":91246,"prevInTime":91243,"nextInTime":91245,"topicId":91221,"numMessagesInTopic":0,"msgSnippet":"Here s another thought...what if he goes on from there to design the next big card craze among kids his age...at least those in his neighborhood...from what","messageBody":"<div id=\"ygrps-yiv-132577268\">Here&#39;s another thought...what if he goes on from there to design the next big card craze among kids his age...at least those in his neighborhood...from what he&#39;s learned? Drawing the cards, computing values for each character, naming and designing them...<br/>\n<br/>\nThere&#39;s alot of potential coming from &quot;just playing cards&quot; like Yu-Gi-Oh. <br/>\n<br/>\nHave you taken the time to sit and try to play with him? let him show you what he knows? Even if it isn&#39;t your preferred way of interacting with him, you&#39;ll both be making a memory to treasure!<br/>\n<br/>\nMamaBeth<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\nYahoo! Mail SpamGuard - Read only the mail you want.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":135843572,"authorName":"24hrmom","from":"&quot;24hrmom&quot; &lt;24hrmom@...&gt;","profile":"learn2day2002","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Learning to see differently","postDate":"1077376654","msgId":91241,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAzZGUwMWMzZjg4ZCRkNTI0OWVkMCQwMzAwYThjMEBUaW5rZXJiZWxsPg==","referencesHeader":"PDFjNS4xNGNkMTFhZi4yZDY4NTE0Y0Bhb2wuY29tPg=="},"prevInTopic":91240,"nextInTopic":91244,"prevInTime":91240,"nextInTime":91242,"topicId":91221,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/20/04 11:05:03 PM, WendyWCarr@msn.com writes: ","messageBody":"<div id=\"ygrps-yiv-1719032168\">In a message dated 2/20/04 11:05:03 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:WendyWCarr@...\">WendyWCarr@...</a> writes:<br/>\n<br/>\n&lt;&lt; when he is playing his game boy, or thumbing through his huge stack of <br/>\nYu-gi-yo cards, I wonder when he will ever learn anything! &gt;&gt;<br/>\n<br/>\n<br/>\nI truly, truly wish you could see all the amazing things that I am positive he is learning.  And he&#39;s enjoying himself!<br/>\n<br/>\nI also wish that you could be with him and play with him and watch him, just enjoying his company and his excitement.  It would really help you to see all the learning that is happening.  Part of the journey to unschooling, or learning to see differently, is let go of ALL your preconceived, &quot;schoolish&quot; notions about learning and really just be with your kids while they are doing what they enjoy.  I think that&#39;s the biggest first step.  You need to be able to see all the learning that happens every day, with any activity.  And you will see it - if you can toss the schoolish glasses and be open to it.<br/>\n<br/>\nYou will get to a point where seeing him enjoying his gameboy and cards makes you smile.  You will be able to see what he&#39;s doing as just as valuable as a trip to the aquarium ... even more so if he&#39;s not really interested sea creatures.  :-)<br/>\n<br/>\nPam L<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":135843572,"authorName":"24hrmom","from":"&quot;24hrmom&quot; &lt;24hrmom@...&gt;","profile":"learn2day2002","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Learning to see differently","postDate":"1077376507","msgId":91240,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAzZGEwMWMzZjg4ZCQ3ZDgxNzg2MCQwMzAwYThjMEBUaW5rZXJiZWxsPg==","referencesHeader":"PGQ3LjNlNTMzM2MuMmQ2ODE5OWJAYW9sLmNvbT4gPEY5NzJFQzI1LTY0NDMtMTFEOC04NzJDLTAwMEE5NUUyOTJDNkBtYWMuY29tPg=="},"prevInTopic":91239,"nextInTopic":91241,"prevInTime":91239,"nextInTime":91241,"topicId":91221,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-999492018\">&lt;&lt;On Feb 20, 2004, at 6:16 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> wrote:<br/>\n<br/>\nIf anyone who understands what I&#39;m saying can think of another way to <br/>\nsay it, help would be great.&gt;&gt;<br/>\n<br/>\nI pretty sure I understand what you&#39;re saying.  To me, learning to see differently really has been (and still is) a wonderful, personal journey.<br/>\n<br/>\nThe first big step was to let go of my own ideas about what learning looked like (take off my &quot;schoolish&quot; glasses) and be with my kids.  Watching them, playing with them, taking them places we didn&#39;t have time to visit when they were in school, just slowing down and letting them get their fill of what they enjoyed.  This is definitely the deschooling phase, and I definitely had the most deschooling to do.  It involved a lot of thinking, a lot of intense questioning of myself to try to get to the root of what I really wanted to give my kids.  And the really fun part, being with them and seeing just how much they were learning pursuing their own interests.<br/>\n<br/>\nThe kids had some deschooling of their to get through too, some school-inspired intense dislikes: my eldest son (he was almost 10 when he came home) to writing and it was a year I think before he even picked up a pen or pencil; and my daughter (she was almost 8) to reading, which she only came to recently.  My youngest was only in school half-day for a few months so he didn&#39;t have much to &quot;recover&quot; from, other than the schedule. ;-)<br/>\n<br/>\nIt&#39;s been almost two years now and I&#39;m pretty confident that we are now easing out of the deschooling phase into &quot;real&quot; unschooling - the next phase of the journey.  I see learning in everything they do!  I no longer see some learning (topics or &quot;schoolish&quot; bent) as &quot;more valuable&quot; than others.  I&#39;ve been keeping a journal on and off (on right now) and I have exciting things to write in it every day ... and I know our days are typical ... I just see things so differently now!  I don&#39;t write things in schoolish terms, just in terms of the activities of living a joyful life, but boy does the learning jump out at me (and I think to the small circle of family to which I send it to help them better understand what we do).  In this phase though we&#39;re pretty much actively avoiding anything that looks academic.  Not consciously as in that&#39;s schoolish so we can&#39;t do it, but as in anything with an obvious (and even not so obvious) teacher/student setup is not interesting to them.  <br/>\n<br/>\nNor frankly, is it something I wish them to do.  I want them to completely break free of the idea that if they want to learn something they should just find a &quot;teacher&quot;, open up, and let them pour their &quot;knowledge&quot; in.  I want them to actively experience learning as the pursuit of knowledge on any topic ... from books, the internet, experiencing it, meeting other people who enjoy the topic, mentors and so on.  To enjoy the connections they find between seemingly unrelated bits of information.  To learn that &quot;teachers&quot; are not the only source of information out there, just one of many.  So right now, when someone expresses an interest in something, &quot;let&#39;s find a teacher&quot; is definitely not my first reaction.<br/>\n<br/>\nI think we will eventually get to the &quot;experienced unschoolers&quot; phase, where I imagine my first thoughts when I see my kids enjoying an activity won&#39;t be &quot;wow, look how much they&#39;re learning!&quot;; my mind will go directly to the thought that they&#39;re enjoying what they&#39;re doing.  Where the idea of an &quot;academic&quot; situation won&#39;t seem completely unappealing to my kids - they will see it as another option to dabble in while pursuing their interests.  And where I will be able to detach myself from the whole punishment / reward system built into school and just enjoy seeing them get what they want out of any academic situation.<br/>\n<br/>\nI&#39;m not there yet, but I&#39;m really enjoying the journey!<br/>\n<br/>\nPam L<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":7143857,"authorName":"jrossedd@aol.com","from":"jrossedd@...","profile":"jrossedd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Learning to see differently","postDate":"1077374966","msgId":91239,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY4LjNiNWYzYmZkLjJkNjhjOWY2QGFvbC5jb20+"},"prevInTopic":91237,"nextInTopic":91240,"prevInTime":91238,"nextInTime":91240,"topicId":91221,"numMessagesInTopic":0,"msgSnippet":"... LOL - I have called this sucking the marrow out of something, to which my DD invariably replies, Gross! I know what you mean but can t you call it","messageBody":"<div id=\"ygrps-yiv-1565357186\"><a rel=\"nofollow\" target=\"_blank\" href=\"mailto:danielle.conger@...\">danielle.conger@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I want to suggest replacing &quot;obsession&quot; in your mind with &quot;passion.&quot; When I <br/>\n&gt; am passionately learning about something, which is exactly how I tend to <br/>\n&gt; learn things, it looks &quot;obsessive&quot; to some other point of view. <br/>\n<br/>\n<br/>\n </span></blockquote>       LOL - I have called this &quot;sucking the marrow&quot; out of something, to <br/>\nwhich my DD invariably replies, &quot;Gross! I know what you mean but can&#39;t you call <br/>\nit something ELSE??&quot;<br/>\n<br/>\n       So now it&#39;s a little unschooling ritual with us. She anticipates <br/>\nmoments in which I might be about to say it, and gives me this warning scowl, and <br/>\nthen we both giggle.  A few times we&#39;ve tried to come up with a phrase equally <br/>\nevocative but less graphic -- no luck yet, but it makes for fun conversation.  <br/>\nJJ<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":164542605,"authorName":"Danielle Conger","from":"&quot;Danielle Conger&quot; &lt;danielle.conger@...&gt;","profile":"danielleconger","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Learning to see differently","postDate":"1077372849","msgId":91237,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMjEwMWMzZjg4NCRmOTE5NmIzMCQ2NTAxYThjMEBqZ2s2OTAwPg==","referencesHeader":"PGQ3LjNlNTMzM2MuMmQ2ODE5OWJAYW9sLmNvbT4gPDAwMmYwMWMzZjgyNCQyZjU4ZGQ5MCQwMjAxYThjMEBhby5sb3AuY29tPiA8QkFZNS1EQVYyMW9tUlhmMkxUcjAwMDAwNTU3QGhvdG1haWwuY29tPg=="},"prevInTopic":91236,"nextInTopic":91239,"prevInTime":91236,"nextInTime":91238,"topicId":91221,"numMessagesInTopic":0,"msgSnippet":"Wendy wrote: I am still not to this point. I envy you! Ive had my son out of school since Sept, and everyday when he is playing his game boy, or thumbing","messageBody":"<div id=\"ygrps-yiv-545479492\">Wendy wrote:<br/>\n  I am still not to this point. I envy you! Ive had my son out of school since Sept, and everyday when he is playing his game boy, or thumbing through his huge stack of Yu-gi-yo cards, I wonder when he will ever learn anything! It just seems that&#39;s all he wants to do. That&#39;s all he talks about. Yu-Gi-Yo Cards.... And he doesn&#39;t know how to play the game, and I am so not interested in trying to teach the game. Those games are hard even for me to understand. <br/>\n  I am ready for his Obsession with these cards to be gone. He&#39;s always been a little OCD about things he likes. <br/>\n  But really when I look at it from another point of view...he reads the cards, counts up and subtracts the life points and attack points they have ect... but still, Id rather him not be sooooo obsessed. He has woke me up at night just to tell me about a card!<br/>\n  ==================================================================<br/>\n<br/>\nThis is one of the main reasons why I think it is easier to unschool from the beginning and why I feel so lucky to have come to it this early (kids 6, 5 and 3). I&#39;ve learned to see the value in everything my kids do because I&#39;ve always been with them, participating in their lives and listening to their passions.  I&#39;ve seen how much they learn without school every day since they were born, so there is no rational reason to send them into some artificially constructed learning place. I trust my children and *know* how capable they are, so it really doesn&#39;t matter to me if they learn something on someone else&#39;s timetable, for someone else&#39;s reasons. I *know* that they will be perfectly capable of learning it if and when they decide they want/need to based on intrinsic motivation.<br/>\n<br/>\nThis is what is so hard for people to grasp. My mother keeps asking me about Emily&#39;s (6) reading. The other day I finally said to her, &quot;Em reads when she&#39;s interested in reading. She&#39;s not going to be 50 and still not reading,&quot; to which my mother responded, &quot;I&#39;m afraid she might be.&quot; I just told her that I wasn&#39;t the least bit concerned about Emily&#39;s ability to read, what I am concerned about is teaching her to hate reading, and that is about the only thing I could *teach* her right now about reading.<br/>\n<br/>\nI&#39;ve recently broken away from an online parents group that I&#39;ve been with since I was pregnant with Emily. The space was becoming very oppressive to me with all the discussion of academics, intervention, comparison, etc. I&#39;m finding that I need to separate myself from the school mentality because I feel it&#39;s so destructive. I don&#39;t want to get caught up in the whole comparison game. I said as much and started a firestorm. Reading this list and the unschooling.com message boards is incredibly helpful. I&#39;m trying to *surround* myself with people who are supportive of the way we live our lives instead of those who constantly judge it, which goes a long way to quiet any nagging voices in the back of my mind. It&#39;s a whole lot easier to focus on my children, who they are as whole beings, when I&#39;m not surrounded by folks who are constantly comparing and worrying about their children&#39;s academic progress.<br/>\n<br/>\nI want to suggest replacing &quot;obsession&quot; in your mind with &quot;passion.&quot; When I am passionately learning about something, which is exactly how I tend to learn things, it looks &quot;obsessive&quot; to some other point of view. When I started gardening, I passionately read about it, poured over beautiful pictures in magazines and  landscaping books, wrote and drew daily in my garden journal, designing and redesigning all the things I wanted to do. I *loved* doing it, and that&#39;s what I wanted to do and think about whenever I could. I can&#39;t imagine someone coming and telling me how stupid and obsessive I was being over something as ridiculous as a plant. In the aftermath of 9/11/01 (my dh works on a naval base next to an AFB in DC, my sil works in NYC and her then-husband worked and was in the Trade Center that day, so it hit pretty close), gardening was my outlet and my therapy. It gave me peace and made me feel like I was doing something to make the world beautiful. What if someone told me how stupid that was? It would have completely negated a very important part of me, of who I was at that moment and what I needed to be doing.  I learned so much by following my passion, it healed my soul and I made a small part of the world a more beautiful and hospitable place. Parts of my yard are sanctuaries for me, my kids, friends, birds, butterflies, caterpillars, frogs and loads of other wildlife. And, my kids have learned a ton from exposure to my passion. Open yourself up, and I&#39;m betting that you could learn something by embracing your son&#39;s passion, too.<br/>\n<br/>\n--danielle<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":175898140,"authorName":"Marti","from":"Marti &lt;marti@...&gt;","profile":"nestmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Learning to see differently","postDate":"1077372739","msgId":91236,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYuMC4zLjAuMC4yMDA0MDIyMTA5MDI1Mi4wMWI1N2VjMEAxMjcuMC4wLjE+","inReplyToHeader":"PDIwMDQwMjIxMTM1MjM0LkRFMjc5MjJFQ0VAd3MxLTgudXM0Lm91dGJsYXplLmNvbT4=","referencesHeader":"PDIwMDQwMjIxMTM1MjM0LkRFMjc5MjJFQ0VAd3MxLTgudXM0Lm91dGJsYXplLmNvbT4="},"prevInTopic":91235,"nextInTopic":91237,"prevInTime":91235,"nextInTime":91237,"topicId":91221,"numMessagesInTopic":0,"msgSnippet":"... This is **so** true. I posted earlier this week about Katie s poetry. I realized later that what thrilled me is this:  I ve worked really hard to bite my","messageBody":"<div id=\"ygrps-yiv-1912802520\">At 08:52 AM 02/21/2004, you wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;And when you can show the same excitement about every other thing he does, <br/>\n&gt;you will be officially deschooled!<br/>\n&gt;<br/>\n&gt;You&#39;re still looking for the learning, and I know that&#39;s a tough habit to <br/>\n&gt;get out of.<br/>\n<br/>\n </span></blockquote>This is **so** true. I posted earlier this week about Katie&#39;s poetry. I <br/>\nrealized later that what thrilled me is this:  I&#39;ve worked really hard to <br/>\nbite my tongue, let go of trying to make them learn... to really give them <br/>\nspace to do whatever they enjoy doing. They have the freedom to unschool, <br/>\nfar more than they ever have. And I&#39;m careful to keep my reservations as <br/>\nhidden as I can, when they still pop up.<br/>\n<br/>\nSo my girls&#39; time is filled with a lot of computers, PS2, TV, Gameboy... <br/>\nand also a lot of what I used to consider more &quot;valuable&quot; explorative <br/>\nlearning... making forts to play in, crafting for hours on end - making all <br/>\nsorts of neat stuff, reading (sometimes, not much), playing with <br/>\n&quot;educational&quot; toys, going outside to play, etc.<br/>\n<br/>\nKatie (nearly age 7) has spent a lot of time on the computer and watching <br/>\nTV lately, and I&#39;ve been mindful of not worrying about that. But when she <br/>\npiped up with this wonderful poetry... I realize that I was thinking, &quot;Wow, <br/>\nshe learned and produced all of this [language arts] work, and she hasn&#39;t <br/>\nworked on anything like that, it just plopped out of her. So she must be <br/>\n&#39;learning&#39; even though she&#39;s not really &#39;doing&#39; learning stuff... the <br/>\nunschooling is working!&quot;<br/>\n<br/>\nWrong. Paradigm shift, yet again. I still need to appreciate the <br/>\n&quot;non-educational&quot; learning as much as the &quot;educational&quot; learning... to her <br/>\nface, and to others.<br/>\n<br/>\nSo... I&#39;m going to share something about her that&#39;s not &quot;educational&quot; in my <br/>\nold sense of thinking... but I&#39;m promising here (you can hold me to it!) to <br/>\nshare more with her - to *learn* with her, about some of her favorite <br/>\nthings :-) Her favorite TV show right now is &quot;All That,&quot; on Nickelodeon. <br/>\nAnd I&#39;ll be catching upcoming episodes soon.<br/>\n<br/>\nMarti<br/>\nSmithsburg MD</div>","specialLinks":[]},{"userId":169340192,"authorName":"Lyle W.","from":"&quot;Lyle W.&quot; &lt;unschoolingdad@...&gt;","profile":"lyle_perry","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Learning to see differently","postDate":"1077371554","msgId":91235,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwMjIxMTM1MjM0LkRFMjc5MjJFQ0VAd3MxLTgudXM0Lm91dGJsYXplLmNvbT4="},"prevInTopic":91234,"nextInTopic":91236,"prevInTime":91234,"nextInTime":91236,"topicId":91221,"numMessagesInTopic":0,"msgSnippet":"... Maybe he s wondering when you will ever SEE what he s learning.  Maybe he s wondering when you will join him in what he s learning, or at least express","messageBody":"<div id=\"ygrps-yiv-1761910020\">Wendy Carr wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;I wonder when he will ever learn anything!&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Maybe he&#39;s wondering when you will ever SEE what he&#39;s learning.  Maybe he&#39;s wondering when you will join him in what he&#39;s learning, or at least express some joy and satisfaction that he IS learning. (He IS learning, you know.)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;That&#39;s all he talks about. Yu-Gi-Yo Cards&lt;&lt;<br/>\n<br/>\n </span></blockquote>What do you talk about?  Anything BUT Yu-Gi-Oh cards?  It sounds like you&#39;re waiting for him to get through a &quot;phase&quot; or something so he can really get down to some serious learning.  The problem is, he&#39;s already there, he&#39;s just waiting for you to catch up!  You&#39;re the one that&#39;s behind.  He&#39;s doing the learning, he&#39;s moved on, and you&#39;re still stuck on the same chapter.  It&#39;s time to turn the page.  Or better yet, put that book down, wrap it in some gasoline soaked newspapers, and offer it up as your last sacrifice to the School Gods.  Their powers are obselete now.  Break free from the academic death grip they have on your mind and set yourself free!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;And he doesn&#39;t know how to play the game, and I am so not interested in trying to teach the game.&lt;&lt;<br/>\n<br/>\n </span></blockquote>Well, that&#39;s a pretty depressing attitude.  Would you be interested in teaching him geography?  Biology?  Seismology?  Are those the important things?  Your things are important and his things are crap?  If that&#39;s true, I don&#39;t blame him for not being interested in your stuff.  Why should he get excited about your stuff when you look at his stuff with disdain and revulsion?  Don&#39;t forget that he&#39;s learning something about the signals you&#39;re sending him too.  He&#39;s learning ALL the time.  Don&#39;t let him learn that his mom thinks what he does is stupid.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Those games are hard even for me to understand.&lt;&lt;<br/>\n<br/>\n </span></blockquote>It&#39;s your attitude that makes it hard.  I&#39;m a duelist.  I&#39;ve got my own deck.  We have a blast dueling at our house.  Yes, it took me a while to learn, and I can rarely ever beat Dylan, but I have a lot of fun playing.  The &quot;hard&quot; was worth it.  If you&#39;re not willing to put out the effort to learn something that&#39;s hard for you, how can you ever expect your son to?  Model the attitude you would like him to follow.  Right now he&#39;s modeling it for you.  He wants to learn something hard, help him do it.  If you can&#39;t do it, find someone that can.   <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I am ready for his Obsession with these cards to be gone.&lt;&lt;<br/>\n<br/>\n </span></blockquote>He&#39;s learning about the cards.  He wants to learn to duel.  He&#39;s found something that fascinates him, and has a deep passion for, and you don&#39;t want to help.  I think you&#39;re the one with the obsession.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;We all went to the SC Aquarium over Valentines Weekend!&lt;&lt;<br/>\n&gt;&gt;Learned a lot about Fish and Water, and wildlife.&lt;&lt;<br/>\n<br/>\n </span></blockquote>Cool!  Sounds great!  And when you can show the same excitement about every other thing he does, you will be officially deschooled!  <br/>\n<br/>\nYou&#39;re still looking for the learning, and I know that&#39;s a tough habit to get out of.  But, you can do it, with a lot of conscious effort on your part.  Going to the aquarium is not better than dueling or playing a GameBoy.  Different, but not better.  I&#39;ll bet that the kids he knows talk more about dueling or video games than they do about fish and wildlife.  He&#39;s in touch with what goes on around him, the people he knows and the things that they do.  Including you.  He enjoys Yu-Gi-Oh AND the aquarium.  If you try real hard, you can do that too!  <br/>\n<br/>\n:)<br/>\n<br/>\nLyle<br/>\n<br/>\n***Always remember, Lead By Example***<br/>\n<br/>\n-- <br/>\n___________________________________________________________<br/>\nSign-up for Ads Free at Mail.com<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://promo.mail.com/adsfreejump.htm\">http://promo.mail.com/adsfreejump.htm</a></div>","specialLinks":[]},{"userId":160969203,"authorName":"Wendy Carr","from":"&quot;Wendy Carr&quot; &lt;WendyWCarr@...&gt;","profile":"wendycarrga","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Learning to see differently","postDate":"1077369972","msgId":91252,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTUtREFWNDZWWHF4c0QxVHkwMDAwMDYzM0Bob3RtYWlsLmNvbT4=","referencesHeader":"PDFjNS4xNGNkMTFhZi4yZDY4NTE0Y0Bhb2wuY29tPg=="},"prevInTopic":91249,"nextInTopic":91254,"prevInTime":91251,"nextInTime":91253,"topicId":91221,"numMessagesInTopic":0,"msgSnippet":"Oh you know, I think they have VALUE... But when that s ALL he does, its hard for me to see the educational value. Its partly outside pressure from my mother.","messageBody":"<div id=\"ygrps-yiv-362462425\">Oh you know, I think they have VALUE... But when that&#39;s ALL he does, its hard for me to see the educational value. Its partly outside pressure from my mother. She is always asking me what he is learning and I have nothing to tell her and she is always saying &quot;Mrs. Jones son can multiply to ten...how far can Austyn go?&quot; I cant tell her mine can, cause he cant. He knows HOW to do it, but doesn&#39;t have them memorized. That&#39;s ok with me, but not ok for her. I have not told her we (Un)School. She would probably tell me I am neglecting him!! I know your response will be to ignore her, and worry about my own child...its just hard. I&#39;m not as far into this as others here. We just started this in Sept. Its an everyday struggle! <br/>\nHe really does have an OCD personality. But I guess as long as he doesn&#39;t wash his hands until they fall off, he&#39;s ok! HA!<br/>\n<br/>\nWendy Carr<br/>\nWhen the first baby laughed for the first time, the laugh broke into a thousand pieces and they all went skipping about, and that was the beginning of fairies. - Barrie<br/>\nMom to Austyn(9) and Caitlin(6 months)<br/>\n<br/>\nProud  To Home-school!<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Learning to see differently","postDate":"1077352427","msgId":91234,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkyLjNmZDcyMGMuMmQ2ODcxZWJAYW9sLmNvbT4="},"prevInTopic":91233,"nextInTopic":91235,"prevInTime":91233,"nextInTime":91235,"topicId":91221,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/20/2004 10:37:01 PM Mountain Standard Time, litlrooh@earthlink.net writes: ","messageBody":"<div id=\"ygrps-yiv-1106227603\">In a message dated 2/20/2004 10:37:01 PM Mountain Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:litlrooh@...\">litlrooh@...</a> writes:<br/>\n&lt;&lt;Sooooooo....to get to the point you were trying to make:  if he were to <br/>\ntake a class now, my perspective of it would be so completely different.  It <br/>\nwould just be one more dish to taste on the buffet of life.  It would hold no more <br/>\nimportance to me than if he decided to go jam on the drums on a Friday night <br/>\ninstead.&gt;&gt;<br/>\n==========<br/>\n<br/>\nWhile your analogy makes crystal-clear sense to me, it occurred to me that <br/>\nmaybe there will be people reading whose children wouldn&#39;t have buffet-freedom.<br/>\n<br/>\nAt literal-not-figurative buffets, I sometimes see people fill their <br/>\nchildren&#39;s plates for them instead of helping them fill their own.  I see parents say <br/>\n&quot;no&quot; about buffet items, and I see them say &quot;no dessert&quot; at buffets.<br/>\n<br/>\nMaybe unschooling can&#39;t work before a parent can understand an analogy like <br/>\n&quot;just one more dish to taste on the buffet of life.&quot; &lt;bwg&gt;<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"pam sorooshian","from":"pam sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Learning to see differently","postDate":"1077350411","msgId":91233,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY5NzJFQzI1LTY0NDMtMTFEOC04NzJDLTAwMEE5NUUyOTJDNkBtYWMuY29tPg==","inReplyToHeader":"PGQ3LjNlNTMzM2MuMmQ2ODE5OWJAYW9sLmNvbT4=","referencesHeader":"PGQ3LjNlNTMzM2MuMmQ2ODE5OWJAYW9sLmNvbT4="},"prevInTopic":91232,"nextInTopic":91234,"prevInTime":91232,"nextInTime":91234,"topicId":91221,"numMessagesInTopic":0,"msgSnippet":"... I do - but it is very very difficult to describe. I just posted yesterday about my older teens taking community college courses and I was loathe to do so,","messageBody":"<div id=\"ygrps-yiv-1490489786\">On Feb 20, 2004, at 6:16 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; For someone who has been out of and away from school for six months to <br/>\n&gt; take a<br/>\n&gt; class will not be the same experience as someone (child or parent) who <br/>\n&gt; has<br/>\n&gt; been out and away for eight or ten years.   It will be different in <br/>\n&gt; very, very<br/>\n&gt; profound ways.  And &quot;profound&quot; doesn&#39;t show from the house.  You have <br/>\n&gt; to run<br/>\n&gt; until you can&#39;t see the house, and then profundity kicks in.<br/>\n&gt;<br/>\n&gt; If anyone who understands what I&#39;m saying can think of another way to <br/>\n&gt; say it,<br/>\n&gt; help would be great.<br/>\n<br/>\n </span></blockquote>I do - but it is very very difficult to describe. I just posted <br/>\nyesterday about my older teens taking community college courses and I <br/>\nwas loathe to do so, but made myself do it because I want to be <br/>\nforthcoming about our real lives. I was loathe to do so because I&#39;m <br/>\nafraid that people will read that and think THAT is what unschooling <br/>\nshould lead to. But that&#39;s NOT it. My kids maybe could be said to have <br/>\n&quot;dabbled&quot; in college. And that&#39;s usually considered a negative. But <br/>\nthat&#39;s the closest I can come to describing how they view their <br/>\nclasses. And they would be the FIRST to tell you that the classes were <br/>\nnice, but that they were just a little &quot;extra&quot; - not the basis of their <br/>\neducation/learning. They view the classes as just another item on the <br/>\nHUGE menu of options. They don&#39;t view the classes as &quot;where they learn&quot; <br/>\nor at least no more so than the other ways they learn.<br/>\n<br/>\nI don&#39;t know  - I agree with Sandra wholeheartedly on this, but also <br/>\nfind it difficult to articulate. I just want people new to unschooling <br/>\nto try to understand that we did first leave all &quot;teacher-directed&quot; <br/>\ntype of schooling entirely behind for many years before my kids started <br/>\ntaking classes. Now they view the teacher as a resource person and <br/>\nthemselves as responsible for their own learning. It is VERY different <br/>\nthan most of my students who think that I, as their teacher, run the <br/>\nshow. My teens are running their own show, they are the directors, and <br/>\nthe teachers of any classes they take are thought of more as useful <br/>\ntechnicians.<br/>\n<br/>\n-pam<br/>\nNational Home Education Network<br/>\n&lt;www.NHEN.org&gt;<br/>\nServing the entire homeschooling community since 1999<br/>\nthrough information, networking and public relations.</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Learning to see differently","postDate":"1077344076","msgId":91232,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFjNS4xNGNkMTFhZi4yZDY4NTE0Y0Bhb2wuY29tPg=="},"prevInTopic":91230,"nextInTopic":91233,"prevInTime":91231,"nextInTime":91233,"topicId":91221,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/20/04 11:05:03 PM, WendyWCarr@msn.com writes: ","messageBody":"<div id=\"ygrps-yiv-308963541\">In a message dated 2/20/04 11:05:03 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:WendyWCarr@...\">WendyWCarr@...</a> writes:<br/>\n<br/>\n&lt;&lt; when he is playing his game boy, or thumbing through his huge stack of <br/>\nYu-gi-yo cards, I wonder when he will ever learn anything! &gt;&gt;<br/>\n<br/>\nWhen will you learn to see the value in video games and collectible card <br/>\ngames?<br/>\nSeriously.  If it&#39;s a freeze out and you&#39;re waiting for HIM to change, you&#39;re <br/>\ngoing to wait a long, long time because he&#39;s doing something difficult and <br/>\ncurrent, and you&#39;re doing something old and rejected.  If you want him to do <br/>\nschool things, why isn&#39;t he in school?  They&#39;ll be GLAD to prohibit game boys and <br/>\nto confiscate Yu-gi-oh cards.<br/>\n<br/>\n-=- That&#39;s all he talks about. Yu-Gi-Yo Cards.... And he doesn&#39;t know how to <br/>\nplay the game, and I am so not interested in trying to teach the game. Those <br/>\ngames are hard even for me to understand. -=-<br/>\n<br/>\nBut they are NOT hard for children to understand.  How can that be?<br/>\nIf you&#39;re where you can get him to a gaming shop, you should definitely do <br/>\nthat.  If not, maybe invite other gamers over to teach him.  PAY an older kid if <br/>\nyou have to to come and teach him.    I wish I had done that with Kirby and <br/>\nMarty, instead of trying to help them learn Magic by talking them through a <br/>\nsample game with two pre-made decks and the book that came with them.  I wasn&#39;t <br/>\nmuch help and it was difficult, but I&#39;ve seen them explain games like that to <br/>\nother people now that they&#39;re good.  It IS complex, and it&#39;s also wonderful.<br/>\n<br/>\n-=-I am ready for his Obsession with these cards to be gone.-=-<br/>\n<br/>\nI wish you&#39;d be ready for your resistence to start to melt.<br/>\n<br/>\n-=-He&#39;s always been a little OCD about things he likes. -=-<br/>\n<br/>\nWould you like to paraphrase this two or three different ways so we can <br/>\nreally see what you&#39;re saying?  (Or maybe just for your own edification, without <br/>\neven telling us, figure out what you&#39;re truly thinking and saying there.)<br/>\n<br/>\n-=-He has woke me up at night just to tell me about a card!<br/>\nHe is 9 by the way.-=-<br/>\n<br/>\nHave you found him websites where he can read about the cards?  That might be <br/>\nsomething he can do while you&#39;re trying to sleep.  But seriously, try to find <br/>\nhim some people to play with!!  If you let us know where you are maybe we <br/>\ncould help, or if there&#39;s a store where he buys the cards ask them where people <br/>\nplay.  Or call any gaming shop or a shop that sells baseball cards and ask.  <br/>\nThey will know who to call.<br/>\n<br/>\n-=-He loves to watch water freeze in the freezer in different shaped <br/>\ncontainers. -=-<br/>\n<br/>\nYou honestly think watching water freeze is better than Yu-Gi-Oh?<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":160969203,"authorName":"Wendy Carr","from":"&quot;Wendy Carr&quot; &lt;WendyWCarr@...&gt;","profile":"wendycarrga","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Learning to see differently","postDate":"1077342519","msgId":91230,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTUtREFWMjFvbVJYZjJMVHIwMDAwMDU1N0Bob3RtYWlsLmNvbT4=","referencesHeader":"PGQ3LjNlNTMzM2MuMmQ2ODE5OWJAYW9sLmNvbT4gPDAwMmYwMWMzZjgyNCQyZjU4ZGQ5MCQwMjAxYThjMEBhby5sb3AuY29tPg=="},"prevInTopic":91225,"nextInTopic":91232,"prevInTime":91229,"nextInTime":91231,"topicId":91221,"numMessagesInTopic":0,"msgSnippet":"I am still not to this point. I envy you! Ive had my son out of school since Sept, and everyday when he is playing his game boy, or thumbing through his huge","messageBody":"<div id=\"ygrps-yiv-1953833284\">I am still not to this point. I envy you! Ive had my son out of school since Sept, and everyday when he is playing his game boy, or thumbing through his huge stack of Yu-gi-yo cards, I wonder when he will ever learn anything! It just seems that&#39;s all he wants to do. That&#39;s all he talks about. Yu-Gi-Yo Cards.... And he doesn&#39;t know how to play the game, and I am so not interested in trying to teach the game. Those games are hard even for me to understand. <br/>\nI am ready for his Obsession with these cards to be gone. He&#39;s always been a little OCD about things he likes. <br/>\nBut really when I look at it from another point of view...he reads the cards, counts up and subtracts the life points and attack points they have ect... but still, Id rather him not be sooooo obsessed. He has woke me up at night just to tell me about a card!<br/>\nHe is 9 by the way.<br/>\n<br/>\nOn a better note - We all went to the SC Aquarium over Valentines Weekend! What a blast!!!!!! Learned a lot about Fish and Water, and wildlife.<br/>\nTook tons of pics!<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: Have a Nice Day!&lt;mailto:litlrooh@...&gt; <br/>\n  To: UnschoolingDiscussion@yahoogroups.com&lt;mailto:UnschoolingDiscussion@yahoogroups.com&gt; <br/>\n  Sent: Friday, February 20, 2004 9:41 PM<br/>\n  Subject: Re: [UnschoolingDiscussion] Learning to see differently<br/>\n<br/>\n<br/>\n  Sandra,<br/>\n<br/>\n  I think I understand what you are saying.<br/>\n<br/>\n  The longer I am away from &quot;school&quot; the more sense all of this makes.  The recent discussions about unschooling and behavioral boundaries, and approach to children, combined as a lifestyle have let me finally and completely relax.<br/>\n<br/>\n  I don&#39;t *care* anymore if my son never picks up an algebra book.  I don&#39;t *care* anymore when my youngest daughter learns to read.<br/>\n<br/>\n  I have complete confidence in their ability to learn now.  <br/>\n<br/>\n  But I didn&#39;t before.  I *wanted* to believe that everything would work out but I was still afraid.  I&#39;d wait a long while, and then pull out a math book.  It might have only been once a year, so most of the time we *acted* like unschoolers, but I didn&#39;t *feel* what most of the experienced unschoolers described as confidence.  I pretended to be confident with my kids, but inside I was worried and it really interfered with my ability to just trust their ability to learn.<br/>\n<br/>\n  NOW, I can honestly say I LOVE this unschooling thing.  I feel so FREE.  I have all this energy now that I didn&#39;t have before because I was so busy using it up with worrying.  NOW I am so excited about all the things we can do.  THere are no limits anywhere for anything.  I  no longer care whether their learning fits the state model or not.  There are no barriers *anywhere*.  We can go wherever we want, whenever we want, for whatever reason we want. We can stay up all night watching movies and sleep all day if we want (we did that last night).  <br/>\n<br/>\n  If we make a mistake, so what.  It just means we can take a detour and learn even more stuff along the way.  THere is no end to the universe and all the mysteries that we can explore.<br/>\n<br/>\n  The paradigm shift has happened.  There will be no going back for me.  It took me 4 years...but here I am.<br/>\n<br/>\n  My 15 year old son has been sharing with me some of his interests.  He has shared with me how he goes with the neighbor to look at the stars through the telescope.  We were looking for netflix movies to rent based on his interests when he told me about his interest in astronomy.  He told me he loves to learn about trains and he wants to learn more about rifle shooting.<br/>\n<br/>\n  I&#39;ve seen it.  I&#39;ve seen him totally immerse himself into a subject.  I&#39;ve heard him share historical facts with me that *I* knew nothing about.  His own knowledge exceeds my own in many many areas.  WHO am *I* to say its not good enough until he does some algebra??  When he needs it he will immerse himself in it just like he does with everything else.  I totally and completely believe it now.<br/>\n<br/>\n  Sooooooo....to get to the point you were trying to make:  if he were to take a class now, my perspective of it would be so completely different.  It would just be one more dish to taste on the buffet of life.  It would hold no more importance to me than if he decided to go jam on the drums on a Friday night instead.<br/>\n<br/>\n  Kristen<br/>\n<br/>\n  [Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n  &quot;List Posting Policies&quot; are provided in the files area of this group. <br/>\n<br/>\n  Visit the Unschooling website and message boards: http://www.unschooling.com&lt;http://www.unschooling.com/&gt; <br/>\n<br/>\n<br/>\n<br/>\n------------------------------------------------------------------------------<br/>\n  Yahoo! Groups Links<br/>\n<br/>\n    a.. To visit your group on the web, go to:<br/>\n    http://groups.yahoo.com/group/UnschoolingDiscussion/&lt;http://groups.yahoo.com/group/UnschoolingDiscussion/&gt;<br/>\n      <br/>\n    b.. To unsubscribe from this group, send an email to:<br/>\n    UnschoolingDiscussion-unsubscribe@yahoogroups.com&lt;mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com?subject=Unsubscribe&gt;<br/>\n      <br/>\n    c.. Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service&lt;http://docs.yahoo.com/info/terms/&gt;. <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":166495566,"authorName":"Have a Nice Day!","from":"&quot;Have a Nice Day!&quot; &lt;litlrooh@...&gt;","profile":"rooh_","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Learning to see differently","postDate":"1077331278","msgId":91225,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMmYwMWMzZjgyNCQyZjU4ZGQ5MCQwMjAxYThjMEBhby5sb3AuY29tPg==","referencesHeader":"PGQ3LjNlNTMzM2MuMmQ2ODE5OWJAYW9sLmNvbT4="},"prevInTopic":91223,"nextInTopic":91230,"prevInTime":91224,"nextInTime":91226,"topicId":91221,"numMessagesInTopic":0,"msgSnippet":"Sandra, I think I understand what you are saying. The longer I am away from school the more sense all of this makes.  The recent discussions about","messageBody":"<div id=\"ygrps-yiv-365016836\">Sandra,<br/>\n<br/>\nI think I understand what you are saying.<br/>\n<br/>\nThe longer I am away from &quot;school&quot; the more sense all of this makes.  The recent discussions about unschooling and behavioral boundaries, and approach to children, combined as a lifestyle have let me finally and completely relax.<br/>\n<br/>\nI don&#39;t *care* anymore if my son never picks up an algebra book.  I don&#39;t *care* anymore when my youngest daughter learns to read.<br/>\n<br/>\nI have complete confidence in their ability to learn now.  <br/>\n<br/>\nBut I didn&#39;t before.  I *wanted* to believe that everything would work out but I was still afraid.  I&#39;d wait a long while, and then pull out a math book.  It might have only been once a year, so most of the time we *acted* like unschoolers, but I didn&#39;t *feel* what most of the experienced unschoolers described as confidence.  I pretended to be confident with my kids, but inside I was worried and it really interfered with my ability to just trust their ability to learn.<br/>\n<br/>\nNOW, I can honestly say I LOVE this unschooling thing.  I feel so FREE.  I have all this energy now that I didn&#39;t have before because I was so busy using it up with worrying.  NOW I am so excited about all the things we can do.  THere are no limits anywhere for anything.  I  no longer care whether their learning fits the state model or not.  There are no barriers *anywhere*.  We can go wherever we want, whenever we want, for whatever reason we want. We can stay up all night watching movies and sleep all day if we want (we did that last night).  <br/>\n<br/>\nIf we make a mistake, so what.  It just means we can take a detour and learn even more stuff along the way.  THere is no end to the universe and all the mysteries that we can explore.<br/>\n<br/>\nThe paradigm shift has happened.  There will be no going back for me.  It took me 4 years...but here I am.<br/>\n<br/>\nMy 15 year old son has been sharing with me some of his interests.  He has shared with me how he goes with the neighbor to look at the stars through the telescope.  We were looking for netflix movies to rent based on his interests when he told me about his interest in astronomy.  He told me he loves to learn about trains and he wants to learn more about rifle shooting.<br/>\n<br/>\nI&#39;ve seen it.  I&#39;ve seen him totally immerse himself into a subject.  I&#39;ve heard him share historical facts with me that *I* knew nothing about.  His own knowledge exceeds my own in many many areas.  WHO am *I* to say its not good enough until he does some algebra??  When he needs it he will immerse himself in it just like he does with everything else.  I totally and completely believe it now.<br/>\n<br/>\nSooooooo....to get to the point you were trying to make:  if he were to take a class now, my perspective of it would be so completely different.  It would just be one more dish to taste on the buffet of life.  It would hold no more importance to me than if he decided to go jam on the drums on a Friday night instead.<br/>\n<br/>\nKristen<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":7143857,"authorName":"jrossedd@aol.com","from":"jrossedd@...","profile":"jrossedd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Learning to see differently","postDate":"1077330662","msgId":91223,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFjZi4xYTQyMjc5OC4yZDY4MWNlNkBhb2wuY29tPg=="},"prevInTopic":91221,"nextInTopic":91225,"prevInTime":91222,"nextInTime":91224,"topicId":91221,"numMessagesInTopic":0,"msgSnippet":"... I do understand, and would be chagrined to ever have that unfortunate effect. Thanks for making the point (you ve done this before, haven t you? I can","messageBody":"<div id=\"ygrps-yiv-1981380527\"><a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Some people see experienced unschoolers (&quot;experienced&quot; meaning in this <br/>\n&gt; context people who have done it well and effortlessly for years, who aren&#39;t <br/>\n&gt; afraid <br/>\n&gt; anymore, who have seen inspiring results) mention classes, and they think <br/>\n&gt; &quot;Ah, <br/>\n&gt; well if the experienced unschoolers&#39; kids take classes, then classes are <br/>\n&gt; good/necessary/no problem.&quot; . . .<br/>\n&gt; <br/>\n&gt; If anyone who understands what I&#39;m saying can think of another way to say <br/>\n&gt; it, <br/>\n&gt; help would be great.  If anyone doesn&#39;t understand what I&#39;m saying, I <br/>\n&gt; recommend a full break-away from attachment to academics.   <br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n<br/>\n </span></blockquote>       I do understand, and would be chagrined to ever have that unfortunate <br/>\neffect.<br/>\n<br/>\n       Thanks for making the point (you&#39;ve done this before, haven&#39;t you? I <br/>\ncan tell! &lt;bwg&gt;)  <br/>\n<br/>\n       I&#39;ll think about whether I can come up with some help to put the <br/>\nmessage across. I keep forgetting how indoctrinated I was. It&#39;s easy to speak from <br/>\nwhere I am,  not so easy to recapture past mindsets and realities.  JJ<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Learning to see differently","postDate":"1077329819","msgId":91221,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQ3LjNlNTMzM2MuMmQ2ODE5OWJAYW9sLmNvbT4="},"prevInTopic":0,"nextInTopic":91223,"prevInTime":91220,"nextInTime":91222,"topicId":91221,"numMessagesInTopic":0,"msgSnippet":"**yes I recognize that there s much educational content in the shows.** -=-I think it helps not to see it as educational content, because what hes getting","messageBody":"<div id=\"ygrps-yiv-2033764841\">**yes I recognize that there&#39;s much educational content in the shows.** <br/>\n<br/>\n-=-I think it helps not to see it as educational content, because what hes <br/>\ngetting out of it thats important to him very likely doesnt look at all like <br/>\nsomething taught in school. <br/>\n<br/>\n-=-He may be absorbing things about relationships, accents, effective story <br/>\ntelling techniques, the usefulness of color and so on. All those are really <br/>\nfascinating and important to some people and figure largely in the careers they <br/>\nchoose. -=-<br/>\n<br/>\n----------<br/>\n<br/>\nI lifted that from a discussion at www.unschooling.com to bring here because <br/>\nit kind of ties together two things that&#39;ve happened on this list lately, and <br/>\nmight be a missing piece to several people&#39;s puzzles, if not this week, <br/>\nsomeone&#39;s someday.<br/>\n<br/>\nIf people learn to use &quot;learn&quot; instead of &quot;teach,&quot; it helps them move to <br/>\nanother angle, to see things through a different lens.<br/>\n<br/>\nSome people see experienced unschoolers (&quot;experienced&quot; meaning in this <br/>\ncontext people who have done it well and effortlessly for years, who aren&#39;t afraid <br/>\nanymore, who have seen inspiring results) mention classes, and they think &quot;Ah, <br/>\nwell if the experienced unschoolers&#39; kids take classes, then classes are <br/>\ngood/necessary/no problem.&quot;<br/>\n<br/>\nBut if beginners don&#39;t go through a phase in which they REALLY focus on <br/>\nseeing learning outside of academic formalities, they will not be able to see <br/>\naround academics.  If you turn away from the academics and truly, really, calmly <br/>\nand fully believe that there is a world that doesn&#39;t revolve around or even <br/>\nrequire or even benefit from academic traditions, *then* after a while you can see <br/>\nacademics (research into education, or classes, or college) from another <br/>\nperspective.<br/>\n<br/>\nOnce there was heavy fog at our house.  Kirby was four or five.  He had never <br/>\nseen it at all, and this was as thick as I have ever seen fog.   He wanted to <br/>\ngo and touch it.  I yelled &quot;Let&#39;s go!&quot; and we ran up the road, and ran, and <br/>\nran.   About seven houses up we got tired, and I said &quot;Look&quot; and pointed back <br/>\ntoward our house, which was gone in the fog.  <br/>\n<br/>\nI did NOT say &quot;See? You can&#39;t touch it, really, it&#39;s touching us, it&#39;s all <br/>\naround us.&quot;<br/>\nI didn&#39;t say &quot;Let&#39;s don&#39;t bother, it&#39;s just the same wherever in there you <br/>\nare.&quot;<br/>\n<br/>\nI let him experience the fog.  He learned by running in fog and smelling it, <br/>\nand losing his house in it.<br/>\n<br/>\nFor someone who has been out of and away from school for six months to take a <br/>\nclass will not be the same experience as someone (child or parent) who has <br/>\nbeen out and away for eight or ten years.   It will be different in very, very <br/>\nprofound ways.  And &quot;profound&quot; doesn&#39;t show from the house.  You have to run <br/>\nuntil you can&#39;t see the house, and then profundity kicks in.<br/>\n<br/>\nIf anyone who understands what I&#39;m saying can think of another way to say it, <br/>\nhelp would be great.  If anyone doesn&#39;t understand what I&#39;m saying, I <br/>\nrecommend a full break-away from attachment to academics.   <br/>\n<br/>\nThere are several sayings about the journey of a lifetime beginning with a <br/>\nsingle step and such.   One step isn&#39;t the beginning of a journey if you keep <br/>\none foot in the yard.   You have to get away from the starting point completely.<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":8325,"nextTopicId":91288}}