{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Diana Pryntz","from":"&quot;Diana Pryntz&quot; &lt;dpryntz@...","replyTo":"LIST","senderId":"dUPPQP05XEr8FIXs_gLylxUGc6uIdbXqfK3oT3gFvW0D3quX8ms_DYTHM3qMnuWDkdXv-k7uQEORym4GZhndII5Rw9hGi1Fmz8OMyw","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Spirited Children who mimic ADD behaviors","postDate":"934120258","msgId":1795,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4xNDIuMTc5NS45NTkyNjk3NDBAZUdyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":1794,"nextInTime":1796,"topicId":1795,"numMessagesInTopic":0,"msgSnippet":"Hi Unschooling friends. I noticed from those that respond to this list that most of you seem to have young children. My oldest, Avi is almost 12 and he is the","messageBody":"<div id=\"ygrps-yiv-1625313432\">Hi Unschooling friends. I noticed from those that respond to this list that<br/>\nmost of you seem to have young children. My oldest, Avi is almost 12 and he<br/>\nis the one like many of your children - that is very active and fits all 14<br/>\non the ADD list. I also have three other younger kids down to age 3. There<br/>\nis a clear difference between my oldest and the others. It was more subtle<br/>\nwhen they were younger but as they all grow I can tell the differences. From<br/>\nthe time he was born until he was around 9, Avi was constantly on the go. He<br/>\nslept very little compared to other babies and children. He demanded my<br/>\nattention non-stop. He was always getting into things due to his high level<br/>\nof curiosity and impulsiveness. He also got hurt a lot because he would act<br/>\nfirst and think second. Now those characteristics are still basically a part<br/>\nof him but he has ways of calming himself. He reads first thing in the<br/>\nmorning and  right before he goes to sleep. He also reads during the day<br/>\nwhen he wants to calm down. In between he is active. He often involves<br/>\nhimself in building projects with all sorts of materials. At the moment he<br/>\nis building a fort in our yard using saws, hammers, measuring tools, etc. He<br/>\ndoes a lot of physical play with his brothers and he bike rides. In short he<br/>\nis growing up to be a wonderful person who now is able to direct his energy<br/>\nto create new things. He is also able to amuse himself and take care of his<br/>\nbasic needs. I can&#39;t say on the basis of one child that this is the<br/>\ndirection all ADD children head but there is hope down the road for all of<br/>\nyou. My husband also exhibited those behaviors as a child and now also has<br/>\nshort attention span and is easily distracted but as an adult he is very<br/>\nsuccessful professional and is a wonderful father and husband and is highly<br/>\ncreative like our son Avi so I think mothering these type of children is<br/>\nvery very hard when they are young but the rewards later are pay off.</div>","specialLinks":[]}],"prevTopicId":1790,"nextTopicId":1779}}