{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Shannon Nicoletta Manns","from":"&quot;Shannon Nicoletta Manns&quot; &lt;snmanns@...&gt;","replyTo":"LIST","senderId":"Ob8ZzJeOiVI580zuR-YdNCUsxfCvEapxpQm3s5CgycoABWOWenTZhn4_OU2Y-aVdkrQHqNpRdES0C__MWHQ_Wtj1QTcxnZhaNT48FUtDO480nmffnxGn","spamInfo":{"isSpam":false,"reason":"0"},"subject":"The Soul&#39;s Mentor: understanding the spiritual cause and cure of ADHD","postDate":"969024560","msgId":13175,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTUwMWMwMWYxOCRmYjU2N2Y4MCQ0YTY5OWE4ZUBmbWFubnM+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":13174,"nextInTime":13176,"topicId":13175,"numMessagesInTopic":0,"msgSnippet":"The Soul s Mentor understanding the spiritual cause and cure of ADHD The United States uses 90% of the world s supply of Ritalin, a stimulant that affects the","messageBody":"<div id=\"ygrps-yiv-1929958121\">The Soul&#39;s Mentor<br/>\nunderstanding the spiritual cause and cure of ADHD<br/>\n<br/>\nThe United States uses 90% of the world&#39;s supply of Ritalin, a stimulant<br/>\nthat affects the central nervous system the way amphetamines do.<br/>\nUse and production of Ritalin is up by 700% since 1991. Seventy five percent<br/>\nof the drug goes to children.<br/>\nNearly 5 million children and adults are diagnosed with Attention Deficit<br/>\nDisorder (ADD).<br/>\nSome experts say 10% of our kids have it.<br/>\nIf all took Ritalin, 1 in 6 boys ages 5-12 would use the drug.<br/>\n(USA Today, Fall 1998, Lawrence H. Diller, author of Running on Ritalin)<br/>\n<br/>\nAmericans believe drug abuse - more than crime or the breakdown of home<br/>\nlife - is the biggest danger facing children, according to a survey of 1,501<br/>\nadults conducted by Harvard&#39;s School of Public Health and the University of<br/>\nMaryland Survey Research Center. (USA Today, Summer 1998)<br/>\n<br/>\nRecently I was eating lunch with a student here at the College of<br/>\nMetaphysics while my son Hezekiah and his friend Briana were playing five<br/>\nfeet away. Hezekiah, who is almost four years old, was moving his super<br/>\nballs from a basket into a box in order to transport them upstairs. Every<br/>\nonce in a while he would call Briana&#39;s name, compelling her to look and<br/>\neventually inviting her participation.<br/>\n<br/>\nAfter watching him for some time Bill said, &quot;He never stops.&quot;<br/>\n<br/>\n&quot;Rarely,&quot; I replied, &quot;he&#39;s quite something. So quick, so bright, so vital<br/>\nand vibrant.&quot;<br/>\nI went on to tell Bill that if I was twenty years younger, without my<br/>\nmetaphysical background, Hezekiah would probably join the increasing legions<br/>\nof bright but unruly kids being drugged by well-intentioned parents,<br/>\nteachers, and physicians within the next two years.<br/>\n<br/>\nI would be like a growing number of mothers. I would have a profession that<br/>\ndemanded my attention and that a good part of my identity depended upon. I<br/>\nwould have stopped breast feeding by the second month, if tried it at all,<br/>\npartly so I could return to my job. My son would have been cared for, and in<br/>\nlarge part raised by someone else, whether a relative, friend, or employee<br/>\npaid out of the money I made while working elsewhere.<br/>\n<br/>\nI would have believed I was doing the right thing. Providing the best for my<br/>\nchild.<br/>\nI would not know what to do to calm him. I would often find myself too tired<br/>\nto respond well to cries for attention, misinterpreting the plea for love<br/>\nand discipline as something else and thus failing to fulfill my child&#39;s<br/>\nneeds. And my own.<br/>\n<br/>\nAt some point, as early as three, the caregiver might show concern for my<br/>\nson&#39;s disruptiveness, disobedience, or mere absent-mindedness. If I delayed<br/>\nI might find my child refused care or even schooling. I would seek a<br/>\ndoctor&#39;s advice.<br/>\n<br/>\nBeing a good physician, he would tell me that once we start there is no<br/>\nstopping and two to three doses everyday are required. The drug does not<br/>\nheal. Ritalin is thought to increase chemicals in the brain and to simulate<br/>\nthe inhibitory receptors producing the result of a stimulant drug&#39;s acting<br/>\nto increase inhibition. Nobody knows the long term affects but while drugged<br/>\nmy child would be able to focus on what is at hand and learn.<br/>\n<br/>\nEventually I&#39;d give in. Believing I was doing, if not the best for my child,<br/>\nat least what I had to do. His constant energy supply would be chemically<br/>\naltered through daily doses of socially acceptable and even fashionable<br/>\ndrugs.<br/>\n<br/>\nI would lose my son.<br/>\n<br/>\nMore importantly, he would lose himself.<br/>\n<br/>\nYes, he wouldn&#39;t be such a problem for others anymore. Not so demanding. Nor<br/>\nso bright and inventive.<br/>\n<br/>\nThis is not just a hypothetical projection of what could have been in my<br/>\nlife, it is the story of increasing numbers of parents I am meeting and<br/>\ncounseling. Too often we, as a society, look for an easy way out. Pills are<br/>\nseen as an easy way out, just look at the shelves of every pharmacy section<br/>\nin your local market. It is a symptom of denial, stemming from a lack of<br/>\nself discipline. On the whole, Americans don&#39;t know how to discipline<br/>\nthemselves toward positive, productive thinking that leads to health so they<br/>\ndon&#39;t teach this wisdom to their children.<br/>\n<br/>\nThe greater problem we will face ten, twenty, forty years from now. Only<br/>\nthen will we realize, individually and collectively, what we have caused by<br/>\nputting millions of human beings at age 4 or 6 or 8 on a type of &quot;speed&quot;.<br/>\nThe mental, emotional, and physical effects upon that child as he or she<br/>\nenters puberty or when he is 16 or 29 or 42 or 60 will be known only as time<br/>\nprogresses.<br/>\n<br/>\nThis is just the physical perspective. The real problem is once we get there<br/>\nit will be too late to change several generations of drug abuse, intentional<br/>\ndrug addiction. We may never know the losses to individuals or society. We<br/>\nmust change.<br/>\n<br/>\nAttitudinal changes are the hardest. Yet when children are involved mothers<br/>\nand fathers can and have often moved mountains.<br/>\n<br/>\nWhen I identify the significant changes in my thinking that have produced<br/>\nthe conditions in my life that have led me to be a parent, a role by the way<br/>\nthat I did not visualize for myself from the time of puberty until I was 41<br/>\nyears old, I hope there is insight that can help others.<br/>\n<br/>\nFirst realizing I am more than a body. Coming to terms with the difference<br/>\nbetween and separation of mind and body freed me to put the physical world<br/>\nin a more proper perspective. In time what had been important in my mind -<br/>\nsteady relationships, financial security, being needed and valued - was<br/>\nreplaced by a more deep-thinking, spiritually-centered, service-motivated<br/>\nconsciousness. This led to the current conditions in my life, including a<br/>\nwonderful husband who is my life partner and our visionary lifestyle that<br/>\nenables my husband, son and I to live and work together. It also brings some<br/>\nwonderful people into our son&#39;s life. Many teachers, each with different<br/>\nareas of expertise to offer.<br/>\n<br/>\nSecond, taking my next step in understanding myself as a soul. The idea of a<br/>\nsoul is something I was taught as a child, but it was lost in a turbulent<br/>\nadolescent because it was belief based rather than knowing based. Maturing<br/>\nmy idea of soul, bringing it to the here and now rather than leaving it<br/>\nbefore and after birth, caused major shifts in how I see myself and others.<br/>\nThis became very meaningful when I was pregnant. My husband and I<br/>\ncommunicated with the soul who became our son Hezekiah before he entered<br/>\nthis life. By learning his soul needs we could prepare ourselves to respond<br/>\nto them.<br/>\n<br/>\nNow, as he is growing, we can encourage his talents and teach the skills<br/>\nthat will prepare him to meet his destiny. It frees me to learn and teach in<br/>\nways foreign to how I was taught as a child. I can respond to Hezekiah&#39;s<br/>\nintense Michelangelo-scale illustrations of Moses and the Burning Bush which<br/>\npersisted every morning for three months then give way to a month of<br/>\nscientific invention including waterfalls made from suspending a ladle on a<br/>\nfacet spout and tongs used as arm extenders to put superballs in places<br/>\notherwise beyond his reach.<br/>\n<br/>\nThird, learning that thought is cause and developing the will power to apply<br/>\nthe knowledge. Concentration exercises were essential in this process, and<br/>\nare an important part of what my husband and I are teaching our son. The<br/>\ncapacity to focus attention at will directed my creative energies and laid<br/>\nthe foundation for reasoning skills to flourish. I have taught hundreds of<br/>\nadults the basics of how to use mind effectively - undivided attention,<br/>\nremembering, imagination, listening - and it is such a joy to be able to<br/>\nteach them to such a new soul. And quite a challenge for someone accustomed<br/>\nto the civilities of adulthood.<br/>\n<br/>\nAdvanced development in intuition is an enormous asset. Being able to<br/>\nconnect with Hezekiah is essential in him knowing we love him and in<br/>\nteaching meaning behind actions. I have found my own creativity stretched<br/>\nand so in the midst of a &quot;crying jag&quot; I can connect with Hezekiah&#39;s soul,<br/>\n&quot;crying&quot; with him which quickly provokes giggles thus breaking the<br/>\nnonproductive train of thought so a more productive one can be introduced.<br/>\n<br/>\nFourth is acting upon a desire to aid others. Together my husband and I have<br/>\nalmost fifty years of teaching experience. We teach metaphysics,<br/>\nunderstanding the universal laws and truths that govern creation and how to<br/>\nlive in harmony with them. We both know it is the most fulfilling life<br/>\nanyone can hope to have.<br/>\n<br/>\nI have met many people in my life who function under the mistaken belief<br/>\nthat it is easier to teach children than adults. If that is so, we would not<br/>\nbe drugging our brightest children in order to &quot;control&quot; them. We would be<br/>\nteaching them to become the geniuses they are meant to be.<br/>\n<br/>\nTeaching requires a high level of giving. A sacrificing of self for the<br/>\nwelfare of another. I think it is time to redefine what it means to bring a<br/>\nchild into the world. It is time to consider that we are vessels for souls<br/>\nto enter, evolved souls who want to serve even before the body knows how to.<br/>\n<br/>\nHezekiah is such a soul. He is not attention deficit anymore than probably<br/>\n99% of those diagnosed as such. There may be moments when his mom is<br/>\nattention deficit, from being tired or preoccupied thus her mind and body<br/>\nare not in the same place. Hezekiah knows it, every time. And he lets me<br/>\nknow it too, which is becoming a great enrichment in my life for I am able<br/>\nto practice being here now in ways I totally missed before.<br/>\n<br/>\nThere&#39;s nothing wrong with Hezekiah&#39;s attention. Rather his attention is<br/>\nfree, vital, lightning quick, and so very easy to arrest when the mind<br/>\nmeeting his is focused and wizened. I am dedicated to being such a focused,<br/>\nwise mind, for to me I am much more than my child&#39;s parent, I am a soul&#39;s<br/>\nmentor. That is the greatest any of us can ever hope to be.<br/>\n<br/>\nSoul&#39;s Mentor by Dr. Barbara Condron is reprinted with permission from<br/>\nWholistic Health & Healing Guide, Vol. 6, No. 2, copyright 1998 School of<br/>\nMetaphysics</div>","specialLinks":[]}],"prevTopicId":13173,"nextTopicId":13176}}