{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":39764976,"authorName":"Alan & Brenda Leonard","from":"Alan & Brenda Leonard &lt;abtleo@...&gt;","profile":"abtleo","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] homeschool panel","postDate":"1070660799","msgId":17511,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJCRjZCQjA3LjM1MkUlYWJ0bGVvQGVhcnRobGluay5uZXQ+","inReplyToHeader":"PDEwNzA2NTgzNjUuNDM4Ljk4MjQ2Lm0xMkB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":17508,"nextInTopic":0,"prevInTime":17510,"nextInTime":17512,"topicId":17502,"numMessagesInTopic":0,"msgSnippet":"... I agree with you up to here. ... I disagree on this point.  I know it s not the point of what you re trying to say, but I m not game to let it slide by.","messageBody":"<div id=\"ygrps-yiv-1512173381\"><blockquote><span title=\"ireply\">&gt; Hearing someone&#39;s painful experience with trying to control someone else and<br/>\n&gt; how it backfired, creating the exact opposite of the desired result creates<br/>\n&gt; quite an impact <br/>\n<br/>\n </span></blockquote>I agree with you up to here.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; because what Christians are hearing in church is someone<br/>\n&gt; else&#39;s attempt to control them.  They almost NEVER hear a preacher or pastor<br/>\n&gt; tell of his own painful experiences or speak from the heart.<br/>\n<br/>\n </span></blockquote>I disagree on this point.  I know it&#39;s not the point of what you&#39;re trying<br/>\nto say, but I&#39;m not game to let it slide by.  I&#39;ve been to a fair number of<br/>\ndifferent churches in recent years, and I&#39;ve heard a lot of preachers talk<br/>\nabout themselves and their pain and frustrations trying to do what God wants<br/>\nthem to do.  &quot;Never&quot; is an awfully big word, even when talking about<br/>\nChristians.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Preaching is about what to do and what not to do.  In other words, trying<br/>\n&gt; to control the listener.<br/>\n<br/>\n </span></blockquote>Interesting idea.  I guess it doesn&#39;t strike me as controlling because the<br/>\nlistener has a choice whether to do it or not.  If they are coerced, it&#39;s by<br/>\nthe community itself rather than the preacher.  Even then, they have the<br/>\nchoice to leave the community.<br/>\n<br/>\nFor example, a priest may tell Catholics that using birth control is a sin,<br/>\nas good Catholic doctrine says, but a huge percent of Catholics use it<br/>\nanyway.  And I know lots of Southern Baptists that own Disney movies.<br/>\nSchool doesn&#39;t leave kids much of a choice; it has ways of enforcement that<br/>\na preacher doesn&#39;t have.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My teacher told me that I have to trust my kids, because if they realize<br/>\n&gt; they&#39;ve lost my trust, then they&#39;ll have nothing else to lose.<br/>\n<br/>\n </span></blockquote>That&#39;s very powerfully put.  Nice.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But the good news is Christains usually have lots of kids<br/>\n<br/>\n </span></blockquote>Most of the pagans/atheists/pantheists/whatever that I know have more kids<br/>\nthan I do.  (And I go to church with a lot of high-level corporate ex-pats.<br/>\nMany of them have just one kid, too.)<br/>\n<br/>\nRetta, I know what you mean here.  You mean the really conservative,<br/>\nfundamentalist Christian community; the sort of folks who might be coming to<br/>\nthis panel who are rabid school-at-homers.  But they do not solely represent<br/>\n&quot;Christians&quot;, and the use of the word Christian to mean only that can really<br/>\nannoy peole who don&#39;t fit into that slot.  (Yes, me.  But I&#39;ve met others,<br/>\ntoo.  &lt;g&gt;)<br/>\n<br/>\nPerhaps you could define what you mean a little more narrowly.  Unschoolers<br/>\nseem to somehow have this reputation for being anti-Christian, which wasn&#39;t<br/>\nat all true of the unschoolers I&#39;ve met.<br/>\n<br/>\nBrenda</div>","specialLinks":[]},{"userId":73238415,"authorName":"J. Stauffer","from":"&quot;J. Stauffer&quot; &lt;jnjstau@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] RE: homeschool panel","postDate":"1070649664","msgId":17508,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDgwMWMzYmI1ZiQ1NzY1NzUyMCQwYzgwZWU0MEB5b3VybzBrd2t3OWp3Yz4=","referencesHeader":"PDM5LjQxODYwZjNiLjJkMDIyNjVlQGFvbC5jb20+"},"prevInTopic":17506,"nextInTopic":17511,"prevInTime":17507,"nextInTime":17509,"topicId":17502,"numMessagesInTopic":0,"msgSnippet":"More wonderful ideas.  Dh is somewhat concerned about my being on the panel (he thinks he should be the only one to think I m slightly insane ) but I","messageBody":"<div id=\"ygrps-yiv-762445885\">More wonderful ideas.  Dh is somewhat concerned about my being on the panel<br/>\n(he thinks he should be the only one to think I&#39;m slightly insane &lt;grin&gt;)<br/>\nbut I have a month to fiddle with it and get what I want to say just right.<br/>\nI do plan on using my own experiences and a few of these people even know me<br/>\nfrom 4-H stuff and don&#39;t hate me...so I think I&#39;ll be ok.<br/>\n<br/>\nThanks.<br/>\n<br/>\nJulie S.<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message -----<br/>\nFrom: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a>&gt;<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>&gt;<br/>\nSent: Friday, December 05, 2003 12:20 PM<br/>\nSubject: Re: [AlwaysLearning] RE: homeschool panel<br/>\n<br/>\n<br/>\n&gt;<br/>\n&gt; In a message dated 12/5/03 9:44:07 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:rettafontana@...\">rettafontana@...</a> writes:<br/>\n&gt;<br/>\n&gt; &lt;&lt;  You don&#39;t have to be a Christian to quote scripture. &gt;&gt;<br/>\n&gt;<br/>\n&gt; But I&#39;d avoid it, if they&#39;re hostile, as they (at least the Baptists) have<br/>\na<br/>\n&gt; quote about the devil quoting scripture for his own purposes.   It&#39;s used<br/>\nas a<br/>\n&gt; verbal talisman every time a non-Baptist tries a Biblical argument against<br/>\n&gt; them.<br/>\n&gt;<br/>\n&gt; &lt;&lt;They won&#39;t forget you; they&#39;ll want to hear more and they won&#39;t even<br/>\nknow<br/>\n&gt; why.  They&#39;re not really parents, they&#39;re little kids in adult bodies<br/>\n&gt; pretending they know how to do this parenting thing.  Give them the same<br/>\nlove you&#39;d<br/>\n&gt; give an adopted kid - lots of tenderness without condescention.  I&#39;d also<br/>\ngo<br/>\n&gt; prepared with a reference list of book titles, online groups, etc.<br/>\nSomeone will<br/>\n&gt; ask for them.&gt;&gt;<br/>\n&gt;<br/>\n&gt; I agree with that, and even if one person lightens up on kids it will have<br/>\n&gt; been worth it.<br/>\n&gt;<br/>\n&gt; And it might end up being someone who actually snorts or rolls her eyes or<br/>\n&gt; more directly challenges your suggestions.<br/>\n&gt;<br/>\n&gt; Sandra<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; To unsubscribe from this group, send an email to:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning-unsubscribe@yahoogroups.com\">AlwaysLearning-unsubscribe@yahoogroups.com</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Your use of Yahoo! Groups is subject to <a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] RE: homeschool panel","postDate":"1070648414","msgId":17506,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM5LjQxODYwZjNiLjJkMDIyNjVlQGFvbC5jb20+"},"prevInTopic":17502,"nextInTopic":17508,"prevInTime":17505,"nextInTime":17507,"topicId":17502,"numMessagesInTopic":0,"msgSnippet":"In a message dated 12/5/03 9:44:07 AM, rettafontana@yahoo.com writes: ","messageBody":"<div id=\"ygrps-yiv-962378727\">In a message dated 12/5/03 9:44:07 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:rettafontana@...\">rettafontana@...</a> writes:<br/>\n<br/>\n&lt;&lt;  You don&#39;t have to be a Christian to quote scripture. &gt;&gt;<br/>\n<br/>\nBut I&#39;d avoid it, if they&#39;re hostile, as they (at least the Baptists) have a <br/>\nquote about the devil quoting scripture for his own purposes.   It&#39;s used as a <br/>\nverbal talisman every time a non-Baptist tries a Biblical argument against <br/>\nthem.<br/>\n<br/>\n&lt;&lt;They won&#39;t forget you; they&#39;ll want to hear more and they won&#39;t even know <br/>\nwhy.  They&#39;re not really parents, they&#39;re little kids in adult bodies <br/>\npretending they know how to do this parenting thing.  Give them the same love you&#39;d <br/>\ngive an adopted kid - lots of tenderness without condescention.  I&#39;d also go <br/>\nprepared with a reference list of book titles, online groups, etc.  Someone will <br/>\nask for them.&gt;&gt;<br/>\n<br/>\nI agree with that, and even if one person lightens up on kids it will have <br/>\nbeen worth it.<br/>\n<br/>\nAnd it might end up being someone who actually snorts or rolls her eyes or <br/>\nmore directly challenges your suggestions.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":109501676,"authorName":"Retta","from":"Retta &lt;rettafontana@...&gt;","profile":"rettafontana","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: homeschool panel","postDate":"1070642290","msgId":17502,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMxMjA1MTYzODEwLjgzOTYxLnFtYWlsQHdlYjYwNTAzLm1haWwueWFob28uY29tPg=="},"prevInTopic":0,"nextInTopic":17506,"prevInTime":17501,"nextInTime":17503,"topicId":17502,"numMessagesInTopic":0,"msgSnippet":"The art of successful persuasion is like dancing with someone.  You have to meet them where they are on the dance floor, get into their rhythm, then you can","messageBody":"<div id=\"ygrps-yiv-1862465383\">The art of successful persuasion is like dancing with someone.  You have to meet them where they are on the dance floor, get into their rhythm, then you can move around the dance floor and take them where you want to go.  <br/>\n <br/>\nSo the place to start is where you have common ground with these people.  They love their children and want the best for them.  I might explore defining what love is, what learning is, and then contrast that with what control is and what happens in schools.  If they are conscious at all, they will make the connection between what they&#39;re doing at home that is the same thing that&#39;s happening in schools.  Then I&#39;d contrast the outcome of love with the outcome of control.  How control breeds resentment and secrecy and a life-long struggle.  It&#39;s easy, then, to recognize it in ourselves if we&#39;ve been controlled, and realize it&#39;s not what we want for our children.  Controlling children teaches them control, loving them teaches love.  <br/>\n <br/>\nTo introduce love I&#39;d consider Christ as the example of unconditional love.  He hung out with prostitutes and tax collectors (wait, is that redundant?)  He never outlined a plan for education or promoted control in any way, shape or form.  He didn&#39;t torture anyone to do anything and he didn&#39;t come here to start a new religion.  He said things like, &quot;Let he who is without sin cast the first stone&quot; and &quot;get the log out of your own eye before you attempt to get the speck out of your brother&#39;s.&quot;  In other words, checking out what&#39;s in your own heart was the constant theme.  This speaks to them in their own language: the only effective way to speak.  You don&#39;t have to be a Christian to quote scripture.<br/>\n <br/>\nThe most captivating listening happens, I think, when a speaker has the courage to relate their own mistakes and what they learned from them with a totally open heart.  To show that we, like our children can be trusted to be self correcting.   Hearing someone&#39;s painful experience with trying to control someone else and how it backfired, creating the exact opposite of the desired result creates quite an impact because what Christians are hearing in church is someone else&#39;s attempt to control them.  They almost NEVER hear a preacher or pastor tell of his own painful experiences or speak from the heart.  Preaching is about what to do and what not to do.  In other words, trying to control the listener.<br/>\n <br/>\nMy teacher told me that I have to trust my kids, because if they realize they&#39;ve lost my trust, then they&#39;ll have nothing else to lose.  That was the deal maker for me.  I wasn&#39;t trusted and it didn&#39;t come naturally to me.<br/>\n <br/>\nIf you show them that you are trustworthy, that you trust them to be self-correcting as opposed to trying to correct them, that will be a powerful message.  It could very well be the first time in their lives someone trusted them with heart knowledge.  They won&#39;t forget you; they&#39;ll want to hear more and they won&#39;t even know why.  They&#39;re not really parents, they&#39;re little kids in adult bodies pretending they know how to do this parenting thing.  Give them the same love you&#39;d give an adopted kid - lots of tenderness without condescention.  I&#39;d also go prepared with a reference list of book titles, online groups, etc.  Someone will ask for them.<br/>\n <br/>\nMost may not hear you.  They&#39;ll keep doing what they&#39;re doing as long as it seems to work.  But the good news is Christains usually have lots of kids, so one of them is bound to throw a wrench into the &#39;education plan.&#39;   Sooner or later the plan stops working and suffering begins.  When it hurts enough they&#39;ll have the seeds you&#39;ve sown in their hearts and they may seek you out for info, so long as you don&#39;t present any force or attempts to correct them.<br/>\n <br/>\nThis panel invitation presents a real opportunity, as does everything in life, to check out own hearts.<br/>\n <br/>\nLet us know how it goes?<br/>\n <br/>\nRetta<br/>\n <br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt;Subject: Suggestions please?<br/>\n&gt;<br/>\n&gt;I have been asked to sit on a panel for a homeschool support group <br/>\n&gt;meeting.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>---------------------------------<br/>\nDo you Yahoo!?<br/>\nProtect your identity with Yahoo! Mail AddressGuard<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":17505,"nextTopicId":17512}}