{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":18,"messages":[{"userId":8378727,"authorName":"zenmomma2kids","from":"&quot;zenmomma2kids&quot; &lt;zenmomma@...&gt;","profile":"zenmomma2kids","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Unschooling IEP was Re: Response to Ren","postDate":"1071949139","msgId":86470,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJzMjhnaitsMmhpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDExMC4yYzRjN2NkZC4yZDE1ZWUxMkBhb2wuY29tPg=="},"prevInTopic":86467,"nextInTopic":0,"prevInTime":86469,"nextInTime":86471,"topicId":86409,"numMessagesInTopic":0,"msgSnippet":"... be on file if anyone ever questioned us down the road. I called it an independent education program specifically for her, a written plan like a gifted","messageBody":"<div id=\"ygrps-yiv-1537024486\"><blockquote><span title=\"ireply\">&gt;&gt;I wrote something up to send in with our registration, so it would  <br/>\n </span></blockquote>be on file if anyone ever questioned us down the road. I called it an <br/>\n&quot;independent education program&quot; specifically for her, a written plan <br/>\nlike a gifted IEP would be.&gt;&gt;<br/>\n<br/>\nI really like this. I&#39;ve saved it for future reference. Maybe I&#39;ll <br/>\nsend it to Jon&#39;s mother to calm her a bit about her grandson&#39;s lack <br/>\nof education. &lt;g&gt;<br/>\n<br/>\nLife is good.<br/>\n~Mary</div>","specialLinks":[]},{"userId":1160699,"authorName":"Penn Acres","from":"&quot;Penn Acres&quot; &lt;pennacres@...&gt;","profile":"mtnsky2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Response to Ren (was early intervention eval)","postDate":"1071945722","msgId":86467,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMGQwMWMzYzcyOCRmNWZlMmE0MCQzZGUwYjVkMEBHcmFjZVBlbm4+","referencesHeader":"PDExMC4yYzRjN2NkZC4yZDE1ZWUxMkBhb2wuY29tPg=="},"prevInTopic":86466,"nextInTopic":86470,"prevInTime":86466,"nextInTime":86468,"topicId":86409,"numMessagesInTopic":0,"msgSnippet":"Thanks  JJ for this. I save and copy  these examples of  written education plans . I find it very enlightening to see  them written out. They are not required","messageBody":"<div id=\"ygrps-yiv-252088382\">Thanks  JJ for this. I save and copy  these examples of  &quot;written education plans&quot;. I find it very enlightening to see  them written out. They are not required here in BC nor am I ever questioned by anyone  but they certainly  are  interesting for me.<br/>\ngrace<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":7143857,"authorName":"jrossedd@aol.com","from":"jrossedd@...","profile":"jrossedd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Response to Ren (was early intervention eval)","postDate":"1071944722","msgId":86466,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDExMC4yYzRjN2NkZC4yZDE1ZWUxMkBhb2wuY29tPg=="},"prevInTopic":86460,"nextInTopic":86467,"prevInTime":86465,"nextInTime":86467,"topicId":86409,"numMessagesInTopic":0,"msgSnippet":"We registered our home education program for our first child when she was five. Drawing on my ps background to fashion a sort of chain maille of our own , I","messageBody":"<div id=\"ygrps-yiv-1598470679\">We registered our home education program for our first child when she <br/>\nwas five. Drawing on my ps background to fashion a sort of chain maille of our <br/>\nown &lt;g&gt;, I wrote something up to send in with our registration, so it would <br/>\nbe on file if anyone ever questioned us down the road. I called it an <br/>\n&quot;independent education program&quot; specifically for her, a written plan like a gifted IEP <br/>\nwould be. <br/>\n<br/>\n       I wrote it in educationese but very deliberately from the point of <br/>\nview of serving HER -- her individual needs and goals -- rather than of serving <br/>\nthe demands or standards of various curriculum areas like science, math and <br/>\nreading. <br/>\n<br/>\n       This is the big difference in unschooling imo -- it serves the child <br/>\nrather than the child serving it. :)<br/>\n<br/>\n       I wanted to make it clear we knew what we were doing and why, but also <br/>\nto spell out that schoolish things could actually interfere with her learning <br/>\nand thus were purposely being omitted as harmful. We would not be pretending <br/>\nto do these things because we opposed them as not good for her.<br/>\n<br/>\n       So rather than just having no curriculum or plan, here our written <br/>\n&quot;Purpose&quot; for dd&#39;s independent education program (unschooling):<br/>\n<br/>\n       To recognize and encourage the development of her intelligence, <br/>\ncreativity, insight, humor and special aptitudes and interests, while fostering <br/>\nhealthy physical, social and moral growth;<br/>\n<br/>\n       To sustain a flexible, authentic learning environment that fully <br/>\nengages her aptitudes and abilities:<br/>\n<br/>\n       To stimulate and challenge her to construct knowledge for herself, <br/>\nemphasizing inquiry and experimentation, literature and the liberal arts, <br/>\nsymbolism, relationships and the complete range of thinking skills;<br/>\n<br/>\n       To avoid institutional devices such as rigid scheduling, age peer <br/>\nconfinement, basic skills instruction, and remediation;<br/>\n<br/>\n       To free her to embrace her own strengths and to focus on lifelong, <br/>\nself-directed &quot;education for understanding&quot;;<br/>\n<br/>\n       To expand and enrich her educational opportunities in a variety of <br/>\nspecial-interest areas, accessing expertise beyond the regular home-based program <br/>\nto broaden her base of intellectual, emotional, artistic, social and physical <br/>\nexperiences.<br/>\n<br/>\n       (note - this was several years ago. The last bullet was meant for the <br/>\npermanent record that we didn&#39;t want her to just stay home.)<br/>\n<br/>\n       JJ<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"pam sorooshian","from":"pam sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Response to Ren (was early intervention eval)","postDate":"1071938474","msgId":86460,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUzMzAzMEJDLTMzMEItMTFEOC05QUNDLTAwMEE5NUUyOTJDNkBtYWMuY29tPg==","inReplyToHeader":"PDIwMDMxMjIwMTMwNTU0LjQ2NTgxLnFtYWlsQHdlYjEyNjAyLm1haWwueWFob28uY29tPg==","referencesHeader":"PDIwMDMxMjIwMTMwNTU0LjQ2NTgxLnFtYWlsQHdlYjEyNjAyLm1haWwueWFob28uY29tPg=="},"prevInTopic":86457,"nextInTopic":86466,"prevInTime":86459,"nextInTime":86461,"topicId":86409,"numMessagesInTopic":0,"msgSnippet":"... I wouldn t say to social services that we don t use a curriculum - I d present a highly advanced cutting-edge curriculum such as this one: This is an","messageBody":"<div id=\"ygrps-yiv-731747276\">On Dec 20, 2003, at 5:05 AM, Elizabeth Roberts wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; He wasn&#39;t wild about us not using a curriculum, because it makes <br/>\n&gt; things difficult to &quot;prove&quot; things, so I&#39;m keeping a log of the <br/>\n&gt; educational things she does.<br/>\n<br/>\n </span></blockquote>I wouldn&#39;t say to social services that we don&#39;t use a curriculum - I&#39;d <br/>\npresent a highly advanced cutting-edge curriculum such as this one:<br/>\nThis is an elementary Course of Study which is a revision and extension <br/>\nthat I wrote of Carol Narigon&#39;s Unschooling Curriculum combined with <br/>\nstuff based on on the California State Standards and some child <br/>\ndevelopment stuff that I just made up.  There is another document like <br/>\nthis one but for secondary level students, too. Both of these documents <br/>\nare in the files area of this list and anybody can download them and <br/>\nuse them or modify them for their own purposes. They are Word <br/>\ndocuments. Carol&#39;s original unschooling curriculum written for her own <br/>\nfamily, is on Sandra&#39;s website at &lt;sandradodd.com&gt;.<br/>\n<br/>\n~~~~~~~~~~~~~~~~~~~~~~~~~<br/>\n<br/>\n~The World is Our Classroom~<br/>\n<br/>\n~~~~~~~~~~~~~~~~~~~~~~~~~<br/>\n<br/>\nACME Academy<br/>\n<br/>\n<br/>\nCourse of Study<br/>\n<br/>\nElementary Students<br/>\n<br/>\nACME Academy is a private full-time day school established in <br/>\ncompliance with the Education Code of the State of California. Because <br/>\nwe believe that the family is the most fundamental social institution <br/>\nand the preferred means of caring for, preparing, and training children <br/>\nto be productive members of society, ACME Academy promotes and supports <br/>\na family-centered education through our independent study program.<br/>\n<br/>\nAt ACME Academy, independent study, in which children learn primarily <br/>\nunder the immediate direction, guidance, and support of their parents <br/>\nand other caring and involved adults, offers an outstanding educational <br/>\nopportunity by providing a natural learning environment, extensive <br/>\nreal-world experience, flexibility of schedule, and the ability to <br/>\nrespond to the specific needs and inclinations of the child. Each ACME <br/>\nstudent’s program is developmentally appropriate, integrated and fully <br/>\nindividualized, and continually built upon student strengths and <br/>\ninterests throughout the year.<br/>\n<br/>\nEnglish: ACME students will develop knowledge of, and appreciation for <br/>\nliterature and the language, as well as the skills of speaking, <br/>\nreading, listening, spelling, handwriting, and composition.<br/>\n<br/>\nStudents will read from self-chosen or parent-chosen literature on a <br/>\nregular basis and will engage in reflection on those literature pieces <br/>\nin a variety of ways, such as: journal writing, book reviews, <br/>\nconversations, drama based on the books, book clubs. Our educational <br/>\ngoal is for ACME students to read for pleasure, to gain exposure to a <br/>\nwide variety of genres, and to be able to reflect critically on what <br/>\nthey read.<br/>\n<br/>\nStudents will read content-related non-fiction materials to support <br/>\ntheir chosen areas of interest. They will reflect on these pieces in a <br/>\nvariety of ways, such as: journal writing, writing articles for <br/>\nsubmission to magazines or newspapers, discussions, or development of a <br/>\nscrapbook in an area of interest. Our goal is for ACME students to <br/>\nlearn to read critically for information, to understand and be able to <br/>\nreflect on materials read, to be able to compare them to other sources <br/>\nof information, and to learn how and where to find written resources as <br/>\nneeded.<br/>\n<br/>\nWriting, spelling and grammar will be covered as part of ACME students’ <br/>\nnatural writing processes. Students will develop their ability to write <br/>\ncreatively, to write letters and lists, to create and write drama <br/>\npieces, informational essays, persuasive articles, etc. Our goal is for <br/>\nACME students to enjoy writing, to gain expertise in both the writing <br/>\nprocess and in technical writing and editing skills, and to develop a <br/>\nsense of power over the written word<br/>\n<br/>\nScience: ACME students will develop their knowledge of the biological <br/>\nand physical sciences, with emphasis on the processes of experimental <br/>\ninquiry and on the place of humans in ecological systems. They will <br/>\nrelate these to areas of specific student interests by engaging in <br/>\nhands-on activities, watching science videos, reading related written <br/>\nmaterials, conducting scientific experiments, keeping journals, making <br/>\nand recording observations, visiting scientists in their work places, <br/>\nvisiting local science museums, participating in science fairs and <br/>\nworkshops, and through cooperative learning. Our goal is for ACME <br/>\nstudents to experience a wide range of scientific exposure, to develop <br/>\na positive interest in science, to learn to think scientifically, to <br/>\ndevelop a respect for the work scientists do, and to understand the <br/>\nimportance science has in daily life and in the overall environment.<br/>\n<br/>\nSocial Sciences: ACME students will develop their understanding of the <br/>\nsocial sciences and humanities by reading and discussing fiction and <br/>\nnon-fiction materials, participating in field trips to historic and <br/>\npolitically or culturally significant sites, or through discussion and <br/>\ndebate. Anthropology, economics, psychology, geography, history, <br/>\npolitical science, and sociology are fully integrated into the students <br/>\nstudies in a wide variety of ways, such as: the use of time lines and <br/>\nmaps, discussion, journal writing, cooking, plays, road trips, <br/>\ninvention building, field trips, and art. Our goal is for ACME students <br/>\nto develop a foundation for understanding the history, resources, <br/>\ndevelopment, and government of California and the United States of <br/>\nAmerica; the development of the American economic system including the <br/>\nrole of the entrepreneur and labor; the relations of persons to their <br/>\nhuman and natural environment; eastern and western cultures and <br/>\ncivilizations; and contemporary issues including the wise use of <br/>\nnatural resources.<br/>\n <br/>\nHealth and Physical Education: Health and physical education will be <br/>\nfully integrated as a part of daily living skills and participation in <br/>\nthe wider community with an emphasis upon the physical activities that <br/>\nmy be conducive to health and vigor of body and mind. Students will <br/>\nlearn to care for their health and physical environment in a variety of <br/>\nways, such as: shopping for and preparing food, discussing the <br/>\nnecessity of a healthy diet, participation in fire drills and other <br/>\nemergency preparedness activities, exercise both as play and as part of <br/>\na structured group experience and through camping, hiking, and other <br/>\noutdoor activity. Our goal is for ACME students to appreciate the <br/>\nnecessity of a healthy body and to develop lifelong habits of regular <br/>\nexercise and good nutrition.<br/>\n<br/>\nVisual and Performing Arts: ACME students will develop their knowledge <br/>\nof art, music, and drama through informal and structured methods in a <br/>\nvariety of ways, such as: art classes, instrumental lessons, choral <br/>\nsinging, listening to various styles of music, learning about the <br/>\npeople who have influenced music through history, or working on <br/>\nindividualized or group projects that relate to music, art, and drama, <br/>\nincluding acting and performing in a variety of venues and genres. Our <br/>\ngoal is for ACME students to enjoy a wide variety of art, music, and <br/>\ndrama experiences, including performance, while developing an <br/>\nunderstanding and appreciation of the importance of art, music, and <br/>\ndrama as creative expressions of human life experiences.<br/>\n<br/>\nMathematics: ACME students will develop mathematical concepts, <br/>\noperational skills, and problem solving through participation in daily <br/>\nreal-world activities such as cooking, building, shopping, budgeting, <br/>\ncomputing, etc. Mathematics materials will be chosen to support <br/>\nstudents’ individual learning styles in order to achieve competency in <br/>\noperational skills and insight into problem-solving procedures.  Our <br/>\ngoal is for ACME students to gain a strong conceptual knowledge of <br/>\nmathematics as well as an appreciation for the daily applications of <br/>\nmathematics in their lives.<br/>\n<br/>\n<br/>\nPam Sorooshian<br/>\nNational Home Education Network<br/>\n&lt;www.NHEN.org&gt;<br/>\nServing the entire homeschooling community since 1999<br/>\nthrough information, networking and public relations.</div>","specialLinks":[]},{"userId":163750020,"authorName":"tuckervill2@aol.com","from":"tuckervill2@...","profile":"tuckervill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Response to Ren (was early intervention eval)","postDate":"1071935092","msgId":86453,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEwOS4yYWM4Nzg0YS4yZDE1Yzg3NEBhb2wuY29tPg=="},"prevInTopic":86441,"nextInTopic":86457,"prevInTime":86452,"nextInTime":86454,"topicId":86409,"numMessagesInTopic":0,"msgSnippet":"In a message dated 12/20/2003 7:06:32 AM Central Standard Time, mamabethuscg@yahoo.com writes: That s the way he is...he doesn t like crowded situations, loud","messageBody":"<div id=\"ygrps-yiv-1813293071\">In a message dated 12/20/2003 7:06:32 AM Central Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mamabethuscg@...\">mamabethuscg@...</a> writes:<br/>\nThat&#39;s the way he is...he doesn&#39;t like crowded situations, loud noises, or <br/>\npeople in costumes. I don&#39;t blame him really!<br/>\n<br/>\n~~~<br/>\n<br/>\nMy youngest is like that.  At 10  he&#39;s learned a lot of coping mechanisms.  <br/>\nBut one of the best things I&#39;ve ever done for him was invest in a pair of <br/>\nindustrial headphone type hearing protection (huge $12 investment &lt;g&gt;).  <br/>\n<br/>\nI&#39;m reminded of it because he used them again yesterday while he was <br/>\nvacuuming cat litter that he spilled.  I saw him standing there working the vacuum <br/>\nhose with one hand, right ear to shoulder, left hand to left ear (his typical <br/>\nloud noise pose).  I knew he wouldn&#39;t be very efficient and he would tire of it <br/>\nmore quickly like that and there would still be cat litter to be vacuumed when <br/>\nhe was done.  So I went and got the headphones and he ended up doing a perfect <br/>\njob of vacuuming cat litter!  <br/>\n<br/>\nHe was also deathly afraid of clowns from about the age of 6 months, and has <br/>\nnever even stood near a live Santa.  He&#39;s not afraid of clowns anymore, but he <br/>\nwon&#39;t have anything to do with them if they&#39;re around.  He won&#39;t go near <br/>\nSanta because he thinks he&#39;s too old for that!  But we just adapted to his level <br/>\nof tolerance and it just never became an issue.<br/>\n<br/>\nTuck<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":131271049,"authorName":"Susan Gallien","from":"&quot;Susan Gallien&quot; &lt;susan@...&gt;","profile":"susanmarguerite","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] to Mary re: &quot;special needs&quot;","postDate":"1071933936","msgId":86457,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAyMjgwMWMzYzcwZiRiNzA4MzBiMCQ3NWU4YjI0MUBTVUU+","referencesHeader":"PDIwMDMxMjIwMTMxODA4LjQ1NDIucW1haWxAd2ViMTI2MDMubWFpbC55YWhvby5jb20+"},"prevInTopic":86453,"nextInTopic":86460,"prevInTime":86456,"nextInTime":86458,"topicId":86409,"numMessagesInTopic":0,"msgSnippet":"I loved the article on Connor, thanks for sharing it. Sue Gallien The Winona Farm, Minnesota http://thewinonafarm.com [Non-text portions of this message have","messageBody":"<div id=\"ygrps-yiv-1082974199\">I loved the article on Connor, thanks for sharing it.<br/>\n<br/>\n<br/>\nSue Gallien<br/>\nThe Winona Farm, Minnesota<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://thewinonafarm.com\">http://thewinonafarm.com</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":164396504,"authorName":"Elizabeth Roberts","from":"Elizabeth Roberts &lt;mamabethuscg@...&gt;","profile":"mamabethuscg","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Megan&#39;s early intervention eval.","postDate":"1071926501","msgId":86441,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMxMjIwMTMyMTQxLjQ5MjQ2LnFtYWlsQHdlYjEyNjAyLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDAxNDQwMWMzYzY2NCRiMzlkZmE1MCQ5NmU4YjI0MUBTVUU+"},"prevInTopic":86440,"nextInTopic":86453,"prevInTime":86440,"nextInTime":86442,"topicId":86409,"numMessagesInTopic":0,"msgSnippet":"I did that growing up for my younger brother Jeremiah, who is now nearly completely deaf. It was just natural for me to look out for him. I have noticed that","messageBody":"<div id=\"ygrps-yiv-717717690\">I did that growing up for my younger brother Jeremiah, who is now nearly completely deaf. It was just natural for me to look out for him. I have noticed that Logan will do this for Megan. They are only 15 months apart in age, and are often thought to be fraternal twins. <br/>\n <br/>\nMamaBeth<br/>\n<br/>\nSusan Gallien &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:susan@...\">susan@...</a>&gt; wrote:<br/>\nI think sisters are often a cause of the perceived &quot;problem&quot;, all the time that Evan wasn&#39;t talking, Lisa [who is two years older than him] was interpreting all of his gestures and sounds with what appeared to be close to 100% accuracy, so he didn&#39;t really need to talk. <br/>\n<br/>\nSue Gallien<br/>\nThe Winona Farm, Minnesota<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://thewinonafarm.com\">http://thewinonafarm.com</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;His biggest disadvantage was having a verbal, bubbly, non-stop-<br/>\n </span></blockquote>  talking twin sister.&gt;&gt;<br/>\n<br/>\n  Darn those sisters!! &lt;g&gt;<br/>\n<br/>\n  Life is good.<br/>\n  ~Mary<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n&quot;List Posting Policies&quot; are provided in the files area of this group. <br/>\n<br/>\nTo unsubscribe from this send an email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a> <br/>\n<br/>\nVisit the Unschooling website and message boards: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> <br/>\n<br/>\n<br/>\n<br/>\n---------------------------------<br/>\nYahoo! Groups Links<br/>\n<br/>\n   To visit your group on the web, go to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/UnschoolingDiscussion/\">http://groups.yahoo.com/group/UnschoolingDiscussion/</a><br/>\n  <br/>\n   To unsubscribe from this group, send an email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a><br/>\n  <br/>\n   Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\nEverything I need to know, I learned on my own!<br/>\n<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\nNew Yahoo! Photos - easier uploading and sharing<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":164396504,"authorName":"Elizabeth Roberts","from":"Elizabeth Roberts &lt;mamabethuscg@...&gt;","profile":"mamabethuscg","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"to Mary re: &quot;special needs&quot;","postDate":"1071926288","msgId":86440,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMxMjIwMTMxODA4LjQ1NDIucW1haWxAd2ViMTI2MDMubWFpbC55YWhvby5jb20+","inReplyToHeader":"PGJydmQ0ZytyMXE4QGVHcm91cHMuY29tPg=="},"prevInTopic":86439,"nextInTopic":86441,"prevInTime":86439,"nextInTime":86441,"topicId":86409,"numMessagesInTopic":0,"msgSnippet":"I read your article about Conor. Thanks! I have really had to fight thinking about my oldest in terms of her ADHD label from the school system and recognize","messageBody":"<div id=\"ygrps-yiv-1683341762\">I read your article about Conor. Thanks! I have really had to fight thinking about my oldest in terms of her &quot;ADHD&quot; label from the school system and recognize her as she is. LOL I&#39;m getting better...my friend&#39;s two oldest children keep bringing up somthing that happened about a week and a half ago. <br/>\n<br/>\nSarah got dressed for church in jeans and a tank top, and threw on a jacket over it. We got to church, and she hung up her jacket. The girls FREAKED &quot;OMG, Miss Beth, Sarah&#39;s wearing a TANK TOP in the winter and there&#39;s snow outside and isn&#39;t she cold?!&quot; I looked over at my daughter, standing there with this look on her face like &quot;Am I trouble now?! What&#39;d I do?!&quot; and I just smiled at her, and said &quot;So what?&quot; to the girls. They spit and sputtered and I just said &quot;Sarah is Sarah. If she is fine in a tank top, that&#39;s her choice. If she gets cold she&#39;ll put on her jacket. I&#39;m not worried about it.&quot; I make warm clothes available to her. I&#39;m not going to make an issue out of it if she chooses to wear something else. <br/>\n<br/>\nEspecially when I&#39;d do the same, and have! I wouldn&#39;t want to wear a bulky, heavy sweater under a bulky winter coat either. <br/>\n<br/>\nBut still in the back of my mind is this label they&#39;ve given Sarah...it&#39;s quieter now than it used to be...<br/>\n<br/>\nMamaBeth<br/>\n<br/>\n<br/>\n<br/>\nEverything I need to know, I learned on my own!<br/>\n<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\nNew Yahoo! Photos - easier uploading and sharing<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":164396504,"authorName":"Elizabeth Roberts","from":"Elizabeth Roberts &lt;mamabethuscg@...&gt;","profile":"mamabethuscg","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Response to Ren (was early intervention eval)","postDate":"1071925554","msgId":86439,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMxMjIwMTMwNTU0LjQ2NTgxLnFtYWlsQHdlYjEyNjAyLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDIwMDMxMjE5LjA3MjA0Mi40OTAuNTQ1ODA2QHdlYm1haWwyNS5ueWMudW50ZC5jb20+"},"prevInTopic":86430,"nextInTopic":86440,"prevInTime":86438,"nextInTime":86440,"topicId":86409,"numMessagesInTopic":0,"msgSnippet":"Ren, I don t really see Megan as being any different, she s still herself. The delays may have been there regardless of anything we could have done differently","messageBody":"<div id=\"ygrps-yiv-1880766908\">Ren,<br/>\n <br/>\nI don&#39;t really see Megan as being any different, she&#39;s still herself. The delays may have been there regardless of anything we could have done differently in the past year. <br/>\n <br/>\nLast night, we went to a Christmas party being thrown by the local WIC office. My oldest found a girl she knows from Brownies and went off to play with her. My son doesn&#39;t care for parties, and was terrified of Santa. That&#39;s the way he is...he doesn&#39;t like crowded situations, loud noises, or people in costumes. I don&#39;t blame him really! He stayed by me, and we really got a kick out of watching Megan who seemed to totally be in her element. She waited pretty patiently in line for a two year old I think, then went straight to Santa. She sat on his lap, looked him over VERY careful, touching his sleeve and his beard and poking his nose. Then she smiled really wide and gave him a big hug. She got down, went over to &quot;Mother Goose&quot; (a lady who told nursery rhymes and played her acoustic guitar, both Chistmas and toddler-type songs), and she just ran back and forth between Santa and the other children. <br/>\n <br/>\nIt&#39;s been quite awhile since she&#39;s been anywhere with more than just a handful of children, so I wasn&#39;t sure how she&#39;d do. She went over to MG and sat right down with the other kids. She played &quot;Where is Thumbkin&quot; and then signed &quot;More&quot; and waved her hands as they do in the song with the line about &quot;Family&quot; (we&#39;d begun teaching her a few signs because of her not speaking). <br/>\n <br/>\nShe danced and played, and kept finding little ones just learning to walk and she&#39;d hold out her hand to them and walk with them; if she saw any child upset, she&#39;d walk over and hug them. <br/>\n <br/>\nI watched her through all this, and I didn&#39;t think one second about her &quot;developmental delays&quot; but rather &quot;Wow, what a sweet child I have.&quot; <br/>\n <br/>\nAbout our family...maybe all of this lately has been God trying to show us where we need to get things together. We&#39;ve been paying attention, and things are getting better lately. Like I said before, I&#39;m not perfect and I&#39;m not unwilling to admit when I&#39;m wrong. Yes, things were pretty much &quot;just fine&quot; but in some ways (spanking) they weren&#39;t; and was &quot;just fine&quot; what we really want things to be - are we being truthful about the way things go - and if not, what needs to change and how? <br/>\n <br/>\nWe&#39;re getting there. I have spoken with a lawyer about DSS, and his advice was to play it cool and work with DSS, use it as an opportunity to scrutinize our lives and really see if changes could be made for the better and make any changes. Going up against this doctor could ruin us as a family, he said, because of the way we&#39;re &quot;transient&quot; (military)and she&#39;s &quot;well established&quot; and &quot;considered the BEST pediatrician between Provincetown and Boston;&quot; regardless of how many people know me and the children and know how well I truly do interact with them. But to use this as an opportunity to take the good things about our family and strengthen them, would be the best &quot;revenge.&quot; <br/>\n <br/>\nSpecifically in regards to the homeschooling, he said to continue as we feel is best; we are the parents, and have the right to make the decisions for our children&#39;s educations. He wasn&#39;t wild about us not using a curriculum, because it makes things difficult to &quot;prove&quot; things, so I&#39;m keeping a log of the educational things she does. <br/>\n <br/>\nMamaBeth<br/>\n<br/>\n<br/>\n<br/>\nEverything I need to know, I learned on my own!<br/>\n<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\nNew Yahoo! Photos - easier uploading and sharing<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":129679134,"authorName":"Tia Leschke","from":"Tia Leschke &lt;leschke@...&gt;","profile":"leschke2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Megan&#39;s early intervention  eval.","postDate":"1071892013","msgId":86430,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYuMC4wLjIyLjAuMjAwMzEyMTkxOTQ1NTkuMDI1YTkzYzBAc2hhd21haWwuZ3Yuc2hhd2NhYmxlLm5ldD4=","inReplyToHeader":"PGJydmk1cStsc3U4QGVHcm91cHMuY29tPg==","referencesHeader":"PDFlMy4xNWY3OWNjZC4yZDE0OTk3ZEBhb2wuY29tPiA8YnJ2aTVxK2xzdThAZUdyb3Vwcy5jb20+"},"prevInTopic":86419,"nextInTopic":86439,"prevInTime":86429,"nextInTime":86431,"topicId":86409,"numMessagesInTopic":0,"msgSnippet":"... I do that, and more often because I don t understand adults.  My hearing is really terrible when there s noise around me. Tia","messageBody":"<div id=\"ygrps-yiv-1523994031\"><blockquote><span title=\"ireply\">&gt;I held my breath and looked at<br/>\n&gt;the man, who obviously didn&#39;t have a clue what he said because he did<br/>\n&gt;the &quot;Oh, yeah&quot;, smiling and shaking his head thing that people do<br/>\n&gt;when they don&#39;t understand little kids! lol<br/>\n<br/>\n </span></blockquote>I do that, and more often because I don&#39;t understand adults. &lt;g&gt; My hearing <br/>\nis really terrible when there&#39;s noise around me.<br/>\nTia</div>","specialLinks":[]},{"userId":131271049,"authorName":"Susan Gallien","from":"&quot;Susan Gallien&quot; &lt;susan@...&gt;","profile":"susanmarguerite","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Megan&#39;s early intervention eval.","postDate":"1071861428","msgId":86419,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxNDQwMWMzYzY2NCRiMzlkZmE1MCQ5NmU4YjI0MUBTVUU+","referencesHeader":"PGJydmZ1aSszZW9xQGVHcm91cHMuY29tPg=="},"prevInTopic":86418,"nextInTopic":86430,"prevInTime":86418,"nextInTime":86420,"topicId":86409,"numMessagesInTopic":0,"msgSnippet":"I think sisters are often a cause of the perceived problem , all the time that Evan wasn t talking, Lisa [who is two years older than him] was interpreting","messageBody":"<div id=\"ygrps-yiv-1073874891\">I think sisters are often a cause of the perceived &quot;problem&quot;, all the time that Evan wasn&#39;t talking, Lisa [who is two years older than him] was interpreting all of his gestures and sounds with what appeared to be close to 100% accuracy, so he didn&#39;t really need to talk. <br/>\n<br/>\nSue Gallien<br/>\nThe Winona Farm, Minnesota<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://thewinonafarm.com\">http://thewinonafarm.com</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;His biggest disadvantage was having a verbal, bubbly, non-stop-<br/>\n </span></blockquote>  talking twin sister.&gt;&gt;<br/>\n<br/>\n  Darn those sisters!! &lt;g&gt;<br/>\n<br/>\n  Life is good.<br/>\n  ~Mary<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1352017,"authorName":"kayb85","from":"&quot;kayb85&quot; &lt;sheran@...&gt;","profile":"kayb85","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Megan&#39;s early intervention eval.","postDate":"1071860730","msgId":86418,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJydmk1cStsc3U4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDFlMy4xNWY3OWNjZC4yZDE0OTk3ZEBhb2wuY29tPg=="},"prevInTopic":86415,"nextInTopic":86419,"prevInTime":86417,"nextInTime":86419,"topicId":86409,"numMessagesInTopic":0,"msgSnippet":"My son Luke is 4 1/2 and has a wonderful vocabulary.  Problem is, people outside of our immediate family can rarely understand him. I m always translating what","messageBody":"<div id=\"ygrps-yiv-61991491\">My son Luke is 4 1/2 and has a wonderful vocabulary.  Problem is, <br/>\npeople outside of our immediate family can rarely understand him.  <br/>\nI&#39;m always translating what he says.  He is improving, slowly.  He <br/>\nused to repeat the first sound of every sentence he said &quot;Like Like <br/>\nLike Like Like this&quot;.  Now he doesn&#39;t do that anymore.  I am having <br/>\nhim treated homeopathically and the remedy he&#39;s on is one that people <br/>\nwho have unclear speech often need.  <br/>\n<br/>\nThis is the same child who still uses his pronouns incorrectly.  <br/>\n<br/>\nI&#39;m glad that my he&#39;s not my oldest, because I used to be all school <br/>\nat homey and probably would have had him enrolled in speech therapy <br/>\nclasses.  <br/>\n<br/>\nSometimes he&#39;s so outspoken that his speech is a blessing. ;)  Once <br/>\nwe were at a museum and the museum guide was really talking down to <br/>\nmy kids (You know how sometimes older people talk to little kids as <br/>\nif they&#39;re idiots? My kids hate that.)  Well, Luke piped up with &quot;Us <br/>\nknows how to do it, you stupid man&quot;.  I held my breath and looked at <br/>\nthe man, who obviously didn&#39;t have a clue what he said because he did <br/>\nthe &quot;Oh, yeah&quot;, smiling and shaking his head thing that people do <br/>\nwhen they don&#39;t understand little kids! lol  <br/>\n<br/>\nSheila<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, SandraDodd@a... wrote:<br/>\n&gt; Our friend Liam is 19 now.   He could hardly speak when he was <br/>\nfour.  He <br/>\n&gt; understood fine, he just didn&#39;t talk.   When he could talk it was <br/>\nhard to <br/>\n&gt; understand him for a few years.<br/>\n&gt; <br/>\n&gt; Liam didn&#39;t read until he was in his mid teens.<br/>\n&gt; <br/>\n&gt; Now you wouldn&#39;t guess at either one.<br/>\n&gt; <br/>\n&gt; If he had been in school, he would&#39;ve been slammed into special ed <br/>\nhell.<br/>\n&gt; He wasn&#39;t in school.<br/>\n&gt; <br/>\n&gt; He was just Liam. <br/>\n&gt; <br/>\n&gt; His biggest disadvantage was having a verbal, bubbly, non-stop-<br/>\ntalking twin <br/>\n&gt; sister.<br/>\n&gt; <br/>\n&gt; Sandra </span></blockquote></div>","specialLinks":[]},{"userId":123374705,"authorName":"ejcrewe@aol.com","from":"ejcrewe@...","profile":"ejcrewe2002","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Megan&#39;s early intervention eval.","postDate":"1071858740","msgId":86415,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFjZi4xNjcyODEzZi4yZDE0OWUzNEBhb2wuY29tPg=="},"prevInTopic":86414,"nextInTopic":86418,"prevInTime":86414,"nextInTime":86416,"topicId":86409,"numMessagesInTopic":0,"msgSnippet":"In a message dated 12/19/2003 11:12:22 AM Central Standard Time, ... I agree.  My son had a speach delay and we went the route of therapy for him.  I don t","messageBody":"<div id=\"ygrps-yiv-504840502\">In a message dated 12/19/2003 11:12:22 AM Central Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:susan@...\">susan@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Relax, two is very young to be overly concerned, especially since you <br/>\n&gt; mention that her &quot;speech is blossoming&quot;.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I agree.  My son had a speach &quot;delay&quot; and we went the route of therapy for <br/>\nhim.  I don&#39;t think it helped him, but I don&#39;t really regret it either because <br/>\nthey had some really great toys for him to play with.  I think he had to talk <br/>\non his own time schedule, not some chart&#39;s.  At 2 years, 2 months he tested at <br/>\nthe 15 month level and at three years he tested at the 4 year plus level.  <br/>\nWhatever that means to the makers of the charts and tests, it just meant to us <br/>\nthat he decided to talk.  Oh, and his year younger sister would often answer the <br/>\ntherapists questions for him while he was busy putting together puzzles they <br/>\nlaid out in front of him.<br/>\n<br/>\nHis memory of therapy at age five?  Learning the Five Green and Speckled <br/>\nFrogs song from Suzi (therapist), Suzi had the best toys and how shocked everyone <br/>\nwas when he played with the boggle junior came and said, clearly, &quot;C A T, that <br/>\nspells cat.&quot;  He thinks that&#39;s funny.  He still doesn&#39;t spontaneously spell <br/>\ncat or read cat, but he figured out what the game was trying to do and thought <br/>\nhe&#39;d let everyone know.<br/>\n<br/>\nMy advice is to relax.  Talk a lot to your children, assume they know what <br/>\nyou are saying (they do) and could talk back if they wanted.  My worst days were <br/>\nthe ones where I fretted over his speech or, worse, got mad about it.  My <br/>\nbest days were listening to him use his own words, or half words, to communicate <br/>\nand celebrating his advancement.  My best and worst days are defined the same <br/>\nway still, I guess, just in terms of different worries...<br/>\n<br/>\nOH, and Einstein didn&#39;t talk until four or five, as I remember.  Didn&#39;t utter <br/>\na word.  <br/>\n<br/>\nElizabeth in IL<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":8378727,"authorName":"zenmomma2kids","from":"&quot;zenmomma2kids&quot; &lt;zenmomma@...&gt;","profile":"zenmomma2kids","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Megan&#39;s early intervention eval.","postDate":"1071858450","msgId":86414,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJydmZ1aSszZW9xQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDFlMy4xNWY3OWNjZC4yZDE0OTk3ZEBhb2wuY29tPg=="},"prevInTopic":86413,"nextInTopic":86415,"prevInTime":86413,"nextInTime":86415,"topicId":86409,"numMessagesInTopic":0,"msgSnippet":"... talking twin sister. Darn those sisters!!  Life is good. ~Mary","messageBody":"<div id=\"ygrps-yiv-420705265\"><blockquote><span title=\"ireply\">&gt;&gt;His biggest disadvantage was having a verbal, bubbly, non-stop-<br/>\n </span></blockquote>talking twin sister.&gt;&gt;<br/>\n<br/>\nDarn those sisters!! &lt;g&gt;<br/>\n<br/>\nLife is good.<br/>\n~Mary</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Megan&#39;s early intervention eval.","postDate":"1071857533","msgId":86413,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFlMy4xNWY3OWNjZC4yZDE0OTk3ZEBhb2wuY29tPg=="},"prevInTopic":86412,"nextInTopic":86414,"prevInTime":86412,"nextInTime":86414,"topicId":86409,"numMessagesInTopic":0,"msgSnippet":"Our friend Liam is 19 now.   He could hardly speak when he was four.  He understood fine, he just didn t talk.   When he could talk it was hard to understand","messageBody":"<div id=\"ygrps-yiv-1187572372\">Our friend Liam is 19 now.   He could hardly speak when he was four.  He <br/>\nunderstood fine, he just didn&#39;t talk.   When he could talk it was hard to <br/>\nunderstand him for a few years.<br/>\n<br/>\nLiam didn&#39;t read until he was in his mid teens.<br/>\n<br/>\nNow you wouldn&#39;t guess at either one.<br/>\n<br/>\nIf he had been in school, he would&#39;ve been slammed into special ed hell.<br/>\nHe wasn&#39;t in school.<br/>\n<br/>\nHe was just Liam. <br/>\n<br/>\nHis biggest disadvantage was having a verbal, bubbly, non-stop-talking twin <br/>\nsister.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":8378727,"authorName":"zenmomma2kids","from":"&quot;zenmomma2kids&quot; &lt;zenmomma@...&gt;","profile":"zenmomma2kids","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Megan&#39;s early intervention eval.","postDate":"1071855568","msgId":86412,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJydmQ0ZytyMXE4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwMGQwMWMzYzY1MCQ4NjQ1YTNhMCQ5NmU4YjI0MUBTVUU+"},"prevInTopic":86410,"nextInTopic":86413,"prevInTime":86411,"nextInTime":86413,"topicId":86409,"numMessagesInTopic":0,"msgSnippet":"... skills, so what could the problem be?  I m pretty sure Einstein didn t start talking until about age 5. Maybe it s no problem at all.  I wrote an","messageBody":"<div id=\"ygrps-yiv-900052277\"><blockquote><span title=\"ireply\">&gt;&gt;So he could hear and he had a well functioning brain and cognitive <br/>\n </span></blockquote>skills, so what could the problem be? &gt;&gt;<br/>\n<br/>\nI&#39;m pretty sure Einstein didn&#39;t start talking until about age 5. <br/>\nMaybe it&#39;s no problem at all. &lt;g&gt;<br/>\n<br/>\nI wrote an article about Conor and the testing that showed so many <br/>\nthings &quot;wrong&quot; with him. You can see it here: <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/special/mary\">http://sandradodd.com/special/mary</a><br/>\n<br/>\nTurns out he was just Conor and still is. <br/>\n<br/>\nLife is good.<br/>\n~Mary</div>","specialLinks":[]},{"userId":131271049,"authorName":"Susan Gallien","from":"&quot;Susan Gallien&quot; &lt;susan@...&gt;","profile":"susanmarguerite","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Megan&#39;s early intervention eval.","postDate":"1071852762","msgId":86410,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMGQwMWMzYzY1MCQ4NjQ1YTNhMCQ5NmU4YjI0MUBTVUU+","referencesHeader":"PDIwMDMxMjE5LjA3MjA0Mi40OTAuNTQ1ODA2QHdlYm1haWwyNS5ueWMudW50ZC5jb20+"},"prevInTopic":86409,"nextInTopic":86412,"prevInTime":86409,"nextInTime":86411,"topicId":86409,"numMessagesInTopic":0,"msgSnippet":"Don t feel badly about Megan, my son Evan [now aged 28 and very verbal] had a very limited vocabulary at age three, I was so concerned myself that I had taken","messageBody":"<div id=\"ygrps-yiv-185867993\">Don&#39;t feel badly about Megan, my son Evan [now aged 28 and very verbal] had a very limited vocabulary at age three, I was so concerned myself that I had taken him for hearing tests believing that he may be deaf.  His hearing test came back perfect, and still at three he could only say about thirty words, so his IQ was evaluated and that put him at about 130.  So he could hear and he had a well functioning brain and cognitive skills, so what could the problem be?   <br/>\n<br/>\nWell 25 years later I still don&#39;t know, he had speech therapy which I believe was mostly a waste of time, I&#39;ll never forget his little brother aged 2 helping him with his pronunciation.    <br/>\n<br/>\nRelax, two is very young to be overly concerned, especially since you mention that her &quot;speech is blossoming&quot;.<br/>\n<br/>\nSue Gallien<br/>\nThe Winona Farm, Minnesota<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://thewinonafarm.com\">http://thewinonafarm.com</a><br/>\n<br/>\n<br/>\n<br/>\n  &quot;I am feeling like such a horrible mother right now. Megan was just evaluated<br/>\n   this morning by the Early Intervention Team. We were worried about her speech,<br/>\n   she had basically no words until the end of August (turned 2 on August 3), but<br/>\n   her speech is blossoming since then, but it still isn&#39;t that<br/>\n   clear...understandable, but not clear.&quot;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":150527288,"authorName":"Ren","from":"Ren &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Megan&#39;s early intervention eval.","postDate":"1071847228","msgId":86409,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMxMjE5LjA3MjA0Mi40OTAuNTQ1ODA2QHdlYm1haWwyNS5ueWMudW50ZC5jb20+"},"prevInTopic":0,"nextInTopic":86410,"prevInTime":86408,"nextInTime":86410,"topicId":86409,"numMessagesInTopic":0,"msgSnippet":"I am feeling like such a horrible mother right now. Megan was just evaluated this morning by the Early Intervention Team. We were worried about her speech, ","messageBody":"<div id=\"ygrps-yiv-677848840\">&quot;I am feeling like such a horrible mother right now. Megan was just evaluated<br/>\n this morning by the Early Intervention Team. We were worried about her speech,<br/>\n she had basically no words until the end of August (turned 2 on August 3), but<br/>\n her speech is blossoming since then, but it still isn&#39;t that<br/>\n clear...understandable, but not clear.&quot;<br/>\n<br/>\nWhen I feel badly about something, I examine it carefully. Guilt can be a very good teacher...IF (and only if) we learn what it needed us to learn and let the guilt go.<br/>\nThe fact that she isn&#39;t speaking much would not concern me a bit.<br/>\nMy Jalen didn&#39;t speak more than single (very unclear) words until the last few months and he&#39;s going to be three in Feb. I can see that he is a very intelligent, capable human being. He will talk when/where and if the need arises. He&#39;s barely able to put three words together at the prompting of his siblings (they find his gibberish highly amusing) but uses two words a lot now. He is not delayed. He is Jalen. Learning what he needs, when he needs it. And he has the all important &quot;na na&quot; word down, what else does he need!!?:) (that&#39;s his word for nursing)<br/>\n<br/>\nI wish you hadn&#39;t had Megan tested...I realize you may not have had a choice, but it just makes you see your child differently and doesn&#39;t help them in any way.<br/>\nIt sounds like you have a lot of issues going on in your family right now. I would read a lot of unschooling and gentle parenting books to see if there are areas you could strengthen in your interactions with the children. Beyond that, I think it&#39;s time to get a lawyer if homeschooling is going to continue and you want to get social services out of the picture.<br/>\nIt does concern me that there was spanking and such an issue at the doctors office that she felt she needed to call outside help in. I don&#39;t think that kind of interaction with your children will help unschooling blossom at all. Have you read &quot;Whole child, whole parent&quot;? An excellent book for any parent, but especially if you&#39;re looking to make changes.<br/>\nIt&#39;s obvious you love your children a lot. Either there is truth to what these people are saying or there isn&#39;t. If not, then stand up for yourself and take a course of action to end all the intrusion. I wish I could give really great advice about how to go about this, but I&#39;m afraid I don&#39;t. I do think you need to know your legal rights though.<br/>\n<br/>\nRen</div>","specialLinks":[]}],"prevTopicId":86468,"nextTopicId":86472}}