{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: fun at home was online games for girls","postDate":"1315925851","msgId":62877,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ1RDg5RTUzLTJCODEtNDBDMS04MjFFLUZCRTg3OEI5ODc1NkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PEJMVTAtU01UUDkyRUJFMUQ3MjBDMTZFRjkyRjUzRDhEMDA1MEBwaHguZ2JsPg==","referencesHeader":"PEJMVTAtU01UUDkyRUJFMUQ3MjBDMTZFRjkyRjUzRDhEMDA1MEBwaHguZ2JsPg=="},"prevInTopic":62876,"nextInTopic":0,"prevInTime":62876,"nextInTime":62878,"topicId":62876,"numMessagesInTopic":0,"msgSnippet":"... I d say yes and no. Boredom can come from living in an environment where there s little to do. Boredom can come from living in a full environment that","messageBody":"<div id=\"ygrps-yiv-2118601246\">On Sep 13, 2011, at 6:51 AM, Fatim Walji wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I thought boredom is an emotional state that has nothing to do with  <br/>\n&gt; how interesting the home is.<br/>\n<br/>\n </span></blockquote>I&#39;d say yes and no.<br/>\n<br/>\nBoredom can come from living in an environment where there&#39;s little to  <br/>\ndo.<br/>\n<br/>\nBoredom can come from living in a full environment that doesn&#39;t match  <br/>\na particular person&#39;s interests. (Like a pink princess loving girl  <br/>\nliving with black leather Harley enthusiasts ;-)<br/>\n<br/>\nBoredom can come from reaching the end of the high of exploring  <br/>\nsomething interesting and nothing around is sparking an interest.<br/>\n<br/>\n&quot;Interesting&quot; is a relative term. It&#39;s not whether you find the  <br/>\nenvironment interesting but whether it sparks something in her.<br/>\n<br/>\nSparking her will come from getting to know her, getting a feel for  <br/>\nwho she is. It will come from being interested yourself in life. Being  <br/>\naround enthusiastic people can be inspiring. But the enthusiasm needs  <br/>\nto be natural and not about trying to change her. It will feel like a  <br/>\nsong and dance if you&#39;re trying to get her interested rather than  <br/>\nbeing interested in life.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It seems no matter what I do, I can not beat three recess a day.<br/>\n<br/>\n </span></blockquote>I&#39;m thinking you can&#39;t beat free playing with other kids. No matter  <br/>\nhow climbable the trees, they won&#39;t substitute for someone who loves  <br/>\ngetting lost in books. Or vice versa.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; That was so not an issue for me but it really messed up my daughter  <br/>\n&gt; she was not herself all day. After that she still wanted to try the  <br/>\n&gt; public school and we went and got the forms.<br/>\n<br/>\n </span></blockquote>Because she trusts that others know more about what&#39;s necessary to  <br/>\nlearn than you do.<br/>\n<br/>\nPartly you may lack confidence. Partly you may have been blind sided  <br/>\nby the &quot;necessity&quot; of the reading level rather than a &quot;Well! That&#39;s  <br/>\nannoying! We need to find a better approach!&quot; Partly because kids are  <br/>\nimmersed in a society that is absolutely positive school is necessary.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Well she starting school on Wednesday and now everyone wants to go  <br/>\n&gt; to school. I have been reading the school choice page and trying to  <br/>\n&gt; deal with it. I have commited to a homeschool group this year and  <br/>\n&gt; have organised many trips. I am not sure what to do with all that now.<br/>\n<br/>\n<br/>\n </span></blockquote>This sounds like giving up and is probably projected for your kids.<br/>\n<br/>\nYou can&#39;t change them or their desire to go to school. You can change  <br/>\nyour outlook about their choice. If you wanted them to snuggle up  <br/>\nquietly with you and read a book together and they wanted to go play  <br/>\nwith friends, it would be hard not to project that disappointment onto  <br/>\ntheir choice.<br/>\n<br/>\nIf, instead, you look at their needs and wants, their choices, trust  <br/>\nin them to explore and discover what they like and don&#39;t like, it will  <br/>\nbe easier to support their choices even if you don&#39;t like the choices.<br/>\n<br/>\nThen make after school a sparkly time to depressurize and reconnect.  <br/>\nThat will be the most important thing they need. Depressurize.  <br/>\nReconnect. And make home a haven they want to come to.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":316160044,"authorName":"Fatim Walji","from":"Fatim Walji &lt;waljif@...&gt;","profile":"waljif","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: fun at home was online games for girls","postDate":"1315911096","msgId":62876,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJMVTAtU01UUDkyRUJFMUQ3MjBDMTZFRjkyRjUzRDhEMDA1MEBwaHguZ2JsPg=="},"prevInTopic":0,"nextInTopic":62877,"prevInTime":62875,"nextInTime":62877,"topicId":62876,"numMessagesInTopic":0,"msgSnippet":"Thank you everyone for your replies.  We are going through the list of all the websites.  We try to do it together since she does not read yet and has hard","messageBody":"<div id=\"ygrps-yiv-1294362251\">Thank you everyone for your replies.  We are going through the list of all the websites.  We try to do it together since she does not read yet and has hard time finding things on her own.<br/>\n<br/>\nI am realising that they are more games on the videogames than on the computer.  For now, we  have an XBox, I tried to google but I don&#39;t think they are many girly games on it.  I think the ds have more.<br/>\n<br/>\nWhen I was talking about her interest in my dishes, phase might have been the wrong word.  What I wanted to say I was glad that she had the opportunity to explore that.  I would like to come up more things like that because they really brighten her day.<br/>\n<br/>\nI just thought her need to go to school comes from the fact that home is not stimulating enough in terms of interesting things and friends.  She does get bored sometimes but again I thought boredom is an emotional state that has nothing to do with how interesting the home is.  I have been trying to get the home as interesting as I can think of.  They have been busy with the neighboorhood kids all summer and now everybody is in school.  During the summer, I just have to take care of all the physical aspects, they are out morning to night with few breaks here and there when their friends come over.  When school start, everybody goes through withdrawal, I try to be very supportive and understanding during this period by coming up with fun things to do.  It seems no matter what I do, I can not beat three recess a day.<br/>\n<br/>\nThe other problem is none of them are at the school level.  Yesterday I was tryimg to enroll my daughter in a French Immersion school and tested her reading level.  Well the principal was not too impressed she told me if I was aware that my daughter who is supposed to be in grade 2 is a SK level.  That was so not an issue for me but it really messed up my daughter she was not herself all day.  After that she still wanted to try the public school and we went and got the forms.  Its so hard to watch all this and not be able to change her mind.<br/>\n<br/>\nWell she starting school on Wednesday and now everyone wants to go to school.  I have been reading the school choice page and trying to deal with it.  I have commited to a homeschool group this year and have organised many trips.  I am not sure what to do with all that now. This morning everyone is home, I have a doctor&#39;s appt in the morning.  I got my MIL to ome over so I don&#39;t have to drag everybody out.  After that we will try to make the most of our day.<br/>\n<br/>\nThanks for reading,<br/>\n<br/>\nFatim</div>","specialLinks":[]}],"prevTopicId":62792,"nextTopicId":62878}}