{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":0,"authorName":"A.Y.","from":"&quot;A.Y.&quot; &lt;hooperck@...&gt;","replyTo":"LIST","senderId":"q3AkEKbhmh8ParqhDFfZPs7WJEB8fS8EV-fg9SrUzbnvT-HQG_qgaup5SnZnwe1j6D8t_aDe1cHMy8eNH4JHVAHURIyp","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Re: Life Scripting","postDate":"932222831","msgId":1574,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4xMTkuMTU3NC45NTkyNjk3NDBAZUdyb3Vwcy5jb20+"},"prevInTopic":1558,"nextInTopic":0,"prevInTime":1573,"nextInTime":1575,"topicId":1556,"numMessagesInTopic":0,"msgSnippet":"Also, Kids need to know that they don t have to get  married at all.  I know many people I thought that should have stayed  single, or maybe been married but","messageBody":"<div id=\"ygrps-yiv-860331296\">Also,<br/>\nKids need to know that they don&#39;t &quot;have&quot; to get  married at all.  I know<br/>\nmany people I thought that should have stayed  single, or maybe been married<br/>\nbut not had kids.<br/>\nIn our society that is looked at a bit funny.<br/>\nAnn<br/>\n&quot;J</div>","specialLinks":[]},{"userId":0,"authorName":"Starfreedom@xxxxx.xxx","from":"Starfreedom@...","replyTo":"LIST","senderId":"m1SMB95-9Iw7GYqr0yyDianjZQxHe_4bHFwEn6m-dJs-ADqtUA0TAHOUtTWwvFJDcBNN_EsQt-ANsLMv","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Life Scripting","postDate":"932132944","msgId":1558,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4xMTguMTU1OC45NTkyNjk3NDBAZUdyb3Vwcy5jb20+"},"prevInTopic":1557,"nextInTopic":1574,"prevInTime":1557,"nextInTime":1559,"topicId":1556,"numMessagesInTopic":0,"msgSnippet":"John, I surely don t mind your essays and enjoyed the last one immensely (I am replying before reading this one) I am just wondering if you mind anyone posting","messageBody":"<div id=\"ygrps-yiv-689993781\">John, <br/>\nI surely don&#39;t mind your essays and enjoyed the last one immensely (I am<br/>\nreplying before reading this one) I am just wondering if you mind anyone<br/>\nposting your essays on other lists?<br/>\n<br/>\n Mary in Idaho</div>","specialLinks":[]},{"userId":0,"authorName":"KSeebose@aol.com","from":"KSeebose@...","replyTo":"LIST","senderId":"sYFqEAMFpCDIyFnoX1yxh1ewAfyJf6aKhrfibJ_W4q-J5UAuSJPROzHpVraVC8B1aYx6BAKNcw","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:  Life Scripting","postDate":"932124765","msgId":1557,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4xMTguMTU1Ny45NTkyNjk3NDBAZUdyb3Vwcy5jb20+"},"prevInTopic":1556,"nextInTopic":1558,"prevInTime":1556,"nextInTime":1558,"topicId":1556,"numMessagesInTopic":0,"msgSnippet":"John... May I pass this article on?  I loved it... Wanted to ask before I spread it on.. Kathie","messageBody":"<div id=\"ygrps-yiv-1296714595\">John...<br/>\n<br/>\nMay I pass this article on?  I loved it... Wanted to ask before I spread it <br/>\non..<br/>\n<br/>\nKathie</div>","specialLinks":[]},{"userId":0,"authorName":"John O. Andersen","from":"&quot;John O. Andersen&quot; &lt;andersen@...&gt;","replyTo":"LIST","senderId":"T--2kgNF2vj6KcqISwoNN9qBwSoGlk0puixXdMcklwb1hp1xDqpOkPoULKEu4sr5p1Vhzg2X71fZT32FYYflayYD6sC_ruS-d8mtBt0dn3-dPA","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Life Scripting","postDate":"932102747","msgId":1556,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4xMTcuMTU1Ni45NTkyNjk3NDBAZUdyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":1557,"prevInTime":1555,"nextInTime":1557,"topicId":1556,"numMessagesInTopic":0,"msgSnippet":"Here is an essay I wrote a few months back.  It s topic ties in with the practice of unschooling. I hope you don t mind my posting essays in this forum.  In","messageBody":"<div id=\"ygrps-yiv-877243946\">Here is an essay I wrote a few months back.  It&#39;s topic ties in with the<br/>\npractice of unschooling.<br/>\n<br/>\nI hope you don&#39;t mind my posting essays in this forum.  In the past, people<br/>\neither love me for it or hate me.  If you&#39;re one of the latter, may I<br/>\ninvite you to use your delete key should my messages offend.<br/>\n<br/>\nJohn Andersen<br/>\n<br/>\nLife Scripting<br/>\n<br/>\n\tIf the sameness of habits, opinions, and goals is any indication, more<br/>\nthan a few people in our society have absolved themselves of the<br/>\nresponsibility to script their own lives.  Instead they opt for the<br/>\nconvenience of  pre-packaged scripts derived through popular opinion.  <br/>\n\tOf course, popular opinion can sometimes be logical, and prudent. <br/>\nHowever, those who unquestioningly accept too much of it risk losing their<br/>\nindividuality.  In the long run, such people risk losing their capacity to<br/>\nbe creative, entertain themselves, or engage in rigorous independent<br/>\nthinking--all essential aspects of a rich and meaningful life.<br/>\n\tWhile many may agree that nurturing individuality is essential to<br/>\nhappiness, too few adults have the time or inclination to do that.  Perhaps<br/>\nthis is because of heavy pressure to conform not only on the job, but also<br/>\nduring much of their leisure time.  Or perhaps as children they didn&#39;t get<br/>\nenough time to daydream, to imagine, or to play.  Maybe they grew up<br/>\ndepending on others to entertain them and never fully learned to create<br/>\ntheir own fun.  Whatever the reason, far too many adults exchange their<br/>\nprerogative  to act independently for the convenience of following popular<br/>\nscripts.<br/>\n<br/>\n<br/>\nPopular scripts and their antidotes<br/>\n<br/>\nCollege is for nearly everyone<br/>\n<br/>\n\tOur nation&#39;s university system is the largest, and most respected in the<br/>\nworld.  As it has grown, so has its overhead.  Its continued financial<br/>\nsurvival and growth depends on widespread acceptance of the &quot;fact&quot; that a<br/>\ncollege degree is a necessary goal for virtually  everyone.  If too many<br/>\npeople were to turn their backs on the idea of college, the higher<br/>\neducation industry would be doomed.  Hence, popular opinion, spawned by<br/>\nmonied interests predictably supports the status quo.<br/>\n\tThere are other options, however.  More young people could learn trades. <br/>\nThey could take jobs and work their way up using common sense,<br/>\ndetermination, and self-education.  They could start their own businesses. <br/>\nThese aren&#39;t just consolation prizes for those who can&#39;t afford a<br/>\nuniversity education.  Rather, for the right person, they are superior<br/>\noptions to merely following the crowd to college.  <br/>\n\tRecently I had a chat with a man who is a world-renowned voice trainer and<br/>\nformer professional opera singer, and also happens to be one of my carpet<br/>\ncleaning customers.  He originally broke into the opera world not through<br/>\nearning a degree, but by  winning a song contest.  As he honed his craft,<br/>\nword spread about his talent.  This was the beginning of his lifetime<br/>\ncareer.<br/>\n\tHe pointed out how many parents shell out tens of thousands of dollars to<br/>\nsend their children to big-name universities and music schools to learn to<br/>\nsing in the opera.  According to him, university graduates may have a<br/>\ntextbook knowledge of the mechanics, but frequently lack the feel, the<br/>\nfire, and the ear which opera singers need.  He finds that recent<br/>\ngraduates, if they are to have any shot at success, often need to &quot;start<br/>\nall over again&quot; with a good voice teacher.  When I hear things like this, I<br/>\nhave to wonder who really benefits from all of the money parents spend on<br/>\n&quot;prestigious&quot; degrees.<br/>\n\tEncouraging young people to think independently and listen to their hearts<br/>\nmore than popular opinion can go a long way in counteracting the<br/>\neveryone-goes-to-college mind-set.  There are many ways to do this.  Mini<br/>\napprenticeships, wide exposure to different careers through frequent field<br/>\ntrips, museum visits, travels, reading, and even dinner table discussions<br/>\ncan open young minds to possibilities far beyond just the college option.  <br/>\n<br/>\n<br/>\n<br/>\nBecome a homeowner as soon as humanly possible<br/>\n<br/>\n\tThis is supposedly one of the first goals for which a young working adult<br/>\nshould strive.  Sometimes though it makes more sense to put off<br/>\nhomeownership for a few years or even a decade or more.  Many people view<br/>\ntheir first home purchase as a success, a step up in the world.  In terms<br/>\nof individual growth, however, it could be a failure if it&#39;s achieved at<br/>\nthe expense of suppressed creativity or missed mind-broadening<br/>\nopportunities.\t<br/>\n\tDuring my four year stint as a young Air Force officer in England I was<br/>\nrepeatedly pressured by peers to buy a home.  There I was, just one hour&#39;s<br/>\ndrive away from London, one of the most culturally fascinating cities in<br/>\nthe world, and here are these people telling me I should take on the duties<br/>\nand worries of  homeownership.  For crying out loud, I wasn&#39;t about to<br/>\nexchange the comparative freedom to take weekly day trips to places like<br/>\nSt. Paul&#39;s Cathedral, Covent Garden, or Trafalgar Square for weekends<br/>\nfilled up with cleaning, lawn-mowing, and honey-do-lists!<br/>\n\tA simple way to counter the pressure for premature homeownership is to<br/>\ndiscover your bliss and shamelessly immerse yourself in it.  Travel, sample<br/>\nand dabble with various careers, create, compose, or just sit and observe. <br/>\nIf you have extra money, spend it on things near to your heart.   Become a<br/>\nhomeowner when the time is right; when it won&#39;t detract from more<br/>\nmeaningful things.  <br/>\n<br/>\n<br/>\nIncome is the most important factor in the choice of careers <br/>\n<br/>\n\tA few years ago a dentist whose office carpet I cleaned, admitted that the<br/>\nchance to make a lot of money was the main reason he chose dentistry.  With<br/>\nhindsight, perhaps he wished other values would have played a larger role<br/>\nin that decision.  I detected a twinge of regret in his confession.<br/>\n\tToo many people make the same mistake.  They choose careers by what&#39;s hot<br/>\nat the time or what can bring them a lot of money.  In the long run, many<br/>\nregret having had such uninspired motives.  True, they might earn a lot of<br/>\nmoney and status.  However, as they mature, more than a few of  them<br/>\ndiscover that their &quot;hot career&quot; brings them little in the way of inner<br/>\nsatisfaction or sense of providing a necessary and appreciated service. <br/>\nThough it enriches them in material things, it impoverishes their souls.   <br/>\n<br/>\n\tRecently I got a letter from a former tenured professor who at the age of<br/>\n50 turned her back on an excellent salary, and a secure career highlighted<br/>\nby a coveted teaching  award.  She now does freelance consulting.  Living<br/>\non significantly less income, she drives a 22 year old car, and makes other<br/>\nfinancial sacrifices as necessary.  Her new lifestyle however, allows her<br/>\ntime she never had before to do meaningful things like giving service to<br/>\nHIV positive children, and assisting in animal rescue.  By diminishing the<br/>\nimportance of income in her life, she has actually increased her<br/>\nnon-financial wealth (peace of mind, sharper focus, etc.) many times over.<br/>\n\tMoney is important, and so are opportunities for advancement.  Far more<br/>\ncritical than those, however, is to find work in which you believe; work<br/>\nwhich feeds your soul; work which truly challenges all of your faculties. <br/>\nThat&#39;s the sort of work which will not only meet your physical needs, but<br/>\nhelp to make your life meaningful.  Down the road, that last bit may prove<br/>\nto be the more significant.<br/>\n<br/>\n<br/>\nShop &#39;til you drop <br/>\n<br/>\n\tShopping seems to be the number one leisure activity in our culture.  For<br/>\nmany people it&#39;s not just about getting the things they need, rather, it<br/>\noccupies in inordinate amount of their free time, not to mention their<br/>\nthoughts.  <br/>\n\tI&#39;m not saying that shopping is necessarily bad.  The point is that it&#39;s<br/>\njust one way of spending leisure time out of a universe of other<br/>\nactivities.  How boring to get stuck on just one option.  Why not try a<br/>\ndifferent hobby, or if you&#39;re a diehard shopper, approach it from an<br/>\nunconventional angle?<br/>\n\tSometimes taking the frugal route (thrift stores, garage sales, etc.) can<br/>\nmake shopping into a challengingly creative and educational pastime.   <br/>\nConsider my younger sister, the &quot;garage-sailor&quot; extraordinaire.  Over the<br/>\npast decade she has gone to garage sales nearly every Saturday.  That has<br/>\nenabled my sister and her husband to fill their home with quality<br/>\nfurniture, give their children many toys, and pack their closets with<br/>\nclothes.  And all of this cost them a mere fraction (frequently 10% or<br/>\nless) of what they would have paid in stores.  If that isn&#39;t enough, from<br/>\nthose experiences she has acquired a sharp eye for quality, a keen sense<br/>\nfor value, and an amazing store of knowledge about antiques.  Regularly<br/>\nfinding deals like $4 for a bundle of hardly used name-brand children&#39;s<br/>\nclothes, or $50 for an antique oak drop-leaf table worth $900, enables her<br/>\nto afford all of the things they need, and many of the things they want. <br/>\nThat sort of shopping differs sharply from the mainstream script and is<br/>\nsomething which could provide entertainment for life!<br/>\n<br/>\n<br/>\nConclusion: Be your own scriptwriter<br/>\n\t<br/>\n\tJust because you live in the suburbs and have a six-year-old son doesn&#39;t<br/>\nmean you&#39;re required to enroll him in a soccer league.  Just because you&#39;re<br/>\nclimbing the corporate ladder doesn&#39;t mean golf has to be your sport, or<br/>\nyou have to make your wife a football widow.  Permit yourself the freedom<br/>\nto break the rules.  Follow your heart wherever it leads.  Some of the<br/>\nthings you enjoy may be mainstream, and some not.  The crucial point is to<br/>\ndo what you love; what feels right. <br/>\n<br/>\n\tBe your own scriptwriter.  In the long run, you&#39;ll be happier being<br/>\nyourself than being a conformist because you think it&#39;s required to<br/>\nmaintain or enhance your status.  And your reward may very well be a life<br/>\noverflowing with intellectual stimulation, interesting experiences, and<br/>\ncreative ideas.<br/>\n<br/>\n<br/>\nJohn Andersen is a self-employed carpet cleaner in Portland, Oregon.  In<br/>\nhis leisure time he assists his wife with the homeschooling of their two<br/>\nyoung children and tutors high school students in math and German.  He is a<br/>\nformer Air Force captain who supervised flightline aircraft maintenance in<br/>\nEngland for four years.</div>","specialLinks":[]}],"prevTopicId":1572,"nextTopicId":1575}}