{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":257127,"authorName":"Deb","from":"Deb &lt;herbtea@...&gt;","profile":"live_oak2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Unschooling, Anti-Unschooling: the politics of it, and what we do at our  house.","postDate":"1028615307","msgId":39922,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNENEY2QzhCLkUwNjQ0MDVEQGd0ZS5uZXQ+","referencesHeader":"PDEwMjg1Nzg5ODAuMTI2MC40MDQxMi5tMTJAeWFob29ncm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":39921,"nextInTime":39923,"topicId":39922,"numMessagesInTopic":0,"msgSnippet":"Thanks, Ned for your insights and for the fascinating history of education in CT. My family lives there now and I have been curious about it in light of the","messageBody":"<div id=\"ygrps-yiv-1819272485\">Thanks, Ned for your insights and for the fascinating history of<br/>\neducation in CT. My family lives there now and I have been curious about<br/>\nit in light of the strong homeschool community and resistance to<br/>\nlegislative incursions there. <br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; The law covering education in Connecticut (where Luz and I have lived for<br/>\n&gt; several years) says that parents (and/or guardians) are responsible for<br/>\n&gt; their children&#39;s education. That law was written in 1650 and is still in<br/>\n&gt; effect. The law acknowledges the natural, sacred, unalienable RIGHT and duty<br/>\n&gt; that parents have in the raising of their children -- education being part<br/>\n&gt; of that upbringing. As this group and others remind us, homeschooling (at<br/>\n&gt; least learning) goes on in every home in the world -- so what are your kids<br/>\n&gt; learning?<br/>\n&gt; <br/>\n&gt; In CT, homeschooling has been an accepted practice for over 350 years. In<br/>\n&gt; fact, it was so universal in the early days that when towns organized Common<br/>\n&gt; Schools, the schools often did not accept children unless they already knew<br/>\n&gt; how to read, write  and calculate -- skills that were presumed to have been<br/>\n&gt; taught at home.<br/>\n<br/>\n </span></blockquote>This sooo makes sense to me! Kids learned how to read, write and reckon<br/>\nat home - where these things were put to practical use and incorporated<br/>\ninto everyday necessity! THen, if they had those skills, they could a<br/>\nattend school - and I take it from you farther info that these &quot;COmmon<br/>\nSchools&quot; were not compulsory since you say in CT there IS no compulsory<br/>\nattendance law. I always had a gut feeling that the present way was a<br/>\ndistortion of Actually this fills a big hole in my understanding of the<br/>\nevolution of education.  Then it is a choice to go to a school. Many<br/>\nhomeschoolers do eventually go to a college to learn things they want to<br/>\nlearn - and many even an unschooler brags about this. IT is just<br/>\ncotton-pickin&#39; loco to trap kids in warehouses where they can&#39;t move,<br/>\ncan&#39;t talk and can&#39;t even think for themselves if they participate! And<br/>\nas you say, teachers now are trained to &quot;therapize&quot; and refer to<br/>\nprofessionals kids who don&#39;t learn under these circumstances.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Similarly, when a child needs (wants ! ) to learn how to read, such as in<br/>\n&gt; the recent example of the smaller sister asking her older sibling in bed how<br/>\n&gt; to say certain words that she pointed to on the page, such as HOP, one<br/>\n&gt; person was helping the other to learn. It is not unusual that parents are<br/>\n&gt; surprised by the abilities of their kids -- without any teaching. The reason<br/>\n&gt; we are surprised sometimes is that we believe that learning is difficult and<br/>\n&gt; takes a lot of teaching. That is the garbage that schools want us to<br/>\n&gt; believe, so that we will maintain support for all their employees and<br/>\n&gt; outrageous budgets.<br/>\n&gt; <br/>\n&gt; As an unschooler (a staunch, radical, fanatical one) I am vehemently against<br/>\n&gt; schooling -- the kind that is done in schools, and is directed by schoolers<br/>\n&gt; for the benefit of the school establishment -- not the children. But that<br/>\n&gt; doesn&#39;t mean I am against learning or even teaching, so long as it is asked<br/>\n&gt; for by the learner.<br/>\n<br/>\n </span></blockquote>Yeah, no restrictions ---- people learn by themselves, people learn from<br/>\neach other, people teach each other. The heck with any arbitrary and<br/>\nartificial confusing of the definition of the word &quot;teach&quot; with modern<br/>\nconnotations associated with it... from the degradation occurring in<br/>\nschools obviously.<br/>\n<br/>\n&quot;School&quot; is actually derived from the Greek word for &quot;leisure&quot;, the time<br/>\nspared from working and fighting. Those who could walked about with<br/>\nPLato in his academy in the woods and talked of things, learned from him<br/>\nand from their discussions. THere is another separate word &quot;school&quot; with<br/>\nan entirely different derivation and meaning that seems to have become<br/>\nmixed with the other&quot;school&quot;. A &quot;school&quot; of fish came from words for<br/>\ndivision into groups for the same type of creature. Now we&#39;ve got<br/>\ndivisions into age groups, levels of readers and &quot;learners&quot;, &quot;at-risk&quot;<br/>\nstudents, &quot;learning-disabled&quot; groups, phewwey! Free them all, parents!<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; <br/>\n&gt; My point is that UNschooling is a personal idea. Today&#39;s practice comes<br/>\n&gt; primarily from the work and books of John Holt, who told us years ago that<br/>\n&gt; the trouble with education is the schooling, the boring, life-crushing<br/>\n&gt; tedium, the sit-down-shut-up-listen-to-this madness that drives kids crazy,<br/>\n&gt; especially when there&#39;s so little that those places teach and how quickly<br/>\n&gt; most kids can learn it ALL so that they can go out and play and discover how<br/>\n&gt; the world really works.<br/>\n&gt; <br/>\n&gt; What&#39;s my point...let&#39;s not thrash each other for not UNschooling. I am not<br/>\n&gt; Anti-Unschooling, but I am also not Anti-teaching when a kid asks for that.<br/>\n&gt; Purity in unschooling (as some understand it, as *no teaching no matter<br/>\n&gt; what*) is as much the enemy of learning as school is.<br/>\n<br/>\n </span></blockquote>Yeah, I think when the words teach and learn are too arbitrarily<br/>\ndefined, it makes people stop thinking and looking at what goes on in<br/>\nfront of them in life, and rather promotes operating based on a dogmatic<br/>\ntheory instead. Hmm... perhaps &quot;feeding&quot; is a bad word because it<br/>\nimplies a power of the one with the food that is enforced on the one who<br/>\ndoes or doesn&#39;t want food at the time. If a little child wants food and<br/>\ncan&#39;t have it then, or doesn&#39;t want food when it is &quot;fed&quot; to him,<br/>\nwouldn&#39;t the world be a better place if parents not only just let the<br/>\nchild &quot;eat&quot; when and what he wants to, but also never say &quot;I fed him.&quot; -<br/>\nbut only said &quot;he ate&quot;.And then have rules like never to say something<br/>\nlike &quot;All the people coming on our picnic will need to be &quot;fed&quot; -but<br/>\nhave to say &quot;The people coming will need to eat --because we&#39;ll forget<br/>\nto be polite and caring and let them choose how much to eat and what<br/>\nthey prefer out of what we bring, if we  don&#39;t say it that way.<br/>\n<br/>\nPhilosophically, what is available in the environment and what people<br/>\nare doing around one always has a bearing on what people will learn. If<br/>\nit is a rich environment with choices, kids can choose things. If not<br/>\nmuch is going on or talked about or available it becomes tougher for a<br/>\nkid to expand as much as they potentially could. So perhaps parents who<br/>\nare unschooling and get antsy with that could dive into learning<br/>\nthemselves more and expanding where they go, what they read, what they<br/>\ndo - and how much they discuss, think and listen. <br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Is it possible that some parents don&#39;t know HOW to teach what their child<br/>\n&gt; wants to know? Sure, it happens a lot. That&#39;s when they need to become<br/>\n&gt; learners right along with the child. <br/>\n&gt; Ned Vare<br/>\n&gt; <br/>\n&gt; Yes, that is the secret (to non-homeschoolers) delight of homeschooling. you get too learn all kinds of things too which you might not have if you were stuck in an office.... ahhh, what pleasure.<br/>\n<br/>\n </span></blockquote>Homeschooling days with my daughter were most often like this:<br/>\n<br/>\nStay up past midnight reading in bed. Get up around 10 AM. Feed the<br/>\nanimals (oops, should I say &quot;facilitated the animals eating&quot;?), snack or<br/>\nmake pancakes, curl up and finish the book. Have a leisurely discussion<br/>\nabout people and occurrences in the book and real-life people they<br/>\nreminded us of. Remembrances of things past. Go for a walk to the duck<br/>\npond and feed the ducks (oops, I mean &quot;Let the ducks eat the crackers we<br/>\nhad.&quot;.. My daughter spent hours pouring over the mail order chicken<br/>\ncatalog deciding which chickens to order and which combinations of<br/>\nchickens would give her the best deal on the neatest chickens - and<br/>\nwhether to buy separate chickens or the advertised mixed specials (hours<br/>\nof math here). THen she might dictate a story to me that I would write<br/>\ninto a nice blank book and she then illustrated. Dress up in costumes<br/>\nwith friends and play. GO to the store and see if they had any unusual<br/>\nfruits or vegetables we didn&#39;t know, and buy stuff to stock up. Back<br/>\nhome, eat, and maybe play a little chess or a card game like<br/>\nmultiplication war. Then start a new book and stay up late reading it.<br/>\n<br/>\nAnd so it went, with plenty of trips to beach, camping, exploring - dad<br/>\nactually had a systemic plan to visit every park and green spot on the<br/>\nmap of our area. Once we took a train trip to a nearby city for the<br/>\nafternoon and came back. Science museum, art museums, bookstore. Talking<br/>\ntogether. She saw the projects I did reading the laws for a citizens&#39;<br/>\nrights group, and I&#39;d tell her about the alerts I was writing and she<br/>\ntold me to go ahead and do it, it was important. <br/>\n<br/>\nIt wasn&#39;t always rosy; dad changed businesses and moved it into our<br/>\nhouse and it grew to a bunch of employees which made it very noisy and<br/>\nno space at home, but eventually that changed again and he got an office<br/>\nand we lived through it. <br/>\n<br/>\nNow my daughter is almost 16 and attends the college near us for art and<br/>\npottery classes, does computer graphics, and has a boyfriend who takes<br/>\nalot of her time. She is reading a history of philosophy with<br/>\nphilosophers from Greek to modern - that happened when someone on the<br/>\ninternet mentioned existentialism and she wanted to know more. She also<br/>\nworks at my husband&#39;s business where he makes herbal and nutritional<br/>\nproducts. She watches the Daily Show with Jon Stewart at 11 PM - we all<br/>\ndo to find out what is going on in the world today in a bearable format<br/>\n(Comedy Central CHannel). We&#39;ll see what else she gets into this year.<br/>\n<br/>\nSo that&#39;s what we have do and do now. Still read late at night and get<br/>\nup as late as possible with all we have to do.<br/>\n<br/>\nDebbie</div>","specialLinks":[]}],"prevTopicId":39920,"nextTopicId":39734}}