{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Joy and parenting","postDate":"1351389065","msgId":69485,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYwRDFEMkI3LTQ4MjYtNEFBQi1BQTA1LUI5OUZBQzVFNTczNUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":69484,"nextInTime":69486,"topicId":69485,"numMessagesInTopic":0,"msgSnippet":"Keith and I just got back, 7:15ish, from having been at Holly s birthday show since we started setting up punch and snacks at 2:15. Keith did pizza runs.  I","messageBody":"<div id=\"ygrps-yiv-1463026243\">Keith and I just got back, 7:15ish, from having been at Holly&#39;s birthday show since we started setting up punch and snacks at 2:15.  <br/>\n<br/>\nKeith did pizza runs.  I kept glasses of punch filled.   <br/>\n<br/>\nThe first three hours were her party.  Invited guests only, and there were bands, at a performance center in downtown Albuquerque called Amped.  Amped does all-ages shows.   Most of the regulars are over 21, but they spend their time there, not out drinking.<br/>\n<br/>\nHolly turns 21 next week.  Instead of wanting a party with alcohol, this is what she asked for--for us to help her organize this, and to provide pizza and snacks, and we gave the venue $150.  They like Holly very much, because she&#39;s a regular there (&quot;Part of the family,&quot; the owners told us) and her boyfriend&#39;s band performs frequently—they offered to do it free, but Holly wanted to pay for the space.  <br/>\n<br/>\nAfter 6:00, they were charging $5 at the door as they regularly do, and we took the food away (legalities).  <br/>\n<br/>\nHolly had advertised both parts separately, on facebook and with paper flyers she&#39;s been distributing for three weeks.   She&#39;ll be there until 10:30 or after they clean up.  She often helps clean up.<br/>\n<br/>\nThere were probably 50 people there, maybe not all at once, and there will be more later.  <br/>\n<br/>\nHolly didn&#39;t ask her boyfriend&#39;s band to play.  He helped host.  The drummer (his best friend and roommate) was there; the other band member had another gig--he does other musical things.<br/>\n<br/>\nI&#39;m telling that because my whole life I&#39;ve seen people older, my age, younger, kids my kids&#39; ages, turn 21.  What Holly asked for, and her wanting us there, was not average.  We would have bought her liquor and hosted a party here.  We did for Kirby when he turned 21.   Marty went to Las Vegas with his girlfriend, partly a gift from her and partly with birthday money we gave him.  (From Albuquerque, Las Vegas is about an eight-hour drive.)<br/>\n<br/>\nSo what Holly wanted wasn&#39;t even &quot;normal&quot; for our family.  :-)<br/>\n<br/>\nNext Friday, her actual birthday, she&#39;s planning to go out for sushi and sake with her boyfriend, her brother Marty, and Marty&#39;s girlfriend Ashlee.  They will come back earlyish because she&#39;s in a women&#39;s choir and they have a lock-in (all-day intensive music practice) starting at 9:45 the next morning.<br/>\n<br/>\nI report this, for the record, as the candid behavior of our last-to-turn-21 unschooled child who has had and still has lots of choices and support from her family.   The &quot;normal&quot; behavior assumed of teens and young adults seems to be a reaction to limits, rules, school, shame, and pressure.  It&#39;s been a long, long time since I though of it as normal.<br/>\n<br/>\nHere&#39;s another thing, though, worth noting:  Everyone who attended Holly&#39;s party, and everyone in every band that came to play seven or eight bands will have played before the event is over) is at an all-ages, alcohol-free venue, because they&#39;re there to play or to hear local music.  That&#39;s special, too. <br/>\n<br/>\nHere&#39;s something for further reading, if anyone&#39;s wondering about what&#39;s normal with teens.  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/rebellion\">http://sandradodd.com/rebellion</a><br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":69414,"nextTopicId":69456}}