{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":16,"messages":[{"userId":284087656,"authorName":"Karen James","from":"Karen James &lt;semajrak@...&gt;","profile":"semajrak","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Organizing toys","postDate":"1313277469","msgId":62357,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBS0VSQTNTQkx1akFxbUVWZ0tDcXNBTktOdXVNVmV1blIrSFFDUEd3dzRnRWptMFdyQUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGoyM2tkZytwZ2ozQGVHcm91cHMuY29tPg==","referencesHeader":"PGoyMTBuOCtlcGM3QGVHcm91cHMuY29tPgk8ajIza2RnK3BnajNAZUdyb3Vwcy5jb20+"},"prevInTopic":62350,"nextInTopic":0,"prevInTime":62356,"nextInTime":62358,"topicId":62314,"numMessagesInTopic":0,"msgSnippet":"... We are currently traveling.  My son has decided he wants to save little bits and pieces from our journey.  Those bits and pieces would look like garbage to","messageBody":"<div id=\"ygrps-yiv-1395730919\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt;  I found we really didn&#39;t need over 50 matchbox cars and trucks or over 30<br/>\n&gt; items for the grocery cart, etc.,<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>We are currently traveling.  My son has decided he wants to save little bits<br/>\nand pieces from our journey.  Those bits and pieces would look like garbage<br/>\nto most, but to him they are very special.  There is an empty juice can from<br/>\nthe plane, wrappers from chips that he discovered and liked, straws that he<br/>\nwants to save and use to make something when we return home, mesh from some<br/>\nleeches we tried, and many more items.  He is giddy with excitement over his<br/>\ncollection.  Our plan is to put all of his collection in a box the day<br/>\nbefore we leave and mail it to our home.  He will be thrilled to see it all,<br/>\ngo through it, and recall his own special memories from our trip.<br/>\n<br/>\nIf I had decided that we couldn&#39;t possibly save this stuff because it simply<br/>\nwasn&#39;t convenient, or wasn&#39;t something I thought we needed, he would have<br/>\nbeen very sad, and I would have lost an opportunity to share this interest<br/>\nof his, watch what it turns in to, and support his plan.  In this case,<br/>\nquite literally, what looks like a mess to one, is definitely a treasure to<br/>\nanother :)<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":472480490,"authorName":"sheeboo2","from":"&quot;sheeboo2&quot; &lt;brmino@...&gt;","profile":"sheeboo2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Organizing toys","postDate":"1313252548","msgId":62350,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGoyNjhjNCtpb3FpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGoyNjRkOSs3dnRtQGVHcm91cHMuY29tPg=="},"prevInTopic":62347,"nextInTopic":62357,"prevInTime":62349,"nextInTime":62351,"topicId":62314,"numMessagesInTopic":0,"msgSnippet":"... parent s can t just copy what works for someone else. It s better to look at a range of ideas and get a sense of the principles for how to approach an","messageBody":"<div id=\"ygrps-yiv-2039228324\">----The thing is, not every child has the same interests or needs so other<br/>\nparent&#39;s can&#39;t just copy what works for someone else. It&#39;s better to look at a<br/>\nrange of ideas and get a sense of the principles for how to approach an issue.-----<br/>\n<br/>\nI wanted to comment on how very important this is.  In an earlier post someone mentioned getting rid of duplicates.  I laughed because having more than one of something, especially if it is exactly the same, has always been a huge draw for Noor.  Many of her favorite toys are pairs, or trios (to mirror our family of three).  When she chooses toys, she&#39;ll often pick something, like a Safari or Schilech figure that is exactly like one she already has.<br/>\n<br/>\nIf we saw her love of duplicates (and triplicates) as unnecessary (clutter) that would demean something that is incredibly important to her. A few times while shopping with grandma,  she&#39;s said something like, &quot;You already have one of those, why don&#39;t you get something else&quot; and Noor&#39;s face falls because grandma doesn&#39;t (want to?) understand (no matter how many times Noor or I have explained to her), that different isn&#39;t always better. <br/>\n<br/>\nSandra, thanks for reminding me about Howard Gardner and Nature Intelligence. I&#39;ll revisit that as Noor is most definitely a collector.<br/>\n<br/>\nBrie</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Organizing toys","postDate":"1313248489","msgId":62347,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGoyNjRkOSs3dnRtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGoyNWx0bis3ZnA2QGVHcm91cHMuY29tPg=="},"prevInTopic":62346,"nextInTopic":62350,"prevInTime":62346,"nextInTime":62348,"topicId":62314,"numMessagesInTopic":0,"msgSnippet":"... **************** I don t think anyone s saying that coming up with solutions to that is a bad thing! The thing is, not every child has the same interests","messageBody":"<div id=\"ygrps-yiv-2050787070\">&quot;julieswebmail&quot; &lt;julieswebmail@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;I have also witnessed my kids&#39; sensory overload and material disregard when faced with too many presents at once -- the presents become meaningless and my kids get overwhelmed.  <br/>\n </span></blockquote>****************<br/>\n<br/>\nI don&#39;t think anyone&#39;s saying that coming up with solutions to that is a bad thing! The thing is, not every child has the same interests or needs so other parent&#39;s can&#39;t just copy what works for someone else. It&#39;s better to look at a range of ideas and get a sense of the principles for how to approach an issue.<br/>\n<br/>\nStoring things is a good idea, if kids are easily overwhelmed. Put things up to strew later if people want to give gifts for specific occasions and memberships to zoos and museums don&#39;t work for your kids (they weren&#39;t a good fit for Ray and only recently for Mo). You could also ask people to spread things out, too, if they&#39;re amenable. Let grandparents know about the overwhelm factor and see if there&#39;s a better time of year, some dry time between other holidays (and other grandkid birthdays, too). <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My kids are fortunate to have many grandparents, aunts and uncles, cousins and close family friends who do inquire what I think would be good presents to give...they don&#39;t live here and have no idea what toys we currently own; and though they may know my children well and think about their passions and interests<br/>\n </span></blockquote>********************<br/>\n<br/>\nAnother option is to sent people links to online stores you like and set up a wish lish, kind of like a wedding registry. Or ask for subscriptions to monthly things - magazines are easy, but there are also monthly puzzle clubs or adventure games... we had one from Highlights for awhile with a world map and a mystery in a new country each month. Lego Education has a monthly kit thing going on now, taking the place of their old Brickmaster magazine - that could be a good way to spread out Lego purchases over a year and keep things fresh if you have a builder.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Organizing toys","postDate":"1313248044","msgId":62346,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdCQkExNzY1LTdBMjktNDhCRS1CRTBGLTRGODMwM0ZCQkY0RkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGoyNWx0bis3ZnA2QGVHcm91cHMuY29tPg==","referencesHeader":"PGoyNWx0bis3ZnA2QGVHcm91cHMuY29tPg=="},"prevInTopic":62340,"nextInTopic":62347,"prevInTime":62345,"nextInTime":62347,"topicId":62314,"numMessagesInTopic":0,"msgSnippet":"-=My children often have the pleasure of going to the toy store to pick out the toy(s) they desire (within our price range.) They get to do this not only on","messageBody":"<div id=\"ygrps-yiv-109784425\">-=My children often have the pleasure of going to the toy store to pick out the toy(s) they desire (within our price range.) They get to do this not only on birthdays and Hanukkah, but also for no reason at all. Much of the family from across the country send checks, so these often go towards the memberships while the kids choose a small (less than $5) gift from the store. -=-<br/>\n<br/>\nToys that are less than $5 rarely match up to the cool $50 toys.  If the child only gets toys within your price range when it&#39;s your money, and you set an artificially low price range even when it&#39;s someone else&#39;s money, that might be a symptom of over-controlliness. (I just made that word up for the moment; don&#39;t think about it too much; sorry.)<br/>\n<br/>\n-=-The kids still have plenty of presents to open on their birthdays since friends are invited for a party including gifts, party games and all that a child could dream for his birthday (yes, they help with the planning, setting up, baking, etc...)-=-<br/>\n<br/>\nI don&#39;t think you mean for that to sound dismissive, but it does.  &quot;Plenty&quot; and &quot;all that a child could dream&quot; sound like they could have a tinge of resentment.  <br/>\n<br/>\n-=-When &#39;choosing&#39; a gift for my child I think carefully about it before investing (just as you would for anyone else...)-=-<br/>\n<br/>\nI don&#39;t know why you added quotation marks to &quot;choosing.&quot;  Isn&#39;t choosing choosing?  Or is there some specially charged choosing you were writing about?<br/>\n<br/>\nThe discussions on the list should be for the benefit of all readers, and more addressed to the group in general, to the topic in general than this:<br/>\n<br/>\n-=-...that&#39;s what Howard Gardner calls Nature Intelligence.&quot;<br/>\n-=-Yes, I am familiar with Gardners&#39; 8th intelligence (and the other seven, too...) and I remember having collections and know the value and importance they can have to a child. -=-<br/>\n<br/>\nWith sixteen new list members in the past week, it&#39;s possible some of them didn&#39;t know, or hadn&#39;t thought about it in that light.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":450744032,"authorName":"julieswebmail","from":"&quot;julieswebmail&quot; &lt;julieswebmail@...&gt;","profile":"julieswebmail","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Organizing toys","postDate":"1313233655","msgId":62340,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGoyNWx0bis3ZnA2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzMTMxNzc3NjQuOTM0NTkuWWFob29NYWlsTmVvQHdlYjgxNTA0Lm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":62331,"nextInTopic":62346,"prevInTime":62339,"nextInTime":62341,"topicId":62314,"numMessagesInTopic":0,"msgSnippet":"In response to several posts: he was to young to understand the permanence of his toys being gone. He could not foresee wanting them in the future. Yes, I","messageBody":"<div id=\"ygrps-yiv-23591182\">In response to several posts:<br/>\n<br/>\n&quot;he was to young to understand the permanence<br/>\nof his toys being gone. He could not foresee wanting them in the future.&quot;<br/>\n<br/>\nYes, I have found this could be true for children at different stages, which is why we have stored most of the toys to start -- if there&#39;s a change of heart, the toys can come back if they&#39;re missed.<br/>\n<br/>\n&quot;Is it about what you think they need or what they want/need??<br/>\nI think memberships to the museum and trips to somewhere fun are great , unless<br/>\nthe child is disappointed because they envision their birthday full of presents<br/>\nand toys. Your kids are young.<br/>\nThe 2 year old probably will be happy with anything at this point. Maybe even<br/>\nyour 4 year old if he is easy going.<br/>\nMy kids , in the other hand, always new exactly what they wanted and it was up<br/>\nto them, within our capabilities,<br/>\nto choose what they wanted.<br/>\nAs to other giving presents I can give an idea if solicited but I find it in<br/>\npoor taste to tell someone what they can give my kids as a present , unless<br/>\nasked specifically.&quot;<br/>\n<br/>\nMy kids are fortunate to have many grandparents, aunts and uncles, cousins and close family friends who do inquire what I think would be good presents to give...they don&#39;t live here and have no idea what toys we currently own; and though they may know my children well and think about their passions and interests, they still want to know what I think (so, yes, I have been asked specifically.)  I have also witnessed my kids&#39; sensory overload and material disregard when faced with too many presents at once -- the presents become meaningless and my kids get overwhelmed.  <br/>\n<br/>\nMy children often have the pleasure of going to the toy store to pick out the toy(s) they desire (within our price range.)  They get to do this not only on birthdays and Hanukkah, but also for no reason at all.  Much of the family from across the country send checks, so these often go towards the memberships while the kids choose a small (less than $5) gift from the store.  We couldn&#39;t afford the memberships otherwise, and I know for sure that they would be disappointed if they couldn&#39;t go to their favorite museum, zoo or amusement park. <br/>\n<br/>\nThe kids still have plenty of presents to open on their birthdays since friends are invited for a party including gifts, party games and all that a child could dream for his birthday (yes, they help with the planning, setting up, baking, etc...)<br/>\n<br/>\n&quot;Imagine how you would feel if someone critiqued everything you wanted based<br/>\nwhether or not they thought you should have it - that&#39;s how it can feel to kids<br/>\nto be subjected to this kind of parental decision making. It can feel pretty<br/>\nharsh and dismissive of their interests.&quot;<br/>\n<br/>\nWhen &#39;choosing&#39; a gift for my child I think carefully about it before investing (just as you would for anyone else...)  I am not hovering over them and critiquing everything they want nor am I dismissive of their interests.  When they are choosing their own gifts, they have the freedom to choose, and are allowed to pick out what they wish within our price range (even if they already own one or broke it once before.) <br/>\n<br/>\n&quot;That&#39;s the trouble with taking an idea and turning it into a rule - it falls<br/>\napart when you try to make it work in too many different situations.&quot;<br/>\n<br/>\nAs I mentioned before, I take what resonates with me and works for my family and leave the rest behind.  There are no hard and fast rules made, and each situation deserves consideration on its own.<br/>\n<br/>\n&quot;The ability to recognize which generation of My Little Pony, or to care about<br/>\n50+ Matchbox cars, or to know or care about the differences in flowers, or<br/>\nsilverware patterns, or birds, or fonts or the tastes of spices--that&#39;s what<br/>\nHoward Gardner calls Nature Intelligence.&quot;<br/>\n<br/>\nYes, I am familiar with Gardners&#39; 8th intelligence (and the other seven, too...) and I remember having collections and know the value and importance they can have to a child.  I also remember the value and importance of acquiring each and every item within the collection, (which is much different than a grandparent buying boxes of 20+ cars at a time or adding more items to the already unused play food and groceries in the pretend kitchen.)  My big guy collects candy wrappers (he calls them &#39;snow chains&#39; for his lego cars,) and each of those wrappers has been carefully stowed away in their special place, and though they look like garbage to anyone else, I know that they are important to him and respect this.  <br/>\n<br/>\nThings that they love and value have not been tossed -- they have participated and willingly pared down their collections and chose which toys they no longer wanted that went into the donation or consignment boxes (and have used the $$ earned to buy new toys of their choosing.)  Yes, it was my impetus that prompted the clearing out of what I perceived as excess -- and I spoke openly and honestly with my kids about it, asking them to help out, and they did.  Did they do it to please me or because they saw the value in getting rid of old stuff to make room for new?  Did I influence their decisions with an approving look or nod?  Did they feel free to refuse my request to clear up the clutter?  Maybe so, maybe not... <br/>\n<br/>\nI can understand how my post may have raised a few eyebrows, and I appreciate those who are keeping me on my toes ;)  There are limits to expressing oneself in an email post, and in the interest of brevity I had left out explanations and details that may have cleared up some of your concerns about how I had used advice in Simplicity Parenting to cut down on some of the clutter around here.  We still have plenty of &#39;nice, cool toys&#39; for the kids (and plenty of clutter, too!)</div>","specialLinks":[]},{"userId":374014398,"authorName":"Melissa Yatzeck","from":"&quot;Melissa Yatzeck&quot; &lt;myatzeck@...&gt;","profile":"melissamariemichael","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Organizing toys","postDate":"1313203647","msgId":62331,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGoyNG9qdit2Z2xsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGoyMTBuOCtlcGM3QGVHcm91cHMuY29tPg=="},"prevInTopic":62329,"nextInTopic":62340,"prevInTime":62330,"nextInTime":62332,"topicId":62314,"numMessagesInTopic":0,"msgSnippet":"You ve gotten a lot of good advice already, and I thought I would add a few suggestions that have worked well in our family. My kids are 5, 3, and 4 months.","messageBody":"<div id=\"ygrps-yiv-1939769012\">You&#39;ve gotten a lot of good advice already, and I thought I would add a few suggestions that have worked well in our family.  <br/>\n<br/>\nMy kids are 5, 3, and 4 months.  My husband is very bothered by disorder in our house.  It is actually physically uncomfortable for him to be in messy, disordered surroundings.  We moved all of our kids into one bedroom so that our 3rd bedroom could be a designated toy room.  We also have a smaller amount of toys in the family room downstairs.  While he is gone during the day, my kids play with the toys and they end up spread around the house a bit.  Right before my husband is set to walk through the door, I try to gather up all the toys that aren&#39;t being played with into a laundry basket and dump them back in the toy room.  It only takes a minute, and he is a much happier, calmer person if he walks in and sees an uncluttered space.  <br/>\n<br/>\nAs far as organizing the toys within the toy room, we bought some shelves at IKEA from the EXPEDIT series about a year ago that made a dramatic difference.  The shelves hold so much, and display it all so the kids can see all of their toys more easily, and it looks really cool in there too.  <br/>\n<br/>\nI also took a couple of plastic storage bins with lids and filled them up with an assortment of toys and put them in the basement.  Every couple of months I bring the bins up and switch out the toys.  To the kids, it seems like they have new toys again.  And if they are really missing something, it&#39;s not too much trouble to dig it out of the basement again.<br/>\n<br/>\nWe also cut down on the amount of toys we have at our house by sharing them with grandma.  This might not work for everyone, but we live only a few minutes from grandma and the kids play over there pretty often.  So every now and then we bring some of our toys over there, and every now and then some of them come back to our house again.  This is nice because then grandma doesn&#39;t need to spend her money on toys, and it cuts down on the amount of toys we need to find spaces for at our house.<br/>\n<br/>\n~Melissa Yatzeck<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;VanessaL&quot; &lt;fancyness07@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; My kiddos are 3 and 1 so I&#39;m not sure how much of this is because they are little but I&#39;m having a hard time with the &quot;too much stuff&quot; issue.<br/>\n&gt; <br/>\n&gt; I&#39;d love to hear how people are able to accommodate it all. Is it a matter of having a good organization system? Change of thinking in how mess/clutter/stuff is perceived? Will it get better as my kids get older? <br/>\n&gt; <br/>\n&gt; I made the mistake of joining a Simplicity Parenting book club with some good friends of mine. It&#39;s been good in one way because I see the lack of regard to a child&#39;s (and husband&#39;s) feelings when they talk of purging all the toys and stuff, and it reinforces how much I don&#39;t want to be that way with my own family. (it&#39;s also made me realize how different the paths my friends and I are choosing and that has been surprising) But I still feel like my family could benefit from a better system. We have lots of closets, shelves and space for many things but it migrates everywhere, gets lost, broken, and feels like my whole house has turned into a preschool/toy store, except one with less order.<br/>\n&gt; <br/>\n&gt; I guess in a way it is our &quot;preschool&quot; since we&#39;re home so much but I&#39;m overwhelmed when I look around and every surface is covered in things.<br/>\n&gt; <br/>\n&gt; Should I be breaking it down into smaller bits and making positive choices about them separately instead of lumping it into one big issue? Maybe find a way to organize the train set instead of the whole playroom?<br/>\n&gt; <br/>\n&gt; Thanks,<br/>\n&gt; Vanessa<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":413967925,"authorName":"Bea","from":"&quot;Bea&quot; &lt;beatrice.mantovani@...&gt;","profile":"bmantovani","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Organizing toys","postDate":"1313196278","msgId":62329,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGoyNGhkbStpMmY3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGoyM2tkZytwZ2ozQGVHcm91cHMuY29tPg=="},"prevInTopic":62326,"nextInTopic":62331,"prevInTime":62328,"nextInTime":62330,"topicId":62314,"numMessagesInTopic":0,"msgSnippet":"== I am also much more thoughtful in choosing new toys (do they really need that?)== This reminds me of something in my own life: My kids are also very young","messageBody":"<div id=\"ygrps-yiv-181460594\">== I am also much more thoughtful in choosing new toys (do they really need that?)==<br/>\n<br/>\nThis reminds me of something in my own life:<br/>\nMy kids are also very young (2 and 5 years old) and for a while when I told my husband that I wanted to buy something for them he would ask if they really need it.  I would tell him that they don&#39;t really need anything, they can play with bits of strings and sticks and scraps of fabric (sometimes they do just that!) but it&#39;s nice to have some nice, cool toys around, especially since we are unschoolers, and that learning should be a priority in our life (I&#39;m pretty sure I got that last part of the argument from something Sandra Dodd wrote.) <br/>\n<br/>\nMy husband also had a hard time with the kids not playing with all of their toys, or not playing with a new toy for more than a few hours, and then seemingly forgetting about it.  I told him they&#39;d play with them again, and they have.  And also now my youngest daughter loves to play with some toys I got for the oldest, that the oldest didn&#39;t play with so much.   I also like to have toys around that visiting kids like to play with, because then my kids rediscover those toys too.  <br/>\n<br/>\nThis makes it sound like my house is overrun with toys (and I have had other people tell me that I have too many toys - not unschoolers though) but really my house is fairly well-ordered, with things on shelves and in boxes.  It is true that it doesn&#39;t look much like a grown-up house, though. <br/>\n<br/>\nBea</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Organizing toys","postDate":"1313187617","msgId":62326,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGoyNDh2MSthaTNmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGoyM2tkZytwZ2ozQGVHcm91cHMuY29tPg=="},"prevInTopic":62324,"nextInTopic":62329,"prevInTime":62324,"nextInTime":62327,"topicId":62314,"numMessagesInTopic":0,"msgSnippet":"... This kind of story sounds good but depends a lot on the personality of the child. Some kids don t like to get rid of their things, they d rather keep them ","messageBody":"<div id=\"ygrps-yiv-1552866397\">&quot;julieswebmail&quot; &lt;julieswebmail@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; We went through the house, from space to space, clearing out<br/>\n&gt; what we didn&#39;t use or want -- I did this with my older son when we were<br/>\n&gt; going through toys, so he helped by making his own decisions on what to<br/>\n&gt; keep, store, sell or trash.<br/>\n<br/>\n </span></blockquote>This kind of story sounds good but depends a lot on the personality of the<br/>\nchild. Some kids don&#39;t like to get rid of their things, they&#39;d rather keep them<br/>\naround long past the point parents might expect. My daughter has a hard time<br/>\ngiving up clothes she has outgrown, even if they have holes in them and doesn&#39;t<br/>\nappreciate it when I suggest we could use the cloth for something else or give<br/>\nthe better items away. They&#39;re her things.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I<br/>\n&gt; found we really didn&#39;t need over 50 matchbox cars and trucks or over 30<br/>\n&gt; items for the grocery cart, etc., so by cutting down on the multiples<br/>\n<br/>\n </span></blockquote>Some kids are collectors, though. It&#39;s not always a simple matter of &quot;getting<br/>\nrid of multiples&quot; for someone who likes to collect. I collect certain things -<br/>\nsewing accessories in particular. I have four pairs of sewing scissors: the<br/>\nshears, the applique scissors, the snips and the &quot;paper&quot; scissors for cutting<br/>\npatterns and templates. To someone who isn&#39;t into sewing that could seem pretty<br/>\nsuperfluous - but it isn&#39;t to me. I bring that same respect to my kids. Mo has a<br/>\ncollection of Bionicles she rarely plays with but sets them up, posed, in little<br/>\ngroups for awhile. They take up a lot of room! But we&#39;ve managed to find ways to<br/>\nstore the figures when they&#39;re not in use and places to set up scenes where they<br/>\nwon&#39;t be stepped on or<br/>\nknocked over.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I am also much more thoughtful<br/>\n&gt; in choosing new toys (do they really need that?)<br/>\n<br/>\n </span></blockquote>Imagine how you would feel if someone critiqued everything you wanted based<br/>\nwhether or not they thought you should have it - that&#39;s how it can feel to kids<br/>\nto be subjected to this kind of parental decision making. It can feel pretty<br/>\nharsh and dismissive of their interests.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I have seen how simplifying their environment has had a positive effect<br/>\n&gt; on their disposition and behavior.<br/>\n<br/>\n </span></blockquote>That&#39;s something which was true for Ray - he had a hard time searching for things and it would really stress him out, so having a fairly tidy home with his things, in particular, put away consistently where he could find them was really helpful in terms of him coping. <br/>\n<br/>\nMo, on the other hand, will go upend a basket and spread out the contents as soon as I&#39;m done picking up - not to be mean, but because she prefers to have her things spread out. She can find things more easily that way, see patterns and get ideas from overlooking a spread of mixed stuff. When things get too cluttered - when it&#39;s hard to walk without stepping on a project or knocking something down - I&#39;ll go in and tidy up, and at that point she&#39;s okay with it. She&#39;s able to start the process all over again with a fresh slate, as it were. But having things spread out works better for her than having them organized, much of the time. <br/>\n<br/>\nThat&#39;s the trouble with taking an idea and turning it into a rule - it falls apart when you try to make it work in too many different situations. Better to step back to a principle of helping the people you love get what they need (and you, too!) in ways that work for them. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Organizing toys","postDate":"1313186758","msgId":62324,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMyNjE4NTI5LUE5RjgtNDY4Ni1BNDM3LUE2NkZFRDUzRTM5RUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDEzMTMxNzc3NjQuOTM0NTkuWWFob29NYWlsTmVvQHdlYjgxNTA0Lm1haWwubXVkLnlhaG9vLmNvbT4=","referencesHeader":"PGoyMTBuOCtlcGM3QGVHcm91cHMuY29tPiA8ajIza2RnK3BnajNAZUdyb3Vwcy5jb20+IDwxMzEzMTc3NzY0LjkzNDU5LllhaG9vTWFpbE5lb0B3ZWI4MTUwNC5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":62322,"nextInTopic":62326,"prevInTime":62322,"nextInTime":62326,"topicId":62314,"numMessagesInTopic":0,"msgSnippet":"-=-Is it about what you think they need or what they want/need?? I think memberships to the museum and trips to somewhere fun are great , unless the child is","messageBody":"<div id=\"ygrps-yiv-1428133888\">-=-Is it about what you think they need or what they want/need??<br/>\nI think memberships to the museum and trips to somewhere fun are great , unless<br/>\nthe child is disappointed because they envision their birthday full of presents and toys. Your kids are young.<br/>\nThe 2 year old probably will be happy with anything at this point. Maybe even your 4 year old  if he is easy going.<br/>\nMy kids , in  the other hand, always new exactly what they wanted and it was up to them, within our capabilities,<br/>\nto choose what they wanted.<br/>\nAs to other giving presents I can give an idea if solicited but I find it in poor taste to tell someone what they can give my kids as a present , unless asked specifically.-=-<br/>\n<br/>\nI agree.<br/>\n<br/>\nWe bought  museum memberships and zoo memberhips for our family, and used them a lot.   When I go to the party of a friend (young or old), I think hard about what I know about them and about me and I get a gift that will  have something to do with that relationship--it will be a gift from me.  When people invite me to weddings and tell me where they&#39;re registered, I figure that&#39;s for half-strangers or the unimaginative.  If I&#39;m not close with them, I&#39;ll buy them some toaster or blender, but if it&#39;s someone I have known for a long time, I give them something that I know for sure they could use or would like or would last them a long time and help them think of me or our family.  I was at the birthday part of a ten year old just a few nights ago. :-)  I think about these things, for real.<br/>\n<br/>\n-=-One can say that my son did not need over 50 Thomas the Train Engines,  and that my daughter certainly does not need all the MY Little Ponies and barbies she has.-=-<br/>\n<br/>\nI have over 50 books, a few hundred DVD&#39;s and CDs, and many hundreds of record albums.  I&#39;m thinking of the latter because I have a request from someone who wants the words (and maybe sound files) to a couple of songs off a 1955 Mickey Mouse Club album I have, that I mentioned somewhere online and he found.<br/>\n<br/>\nMy website doesn&#39;t need over 50 pages, I guess, but it has 900 or so.<br/>\n<br/>\nMy husband has about fifteen hammers and half a dozen hand axes.  The other day he was in showing me that he left an axe out and the leather-wrapped handle had taken some damage from cold and heat.  He left it out before he had shoulder surgery, in the winter.  It stayed where he left it until last week.  It&#39;s really not like him to leave a tool out, and we both liked that one.  It was quite a long discussion about something we&#39;re both interested in.  It&#39;s being gradually restored (we hope) with oil soaks.<br/>\n<br/>\n-=-Oh and they have been very careful with their toys. <br/>\nMaybe they have learned by watching me take care of their toys  and seeing me help them they care of them without complaining or nagging them ( which not to say I do not slip sometimes but it is rare and I have gotten good at thinking before saying it and stopping it before I do say anything  ) .<br/>\nMaybe it is just personality.-=-<br/>\n<br/>\nMy kids too.  Might have been genetic/personality.<br/>\n<br/>\nFirst, I took care of their toys for them.  Then they helped me.  Then I helped them. Now they do it on their own.  It was a gradual changeover, but always, their toys were taken care of.  We had a parts-drawer (now it&#39;s down to a small box on a shelf) for game markers, cards, pieces of sets of anything that had become separated from the whole.  The next time that game or puzzle or toy was taken down, one of us would remember that one of the pieces was in that drawer, or if a piece of something was gone, someone would check the drawer.<br/>\n<br/>\nThe ability to recognize which generation of My Little Pony, or to care about 50+ Matchbox cars, or to know or care about the differences in flowers, or silverware patterns, or birds, or fonts or the tastes of spices--that&#39;s what Howard Gardner calls Nature Intelligence.  Some people have a lot of that.  Some don&#39;t.  Kids who have that are likely to be collectors.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Organizing toys","postDate":"1313177764","msgId":62322,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTMxNzc3NjQuOTM0NTkuWWFob29NYWlsTmVvQHdlYjgxNTA0Lm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PGoyM2tkZytwZ2ozQGVHcm91cHMuY29tPg==","referencesHeader":"PGoyMTBuOCtlcGM3QGVHcm91cHMuY29tPiA8ajIza2RnK3BnajNAZUdyb3Vwcy5jb20+"},"prevInTopic":62321,"nextInTopic":62324,"prevInTime":62321,"nextInTime":62324,"topicId":62314,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-660398880\">&lt;&lt;&lt;&lt;&lt;&lt;&lt; I am also much more thoughtful<br/>\n<br/>\nin choosing new toys (do they really need that?) and when asked what my<br/>\nkids want for their birthdays, I request museum memberships or trips to<br/>\nTraintown.&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nIs it about what you think they need or what they want/need??<br/>\nI think memberships to the museum and trips to somewhere fun are great , unless<br/>\nthe child is disappointed because they envision their birthday full of presents and toys. Your kids are young.<br/>\nThe 2 year old probably will be happy with anything at this point. Maybe even your 4 year old  if he is easy going.<br/>\nMy kids , in  the other hand, always new exactly what they wanted and it was up to them, within our capabilities,<br/>\nto choose what they wanted.<br/>\nAs to other giving presents I can give an idea if solicited but I find it in poor taste to tell someone what they can give my kids as a present , unless asked specifically.<br/>\n<br/>\n<br/>\n-=-=-=-=-=-=-=-=-=-=<br/>\n&lt;&lt;&lt;&lt;&lt;&lt; I<br/>\nfound we really didn&#39;t need over 50 matchbox cars and trucks or over 30<br/>\nitems for the grocery cart, etc., so by cutting down on the multiples,<br/>\norganizing got a little easier.&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n<br/>\nOne can say that my son did not need over 50 Thomas the Train Engines,  and that my daughter certainly does not need all the MY Little Ponies and barbies she has.<br/>\nBut they wanted it and I could get it. Most out barbies were purchased for about 5o cents and the ponies even as cheap are a couple cents each.<br/>\nThey absolutely loved collecting them and I had as much fun learning about them just because it gave them joy. Gigi will tell you what Generation a pony is just by looking at it.<br/>\nWe spent hours researching ponies and engines and it led us to so many different things.<br/>\nSure there are limits in all they can get. We are not wealthy so we plan and save and look for deals.<br/>\nPeople do not say &quot; That stamp collector does not need all those 300 stamps&quot; Why is it that it is admired that an adult has a collection but  when it comes to a child the parent decides they do not &quot;need&quot; all those .....fill in the blanks??<br/>\n<br/>\n<br/>\n<br/>\n-=-=-=-=-=-=-=-=-=-==<br/>\n&lt;&lt;&lt;&lt;&lt;I have seen how simplifying their environment has had a positive effect<br/>\non their disposition and behavior.  It is true that they share easier<br/>\n(even though there are fewer toys!) and that they are calmer and less<br/>\nstressed than they used to be when playing at home.  And so am I.&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nMaybe you are the one calmer and less stressed and they feel that as a reaction to you and not to having less toys.<br/>\nBeing more calm and less stressed it good.<br/>\n<br/>\nSome kids are OK with less toys and do not get upset if they have a toy that is no longer found.<br/>\nI have to say that my kids remember every little thing they have.<br/>\nThey have given thing away with no problems.<br/>\nBut when my son was about 4 I talked to him about giving his Bob the Builder toys he no longer played with and he was fine with it until a few months later when he really wanted them back.  he was to young to understand the permanence of his toys being gone. He could not foresee wanting them in the future.<br/>\nNow at 9 he is older and if he decides he is done with something than he  has no problem selling or giving it away.<br/>\n<br/>\nOh and they have been very careful with their toys. <br/>\nMaybe they have learned by watching me take care of their toys  and seeing me help them they care of them without complaining or nagging them ( which not to say I do not slip sometimes but it is rare and I have gotten good at thinking before saying it and stopping it before I do say anything  ) .<br/>\nMaybe it is just personality.<br/>\n<br/>\nAlex Polikowksy<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":450744032,"authorName":"julieswebmail","from":"&quot;julieswebmail&quot; &lt;julieswebmail@...&gt;","profile":"julieswebmail","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Organizing toys","postDate":"1313166576","msgId":62321,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGoyM2tkZytwZ2ozQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGoyMTBuOCtlcGM3QGVHcm91cHMuY29tPg=="},"prevInTopic":62319,"nextInTopic":62322,"prevInTime":62320,"nextInTime":62322,"topicId":62314,"numMessagesInTopic":0,"msgSnippet":"My kids were just a little older (4.5 & 2) when I read Simplicity Parenting about 6 months ago...I loved the book and it is one of the few that I have read","messageBody":"<div id=\"ygrps-yiv-1963445873\">My kids were just a little older (4.5 & 2) when I read Simplicity<br/>\nParenting about 6 months ago...I loved the book and it is one of the few<br/>\nthat I have read that has really influenced the decisions I make as a<br/>\nparent.  My house was completely over-run by toys and &#39;stuff&#39; (mine and<br/>\ntheirs.)  We went through the house, from space to space, clearing out<br/>\nwhat we didn&#39;t use or want -- I did this with my older son when we were<br/>\ngoing through toys, so he helped by making his own decisions on what to<br/>\nkeep, store, sell or trash.  He also participated in the garage sale<br/>\nthat we had a few weeks later where he opted to keep a few things he&#39;d<br/>\nlet go of earlier, and I figured we could re-visit weather or not to<br/>\nkeep them at a later time.  I also stored a lot of toys, and every once<br/>\nin a while, he asks for them, so we go hunting in the garage or shed and<br/>\nfind something &#39;new&#39; for him to enjoy.  I am also much more thoughtful<br/>\nin choosing new toys (do they really need that?) and when asked what my<br/>\nkids want for their birthdays, I request museum memberships or trips to<br/>\nTraintown.<br/>\nAs for organizing the toys we still have (which are WAY more than S.P.<br/>\nwould advise, but I take from these books what works for me and my<br/>\nfamily and leave the rest behind,)  I have used some S.P. advice and try<br/>\nto keep the toys in baskets, bins or boxes that are often stored in<br/>\ncabinets or closets to cut down on visual clutter.  The kids are<br/>\nbecoming more aware of the work it takes to keep the toys from getting<br/>\nlost or broken and are starting to help a little more with putting them<br/>\naway so they&#39;ll know where to find their toys when they want them.  I<br/>\nfound we really didn&#39;t need over 50 matchbox cars and trucks or over 30<br/>\nitems for the grocery cart, etc., so by cutting down on the multiples,<br/>\norganizing got a little easier.<br/>\nI have seen how simplifying their environment has had a positive effect<br/>\non their disposition and behavior.  It is true that they share easier<br/>\n(even though there are fewer toys!) and that they are calmer and less<br/>\nstressed than they used to be when playing at home.  And so am I.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Organizing toys","postDate":"1313102873","msgId":62319,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTMxMDI4NzMuNzQ2Ni5ZYWhvb01haWxOZW9Ad2ViODE1MDQubWFpbC5tdWQueWFob28uY29tPg==","inReplyToHeader":"PDEzMTMxMDIzNjkuMzU3MDkuWWFob29NYWlsTmVvQHdlYjgxNTA1Lm1haWwubXVkLnlhaG9vLmNvbT4=","referencesHeader":"PGoyMTBuOCtlcGM3QGVHcm91cHMuY29tPiA8MTMxMzEwMDMxMi42MzEyNi5ZYWhvb01haWxSQ0B3ZWI4MzUwMy5tYWlsLnNwMS55YWhvby5jb20+IDwxMzEzMTAyMzY5LjM1NzA5LllhaG9vTWFpbE5lb0B3ZWI4MTUwNS5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":62318,"nextInTopic":62321,"prevInTime":62318,"nextInTime":62320,"topicId":62314,"numMessagesInTopic":0,"msgSnippet":"  Sorry I do not know why yahoo  connected the two links. I had one in each new line !!   I was going to come post the link to those videos: ","messageBody":"<div id=\"ygrps-yiv-484428825\"> <br/>\n<br/>\nSorry I do not know why yahoo  connected the two links. I had one in each new line !!&#92;&#92;&#92;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  <br/>\nI was going to come post the link to those videos:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.youtube.com/watch?v=vuoQv5Q1oNY\">http://www.youtube.com/watch?v=vuoQv5Q1oNY</a><br/>\n-=-=-=--=<br/>\n<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.youtube.com/watch?v=SOXorXqffSE\">http://www.youtube.com/watch?v=SOXorXqffSE</a><br/>\n<br/>\nHope it helps with ideas that you can  use.<br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[{"url":"http://www.youtube.com/embed/SOXorXqffSE?wmode=opaque","type":"VIDEO"},{"url":"http://www.youtube.com/embed/vuoQv5Q1oNY?wmode=opaque","type":"VIDEO"}]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Organizing toys","postDate":"1313102369","msgId":62318,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTMxMDIzNjkuMzU3MDkuWWFob29NYWlsTmVvQHdlYjgxNTA1Lm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PDEzMTMxMDAzMTIuNjMxMjYuWWFob29NYWlsUkNAd2ViODM1MDMubWFpbC5zcDEueWFob28uY29tPg==","referencesHeader":"PGoyMTBuOCtlcGM3QGVHcm91cHMuY29tPiA8MTMxMzEwMDMxMi42MzEyNi5ZYWhvb01haWxSQ0B3ZWI4MzUwMy5tYWlsLnNwMS55YWhvby5jb20+"},"prevInTopic":62317,"nextInTopic":62319,"prevInTime":62317,"nextInTime":62319,"topicId":62314,"numMessagesInTopic":0,"msgSnippet":"I was going to come post the link to those videos: http://www.youtube.com/watch?v=vuoQv5Q1oNYhttp://www.youtube.com/watch?v=SOXorXqffSE Hope it helps with","messageBody":"<div id=\"ygrps-yiv-1870588183\">I was going to come post the link to those videos:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.youtube.com/watch?v=vuoQv5Q1oNYhttp://www.youtube.com/watch?v=SOXorXqffSE\">http://www.youtube.com/watch?v=vuoQv5Q1oNYhttp://www.youtube.com/watch?v=SOXorXqffSE</a><br/>\n<br/>\nHope it helps with ideas that you can  use.<br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n <br/>\n <br/>\n <br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Lisa E Biesemeyer &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:l.biesemeyer@...\">l.biesemeyer@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nSent: Thursday, August 11, 2011 5:05 PM<br/>\nSubject: Re: [AlwaysLearning] Organizing toys<br/>\n<br/>\n<br/>\n  <br/>\nA while back, Alex posted a video of her playroom with see-through plastic boxes <br/>\nas storage containers. It is helpful to see what a potentially out of <br/>\nsorts/chaotic space (though definitely only one perspective of that space, for <br/>\nsure) looks like once everything has a place. I can&#39;t seem to find the video, <br/>\nbut I think this is the thread and Alex&#39;s post that led to the <br/>\nvideo: <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/AlwaysLearning/message/59766\">http://groups.yahoo.com/group/AlwaysLearning/message/59766</a><br/>\n<br/>\nIn our home, in addition to  the large see-through plastic bins like Alex <br/>\nrecommends, I use large cubby shelves and cloth baskets that can be purchased at <br/>\nTarget. Here&#39;s a link to an example: the cubbies: <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.target.com/02-033-RiverRidge-Kids-Storage-Cubby/dp/B002FK8LIG/ref=sc_qi_detailbutton\">http://www.target.com/02-033-RiverRidge-Kids-Storage-Cubby/dp/B002FK8LIG/ref=sc_qi_detailbutton</a><br/>\n<br/>\nthe <br/>\nboxes: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.target.com/ClosetMaid-2-pk-Fabric-Drawers-Green/dp/B004I41VPW/ref=sc_qi_detailbutton\">http://www.target.com/ClosetMaid-2-pk-Fabric-Drawers-Green/dp/B004I41VPW/ref=sc_qi_detailbutton</a><br/>\n<br/>\nI also keep a &quot;catch all&quot; basket in each major room of the house (i.e. kitchen <br/>\nand living room) where individual toys that make their way out of the playroom <br/>\nor bedrooms can be tossed when doing a pick up.<br/>\n<br/>\nLisa B<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[{"url":"http://www.youtube.com/embed/vuoQv5Q1oNYhttp?wmode=opaque","type":"VIDEO"}]},{"userId":233098946,"authorName":"Lisa E Biesemeyer","from":"Lisa E Biesemeyer &lt;l.biesemeyer@...&gt;","profile":"l.biesemeyer@sbcglobal.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"1"},"subject":"Re: [AlwaysLearning] Organizing toys","postDate":"1313100312","msgId":62317,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTMxMDAzMTIuNjMxMjYuWWFob29NYWlsUkNAd2ViODM1MDMubWFpbC5zcDEueWFob28uY29tPg==","inReplyToHeader":"PGoyMTBuOCtlcGM3QGVHcm91cHMuY29tPg==","referencesHeader":"PGoyMTBuOCtlcGM3QGVHcm91cHMuY29tPg=="},"prevInTopic":62315,"nextInTopic":62318,"prevInTime":62316,"nextInTime":62318,"topicId":62314,"numMessagesInTopic":0,"msgSnippet":"A while back, Alex posted a video of her playroom with see-through plastic boxes as storage containers. It is helpful to see what a potentially out of ","messageBody":"<div id=\"ygrps-yiv-2097398484\">A while back, Alex posted a video of her playroom with see-through plastic boxes <br/>\nas storage containers. It is helpful to see what a potentially out of <br/>\nsorts/chaotic space (though definitely only one perspective of that space, for <br/>\nsure) looks like once everything has a place. I can&#39;t seem to find the video, <br/>\nbut I think this is the thread and Alex&#39;s post that led to the <br/>\nvideo: <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/AlwaysLearning/message/59766\">http://groups.yahoo.com/group/AlwaysLearning/message/59766</a><br/>\n<br/>\nIn our home, in addition to  the large see-through plastic bins like Alex <br/>\nrecommends, I use large cubby shelves and cloth baskets that can be purchased at <br/>\nTarget. Here&#39;s a link to an example: the cubbies: <br/>\n <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.target.com/02-033-RiverRidge-Kids-Storage-Cubby/dp/B002FK8LIG/ref=sc_qi_detailbutton\">http://www.target.com/02-033-RiverRidge-Kids-Storage-Cubby/dp/B002FK8LIG/ref=sc_qi_detailbutton</a><br/>\n<br/>\nthe <br/>\nboxes: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.target.com/ClosetMaid-2-pk-Fabric-Drawers-Green/dp/B004I41VPW/ref=sc_qi_detailbutton\">http://www.target.com/ClosetMaid-2-pk-Fabric-Drawers-Green/dp/B004I41VPW/ref=sc_qi_detailbutton</a><br/>\n<br/>\n<br/>\nI also keep a &quot;catch all&quot; basket in each major room of the house (i.e. kitchen <br/>\nand living room) where individual toys that make their way out of the playroom <br/>\nor bedrooms can be tossed when doing a pick up.<br/>\n<br/>\nLisa B<br/>\n<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Organizing toys","postDate":"1313082143","msgId":62315,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNCQTM1QUZDLUJEMzktNDQ1Mi05MzAwLUQ4RDI2OTM3RjdDNEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGoyMTBuOCtlcGM3QGVHcm91cHMuY29tPg==","referencesHeader":"PGoyMTBuOCtlcGM3QGVHcm91cHMuY29tPg=="},"prevInTopic":62314,"nextInTopic":62317,"prevInTime":62314,"nextInTime":62316,"topicId":62314,"numMessagesInTopic":0,"msgSnippet":"-=-I d love to hear how people are able to accommodate it all. Is it a matter of having a good organization system? Change of thinking in how","messageBody":"<div id=\"ygrps-yiv-918935725\">-=-I&#39;d love to hear how people are able to accommodate it all. Is it a matter of having a good organization system? Change of thinking in how mess/clutter/stuff is perceived? Will it get better as my kids get older? -=-<br/>\n<br/>\nI still have some toys in the way and my kids are grown, but to be fair, I had toys myself before I had kids. :-)   All the three questions above are &quot;yes!&quot;  It gets better when kids get older.  It can help to collect &quot;xerox boxes&quot; (boxes paper comes in, with lids that come on and off separately), or plastic see-through bins.  It helps to have a store room or shed (I live where basements and attics are rare), and to put some things away sometimes, to be brought out again later.<br/>\n<br/>\nPlastic laundry baskets can be a huge help for sorting and transporting, because they can be moved, stacked (whether full or empty), gone through (dumped, refilled) by young children).  <br/>\n<br/>\nWe used shelves and boxes for toys, with a picture (printed out or drawn) of what kind of things went in there.  My husband made shelves that would fit xerox boxes, so we used those for &quot;drawers&quot; and transport.   (That shelf is in my office right now, but without boxes on it; he had made me another shelf I still have too, with shallower shelves designed for the lids of xerox boxes, so I could sort papers and have projects in those, and I still use that shelf and method for my receipts for book sales, and computer papers/cords/disks/supplies.)<br/>\n<br/>\nSo I think it will change, but the method you come up with might outlive your children in your house, and might live with them in their own adult lives later.  <br/>\n<br/>\nThe change in thinking isn&#39;t a big one.  It&#39;s about choices and priorities.  People who join a &quot;simplicity&quot; club want to justify living in an empty house, streamlined, one bowl, whatever all.  I doubt many of them are unschoolers. :-)   We had neighbors whose young daughter (Holly&#39;s age, pre-school to eight, and then we moved) was VERY artistic, and when we gave her (nice, adult) water colors for her 7th-or-so birthday, the mom was very bummed and said she couldn&#39;t paint in the house; she needed to do that at school.  She had been doing it at our house, and was good.<br/>\n<br/>\nSo if learning is important to you, and a decision to keep or toss is &quot;more learning/less learning,&quot; then don&#39;t toss it.    People can&#39;t have more than one priority.   Then there are secondary things, and tertiary, but it&#39;s good to be clear about which takes precedence so you can make decisions without feeling stuck.<br/>\n<br/>\nThis is kind of a side thought, and won&#39;t work with special toys at all:<br/>\n<br/>\nOne consideration some people make work pretty well is to give things away freely--freecycle or charities.  And then get more, later, if they pick up that hobby again.  Yarn, paper, small tools even.    In some cases it might be cheaper than storage (financially or emotionally) to give away the whole batch of stuff and then IF you ever pick that hobby or skill/practice/art up again, get new supplies.  <br/>\n<br/>\nI have ancient dried-up calligraphy supplies I probably should have given away years and years ago.  I have a wet saw (for tile) that cost less than $100.  I&#39;ve done two projects.  That makes it cheaper than rental, and it takes space on the shelf.  I should give it away.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":325777836,"authorName":"VanessaL","from":"&quot;VanessaL&quot; &lt;fancyness07@...&gt;","profile":"fancyness07","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Organizing toys","postDate":"1313080872","msgId":62314,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGoyMTBuOCtlcGM3QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":62315,"prevInTime":62313,"nextInTime":62315,"topicId":62314,"numMessagesInTopic":0,"msgSnippet":"My kiddos are 3 and 1 so I m not sure how much of this is because they are little but I m having a hard time with the too much stuff issue. I d love to hear","messageBody":"<div id=\"ygrps-yiv-108055072\">My kiddos are 3 and 1 so I&#39;m not sure how much of this is because they are little but I&#39;m having a hard time with the &quot;too much stuff&quot; issue.<br/>\n<br/>\nI&#39;d love to hear how people are able to accommodate it all. Is it a matter of having a good organization system? Change of thinking in how mess/clutter/stuff is perceived? Will it get better as my kids get older? <br/>\n<br/>\nI made the mistake of joining a Simplicity Parenting book club with some good friends of mine. It&#39;s been good in one way because I see the lack of regard to a child&#39;s (and husband&#39;s) feelings when they talk of purging all the toys and stuff, and it reinforces how much I don&#39;t want to be that way with my own family. (it&#39;s also made me realize how different the paths my friends and I are choosing and that has been surprising) But I still feel like my family could benefit from a better system. We have lots of closets, shelves and space for many things but it migrates everywhere, gets lost, broken, and feels like my whole house has turned into a preschool/toy store, except one with less order.<br/>\n<br/>\nI guess in a way it is our &quot;preschool&quot; since we&#39;re home so much but I&#39;m overwhelmed when I look around and every surface is covered in things.<br/>\n<br/>\nShould I be breaking it down into smaller bits and making positive choices about them separately instead of lumping it into one big issue? Maybe find a way to organize the train set instead of the whole playroom?<br/>\n<br/>\nThanks,<br/>\nVanessa</div>","specialLinks":[]}],"prevTopicId":62334,"nextTopicId":62367}}