{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"monkeycoop@aol.com","from":"monkeycoop@...","replyTo":"LIST","senderId":"R8LwiIIBZ1qiQAuCeAxQknzNTGYgd1w9kcGPxH30P3QXScIwb-pRqDAkRNxpI5DI8iGGE3w5R6Io","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Microsoft joke","postDate":"953958436","msgId":7290,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYxLjI0NTY5MDAuMjYwZDlhMjRAYW9sLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":7289,"nextInTime":7291,"topicId":7290,"numMessagesInTopic":0,"msgSnippet":"Hey gang, Here s a great Microsoft joke I got from my brother (he runs with scissors also): At a recent computer expo (COMDEX), Bill Gates reportedly compared","messageBody":"<div id=\"ygrps-yiv-968588464\">Hey gang,<br/>\n<br/>\nHere&#39;s a great Microsoft joke I got from my brother (he runs with scissors <br/>\nalso):<br/>\n<br/>\nAt a recent computer expo (COMDEX), Bill Gates reportedly compared the <br/>\ncomputer industry with the auto industry and stated, &quot;(i)f GM had kept up <br/>\nwith the technology like the computer industry has, we would all be driving <br/>\n$25.00 cars that got 1,000 miles to the gallon.&quot;<br/>\nIn response to Bill&#39;s comments, General Motors issued a press release <br/>\nstating: If GM had developed technology like Microsoft, we would all be <br/>\ndriving cars with the following characteristics:<br/>\n1. For no reason whatsoever, your car would crash twice a day.<br/>\n2. Every time they repainted the lines in the road, you would have to buy a <br/>\nnew car.<br/>\n3. Occasionally your car would die on the freeway for no reason. You would <br/>\nhave to pull over to the side of the road, close all of the windows, shut off <br/>\nthe car, restart it, and reopen the windows before you could continue. For <br/>\nsome reason you would simply accept this.<br/>\n4. Occasionally, executing maneuver such as a left turn would cause your car <br/>\nto shut down and refuse to restart, in which case you would have to reinstall <br/>\nthe engine.<br/>\n5. Only one person at a time could use the car unless you bought &quot;CarNT,&quot; but <br/>\nthen you would have to buy more seats.<br/>\n6. Macintosh would make a car that was powered by the sun, was reliable, five <br/>\ntimes as fast and twice as easy to drive - but it would only run on five <br/>\npercent of the roads.<br/>\n7. The oil, water temperature and alternator warning lights would all be <br/>\nreplaced by a single &quot;general protection fault&quot; warning light.<br/>\n8. New seats would force everyone to have the same sized butt.<br/>\n9. The airbag system would ask &quot;are you sure?&quot; before deploying.<br/>\n10. Occasionally, for no reason whatsoever, you car would lock you out and <br/>\nrefuse to let you in until you simultaneously lifted the door handle, turned <br/>\nthe key and grabbed hold of the antenna.<br/>\n11. GM would require all car buyers to also purchase a deluxe set of Rand <br/>\nMcNally road maps (now a GM subsidiary), even though they neither need nor <br/>\nwant them. Attempting to delete this option would immediately cause the cars <br/>\nperformance to diminish by 50 percent or more. Moreover, GM would become a <br/>\ntarget for investigation by the Justice Department.<br/>\n12. Every time GM introduced a new car, car buyers would have to learn to <br/>\ndrive all over again because none of the controls would operate in the same <br/>\nmanner as the old car.<br/>\n13. You&#39;d have to press the &quot;start&quot; button to turn the engine off.<br/>\n<br/>\n<br/>\nKIM<br/>\n***runs with scissors***</div>","specialLinks":[]}],"prevTopicId":7278,"nextTopicId":7293}}