{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":5047879,"authorName":"Joseph Fuerst","from":"&quot;Joseph Fuerst&quot; &lt;fuerst@...&gt;","profile":"jsf491","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Spring Break","postDate":"1017859142","msgId":34053,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMmMwMWMxZGIzZSRkMzgxMzQ4MCRlYjg5ODUwYUBwYXZpbGlvbj4=","referencesHeader":"PE9FODRFcFRYNVYzR3lrQmJLUDcwMDAyZTVhM0Bob3RtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":34052,"nextInTime":34054,"topicId":34053,"numMessagesInTopic":0,"msgSnippet":"All our local schools are out for Spring Break......and it s driving me crazy!! One neighbor Mom started a 10am-3pm job recently.  Her disabled Hubby is home,","messageBody":"<div id=\"ygrps-yiv-1355547943\">All our local schools are out for Spring Break......and it&#39;s driving me<br/>\ncrazy!!<br/>\n<br/>\nOne neighbor Mom started a 10am-3pm job recently.  Her disabled Hubby is<br/>\nhome,  but he&#39;s like a non-entity.  I&#39;m feeling like the taken-for-granted<br/>\nSAHM these days.  Her DD was here ALL day Monday.  Tuesday I planned a zoo<br/>\ntrip,  but Courtney AND her brother showed up on my doorstep at 10:03 am!!<br/>\nWe still went,  but it took almost an hour and a half to get ready because<br/>\nthose two were hanging around outside and my young ones were easily<br/>\ndistracted.<br/>\n    Today I planned our (usual) weekly library trip padded with a few<br/>\nerrands.  Coutney showed up at 10:06am.  Jenna,  the 3yo,  especially didn&#39;t<br/>\nwant to got to the library and fought so much I gave up.  The toddler has a<br/>\ncold....anyhow,  I gave up on the library trip &#39;til this evening.  Decided<br/>\nto let Courtney play here until lunchtime.   Well,  the kid wouldn&#39;t go home<br/>\nand wouldn&#39;t say why.  i asked my 7 yr old to talk to her about what&#39;s going<br/>\non that she doesn&#39;t want to be at her house.  She says maybe because her<br/>\ndad&#39;s always yelling at her,  but I asked her to talk it over with her<br/>\nanyway.<br/>\n    So I need to confront this kid&#39;s mother before she assumes I&#39;m a free<br/>\nsitter service for the summer.<br/>\n    I wish I weren&#39;t so resentful and bothered by this.....but I am.<br/>\n    The other &#39;problem&#39; I&#39;m having is that the old fogey types on the street<br/>\nseem to come to balme me for all their kid issues.   This is probably<br/>\nbecause I&#39;m the only parent who sits outside to &#39;be&#39; there,  to keep my<br/>\ntoddler and three yr old safe,  to remind the older ones about appropriate<br/>\nparameters.  One lady asked me why the girls have to scream so much.  They<br/>\nwere all (about 10) doing gymnastics things,  rolling on the ground ad<br/>\nhaving fun.  I didn&#39;t register any screaming,  so I&#39;m either deaf or<br/>\ntolerant.  (I was in her yard to re-direct my toddler out of her yard.)  I<br/>\nexplained that I was getting him,  apologized if he and I had disturbed<br/>\nher....and replied about the screaming that it&#39;s the first day of Spring<br/>\nBreak for those kids (all freed from the repression of the school schedule -<br/>\nand uniform for some)  and that since it was a beautiful day to romp<br/>\noutside,  that&#39;s just what they neede to do.   Then I walked away....and<br/>\nthought   SHEEEEESH!,  lady,  you have two dds.  Do you not remember?  Did<br/>\nyours never squeal with the joy of jumpimg around?  Do you forget when the<br/>\nyoungest turns 16?  WHy do you live in this neighborhood anyway?  Do you<br/>\nthink I&#39;m responsible for you being disturbed?  Have you considered getting<br/>\nbetter windows?  How &#39;bout thanking me for being the ONE adult who is<br/>\nactually there and available if trouble begins to brew or if there are<br/>\nquestions and things going on?<br/>\n<br/>\nSusan,    frustrated and venting......and planning to go out by myself while<br/>\ndd is at soccer practice this evening in the hope of re-couping some peace<br/>\nand serenity....And NOT due to stress from the children,  but FROM THE CRAZY<br/>\nADULTS!!<br/>\nSusan</div>","specialLinks":[]}],"prevTopicId":33996,"nextTopicId":34081}}