{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Thomas and Nanci Kuykendall","from":"Thomas and Nanci Kuykendall &lt;tn-k4of5@...","replyTo":"LIST","senderId":"erlZhct8FDt-x8obXEnY29JYz7e11L9twOL2sTVel3n3qKtIUhxsrt17VZL-QHFOjBgHJzDaYPGJBV3g32h8Dd5QFJ4WVZeEYxkWWYrfDFJXObZ1lxPZk58","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: laaate nights and careers","postDate":"937862993","msgId":3068,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4yMTMuMzA2OC45NTkyNjk3NDJAZUdyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":3067,"nextInTime":3069,"topicId":3068,"numMessagesInTopic":0,"msgSnippet":"Then I need time to myself to just wind down from the ... I often have insomnia, which I think may be partially caused by the need for down time at the end of","messageBody":"<div id=\"ygrps-yiv-1979972529\">Then I need time to myself to just wind down from the<br/>\n<blockquote><span title=\"ireply\"> &gt;day. Of course, this is the time that my husband wants my attention. Has<br/>\n&gt;anyone found a solution to this type of situation?  Is this a<br/>\n&gt;common problem for home/unschoolers, when mom&#39;s time comes last at the end<br/>\n&gt;of the day?<br/>\n&gt;<br/>\n&gt;Olivia<br/>\n<br/>\n </span></blockquote>I often have insomnia, which I think may be partially caused by the need<br/>\nfor down time at the end of the day.  My children are 1.5 and 2.5 and<br/>\nreally are exhausting.  They cannot even get a drink of water or use the<br/>\ntoilet by themselves at this age, and it just is really draining, the<br/>\nneediness.  Since I am usually up late, my DH gets up with the boys in the<br/>\nmorning, changes diapers and gets them breakfaast during his morning<br/>\nroutine.  Then he sets them up with a movie or Sesame Street, etc and gets<br/>\nme up before he leaves.  In this way I get my time to myself in the<br/>\nevening.  While not a perfect solution, it works for now.  <br/>\n<br/>\nMy DH is happy in his job, but it took a lot to get there.  When we met (at<br/>\nwork) and married he was the lowest man on the totem pole at work and was<br/>\nway underpaid for his job title.  He took a promising &quot;temporary&quot; position<br/>\n(per diem with the same Co.) two states away from us in Idaho (we were in<br/>\nWA at the time.)  Even though I was 5 months into a VERY difficult<br/>\npregnancy and had a hyperactive 10 month old toddler in tow, I agreed to do<br/>\nthis move for his career.  After many difficulties, and me taking care of<br/>\nall the move details, as he had to start work right away, I began pre-term<br/>\nlabor at six months.  I managed to hang onto the baby despite almost<br/>\ncontinous labor and other problems through that long first Idaho winter and<br/>\nhe was born healthy the following spring.<br/>\n<br/>\nWe then recieved news that his name was on the team for the three year<br/>\ncontract extension.  We figured if he could not find a permanent position<br/>\nwith his current company in that time, he could find work with one of the<br/>\nother companies on the site here.  So we looked for and bought a house.<br/>\nSix days after we closed and moved in, his contract was cancelled due to<br/>\ninternal politics.  Our only choice was to move AGAIN, this time back to my<br/>\nparents&#39; home in WA (picture &quot;The Scream&quot; painting.)  The biys were about<br/>\n18 months and 3 months old at this time.  After nine months of extreme<br/>\nstress, during which time we held onto our house despite my mother advising<br/>\nus constantly to sell and DH looked for work long distance, he finally<br/>\nfound work back here and we were able to move back into our house (which<br/>\nwas still full of our things - mostly still packed) in March of this year.  <br/>\n<br/>\nHe is now enjoying his position and making much better pay.  But, like I<br/>\nsaid, it took a lot to get here.  He is still looking into home based<br/>\nbusiness, just because he would like to spend more time with us at home.<br/>\nHowever, his schedule is pretty flexible, and that allows us to spend more<br/>\ntime together (occassional long lunches during nap-times, working from home<br/>\nonce every week or two, etc.)<br/>\n<br/>\nNanci K. in Idaho</div>","specialLinks":[]}],"prevTopicId":3055,"nextTopicId":3053}}