{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Repost -Re: Subject: young, innocent kids wanting to watch sexually heavy movies","postDate":"1084371768","msgId":93909,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk3LjQ3Y2FmOTdhLjJkZDM4ZDM4QGFvbC5jb20+"},"prevInTopic":93868,"nextInTopic":0,"prevInTime":93908,"nextInTime":93910,"topicId":93868,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/11/04 2:28:10 PM, Diamondlady1025@hotmail.com writes: ","messageBody":"<div id=\"ygrps-yiv-1771534702\">In a message dated 5/11/04 2:28:10 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Diamondlady1025@...\">Diamondlady1025@...</a> writes:<br/>\n<br/>\n&lt;&lt; My 13 yo ds turned to my 7 yo and said &quot;Do you <br/>\n<br/>\nwant to go play Dr. Mario in Uncle Rob&#39;s room?&quot; &gt;&gt;<br/>\n<br/>\nI&#39;d rather play Dr. Mario than see Kevin Costner ANYtime.<br/>\n<br/>\nI&#39;m going to start there and move to something that&#39;s a few steps removed, so <br/>\nnobody needs to defend or explain anything.  Discuss the ideas all you want <br/>\nto, but it&#39;s not about one family.  Sheila wrote lots of great things, I&#39;m just <br/>\njumping off from one bit.<br/>\n<br/>\n&lt;&lt;  I made a <br/>\n<br/>\npoint of saying out loud to my dh in front of my BIL and MIL &quot;Honey, <br/>\n<br/>\ndid you notice how the boys all self-regulated and left the room <br/>\n<br/>\nbecause they felt uncomfortable about our movie choice?&quot;.&gt;&gt;<br/>\n<br/>\nI hope now you can move past the idea of it being a &quot;regulation&quot; or that <br/>\nthey&#39;ve &quot;self regulated.&quot;   When my children choose vegetables over cookies, <br/>\nthey&#39;re not &quot;regulating.&quot;  We haven&#39;t declared one thing better than another, and <br/>\nthrough all that it has been proven in and by their lives that children will <br/>\nchoose a balanced life in the absence of regulations.  It&#39;s not that the <br/>\nchildren themselves came up with the rules and then regulated themselves.  It&#39;s a <br/>\nnatural balance and natural preference.<br/>\n<br/>\nI do understand that you&#39;re in the phase of trying to overcome outside <br/>\ncriticism and skepticism, but for your own soul and the continuuing success of the <br/>\nkids&#39; growth into making their own decisions, try to consider why &quot;self <br/>\nregulating&quot; as a concept could be in your way.  Or could put you in their way.<br/>\n<br/>\nIf in your mind not watching Bull Durham is better than watching it (in the <br/>\nlong run, even at home without relatives there), then when or if one of your <br/>\nchildren watches it, will that mean he has stopped self-regulating?    Making a <br/>\nchoice is a choice.  Had Holly wanted to eat popsicles or cookies yesterday <br/>\ninstead of finishing off the avocado and spinach dip, it would have been just as <br/>\nmuch a Holly-choice.   She wasn&#39;t &quot;regulating.&quot;<br/>\n<br/>\nYoung kids usually don&#39;t like movies with kissing and mush (they take off, or <br/>\nthey just focus on the Hot Wheels cars on the floor until the huggy chit-chat <br/>\npasses).   I had kids who did that.  If I had defined that as &quot;not interested <br/>\nin sex&quot; then if they got old enough to be willing to sit and watch through <br/>\nthe romance until the action came back, I guess I would be defining that as <br/>\n&quot;interested in sex.&quot;<br/>\n<br/>\nIf the decision making thoughts in my head are more neutral, more in the <br/>\nmiddle, then I&#39;m not defining my children by my perception of their sexuality (or <br/>\ninterest therein) and that&#39;s a really GOOD thing.<br/>\n<br/>\nI have a short article on balance that probably explains it better than I can <br/>\nre-explain it here.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com/HEM/206/ndunschool.html\">http://www.home-ed-magazine.com/HEM/206/ndunschool.html</a><br/>\n<br/>\n-=- maybe she too will self-<br/>\n<br/>\nregulate and not &quot;hear&quot; per se the puns and inuendos.-=-<br/>\n<br/>\nIf she understands them she will.<br/>\nIf she doesn&#39;t understand them she won&#39;t.<br/>\nIf she acts shocked or doesn&#39;t act shocked, that will probably have more to <br/>\ndo with what she thinks her parents think about what she might think.<br/>\n<br/>\nThere was a song before I was born that my mom used to sing.  Some of it goes<br/>\n<br/>\n&quot;I was looking back to see if she was looking back to see <br/>\nIf I was looking back to see if she was looking back at me.&quot;<br/>\n<br/>\nThat&#39;s a lot of work, and when one can step out of that kid of <br/>\nself-consciousness into just accepting and being in the moment, life becomes larger, quieter <br/>\nand clearer.</div>","specialLinks":[]},{"userId":115881476,"authorName":"diamondlady1025","from":"&quot;diamondlady1025&quot; &lt;Diamondlady1025@...&gt;","profile":"diamondlady1025","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Repost -Re: Subject: young, innocent kids wanting to watch sexually heavy movies","postDate":"1084303799","msgId":93868,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM3cjlqbitxZGpuQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":93909,"prevInTime":93867,"nextInTime":93869,"topicId":93868,"numMessagesInTopic":0,"msgSnippet":"For some reason, my post did not come through went I emailed it, so I am reposting it here instead and hopefully this will work.... Sheila, I do not know if","messageBody":"<div id=\"ygrps-yiv-854838349\">For some reason, my post did not come through went I emailed it, so <br/>\nI am reposting it here instead and hopefully this will work....<br/>\n<br/>\nSheila,<br/>\n <br/>\nI do not know if this will help any, but I can tell you of mine and <br/>\nboys experience of this very thing that just happened the other <br/>\nnight.<br/>\n <br/>\nWe were over at my MIL&#39;s house on Saturday night celebrating <br/>\nMother&#39;s Day a day early, and my BIL had on this rather &quot;sexually <br/>\nheavy&quot; movie (Bull Durham) that was on the satellite dish in my MIL <br/>\nhome. We were all watching it, yes even my 7 and 6 yo, along with my <br/>\n13 yo sons. Watching it for them anyway only lasted 3 minutes, <br/>\nliterally, because I was secretly timing it on my watch as my <br/>\nown &quot;experiment&quot; to see what would happen. <br/>\n <br/>\nNow mind you, I said nothing, nor did anyone else in the room say <br/>\nanything about them watching it.....it was my 13 yo ds who took the <br/>\nlead, as he felt uncomfortable watching it (I mean my 13 yo ds got <br/>\nuncomfortable just last night when during Everwood when <br/>\nthe &quot;pregnancy&quot; issue came up and he excused himself to go to the <br/>\nbathroom), I could tell, but I said nothing. I just sat back and let <br/>\nthe situation unfold. My 13 yo ds turned to my 7 yo and said &quot;Do you <br/>\nwant to go play Dr. Mario in Uncle Rob&#39;s room?&quot; and my 7 yo <br/>\nsaid &quot;sure&quot; and off they went. Then about 5 minutes later my 6 yo, <br/>\nwho was immersed in his gameboy anyway, and was not even watching <br/>\nthe movie, he uses the TV sometimes just for background noise, he <br/>\nturned to my dh and said, &quot;I am going to go see what Chris and <br/>\nMatthew are up to&quot; and he left the room.<br/>\n <br/>\nI was SO proud of them. They self-regulated without me having to say <br/>\na word. This was not the first time that my boys have self-<br/>\nregulated, they do it all the time. It just happened to be the first <br/>\ntime that they did it in front of my MIL and BIL.<br/>\nSo, this was a MAJOR triumph for me, I felt, as my MIL STILL after <br/>\nall this time, with all of the research I have given her, and the <br/>\ntalks we have had, and her seeing how much my children are learning <br/>\nhearing it from my own children&#39;s mouths (she spent almost 3 hours, <br/>\nno joke, on the phone with my 7 yo ds just last week, because he <br/>\nwanted to talk to her, it was his choice because he wanted to tell <br/>\nher all about what he has been doing and it took him almost 3 hours <br/>\nto tell her!and this is coming from a what she calls my ds &quot;an <br/>\nintroverted child&quot;), she is still very skeptical of the whole <br/>\nunschooling issue, but of course, does not say anything to me <br/>\npersonally, she tells my dh her &quot;worries&quot; (oh brother!). At least I <br/>\ndo not have to hear her complain! :)<br/>\n <br/>\nSo after the boys all left the room, a few minutes later,  I made a <br/>\npoint of saying out loud to my dh in front of my BIL and MIL &quot;Honey, <br/>\ndid you notice how the boys all self-regulated and left the room <br/>\nbecause they felt uncomfortable about our movie choice?&quot;. 1,2,3,4,5 <br/>\npoints for me and my boys! :)<br/>\n <br/>\nAlot of times too, I will be watching something and it will have <br/>\npuns and inuendos in them that my children just do not get unless I <br/>\npoint them out to them. Sometimes I will depending on if they are <br/>\nreally watching it with me or  sometimes not, if they are just in <br/>\nthe room with their gameboys or on the computer, or writing or <br/>\ndrawing, and not really paying attention to whatever I am watching. <br/>\nWhen I do though, it opens up a dialog for my children to expression <br/>\ntheir view points on the matter at hand and for whatever else may <br/>\ncome out of that conversation.<br/>\n <br/>\nNow, my 13 yo ds is getting better at &quot;catching on&quot; than my other <br/>\ntwo, but not always. There are still things that go &quot;over his head <br/>\nand out the window&quot; as my mother would say. My feeling on that is if <br/>\nthey are ready for it, then they will hear it and they will get it <br/>\nOR they will ask about it, like.....&quot;I did not get what so and so <br/>\nsaid Mom, what does that mean&quot; Ergo I would stop the video and <br/>\nexplain it then. Sometimes all they want is a quick on their own <br/>\nlevel response, and sometimes they want to hear more and take to <br/>\nanother level, which I am gladly to do either because I strongly <br/>\nbelieve that if they are ready to ask the question, then they are <br/>\nready to hear the answer, whatever, the equivalent of that answer <br/>\nthey seek is for them at that moment.<br/>\n<br/>\n <br/>\nI wanted to share this with you Sheila,  to let you know that even <br/>\nthough your 11 yo dd wants to see it, maybe she too will self-<br/>\nregulate and not &quot;hear&quot; per se the puns and inuendos. And if she <br/>\ndoes, it could open up a dialog with the two of you regarding it.  <br/>\nIt could also set the stage for a talk, if she asks, and or if you <br/>\nchoose to bring up the subject by asking her if she has any <br/>\nquestions about what she is seeing, surrounding the subject of sex. <br/>\nI do not know how comfortable you are with it, but personally, I <br/>\nwould rather be the one who is comfortable with it and give my <br/>\nchildren the information that my children ask for and about, as much <br/>\nas they ask for, no matter what the topic. Sometimes we have to be <br/>\nwilling to drop our fears and uncomfortablities, in order to provide <br/>\nour children with the knowledge they seek.<br/>\n <br/>\nKnowledge is empowering, and hiding that knowledge from them will <br/>\nonly, in my humble opinion, serve to make sex, alcohol, drugs or <br/>\nwhatever &quot;bad thing we want to protect them from&quot;, more enticing and <br/>\nmake them want to do it even more. The more they know, the more <br/>\ninformative of a choice they can make. And the more trust you place <br/>\nin your child, the more likely they are to make what we would see as <br/>\nthe &quot;right&quot; choice.<br/>\n <br/>\nJust my 2 cents! :) Hope it helps! :)<br/>\n <br/>\nPatti and the boys (Chris 13, Matthew 7, Anthony 6)<br/>\n&quot;For no matter where knowledge and learning come from - no matter<br/>\nwhat shape, size, or dimension it assumes - it still is what it is,<br/>\nknowledge and learning. Therefore knowledge and learning should<br/>\nalways be embraced.&quot; ~ unknown<br/>\n <br/>\n-------Original Message-------<br/>\nMessage: 10<br/>\n   Date: Tue, 11 May 2004 03:14:57 -0000<br/>\n   From: &quot;kayb85&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sheran@...\">sheran@...</a>&gt;<br/>\nSubject: young, innocent kids wanting to watch sexually heavy movies<br/>\n <br/>\nI could use some input on the movie &quot;mean girls&quot; and on the general<br/>\ntopic of innocent pre-teens wanting to watch sexually heavy movies.<br/>\n <br/>\nI was discussing this with some online friends and someone posted a<br/>\nreview of the movie Mean Girls and its sexual content.  So I guess my<br/>\nfirst question, for those of you who&#39;ve seen it...just how sexual is<br/>\nit?  For a innocent 11 year old who hasn&#39;t been exposed to much<br/>\nsexuality in movies before, is it a lot to throw at her at once?<br/>\n <br/>\nExamples of some things I&#39;ve been told about the movie:<br/>\n-Regina states that she was half a virgin when she met Aaron.<br/>\n-A male student tells another that something (presumably sexual) only<br/>\ncounts &quot;if you saw nipple.&quot;<br/>\n-An instructor in a sex-ed class tells his students not to have sex<br/>\nin the missionary position or standing up (stating that they&#39;ll die)<br/>\nand then tells everyone to take a rubber (he has a container of<br/>\nthem).<br/>\n-We hear a breakdown of the various student cliques in the cafeteria,<br/>\nincluding that of the &quot;sexually active band geeks.&quot;<br/>\n-Regina matter-of-factly asks Cady if she wants to have sex with a<br/>\nguy who&#39;s joined them at school and Cady says, &quot;No thank you.&quot;<br/>\n-Regina calls another girl&#39;s mother and acts as if she&#39;s from Planned<br/>\nParenthood regarding the girl (to get her in trouble).<br/>\n-We hear that Regina&#39;s mom had a &quot;boob job&quot; (as the camera focuses on<br/>\nher chest) and that they&#39;re as hard as rocks (Cady reacts to the feel<br/>\nof them when the mom hugs her). The mom doesn&#39;t then realize that the<br/>\nsmall family dog is biting on her clothed nipple.<br/>\n-Comments are made about a girl still being a virgin and another<br/>\nbeing a &quot;dyke.&quot;<br/>\n-Janis tells Cady that she smells like a &quot;baby prostitute.&quot;<br/>\n-A sex-ed instructor tells his students that they&#39;ll have urges and<br/>\nwant to take off their clothes, but that they&#39;ll then get Chlamydia.<br/>\n <br/>\nMy almost 11 year old daughter REALLY wants to see it. We generally<br/>\nwatch movies on dvd instead of in the theatres, so we won&#39;t go and<br/>\nwatch it right now, but it will be out on dvd before long I&#39;m sure.<br/>\n <br/>\nMy concern isn&#39;t that I want to be a prude and keep her from seeing<br/>\nsexual stuff.  I want to be open and honest and all that when it<br/>\ncomes to sexuality.  I don&#39;t want to not let her watch it.  As a<br/>\nmatter of fact, not letting her watch something she wants to watch<br/>\nisn&#39;t even an option.  She knows the basics about sex but is still<br/>\nfairly innocent.  She saw Freaky Friday and loved the actress (same<br/>\none as is in this movie) and saw Mean GIrls advertised and just<br/>\nthinks it looks awesome.  Plus it&#39;s about a homeschooled girl.  She<br/>\nwon&#39;t forget about wanting to watch this, she REALLY wants it.  She<br/>\nwants to buy it and she&#39;ll probably watch it several times.<br/>\n <br/>\nBut the stuff I posted above...Wow, she doesn&#39;t know much about any<br/>\nof that at all.  Maybe she&#39;s curious, maybe she&#39;s ready to start<br/>\nhearing about some of that, and that&#39;s cool...but all that thrown<br/>\ntogether in one movie?<br/>\n <br/>\nShe&#39;s my oldest, so it&#39;s my first time dealing with sexual stuff.<br/>\nAny advice?<br/>\n <br/>\nSheila</div>","specialLinks":[]}],"prevTopicId":93901,"nextTopicId":93910}}