{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":19,"messages":[{"userId":123374705,"authorName":"ejcrewe@aol.com","from":"ejcrewe@...","profile":"ejcrewe2002","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] still need help","postDate":"1048024756","msgId":61340,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyMi4yMDNjOGU4Zi4yYmE4ZjBiNEBhb2wuY29tPg=="},"prevInTopic":61333,"nextInTopic":0,"prevInTime":61339,"nextInTime":61341,"topicId":61280,"numMessagesInTopic":0,"msgSnippet":"In a message dated 3/17/2003 11:40:29 PM Central Standard Time, ... Wow.  I know I m a day behind here, but this really helps me right now.  What they did","messageBody":"<div id=\"ygrps-yiv-452631\">In a message dated 3/17/2003 11:40:29 PM Central Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Flexibility seems to be a better policy than convincing kids to do what they <br/>\n&gt; <br/>\n&gt; did before just because they did it before.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Wow.  I know I&#39;m a day behind here, but this really helps me right now.  What <br/>\nthey did before is sometimes easier, I think, because we as parents know how <br/>\nto work it.  Thanks.  I&#39;m going to leave my 80 unread messages and work on <br/>\nmyself now.<br/>\n<br/>\nElizabeth<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] still need help","postDate":"1048018849","msgId":61333,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFmMS40YTExZjAyLjJiYThkOWExQGFvbC5jb20+"},"prevInTopic":61325,"nextInTopic":61340,"prevInTime":61332,"nextInTime":61334,"topicId":61280,"numMessagesInTopic":0,"msgSnippet":"In a message dated 3/18/03 12:00:31 PM, mummy124@bellsouth.net writes: ","messageBody":"<div id=\"ygrps-yiv-1274365827\">In a message dated 3/18/03 12:00:31 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mummy124@...\">mummy124@...</a> writes:<br/>\n<br/>\n&lt;&lt; I remember Sierra having a cyst on her arm that had to be removed. They <br/>\nhad given her topical numbing stuff to put on it before they injected it <br/>\nfurther to numb it and then have it removed. I used the stuff myself to see <br/>\nhow it worked and it literally numbed the skin so you couldn&#39;t feel anything. <br/>\nWell when the time came, she screamed like someone was ripping her heart out. <br/>\nIt was awful and so hard to get the problem taken care of under those <br/>\ncircumstances. I just couldn&#39;t understand what the big deal was when you <br/>\ncouldn&#39;t feel anything.  &gt;&gt;<br/>\n<br/>\nJust because you couldn&#39;t feel anything doesn&#39;t mean she couldn&#39;t.  People&#39;s <br/>\nnervous systems must be at LEAST as different as their noses, or their hair, <br/>\nor their brains...   since we readily admit brains are very different, <br/>\n&quot;nerves,&quot; being part of that, must be too.<br/>\n<br/>\nMy husband has a very high pain threshhold.  He can keep functioning with <br/>\nbroken bones and serious sprains and pulls.  He had back problems when he was <br/>\nyounger.  One night he literally could not get up from where he had been <br/>\nsitting on the floor.  People helped him up on the couch, he rested a bit, <br/>\nhobbled to the car and went to the emergency room.  The doctor was stunned.  <br/>\nMedically, he shouldn&#39;t have been able to walk or move at all.  Nobody told <br/>\nKeith!<br/>\n<br/>\nI, on the other hand, can become temporarily incapacitated from stubbing my <br/>\ntoe or hitting my head.  BLINDING, real pain.  It goes away in a bit, and <br/>\ndeep breathing helps a whole lot.  But those first few seconds cannot be <br/>\nreasoned away at all.  It&#39;s real.<br/>\n<br/>\n-=- We just left her alone and she came out a little while later like nothing <br/>\never happened. I just have a hard time thinking me leaving her alone is best. <br/>\nSeems like as a mom, I should be able to DO something to help. -=-<br/>\n<br/>\nSeems leaving her in a quiet place, undisturbed, was what she wanted.  Doing <br/>\nit sweetly instead of punitively will help.  I&#39;m guilty of sometimes getting <br/>\nfrustrated with Holly and getting away from her in a meaner-than-necessary <br/>\nway.  It would be better if I just said &quot;I&#39;m going to go sort laundry&quot; in a <br/>\nhappy or  neutral way and went away, it would keep her from feeling like I <br/>\nwanted to be where she wasn&#39;t.  I keep reminding myself, and I get better.  I <br/>\ndon&#39;t remember having those incidents with Marty or Kirby.  Maybe I did but <br/>\nit was different because there was a younger child to attend to and it made a <br/>\ncalm, good-mother way for me to leave.  With Holly being the youngest, I just <br/>\nhave to leave sometimes.  <br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":74604204,"authorName":"Deborah Lewis","from":"Deborah Lewis &lt;ddzimlew@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] still need help","postDate":"1048014101","msgId":61325,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMwMzE4LjEyMDE0Mi4xMjIwLjIuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":61324,"nextInTopic":61333,"prevInTime":61324,"nextInTime":61326,"topicId":61280,"numMessagesInTopic":0,"msgSnippet":"Mary, With people not feeling their best there are going to be moments more stressful than usual. Your husband played with her at first, just as if her game","messageBody":"<div id=\"ygrps-yiv-93120797\">Mary,<br/>\n<br/>\nWith people not feeling their best there are going to be moments more<br/>\nstressful than usual.<br/>\n<br/>\nYour husband played with her at first, just as if her game was a great<br/>\nidea and fun for him too.   Then he got tired of it and wanted it over<br/>\nlong before Sierra would have liked.   It&#39;s not her fault he wasn&#39;t in<br/>\nthe mood to play.   It&#39;s not her fault he opted into the game under false<br/>\npretenses. (not planning on finishing it)   It&#39;s not her fault grown ups<br/>\n(sick ones or stressed ones) get grumpy at little girls.<br/>\n<br/>\nShe had all that bad stuff happen to her, I&#39;d say she had her reasons for<br/>\ngetting upset.   <br/>\nMan, would you want a little girl who couldn&#39;t express herself when<br/>\nsomething bad happened?  <br/>\n<br/>\nShe&#39;s communicating all over the place, Mary.   Maybe in a different way<br/>\nthan what you&#39;re used to but she&#39;s doing it.    Let her be herself<br/>\nwithout a fight.   She won&#39;t get another chance to be a seven year old,<br/>\njust let her be the one she wants to be.    If you don&#39;t understand her<br/>\nright now, just find a way to not fight with her. <br/>\n<br/>\nIf she gets too stinky, take her swimming. &lt;g&gt;<br/>\n<br/>\nDeb L</div>","specialLinks":[]},{"userId":141102765,"authorName":"Mary","from":"&quot;Mary&quot; &lt;mummy124@...&gt;","profile":"mummyone24","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] still need help","postDate":"1048013779","msgId":61324,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwM2YwMWMyZWQ4MCQwZmVlY2JlMCQ2MTAxYThjMEBsYXVuY2htb2RlbS5jb20+","referencesHeader":"PDUuMS4wLjE0LjIuMjAwMzAzMTgwOTMxMTUuMDBiNmNkZTBAcG9zdG9mZmljZS53b3JsZG5ldC5hdHQubmV0Pg=="},"prevInTopic":61323,"nextInTopic":61325,"prevInTime":61323,"nextInTime":61325,"topicId":61280,"numMessagesInTopic":0,"msgSnippet":"From: Christina Morrissey ","messageBody":"<div id=\"ygrps-yiv-591094944\">From: Christina Morrissey <br/>\n<br/>\n  &lt;&lt;This is what it sounded to me: at the point when your husband tried to get <br/>\n  her to stop and get into the shower, she was soooo wound up in her <br/>\n  EXPERIENCE, that she COULDN&#39;T stop on her own, and the transition was too <br/>\n  abrupt for her.  So she started crying which wound her up even more.  When <br/>\n  you entered the picture and began talking to her that added a whole new <br/>\n  demand on her system.  Then you touched her (grabbed her hand)  adding a <br/>\n  new sensory element and at this point she is so overwhelmed, she <br/>\n  SCREAMED.  Her system can&#39;t handle anything more.  You see it as a <br/>\n  tantrum.  She feels it as uncontrollable sensory overload.  She is unable <br/>\n  to stop her emotions, senses, whatever, she&#39;s scared, needs help, and <br/>\n  doesn&#39;t know how to get it.  Often removal from the scene, the noise; quiet <br/>\n  and then your hug which brings her back to herself and reassures her that <br/>\n  she has control once again, will allow her to once again be able to think!&gt;&gt;<br/>\n<br/>\n<br/>\n  Thanks Christina, it sounds like that is exactly what happened with her. I have been making a note lately as to when and under what circumstances Sierra has her meltdowns. This is just all so new to us. We&#39;ve never come across anything like this before. I never even understood about some children being extremely sensitive and all. It makes so much sense though when I look back on things. I remember Sierra having a cyst on her arm that had to be removed. They had given her topical numbing stuff to put on it before they injected it further to numb it and then have it removed. I used the stuff myself to see how it worked and it literally numbed the skin so you couldn&#39;t feel anything. Well when the time came, she screamed like someone was ripping her heart out. It was awful and so hard to get the problem taken care of under those circumstances. I just couldn&#39;t understand what the big deal was when you couldn&#39;t feel anything. Now I get it and realize how it must have been for her. If only I would have known then. The term that comes to my mind (from relatives) is overly sensitive and that doesn&#39;t help but says a whole lot about a kid just being hard to handle instead of truly having a problem.<br/>\n<br/>\n  I&#39;ve found that Sierra does so much better when I just leae her alone when she gets that way. Holding her seems to make her cry harder and longer. I guess again too much when she doesn&#39;t need it. Last night after the episode, she curled up under a blanket in bed totally hidden. We just left her alone and she came out a little while later like nothing ever happened. I just have a hard time thinking me leaving her alone is best. Seems like as a mom, I should be able to DO something to help. To be there for her to make it all better. It works with the other 3. Although now that I think about it, Tara likes to be alone at first whenever there is a crisis. She likes the comfort later after she&#39;s calmed down. Maybe all those years of my being there made it worse when I should have left her alone. Hindsight! <br/>\n<br/>\n  So thank you so much for making me understand what could possibly be going on in her mind. I will have a long talk with Joe tonight and hopefully we can do what&#39;s best for her so she can get through all this. <br/>\n<br/>\n  Mary B<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":132394532,"authorName":"Have a Nice Day!","from":"Have a Nice Day! &lt;litlrooh@...&gt;","profile":"litlrooh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] still need help","postDate":"1048013758","msgId":61323,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTMwMWMyZWQ4MCQwMzY0MGFjMCQ3YjdlNTI0NEBjZWxlcm9uMTc+","referencesHeader":"PDE0Ny5kMzcwOGM4LjJiYTg4OTUzQGFvbC5jb20+IDwwMDJiMDFjMmVkNzAkYzNlY2VlYzAkNjEwMWE4YzBAbGF1bmNobW9kZW0uY29tPg=="},"prevInTopic":61319,"nextInTopic":61324,"prevInTime":61322,"nextInTime":61324,"topicId":61280,"numMessagesInTopic":0,"msgSnippet":"The shower wasn t a big deal. But it was an example of what sends Sierra into a tizzy. Simple little things like that. Things that are just fine one minute and","messageBody":"<div id=\"ygrps-yiv-433268607\">The shower wasn&#39;t a big deal. But it was an example of what sends Sierra into a tizzy. Simple little things like that. Things that are just fine one minute and a whole other story the next. Just that quick.&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\nI&#39;m just thinking out loud here.  I am still working on it, but I would have been frustrated too.  And if you and Joe have been feeling awful all week I can see how things could have gotten frustrating more quickly than usual.  We&#39;re all human.<br/>\n<br/>\nOn the other hand, I think it sounds like Sierra is developing a pattern of behavior that is not beneficial to her or the rest of the family, and she probably doesn&#39;t understand it herself.<br/>\n<br/>\nIf she changes that quickly, I think I would just &quot;change with her&quot; and let it go.  Don&#39;t talk about it, don&#39;t try to &quot;understand&quot; it.  Just accept it and let it go.<br/>\n<br/>\nI am wondering if by focusing so much attention on it (for the sake of understanding) if its backfiring on you by making her feel overwhelmed or something.<br/>\n<br/>\nSee if it helps to just &quot;roll with it&quot; and not focus on it.<br/>\n<br/>\nKristen<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: Mary <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a> <br/>\n  Sent: Tuesday, March 18, 2003 12:06 PM<br/>\n  Subject: Re: [Unschooling-dotcom] still need help<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n    From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:genant2@...\">genant2@...</a> <br/>\n<br/>\n    &lt;&lt;Maybe making her take a shower isn&#39;t worth the disruption to the rest of the <br/>\n    house.&gt;&gt;<br/>\n<br/>\n<br/>\n    You&#39;re right and it wasn&#39;t and she ended up not taking one. Thing is I didn&#39;t know what was going on until it was too late. Joe has been in pain for a week now and not working like he needs to and just out of sorts. Plus he really doesn&#39;t always remember to do the right thing with the kids. He&#39;s trying, but sometimes slips. I have been feeling awful and from in the living room where I was, I couldn&#39;t hear what was going on.<br/>\n<br/>\n    The shower wasn&#39;t a big deal. But it was an example of what sends Sierra into a tizzy. Simple little things like that. Things that are just fine one minute and a whole other story the next. Just that quick.<br/>\n<br/>\n    Mary B<br/>\n<br/>\n<br/>\n  [Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n        Yahoo! Groups Sponsor <br/>\n       <br/>\n       <br/>\n<br/>\n  ~~~~ Don&#39;t forget! If you change topics, change the subject line! ~~~~<br/>\n<br/>\n  If you have questions, concerns or problems with this list, please email the moderator, Joyce Fetteroll (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a>), or the list owner, Helen Hegener (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Editor@...\">HEM-Editor@...</a>).<br/>\n<br/>\n  To unsubscribe from this group, click on the following link or address an email to:<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-unsubscribe@yahoogroups.com\">Unschooling-dotcom-unsubscribe@yahoogroups.com</a> <br/>\n<br/>\n  Visit the Unschooling website: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> <br/>\n<br/>\n  Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] still need help","postDate":"1048012877","msgId":61319,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFkZS40YmFhY2NjLjJiYThjMjRkQGFvbC5jb20+"},"prevInTopic":61317,"nextInTopic":61323,"prevInTime":61318,"nextInTime":61320,"topicId":61280,"numMessagesInTopic":0,"msgSnippet":"In a message dated 3/18/03 10:11:44 AM, mummy124@bellsouth.net writes: ","messageBody":"<div id=\"ygrps-yiv-570113107\">In a message dated 3/18/03 10:11:44 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mummy124@...\">mummy124@...</a> writes:<br/>\n<br/>\n&lt;&lt;  The shower wasn&#39;t a big deal. But it was an example of what sends Sierra <br/>\ninto a tizzy. Simple little things like that. Things that are just fine one <br/>\nminute and a whole other story the next. Just that quick.<br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;<br/>\n<br/>\n </span></blockquote>My sister used to go crazy in a second.  REALLY angry.  Or REALLY scared. <br/>\n<br/>\nPartly it was just kind of a hair-trigger biochemical thing with her.  She <br/>\nchanges fast.  Whatever that means physically, the chemicals that go to <br/>\npeople&#39;s blood and brains comes really fast with her and dissipates really <br/>\nfast too.  She flares up.   It was even worse when she was an adult.<br/>\n<br/>\nOne time she was all a-rant with me about something, and I said &quot;Everything <br/>\nis the last straw with you.&quot;<br/>\n<br/>\n&quot;What do you mean?&quot;<br/>\n<br/>\n&quot;It&#39;s like you have this cartload of straw, and to calm down you just take <br/>\noff one single straw, so that you can maintain again, but the next thing that <br/>\nhappens is THE LAST STRAW!  You need to unload about HALF that straw if you <br/>\nwant to be able to handle anything calmly.&quot;<br/>\n<br/>\nIf this is anything like your daughter, what you might help her do is unload <br/>\na bunch of that straw.  Find out a dozen or two dozen things to do to make <br/>\nher life more comfortable, more calm, more interesting and appealing to her.  <br/>\nFind out what others (including parents) are doing that irritates her, and <br/>\nput those on the list of things to avoid doing if possible.<br/>\n<br/>\nI hate the sound of nail clippers.  I can&#39;t stand it.  If people in my family <br/>\nsaid &quot;That&#39;s stupid, get over it,&quot; I wouldn&#39;t like them as much as I do.  <br/>\nWhat they do is say &quot;I&#39;m going to close the door because I&#39;m going to clip my <br/>\nnails,&quot; or will say &quot;I have to clip my nails, mom,&quot; and I&#39;ll say &quot;I need to <br/>\ngo tof range for my nervous system to have it&#39;s shuddering freak-out.  (I <br/>\nthink it&#39;s like some people are about chalk on a chalkboard, nails on a sink, <br/>\nor fingers pulled across balloons.  None of those sounds bother me, but I&#39;m <br/>\ncareful not to make those noises because I know how painful nail clippers can <br/>\nbe for me.)<br/>\n<br/>\nIf anyone in your family is doing anything that they KNOW bothers that child <br/>\nand they&#39;re doing it anyway, that&#39;s no more okay than if they were walking by <br/>\nand slapping her.  Her stress level will stay too high for her to function in <br/>\na calm and healthy manner.  <br/>\n<br/>\nIf people in your family are pressing her to &quot;act right&quot; instead of helping <br/>\nher FEEL right, the problem is the family and not the child.  <br/>\n<br/>\nShe should feel safer and more loved right now than she ever will feel again <br/>\nin her life, if you can manage that.  And showers aren&#39;t safety issues, in <br/>\nmost cases.   If she gets acid or bleach splashed on her, throw her in the <br/>\nshower screaming.  If you are thinking &quot;shower time&quot; because of the clock, or <br/>\nbeause of what your mother used to do, or because of ANYTHING that isn&#39;t that <br/>\nchild directly, shower time should be thrown out and that energy put into <br/>\nloving your daughter.<br/>\n<br/>\nIf that seems too dramatic or impassioned, maybe you need more drama and <br/>\npassion in your relationships with your kids.  They won&#39;t get today back.  <br/>\nMake it as good as can be.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] still need help","postDate":"1048012642","msgId":61317,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDExNC4yMDc5N2ExMy4yYmE4YzE2MkBhb2wuY29tPg=="},"prevInTopic":61313,"nextInTopic":61319,"prevInTime":61316,"nextInTime":61318,"topicId":61280,"numMessagesInTopic":0,"msgSnippet":"In a message dated 3/18/2003 12:11:43 PM Eastern Standard Time, ... Mary. Order Sandra s tape, Peaceful Parenting, to listen to in the car. It s amazing what","messageBody":"<div id=\"ygrps-yiv-188955912\">In a message dated 3/18/2003 12:11:43 PM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mummy124@...\">mummy124@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt;   You&#39;re right and it wasn&#39;t and she ended up not taking one. Thing is I <br/>\n&gt; didn&#39;t know what was going on until it was too late. Joe has been in pain <br/>\n&gt; for a week now and not working like he needs to and just out of sorts. Plus <br/>\n&gt; he really doesn&#39;t always remember to do the right thing with the kids. He&#39;s <br/>\n&gt; trying, but sometimes slips. I have been feeling awful and from in the <br/>\n&gt; living room where I was, I couldn&#39;t hear what was going on.<br/>\n&gt; <br/>\n&gt;   The shower wasn&#39;t a big deal. But it was an example of what sends Sierra <br/>\n&gt; into a tizzy. Simple little things like that. Things that are just fine one <br/>\n&gt; minute and a whole other story the next. Just that quick.<br/>\n&gt; <br/>\n&gt;   Mary B<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Mary. <br/>\n<br/>\nOrder Sandra&#39;s tape, Peaceful Parenting, to listen to in the car. It&#39;s <br/>\namazing what that little tape can do for you!<br/>\n<br/>\n~Kelly<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":53620434,"authorName":"Christina Morrissey","from":"Christina Morrissey &lt;cvw@...&gt;","profile":"christa_wa","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] still need help","postDate":"1048010052","msgId":61313,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUuMS4wLjE0LjIuMjAwMzAzMTgwOTMxMTUuMDBiNmNkZTBAcG9zdG9mZmljZS53b3JsZG5ldC5hdHQubmV0Pg==","inReplyToHeader":"PDAwMWUwMWMyZWNmZCQwYTRiOGU0MCQ2MTAxYThjMEBsYXVuY2htb2RlbS5jb20+"},"prevInTopic":61307,"nextInTopic":61317,"prevInTime":61312,"nextInTime":61314,"topicId":61280,"numMessagesInTopic":0,"msgSnippet":"At 10:18 PM 3/17/2003 -0500, you wrote: Hey Mary....I read all the responses to your post....It must be sooo confusing dealing with this.  One moment","messageBody":"<div id=\"ygrps-yiv-1466423703\">At 10:18 PM 3/17/2003 -0500, you wrote:<br/>\nHey Mary....I read all the responses to your post....It must be sooo <br/>\nconfusing dealing with this.  One moment everything is going along just <br/>\nfine and then EXPLOSION!  Suggestion:  perhaps you might start keeping a <br/>\nchart of her moods on a daily basis indicating the timing of certain events <br/>\nsuch as tantrums and crying spells to see if you start seeing any patterns <br/>\n(and for perhaps any future prof. help....)<br/>\n<br/>\nIn the case of the shower thing...the only additional thing I might have <br/>\ntried was to have taken her away from the action WITHOUT any further words <br/>\nand hugged her until she stopped screaming.  Let hubby deal with the other <br/>\nkids as you see to Sierra and have him calm the others down.  Then I would <br/>\nhave tried to see what her take on the situation was re to shower or not.<br/>\n<br/>\nThis is what it sounded to me: at the point when your husband tried to get <br/>\nher to stop and get into the shower, she was soooo wound up in her <br/>\nEXPERIENCE, that she COULDN&#39;T stop on her own, and the transition was too <br/>\nabrupt for her.  So she started crying which wound her up even more.  When <br/>\nyou entered the picture and began talking to her that added a whole new <br/>\ndemand on her system.  Then you touched her (grabbed her hand)  adding a <br/>\nnew sensory element and at this point she is so overwhelmed, she <br/>\nSCREAMED.  Her system can&#39;t handle anything more.  You see it as a <br/>\ntantrum.  She feels it as uncontrollable sensory overload.  She is unable <br/>\nto stop her emotions, senses, whatever, she&#39;s scared, needs help, and <br/>\ndoesn&#39;t know how to get it.  Often removal from the scene, the noise; quiet <br/>\nand then your hug which brings her back to herself and reassures her that <br/>\nshe has control once again, will allow her to once again be able to think!<br/>\n<br/>\n  I don&#39;t profess to be an expert.  I just have a kid who went through what <br/>\nseemed like similar experiences.  Research and diagnosis indicated this <br/>\ntype of experience behind the scenes.  If none of the other posts seem <br/>\nlikely, try this one on for size and see if it fits in future dealings with <br/>\nSierra!    Knowing what&#39;s going on for me, always gave me so much more <br/>\npatience for all the unpleasant stuff.....<br/>\n<br/>\nChristina (WA)<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt;&lt;&lt; When I tried to calm her down, she wouldn&#39;t. I asked if she would <br/>\n&gt;please shower now as Alyssa was naked and the water was running. She <br/>\n&gt;refused and when I tried to talk to her and take her by the hand, she <br/>\n&gt;screamed like crazy. &gt;&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;The harder I try  to talk to Sierra and understand why she&#39;s doing what <br/>\n&gt;she&#39;s doing, the more disruptive she&#39;s becoming.<br/>\n&gt;<br/>\n&gt;Mary B<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;[Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;~~~~ Don&#39;t forget! If you change topics, change the subject line! ~~~~<br/>\n&gt;<br/>\n&gt;If you have questions, concerns or problems with this list, please email <br/>\n&gt;the moderator, Joyce Fetteroll (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a>), or the list <br/>\n&gt;owner, Helen Hegener (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Editor@...\">HEM-Editor@...</a>).<br/>\n&gt;<br/>\n&gt;To unsubscribe from this group, click on the following link or address an <br/>\n&gt;email to:<br/>\n&gt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-unsubscribe@yahoogroups.com\">Unschooling-dotcom-unsubscribe@yahoogroups.com</a><br/>\n&gt;<br/>\n&gt;Visit the Unschooling website: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n&gt;<br/>\n&gt;Your use of Yahoo! Groups is subject to <a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a> </span></blockquote></div>","specialLinks":[]},{"userId":141102765,"authorName":"Mary","from":"&quot;Mary&quot; &lt;mummy124@...&gt;","profile":"mummyone24","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] still need help","postDate":"1048007209","msgId":61307,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMmIwMWMyZWQ3MCRjM2VjZWVjMCQ2MTAxYThjMEBsYXVuY2htb2RlbS5jb20+","referencesHeader":"PDE0Ny5kMzcwOGM4LjJiYTg4OTUzQGFvbC5jb20+"},"prevInTopic":61303,"nextInTopic":61313,"prevInTime":61306,"nextInTime":61308,"topicId":61280,"numMessagesInTopic":0,"msgSnippet":"From: genant2@aol.com ","messageBody":"<div id=\"ygrps-yiv-92575898\">From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:genant2@...\">genant2@...</a> <br/>\n<br/>\n  &lt;&lt;Maybe making her take a shower isn&#39;t worth the disruption to the rest of the <br/>\n  house.&gt;&gt;<br/>\n<br/>\n<br/>\n  You&#39;re right and it wasn&#39;t and she ended up not taking one. Thing is I didn&#39;t know what was going on until it was too late. Joe has been in pain for a week now and not working like he needs to and just out of sorts. Plus he really doesn&#39;t always remember to do the right thing with the kids. He&#39;s trying, but sometimes slips. I have been feeling awful and from in the living room where I was, I couldn&#39;t hear what was going on.<br/>\n<br/>\n  The shower wasn&#39;t a big deal. But it was an example of what sends Sierra into a tizzy. Simple little things like that. Things that are just fine one minute and a whole other story the next. Just that quick.<br/>\n<br/>\n  Mary B<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":109856460,"authorName":"nellebelle","from":"&quot;nellebelle&quot; &lt;nellebelle@...&gt;","profile":"lamaribelle","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] still need help","postDate":"1048001808","msgId":61303,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwYTEwMWMyZWQ2NCRkZWMxMDc2MCQ2NDAxYThjMEBvZW1jb21wdXRlcj4=","referencesHeader":"PDAwMWUwMWMyZWNmZCQwYTRiOGU0MCQ2MTAxYThjMEBsYXVuY2htb2RlbS5jb20+"},"prevInTopic":61296,"nextInTopic":61307,"prevInTime":61302,"nextInTime":61304,"topicId":61280,"numMessagesInTopic":0,"msgSnippet":"Wasn t there a thread on bathing a while back?  Could not showering have been a choice? My younger child often says no to things.  If I just accept her no, she","messageBody":"<div id=\"ygrps-yiv-599109491\">Wasn&#39;t there a thread on bathing a while back?  Could not showering have<br/>\nbeen a choice?<br/>\n<br/>\nMy younger child often says no to things.  If I just accept her no, she<br/>\noften changes her mind later.  If I try to force the issue, she digs her<br/>\nheels in.<br/>\n<br/>\nMary Ellen<br/>\n<br/>\n----- snip----- What started out as being goofy ended up old for Joe as<br/>\nSierra just wouldn&#39;t get in the running shower and of course Alyssa waits<br/>\nfor Sierra first. Joe had asked her a few times and she totally disregarded<br/>\nhim and kept running around. Of course then Alyssa started. After about 5<br/>\nminutes, Joe yelled at her and she started to cry and all hell broke loose.</div>","specialLinks":[]},{"userId":78134331,"authorName":"genant2@aol.com","from":"genant2@...","profile":"genant04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] still need help","postDate":"1047998669","msgId":61296,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI5LjNiOTlmODNkLjJiYTg4YWNkQGFvbC5jb20+"},"prevInTopic":61295,"nextInTopic":61303,"prevInTime":61295,"nextInTime":61297,"topicId":61280,"numMessagesInTopic":0,"msgSnippet":"In a message dated 3/17/03 11:41:02 PM Eastern Standard Time, ... What do you mean by past that?  I try to think ahead.  If I saw that Joe was saying come on","messageBody":"<div id=\"ygrps-yiv-1290000912\">In a message dated 3/17/03 11:41:02 PM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mummy124@...\">mummy124@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Then Sierra decided to be silly. Still okay. They&#39;re kids. But it just went <br/>\n&gt; past that. <br/>\n<br/>\n </span></blockquote>What do you mean by &quot;past that?&quot;  I try to think ahead.  If I saw that Joe <br/>\nwas saying come on get in the shower..over and over I might have gone in and <br/>\nsaid come on Alyssa, I&#39;ll get in the shower with you.  End of problem.  If <br/>\nSierra came in good if not OK too.  If when I got out Sierra then wanted to <br/>\nshower I would let her or I would take one with her too.  <br/>\nJust my 2 cents.<br/>\nsometimes it is hard to anticipate<br/>\nPam G.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":78134331,"authorName":"genant2@aol.com","from":"genant2@...","profile":"genant04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] still need help","postDate":"1047998291","msgId":61295,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0Ny5kMzcwOGM4LjJiYTg4OTUzQGFvbC5jb20+"},"prevInTopic":61294,"nextInTopic":61296,"prevInTime":61294,"nextInTime":61296,"topicId":61280,"numMessagesInTopic":0,"msgSnippet":"In a message dated 3/17/03 10:21:57 PM Eastern Standard Time, ... Maybe making her take a shower isn t worth the disruption to the rest of the house. Pam G. ","messageBody":"<div id=\"ygrps-yiv-189028653\">In a message dated 3/17/03 10:21:57 PM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mummy124@...\">mummy124@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Her behavior is really disrupting the rest of the house. It&#39;s upsetting to <br/>\n&gt; Joseph and Alyssa is starting to give us a hard time also when Sierra does.<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Maybe making her take a shower isn&#39;t worth the disruption to the rest of the <br/>\nhouse.<br/>\nPam G.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":78134331,"authorName":"genant2@aol.com","from":"genant2@...","profile":"genant04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] still need help","postDate":"1047998241","msgId":61294,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEwNy4yMGRhZmVlOC4yYmE4ODkyMUBhb2wuY29tPg=="},"prevInTopic":61290,"nextInTopic":61295,"prevInTime":61293,"nextInTime":61295,"topicId":61280,"numMessagesInTopic":0,"msgSnippet":"In a message dated 3/17/03 10:21:57 PM Eastern Standard Time, ... This would have been a great solution in the beginning.  Maybe Sierra would have jumped in","messageBody":"<div id=\"ygrps-yiv-1544476990\">In a message dated 3/17/03 10:21:57 PM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mummy124@...\">mummy124@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I ended up leaving Sierra in her room and taking Alyssa in the shower with <br/>\n&gt; me. <br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>This would have been a great solution in the beginning.  Maybe Sierra would <br/>\nhave jumped in with you and Alyssa and maybe not. But the frustration would <br/>\nhave been avoided, maybe, if you had said it was OK not to take a shower. I <br/>\nknow yelling is a knee jerk reaction to all the frustration built up but I <br/>\ntry to tell myself is that how I would treat my DH.  No probably not.  If he <br/>\ndidn&#39;t want to shower I certainly wouldn&#39;t try to make him.  I hate to be <br/>\nyelled at too.  <br/>\nJust my 2 cents<br/>\nPam G.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] still need help","postDate":"1047965997","msgId":61290,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGE5LjNiYjNiM2U0LjJiYTgwYjJkQGFvbC5jb20+"},"prevInTopic":61286,"nextInTopic":61294,"prevInTime":61289,"nextInTime":61291,"topicId":61280,"numMessagesInTopic":0,"msgSnippet":"In a message dated 3/17/03 9:41:25 PM, mummy124@bellsouth.net writes: ","messageBody":"<div id=\"ygrps-yiv-1324394537\">In a message dated 3/17/03 9:41:25 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mummy124@...\">mummy124@...</a> writes:<br/>\n<br/>\n&lt;&lt;   The way it&#39;s been done for ages now is that all 3 kids shower at the <br/>\nsame time. The kids have decided to do it that way and it&#39;s been working. &gt;&gt;<br/>\n<br/>\nApparently it&#39;s not working now.<br/>\n<br/>\nFlexibility seems to be a better policy than convincing kids to do what they <br/>\ndid before just because they did it before.<br/>\n<br/>\n-=-This was already decided on and everyone was okay with it. That&#39;s why it <br/>\nwas so upsetting. No one was being asked to do anything they didn&#39;t want <br/>\nto.-=-<br/>\n<br/>\nDon&#39;t you ever say &quot;Yes&quot; to wanting to do something and realize that you said <br/>\nyes without really thinking, just kind of automatically?<br/>\n<br/>\nCan&#39;t you just sprinkle water from a wet hand on her and say &quot;Magical Shower&quot; <br/>\nand call it done?<br/>\n<br/>\nI think it was the parental expectation that was the problem.  My best <br/>\nrecommendation is to loosen up and let her be crazed for a while.  She won&#39;t <br/>\nbe this way when she&#39;s fourteen.  Sometime it will quit, but the more you <br/>\nreact to it strongly, the harder it might be for her to give it up on her <br/>\nown.  If she feels like she&#39;ll be doing you a big favor by changing, she <br/>\nmight rather not do that.  If you leave it as either way&#39;s okay, she&#39;ll <br/>\nchoose for herself.  And freaking has no benefit in and of itself.<br/>\n<br/>\n-=-The harder I try  to talk to Sierra and understand why she&#39;s doing what <br/>\nshe&#39;s doing, the more disruptive she&#39;s becoming. -=-<br/>\n<br/>\nThen don&#39;t talk to her about it or ask why.<br/>\n<br/>\nMaybe you could play with her, sometime when the other kids aren&#39;t around and <br/>\nsay &quot;You be me, and I&#39;ll be you.&quot;  Then after playing really nicely for a <br/>\nwhile, you could act like she does sometimes, and say, in her voice, &quot;Guess <br/>\nwhy I&#39;m being this way, Mom&quot; (or whatever she calls you) and then she, as <br/>\nyou, can say something.  It might be profound and it might not be.  Maybe <br/>\nshe&#39;ll get angry that you mimic her.  If so, let it go.  Don&#39;t even talk <br/>\nabout it.  Later when she says that made her mad or she doesn&#39;t do that, you <br/>\ncould casually say it seems like it sometimes to you.  And leave it again.  <br/>\nShe&#39;ll need to think about it in little bits over time, probably, since she <br/>\nlikely doesn&#39;t understand it herself one bit yet.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":139187074,"authorName":"MARK and JULIE SOLICH","from":"&quot;MARK and JULIE SOLICH&quot; &lt;mjsolich@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] still need help","postDate":"1047964684","msgId":61286,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNTcwMWMyZWQwZCRjMTk2MzY4MCQ1NDZhMzJkMkBtYXJrPg==","referencesHeader":"PDAwMWUwMWMyZWNmZCQwYTRiOGU0MCQ2MTAxYThjMEBsYXVuY2htb2RlbS5jb20+"},"prevInTopic":61284,"nextInTopic":61290,"prevInTime":61285,"nextInTime":61287,"topicId":61280,"numMessagesInTopic":0,"msgSnippet":"Mary, I just finished reading Sandra s Leaning on a Truck (again) and maybe instead of trying to get Sierra to talk when she is upset about how she is feeling","messageBody":"<div id=\"ygrps-yiv-1393759535\">Mary,<br/>\n<br/>\nI just finished reading Sandra&#39;s Leaning on a Truck (again) and maybe<br/>\ninstead of trying to get Sierra to talk when she is upset about how she is<br/>\nfeeling you could give her some space to calm down then see if she wants to<br/>\ndo something with you, just the two of you, a puzzle or something. Maybe<br/>\nwith something else to focus on she will be able to start talking. Even if<br/>\nshe doesn&#39;t, the time together can&#39;t hurt!<br/>\n<br/>\nHope this helps.<br/>\n<br/>\nJulie<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message -----<br/>\nFrom: &quot;Mary&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mummy124@...\">mummy124@...</a>&gt;<br/>\nTo: &quot;Unschooling list&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschooling-dotcom@yahoogroups.com\">unschooling-dotcom@yahoogroups.com</a>&gt;<br/>\nSent: Tuesday, March 18, 2003 11:18 AM<br/>\nSubject: [Unschooling-dotcom] still need help<br/>\n<br/>\n<br/>\n&gt; Well Sierra has been okay since the episode I wrote about. Tonight was a<br/>\ndifferent story. It was shower time in the house and Joseph was off to<br/>\nshower in ours and Alyssa and Sierra were to shower in theirs. Joe had the<br/>\nshower going and Alyssa was naked and ready to get in. Sierra was acting<br/>\nsilly and running around and not getting in the bathroom. What started out<br/>\nas being goofy ended up old for Joe as Sierra just wouldn&#39;t get in the<br/>\nrunning shower and of course Alyssa waits for Sierra first. Joe had asked<br/>\nher a few times and she totally disregarded him and kept running around. Of<br/>\ncourse then Alyssa started. After about 5 minutes, Joe yelled at her and she<br/>\nstarted to cry and all hell broke loose.  Joe had apologized to Sierra and<br/>\nexplained why he was upset. When I tried to calm her down, she wouldn&#39;t. I<br/>\nasked if she would please shower now as Alyssa was naked and the water was<br/>\nrunning. She refused and when I tried to talk to her and take her by the<br/>\nhand, she screamed like crazy. Natu<br/>\n&gt; rally Alyssa started to<br/>\n&gt; scream and cry and wouldn&#39;t shower either.<br/>\n&gt;<br/>\n&gt; I ended up leaving Sierra in her room and taking Alyssa in the shower with<br/>\nme.<br/>\n&gt;<br/>\n&gt; Her behavior is really disrupting the rest of the house. It&#39;s upsetting to<br/>\nJoseph and Alyssa is starting to give us a hard time also when Sierra does.<br/>\n&gt;<br/>\n&gt; The harder I try  to talk to Sierra and understand why she&#39;s doing what<br/>\nshe&#39;s doing, the more disruptive she&#39;s becoming.<br/>\n&gt;<br/>\n&gt; Mary B<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ~~~~ Don&#39;t forget! If you change topics, change the subject line! ~~~~<br/>\n&gt;<br/>\n&gt; If you have questions, concerns or problems with this list, please email<br/>\nthe moderator, Joyce Fetteroll (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a>), or the list owner,<br/>\nHelen Hegener (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Editor@...\">HEM-Editor@...</a>).<br/>\n&gt;<br/>\n&gt; To unsubscribe from this group, click on the following link or address an<br/>\nemail to:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-unsubscribe@yahoogroups.com\">Unschooling-dotcom-unsubscribe@yahoogroups.com</a><br/>\n&gt;<br/>\n&gt; Visit the Unschooling website: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n&gt;<br/>\n&gt; Your use of Yahoo! Groups is subject to <a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":129679134,"authorName":"Tia Leschke","from":"Tia Leschke &lt;leschke@...&gt;","profile":"leschke2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] still need help","postDate":"1047962734","msgId":61284,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAzOGEwMWMyZWQwYSRhNjhjZGFlMCQwOTAwYThjMEB3ZXN0Pg==","referencesHeader":"PDAwMWUwMWMyZWNmZCQwYTRiOGU0MCQ2MTAxYThjMEBsYXVuY2htb2RlbS5jb20+IDwzRTc2OTc5NS4wMDAwMDEuMDA1NTZAQW5vbGlja0ZhbWlseT4="},"prevInTopic":61282,"nextInTopic":61286,"prevInTime":61283,"nextInTime":61285,"topicId":61280,"numMessagesInTopic":0,"msgSnippet":"... house ... I think there s a kid Joseph and a dad Joe, but I m not sure.   Tia","messageBody":"<div id=\"ygrps-yiv-707983085\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; I know it is me and not you, but I&#39;m missing something.  First, in our<br/>\n </span></blockquote>house<br/>\n<blockquote><span title=\"ireply\"> &gt; we only have one shower, and low water pressure so we can&#39;t run more than<br/>\n&gt; one thing at a time.  But, if Joe is in his shower, what did he care what<br/>\n&gt; Alyssa and Sierra were doing? Did they have to shower at the same time?<br/>\n<br/>\n </span></blockquote>I think there&#39;s a kid Joseph and a dad Joe, but I&#39;m not sure.  &lt;g&gt;<br/>\nTia</div>","specialLinks":[]},{"userId":141102765,"authorName":"Mary","from":"&quot;Mary&quot; &lt;mummy124@...&gt;","profile":"mummyone24","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] still need help","postDate":"1047962290","msgId":61282,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwN2QwMWMyZWQwOCQyZTFkNzk0MCQ2MTAxYThjMEBsYXVuY2htb2RlbS5jb20+","referencesHeader":"PDAwMWUwMWMyZWNmZCQwYTRiOGU0MCQ2MTAxYThjMEBsYXVuY2htb2RlbS5jb20+IDwzRTc2OTc5NS4wMDAwMDEuMDA1NTZAQW5vbGlja0ZhbWlseT4="},"prevInTopic":61281,"nextInTopic":61284,"prevInTime":61281,"nextInTime":61283,"topicId":61280,"numMessagesInTopic":0,"msgSnippet":"From: Rachel Ann ","messageBody":"<div id=\"ygrps-yiv-1231954641\">From: Rachel Ann <br/>\n<br/>\n  &lt;&lt;I know it is me and not you, but I&#39;m missing something.  First, in our house<br/>\n  we only have one shower, and low water pressure so we can&#39;t run more than<br/>\n  one thing at a time.  But, if Joe is in his shower, what did he care what<br/>\n  Alyssa and Sierra were doing? Did they have to shower at the same time? And<br/>\n  why not just turn off Alyssa and Sierra&#39;s shower till they were ready to get<br/>\n  in? Or why not just get in with Alyssa in the first place and then let<br/>\n  Sierra decide? Was there some sort of other time factor?&gt;&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  The way it&#39;s been done for ages now is that all 3 kids shower at the same time. The kids have decided to do it that way and it&#39;s been working. This way they all get in and out pretty much at the same time and no one feels like they are missing anything. Sometimes they go at different times, it&#39;s up to them. Joseph  (not Joe my husband but the son) was getting in and Sierra and Alyssa decided to shower together in the other bathroom. Sometimes Sierra asks to go by herself and sometimes Alyssa will want to shower with me or who wants to take a bath, etc. This was already decided on and everyone was okay with it. That&#39;s why it was so upsetting. No one was being asked to do anything they didn&#39;t want to. And the shower is never started unless the kids say they are ready. They were ready. Then Sierra decided to be silly. Still okay. They&#39;re kids. But it just went past that. Joe did get a little frustrated and raised his voice and then knew he shouldn&#39;t have and apologized. By then it was way too late.<br/>\n<br/>\n  Mary B  <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":122926724,"authorName":"Rachel Ann","from":"Rachel  Ann &lt;hindar@...&gt;","profile":"salixj","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] still need help","postDate":"1047959445","msgId":61281,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNFNzY5Nzk1LjAwMDAwMS4wMDU1NkBBbm9saWNrRmFtaWx5Pg==","referencesHeader":"PDAwMWUwMWMyZWNmZCQwYTRiOGU0MCQ2MTAxYThjMEBsYXVuY2htb2RlbS5jb20+"},"prevInTopic":61280,"nextInTopic":61282,"prevInTime":61280,"nextInTime":61282,"topicId":61280,"numMessagesInTopic":0,"msgSnippet":"Um, I know it is me and not you, but I m missing something.  First, in our house\nwe only have one shower, and low water pressure so we can t run more than\none","messageBody":"<div id=\"ygrps-yiv-212671017\">Um,\r<br/>\n\r<br/>\nI know it is me and not you, but I&#39;m missing something.  First, in our house<br/>\nwe only have one shower, and low water pressure so we can&#39;t run more than<br/>\none thing at a time.  But, if Joe is in his shower, what did he care what<br/>\nAlyssa and Sierra were doing? Did they have to shower at the same time? And<br/>\nwhy not just turn off Alyssa and Sierra&#39;s shower till they were ready to get<br/>\nin? Or why not just get in with Alyssa in the first place and then let<br/>\nSierra decide? Was there some sort of other time factor? That is where we<br/>\nrun into difficutlies; or when I don&#39;t want to spend an 1 1/2 waiting for<br/>\ntwo kids to get out of the bath (Esther is old enough to be in the bath on<br/>\nher own, but Tehila isn&#39;t old enough to leave for alone. I&#39;m not comfortable<br/>\nin leaving Esther and Tehila alone for a long period of time, though I will<br/>\nfor quick runs to get something etc.).\r<br/>\n\r<br/>\nbe well,\r<br/>\nRachel Ann\r<br/>\n\r<br/>\n\r<br/>\n \r<br/>\n \r<br/>\n\r<br/>\n \r<br/>\n-------Original Message-------\r<br/>\n \r<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a>\r<br/>\nDate: Monday, March 17, 2003 22:20:32\r<br/>\nTo: Unschooling list\r<br/>\nSubject: [Unschooling-dotcom] still need help\r<br/>\n \r<br/>\nWell Sierra has been okay since the episode I wrote about. Tonight was a<br/>\ndifferent story. It was shower time in the house and Joseph was off to<br/>\nshower in ours and Alyssa and Sierra were to shower in theirs. Joe had the<br/>\nshower going and Alyssa was naked and ready to get in. Sierra was acting<br/>\nsilly and running around and not getting in the bathroom. What started out<br/>\nas being goofy ended up old for Joe as Sierra just wouldn&#39;t get in the<br/>\nrunning shower and of course Alyssa waits for Sierra first. Joe had asked<br/>\nher a few times and she totally disregarded him and kept running around. Of<br/>\ncourse then Alyssa started. After about 5 minutes, Joe yelled at her and she<br/>\nstarted to cry and all hell broke loose. Joe had apologized to Sierra and<br/>\nexplained why he was upset. When I tried to calm her down, she wouldn&#39;t. I<br/>\nasked if she would please shower now as Alyssa was naked and the water was<br/>\nrunning. She refused and when I tried to talk to her and take her by the<br/>\nhand, she screamed like crazy.\r<br/>\nNaturally Alyssa started to scream and cry and wouldn&#39;t shower either. \r<br/>\n\r<br/>\nI ended up leaving Sierra in her room and taking Alyssa in the shower with<br/>\nme. \r<br/>\n\r<br/>\nHer behavior is really disrupting the rest of the house. It&#39;s upsetting to<br/>\nJoseph and Alyssa is starting to give us a hard time also when Sierra does.\r<br/>\n\r<br/>\nThe harder I try to talk to Sierra and understand why she&#39;s doing what she&#39;s<br/>\ndoing, the more disruptive she&#39;s becoming. \r<br/>\n\r<br/>\nMary B\r<br/>\n\r<br/>\n\r<br/>\n[Non-text portions of this message have been removed]\r<br/>\n\r<br/>\n\r<br/>\n------------------------ Yahoo! Groups Sponsor ---------------------~--&gt;\r<br/>\nMake Money Online Auctions! Make $500.00 or We Will Give You Thirty Dollars<br/>\nfor Trying!\r<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://us.click.yahoo.com/yMx78A/fNtFAA/46VHAA/0xXolB/TM\">http://us.click.yahoo.com/yMx78A/fNtFAA/46VHAA/0xXolB/TM</a>\r<br/>\n---------------------------------------------------------------------~-&gt;\r<br/>\n\r<br/>\n~~~~ Don&#39;t forget! If you change topics, change the subject line! ~~~~\r<br/>\n\r<br/>\nIf you have questions, concerns or problems with this list, please email the<br/>\nmoderator, Joyce Fetteroll (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a>), or the list owner,<br/>\nHelen Hegener (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Editor@...\">HEM-Editor@...</a>).\r<br/>\n\r<br/>\nTo unsubscribe from this group, click on the following link or address an<br/>\nemail to:\r<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-unsubscribe@yahoogroups.com\">Unschooling-dotcom-unsubscribe@yahoogroups.com</a> \r<br/>\n\r<br/>\nVisit the Unschooling website: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> \r<br/>\n\r<br/>\nYour use of Yahoo! Groups is subject to <a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a> \r<br/>\n\r<br/>\n\r<br/>\n. <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141102765,"authorName":"Mary","from":"&quot;Mary&quot; &lt;mummy124@...&gt;","profile":"mummyone24","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"still need help","postDate":"1047957506","msgId":61280,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMWUwMWMyZWNmZCQwYTRiOGU0MCQ2MTAxYThjMEBsYXVuY2htb2RlbS5jb20+"},"prevInTopic":0,"nextInTopic":61281,"prevInTime":61279,"nextInTime":61281,"topicId":61280,"numMessagesInTopic":0,"msgSnippet":"Well Sierra has been okay since the episode I wrote about. Tonight was a different story. It was shower time in the house and Joseph was off to shower in ours","messageBody":"<div id=\"ygrps-yiv-159984134\">Well Sierra has been okay since the episode I wrote about. Tonight was a different story. It was shower time in the house and Joseph was off to shower in ours and Alyssa and Sierra were to shower in theirs. Joe had the shower going and Alyssa was naked and ready to get in. Sierra was acting silly and running around and not getting in the bathroom. What started out as being goofy ended up old for Joe as Sierra just wouldn&#39;t get in the running shower and of course Alyssa waits for Sierra first. Joe had asked her a few times and she totally disregarded him and kept running around. Of course then Alyssa started. After about 5 minutes, Joe yelled at her and she started to cry and all hell broke loose.  Joe had apologized to Sierra and explained why he was upset. When I tried to calm her down, she wouldn&#39;t. I asked if she would please shower now as Alyssa was naked and the water was running. She refused and when I tried to talk to her and take her by the hand, she screamed like crazy. Naturally Alyssa started to scream and cry and wouldn&#39;t shower either. <br/>\n<br/>\nI ended up leaving Sierra in her room and taking Alyssa in the shower with me. <br/>\n<br/>\nHer behavior is really disrupting the rest of the house. It&#39;s upsetting to Joseph and Alyssa is starting to give us a hard time also when Sierra does.<br/>\n<br/>\nThe harder I try  to talk to Sierra and understand why she&#39;s doing what she&#39;s doing, the more disruptive she&#39;s becoming. <br/>\n<br/>\nMary B<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":61336,"nextTopicId":61350}}