{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":15,"messages":[{"userId":226477113,"authorName":"the ProuseHouse","from":"the ProuseHouse &lt;pstujo@...&gt;","profile":"deannat97","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Porn for the Better... Was: Coming across porn on youtube...","postDate":"1365179461","msgId":71135,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEEwMEI3OTA1LUY4NzUtNEYwOS05RkM4LTVFNkJFNzZEMTZEREBhb2wuY29tPg=="},"prevInTopic":71131,"nextInTopic":0,"prevInTime":71134,"nextInTime":71136,"topicId":71114,"numMessagesInTopic":0,"msgSnippet":"== How could I become as wise as Sandra, Joyce, Meredith, Alex, Pam etc... Their uncanny knack to penetrate the fogginess in my and others questions and","messageBody":"<div id=\"ygrps-yiv-1612361708\">== How could I become as wise as Sandra, Joyce, Meredith, Alex, Pam etc... Their uncanny knack to penetrate the fogginess in my and others questions and thoughts... Do these wonderful ladies have a box with all the answers inside stashed in their closets? Was there a handbook? ==<br/>\n<br/>\nI have been a member of this group for many, many years. Largely a lurker & an avid reader, I have actually posted only a handful of times, though I have sat down to write posts many more times. ;-) I sit & write, re-read what I have written to think it through, and the voices of many of these wise women start popping into my head. Having read so much here, I can almost hear what the responses will be to my questions. My own little magical zen moments of unschooling.<br/>\n<br/>\nI have found it to be yet another means of stepping back, breathing deep, calming oneself, and making the choice to act with intention rather than reacting based on fear. <br/>\n<br/>\nDeanna<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Porn for the Better... Was: Coming across porn on youtube...","postDate":"1365113611","msgId":71131,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBCRTU4NjE3LTZFQUUtNDFERi04Q0NGLTk4RjQ1NTlBNTc4RUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDEzNjUwOTg2NzAuNDQ2OS5ZYWhvb01haWxOZW9Ad2ViMTgyMjAyLm1haWwuYmYxLnlhaG9vLmNvbT4=","referencesHeader":"PGtqazI5YStkNzJjQGVHcm91cHMuY29tPiA8RjhBMTBCNkUtNDRBRS00NzAzLUIxODgtOTgwNzI4RTRCRUJFQFNhbmRyYWRvZGQuY29tPiA8MTM2NTA5ODY3MC40NDY5LllhaG9vTWFpbE5lb0B3ZWIxODIyMDIubWFpbC5iZjEueWFob28uY29tPg=="},"prevInTopic":71130,"nextInTopic":71135,"prevInTime":71130,"nextInTime":71132,"topicId":71114,"numMessagesInTopic":0,"msgSnippet":"-=-Now my first tendency is to scream back and tell him that I do all this for him and yadda yadda and go on and be mad at him for being grumpy.-=- I still do","messageBody":"<div id=\"ygrps-yiv-1119038876\">-=-Now my first tendency is to scream back and tell him that I do all this for him and yadda yadda and go on and be mad at him for being grumpy.-=-<br/>\n<br/>\nI still do that sometimes.  It sometimes means that I myself am tired or hungry or that I forgot to stop and breathe, and that I&#39;m acting thougtlessly. It&#39;s not good.<br/>\n<br/>\nWhen my mom yelled at me, she sometimes muttered audibly to herself afterwardsabout how ungrateful I was and how tired she was of my bratty behavior, and kept a negative wall up around her.  She never felt guilty for being aggressive or insulting, as far as she ever let me know.<br/>\n<br/>\nWhen I&#39;m unthinkingly yucky, I feel bad every time, and it helps me remember to do better, when I remember to keep myself rested, watered, fed, and mindful.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Porn for the Better... Was: Coming across porn on youtube...","postDate":"1365098670","msgId":71130,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNjUwOTg2NzAuNDQ2OS5ZYWhvb01haWxOZW9Ad2ViMTgyMjAyLm1haWwuYmYxLnlhaG9vLmNvbT4=","inReplyToHeader":"PEY4QTEwQjZFLTQ0QUUtNDcwMy1CMTg4LTk4MDcyOEU0QkVCRUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGtqazI5YStkNzJjQGVHcm91cHMuY29tPiA8RjhBMTBCNkUtNDRBRS00NzAzLUIxODgtOTgwNzI4RTRCRUJFQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":71129,"nextInTopic":71131,"prevInTime":71129,"nextInTime":71131,"topicId":71114,"numMessagesInTopic":0,"msgSnippet":" I have learned and still learning to just stop for a moment. When a situation arises that I feel that mental fog and I am  not able to think the best way to","messageBody":"<div id=\"ygrps-yiv-93492715\"> I have learned and still learning to just stop for a moment.<br/>\nWhen a situation arises that I feel that mental fog and I am  not able to think the best way to respond or handle it I take the advice I learned in this list.<br/>\n<br/>\nI stop, I take deep breaths, I calm down and I think of different choices I can make at the moment  and where those will lead me.<br/>\nIf you have a clear picture of what principles are important to you and what are my goals then it makes it easier to decide which path to take.<br/>\n<br/>\nIf learning, joy and strong relationships are important to me , and not a child that do as I am told or get good grades, then I can pick what will most likely lead us there as a team.<br/>\n<br/>\nThe other day my son was really in a bad mood and grumpy. I was frustrated and my mind got foggy. So I stepped away and kept thinking about when I was  that age and was tired and grumpy ( he had few hours of sleeps for a few days leading to that).<br/>\nI thought about how my response would affect our relationship and how he feels when I am not mindful with my words. I thought about how I would react if my husband was grumpy and tired.<br/>\n<br/>\nAll I did was make sure to leave him alone as he wanted, made sure to make his favorite foods so he had had lots of yummy stuff and talked to him without getting loud and mean ( which I do tend to take it personally and have a not nice tone of voice). Two days latter he was the happiest guy  and being the sweetest son and brother. He has been that way since.<br/>\nNow my first tendency is to scream back and tell him that I do all this for him and yadda yadda and go on and be mad at him for being grumpy.<br/>\n<br/>\nBut I stopped,took deep breaths, thought about choices, what was important and what would help him if he was feeling overwhelmed, tired and grumpy.<br/>\nI thought about how he reacts to kindness over me being upset and it was easy to decide.<br/>\n<br/>\nIt does get easier. Stop, deeps breaths, think of choices and where you want to go. <br/>\nThat is why clarity is so important and mindfulness.  Because if you are not stopping to think then you are being thoughtless.<br/>\nAnd that is why using clear words will lead to more clear thinking.<br/>\n <br/>\nI learned all this here. I learned from Sandra and other wonderful people here who challenged my words and  made me stop to think. <br/>\nBecause when you make a conscious choice to use the words you really mean it helps you have more clarity of thought and  a clear picture of where you want to go and that leads you to be able to see choices and make them mindfully and not just as a knee jerk reaction.<br/>\n<br/>\nNow I know some people complain that this list is too pick and that they will pick every word you write here and take it apart and how this is not nice.<br/>\nNow I say that is very very important if you really want to have clarity, mindfulness and understanding why you are doing what you are doing. Without that you are only trying to follow a new set of rules. <br/>\n<br/>\nThat is why people come to unschooling and they read something like no food limits and they do not understand they why and what to do  with that. That it takes more  than just no limiting. <br/>\n<br/>\nIn this case it takes being proactive making some monkey platters,offering foods beofre children are too hungry, making sure child is being presented with foods they like and new ones, decorating food plates if that makes it more appealing and much more than just no limits.<br/>\n<br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Porn for the Better... Was: Coming across porn on youtube...","postDate":"1365092780","msgId":71129,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY4QTEwQjZFLTQ0QUUtNDcwMy1CMTg4LTk4MDcyOEU0QkVCRUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGtqazI5YStkNzJjQGVHcm91cHMuY29tPg==","referencesHeader":"PGtqazI5YStkNzJjQGVHcm91cHMuY29tPg=="},"prevInTopic":71128,"nextInTopic":71130,"prevInTime":71128,"nextInTime":71130,"topicId":71114,"numMessagesInTopic":0,"msgSnippet":"-=-How could I become as wise as Sandra, Joyce, Meredith, Alex, Pam etc... Their uncanny knack to penetrate the fogginess in my and others questions and","messageBody":"<div id=\"ygrps-yiv-780910448\">-=-How could I become as wise as Sandra, Joyce, Meredith, Alex, Pam etc... Their uncanny knack to penetrate the fogginess in my and others questions and thoughts... Do these wonderful ladies have a box with all the answers inside stashed in their closets? Was there a handbook? Insight for Dummies..? And if so, can I get that as a package deal with the Big Book? No, probably not.-=-<br/>\n<br/>\nOh, Yikes!  I think it&#39;s not always knowing in the moment, it&#39;s being analytical afterwards.  Lots of guys can describe battles and tell you what could&#39;ve changed the outcome, who wouldn&#39;t know how to organize a poker game, or load a gun.   <br/>\n<br/>\nSometimes things seem very clear from the outside to people who have no emotional involvement. :-)<br/>\n<br/>\nAnd partly it&#39;s experience, not only with our own kids, but seeing other families flounder and recover (or not).<br/>\n<br/>\n-=-I think when looking for Better now, I can also look for what is going to be empowering. Whenever something comes up for me regards to the girls well-being, it is almost always born from fear... But that is about &#39;me&#39;, not about them. They aren&#39;t fearful...-=-<br/>\n<br/>\nThat&#39;s it!  That&#39;s the answer box!  Principles guiding choices. :-)<br/>\nEmpowerment outranks fear in your decision-making engine.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":392629073,"authorName":"natarsha","from":"&quot;natarsha&quot; &lt;yeshi_khadro@...&gt;","profile":"natarsha","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Porn for the Better... Was: Coming across porn on youtube...","postDate":"1365085290","msgId":71128,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtqazI5YStkNzJjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDc1MzM4NEZFLTk0MkMtNDJGQS1CQUNFLTQ1QkVDMzQwNEM1NEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":71124,"nextInTopic":71129,"prevInTime":71127,"nextInTime":71129,"topicId":71114,"numMessagesInTopic":0,"msgSnippet":"Porn = Fear or Empowerment... Fear - a distressing emotion aroused by impending danger, evil, pain, etc... Empowerment - to enable... To make able, give","messageBody":"<div id=\"ygrps-yiv-1661639660\">Porn = Fear or Empowerment...<br/>\n&quot;Fear - a distressing emotion aroused by impending danger, evil, pain, etc...&quot;<br/>\n&quot;Empowerment - to enable... To make able, give power, competence&quot;<br/>\n<br/>\nI think I know which one I&#39;ll choose...<br/>\n<br/>\nPost-porn post, while awaiting words of wisdom to appear in my email, I had been wondering how I could come to know what the &#39;Better&#39; was for myself, even when I was ill equipped... What was the magic key that would unlock a part of my brain that could figure this out even when my emotions stood in the way. How could I become as wise as Sandra, Joyce, Meredith, Alex, Pam etc... Their uncanny knack to penetrate the fogginess in my and others questions and thoughts... Do these wonderful ladies have a box with all the answers inside stashed in their closets? Was there a handbook? Insight for Dummies..? And if so, can I get that as a package deal with the Big Book? No, probably not.<br/>\n<br/>\nOne thing that did strike me is that whenever I am trying to &#39;protect&#39; my children, it is born from fear. Fear of the turmoil of school, fear of physical and emotional harm, fear of the &#39;dangers of the internet!&#39; =) Just recently we watched some Stranger Danger videos... A correlation between the video and the advice given on many a subject discussed on Always Learning was that they are imparting empowerment..  For Stranger Danger, there was &#39;Yell, Run and Tell&#39;, tools to enable the target to avoid harm. On list, when dealing with food issues, the freedom of choice empowers children to listen to their bodies; porn,  a well balanced approach enables a healthy sexuality, the links provided were fantastic too I might add.<br/>\n<br/>\nI think when looking for Better now, I can also look for what is going to be empowering. Whenever something comes up for me regards to the girls well-being, it is almost always born from fear... But that is about &#39;me&#39;, not about them. They aren&#39;t fearful about when they are going to learn to read or how long it will take, there&#39;s no fear in having ice-cream for breakfast (which hardly ever happens and they&#39;ve been able to do that for a couple of years now)... Easter isn&#39;t a villainous corporation come to suck their lifeblood just like Cupid or Santa! But a sweet fluffy Easter Bunny who simply wants to share his candy coated poop with us! =)  No fear, just joy and learning... <br/>\n<br/>\nNot only will I continue to Read a little, Try a Little, Wait a While, Watch... But somewhere in-between, I&#39;ll step outside of myself and see the children for who they are and not through fear coloured glasses... Which according to some is black... Hmmm... I&#39;d rather see them through Rainbows! =)<br/>\n<br/>\nEmpowerment... Better than Fear.<br/>\n<br/>\nPS: The word Idiot now makes me smile in amusement =)</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Coming across porn on youtube...","postDate":"1365029356","msgId":71124,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc1MzM4NEZFLTk0MkMtNDJGQS1CQUNFLTQ1QkVDMzQwNEM1NEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PENBSDBBUmtaOXpfMDRLUjI4NWNSVXArUVU3bVFaam9QUFowKy1YekZrRE52a0JUemRDZ0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PENBSDBBUmtaOXpfMDRLUjI4NWNSVXArUVU3bVFaam9QUFowKy1YekZrRE52a0JUemRDZ0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":71123,"nextInTopic":71128,"prevInTime":71123,"nextInTime":71125,"topicId":71114,"numMessagesInTopic":0,"msgSnippet":"Thanks, Jason. I ve removed another couple of posts from this queue, because it s not really the business of Always Learning to worry about how or YouTube","messageBody":"<div id=\"ygrps-yiv-1267313938\">Thanks, Jason.<br/>\n<br/>\nI&#39;ve removed another couple of posts from this queue, because it&#39;s not really the business of Always Learning to worry about how or YouTube works.  <br/>\n<br/>\nOne person whose post was removed wrote &quot;I was responding to a post which you also should say something about since it had absolutely NOTHING to do with unschooling Sandra.....think about it....thats what you need to do idiot.&quot;<br/>\n<br/>\nHere is why a question from a mother asking how she might handle her child&#39;s questions about porn has to do with unschooling:  It&#39;s a mother asking about how to deal with her unschooled child&#39;s questions in an unschooling-friendly way, in a productive way, in such a way that trust is maintained and the relationship is strengthened.<br/>\n<br/>\nI don&#39;t feel at all like an idiot for understanding that.<br/>\n<br/>\nI don&#39;t feel like an idiot for having this discussion list and keeping it on topic.<br/>\n<br/>\nI don&#39;t feel like an idiot for having these guidelines for posts:  <br/>\n<br/>\nPosts for this list need to fulfill at least one of these criteria:<br/>\n<br/>\nhelps lots of people understand unschooling<br/>\nasks a question that actually needs an answer<br/>\nrequests help seeing different aspects of a situation<br/>\nhelps people have more peaceful and joyful lives (helps lots of people on the list)<br/>\nALL posts should be<br/>\nhonest<br/>\nproofread<br/>\nsincere<br/>\nclear<br/>\nNO posts should be just a &quot;thank you&quot; or &quot;me too&quot; or &quot;cool&quot; or &quot;LOL&quot;<br/>\n<br/>\nAnyone who thinks those guidelines are oppressive or too difficult to understand should drop off the list.  It will be better for everyone. <br/>\n<br/>\nAnyone who thinks I&#39;m an idiot might want to drop off the list, because I&#39;ve been doing it the same way for a long time.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":532614690,"authorName":"Jason Price","from":"Jason Price &lt;froomens@...&gt;","profile":"froomens","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Coming across porn on youtube...","postDate":"1365018413","msgId":71123,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBSDBBUmtaOXpfMDRLUjI4NWNSVXArUVU3bVFaam9QUFowKy1YekZrRE52a0JUemRDZ0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":71122,"nextInTopic":71124,"prevInTime":71122,"nextInTime":71124,"topicId":71114,"numMessagesInTopic":0,"msgSnippet":"The removal of material that violates community guidelines on YouTube is virtually immediate, especially when searching for things, since if you search for","messageBody":"<div id=\"ygrps-yiv-2032929782\">The removal of material that violates community guidelines on YouTube is<br/>\nvirtually immediate, especially when searching for things, since if you<br/>\nsearch for something, the top results will be popular videos that have<br/>\nexisted for a while, which are videos that are decent enough to have not<br/>\nbeen removed. Still, there&#39;s plenty of &quot;questionable content&quot; on YouTube<br/>\nbut I bet that &quot;porn&quot; hardly qualifies as porn at least according to the<br/>\nguidelines. When trolls raid the &quot;new videos&quot; queue by mass-uploading<br/>\nactual porn, they still get removed quickly, especially since these attacks<br/>\ncan be anticipated as the attacks are planned on public forums.<br/>\n-- <br/>\nJason Price<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Coming across porn on youtube...","postDate":"1365013323","msgId":71122,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ5RTMwQTI4LTMyNDUtNDRGQy1COEI2LTg5Mjg3NjczMzdBNEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGtqaGp0YitqbmFrQGVHcm91cHMuY29tPg==","referencesHeader":"PGtqaGp0YitqbmFrQGVHcm91cHMuY29tPg=="},"prevInTopic":71121,"nextInTopic":71123,"prevInTime":71121,"nextInTime":71123,"topicId":71114,"numMessagesInTopic":0,"msgSnippet":"-=-Oh my God!! My son watches YouTube, when I told him about this, his reply was that usuallly anything explicit, porn, etc. is immediately banned from the","messageBody":"<div id=\"ygrps-yiv-1028807123\">-=-Oh my God!! My son watches YouTube, when I told him about this, his reply was that usuallly anything explicit, porn, etc. is immediately banned from the website but that sometimes they are able to get through the filters. Do they immediately Ban?-=-<br/>\n<br/>\n&quot;They&quot; who?<br/>\n&quot;Immediately&quot; how?<br/>\n&quot;The filters&quot; what?<br/>\n<br/>\nProbably there are editor types who watch videos and chuck out nasty ones, don&#39;t you think?  I doubt they have penis-detecting video programs.  <br/>\n<br/>\nThere are, in the real world, nasty things.  The first nasty things I saw were in school, on paper.  A torn-out page from a magazine, showing nude sunbathers on a beach in France. :-)  They were all about the size of my finger, and what we were interested in was that their pubic hair matched the hair on their heads.  I grew up in a very dark-haired town, and we were just 13, not yet required to take physical education, not yet having much pubic hair.  It hadn&#39;t occurred to many of us that people could have red or blond hair &quot;down there.&quot;    We couldn&#39;t see much more than that. :-)  Not very nasty, but if the folded-up page had been discovered, it would have been confiscated and someone would have been in trouble.<br/>\n<br/>\nThen there was a Victorian novel going around, we were sharing�read it and bring it back.   I didn&#39;t finish it.  It was boring and irritating, and I&#39;m glad I got the chance to  figure that out on my own. Someone probably got caught with it, Russian-roulette style, and got in trouble.  I wasn&#39;t the one.  I never heard where it ended up.<br/>\n<br/>\nI think the lure of pornography might be related to whether a teen would leave with a stranger.  It all depends how rich life is otherwise.  <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/onlinesafety\">http://sandradodd.com/onlinesafety</a><br/>\n<br/>\nSandra    <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Coming across porn on youtube...","postDate":"1365009642","msgId":71121,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtqaG9kYStodTU4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGtqaGp0YitqbmFrQGVHcm91cHMuY29tPg=="},"prevInTopic":71120,"nextInTopic":71122,"prevInTime":71120,"nextInTime":71122,"topicId":71114,"numMessagesInTopic":0,"msgSnippet":"... *************** Immediate is a problematic word when you re talking about a site with such a huge volume of material. They get to what they can, when","messageBody":"<div id=\"ygrps-yiv-370274142\">&quot;Cindi&quot; &lt;jerseerose@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Oh my God!!  My son watches YouTube, when I told him about this, his reply was that usuallly anything explicit, porn, etc. is immediately banned from the website but that sometimes they are able to get through the filters.  Do they immediately Ban?<br/>\n </span></blockquote>***************<br/>\n<br/>\n&quot;Immediate&quot; is a problematic word when you&#39;re talking about a site with such a huge volume of material. They get to what they can, when they can, but there&#39;s always more. Over time people who watch a lot of Youtube develop their own personal &quot;filter&quot; - in their heads, I mean. There are things you learn not to search for, words you learn to avoid, but things do get through All the filters.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":345291473,"authorName":"Cindi","from":"&quot;Cindi&quot; &lt;jerseerose@...&gt;","profile":"jerseerose","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Coming across porn on youtube...","postDate":"1365005035","msgId":71120,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtqaGp0YitqbmFrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzNjQ5MTI3NzcuOTg3OTEuWWFob29NYWlsTmVvQHdlYjE4MjIwNi5tYWlsLmJmMS55YWhvby5jb20+"},"prevInTopic":71118,"nextInTopic":71121,"prevInTime":71119,"nextInTime":71121,"topicId":71114,"numMessagesInTopic":0,"msgSnippet":"Oh my God!!  My son watches YouTube, when I told him about this, his reply was that usuallly anything explicit, porn, etc. is immediately banned from the","messageBody":"<div id=\"ygrps-yiv-1343074014\">Oh my God!!  My son watches YouTube, when I told him about this, his reply was that usuallly anything explicit, porn, etc. is immediately banned from the website but that sometimes they are able to get through the filters.  Do they immediately Ban?<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; A few months ago my son came across some Hentai, which is Anime with sexually explicit/porn, and there are some nasty ones. The one he saw he told me what it was and he said it horrified him. <br/>\n&gt;  Now he is very shy about sex  but he seems to know a lot because he can joke about things and we ask him if he knows and he says he does. I decided to showed him the website Scarleteen:<br/>\n&gt; <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.scarleteen.com/\">http://www.scarleteen.com/</a><br/>\n&gt; <br/>\n&gt; <br/>\n&gt; It is a great sex ed site for young teens/adults about sex. That way he could read on his own in a place with healthy and direct  information.<br/>\n&gt; I remember when my brother would come home with friends and some porn movies to watch  and he grew up very healthy, has been married for over 20 years and loves his wife. My brother also used to ask me and our sister , we are older, for  sex advice. It was really sweet that he did. He wanted to make sure his girlfriend at the time was happy.<br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; Alex Polikowsky<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Coming across porn on youtube...","postDate":"1364941414","msgId":71118,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtqZmxwNitqZjExQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGtqZGpmOCtiZGJxQGVHcm91cHMuY29tPg=="},"prevInTopic":71117,"nextInTopic":71120,"prevInTime":71117,"nextInTime":71119,"topicId":71114,"numMessagesInTopic":0,"msgSnippet":"... ************ When I was 11 some girlfriends of mine and I formed a book club which was all about looking for the naughty bits in the books our moms had","messageBody":"<div id=\"ygrps-yiv-835703409\">&quot;natarsha&quot; &lt;yeshi_khadro@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; However she is also curious (which is normal) as she kept asking me what I would think if she were to look at porn being a 10 year old? <br/>\n </span></blockquote>************<br/>\n<br/>\nWhen I was 11 some girlfriends of mine and I formed a &quot;book club&quot; which was all about looking for the &quot;naughty bits&quot; in the books our moms had around the house. We&#39;d get together and read parts out loud to each other and giggle over them. Valley of the Horses was a bestseller that year, so we read that (loooooots of sex) and assorted other fiction, mostly in the fantasy genre but we also read Crabs on the Rampage which was horror with a lot of sex (and in retrospect hilarious, but none of us had heard of pubic lice as &quot;crabs&quot; at that point so we missed the joke). We weren&#39;t interested in looking at pictures, just reading and hearing others read - typical of girls.<br/>\n<br/>\nMy daughter&#39;s 11 now, and watches youtube, looks up images, plays around on the site Deviant Art, reads comics - so she&#39;s run into picture-porn already. She still doesn&#39;t even like to see picutres of people kissing. But we listen to audio books together and now and then we&#39;ve had a sex scene I didn&#39;t expect - one of our favorite authors is usually very circumspect, but now and then sex is germaine to the plot or character development. When it happens I wait to see how Mo will respond - I&#39;ve skipped other scenes when they&#39;ve been too scary for her - and so far she hasn&#39;t been upset or offended or embarrassed. She&#39;s not a talker, so at most she&#39;s agreed when I&#39;ve said &quot;that was pretty steamy!&quot; But she also hasn&#39;t reacted the way she does to kissing or picture-porn. I&#39;m glad to say it (this author&#39;s writing) has all been pretty good sex, and the focus has been on the character&#39;s emotions and relationship dynamics - soft core, thoughtful erotica. Had it been anything else, I&#39;d probably not listen to that author&#39;s books with Mo without knowing what was in them so I could warn her, the same way I warn her about gory parts or scary parts she might want to avoid. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Coming across porn on youtube...","postDate":"1364912777","msgId":71117,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNjQ5MTI3NzcuOTg3OTEuWWFob29NYWlsTmVvQHdlYjE4MjIwNi5tYWlsLmJmMS55YWhvby5jb20+","inReplyToHeader":"PEI3MjhBQzk3LTc1RjAtNDQwQy1CNTBGLTU5NTlDMTU0RURCN0BTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGtqZGpmOCtiZGJxQGVHcm91cHMuY29tPiA8QjcyOEFDOTctNzVGMC00NDBDLUI1MEYtNTk1OUMxNTRFREI3QFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":71116,"nextInTopic":71118,"prevInTime":71116,"nextInTime":71118,"topicId":71114,"numMessagesInTopic":0,"msgSnippet":"A few months ago my son came across some Hentai, which is Anime with sexually explicit/porn, and there are some nasty ones. The one he saw he told me what it","messageBody":"<div id=\"ygrps-yiv-120680335\">A few months ago my son came across some Hentai, which is Anime with sexually explicit/porn, and there are some nasty ones. The one he saw he told me what it was and he said it horrified him. <br/>\n Now he is very shy about sex  but he seems to know a lot because he can joke about things and we ask him if he knows and he says he does. I decided to showed him the website Scarleteen:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.scarleteen.com/\">http://www.scarleteen.com/</a><br/>\n<br/>\n<br/>\nIt is a great sex ed site for young teens/adults about sex. That way he could read on his own in a place with healthy and direct  information.<br/>\nI remember when my brother would come home with friends and some porn movies to watch  and he grew up very healthy, has been married for over 20 years and loves his wife. My brother also used to ask me and our sister , we are older, for  sex advice. It was really sweet that he did. He wanted to make sure his girlfriend at the time was happy.<br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Coming across porn on youtube...","postDate":"1364900311","msgId":71116,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI3MjhBQzk3LTc1RjAtNDQwQy1CNTBGLTU5NTlDMTU0RURCN0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGtqZGpmOCtiZGJxQGVHcm91cHMuY29tPg==","referencesHeader":"PGtqZGpmOCtiZGJxQGVHcm91cHMuY29tPg=="},"prevInTopic":71115,"nextInTopic":71117,"prevInTime":71115,"nextInTime":71117,"topicId":71114,"numMessagesInTopic":0,"msgSnippet":"-=- I first thought it was food but then I found out it wasn t... It is the sex thing.-=- Did you explain that sometimes people say food porn meaning","messageBody":"<div id=\"ygrps-yiv-2036316987\">-=- I first thought it was food but then I found out it wasn&#39;t... It is the sex thing.-=-<br/>\n<br/>\nDid you explain that sometimes people say &quot;food porn&quot; meaning beautiful photos of food people look at lustily or longingly?  :-)<br/>\n<br/>\nDid you take the word apart and explain to her what it is?  Pornography<br/>\nYou could mention other &quot;-graph&quot; words (phonograph, telegraph, calligraph, which are sound writing, distant writing, beautiful writing... and find some others?)<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://etymonline.com/?term=pornography\">http://etymonline.com/?term=pornography</a><br/>\n<br/>\nKeith and I were watching CBS Sunday Morning (a magazine show) and there was a bit about a very successful author of &quot;erotic romance novels,&quot; also sometimes known as &quot;erotica.&quot;  These are books mostly read by women, and they can be REALLY filthy nasty.  I own some.  Regular fiction for women, &quot;regular&quot; romance novels, often have two scenes out of 400 pages or whatever that are sexy/nasty, and have had since at least the 1970&#39;s.    Keith and I were discussing it afterwards.   Because &quot;erotic novels&quot; are words and not pictures, it&#39;s not illegal to have them on the computer.  But for people who are more visual about it (men, generally), there is the danger of prison, being marked for life as a sex offender, loss of jobs and houses.... it&#39;s not very fair.<br/>\n<br/>\nTelling a child there are just tons of legal, moral, political and religious problems and it&#39;s best to avoid porn as much and as long as possible (&quot;forever&quot; never hurt anybody) is probably good advice.  But don&#39;t set yourself up as the gatekeeper or say &quot;NEVER look at porn in this house,&quot; because you create an adversarial relationship and it can cause sneakiness and fear.   <br/>\n<br/>\nHere&#39;s a story of something that happened here when Marty was older than your daughter is, but much younger than he is now, and some other unschooler&#39;s sharings:   <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/sex\">http://sandradodd.com/sex</a><br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":504505579,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Coming across porn on youtube...","postDate":"1364879555","msgId":71115,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBT09UYVhOR3lpVStWMTNIaDZxZHJ0WDB0RXBXYTBpTVoydUtkM3c3Uj1UNTJodGR5UUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGtqZGpmOCtiZGJxQGVHcm91cHMuY29tPg==","referencesHeader":"PGtqZGpmOCtiZGJxQGVHcm91cHMuY29tPg=="},"prevInTopic":71114,"nextInTopic":71116,"prevInTime":71114,"nextInTime":71116,"topicId":71114,"numMessagesInTopic":0,"msgSnippet":"... Cool she brought it to your attention. I don t think you handled it badly - few of us are prepared when our kids bring these things up sort of out of ","messageBody":"<div id=\"ygrps-yiv-1269911190\">On Mon, Apr 1, 2013 at 8:31 PM, natarsha &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:yeshi_khadro@...\">yeshi_khadro@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Pema finished the conversation by telling me she didn&#39;t want to talk about<br/>\n&gt; it anymore and wanted to get back to her game...<br/>\n<br/>\n<br/>\n </span></blockquote>Cool she brought it to your attention. I don&#39;t think you handled it badly -<br/>\nfew of us are prepared when our kids bring these things up sort of out of<br/>\nnowhere and most of us have that &quot;brain turning to mush&quot; feeling when that<br/>\nhappens. With my oldest daughter I remember once we were just hanging out<br/>\nand she suddenly asked us, &quot;But how does the man actually put the sperm<br/>\nINTO the woman?&quot;<br/>\n<br/>\nBut - I think it is better if this kind of thing is more casually mentioned<br/>\nhere and there as it comes up naturally rather than avoiding it and ending<br/>\nup with a big talk that is uncomfortable. With my kids it was just<br/>\nsomething that existed and came up in conversation - probably mostly in<br/>\njokes. It slowly dawned on them what porn was and what it might entail.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":392629073,"authorName":"natarsha","from":"&quot;natarsha&quot; &lt;yeshi_khadro@...&gt;","profile":"natarsha","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Coming across porn on youtube...","postDate":"1364873512","msgId":71114,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtqZGpmOCtiZGJxQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":71115,"prevInTime":71113,"nextInTime":71115,"topicId":71114,"numMessagesInTopic":0,"msgSnippet":"Soooooooooo..... My daughter (10) came to me the other night to discuss porn with me... Yes folks that s right, PORN!!! She very frankly said (and she isn t","messageBody":"<div id=\"ygrps-yiv-807482233\">Soooooooooo..... My daughter (10) came to me the other night to discuss porn with me... Yes folks that&#39;s right, PORN!!! She very frankly said (and she isn&#39;t one of many words) that (I&#39;ll paraphrase:)<br/>\n<br/>\n&quot;I have come across this thing called porn and I know what it is now Mum, the &#39;sex&#39;&quot; (which we now call &#39;woohoo&#39; thanks to Sims =) &quot;and I am getting older now so I know these things... I first thought it was food but then I found out it wasn&#39;t... It is the sex thing.&quot; She went on &quot;I am telling you this because I want you to understand me.&quot; (She made this comment a couple of times actually). <br/>\n<br/>\nTo explain better, Pema watches youtube cartoons that other people have made. I think that the &#39;porn&#39; she is referring to is from these shows. Our computer is in the living room (she wears headphones) where we all hang out and this is the only thing I have seen. She does shrink things she isn&#39;t comfortable with me seeing and they are also animated... Mostly My Little Pony fan stuff etc... or gruesome fan art.. bloody animal drawings.. fighting cats etc... There&#39;s a definite fanbase for that.. She also draws her own on the PC...<br/>\n<br/>\nHer reactions to &#39;porn&#39; (as she understands it) is of avoidance eg: &quot;There was a picture of this ladies face (?) smiling so I didn&#39;t think anything of it but when I continued it wasn&#39;t what I thought and I &#39;ran away&#39; and got out of there. So now I don&#39;t click on some things cause I think it will be porn and that&#39;s eryugh.&quot;<br/>\n<br/>\nHowever she is also curious (which is normal) as she kept asking me what I would think if she were to look at porn being a 10 year old? Should she wait till she is 13 - a teenager (her words)... My discomfort set in rapidly then and the best I could offer as my mind went to mush yet trying to remain composed externally was that &#39;Porn is only available legally to people that are 18. And that I understand she is curious and that it is normal to be curious. That porn comes in various forms and that sometimes when we see something, we can&#39;t &#39;un&#39;see it... (This has come up before when she was very curious about video games with horror/gore involved etc...) We spoke about her not sharing this with her friends as it wouldn&#39;t be appropriate and she was very quick to say &#39;Oh no, I wouldn&#39;t! That&#39;s why I am talking to you about it Mum.&#39; She asked me when I first saw porn, how old was I. I told her I was a teenager around 14/15 as my brother (2 years older) came home with videos for him and his friends to watch.... Also I had come across it before when I was younger when the same brother brought magazines home which my Nanna then took out the backyard and burnt (they weren&#39;t his)... I also was honest and explained that I personally wasn&#39;t comfortable with porn as I felt there isn&#39;t a lot of respect for women involved. (However didn&#39;t further explain as I&#39;m fairly certain the porn she is talking about isn&#39;t &#39;real&#39; people (not to dismiss cartoon porn though!)... And that&#39;s another can of worms and perhaps I shouldn&#39;t have made that comment... Therein is my plea for assistance!<br/>\n<br/>\nSo...I would really appreciate advice on this... I don&#39;t think I could or would say she must not look at it at all until she is 18 (that&#39;s so far away anyway it wouldn&#39;t be possible to police everything and usually by teenagedom we come across it ourselves one way or another). How do I show her the respect she so bravely approached me for (as she said she was concerned how I would react... yet I don&#39;t react badly about most things.. I hope)and at the same time &#39;protect&#39; her...??? I can feel my mind starting to go to mush again! LOL... Deep breaths...<br/>\n<br/>\nPema finished the conversation by telling me she didn&#39;t want to talk about it anymore and wanted to get back to her game...<br/>\n<br/>\nThanks<br/>\nNatarsha</div>","specialLinks":[]}],"prevTopicId":71126,"nextTopicId":71148}}