{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Why I love TV and saying YES","postDate":"1143228934","msgId":24882,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2MTQ3QUExLTBGNDAtNEQzNS1BQjRGLUJBNzQ2Qjk0NDBCNkBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEJBWTUtREFWNjAyNzJENzlENEUyRDdENEI3Mzc0QzlERjBAcGh4LmdibD4=","referencesHeader":"PDIwMDYwMzI0MTYzMDUwLjI5MDg3LnFtYWlsQHdlYjUyMzA3Lm1haWwueWFob28uY29tPiA8QkFZNS1EQVY2MDI3MkQ3OUQ0RTJEN0Q0QjczNzRDOURGMEBwaHguZ2JsPg=="},"prevInTopic":24880,"nextInTopic":0,"prevInTime":24881,"nextInTime":24883,"topicId":24880,"numMessagesInTopic":0,"msgSnippet":"... When Marty was 12 or 13, I think, we were at Page 1, a big bookstore here, and I was looking through the laminated subject summaries they make for college","messageBody":"<div id=\"ygrps-yiv-466209933\">On Mar 24, 2006, at 12:24 PM, Y_be_norml create_your_reality wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  MY son is very detailed about his knowledge in mythology . He  <br/>\n&gt; knows things that most others adults don&#39;t remember or never knew  <br/>\n&gt; and he makes his own judgment or conclusion as to the meaning of  <br/>\n&gt; the story.  He is usually more profound in his explanations than I  <br/>\n&gt; have every heard others be.<br/>\n<br/>\n<br/>\n </span></blockquote>When Marty was 12 or 13, I think, we were at Page 1, a big bookstore  <br/>\nhere, and I was looking through the laminated subject summaries they  <br/>\nmake for college classes.  I&#39;ve always really liked those, the way  <br/>\nsomeone will try to put the most important parts of a topic on two or  <br/>\nfour pages.  And I was picking a few to take home—taxonomy, anatomy,  <br/>\nhtml, periodic chart of the elements— and Marty was looking at one on  <br/>\nGreek Mythology, and complaining that they hadn&#39;t given sources or  <br/>\nalternate versions of stories!  I was just kinda blown away by it.   <br/>\nHe was going on about how someone wasn&#39;t considered to be someone  <br/>\nelse&#39;s mother necessarily, it was just...    I didn&#39;t even know what  <br/>\nhe was talking about!  So I put it in my pile, and on the way home he  <br/>\ntold me stories, and told me what he had just recently learned about  <br/>\nwhat some archeologists had discovered in Crete that they were tying  <br/>\nto the stories of the Minotaur and...    !!  Some of it he had from  <br/>\nvideo games, some from movies, some from things he had read.  He had  <br/>\ngathered and compared and categorized this stuff in his head always,  <br/>\nwithout fanfare, with no need to ever report it &quot;for credit,&quot; or to  <br/>\nfeel his unit was finished.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":261239354,"authorName":"Y_be_norml create_your_reality","from":"&quot;Y_be_norml create_your_reality&quot; &lt;y_be_norml@...&gt;","profile":"thfamily3","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Why I love TV and saying YES","postDate":"1143228252","msgId":24880,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTUtREFWNjAyNzJENzlENEUyRDdENEI3Mzc0QzlERjBAcGh4LmdibD4=","referencesHeader":"PDIwMDYwMzI0MTYzMDUwLjI5MDg3LnFtYWlsQHdlYjUyMzA3Lm1haWwueWFob28uY29tPg=="},"prevInTopic":0,"nextInTopic":24882,"prevInTime":24879,"nextInTime":24881,"topicId":24880,"numMessagesInTopic":0,"msgSnippet":"... and language and culture and differing opinions and glimpses of remote parts of the world I will probably never see in person","messageBody":"<div id=\"ygrps-yiv-634783275\"><blockquote><span title=\"ireply\">&gt;&gt;The TV offers a connection to history and literature<br/>\n </span></blockquote>and language and culture and differing opinions and<br/>\nglimpses of remote parts of the world I will probably<br/>\nnever see in person&lt;&lt;&lt;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;Ooooh, and here&#39;s a really good one: TV topics are a<br/>\n </span></blockquote>great conversation link between my kids and schooled<br/>\nkids.  They can talk about favorite movies or shows or<br/>\nactors or musicians.  These topics are much better<br/>\nthan, &quot;What grade are you in?&quot; &lt;&lt;&lt;&lt;<br/>\n<br/>\n<br/>\nThat was very well put and thank you for posting that.<br/>\n<br/>\nI&#39;ve gone full circle in my views of TV. We watched TV all the time before I had my son. Then when he was born I tried this strict use of TV watching, buying mostly videos so we&#39;d have a definite end to the show no commercials, no channel clicking. Mindless TV watching as I saw it.  But I also saw things on CNN that I thought inappropriate for a toddler to watch. So away the TV privileges went.  Then slowly even I couldn&#39;t keep up with the at home video library. On one of our vacations to Disney I noticed my son absolutely loved all those old cartoons with Pluto and Mickey and Donald.   When we came back I looked in to Direct TV just so I could get Toon Disney. <br/>\n<br/>\nThrough Toon Disney we have learned so much. My son has learned a lot about Greek mythology ,Viking mythology and Egyptian culture. It has prompted us to get books on Greek mythology and compare the Disney cartoon to other books in the subject and he has learned more about mythology then I learned in high school . MY son is very detailed about his knowledge in mythology . He knows things that most others adults don&#39;t remember or never knew and he makes his own judgment or conclusion as to the meaning of the story.  He is usually more profound in his explanations than I have every heard others be.<br/>\n<br/>\nSo after seeing his ability to learn about a subject in such detail I finally loosened up.  There is a fear that others are judging you. Believing that your letting the TV be a baby sitter and your not doing things with you kids. And I have found most my objections are really about me and my misperception. I found I just don&#39;t like the shows he likes and that was the real reason I was trying to control the TV. I&#39;m over it now but it was long process.<br/>\n<br/>\nNow my son is trying to encourage me to watch more TV with him and not be on my computer so much.  So I am trying to do this for him. It took some time to sort it out. I realized I wasn&#39;t playing video games with him because I just didn&#39;t understand the appeal of games and therefore I tried to use it as a punishment when I needed him to do something else. I&#39;ve stopped doing that too. I believe that outside influences and everyone always saying that you&#39;re a bad parent if you let you kids watch TV and play games makes you doubt your self so you never look to see that there are benefits. I tried limiting video games because I didn&#39;t like them and because I got ill when I watched his video games.  I have vertigo, so there was no appeal for me. But just because there was no appeal for me doesn&#39;t mean their isn&#39;t for him. I now try to encourage him to talk to me about the games and share his excitement or when he reached a new level or finishes the game. I try and sit with him while he plays until I get dizzy and ill.<br/>\n<br/>\nI was not allowing him enjoy something he like because I didn&#39;t like it or understand the appeal. There is so much negativity toward parents who do allow TV and video games in their homes.<br/>\n<br/>\nI have since found my voice on the subject when talking with friends or others.  <br/>\nAnd I&#39;m a advocate for the use and benefit of TV & games. I share lots of fun education game with people who are skeptical. Like &quot;Harvest Moon&quot; ( lots of reading on that one, and a free on line game from Disney &quot;Hot Shot Business&quot; and &quot;Zoo Tycoon&quot;. I&#39;ve change my position on game and trying to control my child through their use. <br/>\n<br/>\n<br/>\nAnd on the subject of saying yes.  Oh I use to say yes all the time. And I got such flack from others. I told people that I preferred not saying the word no to my son. That I would use full sentences to convey ideas to my son. If he was doing something getting into something he wasn&#39;t suppose to,  I would say something like how about we do this or play with that and not just come up and say No stop that don&#39;t touch or no you can&#39;t.<br/>\n<br/>\nI got a lot of grief for thinking this way and treating my son this way. And I mean a Lot of grief....  I was even told by in-laws that my son would be spoiled and unruly for not saying no to him more. So anytime I did have a issue I needed to talk about it or share with them they would pull that out of the hat, as if me not saying NO enough was the real reason for the said problem equaled my bad parenting.  UHG <br/>\n<br/>\nNeedless to say I quit going to them for comfort or advice. I remember visiting once for Thanksgiving and my son was very hungry he was about 4 and is hypoglycemic and I wanted to fix him a plate of food, give him something to eat before he melted down. No ! was their answer he has to wait.  It was a major clash of ideas and respect of parenting values. I feed my son when he&#39;s hungry not when every one is done watching the foot ball game and when prayer was over which was going to be about another hour, although the food was out an looking pretty ready to be eaten.  I got a lot of lectures about how rude I was to be up set over this. <br/>\n<br/>\nEven when we go out to eat I will often order desert first for my son. Waiters get totally freaky about it they try to insist my son eats his dinner then they will bring out desert.  I have to explain yes I really did order the desert first and yes it&#39;s ok to bring it like NOW. And other parents at near by tables glaring at us because we&#39;ve obviously ruined their very structured life by ordering desert fist. Little voices  saying mommy why does he get to eat his desert first and we can&#39;t. Oh the horror of it when you pop their bubble. Yes one can eat the desert first, wow! The world won&#39;t end and hey guess what he still eats his dinner too.   I still get a lot for grief from friends thinking I should put more restriction on my son for TV, games and bed time and food.  I don&#39;t have a problem with him staying up late. I don&#39;t like staying up till 1 pm every night 12:30 is my bed time. I get terrible migraine if I stay up later. So anytime I have a migraines my friends tell me I should set bed time boundaries and such for my son. But for me it&#39;s the best time for us we talk and share and watch TV and cuddle and play cards  I read to him while he plays and so much more. <br/>\n<br/>\nIt&#39;s not easy following your own paths letting your children have choices and respecting that TV, Video games, bed time, food choices and other things are really important to them and have benefits, when all around you your being told how wrong you are.  I can&#39;t believe I didn&#39;t find this group sooner. It would have helped me out so much to have had support for my crazy ideas. Well they&#39;re not crazy   but even I was suspecting my ideas when no one else seemed to understand them, let alone even hear you out.  T  <br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\">  ----- Original Message -----From: Sarah&lt;mailto:sarahanne1@...&gt; <br/>\n  To: AlwaysLearning@yahoogroups.com&lt;mailto:AlwaysLearning@yahoogroups.com&gt; <br/>\n  Sent: Friday, March 24, 2006 11:30 AM<br/>\n  Subject: [AlwaysLearning] Why I love TV<br/>\n<br/>\n<br/>\n  TV is right up there with politics and religion.  I<br/>\n  mean this topic elicits more questions than &quot;What<br/>\n  about church?&quot; in the unschooling community.  I think<br/>\n  even sugar is less of a hot topic than TV.<br/>\n<br/>\n  And it really cracks me up.  Because TV is like a<br/>\n  godsend around here.  <br/>\n<br/>\n  My girls really like to wake up slowly watching TV. <br/>\n  This is great for me because it gives me a chance to<br/>\n  drink my espresso, read the paper (still looking for a<br/>\n  dog), switch the laundry, maybe do a little pilates,<br/>\n  and generally prepare for the day.  A moment to clean<br/>\n  in the morning is great for me.  I feel ready to say<br/>\n  lots of yeses when I&#39;m not saying, &quot;Let me just slick<br/>\n  this up first.&quot; <br/>\n<br/>\n  TV often offers us a moment to reconnect.  I can sit<br/>\n  down with the girls and laugh out loud or ask what<br/>\n  shows they like and why.  Many, many great<br/>\n  conversations have happened because of this.<br/>\n<br/>\n  We have the sit and spin and a mini tramp and puzzles<br/>\n  and games and art projects and a computer and Lego&#39;s<br/>\n  and baby dolls and magazines and books in the same<br/>\n  room as one of our TVs...people rarely just sit<br/>\n  passively and watch TV.<br/>\n<br/>\n  It offers siblings a chance to do something together. <br/>\n  Or, it can get them apart!<br/>\n<br/>\n  Lots of imaginative games and pretend play have ensued<br/>\n  due to an idea gleaned from a television program.<br/>\n<br/>\n  We&#39;ve discovered new crafts, new recipes, art<br/>\n  activities and science projects...all from TV.<br/>\n<br/>\n  Many new concepts have come to us via TV:  from<br/>\n  beginning reading for my almost three year old to the<br/>\n  study of physics and &quot;The Elegant Universe&quot; for<br/>\n  myself.<br/>\n<br/>\n  Half the music I like I found from watching TV and<br/>\n  movies...either from soundtracks or music videos or<br/>\n  musical guests or TV concerts.<br/>\n<br/>\n  My husband turns it on at bedtime for white noise.  He<br/>\n  has to wake up earlier than us and this drowns out our<br/>\n  sometimes loud sounds late at night.<br/>\n<br/>\n  TV (I&#39;m thinking parody here) has given us many ways<br/>\n  to laugh about situations that have the potential to<br/>\n  make me cry.<br/>\n<br/>\n  The TV offers a connection to history and literature<br/>\n  and language and culture and differing opinions and<br/>\n  glimpses of remote parts of the world I will probably<br/>\n  never see in person.<br/>\n<br/>\n  I like to watch shows from my childhood...it is a<br/>\n  connection.  My kids learn more about me from what I<br/>\n  watched and liked when I was younger.<br/>\n<br/>\n  We&#39;ve learned how to cook new foods.<br/>\n<br/>\n  My husband, a busy, busy man, will actually sit with<br/>\n  us if we watch a show together, and he finds things<br/>\n  for him and the girls to watch together.  Major<br/>\n  bonding.<br/>\n<br/>\n  When my kids are in a &quot;TV phase&quot;, I like to look at it<br/>\n  as a great opportunity for me to catch up on<br/>\n  housework, phone calls, a new craft, or my sleep :). <br/>\n  These don&#39;t last long so instead of worrying I take<br/>\n  full advantage!<br/>\n<br/>\n  It really adds to our never-ending list of questions. <br/>\n  The topics take us to the library and on field trips<br/>\n  and into new artistic endeavors.<br/>\n<br/>\n  Ooooh, and here&#39;s a really good one: TV topics are a<br/>\n  great conversation link between my kids and schooled<br/>\n  kids.  They can talk about favorite movies or shows or<br/>\n  actors or musicians.  These topics are much better<br/>\n  than, &quot;What grade are you in?&quot; <br/>\n<br/>\n  We have been introduced to so many fun games and toys<br/>\n  because of the *gasp* advertisements.<br/>\n<br/>\n  It gives me a cozy, tucked-in, home-from-school<br/>\n  feeling.  My kids don&#39;t really have that, but I&#39;m sure<br/>\n  sometimes they get a nest-y cozy feeling.<br/>\n<br/>\n  It connects us generationally.  My kids can talk to<br/>\n  their grandparents about shows they mutually like and<br/>\n  they can watch them together.  My grandparents don&#39;t<br/>\n  go to the skating rinks and sledding hills and zoos<br/>\n  with us, but they can watch Mary Poppins with my kids<br/>\n  and laugh and bond together.<br/>\n<br/>\n  My Mom had the TV on all the time.  She loved it.  But<br/>\n  I don&#39;t remember her sitting and just watching very<br/>\n  often. She crocheted and cooked and cleaned.  And she<br/>\n  and I both read in front of the TV.  I read many a<br/>\n  book in front of the TV just to be near her.  I did<br/>\n  most of my homework in front of the TV (and did really<br/>\n  well according to their standards).  And it still<br/>\n  gives me a chance to knit and paint my toes and other<br/>\n  things I like to do with some noise on.<br/>\n<br/>\n  And guess what, even though I have these feelings of<br/>\n  regard for the TV and tell my kids when their favorite<br/>\n  shows are on and get them lots of movies and offer to<br/>\n  go to lots of movies, they probably end up watching<br/>\n  the same amount of TV as some kids with TV limits<br/>\n  watch.  Because they *want* full lives and have many<br/>\n  interests and love the outdoors and art and<br/>\n  experiments and friends and going out to eat and well,<br/>\n  you get the idea.<br/>\n<br/>\n  Sarah Anderson-Thimmes<br/>\n<br/>\n<br/>\n  __________________________________________________<br/>\n  Do You Yahoo!?<br/>\n  Tired of spam?  Yahoo! Mail has the best spam protection around <br/>\n  http://mail.yahoo.com&lt;http://mail.yahoo.com/&gt; <br/>\n<br/>\n<br/>\n   <br/>\n  Yahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n   <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]}],"prevTopicId":24850,"nextTopicId":24884}}