{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":2300774,"authorName":"Betsy","from":"Betsy &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] The Worst","postDate":"1052325521","msgId":67944,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNFQjkzNjkxLjZFQzE3NjhDQGVhcnRobGluay5uZXQ+","referencesHeader":"PDEzNC4xZjVmNjUzOC4yYmU5ODVmNUB3bWNvbm5lY3QuY29tPg=="},"prevInTopic":67855,"nextInTopic":0,"prevInTime":67943,"nextInTime":67945,"topicId":67822,"numMessagesInTopic":0,"msgSnippet":"**I hate to hear stories of unsupportive relatives, friends, etc. but I am sure hoping for some good ideas on how to deal with them since I can already tell I","messageBody":"<div id=\"ygrps-yiv-1663460176\">**I hate to hear stories of unsupportive relatives, friends, etc. but I<br/>\nam sure hoping for some good ideas on how to deal with them since I can<br/>\nalready tell I will have to deal with my family and the inlaws... and<br/>\nwho knows who else!!!**<br/>\n<br/>\nOne great source of information about this is the unschooling.com<br/>\nmessage boards.  Go to <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> and select message<br/>\nboards (on the left) and scroll down to &quot;Dealing with Reluctance&quot;. <br/>\nThere are stories there about how to cope if your husband opposes<br/>\nhomeschooling, if your kids don&#39;t want to do it, or if your relatives<br/>\ngive you grief about it.<br/>\n<br/>\nBetsy</div>","specialLinks":[]},{"userId":109480760,"authorName":"tinkiechelle1@aol.com","from":"tinkiechelle1@...","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] The Worst","postDate":"1052267277","msgId":67855,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFlOC44NDRkN2M0LjJiZTlhZDBkQGFvbC5jb20+"},"prevInTopic":67840,"nextInTopic":67944,"prevInTime":67854,"nextInTime":67856,"topicId":67822,"numMessagesInTopic":0,"msgSnippet":"my worst experience is actually my daughters. her bio dad is strongly against homeschooling  and tries to brib her back into school every other weekend! ","messageBody":"<div id=\"ygrps-yiv-975055751\">my worst experience is actually my daughters. her bio dad is strongly against <br/>\nhomeschooling  and tries to brib her back into school every other weekend! <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":139549710,"authorName":"Olga","from":"&quot;Olga&quot; &lt;britcontoo@...&gt;","profile":"britcontoo","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: The Worst","postDate":"1052260188","msgId":67836,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGI5OWQwcytoYmJqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDM0LjM5NGM1NTFmLjJiZTk3MmMxQGFvbC5jb20+"},"prevInTopic":67829,"nextInTopic":67840,"prevInTime":67835,"nextInTime":67837,"topicId":67822,"numMessagesInTopic":0,"msgSnippet":"I think your ignoring him was the best thing.  It takes all the power away.  Me and my mother have always had problems but this past Christmas we had a blow","messageBody":"<div id=\"ygrps-yiv-143114414\">I think your ignoring him was the best thing.  It takes all the power <br/>\naway.  Me and my mother have always had problems but this past <br/>\nChristmas we had a blow out and we have not spoken since.  She sent <br/>\nme an Easter cards for the kids addressed formally.  I ripped it up <br/>\nbecause I knew there would be something nasty insede.  The second <br/>\nside had a note to me.  I didn&#39;t see it but saw the first line was <br/>\nthe beginning of an attack.  The hardest thing was not to read it, <br/>\nbut in the long run it took her power to upset me away.  I have been <br/>\nhappier about my decision since.  So although it is off the topic, I <br/>\nthink it is wasy to get caught up in a &quot;game&quot; of some sorts.  Each <br/>\ntrying to have the last word, etc.  This ended it for me and weather <br/>\nshe thinks I read it or not does not matter.  <br/>\n<br/>\nI think if he shows anger about it and it will just be an arguement <br/>\ndo not let him upset you.  You keep your power all to yourself!  If <br/>\nhe sees it does not bother you, what will he get out of it!  Good <br/>\nluck!<br/>\n<br/>\nOlga :)<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a>, unolist@a... wrote:<br/>\n&gt; I wrote this for my other list, and never sent it. Since someone <br/>\nbrought up <br/>\n&gt; interfering family and there was concern about slacking on posts, <br/>\nI&#39;ll go <br/>\n&gt; ahead and share it. <br/>\n&gt; <br/>\n&gt; I wrote this because my public schooling brother and his wife had <br/>\nsubscribed <br/>\n&gt; to my Ohio unschooling email list. The wife introduced herself, <br/>\nasked some <br/>\n&gt; questions, was very honest that she was happy with her school <br/>\nsituation, but <br/>\n&gt; could see it changing for the worse. Wanted to see what it was all <br/>\nabout. She <br/>\n&gt; was greeted with open arms. I didn&#39;t tell anyone she was my SIL, I <br/>\ndidn&#39;t <br/>\n&gt; want to make her uncomfortable. <br/>\n&gt; <br/>\n&gt; A small span of time went by and my brother came on and attacked <br/>\none of the <br/>\n&gt; posters, making rude remarks that I knew were directed at me, but <br/>\ntold the <br/>\n&gt; poster he only wanted her to respond. I was so upset, I felt so <br/>\nawful that he <br/>\n&gt; did that. I was up at 4am typing the email that follows, and trying <br/>\nto come <br/>\n&gt; up with some kind of apology to the poster, when my SIL got on and <br/>\nposted <br/>\n&gt; that my brother didn&#39;t know she subscribed. He thought I was just <br/>\nsending <br/>\n&gt; this stuff to him? Did he think I was trying to convert him? Who <br/>\nknows. <br/>\n&gt; <br/>\n&gt; SIL apologized for the disruption, but refused to apologize for his <br/>\n&gt; statements because he had a right to them. It was a mess. I felt so <br/>\nbetrayed, <br/>\n&gt; and so mad that he would take it out on someone so nice. I know he <br/>\nprobably <br/>\n&gt; wanted a reaction from me, and I refused. I still think I need to <br/>\ntake the <br/>\n&gt; attacked poster out to dinner to make up for it somehow(are you <br/>\nreading this? <br/>\n&gt; I&#39;m serious.) <br/>\n&gt; <br/>\n&gt; It all got resolved, an explanation went out and a warning that any <br/>\nother <br/>\n&gt; disruptions would have them moderated or banned. <br/>\n&gt; They never said a word to me in person. The next time I saw them <br/>\nwas Easter <br/>\n&gt; weekend at my house, a few days after the incident, and they <br/>\npretended <br/>\n&gt; nothing happened. It was bizarre. <br/>\n&gt; <br/>\n&gt; They are still subscribed. SIL did email me privately recently and <br/>\nask to <br/>\n&gt; borrow any of my John Taylor Gatto books, so I am still hoping that <br/>\nsomething <br/>\n&gt; good will come of the whole ordeal. But the trust is not wholly <br/>\nthere. <br/>\n&gt; <br/>\n&gt; Well, here was my vent that never got sent, I hope this isn&#39;t <br/>\ninappropriate <br/>\n&gt; or bringing up bad feelings to anyone on the other list. It was my <br/>\nway of <br/>\n&gt; addressing the issue and explaining to the list that they were <br/>\nrelated to me, <br/>\n&gt; without personally responding to the mean post. After she <br/>\n&gt; apologized/explained, I thought this was a little off the mark, but <br/>\nthen <br/>\n&gt; again...... <br/>\n&gt; <br/>\n&gt; Maybe sharing it here can help me better learn how to deal with <br/>\nfamily <br/>\n&gt; members that pull these type of self-righteous stunts. I have a <br/>\ndoozie of an <br/>\n&gt; unsupportive family member, that showed himself a jerk more than I <br/>\ncould have <br/>\n&gt; ever complained about him. <br/>\n&gt; <br/>\n&gt; &quot;Subject: The Worst<br/>\n&gt; <br/>\n&gt; What is the worst thing a non-unschooling-supportive relative of <br/>\nyours has <br/>\n&gt; done?<br/>\n&gt; <br/>\n&gt; Mine would have to be the time my brother subscribed to an email <br/>\nlist that I <br/>\n&gt; started for supporting fellow unschoolers and just as I was <br/>\nwatching it grow <br/>\n&gt; into a safe, comfortable place to be ourselves, but still take the <br/>\ntime out <br/>\n&gt; to kindly explain to those wanting to know what it is about, <br/>\ncharged in with <br/>\n&gt; a personal agenda to disrupt and inflame the participants. I can&#39;t <br/>\nreally <br/>\n&gt; understand why he would do something so mean-spirited, other than <br/>\nfor sheer <br/>\n&gt; entertainment. <br/>\n&gt; <br/>\n&gt; I mean, no one has ever told him that his choice to school his kids <br/>\nwas wrong <br/>\n&gt; or not to be respected, if so, I would think he dealt with it <br/>\nmaturely <br/>\n&gt; instead of attacking unsuspecting people about the way they live <br/>\ntheir lives <br/>\n&gt; in a place that encourages them to. <br/>\n&gt; <br/>\n&gt; This would be by far the most shocking, damaging, and hurtful thing <br/>\nanyone <br/>\n&gt; has ever done to me personally because they disagreed with my <br/>\nparenting <br/>\n&gt; style. A parenting style that I celebrate and love to share about, <br/>\nbut have <br/>\n&gt; never insisted be the only way or better than someone else&#39;s. <br/>\n&gt; <br/>\n&gt; To sit back with a closed mind and wait for one remark to jump in <br/>\non and spew <br/>\n&gt; forth a diatribe insulting a whole group of people, while singling <br/>\nout one he <br/>\n&gt; doesn&#39;t know. A group of people who signed up for a list that <br/>\nspecifically <br/>\n&gt; stated for support, and disruptions wouldn&#39;t be tolerated.  I can&#39;t <br/>\nimagine <br/>\n&gt; what good that would do for anyone, especially his sister who wants <br/>\nnothing <br/>\n&gt; but the best for him and his family, regardless of the life they <br/>\nchoose to <br/>\n&gt; lead. <br/>\n&gt; <br/>\n&gt; Yep, that is by far the worst.&quot;<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Does anyone else here want to share their worst experience with a <br/>\nfamily <br/>\n&gt; member against homeschooling? Or how you deal with such things? Are <br/>\nyou <br/>\n&gt; gracious, and try not to sink to the level of attack, or just let <br/>\nthem have <br/>\n&gt; it? Do you wait for results to speak for themselves, or secretly <br/>\nmake a <br/>\n&gt; dartboard out of their picture?  <br/>\n&gt; <br/>\n&gt; Ang<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":4335759,"authorName":"HaHaMommy@aol.com","from":"HaHaMommy@...","profile":"thehahamommy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] The Worst","postDate":"1052258819","msgId":67840,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRlLjFiZDdiODNlLjJiZTk4YzAzQGFvbC5jb20+"},"prevInTopic":67836,"nextInTopic":67855,"prevInTime":67839,"nextInTime":67841,"topicId":67822,"numMessagesInTopic":0,"msgSnippet":"Hey Ang, thanks for sharing!! I am regularly amazed at where my critics hide, as well as where my fans hide ... breastfeed and had her boys circ d to separate","messageBody":"<div id=\"ygrps-yiv-1285329377\">Hey Ang, thanks for sharing!!  <br/>\nI am regularly amazed at where my critics hide, as well as where my fans hide <br/>\n:)  My sister-in-law (same family, married to a different brother) refused to <br/>\nbreastfeed and had her boys circ&#39;d to separate herself from me (poor babies <br/>\n... different soapbox, er, thread).  Suddenly, two years later, she confesses <br/>\nshe feels that what she does with her boys is *homeschooling* and I <br/>\ncompletely agree and give her kudos (big change from the girl we met 6 years <br/>\nago who never wanted kids, let alone stay home to parent them!).  I begin to <br/>\nexplain unschooling philosophy and she&#39;s on board! She is really excited by <br/>\nand for me!  On the other hand, her MIL, who was my biggest AP supporter, has <br/>\nreal issues with *teaching* or lack thereof...  I was ready for a fight with <br/>\nmy MIL, on our vacation to California in March, but her only issue with me <br/>\nwas my 4 year old son&#39;s longish hair.  At least she is far enough removed to <br/>\nsee that the *end* does justify the *means.*  <br/>\n<br/>\nI also find that my biggest critics (aside from those in the educational <br/>\nfield without children of their own) are those parents whose children would <br/>\nbe better off without being pigeonholed by the system.  Said parents tell me o<br/>\nne minute every little *fun* thing my kids are missing, and complaining the <br/>\nnext about all the horrible things the kids suffer thru to *earn* the fun ~ <br/>\nNO thanks.  <br/>\n<br/>\nThe only suffering my kids do is the suffering that comes with me being their <br/>\nmom (hey, I&#39;m single and a bit *unbalanced* without my hubby, okay I confess, <br/>\nI&#39;m a freak!) but the fun is ever-present, not earned!  <br/>\n<br/>\n diana,<br/>\nThe wackiest widow westriver...<br/>\n“I&#39;m just a human being trying to make it in a world that is very rapidly <br/>\nlosing it&#39;s understanding of being human&quot; John Trudell<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":128746812,"authorName":"tatertotsRwe@wmconnect.com","from":"tatertotsRwe@...","profile":"spudgirl1970","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] The Worst","postDate":"1052257269","msgId":67829,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNC4xZjVmNjUzOC4yYmU5ODVmNUB3bWNvbm5lY3QuY29tPg=="},"prevInTopic":67822,"nextInTopic":67836,"prevInTime":67828,"nextInTime":67830,"topicId":67822,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/6/2003 2:51:37 PM Mountain Daylight Time, ... Thanks for sharing that with us... I am sorry they did that to you. I think it was a really","messageBody":"<div id=\"ygrps-yiv-1894444641\">In a message dated 5/6/2003 2:51:37 PM Mountain Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unolist@...\">unolist@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Does anyone else here want to share their worst experience with a family <br/>\n&gt; member against homeschooling? Or how you deal with such things? Are you <br/>\n&gt; gracious, and try not to sink to the level of attack, or just let them have <br/>\n&gt; it? Do you wait for results to speak for themselves, or secretly make a <br/>\n&gt; dartboard out of their picture?  <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Thanks for sharing that with us... I am sorry they did that to you. I think <br/>\nit was a really low thing for them to do.  I am very new to this list and <br/>\nhave not even brought my kids home yet (they will not be returning after the <br/>\nend of the school year).  I have learned so much from you ladies in this <br/>\nshort period of time.  I joined just to see what I could learn about <br/>\ndifferent styles of homeschooling and the longer I stick around, I think that <br/>\nunschooling may be just what our family needs! <br/>\nI hate to hear stories of unsupportive relatives, friends, etc. but I am sure <br/>\nhoping for some good ideas on how to deal with them since I can already tell <br/>\nI will have to deal with my family and the inlaws... and who knows who <br/>\nelse!!! I am really grateful I found this list from the get go and look <br/>\nforward to what I can learn from all of you!<br/>\nMichelle<br/>\nEmmett, Idaho<br/>\nProud Mom of:<br/>\nEmily-7<br/>\nCassidy-5<br/>\nMaria Rose-3 <br/>\nEthan-1 1/2<br/>\n&<br/>\n&quot;Angel&quot; Kyle John<br/>\n3/3/95-3/12/95<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":117187741,"authorName":"unolist@aol.com","from":"unolist@...","profile":"unolist","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"The Worst","postDate":"1052252353","msgId":67822,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM0LjM5NGM1NTFmLjJiZTk3MmMxQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":67829,"prevInTime":67821,"nextInTime":67823,"topicId":67822,"numMessagesInTopic":0,"msgSnippet":"I wrote this for my other list, and never sent it. Since someone brought up interfering family and there was concern about slacking on posts, I ll go ahead and","messageBody":"<div id=\"ygrps-yiv-1070314423\">I wrote this for my other list, and never sent it. Since someone brought up <br/>\ninterfering family and there was concern about slacking on posts, I&#39;ll go <br/>\nahead and share it. <br/>\n<br/>\nI wrote this because my public schooling brother and his wife had subscribed <br/>\nto my Ohio unschooling email list. The wife introduced herself, asked some <br/>\nquestions, was very honest that she was happy with her school situation, but <br/>\ncould see it changing for the worse. Wanted to see what it was all about. She <br/>\nwas greeted with open arms. I didn&#39;t tell anyone she was my SIL, I didn&#39;t <br/>\nwant to make her uncomfortable. <br/>\n<br/>\nA small span of time went by and my brother came on and attacked one of the <br/>\nposters, making rude remarks that I knew were directed at me, but told the <br/>\nposter he only wanted her to respond. I was so upset, I felt so awful that he <br/>\ndid that. I was up at 4am typing the email that follows, and trying to come <br/>\nup with some kind of apology to the poster, when my SIL got on and posted <br/>\nthat my brother didn&#39;t know she subscribed. He thought I was just sending <br/>\nthis stuff to him? Did he think I was trying to convert him? Who knows. <br/>\n<br/>\nSIL apologized for the disruption, but refused to apologize for his <br/>\nstatements because he had a right to them. It was a mess. I felt so betrayed, <br/>\nand so mad that he would take it out on someone so nice. I know he probably <br/>\nwanted a reaction from me, and I refused. I still think I need to take the <br/>\nattacked poster out to dinner to make up for it somehow(are you reading this? <br/>\nI&#39;m serious.) <br/>\n<br/>\nIt all got resolved, an explanation went out and a warning that any other <br/>\ndisruptions would have them moderated or banned. <br/>\nThey never said a word to me in person. The next time I saw them was Easter <br/>\nweekend at my house, a few days after the incident, and they pretended <br/>\nnothing happened. It was bizarre. <br/>\n<br/>\nThey are still subscribed. SIL did email me privately recently and ask to <br/>\nborrow any of my John Taylor Gatto books, so I am still hoping that something <br/>\ngood will come of the whole ordeal. But the trust is not wholly there. <br/>\n<br/>\nWell, here was my vent that never got sent, I hope this isn&#39;t inappropriate <br/>\nor bringing up bad feelings to anyone on the other list. It was my way of <br/>\naddressing the issue and explaining to the list that they were related to me, <br/>\nwithout personally responding to the mean post. After she <br/>\napologized/explained, I thought this was a little off the mark, but then <br/>\nagain...... <br/>\n<br/>\nMaybe sharing it here can help me better learn how to deal with family <br/>\nmembers that pull these type of self-righteous stunts. I have a doozie of an <br/>\nunsupportive family member, that showed himself a jerk more than I could have <br/>\never complained about him. <br/>\n<br/>\n&quot;Subject: The Worst<br/>\n<br/>\nWhat is the worst thing a non-unschooling-supportive relative of yours has <br/>\ndone?<br/>\n<br/>\nMine would have to be the time my brother subscribed to an email list that I <br/>\nstarted for supporting fellow unschoolers and just as I was watching it grow <br/>\ninto a safe, comfortable place to be ourselves, but still take the time out <br/>\nto kindly explain to those wanting to know what it is about, charged in with <br/>\na personal agenda to disrupt and inflame the participants. I can&#39;t really <br/>\nunderstand why he would do something so mean-spirited, other than for sheer <br/>\nentertainment. <br/>\n<br/>\nI mean, no one has ever told him that his choice to school his kids was wrong <br/>\nor not to be respected, if so, I would think he dealt with it maturely <br/>\ninstead of attacking unsuspecting people about the way they live their lives <br/>\nin a place that encourages them to. <br/>\n<br/>\nThis would be by far the most shocking, damaging, and hurtful thing anyone <br/>\nhas ever done to me personally because they disagreed with my parenting <br/>\nstyle. A parenting style that I celebrate and love to share about, but have <br/>\nnever insisted be the only way or better than someone else&#39;s. <br/>\n<br/>\nTo sit back with a closed mind and wait for one remark to jump in on and spew <br/>\nforth a diatribe insulting a whole group of people, while singling out one he <br/>\ndoesn&#39;t know. A group of people who signed up for a list that specifically <br/>\nstated for support, and disruptions wouldn&#39;t be tolerated.  I can&#39;t imagine <br/>\nwhat good that would do for anyone, especially his sister who wants nothing <br/>\nbut the best for him and his family, regardless of the life they choose to <br/>\nlead. <br/>\n<br/>\nYep, that is by far the worst.&quot;<br/>\n<br/>\n<br/>\n<br/>\nDoes anyone else here want to share their worst experience with a family <br/>\nmember against homeschooling? Or how you deal with such things? Are you <br/>\ngracious, and try not to sink to the level of attack, or just let them have <br/>\nit? Do you wait for results to speak for themselves, or secretly make a <br/>\ndartboard out of their picture?  <br/>\n<br/>\nAng<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":67865,"nextTopicId":67952}}