{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1798873,"authorName":"PSoroosh@aol.com","from":"PSoroosh@...","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"re: limits on tv","postDate":"1012247852","msgId":3161,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE4YS4yN2ZkZDA2LjI5ODcwNzJjQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":3160,"nextInTime":3162,"topicId":3161,"numMessagesInTopic":0,"msgSnippet":"I know that sometimes kids have really negative reactions to sitting and watching tv a lot. Some kids really seem to be just hooked and unable to tear ","messageBody":"<div id=\"ygrps-yiv-2116559373\">I know that sometimes kids have really negative reactions to sitting and <br/>\nwatching tv a lot. Some kids really seem to be just hooked and unable to tear <br/>\nthemselves away and when they finally do they seem to have an altered mood <br/>\nthat is not pleasant at all. I have friends whose kids reacted this way and <br/>\none of my kids went through  a period of time like this.<br/>\n<br/>\nIt got me thinking harder about how it worked for us when my kids were <br/>\nyounger. We unschooling parents who say we give unlimited choice to our kids <br/>\nmay be really engaging in &quot;manipulating&quot; the situation more than we realize <br/>\nor admit. When one of my kids went through a phase where watching too much tv <br/>\nmade her really really cranky for the rest of the day, I didn&#39;t respond by <br/>\nsetting limits on tv watching - but, in fact, in a way, I did.<br/>\n<br/>\n I would notice to myself,  &quot;Hey, Roxana is watching tv,&quot; and I&#39;d be <br/>\nautomatically thinking of something I could entice her away with as soon as <br/>\nthat particular show ended. Sometimes I didn&#39;t - and then, later after she&#39;d <br/>\nrecovered and gotten her normal self back -- I&#39;d find some way to at least <br/>\ncasually mention that that kind of meltdown often happened after extensive tv <br/>\nwatching. Then - sometimes when I would entice her away - later, when we were <br/>\ncooking or washing the dog or doing something else &quot;fun&quot; &lt;G&gt; -- I&#39;d say, <br/>\n&quot;Today when you only watched one show, you didn&#39;t have that meltdown feeling, <br/>\nhuh?&quot;<br/>\n<br/>\nShe slowly learned to sense when it was too much for her. Too much computer <br/>\ntime had a similar effect -- but she knows how to handle both tv and computer <br/>\ntime now. <br/>\n<br/>\nSo - it isn&#39;t like we ignored it when TV seemed to be having such a <br/>\ndeleterious effect on one child&#39;s mood and behavior that it was impacting the <br/>\nwhole family. It was that our response to it wasn&#39;t to just set some <br/>\narbitrary limit -- there was no specific limit and there was much more <br/>\ninvolved in our response than just limiting tv to avoid the problems. It <br/>\ndidn&#39;t last that long - although it lasted longer with the computer time <br/>\nissue - and she&#39;s had to experiment with that a lot. She spends a LOT of time <br/>\non the computer - and I think the way she&#39;s worked it out is by the <br/>\ncombination of different activities she does on there - not just doing one <br/>\nthing for hours and hours. In this caes, I don&#39;t see how she&#39;d have ever <br/>\nworked this out for herself if we&#39;d just arbitrarily said, &quot;One and one-half <br/>\nhours a day is your limit.&quot; And I&#39;d have never been able to solve the <br/>\ncomputer problems for her - it HAD to be her own trial and error solution in <br/>\norder to work for her.<br/>\n<br/>\n--pam</div>","specialLinks":[]}],"prevTopicId":3122,"nextTopicId":2922}}