{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":14,"messages":[{"userId":120206043,"authorName":"averyschmidt","from":"&quot;averyschmidt&quot; &lt;patti.schmidt2@...&gt;","profile":"averyschmidt","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Rites of Passage","postDate":"1066595387","msgId":16834,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJtdXM3cit1YzB0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDMxMDE5MTkwMjI5LjY1MTE4LnFtYWlsQHdlYjEzNzA4Lm1haWwueWFob28uY29tPg=="},"prevInTopic":16832,"nextInTopic":0,"prevInTime":16833,"nextInTime":16835,"topicId":16752,"numMessagesInTopic":0,"msgSnippet":"... My 10yo is particularly fascinated with various age-related laws and rules and always has been.  For instance- you have to be 14 to have a real job with","messageBody":"<div id=\"ygrps-yiv-251377834\"><blockquote><span title=\"ireply\">&gt; &gt;We already don&#39;t treat him like a child, so there&#39;s<br/>\n&gt; &gt;no big 18 privileges to look forward to.<br/>\n <br/>\n </span></blockquote>My 10yo is particularly fascinated with various age-related laws and <br/>\nrules and always has been.  For instance- you have to be 14 to have <br/>\na &quot;real&quot; job with working papers, 16 to get a permit, 17 to get a <br/>\ndriver&#39;s license, 21 to legally purchase alcohol etc.  Aren&#39;t these <br/>\nrites of passage in a way, albeit subtle ones with not much fanfare?<br/>\nHe&#39;s been attending skateboard camp since he was 7, and at this <br/>\nparticular camp they separate the &quot;mini-campers&quot; (7-9 year olds) <br/>\nfrom the 10 and up crowd which gets special priveleges like being <br/>\nable to stay up much later before lights out and being able to <br/>\nparticipate in different activities such as Paintball.<br/>\nIt was definitely an exciting &quot;big deal&quot; to him when he attended <br/>\nthis past summer as an over 10 camper for the first time.<br/>\nI&#39;m sure I could think of other things as well... so I guess I don&#39;t <br/>\nreally have a point except to say that even if we treat our children <br/>\nwith respect (i.e. not &quot;like a child&quot;) all along and carefully avoid <br/>\narbitrary age related privileges, they will *still* have big <br/>\n(society determined) privileges to look forward to.<br/>\nAnd while I like John Holt&#39;s ideas of childhood as a walled garden <br/>\n(meaning they can do things or not as they feel ready however old <br/>\nthey are rather than according to an arbitrarily decided upon age), <br/>\nI must say that my son finds these little age related milestones <br/>\nvery satisfying.  Mabye because they take the place of other rites <br/>\nof passage that aren&#39;t a part of his unschooled life?  I&#39;m not <br/>\nsure...<br/>\n<br/>\nPatti</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Rites of Passage ~was~ TV - question,...","postDate":"1066594889","msgId":16832,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdlLjNmZWI4MjlmLjJjYzQ0YzQ5QGFvbC5jb20+"},"prevInTopic":16827,"nextInTopic":16834,"prevInTime":16831,"nextInTime":16833,"topicId":16752,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/19/2003 1:40:07 PM Mountain Daylight Time, aisliin@yahoo.com writes: -=-Yeah, I recognize that those are American rights of passage, I ","messageBody":"<div id=\"ygrps-yiv-381527327\">In a message dated 10/19/2003 1:40:07 PM Mountain Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:aisliin@...\">aisliin@...</a> writes:<br/>\n-=-Yeah, I<br/>\nrecognize that those are American rights of passage, I<br/>\nguess I just feel like so many of our &quot;traditions&quot; to<br/>\nmark lives are, well, lame.  =&#92;=<br/>\nYeah, like &quot;you&#39;re five now you go to school&quot; for starters!!<br/>\n<br/>\nBut if a culture just happens NOT to have good formal rites of passage, then <br/>\nmaking some up and saying they&#39;re more &quot;real&quot; is just borrowing or creating, <br/>\nit&#39;s not practicing a culture.<br/>\n<br/>\nLOTS of our culture is lame, but it&#39;s still a real culture (lame as it might <br/>\nbe).<br/>\n<br/>\n-=-I&#39;m not sure what my rite of<br/>\npassage might have been-=-<br/>\n<br/>\nIf you didn&#39;t have one, you didn&#39;t!  &quot;Rite&quot; has to do with &quot;ritual&quot; (it&#39;s the <br/>\nroot of that word) and though some cultures have definite rituals, and others <br/>\nhave recognized traditions not always observed (the whorehouse and bar-trip <br/>\nare NOT figments of my husband&#39;s imagination, though they&#39;re not NEARLY as <br/>\nlikely to happen now as they might have been 80 years ago, and even then they <br/>\nwould have been only among a subset of people, of course--it was never <br/>\nrecommended, it was more a traditional hazing among people who had had it done to them).<br/>\n<br/>\n-=-That doesn&#39;t<br/>\nmake them less valuable than intentional ones-=-<br/>\n<br/>\nIt makes them less &quot;rites,&quot; not less valuable.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":67247159,"authorName":"Nanci Kuykendall","from":"Nanci Kuykendall &lt;aisliin@...&gt;","profile":"aisliin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"[AlwaysLearning] Rites of Passage ~was~ TV - question,...","postDate":"1066590149","msgId":16827,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMxMDE5MTkwMjI5LjY1MTE4LnFtYWlsQHdlYjEzNzA4Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDEwNjY1NTA3NzIuODM3Ljg5NjU4Lm0xMkB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":16803,"nextInTopic":16832,"prevInTime":16826,"nextInTime":16828,"topicId":16752,"numMessagesInTopic":0,"msgSnippet":"aisliin@yahoo.com writes: ","messageBody":"<div id=\"ygrps-yiv-792019637\"><a rel=\"nofollow\" target=\"_blank\" href=\"mailto:aisliin@...\">aisliin@...</a> writes:<br/>\n&lt;&lt; I wanted to mention that rites of passage are<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;traditionally a difficult task or challenge,<br/>\n&gt;&gt;performed either alone or often with grown men, a<br/>\n&gt;&gt;male mentor, females for a girl, whatever.   &gt;&gt;<br/>\n<br/>\n&gt;In some cultures.<br/>\n&gt;In this culture these days, it&#39;s a high school<br/>\n&gt;graduation.<br/>\n&gt;Going to college is one.<br/>\n&gt;Going to a bar on your 21st birthday is too.<br/>\n<br/>\n </span></blockquote>Hmmm....So what if you never do any of those things,<br/>\nor don&#39;t do them in the conventional sense?  Yeah, I<br/>\nrecognize that those are American rights of passage, I<br/>\nguess I just feel like so many of our &quot;traditions&quot; to<br/>\nmark lives are, well, lame.  <br/>\n<br/>\nI never graduated anything except kindergarten, not in<br/>\nthe traditional sense, though I had 5 various years of<br/>\ncollege, but that was later, after I was on my own.  I<br/>\nnever went bar hopping or had any ceremonial bar trip<br/>\nbecause by then I was already long past my wild, angry<br/>\nrebel days when I was still surviving in an alcoholic<br/>\nhome, and I hate bars.  I&#39;m not sure what my rite of<br/>\npassage might have been.  I did move out of the house<br/>\nand was paying my own bills and taking care of myself<br/>\nfairly early, but that&#39;s all clouded up with years<br/>\nstill living codependent with abusive guys (like dear<br/>\nol dad.)<br/>\n<br/>\nTom (hubby) and I were talking about this and he says<br/>\nhis own real right of passage into adulthood was<br/>\nmoving out on his own, not with a friend/roomate.  He<br/>\nsays knowing that he could pay for his own<br/>\nnecessities, eat well, not just keep from starving,<br/>\nand manage work and a social life, those things had<br/>\nreal personal meaning for him in learning his own<br/>\nadult capabilities and depending on himself and<br/>\ntrusting his own judgement.<br/>\n<br/>\nI guess, in pondering it, my real right of passage was<br/>\nwhen I made the decision to stop struggling to survive<br/>\nwith, and trying to win the approval from, parents who<br/>\nwould never be satisfied or healthy, and when I<br/>\ndecided to take responsibility for important decisions<br/>\nin my life into my own hands.  That was when I was 14<br/>\nand I nearly died from long illness and something in<br/>\nme changed.  I decided I only get one life and I&#39;ll be<br/>\ndamned if I was going to let people who were so self<br/>\nabsorbed and abusive control it.  I still made<br/>\nmistakes after that, and was occassionally bullied<br/>\ninto giving up my own authority on important<br/>\ndecisions, but it was definately a turning point for<br/>\nme.  I forced my way out of institutional schooling at<br/>\nthe same time, and entered independent study and the<br/>\nfull time workforce.  I can&#39;t think of anything else<br/>\nthat would qualify more for me as a rite of passage to<br/>\nadulthood.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;If it&#39;s traditional among any people in ANY culture<br/>\n&gt;then it is really a real rite of passage in that<br/>\n&gt;real culture.<br/>\n<br/>\n </span></blockquote>I suppose that&#39;s true, but unutterably sad regarding<br/>\nour &quot;culture.&quot;  Blech.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Each person has one life.<br/>\n&gt;Some things are done well, some aren&#39;t.  Some<br/>\n&gt;weddings are botched, some funerals are botched, but<br/>\n&gt;those things are undeniably rites of passage.<br/>\n<br/>\n </span></blockquote>I guess by &quot;done right&quot; I meant when you are talking<br/>\nabout an &quot;intentional&quot; right of passage.  There are<br/>\nmany things in life that are challenges or that mark<br/>\nthe beginning of a new time in our lives, but most of<br/>\nthem are not intentional, and many that are, are done<br/>\nwith little thought to them as marking a change in<br/>\nlife.  They&#39;re rites of passage, trials which change<br/>\nus, often affecting our &quot;status&quot; and how others see us<br/>\nor how we see ourselves, to be sure.  That doesn&#39;t<br/>\nmake them less valuable than intentional ones, often<br/>\nmore so, just that I was referring to engineered and<br/>\nintentional rites of passage as possibly beneficial.<br/>\n<br/>\n&lt;&lt; It can also give them that sense that so many of<br/>\nour teenagers are looking for that they have crossed a<br/>\nthreshold and are not seen as children anymore. &gt;&gt;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Right.<br/>\n&gt;Kirby is not going to need that.  When he moves out,<br/>\n&gt;that will be a passage he creates on his own and<br/>\n&gt;we&#39;ll help him out and let him come visit all he <br/>\n&gt;wants.  We&#39;re not sending him out against his will<br/>\n&gt;to college.  We&#39;re not forcing him to marry to forge<br/>\n&gt;dynastic ties.  We&#39;re not arranging for him to be <br/>\n&gt;knighted and go off to the crusades to risk his<br/>\n&gt;life.  We&#39;re not pressing him into military service,<br/>\n&gt;nor monastic or priestly vows.  All those things<br/>\n&gt;have been done to people in European culture for<br/>\n&gt;generations, and except for the college stuff,<br/>\n&gt;little of it translated to the United States.<br/>\n<br/>\n </span></blockquote>There were and are positive rites of passage as well,<br/>\nnot just risking life and limb and being forced to<br/>\nfollow your &quot;duty.&quot; <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;We already don&#39;t treat him like a child, so there&#39;s<br/>\n&gt;no big 18 privileges to look forward to.<br/>\n<br/>\n </span></blockquote>Our culture makes a big deal about there being adult<br/>\n&quot;privileges&quot; when they turn 18 though.  What are<br/>\nthose?  Voting?  Dying for their country?  They are<br/>\nlegally responsible at that age, and can be held both<br/>\naccountable for their actions, as well as being able<br/>\nto make decisions and enter into contracts without<br/>\nanother authority.  They can also be held accountable<br/>\nfor the actions of minor friends in their car, or at a<br/>\nhouse where they are, or who are with them.  There are<br/>\n&quot;privileges&quot; that our country bestows on them for<br/>\nbeing 18, plus many people &quot;see&quot; an 18 year old<br/>\ndifferently than a 17 year old.  I guess it could be<br/>\nfun to make a certificate of some sort and have a<br/>\npresentation at a birthday party where you emphasize<br/>\nall the special &quot;privileges and responsibilities&quot; of<br/>\n&quot;legal adulthood&quot; that they are now privy to (in a<br/>\nhumorous way,) as well as all the stuff they will not<br/>\nhave to do or put up with anymore.  As to the later,<br/>\nnot so much at home because they are unschooled, but<br/>\nmaybe in other places and from other people.  For that<br/>\nmatter I guess graduating HS has some merit after all,<br/>\nas an escape from the institution finally.  I forgot<br/>\nabout that because I didn&#39;t get out that way.  I could<br/>\nsee something along the lines of a string of humorous<br/>\ntitles, like Bilbo&#39;s string of riddling titles to<br/>\nSmaug in The Hobbit, applying to new status and/or<br/>\n&quot;responsibilities&quot; and &quot;preiviliges.&quot;<br/>\n<br/>\nNanci K.</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Rites of Passage ~was~ TV - question,...","postDate":"1066536555","msgId":16803,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZhLjM2YzQ0YjM1LjJjYzM2ODZiQGFvbC5jb20+"},"prevInTopic":16799,"nextInTopic":16827,"prevInTime":16802,"nextInTime":16804,"topicId":16752,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/18/03 7:05:50 PM, aisliin@yahoo.com writes: ","messageBody":"<div id=\"ygrps-yiv-97060267\">In a message dated 10/18/03 7:05:50 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:aisliin@...\">aisliin@...</a> writes:<br/>\n<br/>\n&lt;&lt; I wanted to mention that rites of passage are traditionally a <br/>\n<br/>\ndifficult task or challenge, performed either alone or often with <br/>\n<br/>\ngrown men, a male mentor, females for a girl, whatever.   &gt;&gt;<br/>\n<br/>\nIn some cultures.<br/>\nIn this culture these days, it&#39;s a high school graduation.<br/>\nGoing to college is one.<br/>\nGoing to a bar on your 21st birthday is too.<br/>\n<br/>\n&lt;&lt; Getting <br/>\n<br/>\ndrunk and going to the whorehouse is what, Porky&#39;s?  Americana?  <br/>\n<br/>\nIt&#39;s pop culture, but not really a real rite of passage. &gt;&gt;<br/>\n<br/>\nIf it&#39;s traditional among any people in ANY culture then it is really a real <br/>\nrite of passage in that real culture.<br/>\n<br/>\n&lt;&lt;The reason <br/>\n<br/>\nrites of passage have appeared in so many cultures and so many eras <br/>\n<br/>\nis because they are valuable, when done right. &gt;&gt;<br/>\n<br/>\nEach person has one life.<br/>\nSome things are done well, some aren&#39;t.  Some weddings are botched, some <br/>\nfunerals are botched, but those things are undeniably rites of passage.<br/>\n<br/>\n&lt;&lt; It can <br/>\n<br/>\nalso give them that sense that so many of our teenagers are looking <br/>\n<br/>\nfor that they have crossed a threshold and are not seen as children <br/>\n<br/>\nanymore. &gt;&gt;<br/>\n<br/>\nRight.<br/>\nKirby is not going to need that.  When he moves out, that will be a passage <br/>\nhe creates on his own and we&#39;ll help him out and let him come visit all he <br/>\nwants.  We&#39;re not sending him out against his will to college.  We&#39;re not forcing <br/>\nhim to marry to forge dynastic ties.  We&#39;re not arranging for him to be <br/>\nknighted and go off to the crusades to risk his life.  We&#39;re not pressing him into <br/>\nmilitary service, nor monastic or priestly vows.  All those things have been <br/>\ndone to people in European culture for generations, and except for the college <br/>\nstuff, little of it translated to the United States.<br/>\n<br/>\n&lt;&lt;Of course you have to follow suit and not TREAT them like <br/>\n<br/>\nchildren, but then unschoolers don&#39;t really treat children <br/>\n<br/>\nlike &quot;children&quot; anyhow. &gt;&gt;<br/>\n<br/>\nRight.  We already don&#39;t treat him like a child, so there&#39;s no big 18 <br/>\nprivileges to look forward to.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":67247159,"authorName":"Nanci K.","from":"&quot;Nanci K.&quot; &lt;aisliin@...&gt;","profile":"aisliin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Rites of Passage ~was~ TV - question,...","postDate":"1066525483","msgId":16799,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJtc252YitwamQ4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDFhNy4xYjEwNTUxMC4yY2MzMmU2N0Bhb2wuY29tPg=="},"prevInTopic":16798,"nextInTopic":16803,"prevInTime":16798,"nextInTime":16800,"topicId":16752,"numMessagesInTopic":0,"msgSnippet":"... I know, I m chatty today.  I had read this last summer, but didn t comment at the time for whatever reason, lack of time or whatever. I wanted to mention","messageBody":"<div id=\"ygrps-yiv-1958639693\"><blockquote><span title=\"ireply\">&gt;Keith said he had no ideas either, but that was fine. Said<br/>\n&gt;&quot;Well, I&#39;m not going to get him drunk and take him to a whorehouse, <br/>\n&gt;so there&#39;s probably going to be no rite of passage.&quot;<br/>\n&gt;Sandra<br/>\n<br/>\n </span></blockquote>I know, I&#39;m chatty today.  I had read this last summer, but didn&#39;t <br/>\ncomment at the time for whatever reason, lack of time or whatever.  <br/>\nI wanted to mention that rites of passage are traditionally a <br/>\ndifficult task or challenge, performed either alone or often with <br/>\ngrown men, a male mentor, females for a girl, whatever.  Getting <br/>\ndrunk and going to the whorehouse is what, Porky&#39;s?  Americana?  <br/>\nIt&#39;s pop culture, but not really a real rite of passage.  I think <br/>\nthere is value in real rites of passage, helping a young person feel <br/>\nlike they are passing childhood and reaching new levels of <br/>\nresponsibility and a different chapter in their lives.  The reason <br/>\nrites of passage have appeared in so many cultures and so many eras <br/>\nis because they are valuable, when done right.  That&#39;s not just <br/>\nrites welcoming you into adulthood, but all stages of life, <br/>\ncommemorating changes, growth and important events.  Americans act <br/>\nlike reaching age 18 is a rite of passage, but then we don&#39;t <br/>\nactually DO anything to make that so.  So kids spend a lot of time <br/>\nthinking they will feel differently after they turn 18 and then they <br/>\nare disappointed.<br/>\n<br/>\nIf I wanted to have a rite of passage ceremony for a son or a <br/>\ndaughter (not necessarily connected with a birthday or age) I would <br/>\nthink it would be about something that they had not been able or old <br/>\nenough to do before that showed maturity, adult capability in some <br/>\nfashion.  A trip taken on their own, responsibility in a challenging <br/>\nsituation, mastering a fear, learning something about themselves <br/>\nthat fosters a more adult understanding of themselves or other <br/>\npeople, or the world around them.  Knowing that they can be capable <br/>\nall on their own is an important thing.  Sometimes it comes all on <br/>\nit&#39;s own and you have to be able to recognize it when it happens and <br/>\nhelp them celebrate their accomplishment.  If we wanted to plan <br/>\nsomething, I think I would talk to the person in question about <br/>\nwhether they would be interested in such a ceremony, how formal or <br/>\ninformal to make it, whether it would be completely personal, or <br/>\nwhether they would like a little celebration afterwards to <br/>\ncomemorate their accomplishment, and helping them to design their <br/>\nown experience in something that is meaningful to them.<br/>\n<br/>\nOf course this all depends on how spiritual your family is, how <br/>\ninterested your kids are in their spiritual and psychological <br/>\nselves, or their place in society and their greater culture.  It&#39;s <br/>\nnot a matter of religion, but how comfortable you are with the <br/>\nnotion that ceremony can enhance life experiences and that internal <br/>\ngrowth is a worthy goal.  <br/>\n<br/>\nThat doesn&#39;t mean that if you DON&#39;T want to have a rite of passage <br/>\nthat you are some kind of empty shallow person, just that it can be <br/>\na very valuable experience and mean a lot to a young person and <br/>\ntheir family and/or supportive social circle or mentors.  It can <br/>\nalso give them that sense that so many of our teenagers are looking <br/>\nfor that they have crossed a threshold and are not seen as children <br/>\nanymore.  Of course you have to follow suit and not TREAT them like <br/>\nchildren, but then unschoolers don&#39;t really treat children <br/>\nlike &quot;children&quot; anyhow.  Just some thoughts on rites of passage.<br/>\n<br/>\nNanci K.</div>","specialLinks":[]},{"userId":144628419,"authorName":"Kelli Traaseth","from":"&quot;Kelli Traaseth&quot; &lt;tktraas@...&gt;","profile":"kellitraas","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: TV - question, please don&#39;t flame me","postDate":"1066522901","msgId":16798,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDgwMWMzOTVkNiRmOTBkOGE2MCRhMjMzMTlhY0B5b3VyZ2c4N3Zxem96cT4=","referencesHeader":"PGM5LjM4ZWY1NGI2LjJjYzMyOWRmQGFvbC5jb20+"},"prevInTopic":16797,"nextInTopic":16799,"prevInTime":16797,"nextInTime":16799,"topicId":16752,"numMessagesInTopic":0,"msgSnippet":"-=-I pretty much got sick to my stomach reading that post.   If only she ... Ohh,  I totally remember this exchange,  that was me, above. A new member to that","messageBody":"<div id=\"ygrps-yiv-2081463428\">-=-I pretty much got sick to my stomach reading that post.   If only she<br/>\n<blockquote><span title=\"ireply\"> &gt; could see the wonderful things that have come from this unschooling life<br/>\n&gt; change.<br/>\n&gt; &lt;sigh&gt;-=-<br/>\n<br/>\n </span></blockquote>Ohh,  I totally remember this exchange,  that was me, above.<br/>\n<br/>\nA new member to that list couldn&#39;t believe that her son would possibly make<br/>\nOK choices if he was given the freedom to do so.<br/>\n<br/>\nI believe she was a child psychologist.<br/>\n<br/>\nShe believed he would never get off the couch, never stop eating sugar and<br/>\nnever do anything unless she made him do things.  It was really sad.<br/>\n<br/>\nKelli~<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- <br/>\nFrom: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a>&gt;<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>&gt;<br/>\nSent: Saturday, October 18, 2003 6:42 PM<br/>\nSubject: Re: [AlwaysLearning] Re: TV - question, please don&#39;t flame me<br/>\n<br/>\n<br/>\n&gt; I was looking for what I had written about pornography and Marty, and<br/>\nfound<br/>\n&gt; this instead.  I&#39;m still looking for the other one and will bring some of<br/>\nit<br/>\n&gt; here rather than try to remember and write it all.<br/>\n&gt;<br/>\n&gt; This was posted on the unschooling discussion list last summer--those<br/>\nwho&#39;ve<br/>\n&gt; read it can merrily skip on by, but it will be new to some here.  And as<br/>\n&gt; preview, this is a kid who HAS looked at some porn, and not on TV (we<br/>\ndon&#39;t have<br/>\n&gt; cable) but computer.<br/>\n&gt;<br/>\n&gt; ---------<br/>\n&gt; The first reference was, I think, about someone who had come and ranted<br/>\nthat<br/>\n&gt; our recommendations about unschooling showed us to be lazy hedonists.  The<br/>\n&gt; rest is me, June 7, 2003.<br/>\n&gt; ---------------<br/>\n&gt; -=-I pretty much got sick to my stomach reading that post.   If only she<br/>\n&gt; could see the wonderful things that have come from this unschooling life<br/>\n&gt; change.<br/>\n&gt; &lt;sigh&gt;-=-<br/>\n&gt;<br/>\n&gt; Well, the same day I read that we were lazy hedonists, this happened:<br/>\n&gt;<br/>\n&gt; The final day, graduation from the Junior Police Academy, they march in<br/>\nlike<br/>\n&gt; soldiers, doing face drills and filing in and pledging allegience (we<br/>\nbriefed<br/>\n&gt; Marty on that this week; he said he knew it from a humorous version in the<br/>\n&gt; bathroom, just leave out the joke parts)...<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: TV - question, please don&#39;t flame me","postDate":"1066521703","msgId":16797,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFhNy4xYjEwNTUxMC4yY2MzMmU2N0Bhb2wuY29tPg=="},"prevInTopic":16796,"nextInTopic":16798,"prevInTime":16796,"nextInTime":16798,"topicId":16752,"numMessagesInTopic":0,"msgSnippet":"More re-tread, with apologies, from another list.  The address of that list is at the bottom, and the message # if anyone here wants to go and read more of a","messageBody":"<div id=\"ygrps-yiv-1344100685\">More re-tread, with apologies, from another list.  The address of that list <br/>\nis at the bottom, and the message # if anyone here wants to go and read more of <br/>\na past discussion on this.<br/>\n<br/>\n<br/>\n<br/>\n     Msg # From:   <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> <br/>\nDate:  Fri Jan 17, 2003  9:26 am<br/>\nSubject:  Re: Pornography and teens (long, true)<br/>\n<br/>\n<br/>\n&lt;&lt; But boys get their curiosity blocked because there isn&#39;t any<br/>\nacceptable &quot;pornography&quot; for boys. &gt;&gt;<br/>\n<br/>\nWhether it&#39;s &quot;acceptable&quot; or not, there is a fair amount of written<br/>\nfanfiction involving characters from comic book series, fantasy series, and<br/>\neven video games. Some of it is just adventure/romance, and some is at least<br/>\nas graphic as romance novels. Maybe it&#39;s for and by girls, though, I don&#39;t<br/>\nknow.<br/>\n<br/>\nTwo nights ago I wanted to play Destruct-o-Match on Neopets. Both Marty (14)<br/>\nand Holly (11) play Neopets, and I have an account (just so I can play that<br/>\npattern-falling cascading game myself without having to ask Marty) and our<br/>\nMac Powerstrip we use to get to recent files, recent programs, recent sites<br/>\nwas FULL of porn stuff. I didn&#39;t open any, the titles themselves were gross<br/>\nenough. OH!! I had wanted to get to Netflix to cancel getting a DVD I had<br/>\njust rented (which didn&#39;t work).<br/>\n<br/>\n<br/>\nWell anyway, usually I use it to get to Neopets games page.<br/>\n<br/>\nI called Marty in, and said &quot;Marty, this is a bit much.&quot;<br/>\n<br/>\nHe said &quot;Most of it was pop-ups mom, I didn&#39;t really look at it all much.<br/>\nJust some.&quot;<br/>\n<br/>\nI asked him if he could cover those kinds of trails over so I didn&#39;t have to<br/>\nknow and so Holly wouldn&#39;t accidently see. I said he needed to open a bunch<br/>\nof CLEAN websites and look at some better stuff so that would be on the<br/>\ntrail. He told me he could delete the trail. I said I didn&#39;t think he<br/>\ncould, that I had even asked Leon, one of the developers, who said it only<br/>\nworks on the Mac OSX version, not 9.<br/>\n<br/>\nBut Marty is a teenaged boy, so besides his porn curiosity he has a computer<br/>\nfacility. And he figured out a three-step process to erase that list through<br/>\nInternet Explorer.<br/>\n<br/>\nIf I say &quot;NO, never ever even look,&quot; I risk losing the communication we have<br/>\nwithin which he will just tell me what he&#39;s seen and knows and where it came<br/>\nfrom.<br/>\n<br/>\nBut that story has gone two days now. At first he was embarrassed and &quot;Mom,<br/>\nokay, I know, don&#39;t talk to me about it anymore.&quot; So I said I wanted to talk<br/>\nto him one more time the next day, about whether he knows the reasons people<br/>\nobject to kids looking at porn.<br/>\n<br/>\nThe next day came and had nearly passed without me remembering, when he came<br/>\nand said, &quot;Okay, mom.&quot;<br/>\n<br/>\n&quot;What?&quot;<br/>\n<br/>\n&quot;You wanted to talk to me about porn.&quot;<br/>\n<br/>\n&quot;Oh! Thanks. I hadn&#39;t remembered.&quot;<br/>\n<br/>\nSo I asked if he knew the objections. He said no. I said, &quot;In all your<br/>\nreading and listening you haven&#39;t heard objections to porn?&quot;<br/>\n<br/>\n&quot;Well, that its illegal for me to see it.&quot;<br/>\n<br/>\nI talked to him about degradation of women, about creating unhealthy and<br/>\nunreasonable expectations in marriages, and that normal sex wasn&#39;t like that.<br/>\nHe said &quot;Well, DUH, mom!&quot; I said some people were messed up by WANTING it<br/>\nto be. He seemed surprised that that could happen.<br/>\n<br/>\nI told him that some of those who are filmed are not quite volunteers and<br/>\ntold him two stories, one of the mom of girls his age he&#39;s known his whole<br/>\nlife, who was photographed as a kid for posed stills which were sold out of<br/>\nOklahoma. It was shocking for him, and I don&#39;t know much detail, but naming<br/>\na person he knew who had been victimized was effective. I told him of a<br/>\ndrug dealer and illegal snake importer my younger half-brother had taken up<br/>\nwith some years back, who videod him and his then-girlfriend, and used it as<br/>\nblackmail (she was from a Mormon family) to get them to deliver drugs for him.<br/>\n<br/>\nThen I said I didn&#39;t think it was the most horrible thing people could do, to<br/>\nlook at pictures, but he REALLY needed to be careful because it&#39;s illegal and<br/>\nI didn&#39;t want the county coming to talk to me about anything they were doing.<br/>\n<br/>\n(I had a similar moment with Holly later that evening about going outside in<br/>\na teensy fancy t-shirt and nylon pajama pants, no shoes, in January, while<br/>\nshe has a sore throat. &quot;Illegal,&quot; I told her, for parents to allow that,<br/>\nand let&#39;s not draw attention to a loose lifestyle by being outside in the<br/>\ncold without proper attire.)<br/>\n<br/>\nI told Marty that women tend to prefer word-porn and so they don&#39;t get<br/>\ncaught, but pictures were easy to find and more offensive.<br/>\n<br/>\nI told him one danger was obsession. I didn&#39;t go into that much, because<br/>\nsome of the original arguments about obsession were the cost. I did have a<br/>\nfriend years ago who had a large collection of porn videos that had cost him<br/>\n$60 to $80 apiece. Had he had the internet, his obsession wouldn&#39;t have<br/>\nruined his finances, nor left a mountain of evidence to shock his mom.<br/>\n(That friend had a sex change operation since then, so I think it was his way<br/>\nof dealing with deeper psychological and biological situations, and that was<br/>\nway too much to tell Marty.)<br/>\n<br/>\nThen I asked him if he had ANY idea how much trouble some other boys his age<br/>\nwould get into if their parents caught them having looked at that kind of<br/>\nstuff on the computer. He said &quot;Lots?&quot; I talked about loss of computer<br/>\naccesss, grounding, and physical spanking by some big grown man.<br/>\n<br/>\nHe said he had been mostly embarrassed when I first talked to him because he<br/>\nhad had friends in the house. They couldn&#39;t hear us, but he had to leave<br/>\nwhere they were, talk to me, and go back in there, and it just embarrassed<br/>\nhim. I said in those worst-case situations, the parents would have called<br/>\nall of the friends&#39; parents, said to come get them, told them why, and some<br/>\nof THEM would have been grounded and in trouble just for hanging out with<br/>\nsomeone who had looked at porn.<br/>\n<br/>\nI doubt he really fully believes me on those things, or maybe he can&#39;t fathom<br/>\na parent doing that to a child.<br/>\n<br/>\nI don&#39;t mind having a kid who can&#39;t readily imagine being hit by an angry,<br/>\ngrown man or can&#39;t imagine being told &quot;You stay in your room for a month and<br/>\ndon&#39;t even touch a computer.&quot;<br/>\n<br/>\nFor anyone who has read this far and is offended, I didn&#39;t mean to throw this<br/>\nout to offend anyone. It&#39;s a candid, current situation involving a real teen.<br/>\n<br/>\nAnd usually the trail on this real teen&#39;s internet use has Neopets, AoN (a<br/>\nrole-playing game), humor sites, and in-person friends&#39; journals. People<br/>\nwho know Marty wouldn&#39;t think of him as a nasty kid. He&#39;s not. He is coming<br/>\ninto adulthood, though, and he&#39;s curious.<br/>\n<br/>\nI think similar to make-up, if it is declared &quot;only for adults,&quot; and a girl<br/>\nwaits and waits and WAITS until she can use it and is then unlikely to just<br/>\nlet it go unused, a boy who is slapped away from any glimpse of nudity until<br/>\nhe&#39;s eighteen is GOING to immerse himself in his newfound access for a while<br/>\nthe moment he gets a chance.<br/>\n<br/>\nKeith and I were out grocery shopping, and talking about Kirby turning<br/>\nseventeen this year. I said I used to want to have a big eighteenth birthday<br/>\ncelebration for him, like a graduation, but I no longer want to do that. I<br/>\ndon&#39;t want to declare an end to his learning, nor to his living with us if he<br/>\nwants to stay. Keith said he had no ideas either, but that was fine. Said<br/>\n&quot;Well, I&#39;m not going to get him drunk and take him to a whorehouse, so<br/>\nthere&#39;s probably going to be no rite of passage.&quot;<br/>\n<br/>\nKirby wouldn&#39;t want any of that anyway. ANOTHER good thing. When he turns<br/>\neighteen, he&#39;ll have more legal rights, but there won&#39;t be the effect of huge<br/>\ntension released. He&#39;ll have no restrictions suddenly lifted.<br/>\n<br/>\nI know this won&#39;t suit everyone&#39;s belief system, but it is working with us to<br/>\nproduce mature, calm, considerate, communicative teenaged boys. They&#39;re not<br/>\nangry with us, they&#39;re not reactionary, they&#39;re not sneaky.<br/>\n<br/>\nSandra<br/>\n<br/>\n-----<br/>\nquotes are other people<br/>\n-------<br/>\n<br/>\n     Msg # From:   <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> <br/>\nDate:  Sat Jan 18, 2003  9:20 am<br/>\n<br/>\n<br/>\n<br/>\n&lt;&lt; My dh has shared that he believes that when the family is<br/>\nunhealthy, porn more likely beomces an addiction to fill a hole. &gt;&gt;<br/>\n<br/>\nI agree. I think it&#39;s the same as other &quot;internet dangers.&quot; If a child has<br/>\nnothing else to do and no affirmation of wholeness, the internet can be an<br/>\nescape from what seems a lack of life. But when life is big and real and<br/>\nhappy, the child will be there, in his own real life.<br/>\n<br/>\n&lt;&lt;I really appreciate hearing how you&#39;ve dealt with so many of the<br/>\nissues I&#39;ve raised. Your perspective and style of interaacting with<br/>\nyour kids is refreshing and gives me hope.&gt;&gt;<br/>\n<br/>\nThanks. Sometimes when I write those things so plainly I worry that I&#39;ll<br/>\ncause more damage than good in some families. But since things ARE going so<br/>\nwell with my boys (and I hope it stays that way) it seems worth continuing to<br/>\nshare.<br/>\n<br/>\nSandra<br/>\n<br/>\n--------------<br/>\nanyone who wants to read the rest of that discussion can join <br/>\nthis list:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/UnschoolingDiscussion/\">http://groups.yahoo.com/group/UnschoolingDiscussion/</a><br/>\nand go to message # 55403<br/>\nand the responses, or go back two days and see the original question.<br/>\n<br/>\n--------------</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: TV - question, please don&#39;t flame me","postDate":"1066520543","msgId":16796,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM5LjM4ZWY1NGI2LjJjYzMyOWRmQGFvbC5jb20+"},"prevInTopic":16795,"nextInTopic":16797,"prevInTime":16795,"nextInTime":16797,"topicId":16752,"numMessagesInTopic":0,"msgSnippet":"I was looking for what I had written about pornography and Marty, and found this instead.  I m still looking for the other one and will bring some of it here","messageBody":"<div id=\"ygrps-yiv-1361279010\">I was looking for what I had written about pornography and Marty, and found <br/>\nthis instead.  I&#39;m still looking for the other one and will bring some of it <br/>\nhere rather than try to remember and write it all.  <br/>\n<br/>\nThis was posted on the unschooling discussion list last summer--those who&#39;ve <br/>\nread it can merrily skip on by, but it will be new to some here.  And as <br/>\npreview, this is a kid who HAS looked at some porn, and not on TV (we don&#39;t have <br/>\ncable) but computer.<br/>\n<br/>\n---------<br/>\nThe first reference was, I think, about someone who had come and ranted that <br/>\nour recommendations about unschooling showed us to be lazy hedonists.  The <br/>\nrest is me, June 7, 2003.<br/>\n---------------<br/>\n-=-I pretty much got sick to my stomach reading that post.   If only she <br/>\ncould see the wonderful things that have come from this unschooling life <br/>\nchange.  <br/>\n&lt;sigh&gt;-=-<br/>\n<br/>\nWell, the same day I read that we were lazy hedonists, this happened:<br/>\n<br/>\nThe final day, graduation from the Junior Police Academy, they march in like <br/>\nsoldiers, doing face drills and filing in and pledging allegience (we briefed <br/>\nMarty on that this week; he said he knew it from a humorous version in the <br/>\nbathroom, just leave out the joke parts)...<br/>\n<br/>\nCeremonial this&#39;n&#39;that, certificates, pins, Marty was awarded a certificate <br/>\nas &quot;Top Gun&quot; (electronic target practice guns, F.A.T.S. and paintball guns) <br/>\nwhich also came with $15 gift certificate to a sporting goods store.  Seven <br/>\nor <br/>\neight other kids (of 32) got awards like most pushups, most improved, most <br/>\nphysically fit male.<br/>\n<br/>\nOf Marty, I thought &quot;All that Nintendo Duck Hunt paid off.&quot;<br/>\n<br/>\nThen we ate good local barbecue, served up by their instructors, and as <br/>\npeople were taking pictures and saying goodbye, I went up to one of his <br/>\ninstructors <br/>\nand sat to thank him.  He said Marty was just a joy to work with.  Chit chat <br/>\nyou&#39;d expect.<br/>\n<br/>\nThen he said the big thing.   (Brace yourselves.   And I really like the guy.)<br/>\n<br/>\nHe said &quot;You can always tell a kid who comes from a family with discipline, <br/>\nwith rules.&quot;<br/>\n<br/>\nHe said Marty was really well behaved and enthusiastic and cooperative.  (I <br/>\nwish I had the exact quotes there; I wish I had VIDEOTAPE.)<br/>\n<br/>\nI said &quot;We hardly have any rules at our house.  We just tell them to always <br/>\nmake the best choice, to be helpful and not hurt people.&quot;  (That&#39;s maybe 85% <br/>\nclose to exact words; I need my audio back!)<br/>\n<br/>\nHe said they had talked about a lot of things like that over the week.<br/>\n<br/>\nI wanted to make light again, because it was maybe kinda tacky to counter <br/>\n&quot;you can always tell&quot; with &quot;GOTCHA!  Wrong!  CAN&#39;T always tell.&quot;  So I said, <br/>\n&quot;Y&#39;know, Monday was really his first day at school of any sort.   It was his <br/>\nfirst <br/>\nday taking notes or anything like that.&quot;<br/>\n<br/>\n&quot;Oh, right, he&#39;s homeschooled, right?&quot;<br/>\n<br/>\n&quot;Yes.&quot;<br/>\n<br/>\n&quot;Most of the homeschooled kids I&#39;ve met were not so good at social <br/>\ninteractions.  Marty&#39;s really confident and outgoing.&quot;<br/>\n<br/>\nI told him he had gone home and re-written his notes from Monday, and had <br/>\nbeen really focussed on his assignments and getting ready for the next day.  <br/>\nHe <br/>\nsaid &quot;Initiative!  Good!&quot;<br/>\n<br/>\nProbably there was nobody there who was as eager and excited to be there as <br/>\nMarty was.  So we made some more sweet chitchat and that was it.  <br/>\n<br/>\nI could hardly wait to get into the van and close the doors so I could tell <br/>\nKeith, Marty and Holly what he had said about discipline and rules.  We <br/>\ntalked <br/>\nabout that most of the way home.  Holly can hardly believe that some people <br/>\nthink that rules upon rules will make people &quot;good&quot; away from home.  It just <br/>\nmakes no sense to her.   <br/>\n<br/>\nMarty said one of the kids got in bad trouble this afternoon, threatened with <br/>\nbeing sent home, for throwing pieces of rubber at other kids, and for <br/>\nthrowing paintballs.  One broke on the exercise track.  NOT at the targets, <br/>\nwhere the <br/>\nmess was supposed to be.  <br/>\n<br/>\nMarty couldn&#39;t fathom why someone would be at such a cool place and act that <br/>\nway.  <br/>\n<br/>\nBut Marty had also told me there were two people there who hadn&#39;t even wanted <br/>\nto be there.  I didn&#39;t ask (yet) whether this kid was one of those.  Marty <br/>\nwas exhausted when he got home and went to bed at 10:00.<br/>\n<br/>\nThis evidence is really important, that someone who works with kids a lot <br/>\n(Police Athletic League volunteer), someone who&#39;s in law enforcement, sees an <br/>\nenthusiastic, well-behaved, cooperative kid, and is confident that he came <br/>\nfrom a <br/>\nhouse with discipline and rules.<br/>\n<br/>\nDiscipline and rules?   All-fired flaming hedonists?  (Whatever the <br/>\naccusation was.)<br/>\n<br/>\nNeither of the above.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":118406848,"authorName":"joylyn","from":"joylyn &lt;joylyn@...&gt;","profile":"joylynrsf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"explaining unschooling","postDate":"1066519619","msgId":16795,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNGOTFDQzQzLjEwMzA1MDRAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PGJtczQ2ZittNWo5QGVHcm91cHMuY29tPg==","referencesHeader":"PGJtczQ2ZittNWo5QGVHcm91cHMuY29tPg=="},"prevInTopic":16794,"nextInTopic":16796,"prevInTime":16794,"nextInTime":16796,"topicId":16752,"numMessagesInTopic":0,"msgSnippet":"One of the girls on Lexie s soccer team is in special education, diagnosed LD, has all sorts of problems in school, etc.  I suggested the mom homeschool and","messageBody":"<div id=\"ygrps-yiv-2067102372\">One of the girls on Lexie&#39;s soccer team is in special education, <br/>\ndiagnosed LD, has all sorts of problems in school, etc.  I suggested the <br/>\nmom homeschool and she said &quot;Oh no, I couldn&#39;t ever sit with her for six <br/>\nhours a day doing school work, that&#39;d be worse than it is now.&quot;  So I <br/>\nspoke with her a bit about unschooling, and how it works.  We were at <br/>\nthe pizza party for the team and I was saying how in life there are so <br/>\nmany opportunities to learn and that one doesn&#39;t need to learn by doing <br/>\nworksheets, etc.  Janene just then walked up and said &quot;mommy I need more <br/>\nmoney.&quot;  I gave her a dollar.  Janene said &quot;No, mommy I need two <br/>\ndollars, cause one dollar is only four quarters and I need eight <br/>\nquarters so I need two dollar bills.&quot; <br/>\n<br/>\nAfter explaining to Janene how we didn&#39;t have money to burn on buying <br/>\nlittle bouncy balls which are dangerous to the dogs, I turned to the mom <br/>\nand said &#39;that&#39;s how unschooling works!&quot;<br/>\n<br/>\nJoylyn</div>","specialLinks":[]},{"userId":154862465,"authorName":"Shyrley","from":"Shyrley &lt;shyrley@...&gt;","profile":"bobalinga","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] TV - question, please don&#39;t flame me","postDate":"1066515134","msgId":16794,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNGOTFCQUJFLjcwODA5MDRAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PGE2LjNlM2NmMTJkLjJjYzI5ZjY5QGFvbC5jb20+","referencesHeader":"PGE2LjNlM2NmMTJkLjJjYzI5ZjY5QGFvbC5jb20+"},"prevInTopic":16787,"nextInTopic":16795,"prevInTime":16793,"nextInTime":16795,"topicId":16752,"numMessagesInTopic":0,"msgSnippet":"... My kids are 11, 10 and 8. To be honest the issue of porn hasn t come up. I wouldn t know where to find it on TV (we have sattellite) and at the moment they","messageBody":"<div id=\"ygrps-yiv-521827525\"><a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Irsue@...\">Irsue@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;OK, for fear of being flamed, I have hesitated in sending this message, but <br/>\n&gt;my curiosity is getting the best of me.  I am fairly new to unschooling, I have <br/>\n&gt;been homeschooling for 4 years, and this is my first year of unschooling.  <br/>\n&gt;Around our house, TV isn&#39;t something we watch a lot of.  Yes, we watch a ton of <br/>\n&gt;videos, we have quite a collection of videos, and the kids usually pick videos <br/>\n&gt;of interest to them from the library.  My question is for the people that do <br/>\n&gt;not put limits on what their kids watch, and again, please don&#39;t flame me, I <br/>\n&gt;am not trying to ask a dumb question and I really hate groups that start <br/>\n&gt;flaming.  If your child chooses to watch something along the lines of borderline <br/>\n&gt;pornography, or full blown pornography, do you put an end to that, or are you <br/>\n&gt;letting them watch it or has that not become an issue in anyone&#39;s home? I guess <br/>\n&gt;that is something I wouldn&#39;t want to walk in and see my kids watching and I <br/>\n&gt;would hope that other parents would feel the same. Again, I am just asking a <br/>\n&gt;question, not trying to start an all out war.  Susan<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n </span></blockquote>My kids are 11, 10 and 8. To be honest the issue of porn hasn&#39;t come up. <br/>\nI wouldn&#39;t know where to find it on TV (we have sattellite) and at the <br/>\nmoment they wont even watch people holding hands, let alone kissing. <br/>\nThey self-censor.<br/>\nAs they get older maybe they will want to watch films with sexual <br/>\ncontent but I imagine that at that age they can make up their own minds. <br/>\nThey may choose never to see it. I&#39;m 34 and have never seen any porn, <br/>\nnor do I choose to watch it. I like films with plots and special <br/>\neffects, porn doesn&#39;t really have either.<br/>\nI imagine it will be a non-issue for several years too. When we move <br/>\nhome we will be back to 4 channels, 2 of which are the BBC. Cable and <br/>\nsatellite will be out of our financial reach (waaaaah, no more <br/>\nStargate). Maybe they will watch it at someone else&#39;s house but the <br/>\ndecision will be there&#39;s and not mine.<br/>\n<br/>\nShyrley</div>","specialLinks":[]},{"userId":67247159,"authorName":"Nanci K.","from":"&quot;Nanci K.&quot; &lt;aisliin@...&gt;","profile":"aisliin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Tangent about Dirty Dancing and Music, was TV - question,...","postDate":"1066505231","msgId":16787,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJtczQ2ZittNWo5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGJtcmxjbCtwYWlhQGVHcm91cHMuY29tPg=="},"prevInTopic":16778,"nextInTopic":16794,"prevInTime":16786,"nextInTime":16788,"topicId":16752,"numMessagesInTopic":0,"msgSnippet":"... Funny thing, but my 5 year old son s all time favorite movie (has been for about 2 years) is Dirty Dancing (which he calls Baby after Jennifer Grey s","messageBody":"<div id=\"ygrps-yiv-760411545\"><blockquote><span title=\"ireply\">&gt; One of Dd&#39;s all-time favorites is &quot;Pretty Woman,&quot; and another <br/>\n&gt;is &quot;Flashdance,&quot; and yet another that she has watched many times <br/>\n&gt;is &quot;Dirty Dancing.&quot; <br/>\n<br/>\n </span></blockquote>Funny thing, but my 5 year old son&#39;s all time favorite movie (has <br/>\nbeen for about 2 years) is Dirty Dancing (which he calls &quot;Baby&quot; <br/>\nafter Jennifer Grey&#39;s character.)  He doesn&#39;t get squirmy or turn <br/>\naway from the one real sex scene in the movie, but then it&#39;s very <br/>\nimplied and artfully done and not graphic at all.  He often says <br/>\n(like if we&#39;re reading a book or watching a show where little boys <br/>\nsay Ewwww! or something about kissing)  &quot;I like kissing!  Kissing is <br/>\nnice.  So is cuddling.&quot;  He&#39;s very physically affectionate that <br/>\nway.  We call him our Cuddlebug.  <br/>\n<br/>\nBut what I think he really loves in that movie is the music, and the <br/>\ndancing.  He wants to sing and dance and play music.  It&#39;s his <br/>\npassion.  How we wish we could get him a piano!!  He&#39;s wanted one <br/>\nsince he was 2.  You should see how rapt and mezmerized he gets <br/>\nwhenever we are around live music (a fair amount in our artsy <br/>\ncommunity) and how he makes friends with the musicians and soon has <br/>\nthem showing him notes scooching over on their piano bench for him.  <br/>\nI love the way he lays his palm or his cheek against an instrument <br/>\nwhen they let him (bass, piano, guitar, etc) to FEEL the music.<br/>\n<br/>\nNanci K.</div>","specialLinks":[]},{"userId":67247159,"authorName":"Nanci Kuykendall","from":"Nanci Kuykendall &lt;aisliin@...&gt;","profile":"aisliin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"[AlwaysLearning] TV - question, please don&#39;t flame me","postDate":"1066502017","msgId":16778,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMxMDE4MTgzMzM3LjExMTQ0LnFtYWlsQHdlYjEzNzAzLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDEwNjY0OTEwOTUuMTcyNS41MTQ3NC5tMTFAeWFob29ncm91cHMuY29tPg=="},"prevInTopic":16776,"nextInTopic":16787,"prevInTime":16777,"nextInTime":16779,"topicId":16752,"numMessagesInTopic":0,"msgSnippet":"Hi!  Welcome!  I ve never seen any flaming on this list, ever.  We re all grown ups here. ... Well we don t have any pornography in our home, but we do have","messageBody":"<div id=\"ygrps-yiv-856357027\">Hi!  Welcome!  I&#39;ve never seen any flaming on this<br/>\nlist, ever.  We&#39;re all grown ups here.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;My question is for the people that do not put limits<br/>\n&gt;on what their kids watch, ....... If your child<br/>\n&gt;chooses to watch something along the lines of <br/>\n&gt;borderline pornography, or full blown pornography,<br/>\n&gt;do you put an end to that, or are you letting them<br/>\n&gt;watch it or has that not become an issue in anyone&#39;s<br/>\n&gt;home? <br/>\n<br/>\n </span></blockquote>Well we don&#39;t have any pornography in our home, but we<br/>\ndo have some movies with pretty explicit love scenes. <br/>\nShakepeare in Love is a great example because there is<br/>\na lot of very obvious sex in the movie and we watched<br/>\nit together recently.  My son Thomas, who has special<br/>\nneeds that I just went into regarding tv in another<br/>\npost, has really sophisticated taste in storytelling<br/>\nand movies.  He wants to be a director.  He loves<br/>\nLawrence of Arabia, Fiddler on the Roof, and<br/>\nShakespeare, as well as action movies.  So he<br/>\nspecially requested this movie and has been watching<br/>\nit recently.  When we get to the sex parts he hides<br/>\nhis face and/or asks us to fast forward.  It&#39;s not<br/>\nditrubing to him, but he doesn&#39;t want to see it.  He<br/>\nsays &quot;I know what sex is.  It&#39;s grownups kissing and<br/>\ncuddling, and doing other stuff.  I don&#39;t know what<br/>\nother stuff, because I am just a kid.&quot;  But he doesn&#39;t<br/>\nwant to watch it, even though he finds merit and value<br/>\nin the rest of the film.  When he watched Franco<br/>\nZeferelli&#39;s Romeo and Juliet, there is slight nudity<br/>\nbut no overt sex, so he was quite comfortable with<br/>\nthat and watched it about 6 times while we had it from<br/>\nthe library.  He&#39;ll be 7 in Dec.<br/>\n<br/>\nNanci K.</div>","specialLinks":[]},{"userId":9309534,"authorName":"Norma","from":"&quot;Norma&quot; &lt;athomeopathy@...&gt;","profile":"tessimal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: TV - question, please don&#39;t flame me","postDate":"1066490069","msgId":16776,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJtcmxjbCtwYWlhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGE2LjNlM2NmMTJkLjJjYzI5ZjY5QGFvbC5jb20+"},"prevInTopic":16752,"nextInTopic":16778,"prevInTime":16775,"nextInTime":16777,"topicId":16752,"numMessagesInTopic":0,"msgSnippet":"... If your child chooses to watch something along the lines of borderline pornography, or full blown pornography, do you put an end to that, or are you","messageBody":"<div id=\"ygrps-yiv-2102052708\"><blockquote><span title=\"qreply\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Irsue@a... wrote:<br/>\n&lt;&gt;If your child chooses to watch something along the lines of <br/>\nborderline pornography, or full blown pornography, do you put an end <br/>\nto that, or are you letting them watch it or has that not become an <br/>\nissue in anyone&#39;s home? I guess that is something I wouldn&#39;t want to <br/>\nwalk in and see my kids watching and I would hope that other parents <br/>\nwould feel the same. Again, I am just asking a question, not trying <br/>\nto start an all out war.  Susan&lt;&gt;<br/>\n<br/>\nSusan:<br/>\n<br/>\nGood question!  My daughter has always had the opportunity to watch <br/>\nmovies and occasionally TV where nudity or lovemaking happens.  We <br/>\nhave talked about pornography.  Easy to do since it comes to most <br/>\nfree email accounts all the time.  We have discussed how it uses <br/>\nwomen and often denigrates them, turning them into pleasure objects <br/>\nfor men.  Yes, I know there are all kinds of variations of <br/>\npornography, but 99% of what sells is men using women to satisfy <br/>\nthemselves.  And we have talked about and watched some films in which <br/>\npeople make love, usually just a clip within the movie, but if it is <br/>\ndone very well, it can be quite beautiful.  I want her to know that <br/>\ngood sex is beautiful and enjoyable for both parties.  <br/>\n<br/>\nSo, yes, she is allowed to see these things.  More often than not we <br/>\nwatch together.  And until recently (she&#39;s 16) she did not have much <br/>\ninterest in this type of thing.  Now she does, so we watch from time <br/>\nto time.  No, we do not rent adult videos, or even some of the X <br/>\nrated popular films.  She has never expressed an interest in these <br/>\nand on a few occasions when she has been at friends&#39; homes and they <br/>\nput these kinds of videos on (mostly teen boys do this) she has left <br/>\nthe room because she did not want to watch.  But we have watched <br/>\nquite a few R movies.  <br/>\n<br/>\nOne of my favorite films is a very scary murder mystery titled &quot;Don&#39;t <br/>\nLook Now&quot; with a young Donald Sutherland and Julie Christie.  Besides <br/>\nbeing so scary my husband won&#39;t watch it, it has one of the nicest <br/>\nlove-making scenes in all of filmdom, I think.  One of Dd&#39;s all-time <br/>\nfavorites is &quot;Pretty Woman,&quot; and another is &quot;Flashdance,&quot;  and yet <br/>\nanother that she has watched many times is &quot;Dirty Dancing.&quot;  Her most <br/>\nrecent favorites are the French film, &quot;Amelie,&quot; and &quot;Center Stage.&quot;  <br/>\nAll of these have sex scenes, and she loves all of them.  And she is <br/>\nno more inclined to go out and try sex than she was before watching <br/>\nthem.   <br/>\n<br/>\nOn the plus side she is not inclined to be interested in any of the <br/>\nvery exploitative TV shows about men and women getting together, <br/>\nespecially these &quot;reality&quot; things that have men selecting women or <br/>\nwomen selecting men.  <br/>\n<br/>\nThe real bottom-line, however, is time.  She really doesn&#39;t spend <br/>\nmuch of her time in front of a TV.  She is a very busy teen, with <br/>\nhours of figure skating practice each day, a part-tim job at the <br/>\nlibrary, and many activities in which she is involved.  Often she <br/>\nwill start to watch something then drift over to the piano and start <br/>\nworking on a piece she is practicing.  Or she will have the TV on <br/>\nwhile she is working on her clothing designs, sewing.  Or she will <br/>\nprefer to listen to her favorite CDs, dancing and working out.  TV is <br/>\njust background noise more often than not. So I just don&#39;t worry <br/>\nabout it.  She has a good head on her shoulders and I think she can <br/>\nhandle whatever comes along.   So, yes, we do watch many different <br/>\nthings on TV and on videos, but only when we have time, when we are <br/>\nso inclined, which is not very often.<br/>\n<br/>\nNorma </span></blockquote></div>","specialLinks":[]},{"userId":8198323,"authorName":"Irsue@aol.com","from":"Irsue@...","profile":"irsue","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"TV - question, please don&#39;t flame me","postDate":"1066485097","msgId":16752,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGE2LjNlM2NmMTJkLjJjYzI5ZjY5QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":16776,"prevInTime":16751,"nextInTime":16753,"topicId":16752,"numMessagesInTopic":0,"msgSnippet":"OK, for fear of being flamed, I have hesitated in sending this message, but my curiosity is getting the best of me.  I am fairly new to unschooling, I have ","messageBody":"<div id=\"ygrps-yiv-1811470593\">OK, for fear of being flamed, I have hesitated in sending this message, but <br/>\nmy curiosity is getting the best of me.  I am fairly new to unschooling, I have <br/>\nbeen homeschooling for 4 years, and this is my first year of unschooling.  <br/>\nAround our house, TV isn&#39;t something we watch a lot of.  Yes, we watch a ton of <br/>\nvideos, we have quite a collection of videos, and the kids usually pick videos <br/>\nof interest to them from the library.  My question is for the people that do <br/>\nnot put limits on what their kids watch, and again, please don&#39;t flame me, I <br/>\nam not trying to ask a dumb question and I really hate groups that start <br/>\nflaming.  If your child chooses to watch something along the lines of borderline <br/>\npornography, or full blown pornography, do you put an end to that, or are you <br/>\nletting them watch it or has that not become an issue in anyone&#39;s home? I guess <br/>\nthat is something I wouldn&#39;t want to walk in and see my kids watching and I <br/>\nwould hope that other parents would feel the same. Again, I am just asking a <br/>\nquestion, not trying to start an all out war.  Susan<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":16780,"nextTopicId":16837}}