{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":50351038,"authorName":"daila2000","from":"&quot;daila2000&quot; &lt;daila2000@...&gt;","profile":"daila2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Food and Eating Disorders","postDate":"1215464589","msgId":36263,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGc0dTBhZCtsYzNnQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":36262,"nextInTime":36264,"topicId":36263,"numMessagesInTopic":0,"msgSnippet":"I m new to this group, and I m finding the discussion about food to be very interesting.  Long ago I read a book about ways to avoid eating disorders among","messageBody":"<div id=\"ygrps-yiv-876565126\">I&#39;m new to this group, and I&#39;m finding the discussion about food to <br/>\nbe very interesting.  Long ago I read a book about ways to avoid <br/>\neating disorders among children, and the one I remember most was to <br/>\nlet them eat whatever they want, whenever they want.  I also listened <br/>\nto a diet/lifestyle tape by Anthony Robbins (a motivational speaker), <br/>\nand he told an interesting story.  He said he bought a package of <br/>\ncrackers or cookies, and his family gobbled them up.  So then he <br/>\nbought a case of the same item, and it sat and sat in the cupboard.  <br/>\nHe realized that when there was just a small amount available, <br/>\neveryone wanted some.  But when there was enough that people saw it <br/>\nwasn&#39;t going to be eaten by someone else, it lost its appeal.<br/>\n<br/>\nI did a test.  I went to the store with my children (they were <br/>\nprobably around 4, 7, and 9) and let them buy what they wanted.  They <br/>\nsplit a case of Oreos and each bought some of their favorite candy.  <br/>\nThey had separate areas to keep all of their food, but I said not to <br/>\nworry--I&#39;d buy more if they ran out.  And I let them eat it whenever <br/>\nthey wanted to.  Yes, it was hard for me!!  But they did exactly what <br/>\nthat book said they would--they spent maybe the first week eating <br/>\ncandy and ice-cream for breakfast, and then grew tired of it.  <br/>\nThey&#39;re not even crazy about Oreos any more.  But I think the main <br/>\nthing is that they were seeing if *I* was really going to let them do <br/>\nwhat I said.  Even when we were buying the stuff, if they asked for <br/>\none package, I threw two in the cart, just to let them know I was <br/>\nserious!<br/>\n<br/>\nThis discussion has been a good reminder for me to get back into this <br/>\nway of thinking (I&#39;ve slipped a bit with the &quot;good food/bad food&quot;), <br/>\nand it&#39;s a reminder of how my own food issues are so different from <br/>\nthe way my children think.  I could devour a large bag of chips in <br/>\none sitting (because it was a &quot;bad&quot; food)--and my children eat a <br/>\nportion and put the rest away.  It&#39;s not a forbidden food for them.  <br/>\nMy youngest (we didn&#39;t know he&#39;d done this) pigged out on greasy <br/>\nchips one day, and actually threw up later--and he still remembers <br/>\nthat and won&#39;t overeat them again!  I&#39;ve realized over the past week <br/>\nor so (since first reading this discussion), that my children <br/>\nnormally do ask for foods that make them feel good, even if they do <br/>\noccasionally eat the sugary stuff in between.  They even realized, <br/>\nafter the candy binge from the 4th of July parade, that they felt <br/>\nsick and at 10pm asked for vegies and rice!<br/>\n<br/>\nAnd I also agree with the idea to make foods easily available <br/>\n(the &quot;Monkey Plate&quot; was great!)--if I ask if they want something, <br/>\nthey usually say no--but if I leave out a plate of washed grapes or <br/>\ncut up fruit, they&#39;ll eat it.<br/>\n<br/>\nSomeone asked, &quot;how can I trust my children, when I don&#39;t trust <br/>\nmyself?&quot;  I think the answer is by showing you trust them, they&#39;ll be <br/>\ntrustworthy. You can work on yourself separately, if you feel you <br/>\nneed to.  Long ago I read a book by someone who overcame an eating <br/>\ndisorder, and she made a big bowl of cookie dough and ate that for <br/>\ntwo weeks, and that helped her get over the binge cycle.  It&#39;s <br/>\ngetting rid of the &quot;forbidden foods&quot; idea.<br/>\n<br/>\nSorry this is long, but it&#39;s really important to me because I did <br/>\nhave an eating disorder and don&#39;t want to do to my children what my <br/>\nparents did to me.  Even when I ate an apple, my dad would say, &quot;no <br/>\nwonder you&#39;re so fat--you&#39;re eating all the time.&quot;  I was about 10 <br/>\nlbs overweight.  Kids don&#39;t even understand what&#39;s going on with <br/>\nfood, except that when it&#39;s used in a controlling way, they&#39;re going <br/>\nto binge when given the chance.  I love it when I see my children <br/>\nturn down offers of food (things I would have considered &quot;treats&quot; and <br/>\nwouldn&#39;t have missed an opportunity to eat) or put a bag away before <br/>\nit&#39;s finished--I see that food has a different place in their lives <br/>\nthan it did in mine.</div>","specialLinks":[]}],"prevTopicId":36262,"nextTopicId":36266}}