{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Covert","from":"Covert &lt;covert@...-net.ne.jp&gt;","replyTo":"LIST","senderId":"ApcdxmFGv836AR7QJe0wbSa8OcowJrP8oGvKsd7e57gQZFZABOOodGBDQFR4CJx7TZUatpo95Ega89LkPN6HaaP8RxpE8VU","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Japan homelearning articles","postDate":"967469144","msgId":12212,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDAwODI4MTMyNi5XQUEwMTIzMkBtYWlsLndhMi5zby1uZXQubmUuanA+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":12211,"nextInTime":12213,"topicId":12212,"numMessagesInTopic":0,"msgSnippet":"Hi everybody, Some very good news to report from Japan today! Today s edition (Aug. 28) of the Asahi Evening News, an English-language daily paper with","messageBody":"<div id=\"ygrps-yiv-1935308687\">Hi everybody,<br/>\n<br/>\nSome very good news to report from Japan today!<br/>\n<br/>\nToday&#39;s edition (Aug. 28) of the Asahi Evening News, an English-language <br/>\ndaily paper with nationwide circulation, features a wonderful spread on <br/>\nits Education page about home-based learning. The spread fills about <br/>\ntwo-thirds of the whole page.<br/>\n<br/>\nThere are two stories in the spread. The main one is a translation of an <br/>\nearlier Asahi Shimbun Japanese-language story. This story includes quotes <br/>\nfrom Yoshiko Kubo, a Japanese veteran homelearning parent near Tokyo, as <br/>\nwell as from Kyoko Aizawa of the Otherwise Japan group in Tokyo. The <br/>\noverall tone of the story comes across as positive and respectful of <br/>\nhomelearning in Japan, despite a couple of misleading points about the <br/>\nso-called &quot;difficulties&quot; and &quot;illegality&quot; of home-based learning in this <br/>\ncountry.<br/>\n<br/>\nThe spread also features a sidebar story written by yours truly. It&#39;s a <br/>\nfirst-person account of why and how our family does homelearning in <br/>\nJapan. I don&#39;t remember seeing any other such stories in Japan&#39;s <br/>\nEnglish-language press -- that is, original articles written by a <br/>\nhomelearner FOR homelearners) in recent times, so this may well be the <br/>\nfirst in Japan. Let us hope it is by no means the last.<br/>\n<br/>\n<br/>\nHere are excerpts from the two stories:<br/>\n<br/>\n(1)<br/>\nMore and more parents are rejecting the idea of sending their children to <br/>\nschool, and are instead taking direct responsibility for educating them <br/>\nat home.<br/>\n<br/>\nAs homeschooling gradually wins broader acceptance here, a community <br/>\nmovement is building to provide support for parents who choose to go down <br/>\nthis route. As well, even an Education Ministry advisory group has <br/>\nrecommended support for &quot;learning in the home.&quot;  <br/>\n<br/>\nTo see the main story in its entirety, go to:<br/>\n---&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.asahi.com/english/asahi/0828/asahi082812.html\">http://www.asahi.com/english/asahi/0828/asahi082812.html</a><br/>\n<br/>\n(2)<br/>\nFor our family, homeschooling as a way of life began last year on a beach <br/>\nin northern California during a summer break away from Japan, after my <br/>\n5-year-old son and I were invited to join a &quot;support group&quot; of <br/>\nhomeschooling families on one of their regular outings.<br/>\n <br/>\nTo see the whole sidebar story, go to:<br/>\n---&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.asahi.com/english/asahi/0828/asahi082813.html\">http://www.asahi.com/english/asahi/0828/asahi082813.html</a><br/>\n<br/>\n<br/>\nAs I&#39;ve noted often in the past, the Japanese news media is becoming <br/>\nincreasingly open to homelearning as a serious alternative to mainstream <br/>\nschooling. The Asahi spread today is further proof of that. The climate <br/>\nfor press coverage of homelearning these days may well be more hospitable <br/>\nin Japanese society at this early stage than in other countries where <br/>\nhomelearning is more firmly established.<br/>\n<br/>\nWhy is that? Well, when in doubt, look close to home: News media people <br/>\nin Japan have families of their own, and they are no doubt struggling <br/>\nwith the same kinds of educational problems that everyone else in society <br/>\nis struggling with. Covering homelearning -- overseas and domestically -- <br/>\nas a legitimate news story allows reporters and editors in Japan to <br/>\nexplore the wild idea of alternative education for their own families as <br/>\nwell. <br/>\n<br/>\nThings may change as time goes on and homelearning in Japan becomes less <br/>\nof a novelty and more of a threat to the educational powers-that-be (as <br/>\nit most certainly will). But for now, the climate for press coverage of <br/>\nhomelearning issues in Japan is good.<br/>\n<br/>\nMy deepest hope is that more Japanese families will be encouraged, after <br/>\nreading these two Asahi articles, to indeed seriously consider home-based <br/>\nlearning as an alternative to conventional schooling.<br/>\n<br/>\nJust my humble contribution to The Cause, of course....<br/>\n<br/>\nRegards,<br/>\n<br/>\nBrian Covert<br/>\n(KnoK NEWS)<br/>\nin Osaka, Japan</div>","specialLinks":[]}],"prevTopicId":12210,"nextTopicId":12196}}