{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Lynda","from":"&quot;Lynda&quot; &lt;lurine@...&gt;","replyTo":"LIST","senderId":"Gi5ZxAatRMtAO4gfXc7fYWowQgr_uPBjPFFqgPqpp9vFvXcDL3KDKqXbdPV3qzLpzTV5hqEtbVbtH-WJKAD1BXzNOw","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Fw: How the Grinch Stole Election Day","postDate":"975007940","msgId":14219,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxOTkwMWMwNTU4OSRkMWExZGI2MCQ2NDVkZDFkMUBsZGlvbm5vPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":14218,"nextInTime":14220,"topicId":14219,"numMessagesInTopic":0,"msgSnippet":"Here s a political ho-ho-ho everyone can enjoy  Lynda","messageBody":"<div id=\"ygrps-yiv-154189827\">Here&#39;s a political ho-ho-ho everyone can enjoy &lt;g&gt;<br/>\n<br/>\nLynda<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message -----<br/>\n<br/>\n&gt; How the Grinch Stole Election Day<br/>\n&gt; (With respects to Theodor S. Geisel.)<br/>\n&gt; Written by Frank Cammuso and Hart Seely<br/>\n&gt;<br/>\n&gt; Every Chad<br/>\n&gt; Down in Chad-ville<br/>\n&gt; Liked voting a lot ...<br/>\n&gt; But the Grinch,<br/>\n&gt; Who lived just north of Chad-ville<br/>\n&gt; Did NOT!<br/>\n&gt;<br/>\n&gt; The Grinch hated voting! He thought it a bore.<br/>\n&gt; Now, please don&#39;t ask why. Could be Bush, could be Gore.<br/>\n&gt; It could be his heart bled with liberal mush.<br/>\n&gt; It could be, perhaps, that he listened to Rush.<br/>\n&gt; But I think the real reason his trust was so shattered<br/>\n&gt; Was the great Grinchy view that his vote never mattered.<br/>\n&gt;<br/>\n&gt; BUT<br/>\n&gt; Whatever the reason,<br/>\n&gt; Lack of trust, lack of goals,<br/>\n&gt; The Grinch dreaded that day when Chads went to the polls.<br/>\n&gt; He just hated those speeches and negative ads,<br/>\n&gt; And when push came to shove, he just hated the Chads.<br/>\n&gt; He just hated their theme parks, their football-team rooters,<br/>\n&gt; He just hated their gun laws, their barmaids at Hooters.<br/>\n&gt; He just hated their weather, even hated their hate.<br/>\n&gt; And he hated that they were a battleground state.<br/>\n&gt;<br/>\n&gt; &quot;So they&#39;re making their choices,&quot; he snarled with a sneer.<br/>\n&gt; &quot;This &#39;Decision Two Thousand&#39; is practically here!<br/>\n&gt; &quot;They&#39;ll struggle to choose &#39;tween a crumb and a bum,<br/>\n&gt; &quot; &#39;Cause a voter&#39;s a voter, no matter how dumb.&quot;<br/>\n&gt; Then he growled, his Grinch fingers nervously drumming,<br/>\n&gt; &quot;I MUST find a way to keep outcomes from coming!&quot;<br/>\n&gt;<br/>\n&gt; For tomorrow, he knew ...<br/>\n&gt; All the flag-waving souls,<br/>\n&gt; Would again waste their efforts on Clintons or Doles.<br/>\n&gt; And by then, oh, the polls! Oh, the polls! Polls! Polls! Polls!<br/>\n&gt; That&#39;s the one thing he hated! The POLLS! POLLS! POLLS! POLLS!<br/>\n&gt;<br/>\n&gt; So the Chads, rich and poor, and by bus, car, or boat,<br/>\n&gt; They would vote! And they&#39;d vote!<br/>\n&gt; And they&#39;d VOTE! VOTE! VOTE! VOTE!<br/>\n&gt; They would vote to ban smoking or clearing your throat.<br/>\n&gt; They would even vote laws in for curbing your goat.<br/>\n&gt;<br/>\n&gt; And THEN ...<br/>\n&gt; They&#39;d sing that anthem. It always came later.<br/>\n&gt; Be they Bush-ites or Gore-ites or ites of Ralph Nader.<br/>\n&gt; They&#39;d stand close together, and though still full of fight,<br/>\n&gt; They&#39;d stand and they&#39;d sing, by that dawn&#39;s early light.<br/>\n&gt;<br/>\n&gt; And the more the Grinch thought of Election Day&#39;s ring,<br/>\n&gt; The more the Grinch thought, &quot;I must stop this whole thing!<br/>\n&gt; &quot;Why, for two hundred years I&#39;ve put up with it now!<br/>\n&gt; &quot;I MUST stop these outcomes from coming!<br/>\n&gt; &quot;... But HOW?&quot;<br/>\n&gt;<br/>\n&gt; Then he got an idea!<br/>\n&gt; Yes, a legal idea!<br/>\n&gt; THE GRINCH<br/>\n&gt; GOT AN AWFUL BUT LEGAL IDEA!<br/>\n&gt;<br/>\n&gt; &quot;I know just what to do!&quot; The Grinch laughed with a jig.<br/>\n&gt; And he wove from his goat a Sam Donaldson wig.<br/>\n&gt; And into the mirror he spoke with grand rancor,<br/>\n&gt; &quot;With this helmet of hair, they&#39;ll all think I&#39;m an anchor!&quot;<br/>\n&gt;<br/>\n&gt; &quot;All I need are some ballots ...&quot;<br/>\n&gt; The Grinch looked around.<br/>\n&gt; But since ballots were private, there were none to be found.<br/>\n&gt; So he made his own ballot, printing letters quite little,<br/>\n&gt; And he scattered the names, running holes down the middle,<br/>\n&gt; And he stuck it together with Chad-berry spittle.<br/>\n&gt; And he said, &quot;They&#39;ll need Einstein to figure this riddle!&quot;<br/>\n&gt;<br/>\n&gt; THEN<br/>\n&gt; He loaded his boxes, and without looking nervous<br/>\n&gt; Put a sign on his van that said &quot;Voter News Service.&quot;<br/>\n&gt; THEN<br/>\n&gt; The Grinch pulled away in his van with a screech<br/>\n&gt; Toward the pads of the Chads in a place called &quot;Palm Beach.&quot;<br/>\n&gt;<br/>\n&gt; When he came to the first polling place in the square,<br/>\n&gt; All the lines were quite long. Thoughtful talk filled the air,<br/>\n&gt; As the Chads chatted merits of managed health care.<br/>\n&gt; &quot;Vote early and often,&quot; the Grinch said with a grin.<br/>\n&gt; And he marched to the front of the line and stepped in.<br/>\n&gt;<br/>\n&gt; There he left all his ballots, the strange ones with punches,<br/>\n&gt; And instructions that said, &quot;Please punch punches in bunches.&quot;<br/>\n&gt; As he slunk out the door toward the nearest Grand Hyatt,<br/>\n&gt; He could hear what you&#39;d think was an Elián riot.<br/>\n&gt; The Cohens-sisters Esther, Mitzi, and Shannon,<br/>\n&gt; Just realized that their votes had all gone to Buchanan!<br/>\n&gt;<br/>\n&gt; At a place in Dade County near a middle-school yard,<br/>\n&gt; The Grinch donned a shirt that said, &quot;Polling Place Guard.&quot;<br/>\n&gt; And he eyeballed each Chad and said, &quot;Where is your card?<br/>\n&gt; &quot;Voter card? Motor card? Credit card? Diner&#39;s?<br/>\n&gt; &quot;Face card? Race card? Baseball card? Shriners?&quot;<br/>\n&gt; And he turned them away. Then the Grinch, like a fox,<br/>\n&gt; Stuffed all of his ballots and locked the lockbox!<br/>\n&gt;<br/>\n&gt; Then old Grinch returned home to go &quot;LIVE&quot; on TV.<br/>\n&gt; He had waited quite late: (It was now eight oh three.)<br/>\n&gt; So the Grinch Network News first projected a score:<br/>\n&gt; &quot;Now with one percent in, we pick Chad-ville for GORE.&quot;<br/>\n&gt; Every Gore-ite in Chad-ville said, &quot;GIVE US SOME MORE!&quot;<br/>\n&gt;<br/>\n&gt; So he pulled more projections straight out of his stack.<br/>\n&gt; Then, &quot;Oh, dear!&quot; said the Grinch, &quot;I must take it all back!&quot;<br/>\n&gt; So the Grinch Network News, in grand fairness to all<br/>\n&gt; Now reported that Chad-ville was &quot;TOO CLOSE TO CALL.&quot;<br/>\n&gt;<br/>\n&gt; &quot;Don&#39;t be mad, all you Chads, for this isn&#39;t a scandal,<br/>\n&gt; &quot;It was just,&quot; the Grinch said, &quot;we forgot the Panhandle.<br/>\n&gt; &quot;The science of sampling can leave one out-simpled.&quot;<br/>\n&gt; So the Chads were left hanging and pregnant and dimpled.<br/>\n&gt; And the stress of it all put George Bush among the pimpled!<br/>\n&gt;<br/>\n&gt; Then the Grinch raised a finger for the night&#39;s final push.<br/>\n&gt; &quot;Election Day&#39;s done, and the winner is BUSH.&quot;<br/>\n&gt; After all, George was leading at least by a dozen.<br/>\n&gt; (And whenever it&#39;s close, always go with your cousin.)<br/>\n&gt; &quot;Play the music, the songs, pop the corks, sing the praises,<br/>\n&gt; &quot; &#39;Cause with Bush as the winner, you&#39;re all getting raises!&quot;<br/>\n&gt; And then the Grinch yawned, &quot;This election stuff&#39;s hokey,<br/>\n&gt; Good-bye &#39;till next year! And now back to you, Cokie.&quot;<br/>\n&gt;<br/>\n&gt; And the Grinch, he went back to his old Grinchy pad.<br/>\n&gt; But en route, he was nabbed by a little Chad lad<br/>\n&gt; Who had stayed up all night (quite ignoring his dad).<br/>\n&gt; He stared at the Grinch and said, &quot;Sir, who&#39;s our leader?<br/>\n&gt; &quot;Is it Bush? Is it Gore? Or, my choice, Derek Jeter?&quot;<br/>\n&gt; And the Grinch simply smiled: This day couldn&#39;t be sweeter.<br/>\n&gt;<br/>\n&gt; They were finding out now that no outcome was coming!<br/>\n&gt; They were seeing it now, all their dumbness and dumbing.<br/>\n&gt; &quot;They&#39;re just waking up!&quot; he said. &quot;Here&#39;s what they&#39;ll do!<br/>\n&gt; &quot;Their mouths will hang open a minute or two<br/>\n&gt; &quot;And the Chads down in Chad-ville will all cry, &#39;WE&#39;LL SUE!&#39; &quot;<br/>\n&gt;<br/>\n&gt; As he stared down at Chad-ville, the Grinch popped his eyes,<br/>\n&gt; But the scene that he saw brought a shocking surprise.<br/>\n&gt; All the Chads down in Chad-ville, Chad lads and Chad dads,<br/>\n&gt; They were counting the votes, they were counting the chads!<br/>\n&gt; He hadn&#39;t stopped an outcome from coming.<br/>\n&gt; IT CAME!<br/>\n&gt; SOMEHOW OR ANOTHER, IT CAME JUST THE SAME!<br/>\n&gt;<br/>\n&gt; As the Grinch with his head buried deep in the sand<br/>\n&gt; Sat puzzling and puzzling, &quot;They will count them by hand?&quot;<br/>\n&gt; Yes, it came with the lawsuits, it came with the lawyers,<br/>\n&gt; It came with Tim Russert, it came with Bill Moyers.<br/>\n&gt; When the ballots were plucked and the counting was done<br/>\n&gt; The last margin of victory turned out to be ... ONE!<br/>\n&gt; And if the Grinch had just voted,<br/>\n&gt; ... HIS GUY WOULD HAVE WON!<br/>\n&gt; And what happened then ...<br/>\n&gt; Well ...<br/>\n&gt; In Chad-ville they say<br/>\n&gt; That the Grinch&#39;s small district<br/>\n&gt; Grew three sizes that day.<br/>\n&gt;<br/>\n&gt; &#39;Cause the minute his mood had come out of its slump,<br/>\n&gt; The Grinch said, &quot;Hmm! I could be running this dump!&quot;<br/>\n&gt; So he formed a committee to do all the work<br/>\n&gt; And he ...<br/>\n&gt; HE HIMSELF!<br/>\n&gt; The Grinch ran for town clerk! </span></blockquote></div>","specialLinks":[]}],"prevTopicId":14218,"nextTopicId":14220}}