{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":20,"messages":[{"userId":231415297,"authorName":"chris ester","from":"chris ester &lt;chris.homeschool@...&gt;","profile":"chris_e_bear","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: 10 year old girl & Mom needs help","postDate":"1321768923","msgId":63828,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBTXVqbWR0ckN1aXVGYWdnNjQ0dUZoMGlRanAwNCsxLU1RTjZ4cmJTcFNMTEVuTit2Z0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGphNnJudiszODF2QGVHcm91cHMuY29tPg==","referencesHeader":"PDEzMjE2MzkwNjYuNzkzNjkuWWFob29NYWlsTmVvQHdlYjEyMDkxMy5tYWlsLm5lMS55YWhvby5jb20+CTxqYTZybnYrMzgxdkBlR3JvdXBzLmNvbT4="},"prevInTopic":63827,"nextInTopic":0,"prevInTime":63827,"nextInTime":63829,"topicId":63798,"numMessagesInTopic":0,"msgSnippet":"Many years ago, when I was still learning to be an unschooly parent and my kids were very young, and I left my job to be home full time we hit a place where it","messageBody":"<div id=\"ygrps-yiv-1954296798\">Many years ago, when I was still learning to be an unschooly parent and my<br/>\nkids were very young, and I left my job to be home full time we hit a place<br/>\nwhere it seemed like everything was a  power struggle.  I am a prideful,<br/>\nconfrontational person who does not like to take sh*t from anybody.  And<br/>\nhere were two small children who thought that they were going to get the<br/>\nbest of me.... so my thoughts went one day.  Then I realized that my kids<br/>\ndeserved the best FROM me that I could offer and that I had been less<br/>\nresponsive to their needs than I could have been/should have been.<br/>\n<br/>\nI decided that I would find my sense of humor again.  I had two beautiful,<br/>\nbright, little kids to play with all day and I wasn&#39;t laughing enough to<br/>\nfulfill the job requirements!  When one of my kids tried to pick a fight, I<br/>\nwould challenge the seriousness of the situation (as it never was serious)<br/>\nand laugh!<br/>\n<br/>\nI know you can&#39;t do this with everything, but it helps with a lot.  Now<br/>\nthat they are older I just ask them when their is an issue.  We talk, I TRY<br/>\nto listen more than I talk.  If they don&#39;t want to talk, I wait.  When<br/>\nfrustrated, I declare for all to hear that I love the person who is the<br/>\nobject of my frustration.  Maybe to remind me or to reassure them, either<br/>\nway it always makes us all feel better.<br/>\n<br/>\nWhen there is a power struggle, ask yourself why is it so important to be<br/>\nthe one in charge of that particular thing.  Usually, it isn&#39;t important<br/>\nenough to damage the relationship between you and your child.  Pay<br/>\nattention to your own inner voice.  Keep your priorities straight and reach<br/>\nfor peace and safety for your child and your home.<br/>\nChris<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Fri, Nov 18, 2011 at 7:03 PM, Meredith &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:plaidpanties666@...\">plaidpanties666@...</a>&gt; wrote:<br/>\n<br/>\n&gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Pamela Corkey &lt;p_corkey@...&gt; wrote:<br/>\n&gt; ****&gt;&gt; Bring her home, surround her with peace and joy. Don&#39;t fight with<br/>\n&gt; her. Just love her. There is much more at stake here than her &quot;education.&quot;<br/>\n&gt; *****************<br/>\n&gt;<br/>\n&gt; Print that out and hang it up somewhere you can read it every day, and<br/>\n&gt; highlight the words &quot;don&#39;t fight with her&quot;. If she tried to pick a fight,<br/>\n&gt; try to get a sense of what she&#39;s communicating - does she need some<br/>\n&gt; attention? a sympathetic ear? an apology? Be prepared to offer all those<br/>\n&gt; things regularly for awhile.<br/>\n&gt; ---Meredith********<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":284087656,"authorName":"Karen","from":"&quot;Karen&quot; &lt;semajrak@...&gt;","profile":"semajrak","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: 10 year old girl & Mom needs help","postDate":"1321759438","msgId":63827,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGphOXJzZStidTNoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGphM2E4dCticnY0QGVHcm91cHMuY29tPg=="},"prevInTopic":63824,"nextInTopic":63828,"prevInTime":63826,"nextInTime":63828,"topicId":63798,"numMessagesInTopic":0,"msgSnippet":"... I was pretty badly bullied for 6 years at school.  I came home crying almost daily.  I could probably write a lot about all that I feel was wrong with my","messageBody":"<div id=\"ygrps-yiv-983770604\"><blockquote><span title=\"ireply\">&gt; I&#39;m scared for my little girl and unsure of myself anymore.<br/>\n<br/>\n </span></blockquote>I was pretty badly bullied for 6 years at school.  I came home crying almost daily.  I could probably write a lot about all that I feel was wrong with my school experience, but the part that made it most difficult was that my mom didn&#39;t know what to do for me.  Worse still, it seemed to me that my problems at school were causing her a great deal of stress and fear.  As a result, to keep her from feeling so sad and afraid, I stopped talking with her about what I was going through.  I didn&#39;t tell any adult.  I didn&#39;t have confidence in them.  I began to believe I deserved all of the difficulties I was having.  I developed incredibly low self-esteem, panic attacks, and social anxiety, all of which are issues I still need to work through regularly today.<br/>\n<br/>\nIf your daughter knows you are scared, she might stop coming to you.  I remember being quite angry with my mom for not being stronger for me.  Then, I became protective of her, sad for her, scared for her, and painfully aware of being on my own.  I love my parents, but still today, I talk with them about very little.  They do not know we unschool.  They did not know we extended nursing.  They did not know we slept with our son.  All of those things would have filled them with fear.  <br/>\n<br/>\nFear will create distance between you and your daughter.  Being unsure of yourself will cause your daughter to be unsure of you too.  If she is unsure of you, she will lose confidence in herself.  Gather your strength and find your footing, and help her navigate this world.  That is your job, and your privilege.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: 10 year old girl & Mom needs help","postDate":"1321755793","msgId":63824,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVEMDhDRkU1LUQxQkItNDUxQi1CRkI2LTRDNDEwQzVEOERFOEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGphOG1vcittN280QGVHcm91cHMuY29tPg==","referencesHeader":"PGphOG1vcittN280QGVHcm91cHMuY29tPg=="},"prevInTopic":63823,"nextInTopic":63827,"prevInTime":63823,"nextInTime":63825,"topicId":63798,"numMessagesInTopic":0,"msgSnippet":"-=-Nobody listened to me as a child about how bad school was with all the bullying. At age 14 I tried to commit suicide three times. They weren t cries for","messageBody":"<div id=\"ygrps-yiv-37289893\">-=-Nobody listened to me as a child about how bad school was with all the bullying. At age 14 I tried to commit suicide three times. They weren&#39;t cries for help, I really wanted to be dead. Thank goodness I didn&#39;t succeed!<br/>\nPlease listen to your child.-=-<br/>\n<br/>\nMy friend Charles died at 14, of his own doing.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/people/charlesmontoya\">http://sandradodd.com/people/charlesmontoya</a><br/>\n<br/>\nHe wasn&#39;t terribly unhappy, but had a hard few weeks.  Perhaps he was gay; evidence is scant.  He had been my boyfriend (such as such is at 13) the year before, and his dad was our art teacher.<br/>\n<br/>\nThe next year, a friend of ours named Alice killed herself.  I was at both funerals.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":414737454,"authorName":"sopik@rogers.com","from":"&quot;sopik@...&quot; &lt;sopik@...&gt;","profile":"sopik@rogers.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: 10 year old girl & Mom needs help","postDate":"1321750633","msgId":63823,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGphOWo5OStuNmVxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGphM2E4dCticnY0QGVHcm91cHMuY29tPg=="},"prevInTopic":63822,"nextInTopic":63824,"prevInTime":63822,"nextInTime":63824,"topicId":63798,"numMessagesInTopic":0,"msgSnippet":"What you describe is exactly what we were living for the three years my daughter went to school full-time. My memories of that time are still so close to the","messageBody":"<div id=\"ygrps-yiv-1894069870\">What you describe is exactly what we were living for the three years my daughter went to school full-time. My memories of that time are still so close to the surface that reading your post brings tears to my eyes. I hated watching the life drain out of my girl. Bringing my daughter home fixed EVERYTHING...the perpetual sadness, the misery, the fighting, the hopelessness. You have a daughter that is very aware that her world is not working for her...she also sounds close to giving up (as my daughter was). Please consider a trial period...we started with a year. We have never looked back.<br/>\n<br/>\nKirsten<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;johnsonscarandbody&quot; &lt;johnsonscarandbody@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; I have been reading  some Unschooling lists for a while now. I am  not ready to make the jump to unschooling or even removing my 10 year old from school *yet*. Because of my work(family owned business that I am attached to) It would mean leaving her home alone all day or &#39;making&#39; her sit at work all day or selling a third generation family business. Not ideal in any sense or something I am ready for, but in the end she may need to not be in school.<br/>\n&gt; <br/>\n&gt; But that is just some background and not why I am here today.I am at the end of my skills to know what to do for my daughter and this may be the wrong place to post about it but I respect the opinions of many here and maybe there is someone else like myself going through the same thing that this will help.<br/>\n&gt; <br/>\n&gt; One time I read on this list that someone said something that really hit home with me. It was something along the lines of how when they started unschooling the &quot;joy&quot; and happiness and smiles came back to their child( can&#39;t remember the last time my girl smiled or laughed), things they had not seen in a long time since starting school, they said it was like having their child back.<br/>\n&gt; <br/>\n&gt; The Beginning, my daughter has always hated school. Preschool was great but once she started full day Kindergarten our world started to crumble. First grade got worse and every year after things have went downhill.<br/>\n&gt; <br/>\n&gt; This past April(2011) I let her change schools on her request. She went from a very small school where her grade only had 30 kids to a nearby school where her grade has 120. She wanted this because she felt that she did not have any friends at her (I will call it &#39;district&#39; school).<br/>\n&gt; <br/>\n&gt; We did this for social reasons, not academic. I had went to the district school as well and knew how she felt. The size of the school made it hard to have many friends because there just are not that many kids. Well, she thought the grass was greener on the other side. Now having been in the other school she wants to go back to her in district school.I asked her why and she can&#39;t give me a definitive answer but said &quot;mom you have to trust me, don&#39;t you trust me?&quot; but I am afraid she won&#39;t be happy there either. She will start back after the Thanksgiving break at her district school.<br/>\n&gt; <br/>\n&gt; Now, that really is just some background, lets get to the knitty-gritty. <br/>\n&gt; <br/>\n&gt; My child is miserable, beyond miserable,really, really miserable. The happy little smiling girl I knew before the school years started is gone, long gone. She frequently says things like &#39;I wish I was dead&#39; or &#39;kill me now&#39; among other similar comments. She is very poorly behaved towards her Dad and Myself. She is downright mean to us. She acts like an out of control no respect to anyone(in the family) child, but I know that is not who she is deep down. She is a sweetheart, but lately a person would never know it.<br/>\n&gt; <br/>\n&gt;  The school staff says that she is happy, smiling and a wonderful girl at school, but this is the polar opposite of what I see at home.<br/>\n&gt; <br/>\n&gt; Here is the thing, I have always been very open and free about letting her make her own choices, we never had rules or being grounded or being told how to act or behave. I always figured that she would just figure things out as she got older and know how to behave properly(which if mom and dad are not around and she is with  friends parents people think she is the best behaved child in the world)but the minute I am around  or she is at home or even in public with me all hell breaks loose and she behaves like she is out of control. it&#39;s like around me she has no self control. But I think it is soon going to start to spread to the rest of her interactions.<br/>\n&gt; <br/>\n&gt; I feel so bad for her because I don&#39;t know what to do for her to bring back the happy little girl she was before school started.<br/>\n&gt; <br/>\n&gt; I am afraid that if I did bring her home that the behavior would get even worse than it is now. She fights me on everything, and even if we did unschooling that the fighting( emotionally as in disagreeing for the sake of disagreeing even if she actually agrees) would not stop.<br/>\n&gt; <br/>\n&gt; Has anyone been at this place and went to unschooling and did it change the child back to acting like a regularly behaved person? I am scared. Scared that if I were to have her home all the time she would not learn anything on her own because she seems to have lost all interest in learning and that is scary, She is smart a a whip and she seems to have no interest in learning at all. I am afraid that if I take her out of school things will fall apart completely and she will never learn of her own free will because as it is now she is very hostile towards everything.<br/>\n&gt; <br/>\n&gt; I wonder if school is the problem at the heart of her misery and hostility. I wonder if I take her out if it will be worse or make things worse. I don&#39;t know what to do and I am afraid she is going to get suicidal. I am afraid know matter which way I go that I am making the wrong choice. She also has weight issues but did not have them before starting school, kindergarten is when she started to gain and it has never stopped, and I wonder if it relates to the misery of school.<br/>\n&gt; <br/>\n&gt; I&#39;m scared for my little girl and unsure of myself anymore.<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":250057382,"authorName":"Tova","from":"Tova &lt;ml_ja@...&gt;","profile":"ml_ja","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: 10 year old girl & Mom needs help","postDate":"1321749085","msgId":63822,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMjE3NDkwODUuNzMyODkuWWFob29NYWlsQ2xhc3NpY0B3ZWIxNjE3MDUubWFpbC5iZjEueWFob28uY29tPg==","inReplyToHeader":"PGphOG1vcittN280QGVHcm91cHMuY29tPg=="},"prevInTopic":63821,"nextInTopic":63823,"prevInTime":63821,"nextInTime":63823,"topicId":63798,"numMessagesInTopic":0,"msgSnippet":"Nobody listened to me either. I thought of suicide a lot and attempted once, and then resorted to partaking in highly destructive behavior because I had such","messageBody":"<div id=\"ygrps-yiv-1646231723\">Nobody listened to me either. I thought of suicide a lot and attempted once, and then resorted to partaking in highly destructive behavior because I had such low self worth, such little value for my own life, due to bullying. School left a lasting impression on my psyche. <br/>\n<br/>\nI highly recommend you take your own child&#39;s troubles very seriously. I wish my parents had. It is a parents job to make sure their child/ren feel taken care of, loved, accepted, happy, secure and protected when they&#39;re 10.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Sat, 11/19/11, cathymorgan25 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:cathymorgan25@...\">cathymorgan25@...</a>&gt; wrote:<br/>\n<br/>\nFrom: cathymorgan25 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:cathymorgan25@...\">cathymorgan25@...</a>&gt;<br/>\nSubject: [AlwaysLearning] Re: 10 year old girl & Mom needs help<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nDate: Saturday, November 19, 2011, 11:50 AM<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n    <br/>\n      <br/>\n      <br/>\n      &quot;It&#39;s quite possible it is. The thing is, a child who is listened to, heard, and<br/>\n<br/>\ntaken seriously when they *first* say something, won&#39;t need to resort to<br/>\n<br/>\ntheatrics or hyperbole to be heard. If the child&#39;s personality is to be<br/>\n<br/>\nmelodramatic and over-the-top, they will still come away knowing that what they<br/>\n<br/>\nsay is important, and their parents care enough to listen.&quot;<br/>\n<br/>\n<br/>\n<br/>\nNobody listened to me as a child about how bad school was with all the bullying. At age 14 I tried to commit suicide three times. They weren&#39;t cries for help, I really wanted to be dead.  Thank goodness I didn&#39;t succeed!<br/>\n<br/>\nPlease listen to your child.<br/>\n<br/>\nCathy<br/>\n<br/>\n<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;NCMama&quot; &lt;dharmamama1@...&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n<br/>\n&gt; =-=this is in the news today <a rel=\"nofollow\" target=\"_blank\" href=\"http://today.msnbc.msn.com/id/45354766/\">http://today.msnbc.msn.com/id/45354766/</a> - she even asked if she could be home schooled and was told it wasn&#39;t possible. please take your daughter&#39;s situation seriously.=-=<br/>\n<br/>\n&gt; <br/>\n<br/>\n&gt; <br/>\n<br/>\n&gt; <br/>\n<br/>\n&gt; I want to add, some people find it easy to dismiss or diminish something a child says as &quot;theatrical&quot; or exaggeration, and they see what is said as hyperbole.<br/>\n<br/>\n&gt; <br/>\n<br/>\n&gt; It&#39;s quite possible it is. The thing is, a child who is listened to, heard, and taken seriously when they *first* say something, won&#39;t need to resort to theatrics or hyperbole to be heard. If the child&#39;s personality is to be melodramatic and over-the-top, they will still come away knowing that what they say is important, and their parents care enough to listen.<br/>\n<br/>\n&gt; <br/>\n<br/>\n&gt; =-=I feel so bad for her because I don&#39;t know what to do for her to bring back the happy little girl she was before school started.<br/>\n<br/>\n&gt; <br/>\n<br/>\n&gt; I am afraid that if I did bring her home that the behavior would get even worse than it is now. She fights me on everything, and even if we did unschooling that the fighting( emotionally as in disagreeing for the sake of disagreeing even if she actually agrees) would not stop.=-=<br/>\n<br/>\n&gt; <br/>\n<br/>\n&gt; It will stop, if you start making her happiness your priority. Make your life fit around your child, don&#39;t ask your child to contort herself to fit your life. Yes, some compromises will need to be made, but as she grows to see you are on her side, and she really is your priority (and as you grow into being there for her in that way), those will come more easily. Finding the win-win CAN and DOES happen.<br/>\n<br/>\n&gt; <br/>\n<br/>\n&gt; There is no one else who can do these things for you, or for her. You are her mother. No one else is. You are it.<br/>\n<br/>\n&gt; <br/>\n<br/>\n&gt; peace,<br/>\n<br/>\n&gt; Caren<br/>\n<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n    <br/>\n     <br/>\n<br/>\n    <br/>\n    <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":344138881,"authorName":"cathymorgan25","from":"&quot;cathymorgan25&quot; &lt;cathymorgan25@...&gt;","profile":"cathymorgan25","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: 10 year old girl & Mom needs help","postDate":"1321721435","msgId":63821,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGphOG1vcittN280QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGphOGl0YStiN3A0QGVHcm91cHMuY29tPg=="},"prevInTopic":63819,"nextInTopic":63822,"prevInTime":63820,"nextInTime":63822,"topicId":63798,"numMessagesInTopic":0,"msgSnippet":"It s quite possible it is. The thing is, a child who is listened to, heard, and taken seriously when they *first* say something, won t need to resort to ","messageBody":"<div id=\"ygrps-yiv-1735227182\">&quot;It&#39;s quite possible it is. The thing is, a child who is listened to, heard, and<br/>\ntaken seriously when they *first* say something, won&#39;t need to resort to<br/>\ntheatrics or hyperbole to be heard. If the child&#39;s personality is to be<br/>\nmelodramatic and over-the-top, they will still come away knowing that what they<br/>\nsay is important, and their parents care enough to listen.&quot;<br/>\n<br/>\n<br/>\nNobody listened to me as a child about how bad school was with all the bullying. At age 14 I tried to commit suicide three times. They weren&#39;t cries for help, I really wanted to be dead.  Thank goodness I didn&#39;t succeed!<br/>\nPlease listen to your child.<br/>\nCathy<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;NCMama&quot; &lt;dharmamama1@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; =-=this is in the news today <a rel=\"nofollow\" target=\"_blank\" href=\"http://today.msnbc.msn.com/id/45354766/\">http://today.msnbc.msn.com/id/45354766/</a> - she even asked if she could be home schooled and was told it wasn&#39;t possible. please take your daughter&#39;s situation seriously.=-=<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; I want to add, some people find it easy to dismiss or diminish something a child says as &quot;theatrical&quot; or exaggeration, and they see what is said as hyperbole.<br/>\n&gt; <br/>\n&gt; It&#39;s quite possible it is. The thing is, a child who is listened to, heard, and taken seriously when they *first* say something, won&#39;t need to resort to theatrics or hyperbole to be heard. If the child&#39;s personality is to be melodramatic and over-the-top, they will still come away knowing that what they say is important, and their parents care enough to listen.<br/>\n&gt; <br/>\n&gt; =-=I feel so bad for her because I don&#39;t know what to do for her to bring back the happy little girl she was before school started.<br/>\n&gt; <br/>\n&gt; I am afraid that if I did bring her home that the behavior would get even worse than it is now. She fights me on everything, and even if we did unschooling that the fighting( emotionally as in disagreeing for the sake of disagreeing even if she actually agrees) would not stop.=-=<br/>\n&gt; <br/>\n&gt; It will stop, if you start making her happiness your priority. Make your life fit around your child, don&#39;t ask your child to contort herself to fit your life. Yes, some compromises will need to be made, but as she grows to see you are on her side, and she really is your priority (and as you grow into being there for her in that way), those will come more easily. Finding the win-win CAN and DOES happen.<br/>\n&gt; <br/>\n&gt; There is no one else who can do these things for you, or for her. You are her mother. No one else is. You are it.<br/>\n&gt; <br/>\n&gt; peace,<br/>\n&gt; Caren<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":336246301,"authorName":"NCMama","from":"&quot;NCMama&quot; &lt;dharmamama1@...&gt;","profile":"carenkh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: 10 year old girl & Mom needs help","postDate":"1321717482","msgId":63819,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGphOGl0YStiN3A0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBREZVMFNENk5jdzRkV1ZEMG1xcmFMcWpXMT1DTmk3UHBDeStlVXpiamczZksyYzBSd0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":63816,"nextInTopic":63821,"prevInTime":63818,"nextInTime":63820,"topicId":63798,"numMessagesInTopic":0,"msgSnippet":"=-=this is in the news today http://today.msnbc.msn.com/id/45354766/ - she even asked if she could be home schooled and was told it wasn t possible. please","messageBody":"<div id=\"ygrps-yiv-1713126097\">=-=this is in the news today <a rel=\"nofollow\" target=\"_blank\" href=\"http://today.msnbc.msn.com/id/45354766/\">http://today.msnbc.msn.com/id/45354766/</a> - she even asked if she could be home schooled and was told it wasn&#39;t possible. please take your daughter&#39;s situation seriously.=-=<br/>\n<br/>\n<br/>\n<br/>\nI want to add, some people find it easy to dismiss or diminish something a child says as &quot;theatrical&quot; or exaggeration, and they see what is said as hyperbole.<br/>\n<br/>\nIt&#39;s quite possible it is. The thing is, a child who is listened to, heard, and taken seriously when they *first* say something, won&#39;t need to resort to theatrics or hyperbole to be heard. If the child&#39;s personality is to be melodramatic and over-the-top, they will still come away knowing that what they say is important, and their parents care enough to listen.<br/>\n<br/>\n=-=I feel so bad for her because I don&#39;t know what to do for her to bring back the happy little girl she was before school started.<br/>\n<br/>\nI am afraid that if I did bring her home that the behavior would get even worse than it is now. She fights me on everything, and even if we did unschooling that the fighting( emotionally as in disagreeing for the sake of disagreeing even if she actually agrees) would not stop.=-=<br/>\n<br/>\nIt will stop, if you start making her happiness your priority. Make your life fit around your child, don&#39;t ask your child to contort herself to fit your life. Yes, some compromises will need to be made, but as she grows to see you are on her side, and she really is your priority (and as you grow into being there for her in that way), those will come more easily. Finding the win-win CAN and DOES happen.<br/>\n<br/>\nThere is no one else who can do these things for you, or for her. You are her mother. No one else is. You are it.<br/>\n<br/>\npeace,<br/>\nCaren</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: 10 year old girl & Mom needs help","postDate":"1321660991","msgId":63816,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGphNnJudiszODF2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzMjE2MzkwNjYuNzkzNjkuWWFob29NYWlsTmVvQHdlYjEyMDkxMy5tYWlsLm5lMS55YWhvby5jb20+"},"prevInTopic":63815,"nextInTopic":63819,"prevInTime":63815,"nextInTime":63817,"topicId":63798,"numMessagesInTopic":0,"msgSnippet":"... ***************** Print that out and hang it up somewhere you can read it every day, and highlight the words don t fight with her . If she tried to pick a","messageBody":"<div id=\"ygrps-yiv-736464046\">Pamela Corkey &lt;p_corkey@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Bring her home, surround her with peace and joy. Don&#39;t fight with her. Just love her. There is much more at stake here than her &quot;education.&quot;<br/>\n </span></blockquote>*****************<br/>\n<br/>\nPrint that out and hang it up somewhere you can read it every day, and highlight the words &quot;don&#39;t fight with her&quot;. If she tried to pick a fight, try to get a sense of what she&#39;s communicating - does she need some attention? a sympathetic ear? an apology? Be prepared to offer all those things regularly for awhile.<br/>\n---Meredith</div>","specialLinks":[]},{"userId":185586397,"authorName":"Lyla Wolfenstein","from":"Lyla Wolfenstein &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: 10 year old girl & Mom needs help","postDate":"1321653975","msgId":63815,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBREZVMFNENk5jdzRkV1ZEMG1xcmFMcWpXMT1DTmk3UHBDeStlVXpiamczZksyYzBSd0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDEzMjE2MzkwNjYuNzkzNjkuWWFob29NYWlsTmVvQHdlYjEyMDkxMy5tYWlsLm5lMS55YWhvby5jb20+","referencesHeader":"PDEzMjE2MzkwNjYuNzkzNjkuWWFob29NYWlsTmVvQHdlYjEyMDkxMy5tYWlsLm5lMS55YWhvby5jb20+"},"prevInTopic":63814,"nextInTopic":63816,"prevInTime":63814,"nextInTime":63816,"topicId":63798,"numMessagesInTopic":0,"msgSnippet":"this is in the news today http://today.msnbc.msn.com/id/45354766/ - she even asked if she could be home schooled and was told it wasn t possible. please take","messageBody":"<div id=\"ygrps-yiv-457228091\">this is in the news today <a rel=\"nofollow\" target=\"_blank\" href=\"http://today.msnbc.msn.com/id/45354766/\">http://today.msnbc.msn.com/id/45354766/</a> - she<br/>\neven asked if she could be home schooled and was told it wasn&#39;t possible.<br/>\nplease take your daughter&#39;s situation seriously.<br/>\n<br/>\nlyla<br/>\n<br/>\n._,___<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":254240390,"authorName":"Pamela Corkey","from":"Pamela Corkey &lt;p_corkey@...&gt;","profile":"p_corkey","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: 10 year old girl & Mom needs help","postDate":"1321639066","msgId":63814,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMjE2MzkwNjYuNzkzNjkuWWFob29NYWlsTmVvQHdlYjEyMDkxMy5tYWlsLm5lMS55YWhvby5jb20+"},"prevInTopic":63813,"nextInTopic":63815,"prevInTime":63813,"nextInTime":63815,"topicId":63798,"numMessagesInTopic":0,"msgSnippet":"Your situation sounds very similar to ours. My son went from a vibrant, happy, magical kid to a joyless boy with little curiosity and a ton of anxiety. School","messageBody":"<div id=\"ygrps-yiv-266836617\">Your situation sounds very similar to ours. My son went from a vibrant, happy, magical kid to a joyless boy with little curiosity and a ton of anxiety. School wanted him on ritalin, they wanted him tutored, they wanted him in therapy, and like an idiot I went along with it. Fortunately for both of us, I eventually woke up and saw my actual child. He was miserable. His life was awful - one dreary obligation after the other, forced to do things he hated by those more powerful, stretching out endlessly before him into the foreseeable future. It knocked the wind out of me - I&#39;d been making the demands of the system more important than the needs of my child! This realization forced me to rethink everything about learning and living  -- made me really look at the things I had just gone mindlessly along with throughout my life and his. It&#39;s a profound source of regret that it took me so long to recognize it. How could I be so blind? How could keeping to<br/>\n the conventional path be more important than his well-being? It really stuns me. <br/>\n<br/>\nWe also had a lot of conflict between us -- it seemed I was constantly engaged in power struggles over homework, bathing, food, bedtimes, practicing violin. In TV families, fighting and wrestling with your child like this meant you were a good, caring parent. The real-life truth was, he didn&#39;t trust me. Why should he? He was in my hands and his life was hell. I had the power to help him, and I wasn&#39;t using it.<br/>\n<br/>\nHe was 11 when I took him out of school and we started deschooling, big time. It&#39;s been about 18 months and we are just recently coming out of it into unschooling. He&#39;s needed the last year or so to heal and rediscover himself and his own interests. I&#39;ve needed this time to reorient myself to a new way of thinking, not just about learning, but about love and relationships and how to be trustworthy. For about 8 or 9 months, Oscar just basked in the comfort of movies, TV, and video games and experimented with his sleeping schedule. He didn&#39;t want to &quot;learn&quot; anything (although he did learn a lot anyway from Dr. Who and Star Trek, the Suite Life of Zach and Cody and The Amazing Race and the hundreds of conversations we had as I kept him company). How could he think about learning when he&#39;d been in in such distress for so long? How could he think about learning when he&#39;d been cut off from his own curiosity by the adults around him who frogmarched him from<br/>\n one boring study unit to the next since he was 5? He&#39;d been too busy trying to survive emotionally to focus on anything else. That has now changed and he has many interests - baking, voice-acting, chemistry, comedy writing, the Rennaisance (thanks, Merlin and the BBC!), and on and on. He had to find a peaceful home in himself before he could start to decorate it with knowledge. <br/>\n<br/>\nI am a single working mother unschooling. You can do it. Create a space at your business where she can nestle up and heal. Fill it with books and games, dvds, craft kits - whatever she enjoys when given a choice. Fill it with snacks. Order delivery to share a few times a week. My life with my child is absolutely wonderful now. I earned back his trust and he is just flourishing. His curiosity has returned with a vengeance. But it took patience from me, plus faith in my child&#39;s inherent worth and goodness. More faith than I had in society&#39;s methods and mandates. <br/>\n<br/>\nAnd if you&#39;re worried about learning, Oscar just had to take a test as part of our state home shooling laws. He&#39;s right on target - around the middle for math and language and the top 20% for reading. That means that, without one single work sheet or pop quiz or mind-numbing lecture, he&#39;s doing as well as all those kids logging their 35 hours plus a week of institutional drills (and waking up at 7am, and needing permission to eat or pee, and some suffering bullying...)<br/>\n<br/>\nBring her home, surround her with peace and joy. Don&#39;t fight with her. Just love her. There is much more at stake here than her &quot;education.&quot; <br/>\n<br/>\nPamela <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":342942830,"authorName":"Jay Ford","from":"Jay Ford &lt;jay.ford79@...&gt;","profile":"jay.ford79","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: 10 year old girl & Mom needs help","postDate":"1321625794","msgId":63813,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMjE2MjU3OTQuNDQ1NjcuWWFob29NYWlsTmVvQHdlYjE2MDUxMC5tYWlsLmJmMS55YWhvby5jb20+"},"prevInTopic":63812,"nextInTopic":63814,"prevInTime":63812,"nextInTime":63814,"topicId":63798,"numMessagesInTopic":0,"msgSnippet":"...   I agree.  What would you do if she were diagnosed with a life-threatening illness?  How would you juggle doctor visits and hospital stays with your","messageBody":"<div id=\"ygrps-yiv-1086141326\"><blockquote><span title=\"ireply\">&gt;&gt;Here&#39;s a bit of unschooling wisdom: find more options. Find ways to be with her, not at work, more of the time.&lt;&lt;<br/>\n </span></blockquote> <br/>\nI agree.  What would you do if she were diagnosed with a life-threatening illness?  How would you juggle doctor visits and hospital stays with your work schedule?  It would disrupt everything and you would figure out how to do it, because it is important.<br/>\n <br/>\nYour child has told you she wants to kill herself and wishes she were dead.  Treat her as if she has a life-threatening illness, because she does.  She needs you to be with her.  Find a way to nest with her and  help her heal.<br/>\n <br/>\n <br/>\nJon<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":283914803,"authorName":"jo kirby","from":"jo kirby &lt;jokirby2004@...&gt;","profile":"jokirby2004","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] 10 year old girl & Mom needs help","postDate":"1321570919","msgId":63812,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMjE1NzA5MTkuNzM5MzkuWWFob29NYWlsTmVvQHdlYjI5NjEzLm1haWwuaXJkLnlhaG9vLmNvbT4=","inReplyToHeader":"PGphM2E4dCticnY0QGVHcm91cHMuY29tPg==","referencesHeader":"PGphM2E4dCticnY0QGVHcm91cHMuY29tPg=="},"prevInTopic":63811,"nextInTopic":63813,"prevInTime":63811,"nextInTime":63813,"topicId":63798,"numMessagesInTopic":0,"msgSnippet":"I know someone who s daughter of similar age committed suicide this year because of school issues. It seems to me death is only a little way away from life -","messageBody":"<div id=\"ygrps-yiv-322183613\">I know someone who&#39;s daughter of similar age committed suicide this year because of school issues. It seems to me death is only a little way away from life - please act on what you have recognised, and help save your daughter. You say you&#39;re not ready, but it sounds like you need to get ready - asap. There really must be more options - I would start with talking to her, try to find out what she really needs right now, and work with her to find a way for her to get it...<br/>\n<br/>\nKind regards, Jo<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: johnsonscarandbody &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:johnsonscarandbody@...\">johnsonscarandbody@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nSent: Thursday, 17 November 2011, 15:46<br/>\nSubject: [AlwaysLearning] 10 year old girl & Mom needs help<br/>\n<br/>\n<br/>\n  <br/>\nI have been reading  some Unschooling lists for a while now. I am  not ready to make the jump to unschooling or even removing my 10 year old from school *yet*. Because of my work(family owned business that I am attached to) It would mean leaving her home alone all day or &#39;making&#39; her sit at work all day or selling a third generation family business. Not ideal in any sense or something I am ready for, but in the end she may need to not be in school.<br/>\n<br/>\nBut that is just some background and not why I am here today.I am at the end of my skills to know what to do for my daughter and this may be the wrong place to post about it but I respect the opinions of many here and maybe there is someone else like myself going through the same thing that this will help.<br/>\n<br/>\nOne time I read on this list that someone said something that really hit home with me. It was something along the lines of how when they started unschooling the &quot;joy&quot; and happiness and smiles came back to their child( can&#39;t remember the last time my girl smiled or laughed), things they had not seen in a long time since starting school, they said it was like having their child back.<br/>\n<br/>\nThe Beginning, my daughter has always hated school. Preschool was great but once she started full day Kindergarten our world started to crumble. First grade got worse and every year after things have went downhill.<br/>\n<br/>\nThis past April(2011) I let her change schools on her request. She went from a very small school where her grade only had 30 kids to a nearby school where her grade has 120. She wanted this because she felt that she did not have any friends at her (I will call it &#39;district&#39; school).<br/>\n<br/>\nWe did this for social reasons, not academic. I had went to the district school as well and knew how she felt. The size of the school made it hard to have many friends because there just are not that many kids. Well, she thought the grass was greener on the other side. Now having been in the other school she wants to go back to her in district school.I asked her why and she can&#39;t give me a definitive answer but said &quot;mom you have to trust me, don&#39;t you trust me?&quot; but I am afraid she won&#39;t be happy there either. She will start back after the Thanksgiving break at her district school.<br/>\n<br/>\nNow, that really is just some background, lets get to the knitty-gritty. <br/>\n<br/>\nMy child is miserable, beyond miserable,really, really miserable. The happy little smiling girl I knew before the school years started is gone, long gone. She frequently says things like &#39;I wish I was dead&#39; or &#39;kill me now&#39; among other similar comments. She is very poorly behaved towards her Dad and Myself. She is downright mean to us. She acts like an out of control no respect to anyone(in the family) child, but I know that is not who she is deep down. She is a sweetheart, but lately a person would never know it.<br/>\n<br/>\nThe school staff says that she is happy, smiling and a wonderful girl at school, but this is the polar opposite of what I see at home.<br/>\n<br/>\nHere is the thing, I have always been very open and free about letting her make her own choices, we never had rules or being grounded or being told how to act or behave. I always figured that she would just figure things out as she got older and know how to behave properly(which if mom and dad are not around and she is with  friends parents people think she is the best behaved child in the world)but the minute I am around  or she is at home or even in public with me all hell breaks loose and she behaves like she is out of control. it&#39;s like around me she has no self control. But I think it is soon going to start to spread to the rest of her interactions.<br/>\n<br/>\nI feel so bad for her because I don&#39;t know what to do for her to bring back the happy little girl she was before school started.<br/>\n<br/>\nI am afraid that if I did bring her home that the behavior would get even worse than it is now. She fights me on everything, and even if we did unschooling that the fighting( emotionally as in disagreeing for the sake of disagreeing even if she actually agrees) would not stop.<br/>\n<br/>\nHas anyone been at this place and went to unschooling and did it change the child back to acting like a regularly behaved person? I am scared. Scared that if I were to have her home all the time she would not learn anything on her own because she seems to have lost all interest in learning and that is scary, She is smart a a whip and she seems to have no interest in learning at all. I am afraid that if I take her out of school things will fall apart completely and she will never learn of her own free will because as it is now she is very hostile towards everything.<br/>\n<br/>\nI wonder if school is the problem at the heart of her misery and hostility. I wonder if I take her out if it will be worse or make things worse. I don&#39;t know what to do and I am afraid she is going to get suicidal. I am afraid know matter which way I go that I am making the wrong choice. She also has weight issues but did not have them before starting school, kindergarten is when she started to gain and it has never stopped, and I wonder if it relates to the misery of school.<br/>\n<br/>\nI&#39;m scared for my little girl and unsure of myself anymore.<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: 10 year old girl & Mom needs help","postDate":"1321567229","msgId":63810,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGphNDA1dCtnMjJmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGphM2E4dCticnY0QGVHcm91cHMuY29tPg=="},"prevInTopic":63808,"nextInTopic":63811,"prevInTime":63809,"nextInTime":63811,"topicId":63798,"numMessagesInTopic":0,"msgSnippet":"... Have you asked her? If she d rather be at school than home, then taking her out will likely make things worse. If she doesn t have anything to come home","messageBody":"<div id=\"ygrps-yiv-1303955781\">&quot;johnsonscarandbody&quot; &lt;johnsonscarandbody@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I wonder if I take her out if it will be worse or make things worse.<br/>\n<br/>\n </span></blockquote>Have you asked her? If she&#39;d rather be at school than home, then taking her out will likely make things worse. If she doesn&#39;t have anything to come home to, that could make things worse. For unschooling to work, home needs to be better than school at the very least. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Because of my work(family owned business that I am attached to) It would mean leaving her home alone all day or &#39;making&#39; her sit at work all day or selling a third generation family business.<br/>\n </span></blockquote>**************<br/>\n<br/>\nHere&#39;s a bit of unschooling wisdom: find more options. Find ways to be with her, not at work, more of the time. That&#39;s a good idea even if you don&#39;t decide to unschool - find more ways to spend more time with your kid. There are unschooling families with single, working parents. There are unschooling families where both parents work, even families where both parents work out of the home. It&#39;s challenging! It means making some compromises where your job is concerned and moving your kids needs very very high on the priority list. <br/>\n<br/>\nSometimes what helps people think outside the box in terms of work is starting from the assumption that school is no longer an option. That was helpful for me, when Ray came home - he&#39;d been close to being expelled, so the option of using school even as a kind of free child care during the day was right out. And suddenly it was easier to come up with ideas which didn&#39;t include school.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I don&#39;t know what to do and I am afraid she is going to get suicidal.<br/>\n </span></blockquote>*******************<br/>\n<br/>\nIf that&#39;s a real concern, use that as your benchmark: is this choice better than a dead daughter? <br/>\n<br/>\nWith the holidays coming up, make an effort to do what she wants, spend time with her in ways that she enjoys. If she&#39;s needing to blow off steam at home, look for ways to help her do that. Look for ways to be a better friend - not a &quot;friend&quot; who dumps on her and lets her do whatever but a friend who&#39;s willing to take her seriously and put her needs first when they&#39;re obviously more important. If you&#39;re thinking &quot;dead girl&quot; her needs are Obviously More Important. <br/>\n<br/>\nIs there another family where she&#39;s happier than in your home? Can she live with them? That could be another option, better than a dead daughter, which lets you keep your job the way it is. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":327852347,"authorName":"Tress Miles","from":"Tress Miles &lt;milesdt@...&gt;","profile":"abacaxi7476","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] 10 year old girl & Mom needs help","postDate":"1321566738","msgId":63811,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBRkxLeTMxRyt3U3h0WTlQSzlSWTZpK2h4QWJmNjZuMi1CdmFteVVfS1czQ2l0ZzJVQUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGphM2E4dCticnY0QGVHcm91cHMuY29tPg==","referencesHeader":"PGphM2E4dCticnY0QGVHcm91cHMuY29tPg=="},"prevInTopic":63810,"nextInTopic":63812,"prevInTime":63810,"nextInTime":63812,"topicId":63798,"numMessagesInTopic":0,"msgSnippet":"My daughter s behavior is worse with me because I am the person with whom she is emotionally invested.  She let s it all hang out in my presence. She s an","messageBody":"<div id=\"ygrps-yiv-935694219\">My daughter&#39;s behavior is &quot;worse&quot; with me because I am the person with whom<br/>\nshe is emotionally invested.  She let&#39;s it all &quot;hang out&quot; in my presence.<br/>\nShe&#39;s an angel with others because she&#39;s not emotionally invested in them.<br/>\nTress<br/>\n<br/>\nOn Thu, Nov 17, 2011 at 10:46 AM, johnsonscarandbody &lt;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:johnsonscarandbody@...\">johnsonscarandbody@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; I have been reading some Unschooling lists for a while now. I am not ready<br/>\n&gt; to make the jump to unschooling or even removing my 10 year old from school<br/>\n&gt; *yet*. Because of my work(family owned business that I am attached to) It<br/>\n&gt; would mean leaving her home alone all day or &#39;making&#39; her sit at work all<br/>\n&gt; day or selling a third generation family business. Not ideal in any sense<br/>\n&gt; or something I am ready for, but in the end she may need to not be in<br/>\n&gt; school.<br/>\n&gt;<br/>\n&gt; But that is just some background and not why I am here today.I am at the<br/>\n&gt; end of my skills to know what to do for my daughter and this may be the<br/>\n&gt; wrong place to post about it but I respect the opinions of many here and<br/>\n&gt; maybe there is someone else like myself going through the same thing that<br/>\n&gt; this will help.<br/>\n&gt;<br/>\n&gt; One time I read on this list that someone said something that really hit<br/>\n&gt; home with me. It was something along the lines of how when they started<br/>\n&gt; unschooling the &quot;joy&quot; and happiness and smiles came back to their child(<br/>\n&gt; can&#39;t remember the last time my girl smiled or laughed), things they had<br/>\n&gt; not seen in a long time since starting school, they said it was like having<br/>\n&gt; their child back.<br/>\n&gt;<br/>\n&gt; The Beginning, my daughter has always hated school. Preschool was great<br/>\n&gt; but once she started full day Kindergarten our world started to crumble.<br/>\n&gt; First grade got worse and every year after things have went downhill.<br/>\n&gt;<br/>\n&gt; This past April(2011) I let her change schools on her request. She went<br/>\n&gt; from a very small school where her grade only had 30 kids to a nearby<br/>\n&gt; school where her grade has 120. She wanted this because she felt that she<br/>\n&gt; did not have any friends at her (I will call it &#39;district&#39; school).<br/>\n&gt;<br/>\n&gt; We did this for social reasons, not academic. I had went to the district<br/>\n&gt; school as well and knew how she felt. The size of the school made it hard<br/>\n&gt; to have many friends because there just are not that many kids. Well, she<br/>\n&gt; thought the grass was greener on the other side. Now having been in the<br/>\n&gt; other school she wants to go back to her in district school.I asked her why<br/>\n&gt; and she can&#39;t give me a definitive answer but said &quot;mom you have to trust<br/>\n&gt; me, don&#39;t you trust me?&quot; but I am afraid she won&#39;t be happy there either.<br/>\n&gt; She will start back after the Thanksgiving break at her district school.<br/>\n&gt;<br/>\n&gt; Now, that really is just some background, lets get to the knitty-gritty.<br/>\n&gt;<br/>\n&gt; My child is miserable, beyond miserable,really, really miserable. The<br/>\n&gt; happy little smiling girl I knew before the school years started is gone,<br/>\n&gt; long gone. She frequently says things like &#39;I wish I was dead&#39; or &#39;kill me<br/>\n&gt; now&#39; among other similar comments. She is very poorly behaved towards her<br/>\n&gt; Dad and Myself. She is downright mean to us. She acts like an out of<br/>\n&gt; control no respect to anyone(in the family) child, but I know that is not<br/>\n&gt; who she is deep down. She is a sweetheart, but lately a person would never<br/>\n&gt; know it.<br/>\n&gt;<br/>\n&gt; The school staff says that she is happy, smiling and a wonderful girl at<br/>\n&gt; school, but this is the polar opposite of what I see at home.<br/>\n&gt;<br/>\n&gt; Here is the thing, I have always been very open and free about letting her<br/>\n&gt; make her own choices, we never had rules or being grounded or being told<br/>\n&gt; how to act or behave. I always figured that she would just figure things<br/>\n&gt; out as she got older and know how to behave properly(which if mom and dad<br/>\n&gt; are not around and she is with friends parents people think she is the best<br/>\n&gt; behaved child in the world)but the minute I am around or she is at home or<br/>\n&gt; even in public with me all hell breaks loose and she behaves like she is<br/>\n&gt; out of control. it&#39;s like around me she has no self control. But I think it<br/>\n&gt; is soon going to start to spread to the rest of her interactions.<br/>\n&gt;<br/>\n&gt; I feel so bad for her because I don&#39;t know what to do for her to bring<br/>\n&gt; back the happy little girl she was before school started.<br/>\n&gt;<br/>\n&gt; I am afraid that if I did bring her home that the behavior would get even<br/>\n&gt; worse than it is now. She fights me on everything, and even if we did<br/>\n&gt; unschooling that the fighting( emotionally as in disagreeing for the sake<br/>\n&gt; of disagreeing even if she actually agrees) would not stop.<br/>\n&gt;<br/>\n&gt; Has anyone been at this place and went to unschooling and did it change<br/>\n&gt; the child back to acting like a regularly behaved person? I am scared.<br/>\n&gt; Scared that if I were to have her home all the time she would not learn<br/>\n&gt; anything on her own because she seems to have lost all interest in learning<br/>\n&gt; and that is scary, She is smart a a whip and she seems to have no interest<br/>\n&gt; in learning at all. I am afraid that if I take her out of school things<br/>\n&gt; will fall apart completely and she will never learn of her own free will<br/>\n&gt; because as it is now she is very hostile towards everything.<br/>\n&gt;<br/>\n&gt; I wonder if school is the problem at the heart of her misery and<br/>\n&gt; hostility. I wonder if I take her out if it will be worse or make things<br/>\n&gt; worse. I don&#39;t know what to do and I am afraid she is going to get<br/>\n&gt; suicidal. I am afraid know matter which way I go that I am making the wrong<br/>\n&gt; choice. She also has weight issues but did not have them before starting<br/>\n&gt; school, kindergarten is when she started to gain and it has never stopped,<br/>\n&gt; and I wonder if it relates to the misery of school.<br/>\n&gt;<br/>\n&gt; I&#39;m scared for my little girl and unsure of myself anymore.<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] 10 year old girl & Mom needs help","postDate":"1321564023","msgId":63808,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM0MUJERTgxLTAzQkMtNDFCNy05NUI5LUQxMkNEOEQ5RkUzMkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PENBTXVqbWR2YVFFSkwwTFZwbVpqZj1VZmNBRFlyYUMxeGh2M3NCWXVjX21iZzF6aTNkZ0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PGphM2E4dCticnY0QGVHcm91cHMuY29tPiA8Q0FNdWptZHZhUUVKTDBMVnBtWmpmPVVmY0FEWXJhQzF4aHYzc0JZdWNfbWJnMXppM2RnQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":63807,"nextInTopic":63810,"prevInTime":63807,"nextInTime":63809,"topicId":63798,"numMessagesInTopic":0,"msgSnippet":"-=-I grew up in a family that was in business and my parents often took my brother and I with them to help out. We were both schooled, but loved when we were","messageBody":"<div id=\"ygrps-yiv-1825731131\">-=-I grew up in a family that was in business and my parents often took my<br/>\nbrother and I with them to help out. We were both schooled, but loved when<br/>\nwe were able to actually do something real. Is there any wa[y] that your<br/>\ndaughter could be included in the family business? There is very little<br/>\nelse that is more &#39;educational&#39; than actual work that is useful.-=-<br/>\n<br/>\nThis is both wonderful and terrible. :-)<br/>\n<br/>\nDepending on the jurisdiction and on the other circumstances of the family, the juvenile or educational authorities could easily flip out if a child was working rather than &quot;being in school.&quot;  Homeschooling is an alternative to being in school.  Working isn&#39;t.  So just go easy with such ideas. <br/>\n<br/>\nIf the week is set up so that there are clearly lots of opportunities and activities that would look impressive to &quot;an official,&quot; and it was made clear that &quot;school hours&quot; existed other times, it could help.<br/>\n<br/>\nPeople are in the habit of thinking of &quot;school hours,&quot; but there are a whole lot of hours in the week.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":231415297,"authorName":"chris ester","from":"chris ester &lt;chris.homeschool@...&gt;","profile":"chris_e_bear","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] 10 year old girl & Mom needs help","postDate":"1321562731","msgId":63807,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBTXVqbWR2YVFFSkwwTFZwbVpqZj1VZmNBRFlyYUMxeGh2M3NCWXVjX21iZzF6aTNkZ0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGphM2E4dCticnY0QGVHcm91cHMuY29tPg==","referencesHeader":"PGphM2E4dCticnY0QGVHcm91cHMuY29tPg=="},"prevInTopic":63805,"nextInTopic":63808,"prevInTime":63806,"nextInTime":63808,"topicId":63798,"numMessagesInTopic":0,"msgSnippet":"On Thu, Nov 17, 2011 at 10:46 AM, johnsonscarandbody ","messageBody":"<div id=\"ygrps-yiv-1306355735\">On Thu, Nov 17, 2011 at 10:46 AM, johnsonscarandbody &lt;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:johnsonscarandbody@...\">johnsonscarandbody@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &gt;&gt;I have been reading some Unschooling lists for a while now. I am not<br/>\n&gt; ready to make the jump to unschooling or even removing my 10 year old from<br/>\n&gt; school *yet*. Because of my work(family owned business that I am attached<br/>\n&gt; to) It would mean leaving her home alone all day or &#39;making&#39; her sit at<br/>\n&gt; work all day or selling a third generation family business. Not ideal in<br/>\n&gt; any sense or something I am ready for, but in the end she may need to not<br/>\n&gt; be in school.&lt;&lt;&lt;<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>I grew up in a family that was in business and my parents often took my<br/>\nbrother and I with them to help out.  We were both schooled, but loved when<br/>\nwe were able to actually do something real.  Is there any war that your<br/>\ndaughter could be included in the family business?  There is very little<br/>\nelse that is more &#39;educational&#39; than actual work that is useful.<br/>\n<br/>\nOf course your daughter is too young to spend the entire day at work.<br/>\nCould you hire someone to work in your business for part of the day so that<br/>\nyou can be with your daughter elsewhere?  Or are there family supports that<br/>\ncan help out with either the business or your daughter?<br/>\n<br/>\nChris<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] 10 year old girl & Mom needs help","postDate":"1321549758","msgId":63805,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEZFMUY3QUFFLUNFMTgtNDczQS1CNkFFLUM3QTM0REQ4MjM3Q0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGphM2E4dCticnY0QGVHcm91cHMuY29tPg==","referencesHeader":"PGphM2E4dCticnY0QGVHcm91cHMuY29tPg=="},"prevInTopic":63803,"nextInTopic":63807,"prevInTime":63804,"nextInTime":63806,"topicId":63798,"numMessagesInTopic":0,"msgSnippet":"... I would say there s no question. You say you ve always allowed her to make her own choices. Except the one choice that you say has made her miserable from","messageBody":"<div id=\"ygrps-yiv-1382488186\">On Nov 17, 2011, at 10:46 AM, johnsonscarandbody wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I wonder if school is the problem at the heart of her misery and  <br/>\n&gt; hostility.<br/>\n<br/>\n </span></blockquote>I would say there&#39;s no question. You say you&#39;ve always allowed her to  <br/>\nmake her own choices. Except the one choice that you say has made her  <br/>\nmiserable from day 1.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I wonder if I take her out if it will be worse or make things worse.<br/>\n<br/>\n<br/>\n </span></blockquote>How would leaving her in the situation that she&#39;s miserable in be  <br/>\nbetter than taking her out?<br/>\n<br/>\nI would guess that if you bring her home she will be relieved and she  <br/>\nwill also be angry. It will be part of the healing process, which to  <br/>\nhelp her heal, you&#39;ll need a great deal of understanding and  <br/>\ncompassion for.<br/>\n<br/>\nRight now she doesn&#39;t trust you. You&#39;re the one with the power, the  <br/>\none who is supposed to be her advocate in the world and she sees  <br/>\nyou&#39;re not fixing this thing that&#39;s hurting her. So of course she&#39;s  <br/>\nangry.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Has anyone been at this place and went to unschooling and did it  <br/>\n&gt; change the child back to acting like a regularly behaved person?<br/>\n<br/>\n<br/>\n </span></blockquote>This will seem nitpicky but it&#39;s important: It depends how you define  <br/>\nunschooling.<br/>\n<br/>\nRadical unschooling as discussed here is a fairly specific collection  <br/>\nof principles, values, attitudes and viewpoints that nurtures children  <br/>\nand their learning.<br/>\n<br/>\nDoing something you think might be called unschooling won&#39;t help her  <br/>\nheal and flourish. What will help her heal and flourish is supporting  <br/>\nher and her interests, being her partner, nurturing her and giving her  <br/>\nwhat helps her feel whole.<br/>\n<br/>\nBut first she needs a whole lot -- a year or more (since she&#39;s been so  <br/>\nmiserable) -- of deschooling. Of you just tending to her as if she had  <br/>\na broken leg and creating a nest for her to heal in.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I feel so bad for her because I don&#39;t know what to do for her to  <br/>\n&gt; bring back the happy little girl she was before school started.<br/>\n<br/>\n<br/>\n </span></blockquote>The biggest myth of school is that just because some kids put up with  <br/>\nit and some are even actually happy, that everyone can be.<br/>\n<br/>\nLook at all the different choices adults make once they get out of the  <br/>\nprison of school. What do truck drivers, accountants, clowns,  <br/>\nelectricians, rock musicians, landscapers, pilots, archaeologists have  <br/>\nin common other than being human shaped? Human children are just as  <br/>\nvaried in their interests, needs, personalities as that list is. To  <br/>\nexpect them all to love one (boring) way of spending their childhood  <br/>\nis an incredible blindness that all of society suffers. (Probably  <br/>\nbecause kids are so powerless and dependent and even when they do  <br/>\ncomplain, no one does anything about it.)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Now having been in the other school she wants to go back to her in  <br/>\n&gt; district school.I asked her why and she can&#39;t give me a definitive  <br/>\n&gt; answer but said &quot;mom you have to trust me, don&#39;t you trust me?&quot; but  <br/>\n&gt; I am afraid she won&#39;t be happy there either.<br/>\n<br/>\n<br/>\n </span></blockquote>?? What options does she have?? What are her choices?<br/>\n<br/>\nSee it all through her eyes. *See* and *feel* how powerless she is.  <br/>\nWhat options does she have to escape? She&#39;s got the small school and  <br/>\nthe big school as choices, both of which she hates.<br/>\n<br/>\nWell, actually she is thinking about another option to escape, isn&#39;t  <br/>\nshe? It really is the choice of desperation when there doesn&#39;t seem to  <br/>\nbe anything else.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The school staff says that she is happy, smiling and a wonderful  <br/>\n&gt; girl at school, but this is the polar opposite of what I see at home.<br/>\n<br/>\n<br/>\n </span></blockquote>What&#39;s her choice at school? Should she show everyone how miserable  <br/>\nshe is? Should she be nasty and mean? Would the school listen to her  <br/>\nand change to accommodate her? Or might they make it even more  <br/>\nmiserable for her?<br/>\n<br/>\nWhen you&#39;re in prison  you lean how to not make waves so you can  <br/>\nsurvive. She&#39;s learned how to put on a mask to survive so that bad  <br/>\nisn&#39;t even worse. If your choices were being up to you knees in crap  <br/>\nor being up to your neck in crap, which would you choose? You might  <br/>\nyou just sink in and give up?<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] 10 year old girl & Mom needs help","postDate":"1321548526","msgId":63803,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkzMTQ2OTVCLUM1QTgtNDE0OS05RTQ3LUVDNDMwMDY3NUVFMUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGphM2E4dCticnY0QGVHcm91cHMuY29tPg==","referencesHeader":"PGphM2E4dCticnY0QGVHcm91cHMuY29tPg=="},"prevInTopic":63800,"nextInTopic":63805,"prevInTime":63802,"nextInTime":63804,"topicId":63798,"numMessagesInTopic":0,"msgSnippet":"-=- She is very poorly behaved towards her Dad and Myself. She is downright mean to us. She acts like an out of control no respect to anyone(in the family)","messageBody":"<div id=\"ygrps-yiv-1271038463\">-=- She is very poorly behaved towards her Dad and Myself. She is downright mean to us. She acts like an out of control no respect to anyone(in the family) child, but I know that is not who she is deep down. She is a sweetheart, but lately a person would never know it.-=-<br/>\n<br/>\n-=-The school staff says that she is happy, smiling and a wonderful girl at school, but this is the polar opposite of what I see at home.-=-<br/>\n<br/>\nWhen I saw that with my oldest, Kirby, I was a little resentful, but then reminded myself we were raising him to live in the world, not to live at home forever.  And he WAS able to be charming and helpful with other people.  <br/>\n<br/>\nAt home, your daughter is relaxing from the nice show she performs in public.  But she had the ability to do that nice show.<br/>\n<br/>\nDon&#39;t bring her home against her will.  If you decide you can make unschooling an option, make the offer and let her decide.  But it IS going to cost you some money, I think, to find someone to stay with her during the day for a few years until she&#39;s old enough to stay on her own.  <br/>\n<br/>\n-=- the minute I am around or she is at home or even in public with me all hell breaks loose and she behaves like she is out of control. it&#39;s like around me she has no self control. But I think it is soon going to start to spread to the rest of her interactions.-=-<br/>\n<br/>\nShe might be really angry with you, and not consciously realize it.  <br/>\nShe might also be expressing a normal daughter/mother dynamic because she trusts that you will still love her if she expresses herself.<br/>\n<br/>\nYou wrote two things you should look at and consider:<br/>\n<br/>\n-=-She acts like an out of control. . .child.-=-<br/>\n-=- she behaves like she is out of control.-=-<br/>\n<br/>\nYou have a layer between you and seeing her directly.  You&#39;re saying she&#39;s acting, or behaving, rather than being.  <br/>\n<br/>\n-=- I know that is not who she is deep down. She is a sweetheart-=-<br/>\n<br/>\nThe days of her having been a sweetheart are, in your own words, &quot;gone, long gone.&quot;<br/>\n<br/>\nCould they be restored?  Very likely.<br/>\nCan they be restored without you changing your schedule?  No.<br/>\nIf someone stays with her during the day, you will still need to spend a LOT of time with her when you&#39;re not at work.<br/>\n<br/>\nIf she&#39;s home, first thing is to leave her to just be, to just mess around.  To sleep.  To sit and draw, or watch TV.   Five months or more.  If you try to &quot;do work&quot; she won&#39;t want to be home, and she won&#39;t be learning.  School has taught her to avoid those things.  She can recover, but only if you really pay attention to deschooling, and it will take longer for the parents than for the child, so when she does get interested in history and writing and such again, you need to be careful NOT to &quot;scholastisize&quot; anything.  Let it all be fun exploration of the world.<br/>\n<br/>\n-=-Here is the thing, I have always been very open and free about letting her make her own choices, we never had rules or being grounded or being told how to act or behave.-=-<br/>\n<br/>\nNever telling someone how to act or behave is as bad as ALWAYS telling someone how to act or behave.  But rather than thinking of it as &quot;telling,&quot; think more of discussion or advice.  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/balance\">http://sandradodd.com/balance</a><br/>\n<br/>\n-=-(which if mom and dad are not around and she is with friends parents people think she is the best behaved child in the world)but the minute I am around or she is at home or even in public with me all hell breaks loose and she behaves like she is out of control. it&#39;s like around me she has no self control. But I think it is soon going to start to spread to the rest of her interactions.-=-<br/>\n<br/>\nIt probably won&#39;t spread to others.  But maybe the others are treating her more respectfully than you are.  Maybe around others she gets to try different ways of being, and be impressive.  Maybe with you she&#39;s facing repeat pressure or expectation or complaint.  (I&#39;m just guessing, extrapolating from situations we&#39;ve had here where my kids come to prefer other adults to me for a while, and I figure out what I&#39;m doing to hold them back.)<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] 10 year old girl & Mom needs help","postDate":"1321547187","msgId":63800,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMxQjU4NjZBLUIyOUQtNEI3Qi04MzYzLUQyRjgzQkVBREFDM0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGphM2E4dCticnY0QGVHcm91cHMuY29tPg==","referencesHeader":"PGphM2E4dCticnY0QGVHcm91cHMuY29tPg=="},"prevInTopic":63798,"nextInTopic":63803,"prevInTime":63799,"nextInTime":63801,"topicId":63798,"numMessagesInTopic":0,"msgSnippet":"-=- I am not ready to make the jump to unschooling or even removing my 10 year old from school *yet*. Because of my work(family owned business that I am","messageBody":"<div id=\"ygrps-yiv-425213520\">-=- I am not ready to make the jump to unschooling or even removing my 10 year old from school *yet*. Because of my work(family owned business that I am attached to) It would mean leaving her home alone all day or &#39;making&#39; her sit at work all day or selling a third generation family business. Not ideal in any sense or something I am ready for, but in the end she may need to not be in school.-=-<br/>\n<br/>\nI&#39;ve read your whole post.<br/>\n&quot;In the end&quot;?<br/>\nShe&#39;s talking about death already.<br/>\n<br/>\nYou don&#39;t have to leave her home alone all day.  You don&#39;t have to &quot;make&quot; her sit at work, or sell your business.  <br/>\nIf you want our help, you can&#39;t tell us what the answer must be.<br/>\n<br/>\nPlease read this, while you&#39;re thinking about what to do.  You have choices.  If you tie your own hands, it&#39;s not fair to complain to others that your hands are tied.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/haveto\">http://sandradodd.com/haveto</a><br/>\n<br/>\n-=-I&#39;m scared for my little girl and unsure of myself anymore.-=-<br/>\n<br/>\nI don&#39;t think you were sure of yourself when you first sent her to school.  You did it because everyone else was doing it, not from a careful consideration of a variety of options.<br/>\n  It has worked out better for some of the others than for your daughter.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":484021822,"authorName":"johnsonscarandbody","from":"&quot;johnsonscarandbody&quot; &lt;johnsonscarandbody@...&gt;","profile":"johnsonscarandbody","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"10 year old girl & Mom needs help","postDate":"1321544797","msgId":63798,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGphM2E4dCticnY0QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":63800,"prevInTime":63797,"nextInTime":63799,"topicId":63798,"numMessagesInTopic":0,"msgSnippet":"I have been reading  some Unschooling lists for a while now. I am  not ready to make the jump to unschooling or even removing my 10 year old from school *yet*.","messageBody":"<div id=\"ygrps-yiv-1662285629\">I have been reading  some Unschooling lists for a while now. I am  not ready to make the jump to unschooling or even removing my 10 year old from school *yet*. Because of my work(family owned business that I am attached to) It would mean leaving her home alone all day or &#39;making&#39; her sit at work all day or selling a third generation family business. Not ideal in any sense or something I am ready for, but in the end she may need to not be in school.<br/>\n<br/>\nBut that is just some background and not why I am here today.I am at the end of my skills to know what to do for my daughter and this may be the wrong place to post about it but I respect the opinions of many here and maybe there is someone else like myself going through the same thing that this will help.<br/>\n<br/>\nOne time I read on this list that someone said something that really hit home with me. It was something along the lines of how when they started unschooling the &quot;joy&quot; and happiness and smiles came back to their child( can&#39;t remember the last time my girl smiled or laughed), things they had not seen in a long time since starting school, they said it was like having their child back.<br/>\n<br/>\nThe Beginning, my daughter has always hated school. Preschool was great but once she started full day Kindergarten our world started to crumble. First grade got worse and every year after things have went downhill.<br/>\n<br/>\nThis past April(2011) I let her change schools on her request. She went from a very small school where her grade only had 30 kids to a nearby school where her grade has 120. She wanted this because she felt that she did not have any friends at her (I will call it &#39;district&#39; school).<br/>\n<br/>\nWe did this for social reasons, not academic. I had went to the district school as well and knew how she felt. The size of the school made it hard to have many friends because there just are not that many kids. Well, she thought the grass was greener on the other side. Now having been in the other school she wants to go back to her in district school.I asked her why and she can&#39;t give me a definitive answer but said &quot;mom you have to trust me, don&#39;t you trust me?&quot; but I am afraid she won&#39;t be happy there either. She will start back after the Thanksgiving break at her district school.<br/>\n<br/>\nNow, that really is just some background, lets get to the knitty-gritty. <br/>\n<br/>\nMy child is miserable, beyond miserable,really, really miserable. The happy little smiling girl I knew before the school years started is gone, long gone. She frequently says things like &#39;I wish I was dead&#39; or &#39;kill me now&#39; among other similar comments. She is very poorly behaved towards her Dad and Myself. She is downright mean to us. She acts like an out of control no respect to anyone(in the family) child, but I know that is not who she is deep down. She is a sweetheart, but lately a person would never know it.<br/>\n<br/>\n The school staff says that she is happy, smiling and a wonderful girl at school, but this is the polar opposite of what I see at home.<br/>\n<br/>\nHere is the thing, I have always been very open and free about letting her make her own choices, we never had rules or being grounded or being told how to act or behave. I always figured that she would just figure things out as she got older and know how to behave properly(which if mom and dad are not around and she is with  friends parents people think she is the best behaved child in the world)but the minute I am around  or she is at home or even in public with me all hell breaks loose and she behaves like she is out of control. it&#39;s like around me she has no self control. But I think it is soon going to start to spread to the rest of her interactions.<br/>\n<br/>\nI feel so bad for her because I don&#39;t know what to do for her to bring back the happy little girl she was before school started.<br/>\n<br/>\nI am afraid that if I did bring her home that the behavior would get even worse than it is now. She fights me on everything, and even if we did unschooling that the fighting( emotionally as in disagreeing for the sake of disagreeing even if she actually agrees) would not stop.<br/>\n<br/>\nHas anyone been at this place and went to unschooling and did it change the child back to acting like a regularly behaved person? I am scared. Scared that if I were to have her home all the time she would not learn anything on her own because she seems to have lost all interest in learning and that is scary, She is smart a a whip and she seems to have no interest in learning at all. I am afraid that if I take her out of school things will fall apart completely and she will never learn of her own free will because as it is now she is very hostile towards everything.<br/>\n<br/>\nI wonder if school is the problem at the heart of her misery and hostility. I wonder if I take her out if it will be worse or make things worse. I don&#39;t know what to do and I am afraid she is going to get suicidal. I am afraid know matter which way I go that I am making the wrong choice. She also has weight issues but did not have them before starting school, kindergarten is when she started to gain and it has never stopped, and I wonder if it relates to the misery of school.<br/>\n<br/>\nI&#39;m scared for my little girl and unsure of myself anymore.</div>","specialLinks":[]}],"prevTopicId":5348,"nextTopicId":63774}}