{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":157714996,"authorName":"Sharon Schwartz","from":"&quot;Sharon Schwartz&quot; &lt;sharonjrt@...&gt;","profile":"sharonjrt","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: article from Chicago Suntimes","postDate":"1167518054","msgId":27525,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVuNnBoNitsZTl0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDhDOEY3MUE1RTAyQjU1OS0xNzhDLTY4MzRARldNLU0zMC5zeXNvcHMuYW9sLmNvbT4="},"prevInTopic":27512,"nextInTopic":0,"prevInTime":27524,"nextInTime":27526,"topicId":27512,"numMessagesInTopic":0,"msgSnippet":"Hi All! Do any of you know the Stewarts personally?  I d like to welcome her to NJ! I know she s going to be busier than a 1-armed paper hanger once she gets","messageBody":"<div id=\"ygrps-yiv-1961246157\">Hi All! <br/>\nDo any of you know the Stewarts personally?  I&#39;d like to welcome her <br/>\nto NJ! I know she&#39;s going to be busier than a 1-armed paper hanger <br/>\nonce she gets here, but I&#39;d like to welcome her all the same. Our <br/>\nfamily lives on the coast, but I&#39;m sure that there are quite a few <br/>\npeople in the Princeton area who would like to to welcome her as well.<br/>\nHappy New Year!<br/>\nSharon</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"article from Chicago Suntimes","postDate":"1167147226","msgId":27512,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDOEY3MUE1RTAyQjU1OS0xNzhDLTY4MzRARldNLU0zMC5zeXNvcHMuYW9sLmNvbT4="},"prevInTopic":0,"nextInTopic":27525,"prevInTime":27511,"nextInTime":27513,"topicId":27512,"numMessagesInTopic":0,"msgSnippet":"Except for the eating candy bars bit, it s pretty good. A little academic -oriented--- but I think that s what people need to bellieve. ~Kelly You have to","messageBody":"<div id=\"ygrps-yiv-1469905932\">Except for the &quot;eating candy bars&quot; bit, it&#39;s pretty good. A little <br/>\n&quot;academic&#39;-oriented--- but I think that&#39;s what people need to bellieve.<br/>\n<br/>\n~Kelly<br/>\n<br/>\n<br/>\nYou have to trust that the child will learn&#39;<br/>\n&#39;Unschooling&#39; movement leaves education choices up to kids<br/>\n<br/>\nDecember 24, 2006<br/>\nBY ROSALIND ROSSI Education Reporter<br/>\nEighteen-year-old Abby Stewart got word this month that she won early <br/>\nadmission to elite Princeton University, even though she has never set <br/>\nfoot in a high school classroom.<br/>\nShe also wrapped up a huge challenge -- dancing the Snow Queen role in <br/>\n&quot;The Nutcracker Suite&quot; at the Athenaeum Theatre -- largely because she <br/>\nhas never set foot in a high school classroom.<br/>\n<br/>\nFive years ago, frustrated with the pace and depth of a Chicago Public <br/>\nSchool gifted program, Abby withdrew from eighth grade and entered <br/>\nuncharted territory -- a branch of home schooling often called <br/>\n&quot;unschooling.&quot;<br/>\n<br/>\nUnder this ultimate form of &quot;child-directed&quot; learning, Abby used no set <br/>\ncurriculum. She called her own hours, worked at her own pace and, most <br/>\nimportant, followed her own interests -- without taking tests or <br/>\nreceiving grades. Some days, she&#39;d wake up, grab a bowl of cereal and <br/>\ngo back to bed with a book.<br/>\n<br/>\nSince then, she has amassed a six-page reading list ranging from <br/>\nCharles Darwin&#39;s The Origin of Species to Holt, Rinehart and Winston&#39;s <br/>\nCalculus to 16 Shakespearean plays.<br/>\n&quot;I do exactly what feels right to me,&quot; says Abby. &quot;If I want to just <br/>\nread literature for three weeks or three months, that&#39;s perfectly fine <br/>\nwith my family.&quot;<br/>\n<br/>\nThe flexibility of unschooling made it easier for Abby to take ballet <br/>\nclasses six days a week, resulting in the shopping bag full of pointe <br/>\nshoes in the corner of her Hyde Park bedroom and her recent role in <br/>\nBallet Chicago&#39;s Studio Company production of &quot;The Nutcracker Suite.&quot;<br/>\n<br/>\nAbby also volunteers three days a week at the Field Museum, where she <br/>\nreduces animal carcasses to bones. Her first day at work, she was given <br/>\na pair of gloves and a scalpel and directed to the remains of a <br/>\nSiberian tiger.<br/>\n<br/>\n&quot;Compared to a kid in high school with worms and frogs, it&#39;s pretty <br/>\nheady stuff,&quot; said her dad, Dana Stewart, a sleep researcher at the <br/>\nUniversity of Chicago Hospitals.<br/>\n<br/>\n<br/>\n&#39;Delight-driven learning&#39;<br/>\nBy some counts, Abby is part of a growing movement, at least in the <br/>\nChicago area.<br/>\nFederal officials estimate that about 1.1 million students nationwide <br/>\nwere home-schooled in 2003, up a hefty 30 percent from four years <br/>\nearlier.<br/>\n<br/>\nAlthough numbers on unschooling are more difficult to come by, since <br/>\n1999, at least five unschooling online support groups have sprung up in <br/>\nIllinois, four of them concentrated in the six-county Chicago area, <br/>\nsaid Melissa Bradford, founder of Many Rivers Unschooling, serving <br/>\nmostly DuPage and Will counties.<br/>\n<br/>\n&quot;It&#39;s definitely growing. Look at our group,&quot; said Winifred Haun, a <br/>\nchoreographer and dancer who co-founded Northside Unschoolers of <br/>\nChicago in 2001 with some half-dozen families. Last year, membership <br/>\nhit 100.<br/>\n<br/>\nUnschooling is rooted in the ideas of education reformer John Holt, who <br/>\nsaid children are innately curious and will learn what they need to <br/>\nknow when they need to know it.<br/>\n<br/>\nThat doesn&#39;t mean unschoolers won&#39;t ever take conventional classes.<br/>\n<br/>\nArt enthusiasts may take art classes. Teens who want to go to college <br/>\nmay take community college classes first.<br/>\n<br/>\nUnschoolers figure out what they want to do in life and then learn what <br/>\nthey need to get there. Advocates say they absorb material better by <br/>\nlearning it when they need it.<br/>\n<br/>\nOne unschooling Web site calls the approach &quot;delight-driven learning.&quot; <br/>\nAuthor Pat Farenga, a student of Holt&#39;s, calls it &quot;the natural way to <br/>\nlearn.&quot;<br/>\n<br/>\n&quot;This is the way we learn before going to school and the way we learn <br/>\nwhen we leave school and enter the world of work,&quot; Farenga writes in <br/>\nTeach Your Own: The John Holt Book of Unschooling.<br/>\n<br/>\nOne Northside Unschoolers mom was seeking an alternative to the test <br/>\nemphasis and heavy homework in her public school. Other unschooling <br/>\nparents may want to avoid labels schools put on especially active kids <br/>\nor late readers.<br/>\n<br/>\n<br/>\n&quot;The hardest thing for most people ... is that you have to trust that <br/>\nthe child will learn,&quot; said Mary Griffith, author of The Unschooling <br/>\nHandbook: How to Use the Whole World As Your Child&#39;s Classroom.<br/>\n<br/>\n&quot;For those of us who had late readers, it was really hard. A lot of <br/>\nunschooled kids don&#39;t learn to read when they are 6. Sometimes waiting <br/>\nuntil they are 7, 8 or 9 is quite common,&quot; said Griffith.<br/>\n&quot;But once they learn to read, they read anything and everything.&quot;<br/>\n<br/>\n<br/>\n&#39;Noodling around&#39;<br/>\nThe tools of unschooling in the early years are scattered across a <br/>\nthird-floor playroom of Winifred Haun&#39;s turn-of-the-century Oak Park <br/>\nhome.<br/>\nDice and board games help daughters Athena, 10; Iris, 5, and Selene, 2, <br/>\nlearn math -- and social skills. Pads of paper, pencils and markers are <br/>\nthere for writing and drawing. Books are omnipresent.<br/>\n<br/>\nThis &quot;unschooling&quot; morning, Iris and Athena have completed math <br/>\nproblems they asked their dad, Stephen Parke, a Harvard grad and <br/>\nphysicist at Argonne National Laboratory, to create.<br/>\n<br/>\n&quot;Iris was interested in 1 plus 1 is 2,&quot; Haun says, so Parke&#39;s worksheet <br/>\nexpands the idea all the way up to 50 plus 50. Athena&#39;s problems amount <br/>\nto early algebra.<br/>\n<br/>\nSelene plays on a futon as Iris works with her mom on sewing and Athena <br/>\nannounces &quot;I need to practice my writing.&quot;<br/>\n<br/>\nAthena has seen what she&#39;s missing -- and doesn&#39;t miss it.<br/>\n<br/>\n&quot;I&#39;ve been to school for a day. It was fun, but I like it here better. <br/>\nIn school, they just sat there while the teacher talked,&quot; Athena says.<br/>\n<br/>\nAthena knows some question whether home-schoolers will develop the <br/>\nproper social skills away from a classroom full of kids their age.<br/>\n<br/>\n&quot;I say home-schoolers do get social skills,&quot; Athena says. &quot;I go to <br/>\nchoir where there&#39;s one other kid who&#39;s home schooled. And I go to a <br/>\nhome-schooling group where there are kids of all ages. And I have Girl <br/>\nScouts and ballet.&quot;<br/>\n<br/>\nHaun said some days her kids &quot;just noodle around, but they are <br/>\ninvesting in days when they produce more.&quot;<br/>\n<br/>\nBesides, she said, &quot;You can teach your kid in 90 minutes a day what it <br/>\ntakes the school six hours. ... The other 4½ hours are, &#39;Stand up. Sit <br/>\nup. Let&#39;s go to the bathroom. Let&#39;s take attendance. ...&#39;<br/>\n<br/>\n&quot;If my daughter needs to know ... how to find her friend&#39;s name in the <br/>\nphone book, I can take five minutes and explain to her about <br/>\nalphabetizing,&quot; Haun said. &quot;I don&#39;t have to test her. I know when she <br/>\ncan look up the name on her own.&quot;<br/>\n<br/>\nIn their teenage years, said Grace Llewellyn, author of The Teenage <br/>\nLiberation Handbook, unschooling kids can study biology with a <br/>\ntextbook, in a community college or with software. Or they can befriend <br/>\na doctor and brainstorm on books to read or projects to do. Or they can <br/>\nvolunteer to work in a veterinarian&#39;s office.<br/>\n<br/>\n&quot;The sky is the limit,&quot; Llewellyn said.<br/>\n<br/>\n<br/>\nThe college question<br/>\nAbby&#39;s dad and mom, a hospice social worker, gave their three children <br/>\na taste of school (all won admission to gifted programs), and <br/>\neventually let them decide if they wanted to stay there. All three <br/>\nwound up pretty much unschoolers, with the oldest graduating from <br/>\nDartmouth in June.<br/>\nAbby wanted to go to college, too, and plunged into subjects she&#39;d need <br/>\nto get there.<br/>\n<br/>\nTo prepare for the SAT college admission tests, she bought some test <br/>\nprep books and took some old subject matter tests. She posted knockout <br/>\nscores: an overall SAT of 2,350 out of 2,400.<br/>\n<br/>\nTo pad out her track record, she also took the SAT world history, <br/>\nliterature and U.S. history tests, scoring 800, 790 and 780, <br/>\nrespectively, on an 800-point scale.<br/>\n<br/>\nNot all unschoolers or home-schoolers have Abby&#39;s scores, but on <br/>\nanother popular college admission test, the ACT, test-takers who <br/>\nidentified themselves as home-schoolers have scored a notch above the <br/>\nnational average for the last decade. This year, they averaged 22.4 on <br/>\na 36-point scale compared with a national average of 21.2.<br/>\n<br/>\nBefore Abby got the news last week that she had won early admission to <br/>\nPrinceton, she had researched applying to seven other colleges and <br/>\nfound them &quot;pretty forgiving&quot; about her lack of a traditional <br/>\ngrade-point average.<br/>\n<br/>\nAt Harvard University, admissions director Marlyn McGrath Lewis said, <br/>\nunschoolers without transcripts can submit college admission scores, <br/>\nand then &quot;tell us what they have done in the way of academic <br/>\npreparation for college, and we&#39;ll take it from there.&quot;<br/>\n<br/>\nSome may wonder if unschoolers can adjust to the structure of college <br/>\nlife. After the regimen of ballet classes, Abby doesn&#39;t expect problems.<br/>\n<br/>\nUnschooler Sam Dickey, 23, an Oak Park native now attending Beloit <br/>\nCollege after four years at a community college, said he has no <br/>\ndifficulty making it to classes. He found he performs well on deadline <br/>\nand is a &quot;very good writer&quot; despite never having written a research <br/>\npaper before college.<br/>\n<br/>\nBut just like traditional schoolers, not all unschoolers want college.<br/>\n<br/>\nJan Hunt, an unschooling counselor who operates the Natural Child <br/>\nProject Web site, said her unschooled son didn&#39;t go to college. He <br/>\nstarted a computer consulting company instead.<br/>\n<br/>\n&quot;He continually beats us at Trivial Pursuit. He&#39;s an incredible <br/>\neditor,&quot; said Hunt. &quot;He can do any math problem in his head. I have the <br/>\nproof in the pudding right here.&quot;<br/>\n<br/>\n<br/>\nNot for everyone<br/>\nYet even advocates caution that unschooling is not for everyone.<br/>\n&quot;It&#39;s just kind of a scary way of doing things. Not many people are <br/>\nwilling to go out on that limb,&quot; said Dorothy Werner, founder of Home <br/>\nOriented Unique Schooling Experience, an Illinois home-schooling <br/>\nsupport group.<br/>\n<br/>\n&quot;You have to trust that children want to learn. You can&#39;t believe that <br/>\nchildren must be forced to learn,&quot; Werner said.<br/>\n<br/>\n&quot;Parents who need to be in control ... would have a hard time. If you <br/>\nwant your child to be learning the same factoids as the child next <br/>\ndoor, unschooling is not for you.&quot;<br/>\n<br/>\nHome-schooling researcher Michael Apple, an education professor at the <br/>\nUniversity of Wisconsin-Madison, is &quot;wary of the hype.&quot; He wonders what <br/>\nunschoolers are really learning about people of other races, religions <br/>\nand cultures.<br/>\n<br/>\n&quot;There is no public accountability,&quot; Apple said.<br/>\n<br/>\nCounters unschooling author Farenga: &quot;Who is going to be the commissar <br/>\nof correct thought?&quot;<br/>\n<br/>\nWilliam Schubert, professor of curriculum studies at the University of <br/>\nIllinois at Chicago, home-schooled his daughter using a few unschooling <br/>\nideas.<br/>\n<br/>\nHe says unschooling can be positive, but requires time, resources and <br/>\n&quot;dialogue with ... well-educated people.&quot;<br/>\n<br/>\n&quot;We don&#39;t know that children are innately curious. The question is <br/>\nopen,&quot; Schubert said. Some unschoolers &quot;may not get any further than <br/>\neating candy bars.&quot;<br/>\n<br/>\nUnschooling may be easier for parents with the time and resources, <br/>\nFarenga agrees, but &quot;everyone can find that within their own little <br/>\nsphere.&quot;<br/>\n<br/>\n&quot;I&#39;m not trying to make this sound like it&#39;s easy,&quot; Farenga said, &quot;but <br/>\nit&#39;s not easy if your child is failing or hurting in school, either.&quot;<br/>\n<br/>\nAbby and others insist every child has a passion waiting to be ignited.<br/>\n<br/>\n&quot;Every person has something they absolutely adore and would like to do <br/>\nfor the rest of their life,&quot; Abby said.<br/>\n<br/>\n&quot;If you can pinpoint that, and have your kids run with it, you&#39;d be <br/>\namazed how excited your kids can be about learning.&quot;<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:rrossi@...\">rrossi@...</a><br/>\n________________________________________________________________________<br/>\nCheck out the new AOL.  Most comprehensive set of free safety and <br/>\nsecurity tools, free access to millions of high-quality videos from <br/>\nacross the web, free AOL Mail and more.</div>","specialLinks":[]}],"prevTopicId":27522,"nextTopicId":27547}}