{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":23,"messages":[{"userId":36584094,"authorName":"mulwiler@hotmail.com","from":"mulwiler@...","profile":"mhf1978","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Back to school woes","postDate":"1094865962","msgId":20662,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNodGs3YSttYmx1QGVHcm91cHMuY29tPg=="},"prevInTopic":20661,"nextInTopic":0,"prevInTime":20661,"nextInTime":20663,"topicId":20551,"numMessagesInTopic":0,"msgSnippet":"Betsy wrote: ","messageBody":"<div id=\"ygrps-yiv-745457161\">Betsy wrote:<br/>\n<br/>\n&lt;&lt;&lt;&lt;&lt;  When I hear teacher&#39;s quoted talking about underprepared <br/>\nhomeschooled kids, I notice a high level of consistency in what they <br/>\nsay.  (Like repeating a party line slogan.)  It&#39;s so high that I <br/>\nthink they are just repeating one or two of the same stories that <br/>\nhave been talked up in faculty meetings and spread around like urban <br/>\nlegends.<br/>\n<br/>\nDid the stories you heard appear to be about specific local kids that <br/>\nthe teacher&#39;s had personally taught, or was it fuzzier stuff?   &gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n<br/>\n<br/>\nTo respond to the more fuzzy stuff, I have concrete examples of <br/>\nschool &quot;horrors&quot; that I tell. <br/>\n<br/>\nOne story that happened to a friend&#39;s son in science class at a<br/>\nlocal middle school.<br/>\n<br/>\nOne story about a teacher that was accused of improper relations with <br/>\nseveral students at the high school. He&#39;s still teaching<br/>\nthere(after <br/>\na year of paid administrative leave - the length of time it took the <br/>\narbitration board to determine that his relationships didn&#39;t<br/>\naffect his ability to teach).<br/>\n<br/>\nAnd then, in response to any &quot;underprepared&quot; homeschooler<br/>\nstories, I say something like:<br/>\n<br/>\n&quot;Wow.  I didn&#39;t realize that every student you get at the<br/>\nbeginning of every year is at or above grade level in every subject. <br/>\nIt must be a very good school..&quot;  <br/>\n<br/>\nin a polite, admiring tone.<br/>\n<br/>\nMercedes<br/>\nwho would tell the stories but thinks that might not be the best use <br/>\nof an unschooling list. . . .</div>","specialLinks":[]},{"userId":36584094,"authorName":"mulwiler@hotmail.com","from":"mulwiler@...","profile":"mhf1978","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Back to school woes","postDate":"1094863148","msgId":20661,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNodGhmYytjc3E0QGVHcm91cHMuY29tPg=="},"prevInTopic":20660,"nextInTopic":20662,"prevInTime":20660,"nextInTime":20662,"topicId":20551,"numMessagesInTopic":0,"msgSnippet":"Joanna wrote: ","messageBody":"<div id=\"ygrps-yiv-1165371225\">Joanna wrote:<br/>\n<br/>\n&lt;&lt;&lt;&lt;&lt;  My mom has been totally awesome.  She keeps saying things <br/>\nlike, &quot;She&#39;ll figure it out&quot;, &quot;who cares if she doesn&#39;t do well, <br/>\nshe&#39;s there to have fun&quot;   &gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nKeep listening to this. . . . . .   &lt;g&gt;<br/>\n<br/>\n<br/>\n&lt;&lt;&lt;&lt;&lt;  Like I said, I&#39;m still kinda freaking out here.   &gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n&lt;&lt;&lt;&lt;&lt;  So do you think I should even bother to try to explain <br/>\nanything to anyone? Should I even show up?   &gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n<br/>\nAs someone who&#39;s children did go back to high school (one from <br/>\nhomeschooling, no mindful parenting and the other from unschooling <br/>\nbut no mindful parenting) I know it can be hard to disinvest yourself <br/>\nin their schooling.<br/>\n<br/>\n<br/>\nI would not go to the parent/teacher night if you are still freaking <br/>\nout. The mind-set of all the parents/teachers there will be so <br/>\ndifferent from yours, it could be discouraging.  The teachers usually <br/>\nhave a set speech and talk about grades, classroom expectations, <br/>\ngrades, rules and grades.  Did I mention they discuss grades?  Not <br/>\nmuch there you really need to know.<br/>\n<br/>\n<br/>\n&lt;&lt;&lt;&lt;&lt;  Should I stop thinking about all of this and let what happens, <br/>\nhappen?  &gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n<br/>\nI wouldn&#39;t stop thinking, though, either.  &lt;g&gt;<br/>\n<br/>\n<br/>\nJulie wrote:<br/>\n<br/>\n &lt;&lt;&lt;&lt;&lt;  I would go to the parent/teacher night.....in fact, I would <br/>\nprobably try to meet with the teacher anyway.  I would talk about how <br/>\nin how we have been unschooling, the kids come across mathematical <br/>\nconcepts often and easily FIRST and the notation tends to come later <br/>\nwhen kids actually NEED it. While at home, she simply hadn&#39;t needed <br/>\nit yet, but being in school, she does.  I would talk to the teacher <br/>\nabout how she would suggest I help my dd understand the notation <br/>\npart.   &gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n<br/>\nWell, you already know what I think about parent/teacher night at <br/>\nthe middle/high school level but I really like the rest of this <br/>\nadvice.  Meet with the teacher alone (parent/teacher night can be <br/>\nstressful for teachers too) and try to get the teacher on your <br/>\nteam.  I also think it would make a big difference to let the teacher <br/>\nknow that your child is there by choice (and it&#39;s not what<br/>\nyou&#39;d have <br/>\nchosen  - &lt;g&gt;) and that grades are not a concern of yours at all but <br/>\nthat learning is.<br/>\n<br/>\nOh, I just remembered that at some high schools teachers won&#39;t/can&#39;t <br/>\nmeet with a parent alone. They usually want a witness present.  <br/>\n(trusting atmosphere, those high schools) If that&#39;s the case, you <br/>\ncould just show up after school one day, maybe, and meet with the <br/>\nteacher informally. Just sort of, &quot;Hi. How&#39;s it going? By the <br/>\nway. . . .&quot;<br/>\n<br/>\n<br/>\nGetting the teacher on your team depends a lot on the teacher, <br/>\nthough.  <br/>\n<br/>\n<br/>\nMercedes<br/>\nwho almost always heard the comment that the seat I selected to sit <br/>\nin during the parent/teacher nights was the same seat Nick sat in <br/>\nduring the day - this happened all 4 years in almost every class<br/>\n(Twilight Zone music inserted here. . . . )<br/>\n<br/>\nIt didn&#39;t happen in the classes with assigned seating  &lt;g&gt;</div>","specialLinks":[]},{"userId":160772665,"authorName":"Gold Standard","from":"&quot;Gold Standard&quot; &lt;contact@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [AlwaysLearning] Re: Back to school woes","postDate":"1094837439","msgId":20660,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFBLRUhKR0NJR05QUEFCRlBCS0xHR0VBRkNKQUEuY29udGFjdEBib2FyZHByZXAubmV0Pg==","inReplyToHeader":"PGNoc2MxZytvYzZhQGVHcm91cHMuY29tPg=="},"prevInTopic":20658,"nextInTopic":20661,"prevInTime":20659,"nextInTime":20661,"topicId":20551,"numMessagesInTopic":0,"msgSnippet":"... who talks to her realizes she is intelligent.  The math teacher will probably realize this too.  But I ll look like I didn t do my job here at home.","messageBody":"<div id=\"ygrps-yiv-1322613121\"><blockquote><span title=\"ireply\">&gt;&gt;She particiapates in the class discussion and I know anyone<br/>\n </span></blockquote>who talks to her realizes she is intelligent.  The math teacher will<br/>\nprobably realize this too.  But I&#39;ll look like I didn&#39;t do my job<br/>\nhere at home.&lt;&lt;<br/>\n<br/>\nI think you&#39;re right about this. Many teachers would automatically think<br/>\nthat. I just went through something similar. My daughter who is in her first<br/>\nyear of trying public school (7th grade) took a placement test beforehand.<br/>\nThere was a part where she had to fill out a United States map the best she<br/>\ncould. She froze in panic. She couldn&#39;t fill out one state. She went to the<br/>\nteacher and said she didn&#39;t know any of this. The teacher said, &quot;Well, why<br/>\ndon&#39;t you just fill out your home state then.&quot; Then Hannah teared up...she<br/>\ndidn&#39;t know that either. When she got into the car, she cried and cried that<br/>\nshe was too stupid to go to public school. She said the people around her<br/>\nknew everything, and she didn&#39;t. She asked me why I didn&#39;t teach her the<br/>\nthings other kids learned by her age. My first feeling was pure and utter<br/>\nguilt, then I gathered my intelligence up and remembered the answer to that<br/>\nquestion. We went over all that she did know, about the difference between<br/>\nintelligence and &quot;memorized knowledge, and she seemed to feel a lot better.<br/>\nAnd wouldn&#39;t you know she had the whole United States memorized within a<br/>\nweek (amazing what incentive does!). If I had tried to make her memorize the<br/>\nUnited States map, it wouldn&#39;t have happened in any timely or meaningful<br/>\nmanner.<br/>\n<br/>\nI did talk to the teacher and explained how upset it made Hannah that she<br/>\ndidn&#39;t know the geography. The teacher agreed that she was a bit surprised.<br/>\nI explained our homeschooling philosophy, but chose to use &quot;learning through<br/>\nliving&quot; and &quot;following our interests&quot; rather than &quot;unschooling&quot;. She seemed<br/>\nnot only accepting, but actually interested. She nodded her head a whole<br/>\nbunch saying that she wished schools were more like that. She talked about<br/>\nhow disillusioned she was about being a teacher when she started out...she<br/>\ndidn&#39;t realize how much drudgery there was in the work in the ps system. So<br/>\nluckily for us, this teacher was still connected to reality. She also<br/>\nmentioned that Hannah was so bright and inquisitive in the classroom which<br/>\nshe doesn&#39;t see from a lot of students at this age. Go figure.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I&#39;m thinking of exuses of why she isn&#39;t up to par on math, that sort<br/>\n </span></blockquote>of explain unschooling , but also make it seem like we were going to<br/>\nget to it eventually.  Like, I&#39;m thinking of lying and saying I was<br/>\nplanning on getting a tutor for her this year, because when I tried<br/>\nto teach her math, she always balked, and having to be held<br/>\naccountable by someone other than me seems to get her rolling.<br/>\nI&#39;ll also explain that I wasn&#39;t planning on her ever going to high<br/>\nschool, but she sprung it on me this summer and though I told her<br/>\nshe wasn&#39;t prepared for a highschool math class, she decided to go<br/>\nfor it anyway.  That part is true.<br/>\nI&#39;ll also talk up her intelligence and make it seem that, with a<br/>\nlittle extra help, I think she really can handle it.&lt;&lt;<br/>\n<br/>\nI think all of these ideas are great. Whatever makes it easier for her and<br/>\nyou. You have good reason for making the choices you did, and whether they<br/>\nunderstand it or not doesn&#39;t matter. If lying or exaggerating is needed to<br/>\nget through to people who don&#39;t understand that your daughter may have to<br/>\ndeal with, so be it. Some people will understand, some won&#39;t. You may be the<br/>\nfirst opportunity they have to &quot;get&quot; something like this though. Maybe it<br/>\nwill be a seed that their grandchildren benefit from!<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;So do you think I should even bother to try to explain anything to<br/>\n </span></blockquote>anyone?<br/>\nShould I even show up?<br/>\nShould I stop thinking about all of this and let what happens,<br/>\nhappen?&lt;&lt;<br/>\n<br/>\nIMO, since you are her mother, this may be an area that she needs your help<br/>\nin. Even though unschooling is a fabulous choice, ultimately, as the adults<br/>\nwe did make the choice, and there are ramifications that effect our children<br/>\nif they try out school. I think we should try to help them succeed as we<br/>\nwould with anything they may have tried at home, provided they want us to.<br/>\n<br/>\nJacki</div>","specialLinks":[]},{"userId":196090915,"authorName":"J. Stauffer","from":"&quot;J. Stauffer&quot; &lt;jnjstau@...&gt;","profile":"jnjstau","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Back to school woes","postDate":"1094832945","msgId":20658,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTIwMWM0OTc1MSQ3MjNjZjg0MCQwMjAwYThjMEB5b3VybzBrd2t3OWp3Yz4=","referencesHeader":"PGNoc2MxZytvYzZhQGVHcm91cHMuY29tPg=="},"prevInTopic":20655,"nextInTopic":20660,"prevInTime":20657,"nextInTime":20659,"topicId":20551,"numMessagesInTopic":0,"msgSnippet":"... Seeing as how I m going through this same thing but at a younger level, I will tell you how I would handle it. I would go to the parent/teacher","messageBody":"<div id=\"ygrps-yiv-1370794797\">&lt;&lt;&lt;&lt;&lt; So do you think I should even bother to try to explain anything to<br/>\n<blockquote><span title=\"ireply\"> &gt; anyone?<br/>\n&gt; Should I even show up?&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>Seeing as how I&#39;m going through this same thing but at a younger level, I<br/>\nwill tell you how I would handle it.<br/>\n<br/>\nI would go to the parent/teacher night.....in fact, I would probably try to<br/>\nmeet with the teacher anyway.  I would talk about how in how we have been<br/>\nunschooling, the kids come across mathematical concepts often and easily<br/>\nFIRST and the notation tends to come later when kids actually NEED it.<br/>\nWhile at home, she simply hadn&#39;t needed it yet, but being in school, she<br/>\ndoes.  I would talk to the teacher about how she would suggest I help my dd<br/>\nunderstand the notation part.<br/>\n<br/>\nIn other words, I would try to do some &quot;team building&quot; with the teacher in<br/>\norder to support my child&#39;s choice.<br/>\n<br/>\nMy youngest wanted to go to K this year.  It is difficult for me.  The<br/>\nteacher wants Michelle to be rhyming words and hearing alliteration.<br/>\nMichelle doesn&#39;t do those things, she likes to paint.  Michelle LOVES<br/>\nschool....says things like &quot;we won&#39;t have to sleep too long and then its<br/>\nschool time. Yay!!!&quot;  &lt;sigh&gt;<br/>\n<br/>\nShe wants to do well but doesn&#39;t yet understand that to do well she needs<br/>\nthe reading skills while still in K.  Michelle loves to do her &quot;work&quot;, in<br/>\nfact has asked the teacher for additional homework.  In order to support her<br/>\nas best I can, I have volunteered to help out in the class so I can see how<br/>\nthe teacher is presenting the material and help give Michelle a context.<br/>\n<br/>\nJulie S.---who is amazed at the turns life takes<br/>\n<br/>\nJulie S<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- <br/>\nFrom: &quot;Joanna Wilkinson&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Wilkinson6@...\">Wilkinson6@...</a>&gt;<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>&gt;<br/>\nSent: Friday, September 10, 2004 9:00 AM<br/>\nSubject: [AlwaysLearning] Re: Back to school woes<br/>\n<br/>\n<br/>\n&gt; &gt; Or they&#39;re seeing unschoolers who don&#39;t know the lingo, or don&#39;t<br/>\n&gt; recognize<br/>\n&gt; &gt; mathematical notation even though they can do some pretty fancy<br/>\n&gt; math in their<br/>\n&gt; &gt; heads.<br/>\n&gt; &gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; This is what&#39;s happening with Carly.<br/>\n&gt; Math seems to be her only real hurdle.  The notations are completely<br/>\n&gt; foreign to her.  But as soon as it&#39;s explained, she is grasping the<br/>\n&gt; concepts.  Yesterday at the beginning of her math class, the teacher<br/>\n&gt; called her and 5 other kids and told them they were not in the right<br/>\n&gt; class because they hadn&#39;t taken the Algebra I placement test.<br/>\n&gt; She was sent to another class where, she said, they do most of their<br/>\n&gt; work on computers.  Today she has to take an assessment test.  So,<br/>\n&gt; last night I googled a pre algebra online test.  She took it and<br/>\n&gt; only got 3 right.  I took it and was pretty clueless myself.  I<br/>\n&gt; couldn&#39;t remember a lot of things, and I passed college algebra.<br/>\n&gt; I&#39;m not going to look very good in the eyes of this teacher on<br/>\n&gt; parent/teacher night.  In her other classes she seems to be doing<br/>\n&gt; well.  She particiapates in the class discussion and I know anyone<br/>\n&gt; who talks to her realizes she is intelligent.  The math teacher will<br/>\n&gt; probably realize this too.  But I&#39;ll look like I didn&#39;t do my job<br/>\n&gt; here at home.<br/>\n&gt; I&#39;m thinking of exuses of why she isn&#39;t up to par on math, that sort<br/>\n&gt; of explain unschooling , but also make it seem like we were going to<br/>\n&gt; get to it eventually.  Like, I&#39;m thinking of lying and saying I was<br/>\n&gt; planning on getting a tutor for her this year, because when I tried<br/>\n&gt; to teach her math, she always balked, and having to be held<br/>\n&gt; accountable by someone other than me seems to get her rolling.<br/>\n&gt; I&#39;ll also explain that I wasn&#39;t planning on her ever going to high<br/>\n&gt; school, but she sprung it on me this summer and though I told her<br/>\n&gt; she wasn&#39;t prepared for a highschool math class, she decided to go<br/>\n&gt; for it anyway.  That part is true.<br/>\n&gt; I&#39;ll also talk up her intelligence and make it seem that, with a<br/>\n&gt; little extra help, I think she really can handle it.<br/>\n&gt;<br/>\n&gt; Like I said, I&#39;m still kinda freaking out here.  My mom has been<br/>\n&gt; totally awesome.  She keeps saying things like, &quot;She&#39;ll figure it<br/>\n&gt; out&quot;, &quot;who cares if she doesn&#39;t do well, she&#39;s there to have fun&quot;<br/>\n&gt; We both consider ourself bad at math, and were laughing yesterday<br/>\n&gt; about how we got through our highschool algebra by cheating a lot.<br/>\n&gt; I didn&#39;t actually understand algebra til I got to college and really<br/>\n&gt; tried hard.  Yet I made it through 2 years of high school algebra<br/>\n&gt; with &quot;C&#39;s&quot;.<br/>\n&gt;<br/>\n&gt; So do you think I should even bother to try to explain anything to<br/>\n&gt; anyone?<br/>\n&gt; Should I even show up?<br/>\n&gt; Should I stop thinking about all of this and let what happens,<br/>\n&gt; happen?<br/>\n&gt; I haven&#39;t felt this unsure about anything since I started thinking<br/>\n&gt; about homeschooling 8 years ago.<br/>\n&gt; Joanna<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":59432230,"authorName":"Joanna Wilkinson","from":"&quot;Joanna Wilkinson&quot; &lt;Wilkinson6@...&gt;","profile":"joanna514","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Back to school woes","postDate":"1094824816","msgId":20655,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNoc2MxZytvYzZhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDc5LjMzNTg5MWQzLjJlNzFlNTdkQGFvbC5jb20+"},"prevInTopic":20653,"nextInTopic":20658,"prevInTime":20654,"nextInTime":20656,"topicId":20551,"numMessagesInTopic":0,"msgSnippet":"... recognize ... math in their ... This is what s happening with Carly. Math seems to be her only real hurdle.  The notations are completely foreign to her.","messageBody":"<div id=\"ygrps-yiv-1276502343\"><blockquote><span title=\"ireply\">&gt; Or they&#39;re seeing unschoolers who don&#39;t know the lingo, or don&#39;t <br/>\n </span></blockquote>recognize <br/>\n<blockquote><span title=\"ireply\"> &gt; mathematical notation even though they can do some pretty fancy <br/>\n </span></blockquote>math in their <br/>\n<blockquote><span title=\"ireply\"> &gt; heads.<br/>\n&gt; <br/>\n<br/>\n<br/>\n </span></blockquote>This is what&#39;s happening with Carly.<br/>\nMath seems to be her only real hurdle.  The notations are completely <br/>\nforeign to her.  But as soon as it&#39;s explained, she is grasping the <br/>\nconcepts.  Yesterday at the beginning of her math class, the teacher <br/>\ncalled her and 5 other kids and told them they were not in the right <br/>\nclass because they hadn&#39;t taken the Algebra I placement test.<br/>\nShe was sent to another class where, she said, they do most of their <br/>\nwork on computers.  Today she has to take an assessment test.  So, <br/>\nlast night I googled a pre algebra online test.  She took it and <br/>\nonly got 3 right.  I took it and was pretty clueless myself.  I <br/>\ncouldn&#39;t remember a lot of things, and I passed college algebra.<br/>\nI&#39;m not going to look very good in the eyes of this teacher on <br/>\nparent/teacher night.  In her other classes she seems to be doing <br/>\nwell.  She particiapates in the class discussion and I know anyone <br/>\nwho talks to her realizes she is intelligent.  The math teacher will <br/>\nprobably realize this too.  But I&#39;ll look like I didn&#39;t do my job <br/>\nhere at home.  <br/>\nI&#39;m thinking of exuses of why she isn&#39;t up to par on math, that sort <br/>\nof explain unschooling , but also make it seem like we were going to <br/>\nget to it eventually.  Like, I&#39;m thinking of lying and saying I was <br/>\nplanning on getting a tutor for her this year, because when I tried <br/>\nto teach her math, she always balked, and having to be held <br/>\naccountable by someone other than me seems to get her rolling.<br/>\nI&#39;ll also explain that I wasn&#39;t planning on her ever going to high <br/>\nschool, but she sprung it on me this summer and though I told her <br/>\nshe wasn&#39;t prepared for a highschool math class, she decided to go <br/>\nfor it anyway.  That part is true.<br/>\nI&#39;ll also talk up her intelligence and make it seem that, with a <br/>\nlittle extra help, I think she really can handle it.<br/>\n<br/>\nLike I said, I&#39;m still kinda freaking out here.  My mom has been <br/>\ntotally awesome.  She keeps saying things like, &quot;She&#39;ll figure it <br/>\nout&quot;, &quot;who cares if she doesn&#39;t do well, she&#39;s there to have fun&quot;<br/>\nWe both consider ourself bad at math, and were laughing yesterday <br/>\nabout how we got through our highschool algebra by cheating a lot.<br/>\nI didn&#39;t actually understand algebra til I got to college and really <br/>\ntried hard.  Yet I made it through 2 years of high school algebra <br/>\nwith &quot;C&#39;s&quot;.<br/>\n<br/>\nSo do you think I should even bother to try to explain anything to <br/>\nanyone?<br/>\nShould I even show up?<br/>\nShould I stop thinking about all of this and let what happens, <br/>\nhappen?<br/>\nI haven&#39;t felt this unsure about anything since I started thinking <br/>\nabout homeschooling 8 years ago.<br/>\nJoanna</div>","specialLinks":[]},{"userId":160772665,"authorName":"Gold Standard","from":"&quot;Gold Standard&quot; &lt;contact@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [AlwaysLearning] Re: Back to school woes","postDate":"1094786626","msgId":20653,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFBLRUhKR0NJR05QUEFCRlBCS0xHT0VBQkNKQUEuY29udGFjdEBib2FyZHByZXAubmV0Pg==","inReplyToHeader":"PGNocTdvcytkM29uQGVHcm91cHMuY29tPg=="},"prevInTopic":20650,"nextInTopic":20655,"prevInTime":20652,"nextInTime":20654,"topicId":20551,"numMessagesInTopic":0,"msgSnippet":"I just had to report that at dinner tonight, my high schooler Max said, I m thinking about unschooling again. I just want to do some stuff that I don t have","messageBody":"<div id=\"ygrps-yiv-785652393\">I just had to report that at dinner tonight, my high schooler Max said, &quot;I&#39;m<br/>\nthinking about unschooling again. I just want to do some stuff that I don&#39;t<br/>\nhave time for with school.&quot;<br/>\n<br/>\nWoohoo!<br/>\n<br/>\nHe&#39;s still thinking though<br/>\n:)<br/>\nJacki</div>","specialLinks":[]},{"userId":120206043,"authorName":"averyschmidt","from":"&quot;averyschmidt&quot; &lt;patti.schmidt2@...&gt;","profile":"averyschmidt","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Back to school woes","postDate":"1094754908","msgId":20650,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNocTdvcytkM29uQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDg0LjMzMjY0YjdlLjJlNzFlZjYyQGFvbC5jb20+"},"prevInTopic":20649,"nextInTopic":20653,"prevInTime":20649,"nextInTime":20651,"topicId":20551,"numMessagesInTopic":0,"msgSnippet":"... 10, 11, ... curve, or ... impressive, but ... I m in the thick of this right now. There s even an obvious absence of homeschoolers of that age in my ","messageBody":"<div id=\"ygrps-yiv-839992368\"><blockquote><span title=\"ireply\">&gt; I think there&#39;s a flatline in the curve for unschooled kids around <br/>\n </span></blockquote>10, 11, <br/>\n<blockquote><span title=\"ireply\"> &gt; 12.  That is, I mean, if their curve is compared to school&#39;s ideal <br/>\n </span></blockquote>curve, or <br/>\n<blockquote><span title=\"ireply\"> &gt; even to the jump in what kids at school do at those ages.    <br/>\n&gt; Young unschoolers are impressive, and older unschoolers are <br/>\n </span></blockquote>impressive, but <br/>\n<blockquote><span title=\"ireply\"> &gt; sometimes in the middle they don&#39;t compare as well.<br/>\n<br/>\n </span></blockquote>I&#39;m in the thick of this right now.  <br/>\nThere&#39;s even an obvious absence of homeschoolers of that age in my <br/>\ncommunity- perhaps because the pressure is so great at that age for <br/>\nthe reasons you&#39;ve said?<br/>\nThere are lots of little homeschooled kids whose mothers are <br/>\nenthusiastically going where attachment parenting has taken them.  <br/>\nThere are also lots of homeschooled teens who were formally schooled <br/>\nbut left because of problems or school burn-out.  Not much in the <br/>\nmiddle, except for my kids and a very few spread out others.<br/>\nSo all of their friends are schooled at the moment, and it&#39;s an <br/>\neffort on my part to diffuse the inevitable comparisons that on the <br/>\nsurface would look like homeschooling failure to a school-think <br/>\nperson.<br/>\n<br/>\nPatti</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Back to school woes","postDate":"1094751586","msgId":20649,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg0LjMzMjY0YjdlLjJlNzFlZjYyQGFvbC5jb20+"},"prevInTopic":20648,"nextInTopic":20650,"prevInTime":20648,"nextInTime":20650,"topicId":20551,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/9/04 11:12:50 AM, ecsamhill@earthlink.net writes: ","messageBody":"<div id=\"ygrps-yiv-1195429664\">In a message dated 9/9/04 11:12:50 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ecsamhill@...\">ecsamhill@...</a> writes:<br/>\n<br/>\n&lt;&lt; I&#39;ve heard quite a bit of anecdotal evidence that college professors see <br/>\nhomeschoolers favorably and really enjoy their unsullied enthusiasm for <br/>\nlearning. &gt;&gt;<br/>\n<br/>\nI think there&#39;s a flatline in the curve for unschooled kids around 10, 11, <br/>\n12.  That is, I mean, if their curve is compared to school&#39;s ideal curve, or <br/>\neven to the jump in what kids at school do at those ages.   <br/>\n<br/>\nYoung unschoolers are impressive, and older unschoolers are impressive, but <br/>\nsometimes in the middle they don&#39;t compare as well.  I think because they&#39;re <br/>\nstill playing happily, and school is in those days putting the press on for <br/>\ncursive writing, long division, multiplication of fractions, band starts for those <br/>\nlearning instruments, sports...<br/>\n<br/>\nSo about the time the unschoolers stretch and yawn, hit puberty and take <br/>\ntheir merry selves out into the world to do cool things, the kids at school are <br/>\nFED UP, and their puberty happens in a less safe place, and some of them decide <br/>\nthey&#39;ve learned about enough about how not to learn, and some of them stop <br/>\nlearning in any noticeable way after they&#39;re 14 or so. <br/>\n<br/>\nThere will be badillion exceptions but a bunch of matches, too.<br/>\n<br/>\nI learned TONS at 14 and 15, but mostly music-related things and mostly not <br/>\nat school.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":2300774,"authorName":"Elizabeth Hill","from":"Elizabeth Hill &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Back to school woes","postDate":"1094750010","msgId":20648,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxNDA4RjNBLjQwNTA4MDNAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PDAxYzcwMWM0OTY4OSQ5NGNlZTcxMCQ2NDAxYThjMEBob21lPg==","referencesHeader":"PGZiLjYwOTQ3ZjE5LjJlNzE5NWExQGFvbC5jb20+IDwwMWM3MDFjNDk2ODkkOTRjZWU3MTAkNjQwMWE4YzBAaG9tZT4="},"prevInTopic":20647,"nextInTopic":20649,"prevInTime":20647,"nextInTime":20649,"topicId":20551,"numMessagesInTopic":0,"msgSnippet":"** I also worried how her perceived performance would reflect on homeschooling.  I know a few teachers and have heard them talk about homeschoolers returning","messageBody":"<div id=\"ygrps-yiv-839073543\">**<br/>\n<br/>\nI also worried how her perceived performance would reflect on homeschooling.  I know a few teachers and have heard them talk about homeschoolers returning to school.  It is rare that they paint a pretty picture.**<br/>\n<br/>\n(sent the last post too soon)<br/>\n<br/>\nI&#39;ve heard quite a bit of anecdotal evidence that college professors see homeschoolers favorably and really enjoy their unsullied enthusiasm for learning.<br/>\n<br/>\nBetsy</div>","specialLinks":[]},{"userId":2300774,"authorName":"Elizabeth Hill","from":"Elizabeth Hill &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Back to school woes","postDate":"1094749946","msgId":20647,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxNDA4RUZBLjQwMTAwMDFAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PDAxYzcwMWM0OTY4OSQ5NGNlZTcxMCQ2NDAxYThjMEBob21lPg==","referencesHeader":"PGZiLjYwOTQ3ZjE5LjJlNzE5NWExQGFvbC5jb20+IDwwMWM3MDFjNDk2ODkkOTRjZWU3MTAkNjQwMWE4YzBAaG9tZT4="},"prevInTopic":20646,"nextInTopic":20648,"prevInTime":20646,"nextInTime":20648,"topicId":20551,"numMessagesInTopic":0,"msgSnippet":"** I also worried how her perceived performance would reflect on homeschooling.  I know a few teachers and have heard them talk about homeschoolers returning","messageBody":"<div id=\"ygrps-yiv-630898567\">**<br/>\n<br/>\nI also worried how her perceived performance would reflect on homeschooling.  I know a few teachers and have heard them talk about homeschoolers returning to school.  It is rare that they paint a pretty picture. **<br/>\n<br/>\nWhen I hear teacher&#39;s quoted talking about underprepared homeschooled kids, I notice a high level of consistency in what they say.  (Like repeating a party line slogan.)  It&#39;s so high that I think they are just repeating one or two of the same stories that have been talked up in faculty meetings and spread around like urban legends.<br/>\n<br/>\nDid the stories you heard appear to be about specific local kids that the teacher&#39;s had personally taught, or was it fuzzier stuff?<br/>\n<br/>\nBetsy</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Back to school woes","postDate":"1094749053","msgId":20646,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc5LjMzNTg5MWQzLjJlNzFlNTdkQGFvbC5jb20+"},"prevInTopic":20645,"nextInTopic":20647,"prevInTime":20645,"nextInTime":20647,"topicId":20551,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/9/04 10:28:16 AM, nellebelle@charter.net writes: ","messageBody":"<div id=\"ygrps-yiv-542076319\">In a message dated 9/9/04 10:28:16 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:nellebelle@...\">nellebelle@...</a> writes:<br/>\n<br/>\n&lt;&lt;  Kids who don&#39;t care about grades are looked down on by classmates and <br/>\nteachers.  They are thought of as lazy or dumb or unmotivated.  &gt;&gt;<br/>\n<br/>\nNot by all of them.   If the kid is otherwise sharp and interesting there are <br/>\nsome teachers and lots of kids who will understand a lack  grade-focus.<br/>\n<br/>\n-=-I know a few teachers and have heard the<br/>\nZm talk about homeschoolers returning to school.  It is rare that they paint <br/>\na pretty picture.  Of course, they are usually seeing those families for whom <br/>\nhomeschooling didn&#39;t work out and that is why they are going back to school. <br/>\n-=-<br/>\n<br/>\nOr they&#39;re seeing unschoolers who don&#39;t know the lingo, or don&#39;t recognize <br/>\nmathematical notation even though they can do some pretty fancy math in their <br/>\nheads.<br/>\n<br/>\n-=-The number of unschooled children who hang out at school just to enjoy the <br/>\nbits and pieces they like while not giving a hoot about playing the game is <br/>\nprobably very, very, very small.-=-<br/>\n<br/>\nUndoubtedly very small. <br/>\nMy nephew did, and he ended up in trouble at school a few times.  He was <br/>\ninciting dangerous laziness in others.  That wasn&#39;t ideal.  He knew he could go <br/>\nhome when he was unhappy, but he wasn&#39;t fully realizing that other kids had <br/>\nworse consequences waiting at home.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":109856460,"authorName":"nellebelle","from":"&quot;nellebelle&quot; &lt;nellebelle@...&gt;","profile":"lamaribelle","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Back to school woes","postDate":"1094747001","msgId":20645,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxYzcwMWM0OTY4OSQ5NGNlZTcxMCQ2NDAxYThjMEBob21lPg==","referencesHeader":"PGZiLjYwOTQ3ZjE5LjJlNzE5NWExQGFvbC5jb20+"},"prevInTopic":20644,"nextInTopic":20646,"prevInTime":20644,"nextInTime":20646,"topicId":20551,"numMessagesInTopic":0,"msgSnippet":"... care about  grades.  She would just take what she wanted out of the experience. That was my intention.  I didn t really think through how important the","messageBody":"<div id=\"ygrps-yiv-1375098611\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;Paige could go to school, and neither of us would <br/>\n </span></blockquote>care about  grades.  She would just take what she wanted out of the experience.&gt;&gt;&gt;&gt; <br/>\n<br/>\nThat was my intention.  I didn&#39;t really think through how important the system and the grades are to everyone else.<br/>\n<br/>\nMost people, especially those who buy into the importance of school, cannot understand kids and parents who don&#39;t care about grades.  Kids who don&#39;t care about grades are looked down on by classmates and teachers.  They are thought of as lazy or dumb or unmotivated.  On this list we understand that school is like a game and grades absolutely do not reflect a child&#39;s intelligence.  That isn&#39;t the case in the school world.<br/>\n<br/>\nI also worried how her perceived performance would reflect on homeschooling.  I know a few teachers and have heard them talk about homeschoolers returning to school.  It is rare that they paint a pretty picture.  Of course, they are usually seeing those families for whom homeschooling didn&#39;t work out and that is why they are going back to school.  I do know families locally whose homeschooled children go to school part time for particular classes, but those kids are usually playing really hard at the school game while they are there, so they generally give a *good impression* of homeschooling.<br/>\n<br/>\nThe number of unschooled children who hang out at school just to enjoy the bits and pieces they like while not giving a hoot about playing the game is probably very, very, very small.<br/>\n<br/>\nMaybe I shouldn&#39;t care about what others think, but I do.  When I interact with others while representing my family as homeschoolers, I want them to at least think we are reasonable people and that my kids are doing fine with this choice.  I certainly don&#39;t have time to explain to everyone at the school why and how we live our lives as we do.  But the fact is that they will form opinions of homeschoolers and homeschooling based on their interaction with those children who come into school from homeschooling.<br/>\n<br/>\nOne other thing - Lisa&#39;s school experience has given me the opportunity to explore how far I am willing to go to support her making choices that I&#39;m not happy with.<br/>\n<br/>\nMary Ellen<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Back to school woes","postDate":"1094732953","msgId":20644,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFhZC4yODdlMTk2Zi4yZTcxYTY5OUBhb2wuY29tPg=="},"prevInTopic":20643,"nextInTopic":20645,"prevInTime":20643,"nextInTime":20645,"topicId":20551,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/9/04 5:20:08 AM, ivorygrace7@aol.com writes: ","messageBody":"<div id=\"ygrps-yiv-126880795\">In a message dated 9/9/04 5:20:08 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ivorygrace7@...\">ivorygrace7@...</a> writes:<br/>\n<br/>\n&lt;&lt; I was  able to show Emily that the problem was that we had taken <br/>\neverything so  seriously.  Paige could go to school, and neither of us would <br/>\ncare about  grades.  She would just take what she wanted out of the <br/>\nexperience.  <br/>\n And leave when she was done.  Emily agreed that with that attitude it just  <br/>\nmight work. &gt;&gt;<br/>\n<br/>\nPlease be careful to let them know throughout that bad grades won&#39;t mean <br/>\nanything other than &quot;didn&#39;t play the game right,&quot; in such a case.   Maybe even <br/>\nplaying a game with them purposely to lose could help enforce that point.   <br/>\nSometimes we&#39;ve messed with the WORST moves possible in a game.  It&#39;s as telling as <br/>\nthe best moves.   All part of the same analysis.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":96545052,"authorName":"marji","from":"marji &lt;marji@...&gt;","profile":"gaia10921","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Back to school woes","postDate":"1094729097","msgId":20643,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYuMC4zLjAuMC4yMDA0MDkwOTA3MTkwNS4wMjg3NmQ0MEBtYWlsLmdhaWF3b2xmLm9yZz4=","inReplyToHeader":"PGZiLjYwOTQ3ZjE5LjJlNzE5NWExQGFvbC5jb20+","referencesHeader":"PGZiLjYwOTQ3ZjE5LjJlNzE5NWExQGFvbC5jb20+"},"prevInTopic":20642,"nextInTopic":20644,"prevInTime":20642,"nextInTime":20644,"topicId":20551,"numMessagesInTopic":0,"msgSnippet":"... I just want to pipe up and say that I have such tremendous admiration for moms (and dads and sisters and brothers) who support an unschooler trying out","messageBody":"<div id=\"ygrps-yiv-450143797\">At 07:16 9/9/04, you wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;Recently her sister, who will be  7th grade age next year, has said that she<br/>\n&gt;would like to attend next year to see  what it is like.  Emily was there when<br/>\n&gt;she said it, and she freaked  out!  She said, &quot;You can&#39;t let her go!  It will<br/>\n&gt;take so much time, and  it will be stressful and bad for her.&quot;  But then we<br/>\n&gt;discussed it and  using ideas that I had learned from various online <br/>\n&gt;unschooling<br/>\n&gt;resources, I was  able to show Emily that the problem was that we had taken<br/>\n&gt;everything so  seriously.  Paige could go to school, and neither of us would<br/>\n&gt;care about  grades.  She would just take what she wanted out of the <br/>\n&gt;experience.<br/>\n&gt;  And leave when she was done.  Emily agreed that with that attitude it just<br/>\n&gt;might work.<br/>\n<br/>\n </span></blockquote>I just want to pipe up and say that I have such tremendous admiration for <br/>\nmoms (and dads and sisters and brothers) who support an unschooler trying <br/>\nout school.  I think it really takes a lot to get one&#39;s self out of the way <br/>\nand be present for his or her kids in a truly supportive way, even when <br/>\nthat kid makes a choice that one would otherwise bristle at.<br/>\n<br/>\nMarji, getting her nose back to the grindstone.</div>","specialLinks":[]},{"userId":59432230,"authorName":"Joanna Wilkinson","from":"&quot;Joanna Wilkinson&quot; &lt;Wilkinson6@...&gt;","profile":"joanna514","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Back to school woes","postDate":"1094728778","msgId":20642,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNocGU4YStxM2drQGVHcm91cHMuY29tPg==","inReplyToHeader":"PFBLRUhKR0NJR05QUEFCRlBCS0xHSUVQR0NJQUEuY29udGFjdEBib2FyZHByZXAubmV0Pg=="},"prevInTopic":20641,"nextInTopic":20643,"prevInTime":20641,"nextInTime":20643,"topicId":20551,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1432948490\">&lt;&lt;Then he said, &quot;Could you write<br/>\nthat?&quot; And I happily said, &quot;Sure!&quot; (I love to write, maybe you&#39;ve <br/>\nnoticed)<br/>\nand I added a piece to the report. In the morning he read it and gave<br/>\napproval. I&#39;m sure this probably broke rules left and right, both at <br/>\nthe<br/>\nschool and maybe even in unschooling philosophy, but I enjoyed doing <br/>\nit, saw<br/>\nhow tired my guy was, and it just seemed like the right thing in the <br/>\nmoment.&gt;&gt;<br/>\n<br/>\nSeems like the right thing to me too.<br/>\n<br/>\nI reread the article Sandra.  Thanks, it helped.<br/>\nShe&#39;s off to school for another day.  I need to relax and have fun <br/>\nwith Jack and Jamie today.  No more stressing!<br/>\nJoanna</div>","specialLinks":[]},{"userId":163132749,"authorName":"ivorygrace7@aol.com","from":"ivorygrace7@...","profile":"ivorygrace7","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Back to school woes","postDate":"1094728609","msgId":20641,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZiLjYwOTQ3ZjE5LjJlNzE5NWExQGFvbC5jb20+"},"prevInTopic":20640,"nextInTopic":20642,"prevInTime":20640,"nextInTime":20642,"topicId":20551,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/8/2004 8:53:58 PM Eastern Standard Time, Wilkinson6@msn.com writes: ","messageBody":"<div id=\"ygrps-yiv-1375530328\">In a message dated 9/8/2004 8:53:58 PM Eastern Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Wilkinson6@...\">Wilkinson6@...</a> writes:<br/>\n<br/>\n&lt;&lt;Poor Carly (and me now) are taking this all way too  seriously.<br/>\nBut I find myself worried to death that she is in over her  head.<br/>\nThat I will be looked at as a negligent  mother.&gt;&gt;<br/>\n <br/>\n <br/>\nMy oldest daughter attended 7th  grade at a large public school.  She only <br/>\nwent for one year, and one of the  deciding factors in not going back was that <br/>\nit took so much out of school time  and in many ways controlled the whole <br/>\nfamily.  But we were very serious  about it.  Emily wanted to have the top grades <br/>\nin the class and participate  in every activity.  And I helped her with <br/>\neverything including 2 hours  of homework every night.<br/>\n <br/>\nRecently her sister, who will be  7th grade age next year, has said that she <br/>\nwould like to attend next year to see  what it is like.  Emily was there when <br/>\nshe said it, and she freaked  out!  She said, &quot;You can&#39;t let her go!  It will <br/>\ntake so much time, and  it will be stressful and bad for her.&quot;  But then we <br/>\ndiscussed it and  using ideas that I had learned from various online unschooling <br/>\nresources, I was  able to show Emily that the problem was that we had taken <br/>\neverything so  seriously.  Paige could go to school, and neither of us would <br/>\ncare about  grades.  She would just take what she wanted out of the experience.  <br/>\n And leave when she was done.  Emily agreed that with that attitude it just  <br/>\nmight work.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"Sandra Dodd","from":"&quot;Sandra Dodd &quot; &lt;SandraDodd@...&gt;","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Back to school woes","postDate":"1094728174","msgId":20640,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNocGRsZSt0dGFoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PFBLRUhKR0NJR05QUEFCRlBCS0xHSUVQR0NJQUEuY29udGFjdEBib2FyZHByZXAubmV0Pg=="},"prevInTopic":20639,"nextInTopic":20641,"prevInTime":20639,"nextInTime":20641,"topicId":20551,"numMessagesInTopic":0,"msgSnippet":"-=-Many schools/teachers as a matter of principle expect the parents and families to plan around their agendas. It is SO arrogant!-=- I think all of them do. ","messageBody":"<div id=\"ygrps-yiv-2039254108\">-=-Many schools/teachers as a matter of principle expect the parents and<br/>\nfamilies to plan around their agendas. It is SO arrogant!-=-<br/>\n<br/>\nI think all of them do.<br/>\n<br/>\nFor starters, they tell you where to be and what you can be wearing, what you <br/>\ncan and cannot have with you, what you MUST have with you.<br/>\n<br/>\nThey say &quot;bring $5&quot; or &quot;bring $30&quot; or &quot;your parents have to sign this&quot; or &quot;your <br/>\nparents have to be here for a meeting with the counsellor/principal.&quot;<br/>\n<br/>\nOne year I had two of my teachers say in the same week or so, &quot;Nothing is as <br/>\nimportant in your life as my class.&quot;  Huh.  Maybe those should&#39;ve arm wrestled <br/>\nfor supremacy in my life.   And what about the other four classes?  And when <br/>\ndid I get some life?<br/>\n<br/>\n-=-I think the parents who do the above-mentioned activities do help their<br/>\nchild(ren) get better grades. I saw it a lot as a teacher. -=-<br/>\n<br/>\nSome parents work hard to help with homework and neither the child nor the <br/>\nparent understands it because the homework was crazy, so they spend a <br/>\ncouple of hours frustrated and maybe in tears, and the kid still doesn&#39;t get a <br/>\ngood grade.<br/>\n<br/>\nI&#39;m glad to have spared Kirby all that, but as he never experienced it, he can&#39;t <br/>\nappreciate the benefit.   Ironic.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":160772665,"authorName":"Gold Standard","from":"&quot;Gold Standard&quot; &lt;contact@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [AlwaysLearning] Back to school woes","postDate":"1094707436","msgId":20639,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFBLRUhKR0NJR05QUEFCRlBCS0xHSUVQR0NJQUEuY29udGFjdEBib2FyZHByZXAubmV0Pg==","inReplyToHeader":"PDAxNTQwMWM0OTYxZCRhODZmNzAzMCQ2NDAxYThjMEBob21lPg=="},"prevInTopic":20638,"nextInTopic":20640,"prevInTime":20638,"nextInTime":20640,"topicId":20551,"numMessagesInTopic":0,"msgSnippet":"... all the stuff that goes with school, grades especially.  But when I called the attendance office the third day in a row to say that she didn t feel well,","messageBody":"<div id=\"ygrps-yiv-1739866344\"><blockquote><span title=\"ireply\">&gt;&gt; I had thought it would be easy to disassociate myself from caring about<br/>\n </span></blockquote>all the stuff that goes with school, grades especially.  But when I called<br/>\nthe attendance office the third day in a row to say that she didn&#39;t feel<br/>\nwell, and they said I better come pick up her homework so she didn&#39;t fall<br/>\nbehind, I realized how hard it would be to come up with plausible excuses if<br/>\nshe only attended once per week or so.&lt;&lt;<br/>\n<br/>\nMy 15 year old Andrew who desperately wanted to go to a local art charter<br/>\nhigh school, but who unfortunately has had set backs in his life due to<br/>\nhaving open-heart surgery in June, and who is &quot;high-functioning autistic&quot;<br/>\n(just using the label for shorter writing), has called in sick for all but<br/>\none of the 17 days in session. Even without all that he has been through,<br/>\nthe start of the year may have been the same. He has finally decided to<br/>\nunschool again. He&#39;s going to take a couple of the art classes as a<br/>\nhomeschooler. I am thrilled, but it has been difficult for him to both<br/>\ndecide, and feel good about. He does feel like he &quot;just wasn&#39;t smart enough&quot;<br/>\nto do it, which is far far from the truth. I told him that it is a nutty<br/>\nsystem to work within, and I point out the things that freedom brings him at<br/>\nhome, and I make sure we have fun every day for at least some of the time<br/>\n(there appears to be only so much fun this 15 year old will have with his<br/>\nmom :)). In any case, having to deal with the negative effects of ps when he<br/>\ndoesn&#39;t even go makes me a little nuts. But that is reality. His brother Max<br/>\nIS going to this school, and enjoying it within limits (he is totally not<br/>\nbuying into the importance of much of the work given, and though he does his<br/>\nhomework, he says he does it &quot;to appease the teacher...I&#39;m not getting much<br/>\nout of it&quot;).<br/>\n<br/>\nOne interesting thing I&#39;ve noticed is that Andrew (the unschooler) is<br/>\nsleeping in, writing his movie script, having snacks, doing computer stuff,<br/>\nloving the dogs and cats, doing chores, writing his movie script and at<br/>\ndinner time, is happy and relaxed. Max (high schooler) comes home cranky,<br/>\nheadachey, tired, and by dinner is complaining about stupid homework and<br/>\nbeing controlled. I am really interested to see where this goes. I think it<br/>\nmakes Andrew feel better about his decision.<br/>\n<br/>\nIs your daughter showing any distress about missing school? Maybe it will<br/>\njust dissipate into unschooling again. Will her school allow her to go part<br/>\ntime as a homeschooler? Or just take some classes?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;School is so intrusive!&lt;&lt;<br/>\n<br/>\n </span></blockquote>Many schools/teachers as a matter of principle expect the parents and<br/>\nfamilies to plan around their agendas. It is SO arrogant!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I found myself wondering what *good parents* (in the eyes of the school)<br/>\n </span></blockquote>are supposed to do.  Do we check her work so that it&#39;s all or mostly correct<br/>\nwhen she turns it in?  Do we just make sure she finished?&lt;&lt;<br/>\n<br/>\nI think the parents who do the above-mentioned activities do help their<br/>\nchild(ren) get better grades. I saw it a lot as a teacher. It really is a<br/>\nstupid system. Comedian Brian Reagan does an hysterical bit about how<br/>\nobvious it was which of his classmates in elementary school had parents<br/>\ndoing their projects. He compares the elaborate volcano complete with<br/>\nemoting smoke and real-looking lava with his own project, a cup of dirt. By<br/>\nthe time the teacher gets to him, he says, &quot;Just give me an F and move on<br/>\nalong...&quot;. I don&#39;t know how that comes off on email, but hearing him tell it<br/>\nis funny because of the truth of it.<br/>\n<br/>\nI think it comes back to what the goal is. Is it to help them get better<br/>\ngrades? To allow them to have these experiences and form opinions about<br/>\nthem? It can be hard to remember that  &quot;failing&quot; in a class is no reflection<br/>\non a child in real life. Last night Max had too much homework. One of his<br/>\nassignments was to write 300 words (I&#39;m sure that particular number somehow<br/>\nindicates his abilities) about a current event. He chose the Russian school<br/>\ninvasion and wrote a nice piece that ended up being 250 words. After<br/>\ncounting each word (I wonder if kids who go to ps can just eye the page to<br/>\nknow what is 300 words is. We sure couldn&#39;t!) he said, &quot;I am so tired. Do I<br/>\nreally have to figure out 50 more words to write?&quot; I said it was up to him.<br/>\nHe asked for some ideas, and I gave him some. Then he said, &quot;Could you write<br/>\nthat?&quot; And I happily said, &quot;Sure!&quot; (I love to write, maybe you&#39;ve noticed)<br/>\nand I added a piece to the report. In the morning he read it and gave<br/>\napproval. I&#39;m sure this probably broke rules left and right, both at the<br/>\nschool and maybe even in unschooling philosophy, but I enjoyed doing it, saw<br/>\nhow tired my guy was, and it just seemed like the right thing in the moment.<br/>\nHe rarely asks for my help, which is actually something I&#39;ve had to be very<br/>\naware of with him, and I jumped at the chance to help him. If it was algebra<br/>\nor Spanish however, I would have smiled and said, &quot;Sorry&quot;.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I was very worried that she would pick up on some of the negative aspects<br/>\n </span></blockquote>of schooling, even if she just went for a short time - things like learning<br/>\nto dislike a *subject*, for instance.&lt;&lt;<br/>\n<br/>\nThis is a sad consequence of ps. Maybe if we keep fun things going on at<br/>\nhome around &quot;disliked subjects&quot; it may counteract that.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I also made sure that her sister and I had lots of fun while she was at<br/>\n </span></blockquote>school.  I think that helped &lt;g&gt;&lt;&lt;<br/>\n<br/>\nI love this idea.<br/>\n<br/>\nJacki</div>","specialLinks":[]},{"userId":109856460,"authorName":"nellebelle","from":"&quot;nellebelle&quot; &lt;nellebelle@...&gt;","profile":"lamaribelle","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Back to school woes","postDate":"1094700700","msgId":20638,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxNTQwMWM0OTYxZCRhODZmNzAzMCQ2NDAxYThjMEBob21lPg==","referencesHeader":"PDEzZS45ZDUzZmIuMmU3MTE4OTlAYW9sLmNvbT4="},"prevInTopic":20637,"nextInTopic":20639,"prevInTime":20637,"nextInTime":20639,"topicId":20551,"numMessagesInTopic":0,"msgSnippet":"... I was going to suggest that too.  And Guerilla Learning by Grace Llewellyn and Amy Silver. My 11 yod wanted to check out middle school this year - 6th","messageBody":"<div id=\"ygrps-yiv-1198929025\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/schoolchoice\">http://sandradodd.com/schoolchoice</a>&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>I was going to suggest that too.  And Guerilla Learning by Grace Llewellyn and Amy Silver.<br/>\n<br/>\nMy 11 yod wanted to check out middle school this year - 6th grade.  She ended up going only two days (the first day and one day the second week of school), and even liked most of it, but I hated it!  Although she liked it, she really wasn&#39;t excited about going every day (note she chose to attend only 2 of the first 7 days).<br/>\n<br/>\nI had thought it would be easy to disassociate myself from caring about all the stuff that goes with school, grades especially.  But when I called the attendance office the third day in a row to say that she didn&#39;t feel well, and they said I better come pick up her homework so she didn&#39;t fall behind, I realized how hard it would be to come up with plausible excuses if she only attended once per week or so.<br/>\n<br/>\nSchool is so intrusive!  The first day she came home with a rule book that she was supposed to discuss with a parent and both of us sign saying we&#39;d discussed it.  Whose homework is this supposed to be?  Then there was the evening that she, her dad, and I sat around the table doing the math homework.  I thought it was fun (factors) but it wasn&#39;t my assignment.  And there were 80 of them.  80!  Like 20 or 40 wouldn&#39;t be enough?  I found myself wondering what *good parents* (in the eyes of the school) are supposed to do.  Do we check her work so that it&#39;s all or mostly correct when she turns it in?  Do we just make sure she finished?<br/>\n<br/>\nIn a way it&#39;s a disadvantage when these unschooled kids try school, because it can be a lot of fun, especially at first, and they are there by choice.<br/>\n<br/>\nI was very worried that she would pick up on some of the negative aspects of schooling, even if she just went for a short time - things like learning to dislike a *subject*, for instance.<br/>\n<br/>\nI had thoughts of telling her she couldn&#39;t go, but I didn&#39;t want her to be a forced homeschooler either.  So I decided that I need to work harder at meeting her needs and desires as a homeschooler.  A primary one for her right now is to spend more time with other young people.  Since her neighborhood friends are all in school all day, I&#39;m working very hard to both broaden our circle of unschooling and homeschooling friends and to spend more time with our very small group of sort of unschoolers or at least flexible homeschoolers.<br/>\n<br/>\nI also made sure that her sister and I had lots of fun while she was at school.  I think that helped &lt;g&gt;<br/>\n<br/>\nMary Ellen<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":196090915,"authorName":"J. Stauffer","from":"&quot;J. Stauffer&quot; &lt;jnjstau@...&gt;","profile":"jnjstau","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Back to school woes","postDate":"1094699104","msgId":20637,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMmYwMWM0OTYxOSRlMGMxNzRhMCQwMjAwYThjMEB5b3VybzBrd2t3OWp3Yz4=","referencesHeader":"PGNobzlmdityYmZrQGVHcm91cHMuY29tPg=="},"prevInTopic":20636,"nextInTopic":20638,"prevInTime":20636,"nextInTime":20638,"topicId":20551,"numMessagesInTopic":0,"msgSnippet":"... I m with you Joanne.  My youngest three decided to try ps this year.  It is not so bad since I told the Kindergarten teacher we wouldn t be doing the ","messageBody":"<div id=\"ygrps-yiv-598696934\">&lt;&lt;&lt;&lt;&lt;&lt;&lt;Oh, and if anyone is thinking I am regretting unschooling.<br/>\n<blockquote><span title=\"ireply\"> &gt; Absolutely not!<br/>\n&gt; I&#39;m just freaking out about having to deal with the school system.&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>I&#39;m with you Joanne.  My youngest three decided to try ps this year.  It is<br/>\nnot so bad since I told the Kindergarten teacher we wouldn&#39;t be doing the<br/>\nhomework she assigned because Dan didn&#39;t want to......and she said &quot;ok&quot;.<br/>\n<br/>\nBut it is very stressful.  Good luck.<br/>\n<br/>\nJulie S.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- <br/>\nFrom: &quot;Joanna Wilkinson&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Wilkinson6@...\">Wilkinson6@...</a>&gt;<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>&gt;<br/>\nSent: Wednesday, September 08, 2004 7:52 PM<br/>\nSubject: [AlwaysLearning] Back to school woes<br/>\n<br/>\n<br/>\n&gt; I&#39;m sitting here, still helping Carly with her homework, by helping<br/>\n&gt; her figure out sentences for the vocabulary words that were sent<br/>\n&gt; home.<br/>\n&gt; AHHHHH!  We just spent 2 hours doing the 24 algebra problems she had<br/>\n&gt; to complete.<br/>\n&gt; I guess we are making up for the last 7 years we have been<br/>\n&gt; unschooling.  I can&#39;t imagine what my life would have been like all<br/>\n&gt; these years if I had sent all of my kids to school.<br/>\n&gt; How much would they care about this stuff now.  How much would I<br/>\n&gt; care if they got thier homework done, if we had been doing this all<br/>\n&gt; along?<br/>\n&gt; I know I shim shammed my way through high school because by the time<br/>\n&gt; I got there, I had figured out how to.<br/>\n&gt; Poor Carly (and me now) are taking this all way too seriously.<br/>\n&gt; But I find myself worried to death that she is in over her head.<br/>\n&gt; That I will be looked at as a negligent mother.<br/>\n&gt; Damn, I should have come to the conference this year!<br/>\n&gt; This is only day 2!<br/>\n&gt; She was lost for a while in algebra today but as she relaxed,<br/>\n&gt; started to get it.<br/>\n&gt; All these years, whenever I would try to explain a math concept to<br/>\n&gt; her (something like long division) she would get frustrated and say<br/>\n&gt; it was stupid.  Tonight, helping her with these algebra concepts, it<br/>\n&gt; blew me away how she got things.  I guess the drive to succeed is in<br/>\n&gt; her.<br/>\n&gt; She did say on the way home today, &quot;how do people do this day in and<br/>\n&gt; day out?&quot;  She said, with week long classes or camps, she has fun,<br/>\n&gt; but is always ready for them to be over by the end and the thought<br/>\n&gt; of 9 months is incomprehensible.  But, she is determined to stick it<br/>\n&gt; out for a while.  She wants to atleast go to the Homecoming dance.<br/>\n&gt; Socially, she is having no problems.  She knows a lot of kids<br/>\n&gt; through her acting in the childrens theater and then playing<br/>\n&gt; softball this year and her cousin whose been in school all along and<br/>\n&gt; lots of other things she has done over the years.  The kids are<br/>\n&gt; being really cool to her.  She has girls to sit with at lunch, kids<br/>\n&gt; to hang with in the morning, and even knows quite a few seniors from<br/>\n&gt; her summer job at Frontier Town (western theme park).<br/>\n&gt; That&#39;s what she is there for.  Fun.<br/>\n&gt; She is finding out, it&#39;s not all that, but at the same time, it is.<br/>\n&gt; This is going to be very interesting.<br/>\n&gt; I need to step back emotionally, but be there for her for her needs.<br/>\n&gt; It&#39;s hard finding a balance.<br/>\n&gt; I have Jack and Jamie here.  We&#39;re still unschoolers and we don&#39;t<br/>\n&gt; need this running our lives.<br/>\n&gt; I&#39;m sorry I kinda dropped off this list for a while.<br/>\n&gt; I&#39;m really sorry I missed the conference.  I don&#39;t even want to hear<br/>\n&gt; how absolutely cool it was.<br/>\n&gt; Thanks to everyone who was so great to us at last years conference.<br/>\n&gt; I wanted so much to be there this year, but Bob had a wedding to<br/>\n&gt; play and with Carly going to school, I lost focus on what was really<br/>\n&gt; important for us.<br/>\n&gt; I think I need help finding my focus again!<br/>\n&gt; I&#39;m feeling like I should be preparing Jack and Jamie for the &quot;just<br/>\n&gt; in case&quot;, but also know I need to wait and see how Carly handles all<br/>\n&gt; of this.  Through it all I keep saying to myself the ol&#39; unschooling<br/>\n&gt; mantra, &quot;Trust her&quot;.  She is so absolutley brilliant, she&#39;ll fingure<br/>\n&gt; out what she needs and how to get it.  I just have to not screw it<br/>\n&gt; up with my anxieties.<br/>\n&gt; Okay, this is my first vent of this school year.<br/>\n&gt; Joanna<br/>\n&gt;<br/>\n&gt; Oh, funny story.  During Freshman orientation, the teachers were<br/>\n&gt; telling the kids what they needed for supplies.  Carly&#39;s English<br/>\n&gt; teacher was very specific about the size of the binder they needed<br/>\n&gt; for his class.<br/>\n&gt; Carly came home that day and asked, &quot;Mom, what&#39;s a binder?&quot;<br/>\n&gt; She was totally clueless!<br/>\n&gt; I can&#39;t wait for parent/teacher night.<br/>\n&gt;<br/>\n&gt; Oh, and if anyone is thinking I am regretting unschooling.<br/>\n&gt; Absolutely not!<br/>\n&gt; I&#39;m just freaking out about having to deal with the school system.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Back to school woes","postDate":"1094696601","msgId":20636,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzZS45ZDUzZmIuMmU3MTE4OTlAYW9sLmNvbT4="},"prevInTopic":20635,"nextInTopic":20637,"prevInTime":20635,"nextInTime":20637,"topicId":20551,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/8/04 6:53:59 PM, Wilkinson6@msn.com writes: ","messageBody":"<div id=\"ygrps-yiv-1289145790\">In a message dated 9/8/04 6:53:59 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Wilkinson6@...\">Wilkinson6@...</a> writes:<br/>\n<br/>\n&lt;&lt; I&#39;m really sorry I missed the conference.  I don&#39;t even want to hear <br/>\n<br/>\nhow absolutely cool it was. &gt;&gt;<br/>\n<br/>\nI wish your family had been there.<br/>\n<br/>\nMaybe you&#39;ve seen this, and maybe it will help a little:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/schoolchoice\">http://sandradodd.com/schoolchoice</a><br/>\n<br/>\n(And if it doesn&#39;t help, I hope it won&#39;t hurt any.)<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":59432230,"authorName":"Joanna Wilkinson","from":"&quot;Joanna Wilkinson&quot; &lt;Wilkinson6@...&gt;","profile":"joanna514","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Back to school woes","postDate":"1094691135","msgId":20635,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNobzlmdityYmZrQGVHcm91cHMuY29tPg=="},"prevInTopic":20551,"nextInTopic":20636,"prevInTime":20634,"nextInTime":20636,"topicId":20551,"numMessagesInTopic":0,"msgSnippet":"I m sitting here, still helping Carly with her homework, by helping her figure out sentences for the vocabulary words that were sent home. AHHHHH!  We just","messageBody":"<div id=\"ygrps-yiv-730341390\">I&#39;m sitting here, still helping Carly with her homework, by helping <br/>\nher figure out sentences for the vocabulary words that were sent <br/>\nhome. <br/>\nAHHHHH!  We just spent 2 hours doing the 24 algebra problems she had <br/>\nto complete.<br/>\nI guess we are making up for the last 7 years we have been <br/>\nunschooling.  I can&#39;t imagine what my life would have been like all <br/>\nthese years if I had sent all of my kids to school.<br/>\nHow much would they care about this stuff now.  How much would I <br/>\ncare if they got thier homework done, if we had been doing this all <br/>\nalong?<br/>\nI know I shim shammed my way through high school because by the time <br/>\nI got there, I had figured out how to.  <br/>\nPoor Carly (and me now) are taking this all way too seriously.<br/>\nBut I find myself worried to death that she is in over her head.<br/>\nThat I will be looked at as a negligent mother.<br/>\nDamn, I should have come to the conference this year!<br/>\nThis is only day 2!<br/>\nShe was lost for a while in algebra today but as she relaxed, <br/>\nstarted to get it.<br/>\nAll these years, whenever I would try to explain a math concept to <br/>\nher (something like long division) she would get frustrated and say <br/>\nit was stupid.  Tonight, helping her with these algebra concepts, it <br/>\nblew me away how she got things.  I guess the drive to succeed is in <br/>\nher.<br/>\nShe did say on the way home today, &quot;how do people do this day in and <br/>\nday out?&quot;  She said, with week long classes or camps, she has fun, <br/>\nbut is always ready for them to be over by the end and the thought <br/>\nof 9 months is incomprehensible.  But, she is determined to stick it <br/>\nout for a while.  She wants to atleast go to the Homecoming dance.<br/>\nSocially, she is having no problems.  She knows a lot of kids <br/>\nthrough her acting in the childrens theater and then playing <br/>\nsoftball this year and her cousin whose been in school all along and <br/>\nlots of other things she has done over the years.  The kids are <br/>\nbeing really cool to her.  She has girls to sit with at lunch, kids <br/>\nto hang with in the morning, and even knows quite a few seniors from <br/>\nher summer job at Frontier Town (western theme park).<br/>\nThat&#39;s what she is there for.  Fun.<br/>\nShe is finding out, it&#39;s not all that, but at the same time, it is.<br/>\nThis is going to be very interesting.<br/>\nI need to step back emotionally, but be there for her for her needs.<br/>\nIt&#39;s hard finding a balance.<br/>\nI have Jack and Jamie here.  We&#39;re still unschoolers and we don&#39;t <br/>\nneed this running our lives.<br/>\nI&#39;m sorry I kinda dropped off this list for a while.<br/>\nI&#39;m really sorry I missed the conference.  I don&#39;t even want to hear <br/>\nhow absolutely cool it was.<br/>\nThanks to everyone who was so great to us at last years conference.<br/>\nI wanted so much to be there this year, but Bob had a wedding to <br/>\nplay and with Carly going to school, I lost focus on what was really <br/>\nimportant for us.<br/>\nI think I need help finding my focus again!<br/>\nI&#39;m feeling like I should be preparing Jack and Jamie for the &quot;just <br/>\nin case&quot;, but also know I need to wait and see how Carly handles all <br/>\nof this.  Through it all I keep saying to myself the ol&#39; unschooling <br/>\nmantra, &quot;Trust her&quot;.  She is so absolutley brilliant, she&#39;ll fingure <br/>\nout what she needs and how to get it.  I just have to not screw it <br/>\nup with my anxieties.<br/>\nOkay, this is my first vent of this school year.<br/>\nJoanna<br/>\n<br/>\nOh, funny story.  During Freshman orientation, the teachers were <br/>\ntelling the kids what they needed for supplies.  Carly&#39;s English <br/>\nteacher was very specific about the size of the binder they needed <br/>\nfor his class.<br/>\nCarly came home that day and asked, &quot;Mom, what&#39;s a binder?&quot;<br/>\nShe was totally clueless!<br/>\nI can&#39;t wait for parent/teacher night.<br/>\n<br/>\nOh, and if anyone is thinking I am regretting unschooling.  <br/>\nAbsolutely not!  <br/>\nI&#39;m just freaking out about having to deal with the school system.</div>","specialLinks":[]},{"userId":117956499,"authorName":"maryfhickman@jps.net","from":"maryfhickman@...","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"re:Back to school woes","postDate":"1093621953","msgId":20551,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE2OTU3MDkxLjEwOTM2MjE5NTkyOTQuSmF2YU1haWwucm9vdEBkZXdleS5wc3AucGFzLmVhcnRobGluay5uZXQ+"},"prevInTopic":0,"nextInTopic":20635,"prevInTime":20550,"nextInTime":20552,"topicId":20551,"numMessagesInTopic":0,"msgSnippet":"Hi folks, My daughter almost 10 did pick school again this year. I have 2 kids home, 7 and almost 5. We can not avoid the school culture, all went the first","messageBody":"<div id=\"ygrps-yiv-1441296092\">Hi folks,<br/>\n<br/>\nMy daughter almost 10 did pick school again this year. I have 2 kids home, 7 and almost 5. We can not avoid the school culture, all went the first day to drop off Ashley. Though I smiled hard when my son was asked if he was joining school and he loudly said, No Way!.We live in a great community with lots of homeschooling activities and my son still suffers from not having friends to play with. He basically can&#39;t stand many of the children his own age and those who he does get along with have moved. He plays very well with those kids he decides fit his criteria. He has always gravitated towards young teens, kind of like finding a mentor where ever he goes. His recent exploration in friendship is with a local 12 year old who dives with him. Both boys enjoy eachother&#39;s company and spend unstructured time together often, well, not now that school has started. It was a great summer of sending Riley out to find Nate and the 2 of them spending the day together.<br/>\n<br/>\n I find myself wondering how other families support friendship for their kids. It just doen&#39;t seem that getting kids together informally takes priority for most around here. I feel I am the one making the phone calls for my kids, hosting play, taking them to parks. I&#39;m going to need to keep my radar up to pick out the next family to mesh with for Riley. Again a best buddy moved this summer. It takes time cultivating a mutual relationship with another family so play can happen often and spontaneously. Even in suburbia with kids all around, playing freely has become endangered.<br/>\n<br/>\nMary H.</div>","specialLinks":[]}],"prevTopicId":20656,"nextTopicId":20666}}