{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Distressed 8 year old","postDate":"1307771608","msgId":61552,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRERUM4OEE1LTMwQzctNEIyNC05MkIwLTQ5NUIwMzBENTEyN0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDU1NEJEMkE1QzM2NDQwOUVBQTU0RjQwMzBGMjNCRUU1QFRhbWFyYT4=","referencesHeader":"PGlzdTQ2aytwczljQGVHcm91cHMuY29tPiA8NTU0QkQyQTVDMzY0NDA5RUFBNTRGNDAzMEYyM0JFRTVAVGFtYXJhPg=="},"prevInTopic":61551,"nextInTopic":0,"prevInTime":61551,"nextInTime":61553,"topicId":61533,"numMessagesInTopic":0,"msgSnippet":"-=-It helped a lot for me to talk about others in a similar situation (mentioned my dad not working when I was a kid etc), and this seemed to help her a","messageBody":"<div id=\"ygrps-yiv-835627329\">-=-It helped a lot for me to talk <br/>\nabout others in a similar situation (mentioned my dad not working when I was <br/>\na kid etc), and this seemed to help her a lot.-=-<br/>\n<br/>\nThis reminds me of the 1930&#39;s (Holly&#39;s interest in those times).  Holly loves Fred Astaire movies, and the 1970&#39;s movie Paper Moon.  Those might be fun, and distracting in a good way for a distressed 8 year old.   <br/>\n<br/>\nWhen there&#39;s stress at our house, I&#39;ve found that happy music or a funny movie helps, somewhere between a little bit and all the way, depending.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":333388203,"authorName":"Rinelle","from":"&quot;Rinelle&quot; &lt;rinelle@...&gt;","profile":"rinelle2011","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Distressed 8 year old","postDate":"1307766711","msgId":61551,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU1NEJEMkE1QzM2NDQwOUVBQTU0RjQwMzBGMjNCRUU1QFRhbWFyYT4=","inReplyToHeader":"PGlzdTQ2aytwczljQGVHcm91cHMuY29tPg==","referencesHeader":"PGlzdTQ2aytwczljQGVHcm91cHMuY29tPg=="},"prevInTopic":61543,"nextInTopic":61552,"prevInTime":61550,"nextInTime":61552,"topicId":61533,"numMessagesInTopic":0,"msgSnippet":"When my husband quit his job unexpectedly a couple of years ago, and we decided to make a go of my home business instead of him looking for more work, by","messageBody":"<div id=\"ygrps-yiv-134991898\">When my husband quit his job unexpectedly a couple of years ago, and we <br/>\ndecided to make a go of my home business instead of him looking for more <br/>\nwork, by daughter was quite distressed.  It helped a lot for me to talk <br/>\nabout others in a similar situation (mentioned my dad not working when I was <br/>\na kid etc), and this seemed to help her a lot.  She was so used to daddy <br/>\nbeing at work, and we had talked a lot about how he had to work so that we <br/>\nhad money, so when he wasn&#39;t working, she was really insecure about it. <br/>\nPerhaps your daughter is picking up on your own concerns about money, and <br/>\nneeds some reasurance on that too?<br/>\n<br/>\nMy daughter still finds it hard when I&#39;m working, and even if she&#39;s been <br/>\nhappily playing with Daddy, when I&#39;m suddenly unavailable because of <br/>\nworking, she suddenly needs me.  I&#39;m lucky enough to be able to work in <br/>\nshort bursts, and pause what I&#39;m doing if she needs me, which helps a lot. <br/>\nIs it possible that instead of working a 4 hour block, you could break it up <br/>\ninto shorter blocks?  Or take frequent breaks to check on the kids upstairs, <br/>\nsee if they need anything, get them snacks etc?<br/>\n<br/>\nTamara</div>","specialLinks":[]},{"userId":472480490,"authorName":"sheeboo2","from":"&quot;sheeboo2&quot; &lt;brmino@...&gt;","profile":"sheeboo2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Distressed 8 year old","postDate":"1307743252","msgId":61543,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlzdTQ2aytwczljQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlzdDJ1MCtnZWN0QGVHcm91cHMuY29tPg=="},"prevInTopic":61541,"nextInTopic":61551,"prevInTime":61542,"nextInTime":61544,"topicId":61533,"numMessagesInTopic":0,"msgSnippet":"We spent last summer far away from home so my husband could work and I could help my best friend who had a 22mo old and was having twins. It was a big change","messageBody":"<div id=\"ygrps-yiv-571352091\">We spent last summer far away from home so my husband could work and I could help my best friend who had a 22mo old and was having twins.<br/>\n<br/>\nIt was a big change for my daughter, having me be occupied with other babies, a toddler, my friend and keeping her house. My husband was working with my friend&#39;s husband in their restaurant/bakery and he worked loooong hours. One of the ways that Noor and I were able to spend some good one-on-one time together was to volunteer to do the shopping for the business.  <br/>\n<br/>\nWe&#39;d have lunch at the Sam&#39;s Club (big grocery store) cafe, do the shopping, maybe stop at a thrift store to look through beanie babies and then stop for ice cream on the way home.  Both of us looked forward to spending this bit of time together and it became a very important piece in her loving the time we spent in Alaska.  Sometimes Michael (dh) would join us and that made for fun too--he&#39;d shop while Noor and I just hung out.<br/>\n<br/>\nSo, along with co-sleeping, which I also think is a lovely idea, see if there are ways to fit time for just the two of you into your schedule, even if that time is partially business related--but tag on time that is just for you two.  I don&#39;t know if you&#39;re required to be at the house for religious services, but since everyone else is already occupied, maybe that could be another opportunity to go off together.<br/>\n<br/>\nOur daughter is extremely sensitive to any trepidation I&#39;m feeling, even if I don&#39;t voice it--maybe even more so when I don&#39;t voice it.  Check your own feelings about fear/negativity regarding the change your lives have taken and see if you can&#39;t come to a better, stronger, more confident place.<br/>\n<br/>\nBrie</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Distressed 8 year old","postDate":"1307736718","msgId":61541,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgyMUM4NkFCLTZDQTgtNDg4RC1CNkQyLUE2Mzg2OTgxRkZCREBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGlzdDlwbStnYzFyQGVHcm91cHMuY29tPg==","referencesHeader":"PGlzdDlwbStnYzFyQGVHcm91cHMuY29tPg=="},"prevInTopic":61536,"nextInTopic":61543,"prevInTime":61540,"nextInTime":61542,"topicId":61533,"numMessagesInTopic":0,"msgSnippet":"-=-Do you co-sleep? If not, that could help-=- That was my thought, too.   Maybe you could sleep with her, talk at night, hold hands as you fall asleep. Sandra","messageBody":"<div id=\"ygrps-yiv-820235940\">-=-Do you co-sleep? If not, that could help-=-<br/>\n<br/>\nThat was my thought, too.   Maybe you could sleep with her, talk at night, hold hands as you fall asleep.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Distressed 8 year old","postDate":"1307716214","msgId":61536,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlzdDlwbStnYzFyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlzdDJ1MCtnZWN0QGVHcm91cHMuY29tPg=="},"prevInTopic":61533,"nextInTopic":61541,"prevInTime":61535,"nextInTime":61537,"topicId":61533,"numMessagesInTopic":0,"msgSnippet":"... ******************* It s not just fear of the new, she s probably feeling like she s lost her mother to some extent. She needs more of you more","messageBody":"<div id=\"ygrps-yiv-1762429019\">&quot;llanztama&quot; &lt;llanztama@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I have talked to her at calm moments to see if we could find different strategies for expressing her anger and frustration.  I know that at least some of this is fueled by her fear at this new and difficult situation.  I just don&#39;t know what to do with that information. <br/>\n </span></blockquote>*******************<br/>\n<br/>\nIt&#39;s not just fear of the new, she&#39;s probably feeling like she&#39;s lost her mother to some extent. She needs more of you more consistently. Hanging around while you work isn&#39;t enough - and certainly being stuck between hanging around while you work and going away from you to do something more interesting is going to be vastly stressful. <br/>\n<br/>\nDo you co-sleep? If not, that could help, but it would likely also help to look for ways to pare down your other activities so you can give her more of your direct attention. That includes both work and housekeeping sorts of activities - pare your life down to a minimum and maybe a little beyond, hard as that sounds. Make your time with your kids be about them and their needs. <br/>\n<br/>\nIt might sound unreasonable, but a child melting down to the point that she drives away a client or customers won&#39;t help your finances Or your relationship. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":450196748,"authorName":"llanztama","from":"&quot;llanztama&quot; &lt;llanztama@...&gt;","profile":"llanztama","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Distressed 8 year old","postDate":"1307709184","msgId":61533,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlzdDJ1MCtnZWN0QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":61536,"prevInTime":61532,"nextInTime":61534,"topicId":61533,"numMessagesInTopic":0,"msgSnippet":"My 8 year old daughter seems to be in great distress most of the time and I am unsure how to help her.  In the last two years, my husband lost his job (he was","messageBody":"<div id=\"ygrps-yiv-1785025875\">My 8 year old daughter seems to be in great distress most of the time and I am unsure how to help her.  In the last two years, my husband lost his job (he was clergy, so we also lost our place of worship-it was messy) and started his own business-a cafe where he roasts his own coffee.  I started working part time two afternoons/nights per week teaching music lessons, so that we would have some income.  We have started a worship service in our house because there is no place else for us to go.  The worship service has been a benefit for the kids.  Their friends come to the house and spend the day playing and we don&#39;t have to walk somewhere every Saturday morning.  They like being able to roll out of bed for services!<br/>\n<br/>\nIn order to keep the business going-it is doing incredibly well, but has only been open for a year and half so is not making enough of a profit to support us yet-I have started working at the business as well as my other job.  The kids come with me and either hang out in the cafe or go upstairs and play or watch videos.  We make sure to bring toys and books to play with while we are there.<br/>\n<br/>\nThis has been an incredibly stressful time for all of us and I often feel that I am not present for my kids enough.  I prefer to have them stay in the cafe when I am working rather than go upstairs, because that way, I at least can see them and interact with them to some extent.  Once they go upstairs, we lose that.  But, at some point during the day (I am usually there for 4 hours at a time) they will make their way upstairs.<br/>\n<br/>\nAll of the children are stressed with the situation but my 8 year old is having tantrums (which she has never had before-uncontrollable sobbing and screaming) and is so often angry that she lashes out at everyone.  I have tried talking to her about what is bothering her-acknowledging that life has changed drastically and that our days look so different than they did before.  I try to head off blow outs before they happen, but I often don&#39;t see it coming.  The kids can be playing peacefully together and, all of a sudden, the very thing that was making her laugh will make her yell.  When I ask her what happened, she says it is because the person annoyed her.  She says hurtful things to all of us and when I tell her that it is not acceptable to be hurtful, she feels attacked.  <br/>\n<br/>\nShe has always been highly expressive in her emotions-from the time she was born, she has never been shy in expressing herself.  But this is different.  In the past, I could pinpoint the source of her frustration-lack of food, need for sleep-something that could be solved with relative ease.  But I don&#39;t know how to give her back a way of life that is gone, at least temporarily.<br/>\n<br/>\nI feel as if I am missing something terribly important.  It makes me weep to see her in such pain, but at the same time, I am finding myself getting angry as well.<br/>\n<br/>\nI have talked to her at calm moments to see if we could find different strategies for expressing her anger and frustration.  I know that at least some of this is fueled by her fear at this new and difficult situation.  I just don&#39;t know what to do with that information. <br/>\n<br/>\nHow can I help her?  She is my larger than life, beautiful, whirlwind of a daughter and I can&#39;t seem to help her anymore.<br/>\n<br/>\nLisa L-T</div>","specialLinks":[]}],"prevTopicId":59989,"nextTopicId":61427}}