{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Terri  Allen","from":"&quot;Terri  Allen&quot; &lt;kscajuns@...&gt;","replyTo":"LIST","senderId":"Ok81x9NEMMwNDXZrXddGglYujweBR5TRz-3fImf5KEglNr0sBtiNk5Spd9kqn2IwpAtIOspPJ2Kc2-Vc9y067eO4A0NZdeSdJaUtMfXt","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Need an occupation anyone?","postDate":"990483448","msgId":21635,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwODIwMWMwZTI0MyRkOGYzOGNhMCQ4ZjYyMzVjZUBhbGxlbj4=","referencesHeader":"PDk5MDQ1ODA4MC4xODkzLjEyMDk3Lmw5QHlhaG9vZ3JvdXBzLmNvbT4gPDAwYjQwMWMwZTIxMCQ4N2Y5NzJjMCRmNzNkMmM0MkA3aGp0ODAxPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":21634,"nextInTime":21636,"topicId":21635,"numMessagesInTopic":0,"msgSnippet":"Hi, Annette, thought I d share a cute forward that I received a couple of years ago when I was pregnant with our third child---It still makes me laugh and","messageBody":"<div id=\"ygrps-yiv-1078348205\">Hi, Annette, thought I&#39;d share a cute forward that I received a couple of years ago when I was pregnant with our third child---It still makes me laugh and certainly gives me an answer for the occupation question.....My husband even takes the liberty of answering for me, sometimes! <br/>\n<br/>\nTerri <br/>\n**********************<br/>\nI&#39;m Just a Mother? <br/>\n<br/>\nA few months ago, when I was picking up my children from gymnastics, another mother who I knew well rushed up to me. Emily was fuming with indignation. <br/>\n<br/>\n&quot;Do you know what you and I are?&quot; she demanded. Before I could answer -and I didn&#39;t really have one handy - she blurted out the reason for her question. It seemed she had just returned from renewing her driver&#39;s license at the County Clerk&#39;s office. Asked by the woman recorder to state her &quot;occupation,&quot; Emily had hesitated, uncertain how to classify herself. &quot;What I mean is,&quot; explained the recorder, &quot;Do you have a job, or are you just a .....?&quot; <br/>\n<br/>\n&quot;Of course I have a job,&quot; snapped Emily. &quot;I&#39;m a mother.&quot; <br/>\n<br/>\n<br/>\n&quot;We don&#39;t list &#39;mother&#39; as an occupation...&#39;housewife&#39; covers it, said the recorder emphatically. <br/>\n<br/>\nI forgot all about her story until one day I found myself in the same situation, this time at our own Town Hall. The Clerk was obviously a career woman, poised, efficient, and possessed of a high- sounding title, like &quot;Official Interrogator&quot; or &quot;Town Registrar&quot; <br/>\n<br/>\n&quot;And what is your occupation?&quot; she probed. <br/>\n<br/>\n<br/>\nWhat made me say it, I do not know. The words simply popped out. <br/>\n<br/>\n&quot;I&#39;m....a Research Associate in the field of Child Development and Human Relations.&quot; <br/>\n<br/>\n<br/>\nThe clerk paused, ball-point pen frozen in mid-air, and looked up as though she had not heard right. I repeated the title slowly, emphasizing the most significant words. Then I stared with wonder as my pompous pronouncement was written in bold, black ink on the official questionnaire. <br/>\n<br/>\n<br/>\n&quot;Might I ask,&quot; said the clerk with new interest, &quot;just what you do in your field?&quot; <br/>\n<br/>\n<br/>\nCoolly, without any trace of fluster in my voice, I heard myself reply, &quot;I have a continuing program of research (what mother doesn&#39;t) in the laboratory and in the field (normally I would have said indoors and out). I&#39;m working for my Masters (the whole darned family) and already have four credits (all daughters). Of course, the job is one of the most demanding in the humanities (any mother care to disagree?) and I often work 14 hours a day (24 is more like it). But the job is more challenging than most run-of-the-mill careers and the rewards are in satisfaction rather than just money.&quot; <br/>\n<br/>\n<br/>\nThere was an increasing note of respect in the clerk&#39;s voice as she completed the form, stood up, and personally ushered me to the door. <br/>\n<br/>\n<br/>\nAs I drove into our driveway buoyed up by my glamorous new career, I was greeted by my lab assistants---age 13, 7, and 3. And upstairs, I could hear our new experimental model (six months) in the child-development program, testing out a new vocal pattern. <br/>\n<br/>\n<br/>\nI felt triumphant. I had scored a beat on bureaucracy. And I had gone down on the official records as someone more distinguished and indispensable to mankind than &quot;just another......&quot; <br/>\n<br/>\nHome...what a glorious career. <br/>\n<br/>\nEspecially when there&#39;s a title on the door. <br/>\n<br/>\n************************8<br/>\n<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: Annette Yunker <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a> <br/>\n  Sent: Monday, May 21, 2001 11:10 AM<br/>\n  Subject: [Unschooling-dotcom] Unschooling-dotcom] Occupation<br/>\n<br/>\n<br/>\n  Just as traditional educators are caught up with the idea of grades, tests, subjects, schedules, etc, I find that a similar attitude exists towards adults with regard to jobs or working.  I am always uncomfortable when I have to go to our local hospital.  The clerks enter the information onto a computer form, so I don&#39;t have the opportunity to fill out the form myself.  After taking the name and address of the individual, they reach the part about the work phone number. Of course, this isn&#39;t exactly how they ask it.  Because of the long wait and the tedium of the whole experience, I am always caught off guard when suddenly the clerk says &quot;Do you work?&quot;  when I say &quot;no&quot; they type in &quot;housewife&quot;.  The first time this happened, I didn&#39;t know what they were doing until I got the printout later. What bothers me about this is that I am actually retired, so the info isn&#39;t accurate (they might also be looking for a source of income or locator in the event of non-payment, so knowing the retired persons status would be helpful to them).  If my husband said he didn&#39;t work, what would they do, write &quot;househusband&quot;?  Undoubtedly, they do not.<br/>\n<br/>\n  So, last week, I went to the Dr.&#39;s office and when filling the form, I put &quot;Educational Consultant&quot; for occupation.  I figure my kids consult me quite a bit throughout the day, and with that title, I could be expected to have a work number at home and be self-employed.  Also, many of my friends do seek out my opinion on homeschooling matters.  I&#39;m not embarrassed to be at home with my children, but I am offended at the treatment I receive.  Should I just get over it - does this bother anyone else?  I feel I have just about the greatest job on earth, and one of incredible importance and responsibility.<br/>\n<br/>\n  Annette<br/>\n<br/>\n<br/>\n  [Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n        Yahoo! Groups Sponsor <br/>\n<br/>\n        Yahoo! Website Services- Click Here! <br/>\n       <br/>\n<br/>\n  Message boards, timely articles, a free newsletter and more!<br/>\n  Check it all out at: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n<br/>\n  To unsubscribe, set preferences, or read archives:<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.egroups.com/group/Unschooling-dotcom\">http://www.egroups.com/group/Unschooling-dotcom</a><br/>\n<br/>\n  Another great list sponsored by Home Education Magazine!<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com\">http://www.home-ed-magazine.com</a> <br/>\n<br/>\n<br/>\n<br/>\n  Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]}],"prevTopicId":21633,"nextTopicId":21645}}