{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":141316284,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] re:  unschooler dealing with school","postDate":"1219956759","msgId":37611,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFDQkM2MUZCLUVCQjctNDU1Ri05NUM4LTVCNzQ5M0FFQURCQUBtYWMuY29tPg==","inReplyToHeader":"PDYzMjI5MC42Njc3Ni5xbUB3ZWI1NjIwNi5tYWlsLnJlMy55YWhvby5jb20+","referencesHeader":"PDYzMjI5MC42Njc3Ni5xbUB3ZWI1NjIwNi5tYWlsLnJlMy55YWhvby5jb20+"},"prevInTopic":37609,"nextInTopic":0,"prevInTime":37610,"nextInTime":37612,"topicId":37609,"numMessagesInTopic":0,"msgSnippet":"... I have a kid like this, too. Extremely high social needs! So we participated intensively and I mean INTENSIVELY in homeschooling group activities and","messageBody":"<div id=\"ygrps-yiv-30313751\">On Aug 28, 2008, at 12:44 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mamachaos@...\">mamachaos@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; it sounds like she has a real social need--something perhaps like my  <br/>\n&gt; son--  he is so engrossed in human nature and interested and  <br/>\n&gt; watching--ever since he could watch and take it all in, that it  <br/>\n&gt; really seems almost a NEED for him to be in an environment that is  <br/>\n&gt; just spilling over with it all.  In retrospect, I may have denied  <br/>\n&gt; him the best thing for him, though of course at the time thru his  <br/>\n&gt; upbringing, P.S. was never even on a chart for us.<br/>\n<br/>\n </span></blockquote>I have a kid like this, too. Extremely high social needs! So we  <br/>\nparticipated intensively and I mean INTENSIVELY in homeschooling group  <br/>\nactivities and scouting and all kinds of other group things. I&#39;m  <br/>\nconcerned about the statement &quot;I may have denied him the best thing  <br/>\nfor him....&quot;. Not exactly sure if that meant what it sounded like -  <br/>\nnot letting him go to school denied him adequate social contact? It  <br/>\nisn&#39;t like school is really a great place to get social needs met. I  <br/>\nmean, yes, it is a place where there are large number of children all  <br/>\nclose to the same age all gathered together at one time - so I guess  <br/>\nthat&#39;s a convenience, but there are a lot of way better options that  <br/>\nare more supportive of positive group experiences.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":326163661,"authorName":"mamachaos@monach5.com","from":"mamachaos@...","profile":"ron_monach","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"re:  unschooler dealing with school","postDate":"1219952655","msgId":37609,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYzMjI5MC42Njc3Ni5xbUB3ZWI1NjIwNi5tYWlsLnJlMy55YWhvby5jb20+"},"prevInTopic":0,"nextInTopic":37611,"prevInTime":37608,"nextInTime":37610,"topicId":37609,"numMessagesInTopic":0,"msgSnippet":"Amy~ I can totally relate Amy, I will give you a bit of a comparison story, as I seem a few years ahead of your scenario. My 13 year old wanted to go to school","messageBody":"<div id=\"ygrps-yiv-338460252\">Amy~<br/>\n<br/>\nI can totally relate Amy, I will give you a bit of a comparison story, as I seem a few years ahead of your scenario. My 13 year old wanted to go to school in 6th grade and did...at a Montessori.  Ok year, but same thing as your daughter &quot;way behind in remedial things&quot;.<br/>\n<br/>\nOk, a bit of tutoring and great teachers and he loved it. 7th grade, different Montessori school due to a move, and he hated it.  The teachers were grim, he wanted to go JUST for the SOCIAL reasons and endured it thru March when I removed him, in my feeling MONTHS too late.<br/>\n<br/>\nHe was made to feel stupid and was talked down to....wasn&#39;t even allowed to socialize, as their rules were so strict, and he was labeled a problem because he really did want to chat with kids...  He stayed as long as he did due to his choice.  But one day we both were just DONE.<br/>\n<br/>\nThis year, after the school year began, he decided he wanted to go to PUBLIC SCHOOL.  I began homeschooling as a waldorf devotee, and though I have come around to unschooling, I was still mortified with hs decision.  This is all about me, though so back to the schooling thing.  He wants to go for the social aspects of it, and realizes how dumb most of it is, like your daughter!  Of course any day now will begin the panic about FCAT testing (florida&#39;s insanity) and all of the questions from teachers that you have gotten--seems part of the game.<br/>\n<br/>\nI would be inclined to not allow any testing.  Talk to dean and see if there is another way to deal with &#39;their&#39; needs...like not counting her in the national testing...keeping her registered as a homeschooler legally.  I don&#39;t know what options there might be, but the testing and the tutoring and the labeling will hinder her own progress (and hinders the progress of all students!!) and if she is already feeling like she would like to leave--let it be about the right things, because IN GENERAL, the testing and the tutoring or whatever would not be an every year, every day event.  (though as I write this, it really IS all about testing isn&#39;t it??  Like we all need one great big penis yard stick of &quot;look at me and how big I am&quot; at all times)  <br/>\n<br/>\nit sounds like she has a real social need--something perhaps like my son--  he is so engrossed in human nature and interested and watching--ever since he could watch and take it all in, that it really seems almost a NEED for him to be in an environment that is just spilling over with it all.  In retrospect, I may have denied him the best thing for him, though of course at the time thru his upbringing, P.S. was never even on a chart for us.<br/>\n<br/>\nIf you can befriend the teachers--every one of them, and keep in contact thru notes and emails, it could be that everyone will be so comfortable with your involvement that they can just sit back and relax.  Fact is, that many children who seem behind, may be &quot;behind&quot; due to the parents not helping, participating, even caring about anything that goes on in their child&#39;s lives.<br/>\n<br/>\nSo, though I just rail against the establishment, and *I* find this one of the most difficult things in the world for my son to be at P.S., but while your daughter is there, do what helps HER, do what is best for HER at this MOMENT and for God&#39;s sake don&#39;t start questioning your gut instinct!!  If you *feel* like something isn&#39;t right.......it isn&#39;t.  Trust, listen and allow.  It&#39;s easy to start questioning yourself, particularly when feeling assaulted by a whole group of people.<br/>\n<br/>\nAllow her to have her year of experience, or like in my case it seems to be the life that my son will continue to choose for himself.  If I cannot support it 100%, then he will feel I do not support him 100%.   This whole idea of allowing our children to experience &quot;real&quot; life---if you ask my son, he has always thought that going to public school WAS REAL life, and we have been living a hippie lifestyle.  He wants to be mainstream!!!<br/>\n<br/>\n<br/>\nCan everyone just groan with me very loudly right NOW???????????<br/>\n<br/>\nKelley<br/>\nwww.sandandstardust.blogspot.com</div>","specialLinks":[]}],"prevTopicId":37560,"nextTopicId":37612}}