{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":102133373,"authorName":"joanne comito","from":"joanne comito &lt;joannec28804@...&gt;","profile":"joannec28804","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Parent Report Cards?","postDate":"1045258793","msgId":58779,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMwMjE0MjEzOTUzLjc4MDQ0LnFtYWlsQHdlYjIxMzAyLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDFkYS4yYWU4NGFmLjJiN2ViNmU1QGFvbC5jb20+"},"prevInTopic":58777,"nextInTopic":0,"prevInTime":58778,"nextInTime":58780,"topicId":58687,"numMessagesInTopic":0,"msgSnippet":"... I worked as a nurse in school clinics and ended up quitting because I couldn t stand anymore how we treated the kids.  Everything was done to help them , ","messageBody":"<div id=\"ygrps-yiv-1017725589\"><blockquote><span title=\"ireply\">&gt; <br/>\n&gt; One reason I quit teaching was that it wasn&#39;t about<br/>\n&gt; kids at all.  <br/>\n<br/>\n </span></blockquote>I worked as a nurse in school clinics and ended up<br/>\nquitting because I couldn&#39;t stand anymore how we<br/>\ntreated the kids.  Everything was done to &quot;help them&quot;,<br/>\nbut it felt totally false to me (even though done with<br/>\ngood intentions by a lot of the staff).  Asking kids a<br/>\nmillion questions about their family life,<br/>\n&quot;risk-factors&quot; (ie alchohol, drug, food choices),<br/>\ngrades, and then funneling them to a counselor if they<br/>\nfell out of the range we considered &quot;normal&quot;.  <br/>\nThese poor kids must&#39;ve felt like they were under a<br/>\nmicroscope.  And if they were doing poorly in their<br/>\nclasses, the assumption was always that it was the<br/>\nkid&#39;s (or family&#39;s) fault--not that perhaps the<br/>\nclasses weren&#39;t relevant to these kids&#39; lives.<br/>\nIf kids don&#39;t fit the mold there&#39;s something wrong<br/>\nwith them--they must need counseling, medication etc<br/>\netc--never is there talk that they system they are in<br/>\nmight be damaging.<br/>\nJoanne<br/>\n<br/>\n__________________________________________________<br/>\nDo you Yahoo!?<br/>\nYahoo! Shopping - Send Flowers for Valentine&#39;s Day<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://shopping.yahoo.com\">http://shopping.yahoo.com</a></div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Parent Report Cards?","postDate":"1045257445","msgId":58777,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFkYS4yYWU4NGFmLjJiN2ViNmU1QGFvbC5jb20+"},"prevInTopic":58771,"nextInTopic":58779,"prevInTime":58776,"nextInTime":58778,"topicId":58687,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/14/03 2:06:11 PM, ecsamhill@earthlink.net writes:  ","messageBody":"<div id=\"ygrps-yiv-491173777\">In a message dated 2/14/03 2:06:11 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ecsamhill@...\">ecsamhill@...</a> writes:<br/>\n<br/>\n&lt;&lt; In this high pressure system, it seems like no one is working for the <br/>\nkids. &gt;&gt;<br/>\n<br/>\nAbsolutely true.<br/>\n<br/>\nOne reason I quit teaching was that it wasn&#39;t about kids at all.  It was <br/>\nabout test scores and competition with other schools for special federal <br/>\nfunding.  If the funding involved manipulation of numbers so our district was <br/>\nshown to be poorer than the next one over so we got more federal funds, fine.<br/>\n<br/>\nIn the budgetary considerations, there are school busses and cafeterias and <br/>\nre-roofing contracts and all kinds of truly necessary expenses and <br/>\nconsiderations of making government factory schools work.  But none of the <br/>\ndecisions look at the kids first.  They&#39;re the product, not the budget and <br/>\nnot the management, poor things.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":2300774,"authorName":"Betsy","from":"Betsy &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Parent Report Cards?","postDate":"1045256321","msgId":58771,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNFNEQ1ODgyLjkzMUY0NTBCQGVhcnRobGluay5uZXQ+","referencesHeader":"PGIyaXIwNit0bmIxQGVHcm91cHMuY29tPg=="},"prevInTopic":58770,"nextInTopic":58777,"prevInTime":58770,"nextInTime":58772,"topicId":58687,"numMessagesInTopic":0,"msgSnippet":"**There s that nebulous term again: ready-to-learn. How is that defined? According to the article, one parent stated, if you take care of your kids, it ll","messageBody":"<div id=\"ygrps-yiv-1920082620\">**There&#39;s that nebulous term again: ready-to-learn. How is that defined?<br/>\nAccording to the article, one parent stated, &quot;if you take care of your<br/>\nkids, it&#39;ll show up in the report.&quot; So, if you take care of your kids,<br/>\nthey will be ready-to-learn? Think again. It becomes obvious, in reading<br/>\nthe article, that it isn&#39;t the parent defining the terms, setting the<br/>\nstandards, deciding what constitutes ready-to-learn, it is the school.<br/>\nLikewise, it isn&#39;t the parent doing the grading; it is the school. So<br/>\nactually, what we are talking about here, with parent report cards, is<br/>\nparents being accountable to the school. Remember when the &quot;partnership&quot;<br/>\nconcept was pushed: parents in partnership  with the school? So, is this<br/>\nhow &quot;partnership&quot; is defined: the school sending home a report card on<br/>\nhow well parents are doing in providing to the school a child deemed by<br/>\nthe school to be ready-to-learn? It would appear so. Doesn&#39;t this, then,<br/>\nmake the parent the junior or silent partner in this partnership? It<br/>\nwould appear so. **<br/>\n<br/>\n<br/>\nIt sounds like the schools are saying to the parents &quot;you work for us&quot;<br/>\nand thinking &quot;and we work for the funding&quot;.<br/>\n<br/>\nIn this high pressure system, it seems like no one is working for the kids.<br/>\n<br/>\nBetsy</div>","specialLinks":[]},{"userId":2300774,"authorName":"Betsy","from":"Betsy &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Parent Report Cards?","postDate":"1045256319","msgId":58770,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNFNEQ1ODdGLjY4Qzg1QUEzQGVhcnRobGluay5uZXQ+","referencesHeader":"PGIyaXIwNit0bmIxQGVHcm91cHMuY29tPg=="},"prevInTopic":58755,"nextInTopic":58771,"prevInTime":58769,"nextInTime":58771,"topicId":58687,"numMessagesInTopic":0,"msgSnippet":"**A child that is deemed not ready-to-learn is considered to be at risk for failure. Under Goals 2000 and its peripheral legislation, a child at risk for","messageBody":"<div id=\"ygrps-yiv-1148673880\">**A child that is deemed not ready-to-learn is considered to be &quot;at risk<br/>\nfor failure.&quot; Under Goals 2000 and its peripheral legislation, a child<br/>\nat risk for failure must be given the help he or she needs to alleviate<br/>\nthe at risk for failure factors. If it is deemed the parent is the<br/>\nproblem, is obstructing or refuses to do what the school deems is<br/>\nnecessary &quot;in the interests of the child,&quot; then intervention by social<br/>\nand health services, even child protective services, is indicated.<br/>\nEither of these agencies can remove a child from a home without cause,<br/>\nwithout warrant, without due process. This is already happening. **<br/>\n<br/>\nJust this week, my dentist told me of a case where this happened to him.<br/>\n (And presumably he lives in a ritzy neighborhood with &quot;good&quot; schools.) <br/>\nAn administrator threatened to call CPS and have his teenage daughter<br/>\n*taken away from him* solely because the father argued with the school<br/>\nabout having his daughter serve an unfair detention.<br/>\n<br/>\nSo if anyone thinks that schools would only use this power and these<br/>\nthreats discreetly and reasonably, get over that idea real fast.<br/>\n<br/>\nBetsy</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Parent Report Cards?","postDate":"1045250591","msgId":58755,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFlYy4xZWRmMTM0LjJiN2U5YzFmQGFvbC5jb20+"},"prevInTopic":58687,"nextInTopic":58770,"prevInTime":58754,"nextInTime":58756,"topicId":58687,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/14/03 6:31:10 AM, Nest4Robin@webtv.net writes: ","messageBody":"<div id=\"ygrps-yiv-1114354806\">In a message dated 2/14/03 6:31:10 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Nest4Robin@...\">Nest4Robin@...</a> writes:<br/>\n<br/>\n&lt;&lt; Parents should be very concerned and very outraged. Why? <br/>\n<br/>\nA child that is deemed not ready-to-learn is considered to be &quot;at risk for <br/>\nfailure.&quot; Under Goals 2000 and its peripheral legislation . . .&gt;&gt;<br/>\n<br/>\nThat&#39;s like the booga-booga stuff I used to get from HSLDA when I was first <br/>\nhomeschooling and they assumed they could scare me into joining for my <br/>\nimmediate PROTECTION.  They told me what to be angry about, who to call, and <br/>\nexactly what to say when I got them on the phone.<br/>\n<br/>\n-=-Oh dear you say? Oh dear, indeed! <br/>\n<br/>\nWhen parents objected to the &quot;partnership&quot; concept years ago, at the <br/>\nbeginning of education reform,. . .-=-<br/>\n<br/>\nEducational reform has been going on in the U.S. since schools were <br/>\ndeveloped.  They&#39;re probably talking about just the reforms being discussed <br/>\nin the mid-80&#39;s when the Christian Homeschooling movement got going.<br/>\n<br/>\n-=-. . .their concerns were dismissed as the paranoid ravings of the <br/>\n&quot;religious right.&quot;<br/>\n<br/>\n-=-<br/>\n<br/>\nBingo.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":1175077,"authorName":"primalmother &lt;Nest4Robin@webtv.net&gt;","from":"&quot;primalmother &lt;Nest4Robin@...&gt;&quot; &lt;Nest4Robin@...&gt;","profile":"primalmother","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Parent Report Cards?","postDate":"1045229382","msgId":58687,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGIyaXIwNit0bmIxQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":58755,"prevInTime":58686,"nextInTime":58688,"topicId":58687,"numMessagesInTopic":0,"msgSnippet":"PARENT REPORT CARDS?\nLynn M. Stuter\nFebruary 12, 2003\nNewsWithViews.com\n USA Today carried an article on February 6, 2003, stating that parents in= Lebanon,","messageBody":"<div id=\"ygrps-yiv-1723074475\">PARENT REPORT CARDS?<br/>\nLynn M. Stuter<br/>\nFebruary 12, 2003<br/>\nNewsWithViews.com<br/>\n&quot;USA Today&quot; carried an article on February 6, 2003, stating that parents in=\r<br/>\n Lebanon, Pennsylvania, may be among the first in the nation to receive a re=\r<br/>\nport card from their child&#39;s school on &quot;how involved they are in their child=\r<br/>\n&#39;s education.&quot; <br/>\nWhat does the school mean by this? Does the school mean how active is the p=\r<br/>\narent in overseeing the education of his or her child? It would not appear s=\r<br/>\no. Further on in the article, school district superintendent, Marianne Bartl=\r<br/>\ney, is quoted as saying &quot;the goal is to make sure parents are sending their =\r<br/>\nkids to school ready to learn and keeping on top of their academic progress.=\r<br/>\n&quot; <br/>\nThere&#39;s that nebulous term again: ready-to-learn. How is that defined? Acco=\r<br/>\nrding to the article, one parent stated, &quot;if you take care of your kids, it&#39;=\r<br/>\nll show up in the report.&quot; <br/>\nSo, if you take care of your kids, they will be ready-to-learn? Think again=\r<br/>\n. It becomes obvious, in reading the article, that it isn&#39;t the parent defin=\r<br/>\ning the terms, setting the standards, deciding what constitutes ready-to-lea=\r<br/>\nrn, it is the school. Likewise, it isn&#39;t the parent doing the grading; it is=\r<br/>\n the school. So actually, what we are talking about here, with parent report=\r<br/>\n cards, is parents being accountable to the school. <br/>\nRemember when the &quot;partnership&quot; concept was pushed: parents in partnership =\r<br/>\nwith the school? So, is this how &quot;partnership&quot; is defined: the school sendin=\r<br/>\ng home a report card on how well parents are doing in providing to the schoo=\r<br/>\nl a child deemed by the school to be ready-to-learn? It would appear so. Doe=\r<br/>\nsn&#39;t this, then, make the parent the junior or silent partner in this partne=\r<br/>\nrship? It would appear so. Isn&#39;t this the very concept that Joseph Fields pr=\r<br/>\nesented in his book, &quot;Total Quality for Schools&quot; when he wrote, &quot;Parents lea=\r<br/>\nrn that they must provide the best ready-to-learn student possible&quot;...? Oh d=\r<br/>\near you say? Oh dear, indeed! <br/>\nWhen parents objected to the &quot;partnership&quot; concept years ago, at the beginn=\r<br/>\ning of education reform, their concerns were dismissed as the paranoid ravin=\r<br/>\ngs of the &quot;religious right.&quot; Guess concerned parents were not so paranoid af=\r<br/>\nter all; guess they had good reason to be concerned. How short our memory; h=\r<br/>\now quickly we forget that parents were lied to, made fun of, ridiculed. <br/>\nShould parents be &quot;anxious&quot; about these report cards, as the article sugges=\r<br/>\nted some might be? &quot;Anxious&quot; doesn&#39;t come anywhere close to describing what =\r<br/>\nparental reaction to this should be. Parents should be very concerned and ve=\r<br/>\nry outraged. Why? <br/>\nA child that is deemed not ready-to-learn is considered to be &quot;at risk for =\r<br/>\nfailure.&quot; Under Goals 2000 and its peripheral legislation, a child at risk f=\r<br/>\nor failure must be given the help he or she needs to alleviate the at risk f=\r<br/>\nor failure factors. If it is deemed the parent is the problem, is obstructin=\r<br/>\ng or refuses to do what the school deems is necessary &quot;in the interests of t=\r<br/>\nhe child,&quot; then intervention by social and health services, even child prote=\r<br/>\nctive services, is indicated. Either of these agencies can remove a child fr=\r<br/>\nom a home without cause, without warrant, without due process. This is alrea=\r<br/>\ndy happening. <br/>\nThe long and short of this is that the schools have gained the authority th=\r<br/>\ney need to force parents to do what they want in the raising and education o=\r<br/>\nf the child. <br/>\nParents should be outraged. Capital switchboards should be jammed with call=\r<br/>\ns from angry parents. Parents should be marching in the streets. This is not=\r<br/>\nhing short of the communist polytechnical system of education in which the c=\r<br/>\nhild is a ward of the state. <br/>\nThe parental right to oversee the upbringing and education of the child is =\r<br/>\nan inherent, God given right. That means no legislature under our constituti=\r<br/>\non has the authority, directly or indirectly, to infringe on that right. <br/>\nWhile the &quot;USA Today&quot; article tries to downplay the authority the school ha=\r<br/>\ns been given over the parent, the implications are very clear: <br/>\n&quot;... parents who do not live up to any of their responsibilities would be c=\r<br/>\nontacted by an outreach worker who would try to help them become more involv=\r<br/>\ned. And parents who cannot or will not cooperate would have an &#39;adult mentor=\r<br/>\n&#39; assigned to their child.&quot; The adult mentor is there in the interests of th=\r<br/>\ne school, not the parent. As such, it is obvious that an adult mentor will c=\r<br/>\nause alienation of child and parent. <br/>\nThe article goes on to quote Superintendent Bartley as saying, &quot;If they&#39;re =\r<br/>\njust really resistant, they say, &#39;Get out of my home, go away,&#39; we still hav=\r<br/>\ne a responsibility for that child.&quot; That responsibility includes reporting t=\r<br/>\nhe parents to social and health services or child protective services. <br/>\nBut this won&#39;t happen to you? Don&#39;t bet on it. The list of what constitutes=\r<br/>\n &quot;at risk for failure&quot; covers the imaginable as well as much that is not. <br/>\nThe parents in East Stroudsburg, Pennsylvania, whose daughters were given g=\r<br/>\nenital exams by the government school never thought what happened would happ=\r<br/>\nen either. The genital exams were also the outreach of Goals 2000 and readin=\r<br/>\ness-to-learn. The school was checking the girls to make sure they were not a=\r<br/>\nt risk for failure by having been molested by an adult or parent. It didn&#39;t =\r<br/>\nmatter that there was no indication that these girls had been molested. It d=\r<br/>\nidn&#39;t matter that the parents were not notified of the exams, did not give p=\r<br/>\nermission, were not present when the exams were done. The school was merely =\r<br/>\nacting on the authority given it to ensure nothing stood in the way of the s=\r<br/>\nchool producing &quot;a world class workforce.&quot; <br/>\nThat&#39;s outrageous? Yes, that&#39;s outrageous. Certainly, it&#39;s outrageous! But =\r<br/>\nparents and citizens need to understand that in dealing with the government =\r<br/>\nschools, they are dealing with a system that sees the child as a &quot;resource&quot; =\r<br/>\nor &quot;human resource&quot; to be conditioned to the perceived environment of the &quot;c=\r<br/>\nreated future&quot;--the sustainable global environment. If the parent gets in th=\r<br/>\ne way, the child will simply be removed to an environment more conducive to =\r<br/>\nthe conditioning process. <br/>\nSources: <br/>\nAssociated Press; &quot;School district eyes &#39;parent report card&#39;;&quot; USA Today; F=\r<br/>\nebruary 6, 2003. <br/>\nFields, Joseph; &quot;Total Quality for Schools; A Suggestion for American Educa=\r<br/>\ntion;&quot; Milwaukee: ASQC; 1993. <br/>\n© 2003 Lynn M. Stuter - All Rights Reserved <br/>\n  <br/>\n  <br/>\nMother and wife, Stuter has spent the past ten years researching systems th=\r<br/>\neory with a particular emphasis on education.  She home schooled two daughte=\r<br/>\nrs, now grown and on their own.  She has worked with legislators, both state=\r<br/>\n and federal, on issues pertaining to systems governance and education refor=\r<br/>\nm.  She networks nation-wide with other researchers and citizens concerned w=\r<br/>\nith the transformation of our nation.  She has traveled the United States an=\r<br/>\nd lived overseas. Web site: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.icehouse.net/lmstuter%c2%a0%c2%a0\">http://www.icehouse.net/lmstuter%c2%a0%c2%a0</a> E-Mail: lmstu=\r<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ter@...\">ter@...</a> <br/>\nSource: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.newswithviews.com/Stuter/stuter14.htm\">http://www.newswithviews.com/Stuter/stuter14.htm</a></div>","specialLinks":[]}],"prevTopicId":58559,"nextTopicId":58735}}