{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] thoughts on drugs","postDate":"1023642532","msgId":38254,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE4Mi45N2M4NDJhLjJhMzRlNWE0QGFvbC5jb20+"},"prevInTopic":38251,"nextInTopic":0,"prevInTime":38253,"nextInTime":38255,"topicId":38246,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/9/02 10:13:00 AM, zenmomma@hotmail.com writes: ","messageBody":"<div id=\"ygrps-yiv-840304097\">In a message dated 6/9/02 10:13:00 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:zenmomma@...\">zenmomma@...</a> writes:<br/>\n<br/>\n&lt;&lt; I <br/>\nfirmly believe schools should have NO part whatsoever in recommending a <br/>\n&quot;diagnosis&quot; or medication for what they consider a problem child.  &gt;&gt;<br/>\n<br/>\nI would request medication for a child too, myself, if circumstances dictated <br/>\nit within an unschooling lifestyle.  I would unschool first, if the problem <br/>\nseemed to be school-related or school-induced or agravated. <br/>\n<br/>\nBut sometimes teachers do see problems in kids that parents don&#39;t see, <br/>\nbecause they see lots of kids and some parents hardly see their own.  And if <br/>\nthey do see their own they don&#39;t know what the range of behavior is.   <br/>\n<br/>\nWithout a range for comparison, some parents assume their kid is normal-range <br/>\nwhen he&#39;s not.  <br/>\n<br/>\nI think that&#39;s one reason some dads are too demanding academically, because <br/>\nthey don&#39;t see how other kids their child&#39;s age are doing, what their levels <br/>\nof understanding are, and what their personal interests are, so they look at <br/>\ntheir one child and expect behavior, knowledge and attention span beyond his <br/>\nyears.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":8378727,"authorName":"zenmomma *","from":"&quot;zenmomma *&quot; &lt;zenmomma@...&gt;","profile":"zenmomma2kids","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"thoughts on drugs","postDate":"1023639126","msgId":38251,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYxMDlkcmpmTlZFTE9VMExsbEcwMDAxNzI5NkBob3RtYWlsLmNvbT4="},"prevInTopic":38246,"nextInTopic":38254,"prevInTime":38250,"nextInTime":38252,"topicId":38246,"numMessagesInTopic":0,"msgSnippet":"... I haven t been posting much, but I just just had to pop in after reading this paragraph. I could have written this one myself concerning my son, Conor. ","messageBody":"<div id=\"ygrps-yiv-1025790959\"><blockquote><span title=\"ireply\">&gt;&gt;My son is 12, and I fought battle after battle for my son in the public <br/>\n&gt;&gt;school system. I knew something was wrong, but felt that if I brought him <br/>\n&gt;&gt;home and homeschooled him I could prove them wrong. For a long time things <br/>\n&gt;&gt;went very well for him, close friends even noticed the difference in him. <br/>\n&gt;&gt;I was reaping the rewards of homeschooling to no end. Then there was a <br/>\n&gt;&gt;change, and the change in him told me he was suffering and needed help. <br/>\n&gt;&gt;Thank God that the doctor listened to me, and my input. He put my son on <br/>\n&gt;&gt;the medication I was most comfortable with, and would have prescribed <br/>\n&gt;&gt;myself.&gt;&gt;<br/>\n<br/>\n </span></blockquote>I haven&#39;t been posting much, but I just just had to pop in after reading <br/>\nthis paragraph. I could have written this one myself concerning my son, <br/>\nConor.<br/>\n<br/>\nSchool was a constant battle for him (and me) and unschooling has blessed <br/>\nour lives in so many ways. When he came home at 9 years old he just relaxed <br/>\nand blossomed. Even still, he has also suffered with clinical depression and <br/>\nis currently on medication. We have been able to reduce the dosage, but not <br/>\nstop it entirely. Conor has been a part of the decision each and every step <br/>\nof the way. I fought the idea of medication for a long time. In retrospect, <br/>\nI think my stubborn refusal to consider such a thing actually forced Conor <br/>\nto suffer much too long.<br/>\n<br/>\nI would never medicate a child, or anyone for that matter, on a whim. I <br/>\nfirmly believe schools should have NO part whatsoever in recommending a <br/>\n&quot;diagnosis&quot; or medication for what they consider a problem child. I do, <br/>\nhowever, have first hand experience with a child who truly needed medical <br/>\nintervention to function in his real, everday, unschooling life. For us, <br/>\nmedication has allowed that unschooling life to continue to unfold and <br/>\nblossom.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Dear Unschooling group. this was hard to write and stirred up emotions for <br/>\n&gt;&gt;me. Please understand my thoughts.&gt;&gt;<br/>\n<br/>\n </span></blockquote>I thank you for sharing. We all want to do what is best for our children. <br/>\nSome decisions are harder to make than others.<br/>\n<br/>\nLife is good.<br/>\n~Mary<br/>\n<br/>\n_________________________________________________________________<br/>\nChat with friends online, try MSN Messenger: <a rel=\"nofollow\" target=\"_blank\" href=\"http://messenger.msn.com\">http://messenger.msn.com</a></div>","specialLinks":[]},{"userId":21712089,"authorName":"staclarspr@aol.com","from":"staclarspr@...","profile":"lasvegashillgirl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"thoughts on drugs","postDate":"1023595447","msgId":38246,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVhLjI4Yzk5NTdjLjJhMzQyZGI3QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":38251,"prevInTime":38245,"nextInTime":38247,"topicId":38246,"numMessagesInTopic":0,"msgSnippet":"I think it would help to hear my thoughts and try to understand where I am coming from regarding the recent drug issue going around on this list. On the issue","messageBody":"<div id=\"ygrps-yiv-1352120982\">I think it would help to hear my thoughts<br/>\nand try to understand where I am coming<br/>\nfrom regarding the recent drug issue going<br/>\naround on this list.<br/>\n<br/>\nOn the issue of Marc taking his nephews out<br/>\ncamping. Great for you. We do alot of family <br/>\nouttings from ice fishing to metal detecting.<br/>\n<br/>\n<br/>\nSorry, we own a TV in fact 3 of them and we watch<br/>\nthem all in fact we pay for cable. I consider my <br/>\nVCR and TV great teaching tools. When 9-11 happened<br/>\nthe news kept me abreast of everything that was happening.<br/>\nAnd also for the memorial ceremony, my son and I watched<br/>\nthat too.<br/>\n<br/>\nMy brother who died at age 40, suffered from a mental condition.<br/>\nMy father thought he could fix it all by telling my brother that if<br/>\nhe would just get off the medication, life for him would be better.<br/>\nThere were times my brother actually couldn&#39;t stand the tension<br/>\nand went cold turkey off the medication. (never diagnosed until 25 years old)<br/>\nIn fact it got to the point that my brother rarely came home, and<br/>\nI and my mother suffered for what my father couldn&#39;t understand nor<br/>\ntolerate the medications side effects.<br/>\n<br/>\nMy son is 12, and I fought battle after battle for my son in the public<br/>\nschool system. I knew something was wrong, but felt that if I brought<br/>\nhim home and homeschooled him I could prove them wrong. For a long<br/>\ntime things went very well for him, close friends even noticed the difference<br/>\nin him. I was reaping the rewards of homeschooling to no end. <br/>\nThen there was a change, and the change in him told me he was suffering<br/>\nand needed help. Thank God that the doctor listened to me, and my input. He<br/>\nput my son on the medication I was most comfortable with, and would<br/>\nhave prescribed myself. I still applaud homeschooling for I am really a great<br/>\nteacher with a great student.<br/>\n<br/>\nSo, long story short is I do know what withdrawls are, and I also do my <br/>\nhomework<br/>\non every medication my family is on. <br/>\n<br/>\nDear Unschooling group. this was hard to write and stirred up emotions for <br/>\nme.<br/>\nPlease understand my thoughts.<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":38225,"nextTopicId":38262}}