{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":139549710,"authorName":"Olga","from":"&quot;Olga&quot; &lt;britcontoo@...&gt;","profile":"britcontoo","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Was:&quot;Getting&quot; Unschooling, was Math phobia, again: Now: Great Advice","postDate":"1051625274","msgId":66572,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGI4bTB2cSs5ZWMzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDFkOC44OGNkY2Q3LjJiZGZkMzY3QGFvbC5jb20+"},"prevInTopic":66553,"nextInTopic":0,"prevInTime":66571,"nextInTime":66575,"topicId":66553,"numMessagesInTopic":0,"msgSnippet":"I thought this was an excellent post.  So often, I feel guilty doing things for myself.  Between the kids, house, bills, errands and working at home there is","messageBody":"<div id=\"ygrps-yiv-1243500742\">I thought this was an excellent post.  So often, I feel guilty doing <br/>\nthings for myself.  Between the kids, house, bills, errands and <br/>\nworking at home there is always this overwhelming feeling looming.  <br/>\nWhen I do something for myself, I always feel I am justifying it. &quot;Do <br/>\nI want to start that book, because that is it for the day, nothing <br/>\nelse will get done?&quot; sort of feeling.   I do make an effort to do <br/>\nthings and I say NO when need be.  What a great reminder that it is <br/>\nnot only okay to sit and read a book but it is part of unschooling <br/>\nyourself and your children!  I really needed to hear that!<br/>\n<br/>\nAlso, I think it relates to what Sandra said in a previous post in <br/>\nresponse to if we live a dull life will we hinder our children.  You <br/>\nknow, at first I thought &quot;Oh GOd, am I doing enough&quot;.  Then I <br/>\nreflected and thought yeah!  Me and hubby live a different life from <br/>\nmost of our friends and make different, thoughtful choices.  We try <br/>\nthings and I think although we don&#39;t discuss all of it directly with <br/>\nour kids, they surround us and &quot;hear&quot; it.  <br/>\n<br/>\nI never realized that some of the best unschooling I could give my <br/>\nkids was to make better choices and live a more profound life <br/>\nmyself!  Thanks to both of you for some excellent food for thought!!<br/>\n<br/>\nOlga :)<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; The best way in the world to unschool, that I have seen, is to live <br/>\n </span></blockquote>your life <br/>\n<blockquote><span title=\"ireply\"> &gt; beside your children and to support them in living their own. <br/>\n </span></blockquote>Someone <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; I think to unschool effectively means that we parents have to <br/>\n </span></blockquote>have lives and <br/>\n<blockquote><span title=\"ireply\"> &gt; interests. We have to have a passion for learning stuff, to like to <br/>\n </span></blockquote>do stuff. <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; My parents did not homeschool me (although my mom said it was too <br/>\n </span></blockquote>bad they <br/>\n<blockquote><span title=\"ireply\"> &gt; didn&#39;t know about that, because it would have been perfect for me), <br/>\n </span></blockquote>but in <br/>\n<blockquote><span title=\"ireply\"> &gt; their own way, they did kind of unschool us. They had interesting <br/>\n </span></blockquote>lives, and <br/>\n<blockquote><span title=\"ireply\"> &gt; we were always welcome to be there. If they had interesting folks <br/>\n </span></blockquote>over to <br/>\n<blockquote><span title=\"ireply\"> &gt; visit, we were never sent to our rooms -- we were welcomed into the <br/>\n&gt; conversation. <br/>\n&gt; <br/>\n&gt; When we had interests, we were always encouraged and supported in <br/>\n </span></blockquote>them, and <br/>\n<blockquote><span title=\"ireply\"> &gt; never told it was silly or impossible.<br/>\n&gt; <br/>\n&gt; &gt; I mean that to model to kids that <br/>\n&gt; there&#39;s a cool world of stuff to learn and experience, we need to <br/>\n </span></blockquote>DO it. What <br/>\n<blockquote><span title=\"ireply\"> &gt; have YOU always wanted to learn or do?  What are YOUR dreams?   &gt; <br/>\n&gt; So, I think maybe you DO need to do stuff that&#39;s about YOU, but not <br/>\n </span></blockquote>having to <br/>\n<blockquote><span title=\"ireply\"> &gt; do with your kids. Most of us, particularly early in unschooling, <br/>\n </span></blockquote>have had <br/>\n<blockquote><span title=\"ireply\"> &gt; those panicked moments where we blow it. This is scary stuff!  So <br/>\n </span></blockquote>we <br/>\n<blockquote><span title=\"ireply\"> &gt; apologize and move on. She may never like algebra. If she really <br/>\n </span></blockquote>wants to get <br/>\n<blockquote><span title=\"ireply\"> &gt; to Med School, and it&#39;s a real dream for her, she&#39;ll figure out <br/>\n </span></blockquote>what she <br/>\n<blockquote><span title=\"ireply\"> &gt; needs to get there and do it. <br/>\n&gt; <br/>\n&gt; My favorite unschooling book isn&#39;t about unschooling or even <br/>\n </span></blockquote>parenting at <br/>\n<blockquote><span title=\"ireply\"> &gt; all. It&#39;s called Wishcraft: How to Get What You Really Want, by <br/>\n </span></blockquote>Barbara Sher. <br/>\n<blockquote><span title=\"ireply\"> &gt; I believe if we all just raised our kids that way everyone would be <br/>\n </span></blockquote>happier.<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; Kathryn<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":779600,"authorName":"KathrynJB@aol.com","from":"KathrynJB@...","profile":"kathrynbeth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:&quot;Getting&quot; Unschooling, was Math phobia, again","postDate":"1051621735","msgId":66553,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFkOC44OGNkY2Q3LjJiZGZkMzY3QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":66572,"prevInTime":66552,"nextInTime":66554,"topicId":66553,"numMessagesInTopic":0,"msgSnippet":"In a message dated 4/29/2003 1:36:15 AM Eastern Standard Time, ... Glena, this post kind of summed up to me why you seemed to be missing what people are trying","messageBody":"<div id=\"ygrps-yiv-48221554\">In a message dated 4/29/2003 1:36:15 AM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Apparently I&#39;m having a stupid day because I don&#39;t understand this either.  <br/>\n&gt; I <br/>\n&gt; cook for my child every single day of her life, it&#39;s not something that she <br/>\n&gt; <br/>\n&gt; would ask me to do or not do, it&#39;s how life goes around here. <br/>\n&gt; <br/>\n&gt; So even in feeding our children we should  wait to see if they are <br/>\n&gt; interested <br/>\n&gt; before we cook a meal for them?<br/>\n&gt; <br/>\n&gt; Apparently this unschooling lifestyle is so far over my head it is going to <br/>\n&gt; <br/>\n&gt; be unattainable for me, I simply do not get that even the simplest of <br/>\n&gt; life&#39;s <br/>\n&gt; existence&#39;s has to be validated by one&#39;s child in order to be valued or <br/>\n&gt; right.<br/>\n&gt; <br/>\n&gt; Ok, IF she somehow had no interest in supper for example and I had prepared <br/>\n&gt; <br/>\n&gt; the meal with love it&#39;s still wrong because she specifically did not ask me <br/>\n&gt; <br/>\n&gt; to prepare her supper?<br/>\n&gt; <br/>\n&gt; What about replacing the toilet paper?  You think that&#39;s crazy right?  <br/>\n&gt; EVERYTHING I do, I think of my family and how it will bless them or make <br/>\n&gt; their lives happy, EVEN making sure I buy the brand of toilet tissue they <br/>\n&gt; like and EVEN making sure it&#39;s replaced because I know they dislike finding <br/>\n&gt; <br/>\n&gt; out at inopportune times that the roll is empty.  I don&#39;t think about these <br/>\n&gt; <br/>\n&gt; things, I just do them, no one asks me to make the meals or do the shopping <br/>\n&gt; <br/>\n&gt; or laundry or any of the things that I do for my children.<br/>\n&gt; <br/>\n&gt; I know that one child likes a particular scent of snuggle sheets while <br/>\n&gt; another really likes her sheets sprayed with linen spray before she goes to <br/>\n&gt; <br/>\n&gt; bed.  Just because they don&#39;t ask with each load of laundry or each night <br/>\n&gt; before they go to bed does it make it wrong that I do it for them?<br/>\n&gt; <br/>\n&gt; Lord I think I need a chart, maybe they can start indicating daily which <br/>\n&gt; things that I should/can do for them that day that won&#39;t be an imposition.<br/>\n&gt; <br/>\n&gt; I am soooooo confused...<br/>\n&gt; <br/>\n&gt; Preparing a special meal out of love is for ME and not them... I&#39;ll keep <br/>\n&gt; repeating this to myself hoping it will sink in.  Unless they ASK it is for <br/>\n&gt; <br/>\n&gt; ME not them... mumbling and repeating and trying to understand...<br/>\n&gt; <br/>\n&gt; glena<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Glena, this post kind of summed up to me why you seemed to be missing what <br/>\npeople are trying to tell you. And I really do believe it&#39;s just a matter of <br/>\nthat one little spark of &quot;getting it&quot; that hasn&#39;t happened yet, rather than <br/>\nyour not WANTING to get it.<br/>\n<br/>\nThe best way in the world to unschool, that I have seen, is to live your life <br/>\nbeside your children and to support them in living their own. Someone <br/>\nmentioned that it was unlikely that if Tiger Woods had kids that they <br/>\nwouldn&#39;t more or less have golf in their blood. They might not be champions, <br/>\nor even like it much....but being around someone who had a passion for it, <br/>\nbeing part the culture of tournaments, etc...the child would Get Golf. <br/>\nLikewise, lots of children of musicians become musicians, because music is <br/>\njust a part of what they live with.<br/>\n<br/>\nI think to unschool effectively means that we parents have to have lives and <br/>\ninterests. We have to have a passion for learning stuff, to like to do stuff. <br/>\nWe CAN&#39;T just do it for the kids. Then it becomes a sacrifice, which IS about <br/>\nus. Kids don&#39;t want us to sacrifice ourselves...that&#39;s leads to guilt. <br/>\n<br/>\nMy parents did not homeschool me (although my mom said it was too bad they <br/>\ndidn&#39;t know about that, because it would have been perfect for me), but in <br/>\ntheir own way, they did kind of unschool us. They had interesting lives, and <br/>\nwe were always welcome to be there. If they had interesting folks over to <br/>\nvisit, we were never sent to our rooms -- we were welcomed into the <br/>\nconversation. <br/>\n<br/>\nWhen we had interests, we were always encouraged and supported in them, and <br/>\nnever told it was silly or impossible.<br/>\n<br/>\nSo, reading the above... I was a bit baffled. Sure, there&#39;s nothing wrong <br/>\nwith buying the brand of toilet paper your family likes -- but why are you <br/>\nthe only one who replaces the roll? (I can&#39;t remember how old your kids are, <br/>\nbut if there&#39;s a concern about algebra and med school, I assume they&#39;re not <br/>\n3). If your child likes her linens sprayed with linen spray, why isn&#39;t it <br/>\nnext to her bed for HER to do it?<br/>\n<br/>\nIt&#39;s not that it isn&#39;t fine for you to have a couple of &quot;Lovey Nurturey&quot; <br/>\nthings you do for your family, but the impression I get is that these are <br/>\njust the tip of the iceberg. I think the first thing you need to do is to Get <br/>\na Life.<br/>\n<br/>\nI don&#39;t mean that in a mean, nasty way. I mean that to model to kids that <br/>\nthere&#39;s a cool world of stuff to learn and experience, we need to DO it. What <br/>\nhave YOU always wanted to learn or do?  What are YOUR dreams?  Someone here <br/>\nmentioned that she&#39;d love to live in Alaska, but it just isn&#39;t in the cards <br/>\nfor her family right now. But I bet she reads about it, watches <br/>\ndocumentaries, and spend lots of time planning her next trips there. Her kids <br/>\nmay never care about Alaska, but they&#39;ll see that Mom is a person with her <br/>\nown dreams, and see how she gets tastes of Alaska in her life. They&#39;ll learn <br/>\nhow to apply that to their own lives.<br/>\n<br/>\nSo, I think maybe you DO need to do stuff that&#39;s about YOU, but not having to <br/>\ndo with your kids. Most of us, particularly early in unschooling, have had <br/>\nthose panicked moments where we blow it. This is scary stuff!  So we <br/>\napologize and move on. She may never like algebra. If she really wants to get <br/>\nto Med School, and it&#39;s a real dream for her, she&#39;ll figure out what she <br/>\nneeds to get there and do it. <br/>\n<br/>\nMy favorite unschooling book isn&#39;t about unschooling or even parenting at <br/>\nall. It&#39;s called Wishcraft: How to Get What You Really Want, by Barbara Sher. <br/>\nI believe if we all just raised our kids that way everyone would be happier.<br/>\n<br/>\nKathryn<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":66563,"nextTopicId":66577}}