{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":265299176,"authorName":"katherand@gmail.com","from":"katherand@...","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: crying over not reading","postDate":"1240010082","msgId":44136,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRmOTg5NzE5MDQ3NmIxMjA0M2I4NTg4ZTQ5NWY2NmU2QGdtYWlsLmNvbT4=","inReplyToHeader":"PGdzYTlwZStyYWYwQGVHcm91cHMuY29tPg==","referencesHeader":"PGdzYTlwZStyYWYwQGVHcm91cHMuY29tPg=="},"prevInTopic":44125,"nextInTopic":0,"prevInTime":44135,"nextInTime":44137,"topicId":44016,"numMessagesInTopic":0,"msgSnippet":"... with him reading a book he is interested in and help him with whatever he wants/needs help with, but he justs gets frustrated because he needs my help so","messageBody":"<div id=\"ygrps-yiv-2074526205\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt; But what he can read, he finds inane and rediculous.  I will sit <br/>\n </span></blockquote>with him reading a book he is interested in and help him with whatever <br/>\nhe wants/needs help with, but he justs gets frustrated because he needs <br/>\nmy help so much. &lt;&lt;&lt;&lt;<br/>\n<br/>\nPeople here have some materials that are easier and yet not so bland.  <br/>\nI don&#39;t remember what the names of the story materials and books are <br/>\nbut I&#39;ve seen it from time to time.  You might want to post a separate <br/>\nthread to get some brainstorming going and generate a list of ideas.<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;&gt;&gt; He hasnt said anything about it since we left our friends house <br/>\n </span></blockquote>but he has asked to read to me more.  I will be more sensitive to the <br/>\nissue next time we go there. &lt;&lt;&lt;&lt;<br/>\n<br/>\nI absolutely agree.  Karl was only 4 when kids actually picked on him <br/>\nabout not being able to read.  Why would that be a good idea just <br/>\nbecause a kid is older?  Be on the alert because insensitivity about <br/>\nthese kinds of things is unfortunately rampant.  It&#39;s no wonder if <br/>\nunschooled kids become more sensitive while so many are as oblivious <br/>\n(or sometimes as mean) as ever.  You can&#39;t prevent every instance but <br/>\nonce someone or a group gets a reputation like that with me, we are <br/>\ndone seeing them for a while at least.<br/>\n<br/>\nI don&#39;t want Karl to believe that everyone in school knows how to read <br/>\njust because they&#39;re there.  Many kids throughout all my school years <br/>\ncopied from my papers.  I know for a fact they didn&#39;t feel confident.  <br/>\nI let Karl know that the kid in question (and the kid&#39;s siblings too <br/>\nfor that matter) had lots of difficulty in school and that&#39;s a big <br/>\nreason they&#39;re homeschooling now.  So he, being 5, is pretty empathetic <br/>\nwith them about that issue.  It makes him mad that they&#39;re not (that&#39;s <br/>\nwhat bothered him .... the meanness! which I haven&#39;t been able to <br/>\nexplain well) but at least Karl knows it&#39;s not him.<br/>\n<br/>\n~Katherine</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: crying over not reading","postDate":"1239988760","msgId":44125,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY0QUZGNTEyLThFNUQtNEFDNS04Mjk0LThGMTcyOUI0RDQwQUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGM3NjkxZTljN2I2MzQ0YTlmNzQ0Nzc3NmQ5ZjIxYmFmQGdtYWlsLmNvbT4=","referencesHeader":"PGdzOWViNCtlMnVxQGVHcm91cHMuY29tPiA8Yzc2OTFlOWM3YjYzNDRhOWY3NDQ3Nzc2ZDlmMjFiYWZAZ21haWwuY29tPg=="},"prevInTopic":44123,"nextInTopic":44136,"prevInTime":44124,"nextInTime":44126,"topicId":44016,"numMessagesInTopic":0,"msgSnippet":"-=-Reading kicked in for me around 8 years old. Then I read *all* the time for years after, starting with biographies.-=- I could read at six, but there wasn t","messageBody":"<div id=\"ygrps-yiv-1200129771\">-=-Reading kicked in for me around 8 years old. Then I read *all* the<br/>\ntime for years after, starting with biographies.-=-<br/>\n<br/>\nI could read at six, but there wasn&#39;t anything good to read.  I liked  <br/>\nscience books, but there weren&#39;t many of them.<br/>\n<br/>\nThen when I was nine, our 4th grade teacher used to bring books into  <br/>\nour classroom that belonged to the state library in Santa Fe.   We  <br/>\ncould read them in the room, and there was a series of biographies of  <br/>\nfamous Americans, and I read every one.  From that I got lots of  <br/>\nhistory and geography and details of cultural change and clash, and  <br/>\npolitics (Clara Barton&#39;s life) and race ( and science--George  <br/>\nWashington Carver) and industry (Henry Ford, The Wright Brothers,  <br/>\nThomas Edison).   It was probably all pro-American propaganda, but I  <br/>\nwas looking at the differences in all those lives, and how their  <br/>\ndecisions led to opportunities.   I read about Abraham Lincoln&#39;s wife  <br/>\nand children.   Then I started reading similar biographies of people  <br/>\nwho weren&#39;t necessarily American, and I think the web of my view of  <br/>\nhistory and geography came from placing those lives on the timeline in  <br/>\nmy head.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":222835102,"authorName":"Verna","from":"&quot;Verna&quot; &lt;lalow@...&gt;","profile":"lalow66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: crying over not reading","postDate":"1239984750","msgId":44123,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdzYTlwZStyYWYwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGM3NjkxZTljN2I2MzQ0YTlmNzQ0Nzc3NmQ5ZjIxYmFmQGdtYWlsLmNvbT4="},"prevInTopic":44120,"nextInTopic":44125,"prevInTime":44122,"nextInTime":44124,"topicId":44016,"numMessagesInTopic":0,"msgSnippet":"... I was 8 when I began reading too.  Once it clicked, it just did.  And I explained that to my son. Then I read *all* the ... My son loves books and stories","messageBody":"<div id=\"ygrps-yiv-236348398\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, katherand@... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Reading kicked in for me around 8 years old. <br/>\n<br/>\n </span></blockquote>I was 8 when I began reading too.  Once it clicked, it just did.  And I explained that to my son.<br/>\n<br/>\n Then I read *all* the <br/>\n<blockquote><span title=\"ireply\"> &gt; time for years after, starting with biographies.   How annoying reading <br/>\n&gt; circle was and how boring it was to keep up.  I just wanted it to be <br/>\n&gt; over.  Even after I figured out reading.   I had no interest in fiction <br/>\n&gt; then.  I wanted to know about real people which were nothing like those <br/>\n&gt; reading circle stories.  Some kids LIKE that genre.  I didn&#39;t.<br/>\n<br/>\n </span></blockquote>My son loves books and stories and books on tape.  He wants to read, and has lots of interests but one of the reasons he is so frustrated is what he wants to read is difficult for him.  But what he can read, he finds inane and rediculous.  I will sit with him reading a book he is interested in and help him with whatever he wants/needs help with, but he justs gets frustrated because he needs my help so much.<br/>\n<br/>\n<br/>\nHe hasnt said anything about it since we left our friends house but he has asked to read to me more.  I will be more sensitive to the issue next time we go there.</div>","specialLinks":[]},{"userId":265299176,"authorName":"katherand@gmail.com","from":"katherand@...","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: crying over not reading","postDate":"1239983376","msgId":44120,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM3NjkxZTljN2I2MzQ0YTlmNzQ0Nzc3NmQ5ZjIxYmFmQGdtYWlsLmNvbT4=","inReplyToHeader":"PGdzOWViNCtlMnVxQGVHcm91cHMuY29tPg==","referencesHeader":"PGdzOWViNCtlMnVxQGVHcm91cHMuY29tPg=="},"prevInTopic":44103,"nextInTopic":44123,"prevInTime":44119,"nextInTime":44121,"topicId":44016,"numMessagesInTopic":0,"msgSnippet":"Reading kicked in for me around 8 years old.  Then I read *all* the time for years after, starting with biographies.   How annoying reading circle was and how","messageBody":"<div id=\"ygrps-yiv-1843260399\">Reading kicked in for me around 8 years old.  Then I read *all* the <br/>\ntime for years after, starting with biographies.   How annoying reading <br/>\ncircle was and how boring it was to keep up.  I just wanted it to be <br/>\nover.  Even after I figured out reading.   I had no interest in fiction <br/>\nthen.  I wanted to know about real people which were nothing like those <br/>\nreading circle stories.  Some kids LIKE that genre.  I didn&#39;t.<br/>\n<br/>\nHere&#39;s one of the differences I&#39;m seeing in reading development.  It <br/>\nseems to me that unschooling children are often VERY interested in <br/>\nlearning to read.  Since reading isn&#39;t pounded into them to the point <br/>\nof boredom and hasn&#39;t worn off their interest in learning, the process <br/>\nof learning to read for many unschooling kids leads to anxiety for a <br/>\nwhile about not being able to.<br/>\n<br/>\nContrast that to kids in school.  If I&#39;m any indication, school <br/>\nchildren are NOT interested and in fact are bored by the whole scene.  <br/>\nThey don&#39;t generally seem to CARE when they learn to read.  I think if <br/>\na school child doesn&#39;t ever find something really enjoyable as a reason <br/>\nto read, that even after reading skill kicks in, some of them will <br/>\ncontinue to think reading is boring and recondite.<br/>\n<br/>\nI hope that parents who are unschooling aren&#39;t prejudicing reading.  <br/>\nThat it&#39;s somehow elite or special or difficult.  Reading isn&#39;t <br/>\ndifficult once a child has developed far enough along to put the pieces <br/>\ntogether *and* has a real purpose to be reading in the first place.  <br/>\nAnd reading all by itself *isn&#39;t* a purpose.<br/>\n<br/>\nI have a pretty good hunch that many unschooling children retain SUCH a <br/>\nhigh interest in learning that reading is a frequently painful process, <br/>\npartly because they might be under the misconception that school kids <br/>\nlearn to read faster.  Tell &#39;em it ain&#39;t so.  Compare unschooler&#39;s <br/>\nexperiences with reading to the experience of kids in school who are <br/>\ncompelled to do worksheets everyday and are more often copying from <br/>\ntheir neighbor.  Many kids weren&#39;t reading by the age I was.  One of <br/>\nthe ways nonreaders get by is to copy others.  (I actually don&#39;t think <br/>\nof this as cheating anymore but the natural way that people learn... by <br/>\nimitating those who know.  It happened in my schools from elementary <br/>\nthrough high school.  ;) )<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Apr 17, 2009, at 4:24 AM, Joanna Murphy wrote:<br/>\n<br/>\n&gt; There is a particular set of muscles in the eyes that have to do with <br/>\n&gt; tracking that develop at very different times, and a range of 4-12 is <br/>\n&gt; normal.  The article particularly talked about the ability to follow a <br/>\n&gt; finger moving along with the words.  I just had happened to read about <br/>\n&gt; this right after my 7 1/2 yo son and I were reading together.  I was <br/>\n&gt; moving my finger with the words and he asked me to stop doing that, <br/>\n&gt; that it was annoying.  When I read the article, that made perfect <br/>\n&gt; sense.<br/>\n&gt;<br/>\n&gt; I then just read aloud to him for the next year, and all of a sudden, <br/>\n&gt; right around 8 1/2, he asked me to move my finger along with the <br/>\n&gt; words.  We did that for a few nights and then he started reading <br/>\n&gt; chapter books.  He went through the Magic Tree House series, then the <br/>\n&gt; Secrets of Droon, and then all 6 (at the time) Harry Potter books.  <br/>\n&gt; Right now he doesn&#39;t read much fiction, but is a fine reader.<br/>\n&gt;<br/>\n&gt; He simply wasn&#39;t ready before then.  His body wasn&#39;t ready.  Maybe you <br/>\n&gt; could bring some non-reading games, or games that he already knows <br/>\n&gt; when he&#39;s getting together with kids that already read.  And you can <br/>\n&gt; arm him with some information about where he&#39;s at.  My daughter, by <br/>\n&gt; the way, was 9-9 1/2 when she really clicked.  Now her nose is <br/>\n&gt; frequently in a book--but the heavier interest is new at 10+.<br/>\n&gt;<br/>\n&gt; I would wonder if someone said something to him that made him feel <br/>\n&gt; stupid.  Maybe, maybe not.<br/>\n&gt;<br/>\n&gt; My daughter also went through a period of really, really wanting to <br/>\n&gt; read before her body was ready for her to be reading.  She would say <br/>\n&gt; that she wanted me to teach her how to read.  I would try showing her <br/>\n&gt; a tip or two, she wouldn&#39;t at all be able to integrate that <br/>\n&gt; information, and we would both drop it for 6 months or so.  That <br/>\n&gt; pattern went on until she really was ready to read.<br/>\n&gt;<br/>\n&gt; Joanna </span></blockquote></div>","specialLinks":[]},{"userId":294520986,"authorName":"Joanna Murphy","from":"&quot;Joanna Murphy&quot; &lt;ridingmom@...&gt;","profile":"ridingmom1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: crying over not reading","postDate":"1239956644","msgId":44103,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdzOWViNCtlMnVxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdzMHJrZithbzFhQGVHcm91cHMuY29tPg=="},"prevInTopic":44016,"nextInTopic":44120,"prevInTime":44102,"nextInTime":44104,"topicId":44016,"numMessagesInTopic":0,"msgSnippet":"There is a particular set of muscles in the eyes that have to do with tracking that develop at very different times, and a range of 4-12 is normal.  The","messageBody":"<div id=\"ygrps-yiv-696872445\">There is a particular set of muscles in the eyes that have to do with tracking that develop at very different times, and a range of 4-12 is normal.  The article particularly talked about the ability to follow a finger moving along with the words.  I just had happened to read about this right after my 7 1/2 yo son and I were reading together.  I was moving my finger with the words and he asked me to stop doing that, that it was annoying.  When I read the article, that made perfect sense.  <br/>\n<br/>\nI then just read aloud to him for the next year, and all of a sudden, right around 8 1/2, he asked me to move my finger along with the words.  We did that for a few nights and then he started reading chapter books.  He went through the Magic Tree House series, then the Secrets of Droon, and then all 6 (at the time) Harry Potter books.  Right now he doesn&#39;t read much fiction, but is a fine reader.<br/>\n<br/>\nHe simply wasn&#39;t ready before then.  His body wasn&#39;t ready.  Maybe you could bring some non-reading games, or games that he already knows when he&#39;s getting together with kids that already read.  And you can arm him with some information about where he&#39;s at.  My daughter, by the way, was 9-9 1/2 when she really clicked.  Now her nose is frequently in a book--but the heavier interest is new at 10+.<br/>\n<br/>\nI would wonder if someone said something to him that made him feel stupid.  Maybe, maybe not.<br/>\n<br/>\nMy daughter also went through a period of really, really wanting to read before her body was ready for her to be reading.  She would say that she wanted me to teach her how to read.  I would try showing her a tip or two, she wouldn&#39;t at all be able to integrate that information, and we would both drop it for 6 months or so.  That pattern went on until she really was ready to read.<br/>\n<br/>\nJoanna<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Verna&quot; &lt;lalow@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; this past weekend we spend a few days visiting a family friends.  their children all began reading early and read alot... so while we were there their kids (5,8 and 9) pulled out comic books often while we were there.  at one point the kids wanted to play clue.  my son (7) began to cry while they were playing.  i took him aside and he was saying he couldnt play, i offered to help but he just cried more.  we went upstairs to talk and he cried and cried that he cant read so he couldnt play the game and how upset he was that our younger son can read and he cant.  any suggestions?  I reassured him that he will and that we all develop at different rates and in different ways.  and we talked about the things he enjoys and does very well.<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":222835102,"authorName":"Verna","from":"&quot;Verna&quot; &lt;lalow@...&gt;","profile":"lalow66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"crying over not reading","postDate":"1239675343","msgId":44016,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdzMHJrZithbzFhQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":44103,"prevInTime":44015,"nextInTime":44017,"topicId":44016,"numMessagesInTopic":0,"msgSnippet":"this past weekend we spend a few days visiting a family friends.  their children all began reading early and read alot... so while we were there their kids","messageBody":"<div id=\"ygrps-yiv-1464604146\">this past weekend we spend a few days visiting a family friends.  their children all began reading early and read alot... so while we were there their kids (5,8 and 9) pulled out comic books often while we were there.  at one point the kids wanted to play clue.  my son (7) began to cry while they were playing.  i took him aside and he was saying he couldnt play, i offered to help but he just cried more.  we went upstairs to talk and he cried and cried that he cant read so he couldnt play the game and how upset he was that our younger son can read and he cant.  any suggestions?  I reassured him that he will and that we all develop at different rates and in different ways.  and we talked about the things he enjoys and does very well.</div>","specialLinks":[]}],"prevTopicId":44070,"nextTopicId":44071}}