{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Dumping toys","postDate":"1330797119","msgId":66001,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGppdGxuditwbGljQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGppdGVpbCsybHRzQGVHcm91cHMuY29tPg=="},"prevInTopic":66000,"nextInTopic":0,"prevInTime":66000,"nextInTime":66002,"topicId":66000,"numMessagesInTopic":0,"msgSnippet":"... *************** Personality is a big factor in how kids deal with money. Some like to save, some would rather have something - anything - right now than","messageBody":"<div id=\"ygrps-yiv-2111453626\">&quot;livwithroz&quot; &lt;livwithroz@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;We&#39;ve given them an allowance each week from which they&#39;ve learned a lot about money, saving and even Olivia learned it would be better for her to save and buy than borrow from me to buy now and pay it off!<br/>\n </span></blockquote>***************<br/>\n<br/>\nPersonality is a big factor in how kids deal with money. Some like to save, some would rather have something - anything - right now than save for something they&#39;d rather have. Some kids don&#39;t understand the idea of &quot;borrowing and paying back&quot; for a long time, and will feel as though mom is nice about money sometimes and mean about it other times - it doesn&#39;t necessarily teach what you&#39;d like them to learn. If you can afford to regularly give kids extra money then it may be better to simply increase their allowance. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Olivia has seen that Roz only plays with them briefly then is ready to buy something new. She&#39;s pointed this out to her too. Is it largely due to their difference in ages that Olivia sees that Roz is spending money and not really enjoying the toys?<br/>\n </span></blockquote>*******************<br/>\n<br/>\nIt&#39;s a personality thing - to the point that I&#39;d stay away from describing her as &quot;not really enjoying the toys&quot; unless she&#39;s getting things she doesn&#39;t really want because she doesn&#39;t have enough money to get what she&#39;d prefer. If that&#39;s the case, giving her more money would help her get what she actually wants. Alternately, if you can&#39;t afford to give her enough money all at once, and she has a hard time saving, you could try setting aside money for her and giving her big lump sums at longer intervals along with small amounts regularly (so maybe she&#39;d get $5 a week, but once a month would get $40 - not recommending those numbers, just using them as an example of what I mean). <br/>\n<br/>\nBut it is also possible that her interests are different - she doesn&#39;t Want to play with the same old toy week in and out, she likes novelty. That&#39;s a trait which is sometimes seen in a negative light, but the same sort of quality can lead people to be inventive or creative. I got into sewing my clothes because I didn&#39;t like wearing the Same Old clothes all the time - it was more interesting to make new things.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;They very often dump the toys to get what they want without putting the unused toys back which results in lots of things covering the floor.<br/>\n </span></blockquote>******************<br/>\n<br/>\nIt could help to keep a big blanket on the floor so you can scoop the toys up easily - or scoop up small things in a big dustpan. I use a dustpan for legos and small toys. <br/>\n<br/>\nAlso, are you organizing the toys as you put them back? Since they&#39;re dumping out bins anyway, it might be better to stop trying to organize things and just scoop. Use bigger bins, maybe. <br/>\n<br/>\nFor a while, Mo liked to dump out all her toys and Use the bins - they make good houses, boats, nests... but the result was that often all the bins were being used as something Other than bins. So I took a variation on one of Sandra&#39;s ideas and had some bins which were mine. If Mo wanted to use the bin, she needed to ask me, which gave me the chance to either say &quot;no, I&#39;m using that bin to store ribbon&quot; or find another place to stash the contents of the bin. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":470469093,"authorName":"livwithroz","from":"&quot;livwithroz&quot; &lt;livwithroz@...&gt;","profile":"livwithroz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Dumping toys","postDate":"1330789781","msgId":66000,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGppdGVpbCsybHRzQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":66001,"prevInTime":65999,"nextInTime":66001,"topicId":66000,"numMessagesInTopic":0,"msgSnippet":"I ve been unschooling my two girls, Roz (5) and Olivia (8), for a year and a half. We love it. They have a full array of toys, media and games from which to","messageBody":"<div id=\"ygrps-yiv-1435591039\">I&#39;ve been unschooling my two girls, Roz (5) and Olivia (8), for a year and a half. We love it. They have a full array of toys, media and games from which to learn. We&#39;ve given them an allowance each week from which they&#39;ve learned a lot about money, saving and even Olivia learned it would be better for her to save and buy than borrow from me to buy now and pay it off! Lately Roz has been saving and buying dolls and accessories. Olivia has seen that Roz only plays with them briefly then is ready to buy something new. She&#39;s pointed this out to her too. Is it largely due to their difference in ages that Olivia sees that Roz is spending money and not really enjoying the toys? It seems like Roz is super quick at looking for the new toy very shortly after the acquisition of a desired toy.<br/>\n<br/>\nMy second question has to do with dumping toys. Their toys are separated into boxes easily accessible on shelves. They very often dump the toys to get what they want without putting the unused toys back which results in lots of things covering the floor. It&#39;s overwhelming to them so I&#39;m either picking it up by myself or with their help. Is there a better way to handle this situation?</div>","specialLinks":[]}],"prevTopicId":65921,"nextTopicId":65984}}