{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Lynda","from":"&quot;Lynda&quot; &lt;lurine@...&gt;","profile":"anoydami","replyTo":"LIST","senderId":"cK3bo_7ht5YCYPufduLXTfSW2_QHTV_s-BRvAcXilZPFR-6co3p74AFSkPwBrEHAYACQUByGyrROS7c_ImWLlycXTg","spamInfo":{"isSpam":false,"reason":"0"},"subject":"forgotten history","postDate":"1004484626","msgId":27158,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxZGQwMWMxNjFhYiQwNDMyNmQwMCRhNDVkZDFkMUBqaWRhMzU+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":27157,"nextInTime":27159,"topicId":27158,"numMessagesInTopic":0,"msgSnippet":"FYI those who are interested in the history of Palestine. Lynda ========== Beginnings of the Conflict By Denis Mueller Theodore Herzl is considered the father","messageBody":"<div id=\"ygrps-yiv-643571266\">FYI those who are interested in the history of Palestine.<br/>\n<br/>\nLynda<br/>\n==========<br/>\n<br/>\n Beginnings of the Conflict<br/>\nBy Denis Mueller<br/>\n<br/>\nTheodore Herzl is considered the father of Zionism. He felt that Jews across<br/>\nthe world would always be susceptible to anti-Semitism as long as there was<br/>\nno Jewish State. At first, he looked at Argentina and then Uganda before<br/>\nsettling on Palestine for the Jewish homeland.<br/>\n<br/>\nArab nationalism was a simple idea. It was a search for long lost Arab<br/>\nidentities. For hundreds of years the Arabs had been under the occupation of<br/>\nthe Ottoman Empire. At the early part of the 20th century, there was a<br/>\npossibility for these two movements to co-exist. This is a story of that<br/>\nlost opportunity.<br/>\n<br/>\nAt the beginning of the 20th century, about a half a million Arabs lived in<br/>\nPalestine and about 50,000 Jews. The budding discontent within the Ottoman<br/>\nEmpire provided the new Zionist movement with its first real choice. Should<br/>\nthey work with the Arabs against the Turks and join the upcoming revolt or<br/>\nshould they try to acquire an international charter for a Jewish homeland?<br/>\nUnfortunately, the early Zionists sided with the Turks, but a small minority<br/>\nadvocated working with the Arabs.<br/>\n<br/>\nThe Arab leaders faced a dilemma of their own. Should they work with the new<br/>\nsettlers or oppose them? This is not as unusual as it sounds today. The<br/>\nearly deputies of Palestine spoke of the common Semitic heritage among the<br/>\ntwo people. But Jewish leaders felt that getting along with the Arabs was<br/>\nsecondary to the establishing of a Jewish homeland. What they needed was the<br/>\nhelp of a European state to help them establish a charter.<br/>\n<br/>\nAt first, Herzl went to the Sultan but the conversations went nowhere. Then,<br/>\nhe approached Kaiser Wilhelm who considered the idea briefly but the Kaiser<br/>\nwas rigid anti-Semite who eventually sided with the Turks. Finally, Herzl<br/>\nturned to the British who liked the idea because it was a way to extend the<br/>\nBritish control and protect the Suez Canal.<br/>\n<br/>\nNothing happened until the outbreak of the First World War. But the war<br/>\nopened the doors of opportunity for the Jewish State. In November of 1917,<br/>\nthe Zionists achieved their aim with announcing of the Balfour Declaration.<br/>\nThe reasons for the British decision are many; an effort to engage the<br/>\nUnited States in the war, the fear of a Bolshevik revolution and British<br/>\ninterests who saw this as a way to maintain a foothold in the Middle East.<br/>\n<br/>\nThe British also made a pact with France to divide the Middle East in<br/>\nspheres of influence. So the British had made three separate pledges. One<br/>\nwas the establishment of a Jewish state; the other was with France and the<br/>\nthird with the Arabs who they promised independence if they would fight on<br/>\nthe British side in WWI. All were in contradiction of each other.<br/>\n<br/>\nThe leader of the Arabs was Emir Faisel, who was fighting the Turks with the<br/>\nhopes of creating a great Arab kingdom; T.E. Lawrence, who was a British<br/>\nagent in Cairo aided him in this.  Lawrence was extremely anti-French and<br/>\nsaw the Arab Nationalist movement as a way to cheat the French and extend<br/>\nBritish control over the area. Faisel, for his part, was sympathetic with<br/>\nthe aims of a Jewish state. He felt it should be part of his great kingdom.<br/>\nIn a letter to Felix Frankfurter, he stated:<br/>\n<br/>\n&quot;We know the Arabs and Jews are racial relatives...We shall do everything we<br/>\ncan, as far as it depends on us, to assist the Zionist proposals by the<br/>\nPeace Conference, and we shall welcome the Jews with all our hearts on their<br/>\nreturn home.&quot;<br/>\n<br/>\nThis was no idle boost. Two months earlier, Faisel and Welzmann, under the<br/>\nguidance of Lawrence, had drawn up such a plan. The agreement never<br/>\nhappened. After the war, the French invaded Damascus and drove Faisel out of<br/>\nSyria. The Zionists were rewarded by the British and talk of a great Semite<br/>\nState disappeared. But the possibilities were there, it was a defining<br/>\nmoment that was missed, and the people of the Middle East have paid for it<br/>\never since.<br/>\n<br/>\nSources: Israel Without Zionism, Uri Avnery</div>","specialLinks":[]}],"prevTopicId":27146,"nextTopicId":27112}}