{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"a defense of the Rethinking Education conference","postDate":"1114651530","msgId":105678,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGE5LjcyNzUyYjA4LjJmYTE5NThhQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":105677,"nextInTime":105679,"topicId":105678,"numMessagesInTopic":0,"msgSnippet":"This was sent directly to the people to whom it is addressed, with a copy  to this list. The author joined the list specifically to send this, and so asking","messageBody":"<div id=\"ygrps-yiv-683863537\">This was sent directly to the people to whom it is addressed, with a copy  to <br/>\nthis list. <br/>\nThe author joined the list specifically to send this, and so asking her to  <br/>\nread for a week or two seems inappropriate, but approving a post does too.   So <br/>\nin a compromise move, I have stripped off the quoted posts and am  sending <br/>\nthe text of the message.<br/>\n <br/>\nWe don&#39;t need to discuss the particulars of a conference here.  Let&#39;s  stick <br/>\nto the philosophical differences and generalities, please. <br/>\n <br/>\nThanks, <br/>\nSandra<br/>\n(moderator, 1/3 listowner)<br/>\n <br/>\n<br/>\nA message has been sent to the UnschoolingDiscussion group  from<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:barb.lundgren@...\">barb.lundgren@...</a>  <br/>\n<br/>\n--------------------<br/>\nFROM: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:barb.lundgren@...\">barb.lundgren@...</a> <br/>\nDATE: Wed,  27 Apr 2005 18:21:32 -0500 <br/>\nSUBJECT: Not really unschoolers <br/>\n<br/>\nGreetings  Chris and Tuckerville,<br/>\n<br/>\nI saw each of your posts on this list and would  like to comment, as both the<br/>\nfounder and producer of the Rethinking Education  Conference series in Dallas<br/>\n(our next conference is coming up, visit  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.rethinkingeducation.com\">http://www.rethinkingeducation.com</a><br/>\nfor details) and a follower of TCS for  many years.  First, to address Chris&#39;<br/>\nmemory of a few years back in  which a child at the conference called 911<br/>\n(not once but twice!).  At no  point did I or other conference organizers<br/>\nexplain away the seriousness of  the incident as &quot;kids will be kids&quot;.  In<br/>\nfact, as soon as police showed  up in response to the 911 call, the organizer<br/>\nat the microphone (we were in  the middle of our Talent Show) asked for<br/>\nparents&#39; help in finding the culprit  and resolving the problem.  Many<br/>\nparents left the room immediately to  check on their children and a young boy<br/>\nadmitted to his father that he had  dialed 911, not having any idea that<br/>\npolice would show up, much less that it  was a felony to commit this act.<br/>\nThe father and mother both pulled the boy  aside and then addressed the<br/>\naudience with an apology.  After a  discussion with the police, it was<br/>\ndetermined that the act was not  malevolent, but innocent.  No charges were<br/>\nfiled and no further  incidents occurred.<br/>\n<br/>\nFurther, I don&#39;t have any reason to believe that a  TCS audience, child or<br/>\nfamily would permit a criminal, dangerous or felonious  act to be committed<br/>\nby their child.  Tuckerville in my estimation  misunderstands TCS philosophy<br/>\nwhen stating &quot;the child can flat out refuse to  consider anyone else&#39;s<br/>\nfeelings,  needs and desires, and the parent  would be philosophy-bound not<br/>\nto coerce them  in any way, regardless of  the direness of the situation.&quot;<br/>\nMy experience and study of TCS tells me that  while it is never appropriate<br/>\nto coerce a child to right action, a TCS parent  would never stand by to<br/>\nwitness a child engaged in activity dangerous to  himself or another.  The<br/>\nparent would be compelled to remove the child  from the situation, e.g., the<br/>\nclassic argument of the child running into a  busy highway.   This is a<br/>\ncrucial element of the philosophy not  often discussed, and in my personal<br/>\nexperience not an issue where TCS is the  standard, consistent parenting<br/>\nmodel.  <br/>\n<br/>\nIn my experience and  study of TCS, in families where the authoritarian model<br/>\nof parenting is being  replaced with a TCS model, there can be quite a lot of<br/>\nfluctuation in  behavior, both from the children and the parents, as everyone<br/>\nstruggles to  establish solidarity and reliability in communication style.<br/>\nAs a parent who  has raised three children, now grown, with a TCS approach<br/>\n(although frankly I  never knew there was a label for it, now known as TCS),<br/>\nI can attest to the  complete lack of motive a child has to rebel or act in<br/>\ndangerous behavior  when raised in an environment where his parents can<br/>\nALWAYS be trusted to give  their honest opinions,  give reliable information<br/>\non all subjects the  child is curious about, and both respected and trusted<br/>\nto make the best  decisions for both himself and others affected by his<br/>\ndecisions (all TCS  tenets).  A child raised in such an atmosphere seeks his<br/>\nparents&#39;  opinions and counsel and while he might not always follow the<br/>\nadvice, he  knows his decision will be respected.<br/>\n<br/>\nI have been a part of discussions  and debate on TCS for years, and I<br/>\nsympathize with the difficulty in  understanding it and putting it into play<br/>\n- it certainly is a radical  alternative from the traditional parenting model<br/>\nof &quot;do what I say because I  said so&quot;.  As far as I&#39;m concerned, TCS is a<br/>\nrevolutionary approach with  great promise.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":105663,"nextTopicId":105681}}