{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":779600,"authorName":"KathrynJB@aol.com","from":"KathrynJB@...","profile":"kathrynbeth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Gather &#39;round the wagons!","postDate":"1042670783","msgId":11727,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1Ny4xYTZhOTdmYy4yYjU3M2ViZkBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":11726,"nextInTime":11728,"topicId":11727,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/15/2003 10:40:05 AM Eastern Standard Time, ... Argh! I have a few ideas that MIGHT help.... Re: Damian and the Pooky Old School.... You","messageBody":"<div id=\"ygrps-yiv-739010301\">In a message dated 1/15/2003 10:40:05 AM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Okay, I need a little reality check.  ...alright, I need a BIG reality <br/>\n&gt; check.<br/>\n&gt; <br/>\n&gt; Here&#39;s the situation.<br/>\n&gt; I have two kids.  One is 16, Rachael, awesome (of course), who was in a <br/>\n&gt; &#39;progressive&#39; private school (her decision) until 8th grade, then a charter <br/>\n&gt; <br/>\n&gt; high for a few months, and is now unschooling her high school years.  The <br/>\n&gt; second kid, Damian is 13, in seventh grade at the same &#39;progressive&#39; <br/>\n&gt; private school in 7th grade (it goes to 8th), is dyslexic so he writes <br/>\n&gt; extremely slowly but loves the school for its Acivities (he&#39;s making <br/>\n&gt; chainmail at the moment) and his friends there.<br/>\n&gt; <br/>\n&gt; Damian was having a meltdown a few months back over homework he wasn&#39;t able <br/>\n&gt; <br/>\n&gt; to get done in time - and he was exhausted, it was late, etc, etc.  I wrote <br/>\n&gt; <br/>\n&gt; on his homework that I was not going to require him to do homework during <br/>\n&gt; family time and at Damian&#39;s request, wrote another note saying that this <br/>\n&gt; idea was mine, not Damians.  (He wanted the teacher to not get mad at <br/>\n&gt; him.)  I later confirmed with the teacher that life was okay with this <br/>\n&gt; decision and she made some murmurings about it being alright and that <br/>\n&gt; they&#39;d find a way to get the work done in school or something.<br/>\n&gt; <br/>\n&gt; I just found out how she&#39;s been getting her work done.<br/>\n&gt; <br/>\n&gt; She&#39;s been keeping Damian in during lunch EVERY SINGLE DAY to get his &#39;LATE <br/>\n&gt; <br/>\n&gt; WORK&#39; done.  He can&#39;t remember the last time he had a lunch free.  Every <br/>\n&gt; single day his friends from 7th and 8th grade have been gathering on the <br/>\n&gt; steps to chat, reconnect, plan after-school activities and eat their <br/>\n&gt; lunches... and Damian&#39;s been kept inside.  I just had a <br/>\n&gt; trying-to-be-nonchalant-but-not-very-effectively chat with the boy about it <br/>\n&gt; <br/>\n&gt; and he seems to feel that he NEEDS to do the homework because otherwise <br/>\n&gt; he&#39;s not going to learn anything and he wants to be successful with his <br/>\n&gt; life.<br/>\n&gt; <br/>\n&gt; I&#39;m about to scream with rage and frustration, not at the boy, but at the <br/>\n&gt; teacher and the stupid ficking society that says homework is more important <br/>\n&gt; <br/>\n&gt; than family, friends, activities and that if it&#39;s not done, a kid will be <br/>\n&gt; stupid and not have a good life.  Never MIND that it&#39;s costing an arm and a <br/>\n&gt; <br/>\n&gt; leg to keep him in the stupid fricking school too!<br/>\n&gt; <br/>\n&gt; I want to pull him immediately, even though it&#39;s his choice to BE at that <br/>\n&gt; school because that viewpoint is so whacked out I can hardly stand it.  I <br/>\n&gt; want to un-brainwash him!   I want an intervention!!!<br/>\n&gt; <br/>\n&gt; I want to honor his wishes to stay with his friends at the school, but I <br/>\n&gt; also don&#39;t know how much of that desire is prompted by the idea that if <br/>\n&gt; he&#39;s not &#39;taught&#39;, he won&#39;t learn anything, so he needs a &#39;teacher&#39;, <br/>\n&gt; complete with homework.<br/>\n&gt; <br/>\n&gt; Intending to bolster the argument about not needing homework and the joys <br/>\n&gt; of unschooling, I asked Rachael to talk about how she&#39;s doing with the <br/>\n&gt; unschooling thing and she said, &quot;I don&#39;t agree with having homework, but <br/>\n&gt; I&#39;m learning jack-shit.&quot;  Blew me out of the water.  Here&#39;s a bright, <br/>\n&gt; intelligent girl who can dye hair almost any color (usually a bright one), <br/>\n&gt; can build webpages, work with digital images, handle more than 5 chat rooms <br/>\n&gt; <br/>\n&gt; at a time, taught herself to knit, planned her own trip to Oregon on <br/>\n&gt; Amtrak, including paying for it... and all she can say is that she doesn&#39;t <br/>\n&gt; know geometry well enough.  I ask her why she thinks she&#39;ll need geometry <br/>\n&gt; and can&#39;t she brush up on it when she really needs it and she just <br/>\n&gt; shrugs.  Meanwhile her brother is sitting there just nodding his head, <br/>\n&gt; saying, &quot;see what I mean?&quot;<br/>\n&gt; <br/>\n&gt; ARGH!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!  I finally told them that they had <br/>\n&gt; blown me out of the water and I needed a little while alone to write to you <br/>\n&gt; <br/>\n&gt; guys and figure out what is going on (and maybe even get some suggestions <br/>\n&gt; on how to handle it.)  I also wasn&#39;t the coolest because I just went inside <br/>\n&gt; <br/>\n&gt; to find Rae with one of her unschooling buddies (my honorary second <br/>\n&gt; daughter) and I blew up, asking the buddy to explain to Rae how bright and <br/>\n&gt; intelligent she is and how few other kids would be able to manage to get <br/>\n&gt; themselves up to Oregon and back again successfully on their own, yadda, <br/>\n&gt; yadda, yadda.  I then proceeded to burst into tears.<br/>\n&gt; <br/>\n&gt; Way to stay cool, mom.<br/>\n&gt; <br/>\n&gt; So, any ideas?<br/>\n&gt; Heidi-the-blown-away-and-seriously-mind-ficked...<br/>\n&gt; Where is my Tahitian island when I need it?<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Argh! <br/>\nI have a few ideas that MIGHT help....<br/>\nRe: Damian and the Pooky Old School.... You say it&#39;s costing you $1000 a <br/>\nmonth to keep him in school...What about BRIBERY????  What if you offered him <br/>\nnot only the opportunity to do LOTS of cool Learny things, but also CASH? <br/>\nTell him you really believe school is bad for him, and that you also respect <br/>\nthat it needs to be his choice...but that you&#39;re willing to make it worth his <br/>\nwhile.  Might also be a good time to assign a little REQUIRED reading (LOL) <br/>\nto both kids....maybe Teeenage Liberation Handbook, or maybe actually pay for <br/>\na phone appointment with Grace Llewellyn?<br/>\n<br/>\nKids (and the rest of us) are bombarded by all those academic messages, and <br/>\nit&#39;s hard to overcome them. But if your daughter isn&#39;t learning anything (and <br/>\nmaybe she&#39;s not), it&#39;s HER responsibility. I assume you&#39;re willing to offer <br/>\nmost resources she wants.<br/>\n<br/>\nWhen I was a freshman in college I transferred from a plain old regular <br/>\ncollege to a cool hippy college. I was bored, and I figured if I went to the <br/>\ncool college and was bored (or certainly, not learning) it was my own fault. <br/>\nSame thing with unschooling.<br/>\n<br/>\nMaybe it would be good for your kids to connect with more unschooling (and <br/>\nhappy) kids? <br/>\n<br/>\nBy the way, my son is making chain mail too. Those rings remind one of the <br/>\nLeggo days, don&#39;t they? Almost as painful to step on.<br/>\n<br/>\nKathryn<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":11725,"nextTopicId":11726}}