{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":3381156,"authorName":"Ingrid Bauer/Jean-Claude Catry","from":"&quot;Ingrid Bauer/Jean-Claude Catry&quot; &lt;instinct@...&gt;","profile":"natural_wisdom2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] The use or not of labelling","postDate":"1036088896","msgId":48929,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxODMwMWMyODEwZCQxZDdmMTFhMCQwY2IxYjVkMEB3aW5kb3dzMms4d3pnbT4=","referencesHeader":"PDAxNWIwMWMyN2ZmNyQ0MzI4ZWI0MCQ0NjI2NTZkMkBocHBhdj4="},"prevInTopic":48736,"nextInTopic":0,"prevInTime":48928,"nextInTime":48930,"topicId":48691,"numMessagesInTopic":0,"msgSnippet":"... I really think there isn t an easy answer to this. You might want to look deeply into your heart andto your child to see. ask yourself: how will an answer","messageBody":"<div id=\"ygrps-yiv-1597477084\"><blockquote><span title=\"ireply\">&gt;&gt;He has never been formally evaluated and I can&#39;t quite put my finger on it, but I am quite sure if we should ever go the evaluation route, they will find a label for him. Off course I don&#39;t need a label for him, and since he is being homeschooled it won&#39;t make a difference going through life without a label, but some days I feel anxious that there might be some information that is essential to his well being, that I am not aware of, simply because I won&#39;t let him be evaluated.&gt;&gt; <br/>\n<br/>\n </span></blockquote>I really think there isn&#39;t an easy answer to this. You might want to look deeply into your heart andto your child to see. ask yourself: how will an answer to these questions change how i respond to my child? Will it have a negative or helful effect?<br/>\nYears ago, I would have written off all evalusionts/testing. But I&#39;ve watched two families really close to me, who also shared those views, change them through experience. Both had boys who were not reading, or showing any signs of learning to read after 12-13 years old. Both boys *wanted* to read--neither had any noticable other &quot;problems&quot;. <br/>\n<br/>\nAfter much soul searching, both boys/families opted for testing. <br/>\n<br/>\nOne was diagnosed with a very rare form of dyslexia. It was *really* helpful for this boy because, despite a very loving, supportive, unschooling family, he was becoming frustrated with himself and his inability to learn what came so easily for his siblings and was beginning to judge himself as &quot;stupid&quot; in a reading oriented family. He also could give himself permission to quit focusing on trying to read as it is unlikley he ever will read well, and he now has a computer that reads/writes for him and has learned some tricks that help him with some reading/writing skills. He is extremely comfortable with his situation now, speaks openly about it, easily asks for help without playing a victim role, is a very independent 19yo who will travel around the world starting next month, with money he earned himself. The thing here was that the family considered testing with much introspection and only when the boy&#39;s situation really pointed towards it--the boy himself also wanted it.<br/>\n<br/>\nSame with the other family. He had a lot of testing at about 15yo and finally a CAT scan picked up a type of unusual brain tumour. This was important medical info which may now help save his life from potential brain hemmorrhage--though he&#39;s already had one episode. Most people apparently only discover this kind of tumour when death is imminent.<br/>\n<br/>\nSo these are unusual and rare cases, that&#39;s for sure. i still feel extremely hesitant about testing/evaluating and I think those families would still agree. but in these 2 situations, life pointed strongly in that direction, they looked deeply into it and for them at that time, it was right. I think both familes are glad they waited until the child was older too, and could fully appreciate the nature of the beast.<br/>\n<br/>\nI&#39;ve also seen situations where dietary considerations made a huge difference when parents looked into that.<br/>\n<br/>\nwarmly,<br/>\ningrid<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":10294444,"authorName":"Myranda","from":"&quot;Myranda&quot; &lt;myrandab@...&gt;","profile":"randascloudream","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] The use or not of labelling","postDate":"1035999691","msgId":48736,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAyYzcwMWMyODAzZiQ4NDc4Y2YwMCQwMTNmZmVhOUBjb21wdXRlcj4=","referencesHeader":"PDAxNWIwMWMyN2ZmNyQ0MzI4ZWI0MCQ0NjI2NTZkMkBocHBhdj4="},"prevInTopic":48707,"nextInTopic":48929,"prevInTime":48735,"nextInTime":48737,"topicId":48691,"numMessagesInTopic":0,"msgSnippet":"After talking with two online friends who have sons who have been labeled ODD, I found that they both sounded exactly like my oldest son. So I researched ODD","messageBody":"<div id=\"ygrps-yiv-1331454677\">After talking with two online friends who have sons who have been labeled ODD, I found that they both sounded exactly like my oldest son. So I researched ODD online and at the library, and he &quot;matched&quot; every single one of their symptoms except one. DH and I talked for about two months about taking him to get evaluated, just for the fact that he would then be eligible for special therapy sessons. But we decided instead to use some of the ideas I&#39;d dug up online and see if they helped. They have, and about the only lingering thing he has is his anger. He still gets mad at the slightest thing and goes to his room and beats his bed. We&#39;re looking into ways of helping him deal with that now. <br/>\nMyranda<br/>\n<br/>\n  I&#39;ve noticed a few posts mentioning their children having some difficulties. My five year old has always had some difficulties - mostly it revolves around social anxieties and separation anxiety. I&#39;ve read a lot of books like the Spirited Child, the Out-of-sync-child and Dynamos, Discoverers and ... , and he fits into all of those.<br/>\n<br/>\n  He has never been formally evaluated and I can&#39;t quite put my finger on it, but I am quite sure if we should ever go the evaluation route, they will find a label for him. Off course I don&#39;t need a label for him, and since he is being homeschooled it won&#39;t make a difference going through life without a label, but some days I feel anxious that there might be some information that is essential to his well being, that I am not aware of, simply because I won&#39;t let him be evaluated. Obviously I only want to do what is best for him, but it feels like a bit of a Catch 22 situation.<br/>\n<br/>\n  My question is to those of you that have been through this - who either chose a formal evaluation or not, why did you choose or choose not to go that way??<br/>\n<br/>\n  Thanks for sharing some thoughts with me<br/>\n<br/>\n  Dalene<br/>\n<br/>\n<br/>\n  [Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n        Yahoo! Groups Sponsor <br/>\n              ADVERTISEMENT<br/>\n             <br/>\n              <br/>\n       <br/>\n       <br/>\n<br/>\n  ~~~~ Don&#39;t forget! If you change topics, change the subject line! ~~~~<br/>\n<br/>\n  If you have questions, concerns or problems with this list, please email the moderator, Joyce Fetteroll (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a>), or the list owner, Helen Hegener (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Editor@...\">HEM-Editor@...</a>).<br/>\n<br/>\n  To unsubscribe from this group, click on the following link or address an email to:<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-unsubscribe@yahoogroups.com\">Unschooling-dotcom-unsubscribe@yahoogroups.com</a> <br/>\n<br/>\n  Visit the Unschooling website: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> <br/>\n<br/>\n  Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":112038769,"authorName":"Shyrley","from":"&quot;Shyrley&quot; &lt;shyrley.williams@...&gt;","profile":"bobalinga","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] The use or not of labelling","postDate":"1035992684","msgId":48707,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIxMDMwMTU0MDI0Lk9TRFQ0NzQwLm91dDAwNS52ZXJpem9uLm5ldEBtYXJrc2NvbXB1dGVyPg==","inReplyToHeader":"PDAxNWIwMWMyN2ZmNyQ0MzI4ZWI0MCQ0NjI2NTZkMkBocHBhdj4="},"prevInTopic":48691,"nextInTopic":48736,"prevInTime":48706,"nextInTime":48708,"topicId":48691,"numMessagesInTopic":0,"msgSnippet":"... hi Dalene, Sorry for not snipping but I thought your post was relevant with an answer. Personally I see no value in going to a expert unless there are ","messageBody":"<div id=\"ygrps-yiv-747408862\">On 30 Oct 02, at 22:32, Dalene and Andy wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;ve noticed a few posts mentioning their children having some<br/>\n&gt; difficulties. My five year old has always had some difficulties -<br/>\n&gt; mostly it revolves around social anxieties and separation anxiety.<br/>\n&gt; I&#39;ve read a lot of books like the Spirited Child, the<br/>\n&gt; Out-of-sync-child and Dynamos, Discoverers and ... , and he fits into<br/>\n&gt; all of those.<br/>\n&gt; <br/>\n&gt; He has never been formally evaluated and I can&#39;t quite put my finger<br/>\n&gt; on it, but I am quite sure if we should ever go the evaluation route,<br/>\n&gt; they will find a label for him. Off course I don&#39;t need a label for<br/>\n&gt; him, and since he is being homeschooled it won&#39;t make a difference<br/>\n&gt; going through life without a label, but some days I feel anxious that<br/>\n&gt; there might be some information that is essential to his well being,<br/>\n&gt; that I am not aware of, simply because I won&#39;t let him be evaluated.<br/>\n&gt; Obviously I only want to do what is best for him, but it feels like a<br/>\n&gt; bit of a Catch 22 situation.<br/>\n&gt; <br/>\n&gt; My question is to those of you that have been through this - who<br/>\n&gt; either chose a formal evaluation or not, why did you choose or choose<br/>\n&gt; not to go that way??<br/>\n&gt; <br/>\n&gt; Thanks for sharing some thoughts with me<br/>\n&gt; <br/>\n&gt; Dalene<br/>\n&gt; <br/>\n&gt; <br/>\n </span></blockquote> hi Dalene,<br/>\nSorry for not snipping but I thought your post was relevant with an <br/>\nanswer.<br/>\nPersonally I see no value in going to a &#39;expert&#39; unless there are <br/>\nfreebies at the end of it. In the UK, &#39;labelled&#39; kids could get horse <br/>\nriding lessons or books on tape from the library without cost. <br/>\nVarious things. The so-called experts rarely provided anything new <br/>\nthat you couldn&#39;t have worked out for yourself and they never know <br/>\nyour child as well as you do. In fact, some of them can be down-<br/>\nright wrong. (I used to be a clinicla psychlogist and so have met <br/>\nthese people professionally. Most I wouldn&#39;t give the time of day <br/>\ntoo)<br/>\n<br/>\nYour child is only 5. It is normal for 5 yo&#39;s to have seperation <br/>\nanxiety. to be unsure in social situations and to have no control <br/>\nover their emotions. Are you comparing him to another 5 year old? <br/>\nThey are all different and all exhibit different charachteristics of <br/>\nbehaviour. Some 5 year olds will say Hi to a stranger. Some will <br/>\nnot. Some will play nicely with other children, some will not.<br/>\nMy son was &#39;diagnosed&#39; with Aspergers at 5 by a teacher and then <br/>\nthe school shrink. Instead of taking him to see a bunch of <br/>\nstrangers which would traumatise him further I changed the way I <br/>\ninteracted with him. I made eye contact. I didn&#39;t force him to talk to <br/>\nstrangers if he didn&#39;t want too. Now he will hug me spontaneously <br/>\n(he&#39;s now 9) and has lots of friends. You&#39;d hardly know he had a <br/>\nlabel.<br/>\n<br/>\nMy personal opinion is that you will gain nothing you didn&#39;t know by <br/>\npaying out for an &#39;expert&#39;, in fact it will probably increase your <br/>\nanxiety and his. Spend the next 5 years with him, watching him <br/>\nchange as he becomes older and then make the decision if you are <br/>\nstill anxious.<br/>\nUnless you can get freebies of course :-)<br/>\n<br/>\nShyrley<br/>\n<br/>\n&quot;You laugh at me because I&#39;m different. I laugh at you because you are all the same.&quot;</div>","specialLinks":[]},{"userId":80046248,"authorName":"Dalene and Andy","from":"&quot;Dalene and Andy&quot; &lt;mactier@...&gt;","profile":"mactiers","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"The use or not of labelling","postDate":"1035970346","msgId":48691,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxNWIwMWMyN2ZmNyQ0MzI4ZWI0MCQ0NjI2NTZkMkBocHBhdj4="},"prevInTopic":0,"nextInTopic":48707,"prevInTime":48690,"nextInTime":48692,"topicId":48691,"numMessagesInTopic":0,"msgSnippet":"I ve noticed a few posts mentioning their children having some difficulties. My five year old has always had some difficulties - mostly it revolves around","messageBody":"<div id=\"ygrps-yiv-193243574\">I&#39;ve noticed a few posts mentioning their children having some difficulties. My five year old has always had some difficulties - mostly it revolves around social anxieties and separation anxiety. I&#39;ve read a lot of books like the Spirited Child, the Out-of-sync-child and Dynamos, Discoverers and ... , and he fits into all of those.<br/>\n<br/>\nHe has never been formally evaluated and I can&#39;t quite put my finger on it, but I am quite sure if we should ever go the evaluation route, they will find a label for him. Off course I don&#39;t need a label for him, and since he is being homeschooled it won&#39;t make a difference going through life without a label, but some days I feel anxious that there might be some information that is essential to his well being, that I am not aware of, simply because I won&#39;t let him be evaluated. Obviously I only want to do what is best for him, but it feels like a bit of a Catch 22 situation.<br/>\n<br/>\nMy question is to those of you that have been through this - who either chose a formal evaluation or not, why did you choose or choose not to go that way??<br/>\n<br/>\nThanks for sharing some thoughts with me<br/>\n<br/>\nDalene<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":48907,"nextTopicId":48810}}