{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Lynda","from":"&quot;Lynda&quot; &lt;lurine@...&gt;","profile":"anoydami","replyTo":"LIST","senderId":"99AM6UM5jflrZdU0_X4grXzRN9z8aD3tFveeOw0TKA3st6BztNlzpqMXwS4RGEr96ZoUfZTTwwvihhkfuowf-1dmDA","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Fw: NEWS-ATTACKS ON RIGHTS GROUPS BECOMING MORE FREQUENT","postDate":"1005848066","msgId":27769,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxNTgwMWMxNmUwMSRmYTFjZDIyMCQ3ZTVkZDFkMUBqaWRhMzU+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":27768,"nextInTime":27770,"topicId":27769,"numMessagesInTopic":0,"msgSnippet":"Well, the police state has begun. Lynda ... FROM THE INDEPENDENT MEDIA CENTER The Green Party, the Independent Media Centers, and the Sierra Club have all been","messageBody":"<div id=\"ygrps-yiv-28103811\">Well, the police state has begun.<br/>\n<br/>\nLynda<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- <br/>\n<br/>\nFROM THE INDEPENDENT MEDIA CENTER<br/>\n<br/>\nThe Green Party, the Independent Media Centers, and the Sierra Club have all been acted upon by various parts of the state security apparatus in the last few days. &#39;Homeland Security&#39; is being used to investigate legal political dissent.<br/>\nGreen Party: Freedom of movement curtailed by U.S. armed forces. From Urbana-Champaign IMC<br/>\nUrbana, Nov. 3 (UCIMC): On Thursday, November 1, 2001, Green Party USA coordinating committee member Nancy Oden was searched and detained by National Guardsmen and airport security after being flagged by airport computers. She was then prohibited from flying on any airplane, on any airline from Bangor International Airport. She stated she had no idea what list she was on or, initially, why she was searched. Airport security refused comment; however, Ms. Oden stated that she allowed a thorough searching of her bags.<br/>\nIndymedia Centers: FBI contacts San Francisco Indymedia over server logs: Indymedia keeps none From Portland IMC<br/>\nThe Federal Bureau of Investigation (FBI) contacted volunteers from San Francisco Indymedia on Friday. Agent Chuck Esposito, from the Oakland FBI office, telephoned &quot;Espe&quot;, a volunteer who has worked with the SF Indymedia collective. Esposito indicated that the FBI is interested in reviewing Indymedia server logs. While an alleged criminal act is the stated reason for the inquiry, activists feel it is not beyond the pale to suspect that this contact is meant to intimidate individuals and organizations involved in legal political acvitity whose views are not popular with the government in the current climate of war-time repression. | Protecting your electronic rights<br/>\nSierra Club: Congress Pressures Sierra Club To Name ELF, ALF As Terrorists<br/>\nThis from our newswire: The House Subcommittee on Forests and Forest Health has sent a letter to the Sierra Club asking us to disavow the Earth Liberation Front and the Animal Liberation Front, calling them terrorist cells. We believe they have also sent copies of the letter to the press. Carl Pope will be the only spokesperson responding to any and all inquiries about this letter. Please forward every press call on this issue to Joanie Clayburgh, our Press Secretary in SF, at 415-977-5508. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]}],"prevTopicId":16303,"nextTopicId":27780}}