{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Sandra Brown","from":"&quot;Sandra Brown&quot; &lt;sbrown2@...","replyTo":"LIST","senderId":"X0ZUnZwbSPKcsQDmdXaYAyph4uZBGoI9YTrO3_ADCiNgfmweDzprZTDFVKqOl4Ot3VxQRLqegJzry62WtlhaHoLlHeSc3cGJ0_A-","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Waldorf Homeschooling conference","postDate":"935846055","msgId":2366,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4xNzUuMjM2Ni45NTkyNjk3NDFAZUdyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":2365,"nextInTime":2367,"topicId":2366,"numMessagesInTopic":0,"msgSnippet":"Hi Beth, ... I attended the first Waldorf Homeschooling conference and presented at the second.  I missed last year s due to recovering from a really difficult","messageBody":"<div id=\"ygrps-yiv-320941801\">Hi Beth,<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Also, Sandra, I recently received a brochure for a Waldorf Homeschool<br/>\n&gt;Conference in Oct.  Have you ever attended this, and if so what did you<br/>\n&gt;think?  When I began homeschooling it was partly because I wanted to send<br/>\n&gt;the girls to a Waldorf school but couldn&#39;t afford it and there wasn&#39;t one<br/>\n&gt;close enough.  Now that we&#39;ve been doing it awhile I&#39;ve moved away from<br/>\n&gt;Waldorf and toward unschooling.  It did look like they had some interesting<br/>\n&gt;and informative speakers and topics scheduled.<br/>\n<br/>\n </span></blockquote>I attended the first Waldorf Homeschooling conference and presented at the<br/>\nsecond.  I missed last year&#39;s due to recovering from a really difficult<br/>\nbirth.  This year&#39;s line up does look very interesting.  I am very surprised<br/>\nto see Pat Montgomery lined up as a key note speaker, because her philosophy<br/>\nof relaxed, child-led learning is in direct contrast to  the conservative<br/>\nWaldorf approach of teacher as repository of knowledge and culture.  Agaf<br/>\nDancy heatedly refuted student initiated learning in the elementary years at<br/>\nthe first WE conference, claiming the young child is not old enough or wise<br/>\nenough to know what is available for him to learn so he needs a teacher to<br/>\nexpose him to the world.<br/>\n<br/>\nAnyhow,  I personally discovered Waldorf methods when my just a few years<br/>\nago when my oldest was five, and it was amazing to me that what I was doing<br/>\nwith my children resembled Waldorf immensely.  I wanted to do a very<br/>\nholistic approach to life with my children, to keep them immersed in the<br/>\nnatural rhythms of nature, and show them as many crafts and arts as<br/>\npossible.  This is one of the things Steiner had in mind, and when I read<br/>\nhis Kingdom of Childhood most of what he said reminded me of John Holt.<br/>\nSteiner said he wanted the students to see shoemakers and every craft and<br/>\ntrade, and that the first Waldorf school was stunted by the teachers he had<br/>\nat the time.<br/>\n<br/>\nWhat we do in our home resembles &quot;unschooling&quot; more than Waldorf in that we<br/>\ndo not resemble a Waldorf school; I considered getting Waldorf teacher<br/>\ncertification and really immersed myself in the reading for about a year<br/>\nbefore deciding that the whole school set-up by necessity is limiting and<br/>\nnot representative of life and culture.  I felt that the curriculum of the<br/>\nschools did not take into account the individuality of each student, and<br/>\nalso felt at odds over the cost of tuition in Waldorf schools.  Education<br/>\nthat is not available to all is not of value to the entire society at large.<br/>\n<br/>\nI strongly feel that all of the debate over homeschooling in the elementary<br/>\nand secondary years is so misguided; we should all really be working for<br/>\nuniversal higher education.  The world would be a vastly different place if<br/>\neveryone could go to college/grad school and study and do what they want to<br/>\ndo, and contribute their God-given gifts towards a better world.<br/>\n<br/>\nSandra Brown<br/>\nAnn Arbor, MI</div>","specialLinks":[]}],"prevTopicId":2340,"nextTopicId":2367}}