{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":126884268,"authorName":"HMSL2@aol.com","from":"HMSL2@...","profile":"dobsiedoe","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Digest Number 5501","postDate":"1128699468","msgId":108788,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyZi42NzNiYmNhMS4zMDc3ZjA0Y0Bhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":108787,"nextInTime":108789,"topicId":108788,"numMessagesInTopic":0,"msgSnippet":"Denise, IMO your putting way too much pressure on your self. I have four children ages 18 months to 14. I do not count time spent with them that sounds a bit","messageBody":"<div id=\"ygrps-yiv-1431525654\">Denise,<br/>\n <br/>\nIMO your putting way too much pressure on your self. <br/>\nI have four children ages 18 months to 14. I do not count time spent with  <br/>\nthem that sounds a bit like focus on the educational stuff and not life. One day <br/>\n I may watch tv for an hour and other days none. My kids don&#39;t do the same <br/>\nthing  every day. I use my computer and sometimes will run down stairs to use <br/>\nthe one  in my room to print Ebay labels. That&#39;s the only time I can so I do. <br/>\nYour  children need to be happy but so do you. If you are unschooling IMO you <br/>\ndon&#39;t  need to sit on your kids or be there all the time.<br/>\n<br/>\n<br/>\n&lt;&lt;My dd went to ps in K, I unschooled her in 1st  grade,<br/>\nshe went to ps in 2nd and asked to be homeschooled<br/>\nagain, so we  unschooled last year and this is our 3rd<br/>\nyear, but 2nd in a row. My ds went  to p/t preschool<br/>\nfor 1 year, the year my dd was in 2nd grade and  hated<br/>\nit, so other than that we&#39;ve unschooled/been at home<br/>\ntogether  since his birth.&gt;&gt;&gt;&gt;<br/>\n<br/>\nMy son was in and out a couple times  in 3rd and 4th for 2 weeks. That&#39;s good <br/>\nthat you allowed that so everyone  knows where they want to be.<br/>\n<br/>\n&lt;&lt;Is your enthusiasm genuine? What  if I don&#39;t feel that?<br/>\nShould I just do it anyway? Will it just  happen<br/>\neventually? Do you think I shouldn&#39;t homeschool if I<br/>\ncan&#39;t feel  that kind of enthusiasm? Are they better<br/>\noff in  school?&gt;&gt;&gt;<br/>\n<br/>\nHere id say you either want to HS or not, sounds like you want to. Your  <br/>\nfeelings may change here and there and you will have days where you question  <br/>\nyourself. No one can tell you if your unfit to HS, no one is in your house or  <br/>\nknows you or your kids. If you think kids don&#39;t bicker or fight , they do, mine  <br/>\ndo. Ages and stages differ in each house. My 18 mo and 3 yr old are going  <br/>\nthrough a sharing stage, it&#39;s normal. My 14 yr old and almost 6 yr old bothered  <br/>\neach other for a couple years, it&#39;s finally leveling out. That too is normal. <br/>\nIf  you and I lived together there would be things that bugged both of us over <br/>\ntime.  That&#39;s normal..<br/>\nYou tried PS twice and didn&#39;t like it. Relax and have some fun with your  <br/>\nkids.<br/>\n<br/>\n<br/>\n<br/>\n&lt;&lt;Do your kids help you clean up after playing with  all<br/>\nthat? I can barely do the regular housekeeping (and<br/>\nwhat I do have  time to do housekeeping-wise is very<br/>\nminimal!) and whenever we do an art  project, I can&#39;t<br/>\nget the kids to help clean up. I&#39;ve explained to  them<br/>\nthat we would do more of this sort of thing if we<br/>\ncould clean up  together, as a team, but it doesn&#39;t<br/>\nseem to motivate them. Am I expecting  too much to ask<br/>\nthem for help?&gt;&gt;<br/>\n<br/>\nMine don&#39;t but when I ask  they generally do. I don&#39;t ask often bc they are <br/>\nusually engulfed in another  activity. As they get older they help more. If <br/>\nthey value something they move  it bc they know I don&#39;t always know what&#39;s trash <br/>\nand what isn&#39;t. My daughter  on any given day will whip out 10 drawings <br/>\nleaving 30 or so pieces of paper  and crayons. I pick those up sometimes asking for <br/>\nher help. Some days she say  no and others she helps it&#39;s all how I ask in the <br/>\nend.<br/>\nTelling them if they don&#39;t help there won&#39;t be fun more often to be had  <br/>\ndoesn&#39;t work. Kids think in the moment not ahead especially younger ones. I  think <br/>\nyour analyzing too much. Just go with life and it will all fall into  place.<br/>\n <br/>\n<br/>\n&lt;&lt;What do you think is enough? If I spent one hour a day<br/>\nwith  them on a project is that enough? Or does that<br/>\nnot even begin to be enough?  3 hours? more?<br/>\nCan you give me an idea of how much time you spend?<br/>\nWhat  happens when your own soul hasn&#39;t been<br/>\nreplenished and you&#39;ve got nothing  left to give?&gt;&gt;<br/>\nIMO an hour is long on one thing...That spills of perfection and finishing  <br/>\nsomething just because it was started. <br/>\nYou can&#39;t put a timer on unschooling.. that&#39;s my opinion.. 3 hours doing  <br/>\nwhat? that sounds like a long time..  <br/>\nSome days my kids watch tv, use the computer and play outside. I&#39;m here but  <br/>\nthey don&#39;t seek me out all day everyday. I think your being too hard on your  <br/>\nself. My almost 6 yr old has been unschooled all along. No sitters, no <br/>\npreschool  and no lessons. Yesterday she asked me how to spell dinosaur. She  wrote <br/>\nthat along with some drawings and was quite impressed that she  did that. She <br/>\nis quite interested in dinosaurs. When daddy go home she told  him and showed <br/>\nhim. That wasn&#39;t all she told him but the one that stuck in my  mind bc of her <br/>\nexcitement. That&#39;s an educational looking example and all i could  think of in <br/>\nthe moment. She&#39;s in a cast from a trampoline ankle twist (may or  may not be <br/>\nbroken they cant tell) so she&#39;s not as mobile..<br/>\n <br/>\nNicholas 3 played in a pile of dirt I cleaned up in the driveway. He loves  <br/>\nbugs. Ants were yesterday&#39;s interest on top of Jay Jay on the computer and Dora <br/>\n and Diego (sp) on Nick. We went to the post office, sealed packages from  <br/>\nEbay sales.<br/>\n <br/>\nDustin 14 played Runescape,rode his bike,played with his friends and cooked  <br/>\nbrownies with the kids and I.<br/>\nThings are not perfect and pretty all day esp with several children. I used  <br/>\nto think they were in other homes too. Life is not perfect. Kids fall, people  <br/>\nget sad,hungry,tired and happy. It&#39;s all in how you look at the glass 1/2 <br/>\nempty  or 1/2 full.<br/>\nImagine the emotions and situations your kids would go through in school.  At <br/>\nhome you are there to help them in school they are alone to deal. Home sounds <br/>\n better. It will get better as they get older.<br/>\n<br/>\n<br/>\n<br/>\n&lt;&lt;I&#39;m happy to announce to you all that I&#39;ve  been<br/>\nwatching some T.V. with them, including Cyberchase and<br/>\ntalking with  them about it. Does it count if I bring<br/>\ncarrots to peel with me etc... to  do while I watch?<br/>\nAlso, I played with them with a huge box of  popscicle<br/>\nsticks for a while and they had a blast with that. We<br/>\nbuilt a  city on our dining room table. But eventually<br/>\nI had to leave to cook dinner  and they continued, I<br/>\nonly spent about 1/2 an hour.&gt;&gt;<br/>\n<br/>\nThat  sounds great! Why can&#39;t your bring carrots? I&#39;d say if you couldn&#39;t <br/>\nbring  carrots that your life wasn&#39;t fair for you. I&#39;d be stressed if I didn&#39;t do <br/>\n what i needed to work around the kids to get normal daily house stuff done. <br/>\nI  don&#39;t make them wait to go somewhere while I do laundry I do it while they <br/>\nare  interested in something. Much like going to the bathroom everyone has <br/>\nneeds  and no one should feel they cannot reasonably reach their  goals.<br/>\n<br/>\n<br/>\nHonestly IMO I think you posting shows your interest in HS&#39;ing and wants to  <br/>\nwork at being a better parent. I think your putting too much pressure on  <br/>\nyourself to be perfect. If know your kids and talk to them they will guide  you.<br/>\n <br/>\nLaura<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":108742,"nextTopicId":108789}}