{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":0,"authorName":"LifesLearn@xxx.xxx","from":"LifesLearn@...","replyTo":"LIST","senderId":"5yyfCw6xCbleWSdmq444pydXHlyfJBWnrPn97B5-HBRvDl-Wu4M1jKM-ETAhS3Wh846vhEUr7ZuS","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: weakening child-mother bond","postDate":"942336030","msgId":4430,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4yOTIuNDQzMC45NTkyNjk3NDNAZUdyb3Vwcy5jb20+"},"prevInTopic":4417,"nextInTopic":0,"prevInTime":4429,"nextInTime":4431,"topicId":4417,"numMessagesInTopic":0,"msgSnippet":"In a message dated 11/10/1999 11:26:32 PM !!!First Boot!!!, tn-k4of5@if.rmci.net writes: ","messageBody":"<div id=\"ygrps-yiv-1494176823\">In a message dated 11/10/1999 11:26:32 PM !!!First Boot!!!, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:tn-k4of5@...\">tn-k4of5@...</a> writes:<br/>\n<br/>\n&lt;&lt; Not only were the schools<br/>\n larger and had longer hours, but they were more strict.  50+ kids in a<br/>\n class (even 5 year olds) all reciting in unison, sitting with their hands<br/>\n folded in their desks, in their starched uniforms, etc.  &gt;&gt;<br/>\n<br/>\n    This sounds like a program for assembly line conformists. I immediately <br/>\nthought that it is a good thing that Hitler did not know of this. How sad.<br/>\n<br/>\nBlessings,<br/>\nStephanie<br/>\nTeacher and Mommy of 4 homeschooling fanatics, wife to the best principal, <br/>\nprotector of many pets and wild ones, and unpublished writer.<br/>\n       I think that I will move closer to the gym, that way between sets,<br/>\n       I can run home and eat something sweet to keep up my energy! s.<br/>\n    Believe in others, and be a part; believe in yourself, and be the lead. s.<br/>\n            ***Life&#39;s Learnings Academy - Protecting Our Children***<br/>\n        IT&#39;S GREAT TO LEARN WHERE THE PRINCIPAL LOVES YOU<br/>\n                           ICQ: 43428000     AOL IM: Lifeslearn</div>","specialLinks":[]},{"userId":0,"authorName":"Thomas and Nanci Kuykendall","from":"Thomas and Nanci Kuykendall &lt;tn-k4of5@...","replyTo":"LIST","senderId":"efjY8y0HbWEpRlhMf4kA9Cl2FHuVM_xFadv3e7hT4oGGpB9lSwLaJa1X8vT8yc6w1QmP2r2mMHadF2L1s3CD4dtFUS9Znx8URlCSTudD_TCH4yNTI2eI9rA","spamInfo":{"isSpam":false,"reason":"0"},"subject":"weakening child-mother bond","postDate":"942256599","msgId":4417,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4yOTAuNDQxNy45NTkyNjk3NDNAZUdyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":4430,"prevInTime":4416,"nextInTime":4418,"topicId":4417,"numMessagesInTopic":0,"msgSnippet":"found peers ... I think we have had the discussion before onthis list abuot schooling for young children causing peer dependence and a drift from the family?","messageBody":"<div id=\"ygrps-yiv-1306226275\">found peers<br/>\n<blockquote><span title=\"ireply\"> &gt;to be a greater influence than parents.  Gee, could this be because<br/>\n&gt;children enrolled in school and numerous activities rarely see their<br/>\n&gt;parents?  Oh, I forgot about all that quality time spent in the car<br/>\n&gt;driving to and from all those activities!<br/>\n&gt;Mary Ellen<br/>\n&gt;Thanks.  I needed that.<br/>\n<br/>\n<br/>\n </span></blockquote>I think we have had the discussion before onthis list abuot schooling for<br/>\nyoung children causing peer dependence and a drift from the family?  At any<br/>\nrate, you end up with kids who do not have a strong connection to their<br/>\nimmediate families and who spend more time every day with their peers,<br/>\ntherefor having more emoitonal dependence upon the approval of their peers.<br/>\n<br/>\nI recently watched a program created by Wash. state first lady Mrs. Gov.<br/>\nLocke about education in China.  She has a young child and is a Chinese<br/>\nAmerican, so she took a group of educators from various fields (day care,<br/>\nPS, Elemenatary, Private Primary, Music teachers, etc) from Wash. state on<br/>\na tour of Chinese educational facilities, etc.  Not only were the schools<br/>\nlarger and had longer hours, but they were more strict.  50+ kids in a<br/>\nclass (even 5 year olds) all reciting in unison, sitting with their hands<br/>\nfolded in their desks, in their starched uniforms, etc.  They also focused<br/>\non more arts and sciences as required subjects and expected (and got) much<br/>\nmore from much younger children than we do in the US.  This is all cultural<br/>\nof course.  The large population necessitaites larger groups, and the<br/>\nprimary cultural concern with raising competitive workers pushes parents to<br/>\npush their children.  Kids are expected to be in after school programs, in<br/>\nor outside of school, that push arts and music, everything from classical<br/>\nChinese instruments and calligraphy to modern western forms like jazz, tap,<br/>\nballroom danicing, saxaphone and piano.  When having kindergarteners paint,<br/>\na teacher paints a picture and puts it on the board, and the children must<br/>\nemmulate it as closely as possible.  50+ 5 year olds all painting the same<br/>\npicture.  <br/>\n<br/>\nThat is the public schools, private schools have higher expectations.  The<br/>\nstate runs kindergarten boarding schools, which function much like private<br/>\nschools here, in that the families must pay more money to send their<br/>\nchildren there.  Kindergarten in China is from age 3 to age 8.  The<br/>\nchildren (3 and up) attend all week and go home with their parents on the<br/>\nweekends.  They sleep in rooms crowded with little beds (literally wall to<br/>\nwall, you could roll across the room on the beds) and have a heavy class<br/>\nschedule including academics, calasthenic (sp?) drills, music and arts, and<br/>\nscheduled &quot;free play&quot; time.  Talk about peer dependence and severing the<br/>\nparental child bond!  The kids are kept in line in all the schools by the<br/>\nthreat of being shamed in front of their peers and &quot;losing face&quot; in front<br/>\nof the teachers.<br/>\n<br/>\nThe key and goal for China is to have a cohesive, cooperative force of<br/>\nworkers who are accomplised in various skills and can compete in the<br/>\ncompetitive world market.  It puts things really in perspective when you<br/>\nlook at two important facts.  1) Family is of Primary importance to the<br/>\nChinese, who revere their elders and cherise their children, and 2) The<br/>\nChinese are only by law allowed to have one child.  These parents are<br/>\nsacrificing their time with their only child in order to help them &quot;get<br/>\nahead&quot; early.  They would most likely laugh at our concerns with autonomy<br/>\nand self direction, spiritual growth and emotional wholeness.  They would<br/>\nprobably feel sorry for our children because they would think they would<br/>\nnot be on the cutting edge and would not keep up in the rat race.  <br/>\n<br/>\nHowever, it has been my experience that no matter what age kids learn<br/>\nthngs, it all evens out according to ability and inclination when they get<br/>\nto be adults.  As long as they have ample opportunites to be exposed to<br/>\nart, literature and sciences, as well as more basic skills, and are in a<br/>\nsupportive and healthy environment, kids will take what they want and leave<br/>\nthe rest.  This is regardless of whether they are in IS, boarding school,<br/>\nHomeschooled, etc.  Can you tell by someone&#39;s handwriting how early they<br/>\nlearned to read and write as a child?  Does preschool music class show in<br/>\nthe adult?  Does a good GPA in gradeschool mean anything in your adult life?<br/>\n<br/>\nAnyway, just thought this discussion on bonding was in the realm of the<br/>\nprogram I watched and I wanted to share.<br/>\n<br/>\nNanci K.</div>","specialLinks":[]}],"prevTopicId":4428,"nextTopicId":4431}}