{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Food and Anxiety","postDate":"1264395282","msgId":49992,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ5MjQ1NS43OTIyMC5xbUB3ZWI4MTUwNC5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PGU2OGY4YWExMDAxMjQyMDA0aTNlODUzMmNkcmQyOTdiM2Q1MWVmNzNiNzhAbWFpbC5nbWFpbC5jb20+","referencesHeader":"PGhqaHJqNitjMGtnQGVHcm91cHMuY29tPiAgPDg5NTY0Ny4zNzI3NC5xbUB3ZWIxMTA0MDYubWFpbC5ncTEueWFob28uY29tPiA8ZTY4ZjhhYTEwMDEyNDIwMDRpM2U4NTMyY2RyZDI5N2IzZDUxZWY3M2I3OEBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":49990,"nextInTopic":0,"prevInTime":49991,"nextInTime":49993,"topicId":49677,"numMessagesInTopic":0,"msgSnippet":"I really like the story about Bernadette s daughter and how she wanted to eat what she needed due to her condition and how the parents did  not know about the","messageBody":"<div id=\"ygrps-yiv-209990674\">I really like the story about Bernadette&#39;s daughter and how she wanted to eat what she needed due to her condition and how the parents did  not know about the condition.<br/>\nMaybe worth repeting ??<br/>\nor did Sandra save it somewhere??<br/>\n <br/>\nAlex Polikowsky<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":221591978,"authorName":"Bernadette Lynn","from":"Bernadette Lynn &lt;bernadette.lynn@...&gt;","profile":"bwalyalynn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Food and Anxiety","postDate":"1264392274","msgId":49990,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU2OGY4YWExMDAxMjQyMDA0aTNlODUzMmNkcmQyOTdiM2Q1MWVmNzNiNzhAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PDg5NTY0Ny4zNzI3NC5xbUB3ZWIxMTA0MDYubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PGhqaHJqNitjMGtnQGVHcm91cHMuY29tPgkgPDg5NTY0Ny4zNzI3NC5xbUB3ZWIxMTA0MDYubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":49962,"nextInTopic":49992,"prevInTime":49989,"nextInTime":49991,"topicId":49677,"numMessagesInTopic":0,"msgSnippet":"... Diet CAN play a part in that, but not necessarily - my daughters appalling eczema was caused by the eczema treatments, and initially triggered by nappy ","messageBody":"<div id=\"ygrps-yiv-622568247\">On 24 January 2010 22:42, Jenny Cyphers &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jenstarc4@...\">jenstarc4@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; ***Conventional medicine has come up short, so we&#39;ve been looking for other<br/>\n&gt; ways to get relief. It&#39;s all been a big waste of time and LOTS of money. So<br/>\n&gt; yeah, I agree with you, they&#39;re just experiments. ***<br/>\n&gt;<br/>\n&gt; --Let everything that isn&#39;t actually life-threatening go.--<br/>\n&gt;<br/>\n&gt; Excema is really hard to deal with because of the pain and irritation!  I<br/>\n&gt; can see why you&#39;d want to try everything to get it to go away.  I know from<br/>\n&gt; experience that diet DOES play a role in that.<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Diet CAN play a part in that, but not necessarily - my daughters appalling<br/>\neczema was caused by the eczema treatments, and initially triggered by nappy<br/>\nrash cream. I deprived myself of things when I was feeding her and was told<br/>\nseveral times later to put her on an exclusion diet but didn&#39;t. I was glad,<br/>\nonce we realised her allergies weren&#39;t food related after all.<br/>\n<br/>\nShe also didn&#39;t seem to have much energy and wasn&#39;t interested in anything<br/>\ninvolving sustained movement and wanted to eat and drink rich sweet food all<br/>\nthe time but that has all changed since her heart condition was fixed.<br/>\nSometimes (maybe usually?) a lack of available energy can be what prompts a<br/>\nchild to eat energy-rich food.<br/>\n<br/>\n<br/>\nBernadette<br/>\n-- <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.bbc.co.uk/dna/h2g2/U15459\">http://www.bbc.co.uk/dna/h2g2/U15459</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Food and Anxiety","postDate":"1264372976","msgId":49962,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg5NTY0Ny4zNzI3NC5xbUB3ZWIxMTA0MDYubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PGhqaHJqNitjMGtnQGVHcm91cHMuY29tPg==","referencesHeader":"PGhqaHJqNitjMGtnQGVHcm91cHMuY29tPg=="},"prevInTopic":49947,"nextInTopic":49990,"prevInTime":49961,"nextInTime":49963,"topicId":49677,"numMessagesInTopic":0,"msgSnippet":"***Conventional medicine has come up short, so we ve been looking for other ways to get relief. It s all been a big waste of time and LOTS of money. So yeah, I","messageBody":"<div id=\"ygrps-yiv-1463219289\">***Conventional medicine has come up short, so we&#39;ve been looking for other ways to get relief. It&#39;s all been a big waste of time and LOTS of money. So yeah, I agree with you, they&#39;re just experiments. ***<br/>\n<br/>\n--Let everything that isn&#39;t actually life-threatening go.--<br/>\n<br/>\n***OK. I&#39;m exhausted. You know, our day-to-day lives are really pretty nice, but writing the above has focused all my attention on our difficulties. It makes me sad and tired, and it makes me not want to add to them.***<br/>\n<br/>\nExcema is really hard to deal with because of the pain and irritation!  I can see why you&#39;d want to try everything to get it to go away.  I know from experience that diet DOES play a role in that.  Here&#39;s the thing though... peace and calm play a part, probably a bigger part, in overall health.  So, if he were my child, I&#39;d let him eat what he wanted and have many alternatives around as well to choose from.  <br/>\n<br/>\nMy youngest daughter is sensitive to the world in general, she just is.  From the time she was tiny, I knew that dairy made everything more intense.  That made sense to me since there is a huge genetic component to that.  There are a lot of people in my family that can&#39;t eat dairy.  When she was little, we just didn&#39;t offer it as a choice.  That was easy to do, but as she grew and noticed differences, she wanted to try what sister had or what that other person had.  She would try and eat and sometimes get sick and sometimes it wouldn&#39;t bother her as much.  Over the years she&#39;s learned the limit her body can take through trial and error.  She seems to be bothered by similar foods that bother my body, but she can freely avoid or partake in them.  The key was to have many alternatives.  We always have both corn and flour tortillas and both dairy and non dairy cheese and ice cream, etc.  More often than not, she choose the alternative, with<br/>\n only occasional tastes of the other, except for chocolate, she&#39;ll eat that in any form it comes in.<br/>\n<br/>\nMy hope is that because she can freely choose, that she won&#39;t get to be old like me and not be able to eat any of those things at all without getting severly sick.  Since she&#39;s never been forced to eat things she doesn&#39;t want and told that she can&#39;t eat things that she does want, she not going to be reactionary in her choices, she&#39;ll continue to eat just as much as her body will let her and not a bit more or less. <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Food and Anxiety","postDate":"1264352795","msgId":49947,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk4QTJBODlBLTYzMDItNENENS1CNjdGLUI0OTBBNTVFMEU2QUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhqaHJqNitjMGtnQGVHcm91cHMuY29tPg==","referencesHeader":"PGhqaHJqNitjMGtnQGVHcm91cHMuY29tPg=="},"prevInTopic":49945,"nextInTopic":49962,"prevInTime":49946,"nextInTime":49948,"topicId":49677,"numMessagesInTopic":0,"msgSnippet":"-=- Oh yeah, and I haven t yet mentioned that he has asthma and eczema. The asthma isn t too bad, but the eczema... basically he s been itchy for the past 12","messageBody":"<div id=\"ygrps-yiv-760871913\">-=-<br/>\nOh yeah, and I haven&#39;t yet mentioned that he has asthma and eczema.  <br/>\nThe asthma isn&#39;t too bad, but the eczema... basically he&#39;s been itchy  <br/>\nfor the past 12 years, which more than anything else has tormented  <br/>\nhim, and therefore us. He&#39;s aleady on the strongest conventional meds  <br/>\nand ointments and creams, but they don&#39;t help enough, and they don&#39;t  <br/>\nheal anything. When the elimination/rotation diet was first suggested  <br/>\nto us, it was mainly to deal with allergies and eczema. Yeah, and  <br/>\nautism symptoms too (we&#39;ve been told they&#39;re all related), but  <br/>\nwhatever personality quirks he has are nothing compared to the  <br/>\nitching, scratching, bleeding, doctors, frustration. Conventional  <br/>\nmedicine has come up short, so we&#39;ve been looking for other ways to  <br/>\nget relief. It&#39;s all been a big waste of time and LOTS of money. So  <br/>\nyeah, I agree with you, they&#39;re just experiments. -=-<br/>\n<br/>\nI had itching, scratching, bleeding eczema as a kid, in the bends of  <br/>\nmy arms and the backs of my knees.  There&#39;s a photo of me at two or  <br/>\nthree with my arms wrapped in gauze.  I was taken to doctors, and they  <br/>\ntold my mother I was allergic to nylon and chocolate, so I was  <br/>\ndeprived and wore ugly cotton panties when the other girls had cute  <br/>\nnylon ones, and everyone else ate chocolate and I was given those  <br/>\nalmond windmill cookies.   Years of not-fun.  Soap... no soap, the  <br/>\ndoctor said.  Only bath oil.  So I had and liked Avon Skin-so-Soft.<br/>\n<br/>\nAs I got old enough to figure out more for myself what was and wasn&#39;t  <br/>\nhelping, I noticed that it was worse in the summer, and in the coldest  <br/>\nparts of winter.  WHY?  After a few years of trying to pay attention  <br/>\nto what helped and didn&#39;t help, I have a theory.  It might or might  <br/>\nnot help in this or other cases.<br/>\n<br/>\nI was allergic to my own sweat, basically.  In summer I sweated and  <br/>\nbroke out and the sweat  made it worse and it couldn&#39;t get well.<br/>\nIn winter when it was really cold and I was bundled up, I sweated.<br/>\n<br/>\nBut worse than that, I didn&#39;t bathe enough.  We had no shower.  We had  <br/>\none bathroom for six people, most of my life, and a bathtub, not a  <br/>\nshower.   When I was really little and it all started, we didn&#39;t have  <br/>\na tub OR a shower.  `We bathed in a #2 washtub (round galvanized tub),  <br/>\nand not often enough.<br/>\n<br/>\nIf someone&#39;s not washing much and then the doctor says to stop using  <br/>\nsoap, putting oil on the skin keeps in whatever  bacteria was already  <br/>\nthere.<br/>\n<br/>\nIf there&#39;s a child who doesn&#39;t love showers or baths, find water-play  <br/>\nopportunities somehow, maybe.<br/>\n<br/>\nAnd it turned out chocolate was nothing at all to all that, but the  <br/>\ncotton/nylon stuff had merit.  Cotton absorbed sweat; nylon created  <br/>\nand held sweat.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":241447822,"authorName":"thecugals","from":"&quot;thecugals&quot; &lt;thecugals@...&gt;","profile":"thecugals","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Food and Anxiety","postDate":"1264349606","msgId":49945,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhqaHJqNitjMGtnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDRCNTM5OTc0LjMwMTAzMDBAbWFjLmNvbT4="},"prevInTopic":49677,"nextInTopic":49947,"prevInTime":49944,"nextInTime":49946,"topicId":49677,"numMessagesInTopic":0,"msgSnippet":"... --Have you found ways to get more active?-- I m sure this contributed to our anxiety about his weight (ugh--always fear and anxiety).  Most of his exercise","messageBody":"<div id=\"ygrps-yiv-912686595\"><blockquote><span title=\"qreply\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Pam Sorooshian &lt;pamsoroosh@...&gt; wrote:<br/>\n<br/>\n--Have you found<br/>\nways to get more active?--<br/>\n<br/>\nI&#39;m sure this contributed to our anxiety about his weight (ugh--always fear and anxiety).  Most of his exercise comes from hopping around the house or the yard.  We go on walks whenever the weather is nice enough, go to the park, sled when there&#39;s enough snow on the ground, and swim in the summer.  But in general he is not very active.  He doesn&#39;t have very good coordination or balance, doesn&#39;t care for sports, doesn&#39;t run, tires easily, not interested in Wii, except for bowling a little bit, can&#39;t ride a bike yet...  You know, I&#39;m getting tired of writing about what he doesn&#39;t do.  He and I both love to walk.  I&#39;ll try to do more of that.<br/>\n<br/>\n--My heart is going out to this poor kid<br/>\nwho has, in his his short life, already been experimented on so much<br/>\n(which is what those rotation diets, etc. are - they are experiments on<br/>\na child).--<br/>\n<br/>\nOh yeah, and I haven&#39;t yet mentioned that he has asthma and eczema.  The asthma isn&#39;t too bad, but the eczema... basically he&#39;s been itchy for the past 12 years, which more than anything else has tormented him, and therefore us.  He&#39;s aleady on the strongest conventional meds and ointments and creams, but they don&#39;t help enough, and they don&#39;t heal anything.  When the elimination/rotation diet was first suggested to us, it was mainly to deal with allergies and eczema.  Yeah, and autism symptoms too (we&#39;ve been told they&#39;re all related), but whatever personality quirks he has are nothing compared to the itching, scratching, bleeding, doctors, frustration.  Conventional medicine has come up short, so we&#39;ve been looking for other ways to get relief.  It&#39;s all been a big waste of time and LOTS of money.  So yeah, I agree with you, they&#39;re just experiments.  <br/>\n<br/>\n--Let everything that isn&#39;t actually life-threatening go.--<br/>\n<br/>\nOK.  I&#39;m exhausted.  You know, our day-to-day lives are really pretty nice, but writing the above has focused all my attention on our difficulties.  It makes me sad and tired, and it makes me not want to add to them.  <br/>\n<br/>\nBeth C. </span></blockquote></div>","specialLinks":[]},{"userId":141316284,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"re: Food and Anxiety","postDate":"1263769972","msgId":49677,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCNTM5OTc0LjMwMTAzMDBAbWFjLmNvbT4="},"prevInTopic":0,"nextInTopic":49945,"prevInTime":49676,"nextInTime":49678,"topicId":49677,"numMessagesInTopic":0,"msgSnippet":"I mixed up discussions on the UnschoolingDiscussion list and this list, and so I m copying this here because it is was really more intended for this list.","messageBody":"<div id=\"ygrps-yiv-1636240612\">I mixed up discussions on the UnschoolingDiscussion list and this list, <br/>\nand so I&#39;m copying this here because it is was really more intended for <br/>\nthis list. Sorry to those reading it twice - my mistake. It is the later <br/>\npart that was more intended for this discussion.<br/>\n<br/>\n-Pam<br/>\n<br/>\n<br/>\nI put a fairly large amount of effort into finding toothpaste that Rosie <br/>\nliked and I&#39;m careful to buy the kind she likes, still. Roxana doesn&#39;t <br/>\ntake pills - she gags on them. So I buy her liquid tylenol from a <br/>\ndrugstore near &quot;Leisure World&quot; - a retirement community. And I bought a <br/>\npill crusher a long time ago and if she has to take something, she&#39;ll <br/>\ncrush it up and put it in applesauce or something. It really isn&#39;t a big <br/>\ndeal to do these things and life is much better for it. We can put that <br/>\nkind of effort into finding foods our kids really like that don&#39;t hurt <br/>\nthem IF there is a real need for it.<br/>\n<br/>\nWe had visitors from out of the country, staying with us, once. The mom<br/>\nwas forcing a pill down her little girls&#39; throat - the girl was probably<br/>\n6 years old or so. And the mom was forcing the pill down - literally<br/>\nholding the child&#39;s head back and shoving the pill down her throat. You<br/>\ncan guess what happened - the girl threw up all over the place, gagged<br/>\non THAT and choked and it was a huge mess with a hysterical child and<br/>\nfurious mom and it pretty much ruined our whole evening. It was awful.<br/>\nRoya was about 3 and she was very very shocked and upset.  There&#39;s just<br/>\nno need - there are other ways to do things.<br/>\n<br/>\nI think that we can kind of support our kids in eating pretty healthy<br/>\nfoods by just having the healthy foods they like around and offering<br/>\nthem. Slicing up fruit and serving it with bits of cheese and crackers<br/>\nwas always appreciated around my house. On cold days I&#39;d make sliced<br/>\napples with some cinnamon sprinkled on them and heat them up in the<br/>\nmicrowave. But, if they wanted something else - something &quot;less healthy&quot;<br/>\n- I&#39;d just provide that, too, without distinction.<br/>\n<br/>\nIt is interesting, sometimes what we grow up with is what we really<br/>\nlike. Sometimes what we didn&#39;t have as kids seems like a big treat. My<br/>\nkids don&#39;t like whole milk, because we always had nonfat milk. To them,<br/>\nwhole milk is so thick and creamy that it only tastes good when just a<br/>\nbit is poured over something, but they wouldn&#39;t drink a glass of it.<br/>\nBut, we also only ever had dense thick dark bread - because that&#39;s just<br/>\nwhat &quot;I&quot; like and so, when they were little, it is what I bought and<br/>\nthat&#39;s what they thought of as &quot;bread.&quot; Turns out Roxana loves that kind<br/>\nof bread, too, and it is also what Roya prefers, but Rosie would much<br/>\nrather have lighter, airier breads. We didn&#39;t eat fish at all, because<br/>\n&quot;I&quot; don&#39;t like it - but Roya turns out to absolutely LOVE fish and eats<br/>\na lot of it, now, while Rox and Rosie don&#39;t like it, either.<br/>\n<br/>\nI don&#39;t think we&#39;re shaping our kids food choices for life the way some<br/>\nparents seem to think. They are going to end up to be individuals - they<br/>\nwill have their own tastes and preferences and those aren&#39;t really all<br/>\nthat predictable based on their childhoods.<br/>\n<br/>\nBut, there are parents who seem to actually have some kind of want or<br/>\nneed for their kids to have food issues. They seem to be looking for<br/>\nthose issues to exist. Beth, your kid already has all kinds of<br/>\nfood-related problems - why on earth would you want to add another one<br/>\nto the list if it wasn&#39;t absolutely life-threateningly necessary? You<br/>\nand your husband are worried about him getting fat, and your first<br/>\nreaction is to find some additional food to restrict? Have you found<br/>\nways to get more active? Do you go out and do stuff together - run and<br/>\nplay? Do you have a Wii Fit? A mini-trampoline? Bikes, skates,<br/>\nskateboards? Do you go skiing or swimming? I&#39;m going to be blunt and say<br/>\nthat I think the two of you probably have food issues, yourselves, and<br/>\nyou&#39;re projecting those onto your son.<br/>\n<br/>\nIn fact, my recommendation would be to try your best to down-play the<br/>\nother issues to the maximum extent possible. Try to ignore them. Try to<br/>\nfind other solutions to the problems he has. Question question question<br/>\nwhether the food is REALLY the culprit and whether restricting foods is<br/>\nreally doing more harm than good. My heart is going out to this poor kid<br/>\nwho has, in his his short life, already been experimented on so much<br/>\n(which is what those rotation diets, etc. are - they are experiments on<br/>\na child). Let everything that isn&#39;t actually life-threatening go (and I<br/>\ndon&#39;t mean that he might have high cholesterol in 30 years if he eats<br/>\nsomething now, I mean immediately life-threatening). OFFER foods that<br/>\nare healthy for him, but don&#39;t deny him other things he wants, either.<br/>\n<br/>\n-pam</div>","specialLinks":[]}],"prevTopicId":49948,"nextTopicId":49983}}