{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":16,"messages":[{"userId":1675643,"authorName":"Cally Brown","from":"Cally Brown &lt;mjcmbrwn@...&gt;","profile":"cally_marg","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: How many children do I have!?","postDate":"1186866484","msgId":30289,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ2QkUyNTM0LjEwOTAxQGlodWcuY28ubno+","inReplyToHeader":"PDY4RDIyREZFLTg1RTgtNEVCMi1CQUQzLTlBRjdEQjEwQUVFOEBzYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PEE5RjAyRjEyLTUwRkMtNEVERS1BMTM5LTlGMTdGMjRBNDNEOUBjaG9vc2Vvcmdhbmljcy5jb20+IDw2OEQyMkRGRS04NUU4LTRFQjItQkFEMy05QUY3REIxMEFFRThAc2FuZHJhZG9kZC5jb20+"},"prevInTopic":30286,"nextInTopic":0,"prevInTime":30288,"nextInTime":30290,"topicId":30233,"numMessagesInTopic":0,"msgSnippet":"... I agree that the form can scare people away. But the thing is that on a list, there are lots of people and you don t have to take one person s posts to","messageBody":"<div id=\"ygrps-yiv-2132519770\"><blockquote><span title=\"ireply\">&gt; -=-With my time on this list i have all to often seen some poor shmuck<br/>\n&gt; innocently share an issue or challenge they face only to get<br/>\n&gt; responses that, while i agree with the content, the form would scare<br/>\n&gt; away many, or worse get them defensive and get them posting more<br/>\n&gt; frustrating arguments and lead to very frustrating threads... in many<br/>\n&gt; ways that style creates &quot;more work&quot; for you and others who keep<br/>\n&gt; engaging in the argument that ensues.-=-<br/>\n&gt;   <br/>\n </span></blockquote>I agree that the form can scare people away. But the thing is that on a <br/>\nlist, there are lots of people and you don&#39;t have to take one person&#39;s <br/>\nposts to heart - you can read other people&#39;s posts too - one&#39;s that fit <br/>\nyour style better. If the over all tone of a list is not to someone&#39;s <br/>\nliking - go find one that suits better!<br/>\n<br/>\nPersonally I have been put off lists where the tone has been all <br/>\nsweetness and comfort and that&#39;s fine, you&#39;re lovely blah blah. That <br/>\ndrives me nuts till I leave. I love the precise sharpness of Sandra&#39;s <br/>\nresponses: it&#39;s precisely because of her tone that she can cut through <br/>\nthe defenses in my head and make me reassess and reevaluate my ideas. <br/>\nThe gentle sweetie nature of some other people&#39;s posts just lulls me <br/>\ninto complacency. When I feel a stab of indignation while reading one of <br/>\nSandra&#39;s comments, I know it&#39;s time to take a deep breath and look <br/>\ninside myself, not criticize her!<br/>\n<br/>\nCally<br/>\n<blockquote><span title=\"qreply\"> &gt; </span></blockquote></div>","specialLinks":[]},{"userId":211875477,"authorName":"Amy","from":"&quot;Amy&quot; &lt;amylizkid1@...&gt;","profile":"amylizkid1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: How many children do I have!?","postDate":"1186855024","msgId":30286,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY5a3Q5Zys5NnYxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY3NjE5RTk3LURDQUYtNDNDOS1COEYzLTMzNjI0Qjk0MzE0OEBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":30284,"nextInTopic":30289,"prevInTime":30285,"nextInTime":30287,"topicId":30233,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-85582669\">&lt;&lt;&lt;I don&#39;t always have THE answer, but I do always try to give a real <br/>\nanswer.&gt;&gt;&gt;<br/>\n<br/>\nRight.  And I meant that.  I should have said, if I don&#39;t want your <br/>\nanswer (or the answers that&#39;ll show up on this list) I won&#39;t ask the <br/>\nquestion. &lt;g&gt;  I like your answers because of what they are. <br/>\nThoughtful, empowering, real, and full of more questions to ask <br/>\nmyself.  I like my Mom&#39;s answers because they are blunt, tactless and <br/>\neducational.  I have a friend who would give me a point by point <br/>\nanswer, and one who would never get around to an answer but it would <br/>\nbe a great conversation anyway.<br/>\n<br/>\nThe way you and so many others here of tweaked my brain around to <br/>\nbetter thinking is exciting for me.<br/>\n<br/>\nOkay, thank you for letting me clarify myself.  <br/>\n<br/>\n~Amy<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; -=-I&#39;m in love with your words and I appreciate your candor. So many<br/>\n&gt; people won&#39;t give a real answer. That&#39;s difficult for me. I mean, if<br/>\n&gt; I didn&#39;t want the answer, I wouldn&#39;t ask the question.-=-<br/>\n&gt; <br/>\n&gt; Thanks.<br/>\n&gt; <br/>\n&gt; I don&#39;t always have THE answer, but I do always try to give a real  <br/>\n&gt; answer.  Or sometimes I try to ask real questions, so that the <br/>\nperson  <br/>\n&gt; can find her own answers (in the teaching a man to fish way).<br/>\n&gt; <br/>\n&gt; If this list and other such sources can help others figure out how <br/>\nto  <br/>\n&gt; find their own answers that&#39;s way better than giving simple &quot;just <br/>\ndo  <br/>\n&gt; this&quot; answers.<br/>\n&gt; <br/>\n&gt; I think that&#39;s why sometimes people get mad and accuse us of <br/>\npicking  <br/>\n&gt; apart their words instead of just telling them what to do.  If <br/>\nthey  <br/>\n&gt; can just rearrange their thinking a little bit, better answers <br/>\nwill  <br/>\n&gt; start flooding in.  If we keep telling them what to do, they&#39;ll <br/>\nkeep  <br/>\n&gt; asking us what to do.<br/>\n&gt; <br/>\n&gt; That&#39;s why principles work better than rules, in unschooling. It&#39;s  <br/>\n&gt; the same reason learning from everything all the time is better <br/>\nthan  <br/>\n&gt; reliance on a curriculum.<br/>\n&gt; <br/>\n&gt; Helping people find lots of different ways to see is better than  <br/>\n&gt; telling them what to look at.<br/>\n&gt; <br/>\n&gt; Empowering people is good.<br/>\n&gt; <br/>\n&gt; Yesterday Holly and I saw &quot;No Reservations.&quot;  The main character <br/>\nis  <br/>\n&gt; seeing a therapist, and clearly wasting her time and money there <br/>\nweek  <br/>\n&gt; after week by not being honest or open with him.  At one point he  <br/>\n&gt; puts a dig to her that she can&#39;t help but think about, and she <br/>\nasks  <br/>\n&gt; something like &quot;So is this a new technique, insulting the <br/>\nclient?&quot;   <br/>\n&gt; As he turns away, he says &quot;Only the best therapists use it,&quot; or <br/>\nsome  <br/>\n&gt; such (I didn&#39;t write it down at the time; should&#39;ve!)<br/>\n&gt; <br/>\n&gt; When he was being kind and nice, she was feeling soothed and  <br/>\n&gt; justified in not actually sharing.  When he showed her something <br/>\nshe  <br/>\n&gt; was doing that repeatedly sabotaged her own happiness, it pissed <br/>\nher  <br/>\n&gt; off, but she was able to change enough to have a happier life <br/>\nbecause  <br/>\n&gt; of it.<br/>\n&gt; <br/>\n&gt; I&#39;m not saying it&#39;s a good plan to purposely irritate someone, and  <br/>\n&gt; that&#39;s not what I do, but if someone is saying &quot;I keep grounding <br/>\nmy  <br/>\n&gt; kid and it&#39;s not helping,&quot; I won&#39;t hesitate to say &quot;You just said  <br/>\n&gt; yourself it&#39;s not helping, so why do you keep doing it?&quot;  And if <br/>\nthe  <br/>\n&gt; person says &quot;You don&#39;t know enough about me to say something like  <br/>\n&gt; that, every single other person who&#39;s reading it will know that  <br/>\n&gt; either I know enough to say that (because given all the options in  <br/>\n&gt; the world it&#39;s what the poster chose to write and post), or the  <br/>\n&gt; poster wasn&#39;t careful or honest (which also happens sometimes).<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: How many children do I have!?","postDate":"1186854181","msgId":30284,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY4RDIyREZFLTg1RTgtNEVCMi1CQUQzLTlBRjdEQjEwQUVFOEBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEE5RjAyRjEyLTUwRkMtNEVERS1BMTM5LTlGMTdGMjRBNDNEOUBjaG9vc2Vvcmdhbmljcy5jb20+","referencesHeader":"PEE5RjAyRjEyLTUwRkMtNEVERS1BMTM5LTlGMTdGMjRBNDNEOUBjaG9vc2Vvcmdhbmljcy5jb20+"},"prevInTopic":30283,"nextInTopic":30286,"prevInTime":30283,"nextInTime":30285,"topicId":30233,"numMessagesInTopic":0,"msgSnippet":"-=-With my time on this list i have all to often seen some poor shmuck innocently share an issue or challenge they face only to get responses that, while i","messageBody":"<div id=\"ygrps-yiv-698882590\">-=-With my time on this list i have all to often seen some poor shmuck<br/>\ninnocently share an issue or challenge they face only to get<br/>\nresponses that, while i agree with the content, the form would scare<br/>\naway many, or worse get them defensive and get them posting more<br/>\nfrustrating arguments and lead to very frustrating threads... in many<br/>\nways that style creates &quot;more work&quot; for you and others who keep<br/>\nengaging in the argument that ensues.-=-<br/>\n<br/>\nWhen others&#39; ideas are clarified, it&#39;s not work.  It&#39;s joy.<br/>\n<br/>\nIf someone says &quot;I never really understood this until that moment,&quot;  <br/>\nthen someone learned.  The person who learns the most isn&#39;t always  <br/>\nthe person who came with a question about how to get two kids to  <br/>\nshare a bottle of bubbles.  And the learning is rarely about bubbles,  <br/>\nit&#39;s about the nature of growth and of what children need.<br/>\n<br/>\nA child might think she needs bubbles, when she needs something new  <br/>\nand fascinating to look at.<br/>\n<br/>\nA mom might think she needs one, simple, narrow answer, when she  <br/>\nneeds to discover that she can find a way for all her imagined list  <br/>\nof future questions to disappear like little bubbles.  Seriously.<br/>\n<br/>\n<br/>\nDid you know bubbles pop way faster in dry air than humid?  I  <br/>\nshould&#39;ve known that, it seems, and it makes sense, but if your kids  <br/>\nlike bubbles, and if you&#39;re in the desert, wait for one of those  <br/>\novercast days before it rains, or after it has rained, and check it  <br/>\nout! The bubbles are strong and longer lasting, and prettier with  <br/>\nclouds than with full sun bleaching them out and popping them the  <br/>\nmoment they form.<br/>\n<br/>\n-=- I am concerned if you truly are getting<br/>\nfatigued at what you do because it is of real value to many including<br/>\nmyself.-=-<br/>\n<br/>\nI&#39;m not tired of people getting the spark of insight, or of gathering  <br/>\nup free clues and taking them and making their home nest better.<br/>\nHow could I get tired of that!?<br/>\n<br/>\nI&#39;m tired of criticism from people who can&#39;t do better, or haven&#39;t  <br/>\neven tried.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: How many children do I have!?","postDate":"1186853822","msgId":30283,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI1NUZDMjE1LUUyQTktNDBGQy1CNzhFLTFGN0RDMzEyMEMxN0BzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEE5RjAyRjEyLTUwRkMtNEVERS1BMTM5LTlGMTdGMjRBNDNEOUBjaG9vc2Vvcmdhbmljcy5jb20+","referencesHeader":"PEE5RjAyRjEyLTUwRkMtNEVERS1BMTM5LTlGMTdGMjRBNDNEOUBjaG9vc2Vvcmdhbmljcy5jb20+"},"prevInTopic":30280,"nextInTopic":30284,"prevInTime":30282,"nextInTime":30284,"topicId":30233,"numMessagesInTopic":0,"msgSnippet":"-=-Maybe im just a wimpy, over mothered, in need of coddling kind of guy... but i want a culure of honesty, challenging ideas, sharp debate (ive got all","messageBody":"<div id=\"ygrps-yiv-1415981843\">-=-Maybe im just a wimpy, over mothered, in need of coddling kind of<br/>\nguy... but i want a culure of honesty, challenging ideas, sharp<br/>\ndebate (ive got all this)... but also one of compassion,<br/>\nunderstanding and empathy (this can be sorely lacking at times). I<br/>\nreally believe that it is that sort of culture that will welcome even<br/>\nmore people to these ideas and practices...-=-<br/>\n<br/>\nDoes one list need to try to fulfill each member&#39;s desires?<br/>\nCOULD one list fulfill each member&#39;s desires?<br/>\n<br/>\nI don&#39;t think a list is a culture.<br/>\nThis list is for discussion.  It&#39;s a small part of my big life.  I&#39;m  <br/>\nassuming every other participant here has a really big life and this  <br/>\nlist is not what will make or break their unschooling or their  <br/>\nhappiness.  In any case in which someone has considered this a basket  <br/>\nin which to put all her eggs, that&#39;s not something I designed or  <br/>\ninvited.<br/>\n<br/>\n<br/>\nI&#39;ve seen the odd behavior of people being super-involved and then  <br/>\nover-reactionary.  I&#39;ve seen it with people and churches.  Mostly  <br/>\nwomen and churches.   Someone will come and invest lots of time and  <br/>\nenergy and praise (some of God, but mostly of the minister or of her  <br/>\nfavorite members of the congregation)  and then they see a flaw, a  <br/>\nsin, an imperfection.  And they get CRAZY about it, totally obsessed  <br/>\nand indignant.  And they start badmouthing everyone and every thing  <br/>\nassociated with that church, and they practically go atheistic and  <br/>\nthey froth, until they find a new church to worship, and they cycle  <br/>\nstarts again.   Probably, usually, they become unhappy and then look  <br/>\nfor the flaw as a justifcation for their unsettled feelings.  They  <br/>\nwant something or someone to blame besides themselves for their  <br/>\nrestlessness or embarrassment or frustration or whatever emotion it  <br/>\nis.  So they lash out and blame someone or something prominent and  <br/>\nvisible, someone whose name is on the wall or the program, preferably.<br/>\n<br/>\nI have never tried to be a church, I&#39;ve never wanted to be anything  <br/>\nlike a church, I&#39;ve just talked about ideas, my whole life.  And I&#39;ve  <br/>\nwritten ideas down.  I&#39;ve tried them out and changed them, or I&#39;ve  <br/>\ntried them out and become stronger in my confidence in one idea or  <br/>\nanother.    I&#39;m not perfect, but I&#39;m confident.  I don&#39;t know  <br/>\neverything, but when I&#39;m not confident I admit it.  About things I  <br/>\ndon&#39;t know or care about, I don&#39;t say a word.   Those people who want  <br/>\nme to be perfect somehow, or want this list (or any list, or group,  <br/>\nor club, or church) to fulfill all their needs are showing a needy  <br/>\nimmaturity that isn&#39;t the fault of the list, group, club or church.<br/>\n<br/>\nI&#39;m pretty sure that there are ways to help our children grow up  <br/>\nwithout having that neediness so many adults have maintained since  <br/>\nchildhood.  I was pretty sure years ago, and I&#39;ve made choices toward  <br/>\nthat direction for 21 years now and my children&#39;s demeanor and  <br/>\ncarriage and confidence have done nothing to make me think I was all  <br/>\nwrong.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/respect\">http://sandradodd.com/respect</a><br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":180234378,"authorName":"Sylvia Toyama","from":"&quot;Sylvia Toyama&quot; &lt;sylgt04@...&gt;","profile":"sylgt04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: How many children do I have!?","postDate":"1186844920","msgId":30280,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY5a2pkbys3c21yQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEE5RjAyRjEyLTUwRkMtNEVERS1BMTM5LTlGMTdGMjRBNDNEOUBjaG9vc2Vvcmdhbmljcy5jb20+"},"prevInTopic":30276,"nextInTopic":30283,"prevInTime":30279,"nextInTime":30281,"topicId":30233,"numMessagesInTopic":0,"msgSnippet":"Maybe im just a wimpy, over mothered, in need of coddling kind of guy... but i want a culure of honesty, challenging ideas, sharp debate (ive got all this)...","messageBody":"<div id=\"ygrps-yiv-1424906428\">Maybe im just a wimpy, over mothered, in need of coddling kind of<br/>\nguy... but i want a culure of honesty, challenging ideas, sharp<br/>\ndebate (ive got all this)... but also one of compassion,<br/>\nunderstanding and empathy (this can be sorely lacking at times).<br/>\nI really believe that it is that sort of culture that will welcome even<br/>\nmore people to these ideas and practices...<br/>\n<br/>\n*****<br/>\n<br/>\nI can see folks feeling this way -- wanting more understanding and <br/>\nempathy when they post.  If this were the only unschooling list on the <br/>\ninternet, that would be a very compelling argument.  There are lots of <br/>\nlists, tho.  I belong to several, and I&#39;ve come to know which lists <br/>\nwill best answer the questions I have in a particular moment, or in the <br/>\nparticular way I feel I need to hear those answers.  <br/>\n<br/>\nWhen I sense that I&#39;ve let my issues get in my kids&#39; way and that I&#39;m <br/>\nreally the one who needs to grow a bit, I come here to read, or I post <br/>\nover at unschooling basics -- because I know that Kelly & Ren won&#39;t let <br/>\nme get away with anything!&lt;g&gt;  If I feel the same need for <br/>\naccountability, but I&#39;m feeling a little vulnerable that day, I&#39;ll post <br/>\nat Always Unschooled or maybe at Shine, where things tend to be a bit <br/>\ngentler.<br/>\n<br/>\nOn the issue of empathy, another point for me is who gets that empathy -<br/>\n- the parent posting, or his/her kids who could use more empathy from <br/>\nthat parent?  It&#39;s not always possible to be empathetic towads both.  <br/>\nWhen that&#39;s the case, the kids get my empathy every time.  <br/>\n<br/>\nThe whole idea of being like that drill seargent is an interesting <br/>\none.  I spent two years as a LaLeche League Leader.  It was my *job* to <br/>\nsupport the Mom in her goal to breastfeed.  It wasn&#39;t my job to hold <br/>\nher hand while she felt sorry for herself and found 15 reasons why she <br/>\nfelt she couldn&#39;t nurse.  It was my responsibility -- to her and to her <br/>\nbaby -- to remind her that she came to me because she wanted the very <br/>\nbest for her baby.  She may have forgotten in that moment -- in her <br/>\ndistress, what her goal was, but I was just removed enough to have the <br/>\nclarity to remind her -- this is about your baby, not about you. It was <br/>\ntime-sensitive because if she didn&#39;t get it now, her supply would <br/>\ndwindle and her baby would outgrow the nursing days.  If that happened, <br/>\nthey would fail at nursing.  <br/>\n<br/>\nUnschooling is much the same way.  Our kids are only kids for a short <br/>\ntime -- something less than 20 yrs of childhood in a lifespan of maybe <br/>\n80 yrs.  How those 60 yrs of adulthood turn out has a lot to do with <br/>\nwhat I find a way to give to my kids in the first 20 or so.  I don&#39;t <br/>\nhave the luxury of figuring it over a long time, because every day, <br/>\nweek, month, year that I don&#39;t get it, it&#39;s my kids who don&#39;t get what <br/>\nI want to give them.  I&#39;m 44yo and still wading thru the damage my <br/>\nparents did to me.  I don&#39;t want that for my kids, so I&#39;m willing to <br/>\noffer myself up to folks who won&#39;t let me get away with anything.  <br/>\n<br/>\nNo one forces anyone to read at this -- or any other -- list.  Everyone <br/>\non the internet is here by choice. They found their way here and if <br/>\nwhat they see/read here makes them so uncomfortable they can&#39;t get it, <br/>\nthen they can stop reading. <br/>\n<br/>\nAs to whether or not this is a community, I&#39;m sure people will always <br/>\ndisagree on that point. I don&#39;t consider these online groups a tribe or <br/>\ncommunity. I know some people from these groups(IRL) and I consider <br/>\nthem friends, some who offer me great advice but with whom I have <br/>\nlittle other than unschooling in common, some I&#39;d likely not choose for <br/>\nfriends, but who have shared invaluable insights over the years.  I may <br/>\nsometimes bristle at the approach, but I always appreciate their <br/>\nhonesty. <br/>\n<br/>\nOn the local, IRL level, I do belong to an unschooling group I consider <br/>\nto be my tribe.  We enjoy a much deeper level of community and support <br/>\nthan I expect to find online.  We share more than unschooling, too, in <br/>\nmany ways.  As a group we&#39;ve been able to achieve a balance of empathy <br/>\nand accountability.  They offer me great friendship and support, and <br/>\nthey know I expect them to call me on it when I&#39;m not being the Mom, <br/>\nthe person, I want to be.  We all know each other well enough, and see <br/>\neach other often enough to be more adept at finding empathy for both <br/>\nparties while remembering that our common goal is being true to our <br/>\nprinciples as radical unschooling parents.  <br/>\n<br/>\nSylvia</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: How many children do I have!?","postDate":"1186813271","msgId":30276,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM0NjQ4QTIwLTMzQjYtNDNDOC1BMDI2LTVCODdCMjY1NjgzMUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PFBLRUhKR0NJR05QUEFCRlBCS0xHR0VPSktBQUIuamFja2lAYm9hcmRwcmVwLm5ldD4=","referencesHeader":"PFBLRUhKR0NJR05QUEFCRlBCS0xHR0VPSktBQUIuamFja2lAYm9hcmRwcmVwLm5ldD4="},"prevInTopic":30275,"nextInTopic":30280,"prevInTime":30275,"nextInTime":30277,"topicId":30233,"numMessagesInTopic":0,"msgSnippet":"-=-some of her analogies have been like lightening bolts of awakening for me.-=- Thanks for that, Jacki.","messageBody":"<div id=\"ygrps-yiv-944663268\">-=-some of her analogies have been like lightening<br/>\nbolts of awakening for me.-=-<br/>\n<br/>\nThanks for that, Jacki.</div>","specialLinks":[]},{"userId":116488337,"authorName":"Gold Standard","from":"&quot;Gold Standard&quot; &lt;jacki@...&gt;","profile":"jackiknouse","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [AlwaysLearning] Re: How many children do I have!?","postDate":"1186812935","msgId":30275,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFBLRUhKR0NJR05QUEFCRlBCS0xHR0VPSktBQUIuamFja2lAYm9hcmRwcmVwLm5ldD4=","inReplyToHeader":"PDI5NTUyM0UxLUVEMjktNEJERi1CN0ZFLTNEMDVDMTVBNTJGOEBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":30270,"nextInTopic":30276,"prevInTime":30274,"nextInTime":30276,"topicId":30233,"numMessagesInTopic":0,"msgSnippet":"... Thank you for stating these lines clearly Sandra. While I have felt offended a couple of times on this list (don t remember why or by whom), the fact is","messageBody":"<div id=\"ygrps-yiv-1889785225\"><blockquote><span title=\"ireply\">&gt;&gt;I want to do what I do, voluntarily and freely.  It would be better<br/>\n&gt;&gt;for me and others if those who weren&#39;t comfortable with it found a<br/>\n&gt;&gt;more comfortable place instead of trying to persuade me to be like<br/>\n&gt;&gt;someone or something else.&lt;&lt;<br/>\n<br/>\n </span></blockquote>Thank you for stating these lines clearly Sandra.<br/>\n<br/>\nWhile I have felt offended a couple of times on this list (don&#39;t remember<br/>\nwhy or by whom), the fact is that each time there was something for me to<br/>\nlearn. Sandra is donating enormously to all of us who care to participate.<br/>\nShe is a very special person, brilliant and gifted, ESPECIALLY in the area<br/>\nof communication. I mean some of her analogies have been like lightening<br/>\nbolts of awakening for me. She has moved many people forward on the path of<br/>\nmore respectful and peaceful homes. Why would we expect even more from her?<br/>\n<br/>\nI don&#39;t.<br/>\n<br/>\nThank you Sandra,<br/>\nJacki</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: How many children do I have!?","postDate":"1186797348","msgId":30270,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI5NTUyM0UxLUVEMjktNEJERi1CN0ZFLTNEMDVDMTVBNTJGOEBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEE5RjAyRjEyLTUwRkMtNEVERS1BMTM5LTlGMTdGMjRBNDNEOUBjaG9vc2Vvcmdhbmljcy5jb20+","referencesHeader":"PEE5RjAyRjEyLTUwRkMtNEVERS1BMTM5LTlGMTdGMjRBNDNEOUBjaG9vc2Vvcmdhbmljcy5jb20+"},"prevInTopic":30269,"nextInTopic":30275,"prevInTime":30269,"nextInTime":30271,"topicId":30233,"numMessagesInTopic":0,"msgSnippet":"-=-Im really asking the question – what sort of culture do we want for the unschooling community?-=- I don t think of it as a community. Various people go on","messageBody":"<div id=\"ygrps-yiv-277129867\">-=-Im really asking the question – what sort of culture do we want  <br/>\nfor the unschooling community?-=-<br/>\n<br/>\nI don&#39;t think of it as a community.<br/>\n<br/>\nVarious people go on emotionally about feeling a part of a tribe, or  <br/>\na community.<br/>\n<br/>\nI see unschooling as something my family chose to do that other  <br/>\nfamilies have chosen to do.  I know how to help them do it.  I&#39;ve  <br/>\nmade some friends because of unschooling, but I have lots of friends  <br/>\nwho aren&#39;t unschoolers too.<br/>\n<br/>\nIf I were a missionary or salesman and needed to try to get as many  <br/>\npeople as I could in as quickly as possible, that would be a way  <br/>\ndifferent deal than if I&#39;m staying in one place, building a website,  <br/>\ndiscussing things with people who&#39;ve found this list on their own.   <br/>\nIt&#39;s not that easy a list to find, which is fine with me.  It was  <br/>\nalways intended to be an advanced unschooling list, only for people  <br/>\nwho had already read some John Holt and knew what they wanted to do.   <br/>\nAnd it was always specifically intended as a list for people who  <br/>\ndidn&#39;t mind discussions with me.  It&#39;s my list, my own sole list,  <br/>\nunlike UnschoolingDiscussion which is jointly owned, or other lists  <br/>\nwhich also sprang from the UnschoolingDiscussion list, lists I&#39;m not  <br/>\neven on.  Unschooling Basics.  There are others.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/lists/other\">http://sandradodd.com/lists/other</a><br/>\n<br/>\nI want to do what I do, voluntarily and freely.  It would be better  <br/>\nfor me and others if those who weren&#39;t comfortable with it found a  <br/>\nmore comfortable place instead of trying to persuade me to be like  <br/>\nsomeone or something else.<br/>\n<br/>\nIf I never helped anyone there wouldn&#39;t be anyone on the list, and if  <br/>\nI didn&#39;t have anything to say, I&#39;d&#39;ve had nothing to put on the  <br/>\nwebsite.  I don&#39;t feel the need to help everyone in the whole wide  <br/>\nworld.  I don&#39;t go door to door and I don&#39;t advertise.   I stay where  <br/>\nI am waiting for people to come and want to discuss the ideas in  <br/>\ndepth, and to untangle what seems tangled up in their thinking.<br/>\n<br/>\nWhen I started unschooling there were very few resources.  I was  <br/>\nlucky because I knew two  unschooling families.  One family, years  <br/>\nlater, started a school and then all their kids were schoolkids  <br/>\n(their dad was the minister of the church attached to the school, so  <br/>\nthey kinda needed to go there if the church was going to run a  <br/>\nschool).  It was a creative artsy school, because their mom&#39;s so much  <br/>\nthat way.  The other family, the kids didn&#39;t go to school, but the  <br/>\nparents separated and the dad kept trying to force them to &quot;do work&quot;  <br/>\nand the mom was having a hard time dealing with it all, and it wasn&#39;t  <br/>\nideal.  They&#39;re all grown now, but it wasn&#39;t the most glowing of  <br/>\nunschooling stories, overall.  Neither of those families ever did the  <br/>\nonline discussion things.<br/>\n<br/>\nI waited two months for another issue of Growing Without Schooling,  <br/>\nand then I waited again.  I read and re-read John Holt books.  But  <br/>\nmostly I hung out with Kirby and watched him and talked to him and  <br/>\nshowed him the world and took note of his reactions and shared  <br/>\nstories with other moms I knew well from La Leche League.  Marty came  <br/>\nalong; Holly came along.  We never changed or faltered or doubted  <br/>\nunschooling.  Most families either started there and ended up  <br/>\nchanging course, or they started with school and moved to  <br/>\nunschooling.  There are things I&#39;ve learned from watching families in  <br/>\nperson, from meeting families at conferences and keeping up with  <br/>\ntheir lives sometimes in person, sometimes online, through visits in  <br/>\ntheir home or mine,  or conferences.<br/>\n<br/>\nStill, it&#39;s not a community in a social sense for me.  I love knowing  <br/>\nunschoolers, but I&#39;m not depending on them to provide all my social  <br/>\nneeds.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":279529800,"authorName":":: anne | arun ::","from":"&quot;:: anne | arun ::&quot; &lt;life@...&gt;","profile":"arunaway72","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: How many children do I have!?","postDate":"1186795033","msgId":30269,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE5RjAyRjEyLTUwRkMtNEVERS1BMTM5LTlGMTdGMjRBNDNEOUBjaG9vc2Vvcmdhbmljcy5jb20+"},"prevInTopic":30260,"nextInTopic":30270,"prevInTime":30268,"nextInTime":30270,"topicId":30233,"numMessagesInTopic":0,"msgSnippet":"ive dont think ive posted on this list but been a lurker for a long time. That in part justifies my slightly long post here... Sandra – ive found your","messageBody":"<div id=\"ygrps-yiv-1065731146\">ive dont think ive posted on this list but been a lurker for a long  <br/>\ntime. That in part justifies my slightly long post here...<br/>\n<br/>\nSandra � ive found your insights and perspectives to be invaluable.  <br/>\nOften challenging but that is why i am here � from about a year ago i  <br/>\nhad decided to make changes and was looking for ideas, techniques and  <br/>\nprinciples to replace the old parenting me.<br/>\n<br/>\nYou certainly seem patient. I would not invite missionaries into the  <br/>\nhouse as I tend to be pretty picky as to where and with whom i invest  <br/>\nmy time and energy. You also seem to have amazing energy for all of  <br/>\nus out here... it has been an effort for me even to write this email  <br/>\n(i often laugh to myself that i could do a better parenting blog and  <br/>\nwrite more on these lists if i did not have kids � lol!)<br/>\n<br/>\n  i totally get it if what you are saying is that you have limited  <br/>\ntime & energy and need to &quot;cut to the chase&quot; in your responses. I do  <br/>\ntruly appreciate you and others in your generosity in sharing so much  <br/>\nof yourselves, your experience & wisdom.<br/>\n<br/>\nHowever if the aim of this list is to assist more people in making  <br/>\nmajor shifts to a RU position,  in my humble opinion, that would be  <br/>\nmore effectively served by a more empathetic and compassionate  <br/>\nunschooling community... both in the real and virtual world<br/>\n<br/>\nParenting is of course a very personal thing. And the thing about  <br/>\npersonal stuff is that people take them personally. In a perfect  <br/>\nworld people would be able to just focus on ideas and not feel like  <br/>\nthey are being personally attacked when a radical idea lands in their  <br/>\ninbox with their name on it. However we are not in a perfect world  <br/>\nand parents on this list must bring their baggage, fears, guilt and  <br/>\nother stuff.<br/>\n<br/>\nIts not about being a counsellor. Nor do I expect you or anyone else  <br/>\nto mother or coddle me (well ... i wouldnt mind my mum doing that!).  <br/>\nBut I honestly do believe that a little bit of compassion and empathy  <br/>\ngo a long way towards more effective communication. They have with my  <br/>\nchildren and I am finding the same thing in other parts of my life  <br/>\nalso...<br/>\n<br/>\nI do believe that ultimately it is up to each individual to make  <br/>\nchange or not � they have to open the door. However I also think we  <br/>\nas a community could help more people widen that door with a cultural  <br/>\nshift. It does not cost anything and often is just a difference of a  <br/>\nfew words or way of phrasing things. The message can be just as  <br/>\nsharp, pointed and challenging... yet with that greater compassion  <br/>\nand empathy on occasion the same message will more often fall on open  <br/>\nears.<br/>\n<br/>\nPerhaps you are simply of the &quot;Sergeant Major School of Thought&quot;. You  <br/>\nknow... all those bad war movies with the full on Sergeant Major who  <br/>\nyells at the new recruits to &quot;harden&quot; them for the war out there  <br/>\nbecause hes only got a matter of weeks before they face battle. The  <br/>\nnew recruits hate it at the time, then in the midst of shelling they  <br/>\nall say &quot;Thank God for the Sergeant Major&quot;. Of course you dont  <br/>\nyell... but you get my point. I do believe there is space for &quot;tough  <br/>\nlove&quot; and words that cut to the core but that is just one aspect to  <br/>\ncommunication...<br/>\n<br/>\nWith my time on this list i have all to often seen some poor shmuck  <br/>\ninnocently share an issue or challenge they face only to get  <br/>\nresponses that, while i agree with the content, the form would scare  <br/>\naway many, or worse get them defensive and get them posting more  <br/>\nfrustrating arguments and lead to very frustrating threads... in many  <br/>\nways that style creates &quot;more work&quot; for you and others who keep  <br/>\nengaging in the argument that ensues.<br/>\n<br/>\nSo again I say thank you. I am concerned if you truly are getting  <br/>\nfatigued at what you do because it is of real value to many including  <br/>\nmyself. You are a very powerful force for parenting change... but i  <br/>\ndo believe that a &quot;Sandra with added compassion and empathy for other  <br/>\nparents&quot; would be even more powerful!<br/>\n<br/>\nIm naming you because you initiated this post, but of course its not  <br/>\nreally about you as you also make the point often... Im really asking  <br/>\nthe question � what sort of culture do we want for the unschooling  <br/>\ncommunity? Its worth even the most experienced RU parent asking  <br/>\nthemselves this question before they post responses...<br/>\n<br/>\nMaybe im just a wimpy, over mothered, in need of coddling kind of  <br/>\nguy... but i want a culure of honesty, challenging ideas, sharp  <br/>\ndebate (ive got all this)... but also one of compassion,  <br/>\nunderstanding and empathy (this can be sorely lacking at times).  I  <br/>\nreally believe that it is that sort of culture that will welcome even  <br/>\nmore people to these ideas and practices...<br/>\n<br/>\nthanks,<br/>\narun<br/>\n<br/>\n_____________________________________________<br/>\n<br/>\n| anne + arun |<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.theparentingpit.com\">http://www.theparentingpit.com</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: How many children do I have!?","postDate":"1186766438","msgId":30260,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY3NjE5RTk3LURDQUYtNDNDOS1COEYzLTMzNjI0Qjk0MzE0OEBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGY5aTFnNytoYjl2QGVHcm91cHMuY29tPg==","referencesHeader":"PGY5aTFnNytoYjl2QGVHcm91cHMuY29tPg=="},"prevInTopic":30253,"nextInTopic":30269,"prevInTime":30259,"nextInTime":30261,"topicId":30233,"numMessagesInTopic":0,"msgSnippet":"-=-I m in love with your words and I appreciate your candor. So many people won t give a real answer. That s difficult for me. I mean, if I didn t want the","messageBody":"<div id=\"ygrps-yiv-1369826324\">-=-I&#39;m in love with your words and I appreciate your candor. So many<br/>\npeople won&#39;t give a real answer. That&#39;s difficult for me. I mean, if<br/>\nI didn&#39;t want the answer, I wouldn&#39;t ask the question.-=-<br/>\n<br/>\nThanks.<br/>\n<br/>\nI don&#39;t always have THE answer, but I do always try to give a real  <br/>\nanswer.  Or sometimes I try to ask real questions, so that the person  <br/>\ncan find her own answers (in the teaching a man to fish way).<br/>\n<br/>\nIf this list and other such sources can help others figure out how to  <br/>\nfind their own answers that&#39;s way better than giving simple &quot;just do  <br/>\nthis&quot; answers.<br/>\n<br/>\nI think that&#39;s why sometimes people get mad and accuse us of picking  <br/>\napart their words instead of just telling them what to do.  If they  <br/>\ncan just rearrange their thinking a little bit, better answers will  <br/>\nstart flooding in.  If we keep telling them what to do, they&#39;ll keep  <br/>\nasking us what to do.<br/>\n<br/>\nThat&#39;s why principles work better than rules, in unschooling. It&#39;s  <br/>\nthe same reason learning from everything all the time is better than  <br/>\nreliance on a curriculum.<br/>\n<br/>\nHelping people find lots of different ways to see is better than  <br/>\ntelling them what to look at.<br/>\n<br/>\nEmpowering people is good.<br/>\n<br/>\nYesterday Holly and I saw &quot;No Reservations.&quot;  The main character is  <br/>\nseeing a therapist, and clearly wasting her time and money there week  <br/>\nafter week by not being honest or open with him.  At one point he  <br/>\nputs a dig to her that she can&#39;t help but think about, and she asks  <br/>\nsomething like &quot;So is this a new technique, insulting the client?&quot;   <br/>\nAs he turns away, he says &quot;Only the best therapists use it,&quot; or some  <br/>\nsuch (I didn&#39;t write it down at the time; should&#39;ve!)<br/>\n<br/>\nWhen he was being kind and nice, she was feeling soothed and  <br/>\njustified in not actually sharing.  When he showed her something she  <br/>\nwas doing that repeatedly sabotaged her own happiness, it pissed her  <br/>\noff, but she was able to change enough to have a happier life because  <br/>\nof it.<br/>\n<br/>\nI&#39;m not saying it&#39;s a good plan to purposely irritate someone, and  <br/>\nthat&#39;s not what I do, but if someone is saying &quot;I keep grounding my  <br/>\nkid and it&#39;s not helping,&quot; I won&#39;t hesitate to say &quot;You just said  <br/>\nyourself it&#39;s not helping, so why do you keep doing it?&quot;  And if the  <br/>\nperson says &quot;You don&#39;t know enough about me to say something like  <br/>\nthat, every single other person who&#39;s reading it will know that  <br/>\neither I know enough to say that (because given all the options in  <br/>\nthe world it&#39;s what the poster chose to write and post), or the  <br/>\nposter wasn&#39;t careful or honest (which also happens sometimes).<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":211875477,"authorName":"Amy","from":"&quot;Amy&quot; &lt;amylizkid1@...&gt;","profile":"amylizkid1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: How many children do I have!?","postDate":"1186761031","msgId":30253,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY5aTFnNytoYjl2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEIxNDU4ODNFLTRGRjMtNDRCRi04MEM5LTM3MjE4OUI1QzIzQUBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":30240,"nextInTopic":30260,"prevInTime":30252,"nextInTime":30254,"topicId":30233,"numMessagesInTopic":0,"msgSnippet":"Sandra, I m in love with your words and I appreciate your candor.  So many people won t give a real answer.  That s difficult for me.  I mean, if I didn t want","messageBody":"<div id=\"ygrps-yiv-9897173\">Sandra,<br/>\n<br/>\nI&#39;m in love with your words and I appreciate your candor.  So many <br/>\npeople won&#39;t give a real answer.  That&#39;s difficult for me.  I mean, if <br/>\nI didn&#39;t want the answer, I wouldn&#39;t ask the question.  It&#39;s not always <br/>\npleasant, but I don&#39;t recall learning anything from happy sweet answers.<br/>\n<br/>\nYou have undoubtedly made the world a better place for so many people.  <br/>\nThat you continue to donate your valuable time to help the rest of us <br/>\nis generous.<br/>\n<br/>\nThank you.<br/>\n<br/>\n~Amy</div>","specialLinks":[]},{"userId":62434209,"authorName":"jenstarc4","from":"&quot;jenstarc4&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: How many children do I have!?","postDate":"1186694311","msgId":30240,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY5ZzBiNys3c2YxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEIxNDU4ODNFLTRGRjMtNDRCRi04MEM5LTM3MjE4OUI1QzIzQUBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":30238,"nextInTopic":30253,"prevInTime":30239,"nextInTime":30241,"topicId":30233,"numMessagesInTopic":0,"msgSnippet":"... on ... in ... they re ... Ironically some of those very same people that accuse Sandra of being mean and insenstive, trash her behind her back on other","messageBody":"<div id=\"ygrps-yiv-699094054\"><blockquote><span title=\"ireply\">&gt; I am now, finally, getting tired of things like this (which came <br/>\n </span></blockquote>on  <br/>\n<blockquote><span title=\"ireply\"> &gt; the side, not to the list):<br/>\n&gt; <br/>\n&gt; -=- i don&#39;t think i can do better!!! i think YOU<br/>\n&gt; can do better, if you could maybe be less confrontational and more <br/>\n </span></blockquote>in<br/>\n<blockquote><span title=\"ireply\"> &gt; tune with the ideas of understanding and empathy, that you speak of<br/>\n&gt; regarding children.-=-<br/>\n&gt; <br/>\n&gt; The understanding and empathy I recommend parents show to their  <br/>\n&gt; children is a parent and child thing, and I can&#39;t be expected to  <br/>\n&gt; treat over 1000 people (however many are on this list) like <br/>\n </span></blockquote>they&#39;re  <br/>\n<blockquote><span title=\"ireply\"> &gt; on my children.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Ironically some of those very same people that accuse Sandra of being <br/>\nmean and insenstive, trash her behind her back on other boards.<br/>\n<br/>\nIt&#39;s always seemed weird to me when people complain about Sandra, or <br/>\nother posters.  I have never seen Sandra be mean to someone online.  <br/>\nIt&#39;s always about the ideas, not the person.  I&#39;ve seen people get <br/>\nall defensive and weird and reactionary many many times over the <br/>\nyears and blame it all on Sandra, even when other people are saying <br/>\nthe same thing in their own words, it&#39;s still Sandra&#39;s fault somehow.<br/>\n<br/>\nI recognize a lot of people on many boards that I&#39;ve seen over the <br/>\nyears.  I&#39;ve met a small handfull of them in real life.  The one <br/>\nbrief time I met Sandra she was kind and generous.  After having read <br/>\nher posts for years, I didn&#39;t think she would be anything but kind <br/>\nand generous.</div>","specialLinks":[]},{"userId":176439663,"authorName":"kacsshultz","from":"&quot;kacsshultz&quot; &lt;kashultz@...&gt;","profile":"kacsshultz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: How many children do I have!?","postDate":"1186690358","msgId":30238,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY5ZnNmbStyMG5oQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGY5ZnJwYSs0azkwQGVHcm91cHMuY29tPg=="},"prevInTopic":30237,"nextInTopic":30240,"prevInTime":30237,"nextInTime":30239,"topicId":30233,"numMessagesInTopic":0,"msgSnippet":"I did not mean to offend anyone by my use of the word ridiculous (as in diminishing anyone s personal experience); I have been ridiculously inflexible myself","messageBody":"<div id=\"ygrps-yiv-429970886\">I did not mean to offend anyone by my use of the word ridiculous (as <br/>\nin diminishing anyone&#39;s personal experience); I have been <br/>\nridiculously inflexible myself in the past.  It is sort of a way to <br/>\ndevelop self awareness, I guess.  <br/>\n<br/>\nJust didn&#39;t want a misunderstanding based on poor word choice.<br/>\n<br/>\nKelly<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;kacsshultz&quot; &lt;kashultz@...&gt; <br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Ironically, it has often been those train-wreck threads and <br/>\n </span></blockquote>defensive <br/>\n<blockquote><span title=\"ireply\"> &gt; posters that have been the most instructive to me.<br/>\n&gt; <br/>\n&gt; Perhaps it is the posters&#39; seemingly ridiculous inflexibility that <br/>\n&gt; somehow highlights to me how crazy it is to be inflexible; perhaps <br/>\n </span></blockquote>it <br/>\n<blockquote><span title=\"ireply\"> &gt; is the &quot;oh, I can do better than that&quot; though pattern that goes <br/>\n&gt; through my head.  Almost always they reinforce the fact that it is <br/>\n&gt; very possible to do things a different way.<br/>\n&gt; <br/>\n&gt; On the flip side, though, it&#39;s not helpful if real facilitators of <br/>\n&gt; change get burnt out from that kind of dialogue.<br/>\n&gt; <br/>\n&gt; Kelly<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt;  --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@&gt; <br/>\n&gt; wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt;  From time to time someone wants me to treat people on this list <br/>\n&gt; the  <br/>\n&gt; &gt; way I treat my children.<br/>\n&gt; &gt; What I want to do with this list is to help other adults discover <br/>\n&gt; and  <br/>\n&gt; &gt; refine ways to treat their children more the way I treat my <br/>\n&gt; children,  <br/>\n&gt; &gt; if they want to.<br/>\n&gt; &gt; <br/>\n&gt; &gt; I have a sign on my door, just put there last month, a paper <br/>\n </span></blockquote>taped  <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; there at eye level that says<br/>\n&gt; &gt; <br/>\n&gt; &gt; ++++++++++++++++++++++<br/>\n&gt; &gt; NO SOLICITORS<br/>\n&gt; &gt; <br/>\n&gt; &gt; No tree trimming,<br/>\n&gt; &gt; no petitions<br/>\n&gt; &gt; no missionaries<br/>\n&gt; &gt; no encyclopedia sales<br/>\n&gt; &gt; no yard cleaning.<br/>\n&gt; &gt; ++++++++++++++++++++++<br/>\n&gt; &gt; <br/>\n&gt; &gt; Unlike some other people I know, I have listened to missionaries <br/>\n&gt; at  <br/>\n&gt; &gt; length, invited them in, read their stuff, told them I admire <br/>\n&gt; their  <br/>\n&gt; &gt; dedication, given them cold drinks or water.  I&#39;ve let Jehovah&#39;s  <br/>\n&gt; &gt; Witnesses talk to me at length, and LDS guys.  Lately I decided <br/>\n </span></blockquote>I  <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; need to spend my time in other ways.  I&#39;m getting old.<br/>\n&gt; &gt; <br/>\n&gt; &gt; Kirby&#39;s working nights.  Holly sleeps late.  Whenever anyone <br/>\n&gt; touches  <br/>\n&gt; &gt; our door the dog barks a high, painful bark.  I don&#39;t want people <br/>\n&gt; to  <br/>\n&gt; &gt; trim our trees or clean our yard and someone was coming to the <br/>\n&gt; door  <br/>\n&gt; &gt; once a week or so. I don&#39;t want to sign petitions for anyone to <br/>\n&gt; run  <br/>\n&gt; &gt; for office or for people to pressure the government to do <br/>\n&gt; something  <br/>\n&gt; &gt; about something I never heard of.<br/>\n&gt; &gt; <br/>\n&gt; &gt; Does that mean I&#39;m telling my children not to talk to me about  <br/>\n&gt; &gt; religion or not to help me in the yard?<br/>\n&gt; &gt; <br/>\n&gt; &gt; I will let Holly sleep as late as she wants to and I&#39;ll make her  <br/>\n&gt; &gt; anything she wants for breakfast, when she wants me to make her  <br/>\n&gt; &gt; breakfast, which isn&#39;t all the time, just sometimes.  This <br/>\n </span></blockquote>morning <br/>\n<blockquote><span title=\"ireply\"> &gt; I  <br/>\n&gt; &gt; was glad to make fried eggs and toast for her.  She was sweet <br/>\n </span></blockquote>and  <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; grateful.<br/>\n&gt; &gt; <br/>\n&gt; &gt; Does that mean I should let just anyone sleep at my house as late <br/>\n&gt; as  <br/>\n&gt; &gt; they want and then request a special breakfast?<br/>\n&gt; &gt; <br/>\n&gt; &gt; And on this discussion list, I&#39;m not trying to mother people.  <br/>\n </span></blockquote>I&#39;m  <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; trying to discuss ideas and factors and practices that make <br/>\n&gt; parenting  <br/>\n&gt; &gt; antagonistic, when those come up, so that ALL the people on the <br/>\n&gt; list,  <br/>\n&gt; &gt; not just the person who posted, can look at their own thoughts, <br/>\n&gt; and  <br/>\n&gt; &gt; rules, and expectations and see if they can&#39;t tweak them toward <br/>\n&gt; the  <br/>\n&gt; &gt; direction they want to be with their children.<br/>\n&gt; &gt; <br/>\n&gt; &gt; Several who have known me online (or in person) for the dozen or <br/>\n&gt; so  <br/>\n&gt; &gt; years I&#39;ve been in discussions like this have asked how I can  <br/>\n&gt; &gt; patiently answer the same questions year after year without  <br/>\n&gt; &gt; throttling people.  It&#39;s because I know that when someone *does*  <br/>\n&gt; &gt; change in understanding, the world gets better for their <br/>\n&gt; children.   <br/>\n&gt; &gt; The world might be uncomfortable for the mom that day, but if she <br/>\n&gt; had  <br/>\n&gt; &gt; wanted to stay the same, she never could have found this list.  <br/>\n </span></blockquote>If  <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; she found this list and read some and thought it was bogus, she <br/>\n&gt; never  <br/>\n&gt; &gt; would have posted on this list.<br/>\n&gt; &gt; <br/>\n&gt; &gt; I assume that people come to this list because they want to <br/>\n </span></blockquote>change.<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; <br/>\n&gt; &gt; I am now, finally, getting tired of things like this (which came <br/>\n&gt; on  <br/>\n&gt; &gt; the side, not to the list):<br/>\n&gt; &gt; <br/>\n&gt; &gt; -=- i don&#39;t think i can do better!!! i think YOU<br/>\n&gt; &gt; can do better, if you could maybe be less confrontational and <br/>\n </span></blockquote>more <br/>\n<blockquote><span title=\"ireply\"> &gt; in<br/>\n&gt; &gt; tune with the ideas of understanding and empathy, that you speak <br/>\n </span></blockquote>of<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; regarding children.-=-<br/>\n&gt; &gt; <br/>\n&gt; &gt; The understanding and empathy I recommend parents show to their  <br/>\n&gt; &gt; children is a parent and child thing, and I can&#39;t be expected to  <br/>\n&gt; &gt; treat over 1000 people (however many are on this list) like <br/>\n&gt; they&#39;re  <br/>\n&gt; &gt; on my children.<br/>\n&gt; &gt; <br/>\n&gt; &gt; BUT WAIT!  This list isn&#39;t a question and answer column where all <br/>\n&gt; the  <br/>\n&gt; &gt; answers come from me.  Not at all.  When people post here they <br/>\n </span></blockquote>get  <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; several people&#39;s feedback.  And they get the feedback from people <br/>\n&gt; who  <br/>\n&gt; &gt; are pretty likely to be giving unschooling-focussed answers.  <br/>\n </span></blockquote>That  <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; happens because I keep the list running, and keep spam and  <br/>\n&gt; &gt; distractions off of it.<br/>\n&gt; &gt; <br/>\n&gt; &gt; Below is a link to an explanation of why I think people who want <br/>\n&gt; help  <br/>\n&gt; &gt; should get help quickly and directly.  With my kids, they have <br/>\n </span></blockquote>18  <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; years to learn to read, use a bank account and wipe their butts <br/>\n&gt; (not  <br/>\n&gt; &gt; in that order).  With parents who have children, they do not have <br/>\n&gt; 18  <br/>\n&gt; &gt; years to change.  They don&#39;t have ten years.  They don&#39;t have <br/>\n&gt; five.   <br/>\n&gt; &gt; They need to change before more damage is done to their <br/>\n&gt; relationship,  <br/>\n&gt; &gt; before it&#39;s so far gone they no longer want to regroup and re-<br/>\n&gt; direct.<br/>\n&gt; &gt; <br/>\n&gt; &gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/unschool/gettingit\">http://sandradodd.com/unschool/gettingit</a><br/>\n&gt; &gt; <br/>\n&gt; &gt; And here are quotes from people who say they wish they had <br/>\n </span></blockquote>changed  <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; sooner:<br/>\n&gt; &gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/ifonly\">http://sandradodd.com/ifonly</a><br/>\n&gt; &gt; <br/>\n&gt; &gt; I am very interested in helping those people.  I&#39;m less <br/>\n </span></blockquote>interested <br/>\n<blockquote><span title=\"ireply\"> &gt; in  <br/>\n&gt; &gt; helping people who want to be coddled, who complain about how I  <br/>\n&gt; &gt; phrase things, and who want to take years to consider whether <br/>\n&gt; they&#39;ll  <br/>\n&gt; &gt; change their ways.  The statement before is NOT about any <br/>\n&gt; individual,  <br/>\n&gt; &gt; it&#39;s about hundreds of people who have come through and <br/>\n </span></blockquote>complained  <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; instead of coming through to look at what they&#39;re doing in the <br/>\n&gt; light  <br/>\n&gt; &gt; of what others have discovered.<br/>\n&gt; &gt; <br/>\n&gt; &gt; If my website and articles and this list and <br/>\n </span></blockquote>UnschoolingDiscussion  <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; are not to someone&#39;s tastes, that&#39;s to be expected.  That&#39;s <br/>\n </span></blockquote>fine.  <br/>\n<blockquote><span title=\"ireply\"> &gt; I  <br/>\n&gt; &gt; really don&#39;t think I should change them because a few people <br/>\n </span></blockquote>wish  <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; they were different.  I don&#39;t think it&#39;s courteous or reasonable <br/>\n&gt; for  <br/>\n&gt; &gt; people to ask me to do my volunteer work just the way they <br/>\n </span></blockquote>imagine  <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; they would do it if they were me.<br/>\n&gt; &gt; <br/>\n&gt; &gt; I have said before &quot;If you can do it better, do it!&quot;  And I <br/>\n </span></blockquote>don&#39;t  <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; mean that in a mean way at all.  Anyone who sees flaws and can <br/>\n&gt; help  <br/>\n&gt; &gt; others in a better way should really, honestly, truly, do it.  <br/>\n </span></blockquote>The  <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; more free help people have, the better.<br/>\n&gt; &gt; <br/>\n&gt; &gt; Is it because it&#39;s free that I get complaints?  Maybe.  If <br/>\n </span></blockquote>someone  <br/>\n<blockquote><span title=\"qreply\"> &gt; &gt; pays money to a counsellor they just either accept the help or <br/>\n&gt; they  <br/>\n&gt; &gt; quit going, they don&#39;t harrass the person to change and do <br/>\n&gt; differently.<br/>\n&gt; &gt; <br/>\n&gt; &gt; Sandra<br/>\n&gt; &gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":176439663,"authorName":"kacsshultz","from":"&quot;kacsshultz&quot; &lt;kashultz@...&gt;","profile":"kacsshultz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: How many children do I have!?","postDate":"1186689642","msgId":30237,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY5ZnJwYSs0azkwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEIxNDU4ODNFLTRGRjMtNDRCRi04MEM5LTM3MjE4OUI1QzIzQUBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":30234,"nextInTopic":30238,"prevInTime":30236,"nextInTime":30238,"topicId":30233,"numMessagesInTopic":0,"msgSnippet":"Ironically, it has often been those train-wreck threads and defensive posters that have been the most instructive to me. Perhaps it is the posters seemingly","messageBody":"<div id=\"ygrps-yiv-626852681\">Ironically, it has often been those train-wreck threads and defensive <br/>\nposters that have been the most instructive to me.<br/>\n<br/>\nPerhaps it is the posters&#39; seemingly ridiculous inflexibility that <br/>\nsomehow highlights to me how crazy it is to be inflexible; perhaps it <br/>\nis the &quot;oh, I can do better than that&quot; though pattern that goes <br/>\nthrough my head.  Almost always they reinforce the fact that it is <br/>\nvery possible to do things a different way.<br/>\n<br/>\nOn the flip side, though, it&#39;s not helpful if real facilitators of <br/>\nchange get burnt out from that kind of dialogue.<br/>\n<br/>\nKelly<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; <br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;  From time to time someone wants me to treat people on this list <br/>\n </span></blockquote>the  <br/>\n<blockquote><span title=\"ireply\"> &gt; way I treat my children.<br/>\n&gt; What I want to do with this list is to help other adults discover <br/>\n </span></blockquote>and  <br/>\n<blockquote><span title=\"ireply\"> &gt; refine ways to treat their children more the way I treat my <br/>\n </span></blockquote>children,  <br/>\n<blockquote><span title=\"ireply\"> &gt; if they want to.<br/>\n&gt; <br/>\n&gt; I have a sign on my door, just put there last month, a paper taped  <br/>\n&gt; there at eye level that says<br/>\n&gt; <br/>\n&gt; ++++++++++++++++++++++<br/>\n&gt; NO SOLICITORS<br/>\n&gt; <br/>\n&gt; No tree trimming,<br/>\n&gt; no petitions<br/>\n&gt; no missionaries<br/>\n&gt; no encyclopedia sales<br/>\n&gt; no yard cleaning.<br/>\n&gt; ++++++++++++++++++++++<br/>\n&gt; <br/>\n&gt; Unlike some other people I know, I have listened to missionaries <br/>\n </span></blockquote>at  <br/>\n<blockquote><span title=\"ireply\"> &gt; length, invited them in, read their stuff, told them I admire <br/>\n </span></blockquote>their  <br/>\n<blockquote><span title=\"ireply\"> &gt; dedication, given them cold drinks or water.  I&#39;ve let Jehovah&#39;s  <br/>\n&gt; Witnesses talk to me at length, and LDS guys.  Lately I decided I  <br/>\n&gt; need to spend my time in other ways.  I&#39;m getting old.<br/>\n&gt; <br/>\n&gt; Kirby&#39;s working nights.  Holly sleeps late.  Whenever anyone <br/>\n </span></blockquote>touches  <br/>\n<blockquote><span title=\"ireply\"> &gt; our door the dog barks a high, painful bark.  I don&#39;t want people <br/>\n </span></blockquote>to  <br/>\n<blockquote><span title=\"ireply\"> &gt; trim our trees or clean our yard and someone was coming to the <br/>\n </span></blockquote>door  <br/>\n<blockquote><span title=\"ireply\"> &gt; once a week or so. I don&#39;t want to sign petitions for anyone to <br/>\n </span></blockquote>run  <br/>\n<blockquote><span title=\"ireply\"> &gt; for office or for people to pressure the government to do <br/>\n </span></blockquote>something  <br/>\n<blockquote><span title=\"ireply\"> &gt; about something I never heard of.<br/>\n&gt; <br/>\n&gt; Does that mean I&#39;m telling my children not to talk to me about  <br/>\n&gt; religion or not to help me in the yard?<br/>\n&gt; <br/>\n&gt; I will let Holly sleep as late as she wants to and I&#39;ll make her  <br/>\n&gt; anything she wants for breakfast, when she wants me to make her  <br/>\n&gt; breakfast, which isn&#39;t all the time, just sometimes.  This morning <br/>\n </span></blockquote>I  <br/>\n<blockquote><span title=\"ireply\"> &gt; was glad to make fried eggs and toast for her.  She was sweet and  <br/>\n&gt; grateful.<br/>\n&gt; <br/>\n&gt; Does that mean I should let just anyone sleep at my house as late <br/>\n </span></blockquote>as  <br/>\n<blockquote><span title=\"ireply\"> &gt; they want and then request a special breakfast?<br/>\n&gt; <br/>\n&gt; And on this discussion list, I&#39;m not trying to mother people.  I&#39;m  <br/>\n&gt; trying to discuss ideas and factors and practices that make <br/>\n </span></blockquote>parenting  <br/>\n<blockquote><span title=\"ireply\"> &gt; antagonistic, when those come up, so that ALL the people on the <br/>\n </span></blockquote>list,  <br/>\n<blockquote><span title=\"ireply\"> &gt; not just the person who posted, can look at their own thoughts, <br/>\n </span></blockquote>and  <br/>\n<blockquote><span title=\"ireply\"> &gt; rules, and expectations and see if they can&#39;t tweak them toward <br/>\n </span></blockquote>the  <br/>\n<blockquote><span title=\"ireply\"> &gt; direction they want to be with their children.<br/>\n&gt; <br/>\n&gt; Several who have known me online (or in person) for the dozen or <br/>\n </span></blockquote>so  <br/>\n<blockquote><span title=\"ireply\"> &gt; years I&#39;ve been in discussions like this have asked how I can  <br/>\n&gt; patiently answer the same questions year after year without  <br/>\n&gt; throttling people.  It&#39;s because I know that when someone *does*  <br/>\n&gt; change in understanding, the world gets better for their <br/>\n </span></blockquote>children.   <br/>\n<blockquote><span title=\"ireply\"> &gt; The world might be uncomfortable for the mom that day, but if she <br/>\n </span></blockquote>had  <br/>\n<blockquote><span title=\"ireply\"> &gt; wanted to stay the same, she never could have found this list.  If  <br/>\n&gt; she found this list and read some and thought it was bogus, she <br/>\n </span></blockquote>never  <br/>\n<blockquote><span title=\"ireply\"> &gt; would have posted on this list.<br/>\n&gt; <br/>\n&gt; I assume that people come to this list because they want to change.<br/>\n&gt; <br/>\n&gt; I am now, finally, getting tired of things like this (which came <br/>\n </span></blockquote>on  <br/>\n<blockquote><span title=\"ireply\"> &gt; the side, not to the list):<br/>\n&gt; <br/>\n&gt; -=- i don&#39;t think i can do better!!! i think YOU<br/>\n&gt; can do better, if you could maybe be less confrontational and more <br/>\n </span></blockquote>in<br/>\n<blockquote><span title=\"ireply\"> &gt; tune with the ideas of understanding and empathy, that you speak of<br/>\n&gt; regarding children.-=-<br/>\n&gt; <br/>\n&gt; The understanding and empathy I recommend parents show to their  <br/>\n&gt; children is a parent and child thing, and I can&#39;t be expected to  <br/>\n&gt; treat over 1000 people (however many are on this list) like <br/>\n </span></blockquote>they&#39;re  <br/>\n<blockquote><span title=\"ireply\"> &gt; on my children.<br/>\n&gt; <br/>\n&gt; BUT WAIT!  This list isn&#39;t a question and answer column where all <br/>\n </span></blockquote>the  <br/>\n<blockquote><span title=\"ireply\"> &gt; answers come from me.  Not at all.  When people post here they get  <br/>\n&gt; several people&#39;s feedback.  And they get the feedback from people <br/>\n </span></blockquote>who  <br/>\n<blockquote><span title=\"ireply\"> &gt; are pretty likely to be giving unschooling-focussed answers.  That  <br/>\n&gt; happens because I keep the list running, and keep spam and  <br/>\n&gt; distractions off of it.<br/>\n&gt; <br/>\n&gt; Below is a link to an explanation of why I think people who want <br/>\n </span></blockquote>help  <br/>\n<blockquote><span title=\"ireply\"> &gt; should get help quickly and directly.  With my kids, they have 18  <br/>\n&gt; years to learn to read, use a bank account and wipe their butts <br/>\n </span></blockquote>(not  <br/>\n<blockquote><span title=\"ireply\"> &gt; in that order).  With parents who have children, they do not have <br/>\n </span></blockquote>18  <br/>\n<blockquote><span title=\"ireply\"> &gt; years to change.  They don&#39;t have ten years.  They don&#39;t have <br/>\n </span></blockquote>five.   <br/>\n<blockquote><span title=\"ireply\"> &gt; They need to change before more damage is done to their <br/>\n </span></blockquote>relationship,  <br/>\n<blockquote><span title=\"ireply\"> &gt; before it&#39;s so far gone they no longer want to regroup and re-<br/>\n </span></blockquote>direct.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/unschool/gettingit\">http://sandradodd.com/unschool/gettingit</a><br/>\n&gt; <br/>\n&gt; And here are quotes from people who say they wish they had changed  <br/>\n&gt; sooner:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/ifonly\">http://sandradodd.com/ifonly</a><br/>\n&gt; <br/>\n&gt; I am very interested in helping those people.  I&#39;m less interested <br/>\n </span></blockquote>in  <br/>\n<blockquote><span title=\"ireply\"> &gt; helping people who want to be coddled, who complain about how I  <br/>\n&gt; phrase things, and who want to take years to consider whether <br/>\n </span></blockquote>they&#39;ll  <br/>\n<blockquote><span title=\"ireply\"> &gt; change their ways.  The statement before is NOT about any <br/>\n </span></blockquote>individual,  <br/>\n<blockquote><span title=\"ireply\"> &gt; it&#39;s about hundreds of people who have come through and complained  <br/>\n&gt; instead of coming through to look at what they&#39;re doing in the <br/>\n </span></blockquote>light  <br/>\n<blockquote><span title=\"ireply\"> &gt; of what others have discovered.<br/>\n&gt; <br/>\n&gt; If my website and articles and this list and UnschoolingDiscussion  <br/>\n&gt; are not to someone&#39;s tastes, that&#39;s to be expected.  That&#39;s fine.  <br/>\n </span></blockquote>I  <br/>\n<blockquote><span title=\"ireply\"> &gt; really don&#39;t think I should change them because a few people wish  <br/>\n&gt; they were different.  I don&#39;t think it&#39;s courteous or reasonable <br/>\n </span></blockquote>for  <br/>\n<blockquote><span title=\"ireply\"> &gt; people to ask me to do my volunteer work just the way they imagine  <br/>\n&gt; they would do it if they were me.<br/>\n&gt; <br/>\n&gt; I have said before &quot;If you can do it better, do it!&quot;  And I don&#39;t  <br/>\n&gt; mean that in a mean way at all.  Anyone who sees flaws and can <br/>\n </span></blockquote>help  <br/>\n<blockquote><span title=\"ireply\"> &gt; others in a better way should really, honestly, truly, do it.  The  <br/>\n&gt; more free help people have, the better.<br/>\n&gt; <br/>\n&gt; Is it because it&#39;s free that I get complaints?  Maybe.  If someone  <br/>\n&gt; pays money to a counsellor they just either accept the help or <br/>\n </span></blockquote>they  <br/>\n<blockquote><span title=\"ireply\"> &gt; quit going, they don&#39;t harrass the person to change and do <br/>\n </span></blockquote>differently.<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; Sandra<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Typo, sorry, in   How many children do I have!?","postDate":"1186684199","msgId":30234,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEMxRUIxNEE5LTFFMDktNDBCQy05RUMyLTA2QTM5OTJDNDVCM0BzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEIxNDU4ODNFLTRGRjMtNDRCRi04MEM5LTM3MjE4OUI1QzIzQUBzYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PEIxNDU4ODNFLTRGRjMtNDRCRi04MEM5LTM3MjE4OUI1QzIzQUBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":30233,"nextInTopic":30237,"prevInTime":30233,"nextInTime":30235,"topicId":30233,"numMessagesInTopic":0,"msgSnippet":"I meant to write: I can t be expected to treat over 1000 people (however many are on this list) like they re all my children. but I wrote this -=-like they re","messageBody":"<div id=\"ygrps-yiv-1673377002\">I meant to write:<br/>\nI can&#39;t be expected to treat over 1000 people (however many are on  <br/>\nthis list) like they&#39;re<br/>\nall my children.<br/>\n<br/>\nbut I wrote this<br/>\n-=-like they&#39;re on my children.-=-<br/>\n<br/>\n<br/>\nSorry.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"How many children do I have!?","postDate":"1186683470","msgId":30233,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEIxNDU4ODNFLTRGRjMtNDRCRi04MEM5LTM3MjE4OUI1QzIzQUBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":30234,"prevInTime":30232,"nextInTime":30234,"topicId":30233,"numMessagesInTopic":0,"msgSnippet":"From time to time someone wants me to treat people on this list the way I treat my children. What I want to do with this list is to help other adults discover","messageBody":"<div id=\"ygrps-yiv-1650555703\">From time to time someone wants me to treat people on this list the  <br/>\nway I treat my children.<br/>\nWhat I want to do with this list is to help other adults discover and  <br/>\nrefine ways to treat their children more the way I treat my children,  <br/>\nif they want to.<br/>\n<br/>\nI have a sign on my door, just put there last month, a paper taped  <br/>\nthere at eye level that says<br/>\n<br/>\n++++++++++++++++++++++<br/>\nNO SOLICITORS<br/>\n<br/>\nNo tree trimming,<br/>\nno petitions<br/>\nno missionaries<br/>\nno encyclopedia sales<br/>\nno yard cleaning.<br/>\n++++++++++++++++++++++<br/>\n<br/>\nUnlike some other people I know, I have listened to missionaries at  <br/>\nlength, invited them in, read their stuff, told them I admire their  <br/>\ndedication, given them cold drinks or water.  I&#39;ve let Jehovah&#39;s  <br/>\nWitnesses talk to me at length, and LDS guys.  Lately I decided I  <br/>\nneed to spend my time in other ways.  I&#39;m getting old.<br/>\n<br/>\nKirby&#39;s working nights.  Holly sleeps late.  Whenever anyone touches  <br/>\nour door the dog barks a high, painful bark.  I don&#39;t want people to  <br/>\ntrim our trees or clean our yard and someone was coming to the door  <br/>\nonce a week or so. I don&#39;t want to sign petitions for anyone to run  <br/>\nfor office or for people to pressure the government to do something  <br/>\nabout something I never heard of.<br/>\n<br/>\nDoes that mean I&#39;m telling my children not to talk to me about  <br/>\nreligion or not to help me in the yard?<br/>\n<br/>\nI will let Holly sleep as late as she wants to and I&#39;ll make her  <br/>\nanything she wants for breakfast, when she wants me to make her  <br/>\nbreakfast, which isn&#39;t all the time, just sometimes.  This morning I  <br/>\nwas glad to make fried eggs and toast for her.  She was sweet and  <br/>\ngrateful.<br/>\n<br/>\nDoes that mean I should let just anyone sleep at my house as late as  <br/>\nthey want and then request a special breakfast?<br/>\n<br/>\nAnd on this discussion list, I&#39;m not trying to mother people.  I&#39;m  <br/>\ntrying to discuss ideas and factors and practices that make parenting  <br/>\nantagonistic, when those come up, so that ALL the people on the list,  <br/>\nnot just the person who posted, can look at their own thoughts, and  <br/>\nrules, and expectations and see if they can&#39;t tweak them toward the  <br/>\ndirection they want to be with their children.<br/>\n<br/>\nSeveral who have known me online (or in person) for the dozen or so  <br/>\nyears I&#39;ve been in discussions like this have asked how I can  <br/>\npatiently answer the same questions year after year without  <br/>\nthrottling people.  It&#39;s because I know that when someone *does*  <br/>\nchange in understanding, the world gets better for their children.   <br/>\nThe world might be uncomfortable for the mom that day, but if she had  <br/>\nwanted to stay the same, she never could have found this list.  If  <br/>\nshe found this list and read some and thought it was bogus, she never  <br/>\nwould have posted on this list.<br/>\n<br/>\nI assume that people come to this list because they want to change.<br/>\n<br/>\nI am now, finally, getting tired of things like this (which came on  <br/>\nthe side, not to the list):<br/>\n<br/>\n-=- i don&#39;t think i can do better!!! i think YOU<br/>\ncan do better, if you could maybe be less confrontational and more in<br/>\ntune with the ideas of understanding and empathy, that you speak of<br/>\nregarding children.-=-<br/>\n<br/>\nThe understanding and empathy I recommend parents show to their  <br/>\nchildren is a parent and child thing, and I can&#39;t be expected to  <br/>\ntreat over 1000 people (however many are on this list) like they&#39;re  <br/>\non my children.<br/>\n<br/>\nBUT WAIT!  This list isn&#39;t a question and answer column where all the  <br/>\nanswers come from me.  Not at all.  When people post here they get  <br/>\nseveral people&#39;s feedback.  And they get the feedback from people who  <br/>\nare pretty likely to be giving unschooling-focussed answers.  That  <br/>\nhappens because I keep the list running, and keep spam and  <br/>\ndistractions off of it.<br/>\n<br/>\nBelow is a link to an explanation of why I think people who want help  <br/>\nshould get help quickly and directly.  With my kids, they have 18  <br/>\nyears to learn to read, use a bank account and wipe their butts (not  <br/>\nin that order).  With parents who have children, they do not have 18  <br/>\nyears to change.  They don&#39;t have ten years.  They don&#39;t have five.   <br/>\nThey need to change before more damage is done to their relationship,  <br/>\nbefore it&#39;s so far gone they no longer want to regroup and re-direct.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/unschool/gettingit\">http://sandradodd.com/unschool/gettingit</a><br/>\n<br/>\nAnd here are quotes from people who say they wish they had changed  <br/>\nsooner:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/ifonly\">http://sandradodd.com/ifonly</a><br/>\n<br/>\nI am very interested in helping those people.  I&#39;m less interested in  <br/>\nhelping people who want to be coddled, who complain about how I  <br/>\nphrase things, and who want to take years to consider whether they&#39;ll  <br/>\nchange their ways.  The statement before is NOT about any individual,  <br/>\nit&#39;s about hundreds of people who have come through and complained  <br/>\ninstead of coming through to look at what they&#39;re doing in the light  <br/>\nof what others have discovered.<br/>\n<br/>\nIf my website and articles and this list and UnschoolingDiscussion  <br/>\nare not to someone&#39;s tastes, that&#39;s to be expected.  That&#39;s fine.  I  <br/>\nreally don&#39;t think I should change them because a few people wish  <br/>\nthey were different.  I don&#39;t think it&#39;s courteous or reasonable for  <br/>\npeople to ask me to do my volunteer work just the way they imagine  <br/>\nthey would do it if they were me.<br/>\n<br/>\nI have said before &quot;If you can do it better, do it!&quot;  And I don&#39;t  <br/>\nmean that in a mean way at all.  Anyone who sees flaws and can help  <br/>\nothers in a better way should really, honestly, truly, do it.  The  <br/>\nmore free help people have, the better.<br/>\n<br/>\nIs it because it&#39;s free that I get complaints?  Maybe.  If someone  <br/>\npays money to a counsellor they just either accept the help or they  <br/>\nquit going, they don&#39;t harrass the person to change and do differently.<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":30287,"nextTopicId":30292}}