{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":33,"messages":[{"userId":326782993,"authorName":"Vidyut Kale","from":"Vidyut Kale &lt;wide.aware@...&gt;","profile":"vidyutgore","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Separations, divorce and unschooling","postDate":"1267022364","msgId":51095,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc5YzFkMWI0MTAwMjI0MDYzOWo2MGVmMmEzMHRlMTYyZDkwNWUyYzk0OGVmQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PEE4NTk1NDQyLTRBODYtNDMzNC04QjAxLTc1QzIzRDYwNzJGNUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGhtMzNlbStqYWtlQGVHcm91cHMuY29tPgkgPEE4NTk1NDQyLTRBODYtNDMzNC04QjAxLTc1QzIzRDYwNzJGNUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":51094,"nextInTopic":51101,"prevInTime":51094,"nextInTime":51096,"topicId":50895,"numMessagesInTopic":0,"msgSnippet":"I don t remember my own potty training, but I had two cousins three and six years younger growing up with my grandmom, like me. I remember what aaji (grandmom)","messageBody":"<div id=\"ygrps-yiv-2005719189\">I don&#39;t remember my own potty training, but I had two cousins three and six<br/>\nyears younger growing up with my grandmom, like me. I remember what aaji<br/>\n(grandmom) used to do. I assume I underwent the same stuff. I don&#39;t remember<br/>\nany issues with both of them.<br/>\n<br/>\nShe basically used to put a newspaper on the floor and let them squat on it<br/>\nand keep them entertained till &#39;it happened&#39;. Often just outside the toilet<br/>\ndoor, in the passage. As they grew older, she used to take me away (I used<br/>\nto tease them and that distracted them, or they didn&#39;t like - I don&#39;t<br/>\nremember) and we both used to spend time elsewhere till they announced<br/>\n&#39;done&#39;. Eventually they graduated to sitting on a paper in the loo and<br/>\nfinally squatting directly on the pot holding on to her. I remember my early<br/>\ngraduation to toilets as desperate attempts to hold it and refusing to go on<br/>\npaper like a kid when the loo was busy (grandpa used to take ages in there).<br/>\nI remember the same happening with the other two. None of us ever had the<br/>\nsitting type potties. I got one for Nisarga, but he is too young for it. the<br/>\nelder cousin got one for her son which he uses as a chair, but goes on a<br/>\nnewspaper when he has to poop.<br/>\n<br/>\nOf course it helped that Indian toilets are the squatting type, so<br/>\nprogressing to a &#39;real&#39; toilet was simply squatting in another place and no<br/>\nhuge learning curve.<br/>\n<br/>\nBut I don&#39;t think you have that kind of a toilet, so I don&#39;t know how this<br/>\ncould be adapted. I&#39;ll ask my aunt. These older Indian women are amazing<br/>\nwith toilet training. Very few from my generation had any toilet training<br/>\nproblems.<br/>\n<br/>\nI&#39;ll ask around for the women with the sitting type toilets and what they<br/>\ndid for toilet training and share if I find out anything useful other than<br/>\nthis.<br/>\n<br/>\nVidyut<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Wed, Feb 24, 2010 at 7:00 PM, Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; -=-that element of choosing to honor the promise makes our marriage<br/>\n&gt; strong, it makes our interactions necessarily thoughtful and<br/>\n&gt; respectful most all the time, and it helps our kids -- his, who&#39;ve<br/>\n&gt; already been through the devastation of losing their parents&#39;<br/>\n&gt; marriage, and ours, who will never, ever experience their parents<br/>\n&gt; splitting up.-=-<br/>\n&gt;<br/>\n&gt; Deb,<br/>\n&gt;<br/>\n&gt; As I read your post I thought I was reading something to the<br/>\n&gt; PeacefulPartners list and was really glad something so good and<br/>\n&gt; different had been posted. Then I saw that AlwaysLearning was your<br/>\n&gt; target audience.<br/>\n&gt;<br/>\n&gt; Although I don&#39;t mind this list having better discussions about<br/>\n&gt; marriages than the list about unschooling families&#39; marriages...<br/>\n&gt; would it be okay with you if I (or Schuyler) quote your post on that<br/>\n&gt; other list? It&#39;s here:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/Peacefulpartnerships/\">http://groups.yahoo.com/group/Peacefulpartnerships/</a><br/>\n&gt;<br/>\n&gt; What you wrote was really inspiring.<br/>\n&gt;<br/>\n&gt; I wrote our marriage ceremony when Keith and I got married. There was<br/>\n&gt; a part about the community supporting the marriage, and that the<br/>\n&gt; people who attended were our community. I&#39;m about to leave for<br/>\n&gt; Colorado so can&#39;t look for it today, but I hope I&#39;ll remember to find<br/>\n&gt; that and quote it. I take that seriously. We&#39;re answerable to each<br/>\n&gt; other and also everybody who took the time and trouble to come to our<br/>\n&gt; wedding and bring us gifts.<br/>\n&gt;<br/>\n&gt; Sandra<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":240838916,"authorName":"Deborah McKee Kelly","from":"Deborah McKee Kelly &lt;dlmckee@...&gt;","profile":"hael_harobed","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Separations, divorce and unschooling","postDate":"1267021414","msgId":51094,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc4NjBiMzFlMTAwMjI0MDYyM3gyNmNjYjhjcjM3NzUyZDM1NTIyNzA1OGJAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":51092,"nextInTopic":51095,"prevInTime":51093,"nextInTime":51095,"topicId":50895,"numMessagesInTopic":0,"msgSnippet":"I actually thought of posting to the PeacefulPartnerships list, because I ve been reading it lately, with all the stuff going on over there -- but I saw this","messageBody":"<div id=\"ygrps-yiv-1316517312\">I actually thought of posting to the PeacefulPartnerships list, because I&#39;ve<br/>\nbeen reading it lately, with all the stuff going on over there -- but I saw<br/>\nthis note on the AlwaysLearning board and wanted to post here.  But, sure,<br/>\nrepost it there if you like.  Thank you!<br/>\n<br/>\nDeb<br/>\n<br/>\nSandra wrote: As I read your post I thought I was reading something to the<br/>\nPeacefulPartners list and was really glad something so good and different<br/>\nhad been posted. Then I saw that AlwaysLearning was your target audience.<br/>\n<br/>\nAlthough I don&#39;t mind this list having better discussions about<br/>\nmarriages than the list about unschooling families&#39; marriages...<br/>\nwould it be okay with you if I (or Schuyler) quote your post on that other<br/>\nlist? It&#39;s here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/Peacefulpartnerships/\">http://groups.yahoo.com/group/Peacefulpartnerships/</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Separations, divorce and unschooling","postDate":"1267018225","msgId":51092,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE4NTk1NDQyLTRBODYtNDMzNC04QjAxLTc1QzIzRDYwNzJGNUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhtMzNlbStqYWtlQGVHcm91cHMuY29tPg==","referencesHeader":"PGhtMzNlbStqYWtlQGVHcm91cHMuY29tPg=="},"prevInTopic":51088,"nextInTopic":51094,"prevInTime":51091,"nextInTime":51093,"topicId":50895,"numMessagesInTopic":0,"msgSnippet":"-=-that element of choosing to honor the promise makes our marriage strong, it makes our interactions necessarily thoughtful and respectful most all the time,","messageBody":"<div id=\"ygrps-yiv-508755012\">-=-that element of choosing to honor the promise makes our marriage  <br/>\nstrong, it makes our interactions necessarily thoughtful and  <br/>\nrespectful most all the time, and it helps our kids -- his, who&#39;ve  <br/>\nalready been through the devastation of losing their parents&#39;  <br/>\nmarriage, and ours, who will never, ever experience their parents  <br/>\nsplitting up.-=-<br/>\n<br/>\nDeb,<br/>\n<br/>\nAs I read your post I thought I was reading something to the  <br/>\nPeacefulPartners list and was really glad something so good and  <br/>\ndifferent had been posted.  Then I saw that AlwaysLearning was your  <br/>\ntarget audience.<br/>\n<br/>\nAlthough I don&#39;t mind this list having better discussions about  <br/>\nmarriages than the list about unschooling families&#39; marriages...   <br/>\nwould it be okay with you if I (or Schuyler) quote your post on that  <br/>\nother list?   It&#39;s here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/Peacefulpartnerships/\">http://groups.yahoo.com/group/Peacefulpartnerships/</a><br/>\n<br/>\nWhat you wrote was really inspiring.<br/>\n<br/>\nI wrote our marriage ceremony when Keith and I got married.  There was  <br/>\na part about the community supporting the marriage, and that the  <br/>\npeople who attended were our community.   I&#39;m about to leave for  <br/>\nColorado so can&#39;t look for it today, but I hope I&#39;ll remember to find  <br/>\nthat and quote it.  I take that seriously.  We&#39;re answerable to each  <br/>\nother and also everybody who took the time and trouble to come to our  <br/>\nwedding and bring us gifts.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":240838916,"authorName":"Hael","from":"&quot;Hael&quot; &lt;dlmckee@...&gt;","profile":"hael_harobed","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Separations, divorce and unschooling","postDate":"1267011862","msgId":51088,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhtMzNlbStqYWtlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEMyQjA1MjNGLTEzQzEtNDEzRi04OTUxLUJGRUU2NDVBREZCOEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":51036,"nextInTopic":51092,"prevInTime":51087,"nextInTime":51089,"topicId":50895,"numMessagesInTopic":0,"msgSnippet":"I m coming to this discussion late, but long before we were unschoolers, my husband and I (both atheists working on mindful living) agreed that no matter what","messageBody":"<div id=\"ygrps-yiv-205791122\">I&#39;m coming to this discussion late, but long before we were unschoolers, my husband and I (both atheists working on mindful living) agreed that no matter what happened in our relationship, we would never divorce, we would never separate, and we would never threaten to leave.  Those promises -- true, unwavering promises -- require us to find solutions to issues that arise.<br/>\n<br/>\nIn my husband&#39;s prior relationship (a volatile 10-year marriage), his ex-wife threatened to leave so many times that it almost became a joke, except for the devastation it caused my husband and his two kids.  And of course, it eventually ended with her threatening to leave, and him finally saying, &quot;okay.&quot;<br/>\n<br/>\nMy sweet husband still suffers a good deal of anxiety over the fear of me abandoning him if I&#39;m upset about anything.  I reassure him over and over that I will never leave, I will never threaten to leave.  <br/>\n<br/>\nWe now have a baby of our own, another babe on the way, and my hubby&#39;s two older kids (9 and 14).  <br/>\n<br/>\nIn the time that we have been together (5 years), we have watched the kids&#39; mom (hubby&#39;s ex) go through multiple relationships, including another volatile marriage that began and ended rather quickly and passionately.  <br/>\n<br/>\nI think I became a proponent of this &quot;we are never divorcing&quot; thing some years ago when I was in a very serious, near-marriage relationship with a man I was certain would be my husband.  He and I regularly spoke of our future married life, our future children, and we lived as though we would soon be married.  He never proposed, however, and when the subject came up, he faltered.  His favorite question was, &quot;But how do we KNOW it will last?  How do we know we&#39;ll continue to love each other?&quot;<br/>\n<br/>\nAnd those questions just baffled me.  I didn&#39;t have any way to convince him that some outside force would MAKE our commitment ongoing -- to me, the answer was, &quot;We will choose to make it last.  We will choose to continue loving each other, and we&#39;ll continue to choose that for the sake of ourselves and our children.&quot;<br/>\n<br/>\nHe didn&#39;t understand that.  We came at it from opposite ends of the spectrum, he believing that love/commitment is forced in certain directions by external forces (out of our control), and me believing that love and commitment are choices.  <br/>\n<br/>\nWhen that relationship ended, I vowed that I would seek a partner who believed in the proactive approach of choosing to make a marriage promise last.<br/>\n<br/>\nI grew up in a home where both my parents stayed married to each other, but both my parents had been married before, had kids, and had divorced.  My half-siblings have, in my opinion, never recovered from those divorces.  I&#39;ve learned a lot from watching my parents work out their issues, and they&#39;ve also shared with me over the years the reasons for their first marriage failures.  I think some of it just had to do with the culture in the late 60s, when all my parents&#39; friends were divorcing because they weren&#39;t &quot;happy.&quot;<br/>\n<br/>\nAnyway, I just wanted to chime in.  Maybe I&#39;m simplifying it too much, but to me, that element of choosing to honor the promise makes our marriage strong, it makes our interactions necessarily thoughtful and respectful most all the time, and it helps our kids -- his, who&#39;ve already been through the devastation of losing their parents&#39; marriage, and ours, who will never, ever experience their parents splitting up.<br/>\n<br/>\nI don&#39;t think you can overestimate the importance of that choice.<br/>\n<br/>\n- Deb<br/>\n<br/>\nSandra said:<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; Seriously?  People think religion is the only purpose of marriage?  I  <br/>\n&gt; think that only comes from having been religious and then left, and  <br/>\n&gt; thinking that now that one isn&#39;t religious, all the &quot;rules&quot; are gone,  <br/>\n&gt; because they only had to do with making God happy.   Some people think  <br/>\n&gt; maybe that atheists like to run around lying and killing and getting  <br/>\n&gt; divorced.<br/>\n<br/>\n&gt; <br/>\n&gt; It&#39;s not good for unschooling.  It&#39;s not good for peaceful parenting. </span></blockquote></div>","specialLinks":[]},{"userId":220041937,"authorName":"Heather","from":"Heather &lt;hbmccarty@...&gt;","profile":"heather13068","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Separations, divorce and unschooling","postDate":"1266937192","msgId":51036,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCODNFRDY4LjkwNDAwMDhAdHdjbnkucnIuY29tPg==","inReplyToHeader":"PEMyQjA1MjNGLTEzQzEtNDEzRi04OTUxLUJGRUU2NDVBREZCOEBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PEMyQjA1MjNGLTEzQzEtNDEzRi04OTUxLUJGRUU2NDVBREZCOEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":51023,"nextInTopic":51088,"prevInTime":51035,"nextInTime":51037,"topicId":50895,"numMessagesInTopic":0,"msgSnippet":"... This was me saying that, and that is just one example I have seen of divorce ending unschooling or home schooling. I live in New York State, which is not","messageBody":"<div id=\"ygrps-yiv-1026816439\">Sandra Dodd wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; -----------------<br/>\n&gt; One friend, whose husband left her, she fought really hard to keep<br/>\n&gt; the marriage together, said - we have all the bad parts of the<br/>\n&gt; relationship still with none of the good parts. Her kids are both in<br/>\n&gt; school now, BTW.<br/>\n&gt; ---------------<br/>\n&gt;<br/>\n&gt; It&#39;s not good for unschooling. It&#39;s not good for peaceful parenting.<br/>\n&gt;<br/>\n&gt; Sandra<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>This was me saying that, and that is just one example I have seen of <br/>\ndivorce ending unschooling or home schooling. I live in New York State, <br/>\nwhich is not the simplest state to unschool in, as we have some of the <br/>\nmost intrusive home schooling laws in the US. But the only times I have <br/>\nseen unschooling or homeschooling threatened or end in  a family, <br/>\nagainst the will of the mom and the kids, is is the case of divorce.<br/>\n<br/>\nI have seen these things happen in a divorce in a home schooling family:<br/>\n<br/>\nA spouse who has been a supporter of  unschooling or homeschooling all <br/>\nalong, will do a 180 on the whole idea and try and sometimes succeed in <br/>\nending home schooling in that family after he leaves the family, and is <br/>\ninfluenced by a new partner.<br/>\n<br/>\nOne mom who had recently separated from her husband, spent a week away, <br/>\nand left their two kids with the husband. When she returned she <br/>\ndiscovered they had both been enrolled in school. They were there for a <br/>\nlong time, as the courts agreed that was best, and were going to be <br/>\nallowed to choose for themselves when they were &quot;old enough&quot;- maybe 12 <br/>\nor 13.<br/>\n<br/>\nThe mom needs to work, and it becomes easier for the kids to be in school.<br/>\n<br/>\nThe mom keeps her fingers crossed that the dad, who hasn&#39;t been involved <br/>\nfor a long time and has come back into the picture with overnight <br/>\nvisits, doesn&#39;t find out that their 12 year old doesn&#39;t read yet.<br/>\n<br/>\nI have also seen divorces where some or all of the kids continue to <br/>\nunschool. Not that many, though. Having enough resources to split <br/>\nbetween two households can help, but itself isn&#39;t enough.<br/>\n<br/>\nI decided quite a while ago that if for no other reason than being able <br/>\nto continue unschooling, it was worth to do all the work it took to keep <br/>\nour marriage strong, even if it seemed my husband wasn&#39;t doing what I <br/>\nthought was his share. Luckily, there are lots of other benefits, too!<br/>\n<br/>\nHeather in NY</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Separations, divorce and unschooling","postDate":"1266872363","msgId":51023,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYyMjE4NC42MjU2MC5xbUB3ZWIxMTA0MDQubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PGhsdTZqZStvZDMyQGVHcm91cHMuY29tPg==","referencesHeader":"PGhsdTZqZStvZDMyQGVHcm91cHMuY29tPg=="},"prevInTopic":51013,"nextInTopic":51036,"prevInTime":51022,"nextInTime":51024,"topicId":50895,"numMessagesInTopic":0,"msgSnippet":"***I have suggested to my friends they try to work it out, or seek help. They are all unschoolers, and all have heard of Retrouvaille, so they know it s an","messageBody":"<div id=\"ygrps-yiv-325237032\">***I have suggested to my friends they try to work it out, or seek help. They are all unschoolers, and all have heard of Retrouvaille, so they know it&#39;s an option. ***<br/>\n<br/>\n<br/>\nRetrouvaille is nice because it&#39;s a bit like a peace and conflict resolution meeting.  Something that I think about in regards to unschooling, is that what I&#39;m helping to do, is bring peace and happiness into the world one child at a time.  If parents, who have loved each other, come from similar cultural traditions, and are bonded through genetic/biology of passing on to future humans, can&#39;t get along and learn how to be peaceful and resolve conflict, how can any nation or country do it?<br/>\n<br/>\nSwitzerland has a divorce rate of about 25%, while the US has a divorce rate of about 45%.  I was wondering if it had anything to do with how Switzerland plays neutral in the world war games.  Perhaps as a culture they value peace and conflict resolution more than the US and other nations.  That factor may have nothing to do with it, it could be entirely different reasons.  I&#39;m not trying to make generalizations here, this was something that I&#39;ve been thinking about since talks of divorce have been around in unschooling circles.<br/>\n<br/>\nMonetary struggles are a huge factor in divorce rates.  Many people are struggling financially, it causes stress in families.  Divorcing doesn&#39;t make those things go away, and it certainly doesn&#39;t make it easier.  There has also been, statistically, a marker around 7-10 yrs of being married, where couples tend to go through a transition.  If couples can recognize it for what it is, and work through it, they&#39;ll come out the other side and realize one day that they&#39;ve been married for 20 yrs and that transition will feel like a blip on the marriage radar.  Couples that don&#39;t have patience or insight and knowledge about marriages, may not even realize that they are going through a statistical normality.  I think if couples could see it, they may be able to ride it out and get through it.  One thing that may help is talking with older couples that have been there done that.  Sometimes couples will struggle for years beyond that marker, not ever realizing<br/>\n that their relationship was going through a transition, one that they&#39;ve yet to come to terms with.<br/>\n<br/>\nI&#39;m not very sympathetic to couples with children, getting divorced.  I&#39;ve seen far too many couples do that, and it&#39;s NEVER good for children, even if the reasons are sound.  What IS good for children is modeling love and support for one another, modeling giving and self sacrifice to people you love and care about.  Divorce is NOT about that at all, even if both parents are being loving and supportive to the kids.<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":180234378,"authorName":"Sylvia","from":"&quot;Sylvia&quot; &lt;sylgt04@...&gt;","profile":"sylgt04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Separations, divorce and unschooling","postDate":"1266851246","msgId":51013,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhsdTZqZStvZDMyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDNhOTNmZmYxMTAwMjIyMDU1M3c2OWM5MTk0MHA0MTEwYTdlMzgwZWYxYTAyQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":51009,"nextInTopic":51023,"prevInTime":51012,"nextInTime":51014,"topicId":50895,"numMessagesInTopic":0,"msgSnippet":"Retrouvaille.org is a good idea, Sylvia.  Maybe suggest it? ... *** I have suggested to my friends they try to work it out, or seek help.  They are all","messageBody":"<div id=\"ygrps-yiv-728824498\">Retrouvaille.org is a good idea, Sylvia.  Maybe suggest it?<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; ~Katherine<br/>\n<br/>\n </span></blockquote>***<br/>\n<br/>\nI have suggested to my friends they try to work it out, or seek help.  They are all unschoolers, and all have heard of Retrouvaille, so they know it&#39;s an option. <br/>\n<br/>\nI have also assured them that, come what may, I will be as supportive of them and their children as I have always been. <br/>\n<br/>\nSylvia</div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Separations, divorce and unschooling","postDate":"1266846805","msgId":51009,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNhOTNmZmYxMTAwMjIyMDU1M3c2OWM5MTk0MHA0MTEwYTdlMzgwZWYxYTAyQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDg1NjkwNy40OTQ1NC5xbUB3ZWI1MzgwMi5tYWlsLnJlMi55YWhvby5jb20+","referencesHeader":"PDg1NjkwNy40OTQ1NC5xbUB3ZWI1MzgwMi5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":51008,"nextInTopic":51013,"prevInTime":51008,"nextInTime":51010,"topicId":50895,"numMessagesInTopic":0,"msgSnippet":"Retrouvaille.org is a good idea, Sylvia.  Maybe suggest it? ~Katherine ... [Non-text portions of this message have been removed]","messageBody":"<div id=\"ygrps-yiv-1928948108\">Retrouvaille.org is a good idea, Sylvia.  Maybe suggest it?<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sat, Feb 20, 2010 at 8:49 PM, Sylvia Toyama &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sylgt04@...\">sylgt04@...</a>&gt; wrote:<br/>\n<br/>\n&gt; When parents create a nest, and<br/>\n&gt;<br/>\n&gt; decide to put children into it, it behooves them to maintain that nest<br/>\n&gt;<br/>\n&gt; in as clean, safe, warm and stable a way as they can.   IF they want<br/>\n&gt;<br/>\n&gt; to add unschooling to their mix, then they REALLY truly need to keep<br/>\n&gt;<br/>\n&gt; the situation stable!!  Because breaking up means school, almost<br/>\n&gt;<br/>\n&gt; certainly.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; So for unschooling advice, a stable family is an essential element.<br/>\n&gt;<br/>\n&gt; Kids don&#39;t learn well when they don&#39;t feel safe and loved.  Kids don&#39;t<br/>\n&gt;<br/>\n&gt; learn when their basic need for positive regard isn&#39;t met.  Kids need<br/>\n&gt;<br/>\n&gt; parents who can pay gentle, direct attention to them, not be<br/>\n&gt;<br/>\n&gt; distracted and furious and working two jobs and pissed off at their<br/>\n&gt;<br/>\n&gt; other parent.<br/>\n&gt;<br/>\n&gt; ******<br/>\n&gt;<br/>\n&gt; I know that in past years, when I&#39;ve seen divorces in unschooling families,<br/>\n&gt; kids ended up in school (in two cases, at least -- don&#39;t know what happened<br/>\n&gt; in the third).<br/>\n&gt;<br/>\n&gt; Having seen five marriages in unschooling families fall apart in the past 5<br/>\n&gt; months (a truly frightening statistic in my own circle of friends), I hope<br/>\n&gt; there can be some way to save unschooling for these kids I know and love.  I<br/>\n&gt; hope the parents involved can find some way to be that loving, safe place<br/>\n&gt; kids need to be able to learn, that they are able to keep providing a refuge<br/>\n&gt; for the kids uppermost in their thoughts and plans.  Yes, ideally they&#39;d<br/>\n&gt; find some way to stay together, but it appears divorce is inevitable. For<br/>\n&gt; the sake of their kids, who already have enough to deal with, adding school<br/>\n&gt; would be like salt in an open wound.<br/>\n&gt;<br/>\n&gt; It all has me wondering what I, as part of an unschooling community, can do<br/>\n&gt; to support my unschooling friends whose marriage is ending but both parents<br/>\n&gt; (or maybe only the one who didn&#39;t want to separate) want to continue<br/>\n&gt; unschooling.<br/>\n&gt;<br/>\n&gt; Sylvia<br/>\n&gt;<br/>\n&gt; www.ourhapahome.blogspot.com<br/>\n&gt;<br/>\n&gt; www.mysquareone.blogspot.com<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ------------------------------------<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Separations, divorce and unschooling","postDate":"1266846135","msgId":51008,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNhOTNmZmYxMTAwMjIyMDU0MndhZmZmNmI2cDQxZmM4NjNiODM0YWY0ODdAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PDc5YzFkMWI0MTAwMjIwMDkyNm83ZmQzOTdiNHJhYzIxY2QyN2M0ZmNjOTEyQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDRCODAwNDYwLjIwNDAwMDNAeWFob28uY2E+CSA8NTA2OTY3Ljk2NTIyLnFtQHdlYjMzMjA1Lm1haWwubXVkLnlhaG9vLmNvbT4JIDw3OWMxZDFiNDEwMDIyMDA5MDZsNWVlMjFhOGV3Njc1M2NlYTYwMzU1ZjZmN0BtYWlsLmdtYWlsLmNvbT4JIDw3OWMxZDFiNDEwMDIyMDA5MjZvN2ZkMzk3YjRyYWMyMWNkMjdjNGZjYzkxMkBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":50951,"nextInTopic":51009,"prevInTime":51007,"nextInTime":51009,"topicId":50895,"numMessagesInTopic":0,"msgSnippet":"Vidyut, I agree with your view on this completely. It is wonderful the things we can learn in any path we take. Valuing what we learn, well and truly valuing","messageBody":"<div id=\"ygrps-yiv-1832485259\">Vidyut, I agree with your view on this completely. It is wonderful the<br/>\nthings we can learn in any path we take. Valuing what we learn, well and<br/>\ntruly valuing it, can lead to ever so much better ability to honor ourselves<br/>\nand the ones we&#39;re with. I just had to laugh the other day when someone was<br/>\npoking fun at the idea of &quot;love the one you&#39;re with&quot; because she seemed to<br/>\nhave an ideal that didn&#39;t translate into a personal value unfortunately. I<br/>\nlaugh because it&#39;s my choice to be happy rather than attach a petty<br/>\nanti-ideal to a slogan. Being open to life is a much more interesting focus<br/>\nthan fussing with words and something out there that might theoretically be<br/>\nin charge of life.<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sat, Feb 20, 2010 at 12:26 PM, Vidyut Kale &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:wide.aware@...\">wide.aware@...</a>&gt; wrote:<br/>\n<br/>\n&gt; &quot;I knew all this before I wasted my time walking down the isle! &quot;<br/>\n&gt;<br/>\n&gt; I don&#39;t know how you mean this, but I have learned to value every moment of<br/>\n&gt; life for the joy or learning it has brought me. Sometimes it has been a<br/>\n&gt; learning of pain. If I see something I did from the bottom of my heart as a<br/>\n&gt; waste, I am &#39;dehumanizing&#39; me, by stripping the value of something intimate<br/>\n&gt; and emotional that I grudge in hindsight because I don&#39;t want to look at<br/>\n&gt; the<br/>\n&gt; fallout. I&#39;d rather wipe the validity and value of the whole thing. It<br/>\n&gt; disables me from truly appreciating myself fully and accepting &#39;mistakes&#39;<br/>\n&gt; in<br/>\n&gt; others, including children.<br/>\n&gt;<br/>\n&gt; I do think I misunderstood, as the rest of your post doesn&#39;t sound like a<br/>\n&gt; waste. Indeed your husband sounds quite virtuous from how you talk about<br/>\n&gt; him!<br/>\n&gt;<br/>\n&gt; Vidyut<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ------------------------------------<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Separations, divorce and unschooling","postDate":"1266726387","msgId":50951,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY3Q0E5RjNGLTVGOTUtNDNGNi1BNUJBLTY5QkEwNDEyQjI0RkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDUwMTEzOS43MzMwMC5xbUB3ZWIzMzIwNi5tYWlsLm11ZC55YWhvby5jb20+","referencesHeader":"PDUwMTEzOS43MzMwMC5xbUB3ZWIzMzIwNi5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":50950,"nextInTopic":51008,"prevInTime":50950,"nextInTime":50952,"topicId":50895,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Separations, divorce and unschooling","postDate":"1266725642","msgId":50950,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMxNjVDNkE1LThGMzItNEU1Mi1BQ0Q2LUJFMTM5QjIwNDA5OUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDMxMzY0OC4xNDk1OS5xbUB3ZWIzMzIwNi5tYWlsLm11ZC55YWhvby5jb20+","referencesHeader":"PDMxMzY0OC4xNDk1OS5xbUB3ZWIzMzIwNi5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":50948,"nextInTopic":50951,"prevInTime":50949,"nextInTime":50951,"topicId":50895,"numMessagesInTopic":0,"msgSnippet":"-=-I fully agree... only difference I have is, I m not 100% focused on unschooling-=- This discussion list is 100% focused on unschooling, so if one of the ","messageBody":"<div id=\"ygrps-yiv-1155697783\">-=-I fully agree... only difference I have is, I&#39;m not 100% focused on  <br/>\nunschooling-=-<br/>\n<br/>\nThis discussion list is 100% focused on unschooling, so if one of the  <br/>\nparticipants is not, there&#39;s no real advantage to saying so.   The  <br/>\ndescription of the list says &quot;How and why does unschooling work? What  <br/>\nkind of parents and parenting does it take? What will help, and what  <br/>\nwill hinder?<br/>\nThis is a list for the examination of the philosophy of unschooling  <br/>\nand attentive parenting and a place for sharing examined lives based  <br/>\non the principles underlying unschooling.&quot;<br/>\n<br/>\nLet&#39;s keep the discussion as close to unschooling as possible.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":124890047,"authorName":"Bev","from":"Bev &lt;beverlyreed2002@...&gt;","profile":"beverlyreed2002","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] Re: Separations, divorce and unschooling","postDate":"1266725398","msgId":50948,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUwMTEzOS43MzMwMC5xbUB3ZWIzMzIwNi5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PDY2ODQyNS41MzYxMC5xbUB3ZWI2NTYwNy5tYWlsLmFjNC55YWhvby5jb20+"},"prevInTopic":50945,"nextInTopic":50950,"prevInTime":50947,"nextInTime":50949,"topicId":50895,"numMessagesInTopic":0,"msgSnippet":"Completely agree!!! Like my aunt told me once... marriage is NEVER 50/50... sometimes it is 70/30, but most one is giving more than the other! And my aunt","messageBody":"<div id=\"ygrps-yiv-536835277\">Completely agree!!! Like my aunt told me once... marriage is NEVER 50/50... sometimes it is 70/30, but most one is giving more than the other! And my aunt asked me if I liked him, not loved him, what do i not like about the man... because that will be our biggest issues later when the &quot;magic&quot; has worn off... <br/>\n<br/>\n<br/>\n<br/>\n.~*~._.~*~._BEVERLY_.~*~._.~*~.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Sat, 2/20/10, Glenda &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:wtexans@...\">wtexans@...</a>&gt; wrote:<br/>\n<br/>\n<br/>\nFrom: Glenda &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:wtexans@...\">wtexans@...</a>&gt;<br/>\nSubject: RE: [AlwaysLearning] Re: Separations, divorce and unschooling<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nDate: Saturday, February 20, 2010, 6:50 PM<br/>\n<br/>\n<br/>\n---I think we, as a society, don&#39;t pass on the information to the next<br/>\ngeneration that marriage isn&#39;t always easy or even good, but that working on<br/>\nit IS good.---<br/>\n <br/>\nI can&#39;t second that suggestion loud enough, Pam!  I have often thought, these past two years especially (as hubby and I have worked pretty successfully through some rough stuff), that there is simply no way I would&#39;ve understand when I got married 20 years ago just how challenging things can get, and that I would be able to dig down deep inside and find it within myself to *want* to work through those things -- that things could get so bad and you&#39;d still be able to come out the other side of it as a couple. <br/>\n <br/>\nMy parents divorced and then each remarried twice -- my mom has been divorced for almost as long as I&#39;ve been married, but my dad and his third wife have been married nearly a decade longer than hubby and I -- it was being around he and his wife for a year or so before I met my hubby that I finally saw and began to understand how marriages are *supposed* to work. It was truly an &quot;a-ha!&quot; experience being around them.<br/>\n <br/>\nI also remember my stepmom telling me, when hubby and I were first married and oh-so-broke, that it&#39;s very easy to quit feeling the love for your spouse when finances are tight. She and my dad told us about some tough financial times they went through and how they worked through them together. That was not an experience I&#39;d seen in my mom&#39;s marriages -- I&#39;d always seen lots of fighting and power struggles when finances were tight. <br/>\n <br/>\nSo, yes, it is absolutely important for us, as parents, to model for our kids, and pass the information to them, that there are ups and downs, and that the downs can be unimaginably far down, but that it is (generally) very worth the effort to work back towards &quot;up&quot; again as a couple. Especially once kids are in the picture.<br/>\n <br/>\nMy paternal grandparents were married quite a long time (at least 50 years, but maybe closer to 60) and I so wish I&#39;d thought, back when my grandma was still alive, to ask her about the ups and downs in their marriage. <br/>\n <br/>\nGlenda<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n------------------------------------<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":67727291,"authorName":"Glenda","from":"Glenda &lt;wtexans@...&gt;","profile":"wtexans","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] Re: Separations, divorce and unschooling","postDate":"1266720608","msgId":50945,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY2ODQyNS41MzYxMC5xbUB3ZWI2NTYwNy5tYWlsLmFjNC55YWhvby5jb20+","inReplyToHeader":"PDAxYmUwMWNhYjI2MiQyN2E5MzQ2MCQ3NmZiOWQyMCRAbmV0Pg=="},"prevInTopic":50944,"nextInTopic":50948,"prevInTime":50944,"nextInTime":50946,"topicId":50895,"numMessagesInTopic":0,"msgSnippet":"... generation that marriage isn t always easy or even good, but that working on it IS good.---   I can t second that suggestion loud enough, Pam!  I have","messageBody":"<div id=\"ygrps-yiv-2100201075\">---I think we, as a society, don&#39;t pass on the information to the next<br/>\ngeneration that marriage isn&#39;t always easy or even good, but that working on<br/>\nit IS good.---<br/>\n <br/>\nI can&#39;t second that suggestion loud enough, Pam!  I have often thought, these past two years especially (as hubby and I have worked pretty successfully through some rough stuff), that there is simply no way I would&#39;ve understand when I got married 20 years ago just how challenging things can get, and that I would be able to dig down deep inside and find it within myself to *want* to work through those things -- that things could get so bad and you&#39;d still be able to come out the other side of it as a couple. <br/>\n <br/>\nMy parents divorced and then each remarried twice -- my mom has been divorced for almost as long as I&#39;ve been married, but my dad and his third wife have been married nearly a decade longer than hubby and I -- it was being around he and his wife for a year or so before I met my hubby that I finally saw and began to understand how marriages are *supposed* to work. It was truly an &quot;a-ha!&quot; experience being around them.<br/>\n <br/>\nI also remember my stepmom telling me, when hubby and I were first married and oh-so-broke, that it&#39;s very easy to quit feeling the love for your spouse when finances are tight. She and my dad told us about some tough financial times they went through and how they worked through them together. That was not an experience I&#39;d seen in my mom&#39;s marriages -- I&#39;d always seen lots of fighting and power struggles when finances were tight. <br/>\n <br/>\nSo, yes, it is absolutely important for us, as parents, to model for our kids, and pass the information to them, that there are ups and downs, and that the downs can be unimaginably far down, but that it is (generally) very worth the effort to work back towards &quot;up&quot; again as a couple. Especially once kids are in the picture.<br/>\n <br/>\nMy paternal grandparents were married quite a long time (at least 50 years, but maybe closer to 60) and I so wish I&#39;d thought, back when my grandma was still alive, to ask her about the ups and downs in their marriage. <br/>\n <br/>\nGlenda<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":67727291,"authorName":"Glenda","from":"Glenda &lt;wtexans@...&gt;","profile":"wtexans","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Separations, divorce and unschooling","postDate":"1266719167","msgId":50944,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM2NTQ5NS43ODMzNS5xbUB3ZWI2NTYwOS5tYWlsLmFjNC55YWhvby5jb20+","inReplyToHeader":"PDg1NjkwNy40OTQ1NC5xbUB3ZWI1MzgwMi5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":50942,"nextInTopic":50945,"prevInTime":50943,"nextInTime":50945,"topicId":50895,"numMessagesInTopic":0,"msgSnippet":"...   Wow, Sylvia, five couples *is* a lot :(   How will the finances be affected by the divorces?  If one spouse is an at-home parent right now but will","messageBody":"<div id=\"ygrps-yiv-1447486144\">---It all has me wondering what I, as part of an unschooling community, can do to support my unschooling friends whose marriage is ending but both parents (or maybe only the one who didn&#39;t want to separate) want to continue unschooling.---<br/>\n <br/>\nWow, Sylvia, five couples *is* a lot :(<br/>\n <br/>\nHow will the finances be affected by the divorces?  If one spouse is an at-home parent right now but will have to get a job after the divorce in order to make ends meet, I can see where that might put a quick end to unschooling (depending on the ages of their kids, the parents&#39; work schedules, how long the kids might be home alone if they&#39;re old enough to be home alone, etc.).<br/>\n <br/>\nMaybe helping out with getting kids places they need to be. If your kids and theirs get along well, being sure to have their kids over or taking them places when y&#39;all go. <br/>\n <br/>\nGlenda<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":124890047,"authorName":"Bev","from":"Bev &lt;beverlyreed2002@...&gt;","profile":"beverlyreed2002","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Separations, divorce and unschooling","postDate":"1266717841","msgId":50942,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMxMzY0OC4xNDk1OS5xbUB3ZWIzMzIwNi5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PDg1NjkwNy40OTQ1NC5xbUB3ZWI1MzgwMi5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":50939,"nextInTopic":50944,"prevInTime":50941,"nextInTime":50943,"topicId":50895,"numMessagesInTopic":0,"msgSnippet":"I fully agree... only difference I have is, I m not 100% focused on unschooling, I have three kids, all are different from each other and my goal as a mom is","messageBody":"<div id=\"ygrps-yiv-1008808565\">I fully agree... only difference I have is, I&#39;m not 100% focused on unschooling, I have three kids, all are different from each other and my goal as a mom is to get them to where they need to be as people... and if one of my children decides public school is for them, or doing a charter because other kids are, and I pray not a private school (can&#39;t afford those I don&#39;t think)... but my goal as a mom is to make sure my kids learn as much as possible, in their own way, and to remind myself that they are their own people.<br/>\n <br/>\nI didn&#39;t do everything my parents wanted, screaming &quot;this is MY life&quot;, and I expect my kids feel the same? <br/>\n <br/>\nBut I fully agree, the biggest issue is stability! I can care less what other do in their homes because it honestly does not effect me, I&#39;m far from perfect so I don&#39;t judge others, and my only concern is my kids and my home... getting new ideas along the way, learning new things, and so forth<br/>\n<br/>\n<br/>\n.~*~._.~*~._BEVERLY_.~*~._.~*~.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Sat, 2/20/10, Sylvia Toyama &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sylgt04@...\">sylgt04@...</a>&gt; wrote:<br/>\n<br/>\n<br/>\nFrom: Sylvia Toyama &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sylgt04@...\">sylgt04@...</a>&gt;<br/>\nSubject: [AlwaysLearning] Re: Separations, divorce and unschooling<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nDate: Saturday, February 20, 2010, 5:49 PM<br/>\n<br/>\n<br/>\nWhen parents create a nest, and  <br/>\n<br/>\ndecide to put children into it, it behooves them to maintain that nest  <br/>\n<br/>\nin as clean, safe, warm and stable a way as they can.   IF they want  <br/>\n<br/>\nto add unschooling to their mix, then they REALLY truly need to keep  <br/>\n<br/>\nthe situation stable!!  Because breaking up means school, almost  <br/>\n<br/>\ncertainly.<br/>\n<br/>\n<br/>\n<br/>\nSo for unschooling advice, a stable family is an essential element.   <br/>\n<br/>\nKids don&#39;t learn well when they don&#39;t feel safe and loved.  Kids don&#39;t  <br/>\n<br/>\nlearn when their basic need for positive regard isn&#39;t met.  Kids need  <br/>\n<br/>\nparents who can pay gentle, direct attention to them, not be  <br/>\n<br/>\ndistracted and furious and working two jobs and pissed off at their  <br/>\n<br/>\nother parent.<br/>\n<br/>\n******<br/>\n<br/>\nI know that in past years, when I&#39;ve seen divorces in unschooling families, kids ended up in school (in two cases, at least -- don&#39;t know what happened in the third).  <br/>\n<br/>\nHaving seen five marriages in unschooling families fall apart in the past 5 months (a truly frightening statistic in my own circle of friends), I hope there can be some way to save unschooling for these kids I know and love.  I hope the parents involved can find some way to be that loving, safe place kids need to be able to learn, that they are able to keep providing a refuge for the kids uppermost in their thoughts and plans.  Yes, ideally they&#39;d find some way to stay together, but it appears divorce is inevitable. For the sake of their kids, who already have enough to deal with, adding school would be like salt in an open wound. <br/>\n<br/>\nIt all has me wondering what I, as part of an unschooling community, can do to support my unschooling friends whose marriage is ending but both parents (or maybe only the one who didn&#39;t want to separate) want to continue unschooling.  <br/>\n<br/>\nSylvia<br/>\n<br/>\nwww.ourhapahome.blogspot.com<br/>\n<br/>\nwww.mysquareone.blogspot.com<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n------------------------------------<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":180234378,"authorName":"Sylvia Toyama","from":"Sylvia Toyama &lt;sylgt04@...&gt;","profile":"sylgt04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Separations, divorce and unschooling","postDate":"1266716987","msgId":50939,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg1NjkwNy40OTQ1NC5xbUB3ZWI1MzgwMi5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":50933,"nextInTopic":50942,"prevInTime":50938,"nextInTime":50940,"topicId":50895,"numMessagesInTopic":0,"msgSnippet":"When parents create a nest, and decide to put children into it, it behooves them to maintain that nest in as clean, safe, warm and stable a way as they can.","messageBody":"<div id=\"ygrps-yiv-146842974\">When parents create a nest, and  <br/>\n<br/>\ndecide to put children into it, it behooves them to maintain that nest  <br/>\n<br/>\nin as clean, safe, warm and stable a way as they can.   IF they want  <br/>\n<br/>\nto add unschooling to their mix, then they REALLY truly need to keep  <br/>\n<br/>\nthe situation stable!!  Because breaking up means school, almost  <br/>\n<br/>\ncertainly.<br/>\n<br/>\n<br/>\n<br/>\nSo for unschooling advice, a stable family is an essential element.   <br/>\n<br/>\nKids don&#39;t learn well when they don&#39;t feel safe and loved.  Kids don&#39;t  <br/>\n<br/>\nlearn when their basic need for positive regard isn&#39;t met.  Kids need  <br/>\n<br/>\nparents who can pay gentle, direct attention to them, not be  <br/>\n<br/>\ndistracted and furious and working two jobs and pissed off at their  <br/>\n<br/>\nother parent.<br/>\n<br/>\n******<br/>\n<br/>\nI know that in past years, when I&#39;ve seen divorces in unschooling families, kids ended up in school (in two cases, at least -- don&#39;t know what happened in the third).  <br/>\n<br/>\nHaving seen five marriages in unschooling families fall apart in the past 5 months (a truly frightening statistic in my own circle of friends), I hope there can be some way to save unschooling for these kids I know and love.  I hope the parents involved can find some way to be that loving, safe place kids need to be able to learn, that they are able to keep providing a refuge for the kids uppermost in their thoughts and plans.  Yes, ideally they&#39;d find some way to stay together, but it appears divorce is inevitable. For the sake of their kids, who already have enough to deal with, adding school would be like salt in an open wound. <br/>\n<br/>\nIt all has me wondering what I, as part of an unschooling community, can do to support my unschooling friends whose marriage is ending but both parents (or maybe only the one who didn&#39;t want to separate) want to continue unschooling.  <br/>\n<br/>\nSylvia<br/>\n<br/>\nwww.ourhapahome.blogspot.com<br/>\n<br/>\nwww.mysquareone.blogspot.com<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Separations, divorce and unschooling","postDate":"1266701340","msgId":50933,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEwMTUzNi44OTQ1Ny5xbUB3ZWIxMTA0MDIubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PDAxYmUwMWNhYjI2MiQyN2E5MzQ2MCQ3NmZiOWQyMCRAbmV0Pg==","referencesHeader":"PDRCODAwNDYwLjIwNDAwMDNAeWFob28uY2E+ICA8NTA2OTY3Ljk2NTIyLnFtQHdlYjMzMjA1Lm1haWwubXVkLnlhaG9vLmNvbT4gIDw3OWMxZDFiNDEwMDIyMDA5MDZsNWVlMjFhOGV3Njc1M2NlYTYwMzU1ZjZmN0BtYWlsLmdtYWlsLmNvbT4gPDc5YzFkMWI0MTAwMjIwMDkyNm83ZmQzOTdiNHJhYzIxY2QyN2M0ZmNjOTEyQG1haWwuZ21haWwuY29tPiA8MDFiZTAxY2FiMjYyJDI3YTkzNDYwJDc2ZmI5ZDIwJEBuZXQ+"},"prevInTopic":50930,"nextInTopic":50939,"prevInTime":50932,"nextInTime":50935,"topicId":50895,"numMessagesInTopic":0,"msgSnippet":"***I know - someone is going to blast me (again) for appearing to b encouraging people to stay in abusive marriages. So - I m NOT saying there aren t times","messageBody":"<div id=\"ygrps-yiv-683500350\">***I know - someone is going to blast me (again) for appearing to b encouraging<br/>\npeople to stay in abusive marriages. So - I&#39;m NOT saying there aren&#39;t<br/>\ntimes when divorce is the best option. I&#39;m saying that parents should not<br/>\nput their own happiness ABOVE that of their children. &quot;We grew apart&quot; or &quot;I<br/>\ndeserve more happiness&quot; or &quot;He&#39;s not as interesting as I thought he&#39;d be&quot; or<br/>\n&quot;We&#39;ve just changed so much, we&#39;re not the same people&quot; or &quot;We just don&#39;t<br/>\nhave anything in common anymore&quot; --- those aren&#39;t good reasons for divorce. ***<br/>\n<br/>\n<br/>\nOr the other one... &quot;we&#39;ve fallen out of love&quot;.  That one always gets me the most, because if that were really true, people saying that, would find divorce easy.  If they really have no feelings of thought or care or any sort of love or memory of love, then they could walk away and not feel anything.  <br/>\n<br/>\nIf couples find living together difficult, divorce isn&#39;t easier at all.  Everything changes, but the one thing that never changes when you have kids together, is that you will ALWAYS still have that other person in your life.  You will still have to talk to them about schedules and kids and who gets who on holidays, and you still have to negotiate around each other&#39;s schedules which will likely be busier because there will be the need for 2 incomes to support 2 households.  Getting a divorce doesn&#39;t remove the other parent. <br/>\n<br/>\nI&#39;ve seen many of my friends with kids, go through divorces.  One of them really made a good choice getting a divorce, it was hard for her and her daughter, but both are remarried and learning how to be kind to each other.  The dad had to hit the bottom before he could pick himself up and the mom and kid were not along for the ride, which was a good thing.  Sometimes, like Pam said, when there is abuse, divorce is better.  All of my other friends that have gone through a divorce did it for selfish reasons.  In one of the worst, the child was used as a form of manipulation by both parents.  The parents were cruel to each other for over 10 yrs.  That child lost her childhood because of it.  The mom in that relationship used to say that it took a strong woman to leave a man.  When she&#39;d say that to me, I&#39;d say right back, &quot;no, I&#39;m pretty sure it takes a stronger woman to stay with one!&quot;  It&#39;s feminist banter, but I KNOW I&#39;m right!<br/>\n<br/>\nI understand why so many people get divorced.  I also know that it&#39;s a problem that more divorces make for more divorces.  One of the biggest reasons that my husband and I are still married, is because almost all of our relatives are still married to original partners.  We have lots of examples of people staying married with all kinds of different personalities and relationships.  The family members around us don&#39;t point each other in the direction of divorce, they all help each other point in the direction of staying together.  It&#39;s made a HUGE difference.  My husbands parents and my parents both got married really young, some still in their teens, like 16 and 17 and both of our parents are still married, it&#39;s the same story of their siblings and their parents.  There have been a few folks that had partners die, or married someone terrible and then divorced and remarried to stay married for over 30 yrs.  Those are the exceptions.<br/>\n<br/>\nIf you want to think about marriage in terms of unschooling... What kind of partners and patterns of relationships do you want to model for your kids?  What kind of partners do you want them to seek out?  The other day I sent to the list a set of FB comments that my daughter instigated.  The girl that she was writing to is from a divorced family, mean step dad, manipulative parents who control everything she does.  They actually like the boy she just broke up with, but they despise the one that she&#39;s getting back together with.  He treats her poorly, is physically abusive, but the girl keeps going back to him because her self worth is zero, and probably too because her parents hate him.  Somewhere in there she&#39;s establishing patterns that may be long term in how she partners and deals with significant relationships.<br/>\n<br/>\nChamille has a boyfriend, she&#39;s 15, her boyfriend is 14.  It seems really young to me, but they&#39;ve been together for almost a year and I don&#39;t see it ending anytime soon.  They&#39;ve gone through hard things and worked things out more maturely than many adults I know, his parents included.  They are sweet and generous with each other and they are honest with each other and what they expect.  What Chamille knows is how to stay with someone, what he knows is how to screw it up, and he doesn&#39;t do those things.<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Separations, divorce and unschooling","postDate":"1266694401","msgId":50921,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0RUIzN0ZCLUFBMTMtNEFCNS1CQjE5LUQ0REQwQ0ZBMjdDMUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDAxYmUwMWNhYjI2MiQyN2E5MzQ2MCQ3NmZiOWQyMCRAbmV0Pg==","referencesHeader":"PDRCODAwNDYwLjIwNDAwMDNAeWFob28uY2E+CSA8NTA2OTY3Ljk2NTIyLnFtQHdlYjMzMjA1Lm1haWwubXVkLnlhaG9vLmNvbT4JIDw3OWMxZDFiNDEwMDIyMDA5MDZsNWVlMjFhOGV3Njc1M2NlYTYwMzU1ZjZmN0BtYWlsLmdtYWlsLmNvbT4gPDc5YzFkMWI0MTAwMjIwMDkyNm83ZmQzOTdiNHJhYzIxY2QyN2M0ZmNjOTEyQG1haWwuZ21haWwuY29tPiA8MDFiZTAxY2FiMjYyJDI3YTkzNDYwJDc2ZmI5ZDIwJEBuZXQ+"},"prevInTopic":50920,"nextInTopic":50930,"prevInTime":50920,"nextInTime":50922,"topicId":50895,"numMessagesInTopic":0,"msgSnippet":"-=-I know - someone is going to blast me (again) for appearing to be encouraging people to stay in abusive marriages.-=- When people blast someone else for","messageBody":"<div id=\"ygrps-yiv-272846435\">-=-I know - someone is going to blast me (again) for appearing to be  <br/>\nencouraging<br/>\npeople to stay in abusive marriages.-=-<br/>\n<br/>\nWhen people blast someone else for saying &quot;find peace; stay together,&quot;  <br/>\nthe blastfulness is probably part of the problem in their unhappy  <br/>\nmarriage.<br/>\n<br/>\n-=I&#39;m saying that parents should not<br/>\nput their own happiness ABOVE that of their children. &quot;We grew apart&quot;  <br/>\nor &quot;I<br/>\ndeserve more happiness&quot; or &quot;He&#39;s not as interesting as I thought he&#39;d  <br/>\nbe&quot; or<br/>\n&quot;We&#39;ve just changed so much, we&#39;re not the same people&quot; or &quot;We just  <br/>\ndon&#39;t<br/>\nhave anything in common anymore&quot; --- those aren&#39;t good reasons for  <br/>\ndivorce. -=-<br/>\n<br/>\nThey are good enough for the State of New Mexico, unfortunately.<br/>\n<br/>\nAnd when those people find another mate, they will grow apart, their  <br/>\nhappiness won&#39;t match their fantasies, he won&#39;t be more interesting  <br/>\nthan he was before, and they will change.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"&quot;Pam Sorooshian&quot; &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] Re: Separations, divorce and unschooling","postDate":"1266693797","msgId":50920,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxYmUwMWNhYjI2MiQyN2E5MzQ2MCQ3NmZiOWQyMCRAbmV0Pg==","inReplyToHeader":"PDc5YzFkMWI0MTAwMjIwMDkyNm83ZmQzOTdiNHJhYzIxY2QyN2M0ZmNjOTEyQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDRCODAwNDYwLjIwNDAwMDNAeWFob28uY2E+CSA8NTA2OTY3Ljk2NTIyLnFtQHdlYjMzMjA1Lm1haWwubXVkLnlhaG9vLmNvbT4JIDw3OWMxZDFiNDEwMDIyMDA5MDZsNWVlMjFhOGV3Njc1M2NlYTYwMzU1ZjZmN0BtYWlsLmdtYWlsLmNvbT4gPDc5YzFkMWI0MTAwMjIwMDkyNm83ZmQzOTdiNHJhYzIxY2QyN2M0ZmNjOTEyQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":50918,"nextInTopic":50921,"prevInTime":50919,"nextInTime":50921,"topicId":50895,"numMessagesInTopic":0,"msgSnippet":"I knew all this before I wasted my time walking down the isle!  ... I m pretty sure she didn t mean walking down the aisle with her current husband was a","messageBody":"<div id=\"ygrps-yiv-2029525408\">&quot;I knew all this before I wasted my time walking down the isle! &quot;<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n <br/>\n<br/>\n </span></blockquote>I&#39;m pretty sure she didn&#39;t mean walking down the aisle with her current<br/>\nhusband was a waste of time, she meant it might have been IF she hadn&#39;t<br/>\nlearned all this about him before doing it.<br/>\n<br/>\n <br/>\n<br/>\nYou know - Sandra and I have both really pushed for people to try a lot<br/>\nharder to stay married, not to consider divorce as an option except in<br/>\nreally extreme circumstances in which there is danger and abuse, for<br/>\nexample. But we&#39;re not pushing for people to GET married in haste and<br/>\nwithout consideration of what kind of character their potential spouse<br/>\nexemplifies.   And we definitely not encouraging people to have children<br/>\nwith a partner they&#39;re not getting along with well.<br/>\n<br/>\n <br/>\n<br/>\nBut, in this culture, people (parents) really really often put their own<br/>\n&quot;right to be happy&quot; ahead of their children&#39;s right to be happy. Divorce<br/>\noften happens between good parents who can manage to get along and be<br/>\nreasonably amicable. Married life can have ups and downs - periods of bliss<br/>\nand periods of boredom or even unhappiness. For the sake of the children, I<br/>\nthink parents should push through those boring or unhappy times and work on<br/>\nmaking their marriage better, rather than giving up on it because that seems<br/>\neasier. I think we, as a society, don&#39;t pass on the information to the next<br/>\ngeneration that marriage isn&#39;t always easy or even good, but that working on<br/>\nit IS good. People get discouraged and give up way too easily. <br/>\n<br/>\n <br/>\n<br/>\nI know - someone is going to blast me (again) for appearing to b encouraging<br/>\npeople to stay in abusive marriages.  So -  I&#39;m NOT saying there aren&#39;t<br/>\ntimes when divorce is the best option. I&#39;m saying that parents should not<br/>\nput their own happiness ABOVE that of their children. &quot;We grew apart&quot; or &quot;I<br/>\ndeserve more happiness&quot; or &quot;He&#39;s not as interesting as I thought he&#39;d be&quot; or<br/>\n&quot;We&#39;ve just changed so much, we&#39;re not the same people&quot; or &quot;We just don&#39;t<br/>\nhave anything in common anymore&quot; --- those aren&#39;t good reasons for divorce. <br/>\n<br/>\n <br/>\n<br/>\n-pam<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":326782993,"authorName":"Vidyut Kale","from":"Vidyut Kale &lt;wide.aware@...&gt;","profile":"vidyutgore","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Separations, divorce and unschooling","postDate":"1266690574","msgId":50930,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc5YzFkMWI0MTAwMjIwMTAyOXIxMTUxOTFiOXVjYzFjMmQyNmM2ZDJkNzA0QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDc5YzFkMWI0MTAwMjIwMDkyNm83ZmQzOTdiNHJhYzIxY2QyN2M0ZmNjOTEyQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDRCODAwNDYwLjIwNDAwMDNAeWFob28uY2E+CSA8NTA2OTY3Ljk2NTIyLnFtQHdlYjMzMjA1Lm1haWwubXVkLnlhaG9vLmNvbT4JIDw3OWMxZDFiNDEwMDIyMDA5MDZsNWVlMjFhOGV3Njc1M2NlYTYwMzU1ZjZmN0BtYWlsLmdtYWlsLmNvbT4JIDw3OWMxZDFiNDEwMDIyMDA5MjZvN2ZkMzk3YjRyYWMyMWNkMjdjNGZjYzkxMkBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":50921,"nextInTopic":50933,"prevInTime":50929,"nextInTime":50931,"topicId":50895,"numMessagesInTopic":0,"msgSnippet":"If marriage were only for religion, we d be eating cake only for the calories. I find this such a denial of sensuality, raw experiencing... I m speechless. It","messageBody":"<div id=\"ygrps-yiv-1060425054\">If marriage were only for religion, we&#39;d be eating cake only for<br/>\nthe calories.<br/>\n<br/>\nI find this such a denial of sensuality, raw experiencing... I&#39;m<br/>\nspeechless. It is very different from where I am. I cannot relate. I deny. I<br/>\ndon&#39;t want to see something I value as being a subset of something I am very<br/>\nwary of. Even if it is. I want to see the parts of it I can accept and call<br/>\nthat my whole.<br/>\n<br/>\nHow does one discuss the horizon with someone who doesn&#39;t go out? It<br/>\ncan only be about &#39;convincing&#39; on both sides, till a possibility for<br/>\nexamining the value the other sees emerges. Perhaps there is a religious<br/>\nhangover in the institution of marriage, like there are calories in cake. If<br/>\nI can embrace that in myself, would it evoke acceptance for the wholeness in<br/>\nthe other? Would it matter?<br/>\n<br/>\nIt does matter. I posted. I am still defending my belief from<br/>\nreligious takeover. Silly.<br/>\n<br/>\nVidyut<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":326782993,"authorName":"Vidyut Kale","from":"Vidyut Kale &lt;wide.aware@...&gt;","profile":"vidyutgore","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Separations, divorce and unschooling","postDate":"1266686775","msgId":50918,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc5YzFkMWI0MTAwMjIwMDkyNm83ZmQzOTdiNHJhYzIxY2QyN2M0ZmNjOTEyQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDc5YzFkMWI0MTAwMjIwMDkwNmw1ZWUyMWE4ZXc2NzUzY2VhNjAzNTVmNmY3QG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDRCODAwNDYwLjIwNDAwMDNAeWFob28uY2E+CSA8NTA2OTY3Ljk2NTIyLnFtQHdlYjMzMjA1Lm1haWwubXVkLnlhaG9vLmNvbT4JIDw3OWMxZDFiNDEwMDIyMDA5MDZsNWVlMjFhOGV3Njc1M2NlYTYwMzU1ZjZmN0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":50917,"nextInTopic":50920,"prevInTime":50917,"nextInTime":50919,"topicId":50895,"numMessagesInTopic":0,"msgSnippet":"I knew all this before I wasted my time walking down the isle!  I don t know how you mean this, but I have learned to value every moment of life for the joy","messageBody":"<div id=\"ygrps-yiv-211383816\">&quot;I knew all this before I wasted my time walking down the isle! &quot;<br/>\n<br/>\nI don&#39;t know how you mean this, but I have learned to value every moment of<br/>\nlife for the joy or learning it has brought me. Sometimes it has been a<br/>\nlearning of pain. If I see something I did from the bottom of my heart as a<br/>\nwaste, I am &#39;dehumanizing&#39; me, by stripping the value of something intimate<br/>\nand emotional that I grudge in hindsight because I don&#39;t want to look at the<br/>\nfallout. I&#39;d rather wipe the validity and value of the whole thing. It<br/>\ndisables me from truly appreciating myself fully and accepting &#39;mistakes&#39; in<br/>\nothers, including children.<br/>\n<br/>\nI do think I misunderstood, as the rest of your post doesn&#39;t sound like a<br/>\nwaste. Indeed your husband sounds quite virtuous from how you talk about<br/>\nhim!<br/>\n<br/>\nVidyut<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Separations, divorce and unschooling","postDate":"1266684342","msgId":50917,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY2QjNCMUE4LTE1OEYtNDMzOS1CMzZDLUMyRDk4MDgyOTM4MEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDUwNjk2Ny45NjUyMi5xbUB3ZWIzMzIwNS5tYWlsLm11ZC55YWhvby5jb20+","referencesHeader":"PDUwNjk2Ny45NjUyMi5xbUB3ZWIzMzIwNS5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":50916,"nextInTopic":50918,"prevInTime":50916,"nextInTime":50918,"topicId":50895,"numMessagesInTopic":0,"msgSnippet":"I knew I wouldn t be speaking for everyone.  -=-and the list goes on... I am better protected because my husband thinks I am worth getting married to.","messageBody":"<div id=\"ygrps-yiv-1822885333\">I knew I wouldn&#39;t be speaking for everyone. &lt;bwg&gt;<br/>\n<br/>\n-=-and the list goes on... I am better protected because my husband  <br/>\nthinks I am worth getting married to. Both of us have the same  <br/>\nbenifits and stability.-=-<br/>\n<br/>\nYes, but that&#39;s not about the peace and safety of children in the  <br/>\nmoment, necessarily.<br/>\n<br/>\nFriends of ours got married last year who had lived together for 30  <br/>\nyears.  They didn&#39;t have children.  Holly was at the wedding, a big  <br/>\noutdoor hippie wedding.  She said she thought it was sweet that most  <br/>\ncouples get married to live a life together, but that these friends  <br/>\nhad already lived a life together, they were getting married in  <br/>\npreparation for death.<br/>\n<br/>\nThey own property and two houses (one or the other of them, not  <br/>\njointly) and they want to be able to inherit.<br/>\n<br/>\n-=- In a long tern committed relationship either person can walk away  <br/>\nand no harm no foul... -=-<br/>\n<br/>\nNot if they had children.  Not if they&#39;re unschooling.<br/>\n<br/>\nChildless couples can get divorced no-harm-no-foul.  The harm and the  <br/>\nfoul I&#39;m talking about with unschooling is the harm to the children,  <br/>\nand to unschooling.<br/>\n<br/>\n-=-In a long tern committed relationship either person can walk away  <br/>\nand no harm no foul... where as in a marriage you must get divorced...  <br/>\nmight be a hassle for some while other look at it as more of a reason  <br/>\nto Work on what they have.-=-<br/>\n<br/>\nI&#39;m hoping to help persuade people to see their children as the  <br/>\ngreatest reason of all to work on maintaining a stable home and  <br/>\nfamily.  I don&#39;t care if the parents are both men, both women, if  <br/>\nthey&#39;re legally married, if there are three of them or it&#39;s a Big Love  <br/>\ncul-de-sac.  I want those children to feel secure and for those  <br/>\nparents to feel committed to their children more than to their own  <br/>\nselfish desires.<br/>\n<br/>\n-=- he does have flaws... like he watches sports, and plays  <br/>\nvideogames, etc....-=-<br/>\n<br/>\nHoly crap, ma&#39;am!! If you see those as flaws instead of as things to  <br/>\ndo while he&#39;s safely at home with his family, the poor guy is swimmin&#39;  <br/>\nupstream even though he doesn&#39;t drink, smoke or go to strip clubs!<br/>\n<br/>\n-=-... but I knew all this before I wasted my time walking down the  <br/>\nisle! -=-<br/>\n<br/>\nWhat on earth!?<br/>\n<br/>\nOkay, I don&#39;t usually do this but &quot;isle&quot; is an island.  &quot;Aisle&quot; is a  <br/>\npassageway through seats, as in a church or auditorium.<br/>\n<br/>\nIf &quot;walking down the aisle&quot; is wasting your time, why write any of  <br/>\nwhat you wrote?  If it was NOT wasting your time, why not proofread  <br/>\nwhat you write?<br/>\n<br/>\nWords matter because they reflect thought and belief.  If you believe  <br/>\nthat watching sports and playing videogames are &quot;flaws,&quot; that&#39;s  <br/>\nsomething you should address within yourself for the sake of the  <br/>\nsuccess of unschooling, of your relationships with your husband and  <br/>\nchildren, and for clarity in thought.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/focus\">http://sandradodd.com/focus</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/connections\">http://sandradodd.com/connections</a><br/>\n<br/>\nI don&#39;t mind rants, but any rant sent to this list should be  <br/>\nconsidered in light of helping people understand unschooling, helping  <br/>\npeople unschool better, giving people information they can use at  <br/>\nhome.   Or asking questions that can lead to such information.<br/>\n<br/>\nProofread your rants, please.<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":124890047,"authorName":"Bev","from":"Bev &lt;beverlyreed2002@...&gt;","profile":"beverlyreed2002","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Separations, divorce and unschooling","postDate":"1266682611","msgId":50916,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUwNjk2Ny45NjUyMi5xbUB3ZWIzMzIwNS5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PDRCODAwNDYwLjIwNDAwMDNAeWFob28uY2E+"},"prevInTopic":50915,"nextInTopic":50917,"prevInTime":50915,"nextInTime":50917,"topicId":50895,"numMessagesInTopic":0,"msgSnippet":"There is a difference between a long term committed relationship and a marriage! And forgive me, been there and felt like that, and honestly think those that","messageBody":"<div id=\"ygrps-yiv-1144354793\">There is a difference between a long term committed relationship and a marriage! And forgive me, been there and felt like that, and honestly think those that bash actual marriages have never expirienced one or been cheated, lied to, abused in some way in one... I had in almost all previous relationships been cheated on and came to that attitude. I now know the difference. ~*Smiles*~<br/>\n <br/>\nIn a long tern committed relationship either person can walk away and no harm no foul... where as in a marriage you must get divorced... might be a hassle for some while other look at it as more of a reason to Work on what they have. Long term committment when that person dies (depending on state and local laws) the partner is entitled to NOTHING, where as in a marriage I can get Social Security for his missing income the rest of my life (or until I get married again, which I&#39;d never), I get 100% of what my husband owns unless our children are 18 at the time (I know how to split things), and the list goes on... I am better protected because my husband thinks I am worth getting married to. Both of us have the same benifits and stability.<br/>\n <br/>\nI&#39;ve seen women in a &quot;committed relationship&quot; and when life gives something like &quot;death&quot; they are left trying to either make ends meet alone or on welfare. Which is why I push for life nsurance! Married or not... the kids don&#39;t deserve what comes from a parents hang up. And after dealing with my ex and a so called &quot;committed relationship&quot;... I would never do that again! Religion has absolutely nothing to do with it because neither of us got on our knees unless it was behind closed doors and trust me it was nothing I wanted any &quot;God&quot; to see... sorry for being gross! But it was until many years later I found my own spiritualism, no I don&#39;t go to a church where others tell me what they think a piece of paper says either. <br/>\n <br/>\nI think a marriage license is more than a piece of paper! It has legal issues that protect not just me but my kids. But that is not why I have kids with my husband, I knew him before we ever said &quot;I do&quot;!!! We dated for 7 years before he asked me to marry him, it wasn&#39;t a huge fancy wedding, and things were in order beforehand. Like I knew he has never done drugs, might drink once a year if I am lucky, he has never smoked, he respects women, he loves children (mostly the age they can actually talk and up), he&#39;s a hard worker that has at one point worked three jobs to support us, he&#39;s not abusive, he does have flaws... like he watches sports, and plays videogames, etc. but nothing major, and he&#39;s never had an interest in strip club or whatever... but I knew all this before I wasted my time walking down the isle! We both have background that are alike, but we&#39;re willing to read self help books, take classes, or if we had to seek therapy! We both come from a<br/>\n broken home and know what it is like on the kid... and know not to do it to ours...<br/>\n<br/>\n<br/>\n<br/>\n.~*~._.~*~._BEVERLY_.~*~._.~*~.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Sat, 2/20/10, Shira Rocklin &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:shirarocklin@...\">shirarocklin@...</a>&gt; wrote:<br/>\n<br/>\n<br/>\nFrom: Shira Rocklin &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:shirarocklin@...\">shirarocklin@...</a>&gt;<br/>\nSubject: [AlwaysLearning] Re: Separations, divorce and unschooling<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nDate: Saturday, February 20, 2010, 7:48 AM<br/>\n<br/>\n<br/>\n---A couple of times when I&#39;ve pressed people to keep their marriages <br/>\nstrong and peaceful for the good of their kids, people have come back <br/>\nwith &quot;Are you Christian?&quot; or &quot;I didn&#39;t know this was a religious list.&quot;<br/>\n<br/>\nSeriously?  People think religion is the only purpose of marriage?  I <br/>\nthink that only comes from having been religious and then left, and <br/>\nthinking that now that one isn&#39;t religious, all the &quot;rules&quot; are gone, <br/>\nbecause they only had to do with making God happy.   Some people think <br/>\nmaybe that atheists like to run around lying and killing and getting <br/>\ndivorced.---<br/>\n<br/>\nCan I ask a question?  When we talk about marriage on these lists, are <br/>\nwe talking about the institution of marriage, legally or religiously, or <br/>\nare we talking about the idea of committed relationships?  Because, I <br/>\nthink for me, I value that document that says we are obligated to each <br/>\nother.  But I have met others who don&#39;t believe in &#39;marriage&#39;... and <br/>\nsome have been in long-term committed relationships that look just like <br/>\nmarriage.  So, is there any difference?  Is marriage just the term thats <br/>\nmost easy to use?  Or is the document integral to the commitment?  And <br/>\nthen I also wonder about alternative marriages?  I&#39;ve read of &#39;open <br/>\nrelationships&#39; and polygamous or the other way around (can&#39;t recall the <br/>\nterm), etc.  Sometimes there are three parents in those situations...  <br/>\nOr gay marriages, two moms, or two dads.  There are so many variations.  <br/>\nAre they also what we are talking about?<br/>\n<br/>\n<br/>\n---I am new so I missed the piece... but am interested. I believe in God <br/>\nbut that isn&#39;t why I am with my husband. I believe that the foundations <br/>\nof marriage have nothing to do with religion other than not having <br/>\npeople sleeping around and having broken/jagged homes. I think the <br/>\nfoundation of two parents is not just for the emotional/physical well <br/>\nbeing of a child, but the purpose is to have and raise children as a <br/>\ncouple? I see more negatives in a divorce than positives...<br/>\n<br/>\nI&#39;m constantly looking for ways to keep my marriage strong, not above <br/>\ntaking on new ideas, and so forth... BTW, only thing that can offend me <br/>\nis bashing my kids, most things are not Taboo to me.---<br/>\n<br/>\nBut people who are religious and married and believe in religious ideas <br/>\nof marriage DO sleep around!   Just because its a &#39;rule&#39; doesn&#39;t mean <br/>\npeople follow it. <br/>\n<br/>\nSeems to me that the purpose of keeping a marriage together, in terms of <br/>\nchildren, is not just to &#39;raise the children as a couple,&#39; but to <br/>\nrecognize the importance (biologically, emotionally, culturally, etc) of <br/>\nhaving two parents present and there working together to build a family. <br/>\n<br/>\n<br/>\n------------------------------------<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Separations, divorce and unschooling","postDate":"1266682104","msgId":50915,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY0QTVEODI2LURFNTgtNEYyMC1BMjM4LTVEQzQyNkU1MTI1MkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDRCODAwNDYwLjIwNDAwMDNAeWFob28uY2E+","referencesHeader":"PDRCODAwNDYwLjIwNDAwMDNAeWFob28uY2E+"},"prevInTopic":50914,"nextInTopic":50916,"prevInTime":50914,"nextInTime":50916,"topicId":50895,"numMessagesInTopic":0,"msgSnippet":"-=-Can I ask a question? When we talk about marriage on these lists, are we talking about the institution of marriage, legally or religiously, or are we","messageBody":"<div id=\"ygrps-yiv-714345815\">-=-Can I ask a question? When we talk about marriage on these lists, are<br/>\nwe talking about the institution of marriage, legally or religiously, or<br/>\nare we talking about the idea of committed relationships?-=-<br/>\n<br/>\nI can&#39;t speak for everyone, but for me, &quot;committed relationship.&quot;  I  <br/>\nassume marriage first, because most people who have kids who are in  <br/>\nschool and then taken out of school are married.  Most.  Not all.<br/>\n<br/>\n-=-Because, I<br/>\nthink for me, I value that document that says we are obligated to each<br/>\nother. But I have met others who don&#39;t believe in &#39;marriage&#39;... and<br/>\nsome have been in long-term committed relationships that look just like<br/>\nmarriage. So, is there any difference? Is marriage just the term thats<br/>\nmost easy to use?-=-<br/>\n<br/>\nNot the document, the public vows (for me, for my considerations)--the  <br/>\nacceptance of that couple by the community they&#39;re in.  The  <br/>\ndeclaration and the support they get in exchange for that.  Some  <br/>\npeople see the paper.  I see that their relatives let them share a bed  <br/>\nwhen they visit. &lt;G&gt;<br/>\n<br/>\n-=-And<br/>\nthen I also wonder about alternative marriages? I&#39;ve read of &#39;open<br/>\nrelationships&#39; and polygamous or the other way around (can&#39;t recall the<br/>\nterm), etc. Sometimes there are three parents in those situations... -=-<br/>\n<br/>\nPolyandandry/polyandrous.<br/>\nA generic term is polyamory.<br/>\n<br/>\n-=-Or gay marriages, two moms, or two dads. There are so many  <br/>\nvariations.<br/>\nAre they also what we are talking about?-=-<br/>\n<br/>\nI certainly am, when I talk about it.  When parents create a nest, and  <br/>\ndecide to put children into it, it behooves them to maintain that nest  <br/>\nin as clean, safe, warm and stable a way as they can.   IF they want  <br/>\nto add unschooling to their mix, then they REALLY truly need to keep  <br/>\nthe situation stable!!  Because breaking up means school, almost  <br/>\ncertainly.<br/>\n<br/>\nSo for unschooling advice, a stable family is an essential element.   <br/>\nKids don&#39;t learn well when they don&#39;t feel safe and loved.  Kids don&#39;t  <br/>\nlearn when their basic need for positive regard isn&#39;t met.  Kids need  <br/>\nparents who can pay gentle, direct attention to them, not be  <br/>\ndistracted and furious and working two jobs and pissed off at their  <br/>\nother parent.<br/>\n<br/>\nI&#39;m not talking about school, I&#39;m not talking about religion, I&#39;m not  <br/>\ntalking about laws or pieces of paper.<br/>\nAs usual, I&#39;m talking about what helps or harms the success of  <br/>\nunschooling.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":124890047,"authorName":"Bev","from":"Bev &lt;beverlyreed2002@...&gt;","profile":"beverlyreed2002","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Separations, divorce and unschooling","postDate":"1266681487","msgId":50914,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk5MTUxNy4yNjAyMS5xbUB3ZWIzMzIwNi5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PGhsb3N1OCtkOTk2QGVHcm91cHMuY29tPg=="},"prevInTopic":50913,"nextInTopic":50915,"prevInTime":50913,"nextInTime":50915,"topicId":50895,"numMessagesInTopic":0,"msgSnippet":"When I have time to waste ... I hit CafeMom boards... because it is a quick read! That and if I feel horribly bad about the stuff happening in my life, it is","messageBody":"<div id=\"ygrps-yiv-1938607594\">When I have time to &quot;waste&quot;... I hit CafeMom boards... because it is a quick read! That and if I feel horribly bad about the stuff happening in my life, it is twisted thinking, but there are others out there doing worse. But the point I am getting to is this... I see women on there all the time, whining that a man they married is unfaithful or on drugs or whatevre! Not judging because they do not slep in my bed, do not pay my bills, do not raise my kids, etc. But these are things you should know before saying &quot;I do&quot;. I far too often see people thinking having a kid, or getting married, or moving outta state with change their &quot;problems&quot;... makes about as much sense as saying that if I get drunk tonight I can hide from my problems knowing full well I&#39;ll wake up tomorrow to the same issues. Problems don&#39;t &quot;go away&quot; unless you get to the root and fix them... <br/>\n <br/>\nSorry to hear a church has that many bad members... reminds me of my ex-mother-inlaw&#39;s church. And it is for those kind of people, and she returned... where she can meet high end earners and it&#39;s all about the money! But &quot;to each their own&quot; is all I can think... <br/>\n<br/>\n<br/>\n.~*~._.~*~._BEVERLY_.~*~._.~*~.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Sat, 2/20/10, eintob, d.a. &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:michelle_bailey@...\">michelle_bailey@...</a>&gt; wrote:<br/>\n<br/>\n<br/>\nFrom: eintob, d.a. &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:michelle_bailey@...\">michelle_bailey@...</a>&gt;<br/>\nSubject: [AlwaysLearning] Re: Separations, divorce and unschooling<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nDate: Saturday, February 20, 2010, 6:51 AM<br/>\n<br/>\n<br/>\nI, personally, can understand why some people might assume that your encouragement to stay married might be religiously motivated.  I got married at 19 and then had a strong religious conversion a year later.  The year after that I began to see that I had made a terrible mistake by getting married but was told and believed that I had to &quot;bloom where god planted me&quot;.  I spent the next 15+ years desperately trying to be the perfect wife and doing god&#39;s will while getting more and more miserable and suicidal.  When I finally decided to leave, even if it meant disobeying god and ruining all of our lives, it felt like I had done *everything* I could and the choice was now death (for myself) or divorce.  I believe now that if I hadn&#39;t been so deeply entrenched in my religious beliefs I would have left before I had kids.<br/>\n<br/>\n~Michelle<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; A couple of times when I&#39;ve pressed people to keep their marriages  <br/>\n&gt; strong and peaceful for the good of their kids, people have come back  <br/>\n&gt; with &quot;Are you Christian?&quot; or &quot;I didn&#39;t know this was a religious list.&quot;<br/>\n&gt; <br/>\n&gt; Seriously?  People think religion is the only purpose of marriage?  I  <br/>\n&gt; think that only comes from having been religious and then left, and  <br/>\n&gt; thinking that now that one isn&#39;t religious, all the &quot;rules&quot; are gone,  <br/>\n&gt; because they only had to do with making God happy.   Some people think  <br/>\n&gt; maybe that atheists like to run around lying and killing and getting  <br/>\n&gt; divorced.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n------------------------------------<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":251210887,"authorName":"Shira Rocklin","from":"Shira Rocklin &lt;shirarocklin@...&gt;","profile":"shirarocklin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Separations, divorce and unschooling","postDate":"1266680928","msgId":50913,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCODAwNDYwLjIwNDAwMDNAeWFob28uY2E+"},"prevInTopic":50912,"nextInTopic":50914,"prevInTime":50912,"nextInTime":50914,"topicId":50895,"numMessagesInTopic":0,"msgSnippet":"... strong and peaceful for the good of their kids, people have come back with Are you Christian? or I didn t know this was a religious list. Seriously?","messageBody":"<div id=\"ygrps-yiv-637440228\">---A couple of times when I&#39;ve pressed people to keep their marriages <br/>\nstrong and peaceful for the good of their kids, people have come back <br/>\nwith &quot;Are you Christian?&quot; or &quot;I didn&#39;t know this was a religious list.&quot;<br/>\n<br/>\nSeriously?  People think religion is the only purpose of marriage?  I <br/>\nthink that only comes from having been religious and then left, and <br/>\nthinking that now that one isn&#39;t religious, all the &quot;rules&quot; are gone, <br/>\nbecause they only had to do with making God happy.   Some people think <br/>\nmaybe that atheists like to run around lying and killing and getting <br/>\ndivorced.---<br/>\n<br/>\nCan I ask a question?  When we talk about marriage on these lists, are <br/>\nwe talking about the institution of marriage, legally or religiously, or <br/>\nare we talking about the idea of committed relationships?  Because, I <br/>\nthink for me, I value that document that says we are obligated to each <br/>\nother.  But I have met others who don&#39;t believe in &#39;marriage&#39;... and <br/>\nsome have been in long-term committed relationships that look just like <br/>\nmarriage.  So, is there any difference?  Is marriage just the term thats <br/>\nmost easy to use?  Or is the document integral to the commitment?  And <br/>\nthen I also wonder about alternative marriages?  I&#39;ve read of &#39;open <br/>\nrelationships&#39; and polygamous or the other way around (can&#39;t recall the <br/>\nterm), etc.  Sometimes there are three parents in those situations...  <br/>\nOr gay marriages, two moms, or two dads.  There are so many variations.  <br/>\nAre they also what we are talking about?<br/>\n<br/>\n<br/>\n---I am new so I missed the piece... but am interested. I believe in God <br/>\nbut that isn&#39;t why I am with my husband. I believe that the foundations <br/>\nof marriage have nothing to do with religion other than not having <br/>\npeople sleeping around and having broken/jagged homes. I think the <br/>\nfoundation of two parents is not just for the emotional/physical well <br/>\nbeing of a child, but the purpose is to have and raise children as a <br/>\ncouple? I see more negatives in a divorce than positives...<br/>\n <br/>\nI&#39;m constantly looking for ways to keep my marriage strong, not above <br/>\ntaking on new ideas, and so forth... BTW, only thing that can offend me <br/>\nis bashing my kids, most things are not Taboo to me.---<br/>\n<br/>\nBut people who are religious and married and believe in religious ideas <br/>\nof marriage DO sleep around!   Just because its a &#39;rule&#39; doesn&#39;t mean <br/>\npeople follow it. <br/>\n<br/>\nSeems to me that the purpose of keeping a marriage together, in terms of <br/>\nchildren, is not just to &#39;raise the children as a couple,&#39; but to <br/>\nrecognize the importance (biologically, emotionally, culturally, etc) of <br/>\nhaving two parents present and there working together to build a family.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Recovery from fundamentalism, and HTML (was Re: Separations, divorce and unschooling","postDate":"1266680240","msgId":50912,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVERTRDRDNCLTEzRDgtNDcwNC04NDYwLTIyMDBGREJCRkI5MEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhsb3N1OCtkOTk2QGVHcm91cHMuY29tPg==","referencesHeader":"PGhsb3N1OCtkOTk2QGVHcm91cHMuY29tPg=="},"prevInTopic":50909,"nextInTopic":50913,"prevInTime":50911,"nextInTime":50913,"topicId":50895,"numMessagesInTopic":0,"msgSnippet":"Intro note written after the rest of this:  The information here might not be needed by anyone on the Always Learning list today, but it might be worth hanging","messageBody":"<div id=\"ygrps-yiv-125770261\">Intro note written after the rest of this:  The information here might  <br/>\nnot be needed by anyone on the Always Learning list today, but it  <br/>\nmight be worth hanging on to for the benefit of friends later on.<br/>\n<br/>\n-------------------------------<br/>\n<br/>\n-=- I got married at 19 and then had a strong religious conversion a  <br/>\nyear later. The year after that I began to see that I had made a  <br/>\nterrible mistake by getting married but was told and believed that I  <br/>\nhad to &quot;bloom where god planted me&quot;. -=-<br/>\n<br/>\nWhen someone thinks that, though, it&#39;s because of their own personal  <br/>\nfears and religious pasts.<br/>\nSometimes (often, really) when someone leaves a church he (it&#39;s  <br/>\nusually a he) goes ape shit, drinks, stays out late, acts like a  <br/>\nretard (no apologies for that, folks; don&#39;t defend people acting like  <br/>\nthey have no ability to reason), lies, steals, and thinks &quot;woohoo!!!   <br/>\nwithout hell as a threat, I can do whatever I want to!&quot;<br/>\n<br/>\nSome of them look around and see that there are agnostics and atheists  <br/>\nand people who are religious but don&#39;t even believe in hell who have  <br/>\nalways been living responsible, honest lives of moderation and  <br/>\nkindness.  HOW could that happen!?<br/>\n<br/>\nReally.  When I used to got to church on Sunday mornings (only one of  <br/>\nthe five times a week I went), when I was a teen, I once saw a man  <br/>\nmowing his lawn.  Instead of thinking &quot;He&#39;s working hard in the sun,  <br/>\nfor his family, on one of his days off of his job,&quot; I squinted up my  <br/>\neyes and saw him as a sinner who should be in church instead of  <br/>\nviolating God&#39;s commandments by working on a Sunday.<br/>\n<br/>\nHe was right, that lawn-mowing man.  I was wrong.  Meanwhile, over at  <br/>\nchurch, there were guys who didn&#39;t even bother to plant lawns, who  <br/>\nwere fooling around on their wives, who had been drinking the night  <br/>\nbefore, who were MEAN to their kids.  Because I was immature and  <br/>\nidealistic, I thought they were &quot;the good men,&quot; the men at church.<br/>\n<br/>\nWhen people leave a religion, if they don&#39;t go through some recovery  <br/>\nthoughts and re-adjustment, it can cripple them for the rest of their  <br/>\nlives.  If they live in reaction and opposition to church, instead of  <br/>\nliving a whole, new, rational, responsible way, they might as well go  <br/>\nback to church and let someone tell them what to do.<br/>\n<br/>\nThere are recovery sites, by the way.  There are former-fundamentalist  <br/>\nand former-various-other-things recovery sites.  And groups, and books.<br/>\n<br/>\nPeople don&#39;t get &quot;bloom where you&#39;re planted&quot; advice here. They get  <br/>\n&quot;live in the moment&quot; advice, and &quot;make the better decision&quot; advice and  <br/>\n&quot;live by principles&quot; advice and &quot;create a happy home&quot; advice.  If  <br/>\nsomeone can look at all that and think &quot;religion,&quot; then that person  <br/>\nprobably really does need some recovery assistance.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/moment\">http://sandradodd.com/moment</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/partners\">http://sandradodd.com/partners</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/rules\">http://sandradodd.com/rules</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/choices\">http://sandradodd.com/choices</a><br/>\n<br/>\nand for recovery, some of many:<br/>\nThis one&#39;s pretty extreme and possibly amusing (if people are in the  <br/>\nmood to be amused about such things)<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.catalaw.com/detox/\">http://www.catalaw.com/detox/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://exfundies.tribe.net/\">http://exfundies.tribe.net/</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.amazon.com/Leaving-Fold-Former-Fundamentalists-Religion/dp/1879237512\">http://www.amazon.com/Leaving-Fold-Former-Fundamentalists-Religion/dp/1879237512</a> <br/>\n  (used copies, not too expensive)<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://repentantfundie.blogspot.com/2009/01/what-is-recovering-fundamentalist_23.html\">http://repentantfundie.blogspot.com/2009/01/what-is-recovering-fundamentalist_23.html</a> <br/>\n  (7th Day Adventist, but of general interest)<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.exmormon.org/\">http://www.exmormon.org/</a><br/>\nThe interesting thing about that last one is that&#39;s where I lifted the  <br/>\ncode for many of my index pages, in the days that I didn&#39;t really  <br/>\nunderstand html well.  So their index page format appears on these  <br/>\npages of mine:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/life\">http://sandradodd.com/life</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/food\">http://sandradodd.com/food</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/reading\">http://sandradodd.com/reading</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/tv\">http://sandradodd.com/tv</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/spanking\">http://sandradodd.com/spanking</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/chores/\">http://sandradodd.com/chores/</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/strewing\">http://sandradodd.com/strewing</a><br/>\n<br/>\nI learned a lot about html from tweaking and changing those tables.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":242168979,"authorName":"eintob, d.a.","from":"&quot;eintob, d.a.&quot; &lt;michelle_bailey@...&gt;","profile":"draconi_ann","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Separations, divorce and unschooling","postDate":"1266677512","msgId":50909,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhsb3N1OCtkOTk2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEMyQjA1MjNGLTEzQzEtNDEzRi04OTUxLUJGRUU2NDVBREZCOEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":50896,"nextInTopic":50912,"prevInTime":50908,"nextInTime":50910,"topicId":50895,"numMessagesInTopic":0,"msgSnippet":"I, personally, can understand why some people might assume that your encouragement to stay married might be religiously motivated.  I got married at 19 and","messageBody":"<div id=\"ygrps-yiv-404817797\">I, personally, can understand why some people might assume that your encouragement to stay married might be religiously motivated.  I got married at 19 and then had a strong religious conversion a year later.  The year after that I began to see that I had made a terrible mistake by getting married but was told and believed that I had to &quot;bloom where god planted me&quot;.  I spent the next 15+ years desperately trying to be the perfect wife and doing god&#39;s will while getting more and more miserable and suicidal.  When I finally decided to leave, even if it meant disobeying god and ruining all of our lives, it felt like I had done *everything* I could and the choice was now death (for myself) or divorce.  I believe now that if I hadn&#39;t been so deeply entrenched in my religious beliefs I would have left before I had kids.<br/>\n<br/>\n~Michelle<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; A couple of times when I&#39;ve pressed people to keep their marriages  <br/>\n&gt; strong and peaceful for the good of their kids, people have come back  <br/>\n&gt; with &quot;Are you Christian?&quot; or &quot;I didn&#39;t know this was a religious list.&quot;<br/>\n&gt; <br/>\n&gt; Seriously?  People think religion is the only purpose of marriage?  I  <br/>\n&gt; think that only comes from having been religious and then left, and  <br/>\n&gt; thinking that now that one isn&#39;t religious, all the &quot;rules&quot; are gone,  <br/>\n&gt; because they only had to do with making God happy.   Some people think  <br/>\n&gt; maybe that atheists like to run around lying and killing and getting  <br/>\n&gt; divorced. </span></blockquote></div>","specialLinks":[]},{"userId":124890047,"authorName":"Bev","from":"Bev &lt;beverlyreed2002@...&gt;","profile":"beverlyreed2002","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Separations, divorce and unschooling","postDate":"1266598966","msgId":50896,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk5MDU5OS41MjAyLnFtQHdlYjMzMjAxLm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PEMyQjA1MjNGLTEzQzEtNDEzRi04OTUxLUJGRUU2NDVBREZCOEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":50895,"nextInTopic":50909,"prevInTime":50895,"nextInTime":50897,"topicId":50895,"numMessagesInTopic":0,"msgSnippet":"I am new so I missed the piece... but am interested. I believe in God but that isn t why I am with my husband. I believe that the foundations of marriage have","messageBody":"<div id=\"ygrps-yiv-423144854\">I am new so I missed the piece... but am interested. I believe in God but that isn&#39;t why I am with my husband. I believe that the foundations of marriage have nothing to do with religion other than not having people sleeping around and having broken/jagged homes. I think the foundation of two parents is not just for the emotional/physical well being of a child, but the purpose is to have and raise children as a couple? I see more negatives in a divorce than positives...<br/>\n <br/>\nI&#39;m constantly looking for ways to keep my marriage strong, not above taking on new ideas, and so forth... BTW, only thing that can offend me is bashing my kids, most things are not Taboo to me<br/>\n<br/>\n<br/>\n.~*~._.~*~._BEVERLY_.~*~._.~*~.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Fri, 2/19/10, Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; wrote:<br/>\n<br/>\n<br/>\nFrom: Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt;<br/>\nSubject: [AlwaysLearning] Separations, divorce and unschooling<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nDate: Friday, February 19, 2010, 8:45 AM<br/>\n<br/>\n<br/>\nA couple of times when I&#39;ve pressed people to keep their marriages  <br/>\nstrong and peaceful for the good of their kids, people have come back  <br/>\nwith &quot;Are you Christian?&quot; or &quot;I didn&#39;t know this was a religious list.&quot;<br/>\n<br/>\nSeriously?  People think religion is the only purpose of marriage?  I  <br/>\nthink that only comes from having been religious and then left, and  <br/>\nthinking that now that one isn&#39;t religious, all the &quot;rules&quot; are gone,  <br/>\nbecause they only had to do with making God happy.   Some people think  <br/>\nmaybe that atheists like to run around lying and killing and getting  <br/>\ndivorced.<br/>\n<br/>\nAnyway, I just picked up the coolest idea and will quote it  <br/>\nanonymously because it came from another list:<br/>\n<br/>\n-----------------<br/>\nOne friend, whose husband left her, she fought really hard to keep<br/>\nthe marriage together, said - we have all the bad parts of the<br/>\nrelationship still with none of the good parts. Her kids are both in<br/>\nschool now, BTW.<br/>\n---------------<br/>\n<br/>\nIt&#39;s not good for unschooling.  It&#39;s not good for peaceful parenting.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n------------------------------------<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Separations, divorce and unschooling","postDate":"1266597909","msgId":50895,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEMyQjA1MjNGLTEzQzEtNDEzRi04OTUxLUJGRUU2NDVBREZCOEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":50896,"prevInTime":50894,"nextInTime":50896,"topicId":50895,"numMessagesInTopic":0,"msgSnippet":"A couple of times when I ve pressed people to keep their marriages strong and peaceful for the good of their kids, people have come back with Are you","messageBody":"<div id=\"ygrps-yiv-835280605\">A couple of times when I&#39;ve pressed people to keep their marriages  <br/>\nstrong and peaceful for the good of their kids, people have come back  <br/>\nwith &quot;Are you Christian?&quot; or &quot;I didn&#39;t know this was a religious list.&quot;<br/>\n<br/>\nSeriously?  People think religion is the only purpose of marriage?  I  <br/>\nthink that only comes from having been religious and then left, and  <br/>\nthinking that now that one isn&#39;t religious, all the &quot;rules&quot; are gone,  <br/>\nbecause they only had to do with making God happy.   Some people think  <br/>\nmaybe that atheists like to run around lying and killing and getting  <br/>\ndivorced.<br/>\n<br/>\nAnyway, I just picked up the coolest idea and will quote it  <br/>\nanonymously because it came from another list:<br/>\n<br/>\n-----------------<br/>\nOne friend, whose husband left her, she fought really hard to keep<br/>\nthe marriage together, said - we have all the bad parts of the<br/>\nrelationship still with none of the good parts. Her kids are both in<br/>\nschool now, BTW.<br/>\n---------------<br/>\n<br/>\nIt&#39;s not good for unschooling.  It&#39;s not good for peaceful parenting.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":51206,"nextTopicId":51238}}