{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":564662503,"authorName":"Shira Rocklin","from":"Shira Rocklin &lt;sj.rocklin@...&gt;","profile":"shirarocklin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Apraxia of Speech?","postDate":"1449780451","msgId":76421,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBQk5SZUZzYm1DX1VOYT0zMEJnNz1jQlllYUU5ZWV6UGJxaFlmMXFjemllM0tERUY2d0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":76415,"nextInTopic":0,"prevInTime":76420,"nextInTime":76422,"topicId":76408,"numMessagesInTopic":0,"msgSnippet":"My 3.5 year old was also diagnosed with apraxia of speech.  He s been in speech therapy for about a year.  He s not been put into any programs, though they","messageBody":"<div id=\"ygrps-yiv-839271798\"><div dir=\"ltr\">My 3.5 year old was also diagnosed with apraxia of speech.  He&#39;s been in speech therapy for about a year.  He&#39;s not been put into any programs, though they have been gently suggested - I feel he gets plenty of time to speak to other kids through our homeschooling activities.  I&#39;ve sampled a number of therapists, and they really vary in how well they can engage and build rapport and truly show caring about the child.  We&#39;ve quit the ones that don&#39;t work well, so far.  So, just saying, a lot depends on the therapist.  I have found it helpful for my son, he seems to enjoy it, and the therapist works with him, so if he&#39;s not into it, we can end early.  Also, look into PROMPT trained therapists, if you continue that route - its been specifically studied for apraxia and shown to work best at building the brain/mouth connection, from what I&#39;ve been told.  <div><br></div><div>Also, we found someone who comes to our house - so there is less ordeal of travelling for everyone.  And it all seems to work best when the older siblings sit in with us at the kitchen table, observing sometimes, colouring sometimes... my son seems to feel like he&#39;s a part of things and not missing out on something elsewhere in the house.  She&#39;s been paying lots of attention to which types of toys really engage him, and really tailors her choices that way for him.  Also, I did a bit more research after we moved and needed to find someone new, and I found out that for apraxia therapy for shorter stints, more often, is better than longer sessions less frequently.  They recommend 4 times a week for 15-30 minutes I think.  We can&#39;t afford that, but instead of the 1hr/1x we do two days for 30min, which is easier for his age/interest level anyhow.  </div><div><br></div><div>I&#39;m not sure how well this fits to this group - speech issues have come up in the past.  Often a speech issue is mild enough, or of a kind that often can resolve itself with age, or where a child and parent can watch some videos and experiment, or the child is well-enough understood that the speech issue doesn&#39;t interfere with much.  Apraxia, at least of the severity my son has, makes him 90% unintelligible to most people, and about 50% intelligible to his own family.  While I would never force him to be in the therapy, I have made it a priority for him to have access to this as much as we can.  From what I&#39;ve researched, it looks to me like this particular motor-speech problem doesn&#39;t resolve itself with age/time, it requires a certain amount of repetition to create the brain/mouth connection (its really the same thing as a person after a stroke, who also has apraxia of speech, or can&#39;t walk, etc).  So I took all that, and his frustration at not being understood, and the likelihood that it will be more difficult for him to live this way as he gets older, and really prioritized finding a therapist that would make this fun and easy for him, so he would be more inclined to WANT to participate.    <br><div><br clear=\"all\"><div><div class=\"ygrps-yiv-839271798gmail_signature\"><div dir=\"ltr\"><div><div dir=\"ltr\"><div><div dir=\"ltr\"><div dir=\"ltr\"><div dir=\"ltr\"><div style=\"font-size:12.8000001907349px;\">Shira Rocklin</div><div style=\"font-size:12.8000001907349px;\">Hypnobabies Childbirth Hypnosis Instructor</div><div style=\"font-size:12.8000001907349px;\"><br></div><div style=\"font-size:12.8000001907349px;\"><a rel=\"nofollow\" target=\"_blank\" href=\"http://www.radiantbirth.ca/\" style=\"font-size:12.8000001907349px;\">www.RadiantBirth.ca</a><br></div><div style=\"font-size:12.8000001907349px;\"><span style=\"font-size:12.8000001907349px;\">Hypnobabies Classes in the GTA! Register now!</span><br></div><div style=\"font-size:12.8000001907349px;\">Like my Facebook page <a rel=\"nofollow\" target=\"_blank\" href=\"https://www.facebook.com/pages/Radiant-Birth-Hypnobabies/352684934933157\">Radiant Birth Hypnobabies</a>!</div><div style=\"font-size:12.8000001907349px;\">Follow me on Twitter <a rel=\"nofollow\" target=\"_blank\" href=\"https://twitter.com/BirthRadiant\">@BirthRadiant</a>!</div><div style=\"font-size:12.8000001907349px;\">Can&#39;t wait to take my class?  Try the <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.hypnobabies-store.com/link.cgi?affiliateID=242\">Home-Study Course</a>!</div></div></div></div></div></div></div></div></div></div>\n</div></div></div></div>","specialLinks":[]},{"userId":471246740,"authorName":"","from":"settledwater@...","profile":"katiesloat","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Apraxia of Speech?","postDate":"1449763448","msgId":76415,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI2MjE4QkZGLTBEQ0YtNEVCMy1CQjI0LTU5MDUwMkM1QTExRUBnbWFpbC5jb20+"},"prevInTopic":76414,"nextInTopic":76421,"prevInTime":76414,"nextInTime":76416,"topicId":76408,"numMessagesInTopic":0,"msgSnippet":"I m not sure if this will help but this has been our experience . . . At the age of two my son had his own language, he could not control his mouth enough to","messageBody":"<div id=\"ygrps-yiv-363581948\">I&#39;m not sure if this will help but this has been our experience . . . <br/>\nAt the age of two my son had his own language, he could not control his mouth enough to form words.  Because he was so young he was put into a speech therapy program where the therapist  came to our home.  She would come and read to him and did some work with him but she felt he needed time to grow and his body and mind to develop.  She sited a boy on her caseload that she had worked with for 5 years that made little improvement but when he was eight he was able to hear himself better and started getting his sounds.  We were told not to worry.<br/>\n<br/>\nFor us a turning point occurred when she suggested an OT.  The OT came to the house a couple of times and finally figured out that he couldn&#39;t control his mouth at all.  He couldn&#39;t poke his tongue out straight or lick the corners of his mouth, he couldn&#39;t move a piece of food from one cheek to the other with his tongue (this is important for chewing food, most of us do this instinctually), he couldn&#39;t even tighten his lips in a pucker.   She did the lollipop test/exercises to help him this. (Hold a lollipop outside your mouth in front and try to lick the lollipop with a straightened tongue, then do it at each side of your mouth. Next put the lollipop in your mouth on the inside of your cheek then roll it back and forth to the opposing sides.  Lastly hold on to the lollipop with your lips and try to make a popping sound as you pull the lollipop out.). My son couldn&#39;t pass any of that test, I was flabbergasted.  <br/>\nAt first we started doing the lollipop exercises with him daily and just read to him and spoke to him and let him take his time when speaking to us.  For the past couple of years we have done the exercises on and off but we stopped making his speech a big issue and just let him play.  Ultimately we stopped doing the exercises all together.  Little by little we started to understand him more and more, and then suddenly it all clicked and he could do the exercises and control his tongue.  <br/>\nHe has always been unschooled.  He is now 7.5 and he has almost all his sounds and I think once he looses his two front teeth (any day now) he will have those th and s sounds.  <br/>\nI truly believe being unschooled has given him the time and space he needed to develop at his own pace with no pressure to preform.  I don&#39;t even want to begin to imagine the self esteem impact he would have felt if he had been in school.  The children at the park used to make him feel self conscious enough.  In our case it seemed similar to reading and unschooling, if you give them time and support it will happen in its own time.<br/>\n<br/>\n<br/>\n<br/>\nSent from my iPad</div>","specialLinks":[]},{"userId":50712510,"authorName":"Michelle Marr","from":"Michelle Marr &lt;michelle_m29@...&gt;","profile":"michelle_m29","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Apraxia of Speech?","postDate":"1449757665","msgId":76414,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0Nzc3MDU4ODguMjMzNDUyLjE0NDk3NTc2NjUzOTUuSmF2YU1haWwueWFob29AbWFpbC55YWhvby5jb20+","referencesHeader":"PDE0Nzc3MDU4ODguMjMzNDUyLjE0NDk3NTc2NjUzOTUuSmF2YU1haWwueWFob28ucmVmQG1haWwueWFob28uY29tPg=="},"prevInTopic":76412,"nextInTopic":76415,"prevInTime":76413,"nextInTime":76415,"topicId":76408,"numMessagesInTopic":0,"msgSnippet":"My son Quinn, who is eleven now and has never been to school, was diagnosed with Apraxia of speech when he was little (maybe three, not more than four.)  That","messageBody":"<div id=\"ygrps-yiv-382409596\">My son Quinn, who is eleven now and has never been to school, was diagnosed with Apraxia of speech when he was little (maybe three, not more than four.)  That diagnosis came from his speech therapist, but (following their advice) we never went to see the specialist and invested the money it would have cost for a formal diagnosis because the therapy would have been exactly the same. My understanding is that he wasn&#39;t quite typical. When we started therapy, he  could only make 5% of the sounds they tested for, but he did talk in complete sentences and have an great vocabulary. 3/4 of the sounds  coming out of his mouth were &quot;h,&quot; which he substitute for everything.<br/>\n<br/>\nWe&#39;ve always done private therapy and I&#39;ve always sat in on his sessions. As far as I know, I&#39;m the ONLY parent they have there at that center who does that. Most parents drop the kids and take off to run errands for the hour. They don&#39;t offer sitting in as a choice. When I made his first appointment I told them, nicely, that I would be sitting in there with him. It&#39;s never been a problem. Once or twice a therapist has suggested my leaving the room, either for a few minutes or a whole session. For the most part, I&#39;ve refused, or gently put it off. They&#39;ll go down the hall alone together for something, or I&#39;ll step out to answer a phone call, but that&#39;s been about it.<br/>\n<br/>\nI take my knitting and try to keep as quiet as possible, unless I&#39;ve been asked to join a game or activity. When things are going off track or require some extra explanation, I sometimes translate. That was required the morning after a car hit a horse on the highway just outside our living room window and guys came to the door to ask if we had a gun, then another neighbor came and shot the horse -- that story doesn&#39;t make any kind of sense even if you understand all of the words and were there watching it unfold.   Last week, they were doing a very scripted game of twenty questions (rolling dice and using pictures on a card to determine what you were) and Quinn wasn&#39;t sure how to answer whether an alligator is food. We&#39;ve ordered it in a restaurant on purpose. <br/>\n<br/>\nOver time, Quinn has picked up all of the different sounds and now it&#39;s just a matter of his substituting a few now and then. We&#39;re getting very close to the end of speech therapy. These days, most strangers can understand everything he says.    That&#39;s a huge big deal -- when we started, only his siblings and I could really understand him and we sometimes couldn&#39;t. If he wanted something unexpected, it could turn into a very long game of twenty questions -- probably the most memorable was the day he wanted to watch Gunsmoke, except he really meant Have Gun Will Travel and I think the clues he was giving us were from Bonanza. But he&#39;d never asked for a cowboy show, so his sister and I were doing an awful job at figuring it out. I think that having patient siblings made a huge difference for him. <br/>\n<br/>\nLooking back, I can&#39;t remember his ever having had trouble with communicating with other kids at park days or activities, maybe because there was usually a sibling nearby to translate?  <br/>\n <br/>\nIf it had been entirely my call, I would have done fewer appointments. There was a LOT of sucking jello and pudding through straws and blowing bubbles and whistles, all of it stuff that he could&#39;ve just as easily done in our own house. And he did do a lot of it at home. I kept the fridge stocked with straw-suckable foods. We went to the party store and found all sorts of things to blow into (and I learned that Kazoos don&#39;t involve blowing -- oops!) and got lots of balloons for shooting through the house and stretching the necks to make squeaking sounds. I didn&#39;t push any of that at home, just let him play with what he wanted. Bubbles and whistles are fun, so he used them.  Honestly, I don&#39;t know that all of those years of oral motor skills did much. <br/>\n<br/>\nThe therapists did show him how to move his mouth to make different sounds, which I couldn&#39;t have done on my own. But once they showed him (and me) how a sound worked, we could practice at home. <br/>\n<br/>\nSpeech therapy was very stressful for us. Probably more for me than for Quinn, and definitely for his father, who  worried that he&#39;d always be impossible to understand. I think it helped considerably to use a private therapist so that there was always the option of going elsewhere. (Several of his therapists were also doing work for the school district and advised against going that route because according to them it wouldn&#39;t be worth the hassle.)  We did change facilities once due to insurance coverage, therapists once by my choice and another four or five times due to staff turnover. Two of the therapists were truly awful.  Several have been great. <br/>\n <br/>\nI don&#39;t know how much of the improvement to Quinn&#39;s speech is due to therapy and how much he would have improved on his own  as he grew up. One thing that I didn&#39;t learn until much later was that tantrums are common with apraxia. I think it would have made our lives much easier if I&#39;d realized that. Not that I would have handled it differently, but there are a few adults in his life who I think would&#39;ve reacted differently if I&#39;d been able to say &quot;the therapist said that...&quot;  The tantrums tapered off over the years as his speech improved. <br/>\n<br/>\nMichelle</div>","specialLinks":[]},{"userId":577089634,"authorName":"Clare Kirkpatrick","from":"Clare Kirkpatrick &lt;claremkirkpatrick@...&gt;","profile":"clarekirkp","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Apraxia of Speech?","postDate":"1449729730","msgId":76412,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBT3V3UDZVM3NaNnVqYkNUdU1RNnFWWDc1R0J2ZW5FUmg5aXRhcVV5YVRyc19uMC1PQUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PG40YWdycysxcHRsOGpzQFlhaG9vR3JvdXBzLmNvbT4=","referencesHeader":"PG40YWdycysxcHRsOGpzQFlhaG9vR3JvdXBzLmNvbT4="},"prevInTopic":76409,"nextInTopic":76414,"prevInTime":76411,"nextInTime":76413,"topicId":76408,"numMessagesInTopic":0,"msgSnippet":"I think picking apart, with your husband,  what you actually think your son will gain from school, would be helpful. Social anxiety is not likely to be helped","messageBody":"<div id=\"ygrps-yiv-1183482581\"><p dir=\"ltr\">I think picking apart, with your husband,  what you actually think your son will gain from school, would be helpful. </p>\n<p dir=\"ltr\">Social anxiety is not likely to be helped by being forced into social situations without the support of a loving, trusted adult. I have a daughter who is now twelve. She could easily have been described as socially anxious at your son&#39;s age. We took our cues from her. If I wasn&#39;t allowed to stay with her at something and she didn&#39;t feel comfortable staying, we didn&#39;t do it. I&#39;m fact, I can safely say I would never have managed to get her to go to preschool without a huge amount of tears, distress and damage to our relationship so maybe she found social stuff even harder than your son does! Like many adults, she still dislikes group situations now but she can cope with them and even enjoy them if it&#39;s the right group and she&#39;s in the right frame of mind. Apart from groups, though, she could never be described as socially anxious now. She is confident and mature. She got the bus with her friend the other day with no adults. I&#39;m glad we didn&#39;t push her into situations she wasn&#39;t ready for when she was younger. In that respect (and many others), and would say she was a real unschooling success story. </p>\n<p dir=\"ltr\">With regard to the apraxia of speech. I don&#39;t know much about it. As a nurse and an unschooling mum, I&#39;m often suspicious of mainstream medical advice based, as it is, on professionals experience with mainstream kids. It&#39;s simply a case of them being unable to pick apart what they see in an unschooling family and tailor their advice accordingly. If you can look at the things they&#39;ve told you he needs - not simply &#39;school&#39;, but what they think he would get from school, you and your husband may be able to reassure yourselves and, then, the professionals, that unschooling really well fulfil those needs the best. </p>\n<p dir=\"ltr\">I looked up apraxia of speech and I didn&#39;t find anything suggesting school was needed. Intensive therapy, yes. A supportive environment where the child feels safe to practice - that&#39;s definitely going to be better provided at home. Plenty of opportunity to talk. I think John Holt said that it&#39;s ironic how the people who need to practice speaking the most get the least chance to practice in school. At school your son will get a lot of chance to talk with his peers, but he may feel too anxious to so not do very much. And he&#39;ll be talking mostly to other people who don&#39;t have much practice, relatively speaking (ie. Children his own age). Being at home with you gives him way more opportunity to practice speaking and with someone he trusts and who has way more experience than him with speaking can help him more. </p>\n<p dir=\"ltr\">To me, whether home or school can meet his needs best is a bit of a no-brainer.</p>\n<p dir=\"ltr\">Clare</p></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Apraxia of Speech?","postDate":"1449709917","msgId":76409,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlBNkRFRTg0LUJFOTItNEM4QS1BNEFFLTNCNjJGRjY0RENFMEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PG40YWdycysxcHRsOGpzQFlhaG9vR3JvdXBzLmNvbT4=","referencesHeader":"PG40YWdycysxcHRsOGpzQFlhaG9vR3JvdXBzLmNvbT4="},"prevInTopic":76408,"nextInTopic":76412,"prevInTime":76408,"nextInTime":76410,"topicId":76408,"numMessagesInTopic":0,"msgSnippet":"There’s an unschooling mom who does speech therapy by skype listed here.  I know her in person.  She’s good  She helped Holly a lot to understand and help","messageBody":"<div id=\"ygrps-yiv-2104825062\">There’s an unschooling mom who does speech therapy by skype listed here.  I know her in person.  She’s good  She helped Holly a lot to understand and help a girl Holly was nannying fulltime for a few years back.  <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/issues/therapy\">http://sandradodd.com/issues/therapy</a><br/>\n<br/>\nIf your husband really wants him in school and that’s the way you’re going, it won’t be an unschooling question.  But be good to your husband in here, too.  Don’t risk the marriage.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/divorce\">http://sandradodd.com/divorce</a><br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":188977698,"authorName":"","from":"amandasunshowers@...","profile":"amandasunshowers","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Apraxia of Speech?","postDate":"1449707196","msgId":76408,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PG40YWdycysxcHRsOGpzQFlhaG9vR3JvdXBzLmNvbT4="},"prevInTopic":0,"nextInTopic":76409,"prevInTime":76407,"nextInTime":76409,"topicId":76408,"numMessagesInTopic":0,"msgSnippet":"Hi, This is my first post but I have been a reader for a few years and I have learned so much from this list.  My daughter has been unschooled for her first 12","messageBody":"<div id=\"ygrps-yiv-1757634623\"><p><span>Hi,</span></p><p><span>This is my first post but I have been a reader for a few years and I have learned so much from this list.&nbsp; My daughter has been&nbsp;unschooled for her first 12 years and is doing well.&nbsp; </span></p><p><span></span>&nbsp;</p><p><span>My question is about my son, he </span><span>is 4 years old and&nbsp;was&nbsp;diagnosed with apraxia of speech about 8 months&nbsp;ago from the school district.&nbsp; The school district advised we start preschool and have speech from the school, this was last spring and I was allowed to go with him to preschool for the last 3 weeks of school.&nbsp; He did not like it and did not want to go.&nbsp;It was stressful for all of us as he was clearly anxious and at the time my husband was worried about my son and wanted us to go to school.&nbsp;We tried speech therapy when he was 2 but he cried and wouldn&#39;t take part so I&nbsp;tried to learn what to do to help him do&nbsp;speech at home and he did improve some. </span></p><p><span>At&nbsp;the beginning of summer, we started private&nbsp;speech and occupational therapy&nbsp;and he is ok with this therapy and his speech is improving.&nbsp;So when school started again this past fall I told them no to the preschool but we would do speech only with the school. My son agreed to try this but&nbsp;during the second session I was told to sit on the other side of the room away from him.&nbsp; He was ok for about 15 minutes then began to cry.&nbsp; He doesn&#39;t want to go back.&nbsp;&nbsp;I don&#39;t want to go back but I&#39;m worried I&#39;m doing him a disservice.&nbsp; All the experts are telling me&nbsp;he needs to be in school.&nbsp;&nbsp;&nbsp;Does anyone have experience unschooling a child with apraxia of speech and social anxiety?&nbsp;</span><span>&nbsp;&nbsp;I have lost confidence and thought some examples of children&nbsp;with apraxia of speech being unschooled and having there speech improve without school would help me.&nbsp;&nbsp;</span></p><p><span></span>&nbsp;</p><p><span>Thank you all,</span></p><p><span>Amanda&nbsp;</span></p></div>","specialLinks":[]}],"prevTopicId":76416,"nextTopicId":76389}}