{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Nancy from MI","from":"&quot;Nancy from MI&quot; &lt;hammondcentral@...&gt;","replyTo":"LIST","senderId":"ylyRVSpvGAUVbkaXQyMXnsG3QSCtC_Od9mrUH-7_BlHwy6uUmSQbCMEVdrznWKGNS2dwah36Yn6CCcxbRmFuFkAS9Q8zAg7NNWjwA7Y1Zsoaloqw9w","spamInfo":{"isSpam":false,"reason":"0"},"subject":"[Fwd: Algebra Times - April 2001 Part 1]","postDate":"988334395","msgId":19855,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDljYWhmcis0Ym51QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":19854,"nextInTime":19856,"topicId":19855,"numMessagesInTopic":0,"msgSnippet":"An interestig forward from another home school list. ~Nancy ... Hi, Just had to send along this Algebra Times - it includes a great article about grade-level","messageBody":"<div id=\"ygrps-yiv-258975269\">An interestig forward from another home school list. <br/>\n<br/>\n~Nancy<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In HomeschoolSupport@y..., Marsha Ransom &lt;mransom@c...&gt; wrote:<br/>\nHi, Just had to send along this Algebra Times - it includes a great<br/>\narticle about grade-level appropriate math - if you want to subscribe <br/>\ngo to the end.  Marsha<br/>\n<br/>\nHi Everybody,<br/>\n<br/>\nHere&#39;s what&#39;s you can check out in our full-length<br/>\n(and I do mean &quot;full-length&quot;) springtime issue:<br/>\n<br/>\n-  Discussion on the concept of<br/>\n&quot;age appropriate&quot; curriculae<br/>\n<br/>\n- A &quot;trick&quot; on using prime numbers to help you<br/>\nreduce fractions.<br/>\n<br/>\n-  A springtime lesson plan on ways children<br/>\ncan use math in setting up and developing a garden.<br/>\n<br/>\n-  A Problem of the Month on how to be<br/>\nan efficient gardener.<br/>\n<br/>\n<br/>\nHappy Springtime!<br/>\n- Josh<br/>\n<br/>\nP.S.:  Note that if you want our<br/>\nsubscribe/unsubscribe instructions are<br/>\nat the bottom of each section of the<br/>\nNL.<br/>\n<br/>\n-------------------------------------------------<br/>\n<br/>\nThe Algebra Times<br/>\n<br/>\n- a newsletter -<br/>\n<br/>\nVol. 4, Issue 8<br/>\n<br/>\nApril 2001<br/>\n<br/>\n<br/>\nQUOTE OF THE MONTH -<br/>\n<br/>\n&quot;Nature&#39;s great book is written in mathematical symbols.&quot;<br/>\n- Galileo Galilei<br/>\n<br/>\n***********************************************<br/>\n<br/>\n&quot;AGE-APPROPRIATE&quot; CURRICULAE<br/>\n<br/>\nFor this month&#39;s discussion, I&#39;d like to address the<br/>\ngeneral idea of &quot;age appropriate&quot;curriculae. There<br/>\nare ways that what I&#39;ll say has relevance for both<br/>\nclassroom teachers and homeschoolers, so I&#39;ll<br/>\ntry to address both groups.<br/>\n<br/>\nFirst of all, I want to say that I attended public school<br/>\nfrom kindergarten through 12th grade, and I came out of<br/>\nthat experience with the expected prejudices about &quot;age<br/>\nappropriate&quot; curriculae. Namely, that at certain ages, children<br/>\nbecome ready for certain concepts; that they are not ready<br/>\nbeforehand; and that they would be bored if you were to<br/>\nteach a topic too late. [i.e:  you do in Algebra 1<br/>\nin eighth grade, not before, not after.]<br/>\n<br/>\nLately, in my work with both schooled and<br/>\nhomeschooled children, it&#39;s as if a metaphorical wrecking<br/>\nball has come along and demolished this notion.<br/>\n<br/>\nThree examples to show what I mean -<br/>\n<br/>\nExample #1:   I&#39;m working with a public schooled kindergarten child<br/>\nwhose parents want me to do math enrichment.<br/>\n<br/>\nA few weeks ago she learned quite a bit about negative numbers,<br/>\nand I&#39;d like to share how this happened.<br/>\n<br/>\nShe and I were playing around with subtraction<br/>\nproblems, and I had just asked her what<br/>\n8 - 3 was. She said 5, and then she asked, &quot;What&#39;s 3 - 8?&quot;<br/>\nI asked her what she thought it would be. She pondered<br/>\nfor a moment and said, &quot;You can&#39;t do it.&quot; I said, &quot;Well,<br/>\nactually, in much more advanced math, you can do it,<br/>\nand the answer would be negative 5.&quot;<br/>\n<br/>\nAt that, this girl started chuckling. She kept saying<br/>\n&quot;negative three&quot; and laughing. I offered her a way<br/>\nof understanding this by asking: &quot;Imagine that you<br/>\nhave three pennies, but you owe someone 8. What<br/>\nwould happen?&quot; She said, &quot;I&#39;d give them the three, but<br/>\nthen I&#39;d still owe them more.&quot; I said, &quot;Can you figure out<br/>\nhow many more you&#39;d owe.&quot; She took a moment, and then<br/>\ncounted up from 3 to 8, using her fingers, and eventually<br/>\nsaid five. I said, &quot;Right, you&#39;d owe five more. And when<br/>\nyou end up owing money, the amount is negative. Since you&#39;d owe<br/>\nfive, 3 - 8 is negative 5.<br/>\n<br/>\nFor some reason, this girl loved this concept. It just<br/>\nintrigued her. She asked me to give her more problems<br/>\nwith negative numbers. What was I going to do? Refuse?!<br/>\n<br/>\nSo since then, she and I have been doing a slew<br/>\nof problems with negative numbers. Once she even<br/>\nfigured out 9 - 23. Wish you could have seen the look<br/>\non her face when I told her she was right!<br/>\n<br/>\nHere&#39;s a kindergartner learning something that is ordinarily<br/>\ntaught in seventh grade.<br/>\n<br/>\nExample #2:   I&#39;m working with a first-grade boy who is homeschooled<br/>\nand his parents also want enrichment. One day he was<br/>\nstanding in the entrance to my office, which has saltillo<br/>\ntiling, large tile whose grout lines form a square grid pattern. I <br/>\nwondered<br/>\nif we might use this floor design to introduce the notion<br/>\nof the coordinate plane. I explain that where he was standing<br/>\nwe would call the center; I explained that distances to the right of<br/>\nthe center would be called x distances, and that distances<br/>\nup from the center would be called y-distances. I sensed that he<br/>\nliked the sound of those terms, so I talked a bit about sci-fi shows<br/>\nlike Star Trek where people need to give their coordinates so that<br/>\nothers can beam them up or locate them. He thought that was cool.<br/>\nThen I asked him if thought he could locate me by my x- and<br/>\ny-distances if I stood at a certain intersection point where the<br/>\ngrout lines met. He said he wasn&#39;t sure. I told him I&#39;d help him<br/>\nfigure it out.<br/>\n<br/>\nIt really wasn&#39;t hard. Within 10 minutes, he was able to give my<br/>\nx- and y-coordinates. Oh, I guess I must confess. Part of what<br/>\nmotivated him is this. I told him that if he stated my coordinates<br/>\ncorrectly, then he would blow me up. The first time he exploded me,<br/>\nhe was hooked. (Boys are boys, right?).<br/>\n<br/>\nOf course, in this case, the boy was learning about the first quadrant<br/>\nof the coordinate plane. But I&#39;m confident that with a little more <br/>\nwork,<br/>\nhe would be able to locate a point in any of the four quadrants.<br/>\n<br/>\nHere&#39;s a first-grader learning something that is ordinarily<br/>\ntaught in 8th or 9th grade.<br/>\n<br/>\nExample #3:  The same kindergarten girl that I mentioned above<br/>\nwas working on counting with me one day. As we approached<br/>\nthe number 10, I had her take 10 popsicle sticks and bind<br/>\nthem with a rubber band. To help her grasp the idea<br/>\nof place value, we divided my desk into two sections,<br/>\ndivided by a chopstick taped down with masking tape<br/>\n(I love Asian food, what can I say!).<br/>\n<br/>\nIn the section to the right of the chopstick she placed single <br/>\npopsicle<br/>\nsticks; in the section to the left of the chopstick she placed bundles<br/>\nof 10 popsicle sticks. With a little bit of work, she was able to<br/>\nsee that a number like 37 means three bundles and 7 singles,<br/>\nthat the number in the 10&#39;s place means number of bundles,<br/>\nwhile the number in the 1&#39;s place means number of singles.<br/>\n<br/>\nDuring this first session on the topic, this girl did problems like 23 <br/>\n+ 34<br/>\nusing the manipulatives. By the next session, she was doing problems<br/>\nlike 23 + 34 (no carrying) in her head. Four sessions later, she was <br/>\nable to do<br/>\nproblems like 26 + 38 in her head. She would mutter to herself:<br/>\n&quot;O.K. 2 bundles and 3 bundles is 5 bundles. 6 and 8 is ....... 14.<br/>\nYou take 10 from the 14 and bundle them up. Now you have ... 6<br/>\nbundles, and you have four singles left. So it&#39;s sixty-four.&quot;<br/>\n<br/>\nHere is a kindergartner doing second grade math, but mentally,<br/>\nand with command of place value.<br/>\n<br/>\nYou might be thinking ... these must be exceptional children.<br/>\nWell, I&#39;ve been tutoring/teaching for 11 years now, and I can<br/>\ntell you that while these children are bright, they are<br/>\nnot the most mathematically intuitive youngsters<br/>\nI&#39;ve worked with. They are just curious and fun, like most kids.<br/>\n<br/>\nYou might also wonder if I&#39;m advocating that we speed kids<br/>\nalong and try to make them all little math geniuses by third grade?<br/>\nNo. All I&#39;m saying is that if we pay attention to clues kids give us<br/>\n(like the girl asking what 3 - 8 would be, then giggling at the <br/>\nanswer),<br/>\nwe will find that children are often ready to explore math ideas that<br/>\nare slated for later grades.<br/>\n<br/>\nIn this respect, hats off to the National Council<br/>\nof Mathematics Teachers. This organization in 2000 put out<br/>\ngeneral standards stating that children should be taught in five <br/>\ncontent areas<br/>\nfrom kindergarten through 12th grade. These are:<br/>\n-  number & operation<br/>\n- algebra<br/>\n- geometry<br/>\n- measurement<br/>\n- data analysis and probability<br/>\n<br/>\nIf you&#39;d like to read these standards and see how they<br/>\ncan help you do all kinds of interesting math with your<br/>\nchildren, just go to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://standards.nctm.org/document/index.htm\">http://standards.nctm.org/document/index.htm</a><br/>\nto get the standards.<br/>\n<br/>\nFor more info about the NCTM in general, visit:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.nctm.org\">http://www.nctm.org</a><br/>\n<br/>\nThe point is: if we just keep our eyes and ears open to the curiosity<br/>\nof children, we will see that they are often interested<br/>\nin and ready to explore math concepts beyond what<br/>\nthe state education departments or local school districts<br/>\ntell us they should be learning.<br/>\n<br/>\nFor me, the key has been listening to the questions of<br/>\nchildren, and having faith that they can learn a lot more<br/>\nthan we might think.<br/>\n<br/>\n++++++++++++++++++++++++++++++++++<br/>\n<br/>\nPASS IT ALONG -<br/>\n<br/>\nIf you like what you read in the Algebra Times,<br/>\nfeel free to forward a copy to a friend - or<br/>\nto your distribution list of fellow educators<br/>\nor homeschoolers. Many homeschoolers<br/>\nsend it out along their email loop, and it&#39;s<br/>\nfine with me if you do.<br/>\n<br/>\n++++++++++++++++++++++++++++++++++<br/>\n<br/>\n<br/>\nTRICK OR TREAT?  TIME FOR A TRICK<br/>\n<br/>\nThe other day I was working on reducing fractions<br/>\nwith a tutee, and I saw something new and useful<br/>\nabout reducing fractions.<br/>\n<br/>\nWhen we run into a fraction like 12/25, we know<br/>\nthat it can&#39;t be reduced further, and if you ask most<br/>\nteachers (at least most I know), they&#39;ll say it&#39;s because<br/>\nthe two numbers, 12 and 25, have no common factors.<br/>\n<br/>\nThis is certainly true, and this is a perfectly valid way of<br/>\nexplaining why the fraction can&#39;t be reduced further.<br/>\n<br/>\nBut all of a sudden I realized another way of looking<br/>\nat the situation. If you look at the gap (or difference)<br/>\nbetween 12 and 25, you&#39;ll see that it&#39;s 13, a prime number.<br/>\n<br/>\nIf you just think about this for a moment, you&#39;ll see that<br/>\nsince this gap is a prime number, there are only two<br/>\nnumbers that will divide that gap evenly: 1 and 13.<br/>\n<br/>\n1 has no power to reduce a fraction, and 13 does not<br/>\ngo into 25, so this leads to a shortcut:<br/>\n<br/>\nIf the difference between the numerator and denominator of a fraction<br/>\nturns out to be a prime number, you need only check if that<br/>\nprime number goes into the numerator or denominator.<br/>\n<br/>\nIf it goes into one, it will go into the other, and the fraction<br/>\ncan be reduced in one step. Examples of this would be:<br/>\n<br/>\n14/21 (7 apart, and 7 goes into both),<br/>\nreducing to 2/3<br/>\n<br/>\n39/52 (13 apart, and 13 goes into both),<br/>\nreducing to 3/4<br/>\n<br/>\nIf the gap number does not go into either, then the fraction<br/>\ncannot be reduced. Examples of this would be:<br/>\n<br/>\n38/45 (7 apart, but 7 goes into neither),<br/>\nso it can&#39;t be reduced.<br/>\n<br/>\n80/93 (13 apart, but 13 goes into neither),<br/>\nso it can&#39;t be reduced.<br/>\n<br/>\nAnd now you can get a little bit of practice with this idea:<br/>\n<br/>\nFor each of the fractions below, find the gap between<br/>\nthe fraction&#39;s numerator and denominator, and see if it<br/>\nis a prime number. Then use the ideas above to see whether<br/>\nor not the fraction can be reduced, and if it can,<br/>\nwhat it reduces to. (Answers at end of newsletter.)<br/>\n<br/>\na)  32/39<br/>\n<br/>\nb)  40/51<br/>\n<br/>\nc)  25/38<br/>\n<br/>\nd)  28/33<br/>\n<br/>\ne)  52/65<br/>\n<br/>\nf)  27/44<br/>\n<br/>\ng)  88/95<br/>\n<br/>\nh)  42/65<br/>\n<br/>\nj)  22/25<br/>\n<br/>\nk)  51/80<br/>\n<br/>\n<br/>\nXYXYXYXYXYXYXYXYXYXYXYXYXYXXYX<br/>\n<br/>\nALGEBRA SURVIVAL GUIDE UPDATE<br/>\n<br/>\nThe Algebra Survival Guide is helping homeschoolers,<br/>\nteachers, tutors and students. To get your copy of this<br/>\ndelightful book, just follow the links at my website:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://algebrawizard.com/askinfo.html\">http://algebrawizard.com/askinfo.html</a><br/>\nor go to your nearest Barnes & Noble or Waldenbooks,<br/>\nor any local bookstore, for that matter. The book is<br/>\navailable through INGRAM, the largest wholesaler<br/>\nof books in the country.<br/>\n<br/>\nXYXYXYXYXYXYXYXYXYXYXYXYXYXXYX<br/>\n<br/>\nEND OF PART I<br/>\n<br/>\nCopyright 2001, by Josh Rappaport. All rights reserved.<br/>\nMay be redistributed if the entire newsletter, including signature,<br/>\nis used.<br/>\n<br/>\nSUBSCRIBE / UNSUBSCRIBE INSTRUCTIONS:<br/>\n<br/>\nSubscribe/unsubscribe<br/>\n<br/>\nTo subscribe, send email to<br/>\njoin-algebra@a...<br/>\nmailto:join-algebra@a...<br/>\n<br/>\nTo unsubscribe, send email to<br/>\nleave-algebra@a...<br/>\nmailto:leave-algebra@a...<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\nJosh Rappaport<br/>\nPublisher, Singing Turtle Press<br/>\n#770, 3530 Zafarano Drive #6<br/>\nSanta Fe, New Mexico 87505<br/>\n<br/>\nVoice:  1-505/438-3418<br/>\nToll-Free:  1-888/308-MATH<br/>\nFax:  1-505/438-7742<br/>\nEmail: josh@A...<br/>\nWebsite:  <a rel=\"nofollow\" target=\"_blank\" href=\"http://AlgebraWizard.com\">http://AlgebraWizard.com</a><br/>\n<br/>\n{#} ----------------------------------------------------+[ Algebra <br/>\n]+---<br/>\n--- End forwarded message --- </span></blockquote></div>","specialLinks":[]}],"prevTopicId":19678,"nextTopicId":19860}}