{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":779600,"authorName":"KathrynJB@aol.com","from":"KathrynJB@...","profile":"kathrynbeth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Praise- Another Question- long","postDate":"1051908180","msgId":67430,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFkZi44MTc3MDUwLjJiZTQzMjU0QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":67429,"nextInTime":67431,"topicId":67430,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/2/2003 4:19:18 PM Eastern Standard Time, ... Geeze Louise...this really sucks. Nice messages to give in church! I guess you have to figure","messageBody":"<div id=\"ygrps-yiv-807865251\">In a message dated 5/2/2003 4:19:18 PM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; On this same issue of praise I just had an experience that I would like some <br/>\n&gt; ideas on. As I touched on briefly our church Sunday school is doing this <br/>\n&gt; reward thing - and the &quot;RULES&quot; are explicit. That is a whole subject in <br/>\n&gt; itself -  what I had a question about was this:<br/>\n&gt; <br/>\n&gt; I taught the kids class the last two evenings while adults had a special <br/>\n&gt; seminar. One child asked towards the cleanup time if he could do anything <br/>\n&gt; to help. I was pleasantly surprised and said &quot;sure&quot;. He proceeded to sweep <br/>\n&gt; all under where we were working ( we made salt dough maps).<br/>\n&gt; <br/>\n&gt; The following night the boys were fighting over who was going to do this. <br/>\n&gt; and then I overhear why ... apparently they are given &quot;coins&quot; by the Sunday <br/>\n&gt; School teacher when they do helpful things, etc. These coins can then be <br/>\n&gt; turned into prizes like matchbox cars, trinkets and such.<br/>\n&gt; <br/>\n&gt; For my  kids personally I really would like them to do helpful things for <br/>\n&gt; the intrinsic value of being helpful, kind etc. NOT because they will get a <br/>\n&gt; reward. However in real life - it does seem to work this way. If you do a <br/>\n&gt; good job you get a raise. ( or in my husbands case - get to keep your <br/>\n&gt; job;-) <br/>\n&gt; <br/>\n&gt; So these same boys who would not normally have offered to help, much less <br/>\n&gt; done a decent clean-up job - now are more than willing to pitch in when <br/>\n&gt; given a reward.<br/>\n&gt; <br/>\n&gt; I can&#39;t completely explain why - but I don&#39;t like this system. The other <br/>\n&gt; parents are fine with it - or don&#39;t want to rock the boat.  Some of them <br/>\n&gt; even go so far as to say they will &quot;call the Sunday School teacher if the <br/>\n&gt; child is &quot;bad&quot; - and then a &quot;coin&quot; will be taken away. The Sunday School <br/>\n&gt; teacher seems to feel that the kids don&#39;t have a problem with it - but I <br/>\n&gt; do. Which I do. I feel as if teaching children in this way - gives them the <br/>\n&gt; belief system that &quot;one good deed gets a reward&quot; What if there is no <br/>\n&gt; reward? <br/>\n&gt; <br/>\n&gt; I think we all are motivated by &quot;rewards&quot; of one type or another. It may <br/>\n&gt; not be monetary - but emotional. So even if I just say to the child &quot;Thanks <br/>\n&gt; for doing such a great job sweeping up. It really helped me out!&quot; I have <br/>\n&gt; &quot;rewarded&quot; him in a sense. <br/>\n&gt; <br/>\n&gt; I do have one child in this class - and luckily he is either too small to <br/>\n&gt; care - or in my opinion is not developmentally ready for most of the coin <br/>\n&gt; behavior. (i.e. Sitting in the seat throughout the whole meeting; no <br/>\n&gt; disobeying parents or adults; no running or rough playing; - and others <br/>\n&gt; which I can&#39;t remember) We always have to go to the bathroom - even if <br/>\n&gt; we&#39;ve gone before. It&#39;s virtually impossible to sit in a straight backed <br/>\n&gt; chair the whole time,  there is always something that is seen as disobeying <br/>\n&gt; - and in his exuberance - sometimes forgets not to run and hop in the <br/>\n&gt; building. At times he does feel excited that he has a &quot;coin&quot;. And after I <br/>\n&gt; had it out with the teacher that the one coin that he had was taken away <br/>\n&gt; because he &quot;saw him disobey me&quot; the coins are no longer taken away once <br/>\n&gt; received.  And my son seems to really enjoy this class. Chase doesn&#39;t have <br/>\n&gt; a problem with it - its me who feels it is a bit over the top. So is it <br/>\n&gt; wrong to interfere? ( Chase is 5)<br/>\n&gt; <br/>\n&gt; What do you all think? In one sense the reward system appears to be <br/>\n&gt; working.... but is it right to instill stewardship within a person based <br/>\n&gt; upon what reward they will receive?<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Geeze Louise...this really sucks. Nice messages to give in church! I guess <br/>\nyou have to figure out what you want to teach to determine whether it&#39;s <br/>\nworking or not. It might not be a bad idea to ask what the intent is. I <br/>\nsuspect you&#39;ll hear that it&#39;s to make the kids &quot;behave&quot; while their parents <br/>\nare busy in their meeting. The hard question to ask is whether the method is <br/>\nin alignment with the spiritual purpose of the church. It&#39;d be interesting to <br/>\nsee how the parents and teacher respond.<br/>\n<br/>\nKathryn<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":67396,"nextTopicId":66110}}