{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":7143857,"authorName":"jrossedd@aol.com","from":"jrossedd@...","profile":"jrossedd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Learning to see differently/ Stages of Unschooling","postDate":"1077560518","msgId":91337,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY3LjM2ZmY1MzI0LjJkNmI5ZWM2QGFvbC5jb20+"},"prevInTopic":91291,"nextInTopic":0,"prevInTime":91336,"nextInTime":91338,"topicId":91288,"numMessagesInTopic":0,"msgSnippet":"... It s this way for me and for my family. Formal instruction of any kind imitates life, rather than the other way around. So the closer it can come to","messageBody":"<div id=\"ygrps-yiv-1960504603\"><a rel=\"nofollow\" target=\"_blank\" href=\"mailto:danielle.conger@...\">danielle.conger@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; classes happen because they&#39;re one of the more expedient ways to gain <br/>\n&gt; information in a school-driven culture. I think that many of us would be just as <br/>\n&gt; happy (maybe happier!) to learn bee-keeping from a neighbor who&#39;s been doing <br/>\n&gt; it for years. But we&#39;re not always lucky enough for a situation like this to <br/>\n&gt; present itself, so we seek out the next best solution--a class on bee-keeping. <br/>\n&gt; Mentoring relationships and informal groups, in my opinion, are far more <br/>\n&gt; valuable than classroom instruction. It&#39;s just that they aren&#39;t always options, <br/>\n&gt; whereas you can find a class on just about anything. Sometimes, a person can <br/>\n&gt; read as much about a subject as they can get their hands on--from books to <br/>\n&gt; the internet--but no amount of reading will provide the same insight as just <br/>\n&gt; talking to someone else with actual experience in the subject. I think that&#39;s <br/>\n&gt; why we seek out classes, not because there&#39;s value in taking and passing a <br/>\n&gt; class to achieve some kind of credential. <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>       It&#39;s this way for me and for my family. Formal instruction of any kind <br/>\nimitates life, rather than the other way around. <br/>\n<br/>\n       So the closer it can come to learning as we enjoy it in life, without <br/>\nsacrificing the somewhat artificial convenience and coverage that are its only <br/>\nexcuse for existing in the first place, the better I like it. :)  JJ<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":164542605,"authorName":"Danielle Conger","from":"&quot;Danielle Conger&quot; &lt;danielle.conger@...&gt;","profile":"danielleconger","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Learning to see differently/ Stages of Unschooling","postDate":"1077466286","msgId":91291,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMGEwMWMzZjk1ZSQ4NjEyZmZlMCQ2NTAxYThjMEBqZ2s2OTAwPg==","referencesHeader":"PDJiLjUxODljN2E1LjJkNmEyODBjQGFvbC5jb20+"},"prevInTopic":91288,"nextInTopic":91337,"prevInTime":91290,"nextInTime":91292,"topicId":91288,"numMessagesInTopic":0,"msgSnippet":"This was interesting Kelly. Thanks for sharing it! You got me thinking.... Kelly wrote: This is the stage when classes and instruction may eke back into our","messageBody":"<div id=\"ygrps-yiv-722553360\">This was interesting Kelly. Thanks for sharing it! You got me thinking....<br/>\n<br/>\n  Kelly wrote:<br/>\n  This is the stage when classes and instruction may eke back into our lives, <br/>\n  as it recently has in our family&#39;s. We don&#39;t give more weight to the learning <br/>\n  that is happening in Sociology-101 or karate or bee-keeping just because it&#39;s <br/>\n  happening in a classroom situation. A class is just another means of pursuing <br/>\n  our passions, making the connections, and receiving the information. Learning <br/>\n  happens all the time in all places---*even* in a classroom!<br/>\n  -------------------------------------------<br/>\n<br/>\nWhen reading your stage III description, I found myself thinking that in some ways, classes happen because they&#39;re one of the more expedient ways to gain information in a school-driven culture. I think that many of us would be just as happy (maybe happier!) to learn bee-keeping from a neighbor who&#39;s been doing it for years. But we&#39;re not always lucky enough for a situation like this to present itself, so we seek out the next best solution--a class on bee-keeping. Mentoring relationships and informal groups, in my opinion, are far more valuable than classroom instruction. It&#39;s just that they aren&#39;t always options, whereas you can find a class on just about anything. Sometimes, a person can read as much about a subject as they can get their hands on--from books to the internet--but no amount of reading will provide the same insight as just talking to someone else with actual experience in the subject. I think that&#39;s why we seek out classes, not because there&#39;s value in taking and passing a class to achieve some kind of credential. Does that make sense? So it&#39;s a shift in purpose and perspective that unschoolers undergo before they return to &quot;class.&quot; <br/>\n<br/>\nGoing back to an earlier discussion on courses...<br/>\n<br/>\nI, too, enjoyed the intellectual exchange that happened in my grad classes. But I enjoyed it in much the same way as I enjoy this list: I liked debating and thinking with other people interested in the same issues. I didn&#39;t *like* the trappings of formal classes. Some of the best discussions and learning I had were the informal ones, after classes at a local bar or coffee shop, informal discussion circles where professors and grad students were on an equal playing field--just a group of people of various ages and backgrounds having an honest, intellectual exchange about a shared interest. These were the best times, in my opinion. <br/>\n<br/>\nSo, I guess I&#39;m just pointing out that classes happen, but only because they&#39;re sometimes a necessary evil *g*. (Maybe one that it&#39;s worth thinking more about how to bypass?) Unschoolers would probably gain the same information, interaction and experience in a more unschooly way through mentoring and informal groups than they do from classes. It&#39;s just that sometimes the choice isn&#39;t there, you know?<br/>\n<br/>\n--danielle<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Learning to see differently/ Stages of Unschooling","postDate":"1077464588","msgId":91288,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJiLjUxODljN2E1LjJkNmEyODBjQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":91291,"prevInTime":91287,"nextInTime":91289,"topicId":91288,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/20/2004 9:22:08 PM Eastern Standard Time, SandraDodd@aol.com writes: If anyone who understands what I m saying can think of another way to","messageBody":"<div id=\"ygrps-yiv-1484954327\">In a message dated 2/20/2004 9:22:08 PM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> writes:<br/>\nIf anyone who understands what I&#39;m saying can think of another way to say it, <br/>\nhelp would be great.  If anyone doesn&#39;t understand what I&#39;m saying, I <br/>\nrecommend a full break-away from attachment to academics.   &lt;&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n<br/>\nI wrote this a few weeks ago about this very thing:<br/>\n<br/>\n<br/>\nThe Three Stages of Unschooling<br/>\n<br/>\n<br/>\n <br/>\nMy son Cameron (16) and I recently started sitting in on a college Sociology <br/>\nclass. He asked for and received electric guitar lessons for his birthday. <br/>\nMondays he goes to a nearby school and takes African drumming lessons. He&#39;s <br/>\ntaking a weekly film class starting in March, and we&#39;ll be sending him to a <br/>\nweeklong film school in Maine in May. Duncan (almost 8) just started karate lessons. <br/>\nBen (my husband) has just finished a class (with tests and all) that&#39;s <br/>\nrequired before he can put on Lt Col (Air National Guard) and is now in NJ for three <br/>\nweeks of &quot;rah-rah&quot; and classroom training and tests for the two new drugs he <br/>\nwill be selling. I&#39;m going to a one-day intensive &quot;Bee School&quot; to learn to take <br/>\ncare of my Christmas present: two beehives.<br/>\n<br/>\n<br/>\n <br/>\nCameron said the other day, &quot;For Unschoolers, we sure are taking a lot of <br/>\nschooly classes!&quot;<br/>\n<br/>\n<br/>\n <br/>\nThat got me thinking...especially since we are one of those families that <br/>\ndiscovered unschooling after years and years of schooling.<br/>\n<br/>\n<br/>\n <br/>\nI think that there are three &quot;Stages of Unschooling&quot;.<br/>\n<br/>\n<br/>\n <br/>\nStage I<br/>\n<br/>\n<br/>\n <br/>\nThe first stage is the longest and most difficult and involves getting rid of <br/>\nall school-think, which includes classes and &quot;instruction&quot; and school-speak. <br/>\nWe have to rid ourselves of the reliance on schools and teachers and testing <br/>\nand book-worship. We need to look deeply into the difference between &quot;teach&quot; <br/>\nand &quot;learn&quot;. We ban classes and structure and nagging. It&#39;s accepting that <br/>\ngrades and requirements and diplomas and curricula and extrinsic motivations truly <br/>\nhave no meaning in an unschooling life. It&#39;s realizing that the whole world is <br/>\nrelated and inter-related: it&#39;s about NOT dividing the world into subjects: <br/>\nmath is science is art is history is literature is FUN! It&#39;s a time for <br/>\nreflection on how we&#39;ve learned the things that really matter in our adult lives. <br/>\nIt&#39;s hard to let go of all that school-think, to go beyond what we&#39;ve been <br/>\n*taught* was important and to value ALL learning as important.<br/>\n<br/>\n<br/>\n <br/>\nIt&#39;s realizing that we learn what WE believe is important WHEN we are ready. <br/>\nAnd it&#39;s realizing that what&#39;s important often changes. It&#39;s about abolishing <br/>\ncoercion in learning and about the freedom to change passions. It&#39;s <br/>\nunderstanding that learning doesn&#39;t stop.<br/>\n<br/>\n<br/>\n <br/>\nFace it, almost all of you reading this in 2004 went to school---at least for <br/>\n12 years, maybe as many as 22 or 25 years! School is so ingrained in us, that <br/>\nit&#39;s hard to think any other way. We appreciate &quot;straight A students&quot; and <br/>\n&quot;AP&quot; classes and college prep high schools and term papers and &quot;higher math&quot; and <br/>\nhigh SAT/ACT scores. &quot;Good&quot; students are given preferential treatment by <br/>\neveryone: pizzas for reading and Chuck E. Cheese tokens for good report cards. Even <br/>\nour child&#39;s car insurance is lowered if we have an &quot;A student&quot;!<br/>\n<br/>\n<br/>\n <br/>\nStage one is about ridding our minds of those things, about really thinking <br/>\nabout learning in a holistic manner. It&#39;s about examining how we learned what <br/>\ntruly interests us---especially those things that didn&#39;t require a &quot;teacher&quot;. <br/>\nWhat are your passions? HOW did you learn to do those things? In a classroom?<br/>\n<br/>\n<br/>\n<br/>\n <br/>\nTwo of my passions as a child were dogs and horses. Dogs and horses are NOT <br/>\ntaught in any grade, middle, or high school *I* know of. But I wanted to learn <br/>\neverything I could about them. My parents gave me dogs and horses. They bought <br/>\nme books and paid for me to take riding lessons and dog obedience classes. <br/>\nThey paid for dog and horse shows and equipment. My passion threw me into <br/>\nreading every book I could find (there were no videos back then----or &quot;Animal <br/>\nPlanet&quot;!). By twelve I could identify every breed of dog and horse that I had ever <br/>\nseen or read about and tell you how it was developed, where, why, and by whom. <br/>\nI spent every weekend and every afternoon at a dog show/horse show/event/trial <br/>\nor just hanging around the stable or kennel. I asked thousands of questions <br/>\nand &quot;got my hands dirty&quot;. Many of my friends were adults with the same <br/>\npassions. Training, breeding, grooming, showing, husbandry----all of these things I <br/>\nlearned because I was consumed by them!<br/>\n<br/>\n<br/>\n <br/>\nBut, of course, dogs and horses are NOT school subjects---and are completely <br/>\nunimportant in the school world. What if I had waited for a teacher to come <br/>\nalong and say, &quot;Today we are learning all about dog and horses&quot;? Not only would <br/>\nI have waited all my life, the teacher would only have given me a &quot;taste&quot; of <br/>\nthe subject!<br/>\n<br/>\n<br/>\n <br/>\nOH! And you *can&#39;t* make a living with dogs and horses---right? &lt;g&gt;<br/>\n<br/>\n<br/>\n <br/>\nStage one is often referred to as DEschooling. It&#39;s the period of time we <br/>\nneed to give ourselves in order to &quot;step away from the box&quot; of school and <br/>\nschool-think. Ask yourself why and how you learned your passion: whether it was <br/>\nmusic, cooking, flying, gardening, or long-distance running. Or even more <br/>\n&quot;academic-like&quot; passions, like Shakespeare, chemistry, World War II, or a foreign <br/>\nlanguage. When you are comfortable with how learning happens by indulging in <br/>\npassions and making connections in your learning, you are quickly heading towards <br/>\nstage two.<br/>\n<br/>\n<br/>\n <br/>\nStage II<br/>\n<br/>\n<br/>\n <br/>\nOnce you are comfortable with the idea of immersion learning----and you&#39;re <br/>\nover wanting or needing classes and structure, you&#39;re finally over the <br/>\ndeschooling hump and are actively in the process of UNschooling.<br/>\n<br/>\n<br/>\n <br/>\nStage two involves really immersing ourselves----and allowing our children to <br/>\nimmerse themselves---into passions and even into slight, fleeting interests. <br/>\nSeeing connections and making connections and yet realizing that some things <br/>\n*might* not connect for YEARS is the most important part of stage two.<br/>\n<br/>\n<br/>\n <br/>\nConnection: I remember lying in my bed when I was about 11 or 12. My bed was <br/>\nbehind the door, so that, when open, the door obscured the head of my bed. I <br/>\nhad tied a string to my doorknob. I would try to shut my door with my finger at <br/>\nthe point of the doorjamb; then I would open the door back up with a pull on <br/>\nthe string. It took *a lot* of pressure (and pain!) to close my door at the <br/>\npoint of the jamb. But every inch closer to the door knob I got, it would be <br/>\neasier and easier to close, so that by the time I was right at the edge of the <br/>\ndoor (by the knob), I could almost &quot;blow&quot; it shut. I had &quot;discovered&quot; <br/>\ntorque----but it had no name!<br/>\n<br/>\n<br/>\n <br/>\nSchool&#39;s idea that children should be given the definition of torque and then <br/>\nhave it explained is backwards. It was so simple for me to understand the <br/>\ndefinition of torque because I already had made the personal and meaningful <br/>\nconnection with my bedroom door.<br/>\n<br/>\n<br/>\n <br/>\nPassion: There are people who invest their time (and many even make a living) <br/>\nstudying Elizabethan fashion or reading/writing about the works of John <br/>\nSteinbeck or determining whether an 17th century chair is a forgery or watching <br/>\nbirds make nests/feed their young or , as I heard on the radio yesterday: there&#39;s <br/>\nthis guy who&#39;s getting his Masters degree in Soil Science! Go figure!<br/>\n<br/>\n<br/>\n <br/>\nIf allowed (and often, even if not allowed!), a child will pursue his career <br/>\nby following his passion(s). A wise parent will encourage this pursuit of <br/>\npassion, because it may be what the child decides to devote his life&#39;s work to. <br/>\nMaybe *more* importantly, that wise parent will step aside when a passion <br/>\nbecomes &quot;old&quot; because the parent will know that *some* connection has been made with <br/>\nthis fleeting passion.<br/>\n<br/>\n<br/>\n<br/>\n <br/>\nFrom 10-12 years old, Cameron was a magician. I actually thought that he <br/>\nwould become the next Lance Burton or Jeff McBride (who once referred to Cameron <br/>\nas &quot;mini-me&quot;!). He was so passionate about magic, he would practice and perform <br/>\nALL day! Insert here: &quot;If I let him, Cameron would sit around and do magic <br/>\nALL DAY!&quot; Well, he DID! Until the day when he quit. I was stunned! He&#39;d lost all <br/>\ninterest. We&#39;d put thousands of dollars into costumes and tricks and gimmicks <br/>\nand conventions and tapes and books and private sessions with famous <br/>\nmagicians---and he just up and quit.<br/>\n<br/>\n<br/>\n <br/>\nAt first I was incredulous. Then I realized it was just an intense, fleeting <br/>\npassion. We still have a huge box of magic upstairs in the attic. He can come <br/>\nback to it whenever----or not. What&#39;s important is that it inspired him and f<br/>\ned a passion and entertained him (and us and hundreds more). He met some truly <br/>\nfascinating people and made connections that will last a lifetime---because he <br/>\nhad an interest, a passion.<br/>\n<br/>\n<br/>\n <br/>\nStage one, deschooling, is a very uncomfortable time! It&#39;s a period of <br/>\nintense questioning and of challenging yourself to think differently. This is <br/>\ndifficult, but it can be done---as with all learning: when you&#39;re ready to!<br/>\n<br/>\n<br/>\n <br/>\nStage two may be even more uncomfortable, because you&#39;re actually  putting <br/>\nthe ideas into action: you&#39;re allowing the passions to take over and you&#39;re not <br/>\npushing the three &quot;R&#39;s&quot;. You are beginning to trust that the child will learn <br/>\nand you&#39;re respecting his choices. You&#39;re UNschooling! And the more you do it, <br/>\nthe easier it gets!<br/>\n<br/>\n<br/>\n <br/>\nStage three is freedom and joy and trust and respect and desire: Radical <br/>\nUnschooling<br/>\n<br/>\n<br/>\n <br/>\n<br/>\nStage III<br/>\n<br/>\n<br/>\n <br/>\nThe third and final stage is when we can honestly and sincerely look at ALL <br/>\nlearning as equal and not hold one &quot;method&quot; or style or subject or means of <br/>\nobtaining information above another. By stage three, we live and breathe <br/>\nunschooling---it&#39;s such a part of our day-to-day living that we can&#39;t separate it from <br/>\nour lives: it&#39;s not just the &quot;educational&quot; part because *everything* is <br/>\neducational. We can apply unschooling principles to bedtimes and eating and video <br/>\ngaming and TV and &quot;chores&quot;. We know that our children will learn because it&#39;s <br/>\nwhat they were born to do; they&#39;re hard-wired to learn. Learning is how the <br/>\nhuman species survives and progresses and succeeds.<br/>\n<br/>\n<br/>\n <br/>\nThis is the stage when we can effectively and confidently start giving out <br/>\nunschooling information to the uninformed or misinformed because we &quot;get it.&quot; We <br/>\ncan live our lives joyfully because we&#39;re not worried whether Susie will pass <br/>\nher algebra or whether Johnny will be able to get into a good college, <br/>\nbecause they WILL if they want to. We know that they will pursue their <br/>\npassions...well, passionately! And that each day will bring more connections and learning <br/>\nopportunities.<br/>\n<br/>\n<br/>\n <br/>\nThis is the stage when classes and instruction may eke back into our lives, <br/>\nas it recently has in our family&#39;s. We don&#39;t give more weight to the learning <br/>\nthat is happening in Sociology-101 or karate or bee-keeping just because it&#39;s <br/>\nhappening in a classroom situation. A class is just another means of pursuing <br/>\nour passions, making the connections, and receiving the information. Learning <br/>\nhappens all the time in all places---*even* in a classroom!<br/>\n<br/>\n<br/>\n <br/>\nI don&#39;t want to give the impression that acceptance of class/book learning <br/>\nautomatically makes you a Radical Unschooler. Stage III cannot &quot;just happen&quot;: <br/>\nyou&#39;ll have to go through Stages I and II first. For those of us that attended <br/>\nschool, deschooling will always exist at a lower level throughout our lives. <br/>\nThe next generation (our unschooled children) will not have this stage to work <br/>\nthrough: they&#39;ll be able to see all learning as equal and good from the get-go.<br/>\n<br/>\n<br/>\n <br/>\nIt&#39;s a process: getting rid of the school-think and structure, becoming <br/>\ncomfortable and implementing immersion learning, and *then* accepting ALL learning <br/>\nas equally valuable.<br/>\n<br/>\n<br/>\n<br/>\n~Kelly<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":91221,"nextTopicId":91370}}