{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":9654058,"authorName":"kekje_uk","from":"&quot;kekje_uk&quot; &lt;kekje_uk@...&gt;","profile":"kekje_uk","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Food choices","postDate":"1029270182","msgId":8516,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGFqYnByNitmaWdoQGVHcm91cHMuY29tPg=="},"prevInTopic":8449,"nextInTopic":0,"prevInTime":8515,"nextInTime":8517,"topicId":8449,"numMessagesInTopic":0,"msgSnippet":"I just read all the messages about food choice etc. I totally advocate kids being able to regulate their own food intake. Someone mentioned calories though and","messageBody":"<div id=\"ygrps-yiv-1365463174\">I just read all the messages about food choice etc. I totally <br/>\nadvocate kids being able to regulate their own food intake. Someone <br/>\nmentioned calories though and yes to a certain extent kids need <br/>\ncalories but not if its all sugar and saturrated fat. If you eat <br/>\nhealthy food yourself, then your kids are going to enjoy healthy food <br/>\nand want to eat it. Its no good complaining about your kids eating <br/>\nnothingh but junk( and we&#39;ve all done it!!) if we are the ones who <br/>\nbuy the junk in the first place! If you are a family which cooks <br/>\neverything from scratch and the kids get involved in this then they <br/>\nwill learn what they need to make certain things, so when you are <br/>\nshopping they can easily tell you what they would like to buy to make <br/>\nsomething which they want to eat. I dont have a problem with food <br/>\nfads, thats not to say my kids dont have them, but the food they do <br/>\nwant to eat all the time is decent healthy stuff. My youngest ate <br/>\nnothing but peanut butter sandwiches for some periods when he was <br/>\nyounger, but he did drink a lot of juice and also fruit and other <br/>\nhealthy snacks, so i guess it could have been worse. <br/>\nI dont think we should try to impose our own likes and dislikes on <br/>\nkids. If you have agood selection of wholesome food in the house then <br/>\nthey should take what they need and not make themselves hungry.<br/>\nI do believe that breastfeeding on cue, where the baby can have free <br/>\naccess to the breast, is a good start to the child learning that s/he <br/>\nis in control of his/her own eating, and as they start to be old <br/>\nenough for solid food(not those yucky commercial jars!)about 6 months <br/>\nold if you are breastfeeding, then sitting them at the table with you <br/>\nand allowing them to help themselves to your stuff, or put some on <br/>\ntheir own plate, this encourages them to learn that it&#39;s up to them <br/>\nwhat they like and dislike.<br/>\nAll kids, unless the parents are total fascists, will encounter and <br/>\neat junk food, but so what? If they have ahealthy balanced diet and <br/>\nare not just getting sugar jags/lows all day they won&#39;t crave the <br/>\ninstant rush that junk food gives.<br/>\nI just read a brilliant book, called Sugar Blues, by William Dufty. <br/>\nIt opened my eyes i can tell you!<br/>\nWe are vegetarian but i have never forced my kids to be veggies, my <br/>\neldest was not brought up in a veggie home,as my ex husband is a meat <br/>\neater. My youngest has chosen for himself to be veggie. I know veggie <br/>\nparents who think that it would be a bad influence for their kids to <br/>\nbe offered meat. Why? My son has been offered meat, fish etc. He has <br/>\na mouth, he can say no(or he may say yes if he wants, who knows?) Why <br/>\nis it so important for vegetarians to want their kids to be veggies? <br/>\nYes, it is, but its more important that they have their own choices <br/>\nand that they are veggies because they want and choose to be, rather <br/>\nthan because they have to.<br/>\nWell, thats my bit. We just have to do what we can to make sure our <br/>\nkids are healthy. After all you wouldnt let your kids take crack, or <br/>\nsmoke a cigarette, because they dont know the facts. Its the same <br/>\nwith food. Until they are old enough to know about food, we tend to <br/>\ngive them what we think is healthy, then hopefully by the time they <br/>\nare old enough to choose, they will know anyway what is &quot;good&quot; <br/>\nor &quot;bad&quot;. But i did draw the line at sweets(candy to you <br/>\nAmericans/canadians) with all those colourings in, and anyway ny <br/>\nyougest really didnt recognise themas edble!<br/>\nCal</div>","specialLinks":[]},{"userId":74604204,"authorName":"ddzimlew@juno.com","from":"ddzimlew@...","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Food choices","postDate":"1029163707","msgId":8449,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIwODEyLjA4NDgzNy4tMjAwNTY5LjEuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":0,"nextInTopic":8516,"prevInTime":8448,"nextInTime":8450,"topicId":8449,"numMessagesInTopic":0,"msgSnippet":"***How can a child who has never had any choices EVER choose to eat vegetables?*** Yes, and I watched one friend try the -let them eat what they like- ","messageBody":"<div id=\"ygrps-yiv-321560015\">***How can a child who has never had any choices EVER &quot;choose&quot; to eat<br/>\nvegetables?***<br/>\n<br/>\nYes, and I watched one friend try the -let them eat what they like-<br/>\napproach and then claim it didn&#39;t work because all they ate was junk. <br/>\nShe bought what they asked for at the store, but nothing else that they<br/>\nmight have chosen at home instead of the &quot;junk&quot;.   So when all there was<br/>\nto snack on, chips and cookies, etc, was really all there was, no<br/>\ncherries, no melon, no carrots etc.  they did just eat the &quot;junk&quot; but<br/>\nthat wasn&#39;t choice.   That was just hunger and availability.  <br/>\nSo she proudly says she tried it, but &quot;it just doesn&#39;t work with MY<br/>\nkids&quot;.... *sigh*.<br/>\n<br/>\nDeb L</div>","specialLinks":[]}],"prevTopicId":8512,"nextTopicId":8522}}