{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] blind spot","postDate":"1298830845","msgId":60087,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRENkE5NUZELjgwMTA4MDZAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PDlFOTY2NDAxMUYyOTRDQzBBNTM1MERGRTgyREY2RDQ1QE11bWFuZERhZFBDPg==","referencesHeader":"PDlFOTY2NDAxMUYyOTRDQzBBNTM1MERGRTgyREY2RDQ1QE11bWFuZERhZFBDPg=="},"prevInTopic":60079,"nextInTopic":0,"prevInTime":60086,"nextInTime":60088,"topicId":60076,"numMessagesInTopic":0,"msgSnippet":"... I d try to get as much time as possible with them each separately and give them as much time and space from each other as you possibly can. That allows","messageBody":"<div id=\"ygrps-yiv-2026693659\">On 2/27/2011 1:27 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:wimvisser@...\">wimvisser@...</a> wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; so I am trying to model being sweet and kind but I am so dismayed <br/>\n&gt; everytime they are cruel to each other and don&#39;t know what to do in <br/>\n&gt; that moment...and it feels like it just keeps escalating.<br/>\n&gt;<br/>\n&gt; what is it I am missing?<br/>\n<br/>\n </span></blockquote>I&#39;d try to get as much time as possible with them each separately and <br/>\ngive them as much time and space from each other as you possibly can. <br/>\nThat allows them to come back together with a new attitude - that&#39;s a <br/>\nlot easier than changing attitudes in midstream. Many breaks - much time <br/>\napart - gives many possible chances to come together more harmoniously.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: blind spot","postDate":"1298811495","msgId":60079,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlrZGhwNytjZ2VuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDlFOTY2NDAxMUYyOTRDQzBBNTM1MERGRTgyREY2RDQ1QE11bWFuZERhZFBDPg=="},"prevInTopic":60077,"nextInTopic":60087,"prevInTime":60078,"nextInTime":60080,"topicId":60076,"numMessagesInTopic":0,"msgSnippet":"... **************** It will take a while for that to sink in - like water going down to the roots of a tree. So at the same time, be sure you re spending","messageBody":"<div id=\"ygrps-yiv-88311784\">&lt;wimvisser@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; my first step has been to try and speak respectfully, and listen to what they are trying to communicate, and stop all the bad behaiour that I have let creep back into my parenting.<br/>\n </span></blockquote>****************<br/>\n<br/>\nIt will take a while for that to &quot;sink in&quot; - like water going down to the roots of a tree. So at the same time, be sure you&#39;re spending more time with them, enjoying their company and loving them up. If you&#39;ve had some rough times, that&#39;s left them stressed out and wanting some loving - some mothering! Be present so you can deflect things more gently, earlier, and offer affection to whomever is feeling unhappy or put upon in the moment. <br/>\n<br/>\nIt could help to shift gears, too - get out of the house more, if you&#39;ve been home a lot, for instance. Bickering can be a big big sign of boredom so look for ways to liven up their days. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] blind spot","postDate":"1298807081","msgId":60077,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY4NTczQUY0LTAxNUItNDVGNy05RTFGLUIxODkzM0VENDVCMEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDlFOTY2NDAxMUYyOTRDQzBBNTM1MERGRTgyREY2RDQ1QE11bWFuZERhZFBDPg==","referencesHeader":"PDlFOTY2NDAxMUYyOTRDQzBBNTM1MERGRTgyREY2RDQ1QE11bWFuZERhZFBDPg=="},"prevInTopic":60076,"nextInTopic":60079,"prevInTime":60076,"nextInTime":60078,"topicId":60076,"numMessagesInTopic":0,"msgSnippet":"On Feb 27, 2011, at 4:27 AM,  ","messageBody":"<div id=\"ygrps-yiv-298481059\">On Feb 27, 2011, at 4:27 AM, &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:wimvisser@...\">wimvisser@...</a>&gt; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:wimvisser@...\">wimvisser@...</a> <br/>\n<blockquote><span title=\"ireply\">  &gt; wrote:<br/>\n<br/>\n&gt; But I don&#39;t actually know what to do as they have never been this  <br/>\n&gt; full on before. It feels like constant meaness, disrespect and  <br/>\n&gt; general irritating behaviour and so someone is always feeling hurt  <br/>\n&gt; and whilst I know what caused it I don&#39;t know what to do in each  <br/>\n&gt; moment<br/>\n<br/>\n </span></blockquote>My guess is that it&#39;s not so much your behavior as the emotion you&#39;ve  <br/>\nadded to the atmosphere. It might help to see their behavior as the  <br/>\nbarometer to the home&#39;s atmosphere. Though there may be some delay  <br/>\nsince they&#39;ll store up what&#39;s in the atmosphere. Good will carry them  <br/>\nthrough a bump of not so good. And bad will carry over for a while  <br/>\neven when the atmosphere is good.<br/>\n<br/>\nSo every time you slip back they get reset to feeling off balance.<br/>\n<br/>\nIt&#39;s very very common when one part of life feels out of control for  <br/>\nsomeone to try to control some other part of their life, like the kids  <br/>\nor a spouse. (It&#39;s healthier for relationships to find something that  <br/>\ndoesn&#39;t mind being controlled! Like a garden. Or bread. Or closets ;-)<br/>\n<br/>\nSo rather than trying to control them and fix their behavior, try  <br/>\nfixing the atmosphere. Be more present so you can redirect energy  <br/>\nthat&#39;s taken a tense turn. Call one child away to do something  <br/>\nmeaningful with you. Bring in a platter of snacks. Go out for ice  <br/>\ncream. Do something more physical.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; when someone is dying and the kids are fighting about a remote it  <br/>\n&gt; feels just so insignificant to me and makes me angry.<br/>\n<br/>\n<br/>\n </span></blockquote>That&#39;s a very understandable reaction!<br/>\n<br/>\nAnd theirs is too. Their reaction to feeling the stress and tension in  <br/>\nyou won&#39;t necessarily be rational! The last straw needn&#39;t be worse  <br/>\nthan all the others that came before it. The reaction is to all the  <br/>\nothers plus the latest one.<br/>\n<br/>\nWhat else besides directing your release valve at them can you do when  <br/>\nyou feel their barometers reacting to the pressure in you?<br/>\n<br/>\nBeing sweet and kind won&#39;t release the tension. Picture someone  <br/>\ngetting all wound up. Which gets you all wound up. And they switch to  <br/>\nsweet and kind. It would feel sort of like &quot;Well, got that out. What  <br/>\nare you all worked up for?&quot;<br/>\n<br/>\nCalm and understanding might be a better goal to turn toward. Altering  <br/>\nthe mix of what&#39;s going on and redirecting.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":382364493,"authorName":"wimvisser@clear.net.nz","from":"&lt;wimvisser@...&gt;","profile":"rewiringma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"blind spot","postDate":"1298798823","msgId":60076,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlFOTY2NDAxMUYyOTRDQzBBNTM1MERGRTgyREY2RDQ1QE11bWFuZERhZFBDPg=="},"prevInTopic":0,"nextInTopic":60077,"prevInTime":60075,"nextInTime":60077,"topicId":60076,"numMessagesInTopic":0,"msgSnippet":"Hi all, I was hoping you could help me see some of my blind spots. Our lives have transformed  over the years since I joined this group.  I understood from a","messageBody":"<div id=\"ygrps-yiv-1174433360\">Hi all,<br/>\nI was hoping you could help me see some of my blind spots.<br/>\nOur lives have transformed  over the years since I joined this group.  I understood from a logical point of view everything I read here but it has taken a lot of reading, watching and practice to get to where we are and I have a long way to go. I am a logical, analytical type of person, feelings can often seem a bit foriegn to me...however I am getting much much better with age/practice.<br/>\n<br/>\nThe ability to understand what a child is trying to communicate through their behaviour sometimes is something that doesn&#39;t come naturally to me, I read posts on this list and wonder myself about what I would do in a situation, then the replies come and it seems so obvious to other people what it is the child needs or atleast what it could be, and after I read the replies it seems obvious to me also...but not until it is pointed out.<br/>\n<br/>\nI have felt pleased with my progress over the last few years and it was showing in our family, I had let go of a lot of my need to control and our family felt joyful.<br/>\nAgain though, this didn&#39;t come naturally, I have had to push down my knee-jerk reaction to control a situation and have my way every time and whilst it has gotten easier and easier over the years I still have to keep check on myself.<br/>\n<br/>\nMy children know it is a process for me, I apologise when I don&#39;t get it right, quickly and genuinely and as a result, whilst they have not had the full benefit of true mindful parenting they trust me more than I would have expected so far and given me room and love when I don&#39;t get it right.<br/>\n<br/>\nOver the past few months I have had a lot going on, big things, stressful things, and I have been a lot more like the old me, barking orders, demanding things are done now, my way, and when the kids have misbehaved as a result I have been saying things that are designed to make them feel bad and guilty about not being supportive and great when I need them to be.<br/>\n<br/>\nI knew what was happening but have struggled to break free of it, I have just been so stressed and when someone is dying and the kids are fighting about a remote it feels just so insignificant to me and makes me angry.<br/>\n<br/>\nI feel like I am coming out of the fog now, even though it is all still very full on, however I have created a behaviour pattern within the family that I am not clear on how to undo.<br/>\n<br/>\nMy boys 10 and 11 are spending a lot of time annoying each other, purposefully doing mean things, not listening to each other and fighting.  They speak to each other in horrible voices, I assume I started this and so my first step has been to try and speak respectfully, and listen to what they are trying to communicate, and stop all the bad behaiour that I have let creep back into my parenting.<br/>\n<br/>\nBut I don&#39;t actually know what to do as they have never been this full on before. It feels like constant meaness, disrespect and general irritating behaviour and so someone is always feeling hurt and whilst I know what caused it I don&#39;t know what to do in each moment....and then I panic or something and start lecturing them on being kind and respectful to each other....and they just start lecturing each other and I know that doesn&#39;t work, so I am trying to model being sweet and kind but I am so dismayed everytime they are cruel to each other and don&#39;t know what to do in that moment...and it feels like it just keeps escalating.<br/>\n<br/>\nwhat is it I am missing?<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":59754,"nextTopicId":60067}}