{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Special Needs Unschool: Mine or Hers","postDate":"1171126419","msgId":27993,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVDOTJFOUEzLUQ4REItNDJFOS04RUIyLUZFQ0MwOTUxQkEzNUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PFBLRUhKR0NJR05QUEFCRlBCS0xHQUVMRkZHQUIuamFja2lAYm9hcmRwcmVwLm5ldD4=","referencesHeader":"PFBLRUhKR0NJR05QUEFCRlBCS0xHQUVMRkZHQUIuamFja2lAYm9hcmRwcmVwLm5ldD4="},"prevInTopic":27992,"nextInTopic":0,"prevInTime":27992,"nextInTime":27994,"topicId":27980,"numMessagesInTopic":0,"msgSnippet":"-=-I also wanted to suggest that it doesn t necessarily have to be hard to shift from stressed to joy. They really are just two feelings, and it is possible to","messageBody":"<div id=\"ygrps-yiv-1138587752\">-=-I also wanted to suggest that it doesn&#39;t necessarily have to be  <br/>\nhard to<br/>\nshift from stressed to joy. They really are just two feelings, and it is<br/>\npossible to choose. If you can come up with some ways to know that  <br/>\nyou need<br/>\nto shift in a moment...it only needs to take a moment to go from  <br/>\nirritated<br/>\nto joy. Maybe you recognize a tone of voice you use...when you hear it,<br/>\nquick, stop! Take a deep breath in and blow out the irritation. Take  <br/>\nanother<br/>\nbreath in and make it full of joy. Sometimes I shake my body and jump  <br/>\naround<br/>\nfor a minute...shaking off the negativity. The goal is joy in every  <br/>\nmoment.<br/>\nAnd while I&#39;m certainly not there every moment, I do know that I can  <br/>\nchoose<br/>\nit in every single moment.-=-<br/>\n<br/>\nSterling.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":116488337,"authorName":"Gold Standard","from":"&quot;Gold Standard&quot; &lt;jacki@...&gt;","profile":"jackiknouse","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [AlwaysLearning] Re: Special Needs Unschool: Mine or Hers","postDate":"1171125103","msgId":27992,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFBLRUhKR0NJR05QUEFCRlBCS0xHQUVMRkZHQUIuamFja2lAYm9hcmRwcmVwLm5ldD4=","inReplyToHeader":"PDQ4N0MyM0ZGLTE4RUYtNDM0Ny04MDg3LTQ2RjBBNUVEMjc4RkBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":27988,"nextInTopic":27993,"prevInTime":27991,"nextInTime":27993,"topicId":27980,"numMessagesInTopic":0,"msgSnippet":"... Even though I agree with Sandra that you will be best served with all of these questions by spending lots of time reading through the links, they really do","messageBody":"<div id=\"ygrps-yiv-2033553344\"><blockquote><span title=\"ireply\">&gt;&gt;She has convinced us she will care for them.&lt;&lt;<br/>\n<br/>\n </span></blockquote>Even though I agree with Sandra that you will be best served with all of<br/>\nthese questions by spending lots of time reading through the links, they<br/>\nreally do have the answers you are looking for and people have done an<br/>\nenormous amount of work to put them there, I did want to respond to two<br/>\nthings.<br/>\n<br/>\nBringing animals into the home can be a multi-faceted, fabulous experience<br/>\nfor the whole family. However, it is the parent&#39;s commitment, NOT the<br/>\nchild&#39;s commitment, to make sure the animals are well-cared for, and it&#39;s<br/>\nthe parent&#39;s commitment to do it happily (at least most of the time :o).<br/>\n<br/>\nOur dd wanted a horse. She had been going to horse camp and reading about<br/>\nhorses and watching horse movies for a long time. When we figured out how to<br/>\nafford a horse (which was a pretty darn expensive endeavor for us), dh and I<br/>\ndid a bunch of research with dd around for most of it (and she was<br/>\ninterested in much of it, and when she wasn&#39;t she was usually nearby and<br/>\nstill catching parts of our conversations and enlightenments) and we visited<br/>\nhorses for sale and eventually bought one and boarded it down the street<br/>\nfrom our house. Dd, dh and I went there every morning at 6:30 for feeding,<br/>\nwatering, grooming and stall-cleaning. She took riding lessons three times a<br/>\nweek. We were there many times outside of those times each week. We all<br/>\nlearned to ride and had so much fun, and put out a whole lot of work! It was<br/>\na GREAT experience for us...the three of us had real special times at the<br/>\nstables.<br/>\n<br/>\nAnd then she lost interest. Dh and I went to do the work when she didn&#39;t<br/>\nwant to, or when she wanted to sleep in. This happened more and more, and at<br/>\nthe same time our financial situation changed and the costs were getting<br/>\nharder to handle. Wonderfully for us, the boarding facility owner saw what<br/>\nwas happening. She offered to buy Sugar. We talked to dd about this, and she<br/>\nwas glad that our loving neighbor wanted to continue to care for Sugar, and<br/>\nthat she would be right down the street still. So we sold her.<br/>\n<br/>\nThis adventure was not one that I chose, and frankly, I did have to work up<br/>\nthe joy to do it. But when I did, *I* was blessed at the time we had<br/>\ntogether.<br/>\n<br/>\nIt would have been easy to get mad at dd&#39;s change in direction. It would<br/>\nhave been easy to make her feel bad about it...about stopping the horse<br/>\ncare, about her losing her interest after we had put a lot of work and money<br/>\nand love into Sugar.<br/>\n<br/>\nBut why would we do that? She was learning about something she was<br/>\ninterested in, and now she knows exactly what horse ownership means, and<br/>\nwhat it takes. That is some mighty hefty learning! Something she would<br/>\nnever, no mater how many books she read or how many classes she took, have<br/>\ntruly learned otherwise. And we continue to have fond memories (the neighbor<br/>\nand Sugar have since moved) and reflections of that time.<br/>\n<br/>\nA rabbit is a much less expensive and work-related animal (we&#39;ve had a few),<br/>\nso if you get a rabbit...go for it! Research it, find out what it takes to<br/>\nown a bunny (she may lose interest during the research...that&#39;s happened to<br/>\nus many times). Know that you will be showing how to love and happily care<br/>\nfor an animal. She will definitely pick up on that. We have two dogs and<br/>\nfour cats, and have had so many different kinds of animals over the years<br/>\nthat I can&#39;t even count...my kids are great with animals and I do think that<br/>\npart of that was seeing their parents be happy with them.<br/>\n<br/>\nAnd one more thing...<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;(It is, of course, easy to say &quot;Do it joyfully&quot;! It takes a lot of<br/>\n&gt;&gt;work and mental shifting of gears to work into that mind set.&lt;&lt;<br/>\n<br/>\n </span></blockquote>I also wanted to suggest that it doesn&#39;t necessarily have to be hard to<br/>\nshift from stressed to joy. They really are just two feelings, and it is<br/>\npossible to choose. If you can come up with some ways to know that you need<br/>\nto shift in a moment...it only needs to take a moment to go from irritated<br/>\nto joy. Maybe you recognize a tone of voice you use...when you hear it,<br/>\nquick, stop! Take a deep breath in and blow out the irritation. Take another<br/>\nbreath in and make it full of joy. Sometimes I shake my body and jump around<br/>\nfor a minute...shaking off the negativity. The goal is joy in every moment.<br/>\nAnd while I&#39;m certainly not there every moment, I do know that I can choose<br/>\nit in every single moment.<br/>\n<br/>\nJacki</div>","specialLinks":[]},{"userId":2523747,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Special Needs Unschool: Mine or Hers","postDate":"1171113099","msgId":27988,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ4N0MyM0ZGLTE4RUYtNDM0Ny04MDg3LTQ2RjBBNUVEMjc4RkBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PCEmIUFBQUFBQUFBQUFBWUFBQUFBQUFBQUZCVllXUUtPZlJKbXdxRmdkM2xaaGJDZ0FBQUVBQUFBSmhaOW9rSGtGRkNsTFdFNkYwb0VxRUJBQUFBQUE9PUBzb2NhbC5yci5jb20+","referencesHeader":"PCEmIUFBQUFBQUFBQUFBWUFBQUFBQUFBQUZCVllXUUtPZlJKbXdxRmdkM2xaaGJDZ0FBQUVBQUFBSmhaOW9rSGtGRkNsTFdFNkYwb0VxRUJBQUFBQUE9PUBzb2NhbC5yci5jb20+"},"prevInTopic":27986,"nextInTopic":27992,"prevInTime":27987,"nextInTime":27989,"topicId":27980,"numMessagesInTopic":0,"msgSnippet":"... You shouldn t expect her to. It will set her up to fail and it will be a tension that will seep into the atmosphere of your home. You will look at your","messageBody":"<div id=\"ygrps-yiv-501541456\">On Feb 10, 2007, at 2:18 AM, Deborah Greenspan wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; She has convinced us she will care for them.<br/>\n<br/>\n </span></blockquote>You shouldn&#39;t expect her to. It will set her up to fail and it will  <br/>\nbe a tension that will seep into the atmosphere of your home. You  <br/>\nwill look at your daughter as less than perfect. She will feel less  <br/>\nthan perfect. The tension will seep into her appreciation of the  <br/>\nrabbits and she&#39;ll feel even less like taking care of them.<br/>\n<br/>\nParents should expect to take care of animals. Parents should do it  <br/>\njoyfully. It will model setting aside our own needs to care for  <br/>\nsomeone else who is dependent on us. And by doing it joyfully, when  <br/>\nyou invite her along to do it with you, she&#39;ll not only be more  <br/>\nwilling, she&#39;ll have pleasant associations with caring for her animals.<br/>\n<br/>\n(It is, of course, easy to say &quot;Do it joyfully&quot;! It takes a lot of  <br/>\nwork and mental shifting of gears to work into that mind set. And  <br/>\nit&#39;s easy to slip out of it, and grumble and resent it. That&#39;s an  <br/>\nindication of not filling yourself up enough and feeling like the  <br/>\nthings you (and others) do for you are in short supply and you need  <br/>\nto take from others joy to fill your own joy. It&#39;s hard work to find  <br/>\nways to get off of that path and ways to avoid stepping back on it  <br/>\nbut it&#39;s well worth it. And people here can help with things that  <br/>\nhave worked for them.)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; do unschooler parents request a book report or research<br/>\n<br/>\n </span></blockquote>If you wanted a new mixer, how would you feel if your husband told  <br/>\nyou to research it and write up a report for him?<br/>\n<br/>\nYes, do, research! But do it because it&#39;s a good idea. Just as you  <br/>\nmight sit down with an issue of Consumer Reports to look over their  <br/>\narticle on mixers, do some research yourself and do it in a way that  <br/>\nyour daughter would enjoy doing it with you. Get adult books and  <br/>\nchild level books and look through them together. Share what you&#39;re  <br/>\nlearning. Don&#39;t turn it into something that&#39;s good for her to do.  <br/>\nShe&#39;ll feel that. Do it because it&#39;s honestly a good idea for *you*  <br/>\nto know more about an animal *you&#39;re* going to be responsible for.<br/>\n<br/>\n(I&#39;ll even hand you a bit of research: My daughter and I volunteer at  <br/>\na shelter and we&#39;ve seen maybe a dozen rabbits come through there. (I  <br/>\nhonestly don&#39;t see the point of rabbits but that&#39;s beside the  <br/>\npoint ;-) Some of them are very very messy and will poop and pee  <br/>\nwherever they happen to be: food, bedding, etc. Some of them are  <br/>\nquite clean and confine it *mostly* to their litter box. We&#39;ve had  <br/>\nrabbits come in from the same home that were night and day in  <br/>\ncleanliness so part may be training but part may be personality. (And  <br/>\npart is just the nature of rabbits. They, um, recycle their waste to  <br/>\nhave another go at extracting the nutrients ;-) Personally I&#39;d get a  <br/>\nshelter animal so you can see its habits and personality but I know  <br/>\nthat would be hard to do with a child who wants one right now. I  <br/>\nthink a reputable breeder is the next best source rather than pet  <br/>\nstores or newspapers. They would be a good source for information too.)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  just don&#39;t<br/>\n&gt; understand how the unschooler thing works when it&#39;s time to get a  <br/>\n&gt; college<br/>\n&gt; degree or a job.<br/>\n<br/>\n </span></blockquote>Say you had a gardening business and you had an opening for an  <br/>\napprentice job. Would you feel better about hiring a kid who aces  <br/>\nmath and spelling and history tests or a kid who has been playing  <br/>\nwith and messing about with and reading about and exploring plants  <br/>\nsince she was old enough to dig in the dirt?<br/>\n<br/>\nUnschooling is like looking back on your life and seeing all the  <br/>\nthings you enjoyed doing in the past that lead you to where you are  <br/>\nand then cutting out all the stuff that was done &quot;just because&quot; that  <br/>\nled no where.<br/>\n<br/>\nBecause learning in school (and through schoolish ways) is so hard,  <br/>\nwe fear that learning what we need is hard. But it isn&#39;t.<br/>\n<br/>\nBecause learning in school is often boring, we fear that kids will  <br/>\navoid great huge chunks of stuff they need to know because it&#39;s  <br/>\nboring (and therefore hard to learn). But it isn&#39;t. All of life is  <br/>\npotentially fascinating until it gets tainted by being put in  <br/>\ntextbooks and being made to learn it. (Not everyone will be  <br/>\ninterested in everything. But everyone will want to know more about  <br/>\nwhat connects to and helps them explore their interests.)<br/>\n<br/>\nUnschooling is how your daughter learned to speak. Think about that  <br/>\nfor a bit. We take the amazing process of learning to speak our  <br/>\nnative language for granted because all kids do it effortlessly. But  <br/>\nit&#39;s truly astounding. Kids start with *nothing*. They have no  <br/>\nconcept of language but they pull themselves up by their bootstraps  <br/>\nand acquire proficiency in just a few short years. And they do it  <br/>\nwithout even trying! They aren&#39;t actively trying to learn how to  <br/>\nspeak. They&#39;re living life, using language as a tool to get what they  <br/>\nwant, and they get better at speaking *as a side effect* of living life.<br/>\n<br/>\nAstounding.<br/>\n<br/>\nBut think about how hard it is when learning a language is turned  <br/>\ninto a school process, like Spanish or French: taken out of context,  <br/>\nput in textbooks, led through unwillingly step by incremental step.  <br/>\nHow much of the foreign language you took in school do you remember?  <br/>\nIs it because you didn&#39;t apply yourself? (It&#39;s the message most of us  <br/>\nheard.) Or is it because the process is alien to the way we naturally  <br/>\nlearn that it&#39;s nearly impossible to *make* someone learn that way?<br/>\n<br/>\nYes, some kids *do* learn through school. It&#39;s because 1) they are  <br/>\nalready interested in the subject and 2) learning through reading  <br/>\nmatches their learning style. I was good in math in school, not  <br/>\nbecause I was a good student who applied herself but because I liked  <br/>\npuzzles. It was just inherent in my nature. I was really bad in  <br/>\nhistory in school because it was a lot of boring people doing boring  <br/>\nthings. Odd thing, though, I liked history. I like historical movies  <br/>\nand novels. But school tainted history for me for a long time.<br/>\n<br/>\nIf someone had judged what I would do if I were unschooling by what I  <br/>\ndid in school, they&#39;d be certain I&#39;d never do history on my own. The  <br/>\nobvious conclusion is that I needed to be made to study history. But  <br/>\nthat would be wrong. It isn&#39;t accurate to judge kids by the behavior  <br/>\nof schooled kids. School hugely mucks up kids&#39; natural behavior.  <br/>\nSchooled kids *don&#39;t* behave like kids.<br/>\n<br/>\nWhat I needed was the freedom to explore the fun parts of history and  <br/>\nin the process -- *as a side effect* -- I would have picked up a  <br/>\nwhole lot more about the big picture they tried to ram down our  <br/>\nthroats in school. *And* I would remember it. *And* I wouldn&#39;t have  <br/>\nthe taint of being force fed it attached to it (that makes it a  <br/>\nrelief to forget the facts.)<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Special Needs Unschool: Mine or Hers","postDate":"1171108329","msgId":27986,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBBMDRCNTk2LTExMDgtNEE3OC05OUVFLTc3QkRBMDNEQkQ3MUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PCEmIUFBQUFBQUFBQUFBWUFBQUFBQUFBQUZCVllXUUtPZlJKbXdxRmdkM2xaaGJDZ0FBQUVBQUFBSmhaOW9rSGtGRkNsTFdFNkYwb0VxRUJBQUFBQUE9PUBzb2NhbC5yci5jb20+","referencesHeader":"PCEmIUFBQUFBQUFBQUFBWUFBQUFBQUFBQUZCVllXUUtPZlJKbXdxRmdkM2xaaGJDZ0FBQUVBQUFBSmhaOW9rSGtGRkNsTFdFNkYwb0VxRUJBQUFBQUE9PUBzb2NhbC5yci5jb20+"},"prevInTopic":27980,"nextInTopic":27988,"prevInTime":27985,"nextInTime":27987,"topicId":27980,"numMessagesInTopic":0,"msgSnippet":"-=-I just don t understand how the unschooler thing works when it s time to get a college degree or a job. Please enlighten me.-=- It involves learning","messageBody":"<div id=\"ygrps-yiv-16592170\">-=-I just don&#39;t<br/>\nunderstand how the unschooler thing works when it&#39;s time to get a  <br/>\ncollege<br/>\ndegree or a job. Please enlighten me.-=-<br/>\n<br/>\nIt involves learning gradually and from real-world sources.<br/>\n<br/>\nFor you to learn about it you, too, need to so some of your own  <br/>\nexploring and not ask us everything you think of.<br/>\n<br/>\nYou should read some John Holt before you post much more.  There&#39;s  <br/>\nenough online to give you an idea--poke around here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/johnholt\">http://sandradodd.com/johnholt</a><br/>\n<br/>\nJoyce&#39;s site would probably appeal to you:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com/\">http://joyfullyrejoycing.com/</a><br/>\n<br/>\nThere are stories about teens here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/teen\">http://sandradodd.com/teen</a><br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":145034609,"authorName":"Deborah Greenspan","from":"&quot;Deborah Greenspan&quot; &lt;dgreens1@...&gt;","profile":"dgreens1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"FW: [AlwaysLearning] Re: Special Needs Unschool: Mine or Hers","postDate":"1171091932","msgId":27980,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PCEmIUFBQUFBQUFBQUFBWUFBQUFBQUFBQUZCVllXUUtPZlJKbXdxRmdkM2xaaGJDZ0FBQUVBQUFBSmhaOW9rSGtGRkNsTFdFNkYwb0VxRUJBQUFBQUE9PUBzb2NhbC5yci5jb20+"},"prevInTopic":0,"nextInTopic":27986,"prevInTime":27979,"nextInTime":27981,"topicId":27980,"numMessagesInTopic":0,"msgSnippet":"Wow! This looks interesting. Thanks! We may explore zoos and science museums, I guess. I m in California, but I ll pass along the website to see if anything","messageBody":"<div id=\"ygrps-yiv-1379032928\">Wow! This looks interesting. Thanks!<br/>\n<br/>\n <br/>\n<br/>\nWe may explore zoos and science museums, I guess. I&#39;m in California, but<br/>\nI&#39;ll pass along the website to see if anything sparks.<br/>\n<br/>\n <br/>\n<br/>\nShe&#39;s into rabbits, now. She has convinced us she will care for them. I<br/>\nwonder. do unschooler parents request a book report or research, or is it<br/>\n&quot;just&quot; experience? I fear we are going to be taken over by animals! There is<br/>\na zoo magnet high school, that she might enjoy later. I just don&#39;t<br/>\nunderstand how the unschooler thing works when it&#39;s time to get a college<br/>\ndegree or a job. Please enlighten me.<br/>\n<br/>\n <br/>\n<br/>\nAll the best,<br/>\n<br/>\n <br/>\n<br/>\nDeborah :-)<br/>\n<br/>\n <br/>\n<br/>\n  _____  <br/>\n<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a> [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>]<br/>\nOn Behalf Of plaidpanties666<br/>\nSent: Thursday, February 08, 2007 10:37 AM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nSubject: [AlwaysLearning] Re: Special Needs Unschool: Mine or Hers<br/>\n<br/>\n <br/>\n<br/>\n--- In AlwaysLearning@ &lt;mailto:AlwaysLearning%40yahoogroups.com&gt;<br/>\nyahoogroups.com, &quot;Deborah Greenspan&quot; <br/>\n&lt;dgreens1@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;She likes animals, bugs, and watching<br/>\n&gt; movies. <br/>\n<br/>\n </span></blockquote>Hey, she sounds like fun! Does she like movies *about* bugs? There&#39;s <br/>\na whole glorious genre to explore, from the tacky B-movies to the <br/>\nreally chic artsy films like *Microcosmos* - has she seen that? Its <br/>\nscrumptious! <br/>\n<br/>\nThat may all sound beside the point since the question was:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; How does one unschool a reluctant learner?<br/>\n<br/>\n </span></blockquote>But really, the difference between a &quot;reluctant&quot; learner and an <br/>\nenthusiastic one is that for the latter learning is part of her own <br/>\ninternal process of joyful discovery. There&#39;s nothing joyful about <br/>\nbeing &quot;made&quot; to read or &quot;do math&quot;. <br/>\n<br/>\nWhat would happen if you helped her explore her interests rather <br/>\nthan insisting she ingest something unpalattable to her? Where might <br/>\nshe go, what might she do with animals or bugs or movies or some <br/>\ncombination - or maybe one of those would lead her in a direction <br/>\nneither of you can yet imagine. <br/>\n<br/>\nShe may not be able to articulate what she *wants* to do at this <br/>\npoint, so you may have to offer or strew ideas - but they should be <br/>\nFun ideas, offered for the potential joy, not entomology textbooks <br/>\nor worksheets on animal tracks. Here&#39;s something fun, although you <br/>\nmay be half a world away for all I know, its a neat idea:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.life\">http://www.life</a> &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.life.uiuc.edu/entomology/egsa/ifff.html\">http://www.life.uiuc.edu/entomology/egsa/ifff.html</a>&gt;<br/>\nuiuc.edu/entomology/egsa/ifff.html<br/>\n(Its an Insect Fear Film Festival and there&#39;s a list of all the <br/>\nfilms they&#39;ve shown in the past if she&#39;s interested).<br/>\n<br/>\nThere&#39;s also no need to &quot;tie in&quot; to some strange new curriculum of <br/>\nAnimals-Bugs-and-Film, but the bug thing is really exciting to *me* <br/>\nso I can&#39;t resist. That&#39;s a place to *start*, but don&#39;t discount <br/>\nanything that you think she&#39;d enjoy. <br/>\n<br/>\n---Meredith (Mo 5, Ray 13)<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":27906,"nextTopicId":27975}}