{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":85994576,"authorName":"Kolleen","from":"Kolleen &lt;Kolleen@...&gt;","profile":"kaydeecross","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Pareting II (very long reprint with permission)","postDate":"1012419387","msgId":31813,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIwMTMwMTkzNS5nMFVKWkxFRTAwNDg5NUBueWNzbXRwMm91dC5yZGMtbnljLnJyLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":31812,"nextInTime":31814,"topicId":31813,"numMessagesInTopic":0,"msgSnippet":"Permission to freely copy and distribute this document is given, provided that the text is not modified or abridged and this notice is included. For more","messageBody":"<div id=\"ygrps-yiv-822510037\">Permission to freely copy and distribute this document is given, provided <br/>\nthat the text is not modified or abridged and this notice is included. <br/>\nFor more information about SVS available electronically, check <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.sudval.org\">http://www.sudval.org</a> <br/>\n<br/>\nSudbury Valley is a democratic school run by a School Meeting. Students <br/>\nand staff each get one vote on all matters of substance; including the <br/>\nschool rules and hiring/firing of staff. The school has no grades, tests, <br/>\nor scores. <br/>\n<br/>\n<br/>\n<br/>\nChildhood Rearing Daniel Greenberg <br/>\n<br/>\nChapter 9 <br/>\n<br/>\nAges Four and Up <br/>\n<br/>\nBy age four or thereabouts, human beings have a fully developed <br/>\ncommunication system which, for all intents and purposes, makes them <br/>\nmature persons. They are capable of expressing themselves, of <br/>\nunderstanding what&#39;s said to them, and of structuring continuous thought; <br/>\nand they are capable of doing things with their environment. You could <br/>\nask whether a person age four and up belongs at all in a book on <br/>\nchildrearing, because I don&#39;t consider someone over that age to be a <br/>\nchild. To a certain extent the subject doesn&#39;t belong here, and yet <br/>\nsociety considers people to be children until a much older age than four, <br/>\nand so we have to discuss this largely because society forces it on us. I <br/>\nwant to explain what I mean by a person over four being mature. The key <br/>\nelement of maturity is judgment. At around four, people have at their <br/>\ndisposal a fully developed sense of how to go about solving problems and <br/>\nhow to go about making decisions; they have a sense of what they know and <br/>\nwhat they don&#39;t know, what kind of information they need to solve <br/>\nproblems, and when they are out of their depth. This is very hard for <br/>\npeople in our culture to believe about children. For some reason, most <br/>\npeople think that judgment is developed much later. They aren&#39;t able to <br/>\npinpoint exactly when --some say 13, others 16, others 18, or 21. I do <br/>\nnot see any significant change that takes place after age four or so. <br/>\nWhen I look at a four or five or six year old making decisions, I see all <br/>\nthe components of the judgment process that I see in a person aged forty. <br/>\nThe process is the same, acompletely mature one, weighing the questions <br/>\nand the available information and the previous life experience. What does <br/>\nchange with age is that a person gains knowledge and learning and life <br/>\nexperience that can be called upon in making judgments. But I think you <br/>\nhave to remember that this is a very qualitative process which goes on at <br/>\nall ages. A person aged fifty can have just as many difficulties solving <br/>\na problem as a person aged five. A person aged fifty confronted with a <br/>\nnew situation can feel just as helpless as a child. We have phrases for <br/>\nthis in our language; we talk about older people confronted with <br/>\ndifficult situations and refer to them as being &quot;like children.&quot; <br/>\nActually, the language reflects society&#39;s prejudices. What we really mean <br/>\nis that this is something common to any age when people are confronted <br/>\nwith new situations, recognize their limitations, and don&#39;t have the <br/>\nadequate data at hand. Our prejudice is that we expect a fifty year old, <br/>\nconfronted with the need to make hard decisions, to go about making these <br/>\ndecisions in a certain way, and what we don&#39;t recognize adequately about <br/>\nfour year olds is that they do exactly the same thing. There are <br/>\ndoubtless a greater number of areas in which four or five or six year <br/>\nolds are inexperienced, and so they may need more help. But even that&#39;s <br/>\nan argument you have to be very careful about, because there is a kind of <br/>\nfeedback mechanism here. Four and five and six year olds don&#39;t get into <br/>\nall that many situations which they find to be over their heads. As they <br/>\ngrow older, they get into more and more complex situations, usually <br/>\nrefraining from going in too deep. It&#39;s something you see at all levels <br/>\nof maturity. People always meet with new challenges, but they generally <br/>\nrecognize their limitations and try not to go in over their heads. So <br/>\nwhen all is said and done, the decision-making processes of a five year <br/>\nold and a fifty year old are quite similar. In both cases the people <br/>\ninvolved in the process can be faced with the need for new data, realize <br/>\ntheir limitations, and be stuck. It isn&#39;t just children who are stuck and <br/>\ninexperienced; anybody can be, when confronted with a situation that is <br/>\nstrange to them. Another characteristic, other than judgment, which is <br/>\noften used to distinguish five year olds from fifty year olds, is <br/>\nlearning. We often hear it said that &quot;children still have a lot to <br/>\nlearn.&quot; On the other hand, we have the opposite attitude toward older <br/>\npeople, who are held to be virtually incapable of learning; &quot;you can&#39;t <br/>\nteach an old horse new tricks.&quot; Actually, the human being is a learning <br/>\nanimal throughout life, from the moment of birth until the moment of <br/>\ndeath; indeed, when a human being has stopped learning, he is essentially <br/>\ndead. As long as there is any brain activity, learning is possible -- <br/>\nwhich is probably true of lower animals as well. So to say that having a <br/>\nlot to learn is something that distinguishes younger people from older <br/>\npeople just isn&#39;t founded on any reasonable view of human nature that I <br/>\ncan think of. Another distinction that people try to draw between young <br/>\npeople and older people is that between dependence and independence. <br/>\nPeople tell their young children that they are terribly dependent, and <br/>\nyou often hear a parent say, &quot;As long as I have to take care of this and <br/>\nthat, you&#39;re going to have to do what I ask, and when you&#39;re older and <br/>\nindependent, you can do what you please.&quot; Whereas our picture of adults <br/>\nis that they are independent people. Again, I find this to be a very <br/>\nmisleading distinction. If we think about it, we realize that adults too <br/>\ncan be very dependent, for example, on their spouses or close friends. <br/>\nThey depend on other persons for help, or to come through in times of <br/>\ncrisis. We have ways of expressing this, such as &quot;It&#39;s good to have <br/>\nfriends you can count on.&quot; What we&#39;re really saying is, that for all our <br/>\nindependence, a large part of us is still dependent upon friendship. In a <br/>\nmuch deeper sense, modern society is particularly interdependent in a lot <br/>\nof ways --economically, socially, ecologically. Even the people who <br/>\nadvocate a return to nature often find themselves in an ironic dependency <br/>\nupon the rest of civilization to bail them out in a pinch. You can think <br/>\nof any number of examples. It&#39;s almost impossible to be in a position in <br/>\nwhich you are independent from the rest of society. So I think that <br/>\npeople like to fool themselves a bit as far as this is concerned, <br/>\nespecially when they talk to children. When adults talk among themselves, <br/>\nthey fully realize that they are dependent upon each other and the rest <br/>\nof society, but the big stress on independence usually shows when they <br/>\nare talking to children. You can even compare the way parents talk to <br/>\ntheir children with the way they talk with each other. It&#39;s rare that a <br/>\nhusband and wife will invoke their dependence in arguments. It&#39;s just not <br/>\na usual adult frame of reference, even though they may be terribly <br/>\ndependent upon each other. But when children and parents argue about <br/>\ntheir differences, time and again, one of the first things that comes <br/>\ninto the argument is &quot;so long as you&#39;re dependent upon me, you&#39;ve got to <br/>\ndo it my way.&quot; I think it is interesting to see this double standard <br/>\ninvoked to keep children in line. The other part of what I want to say is <br/>\nthat children four, five and six years old -- let alone older children -- <br/>\nare a lot more independent than we give them credit for. They are quite <br/>\ncapable of thinking for themselves and understanding what is going on. In <br/>\nevery sense, they have minds of their own. To me it is amazing how often <br/>\nadults do not consider children to be real people. The weirdest things <br/>\nhappen. Adults often act in the presence of children as if they were not <br/>\nthere, like non-entities. Things are often said and done in front of them <br/>\nas if they were part of the furniture. For example, there are many <br/>\nclassic stories of doctors discussing cases in front of children who are <br/>\npatients as if the children were not lying there in full view, something <br/>\nthe same doctors would not dream of doing in front of adults. Another <br/>\ncategory that is often used to distinguish children from adults is play. <br/>\nPeople say, &quot;children prefer to play a lot, and are not serious about <br/>\nlife.&quot; Whereas adults supposedly do serious things. Indeed, adults are <br/>\ncareful to label their play, so that when they decide to play, they can <br/>\nannounce the fact, in order to separate the occasion from the rest of the <br/>\ntime when they are being very serious. I think that there&#39;s a lot to be <br/>\nsaid on this subject. Perhaps the best place to begin is with the <br/>\nobservation that, in less inhibited surroundings (i.e., <br/>\nnon-starched-shirt surroundings), frolic and play is something that <br/>\npeople engage in at all ages. For example, anthropologists frequently <br/>\ncomment on the play they observe in so-called &quot;primitive&quot; tribes among <br/>\nadults. Of course, this is always called &quot;child-like play&quot; -- another <br/>\ninstance of our language clearly reflecting our preconceived notions -- <br/>\nbut the fact remains that mature people like to play. And the main reason <br/>\nfor this is that play is a creative, natural kind of activity for an <br/>\nassociative, curious, probing mind. Sad to say, our society reveals <br/>\nitself in this area too. We are so hung up on programming adults into <br/>\nwell-defined, set activities and fixed routines that we tend to squelch <br/>\nplay in grown-ups. It&#39;s not because of their age, but because of the <br/>\nroles they have to assume in Western industrial culture. Often, you hear <br/>\na person say about someone else he has known professionally for years, <br/>\nand he has happened to be with on a vacation: &quot;I didn&#39;t realize that this <br/>\nperson was so much fun, that he had such a light side to him.&quot; We are <br/>\nalways amazed to observe in others what is really a natural <br/>\ncharacteristic of people of all ages, but is repressed in the daily lives <br/>\nof most people in our society. In summary, many of the differences which <br/>\nsociety claims to exist between children and adults don&#39;t really exist. <br/>\nPeople aged four or so and up all have judgment, they all learn, they are <br/>\nall both dependent and independent in various ways, they all play, etc. I <br/>\ndon&#39;t see any grounds for distinguishing in a qualitative manner between <br/>\na person age four, five, or six and a person aged twenty or thirty. At <br/>\nabout four, a person&#39;s body and mind have reached functional maturity, <br/>\nand from then on they accumulate a storehouse of experience and knowledge <br/>\nas they proceed along their unique path in life. Which all boils down to <br/>\nsaying a very simple thing: that as far as we are concerned, as soon as <br/>\nchildren have reached four or so, they have to be treated like you treat <br/>\nany other person whom you consider an adult. Now, you have to be careful <br/>\nnot to draw the wrong implications from this conclusion. Thus, it would <br/>\nbe catastrophic to deny children what is due them. All people, regardless <br/>\nof age, have needs which should not be overlooked. For example, all <br/>\npeople have the need for affection. It&#39;s not the case that you have to <br/>\ngive a lot of affection to a four or five year old, but when a person <br/>\nturns twenty, you can turn cold. Affection is necessary for human being <br/>\nall through life. So are love, warmth, and physical contact. We accept <br/>\nthese needs in an infant, but we sort of tail off later on in life, <br/>\nalthough they are as vital to an adult as to a child aged four. The <br/>\nquestion we have to address at this point is, &quot;How did this <br/>\ndifferentiation between ages happen in Western culture?&quot; This question <br/>\nturns out to be related to another, namely, &quot;Why do we consider <br/>\nadolescence to occur at such a late age in Western culture, at puberty?&quot; <br/>\nThe answer in both cases lies in the nature of Western civilization and <br/>\nits industrialized technological society. There are many aspects to the <br/>\nanswer and I just want to highlight a few of them in order to present the <br/>\ngist of the argument. One thing that has happened is that the average <br/>\nhuman life span has increased fantastically so that people live almost <br/>\nthree times as long as they used to live up to a relatively short time <br/>\nago. The resulting population explosion has led to enormously complex <br/>\nproblems in simply providing for all these people. One technique for <br/>\nmanaging the situation is reducing job competition by lopping off both <br/>\nends of the manpower spectrum. On the one hand you introduce a retirement <br/>\nage to get rid of older workers (although it is inherently ridiculous to <br/>\nassociate a chronological age with the need to stop working). This has <br/>\nendowed us with a society full of people who are in their sixties, <br/>\nseventies, and older, who are capable of doing productive work and <br/>\nderiving satisfaction from it, but who are forced to retire and face the <br/>\ntedium of enforced idleness. That is how we lop off one end of the <br/>\nspectrum. Then we say further that a person can&#39;t enter the job market <br/>\nuntil at least fourteen years of age, preferably eighteen or older, with <br/>\nthe preferred age of entry going up as the population increases. A <br/>\nhundred years ago people in large numbers began work at age eight or <br/>\nnine. It is often said that the age was pushed upward out of compassion <br/>\nfor children. While this undoubtedly was a factor, I think the major <br/>\nreason children were removed from the job market was to keep them from <br/>\ncompeting with grownups. There just weren&#39;t enough jobs to go around, and <br/>\none way to handle it was to pass child labor laws. The end result of <br/>\ngetting the old and the young out of the job competition has been to <br/>\nintroduce monumental problems of old age and of youth in our society <br/>\nbecause of the large numbers of able persons who have been deprived of a <br/>\nproductive function in their lives. Another aspect of late adolescence <br/>\nstems from the fact that an industrialized society, of the kind that we <br/>\nhave had over the last century, needs highly trained robot-like people to <br/>\nfit into certain places in the economy. This takes time and effort. To <br/>\ntake a human being and turn him into a robot is something that you can&#39;t <br/>\ndo overnight, and it is very different from training a person to a <br/>\nresponsible role. In the old days, children started apprenticing <br/>\nthemselves when they were still quite young; it was fairly common to see <br/>\nfour and five year olds standing around a smithy or a weaving shop or <br/>\nwhatever and learning the intricate tricks of the trade. Indeed, even <br/>\ntoddlers are capable of absorbing minute details of the procedures taking <br/>\nplace in the home - even intricate ones like how to cook, how to clean, <br/>\netc. It is a mistake (that I have already discussed) to think that little <br/>\nchildren cannot be useful in complex situations. They can be. It is not <br/>\nthe complexity that we are talking about at all. From the dawn of man <br/>\nlittle children found ways to ease themselves into complex situations <br/>\ngradually. Even in the most complex industrial society children aged four <br/>\nand up can have a vital role, can find a place of interest where they can <br/>\nobserve and slowly master all the intricacies. It is the need to turn <br/>\nthem into robots that takes time. It takes years to do that. There is a <br/>\nstrong correlation between the degree of technological advancement and <br/>\nthe length of time it takes. For example, consider science. Today, the <br/>\naverage Ph.D in science is an uncreative robot drone who still has to go <br/>\nout and become a post-doctoral appointee for several years under somebody <br/>\nelse&#39;s guidance. Usually, he doesn&#39;t begin to do his own work until he is <br/>\nin his thirties. That&#39;s the norm in science, a highly advanced field. Why <br/>\nis this the case, when a generation or two ago the norm was that people <br/>\nin their early twenties were doing creative work? The answer is that in <br/>\nearlier times there were fewer scientists. There was a small group, so <br/>\neveryone could relax, and there was no pressure to force scientists into <br/>\na mold. Today there is a tremendous amount of competition, and a highly <br/>\nroutinized set of tasks for scientists to perform. It is necessary <br/>\nnowadays to prepare them for this and for that - to prepare so many solid <br/>\nstate physicists to service industries, and to prepare so many biologists <br/>\nto fight disease, etc. Science is a completely different enterprise than <br/>\nit used to be, and if you just let everybody do what they want, if you <br/>\nwould give them the same freedom that they used to enjoy, most of them <br/>\nwould be doing things that society didn&#39;t particularly want them to do. <br/>\nSo society puts tremendous pressure on developing scientists to keep them <br/>\nin line, and the longer they are kept in line, the less likelihood there <br/>\nis that at the end of their long training they will still be independent <br/>\nand creative enough to break out of their pre-set mold, and the more <br/>\nsociety will be able to rely on them to stay in a rut the rest of their <br/>\nlives. What I have said about science holds in general: the more complex <br/>\nthe society gets, and the more options that are open, the harder it is to <br/>\nmold young people into set patterns, and hence the longer it is necessary <br/>\nto keep them as robots, even up to an age that is way beyond what anybody <br/>\nconsiders childhood. The question that I had set out to answer was, &quot;Why <br/>\ndo we have adolescence in our society through puberty and beyond?&quot; In <br/>\nbrief, the answer is that over the years society has required more and <br/>\nmore time to break people in for robot-like roles, and therefore there is <br/>\na delay in the period when the kinds of things associated with <br/>\nadolescence take place - the kinds of phenomena discussed in the last <br/>\nchapter, having to do with the transition from a state of dependence to a <br/>\nstate of independence. A science post-doc goes through a period of <br/>\nadolescence at age thirty. Most people in our society go through their <br/>\nmajor adolescence in their late teens (rather than between one and four, <br/>\nwhen it would be normal), but they go through it again whenever they make <br/>\na transition from a state of total dependence to a state of <br/>\nsemi-independence, with all the attendant break-downs and rebellions and <br/>\nresentments. I think that in the kind of society that I have been <br/>\nadvocating there won&#39;t be the phenomenon of teenage adolescence at all. <br/>\nRather, all there will be is the kind of adolescence that I talked about <br/>\nearlier, between ages one and four, where the really significant life <br/>\nchanges take place on the road to personal independence. But this can <br/>\nonly happen in a society which has no need for the kind of robot-like <br/>\ntraining that now takes place. I want to say a few final words about the <br/>\nrole of a person age four and up in the family. I&#39;ve assumed that a child <br/>\nup to age four is the object of care and attention, as is due to a <br/>\ndeveloping member of the family. It seems to me fairly obvious that once <br/>\nchildren have reached the age of four or five they become adults to all <br/>\nintents and purposes and can take a full role in the family, a full share <br/>\nof the family responsibilities. Now what their share will be depends on <br/>\nany given family, but they have every right and expectation to be treated <br/>\njust like everybody else. That means, on the one hand, they have got to <br/>\ncarry their weight and find ways to contribute to doing the family <br/>\nchores, and on the other hand they have got to be given all the <br/>\nconsideration that all the other members of the family are given in <br/>\nserious decision making. The part about carrying their weight is not <br/>\nreally very difficult to conceive, because in rural families and in other <br/>\ncultures this takes place all the time. It is fairly common that youths <br/>\nage five or six draw the water and feed the animals and milk the cows. <br/>\nThere is absolutely no reason why they can&#39;t do normal things about the <br/>\nhouse; it doesn&#39;t mean they have to be able to do everything. It doesn&#39;t <br/>\nmean they have to be able to cook, for example, - after all, in most <br/>\nfamilies not all the adults can cook. Nobody says that all members of a <br/>\nfamily have to be interchangeable parts. But it is clear to me that once <br/>\nchildren have reached the age of judgment, there has to be some way for <br/>\nthem to carry their weight. The other side of that coin is something that <br/>\nis harder to conceive in our society - namely, that the same child has to <br/>\nhave a full voice in the decision making in the family. That is extremely <br/>\ndifficult to carry out in our male-dominated patriarchal society where <br/>\nusually the only person who really makes decisions in the family is the <br/>\nfather, and ninety-nine times out of a hundred he doesn&#39;t even consider <br/>\nthe opinion of his wife, let alone his children. Even in families where <br/>\nboth spouses share decision making, it is very rare to find the children <br/>\nconsulted on major decisions. I find this state of affairs to be a <br/>\ncomplete anachronism and I do not see how it can maintain itself much <br/>\nlonger. Another consequence of this view is that children in principle <br/>\nought to have the same mobility that the adult members of the family <br/>\nhave. We restrict the mobility of children all the time in our society. <br/>\nThe idea that children can regulate their time and their mobility like <br/>\nadults is one that we are going to have to learn to accept. I think that <br/>\nthe realization that children are full-fledged members of the family is <br/>\ngoing to come soon after the realization that the woman is a full-fledged <br/>\nmember of the family. In this respect, women are going to do a lot of the <br/>\nwork for children. The major thing to break is the adult male dominance <br/>\nin the home. To be sure, once you break that, it doesn&#39;t automatically <br/>\nfollow that children are going to get a full share, but at least it is <br/>\ngoing to be a lot easier for other legitimate contenders to stake their <br/>\nclaims. I think we will see more and more families in which the adults <br/>\nhave equal voices in decision making, and we will see many such families <br/>\naccommodate themselves in giving the children a full voice in family <br/>\naffairs more frequently than families in which the male is supreme. In a <br/>\nsense this has been an anomalous chapter in a book on childrearing, with <br/>\nthe message that from about age four and up you have simply got to treat <br/>\nchildren as adults and stop treating them as &quot;children.&quot; There should be <br/>\nno distinction between your fundamental attitude toward a family member <br/>\nfive years old and toward one thirty five years old.</div>","specialLinks":[]}],"prevTopicId":2280,"nextTopicId":31814}}