{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: swimming update","postDate":"1207508723","msgId":34073,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIzMTI0N0JELTc2ODYtNDM4Ni05RjgwLTMzQTE3MTgzNTNDOUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDQxMUI4OUFFLTU2NUUtNDkwRC1CMjcyLTk2NTUxODlFREQ0Q0BzYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGZ0M3ZkMitvNzEzQGVHcm91cHMuY29tPiA8NDExQjg5QUUtNTY1RS00OTBELUIyNzItOTY1NTE4OUVERDRDQHNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":34031,"nextInTopic":0,"prevInTime":34072,"nextInTime":34074,"topicId":33941,"numMessagesInTopic":0,"msgSnippet":"Holly did take swimming lessons, but not really.  I found this this morning, looking for something else (and THAT is really how unschooling can work, with","messageBody":"<div id=\"ygrps-yiv-830533476\">Holly did take swimming lessons, but not really.  I found this this  <br/>\nmorning, looking for something else (and THAT is really how  <br/>\nunschooling can work, with people being willing to find something  <br/>\nother than what they were looking for, and make good use of it!<br/>\n<br/>\n<br/>\n**********************<br/>\nOut front there are bikes, a pogo stick, a pogo-ball thing, lots of  <br/>\nrollerblades, a skateboard, a &quot;taxi bike&quot; (a tricycle with another  <br/>\nseat behind), and those are used in waves, and left alone in waves.<br/>\n<br/>\nKirby takes karate three times a week.<br/>\n<br/>\nMarty skates on Saturdays. He&#39;s up to Basic IV and will start hockey  <br/>\nin April, I think. Holly skates too, unfortunately not at the same  <br/>\ntime. She&#39;s in Basic I, having finished a little-kid Snowplow Sam class.<br/>\n<br/>\nAll three kids are in swimming lessons three days a week.<br/>\n<br/>\nWe have a compost pile, and it&#39;s kind of amazing how it seems at  <br/>\nfirst that the food and leaves and sticks and banana peels and dog  <br/>\npoop will never do anything but sit there looking like garbage, but  <br/>\nwhen I stop watching it, it turns to solid black, rich dirt! I can&#39;t  <br/>\nfind any parts of the elements of which it&#39;s made. It&#39;s kind of like  <br/>\nthat with my kids. It took me a few years to quit watching them and  <br/>\ntrust that it would compost. ￼<br/>\nIt did.<br/>\n<br/>\n***************************************<br/>\n<br/>\n  Holly was too short to stand in the water, and so she could only do  <br/>\nthe stuff on the top steps, and so she would sit with me and my  <br/>\nfriend Monica Cordova, whose two older kids were in the class too.   <br/>\nWhen I read that, which was written while we were still at our old  <br/>\nhouse, it all came back.  We were at the indoor pool at Los Altos  <br/>\nPark, and after that there was an outdoor pool near Comanche, and  <br/>\nHolly just opted out totally and hung out with me instead.  And  <br/>\nultimately she became a better swimmer.  But she was in lessons a  <br/>\nlittle while, and didn&#39;t finish a course.<br/>\n<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: swimming update","postDate":"1207274210","msgId":34031,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxMUI4OUFFLTU2NUUtNDkwRC1CMjcyLTk2NTUxODlFREQ0Q0BzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGZ0M3ZkMitvNzEzQGVHcm91cHMuY29tPg==","referencesHeader":"PGZ0M3ZkMitvNzEzQGVHcm91cHMuY29tPg=="},"prevInTopic":34030,"nextInTopic":34073,"prevInTime":34030,"nextInTime":34032,"topicId":33941,"numMessagesInTopic":0,"msgSnippet":"-=-As we played together in the water, she was ecstatic. She only cried when it was time to get out. She didn t want to stop. I was euphoric seeing her joy as","messageBody":"<div id=\"ygrps-yiv-1193682892\">-=-As we played together in the water, she was ecstatic. She only cried<br/>\nwhen it was time to get out. She didn&#39;t want to stop. I was euphoric<br/>\nseeing her joy as she played and clung to me in the water as much as<br/>\nshe wanted. I felt such a burden lifted from my shoulders.-=-<br/>\n<br/>\n<br/>\n<br/>\nVery, very cool.<br/>\n<br/>\nKeith swims well.  He can do a few fancy dives.  I don&#39;t swim at  <br/>\nall.  Still, he didn&#39;t take the kids to swim lessons; he wanted me  <br/>\nto.  I didn&#39;t want them to get my fears.   It worked out, and he has  <br/>\ndone a lot of playing in pools with them, and in a lake with Marty  <br/>\nand Holly.   (Kirby and I opted out of that family trip, where Marty  <br/>\nrode a Jet Ski and Holly and Marty towed a houseboat (themselves, for  <br/>\nfun).<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":305996096,"authorName":"janellewrock","from":"&quot;janellewrock&quot; &lt;janelle@...&gt;","profile":"janellewrock","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: swimming update","postDate":"1207271650","msgId":34030,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZ0M3ZkMitvNzEzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDJGNzM3RjIxLUUyRjUtNDUxOC1BQzBBLTIwMDE4NjMyMUIzQUBtYWMuY29tPg=="},"prevInTopic":33941,"nextInTopic":34031,"prevInTime":34029,"nextInTime":34031,"topicId":33941,"numMessagesInTopic":0,"msgSnippet":"Well, I think I started with swim lessons because I wanted my daughter to learn to swim as soon as possible so we could just get in the pool and swim in the","messageBody":"<div id=\"ygrps-yiv-1552567219\">Well, I think I started with swim lessons because I wanted my <br/>\ndaughter to learn to swim as soon as possible so we could just get in <br/>\nthe pool and swim in the summer time and she&#39;d know how to do it and <br/>\nhave swimming behind her. A friend told me about a school where all <br/>\nher kids learned how to swim in three weeks. <br/>\n<br/>\nGenerally, I thought they did pretty well with the kids. However, my <br/>\ndaughter did cry a lot about going under water. The teacher she <br/>\nchanged to after the first session (the first three weeks)is kind of <br/>\na &quot;firm disciplinarian.&quot; My daughter actually did better after a <br/>\nwhile but still cried at times. After a day of quite a bit of crying <br/>\nand after I&#39;d been learning about unschooling for a while, I started <br/>\nasking her if she liked swim lessons and wanted to go. She kept <br/>\nsaying yes. I took her back. For a while after that, she didn&#39;t cry <br/>\nat all and was very heppy through lessons. Many sessions later, she <br/>\nstill doesn&#39;t know how to swim yet.<br/>\n<br/>\nAfter a particularly rough day, she was crying a lot. She had <br/>\nswitched teachers during the second half. The teacher got annoyed by <br/>\nthe crying and said something to her regular teacher. My daughter <br/>\nclimbed out of the pool and was sobbing. I went to pick her up, and <br/>\nher regular teacher came over and said, &quot;Stop crying!&quot; I was just <br/>\nabout to leave with her and didn&#39;t see any need for that. As soon as <br/>\nI picked her up, she calmed down. I started asking her again if she <br/>\nwanted lessons. I told her I didn&#39;t like them telling her to stop <br/>\ncrying, and I thought it was mean. I asked her before her next lesson <br/>\nif she wanted to go. She said no. The next lesson she said yes and <br/>\nthen no. I told her we could go swim at her aunt&#39;s house, and she <br/>\nwanted to do that.<br/>\n<br/>\nAs we played together in the water, she was ecstatic. She only cried <br/>\nwhen it was time to get out. She didn&#39;t want to stop. I was euphoric <br/>\nseeing her joy as she played and clung to me in the water as much as <br/>\nshe wanted. I felt such a burden lifted from my shoulders. I called <br/>\nthe swim school to tell them we weren&#39;t coming for lessons any more. <br/>\n<br/>\nThanks to unschooling!!<br/>\n<br/>\nJanelle<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &quot;We are at a very crowded YMCA pool tonight. It is full of working  <br/>\n&gt; parents trying to cram in the kids&#39; swimming lesson into today&#39;s to-<br/>\n <br/>\n&gt; do list. You know when my kids learned to swim? When I stopped <br/>\n </span></blockquote>taking  <br/>\n<blockquote><span title=\"ireply\"> &gt; them to swimming lessons.  Like any good mother, I had them in the <br/>\n </span></blockquote>water and in  <br/>\n<blockquote><span title=\"ireply\"> &gt; swimming lessons before they were even walking. I myself used to <br/>\n </span></blockquote>even  <br/>\n<blockquote><span title=\"ireply\"> &gt; teach swimming lessons. I spun my kids in circles and sand silly  <br/>\n&gt; songs much like the weary-eyed parents here tonight. Now that I <br/>\n </span></blockquote>have  <br/>\n<blockquote><span title=\"ireply\"> &gt; some objectivity, I sit here and think &quot;do they realize how silly  <br/>\n&gt; what they are doing is?&quot; Do we need to pay money and be on a class  <br/>\n&gt; schedule in order to play with our kids in the pool? Swimming <br/>\n </span></blockquote>comes  <br/>\n<blockquote><span title=\"ireply\"> &gt; naturally to kids when they are exposed to it in a way that <br/>\n </span></blockquote>doesn&#39;t  <br/>\n<blockquote><span title=\"ireply\"> &gt; induce fear. I have a vivid childhood memory of being with my <br/>\n </span></blockquote>crying  <br/>\n<blockquote><span title=\"ireply\"> &gt; brother while he was left in a swimming lesson. My mom was told <br/>\n </span></blockquote>that  <br/>\n<blockquote><span title=\"ireply\"> &gt; the kids do better when the parents leave. But why the need for  <br/>\n&gt; structured learning of something that comes so naturally? I didn&#39;t  <br/>\n&gt; have to sign my kids up for crawling classes or walking classes.  <br/>\n&gt; Don&#39;t get me wrong; I think kids should be in the water young and  <br/>\n&gt; often. From my own teaching experience, it can be very difficult <br/>\n </span></blockquote>to  <br/>\n<blockquote><span title=\"ireply\"> &gt; teach an afraid adult to swim. So I guess my question is, why do <br/>\n </span></blockquote>we,  <br/>\n<blockquote><span title=\"ireply\"> &gt; as parents, have this need for swimming lessons? Because it is our  <br/>\n&gt; need. The kid&#39;s don&#39;t want it. They just need lots of time in the  <br/>\n&gt; water. Is it our need for accomplishment or the illusion of it  <br/>\n&gt; through classes (&quot;Johnny has just moved up to Minnow&quot;)? &gt; other end <br/>\n </span></blockquote>of the pool some small child may be thinking, &quot;why is my  <br/>\n<blockquote><span title=\"ireply\"> &gt; mom singing that stupid song and when will I be able to just <br/>\n </span></blockquote>play?&quot;  <br/>\n<blockquote><span title=\"ireply\"> &gt; And the mom might be thinking, &quot;why am I singing this stupid song <br/>\n </span></blockquote>and  <br/>\n<blockquote><span title=\"ireply\"> &gt; when will we ever get a minute in our hectic schedules to just <br/>\n </span></blockquote>play?&quot;<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; Blessings,<br/>\n&gt; <br/>\n&gt; Lara Miller<br/>\n&gt; Currently near Boulder, CO!<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.mytripjournal.com/millerfamily\">http://www.mytripjournal.com/millerfamily</a><br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":269526657,"authorName":"Lara Miller","from":"Lara Miller &lt;birthmamma@...&gt;","profile":"birthmamma2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"swimming update","postDate":"1207021266","msgId":33941,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJGNzM3RjIxLUUyRjUtNDUxOC1BQzBBLTIwMDE4NjMyMUIzQUBtYWMuY29tPg=="},"prevInTopic":0,"nextInTopic":34030,"prevInTime":33940,"nextInTime":33942,"topicId":33941,"numMessagesInTopic":0,"msgSnippet":"What a strange experience we had today at the pool.  I haven t had a chance to sit down and right about it until now.  We went to the Y to go swimming.","messageBody":"<div id=\"ygrps-yiv-1757499477\">What a strange experience we had today at the pool.  I haven&#39;t had a  <br/>\nchance to sit down and right about it until now.  We went to the Y to  <br/>\ngo swimming.  Earlier this morning, we knew that&#39;s what we all wanted  <br/>\nto do this afternoon.  I looked up the Y&#39;s schedule and noticed that  <br/>\nthere was a &quot;homeschool&quot; time around the same time we were going to  <br/>\nbe there and I thought, &quot;cool, maybe we can find some kids to play  <br/>\nwith&quot;.  Well we got there about 45 minutes before the homeschoolers  <br/>\n&quot;PE&quot; (that is what is was listed as) was about to start and just  <br/>\nplayed and swam and played and swam.  At the appointed time, all of  <br/>\nthe sudden, there were 40-50 kids marched into the pool by a couple  <br/>\nof Y employees barking out orders at them.  The kids seemed to range  <br/>\nin age from about 5-10 years old.  My kids got a little scared of all  <br/>\nof the commotion and went and got in the kiddie pool to play around.   <br/>\nEverytime one of the lifeguards yelled out, my kids jumped.  They  <br/>\nwere yelling things like, &quot;sit down on the white line, I said sit  <br/>\ndown, you may not get up yet&quot; &quot;you have to have your hand marked if  <br/>\nyou haven&#39;t taken the swimming test&quot;  &quot;If you wipe the mark off your  <br/>\nhand then you will just have to wear a float belt&quot;.  This went on for  <br/>\n30 minutes!  After they had barked out all of the rules once again to  <br/>\nall of the kids, they were allowed to get in.  Now I had been waiting  <br/>\nfor this moment.  I couldn&#39;t wait to see what kinds of neat things  <br/>\nthey did with the kids for &quot;homeschooling PE&quot;.  Nothing, that is what  <br/>\nthey did.  The kids just swam and played like any kids swim and play  <br/>\nin a pool.  My kids were a bit overwhelmed and I think were afraid of  <br/>\ngetting into trouble with the barking lifeguards, who up until this  <br/>\npoint had been really nice.  I was happy for them to be doing  <br/>\nwhatever they wanted to do which was play in the kiddie pool, so I  <br/>\njust sat and observed the lifeguards, the children and their  <br/>\ninteractions with each other.<br/>\n<br/>\nAt one point, 20 minutes after they had been in the water, a whistle  <br/>\nwas blown and they all got out.  First thing I thought was &quot;that&#39;s  <br/>\nit???&quot;  But they all had to rush out and come and sit on the white  <br/>\nline again and line up with their buddy.  They were reprimanded for  <br/>\nit taking them so long to get out and on the white line.  &quot;we will do  <br/>\nthis one more time and if you aren&#39;t all out in 1 minute and on the  <br/>\nwhite line with a buddy, then we will do a buddy check every five  <br/>\nminutes until you can get it right!&quot;  And then they were all allowed  <br/>\nback in the water to play.  This of course was simply a threat  <br/>\nbecause they never once called them out again until the end.  So for  <br/>\na 90 minute PE, they spent 30 minutes in the beginning getting  <br/>\norganized and barked at then only 45 minutes swimming (with buddy  <br/>\nchecks) and 15 minutes getting out and organized to leave and barked  <br/>\nat about there not being time today for showers and they better hurry  <br/>\nup and get dressed and no playing around.<br/>\n<br/>\nAnd the really interesting thing????  I never saw another parent!   <br/>\nWitnessing the whole thing was just very strange for me and I think  <br/>\nfor my kids too.  As soon as all those kids were gone, mine just  <br/>\njumped right back in the big pool and started swimming there.<br/>\n<br/>\nI went back in my journal and found an entry I made after a similar  <br/>\npool experience this last fall:<br/>\n<br/>\n&quot;We are at a very crowded YMCA pool tonight. It is full of working  <br/>\nparents trying to cram in the kids&#39; swimming lesson into today&#39;s to- <br/>\ndo list. You know when my kids learned to swim? When I stopped taking  <br/>\nthem to swimming lessons. We just spent almost everyday one summer  <br/>\nletting them, allowing them, to explore their bodies and abilities at  <br/>\nthe pool. Like any good mother, I had them in the water and in  <br/>\nswimming lessons before they were even walking. I myself used to even  <br/>\nteach swimming lessons. I spun my kids in circles and sand silly  <br/>\nsongs much like the weary-eyed parents here tonight. Now that I have  <br/>\nsome objectivity, I sit here and think &quot;do they realize how silly  <br/>\nwhat they are doing is?&quot; Do we need to pay money and be on a class  <br/>\nschedule in order to play with our kids in the pool? Swimming comes  <br/>\nnaturally to kids when they are exposed to it in a way that doesn&#39;t  <br/>\ninduce fear. I have a vivid childhood memory of being with my crying  <br/>\nbrother while he was left in a swimming lesson. My mom was told that  <br/>\nthe kids do better when the parents leave. But why the need for  <br/>\nstructured learning of something that comes so naturally? I didn&#39;t  <br/>\nhave to sign my kids up for crawling classes or walking classes.  <br/>\nDon&#39;t get me wrong; I think kids should be in the water young and  <br/>\noften. From my own teaching experience, it can be very difficult to  <br/>\nteach an afraid adult to swim. So I guess my question is, why do we,  <br/>\nas parents, have this need for swimming lessons? Because it is our  <br/>\nneed. The kid&#39;s don&#39;t want it. They just need lots of time in the  <br/>\nwater. Is it our need for accomplishment or the illusion of it  <br/>\nthrough classes (&quot;Johnny has just moved up to Minnow&quot;)? Do we do it  <br/>\nbecause it is what we are &quot;supposed&quot; to be doing with out kids. All I  <br/>\nknow for sure is that my kids are all swimming like fish tonight,  <br/>\nlost in their imaginary world of mermaids and mer-men, while at the  <br/>\nother end of the pool some small child may be thinking, &quot;why is my  <br/>\nmom singing that stupid song and when will I be able to just play?&quot;  <br/>\nAnd the mom might be thinking, &quot;why am I singing this stupid song and  <br/>\nwhen will we ever get a minute in our hectic schedules to just play?&quot;<br/>\n<br/>\nBlessings,<br/>\n<br/>\nLara Miller<br/>\nCurrently near Boulder, CO!<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.mytripjournal.com/millerfamily\">http://www.mytripjournal.com/millerfamily</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":33934,"nextTopicId":33922}}