{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Thomas and Nanci Kuykendall","from":"Thomas and Nanci Kuykendall &lt;tn-k4of5@...&gt;","replyTo":"LIST","senderId":"7K5d4I5uxtc83nJtmSQhWzFTIf6SV5mSr_YuD01_EJ4FFTZzPMV5qkYhq3PLX9lzrFbAmkCciAR0FfWxiCZZCuHZyCw3kUY2L-AclnzN1jKH1kdMwF6mQzM","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Parental Control (was: outing myself)","postDate":"948218077","msgId":5659,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4zNzQuNTY1OS45NTkyNjk3NDVAZUdyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":5658,"nextInTime":5660,"topicId":5659,"numMessagesInTopic":0,"msgSnippet":"... I still get that same feeling of ... I believe this has to do with the way so many of us are raised with total parental control and living by their praise","messageBody":"<div id=\"ygrps-yiv-655428950\"><blockquote><span title=\"ireply\">&gt;From: &quot;Lisa Breger&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:lisa@...\">lisa@...</a>&gt;<br/>\n </span></blockquote>I still get that same feeling of<br/>\n<blockquote><span title=\"ireply\"> &gt;anxiety when I  make a parenting choice I know my father will disagree with.<br/>\n&gt;Even though I am almost 37 years old, I have this innate desire to please<br/>\n&gt;him!  I believe many adults never outgrow this.  <br/>\n<br/>\n </span></blockquote>I believe this has to do with the way so many of us are raised with total<br/>\nparental control and living by their praise and approval.  When everything<br/>\nwe do is subject to the whims of our parents&#39; opinions and all our<br/>\nactivity, study, relationships, etc are monitored and directed by parents<br/>\nor other adult authority figures for our first 18 years or more (especially<br/>\nfor those going to college on Mom or Dad&#39;s bill) how can we help but retain<br/>\nthat anxiety and fear over our choices being approved or vetoed by our<br/>\nparents?<br/>\n<br/>\nThere is the old classic situation where we take our current mate home to<br/>\n&quot;Meet the Parents&quot; for the first time (or the reverse, where we go to meet<br/>\ntheirs) and all the anxiety and desire for approval from them that<br/>\naccompanies that.  But in the end, you will marry or stay with whomever you<br/>\nwant, and basically become estranged from your parents if they do not<br/>\napprove.  That is one of those situations where you are forced to move away<br/>\nfrom parental approval and make a life based on your own rules, thereby<br/>\nbecoming more healthy and independent.  Many people never find the<br/>\nemotional or psychological courage to break those ties that bind (in the<br/>\nrestrictive sense) and live their lives going along with the family<br/>\nexpectations, etc.<br/>\n<br/>\nIn my case, my parents heartily approve of my choice of mate (for the first<br/>\ntime in my life!) as I married a man I met at my dad&#39;s office, whom my<br/>\nfather had hired.  On a side note:  For a while it became rather difficult,<br/>\nwith coworkers (new hires) assuming he had gotten the job because his<br/>\nfather-in-law was the boss.  When in reality he worked there, and we knew<br/>\neach other, for more than 2 years before we became romantically involved.<br/>\nIn fact he was in the last stages of a failing marriage when he first began<br/>\nto work there, and was divorced a year before we began to go to lunch<br/>\ntogether, etc.  <br/>\n<br/>\nBut I resent my parents&#39; approval for the same reason I would resent their<br/>\ndisapproval:  They make my accomplishments or failures their own.  They<br/>\nlove to take credit for anything intelligent that I say or do as being a<br/>\ndirect result of their parenting skills (hah!) or education of me (Double<br/>\nHa!)  By the same token, my mistakes or errors in judgement come out as<br/>\n&quot;Where did we go wrong?&quot; from them, with all the guilt associated with<br/>\nthat.  I am not allowed to own any of my own successes or failures, and as<br/>\nsuch not recognized as a functioning human being on the same (or I like to<br/>\nthink - more sane) level as them.<br/>\n<br/>\nPerhaps our children will be more sane, independent and emotionally whole<br/>\nas a result of being allowed to have autonomy, more control of their own<br/>\nlives and decisions, more control of their educations, etc.  If we are<br/>\nlucky, they will consult us in important decision making because they value<br/>\nour input, and not because they need our approval.  If we&#39;re REALLY lucky,<br/>\nthey&#39;ll take our opinions as what they are and make decisions based on all<br/>\nthe information they have available and their own feelings, not ours.<br/>\n<br/>\nNanci K.</div>","specialLinks":[]}],"prevTopicId":5657,"nextTopicId":5661}}