{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Unhappiness necessary for learning!!","postDate":"1320342706","msgId":63680,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo4dWtiaStnZW1vQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDhDOTgxMEVBLTNERTgtNDAyMi1CMDkzLUNCNDg5Q0ZEMjI2QUB2ZXJpem9uLm5ldD4="},"prevInTopic":63679,"nextInTopic":0,"prevInTime":63679,"nextInTime":63681,"topicId":63671,"numMessagesInTopic":0,"msgSnippet":"... And what most educators don t get to see where learning is concerned is that people naturally Like to learn and are naturally motivated - arguably even","messageBody":"<div id=\"ygrps-yiv-425321940\">Joyce Fetteroll &lt;jfetteroll@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;But biology  <br/>\n&gt; drives kids to want to be independent, to do it themselves. They might  <br/>\n&gt; not label what they feel as unhappiness or misery but discontent, the  <br/>\n&gt; need for something different will grow.<br/>\n<br/>\n </span></blockquote>And what most educators don&#39;t get to see where learning is concerned is that people naturally Like to learn and are naturally motivated - arguably even driven - to learn and discover, so much so that we have a word for times when there&#39;s an uncomfortable lack of learning and discovery: tedium. Educators sometimes seek to induce tedium for that reason, but it falls flat for the same reason inducing other kinds of suffering does - there&#39;s no way to control what kids will choose to learn to relieve the tedium. My partner can fold fifteen different varieties of paper airplane and aim them with mind-boggling accuracy as a result of classroom tedium - definitely not what the teacher had in mind!<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":459359078,"authorName":"Regan","from":"Regan &lt;oregano3@...&gt;","profile":"persea112","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Unhappiness necessary for learning!!","postDate":"1320341557","msgId":63679,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwQTJCRUJCLTY5QzEtNDhGRi05OTRCLTFDN0EwQ0NERDM0REBiaWdwb25kLmNvbT4=","inReplyToHeader":"PDhDOTgxMEVBLTNERTgtNDAyMi1CMDkzLUNCNDg5Q0ZEMjI2QUB2ZXJpem9uLm5ldD4=","referencesHeader":"PGo4dGtiYStwaGppQGVHcm91cHMuY29tPiA8MTMyMDMxNjk1Ni4xMjg3NS5ZYWhvb01haWxSQ0B3ZWI4NzMxMS5tYWlsLmlyZC55YWhvby5jb20+IDw4Qzk4MTBFQS0zREU4LTQwMjItQjA5My1DQjQ4OUNGRDIyNkFAdmVyaXpvbi5uZXQ+"},"prevInTopic":63676,"nextInTopic":63680,"prevInTime":63678,"nextInTime":63680,"topicId":63671,"numMessagesInTopic":0,"msgSnippet":"... I can make a meal I m happy with, and at the same time be thinking of ideas of what I could do a bit differently next time.  It s the excitement about","messageBody":"<div id=\"ygrps-yiv-1837553346\">On 03/11/2011, at 10:04 PM, Joyce Fetteroll wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  If someone&#39;s happy, why would they change anything?<br/>\n<br/>\n </span></blockquote>I can make a meal I&#39;m happy with, and at the same time be thinking of ideas of what I could do a bit differently next time.  It&#39;s the excitement about possibilities, rather than misery with how things are, that drives the exploring and the learning.  It&#39;s at the heart of strewing, it&#39;s at the heart of people making progress with all sorts of things they learn about.  They don&#39;t need to be unhappy with how things are.  Being interested in or excited about how things could be is a wonderful and natural starting point for learning and growth.<br/>\n<br/>\nIn the school context, instead of keeping a certain level of unhappiness in school children&#39;s lives to get them to &quot;make progress&quot;, schools could be strewing teasers of all sorts, keeping interesting possibilities within reach, visible, imaginable.  Keeping interest, and the natural desire to understand and be competent, alive.  <br/>\n<br/>\nParents don&#39;t need to ensure that their children are somewhat unhappy for them to efficiently learn to walk or talk.  They learn to walk, talk (and can be happy too!) if parents keep the possibilities for change open - keeping their worlds interesting, holding their hands as they begin to toddle, talking to them about interesting things, listening with love, being ready to help etc. <br/>\n<br/>\nUnhappy can sometimes lead to inertia, whereas happy is often energizing.<br/>\n<br/>\nDebbie.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Unhappiness necessary for learning!!","postDate":"1320321485","msgId":63676,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI0MkExMDUzLTI4NDgtNEVCNy05Q0MzLUQ0RThFRTM1OTQyMEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGo4dGtiYStwaGppQGVHcm91cHMuY29tPg==","referencesHeader":"PGo4dGtiYStwaGppQGVHcm91cHMuY29tPg=="},"prevInTopic":63675,"nextInTopic":63679,"prevInTime":63675,"nextInTime":63677,"topicId":63671,"numMessagesInTopic":0,"msgSnippet":"-=- Our current pre-occupation with happiness and well-being is stupid and is likely to lead to further under-achievement because real learning involves","messageBody":"<div id=\"ygrps-yiv-671463609\">-=-&quot;Our current pre-occupation with happiness and well-being is stupid and is likely to lead to further under-achievement because real learning involves challenge, difficulty and unhappiness.&quot;-=-<br/>\n<br/>\nPart of what shocks me is the casual and frequent use of the term &quot;stupid&quot; in the UK.<br/>\n<br/>\nBut yes, the idea that the youngest children were probably not more unhappy than older children is stunning.<br/>\n<br/>\n-=- I was often (still am) told that unless I made things hard for my children they wouldn&#39;t learn anything. -=-<br/>\n<br/>\nMy mother-in-law said years ago, of my pre-school-aged boys, &quot;You need to frustrate them.&quot;  She was serious.  She wanted to see them baffled and uncomfortable so they could learn to endure bafflement and discomfort.  <br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Unhappiness necessary for learning!!","postDate":"1320318282","msgId":63675,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDOTgxMEVBLTNERTgtNDAyMi1CMDkzLUNCNDg5Q0ZEMjI2QUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDEzMjAzMTY5NTYuMTI4NzUuWWFob29NYWlsUkNAd2ViODczMTEubWFpbC5pcmQueWFob28uY29tPg==","referencesHeader":"PGo4dGtiYStwaGppQGVHcm91cHMuY29tPiA8MTMyMDMxNjk1Ni4xMjg3NS5ZYWhvb01haWxSQ0B3ZWI4NzMxMS5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":63674,"nextInTopic":63676,"prevInTime":63674,"nextInTime":63676,"topicId":63671,"numMessagesInTopic":0,"msgSnippet":"... This is true. If someone s happy, why would they change anything?  How many people are unschooling because they and their kids were happy with school? (I","messageBody":"<div id=\"ygrps-yiv-1547972477\">On Nov 3, 2011, at 6:42 AM, Schuyler wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I think there may be truth to the idea that if you want someone to  <br/>\n&gt; strive to<br/>\n&gt; change making them miserable where they are can help. The problem is  <br/>\n&gt; that you<br/>\n&gt; can&#39;t predict how they will change, what they will change.<br/>\n<br/>\n </span></blockquote>This is true. If someone&#39;s happy, why would they change anything?  How  <br/>\nmany people are unschooling because they and their kids were happy  <br/>\nwith school?<br/>\n<br/>\n(I think the fear that kids will never want to leave home because  <br/>\nthey&#39;re too happy sounds reasonable in that light ;-) But biology  <br/>\ndrives kids to want to be independent, to do it themselves. They might  <br/>\nnot label what they feel as unhappiness or misery but discontent, the  <br/>\nneed for something different will grow.)<br/>\n<br/>\nBeing unhappy or dissatisfied is definitely a good motivator. It&#39;s why  <br/>\nI&#39;ve often said that support is not helpful for adopting an  <br/>\nunschooling way of life. Support for the struggle as someone is  <br/>\nchanging is good. Support for how hard this is, how difficult it is to  <br/>\nchange, how this state of discomfort is common to all parents, can  <br/>\nmake people feel more comfortable about where they are and makes it  <br/>\neasier not to change.<br/>\n<br/>\nIf there&#39;s solidarity in suffering through the misery, it can help  <br/>\npeople put up with the bad conditions and not seek change.<br/>\n<br/>\nBut making people miserable? Yeah, there&#39;s no predicting what change  <br/>\nthey&#39;d decide to make. In America there are AK-47s and other high  <br/>\npowered weaponry available as choices :-/<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Unhappiness necessary for learning!!","postDate":"1320317123","msgId":63674,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEIwNTdBODZELTRCRTUtNDc2RS05NDM3LUZERUI3NkQwRTA2MUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGo4dGtiYStwaGppQGVHcm91cHMuY29tPg==","referencesHeader":"PGo4dGtiYStwaGppQGVHcm91cHMuY29tPg=="},"prevInTopic":63673,"nextInTopic":63675,"prevInTime":63673,"nextInTime":63675,"topicId":63671,"numMessagesInTopic":0,"msgSnippet":"... The kids in English boarding schools on TV always seem very unhappy. So quality is perhaps seen as proportional to suffering and unhappiness. :-/ And it","messageBody":"<div id=\"ygrps-yiv-1132816\">On Nov 3, 2011, at 4:45 AM, alma wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &quot;Our current pre-occupation with happiness and well-being is stupid  <br/>\n&gt; and is likely to lead to further under-achievement because real  <br/>\n&gt; learning involves challenge, difficulty and unhappiness.&quot;<br/>\n<br/>\n </span></blockquote>The kids in English boarding schools on TV always seem very unhappy.  <br/>\nSo quality is perhaps seen as proportional to suffering and  <br/>\nunhappiness. :-/<br/>\n<br/>\nAnd it makes sense that we&#39;d be learning the most when we&#39;re tackling  <br/>\nsomething challenging and difficult. But its the desire for that  <br/>\nknowledge that&#39;s driving someone to learn not the challenge. And  <br/>\nreally big desire will drive us through something challenging and  <br/>\ndifficult which will result in a big chunk of learning.<br/>\n<br/>\nWithout the drive, the learning isn&#39;t going to happen.<br/>\n<br/>\n*Some* kids like external motivators (grades and scores) that give  <br/>\nthem goals to shoot for. Some kids like school style learning and are  <br/>\ngenerally interested in the knowledge. If someone has those factors,  <br/>\nthe desire for the external motivator can give them extra drive to get  <br/>\nthrough more challenging material that they wouldn&#39;t tackle on their  <br/>\nown, from which they&#39;ll come out the other side with more knowledge.<br/>\n<br/>\nBut, again, it&#39;s still the internal drive -- for the information or  <br/>\ngrades -- that&#39;s the cause of learning a lot.<br/>\n<br/>\nThe problem is educators have their eyes on a big chunk of knowledge  <br/>\n(sculpted by centuries of tradition in England) they want to get into  <br/>\nkids. There are wo truths that educators see: If kids are left to  <br/>\nchoose, they may dabble a bit but mostly avoid the knowledge and will  <br/>\nchoose fun instead. When kids are made to learn, they&#39;ll choose to do  <br/>\nas little as possible to get by. When kids drop out of school or are  <br/>\nforced out, for the most part they continue that pattern.<br/>\n<br/>\nWhat educators conclude is that kids are naturally lazy pleasure  <br/>\nseekers. In order to make something of themselves, kids need adult  <br/>\nintervention to force the knowledge into them.<br/>\n<br/>\nThat&#39;s the understanding of kids and learning that unschoolers are up  <br/>\nagainst.<br/>\n<br/>\nWhat is actually true -- that educators have no clue about -- is that  <br/>\nkids aren&#39;t avoiding the learning so much as they&#39;re avoiding the  <br/>\npressure to learn what doesn&#39;t (yet) intrigue them, and avoiding the  <br/>\nincreasingly negative association they&#39;re picking up about the  <br/>\nknowledge. What is also true is that even when allowed to follow their  <br/>\ninterests, most kids will only take in a small portion of that chunk  <br/>\nof learning. (And what they do take in instead is very hard to test.  <br/>\nThey might have a big chunk of knowledge and good feelings about  <br/>\nShakespeare but it won&#39;t necessarily be the particular factoids that  <br/>\nare on the test. So it will appear that they don&#39;t know much at all.)<br/>\n<br/>\nBut because of the focus on the knowledge, because of the focus on the  <br/>\namount a child takes in, unschooling will look like some knee jerk  <br/>\nblind rejection of what&#39;s important because Mom wants something pie in  <br/>\nthe sky, can&#39;t-get-a-job-with-it ideal like happiness. And, just as  <br/>\npeople can&#39;t learn without drive, educators  can&#39;t be pressured to  <br/>\nlearn a new way of seeing education unless they have reasons that fire  <br/>\nup the internal drive to do so. And if unhappiness is accepted as part  <br/>\nof the process, that&#39;s one less path to a new way of thinking.<br/>\n<br/>\nI think we have an advantage in the US in that people here see  <br/>\nhappiness as an unalienable right. (It&#39;s in our Declaration of  <br/>\nIndependence from you guys :-) &quot;Life, liberty and the pursuit of  <br/>\nhappiness.&quot; Which, culturally, only fully applies to adults but  <br/>\nthere&#39;s a trickle down effect on children that won&#39;t allow society as  <br/>\na whole to adopt children&#39;s unhappiness as a necessary thing.) Lots of  <br/>\npeople come to homeschooling and then unschooling *because* their kids  <br/>\nare very unhappy in school. And when parents accept their kids  <br/>\nunhappiness in school, I think they&#39;re more likely to see it as tragic  <br/>\nand something that needs fixed (even if they have no idea how to fix  <br/>\nit.)<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"1"},"subject":"Re: [AlwaysLearning] Unhappiness necessary for learning!!","postDate":"1320316956","msgId":63673,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMjAzMTY5NTYuMTI4NzUuWWFob29NYWlsUkNAd2ViODczMTEubWFpbC5pcmQueWFob28uY29tPg==","inReplyToHeader":"PGo4dGtiYStwaGppQGVHcm91cHMuY29tPg==","referencesHeader":"PGo4dGtiYStwaGppQGVHcm91cHMuY29tPg=="},"prevInTopic":63671,"nextInTopic":63674,"prevInTime":63672,"nextInTime":63674,"topicId":63671,"numMessagesInTopic":0,"msgSnippet":"I think there may be truth to the idea that if you want someone to strive to change making them miserable where they are can help. The problem is that you ","messageBody":"<div id=\"ygrps-yiv-1097810940\">I think there may be truth to the idea that if you want someone to strive to <br/>\nchange making them miserable where they are can help. The problem is that you <br/>\ncan&#39;t predict how they will change, what they will change. The protests going on <br/>\nin the UK, Spain, the U.S., Greece, and everywhere else in the world are a <br/>\nproduct of some folks being miserable. I imagine that isn&#39;t the kind of striving <br/>\nfor change the Chief Inspector of Schools would call a good outcome of <br/>\nunhappiness. And, given that the finding about summer born children doing less <br/>\nwell throughout their school career is the catalyst for the article, however <br/>\nthey are changing it isn&#39;t in the way that he is arguing would happen. And what <br/>\nis exactly the right amount of misery to nudge someone in the right direction of <br/>\nlearning? <br/>\n<br/>\n<br/>\nI&#39;ve felt envy. Not masses, but occasional moments of, when I look at how good <br/>\nSimon&#39;s and Linnaea&#39;s life is, how much I wish that I had the connection they <br/>\nhave with their family. How much I wish I&#39;d had the power they have. And I can <br/>\nunderstand how a grown up child can believe that the suffering they experienced <br/>\nmust have been valuable. It must have given them the edge they have now. I&#39;ve <br/>\nhad young children argue with me about the necessity of school because otherwise <br/>\nwhat the hell where they doing going to this place they hated every weekday?!! <br/>\nIt meant that their parents were making choices that weren&#39;t necessarily the <br/>\nchoices that had their interests at heart. And that&#39;s too hard to swallow. So <br/>\nyou pass on the notion that being unhappy is what makes you learn even while <br/>\ntrying to be happy in your own life and helping your own children to be happy. <br/>\nSuch fabulous cognitive dissonance. <br/>\n<br/>\n<br/>\nSimon and Linnaea have been listening to a lot of Tim Minchin lately and when I <br/>\nread your post I thought of this song: <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.youtube.com/watch?v=3xQmJ_vxHB4&feature=related\">http://www.youtube.com/watch?v=3xQmJ_vxHB4&feature=related</a> and how much I <br/>\nbelieved that being miserable was the same as being deep and thoughtful. I <br/>\nhaven&#39;t felt that way for a long time. But it was an important part of my <br/>\nworldview when I was 14, 15, 16, 17, 18, 19, 20, 21, and then it started to <br/>\ntaper off. I like being happy. I strive to be happy. And I stay where I am <br/>\nhappiest. And I learn all the time!<br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: alma &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:almadoing@...\">almadoing@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nSent: Thursday, 3 November, 2011 8:45:30<br/>\nSubject: [AlwaysLearning] Unhappiness necessary for learning!!<br/>\n<br/>\nI was shocked to read an article on the BBC website, which included this<br/>\n<br/>\n=-=-=The former chief inspector of schools in England expressed his doubts over <br/>\nthe study&#39;s findings that the youngest pupils were more unhappy in the early <br/>\nyears of school.<br/>\n<br/>\n&quot;Our current pre-occupation with happiness and well-being is stupid and is <br/>\nlikely to lead to further under-achievement because real learning involves <br/>\nchallenge, difficulty and unhappiness.&quot;<br/>\n<br/>\nUnhappiness is part and parcel of the learning experience, he says.<br/>\n<br/>\n&quot;I don&#39;t want kids to be desperately miserable but we don&#39;t want them to be <br/>\ncomplacent and self-satisfied all the time. If kids are always completely <br/>\nconfident and comfortable, they aren&#39;t going to make much progress.&quot;=-=-=<br/>\n<br/>\n(<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.bbc.co.uk/news/magazine-15490760)\">http://www.bbc.co.uk/news/magazine-15490760)</a><br/>\n<br/>\nThis view is so deeply entrenched in our culture (certainly here in the UK) that <br/>\nI believe it can be one of the biggest barriers to unschooling. I was often <br/>\n(still am) told that unless I made things hard for my children they wouldn&#39;t <br/>\nlearn anything. A teacher I knew told me that I should face their school-desks <br/>\n(school-desks?!?) against a wall because otherwise they would be able to see all <br/>\nthe fun things they could be doing instead.  I really struggled at first with <br/>\nthe idea that supporting their happiness was a disservice to them. How happy I <br/>\nam that I continued to read on lists such as this. <br/>\n<br/>\n<br/>\nAlison DS1(9) and DS2(6)<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n------------------------------------<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[{"url":"http://www.youtube.com/embed/3xQmJ_vxHB4?wmode=opaque","type":"VIDEO"}]},{"userId":291337950,"authorName":"alma","from":"&quot;alma&quot; &lt;almadoing@...&gt;","profile":"almadoing","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Unhappiness necessary for learning!!","postDate":"1320309930","msgId":63671,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo4dGtiYStwaGppQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":63673,"prevInTime":63670,"nextInTime":63672,"topicId":63671,"numMessagesInTopic":0,"msgSnippet":"I was shocked to read an article on the BBC website, which included this =-=-=The former chief inspector of schools in England expressed his doubts over the","messageBody":"<div id=\"ygrps-yiv-1918160201\">I was shocked to read an article on the BBC website, which included this<br/>\n<br/>\n=-=-=The former chief inspector of schools in England expressed his doubts over the study&#39;s findings that the youngest pupils were more unhappy in the early years of school.<br/>\n<br/>\n&quot;Our current pre-occupation with happiness and well-being is stupid and is likely to lead to further under-achievement because real learning involves challenge, difficulty and unhappiness.&quot;<br/>\n<br/>\nUnhappiness is part and parcel of the learning experience, he says.<br/>\n<br/>\n&quot;I don&#39;t want kids to be desperately miserable but we don&#39;t want them to be complacent and self-satisfied all the time. If kids are always completely confident and comfortable, they aren&#39;t going to make much progress.&quot;=-=-=<br/>\n<br/>\n(<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.bbc.co.uk/news/magazine-15490760)\">http://www.bbc.co.uk/news/magazine-15490760)</a><br/>\n<br/>\nThis view is so deeply entrenched in our culture (certainly here in the UK) that I believe it can be one of the biggest barriers to unschooling. I was often (still am) told that unless I made things hard for my children they wouldn&#39;t learn anything. A teacher I knew told me that I should face their school-desks (school-desks?!?) against a wall because otherwise they would be able to see all the fun things they could be doing instead.  I really struggled at first with the idea that supporting their happiness was a disservice to them. How happy I am that I continued to read on lists such as this. <br/>\n<br/>\nAlison DS1(9) and DS2(6)</div>","specialLinks":[]}],"prevTopicId":63513,"nextTopicId":63681}}