{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":17,"messages":[{"userId":0,"authorName":"The Mowery Family","from":"&quot;The Mowery Family&quot; &lt;jkkddmowery@...&gt;","replyTo":"LIST","senderId":"fQCsGJWIPMCK8cXzdij1R6WeI3qB5T5SIYoXwK7-YmCFmSDhGhRdvFoLzd71zaRpnKm7A9Os02vXLfNxzPKFBSbdaf0V2BHstFPdLLeRF61amHkxLkzO","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Being yourself","postDate":"952300743","msgId":6974,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDcwMWJmODZmZSRjYjNjMzkwMCQ0Y2I2YWVjN0BvZW1jb21wdXRlcj4="},"prevInTopic":6957,"nextInTopic":0,"prevInTime":6973,"nextInTime":6976,"topicId":6897,"numMessagesInTopic":0,"msgSnippet":"... full time mom I need even more than ever, even though I am still several years till thirty.","messageBody":"<div id=\"ygrps-yiv-1165015047\"><blockquote><span title=\"ireply\">&gt;&gt;I have NEVER been able to function well on little sleep.  Now that I am a<br/>\n </span></blockquote>full time mom I need even more than ever, even though I am still several<br/>\nyears till thirty.&lt;&lt;&lt;<br/>\n<br/>\n<br/>\n<br/>\nME NEITHER!!  And thankfully I have a four year old that still naps.  My<br/>\nentire 31yrs, I have required A LOT of sleep, if I don&#39;t get it, I am hell<br/>\non wheels.  I am cranky, crotchety, the whole nine yards.  Thankfully, as I<br/>\nhave gotten older, If I do not get enough, I can not get some, then catch up<br/>\nlater.  Fortunately, my beloved is a early bird, and I get to sleep in on<br/>\nweekends and even take NAPS.<br/>\n<br/>\nWhen Dana was teeney, I have no idea how I worked full time, nursed and and<br/>\ndid what I had to do.  My dear hubby worked SEVEN days a week then(7pm til<br/>\n8am - for 16 months) so that DanaBeth would not have to go to daycare(I had<br/>\nto work cause I had the health insurance).  God love the little kid, she go<br/>\nto bed with me at ten -- I would bring her in bed with me, starting at<br/>\n7weeks when I returned to work, put her in the crook of my arm, turn off the<br/>\nlight and tell her it was sleepy-ni-night-time and she would rest her little<br/>\nfingers on my face and fall fast asleep till we had to start our day at 6ish<br/>\nam.  We would get up, I would feed her (she wasn&#39;t nursing then - I pumped<br/>\ntwice a day - I think I set Guinness records for breastmilk production), go<br/>\nto sleep, my Daddy would drive 45 min so she wouldn&#39;t have to go to daycare,<br/>\nand watch her for 2 hours till Joey got home,  Joey would feed her, she<br/>\nwould sleep for 2 hours, awake for 2, sleep 2, so on.  I have no idea how we<br/>\nmade it through that year plus.  Long story short, I think we(my family) are<br/>\nmaking up for lost time with our sleep.<br/>\n<br/>\nThanks for listening, the trip down memory lane was touching for me.  How<br/>\neasily we forget how time quickly passes.  I think I will go snuggle with my<br/>\ngirl, her hands are getting so big.<br/>\n<br/>\nWarmly,<br/>\n<br/>\nKaren Mowery<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mi-unschoolers@onelist.com\">mi-unschoolers@onelist.com</a></div>","specialLinks":[]},{"userId":0,"authorName":"Nanci and Thomas Kuykendall","from":"&quot;Nanci and Thomas Kuykendall&quot; &lt;tn-k4of5@...&gt;","replyTo":"LIST","senderId":"oz5OdTWyuITfobDtj4BCYnlaN-gnUpCnMXdTUZ51piIyflVGUkQ7rFIASVvD8vBBWRGEcDGX2hbd0V96i8kir28YVlFuHrJh09ewZ6lGHwltKGIvT7KUHGX-GcY3cA","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Re: [Unschooling-dotcom] Being yourself","postDate":"952292427","msgId":6957,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDAwMzA1MjE0MC5OQUEzMTU2OUBtYWlsMjAuYmlnbWFpbGJveC5jb20+"},"prevInTopic":6956,"nextInTopic":6974,"prevInTime":6956,"nextInTime":6958,"topicId":6897,"numMessagesInTopic":0,"msgSnippet":"My parents didn t adopt me until my mom was 30 and my ... I can relate so well to this Amy.  When my parents married, they were both divorced and blending","messageBody":"<div id=\"ygrps-yiv-1301522749\">My parents didn&#39;t adopt me until my mom was 30 and my<br/>\n<blockquote><span title=\"ireply\"> &gt;dad was 47. 30 years ago this was almost unheard of. All of my friends were<br/>\n&gt;products of parents that had had them in their early 20&#39;s if not sooner. I<br/>\n&gt;always felt out of place. I then went on to marry @ 22 and have my babies @<br/>\n&gt;23, 26, & 28. Now  I feel out of place for being a young mom. I guess when<br/>\n&gt;it comes to society, you can&#39;t win for loosin&#39;.<br/>\n&gt;Amy Worthen<br/>\n<br/>\n </span></blockquote>I can relate so well to this Amy.  When my parents married, they were both divorced and blending their families.  They did not have my brother and I (their last) until they were in their late 30&#39;s (Mom) and mid 40&#39;s (Dad.)  I often wonder why they bothered (yes we were intentional) as I know now that we were an annoyance and a burden to them.  I think they only had us as trophy children, to cement their marriage for themselves and others (espeically the ex&#39;s.)<br/>\n<br/>\nMy elder siblings had children later (mid 30&#39;s) and I went on to get married at 22 and have my children at 23 and 24.  They don&#39;t talk to me much, but from the comments I got from them early on I know they don&#39;t approve.  My brother (the closest in age to me) married 3 weeks after I did and has two girls VERY close in age to my two boys.  He is the one that I am still the closest to, despite two states in between us.<br/>\n<br/>\nNanci K.<br/>\n<br/>\n<br/>\n------------------------------------------------------------<br/>\nShow off your pagan (and Idaho) pride, get Idaho Pagan Mail today!<br/>\nSign up at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.idahopagan.com/mail.html\">http://www.idahopagan.com/mail.html</a></div>","specialLinks":[]},{"userId":0,"authorName":"Nanci and Thomas Kuykendall","from":"&quot;Nanci and Thomas Kuykendall&quot; &lt;tn-k4of5@...&gt;","replyTo":"LIST","senderId":"j3YsLMyMyZniHhx737GrgdBahoR1fS0k7LB4UzpXJtb8jMIIh9saSgE8cdEqXrtrWEr3ecomahZ2mLjANpvcWyl68OZeL4RG1vjGSGZulcQGyVEsA188Jf7TAEDQYw","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: Re: [Unschooling-dotcom] Being yourself","postDate":"952291962","msgId":6956,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDAwMzA1MjEzMi5OQUEzMDk0NkBtYWlsMjAuYmlnbWFpbGJveC5jb20+"},"prevInTopic":6954,"nextInTopic":6957,"prevInTime":6955,"nextInTime":6957,"topicId":6897,"numMessagesInTopic":0,"msgSnippet":"... I have had to do this all my life.  In a way my parent s neglect was a training ground for me about being true to myself and being in charge of my own","messageBody":"<div id=\"ygrps-yiv-656370661\"><blockquote><span title=\"ireply\">&gt;i am glad i waited on one hand because i&#39;m more patient (which for me was a major huddle:) and i&#39;m more resilient to external pressures.  that is i can draw boundaries and stick to them a bit better and am not so easily made to feel guilty.  but this was my weakness and i&#39;m sure it is not true of younger people in general. <br/>\n<br/>\n </span></blockquote>I have had to do this all my life.  In a way my parent&#39;s neglect was a training ground for me about being true to myself and being in charge of my own life.  Right from the very begining I have made decsions and headed in directions with parenting that has alienated me from &quot;friends&quot; and family.<br/>\n<br/>\n on the other hand i think having kids younger has<br/>\n<blockquote><span title=\"ireply\"> &gt;great advantages.   for example in my early 20&#39;s 4 to 5 hours sleep on average punctuated by an &#39;all night&#39; was do-able.  <br/>\n<br/>\n </span></blockquote>I have NEVER been able to function well on little sleep.  Now that I am a full time mom I need even more than ever, even though I am still several years till thirty.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;i think child rearing is a more instinctive thing and age has little &gt;if anything to do with it.  other than patience i think the only &gt;real change in my understands and perspective on parenting is that &gt;i&#39;m more articulate<br/>\n<br/>\n </span></blockquote>Thank you Susan, that&#39;s beautiful, and describes just how I feel about motherhood, or any station in life.  You are what you are and age has very little to do with it at all.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;because we, as a society, ignore and trivialize the thoughts of those<br/>\n&gt;younger than us and this is a great lost because wisdom is wisdom no &gt;matter how small or young the person speaking it is.<br/>\n<br/>\n </span></blockquote>I SO agree, and I take children&#39;s concerns very seriously for the same reasons of being ignored and disrespected as a child, which is so baseless and unfair.  Children have so much to give, and they give it freely and without thought of any payment other than your attention and kindness and recognition.  We are the ignorant ones if we ignore them.<br/>\n<br/>\nNanci K.<br/>\n<br/>\n<br/>\n------------------------------------------------------------<br/>\nShow off your pagan (and Idaho) pride, get Idaho Pagan Mail today!<br/>\nSign up at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.idahopagan.com/mail.html\">http://www.idahopagan.com/mail.html</a></div>","specialLinks":[]},{"userId":0,"authorName":"Lynda","from":"&quot;Lynda&quot; &lt;lurine@...&gt;","replyTo":"LIST","senderId":"dPWAr2c-Y2WEqrTVGBcOaZ_Lo3Txnw4MXHMxMLcIsSfkgv0sPc71V2v3KcTG4HrrubCEkjw0Z4aS1hs9kMDkiralzg","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Being yourself","postDate":"952285054","msgId":6953,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDAwMzA1MTk1OC5MQUExMTgzNEBzbTAxMDEucHJvbWVkaWEubmV0Pg=="},"prevInTopic":6952,"nextInTopic":6954,"prevInTime":6952,"nextInTime":6954,"topicId":6897,"numMessagesInTopic":0,"msgSnippet":"Truer words were never spoken and I have been staying out of the discussion because it is soooo age biased!  It is simple, some folks are born old and boring","messageBody":"<div id=\"ygrps-yiv-2095720164\">Truer words were never spoken and I have been staying out of the discussion<br/>\nbecause it is soooo age biased!  It is simple, some folks are born old and<br/>\nboring and tired.  Some folks never grow up and there are a whole variety<br/>\ninbetween!  Nobody parents all their kids the same.  No two 20 year old, no<br/>\ntwo 30 year olds and no two 40 year olds parent the same and they won&#39;t<br/>\nparent the 2nd, 3rd or umpteenth kid the same as the first one.  Some folks<br/>\nare watchers, some are doers.<br/>\n<br/>\nI &quot;acquired&quot; 5 kids when I was 19.  Instant parenthood because my sil was<br/>\nhospitalized.  It was also instant intro to unschooling because the kids<br/>\nwere on overload and I figured they had enough on their plates without<br/>\nschool.  Of course, I didn&#39;t have a clue that what we were doing was<br/>\nunschooling.<br/>\n<br/>\nMy first kidlet was born when I was 22, last one when I was 36.  Each was<br/>\ndifferent and the parenting combined their individuality with my<br/>\npersonality.  Age never had anything to do with it.  I&#39;m OAD now and the<br/>\nkidlets and I are still doing lots of things together including lifting<br/>\nweights, roller blading and bicycling.<br/>\n<br/>\nLynda<br/>\n<br/>\n<br/>\n----------<br/>\n<blockquote><span title=\"ireply\"> &gt; From: Shannon CC &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:shannoncc@...\">shannoncc@...</a>&gt;<br/>\n&gt; <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:cunian@...\">cunian@...</a> wrote:<br/>\n&gt; &gt; But my mom did a great job, and I remember loving that she would play<br/>\n </span></blockquote>tag<br/>\n<blockquote><span title=\"qreply\"> &gt; &gt; with me and stuff when the other mothers wouldn&#39;t.  <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; I&#39;m not addressing you directly, Karen, but addressing this idea. I&#39;ve<br/>\n&gt; seen many people say how great it is to be (or have) a younger mom<br/>\n&gt; because you&#39;re &quot;willing&quot; to play with the kids and I have to speak up on<br/>\n&gt; this. It&#39;s attitude not age! Yes, there are many older moms who do not<br/>\n&gt; like to play tag, color, etc with their kids, but I bet it&#39;s not their<br/>\n&gt; age, it&#39;s them. My mom had me at 21, and she certainly didn&#39;t ever play<br/>\n&gt; tag (or much of anything else) with us. I had mine at 29 and while she<br/>\n&gt; is not yet old enuf to play tag per se, I already chase her around the<br/>\n&gt; house and roll around on the floor with her. <br/>\n&gt; <br/>\n&gt; Ok, true, my knees are not what they used to be, but IMO it&#39;s worth the<br/>\n&gt; pain to give her a happy childhood. I&#39;m constantly kneeling down to be<br/>\n&gt; at her level all day long, ignoring the creaking in my knees (and by the<br/>\n&gt; way, they started to give out in my early 20&#39;s, so having a child<br/>\n&gt; younger would not have made much of a difference). <br/>\n&gt; <br/>\n&gt; I also often hear people talk about &quot;first time moms&quot; (of any age) and<br/>\n&gt; how they don&#39;t know anything and are too uptight. I always stand up for<br/>\n&gt; myself when I hear that because I think I&#39;m pretty laid back. Maybe it&#39;s<br/>\n&gt; because I&#39;m of an unschooling mindset, but I let Bridget do all sorts of<br/>\n&gt; things. Last night I lay a blanket on the kitchen floor, put down a pot,<br/>\n&gt; and let her splash water all over (the blanket was to soak up the water<br/>\n&gt; so she wouldn&#39;t slip). When you give dd something in a cup, she likes to<br/>\n&gt; drink some and then pour the rest on the floor. Dh says I should just<br/>\n&gt; give her sippy cups (with the lids). Why? It&#39;s easy enuf to clean up,<br/>\n&gt; the carpet is old anyway, and this way she is learning, exploring,<br/>\n&gt; playing and having fun :-)<br/>\n&gt; <br/>\n&gt; My whole point is, people are who they are for many different reasons.<br/>\n&gt; You can&#39;t make sweeping generalizations based on age (or how long you&#39;ve<br/>\n&gt; been parenting). Yes, some of us are more confident and patient because<br/>\n&gt; we&#39;re older, but some were already confident and patient when they were<br/>\n&gt; young. Some moms will play with their kids no matter what their age, and<br/>\n&gt; some won&#39;t, no matter how young they are. Some people loosen up as the<br/>\n&gt; parenting years go by, some are pretty laid back from day one. <br/>\n&gt; <br/>\n&gt; So anyway, that&#39;s MO :-)<br/>\n&gt; <br/>\n&gt; Shannon, Mom to Bridget (Oct.8.98)<br/>\n&gt; <br/>\n&gt; ------------------------------------------------------------------------<br/>\n&gt; PERFORM CPR ON YOUR APR!<br/>\n&gt; Get a NextCard Visa, in 30 seconds!  Get rates as low as <br/>\n&gt; 0.0% Intro or 9.9% Fixed APR and no hidden fees.<br/>\n&gt; Apply NOW!<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://click.egroups.com/1/2121/5/_/448294/_/952271544/\">http://click.egroups.com/1/2121/5/_/448294/_/952271544/</a><br/>\n&gt; ------------------------------------------------------------------------<br/>\n&gt; <br/>\n&gt; Message boards, timely articles, a free newsletter and more!<br/>\n&gt; Check it all out at: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":0,"authorName":"Michelle Bennett","from":"&quot;Michelle Bennett&quot; &lt;mlb_2boymom@...&gt;","replyTo":"LIST","senderId":"Eb0YWRCTLPV57y4dPHF96r4i8_En3JrffIKW2ZUHSDm-pvwWxPMkM1rGS_LAS5TGI63tQc6e4X8lVfeKmL6UvvR7GMtADI4QMlVNpOFCHSgbJGQ","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Being yourself","postDate":"952282472","msgId":6952,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDAwMzA1MTg1NDMyLjM5ODc1LnFtYWlsQGhvdG1haWwuY29tPg=="},"prevInTopic":6945,"nextInTopic":6953,"prevInTime":6951,"nextInTime":6953,"topicId":6897,"numMessagesInTopic":0,"msgSnippet":"I second that, Shannon!!!! All mothers and children are important and special no matter what their age!  Perhaps the people who make comments or give you","messageBody":"<div id=\"ygrps-yiv-2079363425\">I second that, Shannon!!!! All mothers and children are important and <br/>\nspecial no matter what their age!  Perhaps the people who make comments or <br/>\ngive you strange looks are not people that one should be concerned about <br/>\nwhat they think?  Perhaps they would be lousy parents?  Or are?  Don&#39;t judge <br/>\nanother until you have walked a mile in their shoes I say!!! I agree that I <br/>\nhave had more patience and money than I did when I was younger, but there <br/>\nhave been nights when I have fell into bed so exhausted and thought, &quot;If <br/>\nonly I had had children at a younger age, I would have had more energy for <br/>\nthem!&quot;  There are pros and cons both ways.  I also hear the time clock <br/>\nticking for more children where as it would have been different if I had <br/>\nbegun at a younger age.  It&#39;s a toss up!<br/>\n<br/>\nMichelle<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;From: Shannon CC &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:shannoncc@...\">shannoncc@...</a>&gt;<br/>\n&gt;Reply-To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@onelist.com\">Unschooling-dotcom@onelist.com</a><br/>\n&gt;To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@onelist.com\">Unschooling-dotcom@onelist.com</a><br/>\n&gt;Subject: Re: [Unschooling-dotcom] Being yourself<br/>\n&gt;Date: Sat, 04 Mar 2000 23:48:16 -0500<br/>\n&gt;<br/>\n&gt;Nanci and Thomas Kuykendall wrote:<br/>\n&gt; &gt; What is the deal with this current trend with older mothers?  It does <br/>\n&gt;not necessarily mean that one is a better parent or more intelligent or <br/>\n&gt;experienced in the realm of child rearing, or even (the usual stated <br/>\n&gt;reason) that one is better off financially.  I get so sick and tired of <br/>\n&gt;people treating me like I asm somehow less intelligent or less worthy <br/>\n&gt;because I am younger.<br/>\n&gt; &gt; Nanci K.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;LOL! Hey! Nothing wrong with being an &quot;older&quot; mother either you know! I<br/>\n&gt;think as long as you are a good mother, and are happy being a mother, it<br/>\n&gt;shouldn&#39;t matter how old (or not old) you are. There are bad mothers of<br/>\n&gt;all ages. I would never judge someone as a mother simply because of<br/>\n&gt;their age.<br/>\n&gt;<br/>\n&gt;Personally tho, I am glad I waited. I&#39;m not that much &quot;older&quot;, but I was<br/>\n&gt;29 when I had my baby (my first so far). No, I was not more intelligent,<br/>\n&gt;or more experienced with children (tho I was better off financially) but<br/>\n&gt;most important *for me* is that I was more sure of myself and more<br/>\n&gt;patient then I was in my early 20&#39;s or teens. I would have made an<br/>\n&gt;awful, awful mother in my teens. But that is ME and no one else.<br/>\n&gt;<br/>\n&gt;Anyway, just standing up for us old fogies :-) My friends are actually a<br/>\n&gt;mixed bag. I have some who waited, some who wanted kids early but had<br/>\n&gt;problems and finally had them in their 30&#39;s and some who had them young.<br/>\n&gt;And some of them are better mother&#39;s than others, but I can honestly say<br/>\n&gt;it seems to have nothing to do with age.<br/>\n&gt;<br/>\n&gt;JMO, Shannon<br/>\n<br/>\n </span></blockquote>______________________________________________________<br/>\nGet Your Private, Free Email at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.hotmail.com\">http://www.hotmail.com</a></div>","specialLinks":[]},{"userId":0,"authorName":"Shannon CC","from":"Shannon CC &lt;shannoncc@...&gt;","replyTo":"LIST","senderId":"rngiQc-nkZGxMnd7raA6eR0rnfCjhyelBNuGR0lMzeqFH-HKrC2xRyVUC2yHGLkww-IJ-FT1NqZILgFSQqZtzyj07i2M6g","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Being yourself","postDate":"952271468","msgId":6945,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM4QzI4MjZDLjU5MkRGOTk1QGhvbWUuY29tPg==","referencesHeader":"PDM2LjJlNmIxZTQuMjVmM2JlNTVAYW9sLmNvbT4="},"prevInTopic":6941,"nextInTopic":6952,"prevInTime":6944,"nextInTime":6946,"topicId":6897,"numMessagesInTopic":0,"msgSnippet":"... I m not addressing you directly, Karen, but addressing this idea. I ve seen many people say how great it is to be (or have) a younger mom because you re","messageBody":"<div id=\"ygrps-yiv-752161268\"><a rel=\"nofollow\" target=\"_blank\" href=\"mailto:cunian@...\">cunian@...</a> wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; But my mom did a great job, and I remember loving that she would play tag<br/>\n&gt; with me and stuff when the other mothers wouldn&#39;t.  <br/>\n<br/>\n<br/>\n </span></blockquote>I&#39;m not addressing you directly, Karen, but addressing this idea. I&#39;ve<br/>\nseen many people say how great it is to be (or have) a younger mom<br/>\nbecause you&#39;re &quot;willing&quot; to play with the kids and I have to speak up on<br/>\nthis. It&#39;s attitude not age! Yes, there are many older moms who do not<br/>\nlike to play tag, color, etc with their kids, but I bet it&#39;s not their<br/>\nage, it&#39;s them. My mom had me at 21, and she certainly didn&#39;t ever play<br/>\ntag (or much of anything else) with us. I had mine at 29 and while she<br/>\nis not yet old enuf to play tag per se, I already chase her around the<br/>\nhouse and roll around on the floor with her. <br/>\n<br/>\nOk, true, my knees are not what they used to be, but IMO it&#39;s worth the<br/>\npain to give her a happy childhood. I&#39;m constantly kneeling down to be<br/>\nat her level all day long, ignoring the creaking in my knees (and by the<br/>\nway, they started to give out in my early 20&#39;s, so having a child<br/>\nyounger would not have made much of a difference). <br/>\n<br/>\nI also often hear people talk about &quot;first time moms&quot; (of any age) and<br/>\nhow they don&#39;t know anything and are too uptight. I always stand up for<br/>\nmyself when I hear that because I think I&#39;m pretty laid back. Maybe it&#39;s<br/>\nbecause I&#39;m of an unschooling mindset, but I let Bridget do all sorts of<br/>\nthings. Last night I lay a blanket on the kitchen floor, put down a pot,<br/>\nand let her splash water all over (the blanket was to soak up the water<br/>\nso she wouldn&#39;t slip). When you give dd something in a cup, she likes to<br/>\ndrink some and then pour the rest on the floor. Dh says I should just<br/>\ngive her sippy cups (with the lids). Why? It&#39;s easy enuf to clean up,<br/>\nthe carpet is old anyway, and this way she is learning, exploring,<br/>\nplaying and having fun :-)<br/>\n<br/>\nMy whole point is, people are who they are for many different reasons.<br/>\nYou can&#39;t make sweeping generalizations based on age (or how long you&#39;ve<br/>\nbeen parenting). Yes, some of us are more confident and patient because<br/>\nwe&#39;re older, but some were already confident and patient when they were<br/>\nyoung. Some moms will play with their kids no matter what their age, and<br/>\nsome won&#39;t, no matter how young they are. Some people loosen up as the<br/>\nparenting years go by, some are pretty laid back from day one. <br/>\n<br/>\nSo anyway, that&#39;s MO :-)<br/>\n<br/>\nShannon, Mom to Bridget (Oct.8.98)</div>","specialLinks":[]},{"userId":0,"authorName":"cunian@aol.com","from":"cunian@...","replyTo":"LIST","senderId":"4U8QiXIj2DOlmQfdgGELuThDvEOfAAQ3DhnVUaf47i1B02pgITsXSR5Vf-5LcWGjHgfeZeM","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Being yourself","postDate":"952263765","msgId":6941,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM2LjJlNmIxZTQuMjVmM2JlNTVAYW9sLmNvbT4="},"prevInTopic":6940,"nextInTopic":6945,"prevInTime":6940,"nextInTime":6942,"topicId":6897,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-193661414\">&lt;&lt; Nanci,<br/>\n          I couldn&#39;t help but chuckle when I read what you wrote about the<br/>\n old maid at 17 thing. My parents didn&#39;t adopt me until my mom was 30 and my<br/>\n dad was 47. 30 years ago this was almost unheard of. All of my friends were<br/>\n products of parents that had had them in their early 20&#39;s if not sooner. I<br/>\n always felt out of place. I then went on to marry @ 22 and have my babies @<br/>\n 23, 26, & 28. Now  I feel out of place for being a young mom. I guess when<br/>\n it comes to society, you can&#39;t win for loosin&#39;.<br/>\n Amy Worthen &gt;&gt;<br/>\n<br/>\n    And I have kind of the opposite.  My mom had me when she was 17.  Because <br/>\nshe started in on the sex ed lectures when I was 12 and had 2 more children <br/>\nwhile I was a teenager, I wanted nothing to do with children for a long time. <br/>\n I had my first pretty much right by the biological clock with my friends - <br/>\n29 - but then all those friends I thought I&#39;d be raising my children with <br/>\nwent the daycare route and have very different attitudes about almost <br/>\neverything regarding children.  So, here I am.  <br/>\n    But my mom did a great job, and I remember loving that she would play tag <br/>\nwith me and stuff when the other mothers wouldn&#39;t.  And getting to go to <br/>\ncollege with her sometimes and color in the corner.  And bragging to friends <br/>\nin 6th grade that I could still trust MY mom cause she wasn&#39;t 30 yet.  <br/>\n<br/>\nKaren, (with Helen, 7, Agent of Chaos, and Gordon, 4, Agent of Destruction)</div>","specialLinks":[]},{"userId":0,"authorName":"K WORTHEN","from":"&quot;K WORTHEN&quot; &lt;kworthen@...&gt;","replyTo":"LIST","senderId":"07bTQ_9XZs95CWjjE2wjOrUXLQlWqGa_0nqsBU_icGajEQpXwyGpzdsgS85x7d19TAcjIAcGtUNhH6TZLH6V2JtOleUJ9SfLA_A","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Re: [Unschooling-dotcom] Being yourself","postDate":"952262856","msgId":6940,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMWQwMWJmODZhNiQ5MzAyZjE4MCQwMWE1ODAxOEBuZS5tZWRpYW9uZS5uZXQ+","referencesHeader":"PDIwMDAwMzA1MDMwNS5UQUExNTEwNkBtYWlsMTUuYmlnbWFpbGJveC5jb20+"},"prevInTopic":6939,"nextInTopic":6941,"prevInTime":6939,"nextInTime":6941,"topicId":6897,"numMessagesInTopic":0,"msgSnippet":"Nanci, I couldn t help but chuckle when I read what you wrote about the old maid at 17 thing. My parents didn t adopt me until my mom was 30 and my dad was 47.","messageBody":"<div id=\"ygrps-yiv-722995540\">Nanci,<br/>\n         I couldn&#39;t help but chuckle when I read what you wrote about the<br/>\nold maid at 17 thing. My parents didn&#39;t adopt me until my mom was 30 and my<br/>\ndad was 47. 30 years ago this was almost unheard of. All of my friends were<br/>\nproducts of parents that had had them in their early 20&#39;s if not sooner. I<br/>\nalways felt out of place. I then went on to marry @ 22 and have my babies @<br/>\n23, 26, & 28. Now  I feel out of place for being a young mom. I guess when<br/>\nit comes to society, you can&#39;t win for loosin&#39;.<br/>\nAmy Worthen<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message -----<br/>\nFrom: &quot;Nanci and Thomas Kuykendall&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:tn-k4of5@...\">tn-k4of5@...</a>&gt;<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschooling-dotcom@onelist.com\">unschooling-dotcom@onelist.com</a>&gt;<br/>\nSent: Saturday, March 04, 2000 10:05 PM<br/>\nSubject: RE: Re: [Unschooling-dotcom] Being yourself<br/>\n<br/>\n<br/>\n&gt; From: &quot;Nanci and Thomas Kuykendall&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:tn-k4of5@...\">tn-k4of5@...</a>&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &gt;I can relate. I had my now 9yo daughter when I was 19<br/>\n&gt; &gt;candice<br/>\n&gt;<br/>\n&gt; You know, there was a time when one was considered an old maid if not<br/>\nmarried off by 17 or so.  Not that I necessarily think that is what we<br/>\nSHOULD be doing, just ironic.<br/>\n&gt;<br/>\n&gt; What is the deal with this current trend with older mothers?  It does not<br/>\nnecessarily mean that one is a better parent or more intelligent or<br/>\nexperienced in the realm of child rearing, or even (the usual stated reason)<br/>\nthat one is better off financially.  I get so sick and tired of people<br/>\ntreating me like I asm somehow less intelligent or less worthy because I am<br/>\nyounger.<br/>\n&gt;<br/>\n&gt; Nanci K.<br/>\n&gt;<br/>\n&gt; ------------------------------------------------------------<br/>\n&gt; Show off your pagan (and Idaho) pride, get Idaho Pagan Mail today!<br/>\n&gt; Sign up at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.idahopagan.com/mail.html\">http://www.idahopagan.com/mail.html</a><br/>\n&gt;<br/>\n&gt; ------------------------------------------------------------------------<br/>\n&gt; DON&#39;T HATE YOUR RATE!<br/>\n&gt; Get a NextCard Visa, in 30 seconds!  Get rates as low as<br/>\n&gt; 0.0% Intro or 9.9% Fixed APR and no hidden fees.<br/>\n&gt; Apply NOW!<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://click.egroups.com/1/2120/5/_/448294/_/952225553/\">http://click.egroups.com/1/2120/5/_/448294/_/952225553/</a><br/>\n&gt; ------------------------------------------------------------------------<br/>\n&gt;<br/>\n&gt; Message boards, timely articles, a free newsletter and more!<br/>\n&gt; Check it all out at: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":0,"authorName":"libbygirl","from":"&quot;libbygirl&quot; &lt;libbygirl@...&gt;","replyTo":"LIST","senderId":"yrSGfo9QO6lLOmkHvkHUBJMcv6yZ9FTBJIPIEmIWuVHMGmwLDpLbnILzxB_Cc98MXKsdQSb79koxv4uvn3SvpMJUnH4gPfXcmQ","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Being yourself","postDate":"952244966","msgId":6939,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMmEwMWJmODY3YyRlYjljMDJjMCRjNDdkMzdkMkBsaWJieWdpcmw+"},"prevInTopic":6938,"nextInTopic":6940,"prevInTime":6938,"nextInTime":6940,"topicId":6897,"numMessagesInTopic":0,"msgSnippet":"Hi Joshua, Just a quick note - i had my first child at 25 which was considered young by my immediate family and friends and just recently had my last baby at","messageBody":"<div id=\"ygrps-yiv-225737559\">Hi Joshua,<br/>\n<br/>\nJust a quick note - i had my first child at 25 which was considered young by<br/>\nmy immediate family and friends and just recently had my last baby at 33.<br/>\n<br/>\nI actually think I was a much more conscientious mother with my first child.<br/>\nThe house had to be just-so, baby always clean and dressed prettily, me with<br/>\nmake-up on by 9am etc because I lacked any confidence at all. Therefore I<br/>\ntried extra hard to &quot;do it right&quot; For me this led to postnatal depression<br/>\nwhich was unrecognised for years as I continued to &quot;function&quot;<br/>\n<br/>\nNow with my four children at home all day, i am blissed-out of my mind and<br/>\nvery, very relaxed about housework and the girls having matching socks and<br/>\npanties etc!! (In fact if they actually get totally dressed I am pretty darn<br/>\nhappy!) So I have definitely &quot;enjoyed&quot; the two babies I had in my thirties<br/>\nso much more than the two I had in my twenties.<br/>\n<br/>\nI realise that there are many factors at work here but still I think the<br/>\n&quot;best&quot;  younger mothers I know work incredibly hard and deserve incredible<br/>\nappreciation for doing the best they can with the hardes (and potentially)<br/>\nmost rewarding job in the world!<br/>\n<br/>\nRegards,<br/>\nMichelle</div>","specialLinks":[]},{"userId":0,"authorName":"Joshua Heath","from":"&quot;Joshua Heath&quot; &lt;heathfam@...&gt;","replyTo":"LIST","senderId":"EKajRZdXKD2_prTURDi5gDW0gs-89Tjg7TY0YqxgzguTvou5IaxoVCYV5hPnTDTxUxDWEFxm4m2lDCAHmyWWYBPkaKpRwjBwN_0","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Being yourself","postDate":"952243021","msgId":6938,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDcwMWJmODY3OCQ2N2QyNWJhMCQ0ZTgzNDJkOEBKb3NoSGVhdGg+","referencesHeader":"PDIwMDAwMzA1MDMwNS5UQUExNTEwNkBtYWlsMTUuYmlnbWFpbGJveC5jb20+IDwzOEMxMDM5QS5BRDlFODI4REBmbGFzaC5uZXQ+"},"prevInTopic":6937,"nextInTopic":6939,"prevInTime":6937,"nextInTime":6939,"topicId":6897,"numMessagesInTopic":0,"msgSnippet":"on the other hand i think having kids younger has ... average punctuated by an all night was do-able.  this would not be possible now or should i say i would","messageBody":"<div id=\"ygrps-yiv-1084126937\">on the other hand i think having kids younger has<br/>\n<blockquote><span title=\"ireply\"> &gt; great advantages.   for example in my early 20&#39;s 4 to 5 hours sleep on<br/>\n </span></blockquote>average punctuated by an &#39;all night&#39; was do-able.  this would not be<br/>\npossible now or should i say i would be impossible now &lt;g&gt;.<br/>\n<br/>\nLOL, still being in my twentys, I have to make a comment here!  It the same<br/>\nthing occured to me the other day- that I DO NOT function very well as a<br/>\nparent on anything under 6 good hours of sleep, and prefer 7-8.  I remember<br/>\na time even after I had kids but was not the primary support person that I<br/>\ncould get by fine on missing the odd night entirely (working night shift)<br/>\nwithout suffering too much.  NOW.... it is so PAINFUL to go through a day at<br/>\nhome not feeling rested.  It just leads me to the conclusion that at least<br/>\nin part the difference has less to do with age, and more to do with the<br/>\nunkannily high level of energy output it requires to be the main care-giver<br/>\nfor your children at the same time as keeping the house under control, doing<br/>\nlaundry, cooking, shopping etc etc.  It is not the kind of thing where I can<br/>\njust &quot;drift&quot; through the day without trying as I have been able to do at<br/>\nmany of my prevous jobs on days when I was lacking sleep.<br/>\nAny other of the younger parents agree?<br/>\n<br/>\nJoshua</div>","specialLinks":[]},{"userId":0,"authorName":"Shannon CC","from":"Shannon CC &lt;shannoncc@...&gt;","replyTo":"LIST","senderId":"68yqa0oYeRiNfsy3GLUUww3NBTQHFEJQET9zwNuiavCM-KZHwnREGX9V0z8kXnbjkMUQ91GAQbV73xNuYXRqZZrIIcBxng","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Being yourself","postDate":"952231696","msgId":6935,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM4QzFFNzEwLkZCQkREREY5QGhvbWUuY29tPg==","referencesHeader":"PDIwMDAwMzA1MDMwNS5UQUExNTEwNkBtYWlsMTUuYmlnbWFpbGJveC5jb20+"},"prevInTopic":6934,"nextInTopic":6937,"prevInTime":6934,"nextInTime":6936,"topicId":6897,"numMessagesInTopic":0,"msgSnippet":"... LOL! Hey! Nothing wrong with being an older mother either you know! I think as long as you are a good mother, and are happy being a mother, it shouldn t","messageBody":"<div id=\"ygrps-yiv-1636794583\">Nanci and Thomas Kuykendall wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; What is the deal with this current trend with older mothers?  It does not necessarily mean that one is a better parent or more intelligent or experienced in the realm of child rearing, or even (the usual stated reason) that one is better off financially.  I get so sick and tired of people treating me like I asm somehow less intelligent or less worthy because I am younger.<br/>\n&gt; Nanci K.<br/>\n<br/>\n<br/>\n </span></blockquote>LOL! Hey! Nothing wrong with being an &quot;older&quot; mother either you know! I<br/>\nthink as long as you are a good mother, and are happy being a mother, it<br/>\nshouldn&#39;t matter how old (or not old) you are. There are bad mothers of<br/>\nall ages. I would never judge someone as a mother simply because of<br/>\ntheir age. <br/>\n<br/>\nPersonally tho, I am glad I waited. I&#39;m not that much &quot;older&quot;, but I was<br/>\n29 when I had my baby (my first so far). No, I was not more intelligent,<br/>\nor more experienced with children (tho I was better off financially) but<br/>\nmost important *for me* is that I was more sure of myself and more<br/>\npatient then I was in my early 20&#39;s or teens. I would have made an<br/>\nawful, awful mother in my teens. But that is ME and no one else. <br/>\n<br/>\nAnyway, just standing up for us old fogies :-) My friends are actually a<br/>\nmixed bag. I have some who waited, some who wanted kids early but had<br/>\nproblems and finally had them in their 30&#39;s and some who had them young.<br/>\nAnd some of them are better mother&#39;s than others, but I can honestly say<br/>\nit seems to have nothing to do with age. <br/>\n<br/>\nJMO, Shannon</div>","specialLinks":[]},{"userId":0,"authorName":"Nanci and Thomas Kuykendall","from":"&quot;Nanci and Thomas Kuykendall&quot; &lt;tn-k4of5@...&gt;","replyTo":"LIST","senderId":"SjIlVSczBPEegp7noXtaCMZgP8ytHaNOUZqdbLDqU-dch57vZG8N1-zAJ2gI16HhkoHL4GOXJtmQA77q0AgMiDZoOVDtXeJ9WDqmdMeR06CQsE9lxXZooOVft1ltRg","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: Re: [Unschooling-dotcom] Being yourself","postDate":"952225552","msgId":6934,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDAwMzA1MDMwNS5UQUExNTEwNkBtYWlsMTUuYmlnbWFpbGJveC5jb20+"},"prevInTopic":6920,"nextInTopic":6935,"prevInTime":6933,"nextInTime":6935,"topicId":6897,"numMessagesInTopic":0,"msgSnippet":"... You know, there was a time when one was considered an old maid if not married off by 17 or so.  Not that I necessarily think that is what we SHOULD be","messageBody":"<div id=\"ygrps-yiv-188146340\"><blockquote><span title=\"ireply\">&gt;I can relate. I had my now 9yo daughter when I was 19<br/>\n&gt;candice<br/>\n<br/>\n </span></blockquote>You know, there was a time when one was considered an old maid if not married off by 17 or so.  Not that I necessarily think that is what we SHOULD be doing, just ironic.<br/>\n<br/>\nWhat is the deal with this current trend with older mothers?  It does not necessarily mean that one is a better parent or more intelligent or experienced in the realm of child rearing, or even (the usual stated reason) that one is better off financially.  I get so sick and tired of people treating me like I asm somehow less intelligent or less worthy because I am younger.<br/>\n<br/>\nNanci K.<br/>\n<br/>\n------------------------------------------------------------<br/>\nShow off your pagan (and Idaho) pride, get Idaho Pagan Mail today!<br/>\nSign up at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.idahopagan.com/mail.html\">http://www.idahopagan.com/mail.html</a></div>","specialLinks":[]},{"userId":0,"authorName":"susan","from":"susan &lt;fxfireob@...&gt;","replyTo":"LIST","senderId":"5SbBrUQ3Vm5EcRbL1Q5tlGS5JM_Bkffr2J8NFsrVD6pDLQFMmjaFqXD015R-PpP-rNXxEKiv5Nzyjq6PTPFgupQ","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Being yourself","postDate":"952222486","msgId":6954,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM4QzFDMzE0LjE3ODdEQTc1QGZsYXNoLm5ldD4=","referencesHeader":"PDIwMDAwMzA1MDMwNS5UQUExNTEwNkBtYWlsMTUuYmlnbWFpbGJveC5jb20+IDwzOEMxMDM5QS5BRDlFODI4REBmbGFzaC5uZXQ+IDwwMDA3MDFiZjg2NzgkNjdkMjViYTAkNGU4MzQyZDhASm9zaEhlYXRoPg=="},"prevInTopic":6953,"nextInTopic":6956,"prevInTime":6953,"nextInTime":6955,"topicId":6897,"numMessagesInTopic":0,"msgSnippet":"well it s nice to know it s not my age that is at issue - just the reality of being the primary parent:) -susan","messageBody":"<div id=\"ygrps-yiv-854622824\">well it&#39;s nice to know it&#39;s not my age that is at issue - just the reality of<br/>\nbeing the primary parent:)<br/>\n-susan<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; LOL, still being in my twentys, I have to make a comment here!  It the same<br/>\n&gt; thing occured to me the other day- that I DO NOT function very well as a<br/>\n&gt; parent on anything under 6 good hours of sleep, and prefer 7-8.  I remember<br/>\n&gt; a time even after I had kids but was not the primary support person that I<br/>\n&gt; could get by fine on missing the odd night entirely (working night shift)<br/>\n&gt; without suffering too much.  NOW.... it is so PAINFUL to go through a day at<br/>\n&gt; home not feeling rested.  It just leads me to the conclusion that at least<br/>\n&gt; in part the difference has less to do with age, and more to do with the<br/>\n&gt; unkannily high level of energy output it requires to be the main care-giver<br/>\n&gt; for your children at the same time as keeping the house under control, doing<br/>\n&gt; laundry, cooking, shopping etc etc.  It is not the kind of thing where I can<br/>\n&gt; just &quot;drift&quot; through the day without trying as I have been able to do at<br/>\n&gt; many of my prevous jobs on days when I was lacking sleep.<br/>\n&gt; Any other of the younger parents agree?<br/>\n&gt;<br/>\n&gt; Joshua<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":0,"authorName":"susan","from":"susan &lt;fxfireob@...&gt;","replyTo":"LIST","senderId":"SLAl4r5mUIuqRk0xXzWo4BJ12aPnD_4SGJkG_1mfezhEIbAiOAkf5UzBocnsS3EFNR2T21kLiTTEL9cyJg3v9-0","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Being yourself","postDate":"952173473","msgId":6937,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM4QzEwMzlBLkFEOUU4MjhEQGZsYXNoLm5ldD4=","referencesHeader":"PDIwMDAwMzA1MDMwNS5UQUExNTEwNkBtYWlsMTUuYmlnbWFpbGJveC5jb20+"},"prevInTopic":6935,"nextInTopic":6938,"prevInTime":6936,"nextInTime":6938,"topicId":6897,"numMessagesInTopic":0,"msgSnippet":"hi, i was 36 when i had rene i m now 40 .  we were not financially better off, as you said was the most common reason for waiting, in fact neither of us were","messageBody":"<div id=\"ygrps-yiv-1476922096\">hi,<br/>\n<br/>\ni was 36 when i had rene&#39; i&#39;m now 40 .  we were not financially better off, as you said was the most common reason for waiting, in fact neither of us were employed at the time and the only money we had was a little stock my grandparents had given me many years before.  why did i wait?  because i had made some really bad choices in men prior to meeting my husband and really<br/>\ncouldn&#39;t see being happy in either of those relationships.  i didn&#39;t want children without the hope of happiness, though this was more of an unconscious thought at the time - you know you do things without really knowing why but you know you have to do it.<br/>\n<br/>\ni am glad i waited on one hand because i&#39;m more patient (which for me was a major huddle:) and i&#39;m more resilient to external pressures.  that is i can draw boundaries and stick to them a bit better and am not so easily made to feel guilty.  but this was my weakness and i&#39;m sure it is not true of younger people in general.  on the other hand i think having kids younger has<br/>\ngreat advantages.   for example in my early 20&#39;s 4 to 5 hours sleep on average punctuated by an &#39;all night&#39; was do-able.  this would not be possible now or should i say i would be impossible now &lt;g&gt;.<br/>\n<br/>\ni think child rearing is a more instinctive thing and age has little if anything to do with it.  other than patience i think the only real change in my understands and perspective on parenting is that i&#39;m more articulate.   i read books by holt and pearce in my early 20&#39;s, some 10 to 15 years before have a kid.   i&#39;m not sure why i read these books i just did,  i still<br/>\nmaintain the beliefs i had then but now i could probable write a reach paper and back up my opinions with the writing of others.<br/>\n<br/>\nanyway i know what you&#39;re saying my sister- in-law would fit the picture you described.   one of the down sides about waiting (other than the biological clock/gentic thing) is that people don&#39;t really respect you and treat you as if you are not normal or are lacking some &#39;hormone&#39; or emotion or something because you don&#39;t have kids.  so this just leads me to the conclusion<br/>\nthat people generally like to judge other people.   so just do what makes you happy because if someone wants to pick on you they&#39;ll surely find something:)<br/>\n<br/>\n-susan<br/>\naustin,tx<br/>\nps  i had always looked a good 10 years younger than i was - when i was in my mid 20&#39;s people thought i was 13 or 14 and i was never taken seriously at all.  so i can really empathize with what you are saying.  it is because of this that i take my son very serious, even if he&#39;s talking about some cartoon.  because we, as a society, ignore and trivialize the thoughts of those<br/>\nyounger than us and this is a great lost because wisdom is wisdom no matter how small or young the person speaking it is.<br/>\n<br/>\nNanci and Thomas Kuykendall wrote:<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; You know, there was a time when one was considered an old maid if not married off by 17 or so.  Not that I necessarily think that is what we SHOULD be doing, just ironic.<br/>\n&gt;<br/>\n&gt; What is the deal with this current trend with older mothers?  It does not necessarily mean that one is a better parent or more intelligent or experienced in the realm of child rearing, or even (the usual stated reason) that one is better off financially.  I get so sick and tired of people treating me like I asm somehow less intelligent or less worthy because I am younger.<br/>\n&gt;<br/>\n&gt; Nanci K.<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":0,"authorName":"czuniga145@aol.com","from":"czuniga145@...","replyTo":"LIST","senderId":"5HxibolhFpL9vecQenSn33F8dEhX8KiKKAAQUZlN1a0Ev61uda8FBaGaGHC2D162NU95TfTMWn1t","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Being yourself","postDate":"952131489","msgId":6920,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY3LjIwNzNmYjEuMjVmMWI5YTFAYW9sLmNvbT4="},"prevInTopic":6918,"nextInTopic":6934,"prevInTime":6919,"nextInTime":6921,"topicId":6897,"numMessagesInTopic":0,"msgSnippet":"In a message dated 3/3/00 4:03:45 PM Pacific Standard Time, CJWBLW@AOL.COM writes: ","messageBody":"<div id=\"ygrps-yiv-1105119488\">In a message dated 3/3/00 4:03:45 PM Pacific Standard Time, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:CJWBLW@...\">CJWBLW@...</a> <br/>\nwrites:<br/>\n<br/>\n&lt;&lt; I&#39;m 25 this year, and my oldest is four.  I&#39;ve always felt sooooo <br/>\nyooooung. I <br/>\n look older than I am, so there&#39;s always a lot of surprise when my actual age <br/>\n is revealed.    &gt;&gt;<br/>\n<br/>\n<br/>\nI can relate. I had my now 9yo daughter when I was 19. I actually looked <br/>\nyoung for my age (before I had my 2nd child) and people reacted a little <br/>\nakwardly when she called me mommy. I guess they thought I had her when I was <br/>\n14 or something. I always felt *old* next to my peers but *young* next to the <br/>\nparents of her peers. Luckily, no one in my family doubted my ability to <br/>\nraise her based on my youth. They saw us doing everything we could to raise <br/>\nher well and they saw the results. They offered, and still offer, a lot of <br/>\nadvice, but rarely criticize. Then again, they don&#39;t yet kow we&#39;re <br/>\nunschooling. ;-&gt;<br/>\ncandice</div>","specialLinks":[]},{"userId":0,"authorName":"CJWBLW@AOL.COM","from":"CJWBLW@...","replyTo":"LIST","senderId":"McFF9vRMBpGhHfOOZDT1s6WOPEZ5RhjY7CldsJlwZteRS-1kkXC8t7wc5rSD5Pe0y4vBZX0","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Being yourself","postDate":"952126339","msgId":6918,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGEyLjE3M2ZmODEuMjVmMWE1ODNAYW9sLmNvbT4="},"prevInTopic":6897,"nextInTopic":6920,"prevInTime":6917,"nextInTime":6919,"topicId":6897,"numMessagesInTopic":0,"msgSnippet":"In a message dated 3/2/00 9:26:11 PM Central Standard Time, Tracy@oldfield.free-online.co.uk writes: ","messageBody":"<div id=\"ygrps-yiv-1394571588\">In a message dated 3/2/00 9:26:11 PM Central Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Tracy@...\">Tracy@...</a>-online.co.uk writes:<br/>\n<br/>\n&lt;&lt; Joshua, I&#39;m the ripe old age of 26 :-)  And Nanci, I know exactly what you <br/>\nmean!!  I feel so young, at things like LLL get-togethers, and the Home-ed <br/>\nmeetings (although a close friend from there was 18 when she had her son) but <br/>\nat least there it&#39;s appreciated that the only way to become a competent <br/>\nparent is to become a competent parent, and that comes (gradually!!) with the <br/>\njob, not with age, IMO.<br/>\n <br/>\n Tracy &gt;&gt;<br/>\n<br/>\nTracey,<br/>\n<br/>\nI&#39;m 25 this year, and my oldest is four.  I&#39;ve always felt sooooo yooooung. I <br/>\nlook older than I am, so there&#39;s always a lot of surprise when my actual age <br/>\nis revealed.  I&#39;m finally getting to an age where people aren&#39;t as surprised <br/>\nat my age.  It&#39;s kinda nice.  :)<br/>\n<br/>\nCarrie</div>","specialLinks":[]},{"userId":0,"authorName":"Tracy Oldfield","from":"&quot;Tracy Oldfield&quot; &lt;Tracy@...-online.co.uk&gt;","replyTo":"LIST","senderId":"ZCs9RyGd-9yL7W-VpVDg1PMTikAiXjZrSbWDCTagkCOuko-8vIIq8w21jVOT7Jakp1ASRT92waEytZWn4pLiLk975zAFDuejyn56CFhauNi_uxp2ZCxAcv3B","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Being yourself","postDate":"952047612","msgId":6897,"canDelete":false,"contentTrasformed":true,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxMmQwMWJmODRiOCQyNTIyMGE2MCQ0YjQ2OWZkNEBsaW5rMTA1MjY2Pg==","referencesHeader":"PDAwNDIwMWJmN2ZlOCQ0YjFkMTJjMCQ0MzRhOWZkNEBsaW5rMTA1MjY2PiA8MDAxMDAxYmY4MGU3JGMyNzY1OTgwJDIzODM0MmQ4QEpvc2hIZWF0aD4gPDAwMDUwMWJmODI0NyRiNTA1YWM0MCRlYjQxOWZkNEBsaW5rMTA1MjY2PiA8MDAzMzAxYmY4Mjc5JDhjOGE3MGMwJDExODM0MmQ4QEpvc2hIZWF0aD4gPDAwNzMwMWJmODMxOSRmZGY2ZTM2MCQ4NTQ0OWZkNEBsaW5rMTA1MjY2PiA8MDAxMzAxYmY4MzI5JDYxYTg5ODQwJDExODM0MmQ4QEpvc2hIZWF0aD4="},"prevInTopic":0,"nextInTopic":6918,"prevInTime":6896,"nextInTime":6898,"topicId":6897,"numMessagesInTopic":0,"msgSnippet":"Joshua, I m the ripe old age of 26 :-)  And Nanci, I know exactly what you mean!!  I feel so young, at things like LLL get-togethers, and the Home-ed meetings","messageBody":"<div id=\"ygrps-yiv-1990381377\">\n<html><head>\n \n \n<style></style>\n</head>\n \n<div><font size=\"2\">Joshua, I&#39;m the ripe old age of 26 :-)&nbsp; And Nanci, I know \nexactly what you mean!!&nbsp; I feel so young, at things like LLL get-togethers, \nand the Home-ed meetings (although a close friend from there was 18 when she had \nher son) but at least there it&#39;s appreciated that the only way to become a \ncompetent parent is to become a competent parent, and that comes (gradually!!) \nwith the job, not with age, IMO.</font></div>\n<div>&nbsp;</div>\n<div><font size=\"2\">Tracy</font></div>\n<blockquote><span title=\"qreply\"> <blockquote\n style=\"BORDER-LEFT:#000000 2px solid;MARGIN-LEFT:5px;MARGIN-RIGHT:0px;PADDING-LEFT:5px;PADDING-RIGHT:0px;\">\n  <div style=\"FONT:10pt arial;\">----- Original Message ----- </div>\n  <div\n style=\"BACKGROUND:#e4e4e4;FONT:10pt arial;\"><b>From:</b> \n  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:heathfam@...\" title=\"heathfam@...\">Joshua Heath</a> \n  </div>\n  <div style=\"FONT:10pt arial;\"><b>To:</b> <a rel=\"nofollow\"\n target=\"_blank\" href=\"mailto:Unschooling-dotcom@onelist.com\"\n title=\"Unschooling-dotcom@onelist.com\">Unschooling-dotcom@onelist.com</a> </div>\n  <div style=\"FONT:10pt arial;\"><b>Sent:</b> Wednesday, March 01, 2000 2:53 \n  AM</div>\n  <div style=\"FONT:10pt arial;\"><b>Subject:</b> Re: [Unschooling-dotcom] Being \n  yourself</div>\n  <div><br></div><tt>From:</tt> <tt>&quot;Joshua Heath&quot; &lt;<a rel=\"nofollow\"\n target=\"_blank\" href=\"mailto:heathfam@...\">heathfam@...</a>&gt;</tt> <br><br>\n  <div><font face=\"Arial\" size=\"2\">Sure Tracy... by the way, how young are you now?? \n  I know you said how old your daughter(?) is, but I forgot...</font></div>\n  <div><font face=\"Arial\" size=\"2\">Have a great day,</font></div>\n  <div><font face=\"Arial\" size=\"2\">Joshua</font>&nbsp;</div>\n  <blockquote\n style=\"BORDER-LEFT:#000000 2px solid;MARGIN-LEFT:5px;MARGIN-RIGHT:0px;PADDING-LEFT:5px;PADDING-RIGHT:0px;\">\n    <div style=\"FONT:10pt arial;\">----- Original Message ----- </div>\n    <div\n style=\"BACKGROUND:#e4e4e4;FONT:10pt arial;\"><b>From:</b> \n    <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Tracy@...-online.co.uk\"\n title=\"Tracy@...-online.co.uk\">Tracy Oldfield</a> </div>\n    <div style=\"FONT:10pt arial;\"><b>To:</b> <a rel=\"nofollow\"\n target=\"_blank\" href=\"mailto:Unschooling-dotcom@onelist.com\"\n title=\"Unschooling-dotcom@onelist.com\">Unschooling-dotcom@onelist.com</a> \n    </div>\n    <div style=\"FONT:10pt arial;\"><b>Sent:</b> Tuesday, February 29, 2000 5:03 \n    PM</div>\n    <div style=\"FONT:10pt arial;\"><b>Subject:</b> Re: [Unschooling-dotcom] Being \n    yourself</div>\n    <div><br></div><tt>From:</tt> <tt>&quot;Tracy Oldfield&quot; &lt;<a rel=\"nofollow\"\n target=\"_blank\" href=\"mailto:Tracy@...-online.co.uk\">Tracy@...-online.co.uk</a>&gt;</tt> \n    <br><br>\n    <div><font size=\"2\">That&#39;s quite young!!&nbsp; I did it the other way around, \n    got married at 18, had eldest at 21, almost 22 :-)&nbsp;and dh is older than \n    me, but I don&#39;t know if it makes much difference.&nbsp; The only thing I can \n    see is that having children when you&#39;re that young seems to give people even \n    more of an idea that they can tell you what to do with them &lt;g&gt;&nbsp; \n    I know my father was told when he announced that mum and he were engaged \n    that he was &#39;nobbut a bairn&#39; himself.&nbsp;</font></div>\n    <div><font size=\"2\"></font>&nbsp;</div>\n    <div><font size=\"2\">Us&nbsp;young-uns can sit over here and and natter while \n    the fogies do their thing, eh???</font></div>\n    <div>&nbsp;</div>\n    <div><font size=\"2\">Tracy</font>&nbsp;</div>\n    <div>&nbsp;</div>\n    <blockquote\n style=\"BORDER-LEFT:#000000 2px solid;MARGIN-LEFT:5px;MARGIN-RIGHT:0px;PADDING-LEFT:5px;PADDING-RIGHT:0px;\">\n      <div>&nbsp;</div><tt>From:</tt> <tt>&quot;Joshua Heath&quot; &lt;<a rel=\"nofollow\"\n target=\"_blank\" href=\"mailto:heathfam@...\">heathfam@...</a>&gt;</tt> <br><br>\n      <div><font face=\"Arial\" size=\"2\">Tracy, My now wife and I concieved our first \n      child when I was 19 and she was 20.&nbsp; I was all set to go travelling \n      for 6 months to Australia!&nbsp; I relate to your feelings of not being \n      sure you cut it as a homeschooling parent!&nbsp; I feel the same way often \n      myself... Life can just be stressfull and overwhelming at times... and it \n      is hard for me not to get down during these days... it doesnt help when \n      the boys are transitioning into this lifestyle still and being &quot;bored&quot; and \n      argumentative and hyper and agitated.&nbsp; And I too am learning the \n      ropes and don&#39;t have a chore system that functions well yet, and am not \n      too good at creating a nice easy rythm in our days... I sure hope to get \n      better and better at these things... but man the thoughts do go through my \n      mind of &quot;maybe this is just not possible for me,&quot;scool wasnt that \n      bad...&quot;&nbsp; But the reality was, it was, and that fact not-withstanding, \n      there are&nbsp;NO real alternatives I can begin to embrace at this \n      point.&nbsp; </font></div>\n      <div>&nbsp;</div>\n      <div><font face=\"Arial\" size=\"2\">Sorry for rambling...</font></div>\n      <div><font face=\"Arial\" size=\"2\">Joshua</font></div>\n      <blockquote\n style=\"BORDER-LEFT:#000000 2px solid;MARGIN-LEFT:5px;MARGIN-RIGHT:0px;PADDING-LEFT:5px;PADDING-RIGHT:0px;\">\n        <div style=\"FONT:10pt arial;\">----- Original Message ----- </div>\n        <div\n style=\"BACKGROUND:#e4e4e4;FONT:10pt arial;\"><b>From:</b> \n        <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Tracy@...-online.co.uk\"\n title=\"Tracy@...-online.co.uk\">Tracy Oldfield</a> </div>\n        <div style=\"FONT:10pt arial;\"><b>To:</b> <a rel=\"nofollow\"\n target=\"_blank\" href=\"mailto:Unschooling-dotcom@onelist.com\"\n title=\"Unschooling-dotcom@onelist.com\">Unschooling-dotcom@onelist.com</a> \n        </div>\n        <div style=\"FONT:10pt arial;\"><b>Sent:</b> Monday, February 28, 2000 \n        3:48 PM</div>\n        <div style=\"FONT:10pt arial;\"><b>Subject:</b> Re: [Unschooling-dotcom] \n        Being yourself</div>\n        <div><br></div><tt>From:</tt> <tt>&quot;Tracy Oldfield&quot; &lt;<a rel=\"nofollow\"\n target=\"_blank\" href=\"mailto:Tracy@...-online.co.uk\">Tracy@...-online.co.uk</a>&gt;</tt> \n        <br><br>\n        <div><font size=\"2\">Thanks Joshua, it was clear enough for me :-)&nbsp; \n        You said you had children young, do you mind asking how young?&nbsp; \n        Some folks idea of young are way different to others, I know!!&nbsp; I \n        struggle here as I have always been a mature, serious (earnest?) type \n        although whether that&#39;s me or &#39;schooled (or perhaps bullied) me&#39; I&#39;m not \n        sure, and I agree with the theory that everyone has an age that fits \n        them, once they reach that age they stay for a while until decrepitude \n        takes over.&nbsp; So it&#39;s hard for me to let go and play with my \n        children more, (I used to, though, and do with other folks children, \n        particularly 1yo-ish&#39;s, now I think...why has that stopped I \n        wonder?&nbsp; Probably since I started being asked why at every \n        verse-end...)&nbsp; and I sometimes wonder whether I am the right kind \n        of person to be unschooling or even homeschooling, but the alternative \n        is, for me, so abhorrent that I plod on anyway!!</font></div>\n        <div>&nbsp;</div>\n        <div><font size=\"2\">Thanks again</font></div>\n        <div><font size=\"2\">Tracy</font></div>\n        <blockquote\n style=\"BORDER-LEFT:#000000 2px solid;MARGIN-LEFT:5px;MARGIN-RIGHT:0px;PADDING-LEFT:5px;PADDING-RIGHT:0px;\">\n          <div>&nbsp;</div><tt>From:</tt> <tt>&quot;Joshua Heath&quot; &lt;<a rel=\"nofollow\"\n target=\"_blank\" href=\"mailto:heathfam@...\">heathfam@...</a>&gt;</tt> \n          <br><br>\n          <div><font face=\"Arial\" size=\"2\">Tracy, you have touched upon a theme in \n          my life as well!&nbsp; How to the work of getting to know yourself and \n          still be a functioning parent - ie. not letting it make you self \n          absorbed! - I have thought about it a LOT, and the only conclusion I \n          have reached is to just do my best...&nbsp;&nbsp; By this I mean to \n          STRIVE for aspects such as being loving, being fair, bening \n          encouraging, being fun, being *UP*, laughing amap, being clear, being \n          consistant, etc... realizing I will never be all of these things all \n          the time!&nbsp; In this way I get to begin to connect with my \n          childishness (laughter, being silly, having fun, playing WITH my kids) \n          at the same time as remaining a (semi) responsable adult by striving \n          for fairness, and authourity.&nbsp; I dont think that things allways \n          come in neat, packages in life... which means somtimes we need to \n          improvise and do the best we can!&nbsp; Sure it would be nice if we \n          had all been raised in such a way as to know ourselves real well \n          etc.&nbsp; But in my life at least, (having children at a young age) I \n          have had to just share my own growth with them.... something I hope \n          they will take with them into their own lives.... the STRIVING chuck \n          limiting patterns/beleifs/attitudes.&nbsp; </font></div>\n          <div>&nbsp;</div>\n          <div><font face=\"Arial\" size=\"2\">I wish I could be a little clearer.... oh \n          well &lt;shrug&gt;&nbsp; </font></div>\n          <div>&nbsp;</div>\n          <div><font face=\"Arial\" size=\"2\">Joshua</font></div></blockquote>\n        <hr>\n<a rel=\"nofollow\"\n target=\"_blank\" href=\"http://click.egroups.com/1/1631/5/_/448294/_/951782292/\"\n>\n        <center><img alt=\"\" border=\"0\" height=\"60\"\n src=\"https://ec.yimg.com/ec?url=http%3A%2F%2Fadimg.egroups.com%2Fimg%2F1631%2F5%2F_%2F448294%2F_%2F951782292%2F&t=1571751240&sig=2Ay7ws4zfblKEVT4sIh58Q--~E\"\n width=\"468\"></center>\n        <center><font color=\"white\"></font></center></a>\n        <hr>\n        <tt>Message boards, timely articles, a free newsletter and \n        more!<br>Check it all out at: <a rel=\"nofollow\"\n target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br></tt><br></blockquote>\n      <hr>\n<a rel=\"nofollow\"\n target=\"_blank\" href=\"http://click.egroups.com/1/2028/5/_/448294/_/951803635/\"\n>\n      <center><img alt=\"\" border=\"0\" height=\"60\"\n src=\"https://ec.yimg.com/ec?url=http%3A%2F%2Fadimg.egroups.com%2Fimg%2F2028%2F5%2F_%2F448294%2F_%2F951803635%2Fhat.gif&t=1571751240&sig=nQxroWqTjQpJdxL._iz.hg--~E\"\n width=\"468\"></center>\n      <center><font color=\"white\"></font></center></a>\n      <hr>\n      <tt>Message boards, timely articles, a free newsletter and more!<br>Check \n      it all out at: <a rel=\"nofollow\"\n target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br></tt><br></blockquote>\n    <hr>\n<a rel=\"nofollow\"\n target=\"_blank\" href=\"http://click.egroups.com/1/2033/5/_/448294/_/951872608/\"\n>\n    <center><img alt=\"\" border=\"0\" height=\"60\"\n src=\"https://ec.yimg.com/ec?url=http%3A%2F%2Fadimg.egroups.com%2Fimg%2F2033%2F5%2F_%2F448294%2F_%2F951872608%2Fcreate.gif&t=1571751240&sig=xVCFefBboehjAUNuhDx0gA--~E\"\n width=\"468\"></center>\n    <center><font color=\"white\"></font></center></a>\n    <hr>\n    <tt>Message boards, timely articles, a free newsletter and more!<br>Check it \n    all out at: <a rel=\"nofollow\"\n target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br></tt><br></blockquote>\n  <hr>\n<a rel=\"nofollow\"\n target=\"_blank\" href=\"http://click.egroups.com/1/1288/5/_/448294/_/951879159/\"\n>\n  <center><img alt=\"\" border=\"0\" height=\"60\"\n src=\"https://ec.yimg.com/ec?url=http%3A%2F%2Fadimg.egroups.com%2Fimg%2F1288%2F5%2F_%2F448294%2F_%2F951879159%2F468x60-t2.gif&t=1571751240&sig=k15.0p5qUpLXcmo78X8.Og--~E\"\n width=\"468\"></center>\n  <center><font color=\"white\"></font></center></a>\n  <hr>\n  <tt>Message boards, timely articles, a free newsletter and more!<br>Check it \n  all out at: <a rel=\"nofollow\"\n target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br></tt><br></blockquote></span></blockquote></html> \n</div>","specialLinks":[]}],"prevTopicId":6967,"nextTopicId":6984}}