{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Covert","from":"Covert &lt;covert@...-net.ne.jp&gt;","replyTo":"LIST","senderId":"_hx17oTF1pplqp8SdSC-7B2lhkQJbhhXPyTs361PhM9XSNU5fphbrseUS3H4PK_Mn3wzcZP5-mxjM94aZV215eSnPncuON8","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Bullying in Japan article","postDate":"959737705","msgId":8780,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDAwNTMxMDEzOS5LQUExNDIyMkBtYWlsLndhMi5zby1uZXQubmUuanA+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":8779,"nextInTime":8781,"topicId":8780,"numMessagesInTopic":0,"msgSnippet":"Hi all, Yet another article here on bullying in Japan, this time as a part of the classroom curriculum for both students and teachers. A very inventive ","messageBody":"<div id=\"ygrps-yiv-1366737837\">Hi all,<br/>\n<br/>\nYet another article here on bullying in Japan, this time as a part of the <br/>\nclassroom curriculum for both students and teachers. A very inventive <br/>\napproach: If you can&#39;t beat &#39;em, study &#39;em....<br/>\n<br/>\nI found this paragraph of the story to be of key importance: &quot;However, <br/>\nthey learned from the rulings that they have the option of transferring <br/>\nto another school or staying home, and that bullies can be ordered to <br/>\nstay home. Many students expressed relief.&quot;<br/>\n<br/>\nYes, families in Japan are coming to know that they have viable <br/>\neducational choices. Staying home (and learning) is indeed one of them.<br/>\n<br/>\nBrian Covert<br/>\n(KnoK NEWS)<br/>\nin Osaka, Japan<br/>\n<br/>\n---------------------------------<br/>\n<br/>\n[Daily Yomiuri - 31 May 2000]<br/>\n<br/>\n<br/>\nCOURT RULINGS USED TO STUDY BULLYING <br/>\n<br/>\n<br/>\nKAGOSHIMA -- A teaching program that uses mock civil actions based on <br/>\nactual bullying cases has recently started to attract the attention of <br/>\nprimary and middle school teachers nationwide. <br/>\n<br/>\nIn response to an actual bullying case in Kagoshima Prefecture that ended <br/>\nwith the suicide of a middle school student, teachers and university <br/>\nresearchers jointly developed the program to show students how to act <br/>\nwhen confronted with bullying. <br/>\n<br/>\nTo make the material suitable for classroom study, the Kagoshima <br/>\nUniversity researchers put the legalistic language of the rulings into <br/>\nlayman&#39;s terms.<br/>\n<br/>\nUnder the program, students learn that bullying can lead to crime, and <br/>\nthat adults have a responsibility to prevent it. <br/>\n<br/>\nAs word of the program has spread, a growing number of primary and middle <br/>\nschool teachers and officials of prefectural education boards across the <br/>\ncountry have begun asking the developers of the program for more <br/>\ninformation. The Niigata prefectural government&#39;s board of education has <br/>\nadopted the program into its bullying-prevention plan. <br/>\n<br/>\nProf. Hirofumi Uneme, a specialist in civil law, and Assistant Prof. <br/>\nMasanobu Umeno, an education expert, both with Kagoshima University, <br/>\nworked on school bullying rulings that were handed down in five civil <br/>\nactions. <br/>\n<br/>\nUmeno is a member of a bullying-prevention group formed after a <br/>\nthird-year middle school boy from Chirancho in the prefecture committed <br/>\nsuicide in 1996 as a result of the bullying he suffered. <br/>\n<br/>\nUmeno came up with the idea of using bullying case rulings as an <br/>\neffective means to combat and eliminate bullying after realizing the <br/>\nlimited effectiveness of such slogans as &quot;Bullying should not be <br/>\ntolerated.&quot; <br/>\n<br/>\nHe said he found that the rulings referred to the action adults involved <br/>\nshould have taken to prevent the victimization. The rulings also <br/>\ncontained objective reviews of the way the cases were handled and the way <br/>\nthey should have been handled in relation to the bully, victim, teacher, <br/>\nparents and others concerned, he said. <br/>\n<br/>\n&quot;The rulings themselves offer ideal solutions to those involved in <br/>\nbullying cases,&quot; Umeno said. &quot;That is, how those directly involved and <br/>\nthose around them should have acted to stop the bullying.&quot; <br/>\n<br/>\nThe two university researchers have so far simplified the language of the <br/>\nfive cases -- including one that occurred in 1986 at Nakano-Fujimi Middle <br/>\nSchool in Nakano Ward, Tokyo, in which a student committed suicide as a <br/>\nresult of bullying not only by students, but also by teachers. <br/>\n<br/>\nThe rewritten versions of the rulings have already been used in classes <br/>\nfor primary school and middle school students. <br/>\n<br/>\nUnder the new program, five to eight class-hours are usually needed. <br/>\nFirst, students are asked to consider the circumstances and the <br/>\nindividuals involved in a case. <br/>\n<br/>\nThey then write down the specific descriptions of acts that the court <br/>\nfound to be instances of bullying. They include such descriptions as &quot;The <br/>\nringleader told all the boys in a class to snub boy &#39;A&#39;&quot;; &quot;A group of <br/>\nbullies surrounded the boy, who was shaking with fear, on the rooftop of <br/>\nthe school building and started punching and kicking him repeatedly&quot;; and <br/>\n&quot;They took turns calling his house to intimidate him.&quot; <br/>\n<br/>\nWhen the students compare each description with the corresponding penal <br/>\ncode provision, they gain an understanding that acts of bullying are <br/>\nequivalent to such crimes as assault and extortion. <br/>\n<br/>\nThe rulings disclose chilling accounts of actual bullying cases and the <br/>\nevents that surrounded them, such as, &quot;The boy hid behind the gymnasium <br/>\nwithout eating lunch to avoid the bullies&quot; and &quot;The homeroom teacher was <br/>\nafraid of the bullies because he had also been attacked by them.&quot; <br/>\n<br/>\nThrough the program students become aware of the difficulties of putting <br/>\nthe principle of taking action to stop bullying into practice. <br/>\n<br/>\nIn the second half of the program, the students learn that teachers and <br/>\nparents are responsible for protecting children from bullying. They look <br/>\nat specific cases to see who assumed responsibility and why. They also <br/>\nexamine actual rulings ordering schools to pay compensation and the court <br/>\ndecisions that assess blame to the various parties involved. <br/>\n<br/>\nThe students are then encouraged to view a case by imagining themselves <br/>\nas victims and witnesses. <br/>\n<br/>\nMany students said they assumed, before attending the program, that they <br/>\nwould have to attend classes even if they were subjected to bullying at <br/>\nschool. <br/>\n<br/>\nHowever, they learned from the rulings that they have the option of <br/>\ntransferring to another school or staying home, and that bullies can be <br/>\nordered to stay home. Many students expressed relief. <br/>\n<br/>\nOne fifth-year primary school boy said he now knew of options other than <br/>\ncommitting suicide, while a female middle school student wrote in her <br/>\nreport that she once thought of killing herself when she was bullied. &quot;I <br/>\nwish I could have taken this program earlier,&quot; she wrote. <br/>\n<br/>\nSome students worked out practical countermeasures during the program, <br/>\nsuch as telling the teacher in private about bullying, giving <br/>\nencouragement to a victim of bullying in a letter, and collecting <br/>\nevidence of bullying and appealing directly to the principal with it. <br/>\n<br/>\nUneme pointed out that the time had come for incorporating specific <br/>\nmeasures to prevent violence and bullying into school curriculums. <br/>\n<br/>\n&quot;The rulings also are an ideal reference for teachers to study their <br/>\nlegal responsibilities in relation to bullying,&quot; he said. &quot;It will be a <br/>\nsheer waste if we do not make the most of them in the classroom to <br/>\nprevent recurrences of bullying.&quot; <br/>\n<br/>\n<br/>\n[Copyright 2000 - The Yomiuri Shimbun]</div>","specialLinks":[]}],"prevTopicId":8778,"nextTopicId":8781}}