{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Returning (sort-of) to unschooling, and moving","postDate":"1534899907","msgId":78453,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc0NUY5MDI5LUI1RDctNDIwNS05NjJELTRGNkNEMDI1MkJGRkBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDY4MUI2RUMwLUEyQkUtNEZDNC05NjBFLTBCN0VCQTU2NjI3OEBzYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PENBK2ppck9md0VZK1VLQnVvYzRHQmhMLVNRX29YSEJYbmhMdkVoZWQzQnNuazNZNit0Z0BtYWlsLmdtYWlsLmNvbT4gPDY4MUI2RUMwLUEyQkUtNEZDNC05NjBFLTBCN0VCQTU2NjI3OEBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":78451,"nextInTopic":0,"prevInTime":78452,"nextInTime":78454,"topicId":78380,"numMessagesInTopic":0,"msgSnippet":"-=-So I don’t think it’s a single bit unreasonable to remind kids (and ourselves) that there ARE community standards, and laws, and ideas about what being","messageBody":"<div id=\"ygrps-yiv-193147566\">-=-So I don’t think it’s a single bit unreasonable to remind kids (and ourselves) that there ARE community standards, and laws, and ideas about what being a responsible parent involves, and there is no exception for unschoolers.-=-<br/>\n<br/>\nAnd I remind parents, sometimes, when (occasionally) one seems to be suggesting that there’s totally NOTHING to unschooling, just slide, just be home, just BE.<br/>\nThat might be a little bit too unstructured to show that there is some groovy, creative, alternative homeschooling going on.  Parents need to be home being interesting, attentive, resourceful, active, curious, musical, artsy…<br/>\n<br/>\n“We’re unschoolers and we don’t need to do anything” isn’t cool, or true.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Returning (sort-of) to unschooling, and moving","postDate":"1534899437","msgId":78451,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY4MUI2RUMwLUEyQkUtNEZDNC05NjBFLTBCN0VCQTU2NjI3OEBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PENBK2ppck9md0VZK1VLQnVvYzRHQmhMLVNRX29YSEJYbmhMdkVoZWQzQnNuazNZNit0Z0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PENBK2ppck9md0VZK1VLQnVvYzRHQmhMLVNRX29YSEJYbmhMdkVoZWQzQnNuazNZNit0Z0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":78449,"nextInTopic":78453,"prevInTime":78450,"nextInTime":78452,"topicId":78380,"numMessagesInTopic":0,"msgSnippet":"-=- I know that it s for thousands and not just me…-=- Well dozens.  Maybe hundreds, eventually.  Probably most of the people in this group have moved to","messageBody":"<div id=\"ygrps-yiv-1530372163\">-=- I know that it&#39;s for thousands and not just me…-=-<br/>\n<br/>\nWell dozens.  Maybe hundreds, eventually.  Probably most of the people in this group have moved to another planet or died or at least changed their e-mail addresses and abandoned whatever they joined this with.<br/>\n<br/>\n-=-Yes, her personality is certainly such that she loves being social and around other people. This is why I&#39;m hoping to find community through the homeschooling charter, the local homeschooling facebook groups, and the folks in the activities in which she wants to participate. Since she&#39;s not required to be in attendance anywhere, it will also allow her to visit my in-laws more, which I feel is important since she&#39;s never lived farther than 15 feet away from them, and I want her to easily maintain a relationship with them. I also tend to be social and extroverted (though a little less so since losing my husband), and I really value community, so I&#39;m hoping all that will help me facilitate supporting her in developing new relationships as much as she wants.<br/>\n-=-<br/>\n<br/>\nYou’re dealing with some big things I didn’t need to, so I feel distant and not very helpful, but I also don’t think that school will be, for her, what it might be if you were NOT attached to the idea of unschooling, and to the principles of choice and of learning all the time.<br/>\n<br/>\n-=-Anyhow, I&#39;m also struggling with how to let go of my knee-jerk responses when my seven year old daughter is a little sassy, which is rare, but something I was never allowed to do, and something that is a bit of a button for me. I don&#39;t want to shut her down, nor stop her from expressing her upset or difficult feelings, which I am usually able to create lots of space for whenever it&#39;s not directed at or toward or about me. I know that I could be better about not taking things personally in general, but would also love some insight into how to balance that and also set boundaries so that I don&#39;t create an environment where saying &quot;fuck you&quot; is ok. We&#39;re far from that now, in fact, I feel like she does shut down a bit, in large part I believe because of the ways I&#39;ve handled messes and sass in the past. (In the wake of grief, I had a lot less patience and tolerance for that which was really difficult for me: messes and disrespect or attitude directed toward me.) For the overwhelming majority of the time we are both sweet and respectful of each other, this is just something that pops up occasionally that I would like to get better at.-=-<br/>\n<br/>\nEeek.<br/>\n“Fuck you” isn’t going to GET okay.<br/>\n<br/>\nFor me I would tell her straight up that there are things that young kids just can’t do—can’t do socially, morally, or (in a way) legally.  <br/>\nI did remind my kids a time or three a year, depending on issues and situations, that there were government officials whose fulltime real jobs involved making sure that parents were doing what they were supposed to do with and for their children, and there were quite a few things that could cause someone to call them to interview us all, and I could lose the right to keep them home.<br/>\n<br/>\nDefense of our unschooling involved them not being in public parks after the posted closing time, not being out late on “a school night” (not OUR “school night,” because we didn’t have school DAYS, but the nights before public-school scheduled days).  Albuquerque has noise ordinances.  I made sure my kids knew what they were.  I didn’t want the police to come to say “you need to be quieter” and find a rousing gamers’ party at my house at 2:00 am on a Wednesday, or whatever.  Our house was the table-game hangout when the gaming store was closed, pretty often.<br/>\n<br/>\nSo I don’t think it’s a single bit unreasonable to remind kids (and ourselves) that there ARE community standards, and laws, and ideas about what being a responsible parent involves, and there is no exception for unschoolers.<br/>\n<br/>\nNothing has damaged the reputation of unschooling like those photos families will take and put up of kids touching what says “don’t touch,” or frolicking past the “don’t climb on rocks” sign, or showing their kids flipping the bird, and then saying “We’re UNSCHOOLERS!”  <br/>\n<br/>\nThis link is about the idea of “unschooling world,” a term Holly first used—about families who do seem to fall into the idea that the differences between unschoolers and “school families” are, or could be, endless.  They end about at no school, so no set time to get up, and no reason to press a big breakfast so a kid can last four hours until school lunch.  Beyond that, they’re still in Richardson, or Leeds, or Cairns, or some town with laws, in some district or county with something like “child and family services.&quot;<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/unschoolworld\">http://sandradodd.com/unschoolworld</a><br/>\n<br/>\nAlso, there’s another page about each of my children having had legal trouble.  Two went to court, one went to juvenile rehabilitation (a long shaming session with about 20 parent/child dyads there. Poor Holly; she cried).<br/>\n<br/>\nI’ll quote it, and link it.  <br/>\nMaybe it’s not applicable to a seven year old’s frustrated responses, but one thing leads to another, and y’know, I’m writing for thousands, or dozens. :-)<br/>\n<br/>\nOH!  IT was originally in this group anyway. :-)<br/>\n<br/>\n<br/>\nposted by Sandra Dodd on the Always Learning list on April 26, 2009<br/>\n<br/>\nThis is long, but everyone&#39;s fine. Those with young children or who don&#39;t like long posts can skip it.<br/>\nMy introduction is that each of our children has been in trouble with the law now.<br/>\n<br/>\nKirby drove his friend Joey home about four blocks, and he forgot to turn his headlights on. We went to court and they let him pay the fine without talking to the judge.<br/>\n<br/>\nMarty was on a playground in a public park after hours (parks close at 10:00 or 10:30)--not drinking, not doing anything but playing on the slides with three other people, one 21 and the others 18, 19. He did two days of community service at the Red Cross office. (He reminded me that he also was ticketed for stopping too hard at a stop light. He stopped, but not gracefully, and we went to court and he paid a fine and went to a driving class. No alcohol nor any other such thing involved.)<br/>\n<br/>\nHolly&#39;s is slightly worse than these….<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/pudding\">http://sandradodd.com/pudding</a><br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":552195120,"authorName":"sarah stone francisco","from":"sarah stone francisco &lt;sarah.stonefrancisco@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Returning (sort-of) to unschooling, and moving","postDate":"1534835087","msgId":78449,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBK2ppck9md0VZK1VLQnVvYzRHQmhMLVNRX29YSEJYbmhMdkVoZWQzQnNuazNZNit0Z0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":78383,"nextInTopic":78451,"prevInTime":78448,"nextInTime":78450,"topicId":78380,"numMessagesInTopic":0,"msgSnippet":"Hi there, I ve thought a lot about your response Sandra, and I know that it s for thousands and not just me, but I m looking forward to your feedback to my ","messageBody":"<div id=\"ygrps-yiv-953574664\"><div dir=\"ltr\">Hi there, <div><div><br></div></div><div>I&#39;ve thought a lot about your response Sandra, and I know that it&#39;s for thousands and not just me, but I&#39;m looking forward to your feedback to my thoughts where you think it would be helpful.</div><div><br></div><div>_____</div><div>Sandra wrote:</div><div><span style=\"color:rgb(51,51,51);font-family:arial, helvetica, clean, sans-serif;font-size:13px;line-height:19px;\">&quot;Is it possible that the unschooling plan is part of the ammased stuff that could be purged?</span><br style=\"color:rgb(51,51,51);font-family:arial, helvetica, clean, sans-serif;font-size:13px;line-height:19px;\"><span style=\"color:rgb(51,51,51);font-family:arial, helvetica, clean, sans-serif;font-size:13px;line-height:19px;\">Some kids are fine with school. With one less adult in the family, it is possible that your daughter would enjoy being around other people (depending on her personality).&quot;</span></div><div><font color=\"#333333\" face=\"arial, helvetica, clean, sans-serif\"><span style=\"line-height:19px;\">______</span></font></div><div>Yes, purging that plan is definitely something to keep in mind. I have been chatting with and checking in with her occasionally about what she thinks, while doing my best to remain unattached to the idea. She really was fine with the school she was going to, understandably so, it was amazing. However, moving feels like the best next step in our lives, and where we&#39;re moving, she cannot continue to attend the same school. In looking around for schools, I took a lot of care to try to find something similar to what she had in terms of kindness and consideration of staff and children, respect for the diversity of learning styles and a wonderful array of activities and interests. The three public charters available that seemed like they&#39;d be a good fit all had waiting lists that meant she wouldn&#39;t be able to attend this year, even though I tried. One has an associated homeschooling charter where she&#39;ll be going to a group class once a week, and a field trip every other week. Everything is truly optional. Being in this program gives her an advantage of moving to the top of the list if there is space in her grade next year and she wants to go to a five day a week, more standard program.</div><div><div><br></div><div>Yes, her personality is certainly such that she loves being social and around other people. This is why I&#39;m hoping to find community through the homeschooling charter, the local homeschooling facebook groups, and the folks in the activities in which she wants to participate. Since she&#39;s not required to be in attendance anywhere, it will also allow her to visit my in-laws more, which I feel is important since she&#39;s never lived farther than 15 feet away from them, and I want her to easily maintain a relationship with them. I also tend to be social and extroverted (though a little less so since losing my husband), and I really value community, so I&#39;m hoping all that will help me facilitate supporting her in developing new relationships as much as she wants.</div><div><br></div><div>_____</div><div><span style=\"color:rgb(51,51,51);font-family:arial, helvetica, clean, sans-serif;font-size:13px;line-height:19px;\">Sandra wrote:</span></div><div><span style=\"color:rgb(51,51,51);font-family:arial, helvetica, clean, sans-serif;font-size:13px;line-height:19px;\">&quot;What does SHE want?&quot;</span><br></div><div><span style=\"color:rgb(51,51,51);font-family:arial, helvetica, clean, sans-serif;font-size:13px;line-height:19px;\">_____</span></div><div><span style=\"color:rgb(51,51,51);font-family:arial, helvetica, clean, sans-serif;font-size:13px;line-height:19px;\"><br></span></div><div><span style=\"color:rgb(51,51,51);font-family:arial, helvetica, clean, sans-serif;font-size:13px;line-height:19px;\">She has said that she&#39;s excited about going to school one day a week, having lots of field trips, and having flexibility to explore other things. I&#39;ve also asked her about what parts of her last school she really liked and I will do my best to support her in accessing those things in life as well as getting deeper into the other things she&#39;s interested in. And, I feel like we can reevaluate in a year, or even mid-year if it really feels like something is off or she expresses an interest in going to a more traditional school setting.</span></div><div><br></div><div><br></div><div>In general, your email really helped me to remember that the more choices she has, hopefully the more engaged and thus the more she&#39;ll learn, wherever that is. And, I&#39;ve been listening to Pam&#39;s Joyful Living podcast and her words keep ringing true for me, give it a try for six months to a year, like being on vacation and just see how it goes. So, for now, I guess we&#39;ll see how it goes.</div><div><br></div><div>Funny, I set out this evening to write about something entirely different, but felt that it would be helpful (though I know, not required) to respond to the feedback I previously received first. Anyhow, I&#39;m also struggling with how to let go of my knee-jerk responses when my seven year old daughter is a little sassy, which is rare, but something I was never allowed to do, and something that is a bit of a button for me. I don&#39;t want to shut her down, nor stop her from expressing her upset or difficult feelings, which I am usually able to create lots of space for whenever it&#39;s not directed at or toward or about me. I know that I could be better about not taking things personally in general, but would also love some insight into how to balance that and also set boundaries so that I don&#39;t create an environment where saying &quot;fuck you&quot; is ok. We&#39;re far from that now, in fact, I feel like she does shut down a bit, in large part I believe because of the ways I&#39;ve handled messes and sass in the past. (In the wake of grief, I had a lot less patience and tolerance for that which was really difficult for me: messes and disrespect or attitude directed toward me.) For the overwhelming majority of the time we are both sweet and respectful of each other, this is just something that pops up occasionally that I would like to get better at.</div><div><br></div><div>It&#39;s late, not sure if that&#39;s enough info. And, in rereading it, I&#39;m seeing that likely the more I&#39;m relaxed about messes, which I&#39;m way better and continuing to get better about, and the more respectful and sweet and kind and considerate of her, the more she&#39;s open and can easily express herself with me and that all the rest is reciprocated, too. Anyhow, I just saw the Add Light and Stir link to respect, which I&#39;ll read. And any links to other material you think would be helpful would be greatly appreciated.</div><div><br></div><div>Thank you so much.</div><div>-- </div><div class=\"ygrps-yiv-953574664gmail_signature\"><div dir=\"ltr\"><div>Gratefully, </div><div>sarah</div><div><br></div></div></div>\n</div></div></div>","specialLinks":[]},{"userId":243894941,"authorName":"","from":"jsearthmom@...","profile":"jsearthmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Returning (sort-of) to unschooling, and moving","postDate":"1529425415","msgId":78383,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PHBnYmFtNyticjRlamhAWWFob29Hcm91cHMuY29tPg==","inReplyToHeader":"PDdFMzBBNkIxLTBENzYtNEQxOS1BNEFFLUI5MzM4MEEyMDVFOUBzYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PENBRDEzNjhGLTUwQUQtNEFGMi04RURBLTExOEI2MUQ2NUQ2MEBnbWFpbC5jb20+CTw3RTMwQTZCMS0wRDc2LTREMTktQTRBRS1COTMzODBBMjA1RTlAc2FuZHJhZG9kZC5jb20+"},"prevInTopic":78382,"nextInTopic":78449,"prevInTime":78382,"nextInTime":78384,"topicId":78380,"numMessagesInTopic":0,"msgSnippet":"I ve moved several times with my husband and kids - kids were as young as 4, and most recently at age 11 and 13. Dealing with stuff can feel overwhelming,","messageBody":"<div id=\"ygrps-yiv-1410327535\">I&#39;ve moved several times with my husband and kids - kids were as young as 4, and most recently at age 11 and 13. Dealing with stuff can feel overwhelming, especially if I have an idea in my head of what it &quot;should&quot; look like. (Should is a different way of pressuring, like &quot;have to&quot; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/haveto\">http://sandradodd.com/haveto</a> )<br><br><div>What has worked best for me was to think about it in terms of cleaning up, and letting go of the pressure of moving. If I were just cleaning up the toy room or bedroom would I really want to get rid of this thing? Is it broken? Did she grow out of it? <br></div><div><br></div><div>Some toys aren&#39;t favorites but are still enjoyed when they are rediscovered. <br></div><div><br></div><div>As I organized in this way, I put each of the things I thought could be let go into a laundry basket. Once complete, I asked my girls to go thru the basket with me, to see if there was anything they wanted to keep. Most times they were ready to let things go, and anything they still felt attachment to simply went back into the playroom. A couple of items were photographed at my daughter&#39;s request, so she could keep a memory instead of the item. <br></div><div><br></div><div>I don&#39;t know how effective this would be with your husband&#39;s things. There are possibly many emotions tied to those items, it might be worth holding on until your daughter is older. <br></div><div><br></div><div>It has been important in our family to let the kids have control over what they can control. When we moved 2000 miles in April, they didn&#39;t have a choice to stay where their friends were. But they did get to choose to keep all the material things that make them happy. They do get to Skype their friends, and some friends are coming to visit over the next few months. I bring this up because moving is an upheaval, even a local move can be unsettling. A new home, making new friends, (a new school/homeschool charter in your case), being away from family - in all of these changes it can be a big help to at least have your physical space filled with things that are familiar and comforting. (And this is true for me as well as my kids)<br></div><div><br></div><div>There will always be another opportunity to reduce the amount of physical stuff you have. Moving may seem like an ideal time to do this, but it only works if you keep the things that are comforting to your daughter. <br></div><div><br></div><div>A last idea: I was part of a group of several unschooling moms who utilized the method outlined in Marie Kondo&#39;s book, The Life Changing Magic of Tidying Up. It really made a big difference in how I look at my own things. (And she is very specific that you should not purge anyone else&#39;s items, including/especially items belonging to children.) <br></div><div><br></div><div>Karen<br></div></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Returning (sort-of) to unschooling, and moving","postDate":"1529156977","msgId":78382,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdFMzBBNkIxLTBENzYtNEQxOS1BNEFFLUI5MzM4MEEyMDVFOUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PENBRDEzNjhGLTUwQUQtNEFGMi04RURBLTExOEI2MUQ2NUQ2MEBnbWFpbC5jb20+","referencesHeader":"PENBRDEzNjhGLTUwQUQtNEFGMi04RURBLTExOEI2MUQ2NUQ2MEBnbWFpbC5jb20+"},"prevInTopic":78381,"nextInTopic":78383,"prevInTime":78381,"nextInTime":78383,"topicId":78380,"numMessagesInTopic":0,"msgSnippet":"-=-I recognize that I have some deschooling to do. My daughter maybe also, but probably not that much, I’m thinking. No?-=- If your daughter has been in","messageBody":"<div id=\"ygrps-yiv-914538055\">-=-I recognize that I have some deschooling to do. My daughter maybe also, but probably not that much, I’m thinking. No?-=-<br/>\n<br/>\nIf your daughter has been in school half her life and you move to a charter school (still a school, but an alternative school), yes.  There will be deschooling.  <br/>\n<br/>\nYou’ll have as much deschooling to do as anyone, too.  And when people feel their deschooling is all behind them, another layer, another lump will come along from time to time, because the kids will become the ages the mom was when she experiences something new, or difficult, and buried memories or fears can come back up and need to be dealt with.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/deschooling\">http://sandradodd.com/deschooling</a><br/>\n<br/>\nThat leads to several pages of various people’s writing. There’s no reason to read it all at once, but it would be helpful to read it all gradually. :-)<br/>\n<br/>\nRead a little, try a little, wait a while, watch.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/readalittle\">http://sandradodd.com/readalittle</a><br/>\n<br/>\nI don’t know much to say about the physical stuff.  Others will be better.  I’m a packrat myself, and I see the advantages and disadvantages of stuff.  Probably more disadvantages, but still…<br/>\nPart of the question is how much house/storage you can afford. <br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Returning (sort-of) to unschooling, and moving","postDate":"1529155786","msgId":78381,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENEMTRDNEJBLTdBODQtNEU5Ri04MEQzLUFENkYzNDlENjU4Q0BzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PENBRDEzNjhGLTUwQUQtNEFGMi04RURBLTExOEI2MUQ2NUQ2MEBnbWFpbC5jb20+","referencesHeader":"PENBRDEzNjhGLTUwQUQtNEFGMi04RURBLTExOEI2MUQ2NUQ2MEBnbWFpbC5jb20+"},"prevInTopic":78380,"nextInTopic":78382,"prevInTime":78380,"nextInTime":78382,"topicId":78380,"numMessagesInTopic":0,"msgSnippet":"-=-We had been talking about unschooling I think even before birth. And then, when my daughter was 3.5, my husband died suddenly and unexpectedly. We were, and","messageBody":"<div id=\"ygrps-yiv-1043043577\">-=-We had been talking about unschooling I think even before birth. And then, when my daughter was 3.5, my husband died suddenly and unexpectedly. We were, and still are, living in a one bedroom house behind my in-laws, who have been vocally unsupportive of homeschooling.-=-<br/>\n<br/>\n-=-I have a lot of questions from time to time, but the biggest one right now is how to deal with all of our stuff. On the one-hand, we’ve amassed what most people say is way too much stuff and it would likely behoove us to purge before moving. -=-<br/>\n<br/>\nI’ve read the post twice, and it has an interesting arc.<br/>\n<br/>\nIs it possible that the unschooling plan is part of the ammased stuff that could be purged?<br/>\nSome kids are fine with school.  With one less adult in the family, it is possible that your daughter would enjoy being around other people (depending on her personality).  <br/>\n<br/>\nIf you work from home or somehow have enough money that you won’t need to work, then unschooling might be possible, but if it will make your life much harder to do that, maybe it’s okay to reconsider plans made before so many changes—made maybe even before your daughter was born.<br/>\n<br/>\nWhat does SHE want?<br/>\n<br/>\nThe lack of choice most kids have in school is one of the worst parts.  If someone feels stuck and powerless, it’s hard to relax and enjoy. <br/>\nUnschooling because it’s something you and your husband wanted, without asking your daughter, could create a school-style problem.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":552195120,"authorName":"sarah stone francisco","from":"sarah stone francisco &lt;sarah.stonefrancisco@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Returning (sort-of) to unschooling, and moving","postDate":"1529140238","msgId":78380,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBRDEzNjhGLTUwQUQtNEFGMi04RURBLTExOEI2MUQ2NUQ2MEBnbWFpbC5jb20+"},"prevInTopic":0,"nextInTopic":78381,"prevInTime":78379,"nextInTime":78381,"topicId":78380,"numMessagesInTopic":0,"msgSnippet":"Hi Sandra, Not sure how to start this so perhaps best to just jump in. We had been talking about unschooling I think even before birth. And then, when my","messageBody":"<div id=\"ygrps-yiv-1016690317\">Hi Sandra, <br/>\n<br/>\nNot sure how to start this so perhaps best to just jump in.<br/>\n<br/>\nWe had been talking about unschooling I think even before birth. And then, when my daughter was 3.5, my husband died suddenly and unexpectedly. We were, and still are, living in a one bedroom house behind my in-laws, who have been vocally unsupportive of homeschooling.<br/>\n<br/>\nWhen my husband died, I didn’t have a lot of capacity for providing all the attention and care my daughter needed. Luckily my in-laws were able to, which gave me the needed time and space to heal. I am so incredibly grateful to them for all of the support they’ve given us in innumerable ways. After six months it became clear that my daughter would need to go to preschool. I was still holding onto the hope of unschooling with her, but wasn’t able to take that on, yet. From that flowed kindergarten and first grade. She went to an amazing school, I truly can’t speak highly enough about it. <br/>\n<br/>\nIt’s been almost four years since my husband died and it is now clearly time for us to move homes so that we can start a new phase of life. In one month we’re moving to a small town 2.5 hours away from where we live now.  I’ve enrolled her in a homeschool charter so that we can have more opportunity to meet other homeschooling families and I can get in-person support in this whole process. She’ll be going to school one day a week with two additional field trips a month. Everything is optional and voluntary and the educational specialist we’ll work with are (apparently) used to work with unschoolers. <br/>\n<br/>\nI recognize that I have some deschooling to do. My daughter maybe also, but probably not that much, I’m thinking. No?<br/>\n<br/>\nI have a lot of questions from time to time, but the biggest one right now is how to deal with all of our stuff. On the one-hand, we’ve amassed what most people say is way too much stuff and it would likely behoove us to purge before moving. On the other hand, I keep looking at things and thinking, “wow, she might have an interest in this one day.” Some of it is my husband’s stuff and some mine, both from earlier times. That is really hard to figure out because she doesn’t yet have an attachment to any of it, so I could potentially throw it all out. But then I feel like I’m robbing her of the opportunity to explore that. I’m trying to get clearer on my question but it has something to do with helping her figure out what she doesn’t want right now or ever again, especially when she’s really more interested in doing something/anything else than pack ... and I don’t blame her! And there’s also the matter of her stuff. And, I don’t want to unnecessarily take over and get rid of something that she wanted or cajole her into figuring it all out with me.<br/>\n<br/>\nAny insight would be greatly appreciated. <br/>\nThank you!!!<br/>\n<br/>\nlove,<br/>\nsarah</div>","specialLinks":[]}],"prevTopicId":78448,"nextTopicId":78442}}