{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] But never redheads???","postDate":"1011114404","msgId":2658,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0Yy43NDRlZGMwLjI5NzViYmE0QGFvbC5jb20+"},"prevInTopic":2656,"nextInTopic":0,"prevInTime":2657,"nextInTime":2659,"topicId":2654,"numMessagesInTopic":0,"msgSnippet":"(about child abandonment and infanticide in 19th century Germany...) -=-...the figures in the south--the highest in Europe--being due to their practice of not","messageBody":"<div id=\"ygrps-yiv-1743939427\">(about child abandonment and infanticide in 19th century Germany...) <br/>\n-=-...the figures in the south--the highest in Europe--being due to their <br/>\npractice of not breastfeeding,300 since hand-fed babies died at a rate three <br/>\ntimes that of breast-fed babies.301-=-<br/>\n<br/>\nOne of the best things, for me, about breastfeeding, was the hormonal change <br/>\nin me when the baby was nursing.  It made me calm and patient--physically <br/>\ncalm and patient and loving, and having the baby&#39;s head there where I could <br/>\ntouch, see and smell it made me hugely protective of that baby, and made the <br/>\nbaby seem a true and continuing part of me and my existence.  So to find that <br/>\nthere were whole cultures in which breastfeeding was almost obliterated (kind <br/>\nof like 1950&#39;s U.S...) makes me physically react to the thousands of REALLY <br/>\nmiserable and sickly babies that kind of &quot;belief&quot; and action will cause.<br/>\n<br/>\nNote below that even a write being sympathetic to German infants referred to <br/>\nthem as &quot;worms&quot;:  <br/>\n<br/>\n-=-<br/>\nNineteenth-century doctors condemned the practice of German mothers refusing <br/>\nto breastfeed their babies, saying the pap made of flour and water or milk <br/>\nwas &quot;usually so thick that it has to be forced into the child and only <br/>\nbecomes digestible when mixed with saliva and stomach fluids. At its worst it <br/>\nis curdled and sour.&quot;303 Infants were so commonly hungry that &quot;those poor <br/>\nworms get their mouths stuffed with a dirty rag containing chewed bread so <br/>\nthat they cannot scream.&quot;304 Ende reports that for centuries &quot;One rarely <br/>\nencounters a German infant who is fully breastfed. Everywhere they got their <br/>\nmouths stuffed with Zulp, a small linen bag filled with breadSwaddled babies <br/>\ncould hardly get rid of these often dirty rags.&quot;305 Mothers who could afford <br/>\nit sent their newborn to wetnurses--commonly called Engelmacherin, <br/>\n&quot;angelmakers,&quot; because they were so negligent toward the children. -=-<br/>\n<br/>\nI haven&#39;t followed any footnotes.  Too scary as it is.<br/>\n<br/>\nI know of pewter &quot;feeding cans&quot; from England, and &quot;pap&quot; which was just <br/>\nre-hydrated by adding milk or water to what had been sitting in a pewter can <br/>\nalready for days sometimes.  They were left on a low shelf or by the fire, <br/>\nand babies could come along and sip out of the spout,  a straw-like thing <br/>\nwhich went to the bottom of the can.<br/>\n<br/>\nPewter itself is a lead-poisoning situation, even without spoiled milk and <br/>\ndays-old porridge in it, growing who-knows what.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://webpages.charter.net/jspeyrer/war2.htm\">http://webpages.charter.net/jspeyrer/war2.htm</a></div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] But never redheads???","postDate":"1011112807","msgId":2656,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1My43NDZmOGE1LjI5NzViNTY3QGFvbC5jb20+"},"prevInTopic":2655,"nextInTopic":2658,"prevInTime":2655,"nextInTime":2657,"topicId":2654,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/15/02 8:41:44 AM, Otterspur@aol.com writes:  First, I caution you who are offended by porn NOT to go to Google.com","messageBody":"<div id=\"ygrps-yiv-380698714\">In a message dated 1/15/02 8:41:44 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Otterspur@...\">Otterspur@...</a> writes:<br/>\n<br/>\n&lt;&lt; Curious!!! Why? &gt;&gt;<br/>\n<br/>\nFirst, I caution you who are offended by porn NOT to go to Google.com and <br/>\nenter wetnurse and redhead.  No, no, no.  <br/>\n<br/>\nBut putting in <br/>\n<br/>\n-=-<br/>\nEach advance in psychogenic mode diminishes the emotional distance between <br/>\nmother and child. The infanticidal mode of antiquity handled the anxiety <br/>\nposed by the infant&#39;s needs through measures which constantly threatened the <br/>\nchild&#39;s life, including regular infanticide by rich and poor alike. The <br/>\nmedieval mode of abandonment substituted continuous rejection of the child, <br/>\nwhether to wetnurse, fosterage or monastery. The ambivalent parent, beginning <br/>\nin the Renaissance, viewed the infant as at once both irrevocably evil and <br/>\ngreatly idealized. The intrusive mode of the eighteenth century produced a <br/>\nmother who could now guarantee the child some measure of her love but only <br/>\nunder the condition of total control of his emotions. And the currently <br/>\npredominant socializing mode uses covert manipulation of the child <br/>\npredominantly through guilt and the delegation of parental goals.<br/>\n<br/>\n-=-Each psychogenic mode in turn produces historically new adult <br/>\npsychospecies: the schizoid character of antiquity gives way to the autistic <br/>\ncharacter produced by the abandonment of medieval childhood, the late <br/>\nmedieval manic-depressive character being followed by the early modern <br/>\ncompulsive character, the result of intrusive mode parenting, and finally by <br/>\nthe various types of anxiety characters so commonly found in contemporary <br/>\nsociety.-=-<br/>\n<br/>\n. . . .<br/>\n<br/>\n-=-<br/>\nNot only was England in the seventeenth century ahead of the rest of Europe <br/>\nin child care, but it was more particularly the English middle class, from <br/>\nwhich so many American mothers were drawn, which first achieved these <br/>\nhistorically new attitudes toward children. At a time when the English <br/>\nnobility still sent their children out to wetnurse, numbers of brave English <br/>\nmiddle-class mothers, particularly Puritan mothers, who were encouraged to <br/>\npray with and watch closely over their children, began for the first time in <br/>\nhistory to face the enormous anxieties of actually relating with empathy to <br/>\nthe emotional needs of the infant at their breast. When, for instance, their <br/>\nbabies cried upon being swaddled, these mothers stopped complaining that man <br/>\nwas born in shackles&quot;, a phrase repeated ad nauseum since Pliny(8), and <br/>\ninstead empathized with their infants and tried leaving them unswaddled, over <br/>\nthe horrified objections of their doctors. Frenchmen thought the sight of <br/>\nthese unswaddled English infants &quot;deplorable&quot; and complained of the excessive <br/>\n&quot;indulgence of Mothers . . . among the English.&quot;(9)<br/>\n<br/>\n-=-It was from such mothers as these that the American personality was <br/>\nformed. Selected from among the most advanced, and isolated from the <br/>\n&quot;swamping&quot; effects of earlier-mode parents, American mothers became the first <br/>\nin history to face their ambivalent feelings and to begin to fashion the <br/>\nmodern intrusive mode of childrearing, a mode which was closer, more <br/>\nnurturant, more consistent and more controlling than any prior mode in the <br/>\nevolution of childhood. The evidence for this is everywhere.....-=-<br/>\n<br/>\n(from <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.psychohistory.com/htm/p105x115.htm,\">http://www.psychohistory.com/htm/p105x115.htm,</a> an article on the <br/>\nhistory of the U.S.)<br/>\n<br/>\nI&#39;m still looking at that article and other sources I found by looking up <br/>\n<br/>\ninfant care wetnurse history<br/>\n<br/>\n<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] But never redheads???","postDate":"1011112199","msgId":2655,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyLjE4YjY2MGZjLjI5NzViMzA3QGFvbC5jb20+"},"prevInTopic":2654,"nextInTopic":2656,"prevInTime":2654,"nextInTime":2656,"topicId":2654,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/15/02 8:41:44 AM, Otterspur@aol.com writes:  They thought personality traits were passed through breastmilk ( they","messageBody":"<div id=\"ygrps-yiv-246733323\">In a message dated 1/15/02 8:41:44 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Otterspur@...\">Otterspur@...</a> writes:<br/>\n<br/>\n&lt;&lt; Curious!!! Why? &gt;&gt;<br/>\n<br/>\nThey thought personality traits were passed through breastmilk (&quot;they&quot; being <br/>\nthe English in the Renaissance and thereafter, if I remember what I&#39;ve read  <br/>\ncorrectly) and redheads were...<br/>\n<br/>\nmean and grumpy, they thought, and it was better to bring babies up to be <br/>\n&quot;sweet tempered.&quot;  <br/>\n<br/>\nThe most interesting book I ever read about breastfeeding, I don&#39;t have.  It <br/>\nwas out of the university&#39;s library here and I renewed and renewed it until I <br/>\nfinally had to let them have their book back.  But it was by a female <br/>\nanthropologist (or two, I think) who were studying history and belief <br/>\nconcerning breastfeeding.  <br/>\n<br/>\nOne of their most interesting points goes against LLL teachings, and that is <br/>\nthat there are women who work in hotels in Puerto Rico but live on <br/>\nneighboring islands (Domincan Republic?  I forget their exact details), and <br/>\nthey live at the hotel for five days and go home for their two days off.  <br/>\nWhile they were gone, their mothers nursed the babies, and when they were <br/>\nhome the moms did, and their milk supplies didn&#39;t dry up, and the <br/>\ngrandmothers lactated easily to cover the other days.<br/>\n<br/>\nSince nobody thought it impossible or even weird, it was common.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":4283478,"authorName":"Otterspur@aol.com","from":"Otterspur@...","profile":"otterspur","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"But never redheads???","postDate":"1011108933","msgId":2654,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdkLjIwYTMzNWMyLjI5NzVhNjQ1QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":2655,"prevInTime":2653,"nextInTime":2655,"topicId":2654,"numMessagesInTopic":0,"msgSnippet":"... Curious!!! Why? Peace, Wynn","messageBody":"<div id=\"ygrps-yiv-902777655\">Sandra writes regarding the use of wet nurses:<br/>\n<blockquote><span title=\"ireply\"> &gt; (but <br/>\n&gt;  never redheads)<br/>\n<br/>\n </span></blockquote>Curious!!! Why?<br/>\n<br/>\nPeace,<br/>\nWynn</div>","specialLinks":[]}],"prevTopicId":2643,"nextTopicId":2541}}