{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":62434209,"authorName":"Jenny C","from":"&quot;Jenny C&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: What did you do at the beginning?","postDate":"1210964323","msgId":34928,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGcwa2xoMyttZm9vQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGcwazU0dCtudjNrQGVHcm91cHMuY29tPg=="},"prevInTopic":34925,"nextInTopic":0,"prevInTime":34927,"nextInTime":34929,"topicId":34917,"numMessagesInTopic":0,"msgSnippet":"... Well, I don t know about less energy... I had my first child when I was really young so I had a lot of energy!  None of my friends had children, and I","messageBody":"<div id=\"ygrps-yiv-672056895\"><blockquote><span title=\"ireply\">&gt; I only have a 2 and a half year old so far (planning on having one or<br/>\n&gt; two more children), and I&#39;m wondering: how was it when your kids were<br/>\n&gt; small?  What did your days look like?  What about friendships: did you<br/>\n&gt; make new ones and how did you go about doing that? Also: what did you<br/>\n&gt; do when you were pregnant and had less energy? <br/>\n<br/>\n </span></blockquote>Well, I don&#39;t know about less energy... I had my first child when I was <br/>\nreally young so I had a lot of energy!  None of my friends had <br/>\nchildren, and I didn&#39;t know any others with children besides my sis-in-<br/>\nlaw, so my daughter had cousins she saw sometimes.<br/>\n<br/>\nMy friends were great and loved my daughter and welcomed her coming <br/>\nalong to outings and whatnot.  I believed at the time that I didn&#39;t <br/>\nreally need to change my lifestyle just because I had a child, but that <br/>\nmy child could be incorporated into our lives.  We took her <br/>\neverywhere.  I was in college still and took her to classes.  I worked <br/>\nat an outdoor art and craft market on the weekends and took her with me <br/>\nsometimes.  <br/>\n<br/>\nWe lived rurally at the time, but close to a big city, so we were kind <br/>\nof isolated.  To do stuff we got out of the house a lot, A LOT.  We <br/>\nwere on the go frequently and she just came along.  She was easy going <br/>\nabout it, I think because that is how it was since she had been born.  <br/>\n<br/>\nBy the time she was 4, she really wanted to be around other kids, which <br/>\nalso coincided with me really needing a full time job for a while, so I <br/>\nput her into a child care.  We were talking about this last night.  I <br/>\nwas telling her how hard it was for me to take her there everyday and <br/>\nbe apart from her.  She, 14 now, told me that she loved going there, <br/>\nwhich I knew already, and it was the only way I was able to keep doing <br/>\nit.  If she had cried every time I left her there, I don&#39;t think I <br/>\ncould&#39;ve done it, but she never did, she was always happy to be there <br/>\nand happy to see me when I came to pick her up.<br/>\n<br/>\nThen a year later, we decided to homeschool, and I took her out of <br/>\nchildcare and took her with me to work, a different job, where I taught <br/>\ndance classes.  Then I continued doing that at a different dance <br/>\nteaching job where she wasn&#39;t the only homeschooled child that came to <br/>\nwork with her mom, pretty unusual, but that&#39;s what it was and it was a <br/>\nwonderful experience for both of us.  She was able to take all kinds of <br/>\nclasses like gymnastics, sports, spanish, arts and crafts, and the <br/>\nplace had a huge jungle gym that was about three levels or about 2 <br/>\nstories high in a huge room that was bigger than a gymnasium.  It was a <br/>\nkid&#39;s dream come true!<br/>\n<br/>\nThen I had my second child where my maternity leave coincided with the <br/>\nplace that I was working for going bankrupt and I was out of a job and <br/>\nat home fulltime for the first time since ever!  I&#39;ve tried other <br/>\nventures here and there since but nothing has really panned out, so we <br/>\ngo and do stuff just us girls and sometimes in the evening with dad <br/>\ntoo.  We team up and do things seperately too because my older daughter <br/>\nneeds to get out and my younger daughter never wants to.  A lot of our <br/>\ndays are spent at home and when dad gets home I go and do stuff with my <br/>\nolder daughter while my husband spends time with our younger daughter, <br/>\nit isn&#39;t perfect but it works for now.<br/>\n<br/>\nWe don&#39;t have a lot of homeschooling friends.  We need help in the <br/>\nfriends department.  I always have my feelers out, but it&#39;s pretty hard <br/>\nto make friends when we never go anywhere and we don&#39;t go places <br/>\nbecause my younger daughter makes it miserable more often than not when <br/>\nwe do go anywhere, not always, but often.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] What did you do at the beginning?","postDate":"1210954755","msgId":34925,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUxMERDQjU3LTQyMDQtNDJDMC05QjA2LTU3MDRENUQwRUEzRkBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGcwazU0dCtudjNrQGVHcm91cHMuY29tPg==","referencesHeader":"PGcwazU0dCtudjNrQGVHcm91cHMuY29tPg=="},"prevInTopic":34917,"nextInTopic":34928,"prevInTime":34924,"nextInTime":34926,"topicId":34917,"numMessagesInTopic":0,"msgSnippet":"-=-how was it when your kids were small? What did your days look like? What about friendships: did you make new ones and how did you go about doing that? Also:","messageBody":"<div id=\"ygrps-yiv-676654722\">-=-how was it when your kids were<br/>\nsmall? What did your days look like? What about friendships: did you<br/>\nmake new ones and how did you go about doing that? Also: what did you<br/>\ndo when you were pregnant and had less energy? -=-<br/>\n<br/>\nI lucked out hugely, when my three were little.  I was in a  <br/>\nbabysitting co-op (pre-Holly-birth too) of all La Leche Leaders and  <br/>\nsome of the invited others (I was an other; started to become a  <br/>\nleader but then didn&#39;t).  So we had several families whose kids knew  <br/>\nmine well, and some of those kids are still in our lives.  I got a  <br/>\ndance recital notice from one this morning!  Holly&#39;s going to the  <br/>\nbirthday party of another next week.<br/>\n<br/>\n<br/>\n<br/>\nSo with that, but somewhat even without it, we had one day a week  <br/>\nthat we went to a park just for the kids to play and the moms to  <br/>\nvisit and get to know the other kids better.   We had other kids who  <br/>\ncould come over and play, and though sometimes I was getting  <br/>\nbabysitting-co-op points for it, sometimes they were just over for  <br/>\nfun, or a parties.<br/>\n<br/>\nWe had lots of toys (lots used, and things to play with that weren&#39;t  <br/>\nspecifically toy-store things) and lots of kid-videos with sing- <br/>\nalongs and lots of recorded Sesame Street things (DVDs and internet  <br/>\nmake that all very easy these days).<br/>\n<br/>\nWe built a big sand box in the back yard and made a shade with sheets  <br/>\nand tent poles (a home-job, nothing bought) and on very hot days it   <br/>\nhelped to spray water on that shade cloth, and the kids would play  <br/>\nwith the hose in the sand.<br/>\n<br/>\nWe pulled all the sticker-plants out of our yard even before  we had  <br/>\nbabies, and so they could go barefooted outside which is a luxury in  <br/>\nthe desert.<br/>\n<br/>\nWe slept together, or I&#39;d sleep with the babies in another room when  <br/>\nmy husband really needed a full night&#39;s sleep for something pressing  <br/>\nor important.<br/>\n<br/>\nWhen we went on drives to see grandma or whatever, we&#39;d allow an  <br/>\nextra hour or two to stop and walk around at the side of the road, so  <br/>\nthe kids got to see and touch and explore and not be stuck in the car  <br/>\nso long.<br/>\n<br/>\nI&#39;d take them to the store when it wasn&#39;t crowded and we&#39;d take our  <br/>\ntime and look at things and talk about stuff and use the store as one  <br/>\nbig museum.<br/>\n<br/>\nWe would got to kid-food places with playgrounds so they could play  <br/>\nwhen it was cold or wet.<br/>\n<br/>\nWe didn&#39;t know we were going to homeschool.  We just considered it  <br/>\nall part of attachment parenting and a joyful childhood for them, but  <br/>\nit easily turned into unschooling, and there were two unschooling  <br/>\nfamilies in that co-op and two structured homeschooling families, so  <br/>\nI didn&#39;t have to do much research or angsty thought to decide what  <br/>\nand how, because I KNEW and could see that the unschooling families  <br/>\nwere happier and had better relationships than the other ones.<br/>\n<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":130027733,"authorName":"Bea","from":"&quot;Bea&quot; &lt;bmantovani@...&gt;","profile":"bmantovani","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"What did you do at the beginning?","postDate":"1210947549","msgId":34917,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGcwazU0dCtudjNrQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":34925,"prevInTime":34916,"nextInTime":34918,"topicId":34917,"numMessagesInTopic":0,"msgSnippet":"I only have a 2 and a half year old so far (planning on having one or two more children), and I m wondering: how was it when your kids were small?  What did","messageBody":"<div id=\"ygrps-yiv-1903824862\">I only have a 2 and a half year old so far (planning on having one or<br/>\ntwo more children), and I&#39;m wondering: how was it when your kids were<br/>\nsmall?  What did your days look like?  What about friendships: did you<br/>\nmake new ones and how did you go about doing that? Also: what did you<br/>\ndo when you were pregnant and had less energy? <br/>\n<br/>\nI live in Belgium where the overwhelming majority of people send their<br/>\nkids to daycare, and even the most mindful parents send their kids to<br/>\n&quot;school&quot; at 3 (only one person homeschools in my LLL group) and I&#39;m<br/>\nfeeling very lonely. I&#39;m moving to Montreal in 2 months and have found<br/>\na new homelearners group there that looks promising, so hopefully I<br/>\nwon&#39;t feel so lonely soon... (oh, and I&#39;m going to Live and Learn in<br/>\nSeptember :-)<br/>\n<br/>\n<br/>\nBea</div>","specialLinks":[]}],"prevTopicId":34915,"nextTopicId":34930}}