{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Live Free: Learn Free","postDate":"1086708964","msgId":19828,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFjZi4yMmZlNjdkZi4yZGY3MzZlNEBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":19827,"nextInTime":19829,"topicId":19828,"numMessagesInTopic":0,"msgSnippet":"This was just sent to me from another list: From:   folkypoet@aol.com (shana ronayne) Hi there - I m an unschooling mother who has just begun putting together","messageBody":"<div id=\"ygrps-yiv-1646910252\">This was just sent to me from another list:<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nFrom:   <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:folkypoet@...\">folkypoet@...</a> (shana ronayne)<br/>\n<br/>\nHi there -<br/>\n<br/>\n<br/>\nI&#39;m an unschooling mother who has just begun putting together a <br/>\n<br/>\nmagazine in the tradition of Growing Without Schooling.  I&#39;ve often <br/>\n<br/>\nfelt that there has been something missing in the <br/>\n<br/>\nhomeschooling/unschooling community for the past few years, and I <br/>\n<br/>\nwanted to do my part to put things right.  This is a project I&#39;ve <br/>\n<br/>\nbeen considering for some time now and have just embarked on with a <br/>\n<br/>\npassion.  <br/>\n<br/>\n<br/>\nThe magazine, Live Free: Learn Free, is a forum for unschoolers and <br/>\n<br/>\nrelaxed homeschoolers in which to share ideas, stories, and <br/>\n<br/>\nexperiences in a safe environment.  All the material (save for the <br/>\n<br/>\nintroduction to each issue) will be written by those who home <br/>\n<br/>\neducate - both parents (or other relatives) and children.  It will <br/>\n<br/>\nbe an inclusive magazine, not only for and by experienced <br/>\n<br/>\nunschoolers, but also for and by those just starting down the path.  <br/>\n<br/>\nIt will embrace those who are radical in their unschooling methods <br/>\n<br/>\nand those who are less so.  <br/>\n<br/>\n<br/>\nThe magazine will be small in the beginning - put together with <br/>\n<br/>\nlittle money and modestly printed.  I think that home educating <br/>\n<br/>\nfamilies will be more interested in the content than in the look of <br/>\n<br/>\nthe magazine.  My hope is that this notice finds a life of its own <br/>\n<br/>\nby being forwarded by interested homeschoolers from list to list.  <br/>\n<br/>\nThis seems like the way to reach the most people and to enable the <br/>\n<br/>\nmagazine to become a wonderful resource.  Really, the more people <br/>\n<br/>\nwho write for it, the more helpful it will become.  <br/>\n<br/>\n<br/>\nThat said, in my search for unschooling lists, I found you.  I <br/>\n<br/>\nbelieve that a magazine written by real homeschoolers at different <br/>\n<br/>\npoints in their journeys could be a very valuable resource for those <br/>\n<br/>\njust starting out.  I was not a member of this group until today, <br/>\n<br/>\nand I don&#39;t want to be seen as a spammer.  My motivation is to <br/>\n<br/>\ncreate something useful for the unschooling community, but I can&#39;t <br/>\n<br/>\ndo it alone.  I don&#39;t have the contacts on my own.  Not even close, <br/>\n<br/>\nreally.  I&#39;m a lurker, generally, posting only very rarely.  I&#39;ve <br/>\n<br/>\nbeen a member of the Uschooling-List for several years now and of <br/>\n<br/>\nthe RUL for about a year or so.  I also belong to several smaller <br/>\n<br/>\nunschooling lists.  I prefer, usually, to read other&#39;s posts and <br/>\n<br/>\nglean from them useful information that meets my needs at the time.  <br/>\n<br/>\nAnd, I guess that&#39;s one of the reasons behind my creating of Live <br/>\n<br/>\nFree: Learn Free: it&#39;s a magazine that allows readers to get a <br/>\n<br/>\nglimpse of how others live and learn.  <br/>\n<br/>\n<br/>\nIf you would be willing to post this notice, I&#39;d be very grateful.  <br/>\n<br/>\nIf you don&#39;t feel it meets the needs of your list members, just let <br/>\n<br/>\nme know.  Also, if you have any questions or would like anything <br/>\n<br/>\nclarified, please let me know.<br/>\n<br/>\n<br/>\nThank you,<br/>\n<br/>\nShana Hickman<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nLIVE FREE: LEARN FREE<br/>\n<br/>\n<br/>\nLIVE FREE: LEARN FREE is a new, soon-to-be-launched magazine.  In <br/>\n<br/>\nthe tradition of John Holt&#39;s GROWING WITHOUT SCHOOLING (for <br/>\n<br/>\ninformation on this amazing magazine, please visit Fun Books (a site <br/>\n<br/>\nowned by a homeschooling family with whom LIVE FREE: LEARN FREE is <br/>\n<br/>\nnot affiliated) at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.fun-books.com/gws.htm)\">http://www.fun-books.com/gws.htm)</a>, LIVE FREE: <br/>\n<br/>\nLEARN FREE strives to bring home educating families together by <br/>\n<br/>\npublishing articles, stories, and letters written by <br/>\n<br/>\nhome/unschooling parents and children.  All content (except the <br/>\n<br/>\nintroduction to each issue) will be written by readers and will <br/>\n<br/>\nfocus on one or more themes.  <br/>\n<br/>\n<br/>\nLIVE FREE: LEARN FREE is looking for parents and children involved <br/>\n<br/>\nin home education, particularly unschooling or relaxed/eclectic <br/>\n<br/>\nhomeschooling, to contribute to the first issue.  We&#39;ve decided to <br/>\n<br/>\njust dive right in and start with the &quot;Big S&quot;: Socialization.  It&#39;s <br/>\n<br/>\nusually the first concern relatives or well-meaning strangers voice, <br/>\n<br/>\nand it is often a deciding factor in a family&#39;s decision to educate <br/>\n<br/>\ntheir children at home.  It&#39;s a scary question, but does it have to <br/>\n<br/>\nbe?  Send us stories of your own experiences, your thoughts on the <br/>\n<br/>\nimportance or unimportance of socialization, what socialization has <br/>\n<br/>\ncome to mean for you and your family, etc.  Anything goes.  <br/>\n<br/>\n<br/>\nAdditionally, we&#39;d like to receive, on an ongoing basis, articles or <br/>\n<br/>\nletters about what works (or doesn&#39;t work) for you as home <br/>\n<br/>\neducators: lifestyle choices (such as bedtimes, chores, etc.), <br/>\n<br/>\ncurriculum/non-curriculum choices, resources, etc., as well as <br/>\n<br/>\nglimpses into the days and ways of an unschooling family.  This will <br/>\n<br/>\nbe a recurring section of the magazine.<br/>\n<br/>\n<br/>\nFinally, if there are changes occurring in your state&#39;s <br/>\n<br/>\nhomeschooling laws, we want to hear about it.  You can use LIVE <br/>\n<br/>\nFREE: LEARN FREE as another forum to reach as many home educators in <br/>\n<br/>\nyour state as possible.  <br/>\n<br/>\n<br/>\nThere is no monetary payment for contributors; however, each <br/>\n<br/>\ncontributing writer will receive a free copy of the magazine.  <br/>\n<br/>\nAdditionally, authors who request it will receive a frame-able <br/>\n<br/>\ncertificate thanking them for their contribution to LIVE FREE: LEARN <br/>\n<br/>\nFREE (a great incentive for kids of all ages).  <br/>\n<br/>\n<br/>\nPlease send all articles, stories, letters, etc. in the body of an <br/>\n<br/>\nemail or in an attached Word document.  Hard copies of contributions <br/>\n<br/>\nmay also be sent to our physical address for those without Internet <br/>\n<br/>\naccess.  <br/>\n<br/>\n<br/>\nThough we strive to print as much as possible, unfortunately not <br/>\n<br/>\nevery contribution will make it into LIVE FREE: LEARN FREE.  Whether <br/>\n<br/>\nwe use your article or not, you will receive a response from the <br/>\n<br/>\neditors.  We hope to have enough material to print a stellar first <br/>\n<br/>\nissue within about a month; however, we have not set a firm <br/>\n<br/>\ndeadline, as we don&#39;t know the amount of interest this notice will <br/>\n<br/>\ngenerate.<br/>\n<br/>\n<br/>\n*****<br/>\n<br/>\n<br/>\nWe are also looking for advertisers.  LIVE FREE: LEARN FREE is a <br/>\n<br/>\ngreat place to advertise your home- or home-education-friendly <br/>\n<br/>\nbusiness!  First issue rates for advertisers are as follows:<br/>\n<br/>\n<br/>\n$12 for 1/3 page<br/>\n<br/>\n$20 for 1/2 page<br/>\n<br/>\n$35 for full page<br/>\n<br/>\n<br/>\nPlease note: at this time, a page is five-and-a-half by eight-and-a-<br/>\n<br/>\nhalf inches.<br/>\n<br/>\n<br/>\nPlease send your advertisement image as a black-and-white JPEG or <br/>\n<br/>\nsimply email us the text if no image is needed.  Graphic design work <br/>\n<br/>\nfor your advertisement is available for an additional fee.<br/>\n<br/>\n<br/>\n*****<br/>\n<br/>\n<br/>\nPlease send contributions, advertising queries, inquiries, <br/>\n<br/>\nsubscription requests, and etc. to <br/>\n<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:folkypoet@...\">folkypoet@...</a><br/>\n<br/>\n<br/>\nor<br/>\n<br/>\n<br/>\nLIVE FREE: LEARN FREE<br/>\n<br/>\n1635 Pearl Avenue<br/>\n<br/>\nWichita Falls, TX 76301-5726<br/>\n<br/>\n<br/>\n*****<br/>\n<br/>\n<br/>\n**Also, feel free to forward this message to anyone who might be <br/>\n<br/>\ninterested.  Thank you for your interest in LIVE FREE: LEARN FREE!<br/>\n<br/>\n<br/>\n<br/>\nSincerely,<br/>\n<br/>\n<br/>\nShana Ronayne Hickman and Terry RW Whisenant (editors)</div>","specialLinks":[]}],"prevTopicId":19827,"nextTopicId":19830}}