{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Covert","from":"Covert &lt;covert@...&gt;","replyTo":"LIST","senderId":"Eex6fJryTUbMadwHZMJzGLwK58ik3EdqxISRScjYKGjEVe400B0oWILSX8jnp0kqVNbS4TSDYMWRr9KXuNgb70kbMwuO7g","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Japan news: Dumbing down of schoolchildren?","postDate":"970616736","msgId":13596,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDAxMDAzMjM0NS5JQUEyNzk5NUBzbXRwMi5kdGkubmUuanA+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":13595,"nextInTime":13597,"topicId":13596,"numMessagesInTopic":0,"msgSnippet":"Hi again all, An editorial here that appeared yesterday in a Japanese newspaper concerning a part of the education crisis that rarely gets reported: the","messageBody":"<div id=\"ygrps-yiv-1851513718\">Hi again all,<br/>\n<br/>\nAn editorial here that appeared yesterday in a Japanese newspaper <br/>\nconcerning a part of the &quot;education crisis&quot; that rarely gets reported: <br/>\nthe severe lack of library books available for schoolchildren in Japan.<br/>\n<br/>\nAre Japanese public school students getting dumbed down? Read the <br/>\nfollowing article for a look at yet another aspect of contemporary <br/>\neducation in Japan. <br/>\n<br/>\nRegards,<br/>\n<br/>\nBrian Covert<br/>\n(KnoK NEWS)<br/>\nin Osaka, Japan<br/>\n<br/>\n---------------------- <br/>\n<br/>\nThe Japan Times - Tuesday, October 3, 2000<br/>\n<br/>\n<br/>\n[Editorial:]<br/>\n<br/>\nDON&#39;T SHORTCHANGE YOUNG READERS<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.japantimes.co.jp/cgi-bin/geted.pl5?ed20001003a1.htm\">http://www.japantimes.co.jp/cgi-bin/geted.pl5?ed20001003a1.htm</a><br/>\n<br/>\n<br/>\nDespite all the talk about the need for educational reforms, little <br/>\nserious attention is being paid to a fundamental way in which Japan&#39;s <br/>\nschoolchildren are being shortchanged. Except among the educators <br/>\ndirectly involved, few have expressed concern over the Education <br/>\nMinistry&#39;s announcement that libraries in elementary and junior high <br/>\nschools nationwide are lacking the astonishing total of more than 65 <br/>\nmillion books -- books they should have if they were following the new <br/>\nstandards set by the ministry in 1993.<br/>\n<br/>\nThis means that, on average, each school is short 2,600 library books <br/>\nthat could be providing a wide range of information and knowledge to the <br/>\nnation&#39;s children. The 1993 standards were intended to raise the number <br/>\nof books on school library shelves by 1.5 times, on the basis of the <br/>\nnumber of pupils enrolled. Yet fully 70 percent of the elementary schools <br/>\nand 80 percent of the junior high schools acknowledged in a survey <br/>\nconducted in May 1999 that they have fewer books on their shelves than <br/>\nare recommended. This is so even though the Education and Home Affairs <br/>\nministries together have been allocating some 10 billion yen a year to <br/>\nmunicipalities to help them meet the new targets.<br/>\n<br/>\nToo many schools are failing to do so, since some 14 percent of <br/>\nelementary school libraries and nearly 22 percent of junior high school <br/>\nlibraries have fewer than half the books they should. The reason for this <br/>\nis not because enrollments are down, but because in the face of budget <br/>\nshortfalls some schools are using the funds for other purposes. Local <br/>\nschool boards are entitled to do this, but it strongly suggests that the <br/>\ninvaluable role school libraries can play in supplementing textbook <br/>\neducation is still not sufficiently recognized or appreciated.<br/>\n<br/>\nThis is regrettable at a time when so much attention is being focused on <br/>\nthe global information-technology revolution in which Prime Minister <br/>\nYoshiro Mori wants Japan to play a leading role. The great advantage that <br/>\ngood books can provide in stimulating young imaginations and encouraging <br/>\nthe development of natural curiosity is still minimized by an educational <br/>\nsystem that emphasizes textbook learning above all.<br/>\n<br/>\nSchool library-book shortages also stem in part from the fact that such <br/>\nlibraries, and indeed all libraries for the general public, are a recent <br/>\nhistorical development here. Japan&#39;s literacy rate rose to nearly 100 <br/>\npercent after school attendance became compulsory in the Meiji period <br/>\n(1868-1912), but the achievement was reached largely through textbooks <br/>\nauthorized by the Education Ministry. That suited the political and <br/>\nmilitary leaders of the time.<br/>\n                                                                <br/>\nWhen the first public library in the country opened in Tokyo in 1872, a <br/>\nfew private schools had modest libraries, but most schools&#39; book <br/>\ncollections were negligible. A greatly different situation began to <br/>\ndevelop soon after the end of World War II. Under the guidance of <br/>\nOccupation authorities, the Education Ministry issued a School Library <br/>\nHandbook in 1948. Two years later, in 1950, the Japan School Library <br/>\nAssociation was established, and this was followed by enactment of the <br/>\nSchool Library Law in 1953, authorizing funds to support public school <br/>\nlibraries. Since all schools in the country now have libraries, why are <br/>\nso many of them still failing to adequately provide the supplementary <br/>\nresources that pupils need?<br/>\n<br/>\nOne more reason is that it is not only books that are in short supply. <br/>\nJapan also suffers from a severe shortage of trained librarians. When <br/>\nEducation Ministry officials surveyed the schools last year, only 574 <br/>\nregistered librarians were recorded nationwide.<br/>\n<br/>\nThe ministry is now calling on prefectural boards of education to train <br/>\nand hire more school librarians. Any school with more than 12 classes <br/>\nwill be required to have a trained librarian on the staff from the start <br/>\nof fiscal 2003. That means the hiring of some 24,000 librarians by <br/>\nelementary and junior high schools around the country are needed, but the <br/>\naim is realistic only if bureaucrats and the public are made aware of the <br/>\nvital role they can play.<br/>\n<br/>\nQualified librarians could help to stem the premature predictions being <br/>\nheard in some quarters of the imminent demise of the printed book. It is <br/>\ntrue that publishers are lamenting falling book sales and their lists are <br/>\nincreasingly heavy with &quot;manga&quot; comics for adults. It is equally true <br/>\nthat the Internet and other communications advances are creating new ways <br/>\nfor books to reach the hands of readers. None of this means that the book <br/>\nis dead. A nation that does not promote reading will never be able to <br/>\ntake full advantage of the IT revolution. One way to ensure that books do <br/>\nnot disappear is to ensure that school libraries are able to fulfill <br/>\ntheir promise.<br/>\n<br/>\n<br/>\nThe Japan Times: Oct. 3, 2000<br/>\n(C) All rights reserved</div>","specialLinks":[]}],"prevTopicId":13392,"nextTopicId":13607}}