{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"HEM-Online-Newsletter  by way of Home Ed","from":"HEM-Online-Newsletter &lt;HEM-Editor@...&gt; (by way of Home Education Magazine)","profile":"hemhelen","replyTo":"LIST","senderId":"4c7Vq_ghrH-gpM9I8vzIa09mfndGqzEO5CY7WnzfvLWJ0K0HoSUcraXtQkWpEAaQ5sDtcLK1p5hWge8-V05EljjT46astJl2tN6DdoEHhAJ14RoZ0rRoNpuKipYU3NlAJfExSXtg9LBDHwjAu843CbYZ9_qCBdszeczrasrdUNQJow","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Home Education Magazine&#39;s Free Online Newsletter -  November 2000","postDate":"1004775150","msgId":27337,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PHAwNTAwMTliNGI4MDk1NzZhZGM2YkBbMjA4LjI2LjIyNy4yMTBdPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":27336,"nextInTime":27338,"topicId":27337,"numMessagesInTopic":0,"msgSnippet":"^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^ HOME EDUCATION MAGAZINE S ONLINE NEWS November 2001 ^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^ Welcome to HEM S ONLINE NEWS, a","messageBody":"<div id=\"ygrps-yiv-227768621\">^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^<br/>\n<br/>\nHOME EDUCATION MAGAZINE&#39;S ONLINE NEWS<br/>\nNovember 2001<br/>\n<br/>\n^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^<br/>\n<br/>\nWelcome to HEM&#39;S ONLINE NEWS, a free monthly newsletter published by <br/>\nHome Education Magazine and full of the best internet resources, <br/>\nhomeschooling news, announcements and article excerpts. For more <br/>\ninformation on Home Education Magazine, see the end of this <br/>\nnewsletter or visit our web site at <a rel=\"nofollow\" target=\"_blank\" href=\"http://home-ed-magazine.com\">http://home-ed-magazine.com</a> For <br/>\nsubscription information for the newsletter, scroll to the end, <br/>\nreading everything in between. Send your comments and questions to <br/>\neditor Carol Narigon at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Newsletter@...\">HEM-Newsletter@...</a>.<br/>\n<br/>\nIn the November issue:<br/>\n<br/>\n~ Will They Ever Learn to Read? ~<br/>\n~ Call for Learning Ideas ~<br/>\n~ Back Issue Sale ~<br/>\n~ Oglethorpe Wants You ~<br/>\n~ Certificate of Empowerment ~<br/>\n~ Homeschool Social Register ~<br/>\n~ American Homeschool Association ~<br/>\n~ Absurd Math ~<br/>\n~ One-to-One ~<br/>\n~ The Final Word ~<br/>\n<br/>\n** Planning your holiday gift giving? Check out our advertisers at <br/>\nthe end of the newsletter. They&#39;re offering good deals on learning <br/>\nresources for the whole family. **<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nThe biggest enemy to learning is the talking teacher. ~~ John Holt  ~~<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nWILL THEY EVER LEARN TO READ?<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com/HEM/186.html\">http://www.home-ed-magazine.com/HEM/186.html</a><br/>\n<br/>\n&quot;Your daughter will learn to read if you do one simple thing every <br/>\nday: read to her. Read books she enjoys, even if they have the word <br/>\n&quot;underpants&quot; in the title. Share books you liked when you were her <br/>\nage. Read silly books and classics, picture books and those with <br/>\nchapters. Use different voices as you read. Have fun acting the <br/>\nstories out sometimes. Relate other areas of your life to the book <br/>\nyou&#39;re reading when you&#39;re not reading it. Take a book or some other <br/>\nreading material with you whenever you might have to wait -- at the <br/>\ndentist&#39;s office or when you go to renew your driver&#39;s license. Make <br/>\nreading a fun and constant part of her life.<br/>\n<br/>\nYou don&#39;t have to be the only one to read with her. Subscribe to <br/>\nBoomerang audio magazine (boomkids.com), and check out books on tape <br/>\nat the library so you can both listen to books in the car or while <br/>\nyou&#39;re working on projects. Encourage your husband or her siblings to <br/>\nread with her. Read a special book with the whole family and then <br/>\nwatch the movie. Make reading a family affair.<br/>\n<br/>\nAnd don&#39;t just read books. Buy her a magazine subscription. Kids love <br/>\nmagazines! A couple of our favorites are American Girl <br/>\n(americangirl.com) and Hopscotch for Girls (hopscotchmagazine.com), a <br/>\ntopical magazine full of fiction and non-fiction stories that appeal <br/>\nto girls. There are lots of magazines for kids that cover almost any <br/>\ntopic she might enjoy. Check your local library for a current list.<br/>\n<br/>\nYou may be thinking how in the world will your daughter learn to read <br/>\nif you&#39;re the one doing all the reading? I promise you this: If your <br/>\ndaughter lives in a house where other people read frequently to her <br/>\nand to themselves, and reading materials such as books and magazines <br/>\nare available to her, she will learn to read and enjoy it. People who <br/>\ndon&#39;t learn to read either didn&#39;t grow up in an environment where <br/>\nreading is important, or they have a disability that prevents them <br/>\nfrom reading. Your daughter suffers neither. She will not discover on <br/>\nher eighteenth birthday that she&#39;s unable to read her birthday cards.&quot;<br/>\n~~ Carol Narigon ~~<br/>\n<br/>\nYou can read the rest of this column at the website above or in the <br/>\nNovember/December issue of Home Education Magazine, available by <br/>\nsubscription and at fine bookstores.<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nCALL FOR LEARNING IDEAS<br/>\n<br/>\nGreetings,<br/>\n<br/>\nAfter three long years I have convinced a publisher that the <br/>\nhomeschooling community has the ability and desire to create the <br/>\nultimate &quot;learning ideas&quot; book, a much needed alternative or <br/>\nsupplement to traditional learning methods.<br/>\n<br/>\nThe goal? To gather in one place the neatest, coolest, cheapest, <br/>\nweirdest, quickest, funniest, most exotic, exciting, and fun learning <br/>\nactivities we homeschooling families have joyfully stumbled upon <br/>\noutside of or alongside text book studies. We&#39;ll be focusing on ideas <br/>\nfor use with (about) 3- to 12-year-olds.<br/>\n<br/>\nYour participation, as always, is warmly invited. Simply send an <br/>\nemail to <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ldobson@...\">ldobson@...</a> with &quot;Idea Book&quot; as the subject. In the <br/>\nbody include your name, address and phone number. In return you&#39;ll <br/>\nreceive all of the information you need to submit your greatest <br/>\nideas, and my everlasting gratitude. Additionally, there&#39;s a copy of <br/>\nthe book for those contributors who submit five or more published <br/>\nideas.<br/>\n<br/>\nMore importantly, though, we&#39;ll help put the joy and fun of learning <br/>\ninto even more children&#39;s lives, and that will be a gift to them that <br/>\nkeeps on giving.<br/>\n<br/>\nI look forward to hearing from you!<br/>\nBest wishes,<br/>\nLinda Dobson<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nHEM&#39;S ANNUAL BACK ISSUE SALE!<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com/sale/bi.html\">http://www.home-ed-magazine.com/sale/bi.html</a><br/>\n<br/>\nHome Education Magazine is again offering an opportunity to stock up <br/>\non some great homeschool reading for the winter with our popular <br/>\nAnnual Back Issue Sale. Our office manager has selected our most <br/>\npopular theme packages for this sale. Whether you are interested in <br/>\nGetting Started or Unschooling you will find these packages full of <br/>\nuseful homeschooling insights. HEM never goes out of style!<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nOGLETHORPE WANTS YOU!<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.oglethorpe.edu/admission/jeo/index.htm\">http://www.oglethorpe.edu/admission/jeo/index.htm</a><br/>\n<br/>\nGood afternoon- I would like to notify home schooled students about a <br/>\nscholarship competition that Oglethorpe University in Atlanta <br/>\nsponsors each year. For the past three years a home schooled student <br/>\nhas won at least one of our five full-tuition, room and board James <br/>\nEdward Oglethorpe Scholarships for all four years of study (worth <br/>\nabout $100,000) and I would like to encourage more participation from <br/>\nthe home school community. Thanks!<br/>\n<br/>\nBarbara Henry &#39;85, Director of Admission<br/>\nphone: 404-364-8443<br/>\nemail: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:bhenry@...\">bhenry@...</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.oglethorpe.edu\">http://www.oglethorpe.edu</a><br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nUNSCHOOLING.COM<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n<br/>\nCertificate Of Empowerment<br/>\nby Sandra Dodd<br/>\n(This is intended for those who want to be &quot;certified.&quot; Feel free to <br/>\nprint this out for yourself or a friend.)<br/>\n<br/>\nAs bearer of this certificate you are no longer required to depend on <br/>\nthe advice of experts. You may step back and view the entire <br/>\nworld-not just your home, neighborhood or town, but the whole <br/>\nEarth-as a learning experience, a laboratory containing languages <br/>\n(and native speakers thereof), plants, animals, history, geology, <br/>\nweather (real live weather, in the sky, not in a book), music, art, <br/>\nmathematics, physics, engineering, foods, human dynamics, and ideas <br/>\nwithout end. Although collections of these treasures have been <br/>\nlocated in museums for your convenience, they are to be found <br/>\neverywhere else, too.<br/>\nThis authorizes you to experiment; to trust and enjoy your kids; to <br/>\nrejoice when your children surpass you in skill, knowledge or wisdom; <br/>\nto make mistakes, and to say, &quot;I don&#39;t know.&quot; Furthermore, you may <br/>\nallow your children to experience boredom without taking full <br/>\nresponsibility for finding them something to do.<br/>\n<br/>\nHenceforth you shall neither be required nor expected to finish <br/>\neverything you start. Projects, books, experiments and plans may be <br/>\ndiscontinued as soon as something more interesting comes along (or <br/>\nfor any other reason) without penalty, and picked up again at any <br/>\ntime in the future (or never).<br/>\n<br/>\nYou may reclaim control of your family&#39;s daily life, and take what <br/>\nsteps you feel necessary to protect your children from physical, <br/>\nemotional or social harm.<br/>\n<br/>\nYou have leave to think your own thoughts, and to encourage your <br/>\nchildren to think theirs.<br/>\n<br/>\nEach person who reads and understands this is authorized to extend <br/>\nthese privileges to others, by reproducing and distributing this <br/>\ncertificate or by creating another of his/her own design. Those who <br/>\ndon&#39;t feel the need to obtain approval to experiment, to think, or to <br/>\ndo things they&#39;ve never seen others do are exempt, as they didn&#39;t <br/>\nneed permission in the first place.<br/>\n<br/>\nUnschooling.com offers a free monthly newsletter, message boards, <br/>\nessays, an email list and more just for unschoolers. Check it out!<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nHOMESCHOOL SOCIAL REGISTER<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.homeschoolmedia.com/register/index.phtml\">http://www.homeschoolmedia.com/register/index.phtml</a><br/>\n<br/>\nThanks to the homeschooling pioneers of the 1980&#39;s and early 1990&#39;s, <br/>\nhomeschooling is legal everywhere in the U.S. and legal difficulties <br/>\nare infrequent. It is very important to realize, however, that all <br/>\nhomeschooling is local. One reason for this is that in most states <br/>\nschool superintendents have a great deal of latitude in the <br/>\ninterpretation and application of state law and court rulings to <br/>\nhomeschooling in their districts. But a far more important reason is <br/>\nthat the emotional support we all need to &quot;go against the crowd&quot; and <br/>\nkeep our children out of school is something that requires direct <br/>\nhuman contact.<br/>\n<br/>\nOf course, these days there&#39;s an abundance of excellent books and web <br/>\nsites devoted to homeschooling. But the kind of support I&#39;m talking <br/>\nabout can&#39;t be found in a book or downloaded from a web site!<br/>\n<br/>\nAnd that&#39;s why the Homeschool Social Register was created. It <br/>\nincludes almost every town and city in the United States and Canada <br/>\n(missing towns are easily added). Anyone who is homeschooling or <br/>\nthinking about it can list themselves on the page for their hometown <br/>\nor city. And, the Register provides a method of contacting any other <br/>\nlisted person without revealing anyone&#39;s email address or other <br/>\npersonal information. Since the Register is organized by towns and <br/>\ncities within each state, it&#39;s a simple matter to locate others who <br/>\nare homeschooling in your town or nearby. ~~ Dave Hirschman ~~<br/>\n<br/>\n  &lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nAMERICAN HOMESCHOOL ASSOCIATION<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.americanhomeschoolassociation.org\">http://www.americanhomeschoolassociation.org</a><br/>\n<br/>\nThe American Homeschool Association (AHA), is a service organization <br/>\ncreated in 1995 to network homeschoolers on a national level and to <br/>\nprovide news and information about homeschooling. Current AHA <br/>\nservices include a free discussion list providing news, information, <br/>\nnetworking, and resources; a &quot;Homeschooling and Libraries&quot; discussion <br/>\nlist, a free email newsletter; and a web site providing categorized <br/>\nlinks to some of the most helpful and informative pages of <br/>\nhomeschooling information on the Internet. The AHA is a free services <br/>\norganization. There are no membership fees, and no fees to use the <br/>\nservices provided by the AHA. For information contact: <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AHA@...\">AHA@...</a><br/>\n<br/>\n*AHA Networking Discussion List<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/AHA-Discussion\">http://groups.yahoo.com/group/AHA-Discussion</a><br/>\nor send a blank message to <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AHA-Discussion-subscribe@yahoogroups.com\">AHA-Discussion-subscribe@yahoogroups.com</a><br/>\n<br/>\n*AHA Homeschooling and Libraries List:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/AHA-LibraryList\">http://groups.yahoo.com/group/AHA-LibraryList</a><br/>\nor send a blank message to <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AHA-LibraryList-subscribe@yahoogroups.com\">AHA-LibraryList-subscribe@yahoogroups.com</a><br/>\n<br/>\n*AHA Free Email Newsletter<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/AHA-Newsletter\">http://groups.yahoo.com/group/AHA-Newsletter</a><br/>\nor send a blank message to <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AHA-Newsletter-subscribe@yahoogroups.com\">AHA-Newsletter-subscribe@yahoogroups.com</a><br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nABSURD MATH<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.hrmvideo.com/abmath\">http://www.hrmvideo.com/abmath</a><br/>\n<br/>\nWhew! You&#39;re lucky I got this newsletter done in time! I took a <br/>\nminute to check out this Absurd Math (pre-algebra from another <br/>\ndimension) website and before I knew it a rather significant amount <br/>\nof time had passed. These interactive math games are insidiously <br/>\nsilly and fun to play, and they&#39;re not all that easy. A precious <br/>\n10-year-old could play them alone without frustration, as could most <br/>\nteens and adults. Younger kids might enjoy doing them with someone <br/>\nolder.<br/>\n<br/>\nOnce you&#39;ve met the pre-algebra challenges, you can go on to an <br/>\nalgebra and geometry game that&#39;s obviously more difficult. Better <br/>\ntake some snacks to your computer. You may be there a while.<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nONE-TO-ONE<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.nezertbooks.com\">http://www.nezertbooks.com</a><br/>\n<br/>\nThose of you who live in the UK, those who like to take a look at <br/>\nhomeschooling from an international point of view or those who would <br/>\nlike to see what a Waldorf education might look like in a homeschool <br/>\nsetting will want to read &quot;One-to-One: A Practical Guide to Learning <br/>\nat Home Age 0-11.&quot; The book is a family affair, written by Martin and <br/>\nSophie Williams and illustrated by their children Sarah, Emma and <br/>\nChris.  The kids even provided the cartoons.<br/>\n<br/>\nPart indictment of the public school system, part instruction manual <br/>\nand part curriculum guide, the book is an eclectic mix of <br/>\ninformation, suggestions and practical instruction. Along with an <br/>\noverview of the shortcomings of education, the book offers <br/>\ninformation on how to teach art, math(s), gardening, cooking, crafts <br/>\nand more, as well as suggestions for how to make the best of a public <br/>\nschool situation. For instance, the math chapter shows how to teach <br/>\nbasic operations including addition, subtraction multiplication, <br/>\ndivision, fractions, time and more; offers a list of games that use <br/>\nmath (including instructions for many such as Whist, Racing Demon and <br/>\nBattleships); and gives an overview of the best way to teach math to <br/>\nkids.<br/>\n<br/>\nThere&#39;s a lot of information in this book and I liked its diverse <br/>\napproach. Beginning homeschoolers would find a firm base for relaxed <br/>\nhomeschooling here. The author&#39;s condemnation of the school system <br/>\nmay seem harsh to some, but he gives concrete advice on helping <br/>\nchildren negotiate the school system if the child must go to school <br/>\nas well. If the book sounds like a tossed salad of ideas, opinions, <br/>\ninformation and how-to&#39;s, that&#39;s exactly what it is. I enjoyed <br/>\nreading it and I think many of you would too. ~ CN ~<br/>\n<br/>\n^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^<br/>\n<br/>\nHEM ONLINE NEWS UNCLASSIFIED ADVERTISING<br/>\n<br/>\nFor information on purchasing unclassified advertising space in this <br/>\nnewsletter, please contact the editor at <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Newsletter@...\">HEM-Newsletter@...</a>.<br/>\n<br/>\n________<br/>\n<br/>\nGIVE YOUR CHILD THE HEADSPROUT READING ADVANTAGE<br/>\nHeadsprout.com<br/>\n<br/>\nHeadsprout Reading is the fun, Internet-delivered beginning reading <br/>\nprogram that gives yours child a real advantage by systematically <br/>\nteaching essential skills and strategies ensuring reading success and <br/>\nconfidence. After just five 20-minute animated, interactive episodes, <br/>\nchildren read their first Headsprout book. Act quickly. For a limited <br/>\ntime, Headsprout Reading is offering a special introductory promotion <br/>\nof the first 5 episodes free and the entire program for an additional <br/>\n10% discount or a $9.95 savings at: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.headsprout.com\">http://www.headsprout.com</a> . <br/>\nPlease enter the promotional code: HENJ1<br/>\n  ________<br/>\n<br/>\nLEARNING SKILLS FOR LIFE<br/>\niKnowthat.com<br/>\n<br/>\nWhat does your child need to succeed? Lifelong learning skills. <br/>\nExperts say that&#39;s what our children will need to keep up in <br/>\ntomorrow&#39;s rapidly changing world. Now there&#39;s a powerful new <br/>\nweb-based community that can help your child develop such <br/>\nmeta-learning skills. Try it risk-free at: <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.iknowthat.com/com?CO=01HEM01&quot;\">http://www.iknowthat.com/com?CO=01HEM01&quot;</a><br/>\n_________<br/>\n<br/>\nUSBORNE<br/>\nUsborneAmerica.com<br/>\n<br/>\nNew titles for fall and winter are here -- including Internet-Linked <br/>\nhistory and science books! Shop online and earn FREE and discounted <br/>\nbooks. Visit our Books from Britain bookstore at: <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.UsborneAmerica.com\">http://www.UsborneAmerica.com</a> Home business opportunity information <br/>\navailable onsite. Email <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SharonVE@...\">SharonVE@...</a> or call 888-474-8499 toll <br/>\nfree. Sharon Vander Ende, Independent Executive Supervisor.<br/>\n_________<br/>\n<br/>\nGNARLY MATH<br/>\nGnarlymath.com<br/>\n<br/>\nHILARIOUS MATH STOCKING-STUFFERS! Give your kids, yourself, or your <br/>\nfriends a Math Christmas. Only $4.95 buys 12 issues of the Gnarly <br/>\nGnews on a floppy disk, and $35.50 gets you our CD-ROM Solid Gold <br/>\nGnarly Math, moneyback-guaranteed to refresh your own math and <br/>\nintrigue your youngsters. Order the CD or floppy at <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.gnarlymath.com\">http://www.gnarlymath.com</a> , where you can also subscribe to the <br/>\nGnews. This month our hilarious free newsletter takes you to the <br/>\nfamous island of Nomath, a country without numbers.<br/>\n<br/>\n_________<br/>\n<br/>\nTHE RESOURCEFUL HOMESCHOOLER<br/>\nresourcefulhomeschooler.com<br/>\n<br/>\nAttention unschoolers and eclectic homeschoolers! The Resourceful <br/>\nHomeschooler carries great books, science materials and kits, <br/>\nlearning games, and the most interesting software. 15% DISCOUNT ON <br/>\nYOUR FIRST ON-LINE ORDER OVER $75. Coupon Number HEM-59999. Gift <br/>\ncertificates, a search service AND here is your opportunity to clear <br/>\nsome shelf space! List or consign your surplus or used homeschooling <br/>\nmaterials. Store credit available for consignments. Visit <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.resourcefulhomeschooler.com\">http://www.resourcefulhomeschooler.com</a> or call (877)523-0494. Great <br/>\nmaterials for independent learners of all ages.<br/>\n_________<br/>\n<br/>\nHOME EDUCATION MAGAZINE<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com\">http://www.home-ed-magazine.com</a><br/>\n<br/>\nWith the November/December issue, Home Education Magazine welcomes <br/>\n(back) unschooling advocate and popular conference speaker Sandra <br/>\nDodd. Sandra wants nothing more than to make you think, and she has a <br/>\npretty entertaining way of doing it.<br/>\n<br/>\nYou&#39;ll also enjoy articles on feminism, reading, untypical days, and <br/>\nwhat happens when the lab calls to say your brain is ready. Columns <br/>\ninclude: Peter Kowalke on when grown homeschoolers read; Linda Dobson <br/>\non the most important media coverage to date; Laura Weldon on <br/>\ndecompression and spelling; and Barbara Theisen on O Tannenbaum. <br/>\nOther columnists include Larry and Susan Kaseman, Becky Rupp, David <br/>\nAlbert, and Carol Narigon.<br/>\n<br/>\nSPECIAL SUBSCRIPTION OFFER<br/>\nSend a holiday gift subscription of Home Education Magazine for 2002! <br/>\nWe&#39;ll send a letter with your personalized note announcing the gift <br/>\nto start with the Jan/Feb, 2002 issue, or you can order the Nov/Dec, <br/>\n2001 issue for presentation or mailing. All at a 30% discount!  Order <br/>\nyour gift subscription online at <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com/sale/_giftsub.html.\">http://www.home-ed-magazine.com/sale/_giftsub.html.</a> Take advantage of <br/>\nthis offer for yourself at <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com/sale/_hemonline.html.\">http://www.home-ed-magazine.com/sale/_hemonline.html.</a> Or contact us <br/>\nat: Home Education Magazine, PO Box 1083, Tonasket WA 98855; for <br/>\norders: toll-free 1-800-236-3278; email <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:orders@...\">orders@...</a>. <br/>\nMC/Visa cards accepted. DON&#39;T MISS IT!<br/>\n<br/>\n<br/>\n_________<br/>\n<br/>\n^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^<br/>\n<br/>\nFINAL WORD<br/>\n<br/>\nI never teach my pupils; I only attempt to provide the conditions in <br/>\nwhich they can learn. ~~ Albert Einstein ~~<br/>\n<br/>\n^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^<br/>\n<br/>\nThanks for reading HEM&#39;s Online News! Pass it on to your friends! To <br/>\nsubscribe, visit our web site at <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com/wlcm_hemnewsltr.html\">http://www.home-ed-magazine.com/wlcm_hemnewsltr.html</a> or send an email <br/>\nto <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:majordomo@...\">majordomo@...</a> with the words subscribe <br/>\nhem-online-newsletter followed by your name@your address.com in the <br/>\nbody of the email. (e.g. subscribe hem-online-newsletter <br/>\nyouremailaddress). To unsubscribe, send an email to <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:majordomo@...\">majordomo@...</a> with the words unsubscribe <br/>\nhem-online-newsletter followed by your name@your address.com in the <br/>\nbody of the email. (e.g. unsubscribe hem-online-newsletter <br/>\nyouremailaddress). To change the address at which you receive the <br/>\nnewsletter, unsubscribe your old address and then subscribe to your <br/>\nnew one.<br/>\n<br/>\nSee you next month!<br/>\n<br/>\nCarol Narigon, Newsletter Editor<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Newsletter@...\">HEM-Newsletter@...</a><br/>\nMark and Helen Hegener, Publishers of Home Education Magazine</div>","specialLinks":[]}],"prevTopicId":27257,"nextTopicId":27226}}