{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Time warp oddity","postDate":"1320350217","msgId":63681,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI3MzNGMkIyLTUwM0EtNDM1RS1CNkM5LUNBMEE1Q0QyNjE2MUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":63680,"nextInTime":63682,"topicId":63681,"numMessagesInTopic":0,"msgSnippet":"Several posts have come through dated last week or further back.  I had seen most of them, but not all, but I had seen them in the queue.  If they re","messageBody":"<div id=\"ygrps-yiv-779210412\">Several posts have come through dated last week or further back.  I had seen most of them, but not all, but I had seen them in the queue.  If they&#39;re duplicates, I would rather see them twice than not at all, and if they&#39;re not duplicates, please take time to look at them, and the dates, and give responses if you can because people might have been waiting a week. ;-)<br/>\n<br/>\nThanks.<br/>\n<br/>\nAnd the time warp phrase came to mind because of a piece of writing sent to me about Thinking Sticks.  I&#39;m going to put it on my site, linked from the Thinking Sticks page, but I haven&#39;t yet.   (Not my writing from here down.  —Sandra)<br/>\n<br/>\n----------------------------------<br/>\n<br/>\nHow I use my Thinking Sticks<br/>\n<br/>\nBelieve it or not, writers are not always keen to speak publicly.  We are often more comfortable quietly jotting our ideas down and publishing them in a blog. This is one reason why Sandra Dodd’s Thought Manipulatives have become a staple in my creative writing and poetry workshops.  They provide a fun and non-threatening way for writers of all ages and backgrounds to explore and discuss their points of view. Finding prompts that appeal to diverse ages and experience levels can be challenging.  Conversely, it is this diversity that makes for the most interesting and effective writing workshops. Thinking Sticks provide an opportunity for everyone to share their unique observations and talk through story ideas before they write anything down.  Over the years I have used Thinking Sticks about ten different ways, but here are a couple of my “tried and true” favorites. Warning: They can make it impossible for your pen to keep up with your brain.<br/>\n<br/>\n1. The start of a haiku or epic novel is only two words away….<br/>\n<br/>\nAs a warm-up everyone chooses two sticks and turns them face up so that the whole group can see the two words.  Participants then take turns explaining the connection between their two words. As an added challenge try to explain the connection in one sentence. These connections can be the jumping off point for a new story or poem.  The sentence can often be turned into Haiku, free verse poem, or epic novel... you just never know how far two words can take you. Here is a haiku written by a student using the words “jungle” and “time”<br/>\n<br/>\nTime means nothing in                                                                                                                                                                   <br/>\nthe jungle, where patience grows  <br/>\nwith wild abandon.<br/>\n<br/>\n2. How to write a “Community” Poem.<br/>\n<br/>\nThis time everyone gets just one stick (and chooses one of the two words). Each person is then challenged to write a line or two of poetry explaining the connection between their word and a randomly chosen “community word.“ Let’s say the community word is “music” and my word is “mountain”.  My line might be something like…                                                                                                                                                        “<br/>\nA Mountain’s music can only be heard by those who climb quietly and listen carefully.” <br/>\n<br/>\nIf your word is “Moon” maybe you would write something like…                                                                           <br/>\n “The moon cannot make its own music, so we must sing out loud”<br/>\n<br/>\nIf we put them together….                                                                                                                                                       <br/>\n “To hear a mountain’s music, climb quietly and listen carefully. Until you reach the summit where the silent moon will be waiting for you to sing the song out loud.”<br/>\n<br/>\nAll the lines can be pieced together to form a community poem about “music”. I suggest reading through the lines as a group to decide on an “opening” and “closing” line. This will help set a tone for the poem. The rest will mostly fall into place. It’s easy to do and the results are brilliant. Sometimes a little “tweaking” is needed. For example all lines may need to be converted into “first person” or “past tense” so that there is consistency throughout the piece.  It’s important to be open-minded and think outside the box, as some lines may not have a clear fit. This may take a little extra creativity and flexibility. These “hard to fit” lines, often turn out to be the best lines in the poem. So have fun and don’t give up too easily. The great thing is that you don’t have to be a part of a writing workshop to use Thinking Sticks as a writing prompt. A family gathered around a dinner table, or group of friends captive to a mini-van on a road trip can write a community poem using Thinking Sticks.<br/>\n<br/>\nFor more information on Poetry and Creative Writing Workshops please contact at RaundiMooreKondo@(I&#39;ll put those at the site, but not here...)</div>","specialLinks":[]}],"prevTopicId":63671,"nextTopicId":63593}}