{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":113028911,"authorName":"Dnowens@aol.com","from":"Dnowens@...","profile":"hsmominoz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] grasping unschooling","postDate":"1036174203","msgId":49035,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE4OS4xMDkxYjA0Zi4yYWY0MWQ3YkBhb2wuY29tPg=="},"prevInTopic":48997,"nextInTopic":0,"prevInTime":49034,"nextInTime":49036,"topicId":48997,"numMessagesInTopic":0,"msgSnippet":"In a message dated 11/1/02 12:38:19 AM Central Standard Time, tcee1@fuse.net ... I wouldn t say that I plan any learning. But, then again, I do. I do go out ","messageBody":"<div id=\"ygrps-yiv-198968878\">In a message dated 11/1/02 12:38:19 AM Central Standard Time, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:tcee1@...\">tcee1@...</a> <br/>\nwrites:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I really thought that I had a handle on what unschooling is. The definitions <br/>\n&gt; I see here totally resonate with me. And everything I have read, I feel <br/>\n&gt; comfortable with. However, I am struggling on what it &quot;looks&quot; like IRL, if <br/>\n&gt; that makes any sense. Do you &quot;plan&quot; any learning? <br/>\n<br/>\n </span></blockquote>I wouldn&#39;t say that I &quot;plan&quot; any learning. But, then again, I do. I do go out <br/>\nof my way to make sure they have the tools to be able to interact when we go <br/>\nsomewhere. Both my kids like to help cook (Moly is really taking off and is <br/>\ndoing a lot of things on her own.) before we go to the store, I make a list. <br/>\nUsually the day before we go, I tell the kids. I also remind them if there is <br/>\nanything they are wanting to fix, they need to look up the recipe, check for <br/>\nneeded ingredients, and add to the list. I also give them their own money. So <br/>\nright there, they have learned planning, research skills, cooking, nutrition, <br/>\nmoney skills, shopping savvy... The thing is, though, I don&#39;t think of a trip <br/>\nto the store like that. I can break it down here, but I don&#39;t go about my day <br/>\nthinking of ways to help my kids learn a specific subject. I think that is <br/>\nwhere the hang-ups start. We start thinking too much about what they should <br/>\nknow, right now, and how can we set up a situation to make that happen. <br/>\nInstead of just letting it happen in its own time. That isn&#39;t to say that I <br/>\ndon&#39;t plan something&#39;s, I said above that I do. I plan things because that is <br/>\nme, I&#39;m a planner with lists all over. But I don&#39;t make set up situations, or <br/>\nplan a trip to the grocery store just so the kids will learn all the things <br/>\nabove. I don&#39;t set up the check out time as a math lesson on money. I don&#39;t <br/>\nset up the produce aisle as a lesson in nutrition. <br/>\n<br/>\nI believe whole heartedly that my boys(age 5 yrs) can and will learn without <br/>\nhaving <br/>\n<blockquote><span title=\"ireply\"> &gt; curriculums to follow, and without me formally teaching them everything. <br/>\n&gt; But, I don&#39;t really get how the whole picture goes together. Do you set up <br/>\n&gt; or &quot;stage&quot; things, then see if they get interested in something, and then <br/>\n&gt; find more info and/or activities to relate to that subject? Or, do you just <br/>\n&gt; kind of go about your day with your interests and let them discover things <br/>\n&gt; on their own and ask you questions?<br/>\n<br/>\n </span></blockquote>I do and I don&#39;t. When I set Jack up in Karate lessons, my motive wasn&#39;t to <br/>\nget him into karate, or even see if he liked karate. My motive was this, &quot;my <br/>\nlittle guy looks bored sometimes, and then he starts running around, picking <br/>\non his sister, and this house is too small...&quot; Then the parks and rec. <br/>\ncatalogue came one day and I was looking through it and saw something&#39;s I <br/>\nthought would be fun, so I gave it to the kids and said, &quot;Why don&#39;t you guys <br/>\npick out something fun to do.&quot; Jack picked Karate and Moly picked an acting <br/>\nclass. (which because of low enrollment got canceled and because she wasn&#39;t <br/>\nthe right age or right grade she couldn&#39;t join the other classes. Is <br/>\nchildhood age discrimination allowed?) So now they are both in Karate and <br/>\nboth love it. I didn&#39;t pick the class, they did. I saw a need for a better <br/>\noutlet for their energy and gave them the tools to do it. <br/>\n<br/>\n I don&#39;t mean that I would just sit around eating bon-bons and not have to be <br/>\npresent <br/>\n<blockquote><span title=\"ireply\"> &gt; , but I guess it just doesn&#39;t seem like we have enough excitement around <br/>\n&gt; here. I am worried that I somehow need more to spur their curiosity? They <br/>\n&gt; really seem bored at times. I keep thinking, how can they be bored already, <br/>\n&gt; they are only 5! I hope this question is clear. <br/>\n&gt; Can anyone help me understand? <br/>\n&gt; <br/>\n </span></blockquote>And if you have noticed a need to fill &quot;boredom,&quot; (which I do believe is okay <br/>\nto be and have at times in your life). Then give the kids better things to <br/>\nwork with and play with. Hand them the parks and rec. catalogue, rotate some <br/>\nnew/old toys in and out. Move the crayons and paper to a more accessible <br/>\nlocation. Leave the entertainment section of the newspaper out, or read it <br/>\nout loud to them. Help them be participants in life instead of just tagging <br/>\nalong beside you. Give them money to spend when they are at the store, let <br/>\nthem see you making the grocery list and ask them if there is anything they <br/>\nneed so you can put it on the list. But don&#39;t make it fake. Ask them just <br/>\nlike you ask any adult. &quot;Honey, I&#39;m going to the store later, do you need <br/>\nanything?&quot; Darin usually says deodorant or a new toothbrush and sometimes he <br/>\nsays &quot;Yeah, get me some of those things you got that one time with the....&quot; &lt;<br/>\ng&gt; My best advice is to not try too hard. Just include them in your life. <br/>\nDon&#39;t make them do a book report. Listen to them when they come to you and <br/>\ntell you all about this new character who put a kink in the hero&#39;s plans. <br/>\n<br/>\n~Nancy<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] grasping unschooling","postDate":"1036133971","msgId":48997,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5Ni5mZjY5YWYyLjJhZjM4MDUzQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":49035,"prevInTime":48996,"nextInTime":48998,"topicId":48997,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/31/02 11:38:18 PM, tcee1@fuse.net writes: ","messageBody":"<div id=\"ygrps-yiv-1134170994\">In a message dated 10/31/02 11:38:18 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:tcee1@...\">tcee1@...</a> writes:<br/>\n<br/>\n&lt;&lt;  I believe whole heartedly that my boys(age 5 yrs) can and will learn <br/>\nwithout having curriculums to follow, and without me formally teaching them <br/>\neverything. But, I don&#39;t really get how the whole picture goes together. &gt;&gt;<br/>\n<br/>\nGradually.<br/>\nImperceptibly sometimes.<br/>\nLumpily, in fits and starts.<br/>\n<br/>\nYou can think of an unschooling month as a month of Sundays (unless you have <br/>\nreally structured Sundays, in which case substitute a month of Saturdays).<br/>\nYou can think of it as the best summer vacation days you can ever remember, <br/>\nwithout end.<br/>\n<br/>\n&lt;&lt;Do you set up or &quot;stage&quot; things, then see if they get interested in <br/>\nsomething, and then find more info and/or activities to relate to that <br/>\nsubject? &gt;&gt;<br/>\n<br/>\nSometimes, sort of, but not regularly or intentionally.   I might leave <br/>\nmagnets out.  But I&#39;m not hoping to trigger anyone to be a physicist or <br/>\nchemist or electronics engineer.  I put the castle blocks out from time to <br/>\ntime, but I don&#39;t aim for medieval history or structural engineering.<br/>\n<br/>\nIf I do notice something sparks that sparkle, though, I&#39;ll put another <br/>\nsimilar thing in the path within a day or a week if it&#39;s easy to do and if I <br/>\nremember.<br/>\n<br/>\n&lt;&lt;Or, do you just kind of go about your day with your interests and let them <br/>\ndiscover things on their own and ask you questions?&gt;&gt;<br/>\n<br/>\nSometimes, and sometimes I ask them questions.  I go about OUR day with OUR <br/>\ninterests.  Sometimes it flows together, and sometimes it granulates apart.<br/>\n<br/>\n&lt;&lt; but I guess it just doesn&#39;t seem like we have enough excitement around <br/>\nhere. I am worried that I somehow need more to spur their curiosity?&gt;&gt;<br/>\n<br/>\nNot every day has to be exciting.  But SOME days should be exciting.  <br/>\nSometimes it will be something you planned, and sometimes excitement will be <br/>\nthrust upon you when you least expect it.<br/>\n<br/>\nBe loose enough that if a wave comes you can ride it.<br/>\n<br/>\n&lt;&lt;They really seem bored at times. I keep thinking, how can they be bored <br/>\nalready, they are only 5! &gt;&gt;<br/>\n<br/>\nWhy should older people be bored more easily than younger ones?  I would <br/>\nthink that the more able to do and be independently, the less need for <br/>\nboredom.<br/>\n<br/>\nWhat I think about boredom (and I thought about it a long time) is here:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/BoredNoMore\">http://sandradodd.com/BoredNoMore</a><br/>\n<br/>\nWhen you&#39;ve read that if you like it any, click on the &quot;other articles&quot; link <br/>\nat the bottom.<br/>\nI think lots of that will be helpful.<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":48996,"nextTopicId":48925}}