{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":47,"messages":[{"userId":141316284,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] unschooling trashed  in this article","postDate":"1246742612","msgId":46279,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRBNEZDODU0LjUwMDA1MDdAbWFjLmNvbT4=","inReplyToHeader":"PDU1RUZGNUQwLUI4NkEtNDc0NC1CODUyLThEM0M2MUYzMzgyMkBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDY0MTE2My41MDE0Mi5xbUB3ZWI1MDQwNy5tYWlsLnJlMi55YWhvby5jb20+IDw0OENDMjZEQy0xM0QzLTQ1NDAtQjNCMC01OUI2NjU2RDNEMDJAU2FuZHJhZG9kZC5jb20+IDw0QTREMjVENS4yMDUwMjA2QG1hYy5jb20+IDwwMDAwMDFjOWZiZGUkMGQzM2Y0NzAkMjc5YmRkNTAkQGNvbT4gPDRBNEUyOUUyLjYwNTA0MDRAbWFjLmNvbT4gPDAwMTEwMWM5ZmMzNiRjYTIyNzg2MCQ1ZTY3NjkyMCRAY29tPiA8NEE0RUExN0UuMjA3MDVAbWFjLmNvbT4gPDU1RUZGNUQwLUI4NkEtNDc0NC1CODUyLThEM0M2MUYzMzgyMkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":46278,"nextInTopic":46281,"prevInTime":46278,"nextInTime":46280,"topicId":46200,"numMessagesInTopic":0,"msgSnippet":"... She was asked not to come back. She didn t. I felt a little bad because I thought she could use the parenting help, but my kids didn t like hers and didn t","messageBody":"<div id=\"ygrps-yiv-172036807\">On 7/4/2009 9:21 AM, Sandra Dodd wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; -=-Her answer, &quot;I come to the park for some adult time and I really<br/>\n&gt; need it<br/>\n&gt; and I&#39;m NOT going to follow my son around all day.&quot;-=-<br/>\n&gt;<br/>\n&gt; Did you ask her to leave him home with a babysitter, then, or to stay<br/>\n&gt; home with him herself?<br/>\n&gt;<br/>\n&gt; That would have pissed me off, what she said.<br/>\n&gt;    <br/>\n </span></blockquote>She was asked not to come back. She didn&#39;t. I felt a little bad because <br/>\nI thought she could use the parenting help, but my kids didn&#39;t like hers <br/>\nand didn&#39;t want to be around them.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: unschooling trashed  in this article","postDate":"1246742170","msgId":46278,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRBNEZDNjlBLjkwMjA2MDNAbWFjLmNvbT4=","inReplyToHeader":"PGgybW9idStnY2g5QGVHcm91cHMuY29tPg==","referencesHeader":"PGgybW9idStnY2g5QGVHcm91cHMuY29tPg=="},"prevInTopic":46277,"nextInTopic":46279,"prevInTime":46277,"nextInTime":46279,"topicId":46200,"numMessagesInTopic":0,"msgSnippet":"... I think that s part of what Sandra is saying about parents and kids and their interpersonal and intrapersonal intelligences. Some people might find it too","messageBody":"<div id=\"ygrps-yiv-573041246\">On 7/3/2009 10:12 PM, Jenny C wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;   It can be really hard<br/>\n&gt; sometimes to give her the space and freedom to meet friends and play,<br/>\n&gt; yet stay near enough to get involved right away if things go wrong.<br/>\n&gt;    <br/>\n<br/>\n </span></blockquote>I think that&#39;s part of what Sandra is saying about parents and kids and <br/>\ntheir interpersonal and intrapersonal intelligences. Some people might <br/>\nfind it too difficult to know how to support kids in behaving better. <br/>\nThey might not be good at catching on to what&#39;s about to happen, might <br/>\nmiss the build up to something, might especially not get other people&#39;s <br/>\nkids. So they give up punitive parenting - stop punishing and spanking <br/>\nand shaming and threatening, but they may not be good at persuading, <br/>\nadvising and supporting. Some people need other people&#39;s needs spelled <br/>\nout for them - they don&#39;t just pick up on them naturally or easily.<br/>\n<br/>\n  I remember, for example, one mom who absolutely insisted that kids <br/>\nMUST immediately &quot;talk it out&quot; when there was a conflict. And she and <br/>\nher kids had their (very nice) way of resolving conflicts - her kids <br/>\nwere used to it and would willingly fall into it. But my middle <br/>\ndaughter, Roxana, was a very very intense kid, with extremely strong <br/>\nfeelings. It was too hard for her to try to participate in their <br/>\nparticular problem-solving approach - it took too much concentration at <br/>\na time when she was concentrating on not blowing up. She needed to be <br/>\nleft alone - often for just a couple of minutes - to get herself under <br/>\ncontrol, to think through her own emotions.  The kids all liked each <br/>\nother a lot - they&#39;re still friends 12 years later! But there was a <br/>\nwhile that I had to be always there, not because of the kids, but <br/>\nbecause the other kids were quick to call on their mom, and she wasn&#39;t <br/>\nat all good at &quot;reading&quot; what Roxana needed. She escalated whatever <br/>\nproblems they were having by refusing to give Roxana even a few minutes. <br/>\nThey all were very very insistent that walking away, to be alone for a <br/>\nfew minutes, was NOT okay at all.<br/>\n<br/>\nWhen this mom pushed her, Roxana would blow up and then storm away and <br/>\nbe unwilling to even continue playing. So - that mom thought Roxana was <br/>\npretty awful, for a while, anyway. She thought Roxana was unwilling to <br/>\ncompromise, to negotiate, to problem solve, etc. I had to show her, <br/>\nmultiple times, how Roxana was actually quite willing and quite adept at <br/>\nall that, if she was given a little space and time to compose herself.<br/>\n<br/>\nInterestingly, once this other mom got it about what Roxana needed, SHE <br/>\nbecame very clear about it to her own kids and even to other parents. In <br/>\nlater years, I heard her tell other people, a few times, &quot;Some kids need <br/>\nsome space and time before they&#39;re ready to problem solve.&quot; She just <br/>\nhadn&#39;t experienced that need in herself or her own kids and didn&#39;t pick <br/>\nup on it on her own.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":288405080,"authorName":"diana jenner","from":"diana jenner &lt;hahamommy@...&gt;","profile":"dianajenner","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] unschooling trashed in this article","postDate":"1246739003","msgId":46277,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY1MThhOTM2MDkwNzA0MTMyM2g0NGI3NGVmY2tkMzNhMWI3ZDg4YjIxYmU0QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDRBNEQyNUQ1LjIwNTAyMDZAbWFjLmNvbT4=","referencesHeader":"PDY0MTE2My41MDE0Mi5xbUB3ZWI1MDQwNy5tYWlsLnJlMi55YWhvby5jb20+CSA8NDhDQzI2REMtMTNEMy00NTQwLUIzQjAtNTlCNjY1NkQzRDAyQFNhbmRyYWRvZGQuY29tPgkgPDRBNEQyNUQ1LjIwNTAyMDZAbWFjLmNvbT4="},"prevInTopic":46275,"nextInTopic":46278,"prevInTime":46276,"nextInTime":46278,"topicId":46200,"numMessagesInTopic":0,"msgSnippet":"... Hayden was (is) an intense kid. Unlike any kid I d ever met before he was 6! When he was 3, he was in a wedding, along with a 4 year old boy, and their ","messageBody":"<div id=\"ygrps-yiv-1695335842\">On Thu, Jul 2, 2009 at 2:25 PM, Pam Sorooshian &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pamsoroosh@...\">pamsoroosh@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;   The funny thing is, there are &quot;out of control&quot; (or bratty or whatever<br/>\n&gt; you want to call it) kids whose parents use curriculum on them, too.<br/>\n&gt; Nobody blames the curriculum for wild or difficult behavior. I think<br/>\n&gt; what really happens is that there are kids who are intense or explosive<br/>\n&gt; or more prone to impulsive behaviors, etc., out there in all groups. But<br/>\n&gt; when we (unschoolers) have kids like that, we aren&#39;t seen as &quot;doing<br/>\n&gt; something about it,&quot; because we don&#39;t shame and punish - especially<br/>\n&gt; because we don&#39;t shame and punish right then and there in front of<br/>\n&gt; everybody, like other parents do. I&#39;ve had parents tell me, &quot;If you just<br/>\n&gt; let that go, it will only get worse.&quot; They assume that I&#39;m just letting<br/>\n&gt; things go because they don&#39;t see my way of responding - which is<br/>\n&gt; certainly not going to be to loudly shame my child or punishing her.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Hayden was (is) an intense kid. Unlike any kid I&#39;d ever met before he was 6!<br/>\n<br/>\nWhen he was 3, he was in a wedding, along with a 4 year old boy, and their<br/>\nsisters, 5 and 6.<br/>\nEveryone knows the risk of inviting small children to participate in a<br/>\nwedding, or so I thought! The young boys were being young boys, bored in a<br/>\nmeaningless place, with grownups shushing them at every turn.  The groom, my<br/>\ncousin, asked if I&#39;d consider medicating him (which was the parental answer<br/>\nto the 4 year old&#39;s completely age-appropriate behaviors). I said, SURE! If<br/>\n(1) I felt his behaviors were chemically mal-induced, (2) his dad hadn&#39;t<br/>\njust died, and (3) *I* wasn&#39;t his mama.  Shame and medications didn&#39;t make<br/>\nit any easier for the other guy to leave legos and walk down the aisle; I<br/>\n*knew* they&#39;d not work for me and H.<br/>\nSo my calm demeanor and sweet whisperings were nothing to the observers and<br/>\n*EVERYTHING* to the participants :D I remember we used a lot of Rescue<br/>\nRemedy that day. Then again, we use a lot of RR at any big family gathering<br/>\n;)<br/>\n<br/>\nOn the other hand,I also think there are a lot of people who come to<br/>\n<blockquote><span title=\"ireply\"> &gt; unschooling and don&#39;t want to shame and punish, but don&#39;t know what else<br/>\n&gt; to do and their kids are not necessarily getting the kind of counseling<br/>\n&gt; and guidance and parental supervision and intervention that they need.<br/>\n&gt;<br/>\n&gt; In my opinion, erring on the side of not punishing and shaming seems to<br/>\n&gt; work out better, in the long run, but there are some unschooled kids<br/>\n&gt; whose behavior gets in the way of them achieving current happiness or<br/>\n&gt; who impose enough difficulties on other people so that others don&#39;t want<br/>\n&gt; to be around them. Sometimes parents are ignoring problems in the name<br/>\n&gt; of not punishing or shaming and that&#39;s not the idea response, either.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>This was me. I was flailing, as a human being, when unschooling came into my<br/>\nlife (and here&#39;s where I touch on every single subject line we&#39;ve had in the<br/>\npast two weeks!!). My husband, whom I&#39;d chosen carefully as<br/>\nhusband=balance-for-diana and daddy potential, had just died. I knew my<br/>\nemotional fragility was not an excuse to resort to knee-jerk parenting. My<br/>\nacute mourning kept me from having the energy to even do that; so there was<br/>\na big ol&#39; chunk of time (6 months?) where we lived in a state of benign<br/>\nneglect. Honestly. Luckily, I&#39;d convinced my best friends to keep their kids<br/>\nhome from preschool and the 5 of them and three of us spent lots and lots of<br/>\ntime together, in various combinations.<br/>\n<br/>\nThen I was challenged. I was awakened! I&#39;d discovered unschoolingdotcom and<br/>\nI kept going back and going back and going back... I felt like there was a<br/>\ngold nugget of understanding inside me, and the list (and this list by<br/>\nevolution) grabbed hold of it and shook (shakes!) my bull$hit off of it.<br/>\nEvery bit of advice I&#39;d considered from my<br/>\nmainstream-fringe-pretty-gentle-parenting friends was chucked out the<br/>\nwindow. (i.e. I didn&#39;t *especially NEED* my kids to have bedtimes, because I<br/>\nwas a single mother and deserved time to myself - a true conversation I<br/>\nfound myself having over and over with concerned friends)<br/>\n<br/>\nI remembered that part of this delicious pain I was feeling in missing Mitch<br/>\nwas bourne of connection; without that connection there is nothing to miss.<br/>\nI remembered the risk of loss is worth the relationship. Thank ye every<br/>\ngod!! There was a delicious pain, too, in waking up to what this connection<br/>\nmeans -- and what it doesn&#39;t. It means I hereby give up my life&#39;s turn at<br/>\nbeing the boss o&#39; the young ones; the job I&#39;ve longed for since I was a<br/>\nyoung one being bossed at.<br/>\n<br/>\nThere was no guide book, no Rules for how to be<br/>\ndiana-the-single-mama-who-wants-to-be-there-for-her-kids-in-the-memorable-way-her-dh-was;<br/>\ninstead I discovered a world of principles. Principles that work for the<br/>\ncrazy-flying-by-the-seat-of-her-pants-mama in the same way they work for the<br/>\nfamily with life 180* from us! These principles helped me make the baby<br/>\nsteps necessary for me to see immediate benefit in my relationship (abililty<br/>\nto relate) with my children.<br/>\n<br/>\nThese baby steps, cast light on the benefit of traveling (on a super<br/>\nshoestring) to Boston, from South Dakota, to an unschooling conference. I<br/>\nknew Sandra would be there with Marty & I knew Robyn would be there with<br/>\nJayn -- women whose stories I related to (thank you both for being REAL<br/>\npeople and telling REAL stories &lt;3&lt;3) I&#39;d heard the energy with which<br/>\nfamilies returned home, inspired by the challenge and support of an<br/>\nunschooling gathering.  I made my first and only curriculum purchase: 7$<br/>\ncassette recording of Sandra&#39;s Parenting<br/>\nPeacefully&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/parentingpeacefully\">http://sandradodd.com/parentingpeacefully</a>&gt;(then Peaceful<br/>\nParenting). Best lunch I ever skipped to afford it ;) I<br/>\nlistened all the way home (29 hours!) and most of it now lives in my head ;)<br/>\n<br/>\nI can only tell you another anology: When I first tried to read LotR, I<br/>\ndidn&#39;t get it, I couldn&#39;t *see* it... Then along came Peter Jackson, who<br/>\ngave me faces and voices and buildings and objects; it&#39;s all so easy to<br/>\nunderstand, once I&#39;ve seen it.  This conference gave me unschooling in that<br/>\nway.  I just found my scrapbook with a photo of hayden + marty = BIG smiles<br/>\n(almost 5 years later, there&#39;s still a very special bond there).  Live &<br/>\nLearn handed me a visual and energetic understanding of the real workings of<br/>\nthe principles in a multitude of real families.  Across the globe!<br/>\nI&#39;ve been coached on how-to coach my intense boy from the coolest of all<br/>\nunschooled kids. Their words I carry in my heart, they&#39;re especially loud<br/>\nwhen things are tough for the me: &quot;You are the Alpha AND the Omega&quot; and &quot;Let<br/>\nhim live to be 11&quot; -- from young men whose perspectives on the world matter<br/>\nmuch to me. I&#39;ve gone many literal (and figurative) miles to gather the<br/>\nsupport necessary to live a free life, not only for my children, also in my<br/>\nown head; free from thoughts of ickiness and martyrdom mostly ;) I am duly<br/>\nblessed, now, to live in a community where it is not only easy to be nice to<br/>\nyour kids, in general, there is a wonderful group of whole life unschoolers<br/>\nand we gather whenever we can! (this afternoon even!!)<br/>\n<br/>\nAs a real human being who&#39;s had some real crazy off-roading-thru-life<br/>\nexperiences, we (my family) would not even be close to this place of<br/>\nwonderful without the loving examples of unschooling we continue to draw<br/>\ninto our crazy-off-roading Life :D<br/>\n<br/>\nAnd that&#39;s the Truth ::::ppppffffbbbbtttt:::::<br/>\n~diana :) who is apparently feeling her inner Lily Tomlin today ;)<br/>\nxoxoxoxo<br/>\nhannahbearski.blogspot.com<br/>\nhannahsashes.blogspot.com<br/>\ndianas365.blogspot.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: unschooling trashed  in this article","postDate":"1246725463","msgId":46275,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVEMjc4RThDLTEwOUItNDgzNS1COEI0LTlGQUY5M0FBOEJGREBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGgybW9idStnY2g5QGVHcm91cHMuY29tPg==","referencesHeader":"PGgybW9idStnY2g5QGVHcm91cHMuY29tPg=="},"prevInTopic":46274,"nextInTopic":46277,"prevInTime":46274,"nextInTime":46276,"topicId":46200,"numMessagesInTopic":0,"msgSnippet":"-=-I ve met kids that were unschooling that were just plain mean and disrespectful. The parents seemed nice enough, but it seemed an element was missing from","messageBody":"<div id=\"ygrps-yiv-2107935236\">-=-I&#39;ve met kids that were unschooling that were just plain mean and<br/>\ndisrespectful. The parents seemed nice enough, but it seemed an element<br/>\nwas missing from the relationship. I don&#39;t know... -=-<br/>\n<br/>\nI&#39;ve looked at families like that and wondered, and I have an idea.   <br/>\nIt&#39;s not yet a theory, and it&#39;s far from being a conviction, but it&#39;s  <br/>\na possibility.<br/>\n<br/>\nThere are genetic and social factors.<br/>\nIf parents are short-tempered, cynical, sarcastic and for one reason  <br/>\nor another wish other people would stop having bad opinions about  <br/>\nthose things, they might find it sooothing or exhilarating to arrange  <br/>\nfor a child to live in such a way that they believe being short- <br/>\ntemnpered, cynical and sarcastic are not going to be criticized, and  <br/>\naren&#39;t going to cause any problems.<br/>\n<br/>\nUnfortunately, the same character traits that left them clueless about  <br/>\nhow to act left them just as clueless about the cause and  <br/>\nappropriateness of other people&#39;s reactions.  So they decide that the  <br/>\nother people were wrong to have been negative and they pass their  <br/>\ntheory/conviction on to their children in word and action.<br/>\n<br/>\nSo having dcided they&#39;re fine and others are rude and unreasonable,  <br/>\nand having stated that as fact to their children, then it become  <br/>\ndifficult (as the scientific-community-changes discussed earlier) for  <br/>\nthem to see other possibilities.<br/>\n<br/>\nMeanwhile, they get the idea that unschoolers accept people&#39;s  <br/>\ndifferences, and therefor their children&#39;s differences will be  <br/>\naccepted, embraced, celebrated!  Rewarded.  Praised and appreciated.   <br/>\nThey go first.   Then the rest of us are expected to follow.  If we  <br/>\ndon&#39;t, it proves we&#39;re rude and unreasonable.<br/>\n<br/>\nIt&#39;s a cycle.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] unschooling trashed  in this article","postDate":"1246724519","msgId":46274,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU1RUZGNUQwLUI4NkEtNDc0NC1CODUyLThEM0M2MUYzMzgyMkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDRBNEVBMTdFLjIwNzA1QG1hYy5jb20+","referencesHeader":"PDY0MTE2My41MDE0Mi5xbUB3ZWI1MDQwNy5tYWlsLnJlMi55YWhvby5jb20+IDw0OENDMjZEQy0xM0QzLTQ1NDAtQjNCMC01OUI2NjU2RDNEMDJAU2FuZHJhZG9kZC5jb20+IDw0QTREMjVENS4yMDUwMjA2QG1hYy5jb20+IDwwMDAwMDFjOWZiZGUkMGQzM2Y0NzAkMjc5YmRkNTAkQGNvbT4gPDRBNEUyOUUyLjYwNTA0MDRAbWFjLmNvbT4gPDAwMTEwMWM5ZmMzNiRjYTIyNzg2MCQ1ZTY3NjkyMCRAY29tPiA8NEE0RUExN0UuMjA3MDVAbWFjLmNvbT4="},"prevInTopic":46272,"nextInTopic":46275,"prevInTime":46273,"nextInTime":46275,"topicId":46200,"numMessagesInTopic":0,"msgSnippet":"-=-Her answer, I come to the park for some adult time and I really need it and I m NOT going to follow my son around all day. -=- Did you ask her to leave him","messageBody":"<div id=\"ygrps-yiv-1203548746\">-=-Her answer, &quot;I come to the park for some adult time and I really  <br/>\nneed it<br/>\nand I&#39;m NOT going to follow my son around all day.&quot;-=-<br/>\n<br/>\nDid you ask her to leave him home with a babysitter, then, or to stay  <br/>\nhome with him herself?<br/>\n<br/>\nThat would have pissed me off, what she said.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] unschooling trashed  in this article","postDate":"1246721391","msgId":46272,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgwNDU2Mi41NzU4NC5xbUB3ZWI4NjIxMC5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":46268,"nextInTopic":46274,"prevInTime":46271,"nextInTime":46273,"topicId":46200,"numMessagesInTopic":0,"msgSnippet":"I can remember feeling frustrated watching other mom s socialize when Simon or Linnaea clearly weren t ready for me to be away from them for those lengths of","messageBody":"<div id=\"ygrps-yiv-536146820\">I can remember feeling frustrated watching other mom&#39;s socialize when Simon or Linnaea clearly weren&#39;t ready for me to be away from them for those lengths of time. It took a little while for me to really enjoy the company of all the children in a play group. And I would have most of the children in the group playing with us, following the leader, jumping in the sand, running around and playing the 3 Billy Goats Gruff on the structures. It took a while to realize that I enjoyed that so much that the loss of the conversational time with other moms didn&#39;t tip the scale. It was part of realizing that what I was doing, staying home and being the full time mom, wasn&#39;t a sacrifice it was a gift. I think lots of moms get stuck in the martyred place and can&#39;t quite let go of the idea that they are doing this for others and gaining nothing for themselves. It sucks for the mom and it sucks for the kids. <br/>\n<br/>\nSimon and I cuddled on the couch today, and while I gentled tickled his back and looked at the moles and the birth mark there I thought about how fleeting all of this is. I got him now, but it is only now. I love getting this gift. I really love knowing that it is a gift. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Pam Sorooshian &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pamsoroosh@...\">pamsoroosh@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nSent: Saturday, 4 July, 2009 1:25:34 AM<br/>\nSubject: Re: [AlwaysLearning] unschooling trashed in this article<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 7/3/2009 4:34 PM, Angela Shaw wrote:<br/>\n&gt; In both groups I felt that most of the parent&#39;s put their own socialization<br/>\n&gt; ahead of their children&#39;s needs.  Maybe I just see needs where other people<br/>\n&gt; see normalcy.  I don&#39;t feel that its normal to let children fight when an<br/>\n&gt; easy solution is right at hand if you just help them navigate socially<br/>\n&gt; instead of ignoring it till someone is really unhappy.<br/>\n&gt;    <br/>\n<br/>\nAfter a long time of tolerating it, some of the more leader-types in our <br/>\ngroup finally told someone that she really needed to stay right there <br/>\nwith her son while he was at the park. He was awful - he&#39;d ram people <br/>\nfrom behind while riding his big wheel trike, for example. He threw sand <br/>\ninto kids&#39; eyes - a lot. And much more.<br/>\n<br/>\nHer answer, &quot;I come to the park for some adult time and I really need it <br/>\nand I&#39;m NOT going to follow my son around all day.&quot;<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n------------------------------------<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":143043046,"authorName":"Ed Wendell","from":"&quot;Ed Wendell&quot; &lt;ewendell@...&gt;","profile":"zelco123","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: unschooling trashed  in this article","postDate":"1246718562","msgId":46268,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE5RTVCQURDODFCNjQwNUZBRkU0RTBEODQ2Mzk3OThDQEVkUEM+","inReplyToHeader":"PGgybW9idStnY2g5QGVHcm91cHMuY29tPg==","referencesHeader":"PGgybW9idStnY2g5QGVHcm91cHMuY29tPg=="},"prevInTopic":46266,"nextInTopic":46272,"prevInTime":46267,"nextInTime":46269,"topicId":46200,"numMessagesInTopic":0,"msgSnippet":"One of the gymnastics places here locally has classes/groups for Parkour - Zac took for a while last spring and is considering it again.  Might be something","messageBody":"<div id=\"ygrps-yiv-1095391742\">One of the gymnastics places here locally has classes/groups for Parkour - Zac took for a while last spring and is considering it again.  Might be something your son is interested in doing.  Might be a great way to redirect him from jumping on other&#39;s property.  I know our son who just turned 15 last week is already over 6 feet and weighs (?) to match it.  I don&#39;t know how much he weighs but he is solid - I know this from when he sits on my lap - ;)  I would redirect him from jumping on other&#39;s benches if he was so inclined - it gets the benches dirty where others want to sit plus the impact would not be good for the bench.  The other day his dad was hanging something and Zac immediately stepped up on a chair to help his dad and popped the cross braces out of the chair legs - that was with a gentle step up - a forceful jump would have probably shattered the chair.<br/>\n<br/>\nLisa W.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  That&#39;s parkouring! <br/>\n  . <br/>\n<br/>\n  <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":324049237,"authorName":"saturnfire16","from":"&quot;saturnfire16&quot; &lt;saturnfire16@...&gt;","profile":"saturnfire16","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: unschooling trashed  in this article","postDate":"1246687798","msgId":46266,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGgybXJubStrN2c3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEYxRDRDNUQyLTM4RDMtNDEzOC1CNjIzLUM0NDM2MDI1MjZBMUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":46265,"nextInTopic":46268,"prevInTime":46265,"nextInTime":46267,"topicId":46200,"numMessagesInTopic":0,"msgSnippet":"... I also know lots of Christians who were raised by very controlling, punitive parents.  They either went wild as soon as they got out or became good, little","messageBody":"<div id=\"ygrps-yiv-1769349653\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; -=- There are fewer Christian<br/>\n&gt; homeschooled kids like that because often the parent is very  <br/>\n&gt; controlling and<br/>\n&gt; punishes it out of them.-=-<br/>\n&gt; <br/>\n&gt; It might just stuff it down into them, and it can come bursting forth  <br/>\n&gt; in a cascade of crazy when they&#39;re old enough to leave home, get a  <br/>\n&gt; pickup and a bunch of liquor.  (Thinking of my Christian cousins in  <br/>\n&gt; Texas; not homeschooled, but controlled within an inch of insanity,  <br/>\n&gt; and they had to say &quot;yes ma&#39;am&quot; and &quot;no sir&quot; about it all too.<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; <br/>\n<br/>\n<br/>\n </span></blockquote>I also know lots of Christians who were raised by very controlling, punitive parents.  They either went wild as soon as they got out or became good, little doormats.  Many of them repeat the cycle, but I know so many who are intentionally turning the tide and applying the same grace they&#39;ve received to their children.  I even know a few who are unschooling!</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny C","from":"&quot;Jenny C&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: unschooling trashed  in this article","postDate":"1246684350","msgId":46265,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGgybW9idStnY2g5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDRBNEU3NTM1LjIwNjAxMDdAdHdjbnkucnIuY29tPg=="},"prevInTopic":46262,"nextInTopic":46266,"prevInTime":46264,"nextInTime":46266,"topicId":46200,"numMessagesInTopic":0,"msgSnippet":"... loud ... I ve met kids that were unschooling that were just plain mean and disrespectful.  The parents seemed nice enough, but it seemed an element was","messageBody":"<div id=\"ygrps-yiv-1261468593\"><blockquote><span title=\"ireply\">&gt; We have experienced difficulty ourselves with a couple of the<br/>\n&gt; unschooling families in our area in the past- some hitting and very<br/>\n </span></blockquote>loud<br/>\n<blockquote><span title=\"ireply\"> &gt; and long rages from an older child, which seemed unusual.<br/>\n<br/>\n </span></blockquote>I&#39;ve met kids that were unschooling that were just plain mean and<br/>\ndisrespectful.  The parents seemed nice enough, but it seemed an element<br/>\nwas missing from the relationship.  I don&#39;t know... I have one child who<br/>\nis really really intense and can be mean or rude at times, but I don&#39;t<br/>\n&quot;let&quot; her be that way.  It&#39;s better to take her out of that environment<br/>\nthan let her fail in the social skills area.  It can be really hard<br/>\nsometimes to give her the space and freedom to meet friends and play,<br/>\nyet stay near enough to get involved right away if things go wrong.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n </span></blockquote>I wonder sometimes if these parents just don&#39;t<br/>\n<blockquote><span title=\"ireply\"> &gt; know how to communicate with young people who are accustomed to having<br/>\n&gt; their opinions and needs considered, and who would most likely respond<br/>\n&gt; to a well-worded request.<br/>\n<br/>\n </span></blockquote>There are many adults who don&#39;t consider at all, that teens have a real<br/>\nperson inside of each body, that they are real humans that like to be<br/>\ntreated as such!  Chamille is very sensitive to that sort of disrespect.<br/>\nMost kids will respond well with polite requests.  So many adults are<br/>\njust so used to making demands and expecting prompt attention to those<br/>\ndemands.  I&#39;ve found that unschooled teens (most teens really) don&#39;t<br/>\njump up and comply with that sort of thing.<br/>\n<br/>\n<br/>\nFor<br/>\n<blockquote><span title=\"ireply\"> &gt; instance - my son loves to jump over and on objects such as benches,<br/>\n&gt; walls, etc in public spaces. I will sometimes mention that perhaps a<br/>\n&gt; certain wall or object may be owned by someone who may not appreciate<br/>\n </span></blockquote>it<br/>\n<blockquote><span title=\"ireply\"> &gt; being used in that way - but mostly he chooses to jump anyway as at<br/>\n </span></blockquote>that<br/>\n<blockquote><span title=\"ireply\"> &gt; moment what that hypothetical person MIGHT think is less important<br/>\n </span></blockquote>than<br/>\n<blockquote><span title=\"ireply\"> &gt; the fun of jumping- he can jump quite high, being over 6 feet tall.<br/>\n<br/>\n </span></blockquote>That&#39;s parkouring!  It&#39;s super cool to watch!  You should video him<br/>\ndoing it, people watch that kind of stuff on youtube!  I&#39;m super<br/>\nimpressed with people that can do that!  If you do video him, send a<br/>\nlink, I want to see it!</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] unschooling trashed  in this article","postDate":"1246667134","msgId":46260,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRBNEVBMTdFLjIwNzA1QG1hYy5jb20+","inReplyToHeader":"PDAwMTEwMWM5ZmMzNiRjYTIyNzg2MCQ1ZTY3NjkyMCRAY29tPg==","referencesHeader":"PDY0MTE2My41MDE0Mi5xbUB3ZWI1MDQwNy5tYWlsLnJlMi55YWhvby5jb20+IDw0OENDMjZEQy0xM0QzLTQ1NDAtQjNCMC01OUI2NjU2RDNEMDJAU2FuZHJhZG9kZC5jb20+IDw0QTREMjVENS4yMDUwMjA2QG1hYy5jb20+IDwwMDAwMDFjOWZiZGUkMGQzM2Y0NzAkMjc5YmRkNTAkQGNvbT4gPDRBNEUyOUUyLjYwNTA0MDRAbWFjLmNvbT4gPDAwMTEwMWM5ZmMzNiRjYTIyNzg2MCQ1ZTY3NjkyMCRAY29tPg=="},"prevInTopic":46259,"nextInTopic":46262,"prevInTime":46259,"nextInTime":46261,"topicId":46200,"numMessagesInTopic":0,"msgSnippet":"... After a long time of tolerating it, some of the more leader-types in our group finally told someone that she really needed to stay right there with her son","messageBody":"<div id=\"ygrps-yiv-1958378694\">On 7/3/2009 4:34 PM, Angela Shaw wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; In both groups I felt that most of the parent&#39;s put their own socialization<br/>\n&gt; ahead of their children&#39;s needs.  Maybe I just see needs where other people<br/>\n&gt; see normalcy.  I don&#39;t feel that its normal to let children fight when an<br/>\n&gt; easy solution is right at hand if you just help them navigate socially<br/>\n&gt; instead of ignoring it till someone is really unhappy.<br/>\n&gt;    <br/>\n<br/>\n </span></blockquote>After a long time of tolerating it, some of the more leader-types in our <br/>\ngroup finally told someone that she really needed to stay right there <br/>\nwith her son while he was at the park. He was awful - he&#39;d ram people <br/>\nfrom behind while riding his big wheel trike, for example. He threw sand <br/>\ninto kids&#39; eyes - a lot. And much more.<br/>\n<br/>\nHer answer, &quot;I come to the park for some adult time and I really need it <br/>\nand I&#39;m NOT going to follow my son around all day.&quot;<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":321729783,"authorName":"Angela Shaw","from":"&quot;Angela Shaw&quot; &lt;game-enthusiast@...&gt;","profile":"autonomousangela","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] unschooling trashed  in this article","postDate":"1246664059","msgId":46258,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTEwMWM5ZmMzNiRjYTIyNzg2MCQ1ZTY3NjkyMCRAY29tPg==","inReplyToHeader":"PDRBNEUyOUUyLjYwNTA0MDRAbWFjLmNvbT4=","referencesHeader":"PDY0MTE2My41MDE0Mi5xbUB3ZWI1MDQwNy5tYWlsLnJlMi55YWhvby5jb20+IDw0OENDMjZEQy0xM0QzLTQ1NDAtQjNCMC01OUI2NjU2RDNEMDJAU2FuZHJhZG9kZC5jb20+IDw0QTREMjVENS4yMDUwMjA2QG1hYy5jb20+IDwwMDAwMDFjOWZiZGUkMGQzM2Y0NzAkMjc5YmRkNTAkQGNvbT4gPDRBNEUyOUUyLjYwNTA0MDRAbWFjLmNvbT4="},"prevInTopic":46257,"nextInTopic":46259,"prevInTime":46257,"nextInTime":46259,"topicId":46200,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1485983881\">&lt;So - maybe there are fewer, but i&#39;m not sure that&#39;s true and even if it <br/>\nis, they add &quot;sneaky&quot; (dishonest, untrustworthy) to their list of <br/>\nproblem behaviors which at least the so-called &quot;out of control&quot; <br/>\nunschoolers don&#39;t have.&gt;<br/>\n<br/>\n<br/>\n<br/>\nThe times I went to Christian home school events with a friend of mine (one<br/>\nwas a six or eight week class so I saw the kids weekly for a couple of<br/>\nsessions) the kids there were all very well behaved in front of their<br/>\nparents.  All of them.  The ones I knew well WERE sneaky and mean behind<br/>\ntheir parent&#39;s backs.  Their relationships with their siblings were not<br/>\nsweet, to say the least.<br/>\n<br/>\nAt the more liberal gatherings I&#39;ve gone to (none all unschoolers but some<br/>\nunschoolers ) there were a couple children who were quite disruptive to the<br/>\ngroup.  (one I know called themselves unschoolers) The moms were busy<br/>\nsocializing and were either oblivious to the disruption. condoned it, or<br/>\ndidn&#39;t know how to handle it so they opted to do nothing.  On the whole<br/>\nthough, the mixed group seemed to have more relaxed parents who had more<br/>\nrelaxed children.  <br/>\n<br/>\nIn both groups I felt that most of the parent&#39;s put their own socialization<br/>\nahead of their children&#39;s needs.  Maybe I just see needs where other people<br/>\nsee normalcy.  I don&#39;t feel that its normal to let children fight when an<br/>\neasy solution is right at hand if you just help them navigate socially<br/>\ninstead of ignoring it till someone is really unhappy.<br/>\n<br/>\nThat&#39;s been my experience.<br/>\n<br/>\nAngela<br/>\n<br/>\n <br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":321729783,"authorName":"Angela Shaw","from":"&quot;Angela Shaw&quot; &lt;game-enthusiast@...&gt;","profile":"autonomousangela","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] unschooling trashed  in this article","postDate":"1246664059","msgId":46259,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDkwMWM5ZmMzNiRjOTc5ZGM1MCQ1YzZkOTRmMCRAY29tPg==","inReplyToHeader":"PDAwNWEwMWM5ZmMyMyQwMjUxN2VjMCQwNmY0N2M0MCRAY29tPg==","referencesHeader":"PDY0MTE2My41MDE0Mi5xbUB3ZWI1MDQwNy5tYWlsLnJlMi55YWhvby5jb20+IDw0OENDMjZEQy0xM0QzLTQ1NDAtQjNCMC01OUI2NjU2RDNEMDJAU2FuZHJhZG9kZC5jb20+IDw0QTREMjVENS4yMDUwMjA2QG1hYy5jb20+IDwwMDAwMDFjOWZiZGUkMGQzM2Y0NzAkMjc5YmRkNTAkQGNvbT4gPDRBNEUyOUUyLjYwNTA0MDRAbWFjLmNvbT4gPDAwNWEwMWM5ZmMyMyQwMjUxN2VjMCQwNmY0N2M0MCRAY29tPg=="},"prevInTopic":46258,"nextInTopic":46260,"prevInTime":46258,"nextInTime":46260,"topicId":46200,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1694526013\">&lt;I agree and have experienced the same thing. I didn&#39;t actually mean that<br/>\nthe &quot;punishing it out of them&quot; worked, but in front of their parents in a<br/>\ngroup setting they tended to act nicely and not run around out of control.&gt;<br/>\n<br/>\n <br/>\n<br/>\nClarifying what I said.  It did work in the short term.  Kids behaved well<br/>\nin a group in front of their parents.  <br/>\n<br/>\nThose kids were easy to be around in a group.  <br/>\n<br/>\n <br/>\n<br/>\nI&#39;m not condoning it, just saying what my experience was.<br/>\n<br/>\n <br/>\n<br/>\nAngela<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":220041937,"authorName":"Heather","from":"Heather &lt;hbmccarty@...&gt;","profile":"heather13068","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] unschooling trashed  in this article","postDate":"1246655797","msgId":46262,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRBNEU3NTM1LjIwNjAxMDdAdHdjbnkucnIuY29tPg==","inReplyToHeader":"PDRBNEUyOUUyLjYwNTA0MDRAbWFjLmNvbT4=","referencesHeader":"PDY0MTE2My41MDE0Mi5xbUB3ZWI1MDQwNy5tYWlsLnJlMi55YWhvby5jb20+IDw0OENDMjZEQy0xM0QzLTQ1NDAtQjNCMC01OUI2NjU2RDNEMDJAU2FuZHJhZG9kZC5jb20+IDw0QTREMjVENS4yMDUwMjA2QG1hYy5jb20+IDwwMDAwMDFjOWZiZGUkMGQzM2Y0NzAkMjc5YmRkNTAkQGNvbT4gPDRBNEUyOUUyLjYwNTA0MDRAbWFjLmNvbT4="},"prevInTopic":46260,"nextInTopic":46265,"prevInTime":46261,"nextInTime":46263,"topicId":46200,"numMessagesInTopic":0,"msgSnippet":"This is my first post on this list -though I have been reading Unschooling Discussion for a few years, and unschoolingbasics, among others. We have experienced","messageBody":"<div id=\"ygrps-yiv-996413559\">This is my first post on this list -though I have been reading <br/>\nUnschooling Discussion for a few years, and unschoolingbasics, among others.<br/>\n<br/>\nWe have experienced difficulty ourselves with a couple of the <br/>\nunschooling families in our area in the past- some hitting and very loud <br/>\nand long rages from an older child, which seemed unusual. They were not <br/>\nradically unschooling, at least at that point.  Some unschooled kids are <br/>\ngiven freedom perhaps to learn to read, etc in their own time, but are <br/>\nnot always treated respectfully in my observation - &quot;discipline&quot; seeming <br/>\nfairly traditional.   My kids used to fight often before I started to <br/>\nread radical unschooling lists and apply those principles, though I said <br/>\nI was unschooling for years before that. It took a long time for my kids <br/>\nto behave differently at home after I began to shift my parenting.<br/>\n<br/>\nAt times I hear comments about the young people at our learning center <br/>\nfrom some of the parents who parent traditionally and have kids with <br/>\nquiet temperaments about some of the teen unschoolers- there are a <br/>\nhandful of them. To me they seem considerate and interested and excited <br/>\nabout life- but some of the parents object to their tendency to be very <br/>\nphysical and outspoken and silly. Yes, they could use some reminders <br/>\nabout what might be appropriate in the space or at that time, but there <br/>\nis a tone of judgment in these comments and a lack of understanding of <br/>\ntheir playfulness, too. I wonder sometimes if these parents just don&#39;t <br/>\nknow how to communicate with young people who are accustomed to having <br/>\ntheir opinions and needs considered, and who would most likely respond <br/>\nto a well-worded request. I have relationships with these kids and an <br/>\ninstance of behavior doesn&#39;t determine my whole picture of them, as it <br/>\nmight to a casual observer.  They will always consider my requests quite <br/>\nrespectfully.<br/>\n<br/>\nAlso- I wonder - is it really important to all unschooling families at <br/>\nall times to appear to be well behaved? It is important to me that my <br/>\nkids have the kinds of experiences they want to have with people, and I <br/>\nwill offer them information that will help them make those choices. But <br/>\nsometimes other things are more important than what people think. For <br/>\ninstance - my son loves to jump over and on objects such as benches, <br/>\nwalls, etc in public spaces. I will sometimes mention that perhaps a <br/>\ncertain wall or object may be owned by someone who may not appreciate it <br/>\nbeing used in that way - but mostly he chooses to jump anyway as at that <br/>\nmoment what that hypothetical person MIGHT think is less important than <br/>\nthe fun of jumping-  he can jump quite high, being over 6 feet tall. No <br/>\none has expressed any concerns, and if they did, I am pretty sure he <br/>\nwould stop immediately. This may not appear to be well-behaved to some.<br/>\n<br/>\nAnyway - the article was mean-spirited and not at all true for the <br/>\nmajority of unschooling families that I know - but those are the <br/>\nthoughts I had about the subject.<br/>\n<br/>\n-- <br/>\nHeather (in NY State)</div>","specialLinks":[]},{"userId":321729783,"authorName":"Angela Shaw","from":"&quot;Angela Shaw&quot; &lt;game-enthusiast@...&gt;","profile":"autonomousangela","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] unschooling trashed  in this article","postDate":"1246655564","msgId":46257,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNWEwMWM5ZmMyMyQwMjUxN2VjMCQwNmY0N2M0MCRAY29tPg==","inReplyToHeader":"PDRBNEUyOUUyLjYwNTA0MDRAbWFjLmNvbT4=","referencesHeader":"PDY0MTE2My41MDE0Mi5xbUB3ZWI1MDQwNy5tYWlsLnJlMi55YWhvby5jb20+IDw0OENDMjZEQy0xM0QzLTQ1NDAtQjNCMC01OUI2NjU2RDNEMDJAU2FuZHJhZG9kZC5jb20+IDw0QTREMjVENS4yMDUwMjA2QG1hYy5jb20+IDwwMDAwMDFjOWZiZGUkMGQzM2Y0NzAkMjc5YmRkNTAkQGNvbT4gPDRBNEUyOUUyLjYwNTA0MDRAbWFjLmNvbT4="},"prevInTopic":46252,"nextInTopic":46258,"prevInTime":46256,"nextInTime":46258,"topicId":46200,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1302215705\">&lt; So - maybe there are fewer, but i&#39;m not sure that&#39;s true and even if it <br/>\nis, they add &quot;sneaky&quot; (dishonest, untrustworthy) to their list of <br/>\nproblem behaviors which at least the so-called &quot;out of control&quot; <br/>\nunschoolers don&#39;t have.&gt;<br/>\n<br/>\n <br/>\n<br/>\nI agree and have experienced the same thing.  I didn&#39;t actually mean that<br/>\nthe &quot;punishing it out of them&quot; worked, but in front of their parents in a<br/>\ngroup setting they tended to act nicely and not run around out of control.<br/>\nOne of the families of which I spoke has a 20 year old daughter who now has<br/>\nthree babies.none planed.  When she was finally old enough o break loose,<br/>\nshe did it in a big way without have had the ability to practice being<br/>\nresponsible with small decisions first.  I&#39;m rushing, which is why I don&#39;t<br/>\npost as often as I&#39;d like.  I hope it&#39;s clear what I meant.  They act<br/>\npolitely in front on their parents and they are pleasant to be around in a<br/>\ngroup with the parents looking on.  It says nothing about what they do<br/>\nbehind their backs.<br/>\n<br/>\n <br/>\n<br/>\nAngela<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] unschooling trashed  in this article","postDate":"1246636514","msgId":46252,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRBNEUyOUUyLjYwNTA0MDRAbWFjLmNvbT4=","inReplyToHeader":"PDAwMDAwMWM5ZmJkZSQwZDMzZjQ3MCQyNzliZGQ1MCRAY29tPg==","referencesHeader":"PDY0MTE2My41MDE0Mi5xbUB3ZWI1MDQwNy5tYWlsLnJlMi55YWhvby5jb20+IDw0OENDMjZEQy0xM0QzLTQ1NDAtQjNCMC01OUI2NjU2RDNEMDJAU2FuZHJhZG9kZC5jb20+IDw0QTREMjVENS4yMDUwMjA2QG1hYy5jb20+IDwwMDAwMDFjOWZiZGUkMGQzM2Y0NzAkMjc5YmRkNTAkQGNvbT4="},"prevInTopic":46250,"nextInTopic":46257,"prevInTime":46251,"nextInTime":46253,"topicId":46200,"numMessagesInTopic":0,"msgSnippet":"... The absolute most difficult kids in all the homeschool events and park days and other activities I ve been involved with, over the years, have been","messageBody":"<div id=\"ygrps-yiv-716261556\">On 7/3/2009 5:59 AM, Angela wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; There are fewer Christian<br/>\n&gt; homeschooled kids like that because often the parent is very controlling and<br/>\n&gt; punishes it out of them.<br/>\n<br/>\n </span></blockquote>The absolute most difficult kids in all the homeschool events and park <br/>\ndays and other activities I&#39;ve been involved with, over the years, have <br/>\nbeen schooled-at-home heavy-handed Christian homeschooled kids who were <br/>\nall sweetness and light in front of their parents and who were sneaky <br/>\nand mean away from them. There was one family - the other kids called <br/>\nthem &quot;the violent _____ kids.&quot; Their reaction to anything not going <br/>\ntheir way was to lash out and hurt the other kids - this was a large <br/>\nfamily and most of the kids, but not all, were like this. The mother <br/>\nwould wash their mouths out with soap, spank them, make them sit next to <br/>\nher for X minutes before they could go play again, etc. I remember how <br/>\nshe once went on and on about somebody else&#39;s kid using some &quot;bad <br/>\nlanguage&quot; and yet her kids were THE most cussing kids that my kids had <br/>\never known.<br/>\n<br/>\nSo - maybe there are fewer, but i&#39;m not sure that&#39;s true and even if it <br/>\nis, they add &quot;sneaky&quot; (dishonest, untrustworthy) to their list of <br/>\nproblem behaviors which at least the so-called &quot;out of control&quot; <br/>\nunschoolers don&#39;t have.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] unschooling trashed  in this article","postDate":"1246629628","msgId":46250,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYxRDRDNUQyLTM4RDMtNDEzOC1CNjIzLUM0NDM2MDI1MjZBMUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDAwMDAwMWM5ZmJkZSQwZDMzZjQ3MCQyNzliZGQ1MCRAY29tPg==","referencesHeader":"PDY0MTE2My41MDE0Mi5xbUB3ZWI1MDQwNy5tYWlsLnJlMi55YWhvby5jb20+IDw0OENDMjZEQy0xM0QzLTQ1NDAtQjNCMC01OUI2NjU2RDNEMDJAU2FuZHJhZG9kZC5jb20+IDw0QTREMjVENS4yMDUwMjA2QG1hYy5jb20+IDwwMDAwMDFjOWZiZGUkMGQzM2Y0NzAkMjc5YmRkNTAkQGNvbT4="},"prevInTopic":46248,"nextInTopic":46252,"prevInTime":46249,"nextInTime":46251,"topicId":46200,"numMessagesInTopic":0,"msgSnippet":"-=- There are fewer Christian homeschooled kids like that because often the parent is very controlling and punishes it out of them.-=- It might just stuff it","messageBody":"<div id=\"ygrps-yiv-121608207\">-=- There are fewer Christian<br/>\nhomeschooled kids like that because often the parent is very  <br/>\ncontrolling and<br/>\npunishes it out of them.-=-<br/>\n<br/>\nIt might just stuff it down into them, and it can come bursting forth  <br/>\nin a cascade of crazy when they&#39;re old enough to leave home, get a  <br/>\npickup and a bunch of liquor.  (Thinking of my Christian cousins in  <br/>\nTexas; not homeschooled, but controlled within an inch of insanity,  <br/>\nand they had to say &quot;yes ma&#39;am&quot; and &quot;no sir&quot; about it all too.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":321729783,"authorName":"Angela","from":"&quot;Angela&quot; &lt;game-enthusiast@...&gt;","profile":"autonomousangela","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] unschooling trashed  in this article","postDate":"1246625946","msgId":46248,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDAwMWM5ZmJkZSQwZDMzZjQ3MCQyNzliZGQ1MCRAY29tPg==","inReplyToHeader":"PDRBNEQyNUQ1LjIwNTAyMDZAbWFjLmNvbT4=","referencesHeader":"PDY0MTE2My41MDE0Mi5xbUB3ZWI1MDQwNy5tYWlsLnJlMi55YWhvby5jb20+IDw0OENDMjZEQy0xM0QzLTQ1NDAtQjNCMC01OUI2NjU2RDNEMDJAU2FuZHJhZG9kZC5jb20+IDw0QTREMjVENS4yMDUwMjA2QG1hYy5jb20+"},"prevInTopic":46246,"nextInTopic":46250,"prevInTime":46247,"nextInTime":46249,"topicId":46200,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-663536904\">&lt;The funny thing is, there are &quot;out of control&quot; (or bratty or whatever <br/>\nyou want to call it) kids whose parents use curriculum on them, too. <br/>\nNobody blames the curriculum for wild or difficult behavior. I think <br/>\nwhat really happens is that there are kids who are intense or explosive <br/>\nor more prone to impulsive behaviors, etc., out there in all groups. But <br/>\nwhen we (unschoolers) have kids like that, we aren&#39;t seen as &quot;doing <br/>\nsomething about it,&quot; because we don&#39;t shame and punish - especially <br/>\nbecause we don&#39;t shame and punish right then and there in front of <br/>\neverybody, like other parents do. &gt;<br/>\n<br/>\nI agree that there out of control children who are schooled in all possible<br/>\nways.  Likely, there are more in public school than anywhere else because<br/>\nit&#39;s the easiest path to follow and those parents who don&#39;t who aren&#39;t as<br/>\ninvolved usually end up there by default.  There are fewer Christian<br/>\nhomeschooled kids like that because often the parent is very controlling and<br/>\npunishes it out of them.  But sometimes it&#39;s a personality difference in the<br/>\nmom that causes this and it has nothing to do with how the child is<br/>\nschooled.  <br/>\n<br/>\nI have a friend, also a homeschooler (not unschooler), who has a real<br/>\ndifficulty with focusing on more than one thing at a time.  If she is<br/>\nchatting with me, she can&#39;t seem to hear her kids.  Reminds me more of a<br/>\nman&#39;s personality.  In my experience, men have a harder time multi-tasking.<br/>\n<br/>\nBut no matter the cause, I can&#39;t stand being around parents who don&#39;t DO<br/>\nanything about it.  I&#39;m not talking about shaming or blaming though.  It<br/>\nmakes me crazy to go to play groups/home school groups or to even visit in<br/>\nsomeone&#39;s home when they are more concerned with their own socialization (or<br/>\njust oblivious to their child&#39;s needs) than helping their child navigate<br/>\nthrough his/her own social world.  <br/>\n<br/>\nThis same friend seems unable to hear anything else except what is right in<br/>\nfront of her. (I learned to interrupt her and point out that her child<br/>\nwanted or needed her) She doesn&#39;t hear her child ask politely the first six<br/>\ntimes but she hears him when he finally pitches a fit and makes sure he&#39;s<br/>\nthe biggest loudest thing around so she&#39;ll see him.  And then he gets in<br/>\ntrouble.  L<br/>\n<br/>\nI&#39;ve seen it play out differently in another family too.  This family was<br/>\nnot the punitive type of family that the first was but the mom never<br/>\nrealized how much her child disrupted the group because she seemed to only<br/>\nbe focusing on her own socialization and oblivious to the chaos that<br/>\nfollowed in her son&#39;s wake.  It really seemed like she just didn&#39;t see it.<br/>\nIf someone pointed it out, she&#39;d take notice and help her child but no one<br/>\nwants to continually point out where someone else is failing.  <br/>\n<br/>\nI think it&#39;s even more important to be present with those children who are<br/>\nprone to be intense or explosive.   <br/>\n<br/>\nOne other thing that comes to play in this is I think, the fact that<br/>\nhomeschoolers tend to spend large blocks of time with each other and get to<br/>\nsee the details of each other&#39;s lives more than families whose kids go to<br/>\nschool. And unschooled families probably spend even more time in each<br/>\nother&#39;s company than traditionally homeschooled kids because they aren&#39;t<br/>\nspending hours on a curriculum.  When your with someone for a huge block of<br/>\ntime you get to see the good, the bad, and the ugly.<br/>\n<br/>\nAngela<br/>\n<br/>\n <br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":183568025,"authorName":"Bob Collier","from":"&quot;Bob Collier&quot; &lt;bobcollier@...&gt;","profile":"quaussiebob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: unschooling trashed  in this article","postDate":"1246622930","msgId":46246,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGgya3NjaStsb3VrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGgya3JpMys1ZmQwQGVHcm91cHMuY29tPg=="},"prevInTopic":46245,"nextInTopic":46248,"prevInTime":46245,"nextInTime":46247,"topicId":46200,"numMessagesInTopic":0,"msgSnippet":"... This is what happens when I get behind with my Google updates. There s a follow up article here: ","messageBody":"<div id=\"ygrps-yiv-936567475\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Bob Collier&quot; &lt;bobcollier@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Lyla Wolfenstein&quot; &lt;lylaw@&gt; wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt; thought some might want to reply<br/>\n&gt; &gt; <br/>\n&gt; &gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.examiner.com/examiner/x-10127-Norfolk-Homeschooling-Examiner~y2009m7d1-Some-may-call-it-unschooling-I-call-it-educational-neglect\">http://www.examiner.com/examiner/x-10127-Norfolk-Homeschooling-Examiner~y2009m7d1-Some-may-call-it-unschooling-I-call-it-educational-neglect</a><br/>\n&gt; &gt; <br/>\n&gt; &gt; Lyla<br/>\n&gt; &gt; <br/>\n&gt; &gt; [Non-text portions of this message have been removed]<br/>\n&gt; &gt;<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; My response just posted:<br/>\n&gt; <br/>\n&gt; &quot;Now that you&#39;ve added the disclaimer - &quot;I know that there are<br/>\n&gt; unschoolers who give their children a fine education. However, my<br/>\n&gt; issue is not with them, it is with those people who hide behind the<br/>\n&gt; label of unschooling.&quot; - this article is not worth the paper it&#39;s<br/>\n&gt; written on, is it?<br/>\n&gt; <br/>\n&gt; Maybe you could rewrite it so that it&#39;s directed to the people you<br/>\n&gt; apparently intended it to be directed to - the small minority of<br/>\n&gt; &quot;unschoolers&#39; who give unschooling a bad name.<br/>\n&gt; <br/>\n&gt; I&#39;m happy to waive the apology to the rest of us. I can&#39;t speak for<br/>\n&gt; others of course.&quot;<br/>\n&gt; <br/>\n&gt; Hope that helps.<br/>\n&gt; <br/>\n&gt; Bob<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>This is what happens when I get behind with my Google updates.<br/>\nThere&#39;s a follow up article here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.examiner.com/x-10127-Norfolk-Homeschooling-Examiner~y2009m7d2-Perhaps-unschooling-isnt-so-bad-after-all\">http://www.examiner.com/x-10127-Norfolk-Homeschooling-Examiner~y2009m7d2-Perhaps-unschooling-isnt-so-bad-after-all</a><br/>\n<br/>\nBob</div>","specialLinks":[]},{"userId":183568025,"authorName":"Bob Collier","from":"&quot;Bob Collier&quot; &lt;bobcollier@...&gt;","profile":"quaussiebob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: unschooling trashed  in this article","postDate":"1246622083","msgId":46245,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGgya3JpMys1ZmQwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDgwODM2QTgwQ0MyMTRBNUNCOTAwNjI0MDY4RUU4MDEyQExZTEFMQVAyPg=="},"prevInTopic":46237,"nextInTopic":46246,"prevInTime":46244,"nextInTime":46246,"topicId":46200,"numMessagesInTopic":0,"msgSnippet":"... My response just posted: Now that you ve added the disclaimer - I know that there are unschoolers who give their children a fine education. However, my ","messageBody":"<div id=\"ygrps-yiv-254617635\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Lyla Wolfenstein&quot; &lt;lylaw@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; thought some might want to reply<br/>\n&gt; <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.examiner.com/examiner/x-10127-Norfolk-Homeschooling-Examiner~y2009m7d1-Some-may-call-it-unschooling-I-call-it-educational-neglect\">http://www.examiner.com/examiner/x-10127-Norfolk-Homeschooling-Examiner~y2009m7d1-Some-may-call-it-unschooling-I-call-it-educational-neglect</a><br/>\n&gt; <br/>\n&gt; Lyla<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>My response just posted:<br/>\n<br/>\n&quot;Now that you&#39;ve added the disclaimer - &quot;I know that there are<br/>\nunschoolers who give their children a fine education. However, my<br/>\nissue is not with them, it is with those people who hide behind the<br/>\nlabel of unschooling.&quot; - this article is not worth the paper it&#39;s<br/>\nwritten on, is it?<br/>\n<br/>\nMaybe you could rewrite it so that it&#39;s directed to the people you<br/>\napparently intended it to be directed to - the small minority of<br/>\n&quot;unschoolers&#39; who give unschooling a bad name.<br/>\n<br/>\nI&#39;m happy to waive the apology to the rest of us. I can&#39;t speak for<br/>\nothers of course.&quot;<br/>\n<br/>\nHope that helps.<br/>\n<br/>\nBob</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] unschooling trashed  in this article","postDate":"1246579664","msgId":46236,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA4OTI1MjZELUIwMDktNEI4Qy1COTQ2LTRDNzM2MTkwQkREQ0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDRBNEQyNUQ1LjIwNTAyMDZAbWFjLmNvbT4=","referencesHeader":"PDY0MTE2My41MDE0Mi5xbUB3ZWI1MDQwNy5tYWlsLnJlMi55YWhvby5jb20+IDw0OENDMjZEQy0xM0QzLTQ1NDAtQjNCMC01OUI2NjU2RDNEMDJAU2FuZHJhZG9kZC5jb20+IDw0QTREMjVENS4yMDUwMjA2QG1hYy5jb20+"},"prevInTopic":46233,"nextInTopic":46237,"prevInTime":46235,"nextInTime":46237,"topicId":46200,"numMessagesInTopic":0,"msgSnippet":"-=-Sometimes parents are ignoring problems in the name of not punishing or shaming and that s not the idea response, either.-=- A parent who doesn t have the","messageBody":"<div id=\"ygrps-yiv-1596161178\">-=-Sometimes parents are ignoring problems in the name<br/>\nof not punishing or shaming and that&#39;s not the idea response, either.-=-<br/>\n<br/>\nA parent who doesn&#39;t have the natural instinct or talent or skill to  <br/>\nadvise persuasively might have been ineffectual with punishments too,  <br/>\nI think.<br/>\n<br/>\nIt&#39;s a hard thing for me, thinking that Howard Gardner is really on to  <br/>\nsomething about interpersonal intelligence, and then thinking  <br/>\nunschooling takes a lot of interpersonal intelligence and then  <br/>\nrealizing some kids don&#39;t have it because their parents don&#39;t have it  <br/>\nand....   unschooling isn&#39;t going to work as well for them as for some  <br/>\nothers.  BUT... if the parents are that way, and the kids are that  <br/>\nway, school might easily be even more baffling for them than  <br/>\nunschooling is.<br/>\n<br/>\nStill, I remember after one of the Live and Learn conferences there in  <br/>\nthe middle of them, a mom complaining on a list afterwards that it was  <br/>\nJUST LIKE SCHOOL, because some of the girls were friends from the year  <br/>\nbefore and her daughter felt there were cliques she wasn&#39;t part of.<br/>\n<br/>\nI think what&#39;s just like school is expecting the kids to be nice to  <br/>\nall the other kids who are unschooled and at a conference, as though  <br/>\nthey&#39;re in the same school and &quot;have to&quot; be nice.   Mostly the kids  <br/>\nARE nice, but if mothers come to me and say &quot;Make your kids be  <br/>\nfriendly with everyone equally, that&#39;s more like the conditions of an  <br/>\ninstitution.<br/>\n<br/>\nNothing is perfect, but some things are better than they would be if  <br/>\nwe weren&#39;t at least headed in the direction of peace and light and  <br/>\nlearning and all that good stuff.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] unschooling trashed  in this article","postDate":"1246579351","msgId":46237,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQwRDVFNThCLTAyMzEtNEZCRi1BQzFDLTNBQUVBMEE2RjRDREBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDRBNEQyNUQ1LjIwNTAyMDZAbWFjLmNvbT4=","referencesHeader":"PDY0MTE2My41MDE0Mi5xbUB3ZWI1MDQwNy5tYWlsLnJlMi55YWhvby5jb20+IDw0OENDMjZEQy0xM0QzLTQ1NDAtQjNCMC01OUI2NjU2RDNEMDJAU2FuZHJhZG9kZC5jb20+IDw0QTREMjVENS4yMDUwMjA2QG1hYy5jb20+"},"prevInTopic":46236,"nextInTopic":46245,"prevInTime":46236,"nextInTime":46238,"topicId":46200,"numMessagesInTopic":0,"msgSnippet":"-=-Sometimes parents are ignoring problems in the name of not punishing or shaming and that s not the idea response, either.-=- A parent who doesn t have the","messageBody":"<div id=\"ygrps-yiv-1520516246\">-=-Sometimes parents are ignoring problems in the name<br/>\nof not punishing or shaming and that&#39;s not the idea response, either.-=-<br/>\n<br/>\nA parent who doesn&#39;t have the natural instinct or talent or skill to  <br/>\nadvise persuasively might have been ineffectual with punishments too,  <br/>\nI think.<br/>\n<br/>\nIt&#39;s a hard thing for me, thinking that Howard Gardner is really on to  <br/>\nsomething about interpersonal intelligence, and then thinking  <br/>\nunschooling takes a lot of interpersonal intelligence and then  <br/>\nrealizing some kids don&#39;t have it because their parents don&#39;t have it  <br/>\nand....   unschooling isn&#39;t going to work as well for them as for some  <br/>\nothers.  BUT... if the parents are that way, and the kids are that  <br/>\nway, school might easily be even more baffling for them than  <br/>\nunschooling is.<br/>\n<br/>\nStill, I remember after one of the Live and Learn conferences there in  <br/>\nthe middle of them, a mom complaining on a list afterwards that it was  <br/>\nJUST LIKE SCHOOL, because some of the girls were friends from the year  <br/>\nbefore and her daughter felt there were cliques she wasn&#39;t part of.<br/>\n<br/>\nI think what&#39;s just like school is expecting the kids to be nice to  <br/>\nall the other kids who are unschooled and at a conference, as though  <br/>\nthey&#39;re in the same school and &quot;have to&quot; be nice.   Mostly the kids  <br/>\nARE nice, but if mothers come to me and say &quot;Make your kids be  <br/>\nfriendly with everyone equally, that&#39;s more like the conditions of an  <br/>\ninstitution.<br/>\n<br/>\nNothing is perfect, but some things are better than they would be if  <br/>\nwe weren&#39;t at least headed in the direction of peace and light and  <br/>\nlearning and all that good stuff.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] unschooling trashed  in this article","postDate":"1246569941","msgId":46233,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRBNEQyNUQ1LjIwNTAyMDZAbWFjLmNvbT4=","inReplyToHeader":"PDQ4Q0MyNkRDLTEzRDMtNDU0MC1CM0IwLTU5QjY2NTZEM0QwMkBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDY0MTE2My41MDE0Mi5xbUB3ZWI1MDQwNy5tYWlsLnJlMi55YWhvby5jb20+IDw0OENDMjZEQy0xM0QzLTQ1NDAtQjNCMC01OUI2NjU2RDNEMDJAU2FuZHJhZG9kZC5jb20+"},"prevInTopic":46226,"nextInTopic":46236,"prevInTime":46232,"nextInTime":46234,"topicId":46200,"numMessagesInTopic":0,"msgSnippet":"The funny thing is, there are out of control (or bratty or whatever you want to call it) kids whose parents use curriculum on them, too. Nobody blames the","messageBody":"<div id=\"ygrps-yiv-842660994\">The funny thing is, there are &quot;out of control&quot; (or bratty or whatever <br/>\nyou want to call it) kids whose parents use curriculum on them, too. <br/>\nNobody blames the curriculum for wild or difficult behavior. I think <br/>\nwhat really happens is that there are kids who are intense or explosive <br/>\nor more prone to impulsive behaviors, etc., out there in all groups. But <br/>\nwhen we (unschoolers) have kids like that, we aren&#39;t seen as &quot;doing <br/>\nsomething about it,&quot; because we don&#39;t shame and punish - especially <br/>\nbecause we don&#39;t shame and punish right then and there in front of <br/>\neverybody, like other parents do. I&#39;ve had parents tell me, &quot;If you just <br/>\nlet that go, it will only get worse.&quot; They assume that I&#39;m just letting <br/>\nthings go because they don&#39;t see my way of responding - which is <br/>\ncertainly not going to be to loudly shame my child or punishing her.<br/>\n<br/>\nOn the other hand,I also think there are a lot of people who come to <br/>\nunschooling and don&#39;t want to shame and punish, but don&#39;t know what else <br/>\nto do and their kids are not necessarily getting the kind of counseling <br/>\nand guidance and parental supervision and intervention that they need.<br/>\n<br/>\nIn my opinion, erring on the side of not punishing and shaming seems to <br/>\nwork out better, in the long run, but there are some unschooled kids <br/>\nwhose behavior gets in the way of them achieving current happiness or <br/>\nwho impose enough difficulties on other people so that others don&#39;t want <br/>\nto be around them. Sometimes parents are ignoring problems in the name <br/>\nof not punishing or shaming and that&#39;s not the idea response, either.<br/>\n<br/>\n-pam<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 7/2/2009 12:07 PM, Sandra Dodd wrote:<br/>\n&gt; -=-She isn&#39;t the first person I&#39;ve come across who has met one or more<br/>\n&gt; unschooling families that have turned them off unschooling.-=-<br/>\n&gt;<br/>\n&gt; People use that as an excuse, though, when they weren&#39;t really wanting<br/>\n&gt; to do something.  It&#39;s easier to point and blame someone or something<br/>\n&gt; instead of saying &quot;I thought about it, but I want to do something<br/>\n&gt; different.&quot;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] unschooling trashed  in this article","postDate":"1246561655","msgId":46226,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ4Q0MyNkRDLTEzRDMtNDU0MC1CM0IwLTU5QjY2NTZEM0QwMkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDY0MTE2My41MDE0Mi5xbUB3ZWI1MDQwNy5tYWlsLnJlMi55YWhvby5jb20+","referencesHeader":"PDY0MTE2My41MDE0Mi5xbUB3ZWI1MDQwNy5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":46223,"nextInTopic":46233,"prevInTime":46225,"nextInTime":46227,"topicId":46200,"numMessagesInTopic":0,"msgSnippet":"-=-She isn t the first person I ve come across who has met one or more unschooling families that have turned them off unschooling.-=- People use that as an","messageBody":"<div id=\"ygrps-yiv-102563013\">-=-She isn&#39;t the first person I&#39;ve come across who has met one or more  <br/>\nunschooling families that have turned them off unschooling.-=-<br/>\n<br/>\nPeople use that as an excuse, though, when they weren&#39;t really wanting  <br/>\nto do something.  It&#39;s easier to point and blame someone or something  <br/>\ninstead of saying &quot;I thought about it, but I want to do something  <br/>\ndifferent.&quot;<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":12252351,"authorName":"Gwen","from":"Gwen &lt;willow_selene@...&gt;","profile":"willow_selene","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] unschooling trashed  in this article","postDate":"1246560466","msgId":46223,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY0MTE2My41MDE0Mi5xbUB3ZWI1MDQwNy5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":46220,"nextInTopic":46226,"prevInTime":46222,"nextInTime":46224,"topicId":46200,"numMessagesInTopic":0,"msgSnippet":"I was on an attachment parenting yahoo group with the author when our kids were little...our kids are only six months apart in age.  I was always fascinated","messageBody":"<div id=\"ygrps-yiv-1186505929\">I was on an attachment parenting yahoo group with the author when our kids were little...our kids are only six months apart in age.  I was always fascinated by what Ben & Shira were doing because it usually meant Megan would be doing it soon!  I think she dropped off the list (either no mail or just faded away) when the kids were around four.  I think she went the &quot;Well Trained Mind&quot; route of homeschooling.<br/>\n<br/>\nThey&#39;d make an amazing unschooling family if they changed their perspective. <br/>\n<br/>\nShe isn&#39;t the first person I&#39;ve come across who has met one or more unschooling families that have turned them off unschooling.<br/>\n<br/>\nGwen<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Thu, 7/2/09, Robyn L. Coburn &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dezigna@...\">dezigna@...</a>&gt; wrote:<br/>\n<br/>\nIn what might be seen as a victory of sorts, there is a second article, with <br/>\nsome backtracking. But now unschoolers are being told to &quot;tone down our <br/>\nrhetoric&quot; to prevent neglectful parents from hiding behind the label.<br/>\n<br/>\nIsn&#39;t that called &quot;blaming the victim&quot; somewhere or other? I commented <br/>\nciting the First Amendment.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://tinyurl.com/m4xy6d\">http://tinyurl.com/m4xy6d</a><br/>\n<br/>\nRobyn L. Coburn<br/>\nwww.Iggyjingles.etsy.com<br/>\nwww.iggyjingles.blogspot.com<br/>\nwww.allthingsdoll.blogspot.com<br/>\n<br/>\n<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.examiner.com/examiner/x-10127-Norfolk-Homeschooling-Examiner~y2009m7d1-Some-may-call-it-unschooling-I-call-it-educational-neglect\">http://www.examiner.com/examiner/x-10127-Norfolk-Homeschooling-Examiner~y2009m7d1-Some-may-call-it-unschooling-I-call-it-educational-neglect</a><br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":287815876,"authorName":"Robyn L. Coburn","from":"&quot;Robyn L. Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] unschooling trashed  in this article","postDate":"1246557487","msgId":46220,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcyRDBDMDdGM0IyRTQ5MEU5RTYwMjZBRTcxOTA3QUY5QFJvYnluUEM+","inReplyToHeader":"PDgwODM2QTgwQ0MyMTRBNUNCOTAwNjI0MDY4RUU4MDEyQExZTEFMQVAyPg==","referencesHeader":"PDgwODM2QTgwQ0MyMTRBNUNCOTAwNjI0MDY4RUU4MDEyQExZTEFMQVAyPg=="},"prevInTopic":46205,"nextInTopic":46223,"prevInTime":46219,"nextInTime":46221,"topicId":46200,"numMessagesInTopic":0,"msgSnippet":"In what might be seen as a victory of sorts, there is a second article, with some backtracking. But now unschoolers are being told to tone down our rhetoric","messageBody":"<div id=\"ygrps-yiv-581547350\">In what might be seen as a victory of sorts, there is a second article, with <br/>\nsome backtracking. But now unschoolers are being told to &quot;tone down our <br/>\nrhetoric&quot; to prevent neglectful parents from hiding behind the label.<br/>\n<br/>\nIsn&#39;t that called &quot;blaming the victim&quot; somewhere or other? I commented <br/>\nciting the First Amendment.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://tinyurl.com/m4xy6d\">http://tinyurl.com/m4xy6d</a><br/>\n<br/>\nRobyn L. Coburn<br/>\nwww.Iggyjingles.etsy.com<br/>\nwww.iggyjingles.blogspot.com<br/>\nwww.allthingsdoll.blogspot.com<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.examiner.com/examiner/x-10127-Norfolk-Homeschooling-Examiner~y2009m7d1-Some-may-call-it-unschooling-I-call-it-educational-neglect\">http://www.examiner.com/examiner/x-10127-Norfolk-Homeschooling-Examiner~y2009m7d1-Some-may-call-it-unschooling-I-call-it-educational-neglect</a> </span></blockquote></div>","specialLinks":[]},{"userId":193310064,"authorName":"JoyErin","from":"&quot;JoyErin&quot; &lt;joyerin@...&gt;","profile":"werefree2learn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] Re: unschooling trashed  in this article","postDate":"1246509104","msgId":46205,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY3RkY3RkFCMTQwRjQzQzE5NDU3M0NFNDExMzI3NDc3QERhZFBDPg==","inReplyToHeader":"PEUzMkE4RkU4LTdDMUQtNEVBRC04Njc2LTAzMkQ4OUZCQ0Y2NEBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGgyaGJyNit0czJmQGVHcm91cHMuY29tPiA8RTMyQThGRTgtN0MxRC00RUFELTg2NzYtMDMyRDg5RkJDRjY0QFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":46204,"nextInTopic":46220,"prevInTime":46204,"nextInTime":46206,"topicId":46200,"numMessagesInTopic":0,"msgSnippet":"-= I responded not for the author s sake, but for those who will wade through the comments. I tried to be calming.   =- And you were - very nicely done.","messageBody":"<div id=\"ygrps-yiv-423029798\">-= I responded not for the author&#39;s sake, but for those who will wade<br/>\nthrough the comments.<br/>\nI tried to be calming. &lt;g&gt;  =-<br/>\n<br/>\nAnd you were - very nicely done.  Writers like her, when I&#39;m in the right<br/>\nmind set, give me a chuckle.  While trying to make a point of how terrible<br/>\nthey think something is they end up making themselves look bad and so in the<br/>\nprocess, imo, make the other side look like something worth finding out more<br/>\nabout.  &lt;g&gt;<br/>\n<br/>\nJoy<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\nChecked by AVG - www.avg.com<br/>\nVersion: 8.5.375 / Virus Database: 270.13.1/2212 - Release Date: 07/01/09<br/>\n05:53:00<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: unschooling trashed  in this article","postDate":"1246508369","msgId":46204,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEUzMkE4RkU4LTdDMUQtNEVBRC04Njc2LTAzMkQ4OUZCQ0Y2NEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGgyaGJyNit0czJmQGVHcm91cHMuY29tPg==","referencesHeader":"PGgyaGJyNit0czJmQGVHcm91cHMuY29tPg=="},"prevInTopic":46203,"nextInTopic":46205,"prevInTime":46203,"nextInTime":46205,"topicId":46200,"numMessagesInTopic":0,"msgSnippet":"-=- Does something so biased even deserve a response?-=- I responded not for the author s sake, but for those who will wade through the comments. I tried to be","messageBody":"<div id=\"ygrps-yiv-699726717\">-=-<br/>\nDoes something so biased even deserve a response?-=-<br/>\n<br/>\nI responded not for the author&#39;s sake, but for those who will wade  <br/>\nthrough the comments.<br/>\nI tried to be calming. &lt;g&gt;<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":185586397,"authorName":"Lyla Wolfenstein","from":"&quot;Lyla Wolfenstein&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: unschooling trashed  in this article","postDate":"1246507824","msgId":46203,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZBOTQ0OUNCRTBGNzQxREM4NDZCMjVFODQxNDBFOTUyQExZTEFMQVAyPg==","inReplyToHeader":"PGgyaGJyNit0czJmQGVHcm91cHMuY29tPg==","referencesHeader":"PGgyaGJyNit0czJmQGVHcm91cHMuY29tPg=="},"prevInTopic":46202,"nextInTopic":46204,"prevInTime":46202,"nextInTime":46204,"topicId":46200,"numMessagesInTopic":0,"msgSnippet":"Does something so biased even deserve a response? that s what i was pondering - maybe - depending on how many would read it? Lyla Recent Activity ","messageBody":"<div id=\"ygrps-yiv-2095787322\">Does something so biased even deserve a response?&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n<br/>\n<br/>\n  that&#39;s what i was pondering - maybe - depending on how many would read it?<br/>\n<br/>\n  Lyla<br/>\n  Recent Activity<br/>\n    a..  13New Members<br/>\n  Visit Your Group <br/>\n  Give Back<br/>\n  Yahoo! for Good<br/>\n<br/>\n  Get inspired<br/>\n<br/>\n  by a good cause.<br/>\n<br/>\n  Y! Toolbar<br/>\n  Get it Free!<br/>\n<br/>\n  easy 1-click access<br/>\n<br/>\n  to your groups.<br/>\n<br/>\n  Yahoo! Groups<br/>\n  Start a group<br/>\n<br/>\n  in 3 easy steps.<br/>\n<br/>\n  Connect with others.<br/>\n  . <br/>\n<br/>\n  <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":381959449,"authorName":"kelly_sturman","from":"&quot;kelly_sturman&quot; &lt;conspicuousfamily@...&gt;","profile":"kelly_sturman","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: unschooling trashed  in this article","postDate":"1246507686","msgId":46202,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGgyaGJyNit0czJmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDgwODM2QTgwQ0MyMTRBNUNCOTAwNjI0MDY4RUU4MDEyQExZTEFMQVAyPg=="},"prevInTopic":46200,"nextInTopic":46203,"prevInTime":46201,"nextInTime":46203,"topicId":46200,"numMessagesInTopic":0,"msgSnippet":"Does something so biased even deserve a response? Kelly Sturman I ve been called many things, but lazy mom has never come up before...","messageBody":"<div id=\"ygrps-yiv-707923745\">Does something so biased even deserve a response?<br/>\n<br/>\nKelly Sturman<br/>\nI&#39;ve been called many things, but &quot;lazy mom&quot; has never come up before...<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Lyla Wolfenstein&quot; &lt;lylaw@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; thought some might want to reply<br/>\n&gt; <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.examiner.com/examiner/x-10127-Norfolk-Homeschooling-Examiner~y2009m7d1-Some-may-call-it-unschooling-I-call-it-educational-neglect\">http://www.examiner.com/examiner/x-10127-Norfolk-Homeschooling-Examiner~y2009m7d1-Some-may-call-it-unschooling-I-call-it-educational-neglect</a><br/>\n&gt; <br/>\n&gt; Lyla<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":185586397,"authorName":"Lyla Wolfenstein","from":"&quot;Lyla Wolfenstein&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"unschooling trashed  in this article","postDate":"1246506531","msgId":46200,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgwODM2QTgwQ0MyMTRBNUNCOTAwNjI0MDY4RUU4MDEyQExZTEFMQVAyPg=="},"prevInTopic":0,"nextInTopic":46202,"prevInTime":46199,"nextInTime":46201,"topicId":46200,"numMessagesInTopic":0,"msgSnippet":"thought some might want to reply ","messageBody":"<div id=\"ygrps-yiv-564653969\">thought some might want to reply<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.examiner.com/examiner/x-10127-Norfolk-Homeschooling-Examiner~y2009m7d1-Some-may-call-it-unschooling-I-call-it-educational-neglect\">http://www.examiner.com/examiner/x-10127-Norfolk-Homeschooling-Examiner~y2009m7d1-Some-may-call-it-unschooling-I-call-it-educational-neglect</a><br/>\n<br/>\nLyla<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":46305,"nextTopicId":46240}}