{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Indigo Children dichotomy","postDate":"1132550571","msgId":110111,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU5LjMzNWQ5NmEwLjMwYjJiM2FiQGFvbC5jb20+"},"prevInTopic":110110,"nextInTopic":0,"prevInTime":110110,"nextInTime":110112,"topicId":110110,"numMessagesInTopic":0,"msgSnippet":"Another false dichotomy, this time from an article here: http://skepdic.com/indigo.html -=-The hype and near-hysteria surrounding the use of Ritalin has","messageBody":"<div id=\"ygrps-yiv-1430398158\">Another false dichotomy, this time from an article here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://skepdic.com/indigo.html\">http://skepdic.com/indigo.html</a><br/>\n<br/>\n-=-The hype and near-hysteria surrounding the use of Ritalin has contributed <br/>\nto an atmosphere that makes it possible for a book like Indigo Children to be <br/>\ntaken seriously. Given the choice, who wouldn&#39;t rather believe their children <br/>\nare special and chosen for some high mission rather than that they have a <br/>\nbrain disorder?-=-<br/>\n<br/>\nThose two extremes are FAR from being the only two choices.   &quot;ADD&quot; (whatever <br/>\nbundle of indicators you want to think of) is NOT &quot;a brain disorder.&quot;   But <br/>\nit not being a brain disorder in no way means that those with the symptoms <br/>\nidentify superior, more evolved beings from another planet.<br/>\n<br/>\nThis doesn&#39;t have much to do with unschooling directly, but because there&#39;s a <br/>\nbig blitz and they&#39;ll be on TV, it will be coming up in discussions, I&#39;m <br/>\nafraid.    A few years back before I knew how nutty it all was, just knew there <br/>\nwas a new new-age magazine coming out about kids, I wrote something for them.   <br/>\nThey didn&#39;t put it in the magazine (for which I&#39;m relieved), it was on the <br/>\nwebsite (but isn&#39;t anymore, for which I&#39;m relieved).   <br/>\n<br/>\nSomehow they discovered the existence of the Live and Learn conference, and b<br/>\nasically saw homeschoolers as a market for their magazine, I think.    (A <br/>\nquote that accidently came appended to another e-mail was this:   <br/>\n]-=-=-&quot;the Sandra Dodd who is their guest speaker is quite &quot;Big&quot; in the<br/>\nhomeschool/unschool realm.   Notice they have a message board.   Maybe they<br/>\nwould let us post.   As I have been researching for NEXT, I am finding that<br/>\nhomeschooling/unschooling is much bigger than I previously thought.   Maybe I<br/>\nwill try to find this Sandra Dodd for an article.   I think we have a large<br/>\nrealm out their to tap for the magazine.-=-=-<br/>\n<br/>\nSo just in case this topic bubbles up on other lists or exchanges this week <br/>\nor in the future, please know that it&#39;s another kind of money-making scam-like <br/>\nthing succeeding not in making children&#39;s lives better, but in being a <br/>\nmoneymaker for its leaders.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Indigo Children dichotomy","postDate":"1132549214","msgId":110110,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI2Yi4yMTdjM2IuMzBiMmFlNWVAYW9sLmNvbT4="},"prevInTopic":0,"nextInTopic":110111,"prevInTime":110109,"nextInTime":110111,"topicId":110110,"numMessagesInTopic":0,"msgSnippet":"Below is another either or message, and in case any of you are interested and see this before it s aired... -=-In the last few weeks, media interest started","messageBody":"<div id=\"ygrps-yiv-1587407358\">Below is another &quot;either or&quot; message, and in case any of you are interested <br/>\nand see this before it&#39;s aired...<br/>\n<br/>\n-=-In the last few weeks, media interest started soaring following reports in <br/>\nUSA Today and on CNN. In the last 72 hours a profound wave of interest has <br/>\nerupted across the global stage. Tomorrow morning (Monday November 21st) at <br/>\n8.06am eastern time, ABC&#39;s Good Morning America is scheduled to feature a segment <br/>\non the Indigo children and the Indigo Evolution documentary.-=-<br/>\n<br/>\n-=-On the one hand, we have experts claiming that the Indigo phenomenon is <br/>\nnothing more than some parents’ attempts to excuse and explain away dysfun<br/>\nctional behavior. On the other hand, we have experts claiming that there is real <br/>\nsolid evidence that today’s children are more intelligent and more multi-sensory <br/>\nthan previous generations.-=-<br/>\n<br/>\nThose aren&#39;t the only two choices, and if it seems today&#39;s children are more <br/>\nmulti-sensory and more intelligent, maybe it&#39;s just because people are finally <br/>\nstarting to LISTEN to children and not just tell them to shut up.<br/>\n<br/>\nThe Indigo Children stuff is being shoved out front in kind of sneaky ways.   <br/>\n  Christmas catalogs are coming, and one called &quot;Explorations: Visions of the <br/>\nPast * Memories of the Future&quot; came.   On the first page of the &quot;Enlightened <br/>\nEntertainment&quot; section it shows three DVDs:   <br/>\nWhale Rider, Dead Poets Society and Indigo.<br/>\nThat pretty much sets that up as the equal of those movies.   <br/>\n<br/>\nIndigo is a documentary from this year, making weird claims, and created by <br/>\nthe people who run the magazine.   <br/>\n<br/>\nIt&#39;s someone else making money making spurious claims, and not very useful <br/>\nclaims either.<br/>\n<br/>\nAt one point it seemed there was interest there about homeschooling, and I <br/>\nwas asked to write an article for them.   I didn&#39;t know or care at the time what <br/>\ntheir claims were, because it wasn&#39;t going to make any difference in how I <br/>\nwrote about homeschooling.   Turned out, though, they were basically using me to <br/>\nget to unschoolers and homeschoolers for their magazine subscription base.    <br/>\n<br/>\n<br/>\nIt&#39;s yet another thing that&#39;s about money first.   And it&#39;s the ULTIMATE in <br/>\nlabelling children superior to others.<br/>\n<br/>\nBut anyway, it&#39;s weird and it&#39;s on TV Monday morning, and there&#39;s information <br/>\ncritical of the proponents and iniators of the Indigo Children stuff here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://selectsmart.com/twyman.html\">http://selectsmart.com/twyman.html</a><br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":2025,"nextTopicId":110112}}