{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":13,"messages":[{"userId":55326806,"authorName":"rumpleteasermom","from":"&quot;rumpleteasermom&quot; &lt;rumpleteasermom@...&gt;","profile":"rumpleteasermom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Look!  A NEW question :)","postDate":"1021118639","msgId":36984,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGFiajFiZit1NmRyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE2My5kOTZkMzE0LjJhMGRjNDRjQGFvbC5jb20+"},"prevInTopic":36980,"nextInTopic":0,"prevInTime":36983,"nextInTime":36985,"topicId":36946,"numMessagesInTopic":0,"msgSnippet":"Hi Ang, I m in OH too, near Akron to be specific. My mom is a certified teacher and she does assessments.  She will look at anything that represents what level","messageBody":"<div id=\"ygrps-yiv-167108751\">Hi Ang,<br/>\n<br/>\nI&#39;m in OH too, near Akron to be specific.<br/>\nMy mom is a certified teacher and she does assessments.  She will look <br/>\nat anything that represents what level your child is on.  She is <br/>\npretty laid back about the whole thing.  And that&#39;s the key here in <br/>\nOhio . . . find an assessor who understands unschooling.  I know of <br/>\nthree or four in this area.  You could join <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/oh-homeschool\">http://groups.yahoo.com/group/oh-homeschool</a><br/>\nto find an assessor closer to you.  The above is an inclusive Ohio <br/>\ngroup, just tell them you are looking for an unschooling friendly <br/>\nassessor in whatever area you are.<br/>\n<br/>\nJut out of curiousity, what other states have laws similar to our?  We <br/>\nhave to either do a standardized test (and provide ONLY the composite <br/>\nscore) once a year or have a certified teached look at a portfolio of <br/>\nwork and declare the child sufficient.  There&#39;s a third option of <br/>\nanything agreed upon between the super and the parent but not many <br/>\npeople use that.<br/>\n<br/>\nBridget<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In Unschooling-dotcom@y..., megamom08@a... wrote:<br/>\n I would also appreciate any <br/>\nfeedback or <br/>\n&gt; online resources for creating our first portfolio for certified <br/>\nteacher <br/>\n&gt; review. How do unschoolers (in Ohio or elsewhere) handle this? I <br/>\nhave been <br/>\n&gt; keeping a journal and keeping any evidence of topics covered just <br/>\nfor my own <br/>\n&gt; satisfaction, but I have worried how to put together something <br/>\nthat&#39;s enough, <br/>\n&gt; considering we have less than six months of homeschooling for this <br/>\nyear.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Ang<br/>\n&gt; SAHM to<br/>\n&gt; Megan Elizabeth 8/8/92 8lbs 8oz<br/>\n&gt; Ashlyn Olivia 7/25/99 9lbs 8oz<br/>\n&gt;  Christian James 6/09/01 9lbs 5oz<br/>\n&gt;  <br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":69718075,"authorName":"Joan Wilson","from":"&quot;Joan Wilson&quot; &lt;jroselady@...&gt;","profile":"jroselady","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [Unschooling-dotcom] Look!  A NEW question :)","postDate":"1021092893","msgId":36980,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEhORU1JTlBBQ0FJTkRMQkdKTUNBRUVCSkNGQUEuanJvc2VsYWR5QGVhcnRobGluay5uZXQ+","inReplyToHeader":"PEI5MDBCRDZFLkIwMiVhYnRsZW9AZWFydGhsaW5rLm5ldD4="},"prevInTopic":36975,"nextInTopic":36984,"prevInTime":36979,"nextInTime":36981,"topicId":36946,"numMessagesInTopic":0,"msgSnippet":"Oh yes, that stimulating book discussion in the K or 1st grade.  The one where the kid wiggles and bugs every one around him/her while the teacher is reading","messageBody":"<div id=\"ygrps-yiv-918037946\">Oh yes, that stimulating book discussion in the K or 1st grade.  The one<br/>\nwhere the kid wiggles and bugs every one around him/her while the teacher is<br/>\nreading the book (you know the one that the teacher has to have a weekly<br/>\nconference with their parents cause the teacher has to stop and talk to 50<br/>\ntimes a day) - yeah that one -- anyway, that kid blurts out &quot;It was dumb!&quot;.<br/>\n<br/>\nMy son is happy about missing those discussions.  Other than that they would<br/>\ngo to the library and the librarian or a parent would read a pre-selected<br/>\nbook and then they would go find a book with the color dot in their reading<br/>\nlevel.<br/>\n<br/>\nAt 5, a lot of children don&#39;t read on thier own.<br/>\n<br/>\nAnyway - I like Sandra&#39;s suggestion that school is there if you ever need<br/>\nit.  Or you could smile and change the subject.<br/>\n<br/>\nMy son is now 11 and started reading (what he likes) about a year ago.  He<br/>\nwas able to read at about 7 (in school) but they took the joy right out of<br/>\nit by the age of 9.<br/>\n<br/>\nGood luck,<br/>\n<br/>\nJoan<br/>\n  Their latest commentary is on how much Tim misses from school,<br/>\nparticularly<br/>\n  in reading.  My mother maintains that the discussion after the book is, in<br/>\n  many ways, more important than the book itself.   we discuss books<br/>\nfrequently.  I ask about books he&#39;s<br/>\n  read recently, and he can usually say something coherant on them.<br/>\nSometimes<br/>\n  the conversation lasts 10 seconds, sometimes we&#39;re there for a lot longer.<br/>\n<br/>\n  Am I missing something here?  I do realize that much of their problem with<br/>\n  homeschooling relates to problems with change.  But I guess I just need<br/>\nsome<br/>\n  reassurance that I&#39;m doing the right thing by trusting my child to benefit<br/>\n  from the book, regardless of whether he sat in a class discussion on it or<br/>\n  we talked about it for a long time, or did follow-up activities related to<br/>\n  that book, or anything else!  BTW, the child in question is 5, almost 6<br/>\nnow.<br/>\n<br/>\n  (somebody, please, say *something* good about unschooling; I need it!)<br/>\n<br/>\n  brenda<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n        Yahoo! Groups Sponsor<br/>\n              ADVERTISEMENT<br/>\n<br/>\n                   Height:   4567 ft  01234567891011 in<br/>\n                          Weight:<br/>\n                          Sex:   F  M<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  ~~~ Don&#39;t forget! If you change the topic, change the subject line! ~~~<br/>\n<br/>\n  To unsubscribe from this group, send an email to:<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-unsubscribe@yahoogroups.com\">Unschooling-dotcom-unsubscribe@yahoogroups.com</a><br/>\n<br/>\n  Visit the Unschooling website:<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n<br/>\n<br/>\n<br/>\n  Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service.<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":4514776,"authorName":"megamom08@aol.com","from":"megamom08@...","profile":"megamom08","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Look!  A NEW question :)","postDate":"1021078092","msgId":36975,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE2My5kOTZkMzE0LjJhMGRjNDRjQGFvbC5jb20+"},"prevInTopic":36958,"nextInTopic":36980,"prevInTime":36974,"nextInTime":36976,"topicId":36946,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/10/02 2:25:34 AM Eastern Daylight Time, ... This is my first time posting to the list, I have been reading for a few weeks and unschooling","messageBody":"<div id=\"ygrps-yiv-1546691142\">In a message dated 5/10/02 2:25:34 AM Eastern Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; You can nod thoughtfully when they tell you things and say &quot;I&#39;ll keep that <br/>\n&gt; in <br/>\n&gt; mind for sure, and if this isn&#39;t working out, we can put him in school.&quot;<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; What are the odds of it not working?  But you can reassure them truthfully <br/>\n&gt; that if it does NOT work out, school&#39;s still right there, willing to take <br/>\n&gt; him.<br/>\n&gt; <br/>\n&gt; That will calm them down and they won&#39;t be pressuring you moment to moment.<br/>\n&gt; <br/>\n&gt; I said that lots of times when Kirby was little.  It shushed a lot of <br/>\n&gt; impending criticism.  &quot;If it doesn&#39;t work out, we&#39;ll put him in school.&quot;<br/>\n&gt; <br/>\n&gt; Sandra&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>This is my first time posting to the list, I have been reading for a few <br/>\nweeks and unschooling since removing my 9yo daughter Megan from school in <br/>\nFebruary. My mother is supporting me, in her words, but she doesn&#39;t really <br/>\nknow my unschooling ways. I told her we are putting together units from <br/>\nMegan&#39;s interests, which is not completely false. She has never really <br/>\nsupported me in most of my adult decisions. When I practiced &quot;attachment <br/>\nparenting&quot; with my second child, I was blamed for creating a high-needs <br/>\nchild, when in reality the attachment style made life easier for coping with <br/>\nher temperament. I wish i would have followed my instincts more with my <br/>\nfirst, also a highly intense child, and I am finding this unschooling <br/>\nincredible in terms of the bonding that is happening, like an extension of <br/>\nattachment parenting. I thought it was just for babies! It makes up for the m<br/>\nore detached mothering of her as an infant. At any rate, I have Mom&#39;s <br/>\n&quot;support&quot;, she wants to help me with resources, but she wants to make sure I <br/>\nam not ruining my daughter&#39;s education/life. From the beginning, I have told <br/>\nher that my decision is reversible, and that I can put her back in school &quot;if <br/>\nit doesn&#39;t work out&quot;, knowing full well that it would be the absolute last <br/>\nthing I would ever want to do. So now she is so concerned with scope and <br/>\nsequence, she doesn&#39;t want Megan to &quot;fall behind&quot; if she ever wants to return <br/>\nto school. She even tries to drill her on multiplication tables regularly, to <br/>\nmake sure we don&#39;t have any gaps. I must admit that I still have some <br/>\ndeschooling to do, I still have little panic attacks about making sure she is <br/>\nwanting to learn all she &quot;needs&quot; to, and keep referring back to a scope book <br/>\nthat I have. Do I try to explain unschooling, knowing that I will meet much <br/>\nskepticism, or just keep nodding? I would also appreciate any feedback or <br/>\nonline resources for creating our first portfolio for certified teacher <br/>\nreview. How do unschoolers (in Ohio or elsewhere) handle this? I have been <br/>\nkeeping a journal and keeping any evidence of topics covered just for my own <br/>\nsatisfaction, but I have worried how to put together something that&#39;s enough, <br/>\nconsidering we have less than six months of homeschooling for this year.<br/>\n<br/>\n<br/>\nAng<br/>\nSAHM to<br/>\nMegan Elizabeth 8/8/92 8lbs 8oz<br/>\nAshlyn Olivia 7/25/99 9lbs 8oz<br/>\n Christian James 6/09/01 9lbs 5oz<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":98536371,"authorName":"Kinkade","from":"&quot;Kinkade&quot; &lt;kinkade@...&gt;","profile":"hsmomof4kiddies","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Look!  A NEW question :)","postDate":"1021040862","msgId":36958,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMzAwMWMxZjgyZSRkOTI0M2Y2MCRiMDhlYThjMEB3aW45ODAxPg==","referencesHeader":"PEI5MDEyQzgyLjg4RkYlZmV0dGVyb2xsQGVhcnRobGluay5uZXQ+"},"prevInTopic":36957,"nextInTopic":36975,"prevInTime":36957,"nextInTime":36959,"topicId":36946,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-292176287\">&lt;&lt;A lot of educators, I think, have a very idealized vision of what actually goes on in schools. They only see the programmed part of the environment: what information is provided and how it&#39;s structured. They don&#39;t see the teacher and kid factors. None of the great ideal programs work if the teacher is going through the motions and/or the kids would rather be doing something else.&gt;&gt;<br/>\n<br/>\nOk, this is my take on this...<br/>\n<br/>\nI have always thought that the ps system was failing our children. I remember when I was in ps and thinking it was a really stupid place to be, except for the friends I got to see every day. As for reading, I remember in 1st grade, we would split up in &quot;groups&quot; and we would read. We would take turns and read out loud. Then after we were done we would &quot;talk&quot; about the story we just read. The story was always so dumb.... Dick and Jane type. So discussions went something like... the teacher saying things about how Dick ran, Jane ran... yippee!!! Then when I got older, and I would see the worst student in the class, the one that always cut up, everyone knew he/she never got a good grade... they always proudly show off their F&#39;s. But amazingly the next year, they were in the next grade... how is that possible??? So, I figured, we didn&#39;t have to do anything to pass... and wasn&#39;t that the goal of the year? Get through this year, so we can be a number higher next year? humph<br/>\n<br/>\nWell, now I am seeing an interesting situation. Here, in Florida, I assume it is similar in all states. But they (ps head people?) are trying to &quot;improve&quot; schools. In particular, in Duval county they grade the schools, they earn a letter grade, just like the students. If a school gets a bad grade 2 years in a row, parents can request that their child be moved to a better grade school. The teachers are rewarded when their school gets a good grade. How are they graded? Well, they prepare these students all year to pass 1 test. That&#39;s the test the grade comes from... Well, my husband is working for the ps system this year. He is not a Certified Teacher nor is he working toward getting one. He is teaching a class called Computer Technology, he is basically teaching the kids what they need to know to pass their Microsoft Certification exams. He has 1 student in his class. This student has not wanted to be there from the beginning of the year. He hates my husband, because my husband thinks he should &quot;try&quot; his best. Last grading period, this student didn&#39;t show up in even 1 class, this would mean he didn&#39;t do 1 assignment, therefore, no grade. He was at school, my husband would see him. So, when it came time to turn in students grades, my husband gave him an F. Well, the day after report cards came out, this students mother was in my husbands office, yelling at him. She wants the grade changed. Apparently this student is supposed to be in my husbands room, but has &quot;independent study&quot;... Well, after alot of discussion with the mother, vice principle, school guidance counselor, and such... the decision was made to ask my husband to &quot;give&quot; this student a passing grade. He was told that this student has a 1.8 gpa, and he&#39;s a senior, been there for 4 years and has been trouble the whole time, so he needs to go. This is what the ps system is really about. They need his gpa to be better so they look better. If they have students fail, they look bad. It counts against the schools stats. Parents might choose to put their child in a different school. Which means the school will get less funding... they receive funding based on the number of students in the school. <br/>\n<br/>\nI guess, I don&#39;t hold much respect for the ps or teachers who claim that it is better. Any of them who claim it is, have either not been in the system long enough to know better, or are deceiving themselves. I know plenty of teachers, who tell me on a regular basis, that they respect me for my choice to homeschool my kids. Many of them know we are unschooling, and say the same things. They see what my kids are doing, and speak to my kids and they see that it works. My oldest daughter loves to read. She recently has fallen in love with CS Lewis, the Chronicles of Narnia. We had our teacher evaluation last week. The teacher looked over my portfolio, then talked with Ashley (my oldest daughter). They spoke about her books she&#39;s been reading. Ashley has quite a long list of books read this year. This teacher questioned whether she actually read them. So, she randomly asked her about them. Ashley told her about every one she was asked about clearly. (I was surprised, because I don&#39;t &quot;drill&quot; her about the books she reads) Then Ashley went on to tell her about CS Lewis, that he was homeschooled as well, and on and on. She told this teacher of other books he&#39;s written that she has yet to read. She knew where he was born, lots of information. All of which she learned on her own. After the discussion, the teacher asked me about it. She wanted to know if I &quot;require&quot; her to know about the authors. (She also read all of the Harry Potter books, and shared her knowledge of JK Rowling) I explained to her that I unschooled, and I require nothing of her. I told her that I simply provide what she wants to know as best as I can. Needless to say, our 1 hour evaluation, turned into nearly 3 hours of her wanting to know &quot;how I did it&quot;. She told me both of my girls are considerably above grade level. (In FL they have to be on grade level). At the end of the evaluation, she told me she wished she could teach her students the way I teach my girls. She has a son herself, and even suggested she may consider leaving her job, to stay home and unschool him. <br/>\n<br/>\nThe point of this is, unschooling works. I hope this brings some encouragement to you. I think that if you give your parents time, they will see that it works. I agree that giving them answers like were suggested may work. I have been known to give family similar answers. Then recently when I was questioned by a family member I told them of this story. Then I simply told them, that I would not want my child in a learning environment that puts so little value on the student as this. They (ps) don&#39;t care one little bit about our children. Children grow best in families... not institutions.<br/>\n<br/>\nRebecca<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Look!  A NEW question :)","postDate":"1021031490","msgId":36957,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI5MDEyQzgyLjg4RkYlZmV0dGVyb2xsQGVhcnRobGluay5uZXQ+","inReplyToHeader":"PEI5MDBCRDZFLkIwMiVhYnRsZW9AZWFydGhsaW5rLm5ldD4="},"prevInTopic":36956,"nextInTopic":36958,"prevInTime":36956,"nextInTime":36958,"topicId":36946,"numMessagesInTopic":0,"msgSnippet":"... In THEORY. In theory reading in school should be like a book club where everyone shares similar taste in books and meets once a week to discuss their","messageBody":"<div id=\"ygrps-yiv-1157396580\">on 5/10/02 12:59 AM, Alan & Brenda Leonard at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:abtleo@...\">abtleo@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My mother maintains that the discussion after the book is, in<br/>\n&gt; many ways, more important than the book itself.<br/>\n<br/>\n </span></blockquote>In THEORY. In theory reading in school should be like a book club where<br/>\neveryone shares similar taste in books and meets once a week to discuss<br/>\ntheir favorites. (And some libraries offer those. For older kids of course.<br/>\nMost 5 yos wouldn&#39;t be interested! And if they aren&#39;t interested to do it on<br/>\ntheir own, forcing it in school it&#39;s a sure fire way to ensure they don&#39;t<br/>\nlike reading.)<br/>\n<br/>\nIn PRACTICE it&#39;s nothing like that. And putting a child in school because<br/>\nschool *theoretically* could be a wonderful place to learn doesn&#39;t change<br/>\nthe fact that the vast majority of the time it&#39;s sitting through things you<br/>\nhave no interest in learning, or that are too hard, or too easy, or<br/>\nseemingly have no relevance to the real world. And that&#39;s discounting all<br/>\nthe time spent doing nonacademic things!<br/>\n<br/>\nI&#39;m trying hard, but I can&#39;t remember a single book or author I was<br/>\nintroduced to in school that later became a favorite or was even remembered<br/>\nfondly. There were stories or books I&#39;d read on my own that were reinforced<br/>\nin school (like having to read something else by the author.)<br/>\n<br/>\nNo, I remembered one. There was an excerpt from this really good translation<br/>\nof Beowulf in our English Lit text. I wish I&#39;d written the translator&#39;s name<br/>\ndown. Pretty sad commentary for 12 years.<br/>\n<br/>\nI will definitely never read Mill on the Floss by George Eliot. (I &quot;read&quot; it<br/>\nbut eradicated it from my memory other than it was about an old guy and a<br/>\nlittle girl and lots of meanness and sadness.) I even had a tough time<br/>\nwatching the Wishbone version of it.<br/>\n<br/>\nI *might* have picked up that Shakespeare anachronistically included clocks<br/>\nin Julius Caesar in school, but I&#39;m not entirely certain I didn&#39;t read that<br/>\nin Asimov&#39;s Guide to Shakespeare. The discussions were entirely about things<br/>\nI didn&#39;t care to ask questions about (either before or after the<br/>\ndiscussions) or about things that I eventually stumbled on on my own or<br/>\nreinforced things I&#39;d already picked up on my own.<br/>\n<br/>\nA lot of educators, I think, have a very idealized vision of what actually<br/>\ngoes on in schools. They only see the programmed part of the environment:<br/>\nwhat information is provided and how it&#39;s structured. They don&#39;t see the<br/>\nteacher and kid factors. None of the great ideal programs work if the<br/>\nteacher is going through the motions and/or the kids would rather be doing<br/>\nsomething else.<br/>\n<br/>\nAnd, yes, he will get things out of books all on his own. More importantly<br/>\nhe&#39;ll be getting the things that are meaningful to *him* not the things some<br/>\nexpert picked out that he&#39;s &quot;supposed&quot; to get out of them. Maybe he&#39;ll see<br/>\nsomething that captures his imagination in a bug illustration in a book<br/>\nthat&#39;s &quot;supposed&quot; to impart information about trees. The tree stuff may pass<br/>\nthrough, but the bug may make an important connection for him. But in school<br/>\n-- though in *theory* the teacher should allow the discussion to go wherever<br/>\nthe children are interested in taking it -- in practice the discussion would<br/>\nhave to stay focused on what the books was &quot;supposed&quot; to be about because<br/>\nthe teacher has specific things she must check off as having covered.<br/>\n<br/>\nCan you pass on articles and books about home and unschooling to them? Tell<br/>\nthem you&#39;d be happy to talk about your theories on how very different<br/>\nindividualized learning is from mass education after they&#39;ve done as much<br/>\nresearch on the subject as you have.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":55326806,"authorName":"rumpleteasermom","from":"&quot;rumpleteasermom&quot; &lt;rumpleteasermom@...&gt;","profile":"rumpleteasermom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Look!  A NEW question :)","postDate":"1021029505","msgId":36956,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGFiZ2FhMStnOWh1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEI5MDBCRDZFLkIwMiVhYnRsZW9AZWFydGhsaW5rLm5ldD4="},"prevInTopic":36954,"nextInTopic":36957,"prevInTime":36955,"nextInTime":36957,"topicId":36946,"numMessagesInTopic":0,"msgSnippet":"... problem with ... need some ... benefit ... it or ... related to ... almost 6 now. ... it!) ... I think the discussion is only important if the reader wants","messageBody":"<div id=\"ygrps-yiv-738086704\">--- In Unschooling-dotcom@y..., Alan & Brenda Leonard &lt;abtleo@e...&gt; <br/>\nwrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Am I missing something here?  I do realize that much of their <br/>\n </span></blockquote>problem with<br/>\n<blockquote><span title=\"ireply\"> &gt; homeschooling relates to problems with change.  But I guess I just <br/>\n </span></blockquote>need some<br/>\n<blockquote><span title=\"ireply\"> &gt; reassurance that I&#39;m doing the right thing by trusting my child to <br/>\n </span></blockquote>benefit<br/>\n<blockquote><span title=\"ireply\"> &gt; from the book, regardless of whether he sat in a class discussion on <br/>\n </span></blockquote>it or<br/>\n<blockquote><span title=\"ireply\"> &gt; we talked about it for a long time, or did follow-up activities <br/>\n </span></blockquote>related to<br/>\n<blockquote><span title=\"ireply\"> &gt; that book, or anything else!  BTW, the child in question is 5, <br/>\n </span></blockquote>almost 6 now.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; (somebody, please, say *something* good about unschooling; I need <br/>\n </span></blockquote>it!)<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; brenda<br/>\n<br/>\n </span></blockquote>I think the discussion is only important if the reader wants to <br/>\ndiscuss.  I remember sitting in my parochial school classrooms as a <br/>\nchild and wondering why the he!! we needed to go over what we just <br/>\nread out loud.  I was bored nearly to death by it.  When I was in <br/>\ncollege, that changed.  I had more to say and was more interested in <br/>\nthe various ways others interpreted the books.  OOOHHH and maybe that <br/>\nwas part of the problem in school, we weren&#39;t discussing various <br/>\ninterpretations, we were discussing the &quot;right&quot; one from the teacher&#39;s <br/>\nPOV.<br/>\n<br/>\nAs for getting stuff from books, my girls are 17 and 14. They read a <br/>\nLOT.  They know a lot of stuff that I can&#39;t even begin to tell you <br/>\nwhere they learned it except to say that it was probably in a book <br/>\nsomewhere!<br/>\n<br/>\nBridget</div>","specialLinks":[]},{"userId":9440128,"authorName":"ElissaJC@concentric.net","from":"&lt;ElissaJC@...&gt;","profile":"elissajc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Look!  A NEW question :)","postDate":"1021028136","msgId":36954,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwY2UwMWMxZjgxMSQzODY3MjFlMCQzNTJiMDM0MEBFbGlzc2FKQz4="},"prevInTopic":36951,"nextInTopic":36956,"prevInTime":36953,"nextInTime":36955,"topicId":36946,"numMessagesInTopic":0,"msgSnippet":"I won t join a book group because then I really have to read the book in order to prepare for the discussion afterwards. I have to analyze each characters","messageBody":"<div id=\"ygrps-yiv-1275010092\">I won&#39;t join a book group because then I really have to read the book in<br/>\norder to prepare for the discussion afterwards. I have to analyze each<br/>\ncharacters actions, Why did they say this? What reasons do the have for<br/>\ndoing that? I have to come up wioth a few profound statements so I don&#39;t<br/>\nappear unthinking.<br/>\nI can&#39;t just enjoy the book, knowing that later I&#39;ll be &quot;tested&quot;<br/>\nBook Clubs are just like those awful discussions in school, or even more<br/>\nlike an oral book report. Not fun.<br/>\nWhy would this be helpful to a young boy?<br/>\nPS.<br/>\nHe&#39;s FIVE!! lol<br/>\n~Elissa Cleaveland<br/>\n&quot;It is nothing short of a miracle that the modern methods of instruction<br/>\nhave<br/>\nnot yet entirely strangled the holy curiosity of inquiry.&quot; A. Einstein</div>","specialLinks":[]},{"userId":1798873,"authorName":"PSoroosh@aol.com","from":"PSoroosh@...","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Look!  A NEW question :)","postDate":"1021014040","msgId":36951,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0Yi5kYjEzZDE5LjJhMGNjYTE4QGFvbC5jb20+"},"prevInTopic":36950,"nextInTopic":36954,"prevInTime":36950,"nextInTime":36952,"topicId":36946,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/9/2002 11:25:33 PM Pacific Daylight Time, ... Or - just say, Yes, good point. Stop there. You don t have to say how you re going to use","messageBody":"<div id=\"ygrps-yiv-776968301\">In a message dated 5/9/2002 11:25:33 PM Pacific Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I said that lots of times when Kirby was little.  It shushed a lot of <br/>\n&gt; impending criticism.  &quot;If it doesn&#39;t work out, we&#39;ll put him in school.&quot;<br/>\n<br/>\n </span></blockquote>Or - just say, &quot;Yes, good point.&quot;<br/>\n<br/>\nStop there. You don&#39;t have to say how you&#39;re going to use her good point.<br/>\n<br/>\n--pamS<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":4257114,"authorName":"Cathy Hilde","from":"Cathy Hilde &lt;childe@...&gt;","profile":"mominlearning","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [Unschooling-dotcom] Look!  A NEW question :)","postDate":"1021012456","msgId":36950,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxQzFGN0IyLjE5OTdDMjYwLmhpbGRlZkBndGUubmV0Pg=="},"prevInTopic":36949,"nextInTopic":36951,"prevInTime":36949,"nextInTime":36951,"topicId":36946,"numMessagesInTopic":0,"msgSnippet":"Hi Brenda, You will undoubtedly get better information from the veteran folks on the list but I thought Id just throw out a thought of mine. This is our","messageBody":"<div id=\"ygrps-yiv-2049436838\">Hi Brenda,<br/>\nYou will undoubtedly get better information from the &quot;veteran&quot; folks on the <br/>\nlist but I thought Id just throw out a thought of mine.<br/>\nThis is our first year homeschooling. My daughter (7 years old) attended <br/>\nkindergarten last year. While I realize not all schools are the same, there <br/>\nwas nothing that even remotely resembled book discussion going on in those <br/>\nclassrooms. In fact in the four kindy classes at our school the teacher had <br/>\njust enough time to read one story a day to the children. Discussion was <br/>\nimpossible because they had to quickly move on to the next subject, project <br/>\nor hurry and line up for any number of activities that they were shuffled <br/>\nback and forth from each day. The children did spend more time reading on <br/>\ntheir own, but they were given these terribly boring basal, leveled reader <br/>\nbooks &quot;I see a crayon, I see a book, I see a desk........I see school&quot;. Not <br/>\nmuch here to discuss. I think teachers are so preoccupied with getting <br/>\neveryone up to a certain reading level they just can&#39;t afford the luxury of <br/>\nreading to the children for exposure or pleasure. My son went through <br/>\nsecond grade and the situation was somewhat similar except that teachers <br/>\ndid spend more time reading to the kids. But the book discussions were very <br/>\norchestrated and lead the children into an almost consensus. Not much <br/>\nindividual thought being considered. So, based on my experience your son is <br/>\nmissing NOTHING.<br/>\nI watch my daughter who can pick what ever she wants to read, can spend as <br/>\nmuch time as she likes in a book, can read it as many times as she likes. <br/>\nThen she toddles off and digests what interested her the most which usually <br/>\ntakes the form of acting out the story with her dolls or beanie babies. She <br/>\nrarely &quot;discusses&quot; a book with me. She apparently isn&#39;t interested in what <br/>\nI think and prefers her own opinion.<br/>\nHead down and one foot in front of the other!<br/>\nCathy<br/>\n<br/>\n----------<br/>\nFrom: \tAlan & Brenda Leonard[SMTP:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:abtleo@...\">abtleo@...</a>]<br/>\nReply To: \t<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a><br/>\nSent: \tThursday, May 09, 2002 9:59 PM<br/>\nTo: \t<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a><br/>\nSubject: \tRe: [Unschooling-dotcom] Look!  A NEW question :)<br/>\n<br/>\n&lt;&lt;File: ATT00009.htm&gt;&gt;</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Look!  A NEW question :)","postDate":"1021011864","msgId":36949,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NS5kYjZjOWM0LjJhMGNjMTk4QGFvbC5jb20+"},"prevInTopic":36948,"nextInTopic":36950,"prevInTime":36948,"nextInTime":36950,"topicId":36946,"numMessagesInTopic":0,"msgSnippet":"Oh--one more thing you can do, especially since your child is young. You can nod thoughtfully when they tell you things and say I ll keep that in mind for","messageBody":"<div id=\"ygrps-yiv-651488474\">Oh--one more thing you can do, especially since your child is young.<br/>\n<br/>\nYou can nod thoughtfully when they tell you things and say &quot;I&#39;ll keep that in <br/>\nmind for sure, and if this isn&#39;t working out, we can put him in school.&quot;<br/>\n<br/>\n<br/>\nWhat are the odds of it not working?  But you can reassure them truthfully <br/>\nthat if it does NOT work out, school&#39;s still right there, willing to take him.<br/>\n<br/>\nThat will calm them down and they won&#39;t be pressuring you moment to moment.<br/>\n<br/>\nI said that lots of times when Kirby was little.  It shushed a lot of <br/>\nimpending criticism.  &quot;If it doesn&#39;t work out, we&#39;ll put him in school.&quot;<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Look!  A NEW question :)","postDate":"1021011754","msgId":36948,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1MS5kYWY2OTIzLjJhMGNjMTJhQGFvbC5jb20+"},"prevInTopic":36947,"nextInTopic":36949,"prevInTime":36947,"nextInTime":36949,"topicId":36946,"numMessagesInTopic":0,"msgSnippet":"The few books we read in class as a group sometimes had insipid discussions afterwards.  Often the teacher would tell us a couple of actually-cool things.  But","messageBody":"<div id=\"ygrps-yiv-440061223\">The few books we read in class as a group sometimes had insipid discussions <br/>\nafterwards.  Often the teacher would tell us a couple of actually-cool <br/>\nthings.  But the books I read on my own outside, not for a book report, not <br/>\nfor an assignment, were MUCH more rewarding to me because I chose them, I had <br/>\nthe power to read them twice, skip through, put down and forget, and so those <br/>\nand only those I had read because I really just wanted to.   <br/>\n<br/>\nFrom the point of view of a teacher the discussions in a class are the best <br/>\npart.  From the point of view of someone who sees much to fault in the being <br/>\nin the class in the first place, there&#39;s no sense.<br/>\n<br/>\nIF you were in prison, there are things which would be the coolest thing of <br/>\nthe prison day.  But if you&#39;re not in a prison, none of that trivia matters.  <br/>\nIf you&#39;re sick in the hospital, something is going to seem relieving and <br/>\nsweet which would be a total sicko irritation if you were healthy and at home.<br/>\n<br/>\nBut from the point of view of prison wardens and hospital nurses, they see <br/>\nthose things as kindnesses and special moments.<br/>\n<br/>\nThat&#39;s my take on it.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":1798873,"authorName":"PSoroosh@aol.com","from":"PSoroosh@...","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Look!  A NEW question :)","postDate":"1021009188","msgId":36947,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIyLjI4NjdhYTY1LjJhMGNiNzI0QGFvbC5jb20+"},"prevInTopic":36946,"nextInTopic":36948,"prevInTime":36946,"nextInTime":36948,"topicId":36946,"numMessagesInTopic":0,"msgSnippet":"Brenda --- Let me just say that school DISCUSSION of really great books was very very very frequently enough to completely RUIN my enjoyment of those books.","messageBody":"<div id=\"ygrps-yiv-1351889198\">Brenda --- Let me just say that school DISCUSSION of really great books was <br/>\nvery very very frequently enough to completely RUIN my enjoyment of those <br/>\nbooks. She&#39;s wrong. Just wrong. <br/>\n<br/>\n--pam</div>","specialLinks":[]},{"userId":39764976,"authorName":"Alan & Brenda Leonard","from":"Alan & Brenda Leonard &lt;abtleo@...&gt;","profile":"abtleo","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Look!  A NEW question :)","postDate":"1021006776","msgId":36946,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI5MDBCRDZFLkIwMiVhYnRsZW9AZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PDEwMjA5ODQxNDEuMjQ3LjI4ODU3Lm0xMkB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":36947,"prevInTime":36945,"nextInTime":36947,"topicId":36946,"numMessagesInTopic":0,"msgSnippet":"I need some help.  I ve been visiting my parents who are only vaguely supportive of homeschooling.  Unfortunately, they each have almost 50 years of","messageBody":"<div id=\"ygrps-yiv-1956678377\">I need some help.  I&#39;ve been visiting my parents who are only vaguely<br/>\nsupportive of homeschooling.  Unfortunately, they each have almost 50 years<br/>\nof public/parochial school education experience, and my Dad has a PhD in Ed<br/>\nPsych, so even though *I* believe in unschooling, I often find myself on<br/>\nshakey ground when defending my beliefs.<br/>\n<br/>\nTheir latest commentary is on how much Tim misses from school, particularly<br/>\nin reading.  My mother maintains that the discussion after the book is, in<br/>\nmany ways, more important than the book itself.  Now, please don&#39;t think my<br/>\nson reads in a vacuum; we discuss books frequently.  I ask about books he&#39;s<br/>\nread recently, and he can usually say something coherant on them.  Sometimes<br/>\nthe conversation lasts 10 seconds, sometimes we&#39;re there for a lot longer.<br/>\n<br/>\nAm I missing something here?  I do realize that much of their problem with<br/>\nhomeschooling relates to problems with change.  But I guess I just need some<br/>\nreassurance that I&#39;m doing the right thing by trusting my child to benefit<br/>\nfrom the book, regardless of whether he sat in a class discussion on it or<br/>\nwe talked about it for a long time, or did follow-up activities related to<br/>\nthat book, or anything else!  BTW, the child in question is 5, almost 6 now.<br/>\n<br/>\n(somebody, please, say *something* good about unschooling; I need it!)<br/>\n<br/>\nbrenda</div>","specialLinks":[]}],"prevTopicId":36979,"nextTopicId":36971}}