{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":14,"messages":[{"userId":211346416,"authorName":"Jo Maslin","from":"Jo Maslin &lt;jo.maslin@...&gt;","profile":"jo_maslin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Trying to juggle two little one&#39;s needs","postDate":"1302294915","msgId":60562,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY1NDk2MkI4LTNEMkMtNDc2MC05RkVELTVDNkNDOERDRjQ4RUBnbWFpbC5jb20+","inReplyToHeader":"PDM4MzEyOS40NzYxOS5xbUB3ZWIxMTA0MTIubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PDM4MzEyOS40NzYxOS5xbUB3ZWIxMTA0MTIubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":60547,"nextInTopic":0,"prevInTime":60561,"nextInTime":60563,"topicId":60313,"numMessagesInTopic":0,"msgSnippet":"... hi i think this is spot on ... when our son Josh (who is now 8yrs old) was a baby we had the opportunity to be involved in a lot of therapies for him ... ","messageBody":"<div id=\"ygrps-yiv-764007581\">On 6/04/2011, at 12:09 PM, Jenny Cyphers wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Why rely on an expert in this arena?  He&#39;s just a baby, a little kid.  I get <br/>\n&gt; that your child is different and has different ways he uses his muscles and <br/>\n&gt; different ways in general.  I think there must be fun games that any parent can <br/>\n&gt; play with their babies that would help them develop in healthy ways.<br/>\n<br/>\n<br/>\n </span></blockquote>hi<br/>\ni think this is spot on ... when our son Josh (who is now 8yrs old) was a baby we had the opportunity to be involved in a lot of therapies for him ...<br/>\n<br/>\n(as a background Josh has CHARGE syndrome, his team of therapists, included physical, vision, hearing, a general person, speech and language, deaf/blind folk)<br/>\n<br/>\ni tried to treat each therapy session as an opportunity to learn something - for myself and for Josh ... if Josh was not enjoying it, we stopped...<br/>\n<br/>\nsome of the therapists were great, they added to our fun and learning ... for example, the vision person who visited us at our house - she came for Josh, but, their philosophy (the organisation she worked for), was one of inclusion - they recognised that the family is the child&#39;s base for their learning, they listened to us as parents, were interested in our family culture and looked for ways to include that in any suggestions they made for Josh ... she always had an interesting bag of toys that she had filled with both our children in mind ...<br/>\n<br/>\nhaving therapists visit and concentrate on just one of the family members was hard for Ben (our oldest child), so if the therapist wasn&#39;t as accommodating, I tried to have a special tv programme recorded, or an activity set up close by - so he could still see and hear what we were doing/talking about, but, kept him occupied also ... looking back, i could have done a better job of this part, i think if i had been able to find a suitable person to come and play with Ben at this time it would have been much easier for us both ...<br/>\n<br/>\nbecause Josh had multiple hospitalizations for operations mostly from birth up to about four years of age, we had an easy going relationship with all his &#39;team&#39; of people - i had their phone numbers, at this stage they were all mostly visiting us at home, and i was able to postpone, cancel and move appointments to suit us all ... usually for the reasons of recovery, but, if we had had a big week of procedures/appointments, and needed time for ourselves i would be able to change things around...<br/>\n<br/>\nonce i had meet the various people and questioned them about their philosophies, their thoughts on how children learned, their ideas about how to encourage children, i could get a measure on how helpful they would actually be for Josh ... <br/>\n<br/>\none thing that gave me the courage to let go of the thought &quot;what if he misses out on something&quot; was the realisation that *everything* that the therapists recommended we were already doing ... or had tried and didn&#39;t work for Josh ... we were already doing everything, because, nearly all the exercises were games and songs - things that were a natural part of our daily life ... <br/>\n<br/>\nwe were already doing them because Josh was a part of our family, we included his in our day to day activities as he was able... we had already started with his older brother, including him in the day to day living, including him as we could and when he wanted to, introducing fun things to do, providing toys and games... i saw no reason to change what we were doing ... the philosophy of &quot;children are able to learn best at their own pace in a stimulating learning environment&quot; got me through ... <br/>\n<br/>\nof course i needed to adapt things to Josh&#39;s abilities and interests ... when he was very young it was too uncomfortable for him, for us to carry him much - we would hold him, chat to him, cuddle him while he was asleep ... as he got older and was interested in watching his big brother make up train tracks on the floor i could either lay him close by, or prop him up with pillows, if he seemed keen to be busy himself i could lay him on his tummy with a towel under his chest and toys within reach ... i very rarely put toys out of his reach to encourage him to move towards them - that always seemed mean to me - he had a big brother - there were already lots of things he wanted to get into that his big bro wouldn&#39;t have appreciated! <br/>\n<br/>\nlooking back, i would have done some things differently ... the beauty of hind sight :-) ... if i could go back in time i would employ myself an extra pair of hands ... <br/>\n<br/>\nJo</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Trying to juggle two little one&#39;s needs","postDate":"1302120195","msgId":60547,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2NTlFNTU2LTEwOUQtNEM5Ri04OTIzLTkzRUQ3NzM2NDRCMEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDM4MzEyOS40NzYxOS5xbUB3ZWIxMTA0MTIubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PDM4MzEyOS40NzYxOS5xbUB3ZWIxMTA0MTIubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":60546,"nextInTopic":60562,"prevInTime":60546,"nextInTime":60548,"topicId":60313,"numMessagesInTopic":0,"msgSnippet":"-=-Giving a child a head start, is one of those common school phrases, but it refers to racing and competition. One of the coolest things about unschooling is","messageBody":"<div id=\"ygrps-yiv-1516406680\">-=-Giving a child a head start, is one of those common school phrases, but it <br/>\nrefers to racing and competition. One of the coolest things about unschooling <br/>\nis that you don&#39;t need to race and compete, your kids can go at whatever pace <br/>\nthey want to and learn on their own time schedule.-=-<br/>\n<br/>\nThat&#39;s the most important thing.  &quot;Early intevention&quot; is heavy on the &quot;intervention&quot;--in NOT letting nature take its course.   The purpose of early childhood therapy is so that a child can go to school.  He needs to be able to do certain things to be in a classroom, even a special education classroom, and THOSE are the things therapists have on their checklists.<br/>\n<br/>\nYou can have both children home and at peace, if you choose to go the unschooling route.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Trying to juggle two little one&#39;s needs","postDate":"1302116987","msgId":60546,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM4MzEyOS40NzYxOS5xbUB3ZWIxMTA0MTIubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":60542,"nextInTopic":60547,"prevInTime":60545,"nextInTime":60547,"topicId":60313,"numMessagesInTopic":0,"msgSnippet":"***And on an energetic level (forgive me- I m a yoga teacher) our breath represents even more- but I will not go there at this point. Speech delays are among","messageBody":"<div id=\"ygrps-yiv-642283086\">***And on an energetic level (forgive me- I&#39;m a yoga teacher) our breath <br/>\nrepresents even more- but I will not go there at this point. Speech delays are <br/>\namong the greatest challenges for kids with DS. I want Alex to have the <br/>\nopportunity to express himself with speech to the best of his ability. A strong <br/>\ncore and diaphragm will give him a great head start.***<br/>\n<br/>\nIf you are a yoga instructor, then you probably know a bit about the way muscle <br/>\ngroups work.  My own experience in dance has given me a lot of ideas about how <br/>\nto move, even in daily actions.  I&#39;ve helped both my kids out in a multitude of <br/>\nways when things are hurting or something is tweaked.  I did all kinds of baby <br/>\nexercises with my babies, just for fun, but they loved it and it helped them do <br/>\nthings they wanted to do.<br/>\n<br/>\nWhy rely on an expert in this arena?  He&#39;s just a baby, a little kid.  I get <br/>\nthat your child is different and has different ways he uses his muscles and <br/>\ndifferent ways in general.  I think there must be fun games that any parent can <br/>\nplay with their babies that would help them develop in healthy ways.<br/>\n<br/>\nGiving a child a head start, is one of those common school phrases, but it <br/>\nrefers to racing and competition.  One of the coolest things about unschooling <br/>\nis that you don&#39;t need to race and compete, your kids can go at whatever pace <br/>\nthey want to and learn on their own time schedule.<br/>\n<br/>\n***This is such a wonderfully plastic time in Alex&#39;s development (in all baby <br/>\ndevelopment).***<br/>\n<br/>\nI&#39;m just going to throw this  out there... plastic suggests molding.  I have a <br/>\nvery hard time with the idea of molding children.  On the other side note, the <br/>\nhuman brain is plastic, it&#39;s always changing.  It isn&#39;t just changeable and <br/>\ngrowing and learning only when we are babies and tiny, it just grows in <br/>\ndifferent bursts throughout our lifetime.  <br/>\n<br/>\n*** After Alex develops strong core  muscles, he can always CHOOSE to use <br/>\nmomentum and his extensors instead. But take it from a woman who has been <br/>\npregnant twice and had to swing herself off of too many low sofas and chairs <br/>\nreally awkwardly by using momentum and extensor muscles to compensate for lost <br/>\ncore strength: When given the option, this would be an unlikely choice. It&#39;s <br/>\njust HARDER. And it hurts.***<br/>\n<br/>\nYou had the option and chose to use momentum and extensors, even though it was <br/>\nhard and painful.  Why?  You don&#39;t need to answer.  Your baby uses whatever <br/>\nmuscles he uses.  Why would any baby naturally choose pain?   If it isn&#39;t <br/>\npainful and it works, why make him stop?  When he&#39;s older maybe he&#39;ll be <br/>\nconcerned about how he moves about, and maybe he won&#39;t.  Maybe he won&#39;t have any <br/>\nproblems moving.  Right now you can play with him and you don&#39;t need experts to <br/>\nplay with your baby.<br/>\n<br/>\n***I want my children to have choices.***<br/>\n<br/>\nHow many experts give you choices?  In my experience, experts give you choices <br/>\nwithin a tiny parameter.  They know for sure what is wrong and they know for <br/>\nsure how to fix it.  Sometimes it&#39;s right and sometimes the ideas are worth <br/>\nconsidering, but not always.<br/>\n<br/>\nTeachers are &quot;experts&quot; in education and I disagree with lots of what they say <br/>\nabout learning and children.<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Trying to juggle two little one&#39;s needs","postDate":"1301971987","msgId":60542,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM0RjE1QTNDLTVFQjktNDkzMS1BODA0LUZGMUFBMzZBQjc2MEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGluZHYwMSs5cmNkQGVHcm91cHMuY29tPg==","referencesHeader":"PGluZHYwMSs5cmNkQGVHcm91cHMuY29tPg=="},"prevInTopic":60540,"nextInTopic":60546,"prevInTime":60541,"nextInTime":60543,"topicId":60313,"numMessagesInTopic":0,"msgSnippet":"-=-Thanks for asking this Brian.-=- It was Alex, and she was asking an unschooling question, a rhetorical question really to lead you toward remembering that","messageBody":"<div id=\"ygrps-yiv-1221750053\">-=-Thanks for asking this Brian.-=-<br/>\n<br/>\nIt was Alex, and she was asking an unschooling question, a rhetorical question really to lead you toward remembering that the only important questions to ask on this list are about unschooling.<br/>\n<br/>\n-=- I always assume that people understand everything about DS- about the little nuances that are connected to that extra chromosome. -=-<br/>\n<br/>\nAlways?  Did you know everything about it before you had this child?<br/>\n<br/>\n<br/>\nYour response seemed to disregard what Alex Polikowsky wrote, so I&#39;ll quote it again.  It&#39;s really important.  This discussion needs to be about what helps unschooling work, and not about what justifies putting children in school or training them to crawl when they&#39;re too young to crawl even if they&#39;re strong, athletic kinds of kids.   (Alex is not a native English speaker.  I repaired a couple of spellings or typos.)<br/>\n<br/>\n-------------<br/>\n If you keep comparing Alex to a list of things he should be doing or if you <br/>\n<blockquote><span title=\"ireply\"> &gt; have an ideal of how he should be doing it it will make it hard to see your son <br/>\n&gt; and not someone you want him to be.<br/>\n&gt;  That goes for a child that has Down Syndrome or not.<br/>\n&gt; May of the things you may thing he needs NOW may be fine to wait until he is <br/>\n&gt; older or not do at all , like learning to crawl the &quot;right way&quot;.<br/>\n&gt; Not saying that help and therapy are bad. But don&#39;t lose sight of your child, it <br/>\n&gt; more important than who you want him to be.<br/>\n </span></blockquote>---------------------<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":298530064,"authorName":"rngillies","from":"&quot;rngillies&quot; &lt;rngillies@...&gt;","profile":"rngillies","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Trying to juggle two little one&#39;s needs","postDate":"1301970753","msgId":60540,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGluZHYwMSs5cmNkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDg2MDUuMTAzMTQucW1Ad2ViODE1MDgubWFpbC5tdWQueWFob28uY29tPg=="},"prevInTopic":60527,"nextInTopic":60542,"prevInTime":60538,"nextInTime":60541,"topicId":60313,"numMessagesInTopic":0,"msgSnippet":"Thanks for asking this Brian. I always assume that people understand everything about DS- about the little nuances that are connected to that extra chromosome.","messageBody":"<div id=\"ygrps-yiv-909651916\">Thanks for asking this Brian. I always assume that people understand everything about DS- about the little nuances that are connected to that extra chromosome. <br/>\n<br/>\nWithout help, Alex will learn to crawl, walk, sit, and stand etc. by using a combination of momentum and extensor strength to compensate for (and thereby, increasingly exacerbating) core weakness. <br/>\n<br/>\nIf he didn&#39;t have DS, would I care? That depends: If he didn&#39;t have DS, BUT he had low tone, YES, I&#39;d care.<br/>\n<br/>\nHere&#39;s why.<br/>\n<br/>\nAll babies are born with very strong extensor muscles (these are the muscles that run down the back of the body, along the spine, the buttocks, and the backs of the legs, to put it very generally).  This strong extension is what is responsible for the gradual stretching out of our baby&#39;s bodies from fetal position.  The fetal position keeps the front of a baby&#39;s body (the flexor/core muscles- generally) very tight and short.  Eventually, the sweet &quot;froggy&quot; position of a newborn gives way to stretched out legs and arms as the extensors begin to balance out the resistance of the flexors.<br/>\n<br/>\nIn the case of a baby with low tone, The flexor muscles (commonly referred to as &quot;core strength&quot; muscles) are flaccid.  So they do not provide resistance to the very strong extensor muscles. These babies are never in that little froggy position, even immediately after birth. They are a bit floppy, usually very loose in the ligaments giving them extreme range of motion at their joints (which means joint instability), and they tend to have an extreme &quot;arching&quot; posture whenever they actively engage any muscles. Babies with low tone may roll very early. But they do it by arching so strongly that their heels and the tops of their heads are the only thing on the floor until they topple over to their bellies (As opposed to a baby with typical tone who will tuck knees in, contract abs, roll, and pull arms out from under their own body weight). <br/>\n<br/>\n <br/>\nCore strength keeps our organs aligned within our bodies- helps to prevent hernia, incontinence, and a variety of digestive problems. It keeps our spines aligned preventing disc problems and nerve impingement. It supports our diaphragm optimally which enhances breathing and makes speech possible.  Pneumonia is very common in  children with DS because the low town makes for weak coughing, shallow breathing, and fluid accumulation in the lungs which sets the stage for infection. And on an energetic level (forgive me- I&#39;m a yoga teacher) our breath represents even more- but I will not go there at this point.  Speech delays are among the greatest challenges for kids with DS. I want Alex to have the opportunity to express himself with speech to the best of his ability. A strong core and diaphragm will give him a great head start.<br/>\n<br/>\nI don&#39;t care how long it takes Alex to stand or walk or run or ride a bike. I&#39;m not in a hurry with my own growth and development, and I&#39;m definitely not in a hurry to see my kids do anything. They do it all in their time. I just love to watch it all unfold.  <br/>\n<br/>\nBut I DO feel like it&#39;s my job to empower them with resources in response to their emerging interests. Especially when they are young (in Alex&#39;s case, pre-verbal) and otherwise powerless to obtain all of the resources available to them. My older has always LOVED animals and dinosaurs. His first signs and his first words were all of the animals. We live near one of the most amazing Natural History Museums in the world.  I didn&#39;t wait until he was old enough to know that such a place existed. I took him there when he was 2. Now that he KNOWS about it- now that he has the option, he tells me when he wants to go back. And he generally wants to go back multiple times per week. He&#39;s only 3.5. If I hadn&#39;t responded to his expressed interest in animals by showing him this world of the museum, he would have had one less option.<br/>\n<br/>\n This is such a wonderfully plastic time in Alex&#39;s development (in all baby development). Right now he WANTS to move. He shows me that he WANTS to move from the living room to the kitchen by himself, climb over bean bags, and up on the mattress etc. So I am simply responding by saying, &quot;hey, look at THIS option.&quot; I am helping him lay down motor planning patterns that he will not develop otherwise. This opens up a whole new set of options for him.  A child who does not have low tone WILL, in most cases, develop optimal motor planning patterns whether or not they ever crawl and regardless of how long it takes them to walk. It&#39;s important for me to remind myself of that because I don&#39;t THINK of Alex as &quot;DS.&quot; He&#39;s Alex. Most of the time I have to REMIND myself that he IS different. Having and extra chromosome is NO small wonder. So he&#39;s different. And he deserves all the same opportunities.<br/>\n<br/>\nIt&#39;s about choice.<br/>\n<br/>\nI want my children to have choices. <br/>\n<br/>\nHe is going to crawl with or without my help. But as long as he&#39;s having fun crawling, and I&#39;m on the floor playing with him, what&#39;s the harm in me gently placing a single index finger with under his left hip flexor to help him form optimal motor patterns when I see him picking up a habit of using his extensor on one leg? <br/>\n<br/>\nAfter Alex develops strong core muscles, he can always CHOOSE to use momentum and his extensors instead. But take it from a woman who has been pregnant twice and had to swing herself off of too many low sofas and chairs really awkwardly by using momentum and extensor muscles to compensate for lost core strength: When given the option, this would be an unlikely choice. It&#39;s just HARDER. And it hurts.<br/>\n<br/>\nSo, my ideal for my children is not &quot;should or shouldn&#39;t&quot; or &quot;right or wrong.&quot;  It&#39;s about choice. Down Syndrome or not.  :)<br/>\n<br/>\nHope this clarifies a bit.<br/>\n<br/>\nSincerely,<br/>\nRobin Gillies<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Why is it so important that Alex crawls the right way or uses the right muscles?<br/>\n&gt; Would you be helping him crawl the &quot;right way&quot; if he did not have Down Syndrome?<br/>\n&gt; <br/>\n&gt; My son did not sit unatended until he was 8 months old and he never crawled. <br/>\n&gt; He was not able too.<br/>\n&gt; He did a little, very little army crawl. At 9 and a half months he was alking. <br/>\n&gt; At 10 and a half he was running. <br/>\n&gt; <br/>\n&gt; He really walked well at 9 and a half months but did not know how to sit back <br/>\n&gt; from walking so he walked into things to hold himself from falling.<br/>\n&gt; At 8 years old he still cannot ride a bike, even with training wheels is not <br/>\n&gt; easy for him.<br/>\n&gt; But he is a great basketball player and he plays better than most kids way older <br/>\n&gt; than him. <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; My niece did not walk until she was 18 months old. Today she is a fast runner in <br/>\n&gt; track on her High School.<br/>\n&gt; <br/>\n&gt;  If you keep comparing Alex to a list of things he should be doing or if you <br/>\n&gt; have an ideal of how he should be doing it it will make it hard to see your son <br/>\n&gt; and not someone you want him to be.<br/>\n&gt;  That goes for a child that has Down Syndrome or not.<br/>\n&gt; May of the things you may thing he needs NOW maybe fine to wait until he is <br/>\n&gt; older or not do at all , like learning to crawl the &quot;right way&quot;.<br/>\n&gt; Not saying that help and therapy are bad. But don&#39;t loose sigh of your child, it <br/>\n&gt; more important than who you want him to be.<br/>\n&gt; <br/>\n&gt; I have remember reading many years ago about a mother who did have a child with <br/>\n&gt; Down Syndrome that unschooled. I hope someone remembers where or who.<br/>\n&gt;  <br/>\n&gt; Alex Polikowsky<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Trying to juggle two little one&#39;s needs","postDate":"1301775387","msgId":60527,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg2MDUuMTAzMTQucW1Ad2ViODE1MDgubWFpbC5tdWQueWFob28uY29tPg==","inReplyToHeader":"PGluNzhvdCtsMXJpQGVHcm91cHMuY29tPg==","referencesHeader":"PGluNzhvdCtsMXJpQGVHcm91cHMuY29tPg=="},"prevInTopic":60522,"nextInTopic":60540,"prevInTime":60526,"nextInTime":60528,"topicId":60313,"numMessagesInTopic":0,"msgSnippet":"Why is it so important that Alex crawls the right way or uses the right muscles? Would you be helping him crawl the right way if he did not have Down","messageBody":"<div id=\"ygrps-yiv-1399099785\">Why is it so important that Alex crawls the right way or uses the right muscles?<br/>\nWould you be helping him crawl the &quot;right way&quot; if he did not have Down Syndrome?<br/>\n<br/>\nMy son did not sit unatended until he was 8 months old and he never crawled. <br/>\nHe was not able too.<br/>\nHe did a little, very little army crawl. At 9 and a half months he was alking. <br/>\nAt 10 and a half he was running. <br/>\n<br/>\nHe really walked well at 9 and a half months but did not know how to sit back <br/>\nfrom walking so he walked into things to hold himself from falling.<br/>\nAt 8 years old he still cannot ride a bike, even with training wheels is not <br/>\neasy for him.<br/>\nBut he is a great basketball player and he plays better than most kids way older <br/>\nthan him. <br/>\n<br/>\n<br/>\nMy niece did not walk until she was 18 months old. Today she is a fast runner in <br/>\ntrack on her High School.<br/>\n<br/>\n If you keep comparing Alex to a list of things he should be doing or if you <br/>\nhave an ideal of how he should be doing it it will make it hard to see your son <br/>\nand not someone you want him to be.<br/>\n That goes for a child that has Down Syndrome or not.<br/>\nMay of the things you may thing he needs NOW maybe fine to wait until he is <br/>\nolder or not do at all , like learning to crawl the &quot;right way&quot;.<br/>\nNot saying that help and therapy are bad. But don&#39;t loose sigh of your child, it <br/>\nmore important than who you want him to be.<br/>\n<br/>\nI have remember reading many years ago about a mother who did have a child with <br/>\nDown Syndrome that unschooled. I hope someone remembers where or who.<br/>\n <br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":298530064,"authorName":"rngillies","from":"&quot;rngillies&quot; &lt;rngillies@...&gt;","profile":"rngillies","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Trying to juggle two little one&#39;s needs","postDate":"1301751389","msgId":60522,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGluNzhvdCtsMXJpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGltYWZwbitnMzAxQGVHcm91cHMuY29tPg=="},"prevInTopic":60372,"nextInTopic":60527,"prevInTime":60521,"nextInTime":60523,"topicId":60313,"numMessagesInTopic":0,"msgSnippet":"I want to thank all for the generous and thoughtful replies. I have been enjoying a very slow digestion of the information and insight. Interestingly enough, I","messageBody":"<div id=\"ygrps-yiv-636565014\">I want to thank all for the generous and thoughtful replies. I have been enjoying a very slow digestion of the information and insight. Interestingly enough, I had already discussed with my husband my instinct that we needed to cut back on EI appointments. I hit a brick wall and backed down pretty quickly. But everyone&#39;s replies here actually validated my instinct. <br/>\n<br/>\nI believe in &quot;all things in moderation.&quot;  I would have been lost without all of our therapists. They teach me so much and I have become confident in my ability to carry over all of the exercises and play.  But the fact is, more appointments mean less space for play. Less space for creative integration. So, I do not feel ready to let go of our speech therapist (who is actually enormously important to Alex even at his young age) or our OT or our PT. But two appointments with each person every week IS excessive. Our special instructor is beloved by us, but I have been doubting the importance of her in our regimen. It has been explained to me that a Special Instructor teaches parents how to play with their special needs babies.  She has conceded that our family needs no such help and that she is there to just build a relationship with Alex so that when he is in school (always the assumption) they will have a trust based relationship as she helps him with is &quot;work.&quot;  So, you can see why I want to let her go.<br/>\n<br/>\nMy husband and I are working through this.  He is afraid. I know that. He seems defensive if I suggest it.  But where I was not even slightly phased by my son&#39;s down syndrome diagnosis, I think my husband took a bit of a hit. He has a lot of fear about his children being bullied, made fun of, made to feel &quot;other&quot; as they grow up. I guess I just feel like any person can be made to feel this way (my husband certainly did)- it doesn&#39;t mean you have to have a genetic difference to invite cruelty. And of course, I think cruelty and bullying is particularly present in our schools.<br/>\n<br/>\nI just want my children to know what they want. I want them to enjoy the process of going after what they want, no matter how big or how small.  Right now, Alex wants to knock down block towers. So I build them for him on the far side of the room and watch him commando crawl to get there. He grunts from the effort. And he spills over in to the most infectious laughter when the blocks fall down. Our PT taught me how to help Alex crawl optimally. (All kids with DS will crawl/walk, but because of low tone they will do so by recruiting less optimal muscle groups). But beyond learning to crawl, Alex has an amazing sense of humor, he is a total flirt- seeking eye contact with the ladies on the subway and flashing his ridiculously delicious smile. He smacks me in the mouth when I&#39;m talking to a friend and ignoring him, as if to say, &quot;Hey, i&#39;m here- include me!&quot; He is social, connected, engaged, and eager.  And that is, in my not-so-humble opinion, due to the fact that he has been so lovingly nursed, carried in his carrier, included in every aspect of our lives from the most mundane to the most exciting. He is talked to, sung to, played with. He is our son. The DS isn&#39;t a part of the picture- until it&#39;s time for therapy. Then, suddenly, I think, &quot;oh yes, alex has DS, we need to do PT now.&quot;  <br/>\n <br/>\n<br/>\n I believe that the appropriate number of services will help Alex in the most neurologically flexible time of his childhood so that he will have even more tools to go after what he wants. But at the expense of his joy- or his mother&#39;s joy? Not okay.  And so many services that we are always thinking, &quot;alex has DS- he needs....&quot;<br/>\nThat&#39;s not helpful either. I don&#39;t ever feel like I&#39;m raising a child with a &quot;disability.&quot; (I REALLY LOATHE THAT WORD).  I feel like I&quot;m raising a child. And that I have all these amazing free resources available to us.  And I don&#39;t want to be too rigid in rejecting the advantages of EI. And I don&#39;t want to be a slave to the services either.<br/>\n<br/>\nSo I need to find  balance.  <br/>\n<br/>\nI have also been employing childcare or my older son ever since becoming pregnant with Alex. We have fun college or graduate students who play with him. But it isn&#39;t the same. He still wants ME. And I want HIM.  And I want to not have to tell him to &quot;wait&quot; a million times per day. And I want him to have regular exposure to other children as he as expressed time after time that he desires this. It&#39;s not so easy at 3.5 in a city (NYC) where many have their kids in school at 2.5/3 years old. And of course, he wants to be around older kids who are mostly in school too.  <br/>\n<br/>\nNext fall at the age of 4 he will be more able to participate in our local unschooling/homeschooling community events. And our lighter EI schedule should help too. <br/>\n<br/>\nI now feel very confident that I am doing the entire family a big service by taking away some appointments. I have told my husband that if he wants to pick up the other appointments, he can find a way to work his schedule around Alex&#39;s schedule and our therapists&#39; schedules.  This seems to hit home as he gets a tiny taste of the logistical nightmare that is so joy sucking. <br/>\n<br/>\nThis list is fantastic. I am so grateful for the smart and sensitive replies which have helped to bolster my confidence in my instincts. Before all of your replies, I had just felt overcome with the feeling that I am simply an inadequate mother who was failing to organize and schedule intelligently.  I have no connection with any other parent who has a child with DS who plans to unschool. There are a lot of homeschoolers, but it&#39;s obviously not the same. <br/>\n<br/>\nI am eager to have this space to come to for support and inspiration.<br/>\n<br/>\nSincerely,<br/>\nRobin<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;aldq75&quot; &lt;aldq75@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; This is one of my favorite articles on unschooling and special needs:<br/>\n&gt; <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.livingjoyfully.ca/anneo/I_Am_What_I_Am.htm\">http://www.livingjoyfully.ca/anneo/I_Am_What_I_Am.htm</a><br/>\n&gt; <br/>\n&gt; I Am What I Am by Anne Ohman<br/>\n&gt; <br/>\n&gt; From the article: &quot;Special needs?  Sure ~ every human being has the special need to be exactly who they are and to be honored and celebrated for that.&quot;<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Andrea Q<br/>\n&gt; <br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@&gt; wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt; -=-I have since approached my son&#39;s needs in a similar manner, and he is blossoming.  He doesn&#39;t need OT because he gets plenty of appropriate stimulation, and I am able to cater to his environmental and physical needs.  It is looking like he would benefit from some play therapy, as he&#39;s currently dealing with dangerously strong emotions, and we will get that for him because I can see both my own limitations in helping him with that issue, and the benefit of the proposed therapy.-=-<br/>\n&gt; &gt; <br/>\n&gt; &gt; That whole post was so great I&#39;m saving it here, with a link back to this discussion:<br/>\n&gt; &gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/special\">http://sandradodd.com/special</a><br/>\n&gt; &gt; <br/>\n&gt; &gt; I hope the little boy&#39;s brother gets to come back home right away!<br/>\n&gt; &gt; <br/>\n&gt; &gt; <br/>\n&gt; &gt; Sandra<br/>\n&gt; &gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":187853867,"authorName":"aldq75","from":"&quot;aldq75&quot; &lt;aldq75@...&gt;","profile":"aldq75","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Trying to juggle two little one&#39;s needs","postDate":"1300808311","msgId":60372,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGltYWZwbitnMzAxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDU3MTBGRkUwLTdDNjgtNEFERC04MDRBLTlBNzdFRDNGNjE5NkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":60368,"nextInTopic":60522,"prevInTime":60371,"nextInTime":60373,"topicId":60313,"numMessagesInTopic":0,"msgSnippet":"This is one of my favorite articles on unschooling and special needs: http://www.livingjoyfully.ca/anneo/I_Am_What_I_Am.htm I Am What I Am by Anne Ohman From","messageBody":"<div id=\"ygrps-yiv-260592693\">This is one of my favorite articles on unschooling and special needs:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.livingjoyfully.ca/anneo/I_Am_What_I_Am.htm\">http://www.livingjoyfully.ca/anneo/I_Am_What_I_Am.htm</a><br/>\n<br/>\nI Am What I Am by Anne Ohman<br/>\n<br/>\nFrom the article: &quot;Special needs?  Sure ~ every human being has the special need to be exactly who they are and to be honored and celebrated for that.&quot;<br/>\n<br/>\n<br/>\nAndrea Q<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; -=-I have since approached my son&#39;s needs in a similar manner, and he is blossoming.  He doesn&#39;t need OT because he gets plenty of appropriate stimulation, and I am able to cater to his environmental and physical needs.  It is looking like he would benefit from some play therapy, as he&#39;s currently dealing with dangerously strong emotions, and we will get that for him because I can see both my own limitations in helping him with that issue, and the benefit of the proposed therapy.-=-<br/>\n&gt; <br/>\n&gt; That whole post was so great I&#39;m saving it here, with a link back to this discussion:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/special\">http://sandradodd.com/special</a><br/>\n&gt; <br/>\n&gt; I hope the little boy&#39;s brother gets to come back home right away!<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Trying to juggle two little one&#39;s needs","postDate":"1300807149","msgId":60368,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU3MTBGRkUwLTdDNjgtNEFERC04MDRBLTlBNzdFRDNGNjE5NkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDEwNjA5MTU4MzYtMTMwMDc3MDQ0NC1jYXJkaHVfZGVjb21ib2J1bGF0b3JfYmxhY2tiZXJyeS5yaW0ubmV0LTIwNzMyOTUwMzAtQGJkYTI5NDAuYmlzeC5wcm9kLm9uLmJsYWNrYmVycnk+","referencesHeader":"PDEwNjA5MTU4MzYtMTMwMDc3MDQ0NC1jYXJkaHVfZGVjb21ib2J1bGF0b3JfYmxhY2tiZXJyeS5yaW0ubmV0LTIwNzMyOTUwMzAtQGJkYTI5NDAuYmlzeC5wcm9kLm9uLmJsYWNrYmVycnk+"},"prevInTopic":60362,"nextInTopic":60372,"prevInTime":60367,"nextInTime":60369,"topicId":60313,"numMessagesInTopic":0,"msgSnippet":"-=-I have since approached my son s needs in a similar manner, and he is blossoming.  He doesn t need OT because he gets plenty of appropriate stimulation, and","messageBody":"<div id=\"ygrps-yiv-316455213\">-=-I have since approached my son&#39;s needs in a similar manner, and he is blossoming.  He doesn&#39;t need OT because he gets plenty of appropriate stimulation, and I am able to cater to his environmental and physical needs.  It is looking like he would benefit from some play therapy, as he&#39;s currently dealing with dangerously strong emotions, and we will get that for him because I can see both my own limitations in helping him with that issue, and the benefit of the proposed therapy.-=-<br/>\n<br/>\nThat whole post was so great I&#39;m saving it here, with a link back to this discussion:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/special\">http://sandradodd.com/special</a><br/>\n<br/>\nI hope the little boy&#39;s brother gets to come back home right away!<br/>\n<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":351892713,"authorName":"akgreeley@gmail.com","from":"akgreeley@...","profile":"miranda68","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Trying to juggle two little one&#39;s needs","postDate":"1300770442","msgId":60362,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEwNjA5MTU4MzYtMTMwMDc3MDQ0NC1jYXJkaHVfZGVjb21ib2J1bGF0b3JfYmxhY2tiZXJyeS5yaW0ubmV0LTIwNzMyOTUwMzAtQGJkYTI5NDAuYmlzeC5wcm9kLm9uLmJsYWNrYmVycnk+"},"prevInTopic":60321,"nextInTopic":60368,"prevInTime":60361,"nextInTime":60363,"topicId":60313,"numMessagesInTopic":0,"msgSnippet":"I have a son who would certainly be labeled with disabilities if he were in school.  I am familiar with the early intervention path, and how it can make every","messageBody":"<div id=\"ygrps-yiv-829697237\">I have a son who would certainly be labeled with disabilities if he were in school.  I am familiar with the early intervention path, and how it can make every suggestion seem mandatory.  \r<br/>\n\r<br/>\nOne of the reasons I quit the path of cookie-cutter help was because I got to watch my (unschooler) friend&#39;s son, a boy much like my own, blossom in her care.  With every difficulty or difference he presented, whether it was speech differences, sensory difficulties, or behavior issues, she arranged life to fit his needs.  She also approached all this with a solid faith in him that he was the way he was supposed to be, and that he was on his own schedule.  She sought appropriate help when needed, but it was out of a &quot;what are his true needs&quot; space.\r<br/>\n\r<br/>\nI have since approached my son&#39;s needs in a similar manner, and he is blossoming.  He doesn&#39;t need OT because he gets plenty of appropriate stimulation, and I am able to cater to his environmental and physical needs.  It is looking like he would benefit from some play therapy, as he&#39;s currently dealing with dangerously strong emotions, and we will get that for him because I can see both my own limitations in helping him with that issue, and the benefit of the proposed therapy.\r<br/>\n\r<br/>\nMy son requires huge amounts of my attention and time, and I struggle with how this takes away from my other two children.  Had we come to unschooling earlier, I might know better how to balance my time.  As it is, I&#39;m getting better and I&#39;m seeing all my children thrive.\r<br/>\n\r<br/>\nIn your shoes, I might ask myself if all of the therapies are truly necessary.  They are designed as preludes to schooling, and they may not all apply.  Even if they do, is there a less invasive schedule you could take?  When the help you&#39;re getting takes away so drastically from the rest of your life, maybe it&#39;s not really a help.\r<br/>\n\r<br/>\nIf you didn&#39;t know these therapies &quot;had&quot; to be used, what help would you need for your child, right now?  What wouldn&#39;t you need?\r<br/>\nSent on the Sprint® Now Network from my BlackBerry®</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Trying to juggle two little one&#39;s needs","postDate":"1300711201","msgId":60321,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkwRURBNTI1LTlDMUItNDg1NC1CQUJFLUZFNjBGNTkwRTk2MEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGltNm1vYSt1bWVlQGVHcm91cHMuY29tPg==","referencesHeader":"PGltNm1vYSt1bWVlQGVHcm91cHMuY29tPg=="},"prevInTopic":60317,"nextInTopic":60362,"prevInTime":60320,"nextInTime":60322,"topicId":60313,"numMessagesInTopic":0,"msgSnippet":"-=-You could find a parttime or fulltime helper, maybe one who specializes in the care of special-needs kids -- someone who can go along with you all to the","messageBody":"<div id=\"ygrps-yiv-1636480366\">-=-You could find a parttime or fulltime helper, maybe one who specializes in the care of special-needs kids -- someone who can go along with you all to the park and on other outings so that you&#39;re able to offer more away-from-home fun to Jackson and more opportunities for him to be around other kids.-=-<br/>\n<br/>\nIf you&#39;re in a university town, you might be able to find people who are studying special ed or psychology/child development who might want to come and hang out with you a time or two a week, to get to be with the baby.  They could also learn about unschooling while they&#39;re there.   <br/>\n<br/>\nIt does sound like way too much special education for a child who is and could be just at home and happy.  Until he gets too old to carry around, it seems that there could be no batter place for him than in his parents&#39; arms.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":67727291,"authorName":"wtexans","from":"&quot;wtexans&quot; &lt;wtexans@...&gt;","profile":"wtexans","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Trying to juggle two little one&#39;s needs","postDate":"1300684362","msgId":60317,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGltNm1vYSt1bWVlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGltNmExYSs3cWUxQGVHcm91cHMuY29tPg=="},"prevInTopic":60315,"nextInTopic":60321,"prevInTime":60316,"nextInTime":60318,"topicId":60313,"numMessagesInTopic":0,"msgSnippet":"===And Alex s needs, especially in these early years, are wonderfully deep.  But so are Jackson s. And I don t see how I can meet them all simultaneously.=== ","messageBody":"<div id=\"ygrps-yiv-2031151010\">===And Alex&#39;s needs, especially in these early years, are wonderfully deep.  But so are Jackson&#39;s. And I don&#39;t see how I can meet them all simultaneously.===<br/>\n<br/>\nWhat about bringing someone in who can take care of Alex for some period of time daily or several times a week so you can give Jackson your full attention at those times?<br/>\n<br/>\nMaybe you could arrange for an older kiddo to come to your house and play with Jackson during some of Alex&#39;s therapies, so that Jackson has something to look forward to during those times.<br/>\n<br/>\n<br/>\n===PT, OT, Speech Therapist, and Special Instructor===<br/>\n<br/>\nPerhaps one or more of these can be eliminated for some period of time so there&#39;s more flexibility for spontaneity in your days.<br/>\n<br/>\nWhat does a &quot;special instructor&quot; do?<br/>\n<br/>\nFor a 14-month old, is speech therapy something that really has to happen at that age? <br/>\n<br/>\nI&#39;m hoping someone who unschools a child with Down&#39;s Syndrome will offer some feedback about how deschooling comes into play for parents with special-needs kiddos, because physical therapy, occupational therapy, speech therapy, and special instruction for a 14-month old seem like a lot of &quot;should do&#39;s&quot;.  <br/>\n<br/>\n<br/>\n=== I tell myself that this is temporary. But I don&#39;t know. All I know is that I do not want to send EITHER children to school.===<br/>\n<br/>\nThis ties in with something I said up above -- rather than taking Jackson somewhere to be with other kids part of each weekday, how about taking the money you&#39;d spend on nursery school and use it to bring the help to you? <br/>\n<br/>\nYou could find a parttime or fulltime helper, maybe one who specializes in the care of special-needs kids -- someone who can go along with you all to the park and on other outings so that you&#39;re able to offer more away-from-home fun to Jackson and more opportunities for him to be around other kids.<br/>\n<br/>\nTry shifting to an unschooling perspective: &quot;What can I do so that *fun and fulfilling* are happening at home?&quot;. (By &quot;at home&quot;, I&#39;m including doing things with mom / with parents away from home, too.) Is that something you can make happen? (a question for yourself, not to be answered on-list).<br/>\n<br/>\nGlenda</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Trying to juggle two little one&#39;s needs","postDate":"1300680249","msgId":60315,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYzNTc1Mi4yMjY0NC5xbUB3ZWI4MTUwMi5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PGltNmExYSs3cWUxQGVHcm91cHMuY29tPg==","referencesHeader":"PGltNmExYSs3cWUxQGVHcm91cHMuY29tPg=="},"prevInTopic":60313,"nextInTopic":60317,"prevInTime":60314,"nextInTime":60316,"topicId":60313,"numMessagesInTopic":0,"msgSnippet":"Robin, I do not have a child with Down Syndrome. I have however a cousin that has Down Syndrome and I have worked with Special Olympics in the past. I am","messageBody":"<div id=\"ygrps-yiv-435300837\">Robin,<br/>\nI do not have a child with Down Syndrome. I have however a cousin that has Down <br/>\nSyndrome and I have worked <br/>\n<br/>\nwith Special Olympics in the past.<br/>\nI am aware that the severity of the physical and mental disability  can vary  <br/>\nfrom light to severe ( heart deffects ).<br/>\nI have to ask you. <br/>\nDoes your son Alex really need all this early intervention ? <br/>\n Does he really need a schedule that is to strict??<br/>\n My cousin  never had such a strict and intense early intervention.<br/>\nHe  is about 40 now and works, has a girlfriend, snowboards, surfs, has worked <br/>\nas an actor , is  online chating with us ( he lives in Brazil )and<br/>\nis simply and amazing joyful  person.<br/>\n<br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":298530064,"authorName":"rngillies","from":"&quot;rngillies&quot; &lt;rngillies@...&gt;","profile":"rngillies","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Trying to juggle two little one&#39;s needs","postDate":"1300671338","msgId":60313,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGltNmExYSs3cWUxQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":60315,"prevInTime":60312,"nextInTime":60314,"topicId":60313,"numMessagesInTopic":0,"msgSnippet":"This is my first time posting- so apologies in advance if I m getting it all wrong. I don t recall how I came upon the concept of unschooling, but before my","messageBody":"<div id=\"ygrps-yiv-1933877698\">This is my first time posting- so apologies in advance if I&#39;m getting it all wrong. <br/>\n<br/>\nI don&#39;t recall how I came upon the concept of unschooling, but before my first son (now 3.5) was 6 months old I had read John Holt and it just made sense. I just knew my children would never be educated as I was unless they actually asked to go to school. My husband had just left a very successful career after feeling a strong and inexplicable &quot;calling&quot; to become a social worker and an early childhood special educator.  One might think that his preparing to become a teacher might mean I met great resistance to my plans for our children. But actually, it has meant that we have had countless stimulating conversations about how children learn and thrive. In short- he is on board. His main concern has always been more for ME and my ability to achieve balance in my life while home with a little one all the time. He had seen me struggling with this- so fair enough. But we agreed, this is no reason to send children off to school. It is just a reason for me to look at myself and how I can find balance and fulfillment and joy in each moment of my life.<br/>\n<br/>\nSo I have always been sure about unschooling.<br/>\n<br/>\nThen last year (Jan 2010) I gave birth to a darling son, Alex, who has Down Syndrome. This arrival did not impact my plans at first. But the reality of his ever expanding Early Intervention schedule and it&#39;s control over our lives has found me increasingly concerned. My older son, Jackson, is always waiting because Alex needs to eat and nap on a schedule (I was NEVER a schedule person before) in order to be in optimal shape for play with his PT, OT, Speech Therapist, and Special Instructor.  Jack is showing no interest in participating in the sessions. And he is always asking me to read to him, to play with him, to help him build something. But my participation in Alex&#39;s therapy is critical to his development. We rarely host play dates because the appointments are in our home and it is hard to schedule visitors around them. We have only two days per week with no appointments and I try to make these Jackson led days. But it doesn&#39;t change the fact that for the other five days he is so &quot;on his own&quot; as he explores his world. <br/>\n<br/>\nI feel torn. I feel unsure of how to enjoy both boys at the same time.  Jackson tells me- often- that he wants to play with someone. It breaks my heart.<br/>\n<br/>\nI found a nursery school  a few blocks away which I love because it is  non-academic. Basically, it&#39;s founded on the idea of choice, freedom, and play. The teachers who run it believe strongly in preserving the fun and freedom of childhood that has been lost in our country.  I enrolled him for the fall (three hours per day Mon-Fri). On the one hand, I feel relieved that he will have a place to go where he can play in a mixed-age setting. Where there is no pressure to perform or learn. I tell myself that this is temporary. But I don&#39;t know. All I know is that I do not want to send EITHER children to school. But I am only one person. And Alex&#39;s needs, especially in these early years, are wonderfully deep.  But so are Jackson&#39;s. And I don&#39;t see how I can meet them all simultaneously. <br/>\n<br/>\nI am desperate for insight, guidance and advice. But above all- I would LOVE to hear any shared experiences. Is anyone here unschooling siblings wherein one has special needs?<br/>\n<br/>\nThanks,<br/>\nRobin</div>","specialLinks":[]}],"prevTopicId":60545,"nextTopicId":60574}}