{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] How would you handle this?","postDate":"1068306376","msgId":84191,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ4LjI0OTQzYWNkLjJjZGU2OWM4QGFvbC5jb20+"},"prevInTopic":84178,"nextInTopic":0,"prevInTime":84190,"nextInTime":84192,"topicId":84175,"numMessagesInTopic":0,"msgSnippet":"In a message dated 11/8/03 1:24:29 AM, mamabethuscg@yahoo.com writes: ","messageBody":"<div id=\"ygrps-yiv-700538426\">In a message dated 11/8/03 1:24:29 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mamabethuscg@...\">mamabethuscg@...</a> writes:<br/>\n<br/>\n&lt;&lt; While I would specifically like ideas on how to teach her more about our <br/>\nConstitution, the Declaration of Independence (besides simply reading them and <br/>\ndiscussing them), and further into our political system and current political <br/>\nevents...I would just generally like to inspire her into becoming more of an <br/>\nautodidact.  &gt;&gt;<br/>\n<br/>\nMagazine subscriptions would be there when you weren&#39;t and last after you <br/>\nwere gone.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":133144498,"authorName":"The Scanlons","from":"&quot;The Scanlons&quot; &lt;scanlon36@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] How would you handle this?","postDate":"1068274376","msgId":84178,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwZWYwMWMzYTVjNCRmMTBjZDkzMCQ1ZDVhNGVkNUBST0JFUlRCQ1hHUzBGTD4=","referencesHeader":"PDIwMDMxMTA4MDQzOTA1LjExNTczLnFtYWlsQHdlYjEyNjAxLm1haWwueWFob28uY29tPg=="},"prevInTopic":84175,"nextInTopic":84191,"prevInTime":84177,"nextInTime":84179,"topicId":84175,"numMessagesInTopic":0,"msgSnippet":"Elizabeth, Could you just have a heart-to-heart chat with her about how smart you can see that she is, how independent (heck, to actually *do* the homework and","messageBody":"<div id=\"ygrps-yiv-341545072\">Elizabeth,<br/>\n<br/>\nCould you just have a heart-to-heart chat with her about how smart you can<br/>\nsee that she is, how independent (heck, to actually *do* the homework and<br/>\nthen not turn it in?  I think that&#39;s kind of cool!) and what a great<br/>\nhomeschooler she would make?  If you can get her to believe that she really<br/>\ncan still be in charge of her education, then she seems like she has the<br/>\nmoxy to follow through on it.  The biggest thing you can instill in her is<br/>\nthe belief that she can.  And, of course, you can teach her the internet and<br/>\nhow to find the information she wants and needs.  I am not really a good<br/>\nsearch enginer (engineer??) and, frankly, I miss out on a lot of good info.<br/>\nFor some reason, I haven&#39;t gotten it into my head.  I still really prefer<br/>\nbooks in my hot little hands.<br/>\n<br/>\nOnce she understands that she *can* influence her learning, then you can<br/>\ndiscuss how school can damage that drive and ability.  Explain that she<br/>\nstill has to go, but if she can just buckle down and get the required work<br/>\ndone, she can spend the rest of her time learning and doing what she wants.<br/>\n<br/>\nAny chance her mom would see the missing logic of only having you for 18<br/>\nmonths?  Isn&#39;t that the equivalent of two full school years!?  If the girl<br/>\nis already near failing, hanging out with you for a year or so isn&#39;t going<br/>\nto hurt things.  If her mother buys this, then the changes she sees in her<br/>\ndaughter may convince her to continue.  Of course, you still have to worry<br/>\nabout unexpected orders or illness or whatever other reasons might put an<br/>\nend to your homeschooling her.<br/>\n<br/>\nIn the meantime, she would learn a valuable lesson in jumping through the<br/>\nnecessary hoops if you gave her LOTS of help with her homework.  If you sit<br/>\ndown with her and practically do it for her...as long as she is<br/>\ncontributing, too.<br/>\n<br/>\nA couple of history books (biography, literature) from the time period<br/>\npreceding the American Revolution would help her to understand *why* the<br/>\nConstitution was necessary and why it includes the things it includes.<br/>\n<br/>\nYou also must remember that the child is not yours (I know that grates on<br/>\nsome sensibilities, but it&#39;s a reality).  Your efforts *are* going to be<br/>\nundermined, consciously or unconsciously by Mom.  If you can help this child<br/>\nrealize that grades are not the be-all and the end-all of who she is as a<br/>\nperson, you will have given her a great tool.  Of course, she also needs to<br/>\nrealize that they are at least a little bit important *in the world in which<br/>\nshe lives*, so she has to do what she can to survive and thrive.<br/>\n<br/>\nAny chance her school has a 1/2 day program of sorts?  Lots of schools have<br/>\na vocational program.  Or maybe she could load up on the necessary classes<br/>\nin the morning and plan study halls in conjunction with lunch.  Then she<br/>\ncould have a big block of time to either &quot;come home and be homeschooled&quot; or<br/>\ndo her own thing (like maybe the necessary homework just to shut people up)<br/>\nduring that time.  I don&#39;t know how flexible the school is.<br/>\n<br/>\nGood luck!<br/>\n<br/>\nSandy</div>","specialLinks":[]},{"userId":164396504,"authorName":"Elizabeth Roberts","from":"Elizabeth Roberts &lt;mamabethuscg@...&gt;","profile":"mamabethuscg","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"How would you handle this?","postDate":"1068266345","msgId":84175,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMxMTA4MDQzOTA1LjExNTczLnFtYWlsQHdlYjEyNjAxLm1haWwueWFob28uY29tPg=="},"prevInTopic":0,"nextInTopic":84178,"prevInTime":84174,"nextInTime":84176,"topicId":84175,"numMessagesInTopic":0,"msgSnippet":"OK here is a very frustrating situation for me. I babysit my best friend s two oldest children after their school day. Friend is a single mother of four, and","messageBody":"<div id=\"ygrps-yiv-1106158713\">OK here is a very frustrating situation for me. I babysit my best friend&#39;s two oldest children after their school day. Friend is a single mother of four, and unable to homeschool (Actually, there are ways she could I&#39;m sure if she REALLY wanted to..INCLUDING having them homeschooled by me). <br/>\n <br/>\nOldest daughter is 13. Completely failing every single class. Only barely passed 6th grade last year. She will not do any homework; now that she is being &quot;forced&quot; into doing her homework (very reluctantly by me) by her mom she is rebelling by not turning the homework IN. <br/>\n <br/>\nMom has refused to let her be educated by me, in part because I&#39;m a military spouse who will only be here in this state another 18 months. She doesn&#39;t see any benefit to even that length of time of a real education. <br/>\n <br/>\nChild and I were out the other day running an errand, listening to NPR discussion on politics. Child made a comment showing that she WANTS to understand more about politics but knows very little at this point. Her 7th grade &#39;civics&#39; class while only barely into the year only touches on politics (only mentioning Republicans and Democrats, nothing about other parties such as Libertarian). This class is very much into a world citizenship type thing rather than focusing on duties of American citizenship and how to fulfill them.  <br/>\n <br/>\nI would like to teach her more while I&#39;m here and able to be an influence in her life. She&#39;s not yet at the point of self-determination to learn despite the government education she&#39;s receiving, instead she&#39;s given up on any learning at all. <br/>\n <br/>\nWhile I would specifically like ideas on how to teach her more about our Constitution, the Declaration of Independence (besides simply reading them and discussing them), and further into our political system and current political events...I would just generally like to inspire her into becoming more of an autodidact. <br/>\n <br/>\n(Yes, I&#39;ve suggested to her mother to just let her fail if that&#39;s what she&#39;s going to do, etc. to no avail. Mother is very much at the academics is everything stage of thinking)....<br/>\n <br/>\nSIGH...<br/>\n <br/>\nAny ideas? I&#39;m worried that if I don&#39;t DO SOMETHING this child is going to end up not only dropping out of school (which isn&#39;t necessarily a bad thing), but dropping out and never recovering from it (which WOULD be a bad thing).<br/>\n <br/>\nElizabeth in MA<br/>\n<br/>\n<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\nProtect your identity with Yahoo! Mail AddressGuard<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":84187,"nextTopicId":84087}}