{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":36,"messages":[{"userId":69247285,"authorName":"Sharon Rudd","from":"Sharon Rudd &lt;bearspawprint@...&gt;","profile":"bearspawprint","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: keeping unschooling free","postDate":"1012916964","msgId":4203,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIwMjA1MTM0OTI0LjY5NC5xbWFpbEB3ZWIxNDMwMy5tYWlsLnlhaG9vLmNvbT4=","inReplyToHeader":"PEI4ODQyNkQ2LjIxQkFBJUZlbGljaXRhc0BNYWMuY29tPg=="},"prevInTopic":4155,"nextInTopic":4243,"prevInTime":4202,"nextInTime":4204,"topicId":3965,"numMessagesInTopic":0,"msgSnippet":"... ............... Nancy, It think that is a sweet way to begin your post, which really wasn t so long as the years that where condensenced into a letter.","messageBody":"<div id=\"ygrps-yiv-1431428037\"><blockquote><span title=\"ireply\">&gt; <br/>\n&gt; on 2/3/02 10:23 PM, Heather Madrone at<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:heather@...\">heather@...</a> wrote:<br/>\n&gt; <br/>\n&gt; &gt; I got the<br/>\n&gt; &gt; impression that Sandra thought that most people<br/>\n&gt; can&#39;t think for<br/>\n&gt; &gt; themselves and so need expert advice in order to<br/>\n&gt; make changes in<br/>\n&gt; &gt; their lives.<br/>\n<br/>\n<br/>\n&gt; --- Nancy Wooton &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Felicitas@...\">Felicitas@...</a>&gt; wrote:<br/>\n&gt; WARNING - long post ahead!<br/>\n<br/>\n&gt; She probably got that idea from people like me.<br/>\n </span></blockquote>...............<br/>\n<br/>\nNancy, It think that is a sweet way to begin your<br/>\npost, which really wasn&#39;t so long as the years that<br/>\nwhere condensenced into a letter. Thanks for your<br/>\nhonesty.<br/>\n<br/>\nSharon of the Swamp<br/>\n<br/>\n<br/>\n__________________________________________________<br/>\nDo You Yahoo!?<br/>\nSend FREE Valentine eCards with Yahoo! Greetings!<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://greetings.yahoo.com\">http://greetings.yahoo.com</a></div>","specialLinks":[]},{"userId":2523757,"authorName":"Pam Hartley","from":"Pam Hartley &lt;pamhartley@...&gt;","profile":"pdhartley2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: keeping unschooling free","postDate":"1012861793","msgId":4155,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBHUjEwMDNOVjU1VFUxQG10YTcucGx0bjEzLnBiaS5uZXQ+"},"prevInTopic":4153,"nextInTopic":4203,"prevInTime":4154,"nextInTime":4156,"topicId":3965,"numMessagesInTopic":0,"msgSnippet":"... From: Pat Cald...  To:  Subject: Re: [AlwaysLearning] Re: keeping unschooling free Date: Mon, Feb","messageBody":"<div id=\"ygrps-yiv-977992195\">----------<br/>\nFrom: &quot;Pat Cald...&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:homeschoolmd@...\">homeschoolmd@...</a>&gt;<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>&gt;<br/>\nSubject: Re: [AlwaysLearning] Re: keeping unschooling free<br/>\nDate: Mon, Feb 4, 2002, 2:03 PM<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I&#39;ve called myself an unschooler for 6 of the 8 years I&#39;ve been<br/>\n&gt;homeschooling.  I was not an attachment parent, never heard of La Leche<br/>\n&gt;League until long after my babies weaned, never read Mothering or Growing<br/>\n&gt;Without Schooling, still vote Republican...<br/>\n&gt;<br/>\n&gt;OK, so I have a ways to go re. thinking for myself!! &lt;ggg&gt;<br/>\n<br/>\n </span></blockquote>I don&#39;t want to get into any political arguments but is there something I<br/>\ndon&#39;t know about Republicans and unschooling?<br/>\n<br/>\n----------<br/>\n<br/>\nIt&#39;s a joke. There are probably more liberal and/or Democratic unschoolers<br/>\nthan conservative and/or Republican ones. My husband is a conservative<br/>\nRepublican, I&#39;m a Libertarian, like to think of myself as moderate, and<br/>\noften vote Republican.<br/>\n<br/>\nThere&#39;s no official unschooling credo or Republican mandate that says you<br/>\ncan&#39;t be a Republican and unschool.<br/>\n<br/>\nPam<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2018196,"authorName":"sjogy@aol.com","from":"sjogy@...","profile":"sjogypls","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: keeping unschooling free","postDate":"1012860609","msgId":4153,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk1LjE3MDQ2M2Y0LjI5OTA2MGMxQGFvbC5jb20+"},"prevInTopic":4151,"nextInTopic":4155,"prevInTime":4152,"nextInTime":4154,"topicId":3965,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/4/02 4:06:31 PM, homeschoolmd@yahoo.com writes: ","messageBody":"<div id=\"ygrps-yiv-658374976\">In a message dated 2/4/02 4:06:31 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:homeschoolmd@...\">homeschoolmd@...</a> writes:<br/>\n<br/>\n&lt;&lt; She asked me today if there were any games she could play that would give <br/>\nher more math.  Anybody have any games for algebra.  &gt;&gt;<br/>\n<br/>\nWe have almost all the Edmark math CD-ROMS, including Astro Algebra. It was <br/>\ntoo hard for us when we first looked at it, but it seemed pretty cool.<br/>\n<br/>\nPaula</div>","specialLinks":[]},{"userId":84135975,"authorName":"Pat Cald...","from":"&quot;Pat Cald...&quot; &lt;homeschoolmd@...&gt;","profile":"homeschoolmd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: keeping unschooling free","postDate":"1012860198","msgId":4151,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAzZTUwMWMxYWRjNyRjMzMxYzMwMCQ2NDAxYThjMEBvZmZpY2U+","referencesHeader":"PEI4ODQyNkQ2LjIxQkFBJUZlbGljaXRhc0BNYWMuY29tPg=="},"prevInTopic":4146,"nextInTopic":4153,"prevInTime":4150,"nextInTime":4152,"topicId":3965,"numMessagesInTopic":0,"msgSnippet":"... I don t want to get into any political arguments but is there something I don t know about Republicans and unschooling? ... I like being able to ask","messageBody":"<div id=\"ygrps-yiv-1660143055\">Nancy wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;I&#39;ve called myself an unschooler for 6 of the 8 years I&#39;ve been<br/>\n&gt;homeschooling.  I was not an attachment parent, never heard of La Leche<br/>\n&gt;League until long after my babies weaned, never read Mothering or Growing<br/>\n&gt;Without Schooling, still vote Republican...<br/>\n&gt;<br/>\n&gt;OK, so I have a ways to go re. thinking for myself!! &lt;ggg&gt;<br/>\n<br/>\n </span></blockquote>I don&#39;t want to get into any political arguments but is there something I don&#39;t know about Republicans and unschooling?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;The point of this long-winded story is that there really are people who &gt;want<br/>\n&gt;-- no, NEED -- someone to tell them what to do.  In some ways, I&#39;ve spent<br/>\n&gt;my<br/>\n&gt;life hopping from one teacher to another, looking for that A, looking for<br/>\n&gt;approval.  When one &quot;school&quot; becomes boring or too hard or seems to not &gt;fit<br/>\n&gt;me anymore, I look for a new one.  I do it with religions and &gt;relationships<br/>\n&gt;and philosophies.  What happened when I found the unschoolers on AOL was<br/>\n&gt;unsettling for me -- these people wouldn&#39;t tell me what to do, exactly, &gt;but<br/>\n&gt;encouraged me to trust myself.  No one ever suggested that before.<br/>\n<br/>\n </span></blockquote>I like being able to ask someone what they are doing and what their experiences have been.  I like being able to question them, understand their perspective and not feel like I have to walk on eggshells doing it.  I may not be an original thinker but I certainly think for myself.  I analyze, analyze and analyze, if it doesn&#39;t make sense, I ask some more questions.  So far the radical unschoolers have been the only ones that truly make sense to me.<br/>\n<br/>\nI would say the only thing that is still a little shaky in my mind is math.  I&#39;m hoping my MIL doesn&#39;t ask me if we are still doing our math workbooks.  I know I&#39;m going to have trouble explaining why we are not.  12 yo dd plans on taking engineering of some kind in college.  I don&#39;t know how she will get the math she needs for this program if she doesn&#39;t feel like hitting the math workbooks.  I&#39;m trusting that when she gets older if she still wants to get into an engineering program, she will do what it takes.  She asked me today if there were any games she could play that would give her more math.  Anybody have any games for algebra.  I love figuring stuff like that out.  I&#39;m working through her math books because I enjoy it.  Maybe my dd and I will go to college together.<br/>\n<br/>\nPat<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":4635099,"authorName":"Nancy Wooton","from":"Nancy Wooton &lt;Felicitas@...&gt;","profile":"ikonstitcher","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: keeping unschooling free","postDate":"1012852439","msgId":4146,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI4ODQyNkQ2LjIxQkFBJUZlbGljaXRhc0BNYWMuY29tPg==","inReplyToHeader":"PDQuMi4yLjIwMDIwMjAzMjE0NDU0LjAwYmYwZTYwQG1haWwubWFkcm9uZS5jb20+"},"prevInTopic":4122,"nextInTopic":4151,"prevInTime":4145,"nextInTime":4147,"topicId":3965,"numMessagesInTopic":0,"msgSnippet":"WARNING - long post ahead! ... She probably got that idea from people like me. Some people *are* able to decide how to raise their kids, how to ","messageBody":"<div id=\"ygrps-yiv-1717555620\">WARNING - long post ahead!<br/>\n<br/>\non 2/3/02 10:23 PM, Heather Madrone at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:heather@...\">heather@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I got the<br/>\n&gt; impression that Sandra thought that most people can&#39;t think for<br/>\n&gt; themselves and so need expert advice in order to make changes in<br/>\n&gt; their lives.<br/>\n<br/>\n </span></blockquote>She probably got that idea from people like me.<br/>\n<br/>\nSome people *are* able to decide how to raise their kids, how to<br/>\nschool/homeschool/unschool them, etc.  On the other hand, some of us were so<br/>\nwell-schooled we don&#39;t believe we are allowed to make those decisions; our<br/>\nwiser elders have already done that, and we are failing our children and our<br/>\nsociety if we step out of line.  We are bad if we don&#39;t do as we&#39;re told.<br/>\n<br/>\nNot every person was shamed into behaving, but a lot of us were.<br/>\n<br/>\nSounds like you are one of the lucky ones.<br/>\n<br/>\nI decided to have children *after* reading Susan Schaeffer Macaulay&#39;s &quot;For<br/>\nthe Children&#39;s Sake.&quot;  She was Francis Schaeffer&#39;s daughter, and I&#39;d already<br/>\nread most of his and his wife&#39;s books, so she had credibility with me, based<br/>\non that.   She writes about the Charlotte Mason method and her own<br/>\nexperiences as a homeschooled kid, although her parents used Calvert School.<br/>\nMy own fear of school was so great, I didn&#39;t have the nerve to even consider<br/>\nparenthood until I learned that it was possible to never send your child to<br/>\nschool, and therefore, I would never have to talk to a principal or teacher.<br/>\n<br/>\nOnce my daughter was 6, I had to &quot;start schooling,&quot; since that was the age<br/>\nof enrollment in CA.  I didn&#39;t feel prepared to &quot;do Charlotte Mason,&quot; so I<br/>\nchose the other curriculum Schaeffer mentioned, Calvert School.  They<br/>\nadvertised in National Geographic, so that meant they had to be good, right?<br/>\nAnd I dove into Calvert, did every page every day, and my dd got gold seals<br/>\nindicating 100% correct on her tests, which, of course, we sent in to the<br/>\nexpert teacher to grade.  I had to write evaluations of her reading, and<br/>\nmade sure she sounded good, because I was so afraid I might be viewed as a<br/>\nfailure and bad.<br/>\n<br/>\nFirst grade went great (except for that one day when I locked dd in the<br/>\nschoolroom until she completed her language worksheet -- I *knew* she could<br/>\n*do it* if only she *would*), so we ordered second grade.  It arrived about<br/>\n3 weeks after we completed first, and dd wanted to jump right in.  And I<br/>\ndutifully read page one of the big teacher&#39;s manual and insisted we do<br/>\nlesson one.  The problem was, we hadn&#39;t taken three months off to forget<br/>\nmost of first grade, but the books assumed we had.  The math book started<br/>\nwith matching number stickers to pictures.  Dd had been doing 3-digit<br/>\nsubtraction, and could have started half-way through the book.<br/>\n<br/>\nBut no, the manual said lesson one, and by golly, we were going to DO lesson<br/>\none.  I would be bad if we didn&#39;t.  We battled through 40 boring lessons,<br/>\nand I realized dd would NOT get a perfect gold seal on her first test!!!  I<br/>\nwould be bad if she didn&#39;t.  So...<br/>\n<br/>\n... Dad stepped in.  He&#39;d found a new plaything called AOL, and, feeling<br/>\nguilty because he&#39;s the only one playing with it, tries a keyword<br/>\n&quot;homeschooling.&quot;  He shows it to me, shows me how to download folder<br/>\nmessages by flashsession so we won&#39;t break the budget, and I start exploring<br/>\nmessage boards.  First, I find one for Calvert School users, and am told I<br/>\ndon&#39;t really have to use the teacher service, and it&#39;s ok to use a different<br/>\nhandwriting program (I hated Calvert Script), and it&#39;s ok to skip lessons<br/>\nand even to do the whole geography book in one day like dd wanted, rather<br/>\nthan making it the reward once a week as the teacher&#39;s manual suggested.<br/>\n<br/>\nThat alone was mindblowing.  I could use the material in a way other than as<br/>\ninstructed by the experts?  I could change something to suit -- myself??<br/>\n<br/>\nThen I started looking at some of the other folders.  I made friends with a<br/>\nCharlotte Mason user (one expert enough to be a seminar speaker!), and<br/>\nlearned it was OK to relax, to adapt materials as I saw fit.  I wrote snail<br/>\nmail letters to other homeschoolers of my newly adopted religion, asking if<br/>\nit was OK to be more relaxed, if Charlotte Mason was suitable.  One warned<br/>\nagainst anything too radical, but assured me CM was acceptable.  (One<br/>\neducation writer of my religion stated flat out that no parent should try to<br/>\nteach their own kid, but by the time I read his book, I had enough balls to<br/>\nsay &quot;screw it, what does he know?&quot; -- but that was later &lt;g&gt;)<br/>\n<br/>\nAnd then, I looked at another folder, this one titled &quot;unschooling.&quot;  Whoa,<br/>\nnelly, what a bunch of weirdoes!  Nevertheless, I find interesting posts,<br/>\nand also find it&#39;s the funniest folder.  I went to a chat and found many of<br/>\nthe unschooling posters there; I wrote down the names on a piece of paper so<br/>\nI could look for their messages.  I cracked a joke and got my first ROFL,<br/>\nand I was hooked.  I liked these people.  I felt OK talking to them.  I<br/>\ncould ask questions and not be told I was wrong, but that maybe there was<br/>\nmore out there.  Someone said &quot;relax,&quot; and someone else said &quot;trust your<br/>\nchildren,&quot; and someone made the suggestion I take a vacation from any kind<br/>\nof &quot;schooling,&quot; just to see what might happen.<br/>\n<br/>\nI took that suggestion, using Advent/Christmas/Epiphany as the timeframe and<br/>\nthe justification -- a total of over two months &lt;g&gt;  Once Epiphany was past,<br/>\nmy dd wanted to know when we would &quot;start school&quot; again.  I didn&#39;t give a<br/>\nreal answer &lt;g&gt;  While we didn&#39;t dive into unschooling right then, we never<br/>\ndid another Calvert lesson.  We did some of the sweet ideas of Charlotte<br/>\nMason, like nature drawing and journals, and a little narration, but nothing<br/>\nforced.  This was my time of learning, my time of reading that guy all the<br/>\nunschoolers talked about, John Holt (&quot;How Children Failed&quot; had me in tears),<br/>\nand it was my time to heal.<br/>\n<br/>\nIt was my son, though, who made me an unschooler.  I prepared to teach him<br/>\nto read, using Charlotte Mason suggestions, and then discovered he already<br/>\n*could* read.  He had no patience for sounding out, shooting down the<br/>\nEveryone Needs Phonics dogma.  At Christmas, dd, who loved them, asked for<br/>\nmath workbooks :-)  Being a fair-minded parent, I bought a kindergarten<br/>\nlevel book for ds.  The day after Christmas, the two of them spent a couple<br/>\nof hours doing those workbooks.  At one point, ds got stuck and asked for<br/>\nhelp.  He was doing subtraction, and tried to explain to me what the problem<br/>\nwas; whatever it was he was doing made no sense at all to me.  I fell back<br/>\non the Calvert School teaching technique -- get out 9 beans, take away 5,<br/>\ncount what&#39;s left, simple, right?  My 5 y.o. son gets this look on his face,<br/>\nballs up his fists, and says in a growl, &quot;Don&#39;t ever try to teach me<br/>\nanything again, mom!  You make it too confusing!&quot;<br/>\n<br/>\nThat was my turning point.  I have never since &quot;taught&quot; him anything.  If he<br/>\nasks for help, I ask if he&#39;s sure he wants it &lt;g&gt;  I learned to respect his<br/>\nbrain, his learning &quot;style,&quot; and to not take it personally if he rejects my<br/>\nhelp.<br/>\n<br/>\nI&#39;ve called myself an unschooler for 6 of the 8 years I&#39;ve been<br/>\nhomeschooling.  I was not an attachment parent, never heard of La Leche<br/>\nLeague until long after my babies weaned, never read Mothering or Growing<br/>\nWithout Schooling, still vote Republican...<br/>\n<br/>\nOK, so I have a ways to go re. thinking for myself!! &lt;ggg&gt;<br/>\n<br/>\nThe point of this long-winded story is that there really are people who want<br/>\n-- no, NEED -- someone to tell them what to do.  In some ways, I&#39;ve spent my<br/>\nlife hopping from one teacher to another, looking for that A, looking for<br/>\napproval.  When one &quot;school&quot; becomes boring or too hard or seems to not fit<br/>\nme anymore, I look for a new one.  I do it with religions and relationships<br/>\nand philosophies.  What happened when I found the unschoolers on AOL was<br/>\nunsettling for me -- these people wouldn&#39;t tell me what to do, exactly, but<br/>\nencouraged me to trust myself.  No one ever suggested that before.<br/>\n<br/>\nIf I had read Holt&#39;s &quot;Teach Your Own&quot; first, instead of &quot;For the Children&#39;s<br/>\nSake&quot;, I probably would never have homeschooled; I wasn&#39;t ready to hear<br/>\nanything that radical.  When people -- newbies -- seek out unschooling.com,<br/>\nthey probably have *some* idea of what unschooling is.  I had to work my way<br/>\nup to it on AOL, shedding coercive certainties little by little.  I needed<br/>\nsomeone to say &quot;it&#39;s OK to not do school every day,&quot; &quot;it&#39;s OK to use a<br/>\ndifferent handwriting program -- have you seen Portland Italic?&quot;<br/>\nEventually, I didn&#39;t need anyone to say &quot;it&#39;s OK to spend the day curled up<br/>\nin bed reading The Indian in the Cupboard aloud, straight through, and not<br/>\ndo any worksheets about it&quot;!<br/>\n<br/>\n(Sorry for the length... HEY, WAKE UP!)<br/>\nNancy</div>","specialLinks":[]},{"userId":94797851,"authorName":"Karin","from":"&quot;Karin&quot; &lt;curtkar@...&gt;","profile":"kc85022","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: keeping unschooling free","postDate":"1012837044","msgId":4122,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMWIwMWMxYWQ5MSRkN2Y2NzE0MCQ2NDAwYThjMEBnb2R6aWxsYT4=","referencesHeader":"PDQuMi4yLjIwMDIwMjAzMjE0NDU0LjAwYmYwZTYwQG1haWwubWFkcm9uZS5jb20+"},"prevInTopic":4120,"nextInTopic":4146,"prevInTime":4121,"nextInTime":4123,"topicId":3965,"numMessagesInTopic":0,"msgSnippet":"... Okay, I am a 37 yo young thing and in this case I have enjoyed listening to my elders. As a newer unschooler, I have learned a lot from the discussion","messageBody":"<div id=\"ygrps-yiv-1756037810\"><blockquote><span title=\"ireply\">&gt;What I heard had a different emotional tone, close to &quot;You young things<br/>\n&gt;ought to listen to your elders and betters.&quot;  This struck me, and<br/>\n&gt;strikes me, as patronizing, and probably infuriating to the young<br/>\n&gt;things who are being spoken to. &gt;&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>Okay, I am a 37 yo &quot;young thing&quot; and in this case I have enjoyed listening to my elders. As a newer unschooler, I have learned a lot from the discussion about keeping unschooling free and also defining unschooling this past weekend. I want to thank all those who contributed to the conversation and have kept it going.<br/>\n<br/>\nalways learning,<br/>\nKarin<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":74604204,"authorName":"ddzimlew@juno.com","from":"ddzimlew@...","profile":"mom2zimmy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: keeping unschooling free","postDate":"1012829465","msgId":4120,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIwMjA0LjA2NDk1OC4tMTQ4NTEuMi5kZHppbWxld0BqdW5vLmNvbT4="},"prevInTopic":4111,"nextInTopic":4122,"prevInTime":4119,"nextInTime":4121,"topicId":3965,"numMessagesInTopic":0,"msgSnippet":"On Sun, 03 Feb 2002 22:23:16 -0800 Heather Madrone  ... There are some parents, really nice people who love their children fiercely, who","messageBody":"<div id=\"ygrps-yiv-700645418\">On Sun, 03 Feb 2002 22:23:16 -0800 Heather Madrone &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:heather@...\">heather@...</a>&gt;<br/>\nwrites:<br/>\n<blockquote><span title=\"ireply\"> &gt;          * Seeing posts on this list claim that X, Y, or Z wasn&#39;t <br/>\n&gt;            unschooling.  This seems like a pointless exercise to me,<br/>\n&gt;            one that distracts from the more important issue of what<br/>\n&gt;            is best for the children.<br/>\n<br/>\n </span></blockquote>There are some parents, really nice people who love their children<br/>\nfiercely, who think spanking is best for children, who think grounding<br/>\nand restricting and punishment is best for children.  There are those who<br/>\nthink dealing with bully&#39;s at school is best for children, so they can<br/>\nlearn how to live in the real world.   There are more extreme examples,<br/>\ntoo.  <br/>\nSometimes people who come to unschooling think they have it.  They think<br/>\nthey get it.  When their child shows an interest in insects, they run<br/>\nright out and buy that unit study.  They let their kid play all day<br/>\nexcept for those two hours he has to sit down with the math text book. <br/>\nThat is not unschooling, and if a person wants to understand I don&#39;t<br/>\nthink it&#39;s helpful to let them go on thinking it is.  <br/>\nI wouldn&#39;t know how to define unschooling so clearly and precisely that<br/>\neveryone would have real understanding.  But it only seems reasonable to<br/>\ntry to make it clearer for those who are trying to understand.  <br/>\nI always get in trouble with analogy&#39;s but I&#39;m going to try one here.  If<br/>\nI wanted to make a cake, and had never baked or cooked before,  a cake<br/>\nrecipe that just said - do what ever seems best to you, use your<br/>\nimagination -  probably wouldn&#39;t be that helpful.  If my friend, who<br/>\nalways had lovely cakes ( devil&#39;s food? )  had given me this recipe,  I<br/>\nwould have to assume cake just didn&#39;t work for my family.<br/>\nIt would have been much more helpful to have an ingredients list and a<br/>\nplan for putting them together.  <br/>\nOk, kids are not cakes, and maybe there&#39;s no ingredients list for<br/>\nunschooling, but I would hope, before I pour a bottle of vinegar in my<br/>\nbatter, someone who knows about cakes would stop me.  I would hope,<br/>\nbefore I add a text book or take away TV,  someone who knows about<br/>\nunschooling would stop me.  <br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; We have also touched on whether parents can think for themselves and  <br/>\n&gt; whether parental instincts, listening, and so forth are good enough <br/>\n&gt; guides for parental action.  Do parents really need an external <br/>\n&gt; philosophy or can they drive their own lives?  Will they, if given<br/>\n&gt; gentle encouragement, come to the truth on their own, or must <br/>\n&gt; someone<br/>\n&gt; else give it to them piecemeal?<br/>\n<br/>\n </span></blockquote>I&#39;m sorry to say, I know way more parents who listen to their instincts,<br/>\nand make choices that are really bad for their kids.   There is a whole<br/>\npopulation of parents out there who think playground bully&#39;s are just a<br/>\nnatural part of growing up.  They think having a terrible year or two or<br/>\nten at school is just the way life is.   <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It is my impression that I have a far more positive view of the<br/>\n&gt; capacities of parents than Sandra, Joyce, and others on this list.  <br/>\n&gt; I have felt cast in the role of Pollyanna, although it is fairly <br/>\n&gt; common in my experience for people to come to unschooling gently <br/>\n&gt; and gradually.<br/>\n<br/>\n </span></blockquote>I really envy you this.  I wish this was my experience.  I know so many<br/>\nkids whose lives could be so much better.  I know so many parents,  not<br/>\nreally *getting*  or caring about what&#39;s going on with their kids.<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt;  I got the<br/>\n&gt; impression that Sandra thought that most people can&#39;t think for<br/>\n&gt; themselves and so need expert advice in order to make changes in<br/>\n&gt; their lives.<br/>\n<br/>\n </span></blockquote>I don&#39;t think so.  I think Sandra understands that unschooling is such a<br/>\nhuge change in thinking,  such a giant step, that people often need<br/>\nguidance.  It&#39;s easy to get lost when your going someplace you&#39;ve never<br/>\nbeen before.  Having a guide, or even a map might mean the difference<br/>\nbetween getting there happily and not getting there at all.<br/>\n  <br/>\n<blockquote><span title=\"ireply\"> &gt; What I heard had a different emotional tone, close to &quot;You young <br/>\n&gt; things<br/>\n&gt; ought to listen to your elders and betters.&quot;  This struck me, and<br/>\n&gt; strikes me, as patronizing, and probably infuriating to the young<br/>\n&gt; things who are being spoken to.<br/>\n<br/>\n </span></blockquote>We had some church guy here crying about how terrible Harry Potter books<br/>\nare, who openly admitted he&#39;d never read them.   Asking new unschoolers<br/>\nto gain a little more understanding before jumping to conclusions doesn&#39;t<br/>\nseem unreasonable.  That&#39;s all that was.  No one here would deliberately<br/>\ndiscount someone&#39;s wisdom simply because they are young.  Most of us wish<br/>\nwe&#39;d gotten the whole thing much sooner ourselves.  It&#39;s inspiring to see<br/>\nyoung parents who seem to have a really natural understanding of this<br/>\nconcept.  But someone, young or old, who believes they have an<br/>\nunderstanding of unschooling, and still wants to place restrictions on<br/>\ntheir children, really may have things to learn yet.  <br/>\n<br/>\nYour post was really beautiful.  It really spoke to me.  My own<br/>\nunderstanding of unschooling came naturally, gradually, thankfully before<br/>\nmy son ever went to school or had a taste of text books.  I&#39;m still<br/>\ngaining understanding.  But I&#39;ve seen that it&#39;s not always a natural<br/>\nthing with some parents, and for them and for myself, I&#39;m really glad for<br/>\nthe wisdom of people like Sandra. <br/>\n<br/>\nDeb L</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: keeping unschooling free","postDate":"1012821893","msgId":4111,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI4ODNEOUI1LjRFN0ElZmV0dGVyb2xsQGVhcnRobGluay5uZXQ+","inReplyToHeader":"PDQuMi4yLjIwMDIwMjAzMjE0NDU0LjAwYmYwZTYwQG1haWwubWFkcm9uZS5jb20+"},"prevInTopic":4097,"nextInTopic":4120,"prevInTime":4110,"nextInTime":4112,"topicId":3965,"numMessagesInTopic":0,"msgSnippet":"... There are many people who have made the same argument over the many (7+?) years I ve been on line. There are many people who would agree with you. But,","messageBody":"<div id=\"ygrps-yiv-1057274511\">on 2/4/02 1:23 AM, Heather Madrone at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:heather@...\">heather@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I believe that Sandra and I have been discussing whether unschooling<br/>\n&gt; needs a definition or not.  I believe that Sandra&#39;s position is that<br/>\n&gt; there are many benefits to a definition.  My current position is that<br/>\n&gt; it might be a good idea to keep unschooling as undefined as Holt kept<br/>\n&gt; it.<br/>\n<br/>\n </span></blockquote>There are many people who have made the same argument over the many (7+?)<br/>\nyears I&#39;ve been on line. There are many people who would agree with you.<br/>\n<br/>\nBut, before you bring the argument here, a little history of *this* list<br/>\nwould probably be helpful. Sandra started this list recently and the people<br/>\nwho initially followed her here are many of the ones who *liked* and<br/>\n*benefited* from Sandra&#39;s and other&#39;s more direct approach to getting<br/>\nunschooling and came for more of the same. So an argument that pointing out<br/>\n&quot;that&#39;s not unschooling&quot; isn&#39;t the best approach won&#39;t fly *here* because a<br/>\nwhole slew of living examples who *did* benefit from it are right here. It<br/>\nwould sort of be like wandering into a vegan list and suggesting the people<br/>\nmight want to be a little less hard line and loosen up where food is<br/>\nconcerned if they want more people to get vegetarianism.<br/>\n<br/>\nThere are probably people here who came from Yahoo or heard about it on<br/>\nUnschooling.com (or someplace else?) who don&#39;t necessarily like hard<br/>\nquestioning or debate or having what they do held up to public examiniation.<br/>\nThey will probably be uncomfortable here. Maybe some who thought they didn&#39;t<br/>\nlike debate will realize they do. Maybe some will see it as fighting and<br/>\nleave.<br/>\n<br/>\nThere is something unique offered here and it isn&#39;t to everyone&#39;s liking.<br/>\nBut to make it to more people&#39;s liking would take away what the people who<br/>\ninitially came here hoped to find. There are gentler ways to present<br/>\nunschooling. There are people who will benefit from it. There are people who<br/>\nwill slowly get unschooling that way, and some who will stop part way when<br/>\nthey reach their comfort zone. But that will leave out the people who do<br/>\nlike a more direct approach. But they can come here because that&#39;s what&#39;s<br/>\ndone here. :-)<br/>\n<br/>\nJoyce <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: keeping unschooling free","postDate":"1012805989","msgId":4097,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwLjIzNDgwN2QxLjI5OGY4YjY1QGFvbC5jb20+"},"prevInTopic":4096,"nextInTopic":4111,"prevInTime":4096,"nextInTime":4098,"topicId":3965,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/3/02 11:23:44 PM, heather@madrone.com writes: ","messageBody":"<div id=\"ygrps-yiv-19177349\">In a message dated 2/3/02 11:23:44 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:heather@...\">heather@...</a> writes:<br/>\n<br/>\n&lt;&lt; It is quite possible that I have simply not seen enough of<br/>\nSandra&#39;s views to put them in context. &gt;&gt;<br/>\n<br/>\nMost of the people on this list, when it first formed, came because I formed <br/>\nit.  It&#39;s my party.  You&#39;re welcome to be here, but if you don&#39;t have a <br/>\ncontext for my views, please either wait and read more, or go to <br/>\nSandraDodd.com/unschooling, or to unschooling.com.  If you&#39;re not interested <br/>\nin looking at those things, I&#39;d understand, but I would like the benefit of <br/>\nthe doubt if you&#39;re unwilling to look further.<br/>\n<br/>\n&lt;&lt;Again, it&#39;s possible that my<br/>\nview was colored by the first post I saw to this list, so I&#39;m trying <br/>\nto suspend judgement until I have more information.&gt;&gt;<br/>\n<br/>\nSuspending judgment is usually a quieter matter than a long post falsely <br/>\nsummarizing belief and statement.<br/>\n<br/>\nMy request to the large batch of new members to this group, a number of whom <br/>\nwere self-admittedly new to unschooling, or self-admittedly parents of <br/>\ntoddlers, was that they suspend judgment--that they wait to see what was <br/>\ngoing on and to see who knew what before they jumped on us as a group and on <br/>\nour beliefs.  I didn&#39;t get my way.   The point was hammered paper thin, along <br/>\nwith the patience of several of the regulars.  <br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":748699,"authorName":"Heather Madrone","from":"Heather Madrone &lt;heather@...&gt;","profile":"madrone95006","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: keeping unschooling free","postDate":"1012803796","msgId":4096,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQuMi4yLjIwMDIwMjAzMjE0NDU0LjAwYmYwZTYwQG1haWwubWFkcm9uZS5jb20+","inReplyToHeader":"PGEzbDVvZStucGsxQGVHcm91cHMuY29tPg=="},"prevInTopic":4092,"nextInTopic":4097,"prevInTime":4095,"nextInTime":4097,"topicId":3965,"numMessagesInTopic":0,"msgSnippet":"... It s quite possible I m not arguing at all.  I might be clarifying something, expanding on something, or writing about things I ve been thinking about. I","messageBody":"<div id=\"ygrps-yiv-1331243075\">--- In AlwaysLearning@y..., PSoroosh@a... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;In a message dated 2/3/2002 4:52:40 PM Pacific Standard Time, <br/>\n&gt;AlwaysLearning@y... writes:<br/>\n&gt; &gt; I&#39;m not saying that we can&#39;t provide raw materials, a <br/>\n&gt; &gt; conducive environment, information, and even the value<br/>\n&gt; &gt; of experience.  I just think that unschoolers especially <br/>\n&gt; &gt; ought to encourage other people to use those raw materials <br/>\n&gt; &gt; to make their own creations, rather than encouraging them <br/>\n&gt; &gt; to copy our creations.<br/>\n&gt;<br/>\n&gt;Heather - you sound like you&#39;re arguing something, but I can&#39;t get a <br/>\n&gt;grip on what the other side is. <br/>\n<br/>\n </span></blockquote>It&#39;s quite possible I&#39;m not arguing at all.  I might be clarifying<br/>\nsomething, expanding on something, or writing about things I&#39;ve been <br/>\nthinking about.<br/>\n<br/>\nI have been musing about the possibility of deliberately keeping<br/>\nunschooling undefined.  Most of the impetus for that comes from:<br/>\n<br/>\n         * Not having been able to come up with a good definition in<br/>\n           9 years.  A bad definition seems to me worse than no<br/>\n           definition at all.<br/>\n         * Seeing how much power certain undefined concepts continue<br/>\n           to have for centuries after people refuse to define them.<br/>\n         * Seeing posts on this list claim that X, Y, or Z wasn&#39;t <br/>\n           unschooling.  This seems like a pointless exercise to me,<br/>\n           one that distracts from the more important issue of what<br/>\n           is best for the children.<br/>\n<br/>\nI believe that Sandra and I have been discussing whether unschooling<br/>\nneeds a definition or not.  I believe that Sandra&#39;s position is that<br/>\nthere are many benefits to a definition.  My current position is that<br/>\nit might be a good idea to keep unschooling as undefined as Holt kept<br/>\nit.<br/>\n<br/>\nWe have also touched on whether parents can think for themselves and <br/>\nwhether parental instincts, listening, and so forth are good enough <br/>\nguides for parental action.  Do parents really need an external <br/>\nphilosophy or can they drive their own lives?  Will they, if given<br/>\ngentle encouragement, come to the truth on their own, or must someone<br/>\nelse give it to them piecemeal?<br/>\n<br/>\nIt is my impression that I have a far more positive view of the<br/>\ncapacities of parents than Sandra, Joyce, and others on this list.  <br/>\nI have felt cast in the role of Pollyanna, although it is fairly <br/>\ncommon in my experience for people to come to unschooling gently <br/>\nand gradually.<br/>\n<br/>\nI think that sketches the area of the discussion.  I&#39;d prefer to<br/>\nthink of it as an exploration of the territory rather than an <br/>\nargument.  There&#39;s been a lot of food for thought on both sides.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Maybe I missed it, but I&#39;ve never seen unschoolers do anything but <br/>\n&gt;do what you&#39;re saying they should do - encourage people to <br/>\n&gt;listen to LOTS of stories and ideas and, at the same time, to <br/>\n&gt;think about their OWN kids and their OWN family&#39;s lifestyle and <br/>\n&gt;environment and put things together in their OWN way.<br/>\n<br/>\n </span></blockquote>I think that this is one of the problems with discussing things<br/>\nin the abstract.  It sounded to me like Sandra and Joyce were<br/>\ntalking about being very directive with new parents.  I got the<br/>\nimpression that Sandra thought that most people can&#39;t think for<br/>\nthemselves and so need expert advice in order to make changes in<br/>\ntheir lives.<br/>\n<br/>\nIt is quite possible that I have simply not seen enough of<br/>\nSandra&#39;s views to put them in context.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I&#39;ve heard people saying, &quot;You might want to argue less and listen more to <br/>\n&gt;the anecdotes that long-time unschoolers are willing to tell because you <br/>\n&gt;can learn something from them.&quot;  But I didn&#39;t hear anybody saying, &quot;Copy <br/>\n&gt;me.&quot;<br/>\n<br/>\n </span></blockquote>What I heard had a different emotional tone, close to &quot;You young things<br/>\nought to listen to your elders and betters.&quot;  This struck me, and<br/>\nstrikes me, as patronizing, and probably infuriating to the young<br/>\nthings who are being spoken to.<br/>\n<br/>\nIt is quite possible that I mis-heard what was being said.  It&#39;s<br/>\neasy to misinterpret online posts, but I have caught hints of the<br/>\nsame attitude in subsequent posts.  Again, it&#39;s possible that my<br/>\nview was colored by the first post I saw to this list, so I&#39;m trying <br/>\nto suspend judgement until I have more information.<br/>\n<br/>\nHeather Madrone &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:heather@...\">heather@...</a>&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.madrone.com\">http://www.madrone.com</a><br/>\nHomeschooling:  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.madrone.com/Home-ed/homeschool.htm\">http://www.madrone.com/Home-ed/homeschool.htm</a><br/>\nThe Home-Ed List:  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.madrone.com/Home-ed/helist.html\">http://www.madrone.com/Home-ed/helist.html</a><br/>\n<br/>\nYou can lead a child to learning, but you can&#39;t make her think.</div>","specialLinks":[]},{"userId":1798873,"authorName":"PSoroosh@aol.com","from":"PSoroosh@...","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: keeping unschooling free","postDate":"1012795078","msgId":4092,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDExYy5iYzJhODQ2LjI5OGY2MGM2QGFvbC5jb20+"},"prevInTopic":4070,"nextInTopic":4096,"prevInTime":4091,"nextInTime":4093,"topicId":3965,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/3/2002 4:52:40 PM Pacific Standard Time, ... Heather - you sound like you re arguing something, but I can t get a grip on what the other","messageBody":"<div id=\"ygrps-yiv-528298302\">In a message dated 2/3/2002 4:52:40 PM Pacific Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m not saying that we can&#39;t provide raw materials, a <br/>\n&gt; conducive environment, information, and even the value<br/>\n&gt; of experience.  I just think that unschoolers especially <br/>\n&gt; ought to encourage other people to use those raw materials <br/>\n&gt; to make their own creations, rather than encouraging them <br/>\n&gt; to copy our creations.<br/>\n<br/>\n </span></blockquote>Heather - you sound like you&#39;re arguing something, but I can&#39;t get a grip on <br/>\nwhat the other side is. Maybe I missed it, but I&#39;ve never seen unschoolers do <br/>\nanything but do what you&#39;re saying they should do - encourage people to <br/>\nlisten to LOTS of stories and ideas and, at the same time, to think about <br/>\ntheir OWN kids and their OWN family&#39;s lifestyle and environment and put <br/>\nthings together in their OWN way.<br/>\n<br/>\nAre you referring to discussions here on this list or somewhere else?  I&#39;ve <br/>\nheard people saying, &quot;You might want to argue less and listen more to the <br/>\nanecdotes that long-time unschoolers are willing to tell because you can <br/>\nlearn something from them.&quot;  But I didn&#39;t hear anybody saying, &quot;Copy me.&quot;<br/>\n<br/>\n--pam<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":82903808,"authorName":"Earth Witch","from":"Earth Witch &lt;the_earth_witch@...&gt;","profile":"the_earth_witch","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] keeping unschooling free","postDate":"1012770276","msgId":4070,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIwMjAzMjEwNDM2LjkyNTc0LnFtYWlsQHdlYjIwOTA5Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PGM2LjVlNGIwYzQuMjk4ZGJhMjFAYW9sLmNvbT4="},"prevInTopic":4066,"nextInTopic":4092,"prevInTime":4069,"nextInTime":4071,"topicId":3965,"numMessagesInTopic":0,"msgSnippet":"... I think that the reason there are people who are doing poorly at parenting is because they do not follow their instincts.  It can be very confusing for","messageBody":"<div id=\"ygrps-yiv-948600243\"><blockquote><span title=\"ireply\">&gt; -=- Our human biology<br/>\n&gt; has fitted us to parent our children.  Our instincts<br/>\n&gt; and inner<br/>\n&gt; guides can take us much farther than any creed.-=-<br/>\n&gt; <br/>\n&gt;&gt;&gt;&gt; This is inspiring, but I look around me to many<br/>\n&gt;&gt;&gt;&gt; examples of very bad <br/>\n&gt;&gt;&gt;&gt; parenting.  <br/>\n<br/>\n<br/>\n </span></blockquote>I think that the reason there are people who are doing<br/>\npoorly at parenting is because they do not follow<br/>\ntheir instincts.  It can be very confusing for parents<br/>\nwhen there are thousands of &#39;experts&#39; telling them<br/>\nthis way is best, and all the &#39;experts&#39; have a<br/>\ndifferent way.  Parents, often out of fear they will<br/>\nnot be good parents and lack of confidence, put their<br/>\ntrust in this &#39;experts&#39; and end up thoroughly confused<br/>\nand less confident than ever.  It is hard to overcome<br/>\nthat fear and a lot of  people are taught that<br/>\ninstincts are bad and should not be followed.  Every<br/>\nmother I have known has the instinct to go and pick up<br/>\ntheir baby when the baby is crying.  It is natural. <br/>\nYet, many do not do it because they have been told it<br/>\nis wrong, it will &quot;spoil the child&quot;....they begin to<br/>\nbelieve their instincts will be damaging in some way<br/>\nto their child.  So, they follow some rule to make<br/>\nthemsleves &#39;good&#39; parents.<br/>\n<br/>\n<br/>\nKitrina<br/>\n<br/>\n<br/>\n<br/>\n__________________________________________________<br/>\nDo You Yahoo!?<br/>\nGreat stuff seeking new owners in Yahoo! Auctions! <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://auctions.yahoo.com\">http://auctions.yahoo.com</a></div>","specialLinks":[]},{"userId":748699,"authorName":"madrone95006","from":"&quot;madrone95006&quot; &lt;heather@...&gt;","profile":"madrone95006","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: keeping unschooling free","postDate":"1012768070","msgId":4066,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGEzazZnNis3aHNjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE1ZC44NWU5OTMyLjI5OGVmNWUwQGFvbC5jb20+"},"prevInTopic":4065,"nextInTopic":4070,"prevInTime":4065,"nextInTime":4067,"topicId":3965,"numMessagesInTopic":0,"msgSnippet":"... Yes. --hmm","messageBody":"<div id=\"ygrps-yiv-627995724\">--- In AlwaysLearning@y..., SandraDodd@a... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; In a message dated 2/3/02 12:59:53 PM, heather@m... writes:<br/>\n&gt; <br/>\n&gt; &lt;&lt; How about at birth? &gt;&gt;<br/>\n&gt; <br/>\n&gt; Yours or the baby&#39;s?<br/>\n<br/>\n </span></blockquote>Yes.<br/>\n<br/>\n--hmm</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: keeping unschooling free","postDate":"1012767712","msgId":4065,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1ZC44NWU5OTMyLjI5OGVmNWUwQGFvbC5jb20+"},"prevInTopic":4059,"nextInTopic":4066,"prevInTime":4064,"nextInTime":4066,"topicId":3965,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/3/02 12:59:53 PM, heather@madrone.com writes:  Yours or the baby s? ","messageBody":"<div id=\"ygrps-yiv-235078247\">In a message dated 2/3/02 12:59:53 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:heather@...\">heather@...</a> writes:<br/>\n<br/>\n&lt;&lt; How about at birth? &gt;&gt;<br/>\n<br/>\nYours or the baby&#39;s?<br/>\n<br/>\n&lt;&lt;How do you think people become courageous leaders or pioneer<br/>\nexplorers?.&gt;<br/>\n<br/>\nGenetics.  Nature.  Not having it shamed out of them if they did have the <br/>\nability.<br/>\n<br/>\nNot all people can carry a tune.<br/>\nMore people can carry a tune than can be leaders or independent pioneers.<br/>\n<br/>\n&lt;&lt;There&#39;s a whole lot of territory between giving them no<br/>\nhelp at all and giving them step-by-step instructions.&gt;&gt;<br/>\n<br/>\nWhere are these step-by-step instructions?  <br/>\nNot in Mary Griffith&#39;s books.<br/>\nNot in John Holt&#39;s books.<br/>\nNot in Linda Dobson&#39;s books.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":748699,"authorName":"madrone95006","from":"&quot;madrone95006&quot; &lt;heather@...&gt;","profile":"madrone95006","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: keeping unschooling free","postDate":"1012766317","msgId":4059,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGEzazRwZCtqMzRzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGZkLjEzMmU1YmQyLjI5OGViYWEwQGFvbC5jb20+"},"prevInTopic":4039,"nextInTopic":4065,"prevInTime":4058,"nextInTime":4060,"topicId":3965,"numMessagesInTopic":0,"msgSnippet":"... How about at birth? The only place you can start is exactly where you are. I m not saying that we can t provide raw materials, a conducive environment,","messageBody":"<div id=\"ygrps-yiv-984826931\">--- In AlwaysLearning@y..., SandraDodd@a... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; In a message dated 2/3/02 12:50:58 AM, heather@m... writes:<br/>\n&gt; &lt;&lt; When we think things through for ourselves, we really own the <br/>\n&gt; knowledge that we eventually get.  &gt;&gt;<br/>\n&gt; <br/>\n&gt; Where do you start, though?<br/>\n<br/>\n </span></blockquote>How about at birth?<br/>\n<br/>\nThe only place you can start is exactly where you are.<br/>\n<br/>\nI&#39;m not saying that we can&#39;t provide raw materials, a <br/>\nconducive environment, information, and even the value<br/>\nof experience.  I just think that unschoolers especially <br/>\nought to encourage other people to use those raw materials <br/>\nto make their own creations, rather than encouraging them <br/>\nto copy our creations.<br/>\n<br/>\nI don&#39;t believe in modeling art projects for kids,<br/>\neither.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; And some people are courageous leaders or pioneer explorers, and <br/>\n </span></blockquote>MOST people <br/>\n<blockquote><span title=\"ireply\"> &gt; are not.<br/>\n<br/>\n </span></blockquote>How do you think people become courageous leaders or pioneer<br/>\nexplorers?<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; &lt;&lt;&gt; But people who Do want to know about unschooling come to <br/>\n&gt; unschooling.com, and <br/>\n&gt; &gt; they don&#39;t want people there to say &quot;there&#39;s no real definition, <br/>\n </span></blockquote>we <br/>\n<blockquote><span title=\"ireply\"> &gt; can&#39;t <br/>\n&gt; &gt; tell you what it is, take your time and figure it out, you have a <br/>\n&gt; lifetime.&quot;  <br/>\n&gt; &gt; <br/>\n&gt; &gt; Sandra<br/>\n&gt; <br/>\n&gt; &lt;&lt;Sounds honest and true to me.&gt;&gt;<br/>\n&gt; <br/>\n&gt; Sounds cruel, to me, for people who are asked for help to <br/>\n </span></blockquote>say &quot;figure it out <br/>\n<blockquote><span title=\"ireply\"> &gt; on your own.&quot;<br/>\n<br/>\n </span></blockquote>There&#39;s a whole lot of territory between giving them no<br/>\nhelp at all and giving them step-by-step instructions.<br/>\n<br/>\nWhen I was pregnant with my third child, my midwife told<br/>\nme that she knew she&#39;d done a good job at a birth when the<br/>\nmother told her &quot;I did it all myself.  You might as well<br/>\nhave stayed home.&quot;<br/>\n<br/>\nThis lady works hard.  She helps women in all sorts of <br/>\npractical and emotional ways.  Her goal throughout,<br/>\nhowever, is to empower the woman so she can do her own<br/>\nbirth.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Probably what I&#39;m reading isn&#39;t what you meant to convey.<br/>\n<br/>\n </span></blockquote>I think, perhaps, that you&#39;re thinking that by rejecting<br/>\none pole, I&#39;m embracing the opposite pole.  There&#39;s usually<br/>\na whole lot of territory in between.  Black and white aren&#39;t<br/>\nthe only options.  We can use all the shades of gray between,<br/>\nand then there&#39;s the color palate.<br/>\n<br/>\nSo, please, don&#39;t assume that when I say:<br/>\n<br/>\n&lt;&lt;This seems to be shifting the argument from the merits of the case<br/>\n<blockquote><span title=\"ireply\"> &gt;to an appeal to authority.  I&#39;m allergic to argument from authority;<br/>\n&gt;it makes me break out in rebellion.&gt;&gt;<br/>\n<br/>\n </span></blockquote>I mean:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Too bad.  You&#39;ll follow people who haven&#39;t earned or been given any <br/>\n&gt;authority, just to avoid &quot;experts.&quot;  Sounds like in your judgment <br/>\n </span></blockquote>you&#39;ll give <br/>\n<blockquote><span title=\"ireply\"> &gt;more weight to those who know less.<br/>\n<br/>\n </span></blockquote>when there are so very many other options to choose from.<br/>\n<br/>\n--Heather</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: keeping unschooling free","postDate":"1012752544","msgId":4039,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZkLjEzMmU1YmQyLjI5OGViYWEwQGFvbC5jb20+"},"prevInTopic":4028,"nextInTopic":4059,"prevInTime":4038,"nextInTime":4040,"topicId":3965,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/3/02 12:50:58 AM, heather@madrone.com writes: ","messageBody":"<div id=\"ygrps-yiv-1757141335\">In a message dated 2/3/02 12:50:58 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:heather@...\">heather@...</a> writes:<br/>\n<br/>\n&lt;&lt; When we think things through for ourselves, we really own the <br/>\nknowledge that we eventually get.  &gt;&gt;<br/>\n<br/>\nWhere do you start, though?<br/>\n<br/>\nAnd some people are courageous leaders or pioneer explorers, and MOST people <br/>\nare not.<br/>\n<br/>\n&lt;&lt;&gt; But people who Do want to know about unschooling come to <br/>\nunschooling.com, and <br/>\n<blockquote><span title=\"ireply\"> &gt; they don&#39;t want people there to say &quot;there&#39;s no real definition, we <br/>\n </span></blockquote>can&#39;t <br/>\n<blockquote><span title=\"ireply\"> &gt; tell you what it is, take your time and figure it out, you have a <br/>\n </span></blockquote>lifetime.&quot;  <br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Sandra<br/>\n<br/>\n </span></blockquote>&lt;&lt;Sounds honest and true to me.&gt;&gt;<br/>\n<br/>\nSounds cruel, to me, for people who are asked for help to say &quot;figure it out <br/>\non your own.&quot;<br/>\n<br/>\nProbably what I&#39;m reading isn&#39;t what you meant to convey.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":748699,"authorName":"madrone95006","from":"&quot;madrone95006&quot; &lt;heather@...&gt;","profile":"madrone95006","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: keeping unschooling free","postDate":"1012722609","msgId":4028,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGEzaXEzaCtsYWRkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGFkLjE3OTYwOWY3LjI5OGUzMTc0QGFvbC5jb20+"},"prevInTopic":4026,"nextInTopic":4039,"prevInTime":4027,"nextInTime":4029,"topicId":3965,"numMessagesInTopic":0,"msgSnippet":"... unschooling.com, and ... can t ... lifetime. ... Sounds honest and true to me. I think that real change comes gradually, with a lot of thought and ","messageBody":"<div id=\"ygrps-yiv-1311574151\">--- In AlwaysLearning@y..., SandraDodd@a... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; But people who Do want to know about unschooling come to <br/>\n </span></blockquote>unschooling.com, and <br/>\n<blockquote><span title=\"ireply\"> &gt; they don&#39;t want people there to say &quot;there&#39;s no real definition, we <br/>\n </span></blockquote>can&#39;t <br/>\n<blockquote><span title=\"ireply\"> &gt; tell you what it is, take your time and figure it out, you have a <br/>\n </span></blockquote>lifetime.&quot;  <br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Sandra<br/>\n<br/>\n </span></blockquote>Sounds honest and true to me.<br/>\n<br/>\nI think that real change comes gradually, with a lot of thought and <br/>\nexperimentation.  I think that adults as well as children need to <br/>\nfind their own ways.  The sooner people start standing on their own <br/>\nfeet and thinking things through for themselves, the sooner they&#39;ll <br/>\nfind solutions that work for them.<br/>\n<br/>\nWhen we think things through for ourselves, we really own the <br/>\nknowledge that we eventually get.  It&#39;s ours in a way that no <br/>\nsecondhand knowledge can ever be.<br/>\n<br/>\nIf unschooling is good enough for kids, it ought to work pretty well <br/>\nfor adults, too.<br/>\n<br/>\n--hmm</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] re: keeping unschooling free","postDate":"1012717428","msgId":4026,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGFkLjE3OTYwOWY3LjI5OGUzMTc0QGFvbC5jb20+"},"prevInTopic":4021,"nextInTopic":4028,"prevInTime":4025,"nextInTime":4027,"topicId":3965,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/2/02 10:06:09 PM, heather@madrone.com writes: ","messageBody":"<div id=\"ygrps-yiv-2062440167\">In a message dated 2/2/02 10:06:09 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:heather@...\">heather@...</a> writes:<br/>\n<br/>\n&lt;&lt; I can&#39;t imagine how a parent could watch that and not step<br/>\nback, awed and humbled by how well it works. &gt;&gt;<br/>\n<br/>\nI wish I couldn&#39;t.  I wish I hadn&#39;t seen so much really harmful parenting, <br/>\njustified by tradition and religion, by parents who were not thinking, who <br/>\nconsidered children brats, sneaky, &quot;other.&quot;<br/>\n<br/>\n-=-Also, I&#39;m not sure that &quot;unschooling&quot; ought to be a goal in and of<br/>\nitself.  It&#39;s just a vehicle, and it&#39;s not for everyone.-=-<br/>\n<br/>\nSometimes parents are panicking and they NEED a vehicle to get them out of <br/>\nthe road, out of the wasteland, out of the swamp.<br/>\n<br/>\nIt&#39;s not for everyone.  Those whose kids are vacant-eyed or unimaginative or <br/>\ncynical (especially if they learned it from their parents&#39; shushing them, <br/>\ntelling them their ideas are dumb or unimportant, etc.) aren&#39;t prime <br/>\ncandidates.  <br/>\n<br/>\nHolly called, crying, for me to come get her from a sleepover.  Although she <br/>\nmet these kids at a homeschooling meeting, they cannot homeschool, and would <br/>\nnever be able to unschool, because things are boring and stupid at their <br/>\nhouse.  They promised swimming that didn&#39;t happen.  They promised food, and <br/>\nthat was forgotten.  The kids insulted and fought and her hostess went to <br/>\nsleep.  She called home, and has since then rented movies and a Nintendo <br/>\ngame, eaten a quesadilla made just for her, helped her dad make a fire, and <br/>\nis watching Saturday Night Live with him.  That replaced fighting over making <br/>\na fort with chairs and a blanket.<br/>\n<br/>\nI&#39;m rambling.<br/>\n<br/>\nBut people who Do want to know about unschooling come to unschooling.com, and <br/>\nthey don&#39;t want people there to say &quot;there&#39;s no real definition, we can&#39;t <br/>\ntell you what it is, take your time and figure it out, you have a lifetime.&quot;  <br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":748699,"authorName":"Heather Madrone","from":"Heather Madrone &lt;heather@...&gt;","profile":"madrone95006","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"[AlwaysLearning] re: keeping unschooling free","postDate":"1012712719","msgId":4021,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQuMi4yLjIwMDIwMjAyMjAxMjA3LjAwYjMzOWEwQG1haWwubWFkcm9uZS5jb20+","inReplyToHeader":"PGEzaWJscStqNmQzQGVHcm91cHMuY29tPg=="},"prevInTopic":4009,"nextInTopic":4026,"prevInTime":4020,"nextInTime":4022,"topicId":3965,"numMessagesInTopic":0,"msgSnippet":"... I m sure that many of my arguments have been brewing for 9 years or so.  Most of the people I m arguing with are probably not even on this list.  Quite a","messageBody":"<div id=\"ygrps-yiv-1532354982\">--- In AlwaysLearning@y..., Fetteroll &lt;fetteroll@e...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;on 2/2/02 12:52 PM, Heather Madrone at heather@m... wrote:<br/>\n&gt;<br/>\n&gt; &gt; Isn&#39;t the point of unschooling freedom?  How can<br/>\n&gt; &gt; you be free if you imprison yourself in doctrine?<br/>\n&gt;<br/>\n&gt;You made a lot of good points Heather! :-)<br/>\n&gt;<br/>\n&gt;But if you&#39;re certain that the posters here are saying the things you are <br/>\n&gt;arguing against, I&#39;d suggest you need to read more carefully without that<br/>\n&gt;assumption clouding your perception. Please ask people for clarification,<br/>\n&gt;but not with the assumptions you&#39;ve made. Read also the message boards at <br/>\n&gt;Unschooling.com to see how the posters express unschooling to newbies. <br/>\n&gt;Perhaps that will make things clearer.<br/>\n<br/>\n </span></blockquote>I&#39;m sure that many of my arguments have been brewing for 9 years or<br/>\nso.  Most of the people I&#39;m arguing with are probably not even on<br/>\nthis list.  Quite a few of them are earlier versions of myself.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;You seem to be assuming that defining something creates doctrine. I suppose<br/>\n&gt;if someone accepts that premise, then it becomes self-fulfilling!<br/>\n<br/>\n </span></blockquote>I love to define things.  I just haven&#39;t been able to come up with<br/>\na definition of unschooling that doesn&#39;t limit or mislead people.<br/>\nA lot of the arguments I&#39;ve seen about unschooling have been because<br/>\nterms like &quot;child-led learning&quot; have led people to believe that<br/>\nwe&#39;re asking children to recreate Western civilization from a pocket<br/>\nknife and some parachute silk.<br/>\n<br/>\nRecently, I&#39;ve encountered the Quaker idea that outward forms can<br/>\nbecome empty pretty quickly.  Humans tend to focus on the outward<br/>\nform instead of on the underlying essential reality that created<br/>\nthe form in the first place.  I&#39;m intrigued by this idea.<br/>\n<br/>\nThere&#39;s certainly plenty of Eastern and Western thought that supports<br/>\nthe idea the pinning something down with words tends to destroy it.<br/>\nTaoists and Zen Buddhists have something like this idea.  When we draw<br/>\na map, we sometimes forget that the map is not really the territory.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I can assure you that, being the highly anal retentive person I am, if I<br/>\n&gt;believed unschooling could be defined by a nicely formatted 12 point <br/>\n&gt;doctrine or some such, I would have come up with a list of must do&#39;s years <br/>\n&gt;ago so I wouldn&#39;t have to spend 1000+ hours each year explaining unschooling <br/>\n&gt;to people. ;-)<br/>\n<br/>\n </span></blockquote>I share your frustration.  Perhaps that&#39;s why I&#39;m trying to make<br/>\na virtue out of necessity.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Getting people to understand unschooling takes *lots* of words, *lots* of <br/>\n&gt;examples, *lots* of patient understanding to help them get their thinking <br/>\n&gt;from where it is to unschooling. We could list a bunch of &quot;truths&quot; to be <br/>\n&gt;accepted, but it would mean nothing. Being able to say children will read <br/>\n&gt;when they&#39;re ready isn&#39;t the same as understanding why that is so and why <br/>\n&gt;the standard belief that chldren must be taught is *not* so.<br/>\n<br/>\n </span></blockquote>I was so much more certain of these unschooling truths when I was<br/>\nonly unschooling one child.<br/>\n<br/>\nMost children, I agree, learn to read just fine on their own.  Some<br/>\nchildren, however, do need extra help.  I can no more deny that extra<br/>\nhelp to my child who needs it than I can deny my other children the<br/>\nability to fly on their own wings.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Perhaps you are naturally more evolved in the natural learning department <br/>\n&gt;than most people who come to unschooling. <br/>\n<br/>\n </span></blockquote>I was very fortunate, actually.  When my eldest was a baby, I hooked up<br/>\nwith a woman who had worked with Magda Gerber (a chief proponent of<br/>\nunschooling principles for young children).  I also live in an area<br/>\nwhere people have been unschooling since 1970.  I had lots of local<br/>\nmentors.<br/>\n<br/>\nBy the time we started unschooling for real, it was just an extension<br/>\nof what we&#39;d already been doing as parents.  The ideas of freedom<br/>\nand respect were already in place, ready to be extended into academia.<br/>\n<br/>\nMy oldest was also a born unschooler.  Get out of her way, and she<br/>\nis absolutely amazing.  She was really the one who convinced me that<br/>\nunschooling was the way to go.<br/>\n<br/>\nMy second child is different in many ways.  She&#39;s more of a social<br/>\nlearner.  She likes more adult-led activities and needs more hands-on<br/>\nteaching.  So I&#39;ve had to learn to meet her needs, too.<br/>\n<br/>\nMy third child is like my first.  He does best teaching himself.<br/>\nThe baby of the family seems to be more like #2.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Most people bring with them an <br/>\n&gt;enormous amount of baggage. It can&#39;t be shed just by embracing the <br/>\n&gt;unschooling philosphy. It can&#39;t even be shed by &quot;getting&quot; unschooling. It <br/>\n&gt;can take years for people to let go of their baggage. (That baggage so <br/>\n&gt;comforting!)<br/>\n<br/>\n </span></blockquote>I think it takes most of us a lifetime.<br/>\n<br/>\nMost of the people I know who&#39;ve started unschooling take a year or<br/>\ntwo to get going.  After that, it&#39;s fine-tuning.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;To shed that baggage, newbies do need something more clear than &quot;do what&#39;s<br/>\n&gt;best&quot; or &quot;listen to your chldren&quot;. Though those describe unschooling to <br/>\n&gt;unschoolers, they are inadequate to those who are still certain that some <br/>\n&gt;things need to be done to raise decent human beings. People need a huge <br/>\n&gt;amount of work to get to the point where they can understand that &quot;listen to <br/>\n&gt;your children&quot; means more than what those words say.<br/>\n<br/>\n </span></blockquote>Do you think that there is only one valid way to raise children?<br/>\n<br/>\nI think that people need to start where they are and take the next<br/>\nstep.  I&#39;m not sure that I know where they need to go.  I have a<br/>\nhard enough time figuring out where *I* need to go.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;You also seem to be assuming that defining unschooling limits it.<br/>\n<br/>\n </span></blockquote>It&#39;s not an assumption.  I&#39;ve seen people define unschooling in<br/>\nways that limit options.  I&#39;ve seen people (I&#39;ve even been one)<br/>\nwho try to take a definition of unschooling and use it in a<br/>\nprescriptive way.  If something doesn&#39;t fit the definition, they<br/>\nwon&#39;t do it.<br/>\n<br/>\nMy unschooling mentors (who have been at it for 30 years and are<br/>\nnow helping their kids raise their own unschooling families)<br/>\ndidn&#39;t give me any rules.  They simply said, &quot;Maybe it would<br/>\nwork for you to try this.&quot;  They dropped little hints to me<br/>\nwhen I was confused.  They trusted me to figure it out for<br/>\nmyself.  They also gave me a lot of appreciation for the path<br/>\nI was taking.  They were very gentle and brought me to unschooling<br/>\nby unschooling me.<br/>\n<br/>\nIt seems to me that, if you don&#39;t at some point get the essence<br/>\nof unschooling, all the words in the world won&#39;t make a difference.<br/>\nThe natural learning potential of human children is truly amazing.<br/>\nI can&#39;t imagine how a parent could watch that and not step<br/>\nback, awed and humbled by how well it works.<br/>\n<br/>\nGet a hit of that, and everything else follows naturally.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I see defining unschooling as giving people something to shoot for, a goal <br/>\n&gt;to reach. Though I think if we all could grow up without the mental baggage <br/>\n&gt;of what we&#39;re &quot;supposed&quot; to do, then we would all be able to listen to our <br/>\n&gt;children and give them what they need rather than what we parents think they <br/>\n&gt;need. In that case doing what&#39;s best for your family would look the same as <br/>\n&gt;unschooling (without the initial struggle to get it!)<br/>\n<br/>\n </span></blockquote>I don&#39;t know.  To some extent, I can see what you&#39;re saying (although<br/>\nI think examples are probably better than definitions).  I think, though,<br/>\nthat I&#39;d rather see unschooling unfold naturally in people&#39;s lives,<br/>\neven if it takes longer, than emerge from a struggle.<br/>\n<br/>\nAlso, I&#39;m not sure that &quot;unschooling&quot; ought to be a goal in and of<br/>\nitself.  It&#39;s just a vehicle, and it&#39;s not for everyone.<br/>\n<br/>\nHeather Madrone &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:heather@...\">heather@...</a>&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.madrone.com\">http://www.madrone.com</a><br/>\nHomeschooling:  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.madrone.com/Home-ed/homeschool.htm\">http://www.madrone.com/Home-ed/homeschool.htm</a><br/>\nThe Home-Ed List:  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.madrone.com/Home-ed/helist.html\">http://www.madrone.com/Home-ed/helist.html</a><br/>\n<br/>\nYou can lead a child to learning, but you can&#39;t make her think.</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] keeping unschooling free","postDate":"1012702298","msgId":4009,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM2LjVlNTYwNWQuMjk4ZGY2NWFAYW9sLmNvbT4="},"prevInTopic":4000,"nextInTopic":4021,"prevInTime":4008,"nextInTime":4010,"topicId":3965,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/2/02 5:57:15 PM, freeform@juno.com writes: ","messageBody":"<div id=\"ygrps-yiv-418078441\">In a message dated 2/2/02 5:57:15 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:freeform@...\">freeform@...</a> writes:<br/>\n<br/>\n&lt;&lt;  At first I<br/>\nfelt really stilted and awkward saying this stuff...<br/>\n...This may not have much to do with unschooling, but then again it may...&gt;&gt;<br/>\n<br/>\nI think it does.  <br/>\n<br/>\nWhen a family&#39;s going from &quot;Not until after dinner&quot; or &quot;clean your plate,&quot; to <br/>\n&quot;Sure, why not?&quot;  it has GOT to sound to them like they&#39;re in a sitcom at <br/>\nfirst, I think.<br/>\n<br/>\n&quot;Have all the candy you want&quot; a day or two after &quot;One piece of cake is enough <br/>\nfor one day&quot; might seem freakish.<br/>\n<br/>\nAnd the same with more academic stuff.  &quot;Do I have to write this by hand?&quot; <br/>\ncan be &quot;I&#39;ll write it for you,&quot; or &quot;No, use the computer,&quot; or &quot;just call <br/>\nthem&quot; or whatever, instead of &quot;If you can&#39;t write by hand you&#39;ll never be <br/>\nable to get a job.  Just DO it, right NOW.&quot;<br/>\n<br/>\nIf I say something like that my kids look at me and LAUGH right in my face.<br/>\n<br/>\nSometimes I try it just to see what it feels like.  But it&#39;s not the real <br/>\nfeeling, it&#39;s just a joke.<br/>\n<br/>\nThe other night Holly asked what if she didn&#39;t do something or other and I <br/>\nsaid she&#39;d get a big spanking, or some such.  She didn&#39;t think for one <br/>\nnano-second she was in danger of a big spanking.  <br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":2294225,"authorName":"freeform@juno.com","from":"freeform@...","profile":"freeform_ca","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] keeping unschooling free","postDate":"1012697183","msgId":4000,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIwMjAyLjE3NTk0NC4tMzc2Nzg5LjMuZnJlZWZvcm1AanVuby5jb20+"},"prevInTopic":3994,"nextInTopic":4009,"prevInTime":3999,"nextInTime":4001,"topicId":3965,"numMessagesInTopic":0,"msgSnippet":"On Sat, 02 Feb 2002 09:52:09 -0800 Heather Madrone  ... I wonder, though, if that s not just a stage in the whole process. I ll throw in","messageBody":"<div id=\"ygrps-yiv-25696787\">On Sat, 02 Feb 2002 09:52:09 -0800 Heather Madrone &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:heather@...\">heather@...</a>&gt;<br/>\nwrites:<br/>\n<blockquote><span title=\"ireply\"> &gt; Attempting to practice non-coercive parenting, however, made me<br/>\n&gt; a worse parent.  Focusing on coercion was like a centipede focusing <br/>\n&gt; on the action of each of his legs.  My attention was directed to <br/>\n&gt; too low a level, defining things as potential problems when there <br/>\n&gt; was nothing wrong with them.  Instead of looking to my children for <br/>\n&gt; what they needed and wanted, I looked to the philosophy for what I <br/>\n&gt; ought to do.<br/>\n<br/>\n </span></blockquote>I wonder, though, if that&#39;s not just a stage in the whole process. I&#39;ll<br/>\nthrow in soccer again... Cacie has been trying to improve her drop-kicks.<br/>\nShe had been doing it one way, and it worked sorta well and sometimes<br/>\nreally well. Last week, one of her coaches showed her a different way to<br/>\nhold the ball, so that it sort of fell onto her foot rather than being<br/>\nkicked out of her hands. At first, it was really awkward. Her kicks were<br/>\nlousy, and a lot of the time she missed the ball altogether. Clearly, she<br/>\nwas a &quot;worse kicker&quot; than she had been before she tried to integrate this<br/>\nnew technique. Plus, she said it &quot;felt wrong&quot;, it wasn&#39;t how she was used<br/>\nto doing it, she was thinking so hard about how she dropped the ball that<br/>\nshe couldn&#39;t think about kicking it.<br/>\n<br/>\nAs she kept practicing, however (and as I bit my tongue really hard to<br/>\nkeep from giving advice, because I knew she was near the end of her<br/>\nfrustration limit, and any time I give advice at that point it knocks her<br/>\nover the edge), she would occasionally get off a really good kick,<br/>\nfarther than she&#39;d ever kicked before.  It was those moments that made<br/>\nher stick with the process, that and seeing Coach Kyle kick the ball 3/4<br/>\nof the way down the field... and she is a better kicker now that she&#39;s<br/>\nintegrated the technique he taught her.<br/>\n<br/>\nGranted, children are not soccer balls. Still, I think people often are<br/>\nused to focusing their attention on one aspect of a process and ignoring<br/>\nother aspects of that same process, and learning to focus on those other<br/>\naspects does feel awkward at first, we have to focus on the mechanics of<br/>\nsomething we were doing automatically. I don&#39;t think, though, that<br/>\nbecause it feels awkward and wrong necessarily means that it is wrong...<br/>\nsometimes it means that it&#39;s new, and different.<br/>\n<br/>\nThere are a lot of aspects of parenting that didn&#39;t come naturally to me.<br/>\nI used to have a really hard time when Cacie would tell me about<br/>\nsomething that was making her unhappy, or upset, because I always felt<br/>\nlike I had to &quot;fix it&quot;. That&#39;s an impossible role, and we were both<br/>\npretty frustrated for a while. Gradually, I started watching how a friend<br/>\nresponded to similar situations with her daughter, who was around Cacie&#39;s<br/>\nage and similarly prone to intense emotions. I literally memorized some<br/>\nof her lines and used them, stuff like &quot;I can see that you&#39;re really<br/>\nupset about that&quot; and &quot;I&#39;m so sorry that happened to you&quot;. They were<br/>\ntrue, first off, and they seemed to help, her daughter often responded by<br/>\ntalking more about it, and eventually seemed to feel better. At first I<br/>\nfelt really stilted and awkward saying this stuff, I really wanted to<br/>\nsolve it, come up with some things she could do or say... but I didn&#39;t,<br/>\nand just listening and empathizing worked *much* better. Cacie responded<br/>\nby talking about it more instead of screaming at me, and then she often<br/>\nfigured out her own solution. It was Really Cool, but it felt Really<br/>\nWeird to start with. Later, I could sort of tap into my own mind and<br/>\ninstincts and think of things to say on my own, but in the beginning it<br/>\nwas very rehearsed. <br/>\n<br/>\nThis may not have much to do with unschooling, but then again it may...<br/>\n<br/>\nDar<br/>\n________________________________________________________________<br/>\nGET INTERNET ACCESS FROM JUNO!<br/>\nJuno offers FREE or PREMIUM Internet access for less!<br/>\nJoin Juno today!  For your FREE software, visit:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://dl.www.juno.com/get/web/.\">http://dl.www.juno.com/get/web/.</a></div>","specialLinks":[]},{"userId":94797851,"authorName":"Karin","from":"&quot;Karin&quot; &lt;curtkar@...&gt;","profile":"kc85022","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] keeping unschooling free","postDate":"1012693920","msgId":3990,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMjIwMWMxYWM0NCQ5YjllOTcyMCQ2NDAwYThjMEBnb2R6aWxsYT4=","referencesHeader":"PDIwMDIwMjAyMjIzNzA3LjgxNTY1LnFtYWlsQHdlYjE0MzExLm1haWwueWFob28uY29tPg=="},"prevInTopic":3988,"nextInTopic":3991,"prevInTime":3989,"nextInTime":3991,"topicId":3965,"numMessagesInTopic":0,"msgSnippet":"... Right on! No need to get dazed and confused. Karin [Non-text portions of this message have been removed]","messageBody":"<div id=\"ygrps-yiv-1230588821\"><blockquote><span title=\"ireply\">&gt;&gt;I never liked &quot;child-led&quot;<br/>\n&gt;&gt; because it causes people to <br/>\n&gt;&gt; seem to think there are two ways:  parent-led or<br/>\n&gt;&gt; child-led.  If it&#39;s just <br/>\n&gt;&gt; life, nobody has to lead or follow.<br/>\n<br/>\n&gt;Just get the led out!<br/>\n<br/>\n&gt;SOS<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Right on! No need to get dazed and confused.<br/>\n<br/>\nKarin<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] keeping unschooling free","postDate":"1012693678","msgId":3994,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzLjVmNTIxMGMuMjk4ZGQ0YWVAYW9sLmNvbT4="},"prevInTopic":3992,"nextInTopic":4000,"prevInTime":3993,"nextInTime":3995,"topicId":3965,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/2/02 4:33:28 PM, homeschoolmd@yahoo.com writes: ","messageBody":"<div id=\"ygrps-yiv-1502420132\">In a message dated 2/2/02 4:33:28 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:homeschoolmd@...\">homeschoolmd@...</a> writes:<br/>\n<br/>\n&lt;&lt;  This line of thought could open up a can of worms for some because they <br/>\nmay start questioning whether we are labeling time spent as good or bad.  &gt;&gt;<br/>\n<br/>\nMaybe just &quot;better&quot; or &quot;worse,&quot; or &quot;closer to the goal,&quot; or not.<br/>\n<br/>\nI&#39;ve heard arguments that there is no such thing as &quot;quality time,&quot; just <br/>\ntime.   I don&#39;t think so.  I know it&#39;s part of the rhetoric of child custody <br/>\nbattles, but even leaving kids out of it, my husband can be home all weekend <br/>\nand we can do  nothing special, but we&#39;re friendly and comfortable, and <br/>\nrelaxed, and we smile at each other and touch as we pass by.  That&#39;s nice.  <br/>\nBut it&#39;s not the same, even, as us sitting and doing something together, or <br/>\neven walking over to the credit union or video store together, cooking <br/>\ntogether, telling stories--something that gives us more shared memories, that <br/>\nbuilds our &quot;Sharing&quot; or more than just the physical address.<br/>\n<br/>\nThe level and duration of attention we can give friends or kids or projects <br/>\nisn&#39;t just &quot;quantity&quot; or &quot;quality&quot;--there are graduations and values.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":84135975,"authorName":"Pat Cald...","from":"&quot;Pat Cald...&quot; &lt;homeschoolmd@...&gt;","profile":"homeschoolmd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] keeping unschooling free","postDate":"1012692654","msgId":3992,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNjkwMWMxYWM0MSRhOTU4YjdlMCQ2NDAxYThjMEBvZmZpY2U+","referencesHeader":"PDQwLjE4OGZiZTIyLjI5OGRjOTFhQGFvbC5jb20+"},"prevInTopic":3991,"nextInTopic":3994,"prevInTime":3991,"nextInTime":3993,"topicId":3965,"numMessagesInTopic":0,"msgSnippet":"From: SandraDodd@aol.com ","messageBody":"<div id=\"ygrps-yiv-356825324\">From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> <br/>\n&lt;&lt;I can ask my kids what they want to do today? I can look for signs of <br/>\ninterest and find things they would like.  I can buy stuff, I can organize <br/>\nstuff, I can display stuff.  Does this make learning a priority?&gt;&gt;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;This is a hard question or I misunderstand it, or possibly both and all.<br/>\n<br/>\n&gt;&quot;Priorities,&quot; for me, have to do with the principles used when decisions have <br/>\n&gt;to be made.   Some people like new furniture and new cars and matching <br/>\n&gt;dishes, and those are priority considerations.  Our family doesn&#39;t consider <br/>\n&gt;those things in the top hundred.  <br/>\n<br/>\n </span></blockquote>Yes, I have made learning materials a financial priority.  I used to spend my extra money on home decorating stuff. Everything on the walls had to match and be balanced. Book shelves were never used for books because we would only get books if they were in the library.  Things are different now.  We had to go buy more book shelves.  Kids projects and art are on display.  The extra money is spent on books, art supplies, a museum membership, an 8&quot; telescope (my dh has become an amateur astronomer), more computers and enrichment stuff.  We never used to go on vacations so this is an area we need to start saving for, you know - see the world.  <br/>\n<br/>\nThere are also time priorities.  This, I think, will evolve as our learning interests begin to expand.  This line of thought could open up a can of worms for some because they may start questioning whether we are labeling time spent as good or bad.  But I think I know what you mean.  It is more of an attitude.<br/>\n<br/>\nPat<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] keeping unschooling free","postDate":"1012690714","msgId":3991,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQwLjE4OGZiZTIyLjI5OGRjOTFhQGFvbC5jb20+"},"prevInTopic":3990,"nextInTopic":3992,"prevInTime":3990,"nextInTime":3992,"topicId":3965,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/2/02 3:18:23 PM, homeschoolmd@yahoo.com writes: If the parents know what is and what isn t leading to idea-getting and the ... ","messageBody":"<div id=\"ygrps-yiv-271419762\">In a message dated 2/2/02 3:18:23 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:homeschoolmd@...\">homeschoolmd@...</a> writes:<br/>\n<br/>\n&lt;&lt; &gt;If the parents know what is and what isn&#39;t leading to idea-getting and <br/>\nthe <br/>\n<blockquote><span title=\"ireply\"> &gt;happy gathering of experience and information, they can live their lives so <br/>\n&gt;that those things are encouraged, and so that learning is a priority.<br/>\n<br/>\n </span></blockquote>&lt;&lt;This stuff is over my head. &gt;&gt;<br/>\n<br/>\nMaybe I just need to write better!<br/>\n<br/>\n&lt;&lt;I have a simple question.  Can a parent make learning a priority by <br/>\nremoving obstacles that stand in its way?  &gt;&gt;<br/>\n<br/>\nNot JUST by that, I think.  (Unless maybe &quot;removing obstacles&quot; would include <br/>\nthe obstacles of no input, no confidence, etc...)<br/>\n<br/>\n&lt;&lt;I can ask my kids what they want to do today? I can look for signs of <br/>\ninterest and find things they would like.  I can buy stuff, I can organize <br/>\nstuff, I can display stuff.  Does this make learning a priority?&gt;&gt;<br/>\n<br/>\nThis is a hard question or I misunderstand it, or possibly both and all.<br/>\n<br/>\n&quot;Priorities,&quot; for me, have to do with the principles used when decisions have <br/>\nto be made.   Some people like new furniture and new cars and matching <br/>\ndishes, and those are priority considerations.  Our family doesn&#39;t consider <br/>\nthose things in the top hundred.  <br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":69247285,"authorName":"Sharon Rudd","from":"Sharon Rudd &lt;bearspawprint@...&gt;","profile":"bearspawprint","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] keeping unschooling free","postDate":"1012689427","msgId":3988,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIwMjAyMjIzNzA3LjgxNTY1LnFtYWlsQHdlYjE0MzExLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PGM2LjVlNGIwYzQuMjk4ZGJhMjFAYW9sLmNvbT4="},"prevInTopic":3986,"nextInTopic":3990,"prevInTime":3987,"nextInTime":3989,"topicId":3965,"numMessagesInTopic":0,"msgSnippet":"I never liked child-led ... Just get the led out! SOS __________________________________________________ Do You Yahoo!? Great stuff seeking new owners in","messageBody":"<div id=\"ygrps-yiv-503868286\">I never liked &quot;child-led&quot;<br/>\n<blockquote><span title=\"ireply\"> &gt; because it causes people to <br/>\n&gt; seem to think there are two ways:  parent-led or<br/>\n&gt; child-led.  If it&#39;s just <br/>\n&gt; life, nobody has to lead or follow.<br/>\n<br/>\n </span></blockquote>Just get the led out!<br/>\n<br/>\nSOS<br/>\n<br/>\n__________________________________________________<br/>\nDo You Yahoo!?<br/>\nGreat stuff seeking new owners in Yahoo! Auctions! <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://auctions.yahoo.com\">http://auctions.yahoo.com</a></div>","specialLinks":[]},{"userId":84135975,"authorName":"Pat Cald...","from":"&quot;Pat Cald...&quot; &lt;homeschoolmd@...&gt;","profile":"homeschoolmd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] keeping unschooling free","postDate":"1012688170","msgId":3986,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwM2IwMWMxYWMzNyQzODg5ODU4MCQ2NDAxYThjMEBvZmZpY2U+","referencesHeader":"PGM2LjVlNGIwYzQuMjk4ZGJhMjFAYW9sLmNvbT4="},"prevInTopic":3984,"nextInTopic":3988,"prevInTime":3985,"nextInTime":3987,"topicId":3965,"numMessagesInTopic":0,"msgSnippet":"From: SandraDodd@aol.com ... This stuff is over my head. I have a simple question.  Can a parent make learning a priority by removing obstacles that stand in","messageBody":"<div id=\"ygrps-yiv-240120053\">From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> <br/>\n<blockquote><span title=\"ireply\"> &gt;If the parents know what is and what isn&#39;t leading to idea-getting and the <br/>\n&gt;happy gathering of experience and information, they can live their lives so <br/>\n&gt;that those things are encouraged, and so that learning is a priority.<br/>\n<br/>\n </span></blockquote>This stuff is over my head.<br/>\n<br/>\nI have a simple question.  Can a parent make learning a priority by removing obstacles that stand in its way?  <br/>\n<br/>\nI can remove obstacles.<br/>\n<br/>\nI can ask my kids what they want to do today? I can look for signs of interest and find things they would like.  I can buy stuff, I can organize stuff, I can display stuff.  Does this make learning a priority?<br/>\n<br/>\nPat   <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] keeping unschooling free","postDate":"1012686881","msgId":3984,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM2LjVlNGIwYzQuMjk4ZGJhMjFAYW9sLmNvbT4="},"prevInTopic":3978,"nextInTopic":3986,"prevInTime":3983,"nextInTime":3985,"topicId":3965,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/2/02 11:22:14 AM, heather@madrone.com writes: ","messageBody":"<div id=\"ygrps-yiv-460723637\">In a message dated 2/2/02 11:22:14 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:heather@...\">heather@...</a> writes:<br/>\n<br/>\n&lt;&lt; Holt wasn&#39;t a big help.  Although he described unschooling<br/>\na lot, he never defined it.  He had a lot of educational<br/>\nideas,  &gt;&gt;<br/>\n<br/>\nI didn&#39;t have any definitions.  I had two real-life families to watch, and <br/>\nHolt&#39;s descriptions and educational ideas.<br/>\n<br/>\nIf the parents know what is and what isn&#39;t leading to idea-getting and the <br/>\nhappy gathering of experience and information, they can live their lives so <br/>\nthat those things are encouraged, and so that learning is a priority.<br/>\n<br/>\n&lt;In the early days, I defined &quot;unschooling&quot; as &quot;child-led learning.&quot;<br/>\n&quot;Child-led learning&quot; works pretty well as a definition, as long as<br/>\nyou don&#39;t take it too seriously.  It&#39;s easy, however, to carry the<br/>\nconcept of child-led to the point where it hampers the contribution<br/>\nof parents.&gt;&gt;<br/>\n<br/>\nI agree with that.  I never liked &quot;child-led&quot; because it causes people to <br/>\nseem to think there are two ways:  parent-led or child-led.  If it&#39;s just <br/>\nlife, nobody has to lead or follow.<br/>\n<br/>\n-=- Our human biology<br/>\nhas fitted us to parent our children.  Our instincts and inner<br/>\nguides can take us much farther than any creed.-=-<br/>\n<br/>\nThis is inspiring, but I look around me to many examples of very bad <br/>\nparenting.  Today&#39;s paper (which I rarely buy, but I needed an ad) had a cool <br/>\narticle by someone I know well!  When she said &quot;my grandchildren,&quot; I  knew <br/>\nthem personally.  I was reading it to Holly and said &quot;that&#39;s Kyra and <br/>\nKatrina!&quot;<br/>\n<br/>\nBut their family&#39;s stable happiness was on an inside page.  <br/>\n<br/>\nThe cover, A2 and A4 were given over to review and analysis of the beating <br/>\ndeath of a six year old here last year.  His mom&#39;s boyfriend was trying to <br/>\nget the kid to take a bath, just the way the &quot;dad&quot; (as he made the boyr shit.<br/>\n<br/>\nThe articles had lots about statistics of the battered, how many of them <br/>\n(over 60% or so in ever instance or particular cited in a long article) had <br/>\nthemselves been hit or neglected as children.<br/>\n<br/>\nLots of people do want help with their parenting, and they come and ask for <br/>\nhelp.  <br/>\n<br/>\nNeither on AOL nor on unschooling.com have I ever seen people press for or <br/>\nsettle on one single definition, but rather five or ten will be pooled <br/>\ntogether and people can connect the dots as they will.  <br/>\n<br/>\nIt seems that everything peole try to define has some solid unquestionable <br/>\nexamples, and lots of acceptable ones, and some on the edges that people <br/>\ndebate.  If a certain song is  not quite jazz and not quite blues, there&#39;s <br/>\nsome debate.  But that doesn&#39;t mean that there are no examples that all <br/>\nlisteners would identify as one or the other.    Just because not every <br/>\nexample has to be defined is true doesn&#39;t mean there shouldn&#39;t be some <br/>\ngeneral definitions.  It&#39;s  not important to me personally whether a song is <br/>\nrock&#39;n&#39;roll or rock-a-billy or pop, but if for those working in those fields, <br/>\nthey know what instrumentation, drumming variations and rhythms will make the <br/>\ndifference.<br/>\n<br/>\nJust because some people don&#39;t care doesn&#39;t mean nobody should care.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] keeping unschooling free","postDate":"1012685475","msgId":3978,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI4ODFDNEQzLjREOTAlZmV0dGVyb2xsQGVhcnRobGluay5uZXQ+","inReplyToHeader":"PDQuMi4yLjIwMDIwMjAyMDk1MTI3LjAwYjIxNmEwQG1haWwubWFkcm9uZS5jb20+"},"prevInTopic":3965,"nextInTopic":3984,"prevInTime":3977,"nextInTime":3979,"topicId":3965,"numMessagesInTopic":0,"msgSnippet":"... You made a lot of good points Heather! :-) But if you re certain that the posters here are saying the things you are arguing against, I d suggest you need","messageBody":"<div id=\"ygrps-yiv-823902336\">on 2/2/02 12:52 PM, Heather Madrone at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:heather@...\">heather@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Isn&#39;t the point of unschooling freedom?  How can<br/>\n&gt; you be free if you imprison yourself in doctrine?<br/>\n<br/>\n </span></blockquote>You made a lot of good points Heather! :-)<br/>\n<br/>\nBut if you&#39;re certain that the posters here are saying the things you are<br/>\narguing against, I&#39;d suggest you need to read more carefully without that<br/>\nassumption clouding your perception. Please ask people for clarification,<br/>\nbut not with the assumptions you&#39;ve made. Read also the message boards at<br/>\nUnschooling.com to see how the posters express unschooling to newbies.<br/>\nPerhaps that will make things clearer.<br/>\n<br/>\nYou seem to be assuming that defining something creates doctrine. I suppose<br/>\nif someone accepts that premise, then it becomes self-fulfilling!<br/>\n<br/>\nI can assure you that, being the highly anal retentive person I am, if I<br/>\nbelieved unschooling could be defined by a nicely formatted 12 point<br/>\ndoctrine or some such, I would have come up with a list of must do&#39;s years<br/>\nago so I wouldn&#39;t have to spend 1000+ hours each year explaining unschooling<br/>\nto people. ;-)<br/>\n<br/>\nGetting people to understand unschooling takes *lots* of words, *lots* of<br/>\nexamples, *lots* of patient understanding to help them get their thinking<br/>\nfrom where it is to unschooling. We could list a bunch of &quot;truths&quot; to be<br/>\naccepted, but it would mean nothing. Being able to say children will read<br/>\nwhen they&#39;re ready isn&#39;t the same as understanding why that is so and why<br/>\nthe standard belief that chldren must be taught is *not* so.<br/>\n<br/>\nPerhaps you are naturally more evolved in the natural learning department<br/>\nthan most people who come to unschooling. Most people bring with them an<br/>\nenormous amount of baggage. It can&#39;t be shed just by embracing the<br/>\nunschooling philosphy. It can&#39;t even be shed by &quot;getting&quot; unschooling. It<br/>\ncan take years for people to let go of their baggage. (That baggage so<br/>\ncomforting!)<br/>\n<br/>\nTo shed that baggage, newbies do need something more clear than &quot;do what&#39;s<br/>\nbest&quot; or &quot;listen to your chldren&quot;. Though those describe unschooling to<br/>\nunschoolers, they are inadequate to those who are still certain that some<br/>\nthings need to be done to raise decent human beings. People need a huge<br/>\namount of work to get to the point where they can understand that &quot;listen to<br/>\nyour children&quot; means more than what those words say.<br/>\n<br/>\nYou also seem to be assuming that defining unschooling limits it.<br/>\n<br/>\nI see defining unschooling as giving people something to shoot for, a goal<br/>\nto reach. Though I think if we all could grow up without the mental baggage<br/>\nof what we&#39;re &quot;supposed&quot; to do, then we would all be able to listen to our<br/>\nchildren and give them what they need rather than what we parents think they<br/>\nneed. In that case doing what&#39;s best for your family would look the same as<br/>\nunschooling (without the initial struggle to get it!)<br/>\n<br/>\nIf people are assuming that unschooling means hands off, or no adult<br/>\ndirected activities, then they haven&#39;t hung around the unschooling forum or<br/>\nlist for long! I&#39;ve heard of such people -- I&#39;ve heard of feral children<br/>\ntoo! -- but they didn&#39;t get the idea from us.<br/>\n<br/>\nSome here are noncoercive parents, some less coercive, some less coercive<br/>\nthan they once were because of debates ;-). But if you want to argue that<br/>\nSarah Lawrence&#39;s brand of Taking Children Seriously and unschooling are not<br/>\nsynonomous there may be a handful here (if!) to argue with but you won&#39;t be<br/>\nable to engage even a goodly portion of the list in that debate.<br/>\n<br/>\nJoyce <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":748699,"authorName":"Heather Madrone","from":"Heather Madrone &lt;heather@...&gt;","profile":"madrone95006","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"keeping unschooling free","postDate":"1012672329","msgId":3965,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQuMi4yLjIwMDIwMjAyMDk1MTI3LjAwYjIxNmEwQG1haWwubWFkcm9uZS5jb20+"},"prevInTopic":0,"nextInTopic":3978,"prevInTime":3964,"nextInTime":3966,"topicId":3965,"numMessagesInTopic":0,"msgSnippet":"When we first started homeschooling, the unschooling concept intrigued me.  I grappled with it and discussed it and tried to figure out what it meant and what","messageBody":"<div id=\"ygrps-yiv-190501414\">When we first started homeschooling, the unschooling concept<br/>\nintrigued me.  I grappled with it and discussed it and tried<br/>\nto figure out what it meant and what it didn&#39;t mean.<br/>\n<br/>\nHolt wasn&#39;t a big help.  Although he described unschooling<br/>\na lot, he never defined it.  He had a lot of educational<br/>\nideas, but he didn&#39;t see himself as the inventor of unschooling.<br/>\nHe was more of a cheerleader, describing all the wonderful<br/>\nways in which children could learn outside of school.<br/>\n<br/>\nAfter a few years, I had enough of a grasp of unschooling that<br/>\nI didn&#39;t need to grapple anymore.  I could just do it.  Although<br/>\nI continued to refine my idea of unschooling, I no longer had<br/>\nany burning desire to pin it down.  It was far better just to<br/>\nenjoy being with my kids.<br/>\n<br/>\nIt bewildered me then to see how people wanted to narrow the<br/>\nconcept of unschooling.  Why, I wondered, get out of the school<br/>\nbox just to build yourself another one that is just as rigid<br/>\nand confining?  Isn&#39;t the point of unschooling freedom?  How can<br/>\nyou be free if you imprison yourself in doctrine?<br/>\n<br/>\nIn the early days, I defined &quot;unschooling&quot; as &quot;child-led learning.&quot;<br/>\n&quot;Child-led learning&quot; works pretty well as a definition, as long as<br/>\nyou don&#39;t take it too seriously.  It&#39;s easy, however, to carry the<br/>\nconcept of child-led to the point where it hampers the contribution<br/>\nof parents.<br/>\n<br/>\nAs an example, I was in a chocolate mood yesterday.  I baked some<br/>\nchocolate chip cupcakes.  When I popped them in the oven, I<br/>\nrealized I was practicing parent-led eating.  The children, led<br/>\nby the scent of baking cupcakes, would eat the physical manifestations<br/>\nof an idea conceived of and executed by me.<br/>\n<br/>\nMost unschoolers won&#39;t carry the child-led doctrine into food.<br/>\nWhen it comes to education, however, parents often think that <br/>\nthere&#39;s something wrong with putting themselves into the mix.  <br/>\nParents ought not to lead, or, indeed, even influence their <br/>\nchildren&#39;s educations.<br/>\n<br/>\nIf I look to my children instead of the definition, however,<br/>\nI see that they often enjoy my contributions to their education.<br/>\nMoreover, because I generally respect their autonomy, they can<br/>\ntell me when they want me to back off and let them do things for<br/>\nthemselves.  They can tell me when my ideas don&#39;t work for them.<br/>\n<br/>\nThe children often lead one another into educational experiences.<br/>\nOne child initiates an activity and the other follow.  Children<br/>\ndon&#39;t mind following a person with a good idea, as long as the<br/>\nleader is going somewhere they want to go.<br/>\n<br/>\n&quot;Child-led learning,&quot; then, while a good start, is not enough in<br/>\nand of itself to stand as a whole educational philosophy.  It is<br/>\nan important part of unschooling, but it is not, in itself,<br/>\nunschooling.<br/>\n<br/>\nOther people have attempted to define &quot;unschooling&quot; as &quot;non-coercive.&quot;<br/>\nThis approach has real appeal, as &quot;non-coercion&quot; sounds like it<br/>\nwould map pretty well to &quot;freedom.&quot;<br/>\n<br/>\nAttempting to practice non-coercive parenting, however, made me<br/>\na worse parent.  Focusing on coercion was like a centipede focusing <br/>\non the action of each of his legs.  My attention was directed to <br/>\ntoo low a level, defining things as potential problems when there <br/>\nwas nothing wrong with them.  Instead of looking to my children for <br/>\nwhat they needed and wanted, I looked to the philosophy for what I <br/>\nought to do.<br/>\n<br/>\nOver time, I realized that my children didn&#39;t mind many of the<br/>\nthings that folks called coercive.  They minded other things,<br/>\nsome of which were not coercive at all.  Moreover, some of the<br/>\nthings labeled &quot;coercive&quot; seemed to help our family run more<br/>\nsmoothly and live more happily.<br/>\n<br/>\nMeanwhile, we&#39;d figured out a sort of system that, while it might<br/>\nnot map to anyone&#39;s philosophical ideal of unschooling, worked<br/>\npretty well for us.  Basically, this involved tossing out most of<br/>\nthe philosophy and focusing on our family&#39;s needs.  Instead of<br/>\nworrying about what I shouldn&#39;t do, I often found myself thinking<br/>\nof ways to help the children get and do what they wanted to do.<br/>\nIf everyone was happy, I assumed everything was fine.  If someone<br/>\nwasn&#39;t happy, we&#39;d work together to solve their problem.<br/>\n<br/>\n&quot;If it ain&#39;t broke, don&#39;t fix it.&quot;  My programmer&#39;s mind had a<br/>\nhard time accepting this maxim.  I wanted to probe beneath the<br/>\nsurface, to fix problems that hadn&#39;t yet manifested themselves.<br/>\n<br/>\nHuman beings are more than glorified collections of software.<br/>\nOur lives are organic processes that do not run by simple,<br/>\nmechanistic rules.  We are wondrously complex beings who grow <br/>\nbetter in a world that allows time and space for mysterious<br/>\nprocesses that work beneath the surface.  Too much analysis<br/>\ncan get in the way of living our lives.<br/>\n<br/>\nA few years back, I noticed that Holt never tried to prescribe<br/>\nanything to homeschoolers.  He described examples of unschooling,<br/>\nbut he never tried to pin it down.  <br/>\n<br/>\nI further realized that there is nothing new or special about<br/>\nunschooling.  Unschooling is just the way most human children<br/>\nhave been raised throughout human history.<br/>\n<br/>\nWhat I want now is a Quaker view of unschooling, one that lives<br/>\noutside of all boxes.  Keep unschooling undefined, like Euclid&#39;s<br/>\npoint or the Inner Light.  Describe unschooling all you want,<br/>\nbut don&#39;t create an unschooling doctrine.<br/>\n<br/>\nDoctrine kills.  The only time you can pin something down is <br/>\nwhen it has stopped moving and growing, when it is dead.  In<br/>\nthe course of defining doctrine, we kill the very thing that<br/>\nwe&#39;re trying to describe.<br/>\n<br/>\nBetter to let unschooling live free, growing and changing and<br/>\nreaching toward the heights of the human soul.  Better to feel<br/>\nunschooling in our own lives, and in our children&#39;s eyes.<br/>\nBetter to turn inward, to tap our inner wisdom and ask it what <br/>\nwe ought to do.  Better to look to our children and learn from<br/>\nthem how best to raise them.<br/>\n<br/>\nWe don&#39;t need ministers, teachers, or experts.  Our human biology<br/>\nhas fitted us to parent our children.  Our instincts and inner<br/>\nguides can take us much farther than any creed.<br/>\n<br/>\nDon&#39;t listen to me.  I&#39;m a person with my own strengths and<br/>\nchallenges, my own agenda, my own blind spots.  Look in your<br/>\nown heart, and see your path written there.  Listen to your<br/>\nchildren and hear what they&#39;re trying to say.<br/>\n<br/>\nKeep unschooling free to work its magic in your life.<br/>\n<br/>\nHeather Madrone &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:heather@...\">heather@...</a>&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.madrone.com\">http://www.madrone.com</a><br/>\nHomeschooling:  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.madrone.com/Home-ed/homeschool.htm\">http://www.madrone.com/Home-ed/homeschool.htm</a><br/>\nThe Home-Ed List:  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.madrone.com/Home-ed/helist.html\">http://www.madrone.com/Home-ed/helist.html</a><br/>\n<br/>\nYou can lead a child to learning, but you can&#39;t make her think.</div>","specialLinks":[]}],"prevTopicId":4395,"nextTopicId":3884}}