{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Bridget E Coffman","from":"Bridget E Coffman &lt;rumpleteasermom@...&gt;","profile":"rumpleteasermom","replyTo":"LIST","senderId":"ao-NXsRdg1OCK8K4IDG9Atix2QTglqtbAcsvZmRn5vSWQs_qnDJoZ4nstD93hDzP-a627o81GU6_gPaDHWdOFJrAc2Tyjttvu45sbMYDLZa2awI","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom]Allergies WAS Deschooling--TV and Video Limits","postDate":"1005753376","msgId":27698,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDExMTE0LjExMDYzNC4tNTg3ODQzLjAucnVtcGxldGVhc2VybW9tQGp1bm8uY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":27697,"nextInTime":27699,"topicId":27698,"numMessagesInTopic":0,"msgSnippet":"Allison, Good for you for figuring it out - and helping him to! My son is allergic to dyes and some preservatives.  The initial symptoms are behavioural but if","messageBody":"<div id=\"ygrps-yiv-768072408\">Allison,<br/>\n<br/>\nGood for you for figuring it out - and helping him to!<br/>\n<br/>\nMy son is allergic to dyes and some preservatives.  The initial symptoms<br/>\nare behavioural but if there is continued exposure he gets rashes and<br/>\nasthma.  He also has a problem with wheat.  The terms allergy and<br/>\nsensitivity are interchangeable in my mind and the mind of the old man<br/>\nPhysician we used to see.  Not so much in the minds of these newer<br/>\n&quot;upstart docs&quot; these days.  But whatever you call it the symptons are the<br/>\nsame.  When he eats wheat, he has severe intestinal problems.  Bloating,<br/>\nloss of bowel control combined with constipation (which is possible, I<br/>\nnever would have believed it if I hadn&#39;t seen it - over and over and<br/>\nover), upset stomach, gas, gas, and more gas, etc.  We have restricted<br/>\nhis diet for about two years now and if no caring person gave him a<br/>\n&quot;little treat&#39; because we are so mean to him, he was for the most part,<br/>\nfine.  He is nine now though and I want him to assume more of the<br/>\nresponsibility for food choices so I started letting him cheat.  A lot. <br/>\nHe was miserable.  I sat him down and explained why he is sick and we<br/>\nwent over what he had been eating.  He seems to have gotten it but I know<br/>\nfrom experience that we will have to go through the cycle several more<br/>\ntimes before he really gets it.<br/>\nI&#39;ve been through it before with middle daughter and milk and with older<br/>\ndaughter and corn.  I control (and yes, I do believe that a three year<br/>\nold may need some parental control in this issue) it long enough for them<br/>\nto feel good (or get old enough to handle it) then I put the<br/>\nresponsibility on them, because I won&#39;t be here forever.  &#39;Old enough&#39;<br/>\nwas different for each one.  Jenni was ready at 5, Rachel was never<br/>\nreally in my complete control and never will be, but I stopped trying to<br/>\nget her to listen at about 9, and Wyndham is 9 and just starting to get<br/>\nit.<br/>\nOh, BTW - I&#39;ve been though it myself with several substances so I do know<br/>\nwhat it is like to have to watch others eating something you can&#39;t have<br/>\nand really like.  <br/>\nOne thing you can do to help the diet go over better - find a good<br/>\nnatural food store and experiment.  There are loads of wheat and<br/>\ndairy-free products available if you know where to look.  Jenni like<br/>\nTofutti best of the &quot;ice creams&quot;.  Barbara&#39;s Bakery is good for wheat<br/>\nfree stuff.  And I found some cookies he liked but I forget the brand<br/>\nname just now.  There are lots of groups for this too.  Most of them will<br/>\nbe more than willing to share recipes and stuff.  But finding good<br/>\nalternatives helps A LOT.  For example, we made Mac and Cheese last night<br/>\nfor dinner.  Wyndham has special corn pasta for his and Jenni eats plain<br/>\nMac or mixes plain mac into a spoonful on mac and cheese so she gets the<br/>\nflavor with just a bit of milk, which she can handle occasionally.     <br/>\n<br/>\nBridget<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt;   My son has both eczema and asthma.  I&#39;ve never heard anyone claim <br/>\n&gt; that there are emotional factors involved with them.  I have heard <br/>\n&gt; lots and lots of claims, and research, of the direct dietary factors <br/>\n&gt; involved.  My son and I don&#39;t drink milk or eat wheat.  Neither of <br/>\n&gt; us are allergic, but we are &quot;sensitive&quot; to them.  Without them in <br/>\n&gt; our diet, my son no longer has stomach cramps, night terrors, <br/>\n&gt; eczema, his astma is under control without drugs, and his behavior <br/>\n&gt; has changed significantly (we both also have Tourette Syndrome, and <br/>\n&gt; the behavioral &quot;co-morbidities&quot; that go along with TS have <br/>\n&gt; disappeared.)  My son hates his new diet, but is very, very happy <br/>\n&gt; with the changes that have gone on in his body.  He&#39;ll get used to <br/>\n&gt; the diet eventually, and there is no way that I will allow him to go <br/>\n&gt; back to his old ways of eating.  The diet hasn&#39;t caused me any more <br/>\n&gt; stress than eating the old way, it&#39;s just replaced the stress of <br/>\n&gt; having a sick, cranky, anxious, depressed child, with a healthy <br/>\n&gt; child who is generally not happy at dinner time.  <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^<br/>\n     In three words I can sum up everything I&#39;ve learned about life: it<br/>\ngoes on.<br/>\n                                                     - Robert Frost</div>","specialLinks":[]}],"prevTopicId":27690,"nextTopicId":27658}}