{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":163750020,"authorName":"tuckervill2@aol.com","from":"tuckervill2@...","profile":"tuckervill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: helping little kids get in the mood for bedti...","postDate":"1120310251","msgId":107092,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMy40Yzc2M2RlLjJmZjdlZGViQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":107091,"nextInTime":107093,"topicId":107092,"numMessagesInTopic":0,"msgSnippet":"In a message dated 7/2/2005 5:05:03 AM Central Standard Time, karri_a_lewis@yahoo.com writes: I  really love the headphone idea! I hope DH will go for  that ","messageBody":"<div id=\"ygrps-yiv-1464325232\">In a message dated 7/2/2005 5:05:03 AM Central Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:karri_a_lewis@...\">karri_a_lewis@...</a> writes:<br/>\n<br/>\n<br/>\nI  really love the headphone idea! I hope DH will go for  that<br/>\n<br/>\n<br/>\n~~~<br/>\n <br/>\nThey have wireless headphones now, that would make it easy for him to sit  <br/>\nanywhere in the room, get up to pee, get up to get the kids a snack, whatever,  <br/>\nand still hear his show.  <br/>\n <br/>\nIf I were buying those for my husband, I&#39;d try to get the kind with  earbuds, <br/>\nnot necessarily big radio-dj style headphones.  The kinds of  headphones that <br/>\ncover your ears are anti-social.  Earbuds at least allow  you to hear what&#39;s <br/>\ngoing on around you.  Maybe he could listen with one  ear, only.<br/>\n <br/>\nI don&#39;t see anything wrong with wanting to watch a little TV, but it seems  <br/>\nto me that he&#39;s shutting you guys out by turning it up so loud.  My dad was  <br/>\nlosing his hearing a little, and when the grandkids would come over, he&#39;d keep  <br/>\nturning up the volume so he could hear over them.  (TV watching is a social  <br/>\nactivity in our family.)  Pretty soon no one could say a word and be heard  and <br/>\nthe TV was blaring as loud as it could go.  Eventually everyone would  leave <br/>\nand he&#39;d be surprised about it.  He thought we were all sitting  watching and <br/>\nenjoying TV with him.  Somehow he got the idea to use the  captioning and <br/>\nthat&#39;s helped.  For awhile there, it seemed like he *wanted*  them to leave (I was <br/>\nrarely there, then, because I lived far away).  <br/>\n <br/>\nI do wonder sometimes if it was intentional.  I think in your  husband&#39;s <br/>\ncase, it might not be intentionally shutting the kids out, but more  about not <br/>\nthinking clearly.  He&#39;s tired after a day&#39;s work and he&#39;s coming  home to noise <br/>\nthat he can&#39;t control and he&#39;s having trouble seeing the joy in  his kids.  So <br/>\nmaybe he zones out with the TV because he can&#39;t think of  anything else to do. <br/>\n I&#39;d certainly have a talk with him about it, find out  what his needs are <br/>\nand how he&#39;s feeling at the end of the day.  Don&#39;t  assume you know how he&#39;s <br/>\nfeeling.  Maybe just adjusting something simple  earlier in your day could change <br/>\nthe flavor of the house when he gets home, and  that could make all the <br/>\ndifference.  Or just knowing that he&#39;s heard and  understood could change his <br/>\nattitude.<br/>\n <br/>\nI&#39;d have this conversation before I bought wireless headphones, for sure,  <br/>\nbecause that could be a happy solution to a productive and peaceful  <br/>\nproblem-solving session.  The headphones might turn out to be  irrelavent.<br/>\n <br/>\nKaren<br/>\n <br/>\n <br/>\n <br/>\nwww.badchair.net<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":107079,"nextTopicId":107107}}