{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: New to unschooling","postDate":"1349383979","msgId":69245,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEZDN0JCMjJGLUVCRjEtNEQ5OS04NzJCLTYzMEFDRjQyMjA5QUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGs0a29nMStiZTVjQGVHcm91cHMuY29tPg==","referencesHeader":"PGs0a29nMStiZTVjQGVHcm91cHMuY29tPg=="},"prevInTopic":69244,"nextInTopic":0,"prevInTime":69244,"nextInTime":69246,"topicId":12981,"numMessagesInTopic":0,"msgSnippet":"-=-I used to worry that my son would inherit my family s legacy of depression, but now I know that as long as he knows he is the agent of his own life, as long","messageBody":"<div id=\"ygrps-yiv-1695481736\">-=-I used to worry that my son would inherit my family&#39;s legacy of depression, but now I know that as long as he knows he is the agent of his own life, as long as he knows he has choices, he will not feel trapped in depression. -=-<br/>\n<br/>\n&quot;Depression&quot; is a word that names more than one state and cause.<br/>\n<br/>\nIf the family&#39;s legacy of depression is to live like Eeyore, to be cynical and critical and not to express any giddiness or joy (maybe because since childhood that was discouraged and extinguished, then yes--finding choices and joy can begin to undo that, and if everyone in the family is willing to go out of the cage and stop administering those shocks to each other about being out here, the whole group might get to the point that they no longer have that legacy of depression and negativity.<br/>\n<br/>\nIf the legacy, though, is a genetic tendency away from a flatness and even-keeled personality, that&#39;s different.  Some people are never very excited, but the other side of that is that they&#39;re never very distressed or depressed. <br/>\n<br/>\nIt does seem that a person&#39;s capacity for exuberance comes with a corresponding low.  <br/>\n<br/>\nPart of &quot;clinical depression&quot; can be mistaking that low for a permanent state, and assuming that the world has become dark and helpless because there used to be sparkly excitement, and now there&#39;s not.<br/>\n<br/>\nWhat used to be called manic depression and is now called &quot;bi-polar disorder&quot; is present in LOTS of people, in lesser or greater degrees, but whatever the &quot;poles&quot; are or the degree of mania and depression, they seem to be related.  It&#39;s biochemistry that people don&#39;t understand well yet.<br/>\n<br/>\nEven people with low lows, though, can benefit from remembering that the high highs will return.  And those who have no high high to look foward to won&#39;t get depressed about it. :-)<br/>\n<br/>\nMy quick advice about all that, being a person with ups and down and having a couple of kids that way (and one who isn&#39;t) is to be grateful for the energetic phase and get some cool things done, and accept the lower times without wallowing (don&#39;t watch depressing movies or listen to suicide-inducing music, or watch the news).   <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/negativity\">http://sandradodd.com/negativity</a><br/>\nThat&#39;s helpful for any family, even the cheery ones, or those with the most stable of temperaments.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":151819905,"authorName":"barbaramatessa","from":"&quot;barbaramatessa&quot; &lt;bjelwell@...&gt;","profile":"barbaramatessa","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: New to unschooling","postDate":"1349379393","msgId":69244,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGs0a29nMStiZTVjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDFCMzQwMUVBLTM1MTctNDUxNS1BMjEzLTNCRTI4RjQwOTI0Q0BTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":69232,"nextInTopic":69245,"prevInTime":69243,"nextInTime":69245,"topicId":12981,"numMessagesInTopic":0,"msgSnippet":"... I wonder how any teen who is schooled in our authoritarian, mainstream culture, and happens to be a sensitive person, can survive their teens without","messageBody":"<div id=\"ygrps-yiv-1061865431\"><blockquote><span title=\"ireply\">&gt; -=-Has had depression and other struggles in the past... She is definitly deschooling...I have no idea how to help her.   She really only wants to be with friends and go out, sleep in late, watch TV, be lazy(her words)-=-<br/>\n&gt; <br/>\n&gt; Has she only been out of school for one year?<br/>\n<br/>\n </span></blockquote>I wonder how any teen who is schooled in our authoritarian, mainstream culture, and happens to be a sensitive person, can survive their teens without becoming depressed.<br/>\n<br/>\nI started the habit of depression in my teens and only recently feel that I&#39;m breaking out of it (at age 37).  What has helped me is an accumulation of empowered, healthy choices, and experiencing &quot;success&quot; on my own terms.  Deschooling has been the most wonderful antidote to my depression--it&#39;s still sinking in that I can create the life I want to live, and help my kids to do the same.  Nightly, I am devouring Sandra&#39;s webpages, and am finding that my daytime thoughts are more open to possibility and joy.<br/>\n<br/>\nI used to worry that my son would inherit my family&#39;s legacy of depression, but now I know that as long as he knows he is the agent of his own life, as long as he knows he has choices, he will not feel trapped in depression.  <br/>\n<br/>\nI&#39;m sure this analogy has been brought up on this board before, but you know the experiments where scientists shock rats on an unpredictable basis?  After a while, they don&#39;t try to move or fight the shocks anymore, even when the cage door is open for them to escape.  They&#39;ve learned helplessness.<br/>\n<br/>\nDepression is a form of helplessness.  Your daughter can learn that she can create her own wonderful life on her own terms, but she may need a little help.  If your relationship is a good one, perhaps you could travel together.  Perhaps she could travel with someone else?<br/>\n<br/>\nWhat do you imagine that she would find fun, or what did she used to find fun?  Do that!<br/>\n<br/>\nBarbara</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: [AlwaysLearning] New to unschooling","postDate":"1349284688","msgId":69232,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFCMzQwMUVBLTM1MTctNDUxNS1BMjEzLTNCRTI4RjQwOTI0Q0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGs0aGYzcis4ZzlxQGVHcm91cHMuY29tPg==","referencesHeader":"PGs0aGYzcis4ZzlxQGVHcm91cHMuY29tPg=="},"prevInTopic":69227,"nextInTopic":69244,"prevInTime":69231,"nextInTime":69233,"topicId":12981,"numMessagesInTopic":0,"msgSnippet":"-=-She really only wants to be with friends and go out, sleep in late, watch TV, be lazy(her words) I have suggested that we all make a vision board for fun","messageBody":"<div id=\"ygrps-yiv-569487078\">-=-She really only wants to be with friends and go out, sleep in late, watch TV, be lazy(her words) I have suggested that we all make a vision board for fun and this will help us explore our interests...she is working on this but other than that how do I encourage her to seek her intersts without pushing her? -=-<br/>\n<br/>\n&quot;Vision boards&quot; aren&#39;t the best tool for unschooling in the whole, big real world.  It&#39;s like making secret wishes at home instead of actually living.  Conversations are better.  Side-by-side conversations can be the best sometimes with teens:  <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/truck\">http://sandradodd.com/truck</a><br/>\n<br/>\nTry to spend time with her, just the two of you, if you can, sometimes.  <br/>\n<br/>\n-=-Has had depression and other struggles in the past... She is definitly deschooling...I have no idea how to help her.   She really only wants to be with friends and go out, sleep in late, watch TV, be lazy(her words)-=-<br/>\n<br/>\nHas she only been out of school for one year?<br/>\n<br/>\nIf she&#39;s prone to depression, she&#39;s probably better off at home than around a ton of angsty teens.<br/>\n<br/>\n-=-how do I encourage her to seek her intersts without pushing her? -=-<br/>\n<br/>\nDon&#39;t think of it as &quot;seeking her interests.&quot;<br/>\nShe might not have a burning interest, and she can still learn a ton.  <br/>\n<br/>\nShe&#39;s watching tv; does she also look at videos?  Maybe you can fill your portfolio with things she&#39;s looked up or watched or listened to.  Has she tried audio books?  &quot;The Help&quot; is particularly good (the audio book is better than the movie, and better than the book, because they do the right accents).  That could be American history/civil rights/ women&#39;s movement, and literature.  <br/>\n<br/>\nDon&#39;t expect her to provide her own interesting life.  That&#39;s your job.   If she&#39;s been out of school a full year, start looking at what she&#39;s doing.  If it has not been a year yet, don&#39;t press her in any way.<br/>\n<br/>\nThese things might help:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/teen/angst\">http://sandradodd.com/teen/angst</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://learninghappens.wordpress.com/2011/09/24/unschooling-is-not-child-led-learning/\">http://learninghappens.wordpress.com/2011/09/24/unschooling-is-not-child-led-learning/</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/movies\">http://sandradodd.com/movies</a>  (maybe you could watch movies together)<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/tv\">http://sandradodd.com/tv</a> <br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":87955765,"authorName":"lmoyer67","from":"&quot;lmoyer67&quot; &lt;lmoyer67@...&gt;","profile":"lmoyer67","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"New to unschooling","postDate":"1349271483","msgId":69227,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGs0aGYzcis4ZzlxQGVHcm91cHMuY29tPg=="},"prevInTopic":13013,"nextInTopic":69232,"prevInTime":69226,"nextInTime":69228,"topicId":12981,"numMessagesInTopic":0,"msgSnippet":"Hello all, I am new and learning more & more everyday; just reading your posts and online and books. I have 4 children (one in college and one in 3rd grade","messageBody":"<div id=\"ygrps-yiv-1008828584\">Hello all,<br/>\nI am new and learning more & more everyday; just reading your posts and online and books. I have 4 children (one in college and one in 3rd grade public)and a 12 yr.old son & 16 yr old daugher(unschooling) My son is very intersted in video games and I see alot of learning with him so I&#39;m not worried but my daughter ( whom I homeschooled K-3 then sent to public from 4-10 grades) I am concerned with. Has had depression and other struggles in the past... She is definitly deschooling...I have no idea how to help her.<br/>\nShe really only wants to be with friends and go out, sleep in late, watch TV, be lazy(her words) I have suggested that we all make a vision board for fun and this will help us explore our interests...she is working on this but other than that how do I encourage her to seek her intersts without pushing her? <br/>\nWe live in Pa and do have Homeschooling laws that we submit a portfoliop etc...in subject areas...<br/>\nThank you for any ideas or suggestions<br/>\nLaura</div>","specialLinks":[]},{"userId":39764976,"authorName":"Alan & Brenda Leonard","from":"Alan & Brenda Leonard &lt;abtleo@...&gt;","profile":"abtleo","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] New to unschooling","postDate":"1048008936","msgId":13013,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBOUNENDA5LjIxODElYWJ0bGVvQGVhcnRobGluay5uZXQ+","inReplyToHeader":"PDEwNDc5NzQ4MDMuMjk4MC40NTMyLm0xMEB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":12981,"nextInTopic":69227,"prevInTime":13012,"nextInTime":13014,"topicId":12981,"numMessagesInTopic":0,"msgSnippet":"... Many grownups forget that fun is good and start to think that fun is bad and something kids needs to quit doing.  I think they re the ones that get old ","messageBody":"<div id=\"ygrps-yiv-895513226\">3/18/03 09:06:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; This is going to be fun. I maybe 51 yrs old but can<br/>\n&gt; still be a kid. <br/>\n<br/>\n </span></blockquote>Many grownups forget that fun is good and start to think that fun is bad and<br/>\nsomething kids needs to quit doing.  I think they&#39;re the ones that get old<br/>\nfaster, personally.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; What great excuse for getting out of housework.<br/>\n<br/>\n </span></blockquote>You still have to occasionally do housework, I&#39;m sorry to say.  Of course,<br/>\nyou can always lower your standards, too.  That helps a lot!<br/>\n<br/>\nbrenda</div>","specialLinks":[]},{"userId":39764976,"authorName":"Alan & Brenda Leonard","from":"Alan & Brenda Leonard &lt;abtleo@...&gt;","profile":"abtleo","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] New to unschooling","postDate":"1047939908","msgId":12981,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBOUMwNTM1LjIxNzUlYWJ0bGVvQGVhcnRobGluay5uZXQ+","inReplyToHeader":"PDEwNDc5MzQzOTMuMzAyNC4yOTgubTE1QHlhaG9vZ3JvdXBzLmNvbT4="},"prevInTopic":0,"nextInTopic":13013,"prevInTime":12980,"nextInTime":12982,"topicId":12981,"numMessagesInTopic":0,"msgSnippet":"Hi, Pam and whoever else had asked about a typical day recently, Pam, leave your hair in your head, unschooling works just fine.  You already know a lot about","messageBody":"<div id=\"ygrps-yiv-149939093\">Hi, Pam and whoever else had asked about a typical day recently,<br/>\n<br/>\nPam, leave your hair in your head, unschooling works just fine.  You already<br/>\nknow a lot about it, unless you&#39;re like my mother who thought that every<br/>\nminute needed to be educational.<br/>\n<br/>\nDo you know how to go on vacation?  Do you like going to the zoo, a muesum<br/>\nor two, or outside for a hike?  How about lazy Saturdays at home with<br/>\nnothing on the agenda except to relax?  If you can do these things, guess<br/>\nwhat -- this is your new life!  This IS unschooling, if you do it all day,<br/>\nevery day.  <br/>\n<br/>\nI&#39;m sorry that your son is not so happy these days.  It will probably take<br/>\nhim some time to get used to the new freedom to do what he wants to do;<br/>\nthat&#39;s called deschooling.  He may watch lots of TV or play computer games<br/>\nall day.  Smile, watch with him, have him show you how far he&#39;s gotten on<br/>\nthe games, bake cookies, and feed him periodically.<br/>\n<br/>\nEventually, he&#39;s either going to get interested in something other than the<br/>\nTV and computer games, or he&#39;ll take them to a whole new level and spend all<br/>\nhis time trying to figure out how to beat the system.  Either of those<br/>\nthings will be educational.  I don&#39;t have a little gamer, but many people<br/>\nhave written eloquently on how much kids can learn from them, if you visit<br/>\nsandradodd.com   <br/>\n<br/>\nHere is my day, typical or not. I have one son, six years old.  He decided<br/>\nthat multiplication tables were interesting and decided to create one.  He<br/>\nonly likes number adding, he tells me, and will never learn subtraction.  I<br/>\nsaid ok.  Last year he didn&#39;t like numbers over 20, and now can count to<br/>\n1,000 (and did so one day) so I figured this, too, shall pass.  He drew<br/>\nlittle American flags for his teddy bears to hold, shelled fresh green peas,<br/>\nplayed solitare and rummy, watched me make brownies, worked on the problem<br/>\nsteps in his tap dance routine, bounced around to music, attempted to puzzle<br/>\nout why yellow-green and green-yellow colored pencils (and other colors like<br/>\nthat) are so different, and whined about being bored in between.  He also<br/>\ninformed me that he&#39;s never ever going to school because it&#39;s SO boring.  I<br/>\nsaid ok to that, too!<br/>\n<br/>\nHe&#39;s not much of a TV watcher, but yesterday he watched Lord of the Rings on<br/>\nDVD again, so he also raced around fighting imaginary orcs and goblins<br/>\ntoday.  <br/>\n<br/>\nI planned a week of menus, wrote a grocery list, played rummy until I<br/>\ncouldn&#39;t stand it any more, answered multiplication questions, worked on my<br/>\nbrownie recipe (it came from a friend and was so good but way too rich, so<br/>\nI&#39;m adapting it), made several snacks (we never got around to a meal before<br/>\ndinner) and eventually made dinner, taught a violin lesson, etc.  Some of my<br/>\nthings involved hiim, some didn&#39;t.  I answered the usual running list of<br/>\nquestions as best as I could, read email, and googled a couple things to<br/>\nfind answers for &quot;Curious Tim&quot;.<br/>\n<br/>\nGuess that&#39;s a pretty typical day, the kind Tim really likes because we<br/>\ndidn&#39;t go anywhere.  He&#39;s very much a homebody.  Your son who dislikes<br/>\neverything about school sounds like a great candidate for unschooling!  Good<br/>\nluck with it!<br/>\n<br/>\nbrenda<br/>\n<br/>\n3/17/03 21:53:<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; Hi, my name is Pam. I know nothing about unschooling, but its got to<br/>\n&gt; work or Im going to start pulling my hair out. We went to public<br/>\n&gt; schools for 3 yrs. and 1 month homeschooling and thats not working.<br/>\n&gt; I have a 7 yr. old that was at one time a happy child now not so<br/>\n&gt; happy. He dislikes everything about school. So I took him out and<br/>\n&gt; started hs him. He doesnt like that either and I stay stress alot.<br/>\n&gt; Im not sure how it goes but I will figure it out. We have lots of<br/>\n&gt; fun together and thats good. Any advice you all can give I thank you<br/>\n&gt; for it. Also, this is to Kate. It brought tears to my eyes<br/>\n&gt; too.          Thank You Pam </span></blockquote></div>","specialLinks":[]}],"prevTopicId":69220,"nextTopicId":68804}}