{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":779600,"authorName":"KathrynJB@aol.com","from":"KathrynJB@...","profile":"kathrynbeth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Teach, learn, and looking for some feedback","postDate":"1026682453","msgId":39188,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdkLjJhMzQyNTBhLjJhNjM0ODU1QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":39187,"nextInTime":39189,"topicId":39188,"numMessagesInTopic":0,"msgSnippet":"In a message dated 7/8/2002 6:59:46 AM Eastern Standard Time, ... My partner takes violin lessons and my son takes guitar lessons from a very cool teacher.","messageBody":"<div id=\"ygrps-yiv-66069016\">In a message dated 7/8/2002 6:59:46 AM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; As my understanding of how my son learns and how I learn develops, the<br/>\n&gt; natural side-effect is to consider what I do professionally.  I teach<br/>\n&gt; violin, and I&#39;ve been struggling with how I do that.  (I hate the &quot;I<br/>\n&gt; teach...&quot; comment, too, and I&#39;m open to suggestions on other ways to say<br/>\n&gt; that!  My business card could use a little help, too.)<br/>\n&gt; <br/>\n&gt; I&#39;m coming to beleive that most students come to me expecting me to feed<br/>\n&gt; knowledge into them, and then they become burned out when I do exactly <br/>\n&gt; that.<br/>\n&gt; (And so do I!)  I was considering it this way: if my son wanted to learn<br/>\n&gt; about dinosaurs, I&#39;d probably help him find a couple books on dinosaurs,<br/>\n&gt; search for web sites, check out our nearby Natural History museum, buy some<br/>\n&gt; model dinosaurs to mess around with, or whatever.  The LAST thing I&#39;d<br/>\n&gt; consider doing would be calling someone whom I heard was an expert on<br/>\n&gt; dinosaurs and sign him up for weekly &quot;dinosaur lessons&quot;, where he would<br/>\n&gt; learn a little bit new each week and then be expected to come home and<br/>\n&gt; repeat it over and over and then repeat it back to the expert the next <br/>\n&gt; week,<br/>\n&gt; perfectly or at least greatly improved!<br/>\n&gt; <br/>\n&gt; And yet to some extent, this is what I do for a living.  Somewhere along <br/>\n&gt; the<br/>\n&gt; line, somebody hears a violin, decides they want to learn to do that, and<br/>\n&gt; calls me for violin lessons.  And so we begin working through the basics of<br/>\n&gt; how you play, etc.  But here&#39;s my problem: they get bored.  It happens to<br/>\n&gt; everyone, somewhere down the line.  (Including me, the teacher!  I get <br/>\n&gt; kudos<br/>\n&gt; for my teaching, I&#39;m a good teacher.  But it&#39;s not thrilling me, either.)<br/>\n&gt; Let&#39;s face it, put as above, I&#39;d be bored with dinosaurs in the first <br/>\n&gt; month.<br/>\n&gt; If we played little games learning the information, had some laughs, etc., <br/>\n&gt; I<br/>\n&gt; might survive for two months.<br/>\n&gt; <br/>\n&gt; I&#39;m realizing that somehow, I need my students to see me as a single<br/>\n&gt; resource in their quest to learn violin.  That they also need to read,<br/>\n&gt; listen, study, experiment, search the internet, etc.  They need to think<br/>\n&gt; about why some things work and some things just don&#39;t work for them, and <br/>\n&gt; how<br/>\n&gt; to fix their own problems.  But how do I get them beyond the &quot;teach me&quot;<br/>\n&gt; mentality to learn themselves?  How do I give these people some direction,<br/>\n&gt; without it becoming just more assignments that I give for the week, added<br/>\n&gt; onto everything else.<br/>\n&gt; <br/>\n&gt; There&#39;s so much more to this all jumbled around in my poor little brain<br/>\n&gt; tonight, but maybe this works as a start.  Thanks for the help!<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>My partner takes violin lessons and my son takes guitar lessons from a very <br/>\ncool teacher. I&#39;ve noticed a few things she does that seem to work well. <br/>\n<br/>\nFirst, her attitude doesn&#39;t seem to be too much I am the Teacher and you are <br/>\nthe Student. Instead, she acts like both are a couple of people really <br/>\ninterested in this cool thing, with one having some more experience and skill <br/>\nwho can share with the other. They are partners learning and playing <br/>\ntogether. It&#39;s a very respectful approach, and is probably more fun for her <br/>\ntoo.<br/>\n<br/>\nSecond, she&#39;s flexible. If my son asks a question or talks about a music <br/>\nconcept, she doesn&#39;t stress sticking with what she&#39;d have planned. Instead, <br/>\nshe answers the questions, they experiment together, etc. She noticed my son <br/>\nloves to sing, so she adds that in (easier with guitar, of course).<br/>\n<br/>\nNow, one of my biggest things from having previously taken lessons...I want <br/>\nto play REAL songs, other than Twinkle. They can be simplified, they can be <br/>\njust parts....but Twinkle gets old.<br/>\n<br/>\nNow, just let me share that MY job is directing a Unitarian Universalist <br/>\nReligious Education program, and I also work really hard at making it as <br/>\nnot-schooly as possible. It&#39;s hard.<br/>\n<br/>\nKathryn<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":39165,"nextTopicId":38845}}