{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":126884268,"authorName":"HMSL2@aol.com","from":"HMSL2@...","profile":"dobsiedoe","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] TCS was  Safety rules..","postDate":"1053961355","msgId":70844,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0Ni4xMjM2YzUyNi4yYzAzODY4YkBhb2wuY29tPg=="},"prevInTopic":70790,"nextInTopic":0,"prevInTime":70843,"nextInTime":70845,"topicId":70790,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/26/2003 1:50:50 AM Eastern Standard Time, ... I signed up for TCS when the discussion came up. I cant get into it. The hypothetical","messageBody":"<div id=\"ygrps-yiv-1411112431\">In a message dated 5/26/2003 1:50:50 AM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:arodonn@...\">arodonn@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; This paragraph reminds me of something I wanted to post about.  A week or <br/>\n&gt; two ago the subject of non-coercive parenting or Taking Children Seriously <br/>\n&gt; came up.  Some one said that they could not get into that and others asked what <br/>\n&gt; the difference was.  The one response I saw about it said that parents who <br/>\n&gt; practiced Taking Children Seriously would never talk about their children <br/>\n&gt; directly.  They only use hypothetical to ask questions.  As an aside, I think that <br/>\n&gt; is a silly thing on that email list, as people would say, &quot;There is a mom <br/>\n&gt; and child, who is in the 4-5 range....&quot; and you&#39;d know they were talking about <br/>\n&gt; their child, so why not just say it?  Anyway, what I wanted to do was point <br/>\n&gt; out some of the differences I&#39;ve seen.<br/>\n<br/>\n </span></blockquote>I signed up for TCS when the discussion came up. <br/>\n I cant get into it. The hypothetical statements are driving me nuts.  I wish <br/>\nit was as easy to unsubscribe as yahoo groups are.<br/>\n<br/>\n<br/>\nLaura D<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":129042600,"authorName":"Nicholina ODonnell","from":"&quot;Nicholina ODonnell&quot; &lt;arodonn@...&gt;","profile":"doulanic","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"[Unschooling-dotcom] TCS was  Safety rules..","postDate":"1053928188","msgId":70790,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwZmEwMWMzMjM0YSQ5ZjVhNjc4MCRjMGU2NGI0M0BIZWR3aWc+","referencesHeader":"PDQzLjFkMzM3MjNlLjJjMDI5MzkyQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":70844,"prevInTime":70789,"nextInTime":70791,"topicId":70790,"numMessagesInTopic":0,"msgSnippet":"... This paragraph reminds me of something I wanted to post about.  A week or two ago the subject of non-coercive parenting or Taking Children Seriously came","messageBody":"<div id=\"ygrps-yiv-672077665\"><blockquote><span title=\"ireply\">&gt;NO safety rules means the kid can use any knife to cut anything they want.  <br/>\n&gt;Maybe the poster meant &quot;with adult supervision&quot;    But, that is still a &quot;rule&quot; <br/>\n&gt;, or a restriction.  &quot;you can use any knife you want ONLY when an adult can <br/>\n&gt;help you&quot;   Is that not what most folks on this list would do?   I think when <br/>\n&gt;someone says &quot;We have NO safety rules&quot;, it sounds like there is no regard for <br/>\n&gt;the childs safety.   I do not think that is the case at all. <br/>\n<br/>\n<br/>\n </span></blockquote>This paragraph reminds me of something I wanted to post about.  A week or two ago the subject of non-coercive parenting or Taking Children Seriously came up.  Some one said that they could not get into that and others asked what the difference was.  The one response I saw about it said that parents who practiced Taking Children Seriously would never talk about their children directly.  They only use hypothetical to ask questions.  As an aside, I think that is a silly thing on that email list, as people would say, &quot;There is a mom and child, who is in the 4-5 range....&quot; and you&#39;d know they were talking about their child, so why not just say it?  Anyway, what I wanted to do was point out some of the differences I&#39;ve seen.<br/>\n<br/>\nOne thing is this - safety rules.  While there have been some discussions about are the rules or guidelines or what, most people on this list seem not to begrudge a person who says that they do have some sort of safety rule, be it even, &quot;Please let me know if you are going to use a knife so I can be around&quot; or &quot;Helmets are required on bikes&quot;.  This sort of thing would not be acceptable on the TCS list.  There would be no rules, nor an acceptance of others having even these basic rules.<br/>\n<br/>\nAnother thread that brought up the difference for me was the one about cleanliness.  Many people said that, at a certain point of stinkyness, they would simply insist on a shower or bath if no other solution could be found.  That, again, would be totally unacceptable for a TCS parent.  Such a parent would never simply insist - that would be coercion.<br/>\n<br/>\nSo, there are some of the differences and also why I feel more comfortable here than I did on my stint on the TCS list a couple years ago.  We do not have much in the way of simply insisting or rules here at my house, but there are a few.  For example, Davan doesn&#39;t have to go to sleep when I do or at a certain time at all, but my room needs to be dark and quiet when I want to sleep and I&#39;m not willing to negotiate that.  In fact, Davan likes to sleep with her lights on and often not only stays up later than me, but wakes up in the night and gets up again for a while.  Often this is followed by coming into sleep the remainder of the night in my bed.  Fine with me, as long as I get to sleep.  The fact that she would prefer to be able to wake me up, at least sometimes, during her night time wakefulness and I don&#39;t allow that unless there is a need for something other than just a playmate, would be coercion, and therefore unacceptable to TCS parents.  They would only be okay with that if Davan really wanted to spend that time alone every time.<br/>\n<br/>\nOf course, I may be misreading the atmosphere here and will get chastised for this night time rule here, but, I don&#39;t think so.  I guess I&#39;ll see what comes my way.  :)<br/>\n<br/>\nNicholina<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":70841,"nextTopicId":70849}}