{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1572768,"authorName":"Stephanie Elms","from":"&quot;Stephanie Elms&quot; &lt;stephanie.elms@...&gt;","profile":"elmsfam","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"FW: [VaEclec] Our experience with testing","postDate":"1081216929","msgId":19251,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI1NUZENzlGRTczQUUwNDVBRjI4QUM0MkFCQTkyNDhDMTU1QTMzQGRlbHRhLW1haWwuZGVsdGFzb2x1dGlvbnMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":19250,"nextInTime":19252,"topicId":19251,"numMessagesInTopic":0,"msgSnippet":"Hey Kelly...I just wrote a post to my local hsing group about our experience in testing...maybe it will help get the juices going. The main problems that I had","messageBody":"<div id=\"ygrps-yiv-772000895\">Hey Kelly...I just wrote a post to my local hsing group about our<br/>\nexperience in testing...maybe it will help get the juices going.<br/>\n<br/>\nThe main problems that I had with our testing was that it caused us<br/>\n(including Jason!) to focus on what Jason did not know. DH wanted to<br/>\nknow why his math score wasn&#39;t higher (and pretty much ignored his high<br/>\nenglish score). I had a minor bit of panic when I first saw the math<br/>\npart of the test (I got over it though). But worst was that after<br/>\nfinishing the math portion Jason uttered words he has never said before<br/>\n&quot;I hate math&quot;. Luckily we don&#39;t &quot;do&quot; math, so it is not an issue, but it<br/>\nseemed sad to me and I was thankful that this is just a once a year hoop<br/>\nwe jump through (Virginia requires either testing or a portfolio review,<br/>\nbut the portfolios at becoming more and more tied to the Va &quot;Standards<br/>\nof Learning&quot; (SOLs - yes I kid you not) so we choose the test).<br/>\n<br/>\nThe tests totally ignored all the other cool stuff that Jason does<br/>\nknow...his concepts of physics (momentum, friction etc), his love of<br/>\ndoing experiments, his incredible knowledge of ancient egypt, his great<br/>\nproblem solving abilities on his pokemon game, his curiosity, his<br/>\nwonderful ability to recall just about anything about any character from<br/>\nthe Redwall books, well I guess that I could go on. <br/>\n<br/>\nOh another problem with tests is that people put too much emphasis on<br/>\nthem...I know that if my family finds out that we tested, they will use<br/>\nthe test score to determine whether homeschool is &quot;working&quot;. Which is<br/>\nwhy we had Jason take the test in January, so that we could always say<br/>\nthat the test was not a true reflection of his ability since it was<br/>\ntaken 6 months before the end of the &quot;school year&quot;. <br/>\n<br/>\nOh, since I know that not everyone is up on the testing jargon...8th<br/>\nstanine is &quot;above average&quot; (90th percentile meaning that he scored as<br/>\ngood or better then 90% of the kids who took the test) and 5th stanine<br/>\nis &quot;average&quot; (50 percentile).<br/>\n<br/>\nDon&#39;t know if any of this will help...I would love to see what you wrote<br/>\nwhen you are done!<br/>\n<br/>\nStephanie E.<br/>\n<br/>\n-----Original Message-----<br/>\nFrom: Stephanie Elms [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:stephanie.elms@...\">stephanie.elms@...</a>] <br/>\nSent: Wednesday, March 24, 2004 11:59 PM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:VaEclecticHomeschool@yahoogroups.com\">VaEclecticHomeschool@yahoogroups.com</a><br/>\nSubject: [VaEclec] Our experience with testing<br/>\n<br/>\nWith Jason being in first grade this year, this was the first year that<br/>\nwe had to provide proof of progress..I posted a couple of months ago<br/>\nwith a  bit of panic when I got a copy of the CAT test, mainly because I<br/>\nwas worried about the math section. We unschool and do not &quot;do<br/>\nmath&quot;...no drill, no workbooks. We use math a lot and play lots of games<br/>\nwith math and talk about math concepts. But still I was a bit worried<br/>\nabout the 2-digit addition and a couple of other problems with which he<br/>\nhad not much experience. I decided to just give it to him without any<br/>\nreal prep (I have been really enjoying watching as Jason gets new<br/>\nconcepts on his own and did not want &quot;mess up&quot; his natural progression).<br/>\n<br/>\nWe spread out the test over a week or so, working as long as Jason<br/>\nwanted and then forgetting about it for a couple of days. Very relaxed,<br/>\non the couch. We started with language arts and as expected, Jason had<br/>\nno problem answering the questions...I already knew that he has a great<br/>\nvocab, wonderful comprehension and even though we did no formal grammar,<br/>\nhe had no problem picking correct tenses or changing declarative<br/>\nsentences into questions. We moved on to the math section...this did not<br/>\ncome as easily to Jason...he had to think a bit more. But it was<br/>\nactually pretty neat to watch him reason his way through. He seemed to<br/>\nlook at it as a big puzzle. First he would look at the problem, then he<br/>\nwould look at the answers and say &quot;this one is ridiculous...this one is<br/>\nridiculous&quot;. Then he would look at the problem and see which answer made<br/>\nthe most sense. It was pretty neat to watch actually. Some he was only<br/>\noff by 1 and some that I thought he would have trouble with he got no<br/>\nproblem! His approach was extremely logical and pretty remarkable to me<br/>\nconsidering he has never taken a test before. :o) The other thing that I<br/>\nfound interesting was that after he was finished he uttered words that I<br/>\nhave *never* heard him say before: &quot;I hate math&quot;. It surprised me and<br/>\nmade me kind of sad. I guess that it is a good thing that we don&#39;t &quot;do<br/>\nmath&quot;! LOL!<br/>\n<br/>\nWe got the results back very quickly. He scored in the 8th stanine in<br/>\nlanguage arts and 5th in math. One interesting thing is that DH<br/>\nimmediately focused on the math score, wondering why it wasn&#39;t higher<br/>\n(dh is supportive of hsing, but not as convinced about unschooling). I<br/>\nquickly reminded him that he does absolutely *no* drill and he took the<br/>\ntest 6 months early and he still did as good or better then 50% of the<br/>\nkids taking the test. I also wanted to know why he was only focusing on<br/>\nthe lower score and why he thought that Jason had to do above average on<br/>\neverything.<br/>\n<br/>\nSo what did I learn about testing? Well, I learned that tests really do<br/>\nnot tell me anything that I did not already know about Jason...well, not<br/>\nexactly, I did learn that Jason is a better,  more logical test taker<br/>\nthen I thought LOL! I also learned that tests can make you focus on what<br/>\nkids *don&#39;t* know rather then on what they do. I also learned that it is<br/>\nbetter to just relax about it and not make a big deal over it (we did<br/>\nnot tell Jason his score and he has not asked). All in all it was not a<br/>\nterrible experience...I would prefer not to have to do it, but it is<br/>\nworth it to be able to continue to hs. I *am* glad that it is over and<br/>\nwe can go back to our happy little lives free of testing for another<br/>\nyear.<br/>\n<br/>\nStephanie (in Annandale, Fairfax County)</div>","specialLinks":[]}],"prevTopicId":19237,"nextTopicId":19255}}