{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":33,"messages":[{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Authority","postDate":"1273177481","msgId":53896,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI5OTJBNzJCLURERjgtNEI3NS1BRDlDLTlDODdEQ0I5OUZERkBjb21jYXN0Lm5ldD4="},"prevInTopic":53891,"nextInTopic":53908,"prevInTime":53895,"nextInTime":53897,"topicId":53770,"numMessagesInTopic":0,"msgSnippet":"Maybe weʻre discussing two different definitions (from the original post): 1. the power to determine, adjudicate, or otherwise settle issues or disputes;","messageBody":"<div id=\"ygrps-yiv-327226507\">Maybe weʻre discussing two different definitions (from the original  <br/>\npost):<br/>\n<br/>\n1. the power to determine, adjudicate, or otherwise settle issues or  <br/>\ndisputes; jurisdiction; the right to control, command, or determine.<br/>\n<br/>\n2. a power or right delegated or given; authorization: Who has the  <br/>\nauthority to grant permission?<br/>\n<br/>\n<br/>\nI agree with the second with regard to parenting. As the adult, I have  <br/>\nthe &quot;authority to grant permission&quot;. I donʻt use it to &quot;control,  <br/>\ncommand, or determine.&quot;<br/>\n<br/>\nRobin B.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Authority","postDate":"1273166830","msgId":53891,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQxMkM4RDU0LTk2NTAtNDY2OS04NEIyLUFBNTA3QUFFNEE4M0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhydXI5cSs5ODNmQGVHcm91cHMuY29tPg==","referencesHeader":"PGhydXI5cSs5ODNmQGVHcm91cHMuY29tPg=="},"prevInTopic":53889,"nextInTopic":53896,"prevInTime":53890,"nextInTime":53892,"topicId":53770,"numMessagesInTopic":0,"msgSnippet":"-=- There are things that a child is in charge of for him or herself. That doesn t mean the parent is no longer responsible to facilitate or support.-=- In","messageBody":"<div id=\"ygrps-yiv-66059117\">-=-<br/>\nThere are things that a child is &quot;in charge of&quot; for him or herself.  <br/>\nThat doesn&#39;t mean the parent is no longer responsible to facilitate or  <br/>\nsupport.-=-<br/>\n<br/>\nIn charge means responsible for.  Having been charged with the  <br/>\nresponsibility of... doing/keeping/guarding.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":151979431,"authorName":"Rebecca M.","from":"&quot;Rebecca M.&quot; &lt;ackirebecci@...&gt;","profile":"ackirebecci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Authority","postDate":"1273163898","msgId":53889,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhydXI5cSs5ODNmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQ2OTczRTEyLTdFNUYtNDZCMC05RTdFLTE3NDc0MDQ2NDYzREBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":53887,"nextInTopic":53891,"prevInTime":53888,"nextInTime":53890,"topicId":53770,"numMessagesInTopic":0,"msgSnippet":"... I respectfully disagree. :) I m not saying that the child s need to not wear shoes supersedes the hotel s requirement that all people wear shoes in certain","messageBody":"<div id=\"ygrps-yiv-477168267\">Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; Do you mean by carrying the child through those places?<br/>\n&gt; If there is a child &quot;for whom wearing shoes in unacceptable,&quot; then  <br/>\n&gt; they shouldn&#39;t be in restaurants or hotel lobbies at all.  There are  <br/>\n&gt; lots of places they can be barefooted, but a conference at such a  <br/>\n&gt; hotel isn&#39;t one of them.<br/>\n<br/>\n </span></blockquote>I respectfully disagree. :)<br/>\n<br/>\nI&#39;m not saying that the child&#39;s need to not wear shoes supersedes the hotel&#39;s requirement that all people wear shoes in certain locations. However, carrying is just one possible option. Another is to expand one&#39;s definition of what constitutes footwear and to try different things before the conference to find one that may work for a child (even if it&#39;s rubber boots or leather soled slippers). Another is to think about, for young children, using a wagon to pull them through the lobby... it would require a great deal of parental attentiveness to where their child is at but I&#39;m not sure that&#39;s such a bad idea anyway. There are other options than to sit a child down and force shoes on their feet. And...  yes, if there really aren&#39;t any options for this particular child, sitting out the conference until the child is ready for footwear may be the best choice.<br/>\n  <br/>\n<blockquote><span title=\"ireply\"> &gt; Children can&#39;t &quot;be in charge of themselves.&quot;  Parents can give them a  <br/>\n&gt; LOT of freedom and leeway, but they cannot legally or morally say or  <br/>\n&gt; even think that the child is &quot;in charge of himself.&quot;<br/>\n<br/>\n </span></blockquote>I knew you were going to say that. It was a poor choice of words on my part.<br/>\n<br/>\nSo, let&#39;s think about it this way. A parent cannot control a child&#39;s growth and development, they can only support it through nurturing and providing what is needed (biology takes over the rest). A parent cannot control a child&#39;s interpretation of events, they can only do their best to see things through their child&#39;s eyes and act accordingly. A parent cannot make their child learn anything (as well all know), they can only provide the conditions (and environment) the supports learning. A parent is a facilitator only, even if they try to control, they can only control things temporarily and superficially.<br/>\n<br/>\nThere are things that a child is &quot;in charge of&quot; for him or herself. That doesn&#39;t mean the parent is no longer responsible to facilitate or support.<br/>\n<br/>\n- Rebecca</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Authority","postDate":"1273162854","msgId":53887,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ2OTczRTEyLTdFNUYtNDZCMC05RTdFLTE3NDc0MDQ2NDYzREBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhydXBjYitjcTh0QGVHcm91cHMuY29tPg==","referencesHeader":"PGhydXBjYitjcTh0QGVHcm91cHMuY29tPg=="},"prevInTopic":53886,"nextInTopic":53889,"prevInTime":53886,"nextInTime":53888,"topicId":53770,"numMessagesInTopic":0,"msgSnippet":"-=- Yes, wearing shoes in certain places is not optional. But helping a child for whom wearing shoes is unacceptable (and there are children who find wearing","messageBody":"<div id=\"ygrps-yiv-1606424913\">-=- Yes, wearing shoes in certain places is not optional. But helping  <br/>\na child for whom wearing shoes is unacceptable (and there are children  <br/>\nwho find wearing shoes very physically difficult) find solutions  <br/>\ninstead of enforcing a rule a certain way is much more beneficial to  <br/>\neveryone.-=-<br/>\n<br/>\nDo you mean by carrying the child through those places?<br/>\nIf there is a child &quot;for whom wearing shoes in unacceptable,&quot; then  <br/>\nthey shouldn&#39;t be in restaurants or hotel lobbies at all.  There are  <br/>\nlots of places they can be barefooted, but a conference at such a  <br/>\nhotel isn&#39;t one of them.<br/>\n<br/>\n-=-Perhaps, instead of directors and producers, these parents are like  <br/>\nthe set designers and stage hands, allowing their children to be in  <br/>\ncharge of themselves while providing all that&#39;s needed for the show to  <br/>\ngo on in a way that works well.-=-<br/>\n<br/>\nChildren can&#39;t &quot;be in charge of themselves.&quot;  Parents can give them a  <br/>\nLOT of freedom and leeway, but they cannot legally or morally say or  <br/>\neven think that the child is &quot;in charge of himself.&quot;<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":151979431,"authorName":"Rebecca M.","from":"&quot;Rebecca M.&quot; &lt;ackirebecci@...&gt;","profile":"ackirebecci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Authority","postDate":"1273161931","msgId":53886,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhydXBjYitjcTh0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEU0QkZFQkMxLTJCM0YtNDAzMC1BNDNELTg3NTBDM0Q4MEM1MkBzdXBlbm4uY29tPg=="},"prevInTopic":53876,"nextInTopic":53887,"prevInTime":53885,"nextInTime":53887,"topicId":53770,"numMessagesInTopic":0,"msgSnippet":"... It s also too easy for parents to use natural and logical consequences to justify what amounts to punitive action on their part. And the insidious part","messageBody":"<div id=\"ygrps-yiv-98353756\">---Su Pennwrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; They always seem pretty arbitrary to me, though. I think the parent sees a logical connection that convinces them they&#39;re not being arbitrary.<br/>\n<br/>\n </span></blockquote>It&#39;s also too easy for parents to use &quot;natural&quot; and &quot;logical&quot; consequences to justify what amounts to punitive action on their part. And the insidious part of this is that they don&#39;t even realize that they are being punitive or that that they are setting themselves up as their child&#39;s adversary.<br/>\n<br/>\nI really like what Sandra wrote about natural consequences going two ways... that the natural consequence of a parent not being sweet to their child is that their child will pull away when they are old enough to do so.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; I would probably do the same thing, but I just don&#39;t think of it as &quot;consequences&quot; so much as helping them get what they want (to use it) and me get what I want (for something fragile that I paid for not to get broken).   <br/>\n&gt; <br/>\n&gt; Then it&#39;s not &quot;the same thing,&quot; I&#39;d argue. Not the same thing at all, even if it looks similar on the surface.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>It&#39;s not the same thing. One is setting a parent-imposed solution (&quot;I don&#39;t want this to be broken so you&#39;ll play with it this way or that way or not at all&quot;) and the other is supportive of exploration for a mutual solution (&quot;You want to play with this, I want it to be cared for because it&#39;s important to me, so how do we do that? Here&#39;s my idea, what&#39;s yours?&quot;).<br/>\n<br/>\nI know there&#39;s been recent chatter about shoes vs. no shoes at a conference venue. I think there are so many ways to work around that for any given child, so many approaches and solutions. Yes, wearing shoes in certain places is not optional. But helping a child for whom wearing shoes is unacceptable (and there are children who find wearing shoes very physically difficult) find solutions instead of enforcing a rule a certain way is much more beneficial to everyone.<br/>\n<br/>\nIf I can keep in mind that I want to stay on my child&#39;s side (rather than meeting things head on in an adversarial way), the outcome is usually amazing. If I get stuck in the mindset that I&#39;m the parent and I&#39;m in charge of this child, then the outcome is often crappy for everyone (regardless of my intentions).<br/>\n<br/>\nParents who outright claim &quot;authority&quot; over their children tend to have a very different view of their role as parent than the unschoolers I know. They see themselves as the directors and producers of their children&#39;s lives. Yes, they can be lovely people who don&#39;t necessarily shame or physically punish their children, but they often direct, control, limit, logically/naturally consequence without thought about what that is really like for their child because they&#39;ve never stopped to consider. Yes, they may have good intentions and may do things like ask a child what they think their consequence should be for a particular misdemeanor - it may seem democratic and egalitarian at first blush, but the option &quot;no consequence&quot; is never on the table and it also doesn&#39;t allow the child room to sort things out and offer restitution on their own (which would be a healing outcome for everyone).<br/>\n<br/>\nThe way I see unschooling parents use their parental authority is to be responsible both to and for their children, without imposing typical parenting agendas (often artifacts from our own childhoods). Perhaps, instead of directors and producers, these parents are like the set designers and stage hands, allowing their children to be in charge of themselves while providing all that&#39;s needed for the show to go on in a way that works well.<br/>\n<br/>\nI have not heard the other unschooling parents I know talk about being in authority over their children. I&#39;m not sure it&#39;s relevant to them when they are partnering with their children. They don&#39;t have to justify their actions with &quot;authority&quot; because they are quietly and continually taking responsibility for and facilitating their children&#39;s growth and development while not getting in their kids&#39; way.<br/>\n<br/>\n- Rebecca</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Authority","postDate":"1273154569","msgId":53876,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMxNzA1MzRGLTA0MTItNDZFQS05Q0UyLUI2NUIzMzBERjE0NUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhydGlpdCtxbTYyQGVHcm91cHMuY29tPg==","referencesHeader":"PGhydGlpdCtxbTYyQGVHcm91cHMuY29tPg=="},"prevInTopic":53875,"nextInTopic":53886,"prevInTime":53875,"nextInTime":53877,"topicId":53770,"numMessagesInTopic":0,"msgSnippet":"-=-That s an interesting phrasing: interpersonal natural consequence. I like it! -=- I think many parents, when they think of natural consequences (IF ","messageBody":"<div id=\"ygrps-yiv-1241604788\">-=-That&#39;s an interesting phrasing: interpersonal natural consequence.  <br/>\nI like it! -=-<br/>\n<br/>\nI think many parents, when they think of &quot;natural consequences&quot; (IF  <br/>\nthey&#39;re not confusing that with time-outs and spankings), think off  <br/>\ndramatic life-threatening situations, or of broken toys run over by  <br/>\ncars, or some other great emotional or property loss that they can  <br/>\npoint at and say &quot;SEE?  I was right.  You were bad and now God has  <br/>\npunished you.&quot;<br/>\n<br/>\nThey&#39;ve partnered with God (they hope) against the child.  Or they&#39;ve  <br/>\npartnered with nature, and they hope nature will rain &quot;natural  <br/>\nconsequences&quot; down on their child until the child learns to do what  <br/>\nthe parent wants him to do.<br/>\n<br/>\nAnd in all of that drama they sometimes forget the simple natural  <br/>\nconsequence of not being sweet and helpful to a child, though we see  <br/>\nthat all around us in young adults who move far away and don&#39;t call  <br/>\nhome, in teens who have a ton of secrets, who show one face to their  <br/>\nparents and have another life where they can&#39;t see.<br/>\n<br/>\nAnd that&#39;s even too dramatic for the simple consequence of not being  <br/>\ninvited back over if one wasn&#39;t gentle and polite enough with property  <br/>\nand people&#39;s feelings.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Authority","postDate":"1273154215","msgId":53872,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJGRDNDQjJGLUY5RDgtNDE2Ni05NEU1LTk4MzhGOEE1OEExRUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhydGVzNCt0anBwQGVHcm91cHMuY29tPg==","referencesHeader":"PGhydGVzNCt0anBwQGVHcm91cHMuY29tPg=="},"prevInTopic":53871,"nextInTopic":53875,"prevInTime":53871,"nextInTime":53873,"topicId":53770,"numMessagesInTopic":0,"msgSnippet":"-=-For example, a kid who repeatedly is careless with something isn t allowed to use it anymore because it might break. It s not a spanking or a time out. It s","messageBody":"<div id=\"ygrps-yiv-1748609313\">-=-For example, a kid who repeatedly is careless with something isn&#39;t  <br/>\nallowed to use it anymore because it might break. It&#39;s not a spanking  <br/>\nor a time out. It&#39;s not shaming or trying to make them feel bad. And  <br/>\nthey try to set them up for success in the future. Like, maybe saying  <br/>\nthey can use it but only under parental supervision/ while sitting  <br/>\ndown/ whatever.<br/>\n<br/>\n-=-I would probably do the same thing, but I just don&#39;t think of it as  <br/>\n&quot;consequences&quot; so much as helping them get what they want (to use it)  <br/>\nand me get what I want (for something fragile that I paid for not to  <br/>\nget broken). -=-<br/>\n<br/>\nMe too--it WOULD be consequences, but not in a negative way.  It would  <br/>\nbe prevention and safety.  I would involve decisions made with the  <br/>\nprinciples of peace and taking care of property in mind.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":223803785,"authorName":"Su Penn","from":"Su Penn &lt;su@...&gt;","profile":"marie101365","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Authority","postDate":"1273154157","msgId":53875,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU0QkZFQkMxLTJCM0YtNDAzMC1BNDNELTg3NTBDM0Q4MEM1MkBzdXBlbm4uY29tPg==","inReplyToHeader":"PGhydGVzNCt0anBwQGVHcm91cHMuY29tPg==","referencesHeader":"PGhydGVzNCt0anBwQGVHcm91cHMuY29tPg=="},"prevInTopic":53872,"nextInTopic":53876,"prevInTime":53874,"nextInTime":53876,"topicId":53770,"numMessagesInTopic":0,"msgSnippet":"... They always seem pretty arbitrary to me, though. I think the parent sees a logical connection that convinces them they re not being arbitrary. ... The way","messageBody":"<div id=\"ygrps-yiv-1429582352\">On May 6, 2010, at 12:00 AM, Damien wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; That is what they would refer to as natural consequences.  And I agree with you for the most part, logical consequences are usually kinder, less dramatic punishments.  They are related though, not arbitrary, and the focus is not on shaming or making them feel bad like with punishments.  <br/>\n<br/>\n </span></blockquote>They always seem pretty arbitrary to me, though. I think the parent sees a logical connection that convinces them they&#39;re not being arbitrary.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; For example, a kid who repeatedly is careless with something isn&#39;t allowed to use it anymore because it might break.  It&#39;s not a spanking or a time out.  It&#39;s not shaming or trying to make them feel bad.  And they try to set them up for success in the future.  Like, maybe saying they can use it but only under parental supervision/ while sitting down/ whatever. <br/>\n<br/>\n </span></blockquote>The way this would probably work at our house is that I would be less likely to say, &quot;That might get broken so you have to use it only in this place,&quot; but more likely to say, &quot;I&#39;m concerned that might get broken; what can we do to make sure that doesn&#39;t happen?&quot; To my mind, that&#39;s a huge difference. There have been times when I&#39;ve thought the only solution to a problem was the one I could see, and one of the kids has said, &quot;Well, can&#39;t we do this other thing instead?&quot; and that&#39;s been a better option.<br/>\n<br/>\nI do draw a line sometimes. Carl likes to use my camera and I&#39;m fine with that so long as he always has the wrist-strap on, for instance. Money has been tight for us the last two years or I might well have chosen another solution to the problem of how Carl can not break my camera again (it happened once), like buying him his own, more-durable camera.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I would probably do the same thing, but I just don&#39;t think of it as &quot;consequences&quot; so much as helping them get what they want (to use it) and me get what I want (for something fragile that I paid for not to get broken).   <br/>\n<br/>\n </span></blockquote>Then it&#39;s not &quot;the same thing,&quot; I&#39;d argue. Not the same thing at all, even if it looks similar on the surface.<br/>\n<br/>\nSu, mom to Eric, 8; Carl, 6; Yehva, 2.5<br/>\ntapeflags.blogspot.com</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Authority","postDate":"1273154051","msgId":53871,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI5NEUxNkFCLUIxRUEtNDZGNC05Q0JELTdDQTQ3NTUyNTQ5RkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhydTA1OCtvcmNyQGVHcm91cHMuY29tPg==","referencesHeader":"PGhydTA1OCtvcmNyQGVHcm91cHMuY29tPg=="},"prevInTopic":53861,"nextInTopic":53872,"prevInTime":53870,"nextInTime":53872,"topicId":53770,"numMessagesInTopic":0,"msgSnippet":"-=-When it didn t need to it didn t need to and it didn t need to less and less, but determining that was indeed dependent upon the parent not the child.-=- We","messageBody":"<div id=\"ygrps-yiv-1402571251\">-=-When it didn&#39;t need to it didn&#39;t need to and it didn&#39;t need to less  <br/>\nand less, but determining that was indeed dependent upon the parent  <br/>\nnot the child.-=-<br/>\n<br/>\nWe know another family whose five children never went to school.   <br/>\nTheir youngest is two years older than my oldest.  We met when Kirby  <br/>\nwas a baby.<br/>\n<br/>\nAs cool as the kids are, the parents were always iffy.  The dad is  <br/>\ndeceased now.  He was a totally controlling mental case (legally; on  <br/>\nmental disability) who was a prophet of God, and God changed his mind  <br/>\na lot.   We all thought when/if he died there would be more peace and  <br/>\nthe mom would be sweet always.<br/>\n<br/>\nYesterday Marty told me the more he hangs around with the mom now (for  <br/>\nvarious reasons he&#39;s seeing her more often), the more crazy he sees  <br/>\nshe is.   I&#39;m a little sad, because we once were friends.  He told me  <br/>\na story of something vaguely critical an ambiguous she said last  <br/>\nsummer that was intended to insult me, but was insulting to him too,  <br/>\nand we talked about it.<br/>\n<br/>\nHe had made up with his girlfriend after having broken up with her.   <br/>\nThat other-family mom had said (and Marty spoke it with her tone of  <br/>\nvoice that day) &quot;So we&#39;re not doing what our parents want us to do?&quot;  <br/>\nor something.  He couldn&#39;t even tell whether she was referring to  <br/>\nbreaking up or making up.  So he stayed baffled for nearly a year.   <br/>\nStill baffled, because I don&#39;t get it either, except I was able to let  <br/>\nhim know that when Holly and Keith and I were at a wedding last June  <br/>\nshe had been derisive when Holly told her who Marty was going out  <br/>\nwith.  That surprised Marty.<br/>\n<br/>\nSo the story isn&#39;t that we have a friend who has no integrity and  <br/>\ntries to stir it up.  That surprised us, but the story was that Marty  <br/>\nwas surprised that she thought, after knowing him his whole life, that  <br/>\nwe told him what to do, or that he would behave in reactionary fashion  <br/>\nto what we wanted.  He said she does tell her kids what to do, though,  <br/>\nall the time.  And as Marty is 21 and Kirby is nearly 24, her kids are  <br/>\n26 to late-30&#39;s.   She has taken her authority as their mother into  <br/>\ntheir entire lives.   I opted rather to be a confidant and advisor and  <br/>\nlet my kids start having their own lives early on.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":183568025,"authorName":"Bob Collier","from":"&quot;Bob Collier&quot; &lt;bobcollier@...&gt;","profile":"quaussiebob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Authority","postDate":"1273136104","msgId":53861,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhydTA1OCtvcmNyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQ4RUQ0QkQ2LUZBQjMtNDhDNC1COTZDLTdDMTA3RDg1QTE2MEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":53859,"nextInTopic":53871,"prevInTime":53860,"nextInTime":53862,"topicId":53770,"numMessagesInTopic":0,"msgSnippet":"... Yes, that s right. It s essentially acknowledging that my children s experiences in the world would naturally generate very personal ideas about what they","messageBody":"<div id=\"ygrps-yiv-1438165231\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; -=-In all my years of parenthood, no single factor has contributed  <br/>\n&gt; more to the positive quality of my relationships with my children than  <br/>\n&gt; my willingness to accept and honour their self-authority.&quot;-=-<br/>\n&gt; <br/>\n&gt; But here&#39;s the deal:  You didn&#39;t HAVE to accept or honor that.  You  <br/>\n&gt; gave it to them, really, by that acceptance, and honor and space.<br/>\n<br/>\n<br/>\n </span></blockquote>Yes, that&#39;s right. It&#39;s essentially acknowledging that my children&#39;s experiences in the world would naturally generate very personal ideas about what they wanted and didn&#39;t want and taking that into consideration when making my own decisions. It was still the case, particularly in babyhood and for some years after, that their parents&#39; more extensive knowledge and understanding prevailed when it needed to. When it didn&#39;t need to it didn&#39;t need to and it didn&#39;t need to less and less, but determining that was indeed dependent upon the parent not the child.<br/>\n<br/>\nBob</div>","specialLinks":[]},{"userId":324049237,"authorName":"Emily S","from":"&quot;Emily S&quot; &lt;saturnfire16@...&gt;","profile":"saturnfire16","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Authority","postDate":"1273130571","msgId":53859,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhydHFvYis0djBvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQ4RUQ0QkQ2LUZBQjMtNDhDNC1COTZDLTdDMTA3RDg1QTE2MEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":53858,"nextInTopic":53861,"prevInTime":53858,"nextInTime":53860,"topicId":53770,"numMessagesInTopic":0,"msgSnippet":"... It would be awesome if you could make a page on your site about authority, because this one comes up frequently when I talk to people about unschooling.","messageBody":"<div id=\"ygrps-yiv-743735611\"><blockquote><span title=\"ireply\">&gt; But here&#39;s the deal:  You didn&#39;t HAVE to accept or honor that.  You  <br/>\n&gt; gave it to them, really, by that acceptance, and honor and space.<br/>\n&gt; <br/>\n&gt; When unschoolers say &quot;My child is responsible for his own education&quot;  <br/>\n&gt; 0r &quot;...for his own learning&quot; I have the urge to duck and cover, or  <br/>\n&gt; track them down and try to persuade them to be quieter and more  <br/>\n&gt; thoughtful.<br/>\n&gt; <br/>\n&gt; Children are NOT responsible for their own anything.  Parents are  <br/>\n&gt; responsible for their children, and if they can find an artsy,  <br/>\n&gt; expansive way to responsibly hand the children a ton of choice and  <br/>\n&gt; autonomy, that&#39;s fantastic.  But if the parents aren&#39;t clear that the  <br/>\n&gt; children cannot BE &quot;autonomous&quot; or responsible for themselves, then  <br/>\n&gt; that&#39;s a problem legally, morally, ethically and logically.<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n<br/>\n<br/>\n </span></blockquote>It would be awesome if you could make a page on your site about authority, because this one comes up frequently when I talk to people about unschooling.  They sometimes reject it out of hand because they heard somewhere (usually from an unschooler of a TCS mindset with little kids) that unschoolers don&#39;t believe they have parental authority.</div>","specialLinks":[]},{"userId":324049237,"authorName":"Emily S","from":"&quot;Emily S&quot; &lt;saturnfire16@...&gt;","profile":"saturnfire16","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Authority","postDate":"1273122205","msgId":53858,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhydGlpdCtxbTYyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDRDMEQ0NzE5LUJFODQtNEM2OS05ODA3LTlGNzM4NEVGNDIxNEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":53855,"nextInTopic":53859,"prevInTime":53857,"nextInTime":53859,"topicId":53770,"numMessagesInTopic":0,"msgSnippet":"... That s an interesting phrasing:  interpersonal natural consequence.  I like it! Emily (who just realized her last 5 or so posts were signed in under her","messageBody":"<div id=\"ygrps-yiv-1849703160\"><blockquote><span title=\"ireply\">&gt; That&#39;s a natural consequence, interpersonally speaking.<br/>\n&gt; <br/>\n&gt; But those things can be done in partnership with the child, rather  <br/>\n&gt; than in opposition.<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n<br/>\n<br/>\n </span></blockquote>That&#39;s an interesting phrasing:  interpersonal natural consequence.  I like it!  <br/>\n<br/>\n<br/>\nEmily (who just realized her last 5 or so posts were signed in under her husbands account!)</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Authority","postDate":"1273119748","msgId":53855,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRDMEQ0NzE5LUJFODQtNEM2OS05ODA3LTlGNzM4NEVGNDIxNEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhydGVzNCt0anBwQGVHcm91cHMuY29tPg==","referencesHeader":"PGhydGVzNCt0anBwQGVHcm91cHMuY29tPg=="},"prevInTopic":53854,"nextInTopic":53858,"prevInTime":53854,"nextInTime":53856,"topicId":53770,"numMessagesInTopic":0,"msgSnippet":"-=-For example, a kid who repeatedly is careless with something isn t allowed to use it anymore because it might break. It s not a spanking or a time out. It s","messageBody":"<div id=\"ygrps-yiv-1665320123\">-=-For example, a kid who repeatedly is careless with something isn&#39;t  <br/>\nallowed to use it anymore because it might break. It&#39;s not a spanking  <br/>\nor a time out. It&#39;s not shaming or trying to make them feel bad. And  <br/>\nthey try to set them up for success in the future. Like, maybe saying  <br/>\nthey can use it but only under parental supervision/ while sitting  <br/>\ndown/ whatever. -=-<br/>\n<br/>\nThat&#39;s a natural consequence, interpersonally speaking.<br/>\n<br/>\nBut those things can be done in partnership with the child, rather  <br/>\nthan in opposition.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":339837881,"authorName":"Damien","from":"&quot;Damien&quot; &lt;damienstrength@...&gt;","profile":"damienstrength","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Authority","postDate":"1273118404","msgId":53854,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhydGVzNCt0anBwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY1RkQzRjA2LTMxQUEtNEEyRi1BRkMyLUFBMTM4REU3N0VEQkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":53850,"nextInTopic":53855,"prevInTime":53853,"nextInTime":53855,"topicId":53770,"numMessagesInTopic":0,"msgSnippet":"... That is what they would refer to as natural consequences.  And I agree with you for the most part, logical consequences are usually kinder, less dramatic","messageBody":"<div id=\"ygrps-yiv-1922430310\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; -=-They do use logical consequences, but sparingly and only with older  <br/>\n&gt; kids.-=-<br/>\n&gt; <br/>\n&gt; Eeek.<br/>\n&gt; If it&#39;s something they&#39;re &quot;using,&quot; that&#39;s not &quot;logical consequences.&quot;   <br/>\n&gt; That&#39;s punishment with a fancy name.<br/>\n&gt; <br/>\n&gt; Consequences happen naturally.  Parents don&#39;t &quot;use&quot; them.<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; <br/>\n<br/>\n<br/>\n </span></blockquote>That is what they would refer to as natural consequences.  And I agree with you for the most part, logical consequences are usually kinder, less dramatic punishments.  They are related though, not arbitrary, and the focus is not on shaming or making them feel bad like with punishments.  <br/>\n<br/>\nFor example, a kid who repeatedly is careless with something isn&#39;t allowed to use it anymore because it might break.  It&#39;s not a spanking or a time out.  It&#39;s not shaming or trying to make them feel bad.  And they try to set them up for success in the future.  Like, maybe saying they can use it but only under parental supervision/ while sitting down/ whatever. <br/>\n<br/>\nI would probably do the same thing, but I just don&#39;t think of it as &quot;consequences&quot; so much as helping them get what they want (to use it) and me get what I want (for something fragile that I paid for not to get broken).   <br/>\n<br/>\nEmily</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Authority","postDate":"1273112697","msgId":53850,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY1RkQzRjA2LTMxQUEtNEEyRi1BRkMyLUFBMTM4REU3N0VEQkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhydDdiZCtoYXVwQGVHcm91cHMuY29tPg==","referencesHeader":"PGhydDdiZCtoYXVwQGVHcm91cHMuY29tPg=="},"prevInTopic":53848,"nextInTopic":53854,"prevInTime":53849,"nextInTime":53851,"topicId":53770,"numMessagesInTopic":0,"msgSnippet":"-=-They do use logical consequences, but sparingly and only with older kids.-=- Eeek. If it s something they re using, that s not logical consequences. ","messageBody":"<div id=\"ygrps-yiv-217858909\">-=-They do use logical consequences, but sparingly and only with older  <br/>\nkids.-=-<br/>\n<br/>\nEeek.<br/>\nIf it&#39;s something they&#39;re &quot;using,&quot; that&#39;s not &quot;logical consequences.&quot;   <br/>\nThat&#39;s punishment with a fancy name.<br/>\n<br/>\nConsequences happen naturally.  Parents don&#39;t &quot;use&quot; them.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":339837881,"authorName":"Damien","from":"&quot;Damien&quot; &lt;damienstrength@...&gt;","profile":"damienstrength","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Authority","postDate":"1273111395","msgId":53848,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhydDgxMytpdXQwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDgwOEFFRjM3LTQ2OTctNDAyNS04NTE0LThDQUM0RjAwMjFEQUBjb21jYXN0Lm5ldD4="},"prevInTopic":53847,"nextInTopic":53850,"prevInTime":53847,"nextInTime":53849,"topicId":53770,"numMessagesInTopic":0,"msgSnippet":"... You don t, but you could, because you have the authority to. Emily","messageBody":"<div id=\"ygrps-yiv-1977055929\"><blockquote><span title=\"ireply\">&gt; <br/>\n&gt; I don&#39;t use that authority to force her to do anything, though I might  <br/>\n&gt; use my influence. Are they the same thing, then?<br/>\n&gt; <br/>\n&gt; Robin B.<br/>\n<br/>\n<br/>\n </span></blockquote>You don&#39;t, but you could, because you have the authority to.<br/>\n<br/>\n<br/>\n<br/>\nEmily</div>","specialLinks":[]},{"userId":339837881,"authorName":"Damien","from":"&quot;Damien&quot; &lt;damienstrength@...&gt;","profile":"damienstrength","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Authority","postDate":"1273111290","msgId":53847,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhydDd0cSs4amphQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDJCQTJFNTVCLTExRjEtNEQ1Ny1BN0VELUJGNTRFNjNFNkNGMUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":53846,"nextInTopic":53848,"prevInTime":53846,"nextInTime":53848,"topicId":53770,"numMessagesInTopic":0,"msgSnippet":"... Yes, this is how I understand authority too. Simple example, my kids (ages 4 and almost 2) were in the bathtub just now.  They brought out a cup full of","messageBody":"<div id=\"ygrps-yiv-1793104845\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; -=-I don&#39;t think that having &quot;authority over&quot; anyone leads to a<br/>\n&gt; partnership; especially not one between parent and child. Did you mean<br/>\n&gt; something different by &quot;authority over&quot; than what I understand it to<br/>\n&gt; mean?-=-<br/>\n&gt; <br/>\n&gt; Unless someone has authority, how can a partnership be chosen over  <br/>\n&gt; other options and responsibilities (to the government, the family, the  <br/>\n&gt; neighborhood).<br/>\n&gt; <br/>\n&gt; The child and parent aren&#39;t equal partners.  The one with the freedom  <br/>\n&gt; to give freedom grants some of it to a new partner in the world.<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n<br/>\n<br/>\n </span></blockquote>Yes, this is how I understand authority too.  <br/>\n<br/>\nSimple example, my kids (ages 4 and almost 2) were in the bathtub just now.  They brought out a cup full of water and a soaking wet washcloth.  I said, &quot;please keep the water in the bath&quot; because I don&#39;t want to me or them to slip on the floor or for the carpet to get soaked.  <br/>\n<br/>\nI have the authority to punish them for that or tell them to get out of the bath or make them clean it up.  I choose to use my authority to not do those things, but instead to just remind them to keep the water in the bath.  They said ok and went back to the bath.  If they had wanted to have water out of the bath, I could have used my authority to tell them NO.  However, I would have chosen to use my authority to give them cups with a little water on the kitchen floor (they LOVE to do that, and then use rags to clean it up, and bonus my floor gets clean!).  Or let them play in the sink or..... some other solution. <br/>\n<br/>\n<br/>\nEmily</div>","specialLinks":[]},{"userId":339837881,"authorName":"Damien","from":"&quot;Damien&quot; &lt;damienstrength@...&gt;","profile":"damienstrength","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Authority","postDate":"1273110701","msgId":53846,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhydDdiZCtoYXVwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEMzMjBBNkM3LTUyN0EtNEI1Mi1BMEFELThDQTZCREE1MzNFOEBjb21jYXN0Lm5ldD4="},"prevInTopic":53843,"nextInTopic":53847,"prevInTime":53845,"nextInTime":53847,"topicId":53770,"numMessagesInTopic":0,"msgSnippet":"... They also do not practice authoritarian parenting. ... They are not punitive, they don t use punishments, and most don t use rewards.  They do use logical","messageBody":"<div id=\"ygrps-yiv-132673702\"><blockquote><span title=\"ireply\">&gt; <br/>\n&gt; As an unschooler, I reject the notion of &quot;authoritarian&quot; parenting;  <br/>\n&gt; instead I prefer mindful parenting. &quot;Authoritarian&quot; is defined as  <br/>\n&gt; &quot;favoring strict rules and established authority.&quot; I prefer principles.<br/>\n<br/>\n </span></blockquote>They also do not practice authoritarian parenting.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; What do you consider &quot;gentle discipline&quot;?<br/>\n<br/>\n </span></blockquote>They are not punitive, they don&#39;t use punishments, and most don&#39;t use rewards.  They do use logical consequences, but sparingly and only with older kids.  They focus very much on relationships and understanding what types of things are age appropriate.  They practice attachment parenting.  Most are homeschoolers, several are unschoolers for academics.  They try to find how their children learn best and help them.  It is definitely more about relationship than &quot;power&quot; or a one-size-fits-all discipline style.          <br/>\n<br/>\n<br/>\n<br/>\nEmily</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Authority","postDate":"1273104925","msgId":53843,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQ3QjEwOUU5LUJBMTctNDYwMS04OTkxLTI0MzU3RTM0RUIwOEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhydDAxYytnN21sQGVHcm91cHMuY29tPg==","referencesHeader":"PGhydDAxYytnN21sQGVHcm91cHMuY29tPg=="},"prevInTopic":53842,"nextInTopic":53846,"prevInTime":53842,"nextInTime":53844,"topicId":53770,"numMessagesInTopic":0,"msgSnippet":"-=-I m really not sure how the word authority fits for me when thinking about parenting as a partnership as, in order for me to partner with my child, I","messageBody":"<div id=\"ygrps-yiv-700599272\">-=-I&#39;m really not sure how the word &quot;authority&quot; fits for me when  <br/>\nthinking about parenting as a partnership as, in order for me to  <br/>\npartner with my child, I personally need to see his wants/needs as  <br/>\nvalid as anyone else&#39;s... and that he has a right to determine in  <br/>\nwhich way he wants those wants/needs met.-=-<br/>\n<br/>\nYou have the authority to do that.<br/>\nYour child does not.<br/>\n<br/>\nThere are teens who come around and ask us to help persuade their  <br/>\nparents to unschool them.  We can&#39;t do that.  And the child can&#39;t say  <br/>\n&quot;My wants and needs are as valid as yours, mom and dad.&quot;  Only his  <br/>\nparents have the authority to give him that privilege/respect/ <br/>\nexemption-from-normal-expectations.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":151979431,"authorName":"Rebecca M.","from":"&quot;Rebecca M.&quot; &lt;ackirebecci@...&gt;","profile":"ackirebecci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Authority","postDate":"1273103212","msgId":53842,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhydDAxYytnN21sQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQ1MTMxMi4zODIxLnFtQHdlYjExMDQwNy5tYWlsLmdxMS55YWhvby5jb20+"},"prevInTopic":53838,"nextInTopic":53843,"prevInTime":53841,"nextInTime":53843,"topicId":53770,"numMessagesInTopic":0,"msgSnippet":"... It s a very limited view on relationships and how they work, definitely. Alfie Kohn talks about how parenting is looked at as a continuum... Authoritarian","messageBody":"<div id=\"ygrps-yiv-772146111\"><blockquote><span title=\"ireply\">&gt; **That&#39;s interesting!  I&#39;ve contemplated that a lot.  When one does a google search on parenting styles, this is THE accepted truth on parenting.  I don&#39;t see any variations to it.  It&#39;s disappointing.   Authoritarian, authoritative, permissive or indulgent, and neglectful or uninvolved.  Those 4 parenting styles are what the modern day parent gets to choose from.  It totally ignores parenting as a partnership between parent/child.  All of those parenting styles are designed to be and &quot;us vs. them&quot;.**<br/>\n<br/>\n </span></blockquote>It&#39;s a very limited view on relationships and how they work, definitely.<br/>\n<br/>\nAlfie Kohn talks about how parenting is looked at as a continuum... Authoritarian on one end, indulgent/permissive/neglectful on the other. And that most parenting books/theories try to supply the &quot;just right&quot; middle ground (authoritative  or &quot;reward them when they&#39;re being good&quot;)... but I think what usually happens is people ping pong back and forth between the extremes because, in Kohn&#39;s words, &quot;neglecting and punishing aren&#39;t even really opposites... both share the feature of offering absolutely no productive, respectful adult guidance of the sort that kids need.&quot; If parents think that being permissive is the only kind way to parent, then they tend to snap into punitive when they can no longer stand what&#39;s going on around them. I think the middle ground is dangerous because it&#39;s too easy to slip toward either end when it all hits the fan.<br/>\n<br/>\nThat&#39;s why it&#39;s important there is an option that goes in a totally different direction.<br/>\n<br/>\nI&#39;m so happy there is another way to be with our kids and that we&#39;ve found it (yay unschooling!). I&#39;m really not sure how the word &quot;authority&quot; fits for me when thinking about parenting as a partnership as, in order for me to partner with my child, I personally need to see his wants/needs as valid as anyone else&#39;s... and that he has a right to determine in which way he wants those wants/needs met. In my mind, that&#39;s not permissive, it&#39;s respectful. It doesn&#39;t mean that he can trample over the needs of others because he&#39;s putting his needs first. I think it goes back to empathy in parenting... because he experiences empathy towards himself, then he learns to be empathic toward others (and can be generous with it). <br/>\n<br/>\nWhen I think of authority, I see rules, black and white, hard lines drawn (not to be crossed), someone making decisions for me that I&#39;d rather make myself. I see empathy as a vehicle to help the child gradually extend beyond his inner world of wants and needs so that he can be sensitive to the needs of others. Empathy plus guidance plus loving support, not hard edges. Hmm... my own baggage perhaps (actually, we can skip the &quot;perhaps&quot; &lt;g&gt;). <br/>\n<br/>\n- Rebecca</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: [AlwaysLearning] Re: Authority","postDate":"1273087462","msgId":53838,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM1NEZCMUM5LTJDNDAtNDQzMS05NjdFLUFFNzgzM0NEOTVGMkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDQ1MTMxMi4zODIxLnFtQHdlYjExMDQwNy5tYWlsLmdxMS55YWhvby5jb20+","referencesHeader":"PGhycW5nbytxbjg5QGVHcm91cHMuY29tPiA8NDUxMzEyLjM4MjEucW1Ad2ViMTEwNDA3Lm1haWwuZ3ExLnlhaG9vLmNvbT4="},"prevInTopic":53837,"nextInTopic":53842,"prevInTime":53837,"nextInTime":53839,"topicId":53770,"numMessagesInTopic":0,"msgSnippet":"-=-It totally ignores parenting as a partnership between parent/child. All of those parenting styles are designed to be and us vs. them .-=- But so does the","messageBody":"<div id=\"ygrps-yiv-1988554643\">-=-It totally ignores parenting as a partnership between parent/child.  <br/>\nAll of those parenting styles are designed to be and &quot;us vs. them&quot;.-=-<br/>\n<br/>\nBut so does the place I got that &quot;be your child&#39;s partner&quot; idea.<br/>\n<br/>\nLa Leche League.<br/>\nWhat they meant was to be your child&#39;s partner in the breastfeeding  <br/>\nrelationship.  But after those kids are weaned...<br/>\n<br/>\nI figured being Kirby&#39;s partner should extend to being his partner  <br/>\nwhen I had a second child.  I remembered being a displaces &quot;only.&quot;    <br/>\nAnd it seemed there was no problem being Kirby&#39;s play and learning and  <br/>\ntravel and adventure partner even though I was being Marty&#39;s partner  <br/>\nin the breastfeeding relationship.<br/>\n<br/>\nI was pregnant with Holly when we first started considering  <br/>\nunschooling, and she was born before we were unschooling, and that  <br/>\npartner-and not-adversary idea was by then just burned into my brain.<br/>\n<br/>\nSo I didn&#39;t get that from any &quot;parenting style&quot; unless it was  <br/>\nattachment parenting as promoted by the LLLeaders I had in the late  <br/>\n1980&#39;s.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Authority","postDate":"1273086270","msgId":53837,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ1MTMxMi4zODIxLnFtQHdlYjExMDQwNy5tYWlsLmdxMS55YWhvby5jb20+","inReplyToHeader":"PGhycW5nbytxbjg5QGVHcm91cHMuY29tPg==","referencesHeader":"PGhycW5nbytxbjg5QGVHcm91cHMuY29tPg=="},"prevInTopic":53830,"nextInTopic":53838,"prevInTime":53836,"nextInTime":53838,"topicId":53770,"numMessagesInTopic":0,"msgSnippet":"***When my son was 5 turning 6, I took an academic course in which Baumrind s ideas about parenting styles were accepted as true . *** That s interesting!","messageBody":"<div id=\"ygrps-yiv-191226459\">***When my son was 5 turning 6, I took an academic course in which Baumrind&#39;s ideas about parenting styles were accepted as &quot;true&quot;. ***<br/>\n<br/>\nThat&#39;s interesting!  I&#39;ve contemplated that a lot.  When one does a google search on parenting styles, this is THE accepted truth on parenting.  I don&#39;t see any variations to it.  It&#39;s disappointing.   Authoritarian, authoritative, permissive or indulgent, and neglectful or uninvolved.  Those 4 parenting styles are what the modern day parent gets to choose from.  It totally ignores parenting as a partnership between parent/child.  All of those parenting styles are designed to be and &quot;us vs. them&quot;.<br/>\n<br/>\nIt&#39;s no wonder so many parents get conflicting and confusing child rearing information!  I think most parents want peaceful households and happy children, yet none of those parenting styles will get you there.<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Authority","postDate":"1273075263","msgId":53830,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ4RUQ0QkQ2LUZBQjMtNDhDNC1COTZDLTdDMTA3RDg1QTE2MEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhycnZsNitxMzNrQGVHcm91cHMuY29tPg==","referencesHeader":"PGhycnZsNitxMzNrQGVHcm91cHMuY29tPg=="},"prevInTopic":53825,"nextInTopic":53837,"prevInTime":53829,"nextInTime":53831,"topicId":53770,"numMessagesInTopic":0,"msgSnippet":"-=-In all my years of parenthood, no single factor has contributed more to the positive quality of my relationships with my children than my willingness to","messageBody":"<div id=\"ygrps-yiv-2079317380\">-=-In all my years of parenthood, no single factor has contributed  <br/>\nmore to the positive quality of my relationships with my children than  <br/>\nmy willingness to accept and honour their self-authority.&quot;-=-<br/>\n<br/>\nBut here&#39;s the deal:  You didn&#39;t HAVE to accept or honor that.  You  <br/>\ngave it to them, really, by that acceptance, and honor and space.<br/>\n<br/>\nWhen unschoolers say &quot;My child is responsible for his own education&quot;  <br/>\n0r &quot;...for his own learning&quot; I have the urge to duck and cover, or  <br/>\ntrack them down and try to persuade them to be quieter and more  <br/>\nthoughtful.<br/>\n<br/>\nChildren are NOT responsible for their own anything.  Parents are  <br/>\nresponsible for their children, and if they can find an artsy,  <br/>\nexpansive way to responsibly hand the children a ton of choice and  <br/>\nautonomy, that&#39;s fantastic.  But if the parents aren&#39;t clear that the  <br/>\nchildren cannot BE &quot;autonomous&quot; or responsible for themselves, then  <br/>\nthat&#39;s a problem legally, morally, ethically and logically.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":183568025,"authorName":"Bob Collier","from":"&quot;Bob Collier&quot; &lt;bobcollier@...&gt;","profile":"quaussiebob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Authority","postDate":"1273070054","msgId":53825,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhycnZsNitxMzNrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhycW5nbytxbjg5QGVHcm91cHMuY29tPg=="},"prevInTopic":53817,"nextInTopic":53830,"prevInTime":53824,"nextInTime":53826,"topicId":53770,"numMessagesInTopic":0,"msgSnippet":"... That s how I think of it. From my ebook How I Parent : We are all unique individuals with a unique perception of reality. We all have an understanding of","messageBody":"<div id=\"ygrps-yiv-647746395\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Rebecca M.&quot; &lt;ackirebecci@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; <br/>\n&gt; I once worked with a guy who said that the root word of &quot;authority&quot; was &quot;author&quot; and that we could all be the authors of our relationships (and lives). But I think that&#39;s a bit of a stretch (although it&#39;s an interesting idea).<br/>\n&gt; <br/>\n&gt; - Rebecca<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>That&#39;s how I think of it. From my ebook &#39;How I Parent&#39;:<br/>\n<br/>\n<br/>\n&quot;We are all unique individuals with a unique perception of reality.<br/>\n<br/>\nWe all have an understanding of ourselves, the world we live in and the people we encounter in our world that generates in our minds highly personalised ideas about what we need to do to be happy and successful.<br/>\n<br/>\nThis is as true for our children as it is for us.<br/>\n<br/>\nLike us, they are at the centre of their universe and they have a perception of reality that is all their own; and, like us, they are the servants of their biology. They want what they want - regardless of whether or not anybody else approves of it, accepts it or even takes any notice of it.<br/>\n<br/>\nThis is what I call their âself-authorityâ.<br/>\n<br/>\nIn all my years of parenthood, no single factor has contributed more to the positive quality of my relationships with my children than my willingness to accept and honour their self-authority.&quot;<br/>\n<br/>\n<br/>\nNot children any more of course, they&#39;re 24 and 14 now.<br/>\n<br/>\nBob</div>","specialLinks":[]},{"userId":151979431,"authorName":"Rebecca M.","from":"&quot;Rebecca M.&quot; &lt;ackirebecci@...&gt;","profile":"ackirebecci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Authority","postDate":"1273028952","msgId":53817,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhycW5nbytxbjg5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhybzJyOCtzanF2QGVHcm91cHMuY29tPg=="},"prevInTopic":53811,"nextInTopic":53825,"prevInTime":53816,"nextInTime":53818,"topicId":53770,"numMessagesInTopic":0,"msgSnippet":"... I think the word authority can be applied to parenting in different ways. And I think it can easily be twisted to suit people s purposes (and to justify","messageBody":"<div id=\"ygrps-yiv-1463207308\">--- &quot;Emily S&quot; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I think the word authority has bad connotations for some people, especially if they were raised with a lot of *control* and are raising their kids with a lot more freedom.  On the other hand, the people who I&#39;m talking with do gentle discipline, are unschoolish, and feel that their authority is an essential part of parenting. &gt;<br/>\n<br/>\n </span></blockquote>I think the word &quot;authority&quot; can be applied to parenting in different ways. And I think it can easily be twisted to suit people&#39;s purposes (and to justify all sorts of coercive actions on the parts of parents).<br/>\n<br/>\nThere is the authoritarian parenting style: &quot;Authoritarian parents are highly demanding and directive, but not responsive. &quot;They are obedience- and status-oriented, and expect their orders to be obeyed without explanation&quot; (Baumrind, 1991, p. 62). These parents provide well-ordered and structured environments with clearly stated rules. Authoritarian parents can be divided into two types: nonauthoritarian-directive, who are directive, but not intrusive or autocratic in their use of power, and authoritarian-directive, who are highly intrusive.&quot; (I suspect &quot;intrusive&quot; means physical punishment.)<br/>\n<br/>\nThere is the authoritative parenting style: &quot;Authoritative parents are both demanding and responsive. &quot;They monitor and impart clear standards for their children&#39;s conduct. They are assertive, but not intrusive and restrictive. Their disciplinary methods are supportive, rather than punitive. They want their children to be assertive as well as socially responsible, and self-regulated as well as cooperative&quot; (Baumrind, 1991, p. 62).&quot;<br/>\n<br/>\nThese are terms that are widely used in the field of child development. Baumrind also indentified &quot;indulgent&quot; and &quot;uninvolved&quot; as parenting styles. Here&#39;s a site I found that summarizes some of this (I pulled the above quotes from it): <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.athealth.com/Practitioner/ceduc/parentingstyles.html\">http://www.athealth.com/Practitioner/ceduc/parentingstyles.html</a><br/>\n<br/>\nAccording to Baumrind&#39;s studies, authoritative parenting is the most effective parenting style. It looks good on paper but...<br/>\n<br/>\nI was rereading Alfie Kohn&#39;s &quot;Unconditional Parenting&quot; and I was surprised to see that he referenced Baumrind&#39;s work... and he has some interesting things to say about it.<br/>\n<br/>\n&quot;In fact, the &quot;reasonable middle ground&quot; option may not be all that reasonable when evaluated on its merits. One example in the discipline field is Diana Baumrind&#39;s schema, which has been adopted by lots of researchers as well as practitioners. She describes parenting as being &quot;authoritarian&quot; on one side, &quot;permissive&quot; on the other, or &quot;authoritative&quot; (read: just right) in the middle. In reality, her favored approach, supposedly a blend of firmness and caring, is actually quite traditional and control-oriented -- even if less so than option 1. In fact, a close reading of Baumrind&#39;s research raises questions about the recommendations she offers, particularly her endorsement of &quot;firm control.&quot;&quot; pp. 104-105<br/>\n<br/>\nIn the notes in the back of the book, Kohn goes on to explain his concerns. I won&#39;t bore you here, but if you have a copy of his book and you&#39;d like to check it out, the note is on pages 234-235.<br/>\n<br/>\nWhen my son was 5 turning 6, I took an academic course in which Baumrind&#39;s ideas about parenting styles were accepted as &quot;true&quot;. In fact, I accepted them as true and as a result, I changed the way I parented and it did not benefit any of us. I thought I was being &quot;authoritative&quot; but that slides very easily into authoritarian.<br/>\n<br/>\nFrom personal experience, I caution against a casual acceptance of parental authority without a careful look at how that can be interpreted (especially in a moment of parental frustration).<br/>\n<br/>\nI once worked with a guy who said that the root word of &quot;authority&quot; was &quot;author&quot; and that we could all be the authors of our relationships (and lives). But I think that&#39;s a bit of a stretch (although it&#39;s an interesting idea).<br/>\n<br/>\n- Rebecca</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Authority","postDate":"1273009315","msgId":53811,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENGNjI3NzY5LUY5QjctNEQwRS05QTUwLTM3N0MzNkEyQjJFNkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDgwOEFFRjM3LTQ2OTctNDAyNS04NTE0LThDQUM0RjAwMjFEQUBjb21jYXN0Lm5ldD4=","referencesHeader":"PGhybzJyOCtzanF2QGVHcm91cHMuY29tPiA8QzMyMEE2QzctNTI3QS00QjUyLUEwQUQtOENBNkJEQTUzM0U4QGNvbWNhc3QubmV0PiA8MkJBMkU1NUItMTFGMS00RDU3LUE3RUQtQkY1NEU2M0U2Q0YxQFNhbmRyYWRvZGQuY29tPiA8ODA4QUVGMzctNDY5Ny00MDI1LTg1MTQtOENBQzRGMDAyMURBQGNvbWNhc3QubmV0Pg=="},"prevInTopic":53810,"nextInTopic":53817,"prevInTime":53810,"nextInTime":53812,"topicId":53770,"numMessagesInTopic":0,"msgSnippet":"-=- I don t use that authority to force her to do anything, though I might use my influence. Are they the same thing, then?-=- You are the authority, though,","messageBody":"<div id=\"ygrps-yiv-147284688\">-=-<br/>\nI don&#39;t use that authority to force her to do anything, though I might<br/>\nuse my influence. Are they the same thing, then?-=-<br/>\n<br/>\nYou are &quot;the authority,&quot; though, in the situation (you and the dad, in  <br/>\nwhatever arrangements you have between yourselves) and if you choose  <br/>\nto use that authority to protect a democracy or a free-for-all or  <br/>\n&quot;child led learning&quot; or anything within the scope over which you do  <br/>\nhave authority, then you can!<br/>\n<br/>\nSomeone could use his authority to get rid of his own position, in  <br/>\nsome cases.  Dissolve the company/business/account/site.   But a  <br/>\nparent can&#39;t so easily dissolve the responsibility he has to take care  <br/>\nof his children (natural or adopted).<br/>\n<br/>\nYou can share it but you can&#39;t give it all away.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Authority","postDate":"1273008780","msgId":53810,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgwOEFFRjM3LTQ2OTctNDAyNS04NTE0LThDQUM0RjAwMjFEQUBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PDJCQTJFNTVCLTExRjEtNEQ1Ny1BN0VELUJGNTRFNjNFNkNGMUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGhybzJyOCtzanF2QGVHcm91cHMuY29tPiA8QzMyMEE2QzctNTI3QS00QjUyLUEwQUQtOENBNkJEQTUzM0U4QGNvbWNhc3QubmV0PiA8MkJBMkU1NUItMTFGMS00RDU3LUE3RUQtQkY1NEU2M0U2Q0YxQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":53809,"nextInTopic":53811,"prevInTime":53809,"nextInTime":53811,"topicId":53770,"numMessagesInTopic":0,"msgSnippet":"... Isn t that authority *to* though? Am I caught up in the authority over as in power over in a negative way? Maybe. ... Yes, I guess that s true. I don t","messageBody":"<div id=\"ygrps-yiv-1471727056\"><blockquote><span title=\"ireply\">&gt; Unless someone has authority, how can a partnership be chosen over<br/>\n&gt; other options and responsibilities (to the government, the family, the<br/>\n&gt; neighborhood).<br/>\n<br/>\n </span></blockquote>Isn&#39;t that authority *to* though? Am I caught up in the &quot;authority  <br/>\nover&quot; as in &quot;power over&quot; in a negative way? Maybe.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; The child and parent aren&#39;t equal partners.  The one with the freedom<br/>\n&gt; to give freedom grants some of it to a new partner in the world.<br/>\n<br/>\n </span></blockquote>Yes, I guess that&#39;s true. I don&#39;t think of my daughter and I as &quot;equal  <br/>\npartners.&quot; She is still my responsibility until she reaches the age of  <br/>\nmajority, so therefore, her freedom to do, buy, learn is provided  <br/>\nthrough me.<br/>\n<br/>\nI don&#39;t use that authority to force her to do anything, though I might  <br/>\nuse my influence. Are they the same thing, then?<br/>\n<br/>\nRobin B.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Authority","postDate":"1273007558","msgId":53809,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJCQTJFNTVCLTExRjEtNEQ1Ny1BN0VELUJGNTRFNjNFNkNGMUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEMzMjBBNkM3LTUyN0EtNEI1Mi1BMEFELThDQTZCREE1MzNFOEBjb21jYXN0Lm5ldD4=","referencesHeader":"PGhybzJyOCtzanF2QGVHcm91cHMuY29tPiA8QzMyMEE2QzctNTI3QS00QjUyLUEwQUQtOENBNkJEQTUzM0U4QGNvbWNhc3QubmV0Pg=="},"prevInTopic":53806,"nextInTopic":53810,"prevInTime":53808,"nextInTime":53810,"topicId":53770,"numMessagesInTopic":0,"msgSnippet":"-=-I don t think that having authority over anyone leads to a partnership; especially not one between parent and child. Did you mean something different by","messageBody":"<div id=\"ygrps-yiv-232216010\">-=-I don&#39;t think that having &quot;authority over&quot; anyone leads to a<br/>\npartnership; especially not one between parent and child. Did you mean<br/>\nsomething different by &quot;authority over&quot; than what I understand it to<br/>\nmean?-=-<br/>\n<br/>\nUnless someone has authority, how can a partnership be chosen over  <br/>\nother options and responsibilities (to the government, the family, the  <br/>\nneighborhood).<br/>\n<br/>\nThe child and parent aren&#39;t equal partners.  The one with the freedom  <br/>\nto give freedom grants some of it to a new partner in the world.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Authority","postDate":"1273004404","msgId":53806,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEMzMjBBNkM3LTUyN0EtNEI1Mi1BMEFELThDQTZCREE1MzNFOEBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PGhybzJyOCtzanF2QGVHcm91cHMuY29tPg==","referencesHeader":"PGhybzJyOCtzanF2QGVHcm91cHMuY29tPg=="},"prevInTopic":53770,"nextInTopic":53809,"prevInTime":53805,"nextInTime":53807,"topicId":53770,"numMessagesInTopic":0,"msgSnippet":"... As an unschooler, I reject the notion of authoritarian parenting; instead I prefer mindful parenting. Authoritarian is defined as favoring strict","messageBody":"<div id=\"ygrps-yiv-1682737789\"><blockquote><span title=\"ireply\">&gt; I am currently in a discussion with some other moms about  <br/>\n&gt; unschooling.  They are homeschoolers and &quot;unschoolish&quot; or relaxed  <br/>\n&gt; homeschoolers.   They seem to feel that radical unschoolers  <br/>\n&gt; completely reject the idea of any parental authority.  I was curious  <br/>\n&gt; what the thoughts here are.<br/>\n<br/>\n </span></blockquote>As an unschooler, I reject the notion of &quot;authoritarian&quot; parenting;  <br/>\ninstead I prefer mindful parenting. &quot;Authoritarian&quot; is defined as  <br/>\n&quot;favoring strict rules and established authority.&quot; I prefer principles.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I think of authority as my responsibility to my child to keep them  <br/>\n&gt; safe, provide food, shelter, love, guidance, and in the context of  <br/>\n&gt; unschooling, lots of opportunities to learn.  Also, that it is my  <br/>\n&gt; responsibility to protect other people and their possessions from my  <br/>\n&gt; child if my child is being destructive.<br/>\n<br/>\n </span></blockquote>Authority and responsibility can be understood as two different  <br/>\nthings. Authority can be defined as &quot;power.&quot; Responsibility can be  <br/>\ndefined as &quot;accountability.&quot;<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I think the word authority has bad connotations for some people,  <br/>\n&gt; especially if they were raised with a lot of *control* and are  <br/>\n&gt; raising their kids with a lot more freedom.  On the other hand, the  <br/>\n&gt; people who I&#39;m talking with do gentle discipline, are unschoolish,  <br/>\n&gt; and feel that their authority is an essential part of parenting.<br/>\n<br/>\n </span></blockquote>What do you consider &quot;gentle discipline&quot;?<br/>\n<br/>\nI&#39;m snipping out the definitions that wouldn&#39;t be relevant to some  <br/>\nparents and leaving the ones that might be:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; 1. the power to determine, adjudicate, or otherwise settle issues or  <br/>\n&gt; disputes; jurisdiction; the right to control, command, or determine.<br/>\n&gt; 2. a power or right delegated or given; authorization: Who has the  <br/>\n&gt; authority to grant permission?<br/>\n&gt; 3. an accepted source of information, advice, etc.<br/>\n<br/>\n<br/>\n </span></blockquote>&lt;snip&gt;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; 7. an expert on a subject: He is an authority on baseball.<br/>\n&gt; 8. persuasive force; conviction: She spoke with authority.<br/>\n<br/>\n </span></blockquote>&lt;snip&gt;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; 10. right to respect or acceptance of one&#39;s word, command, thought,  <br/>\n&gt; etc.; commanding influence: the authority of a parent; the authority  <br/>\n&gt; of a great writer.<br/>\n&gt; 11. mastery in execution or performance, as of a work of art or  <br/>\n&gt; literature or a piece of music.<br/>\n<br/>\n </span></blockquote>&lt;snip&gt;<br/>\n<br/>\nI&#39;d say that Sandra, Joyce, Pam and a number of others speak with  <br/>\nauthority (definition 8) on this list. However, they are not  <br/>\nauthoritarian &lt;g&gt;.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Using that definition, yes I do believe I have authority over my  <br/>\n&gt; child.  However, as an unschooler, I choose to use that authority to  <br/>\n&gt; provide my child with lots of opportunities to learn and give them  <br/>\n&gt; lots of chances to make their own decisions.<br/>\n<br/>\n </span></blockquote>Using which definition?<br/>\n<br/>\nI don&#39;t think that having &quot;authority over&quot; anyone leads to a  <br/>\npartnership; especially not one between parent and child. Did you mean  <br/>\nsomething different by &quot;authority over&quot; than what I understand it to  <br/>\nmean?<br/>\n<br/>\nRobin B.</div>","specialLinks":[]},{"userId":324049237,"authorName":"Emily S","from":"&quot;Emily S&quot; &lt;saturnfire16@...&gt;","profile":"saturnfire16","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Authority","postDate":"1272942248","msgId":53770,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhybzJyOCtzanF2QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":53806,"prevInTime":53769,"nextInTime":53771,"topicId":53770,"numMessagesInTopic":0,"msgSnippet":"I am currently in a discussion with some other moms about unschooling.  They are homeschoolers and unschoolish or relaxed homeschoolers.   They seem to feel","messageBody":"<div id=\"ygrps-yiv-1426543643\">I am currently in a discussion with some other moms about unschooling.  They are homeschoolers and &quot;unschoolish&quot; or relaxed homeschoolers.   They seem to feel that radical unschoolers completely reject the idea of any parental authority.  I was curious what the thoughts here are. <br/>\n<br/>\nI think of authority as my responsibility to my child to keep them safe, provide food, shelter, love, guidance, and in the context of unschooling, lots of opportunities to learn.  Also, that it is my responsibility to protect other people and their possessions from my child if my child is being destructive.  <br/>\n<br/>\nI think the word authority has bad connotations for some people, especially if they were raised with a lot of *control* and are raising their kids with a lot more freedom.  On the other hand, the people who I&#39;m talking with do gentle discipline, are unschoolish, and feel that their authority is an essential part of parenting.  <br/>\n<br/>\nI looked up the definition:<br/>\n<br/>\n1.<br/>\nthe power to determine, adjudicate, or otherwise settle issues or disputes; jurisdiction; the right to control, command, or determine.<br/>\n2.<br/>\na power or right delegated or given; authorization: Who has the authority to grant permission?<br/>\n3.<br/>\na person or body of persons in whom authority is vested, as a governmental agency.<br/>\n4.<br/>\nUsually, authorities. persons having the legal power to make and enforce the law; government: They finally persuaded the authorities that they were not involved in espionage.<br/>\n5.<br/>\nan accepted source of information, advice, etc.<br/>\n6.<br/>\na quotation or citation from such a source.<br/>\n7.<br/>\nan expert on a subject: He is an authority on baseball.<br/>\n8.<br/>\npersuasive force; conviction: She spoke with authority.<br/>\n9.<br/>\na statute, court rule, or judicial decision that establishes a rule or principle of law; a ruling.<br/>\n10.<br/>\nright to respect or acceptance of one&#39;s word, command, thought, etc.; commanding influence: the authority of a parent; the authority of a great writer.<br/>\n11.<br/>\nmastery in execution or performance, as of a work of art or literature or a piece of music.<br/>\n12.<br/>\na warrant for action; justification.<br/>\n13.<br/>\ntestimony; witness. <br/>\n<br/>\nUsing that definition, yes I do believe I have authority over my child.  However, as an unschooler, I choose to use that authority to provide my child with lots of opportunities to learn and give them lots of chances to make their own decisions.  <br/>\n<br/>\nWhat do you all think?<br/>\n<br/>\nEmily</div>","specialLinks":[]}],"prevTopicId":53914,"nextTopicId":53923}}