{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Being kind to dads","postDate":"1353622853","msgId":69692,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNTM2MjI4NTMuMjYxLllhaG9vTWFpbE5lb0B3ZWIxODYxMDQubWFpbC5pcjIueWFob28uY29tPg==","inReplyToHeader":"PEJGNzM5RTY0LTBGOEItNDI0OC04QkIzLTFFNjI2MjBEMDhDMUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PEJGNzM5RTY0LTBGOEItNDI0OC04QkIzLTFFNjI2MjBEMDhDMUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":69691,"nextInTopic":0,"prevInTime":69691,"nextInTime":69693,"topicId":69686,"numMessagesInTopic":0,"msgSnippet":"I like making bread. I love my sourdough bread. But I also love the memory of the rolls my grandmother would buy and pop in the oven to warm up for","messageBody":"<div id=\"ygrps-yiv-1007294780\">I like making bread. I love my sourdough bread. But I also love the memory of the rolls my grandmother would buy and pop in the oven to warm up for Thanksgiving or for Christmas dinner. They were fluffy and white or fluffy and brown. One would smear them with easy spread margarine, not butter, butter tears, and use them to sop up any things that needed sopping. I would just eat them straight. They were so immediate in their warmth and in this manifestation of my grandmother&#39;s love for each of us. Just like the jello she&#39;d make special for me that didn&#39;t have any carrots in it, &#39;cause I didn&#39;t like my jello with carrots. <br/>\n<br/>\nMaybe their homemade bread isn&#39;t any good. My bread sucked for a long time. Or I thought so and so did Simon. My bread took a long time to get to the point where it is the preferred bread in the house. Something like 10 years. And it still isn&#39;t always the best option for what you want. If you want a bread to get all kind of pulpy, my bread won&#39;t cut it. It isn&#39;t the bread to melt into warm chips/fries when having a chip butty. It&#39;s good with soup and with risotto and it makes a sandwich look amazing. And I&#39;m proud of it. But I don&#39;t think I would rally against David if he didn&#39;t like it. I don&#39;t think I would look to others to dis my husband for his lack of appreciation of my not what he wanted bread. If he wanted to revisit the love my grandmother gave him, he&#39;d need a different kind of bread entirely. And jello with or without carrots. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n________________________________<br/>\n From: Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt;<br/>\n=========================<br/>\n<br/>\nBreadmaking shouldn&#39;t come before a loving relationship with a partner.<br/>\nEven if everyone else in one&#39;s social circle or political crowd or nation is being selfish and disdainful of their partners, it&#39;s okay for one person to be kinder to her own husband for the benefit of her children&#39;s peace and stability.<br/>\n<br/>\nSandra<br/>\n<br/>\n------------------------------------<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Being kind to dads","postDate":"1353620351","msgId":69691,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNTM2MjAzNTEuOTc0OTYuWWFob29NYWlsTmVvQHdlYjE4MjIwNS5tYWlsLmJmMS55YWhvby5jb20+","inReplyToHeader":"PEJGNzM5RTY0LTBGOEItNDI0OC04QkIzLTFFNjI2MjBEMDhDMUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PEJGNzM5RTY0LTBGOEItNDI0OC04QkIzLTFFNjI2MjBEMDhDMUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":69686,"nextInTopic":69692,"prevInTime":69690,"nextInTime":69692,"topicId":69686,"numMessagesInTopic":0,"msgSnippet":"Just today at my sister s house her husband asked for the TV remote while she was standing in front of them and he was sitting watching. He had already gotten","messageBody":"<div id=\"ygrps-yiv-686579222\">Just today at my sister&#39;s house her husband asked for the TV remote while she was standing in front of them and he was sitting watching. He had already gotten up early to cook a wonderful thanksgiving meal for us in his day of as a real Chef and while he was not feeling totally well.  She handed it to him but not all the way so he needed to get halfway  up to reach all the way to her. It was petty.  <br/>\nI said just give it to him. He was tired and had just had lunch that he spent hours cooking. She still wanted him to get half way up. I just got up, took the controls off her hand and handed to him and told her to be nice to him.<br/>\n<br/>\nA couple minutes later we decided to do desert as my husband had to be home to breed some cows ( yep! You read right!)So she calls her husband to come help her. I got up and said let him stay down. He had just said he thought he had a low grade fever. I said I could do it so he should stay sitting with my husband watching the game. It was sweet. He had been so wonderful and welcoming to my family. <br/>\nThere was no need for him to get up when he is not feeling well.<br/>\nThen my brother in law asked me to come spend a week so my sister could learn with me.<br/>\n<br/>\nMy sister and I do talk a lot about things like that and she does try and has gotten a little nicer .She tries but has not quite gotten it yet how to make her life sweeter both towards her husband and her kids.<br/>\nShe still cannot shake the me vs you, you-did-it-so-I-do-it-too or You-did-not-so-I-wont-do-it-either.<br/>\nI told her husband I have gotten so much nicer than before and asked Brian, my husband if I was nice to him. He sweetly said yes but my sister and her husband were laughing and saying that of course he would answer that or he was in trouble. <br/>\nThing is he was being honest and he would not get in trouble. Year ago yes. He would have. I was not nice. I complained. I ragged on him ( his words). But all I have learned here and unschooling my children has really changed my life, my family and my marriage. It is so much sweeter  and peaceful then before.<br/>\n <br/>\nThis Thanksgiving I can honestly say to the people in these list and other wonderful unschooling parents that share their ideas that I am thankful for  them. <br/>\nI am happy, my kids are happy, my husband is happy, our family is  sweet and peacefull and we are a bunch of people with very strong personalities! <br/>\n<br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Being kind to dads","postDate":"1353599857","msgId":69686,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJGNzM5RTY0LTBGOEItNDI0OC04QkIzLTFFNjI2MjBEMDhDMUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":69691,"prevInTime":69685,"nextInTime":69687,"topicId":69686,"numMessagesInTopic":0,"msgSnippet":"... -=-Rather than telling him, help him be nice, be thoughtful. Work together to do nice things for his Dad. Making something Dad likes especially. Bringing","messageBody":"<div id=\"ygrps-yiv-587053536\">Joyce had a suggestion for Jo on another topic.  I want to comment on the general idea:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; We have always asked Sam to speak nicely to Jay (and others)<br/>\n<br/>\n </span></blockquote>-=-Rather than telling him, help him be nice, be thoughtful. Work together to do nice things for his Dad. Making something Dad likes especially. Bringing him a cup of coffee. Peeling and orange and arranging it nicely on a plate. Think about things that will make his Dad smile.-=-<br/>\n<br/>\n=========================<br/>\n<br/>\nI like Joyce&#39;s suggestion.<br/>\n<br/>\nLast summer I was in Leiden speaking to a group that Rippy had gathered.  Someone asked about a dad who&#39;s reluctant, not on board, doesn&#39;t get it, gets frustrated... something like that.   When I suggested letting the dad come home and relax, take him a beer, the whole group laughed.  They laughed at me, at the suggestion, like it was stupid.  Not like it was cute or amusing.  <br/>\n<br/>\nAt first I thought it was &quot;beer.&quot;  Is this a wine-drinking country?  I wondered.  Have I used a stereotype or idiom or accidently triggered something culturally funny?  <br/>\n<br/>\nNo.  Turns out they&#39;re in an equality/feminist phase in which the wife taking the husband a beer seems (I don&#39;t know what word they would have used.... servile?)... politically incorrect.<br/>\n<br/>\nI must say that this will soon put them into a phase in which divorce is likely.<br/>\n<br/>\nThis morning I was reading a breadmaking forum.  Someone from New Zealand started criticizing her husband, who doesn&#39;t like her bread as much as storebought, but she said she wans&#39;t going to buy storebought.  Others were jumping in to say bad things about husbands who didn&#39;t appreciate homemade bread.<br/>\n<br/>\nSomeone else wrote (note the word &quot;nasty&quot;):<br/>\n__________<br/>\nMy step-family doesn&#39;t like whole wheat much either as they were raised on Wonder Bread. I&#39;m amazed when they choose packaged, nasty white buns over fresh out of the oven WW buns. But, to each their own.<br/>\n<br/>\nLet your hubby go breadless awhile and than see how he likes your bread!<br/>\n_________<br/>\n<br/>\nThe original complainer wrote (note &quot;crap&quot;):<br/>\n******<br/>\nMaybe it&#39;s too juch practicing crap fluffy white stuff for the husband....<br/>\n<br/>\nHe&#39;s just a whinger, too old to chnage now, anyway, I&#39;ll get there yet with his bread.<br/>\n<br/>\nI&#39;ll just make real bread for me and rubbish fluff for him.<br/>\n******<br/>\n<br/>\nSomeone else wrote &quot;Personally it sounds as if he is manipulating you with his passive agressive whining.&quot;<br/>\n<br/>\nThere is more anti-husband stuff after that.<br/>\n<br/>\nBreadmaking shouldn&#39;t come before a loving relationship with a partner.<br/>\nEven if everyone else in one&#39;s social circle or political crowd or nation is being selfish and disdainful of their partners, it&#39;s okay for one person to be kinder to her own husband for the benefit of her children&#39;s peace and stability.<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":69672,"nextTopicId":69693}}