{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":8226888,"authorName":"Robin Clevenger","from":"&quot;Robin Clevenger&quot; &lt;diamondair@...&gt;","profile":"the_clevengers","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Toxic schools- another reason what we are doing is right: Long","postDate":"1051546627","msgId":66300,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTMtREFWMjVjOUxOWWJEd00wMDAxMGVmZEBob3RtYWlsLmNvbT4=","referencesHeader":"PDEwNTE0OTk2MjEuMTM3OC44ODUyMy5tN0B5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":66189,"nextInTopic":0,"prevInTime":66299,"nextInTime":66301,"topicId":66189,"numMessagesInTopic":0,"msgSnippet":"When I was in gradeschool, we used to jump up to see if we could hit the overhead pipes. Then dust would rain down on us because the insulation was so old (my","messageBody":"<div id=\"ygrps-yiv-1385011245\">When I was in gradeschool, we used to jump up to see if we could hit the<br/>\noverhead pipes. Then dust would rain down on us because the insulation was<br/>\nso old (my mom went to gradeschool in the same building). Asbestos dust<br/>\nactually. They finally took it out a few years after I left I think. Wonder<br/>\nhow much of it I got on my hair, skin, lungs in those years.<br/>\n<br/>\nBlue Skies,<br/>\n-Robin-</div>","specialLinks":[]},{"userId":139549710,"authorName":"Olga","from":"&quot;Olga&quot; &lt;britcontoo@...&gt;","profile":"britcontoo","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Toxic schools- another reason what we are doing is right: Long","postDate":"1051495361","msgId":66189,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGI4aTI0MStlbWhtQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":66300,"prevInTime":66188,"nextInTime":66190,"topicId":66189,"numMessagesInTopic":0,"msgSnippet":"Here is an article about mold in Florida schools.  Although it discusses southern Florida, I thought it generally showed the bureaucracy of school distrcits","messageBody":"<div id=\"ygrps-yiv-100516720\">Here is an article about mold in Florida schools.  Although it <br/>\ndiscusses southern Florida, I thought it generally showed the <br/>\nbureaucracy of school distrcits and where children fit in their <br/>\nagenda.  I tried to put in the link but it would not work so here is <br/>\nthe article, kind of long but hopefully worthwhile:<br/>\n<br/>\nToxic Schools<br/>\n<br/>\nBy Trish Riley<br/>\n<br/>\n<br/>\nMold problems are widespread in humid South Florida -- affecting the <br/>\nhealth of teachers and students, while school boards throughout the <br/>\nregion lag in solving the problem. <br/>\n<br/>\nOne South Florida teacher spent a year working in a damp classroom, <br/>\nwell aware that mold was growing in the corners and ceiling and <br/>\nclinging to the walls. She filed complaints and documented incidents <br/>\nand responses. She developed a cold, a yeast infection, a virus, a <br/>\nrespiratory illness. She was treated for allergies. She became so <br/>\ntired she couldn&#39;t do anything but sleep when she was off work. She <br/>\ngot what they call &quot;foggy brain syndrome&quot; -- she just couldn&#39;t <br/>\nconcentrate on things long enough to solve them. There were <br/>\nindications of lupus. Finally her doctor told her she just couldn&#39;t <br/>\ngo back to that moldy room -- it was ruining her health. Afraid to <br/>\njeopardize her court-won pension and insurance settlement, she can&#39;t <br/>\nreveal her identity, but she&#39;s now on permanent disability. Although <br/>\nher health has improved since getting out of the moldy classroom, she <br/>\nexperiences recurrences whenever she encounters any molds, chemicals, <br/>\nstress or even average physical exertion. <br/>\n<br/>\nHer reaction was severe, but it demonstrates what long-term exposure <br/>\nto mold can do. Some people take longer to react to toxins in their <br/>\nenvironment than others, but it is not uncommon for immune systems to <br/>\nlose resistance to constant attacks. Children with immature systems <br/>\nand those already disabled with asthma and allergies are at <br/>\nparticular risk. <br/>\n<br/>\nAssessing the risk <br/>\n<br/>\nIf your child is in school, there&#39;s at least some possibility of <br/>\ndaily exposure to mold and mildew. Some studies estimate that half <br/>\nthe public schools in this country have unsatisfactory air quality <br/>\nissues -- and in humid South Florida, the incidence of mold in <br/>\nschools is potentially even higher. The exposure can cause serious <br/>\nhealth problems. <br/>\n<br/>\nJonathan Lawson, a sixth-grader at Western Pines Middle School in <br/>\nRoyal Palm Beach, had to leave his classroom 14 times over the first <br/>\n20 days of school, calling home and telling his mother he couldn&#39;t <br/>\nbreathe. &quot;He tells me, &#39;It feels like someone&#39;s sitting on my chest --<br/>\n I can&#39;t take it anymore,&#39;&quot; says his mother, Cynthia Lawson. &quot;I&#39;m <br/>\nvery frustrated. He&#39;s having such a hard time with his grades. It was <br/>\nthe same last year at Golden Globe Elementary next door. The nurses <br/>\nsaved Jonathan on more than one occasion.&quot; <br/>\n<br/>\nProblems like these are widespread in South Florida, and although <br/>\nschool officials seem now to be addressing the problem, progress is <br/>\nslow. <br/>\n<br/>\n&quot;Schools have mold for a variety of reasons,&quot; says Chris Skerlec, <br/>\nenvironmental control officer for Palm Beach County Schools, whose <br/>\noffice investigates about 300 indoor air quality complaints a <br/>\nyear. &quot;Mold spores are everywhere. You cannot prevent them,&quot; he says. <br/>\nHowever, &quot;you can keep the humidity low, keep the place dry and <br/>\nclean. You can cure 95 percent of your air quality issues. It&#39;s not <br/>\nrocket science.&quot; <br/>\n<br/>\nMaybe not, but it is expensive science. For example, 24 Palm Beach <br/>\nCounty schools were found to have a faulty air conditioning system <br/>\ndesigned by W.R. Frizzell. The firm filed bankruptcy before the <br/>\nschool board could collect a judgment, so the school received only <br/>\n$450,000 in restitution. The Palm Beach Post reported that repairs on <br/>\nonly ten of the affected schools were estimated to cost $20 million. <br/>\nThose funds were set aside, according to school board members, but <br/>\nonly three of the 10 schools were fixed, with two more scheduled to <br/>\nbe fixed this year. <br/>\n<br/>\nA preliminary report to the Broward School Board suggests a potential <br/>\ncost of $2.5 billion to renovate schools with a variety of <br/>\nmaintenance problems, including mold abatement. A capital improvement <br/>\nplan from 1998 committed $44 million to clean up mold problems in 155 <br/>\nschools over a five-year period, but an internal audit pointed up <br/>\nproblems with meeting the plans goals last year. <br/>\n<br/>\nJeff Moquin, director of risk management for the Broward School <br/>\nBoard, says that he deals with mold and moisture issues in the <br/>\nschools daily. &quot;We have water intrusion through leaks or humidity <br/>\nissues with the HVAC (heating, ventilation and air conditioning) <br/>\nsystems. Some of these issues require design time, bidding the job <br/>\nout to a contractor and time to complete the work, and some of the <br/>\nmoney only became available this year. (Of those identified in the <br/>\n1998 plan), we have 10 to 12 schools 100 percent complete, with 90 <br/>\nschools three-quarters done. Some are in the design phase, others are <br/>\nin construction.&quot; <br/>\n<br/>\nIn Miami-Dade, &quot;We&#39;re looking at correcting mold situations at <br/>\napproximately 15 schools,&quot; says John Schuster, spokesperson for Miami-<br/>\nDade Public Schools. &quot;It&#39;s a range of things that need to be <br/>\ncorrected. We find a lot of situations arise because we&#39;re dealing <br/>\nwith older buildings that may have older AC systems and/or water <br/>\nintrusion. It may be something as simple as replacing ceiling tiles <br/>\nto having to arrange a water seal for an entire roof.&quot; <br/>\n<br/>\nBut involved Miami-Dade parents and teachers say the board is not <br/>\ndoing nearly enough to keep the school buildings maintained. &quot;The <br/>\nMiami-Dade public school district has squandered hundreds of millions <br/>\nof public dollars intended for school construction and maintenance. <br/>\nMeanwhile, it has grossly neglected the condition of virtually all of <br/>\nits school facilities,&quot; says Surfside Mayor Paul Novack, who has been <br/>\nappointed to a state committee assigned to oversee Miami-Dade <br/>\nschools. <br/>\n<br/>\nFIGHTING THE FIGHT <br/>\n<br/>\nThe Florida weather -- damp, hot and humid -- doesn&#39;t help. Mold will <br/>\ngrow here, just as it has always grown here. There are at least 1,000 <br/>\ntypes of fungus commonly found in North American buildings, and 200 <br/>\nare known to be harmful to humans. While it&#39;s unlikely that the crud <br/>\nin your shower is harmful, exposure to certain mold strains can cause <br/>\nallergic reactions and illness in some people, including those who <br/>\ndevelop sensitivity after long-term exposure, such as teachers. <br/>\n<br/>\nDr. Herbert Moselle, an allergist in Plantation for the past 34 <br/>\nyears, says there have always been mold problems, no worse today than <br/>\nthey ever were. &quot;I always have teachers -- a minimum of 10 a week <br/>\ncome through this office,&quot; he says. Patients are first advised to <br/>\neliminate their exposure to the allergen. The next line of treatment <br/>\nis with antihistamines and similar products, finally immunotherapy -- <br/>\nshots administered weekly over a long period of time. But to treat <br/>\nfor molds, doctors must identify the cause. If parents aren&#39;t aware <br/>\nthere&#39;s a mold problem at school, it may take longer to determine <br/>\nwhat&#39;s causing their child&#39;s allergic symptoms. <br/>\n<br/>\nMary MacFie spent years taking her daughter Heather to specialists -- <br/>\neven as far away as New York -- but none were able to diagnose her <br/>\nvomiting, her migraines, her face so swollen she couldn&#39;t see. <br/>\nHeather&#39;s teachers suggested that her parents come talk to them, but <br/>\nMacFie thought there was no point: Doctors hadn&#39;t figured out what <br/>\nwas wrong with her daughter, what could they know? Finally a teacher <br/>\ntook her aside and told her that many of the teachers at the school, <br/>\nthe Western High Annex in Sunrise, were sick with the same symptoms. <br/>\n<br/>\n&quot;Mold, they told me. I said, &#39;What are you talking about? Spray it <br/>\nwith bleach, call the health department, call OSHA.&#39; &#39;We have,&#39; they <br/>\nsaid. &#39;It doesn&#39;t do any good,&#39;&quot; MacFie says. <br/>\n<br/>\nTeachers can be confined to the same classroom all day long for years <br/>\non end. Even though their health is affected, many are reluctant to <br/>\nspeak up. <br/>\n<br/>\nOne way to break through a bureaucratic wall is the American way, <br/>\nwith lawsuits. Fort Lauderdale attorney Bob McKee represents 32 <br/>\nstudents and teachers across Palm Beach and Broward counties. &quot;I get <br/>\n100 calls a month, but I can only take on a few more cases each <br/>\nmonth. I think the way to represent is in a group suit,&quot; McKee says. <br/>\n<br/>\nJohn Countryman, assistant state attorney for Broward County, has <br/>\ninterviewed more than 100 teachers and parents affected by mold in <br/>\ntheir schools in preparation of a report to be presented to a grand <br/>\njury for review this spring. A grand jury review of school <br/>\nconstruction in 1997 revealed an unsavory picture of funds wasted on <br/>\ninferior construction. <br/>\n<br/>\nRapid overdevelopment throughout South Florida called for quick <br/>\nschools. Tight budgets led to faulty design and shoddy work. In Palm <br/>\nBeach County, several schools&#39; mildew problems have been linked to a <br/>\ncontractor that was fired from the job. In Broward, architect Donald <br/>\nSinger was held to blame for poor design of nine schools, and <br/>\nultimately paid a settlement of $750,000. Architectural firm Miller, <br/>\nMeier, Kenyon and Cooper was responsible for the faulty design of <br/>\nanother five Broward schools, but has gone out of business. In Miami-<br/>\nDade, the list of contractor failures is embarrassingly long. &quot;Over <br/>\nthe last 19 years we&#39;ve spent $6 billion on facilities alone,&quot; Novack <br/>\nsays, &quot;yet the public has very little to show for that investment.&quot; <br/>\n<br/>\nAcross all three counties, cleanup efforts have been piecemeal at <br/>\nbest. The ceiling at Western High looks like a checkerboard of tiles <br/>\nof various ages, styles and colors because when mold got into the <br/>\nceiling, tiles were replaced one at a time. But since mold spores are <br/>\nairborne and attach themselves to any organic material, including <br/>\nwood, paper, fabric and carpets, this has proven an ineffective means <br/>\nof eradicating the problem. <br/>\n<br/>\n&quot;We had mushrooms growing on the floors from the moisture seeping <br/>\nup,&quot; says Dick Keen of his portable classroom at the Western <br/>\nAnnex. &quot;My throat swelled up, lymph glands were hurting and I was <br/>\nmissing a lot of school. I went to the allergist and he told me it <br/>\nwas mold, no doubt about it. Finally my floor got so weak a student <br/>\nstepped right through it. When they pulled it up there was a half-<br/>\ninch of this gelatinous slime. They replaced it in pieces, and with <br/>\nthe same wood. The worst thing is they&#39;re thinking about putting kids <br/>\nback in those portables.&quot; <br/>\n<br/>\nSOLUTIONS <br/>\n<br/>\nPalm Beach County school officials say they&#39;re dealing with problems <br/>\nas they find them, although they are reluctant to admit any real <br/>\nproblems exist. &quot;We did find mold present at Banyan Elementary School <br/>\nthree years ago and replaced the air conditioning system. Since then <br/>\nwe have looked at all of our other schools with similar air <br/>\nconditioning systems, but have not found any other problems,&quot; says <br/>\nspokesman Nat Harrington. Meanwhile, Cynthia Lawson is left to wonder <br/>\nwhy her son can&#39;t breathe at the Royal Palm school he attends. <br/>\n<br/>\nThe board has partnered with the American Lung Association in its <br/>\nAsthma Free Schools project, providing air-quality training to staff <br/>\nat 20 schools last year and 20 more this year. &quot;The schools are doing <br/>\nwhat they can,&quot; says Cindy Vallo, with the American Lung Association <br/>\nof Southeast Florida. &quot;The key is to prevent mold by keeping things <br/>\nclean and dry. If you&#39;ve got a leak, fix it and make sure it&#39;s dried <br/>\nwithin 24 hours.&quot; <br/>\n<br/>\nThe Broward School Board, under pressure from the state attorney&#39;s <br/>\noffice, is developing another maintenance, repair and construction <br/>\nplan that includes mold and mildew remediation throughout the <br/>\ndistrict. A new bidding prequalification process helps to eliminate <br/>\nincapable construction companies, and new schools have been designed <br/>\nwith mold and mildew prevention in mind. Open breezeways and <br/>\nclassroom windows provide better ventilation and most floors are <br/>\ntiled rather than carpeted. Thermostats are monitored and teams work <br/>\nfull-time maintaining heating and air conditioning ventilation <br/>\nsystems. Broward Superintendent Frank Till recently announced a plan <br/>\nto hire an administrator who will be responsible for addressing mold <br/>\nissues. Some view the move with relief; others see it as another <br/>\nstalling tactic that will delay progress. <br/>\n<br/>\n&quot;Many existing schools are in need of substantial repairs, and the <br/>\nlonger it takes, the greater the cost,&quot; says Assistant State Attorney <br/>\nCountryman. &quot;A huge percentage of our taxes goes toward our schools, <br/>\nand I don&#39;t think most people begrudge that. The question is how it&#39;s <br/>\nbeing spent.&quot; <br/>\n<br/>\nSimilarly, in Miami-Dade County, teachers and parents charge that an <br/>\nunresponsive board has left schools to deteriorate year after <br/>\nyear. &quot;Many school districts just don&#39;t have the money, but here in <br/>\nMiami-Dade County that&#39;s not the problem at all. There are billions <br/>\nof dollars flowing every year. They just can&#39;t seem to produce <br/>\nresults with that money,&quot; Novack says. &quot;The only questions the policy <br/>\nmakers are considering are: Do they fix it or do they continue to <br/>\nignore it? That&#39;s not a choice. You must fix these buildings that are <br/>\noccupied by thousands of students every day.&quot; <br/>\n<br/>\nThe Miami-Dade school safety department offers principals a checklist <br/>\nto help them deal effectively with mold problems. Several principals -<br/>\n- including Jeanne Friedman, principal at Miami Beach Senior High <br/>\nwhere Novack&#39;s son attends school -- said the department responded <br/>\nquickly to mold issues at their schools. <br/>\n<br/>\n&quot;The school districts have become experts at shunning parents away <br/>\nand discouraging their calls for improvement,&quot; says Novack, who has <br/>\ncollected a scrapbook of photos of mold problems in several <br/>\nschools. &quot;The district has been operating in the dark for years, and <br/>\nthey&#39;ve been actively avoiding letting the public know what&#39;s going <br/>\non.&quot; <br/>\n<br/>\nThe only real solution, says Dr. Moselle, is to tear down infected <br/>\nbuildings and rebuild mold-resistant structures. &quot;We have to spend <br/>\nthe money up front and do preventive work, then we won&#39;t have to keep <br/>\ntearing down schools and redoing them, and spending on medical care.&quot; <br/>\n<br/>\nMary MacFie has worked with School Board members and others in the <br/>\ncommunity to organize workshops to help inform parents about the <br/>\ndangers of mold and symptoms to watch for. Her daughter Heather, now <br/>\n15, has moved on to Cypress Bay High in Weston, a new school built <br/>\nwith mold prevention in mind. Her health is much improved now, but <br/>\nMacFie doesn&#39;t rest. School administrators are on notice that her <br/>\ndaughter may not be placed in a portable classroom. A grove of them <br/>\nstands next to the school ready to absorb the impending overflow. <br/>\n<br/>\n&quot;They&#39;re swearing to me that my daughter won&#39;t be put into a <br/>\nportable, but what about everybody else? Should I shut up when other <br/>\npeople might be sick? I have people mad at me because I won&#39;t stop <br/>\ntalking about mold,&quot; she says. &quot;But I don&#39;t know how to make people <br/>\nrealize how serious this really is. The children&#39;s health is at risk, <br/>\nand the teachers&#39; health is at risk.&quot; <br/>\n<br/>\nTHE CALL TO ACTION <br/>\n<br/>\nIt is clear that parents and other concerned citizens must join the <br/>\neffort to clean up our schools. &quot;I wish we had parental involvement,&quot; <br/>\nsays West Kendall media specialist Karen Sick, &quot;because once the <br/>\nparents start screaming, the district starts listening.&quot; Part of the <br/>\nproblem, she says, is that parents don&#39;t realize there are health <br/>\nproblems at the school. &quot;A parent walking into our school wouldn&#39;t <br/>\nsee the health problems that the teachers are having. Their kids <br/>\nmight come home with symptoms but they think it&#39;s the flu or <br/>\nallergies.&quot; <br/>\n<br/>\nPaul Novack agrees. &quot;Let the public know we don&#39;t have to accept the <br/>\nstatus quo -- if they can&#39;t provide a safe and secure environment for <br/>\nour children, we are not helpless to change things. What&#39;s most <br/>\nimportant is the well-being and education of our community&#39;s <br/>\nchildren.&quot; <br/>\n<br/>\nHelp for Improving Indoor Air Quality <br/>\n<br/>\nThe U.S. Environmental Protection Agency provides several resources <br/>\nfor mold information and control: Mold Remediation in Schools and <br/>\nCommercial Buildings: A guide that includes information on how to <br/>\nrecognize mold in large buildings and what must be done to remove it <br/>\n(EPA 402-K-01-001 or www.epa.gov/iaq/molds/mold_remediation.html <br/>\n<br/>\nIAQ Tools for Schools Kit: A guided program for parents and teachers <br/>\nto work with administrators in getting their schools tested and mold <br/>\nremoved, the kit shows schools how to carry out a practical plan of <br/>\naction that will maintain or improve indoor air quality using common-<br/>\nsense activities and in-house staff. Co-sponsored by the National <br/>\nEducation Association, National PTA, Council for American Private <br/>\nEducation, Association for School Business Officials, American <br/>\nFederation of Teachers and the American Lung Association (EPA-402-K-<br/>\n02-005 or <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.epa.gov/iaq/schools/index.html)\">http://www.epa.gov/iaq/schools/index.html)</a>. <br/>\n<br/>\nTo order these and other brochures on indoor air quality, visit the <br/>\nEPA web site at www.epa.gov/iaq/pubs or mail or call requests to <br/>\neither address below. Use the EPA Document Number when ordering. <br/>\n<br/>\nIAQ INFO <br/>\nP.O. Box 37133, Washington, DC 20013-7133 <br/>\n800-438-4318/703-356-4020 <br/>\n<br/>\nU.S. Environmental Protection Agency <br/>\nNational Center for Environmental Publications (NSCEP) <br/>\nP.O. Box 42419 <br/>\nCincinnati, OH 42419 <br/>\n800-490-9198<br/>\n<br/>\nTrish Riley is a freelance writer specializing in health issues. She <br/>\nlives in Sunrise.</div>","specialLinks":[]}],"prevTopicId":66032,"nextTopicId":66209}}