{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":0,"authorName":"LisaBugg","from":"&quot;LisaBugg&quot; &lt;LisaBugg@...&gt;","replyTo":"LIST","senderId":"unP_fha7KmhTE_IyFVTwgXchg3xhrIvC6JNpTI1Q97GC2wXVt7Q-vrnHyvG6ooz8aLQ-bCp2UN2IOc1tkArpKY-Po6v1YP7grZB25g","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Why do you believe in the philosophy of unschooling?","postDate":"1000742517","msgId":25874,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDAwMWMxM2Y5NiQ0YjA3NTJlMCQ0NjFjOTNhOEBpZm5ldC5lZHU+","referencesHeader":"PDcwLjEwMDcwZjU5LjI4ZDVhYjRhQGFvbC5jb20+"},"prevInTopic":25845,"nextInTopic":0,"prevInTime":25873,"nextInTime":25875,"topicId":25786,"numMessagesInTopic":0,"msgSnippet":"... The Moore s forumla  is basically unschooling until the age of 12 or so and then a move toward academics for high school.  Most children will do this on","messageBody":"<div id=\"ygrps-yiv-1688480282\"><blockquote><span title=\"ireply\">&gt; &lt;&lt; I&#39;m struggling right now with fine-tuning my philosophy of<br/>\n&gt;  education.  It would be tremendously helpful if anyone is willing to<br/>\n&gt;  share why they believe unschooling is the best way to go.  Why not<br/>\n&gt;  the Charlotte Mason approach?  Or the Moore Formula?  Why do you<br/>\n&gt;  believe what you believe?   &gt;&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>The Moore&#39;s &quot;forumla&quot;  is basically unschooling until the age of 12 or so<br/>\nand then a move toward academics for high school.  Most children will do<br/>\nthis on their own. It&#39;s sort of a natural progression, since those 12 year<br/>\nolds really do want to join the adults in making a living and being<br/>\nindependent.  The Moore&#39;s just move into *bookwork* mode, but acknowledge<br/>\nthat not every child will want or need the same thing. A hands on learner<br/>\nwill stil lbe a hands on learner, so things should be geared to the child.<br/>\nIf you can read between the language used, you&#39;ll find that it&#39;s not a lack<br/>\nof trust in the children, but rather an expectation that *education* means<br/>\nstandard school fare for the Moore&#39;s.<br/>\n<br/>\nCharlotte Mason sort of confuses me.  Narration of a story? Why make that<br/>\nsome formal exercise, don&#39;t you talk about the books you read anyway?  Same<br/>\nthing with a nature journal.... why make it so formal? We draw and talk<br/>\nabout the world around us all the time.  Read real books instead of twaddle,<br/>\nwhy of course!  I&#39;ve used the material on Charlotte Mason&#39;s ideas just like<br/>\nI have used Holt&#39;s and The Moore&#39;s,  I&#39;ve gleaned ideas, used what worked<br/>\nand left the rest behind.<br/>\n<br/>\nI believe what I believe about education simply because it rings that truth<br/>\nbell inside of me.  I know how my own educaiton has progressed during my<br/>\nlife and I&#39;ve watched my four children over the last decade.  Trusting them<br/>\nto grow and learn has been a joy.</div>","specialLinks":[]},{"userId":0,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","replyTo":"LIST","senderId":"n8eVJ1b0wDY9bur7DCIXWPZGbxDruXsw7xQrYnX_VHL9sZ2J9rAkp7CmlCubibVoeuCrHRicIHX1","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Why do you believe in the philosophy of unschooling?","postDate":"1000697225","msgId":25845,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI3LjFiMWU1YjRiLjI4ZDZjNzg5QGFvbC5jb20+"},"prevInTopic":25796,"nextInTopic":25874,"prevInTime":25844,"nextInTime":25846,"topicId":25786,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-857772762\">&lt;&lt; I&#39;m struggling right now with fine-tuning my philosophy of <br/>\neducation.  It would be tremendously helpful if anyone is willing to <br/>\nshare why they believe unschooling is the best way to go.  Why not <br/>\nthe Charlotte Mason approach?  Or the Moore Formula?  Why do you <br/>\nbelieve what you believe?   &gt;&gt;<br/>\n<br/>\nI didn&#39;t know about Charlotte Mason or the Moores when I started <br/>\nhomeschooling.<br/>\n<br/>\nLots of aspects of my life came together to make me a confident advocate of <br/>\nunschooling.  Part of it was the things I learned on my own because I wanted <br/>\nto, when I was a kid.<br/>\n<br/>\nI learned to sew without home-ec, starting at 13.  A friend of mine loaned me <br/>\nan A-line skirt pattern, unfolded it, told me what the notches and lines <br/>\nwere, and I went home and made a skirt.  My grandmother, who had been a <br/>\nprofessional tailor for a while (doing Western suits with those little <br/>\narrow-point slit pockets and all fancy stuff) helped me with a harder skirt <br/>\nlater, and it was a terrible experience--she was super picky and I cried.  <br/>\nThen I started sewing without patterns, and have designed stuff and done lots <br/>\nof costumes.  That, though, was done because I wanted to, and I&#39;ve seen lots, <br/>\ndozens, of friends start as adults knowing zip about sewing and get to the <br/>\npoint that they could do Elizabethan costuming (which I don&#39;t do) without <br/>\nhaving taken any formal lessons, workshops, zip--jut watching other people, <br/>\nreading, experimenting, and having the desire.<br/>\n<br/>\nI learned to play guitar between my first lesson (I was barely 15, the age <br/>\nKirby my oldest is now) and waiting for another one (which was never needed.  <br/>\nI really liked English and Scottish ballads (and American version of them), <br/>\nand wanted to play guitar while I sang, so I worked on that for a few years.  <br/>\nI still make use of that most months at folksinging parties at a friend&#39;s <br/>\nhouse.<br/>\n<br/>\nFor recorder, free classes were advertised when I was 17.  I called the <br/>\ninstructor (John Truitt, who became a good friend of mine) that morning and <br/>\nasked what the difference between beginning and intermediate was.  He said <br/>\nbeginning class they didn&#39;t know how to read music, and didn&#39;t know the <br/>\nfingerings.   I learned the fingerings, went to both classes, stayed in the <br/>\nintermediate, and was in a Renaissance performance group with John within a <br/>\nyear.  I used to tell people he taught me to play recorder, and he would say <br/>\nhe did not.  Because I liked it, I learned it.  Because there was a real <br/>\nreason to get better and it was fascinating, I learned it quickly.<br/>\n<br/>\nBy the time most of that was in process, I was in college and taking <br/>\neducation courses to get a teaching certificate.  It was the early 70&#39;s and <br/>\nthe University of New Mexico was a hippie hotbed of school reform and the <br/>\nopen classroom theories and practices.  They had us read John Holt and other <br/>\nradicals of the day.  They told me (I still have the notebooks I wrote it in) <br/>\nthat teaching didn&#39;t exist; only learning really existed.  The best we could <br/>\ndo was to be the facilitators of other people&#39;s learning, and that kids in <br/>\nschool would learn willingly if they were respected, encouraged and given <br/>\ninteresting experiences.  There were studies at the time they were having us <br/>\nread (many from library sources or bad old photocopies I don&#39;t have anymore; <br/>\nI wish I did!) about the successes of open classroom situation in schools in <br/>\nalternative schools and at lab schools at universities.  They advocated <br/>\nmixed-age classes and multi-level flexibility (ungraded classrooms--one could <br/>\nbe doing advanced math while being a beginning reader, or vice versa, in <br/>\ndifferent combinations).  I had no reason not to believe them and much reason <br/>\nTO believe them.<br/>\n<br/>\nIn practice it wasn&#39;t working as well as it was supposed to have worked, and <br/>\nover the years I had much opportunity to figure out some of the reasons why.<br/>\n<br/>\nBy the time I quit teaching I was hugely involved in the Society for Creative <br/>\nAnachronism, where people learn freely, quickly or slowly, joyfully and <br/>\neffectively all kinds of things from soap making to calligraphy, armoring to <br/>\nwoodwork, because they have a real reason to want to.  They learn from each <br/>\nother and from historical sources and modern instructions based on historical <br/>\narmor, costume, jewelry, recipes--whatever.  There I had thousands of real <br/>\nlife examples, having been a corporate officer several times, twice the top <br/>\nofficer, and having been surrounded by that HUGE learning lab for 24 years <br/>\nnow.<br/>\n<br/>\nWhen I had children I went to La Leche League for years, from which I got the <br/>\nattachment parenting model.  I came again upon John Holt&#39;s writings, through <br/>\nChop Wood, Carry Water (in which he&#39;s quoted and footnoted), The Continuum <br/>\nConcept (which he wrote the attestation for), which are two books he didn&#39;t <br/>\nwrite but were written by people who had read his stuff.  I bought some of <br/>\nhis newer books, written since I&#39;d been out of school, which now said that <br/>\nschool reform didn&#39;t work and the best thing people really interested in how <br/>\npeople learn could do would be to take their kids out of school (or never <br/>\nsend them). I subscribed to Growing Without Schooling, and bought a bunch of <br/>\nback issues, and read every single word.<br/>\n<br/>\nI was in a La Leche League-based (all the families met in LLL) babysitting <br/>\nco-op with four homeschooling families, two structured and two unschooling.  <br/>\nThe unschooling families were much warmer and happier with each other than <br/>\nthe structured families were.  One structured family, the mom spanked the <br/>\ntoddler.  That was sad.  The other one had homework, grounding, punishments, <br/>\nshaming.  The two unschooling families (Carol Rice and Lori Odhner&#39;s <br/>\nfamilies) were also the families of my first two LLL leaders, and I was <br/>\naltogether impressed with their patience and the kids&#39; sweetness and the <br/>\nobvious love between parents and children.<br/>\n<br/>\nThat was enough to sell me on it already, but since then I&#39;ve had three <br/>\nchildren not go to school, learn to read, learn math, ask wonderful questions <br/>\nabout history and science, make wonderful observations on interpersonal <br/>\nrelations and music and art, and have had no cause for doubt.<br/>\n<br/>\nI&#39;ve never been afraid to share the details of the interactions between me <br/>\nand my kids even when I was frustrated and yucky with them sometimes, even <br/>\nwhen I was afraid something wasn&#39;t going to happen.  I had two and a half <br/>\nreading lessons with Kirby when he was seven, and the half was because I <br/>\nrealized what a horrible thing I was doing and stopped halfway throught he <br/>\nthird one because he was crying and I was crying and there has never been <br/>\nanother lesson since, but he reads as well as anyone his age and better than <br/>\nmany, which I know because I&#39;ve taught kids his age before and I remember how <br/>\nsome of them struggled.<br/>\n<br/>\nI know firsthand what teachers go through when they really want to help <br/>\nreform a system that is bigger than all the reformers put together will ever <br/>\nbe.  I have vivid memories of being a kid.  I remember where I sat, every <br/>\nyear since first grade (I didn&#39;t go to kindergarten).  I remember the books <br/>\nwe used.  I remember the songs we sang.  I taught in the same buildings I had <br/>\ngone to school in, 7th grade in the school where I had gone from 2nd to 9th, <br/>\nand 9th grade in the building in which I had gone to high school.  that was <br/>\nanother bigtime lab, teaching alongside many of the people who had been my <br/>\nteachers.  I&#39;ve spent lots of time with kids who wanted school to be <br/>\ndifferent, kids who had given up, kids who managed to make the most of it, <br/>\nkids who learned more from the books they were hiding under their texbooks <br/>\nthan from all of school (and I had been one of them myself, so I never got <br/>\ngrumpy if they were reading another book during lessons).  I&#39;ve talked to <br/>\ntheir parents, to their other teachers, I know some of their children now <br/>\n(mostly in school, but one homeschooling family I know, the mom was in my <br/>\nclass, and her sister-in-law was too; not her husband though).<br/>\n<br/>\nI&#39;ve been active in online homeschooling stuff since *Prodigy&#39;s homeschooling <br/>\nforum in 1991 or so, through AOL&#39;s glory days, and the beginnings of <br/>\nunschooling.com to now, so I&#39;ve gotten to read and become acquainted with <br/>\n(sometimes in person, once from my husband driving me and the whole family to <br/>\nIndiana) lots of unschooling families I&#39;ve stayed in touch with, so I&#39;ve seen <br/>\ntheir kids growing and grown (in some cases).<br/>\n<br/>\nThere are other stories, but that&#39;s lots, and that&#39;s probably enough.  <br/>\n<br/>\nI have no doubts.  <br/>\n<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":0,"authorName":"marbleface@aol.com","from":"marbleface@...","replyTo":"LIST","senderId":"IgQ_DWIjXv1_CHkQtk0NSv4LiigrOI9BRxhfMvYwRF8177-1Gy0whWYeEdjzICl4Z6gqzm1Mpr2Q","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Why do you believe in the philosophy of unschooling?","postDate":"1000648318","msgId":25796,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJkLjE0MGYxNzIyLjI4ZDYwODdlQGFvbC5jb20+"},"prevInTopic":25786,"nextInTopic":25845,"prevInTime":25795,"nextInTime":25797,"topicId":25786,"numMessagesInTopic":0,"msgSnippet":"In a message dated 09/16/2001 3:07:59 AM !!!First Boot!!!, sheran@ptd.net ... Because sitting down with a plan and a set of books and telling my kids that","messageBody":"<div id=\"ygrps-yiv-1564508356\">In a message dated 09/16/2001 3:07:59 AM !!!First Boot!!!, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sheran@...\">sheran@...</a> <br/>\nwrites:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Why do you <br/>\n&gt; believe what you believe?  <br/>\n&gt; Thanks!<br/>\n&gt; Sheila<br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Because sitting down with a &quot;plan&quot; and a set of books and telling my kids <br/>\nthat they are going to learn X now (truly learn, absorb, understand -- not <br/>\njust pass the quiz) just isn&#39;t right for us.  I tried -- I got the state <br/>\nstandards and checked them off (I was not one of the lucky ones who knew <br/>\nabout this at the beginning) -- they were ridiculous.<br/>\n<br/>\nSome of the other methods you mention may have bits and pieces that are <br/>\nhelpful if something comes up.  I don&#39;t know.  <br/>\n<br/>\nI just feel like the answers are pretty easy -- if my son asks me about the <br/>\ntime it takes for light to travel from a star and as he is standing in the <br/>\nbackyard with a flashlight how long it would be before that light reaches the <br/>\nstar -- that&#39;s whatever subject you want to call it but it&#39;s also looking <br/>\nstuff up -- I don&#39;t know all that off the top of my head -- and it&#39;s him <br/>\nlearning how to look stuff up -- and it&#39;s him thinking beyond our backyard.  <br/>\nThat last bit is very important to me.<br/>\n<br/>\nDon&#39;t know if they would be covering that in his 3rd grade class if he were <br/>\nin school.  It might not &quot;fit.&quot;  It might not fit in any set plan or <br/>\ncurriculum.  But we like it.  And it fits him.<br/>\n<br/>\nThat&#39;s why.  Not clear probably but that&#39;s why.<br/>\n<br/>\nNance<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":0,"authorName":"Natrlmama@aol.com","from":"Natrlmama@...","replyTo":"LIST","senderId":"zc9A49dzvKlbwBmbXUTyrrw8BF-t6Y4JPJuIhPtfC3NVbBqU8RsQsNyr_zWznROVb4J5wD4zyjI","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Why do you believe in the philosophy of unschooling?","postDate":"1000624458","msgId":25786,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcwLjEwMDcwZjU5LjI4ZDVhYjRhQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":25796,"prevInTime":25784,"nextInTime":25787,"topicId":25786,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/15/01 8:07:38 PM Pacific Daylight Time, sheran@ptd.net writes: ","messageBody":"<div id=\"ygrps-yiv-1860906784\">In a message dated 9/15/01 8:07:38 PM Pacific Daylight Time, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sheran@...\">sheran@...</a> <br/>\nwrites:<br/>\n<br/>\n&lt;&lt; I&#39;m struggling right now with fine-tuning my philosophy of <br/>\n education.  It would be tremendously helpful if anyone is willing to <br/>\n share why they believe unschooling is the best way to go.  Why not <br/>\n the Charlotte Mason approach?  Or the Moore Formula?  Why do you <br/>\n believe what you believe?   &gt;&gt;<br/>\n<br/>\nThe short answer?  For me?  It feels right.  It&#39;s following my instincts,<br/>\nand this is where they have led me and following instincts is how<br/>\nI live my life.  Its really that simple for me.  Just like I knew that <br/>\nhomebirth<br/>\nwas the way my children would be born, long before I have even researched<br/>\nit and found out how safe it was and wonderful and natural.  Had there been<br/>\nno books to read, I would have still known in my heart it was the right<br/>\nthing for us to do.<br/>\n<br/>\nThe long answer?  I don&#39;t know much about the other methods, but that<br/>\nis what they are, to me, is methods, whereas unschooling is a lifestyle.<br/>\nI almost wish we could come up with another name for what we do, <br/>\nbecause its not just about school or un or education, but about living<br/>\nand lives and being curious human beings. <br/>\n<br/>\nThe Moore&#39;s from what I <br/>\nunderstand have done intensive research which has shown <br/>\nchildren are better left to play and not ready to learn academics until<br/>\n8-10-12 yrs old.  This fits in well with unschooling, at least in the early<br/>\nyears and from what I know it is solid research supporting this.<br/>\n<br/>\nA friend just loaned me her Charlotte Mason book. She is putting together<br/>\na once a month CM night to discuss the book by chapters and she is<br/>\nreally hoping I will attend to give the unschooling view of CM.  I have yet<br/>\nto crack the book so I don&#39;t know if its something I&#39;ll even be able to do.<br/>\nWill it &quot;offend&quot; my pure unschooling sensibilities, or will I say hey that<br/>\nsounds like a great idea, I might offer this to my children? &lt;shrugging<br/>\nshoulders&gt; <br/>\n<br/>\nThe only thing I have heard about CM is the nature notebook idea.<br/>\nI thought that sounded cool as we camp alot and it seemed like<br/>\nsomething they would like to do. I got the kids (and myself cos its<br/>\nsomething I thought would be fun too) nice notebooks and colored <br/>\npencils for drawing plants etc.  But what I dont&#39; do is insist<br/>\nthat this book is &quot;only&quot; for our nature notebooks. If I had done that then<br/>\nthe self portraits that my children drew wouldn&#39;t have been included, <br/>\nincluding the one done by a friend they met on one trip.  It wouldn&#39;t include<br/>\nthe couple of pages used at park day for my dd and her friend to play<br/>\nwriting games or math games (they each wrote a line of numbers and<br/>\nhad the mommys add them up to see who &quot;won&quot; &lt;g&gt;).  I could have<br/>\nruined some great moments/ideas had I said no you can&#39;t use your<br/>\nnature notebooks for that.  And no, I <br/>\ndon&#39;t go home looking up the trees and flowers we find. I have good<br/>\nintentions but they are not real interested in that right now. I am <br/>\nthinking though that I might become more interested myself soon<br/>\nas I am purchasing a book on plant allergies and since I have recently<br/>\ndeveloped allergies in the past few years, it is of more concern to<br/>\nme now.  Anyhow, this has sort of rambled off onto a how we <br/>\nunschool or how it relates to our life and I suppose its all connected<br/>\nto why we believe in the philosophy of unschooling, somehow in<br/>\nmy disjointed writing style this evening! <br/>\n<br/>\nI know this has been said several times before, but go to the <br/>\nunschooling.com website. There are some wonderful essays on<br/>\npeoples thoughts and feelings about unschooling. I have read them<br/>\nand each time I sit and nod my head in agreement and I just want<br/>\nto say ditto!<br/>\n<br/>\nHope I have helped you some!<br/>\nKathy</div>","specialLinks":[]}],"prevTopicId":25873,"nextTopicId":25691}}