{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":1322372,"authorName":"The Mowery Family","from":"&quot;The Mowery Family&quot; &lt;jkkddmowery@...&gt;","profile":"sistakammi","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] weaning, breastfeeding, long but not wholly off topic","postDate":"1011038390","msgId":2636,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxYWIwMWMxOWQzNiQwODY3Y2RlMCQ1ZWQ0NzlhNUBtb3dlcnk+","referencesHeader":"PDkyLjFmY2M1ZGM5LjI5NzQ1Njc1QGFvbC5jb20+IDwwMDViMDFjMTlkMWEkZGI0OTI5MDAkNzgyZDBkY2VAY29tLmh1bWJvbGR0MS5jb20+"},"prevInTopic":2632,"nextInTopic":0,"prevInTime":2635,"nextInTime":2637,"topicId":2621,"numMessagesInTopic":0,"msgSnippet":"The body can do some wonderful things.  Dana would not nurse from me until she was 4 months old.  I pumped and bottled the liquid gold.  The thing that ","messageBody":"<div id=\"ygrps-yiv-27308036\">The body can do some wonderful things.  Dana would not nurse from me until<br/>\nshe was 4 months old.  I pumped and bottled the liquid gold.  The thing that<br/>\nfascinated me the most was how my body produced what she needed no matter<br/>\nwhat.  If she was going through a growth spurt, I made more milk.  I had no<br/>\nclue what she needed, my body did.  I went from producing teaspoons to 37<br/>\nounces(over the course of a day in two pumping sessions) then she finally<br/>\n&quot;got it&quot; and latched on.  Then I only pumped once a day while at work (had<br/>\nto work, was the insurance carrier, hubby worked midnights and I worked<br/>\ndays).  We happily breastfed until she was 22 months old and I dried up - my<br/>\ndad died and I had what I now know was a breakdown.<br/>\n<br/>\nThe body is a magical thing.<br/>\n<br/>\nsistakammi<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Yes, and breastmilk is even more than that. Breastmilk&#39;s composition<br/>\n </span></blockquote>changes as the baby/child ages, as the brain goes through different stages<br/>\nof development, if there is exposure to illness. There&#39;s lots of research<br/>\nyou can check out through LLL about specific health/developmental benefits<br/>\nof nursing at different stages.<br/>\n<blockquote><span title=\"qreply\"> &gt;<br/>\n&gt; Ann </span></blockquote></div>","specialLinks":[]},{"userId":698072,"authorName":"Jorgen & Ann","from":"&quot;Jorgen & Ann&quot; &lt;stargate@...&gt;","profile":"ramoniac589","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] weaning, breastfeeding, long but not wholly off topic","postDate":"1011026720","msgId":2632,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNWIwMWMxOWQxYSRkYjQ5MjkwMCQ3ODJkMGRjZUBjb20uaHVtYm9sZHQxLmNvbT4=","referencesHeader":"PDkyLjFmY2M1ZGM5LjI5NzQ1Njc1QGFvbC5jb20+"},"prevInTopic":2621,"nextInTopic":2636,"prevInTime":2631,"nextInTime":2633,"topicId":2621,"numMessagesInTopic":0,"msgSnippet":" Yes, and breastmilk is even more than that. Breastmilk s composition changes as the baby/child ages,","messageBody":"<div id=\"ygrps-yiv-933583438\">&lt;&lt;Breastmilk isn&#39;t just food to babies.  It&#39;s sedative&gt;&gt;<br/>\n<br/>\nYes, and breastmilk is even more than that. Breastmilk&#39;s composition changes as the baby/child ages, as the brain goes through different stages of development, if there is exposure to illness. There&#39;s lots of research you can check out through LLL about specific health/developmental benefits of nursing at different stages.<br/>\n<br/>\nAnn<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"weaning, breastfeeding, long but not wholly off topic","postDate":"1011022965","msgId":2621,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkyLjFmY2M1ZGM5LjI5NzQ1Njc1QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":2632,"prevInTime":2620,"nextInTime":2622,"topicId":2621,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/14/02 6:30:42 AM, fetteroll@earthlink.net writes: ","messageBody":"<div id=\"ygrps-yiv-1566689538\">In a message dated 1/14/02 6:30:42 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a> writes:<br/>\n<br/>\n&lt;&lt; ... because some have decided it isn&#39;t natural to wean early and to<br/>\neven set a specific year before which they claim it would be unnatural to<br/>\nstop nursing. &gt;&gt;<br/>\n<br/>\nThe Bible gives a year, but I don&#39;t remember if it&#39;s two or three (I think <br/>\ntwo), before which children shouldn&#39;t be weaned.  So it&#39;s not just a recent <br/>\nLLL idea.  And the same as with the idea that if we LET kids learn to read on <br/>\ntheir own schedule, there still is a schedule (as it were), one thing many <br/>\nLLL members try to do is to see when the child will quit on his or her own <br/>\nwithout the mother withholding or distracting to induce weaning.<br/>\n<br/>\nWeaning is more common in this culture than nursing is.  You can ask <br/>\ngrandmothers about weaning methods (some of them cruel--putting bad-tasting <br/>\nstuff on the breast, scaring the babies, shaming them), but few of them have <br/>\na clue as to supporting and extending breastfeeding.<br/>\n<br/>\n-=- I think the best we can do is to become<br/>\nmore aware of why we are choosing to do certain things so we can throw off<br/>\nour own cultural baggage rather than taking on the baggage of others because<br/>\nwe assume they&#39;re more natural.-=-<br/>\n<br/>\nThis culture prides itself on being unnatural.  I thought (hoped) I was one <br/>\nof the last to have been taught in school (public and university classes <br/>\nboth) that humans had no remaining instincts--that they had all been <br/>\nextinguished, and we had no way to learn except from what was passed down in <br/>\nwriting, and that&#39;s why it was so important that people study writings from <br/>\nthe past and continue research and writing.<br/>\n<br/>\nIt sounds stupid.  It IS stupid.  A friend of mine fifteen years younger was <br/>\ntaught that too, in college.  <br/>\n<br/>\n-=-If she was hurt I hugged her just because it wouldn&#39;t<br/>\nhave occured to me to make a connection between pain and food.-=-<br/>\n<br/>\nBreastmilk isn&#39;t just food to babies.  It&#39;s sedative.  And a screaming baby <br/>\ncan be comforted, and a wounded baby can be, and a fidgety, tired baby can be <br/>\nsedated to sleep with enough nourishment to  have a long nap.<br/>\n<br/>\nIn cultures in which breastfeeding babies is natural, that&#39;s so known that <br/>\nit&#39;s not worth mentioning.  Here, we have to read it out of a book (or learn <br/>\nit from other moms, which is what LLL&#39;s all about).<br/>\n<br/>\nAnother note about our (depending on who &quot;we&quot; are) culture:  In the U.S. we <br/>\ncall it &quot;nursing,&quot; which is an old word and concept, but is not the name for <br/>\nwhat mothers do for their babies.  That word is breastfeeding, but in a <br/>\nlanguage that won&#39;t say breast or ass (certainly not at the dining table, and <br/>\nthis DOES have to do with eating), we cover words over with other words.  We <br/>\ncan ask for someone to pass the white meat on chicken or turkey day, and we <br/>\ncan nurse a baby.<br/>\n<br/>\n<br/>\nIn England &quot;nursing&quot; is a different thing.  <br/>\nIn English, historically, that&#39;s true too.  If someone else was hired to <br/>\nnurse your baby (to breastfeed them, but because they were not the mom, it <br/>\nwas a &quot;wet nurse&quot;--someone who could take care of the baby AND feed it), that <br/>\nwas nursing.<br/>\n<br/>\nRich people didn&#39;t nurse their own babies.  They hired poorer women (but <br/>\nnever redheads) to do it.  In the southern U.S., there are stories of <br/>\nrecently-delivered slaves nursing white babies even while their own babies <br/>\nwent hungry for hours, and on the unsanitary version of the bottle which <br/>\nexisted then.<br/>\n<br/>\nThere&#39;s a 16th or 17th century grave (I&#39;d have to look for the reference) in <br/>\nEngland with an epitaph stating that the woman had fed all her babies from <br/>\nher own breast.  Must&#39;ve been unusual to make it worth carving in stone.<br/>\n<br/>\n&quot;Neither offer nor refuse&quot; is one of the extended breastfeeding phrases <br/>\nsometimes given from mom to mom if she&#39;s wanting to separate some without <br/>\nweaning.<br/>\n<br/>\nI know a mom who quit at ten months with both babies because they refused a <br/>\ntime or two.   To say &quot;take it every time or never have it again&quot; is kind of <br/>\nharsh, but we&#39;re conditioned to want them to stop as soon as they can (from <br/>\nsocial pressure against nursing, I think), and so moms are relieved when it&#39;s <br/>\nrefused sometimes.   And they say &quot;that baby&#39;s done!&quot;<br/>\n<br/>\n-=-In a culture where infants are nursed when they cry regardless<br/>\nof the cause, is it done because that&#39;s natural or because there is social<br/>\npressure to do so to quiet the infant because so many people are living so<br/>\nclose together? Or is it both?-=-<br/>\n<br/>\nAre there causes for which a baby should be left to cry?<br/>\n<br/>\nI would nurse my baby if he cried if we werethe only two people for miles, <br/>\nbecause crying meant he was unhappy, uncomfortable, needy.  He could refuse <br/>\nto nurse if he wanted to, but he rarely did because it was liquid comfort.<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":2571,"nextTopicId":2411}}