{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":60,"messages":[{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: to bathe or not to bathe?","postDate":"1267585544","msgId":51319,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIxNjU5NC40ODQ1NS5xbUB3ZWIxMTA0MTYubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PDM5NjY3MS43MDY3MC5xbUB3ZWI1NzIwMi5tYWlsLnJlMy55YWhvby5jb20+","referencesHeader":"PDk3NTFBMDUwRTVEMzQ1MjQ5MzEyNjY2RjAxNzM3N0UxQEFscGhhU2l0ZT4gPDc0MTE3NS41ODk1NC5xbUB3ZWI4NjIwOC5tYWlsLmlyZC55YWhvby5jb20+IDw1MDAzNzYuMzYxMzMucW1Ad2ViNTcyMDQubWFpbC5yZTMueWFob28uY29tPiA8MTEzQTYyRjEtQjcwNy00OTc2LUFDQUEtNTQ2QUE5NDI1NEM5QFNhbmRyYWRvZGQuY29tPiA8Mzk2NjcxLjcwNjcwLnFtQHdlYjU3MjAyLm1haWwucmUzLnlhaG9vLmNvbT4="},"prevInTopic":51318,"nextInTopic":51320,"prevInTime":51318,"nextInTime":51320,"topicId":51243,"numMessagesInTopic":0,"msgSnippet":"***What do you think I have done that is legally or morally neglectful? Or are you being hypothetical? (I didn t tell kids to write on themselves.) Maybe I m","messageBody":"<div id=\"ygrps-yiv-2110192333\">***What do you think I have done that is legally or morally neglectful? Or are you being hypothetical? (I didn&#39;t tell kids to write on themselves.) Maybe I&#39;m being confused with the writer of the original post, which I haven&#39;t found yet;***<br/>\n<br/>\nIt was more of a general statement.  If someone&#39;s kids are not bathing and relatives are claiming neglect, then it&#39;s good to examine how to help that situation.  Some parents really don&#39;t care for their children and some parents force their kids to do things arbitrarily to appear to be good parents.  If someone exempts their kids from school, then unschools, it&#39;s good to keep in mind that relatives and other well intentioned others, and possibly not well intentioned others, are watching. <br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: [AlwaysLearning] Re: to bathe or not to bathe?","postDate":"1267583492","msgId":51318,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlDMUVDMkI2LTBDQjMtNDA4Ny04NzYzLUYwNjM5MEJBMTQyREBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDI4MTQ4MC42ODEyMS5xbUB3ZWIxMTA0MDQubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PDlGODU2RkFCRkNEQzQ5QUE5OENCOEJGOTY3ODJCMDQ0QEFUZWFtQ29tcHV0ZXI+IDwyODE0ODAuNjgxMjEucW1Ad2ViMTEwNDA0Lm1haWwuZ3ExLnlhaG9vLmNvbT4="},"prevInTopic":51317,"nextInTopic":51319,"prevInTime":51317,"nextInTime":51319,"topicId":51243,"numMessagesInTopic":0,"msgSnippet":"-=-Make baths a part of that creature comfort, something to look forward to, not something to dread. Be in the bathroom with your child and play with the toys","messageBody":"<div id=\"ygrps-yiv-586062640\">-=-Make baths a part of that creature comfort, something to look  <br/>\nforward to, not something to dread. Be in the bathroom with your child  <br/>\nand play with the toys in the tub and do that until he&#39;s really  <br/>\nenjoying himself. All those little things are HUGE to kids. -=-<br/>\n<br/>\nIce makes a good tub toy.  A colander.  We used to freeze ice in a  <br/>\nfish-shaped mold, and in a plastic toy boat, for the kids to play with.<br/>\n<br/>\nChemical light sticks make a good tub toy too.  They don&#39;t last as  <br/>\nlong in warm water as they do at room temperature, but they&#39;re  <br/>\nbrighter in the water, and that&#39;s fun.<br/>\n<br/>\nRegular old ice cubes can be fun, though.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: to bathe or not to bathe?","postDate":"1267583266","msgId":51317,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYyRDY5QTZFLTMyNTktNDdFNy1CN0M4LTNEQTIwMjY5NjNFNEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDlGODU2RkFCRkNEQzQ5QUE5OENCOEJGOTY3ODJCMDQ0QEFUZWFtQ29tcHV0ZXI+","referencesHeader":"PDlGODU2RkFCRkNEQzQ5QUE5OENCOEJGOTY3ODJCMDQ0QEFUZWFtQ29tcHV0ZXI+"},"prevInTopic":51316,"nextInTopic":51318,"prevInTime":51316,"nextInTime":51318,"topicId":51243,"numMessagesInTopic":0,"msgSnippet":"I m going to kinda ramble.  I hope others will find the good parts and maybe clarify or pull out some more discussion.  I m talking about the ideas in general.","messageBody":"<div id=\"ygrps-yiv-843482145\">I&#39;m going to kinda ramble.  I hope others will find the good parts and  <br/>\nmaybe clarify or pull out some more discussion.  I&#39;m talking about the  <br/>\nideas in general.<br/>\n<br/>\n-=-=-Then I was say just TELL him to take a bath (maybe not a shower;  <br/>\nthat<br/>\ncan be too scary), even if you have to yell, because when he&#39;s cleaner<br/>\nhe&#39;ll feel better, and the next time you can ask him to do it without<br/>\nthe yelling.-=-<br/>\n<br/>\n-=-Really? I didn&#39;t expect you to say this. My impression has been  <br/>\nthat I do whatever I can to accomodate his choice. If that meant I  <br/>\nhire someone to come stay with him when I need to go out then so be  <br/>\nit. My believing this, has left me exhausted. -=-<br/>\n<br/>\nPeople start from somewhere, and can only change one step at a time.<br/>\n<br/>\nOver the years there have been lots of people who have jumped WAY into  <br/>\nunschooling-as-they-understood-it, and it harms the peace of their  <br/>\nfamilies. Instead of saying yes lots of little times, like &quot;Yes, you  <br/>\ncan stay up half an hour more,&quot; or &quot;Friday stay up as late as you  <br/>\nwant,&quot; they come up with an extreme &quot;no more bedtimes&quot; kind of move,  <br/>\nand nobody knows how to act.  Kids can feel abandoned, or think their  <br/>\nparents have gone crazy.  The more the parents said &quot;this HAS to be  <br/>\ndone this way,&quot; the more confused the kids are later.<br/>\n<br/>\nAbout showers and baths, there shouldn&#39;t be any &quot;rule&quot; about &quot;always&quot;  <br/>\nor &quot;never,&quot; but each situation should be seen for its particular  <br/>\nrequirements and realities.  Sometimes a shower is really necessary.   <br/>\nSometimes it&#39;s not.  Sometimes it might be a good day for writing on  <br/>\none&#39;s jeans or hands.  Other days (going to a wedding?  Thanksgiving  <br/>\ndinner at Grandma&#39;s?) not so much at all.<br/>\n<br/>\n-=- My impression has been that I do whatever I can to accomodate his  <br/>\nchoice. If that meant I hire someone to come stay with him when I need  <br/>\nto go out then so be it. -=-<br/>\n<br/>\nFirst thing, about unschooling, is for the parents to figure out ways  <br/>\nto make their home happier and more full of learning and busy fun.   <br/>\nBypassing that and going to the side issues can cause more confusion  <br/>\nthan clarity.  Until they see that learning happening, they might not  <br/>\nknow whether they want to go more into unschooling or not.<br/>\n<br/>\nIf an undecided dad is frightened off by what can seem like crazy new  <br/>\nrules, unschooling might not work out in that family.<br/>\n<br/>\nMaybe it&#39;s about priorities.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/priorities\">http://sandradodd.com/priorities</a><br/>\n<br/>\n&quot;Accommodating his choice&quot; can&#39;t be the primary priority.   Parents  <br/>\nhave responsibilities.  Unschooling can&#39;t be just &quot;nothing.&quot;  It needs  <br/>\nto be something bigger and better than school at home.<br/>\n<br/>\nJenny Cyphers wrote something good about the &quot;power&quot; question:<br/>\n<br/>\n-=-Neither of you should have the power or control. Both of you should  <br/>\nwork together. Since moms have more knowledge, insight, and such, help  <br/>\nhim get what he wants and needs, baths included.-=-<br/>\n<br/>\nThe &quot;It&#39;s his body&quot; argument is true to a point.  Back to that laws  <br/>\nand duties point...  parents have responsibilities.  &quot;Responsibility&quot;  <br/>\nmeans being answerable (responsive) to someone else.<br/>\n<br/>\nThere are lots of things the government requires/expects parents to  <br/>\ndo.  They don&#39;t check all families all the time.  Once a family comes  <br/>\nto their attention, though, they could drag up all kinds of stuff.<br/>\n<br/>\nIt&#39;s like being stopped for speeding.  If the driver is absolutely  <br/>\nsober and sweet and cooperative, she&#39;ll get off easier than if there&#39;s  <br/>\nanything at all to irritate the officer, or to arouse suspicion.  If  <br/>\nso, there are lots of things that could be added to the list of  <br/>\noffenses--someone in the back sleeping without a seatbelt?   <br/>\nUnstablilized load in the back of the van or pickup?  Light not  <br/>\nworking over the license plate?<br/>\n<br/>\nSame with parenting.  It is possible for someone to draw attention,  <br/>\nand if that happens, the government could go on and on asking  <br/>\nquestions and finding things wrong.<br/>\n<br/>\nBest thing is to not push that envelope just to do it.  Don&#39;t be  <br/>\nradical just because radical is cool.  Be responsible and thoughtful.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":276701487,"authorName":"Michele K","from":"Michele K &lt;mom2rci@...&gt;","profile":"mom2rci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: to bathe or not to bathe?","postDate":"1267582545","msgId":51316,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM5NjY3MS43MDY3MC5xbUB3ZWI1NzIwMi5tYWlsLnJlMy55YWhvby5jb20+","inReplyToHeader":"PDExM0E2MkYxLUI3MDctNDk3Ni1BQ0FBLTU0NkFBOTQyNTRDOUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDk3NTFBMDUwRTVEMzQ1MjQ5MzEyNjY2RjAxNzM3N0UxQEFscGhhU2l0ZT4gPDc0MTE3NS41ODk1NC5xbUB3ZWI4NjIwOC5tYWlsLmlyZC55YWhvby5jb20+IDw1MDAzNzYuMzYxMzMucW1Ad2ViNTcyMDQubWFpbC5yZTMueWFob28uY29tPiA8MTEzQTYyRjEtQjcwNy00OTc2LUFDQUEtNTQ2QUE5NDI1NEM5QFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":51315,"nextInTopic":51317,"prevInTime":51315,"nextInTime":51317,"topicId":51243,"numMessagesInTopic":0,"msgSnippet":"What do you think I have done that is legally or morally neglectful? Or are you being hypothetical?  (I didn t tell kids to write on themselves.)  Maybe I m","messageBody":"<div id=\"ygrps-yiv-1928831634\">What do you think I have done that is legally or morally neglectful? Or are you being hypothetical?  (I didn&#39;t tell kids to write on themselves.)  Maybe I&#39;m being confused with the writer of the original post, which I haven&#39;t found yet; I was replying to an email later in the thread.   I wasn&#39;t going to respond at all -- my kids are happy, we enjoy each other, and several people in my real life say I&#39;m a good mom including my own children so I&#39;m pretty sure I&#39;m really not neglectful -- but I want to point out that there is often more to a situation than you can possibly convey by an email.  I started to type out more of the details, but I decided this is not the place for this particular situation.<br/>\n<br/>\n Michele, mom of Rhiannon 8, Caroline 6, and Ian 3<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt;<br/>\n<br/>\nThere are things that parents are legally and morally required to <br/>\nprovide for their children.   Unschooling is a luxury, and add-on, not <br/>\na replacement for taking care of children&#39;s needs.<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: to bathe or not to bathe?","postDate":"1267580216","msgId":51315,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI4MTQ4MC42ODEyMS5xbUB3ZWIxMTA0MDQubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PDlGODU2RkFCRkNEQzQ5QUE5OENCOEJGOTY3ODJCMDQ0QEFUZWFtQ29tcHV0ZXI+","referencesHeader":"PDlGODU2RkFCRkNEQzQ5QUE5OENCOEJGOTY3ODJCMDQ0QEFUZWFtQ29tcHV0ZXI+"},"prevInTopic":51314,"nextInTopic":51316,"prevInTime":51314,"nextInTime":51316,"topicId":51243,"numMessagesInTopic":0,"msgSnippet":"***My reasoning with the hygiene issues has been that it is HIS body. I can give him information about how his choices around his body affect me and possibly","messageBody":"<div id=\"ygrps-yiv-1687347445\">***My reasoning with the hygiene issues has been that it is HIS body. I can give him information about how his choices around his body affect me and possibly others, but to coerce him to do to his body what I want him to do was out of the scope of gentle parenting or radical unschooling.***<br/>\n<br/>\nIt is HIS body, that&#39;s why you&#39;d like to be respectful of it.  Seriously though, how respectful are you being to his body if you tell him in words and actions that it need not be clean.  I&#39;m not talking about every day baths here, but once a week might be nice.  <br/>\n<br/>\nHe&#39;s young right, 7?  I think that&#39;s what you said... what does he have to play with in the water?  Start there, fill up the tub with warm water and float some boats in there and just play with it.  Then, leave the boats out next to the tub so that he sees them when he uses the toilet.  When he asks about them, fill up the tub and float the boats and suggest that he get in with them and play longer, get a movie on in there so he can watch something AND play.  Don&#39;t use soap or shampoo, just straight up water.  Make the focus be on play.  <br/>\n<br/>\n*** I fear that I have given up so much power and handed it over to my child that he is scared, anxious, and unable to attend to what he needs to for his development. I don&#39;t know how to take back an appropriate amount of control without feeling completely authoritarian.***<br/>\n<br/>\nNeither of you should have the power or control.  Both of you should work together.  Since moms have more knowledge, insight, and such, help him get what he wants and needs, baths included.<br/>\n<br/>\n***I don&#39;t have this relationship with my child. He does not seem to want to listen to anything I have to offer him. I don&#39;t know if he doesn&#39;t trust me and my intentions, or quite what, but it is a HUGE red flag for me that we have no give and take relationship.***<br/>\n<br/>\nDo you trust your intentions?  Are you calm and clear so that he can trust you?  Are you a reliable source of comfort and information?  If a mom is unclear and overwhelmed, chances are her kids are going to feel that and absorb that too.  Be calm and centered.  Provide creature comforts for all of your household.  Make good food available, make clean clothing and bedding available, do those little things like having extra toilet rolls out and available, and clean towels and toys that are easy to find and get to and put away.  Clear spaces for playing and drawing.  Make baths a part of that creature comfort, something to look forward to, not something to dread.  Be in the bathroom with your child and play with the toys in the tub and do that until he&#39;s really enjoying himself.  All those little things are HUGE to kids.  <br/>\n<br/>\nMy oldest daughter has a boyfriend that grew up without any of those creature comforts.  We do our best to lavish him in creature comforts.  He lights up with joy when I make him food and bring it to him on a plate to where he is.  My own children love that too, although they take it for granted a bit, and actually that&#39;s pretty cool that they&#39;ve come to view that sort of lifestyle normal.  Kids who grow up without those niceties and loving gestures, grow up seeing the world in harsh ways instead of soft and gentle ways.  I love that being gentle with my daughter and her boyfriend help them be gentle with each other.<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] to bathe or not to bathe?","postDate":"1267578024","msgId":51314,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg3ODI3OS40ODU4MS5xbUB3ZWIxMTA0MDQubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PDZkZWM0OGIxMDAzMDIxMjIwcjQ4YTBhNmYxc2Y4ZGUwYThmYTJiNjI0MDBAbWFpbC5nbWFpbC5jb20+","referencesHeader":"PGhtaWNjYithMHEwQGVHcm91cHMuY29tPiA8NmRlYzQ4YjEwMDMwMjEyMjByNDhhMGE2ZjFzZjhkZTBhOGZhMmI2MjQwMEBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":51313,"nextInTopic":51315,"prevInTime":51313,"nextInTime":51315,"topicId":51243,"numMessagesInTopic":0,"msgSnippet":"*** If I am calmly insistent and acknowledge their misgivings without adding drama my child is able to trust me and cope better.*** This is exactly what that","messageBody":"<div id=\"ygrps-yiv-577887636\">*** If I am calmly insistent and acknowledge their misgivings without<br/>\nadding drama my child is able to trust me and cope better.***<br/>\n<br/>\nThis is exactly what that book, How To Talk so Kids Will Listen and Listen So Kids Will Talk, book is all about!  At least that is what I summed it all up to be about in my own thoughts.  Acknowledging that there are some things that need to happen, finding ways to make it pleasant, and not adding extra emotional drama to it, helps parents and kids get along better.<br/>\n<br/>\nSome people don&#39;t like the examples in the book at some people find that manipulative.  To me, it seems way more peaceful to simply acknowledge that some things must happen and find ways to navigate the world knowing that.<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] to bathe or not to bathe?","postDate":"1267575226","msgId":51310,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcyMDQxMS44MjcwOS5xbUB3ZWIxMTA0MTMubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PDU4NTE2OS43NTE4Ni5xbUB3ZWI1NzIwNC5tYWlsLnJlMy55YWhvby5jb20+","referencesHeader":"PGhtaWNjYithMHEwQGVHcm91cHMuY29tPiA8NTg1MTY5Ljc1MTg2LnFtQHdlYjU3MjA0Lm1haWwucmUzLnlhaG9vLmNvbT4="},"prevInTopic":51307,"nextInTopic":51313,"prevInTime":51309,"nextInTime":51311,"topicId":51243,"numMessagesInTopic":0,"msgSnippet":"*** and even bought an entire wardrobe for each of my children for a trip they took us on because they are appalled that I allow my children to dress in hand","messageBody":"<div id=\"ygrps-yiv-1191223377\">*** and even bought an entire wardrobe for each of my children for a trip they took us on because they are appalled that I &quot;allow&quot; my children to dress in hand me down clothes that might be mismatched or have stains and I don&#39;t force them to bathe.***<br/>\n<br/>\nHow wonderful that you have relatives that are kind enough to buy your children clothing!  Perhaps they think you can&#39;t afford to buy them nice clothing, so you don&#39;t and buy thrift store clothing and accept hand me downs.  Honestly, I think it&#39;s sweet.  Although Chamille, my oldest would not go for such a thing these days unless it was a particular style, for most of her life, she was quite happy when grandmas bought her new clothing!<br/>\n<br/>\nI also think there is a pretty big difference between forcing a kid to bathe and highly suggesting it, in a &quot;please do so sooner than later&quot; kind of way.  I&#39;ve told my children that they need to bathe on several occasions.  I don&#39;t think it&#39;s unkind at all to say so.  I let them know when they smell bad.  I think it would be way more unkind to let them go about looking dirty and smelling bad and having people, even relatives, saying cruel things behind their backs or to their faces about their hygiene.<br/>\n<br/>\nWe can&#39;t change how others will react to us or our kids, but we can change how we present ourselves to people that may judge us.<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: to bathe or not to bathe?","postDate":"1267573686","msgId":51305,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYwMzQ1MS45NDgzOS5xbUB3ZWIxMTA0MDcubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PDk3NTFBMDUwRTVEMzQ1MjQ5MzEyNjY2RjAxNzM3N0UxQEFscGhhU2l0ZT4=","referencesHeader":"PDk3NTFBMDUwRTVEMzQ1MjQ5MzEyNjY2RjAxNzM3N0UxQEFscGhhU2l0ZT4="},"prevInTopic":51303,"nextInTopic":51306,"prevInTime":51304,"nextInTime":51306,"topicId":51243,"numMessagesInTopic":0,"msgSnippet":"***To me, it s a case of respect for him as his own person, something I m not seeing them having in the OP s case.*** I don t know... Maybe this kid smells bad","messageBody":"<div id=\"ygrps-yiv-1579745827\">***To me, it&#39;s a case of respect for him as his own person, something I&#39;m not seeing them having in the OP&#39;s case.***<br/>\n<br/>\nI don&#39;t know... Maybe this kid smells bad and the grandparents don&#39;t want to travel around with a kid that smells bad and they want to be out and about with a kid that is dressed nice.  Since they are doing a sitting service, it seems pretty reasonable to me, if they have those conditions.  To not honor it would seem more disrespectful than making an issue of it, whether I happen to agree with the stipulations or not.  It&#39;s not as if they want him to cut his hair and buy new shoes for the outing.<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: [AlwaysLearning] Re: to bathe or not to bathe?","postDate":"1267572382","msgId":51303,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg2RDE1OURCLTc0N0UtNDNBRC05QzFGLUM4Q0Y1RDMzMzFBOEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDU0NzExMDcxLTZCMjktNDBBOS1CODhDLTZCN0IyQTE5MjNGMEBlYXJ0aGxpbmsubmV0Pg==","referencesHeader":"PDU0NzExMDcxLTZCMjktNDBBOS1CODhDLTZCN0IyQTE5MjNGMEBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":51302,"nextInTopic":51305,"prevInTime":51302,"nextInTime":51304,"topicId":51243,"numMessagesInTopic":0,"msgSnippet":"-=-You have equated not bathing to child neglect. This is a big stretch imo.-=- It s a big stretch for this discussion, even!  It s not a big stretch for child","messageBody":"<div id=\"ygrps-yiv-384568551\">-=-You have equated not bathing to child neglect. This is a big  <br/>\nstretch imo.-=-<br/>\n<br/>\nIt&#39;s a big stretch for this discussion, even!  It&#39;s not a big stretch  <br/>\nfor child services, I&#39;ll bet.<br/>\n<br/>\nWhen people have decided to keep their kids out of school, and then on  <br/>\ntop of that have decided NOT to have lessons or a curriculum, that  <br/>\ninvites observation.  Some people understand the need to be  <br/>\ncircumspect and aware.  Others seem to encourage wild disregard of  <br/>\nwhat others think about it.<br/>\n<br/>\nWhen people call me on the phone (my phone number was published in a  <br/>\ncouple of books without anyone having asked me; it&#39;s slowed down, but  <br/>\nfor years there were two or three calls a week) and wanted to  <br/>\nunschool, one of the first questions I would ask them was whether they  <br/>\nhad a hostile ex spouse, or whether their parents or in-laws were  <br/>\ncritical.<br/>\n<br/>\nUnschooling isn&#39;t anyone&#39;s right. It&#39;s a luxury, and not an easy one.   <br/>\nIt&#39;s pretty easy to screw it up.<br/>\n<br/>\nIf the inlaws had used the word neglect, that&#39;s one step from a social  <br/>\nservices visit.<br/>\n<br/>\nAll other things being ideal, then an unwashed child who refuses a  <br/>\nbath is just one little thing.  If there are other factors, IF there  <br/>\nis a hostile ex, IF there are grandparents who believe there is  <br/>\nactionable neglect, getting that child washed by any means could  <br/>\npotentially be the difference between continuing to homeschool and  <br/>\nhaving that child in school (or worse).<br/>\n<br/>\nWe weren&#39;t talking about an ideal situation at all, it seemed to me.   <br/>\nIt sounded like a showdown on Tuesday, with a question asked on Monday.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":414313399,"authorName":"Alisia Hallett","from":"&quot;Alisia Hallett&quot; &lt;alisiamarie@...&gt;","profile":"amhe6","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: to bathe or not to bathe?","postDate":"1267569218","msgId":51313,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlGODU2RkFCRkNEQzQ5QUE5OENCOEJGOTY3ODJCMDQ0QEFUZWFtQ29tcHV0ZXI+"},"prevInTopic":51310,"nextInTopic":51314,"prevInTime":51312,"nextInTime":51314,"topicId":51243,"numMessagesInTopic":0,"msgSnippet":"-=-Then I was say just TELL him to take a bath (maybe not a shower; that can be too scary), even if you have to yell, because when he s cleaner he ll feel","messageBody":"<div id=\"ygrps-yiv-691666110\">-=-Then I was say just TELL him to take a bath (maybe not a shower; that <br/>\ncan be too scary), even if you have to yell, because when he&#39;s cleaner <br/>\nhe&#39;ll feel better, and the next time you can ask him to do it without <br/>\nthe yelling.-=-<br/>\n<br/>\n Really? I didn&#39;t expect you to say this.  My impression has been that I do whatever I can to accomodate his choice.  If that meant I hire someone to come stay with him when I need to go out then so be it.  My believing this, has left me exhausted.  <br/>\n<br/>\n-=-There is nothing in the philosophy of unschooling that excuses parents <br/>\nfrom keeping their children clean. The government doesn&#39;t allow <br/>\npeople to keep children, not even their own, if they can&#39;t figure out <br/>\nhow to keep them clean and fed.-=-<br/>\n-=-Unschooling doesn&#39;t give anyone a free ticket to live outside of the <br/>\nrealities of the cultural expectations around them-=-<br/>\n<br/>\nI didn&#39;t think of it this way.  This is pretty powerful.  My reasoning with the hygiene issues has been that it is HIS body.  I can give him information about how his choices around his body affect me and possibly others, but to coerce him to do to his body what I want him to do was out of the scope of gentle parenting or radical unschooling.  Please comment because these ideas that I am acting on(or not acting on as the case may be)  are not working for us.  <br/>\n<br/>\n-=-It&#39;s likely that if he hasn&#39;t <br/>\nchanged clothes or had a shower for a while, the parents aren&#39;t <br/>\nrespecting him OR his parents.-=-<br/>\n<br/>\nThis is what I am concerned about in our home.  I fear that I have given up so much power and handed it over to my child that he is scared, anxious, and unable to attend to what he needs to for his development.   I don&#39;t know how to take back an appropriate amount of control without feeling completely authoritarian.<br/>\n<br/>\n-=-They are more than willing to listen to my information. They are usually willing to act accordingly, too. -=-<br/>\n<br/>\nI don&#39;t have this relationship with my child.  He does not seem to want to listen to anything I have to offer him.  I don&#39;t know if he doesn&#39;t trust me and my intentions, or quite what, but it is a HUGE red flag for me that we have no give and take relationship.  He may feel too overwhelmed with all the decisions he has to make for himself since I haven&#39;t provided a secure framework for him to live within?  Do I make sense?  I can&#39;t tell if I need to share less or tons more in order to give you enough to discuss or offer up help.  But I sure do need some help.  I am seeing a counselor currently, to try to clear my own junk, so that I can lead my child, but I feel like I get such conflcting parental info there, I don&#39;t know what to do.<br/>\n<br/>\n-=-Telling someone else that they have to accept your child for who he or she is, isn&#39;t a good way to get them to accept them at all. Much better if you give your child the information, help them to live in the world instead of showing them that it is better to wait for the world to shape itself around them.-=-<br/>\n<br/>\nYes, thank you, I don&#39;t think I&#39;ve raised him to &quot;get&quot; this at all, and now he won&#39;t even accept any information.  Any ideas? <br/>\n<br/>\nAlisia<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":222835102,"authorName":"lalow66","from":"&quot;lalow66&quot; &lt;lalow@...&gt;","profile":"lalow66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: to bathe or not to bathe?","postDate":"1267565715","msgId":51294,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhtazBhaitlbGEzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDMxNDdEMUZDLTc3NTEtNDBBQS1BNzhCLTgzOTZGOUU3OTlBM0BzdXBlbm4uY29tPg=="},"prevInTopic":51285,"nextInTopic":51295,"prevInTime":51293,"nextInTime":51295,"topicId":51243,"numMessagesInTopic":0,"msgSnippet":"my 7 year old doesnt like bathing either, he isnt scared or bothered by the water in his eyes, he just dosnt like it.  he also wears the same clothes alot.  he","messageBody":"<div id=\"ygrps-yiv-1227931372\">my 7 year old doesnt like bathing either, he isnt scared or bothered by the water in his eyes, he just dosnt like it.  he also wears the same clothes alot.  he doesnt really express why he doesnt like it but one thing i have been able to figure out is i think he feels a little out of control.  he has trouble working the water faucets on his own and is afraid to get to cold or hot.  so we have worked on trying to help feel more in control of the temperature.<br/>\nabout once a week i will say to him it is about time to take a shower/bath. he can choose one or the other.  i sometimes plan it prior to a fun activity, like going to a movie or skating.  i give him choices about times but within this time period (like the weekend) he needs a shower.  at that time he also changes clothes.  sometimes during the week if he will agree to change one article of clothing.  like today, on his own, he decided to change his pants.. but not his shirt.  if his shirt had been particulary dirty, since we were going out to chucky cheese and the dentist, i might have asked him to change it too..but it wasnt dirty. i am pretty matter a fact about it all.  he has gotten better about it and i think it has helped that he know I am working with him on this. i understand this is something he doesnt like to do but i am willing to help him make the experience as painless as possible.  <br/>\nmy mom thinks i am crazy cause i dont make him get his hair cut.  when we were there at christmas she got my dad to talk him into getting it cut by bribing him with sonic.</div>","specialLinks":[]},{"userId":105977377,"authorName":"Alison Broadbent","from":"Alison Broadbent &lt;abzb@...&gt;","profile":"tttrrrsz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: to bathe or not to bathe?","postDate":"1267564925","msgId":51298,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU0NzExMDcxLTZCMjktNDBBOS1CODhDLTZCN0IyQTE5MjNGMEBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":51295,"nextInTopic":51302,"prevInTime":51297,"nextInTime":51299,"topicId":51243,"numMessagesInTopic":0,"msgSnippet":"... There s nothing in the OPs that sounded as though county services should be alerted bc of her not forcing her child to bathe.  Certainly there was nothing","messageBody":"<div id=\"ygrps-yiv-1589602727\"><blockquote><span title=\"ireply\">&gt; There is nothing in the philosophy of unschooling that excuses parents<br/>\n&gt; from keeping their children clean. The government doesn&#39;t allow<br/>\n&gt; people to keep children, not even their own, if they can&#39;t figure out<br/>\n&gt; how to keep them clean and fed.<br/>\n<br/>\n </span></blockquote>There&#39;s nothing in the OPs that sounded as though county services should be alerted bc of her not forcing her child to bathe.  Certainly there was nothing about not feeding him.<br/>\n<br/>\nYou have equated not bathing to child neglect.  This is a big stretch imo.<br/>\n<br/>\nWhen our ds was young, he hated baths.  We tried all sorts of things to do: toys, me being in the bath, dad being in the bath, paints, having a heater.  You name it.<br/>\n<br/>\nWhat worked was I would give him a sponge bath while he was doing something else and that worked.  What he didn&#39;t want was to have his hair washed under any circumstances.  I checked w/ our pediatrician to see if there was any issue w/ him not having his hair washed for months.  I mean months and months.  He said no, no prob.  He said when he&#39;s older and has more consciousness about his appearance it will change.<br/>\n<br/>\nLuckily, his hair didn&#39;t look greasy so it was a really long time until he washed it.  I would never have yelled to get him to take a bath or wash his hair.  That&#39;s just unimaginable.<br/>\n<br/>\nThere&#39;s nothing in the philosophy of  unschooling that says you need to be disrespectful to a child if that child is healthy and just doesn&#39;t choose to bathe.  There&#39;s a wide range of what different people consider acceptable.  I shower daily and it was a stretch for me but I wanted to respect his autonomy. Since I had found out it was not unhealthy for him, that&#39;s how we lived.  I think a better thing would be to check out what is truly unhealthy.  <br/>\n<br/>\nAlison<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: to bathe or not to bathe?","postDate":"1267564868","msgId":51295,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PERGRjFBNDA4LTY2RTYtNEE5Mi1BQTE5LUYxNTgxMjNFOTdCQUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDUwMDM3Ni4zNjEzMy5xbUB3ZWI1NzIwNC5tYWlsLnJlMy55YWhvby5jb20+","referencesHeader":"PDk3NTFBMDUwRTVEMzQ1MjQ5MzEyNjY2RjAxNzM3N0UxQEFscGhhU2l0ZT4gPDc0MTE3NS41ODk1NC5xbUB3ZWI4NjIwOC5tYWlsLmlyZC55YWhvby5jb20+IDw1MDAzNzYuMzYxMzMucW1Ad2ViNTcyMDQubWFpbC5yZTMueWFob28uY29tPg=="},"prevInTopic":51294,"nextInTopic":51298,"prevInTime":51294,"nextInTime":51296,"topicId":51243,"numMessagesInTopic":0,"msgSnippet":"... Their actions and values aren t in your control, though. You can decide how much you want to accommodate them to keep them in your lives.  You can set","messageBody":"<div id=\"ygrps-yiv-756862427\">On Mar 2, 2010, at 1:19 PM, Michele K wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; It sounds like a good way to estrange his grandparents.<br/>\n&gt; But telling someone to be different or get out of your life is a  <br/>\n&gt; manipulative, and risking estranging yourself.<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>Their actions and values aren&#39;t in your control, though. You can  <br/>\ndecide how much you want to accommodate them to keep them in your  <br/>\nlives.  You can set boundaries of how they act in your home. But you  <br/>\ncan&#39;t change who they are.<br/>\n<br/>\nWould it be hard to understand them distancing from your family if  <br/>\nyou were in a cult or recreational drug users? Wouldn&#39;t it make  <br/>\nperfect sense that seeing you damaging your kids&#39; lives with no hint  <br/>\nthat you can see what harm you&#39;re doing would be hurtful to them?<br/>\n<br/>\nIt would be relationship building if they could trust their son  <br/>\nenough to learn more about what you&#39;re doing. *But* -- from their  <br/>\npoint of view -- how open should they be to reading about your cult  <br/>\n-- reading literature that&#39;s written by other cult members! -- that&#39;s  <br/>\ncausing you to neglect your children? Just because you believe you&#39;re  <br/>\nright, doesn&#39;t translate into being right ;-) Undoubtedly lots of  <br/>\npeople in cults are effervescent about the wonderful live they&#39;ve  <br/>\nfound, but how objective are they about their new beliefs?<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: [AlwaysLearning] Re: to bathe or not to bathe?","postDate":"1267562692","msgId":51306,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDExM0E2MkYxLUI3MDctNDk3Ni1BQ0FBLTU0NkFBOTQyNTRDOUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDUwMDM3Ni4zNjEzMy5xbUB3ZWI1NzIwNC5tYWlsLnJlMy55YWhvby5jb20+","referencesHeader":"PDk3NTFBMDUwRTVEMzQ1MjQ5MzEyNjY2RjAxNzM3N0UxQEFscGhhU2l0ZT4gPDc0MTE3NS41ODk1NC5xbUB3ZWI4NjIwOC5tYWlsLmlyZC55YWhvby5jb20+IDw1MDAzNzYuMzYxMzMucW1Ad2ViNTcyMDQubWFpbC5yZTMueWFob28uY29tPg=="},"prevInTopic":51305,"nextInTopic":51307,"prevInTime":51305,"nextInTime":51307,"topicId":51243,"numMessagesInTopic":0,"msgSnippet":"-=-But telling someone to be different or get out of your life is a manipulative, and risking estranging yourself. -=- You re being manipulative, on the other","messageBody":"<div id=\"ygrps-yiv-514727582\">-=-But telling someone to be different or get out of your life is a  <br/>\nmanipulative, and risking estranging yourself. -=-<br/>\n<br/>\nYou&#39;re being manipulative, on the other hand, by telling your parents  <br/>\nthey can only be with the kids if they&#39;re willing to accept them  <br/>\nunwashed and in dirty clothes.<br/>\n<br/>\n-=-In other words, my in laws are choosing to not associate with us  <br/>\nbecause they think we neglect our children by letting them choose how  <br/>\nto dress, write on themselves with marker, walk outside barefoot, and  <br/>\nother such &quot;horrible&quot; things, and they blame my husband and me for not  <br/>\nbeing able to see their grandkids. -=-<br/>\n<br/>\nThere&#39;s a difference between letting a child write on herself  <br/>\noccasionally, and telling her she can write on herself with permanent  <br/>\nmarkers anytime she wants, regardless of the occasion.  That goes for  <br/>\neverything but if your parents don&#39;t like the permanent marker... why  <br/>\ndid they see it?  Help your kids see what&#39;s appropriate to each  <br/>\nsituation.<br/>\n<br/>\n-=-They just sent us an email out of the blue last autumn announcing  <br/>\nthey can no longer bear to see us as long as the kids are &quot;neglected&quot;  <br/>\nand insulting me about my upbringing, lifestyle, etc.-=-<br/>\n<br/>\nThere were people on this list, though, suggesting you should spend  <br/>\nmore time with your kids.  That wasn&#39;t out of the blue.<br/>\n<br/>\nThere are things that parents are legally and morally required to  <br/>\nprovide for their children.   Unschooling is a luxury, and add-on, not  <br/>\na replacement for taking care of children&#39;s needs.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: [AlwaysLearning] to bathe or not to bathe?","postDate":"1267562280","msgId":51302,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRFOUIwNEZELUQ2OEUtNDRFNy05MkI3LUZENjkyRTc3OTlDRUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDk4MTU4NS4xMDgyNi5xbUB3ZWI4MTUwNi5tYWlsLm11ZC55YWhvby5jb20+","referencesHeader":"PDk4MTU4NS4xMDgyNi5xbUB3ZWI4MTUwNi5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":51298,"nextInTopic":51303,"prevInTime":51301,"nextInTime":51303,"topicId":51243,"numMessagesInTopic":0,"msgSnippet":"-=-I have to say that screaming at them would not be a good thing. Gigi would immediately start crying and say I hurt her feeling and I need to take a deep","messageBody":"<div id=\"ygrps-yiv-1868472782\">-=-I have to say that screaming at them would not be a good thing.  <br/>\nGigi would immediately start crying and say I hurt her feeling and I  <br/>\nneed to take a deep breath and MD would do it but feel hurt too.<br/>\nIf I just firmly tell them lets do it because of this and that they  <br/>\nwill. -=-<br/>\n<br/>\nYelling isn&#39;t my first choice.  Yelling would be a last ditch attempt  <br/>\nif the kid insisted no, no, no.   But because my kids rarely heard &quot;no  <br/>\nway&quot; they rarely SAY &quot;no way.&#39;<br/>\n<br/>\nIt didn&#39;t happen with my kids.  We were persuasive and made things  <br/>\nalluring and fun.<br/>\n<br/>\nI shared what I actually did.  The question was that if none of that  <br/>\nworked and the parents HAD to go to work, then what would I advise?   <br/>\nMy advice was if you have to do it, do it.<br/>\n<br/>\nAs much as I have spent time and energy and eighteen years of my life  <br/>\nunschooling, it does NOT give people any special rights or powers, and  <br/>\nit can get tiresome trying to repeat that when others seem to be  <br/>\nsuggsting that if one person decides to unschool, somehow all their  <br/>\nrelatives have new obligations and requirements.<br/>\n<br/>\nNot so.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: [AlwaysLearning] to bathe or not to bathe?","postDate":"1267561689","msgId":51307,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBRDFDMDRCLUIxMDAtNDU2NS04NDdDLUUwMDBFOTk2NUYyNUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDZkZWM0OGIxMDAzMDIxMjIwcjQ4YTBhNmYxc2Y4ZGUwYThmYTJiNjI0MDBAbWFpbC5nbWFpbC5jb20+","referencesHeader":"PGhtaWNjYithMHEwQGVHcm91cHMuY29tPiA8NmRlYzQ4YjEwMDMwMjEyMjByNDhhMGE2ZjFzZjhkZTBhOGZhMmI2MjQwMEBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":51306,"nextInTopic":51310,"prevInTime":51306,"nextInTime":51308,"topicId":51243,"numMessagesInTopic":0,"msgSnippet":"-=- Learning to find aspects of pleasure and how to deal with life s unwanted chores leads to bigger things as they grow older. -=- I agreed with the rest of","messageBody":"<div id=\"ygrps-yiv-1485597664\">-=- Learning to find aspects of pleasure and how<br/>\nto deal with life&#39;s unwanted chores leads to bigger things as they grow<br/>\nolder. -=-<br/>\n<br/>\nI agreed with the rest of it, but wanted to point at &quot;chore&quot; and  <br/>\nsuggest it might be thought of as something else than &quot;a chore.&quot;   <br/>\nChore has a negative connotation.<br/>\n<br/>\nI don&#39;t often look forward to a shower.  I stall.  But once I&#39;m in  <br/>\nthere it&#39;s hard to want to get out, because the water feels so good,  <br/>\nand singing sounds so good.  Maybe if any of it is fun or comfortable,  <br/>\nstress that the next time; remind him.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":229442577,"authorName":"Kris","from":"Kris &lt;kris1956@...&gt;","profile":"louisam1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] to bathe or not to bathe?","postDate":"1267561242","msgId":51284,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZkZWM0OGIxMDAzMDIxMjIwcjQ4YTBhNmYxc2Y4ZGUwYThmYTJiNjI0MDBAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PGhtaWNjYithMHEwQGVHcm91cHMuY29tPg==","referencesHeader":"PGhtaWNjYithMHEwQGVHcm91cHMuY29tPg=="},"prevInTopic":51283,"nextInTopic":51285,"prevInTime":51283,"nextInTime":51285,"topicId":51243,"numMessagesInTopic":0,"msgSnippet":"My son, 12 now, has never been keen on baths and hair washing but I explain that for health and being around other people it s a must.  I stay honest about the","messageBody":"<div id=\"ygrps-yiv-216007223\">My son, 12 now, has never been keen on baths and hair washing but I explain<br/>\nthat for health and being around other people it&#39;s a must.  I stay honest<br/>\nabout the reasons but insist that it be done and he has never &quot;refused&quot;.<br/>\nThere is a lot of room for bargaining here; bath or shower, toys, bubbles<br/>\nand even the types of shampoo.  Learning to find aspects of pleasure and how<br/>\nto deal with life&#39;s unwanted chores leads to bigger things as they grow<br/>\nolder.  If I am calmly insistent and acknowledge their misgivings without<br/>\nadding drama my child is able to trust me and cope better.  As an older kid<br/>\nhe just does it and, though he depends on me to remind him, he doesn&#39;t whine<br/>\nor complain anymore.<br/>\n<br/>\nPersonally I would simply say it&#39;s going to have to be this way, you need<br/>\ntheir help with child care and it&#39;s a fun trip.  I would give him an outline<br/>\nof what the plans are and give him some choices on what he wants in his bath<br/>\nand maybe choose what he will wear from suitable options.  If he sees you<br/>\ncalmly resolute I think he will have less anxiousness over the bath.<br/>\n-- <br/>\nKris - mom to Lanora, Jonathan and mom-of-love to Sean<br/>\n<br/>\n�Be yourself, everyone else is already taken.&quot; - Oscar Wilde<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":327581399,"authorName":"Three Mommies","from":"Three Mommies &lt;3mommies@...&gt;","profile":"three.moms","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] to bathe or not to bathe?","postDate":"1267555909","msgId":51283,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM2NDRjMGIzMTAwMzAyMTA1MXQ3YmQyMWUxMHhiMDNhYjk0OTJkYWNiY2ZkQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDk4MTU4NS4xMDgyNi5xbUB3ZWI4MTUwNi5tYWlsLm11ZC55YWhvby5jb20+","referencesHeader":"PDk4MTU4NS4xMDgyNi5xbUB3ZWI4MTUwNi5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":51280,"nextInTopic":51284,"prevInTime":51282,"nextInTime":51284,"topicId":51243,"numMessagesInTopic":0,"msgSnippet":"Sometimes kids just need to decide whether or not they will meet the expectations that people at large have for them. Ethan (9) wanted to come to work with me","messageBody":"<div id=\"ygrps-yiv-1839428202\">Sometimes kids just need to decide whether or not they will meet the<br/>\nexpectations that people at large have for them. Ethan (9) wanted to come to<br/>\nwork with me and he hadn&#39;t showered in a few days. His hair was smelly. I<br/>\ntold him that I didn&#39;t feel comfortable bringing him to work unshowered. I<br/>\nmade it clear this wasn&#39;t about him, it was about my boundaries. I wouldn&#39;t<br/>\nwant other vendors to show up dirty. I don&#39;t show up dirty. If he wants to<br/>\nbe dirty, he can&#39;t do it with me at my job. I think their grandparents have<br/>\na right to boundaries. If their boundaries are that they won&#39;t be seen in<br/>\npublic with unbathed people, then so be it. Now the power that the kids have<br/>\nis whether or not they choose to go out with their grandparents.<br/>\n<br/>\nAfter Ethan said he really wanted to go even if it meant a shower we did our<br/>\nbest to meet Ethan&#39;s needs in this process. He wanted someone to shower with<br/>\nhim and wash his hair, so Esther did that. He wanted his clothing and towel<br/>\nwarmed in the drier so I did that. He wasn&#39;t completely happy about having<br/>\nto shower, but he was happy that he got to shower in a way that was more<br/>\ncomfortable for him. Sometimes it is about other people&#39;s boundaries. When<br/>\nthat happens, I just try to find ways to make the process as pleasant as<br/>\npossible.<br/>\n<br/>\nPeace,<br/>\nJean Elizabeth<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://3mommies.blogspot.com\">http://3mommies.blogspot.com</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":223803785,"authorName":"Su Penn","from":"Su Penn &lt;su@...&gt;","profile":"marie101365","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: to bathe or not to bathe?","postDate":"1267555308","msgId":51280,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMxNDdEMUZDLTc3NTEtNDBBQS1BNzhCLTgzOTZGOUU3OTlBM0BzdXBlbm4uY29tPg==","inReplyToHeader":"PDRDNTNFMDEzLUY5REItNDgxOC1CMTcyLTU5QTQ5M0EyNzFGRUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PEZEQjdCQzIxNjUxNzQ5OUFCRDc5QkUxQUQ4RTZBOUJFQEFUZWFtQ29tcHV0ZXI+IDw0QzUzRTAxMy1GOURCLTQ4MTgtQjE3Mi01OUE0OTNBMjcxRkVAU2FuZHJhZG9kZC5jb20+"},"prevInTopic":51277,"nextInTopic":51283,"prevInTime":51279,"nextInTime":51281,"topicId":51243,"numMessagesInTopic":0,"msgSnippet":"... I just posted on my blog about the book The Explosive Child and how it divides things you might ask your kid to do into three categories: things you re","messageBody":"<div id=\"ygrps-yiv-2046877954\">On Mar 2, 2010, at 11:35 AM, Alisia wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; -=-He will be able to go with his dad today, but if he couldn&#39;t, how  <br/>\n&gt; would you guide<br/>\n&gt; us to a resolution? -=-<br/>\n<br/>\n </span></blockquote>Sandra Dodd replied: <br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Then I was say just TELL him to take a bath (maybe not a shower; that  <br/>\n&gt; can be too scary), even if you have to yell, because when he&#39;s cleaner  <br/>\n&gt; he&#39;ll feel better, and the next time you can ask him to do it without  <br/>\n&gt; the yelling.<br/>\n<br/>\n </span></blockquote>I just posted on my blog about the book The Explosive Child and how it divides things you might ask your kid to do into three categories: things you&#39;re just going to let him do, things you&#39;re going to try to problem-solve about, and things you pretty much need to demand he do (like, um, &quot;No, you really can&#39;t play basketball on the freeway off-ramp.&quot;). (link for the interested: <a rel=\"nofollow\" target=\"_blank\" href=\"http://tapeflags.blogspot.com/2010/03/explosive-child.html)\">http://tapeflags.blogspot.com/2010/03/explosive-child.html)</a><br/>\n<br/>\nNormally, we put bathing in the &quot;not gonna make him do it&quot; category for Eric, because he really dislikes it. It would become something we pushed more if there were negative consequences: skin trouble, or body odor, or those kinds of things. The worst problem we&#39;ve had so far is his long hair getting kind of greasy, and honestly, that&#39;s not a big enough problem for us to move bathing into the &quot;gotta do it&quot; category.<br/>\n<br/>\nWe usually strongly encourage a bath in the day or two before we visit my parents, and as Eric has gotten older it&#39;s a lot easier for him to agree to this. In fact, he will now suggest it himself. He also recognizes that he likes how he feels when he&#39;s clean, but hasn&#39;t quite gotten to the point of wanting to bathe more often in order to have that feeling.<br/>\n<br/>\nSo, you asked: what if we didn&#39;t have an option, but we needed him to be able to go with his grandparents because we both had to work?<br/>\n<br/>\nYou could start with problem-solving: are there any options short of just tossing him in the tub that will address his concern (doesn&#39;t want a bath) and grandma&#39;s concern (doesn&#39;t want to take smelly, unkempt kid to aquarium)? A sponge bath, a bath with a parent, any of the hair-washing ideas people have posted, swabbing him from head to toe with baby wipes, whatever?<br/>\n<br/>\nIf that fails though, and you really don&#39;t see an option, sometimes saying, &quot;Sorry, kiddo, but this has to happen,&quot; and dealing with the emotional fallout, is the only option left.<br/>\n<br/>\nThe good news is that over time, as your kids learn that you don&#39;t just arbitrarily make them do stuff, it gets easier for them to accept these &quot;sorry, no other option&quot; times. One of my favorite parenting moments was when Eric said to me a few months ago, &quot;I knew you wouldn&#39;t say No unless you had a good reason.&quot; Eventually your kids will know that you wouldn&#39;t make something non-negotiable if you had another option.<br/>\n<br/>\nSu<br/>\n<br/>\nmom of Eric, 8; Carl, almost 6; Yehva, 2.5</div>","specialLinks":[]},{"userId":276701487,"authorName":"Michele K","from":"Michele K &lt;mom2rci@...&gt;","profile":"mom2rci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: to bathe or not to bathe?","postDate":"1267553999","msgId":51285,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUwMDM3Ni4zNjEzMy5xbUB3ZWI1NzIwNC5tYWlsLnJlMy55YWhvby5jb20+","inReplyToHeader":"PDc0MTE3NS41ODk1NC5xbUB3ZWI4NjIwOC5tYWlsLmlyZC55YWhvby5jb20+","referencesHeader":"PDk3NTFBMDUwRTVEMzQ1MjQ5MzEyNjY2RjAxNzM3N0UxQEFscGhhU2l0ZT4gPDc0MTE3NS41ODk1NC5xbUB3ZWI4NjIwOC5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":51284,"nextInTopic":51294,"prevInTime":51284,"nextInTime":51286,"topicId":51243,"numMessagesInTopic":0,"msgSnippet":"But telling someone to be different or get out of your life is a manipulative, and risking estranging yourself.  In other words, my in laws are choosing to not","messageBody":"<div id=\"ygrps-yiv-1116809566\">But telling someone to be different or get out of your life is a manipulative, and risking estranging yourself.  In other words, my in laws are choosing to not associate with us because they think we neglect our children by letting them choose how to dress, write on themselves with marker, walk outside barefoot, and other such &quot;horrible&quot; things, and they blame my husband and me for not being able to see their grandkids.  We have never told my in laws they have to just accept us.  We tried to make the kids presentable and followed their house rules.  They just sent us an email out of the blue last autumn announcing they can no longer bear to see us as long as the kids are &quot;neglected&quot; and insulting me about my upbringing, lifestyle, etc.<br/>\n<br/>\n Michele, mom of Rhiannon 8, Caroline 6, and Ian 3<br/>\nLearning, Laughing, Snuggling, Scrapping<br/>\nMy Digital Scrapbook Pages<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  <br/>\nIt sounds like a good way to estrange his grandparents.<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] to bathe or not to bathe?","postDate":"1267552951","msgId":51277,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk4MTU4NS4xMDgyNi5xbUB3ZWI4MTUwNi5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":51272,"nextInTopic":51280,"prevInTime":51276,"nextInTime":51278,"topicId":51243,"numMessagesInTopic":0,"msgSnippet":"My kids sometimes  go for a while without a bath. Having said that I do tell them they need a bath for going to special places like going to grandmas house, ","messageBody":"<div id=\"ygrps-yiv-751885872\">My kids sometimes  go for a while without a bath.<br/>\nHaving said that I do tell them they need a bath for going to special places like going to grandmas house,<br/>\nparties, having friends over or if their hair is dirty or they smell.<br/>\nI talk about me going to take a shower and washing my hair cause I cannot go out in public like this.<br/>\nI used to create fun bath experiences when they were younger with bath toys, paints, colors.<br/>\nI give them new clean clothles to wear if theirs are dirty.<br/>\n<br/>\nWhat I don&#39;t do is just shrug it off  even if sometimes I let it be.<br/>\nWhen they are younger it may be more difficult so you find alternatives.<br/>\nLittle kids also don&#39;t get really stinky or grease and they like to play in water.<br/>\nGoing to the pool helps a lot. We go at least once a week or so.<br/>\n<br/>\nIF they only want one shirt ( MD had only two shirts at 2 or 3 that he liked) I try to buy more<br/>\nof those. I buy shirts with their favorite characters.<br/>\nI buy bubble baths with their favorite characters.<br/>\nI tell them that no one likes stinky people and that clean feels good.<br/>\nHow washing our hands after using the bathroom is important and why.<br/>\nGigi did not like hand washing so we had antimicrobial gels for her or little towels.<br/>\nbut I never forced her.<br/>\nNow she does it. I did not have to force her but we did talk about it<br/>\nand she saw me and her brother doing it.<br/>\nToday they are going to take a bath and they are OK with it.<br/>\nGigi&#39;s hair is supper matted and needs washing and lots of conditioner to untangle and MD has cub scouts and his hair is a tad oily.<br/>\n <br/>\nI have to say that screaming at them would not be a good thing.  Gigi would immediately start crying and say I hurt her feeling and I need to take a deep breath and MD would do it but feel hurt too.<br/>\nIf I just firmly tell them lets   do it because of this and that they will.  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\n,___  <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: to bathe or not to bathe?","postDate":"1267549301","msgId":51272,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc0MTE3NS41ODk1NC5xbUB3ZWI4NjIwOC5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PDk3NTFBMDUwRTVEMzQ1MjQ5MzEyNjY2RjAxNzM3N0UxQEFscGhhU2l0ZT4=","referencesHeader":"PDk3NTFBMDUwRTVEMzQ1MjQ5MzEyNjY2RjAxNzM3N0UxQEFscGhhU2l0ZT4="},"prevInTopic":51269,"nextInTopic":51277,"prevInTime":51271,"nextInTime":51273,"topicId":51243,"numMessagesInTopic":0,"msgSnippet":"It sounds like a good way to estrange his grandparents. Simon and Linnaea know that swearing in front of their grandparents will upset them, so they don t.","messageBody":"<div id=\"ygrps-yiv-366724343\">It sounds like a good way to estrange his grandparents. Simon and Linnaea know that swearing in front of their grandparents will upset them, so they don&#39;t. We&#39;ve talked about when the appearance of grooming is more important, when people will judge them based on how they look instead of on who they are. They are more than willing to listen to my information. They are usually willing to act accordingly, too. They are also, at 12 and 9, fairly good at judging those situations themselves, now. Sometimes they will have already brushed their hair before going somewhere without me mentioning it, or showered, or both.<br/>\n<br/>\nTelling someone else that they have to accept your child for who he or she is, isn&#39;t a good way to get them to accept them at all. Much better if you give your child the information, help them to live in the world instead of showing them that it is better to wait for the world to shape itself around them. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: &quot;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:annye@...\">annye@...</a>&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:annye@...\">annye@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nSent: Tuesday, 2 March, 2010 15:59:27<br/>\nSubject: [AlwaysLearning] Re: to bathe or not to bathe?<br/>\n<br/>\nGranted, my only child is still a teen but, I would bothered by his grandparents placing those kinds of restrictions on seeing him. If they want to see my son, they can see him as he is, not in whatever state they feel he should be. To me, it&#39;s a case of respect for him as his own person, something I&#39;m not seeing them having in the OP&#39;s case.<br/>\n<br/>\nIn peace,<br/>\n<br/>\nAnnette<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n------------------------------------<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: to bathe or not to bathe?","postDate":"1267548274","msgId":51268,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYxNEFDMEY5LTc1Q0EtNEM4OS04NEM4LUE2NEY2NDI3OEYyRUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDk3NTFBMDUwRTVEMzQ1MjQ5MzEyNjY2RjAxNzM3N0UxQEFscGhhU2l0ZT4=","referencesHeader":"PDk3NTFBMDUwRTVEMzQ1MjQ5MzEyNjY2RjAxNzM3N0UxQEFscGhhU2l0ZT4="},"prevInTopic":51265,"nextInTopic":51269,"prevInTime":51267,"nextInTime":51269,"topicId":51243,"numMessagesInTopic":0,"msgSnippet":"... That s their choice, though. It s not up to the mom to dictate how they relate to their grandchild. A mom can decide whether and how long a child can visit","messageBody":"<div id=\"ygrps-yiv-303877939\">On Mar 2, 2010, at 10:59 AM, &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:annye@...\">annye@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I would bothered by his grandparents placing those kinds of  <br/>\n&gt; restrictions on seeing him<br/>\n<br/>\n </span></blockquote>That&#39;s their choice, though. It&#39;s not up to the mom to dictate how  <br/>\nthey relate to their grandchild.<br/>\n<br/>\nA mom can decide whether and how long a child can visit the  <br/>\ngrandparents and can set conditions on when the grandparents visit  <br/>\nher house, but the grandparents get to decide what they&#39;ll do in  <br/>\ntheir own home, even if it damages the relationship.<br/>\n<br/>\nIf a parent told me I needed to accept unpleasantness from their  <br/>\nchild because that&#39;s who he is, I&#39;d decide I didn&#39;t need to be around  <br/>\nwho he is ;-)<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: to bathe or not to bathe?","postDate":"1267547726","msgId":51265,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRDNTNFMDEzLUY5REItNDgxOC1CMTcyLTU5QTQ5M0EyNzFGRUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEZEQjdCQzIxNjUxNzQ5OUFCRDc5QkUxQUQ4RTZBOUJFQEFUZWFtQ29tcHV0ZXI+","referencesHeader":"PEZEQjdCQzIxNjUxNzQ5OUFCRDc5QkUxQUQ4RTZBOUJFQEFUZWFtQ29tcHV0ZXI+"},"prevInTopic":51259,"nextInTopic":51268,"prevInTime":51264,"nextInTime":51266,"topicId":51243,"numMessagesInTopic":0,"msgSnippet":"-=-He will be able to go with his dad today, but if he couldn t, how would you guide us to a resolution? -=- Then I was say just TELL him to take a bath (maybe","messageBody":"<div id=\"ygrps-yiv-2084924762\">-=-He will be able to go with his dad today, but if he couldn&#39;t, how  <br/>\nwould you guide<br/>\nus to a resolution? -=-<br/>\n<br/>\nThen I was say just TELL him to take a bath (maybe not a shower; that  <br/>\ncan be too scary), even if you have to yell, because when he&#39;s cleaner  <br/>\nhe&#39;ll feel better, and the next time you can ask him to do it without  <br/>\nthe yelling.<br/>\n<br/>\nThere is nothing in the philosophy of unschooling that excuses parents  <br/>\nfrom keeping their children clean.  The government doesn&#39;t allow  <br/>\npeople to keep children, not even their own, if they can&#39;t figure out  <br/>\nhow to keep them clean and fed.<br/>\n<br/>\n-=-I would bothered by his grandparents placing those kinds of  <br/>\nrestrictions on seeing him. If they want to see my son, they can see  <br/>\nhim as he is, not in whatever state they feel he should be. -=-<br/>\n<br/>\nIt wasn&#39;t about whether they would see him.  It&#39;s whether they would  <br/>\nbe willing to take him out in public.<br/>\n<br/>\n-=- To me, it&#39;s a case of respect for him as his own person, something  <br/>\nI&#39;m not seeing them having in the OP&#39;s case.-=-<br/>\n<br/>\nThey don&#39;t have to respect anyone they don&#39;t actually respect.   <br/>\nPretending respect isn&#39;t respect.  It&#39;s likely that if he hasn&#39;t  <br/>\nchanged clothes or had a shower for a while, the parents aren&#39;t  <br/>\nrespecting him OR his parents.<br/>\n<br/>\nUnschooling doesn&#39;t give anyone a free ticket to live outside of the  <br/>\nrealities of the cultural expectations around them.  Bacteria will  <br/>\ngrow on unschoolers the same as anyone else.  Skin conditions that can  <br/>\ncome from uncleanliness don&#39;t know or care whether the kid goes to  <br/>\nschool or not.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":276701487,"authorName":"Michele K","from":"Michele K &lt;mom2rci@...&gt;","profile":"mom2rci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] to bathe or not to bathe?","postDate":"1267546541","msgId":51269,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU4NTE2OS43NTE4Ni5xbUB3ZWI1NzIwNC5tYWlsLnJlMy55YWhvby5jb20+","inReplyToHeader":"PGhtaWNjYithMHEwQGVHcm91cHMuY29tPg==","referencesHeader":"PGhtaWNjYithMHEwQGVHcm91cHMuY29tPg=="},"prevInTopic":51268,"nextInTopic":51272,"prevInTime":51268,"nextInTime":51270,"topicId":51243,"numMessagesInTopic":0,"msgSnippet":"We have a similar situation.  My in laws have said the same kind of thing, and even bought an entire wardrobe for each of my children for a trip they took us","messageBody":"<div id=\"ygrps-yiv-1224440594\">We have a similar situation.  My in laws have said the same kind of thing, and even bought an entire wardrobe for each of my children for a trip they took us on because they are appalled that I &quot;allow&quot; my children to dress in hand me down clothes that might be mismatched or have stains and I don&#39;t force them to bathe.<br/>\n<br/>\nI have let my children decide whether they want to follow their grandparents&#39; rule or stay home.  They have chosen to follow it and go, so far. <br/>\n<br/>\n Michele, mom of Rhiannon 8, Caroline 6, and Ian 3<br/>\nLearning, Laughing, Snuggling, Scrapping<br/>\nMy Digital Scrapbook Pages <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":115367700,"authorName":"annye@sbcglobal.net","from":"&lt;annye@...&gt;","profile":"teridolaris","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: to bathe or not to bathe?","postDate":"1267545567","msgId":51259,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk3NTFBMDUwRTVEMzQ1MjQ5MzEyNjY2RjAxNzM3N0UxQEFscGhhU2l0ZT4="},"prevInTopic":51258,"nextInTopic":51265,"prevInTime":51258,"nextInTime":51260,"topicId":51243,"numMessagesInTopic":0,"msgSnippet":"Granted, my only child is still a teen but, I would bothered by his grandparents placing those kinds of restrictions on seeing him. If they want to see my son,","messageBody":"<div id=\"ygrps-yiv-1474158095\">Granted, my only child is still a teen but, I would bothered by his grandparents placing those kinds of restrictions on seeing him. If they want to see my son, they can see him as he is, not in whatever state they feel he should be. To me, it&#39;s a case of respect for him as his own person, something I&#39;m not seeing them having in the OP&#39;s case.<br/>\n<br/>\nIn peace,<br/>\n<br/>\nAnnette<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":414313399,"authorName":"Alisia Hallett","from":"&quot;Alisia Hallett&quot; &lt;alisiamarie@...&gt;","profile":"amhe6","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: to bathe or not to bathe?","postDate":"1267545554","msgId":51258,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEZEQjdCQzIxNjUxNzQ5OUFCRDc5QkUxQUQ4RTZBOUJFQEFUZWFtQ29tcHV0ZXI+"},"prevInTopic":51246,"nextInTopic":51259,"prevInTime":51257,"nextInTime":51259,"topicId":51243,"numMessagesInTopic":0,"msgSnippet":"-=-You could offer to wash him, in some loving way, because YOU want him to go to the aquarium.-=- He does not accept any loving attempt to move him in a","messageBody":"<div id=\"ygrps-yiv-1845583719\">-=-You could offer to wash him, in some loving way, because YOU want him <br/>\nto go to the aquarium.-=-<br/>\n<br/>\nHe does not accept any loving attempt to move him in a direction I would like him to go.<br/>\nThis day did start out as a need of mine for child care because my dh and I both need<br/>\nto work.  He will be able to go with his dad today, but if he couldn&#39;t, how would you guide<br/>\nus to a resolution? <br/>\n<br/>\nAlisia<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: [AlwaysLearning] to bathe or not to bathe?","postDate":"1267529724","msgId":51246,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI5MzkxNkMwLUU1NjQtNDk0Ri1CNENCLTgxMkMzNUVBQjE0N0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhtaWNjYithMHEwQGVHcm91cHMuY29tPg==","referencesHeader":"PGhtaWNjYithMHEwQGVHcm91cHMuY29tPg=="},"prevInTopic":51244,"nextInTopic":51258,"prevInTime":51245,"nextInTime":51247,"topicId":51243,"numMessagesInTopic":0,"msgSnippet":"-=-. So, is it simply a choice my ds needs to make - either wash up and go, or, remain unbathed and miss out on the trip? -=- When Kirby was little and didn t","messageBody":"<div id=\"ygrps-yiv-1804573378\">-=-. So, is it simply a choice my ds needs to make - either wash up  <br/>\nand go, or, remain unbathed and miss out on the trip? -=-<br/>\n<br/>\nWhen Kirby was little and didn&#39;t like to get his head wet, his dad or  <br/>\nI would take him (and some of his toys) in the shower with us, and  <br/>\nhold him up (when we were still able to) to wash his hair, and then  <br/>\nlet him just play on the floor for the rest of the time.  The steam  <br/>\nand the towelling off afterwards got him pretty clean.<br/>\n<br/>\nYou could lay him down on something (kitchen cabinet, ideally, but any  <br/>\nbench or table), fold a towel for a pillow, hang his head off the end,  <br/>\nand wash it gently by pouring warm water slowly with a cup, from a pan  <br/>\nor a bucket or big bowl.<br/>\n<br/>\nAlso, with Kirby, we would set up a play situation in the bathtub,  <br/>\nmaybe without bath water, but with a pan of soapy water and things for  <br/>\nhim to wash (when he was smaller).<br/>\n<br/>\nIt doesn&#39;t matter WHY he&#39;s scared of water, just that he is.  But you  <br/>\ncan&#39;t make your mom take him, either.  That&#39;s no good.<br/>\n<br/>\nYou could offer to wash him, in some loving way, because YOU want him  <br/>\nto go to the aquarium.<br/>\n<br/>\nIf you&#39;re where it&#39;s warm enough, maybe you could do it outside, with  <br/>\nwarm water carried out in milk jugs or something.<br/>\n<br/>\nOnce we washed Holly&#39;s hair outside with warm water from the hot tub.   <br/>\nShe lay on top of half the lid, and I could pour the water on her hair  <br/>\nand it just went onto the deck.  Washed the deck at the same time.<br/>\n<br/>\nI don&#39;t like water in my eyes, so for a shower, for hair washing, I  <br/>\nfold a wash cloth lengthwise in fourths, and hold that over my eyes  <br/>\nwhen I put my head under the shower, to keep water and soap out of my  <br/>\neyes.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] to bathe or not to bathe?","postDate":"1267526835","msgId":51244,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEEzQUMzREQ0LTA4RTctNDI2Ni04MzM2LTU2QUE5NDNEM0IzOEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGhtaWNjYithMHEwQGVHcm91cHMuY29tPg==","referencesHeader":"PGhtaWNjYithMHEwQGVHcm91cHMuY29tPg=="},"prevInTopic":51243,"nextInTopic":51246,"prevInTime":51243,"nextInTime":51245,"topicId":51243,"numMessagesInTopic":0,"msgSnippet":"... Yes. It s their trip. They get to set the conditions, even if you don t agree. Just as in the adult world, if someone doesn t like the conditions someone","messageBody":"<div id=\"ygrps-yiv-1797000294\">On Mar 2, 2010, at 1:48 AM, Alisia wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So, is it simply a choice my ds needs to make - either wash up and  <br/>\n&gt; go, or, remain unbathed and miss out on the trip?<br/>\n<br/>\n </span></blockquote>Yes. It&#39;s their trip. They get to set the conditions, even if you  <br/>\ndon&#39;t agree. Just as in the adult world, if someone doesn&#39;t like the  <br/>\nconditions someone else has set up for their gathering, they can  <br/>\nchoose not to participate.<br/>\n<br/>\nYou can offer to take him to the aquarium at some other time.<br/>\n<br/>\nAs for bathing, it&#39;s not unusual for kids not to know why they don&#39;t  <br/>\nlike something so asking isn&#39;t the best or only course of  <br/>\ninvestigation. Do some detective work and try various things out. Is  <br/>\nit cold when he gets out of the tub? A space heater can help. Or  <br/>\nmaybe taking him swimming at the Y once a week.<br/>\n<br/>\nIf you focus on helping him past difficulties or alternative ways to  <br/>\nlook (and smell! ;-) presentable rather than focusing on getting him  <br/>\nto bathe that will help.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":414313399,"authorName":"Alisia","from":"&quot;Alisia&quot; &lt;alisiamarie@...&gt;","profile":"amhe6","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"to bathe or not to bathe?","postDate":"1267512523","msgId":51243,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhtaWNjYithMHEwQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":51244,"prevInTime":51242,"nextInTime":51244,"topicId":51243,"numMessagesInTopic":0,"msgSnippet":"I ve been following the group for a long time, wanting to ask many, many questions.  Tonight I thought I could ask this one plain and simply.  A couple of","messageBody":"<div id=\"ygrps-yiv-1253698175\">I&#39;ve been following the group for a long time, wanting to ask many, many questions.  Tonight I thought I could ask this one plain and simply.  A couple of weeks ago, my ds, 7, was invited to join his grandma, grandpa, and 18yo schooled half-sister for a trip to the aquarium tomorrow.  Today, his sister called from grandma&#39;s house with a &quot;message&quot; for him from grandma: &quot;He can&#39;t go with us unless he showers, washes his hair, and changes his clothes.&quot;  Frankly, he doesn&#39;t bathe much.  He also doesn&#39;t change his clothes often.  I don&#39;t know the last time he washed his hair.  He doesn&#39;t want to and is unwilling or unable to say why. So, is it simply a choice my ds needs to make - either wash up and go, or, remain unbathed and miss out on the trip?  I could express all of my mixed feelings here and describe the family background that brings us to this point, but I don&#39;t know that it&#39;s necessary.  So, have at it.  Thanks so much for this group.<br/>\n<br/>\nAlisia</div>","specialLinks":[]}],"prevTopicId":51780,"nextTopicId":51946}}