{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":1798873,"authorName":"PSoroosh@aol.com","from":"PSoroosh@...","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] no curriculums","postDate":"1028681461","msgId":40040,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGMxLjI0ZGMzMTE4LjJhODFjOGY1QGFvbC5jb20+"},"prevInTopic":40031,"nextInTopic":0,"prevInTime":40039,"nextInTime":40041,"topicId":40031,"numMessagesInTopic":0,"msgSnippet":"In a message dated 8/6/2002 4:08:44 PM Pacific Daylight Time, herbtea@gte.net ... Me too!!!! I educated MYSELF the same way you did - I enjoyed it the same way","messageBody":"<div id=\"ygrps-yiv-1348721555\">In a message dated 8/6/2002 4:08:44 PM Pacific Daylight Time, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:herbtea@...\">herbtea@...</a> <br/>\nwrites:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But I did use those scope and sequences for myself and sorted out my own<br/>\n&gt; past education actually. Saw what I had been almost taught in the<br/>\n&gt; schools, or had heard of and never covered or understood. What I knew<br/>\n&gt; far more of then they. It was highly profitable time spent for me, and I<br/>\n&gt; think some of that rubbed off in a good way on my daughter.  Actually,<br/>\n&gt; probably the attention I did put on it left my daughter with free time<br/>\n&gt; to go unbothered by me and my concerns or butt-in-ski tendencies. So you<br/>\n&gt; see: a viable use for curriculums, scope and sequences! To take the<br/>\n&gt; parents&#39; time to read and figure out and keep them out of their<br/>\n&gt; children&#39;s hair! Never thought of that one, did ya&#39;? ;)<br/>\n<br/>\n </span></blockquote>Me too!!!! I educated MYSELF the same way you did - I enjoyed it the same way <br/>\nI enjoyed going through the teaching credential program, in a weird warped <br/>\nway &lt;G&gt;.<br/>\n<br/>\n--pamS<br/>\n<br/>\nNational Home Education Network<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.NHEN.org\">http://www.NHEN.org</a><br/>\nChanging the Way the World Sees Homeschooling!<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":257127,"authorName":"Deb","from":"Deb &lt;herbtea@...&gt;","profile":"live_oak2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"no curriculums","postDate":"1028676061","msgId":40031,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNENTA1OURELkU2OTcxMEREQGd0ZS5uZXQ+"},"prevInTopic":0,"nextInTopic":40040,"prevInTime":40030,"nextInTime":40032,"topicId":40031,"numMessagesInTopic":0,"msgSnippet":"... and is spending her summer trying to figure out what she s going to teach her son in the fall. She s sweet and joyful and loves her kids and interacts ","messageBody":"<div id=\"ygrps-yiv-2118200111\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;I know someone who uses Calvert Curriculum. She is the teacher in that family <br/>\n </span></blockquote>and is spending her summer trying to figure out what she&#39;s going to<br/>\nteach her <br/>\nson in the fall. She&#39;s sweet and joyful and loves her kids and interacts <br/>\nreally nicely with them and pays close attention to their interests and<br/>\ndoes <br/>\nher best to support them. They all are happy and content with how things<br/>\nare <br/>\nworking. That doesn&#39;t make it unschooling. Why not? Well - because all<br/>\nthe <br/>\n&quot;teaching&quot;  - including the planning, carrying out, and assessment -- is <br/>\nincompatible with unschooling, that&#39;s why. If someone comes here and<br/>\nwants to <br/>\nknow about unschooling and she says, &quot;Well, look at all the &#39;teaching<br/>\nplans&#39; <br/>\nand pick out which kind of teacher you prefer to be and buy the<br/>\ncurriculum <br/>\nand teach it to your child,&quot; it would be really wrong of us not to step<br/>\nup <br/>\nand say, &quot;That isn&#39;t unschooling.&quot; If we want people to understand, they<br/>\nneed <br/>\nto understand that traditional style &quot;teaching&quot; in the widest meaning of<br/>\nthe <br/>\nword is not necessary then it would be more clear if we didn&#39;t confuse<br/>\nthe <br/>\nissue so  much..&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\nYes, I agree, it doesn&#39;t make it unschooling. There seems to be an angst<br/>\namongst some of the unschooling moms that is accepted as part of<br/>\nunschooling - a noble suffering with the uncertainty, so to speak.<br/>\nThat&#39;s OK, if that&#39;s your bent, and it might be just what someone needs<br/>\nand wants to experience - a boldness to throw away all guides and go on<br/>\nyour quest for living! I really am a believer that one size does not fit<br/>\nall, and we don&#39;t all have to go the same route or need the same thing.  <br/>\n<br/>\nI, however, did it differently. I bought or at least looked at  samples<br/>\nof every program and curriculum out there. I got books on what your<br/>\nchild should know when, and how do you teach this and that. To this day,<br/>\nmy house is stuffed with these books and even textbooks for reference in<br/>\ncase I want to refer to them. I read lots of them, have zillions I<br/>\nhaven&#39;t read too. Did I use them with my daughter? Nope. If she asked me<br/>\nwhat they were, I told her it was too boring to do. Or sometimes we<br/>\nstarted with one and it WAS too boring or she already knew or could<br/>\nfigure out what was in it herself. Sometimes a book was an adventure<br/>\nthat gave us an interesting starting point for a few minutes and then we<br/>\nwent off on our own research from there. She had a little fun with some<br/>\nthing or other that I had around if she was interested, but mainly we<br/>\nread and played and explored the world around, made our own books (not<br/>\nbecause of any suggestion from some curriculum, somehow I could never<br/>\nget around to it when i set out to do it that way), but just because it<br/>\nevolved naturally out of what we were doing and I was interested and she<br/>\nwas too at the same time.<br/>\n<br/>\nWhat I used all those curriculums and how-to books for was to satisfy<br/>\nmyself that I KNEW what the system was doing supposedly at different<br/>\nlevels or grades even, that I knew all the steps clearly in  how to<br/>\nmultiply and divide fractions or whatever it was I was reading about.<br/>\nWhat X curriculum covered, and what Z curriculum covered and how they<br/>\ncompared. And nary a one did I make my daughter do. She was too smart or<br/>\nnot interested or I was not interested ands too smart. <br/>\n<br/>\nBUT I KNEW and no one could tell me that I was missing anything or<br/>\nshould do anything. If someone asked me what she was supposed to be<br/>\nlearning in 4th grade science, I could sit back and say &quot;oh, we already<br/>\ncovered that last year when we played Where in Space is Carmen San Diego<br/>\n- and by the way my daughter and her friend had such fun &quot;cheating&quot; on<br/>\nit by looking up all about the moons of every planet in the book &quot;Moons<br/>\nof the Solar System&quot; from the library.&quot; No one could shake me, and I<br/>\nknew what a paltry thing the school system&#39;s expectations were, and how<br/>\nmuch richer was everything we did. This didn&#39;t take the majority of my<br/>\ntime, I spent most of my time living and unschooling happily. <br/>\n<br/>\nBut I did use those scope and sequences for myself and sorted out my own<br/>\npast education actually. Saw what I had been almost taught in the<br/>\nschools, or had heard of and never covered or understood. What I knew<br/>\nfar more of then they. It was highly profitable time spent for me, and I<br/>\nthink some of that rubbed off in a good way on my daughter.  Actually,<br/>\nprobably the attention I did put on it left my daughter with free time<br/>\nto go unbothered by me and my concerns or butt-in-ski tendencies. So you<br/>\nsee: a viable use for curriculums, scope and sequences! To take the<br/>\nparents&#39; time to read and figure out and keep them out of their<br/>\nchildren&#39;s hair! Never thought of that one, did ya&#39;? ;)<br/>\n<br/>\nMy life is richer, and now the fluff I hear or run across in this arena,<br/>\nI can evaluate, ignore or toss off easily. (I didn&#39;t say I could throw<br/>\naway a book...now that is a whole nother story. I am actually looking<br/>\nfor an abandoned library to renovate and move into; if anyone sees one<br/>\nfor sale, please let me know.)<br/>\n<br/>\nDebbie Radstrom<br/>\n<br/>\nDirector, Live Oak Academy<br/>\nVisit our website <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.newhealth.net/liveoak/\">http://www.newhealth.net/liveoak/</a><br/>\n ~Flexible Alternative Schooling for Families~</div>","specialLinks":[]}],"prevTopicId":40032,"nextTopicId":39857}}