{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] speaking of teenagers: could use some advice","postDate":"1126492470","msgId":108213,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhiLjJmNjM5NDA0LjMwNTY0MzM2QGFvbC5jb20+"},"prevInTopic":108191,"nextInTopic":0,"prevInTime":108212,"nextInTime":108214,"topicId":108190,"numMessagesInTopic":0,"msgSnippet":"Although I ve expressed some opinions, I don t see that this is an unschooling issue.   He s a grown schoolkid; your daughter is a toddler.   Most of what this","messageBody":"<div id=\"ygrps-yiv-1242715442\">Although I&#39;ve expressed some opinions, I don&#39;t see that this is an <br/>\nunschooling issue.   He&#39;s a grown schoolkid; your daughter is a toddler.   Most of what <br/>\nthis list knows about isn&#39;t applicable.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My stepson is 18, and has just come 3 months ago from France, to live with <br/>\n&gt; us.<br/>\n&gt; He was unhappily schooled his whole life, bounced from private school to<br/>\n&gt; private school.......and finally public when no more would take him.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>It seems quite a stretch to have a stepson stay with your parents.   It must <br/>\nhave seemed crowded and tense enough.    <br/>\n<br/>\nBut bottom line, if it&#39;s your parents&#39; house, they should be able to call the <br/>\nshots about how rooms are kept and how people behave.<br/>\n<br/>\n-=-My husband works a real lot so he&#39;s home with me and my 15 month old <br/>\ndaughter.-=-<br/>\n<br/>\nDo your parents work during the day?<br/>\n<br/>\n-=-When I ask him to come with us some place he declines (when my husband is<br/>\nhome he does go out with him to play tennis and such).-=-<br/>\n<br/>\nAre you asking him just at the last minute, or are you planning things a few <br/>\ndays in advance specifically intended to be of interest to him (yet something <br/>\nyour daughter would like too)?   <br/>\n<br/>\nMaybe because of the crowdedness situation, you should be planning many more <br/>\ndays out, and take him with you.   Plan for it, maybe two touristing days a <br/>\nweek.   It would be good all sorts of ways.<br/>\n<br/>\n-=-We live with my parents temporarily (we just bought a business and are<br/>\nstaying w/ them for a bit) and they are not OK with his lifestyle (my mom <br/>\nmostly).-=-<br/>\n<br/>\nDid they know when they agreed to let you live there that he would be part of <br/>\nthe deal?<br/>\n<br/>\n-=-He eats boxes of cookies and drinks liters of soda daily.......often there <br/>\nis<br/>\nnothing left for the rest of them.-=-<br/>\n<br/>\nIf you&#39;re not buying that food, ask him not to eat so much of your mom&#39;s <br/>\nfood.   Boundaries seem to be being forgotten.<br/>\n<br/>\n-=-Monopolizes their computer.-=-<br/>\n<br/>\nYou don&#39;t have a computer?   Can you get one and let him use yours?<br/>\n<br/>\n-=-Just lots of bad habits for a &quot;guest&quot; to have (their opinion).-=-<br/>\n<br/>\nIs he not a guest?   <br/>\n<br/>\nIf my daughter grew up and<br/>\nmarried a guy<br/>\nwho had a grown son<br/>\nand if my daughter needed to stay at my house, I wouldn&#39;t mind HER, and her <br/>\nchild, of course.   Her husband, part of the deal; HIS SON?   Absolutely a <br/>\nguest.   Not my relatives.   Her relative by marriage.   He needs to be very, very <br/>\nnice.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":230706843,"authorName":"Betsy Hill","from":"Betsy Hill &lt;ecsamhill@...&gt;","profile":"ecsamhill2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] speaking of teenagers: could use some advice","postDate":"1126451523","msgId":108191,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQzMjQ0OTQzLjUwMjAxMDhAc2JjZ2xvYmFsLm5ldD4=","inReplyToHeader":"PDE5ZC4zYmUwYzZhNC4zMDU1MzRiM0Bhb2wuY29tPg==","referencesHeader":"PDE5ZC4zYmUwYzZhNC4zMDU1MzRiM0Bhb2wuY29tPg=="},"prevInTopic":108190,"nextInTopic":108213,"prevInTime":108190,"nextInTime":108192,"topicId":108190,"numMessagesInTopic":0,"msgSnippet":"** He spends almost all his waking hours on the computer or on the X-box.** Is this something he does because he doesn t have any friends locally? ** Just lots","messageBody":"<div id=\"ygrps-yiv-973573636\">** He spends almost all his waking hours on the computer or on the X-box.**<br/>\n<br/>\nIs this something he does because he doesn&#39;t have any friends locally?<br/>\n<br/>\n<br/>\n** Just lots of bad habits for a &quot;guest&quot; to have (their opinion).**<br/>\n<br/>\nIf they think of him as a &quot;guest&quot; and not as &quot;family&quot; then it sounds <br/>\nlike they don&#39;t think of him as if he&#39;s really their grandson.  Thus <br/>\nit&#39;s not surprising he doesn&#39;t think their grandaughter is his sister, <br/>\nright?<br/>\n<br/>\n<br/>\n** I worry about his health and mind living this lifestyle (no sunlight,<br/>\nsmoking, minimal exercise etc.).  I&#39;ve done it too when I was his age <br/>\nand I was a very unhealthy girl.**<br/>\n<br/>\nDo you remember people (like your parents) pushing you to change and how <br/>\nyou felt about it?<br/>\n<br/>\n<br/>\n** I keep the house stocked with natural, whole foods and that&#39;s what I <br/>\ncook.  He eats that too so that&#39;s a good thing.<br/>\nI give him lots of space but lots of caring too.<br/>\nI invite him to go places, never tell him he has to go.<br/>\nI try to find ways (without being too obvious) for us to connect as a <br/>\nfamily when dh isn&#39;t home and when he is.**<br/>\n<br/>\nThis all sounds good.  I believe you are taking the right approach, even <br/>\nif you don&#39;t see results yet.<br/>\n<br/>\nIt&#39;s tough when your home is not fully your home, as is your situation <br/>\nright now.  My mother went through a similar thing with my brother (in <br/>\nhis 40s) recently when he was unemployed.  He could come and stay in her <br/>\nguestroom, for a short time.  But the house she lives in is owned by her <br/>\nboyfriend who eventually lost patience and made him move out.  I do <br/>\nthink it&#39;s best if your parents talk to your husband about his son&#39;s <br/>\nbehavior, leaving you out of the &quot;chain of command&quot; as much as <br/>\npossible.  This is pretty common advice for stepfamilies.  Your husband <br/>\nmay not want to deal with complaints, but his relationship with his son <br/>\nis much stronger than yours.<br/>\n<br/>\nDoes this young man drive?  Did he want to come to the U.S., or is there <br/>\nsome conflict with his mother driving him from the home he was raised <br/>\nin? Was this originally a visit, or is he planning to stay in the U.S. <br/>\npermanently?<br/>\n<br/>\nI&#39;m ready to say that the only thing I think is likely to help is for <br/>\nyour husband to increase the amount of time he spends with his adult <br/>\nson, even if he has to cut back on his work hours to do so.<br/>\n<br/>\n&quot;Strewing&quot; a few interesting things may help a bit.  Maybe even French <br/>\nmagazines and videos if he is feeling homesick.  Since the young man <br/>\ndoesn&#39;t seem very active, watching videos is a low-energy activity that <br/>\nI thought he might be willing to do, but he&#39;s unlikely to want to watch <br/>\nyour daughter&#39;s Disney videos.  You may not want really violent movies <br/>\non when your daughter is awake, but maybe she wouldn&#39;t notice much if he <br/>\nwas watching sexy movies (tasteful ones, rated R, I mean).  Another <br/>\npossible type of movie that came to mind is the Ethan Hawke and Julia <br/>\nDelpy movies Before Sunrise and Before Sunset.  These are about a young <br/>\nAmerican man and a young French woman talking on a train.  (v. little <br/>\nsex in them).  He might think Julia is cute, and you might find stuff to <br/>\ntalk about about differences between French and American culture. <br/>\n<br/>\nOther stuff you strew could be information about the local club scene, <br/>\nor other things related to his interests.  (I don&#39;t know what they are.) <br/>\nYou probably have to be subtle, because it sounds like he may be highly <br/>\nresistant to feeling like he is being led or controlled by grown-ups.<br/>\n<br/>\n<br/>\n** I know he will not be like this forever as he is 18 and is bound to <br/>\nwant some kind of social interaction.**<br/>\n<br/>\nThe desire to impress women has gotten many a young man cleaned up and <br/>\noff the couch. &lt;g&gt;  So, I think you are right in what you say above.<br/>\n<br/>\nBetsy</div>","specialLinks":[]},{"userId":79379219,"authorName":"lovelifenyc@aol.com","from":"lovelifenyc@...","profile":"lovelifenyc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"[UnschoolingDiscussion] speaking of teenagers: could use some advice","postDate":"1126423219","msgId":108190,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5ZC4zYmUwYzZhNC4zMDU1MzRiM0Bhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":108191,"prevInTime":108189,"nextInTime":108191,"topicId":108190,"numMessagesInTopic":0,"msgSnippet":"Hi everyone! I hope you don t mind me asking this question since it is about an older teen.......but I could really use some advice. My stepson is 18, and has","messageBody":"<div id=\"ygrps-yiv-1153705622\">Hi everyone!<br/>\nI hope you don&#39;t mind me asking this question since it is about an older <br/>\nteen.......but I could really use some advice.<br/>\n<br/>\nMy stepson is 18, and has just come 3 months ago from France, to live with us.<br/>\nHe was unhappily schooled his whole life, bounced from private school to <br/>\nprivate school.......and finally public when no more would take him.<br/>\n<br/>\nHe is a highly intelligent, deep and sweet boy who has had a lot of heartache <br/>\nin his life.<br/>\nMy husband works a real lot so he&#39;s home with me and my 15 month old daughter.<br/>\nHe is very sensitive and I think he resents my dd a little. He said before he <br/>\ncame here that she&#39;s not his sister.<br/>\nHe definitely likes us though.<br/>\n<br/>\nHe spends almost all his waking hours on the computer or on the X-box.<br/>\nHe stays up all night and sleeps most of the day and doesn&#39;t get any sunlight <br/>\nreally.<br/>\nWhen I ask him to come with us some place he declines (when my husband is <br/>\nhome he does go out with him to play tennis and such).<br/>\n<br/>\nWe live with my parents temporarily (we just bought a business and are <br/>\nstaying w/ them for a bit) and they are not OK with his lifestyle (my mom mostly).<br/>\nHis room is overflowing garbage (until I pick it up) and he doesn&#39;t pitch in <br/>\nwhen they are doing work. He locks the housekeeper out of his room.....lol.<br/>\nHe also doesn&#39;t work and didn&#39;t work for about 6 months before he left France.<br/>\nHe eats boxes of cookies and drinks liters of soda daily.......often there is <br/>\nnothing left for the rest of them.<br/>\nMonopolizes their computer.<br/>\nJust lots of bad habits for a &quot;guest&quot; to have (their opinion).<br/>\n<br/>\nI am fine with him keeping his room how he wants but it&#39;s not my home and he <br/>\nhas a room on the main level where people are constantly entering.<br/>\n<br/>\nI admit I was a bit shocked when I saw that he had absolutely no desire to go <br/>\nout and explore his new surroundings.......the town, etc.<br/>\nI was thinking &quot;maybe he&#39;s de-schooling&quot; but it&#39;s been 3 months and it&#39;s <br/>\nstill this way.<br/>\nI worry about his health and mind living this lifestyle (no sunlight, <br/>\nsmoking, minimal exercise etc.).<br/>\nI&#39;ve done it too when I was his age and I was a very unhealthy girl.<br/>\n<br/>\nI keep the house stocked with natural, whole foods and that&#39;s what I cook.<br/>\nHe eats that too so that&#39;s a good thing.<br/>\nI give him lots of space but lots of caring too.<br/>\nI invite him to go places, never tell him he has to go.<br/>\nI try to find ways (without being too obvious) for us to connect as a family <br/>\nwhen dh isn&#39;t home and when he is.<br/>\n<br/>\nI know he will not be like this forever as he is 18 and is bound to want some <br/>\nkind of social interaction. He was very social in Nice, where he lived.....a <br/>\nclub kid. <br/>\nI just am at a loss as to how to engage him in our daily life and connect.<br/>\nI don&#39;t know how to help him connect with others and how to facilitate <br/>\npleasurable life experiences for him.<br/>\n<br/>\nI&#39;m new to this so please, any advice is welcome.<br/>\n<br/>\n-amy<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":108202,"nextTopicId":108236}}