{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":8,"messages":[{"userId":293639925,"authorName":"warblwarbl2000","from":"&quot;warblwarbl2000&quot; &lt;pamtellew@...&gt;","profile":"warblwarbl2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Connections (triggered by &quot;Learning Expansively&quot;)","postDate":"1190528767","msgId":30800,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZkNTB0ditjZjQ0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDVmNWM2ZmE2OGVkNGMxMWIwYjM5ZTllNTE3NGI0NTUwQGNveC5uZXQ+"},"prevInTopic":30799,"nextInTopic":0,"prevInTime":30799,"nextInTime":30801,"topicId":30769,"numMessagesInTopic":0,"msgSnippet":"... Ok, now I m gonna want to go on and on with quotes: Cats are so you can have kittens. Eyebrows are to go over your eyes. The sun is to tell you when","messageBody":"<div id=\"ygrps-yiv-912527781\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Nancy Wooton &lt;nancywooton@...&gt;<br/>\nwrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I love that book!  I think my favorite is, &quot;A rug is so dogs have <br/>\n&gt; napkins.&quot;<br/>\n&gt; <br/>\n </span></blockquote>Ok, now I&#39;m gonna want to go on and on with quotes:<br/>\n<br/>\n&quot;Cats are so you can have kittens.&quot;<br/>\n<br/>\n&quot;Eyebrows are to go over your eyes.&quot;<br/>\n<br/>\n&quot;The sun is to tell you when it&#39;s every day.&quot;<br/>\n<br/>\nand &quot;Dishes are to do.&quot; And so I will!<br/>\n<br/>\nPam</div>","specialLinks":[]},{"userId":166322738,"authorName":"Nancy Wooton","from":"Nancy Wooton &lt;nancywooton@...&gt;","profile":"ikonstitcher","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Connections (triggered by &quot;Learning Expansively&quot;)","postDate":"1190519603","msgId":30799,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVmNWM2ZmE2OGVkNGMxMWIwYjM5ZTllNTE3NGI0NTUwQGNveC5uZXQ+","inReplyToHeader":"PDIwMDcwOTIyMjMwMy5sOE1OM2pTNjAzOTQ1MkBzaGVsbC5sbWkubmV0Pg==","referencesHeader":"PDIwMDcwOTIyMjMwMy5sOE1OM2pTNjAzOTQ1MkBzaGVsbC5sbWkubmV0Pg=="},"prevInTopic":30798,"nextInTopic":30800,"prevInTime":30798,"nextInTime":30800,"topicId":30769,"numMessagesInTopic":0,"msgSnippet":"... I love that book!  I think my favorite is, A rug is so dogs have napkins. ... Have you seen the film, The Fisher King ?  I don t think I d recommend it","messageBody":"<div id=\"ygrps-yiv-439807592\">On Sep 22, 2007, at 4:04 PM, Pam Tellew wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Well, Ruth Kraus wrote &quot;A Hole is to Dig,&quot;  which I had as a young<br/>\n&gt; kid and loved. (&quot;Mud is to jump in and slide in and yell<br/>\n&gt; doodleedoodleedoo&quot;  &quot;&quot;Oo!  A rock is when you trip on it you should<br/>\n&gt; have watched where you ar going&quot;  &quot;A floor is so you don&#39;t fall in<br/>\n&gt; the hole your house is in.&quot;)  Maurice Sendak illustrated it.   I<br/>\n&gt; mentioned this to Nicky  but didn&#39;t go looking for the book.<br/>\n<br/>\n </span></blockquote>I love that book!  I think my favorite is, &quot;A rug is so dogs have <br/>\nnapkins.&quot;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; But then I read the afterward to Magic Beach and learned that<br/>\n&gt; Crockett Johnson played with the legend of the fisher king in Magic<br/>\n&gt; Beach.  I wasn&#39;t sure I knew the legend so I googled it and wound up<br/>\n&gt; on Wikipedia.  I love Wikipedia cause I always wind up far afield of<br/>\n&gt; where I start.  I learned that the fisher king story is part of the<br/>\n&gt; King Arthur legends (and probably Celtic myths as well).<br/>\n<br/>\n </span></blockquote>Have you seen the film, &quot;The Fisher King&quot;?  I don&#39;t think I&#39;d recommend <br/>\nit for an 8 y.o., but it&#39;s really good.  And, being on the connections <br/>\nthread, it&#39;s directed by Monty Python&#39;s Terry Gilliam  ;-)<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.imdb.com/title/tt0101889/\">http://www.imdb.com/title/tt0101889/</a><br/>\n<br/>\nNancy</div>","specialLinks":[]},{"userId":116488337,"authorName":"Gold Standard","from":"&quot;Gold Standard&quot; &lt;jacki@...&gt;","profile":"jackiknouse","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] Re: Connections (triggered by &quot;Learning Expansively&quot;)","postDate":"1190516459","msgId":30798,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFBLRUhKR0NJR05QUEFCRlBCS0xHT0VMT0xBQUIuamFja2lAYm9hcmRwcmVwLm5ldD4=","inReplyToHeader":"PDIwMDcwOTIyMjMwMy5sOE1OM2pTNjAzOTQ1MkBzaGVsbC5sbWkubmV0Pg=="},"prevInTopic":30796,"nextInTopic":30799,"prevInTime":30797,"nextInTime":30799,"topicId":30769,"numMessagesInTopic":0,"msgSnippet":"Hannah (15) and I started watching Trading Spaces a couple years ago together...a whole lot. We loved that show. We don t so much anymore, but this is what","messageBody":"<div id=\"ygrps-yiv-209483739\">Hannah (15) and I started watching Trading Spaces a couple years ago<br/>\ntogether...a whole lot. We loved that show.<br/>\n<br/>\nWe don&#39;t so much anymore, but this is what happened.<br/>\n<br/>\nOver time, we started to pick up little tips here and there about color,<br/>\ntexture, materials, planning, furniture, etc. from watching different<br/>\ndesigners and people redo room after room after room. There was so much<br/>\ndiversity and creativity every time...we picked something up from each show.<br/>\nNeither of us had any interior decorating experience. In fact, it&#39;s kind of<br/>\nhard for me to envision physical space...just don&#39;t know how to put<br/>\nsomething like a cool room together in my mind. I have to try things out and<br/>\nsee them to know if I like them. Anyway.<br/>\n<br/>\nAfter about 6 months, Hannah decided to do over her room. First, she<br/>\nculminated. Thought of different ideas, colors, angles, furniture. Then she<br/>\nwent online and found a website that let you try different color<br/>\ncombinations on walls, furniture and floor. At first she wanted to do big<br/>\nsquares of alternating bright pink and black. When we started to pencil out<br/>\nthe squares, she decided it was too much work (because after the penciling<br/>\ncomes the taping, then the painting of one color, then after drying the<br/>\nre-taping, then the painting of another color) and so she chose a two-tone<br/>\nwall look using green and rust colors. It was pretty sophisticated and had a<br/>\ndramatic look when we were done. All of her siblings at one time or another<br/>\nwere in her room painting or taping, never asked, just automatically came in<br/>\nto help. It was exciting.<br/>\n<br/>\nThen we had a room change. For numerous reasons Andrew (18) moved into that<br/>\nroom, and Hannah was going to move into another room. By this time, she<br/>\nwasn&#39;t so keen on the former design and decided to go with another idea. My<br/>\nmom offered to pay for Hannah to put a new floor in that room. So Hannah<br/>\nchose two tones of blue, one for walls and one for borders and baseboards<br/>\nand outlets and doors, then purchased a white quilt for her bed with a whole<br/>\nslew of different sizes and shapes of purple pillows for her bed. She put in<br/>\na wood floor (well, those snap-in wood-like floors) and viola! She has a<br/>\nroom of her dreams. She even found a brass leaf filled chandelier at at<br/>\nLowe&#39;s for 75% off. She used some of her money to pay for things and we<br/>\ncontributed. We love yard sales and Goodwill, and were able to get some<br/>\ngreat things for little money.<br/>\n<br/>\nHannah did a ton of measuring, color research, discussion with professionals<br/>\n(mostly at Lowe&#39;s), not to mention the down and dirty work of getting it all<br/>\ndone. We did have the floor installed but other than that, she just worked<br/>\naway at it, and again, people came in to help.<br/>\n<br/>\nOnce her room was done, everyone started hanging out in there. It was a<br/>\nbeautiful, crisp room with cool and calming blues and purples. It just felt<br/>\ngood to be in there. Cameron (13) decided he wanted to redo his room. Only<br/>\nhis idea was quite different. He wanted everything taken out of his room,<br/>\nthe walls painted bright green and grass put in for flooring. We hit a dead<br/>\nend with real grass (though we certainly researched what it would take [sun<br/>\nlamps, drainage for water, etc]) and that steered us toward artificial<br/>\ngrass, which sparked a whole lot of research. We learned about 90 count<br/>\nversus 60 count, the types of materials used, and how to get the softest<br/>\nfeel and the longest grass. Soon, Cam had a green-walled room with lush soft<br/>\ngrass for flooring. He wanted nothing put back in the room. So his room is<br/>\nempty except for many big pillows, a two person soft big bean bag (foam)<br/>\nchair, and his mattress on the floor. Everything else that was in his room<br/>\nis in our front room, waiting for a yard sale.<br/>\n<br/>\nNow everyone hangs out in Cameron&#39;s Zen-like room. Max&#39;s (17) jazz/funk/rock<br/>\nband often goes in there to rehearse or hang out. Cam loves that. He loves<br/>\nthat people like to come hang out in this creation he made from his vision.<br/>\n<br/>\nSo connections upon connections upon connections. Life is just such a joy.<br/>\n<br/>\nJacki<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":293639925,"authorName":"Pam Tellew","from":"Pam Tellew &lt;pamtellew@...&gt;","profile":"warblwarbl2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Connections (triggered by &quot;Learning Expansively&quot;)","postDate":"1190502249","msgId":30796,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDcwOTIyMjMwMy5sOE1OM2pTNjAzOTQ1MkBzaGVsbC5sbWkubmV0Pg=="},"prevInTopic":30781,"nextInTopic":30798,"prevInTime":30795,"nextInTime":30797,"topicId":30769,"numMessagesInTopic":0,"msgSnippet":"Wow...I sat down to write about a cool series of connections we had this evening and I find this thread...so there s a connection! Nicky (my 8 yo) and I were","messageBody":"<div id=\"ygrps-yiv-570790696\">Wow...I sat down to write about a cool series of connections we had <br/>\nthis evening and I find this thread...so there&#39;s a connection!<br/>\n<br/>\nNicky (my 8 yo) and I were reading through a rather randomly chosen <br/>\nstack of library picture books.  We were enchanted (entranced, <br/>\nmesmerized!) by &quot;Magic Beach,&quot; which I&#39;d picked up because it&#39;s by <br/>\nCrockett Johnson of Harold and the Purple Crayon fame.  When we <br/>\nfinished Magic Beach (earlier published as Castles in the Sand), <br/>\nNicky started playing his DS, so I read the forward to Magic Beach, <br/>\nwhich was by Maurice Sendak and he wrote about how he practically <br/>\nlived with Crockett Johnson and his wife, Ruth Krauss and what a big <br/>\ninfluence the couple had been on him.  (You can really see it when <br/>\nyou look at their books with that in mind.)<br/>\n<br/>\nWell, Ruth Kraus wrote &quot;A Hole is to Dig,&quot;  which I had as a young <br/>\nkid and loved. (&quot;Mud is to jump in and slide in and yell <br/>\ndoodleedoodleedoo&quot;  &quot;&quot;Oo!  A rock is when you trip on it you should <br/>\nhave watched where you ar going&quot;  &quot;A floor is so you don&#39;t fall in <br/>\nthe hole your house is in.&quot;)  Maurice Sendak illustrated it.   I <br/>\nmentioned this to Nicky  but didn&#39;t go looking for the book.<br/>\n<br/>\nBut then I read the afterward to Magic Beach and learned that <br/>\nCrockett Johnson played with the legend of the fisher king in Magic <br/>\nBeach.  I wasn&#39;t sure I knew the legend so I googled it and wound up <br/>\non Wikipedia.  I love Wikipedia cause I always wind up far afield of <br/>\nwhere I start.  I learned that the fisher king story is part of the <br/>\nKing Arthur legends (and probably Celtic myths as well).  Nicky and i <br/>\nhad recently been reading some of those and researching them a little <br/>\nbecause we&#39;d been wondering how much of Monty Python and the Holy <br/>\nGrail was Monty Python and how much was from the original Arthurian <br/>\nlegends.  So I told Nicky about where the fisher king came from.<br/>\n<br/>\nI was thinking about adding the Crocket Johnson book to the Wikipedia <br/>\nlist of modern versions of the fisher king and I googled Crockett <br/>\nJohnson and discovered that he had  done a comic strip called <br/>\nBarnaby, which was popular during WWII.  When Eric, my husband came <br/>\nhome, I told him all this because I had a feeling...well, turns out <br/>\nEric&#39;s dad was a big Barnaby fan, had all the books, and Eric read <br/>\nthem as a kid and still remembers some.  So we&#39;re gonna check those <br/>\nout (which might go well with watching the Ken Burns WWII documentary <br/>\ncoming up).<br/>\n<br/>\nI also learned when reading about the fisher king that the wasteland <br/>\nthat the fisher king&#39;s kingdom had become was the basis of the name <br/>\nand some of the themes in the T.S. Elliot poem.  I mentioned that to <br/>\nNicky and my husband and Nicky wanted me to read it to him.  I was <br/>\nnot up for that at 11:30 last night and was doubtful it would appeal <br/>\nso I discouraged that but I think I will pull it out and read a <br/>\nlittle to him if he still wants to.  (I remember struggling with that <br/>\npoem in college...yikes...better be careful not to pass on poetry-phobia!)<br/>\n<br/>\nThen Nicky wanted to read Harold and the Purple Crayon, so I went to <br/>\npull that out....and what was next to it on the shelf?  Ruth Krauss&#39; <br/>\nA Hole is to Dig, which I&#39;d never shared with my kids!  So I did and <br/>\nthat was all very fun.  But then I got up to get ready for bed and I <br/>\nwas going to put the library books back on the shelf and noticed the <br/>\nfirst book we read, which was &quot;Bears&quot; which I hadn&#39;t noticed was <br/>\nby....Ruth Krauss and illustrated by Maurice Sendak!<br/>\n<br/>\nPam</div>","specialLinks":[]},{"userId":62434209,"authorName":"jenstarc4","from":"&quot;jenstarc4&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Connections (triggered by &quot;Learning Expansively&quot;)","postDate":"1190418943","msgId":30781,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZkMWxsdis1NGtrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQ2ZjQyOGUxLjIxZDc3MjBhLjE3MTUuNThjNkBteC5nb29nbGUuY29tPg=="},"prevInTopic":30777,"nextInTopic":30796,"prevInTime":30780,"nextInTime":30782,"topicId":30769,"numMessagesInTopic":0,"msgSnippet":"We ve had a lot of Sponge Bob connections lately.  We went to the beach last week and that just added to it. We ended up camping at a beach camp site for a","messageBody":"<div id=\"ygrps-yiv-1824879567\">We&#39;ve had a lot of Sponge Bob connections lately.  We went to the <br/>\nbeach last week and that just added to it.<br/>\n<br/>\nWe ended up camping at a beach camp site for a couple of days, then <br/>\ncame home checked on the cats, then went back to the beach to visit a <br/>\nfriend from out of town that was staying at a beach cabin (well more <br/>\nlike big beautiful house that used to be a cabin).  We got there <br/>\nlater in the day and by the time we&#39;d eaten dinner and such, it was <br/>\ndark out.  The kids really wanted to go to the beach still so we went <br/>\nin the dark.<br/>\n<br/>\nI&#39;ve been to the beach hundreds of times, sometimes even at night and <br/>\nI&#39;ve never experienced what we experienced that night.  When we were <br/>\nwalking along the area where everything has washed up, it was <br/>\nsparkling like magic.  There were glitters lighting up in the sand <br/>\nevertime someone stepped or kicked up sand.  It was the coolest thing <br/>\nI&#39;ve ever encountered at the beach.  It turned out to be a type of <br/>\nplankton, typically associated with a red tide, however there wasn&#39;t <br/>\na red tide.  It is phospherescent and glows and glitters at night.<br/>\n<br/>\nThe girls were trying to see it with a flashlight and that just made <br/>\nit glow more when the lights were off.  They were experimenting with <br/>\nhow much you could see it doing various things with the sand like <br/>\ntossing the sand or stomping or dragging your feet.<br/>\n<br/>\nThat started the whole Sponge Bob stuff all over because of <br/>\nPlankton.  The next morning we had planned on getting up early to go <br/>\nsee the tide pools.  We didn&#39;t go see &quot;tide pools&quot; however, we went <br/>\nto go see Patrick, and maybe a Squidward if we were lucky or maybe a <br/>\nSponge Bob.  We saw lots of Patricks and Mr Krabs.  We weren&#39;t <br/>\nplanning on seeing Mr Krabs, but we did and that was cool, but we <br/>\ndidn&#39;t see his daughter, she&#39;d be pretty far out at sea.<br/>\n<br/>\nAll of the Sponge Bob stuff just added to more animal stuff, like the <br/>\nvicious raccoons at the camp ground and the random bear hide at the <br/>\nbeach house that was smiling, yet really freaked us all out, which <br/>\nled us to dog fights and dog behavior and how people contribute to it <br/>\nin odd ways.<br/>\n<br/>\nWe have been playing 20 questions lately as well, which always leads <br/>\nto the questions Person?, Place?, Or Thing?, then Animal?, <br/>\nVegetable?, Or Mineral?, which leads to wether you can call a Person <br/>\nan Animal and some of us say you can and some of us say you can&#39;t and <br/>\nit goes back to theoretical questions and such, which has on occasion <br/>\nrelated back to Sponge Bob.  (Margaux likes to ask if it&#39;s a piece of <br/>\ntoast, I have no idea, but she likes to ask that question in 20 <br/>\nquestions)</div>","specialLinks":[]},{"userId":90323324,"authorName":"Shannon Rizzo","from":"&quot;Shannon Rizzo&quot; &lt;shannon@...&gt;","profile":"shnunrizzo","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] Connections (triggered by &quot;Learning Expansively&quot;)","postDate":"1190406333","msgId":30777,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ2ZjQyOGUxLjIxZDc3MjBhLjE3MTUuNThjNkBteC5nb29nbGUuY29tPg==","inReplyToHeader":"PDY1MThhOTM2MDcwOTIxMTEzMGw2YjI3MDgzZGljYjkwYmRkNjU5YWU4ZGY5QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":30772,"nextInTopic":30781,"prevInTime":30776,"nextInTime":30778,"topicId":30769,"numMessagesInTopic":0,"msgSnippet":"On 9/21/07, Sandra Dodd ","messageBody":"<div id=\"ygrps-yiv-59083306\">On 9/21/07, Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a><br/>\n&lt;mailto:Sandra%40sandradodd.com&gt; &gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> \t&gt;<br/>\n\t&gt; I hope people here will share some of their takes of connections.<br/>\n\t&gt;<br/>\n<br/>\n </span></blockquote>My husband and I love to watch &quot;Good Eats&quot; with Alton Brown.  My husband is<br/>\na gourmet cook, and my oldest daughter loves to cook as well (she made<br/>\nFrench Toast for us this morning, my other daughter made waffles and bacon -<br/>\nwe had a feast!).  My oldest daughter, Heather, loves to snuggle with her<br/>\ndad and watch &quot;Good Eats.&quot;  It&#39;s a great connection for the two of them.<br/>\nHeather will often watch a Good Eats and run to make one of the dishes. My<br/>\nhusband will save some of the episodes to watch with her, and it has<br/>\nbranched off into much cooking between the two of them, with one or the<br/>\nother saving ideas to bring to the other to see if he/she wants to go<br/>\nexperiment.  The kids love to go online to Alton&#39;s site and look over his<br/>\nperiodic table of cooking equipment to pick out birthday/holiday gifts for<br/>\ntheir dad and grandpa.<br/>\n<br/>\nNow we have begun watching &quot;Feasting on Asphalt&quot; and my husband is saving<br/>\nthose episodes on Tivo to share with Heather.  We love road trips and can<br/>\neasily see ourselves taking on a Feasting on Asphalt road trip someday:  we<br/>\nlove exploring around the country and love adventure, and I am really<br/>\nexcited to connect with these restaurants Alton has highlighted (can&#39;t speak<br/>\nfor the rest of the family but they are usually excited about this too).<br/>\n<br/>\nShannon<br/>\n<br/>\nNo virus found in this outgoing message.<br/>\nChecked by AVG Free Edition. <br/>\nVersion: 7.5.487 / Virus Database: 269.13.22/1015 - Release Date: 9/18/2007<br/>\n11:53 AM</div>","specialLinks":[]},{"userId":288405080,"authorName":"diana jenner","from":"&quot;diana jenner&quot; &lt;hahamommy@...&gt;","profile":"dianajenner","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Connections (triggered by &quot;Learning Expansively&quot;)","postDate":"1190399433","msgId":30772,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY1MThhOTM2MDcwOTIxMTEzMGw2YjI3MDgzZGljYjkwYmRkNjU5YWU4ZGY5QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDE2OEI2RDc0LUJGRDItNEE5NS04RjUzLTZGMEIwNTEyQzEwOUBzYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDE2OEI2RDc0LUJGRDItNEE5NS04RjUzLTZGMEIwNTEyQzEwOUBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":30769,"nextInTopic":30777,"prevInTime":30771,"nextInTime":30773,"topicId":30769,"numMessagesInTopic":0,"msgSnippet":"... Football has been a big connector lately. Hayden loves claw machines and on our trip won (bought) a KC Chiefs window hangie thingamabobber. He thought we","messageBody":"<div id=\"ygrps-yiv-1047598773\">On 9/21/07, Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;   I hope people here will share some of their takes of connections.<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>Football has been a big connector lately. Hayden loves claw machines and on<br/>\nour trip won (bought) a KC Chiefs window hangie thingamabobber. He thought<br/>\nwe should send it to the &quot;unschoolers who sing the Kansas City Song&quot; (Ken &<br/>\nAmy Briggs). When we were at Burger King the other day, the kids&#39; prizes are<br/>\nNFL related. He first found KC Chiefs and reiterated his connection to the<br/>\nteam, which led to a talk of the Briggs&#39; actually living in NY -- &quot;NY has<br/>\nTWO teams!!&quot; As he browsed the other teams, he happened upon Cleveland<br/>\nBrowns -- &quot;Oh! Now I get the joke on Family Guy!! Cleveland&#39;s last name is<br/>\nBrown, I thought it was because of his skin color, well it is! Both!&quot; I<br/>\ndidn&#39;t realize how many football jokes have been on that series, but Hayden<br/>\nknew of a few others and it is just now that they&#39;re connecting and<br/>\nbeginning to make sense.<br/>\n<br/>\nI never knew how multi-layered most movies and television shows are, until I<br/>\nlived the freedom of no censorship with my kids. I&#39;m excited to watch Shrek<br/>\nagain with Hayden... we&#39;ve not seen it in over a year and I know his sense<br/>\nof humor has drastically changed, he&#39;s more aware of innuendo, it will most<br/>\nlikely be a whole new movie for him. I will miss his *younger* perspective<br/>\nas much as I look forward to this *older* one.<br/>\n<br/>\nI remember the very first time I watched South Park with Hayden, who was<br/>\nabout 6 at the time. Boy was *I* uncomfortable!!! It was the episode, for<br/>\nthose who know, where the comet is coming, they&#39;re all gonna die and the two<br/>\ndads masturbate one another in the hot tub. I really had no idea how to deal<br/>\nwith this explanation that surely my kid will demand of me... it never came.<br/>\nHe didn&#39;t understand the term, moved on to what he *did* understand (a<br/>\ndifferent tangent of the story, a different layer), found it funny and then<br/>\ndidn&#39;t watch the show again for a couple of years. He watches it now and<br/>\nthough it&#39;s a different understanding than he had at 6, he&#39;s 9 now, he&#39;s not<br/>\nwatching it through the same filters as I am.<br/>\n[not to mention we&#39;ve had many many talks about the guys who make South Park<br/>\nand their terrible public school experiences (which has tangent-ed into<br/>\nBowling for Columbine) and the controversy over the Tom Cruise in the Closet<br/>\nepisode and standing up for your principles (they threatened to pull the<br/>\nwhole show if the episode was not re-aired - South Park vs Comedy Central vs<br/>\nScientologists) which leads back to Family Guy and when they were going to<br/>\nbe canceled and they changed Stewie&#39;s words from &quot;laugh and cry&quot; to &quot;efffin<br/>\ncry&quot; (check it out with closed captioning!) and the connections go on and on<br/>\nand on]<br/>\n-- <br/>\n~diana :)<br/>\nxoxoxoxo<br/>\nhannahbearski.blogspot.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Connections (triggered by &quot;Learning Expansively&quot;)","postDate":"1190396004","msgId":30769,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE2OEI2RDc0LUJGRDItNEE5NS04RjUzLTZGMEIwNTEyQzEwOUBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":30772,"prevInTime":30768,"nextInTime":30770,"topicId":30769,"numMessagesInTopic":0,"msgSnippet":"I hope people here will share some of their takes of connections. Here s mine from this morning. A couple of days ago, I bought a DVD, LIttle Britain Live.","messageBody":"<div id=\"ygrps-yiv-47873464\">I hope people here will share some of their takes of connections.<br/>\n<br/>\nHere&#39;s mine from this morning.<br/>\n<br/>\nA couple of days ago, I bought a DVD, LIttle Britain Live.  Holly and  <br/>\nI went into a video store to see if High School Musical II was out.   <br/>\nDecember 11, they said.  Holly got interested in that because of Zac  <br/>\nEfron, who was in Hairspray, which she&#39;s seen three times, I think.   <br/>\nSo that&#39;s running backwards through the connections, but I want to  <br/>\nrun forward.<br/>\n<br/>\nThis morning I was watching Little Britain, videotaped from a stage  <br/>\nshow (I&#39;ve seen most of the TV episodes through season 3).  One skit  <br/>\nwas the travel agency, the &quot;Computer says &#39;no&#39;&quot; character.  A mom  <br/>\nwanted to take her ill daughter to DisneyWorld.  Her choices were a  <br/>\nflight leaving in ten minutes, or a flight to Zimbabwe from which  <br/>\nthey would have to get to DisneyWorld on foot.  No, the mom thought.   <br/>\nSo he offered her a flight to Preston.<br/>\n<br/>\nI don&#39;t guess I&#39;ve ever heard of Preston. The audience reaction and  <br/>\nthe comedian&#39;s comeback made me curious.  I was watching it on one  <br/>\nside of my computer screen while I did e-mail on the other  <br/>\n(frequently paused because I also was cleaning the kitchen, eating  <br/>\nbreakfast, feeding the birds, making my bed, in various bursts of up  <br/>\nand down from the computer).<br/>\n<br/>\nThere were maps and official city sites, but I decided to go with  <br/>\nWikipedia, because I know nothing for starters.<br/>\nPreston was made the 50th city in England, in the 50th year of the  <br/>\nreign of Elizabeth II.  (Just a few years ago.)  The history of  <br/>\nPreston, though, as a crossroads and this and that, goes back over  <br/>\n1000 years.<br/>\n<br/>\nI sent the article to my friend Jeff, for the 50th year/50th city  <br/>\npart, because he&#39;s really interested in things like that.<br/>\n<br/>\nI clicked on &quot;Riot Act&quot; because there was a cotton workers&#39; protest  <br/>\nincident in the 19th century, and read what Wikipedia had to say  <br/>\nabout The Riot Act (very, very cool, and all news to me).   I sent  <br/>\nthat link and a comment to my friend Jon who is the local assistant  <br/>\ndistrict attorney in charge of violent crimes.  He&#39;s interested in  <br/>\nhistory too, and he and Jeff and I have all been in the SCA together  <br/>\nfor a long time.  Jon was formally one of my proteges (for those of  <br/>\nyou who understand that lingo, and he&#39;s now a Master of the Pelican,  <br/>\nbut...)<br/>\n<br/>\nJon sent this:<br/>\n<br/>\n=========================<br/>\nAh - reading someone the riot act.  Very interesting.<br/>\n<br/>\nI thought it was going to say that this was why we have, as part of  <br/>\nthe First Amendment, the right of freedom of assembly, but apparently  <br/>\nnot. :)<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 9/21/07, Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; wrote:<br/>\nI was watching Little Britain Live (a DVD I just got) and they<br/>\nmentioned Preston, and I looked it up, and it talked about an<br/>\ninstance of The Riot Act so I looked THAT up and this is really<br/>\ninteresting:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://en.wikipedia.org/wiki/Riot_Act\">http://en.wikipedia.org/wiki/Riot_Act</a><br/>\n============================<br/>\nand<br/>\n============================<br/>\n<br/>\nThat is interesting.  No last rites or whatever Anglicans do that&#39;s  <br/>\nessentially the same. :)<br/>\n<br/>\nOn 9/21/07, Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; wrote:<br/>\nI meant to say, the thing that interested me the most was &quot;punishable  <br/>\nby death without benefit of clergy.&quot;  I didn&#39;t know there was ever  <br/>\nany such sentence.<br/>\n<br/>\n===============================<br/>\n<br/>\nI don&#39;t know whether all those reading this will have known already  <br/>\nthat &quot;The Anglican church&quot; is what Americans tend to call The Church  <br/>\nof England, and those who are members of what would have been The  <br/>\nChurch of England are Episcopalians.<br/>\n<br/>\nAll that has  happened before Marty and Holly ever woke up.  I might  <br/>\nshare some of it with them, or might not.  It might not be today.   <br/>\nThey have those kinds of connections going on in their own lives  <br/>\nwithout me, though.  Sometimes they share them.  Sometimes it&#39;s the  <br/>\nsame day, or sometimes it&#39;s when something I say or see or do reminds  <br/>\nthem and they hook me up with the puzzle piece they already have, and  <br/>\nwe go on to build bigger universes in our heads.<br/>\n<br/>\nSandra<br/>\n<br/>\nP.S.<br/>\nFor those who might be curious about these two people I sent my  <br/>\nexciting LIttle-Britain-inspired finds to,<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/duckford/balthazar\">http://sandradodd.com/duckford/balthazar</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/tw/bio/balthazar\">http://sandradodd.com/tw/bio/balthazar</a><br/>\nand a photo of his shield was on The Lyrics Game one day  http:// <br/>\nlyricsgame.blogspot.com/2007/07/house.html<br/>\n<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/artan/\">http://sandradodd.com/artan/</a><br/>\nJeff is mentioned in the article &quot;What Marty Really Needed,&quot; which is  <br/>\nin Moving a Puddle and here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/martymap\">http://sandradodd.com/martymap</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]}],"prevTopicId":30755,"nextTopicId":30803}}