{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"naturalmom@email.com","from":"naturalmom@...","replyTo":"LIST","senderId":"hhdYTl2EVxREVUgnpzOJzdCffyp540V3kZ4r4EYciYsxr88NS1vZMUK1yEAyZZG8Jpq-6JlxOLGUrEI","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Telltale Mommy Signs","postDate":"978236658","msgId":14820,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkybWNkaitmN3J1QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":14819,"nextInTime":14821,"topicId":14820,"numMessagesInTopic":0,"msgSnippet":"Mothers: A Field Guide By Mary Akers Guyton I have often wondered, during those rare times that I manage to go out in public without my children, if I bear","messageBody":"<div id=\"ygrps-yiv-1917657578\">Mothers: A Field Guide<br/>\nBy Mary Akers Guyton<br/>\n<br/>\nI have often wondered, during those rare times that I<br/>\nmanage to go out in public without my children, if I bear some<br/>\ndistinguishing mark that identifies me as a mother. Surely I must <br/>\nexhibit certain characteristics unique to mothers of all ages and <br/>\nincome levels. <br/>\n<br/>\nAs a bird watcher looks for an unusual crest or listens carefully for <br/>\na specific songbird&#39;s call, could not a mother watcher locate a woman <br/>\nwith children, even when she did not have her children with her? <br/>\nCarrying this one step further, I began to develop a theory that not <br/>\nonly could one recognize a mother, but like the bird watcher, could <br/>\nidentify the various stages of motherhood development through careful <br/>\nobservation. On this premise, I have created a field guide to Mothers <br/>\nof North America.<br/>\n<br/>\nA hatchling mother (birth to six months) will exhibit<br/>\nunique characteristics. She may, while standing in line at<br/>\nthe grocery store, gently bounce a 25-pound sack of potatoes on her <br/>\nhip, to keep it entertained. She may, upon hearing someone else&#39;s baby<br/>\ncry, quickly cross her arms over her chest to stop the involuntary<br/>\nmilk let-down reflex. She is likely to have mastered the ability to<br/>\npick up objects with her feet, without interrupting the ritual baby<br/>\ndance, perfected in the first six months of motherhood. She will,<br/>\nundoubtedly, exhibit the universal signs of new motherhood: dark half <br/>\nmoons under the eyes, and a spit-up stain down the back of her left <br/>\nshoulder.<br/>\n<br/>\nAn examination of her purse contents will reveal baby<br/>\nAnbesol, Tylenol, elixir with the eye-dropper top; the pediatrician&#39;s<br/>\noffice, beeper, and home phone numbers; a two-week-old list of things <br/>\nto do (still undone); a few birth announcements that have not yet <br/>\nbeen addressed; and a large bottle of extra-strength Tylenol.<br/>\n<br/>\nA nestling mother (6 to 12 months) can be picked out<br/>\nof a crowd by looking for a woman who double ties her shoes, smells<br/>\nfaintly of diaper wipes and apple juice, and has one arm much stronger<br/>\nthan the other. She will jump to catch any falling object seen out of <br/>\nthe corner of her eye, and will have it in her hand before she is <br/>\naware of having reached for it.<br/>\n<br/>\nAn examination of her purse contents will reveal a set<br/>\nof brightly colored plastic keys, a slightly crushed package of<br/>\ncrackers from the salad bar two weeks ago, the contents of her wallet<br/>\nstrewn all over the inside, a bent pair of sunglasses, and a large <br/>\nbottle of extra-strength Tylenol.<br/>\n<br/>\nA fledgling mother (12 to 24 months) will exhibit a singular <br/>\nvocabulary, rich in two syllable words. A seemingly intelligent<br/>\nwoman will suddenly want to use the potty or show you a boo-boo. She <br/>\nwill be the one looking around anxiously when someone else&#39;s child <br/>\ncalls, &quot;Mommy!&quot; The truly devoted will answer, &quot;Right here!&quot; before<br/>\nembarrassment can win out over instinct. At the end of each day, she <br/>\nfalls exhausted into bed and goes night-night.<br/>\n<br/>\nIn her purse is a crayon fragment, a half-chewed bite<br/>\nof the grocery store&#39;s daily free sample wrapped in a napkin, one<br/>\nplastic block, and a large bottle of extra-strength Tylenol.<br/>\n<br/>\nA juvenile mother (two to five years) can also be<br/>\neasily recognized.  Some tell-tale signs are a cartoon-character <br/>\nbandage on her finger, a ketchup-colored handprint streaked across <br/>\nher sleeve, and legs that haven&#39;t seen a razor lately. She will be <br/>\nthe one with the grateful, silly smile on her lips when the stranger <br/>\nbeside her has a two-year-old clinging desperately to one leg<br/>\nscreaming, &quot;I want it!&quot;<br/>\n<br/>\nWhen driving down the highway, you can recognize her as the one who<br/>\nappears to be talking loudly to herself. Closer inspection will often<br/>\nreveal one or more full car seats in the back. She&#39;s probably singing<br/>\n&quot;The Wheels on the Bus&quot; with gusto.<br/>\n<br/>\nHer purse contains Band-Aids; Neosporin; a straw; a Barbie shoe or <br/>\nHot Wheels car (or both); an emergency package of candy; a<br/>\ncheckbook covered with artistic renderings of cats, flowers, and suns;<br/>\nand a large bottle of extra-strength Tylenol.<br/>\n<br/>\nYou will recognize the mature mother (6 to 12 years) as the one who<br/>\ncrosses to the opposite side of the mall and quickens her speed, when <br/>\na toy store is spotted. Her grocery store cart will contain three <br/>\npacks of family-sized hot dogs, a case of Spaghettios, and four<br/>\nboxes of cereal with three gallons of milk. Savvy in the appropriate<br/>\nvalue of a lost tooth when placed beneath the pillow, she is also the<br/>\none who will be able to help when a stranger asks, &quot;Does anyone have a<br/>\ntissue?&quot; This mother only appears to be by herself. Look closely:<br/>\nher child is probably 10 steps behind her, trailing in anguished<br/>\nembarrassment, trying desperately to appear alone.<br/>\n<br/>\nAn examination of her purse contents will reveal a permission slip <br/>\n(due yesterday), a piece of sea grass from the weekend at the beach, <br/>\na wilted flower, a Gameboy cartridge, and a large bottle of extra-<br/>\nstrength Tylenol.<br/>\n<br/>\nIn using your field guide, it is important to remember<br/>\nthat a mother can only be spotted during special seasons of her life,<br/>\nand once mature, she will gradually blend back into society. Her <br/>\nmigratory routes through Toys-R-Us and K-Mart will cease, and the <br/>\nbasic functions of speech and concentration will slowly return.<br/>\n<br/>\nThe final challenge she faces is the difficult and emotional task of<br/>\nconvincing her brood to leave the nest. Depending upon the migratory<br/>\nhabits of her offspring, this may take anywhere from 18 to 36 years.<br/>\n<br/>\nKandy<br/>\n<br/>\nDO YOU own an on-line business YET?  Here&#39;s how:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.myfreeoffice.com/kandyc\">http://www.myfreeoffice.com/kandyc</a><br/>\n<br/>\nUNLIMITED long-distance $69.95/month!<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.cditelecom.com/261301\">http://www.cditelecom.com/261301</a></div>","specialLinks":[]}],"prevTopicId":14811,"nextTopicId":14822}}