{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":0,"authorName":"kalima","from":"kalima &lt;kalima@...&gt;","replyTo":"LIST","senderId":"pSzAel_OkllQi9b2aJwD6mK-5obdTgHjdMAdQ-nTwAJyhjnEMUZndVVCJIMZzIBb9FGKwYQQsV55EsETlCcBtYLR-2w","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: OT -- while we are at it","postDate":"980951015","msgId":15588,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNBNzgxRkU2LjE5MzNFMTVAb3B0b25saW5lLm5ldD4=","referencesHeader":"PDk4MDkyNjU3MS4yMzMuNjczODEubDEwQHlhaG9vZ3JvdXBzLmNvbT4="},"prevInTopic":15550,"nextInTopic":0,"prevInTime":15587,"nextInTime":15589,"topicId":15550,"numMessagesInTopic":0,"msgSnippet":"I wanted to ask if it would be ok for me to pass this information along to another list that might be interested.  I also recieved some information I would","messageBody":"<div id=\"ygrps-yiv-271076136\">I wanted to ask if it would be ok for me to pass this information along to another list that might be interested.  I also recieved some information I would like to pass along since this is an issue that is very dear to my heart and those of my kids.<br/>\n<br/>\nIn Amma&#39;s Divine Love,<br/>\nShelly<br/>\nMom to 5<br/>\nConnecticut<br/>\n<br/>\nNamaskar,<br/>\n<br/>\nWe had planned our newsletter on Kumbha Mela, but the Republic Day<br/>\nearthquake news has been devastating.<br/>\n<br/>\nHindu scriptures proclain, &quot;Seva Paramo Dharma&quot;, meaning, Seva (selfless service) is the highest<br/>\nform of worship.  We have therefore setup an online donation facility on our site :<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.noblecauses.org\">http://www.noblecauses.org</a><br/>\n<br/>\nwhere you can go and click on Donate Now button.  Or, you can simply<br/>\nclick on the link below :<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"https://secure.paypal.com/xclick/business=gensecy@...&item_name=Donate+for+Gujarat+Earthquake+Relief&return=http://www.noblecauses.org\">https://secure.paypal.com/xclick/business=gensecy@...&item_name=Donate+for+Gujarat+Earthquake+Relief&return=http://www.noblecauses.org</a><br/>\n<br/>\nThe payment system accepts direct bank transfer or credit card payments and uses<br/>\nhighly reputed and secure, Paypal system.<br/>\n<br/>\nThe donations are sent through World Hindu Council America (VHP-A), which is a registered<br/>\nnon-profit, tax-exempt organization in USA.  The funds will be sent to reputable, recognized, voluntary<br/>\norganizations.  Donations from around the world<br/>\n(excluding India) can be made using this link.<br/>\n<br/>\nFor those in India, please send the contributions to our highly recommended organization<br/>\nSeva Bharati by chaque/draft in favour of<br/>\n<br/>\nThe Secretary, SEWA BHARATI-GUJARAT at Dr. Hedgewar Bhavan Baliakaka Marg, Kankaria, Karnawati (Ahmedabad) 380028. Tel: 079-5326131 and 079-5326132.  Tax exemption under section 80 G is available.<br/>\n<br/>\nNo amount is too small - you can literally contributejust a dollar, and no amount is too big you can contribute thousands.<br/>\nPlease do all you can to help.</div>","specialLinks":[]},{"userId":0,"authorName":"David Albert","from":"David Albert &lt;shantinik@...&gt;","replyTo":"LIST","senderId":"9r7EXWxyEqSGP7RGCyPOR47peJp9otzqbglUEphyRaHKQga5LglIQHxtAtWCDYuQf5tIsfbf97HEohP-sKh5Xc28R0CIQHZD5mE-_jU","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] OT -- while we are at it","postDate":"980919606","msgId":15550,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNBNzdBNTM1LkVCNDI4QzEyQGVhcnRobGluay5uZXQ+","referencesHeader":"PDcyLjc2NzY3MWMuMjdhOGVmMTdAY3MuY29tPiA8MDBmNzAxYzA4YjQ1JGE2MjAxYWEwJDY2MDFhOGMwQHZkZW5uaXM+"},"prevInTopic":0,"nextInTopic":15588,"prevInTime":15549,"nextInTime":15551,"topicId":15550,"numMessagesInTopic":0,"msgSnippet":"Please forgive me for adding yet another O.T. issue to the list -- as I have now been called to work on relief matters related to the Indian earthquake. I","messageBody":"<div id=\"ygrps-yiv-756496867\">Please forgive me for adding yet another O.T. issue to the list -- as I have now<br/>\nbeen &quot;called&quot; to work on relief matters related to the Indian earthquake.<br/>\n<br/>\nI apologize in advance to anyone on this list who doesn&#39;t think this e-mail<br/>\nbelongs here.  My one excuse, other than urgency, is that funds from my book and my<br/>\nhomeschooling-related speaking engagements have funded housing and<br/>\ncommunitydevelopment-related projects in India, so this really is an extension of my<br/>\nhomeschooling life.  And, frankly, I can&#39;t personally see how responding to a<br/>\nnatural disaster is NOT an unschooling issue! But please use the delete key if you<br/>\nthink this is inappropriate.<br/>\n<br/>\nRyan & Erica Engle wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; David, How is your family in India? Have you heard from them. When I<br/>\n&gt; heard the news on the radio I&#39;ve been in constant prayer for the<br/>\n&gt; situation and for you and your family. Since no one else is asking I<br/>\n&gt; will. Erica Engle<br/>\n&gt;<br/>\n&gt;<br/>\n </span></blockquote>Dear Erica --<br/>\n<br/>\nI thank you very much for asking.  My &quot;family&quot; is in the far south,<br/>\nabout 1700 miles away, so they are fine.  However, I work with a bunch<br/>\nof Gandhian educators (I actually gave a homeschooling speech to an<br/>\nincipient homeschooling group there) who work with the poorest of the<br/>\npoor in jungly areas about 350 miles to the east of Bhuj, and the<br/>\ndevastation is grave indeed.<br/>\n<br/>\nLiterally minutes ago, I received the appeal below (through a Quaker<br/>\nf(F)riend of mine, just returned from there.) I know each of these<br/>\npeople personally, some for as long as 25 years.  Funds will not go<br/>\nthrough a big aid agency, I can assure you, but directly to the folks<br/>\nwho can really use it. If folks would like to contribute, I am<br/>\ncollecting funds. Tax deductible contributions can be made out to the<br/>\nGandhian Foundation, and sent to me, at:<br/>\n<br/>\nDavid Albert<br/>\n1717 18th Court NE<br/>\nOlympia, WA 98506<br/>\n<br/>\nWe currently don&#39;t have a system for collecting material goods, but I do have an<br/>\ninquiry in and report when I hear anything.<br/>\n<br/>\nPrayers can&#39;t hurt either!<br/>\n<br/>\nBless,<br/>\n<br/>\nDavid<br/>\n<br/>\nFriend David,<br/>\n        I am forwarding to you a copy of the email just received from<br/>\nthe<br/>\nfolks<br/>\nin Gujarat who are on the job .  If you agree with me that we have a<br/>\nreeeliable channel, then let&#39;s go ahead.  I will set up India Earthquake<br/>\n<br/>\nRelief Fund 2001 with you and Ellen as members of the &quot;committee&quot;.<br/>\nI will seek Gandhian Foundation Board  approval, providing a tax<br/>\ndeductable channel.  I will also check the bank number in Mulund.<br/>\n<br/>\n        To Mary Arnett:  The New Delhi Friends Working Group may want<br/>\nto  consider using this channel to extend help.  I know the people called, working<br/>\nin the spirit of Gandhi.  We can decide at our Feb. 14 meeting.<br/>\nGeorge W.<br/>\n<br/>\nFORWARDED --<br/>\n<br/>\nDear Friends,<br/>\nAs all of you probably know already there has been a severe earthquake<br/>\nin Gujarat on Friday, flattening huge parts of Kutch, Ahmedabad, and<br/>\nSaurashtra.  The impact of the quake, which measure 7.9 on the Richter<br/>\nscale is devastating and even worse that estimated as the death tool has<br/>\nreach 20,000 people and is continuing to shoot up while the rescue work<br/>\nis going on.   Over 100,000 people are supposed to be still under the<br/>\ndebris.<br/>\n<br/>\nAlready a lot of national as well as foreign volunteers have joined the<br/>\nlocal survivors in their relief efforts.  However, most rescue work is<br/>\ncentered in the big cities like Bhuj and Ahmedabad while the rural<br/>\npeople are still waiting for help.  Also, there are not enough doctors<br/>\nespecially orthopaedic surgeons present to cope the amount of injured<br/>\npeople.  That way, only the extremely serious cases are being dealt with<br/>\nup to this point.  Furthermore, the destroyed infrastructure and<br/>\ncommunication systems make it very difficult to reach the suffering<br/>\npeople struggling with a shortage of water and food, clothing and<br/>\nmedication.<br/>\n<br/>\nWe ask you to help.<br/>\nAny assistance in form of personal help,<br/>\n                               money donation or<br/>\n                                   sending needed material is welcome.<br/>\n<br/>\nWe are setting up a group of volunteers consisting of doctors as well as<br/>\npeople trained in first aid.  Also those who are physically capable of<br/>\nhelping with relief work are badly needed.  Dr. Roy, Dr. Anita Roy,<br/>\nSidhar, Michael, and Kanti have already left for Rapar, one of the<br/>\nthree worst affected areas,.  We have mobilized four other teams from<br/>\nMaharashtra, MP, and Gujarat so far, and others will be mobilized as<br/>\nwell, preparing to go there soon.  In Deesa, northeast Gujarat, there is<br/>\na hospital lacking helpers to cope with the number of injured persons.<br/>\n<br/>\nThe relief work will include:<br/>\n   &lt;&gt; removing rubble<br/>\n   &lt;&gt; rescuing survivors<br/>\n   &lt;&gt; dealing with inured<br/>\n   &lt;&gt; cremating the dead<br/>\n   &lt;&gt; collecting food, water, medicines, and other supplies<br/>\n   &lt;&gt; setting up relief camps<br/>\n<br/>\nAnybody who is physically and emotionally able to deal with these tasks<br/>\nplease contact us.  It needs to be stressed that the volunteers will be<br/>\nconfronted with situations that are not easy to bear so do only join if<br/>\nyou are confident about managing this.<br/>\n<br/>\nHowever those who would like to contribute financially would be of great<br/>\n<br/>\nhelp as the relief group does not only involve buying medication and<br/>\nother material but the team also needs to be self-sufficient due to the<br/>\nlack of water and food in the devastated areas.<br/>\n<br/>\nForeign contributions may be sent in the name of &quot;Bombay Sarvodaya<br/>\nFriendship Centre&quot;, State Bank of India, Mulund West Branch, code No. 011<br/>\n<br/>\n900, account No. 20702.<br/>\n<br/>\nIf you could donate warm clothing, sleeping bags, blankets, as well as<br/>\ndry food and needful things, like torches, we will transport and<br/>\ndistribute these to the needy.<br/>\n<br/>\nOur contact numbers: 02740-206 29   (Paula)<br/>\n                                   -222 53 (Manjusha)<br/>\n                                   -218 79  (Karan Sinh)<br/>\nSwati, Michael, Anand, Dr. Sridhar, Dr. Manjushi, Dr. N. Roy, Dr. Anita<br/>\nRoy, Dr. Ashok, Kanti, Daniel, Hansa.</div>","specialLinks":[]}],"prevTopicId":15423,"nextTopicId":15602}}