{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":16,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] this list - flow - some thoughts","postDate":"1308951323","msgId":61745,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFEQTJDODY3LTY4MkYtNEUzQy1CNjYxLTk2Njg5OEVFQUVCQUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDRFMDREQzUxLjUwMTAxMDVAZWFydGhsaW5rLm5ldD4=","referencesHeader":"PGl0dmgzays1dGxjQGVHcm91cHMuY29tPiA8OUQ4MjBBOUE5Q0M0NDZBNkJBQzM4MDA0QkU1NDEyQjZAZGVib3JhaDQzZjEzZmQ+IDw0RTA0REM1MS41MDEwMTA1QGVhcnRobGluay5uZXQ+"},"prevInTopic":61743,"nextInTopic":0,"prevInTime":61744,"nextInTime":61746,"topicId":61724,"numMessagesInTopic":0,"msgSnippet":"-=-It isn t that I don t care or it doesn t hurt to be maligned and badmouthed behind my back; I don t like it and I wish it wouldn t happen. But I guess I ve","messageBody":"<div id=\"ygrps-yiv-2094875372\">-=-It isn&#39;t that I don&#39;t care or it doesn&#39;t hurt <br/>\nto be maligned and badmouthed behind my back; I don&#39;t like it and I wish <br/>\nit wouldn&#39;t happen. But I guess I&#39;ve accepted that it isn&#39;t &quot;my&quot; problem <br/>\nso I don&#39;t give it much thought. When people tell me about it, I am sort <br/>\nof interested, but the interest is a little removed as if it isn&#39;t about <br/>\nme, but about other people&#39;s defensiveness or other people&#39;s fears or <br/>\njust their bad manners or maybe their wish to ingratiate themselves with <br/>\ncertain other people, etc. -=-<br/>\n<br/>\nYes.<br/>\n<br/>\nA month or so ago, while I was in Scotland, two different people contacted me through facebook to tell me that someone who has a sort of anti-unschooling facebook group had (one said) badmouthed Holly by name, and the other said Kirby had been named as a bad example.<br/>\n<br/>\nI was really busy, and though I asked one of the people to let me know where it was, she didn&#39;t.  What she had actually asked me to do was to look into it and report back to her whether it was true (or something to that effect), and I told her she was a member of the group, I wasn&#39;t, and maybe she could find it and send it to me.  <br/>\n<br/>\nI was slightly irritated, thinking that adults who wanted to impress other adults, or to build themselves up as some sort of knowledgeable commentators, would use my children by name as bad examples.  But a few months before, when I had been indignant that ignorami were insulting Holly in comments on YouTube (under a video that Lee Stranahan had posted of part of an interview with her), Kirby just laughed and said I shouldn&#39;t ever take those comments seriously and I probably shouldn&#39;t even read them.<br/>\n<br/>\nHe&#39;s right.<br/>\n<br/>\nIf someone says something bad about Holly, it doesn&#39;t make her a bad person.  It makes the writer a horrible person, and has no effect on Holly whatsoever.<br/>\n<br/>\nPam&#39;s on the board of directors of a homeschooling organization.  She will get a new, thicker layer of nonsense stated about her because when someone tells a story about someone whose name is better known than their own, they (and those they&#39;re talking to) often feel closer to being &quot;in the know,&quot; and many people feel that if they criticize another person, it means they know all that the other person knows and could do better at whatever it is they do (advisement, acting, directing a movie, driving a truck, running a war, reading the news...).    <br/>\n<br/>\nI know those people exist in droves.  It&#39;s interesting to be a person with a name known well enough to be used as chit, points, or mana in a social or political situation. When they use my kids, that&#39;s extra vile, but I still understand it.<br/>\n<br/>\nThen there are the good parts.  There are transcendent experiences and evidence of having changed the world (small parts of it at least, and we never can know how far a ripple will travel through social waters into the future.<br/>\n<br/>\nThe same day I got the rude note I posted here, I also received this, from someone who had driven five hours to hear me:<br/>\n<br/>\n-----------<br/>\nSorry I&#39;m not that quick but I guess the gathering in Baud made me feel like spending less time on the Internet :)<br/>\n<br/>\nPlus, we&#39;ve been playing Plants vs Zombies a lot these past few days. You talked about this game on Always Learning and it made me curious. Waouh, we just love it. [Two children, by name] cuddle in bed or on the couch, taking turns on the ipod and helping each other.  Another great idea found on your list /website that I can add to my long list :)<br/>\n<br/>\nI also wanted to say a big thank you for these wonderful days in Baud. I was so happy to meet you in person at last. And you are exactly like I imagined. It&#39;s hard to describe a person but  the same words that can be used to describe unschooling come to my mind when thinking of you: generosity, fun, respect, authenticity, trust and peace. <br/>\nI felt really lucky to share all these moments with you. <br/>\n<br/>\nI remember when you were so tired and Helene was concerned and asked if you wanted to go and take a rest. You said that some people had driven many hours to come, and you wanted to be there for them (that was not your exact words but you know). It shows how sweet and generous a person you are.<br/>\n<br/>\nI really hope to see you again soon in the US and maybe be lucky enough to meet your family too.--<br/>\n=========<br/>\n<br/>\nSome of the eight families who came to that gathering (in addition to the Waynforths and our host family) had driven just 40 minutes or an hour, but two families came from near and in Geneva--over 15 hours in the car (two cars).  The very idea that people would do that was energizing for me, and I really wanted to reciprocate.  <br/>\n<br/>\nThere are some photos of that three-day event here:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandraeurope2011.blogspot.com/2011/06/tired-tired-but-happy.html\">http://sandraeurope2011.blogspot.com/2011/06/tired-tired-but-happy.html</a><br/>\n<br/>\nSometimes I see what I&#39;m doing as not a big deal, just a little hobby, and sometimes I see it from a different angle altogether.   I&#39;m glad Keith is willing to help me and support me in my peace-spreading activities.  I&#39;m glad Holly and Marty are willing to help out at the house so much when I&#39;m gone.  I&#39;m glad I got to spend a week and some with Schuyler, that I&#39;m getting lots of time with Julie Daniel&#39;s family, and that I&#39;ll see Pam Sorooshian for a day or two in late July.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"this list - flow - some thoughts","postDate":"1308941393","msgId":61743,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRFMDREQzUxLjUwMTAxMDVAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PDlEODIwQTlBOUNDNDQ2QTZCQUMzODAwNEJFNTQxMkI2QGRlYm9yYWg0M2YxM2ZkPg==","referencesHeader":"PGl0dmgzays1dGxjQGVHcm91cHMuY29tPiA8OUQ4MjBBOUE5Q0M0NDZBNkJBQzM4MDA0QkU1NDEyQjZAZGVib3JhaDQzZjEzZmQ+"},"prevInTopic":61738,"nextInTopic":61745,"prevInTime":61742,"nextInTime":61744,"topicId":61724,"numMessagesInTopic":0,"msgSnippet":"I gave an unschooling talk at a local unschooling group park day this week. It was extremely gratifying that a LOT of people turned out - so much interest!!","messageBody":"<div id=\"ygrps-yiv-1190066548\">I gave an unschooling talk at a local unschooling group park day this <br/>\nweek. It was extremely gratifying that a LOT of people turned out - so <br/>\nmuch interest!! And it was a tremendously satisfying and enormously <br/>\npleasurable thing to do - the feeling of these kinds of events - <br/>\nincluding conferences - thrills me and does something to heal me in some <br/>\nway, inside, where I don&#39;t even know i need healing. I come away every <br/>\ntime with some extra inner peace. Part of is feeling good that I might <br/>\nhave made some contribution to some kids living more peaceful and <br/>\nhappier lives! A big part is being on the receiving end of a lot of <br/>\ngratitude. But it is also some kind of &quot;rub-off&quot; feeling from being part <br/>\nof a group of people who are all spending time focusing together on <br/>\nbeing better parents/better people. When it works, when it feels like <br/>\nthat, it is amazing. The older and more experienced I become, the better <br/>\nI am at helping create that kind of feeling in a group, too. So I&#39;m <br/>\nenjoying it more and more often.<br/>\n<br/>\nI used to play cello in the orchestra and I lived for the sublime <br/>\nmoments - peak experiences that were indescribable - when I felt like a <br/>\nsmall, but absolutely essential, part of the whole wonderful music <br/>\ncreation process. These are the moments of &quot;flow&quot; or &quot;optimal <br/>\nexperience&quot; written about by Mihaly Csikszentmihalyi.  Well, I have <br/>\nthose moments, sometimes, at conferences when I&#39;m speaking and, <br/>\noccasionally, when someone else is speaking, and I had them at the park <br/>\nthe other day. And they can happen here, on this list, too, even though <br/>\nI&#39;m sitting alone in my living room or, sometimes, at a table in a <br/>\ncrowded Starbucks.<br/>\n<br/>\nI know some people get these kinds of flow or peak experiences on their <br/>\nown - painting or sculpting or maybe even housecleaning or cooking. I <br/>\nhave only ever felt it when part of a group working on something together.<br/>\n<br/>\nThere is, however, a vulnerability of being part of a group that <br/>\ncontributes to my experience. People will say to me, &quot;Thank you for <br/>\nbeing so honest.&quot; I think of it as being trusting - trusting other <br/>\npeople to carry away some of my own thoughts and experiences and do <br/>\nsomething good with them.  And it doesn&#39;t always work and there is real <br/>\nrisk. I get word through the grapevine, occasionally, of people talking <br/>\nabout me in negative ways. It isn&#39;t that I don&#39;t care or it doesn&#39;t hurt <br/>\nto be maligned and badmouthed behind my back; I don&#39;t like it and I wish <br/>\nit wouldn&#39;t happen. But I guess I&#39;ve accepted that it isn&#39;t &quot;my&quot; problem <br/>\nso I don&#39;t give it much thought. When people tell me about it, I am sort <br/>\nof interested, but the interest is a little removed as if it isn&#39;t about <br/>\nme, but about other people&#39;s defensiveness or other people&#39;s fears or <br/>\njust their bad manners or maybe their wish to ingratiate themselves with <br/>\ncertain other people, etc. I feel like, &quot;Oh, that&#39;s too bad,&quot; mostly <br/>\nbecause they&#39;re biasing others against me who won&#39;t then be as open if <br/>\nwe do run into each other. I&#39;ve had quite a few people tell me that they <br/>\nwere surprised when they met me - that I didn&#39;t say the things they&#39;d <br/>\nexpected and a few people have even said, &quot;You&#39;re so nice!&quot; Like they <br/>\nwere REALLY surprised.<br/>\n<br/>\nIt is okay - I consider it a very small price to pay for getting to <br/>\nexperience the flow and the satisfaction and pleasure of what I do.<br/>\n<br/>\nI think Sandra will probably agree with what I wrote above and she <br/>\nprobably experiences all of it even much more than I do.<br/>\n<br/>\nI kind of want to reassure people that we&#39;re not getting our own <br/>\nfeelings much hurt by some of the meanness that gets thrown our way at <br/>\ntimes - on the list or in real life. If it wasn&#39;t worth it, we wouldn&#39;t <br/>\ncontinue. Sometimes, in offline life, I&#39;ve felt like other people are <br/>\nfeeling worse about it on my behalf than I do, myself.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":211307854,"authorName":"Carol","from":"Carol &lt;mykaylabee@...&gt;","profile":"sognokids","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Intolerance, stupidity, naivitee, dogma, security and privilege","postDate":"1308871241","msgId":61738,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVGRTlDQ0U4LTdBMTgtNDA1My1BMkI5LTQ1MEJFQzMzRkNCMEBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PGl1MDRubitqN3UwQGVHcm91cHMuY29tPg==","referencesHeader":"PGl1MDRubitqN3UwQGVHcm91cHMuY29tPg=="},"prevInTopic":61736,"nextInTopic":61743,"prevInTime":61737,"nextInTime":61739,"topicId":61724,"numMessagesInTopic":0,"msgSnippet":"My kids get to grow up with a mom who sees possibilities rather than barriers. That s a tremendous privilege. I m glad I have that to offer them. ... ","messageBody":"<div id=\"ygrps-yiv-1095554655\">My kids get to grow up with a mom who sees possibilities rather than barriers. That&#39;s a tremendous privilege. I&#39;m glad I have that to offer them. <br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; ---Meredith<br/>\n&gt; <br/>\n </span></blockquote>***************************************************<br/>\n<br/>\nThis brought tears to my eyes, Meredith.  Although I am a Buddhist, I love the Christmas season and I spend a lot of time contemplating Mary, the young woman who embraced a child who came to her in a miraculous way.  But that&#39;s true for all of us, isn&#39;t it?  Families are built in some pretty miraculous ways; through biological birth, blended families, or, in my case, through adoption.  Why is it considered so strange in mainstream thinking when we celebrate our kids for the miracles that they are?  May I continue to be worthy of the Gifts that are my children.<br/>\n<br/>\nCarol</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Intolerance, stupidity, naivitee, dogma, security and privilege","postDate":"1308861810","msgId":61735,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhERDQ3Nzg0LUNEMzAtNDZDNS05N0VELTQ2QjkwQjBENTgwNEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDEzMDg4NjA1MDYuMzQ5MTQuWWFob29NYWlsTmVvQHdlYjExMDQwOC5tYWlsLmdxMS55YWhvby5jb20+","referencesHeader":"PEI2MTQ0MjA1LTUyMDctNDA4RC1CQkQ0LTU2MTEyNTZBNDQ4QkBzYW5kcmFkb2RkLmNvbT4gPDczNDMwMEM0NTg4NDRCMUFBQTIxMDg5MjI1N0I5OTFFQGRlYm9yYWg0M2YxM2ZkPiA8RjE0RDgzQkEtOTJCMC00MURBLUE0MkQtQjRFNzlBRTdCQzUyQFNhbmRyYWRvZGQuY29tPiA8MTMwODg2MDUwNi4zNDkxNC5ZYWhvb01haWxOZW9Ad2ViMTEwNDA4Lm1haWwuZ3ExLnlhaG9vLmNvbT4="},"prevInTopic":61734,"nextInTopic":61736,"prevInTime":61734,"nextInTime":61736,"topicId":61724,"numMessagesInTopic":0,"msgSnippet":"-=-But people who tend to do that will have a harder time raising children with pleasant childhoods that are healthy, happy and respected.  I think we probably","messageBody":"<div id=\"ygrps-yiv-367155001\">-=-But people who tend to do that will have a harder time raising children with pleasant childhoods that are healthy, happy and respected.  I think we probably all know people who are like that.-=-<br/>\n<br/>\n(&quot;That&quot; was leaving in a huff and a cloud of tirade.)<br/>\n<br/>\n-=-But people who tend to do that will have a harder time raising children with pleasant childhoods that are healthy, happy and respected. -=-<br/>\n<br/>\nIF they do that, it won&#39;t be because free information about how to help create a more pleasant childhood wasn&#39;t freely available AND that they had not already found that to be true AND signed on to this list *AND* posted for ideas.<br/>\n<br/>\nIf they are having a hard time, it&#39;s not the fault of this list or of those (such as Jenny who wrote what&#39;s above) who regularly and freely contribute ideas and links and reminders to anyone who wants to come by and read.<br/>\n<br/>\nThanks, all of you who are decent and helpful and kind to your kids and to others who want to be more that way themselves.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Intolerance, stupidity, naivitee, dogma, security and privilege","postDate":"1308861475","msgId":61734,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PERCMzY4QUM3LTUwOTktNDY5Ny1CNEJGLTI2QTVBRDEyNTFEM0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDlEODIwQTlBOUNDNDQ2QTZCQUMzODAwNEJFNTQxMkI2QGRlYm9yYWg0M2YxM2ZkPg==","referencesHeader":"PGl0dmgzays1dGxjQGVHcm91cHMuY29tPiA8OUQ4MjBBOUE5Q0M0NDZBNkJBQzM4MDA0QkU1NDEyQjZAZGVib3JhaDQzZjEzZmQ+"},"prevInTopic":61733,"nextInTopic":61735,"prevInTime":61733,"nextInTime":61735,"topicId":61724,"numMessagesInTopic":0,"msgSnippet":"-=- I think it s a mistake to place more importance on the expectation of society (especially one that is openly hostile to your children) than on the peace,","messageBody":"<div id=\"ygrps-yiv-1708248768\">-=- I think it&#39;s a mistake to place more importance on the expectation of society (especially one that is &quot;openly hostile&quot; to your children) than on the peace, comfort and happiness of the children themselves.-=-<br/>\n<br/>\n-=- I think it&#39;s a mistake to place more importance on the expectation of society <br/>\n(especially one that is &quot;openly hostile&quot; to your children) <br/>\nthan on the peace, comfort and happiness of the children themselves.  -=-<br/>\n<br/>\nDeb Lewis wrote that.<br/>\n<br/>\nIt&#39;s pretty important.<br/>\n<br/>\n-=-What&#39;s the justification for being upset with unschoolers on an unschooling list when they write and think about and share their unschooling lives? -=-<br/>\n<br/>\nIf we&#39;re right, she&#39;s harming her child.<br/>\nBetter that we&#39;re stupid and awful, so she&#39;s not harming her child.<br/>\n<br/>\nInterestingly (and not unusually) several people on the list wrote criticizing the ideas expressed about making one child go to school and do well, and not making the other child do anything.  I don&#39;t think everyone got a hateful, insulting e-mail.  I could be wrong, but I think I&#39;m the only one who received that bag-of-d0g-poo-on-porch gift.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Intolerance, stupidity, naivitee, dogma, security and privilege","postDate":"1308861035","msgId":61733,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcyMkFDQUMyN0Y3NTQ0NkQ5RDI5NzM5QzVFRTNFNTNCQGRlYm9yYWg0M2YxM2ZkPg==","referencesHeader":"PGl1MDRubitqN3UwQGVHcm91cHMuY29tPg=="},"prevInTopic":61732,"nextInTopic":61734,"prevInTime":61732,"nextInTime":61734,"topicId":61724,"numMessagesInTopic":0,"msgSnippet":"***My kids get to grow up with a mom who sees possibilities rather than barriers. That s a tremendous privilege. I m glad I have that to offer them. *** That s","messageBody":"<div id=\"ygrps-yiv-1354175662\">***My kids get to grow up with a mom who sees possibilities rather than barriers. That&#39;s a tremendous privilege. I&#39;m glad I have that to offer them. ***<br/>\n<br/>\nThat&#39;s lovely Meredith.  Your whole post was wonderful.   <br/>\n<br/>\nAnyone who lives where a parent has the privilege of exempting her child from compulsory school attendance can find a way to unschool.   If a nice house, good income, savings account, the right religion, background or politics were prerequisites to unschooling few of us would be here. <br/>\n<br/>\nIt may be more easy to be positive when one has financial security.  In hard times it&#39;s easy to succumb to negativity and find reasons to stay in that state of mind.   But our children are helped much more in a positive atmosphere than a negative one, much more by the hope of what&#39;s possible than the certainty so many things are impossible. <br/>\n<br/>\nYour post was a nice reminder for all of us dangling on that shoestring, Meredith.&lt;g&gt; <br/>\n<br/>\nDeb Lewis<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Intolerance, stupidity, naivitee, dogma, security and privilege","postDate":"1308860506","msgId":61732,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMDg4NjA1MDYuMzQ5MTQuWWFob29NYWlsTmVvQHdlYjExMDQwOC5tYWlsLmdxMS55YWhvby5jb20+","inReplyToHeader":"PEYxNEQ4M0JBLTkyQjAtNDFEQS1BNDJELUI0RTc5QUU3QkM1MkBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PEI2MTQ0MjA1LTUyMDctNDA4RC1CQkQ0LTU2MTEyNTZBNDQ4QkBzYW5kcmFkb2RkLmNvbT4gPDczNDMwMEM0NTg4NDRCMUFBQTIxMDg5MjI1N0I5OTFFQGRlYm9yYWg0M2YxM2ZkPiA8RjE0RDgzQkEtOTJCMC00MURBLUE0MkQtQjRFNzlBRTdCQzUyQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":61731,"nextInTopic":61733,"prevInTime":61731,"nextInTime":61733,"topicId":61724,"numMessagesInTopic":0,"msgSnippet":"***And no indignant tirades by people who join the list and can t bear to leave without a dramatic exit speech can change the fact that my children were","messageBody":"<div id=\"ygrps-yiv-878975051\">***And no indignant tirades by people who join the list and can&#39;t bear to leave without a dramatic exit speech can change the fact that my children were unschooled from the beginning, had pleasant childhoods, and are healthy, happy, respected young adults.***<br/>\n<br/>\n<br/>\nBut people who tend to do that will have a harder time raising children with pleasant childhoods that are healthy, happy and respected.  I think we probably all know people who are like that.<br/>\n<br/>\nI prefer peace and happiness and finding alternatives to drama and tirades!<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Intolerance, stupidity, naivitee, dogma, security and privilege","postDate":"1308860092","msgId":61731,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMDg4NjAwOTIuMjEzNTUuWWFob29NYWlsTmVvQHdlYjExMDQxMi5tYWlsLmdxMS55YWhvby5jb20+","inReplyToHeader":"PEI2MTQ0MjA1LTUyMDctNDA4RC1CQkQ0LTU2MTEyNTZBNDQ4QkBzYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PEI2MTQ0MjA1LTUyMDctNDA4RC1CQkQ0LTU2MTEyNTZBNDQ4QkBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":61730,"nextInTopic":61732,"prevInTime":61730,"nextInTime":61732,"topicId":61724,"numMessagesInTopic":0,"msgSnippet":"***My kids do not have the luxury of living in a world that accepts them, tolerates them, forgives their foibles and encourages them. To the contrary, the","messageBody":"<div id=\"ygrps-yiv-1094277365\">***My kids do not have the luxury of living in a world that accepts them, tolerates them, forgives their foibles and encourages them. To the contrary, the larger society is openly hostile toward them. They must behave accordingly if they are to survive. The consequences of youthful mistakes are often severe, even deadly. To pretend that these consequences do not exist is worse than stupid for parents in my world -- it constitutes criminal neglect. Thus, my daughter who went to public high school could not afford the luxury of fiddling around or flunking or battling the status quo.***<br/>\n<br/>\n<br/>\nMy daughter came home yesterday and told me she was banned from all public parking garages, in downtown Portland, for 6 months.  She wasn&#39;t doing anything but sitting and looking at the view from a height.  When she saw a police officer, she tried to leave because her experience with the local law enforcement is that they are unfriendly and confrontational.  The police officer decided that he didn&#39;t like the fact that she was trying to escape him, even though she hadn&#39;t done anything.<br/>\n<br/>\nShe was with a couple of other people, one of them a school kid.  The law worked the same for each of them.  It made zero difference whether they went to school or not.  The officer didn&#39;t want them in the parking garage.  My daughter&#39;s world at that moment was that sometimes she&#39;s not accepted or forgiven.  The BIG difference is that she came home and told me about it, knowing that *I* would be tolerant, forgiving, and accepting.  She could go home, to her safe and comfortable home and tell her parents the absolute truth of the situation and know that she would be okay.  The school kid?  He&#39;s left home to never go back.  His parents are not forgiving, tolerant, or accepting and it has NOTHING to do with school or not.<br/>\n<br/>\nI guess what it comes down to is this... Do you want to raise children in a home that isn&#39;t tolerant or forgiving or accepting so that they&#39;ll know how to handle that once they are on their own interacting within that world?  Or do you want to make their home their safe place, their place of comfort and tolerance and forgiveness and acceptance, so that they know the difference and can find gracious ways to live in a world that might not be as soft and generous?  Go a step further; if your children grow up in a place of peace they will be less likely to see the world as a place that is unforgiving and intolerant.<br/>\n<br/>\nI WILL NOT raise my children for a worst case scenario!  I&#39;m raising them in an environment that loves and accepts them, so that they feel loved and accepted.  No rules of society or school or anything else will change that fundamental aspect of their lives.  I WILL NOT tie rules of society and rules of school into their feelings of love and acceptance.  The person who wrote the above is doing this, even if they don&#39;t see it as such.  I see parents doing this all the time to their kids.  School rules and grades are so important that they trump everything else.  It is part of school to follow rules and get grades, but it ends there and shouldn&#39;t be brought into the family lives.  If a parent is so tied to what goes on in school that they can&#39;t see their own child in front of them without seeing school, there is something wrong.  <br/>\n<br/>\nI was fortunate enough to grow up in a home that didn&#39;t do that.  I went to school, but school was not my life, nor did my parents make it such.  I know it can be done, I&#39;ve experienced it.  I&#39;ve met ONE person, ONE, since that time who does the same for her daughter.  Her daughter is 17 and is doing great in school.  I&#39;m not surprised in the least.<br/>\n<br/>\n***To ignore cultural differences and the realities that accompany them seems naive at best.***<br/>\n<br/>\n<br/>\nThis is an international list.  There are many cultures of people represented here.  I think most people who write here, write with that in mind.  Occasionally there will be things specific to specific areas, mostly US centered, but for the most part it&#39;s not that way.  Unschooling works the same in every culture.  The underlying ideas are that children learn because they are designed to do that and as parents we can help them by being kind and peaceful and respectful while helping them explore the big beautiful world!  So, I guess my children are privileged in that regard since not every child gets that life.  I feel very privileged to do that for them.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Intolerance, stupidity, naivitee, dogma, security and privilege","postDate":"1308859152","msgId":61730,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlEODIwQTlBOUNDNDQ2QTZCQUMzODAwNEJFNTQxMkI2QGRlYm9yYWg0M2YxM2ZkPg==","referencesHeader":"PGl0dmgzays1dGxjQGVHcm91cHMuY29tPg=="},"prevInTopic":61729,"nextInTopic":61731,"prevInTime":61729,"nextInTime":61731,"topicId":61724,"numMessagesInTopic":0,"msgSnippet":"***This makes me really sad. When I read this whole post I felt nothing but sadness. I don t know this person, nor their circumstances, but this type of","messageBody":"<div id=\"ygrps-yiv-1018467978\">***This makes me really sad. When I read this whole post I felt nothing but sadness. I don&#39;t know this person, nor their circumstances, but this type of posturing sounds like the person&#39;s life is some kind of horrible hell and the childrens&#39; can be no better, and from their point of view that is just the way it is. ***<br/>\n<br/>\nIt is sad.  I&#39;m guessing she lives in the US, not so different from some other list members.  And I&#39;m guessing at least one other list member would have a similar cultural background, had she chosen to share that.  I&#39;m guessing the hostile world she lives in is largely in her head.   I could be wrong.   Either way, very sad. <br/>\n<br/>\nI&#39;m sad too when people cant even hear a different idea without feeling disgruntled and abused.  Maybe I&#39;ve just lived long enough to have A LOT of experience with being wrong &lt;g&gt;  so don&#39;t see what&#39;s so bad about being challenged a little bit on a discussion list.     This is a group of people you never have to have over for pie.    The discussion here can&#39;t matter to your life any more than you make  it matter.    I take a lot of things really seriously but I never take myself so seriously that I cannot hear tell of being wrong.   And oh, that&#39;s a good thing.&lt;g&gt; <br/>\n<br/>\nUnschooling moms who help their kids do (as much as possible) what the kids want to do, love their kids too, want their kids to have happy lives, want them to be safe.  I haven&#39;t somehow missed all the information out there about the importance of being a good parent or about what &quot;society&quot; expects.   And I never pretended in any &quot;worse than stupid&quot; way that living the kind of life we wanted would have no risks or challenges.   Life is risky.  What&#39;s the alternative? <br/>\n<br/>\nI doubt anyone thinks a mom who wants her kid to do well in school loves her child less.  I think it&#39;s a mistake to place more importance on the expectation of society (especially one that is &quot;openly hostile&quot; to your children) than on the peace, comfort and happiness of the children themselves.    Maybe this mom hasn&#39;t done that, maybe her daughter is happy to be at school, happy to work for good grades and &quot;toe the line&quot; and if so then what is the benefit of being upset with people who&#39;ve found a different way to help their kids be happy?   What&#39;s the justification for being upset with unschoolers on an unschooling list when they write and think about and share their unschooling lives?   <br/>\n<br/>\nDeb Lewis<br/>\n<br/>\n <br/>\n<br/>\n  <br/>\n<br/>\n <br/>\n<br/>\n <br/>\n<br/>\n    <br/>\n<br/>\n<br/>\n    <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Intolerance, stupidity, naivitee, dogma, security and privilege","postDate":"1308857911","msgId":61729,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGl1MDRubitqN3UwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEI2MTQ0MjA1LTUyMDctNDA4RC1CQkQ0LTU2MTEyNTZBNDQ4QkBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":61728,"nextInTopic":61730,"prevInTime":61728,"nextInTime":61730,"topicId":61724,"numMessagesInTopic":0,"msgSnippet":"... ************* Unschooling takes some resources - not the *same* resources for everyone, but to unschool successfully one must feel secure enough - and","messageBody":"<div id=\"ygrps-yiv-1572596792\"><blockquote><span title=\"ireply\">&gt;&gt;&gt; I do hope that you will consider, from your position of security and privilege, that most of the world inhabits other realms.<br/>\n </span></blockquote>*************<br/>\n<br/>\nUnschooling takes some resources - not the *same* resources for everyone, but to unschool successfully one must feel secure enough - and arguably privileged enough, too. One of the most striking aspects of radical unschooling lists is the incredible atmosphere of positivity - the idea that Yes, it Is Possible to create a safe, loving environment for your children and that by doing so you help your kids, not hurt them. To do such a thing is a great privilege. <br/>\n<br/>\nIt could be that you&#39;re reading all this positivity as financial and situational privilege. For some people it is, but not for all unschooling families. Many, like mine, live on a shoestring. Others live on even less. Many unschooling families have scant local support and some have family and neighbors who are actively hostile to their parenting. This list and others exist to provide resources to help other unschoolers - and it&#39;s here for free. What security and privilege the writers on this list have they devote to supporting others families, not out of a sense of charity but solidarity because unschoolers are a minority within a minority. We all need all the support we can get. <br/>\n<br/>\nI mentioned I live on a shoestring - its about to be cut. I could be wailing about privilede and security right now. Learning about unschooling has given me the personal skills to go beyond that, to look beyonds the limits of my own life and see the possibilites. My kids get to grow up with a mom who sees possibilities rather than barriers. That&#39;s a tremendous privilege. I&#39;m glad I have that to offer them. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":356429371,"authorName":"lydia reiter","from":"lydia reiter &lt;chozebah@...&gt;","profile":"chozebah","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Intolerance, stupidity, naivitee, dogma, security and privilege","postDate":"1308850537","msgId":61728,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYwOTUxNS4zMzQ0OS5xbUB3ZWI0NTMxNS5tYWlsLnNwMS55YWhvby5jb20+","inReplyToHeader":"PEI2MTQ0MjA1LTUyMDctNDA4RC1CQkQ0LTU2MTEyNTZBNDQ4QkBzYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PEI2MTQ0MjA1LTUyMDctNDA4RC1CQkQ0LTU2MTEyNTZBNDQ4QkBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":61727,"nextInTopic":61729,"prevInTime":61727,"nextInTime":61729,"topicId":61724,"numMessagesInTopic":0,"msgSnippet":"This post made me incredibly sad, also.  Partly because I can empathize with this poster and the world she lives in. **** My kids do not have the luxury of","messageBody":"<div id=\"ygrps-yiv-654771928\">This post made me incredibly sad, also.  Partly because I can empathize with <br/>\nthis poster and the world she lives in.<br/>\n<br/>\n****<br/>\n  My kids do not have the luxury of living in a world that  accepts them, <br/>\ntolerates them, forgives their foibles and encourages  them. To the contrary, <br/>\nthe larger society is openly hostile toward them.  They must behave accordingly <br/>\nif they are to survive. The consequences  of youthful mistakes are often severe, <br/>\neven deadly.****<br/>\n<br/>\nI live in this type of community.  It does not appear dangerous to outsiders.  <br/>\nTo most people it probably looks a lot like Mayberry as it did to us when we <br/>\nmoved here ten years ago.  However I now know that it more closely resembles a <br/>\ntown from the Twilight Zone.  We didn&#39;t have to stay here for 10 years but we <br/>\nchose to stay and help two children.  It has been a difficult time for our <br/>\nfamily.  I hope to someday write out our story of the last 7 years.  Although <br/>\nI&#39;m afraid most people would find it unbelievable.  We will be moving in the <br/>\nfall.  <br/>\n<br/>\n<br/>\nMy suggestion is to move.  Then you can consider unschooling advice without <br/>\nfearing the consequences to your family.  I have lived in many places in the US <br/>\nfrom Boston to West Texas and in between.  I have also lived in Germany for 2 <br/>\n1/2 years.  I have never lived in anyplace like this before.  Communities like <br/>\nthis are not the norm.  If you&#39;ve lived there a long time it may be difficult to <br/>\nrealize that moving could make such a huge difference to your family&#39;s <br/>\nhappiness.<br/>\n<br/>\nI have learned so much from this list about how unschoolers live in the larger <br/>\nsociety outside of my community.<br/>\n<br/>\n<br/>\n Lydia Reiter<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":82912732,"authorName":"Cindy","from":"&quot;Cindy&quot; &lt;cindyjsowers@...&gt;","profile":"cindyjsowers","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Intolerance, stupidity, naivitee, dogma, security and privilege","postDate":"1308837812","msgId":61727,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGl0dmgzays1dGxjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEI2MTQ0MjA1LTUyMDctNDA4RC1CQkQ0LTU2MTEyNTZBNDQ4QkBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":61726,"nextInTopic":61728,"prevInTime":61726,"nextInTime":61728,"topicId":61724,"numMessagesInTopic":0,"msgSnippet":"... This makes me really sad.  When I read this whole post I felt nothing but sadness.  I don t know this person, nor their circumstances, but this type of","messageBody":"<div id=\"ygrps-yiv-502477603\"><blockquote><span title=\"ireply\">&gt; I do hope that you will consider, from your position of security and privilege, that most of the world inhabits other realms.  <br/>\n<br/>\n </span></blockquote>This makes me really sad.  When I read this whole post I felt nothing but sadness.  I don&#39;t know this person, nor their circumstances, but this type of posturing sounds like the person&#39;s life is some kind of horrible hell and the childrens&#39; can be no better, and from their point of view that is just the way it is.  It&#39;s been a long time since I have been face to face with a mean world.  I live in what I believe is the real world, but honestly I haven&#39;t noticed people being openly hostile towards me, nor expecting me to make life and death decisions on a regular basis.  In terms of privilege, I would say, yes, I am privileged to have seen something entirely different from what the poster describes as his/her world.  That life can be fun and peaceful and not mean and ugly.  I wouldn&#39;t be inclined to apologize for that.  It seems a better idea to try to help other people experience more of the fun and peaceful and less of the mean and ugly.  I think, Sandra, that is exactly what you and this list do, which is why it is of such value.  I think maybe for someone like the poster, tiny baby steps of making things a little bit better for their own family each day is more in line with their reality than biting off big chunks.  Given the gusto with which the poster is protesting, I would say at least the idea has been let in, despite their apparent objection and rejection.   - Cindy</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Intolerance, stupidity, naivitee, dogma, security and privilege","postDate":"1308835096","msgId":61726,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYxNEQ4M0JBLTkyQjAtNDFEQS1BNDJELUI0RTc5QUU3QkM1MkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDczNDMwMEM0NTg4NDRCMUFBQTIxMDg5MjI1N0I5OTFFQGRlYm9yYWg0M2YxM2ZkPg==","referencesHeader":"PEI2MTQ0MjA1LTUyMDctNDA4RC1CQkQ0LTU2MTEyNTZBNDQ4QkBzYW5kcmFkb2RkLmNvbT4gPDczNDMwMEM0NTg4NDRCMUFBQTIxMDg5MjI1N0I5OTFFQGRlYm9yYWg0M2YxM2ZkPg=="},"prevInTopic":61725,"nextInTopic":61727,"prevInTime":61725,"nextInTime":61727,"topicId":61724,"numMessagesInTopic":0,"msgSnippet":"-=-No thought or action on the part of a list member can end your existence or interfere with your life or freedom or rights in anyway. Being dramatic doesn t","messageBody":"<div id=\"ygrps-yiv-2046830187\">-=-No thought or action on the part of a list member can end your existence or interfere with your life or freedom or rights in anyway. Being dramatic doesn&#39;t make you open-minded and tolerant.-=-<br/>\n<br/>\nAnd no indignant tirades by people who join the list and can&#39;t bear to leave without a dramatic exit speech can change the fact that my children were unschooled from the beginning, had pleasant childhoods,  and are healthy, happy, respected young adults.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Intolerance, stupidity, naivitee, dogma, security and privilege","postDate":"1308834154","msgId":61725,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDczNDMwMEM0NTg4NDRCMUFBQTIxMDg5MjI1N0I5OTFFQGRlYm9yYWg0M2YxM2ZkPg==","referencesHeader":"PEI2MTQ0MjA1LTUyMDctNDA4RC1CQkQ0LTU2MTEyNTZBNDQ4QkBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":61724,"nextInTopic":61726,"prevInTime":61724,"nextInTime":61726,"topicId":61724,"numMessagesInTopic":0,"msgSnippet":"***Narrowness of scope and viewpoint and intolerance are issues I deal with daily. I didn t expect to find them here but I don t have the time or patience to","messageBody":"<div id=\"ygrps-yiv-474505678\">***Narrowness of scope and viewpoint and intolerance are issues I deal with daily. I didn&#39;t expect to find them here but I don&#39;t have the time or patience to wrestle with them if I don&#39;t have to.***<br/>\n<br/>\nHere&#39;s a narrow point of view: &quot;Thus, my daughter who went to public high school could not afford the luxury of fiddling around or flunking or battling the status quo. She had to toe the line, make the grades, and prepare herself for survival in the world she inhabits. Period.&quot;<br/>\n<br/>\nDo all children who don&#39;t go to school where you live suffer or die or is it just the one&#39;s who don&#39;t do well there or don&#39;t finish?  Where do you live?   It sounds frightening!<br/>\n<br/>\n***A child grows and learns in the context of her family and the wider community. I have seen many examples of the lack of understanding of this reality in the posts I have read on your list. ***<br/>\n<br/>\nWhat examples?   Because all the writing on this list is about how our children grow and learn.   And since they live with their parents and don&#39;t go to school, they are learning with their families and in their communities.   Please let us know exactly which posts by unschoolers on an unschooling list show a &quot;lack of understanding of this reality.&quot;   <br/>\n<br/>\n*** To ignore cultural differences and the realities that accompany them seems naive at best.***<br/>\n<br/>\nWe didn&#39;t ignore your cultural difference, you did.  You didn&#39;t mention it.  Had you done so you might have discovered others on the list with the same background or even some who live where you do and who haven&#39;t found it impossible to support their child&#39;s exploration and interests.   <br/>\n<br/>\n ***from your position of security and privilege, that most of the world inhabits other realms.***<br/>\n<br/>\nI think you can&#39;t know who on this list has what kind of security and privilege.   You can assume, because a family that has at least one computer and some time to use it without ducking bombs does have some security and privilege, but you can&#39;t know the details.  <br/>\nLots of unschoolers survive on one income and sometimes not even that.  Unschooling requires flexibility, creativity and determination.  <br/>\n<br/>\n***The consequences of youthful mistakes are often severe, even deadly.***<br/>\n<br/>\nIn the US the average female can expect to live to be eighty.  In a population of over three hundred million people it seems youthful mistakes might not &quot;often&quot; be severe or deadly.    I never met anyone who could brag about never making a mistake.   If you live in Afghanistan or Mozambique and can expect to live to be fortyish then I  helping a child get what she wants as much as possible would be even more important, since time is so short.  <br/>\n<br/>\n***It is the worst kind of intolerance to assume that everyone&#39;s cultural norms, family principles, and way of life is the same as yours, or that yours is the only valid expression of family life.***<br/>\n<br/>\nOne of the points of an unschooling list is to show that family principles can hurt or help unschooling.   If you want to unschool it might take some rethinking of your principles.  Surely if yours are excellent they can stand examination.   If rethinking some of your principles could mean peaceful and happy unschooling  you won&#39;t be harmed by that.  <br/>\n<br/>\nIt has nothing to do with intolerance.    Sandra isn&#39;t saying that everyone in the world must live life her way or suffer severe and deadly consequences.   She&#39;s sharing what is known to work for happy unschooling.   If unschooling is not what you want to do then you can freely leave the list you freely joined.    <br/>\n<br/>\nThe &quot;worst kind of intolerance&quot; might be genocide, murder, enslavement, which isn&#39;t happening on this list.  What does happen sometimes on this list is a person finds herself in the wrong place for what she wants, or what she&#39;s willing to consider.  In that case, that person can stop reading and go about her business.   No thought or action on the part of a list member can end your existence or interfere with your life or freedom or rights in anyway.    Being dramatic doesn&#39;t make you open-minded and tolerant.<br/>\n<br/>\nDeb Lewis<br/>\n<br/>\n<br/>\n     <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":458624268,"authorName":"dola dasgupta-banerji","from":"dola dasgupta-banerji &lt;doladg@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Intolerance, stupidity, naivitee, dogma, security and privilege","postDate":"1308826197","msgId":61736,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBTkxrVGltcF9mKzN6LTdOQXU9YTMreGJjT1k4Y2dKTE13QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PEI2MTQ0MjA1LTUyMDctNDA4RC1CQkQ0LTU2MTEyNTZBNDQ4QkBzYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PEI2MTQ0MjA1LTUyMDctNDA4RC1CQkQ0LTU2MTEyNTZBNDQ4QkBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":61735,"nextInTopic":61738,"prevInTime":61735,"nextInTime":61737,"topicId":61724,"numMessagesInTopic":0,"msgSnippet":"It is a coincidence that lately on another list that I write on, similar allegations were made on some of us unschoolers and homeschoolers. That list has much","messageBody":"<div id=\"ygrps-yiv-842135730\">It is a coincidence that lately on another list that I write on, similar<br/>\nallegations were made on some of us unschoolers and homeschoolers. That list<br/>\nhas much wider scope to include all sorts alternated living. However the<br/>\nallegations were similar. Some of us were judged for being privileged and<br/>\nliving in a bubble and not knowing about the &#39;harsh realities&#39; of life &#39;out<br/>\nthere&#39; and that &#39;we are selfish self centered people who only care about our<br/>\nown children and families.&quot; Someone even went as far as to say &#39;one should<br/>\nbecome a Budhha, or Gandhi, or Aurobindo (an Indian saint) to start doing<br/>\ngood for the larger society.&quot;<br/>\n<br/>\nSo I wrote back saying, &#39;If you wish to do so for the larger society, please<br/>\nthe calling is obviously yours and go ahead. For me small changes that I can<br/>\nbring into my life and that of my children and family, is as I see it, a<br/>\nstart even if very small, and every life I touch will go out and touch a few<br/>\nmore lives...and that according to me can be a catalyst for change...But<br/>\nplease do not think to unschool is a privilege because I have money or<br/>\nsecurity etc. And even if it is..so what..I can only be grateful to the<br/>\nUniverse for having been kind enough to give me that privilege..so that I<br/>\ncould avoid many risks that my child would face going to school. I have<br/>\ntaken the responsibility of my child&#39;s learning and left two vacancies in<br/>\nschools for those who need it more than I do...&quot;<br/>\n<br/>\n I belong to a completely different &#39;culture, nation, religion, society...&quot;<br/>\nI belong to India, where no two persons can claim to have similarity in<br/>\nculture or ethnicity...In the city New Delhi, where I live, which is the<br/>\ncapital of India, I am the only unschooler and one among five<br/>\nhomeschoolers... in a country which has recently passed a law that all<br/>\nchildren between 6 and 14 must be in school. THAT IS THE RISK I TAKE....WE<br/>\nARE WALKING TALKING LIVING FREAK SHOW....and I am laughing...<br/>\n<br/>\nDola<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Thu, Jun 23, 2011 at 12:07 PM, Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; wrote:<br/>\n<br/>\n&gt; I&#39;ve been accused of being intolerant, stupid, naive, dogmatic, and<br/>\n&gt; inhabiting a realm of security and privilege.<br/>\n&gt; I think this should have been on the list and not in private e-mail.  I<br/>\n&gt; don&#39;t like to be insulted on the side for information shared freely in<br/>\n&gt; public.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; I&#39;ve spent the last couple of days considering my response to your<br/>\n&gt; response. It boils down to the following:<br/>\n&gt;        � Unschooling as a way of life does not exist within a vacuum. A<br/>\n&gt; child grows and learns in the context of her family and the wider community.<br/>\n&gt; I have seen many examples of the lack of understanding of this reality in<br/>\n&gt; the posts I have read on your list.<br/>\n&gt;        � It is the worst kind of intolerance to assume that everyone&#39;s<br/>\n&gt; cultural norms, family principles, and way of life is the same as yours, or<br/>\n&gt; that yours is the only valid expression of family life.<br/>\n&gt;        � Communities differ. It is quite obvious that the one I inhabit<br/>\n&gt; differs from yours. My kids do not have the luxury of living in a world that<br/>\n&gt; accepts them, tolerates them, forgives their foibles and encourages them. To<br/>\n&gt; the contrary, the larger society is openly hostile toward them. They must<br/>\n&gt; behave accordingly if they are to survive. The consequences of youthful<br/>\n&gt; mistakes are often severe, even deadly. To pretend that these consequences<br/>\n&gt; do not exist is worse than stupid for parents in my world -- it constitutes<br/>\n&gt; criminal neglect. Thus, my daughter who went to public high school could not<br/>\n&gt; afford the luxury of fiddling around or flunking or battling the status quo.<br/>\n&gt; She had to toe the line, make the grades, and prepare herself for survival<br/>\n&gt; in the world she inhabits. Period.<br/>\n&gt;        � To ignore cultural differences and the realities that accompany<br/>\n&gt; them seems naive at best.<br/>\n&gt;        � I think that dogma and dogmatic proclamations about unschooling<br/>\n&gt; are inconsistent with the whole notion of a family finding its own way.<br/>\n&gt; I&#39;ll be unsubbing from the list. Narrowness of scope and viewpoint and<br/>\n&gt; intolerance are issues I deal with daily. I didn&#39;t expect to find them here<br/>\n&gt; but I don&#39;t have the time or patience to wrestle with them if I don&#39;t have<br/>\n&gt; to.<br/>\n&gt;<br/>\n&gt; I do hope that you will consider, from your position of security and<br/>\n&gt; privilege, that most of the world inhabits other realms.<br/>\n&gt; -----------------------------------------------<br/>\n&gt;<br/>\n&gt; My &quot;position of security and privilege&quot;?<br/>\n&gt; I grew up poor.  My parents were high school drop-outs who were thrilled<br/>\n&gt; that I got a university degree.<br/>\n&gt; I&#39;ve risked having unemployable children by not forcing them to go to<br/>\n&gt; school, but all of them have been offered jobs they didn&#39;t apply for AND<br/>\n&gt; have been given jobs later that they did apply for.<br/>\n&gt; I risk receiving insulting e-mails by continuing to help other people<br/>\n&gt; freely, but I&#39;m going to keep doing that until the insult builds up enough<br/>\n&gt; that I just quit.  I have enough security and privilege to offer help if I<br/>\n&gt; want to, and to stop when I want to stop.<br/>\n&gt;<br/>\n&gt; -=- The consequences of youthful mistakes are often severe, even deadly.-=-<br/>\n&gt;<br/>\n&gt; Did I risk my children&#39;s LIVES by not sending them to school!?<br/>\n&gt; School shootings come to mind.  Each and every victim of a school shooting<br/>\n&gt; or a school bus accident would have been better off if he or she had been<br/>\n&gt; home that day.<br/>\n&gt;<br/>\n&gt; The consequences of parental over-control and pressure can be severe and<br/>\n&gt; even deadly.<br/>\n&gt;<br/>\n&gt; -=-It is the worst kind of intolerance to assume that everyone&#39;s cultural<br/>\n&gt; norms, family principles, and way of life is the same as yours, or that<br/>\n&gt; yours is the only valid expression of family life. -=-<br/>\n&gt;<br/>\n&gt; No, the worst kind of intolerance is for someone to join an unschooling<br/>\n&gt; discussion group that&#39;s clearly tied to existing sites, that has tens of<br/>\n&gt; thousands of messages in the archive, and then to get pissed off at the<br/>\n&gt; consistency of the information.  I don&#39;t think unschooling is the only valid<br/>\n&gt; expression of family life.  I think that making a child go to school is an<br/>\n&gt; invalid expression of unschooling.<br/>\n&gt;<br/>\n&gt; This list isn&#39;t the &quot;Families finding their own way&quot; list, it&#39;s the Always<br/>\n&gt; Learning list, which starts off with this:<br/>\n&gt;<br/>\n&gt; Description:<br/>\n&gt;<br/>\n&gt; DO NOT POST without reading this:<br/>\n&gt;<br/>\n&gt; How and why does unschooling work? What kind of parents and parenting does<br/>\n&gt; it take? What will help, and what will hinder?<br/>\n&gt;<br/>\n&gt; This is a list for the examination of the philosophy of unschooling and<br/>\n&gt; attentive parenting and a place for sharing examined lives based on the<br/>\n&gt; principles underlying unschooling.<br/>\n&gt;<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/AlwaysLearning/\">http://groups.yahoo.com/group/AlwaysLearning/</a><br/>\n&gt;<br/>\n&gt; Sandra<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ------------------------------------<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Intolerance, stupidity, naivitee, dogma, security and privilege","postDate":"1308811077","msgId":61724,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI2MTQ0MjA1LTUyMDctNDA4RC1CQkQ0LTU2MTEyNTZBNDQ4QkBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":61725,"prevInTime":61723,"nextInTime":61725,"topicId":61724,"numMessagesInTopic":0,"msgSnippet":"I ve been accused of being intolerant, stupid, naive, dogmatic, and inhabiting a realm of security and privilege. I think this should have been on the list and","messageBody":"<div id=\"ygrps-yiv-1901648758\">I&#39;ve been accused of being intolerant, stupid, naive, dogmatic, and inhabiting a realm of security and privilege.<br/>\nI think this should have been on the list and not in private e-mail.  I don&#39;t like to be insulted on the side for information shared freely in public.<br/>\n<br/>\n<br/>\nI&#39;ve spent the last couple of days considering my response to your response. It boils down to the following: <br/>\n\t• Unschooling as a way of life does not exist within a vacuum. A child grows and learns in the context of her family and the wider community. I have seen many examples of the lack of understanding of this reality in the posts I have read on your list. <br/>\n\t• It is the worst kind of intolerance to assume that everyone&#39;s cultural norms, family principles, and way of life is the same as yours, or that yours is the only valid expression of family life. <br/>\n\t• Communities differ. It is quite obvious that the one I inhabit differs from yours. My kids do not have the luxury of living in a world that accepts them, tolerates them, forgives their foibles and encourages them. To the contrary, the larger society is openly hostile toward them. They must behave accordingly if they are to survive. The consequences of youthful mistakes are often severe, even deadly. To pretend that these consequences do not exist is worse than stupid for parents in my world -- it constitutes criminal neglect. Thus, my daughter who went to public high school could not afford the luxury of fiddling around or flunking or battling the status quo. She had to toe the line, make the grades, and prepare herself for survival in the world she inhabits. Period. <br/>\n\t• To ignore cultural differences and the realities that accompany them seems naive at best. <br/>\n\t• I think that dogma and dogmatic proclamations about unschooling are inconsistent with the whole notion of a family finding its own way. <br/>\nI&#39;ll be unsubbing from the list. Narrowness of scope and viewpoint and intolerance are issues I deal with daily. I didn&#39;t expect to find them here but I don&#39;t have the time or patience to wrestle with them if I don&#39;t have to.<br/>\n<br/>\nI do hope that you will consider, from your position of security and privilege, that most of the world inhabits other realms.  <br/>\n-----------------------------------------------<br/>\n<br/>\nMy &quot;position of security and privilege&quot;?<br/>\nI grew up poor.  My parents were high school drop-outs who were thrilled that I got a university degree.<br/>\nI&#39;ve risked having unemployable children by not forcing them to go to school, but all of them have been offered jobs they didn&#39;t apply for AND have been given jobs later that they did apply for.<br/>\nI risk receiving insulting e-mails by continuing to help other people freely, but I&#39;m going to keep doing that until the insult builds up enough that I just quit.  I have enough security and privilege to offer help if I want to, and to stop when I want to stop.<br/>\n<br/>\n-=- The consequences of youthful mistakes are often severe, even deadly.-=-<br/>\n<br/>\nDid I risk my children&#39;s LIVES by not sending them to school!?  <br/>\nSchool shootings come to mind.  Each and every victim of a school shooting or a school bus accident would have been better off if he or she had been home that day.<br/>\n<br/>\nThe consequences of parental over-control and pressure can be severe and even deadly.<br/>\n<br/>\n-=-It is the worst kind of intolerance to assume that everyone&#39;s cultural norms, family principles, and way of life is the same as yours, or that yours is the only valid expression of family life. -=-<br/>\n<br/>\nNo, the worst kind of intolerance is for someone to join an unschooling discussion group that&#39;s clearly tied to existing sites, that has tens of thousands of messages in the archive, and then to get pissed off at the consistency of the information.  I don&#39;t think unschooling is the only valid expression of family life.  I think that making a child go to school is an invalid expression of unschooling.<br/>\n<br/>\nThis list isn&#39;t the &quot;Families finding their own way&quot; list, it&#39;s the Always Learning list, which starts off with this:<br/>\n<br/>\nDescription:<br/>\n<br/>\nDO NOT POST without reading this:<br/>\n<br/>\nHow and why does unschooling work? What kind of parents and parenting does it take? What will help, and what will hinder? <br/>\n<br/>\nThis is a list for the examination of the philosophy of unschooling and attentive parenting and a place for sharing examined lives based on the principles underlying unschooling.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/AlwaysLearning/\">http://groups.yahoo.com/group/AlwaysLearning/</a><br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":25095,"nextTopicId":61737}}