{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":0,"authorName":"Thomas and Nanci Kuykendall","from":"Thomas and Nanci Kuykendall &lt;tn-k4of5@...&gt;","replyTo":"LIST","senderId":"INBqmGxx6q1vuKw1u6CQt0zN4Ue1WWtuNGNFUoEOp_lRhy5BFC6wtEFaCXIf8Qktl-24gHTl1URhWRUZp4mZBgFWDi9subM-y_4S6tWtde-j0N_7PvHKPe4","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: Influences /it&#39;s not really about pokemon","postDate":"947308561","msgId":5522,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4zNjQuNTUyMi45NTkyNjk3NDVAZUdyb3Vwcy5jb20+"},"prevInTopic":5483,"nextInTopic":0,"prevInTime":5521,"nextInTime":5523,"topicId":5477,"numMessagesInTopic":0,"msgSnippet":"... I have to second that.  I wanted to add a couple of comments also. Corinna Wrote How does it look when we, as homeschoolers, can t even get along amongst","messageBody":"<div id=\"ygrps-yiv-1323411259\">At 11:21 AM 01/06/2000 -0800, you wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;   Thank  you Susan! I couldn&#39;t agree more. Wonderful email.   Brynn <br/>\n<br/>\n </span></blockquote>I have to second that.  I wanted to add a couple of comments also.<br/>\n<br/>\nCorinna Wrote &quot;How does it look when we, as homeschoolers, can&#39;t even get<br/>\nalong amongst ourselves?  United we stand, divided we fall.&quot;<br/>\n<br/>\nand Susan: <br/>\n&quot;the iroquios have a saying &#39;unity through diversity&#39;  so why can&#39;t our<br/>\ndiversity be accessible? what&#39;s wrong with just commenting on a topic<br/>\nwithout it being taken as a personal attack?  to me this is real strength.&quot;<br/>\n<br/>\nHow does it look to whom?  Frankly it&#39;s insulting to be told to sit down<br/>\nand be quiet because we are rocking the boat, or some such notion.  Who<br/>\ncares what we &quot;Look Like&quot;?  I thought we were among friends.  Or is there a<br/>\ndiscretionary committee of judgemental, superficial &#39;old women&#39; peeping<br/>\nthrough the curtains at us who are going to gossip to the neighbors?<br/>\nThe initial address of the letter in question &quot;As Christian<br/>\nParents/Grandparents..&quot; does, as someone else already mentioned, completely<br/>\nlump everyone together on this list as Christian. I take exception to that,<br/>\nnot being Christian, as do a number of other list members.  As others have<br/>\nmentioned, this is an INCLUSIVE list.  There are plenty of lists out there<br/>\nthat are slanted towards particular religious views, and in particular a<br/>\nlarge number of Christian Homeschooling lists.  I would like to see this<br/>\nlist remain open and welcoming to those of all faiths.  <br/>\n<br/>\nNanci K.</div>","specialLinks":[]},{"userId":0,"authorName":"Brynn Panchot","from":"&quot;Brynn Panchot&quot; &lt;panchot@...","replyTo":"LIST","senderId":"1Hzu7IuVryDTe2biTn81jOpBdyQafBNseh__i2I1CFHzYARYab2ssJ7ak8JfbLdKypQKEriTGukz3GUPmQsxLmFq71bHYqEChazgcbM","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: Influences /it&#39;s not really about pokemon","postDate":"947186509","msgId":5483,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4zNjIuNTQ4My45NTkyNjk3NDVAZUdyb3Vwcy5jb20+"},"prevInTopic":5477,"nextInTopic":5522,"prevInTime":5482,"nextInTime":5484,"topicId":5477,"numMessagesInTopic":0,"msgSnippet":"Thank you Susan! I couldn t agree more. Wonderful email. Brynn ... From: Thad Martin [mailto:tmartin@atiaustin.com] Sent: Thursday, January 06, 2000 2:18 AM ","messageBody":"<div id=\"ygrps-yiv-19168389\">Thank you Susan! I couldn&#39;t agree more. Wonderful email.<br/>\n<br/>\nBrynn<br/>\n  -----Original Message-----<br/>\n  From: Thad Martin [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:tmartin@...\">tmartin@...</a>]<br/>\n  Sent: Thursday, January 06, 2000 2:18 AM<br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@onelist.com\">Unschooling-dotcom@onelist.com</a><br/>\n  Subject: Re: [Unschooling-dotcom] Influences /it&#39;s not really about<br/>\npokemon<br/>\n<br/>\n<br/>\n  Corinna wrote:<br/>\n  To everyone who slammed Karol   You really oughta be ashamed of<br/>\nyourselves.<br/>\n  did i miss some e mail?  i only remember comments about the letter.<br/>\npersonally i&#39;m never ashamed i just learn from my mistakes.  could you point<br/>\nout what exactly people should be &#39;ashamed&#39; of?<br/>\n<br/>\n  &quot;Read, and decide for yourselves what you think.&quot;<br/>\n  and that&#39;s exactly what people did and they passed their opinions on to<br/>\nthe group.  sorry if it wasn&#39;t as &#39;pretty&#39; and polite as you would like but<br/>\nto &#39;slam&#39; others for &#39;slamming&#39; seems abit odd, to me it would be<br/>\ninteresting if you discussed the letter (as i feel other have been doing-<br/>\nunless i missed something)  rather than &#39;defend&#39; someone who is really not<br/>\nbeing attacked.   i feel that everyone has a right to express themselves<br/>\nlike someone said hit the delete- everyone has one.<br/>\n<br/>\n  there is nothing wrong with people disagreeing, to me differences of<br/>\nopinion are critical for a healthy community - just think how boring life<br/>\nwould be if we all agreed:)   also i do not recall any personal comments<br/>\nagainst karol just opinion stated about the letter- and again this has<br/>\nvirtually nothing to do with pokemon but is about the judgmental,<br/>\naggressive, and exclusive tone of the letter which karol merely passed on -<br/>\nshe did not write.  now she knows what a number of people think.  maybe a<br/>\ndifferent take on the letter will prove to be interesting.   i know if i<br/>\nsent something i personally would enjoy a different take hence &#39;do on to<br/>\nothers as you would have done on to you&#39;.   we read it and some of us<br/>\ndecided the position and argument was seriously flawed - that does not mean<br/>\nanyone is or is not endorsing pokemon.   in fact i believe those of us who<br/>\ndid have negative interpretation of the letter stated that the problem we<br/>\nsaw with pokemon was the commercialism - hardly glowing support.   and i<br/>\ndon&#39;t remember  anyone suggesting that karol no longer participate - it<br/>\nwould be silly to do that,  just that the topic was not appropriate and to<br/>\nbe fair the letter has a &#39;fire and brimstone&#39; preaching tone which is not<br/>\nexactly what this group is about.<br/>\n<br/>\n  She&#39;s not force-feeding anyone anything.  Maybe you personally didn&#39;t<br/>\nappreciate her post, but some of us did.<br/>\n  nor is anyone forcing you,  karol or anyone to read our comments,  if you<br/>\nfound something good in the letter hold on to it and pass it on if you are<br/>\nso moved, each individual voice is important.<br/>\n<br/>\n  Speak for yourself and yourself only.  You are one among many.<br/>\n  did someone speak for the whole group or did they express what they felt<br/>\nthe group was about?<br/>\n<br/>\n  How does it look when we, as homeschoolers, can&#39;t even get along amongst<br/>\nourselves?  United we stand, divided we fall.<br/>\n  the iroquios have a saying &#39;unity through diversity&#39;  so why can&#39;t our<br/>\ndiversity be accessible? what&#39;s wrong with just commenting on a topic<br/>\nwithout it being taken as a personal attack?  to me this is real strength.<br/>\nwhy is it that feedback can&#39;t be accepted if it&#39;s perceived as &#39;bad&#39;?   i,<br/>\nfor myself, learn a lot from failures, different points of view etc. and i<br/>\nthought that&#39;s what this is about-a forum to express ourselves and to hear<br/>\nother perspectives within the context of unschooling.  i don&#39;t feel the<br/>\nspirit of this has been lost and would encourage more people to introduce<br/>\nconcepts that they find intriguing and ask other members for their take on<br/>\nit.<br/>\n<br/>\n  God Bless. (If that offends anyone, TOUGH!)<br/>\n  how could your personal beliefs be offensive?  that would only happen it<br/>\nyou tried to force me to believe what you believe.  may you find some peace<br/>\nand compassion good luck to you<br/>\n<br/>\n  -susan<br/>\n  austin,tx<br/>\n<br/>\n<br/>\n----------------------------------------------------------------------------<br/>\n--<br/>\n<br/>\n<br/>\n  Please click above to support our sponsor<br/>\n<br/>\n<br/>\n----------------------------------------------------------------------------<br/>\n--<br/>\n  Message boards, timely articles, a free newsletter and more!<br/>\n  Check it all out at: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a></div>","specialLinks":[]},{"userId":0,"authorName":"Thad Martin","from":"Thad Martin &lt;tmartin@...","replyTo":"LIST","senderId":"7_CoPBcCVGF_ZeQWcI68Q4EnROapFa657qhi9GjTRfGWVnfjMI9q_LFe1o6_8P7UO5u3zsZ2Q2DkaHF9s0CdWrAbLObVXh75tWQ","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Influences /it&#39;s not really about pokemon","postDate":"947153908","msgId":5477,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4zNjIuNTQ3Ny45NTkyNjk3NDVAZUdyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":5483,"prevInTime":5476,"nextInTime":5478,"topicId":5477,"numMessagesInTopic":0,"msgSnippet":"Corinna wrote: To everyone who slammed Karol   You really oughta be ashamed of yourselves. did i miss some e mail?  i only remember comments about the letter. ","messageBody":"<div id=\"ygrps-yiv-811826324\">Corinna wrote:<br/>\n<br/>\nTo everyone who slammed Karol   You really oughta be ashamed of yourselves.<br/>\ndid i miss some e mail?  i only remember comments about the letter.<br/>\npersonally i&#39;m never ashamed i just learn from my mistakes.  could you point<br/>\nout what exactly people should be &#39;ashamed&#39; of?<br/>\n<br/>\n&quot;Read, and decide for yourselves what you think.&quot;<br/>\nand that&#39;s exactly what people did and they passed their opinions on to the<br/>\ngroup.  sorry if it wasn&#39;t as &#39;pretty&#39; and polite as you would like but to<br/>\n&#39;slam&#39; others for &#39;slamming&#39; seems abit odd, to me it would be interesting if<br/>\nyou discussed the letter (as i feel other have been doing- unless i missed<br/>\nsomething)  rather than &#39;defend&#39; someone who is really not being attacked.   i<br/>\nfeel that everyone has a right to express themselves like someone said hit the<br/>\ndelete- everyone has one.<br/>\n<br/>\nthere is nothing wrong with people disagreeing, to me differences of opinion<br/>\nare critical for a healthy community - just think how boring life would be if<br/>\nwe all agreed:)   also i do not recall any personal comments against karol<br/>\njust opinion stated about the letter- and again this has virtually nothing to<br/>\ndo with pokemon but is about the judgmental, aggressive, and exclusive tone of<br/>\nthe letter which karol merely passed on - she did not write.  now she knows<br/>\nwhat a number of people think.  maybe a different take on the letter will<br/>\nprove to be interesting.   i know if i sent something i personally would enjoy<br/>\na different take hence &#39;do on to others as you would have done on to you&#39;.<br/>\nwe read it and some of us decided the position and argument was seriously<br/>\nflawed - that does not mean anyone is or is not endorsing pokemon.   in fact i<br/>\nbelieve those of us who did have negative interpretation of the letter stated<br/>\nthat the problem we saw with pokemon was the commercialism - hardly glowing<br/>\nsupport.   and i don&#39;t remember  anyone suggesting that karol no longer<br/>\nparticipate - it would be silly to do that,  just that the topic was not<br/>\nappropriate and to be fair the letter has a &#39;fire and brimstone&#39; preaching<br/>\ntone which is not exactly what this group is about.<br/>\n<br/>\nShe&#39;s not force-feeding anyone anything.  Maybe you personally didn&#39;t<br/>\nappreciate her post, but some of us did.<br/>\nnor is anyone forcing you,  karol or anyone to read our comments,  if you<br/>\nfound something good in the letter hold on to it and pass it on if you are so<br/>\nmoved, each individual voice is important.<br/>\n<br/>\nSpeak for yourself and yourself only.  You are one among many.<br/>\ndid someone speak for the whole group or did they express what they felt the<br/>\ngroup was about?<br/>\n<br/>\nHow does it look when we, as homeschoolers, can&#39;t even get along amongst<br/>\nourselves?  United we stand, divided we fall.<br/>\nthe iroquios have a saying &#39;unity through diversity&#39;  so why can&#39;t our<br/>\ndiversity be accessible? what&#39;s wrong with just commenting on a topic without<br/>\nit being taken as a personal attack?  to me this is real strength.   why is it<br/>\nthat feedback can&#39;t be accepted if it&#39;s perceived as &#39;bad&#39;?   i, for myself,<br/>\nlearn a lot from failures, different points of view etc. and i thought that&#39;s<br/>\nwhat this is about-a forum to express ourselves and to hear other perspectives<br/>\nwithin the context of unschooling.  i don&#39;t feel the spirit of this has been<br/>\nlost and would encourage more people to introduce concepts that they find<br/>\nintriguing and ask other members for their take on it.<br/>\n<br/>\nGod Bless. (If that offends anyone, TOUGH!)<br/>\nhow could your personal beliefs be offensive?  that would only happen it you<br/>\ntried to force me to believe what you believe.  may you find some peace and<br/>\ncompassion good luck to you<br/>\n<br/>\n-susan<br/>\naustin,tx</div>","specialLinks":[]}],"prevTopicId":5511,"nextTopicId":5501}}