{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":9,"messages":[{"userId":0,"authorName":"Evalsquid@aol.com","from":"Evalsquid@...","replyTo":"LIST","senderId":"GFMOqnmvPjg2_LWh-BbG6og5sqjP7YfdM2a8Tf2ncMVdh21aUgzZ4dQmi7iIscw6gRqYOjvgIcw","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: unschooling highschoolers","postDate":"929996112","msgId":1212,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy45MS4xMjEyLjk1OTI2OTc0MEBlR3JvdXBzLmNvbT4="},"prevInTopic":1208,"nextInTopic":0,"prevInTime":1211,"nextInTime":1213,"topicId":1173,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/21/99 7:50:10 AM Pacific Daylight Time, ... I work in an umbrella homeschool organization and we have enrollees from all over the country","messageBody":"<div id=\"ygrps-yiv-1374698728\">In a message dated 6/21/99 7:50:10 AM Pacific Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:tn-k4of5@...\">tn-k4of5@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Anyone know some examples of what types of activities<br/>\n&gt;  kids are allowed to partake in?  Does this extend to the highschool level?<br/>\n<br/>\n </span></blockquote>I work in an umbrella homeschool organization and we have enrollees from all <br/>\nover the country (and world) for what is essentially a correspondence course <br/>\nin our high school program.  Some of my students do take classes or <br/>\nparticipate in activities at their local ps.  As far as I can tell, it&#39;s <br/>\nentirely up to each district to decide whether they&#39;re going to allow it and <br/>\nwhat exactly they&#39;ll allow.<br/>\n<br/>\nAs to the other part of the discussion, I can tell you the reasons I hear <br/>\nmost often from parents who previously hs&#39;d entirely on their own (but they <br/>\nare almost always hser&#39;s not unschoolers) as to why they decided to enroll <br/>\nwith us for high school:<br/>\n1.  Wanting a transcript/grades from an outside source of classes (for <br/>\ncollege)<br/>\n2.  Feeling that their child(ren) need to be accountable to someone outside <br/>\nthe family<br/>\n3.  Feeling unable to teach one or more classes (we don&#39;t teach in a <br/>\nday-to-day sense, but we do evaluate work)<br/>\n4.  Wanting a diploma (sometimes for college, but sometimes just because the <br/>\nstudent wants a formal recognition)<br/>\n<br/>\nAs to what colleges look for, that also seems to vary.  When parents ask me <br/>\nabout this, I always tell them to contact the colleges they&#39;re interested in <br/>\nand ask.  <br/>\n<br/>\nElizabeth</div>","specialLinks":[]},{"userId":0,"authorName":"Carol E. Burris","from":"&quot;Carol E. Burris&quot; &lt;excaliburris@...&gt;","replyTo":"LIST","senderId":"2xj_MMK4QbmeonHjcln_U3KESsz28VNQare8IkGAhdkjKg5pGohsqfVx25I5kW7WhW5-MllrCI2Ld7oi9hh4K_1P3Vsv6PA3oelLr7JYGcKlYxz3Ug","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: unschooling highschoolers","postDate":"929980386","msgId":1208,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy45MS4xMjA4Ljk1OTI2OTc0MEBlR3JvdXBzLmNvbT4="},"prevInTopic":1206,"nextInTopic":1212,"prevInTime":1207,"nextInTime":1209,"topicId":1173,"numMessagesInTopic":0,"msgSnippet":"... For what it s worth, I don t think high school GPAs are that important anymore, unless they are going to a school that the particular college admission","messageBody":"<div id=\"ygrps-yiv-1024418324\">Thomas and Nanci Kuykendall wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Another issue no one has mentioned is college entrance.  There are quite a<br/>\n&gt; number of colleges that also look at highschool GPA&#39;s to guage student<br/>\n&gt; entrance qualifications.<br/>\n<br/>\n </span></blockquote>For what it&#39;s worth, I don&#39;t think high school GPAs are that important anymore,<br/>\nunless they are going to a school that the particular college admission office<br/>\nis familiar with.  Grade inflation and multiple grading systems (4 point<br/>\nsystem? or 5 or 6 point system that they use around here?) makes GPAs often<br/>\nmeaningless for admissions folks.  DH serves on some admission committees for<br/>\nprofessional students (post bachelor&#39;s degree) and they don&#39;t give too much<br/>\nweight to GPAs because they really aren&#39;t comparable from school to school. The<br/>\nboard scores make more of an impact.<br/>\n<br/>\nThat being said, my daughter was admitted to her first choice college on the<br/>\nvery day she took the SATs, so her scores weren&#39;t considered at all.  However,<br/>\nshe had interviewed and they knew she was a homeschooler.  The other colleges<br/>\nthat accepted her waited for her SAT scores.  But then she decided not to go to<br/>\ncollege, but that&#39;s another story.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; However, I am wondering something.  I heard that kids are allowed to<br/>\n&gt; participate in certain school activites in their district even if they are<br/>\n&gt; not enrolled in the school system.  Anyone know some examples of what types<br/>\n&gt; of activities kids are allowed to partake in?  Does this extend to the<br/>\n&gt; highschool level?<br/>\n<br/>\n </span></blockquote>As to this, it is my understanding that depends on where you live.  Supposedly<br/>\nit is true here (south Florida) but I don&#39;t personally know of anyone doing it.<br/>\nIt&#39;s a fairly recent law change here.<br/>\n<br/>\nCarol<br/>\n<br/>\nFriend of Ishmael<br/>\nThe world shines bright with endless possibilities each time a child is born.</div>","specialLinks":[]},{"userId":0,"authorName":"Thomas and Nanci Kuykendall","from":"Thomas and Nanci Kuykendall &lt;tn-k4of5@...&gt;","replyTo":"LIST","senderId":"5k8pLX6NkFd9sGk9rQkJf5LRU8zLYD0PwstnIeCfcdnv29X6ZECXUea7AS6nvJaomswWsZTg4o3VNJANDtf0WCgvU8BIZTXbpyRzzlC8Lfw0hTdSqiXzSyY","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: unschooling highschoolers","postDate":"929976994","msgId":1206,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy45MS4xMjA2Ljk1OTI2OTc0MEBlR3JvdXBzLmNvbT4="},"prevInTopic":1205,"nextInTopic":1208,"prevInTime":1205,"nextInTime":1207,"topicId":1173,"numMessagesInTopic":0,"msgSnippet":"... One thing that seems to loom largely in some parents mind in my ... Another issue no one has mentioned is college entrance.  There are quite a number of","messageBody":"<div id=\"ygrps-yiv-1928766927\">At 08:27 AM 6/21/99 -0400, you wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;From: &quot;Carol E. Burris&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:excaliburris@...\">excaliburris@...</a>&gt;<br/>\n&gt;<br/>\n&gt;Kathy,<br/>\n&gt;<br/>\n </span></blockquote> One thing that seems to loom largely in some parents mind in my<br/>\n<blockquote><span title=\"ireply\"> &gt;experience which no one else has touched on here is the issue of<br/>\n&gt;high school credits.  <br/>\n&gt;So, if there is any chance that the child might enter high school<br/>\n&gt;at some point, there has to be some way to account for credits<br/>\n&gt;earned or they will end up repeating the missed grades.  So,<br/>\n&gt;parents may opt to send their kids to high school to avoid that<br/>\n&gt;problem.  <br/>\n&gt;Carol<br/>\n<br/>\n </span></blockquote>Another issue no one has mentioned is college entrance.  There are quite a<br/>\nnumber of colleges that also look at highschool GPA&#39;s to guage student<br/>\nentrance qualifications.  There is also the fact that better highschools<br/>\nhave a number of sports and extra cirricular activities that kids may not<br/>\nbe able to participate in elsewhere.  For example:  School Newspapers,<br/>\nStudent Body government, Fencing Teams, School Dances, Use of lab<br/>\nfacitlities for Science projects, Photography Darkroom facilities, Drama<br/>\nClub stage productions, Cheerleading Teams and competitions, Gymnastics<br/>\nteams and competitions, Debate Teams, Football teams, Basketball teams, and<br/>\nothers I can&#39;t think of right now.  I realize that many of these might be<br/>\navailable in forms outside of school for those who live in larger areas.<br/>\nBut for those of you who, like me, live in a town of 40-50,000 or less the<br/>\noptions are limited and the one your child is interested in may not be<br/>\navailable anywhere besides school.<br/>\n<br/>\nOf course, when my kids reach highschool we may be living in a larger city,<br/>\nor there may be other options available here at that time, or they may not<br/>\nbe interested in any of the activities that they do not have access to.  So<br/>\nI can&#39;t spend too much energy worrying about that now.  However, I am<br/>\nwondering something.  I heard that kids are allowed to participate in<br/>\ncertain school activites in their district even if they are not enrolled in<br/>\nthe school system.  Anyone know some examples of what types of activities<br/>\nkids are allowed to partake in?  Does this extend to the highschool level?<br/>\nObviously they could not be in Student Government, but what about School<br/>\nSports Teams, Cheerleading and dances?  It seems that these in particular<br/>\nwould be focused on the student body only.  I know that there are many<br/>\nschools that do not allow non-students to go to dances at all, even as a<br/>\nstudent&#39;s date, and I also know there there are some schools that do not<br/>\nallow non-students on the school campus at all.  Anyone have any<br/>\ninformation about this?<br/>\n<br/>\nNanci K. in Idaho</div>","specialLinks":[]},{"userId":0,"authorName":"Carol E. Burris","from":"&quot;Carol E. Burris&quot; &lt;excaliburris@...","replyTo":"LIST","senderId":"UlBpU2fNHG4gSNoaPLcV96SVDsnQ1vtxqnrEEK5duEXCUn6zDvhrOYN2NDnSFgrLSnxT7c-9x7gDsApzW0GyxtpgDPBuU2yy7_gEx29HJE6xEzXDdA","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: unschooling highschoolers","postDate":"929968046","msgId":1205,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy45MS4xMjA1Ljk1OTI2OTc0MEBlR3JvdXBzLmNvbT4="},"prevInTopic":1201,"nextInTopic":1206,"prevInTime":1204,"nextInTime":1206,"topicId":1173,"numMessagesInTopic":0,"msgSnippet":"Kathy, I think that your experience, with not finding many high school aged homeschoolers much less unschoolers, is common.  There are many reasons for this.","messageBody":"<div id=\"ygrps-yiv-1359628883\">Kathy,<br/>\n<br/>\nI think that your experience, with not finding many high school<br/>\naged homeschoolers much less unschoolers, is common.  There are<br/>\nmany reasons for this.  As phone contact for high school<br/>\nhomeschooling for my local support group (and mother of two high<br/>\nschool aged unschoolers myself) I have heard a lot of them.  One<br/>\nthing that seems to loom largely in some parents mind in my<br/>\nexperience which no one else has touched on here is the issue of<br/>\nhigh school credits.  Up until high school, parents can feel that<br/>\nhomeschooling is a year by year decision; if it doesn&#39;t work out,<br/>\nthey can always go back to school.  In my state, and I suspect<br/>\nit&#39;s true in most states, high school is different.  The state<br/>\nsays they have to have a certain number of credits to graduate.<br/>\nSo, if there is any chance that the child might enter high school<br/>\nat some point, there has to be some way to account for credits<br/>\nearned or they will end up repeating the missed grades.  So,<br/>\nparents may opt to send their kids to high school to avoid that<br/>\nproblem.  Or, they may chose to work with an umbrella school such<br/>\nas Clonlara, Oak Meadow, and all the rest  to have documentation<br/>\nof their child&#39;s work.  This generally leads to more structure.<br/>\nEach family has to do what is right for them.<br/>\n<br/>\nBut, you are not alone and there are others of us out here who<br/>\ncontinue to successful unschool throughout the high school<br/>\nyears.  However, you are also not alone in finding it<br/>\nincreasingly difficult to find local, compatible families with<br/>\nkids near your kids ages.  And we live in the middle of 5 million<br/>\npeople....<br/>\n<br/>\nCarol<br/>\n<br/>\nCarol Burris<br/>\nFriend of Ishmael<br/>\nThe world shines bright with endless possibilities each time a<br/>\nchild is born.</div>","specialLinks":[]},{"userId":0,"authorName":"Squeaksoup@xxx.xxx","from":"Squeaksoup@...","replyTo":"LIST","senderId":"E-XCWuJnepiI5cWFl024FVL5zbhYoGrYAo1Sz1ZiqttcaTPlNLXrIQW1SLqca0SS0vgz4pDbQd_A","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: unschooling highschoolers","postDate":"929900221","msgId":1201,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy45MC4xMjAxLjk1OTI2OTc0MEBlR3JvdXBzLmNvbT4="},"prevInTopic":1186,"nextInTopic":1205,"prevInTime":1200,"nextInTime":1202,"topicId":1173,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/18/99 01:18:35 AM, vthiesse@connect.ab.ca writes: ","messageBody":"<div id=\"ygrps-yiv-1345527221\">In a message dated 6/18/99 01:18:35 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:vthiesse@...\">vthiesse@...</a> writes:<br/>\n<br/>\n&lt;&lt; I left my wonderful hs support group last week feeling very discouraged and<br/>\nnumb. So many of the kids who are my oldest girl&#39;s age are going back to<br/>\nschool. If they are not returning to school they are becoming much more<br/>\nstructured in their learning in preparation for &quot;real life&quot; (as in<br/>\nuniversity or jobs). &gt;&gt;<br/>\n<br/>\nMy oldest daughters are almost 11 and 14.  I too believe strongly in <br/>\nunschooling, but I understand what you&#39;re saying.  I also think &quot;outside <br/>\npressure&quot; increases at the high school level.  Most people I think accept <br/>\nhomeschooling in the early years but at high school most I think assume <br/>\n&quot;well, of course you&#39;ll send them to school.&quot;  Again I believe that your <br/>\nheart/intuition is telling you you&#39;re doing the right thing.  I know I am.  <br/>\nMy girls and I love being together (I have three younger kids, too) and this <br/>\ntime together will come to an end only too soon.  I hope this has helped.  <br/>\nMaybe your girls would like penpals?  My girls I know would love to <br/>\ncorrespond.  Let me know.  By the way, where are you from?  Have you ever <br/>\nbeen to a Clonlara or GWS conference?  They are very affirming and <br/>\nempowering.  Also Cafi Cohen&#39;s web site talks a lot about older kids.  Kimme</div>","specialLinks":[]},{"userId":0,"authorName":"Thomas and Nanci Kuykendall","from":"Thomas and Nanci Kuykendall &lt;tn-k4of5@...&gt;","replyTo":"LIST","senderId":"vrLYiVYsG6GYnYl8_F8CII_OzRJ2hk-yyA0DsJ8xcTWohFbkXmo8wTMfFFKRAEliODakWAu_TIMp2F-X_mCWMKNsB3VYcgblsrI1r75LEzpJXoBvkW2X2jI","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: unschooling highschoolers","postDate":"929736669","msgId":1186,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy44OC4xMTg2Ljk1OTI2OTc0MEBlR3JvdXBzLmNvbT4="},"prevInTopic":1178,"nextInTopic":1201,"prevInTime":1185,"nextInTime":1187,"topicId":1173,"numMessagesInTopic":0,"msgSnippet":"... So many of the kids who are my oldest girl s age are going back to ... Since when is the school system like the real world?  How many people find ","messageBody":"<div id=\"ygrps-yiv-1129050911\">At 11:09 PM 6/17/99 -0600, you wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:vthiesse@...\">vthiesse@...</a><br/>\n </span></blockquote> So many of the kids who are my oldest girl&#39;s age are going back to<br/>\n<blockquote><span title=\"ireply\"> &gt;school. If they are not returning to school they are becoming much more<br/>\n&gt;structured in their learning in preparation for &quot;real life&quot; (as in<br/>\n&gt;university or jobs).<br/>\n&gt;Kathy Thiessen<br/>\n<br/>\n </span></blockquote>Since when is the school system like the real world?  How many people find<br/>\nthemselves in similar social situations in their adult life?  Even<br/>\nuniversity life is very unlike ps.  The people in universities range in<br/>\nages and life conditions (parents, working, fresh out of ps, etc) and are<br/>\nthere mostly because they want to be.  They have to pay for the privelege,<br/>\nand the instructors are, for the most part, aware of this and treat their<br/>\nstudents in an adult and respectful manner.  <br/>\n<br/>\nAnyone have a job, or know of anyone who does, that is even remotely like<br/>\nthe situation in ps?  I don&#39;t think there are very many, if any at all.<br/>\nUnless you are talking about people who hate their jobs and/or have bosses<br/>\nwho treat them as sub-human, (a line of conversation that is also currently<br/>\nbeing bandied about here,) and do we really want our kids preparing for<br/>\nTHAT?  <br/>\n<br/>\nStill, that only covers parent-student relations, which as we all know are<br/>\nonly a fraction of the ps social curriculum.  How many people eat lunch<br/>\nevery day in a really bad cafateria with hundereds (or thousands) of<br/>\nothers, given a choice?  How many people even interact with those size<br/>\ncrowds on a daily basis if they are not celebrities, politicians, public<br/>\nspeakers or other minorities who make their living in the public eye?<br/>\nThose professions are chosen, and they work with crowds because they love<br/>\nthe work, or because it is a symptom of the job that is unavoiable, and ps<br/>\ncannot prepare you for that kind of exposure anyway.  Many people in those<br/>\nprofessions (most of whom were educated in ps) crack under the pressure, or<br/>\nare crucified by the public for their human failings.  <br/>\n<br/>\nI have heard the same arguments from friends about ps preparing you for<br/>\n&quot;real life,&quot; and I would like to know HOW exactly it accomplishes this.<br/>\nDoes anyone know in what ways ps prepares you for the &quot;real world&quot;???  I<br/>\nhave a problem with those phrases too, &quot;real life&quot; and &quot;real world.&quot;<br/>\nPublic School, for almost everyone, even successful students, is one of the<br/>\nhardest things they will ever do.  It is more stressful, degrading,<br/>\ntiresome, tortuous, and emotionally battering than most things you will do<br/>\nin life.  Is this supposed to be a trial by fire for our young, fragile and<br/>\nimpressionable kids?  Or are they supposed to come to expect this from the<br/>\nrest of their &quot;real lives??&quot;<br/>\n<br/>\nPlease excuse the tirade, but we are in the middle of our adoption<br/>\nhomestudy paperwork and they keep asking us for essay answers on what our<br/>\nphilosphy and beliefs are on child rearing, education, and culture.  These<br/>\nissues, while always important, are close to the surface for me right now,<br/>\nand come welling up readily with the least provocation!  ;-)<br/>\n<br/>\nNanci K. in Idaho</div>","specialLinks":[]},{"userId":0,"authorName":"::she just is::","from":"&quot;::she just is::&quot; &lt;OmegaMolecule@...&gt;","replyTo":"LIST","senderId":"hiroGdM6O3C93CU7yHUU600EmUBJUe9XW0irrj3TWC7W-F6ZbwqBiiAKl-EX7VcvaGVwbDMhZrlew2FmWGPFHsB_5s-a9pRmCfQbhbYO4TzhjvVhUmQ","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: unschooling highschoolers","postDate":"929718733","msgId":1178,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy44OC4xMTc4Ljk1OTI2OTc0MEBlR3JvdXBzLmNvbT4="},"prevInTopic":1175,"nextInTopic":1186,"prevInTime":1177,"nextInTime":1179,"topicId":1173,"numMessagesInTopic":0,"msgSnippet":"Hi Kathy, I know a lot of teen unschoolers, as well as some who are adults or almost. One of my best friends, Margaret, has been an unschooler for years and","messageBody":"<div id=\"ygrps-yiv-155659645\">Hi Kathy,<br/>\n<br/>\nI know a lot of teen unschoolers, as well as some who are adults or almost.<br/>\nOne of my best friends, Margaret, has been an unschooler for years and has<br/>\ndecided she&#39;d like to travel to various places of the world (she just got<br/>\nback from France). Another person I know has been unschooled all his life<br/>\nand is now doing professional webpage designing.<br/>\n<br/>\nHowever, I do believe there are ways to get a high school diploma and still<br/>\nstick to the unschooling thing. I&#39;ve heard good things about clonlara (sp?),<br/>\nwhich is a school that&#39;s supportive of the home/unschooling style -- I<br/>\nbelieve you can get a diploma through there. Also, if your kids want to get<br/>\ninto college, they could take a GED test, which would be the equivalent of a<br/>\ndiploma.<br/>\n<br/>\nHope this helps!<br/>\n<br/>\n~Eryn, fifteen-year-old unschooler<br/>\n<br/>\n==<br/>\n&quot;I dreamed I was a butterfly, flitting around in the sky;<br/>\nthen I awoke. Now I wonder: Am I a man who dreamt of<br/>\nbeing a butterfuly, or am I a butterfly dreaming that I am<br/>\na man?&quot; - Chuang Tsu<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.camenaworks.com/Eryn/\">http://www.camenaworks.com/Eryn/</a><br/>\n#24591173  ::she just is::<br/>\nAIM ::  Opal Fayre<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt;Hi, I&#39;m new to this on-line business, but I have kept up on the reading for<br/>\n&gt;5 days!  I have hsed my two daughters for 5 years (that excluded 3 years in<br/>\n&gt;Germany where hs is definitely illegal, but that&#39;s another story). They are<br/>\n&gt;now aged 12 and 14.<br/>\n&gt;<br/>\n&gt;I left my wonderful hs support group last week feeling very discouraged and<br/>\n&gt;numb. So many of the kids who are my oldest girl&#39;s age are going back to<br/>\n&gt;school. If they are not returning to school they are becoming much more<br/>\n&gt;structured in their learning in preparation for &quot;real life&quot; (as in<br/>\n&gt;university or jobs).<br/>\n&gt;<br/>\n&gt;I rebel against that while at the same time I second-guess my gut reaction<br/>\n&gt;that there has got to be a way to continue the way we have learned for 5<br/>\n&gt;years (mostly unschooling with a little structure for math). I know that<br/>\n&gt;there are others out there that have unschooled all they way through and<br/>\n&gt;still &quot;made it&quot; in the real world.<br/>\n&gt;<br/>\n&gt;Is there anyone out there that can help an anxious mother over another<br/>\n&gt;anxiety attack!!<br/>\n&gt;<br/>\n&gt;Kathy Thiessen </span></blockquote></div>","specialLinks":[]},{"userId":0,"authorName":"Andi Kaufman","from":"Andi Kaufman &lt;tl2b@...","replyTo":"LIST","senderId":"-i-KsKWkU1YMbt_omZsrLh1_jlqx6yOI8Zl_lsjIf3IjjHuel0mqqENE2xYRzMEPfN5Bvbg3YIUAiaRXcvbKTfHV9kXpbhYQow","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: unschooling highschoolers","postDate":"929706797","msgId":1175,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy44OC4xMTc1Ljk1OTI2OTc0MEBlR3JvdXBzLmNvbT4="},"prevInTopic":1173,"nextInTopic":1178,"prevInTime":1174,"nextInTime":1176,"topicId":1173,"numMessagesInTopic":0,"msgSnippet":"... Are your kids wanting the structure too. if not then dont worry. They may not be intersted in it at all. And if they really want to. well isnt that the","messageBody":"<div id=\"ygrps-yiv-284190133\">kathy wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;I rebel against that while at the same time I second-guess my gut reaction<br/>\n&gt;that there has got to be a way to continue the way we have learned for 5<br/>\n&gt;years (mostly unschooling with a little structure for math). I know that<br/>\n&gt;there are others out there that have unschooled all they way through and<br/>\n&gt;still &quot;made it&quot; in the real world.<br/>\n&gt;<br/>\n&gt;Is there anyone out there that can help an anxious mother over another<br/>\n&gt;anxiety attack!!<br/>\n<br/>\n<br/>\n </span></blockquote>Are your kids wanting the structure too. if not then dont worry. They may<br/>\nnot be intersted in it at all. And if they really want to. well isnt that<br/>\nthe point of homeschooling. to me it is. the kids get to choose too.<br/>\n<br/>\nAndi...domestic goddess and active volunteer<br/>\n\t  mom to Isaac<br/>\n\t  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:tl2b@...\">tl2b@...</a><br/>\n<br/>\nNever Underestimate the Power of This Woman!</div>","specialLinks":[]},{"userId":0,"authorName":"vthiesse@xxxxxxx.xx.xx","from":"vthiesse@...","replyTo":"LIST","senderId":"KBy8pAFlQv9p1ZoLyKZxYM5VnSofnWotmXB8zF21T3jzeK2WYOTla2XcUtZ1bZ18ZO4f14huHiHefobITg","spamInfo":{"isSpam":false,"reason":"0"},"subject":"unschooling highschoolers","postDate":"929682554","msgId":1173,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy44Ny4xMTczLjk1OTI2OTc0MEBlR3JvdXBzLmNvbT4="},"prevInTopic":0,"nextInTopic":1175,"prevInTime":1172,"nextInTime":1174,"topicId":1173,"numMessagesInTopic":0,"msgSnippet":"Hi, I m new to this on-line business, but I have kept up on the reading for 5 days!  I have hsed my two daughters for 5 years (that excluded 3 years in Germany","messageBody":"<div id=\"ygrps-yiv-474890505\">Hi, I&#39;m new to this on-line business, but I have kept up on the reading for<br/>\n5 days!  I have hsed my two daughters for 5 years (that excluded 3 years in<br/>\nGermany where hs is definitely illegal, but that&#39;s another story). They are<br/>\nnow aged 12 and 14.<br/>\n<br/>\nI left my wonderful hs support group last week feeling very discouraged and<br/>\nnumb. So many of the kids who are my oldest girl&#39;s age are going back to<br/>\nschool. If they are not returning to school they are becoming much more<br/>\nstructured in their learning in preparation for &quot;real life&quot; (as in<br/>\nuniversity or jobs).<br/>\n<br/>\nI rebel against that while at the same time I second-guess my gut reaction<br/>\nthat there has got to be a way to continue the way we have learned for 5<br/>\nyears (mostly unschooling with a little structure for math). I know that<br/>\nthere are others out there that have unschooled all they way through and<br/>\nstill &quot;made it&quot; in the real world.<br/>\n<br/>\nIs there anyone out there that can help an anxious mother over another<br/>\nanxiety attack!!<br/>\n<br/>\nKathy Thiessen</div>","specialLinks":[]}],"prevTopicId":1198,"nextTopicId":1213}}