{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"reading, deschooling, choices, joy","postDate":"1102096152","msgId":101481,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVBMTkwQzBBLjEwN0E4NjJDLjBDOEQ0NUE4QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":101480,"nextInTime":101482,"topicId":101481,"numMessagesInTopic":0,"msgSnippet":"-=-… because he refuses to write unless it is important to him.-=- Good.  Everyone should refuse to do ANYTHING that’s not  important. -=-What do people","messageBody":"<div id=\"ygrps-yiv-1441265436\">-=-… because he refuses to write unless it is important to him.-=-<br/>\n<br/>\nGood.  Everyone should refuse to do ANYTHING that’s not  important.<br/>\n<br/>\n-=-What do people write<br/>\nwhen they have no reason to write, I wonder? That&#39;s just silly.-=-<br/>\n<br/>\nYes, exactly.  It’s just schoolish and thought-free.<br/>\nWhen people have no reason to write they write about things like the major exports of Peru or the major rivers of China.<br/>\n<br/>\n-=-Now wait a minute! &lt;g&gt; I just finished trying to do NaNoWriMo - <br/>\ntrying to write 50,000 words in the month of November, just because.-=-<br/>\n<br/>\nJust because you WANTED to.  That’s a good reason.<br/>\n<br/>\n-=-Topics about curriculum and programs and step by step reading manuals were mentioned.-=-<br/>\n<br/>\nYou might tell him that’s for assembly line learning and your children are not on a mass assembly line.  <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/reading\">http://sandradodd.com/reading</a> has lots of moms’ stories of late but  happy readers.  And nearly-all-of-a-sudden readers.<br/>\n<br/>\n-=-That&#39;s going ok although my 8 y.o. dd is asking why she has <br/>\nto read. Hmm.-=-<br/>\n<br/>\nI hope you’re not telling her she has to read.  “Have to” is the death of choice and of “want to.”<br/>\n<br/>\n-=-What is <br/>\nbugging me, though, is their desire to watch cartoons, staring <br/>\nblankly at the tv. Perhaps I am the one who needs some deschooling <br/>\nbut I find myself encouraging other activities, i.e. using the <br/>\ncomputer.-=-<br/>\n<br/>\nI think having a mother who thinks a child is “staring blankly” is worse than any cartoon.<br/>\nAnd I seriously doubt they’re “staring blankly.”  <br/>\n<br/>\n“Using the computer” can be seen as “staring blankly,” and the idea that any computer is better than any TV is a prejudice one would do well to dump.   <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/tv\">http://sandradodd.com/tv</a> (read the Gilligan’s Island thing, which is very short)<br/>\n<br/>\n-=I guess I need a good book to give me direction or maybe a way to <br/>\ndeschool myself.-=-<br/>\n<br/>\nMaybe the idea that you “need a good book to give you direction” is another prejudice to get over.<br/>\n<br/>\nWhy read a book that was written years ago when you can correspond with people who are unschooling their real kids NOW, today?  Here’s an ever-growing collection of sorted-by-subject accounts by real unschoolers:    <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandraoddd.com/unschooling\">http://sandraoddd.com/unschooling</a><br/>\nAnd here’s an article on my thoughts about my own kids not  being the book-junkies I was as a kid:  <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/bookandsax\">http://sandradodd.com/bookandsax</a><br/>\nHere, many deschooling ideas and links:  <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/deschooling\">http://sandradodd.com/deschooling</a><br/>\n<br/>\n-=-Is it NOT an unschooling idea <br/>\nto let them follow their interests, like with my 8 y.o.? She loves anything about planets and the solar system. We&#39;ve put glow-in-the-dark constellations on her ceiling, hung the planets on the ceiling and I thought her wanting to pick out books at the library was the right thing to do.-=-<br/>\n<br/>\nThere’s no one “the right thing.”  Why just books?  What’s wrong with videos or the internet?   There are WONDERFUL space sites.  What you’ve done is what  school might have done.  Hang up planets and get books.  That’s a very small bit of a very large universe.  And what about the sky itself?  Is there an observatory in your town or do you have a telescope?  Do you have a calendar that shows phases of the moon?<br/>\n<br/>\n-=-don&#39;t think I&#39;m going over-board following their interests. Katie says she&#39;s had enough of solar system for now. That happens to be an interest of mine also but if she&#39;s had enough, we&#39;re done! :-)-=-<br/>\n<br/>\nIf your happiness depends on her interest, or when she has had enough you consider that you’re BOTH done (even though it’s an interest of yours too), then that is more than just going overboard.  It’s co-dependency.  It will help you move more quickly toward really understanding and trusting natural learning for you to separate your own interests and successes from hers.  If she’s had enough, you don’t have to “be done’ at all.  And you are NEVER “done” with an interest.  Your “unit” on the solar system will continue until you die or Alzheimer’s take you or the world ends.  Hers too.  And they’re not “the same unit” or the same set of interests or experiences.<br/>\n<br/>\n-=-I&#39;m the bad guy for &quot;giving them everything they <br/>\nwant&quot; and spoiling them.-=-<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/spoiled\">http://sandradodd.com/spoiled</a><br/>\nYou might read that and steal the good parts for your own arguments.  Feel free!<br/>\n<br/>\nMy kids are not needy.  It’s wonderful.  They can easily say “no thanks” to things I would have (and most kids will) JUMP at.  They have no desperation for food or experiences or attention.  They’re willing to share and to wait, because they have had so much and they have every expectation there will be enough for them.  Abundance.  A $2 box of pastries will do WAY less damage than a negative message from a parent.  And no therapist on the earth works for $2.  Look how much you save by providing abundance now and avoiding therapy later!<br/>\n<br/>\n-=-Tired from working alone I get cranky during the day which spoils the positive space. They on the other hand are happily watching the next show cuz they love it.-=-<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/chores\">http://sandradodd.com/chores</a><br/>\nOther people have said it better than I can.  <br/>\n<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":101478,"nextTopicId":101468}}