{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":132394532,"authorName":"Have a Nice Day!","from":"Have a Nice Day! &lt;litlrooh@...&gt;","profile":"litlrooh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"My interests, was Moms doing what they want","postDate":"1051762142","msgId":67069,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNDIwMWMzMGY5NyQ2NjM3ZmYxMCQ3YjdlNTI0NEBhby5sb3AuY29tPg==","referencesHeader":"PEJBWTQtRjQwWm9sbVJCYVlGa3UwMDAwZDc1Y0Bob3RtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":67068,"nextInTime":67070,"topicId":67069,"numMessagesInTopic":0,"msgSnippet":"***I have tons of interests other than my family. But if you mean an interest by something I regularly do outside of the house without my children and husband,","messageBody":"<div id=\"ygrps-yiv-1785068520\">***I have tons of interests other than my family. But if<br/>\nyou mean an interest by something I regularly do outside of the house<br/>\nwithout my children and husband, then no, I have none.***<br/>\n<br/>\n<br/>\nThis would describe me too.  Right now, my favorite things to do is read and write email LOL, but then socializing was always a favorite for me.  I love to look things up on the web.  That is how I pursue my interests.  I spent 2 years instensely studying Christianity and Judaism that way.  <br/>\n<br/>\nI&#39;ve met friends in person who I got to know online...that was a FAVORITE.  I just wish I could SEE them more often!<br/>\n<br/>\nWhen my mom moved to NM, I went there twice to check it out.  Quite a difference from PA, but interesting that it has many different climates in one state.<br/>\n<br/>\nI have done other things throughout the years:  I finished my college degree through Excelsior College (when it was Regents).  I work outside the home part time doing something I love.  <br/>\n<br/>\nI have started reading books because I&#39;m tired of what is on tv (though I LOVE the sci fi channel!!). <br/>\nI&#39;m currently waiting for my order of the Mathematical Sorcery and the Mathematical Mysteries book from Amazon because I&#39;m anxious to read what you guys were raving about.  I love historical fiction.<br/>\n<br/>\nI exercise more starting about 2 weeks ago.  I was a vegetarian for a year.  I love science and nature.<br/>\n<br/>\nI love swimming in the summer and basking in the sun.  I like to take walks, though not all the time.<br/>\n<br/>\nI like being a Girl Scout leader, but I&#39;m glad I&#39;m the *assistant*!!!<br/>\n<br/>\nHow has all of this affected my kids?  They like many of the same things I do, except reading and math right now.  They are into the internet with all of its perks right now and they do lots of their own research into things they like...just like I do.<br/>\n<br/>\nThey like to exercise with me.  THey like being in the sun and going for walks, and going places.  THey love NM.  They learned about healthy eating and why many people are vegetarians.  They learned about nutrition.  They are active, healthy, and sociable (except as I mentioned in another post, when my son crosses the line of being appropriate!!).  He&#39;s trying to be funny but he&#39;s shooting himself in the foot.  (I hope he grows out of that if he&#39;s not going to listen to me!)<br/>\n<br/>\nOh well...sorry to ramble on.  But sometimes its good to take inventory in the midst of life&#39;s business and see just what I *have* been doing!!!<br/>\n<br/>\nKristen<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":66821,"nextTopicId":2428}}