{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":62434209,"authorName":"jenstarc4","from":"&quot;jenstarc4&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: dying hair","postDate":"1181964948","msgId":29334,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY0dmxxaytobzU0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwMTcwMWM3YWZhOSQwYzMwNjMyMCQ2NDAxYThjMEBXSUZFPg=="},"prevInTopic":29331,"nextInTopic":0,"prevInTime":29333,"nextInTime":29335,"topicId":29313,"numMessagesInTopic":0,"msgSnippet":"... behavior (I m ... decision that ... Well this conversation was just read over my shoulder by my 13 yo dd.  Boy did she have plenty to say on the subject.","messageBody":"<div id=\"ygrps-yiv-1525482624\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Robyn&quot; &lt;edu@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; The reason I do have limits on the guns & bullet themes is for this<br/>\n&gt; particular child.  He has some definite issues with aggressive <br/>\n </span></blockquote>behavior (I&#39;m<br/>\n<blockquote><span title=\"ireply\"> &gt; not going into the details about all of it) and I am making a <br/>\n </span></blockquote>decision that<br/>\n<blockquote><span title=\"ireply\"> &gt; *I FEEL* is best for my child at this time.  <br/>\n<br/>\n </span></blockquote>Well this conversation was just read over my shoulder by my 13 yo <br/>\ndd.  Boy did she have plenty to say on the subject.  First she wanted <br/>\nto know exactly what was wrong with him that he couldn&#39;t handle a <br/>\npicture of a gun.  I scrolled back to the part where you said you <br/>\nwouldn&#39;t go into it.<br/>\n<br/>\nSo, she was thinking about all the possibilities of a person not <br/>\nbeing able to handle pictures of guns.  Then she still came to the <br/>\nsame conclusion.  That it didn&#39;t make sense to her at all that a <br/>\npicture of a gun could somehow inspire one to become aggressive.  <br/>\nThen she wondered how the mom would even know that if she never <br/>\nallowed it.<br/>\n<br/>\nShe added that parents should let their kids dress the way they want <br/>\nto dress and then go from there.  If some clothing item makes someone <br/>\nmore aggressive, then you could work on that, if that even would <br/>\nhappen in the first place. (I&#39;m paraphrasing here cuz she was just <br/>\ntalking so fast with so many thoughts)<br/>\n<br/>\nThen her friend called and was really upset because her parents had <br/>\njust bought her clothes that she didn&#39;t want or like and are <br/>\ninsisting that she wear them.  This is in response to wanting to wear <br/>\nall black and chains and stuff.  They don&#39;t want their child dressing <br/>\nlike that, so they are trying to force her to wear other things <br/>\nbecause they think it looks better.  <br/>\n<br/>\nSo where does a parent draw the line?  Should they?  My children can <br/>\nwear what they want, just like I can, just like their dad can.  I <br/>\ndon&#39;t tell my husband what he can and can&#39;t wear and only LET him <br/>\nwear clothing that I think is appropriate.  That would be insanely <br/>\ncontrolling.  The point of unschooling is treating kids with respect, <br/>\nas an equal in their humanity.  Perhaps more innocent or less aware, <br/>\nwhen they are younger, but equal just the same.<br/>\n<br/>\nI don&#39;t do that to my 13 yo dd who likes to wear all black.  She can <br/>\ncut, mark, sew and otherwise do as she pleases with her clothing.  <br/>\nShe dresses appropriately for the weather and the occasion.  She <br/>\nisn&#39;t sneaking out and changing at her friend&#39;s house to wear the <br/>\nforbidden items, like some of her friends do.  She puts on her black <br/>\neyeliner at home or in the car, where some of her friends do it at <br/>\nschool and take it off before they get home so they don&#39;t get in <br/>\ntrouble.  <br/>\n<br/>\nYesterday she let her friend cut her hair very short!  It looks <br/>\ncool.  I offered to take her to the salon to get it done but she <br/>\ndidn&#39;t want to wait that long.  I offered to take her afterwards to <br/>\nget it evened out, and she declined.  Her hair looks cool, she likes <br/>\nit, she&#39;s happy, I&#39;m happy, her friend was excited to do it.  It was <br/>\nfun all around.<br/>\n<br/>\nShe loves the shock value image.  It&#39;s fun, yet people are surprised <br/>\nat how cool and nice she is, if they don&#39;t know her and judge her by <br/>\nher looks.  It&#39;s amazing how much people stereotype others.  We talk <br/>\nabout it.  We have had many conversations about stereotyping and <br/>\njudging others by how they look.  We go people watching downtown and <br/>\npoint out all the cool &quot;looking&quot; people.  My dd used to say &quot;cool <br/>\nperson&quot; and point to where she was looking.  Then we&#39;d laugh about <br/>\nhow they look cool, but could actually be a big jerk in real life.<br/>\n<br/>\nI love how my daughter dresses.  I find nothing innappropriate about <br/>\nit.  She listens to her music, sitting at the desk right next to me.  <br/>\nI get to listen to her music too.  I&#39;ve heard countless bands and <br/>\ncountless lyrics and we&#39;ve discussed all of the qualities of the <br/>\nmusic.  I try not to say wether or not I like any of it when I first <br/>\nhear something new, because I want to appreciate it through her eyes <br/>\nand be open minded about it.  She does likewise to things that I <br/>\nbring to her.  It goes both ways.  If I said I didn&#39;t like something <br/>\nand made a thing about not wanting to listen to it, she would likely <br/>\ndo the same to me.  <br/>\n<br/>\nWhen we are in the car, I always listen to her music ALWAYS.  I can <br/>\nlisten to my music when she&#39;s not with me.  For now, I love her being <br/>\nwith me and if that means listening to loud emo screamo music in the <br/>\ncar, then so be it.  When we go to the mall she&#39;s not ashamed of her <br/>\nmother, she even sometimes holds my hand or links arms with me.<br/>\n<br/>\nThat is the kind of relationship that comes from LETTING my daughter <br/>\nbe who she wants to be without my judgement getting in the way of her <br/>\ndecision making.  She trusts me and I trust her.  She asks for my <br/>\nopinion because she finds it of value.  It&#39;s because I never <br/>\nsaid &quot;no&quot; to all those little things like wearing certain clothing, <br/>\nor saying wether or not she could look or be a certain way just <br/>\nbecause I said so or thought so for her own good.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: dying hair","postDate":"1181953739","msgId":29331,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYxQ0JDNzE5LTI3NzMtNDgzMC1BRUYyLTg1MDAwQUQ4M0ZEOUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDAwMTcwMWM3YWZhOSQwYzMwNjMyMCQ2NDAxYThjMEBXSUZFPg==","referencesHeader":"PDAwMTcwMWM3YWZhOSQwYzMwNjMyMCQ2NDAxYThjMEBXSUZFPg=="},"prevInTopic":29327,"nextInTopic":29334,"prevInTime":29330,"nextInTime":29332,"topicId":29313,"numMessagesInTopic":0,"msgSnippet":"-=-He has some definite issues with aggressive behavior (I m not going into the details about all of it) and I am making a decision that *I FEEL* is best for","messageBody":"<div id=\"ygrps-yiv-1295637023\">-=-He has some definite issues with aggressive behavior (I&#39;m<br/>\nnot going into the details about all of it) and I am making a  <br/>\ndecision that<br/>\n*I FEEL* is best for my child at this time.-=-<br/>\n<br/>\nThat&#39;s fine, but this list isn&#39;t so much for discussing what one mom  <br/>\nfeels about one child as it is about the larger principles behind  <br/>\nhelping children learn freely and make choices.<br/>\n<br/>\n-=-  We can all only do what is best for our own families. -=-<br/>\n<br/>\nThat sounds good, and I&#39;m sure most people would absolutely agree  <br/>\nwith you.<br/>\nOne thing I have chosen to do is to spend some of my time every day  <br/>\nkeeping this list maintained as an unschooling discussion area.  So  <br/>\nit&#39;s not a &quot;whatever in the whole world anyone feels or wants to do&quot;  <br/>\nlist so much as it&#39;s a &quot;let&#39;s discuss how kids learn and what can  <br/>\nhamper or help good relationships in unschooling families.&quot;<br/>\n<br/>\n-=-  We agree on several types - but others not so<br/>\nmuch.  He is really into some speed metal bands right now which I  <br/>\njust don&#39;t<br/>\nlike.  Does it mean that we never listen to it?  Nope, it doesn&#39;t.   <br/>\nWe all<br/>\ntake turns in the car picking music.  Some days I tolerate speed  <br/>\nmetal, some<br/>\ndays he tolerates disco music.-=-<br/>\n<br/>\nCouldn&#39;t you listen to the kind you both like when you&#39;re together?   <br/>\nThat seems very workable, and you could listen to the less-shared  <br/>\ntypes when you&#39;re off alone.<br/>\n<br/>\n<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":62434209,"authorName":"jenstarc4","from":"&quot;jenstarc4&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: dying hair","postDate":"1181950980","msgId":29327,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY0djg2NCtkb2dnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwMjQwMWM3YWY3OCQwNDQ3YTkxMCQ2NDAxYThjMEBXSUZFPg=="},"prevInTopic":29321,"nextInTopic":29331,"prevInTime":29326,"nextInTime":29328,"topicId":29313,"numMessagesInTopic":0,"msgSnippet":"I do have some limits on it (no bullets, guns, etc) and nothing TOO extreme, but in general I try to let him show his own style. You LET him?  Why do you","messageBody":"<div id=\"ygrps-yiv-1415048703\">&quot;I do have some limits on it (no bullets, guns, etc) and nothing TOO <br/>\nextreme, but in general I try to let him show his own style.&quot;<br/>\n<br/>\nYou LET him?  Why do you have no guns or bullets, etc., limits?  <br/>\nThat&#39;s the same kind of rules they have in schools.<br/>\n<br/>\nWhy put limits like that on him?  Why not let him decide for himself <br/>\nwhat is way over the top and what isn&#39;t.  I know it&#39;s uncomfortable <br/>\nto let go of that discomfort within yourself, but it&#39;s very worth it.<br/>\n<br/>\nInstead of seeing his style of dress as something to fear, just look <br/>\nat it like an experiment of sorts.  Some kids just like to mess with <br/>\nshock value.  Why put so much into it at all, just look and <br/>\nappreciate it for what it is.  It&#39;s a syle, help him go with it.  To <br/>\nthe extreme if he wants to.  <br/>\n<br/>\nIt&#39;s fun and you can learn a lot about your kids through encouraging <br/>\ntheir syles.  Don&#39;t worry about what other people think, they can get <br/>\nover it.  The inside is what counts.  Encouraging your child&#39;s <br/>\npassion, even if it&#39;s all black and piercings, wearing gun logos, and <br/>\ndyed hair, will let him feel heard and respected.  That&#39;s the kind of <br/>\nstuff that makes the inside even better.  <br/>\n<br/>\nIt&#39;s a whole other world when kids dress like that out of a <br/>\nrebellious nature to irritate their parents or make a point &quot;against&quot; <br/>\nsomething.  I find that with my unschooled kids, it just isn&#39;t the <br/>\nsame as that.  They do it for other reasons.  Without really <br/>\nexploring with your child, you&#39;ll miss out on all of that.</div>","specialLinks":[]},{"userId":283675851,"authorName":"Vida Evenson","from":"Vida Evenson &lt;vidamel@...&gt;","profile":"riverwolfspirit","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] dying hair","postDate":"1181935595","msgId":29321,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEMyOThDMjlCLjUzMjkldmlkYW1lbEBtYWMuY29tPg==","inReplyToHeader":"PDY1MThhOTM2MDcwNjE1MTIwOHgzNmNlZDk2NXBkZmMzOTc5YmI3ZTIwYWJkQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":29320,"nextInTopic":29327,"prevInTime":29320,"nextInTime":29322,"topicId":29313,"numMessagesInTopic":0,"msgSnippet":"Thanks everyone for the input so far!  This has been so much fun!  I let my mom do it knowing that once I did give the OK she would go along with it and get","messageBody":"<div id=\"ygrps-yiv-376582679\">Thanks everyone for the input so far!  This has been so much fun!  I let my<br/>\nmom do it knowing that once I did give the OK she would go along with it and<br/>\nget over it.  It was a fun.  If I thought my mom would approach it with<br/>\nangst I wouldn¹t have let her do it.  Well... Athena looks GREAT!!!  She<br/>\nLOVES her hair and feels wonderful.  What more could I ask for?  I got all<br/>\nsorts of spontaneous hugs and I love you¹s and some fabulous hair-flipping<br/>\nin the mirror under the light (to catch the purple-y shine).  Tomorrow I¹m<br/>\ngoing to do Penelope¹s hair (she¹s 8 too).  She wants a light red henna<br/>\ncolor.  <br/>\n<br/>\nI got over my feelings of needing my mom¹s OK (on this one) and I noticed<br/>\nthat after it was all done, Athena¹s new hair really isn¹t a big deal at<br/>\nall.  It seemed like my mother felt the same way.  She too was all smiles<br/>\nand said what a wonderful color it is.  She is my ally in most cases about<br/>\nunschooling.  This was just a barrier for her as well... more for her than<br/>\nme... It is nice to have an ally here.  We live in the Greek boonies where<br/>\nculture and tradition are very tight.  It¹s nice to have someone stick up<br/>\nfor me even though she doesn¹t fully understand what we¹re doing.<br/>\n<br/>\n....hee hee hee..... living with kids is so much fun!<br/>\n<br/>\nVida<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":288405080,"authorName":"diana jenner","from":"&quot;diana jenner&quot; &lt;hahamommy@...&gt;","profile":"dianajenner","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] dying hair","postDate":"1181934522","msgId":29320,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY1MThhOTM2MDcwNjE1MTIwOHgzNmNlZDk2NXBkZmMzOTc5YmI3ZTIwYWJkQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PEMyOThBMURFLjUzMTcldmlkYW1lbEBtYWMuY29tPg==","referencesHeader":"PEMyOThBMURFLjUzMTcldmlkYW1lbEBtYWMuY29tPg=="},"prevInTopic":29319,"nextInTopic":29321,"prevInTime":29319,"nextInTime":29321,"topicId":29313,"numMessagesInTopic":0,"msgSnippet":"Hair is a renewable resource. I heard a mom say that once, long before I had kids, and it really rings true in my heart. Please have someone do her hair who is","messageBody":"<div id=\"ygrps-yiv-1027916775\">Hair is a renewable resource.<br/>\nI heard a mom say that once, long before I had kids, and it really rings<br/>\ntrue in my heart.<br/>\nPlease have someone do her hair who is not going to infuse the process with<br/>\nangst and judgment -- it&#39;s imperative this be a happy, joyful, FUN time for<br/>\nher!! Empower your daughter to tell ickiness-spreaders &quot;my hair, MY choice.<br/>\nYou don&#39;t have to do *this* to your hair if you don&#39;t like it.&quot; and you can<br/>\nsay &quot;Your concern is appreciated, your approval is unnecessary&quot;<br/>\nHenna is SO easy to do: boil up some water and some black tea bags (no metal<br/>\nanywhere in the process, it will react with the henna and change the<br/>\ncolor!!), add enough liquid to make a nice smooth paste (if you over add,<br/>\nlet it stand extra long, it will thicken), let it set for a couple of hours<br/>\n(in glass bowl) until the lumps are gone, smoosh it all over her head<br/>\n(assuming you want all over color), cover with a plastic bag and get out<br/>\ninto the sun!!<br/>\nYour neighborhood Sally&#39;s Hair Supply (I&#39;m SO glad we finally got one in our<br/>\nhome town, previously I would frequent them on our road trips!) has a GREAT<br/>\nsemi permanent selection, some that bleach & color in one step.<br/>\nYou&#39;ll find, if approached joyfully, this is a great bonding experience with<br/>\nyour daughter that could very well help you heal from your own past filled<br/>\nwith judgment.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 6/15/07, Vida Evenson &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:vidamel@...\">vidamel@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt;   Hi everyone!<br/>\n&gt;<br/>\n&gt; My 8 yo has wanted to dye her hair for the past few months. We found this<br/>\n&gt; henna herbal color that¹s kind of a purpleish red. Well. I needed to get<br/>\n&gt; past the usual barriers of believing she is too young to know what she<br/>\n&gt; wants<br/>\n&gt; and after getting over that one (because she really does know what she<br/>\n&gt; wants... and she wants to try coloring her hair this specific color. I<br/>\n&gt; stooped to trying to get her to color her hair with straight henna but she<br/>\n&gt; was very clear that she wanted the purplish color. Yea, I think she know<br/>\n&gt; what she wants) the more elusive one of what will they think came hovering<br/>\n&gt; in. But then I got over that one too.... until I told my mother what we<br/>\n&gt; were going to do and she practically turned white. She said that if it was<br/>\n&gt; OK with me then she would go ahead and do the coloring (she¹s the one who<br/>\n&gt; knows about these things). But I knew she hated the idea. And so that got<br/>\n&gt; me wondering and thinking of how, after all these years, I¹m still looking<br/>\n&gt; for her approval. I was never allowed to dye my hair, let alone think of<br/>\n&gt; it. Make-up was only for in the house where nobody could see me and she<br/>\n&gt; let<br/>\n&gt; me know if my outfit wasn¹t fashionable enough. I can hardly make a<br/>\n&gt; decision on my own today because of all the schooling at school AND home.<br/>\n&gt;<br/>\n&gt; Well I won¹t do that to my girls. As far as I¹m concerned, if Athena is<br/>\n&gt; old<br/>\n&gt; enough to know she wants to color her hair, then she is old enough to do<br/>\n&gt; it.<br/>\n&gt; I mean, really... what¹s all the fuss about?<br/>\n&gt;<br/>\n&gt; Just wanted to vent a little and write down in words this breakthrough<br/>\n&gt; I¹ve<br/>\n&gt; had... a breakthrough that¹s bringing me closer to letting go of old,<br/>\n&gt; useless baggage.<br/>\n&gt;<br/>\n&gt; Vida<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; <br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\n~diana :)<br/>\nxoxoxoxo<br/>\nhannahbearski.blogspot.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":210335840,"authorName":"Susan","from":"Susan &lt;SusanYvonne@...&gt;","profile":"taodesuki","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] dying hair","postDate":"1181931974","msgId":29319,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ3Y2Q5MGUyMDcwNjE1MTEyNmo3NWZlMzA2Y2k0ZTkzMTE0N2RmODA5NjhAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PEMyOThBMURFLjUzMTcldmlkYW1lbEBtYWMuY29tPg==","referencesHeader":"PEMyOThBMURFLjUzMTcldmlkYW1lbEBtYWMuY29tPg=="},"prevInTopic":29313,"nextInTopic":29320,"prevInTime":29317,"nextInTime":29320,"topicId":29313,"numMessagesInTopic":0,"msgSnippet":"... let ... about? I know what you mean! My daughter likes to dye her hair as well - and her favorite is the same deep purple shade you re talking about. Is it","messageBody":"<div id=\"ygrps-yiv-1815540810\">Vida wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; And so that got me wondering and thinking of how, after all these years,<br/>\n&gt; I¹m still looking for her approval.  I was never allowed to dye my hair,<br/>\n </span></blockquote>let<br/>\n<blockquote><span title=\"ireply\"> &gt; alone think of it. &lt;snip&gt; Well I won¹t do that to my girls.  As far as I¹m<br/>\n&gt; concerned, if Athena is old enough to know she wants to color her hair,<br/>\n&gt; then she is old enough to do it. I mean, really... what¹s all the fuss<br/>\n </span></blockquote>about?<br/>\n<br/>\n<br/>\nI know what you mean! My daughter likes to dye her hair as well - and her<br/>\nfavorite is the same deep purple shade you&#39;re talking about. Is it a thing<br/>\nwith 7/8 year olds?<br/>\n<br/>\nMy mom frowns on it and my step-father *really* dislikes it and I&#39;ve had to<br/>\nendured comments from them as well as perfect strangers, but have managed to<br/>\nignore them for the most part. I actually like helping DD dye her hair.<br/>\nMaybe because I wasn&#39;t allowed to do (unless I did it anyways and then faced<br/>\nthe consequences) and it makes me happy to provide her with it. I love that<br/>\nshe feels free to express herself and isn&#39;t worried about being a<br/>\ncookie-cutter. There is also a small part of me that feels good about not<br/>\ncaving into my parents&#39; wishes. I, too, find myself still seeking their<br/>\napproval in certain ways, so I like when I can maintain my own perspective<br/>\non things. Subtle rebellion, lol.<br/>\n<br/>\nFor about a year my son didn&#39;t want me to cut his hair so it grew very long.<br/>\nAgain, conventional minded people had snippy comments like, &quot;He looks like a<br/>\ngirl - do you want him to look like girl?&quot; and &quot;Looks like it&#39;s time for a<br/>\nhair cut, don&#39;t you think?&quot; as if I was just being absent minded and it had<br/>\nnever dawned on me that his hair was growing past his shoulders. One family<br/>\nmember even brought religious doctrine into it even though we don&#39;t share<br/>\nthe same beliefs. But, like with the hair dye, I tried to let the comments<br/>\njust roll off my back and instead I took joy in standing firm and gave<br/>\nmyself a little pat on the back for not letting them sway my decision to<br/>\nsupport my child.<br/>\n<br/>\nDying hair isn&#39;t that hard to do, especially if you&#39;d rather not involve<br/>\nyour mom. The directions are pretty straight forward - just be sure to use<br/>\nold towels and wear the gloves. One tip is to apply cold cream or vaseline<br/>\naround her hairline (but avoid getting it on her hair) and on her forehead,<br/>\nneck, and ears before you put the dye on her hair. That will make it much<br/>\neasier to wipe the dye off her skin.<br/>\n<br/>\n-- Susan<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":283675851,"authorName":"Vida Evenson","from":"Vida Evenson &lt;vidamel@...&gt;","profile":"riverwolfspirit","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"dying hair","postDate":"1181927214","msgId":29313,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEMyOThBMURFLjUzMTcldmlkYW1lbEBtYWMuY29tPg=="},"prevInTopic":0,"nextInTopic":29319,"prevInTime":29312,"nextInTime":29314,"topicId":29313,"numMessagesInTopic":0,"msgSnippet":"Hi everyone! My 8 yo has wanted to dye her hair for the past few months.  We found this henna herbal color that¹s kind of a purpleish red.  Well.  I needed to","messageBody":"<div id=\"ygrps-yiv-1542781573\">Hi everyone!<br/>\n<br/>\nMy 8 yo has wanted to dye her hair for the past few months.  We found this<br/>\nhenna herbal color that¹s kind of a purpleish red.  Well.  I needed to get<br/>\npast the usual barriers of believing she is too young to know what she wants<br/>\nand after getting over that one (because she really does know what she<br/>\nwants... and she wants to try coloring her hair this specific color.  I<br/>\nstooped to trying to get her to color her hair with straight henna but she<br/>\nwas very clear that she wanted the purplish color.  Yea, I think she know<br/>\nwhat she wants) the more elusive one of what will they think  came hovering<br/>\nin.  But then I got over that one too.... until I told my mother what we<br/>\nwere going to do and she practically turned white.  She said that if it was<br/>\nOK with me then she would go ahead and do the coloring (she¹s the one who<br/>\nknows about these things).  But I knew she hated the idea.  And so that got<br/>\nme wondering and thinking of how, after all these years, I¹m still looking<br/>\nfor her approval.  I was never allowed to dye my hair, let alone think of<br/>\nit.  Make-up was only for in the house where nobody could see me and she let<br/>\nme know if my outfit wasn¹t fashionable enough.  I can hardly make a<br/>\ndecision on my own today because of all the schooling at school AND home.<br/>\n<br/>\nWell I won¹t do that to my girls.  As far as I¹m concerned, if Athena is old<br/>\nenough to know she wants to color her hair, then she is old enough to do it.<br/>\nI mean, really... what¹s all the fuss about?<br/>\n<br/>\nJust wanted to vent a little and write down in words this breakthrough I¹ve<br/>\nhad... a breakthrough that¹s bringing me closer to letting go of old,<br/>\nuseless baggage.<br/>\n<br/>\nVida<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":29301,"nextTopicId":29335}}