{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":9,"messages":[{"userId":324592498,"authorName":"Tori","from":"&quot;Tori&quot; &lt;tandosmama@...&gt;","profile":"tandosmama@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: discussing food w/o sounding judgemental","postDate":"1313353477","msgId":62374,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGoyOWF1NStkZXV0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzMTMyMjY1OTUuNzMzODEuWWFob29NYWlsTmVvQHdlYjExMDQxMC5tYWlsLmdxMS55YWhvby5jb20+"},"prevInTopic":62355,"nextInTopic":0,"prevInTime":62373,"nextInTime":62375,"topicId":62328,"numMessagesInTopic":0,"msgSnippet":"... So true. We know families who constantly struggle with controlling their kids eating--even families who consider themselves unschoolers. The parents ask","messageBody":"<div id=\"ygrps-yiv-2067172593\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Jenny Cyphers &lt;jenstarc4@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;If you want to get kids to eat food that you want them to eat over food that they want to eat, you will likely be met with resistance.  I don&#39;t think you can really unschool food.  You can let go of controlling food.  You can offer more choices.  You can help kids get food they want to eat.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>So true. We know families who constantly struggle with controlling their kids&#39; eating--even families who consider themselves unschoolers. The parents ask me repeatedly how it is that I get our 4 yr old twins to eat so well (they mean conventionally healthy, I think). I always tell them that I&#39;ve done nothing other than provide lots of great, interesting choices and our kids make their own decisions. Among those choices are sweets (homemade and store-bought) and all sorts of things many folks feel are unhealthy. Though I&#39;ll admit it took a leap of faith for me to scoop up ice cream cones first thing in the morning, I am SO GRATEFUL for the experience shared on this list. Reading here helped me trust that if I could leave behind my issues my kids could have a healthy, joyful experience of eating. Sandra is absolutely right focusing on the happiness of my kids has healed my own hurts.  Thanks to all of you who share your experience here!</div>","specialLinks":[]},{"userId":251210887,"authorName":"shirarocklin","from":"&quot;shirarocklin&quot; &lt;shirarocklin@...&gt;","profile":"shirarocklin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: discussing food w/o sounding judgemental","postDate":"1313290230","msgId":62355,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGoyN2Q1bSt1aXB1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDU5REZFMjJCLTg0Q0MtNDQyMS05RkRGLTRGRTk0QTMzRDBFQkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":62353,"nextInTopic":62374,"prevInTime":62354,"nextInTime":62356,"topicId":62328,"numMessagesInTopic":0,"msgSnippet":"I sometimes mention that something with a bit of protein might help my daughter feel a little better, casually.  Or I just put out a monkey plate of snacks","messageBody":"<div id=\"ygrps-yiv-1345712904\">I sometimes mention that something with a bit of protein might help my daughter feel a little better, casually.  Or I just put out a monkey plate of snacks that are protein rich... nuts. seeds, cheese, chickpeas, and some fruit or crackers.<br/>\n<br/>\nSometimes I&#39;ve mentioned how the colors of fruits and vegetables indicate vitamins are in there, which lead to questions about nutrients.  For example, I might talk about orange carrots, Vit. A and eyesight if she were interested.   <br/>\n<br/>\nMy daughter is 5 years old, and she&#39;s picked up from friends that certain foods are &#39;junky&#39; (as she calls them).  I try to point out why some people condier them that way.  I&#39;ve mentioned food coloring and white sugar, and general lack of nutrients.  She has eczema, so I&#39;ve mentioned once or twice that food coloring can make eczema worse for some people, and that she might notice if she&#39;s more or less itchy when she eats certain foods.  <br/>\n<br/>\nOh, and sometimes, when I realize that she&#39;s sort of cranky all day long, and notice she&#39;s been eating mostly the fruit and crackers and pretzels (carbs and sugars)... I&#39;ll bring out some eggs or cheese (protein, as mentioned above) and she&#39;s been interested in my explanations of &#39;slow&#39; and &#39;fast&#39; energy from food.  I doubt I&#39;m giving her an exactly accurate description of how food works in the body, but I just explain a bit about how protein and fat can slow down digestion of carbohydrates (in little kid language) and make us feel full and happy for longer, and how that might be related to her mood that day.<br/>\n<br/>\nShira Rocklin</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] semantics","postDate":"1313262752","msgId":62353,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTMyNjI3NTIuMzU4MTkuWWFob29NYWlsTmVvQHdlYjExMDQxMS5tYWlsLmdxMS55YWhvby5jb20+","inReplyToHeader":"PGoyNjR2bytkdGNyQGVHcm91cHMuY29tPg==","referencesHeader":"PDU5REZFMjJCLTg0Q0MtNDQyMS05RkRGLTRGRTk0QTMzRDBFQkBTYW5kcmFkb2RkLmNvbT4gPGoyNjR2bytkdGNyQGVHcm91cHMuY29tPg=="},"prevInTopic":62351,"nextInTopic":62355,"prevInTime":62352,"nextInTime":62354,"topicId":62328,"numMessagesInTopic":0,"msgSnippet":"***Sorry for the semantic blunder. I ve heard the loosening of food controls described as unschooling food on several blogs and websites and if you google","messageBody":"<div id=\"ygrps-yiv-1943170050\">***Sorry for the semantic blunder. I&#39;ve heard the loosening of food controls described as &quot;unschooling food&quot; on several blogs and websites and if you google &quot;unschooling food&quot; many useful links come up, so I thought that was a shorthand.*** <br/>\n<br/>\n<br/>\nIt&#39;s true that you can google that and it will provide you with interesting links.  Here&#39;s a collection of thoughts on &quot;semantics&quot; from Sandra&#39;s website: <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/semantics\">http://sandradodd.com/semantics</a><br/>\n<br/>\nWhat people on this list and in other forums try very hard to do, is to write about unschooling in a way that doesn&#39;t create more confusion.  Food comes up in unschooling discussions all the time.  It doesn&#39;t come up because it has to do with school, it comes up because parenting philosophies are questioned.  It&#39;s common for parents to be controlling and to extend that to food.  It&#39;s better, if you want to unschool well, to question whether and what you control.<br/>\n<br/>\n<br/>\nUnderneath the food issue, you will find fear and control.  It is the same thing that holds back lots of people when they make arbitrary or unilateral decisions that impact their kids.  So, while we can all talk about food, it will get right into those issues, the same way that it does with watching TV or enforcing chores.<br/>\n<br/>\nUnschooling is about learning as if school didn&#39;t exist.  How that looks really depends on the family.  There are LOTS of things that parents can do to make it better or worse.  How we handle the little things like food, count.  Like Pam Sorooshian said, &quot;As we get older and our kids grow up, we eventually come to realize that all the big things in our lives are really the direct result of how we&#39;ve handled all the little things.&quot;<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: discussing food w/o sounding judgemental","postDate":"1313253519","msgId":62351,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBFMjQzRURELUEwN0EtNEI5Ni1BOTBGLThBODkwNjBBRTYyREBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGoyNjR2bytkdGNyQGVHcm91cHMuY29tPg==","referencesHeader":"PGoyNjR2bytkdGNyQGVHcm91cHMuY29tPg=="},"prevInTopic":62348,"nextInTopic":62353,"prevInTime":62350,"nextInTime":62352,"topicId":62328,"numMessagesInTopic":0,"msgSnippet":"-=-Sorry for the semantic blunder. I ve heard the loosening of food controls described as unschooling food on several blogs and websites and if you google","messageBody":"<div id=\"ygrps-yiv-1838243210\">-=-Sorry for the semantic blunder. I&#39;ve heard the loosening of food controls described as &quot;unschooling food&quot; on several blogs and websites and if you google &quot;unschooling food&quot; many useful links come up, so I thought that was a shorthand. -=-<br/>\n<br/>\nIt wasn&#39;t a blunder, I was just suggesting a clarifying adjustment.<br/>\n<br/>\nThere&#39;s a ton of tacky/bad shorthand out there, and a growing body of half-considered unschooling advice, but on this list I try to sort the wheat from the chaff, dirt, rocks and stickers.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":386666394,"authorName":"melgqd","from":"&quot;melgqd&quot; &lt;boisei@...&gt;","profile":"melgqd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: discussing food w/o sounding judgemental","postDate":"1313249080","msgId":62348,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGoyNjR2bytkdGNyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDU5REZFMjJCLTg0Q0MtNDQyMS05RkRGLTRGRTk0QTMzRDBFQkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":62338,"nextInTopic":62351,"prevInTime":62347,"nextInTime":62349,"topicId":62328,"numMessagesInTopic":0,"msgSnippet":"... Sorry for the semantic blunder.  I ve heard the loosening of food controls described as unschooling food on several blogs and websites and if you google","messageBody":"<div id=\"ygrps-yiv-907993913\"><blockquote><span title=\"ireply\">&gt; It&#39;s not &quot;unschooling food.&quot;  People don&#39;t &quot;school food&quot; so we don&#39;t need a counterpart.<br/>\n&gt; <br/>\n&gt; The question is how parents who have decided to provide a rich life full of choices for their children, so that their children can learn naturally, gradually, individually, should deal with food.<br/>\n<br/>\n </span></blockquote>Sorry for the semantic blunder.  I&#39;ve heard the loosening of food controls described as &quot;unschooling food&quot; on several blogs and websites and if you google &quot;unschooling food&quot; many useful links come up, so I thought that was a shorthand.  <br/>\n<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; If a family is not going to make a child clean her plate, isn&#39;t going to measure and weigh food, forbid food, use food as rewards, then what?<br/>\n&gt; <br/>\n&gt; The purpose of food is important, and food has more than one purpose, depending on the event, the day, the person&#39;s level of health or need.  Wedding cake is as ceremonial as communion is.  A champagne toast isn&#39;t for purposes of hydration.   So &quot;it depends&quot; looms large over any answers about what to say.<br/>\n&gt; <br/>\n&gt; -=-I&#39;d love to hear a bit about how people talk about nutrition with their kids when they are unschooling food without sounding judgmental? Or do you leave out the discussion of food quality all together in favor of talking about how the kids feel when they eat this or that?-=-<br/>\n&gt; <br/>\n&gt; It seems the choice is whether to talk about food quality, or to grill the kids (or implant suggestions) about how they feel after various foods.   It all sounds like the trap of a nervous mother to me.<br/>\n<br/>\n </span></blockquote>I&#39;ve never weighed food or provided it as a reward, but I was controlling of sugar and in the last 5 months have said yes more.  But you are right I am nervous because I see both of my boys (6 and 9) gaining weight.  They have always been lean.  I know It could be a growth period for my 9yo and that could account for the gain.  <br/>\n<br/>\nI&#39;ve read quite a bit trying to get a handle on this but I&#39;ll go back and read more and steep on it.  <br/>\nThanks,<br/>\nMelissa<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; I think before any mom talks to any child about any food, this should be read slowly and thoughtfully.<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/food\">http://sandradodd.com/food</a><br/>\n&gt; Read a little, try a little, wait a while, watch.<br/>\n&gt; <br/>\n&gt; And after that&#39;s all read and digested, the answer is probably DON&#39;T talk to them very much at all about quality or feelings unless it comes up naturally in conversation.   If a mother IS judgmental, she won&#39;t be able to discuss food without sounding and being judgmental.<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: discussing food w/o sounding judgemental","postDate":"1313242927","msgId":62338,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGoyNXV2ZitjcGlnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGoyNGZtMStjbDNlQGVHcm91cHMuY29tPg=="},"prevInTopic":62335,"nextInTopic":62348,"prevInTime":62337,"nextInTime":62339,"topicId":62328,"numMessagesInTopic":0,"msgSnippet":"... ***************** The short answer is the same way we talk about anything else. The trouble with food and nutrition is that parents have a lot of","messageBody":"<div id=\"ygrps-yiv-1072241752\">&quot;melgqd&quot; &lt;boisei@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;d love to hear a bit about how people talk about nutrition with their kids when they are unschooling food without sounding judgmental?<br/>\n </span></blockquote>*****************<br/>\n<br/>\nThe short answer is &quot;the same way we talk about anything else.&quot; The trouble with food and nutrition is that parents have a lot of personal baggage around it. So the hard part is stepping away from that baggage and realizing that kids learn about food and nutrition the same way the learn to read or learn social skills - its a process of taking in all sorts of information, some of it seemingly un-related, and making connections. <br/>\n<br/>\nKids are curious about the world, and that includes bodies - what are bodies made of? What&#39;s inside? How and why do they grow and change? How do little people become big people? Some of those things they explore by asking questions, or reading books or magazines, or watching tv, or playing with food, or playing in the garden, or grocery shopping, or eating and drinking. <br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Or do you leave out the discussion of food quality all together...<br/>\n<br/>\n </span></blockquote>It might help to step away from the idea of a &quot;discussion&quot; - that gets too close to teaching, to giving knowledge *to* children, when they&#39;re busy learning all the time. If your child asks a question, answer it wihout going overboard. Have lots of &quot;good quality&quot; food in the house (whatever that means to you) without making that some kind of house rule or attaching lectures to this or that choice. Food is very personal! Don&#39;t set your kids up for baggage around what makes them feel good. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] discussing food w/o sounding judgemental","postDate":"1313226595","msgId":62335,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTMyMjY1OTUuNzMzODEuWWFob29NYWlsTmVvQHdlYjExMDQxMC5tYWlsLmdxMS55YWhvby5jb20+","inReplyToHeader":"PGoyNGZtMStjbDNlQGVHcm91cHMuY29tPg==","referencesHeader":"PGoyNGZtMStjbDNlQGVHcm91cHMuY29tPg=="},"prevInTopic":62330,"nextInTopic":62338,"prevInTime":62334,"nextInTime":62336,"topicId":62328,"numMessagesInTopic":0,"msgSnippet":"***I d love to hear a bit about how people talk about nutrition with their kids when they are unschooling food without sounding judgmental? Or do you leave out","messageBody":"<div id=\"ygrps-yiv-1614045066\">***I&#39;d love to hear a bit about how people talk about nutrition with their kids when they are unschooling food without sounding judgmental? Or do you leave out the discussion of food quality all together in favor of talking about how the kids feel when they eat this or that?***<br/>\n<br/>\n<br/>\nI suppose it really depends on what your motivation for talking about food is.  If you want to get kids to eat food that you want them to eat over food that they want to eat, you will likely be met with resistance.  I don&#39;t think you can really unschool food.  You can let go of controlling food.  You can offer more choices.  You can help kids get food they want to eat.<br/>\n<br/>\nI also don&#39;t think it&#39;s an either/or thing; discuss food quality or how kids feel when they eat this or that.<br/>\n<br/>\nBring tasty and interesting food into the house.  Make things that smell good and enjoy.  As kids get older their tastes change and their likes and dislikes change.  One day they might be interested in food discussions or maybe they won&#39;t ever care.  One kid may grow up and be a vegetarian and feel strongly about that, while another kid might love to eat meat.  How you treat food now can avoid uncomfortable food discussion around personal food choices.  It won&#39;t help at all if your vegetarian kid tries to get the meat loving kid to stop eating meat.  If mom has been telling their kids their whole life that artificial colors are bad and HFCS is poison, the kids won&#39;t hesitate to do that with each other as they form stronger opinions and ideas about food.<br/>\n<br/>\nIt&#39;s better to be kind and happy and enjoy food, whatever that food happens to be.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] discussing food w/o sounding judgemental","postDate":"1313196416","msgId":62330,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU5REZFMjJCLTg0Q0MtNDQyMS05RkRGLTRGRTk0QTMzRDBFQkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGoyNGZtMStjbDNlQGVHcm91cHMuY29tPg==","referencesHeader":"PGoyNGZtMStjbDNlQGVHcm91cHMuY29tPg=="},"prevInTopic":62328,"nextInTopic":62335,"prevInTime":62329,"nextInTime":62331,"topicId":62328,"numMessagesInTopic":0,"msgSnippet":"-=-I d love to hear a bit about how people talk about nutrition with their kids when they are unschooling food without sounding judgmental?-=- It s not","messageBody":"<div id=\"ygrps-yiv-1447941200\">-=-I&#39;d love to hear a bit about how people talk about nutrition with their kids when they are unschooling food without sounding judgmental?-=-<br/>\n<br/>\nIt&#39;s not &quot;unschooling food.&quot;  People don&#39;t &quot;school food&quot; so we don&#39;t need a counterpart.<br/>\n<br/>\nThe question is how parents who have decided to provide a rich life full of choices for their children, so that their children can learn naturally, gradually, individually, should deal with food.<br/>\n<br/>\nIf a family is not going to make a child clean her plate, isn&#39;t going to measure and weigh food, forbid food, use food as rewards, then what?<br/>\n<br/>\nThe purpose of food is important, and food has more than one purpose, depending on the event, the day, the person&#39;s level of health or need.  Wedding cake is as ceremonial as communion is.  A champagne toast isn&#39;t for purposes of hydration.   So &quot;it depends&quot; looms large over any answers about what to say.<br/>\n<br/>\n-=-I&#39;d love to hear a bit about how people talk about nutrition with their kids when they are unschooling food without sounding judgmental? Or do you leave out the discussion of food quality all together in favor of talking about how the kids feel when they eat this or that?-=-<br/>\n<br/>\nIt seems the choice is whether to talk about food quality, or to grill the kids (or implant suggestions) about how they feel after various foods.   It all sounds like the trap of a nervous mother to me.<br/>\n<br/>\nI think before any mom talks to any child about any food, this should be read slowly and thoughtfully.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/food\">http://sandradodd.com/food</a><br/>\nRead a little, try a little, wait a while, watch.<br/>\n<br/>\nAnd after that&#39;s all read and digested, the answer is probably DON&#39;T talk to them very much at all about quality or feelings unless it comes up naturally in conversation.   If a mother IS judgmental, she won&#39;t be able to discuss food without sounding and being judgmental.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":386666394,"authorName":"melgqd","from":"&quot;melgqd&quot; &lt;boisei@...&gt;","profile":"melgqd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"discussing food w/o sounding judgemental","postDate":"1313194497","msgId":62328,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGoyNGZtMStjbDNlQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":62330,"prevInTime":62327,"nextInTime":62329,"topicId":62328,"numMessagesInTopic":0,"msgSnippet":"Hi, I d love to hear a bit about how people talk about nutrition with their kids when they are unschooling food without sounding judgmental?  Or do you leave","messageBody":"<div id=\"ygrps-yiv-1012674567\">Hi,<br/>\nI&#39;d love to hear a bit about how people talk about nutrition with their kids when they are unschooling food without sounding judgmental?  Or do you leave out the discussion of food quality all together in favor of talking about how the kids feel when they eat this or that?<br/>\nThanks,<br/>\nMelissa</div>","specialLinks":[]}],"prevTopicId":62367,"nextTopicId":62327}}