{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":49,"messages":[{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] A warm hello from the UK- and some\tquestions!","postDate":"1075807962","msgId":90143,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJDNDRGMTA5LjI0Mzg1JWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDIwMDQwMjAyLjIzNTkzNC4xOTA0LjkuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":90139,"nextInTopic":90144,"prevInTime":90142,"nextInTime":90144,"topicId":90029,"numMessagesInTopic":0,"msgSnippet":"... I think I suggested recently on a different thread that we need to separate our reactions to kids choices from our reactions to the consequences of their","messageBody":"<div id=\"ygrps-yiv-1005481038\"><blockquote><span title=\"ireply\">&gt; ***his behaviour worsens, he gets headaches ***<br/>\n<br/>\n </span></blockquote>I think I suggested recently on a different thread that we need to separate<br/>\nour reactions to kids&#39; choices from our reactions to the consequences of<br/>\ntheir choices.<br/>\n<br/>\nWe shouldn&#39;t see our purpose as preventing kids from making decisions with<br/>\nbad consequences. We should see our purpose as helping them make decisions.<br/>\n<br/>\nNot help them make the &quot;right&quot; (e.g., the one&#39;s we&#39;d make) decisions, but<br/>\nhelp them make decisions.<br/>\n<br/>\nSo a child who gets cranky and headaches from watching too much TV needs<br/>\nhelp deciding what to do about the consequences.<br/>\n<br/>\nWhat if a kid got cranky and headaches from reading all day?<br/>\n<br/>\n(That might not be a good analogy among conventional parents. But I hope<br/>\npeople here would see reading all day as a good thing :-)<br/>\n<br/>\nWould the response be to limit reading?<br/>\n<br/>\nOr would a better response be to help him see the connection between<br/>\nsomething that&#39;s causing a problem with him or the family and what he&#39;s<br/>\ndoing while reading (too inactive, a position he&#39;s frozen into or whatever).<br/>\nAnd then come up with ways he can handle that. Maybe he&#39;d choose to read<br/>\nless at one sitting. Or move around while reading. Or set a timer. Or ask<br/>\nmom to remind him to move. Or decide it was worth feeling cranky but work on<br/>\nways to not snap at family members. Or ...<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":162967824,"authorName":"Dawn Adams","from":"&quot;Dawn Adams&quot; &lt;Wishbone@...&gt;","profile":"bluenosegoddess","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: A warm hello from the UK- and some questions!","postDate":"1075807291","msgId":90144,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMjMwMWMzZWE0NyRlMGE4Mjc4MCQ3MTRjZGUxOEBhb2xkc2wubmV0Pg==","referencesHeader":"PDExMy4yZTUzOGRkYS4yZDUwM2E4MEBhb2wuY29tPg=="},"prevInTopic":90143,"nextInTopic":90146,"prevInTime":90143,"nextInTime":90145,"topicId":90029,"numMessagesInTopic":0,"msgSnippet":"... Debbie wrote: I never said *I* was turned off because of something one person posted on one list. I intend to stick around because I need to glean","messageBody":"<div id=\"ygrps-yiv-399826038\">I wrote:<br/>\n<blockquote><span title=\"ireply\">   &gt; Man, the power people give over to others. If people are turned off because <br/>\n  &gt; of something one person posted on one list than maybe they aren&#39;t ready for <br/>\n  &gt; unschooling because you can bet it will not be the last nor the least of the <br/>\n  &gt; critcism they face. I found once I stopped thinking about how much a certain <br/>\n  &gt; criticism hurt me and focused on what was in the criticism that could help <br/>\n  &gt; me...well that&#39;s when I started to grow. Life is too short to play victim or <br/>\n  &gt; blame others for steps not taken.<br/>\n  &gt; <br/>\n  &gt;  Dawn (in NS)<br/>\n  &gt; <br/>\n<br/>\n </span></blockquote>  Debbie wrote:<br/>\n  I never said *I* was turned off because of something one person posted on <br/>\n  one list. I intend to stick around because I need to glean information. But it <br/>\n  also doesn&#39;t mean that people cannot reply to things they don&#39;t agree with.<br/>\n  And how do you know that people haven&#39;t faced loads of criticism in their <br/>\n  home edding journey so far?<br/>\n  Man, there are a lot of assumptions made on this list.<br/>\n  Debbie.<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>  Debbie, did I ever refer just to you in my post? You made general comments (at least about people being scared off) and I responded with general comments.  <br/>\n<br/>\n  Dawn (in NS)<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":116578718,"authorName":"myrtlehogwash@aol.com","from":"myrtlehogwash@...","profile":"jimjam003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: A warm hello from the UK- and some questions!","postDate":"1075798920","msgId":90139,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJlLjQ0NzRkNjcuMmQ1MGJkODhAYW9sLmNvbT4="},"prevInTopic":90135,"nextInTopic":90143,"prevInTime":90138,"nextInTime":90140,"topicId":90029,"numMessagesInTopic":0,"msgSnippet":"In a message dated 03/02/2004 02:36:28 GMT Standard Time, SandraDodd@aol.com ... No, you are guessing. How do you know that I m not digesting some of what you ","messageBody":"<div id=\"ygrps-yiv-938866439\">In a message dated 03/02/2004 02:36:28 GMT Standard Time, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> <br/>\nwrites:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Batting advice away because you didn&#39;t like the tone of it <br/>\n&gt; sounds like you just want to keep doing what you&#39;re doing but you wanted to <br/>\n&gt; claim <br/>\n&gt; you had investigated other methods.  I&#39;m not just guessing on this.  <br/>\n<br/>\n </span></blockquote>No, you are guessing. How do you know that I&#39;m not digesting some of what you <br/>\nsaid? But I&#39;m certainly not taking on board the &quot;you&#39;re a cold abusive <br/>\nmother&quot; part. <br/>\n<br/>\nThat&#39;s what I want to do, sort the wheat from the chaff and it&#39;s become <br/>\nmighty hard work when *everything* is analysed and I find myself embroiled in <br/>\narguments with you guys.<br/>\nSo now, say what you like. I really don&#39;t want to go into this any more. (And <br/>\nno, not because I&#39;m not tolerant, can&#39;t take criticism, etc but because of <br/>\ntime).<br/>\nDebbie  <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":74604204,"authorName":"Deborah Lewis","from":"Deborah Lewis &lt;ddzimlew@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] A warm hello from the UK- and some questions!","postDate":"1075791573","msgId":90135,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwMjAyLjIzNTkzNC4xOTA0LjkuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":90124,"nextInTopic":90139,"prevInTime":90134,"nextInTime":90136,"topicId":90029,"numMessagesInTopic":0,"msgSnippet":"***The problem is that I still don t feel confident or at peace with what I m doing, worry constantly and keep changing my approach. This has got to change!***","messageBody":"<div id=\"ygrps-yiv-386960021\">***The problem is that I still don&#39;t feel confident or at peace with <br/>\nwhat I&#39;m doing, worry constantly and keep changing my approach. This <br/>\nhas got to change!***<br/>\n<br/>\nThere&#39;s a belief that ritual in religious practice will keep a body on<br/>\nthe right path - even if the mind forgets for a time where it wanted to<br/>\ngo.   By staying on the path one will eventually end up in the desired<br/>\nlocation. &lt;g&gt;<br/>\n<br/>\nYou won&#39;t get comfortable with unschooling until you&#39;re unschooling.  You<br/>\nhave to *do* it. <br/>\nYou won&#39;t be confident or at peace until you really believe in natural<br/>\nlearning and you really trust your kids. <br/>\nYou can&#39;t have hold of dreams about academic achievement in one hand and<br/>\nideas about natural learning in the other and be at peace about<br/>\nunschooling. <br/>\n<br/>\nRead, absorb, live it,  and trust.  <br/>\n<br/>\n***if I let him do exactly what he wants he will just watch tv<br/>\nconstantly.***<br/>\n<br/>\nHe really wont.  He might for awhile until he finds other things he wants<br/>\nto do, but he wont always and only want TV forever.   <br/>\n<br/>\n***his behaviour worsens, he gets headaches ***<br/>\n<br/>\nYou might rub his shoulders if he&#39;s been sitting for a long time.  You<br/>\ncould bring him snacks to keep his energy up.  You might watch with him<br/>\nso he feels your support instead of your worry - if he&#39;s felt that, and<br/>\nthose things might make him more comfortable and let you feel like you&#39;re<br/>\nworking with him instead of against him.  <br/>\n<br/>\n***and isnt&#39;t active or using his imagination when he&#39;s stuck in front of<br/>\nthe box all the time.***<br/>\n<br/>\nCan he bounce on the furniture and hop around and stand on his head?  If<br/>\nyou have rules about not doing those things ( I know some families do)<br/>\n(If you could see my furniture you&#39;d understand we&#39;re not one of those<br/>\nfamilies&lt;g&gt;)  you could lift them and give him more freedom to be active<br/>\nwhile watching.  For several months Dylan watched everything upside down<br/>\nwith his feet waving around in the air.&lt;g&gt;<br/>\n<br/>\nI think TV is a wonderful for the imagination.  He might be living out<br/>\nall kinds of exciting things you aren&#39;t aware of.   I know there are a<br/>\nlot of mainstream theories about the evils of TV, but if you let go of<br/>\nthat and trust your kids, you&#39;ll come to all kinds of new thinking on the<br/>\nsubject. <br/>\n<br/>\n***He also plays constantly, mostly with my eldest daughter. Which is <br/>\nfine but I worry that he isn&#39;t learning *anything*.  ***<br/>\n<br/>\nPlay is the way people learn.   Some legislators are pushing for<br/>\nmandatory preschool for three year olds because kids are learning so much<br/>\nin those early years, and they think (among other things)  they can give<br/>\nthem a early start.  But the reason kids learn so much before they&#39;re<br/>\nfive is because they are free to play.  After that parents start fussing<br/>\nabout school work and teachers start pushing reading and all at once your<br/>\nbright kid who learned to walk and talk and dress himself and feed<br/>\nhimself, ride a bike - who can name every dinosaur found in the Hell<br/>\nCreek formation and work the dvd player and master countless, challenging<br/>\nvideo games is suddenly learning disabled, or disordered or something.  <br/>\nHmmm. <br/>\n<br/>\nLet him play.    <br/>\n<br/>\n*** Do you think parents and children have to be of a certain personality<br/>\nto successfully unschool?***<br/>\n<br/>\nYes.  Parents have to believe learning is natural and they have to trust<br/>\ntheir kids.  They have to look at their kids and see what&#39;s right about<br/>\nthem, not what others think might be wrong.  They have to see value in<br/>\neverything in life.  They have to see value in their kids choices.  They<br/>\nhave to really like their kids and want to be with them. <br/>\n<br/>\n***I feel I&#39;ve made so many mistakes, ***<br/>\n<br/>\nEvery parent feels that way.  We all have things we&#39;d change if we could.<br/>\n<br/>\n<br/>\nEveryone who is unschooling now had to think about the difference between<br/>\na life with school and a life without.   Most of us went to school and<br/>\nhave had to overcome our brainwashing and self doubt.  These things<br/>\naren&#39;t unique to you.   Every moment is an opportunity for you to do it<br/>\nbetter. The next minute might be the minute you get it exactly right. <br/>\nYou don&#39;t have to wait until tomorrow.  <br/>\n<br/>\nI&#39;m writing this after reading several other posts from you.  I hope you<br/>\ncan read without it feeling personal.  There probably isn&#39;t a parent here<br/>\nwho hasn&#39;t had to examine their thinking in certain areas in order to get<br/>\ncomfortable with unschooling and live more peacefully with their kids.  <br/>\n<br/>\nDeb L</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: A warm hello from the UK- and some questions!","postDate":"1075775579","msgId":90124,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgyLjQ0ZTg4NGYuMmQ1MDYyNWJAYW9sLmNvbT4="},"prevInTopic":90121,"nextInTopic":90135,"prevInTime":90123,"nextInTime":90125,"topicId":90029,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/2/04 7:01:56 PM, ecsamhill@earthlink.net writes: ","messageBody":"<div id=\"ygrps-yiv-1954368314\">In a message dated 2/2/04 7:01:56 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ecsamhill@...\">ecsamhill@...</a> writes:<br/>\n<br/>\n&lt;&lt; If you want custom tailored advice and deep perceptiveness about the <br/>\ndetails of your particular issues, then I suggest that you pay for it. <br/>\n Likely it will be quite expensive. &gt;&gt;<br/>\n<br/>\nAnd how good will it really be?<br/>\n<br/>\nThere are some people who do phone consultation.   The GWS office (which  no <br/>\nlonger has  a magazine or books, I guess) does homeschooling phone <br/>\nconsultation, and has for years.   Someone who spoke at a conference I attended does <br/>\nphone consultations.   Like $60 an hour, I think.<br/>\n<br/>\nMaybe there&#39;s someone in England doing that.<br/>\n<br/>\nBut really, only what you internalize and analyze and try out will do you any <br/>\ngood at all.  Batting advice away because you didn&#39;t like the tone of it <br/>\nsounds like you just want to keep doing what you&#39;re doing but you wanted to claim <br/>\nyou had investigated other methods.  I&#39;m not just guessing on this.  Others <br/>\nwho have been similarly defensive in the past have come back and described how <br/>\nthey felt, and how they eventually DID think about the things they read <br/>\nwherever---here, at unschooling.com, on the old AOL forum---and it started to make <br/>\nsense to them.<br/>\n<br/>\nWe, people on those sources named right above have received a few dozen <br/>\napologies from people who will say &quot;I thought you were all mean and crazy, but then <br/>\nI figured out what you were talking about,&quot; or &quot;When I first read about <br/>\nunschooling it seemed neglectful nonsense, but now...&quot;<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: A warm hello from the UK- and some questions!","postDate":"1075774940","msgId":90121,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM5LjQzNmVhMjEzLjJkNTA1ZmRjQGFvbC5jb20+"},"prevInTopic":90119,"nextInTopic":90124,"prevInTime":90120,"nextInTime":90122,"topicId":90029,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/2/04 4:00:10 PM, myrtlehogwash@aol.com writes: ","messageBody":"<div id=\"ygrps-yiv-1702645640\">In a message dated 2/2/04 4:00:10 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:myrtlehogwash@...\">myrtlehogwash@...</a> writes:<br/>\n<br/>\n&lt;&lt; Perhaps you should walk a mile in someone&#39;s shoe, metophorically speaking, <br/>\nbefore writing such stuff. &gt;&gt;<br/>\n<br/>\nI have children.  I went to school.  I taught school.  I was afraid of <br/>\nunschooling.  Now I&#39;m not.<br/>\n<br/>\nIf I can change, other people can change.<br/>\n<br/>\nPeople who want to unschool don&#39;t have forever to decide to do it.  Their <br/>\nchildren are getting older by the minute.   The window will eventually close.  <br/>\nAnd the more schoolish teaching they do, the more they will have to undo.<br/>\n<br/>\n&lt;&lt;Perhaps you should think about how many people you turn off looking for <br/>\nhelp <br/>\nbecause they have been so hurt by what you have written.&gt;&gt;<br/>\n<br/>\nLuckily I&#39;m not the only unschooler volunteering to help other people on my <br/>\nown time then, or with the website I pay for, on the computer my husband bought <br/>\nso I could do this.    People have options.<br/>\n<br/>\n&lt;&lt;I have no idea if I&#39;ll ever post again, primarily because people don&#39;t <br/>\nappear <br/>\nto be given the benefit of the doubt that what they write is not meant <br/>\nliterally, that they might be rushed or distracted, that words are not <br/>\ncarefully <br/>\nwritten so as not to upset.&gt;&gt;<br/>\n<br/>\nWords reflect thought.  <br/>\nIf you think that way when you&#39;re rushed, it&#39;s the way you think.  If you <br/>\nunthinkingly, unconsciously chose those phrases to describe your child, then they <br/>\nare in you, close to the surface, where others can see them and read them.<br/>\n<br/>\nYou chose the words, I just quoted them back.<br/>\n<br/>\nDon&#39;t get angry with the mirror.<br/>\n<br/>\n&lt;&lt; I haven&#39;t got the time or energy to get into it.&gt;&gt;<br/>\n<br/>\nUnschooling does take time and energy.  You NEED to find time and energy.<br/>\nYou don&#39;t need to spend it on this list if you don&#39;t want to, but without <br/>\nyour putting effort and time into changing, unschooling won&#39;t be a viable option <br/>\nfor you.<br/>\n<br/>\n&lt;&lt;By the way I detest and refute the inference that my son gets so caught up <br/>\nin <br/>\ntv because of abuse/nagging/whatever from adults. You don&#39;t know me and you <br/>\ndon&#39;t know him.&gt;&gt;<br/>\n<br/>\nNow many parallel situations would satisfy you that I&#39;ve seen it before many <br/>\ntimes?<br/>\n<br/>\n&lt;&lt;Sometimes I do lose sight of my son, but I wanted ways to block out <br/>\nall the stuff that distracts me.&gt;&gt;<br/>\n<br/>\nI don&#39;t see that anything I wrote or that anyone else wrote was intended to <br/>\ndo anything except point you away from your blockages and directly toward your <br/>\nson.<br/>\n<br/>\nLots of people who don&#39;t really want to unschool find someone to blame.  <br/>\nSometimes it&#39;s me.   Their blame doesn&#39;t make me guilty.<br/>\n<br/>\nHere, some testimonials from people who have read here and changed their <br/>\nlives:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/list\">http://sandradodd.com/list</a><br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":2300774,"authorName":"Elizabeth Hill","from":"Elizabeth Hill &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: A warm hello from the UK- and some questions!","postDate":"1075773730","msgId":90119,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQwMUYwMTIyLjcwNDAxMDNAZWFydGhsaW5rLm5ldD4=","referencesHeader":"PDExMy4yZTUzOGRkYS4yZDUwM2E4MEBhb2wuY29tPg=="},"prevInTopic":90110,"nextInTopic":90121,"prevInTime":90118,"nextInTime":90120,"topicId":90029,"numMessagesInTopic":0,"msgSnippet":"** And how do you know that people haven t faced loads of criticism in their home edding journey so far?** I really want to encourage you be a little more","messageBody":"<div id=\"ygrps-yiv-1221172891\">** And how do you know that people haven&#39;t faced loads of criticism in <br/>\ntheir<br/>\nhome edding journey so far?**<br/>\n<br/>\nI really want to encourage you be a little more tolerant.<br/>\n<br/>\n**Of course** people don&#39;t know all about you and can&#39;t see you <br/>\naccurately.  What do you expect?  It&#39;s a leap to offer suggestions based <br/>\non just a few paragraphs.  Consequentially, this list can only give <br/>\nfairly broad and general advice.  Most all readers here can learn <br/>\nsomething from that.  Advice that is useless for you may fit someone <br/>\nelse&#39;s circumstances.<br/>\n<br/>\nIf you want custom tailored advice and deep perceptiveness about the <br/>\ndetails of your particular issues, then I suggest that you pay for it. <br/>\n Likely it will be quite expensive.<br/>\n<br/>\nBetsy</div>","specialLinks":[]},{"userId":116578718,"authorName":"myrtlehogwash@aol.com","from":"myrtlehogwash@...","profile":"jimjam003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: A warm hello from the UK- and some questions!","postDate":"1075765376","msgId":90110,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDExMy4yZTUzOGRkYS4yZDUwM2E4MEBhb2wuY29tPg=="},"prevInTopic":90108,"nextInTopic":90119,"prevInTime":90109,"nextInTime":90111,"topicId":90029,"numMessagesInTopic":0,"msgSnippet":"... I never said *I* was turned off because of something one person posted on one list. I intend to stick around because I need to glean information. But it ","messageBody":"<div id=\"ygrps-yiv-289023844\">Dawn writes about Debbie:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Man, the power people give over to others. If people are turned off because <br/>\n&gt; of something one person posted on one list than maybe they aren&#39;t ready for <br/>\n&gt; unschooling because you can bet it will not be the last nor the least of the <br/>\n&gt; critcism they face. I found once I stopped thinking about how much a certain <br/>\n&gt; criticism hurt me and focused on what was in the criticism that could help <br/>\n&gt; me...well that&#39;s when I started to grow. Life is too short to play victim or <br/>\n&gt; blame others for steps not taken.<br/>\n&gt; <br/>\n&gt;  Dawn (in NS)<br/>\n&gt; <br/>\n </span></blockquote> I never said *I* was turned off because of something one person posted on <br/>\none list. I intend to stick around because I need to glean information. But it <br/>\nalso doesn&#39;t mean that people cannot reply to things they don&#39;t agree with.<br/>\nAnd how do you know that people haven&#39;t faced loads of criticism in their <br/>\nhome edding journey so far?<br/>\nMan, there are a lot of assumptions made on this list.<br/>\nDebbie.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":162967824,"authorName":"Dawn Adams","from":"&quot;Dawn Adams&quot; &lt;Wishbone@...&gt;","profile":"bluenosegoddess","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: A warm hello from the UK- and some questions!","postDate":"1075763792","msgId":90108,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMWQwMWMzZTllMiQ5OGNjMWM2MCQ3NDRjZGUxOEBhb2xkc2wubmV0Pg==","referencesHeader":"PDhlLjI2NzFlMmIuMmQ1MDJmMzBAYW9sLmNvbT4="},"prevInTopic":90104,"nextInTopic":90110,"prevInTime":90107,"nextInTime":90109,"topicId":90029,"numMessagesInTopic":0,"msgSnippet":"... Man, the power people give over to others. If people are turned off because of something one person posted on one list than maybe they aren t ready for","messageBody":"<div id=\"ygrps-yiv-31086481\">Debbie writes about Sandra:<br/>\n<blockquote><span title=\"ireply\">   &gt;But perhaps *you* should phrase your words a little more carefully.<br/>\n  &gt;Perhaps you should have a less judgemental take on what others write.<br/>\n  &gt;Perhaps you should walk a mile in someone&#39;s shoe, metophorically speaking, <br/>\n  &gt;before writing such stuff.<br/>\n  &gt;Perhaps you should think about how many people you turn off looking for help <br/>\n  &gt;because they have been so hurt by what you have written.<br/>\n<br/>\n </span></blockquote>  Man, the power people give over to others. If people are turned off because of something one person posted on one list than maybe they aren&#39;t ready for unschooling because you can bet it will not be the last nor the least of the critcism they face. I found once I stopped thinking about how much a certain criticism hurt me and focused on what was in the criticism that could help me...well that&#39;s when I started to grow. Life is too short to play victim or blame others for steps not taken.<br/>\n<br/>\n  Dawn (in NS)<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":116578718,"authorName":"myrtlehogwash@aol.com","from":"myrtlehogwash@...","profile":"jimjam003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: A warm hello from the UK- and some questions!","postDate":"1075762480","msgId":90104,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhlLjI2NzFlMmIuMmQ1MDJmMzBAYW9sLmNvbT4="},"prevInTopic":90103,"nextInTopic":90108,"prevInTime":90103,"nextInTime":90105,"topicId":90029,"numMessagesInTopic":0,"msgSnippet":"Sandra, I have debated long and hard all day about if and what I would reply to your email. I have lurked long enough to know that you do upset people and the","messageBody":"<div id=\"ygrps-yiv-1091886212\">Sandra,<br/>\nI have debated long and hard all day about if and what I would reply to your <br/>\nemail.<br/>\nI have lurked long enough to know that you do upset people and the &quot;if you <br/>\nwant us to tell you what a wonderful mum you are then you&#39;ve come to the wrong <br/>\nplace&quot; reply gets trotted out if people voice any upset. I didn&#39;t want to be <br/>\ntold I was wonderful, you don&#39;t know me so how could you? But I didn&#39;t want to <br/>\nbe told I was crap either, you don&#39;t know me so how could you?<br/>\n<br/>\nHowever, I could not let your post go by without a reply.<br/>\nI don&#39;t have the luxury of lots of time on the computer, much less to post, <br/>\nand anything I do post is written mainly off the cuff.<br/>\nI appreciate I should triple check but sometimes I get to a point where I <br/>\nwould like help and so take the risk that my posts will be given the benefit of <br/>\nthe doubt. It&#39;s a tough call, seek the advice I need and write it in a hurry <br/>\nand hope it&#39;s taken in the spirit it&#39;s meant or to muddle along on my own.<br/>\n<br/>\nWhat particularly upset me was your response to my trying to explain how <br/>\ninvolved my son gets when watching tv. Yes, my remark about burning houses should <br/>\nhave been a little more thought out. <br/>\nBut perhaps *you* should phrase your words a little more carefully.<br/>\nPerhaps you should have a less judgemental take on what others write.<br/>\nPerhaps you should walk a mile in someone&#39;s shoe, metophorically speaking, <br/>\nbefore writing such stuff.<br/>\nPerhaps you should think about how many people you turn off looking for help <br/>\nbecause they have been so hurt by what you have written.<br/>\n<br/>\nI have no idea if I&#39;ll ever post again, primarily because people don&#39;t appear <br/>\nto be given the benefit of the doubt that what they write is not meant <br/>\nliterally, that they might be rushed or distracted, that words are not carefully <br/>\nwritten so as not to upset.<br/>\n<br/>\nNo doubt you&#39;ll write a nice reply back, very eloquently put, with lots of <br/>\nnifty soundbites refuting word for word everything I have said. I haven&#39;t got <br/>\nthe time or energy to get into it. I just wish you, like me, had thought a <br/>\nlittle more before putting fingers to keyboard.<br/>\n<br/>\nBy the way I detest and refute the inference that my son gets so caught up in <br/>\ntv because of abuse/nagging/whatever from adults. You don&#39;t know me and you <br/>\ndon&#39;t know him.<br/>\n<br/>\nIt&#39;s taken a lot of guts for me to post originally and to post this. I didn&#39;t <br/>\nwant to get into a row. I just wanted some help in finding a way to be <br/>\nconfident in unschooling, not to be swayed by those around me and to find peace on <br/>\nmy path. Sometimes I do lose sight of my son, but I wanted ways to block out <br/>\nall the stuff that distracts me.<br/>\nI have no idea if  I will ever find any of that. Obviously if I could on my <br/>\nown I wouldn&#39;t have written in the first place. <br/>\nDebbie.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":6770123,"authorName":"BonKnit@aol.com","from":"BonKnit@...","profile":"pampmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: A warm hello from the UK- and some questions!","postDate":"1075760609","msgId":90103,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEwZi4yYjkzMTkxMS4yZDUwMjdlMUBhb2wuY29tPg=="},"prevInTopic":90094,"nextInTopic":90104,"prevInTime":90102,"nextInTime":90104,"topicId":90029,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/2/2004 9:12:46 AM Central Standard Time, ... Wow, that is so true. In 5yrs he could be doing the same thing but by then you are ok with it","messageBody":"<div id=\"ygrps-yiv-1877664\">In a message dated 2/2/2004 9:12:46 AM Central Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:cen46624@...\">cen46624@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; This is really two different questions. One has to do with how much <br/>\n&gt; screen time he&#39;s using, and the other has to do with your comfort level. <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Wow, that is so true. In 5yrs he could be doing the same thing but by then <br/>\nyou are ok with it or even if he isn&#39;t doing it by then you might be ok with it <br/>\neven if he was.<br/>\nLaura<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: A warm hello from the UK- and some questions!","postDate":"1075738228","msgId":90094,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZmLjQxM2VlYzU3LjJkNGZkMDc0QGFvbC5jb20+"},"prevInTopic":90088,"nextInTopic":90103,"prevInTime":90093,"nextInTime":90095,"topicId":90029,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/2/04 4:42:21 AM, myrtlehogwash@aol.com writes: ","messageBody":"<div id=\"ygrps-yiv-179270120\">In a message dated 2/2/04 4:42:21 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:myrtlehogwash@...\">myrtlehogwash@...</a> writes:<br/>\n<br/>\n&lt;&lt; Say if in five years time he is still watching more <br/>\n<br/>\ntv/playing on gameboy etc than I am comfortable with and he is still <br/>\n<br/>\nnot reading and writing? &gt;&gt;<br/>\n<br/>\nIf in five years you hadn&#39;t become more comfortable with tv and gameboy, you <br/>\nwouldn&#39;t be making the progress you will need to make for unschooling to work.<br/>\n<br/>\n&lt;&lt;Yes, but it&#39;s having the nerve, in my case, to sit it out while he <br/>\n<br/>\ngets his fill. &gt;&gt;<br/>\n<br/>\nThen it&#39;s not that he would play it all day, you&#39;re saying that if he didn&#39;t <br/>\nmake you stop worrying about TV by turning it off, you would worry all the <br/>\ntime. &lt;g&gt;<br/>\n<br/>\n&lt;&lt;Say if in five years time he is still watching more <br/>\n<br/>\ntv/playing on gameboy etc than I am comfortable with and he is still <br/>\n<br/>\nnot reading and writing? &gt;&gt;<br/>\n<br/>\nI&#39;ve never seen that happen. <br/>\n<br/>\nBut by &quot;writing&quot; you probably have something in mind that is very schoolish <br/>\n(I&#39;m guessing) and speaking as someone who has &quot;taught writing,&quot; I know that <br/>\nthe idea of writing is VERY very broad and I don&#39;t know whether you&#39;re thinking <br/>\npenmanship or three page essays written just because an adult (a teacher or a <br/>\nnervous mother) &quot;assigned&quot; a child to write about something in an unnatural <br/>\nfashion.  Practice writing, not real writing.<br/>\n<br/>\nIt doesn&#39;t matter right now what you&#39;re thinking of as &quot;writing,&quot; just as <br/>\nlong as you do start thinking that what you&#39;re thinking might need examination <br/>\nand adjustment.<br/>\n<br/>\n&lt;&lt;I just feel like I have this one chance at <br/>\n<br/>\ngetting his education right and if he doesn&#39;t become motivated to <br/>\n<br/>\nlearn anything I will be left with regrets and will have messed up <br/>\n<br/>\nhis future.&gt;&gt;<br/>\n<br/>\nAn irritating guy in a real-time scheduled online chat once asked me <br/>\n(thinking to trip me up badly) &quot;Are you willing to risk your child&#39;s future on your <br/>\n&#39;theory&#39;?&quot;<br/>\n<br/>\nI had one of those lucky moments of time-stood-still clarity, and returned <br/>\n&quot;Yes, and so are you&quot; and went on to point out what I had never thought before <br/>\nthe moment.  People who put their kids in school on the theory (usually <br/>\nunexamined) that it&#39;s the best place for them to become successful.<br/>\n<br/>\nAt least I had really thought my &quot;theory&quot; through and was involved every <br/>\nsingle day of my life, unlike this guy, whose kids were going to be in school.<br/>\n<br/>\n&lt;&lt;It is hard, and it must be frustrating for those of you who have been <br/>\n<br/>\nunschooling for years, but please bear with me.&gt;&gt;<br/>\n<br/>\nYes, but for your part could you read with the knowledge that everyone had to <br/>\nstep away from the school and let a lot of their own upbringing, fears, inner <br/>\nvoices and &quot;knowledge&quot; go?    <br/>\n<br/>\n&lt;&lt;Once the tv is on he is stuck. The house could be on fire and he <br/>\n<br/>\nwouldn&#39;t be able to rouse himself. He is like a total zombie and <br/>\n<br/>\ncannot talk or hear apparently when the set is on.&gt;&gt;<br/>\n<br/>\nFirst, I don&#39;t believe it, and it&#39;s a rude thing to say and to have thought <br/>\nabout your child, that he could be in a burning house and not respond.  Very <br/>\ncold.<br/>\n<br/>\nThere are reasons children will ignore other input.  My younger cousin who <br/>\nhad been abused and neglected, abandoned, taken away by the state and finally <br/>\ncame to live with us would get stuck to the TV.  She didn&#39;t hear adults talk to <br/>\nher, but she heard other kids.  She had just heard all the adult nonsense she <br/>\ncould stand and didn&#39;t want to hear any more.  <br/>\n<br/>\nIf he&#39;s watching something that&#39;s really interesting and you interrupt right <br/>\nin the middle of a speech, you were wrong and he was right.  If it&#39;s a video <br/>\nor DVD, ask him to pause it.  If it&#39;s a tv show, wait for the commercial.   If <br/>\nyou have been yelling fire in the theatre just to test him, or treating him as <br/>\nthough your slightest utterance is more important than his near-hour <br/>\ninvestment in a story, he might be learning to tune out in self defense.    And this <br/>\nmight NOT apply, but I&#39;m braving such a guess because of the disdainful words <br/>\nyou choose when discussing this.   <br/>\n<br/>\nIf you only interrupt if it&#39;s really important, I bet he will start paying <br/>\nattention to your interruptions.  But otherwise, it would be like someone <br/>\npicking up a book you&#39;d been reading for a week, tearing out the last chapter and <br/>\nthrowing it in the fire.  Or maybe just the one page you&#39;re on.   You can miss <br/>\nthat page.  If not, books have too much of a hold over you.  You&#39;re a zombie.  <br/>\nBooks should be banned from your life because when you were reading you were <br/>\nignoring the world around you.<br/>\n<br/>\n&lt;&lt;Not sure if anyone <br/>\n<br/>\nhas read/heard of the book &quot;Set Free Childhood&quot; about television and <br/>\n<br/>\nhow it affects the brain etc. Not comfortable reading and one I <br/>\n<br/>\nsometimes wish I hadn&#39;t read.&gt;&gt;<br/>\n<br/>\nI&#39;ve read three anti-TV books, but not that one.<br/>\nThey were all nonsense from the same source, it seemed to me.<br/>\nReally.  <br/>\nEven when I didn&#39;t have kids to be fearful about I read one and it seemed so <br/>\ntrite and unscientific and based on prejudice that I was embarrassed for him.  <br/>\nBut when prejudice abounds, people will welcome what seems like support for <br/>\ntheir prejudice.<br/>\n<br/>\n&lt;&lt;Well, obviously he&#39;s not doing the two things constantly <br/>\n<br/>\nsimultaneously. I had been limiting the tv but if I hadn&#39;t those <br/>\n<br/>\nwould be the two things he would be doing but at different times.&gt;&gt;<br/>\n<br/>\nAnd neither of those (watching TV and playing) is a bad thing to be doing.   <br/>\nAnd if he&#39;s doing even just TWO things at the same time, you wronged him by <br/>\nsaying &quot;constantly.&quot;   His life should merit your honest and loving regard.  <br/>\nYou&#39;re writing of him here in a way that suggests a lack of direct seeing of him, <br/>\nhimself, as the man he will be after you&#39;re gone.   He&#39;s just the young <br/>\nversion of his whole self.  He&#39;s real now.  He&#39;s whole now.  He&#39;s not a lump you <br/>\ncan insult and control and mold.   He can be seen that way, but it won&#39;t create <br/>\na good relationship between you and him.   It won&#39;t help you see that what he <br/>\nis learning now is what he will grow up with.  Please try not to have him <br/>\nlearn that his mom doesn&#39;t think much of him and doesn&#39;t see him clearly.<br/>\n<br/>\n&lt;&lt;And <br/>\n<br/>\nwhile I know playing is great I also know that people do need to <br/>\n<br/>\nlearn to read and write and be numerate and I had thought that at 7 <br/>\n<br/>\nthis desire might kick in. Maybe I expect too much.  &gt;&gt;<br/>\n<br/>\nI think you&#39;re expecting to much and too soon.<br/>\n<br/>\nBut here&#39;s what I don&#39;t think you do know:   <br/>\nReading and writing and mathematics can come from playing video games, <br/>\nplaying with other children, and watching TV and movies.   They can come from <br/>\nplaying with Lego and other construction things, especially if you get books and <br/>\nmagazines with patterns, pictures of other people&#39;s creations with captions.  <br/>\nPlayers&#39; guides for video games.  TV schedules.  Books or magazines with <br/>\ninformation on his favorite movies or TV shows could help, but NOT if you get them and <br/>\ntry to make him read aloud to you.  If you get them and read them TO him, or <br/>\njust let him look at the photos, and then put them aside in a safe place for <br/>\nhim so he can come back and read them later.<br/>\n<br/>\nSome families throw out too much stuff.  Kirby has ever issue of Nintendo <br/>\nPower he ever got.  We bought him magazine boxes and helped him keep them in <br/>\norder.  He bought an index with his own money before he could even read, and would <br/>\nask me to look things up.   Because of that index, he learned the notation <br/>\nthat is also used in much research, the Bible, Shakespeare, which is that if the <br/>\nindex said 15:38 it meant issue #15, page 38.  That prevented the need EVER <br/>\nfor explaining what future notations would mean.  Doesn&#39;t matter, either, that <br/>\nShakespeare notations will use Roman numerals in part, because he learned <br/>\nRoman numerals from playing Mega Man.<br/>\n<br/>\nI could ramble on, and in the course of my life I do. &lt;g&gt;  <br/>\n<br/>\nI know we can help you feel better about natural learning, and I know it&#39;s a <br/>\nhard step to take.    If you&#39;re able to, in May, there is a big home education <br/>\ncamp-out called HesFes in the south of England somewhere and you could look <br/>\nit up on the internet, or ask on a local list if you&#39;re hooked up there <br/>\nalready.  If you went there you would probably meet lots of families of different <br/>\npersuasions.<br/>\n<br/>\nI was lucky, before I even thought of homeschooling, to be in a babysitting <br/>\nco-op/playgroup with a +/- a dozen families (once as many as 18) and four <br/>\nfamilies homeschooled.  Two used structure and curriculum and rules and one poor gir<br/>\nl kept being left home, losing the privilege of coming to the park to play <br/>\nbecause she hadn&#39;t &quot;done her math,&quot; or she would be left in the car where she <br/>\ncould see the kids playing but couldn&#39;t get out.   Two families were <br/>\nunschoolers, and I saw how close the parents were with the children, how when the <br/>\nchildren talked the parents really listened, patiently, and happily, and that the <br/>\nchildren WANTED to be with their parents.  I wanted that for my family, so when <br/>\nit became apparent that Kirby and kindergarten weren&#39;t a match, I didn&#39;t even <br/>\nconsider the structured way.  I didn&#39;t want that animosity, that &quot;us and them,&quot; <br/>\nthat disdain.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":101672438,"authorName":"Diane","from":"Diane &lt;cen46624@...&gt;","profile":"thegreatdiane","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: A warm hello from the UK- and some questions!","postDate":"1075738121","msgId":90086,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQwMUU3NjA5LjMwNDA1MDZAdm9sLmNvbT4=","inReplyToHeader":"PGJ2bGN2ZitiNWtmQGVHcm91cHMuY29tPg==","referencesHeader":"PGJ2bGN2ZitiNWtmQGVHcm91cHMuY29tPg=="},"prevInTopic":90080,"nextInTopic":90087,"prevInTime":90085,"nextInTime":90087,"topicId":90029,"numMessagesInTopic":0,"msgSnippet":"... This is really two different questions. One has to do with how much screen time he s using, and the other has to do with your comfort level. It s easy to","messageBody":"<div id=\"ygrps-yiv-955002243\"><blockquote><span title=\"ireply\">&gt;Say if in five years time he is still watching more <br/>\n&gt;tv/playing on gameboy etc than I am comfortable with and he is still <br/>\n&gt;not reading and writing? <br/>\n&gt;<br/>\n<br/>\n </span></blockquote>This is really two different questions. One has to do with how much <br/>\nscreen time he&#39;s using, and the other has to do with your comfort level. <br/>\nIt&#39;s easy to confuse the two, but it&#39;s very important to separate them <br/>\nout when you&#39;re getting concerned. Keep a record for one week of what&#39;s <br/>\n*really* happening. A journal can be good if you&#39;re a writer, but just a <br/>\nlist: 6 a.m asleep 7 a.m. eating watching TV, 8 a.m. fixing bike, <br/>\nwhatever like that may help clarify exactly what&#39;s happening. The idea <br/>\nof &quot;all the time&quot; is one of those phrases we use to scare ourselves, but <br/>\nit doesn&#39;t really say anything.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I just feel like I have this one chance at <br/>\n&gt;getting his education right and if he doesn&#39;t become motivated to <br/>\n&gt;learn anything I will be left with regrets and will have messed up <br/>\n&gt;his future.<br/>\n&gt;<br/>\n<br/>\n&gt; Once the tv is on he is stuck. The house could be on fire and he<br/>\n&gt;<br/>\n&gt;wouldn&#39;t be able to rouse himself. He is like a total zombie and <br/>\n&gt;cannot talk or hear apparently when the set is on. <br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Try this experiment: turn on the TV to his favorite show at a time you <br/>\nwon&#39;t *need* anything from him for days. Bring food. see if it&#39;s <br/>\nliterally true that he can&#39;t walk away. If you see him away from the <br/>\nset, or you see it off, you&#39;ll know it&#39;s possible for him to get away.<br/>\n<br/>\nActually I got rid of my TV for many years as an adult because I felt <br/>\nexactly that way, like I was &quot;stuck&quot; once it was on, but I was able to <br/>\naddress it and make my own decisions regarding that after nobody else <br/>\nwas making those decision *for* me.<br/>\n<br/>\n:-) Diane</div>","specialLinks":[]},{"userId":73238415,"authorName":"J. Stauffer","from":"&quot;J. Stauffer&quot; &lt;jnjstau@...&gt;","profile":"jnjstau","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: A warm hello from the UK- and some questions!","postDate":"1075735302","msgId":90088,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNDYwMWMzZTlhMCQ0MzRkM2I4MCQxNDg1ZWU0MEB5b3VybzBrd2t3OWp3Yz4=","referencesHeader":"PGJ2bGN2ZitiNWtmQGVHcm91cHMuY29tPg=="},"prevInTopic":90087,"nextInTopic":90094,"prevInTime":90087,"nextInTime":90089,"topicId":90029,"numMessagesInTopic":0,"msgSnippet":"... I think you are just still very much on school time .  Think about what 7yo boys do......there is really very little that they truly NEED to read or write","messageBody":"<div id=\"ygrps-yiv-1071879103\">&lt;&lt;&lt;&lt;&lt;I also know that people do need to<br/>\n<blockquote><span title=\"ireply\"> &gt; learn to read and write and be numerate and I had thought that at 7<br/>\n&gt; this desire might kick in. Maybe I expect too much. &gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>I think you are just still very much on &quot;school time&quot;.  Think about what 7yo<br/>\nboys do......there is really very little that they truly NEED to read or<br/>\nwrite or know numbers.<br/>\n<br/>\nBut as they NEED it, they DO learn it.  When he decides he wants to warm his<br/>\nown food in the microwave, he will start to recognize numbers so he can push<br/>\nthe buttons.<br/>\n<br/>\nWhen he decides that it is easier to read the video game instructions<br/>\nhimself rather than find you to do it, he will start to read.<br/>\n<br/>\nWhen he has trouble remembering what he needs to get at the store, he will<br/>\nstart to write so he can make a list.<br/>\n<br/>\nIt truly is no more complicated than that.<br/>\n<br/>\nJulie S.</div>","specialLinks":[]},{"userId":128695025,"authorName":"Wife2Vegman","from":"Wife2Vegman &lt;wifetovegman2002@...&gt;","profile":"wifetovegman2002","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Learning to Read, Write, and Numerate (was Re: A warm hello from the UK)","postDate":"1075734962","msgId":90087,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwMjAyMTUxNjAyLjUwMDQucW1haWxAd2ViNDE0MTMubWFpbC55YWhvby5jb20+","inReplyToHeader":"PGJ2bGN2ZitiNWtmQGVHcm91cHMuY29tPg=="},"prevInTopic":90086,"nextInTopic":90088,"prevInTime":90086,"nextInTime":90088,"topicId":90029,"numMessagesInTopic":0,"msgSnippet":"... You might want to read:  Learning All The Time by John Holt. It describes how learning is taking place through our children s choices of activity,","messageBody":"<div id=\"ygrps-yiv-1591807002\">--- Debbie &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:myrtlehogwash@...\">myrtlehogwash@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; And <br/>\n&gt; while I know playing is great I also know that<br/>\n&gt; people do need to <br/>\n&gt; learn to read and write and be numerate and I had<br/>\n&gt; thought that at 7 <br/>\n&gt; this desire might kick in. Maybe I expect too much. <br/>\n<br/>\n<br/>\n </span></blockquote>You might want to read:  &#39;Learning All The Time&#39; by<br/>\nJohn Holt.<br/>\n<br/>\nIt describes how learning is taking place through our<br/>\nchildren&#39;s choices of activity, teaching them the<br/>\nbasics as well as preparing them for learning about<br/>\ntheir interests.<br/>\n<br/>\nHere is a link to it at amazon.com<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.amazon.com/exec/obidos/tg/detail/-/0201550911/qid=1075734846//ref=sr_8_xs_ap_i5_xgl14/103-9747728-7367054?v=glance&s=books&n=507846\">http://www.amazon.com/exec/obidos/tg/detail/-/0201550911/qid=1075734846//ref=sr_8_xs_ap_i5_xgl14/103-9747728-7367054?v=glance&s=books&n=507846</a><br/>\n<br/>\n<br/>\n<br/>\n=====<br/>\n--Susan in VA<br/>\nWifetoVegman<br/>\n<br/>\nWhat is most important and valuable about the home as a base for children&#39;s growth into the world is not that it is a better school than the schools, but that it isn&#39;t a school at all.  John Holt<br/>\n<br/>\n__________________________________<br/>\nDo you Yahoo!?<br/>\nYahoo! SiteBuilder - Free web site building tool. Try it!<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://webhosting.yahoo.com/ps/sb/\">http://webhosting.yahoo.com/ps/sb/</a></div>","specialLinks":[]},{"userId":116578718,"authorName":"Debbie","from":"&quot;Debbie&quot; &lt;myrtlehogwash@...&gt;","profile":"jimjam003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: A warm hello from the UK- and some questions!","postDate":"1075722031","msgId":90080,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJ2bGN2ZitiNWtmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGE0LjQyNDE1OGNmLjJkNGRhZTgyQGFvbC5jb20+"},"prevInTopic":90076,"nextInTopic":90086,"prevInTime":90079,"nextInTime":90081,"topicId":90029,"numMessagesInTopic":0,"msgSnippet":"... nobody ... On the ... what he wanted and ... Yes, but it s having the nerve, in my case, to sit it out while he gets his fill. This is a bit like how long","messageBody":"<div id=\"ygrps-yiv-1484703330\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, SandraDodd@a... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Here is my collection of &quot;if I let him, he will...&quot; statements, and <br/>\n </span></blockquote>nobody <br/>\n<blockquote><span title=\"ireply\"> &gt; has ever come back and proven their dire predictions to be true.  <br/>\n </span></blockquote>On the <br/>\n<blockquote><span title=\"ireply\"> &gt; contrary, people come back and say &quot;You were right.  I let him do <br/>\n </span></blockquote>what he wanted and <br/>\n<blockquote><span title=\"ireply\"> &gt; after a while he turned the TV off.  Some days it&#39;s not even on.&quot;<br/>\n<br/>\n </span></blockquote>Yes, but it&#39;s having the nerve, in my case, to sit it out while he <br/>\ngets his fill. This is a bit like &quot;how long is a piece of string&quot; <br/>\nquestion. How long might it take (not expecting any of you to answer <br/>\nthat one really)? Say if in five years time he is still watching more <br/>\ntv/playing on gameboy etc than I am comfortable with and he is still <br/>\nnot reading and writing? I just feel like I have this one chance at <br/>\ngetting his education right and if he doesn&#39;t become motivated to <br/>\nlearn anything I will be left with regrets and will have messed up <br/>\nhis future.<br/>\nIt is hard, and it must be frustrating for those of you who have been <br/>\nunschooling for years, but please bear with me.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; And on the other hand maybe you should spend some time watching <br/>\n </span></blockquote>WITH him so <br/>\n<blockquote><span title=\"ireply\"> &gt; you have more shared experience and things to talk about.  If <br/>\n </span></blockquote>watching TV is <br/>\n<blockquote><span title=\"ireply\"> &gt; his thing and complaining about TV is your thing, you spoiled a <br/>\n </span></blockquote>chance to have a <br/>\n<blockquote><span title=\"ireply\"> &gt; shared thing.<br/>\n<br/>\n </span></blockquote>This is a good point and obviously one that I haven&#39;t considered. <br/>\nThank you.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Very judgmental choice of terminology.  If he&#39;s there by choice, <br/>\n </span></blockquote>he&#39;s not <br/>\n<blockquote><span title=\"ireply\"> &gt; &quot;stuck.&quot;  If someone else sticks him there he&#39;s stuck.    &quot;The <br/>\n </span></blockquote>box&quot;?  It&#39;s not a hole to fall into.  It&#39;s an outpouring of music, <br/>\n<blockquote><span title=\"ireply\"> &gt;pictures, stories, voices, <br/>\n&gt; people.  My kids play and watch, walk and watch, brush the cat and <br/>\n </span></blockquote>watch, build <br/>\n<blockquote><span title=\"ireply\"> &gt; up the fire in the fireplace and watch.  Maybe you could bring his <br/>\n </span></blockquote>Lego in <br/>\n<blockquote><span title=\"ireply\"> &gt; there or get him a little trampoline so he&#39;d have something to do <br/>\n </span></blockquote>while he <br/>\n<blockquote><span title=\"ireply\"> &gt; watches.  Or maybe he&#39;s really engrossed and involved.<br/>\n<br/>\n </span></blockquote>Once the tv is on he is stuck. The house could be on fire and he <br/>\nwouldn&#39;t be able to rouse himself. He is like a total zombie and <br/>\ncannot talk or hear apparently when the set is on. Not sure if anyone <br/>\nhas read/heard of the book &quot;Set Free Childhood&quot; about television and <br/>\nhow it affects the brain etc. Not comfortable reading and one I <br/>\nsometimes wish I hadn&#39;t read.<br/>\n <br/>\n&lt;&lt;He also plays constantly, mostly with my eldest daughter. Which is <br/>\n<blockquote><span title=\"ireply\"> &gt;fine but I worry that he isn&#39;t learning *anything*.&gt;&gt;<br/>\n&gt; <br/>\n&gt; He must be living a double life if he&#39;s doing two things constantly.<br/>\n&gt; <br/>\n&gt; You must have learned, from all your examination and <br/>\n&gt;experimentation with different early childhood ed methods, that play <br/>\n&gt;is exactly how children learn.<br/>\n&gt;<br/>\n </span></blockquote>Well, obviously he&#39;s not doing the two things constantly <br/>\nsimultaneously. I had been limiting the tv but if I hadn&#39;t those <br/>\nwould be the two things he would be doing but at different times. And <br/>\nwhile I know playing is great I also know that people do need to <br/>\nlearn to read and write and be numerate and I had thought that at 7 <br/>\nthis desire might kick in. Maybe I expect too much.  <br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; Maybe he&#39;s bored and home and you should get him out more places.<br/>\n<br/>\n </span></blockquote>I don&#39;t think this is the case, he hardly ever says he&#39;s bored. We&#39;ve <br/>\ngot lots of stuff, he has me and his sisters and sees lots of <br/>\nfriends. We also go to lots of events arranged by our home-ed group. <br/>\nNo, I honestly don&#39;t think he&#39;s bored. <br/>\n<br/>\nI can&#39;t explain why it&#39;s so hard for me to embrace unschooling but I <br/>\nam trying. Thanks for your input. He has spent all morning playing <br/>\nLord of the Rings on his Gameboy and I haven&#39;t said a word! Progress <br/>\nfor me! Sorry this is long, I&#39;m rushing because dd1 is keen to get <br/>\nonto Barbie Swan Lake CD-ROM.<br/>\nDebbie</div>","specialLinks":[]},{"userId":141316284,"authorName":"pam sorooshian","from":"pam sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] A warm hello from the UK- and some questions!","postDate":"1075706532","msgId":90076,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg1MUQzRDlCLTU1NTAtMTFEOC04QTlCLTAwMEE5NUUyOTJDNkBtYWMuY29tPg==","inReplyToHeader":"PDAwMjIwMWMzZThjZiQ3MDQ4NWExMCQ2NTAxYThjMEBqZ2s2OTAwPg==","referencesHeader":"PEJBWTctRjY5ZGs3Nllia2ZhcWMwMDA2YTgzNUBob3RtYWlsLmNvbT4gPDAwMjIwMWMzZThjZiQ3MDQ4NWExMCQ2NTAxYThjMEBqZ2s2OTAwPg=="},"prevInTopic":90063,"nextInTopic":90080,"prevInTime":90075,"nextInTime":90077,"topicId":90029,"numMessagesInTopic":0,"msgSnippet":"... I really liked it, Danielle. It IS a good way to think about it. Those people who say Unschooling didn t work for us, are like people who invest one day","messageBody":"<div id=\"ygrps-yiv-1422953783\">On Feb 1, 2004, at 6:26 AM, Danielle Conger wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Unschooling&#39;s kind of like the stock market: you have to be in it for <br/>\n&gt; the<br/>\n&gt; long haul and look at the big picture. It&#39;s not all ups and it&#39;s not <br/>\n&gt; all<br/>\n&gt; downs, but from a narrow perspective it may look that way. Pull your<br/>\n&gt; investment too soon, and you&#39;ve missed the big payoff for focusing <br/>\n&gt; only on<br/>\n&gt; the immediate circumstance. Of course, the analogy falls apart when you<br/>\n&gt; think about the big crash--unschooling would never do that! ;)<br/>\n&gt;<br/>\n&gt; --danielle, who should really have more coffee before attempting <br/>\n&gt; analogies!<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>I really liked it, Danielle. It IS a good way to think about it. Those <br/>\npeople who say &quot;Unschooling didn&#39;t work for us,&quot; are like people who <br/>\ninvest one day and sell the next, at a loss, because they get scared if <br/>\nthe stock drops in value.<br/>\n<br/>\n-pam<br/>\nNational Home Education Network<br/>\n&lt;www.NHEN.org&gt;<br/>\nServing the entire homeschooling community since 1999<br/>\nthrough information, networking and public relations.</div>","specialLinks":[]},{"userId":165350390,"authorName":"Aimee","from":"Aimee &lt;aimeel73@...&gt;","profile":"aimeel73","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] A warm hello from the UK- and some questions!","postDate":"1075668882","msgId":90063,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwMjAxMjA1NDQyLjQwMDM4LnFtYWlsQHdlYjgwMDA2Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PGJ2aGY5OCtiaG1vQGVHcm91cHMuY29tPg=="},"prevInTopic":90058,"nextInTopic":90076,"prevInTime":90062,"nextInTime":90064,"topicId":90029,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-447081564\">&lt;&lt;Sorry for the long post but I need guidance and feel<br/>\nall at sea. Do <br/>\nyou think parents and children have to be of a certain<br/>\npersonality to <br/>\nsuccessfully unschool? I feel I&#39;ve made so many<br/>\nmistakes, <br/>\nparticularly where my son is concerned, and don&#39;t want<br/>\nto make any <br/>\nmore.&gt;&gt;<br/>\n<br/>\nFirst things first, BREATHE! lol<br/>\n<br/>\nIt sounds like you need to be able to think things<br/>\nthru clearly, instead of bouncing around and confusing<br/>\nyourself! You know the REM song, &quot; Stand in the place<br/>\nwhere you live.&quot;  Do that! lol<br/>\n<br/>\nIt seems like you&#39;re at a point where you have learned<br/>\na lot about what doesn&#39;t work, and you could look at<br/>\nthat as a good thing!  I mean, at least now you know,<br/>\nright?  <br/>\n<br/>\nNow you&#39;re putting all your eggs in an unschooling<br/>\nbasket, and that&#39;s scary because you&#39;re worried that<br/>\nthis is another mistake.<br/>\n<br/>\nI still worry about that sometimes, and it&#39;s been<br/>\nalmost 10 years.  Everytime I worry, I try to connect<br/>\nwith my son in a different way, or pay attention to<br/>\ndifferent aspects of his life, or just simply remind<br/>\nmyself to spend time with him as much as possible.<br/>\nWhenever I worry it&#39;s because I&#39;m living in the<br/>\nfuture, not with him, today.  *Every time.* Try to<br/>\nremember that, it might help.<br/>\n<br/>\nYour son sounds like he&#39;s deschooling now, and that&#39;s<br/>\ndifficult for a parent who&#39;s used to worksheets and<br/>\ncurriculums, so read up on it a bit.  ( there are<br/>\nplenty of links, do a search on google, or try<br/>\nunschooling.com, etc) <br/>\n<br/>\n   Unschooling can be difficult to acclimate yourself<br/>\nto, and people get uncomfortable sometimes when<br/>\nchallenging all these ideas and beliefs that we&#39;ve had<br/>\nfor so long. (Playing is not learning, judging what<br/>\nkind of learning is good or bad, watching TV is a<br/>\nwaste of time, etc)  I think that&#39;s normal, and it&#39;s<br/>\nalso a process that you can&#39;t really rush, just keep<br/>\npaying attention to it, and do what you can. <br/>\n<br/>\n  I do think that some parents are better unschoolers<br/>\nthan others, but I don&#39;t unschool because it&#39;s best<br/>\nfor me, we do it because it&#39;s best for our son.  It<br/>\nmight be harder work for us, because of that, but it&#39;s<br/>\nworth it!  <br/>\n<br/>\nI&#39;m not a very patient person, nor am a very flexible<br/>\nperson sometimes, but those things have improved with<br/>\ntime ( and effort!) while unschooling. My son is<br/>\nbetter off for it, and so am I.  I have never looked<br/>\nback and said to myself, oh, it would have been better<br/>\nfor me and him, if I had just stayed impatient and<br/>\nrigid and send him to school! <br/>\n<br/>\nDon&#39;t forget to breathe! Open up to the moments you<br/>\nhave with your children.  Enjoy.  Try to remember to<br/>\nlive *in the moment* when you get anxious. <br/>\n<br/>\nPeace~<br/>\nAimee</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] A warm hello from the UK- and some questions!","postDate":"1075660938","msgId":90058,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFjMi4xNDdhMzA4Zi4yZDRlYTI4YUBhb2wuY29tPg=="},"prevInTopic":90056,"nextInTopic":90063,"prevInTime":90057,"nextInTime":90059,"topicId":90029,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/1/04 8:23:08 AM, danielle.conger@comcast.net writes: ","messageBody":"<div id=\"ygrps-yiv-698045873\">In a message dated 2/1/04 8:23:08 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:danielle.conger@...\">danielle.conger@...</a> writes:<br/>\n<br/>\n&lt;&lt; Unschooling&#39;s kind of like the stock market: you have to be in it for the<br/>\n<br/>\nlong haul and look at the big picture. It&#39;s not all ups and it&#39;s not all<br/>\n<br/>\ndowns, but from a narrow perspective it may look that way. Pull your<br/>\n<br/>\ninvestment too soon, and you&#39;ve missed the big payoff for focusing only on<br/>\n<br/>\nthe immediate circumstance. Of course, the analogy falls apart when you<br/>\n<br/>\nthink about the big crash--unschooling would never do that! ;) &gt;&gt;<br/>\n<br/>\nI like this analogy!  <br/>\n<br/>\nThere could be the big crash of a kid deciding at 16 what he&#39;s really always <br/>\nwanted was military school. &lt;g&gt;<br/>\n<br/>\nThere could be something that makes the mom wish she had spent all those <br/>\nyears being a professional and getting paychecks, maybe.<br/>\n<br/>\nBut the idea that there are lulls is a good one.  Even with school, learning <br/>\ncurves aren&#39;t real curves.  There are artifical ideal curves on charts that <br/>\ndistricts draw, where one thing is learned, and the next skill builds on that, <br/>\netc., but I&#39;ve never known a single kid to actually follow any of those curves. <br/>\n In real-life situations, someone already knows something before the teacher <br/>\ntells it, or is ignoring the teacher because his dog died, and all that.  <br/>\nLearning (in school or not) happens in fits and starts, with rest periods between. <br/>\n School rewards kids being quiet, and so they eventually kill the advantage <br/>\nof sparkly sudden learning.   If the teachers don&#39;t get angry at a kid for <br/>\njumping up and saying &quot;HEY, I GET IT!  This is SO COOL,&quot; the other kids will laugh <br/>\nhim back into his seat.<br/>\n<br/>\nBut with unschooling the excited moments are lots of fun, and they don&#39;t <br/>\nhappen every day.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] A warm hello from the UK- and some questions!","postDate":"1075659277","msgId":90056,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFkMi4xOGYwMDg4Zi4yZDRlOWMwZEBhb2wuY29tPg=="},"prevInTopic":90055,"nextInTopic":90058,"prevInTime":90055,"nextInTime":90057,"topicId":90029,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/1/04 6:43:32 AM, salgenovese@worldnet.att.net writes: ","messageBody":"<div id=\"ygrps-yiv-1484318907\">In a message dated 2/1/04 6:43:32 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:salgenovese@...\">salgenovese@...</a> writes:<br/>\n<br/>\n&lt;&lt; My 3 year old son on the other hand did get to<br/>\n<br/>\na point where he was watching constantly every day - and it had the domino<br/>\n<br/>\neffect of drawing my daughter in to watch when if it hadn&#39;t been on she<br/>\n<br/>\nwould not have been doing that.   &gt;&gt;<br/>\n<br/>\nIf you had a child who read a lot of books, and another child was intrigued <br/>\nand then began to read a lot of the same books, and they had that common <br/>\nexperience so that they could discuss them, would you limit books?  Would you think <br/>\nthe first book-reader had lured the sibling into a world of evil books?<br/>\n<br/>\n&lt;&lt;And yes, it felt like we were starting to watch videos all day and <br/>\neverything else was<br/>\n<br/>\n&quot;after the videos, mom&quot;. &gt;&gt;<br/>\n<br/>\nVideos are gloriously &quot;pausable.&quot;  If there&#39;s something more rewarding for a <br/>\nchild to do, she&#39;ll probably be thrilled to do it.  If the alternatives are <br/>\nnot more rewarding, she&#39;s smart to do the thing which seems to her most <br/>\ninteresting.   That&#39;s where learning is, on the edge of interest.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":31945013,"authorName":"Joan Labbe & Salvatore Genovese","from":"&quot;Joan Labbe & Salvatore Genovese&quot; &lt;salgenovese@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] A warm hello from the UK- and some questions!","postDate":"1075655099","msgId":90055,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEhJRVBLT09FRUlBSUJISFBKRUJQQUVBSkNLQUEuc2FsZ2Vub3Zlc2VAd29ybGRuZXQuYXR0Lm5ldD4=","inReplyToHeader":"PDFjOC4xNGE0ZGZkZC4yZDRlNmNlOUBhb2wuY29tPg=="},"prevInTopic":90049,"nextInTopic":90056,"prevInTime":90054,"nextInTime":90056,"topicId":90029,"numMessagesInTopic":0,"msgSnippet":"That s an interesting way of putting it and it sounds like it fits what I ve done (although I don t think I had it as sorted out as that).  Joan ... From:","messageBody":"<div id=\"ygrps-yiv-1573537875\">That&#39;s an interesting way of putting it and it sounds like it fits what I&#39;ve<br/>\ndone (although I don&#39;t think I had it as sorted out as that).  Joan<br/>\n<br/>\n-----Original Message-----<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jrossedd@...\">jrossedd@...</a> [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jrossedd@...\">jrossedd@...</a>]<br/>\nSent: Sunday, February 01, 2004 9:53 AM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a><br/>\nSubject: Re: [UnschoolingDiscussion] A warm hello from the UK- and some<br/>\nquestions!<br/>\n<br/>\n<br/>\n       Okay. Here&#39;s what I am hearing: as the mom, you do limit some things<br/>\nto &quot;less than he would choose on his own&quot; but you don&#39;t have any rules to<br/>\nimpose &quot;more than he would choose on his own&quot; of things for his own good<br/>\nsuch as<br/>\neating vegetables, doing chores, reading, writing, studying, et cetera?<br/>\n<br/>\n       Is this right? (Not to set up an argument or anything, I just find<br/>\nthis more unusual than either no-limits and prescriptions or all kinds of<br/>\nlimits<br/>\nand prescriptions.)  JJ<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:salgenovese@...\">salgenovese@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I mean like eating sweets (my son is the one with the endless sweet tooth<br/>\n&gt; also while my daughter eats a bit then gets tired of it) - I attempt to go<br/>\n&gt; with minimal limits to things in general.<br/>\n&gt;<br/>\n&gt; Joan<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:salgenovese@...\">salgenovese@...</a> writes:<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &gt; So I set a limit on them of a number per day my<br/>\n&gt; &gt; son can watch which he respects like he respects limits to other things<br/>\n&gt; &gt; which his Mom thinks are great in small amounts but not so great if he&#39;s<br/>\n&gt; &gt; doing them all day long.  I don&#39;t prescribe what else he has to do other<br/>\n&gt; &gt; than the video watching, he decides that.<br/>\n&gt; &gt;<br/>\n&gt;<br/>\n&gt;        You say he respects limits on other things, but then seem to say<br/>\n </span></blockquote>this<br/>\n<blockquote><span title=\"ireply\"> &gt; is the only thing you prescribe. Could you clarify?  JJ<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n&quot;List Posting Policies&quot; are provided in the files area of this group.<br/>\n<br/>\nTo unsubscribe from this send an email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a><br/>\n<br/>\nVisit the Unschooling website and message boards: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\nTo visit your group on the web, go to:<br/>\n <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/UnschoolingDiscussion/\">http://groups.yahoo.com/group/UnschoolingDiscussion/</a><br/>\n<br/>\nTo unsubscribe from this group, send an email to:<br/>\n <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a><br/>\n<br/>\nYour use of Yahoo! Groups is subject to:<br/>\n <a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a></div>","specialLinks":[]},{"userId":7143857,"authorName":"jrossedd@aol.com","from":"jrossedd@...","profile":"jrossedd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] A warm hello from the UK- and some questions!","postDate":"1075647209","msgId":90047,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFjOC4xNGE0ZGZkZC4yZDRlNmNlOUBhb2wuY29tPg=="},"prevInTopic":90046,"nextInTopic":90049,"prevInTime":90046,"nextInTime":90048,"topicId":90029,"numMessagesInTopic":0,"msgSnippet":"Okay. Here s what I am hearing: as the mom, you do limit some things to less than he would choose on his own but you don t have any rules to impose more","messageBody":"<div id=\"ygrps-yiv-1732598753\">Okay. Here&#39;s what I am hearing: as the mom, you do limit some things <br/>\nto &quot;less than he would choose on his own&quot; but you don&#39;t have any rules to <br/>\nimpose &quot;more than he would choose on his own&quot; of things for his own good such as <br/>\neating vegetables, doing chores, reading, writing, studying, et cetera?<br/>\n<br/>\n       Is this right? (Not to set up an argument or anything, I just find <br/>\nthis more unusual than either no-limits and prescriptions or all kinds of limits <br/>\nand prescriptions.)  JJ<br/>\n<br/>\n       <br/>\n<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:salgenovese@...\">salgenovese@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I mean like eating sweets (my son is the one with the endless sweet tooth<br/>\n&gt; also while my daughter eats a bit then gets tired of it) - I attempt to go<br/>\n&gt; with minimal limits to things in general.<br/>\n&gt; <br/>\n&gt; Joan<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:salgenovese@...\">salgenovese@...</a> writes:<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; &gt; So I set a limit on them of a number per day my<br/>\n&gt; &gt; son can watch which he respects like he respects limits to other things<br/>\n&gt; &gt; which his Mom thinks are great in small amounts but not so great if he&#39;s<br/>\n&gt; &gt; doing them all day long.  I don&#39;t prescribe what else he has to do other<br/>\n&gt; &gt; than the video watching, he decides that.<br/>\n&gt; &gt;<br/>\n&gt; <br/>\n&gt;        You say he respects limits on other things, but then seem to say this<br/>\n&gt; is the only thing you prescribe. Could you clarify?  JJ<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":164542605,"authorName":"Danielle Conger","from":"&quot;Danielle Conger&quot; &lt;danielle.conger@...&gt;","profile":"danielleconger","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] A warm hello from the UK- and some questions!","postDate":"1075645613","msgId":90049,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMjIwMWMzZThjZiQ3MDQ4NWExMCQ2NTAxYThjMEBqZ2s2OTAwPg==","referencesHeader":"PEJBWTctRjY5ZGs3Nllia2ZhcWMwMDA2YTgzNUBob3RtYWlsLmNvbT4="},"prevInTopic":90047,"nextInTopic":90055,"prevInTime":90048,"nextInTime":90050,"topicId":90029,"numMessagesInTopic":0,"msgSnippet":"I feel like I am coming ... may ... ================================================= Dh and I went about 10 yrs without TV--no cable and no reception where we","messageBody":"<div id=\"ygrps-yiv-1608848684\">I feel like I am coming<br/>\n<blockquote><span title=\"ireply\"> &gt; across accusingly, but I am really just curious as to why some children<br/>\n </span></blockquote>may<br/>\n<blockquote><span title=\"ireply\"> &gt; choose to watch TV literally all day.  My kids do enjoy TV to a point, but<br/>\n&gt; there are so many other things for them to do that there are about 4 days<br/>\n&gt; out of the week that it never even gets turned on.<br/>\n&gt; Erika  :)<br/>\n </span></blockquote>=================================================<br/>\n<br/>\nDh and I went about 10 yrs without TV--no cable and no reception where we<br/>\nlived (we always had a vcr). So we don&#39;t do too much tv here; we do mostly<br/>\nvideos and DVDs. This is partly out of habit, I guess. But that&#39;s what the<br/>\nkids have grown up doing as well--pop in a video when they want to watch<br/>\nsomething. They know tv is out there and that there&#39;s fun stuff on it, but<br/>\nsomehow they associate it more with hotels than home. *g*<br/>\n<br/>\nSome days are &quot;watching days&quot; around here. Maybe somebody&#39;s sick or it&#39;s<br/>\nreally cold out. Maybe we&#39;ve just been going full speed for a while and need<br/>\nto relax. Point is, this goes in waves or spurts. We might watch lots of<br/>\nmovies for a while, but then we&#39;re off doing other things, having other<br/>\ninterests. In our lives, I don&#39;t think any one thing predominates. For a<br/>\nweek or so, it may seem like all we do is watch movies. For another week,<br/>\nwe&#39;re really into board games. Lately, we&#39;ve been really into Majesty--a new<br/>\ncastle sim game that we got for the computer. Felt like we were playing it<br/>\nall the time. Sometimes I&#39;d play by myself; I&#39;d play with dh or even 3<br/>\nplayers with our 6 yo over wireless. We were having fun and getting into a<br/>\nnew game. But that&#39;s slowing down now. (Well, dh is still geeking out,<br/>\nreading cheats and walkthroughs on his laptop while playing on the big<br/>\ncomputer. *g*) Next week, I&#39;m guessing we&#39;ll be hunkered down reading Harry<br/>\nPotter because we just watched the first two movies, which we borrowed from<br/>\nthe library.<br/>\n<br/>\nUnschooling&#39;s kind of like the stock market: you have to be in it for the<br/>\nlong haul and look at the big picture. It&#39;s not all ups and it&#39;s not all<br/>\ndowns, but from a narrow perspective it may look that way. Pull your<br/>\ninvestment too soon, and you&#39;ve missed the big payoff for focusing only on<br/>\nthe immediate circumstance. Of course, the analogy falls apart when you<br/>\nthink about the big crash--unschooling would never do that! ;)<br/>\n<br/>\n--danielle, who should really have more coffee before attempting analogies!</div>","specialLinks":[]},{"userId":31945013,"authorName":"Joan Labbe & Salvatore Genovese","from":"&quot;Joan Labbe & Salvatore Genovese&quot; &lt;salgenovese@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] A warm hello from the UK- and some questions!","postDate":"1075644695","msgId":90046,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEhJRVBLT09FRUlBSUJISFBKRUJQT0VBR0NLQUEuc2FsZ2Vub3Zlc2VAd29ybGRuZXQuYXR0Lm5ldD4=","inReplyToHeader":"PDEyYS4zYTc1NjAwZC4yZDRlNjEwOEBhb2wuY29tPg=="},"prevInTopic":90045,"nextInTopic":90047,"prevInTime":90045,"nextInTime":90047,"topicId":90029,"numMessagesInTopic":0,"msgSnippet":"I mean like eating sweets (my son is the one with the endless sweet tooth also while my daughter eats a bit then gets tired of it) - I attempt to go with","messageBody":"<div id=\"ygrps-yiv-1834450071\">I mean like eating sweets (my son is the one with the endless sweet tooth<br/>\nalso while my daughter eats a bit then gets tired of it) - I attempt to go<br/>\nwith minimal limits to things in general.<br/>\n<br/>\nJoan<br/>\n<br/>\n-----Original Message-----<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jrossedd@...\">jrossedd@...</a> [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jrossedd@...\">jrossedd@...</a>]<br/>\nSent: Sunday, February 01, 2004 9:03 AM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a><br/>\nSubject: Re: [UnschoolingDiscussion] A warm hello from the UK- and some<br/>\nquestions!<br/>\n<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:salgenovese@...\">salgenovese@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So I set a limit on them of a number per day my<br/>\n&gt; son can watch which he respects like he respects limits to other things<br/>\n&gt; which his Mom thinks are great in small amounts but not so great if he&#39;s<br/>\n&gt; doing them all day long.  I don&#39;t prescribe what else he has to do other<br/>\n&gt; than the video watching, he decides that.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>       You say he respects limits on other things, but then seem to say this<br/>\nis the only thing you prescribe. Could you clarify?  JJ<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n&quot;List Posting Policies&quot; are provided in the files area of this group.<br/>\n<br/>\nTo unsubscribe from this send an email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a><br/>\n<br/>\nVisit the Unschooling website and message boards: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\nTo visit your group on the web, go to:<br/>\n <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/UnschoolingDiscussion/\">http://groups.yahoo.com/group/UnschoolingDiscussion/</a><br/>\n<br/>\nTo unsubscribe from this group, send an email to:<br/>\n <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a><br/>\n<br/>\nYour use of Yahoo! Groups is subject to:<br/>\n <a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a></div>","specialLinks":[]},{"userId":7143857,"authorName":"jrossedd@aol.com","from":"jrossedd@...","profile":"jrossedd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] A warm hello from the UK- and some questions!","postDate":"1075644168","msgId":90045,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyYS4zYTc1NjAwZC4yZDRlNjEwOEBhb2wuY29tPg=="},"prevInTopic":90043,"nextInTopic":90046,"prevInTime":90044,"nextInTime":90046,"topicId":90029,"numMessagesInTopic":0,"msgSnippet":"... You say he respects limits on other things, but then seem to say this is the only thing you prescribe. Could you clarify?  JJ [Non-text portions of this","messageBody":"<div id=\"ygrps-yiv-846879803\"><a rel=\"nofollow\" target=\"_blank\" href=\"mailto:salgenovese@...\">salgenovese@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So I set a limit on them of a number per day my<br/>\n&gt; son can watch which he respects like he respects limits to other things<br/>\n&gt; which his Mom thinks are great in small amounts but not so great if he&#39;s<br/>\n&gt; doing them all day long.  I don&#39;t prescribe what else he has to do other<br/>\n&gt; than the video watching, he decides that.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>       You say he respects limits on other things, but then seem to say this <br/>\nis the only thing you prescribe. Could you clarify?  JJ<br/>\n<br/>\n       <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":31945013,"authorName":"Joan Labbe & Salvatore Genovese","from":"&quot;Joan Labbe & Salvatore Genovese&quot; &lt;salgenovese@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] A warm hello from the UK- and some questions!","postDate":"1075641807","msgId":90043,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEhJRVBLT09FRUlBSUJISFBKRUJQQUVBR0NLQUEuc2FsZ2Vub3Zlc2VAd29ybGRuZXQuYXR0Lm5ldD4=","inReplyToHeader":"PEJBWTctRjY5ZGs3Nllia2ZhcWMwMDA2YTgzNUBob3RtYWlsLmNvbT4="},"prevInTopic":90038,"nextInTopic":90045,"prevInTime":90042,"nextInTime":90044,"topicId":90029,"numMessagesInTopic":0,"msgSnippet":"... it ... I ll let Debbie speak for herself, but my experience has been that asking why one kid may choose to watch TV a lot is kind of like asking why one","messageBody":"<div id=\"ygrps-yiv-1819562758\"><blockquote><span title=\"ireply\">&gt;I am really just curious as to why some children may<br/>\n&gt;choose to watch TV literally all day.  My kids do enjoy TV to a point, but<br/>\n&gt;there are so many other things for them to do that there are about 4 days<br/>\n&gt;out of the week that it never even gets turned on.  Sometimes I wonder if<br/>\n </span></blockquote>it<br/>\n<blockquote><span title=\"ireply\"> &gt;is because their parents watch a lot of TV and don&#39;t have a lot of other<br/>\n&gt;activities that they are personally interested in....?  Or maybe kids can<br/>\n&gt;get &quot;scared&quot; of doing &quot;learning&quot; activities because they were graded<br/>\n&gt;previously, or critiqued too much...so in turn they find the TV a safe<br/>\n&gt;outlet?<br/>\n<br/>\n<br/>\n </span></blockquote>I&#39;ll let Debbie speak for herself, but my experience has been that asking<br/>\nwhy one kid may choose to watch TV a lot is kind of like asking why one kid<br/>\nhas a sweet tooth and wants to eat a lot of sugary things a lot as opposed<br/>\nto another kid with different taste buds.  I personally do not watch TV at<br/>\nall and am always making other alternatives available to my kids (ages 5 and<br/>\n3) that correspond to their interests.  They&#39;ve never been schooled and I do<br/>\nnot pressure them in any way so it&#39;s not related to that.  My 5 year old<br/>\ndoesn&#39;t generally request TV or videos much unless it&#39;s something new that<br/>\ncaught her fancy which she watches for a while then gets tired of.  Days go<br/>\nby and it can be forgotten.  My 3 year old son on the other hand did get to<br/>\na point where he was watching constantly every day - and it had the domino<br/>\neffect of drawing my daughter in to watch when if it hadn&#39;t been on she<br/>\nwould not have been doing that.  She would then want to watch &quot;the next<br/>\nvideo&quot; so as not to have her brother&#39;s preferences on all day.  And yes, it<br/>\nfelt like we were starting to watch videos all day and everything else was<br/>\n&quot;after the videos, mom&quot;.  So I set a limit on them of a number per day my<br/>\nson can watch which he respects like he respects limits to other things<br/>\nwhich his Mom thinks are great in small amounts but not so great if he&#39;s<br/>\ndoing them all day long.  I don&#39;t prescribe what else he has to do other<br/>\nthan the video watching, he decides that.<br/>\n<br/>\nI respect other people&#39;s different experiences and choices - this has been<br/>\nours.<br/>\n<br/>\nJoan</div>","specialLinks":[]},{"userId":140408439,"authorName":"Erika Nunn","from":"&quot;Erika Nunn&quot; &lt;erikanunn@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] A warm hello from the UK- and some questions!","postDate":"1075602532","msgId":90038,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTctRjY5ZGs3Nllia2ZhcWMwMDA2YTgzNUBob3RtYWlsLmNvbT4="},"prevInTopic":90033,"nextInTopic":90043,"prevInTime":90037,"nextInTime":90039,"topicId":90029,"numMessagesInTopic":0,"msgSnippet":"... I am intrigued with your situation, and want to understand where you are coming from more.  Do you ever present activities for your son outside of, or","messageBody":"<div id=\"ygrps-yiv-463170067\"><blockquote><span title=\"ireply\">&gt;&quot;but if I let him do exactly what he wants he will just watch tv <br/>\n&gt;constantly. I know many (all?) of you wouldn&#39;t have a problem with that&quot;<br/>\n<br/>\n </span></blockquote>I am intrigued with your situation, and want to understand where you are <br/>\ncoming from more.  Do you ever present activities for your son outside of, <br/>\nor inside of the household - painting, a trip to a children&#39;s museum, a <br/>\nlibrary trip to find a book or video on a subject that interest him?  How <br/>\ndoes he respond?  Does he enjoy having you read him books?  Literally how <br/>\nmany hours a day does he spend in front of the TV?  I feel like I am coming <br/>\nacross accusingly, but I am really just curious as to why some children may <br/>\nchoose to watch TV literally all day.  My kids do enjoy TV to a point, but <br/>\nthere are so many other things for them to do that there are about 4 days <br/>\nout of the week that it never even gets turned on.  Sometimes I wonder if it <br/>\nis because their parents watch a lot of TV and don&#39;t have a lot of other <br/>\nactivities that they are personally interested in....?  Or maybe kids can <br/>\nget &quot;scared&quot; of doing &quot;learning&quot; activities because they were graded <br/>\npreviously, or critiqued too much...so in turn they find the TV a safe <br/>\noutlet?<br/>\n<br/>\nJust curious.<br/>\n<br/>\nErika  :)<br/>\n<br/>\n_________________________________________________________________<br/>\nScope out the new MSN Plus Internet Software  optimizes dial-up to the max! <br/>\n   <a rel=\"nofollow\" target=\"_blank\" href=\"http://join.msn.com/?pgmarket=en-us&page=byoa/plus&ST=1\">http://join.msn.com/?pgmarket=en-us&page=byoa/plus&ST=1</a></div>","specialLinks":[]},{"userId":152271008,"authorName":"Jon and Rue Kream","from":"&quot;Jon and Rue Kream&quot; &lt;skreams@...&gt;","profile":"jonkream","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] A warm hello from the UK- and some questions!","postDate":"1075599674","msgId":90033,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxMDMwMWMzZTg2NCQ3YWMyMTgyMCRiZDAwYThjMEBvPg==","inReplyToHeader":"PGJ2aGY5OCtiaG1vQGVHcm91cHMuY29tPg=="},"prevInTopic":90031,"nextInTopic":90038,"prevInTime":90032,"nextInTime":90034,"topicId":90029,"numMessagesInTopic":0,"msgSnippet":"... he will just watch tv constantly. I know many (all?) of you wouldn t have a problem with that **So many people say that, but I ve yet to hear of a family","messageBody":"<div id=\"ygrps-yiv-1282667444\"><blockquote><span title=\"ireply\">&gt;&gt; but if I let him do exactly what he wants <br/>\n </span></blockquote>he will just watch tv constantly. I know many (all?) of you wouldn&#39;t <br/>\nhave a problem with that<br/>\n <br/>\n**So many people say that, but I&#39;ve yet to hear of a family where it<br/>\nreally happened.  My children, who have always been able to watch TV any<br/>\ntime they want, do not watch constantly.  Your son, if given the freedom<br/>\nto watch TV any time he wants, may for a while watch constantly.  He may<br/>\nthink you&#39;re going to change your mind.  He may just be so excited to be<br/>\nable to watch that it takes a while to get his fill.  In any case, if<br/>\nthe life around him is fun and interesting and/or exciting, he will<br/>\neventually find the balance between TV and other activities that is best<br/>\nfor him.<br/>\n <br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;he gets headaches <br/>\n </span></blockquote>(he wears glasses) <br/>\n <br/>\n**Maybe he needs a new prescription?  <br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;He also plays constantly, mostly with my eldest daughter. Which is <br/>\n </span></blockquote>fine but I worry that he isn&#39;t learning *anything*.<br/>\n <br/>\n**Play is how children learn.  If he&#39;s playing with his sister he&#39;s<br/>\nlearning and he&#39;s building a relationship with his sister that he&#39;ll<br/>\nhave for the rest of his life.  All good.<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; He is bright, but <br/>\n </span></blockquote>not curious about anything. He never asks questions <br/>\n <br/>\n**Questions are not the only way curiousity is manifested.  Who knows<br/>\nwhat is going on inside his head?  He does.  You can trust that he can<br/>\ndecide how best to spend his time.<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Do <br/>\n </span></blockquote>you think parents and children have to be of a certain personality to <br/>\nsuccessfully unschool? <br/>\n <br/>\n**I think parents have to be of a certain personality: interested,<br/>\nmindful, curious, open to life.  ~Rue<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] A warm hello from the UK- and some questions!","postDate":"1075598466","msgId":90031,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGE0LjQyNDE1OGNmLjJkNGRhZTgyQGFvbC5jb20+"},"prevInTopic":90029,"nextInTopic":90033,"prevInTime":90030,"nextInTime":90032,"topicId":90029,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/31/04 4:56:32 PM, stripeybee@aol.com writes: ","messageBody":"<div id=\"ygrps-yiv-1866179112\">In a message dated 1/31/04 4:56:32 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:stripeybee@...\">stripeybee@...</a> writes:<br/>\n<br/>\n&lt;&lt; My son, who I worry about most, is reluctant to do anything <br/>\n<br/>\nhe regards as school work but if I let him do exactly what he wants <br/>\n<br/>\nhe will just watch tv constantly. &gt;&gt;<br/>\n<br/>\nNot wanting to do school work is smart.<br/>\n<br/>\nIf you let him do exactly what he wants he will NOT just watch TV contantly.  <br/>\nHe might right at first, and the more you have or continue to show <br/>\ndisapproval, the more he will watch.   It&#39;s like a direct reaction to limitations and <br/>\ntsking.  <br/>\n<br/>\nHere is my collection of &quot;if I let him, he will...&quot; statements, and nobody <br/>\nhas ever come back and proven their dire predictions to be true.  On the <br/>\ncontrary, people come back and say &quot;You were right.  I let him do what he wanted and <br/>\nafter a while he turned the TV off.  Some days it&#39;s not even on.&quot;<br/>\n<br/>\nHe can&#39;t turn it off by his own choice if he doesn&#39;t really HAVE an honest <br/>\nchoice.<br/>\nHe won&#39;t want to turn it off if he knows you&#39;ll do the happy told-you-so, <br/>\nit&#39;s-about-time dance if he does.<br/>\n<br/>\nYou&#39;re making yourself a factor where you would be better off NOT being a <br/>\nfactor.<br/>\n<br/>\nAnd on the other hand maybe you should spend some time watching WITH him so <br/>\nyou have more shared experience and things to talk about.  If watching TV is <br/>\nhis thing and complaining about TV is your thing, you spoiled a chance to have a <br/>\nshared thing.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/strew/ifilet\">http://sandradodd.com/strew/ifilet</a><br/>\n<br/>\n-=-and isnt&#39;t active or using his imagination when <br/>\n<br/>\nhe&#39;s stuck in front of the box all the time.-=-<br/>\n<br/>\nVery judgmental choice of terminology.  If he&#39;s there by choice, he&#39;s not <br/>\n&quot;stuck.&quot;  If someone else sticks him there he&#39;s stuck.    &quot;The box&quot;?  It&#39;s not a <br/>\nhole to fall into.  It&#39;s an outpouring of music, pictures, stories, voices, <br/>\npeople.  My kids play and watch, walk and watch, brush the cat and watch, build <br/>\nup the fire in the fireplace and watch.  Maybe you could bring his Lego in <br/>\nthere or get him a little trampoline so he&#39;d have something to do while he <br/>\nwatches.  Or maybe he&#39;s really engrossed and involved.<br/>\n<br/>\nYou have no idea what imagination he&#39;s using while he&#39;s watching.  If you <br/>\nwould hang out with him more and talk about the shows, you might get a glimpse.  <br/>\n(Not if you say &quot;What do you see in that stupid show anyway?&quot;)<br/>\n<br/>\nOnce I wrote a candid outpouring of what I used to think as a kid watching <br/>\nGilligan&#39;s Island re-runs.  It&#39;s here:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/t/gilligan\">http://sandradodd.com/t/gilligan</a><br/>\n<br/>\n&lt;&lt;He also plays constantly, mostly with my eldest daughter. Which is <br/>\n<br/>\nfine but I worry that he isn&#39;t learning *anything*.&gt;&gt;<br/>\n<br/>\nHe must be living a double life if he&#39;s doing two things constantly.<br/>\n<br/>\nYou must have learned, from all your examination and experimentation with <br/>\ndifferent early childhood ed methods, that play is exactly how children learn.<br/>\n<br/>\n-=-He is bright, but <br/>\n<br/>\nnot curious about anything. He never asks questions and is quite <br/>\n<br/>\nchallenging in his behaviour.-=-<br/>\n<br/>\nCuriosity isn&#39;t something you can see.  It&#39;s like imagination.  It doesn&#39;t <br/>\nneed to be expressed verbally to exist.  It doesn&#39;t have to be acted out or <br/>\nacted upon visibly to be happening.<br/>\n<br/>\nMaybe he&#39;s bored and home and you should get him out more places.<br/>\n<br/>\n-=- Do <br/>\n<br/>\nyou think parents and children have to be of a certain personality to <br/>\n<br/>\nsuccessfully unschool?-=-<br/>\n<br/>\nYes.  They need to be curious.  They need to be imaginative.  They need not <br/>\nto be judgmental about other people&#39;s interests, and they need to know that <br/>\nchildren AND adults learn from playing, and learn from just messing around with <br/>\nand tinkering with things that interest them.  (a.k.a. &quot;playing&quot;)<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":174500750,"authorName":"Debbie","from":"&quot;Debbie&quot; &lt;stripeybee@...&gt;","profile":"jimjam003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"A warm hello from the UK- and some questions!","postDate":"1075593320","msgId":90029,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJ2aGY5OCtiaG1vQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":90031,"prevInTime":90028,"nextInTime":90030,"topicId":90029,"numMessagesInTopic":0,"msgSnippet":"Hello, I have been lurking on and off for months and felt it was time I posted an intro. I live in the UK and have three children, ds (7.5), dd (5.5) and dd ","messageBody":"<div id=\"ygrps-yiv-1901966288\">Hello, I have been lurking on and off for months and felt it was time <br/>\nI posted an intro.<br/>\n<br/>\nI live in the UK and have three children, ds (7.5), dd (5.5) and dd <br/>\n(3.5) and have been home educating them for nearly two years. The <br/>\neldest two have tried school and are adamant they are never going <br/>\nagain!<br/>\n<br/>\nThe problem is that I still don&#39;t feel confident or at peace with <br/>\nwhat I&#39;m doing, worry constantly and keep changing my approach. This <br/>\nhas got to change!<br/>\n<br/>\nI&#39;ve toyed with Charlotte Mason, Waldorf, unschooling and a more <br/>\nstructured approach with reading, writing and maths practice every <br/>\nmorning. My son, who I worry about most, is reluctant to do anything <br/>\nhe regards as school work but if I let him do exactly what he wants <br/>\nhe will just watch tv constantly. I know many (all?) of you wouldn&#39;t <br/>\nhave a problem with that but his behaviour worsens, he gets headaches <br/>\n(he wears glasses) and isnt&#39;t active or using his imagination when <br/>\nhe&#39;s stuck in front of the box all the time.<br/>\n<br/>\nHe also plays constantly, mostly with my eldest daughter. Which is <br/>\nfine but I worry that he isn&#39;t learning *anything*. He is very behind <br/>\nhis peers, which I know shouldn&#39;t bother me, but remember 99% of <br/>\nchildren in the UK start formal schooling at four. He is bright, but <br/>\nnot curious about anything. He never asks questions and is quite <br/>\nchallenging in his behaviour.<br/>\n<br/>\nSorry for the long post but I need guidance and feel all at sea. Do <br/>\nyou think parents and children have to be of a certain personality to <br/>\nsuccessfully unschool? I feel I&#39;ve made so many mistakes, <br/>\nparticularly where my son is concerned, and don&#39;t want to make any <br/>\nmore.<br/>\n<br/>\nApologies again for the ramble,<br/>\nbest wishes,<br/>\nDeborah.</div>","specialLinks":[]}],"prevTopicId":90266,"nextTopicId":90084}}