{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Math Thingy for PamS","postDate":"1019079130","msgId":35178,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI4RTM2MjFBLjc1RTglZmV0dGVyb2xsQGVhcnRobGluay5uZXQ+","inReplyToHeader":"PEYxMzBrUjFUSDhHc0ZUV1Bkam4wMDAwNDI4ZkBob3RtYWlsLmNvbT4="},"prevInTopic":35099,"nextInTopic":0,"prevInTime":35177,"nextInTime":35179,"topicId":35099,"numMessagesInTopic":0,"msgSnippet":"My math experience is probably the opposite of most people s. I enjoyed math so much that I had the vague impression I d always been good at it. Then I ","messageBody":"<div id=\"ygrps-yiv-1052691545\">My math experience is probably the opposite of most people&#39;s. I enjoyed math<br/>\nso much that I had the vague impression I&#39;d always been good at it. Then I<br/>\nstumbled on my grade school report cards and it reminded me I hadn&#39;t liked<br/>\ngrade school math and was a pretty solid C student.<br/>\n<br/>\nThe numbers and the tediousness of early math got to me. The one thing that<br/>\ngot drilled into me was being precise was the most important part of math.<br/>\nIf there were patterns to arithmetic, they got lost in making sure all the<br/>\nnumbers were doing exactly what they were supposed to.<br/>\n<br/>\n(That was a tough lesson to unlearn, especially since it got reinforced in<br/>\ncollege engineering classes. I didn&#39;t unlearn it until I was an adult and<br/>\nforced to do math in my head and realized I didn&#39;t need precision to the 6th<br/>\ndecimal place. Being close was good enough. In fact estimation is way more<br/>\nuseful than precision. But estimation -- though we were *told* it was an<br/>\nimportant skill -- was merely a chapter in the math book and then we went<br/>\nback to getting answers right to the umpteenth decimal point. In fact<br/>\nestimation made no sense at all in the context of math class. Why would<br/>\nanyone want to do the problem twice? Once to get a rough answer and then<br/>\nagain to get the right answer? Just double the tediousness.)<br/>\n<br/>\nThen I hit algebra and the emphasis shifted to pattern recognition and I<br/>\nsoared :-) All the way through from Algebra to Trig it was nothing but<br/>\nrecognize the problem type, apply the appropriate formula and voile!<br/>\nElegance :-) I absolutely adored Geometry proofs. (Which apparently they<br/>\ndon&#39;t even do any more.) The proofs were like games to me. In fact I see a<br/>\nlot of parallels between geometry proofs and answering homeschooling<br/>\nquestions. The procedure is to take someone&#39;s thinking step by logical step<br/>\nfrom where it is to where it needs to be to understand how children learn<br/>\nnaturally. Q.E.D. :-)<br/>\n<br/>\nI adored college math, especially calculus and differential equations. More<br/>\npattern recognition and apply the formula.<br/>\n<br/>\nBut when it came time to use the math for practical purposes in engineering<br/>\ncourses I was befuddled. I didn&#39;t really understand why I was doing what I<br/>\nwas doing. The problems weren&#39;t elegant in engineering. They were messy with<br/>\nbits and pieces of different problem types mixed together. I ended up<br/>\ngraduating near the bottom of my class (the worst of the best :-) and the<br/>\nonly thing that got me as high as I was was math, art, psychology and<br/>\nprogramming. Rather crude programming with computer cards, but programming<br/>\nnonetheless and it saved me from a career in befuddlement because<br/>\nprogramming is just geometry proofs :-)<br/>\n<br/>\nIt wasn&#39;t until I started helping my daughter figure out real life problems<br/>\nthat I &quot;got&quot; arithmetic. I could finally see the patterns. Since we were<br/>\ndoing all the math in our heads, we couldn&#39;t keep track of all the<br/>\nintermediate answers so I had to tear the numbers apart and rebuild them out<br/>\nloud for her into numbers that would add or subtract easily. And from<br/>\nlistening to me do that she &quot;got&quot; how numbers worked. She can see the<br/>\npatterns that it took me until adulthood to see.<br/>\n<br/>\nMy husband teaches algebra and modern math courses and occasionally brings<br/>\nproblems home that are puzzling him. He&#39;ll walk through them using the<br/>\nconcepts he&#39;s trying to teach and words that I&#39;ve lost the meaning for. He<br/>\nuses the same techniques I used all through school of trying to figure out<br/>\nhow the formula fits the pattern of the problem. But I can see the problems<br/>\ndifferently now. I can see essential patterns in the problem itself without<br/>\nbeing clouded by the formulas.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":5311776,"authorName":"Lily James","from":"&quot;Lily James&quot; &lt;glamatron@...&gt;","profile":"lostcheerio","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Math Thingy for PamS","postDate":"1018996662","msgId":35099,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYxMzBrUjFUSDhHc0ZUV1Bkam4wMDAwNDI4ZkBob3RtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":35178,"prevInTime":35098,"nextInTime":35100,"topicId":35099,"numMessagesInTopic":0,"msgSnippet":"Here s my embarrassing math thingy. For grade 1-4 I went to a work-at-your-own-pace school with cubicles for the kids. We had workbooks in the subjects and we","messageBody":"<div id=\"ygrps-yiv-690639021\">Here&#39;s my embarrassing math thingy. For grade 1-4 I went to a <br/>\nwork-at-your-own-pace school with cubicles for the kids. We had workbooks in <br/>\nthe subjects and we set &quot;goals&quot; for ourselves each week (under the eye of <br/>\nthe teacher) and then worked to meet those goals... etc. For some reason, I <br/>\ncompletely missed the fact that there were &quot;correct answers&quot; to the math <br/>\nproblems, or if I did know this, I didn&#39;t know I was supposed to be giving <br/>\nthem. I mean, it was pretty dire. I was a very VERY very introverted child, <br/>\nnothing to say, own little world, all that.<br/>\n<br/>\nANYWAY, :) I could not do math correctly in school. That is, I could not <br/>\nproduce the correct answer, because I was fiddling with the answer according <br/>\nto my own weird agenda. For example, if the answer was 456 I would take one <br/>\naway from the six and give to the four, making it 555. If it came out to be <br/>\n556, I&#39;d give the extra to the third digit first, then the next time that <br/>\nhappened the second (565), then the next time the first (655), then start <br/>\nover. I had other weird little games like this and I did it in my head so <br/>\nthere was no evidence on the paper. So, ALL of my answers were wrong every <br/>\ntime, without fail. I went to tutors who played dice games with me, etc., <br/>\nand reported to my parents that I was fine. But because of this I failed the <br/>\nthird grade.<br/>\n<br/>\nThere was just a massive disconnect somewhere between me, my parents, and <br/>\nthe teacher. Had I opened my mouth and explained what I was doing, that I <br/>\nwas some sort of little three-digit socialist, it would have been fixed I <br/>\nsuppose. After fourth grade (which was actually third grade again), they <br/>\ntook me out of the school and put me in a parochial school with regular <br/>\nclassrooms and I perked right up. I think the main problem with me and math <br/>\nwas that the &quot;goals&quot; set for me were way too unchallenging and I was bored <br/>\nout of my mind, just searching for a way to make things more interesting. <br/>\nIt&#39;s hard to remember because I was so nonverbal at the time -- what was I <br/>\nthinking?<br/>\n<br/>\nI continued to have some difficulty with math because I could do the answer <br/>\nin my head but not on the paper. I remember wondering how in the hell to <br/>\nmake those numbers string down from the problem, doing long division, it <br/>\njust seemed like a lot of extra mess when I knew the answer. This became a <br/>\nproblem again in high school algebra/trig/whatever with the old &quot;SHOW YOUR <br/>\nWORK&quot; imperative that I could not answer. :) In college I did fine with <br/>\ncalculus etc.<br/>\n<br/>\nI think my experiences in grade school are the main motivating factor in my <br/>\ntrying to homeschool my kid. I remember so vividly the overwhelming boredom <br/>\nof pages and pages of math problems in their neat, military little lines, <br/>\nstretching out ahead into the weeks and months of the school year. Blech.<br/>\n<br/>\nAnd on that cheery note!<br/>\n<br/>\nLove,<br/>\nLILY<br/>\n<br/>\n_________________________________________________________________<br/>\nChat with friends online, try MSN Messenger: <a rel=\"nofollow\" target=\"_blank\" href=\"http://messenger.msn.com\">http://messenger.msn.com</a></div>","specialLinks":[]}],"prevTopicId":35176,"nextTopicId":35108}}