{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":42,"messages":[{"userId":1572768,"authorName":"Stephanie Elms","from":"&quot;Stephanie Elms&quot; &lt;stephanie.elms@...&gt;","profile":"elmsfam","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [Unschooling-dotcom] Re: Need some help with relationships (long)","postDate":"1042858022","msgId":55492,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlENkNGOUNFQTc2ODNDNEQ4RjQxNUEzRjU0RDFDMDY2MDEzREM4ODFAZHN0cDEuZGVsdGFzb2x1dGlvbnMuY29tPg=="},"prevInTopic":55481,"nextInTopic":55493,"prevInTime":55491,"nextInTime":55493,"topicId":55321,"numMessagesInTopic":0,"msgSnippet":"... I second this! We had a wonderful community theater group that I got involved with when I was in 6th grade. I got the part of Bashful in the Snow White.","messageBody":"<div id=\"ygrps-yiv-679038277\"><blockquote><span title=\"ireply\">&gt;  Also, if you have a community drama <br/>\n&gt; group where she could act with adults, that might give her <br/>\n&gt; some positive feedback and a great opportunity.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>I second this! We had a wonderful community theater group that I got involved with<br/>\nwhen I was in 6th grade. I got the part of Bashful in the Snow White. Best time of <br/>\nmy life and fostered a wonderful love of the theater. It really is great to be able<br/>\nto act next to the adults. When we moved to Maryland, I was involved with a great<br/>\nChildren&#39;s theater as well as community theater. Funny thing, I never played more<br/>\nthen bit parts in high school...there seemed to be more favoritism there. But<br/>\nI got great parts in community theater...my favorite was playing Dinah in The <br/>\nPhiladelphia Story (I was 17 playing 15). I was the only &quot;kid&quot; in the cast and<br/>\nlearned so much. IN college I switched to doing behind the scenes stuff (mainly<br/>\nbecause I could not get home to audition for summer plays early enough). Kept<br/>\ndoing it up until Jason was born (freaked people out when they saw a pregnant<br/>\nwoman climbing up the ladder into the light booth LOL!)<br/>\n<br/>\nWell, I guess that I rambled a bit...can you tell I loved community theater.<br/>\n<br/>\nStephanie E.</div>","specialLinks":[]},{"userId":6958287,"authorName":"Jim Selvage","from":"&quot;Jim Selvage&quot; &lt;jselvage@...&gt;","profile":"jselvage_jemj","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: Need some help with relationships (long)","postDate":"1042851497","msgId":55481,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMzMwMWMyYmU4YyRiMzM4ODVjMCQwMTAwYThjMEBocHBhdmlsaW9uPg==","referencesHeader":"PEYxMDgzSmNYdTk4c01EOXhUM2wwMDAwYTNiNkBob3RtYWlsLmNvbT4gPDAwMmQwMWMyYmRlZCRhYjI3NjYyMCQwMTAwYThjMEBocHBhdmlsaW9uPiA8M0UyODNDRUUuNjAxMDIwOEB2b2wuY29tPiA8MDA1ODAxYzJiZTUwJDQ5MzUwZGIwJDAxMDBhOGMwQGhwcGF2aWxpb24+IDwzRTI4NDBEQy4yMDYwNDA3QHZvbC5jb20+"},"prevInTopic":55472,"nextInTopic":55492,"prevInTime":55480,"nextInTime":55482,"topicId":55321,"numMessagesInTopic":0,"msgSnippet":"Diane, Don t worry it came across fine!  I am used to being told what to do all the time anyway though (the forementioned daughter, lol).  She really doesn t","messageBody":"<div id=\"ygrps-yiv-1326912475\">Diane,<br/>\n<br/>\nDon&#39;t worry it came across fine!  I am used to being told what to do all the<br/>\ntime anyway though (the forementioned daughter, lol).  She really doesn&#39;t do<br/>\nit all the time, but plenty!<br/>\n<br/>\nblessings,<br/>\nerin<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; Oh, good. I was afraid it would come across wrong--I&#39;ve worked really<br/>\n&gt; hard not to tell everyone what to do all the time, so I&#39;m glad this one<br/>\n&gt; came across OK.<br/>\n&gt;<br/>\n&gt; :-) Diane </span></blockquote></div>","specialLinks":[]},{"userId":74604204,"authorName":"Deborah Lewis","from":"Deborah Lewis &lt;ddzimlew@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Homeopathy (was Need some help)","postDate":"1042846860","msgId":55472,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMwMTE3LjE2NDEwMC4xNjA0LjMuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":55463,"nextInTopic":55481,"prevInTime":55471,"nextInTime":55473,"topicId":55321,"numMessagesInTopic":0,"msgSnippet":"On Fri, 17 Jan 2003 11:50:58 -0500 Fetteroll  writes: ***I think one of the things school and society robs us of as parents is a ","messageBody":"<div id=\"ygrps-yiv-1223545938\">On Fri, 17 Jan 2003 11:50:58 -0500 Fetteroll &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a>&gt;<br/>\nwrites:<br/>\n<br/>\n***I think one of the things school and society robs us of as parents is<br/>\na<br/>\nfeeling of competency: that we aren&#39;t competent to determine the needs of<br/>\nour own children. We can&#39;t tell a healthy child from an unhealthy one.<br/>\nThe<br/>\nclues are so subtle that only professionals would be able to recognize<br/>\nthem.***<br/>\n<br/>\nI have also been concerned with the suggestion that behaviors in a child<br/>\nthat we may not understand or may not be comfortable with are somehow<br/>\ndisorders or syndromes or illnesses.   <br/>\nFor a long time now schools have been medicating kids who wiggle or talk<br/>\nor get bored.   If a child seems different in the least from the rest of<br/>\nthe group they&#39;re not individuals they&#39;re suffering from a disorder that<br/>\nmust be treated. <br/>\n<br/>\nIf kids don&#39;t like seams in their clothing, buy a bigger size or another<br/>\nkind.  No one is treating the millions of adults who can&#39;t wear wool.   I<br/>\npersonally can&#39;t stand polyester, but I&#39;m not seeking treatment for my<br/>\naversion. <br/>\n<br/>\nI think an attitude that our children are just as they should be would be<br/>\ninfinitely more in keeping with an unschooling philosophy than an<br/>\nattitude that some little difference is a sign of an imbalance.<br/>\n<br/>\nDeb L</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: Homeopathy (was Need some help)","postDate":"1042843316","msgId":55463,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdkLjMzZGIzZTBhLjJiNTllMGI0QGFvbC5jb20+"},"prevInTopic":55460,"nextInTopic":55472,"prevInTime":55462,"nextInTime":55464,"topicId":55321,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/17/03 3:22:42 PM, bluelotus@att.net writes: ","messageBody":"<div id=\"ygrps-yiv-1936660762\">In a message dated 1/17/03 3:22:42 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:bluelotus@...\">bluelotus@...</a> writes:<br/>\n<br/>\n&lt;&lt;  I think this applies also to someone who&#39;s a violin teacher or a <br/>\nprofessional violinist speaking about violin stuff. I doubt anyone takes it <br/>\nas *professional advice*. &gt;&gt;<br/>\n<br/>\nNo one suggested that if a boy touches himself he&#39;ll stop if he plays violin, <br/>\nnor if a girl weren&#39;t getting the part she wanted in a play that professional <br/>\nviolin lessons should be sought immediately.<br/>\n<br/>\n&lt;&lt;I tend to think that people here (and on the HEM list) are intelligent <br/>\nenough to take what suits them and leave the rest out.&gt;&gt;<br/>\n<br/>\nWhat Joyce thinks about the list is important.<br/>\nHer point is that someone who is insecure doesn&#39;t need to hear &quot;homeopathy&quot; <br/>\nevery time a learning or parenting situation is mentioned.<br/>\n<br/>\n<br/>\n&lt;&lt;One of the reasons why I became a homeopath is because I&#39;ve seen homeopathy <br/>\nhelp me throughout my life in magical and unexpected ways. So, my posts are <br/>\nmostly motivated by my own experience and not necessarily by a *professional* <br/>\napproach.&gt;&gt;<br/>\n<br/>\nI&#39;ve loved books all my life, but if I were selling DK or Usborne books and <br/>\nbrought it up every time anyone said anything, I&#39;d be professionally selling <br/>\nbooks.  <br/>\n<br/>\nWe do have people here with home businesses of all sorts who aren&#39;t flooding <br/>\nthe list with recommendations for their products.<br/>\n<br/>\n&lt;&lt; But as with unschooling, you&#39;d need to switch your perception and realize <br/>\nthat what seems &quot;ordinary&quot; may not be. &gt;&gt;<br/>\n<br/>\nBut as a mother with NO boys, you suggested strongly that little boys playing <br/>\nwith their penises was something about which to seek professional help.  It <br/>\nisn&#39;t.  <br/>\n<br/>\nVery many things ARE very ordinary.  Kids not getting parts in plays happens <br/>\nWAY more often than kids getting parts in plays.  There is no homeopathy to <br/>\nmake kids good actors, nor make them charismatic.<br/>\n<br/>\n&lt;&lt;I am a parent as well, and I&#39;ve seen many people bend over backwards trying <br/>\nto adjust their lives around issues they feel helpless about, and I can&#39;t <br/>\nhelp but feel for them and think, if they only knew! &gt;&gt;<br/>\n<br/>\nAgain you&#39;re suggesting that if there is an issue a parent feels helpless <br/>\nabout, IF THEY ONLY KNEW there was a homeopathic &quot;cure,&quot; they would be all <br/>\nbetter.<br/>\n<br/>\n&lt;&lt;I think it is also important to make parents feel that they&#39;re not alone <br/>\nand that there is help out there if they think what they&#39;re dealing with is <br/>\nnot an &quot;ordinary&quot; problem. &gt;&gt;<br/>\n<br/>\nIf they think their problem is extraordinary, but other unschooling moms with <br/>\nmore experience can tell stories of similar situations which worked out <br/>\npeacefully and sweetly, then this list will be serving a glorious purpose (as <br/>\nit has for a long time).<br/>\n<br/>\n&lt;&lt;If I said to someone, you know meditation helps with stress and low <br/>\nself-esteem, would you say that I am offering *expert advice* because I&#39;ve <br/>\nbeen meditating for years and have a meditation center? Does that make me an <br/>\n*expert*? &gt;&gt;<br/>\n<br/>\nTwo or three people have mentioned in the past that your bristly posts here <br/>\nare NOT good advertisements for meditation or yoga.<br/>\n<br/>\n&lt;&lt;And I shouldn&#39;t have said anything, I know. It just breaks my heart <br/>\nsometimes to hear what some people post here and just wish they knew how <br/>\nthings could be much easier with a little help.&gt;&gt;<br/>\n<br/>\nYou could e-mail them on the side, and then nobody here could say anything <br/>\nabout it.  Advise away, on the side.  But if you do it on the public list, <br/>\nwith its archives, others might feel obligated to counter the claim if you&#39;ve <br/>\nsuggested homeopathy as a remedy for something which is absolutely normal <br/>\nchild behavior.<br/>\n<br/>\nJoyce says you said you wouldn&#39;t mention it further but you did.  <br/>\nDo you intend to keep your word on this list?<br/>\n<br/>\nJoyce has had to TWICE defend what she actually said against your claims of <br/>\nwhat she said.<br/>\nIsn&#39;t there maybe a homeopathic remedy for being dishonest and defensive?<br/>\n<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":129256077,"authorName":"bluelotus","from":"bluelotus &lt;bluelotus@...&gt;","profile":"yolswandass","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Homeopathy (was Need some help)","postDate":"1042842022","msgId":55460,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNFMjg4MUE2LjgwNDAyMDlAYXR0Lm5ldD4="},"prevInTopic":55459,"nextInTopic":55463,"prevInTime":55459,"nextInTime":55461,"topicId":55321,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-2043185217\">&lt;&lt; OK--I&#39;ll admit I&#39;m a little tired of the &quot;He sucks his thumb--call a <br/>\nhomeopath!&quot; &quot;He argues? Call a homeopath!&quot; &quot;She&#39;s mouthy? Call a <br/>\nhomeopath!&quot; &quot;Too much TV? Call a homeopath!&quot; &quot;Don&#39;t like the weather? <br/>\nCall a homeopath!&quot; And on and on and on and on and on and on and on and <br/>\non and on and on and on and on and on and on and on and on and on and on <br/>\nand on and on and on and on...<br/>\n<br/>\n:-) Diane          &lt;--usually not a complainer &gt;&gt;<br/>\n<br/>\nYour generous sarcasm and insulting post is really unnecessary... <br/>\n<br/>\nYol<br/>\n<br/>\n-- <br/>\n<br/>\nBlue Lotus Therapeutics -<br/>\nAyurveda, Homeopathy, Yoga & Therapeutic Massage<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.bluelotustherapeutics.com\">http://www.bluelotustherapeutics.com</a><br/>\n<br/>\nDhyanyoga Center of NC -<br/>\nMeditation - Kundalini Maha Yoga<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.dyc-nc.org\">http://www.dyc-nc.org</a><br/>\n<br/>\n**********************************<br/>\nWhen nothing is done, nothing is left undone. The world is ruled by <br/>\nletting things take their course. It cannot be ruled by interfering.<br/>\n-- Tao Te Ching<br/>\n**********************************</div>","specialLinks":[]},{"userId":129256077,"authorName":"bluelotus","from":"bluelotus &lt;bluelotus@...&gt;","profile":"yolswandass","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Homeopathy (was Need some help)","postDate":"1042841990","msgId":55459,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNFMjg4MTg2LjIwNTA2MDVAYXR0Lm5ldD4="},"prevInTopic":55443,"nextInTopic":55460,"prevInTime":55458,"nextInTime":55460,"topicId":55321,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1877621167\">&lt;&lt; Yol is a practicing homeopath so that makes her advice *more* than<br/>\nparent-to-parent. It&#39;s professional advice. I asked that she be aware of the<br/>\ndifference. She says there is no difference. &gt;&gt;<br/>\n<br/>\nBecause in my perception of things, I am not giving professional advice. I think *expertise* is a tone and an attitude. I think this applies also to someone who&#39;s a violin teacher or a professional violinist speaking about violin stuff. I doubt anyone takes it as *professional advice*. I tend to think that people here (and on the HEM list) are intelligent enough to take what suits them and leave the rest out.<br/>\n<br/>\nOne of the reasons why I became a homeopath is because I&#39;ve seen homeopathy help me throughout my life in magical and unexpected ways. So, my posts are mostly motivated by my own experience and not necessarily by a *professional* approach. I feel very fortunate to be able to offer my daughter an alternative approach in life that will make her life even easier and healthier and happier. This is why we do homeopathy, and this is why we unschool. And this is the main motivation behind wanting to share it with other people.<br/>\n<br/>\n&lt;&lt; I think one of the things school and society robs us of as parents is a<br/>\nfeeling of competency: that we aren&#39;t competent to determine the needs of<br/>\nour own children. We can&#39;t tell a healthy child from an unhealthy one. The<br/>\nclues are so subtle that only professionals would be able to recognize them. &gt;&gt;<br/>\n<br/>\nIt has not been my intention at all to *rob* anyone. I think that to offer information and an alternative to the mainstream medical/psychological approach is actually empowering. But as with unschooling, you&#39;d need to switch your perception and realize that what seems &quot;ordinary&quot; may not be. It&#39;s like assuming that school behavior is &quot;ordinary&quot; when you can tell it&#39;s not if you get out of the mainstream box.<br/>\n<br/>\nI am a parent as well, and I&#39;ve seen many people bend over backwards trying to adjust their lives around issues they feel helpless about, and I can&#39;t help but feel for them and think, if they only knew! There are issues that have no simple solution, no matter how you approach them. I am grateful as a woman and as a mother for homeopathy at those times.<br/>\n<br/>\n&lt;&lt; I think it&#39;s important to support parents&#39; feelings of competence. When a<br/>\nprofessional repeatedly suggests that ordinary problems should be seen by a<br/>\nprofessional, I feel it undermines that feeling of competency. &gt;&gt;<br/>\n<br/>\nI think it is also important to make parents feel that they&#39;re not alone and that there is help out there if they think what they&#39;re dealing with is not an &quot;ordinary&quot; problem. Someone who sees homeopathy as just another *medical profession* is missing on the nature of homeopathy. If I said to someone, you know meditation helps with stress and low self-esteem, would you say that I am offering *expert advice* because I&#39;ve been meditating for years and have a meditation center? Does that make me an *expert*? <br/>\n<br/>\nHomeopathy is a way of life too, where doctors, psychologists, nutritionists, and even dentists and many other *experts* can become a thing of the past, for the most part. Now, I think that can very empowering.<br/>\n<br/>\n&lt;&lt; It was beginning to feel, to me, like people were being directed to a<br/>\nhomeopath for too many ordinary run-of-the-mill problems that parents<br/>\nnormally handle themselves. I felt it was heading towards being harmful to<br/>\nsome people trying to regain (or build in the first place!) their sense of<br/>\nconfidence in themselves as parents. &gt;&gt;<br/>\n<br/>\nToo many problems? I posted ONCE about it on the HEM list. The truth is that nobody, except Sandra, complained about my post, which was intended as a joke in the first place! And it was not until after Sandra and I got into a discussion about a later issue that Joyce e-mailed me privately to say that my posts on homeopathy (from days before) were irresponsible.<br/>\n<br/>\n&lt;&lt; I did not ask her to stop giving out homeopathic advice. I asked her to be<br/>\nmore aware. She felt no one thought of her as a professional so her words<br/>\ndidn&#39;t mean any more than anyone elses&#39;. While that may be how some people<br/>\nview her, I felt it was irresponsible not to see the power her words *could*<br/>\nhave on some people. &gt;&gt;<br/>\n<br/>\nI still have to see my power here... At the most, I&#39;ve seen people ignore, question and make fun of my posts, or asking for help finding a homeopath, or maybe inquiring about a remedy, but I haven&#39;t seen anybody intimidated by what I&#39;ve posted. What I have seen, though, is someone else totally disempowering and pushing away a newcomer (on the HEM list) with harsh words, without Joyce making a peep about it. I thought it was unfair to give so much *power* to my words and not other people&#39;s tone or words, which indeed made the newcomer feel completely helpless, misunderstood and not given the chance to express herself. (Helen H. was the only one who said something about it.)<br/>\n<br/>\n&lt;&lt; And, apparently it&#39;s now her choice to change her mind when she feels it&#39;s<br/>\ntoo important not to offer her advice. And since, to me, this *again* seems<br/>\nlike another perfectly ordinary problem, the extraordinary need to pass on<br/>\nhomeopathic advice despite her declaration not to, reinforces my feelings<br/>\nthat judgement and power isn&#39;t being used wisely. &gt;&gt;<br/>\n<br/>\nAnd I shouldn&#39;t have said anything, I know. It just breaks my heart sometimes to hear what some people post here and just wish they knew how things could be much easier with a little help. Would it have made any difference if I had said, when I was a teenager homeopathy helped me with similar problems...? Or does the fact that I am a homeopath now marks my every post? No need to answer, really. I&#39;m just thinking out loud. This is your list, and I shouldn&#39;t post anything you don&#39;t want me to.<br/>\n<br/>\nYol<br/>\n<br/>\n-- <br/>\n<br/>\nBlue Lotus Therapeutics -<br/>\nAyurveda, Homeopathy, Yoga & Therapeutic Massage<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.bluelotustherapeutics.com\">http://www.bluelotustherapeutics.com</a><br/>\n<br/>\nDhyanyoga Center of NC -<br/>\nMeditation - Kundalini Maha Yoga<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.dyc-nc.org\">http://www.dyc-nc.org</a><br/>\n<br/>\n**********************************<br/>\nWhen nothing is done, nothing is left undone. The world is ruled by <br/>\nletting things take their course. It cannot be ruled by interfering.<br/>\n-- Tao Te Ching<br/>\n**********************************</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Homeopathy (was Need some help)","postDate":"1042832745","msgId":55443,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBNERDNTcyLjEyNjg5JWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDNFMjgzRkFCLjMwNjA5MDRAdm9sLmNvbT4="},"prevInTopic":55435,"nextInTopic":55459,"prevInTime":55442,"nextInTime":55444,"topicId":55321,"numMessagesInTopic":0,"msgSnippet":"... Somewhere there s a good balance, I think. Joyce","messageBody":"<div id=\"ygrps-yiv-972786795\">on 1/17/03 12:38 PM, Bill and Diane at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:cen46624@...\">cen46624@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; OK--I&#39;ll admit I&#39;m a little tired of the &quot;He sucks his thumb--call a<br/>\n&gt; homeopath!&quot; &quot;He argues? Call a homeopath!&quot;<br/>\n<br/>\n </span></blockquote>on 1/17/03 1:20 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:grlynbl@...\">grlynbl@...</a> at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:grlynbl@...\">grlynbl@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; its REALLY <br/>\n&gt; COLD here today and if a homeopath could change the weather, Ide be calling<br/>\n&gt; Yol right now..<br/>\n<br/>\n </span></blockquote>Somewhere there&#39;s a good balance, I think.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":56051484,"authorName":"grlynbl@aol.com","from":"grlynbl@...","profile":"jaeschool","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Homeopathy (was Need some help)","postDate":"1042827624","msgId":55435,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMzLjMyODQ3MzdhLjJiNTlhMzY4QGFvbC5jb20+"},"prevInTopic":55431,"nextInTopic":55443,"prevInTime":55434,"nextInTime":55436,"topicId":55321,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/17/03 12:47:36 PM Eastern Standard Time, ... I havent heard this advice. but if it worked, hey, Ide try it.. Its cold as ... well, I would","messageBody":"<div id=\"ygrps-yiv-557846781\">In a message dated 1/17/03 12:47:36 PM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:cen46624@...\">cen46624@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &quot;Too much TV? Call a homeopath!&quot; &quot;Don&#39;t like the weather? <br/>\n&gt; Call a homeopath!&quot;<br/>\n<br/>\n </span></blockquote>I havent heard this advice. but if it worked, hey, Ide try it.. Its cold as <br/>\n... well, I would say Hell, but Hell aint cold.. LOL.. anyway, its REALLY <br/>\nCOLD here today and if a homeopath could change the weather, Ide be calling <br/>\nYol right now..<br/>\n<br/>\nTeresa<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":6958287,"authorName":"Jim Selvage","from":"&quot;Jim Selvage&quot; &lt;jselvage@...&gt;","profile":"jselvage_jemj","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: Need some help with relationships (long)","postDate":"1042826473","msgId":55431,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNjgwMWMyYmU1MiQ3MDBjODZhMCQwMTAwYThjMEBocHBhdmlsaW9uPg==","referencesHeader":"PDU1LjM2NmY2YmM5LjJiNTg4MzAxQGFvbC5jb20+IDwwMDA5MDFjMmJkYWIkZGMxMWRhNTAkMDEwMGE4YzBAaHBwYXZpbGlvbj4gPDAwNDgwMWMyYmUzNiQxZmIyODVlMCQ1MDg5NDg0NEBtc2hvbWUubmV0Pg=="},"prevInTopic":55430,"nextInTopic":55435,"prevInTime":55430,"nextInTime":55432,"topicId":55321,"numMessagesInTopic":0,"msgSnippet":"Suzanne, Thanks for your comforting words and suggestions.  I hope she does come to a time where she is accepted for who she is. I don t think the independant","messageBody":"<div id=\"ygrps-yiv-545085879\">Suzanne,<br/>\n<br/>\nThanks for your comforting words and suggestions.  I hope she does come to a<br/>\ntime where she is accepted for who she is.<br/>\n<br/>\nI don&#39;t think the independant drama thing will work, as we are too far out<br/>\nin the middle of nowhere.  But the adult drama group might.  I know they<br/>\nhave one in a city about 30 minutes from us, and know some homeschool kids<br/>\nwho participated last year and were very well received.  I will have to<br/>\ncheck it out.<br/>\n<br/>\nthanks,<br/>\nerin<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Erin,<br/>\n&gt;<br/>\n&gt; I too struggle with a lot of the types of things you mentioned.   I tend<br/>\n </span></blockquote>to agree with someone on the list who said that things would probably<br/>\nimprove with time.   I watched my oldest, a boy, struggle with feeling he<br/>\nwas not accepted in his homeschool group as a teen.  He continued to<br/>\nparticipate anyway and one of the teens told him he was the kindest person<br/>\nin the whole group.   Sometimes it just takes one good friend.   When things<br/>\nare going well for our kids we hurt just as much as they do.  Girls seem to<br/>\nmature socially before boys, so it might not be long till your daughter is<br/>\nfinding herself feeling better about her social interactions.  For my<br/>\noldest, he really came into his own right after he turned 17 and began<br/>\ncollege.  The like mindedness of his fellow music majors gave him a social<br/>\nbelongingness.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; In the meantime I wonder if it would be possible for you and your daughter<br/>\n </span></blockquote>to start your own independant drama group.  It could be for just one play or<br/>\nmore.  It could include both schoolers and non-schoolers.  Many years ago I<br/>\ngot 6 children together, including my oldest, and they put on the play &quot;A<br/>\nMad Tea Party.&quot;  I found the script and practiced with the kids twice a week<br/>\nfor about a month. I had zero drama experience.  After each practice they<br/>\nswam in our pool and had snacks.  (I&#39;m sure the pool was a big draw, but<br/>\nthose kids put on a darned good performance).  We taped it and the local<br/>\nnewspaper took their picture.  If you could find a play that had several big<br/>\nparts then your daughter could shine with the rest of them.  Also, if you<br/>\nhave a community drama group where she could act with adults, that might<br/>\ngive her some positive feedback and a great opportunity.<br/>\n<blockquote><span title=\"qreply\"> &gt;<br/>\n&gt; Best of everything to you,<br/>\n&gt; Suzanne </span></blockquote></div>","specialLinks":[]},{"userId":6958287,"authorName":"Jim Selvage","from":"&quot;Jim Selvage&quot; &lt;jselvage@...&gt;","profile":"jselvage_jemj","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Need some help with relationships (long)","postDate":"1042826325","msgId":55430,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNjIwMWMyYmU1MiQxNzlhZWNhMCQwMTAwYThjMEBocHBhdmlsaW9uPg==","referencesHeader":"PGE1LjMzZGQ3ZjM5LjJiNTk4ZTg1QGFvbC5jb20+"},"prevInTopic":55428,"nextInTopic":55431,"prevInTime":55429,"nextInTime":55431,"topicId":55321,"numMessagesInTopic":0,"msgSnippet":"Ginny, I think you are right about the preconceived ideas, and this may definitely be part of the problem.  I think my daughter is extremely mature at times, ","messageBody":"<div id=\"ygrps-yiv-658196817\">Ginny,<br/>\n<br/>\nI think you are right about the preconceived ideas, and this may definitely<br/>\nbe part of the problem.  I think my daughter is extremely mature at times,<br/>\nand immature at other times.  I am fine with that, but most people aren&#39;t.<br/>\nI mostly don&#39;t want her to be scarred from the emotional trauma of the way<br/>\npeople treat her, but I guess that would be every parent&#39;s hope.<br/>\n<br/>\n I am doing a lot of the reminding her that she is a terrific talented<br/>\nperson, and that she has one very special friend who likes her for who she<br/>\nis.  As a family, we try to encourage her to be herself, even when it is<br/>\nunpopular, and say that we have done that as a family unit.<br/>\n<br/>\nProbably the only reason she has been so emotional over this issue is<br/>\nbecause she is just realizing what is happening.  This year is the first<br/>\ntime that she realized that no one on her volleyball team talks to her, and<br/>\nthat they get upset with her when she tells them to do something.  But<br/>\nagain, this is one of those situations where the beginning of the dislike<br/>\nhappened because she is not in school with them.<br/>\n<br/>\nI am sure, as many have said, that things will get better as she gets older<br/>\nand finds her place in the world.  Just hard on her right now, and me!  I<br/>\nwish people really knew the girl I know!  I really think unschooling is<br/>\ngoing to help her blossom into who she wants to be.  (Which was why she<br/>\nwanted to do this play (it is actually a muscial) in the first place.  I<br/>\ntold her if this was something she really wanted to do, we would do it even<br/>\nthough it meant traveling 45 minutes each way two days a week, etc.  And,<br/>\neven through all of this she still wants to do it!)<br/>\n<br/>\nmany blessings,<br/>\nerin</div>","specialLinks":[]},{"userId":6958287,"authorName":"Jim Selvage","from":"&quot;Jim Selvage&quot; &lt;jselvage@...&gt;","profile":"jselvage_jemj","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: Need some help with relationships (long)","postDate":"1042825549","msgId":55424,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNTgwMWMyYmU1MCQ0OTM1MGRiMCQwMTAwYThjMEBocHBhdmlsaW9uPg==","referencesHeader":"PEYxMDgzSmNYdTk4c01EOXhUM2wwMDAwYTNiNkBob3RtYWlsLmNvbT4gPDAwMmQwMWMyYmRlZCRhYjI3NjYyMCQwMTAwYThjMEBocHBhdmlsaW9uPiA8M0UyODNDRUUuNjAxMDIwOEB2b2wuY29tPg=="},"prevInTopic":55420,"nextInTopic":55425,"prevInTime":55423,"nextInTime":55425,"topicId":55321,"numMessagesInTopic":0,"msgSnippet":"Diane, Good idea!  I read that once a long time ago.  I am not sure if she will read it, but I will suggest it.  Thanks.  In fact maybe I will read it first. ","messageBody":"<div id=\"ygrps-yiv-1431628434\">Diane,<br/>\n<br/>\nGood idea!  I read that once a long time ago.  I am not sure if she will<br/>\nread it, but I will suggest it.  Thanks.  In fact maybe I will read it<br/>\nfirst.<br/>\n<br/>\nmany blessings,<br/>\nerin<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I was like this as a teen and it didn&#39;t go away with age. If she&#39;s<br/>\n&gt; interested in finding out more, you might suggest &quot;How To Win Friends<br/>\n&gt; And Influence People.&quot; That was the book that really helped me (in my<br/>\n </span></blockquote>30&#39;s).<br/>\n<blockquote><span title=\"qreply\"> &gt;<br/>\n&gt; :-) Diane </span></blockquote></div>","specialLinks":[]},{"userId":101672438,"authorName":"Bill and Diane","from":"Bill and Diane &lt;cen46624@...&gt;","profile":"thegreatdiane","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: Need some help with relationships (long)","postDate":"1042825436","msgId":55428,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNFMjg0MERDLjIwNjA0MDdAdm9sLmNvbT4=","referencesHeader":"PEYxMDgzSmNYdTk4c01EOXhUM2wwMDAwYTNiNkBob3RtYWlsLmNvbT4gPDAwMmQwMWMyYmRlZCRhYjI3NjYyMCQwMTAwYThjMEBocHBhdmlsaW9uPiA8M0UyODNDRUUuNjAxMDIwOEB2b2wuY29tPiA8MDA1ODAxYzJiZTUwJDQ5MzUwZGIwJDAxMDBhOGMwQGhwcGF2aWxpb24+"},"prevInTopic":55425,"nextInTopic":55430,"prevInTime":55427,"nextInTime":55429,"topicId":55321,"numMessagesInTopic":0,"msgSnippet":"Oh, good. I was afraid it would come across wrong--I ve worked really hard not to tell everyone what to do all the time, so I m glad this one came across OK.","messageBody":"<div id=\"ygrps-yiv-292688448\">Oh, good. I was afraid it would come across wrong--I&#39;ve worked really <br/>\nhard not to tell everyone what to do all the time, so I&#39;m glad this one <br/>\ncame across OK.<br/>\n<br/>\n:-) Diane<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt;Diane,<br/>\n&gt;<br/>\n&gt;Good idea!  I read that once a long time ago.  I am not sure if she will<br/>\n&gt;read it, but I will suggest it.  Thanks.  In fact maybe I will read it<br/>\n&gt;first.<br/>\n&gt;<br/>\n&gt;many blessings,<br/>\n&gt;erin<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;&gt;I was like this as a teen and it didn&#39;t go away with age. If she&#39;s<br/>\n&gt;&gt;interested in finding out more, you might suggest &quot;How To Win Friends<br/>\n&gt;&gt;And Influence People.&quot; That was the book that really helped me (in my<br/>\n&gt;&gt;<br/>\n&gt;30&#39;s).<br/>\n&gt;<br/>\n&gt;&gt;:-) Diane<br/>\n&gt;&gt; </span></blockquote></div>","specialLinks":[]},{"userId":101672438,"authorName":"Bill and Diane","from":"Bill and Diane &lt;cen46624@...&gt;","profile":"thegreatdiane","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Homeopathy (was Need some help)","postDate":"1042825131","msgId":55425,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNFMjgzRkFCLjMwNjA5MDRAdm9sLmNvbT4=","referencesHeader":"PEJBNEQ5RUEyLjEyNjM3JWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":55424,"nextInTopic":55428,"prevInTime":55424,"nextInTime":55426,"topicId":55321,"numMessagesInTopic":0,"msgSnippet":"OK--I ll admit I m a little tired of the He sucks his thumb--call a homeopath! He argues? Call a homeopath! She s mouthy? Call a homeopath! Too much TV?","messageBody":"<div id=\"ygrps-yiv-1740825501\">OK--I&#39;ll admit I&#39;m a little tired of the &quot;He sucks his thumb--call a <br/>\nhomeopath!&quot; &quot;He argues? Call a homeopath!&quot; &quot;She&#39;s mouthy? Call a <br/>\nhomeopath!&quot; &quot;Too much TV? Call a homeopath!&quot; &quot;Don&#39;t like the weather? <br/>\nCall a homeopath!&quot; And on and on and on and on and on and on and on and <br/>\non and on and on and on and on and on and on and on and on and on and on <br/>\nand on and on and on and on...<br/>\n<br/>\n:-) Diane          &lt;--usually not a complainer<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt;&gt;I won&#39;t say much, because I don&#39;t want to *disempower* anyone with my *expert*<br/>\n&gt;&gt;advice, as Joyce put it<br/>\n&gt;&gt;<br/>\n&gt;<br/>\n&gt;Before there is any speculation on whether I should have said what I may or<br/>\n&gt;may not have said, I will share what I privately discussed with Yol.<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":101672438,"authorName":"Bill and Diane","from":"Bill and Diane &lt;cen46624@...&gt;","profile":"thegreatdiane","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: Need some help with relationships (long)","postDate":"1042824430","msgId":55420,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNFMjgzQ0VFLjYwMTAyMDhAdm9sLmNvbT4=","referencesHeader":"PEYxMDgzSmNYdTk4c01EOXhUM2wwMDAwYTNiNkBob3RtYWlsLmNvbT4gPDAwMmQwMWMyYmRlZCRhYjI3NjYyMCQwMTAwYThjMEBocHBhdmlsaW9uPg=="},"prevInTopic":55412,"nextInTopic":55424,"prevInTime":55419,"nextInTime":55421,"topicId":55321,"numMessagesInTopic":0,"msgSnippet":"... I was like this as a teen and it didn t go away with age. If she s interested in finding out more, you might suggest How To Win Friends And Influence","messageBody":"<div id=\"ygrps-yiv-257303661\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt;<br/>\n&gt;I think it is both.  I see her do things (such as being bossy, always trying<br/>\n&gt;to be right) and I see people&#39;s reaction to her.  Up until this year, she<br/>\n&gt;was completely unaware of it. <br/>\n&gt;<br/>\n<br/>\n </span></blockquote>I was like this as a teen and it didn&#39;t go away with age. If she&#39;s <br/>\ninterested in finding out more, you might suggest &quot;How To Win Friends <br/>\nAnd Influence People.&quot; That was the book that really helped me (in my 30&#39;s).<br/>\n<br/>\n:-) Diane</div>","specialLinks":[]},{"userId":73699718,"authorName":"GDobes@aol.com","from":"GDobes@...","profile":"gdobes55","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Need some help with relationships (long)","postDate":"1042822277","msgId":55412,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGE1LjMzZGQ3ZjM5LjJiNTk4ZTg1QGFvbC5jb20+"},"prevInTopic":55410,"nextInTopic":55420,"prevInTime":55411,"nextInTime":55413,"topicId":55321,"numMessagesInTopic":0,"msgSnippet":"In a message dated 01/16/2003 12:19:46 PM Eastern Standard Time, ... Erin, Did I have twins and didn t remember? Our daughters sound very similar. I think many","messageBody":"<div id=\"ygrps-yiv-404207041\">In a message dated 01/16/2003 12:19:46 PM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jselvage@...\">jselvage@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My daughter is 13.  She is very outgoing socially, but does not seemed to be<br/>\n&gt; well liked.  I have tried to give her some hints about things that she does<br/>\n&gt; which might cause people not to like her, but overall I find this really<br/>\n&gt; difficult.  I like her!  She loves people and doing things<br/>\n<br/>\n </span></blockquote>Erin,<br/>\n       Did I have twins and didn&#39;t remember? Our daughters sound very <br/>\nsimilar.<br/>\n<br/>\n       I think many people have a preconceived notion of what a 13 y/o should <br/>\nlook and act like. When they encounter someone as outspoken, intelligent, and <br/>\nmature as my daughter, they don&#39;t know how to deal with them. In their eyes <br/>\nit must be the child&#39;s problem. My daughter has a handful of very close <br/>\nfriends, but many acquaintances. If she were in school, she would probably <br/>\nnot be part of the &quot;popular group.&quot; Does this bother her? No, she is quite <br/>\nhappy with who she is and doesn&#39;t want to fit everyone else&#39;s mold of a 13 <br/>\ny/o. She&#39;d much rather have friends because they like who she is not because <br/>\nshe follows the herd. <br/>\n<br/>\n       The only time she is bothered is in her theater group when the kid <br/>\nwith a voice that is reminiscent of fingernails on a chalkboard gets a <br/>\nleading role. The director is biased toward petite girls with nasal voices. <br/>\nIn spite of this she wants to continue with the troop.<br/>\n<br/>\n       What does your daughter think of all this? Is she bothered by all this <br/>\nor are you? I remind Carly of all her wonderful traits. You can always turn <br/>\nher negatives into positives. Instead of saying bossy, say assertive, <br/>\ndecisive. Our best traits are usually also our worst; it&#39;s all in how you <br/>\nlook at them.<br/>\n<br/>\n       Ginny<br/>\n<br/>\n        <br/>\n<br/>\n       <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Homeopathy (was Need some help)","postDate":"1042822258","msgId":55410,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBNEQ5RUEyLjEyNjM3JWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDNFMjcwRDg1LjQwNjAxMDNAYXR0Lm5ldD4="},"prevInTopic":55394,"nextInTopic":55412,"prevInTime":55409,"nextInTime":55411,"topicId":55321,"numMessagesInTopic":0,"msgSnippet":"... Before there is any speculation on whether I should have said what I may or may not have said, I will share what I privately discussed with Yol. I","messageBody":"<div id=\"ygrps-yiv-917657704\">on 1/16/03 2:52 PM, bluelotus at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:bluelotus@...\">bluelotus@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I won&#39;t say much, because I don&#39;t want to *disempower* anyone with my *expert*<br/>\n&gt; advice, as Joyce put it<br/>\n<br/>\n </span></blockquote>Before there is any speculation on whether I should have said what I may or<br/>\nmay not have said, I will share what I privately discussed with Yol.<br/>\n<br/>\nI understand that there are people on the list who appreciate the homeopathy<br/>\nsuggestions and some who feel this is an unschooling list and it doesn&#39;t<br/>\nbelong. I feel that the list can accomodate a variety of suggestions that<br/>\ndon&#39;t interfere with unschooling even if they aren&#39;t strictly &quot;unschooling&quot;.<br/>\nLots of people here hand out parent-to-parent advice on health matters and<br/>\nparenting matters they&#39;ve found works for them.<br/>\n<br/>\nYol is a practicing homeopath so that makes her advice *more* than<br/>\nparent-to-parent. It&#39;s professional advice. I asked that she be aware of the<br/>\ndifference. She says there is no difference.<br/>\n<br/>\nI think one of the things school and society robs us of as parents is a<br/>\nfeeling of competency: that we aren&#39;t competent to determine the needs of<br/>\nour own children. We can&#39;t tell a healthy child from an unhealthy one. The<br/>\nclues are so subtle that only professionals would be able to recognize them.<br/>\n<br/>\nI think it&#39;s important to support parents&#39; feelings of competence. When a<br/>\nprofessional repeatedly suggests that ordinary problems should be seen by a<br/>\nprofessional, I feel it undermines that feeling of competency.<br/>\n<br/>\nIt was beginning to feel, to me, like people were being directed to a<br/>\nhomeopath for too many ordinary run-of-the-mill problems that parents<br/>\nnormally handle themselves. I felt it was heading towards being harmful to<br/>\nsome people trying to regain (or build in the first place!) their sense of<br/>\nconfidence in themselves as parents.<br/>\n<br/>\nA specific incident -- small in itself but more significant when compounded<br/>\nby similar incidents -- was Yol&#39;s joke on the HEM-Unschooling list:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; What if someone said to a three year old boy who was holding his<br/>\n&gt;&gt; penis inside his pants, &quot;Hey, ya looking for gold?&quot; THAT would be<br/>\n&gt;&gt; funny, wouldn&#39;t it? Every male in the room would get a little gleam<br/>\n&gt;&gt; in his eye. <br/>\n&gt;&gt; <br/>\n&gt; I wouldn&#39;t say anything to the boy, because that would be humiliating<br/>\n&gt; IMO, but I would definitely say to the parents to take him to see a<br/>\n&gt; homeopath. But you know that&#39;s me and my clinical eye... ;-)<br/>\n<br/>\n </span></blockquote>While a parent could get away with saying something like this as a joke and<br/>\nhaving it mean nothing more than another parent, I felt it was irresponsible<br/>\nof a claimed professional to make jokes like this about something that<br/>\nwasn&#39;t presented as an obsessive problem but as something the parent wanted<br/>\ndirected to more private times.<br/>\n<br/>\nI did not ask her to stop giving out homeopathic advice. I asked her to be<br/>\nmore aware. She felt no one thought of her as a professional so her words<br/>\ndidn&#39;t mean any more than anyone elses&#39;. While that may be how some people<br/>\nview her, I felt it was irresponsible not to see the power her words *could*<br/>\nhave on some people.<br/>\n<br/>\nYol dismissed my suggestions and told me I&#39;d never see her offering<br/>\nhomeopathic advice again. That was her choice.<br/>\n<br/>\nAnd, apparently it&#39;s now her choice to change her mind when she feels it&#39;s<br/>\ntoo important not to offer her advice. And since, to me, this *again* seems<br/>\nlike another perfectly ordinary problem, the extraordinary need to pass on<br/>\nhomeopathic advice despite her declaration not to, reinforces my feelings<br/>\nthat judgement and power isn&#39;t being used wisely.<br/>\n<br/>\nJoyce<br/>\nUnschooling-dotcom moderator</div>","specialLinks":[]},{"userId":2099467,"authorName":"EBA7009@aol.com","from":"EBA7009@...","profile":"mikemom3","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: Need some help with relationships (long)","postDate":"1042815494","msgId":55394,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI1LjMyZDk0Njc0LjJiNTk3NDA2QGFvbC5jb20+"},"prevInTopic":55393,"nextInTopic":55410,"prevInTime":55393,"nextInTime":55395,"topicId":55321,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/17/03 3:37:29 AM !!!First Boot!!!, ... Just have to add my lurker 2 cents here.  My oldest daughter, now 21 and in college, was a lot","messageBody":"<div id=\"ygrps-yiv-1665769598\">In a message dated 1/17/03 3:37:29 AM !!!First Boot!!!, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mummyone24@...\">mummyone24@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Not sure if you really see something your daughter is doing to push people <br/>\n&gt; away or it&#39;s just her age and the kids she&#39;s around. If it&#39;s the latter of <br/>\n&gt; the two, it will all change shortly.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Just have to add my &quot;lurker&quot; 2 cents here.  My oldest daughter, now 21 and in <br/>\ncollege, was a lot like your daughter.  I realized that the very things that <br/>\nwere hard to deal with at 13 were the things that were going to make her an <br/>\nincredible woman.  The bossy-ness, with age, has become assertiveness - a <br/>\nreal positive if you ask me!<br/>\n<br/>\nBeth<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":84504749,"authorName":"Suzanne Ackerson","from":"&quot;Suzanne Ackerson&quot; &lt;sylvanv@...&gt;","profile":"sylvanv","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: Need some help with relationships (long)","postDate":"1042814318","msgId":55393,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNDgwMWMyYmUzNiQxZmIyODVlMCQ1MDg5NDg0NEBtc2hvbWUubmV0Pg==","referencesHeader":"PDU1LjM2NmY2YmM5LjJiNTg4MzAxQGFvbC5jb20+IDwwMDA5MDFjMmJkYWIkZGMxMWRhNTAkMDEwMGE4YzBAaHBwYXZpbGlvbj4="},"prevInTopic":55380,"nextInTopic":55394,"prevInTime":55392,"nextInTime":55394,"topicId":55321,"numMessagesInTopic":0,"msgSnippet":"Erin, I too struggle with a lot of the types of things you mentioned.   I tend to agree with someone on the list who said that things would probably improve","messageBody":"<div id=\"ygrps-yiv-44794700\">Erin,<br/>\n<br/>\nI too struggle with a lot of the types of things you mentioned.   I tend to agree with someone on the list who said that things would probably improve with time.   I watched my oldest, a boy, struggle with feeling he was not accepted in his homeschool group as a teen.  He continued to participate anyway and one of the teens told him he was the kindest person in the whole group.   Sometimes it just takes one good friend.   When things are going well for our kids we hurt just as much as they do.  Girls seem to mature socially before boys, so it might not be long till your daughter is finding herself feeling better about her social interactions.  For my oldest, he really came into his own right after he turned 17 and began college.  The like mindedness of his fellow music majors gave him a social belongingness.  <br/>\n<br/>\nIn the meantime I wonder if it would be possible for you and your daughter to start your own independant drama group.  It could be for just one play or more.  It could include both schoolers and non-schoolers.  Many years ago I got 6 children together, including my oldest, and they put on the play &quot;A Mad Tea Party.&quot;  I found the script and practiced with the kids twice a week for about a month. I had zero drama experience.  After each practice they swam in our pool and had snacks.  (I&#39;m sure the pool was a big draw, but those kids put on a darned good performance).  We taped it and the local newspaper took their picture.  If you could find a play that had several big parts then your daughter could shine with the rest of them.  Also, if you have a community drama group where she could act with adults, that might give her some positive feedback and a great opportunity.<br/>\n<br/>\nBest of everything to you,<br/>\nSuzanne<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: Jim Selvage <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a> <br/>\n  Sent: Thursday, January 16, 2003 4:08 PM<br/>\n  Subject: Re: [Unschooling-dotcom] Re: Need some help with relationships (long)<br/>\n<br/>\n<br/>\n  Teresa,<br/>\n  &quot;I would tend to think so too.  I know that I am hoping ( fingers crossed)<br/>\n  that the &#39;social stuff&quot; will be easier for Anna ( and my other kids too)<br/>\n  among homeschoolers than it was in public school.    Actually, my 11 yo son<br/>\n  &gt; is the one that has had the most trouble in social situatuions.. and I<br/>\n  have the same hope, that he does better with homeschoolers, in more relaxed<br/>\n  and  &quot;fun&quot; situations than at public school.&quot;<br/>\n<br/>\n  I understand Ethan&#39;s position too.  I have a son like that.   He mostly<br/>\n  prefers not to go to social activities and prefers to spend most of his time<br/>\n  on video games too (and reading).  I have in the past pushed him to do<br/>\n  social things.  He usually is happy to have done them, but does not carry<br/>\n  that on to the next activity.  He just doesn&#39;t like new situations, and that<br/>\n  is the way it is, lol.  He, would have never tried out for the musical in<br/>\n  the first place, lol.  I offered, but he said no way!  But you know what, he<br/>\n  seems to do better in social situations than my daughter.  He tends to sit<br/>\n  back and observe mostly, but when he begins to take part  he is accepted.  I<br/>\n  don&#39;t really get it.<br/>\n<br/>\n  I sure hope you do find some like minded families that will befriend your<br/>\n  children.  We have the added problem that we are unschooling, and there are<br/>\n  no other unschoolers in the immediate area that I know of.  But of course,<br/>\n  even if there are, they are probably not admitting it, lol.  So, I get<br/>\n  together with homeschoolers but don&#39;t really talk about schooling.  I used<br/>\n  to always be the one asking everyone what curriculum they used though, and<br/>\n  since I have tried most of them, I do understand what they are talking<br/>\n  about, lol.  With the laws in our state, I am sure if my friends new I was<br/>\n  unschooling they would be working to convince me that I shouldn&#39;t be.  They<br/>\n  are all very meticulously doing their curriculums and have always thought I<br/>\n  was off my rocker when I refused to give my children grades, etc.  They are<br/>\n  all really nice people though : - ) !<br/>\n<br/>\n  many blessings,<br/>\n  erin<br/>\n<br/>\n<br/>\n<br/>\n        Yahoo! Groups Sponsor <br/>\n              ADVERTISEMENT<br/>\n             <br/>\n       <br/>\n       <br/>\n<br/>\n  ~~~~ Don&#39;t forget! If you change topics, change the subject line! ~~~~<br/>\n<br/>\n  If you have questions, concerns or problems with this list, please email the moderator, Joyce Fetteroll (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a>), or the list owner, Helen Hegener (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Editor@...\">HEM-Editor@...</a>).<br/>\n<br/>\n  To unsubscribe from this group, click on the following link or address an email to:<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-unsubscribe@yahoogroups.com\">Unschooling-dotcom-unsubscribe@yahoogroups.com</a> <br/>\n<br/>\n  Visit the Unschooling website: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> <br/>\n<br/>\n  Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":6958287,"authorName":"Jim Selvage","from":"&quot;Jim Selvage&quot; &lt;jselvage@...&gt;","profile":"jselvage_jemj","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: Need some help with relationships (long)","postDate":"1042783193","msgId":55380,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMmQwMWMyYmRlZCRhYjI3NjYyMCQwMTAwYThjMEBocHBhdmlsaW9uPg==","referencesHeader":"PEYxMDgzSmNYdTk4c01EOXhUM2wwMDAwYTNiNkBob3RtYWlsLmNvbT4="},"prevInTopic":55373,"nextInTopic":55393,"prevInTime":55379,"nextInTime":55381,"topicId":55321,"numMessagesInTopic":0,"msgSnippet":"Mary, I think it is both.  I see her do things (such as being bossy, always trying to be right) and I see people s reaction to her.  Up until this year, she ","messageBody":"<div id=\"ygrps-yiv-217605750\">Mary,<br/>\n<br/>\nI think it is both.  I see her do things (such as being bossy, always trying<br/>\nto be right) and I see people&#39;s reaction to her.  Up until this year, she<br/>\nwas completely unaware of it.  Just last week, one girl from our church,<br/>\ntold her two things.  She said she didn&#39;t use to like her because she was<br/>\nnot &quot;popular&quot; and she didn&#39;t want to be seen with unpopular people.  (And<br/>\nshe said this was because of the homeschooling.)  She also said that they<br/>\ndidn&#39;t &quot;use&quot; to like her because she was annoying.  My daughter relayed this<br/>\ninformation to me, but it didn&#39;t really seem to bother her.  She had been at<br/>\nthe other girl&#39;s house that day, and she was just glad to go and spend some<br/>\ntime with her. (This doesn&#39;t happen very often though, and there is a girl<br/>\nin the same family who is my daughter&#39;s age that will talk to her there, but<br/>\nif she sees her in public she ignores her mostly.<br/>\n<br/>\nShe does have one good friend, who never treats her differently and they<br/>\nenjoy each other.  The friend is two years older than she is, which limits<br/>\nsome of the things they do together, and she is in school, but when they can<br/>\nget together they are happy.  So, she is not completely without friends.<br/>\n<br/>\nthanks for helping me figure this out,<br/>\nerin<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt;<br/>\n&gt; Just wondering if the whole no one likes me stuff is coming from your<br/>\n&gt; daughter or are you actually seeing that this is the case? </span></blockquote></div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: Need some help with relationships (long)","postDate":"1042777552","msgId":55373,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDExYi4xY2Q5YmNiNS4yYjU4ZGZkMEBhb2wuY29tPg=="},"prevInTopic":55369,"nextInTopic":55380,"prevInTime":55372,"nextInTime":55374,"topicId":55321,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/16/03 8:08:49 PM, grlynbl@aol.com writes: ","messageBody":"<div id=\"ygrps-yiv-1103943002\">In a message dated 1/16/03 8:08:49 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:grlynbl@...\">grlynbl@...</a> writes:<br/>\n<br/>\n&lt;&lt; Gosh, I know very little about homeopathy, mostly what Ive picked up on <br/>\nthis <br/>\nlist and a few other groups that have some homepaths on them.. and even with <br/>\nlimited exposure to homeopathy, I know its not all about little pills..  I <br/>\nthink the practice encompasses MUCH MUCH more than that.. That would be like <br/>\nsaying the unschooling is not doing a curriculum.    &gt;&gt;<br/>\n<br/>\nPossibly so, but on an unschooling list at least saying unschooling is not <br/>\ndoing a curriculum is on topic.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":99826381,"authorName":"Mary Bianco","from":"&quot;Mary Bianco&quot; &lt;mummyone24@...&gt;","profile":"mummyone24","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: Need some help with relationships (long)","postDate":"1042773392","msgId":55369,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYxMDgzSmNYdTk4c01EOXhUM2wwMDAwYTNiNkBob3RtYWlsLmNvbT4="},"prevInTopic":55368,"nextInTopic":55373,"prevInTime":55368,"nextInTime":55370,"topicId":55321,"numMessagesInTopic":0,"msgSnippet":"Just wondering if the whole no one likes me stuff is coming from your daughter or are you actually seeing that this is the case? Reason I ask is because I","messageBody":"<div id=\"ygrps-yiv-688778890\">Just wondering if the whole no one likes me stuff is coming from your <br/>\ndaughter or are you actually seeing that this is the case?<br/>\n<br/>\nReason I ask is because I always saw my oldest as intelligent and attractive <br/>\nand nice as a young adolescent. Now at 17, she tells me she was a real geek <br/>\nand a nerd and no one liked her. She&#39;s talking about the ages between 11-14. <br/>\nI still have a hard time believing it was all that bad but she swears for <br/>\nher it was awful. I mean I believe her when she says how bad it hurt, what I <br/>\ndon&#39;t believe is that she was really some freak. I think maybe she just <br/>\ntried way too hard to be well liked and she was easy pickings for when the <br/>\n&quot;popular girls&quot; neede someone to make fun of.<br/>\n<br/>\nI just talked until I was blue in the face about what was really important <br/>\nand to wait a few years and see where all the cattiness and nastiness got <br/>\nthe girls. Tara was always the one to stick up for the underdogs and talk to <br/>\nthe kids everyone made fun of. Now of course she sees what I was talking <br/>\nabout. She&#39;s a very well liked, understanding and trustworthy friend. Her <br/>\nfriends at school run the whole gammut of groups that the kids put <br/>\nthemselves in.<br/>\n<br/>\nNot sure if you really see something your daughter is doing to push people <br/>\naway or it&#39;s just her age and the kids she&#39;s around. If it&#39;s the latter of <br/>\nthe two, it will all change shortly.<br/>\n<br/>\nMary B<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n_________________________________________________________________<br/>\nProtect your PC - get McAfee.com VirusScan Online <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://clinic.mcafee.com/clinic/ibuy/campaign.asp?cid=3963\">http://clinic.mcafee.com/clinic/ibuy/campaign.asp?cid=3963</a></div>","specialLinks":[]},{"userId":56051484,"authorName":"grlynbl@aol.com","from":"grlynbl@...","profile":"jaeschool","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: Need some help with relationships (long)","postDate":"1042772885","msgId":55368,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE3Ny4xNGY3ZGMzNC4yYjU4Y2Q5NUBhb2wuY29tPg=="},"prevInTopic":55367,"nextInTopic":55369,"prevInTime":55367,"nextInTime":55369,"topicId":55321,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/16/03 10:04:47 PM Eastern Standard Time, ... Gosh, I know very little about homeopathy, mostly what Ive picked up on this list and a few","messageBody":"<div id=\"ygrps-yiv-2097087199\">In a message dated 1/16/03 10:04:47 PM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mummyone24@...\">mummyone24@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Correct me if I&#39;m wrong but it seems like any <br/>\n&gt; character flaw or negative personality one has, can be made all better with <br/>\n&gt; <br/>\n&gt; little pills?<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Gosh, I know very little about homeopathy, mostly what Ive picked up on this <br/>\nlist and a few other groups that have some homepaths on them.. and even with <br/>\nlimited exposure to homeopathy, I know its not all about little pills..  I <br/>\nthink the practice encompasses MUCH MUCH more than that.. That would be like <br/>\nsaying the unschooling is not doing a curriculum.    <br/>\n<br/>\nTeresa<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":99826381,"authorName":"Mary Bianco","from":"&quot;Mary Bianco&quot; &lt;mummyone24@...&gt;","profile":"mummyone24","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: Need some help with relationships (long)","postDate":"1042772658","msgId":55367,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYxMDNidVc1Uk5CNkhmTVZ1cjYwMDAxNjMxZEBob3RtYWlsLmNvbT4="},"prevInTopic":55342,"nextInTopic":55368,"prevInTime":55366,"nextInTime":55368,"topicId":55321,"numMessagesInTopic":0,"msgSnippet":"... ","messageBody":"<div id=\"ygrps-yiv-1151860589\"><blockquote><span title=\"ireply\">&gt;From: bluelotus &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:bluelotus@...\">bluelotus@...</a>&gt;<br/>\n<br/>\n </span></blockquote>&lt;&lt;I won&#39;t say much, because I don&#39;t want to *disempower* anyone with my <br/>\n*expert* advice, as Joyce put it, but I just feel compelled to say something <br/>\nbecause I sincerely feel for your girl.<br/>\nIf you really thik there is a problem with her way of relating to others <br/>\n(being bossy, etc.), homeopathy can help&gt;&gt;<br/>\n<br/>\n<br/>\nFirst of all I think maybe there is a tone to your post that isn&#39;t quite <br/>\nnecessary. Second of all, does homeopathy make perfect people??? That&#39;s the <br/>\nimpression I&#39;m getting. Correct me if I&#39;m wrong but it seems like any <br/>\ncharacter flaw or negative personality one has, can be made all better with <br/>\nlittle pills?<br/>\n<br/>\nMary B<br/>\n<br/>\n_________________________________________________________________<br/>\nMSN 8 with e-mail virus protection service: 2 months FREE* <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://join.msn.com/?page=features/virus\">http://join.msn.com/?page=features/virus</a></div>","specialLinks":[]},{"userId":6958287,"authorName":"Jim Selvage","from":"&quot;Jim Selvage&quot; &lt;jselvage@...&gt;","profile":"jselvage_jemj","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: Need some help with relationships (long)","postDate":"1042754928","msgId":55342,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDkwMWMyYmRhYiRkYzExZGE1MCQwMTAwYThjMEBocHBhdmlsaW9uPg==","referencesHeader":"PDU1LjM2NmY2YmM5LjJiNTg4MzAxQGFvbC5jb20+"},"prevInTopic":55339,"nextInTopic":55367,"prevInTime":55341,"nextInTime":55343,"topicId":55321,"numMessagesInTopic":0,"msgSnippet":"Teresa, I would tend to think so too.  I know that I am hoping ( fingers crossed) that the social stuff will be easier for Anna ( and my other kids too) ","messageBody":"<div id=\"ygrps-yiv-1636498848\">Teresa,<br/>\n&quot;I would tend to think so too.  I know that I am hoping ( fingers crossed)<br/>\nthat the &#39;social stuff&quot; will be easier for Anna ( and my other kids too)<br/>\namong homeschoolers than it was in public school.    Actually, my 11 yo son<br/>\n<blockquote><span title=\"ireply\"> &gt; is the one that has had the most trouble in social situatuions.. and I<br/>\n </span></blockquote>have the same hope, that he does better with homeschoolers, in more relaxed<br/>\nand  &quot;fun&quot; situations than at public school.&quot;<br/>\n<br/>\nI understand Ethan&#39;s position too.  I have a son like that.   He mostly<br/>\nprefers not to go to social activities and prefers to spend most of his time<br/>\non video games too (and reading).  I have in the past pushed him to do<br/>\nsocial things.  He usually is happy to have done them, but does not carry<br/>\nthat on to the next activity.  He just doesn&#39;t like new situations, and that<br/>\nis the way it is, lol.  He, would have never tried out for the musical in<br/>\nthe first place, lol.  I offered, but he said no way!  But you know what, he<br/>\nseems to do better in social situations than my daughter.  He tends to sit<br/>\nback and observe mostly, but when he begins to take part  he is accepted.  I<br/>\ndon&#39;t really get it.<br/>\n<br/>\nI sure hope you do find some like minded families that will befriend your<br/>\nchildren.  We have the added problem that we are unschooling, and there are<br/>\nno other unschoolers in the immediate area that I know of.  But of course,<br/>\neven if there are, they are probably not admitting it, lol.  So, I get<br/>\ntogether with homeschoolers but don&#39;t really talk about schooling.  I used<br/>\nto always be the one asking everyone what curriculum they used though, and<br/>\nsince I have tried most of them, I do understand what they are talking<br/>\nabout, lol.  With the laws in our state, I am sure if my friends new I was<br/>\nunschooling they would be working to convince me that I shouldn&#39;t be.  They<br/>\nare all very meticulously doing their curriculums and have always thought I<br/>\nwas off my rocker when I refused to give my children grades, etc.  They are<br/>\nall really nice people though : - ) !<br/>\n<br/>\nmany blessings,<br/>\nerin</div>","specialLinks":[]},{"userId":56051484,"authorName":"grlynbl@aol.com","from":"grlynbl@...","profile":"jaeschool","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: Need some help with relationships (long)","postDate":"1042753793","msgId":55339,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU1LjM2NmY2YmM5LjJiNTg4MzAxQGFvbC5jb20+"},"prevInTopic":55338,"nextInTopic":55342,"prevInTime":55338,"nextInTime":55340,"topicId":55321,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/16/03 4:17:01 PM Eastern Standard Time, ... I would tend to think so too.  I know that I am hoping ( fingers crossed) that the social","messageBody":"<div id=\"ygrps-yiv-828244386\">In a message dated 1/16/03 4:17:01 PM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jselvage@...\">jselvage@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I think that it should at least be different when immersed<br/>\n&gt; in a group of homeschoolers, and I think that is what has dissapointed me<br/>\n&gt; about the whole thing.  So in my disspointment I am looking at what we can<br/>\n&gt; do to change.  Maybe we can&#39;t do anything, but I gotta hope!<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>  I would tend to think so too.  I know that I am hoping ( fingers crossed)  <br/>\nthat the &#39;social stuff&quot; will be easier for Anna ( and my other kids too) <br/>\namong homeschoolers than it was in public school.    Actually, my 11 yo son <br/>\nis the one that has had the most trouble in social situatuions.. and I have <br/>\nthe same hope, that he does better with homeschoolers, in more relaxed and <br/>\n&quot;fun&quot; situations than at public school.   And, I also know what you mean by <br/>\ntrying to find out what is &quot;wrong&quot;.. or the reason that your daughter is <br/>\nhaving trouble fitting it.. I feel the same way about Ethan... I think.. what <br/>\ncan I do to help him feel more comfortable.. to help him relate to other <br/>\nchildren better..  We are new to homeschooling and in the process of trying <br/>\nto meet other hs families, joining clubs, signing up for activities, field <br/>\ntrips, whatever we can find to meet new folks.. Ethan is still very resistant <br/>\nto getting involved, and I have not insisted nor &quot;pushed&quot; him to join in..  <br/>\nReally, he would be happy to stay at home, all alone, playing video games.. <br/>\nBut, once I convince him to get out and join in with others, he does have a <br/>\ngood time and he does not regret it.  I just hope in time he becomes more <br/>\ncomfortable and seeks out these opportunities without me  having to convince <br/>\nhim to join in.   I think he is just so scarred and hurt by public school, he <br/>\nis gun shy.. It will just take time ( again.. I HOPE!)<br/>\n<br/>\nTeresa<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":6958287,"authorName":"Jim Selvage","from":"&quot;Jim Selvage&quot; &lt;jselvage@...&gt;","profile":"jselvage_jemj","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: Need some help with relationships (long)","postDate":"1042751695","msgId":55338,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMGIwMWMyYmRhNCQ1NGI2ZDY3MCQwMTAwYThjMEBocHBhdmlsaW9uPg==","referencesHeader":"PDFkYS4xOGMwNjkuMmI1ODcyMmJAYW9sLmNvbT4="},"prevInTopic":55336,"nextInTopic":55339,"prevInTime":55337,"nextInTime":55339,"topicId":55321,"numMessagesInTopic":0,"msgSnippet":"Teresa, Did she get a different part in the play?  Perhaps you can encourage her to just show her talent by doing that part as well as she possibly can. Blah,","messageBody":"<div id=\"ygrps-yiv-883214997\">Teresa,<br/>\n<br/>\n&quot;Did she get a different part in the play?  Perhaps you can encourage her to<br/>\njust show her talent by doing that part as well as she possibly can.<br/>\nBlah, I know, thats little consolation too.. &quot;there are no small parts&quot;<br/>\nseems like a bunch of BS when you have a small part., But those<br/>\nsmall parts can be bridges to bigger parts if they are played right and with<br/>\nenthusiasm and effort.&quot;<br/>\n<br/>\nYes, she did get a different part in the play, so we have had the discussion<br/>\nabout being the best she absolutely can at that part.  She says she will,<br/>\nand says she will learn the other part too, just in case the boy gets sick<br/>\nat the last minute, lol.  Today she is handling it well, but still<br/>\nmentioning it isn&#39;t fair.  We talked about how she can show her maturity by<br/>\ngoing in there at the next practice and doing her best and not letting it<br/>\nbug her,etc.<br/>\n<br/>\nYes, I guess 13 for anyone can be emotional.  I know she cannot be protected<br/>\nfrom the world, but this is just one isolated incident in a whole stream of<br/>\nthem.  Most of  the others could be explained away by the fact that we are<br/>\nhomeschoolers (only homeschoolers in a very small community which thinks<br/>\nthat their school is perfect and cannot see why I wouldn&#39;t send my children<br/>\nthere.  Even the girls her age who are in our church don&#39;t spend much time<br/>\nwith her and are purposely mean to her because she is different, i.e.<br/>\nhomeschooled.)  I think that it should at least be different when immersed<br/>\nin a group of homeschoolers, and I think that is what has dissapointed me<br/>\nabout the whole thing.  So in my disspointment I am looking at what we can<br/>\ndo to change.  Maybe we can&#39;t do anything, but I gotta hope!<br/>\n<br/>\nmany blessings,<br/>\nerin</div>","specialLinks":[]},{"userId":56051484,"authorName":"grlynbl@aol.com","from":"grlynbl@...","profile":"jaeschool","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: Need some help with relationships (long)","postDate":"1042749483","msgId":55336,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFkYS4xOGMwNjkuMmI1ODcyMmJAYW9sLmNvbT4="},"prevInTopic":55332,"nextInTopic":55338,"prevInTime":55335,"nextInTime":55337,"topicId":55321,"numMessagesInTopic":0,"msgSnippet":"Erin, I dont know if I really have any advice ( esp unschooling related)  but, I can empathize with you We have had  similar experiences  in my family( I wont ","messageBody":"<div id=\"ygrps-yiv-1278347251\">Erin,<br/>\n<br/>\nI dont know if I really have any advice ( esp unschooling related)  but, I <br/>\ncan empathize with you We have had  similar experiences  in my family( I wont <br/>\ngo into them specifically for the sake of time and space).<br/>\n<br/>\n    My daughter is also 13, and gosh, it is such an emotional age.  <br/>\nEVERYTHING is a big deal.  A lot of the emotional turmoil that Anna <br/>\nexperienced, I blamed on school ( and probably rightly so)  But I can see <br/>\nthat school is not all to blame.. Just like in your situation, I think its <br/>\njust thier age in general, and &quot;life&quot; in general that is difficult for <br/>\nchanging minds and bodies to deal with.   Unfortunately, even unschooling <br/>\ncan&#39;t shelter our children from plain old politics in this world.  The only <br/>\nalternative would be to avoid society at large, and I dont think that is a <br/>\ngood idea.   I  know she feels like lifes not fair, and that she didnt get a <br/>\nchance to prove herself.   I hate that for her.  I suppose the only <br/>\nconsolation is that there is always &quot;next time&quot;  IF she isnt too afraid of <br/>\nrejection again.   Did she get a different part in the play?  Perhaps you can <br/>\nencourage her to just show her talent by doing that part as well as she <br/>\npossibly can.    Blah, I know, thats little consolation too.. &quot;there are no <br/>\nsmall parts&quot;  seems like a bunch of BS when you have a small part., But those <br/>\nsmall parts can be bridges to bigger parts if they are played right and with <br/>\nenthusiasm and effort.<br/>\n<br/>\n   I think mostly, with kids this age, its a matter of  just letting her get <br/>\nher feelings out and listening to her woes.  Usually, after Anna has her <br/>\nemotional bouts of frustration, depression, anxiety, etc.. she&#39;s fine and <br/>\nback to &quot;normal&quot; soon.   I remember those roller coaster days when I was her <br/>\nage.. Oh, bless my poor Momma.. lol..<br/>\n<br/>\nTeresa <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":6958287,"authorName":"Jim Selvage","from":"&quot;Jim Selvage&quot; &lt;jselvage@...&gt;","profile":"jselvage_jemj","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: Need some help with relationships (long)","postDate":"1042747917","msgId":55332,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMzUwMWMyYmQ5YiQ4OTJhYTg5MCQwMTAwYThjMEBocHBhdmlsaW9uPg==","referencesHeader":"PDNFMjcwRDg1LjQwNjAxMDNAYXR0Lm5ldD4="},"prevInTopic":55331,"nextInTopic":55336,"prevInTime":55331,"nextInTime":55333,"topicId":55321,"numMessagesInTopic":0,"msgSnippet":"Yol, I will try to do some more reading about homeopathy.  I suspect I live in an area where they have never heard of it, so I don t think I could go to anyone","messageBody":"<div id=\"ygrps-yiv-1144993277\">Yol,<br/>\n<br/>\nI will try to do some more reading about homeopathy.  I suspect I live in an<br/>\narea where they have never heard of it, so I don&#39;t think I could go to<br/>\nanyone for help (probably can&#39;t afford it anyway).  Thanks.<br/>\n<br/>\nWhat happened with the part in the play, is that they didn&#39;t try anyone out.<br/>\nMy daughter had done the part the first two practices (without any prior<br/>\nknowledge of the musical, etc), and then the other child (a boy) was asked<br/>\nto do the part for the next two.  The difference here is that the boy had<br/>\nbeen in the production last year, with a different part, but he knew the how<br/>\nthe part was played.  The director has said she would have try-outs<br/>\nyesterday and my daughter had practiced the part a lot, using different<br/>\nvoice intonations etc.  Then, without having them try out, they just walked<br/>\nup and told her that the boy had the part, and she would have a different<br/>\npart.  So she didn&#39;t even get a chance to show them how she could do with it<br/>\nreally.  But like I said, I really feel like how well she could do that part<br/>\ndidn&#39;t really matter.<br/>\n<br/>\nblessings,<br/>\nerin<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message -----<br/>\nFrom: &quot;bluelotus&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:bluelotus@...\">bluelotus@...</a>&gt;<br/>\nTo: &quot;Unschooling.com&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a>&gt;<br/>\nSent: Thursday, January 16, 2003 1:52 PM<br/>\nSubject: [Unschooling-dotcom] Re: Need some help with relationships (long)<br/>\n<br/>\n<br/>\n&gt; &lt;&lt; My daughter is 13.  She is very outgoing socially, but does not seemed<br/>\nto be<br/>\n&gt; well liked.  I have tried to give her some hints about things that she<br/>\ndoes<br/>\n&gt; which might cause people not to like her, but overall I find this really<br/>\n&gt; difficult.  I like her!  She loves people and doing things.  She is a very<br/>\n&gt; crafty person.  She is great at thinking through things and coming up with<br/>\n&gt; ways to do things that others might not see.  She loves to help people and<br/>\n&gt; be involved in whatever someone is doing.  She can tend to be too bossy.&gt;&gt;<br/>\n&gt;<br/>\n&gt; I won&#39;t say much, because I don&#39;t want to *disempower* anyone with my<br/>\n*expert* advice, as Joyce put it, but I just feel compelled to say something<br/>\nbecause I sincerely feel for your girl.<br/>\n&gt; If you really thik there is a problem with her way of relating to others<br/>\n(being bossy, etc.), homeopathy can help. With both the way she relates with<br/>\nothers and how she perceives others treating her (which is basically one and<br/>\nthe same).<br/>\n&gt;<br/>\n&gt; I suspect her disappointment from not getting the part in the play comes<br/>\nfrom knowing that &quot;there&#39;s something more to it,&quot; if you know what I mean,<br/>\nbecause she wasn&#39;t given a chance (were the other girls given a chance?). In<br/>\nany case, homeopathic treatment can help deal with those confusing emotions<br/>\n(one may argue that being *bossy* is just a personality trait, but to me it<br/>\nshows an imbalance which is actually preventing her from relating in a  more<br/>\nrelaxed manner).<br/>\n&gt;<br/>\n&gt; Adolescence (like menopause) is a time when a lot of stuff shows up for a<br/>\nwoman and it&#39;s a transitional period that can be hard to deal with for most<br/>\nof us. Anyway, I just thought I&#39;d mention it not from an *expert* point of<br/>\nview, but out of compassion for a young woman. I am sure you&#39;ll get plenty<br/>\nof good advice from people with older kids here...  ;-)<br/>\n&gt;<br/>\n&gt; Yol<br/>\n&gt;<br/>\n&gt; --<br/>\n&gt;<br/>\n&gt; Blue Lotus Therapeutics -<br/>\n&gt; Ayurveda, Homeopathy, Yoga & Therapeutic Massage<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.bluelotustherapeutics.com\">http://www.bluelotustherapeutics.com</a><br/>\n&gt;<br/>\n&gt; Dhyanyoga Center of NC -<br/>\n&gt; Meditation - Kundalini Maha Yoga<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.dyc-nc.org\">http://www.dyc-nc.org</a><br/>\n&gt;<br/>\n&gt; **********************************<br/>\n&gt; When nothing is done, nothing is left undone. The world is ruled by<br/>\n&gt; letting things take their course. It cannot be ruled by interfering.<br/>\n&gt; -- Tao Te Ching<br/>\n&gt; **********************************<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ~~~~ Don&#39;t forget! If you change topics, change the subject line! ~~~~<br/>\n&gt;<br/>\n&gt; If you have questions, concerns or problems with this list, please email<br/>\nthe moderator, Joyce Fetteroll (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a>), or the list owner,<br/>\nHelen Hegener (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Editor@...\">HEM-Editor@...</a>).<br/>\n&gt;<br/>\n&gt; To unsubscribe from this group, click on the following link or address an<br/>\nemail to:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-unsubscribe@yahoogroups.com\">Unschooling-dotcom-unsubscribe@yahoogroups.com</a><br/>\n&gt;<br/>\n&gt; Visit the Unschooling website: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n&gt;<br/>\n&gt; Your use of Yahoo! Groups is subject to <a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a><br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":129256077,"authorName":"bluelotus","from":"bluelotus &lt;bluelotus@...&gt;","profile":"yolswandass","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Need some help with relationships (long)","postDate":"1042746757","msgId":55331,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNFMjcwRDg1LjQwNjAxMDNAYXR0Lm5ldD4="},"prevInTopic":55321,"nextInTopic":55332,"prevInTime":55330,"nextInTime":55332,"topicId":55321,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-947991514\">&lt;&lt; My daughter is 13.  She is very outgoing socially, but does not seemed to be<br/>\nwell liked.  I have tried to give her some hints about things that she does<br/>\nwhich might cause people not to like her, but overall I find this really<br/>\ndifficult.  I like her!  She loves people and doing things.  She is a very<br/>\ncrafty person.  She is great at thinking through things and coming up with<br/>\nways to do things that others might not see.  She loves to help people and<br/>\nbe involved in whatever someone is doing.  She can tend to be too bossy.&gt;&gt;<br/>\n<br/>\nI won&#39;t say much, because I don&#39;t want to *disempower* anyone with my *expert* advice, as Joyce put it, but I just feel compelled to say something because I sincerely feel for your girl.<br/>\nIf you really thik there is a problem with her way of relating to others (being bossy, etc.), homeopathy can help. With both the way she relates with others and how she perceives others treating her (which is basically one and the same).<br/>\n<br/>\nI suspect her disappointment from not getting the part in the play comes from knowing that &quot;there&#39;s something more to it,&quot; if you know what I mean, because she wasn&#39;t given a chance (were the other girls given a chance?). In any case, homeopathic treatment can help deal with those confusing emotions (one may argue that being *bossy* is just a personality trait, but to me it shows an imbalance which is actually preventing her from relating in a  more relaxed manner). <br/>\n<br/>\nAdolescence (like menopause) is a time when a lot of stuff shows up for a woman and it&#39;s a transitional period that can be hard to deal with for most of us. Anyway, I just thought I&#39;d mention it not from an *expert* point of view, but out of compassion for a young woman. I am sure you&#39;ll get plenty of good advice from people with older kids here...  ;-)<br/>\n<br/>\nYol<br/>\n<br/>\n-- <br/>\n<br/>\nBlue Lotus Therapeutics -<br/>\nAyurveda, Homeopathy, Yoga & Therapeutic Massage<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.bluelotustherapeutics.com\">http://www.bluelotustherapeutics.com</a><br/>\n<br/>\nDhyanyoga Center of NC -<br/>\nMeditation - Kundalini Maha Yoga<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.dyc-nc.org\">http://www.dyc-nc.org</a><br/>\n<br/>\n**********************************<br/>\nWhen nothing is done, nothing is left undone. The world is ruled by <br/>\nletting things take their course. It cannot be ruled by interfering.<br/>\n-- Tao Te Ching<br/>\n**********************************</div>","specialLinks":[]},{"userId":6958287,"authorName":"Jim Selvage","from":"&quot;Jim Selvage&quot; &lt;jselvage@...&gt;","profile":"jselvage_jemj","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Need some help with relationships (long)","postDate":"1042737435","msgId":55321,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwODYwMWMyYmQ4MyQyMTU5OTY4MCQwMTAwYThjMEBocHBhdmlsaW9uPg==","referencesHeader":"PGIwNTgxNCtrdXI0QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":55331,"prevInTime":55320,"nextInTime":55322,"topicId":55321,"numMessagesInTopic":0,"msgSnippet":"I am needing some help here sorting some things out, and hoping all you wise ladies can help.  I would have said I need help with socialization issues but I","messageBody":"<div id=\"ygrps-yiv-292819341\">I am needing some help here sorting some things out, and hoping all you wise<br/>\nladies can help.  I would have said I need help with &quot;socialization&quot; issues<br/>\nbut I hate that word.<br/>\n<br/>\nMy daughter is 13.  She is very outgoing socially, but does not seemed to be<br/>\nwell liked.  I have tried to give her some hints about things that she does<br/>\nwhich might cause people not to like her, but overall I find this really<br/>\ndifficult.  I like her!  She loves people and doing things.  She is a very<br/>\ncrafty person.  She is great at thinking through things and coming up with<br/>\nways to do things that others might not see.  She loves to help people and<br/>\nbe involved in whatever someone is doing.  She can tend to be too bossy.<br/>\nShe doesn&#39;t do well sitting in a chair and listening to a teacher without<br/>\nsomething else to do (and for this reason gets on the nerves of sunday<br/>\nschool teachers, though one has figured it out and allows her to doodle,<br/>\nwhereas the other hasn&#39;t figured it out and rebukes her for getting out of<br/>\nher chair, talking, etc.)<br/>\n<br/>\nI am mainly concerned today because yesterday our homeschooling group had<br/>\nthe final pick for parts in the play we will be doing at the<br/>\nhomeschoolconvention.  She had her heart set on a certain part and did not<br/>\nget it.  She was extremely upset.  She told me that it wasn&#39;t fair because<br/>\nthe director had not even really given her a chance to try for the part<br/>\n(like she had said she would).  The person who got the part is a sweet,<br/>\ncompliant child.  I am not complaining that she did not get the part (they<br/>\ndid give her a part, just not a major one), but I am trying to figure out<br/>\nwhy this always seems to happen to her.  I do think that it has something to<br/>\ndo with the fact that they don&#39;t like her (which is why I am putting this<br/>\nstory in the message), but I don&#39;t know how to help her with this issue.  I<br/>\ncould be completely wrong.  But if I am wrong about this incident, I am not<br/>\nwrong about the general feeling.<br/>\n<br/>\nHelp!<br/>\n<br/>\nmany blessings,<br/>\nerin</div>","specialLinks":[]}],"prevTopicId":55619,"nextTopicId":55601}}