{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"crazy interconnectedness (was tv, but one of those lovely coincidences)","postDate":"1066923269","msgId":16967,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0MS4xYjI1Yjc5Ny4yY2M5NGYwNUBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":16966,"nextInTime":16968,"topicId":16967,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/23/03 7:53:30 AM, tktraas@paulbunyan.net writes: ","messageBody":"<div id=\"ygrps-yiv-1807564408\">In a message dated 10/23/03 7:53:30 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:tktraas@...\">tktraas@...</a> writes:<br/>\n<br/>\n&lt;&lt;  I know some people like this and others who<br/>\n<br/>\nnever run into situations like this.<br/>\n<br/>\n<br/>\n&lt;&lt;Don&#39;t you think it says alot about how open we are to others?  &gt;&gt;<br/>\n<br/>\nYES.<br/>\nSome people are too still and don&#39;t make eye contact (figuratively or <br/>\nliterally) and are paranoid of others, and so they can&#39;t get much excitement-business.<br/>\n<br/>\nI have a friend just because we have the same birthday (to the year).   <br/>\nWolfgang Marquardt.  He sent me an IM on AOL.  I could have ignored it, but I <br/>\nthought &#39;what the heck.&#39;  He was in northern Germany and just loved American <br/>\ncultural trivia like how much does a Christmas tree cost?  What do we pay for <br/>\nnatural gas and electricity?  He&#39;s living in Washington now, about to marry an <br/>\nAmerican.  He&#39;s been to visit me twice, and I need to send him a wedding gift!  He <br/>\nhas sent me birthday cards in German (which is cool) and we&#39;ve had LONG long <br/>\nchats by instant message about his impressions of the U.S. once he came here, <br/>\nafter all those years of distant interest.  He&#39;s lived in Texas and Washington.<br/>\n<br/>\n&lt;&lt; I think it has alot to do with our desire to know things and discover <br/>\nthings.   Also, whether we are open to others.&gt;&gt;<br/>\n<br/>\nI am unquestionably a nosy curious kind of &quot;how come?&quot; person and always have <br/>\nbeen.  There&#39;s a kind of hyperactivity in the social area of my mind. &lt;g&gt;<br/>\n<br/>\nThis Friday night (yikes!  Tomorrow!) I&#39;m going to a potluck to visit friends <br/>\nI&#39;ve known since second grade (three of them) but one I hadn&#39;t seen since <br/>\nhigh school.  I don&#39;t know who else will be there, but I&#39;m really excited.  I <br/>\njust need to cook.<br/>\n<br/>\n&lt;&lt;Or maybe some of us just attract weirdness?? &gt;&gt;<br/>\n<br/>\nThis is true of me too.<br/>\nYou might have noticed it even onlinory.  I poke them back and say &quot;WHY are <br/>\nyou being this way?  What&#39;s the deal?&quot;  Most people clam up, squint their eyes, <br/>\nturn the other way.<br/>\n<br/>\nI have another couple of very swirly-lifed friends, and our conversations can <br/>\ngo on for HOURS when we catch up with each other.<br/>\n<br/>\nI have come back up to warn that no one with seizure disorders or heart <br/>\nconditions or a life should read the following paragraph.<br/>\n<br/>\nHolly thinks it&#39;s funny that my stories of childhood friends and later <br/>\nrelationship and marriages is so interconnected and confused.  Yet lots of them are <br/>\nstill in contact with one another.    A girl she really likes would have been <br/>\nmy neice if I hadn&#39;t divorced my ex-husband and on the other side, she&#39;s the <br/>\ndaughter of someone I knew since he was born, whose sister married somone I had <br/>\n(have?) a pact with since we were 15 that as soon a both of us were <br/>\nunattached, we&#39;d get together.  I&#39;m still in contact with him (though she&#39;s divorced) <br/>\nand I talked to him Monday, and I&#39;ll see her (the ex-wife still-aunt of Holly&#39;s <br/>\nfriend Naomi) on Friday night with the others.   We saw Naomi and her mom <br/>\nRuth (the younger sister of my ex-husband, who was one of the three kids I was <br/>\n&quot;raising&quot;  when I was 21 to 23 years old--she was 12-15 then) at my sister&#39;s <br/>\nhousewarming last the 12th.  Turned out my sister&#39;s new house is three miles from <br/>\nKeith&#39;s best friend Bob who was our best man.  Up the same road, between <br/>\nBrazos and Chama.  One of Bob&#39;s ex-girlfriends once kinda stalked my friend Jeff <br/>\nand she got crazy for a while, but she&#39;s fine.  I WAS going to go with her to <br/>\nDenver this last weekend for an SCA ceremony involving our former housemate <br/>\nWendy...  I&#39;ll just stop because the story doesn&#39;t ever stop.<br/>\n<br/>\nI tried to make a chart of all those stories for my friend Barbara once, and <br/>\nit would have had to be a three-dimensional thing with some kind of overlays <br/>\non some of the characters.  Could not figure out how to chart it.   <br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":16893,"nextTopicId":16976}}