{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":53620434,"authorName":"Christina Morrissey","from":"Christina Morrissey &lt;cvw@...&gt;","profile":"christa_wa","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] On Horizontal Vs Vertical Prayer","postDate":"1047149017","msgId":60432,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUuMS4wLjE0LjIuMjAwMzAzMDgxMDQyNTkuMDMyODZmOThAcG9zdG9mZmljZS53b3JsZG5ldC5hdHQubmV0Pg==","inReplyToHeader":"PHAwNTAwMTkyOWJhOGVhM2RjYzMzZUBbMTIuMjEuMjA4LjExNF0+","referencesHeader":"PDEwNDcwNjQwMDIuMTk1OS44OTI2Ni5tM0B5YWhvb2dyb3Vwcy5jb20+IDwxMDQ3MDY0MDAyLjE5NTkuODkyNjYubTNAeWFob29ncm91cHMuY29tPg=="},"prevInTopic":60318,"nextInTopic":0,"prevInTime":60431,"nextInTime":60433,"topicId":60318,"numMessagesInTopic":0,"msgSnippet":"Excellent article....Thanks for posting it!!","messageBody":"<div id=\"ygrps-yiv-195007988\">Excellent article....Thanks for posting it!!<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt;On Horizontal Vs Vertical Prayer<br/>\n&gt;March 5, 2003<br/>\n&gt;BY ROGER EBERT </span></blockquote></div>","specialLinks":[]},{"userId":1294635,"authorName":"Helen Hegener","from":"Helen Hegener &lt;HEM-Editor@...&gt;","profile":"hemhelen","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"On Horizontal Vs Vertical Prayer","postDate":"1047065540","msgId":60318,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PHAwNTAwMTkyOWJhOGVhM2RjYzMzZUBbMTIuMjEuMjA4LjExNF0+","inReplyToHeader":"PDEwNDcwNjQwMDIuMTk1OS44OTI2Ni5tM0B5YWhvb2dyb3Vwcy5jb20+","referencesHeader":"PDEwNDcwNjQwMDIuMTk1OS44OTI2Ni5tM0B5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":60432,"prevInTime":60317,"nextInTime":60319,"topicId":60318,"numMessagesInTopic":0,"msgSnippet":"I ve been just lurking along on digest, trying to catch up with all my lists, but I thought this piece - by one of my favorite writers - was particularly","messageBody":"<div id=\"ygrps-yiv-1400236267\">I&#39;ve been just lurking along on digest, trying to catch up with all <br/>\nmy lists, but I thought this piece - by one of my favorite writers - <br/>\nwas particularly relevant to the current discussion:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.suntimes.com/output/eb-feature/cst-edt-ebert05.html\">http://www.suntimes.com/output/eb-feature/cst-edt-ebert05.html</a><br/>\n<br/>\nOn Horizontal Vs Vertical Prayer<br/>\nMarch 5, 2003<br/>\nBY ROGER EBERT<br/>\n<br/>\nThe Bush administration has been dealt a setback in its campaign to allow<br/>\nprayer in our public schools. The full 9th Circuit U.S. Court of Appeals<br/>\nhas voted 15-9 to back the 2-1 vote by its earlier panel finding the<br/>\nPledge of Allegiance unconstitutional because of the words &#39;&#39;under God.&#39;&#39;<br/>\n<br/>\nThe pledge, written in 1892, had those words added to it in 1954, during<br/>\nthe Eisenhower administration, and I remember a nun in our Catholic<br/>\nschool telling us we had to say it because it was the law--but it was<br/>\nwrong, because it violated the principle of separating church and state.<br/>\nWe started every day with classroom prayer at St. Mary&#39;s School, of<br/>\ncourse, but Sister Rosanne said there was a difference between voluntary<br/>\nprayer in a private religious school and prayer in a school paid for by<br/>\nevery taxpayer--a distinction so obvious that Bush and Attorney General<br/>\nJohn Ashcroft are forced to willfully ignore it.<br/>\nAshcroft said after the ruling that his Justice Department will &#39;&#39;spare<br/>\nno effort to preserve the rights of all our citizens to pledge allegiance<br/>\nto the American flag&#39;&#39;--a misrepresentation so blatant that it functions<br/>\nas a lie. The pledge remains intact and unchallenged. The court said<br/>\nnothing about pledging allegiance to the flag. It spoke only of the words<br/>\n&#39;&#39;under God&#39;&#39;--which amounted, the court said, to an endorsement of<br/>\nreligion.<br/>\nThis is really an argument between two kinds of prayer--vertical and<br/>\nhorizontal. I don&#39;t have the slightest problem with vertical prayer. It<br/>\nis horizontal prayer that frightens me. Vertical prayer is private,<br/>\ndirected upward toward heaven. It need not be spoken aloud, because God<br/>\nis a spirit and has no ears. Horizontal prayer must always be audible,<br/>\nbecause its purpose is not to be heard by God, but to be heard by fellow<br/>\nmen standing within earshot.<br/>\nTo choose an example from football, when my team needs a field goal to<br/>\nwin and I think, &#39;&#39;Please, dear God, let them make it!&#39;&#39;--that is<br/>\nvertical prayer. When, before the game, a group of fans joins hands and<br/>\n&#39;&#39;voluntarily&#39;&#39; recites the Lord&#39;s Prayer--that is horizontal prayer. It<br/>\nserves one of two purposes: to encourage me to join them, or to make me<br/>\nfeel excluded.<br/>\nAlthough some of the horizontal devout are sincere, others use this<br/>\nprayer as a device of recruitment or intimidation. If you are conspicuous<br/>\nin your refusal to go along, they may even turn and pray while holding<br/>\nyou directly in their sights.<br/>\nThis simple insight about two kinds of prayer, which is beyond<br/>\ntheological question, should bring a dead halt to the obsession with<br/>\nprayer in public places. It doesn&#39;t, because the purpose of its<br/>\nsupporters is political, not spiritual. Their faith is like Dial soap:<br/>\nNow that they use it, they wish everyone would. I grew up in an America<br/>\nwhere people of good breeding did not impose their religious convictions<br/>\nupon those they did not know very well. Now those manners have been<br/>\ndiscarded.<br/>\nOur attorney general, John Ashcroft, is theoretically responsible for<br/>\nenforcing the separation of church and state. He violates his oath of<br/>\noffice daily by getting down on his knees in his government office every<br/>\nmorning and welcoming federal employees to join him in &#39;&#39;voluntary&#39;&#39;<br/>\nprayer on carpets paid for by the taxpayers.<br/>\nHis brand of religion is specifically fundamentalist evangelical. As his<br/>\neyes lift from beneath lowered lids to take informal attendance, would he<br/>\nbe gladdened to see a Muslim, a Catholic, a Jew, a Hindu, a Buddhist, a<br/>\nBaha&#39;i, a Unitarian, a Scientologist, all accompanied by the chants of<br/>\nHare Krishnas?<br/>\nUnder Bush we have had a great deal of horizontal prayer, in which we<br/>\nevoke the deity at political events to send the sideways message that our<br/>\nenemies had better look out, because God is on our side. This week&#39;s<br/>\nNewsweek cover story reports that the Bush presidency &#39;&#39;is the most<br/>\nresolutely &#39;faith-based&#39; in modern times.&#39;&#39;<br/>\nBecause our enemies are for the most part more enthusiastic about<br/>\nhorizontal prayer than we are, and see absolutely no difference between<br/>\nchurch and state--indeed, want to make them the same--it is alarming to<br/>\nreflect that they may be having more success bringing us around to their<br/>\npoint of view than we are at sticking to our own traditional American<br/>\nbeliefs about freedom of religion. When Ashcroft and his enemies both<br/>\nbegin their days with displays of their godliness, do we feel safer after<br/>\nthey rise from their devotions?<br/>\nCopyright © Chicago Sun-Times Inc.</div>","specialLinks":[]}],"prevTopicId":60425,"nextTopicId":60404}}