{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":56051484,"authorName":"grlynbl@aol.com","from":"grlynbl@...","profile":"tbb1967","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: Eating just to eat vs dining","postDate":"1043682676","msgId":56600,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY5LjI4Y2M4MDkzLjJiNjZhZjc0QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":56599,"nextInTime":56601,"topicId":56600,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/27/03 9:49:26 AM Eastern Standard Time, ... Wonderfully said, Glena.   I agree.   And I was thinking when folks kept listing all the","messageBody":"<div id=\"ygrps-yiv-1117483462\">In a message dated 1/27/03 9:49:26 AM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:rubyprincesstsg@...\">rubyprincesstsg@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; know for those who can barely find time to feed their families this does <br/>\n&gt; not make sense.  But if you can understand that it doesn&#39;t matter if it&#39;s <br/>\n&gt; pigs in a blanket or prime rib, it&#39;s the EVENT that dinner is more than the <br/>\n&gt; <br/>\n&gt; type or amount of food.  This becomes more important as children find their <br/>\n&gt; <br/>\n&gt; way in the world and have jobs and other things going on.  I think <br/>\n&gt; sometimes <br/>\n&gt; if our children are home with us every day all day, we might sometimes take <br/>\n&gt; <br/>\n&gt; that time a little for granted.<br/>\n&gt; <br/>\n&gt; I know that I did before but try to make an effort not to anymore.<br/>\n&gt; <br/>\n&gt; I probably didn&#39;t help anyone understand it better but it isn&#39;t about <br/>\n&gt; actual <br/>\n&gt; food at all.  <br/>\n&gt; <br/>\n&gt; glena<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Wonderfully said, Glena.   I agree.   And I was thinking when folks kept <br/>\nlisting all the things they do with thier children, all the times they are <br/>\ntogether so they dont &quot;need&quot; family meal together time...  Its not about the <br/>\nquantity of time you spend with each child.  For us, its more about ALL of us <br/>\nbeing together as a family.   Its that time of day ( and NO, its not every <br/>\nday)  that we are all in one place at the same time.  It feels very close and <br/>\nintimate.   And, your right, whether its bologna sandwiches or rack of lamb,  <br/>\nthe comfort comes from being together, not so much the food.   Its checking <br/>\nin with each other.. Sharing the days events, accomplisments, concerns.  <br/>\nLearning from each other about how we each deal with and handle things.  Its <br/>\ngetting and giving advice and support for each other.    Its basically an <br/>\naffirmation that we are a family and we are here for each other. <br/>\n<br/>\n Another thing that struck me while reading some of the responses to familes <br/>\neating together..  For me, preparing a meal for my family is an act of love.  <br/>\nIts a sacrifice of my time and effort that I gladly give.   They appreciate <br/>\nit.   I dont HAVE to cook a sit down meal.. and  for most of our eating, I <br/>\ndont. But when I do, it shows that I want to take the extra time and effort <br/>\nto create an opportunity for us all to be together.  I usually get several <br/>\n&quot;thank yous, that was good&quot;.. etc.<br/>\n<br/>\n  Its NEVER been mandatory to come eat with the rest of the family.   I dont <br/>\nrequire them to come and eat.. I only inform them that the meal is ready.  <br/>\nLots of times they have helped prepare it and set the table ( of thier own <br/>\naccord).   Occasionally someone will be engrossed in a TV show or a game or a <br/>\nphone conversation.  It&#39;s that persons choice to continue thier activity or <br/>\ncome eat with the family.  95% of the time, they opt to come join us.  The <br/>\ntimes they don&#39;t, they may join us later in the meal or miss it all together. <br/>\n  I can tell the disappointment that they missed the meal.  Yeah, they can <br/>\neat leftovers ,but its not the same.   The sound of laughter and discussion <br/>\nis usually  luring enough for them to leave thier activity and come join the <br/>\nfamily.   I would never contend that that eating meals together as a family <br/>\nis the &quot;right way&quot; or &quot;better way&quot;  But, it has  value for our family and <br/>\nthat is what is important to me .  <br/>\n<br/>\nTeresa<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":56403,"nextTopicId":56292}}