{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":192290539,"authorName":"Emile Snyder","from":"Emile Snyder &lt;unschooling@...&gt;","profile":"emiledsnyder","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"book recommendations/reviews?","postDate":"1121888054","msgId":107395,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDExMjE4ODgwNTUuMjk3NDEuMTA4LmNhbWVsQGxvY2FsaG9zdC5sb2NhbGRvbWFpbj4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":107394,"nextInTime":107396,"topicId":107395,"numMessagesInTopic":0,"msgSnippet":"Hi all, I like to chew ideas over a lot before swallowing, and reading stuff that stretches my thinking about things helps me immeasurably.  If anyone here has","messageBody":"<div id=\"ygrps-yiv-1533869689\">Hi all,<br/>\n<br/>\nI like to chew ideas over a lot before swallowing, and reading stuff<br/>\nthat stretches my thinking about things helps me immeasurably.  If<br/>\nanyone here has had their eyes opened in any new and exciting ways by<br/>\nbooks they&#39;ve read in regards to parenting/education/relating to people,<br/>\nI would appreciate pointers from them.<br/>\n<br/>\nI&#39;ll go first ;)<br/>\n<br/>\n&quot;Our Babies, Ourselves&quot; by Meredith Small<br/>\nWhen my wife and I were burning through our midwife&#39;s library during her<br/>\npregnancy we borrowed and read &quot;The Continuum Concept.&quot;  I was<br/>\nfascinated, but almost constantly irritated by what felt like<br/>\nunsupported leaps of inference and much Freudian baggage.  In googling<br/>\naround we came across OBO and got it from the library.  It&#39;s written<br/>\nfrom an anthropology/socio-biology perspective, and explores<br/>\ninfant/toddler care across cultures.  I spent lots of time feeling<br/>\nannoyed by it, but it made me consider all sorts of stuff that I hadn&#39;t<br/>\nthought of before, and had a huge long term impact on the range of<br/>\noptions we could see in how to relate to our child.<br/>\n<br/>\n&quot;Child&#39;s Work&quot; by Nancy Wallace<br/>\nI read this a few years before my wife and I were even thinking about<br/>\nhaving children.  At the time it felt fairly radical to me, although<br/>\nafter reading this list for awhile it might feel pretty &quot;school at<br/>\nhome&quot;ish.  Although I did OK from an academic perspective I never<br/>\nenjoyed or felt safe in school.  Reading the Wallace&#39;s account of doing<br/>\nit differently got me to really consider, for the first time in my life,<br/>\nhow one might get away from the structural problems built into our<br/>\nconcept of school.  It brought up lots of strong emotions from my time<br/>\nin school, and got me crying many times reading it and seeing for the<br/>\nfirst time practical solutions to the pain that school was causing for<br/>\nsomeones child.<br/>\n<br/>\n&quot;Punished by Rewards&quot; by Alfie Kohn<br/>\nI think something on this list made me look up Alfie Kohn, and after<br/>\nreading a few of the articles on his website I got this book from the<br/>\nlibrary.  It&#39;s too long, both in just using too many words to say most<br/>\nthings, and in repeating itself alot in different sections, but has been<br/>\ngreat to read regardless.  As I mentioned in another post recently, it&#39;s<br/>\nmostly a critique of behaviorist inspired methods of interacting with<br/>\npeople, with the focus on the problems with positive reinforcement<br/>\n(since punishment is just too easy a target?)  He cites *lots* of<br/>\nresearch in this, and I haven&#39;t gotten down to reading any of it yet,<br/>\nalthough I would like to.  It&#39;s helped me think about how to structure<br/>\nresponses to friends/family that are more skeptical of the more<br/>\nnon-traditional directions we want to go as parents.<br/>\n<br/>\n&quot;Dumbing us Down&quot; by John Gatto<br/>\nI also read this when I was closer to being in the school system than<br/>\nthe parent of someone in it.  Gatto strikes me as a bit strident at<br/>\ntimes, but it also helped me to see the more &quot;medium is the message&quot;<br/>\nproblem with school at a time when I was waffling more about it.<br/>\nReading Gatto is sort of like reading the works of a religious convert;<br/>\nhe spent so much time as a &quot;model&quot; teacher, and clearly now looks back<br/>\non it with shame and horror.<br/>\n<br/>\n&quot;No Greater Joy&quot; newsletter by the Pearls<br/>\nMany months ago, when the Pearls were going to be giving a seminar in<br/>\nEugene Oregon, I saw a post by someone asking for advice with strategies<br/>\nfor making their displeasure known.  (The Pearls advocate *extremely*<br/>\ncontrolling and conservative parenting from a rigid religious<br/>\nperspective, lots of spanking and guilt and molding of blank slates.)  I<br/>\nfound their website while looking for more info, and saw that you can<br/>\nsubscribe to the newsletter for free.  It&#39;s been a disturbing and<br/>\nenlightening sort of &quot;how the other half lives&quot; view (although I kind of<br/>\nworry what our mail carrier will think of us!)  What&#39;s been hardest for<br/>\nme is seeing how clearly the people writing for it are motivated by the<br/>\ndesire to do the right thing for their children.  Don&#39;t get it if you<br/>\nhave high blood pressure ;)<br/>\n<br/>\n&quot;Finite and Infinite Games&quot; by James Carse<br/>\nI liked this one better when I was younger; I just re-read it and it<br/>\nseems like it has lots more holes in it&#39;s reasoning and is more reliant<br/>\non cute/clever turns of phrase than when I read it the first time.  It&#39;s<br/>\nnot really about education or parenting except insofar as it&#39;s sort of<br/>\nall about intrinsic vs. extrinsic motivation, power dynamics, and why<br/>\nand how one chooses to live life.  But it is kinda fun, and might give<br/>\nyou a new way to look at things.<br/>\n<br/>\nI&#39;ve seen people recommend &quot;How To Talk So Kids Will Listen & Listen So<br/>\nKids Will Talk&quot; and &quot;Siblings Without Rivalry&quot; on the list before.  Any<br/>\ncomments on what made you like them?  Other book/author recommendations?<br/>\n<br/>\nThanks,<br/>\n-emile</div>","specialLinks":[]}],"prevTopicId":107394,"nextTopicId":107365}}