{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":30,"messages":[{"userId":157863786,"authorName":"Kay Alina","from":"&quot;Kay Alina&quot; &lt;angelsguard@...&gt;","profile":"angelsguardalways","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] help","postDate":"1082949368","msgId":19466,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNzYwMWM0MmIzYyRkMTZlYWNlMCQxYTkxZmVhOUBkZWZhdWx0Mjc1NThtMj4=","referencesHeader":"PDE0Ni4yN2JkNjQyMC4yZGJiY2U2ZEBhb2wuY29tPg=="},"prevInTopic":19439,"nextInTopic":0,"prevInTime":19465,"nextInTime":19467,"topicId":19329,"numMessagesInTopic":0,"msgSnippet":"I just want to say I was using that term only in regard to a yardstick for myself.  I am guilty of spewing senseless drivel on occasion.  I do not know anyone","messageBody":"<div id=\"ygrps-yiv-901822084\">I just want to say I was using that term only in regard to a yardstick for myself.  I am guilty of spewing senseless drivel on occasion.  I do not know anyone on this board well enough yet to accuse them of such.  I however know myself very well.  I babble and forget the point I was trying to make.  Believe me, once I have been here for awhile you will see how much senseless drivel I am capable of.  <br/>\nKay<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:tuckervill2@...\">tuckervill2@...</a> <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a> <br/>\n  Sent: Saturday, April 24, 2004 7:06 AM<br/>\n  Subject: Re: [AlwaysLearning] help<br/>\n<br/>\n<br/>\n  In a message dated 4/23/2004 4:09:02 PM Central Standard Time, <br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:angelsguard@...\">angelsguard@...</a> writes:<br/>\n  I had a feeling when you were qualifying the feedback be helpful you<br/>\n  were just asking others to not waste their breath on sesneless drivel. <br/>\n<br/>\n  ~~~<br/>\n<br/>\n  I guess senseless drivel is in the eye of the beholder.<br/>\n<br/>\n  Tuck<br/>\n<br/>\n<br/>\n  [Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n------------------------------------------------------------------------------<br/>\n  Yahoo! Groups Links<br/>\n<br/>\n    a.. To visit your group on the web, go to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/AlwaysLearning/\">http://groups.yahoo.com/group/AlwaysLearning/</a><br/>\n      <br/>\n    b.. To unsubscribe from this group, send an email to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning-unsubscribe@yahoogroups.com\">AlwaysLearning-unsubscribe@yahoogroups.com</a><br/>\n      <br/>\n    c.. Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":154422553,"authorName":"Krisula Moyer","from":"&quot;Krisula Moyer&quot; &lt;krisulam@...&gt;","profile":"krisulaula","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: help","postDate":"1082828245","msgId":19439,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PElORU5MQU5QUENKSEFJUE9NRklPQUVFTUNGQUEua3Jpc3VsYW1AdmVyaXpvbi5uZXQ+","inReplyToHeader":"PDEwODI4MTgyOTEuNDAyLjgzNjYyLm0xMkB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":19434,"nextInTopic":19466,"prevInTime":19438,"nextInTime":19440,"topicId":19329,"numMessagesInTopic":0,"msgSnippet":"Date: Fri, 23 Apr 2004 20:15:59 -0700 From: Nadine  Subject: Re: Re: help I quietly and happily took in all of the helpful advice that I ","messageBody":"<div id=\"ygrps-yiv-1410615108\">Date: Fri, 23 Apr 2004 20:15:59 -0700<br/>\n   From: Nadine &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:nadmo@...\">nadmo@...</a>&gt;<br/>\nSubject: Re: Re: help<br/>\n<br/>\n  I quietly and happily took in all of the &quot;helpful&quot; advice that I<br/>\nreceived, and by helpful, I&#39;ll say it again, I meant not mean. When I<br/>\nfelt people were sending stuff that really missed the point of my<br/>\nletter and my plea, I felt the need to defend/explain myself. ...<br/>\nHi Nadine,<br/>\nI&#39;ve been away a lot and busy this month so I&#39;m just catching up now with<br/>\nthe list.  I read your original post and the last couple of days&#39; but I<br/>\nmissed most of what came between the two (except, of course what&#39;s been<br/>\nquoted).  I&#39;m not sure this will help but your first post tugged at my heart<br/>\nand I wanted to share my son&#39;s experience.<br/>\nMy ds10 is a great kid with lots of interesting and wonderful qualities.  He<br/>\nis also intense and has often needed some calming down and negotiating the<br/>\ntrials of everyday life.<br/>\nMy son is fortunate to have a whole group of friends whom he loves.<br/>\nAlthough he did attend Sunday school, played on baseball and soccer teams,<br/>\nand went to karate for a while, close friendships didn&#39;t develop for him in<br/>\nthese places.  The place he found people patient enough to get to know him<br/>\nand appreciate his many fine qualities was at park day.  I am not suggesting<br/>\nthere is anything magical about the park but I do think there are a few<br/>\nthings, which made it possible for him to blossom there.<br/>\nFirst, the unschooling nature of our group ensured that many (not all)<br/>\nparents are patient and sympathetic towards children who are experiencing<br/>\nintense emotions.  This left me free to try and help him get his needs met<br/>\nwithout feeling self conscious or having the need to explain to everyone why<br/>\nI let this big guy cry on my lap if he wanted to.  The kids, maybe b/c they<br/>\nwere raised in respectful homes themselves, are also, by and large, patient<br/>\nand sympathetic.  Kids are expected to let everyone play at our group.  I<br/>\nremember at one point thinking our loud that the other kids didn&#39;t want to<br/>\nlet my son play with them and wondering what I could do to help him fit in.<br/>\nThat same day, without embarrassing or demeaning anyone, another mom got the<br/>\nkids together and gave them a pep talk about the kind of group we all wanted<br/>\nto be a part of.  The kids &quot;got it&quot; and encouraged the few who were<br/>\nuncomfortable with Trayton to give him another try.  This came up<br/>\nbeautifully one day when, on the way home from park day, Tray explained to<br/>\nme how a new kid was trying to convince the others to ditch him and his<br/>\nfriends stood up to the boy and said &quot;We like Trayton.  He has good ideas. &quot;<br/>\nThey explained to the new boy that they wouldn&#39;t be mean to Trayton and<br/>\nthough they wanted the boy to play, he would have to be nice to everyone.<br/>\nThese kids were ages 8 to 13 at the time.  I was way impressed.<br/>\nThe second thing that I think has contributed to our success is time.  Park<br/>\nday lasts a good 6 - 8 hours.  Longer in summer when we stay past dark and<br/>\nhave a camp fire. We hardly ever miss it.   As time has passed, we have also<br/>\ngotten together with these same families outside the park.  DD and I attend<br/>\nkarate together with other homeschooling families and, while he doesn&#39;t wish<br/>\nto attend the class, Trayton loves to come along to have uninterrupted time<br/>\nwith the other homeschoolers who hang out at the studio.  Several families<br/>\ngo to &quot;dollar taco night &quot; together almost every week and recently we<br/>\nconvinced several of our gang to join a paks&rec chess class with us so the<br/>\nboys could do that together (they came even though most don&#39;t live in our<br/>\ntown and have to drive a ways.)   Your opportunities, and your sons<br/>\ninterests will look different from ours but finding a way to allow loads of<br/>\nunstructured low key time for them to just &#39;be&#39; seems key.<br/>\nLast is something I&#39;ve struggled with, and that is the balance between not<br/>\nenough and too much involvement from me.  At first, I was on guard, worrying<br/>\nthat someone would be mean to him or that he would offend them somehow.  But<br/>\nI tried to resist over involvement.  I advised him on matters when he came<br/>\nto me, but tried to let him go work out himself how to fit in.  Giving too<br/>\nmuch advice sometimes undermines confidence and of course the ways he came<br/>\nup with to relate were much more genuine than if I had helped.  That is not<br/>\nto say that I don&#39;t quietly let him know if I sense he is doing something<br/>\nthat makes people uncomfortable.  Mostly, my involvement has been in<br/>\ngenuinely liking and getting to know his terrific friends myself, getting<br/>\ntogether with their parents who (surprise!) I also enjoy, and trying to<br/>\nengineer opportunities for them to be together.<br/>\nSome of you might remember I recently wrote this list for advice on helping<br/>\nTrayton out of a case of the blahs.  Partly through responses here, I was<br/>\nable to figure out that he had been missing some of this time with his<br/>\nfriends and craved more.  We focused on that for a while and he&#39;s soooo much<br/>\nbetter.  Anyway, I know this is long but I cannot express to you the<br/>\ngratitude I feel towards Trayton&#39;s friends and their awesome parents and I<br/>\nwanted you to know, Nadine, that three years ago I would not have expected<br/>\nthis.  He was such a loner (and not by choice).  I hope you find some of<br/>\nthis helpful or hopeful on your own and your son&#39;s journey.<br/>\nGod bless,<br/>\nKrisula</div>","specialLinks":[]},{"userId":163750020,"authorName":"tuckervill2@aol.com","from":"tuckervill2@...","profile":"tuckervill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] help","postDate":"1082815597","msgId":19434,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0Ni4yN2JkNjQyMC4yZGJiY2U2ZEBhb2wuY29tPg=="},"prevInTopic":19433,"nextInTopic":19439,"prevInTime":19433,"nextInTime":19435,"topicId":19329,"numMessagesInTopic":0,"msgSnippet":"In a message dated 4/23/2004 4:09:02 PM Central Standard Time, angelsguard@sbcglobal.net writes: I had a feeling when you were qualifying the feedback be","messageBody":"<div id=\"ygrps-yiv-208865228\">In a message dated 4/23/2004 4:09:02 PM Central Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:angelsguard@...\">angelsguard@...</a> writes:<br/>\nI had a feeling when you were qualifying the feedback be helpful you<br/>\nwere just asking others to not waste their breath on sesneless drivel. <br/>\n<br/>\n~~~<br/>\n<br/>\nI guess senseless drivel is in the eye of the beholder.<br/>\n<br/>\nTuck<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":163750020,"authorName":"tuckervill2@aol.com","from":"tuckervill2@...","profile":"tuckervill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] help","postDate":"1082815479","msgId":19433,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFlYi4xZTkwMDgwOC4yZGJiY2RmN0Bhb2wuY29tPg=="},"prevInTopic":19431,"nextInTopic":19434,"prevInTime":19432,"nextInTime":19434,"topicId":19329,"numMessagesInTopic":0,"msgSnippet":"In a message dated 4/23/2004 4:08:41 PM Central Standard Time, nadmo@adelphia.net writes: My son has a lot of unique qualities that others may find unpleasant","messageBody":"<div id=\"ygrps-yiv-2115812688\">In a message dated 4/23/2004 4:08:41 PM Central Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:nadmo@...\">nadmo@...</a> writes:<br/>\nMy son has a <br/>\nlot of unique qualities that others may find unpleasant or undesirable <br/>\nor too intense, so sometimes (and I&#39;m probably wrong to do it, but I do <br/>\nget desperate) I will try to help &quot;win over&quot; a child who seems like a <br/>\ncompatible friend for him who may not give him the time of day if I was <br/>\nnot there to smooth things over.<br/>\n<br/>\n~~~<br/>\n<br/>\nI don&#39;t know what kind of qualities you are talking about here.  But could <br/>\nsome of them just be behaviors instead, which could be muted or stopped, when <br/>\nthe possibility of meeting new friends is there?  <br/>\n<br/>\nI have 3 sons, two of which are grown.  Over the years, at different times of <br/>\neach of their lives, I have helped them *not* to do one thing or another that <br/>\nmost folks might find annoying or off-putting.  I&#39;m thinking of something <br/>\nlike repeating phrases over and over, or being silly on first meeting.  Two of my <br/>\nsons went through a phase where they would plant (usually unwanted) kisses on <br/>\ntheir friend&#39;s cheeks.  Not little kids...they were about 8 or 9 at the time. <br/>\n After a while that can be annoying to the friend.  There are a million <br/>\nlittle things like that which kids pick up or decide to do and these kinds of <br/>\nBEHAVIORS can be noticed and helped to go on their merry way.<br/>\n<br/>\nOne of my sons has Tourette Syndrome, and even he controls some of his more <br/>\noff-putting tics when he finds it necessary.<br/>\n<br/>\nNot all of our kids&#39; quirks and actions can be explained away by &quot;that&#39;s just <br/>\nwho he *is*&quot; with a sigh and a shrug of the shoulders.  If a kid needs to get <br/>\nalong in the world, it&#39;s right to help him find a way to be more friend-like.<br/>\n<br/>\nI hope this is a helpful suggestion.<br/>\n<br/>\nTuck<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":157270430,"authorName":"Barbara Chase","from":"Barbara Chase &lt;barb@...&gt;","profile":"bc_avn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: help","postDate":"1082790790","msgId":19431,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PHAwNjAxMDI3YmJjYWZiZTM2OTM2OEBbMTAuMjQuMTc5LjIxOF0+","inReplyToHeader":"PEI1QzMxRUEyLTk1OUQtMTFEOC1CREJFLTAwMzA2NTY4ODE1NEBhZGVscGhpYS5uZXQ+","referencesHeader":"PGM2Y2I5bit2anY2QGVHcm91cHMuY29tPiA8QjVDMzFFQTItOTU5RC0xMUQ4LUJEQkUtMDAzMDY1Njg4MTU0QGFkZWxwaGlhLm5ldD4="},"prevInTopic":19429,"nextInTopic":19433,"prevInTime":19430,"nextInTime":19432,"topicId":19329,"numMessagesInTopic":0,"msgSnippet":"... Nadine, Consider this possibility... no one on this list has posted anything to you or about you that has been mean, or mean spirited.  Consider instead","messageBody":"<div id=\"ygrps-yiv-651570955\"><blockquote><span title=\"ireply\">&gt;I just don&#39;t get why, after I have explained the *actual* meaning of<br/>\n&gt;that plea how it still can be seen as offensive.<br/>\n<br/>\n </span></blockquote>Nadine,<br/>\n<br/>\nConsider this possibility... no one on this list has posted anything to you<br/>\nor about you that has been mean, or mean spirited.  Consider instead that<br/>\neach and every post has been from each person&#39;s heart, with compassion and<br/>\ngrace, trying to help you as best they can.  This is a very valid<br/>\npossibility.  At the same time, you also had some strong emotional feelings<br/>\ncome up when you read these emails, and your feelings are valid.  But I<br/>\ndon&#39;t believe that anyone tried to make you have these feelings.  I really<br/>\ndo believe that everyone here offers their best from their heart, even if<br/>\nthey use a lot of words to do so ;-)<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I would not automatically assume that she/he saw me as a mean person<br/>\n&gt;and take offense to that plea.<br/>\n<br/>\n </span></blockquote>I like the idea of taking what you wrote in your most recent email (quoted<br/>\nabove) and turning it around just a little bit.... I don&#39;t automatically<br/>\nassume that the person writing the email is being mean, so I won&#39;t take<br/>\noffense.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;When I felt people were sending stuff that really missed the point of my<br/>\n&gt;letter and my plea, I felt the need to defend/explain myself.<br/>\n<br/>\n </span></blockquote>Some folks have suggested that what works really well is to take what fits<br/>\nand feels right, and then just leave the rest.  I have found the &quot;leave the<br/>\nrest&quot; advice to be really helpful.  But even so, over time on this list I<br/>\nhave found that what once didn&#39;t feel right to me slowly starts to feel<br/>\nvery right.  Strange how things can change like that.<br/>\n<br/>\nAlso, if you felt that some emails missed your point or didn&#39;t really offer<br/>\nyou the advice you were seeking but other emails did give you some ideas...<br/>\nthen perhaps (IMHO) you don&#39;t need to defend/explain yourself.  If you<br/>\ndidn&#39;t get one iota from anyone, then maybe a second email w/ different<br/>\nwording would help.  It&#39;s nearly impossible to defend/explain w/ email,<br/>\nhard enough in real life!!<br/>\n<br/>\n<br/>\nNamaste<br/>\n--bc--</div>","specialLinks":[]},{"userId":99944316,"authorName":"Nancy Wooton","from":"Nancy Wooton &lt;ikonstitcher@...&gt;","profile":"ikonstitcher","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] help","postDate":"1082782328","msgId":19429,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJDQUY0MDg4LjNDMjBEJWlrb25zdGl0Y2hlckBjb3gubmV0Pg==","inReplyToHeader":"PDkyRDY4Rjc0LTk0RUEtMTFEOC05Qzc0LTAwMzA2NTY4ODE1NEBhZGVscGhpYS5uZXQ+"},"prevInTopic":19424,"nextInTopic":19431,"prevInTime":19428,"nextInTime":19430,"topicId":19329,"numMessagesInTopic":0,"msgSnippet":"... I m employed at a therapeutic horseback riding program.  I work mostly with the horses, training and exercising them so they ll be ready for lessons.  A ","messageBody":"<div id=\"ygrps-yiv-297499798\">on 4/22/04 10:53 PM, Nadine at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:nadmo@...\">nadmo@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Did you really think it would be helpful<br/>\n&gt; to me to shout at me with boldface type? (&quot;And how will WE really know<br/>\n&gt; what is useful, not knowing your son?&quot;)  Did you feel you were truly<br/>\n&gt; being helpful when you wrote that sentence?<br/>\n<br/>\n </span></blockquote>I&#39;m employed at a therapeutic horseback riding program.  I work mostly with<br/>\nthe horses, training and exercising them so they&#39;ll be ready for lessons.  A<br/>\nfew months ago, I had the privilege of watching GaWaNi Pony Boy, a Native<br/>\nAmerican horse trainer, give several sessions at a seminar.  Afterward, he<br/>\nwas available for questions.  Very often, he began his response with &quot;I<br/>\ncan&#39;t answer that question without seeing the horse.&quot;  He would refuse to<br/>\ntry to answer specific questions about specific horses, because he simply<br/>\ncouldn&#39;t.  He wouldn&#39;t try to guess; he&#39;d simply repeat, &quot;I can&#39;t answer<br/>\nthat.&quot;  Not &quot;won&#39;t.&quot;  Just &quot;can&#39;t.&quot;<br/>\n<br/>\nI appreciated his honesty, and the fact that, by refusing to answer specific<br/>\nquestions, I had to go back to the horse, think it through myself, and find<br/>\na way to solve the problems.  It&#39;s the most helpful thing he could possibly<br/>\ndo, and the most truthful.<br/>\n<br/>\nNancy</div>","specialLinks":[]},{"userId":182902428,"authorName":"Nadine","from":"Nadine &lt;nadmo@...&gt;","profile":"ilovetarotalot","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: help","postDate":"1082776559","msgId":19424,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI1QzMxRUEyLTk1OUQtMTFEOC1CREJFLTAwMzA2NTY4ODE1NEBhZGVscGhpYS5uZXQ+","inReplyToHeader":"PGM2Y2I5bit2anY2QGVHcm91cHMuY29tPg==","referencesHeader":"PGM2Y2I5bit2anY2QGVHcm91cHMuY29tPg=="},"prevInTopic":19406,"nextInTopic":19429,"prevInTime":19423,"nextInTime":19425,"topicId":19329,"numMessagesInTopic":0,"msgSnippet":"I quietly and happily took in all of the helpful advice that I received, and by helpful, I ll say it again, I meant not mean. When I felt people were sending","messageBody":"<div id=\"ygrps-yiv-1856730679\">I quietly and happily took in all of the &quot;helpful&quot; advice that I <br/>\nreceived, and by helpful, I&#39;ll say it again, I meant not mean. When I <br/>\nfelt people were sending stuff that really missed the point of my <br/>\nletter and my plea, I felt the need to defend/explain myself. When <br/>\npeople use all capitals on line or thru e-mails, it is meant as a <br/>\nliteral shout, so yes, I took offense to that.  If someone can only <br/>\nhelp another by hurting her or him first, is that actually *helping*? <br/>\nMy plea for only helpful suggestions,  *meaning no mean-spirited <br/>\ne-mails* may have been poorly worded and thus easily misconstrued, but <br/>\nit was no reason to shout at me.  A simple, &quot;What did you mean by this, <br/>\nbecause it&#39;s offending me&quot; would have sufficed and I would have <br/>\napologized and I would have explained what I meant. I just don&#39;t get <br/>\nwhy, after I have explained the *actual* meaning of that plea how it <br/>\nstill can be seen as offensive. If someone walked up to me on the <br/>\nstreet and asked for directions, and then said &quot;Please don&#39;t be mean to <br/>\nme I&#39;m having a rough day, I just need to know where to go...&quot; I would <br/>\nimmediately understand that she or he had most likely had a few painful <br/>\nrun ins with other people that day and I would feel badly for her/his <br/>\npain, because I&#39;ve been there too.  I would not automatically assume <br/>\nthat she/he saw me as a mean person and take offense to that plea. I <br/>\nreally would just figure that sometimes this world can be so cruel and <br/>\nhurtful, and that this particular stranger was feeling pretty raw from <br/>\nall of that senseless meanness to which we have all grown accustomed.   <br/>\nI would give her/him the directions as gently and warmly as I could, <br/>\nand I&#39;d wish that the world could be a nicer place, that we could all <br/>\njust be nicer to each other.  Does this make sense? Does it help to <br/>\nsomehow remove the offense of my poorly worded plea? Never once did I <br/>\nsay useless. But I can see how it can be interpreted that way. Since I <br/>\nhave explained what I actually meant, can we please stop feeling <br/>\noffended by it?  ( I&#39;m not being sarcastic)<br/>\n<blockquote><span title=\"qreply\"> On Apr 23, 2004, at 5:10 PM, ecsamhill wrote:<br/>\n<br/>\n&gt; **Please, send only helpful suggestions. **<br/>\n&gt;<br/>\n&gt;  To the original poster:� You may be surprised that the sentence above<br/>\n&gt;  created some friction and some firm language about what this list can<br/>\n&gt;  and cannot do.� I&#39;ll share my insight with you and you can consider<br/>\n&gt;  whether it makes sense to you.<br/>\n&gt;<br/>\n&gt;  My thought is that &quot;please, send only helpful suggestions&quot; is somewhat<br/>\n&gt;  equivalent to saying &quot;please, send only meaningful presents&quot;.<br/>\n&gt;<br/>\n&gt;  People contribute their time to this list specifically to *help* other<br/>\n&gt;  people.� No one would bother to type in useless or unhelpful<br/>\n&gt;  information.� That is what Ren and Sandra were clarifying in their<br/>\n&gt;  first responses to you.� (Yes, I re-read back to the beginning of the<br/>\n&gt;  thread.)�<br/>\n&gt;<br/>\n&gt;  People tend to offer advice based on their own experience with their<br/>\n&gt;  own children.� We have very limited knowledge of your life and your<br/>\n&gt;  children, so it is natural and unsurprising if we offer some/many<br/>\n&gt;  ideas that don&#39;t fit your life.� There really is no good way to<br/>\n&gt;  prevent that.� So asking for that, for advice that is appropriate for<br/>\n&gt;  you isn&#39;t realistic.�<br/>\n&gt;<br/>\n&gt;  I believe you weren&#39;t intending to be insulting.� Nevertheless, even<br/>\n&gt;  with the word &quot;please&quot; included your phrasing leaned more towards<br/>\n&gt;  &quot;demanding&quot; than &quot;asking&quot;, in my opinion.<br/>\n&gt;<br/>\n&gt;  If you feel that I have misinterpreted the &quot;tone&quot; of your post, then I<br/>\n&gt;  would like you to notice that it is very easy to read the wrong tone<br/>\n&gt;  into someone&#39;s plain text here.� And I would like you to acknowledge<br/>\n&gt;  the possibility that you are misinterpreting Sandra&#39;s tone.� It&#39;s very<br/>\n&gt;  easy to read the wrong emotions into typed text.� Normal clues like<br/>\n&gt;  inflection and facial expression are missing in this medium.<br/>\n&gt;<br/>\n&gt;  In the first responses that you got, people (including me) asked you<br/>\n&gt;  questions to help them be more helpful in their responses to you.<br/>\n&gt;  Instead of answering these questions, you went after Sandra.� I don&#39;t<br/>\n&gt;  think that was the most constructive path.<br/>\n&gt;<br/>\n&gt;  Betsy<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Sponsor<br/>\n&gt;<br/>\n&gt; ADVERTISEMENT<br/>\n&gt; &lt;300x250_uofp_pink_arrows.gif&gt;<br/>\n&gt; &lt;l.gif&gt;<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt; \t� \tTo visit your group on the web, go to:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/AlwaysLearning/\">http://groups.yahoo.com/group/AlwaysLearning/</a><br/>\n&gt; �<br/>\n&gt; \t� \t To unsubscribe from this group, send an email to:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning-unsubscribe@yahoogroups.com\">AlwaysLearning-unsubscribe@yahoogroups.com</a><br/>\n&gt; �<br/>\n&gt; \t� \t Your use of Yahoo! Groups is subject to the Yahoo! Terms of <br/>\n&gt; Service.<br/>\n&gt;<br/>\n&gt;  <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":2300774,"authorName":"ecsamhill","from":"&quot;ecsamhill&quot; &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: help","postDate":"1082765431","msgId":19406,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM2Y2I5bit2anY2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGY0LjNhMGUwZWNjLjJkYjk4ZmVkQGFvbC5jb20+"},"prevInTopic":19404,"nextInTopic":19424,"prevInTime":19405,"nextInTime":19407,"topicId":19329,"numMessagesInTopic":0,"msgSnippet":"**Please, send only helpful suggestions. ** To the original poster:  You may be surprised that the sentence above created some friction and some firm language","messageBody":"<div id=\"ygrps-yiv-775405303\">**Please, send only helpful suggestions. **<br/>\n<br/>\nTo the original poster:  You may be surprised that the sentence above<br/>\ncreated some friction and some firm language about what this list can<br/>\nand cannot do.  I&#39;ll share my insight with you and you can consider<br/>\nwhether it makes sense to you.<br/>\n<br/>\nMy thought is that &quot;please, send only helpful suggestions&quot; is somewhat<br/>\nequivalent to saying &quot;please, send only meaningful presents&quot;.<br/>\n<br/>\nPeople contribute their time to this list specifically to *help* other<br/>\npeople.  No one would bother to type in useless or unhelpful<br/>\ninformation.  That is what Ren and Sandra were clarifying in their<br/>\nfirst responses to you.  (Yes, I re-read back to the beginning of the<br/>\nthread.)  <br/>\n<br/>\nPeople tend to offer advice based on their own experience with their<br/>\nown children.  We have very limited knowledge of your life and your<br/>\nchildren, so it is natural and unsurprising if we offer some/many<br/>\nideas that don&#39;t fit your life.  There really is no good way to<br/>\nprevent that.  So asking for that, for advice that is appropriate for<br/>\nyou isn&#39;t realistic.  <br/>\n<br/>\nI believe you weren&#39;t intending to be insulting.  Nevertheless, even<br/>\nwith the word &quot;please&quot; included your phrasing leaned more towards<br/>\n&quot;demanding&quot; than &quot;asking&quot;, in my opinion.<br/>\n<br/>\nIf you feel that I have misinterpreted the &quot;tone&quot; of your post, then I<br/>\nwould like you to notice that it is very easy to read the wrong tone<br/>\ninto someone&#39;s plain text here.  And I would like you to acknowledge<br/>\nthe possibility that you are misinterpreting Sandra&#39;s tone.  It&#39;s very<br/>\neasy to read the wrong emotions into typed text.  Normal clues like<br/>\ninflection and facial expression are missing in this medium. <br/>\n<br/>\nIn the first responses that you got, people (including me) asked you<br/>\nquestions to help them be more helpful in their responses to you. <br/>\nInstead of answering these questions, you went after Sandra.  I don&#39;t<br/>\nthink that was the most constructive path.<br/>\n<br/>\nBetsy</div>","specialLinks":[]},{"userId":157863786,"authorName":"Kay Alina","from":"&quot;Kay Alina&quot; &lt;angelsguard@...&gt;","profile":"angelsguardalways","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] help","postDate":"1082763043","msgId":19404,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMzEwMWM0Mjk4YSRmZjlhZDdhMCQxYTkxZmVhOUBkZWZhdWx0Mjc1NThtMj4=","referencesHeader":"PDEyZi40MDIwYzJkNy4yZGJhZTY1ZUBhb2wuY29tPg=="},"prevInTopic":19403,"nextInTopic":19406,"prevInTime":19403,"nextInTime":19405,"topicId":19329,"numMessagesInTopic":0,"msgSnippet":"Valid points Sandra.  Which reminds me of a favorite saying.  Evil reigns when good men do nothing.  Yes, I do agree it is important to defend all that we","messageBody":"<div id=\"ygrps-yiv-1047677283\">Valid points Sandra.  Which reminds me of a favorite saying.  Evil reigns when good men do nothing.  Yes, I do agree it is important to defend all that we value.  Unschooling is valuable to me.  I would like it to remain on topic.  The comment about senseless drivel has nothing to do with this board.  I have found only quite captivating conversation here.  Thanks for the food for thought.<br/>\nKay<br/>\n<br/>\n  In a message dated 4/23/04 3:08:53 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:angelsguard@...\">angelsguard@...</a> writes:<br/>\n<br/>\n  &lt;&lt;  I felt<br/>\n<br/>\n  the same way reading those posts and was surprised they were taken in the<br/>\n<br/>\n  context they were to insight such a level of defensiveness.  &gt;&gt;<br/>\n<br/>\n  What were people here defending?<br/>\n  I was defending the fact that this list give a TON of good advice, but we <br/>\n  can&#39;t predict what someone else will think is useful.<br/>\n<br/>\n  I will continue to defend the idea that when people voluntarily give their <br/>\n  time to help other people do something (I&#39;m thinking al-Anon, La Leche League) <br/>\n  others who need that help should remember it&#39;s not something they can get other <br/>\n  places without paying big bucks (if even then) and if you pay real money, the <br/>\n  people will ONLY help you their personally-preferred professional way.<br/>\n<br/>\n  Here someone can get lots of different opinions from people who are actually <br/>\n  unschooling.<br/>\n<br/>\n  -=-I had a feeling when you were qualifying the feedback be helpful you<br/>\n<br/>\n  were just asking others to not waste their breath on sesneless drivel.-=-<br/>\n<br/>\n  If you think the list tends toward senseless drivel, why are you here?<br/>\n<br/>\n  -=-Most people have never been called names -=-<br/>\n<br/>\n  EVERYONE who has been to school has been called names.<br/>\n  (Okay, maybe some people WILL post senseless drivel, but not if we all stick <br/>\n  to the topic of unschooling.)<br/>\n<br/>\n  Sandra<br/>\n<br/>\n        Yahoo! Groups Sponsor <br/>\n              ADVERTISEMENT<br/>\n             <br/>\n       <br/>\n       <br/>\n<br/>\n<br/>\n------------------------------------------------------------------------------<br/>\n  Yahoo! Groups Links<br/>\n<br/>\n    a.. To visit your group on the web, go to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/AlwaysLearning/\">http://groups.yahoo.com/group/AlwaysLearning/</a><br/>\n      <br/>\n    b.. To unsubscribe from this group, send an email to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning-unsubscribe@yahoogroups.com\">AlwaysLearning-unsubscribe@yahoogroups.com</a><br/>\n      <br/>\n    c.. Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":157863786,"authorName":"Kay Alina","from":"&quot;Kay Alina&quot; &lt;angelsguard@...&gt;","profile":"angelsguardalways","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] help","postDate":"1082761391","msgId":19403,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMGQwMWM0Mjk4NyQyNjlkZGMyMCQxYTkxZmVhOUBkZWZhdWx0Mjc1NThtMj4=","referencesHeader":"PDIwMDQwNDIyLjEzMjEzNy44Nzk0LjQ0MjUyMkB3ZWJtYWlsMDUubnljLnVudGQuY29tPiA8QkRDMTNEMjItOTRENS0xMUQ4LTlDNzQtMDAzMDY1Njg4MTU0QGFkZWxwaGlhLm5ldD4gPHAwNjAxMDI3NGJjYWU2MDI5MzMwMkBbMTAuMjQuMTc5LjIxOF0+IDw0MDg5MTZDRi43MDUwMzA0QGZyb250aWVybmV0Lm5ldD4gPDYuMC4wLjIyLjAuMjAwNDA0MjMwODUxNDguMDMwZjRlYzBAc2hhd21haWwuZ3Yuc2hhd2NhYmxlLm5ldD4gPDlGMUVGRUYwLTk1NTMtMTFEOC05Qzc0LTAwMzA2NTY4ODE1NEBhZGVscGhpYS5uZXQ+"},"prevInTopic":19398,"nextInTopic":19404,"prevInTime":19402,"nextInTime":19404,"topicId":19329,"numMessagesInTopic":0,"msgSnippet":"Hi Nadine, It sounds to me your son is a natural artist.  I have been a big fan of cartooning and I still love animation.  I agree wholeheartedly that art is ","messageBody":"<div id=\"ygrps-yiv-734737647\">Hi Nadine,<br/>\nIt sounds to me your son is a natural artist.  I have been a big fan of<br/>\ncartooning and I still love animation.  I agree wholeheartedly that art is<br/>\nabout expression.  How can anyone possibly express what someone else is<br/>\nfeeling.  We can only express what comes from within.  I have heard other<br/>\nartists say the exact same thing and eventually leave art school to pursue<br/>\ncareers as artists.  I laughed over the comment about teaching how to draw<br/>\ntrees.  I know that feeling.  Am I doing enough?  Did I do it, say it right?<br/>\nYes, it probably comes from the yardstick mentality of being raised in a<br/>\npublic school system.  The more I read John Holt the better off I am.  You<br/>\nare doing fine.  You (or nature) seems to have taught your son, still young,<br/>\nwhat many artists do not learn until their college years.  In regard to the<br/>\nother question about convincing your dear husband.  The best cure for us was<br/>\na year in private school and the results of it being nil and lots of money<br/>\nspent.  Now hubby is 100% behind us.  Happy you are a part of always<br/>\nlearning.  May we continue this journey, happy, joyous and free!<br/>\nKay</div>","specialLinks":[]},{"userId":182902428,"authorName":"Nadine","from":"Nadine &lt;nadmo@...&gt;","profile":"ilovetarotalot","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] help","postDate":"1082756446","msgId":19398,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEUxMEU4NzcxLTk1NkUtMTFEOC05Qzc0LTAwMzA2NTY4ODE1NEBhZGVscGhpYS5uZXQ+","inReplyToHeader":"PDFjZC4xZjMxZDA1My4yZGJhZTNkZUBhb2wuY29tPg==","referencesHeader":"PDFjZC4xZjMxZDA1My4yZGJhZTNkZUBhb2wuY29tPg=="},"prevInTopic":19396,"nextInTopic":19403,"prevInTime":19397,"nextInTime":19399,"topicId":19329,"numMessagesInTopic":0,"msgSnippet":"Sandra,hey thanks for the constructive advice. With each new post/reply, I am pulled in a new direction. I still feel my request for only helpful suggestions","messageBody":"<div id=\"ygrps-yiv-1119454449\">Sandra,hey thanks for the constructive advice. With each new <br/>\npost/reply, I am pulled in a new direction. I still feel my request for <br/>\nonly helpful suggestions has been taken the wrong way. And I agree with <br/>\nyou, being in the obviously sensitive and vulnerable state that I am in <br/>\nright now is not a good place to be when asking for help from strangers <br/>\nwho may or may not have a delicate touch when it comes to how they <br/>\nadvise people. I will take the good advice you gave me (maybe a group <br/>\nof our own might be too much right now) and run with it. Thank you, <br/>\nseriously. We are on the same page, I think, as far as kids are <br/>\nconcerned, I just won&#39;t go to you for advice when I&#39;m depressed or <br/>\nextra sensitive. I am sorry I offended you. I am going to try not to <br/>\nanswer every reply from you, and would truly like to erase the <br/>\nslate...unless I&#39;ve been trap-door-ed,then in that case, so <br/>\nlong...Nadine<br/>\n<blockquote><span title=\"qreply\"> On Apr 23, 2004, at 2:25 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;  In a message dated 4/23/04 3:08:19 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:nadmo@...\">nadmo@...</a> writes:<br/>\n&gt;<br/>\n&gt;  &lt;&lt;� He&#39;s a big guy, but he swims<br/>\n&gt;<br/>\n&gt;  like a fish, so for us, the pool was a place where he felt confident<br/>\n&gt;<br/>\n&gt;  and joyous. Are you angry that I used the phrase &quot;find friends&quot; ? &gt;&gt;<br/>\n&gt;<br/>\n&gt;  #1, I&#39;m not angry about anything except direct insults to the people <br/>\n&gt; on this<br/>\n&gt;  list and the disruption of what is usually a peaceful place.<br/>\n&gt;<br/>\n&gt;  #2, my husband has been big since he was a baby, he swims, he studied <br/>\n&gt; diving<br/>\n&gt;  techniques for a while, he weighs over 300 lbs<br/>\n&gt;<br/>\n&gt;  -=- My son has a lot of unique qualities that others may find <br/>\n&gt; unpleasant or<br/>\n&gt;  undesirable<br/>\n&gt;<br/>\n&gt;  or too intense-=-<br/>\n&gt;<br/>\n&gt;  So you&#39;re saying it&#39;s not just his weight?<br/>\n&gt;<br/>\n&gt;  -=-(&quot;And how will WE really know<br/>\n&gt;<br/>\n&gt;  what is useful, not knowing your son?&quot;)� Did you feel you were truly<br/>\n&gt;<br/>\n&gt;  being helpful when you wrote that sentence? -=-<br/>\n&gt;<br/>\n&gt;  Yes.<br/>\n&gt;  The best we could do is guess based on what we know of similar <br/>\n&gt; situations,<br/>\n&gt;  but you had already indicated that you only wanted ideas YOU thought <br/>\n&gt; were<br/>\n&gt;  useful, and there is no earthly way for us to have known what you <br/>\n&gt; would think was<br/>\n&gt;  useful.<br/>\n&gt;<br/>\n&gt;  -=- Please try to<br/>\n&gt;<br/>\n&gt;  keep in mind that when someone asks a bunch of strangers for help, <br/>\n&gt; that<br/>\n&gt;<br/>\n&gt;  most likely� she (or he) is really desperate and struggling, because<br/>\n&gt;<br/>\n&gt;  most people don&#39;t go around asking strangers for help. -=-<br/>\n&gt;<br/>\n&gt;  People ask experienced unschoolers for help every single day all over <br/>\n&gt; the<br/>\n&gt;  place, and lots of them accept the help graciously (even though some <br/>\n&gt; of it didn&#39;t<br/>\n&gt;  apply and their lives are changed for the better.<br/>\n&gt;<br/>\n&gt;  Most of them don&#39;t thrash all kinds of ways and make the people on <br/>\n&gt; the list<br/>\n&gt;  feel bad.� Some do.<br/>\n&gt;<br/>\n&gt;  Here are what some people have written about another list,<br/>\n&gt;  unschoolingdiscussion, and about unschooling.com:<br/>\n&gt;<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/list\">http://sandradodd.com/list</a><br/>\n&gt;<br/>\n&gt;  Some of them started off defensive and resistent and they could have <br/>\n&gt; gone<br/>\n&gt;  away in a huff, but they were glad they didn&#39;t.<br/>\n&gt;<br/>\n&gt;  -=Can you open your heart and try to understand how easily hurt one&#39;s<br/>\n&gt;<br/>\n&gt;  feelings would be in that situation?-=-<br/>\n&gt;<br/>\n&gt;  All of us had a time when we didn&#39;t know much about homeschooling and <br/>\n&gt; we all<br/>\n&gt;  asked for help.<br/>\n&gt;<br/>\n&gt;  There will be many things in the future I&#39;ll need help with.� There <br/>\n&gt; were many<br/>\n&gt;  in the past.�� Part of being an adult is keeping SOME of our feelings <br/>\n&gt; in.��<br/>\n&gt;  We&#39;ve told Holly sometimes &quot;It&#39;s okay not to say everything you <br/>\n&gt; think.&quot;<br/>\n&gt;<br/>\n&gt;  It&#39;s an important trick to remember.<br/>\n&gt;<br/>\n&gt;  Sandra<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt; \t� \tTo visit your group on the web, go to:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/AlwaysLearning/\">http://groups.yahoo.com/group/AlwaysLearning/</a><br/>\n&gt; �<br/>\n&gt; \t� \t To unsubscribe from this group, send an email to:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning-unsubscribe@yahoogroups.com\">AlwaysLearning-unsubscribe@yahoogroups.com</a><br/>\n&gt; �<br/>\n&gt; \t� \t Your use of Yahoo! Groups is subject to the Yahoo! Terms of <br/>\n&gt; Service.<br/>\n&gt;<br/>\n&gt;  <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] help","postDate":"1082756190","msgId":19396,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyZi40MDIwYzJkNy4yZGJhZTY1ZUBhb2wuY29tPg=="},"prevInTopic":19395,"nextInTopic":19398,"prevInTime":19395,"nextInTime":19397,"topicId":19329,"numMessagesInTopic":0,"msgSnippet":"In a message dated 4/23/04 3:08:53 PM, angelsguard@sbcglobal.net writes: ","messageBody":"<div id=\"ygrps-yiv-658519285\">In a message dated 4/23/04 3:08:53 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:angelsguard@...\">angelsguard@...</a> writes:<br/>\n<br/>\n&lt;&lt;  I felt<br/>\n<br/>\nthe same way reading those posts and was surprised they were taken in the<br/>\n<br/>\ncontext they were to insight such a level of defensiveness.  &gt;&gt;<br/>\n<br/>\nWhat were people here defending?<br/>\nI was defending the fact that this list give a TON of good advice, but we <br/>\ncan&#39;t predict what someone else will think is useful.<br/>\n<br/>\nI will continue to defend the idea that when people voluntarily give their <br/>\ntime to help other people do something (I&#39;m thinking al-Anon, La Leche League) <br/>\nothers who need that help should remember it&#39;s not something they can get other <br/>\nplaces without paying big bucks (if even then) and if you pay real money, the <br/>\npeople will ONLY help you their personally-preferred professional way.<br/>\n<br/>\nHere someone can get lots of different opinions from people who are actually <br/>\nunschooling.<br/>\n<br/>\n-=-I had a feeling when you were qualifying the feedback be helpful you<br/>\n<br/>\nwere just asking others to not waste their breath on sesneless drivel.-=-<br/>\n<br/>\nIf you think the list tends toward senseless drivel, why are you here?<br/>\n<br/>\n-=-Most people have never been called names -=-<br/>\n<br/>\nEVERYONE who has been to school has been called names.<br/>\n(Okay, maybe some people WILL post senseless drivel, but not if we all stick <br/>\nto the topic of unschooling.)<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":157863786,"authorName":"Kay Alina","from":"&quot;Kay Alina&quot; &lt;angelsguard@...&gt;","profile":"angelsguardalways","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] help","postDate":"1082755761","msgId":19395,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwZGYwMWM0Mjk3YSQwYWFlNGFjMCQxYTkxZmVhOUBkZWZhdWx0Mjc1NThtMj4=","referencesHeader":"PGU0LjRjMWQ2ODhkLjJkYmFhZGFmQGFvbC5jb20+"},"prevInTopic":19394,"nextInTopic":19396,"prevInTime":19394,"nextInTime":19396,"topicId":19329,"numMessagesInTopic":0,"msgSnippet":"Sandra you were a child of an alcoholic.  Try to remember what it felt like when you were small and scared and did not know what to do.  You could not control","messageBody":"<div id=\"ygrps-yiv-1522261690\">Sandra you were a child of an alcoholic.  Try to remember what it felt like when you were small and scared and did not know what to do.  You could not control the situation in the way you are able to now.  You could not control the emotions.  Telling someone to buck up and snap out of it and justify everything you have said or believed rather than simply accept the fact that you have your way and they have theirs is self centered to say the least.  Let it go.  Stop justifying and attacking someone else for standing up for themselves.  You do have a harsh way of putting things some time.  Some people do.  Does not mean you do not have something valuable to add and share.  You have shared your vulnerability here and I have not heard anyone mention to you to get over it or snap out it or so what?  This is a place people come to for support.  You are right now reminding me very much of both of my out of control alcoholic parents and the endless rationalizing they did to continue their abusive behavior.  If someone has asked you to stop a behavior what is the attachment to continuing it?<br/>\nJust my 2 cents,<br/>\nKay<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a> <br/>\n  Sent: Friday, April 23, 2004 10:34 AM<br/>\n  Subject: Re: [AlwaysLearning] help<br/>\n<br/>\n<br/>\n<br/>\n  &lt;&lt; I am <br/>\n<br/>\n  just a mom, at her wit&#39;s end, hoping that someone out there has an <br/>\n<br/>\n  &quot;answer&quot; that I haven&#39;t already heard. &gt;&gt;<br/>\n<br/>\n  Had you read everything that people had sent?  Maybe read it again.<br/>\n<br/>\n  Taking your son to the pool and the park seems not to have been a good idea.  <br/>\n  Several people said that independently.  But they DID recommend other places <br/>\n  he might like better.<br/>\n<br/>\n  -=- please don&#39;t inundate me with &quot;you&#39;re too <br/>\n<br/>\n  sensitive!!&quot; e-mails, I know I just couldn&#39;t handle it.-=-<br/>\n<br/>\n  Did you want ideas or did you want massage?<br/>\n<br/>\n  Massage doesn&#39;t work at ALL well by email, but advice works pretty well if <br/>\n  you&#39;re able to accept it.<br/>\n<br/>\n  Do you really want to help your son or not?<br/>\n<br/>\n  You got LOTS of good ideas, free.  A counsellor wouldn&#39;t have known those <br/>\n  things we sent.  We&#39;re mothers of boys, and we know.<br/>\n<br/>\n  -=- I really tried to do my best to choose <br/>\n<br/>\n  words that would not draw unnecessary meanness from strangers.-=-<br/>\n<br/>\n  The negativity in your post isn&#39;t helpful to this list at all.  If you came <br/>\n  here and created a situation in which those who were willing to donate their <br/>\n  time and energy to give you ideas you could have begun to use right away, <br/>\n  yesterday, could only fail to meet your criteria, you&#39;re not using this list for the <br/>\n  purpose it&#39;s intended.<br/>\n<br/>\n  -=-neither did the blow by blow <br/>\n<br/>\n  correcting of my letter from Sandra-=-<br/>\n<br/>\n  Bullshit.<br/>\n<br/>\n  I wasn&#39;t correcting your letter, I was telling you that if you don&#39;t KNOW <br/>\n  what you need, so you can&#39;t judge what&#39;s helpful or not.  If you DO know what you <br/>\n  need, you don&#39;t need to ask us.<br/>\n<br/>\n  Read the suggestions we made if you want to help your son.<br/>\n  If you want your son to change to make your life easier. go to a counsellor <br/>\n  and get help for your own insecurities.  I&#39;m dead serious.  Your second post <br/>\n  sacter flaws or the way I worded my letter.-=-<br/>\n<br/>\n  I don&#39;t think anyone knew or thought anything about your character.<br/>\n  The only wording of your letter anyone commented on was where you suggested <br/>\n  in advance we wouldn&#39;t be helpful.  Then you came back and made sure we would <br/>\n  think we were not only not helpful but that we had been MEAN to you.<br/>\n<br/>\n  Take some deep breaths, think about your child&#39;s happy future, and maybe you <br/>\n  can cheer yourself up by working on cheering him up.  You could both be <br/>\n  happier.<br/>\n<br/>\n  Or you could spend a lot of energy being mad at all of us for our free <br/>\n  advice, and make your life unhappier, and meanwhile what is he doing?  Wondering <br/>\n  whether his mom is there for him?<br/>\n<br/>\n  Buck up.  Snap out of it.  Breathe deeply and smile.<br/>\n<br/>\n  Sandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n------------------------------------------------------------------------------<br/>\n  Yahoo! Groups Links<br/>\n<br/>\n    a.. To visit your group on the web, go to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/AlwaysLearning/\">http://groups.yahoo.com/group/AlwaysLearning/</a><br/>\n      <br/>\n    b.. To unsubscribe from this group, send an email to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning-unsubscribe@yahoogroups.com\">AlwaysLearning-unsubscribe@yahoogroups.com</a><br/>\n      <br/>\n    c.. Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] help","postDate":"1082755550","msgId":19394,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFjZC4xZjMxZDA1My4yZGJhZTNkZUBhb2wuY29tPg=="},"prevInTopic":19393,"nextInTopic":19395,"prevInTime":19393,"nextInTime":19395,"topicId":19329,"numMessagesInTopic":0,"msgSnippet":"In a message dated 4/23/04 3:08:19 PM, nadmo@adelphia.net writes: ","messageBody":"<div id=\"ygrps-yiv-559228743\">In a message dated 4/23/04 3:08:19 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:nadmo@...\">nadmo@...</a> writes:<br/>\n<br/>\n&lt;&lt;  He&#39;s a big guy, but he swims <br/>\n<br/>\nlike a fish, so for us, the pool was a place where he felt confident <br/>\n<br/>\nand joyous. Are you angry that I used the phrase &quot;find friends&quot; ? &gt;&gt;<br/>\n<br/>\n#1, I&#39;m not angry about anything except direct insults to the people on this <br/>\nlist and the disruption of what is usually a peaceful place.<br/>\n<br/>\n#2, my husband has been big since he was a baby, he swims, he studied diving <br/>\ntechniques for a while, he weighs over 300 lbs<br/>\n<br/>\n-=- My son has a lot of unique qualities that others may find unpleasant or <br/>\nundesirable <br/>\n<br/>\nor too intense-=-<br/>\n<br/>\nSo you&#39;re saying it&#39;s not just his weight?<br/>\n<br/>\n-=-(&quot;And how will WE really know <br/>\n<br/>\nwhat is useful, not knowing your son?&quot;)  Did you feel you were truly <br/>\n<br/>\nbeing helpful when you wrote that sentence? -=-<br/>\n<br/>\nYes.<br/>\nThe best we could do is guess based on what we know of similar situations, <br/>\nbut you had already indicated that you only wanted ideas YOU thought were <br/>\nuseful, and there is no earthly way for us to have known what you would think was <br/>\nuseful.<br/>\n<br/>\n-=- Please try to <br/>\n<br/>\nkeep in mind that when someone asks a bunch of strangers for help, that <br/>\n<br/>\nmost likely  she (or he) is really desperate and struggling, because <br/>\n<br/>\nmost people don&#39;t go around asking strangers for help. -=-<br/>\n<br/>\nPeople ask experienced unschoolers for help every single day all over the <br/>\nplace, and lots of them accept the help graciously (even though some of it didn&#39;t <br/>\napply and their lives are changed for the better.<br/>\n<br/>\nMost of them don&#39;t thrash all kinds of ways and make the people on the list <br/>\nfeel bad.  Some do.<br/>\n<br/>\nHere are what some people have written about another list, <br/>\nunschoolingdiscussion, and about unschooling.com:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/list\">http://sandradodd.com/list</a><br/>\n<br/>\nSome of them started off defensive and resistent and they could have gone <br/>\naway in a huff, but they were glad they didn&#39;t.<br/>\n<br/>\n-=Can you open your heart and try to understand how easily hurt one&#39;s <br/>\n<br/>\nfeelings would be in that situation?-=-<br/>\n<br/>\nAll of us had a time when we didn&#39;t know much about homeschooling and we all <br/>\nasked for help.<br/>\n<br/>\nThere will be many things in the future I&#39;ll need help with.  There were many <br/>\nin the past.   Part of being an adult is keeping SOME of our feelings in.   <br/>\nWe&#39;ve told Holly sometimes &quot;It&#39;s okay not to say everything you think.&quot;<br/>\n<br/>\nIt&#39;s an important trick to remember.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] help","postDate":"1082754465","msgId":19393,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg3LmExNjQwMjQuMmRiYWRmYTFAYW9sLmNvbT4="},"prevInTopic":19392,"nextInTopic":19394,"prevInTime":19392,"nextInTime":19394,"topicId":19329,"numMessagesInTopic":0,"msgSnippet":"In a message dated 4/23/04 2:38:36 PM, nadmo@adelphia.net writes:  That s quite","messageBody":"<div id=\"ygrps-yiv-1924666357\">In a message dated 4/23/04 2:38:36 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:nadmo@...\">nadmo@...</a> writes:<br/>\n<br/>\n&lt;&lt;  I think you are bright enough to <br/>\n<br/>\nsee the negativity in your reply to me &gt;&gt;<br/>\n<br/>\nThat&#39;s quite an insult, &quot;I think you are bright enough to...&quot;<br/>\n<br/>\n&lt;&lt;But don&#39;t deny that you are <br/>\n<br/>\nsometimes a bit too harsh&gt;&gt;<br/>\n<br/>\nOiling those trapdoor hinges.<br/>\nHoping the post gets to being about the child, or unschooling, and doesn&#39;t <br/>\ncontinue to be about the poster and her delicate feelings.<br/>\n<br/>\n-=-I am still pretty shocked that that request offended as much as it did. <br/>\n<br/>\nThis has been a very educational experience for me as far as my word <br/>\n<br/>\nchoice is concerned.-=-<br/>\n<br/>\nUnlike school&#39;s practice writing, this is REAL writing.  You have a choice <br/>\nwhether to write; nobody&#39;s making you.  You have a choice whether to revise your <br/>\nwriting; there&#39;s no deadline to &quot;turn it in.&quot;  You have a choice whether to <br/>\npost; nobody required it.  You have a choice whether to read the responses; <br/>\nnobody tests you later.<br/>\n<br/>\nChoice is the important element here.  It WAS your word choice.<br/>\n<br/>\nNobody was trying to antagonize you by answering your questions.  <br/>\nThe antagonism comes in the implied insult that people here have it in them <br/>\nto have grudges against you, or to try to hurt your feelings, or that they  <br/>\nmight knowingly give you advice that wouldn&#39;t help you a bit.<br/>\n<br/>\nIf you KNOW you&#39;re overly sensitive to the point that you tell people not to <br/>\ntell you you are, then be careful what you choose to share in public.  <br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] help","postDate":"1082754240","msgId":19392,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI0LjU0NWE3Y2RiLjJkYmFkZWMwQGFvbC5jb20+"},"prevInTopic":19389,"nextInTopic":19393,"prevInTime":19391,"nextInTime":19393,"topicId":19329,"numMessagesInTopic":0,"msgSnippet":"In a message dated 4/23/04 2:39:34 PM, nadmo@adelphia.net writes: ","messageBody":"<div id=\"ygrps-yiv-1859361434\">In a message dated 4/23/04 2:39:34 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:nadmo@...\">nadmo@...</a> writes:<br/>\n<br/>\n&lt;&lt; I <br/>\n<br/>\nam currently thinking up some kind of card-gaming type club or group <br/>\n<br/>\nand will post it at his school (the charter school that we do <br/>\n<br/>\nindependent study through).  &gt;&gt;<br/>\n<br/>\nFinding an existing club might be less pressure on you and him both.  If you <br/>\nwant to start something, maybe having a one-shot deal (a card playing party, <br/>\nfour hour session with snacks and cards) would let you know if it seems worth <br/>\ncontinuing.   <br/>\n<br/>\nAnd limiting to the kids at the charter school will be a subgroup of kids he <br/>\nhas already had a chance to be with.  Finding clubs outside that would be more <br/>\nexpansive.<br/>\n<br/>\nYou could try both.<br/>\n<br/>\n-=-the <br/>\n<br/>\nunschooling vs.schooling stuff came up yesterday for him in art class. -=-<br/>\n<br/>\nHaving a child in classes and in a charter school prevents a lot of the <br/>\nbenefits you could have if you really unschooled.<br/>\n<br/>\n-=-so why <br/>\n<br/>\nshould I force him to do art that he isn&#39;t into? -=-<br/>\n<br/>\nYou shouldn&#39;t, you&#39;re right.<br/>\n<br/>\n-=-As I worried and <br/>\n<br/>\nthought about my failings as a homeschooliing mom last night (&quot;I should <br/>\n<br/>\nhave taught him how to draw trees, and how to shadow etc&quot;),-=-<br/>\n<br/>\nThe worry needs to start to go the other way if you want to get to <br/>\nunschooling.  The less you taught him the better, and the less you deliver him to others <br/>\nto be coerced and forced, the better.<br/>\n<br/>\n-=-I am wondering if all of the trouble and the endless meetings <br/>\n<br/>\nand the awful labels that we have endured in our school experience <br/>\n<br/>\ncould have been avoided if I had heard of unschooling when he was 4. -=-<br/>\n<br/>\nThe sooner that stops, the sooner it&#39;s over.<br/>\n<br/>\n-=-But how do I sell this to <br/>\n<br/>\nmy husband who is all about structure and schedules and all of that <br/>\n<br/>\njazz? How do I stop thinking the &quot;old way&quot; myself? -=-<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/deschooling\">http://sandradodd.com/deschooling</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/checklists\">http://sandradodd.com/checklists</a><br/>\n<br/>\nThat first one has links to several other people&#39;s writings on deschooling.<br/>\n<br/>\nAt www.unschooling.com there are discussions you should be able to find at <br/>\nthe message boards about dealing with reluctant spouses.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":157863786,"authorName":"Kay Alina","from":"&quot;Kay Alina&quot; &lt;angelsguard@...&gt;","profile":"angelsguardalways","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] help","postDate":"1082753377","msgId":19389,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNzAwMWM0Mjk3NCQ3ZTE4NjY5MCQxYTkxZmVhOUBkZWZhdWx0Mjc1NThtMj4=","referencesHeader":"PDIwMDQwNDIyLjEzMjEzNy44Nzk0LjQ0MjUyMkB3ZWJtYWlsMDUubnljLnVudGQuY29tPiA8QkRDMTNEMjItOTRENS0xMUQ4LTlDNzQtMDAzMDY1Njg4MTU0QGFkZWxwaGlhLm5ldD4="},"prevInTopic":19388,"nextInTopic":19392,"prevInTime":19388,"nextInTime":19390,"topicId":19329,"numMessagesInTopic":0,"msgSnippet":"Hi Nadine, I just wanted to say I hear you and I respect your vulnerability.  I felt the same way reading those posts and was surprised they were taken in the ","messageBody":"<div id=\"ygrps-yiv-1402499041\">Hi Nadine,<br/>\nI just wanted to say I hear you and I respect your vulnerability.  I felt<br/>\nthe same way reading those posts and was surprised they were taken in the<br/>\ncontext they were to insight such a level of defensiveness.  One thing I<br/>\nalways tell myself if someone is being a jerk and targeting their stuff at<br/>\nme is &quot;It is not about you, it is about them&quot;  I wish I had replied sooner.<br/>\nI have had weight issues on and off although not in childhood.  I know how<br/>\nvicious American society is toward the overweight.  I also know how<br/>\nheartless some people can be when you show them your underbelly.  I am new<br/>\nto the board and it is true that I sense some people hear &quot;barking&quot;.  I have<br/>\nalso picked up some great advice just lurking.  I commend you for reaching<br/>\nout and sharing your vulnerability and seeking help and guidance and answers<br/>\nto help your son.  I also want to thank you for being a champion to yourself<br/>\nby posting this letter and calling attention to the lack of compassion some<br/>\nhave.  I had a feeling when you were qualifying the feedback be helpful you<br/>\nwere just asking others to not waste their breath on sesneless drivel.  Most<br/>\npeople have not a clue about the pain involved in being overweight.  Most<br/>\npeople have never been called names for simply being a different size and<br/>\nmost people do not know what it is to be judged for being different.  Some<br/>\npeople have sticks up their butts and feel offended if you ask for direct<br/>\nfeedback.  Psychologists especially.  Every one here is just a human being.<br/>\nI hope you find a place of forgiveness for fools and continue being the<br/>\nspecial mom and person you are.  Give your son a hug for me.  He is lucky to<br/>\nhave you.<br/>\nKay</div>","specialLinks":[]},{"userId":182902428,"authorName":"Nadine","from":"Nadine &lt;nadmo@...&gt;","profile":"ilovetarotalot","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] help","postDate":"1082745803","msgId":19387,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5Mzk2NUY0LTk1NTYtMTFEOC05Qzc0LTAwMzA2NTY4ODE1NEBhZGVscGhpYS5uZXQ+","inReplyToHeader":"PGU0LjRjMWQ2ODhkLjJkYmFhZGFmQGFvbC5jb20+","referencesHeader":"PGU0LjRjMWQ2ODhkLjJkYmFhZGFmQGFvbC5jb20+"},"prevInTopic":19382,"nextInTopic":19388,"prevInTime":19386,"nextInTime":19388,"topicId":19329,"numMessagesInTopic":0,"msgSnippet":"Wow, Sandra you are one tough lady. Don t quite understand where your antagonism is coming from as far as I m concerned. I did read all of the posts to me, and","messageBody":"<div id=\"ygrps-yiv-1937221483\">Wow, Sandra you are one tough lady. Don&#39;t quite understand where your <br/>\nantagonism is coming from as far as I&#39;m concerned. I did read all of <br/>\nthe posts to me, and I did appreciate the help I was given. I chose not <br/>\nto write anything (until your post to me) but I did appreciate the <br/>\nhelp. I felt the need to defend myself after your post and Ren&#39;s <br/>\nbecause I felt my request was being taken the wrong way. Maybe you <br/>\ncould read the reply I just sent in today, to get a different <br/>\nimpression of me and or my first post. I think you are bright enough to <br/>\nsee the negativity in your reply to me, and surely you can&#39;t deny the <br/>\nantagonism of today&#39;s reply (even swearing). So, if being a sharp <br/>\ntongued woman who says it like it is, even to the point of being a bit <br/>\nharsh, is what you are all about, okay. But don&#39;t deny that you are <br/>\nsometimes a bit too harsh, and don&#39;t get so upset when someone who has <br/>\nbeen at the receiving end of your words gets a little upset. I agree <br/>\nabout advice working well through e-mail, and advice (free of nastiness <br/>\nand verbal barbs) is what I&#39;m looking for. I was getting past last <br/>\nnights hurt feelings until today&#39;s new, even meaner e-mail from you. I <br/>\nf you don&#39;t like being called mean, then stop acting mean. Nadine<br/>\n<blockquote><span title=\"qreply\"> On Apr 23, 2004, at 10:34 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;  &lt;&lt; I am<br/>\n&gt;<br/>\n&gt;  just a mom, at her wit&#39;s end, hoping that someone out there has an<br/>\n&gt;<br/>\n&gt;  &quot;answer&quot; that I haven&#39;t already heard. &gt;&gt;<br/>\n&gt;<br/>\n&gt;  Had you read everything that people had sent?� Maybe read it again.<br/>\n&gt;<br/>\n&gt;  Taking your son to the pool and the park seems not to have been a <br/>\n&gt; good idea.�<br/>\n&gt;  Several people said that independently.� But they DID recommend other <br/>\n&gt; places<br/>\n&gt;  he might like better.<br/>\n&gt;<br/>\n&gt;  -=- please don&#39;t inundate me with &quot;you&#39;re too<br/>\n&gt;<br/>\n&gt;  sensitive!!&quot; e-mails, I know I just couldn&#39;t handle it.-=-<br/>\n&gt;<br/>\n&gt;  Did you want ideas or did you want massage?<br/>\n&gt;<br/>\n&gt;  Massage doesn&#39;t work at ALL well by email, but advice works pretty <br/>\n&gt; well if<br/>\n&gt;  you&#39;re able to accept it.<br/>\n&gt;<br/>\n&gt;  Do you really want to help your son or not?<br/>\n&gt;<br/>\n&gt;  You got LOTS of good ideas, free.� A counsellor wouldn&#39;t have known <br/>\n&gt; those<br/>\n&gt;  things we sent.� We&#39;re mothers of boys, and we know.<br/>\n&gt;<br/>\n&gt;  -=- I really tried to do my best to choose<br/>\n&gt;<br/>\n&gt;  words that would not draw unnecessary meanness from strangers.-=-<br/>\n&gt;<br/>\n&gt;  The negativity in your post isn&#39;t helpful to this list at all.� If <br/>\n&gt; you came<br/>\n&gt;  here and created a situation in which those who were willing to <br/>\n&gt; donate their<br/>\n&gt;  time and energy to give you ideas you could have begun to use right <br/>\n&gt; away,<br/>\n&gt;  yesterday, could only fail to meet your criteria, you&#39;re not using <br/>\n&gt; this list for the<br/>\n&gt;  purpose it&#39;s intended.<br/>\n&gt;<br/>\n&gt;  -=-neither did the blow by blow<br/>\n&gt;<br/>\n&gt;  correcting of my letter from Sandra-=-<br/>\n&gt;<br/>\n&gt;  Bullshit.<br/>\n&gt;<br/>\n&gt;  I wasn&#39;t correcting your letter, I was telling you that if you don&#39;t <br/>\n&gt; KNOW<br/>\n&gt;  what you need, so you can&#39;t judge what&#39;s helpful or not.� If you DO <br/>\n&gt; know what you<br/>\n&gt;  need, you don&#39;t need to ask us.<br/>\n&gt;<br/>\n&gt;  Read the suggestions we made if you want to help your son.<br/>\n&gt;  If you want your son to change to make your life easier. go to a <br/>\n&gt; counsellor<br/>\n&gt;  and get help for your own insecurities.� I&#39;m dead serious.� Your <br/>\n&gt; second post<br/>\n&gt;  sacter flaws or the way I worded my letter.-=-<br/>\n&gt;<br/>\n&gt;  I don&#39;t think anyone knew or thought anything about your character.<br/>\n&gt;  The only wording of your letter anyone commented on was where you <br/>\n&gt; suggested<br/>\n&gt;  in advance we wouldn&#39;t be helpful.� Then you came back and made sure <br/>\n&gt; we would<br/>\n&gt;  think we were not only not helpful but that we had been MEAN to you.<br/>\n&gt;<br/>\n&gt;  Take some deep breaths, think about your child&#39;s happy future, and <br/>\n&gt; maybe you<br/>\n&gt;  can cheer yourself up by working on cheering him up.� You could both <br/>\n&gt; be<br/>\n&gt;  happier.<br/>\n&gt;<br/>\n&gt;  Or you could spend a lot of energy being mad at all of us for our free<br/>\n&gt;  advice, and make your life unhappier, and meanwhile what is he <br/>\n&gt; doing?� Wondering<br/>\n&gt;  whether his mom is there for him?<br/>\n&gt;<br/>\n&gt;  Buck up.� Snap out of it.� Breathe deeply and smile.<br/>\n&gt;<br/>\n&gt;  Sandra<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt; \t� \tTo visit your group on the web, go to:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/AlwaysLearning/\">http://groups.yahoo.com/group/AlwaysLearning/</a><br/>\n&gt; �<br/>\n&gt; \t� \t To unsubscribe from this group, send an email to:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning-unsubscribe@yahoogroups.com\">AlwaysLearning-unsubscribe@yahoogroups.com</a><br/>\n&gt; �<br/>\n&gt; \t� \t Your use of Yahoo! Groups is subject to the Yahoo! Terms of <br/>\n&gt; Service.<br/>\n&gt;<br/>\n&gt;  <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":182902428,"authorName":"Nadine","from":"Nadine &lt;nadmo@...&gt;","profile":"ilovetarotalot","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] help","postDate":"1082744739","msgId":19388,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlGMUVGRUYwLTk1NTMtMTFEOC05Qzc0LTAwMzA2NTY4ODE1NEBhZGVscGhpYS5uZXQ+","inReplyToHeader":"PDYuMC4wLjIyLjAuMjAwNDA0MjMwODUxNDguMDMwZjRlYzBAc2hhd21haWwuZ3Yuc2hhd2NhYmxlLm5ldD4=","referencesHeader":"PDIwMDQwNDIyLjEzMjEzNy44Nzk0LjQ0MjUyMkB3ZWJtYWlsMDUubnljLnVudGQuY29tPiA8QkRDMTNEMjItOTRENS0xMUQ4LTlDNzQtMDAzMDY1Njg4MTU0QGFkZWxwaGlhLm5ldD4gPHAwNjAxMDI3NGJjYWU2MDI5MzMwMkBbMTAuMjQuMTc5LjIxOF0+IDw0MDg5MTZDRi43MDUwMzA0QGZyb250aWVybmV0Lm5ldD4gPDYuMC4wLjIyLjAuMjAwNDA0MjMwODUxNDguMDMwZjRlYzBAc2hhd21haWwuZ3Yuc2hhd2NhYmxlLm5ldD4="},"prevInTopic":19387,"nextInTopic":19389,"prevInTime":19387,"nextInTime":19389,"topicId":19329,"numMessagesInTopic":0,"msgSnippet":"Thanks for the heartfelt reply. I m not always like this (depressed, desperate etc). I recently had a fairly life threatening bout with amoebic dysentery and","messageBody":"<div id=\"ygrps-yiv-1178552042\">Thanks for the heartfelt reply. I&#39;m not always like this (depressed, <br/>\ndesperate etc). I recently had a fairly life threatening bout with <br/>\namoebic dysentery and am presently in one of those needing to &quot;fix&quot; <br/>\neverything that feels wrong in my life type of modes. And the <br/>\ndepression is part of the healing process.  I was also hearing a lot <br/>\nfrom my son (during Spring Break) that he needed more friends and that <br/>\nhe was feeling lonely. That is hard to hear and not try to do something <br/>\nabout it. The thing about my request for only helpful suggestions <br/>\nreally just stems from the feeling of almost having died and needing to <br/>\nprotect myself from barbs that I can&#39;t possibly deflect right now. It <br/>\nwas not meant to offend but I guess it was a sort of wall, as someone <br/>\ndescribed it in a reply. But it was a wall I felt I needed to erect <br/>\nbecause of this raw state I am in at the moment.  Does this make sense? <br/>\nI am still pretty shocked that that request offended as much as it did. <br/>\nThis has been a very educational experience for me as far as my word <br/>\nchoice is concerned. My son had a nice time at school with his friend <br/>\nand his friend came over for a few hours after, so that feels good. I <br/>\nam currently thinking up some kind of card-gaming type club or group <br/>\nand will post it at his school (the charter school that we do <br/>\nindependent study through). All of this friendship stuff aside, the <br/>\nunschooling vs.schooling stuff came up yesterday for him in art class. <br/>\nThe kids were being taught a lesson involving black paper and chalky <br/>\npastels and shadow etc. My son balked at the idea of being told exactly <br/>\nhow to express himself artistically and the teacher was able to coerce <br/>\nhim to try...long story short, he did the lesson, drew the picture. All <br/>\nof the kids were required to draw the exact same picture, of trees and <br/>\nthe sun creating shadows. When the teacher relayed the story to me of <br/>\nmy son&#39;s difficulties in art class, her words were &quot;he wanted to do <br/>\nwhat he wanted to do&quot; but of course he bent to what she wanted him to <br/>\ndo in the end. I am really new to all of this unschooling stuff, and I <br/>\ndon&#39;t for a minute profess to know anything other than the fact that <br/>\nforcing just feels wrong. For this issue to come up on our first day <br/>\nback at school just feels like a sign from the universe. I at first was <br/>\ntorn, feeling like I should have introduced that type of art to him so <br/>\nthat he would feel more confident in his skills when doing it in front <br/>\nof his peers. On he other hand, his artistic interests are more geared <br/>\nto Manga cartooning(it&#39;s a type of Japanese graphic novel), so why <br/>\nshould I force him to do art that he isn&#39;t into? As I worried and <br/>\nthought about my failings as a homeschooliing mom last night (&quot;I should <br/>\nhave taught him how to draw trees, and how to shadow etc&quot;), I went in <br/>\nto say goodnight to him and asked him about that art lesson and whether <br/>\nhe liked it. He said &quot;yes, but isn&#39;t art supposed to be about my <br/>\nartistic expression and not about drawing what someone else tells me to <br/>\ndraw?&quot; I am wondering if all of the trouble and the endless meetings <br/>\nand the awful labels that we have endured in our school experience <br/>\ncould have been avoided if I had heard of unschooling when he was 4. He <br/>\nseems like the poster child for unschooling. But how do I sell this to <br/>\nmy husband who is all about structure and schedules and all of that <br/>\njazz? How do I stop thinking the &quot;old way&quot; myself? This concept seems <br/>\nso natural and loving but I can&#39;t stop thinking (or is it worrying) <br/>\nabout making sure he masters this concept or that concept or whatever <br/>\nit is that the schools say he needs to know how to do and when...I am <br/>\ngrateful for any advice or help any of you can send my way, and I&#39;l do <br/>\nmy best to not let my feelings get hurt.<br/>\nNadine<br/>\n<blockquote><span title=\"qreply\"> On Apr 23, 2004, at 8:54 AM, Tia Leschke wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;  &gt;It&#39;s true<br/>\n&gt;  &gt;that a first impression is a lot when meeting new people...so help <br/>\n&gt; him<br/>\n&gt;  &gt;learn to make that first impression great, by exuding peaceful joy in<br/>\n&gt;  &gt;life and open acceptance of other people.� People, when meeting <br/>\n&gt; others<br/>\n&gt;  &gt;for the first time read body signals much more easily than they do <br/>\n&gt; with<br/>\n&gt;  &gt;people they know, because� it&#39;s someone new.<br/>\n&gt;<br/>\n&gt;  This is true. When my daughter was younger, she was very shy. But the <br/>\n&gt; other<br/>\n&gt;  kids she met thought she was unfriendly. She didn&#39;t realize it until <br/>\n&gt; much<br/>\n&gt;  later. I think she was &quot;expecting&quot; to be rejected, especially after <br/>\n&gt; the<br/>\n&gt;  first few times, and that expectation showed up on her face as, <br/>\n&gt; &quot;Don&#39;t come<br/>\n&gt;  near me because I don&#39;t want to be hurt.&quot;<br/>\n&gt;  Don&#39;t know if this is the case with the boy in question.<br/>\n&gt;  Tia<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt; \t� \tTo visit your group on the web, go to:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/AlwaysLearning/\">http://groups.yahoo.com/group/AlwaysLearning/</a><br/>\n&gt; �<br/>\n&gt; \t� \t To unsubscribe from this group, send an email to:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning-unsubscribe@yahoogroups.com\">AlwaysLearning-unsubscribe@yahoogroups.com</a><br/>\n&gt; �<br/>\n&gt; \t� \t Your use of Yahoo! Groups is subject to the Yahoo! Terms of <br/>\n&gt; Service.<br/>\n&gt;<br/>\n&gt;  <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] help","postDate":"1082741679","msgId":19373,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU0LjRjMWQ2ODhkLjJkYmFhZGFmQGFvbC5jb20+"},"prevInTopic":19367,"nextInTopic":19382,"prevInTime":19372,"nextInTime":19374,"topicId":19329,"numMessagesInTopic":0,"msgSnippet":" Had you read everything that people had","messageBody":"<div id=\"ygrps-yiv-1300825426\">&lt;&lt; I am <br/>\n<br/>\njust a mom, at her wit&#39;s end, hoping that someone out there has an <br/>\n<br/>\n&quot;answer&quot; that I haven&#39;t already heard. &gt;&gt;<br/>\n<br/>\nHad you read everything that people had sent?  Maybe read it again.<br/>\n<br/>\nTaking your son to the pool and the park seems not to have been a good idea.  <br/>\nSeveral people said that independently.  But they DID recommend other places <br/>\nhe might like better.<br/>\n<br/>\n-=- please don&#39;t inundate me with &quot;you&#39;re too <br/>\n<br/>\nsensitive!!&quot; e-mails, I know I just couldn&#39;t handle it.-=-<br/>\n<br/>\nDid you want ideas or did you want massage?<br/>\n<br/>\nMassage doesn&#39;t work at ALL well by email, but advice works pretty well if <br/>\nyou&#39;re able to accept it.<br/>\n<br/>\nDo you really want to help your son or not?<br/>\n<br/>\nYou got LOTS of good ideas, free.  A counsellor wouldn&#39;t have known those <br/>\nthings we sent.  We&#39;re mothers of boys, and we know.<br/>\n<br/>\n-=- I really tried to do my best to choose <br/>\n<br/>\nwords that would not draw unnecessary meanness from strangers.-=-<br/>\n<br/>\nThe negativity in your post isn&#39;t helpful to this list at all.  If you came <br/>\nhere and created a situation in which those who were willing to donate their <br/>\ntime and energy to give you ideas you could have begun to use right away, <br/>\nyesterday, could only fail to meet your criteria, you&#39;re not using this list for the <br/>\npurpose it&#39;s intended.<br/>\n<br/>\n-=-neither did the blow by blow <br/>\n<br/>\ncorrecting of my letter from Sandra-=-<br/>\n<br/>\nBullshit.<br/>\n<br/>\nI wasn&#39;t correcting your letter, I was telling you that if you don&#39;t KNOW <br/>\nwhat you need, so you can&#39;t judge what&#39;s helpful or not.  If you DO know what you <br/>\nneed, you don&#39;t need to ask us.<br/>\n<br/>\nRead the suggestions we made if you want to help your son.<br/>\nIf you want your son to change to make your life easier. go to a counsellor <br/>\nand get help for your own insecurities.  I&#39;m dead serious.  Your second post <br/>\nsacter flaws or the way I worded my letter.-=-<br/>\n<br/>\nI don&#39;t think anyone knew or thought anything about your character.<br/>\nThe only wording of your letter anyone commented on was where you suggested <br/>\nin advance we wouldn&#39;t be helpful.  Then you came back and made sure we would <br/>\nthink we were not only not helpful but that we had been MEAN to you.<br/>\n<br/>\nTake some deep breaths, think about your child&#39;s happy future, and maybe you <br/>\ncan cheer yourself up by working on cheering him up.  You could both be <br/>\nhappier.<br/>\n<br/>\nOr you could spend a lot of energy being mad at all of us for our free <br/>\nadvice, and make your life unhappier, and meanwhile what is he doing?  Wondering <br/>\nwhether his mom is there for him?<br/>\n<br/>\nBuck up.  Snap out of it.  Breathe deeply and smile.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":129679134,"authorName":"Tia Leschke","from":"Tia Leschke &lt;leschke@...&gt;","profile":"leschke2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] help","postDate":"1082735692","msgId":19367,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYuMC4wLjIyLjAuMjAwNDA0MjMwODUxNDguMDMwZjRlYzBAc2hhd21haWwuZ3Yuc2hhd2NhYmxlLm5ldD4=","inReplyToHeader":"PDQwODkxNkNGLjcwNTAzMDRAZnJvbnRpZXJuZXQubmV0Pg==","referencesHeader":"PDIwMDQwNDIyLjEzMjEzNy44Nzk0LjQ0MjUyMkB3ZWJtYWlsMDUubnljLnVudGQuY29tPiA8QkRDMTNEMjItOTRENS0xMUQ4LTlDNzQtMDAzMDY1Njg4MTU0QGFkZWxwaGlhLm5ldD4gPHAwNjAxMDI3NGJjYWU2MDI5MzMwMkBbMTAuMjQuMTc5LjIxOF0+IDw0MDg5MTZDRi43MDUwMzA0QGZyb250aWVybmV0Lm5ldD4="},"prevInTopic":19357,"nextInTopic":19373,"prevInTime":19366,"nextInTime":19368,"topicId":19329,"numMessagesInTopic":0,"msgSnippet":"... This is true. When my daughter was younger, she was very shy. But the other kids she met thought she was unfriendly. She didn t realize it until much ","messageBody":"<div id=\"ygrps-yiv-1149958247\"><blockquote><span title=\"ireply\">&gt;It&#39;s true<br/>\n&gt;that a first impression is a lot when meeting new people...so help him<br/>\n&gt;learn to make that first impression great, by exuding peaceful joy in<br/>\n&gt;life and open acceptance of other people.  People, when meeting others<br/>\n&gt;for the first time read body signals much more easily than they do with<br/>\n&gt;people they know, because  it&#39;s someone new.<br/>\n<br/>\n </span></blockquote>This is true. When my daughter was younger, she was very shy. But the other <br/>\nkids she met thought she was unfriendly. She didn&#39;t realize it until much <br/>\nlater. I think she was &quot;expecting&quot; to be rejected, especially after the <br/>\nfirst few times, and that expectation showed up on her face as, &quot;Don&#39;t come <br/>\nnear me because I don&#39;t want to be hurt.&quot;<br/>\nDon&#39;t know if this is the case with the boy in question.<br/>\nTia</div>","specialLinks":[]},{"userId":142809109,"authorName":"badolbilz","from":"badolbilz &lt;ynxn96@...&gt;","profile":"thedollymama2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] help","postDate":"1082726095","msgId":19357,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQwODkxNkNGLjcwNTAzMDRAZnJvbnRpZXJuZXQubmV0Pg==","referencesHeader":"PDIwMDQwNDIyLjEzMjEzNy44Nzk0LjQ0MjUyMkB3ZWJtYWlsMDUubnljLnVudGQuY29tPiA8QkRDMTNEMjItOTRENS0xMUQ4LTlDNzQtMDAzMDY1Njg4MTU0QGFkZWxwaGlhLm5ldD4gPHAwNjAxMDI3NGJjYWU2MDI5MzMwMkBbMTAuMjQuMTc5LjIxOF0+"},"prevInTopic":19356,"nextInTopic":19367,"prevInTime":19356,"nextInTime":19358,"topicId":19329,"numMessagesInTopic":0,"msgSnippet":"Nadine, I agree with Barbara.  You should be actively setting an example for him with yourself because where you can make your own friends, only he can make","messageBody":"<div id=\"ygrps-yiv-1799489951\">Nadine, I agree with Barbara.  You should be actively setting an example <br/>\nfor him with yourself because where you can make your own friends, only <br/>\nhe can make his.  Best friendships are founded on common interests <br/>\nand/or backgrounds.  Look in those places for yourself to have friends <br/>\nand gently encourage him to do the same.  If you feel depressed and <br/>\ndefensive about his weight, how can he not feel the same.  It&#39;s true <br/>\nthat a first impression is a lot when meeting new people...so help him <br/>\nlearn to make that first impression great, by exuding peaceful joy in <br/>\nlife and open acceptance of other people.  People, when meeting others <br/>\nfor the first time read body signals much more easily than they do with <br/>\npeople they know, because  it&#39;s someone new.   So IF your son really <br/>\nwants friends (I said if because some people, like intellectuals who <br/>\nlove to read a lot don&#39;t really need many social outlets) and isn&#39;t just <br/>\nresponding to your need for more social activities, don&#39;t force <br/>\nrelationships on him.  Just work on your own situation and help guide <br/>\nhim to help his own.  Good Luck!    Heidi<br/>\n<br/>\nBarbara Chase wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Honestly, I was just looking for some help.<br/>\n&gt;&gt;    <br/>\n&gt;&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;Nadine,<br/>\n&gt;<br/>\n&gt;I&#39;d like to try to be helpful for you here, but I feel like I&#39;m sort of in<br/>\n&gt;a box with respect to what I can say...  you are asking for help, but it<br/>\n&gt;feels like you are also asking for it to look a certain way.  I think this<br/>\n&gt;is what others are trying to say to you.  I know that when I first read<br/>\n&gt;your message and read the &quot;only helpful suggestions please&quot; my whole body<br/>\n&gt;halted... like I was following along and then all of a sudden I hit a wall.<br/>\n&gt;That&#39;s what I mean when I say I feel like I&#39;m in a box with what I can say.<br/>\n&gt;<br/>\n&gt;When you say that you are used to people saying it&#39;s not about your son&#39;s<br/>\n&gt;weight, is it possible that you can find something useful and helpful in<br/>\n&gt;this?  I&#39;m not suggesting that your intuitions are incorrect... you have<br/>\n&gt;seen the looks of other kids, you have been there and felt and seen the<br/>\n&gt;interchange.  So, in those moments it has been about your son&#39;s weight with<br/>\n&gt;those particular kids.  But in my mind the issue isn&#39;t your son&#39;s weight,<br/>\n&gt;it&#39;s those moments and those kids, and perhaps your expectations (and maybe<br/>\n&gt;his too) that it will be about his weight in future circumstances.<br/>\n&gt;<br/>\n&gt;A thought comes to me that what might be the most helpful thing for your<br/>\n&gt;situation right now might be to focus on what you can do for you.  You say<br/>\n&gt;you are depressed, alone, lacking confidence.  So what will help pick you<br/>\n&gt;up and give you the zing that you need for your life?  This might be<br/>\n&gt;exactly what your son needs too.  I&#39;d be glad to help you brainstorm about<br/>\n&gt;this, and to give you boosts every now and then (I&#39;m not online all that<br/>\n&gt;often, but I usually do end up reading all of the posts and get caught up<br/>\n&gt;every few days.)<br/>\n&gt;<br/>\n&gt;All the best,<br/>\n&gt;--bc--<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":157270430,"authorName":"Barbara Chase","from":"Barbara Chase &lt;barb@...&gt;","profile":"bc_avn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] help","postDate":"1082700464","msgId":19356,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PHAwNjAxMDI3NGJjYWU2MDI5MzMwMkBbMTAuMjQuMTc5LjIxOF0+","inReplyToHeader":"PEJEQzEzRDIyLTk0RDUtMTFEOC05Qzc0LTAwMzA2NTY4ODE1NEBhZGVscGhpYS5uZXQ+","referencesHeader":"PDIwMDQwNDIyLjEzMjEzNy44Nzk0LjQ0MjUyMkB3ZWJtYWlsMDUubnljLnVudGQuY29tPiA8QkRDMTNEMjItOTRENS0xMUQ4LTlDNzQtMDAzMDY1Njg4MTU0QGFkZWxwaGlhLm5ldD4="},"prevInTopic":19355,"nextInTopic":19357,"prevInTime":19355,"nextInTime":19357,"topicId":19329,"numMessagesInTopic":0,"msgSnippet":"... Nadine, I d like to try to be helpful for you here, but I feel like I m sort of in a box with respect to what I can say...  you are asking for help, but it","messageBody":"<div id=\"ygrps-yiv-1847229468\"><blockquote><span title=\"ireply\">&gt;Honestly, I was just looking for some help.<br/>\n<br/>\n<br/>\n </span></blockquote>Nadine,<br/>\n<br/>\nI&#39;d like to try to be helpful for you here, but I feel like I&#39;m sort of in<br/>\na box with respect to what I can say...  you are asking for help, but it<br/>\nfeels like you are also asking for it to look a certain way.  I think this<br/>\nis what others are trying to say to you.  I know that when I first read<br/>\nyour message and read the &quot;only helpful suggestions please&quot; my whole body<br/>\nhalted... like I was following along and then all of a sudden I hit a wall.<br/>\nThat&#39;s what I mean when I say I feel like I&#39;m in a box with what I can say.<br/>\n<br/>\nWhen you say that you are used to people saying it&#39;s not about your son&#39;s<br/>\nweight, is it possible that you can find something useful and helpful in<br/>\nthis?  I&#39;m not suggesting that your intuitions are incorrect... you have<br/>\nseen the looks of other kids, you have been there and felt and seen the<br/>\ninterchange.  So, in those moments it has been about your son&#39;s weight with<br/>\nthose particular kids.  But in my mind the issue isn&#39;t your son&#39;s weight,<br/>\nit&#39;s those moments and those kids, and perhaps your expectations (and maybe<br/>\nhis too) that it will be about his weight in future circumstances.<br/>\n<br/>\nA thought comes to me that what might be the most helpful thing for your<br/>\nsituation right now might be to focus on what you can do for you.  You say<br/>\nyou are depressed, alone, lacking confidence.  So what will help pick you<br/>\nup and give you the zing that you need for your life?  This might be<br/>\nexactly what your son needs too.  I&#39;d be glad to help you brainstorm about<br/>\nthis, and to give you boosts every now and then (I&#39;m not online all that<br/>\noften, but I usually do end up reading all of the posts and get caught up<br/>\nevery few days.)<br/>\n<br/>\nAll the best,<br/>\n--bc--</div>","specialLinks":[]},{"userId":182902428,"authorName":"Nadine","from":"Nadine &lt;nadmo@...&gt;","profile":"ilovetarotalot","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] help","postDate":"1082699621","msgId":19382,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkyRDY4Rjc0LTk0RUEtMTFEOC05Qzc0LTAwMzA2NTY4ODE1NEBhZGVscGhpYS5uZXQ+","inReplyToHeader":"PGY0LjNhMGUwZWNjLjJkYjk4ZmVkQGFvbC5jb20+","referencesHeader":"PGY0LjNhMGUwZWNjLjJkYjk4ZmVkQGFvbC5jb20+"},"prevInTopic":19373,"nextInTopic":19387,"prevInTime":19381,"nextInTime":19383,"topicId":19329,"numMessagesInTopic":0,"msgSnippet":"Sandra, I have to reply to some of the specific things you wrote back at me. First, I was trying to get help and chose to write as short and sweet a letter as","messageBody":"<div id=\"ygrps-yiv-291663150\">Sandra, I have to reply to some of the specific things you wrote back <br/>\nat me. First, I was trying to get help and chose to write as short and <br/>\nsweet a letter as I could. I wasn&#39;t able to include every detail about <br/>\nmy son. The details would fill volumes. He&#39;s a big guy, but he swims <br/>\nlike a fish, so for us, the pool was a place where he felt confident <br/>\nand joyous. Are you angry that I used the phrase &quot;find friends&quot; ? I <br/>\nwrote &quot;find&quot; because that&#39;s how it feels to me sometimes. My son has a <br/>\nlot of unique qualities that others may find unpleasant or undesirable <br/>\nor too intense, so sometimes (and I&#39;m probably wrong to do it, but I do <br/>\nget desperate) I will try to help &quot;win over&quot; a child who seems like a <br/>\ncompatible friend for him who may not give him the time of day if I was <br/>\nnot there to smooth things over. Sometimes the first impression my son <br/>\ngives is not easy for some kids to warmly embrace.  The things my son <br/>\nloves to do are not offered in a neat package in this very tiny town of <br/>\nours, but someone did suggest that we create our own group or club, and <br/>\nthat was a helpful suggestion. Did you really think it would be helpful <br/>\nto me to shout at me with boldface type? (&quot;And how will WE really know <br/>\nwhat is useful, not knowing your son?&quot;)  Did you feel you were truly <br/>\nbeing helpful when you wrote that sentence? Or did you feel that I <br/>\nneeded a cyber-kick in the teeth? If this is the type of response I <br/>\nshould expect from the un-schooling community when I ask for help, then <br/>\nthis is not a good community for my family and I to join. Please try to <br/>\nkeep in mind that when someone asks a bunch of strangers for help, that <br/>\nmost likely  she (or he) is really desperate and struggling, because <br/>\nmost people don&#39;t go around asking strangers for help. To open yourself <br/>\nup to the world like that, to admit you need help and then to work up <br/>\nthe courage to ask for it, that is a very vulnerable place to be. Can <br/>\nyou open your heart and try to understand how easily hurt one&#39;s <br/>\nfeelings would be in that situation?  I can handle being told that what <br/>\nI think I need is entirely incorrect. Just please believe me when I say <br/>\nthat I don&#39;t need mean-spirited e-mails when I am genuinely and <br/>\ndesperately asking for help. Was my letter really that offensive? I <br/>\nwould really like to thank all of the people who gave me answers from <br/>\ntheir hearts and I am sorry and embarrassed to be this hurt by the <br/>\nmean-spirited responses. It just hurts that much more when you&#39;re <br/>\nalready pretty low.<br/>\n\tNadine<br/>\n<blockquote><span title=\"qreply\"> On Apr 22, 2004, at 2:15 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> wrote:<br/>\n<br/>\n&gt; In a message dated 4/21/2004 12:01:27 PM Mountain Daylight Time,<br/>\n&gt;  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:nadmo@...\">nadmo@...</a> writes:<br/>\n&gt;  Please, send only helpful<br/>\n&gt;  suggestions. Also, I am new to this group and to the concept of<br/>\n&gt;  unschooling<br/>\n&gt;  ----------------------<br/>\n&gt;<br/>\n&gt;  Please, if you already know the answer, you don&#39;t need us.<br/>\n&gt;  If you don&#39;t know the answer, how do you really know what is useful?<br/>\n&gt;  And how will WE really know what is useful, not knowing your son?<br/>\n&gt;<br/>\n&gt;  If anyone here has ideas you hadn&#39;t already thought of, that will be <br/>\n&gt; a useful<br/>\n&gt;  suggestion, whether you use the suggestion or not.<br/>\n&gt;<br/>\n&gt;  It&#39;s extremely common for new unschoolers to think they know what <br/>\n&gt; they need,<br/>\n&gt;  and to be almost entirely incorrect.<br/>\n&gt;<br/>\n&gt;  It&#39;s very, very different from other most other approaches to living <br/>\n&gt; and<br/>\n&gt;  parenting.<br/>\n&gt;<br/>\n&gt;  -=- More to the point, how do you<br/>\n&gt;  &quot;find&quot; friends for your child, when this is a factor?-=-<br/>\n&gt;<br/>\n&gt;  When anything is a factor, friends are found doing what the child <br/>\n&gt; loves to do.<br/>\n&gt;<br/>\n&gt;  Taking him to a pool if he&#39;s not a physical guy would at best find him<br/>\n&gt;  friends with whom he didn&#39;t have common interests.�<br/>\n&gt;<br/>\n&gt;  What kind of reading does he like?� Are there local history clubs or<br/>\n&gt;  projects?� Science fiction or anime clubs?��� Do you live in a city <br/>\n&gt; with a gaming<br/>\n&gt;  shop?� My older son works in a gaming shop and the collectible card <br/>\n&gt; games are<br/>\n&gt;  quite cerebral and reading-based.� Lots of history, fantasy, <br/>\n&gt; tactics.� I&#39;ve never<br/>\n&gt;  see those kids care a bit about what the other players look like, <br/>\n&gt; just so<br/>\n&gt;  they&#39;re fun, amusing, good-natured.<br/>\n&gt;<br/>\n&gt;  And they play in greatly mixed-age groups.�<br/>\n&gt;<br/>\n&gt;  -=-We are wanting to<br/>\n&gt;  homeschool/unschool but the fear of total isolation and my son<br/>\n&gt;  being friendless is rather daunting. -=-<br/>\n&gt;<br/>\n&gt;  What&#39;s your alternative?<br/>\n&gt;  Are kids at school being nice to him?<br/>\n&gt;  Does he have friends there?<br/>\n&gt;<br/>\n&gt;  Sandra<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;  [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt; \t� \tTo visit your group on the web, go to:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/AlwaysLearning/\">http://groups.yahoo.com/group/AlwaysLearning/</a><br/>\n&gt; �<br/>\n&gt; \t� \t To unsubscribe from this group, send an email to:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning-unsubscribe@yahoogroups.com\">AlwaysLearning-unsubscribe@yahoogroups.com</a><br/>\n&gt; �<br/>\n&gt; \t� \t Your use of Yahoo! Groups is subject to the Yahoo! Terms of <br/>\n&gt; Service.<br/>\n&gt;<br/>\n&gt;  <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":182902428,"authorName":"Nadine","from":"Nadine &lt;nadmo@...&gt;","profile":"ilovetarotalot","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] help","postDate":"1082690673","msgId":19355,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJEQzEzRDIyLTk0RDUtMTFEOC05Qzc0LTAwMzA2NTY4ODE1NEBhZGVscGhpYS5uZXQ+","inReplyToHeader":"PDIwMDQwNDIyLjEzMjEzNy44Nzk0LjQ0MjUyMkB3ZWJtYWlsMDUubnljLnVudGQuY29tPg==","referencesHeader":"PDIwMDQwNDIyLjEzMjEzNy44Nzk0LjQ0MjUyMkB3ZWJtYWlsMDUubnljLnVudGQuY29tPg=="},"prevInTopic":19348,"nextInTopic":19356,"prevInTime":19354,"nextInTime":19356,"topicId":19329,"numMessagesInTopic":0,"msgSnippet":"Gosh, I had no idea how very careful with my words I needed to be to post a question on this site. When I posted it I was feeling very hurt, vulnerable and","messageBody":"<div id=\"ygrps-yiv-1176969290\">Gosh, I had no idea how very careful with my words I needed to be to <br/>\npost a question on this site. When I posted it I was feeling very hurt, <br/>\nvulnerable and fairly depressed. I really tried to do my best to choose <br/>\nwords that would not draw unnecessary meanness from strangers. Well, <br/>\nthe very plea for only &quot;helpful suggestions&quot; prompted a few strangers <br/>\nto send exactly what I didn&#39;t need. Ren, were you purposely shouting <br/>\n&quot;UN&quot; at me when you wrote &quot;UN-helpful&quot;? That&#39;s what I meant by <br/>\nunhelpful...It didn&#39;t help me at all, neither did the blow by blow <br/>\ncorrecting of my letter from Sandra. I made that unfortunate plea <br/>\n(helpful suggestions only...) because I am used to people trying to <br/>\ntell me that it&#39;s not about my son&#39;s weight, or it&#39;s all in my <br/>\nhead...That kind of unhelpful thing. I also didn&#39;t want thinly veiled <br/>\nattacks on my character flaws or the way I worded my letter. Haven&#39;t <br/>\nany of you ever been so depressed and so vulnerable that you felt the <br/>\nneed to say &quot;please don&#39;t be mean to me, I&#39;m just asking for help...&quot;? <br/>\nWell, that&#39;s how I was feeling when I wrote my letter. I am sorry it <br/>\noffended any of you enough to make you feel you needed to write hurtful <br/>\nthings to me.  I&#39;m feeling pretty awful and more depressed that my <br/>\nletter drew such a response from anyone, let alone Sandra. Wow, just <br/>\nlooking at your letter makes me just feel like a piece of poop. I <br/>\ndidn&#39;t know that there was this much wrong with me. Thank you to all of <br/>\nthe folks who sent helpful suggestions and for choosing not to point <br/>\nout all of the wrong things I said or the wrong things I think. I am <br/>\njust a mom, at her wit&#39;s end, hoping that someone out there has an <br/>\n&quot;answer&quot; that I haven&#39;t already heard. I definitely wasn&#39;t looking for <br/>\nmean-spirited replies that would make me cry and leave me feeling even <br/>\nmore alone. I know I am a sensitive person and that being depressed <br/>\nmakes me more sensitive, but please don&#39;t inundate me with &quot;you&#39;re too <br/>\nsensitive!!&quot; e-mails, I know I just couldn&#39;t handle it. Maybe you guys <br/>\ncould stand to take it easy on some of us newcomers especially those of <br/>\nus who are struggling. Honestly, I was just looking for some help.<br/>\nNadine<br/>\n<blockquote><span title=\"qreply\"> On Apr 22, 2004, at 1:21 PM, Ren wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;  &quot;Please, send only helpful<br/>\n&gt;  suggestions.&quot;<br/>\n&gt;<br/>\n&gt;  Do you think folks are going to purposely send UN-helpful <br/>\n&gt; suggestions? Assume that everyone is going to automatically give you <br/>\n&gt; the best advice they can personally give, and it&#39;s up to you to decide <br/>\n&gt; what is useful for your own life.<br/>\n&gt;<br/>\n&gt;  As to the friends issue....we truly don&#39;t have a problem with <br/>\n&gt; that,ever. And it&#39;s got nothing to do with weight or looks or other <br/>\n&gt; issues, it&#39;s because my children meet people based on their interests <br/>\n&gt; and commonalities. We don&#39;t go looking for friends, they happen as a <br/>\n&gt; natural side effect of pursuing lives we love.<br/>\n&gt;<br/>\n&gt;  Some of our favorite folks are in our unschooling support group, but <br/>\n&gt; we&#39;ve met great people through church, Yu-gi-oh trading and even <br/>\n&gt; through the bookstore.� I have been around several unschooling <br/>\n&gt; families the last few years, and seen some kids with challenges, <br/>\n&gt; including being heavy or autistic or physically challenged, but none <br/>\n&gt; have been treated any differently. What my kids use for judgement is <br/>\n&gt; how nice the person acts, whether or not they have some common <br/>\n&gt; interests and have fun together. That&#39;s it.<br/>\n&gt;<br/>\n&gt;  So I would recommend other unschoolers if that&#39;s the direction you&#39;re <br/>\n&gt; planning on going. Or even other relaxed homeschoolers if that isn&#39;t <br/>\n&gt; possible. I also recommend helping your child pursue his interests and <br/>\n&gt; find friends that way.<br/>\n&gt;  Seems like the gaming groups we&#39;ve hung out with gather a very <br/>\n&gt; diverse group of kids, some of them not so physically gifted, but they <br/>\n&gt; all have fun and I haven&#39;t heard teasing.<br/>\n&gt;  School kids have that chicken pecking mentality, so it&#39;s more common <br/>\n&gt; for them to single out anyone a little bit different. Not so with <br/>\n&gt; children raised away from that toxic environment...or at least not as <br/>\n&gt; common. That&#39;s been my experience.<br/>\n&gt;<br/>\n&gt;  Ren<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;  &quot;There is no way to<br/>\n&gt;  peace.� Peace is the way.&quot;<br/>\n&gt;  ������������������ ~Quaker saying<br/>\n&gt;  ����������������<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;  Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt; \t� \tTo visit your group on the web, go to:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/AlwaysLearning/\">http://groups.yahoo.com/group/AlwaysLearning/</a><br/>\n&gt; �<br/>\n&gt; \t� \t To unsubscribe from this group, send an email to:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning-unsubscribe@yahoogroups.com\">AlwaysLearning-unsubscribe@yahoogroups.com</a><br/>\n&gt; �<br/>\n&gt; \t� \t Your use of Yahoo! Groups is subject to the Yahoo! Terms of <br/>\n&gt; Service.<br/>\n&gt;<br/>\n&gt;  <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] help","postDate":"1082668525","msgId":19348,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY0LjNhMGUwZWNjLjJkYjk4ZmVkQGFvbC5jb20+"},"prevInTopic":19347,"nextInTopic":19355,"prevInTime":19347,"nextInTime":19349,"topicId":19329,"numMessagesInTopic":0,"msgSnippet":"In a message dated 4/21/2004 12:01:27 PM Mountain Daylight Time, nadmo@adelphia.net writes: Please, send only helpful suggestions. Also, I am new to this group","messageBody":"<div id=\"ygrps-yiv-1545550186\">In a message dated 4/21/2004 12:01:27 PM Mountain Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:nadmo@...\">nadmo@...</a> writes:<br/>\nPlease, send only helpful <br/>\nsuggestions. Also, I am new to this group and to the concept of <br/>\nunschooling<br/>\n----------------------<br/>\n<br/>\nPlease, if you already know the answer, you don&#39;t need us.<br/>\nIf you don&#39;t know the answer, how do you really know what is useful?<br/>\nAnd how will WE really know what is useful, not knowing your son?<br/>\n<br/>\nIf anyone here has ideas you hadn&#39;t already thought of, that will be a useful <br/>\nsuggestion, whether you use the suggestion or not.<br/>\n<br/>\nIt&#39;s extremely common for new unschoolers to think they know what they need, <br/>\nand to be almost entirely incorrect.<br/>\n<br/>\nIt&#39;s very, very different from other most other approaches to living and <br/>\nparenting.<br/>\n<br/>\n-=- More to the point, how do you <br/>\n&quot;find&quot; friends for your child, when this is a factor?-=-<br/>\n<br/>\nWhen anything is a factor, friends are found doing what the child loves to do.<br/>\n<br/>\nTaking him to a pool if he&#39;s not a physical guy would at best find him <br/>\nfriends with whom he didn&#39;t have common interests.  <br/>\n<br/>\nWhat kind of reading does he like?  Are there local history clubs or <br/>\nprojects?  Science fiction or anime clubs?    Do you live in a city with a gaming <br/>\nshop?  My older son works in a gaming shop and the collectible card games are <br/>\nquite cerebral and reading-based.  Lots of history, fantasy, tactics.  I&#39;ve never <br/>\nsee those kids care a bit about what the other players look like, just so <br/>\nthey&#39;re fun, amusing, good-natured.<br/>\n<br/>\nAnd they play in greatly mixed-age groups.  <br/>\n<br/>\n-=-We are wanting to <br/>\nhomeschool/unschool but the fear of total isolation and my son <br/>\nbeing friendless is rather daunting. -=-<br/>\n<br/>\nWhat&#39;s your alternative? <br/>\nAre kids at school being nice to him?<br/>\nDoes he have friends there?<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":150527288,"authorName":"Ren","from":"Ren &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"help","postDate":"1082665274","msgId":19347,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwNDIyLjEzMjEzNy44Nzk0LjQ0MjUyMkB3ZWJtYWlsMDUubnljLnVudGQuY29tPg=="},"prevInTopic":19337,"nextInTopic":19348,"prevInTime":19346,"nextInTime":19348,"topicId":19329,"numMessagesInTopic":0,"msgSnippet":"Please, send only helpful suggestions. Do you think folks are going to purposely send UN-helpful suggestions? Assume that everyone is going to automatically","messageBody":"<div id=\"ygrps-yiv-380291266\">&quot;Please, send only helpful <br/>\nsuggestions.&quot;<br/>\n<br/>\nDo you think folks are going to purposely send UN-helpful suggestions? Assume that everyone is going to automatically give you the best advice they can personally give, and it&#39;s up to you to decide what is useful for your own life.<br/>\n<br/>\nAs to the friends issue....we truly don&#39;t have a problem with that,ever. And it&#39;s got nothing to do with weight or looks or other issues, it&#39;s because my children meet people based on their interests and commonalities. We don&#39;t go looking for friends, they happen as a natural side effect of pursuing lives we love.<br/>\n<br/>\nSome of our favorite folks are in our unschooling support group, but we&#39;ve met great people through church, Yu-gi-oh trading and even through the bookstore.  I have been around several unschooling families the last few years, and seen some kids with challenges, including being heavy or autistic or physically challenged, but none have been treated any differently. What my kids use for judgement is how nice the person acts, whether or not they have some common interests and have fun together. That&#39;s it.<br/>\n<br/>\nSo I would recommend other unschoolers if that&#39;s the direction you&#39;re planning on going. Or even other relaxed homeschoolers if that isn&#39;t possible. I also recommend helping your child pursue his interests and find friends that way. <br/>\nSeems like the gaming groups we&#39;ve hung out with gather a very diverse group of kids, some of them not so physically gifted, but they all have fun and I haven&#39;t heard teasing.<br/>\nSchool kids have that chicken pecking mentality, so it&#39;s more common for them to single out anyone a little bit different. Not so with children raised away from that toxic environment...or at least not as common. That&#39;s been my experience.<br/>\n<br/>\nRen<br/>\n<br/>\n<br/>\n<br/>\n &quot;There is no way to <br/>\npeace.  Peace is the way.&quot; <br/>\n                   ~Quaker saying</div>","specialLinks":[]},{"userId":2300774,"authorName":"Elizabeth Hill","from":"Elizabeth Hill &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] help","postDate":"1082583655","msgId":19337,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQwODZFQTY3LjcwNjAzMDBAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PGM2M3FuMStiYzc3QGVHcm91cHMuY29tPg==","referencesHeader":"PGM2M3FuMStiYzc3QGVHcm91cHMuY29tPg=="},"prevInTopic":19335,"nextInTopic":19347,"prevInTime":19336,"nextInTime":19338,"topicId":19329,"numMessagesInTopic":0,"msgSnippet":"** My son is 10, he is very cerebral, reads 24/7, plays no sports. We do encourage him to get his body moving, we hike together, he has a dancing video","messageBody":"<div id=\"ygrps-yiv-1999328429\">**<br/>\n<br/>\nMy son is 10, he is very cerebral, reads 24/7, plays no sports. We <br/>\ndo encourage him to get his body moving, we hike together, he <br/>\nhas a dancing video game...**<br/>\n<br/>\nHi -<br/>\n<br/>\nMy son just turned 10 and tends to be sedentary and a bit overweight.  My brother bought him an &quot;eye toy&quot; for our Playstation 2 and that has encouraged getting his body moving.  I moved last year, and I sometimes think that *I* have a hard time making friends because I make a bad impression on people being very very overweight myself.  So I sympathize.<br/>\n<br/>\nI think homeschooling park days are a pretty good place to make friends.  And sometimes it takes awhile for people to make friends.  I think my son was more at ease socially when he was younger.  Now he tends to be slow to approach people.<br/>\n<br/>\nWhat would your son like to do with other kids?  What kind of play does he like when he&#39;s not reading?  Or does he just want kids to talk about books with?  (Not trying to sound rude, just looking for ideas.  You could host activities related to what he likes to do.)<br/>\n<br/>\nBetsy</div>","specialLinks":[]},{"userId":129679134,"authorName":"Tia Leschke","from":"Tia Leschke &lt;leschke@...&gt;","profile":"leschke2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] help","postDate":"1082571716","msgId":19335,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYuMC4wLjIyLjAuMjAwNDA0MjExMTE2NDguMDI4NDE3YzBAc2hhd21haWwuZ3Yuc2hhd2NhYmxlLm5ldD4=","inReplyToHeader":"PGM2M3FuMStiYzc3QGVHcm91cHMuY29tPg==","referencesHeader":"PGM2M3FuMStiYzc3QGVHcm91cHMuY29tPg=="},"prevInTopic":19329,"nextInTopic":19337,"prevInTime":19334,"nextInTime":19336,"topicId":19329,"numMessagesInTopic":0,"msgSnippet":"... I don t have that kind of kid so have no answers in that area, but think about the fact that he s only got one sort of friend now, in a school-like ","messageBody":"<div id=\"ygrps-yiv-947416439\"><blockquote><span title=\"ireply\">&gt;We are wanting to<br/>\n&gt;homeschool/unschool but the fear of total isolation and my son<br/>\n&gt;being friendless is rather daunting.<br/>\n<br/>\n </span></blockquote>I don&#39;t have that kind of kid so have no answers in that area, but think <br/>\nabout the fact that he&#39;s only got one sort of friend now, in a school-like <br/>\nsituation if I&#39;m reading you right.<br/>\n<br/>\nIn general, the way for homeschooled kids to find friends is to be involved <br/>\nin activities they enjoy and meet them there. Taking him to the park or <br/>\npool wouldn&#39;t have that shared interest factor to help the other kids get <br/>\npast his appearance. I think I would look for other kinds of activities <br/>\nthat he might enjoy. Is there a homeschooling group nearby? There might be <br/>\nactivities available through them that would appeal to a boy like yours <br/>\n(the opposite of my physically active boy - grin). Maybe there&#39;s a chess <br/>\nclub or a science club or reading discussion group, that kind of thing. <br/>\nHe&#39;s more likely to meet a &quot;kindred spirit&quot; at something like that. Or your <br/>\ncommunity recreation facility might have some activities that he&#39;d like.<br/>\nTia</div>","specialLinks":[]},{"userId":182902428,"authorName":"ilovetarotalot","from":"&quot;ilovetarotalot&quot; &lt;nadmo@...&gt;","profile":"ilovetarotalot","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"help","postDate":"1082486305","msgId":19329,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM2M3FuMStiYzc3QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":19335,"prevInTime":19328,"nextInTime":19330,"topicId":19329,"numMessagesInTopic":0,"msgSnippet":"My son is 10, he is very cerebral, reads 24/7, plays no sports. We do encourage him to get his body moving, we hike together, he has a dancing video game...But","messageBody":"<div id=\"ygrps-yiv-1724170084\">My son is 10, he is very cerebral, reads 24/7, plays no sports. We <br/>\ndo encourage him to get his body moving, we hike together, he <br/>\nhas a dancing video game...But he is overweight, always has <br/>\nbeen big. This seems to be a factor in the way that other kids <br/>\nsee and interact with him. It seems that most kids have a <br/>\nreluctance to be friendly to him because of his appearance. I&#39;ve <br/>\nbeen binging him to parks and pools  &quot;looking for friends&quot; for a <br/>\nlong time now and I&#39;ve seen the reaction on the other children&#39;s <br/>\nfaces, this is not a mistaken impression of mine, so please, no <br/>\nlectures on my &quot;misperception&quot; of this problem. My question is, <br/>\ndo any of you have a similar story? More to the point, how do you <br/>\n&quot;find&quot; friends for your child, when this is a factor? We are <br/>\npresently doing independent study through a Waldorf  charter <br/>\nschool, in which he has 1 friend, sort of...We are wanting to <br/>\nhomeschool/unschool but the fear of total isolation and my son <br/>\nbeing friendless is rather daunting. Please, send only helpful <br/>\nsuggestions. Also, I am new to this group and to the concept of <br/>\nunschooling, I did post a previous question and intro, but it just <br/>\ndisappeared...So, I&#39;ll do it again; I&#39;m a SAHM with a 10 yr old boy <br/>\nand an almost 4 yr old girl. Unschooling sounds like the perfect  <br/>\nsolution to some of the difficulties I&#39;ve been having, honestly, I <br/>\nwept when I read some of the information and parent <br/>\n&quot;testimonials&quot;.  Thank you for any advice you can throw my way...</div>","specialLinks":[]}],"prevTopicId":19465,"nextTopicId":19437}}