{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":268949016,"authorName":"magenta_mum","from":"&quot;magenta_mum&quot; &lt;magenta_mum@...&gt;","profile":"magenta_mum","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"&quot;Mum, can I have a labret for my twelfth birthday?&quot;","postDate":"1181977144","msgId":29335,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY1MDFubys5cW5uQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":29334,"nextInTime":29336,"topicId":29335,"numMessagesInTopic":0,"msgSnippet":"With the discussion about hair colour / personal expression, I thought I d add in the following warts and all account of my internal processes and some of the","messageBody":"<div id=\"ygrps-yiv-144448782\">With the discussion about hair colour / personal expression, I thought<br/>\nI&#39;d add in the following warts and all account of my internal<br/>\nprocesses and some of the external around a piercing not-in-earlobe.<br/>\n<br/>\n<br/>\nK: Mum, can I have a labret for my twelfth birthday? <br/>\nMe: What&#39;s a labret? <br/>\nK: A lip piercing. <br/>\nMe: &lt;pause&gt; Oh, well let&#39;s look into it. <br/>\n<br/>\nCall me oldfashioned and uncool, but I would&#39;ve felt more relaxed if<br/>\nshe&#39;d been asking for more holes in her earlobes. I&#39;ve always fancied,<br/>\nbut never gotten a nose piercing. I have a tattoo on my back that I<br/>\ngot when I was in my twenties (I&#39;m 42 now). So it&#39;s not that I&#39;m<br/>\naverse to body art / piercings, I just wasn&#39;t sure how much some of<br/>\nthe rest of the world might have a prob with it on a youngish person.<br/>\nOf course, what school would say about it wasn&#39;t an issue for us by<br/>\nthen, still, there were questions I thought worth thinking about. <br/>\n<br/>\nI wondered about the possible dental prob&#39;s with mouth piercings; how<br/>\nthe local Home Ed group would feel about it (would we be asked to<br/>\nleave because they thought it inappropriate?); how might future<br/>\nemployers perceive piercings not-in-ears (my sibling was good here,<br/>\nshe had a brow piercing and hadn&#39;t had prob&#39;s getting part-time work<br/>\nin our fairly conservative town at a chain book store and pizza place<br/>\nwith it - though she did have to take it out for her shifts - and<br/>\ncould only think of one employer she&#39;d ever had who would definitely<br/>\nNOT have taken her on because of it). <br/>\n<br/>\nK did a major google search (something I used to do for her, mostly -<br/>\nthough she does it much more herself nowadays). There were a lot of<br/>\nhits to dental sites that warned of possible prob&#39;s, mostly with<br/>\ntongue piercing, not so much lips, wearing on enamel and such. She<br/>\nlooked at sites of people who did have labrets to get the real life<br/>\nexperiences side of things, and got some good tips about care and the<br/>\noccasional problem people had experienced. <br/>\n<br/>\nIt was pretty close to her birthday at the time and I kinda had other<br/>\nplans, so I ended up saying &quot;well, howabout for your thirteenth, if<br/>\nyou still want it, or if before then, probably paying for it<br/>\nyourself&quot;. We&#39;d checked out the costs of the piercing itself, care<br/>\nproducts, etc, and had discovered that one piercing place in town<br/>\nwouldn&#39;t do under 14&#39;s, even with parental permission. Thankfully, one<br/>\nprofessional place was fine with it, though I still had to sign my<br/>\npermission. <br/>\n<br/>\nSo, K got a labret about two months after her twelfth birthday, (she&#39;s<br/>\n14 now), which she paid for herself mostly with birthday money from<br/>\nother family members. She&#39;d decided she wouldn&#39;t have cared much if<br/>\nthe local HE group didn&#39;t continue to welcome us (nobody&#39;s said<br/>\nanything, though we don&#39;t do much with them since our very busy first<br/>\nyear). <br/>\n<br/>\nK had her last visit to the &quot;school&quot; dental nurse she&#39;d been seeing<br/>\nsince she was three, post piercing, and the dental nurse was fine with<br/>\nit from her personal and professional pov. <br/>\n<br/>\nThere wasn&#39;t any acrimony around my sort of stalling on saying yes,<br/>\nbecause I wasn&#39;t saying no outright, and have no habit of doing so<br/>\narbitrarily. K knows I can be a tad bit fogeyish in my outlook<br/>\nsometimes, a little slow to embrace some things - much as I&#39;d like to<br/>\ndeny that altogether - just `cause I was raised differently, in<br/>\ndifferent times. And it is oftentimes wise to explore before<br/>\ncommitting, I reckon.  <br/>\n<br/>\nJo R <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.freewebs.com/having-a-cow/\">http://www.freewebs.com/having-a-cow/</a></div>","specialLinks":[]}],"prevTopicId":29313,"nextTopicId":29322}}