{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Shimokawa Family","from":"Shimokawa Family &lt;sfamily@...&gt;","replyTo":"LIST","senderId":"Vt03zXZdivw5psp4R68RARNM-hyAwo2-jYPfOPzqPZxDwxakIiklXlbiYvZDtgY8qpU7gi8V4HDAIzc9wn3UV8e2MhC60m2mvmjh2yYH3Q","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Making the Decision to Homeschool","postDate":"939692051","msgId":3763,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4yNTEuMzc2My45NTkyNjk3NDNAZUdyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":3762,"nextInTime":3764,"topicId":3763,"numMessagesInTopic":0,"msgSnippet":"Making the Decision to Homeschool By Melanie Shimokawa I am an American living in Japan with my Japanese husband and our two year old son, Mook - who is both.","messageBody":"<div id=\"ygrps-yiv-817344907\">Making the Decision to Homeschool<br/>\nBy Melanie Shimokawa<br/>\n\tI am an American living in Japan with my Japanese husband and our two<br/>\nyear old son, Mook - who is both.  It is common to send children as<br/>\nyoung as two to cram school or baby genius school.  They are expected to<br/>\nread basic Japanese by age five.  But, of course, every mother wants her<br/>\nchild to be ahead.  I figured, preschool starts at age four here, so<br/>\nbefore then, I wanted him to be able to read English, since he won*t get<br/>\nit anywhere else.  I bought him some educational software, but I wanted<br/>\nto learn how to teach him after school.  So I looked all over the<br/>\ninternet for homeschooling, just for ideas to teach my son now, and when<br/>\nhe would go to school.  Never ever did I think that I would completely<br/>\nhomeschool him.  What about socialization?  What about things I can*t<br/>\nteach him?  How could I afford all the equipment?  How would I know what<br/>\nI was supposed to teach him?  So I would just teach him English after<br/>\nschool.  <br/>\n\tThe more I researched homeschooling, the more wonderful it sounded, and<br/>\nthe more convinced I was that I could do it.  The more I realized how<br/>\nmuch time would be wasted at school.  Then I remembered my own<br/>\nexperiences at school.  I was constantly playing sick to avoid having to<br/>\ngo.  I claimed to like school.  I thought I did.  But I would rather<br/>\nhave stayed home and learned what I wanted to.  I didn*t get any<br/>\npositive socialization.  Bullied at recess and prevented from<br/>\nsocializing during class time, I feel I could have done better out of<br/>\nschool.  I realized that homeschooling doesn*t mean you have to stay at<br/>\nhome.  That would be boring.  My two year old now makes friends with<br/>\npeople at the store, whenever we meet anyone when we go for a walk,<br/>\npeople - grown-ups and kids alike - at the playground, the library,<br/>\nchurch, etc.  He has more friends than I ever did.  He is never lonely.<br/>\n\tEven though he*s only two, Mook teaches me things I never knew before. <br/>\nJust from following his interests, I have learned the names of all the<br/>\ntrains in Japan (though he still has to correct me once in a while), and<br/>\nthe parts of a train and how they work to make the train go.  I never<br/>\nknew any of that before - neither did I care - but I know now.  And so<br/>\ndoes Mook.  My husband and I both help him pursue his interests.  We<br/>\ntake him to the library, search the internet, and his educational<br/>\ncomputer programs also help.  One thing leads to another, and through<br/>\nphases of bulldozers, trains, and now dinosaurs, Mook is learning to<br/>\nlove learning and life.  He does worksheets once in a while - when he<br/>\nreally wants to, but to him, learning is not being forced to study<br/>\nthings he couldn*t care less about.  To Mook, learning is discovering<br/>\nall the wonderful things about life.  That will continue, as long as he<br/>\nhas the chance to allow it to.<br/>\n____________________________________<br/>\n<br/>\nThis, and other essays can be found on my incomplete website:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.geocities.com/Heartland/Pointe/3440/\">http://www.geocities.com/Heartland/Pointe/3440/</a><br/>\n<br/>\nIf anyone else is willing to help me by writing essays on various<br/>\ntopics, I would appreciate it.<br/>\n<br/>\nLove, Melanie in Japan</div>","specialLinks":[]}],"prevTopicId":3762,"nextTopicId":3756}}