{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":28,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Lost in transition - help!","postDate":"1320430945","msgId":63695,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE3RDdDQTQ1LTMxNTYtNDY4OS04RjI1LThBOTU5QUEyMjdGNUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEZFOEY2MTY1LTQzM0MtNEIwMy04ODYxLUU1QzQ2QUM2NTczREB5YWhvby5jb20+","referencesHeader":"PGo4aDkyYitkaTYyQGVHcm91cHMuY29tPiA8RDBEQUJFNUItMTA4NS00RUE0LTlGQjYtMjA2NjRFMTkxMzU4QHlhaG9vLmNvbT4gPDY5QjQxRkE1LTIzNEYtNEM3Ni05Q0M1LUZCQzVFQUNDNDY4NEBTYW5kcmFkb2RkLmNvbT4gPEZFOEY2MTY1LTQzM0MtNEIwMy04ODYxLUU1QzQ2QUM2NTczREB5YWhvby5jb20+"},"prevInTopic":63692,"nextInTopic":0,"prevInTime":63694,"nextInTime":63696,"topicId":63593,"numMessagesInTopic":0,"msgSnippet":"-=- For the record, I read and re-read pages on Sandra s and Joyce s sites. I really do feel that as I start getting it the information there seems to change","messageBody":"<div id=\"ygrps-yiv-1061724530\">-=-<br/>\nFor the record, I read and re-read pages on Sandra&#39;s and Joyce&#39;s sites. I really do feel that as I start &quot;getting it&quot; the information there seems to change though the words do not. Funny how understanding works!-=-<br/>\n<br/>\nGood thing to remember, if you ever start to tell yourself that your child SHOULD understand something, because it had been experienced, or discussed.  As understanding grows, things you saw before will look different.   The first time might be written off as a fluke, or blamed on some other factor.  If it happens three or four times, THEN one can start to analyze why.  Same with adults, same with children.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":138778570,"authorName":"catfish_friend","from":"catfish_friend &lt;catfish_friend@...&gt;","profile":"catfish_friend","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Lost in transition - help!","postDate":"1320417491","msgId":63692,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEZFOEY2MTY1LTQzM0MtNEIwMy04ODYxLUU1QzQ2QUM2NTczREB5YWhvby5jb20+","inReplyToHeader":"PDY5QjQxRkE1LTIzNEYtNEM3Ni05Q0M1LUZCQzVFQUNDNDY4NEBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGo4aDkyYitkaTYyQGVHcm91cHMuY29tPiA8RDBEQUJFNUItMTA4NS00RUE0LTlGQjYtMjA2NjRFMTkxMzU4QHlhaG9vLmNvbT4gPDY5QjQxRkE1LTIzNEYtNEM3Ni05Q0M1LUZCQzVFQUNDNDY4NEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":63656,"nextInTopic":63695,"prevInTime":63691,"nextInTime":63693,"topicId":63593,"numMessagesInTopic":0,"msgSnippet":"--// You shouldn t be transitioning to anything you and your husband don t both agree to try. //-- My husband has decided that he s OK with our daughter being","messageBody":"<div id=\"ygrps-yiv-671415297\">--// You shouldn&#39;t be transitioning to anything you and your husband don&#39;t both agree to try. //--<br/>\n<br/>\nMy husband has decided that he&#39;s OK with our daughter being at home for now.  He tells me that he was on the fence when the pinworms came up at school and that pushed him over the edge to keeping our 5 year old home.<br/>\n<br/>\nI am focusing on --<br/>\n<br/>\n1. having fun with my girls<br/>\n<br/>\nand, <br/>\n<br/>\n2. doing my best to meet my husband&#39;s needs in family culture.<br/>\n<br/>\nIs there anything else I should be focusing on?<br/>\n<br/>\nI made the mistake of shifting things too quickly to begin with.  Sandra&#39;s &#39;gradual change&#39; page would have been a better page to come across first before I started trying anything towards unschooling...<br/>\n<br/>\nIt could have saved me a lot of angst in this transition.<br/>\n<br/>\nFor the record, I read and re-read pages on Sandra&#39;s and Joyce&#39;s sites.  I really do feel that as I start &quot;getting it&quot; the information there seems to change though the words do not.  Funny how understanding works!<br/>\n<br/>\nCeci</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Lost in transition - help!","postDate":"1320072603","msgId":63656,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY5QjQxRkE1LTIzNEYtNEM3Ni05Q0M1LUZCQzVFQUNDNDY4NEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEQwREFCRTVCLTEwODUtNEVBNC05RkI2LTIwNjY0RTE5MTM1OEB5YWhvby5jb20+","referencesHeader":"PGo4aDkyYitkaTYyQGVHcm91cHMuY29tPiA8RDBEQUJFNUItMTA4NS00RUE0LTlGQjYtMjA2NjRFMTkxMzU4QHlhaG9vLmNvbT4="},"prevInTopic":63655,"nextInTopic":63692,"prevInTime":63655,"nextInTime":63657,"topicId":63593,"numMessagesInTopic":0,"msgSnippet":"-=- Another example is how angry he gets when he has to repeatedly ask them to do the same thing day after day (hang up wet towels, don t walk around the house","messageBody":"<div id=\"ygrps-yiv-283067936\">-=- Another example is how angry he gets when he has to repeatedly ask  <br/>\nthem to do the same thing day after day (hang up wet towels, don&#39;t  <br/>\nwalk around the house with food). I have mentioned that it&#39;s the same  <br/>\nas when they were younger -- we need to keep gently reminding them  <br/>\nuntil they do &#39;get it&#39; -- that getting mad about it turns it into an  <br/>\nIssue instead. He still gets mad about it.-=-<br/>\n<br/>\nThen you either help the girls hang up wet towels or YOU hang up the  <br/>\nwet towels.<br/>\nBe on SOMEbody&#39;s team, rather than complaining to and about your  <br/>\nhusband&#39;s thoughts, words and deeds.<br/>\n<br/>\n-=-I do have a general feeling that my husband had an easier time  <br/>\nbeing empathetic towards the girls when they were younger. He seems  <br/>\ngentler with the younger one than the older one. I think he sometimes  <br/>\nexpects so much of our 5 year old -- she is capable of relating to  <br/>\nadults and it makes it easy to think she can do things the way adults  <br/>\ndo. I see this because I think I used to make the same mistake.-=-<br/>\n<br/>\nYou&#39;re seeing something natural, and something you admittedly did  <br/>\nyourself, and calling it &quot;a mistake.&quot;<br/>\n<br/>\n-=-Less tension, more fun. So much so that my husband mentioned buying  <br/>\na property with his parents. I used to think that could be a good idea  <br/>\nbut as I get older, I feel like I need to work out more of my own  <br/>\nissues, my marriage issues, my ability to really be there for my girls  <br/>\nbefore I want to add to my homelife dynamic! As convenient as it might  <br/>\nbe to have loving grandparents to watch the girls time to time.-=-<br/>\n<br/>\nBut you don&#39;t LIKE his parents.  They are not the &quot;loving  <br/>\ngrandparents&quot; of your imagination.<br/>\nTheir visit, even with you right in the room, seemed to overwhelm you.<br/>\n<br/>\n-=- As an adult, I still wonder what I want to be when I grow up and I  <br/>\nknow that I want to be loving, kind and helpful.-=-<br/>\n<br/>\nStart with your husband.  Practice there.<br/>\n<br/>\n-=- I want to dig in my heels and protect her from the sheep- <br/>\nmentality.-=-<br/>\n<br/>\nYour thoughts are about you, about what other people think and say  <br/>\nabout school, it seems.<br/>\nOther people say &quot;sheep mentality.&quot; :-)<br/>\n<br/>\n-=- I think school will not give her the opportunity to pursue her  <br/>\ninterests as they arise and feed her curiosity. Rather, I think school  <br/>\ndulls our innate hunger to learn because it teaches (forces) us to  <br/>\nWait because it&#39;s time to focus on the subject at hand.-=-<br/>\n<br/>\nSO?<br/>\nIf things aren&#39;t going well at home, she might need to go to school.<br/>\nIf you (your family as a whole) can&#39;t make unschooling work better  <br/>\nthan school, then unschooling is a bad option, and school would be  <br/>\nbetter.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/schoolchoice\">http://sandradodd.com/schoolchoice</a><br/>\nRead that, please, and think about it before you respond to the list.<br/>\n<br/>\nIF school doesn&#39;t &quot;give her the opportunity to pursue her interests as  <br/>\nthey arise and feed her curiosity&quot; so what?  You can do that before  <br/>\nand after school.  There are more days at home than days at school, in  <br/>\nAmerican school schedules anyway (you might be elsewhere).<br/>\n<br/>\nYou&#39;re looking for excuses and justifications rather than looking at  <br/>\nyour daughter and her relationship to the world, it seems, from your  <br/>\nwriting.<br/>\n<br/>\nFor me, school was all about me pursuing my interests and feeding my  <br/>\ncuriosity, because school was better than my house.<br/>\n<br/>\nOnly families that can figure out how to create an unschooling nest  <br/>\nthat is better, more nurturing, and more satisfying than school should  <br/>\nunschool.<br/>\n<br/>\nAnd if you can&#39;t do it now, it doesn&#39;t mean you couldn&#39;t do it in a  <br/>\nyear or three.<br/>\n<br/>\n-=-My husband mentioned yesterday that he wants our 5 year old to go  <br/>\nback for at least one day (one week from now) and see how it goes. He  <br/>\nand I are on opposite sides of the fence on school and I think I will  <br/>\nneed to find a way to be on the same side. Unfortunately, that may  <br/>\nrequire I side with him and push school for now.-=-<br/>\n<br/>\nYes. And school is going to need some scheduled meals, and bedtimes.   <br/>\nYou shouldn&#39;t be transitioning to anything you and your husband don&#39;t  <br/>\nboth agree to try.<br/>\n<br/>\n-=-Her school has them paint with one watercolor only at a time (no  <br/>\nacademics there, yet as it&#39;s Waldorf-inspired). That seems cruel to me  <br/>\nwhen I think about her sparkly, colorful book she is working on at  <br/>\nhome.-=-<br/>\n<br/>\nHOW DRAMATIC of you!<br/>\n&quot;Cruel&quot;?<br/>\n<br/>\nDo some math of your own, about how many waking hours there are at  <br/>\nschool in a year, compared to home.  If she can paint when she gets  <br/>\nhome, why consider school as though it will keep her from home  <br/>\npermanently, period?<br/>\n<br/>\n-=-It will be hard to figure out being on the same team with my  <br/>\nhusband as my views are pretty solid regarding school. But it does  <br/>\nmake sense to me that without being unified, unschooling will falter  <br/>\non a shaky family foundation.-=-<br/>\n<br/>\nThis is an understatement.  Your views on school are personal and too  <br/>\nsolid.  Look at little parts, not at the monolithic thing you have  <br/>\nsolidified.   Unschooling won&#39;t &quot;falter&quot; on a shaky family foundation,  <br/>\nit will fail AND break up your family.  It&#39;s not what unschooling is  <br/>\nfor, and it&#39;s not what it&#39;s about.<br/>\n<br/>\n-=-Thank you, Sandra, and so many others (Joyce, Schuyler, Kristi,  <br/>\nMelissa, Meredith, Jenny) for insightful responses as food for  <br/>\nthought.-=-<br/>\n<br/>\nIt would be better for you to read on my site and Joyce&#39;s (which have  <br/>\nquotes from those folks and many mor) as the topics come to mind, I  <br/>\nthink, than to discuss a situation which is not yet in an unschooling  <br/>\narena.  it&#39;s not the purpose of this list to assist people with family  <br/>\nrelationships when the family isn&#39;t ready to unschool yet.  The  <br/>\ndynamics are, and can&#39;t help but be, different.<br/>\n<br/>\n-=-One thing that really jumps out right now is that my husband is  <br/>\nprioritizing a lifestyle that does not support unschooling.-=-<br/>\n<br/>\nThat&#39;s a lot of words between you and &quot;my husband doesn&#39;t want to  <br/>\nunschool.&quot;  Your situation would be easier to see if you would try to  <br/>\ndefine things more simply, without  &quot;prioritizing lifestyles&quot; and  <br/>\n&quot;adding to homelife dynamics.&quot;  Your own thoughts are weighing you  <br/>\ndown in confusion.<br/>\n<br/>\n-=-One thing that really jumps out right now is that my husband is  <br/>\nprioritizing a lifestyle that does not support unschooling. He has a  <br/>\njob that gives him much stress. We don&#39;t need the income from this  <br/>\nparticular job, but it has a certain cache and benefit that he does  <br/>\nnot want to let go of. We can also live somewhere less expensive and  <br/>\nhave more family time with less stress but that is also less of a  <br/>\npriority to him than the job currently. I need to understand my  <br/>\nhusband more and figure out how to support his goals alongside rather  <br/>\nthan against the ones I have for unschooling.-=-<br/>\n<br/>\nI think &quot;instead of&quot; rather than &quot;alongside&quot; or &quot;against,&quot; for now.<br/>\n<br/>\nMaybe he wasn&#39;t a bright third grader (something you&#39;re still  <br/>\nidentifying with and thinking about) and he&#39;s fulfilling his self- <br/>\nesteem needs now.  That&#39;s important!!! He married you, and is taking  <br/>\ncare of you and your children.  APPRECIATE THAT!  Be his helper, not  <br/>\nhis challenge, his enemy, his antagonist.  Be a family, first, and  <br/>\nthen see what.  Your daughter might end up liking school if you will  <br/>\nhelp her like it rather than looking for reasons to be unhappy.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/abundance\">http://sandradodd.com/abundance</a><br/>\n<br/>\nIf you can&#39;t see what you have, you will never be happy.<br/>\n<br/>\nYou are still thinking about whether the teacher asking you to help  <br/>\nother kids in third grade was good for you.  I&#39;m sure it was better  <br/>\nfor you to be helpful and to exercise your abilities than not to.  It  <br/>\nwould be helpful now, too.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/service\">http://sandradodd.com/service</a><br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":138778570,"authorName":"catfish_friend","from":"catfish_friend &lt;catfish_friend@...&gt;","profile":"catfish_friend","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Lost in transition - help!","postDate":"1320057367","msgId":63655,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEIxNjg1QUVFLTI4NzQtNDVCQS05QUE5LUJBMDNEQTdBQUQ2REB5YWhvby5jb20+","inReplyToHeader":"PEFERkEwRDk3LURBMDEtNDE2My1BMDgxLTNEMkVGRUMwRjdBRUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGo4YzRjOCsxNmI0QGVHcm91cHMuY29tPiA8QkNCQjlCNEItMjZBMC00RjQ4LThENUYtMTI0QzZFRjg3QzkzQHlhaG9vLmNvbT4gPEMzOEQ0Q0Y5LUE5NjEtNEY4NS1BMEM1LThEODZFRjRFNzVDMUBTYW5kcmFkb2RkLmNvbT4gPEFERkEwRDk3LURBMDEtNDE2My1BMDgxLTNEMkVGRUMwRjdBRUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":63654,"nextInTopic":63656,"prevInTime":63654,"nextInTime":63656,"topicId":63593,"numMessagesInTopic":0,"msgSnippet":"^^^ It seems that you and your children are on one team and your husband is on another team. Before unschooling is going to work, you all need to be on one","messageBody":"<div id=\"ygrps-yiv-1763713716\">^^^ It seems that you and your children are on one team and your husband is on another team. Before unschooling is going to work, you all need to be on one team. And that might need to come first, and then, as a team, you think about unschooling. ^^^<br/>\n<br/>\nThis rings true to me, and though I think I&#39;ve been told this in other ways, on other days, it makes Sense to me now.<br/>\n<br/>\nI think the reality for me is that I made a commitment to our first daughter before I made a commitment to my husband.  I think this may be true of him, too (i.e. &quot;doing the right thing&quot; marrying the girl he knocked up).  Ironically, my husband and I have fared pretty well despite our challenges (like not knowing each other for long or well before having a baby) and we&#39;ve known several families who were together for much longer before us who have since divorced.<br/>\n<br/>\nUnschooling as a lifestyle and a philosophy is important to me because I remember being a straight-A, well-rounded, well-liked kid in school, who felt that what was the best way to learn something was by having a mentor.  As an adult, I still wonder what I want to be when I grow up and I know that I want to be loving, kind and helpful.  As a parent, I want to be a loving, kind, helpful and resourceful mentor and friend.  I don&#39;t demonize school.  I did really well there and I think my 5 year old would do well there, too, but I don&#39;t think it&#39;s the best option for her.  When everyone else around me seems to think it is the best option for her but can&#39;t really articulate why besides saying that she&#39;s so social, I want to dig in my heels and protect her from the sheep-mentality.  I see my 5 year old as bright, curious and motivated.  I think school will not give her the opportunity to pursue her interests as they arise and feed her curiosity.  Rather, I think school dulls our innate hunger to learn because it teaches (forces) us to Wait because it&#39;s time to focus on the subject at hand.  I was turned into a roving classroom helper in 3rd grade because I was always done with work so much earlier than everyone else.  How helpful for the teacher, but was that the best thing for me?  In some ways, I am still unsure of what my passions and path are.  I think unschooling is the best opportunity I know of for a child to come to really understand who she is and what she is passionate about while also becoming aware of what areas are less important to her.<br/>\n<br/>\nI just found out her class has pinworms and lice.  Do I want to send her back in a week to that along with facing the boy she repeatedly tells me is the bully in her class?  The boy the teacher calls one of a couple of &quot;live wires&quot; in a class of 28?  The school that is requesting $1500 donation per family?  And this is the &quot;choice&quot; school around here...<br/>\n<br/>\nMy husband mentioned yesterday that he wants our 5 year old to go back for at least one day (one week from now) and see how it goes.  He and I are on opposite sides of the fence on school and I think I will need to find a way to be on the same side.  Unfortunately, that may require I side with him and push school for now.<br/>\n<br/>\nWhat&#39;s so strange to me is that my husband automatically is very unschoolish when he is with our girls and there is no school (weekends, vacations) but it&#39;s almost as if because school is there, he wants to use it, he sees it as Opportunity for our girls.  I am thinking more and more along the lines of, I would never want a babysitter who was watching my child along with 27 other children no matter who that person was.  And, as far as someone teaching my children -- my 5 year old added up to 44 a couple of weeks ago while playing shop with a combination of dollar bills in play money and a check!  No one taught her -- she is playing and learning on her own.  She has been working on her first illustrated book, too.  It doesn&#39;t look like anything I&#39;ve ever seen, or probably anything that would get published, but this was by her own initiative!  Her school has them paint with one watercolor only at a time (no academics there, yet as it&#39;s Waldorf-inspired).  That seems cruel to me when I think about her sparkly, colorful book she is working on at home.<br/>\n<br/>\nIt will be hard to figure out being on the same team with my husband as my views are pretty solid regarding school.  But it does make sense to me that without being unified, unschooling will falter on a shaky family foundation.<br/>\n<br/>\nThank you, Sandra, and so many others (Joyce, Schuyler, Kristi, Melissa, Meredith, Jenny) for insightful responses as food for thought.<br/>\n<br/>\nOne thing that really jumps out right now is that my husband is prioritizing a lifestyle that does not support unschooling.  He has a job that gives him much stress.  We don&#39;t need the income from this particular job, but it has a certain cache and benefit that he does not want to let go of.  We can also live somewhere less expensive and have more family time with less stress but that is also less of a priority to him than the job currently.  I need to understand my husband more and figure out how to support his goals alongside rather than against the ones I have for unschooling.<br/>\n<br/>\nCeci</div>","specialLinks":[]},{"userId":138778570,"authorName":"catfish_friend","from":"catfish_friend &lt;catfish_friend@...&gt;","profile":"catfish_friend","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Lost in transition - help!","postDate":"1320053909","msgId":63654,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQwREFCRTVCLTEwODUtNEVBNC05RkI2LTIwNjY0RTE5MTM1OEB5YWhvby5jb20+","inReplyToHeader":"PGo4aDkyYitkaTYyQGVHcm91cHMuY29tPg==","referencesHeader":"PGo4aDkyYitkaTYyQGVHcm91cHMuY29tPg=="},"prevInTopic":63647,"nextInTopic":63655,"prevInTime":63653,"nextInTime":63655,"topicId":63593,"numMessagesInTopic":0,"msgSnippet":"((())) When you get defensive (I despise that treatment!) it s natural for him to get defensive in return - so work on being less defensive! Find another way","messageBody":"<div id=\"ygrps-yiv-1587035692\">((())) When you get defensive (I despise that treatment!) it&#39;s natural for him to get defensive in return - so work on being less defensive! Find another way to support your kids without grating on dad and grandparents. You could say &quot;oh, its okay, I&#39;ll put down a tablecloth&quot; and skip right over comments like &quot;kids should eat at the table&quot;. ((()))<br/>\n<br/>\nI can definitely work on being less defensive!<br/>\n<br/>\nI had already been putting down a tablecloth and then a low table for the girls to eat off of in the living room.  My husband declared one day that he had just had it with the messes and that the kids could not eat in the living room anymore.  Of course, the mess would be wherever the kids ate -- they are 5 and 2.5 and don&#39;t do things like eat their toast only exactly over their plate or the table.  And then my husband complains about the mess on the floor under the kids&#39; seats at the dining table.  There&#39;s a degree of my husband not accepting that the kids are as young as they are.  Another example is how angry he gets when he has to repeatedly ask them to do the same thing day after day (hang up wet towels, don&#39;t walk around the house with food).  I have mentioned that it&#39;s the same as when they were younger -- we need to keep gently reminding them until they do &#39;get it&#39; -- that getting mad about it turns it into an Issue instead.  He still gets mad about it.<br/>\n<br/>\nI do have a general feeling that my husband had an easier time being empathetic towards the girls when they were younger.  He seems gentler with the younger one than the older one.  I think he sometimes expects so much of our 5 year old -- she is capable of relating to adults and it makes it easy to think she can do things the way adults do.  I see this because I think I used to make the same mistake.<br/>\n<br/>\n((())) Maybe shift your thinking to how to be a good hostess to your in-laws and your kids at the same time - not a good unschooling mom, but a good hostess in a complex party with guests who don&#39;t always get along. ((()))<br/>\n<br/>\nI did try to support the kids by anticipating their needs more after reading this list.  It helped to think of being a hostess of a complex party!  Less tension, more fun.  So much so that my husband mentioned buying a property with his parents.  I used to think that could be a good idea but as I get older, I feel like I need to work out more of my own issues, my marriage issues, my ability to really be there for my girls before I want to add to my homelife dynamic!  As convenient as it might be to have loving grandparents to watch the girls time to time.<br/>\n<br/>\nThanks to everyone for their input!!!  I am so grateful to this list and to you all.<br/>\n<br/>\nCeci<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Lost in transition - help!","postDate":"1319924078","msgId":63647,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTk5MjQwNzguNzI2MTkuWWFob29NYWlsTmVvQHdlYjEyMjUxNy5tYWlsLm5lMS55YWhvby5jb20+","inReplyToHeader":"PDUyQUJFQ0RELTZBNEEtNEJFRi1CODhFLTQ4MUY0MTYxQ0YyNkB5YWhvby5jb20+","referencesHeader":"PGo4YzRjOCsxNmI0QGVHcm91cHMuY29tPiA8QkNCQjlCNEItMjZBMC00RjQ4LThENUYtMTI0QzZFRjg3QzkzQHlhaG9vLmNvbT4gPEMzOEQ0Q0Y5LUE5NjEtNEY4NS1BMEM1LThEODZFRjRFNzVDMUBTYW5kcmFkb2RkLmNvbT4gPDUyQUJFQ0RELTZBNEEtNEJFRi1CODhFLTQ4MUY0MTYxQ0YyNkB5YWhvby5jb20+"},"prevInTopic":63646,"nextInTopic":63654,"prevInTime":63646,"nextInTime":63648,"topicId":63593,"numMessagesInTopic":0,"msgSnippet":"*** My husband has outright told our girls to follow his rules (don t eat or drink in the living room, for example) while he will. When I mention that I","messageBody":"<div id=\"ygrps-yiv-2074796853\">*** My husband has outright told our girls to follow his rules (don&#39;t eat or drink in the living room, for example) while he will. When I mention that I really despised that kind of do-what-I-say-not-what-I-do treatment by adults when I was a kid and that I think it&#39;s better to model the example, my husband says that he&#39;ll do what he wants.***<br/>\n<br/>\n<br/>\nIf it is mess and spills he&#39;s concerned about, that can be addressed.  I&#39;d get some tv tables and food trays.  If the kids eat in there, they must use a tray or table.  Food messes all over the home drive me a bit insane and that is how I&#39;ve dealt with it.<br/>\n<br/>\nIf your husband has that attitude, the kids WILL pick up on it and one day they may say or act the EXACT same way.  It won&#39;t help really to point that out.  Sometimes what a kid does that is annoying to a parent, is the exact same thing that annoys them about themselves.  Maybe your daughter is just like your husband!  She reacts with a &quot;digs her heels in&quot; kind of way, just like your husband. (I&#39;m guessing, I don&#39;t actually know that they do that)<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Lost in transition - help!","postDate":"1319921164","msgId":63646,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTk5MjExNjQuMjY3NzUuWWFob29NYWlsTmVvQHdlYjEyMjUwNi5tYWlsLm5lMS55YWhvby5jb20+","inReplyToHeader":"PEMzOEQ0Q0Y5LUE5NjEtNEY4NS1BMEM1LThEODZFRjRFNzVDMUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGo4YzRjOCsxNmI0QGVHcm91cHMuY29tPiA8QkNCQjlCNEItMjZBMC00RjQ4LThENUYtMTI0QzZFRjg3QzkzQHlhaG9vLmNvbT4gPEMzOEQ0Q0Y5LUE5NjEtNEY4NS1BMEM1LThEODZFRjRFNzVDMUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":63645,"nextInTopic":63647,"prevInTime":63645,"nextInTime":63647,"topicId":63593,"numMessagesInTopic":0,"msgSnippet":"***That s not ironic. That s normal. She s little and (it seems from what you wrote) you left her to negotiate the TV room / living room /den with other adults","messageBody":"<div id=\"ygrps-yiv-929488760\">***That&#39;s not ironic. That&#39;s normal. She&#39;s little and (it seems from what you wrote) you left her to negotiate the TV room / living room /den with other adults instead of trying to help involve her in the conversation (politely, on both your parts) or finding her something to do in another room? That set her up for failure. And it wasn&#39;t cooperative of you OR her.***<br/>\n<br/>\n<br/>\nA few years ago, the girls and I would visit my husband&#39;s grandparents once a week or so.  They aren&#39;t alive any more, so it makes the whole experience even more valuable.  They were old and the kids were young and busy and sometimes bored.  I didn&#39;t let them do whatever they wanted to do.  John&#39;s grandmother had specifically wanted me there to sew with her and do woman chit chat and sometimes that left the kids going back and forth between the sewing room where mom was to the living room or garage where great grandpa was.  We did find a happy way to keep the kids occupied.  <br/>\n<br/>\nThe grandparents weren&#39;t really the kind of people that would simply turn the tv on.  They were more inclined to listen to the radio, but they DID have the whole set of Little House On The Prairie on VHS and Lord of the Dance.  They LOVED those shows.  Grandpa was happy to watch those things and the kids were exposed to something they maybe wouldn&#39;t have seen otherwise.  When we packed to go to their house, we didn&#39;t pack the gameboy.  The grandparents wouldn&#39;t have appreciated that much.  We packed traditional toys that the kids liked, like dolls and games, things that were familiar to our hosts.<br/>\n<br/>\nWhen it came time to eat, I volunteered to set up the dining table BEFORE anyone asked and sometimes the kids would help simply because it was what was being done.  To avoid food issues, I filled the kid&#39;s plates with things that I knew for certain they would eat, with only small portions, so that they could ask for more, meaning it was heard by the hosts that something was liked and enjoyed.<br/>\n<br/>\nWhen it came time to leave, we said our goodbyes together, hugs and kisses that the kids didn&#39;t really like were done with mom getting hugs and kisses too.  I made sure that I said thank you and other polite niceties as we left.  <br/>\n<br/>\nMargaux doesn&#39;t remember any of those visits but Chamille does and she remembers them as happy visits.  She remembers setting aside her usual activities for those visits.  In a way it sets them aside as something special and different.  The whole point of the visits was to get to know family members that wouldn&#39;t be around forever, to spend time with old folks that loved the attention of family and their generations that followed them.  I wanted the visits to be memorable as something pleasant and fun, so that is how I set them up.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Lost in transition - help!","postDate":"1319919811","msgId":63645,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTk5MTk4MTEuNTE2NTEuWWFob29NYWlsTmVvQHdlYjEyMjUwNC5tYWlsLm5lMS55YWhvby5jb20+","inReplyToHeader":"PEJDQkI5QjRCLTI2QTAtNEY0OC04RDVGLTEyNEM2RUY4N0M5M0B5YWhvby5jb20+","referencesHeader":"PGo4YzRjOCsxNmI0QGVHcm91cHMuY29tPiA8QkNCQjlCNEItMjZBMC00RjQ4LThENUYtMTI0QzZFRjg3QzkzQHlhaG9vLmNvbT4="},"prevInTopic":63644,"nextInTopic":63646,"prevInTime":63644,"nextInTime":63646,"topicId":63593,"numMessagesInTopic":0,"msgSnippet":"***Ironically, his parents are visiting right now and the issue at hand regarding our 5 year old is that my in-laws (and my husband) feel that she needs to","messageBody":"<div id=\"ygrps-yiv-1210729784\">***Ironically, his parents are visiting right now and the issue at hand regarding our 5 year old is that my in-laws (and my husband) feel that she needs to &quot;cooperate more&quot; which really has been about them wanting her to comply quietly and politely with their requests (i.e. turn-off the TV when they want it off, etc.).***<br/>\n<br/>\nLet the visit seep in.  Allow your husband time to process the visit after they leave before talking to him about it all.  I wouldn&#39;t at all try to talk to him while they are visiting.  His emotions and own sense of guilt and shame are way too high and all mixed into his auto responses while they are there.  If you wait a bit, he may see all your concerns in his own way BECAUSE of his experience with his parents visiting.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Lost in transition - help!","postDate":"1319905162","msgId":63644,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo4aDkyYitkaTYyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDUyQUJFQ0RELTZBNEEtNEJFRi1CODhFLTQ4MUY0MTYxQ0YyNkB5YWhvby5jb20+"},"prevInTopic":63643,"nextInTopic":63645,"prevInTime":63643,"nextInTime":63645,"topicId":63593,"numMessagesInTopic":0,"msgSnippet":"... ****************** I bet he s reacting to another kind of baggage - some men feel like they go from being pushed around by parents to pushed around by","messageBody":"<div id=\"ygrps-yiv-1442123428\">catfish_friend &lt;catfish_friend@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I think some of my negativity is about my hangup regarding male superiority. ...<br/>\n&gt; When I mention that I really despised that kind of do-what-I-say-not-what-I-do treatment by adults when I was a kid and that I think it&#39;s better to model the example, my husband says that he&#39;ll do what he wants.<br/>\n </span></blockquote>******************<br/>\n<br/>\nI bet he&#39;s reacting to another kind of baggage - some men feel like they go from being pushed around by parents to pushed around by wives... and you&#39;ve added kids to your &quot;side&quot; so now he&#39;s the underdog  rather than king of his castle. That can be hard on a man&#39;s ego - there are dirty words for men who let their wives push them around too much. <br/>\n<br/>\nWhen you get defensive (I despise that treatment!) it&#39;s natural for him to get defensive in return - so work on being less defensive! Find another way to support your kids without grating on dad and grandparents. You could say &quot;oh, its okay, I&#39;ll put down a tablecloth&quot; and skip right over comments like &quot;kids should eat at the table&quot;. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I believe that my husband and my in-laws expect her to behave like someone older than 5 who is in a rough patch.<br/>\n </span></blockquote>**************<br/>\n<br/>\nIt could help to remind them Gently that 5 is still very young. She&#39;s little. She&#39;s having a hard time. She needs her mommy a lot right now. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; I&#39;m not going to be rude to my in-laws, but I am also not going to parent the way they have parented.<br/>\n </span></blockquote>*****************<br/>\n<br/>\nThose aren&#39;t the only two options! To some extent, it seems like you&#39;re saying &quot;I&#39;m not changing what I do for company&quot; - and that&#39;s backwards. It doesn&#39;t make Sense to do things the same when there are guests in the home. Everything is topsy turvey because there are extra people around, so it&#39;s reasonable for some aspects of how you interact with your kids to change, too. Maybe shift your thinking to how to be a good hostess to your in-laws and your kids at the same time - not a good unschooling mom, but a good hostess in a complex party with guests who don&#39;t always get along. It&#39;s extra work, for sure!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Tonight, before dinner, I anticipated what might happen when they would ask our 5 year old to turn off the TV<br/>\n </span></blockquote>*****************<br/>\n<br/>\nThat&#39;s the sort of thing I mean - but next time, hindsight at the ready - start sooner. Maybe soon enough that getting-ready-for-dinner can be a fun thing, a game or project your daughter can enjoy. That could help your daughter feel better about your guests, too rather than seeing them as inconvenient people getting in the way of her tv watching. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Lost in transition - help!","postDate":"1319903805","msgId":63643,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo4aDdudCs3YmU5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJDQkI5QjRCLTI2QTAtNEY0OC04RDVGLTEyNEM2RUY4N0M5M0B5YWhvby5jb20+"},"prevInTopic":63642,"nextInTopic":63644,"prevInTime":63642,"nextInTime":63644,"topicId":63593,"numMessagesInTopic":0,"msgSnippet":"... ***************** Given that, maybe you need to do Less talking - take him at his word for awhile and don t discuss the matter. Give things time to settle.","messageBody":"<div id=\"ygrps-yiv-1117413988\">catfish_friend &lt;catfish_friend@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I think he knows that he&#39;s not terribly passionate about either school or unschooling.  He is not particularly interested in discussing more nor taking initiative with the school-ish things that are still on the table.  This is what I mean by him being resigned about unschooling now.  He&#39;s not supportive of unschooling, but neither is he trying to support school.  The only statement he has really made about it has been something to the effect of, &quot;Well, you&#39;re<br/>\n&gt; the one who&#39;s home and you haven&#39;t supported school.  I guess by default, this is what we&#39;re doing.  No use talking about it now.&quot; <br/>\n </span></blockquote>*****************<br/>\n<br/>\nGiven that, maybe you need to do Less talking - take him at his word for awhile and don&#39;t discuss the matter. Give things time to settle. Sandra&#39;s &quot;read a little, try a little, wait a little, watch&quot; can be modified to &quot;talk a Little...etc&quot; in that sense. Give your husband a year of context before talking more about unschooling. If He brings it up, say something like &quot;I want to try this for now - give me time&quot; and change the subject. <br/>\n<br/>\nIf he&#39;s saying &quot;preschool will give you a break&quot; don&#39;t say things which imply you need a break to begin with. If those comments come out of the blue, let him know that homeschooling is a different lifestyle from school and it takes time to get used to the differences. Don&#39;t see them as passive aggressive - &quot;everyone&quot; says things like that and if your husband hasn&#39;t spent time hanging around unschooling lists getting pep-talks he doesn&#39;t have any reason to think differently.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;ve tried to anticipate his perspective on school vs. unschooling for over a year now...I can&#39;t address his concerns if neither one of us knows what they are.<br/>\n </span></blockquote>****************<br/>\n<br/>\nA year&#39;s not very long! Let things settle for awhile so he has time to ponder in long, slow ways, while seeing his kids live busy, happy lives. Busy, happy lives can do a lot to wear away fears and resistance to unschooling.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Lost in transition - help!","postDate":"1319901562","msgId":63642,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhGNTY2RTc5LTM2NzUtNDNENC1BMDdDLUE1QkE2Qjk1RTA3N0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDUyQUJFQ0RELTZBNEEtNEJFRi1CODhFLTQ4MUY0MTYxQ0YyNkB5YWhvby5jb20+","referencesHeader":"PGo4YzRjOCsxNmI0QGVHcm91cHMuY29tPiA8QkNCQjlCNEItMjZBMC00RjQ4LThENUYtMTI0QzZFRjg3QzkzQHlhaG9vLmNvbT4gPEMzOEQ0Q0Y5LUE5NjEtNEY4NS1BMEM1LThEODZFRjRFNzVDMUBTYW5kcmFkb2RkLmNvbT4gPDUyQUJFQ0RELTZBNEEtNEJFRi1CODhFLTQ4MUY0MTYxQ0YyNkB5YWhvby5jb20+"},"prevInTopic":63641,"nextInTopic":63643,"prevInTime":63641,"nextInTime":63643,"topicId":63593,"numMessagesInTopic":0,"msgSnippet":"-=-Maybe I am being overly negative about everyone but me. I m biased ;)-=- But if you identify with and cling to that bias, things will not get better. ","messageBody":"<div id=\"ygrps-yiv-1967244139\">-=-Maybe I am being overly negative about everyone but me. I&#39;m biased ;)-=-<br/>\n<br/>\nBut if you identify with and cling to that bias, things will not get better.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/service\">http://sandradodd.com/service</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/chores/gift\">http://sandradodd.com/chores/gift</a><br/>\n<br/>\n-=-I think some of my negativity is about my hangup regarding male superiority. There is a definite sense of grandpa being able to do whatever he wants when he wants and he doesn&#39;t need to ask or justify. My husband has outright told our girls to follow his rules (don&#39;t eat or drink in the living room, for example) while he will. When I mention that I really despised that kind of do-what-I-say-not-what-I-do treatment by adults when I was a kid and that I think it&#39;s better to model the example, my husband says that he&#39;ll do what he wants.-=-<br/>\n<br/>\nIf it&#39;s not something you can change, then you can accept it and live around it (like a big rock in the path) or you can make things worse in all kinds of little ways.<br/>\n<br/>\n-=-My sister in law, without going into too much detail is a mess. I can&#39;t blame my mother and father in law necessarily, but from what I have observed of them, I don&#39;t necessarily see them as stellar examples of parenting either.<br/>\n-=-<br/>\n<br/>\nYour husband probably knows all that.  Let him think about it at his own speed.  They&#39;re guests, they&#39;re not the bosses.  But they&#39;re also not the enemy.  Go easy on how you cast people, especially when they are more related to your own children than you are.  They will be the grandparents even if you were to get divorced.  You aren&#39;t related to them, but your children are their descendents.<br/>\n<br/>\n-=I think they prioritize their expectations of polite behavior over what is loving to her.-=-<br/>\n<br/>\nSo?  Them and a billion other grandparents.  It&#39;s unrealistic to expect things that are unlikely to happen, or to be angry about it.  There&#39;s a rock in the trail.  Sputtering and jumping up and down won&#39;t move the rock.<br/>\n<br/>\n-=-Tonight, before dinner, I anticipated what might happen when they would ask our 5 year old to turn off the TV, so I sat with her as dinner was almost ready and started to talk to her about how her grandparents are here for a short visit and how nice it will be to all sit down together and eat the beautiful meal her dad was making. I talked to her about how I knew she probably wanted to finish her show before dinner, and that her grandparents were not going to want to wait because it was already 3 hours later for them (they live in another time zone) etc. We discussed pausing the show and watching it after dinner, which she was OK with.-=-<br/>\n<br/>\nGood.  Keep doing that for another fifteen years, and you&#39;ll have this nailed!  Help her see the results of actions and decisions all the time, and when you do that with her, you&#39;ll start to do it more with yourself.  I&#39;m serious about that.  Countless times people have reported that when they helped talk their kids through decision making, they got better at it themselves, and the decisionmaking practice helped them make better decisions in their relationships with spouses and others.<br/>\n<br/>\n-=-It&#39;s very likely that my husband or my father-in-law would have triggered a repeat screaming session because they would not have made the effort to try to see things from her point of view. In fact, while I was talking to our 5 year old, my husband was repeatedly asking us to get ready for dinner and to turn off the TV, getting angrier and sterner.-=-<br/>\n<br/>\nOH.  I had pictured you having talked to her about that earlier, before dinner was ready, just the two of you, without an audience.  Don&#39;t keep doing it that way for fifteen years. :-)    <br/>\n<br/>\nIf your husband&#39;s parents were not the greatest, he&#39;s probably self-conscious around them and about what they will think.  That&#39;s normal.  Cut him some slack.  His stress level might be higher than your daughter&#39;s right now, and you did promise to help him out in life, sickness and health and all that, and inside every man it eh little boy.  nd that little boy is never triggered so much as when his parents are there.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":138778570,"authorName":"catfish_friend","from":"catfish_friend &lt;catfish_friend@...&gt;","profile":"catfish_friend","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Lost in transition - help!","postDate":"1319895746","msgId":63641,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUyQUJFQ0RELTZBNEEtNEJFRi1CODhFLTQ4MUY0MTYxQ0YyNkB5YWhvby5jb20+","inReplyToHeader":"PEMzOEQ0Q0Y5LUE5NjEtNEY4NS1BMEM1LThEODZFRjRFNzVDMUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGo4YzRjOCsxNmI0QGVHcm91cHMuY29tPiA8QkNCQjlCNEItMjZBMC00RjQ4LThENUYtMTI0QzZFRjg3QzkzQHlhaG9vLmNvbT4gPEMzOEQ0Q0Y5LUE5NjEtNEY4NS1BMEM1LThEODZFRjRFNzVDMUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":63640,"nextInTopic":63642,"prevInTime":63640,"nextInTime":63642,"topicId":63593,"numMessagesInTopic":0,"msgSnippet":"//// It seems you re emphasizing the negative regarding your husband, and minimizing it regarding you. You re making it about him, his parents, and you. It s","messageBody":"<div id=\"ygrps-yiv-1611181212\">//// It seems you&#39;re emphasizing the negative regarding your husband, and minimizing it regarding you. You&#39;re making it about him, his parents, and you. It&#39;s about your daughter and your ability to coach her to be sweet under real-life circumstances. ////<br/>\n<br/>\nMaybe I am being overly negative about everyone but me.  I&#39;m biased ;)<br/>\n<br/>\nWhat has become very clear to me in recent weeks is that my 5 year old feels like a caged animal who was moved away from her safe den against her will.  She&#39;s mourning the loss of the only home she ever knew (she was born in the home we moved from) and has specific fears regarding the relative unfamiliarity of our new home.  Add to that a shift from one parent being the caregiver to the other parent, graduation from preschool and attending kindergarten long enough to recognize that it&#39;s not where she wants to be but being home with mom and her little sister means she doesn&#39;t get the individualized attention from mom she&#39;d like.<br/>\n<br/>\nI believe my 5 year old is watching a lot of TV to help her cope with mourning the loss of her old home and her old life that was more predictable than what she has had in recent months.  Her shows have tidy resolutions every 10-25 minutes and are cheery and bright for the most part.  I believe that my husband and my in-laws expect her to behave like someone older than 5 who is in a rough patch.  I also think they don&#39;t dote on her the way they used to.  They are, however doting on her 2.5 year old sister.  Her dad has been similarly treating our girls this way.  I am still nursing the 2.5 year old and will often nap with her.  We also only have outside support available on evenings and weekends which mean during the day, when my husband is working and I&#39;m nursing and napping with our younger one, the older one is feeling left out.  I&#39;ve tried keeping the girls together during naptime either by driving or having a quiet storytime or a nap in front of the TV but the best chance of the younger one napping is when she is in bed without a lot of noise or movement.  Missing her nap means one cranky child who is more likely to get hurt and/or sick.<br/>\n<br/>\nI think some of my negativity is about my hangup regarding male superiority.  There is a definite sense of grandpa being able to do whatever he wants when he wants and he doesn&#39;t need to ask or justify.  My husband has outright told our girls to follow his rules (don&#39;t eat or drink in the living room, for example) while he will.  When I mention that I really despised that kind of do-what-I-say-not-what-I-do treatment by adults when I was a kid and that I think it&#39;s better to model the example, my husband says that he&#39;ll do what he wants.<br/>\n<br/>\nI feel more for what my 5 year old is feeling because I think I have a pretty decent idea of where she&#39;s at right now.  This is not to defend her being unpleasant, but that I think what she needs is empathy and understanding over added expectations of polite behavior.<br/>\n<br/>\nMy sister in law, without going into too much detail is a mess.  I can&#39;t blame my mother and father in law necessarily, but from what I have observed of them, I don&#39;t necessarily see them as stellar examples of parenting either.<br/>\n<br/>\nI credit my husband for his relationship with his parents.  They have had a rocky relationship over the years -- one that, if I had lived through what he had lived through, I probably would not be very connected to them at all.  He forgave them and found a way to build a new relationship with them.  I admire that in him.<br/>\n<br/>\nI see very clearly right now that my in laws and my husband approach our 5 year old&#39;s disturbing behavior in the same way.  I think they prioritize their expectations of polite behavior over what is loving to her.<br/>\n<br/>\nThese defiant acts by our 5 year old seem to happen when I&#39;m not around -- taking a shower, on a phone call.  They then escalate because our 5 year old is seeking empathy, not a correction in behavior or judgment or comparison to her sister.  Currently, I am the only adult here who will empathize with her first and then discuss the situation.  My husband usually will be gruff and then apologize to her later.  My in-laws don&#39;t empathize with her at all from what I&#39;ve seen.  I think they must think she&#39;s a spoiled brat.  My mother-in-law recognizes that her granddaughter doesn&#39;t act in defiance with me as she does her dad.  My mother-in-law commented tonight how that was a dynamic in their family when my husband was growing up and also how that was a dynamic in her family when she was growing up.<br/>\n<br/>\nI&#39;m not going to be rude to my in-laws, but I am also not going to parent the way they have parented.<br/>\n<br/>\nTonight, before dinner, I anticipated what might happen when they would ask our 5 year old to turn off the TV, so I sat with her as dinner was almost ready and started to talk to her about how her grandparents are here for a short visit and how nice it will be to all sit down together and eat the beautiful meal her dad was making.  I talked to her about how I knew she probably wanted to finish her show before dinner, and that her grandparents were not going to want to wait because it was already 3 hours later for them (they live in another time zone) etc.  We discussed pausing the show and watching it after dinner, which she was OK with.<br/>\n<br/>\nIt&#39;s very likely that my husband or my father-in-law would have triggered a repeat screaming session because they would not have made the effort to try to see things from her point of view.  In fact, while I was talking to our 5 year old, my husband was repeatedly asking us to get ready for dinner and to turn off the TV, getting angrier and sterner.<br/>\n<br/>\nOur house is small and the kitchen and dining area are the same room.  The living room is open to the kitchen/dining.  That&#39;s the public area.  The 2 bedrooms are big enough for sleeping and not much else.  I would consider a TV for the girls&#39; room but not until my husband is really OK with no limits on TV.  Our in-laws are in a converted garage office and have their own TV with cable hook-up.  Our 5 year old had specific things she wanted to do with her grandparents that she came up with based on what she knew they enjoy doing, but neither grandparent has said they would do those things with her.  They&#39;ve actively avoided her suggestions and then seem surprised when she isn&#39;t excited about their suggestions.<br/>\n<br/>\nI&#39;ve been coaching her s best I can, even before the screaming began to remember that her grandparents are here for a short visit and that when they&#39;re gone, she won&#39;t be seeing them until either we or they travel again which will be a while.<br/>\n<br/>\nI think realistically, my in-laws are here to escape what&#39;s happening with their daughter back home as much as they are here to see their grandchildren and also their son.  As much as I try to smooth things out for our 5 year old, she&#39;s in a rough spot right now.  It reminds me of when she was 3-3.5 and adjusting to the fact that her little sister was here to stay.  It was a tough time for her then, but one day, almost magically, she became the helpful, happy, spunky and funny girl I knew was there, again.<br/>\n<br/>\nEven with the difficulty she is having now with her dad and grandparents, most of the time with me, she is polite and cooperative reflexively, without pause.<br/>\n<br/>\nCeci</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Lost in transition - help!","postDate":"1319893109","msgId":63640,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFERkEwRDk3LURBMDEtNDE2My1BMDgxLTNEMkVGRUMwRjdBRUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEMzOEQ0Q0Y5LUE5NjEtNEY4NS1BMEM1LThEODZFRjRFNzVDMUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGo4YzRjOCsxNmI0QGVHcm91cHMuY29tPiA8QkNCQjlCNEItMjZBMC00RjQ4LThENUYtMTI0QzZFRjg3QzkzQHlhaG9vLmNvbT4gPEMzOEQ0Q0Y5LUE5NjEtNEY4NS1BMEM1LThEODZFRjRFNzVDMUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":63639,"nextInTopic":63641,"prevInTime":63639,"nextInTime":63641,"topicId":63593,"numMessagesInTopic":0,"msgSnippet":"-=-It seems you re emphasizing the negative regarding your husband, and minimizing it regarding you. You re making it about him, his parents, and you. It s","messageBody":"<div id=\"ygrps-yiv-1011018014\">-=-It seems you&#39;re emphasizing the negative regarding your husband, and minimizing it regarding you. You&#39;re making it about him, his parents, and you. It&#39;s about your daughter and your ability to coach her to be sweet under real-life circumstances.-=-<br/>\n<br/>\nI wanted to take this on a slightly other tangent.<br/>\n<br/>\nIf you and your husband discovered you were expecting a baby before you got to spend time together, you should probably remember that and be extra nice to him.  I would say &quot;to each other,&quot; but he&#39;s not here, only you are.  And if you tell him to be nice to you, that won&#39;t be being extra nice to him. :-)<br/>\n<br/>\nIt seems that you and your children are on one team and your husband is on another team.   Before unschooling is going to work, you all need to be on one team.  And that might need to come first, and then, as a team, you think about unschooling.<br/>\n<br/>\nAntagonism will not help unschooling work.<br/>\n<br/>\nThere are alternative ways to help your children get along with others.  Unschooling shouldn&#39;t be a way to prevent them from getting along with others, or give them the idea that they don&#39;t even have to bother.<br/>\n<br/>\nGiving children choices doesn&#39;t mean letting kids do whatever they want whenever they want.  Some choices are better than others; as a mom you&#39;re making choices that are disturbing others as surely as screaming is, I think.    Be kind to company. :-)<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Lost in transition - help!","postDate":"1319889649","msgId":63639,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEMzOEQ0Q0Y5LUE5NjEtNEY4NS1BMEM1LThEODZFRjRFNzVDMUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEJDQkI5QjRCLTI2QTAtNEY0OC04RDVGLTEyNEM2RUY4N0M5M0B5YWhvby5jb20+","referencesHeader":"PGo4YzRjOCsxNmI0QGVHcm91cHMuY29tPiA8QkNCQjlCNEItMjZBMC00RjQ4LThENUYtMTI0QzZFRjg3QzkzQHlhaG9vLmNvbT4="},"prevInTopic":63638,"nextInTopic":63640,"prevInTime":63638,"nextInTime":63640,"topicId":63593,"numMessagesInTopic":0,"msgSnippet":"-=- Thanks for that, Melissa. I will definitely ask my husband about his primary goals for parenting. -=- If he s clearly communicating that he does NOT want","messageBody":"<div id=\"ygrps-yiv-1239036840\">-=-<br/>\nThanks for that, Melissa. I will definitely ask my husband about his primary goals for parenting. -=-<br/>\n<br/>\nIf he&#39;s clearly communicating that he does NOT want to discuss it, approaching it that was (as a test --&quot;his primary goals...&quot;) seems like a bad idea.<br/>\n<br/>\n-=- I had to hold my tongue today when my mother-in-law told my daughter that my father-in-law said that he almost wanted to fly back home because he had never heard a child yell at their father the way she had last night. -=-<br/>\n<br/>\nI would want to leave too, though, if a child was yelling at a parent.<br/>\n<br/>\n-=-And shortly after, my father-in-law praised my younger daughter for helping set the table and chastising my older one for not being more like her younger sister. The guilt and shame my in-laws are laying on my 5 year old&#39;s shoulders makes me wonder how my husband lived with their parenting and managed to maintain a relationship with them all these years...<br/>\n-=-<br/>\n<br/>\nBut they must be wondering whether you have any idea about parenting, if you have a child who won&#39;t help set the table and who yells at her father, especially when you have company.<br/>\n<br/>\n-=-My husband definitely prioritizes compliance and is embarrassed that our 5 year old is so defiant with him (and his parents on occasion). She is not like that with me outside very occasional circumstances.-=-<br/>\n<br/>\nSo she&#39;s not cooperative, even with you sometimes.   Instead of starting off with &quot;she is not like that with me&quot; you could have said &quot;she&#39;s like that with me too, sometimes.&quot;<br/>\n<br/>\nIt seems you&#39;re emphasizing the negative regarding your husband, and minimizing it regarding you.  You&#39;re making it about him, his parents, and you.  It&#39;s about your daughter and your ability to coach her to be sweet under real-life circumstances.<br/>\n<br/>\nYour husband&#39;s parents were visiting.  Did you not intend to provide them a quiet place to visit?  -=-Ironically, his parents are visiting right now and the issue at hand regarding our 5 year old is that my in-laws (and my husband) feel that she needs to &quot;cooperate more&quot; which really has been about them wanting her to comply quietly and politely with their requests (i.e. turn-off the TV when they want it off, etc.).-=-<br/>\n<br/>\nThat&#39;s not ironic.  That&#39;s normal.  She&#39;s little and (it seems from what you wrote) you left her to negotiate the TV room / living room /den with other adults instead of trying to help involve her in the conversation (politely, on both your parts) or finding her something to do in another room?  That set her up for failure.  And it wasn&#39;t cooperative of you OR her.<br/>\n<br/>\nUnschoolers don&#39;t get special exceptions in dealing with others.  But beyond all that, she&#39;s five.  She&#39;s not solidly school age in most jurisdictions, so you shouldn&#39;t be blaming unschooling.  ANY young child needs parents to help them know what&#39;s expected in situations.  You have company, they&#39;re older, they came to see their grandchildren, and you&#39;re the mom, and you need to be coaching and helping and making it pleasant.  (Coaching the children, not your in-laws.)<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":138778570,"authorName":"catfish_friend","from":"catfish_friend &lt;catfish_friend@...&gt;","profile":"catfish_friend","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Lost in transition - help!","postDate":"1319874403","msgId":63638,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJDQkI5QjRCLTI2QTAtNEY0OC04RDVGLTEyNEM2RUY4N0M5M0B5YWhvby5jb20+","inReplyToHeader":"PGo4YzRjOCsxNmI0QGVHcm91cHMuY29tPg==","referencesHeader":"PGo4YzRjOCsxNmI0QGVHcm91cHMuY29tPg=="},"prevInTopic":63629,"nextInTopic":63639,"prevInTime":63637,"nextInTime":63639,"topicId":63593,"numMessagesInTopic":0,"msgSnippet":"Kristi: ==== Have you and your husband had the opportunity to REALLY discuss all the options available? ==== I think we need to discuss more.  I thought we had","messageBody":"<div id=\"ygrps-yiv-1346004011\">Kristi: <br/>\n==== Have you and your husband had the opportunity to REALLY discuss all the options available? ====<br/>\n<br/>\nI think we need to discuss more.  I thought we had reached a common understanding, but his reaction to our 5 year old not returning to school seems less than satisfactory.  I almost wonder if he was hoping that she would choose school after being home with me.  Or that I would want our daughter to attend school after spending so much time with her.<br/>\n<br/>\nMy husband comments how much he needed preschool for our daughter so that he could get a break when he was the full-time caregiver (when she was 4).  He brings this up if I ever ask him to help with our girls when he is home, saying that I could get a break from the girls if I sent them to school but that I chose not to.  I see this as passive-aggressive behavior and a sign that maybe he wasn&#39;t so sure with letting our daughter choose when or if she would go to school.<br/>\n<br/>\nMy husband and I did not have much of a courtship or long relationship before finding out we were going to have our first child.  This has meant we have had a crash-course in learning to live with each other alongside becoming spouses and parents.  Over time, I am recognizing that it takes my husband some time to be ready to make choices and take actions based on those choices -- much longer than me.  I see that he sometimes doesn&#39;t completely know how he feels or what he thinks about something until he has already made a choice or taken an action.  In this case, regarding school or unschooling our 5 year old, he seems to have new feelings from when we made the choice to follow our daughter&#39;s inclinations.  When I mention that I think we need to discuss it now so that we can approach our next action together, his response is noncommittal, avoidant, distracted...<br/>\n<br/>\nI think he knows that he&#39;s not terribly passionate about either school or unschooling.  He is not particularly interested in discussing more nor taking initiative with the school-ish things that are still on the table.  This is what I mean by him being resigned about unschooling now.  He&#39;s not supportive of unschooling, but neither is he trying to support school.  The only statement he has really made about it has been something to the effect of, &quot;Well, you&#39;re<br/>\nthe one who&#39;s home and you haven&#39;t supported school.  I guess by default, this is what we&#39;re doing.  No use talking about it now.&quot;  Though, if school were really important to him, that option is not gone, yet.  I have told him this and that we should discuss more so that we can come up with a plan, but he is not interested in discussing it.<br/>\n<br/>\nI&#39;ve tried to anticipate his perspective on school vs. unschooling for over a year now and I make a significant effort to support and address his needs and concerns.  I can&#39;t address his concerns if neither one of us knows what they are.<br/>\n<br/>\nMelissa:  <br/>\n-/- In doing that, we were able to talk about how our baggage is not our kids&#39; baggage, and maybe if we look at the big picture it&#39;s not about winning (or thinking we&#39;re winning based on having compliant childern), but about having a good relationship with our kids. <br/>\n<br/>\nIf you and your husband can agree that a primary goal is to have a solid, positive, long term relationship with your kids, then in the moment you (and he) can decide whether the action you/he take is going to help or harm that. -/-<br/>\n<br/>\nThanks for that, Melissa.  I will definitely ask my husband about his primary goals for parenting.  Ironically, his parents are visiting right now and the issue at hand regarding our 5 year old is that my in-laws (and my husband) feel that she needs to &quot;cooperate more&quot; which really has been about them wanting her to comply quietly and politely with their requests (i.e. turn-off the TV when they want it off, etc.).  I had to hold my tongue today when my mother-in-law told my daughter that my father-in-law said that he almost wanted to fly back home because he had never heard a child yell at their father the way she had last night.  And shortly after, my father-in-law praised my younger daughter for helping set the table and chastising my older one for not being more like her younger sister.  The guilt and shame my in-laws are laying on my 5 year old&#39;s shoulders makes me wonder how my husband lived with their parenting and managed to maintain a relationship with them all these years...<br/>\n<br/>\nMy husband definitely prioritizes compliance and is embarrassed that our 5 year old is so defiant with him (and his parents on occasion).  She is not like that with me outside very occasional circumstances.  If I open the discussion to what his overall parenting goals are rather than just about school vs. unschooling, maybe we can at least figure out if we share the same principles and priorities.<br/>\n<br/>\nThanks to all you wise parents for your thoughts and insight.  I&#39;ll be mulling over the links and posts while I work on being kinder, happier and gentler with my husband.<br/>\n<br/>\nCeci<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":333388203,"authorName":"Rinelle","from":"&quot;Rinelle&quot; &lt;rinelle@...&gt;","profile":"rinelle2011","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Lost in transition - help!","postDate":"1319764613","msgId":63629,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA4MDhCNkExOTJFRjRCNkY5ODA5NDZCMjY3MUEyMjU3QFRhbWFyYT4=","inReplyToHeader":"PEM0QkY5MjJCLUZBMUQtNDM4Ni1CNzNGLTU3QUVDOTU4M0M0NkB5YWhvby5jb20+","referencesHeader":"PDZDODEwRkM4LTlDRTItNDk0Qy05ODhDLUE1OUE1NEQ2RTU0NEB5YWhvby5jb20+IDxCMUFDRUM1MC0wNEE3LTQ3M0ItQUJGQS1DODdEQ0REN0VCMzRAdmVyaXpvbi5uZXQ+IDw3NTQ4NzU2OS02QTBELTQ4QUEtQjA3Ri1BMDZFMUZDNDBDMkFAeWFob28uY29tPiA8MjkyNzQ1MkMtMUY1OS00Q0VGLTg2RUItRjQwOTQ0Nzg1QjMyQFNhbmRyYWRvZGQuY29tPiA8QzRCRjkyMkItRkExRC00Mzg2LUI3M0YtNTdBRUM5NTgzQzQ2QHlhaG9vLmNvbT4="},"prevInTopic":63626,"nextInTopic":63638,"prevInTime":63628,"nextInTime":63630,"topicId":63593,"numMessagesInTopic":0,"msgSnippet":"From: catfish_friend  ... But is her saying it in a calm voice going to make any difference to dad turning her show off or not?  If","messageBody":"<div id=\"ygrps-yiv-2062884975\">From: &quot;catfish_friend&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:catfish_friend@...\">catfish_friend@...</a>&gt;<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;If someone turned off a show I was watching, and if I objected, and if <br/>\n&gt;&gt;&gt;&gt;someone asked me to explain in calm<br/>\n&gt;words what I didn&#39;t like about the fact that my show had been turned off, I <br/>\n&gt;would JUST KEEP SCREAMING.<br/>\n&gt;<br/>\n&gt;Asking someone to ask in calm words what it is she would like, when it is <br/>\n&gt;blatantly obvious, is as disrespectful as<br/>\n&gt;turning the show off.&lt;&lt;&lt;<br/>\n&gt;<br/>\n&gt; I am suggesting alternatives to screaming and saying &quot;I hate you!&quot; <br/>\n&gt; Specifically, that she can make a request to her<br/>\n&gt; dad in the moment such as, &quot;I&#39;m not done with my show.  Please turn it <br/>\n&gt; back on.&quot;  And, as an alternative to telling her<br/>\n&gt; dad she hates him, to say something like, &quot;I hate it when you turn off the <br/>\n&gt; TV when I&#39;m in the middle of watching my<br/>\n&gt; show.&quot;<br/>\n<br/>\n </span></blockquote>But is her saying it in a calm voice going to make any difference to dad <br/>\nturning her show off or not?  If it was likely to get her her show, then <br/>\nmaybe, but otherwise it is a big ask for a 5 year old.  I have noticed that <br/>\nmy daughter is far more likely to yell at my DH, who will frequently try to <br/>\ntalk her out of a request if it doesn&#39;t make sense to him.  Now she just <br/>\nyells first up, since he is more likely to listen to that.  If a yell is <br/>\nmore likely to get a child what they want, then they&#39;re going to be more <br/>\nlikely to yell.<br/>\n<br/>\nIs it possible to find ways that this isn&#39;t an issue of conflict between <br/>\nthem?  If there is a show that the kids particularly like that is only on <br/>\nafter dad is home, can you offer to tape it for them so that they can play <br/>\nwith dad and still not miss out on their show?  Can you try to set up a fun <br/>\nactivity for coming home time so that they are already engaged in something, <br/>\npreferably something dad can join in if he likes, when he gets home?<br/>\n<br/>\nTamara</div>","specialLinks":[]},{"userId":283530155,"authorName":"JustSayin","from":"&quot;JustSayin&quot; &lt;mfcappella@...&gt;","profile":"mfcappella","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Lost in transition - help!","postDate":"1319753311","msgId":63626,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo4Y2tvditrbXFhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDZDODEwRkM4LTlDRTItNDk0Qy05ODhDLUE1OUE1NEQ2RTU0NEB5YWhvby5jb20+"},"prevInTopic":63621,"nextInTopic":63629,"prevInTime":63625,"nextInTime":63627,"topicId":63593,"numMessagesInTopic":0,"msgSnippet":"I assume your daughter is around 5 since she was in Kindergarten. Bear in mind that 5 is really young. Having said that, we had a similar situation when my","messageBody":"<div id=\"ygrps-yiv-1088518208\">I assume your daughter is around 5 since she was in Kindergarten. Bear in mind that 5 is really young. <br/>\n<br/>\nHaving said that, we had a similar situation when my youngest son was about that age.  He and my husband were at odds because my husband felt that what he said should go, no matter what (he felt that meant our son respected him). I posted for help (not sure which group ;&gt;) and someone noticed that it may be specific things that triggered a negative response, and that I should try to better understand what is making him react that way. By really understanding more deeply where he was coming from, I was able to have discussions with him about what was really bothering him, and how it related to his own upbringing. In doing that, we were able to talk about how our baggage is not our kids&#39; baggage, and maybe if we look at the big picture it&#39;s not about winning (or thinking we&#39;re winning based on having compliant childern), but about having a good relationship with our kids. <br/>\n<br/>\nIf you and your husband can agree that a primary goal is to have a solid, positive, long term relationship with your kids, then in the moment you (and he) can decide whether the action you/he take is going to help or harm that. My husband really &quot;got&quot; that.  But even after he did, it took MANY conversations (between hubby and me) to get to their having a more peaceful (and respectful) relationship.  <br/>\n<br/>\nI originally came at it from a defensive posture - this is my baby you&#39;re yelling at, how dare you!  Once I changed gears and thought hey, it&#39;s important that I&#39;m not pitting one against the other by siding with one or the other (and I was usually siding with my son), things started to ease up a bit. <br/>\n<br/>\nMy husband was on board with unschooling immediately, so we didn&#39;t get all the parenting stuff mixed up with that.  It was parenting styles we were discussing, not whether &quot;to school or not to school&quot;.  <br/>\n<br/>\nI don&#39;t think your choices are send her to school so they can have a good relationship, or keep her home and they won&#39;t.  You&#39;re still going to have the tv and respect issues that you&#39;re having whether she&#39;s in school or not.  And you can bet they will be escalated if she is put in school, and especially so if you think then you can blame school for everything (for example telling her the school won&#39;t let her watch more than 2 hours of tv a night).<br/>\n<br/>\nPeaceful parenting can take a lot of self reflection, and a lot of guys are just not that good at that.  Sometimes we need to help them see the &quot;logic&quot; of things (that tv viewing in and of itself does not change behavior, for example) and also help them understand that a 5 year old does not think &quot;oh, my dad was so good to me for letting me do x and y. I won&#39;t challenge him the next time he tells me no or does something I think is rude&quot;.  5 year olds cannot reason in this way (truth be told, adults really don&#39;t reason in this way). <br/>\n<br/>\nA great quote I think about often (I stole this from someone, Sarah Parent, I believe): &quot;You can&#39;t bully someone into being kind&quot;.  This goes for you bullying your husband into being nicer, or for your husband bullying your daughter into respecting him. <br/>\n<br/>\n--Melissa<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, catfish_friend &lt;catfish_friend@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; DD1 has been home from kindergarten for 3 weeks straight.  <br/>\n&gt; <br/>\n&gt; DH has resigned himself to the likelihood of homeschooling DD1, if not unschooling (which scares him) because the number of her absences may require we withdraw.  We have an independent study contract for another week and a half and at that time, need to decide on school or no school.<br/>\n&gt; <br/>\n&gt; My clarity on unschooling has grown exponentially in the short time I&#39;ve spent with DD1 home.  DD1, DD2 and I have deepened our relationships with one another and I feel we are generally looking out for each other more.  What else has transpired is that DH is stressed physically and psychologically with work which he has only recently returned to.  <br/>\n&gt; <br/>\n&gt; What I am seeing develop between him and especially DD1 is DH needing DD1 to see his point of view before he is willing to even consider DD1&#39;s.  Or, when DH is able to see DD1&#39;s perspective, if he feels he has given her a lot of what she&#39;s been asking but then denies her later only to have her scream at him, he gets angry, punishing, threatening verbally, sometimes picking her up roughly and putting her somewhere she does not want to be.  There&#39;s usually a lot of screaming and tears from DD1.<br/>\n&gt; <br/>\n&gt; I have been doing my best to empathize with him, after empathizing with DD1.  I discuss with DD1 in a more calm way what DH&#39;s feelings are, but I feel I am lost here.  <br/>\n&gt; <br/>\n&gt; I have also had my share of not empathizing with DH and outright demanding he stop unacceptable behavior.  On the 2 occasions that has happened, in both instances, DH took pause.  In one, he apologized and the other, he was able to calm down rather than escalate the conflict or lock horns with DD1.<br/>\n&gt; <br/>\n&gt; I don&#39;t feel I have enough tools or insight here and really need some.<br/>\n&gt; <br/>\n&gt; In some ways, I am wondering if unschooling is a worse option than DD1 going to school and being in a more controlled environment (rules, punishments, children&#39;s needs/wants are inferior to adults&#39;) so that DH&#39;s behavior will seem more normal, and that may improve DD1&#39;s relationship to DH at least for now.<br/>\n&gt; <br/>\n&gt; On the other hand, if I am able to find empathy for DH and support his needs, I have hope that nudging our family to unschooling would improve our family overall.  DH has said more than once that some of his most enjoyable times with our DDs was during spring break when DH was the primary caregiver and they had no school schedule to adhere to, and they followed their interests.  So, he has some experience with being unschooly and enjoying it, though he has his doubts of unschooling as a long-term lifestyle.<br/>\n&gt; <br/>\n&gt; From a discussion with him, I already know his biggest fear about unschooling is around TV and DD1 watching it for 2 or more hours and having challenging behavior afterwards.  DH wants DD1 to play and run around more and I am encouraging that the best I can without manipulating DD1.  What I see is that DD1 is challenging to DH because he wants to control DD1&#39;s TV viewing.  I don&#39;t control that, so I don&#39;t have the same conflict.  When I tell this to DH, he firmly believes it&#39;s the TV, not him.  DD1&#39;s school asks families to restrict media during the week, so school would also &quot;normalize&quot; DH&#39;s behavior around TV viewing.<br/>\n&gt; <br/>\n&gt; DH is likely going to be working part-time in 1-2 weeks.  I need to figure out how to balance my desire to live unschooling principles alongside DH&#39;s authoritarian, traditional parenting.<br/>\n&gt; <br/>\n&gt; I&#39;ve had great gains in the connections with my girls and I know that it may likely deteriorate if DD1 goes back to school.  DD1 at this point can articulate clearly that she does not want to go back to school and why.  DD1 has recently been volunteering all kinds of personal thoughts and feelings and fears that I haven&#39;t been privy to in a couple of years.<br/>\n&gt; <br/>\n&gt; I brought my family to a crossroads and I need some help!<br/>\n&gt; <br/>\n&gt; I always appreciate the thoughtfulness and insight I find here.<br/>\n&gt; <br/>\n&gt; Thanks in advance for your input.<br/>\n&gt; <br/>\n&gt; Ceci<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":240358028,"authorName":"kristi_beguin","from":"&quot;kristi_beguin&quot; &lt;foehn_jye@...&gt;","profile":"kristi_beguin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Lost in transition - help!","postDate":"1319736520","msgId":63621,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo4YzRjOCsxNmI0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDZDODEwRkM4LTlDRTItNDk0Qy05ODhDLUE1OUE1NEQ2RTU0NEB5YWhvby5jb20+"},"prevInTopic":63620,"nextInTopic":63626,"prevInTime":63620,"nextInTime":63622,"topicId":63593,"numMessagesInTopic":0,"msgSnippet":"All these negative statements about your husband were blaring at me while I read through your post. ... When you say your husband is resigned to","messageBody":"<div id=\"ygrps-yiv-5677180\">All these negative statements about your husband were blaring at me while I read through your post.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;DH has resigned himself to the likelihood of homeschooling&lt;&lt;<br/>\n<br/>\n&gt;&gt;DH is stressed physically and psychologically with work&lt;&lt;<br/>\n  <br/>\n&gt;&gt;DH gets angry, punishing, threatening verbally, sometimes picking her up roughly &lt;&lt;<br/>\n<br/>\n&gt;&gt;he has his doubts of unschooling as a long-term lifestyle.&lt;&lt;<br/>\n<br/>\n&gt;&gt;his biggest fear about unschooling is around TV&lt;&lt;<br/>\n<br/>\n&gt;&gt; he wants to control DD1&#39;s TV viewing.&lt;&lt;<br/>\n<br/>\n&gt;&gt; DH&#39;s authoritarian, traditional parenting&lt;&lt;<br/>\n<br/>\n </span></blockquote>When you say your husband is &quot;resigned&quot; to homeschooling, it makes it sound like the decision was made without any input from him.  It&#39;s like he gave up, threw up his hands in desperation and proclaimed, I quit.  If he had no say in the decision, he is likely to feel resentment about your decision.  Have you and your husband had the opportunity to REALLY discuss all the options available?<br/>\n  <br/>\nA month ago you said:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;DH and I agreed on not making school compulsory. DH is willing to have them stay home if they make that choice. Because I am ready to keep them home, but don&#39;t want to discount DH&#39;s opinion, we are only pushing things as far away from school as DH is comfortable with.&lt;&lt;<br/>\n<br/>\n </span></blockquote>So, now a month has passed and your daughter doesn&#39;t want to go to school. You said a month ago that your husband was willing to have your daughter stay at home if she made the choice, but now that she&#39;s made the choice, how does he feel? <br/>\n <br/>\nA lot of what you&#39;ve written about your husband&#39;s opinions make it sound like you and he are on different sides of the fence, and you are looking for advice on how to bring him to your side.  It would be better to work on removing the fence, so to speak, so that you can all be in the same field.<br/>\n<br/>\nWhat can you do to make his time at home less stressful?  That&#39;s where I would start.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Lost in transition - help!","postDate":"1319730231","msgId":63620,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE0RTlGMDdELUJFQkUtNEIyQy1CNUIxLUEyRkY1NUE5RDQ1MUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEM0QkY5MjJCLUZBMUQtNDM4Ni1CNzNGLTU3QUVDOTU4M0M0NkB5YWhvby5jb20+","referencesHeader":"PDZDODEwRkM4LTlDRTItNDk0Qy05ODhDLUE1OUE1NEQ2RTU0NEB5YWhvby5jb20+IDxCMUFDRUM1MC0wNEE3LTQ3M0ItQUJGQS1DODdEQ0REN0VCMzRAdmVyaXpvbi5uZXQ+IDw3NTQ4NzU2OS02QTBELTQ4QUEtQjA3Ri1BMDZFMUZDNDBDMkFAeWFob28uY29tPiA8MjkyNzQ1MkMtMUY1OS00Q0VGLTg2RUItRjQwOTQ0Nzg1QjMyQFNhbmRyYWRvZGQuY29tPiA8QzRCRjkyMkItRkExRC00Mzg2LUI3M0YtNTdBRUM5NTgzQzQ2QHlhaG9vLmNvbT4="},"prevInTopic":63619,"nextInTopic":63621,"prevInTime":63619,"nextInTime":63621,"topicId":63593,"numMessagesInTopic":0,"msgSnippet":"An example that might help your husband see what he s doing by turning a tv show off in progress is how he might feel if he was reading a book and someone","messageBody":"<div id=\"ygrps-yiv-550877626\">An example that might help your husband see what he&#39;s doing by turning a tv show off in progress is how he might feel if he was reading a book and someone snatched it up, tore the next few pages out, and threw them in a fire, maybe while muttering about how stupid it was to be reading that book.<br/>\n<br/>\nOne time I was reading a book and someone DID throw it in a fire.  I feel really bad to this day.  I was ten or so, and being babysat for the weekend by a woman I didn&#39;t know well (all four of us girls).  We walked up to her house, quarter of a mile, for her to change clothes or something, and I picked up a book she had there and opened it and started looking.  I guess it was a racy novel or maybe even the 1960&#39;s version of erotica, but what I read wasn&#39;t at all nasty.  Still, when she saw that I had it, one swoop had it into the fire of the cookstove.  She wasn&#39;t mad at me, she was embarrassed, or afraid.   I felt awful; she could&#39;ve just asked me not to read it, and I&#39;d&#39;ve been fine with that, but she destroyed her own book.<br/>\n<br/>\nAnother time, my mom threw out a set of child-development pamphlets rather than let me read them.  I had been reading them, she said no.  I was curious about why not.  They were from Art Linkletter, and a set of six, each one about a stage of child development.  I was nine or ten, I think.  People were really afraid of psychology in those days, like it could be used against people, like it had great power.  And I guess even the government was hoping in those days that it COULD be weaponized. :-)   I still remember what those pamphlets looked and felt like.<br/>\n<br/>\nI also remember thinking those adults weren&#39;t very bright in the way they handled those situations.<br/>\nAnd it made me REALLY think that books were powerful.<br/>\n<br/>\nAny adult who thinks turning a show off will make the child side with the adult over the show will suffer a domino-run of backfire.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/t/economics\">http://sandradodd.com/t/economics</a><br/>\nEconomics of Restricting TV Watching of Children<br/>\n<br/>\nPam Sorooshian<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Lost in transition - help!","postDate":"1319726988","msgId":63619,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEMzNkIyNDMxLUYwQkYtNDcxOC04RENGLTAxQzg4QzE3MDA1OEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDY5NENFODI0LTJFNUUtNDRFRi05QzBFLTM3QUU1Mjg3NzY4QUB5YWhvby5jb20+","referencesHeader":"PDZDODEwRkM4LTlDRTItNDk0Qy05ODhDLUE1OUE1NEQ2RTU0NEB5YWhvby5jb20+IDwxMzE5NjU2MDM2LjYxMzU2LllhaG9vTWFpbFJDQHdlYjg3MzAxLm1haWwuaXJkLnlhaG9vLmNvbT4gPDY5NENFODI0LTJFNUUtNDRFRi05QzBFLTM3QUU1Mjg3NzY4QUB5YWhvby5jb20+"},"prevInTopic":63618,"nextInTopic":63620,"prevInTime":63618,"nextInTime":63620,"topicId":63593,"numMessagesInTopic":0,"msgSnippet":"... Google s Blogspot/Blogger. Very easy to set up. http://www.blogspot.com You can set the privacy on it so it s either public or private. Joyce [Non-text","messageBody":"<div id=\"ygrps-yiv-1008085550\">On Oct 27, 2011, at 9:54 AM, catfish_friend wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Can someone recommend a website to set up a blog easily?<br/>\n<br/>\n<br/>\n </span></blockquote>Google&#39;s Blogspot/Blogger. Very easy to set up.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.blogspot.com\">http://www.blogspot.com</a><br/>\n<br/>\nYou can set the privacy on it so it&#39;s either public or private.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":138778570,"authorName":"catfish_friend","from":"catfish_friend &lt;catfish_friend@...&gt;","profile":"catfish_friend","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Lost in transition - help!","postDate":"1319723666","msgId":63618,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY5NENFODI0LTJFNUUtNDRFRi05QzBFLTM3QUU1Mjg3NzY4QUB5YWhvby5jb20+","inReplyToHeader":"PDEzMTk2NTYwMzYuNjEzNTYuWWFob29NYWlsUkNAd2ViODczMDEubWFpbC5pcmQueWFob28uY29tPg==","referencesHeader":"PDZDODEwRkM4LTlDRTItNDk0Qy05ODhDLUE1OUE1NEQ2RTU0NEB5YWhvby5jb20+IDwxMzE5NjU2MDM2LjYxMzU2LllhaG9vTWFpbFJDQHdlYjg3MzAxLm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":63617,"nextInTopic":63619,"prevInTime":63617,"nextInTime":63619,"topicId":63593,"numMessagesInTopic":0,"msgSnippet":"--//-- Don t expect him to change to suit you or your daughter, but make it easier for him to feel good about life. I ve found that the better I feel about","messageBody":"<div id=\"ygrps-yiv-267865539\">--//-- Don&#39;t expect him to change to suit you or your daughter, but make it easier for him to feel good about life. I&#39;ve found that the better I feel about life, the kinder I am. It works with the rest of my family. The better they feel the kinder they are. --//--<br/>\n<br/>\nThanks so much, Schuyler, for all your suggestions!  Kindness can be contagious.  I have found that the more I am connected to my daughters, the happier and kinder I am to them and to others, too.  Being able to empathize with my girls more does help me empathize with my husband more.  I think I need to work on growing my connection with my husband at least to the degree I work on it with my girls.<br/>\n<br/>\nJust yesterday, my 2.5 and 5 year olds got up, took themselves to the bathroom, washed their faces and brushed their teeth all on their own for the very first time.  My 5 year old asked about watching &quot;Magic Schoolbus&quot; and &quot;Berenstain Bears&quot; and my 2.5 year old wanted to watch &quot;Busytown&quot;.  I asked them to check in with their dad who said, &quot;yes&quot;.  The girls were so happy and I sat down to watch with them when my husband came in and snuggled up to watch with us, too.  We&#39;re all learning...<br/>\n<br/>\n--//-- It will also help if he can see how busy her life is in the moments when he isn&#39;t around. Take pictures, set up a blog, put together a story of all that you&#39;ve done in the day to tell him when he gets home. --//--<br/>\n<br/>\nI&#39;ve been thinking a blog would be a good idea for him and the extended family.  My husband needs time and space to decompress often after work, so a blog could be something he checks when he&#39;s ready to take something in.<br/>\n<br/>\nCan someone recommend a website to set up a blog easily?<br/>\n<br/>\nCeci<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":138778570,"authorName":"catfish_friend","from":"catfish_friend &lt;catfish_friend@...&gt;","profile":"catfish_friend","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Lost in transition - help!","postDate":"1319721226","msgId":63617,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM0QkY5MjJCLUZBMUQtNDM4Ni1CNzNGLTU3QUVDOTU4M0M0NkB5YWhvby5jb20+","inReplyToHeader":"PDI5Mjc0NTJDLTFGNTktNENFRi04NkVCLUY0MDk0NDc4NUIzMkBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDZDODEwRkM4LTlDRTItNDk0Qy05ODhDLUE1OUE1NEQ2RTU0NEB5YWhvby5jb20+IDxCMUFDRUM1MC0wNEE3LTQ3M0ItQUJGQS1DODdEQ0REN0VCMzRAdmVyaXpvbi5uZXQ+IDw3NTQ4NzU2OS02QTBELTQ4QUEtQjA3Ri1BMDZFMUZDNDBDMkFAeWFob28uY29tPiA8MjkyNzQ1MkMtMUY1OS00Q0VGLTg2RUItRjQwOTQ0Nzg1QjMyQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":63603,"nextInTopic":63618,"prevInTime":63616,"nextInTime":63618,"topicId":63593,"numMessagesInTopic":0,"msgSnippet":"... Asking someone to ask in calm words what it is she would like, when it is blatantly obvious, is as disrespectful as turning the show off.","messageBody":"<div id=\"ygrps-yiv-831738249\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;If someone turned off a show I was watching, and if I objected, and if someone asked me to explain in calm words what I didn&#39;t like about the fact that my show had been turned off, I would JUST KEEP SCREAMING.<br/>\n<br/>\n </span></blockquote>Asking someone to ask in calm words what it is she would like, when it is blatantly obvious, is as disrespectful as turning the show off.&lt;&lt;&lt;<br/>\n<br/>\nAgreed.  I should have written that these are things I talk about with my 5 year old after she&#39;s calmed down and she knows that I empathize and understand her frustration.  <br/>\n<br/>\nI am suggesting alternatives to screaming and saying &quot;I hate you!&quot;  Specifically, that she can make a request to her dad in the moment such as, &quot;I&#39;m not done with my show.  Please turn it back on.&quot;  And, as an alternative to telling her dad she hates him, to say something like, &quot;I hate it when you turn off the TV when I&#39;m in the middle of watching my show.&quot;<br/>\n<br/>\nOf course these are obvious to her, but not to her dad.  And  while she can&#39;t change him, she can change her reaction to him.  Her frustration is valid.  I acknowledge that and when she has calmed down -- which can come quickly when her frustration is acknowledged with a calm, assuring presence and words -- I am trying to give her tools to improve her communication with her dad.  This has the added benefit of her dad feeling supported while giving him an additional opportunity to consider our 5 year old&#39;s perspective.<br/>\n<br/>\nCeci</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Lost in transition - help!","postDate":"1319656036","msgId":63603,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTk2NTYwMzYuNjEzNTYuWWFob29NYWlsUkNAd2ViODczMDEubWFpbC5pcmQueWFob28uY29tPg==","inReplyToHeader":"PDZDODEwRkM4LTlDRTItNDk0Qy05ODhDLUE1OUE1NEQ2RTU0NEB5YWhvby5jb20+","referencesHeader":"PDZDODEwRkM4LTlDRTItNDk0Qy05ODhDLUE1OUE1NEQ2RTU0NEB5YWhvby5jb20+"},"prevInTopic":63602,"nextInTopic":63617,"prevInTime":63602,"nextInTime":63604,"topicId":63593,"numMessagesInTopic":0,"msgSnippet":"Be nice to your husband. He s struggling with upheaval on lots of different fronts. Be nice to him. Help your daughter to be nicer to him. When he comes home","messageBody":"<div id=\"ygrps-yiv-231774209\">Be nice to your husband. He&#39;s struggling with upheaval on lots of different <br/>\nfronts. Be nice to him. Help your daughter to be nicer to him. When he comes <br/>\nhome see if you can help her to move to something that he&#39;d like to do with her. <br/>\nWhile he&#39;s having a hard time help him to have a better time. Don&#39;t expect him <br/>\nto change to suit you or your daughter, but make it easier for him to feel good <br/>\nabout life. I&#39;ve found that the better I feel about life, the kinder I am. It <br/>\nworks with the rest of my family. The better they feel the kinder they are. <br/>\n<br/>\n<br/>\nDoes your husband like to watch movies or specific kinds of television? Can you <br/>\nget in more of those things so that you all can snuggle up together and watch <br/>\nsomething? Can you work to have the television off more and other things going <br/>\non more when your husband is around? Can you set up other things to do that will <br/>\nbe more engaging for all of you? Board games, night walks, bat tours, restaurant <br/>\ntrips, late trips to the pool, block building and destroying, races round the <br/>\nhouse, games of hide and seek? Anything that makes it easier for him to find joy <br/>\nin the life you all are leading and less to be nervous about the idea that a <br/>\nchild needs to be moulded away from bad influences. <br/>\n<br/>\n<br/>\nIt will also help if he can see how busy her life is in the moments when he <br/>\nisn&#39;t around. Take pictures, set up a blog, put together a story of all that <br/>\nyou&#39;ve done in the day to tell him when he gets home. He may be feeling really <br/>\ncut off from your lives as his has changed. Make it easier for him to see that, <br/>\neven without the structure that school offers, her life is full of ideas and <br/>\nactivities and exploration. <br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Lost in transition - help!","postDate":"1319649846","msgId":63602,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI5Mjc0NTJDLTFGNTktNENFRi04NkVCLUY0MDk0NDc4NUIzMkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDc1NDg3NTY5LTZBMEQtNDhBQS1CMDdGLUEwNkUxRkM0MEMyQUB5YWhvby5jb20+","referencesHeader":"PDZDODEwRkM4LTlDRTItNDk0Qy05ODhDLUE1OUE1NEQ2RTU0NEB5YWhvby5jb20+IDxCMUFDRUM1MC0wNEE3LTQ3M0ItQUJGQS1DODdEQ0REN0VCMzRAdmVyaXpvbi5uZXQ+IDw3NTQ4NzU2OS02QTBELTQ4QUEtQjA3Ri1BMDZFMUZDNDBDMkFAeWFob28uY29tPg=="},"prevInTopic":63600,"nextInTopic":63603,"prevInTime":63601,"nextInTime":63603,"topicId":63593,"numMessagesInTopic":0,"msgSnippet":"-=-When DH turns off the TV in the middle of DD1 watching it, or before she has agreed to turn it off, DD1 will scream at the top of her lungs and add a","messageBody":"<div id=\"ygrps-yiv-8606491\">-=-When DH turns off the TV in the middle of DD1 watching it, or before she has agreed to turn it off, DD1 will scream at the top of her lungs and add a hurtful statement like, &quot;I hate you!&quot;<br/>\n<br/>\n-=-I&#39;ve mentioned to DH that if he were in the middle of watching his favorite sports team play and someone told him he couldn&#39;t watch it anymore, he&#39;d be pissed, too. That helped DH at least suggest turning off the TV after the current program, but his expectation of DD1 is to obey him quietly and politely comply to his requests (TV, food, plans, etc.).-=-<br/>\n<br/>\nIf he&#39;s not ready to consider unschooling, you should not be pressing it.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/divorce\">http://sandradodd.com/divorce</a><br/>\n<br/>\nFirst, your marriage and family.  Then, maybe, unschooling.<br/>\n<br/>\n<br/>\n-=-My suggestions to DD1 during her screaming disappointment times have included:<br/>\n<br/>\n- taking a deep breath and then another and another<br/>\n- asking her dad in calm words what it is she would like<br/>\n- asking DD1 what exactly she doesn&#39;t like about what DH said or did rather than saying, &quot;I hate you!&quot;-=-<br/>\n<br/>\nIf someone turned off a show I was watching, and if I objected, and if someone asked me to explain in calm words what I didn&#39;t like about the fact that my show had been turned off, I would JUST KEEP SCREAMING.<br/>\n<br/>\nAsking someone to ask in calm words what it is she would like, when it is blatantly obvious, is as disrespectful as turning the show off.<br/>\n<br/>\nPlease use the child&#39;s name instead of &quot;DD1&quot; or write out &quot;my nine-year-0ld&quot; or however old she is.  I keep thinking you&#39;re writing about a one-year-old girl when you write DD1.<br/>\n<br/>\n-=As for placating DH,-=-<br/>\n<br/>\nIf you could write &quot;my husband,&quot; it would be easier to read, too.  We&#39;re not paying by the keystroke here.<br/>\n<br/>\n-=-I see that DH is not prepared to always see DD1&#39;s point of view. He truly believes he knows what&#39;s best for her and that she needs to &quot;listen to her parents&quot; which translates to &quot;obey&quot;. He was raised in a traditional way and I see it in every fiber of his responses to our girls. It&#39;s particularly interesting to me that he was not happy with how he was raised, though.<br/>\n-=-<br/>\n<br/>\nI think it could help you and your husband to read all of these articles by Ben Lovejoy.  Most of them are new to the site, some new as of yesterday:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/benlovejoy\">http://sandradodd.com/benlovejoy</a><br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":138778570,"authorName":"catfish_friend","from":"catfish_friend &lt;catfish_friend@...&gt;","profile":"catfish_friend","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Lost in transition - help!","postDate":"1319648390","msgId":63600,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc1NDg3NTY5LTZBMEQtNDhBQS1CMDdGLUEwNkUxRkM0MEMyQUB5YWhvby5jb20+","inReplyToHeader":"PEIxQUNFQzUwLTA0QTctNDczQi1BQkZBLUM4N0RDREQ3RUIzNEB2ZXJpem9uLm5ldD4=","referencesHeader":"PDZDODEwRkM4LTlDRTItNDk0Qy05ODhDLUE1OUE1NEQ2RTU0NEB5YWhvby5jb20+IDxCMUFDRUM1MC0wNEE3LTQ3M0ItQUJGQS1DODdEQ0REN0VCMzRAdmVyaXpvbi5uZXQ+"},"prevInTopic":63598,"nextInTopic":63602,"prevInTime":63599,"nextInTime":63601,"topicId":63593,"numMessagesInTopic":0,"msgSnippet":"... When DH turns off the TV in the middle of DD1 watching it, or before she has agreed to turn it off, DD1 will scream at the top of her lungs and add a","messageBody":"<div id=\"ygrps-yiv-1864170725\"><blockquote><span title=\"ireply\">&gt; //// Rather than imposing his solution, help her find more appropriate ways to respond to her feelings (if she&#39;s hurting others), other choices to make so the feelings don&#39;t build up. Explore lots of options with her and let her find what works for her. ////<br/>\n<br/>\n </span></blockquote>When DH turns off the TV in the middle of DD1 watching it, or before she has agreed to turn it off, DD1 will scream at the top of her lungs and add a hurtful statement like, &quot;I hate you!&quot;<br/>\n<br/>\nI&#39;ve mentioned to DH that if he were in the middle of watching his favorite sports team play and someone told him he couldn&#39;t watch it anymore, he&#39;d be pissed, too.  That helped DH at least suggest turning off the TV after the current program, but his expectation of DD1 is to obey him quietly and politely comply to his requests (TV, food, plans, etc.).<br/>\n<br/>\nMy suggestions to DD1 during her screaming disappointment times have included:<br/>\n<br/>\n- taking a deep breath and then another and another<br/>\n- asking her dad in calm words what it is she would like<br/>\n- asking DD1 what exactly she doesn&#39;t like about what DH said or did rather than saying, &quot;I hate you!&quot;<br/>\n<br/>\nI would love additional suggestions to offer DD1 to try in those moments of raging disappointment.<br/>\n<br/>\nAs for placating DH, I have made fun outing plans not in immediate response to DH&#39;s turning off the TV but rather as an additional option for our day when DH is not around.  If my DDs are not interested in the plan, I let it go.  <br/>\n<br/>\nIn the moment of DH and DD1 having conflict, I find I am absorbed with first being available to DD1, then helping DD1 find her center, then...?  Sometimes DH will offer up an activity and DD1 chooses to participate.  Sometimes there&#39;s a standoff between them for a while.  This dynamic troubles me.<br/>\n<br/>\nI see that DH is not prepared to always see DD1&#39;s point of view.  He truly believes he knows what&#39;s best for her and that she needs to &quot;listen to her parents&quot; which translates to &quot;obey&quot;.  He was raised in a traditional way and I see it in every fiber of his responses to our girls.  It&#39;s particularly interesting to me that he was not happy with how he was raised, though.<br/>\n<br/>\nCeci</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Lost in transition - help!","postDate":"1319642614","msgId":63598,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUxQ0I4N0IzLUE4MzctNDA2Qi1CMzNCLUFBNzY0MjhFRDc0NEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEIxQUNFQzUwLTA0QTctNDczQi1BQkZBLUM4N0RDREQ3RUIzNEB2ZXJpem9uLm5ldD4=","referencesHeader":"PDZDODEwRkM4LTlDRTItNDk0Qy05ODhDLUE1OUE1NEQ2RTU0NEB5YWhvby5jb20+IDxCMUFDRUM1MC0wNEE3LTQ3M0ItQUJGQS1DODdEQ0REN0VCMzRAdmVyaXpvbi5uZXQ+"},"prevInTopic":63596,"nextInTopic":63600,"prevInTime":63597,"nextInTime":63599,"topicId":63593,"numMessagesInTopic":0,"msgSnippet":"-=- DD1 watching it  for 2 or more hours and having challenging behavior afterwards.-=- I m guessing the challenging behavior is more likely to come from","messageBody":"<div id=\"ygrps-yiv-41647310\">-=- DD1 watching it  for 2 or more hours and having challenging behavior afterwards.-=-<br/>\n<br/>\nI&#39;m guessing the challenging behavior is more likely to come from someone telling her to turn it off, than from the watching it.  <br/>\n<br/>\nI can work at the computer for hours, and walk away because I&#39;m ready to do something else, and be happy. <br/>\nIf someone came and told me to get off of it because it had been two hours, while I was in the middle of editing a page and had a cut-and-paste in my hand, as it were, or I still had e-mail to read, I would not react well.<br/>\n<br/>\n-=- DH  wants DD1 to play and run around more -=-<br/>\n<br/>\nThen he should take her somewhere fun and run with her, play ball with her, race, play tag.  <br/>\n<br/>\nThere was a question at a conference at which I spoke in July, about a mom wanting to make a child practice an instrument daily, because the dad thought it was important for her to play an instrument.  The question I asked was &quot;What instrument does HE play?&quot;<br/>\n<br/>\nIf your husband doesn&#39;t run around more, WHY does he want her to play and run around?<br/>\nIf he does run around, and she wants to go with him, cool.<br/>\nIf she doesn&#39;t want to go with him, he should work on changing that relationship so that she will want to be with him more.  (HINT:  Making her stop doing what she&#39;s doing is not the way to cause her to desire his company.)<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Lost in transition - help!","postDate":"1319637919","msgId":63596,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEIxQUNFQzUwLTA0QTctNDczQi1BQkZBLUM4N0RDREQ3RUIzNEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDZDODEwRkM4LTlDRTItNDk0Qy05ODhDLUE1OUE1NEQ2RTU0NEB5YWhvby5jb20+","referencesHeader":"PDZDODEwRkM4LTlDRTItNDk0Qy05ODhDLUE1OUE1NEQ2RTU0NEB5YWhvby5jb20+"},"prevInTopic":63593,"nextInTopic":63598,"prevInTime":63595,"nextInTime":63597,"topicId":63593,"numMessagesInTopic":0,"msgSnippet":"... A lot of parenting difficulties come from seeing a problem, seeing a solution and turning the solution into the new problem. Rather than imposing his","messageBody":"<div id=\"ygrps-yiv-1904315086\">On Oct 26, 2011, at 5:46 AM, catfish_friend wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; his biggest fear about unschooling is around TV and DD1 watching it  <br/>\n&gt; for 2 or more hours and having challenging behavior afterwards. DH  <br/>\n&gt; wants DD1 to play and run around more and I am encouraging that the  <br/>\n&gt; best I can without manipulating DD1.<br/>\n<br/>\n </span></blockquote>A lot of parenting difficulties come from seeing a problem, seeing a  <br/>\nsolution and turning the solution into the new problem.<br/>\n<br/>\nRather than imposing his solution, help her find more appropriate ways  <br/>\nto respond to her feelings (if she&#39;s hurting others), other choices to  <br/>\nmake so the feelings don&#39;t build up. Explore lots of options with her  <br/>\nand let her find what works for her.<br/>\n<br/>\nAnd then make getting out something you add to her day because its fun  <br/>\nrather than a response to her choosing several hours of TV.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":138778570,"authorName":"catfish_friend","from":"catfish_friend &lt;catfish_friend@...&gt;","profile":"catfish_friend","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Lost in transition - help!","postDate":"1319622377","msgId":63593,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZDODEwRkM4LTlDRTItNDk0Qy05ODhDLUE1OUE1NEQ2RTU0NEB5YWhvby5jb20+"},"prevInTopic":0,"nextInTopic":63596,"prevInTime":63592,"nextInTime":63594,"topicId":63593,"numMessagesInTopic":0,"msgSnippet":"DD1 has been home from kindergarten for 3 weeks straight. DH has resigned himself to the likelihood of homeschooling DD1, if not unschooling (which scares him)","messageBody":"<div id=\"ygrps-yiv-611767452\">DD1 has been home from kindergarten for 3 weeks straight.  <br/>\n<br/>\nDH has resigned himself to the likelihood of homeschooling DD1, if not unschooling (which scares him) because the number of her absences may require we withdraw.  We have an independent study contract for another week and a half and at that time, need to decide on school or no school.<br/>\n<br/>\nMy clarity on unschooling has grown exponentially in the short time I&#39;ve spent with DD1 home.  DD1, DD2 and I have deepened our relationships with one another and I feel we are generally looking out for each other more.  What else has transpired is that DH is stressed physically and psychologically with work which he has only recently returned to.  <br/>\n<br/>\nWhat I am seeing develop between him and especially DD1 is DH needing DD1 to see his point of view before he is willing to even consider DD1&#39;s.  Or, when DH is able to see DD1&#39;s perspective, if he feels he has given her a lot of what she&#39;s been asking but then denies her later only to have her scream at him, he gets angry, punishing, threatening verbally, sometimes picking her up roughly and putting her somewhere she does not want to be.  There&#39;s usually a lot of screaming and tears from DD1.<br/>\n<br/>\nI have been doing my best to empathize with him, after empathizing with DD1.  I discuss with DD1 in a more calm way what DH&#39;s feelings are, but I feel I am lost here.  <br/>\n<br/>\nI have also had my share of not empathizing with DH and outright demanding he stop unacceptable behavior.  On the 2 occasions that has happened, in both instances, DH took pause.  In one, he apologized and the other, he was able to calm down rather than escalate the conflict or lock horns with DD1.<br/>\n<br/>\nI don&#39;t feel I have enough tools or insight here and really need some.<br/>\n<br/>\nIn some ways, I am wondering if unschooling is a worse option than DD1 going to school and being in a more controlled environment (rules, punishments, children&#39;s needs/wants are inferior to adults&#39;) so that DH&#39;s behavior will seem more normal, and that may improve DD1&#39;s relationship to DH at least for now.<br/>\n<br/>\nOn the other hand, if I am able to find empathy for DH and support his needs, I have hope that nudging our family to unschooling would improve our family overall.  DH has said more than once that some of his most enjoyable times with our DDs was during spring break when DH was the primary caregiver and they had no school schedule to adhere to, and they followed their interests.  So, he has some experience with being unschooly and enjoying it, though he has his doubts of unschooling as a long-term lifestyle.<br/>\n<br/>\nFrom a discussion with him, I already know his biggest fear about unschooling is around TV and DD1 watching it for 2 or more hours and having challenging behavior afterwards.  DH wants DD1 to play and run around more and I am encouraging that the best I can without manipulating DD1.  What I see is that DD1 is challenging to DH because he wants to control DD1&#39;s TV viewing.  I don&#39;t control that, so I don&#39;t have the same conflict.  When I tell this to DH, he firmly believes it&#39;s the TV, not him.  DD1&#39;s school asks families to restrict media during the week, so school would also &quot;normalize&quot; DH&#39;s behavior around TV viewing.<br/>\n<br/>\nDH is likely going to be working part-time in 1-2 weeks.  I need to figure out how to balance my desire to live unschooling principles alongside DH&#39;s authoritarian, traditional parenting.<br/>\n<br/>\nI&#39;ve had great gains in the connections with my girls and I know that it may likely deteriorate if DD1 goes back to school.  DD1 at this point can articulate clearly that she does not want to go back to school and why.  DD1 has recently been volunteering all kinds of personal thoughts and feelings and fears that I haven&#39;t been privy to in a couple of years.<br/>\n<br/>\nI brought my family to a crossroads and I need some help!<br/>\n<br/>\nI always appreciate the thoughtfulness and insight I find here.<br/>\n<br/>\nThanks in advance for your input.<br/>\n<br/>\nCeci</div>","specialLinks":[]}],"prevTopicId":63681,"nextTopicId":63682}}