{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":39764976,"authorName":"Alan & Brenda Leonard","from":"Alan & Brenda Leonard &lt;abtleo@...&gt;","profile":"abtleo","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"doing for others","postDate":"1042283145","msgId":54289,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBNDVCNkYwLjFBRDklYWJ0bGVvQGVhcnRobGluay5uZXQ+","inReplyToHeader":"PDEwNDIyNjE5MDYuMjQ4OS43ODUxMy5tM0B5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":54288,"nextInTime":54290,"topicId":54289,"numMessagesInTopic":0,"msgSnippet":"I don t really have any perspective on Rachel Anne s concerns, but I was a little bothered by Teresa G s comments. ... Really?  When I go to visit my parents","messageBody":"<div id=\"ygrps-yiv-2018339241\">I don&#39;t really have any perspective on Rachel Anne&#39;s concerns, but I was a<br/>\nlittle bothered by Teresa G&#39;s comments.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; What I mean is: let&#39;s say I&#39;m visiting my mom.  If she fixed my bowl of<br/>\n&gt; cereal, picked up my dirty clothes, whatever, I&#39;d feel as though she was<br/>\n&gt; treating me like a child.  I would feel that she thought I was an imbecile who<br/>\n&gt; couldn&#39;t care for herself.<br/>\n&gt; <br/>\n </span></blockquote>Really?  When I go to visit my parents my Dad often fixes breakfast and<br/>\nserves it to me at the table.  It&#39;s one way he makes me feel welcome.  It&#39;s<br/>\nnever made me think they thought me incapable of taking care of myself,<br/>\nbecause I see it as an act of love.<br/>\n<br/>\nMy Mom usually comes up to get dirty laundry, if I stay a few days, and if<br/>\nI&#39;ve done my usual and it&#39;s just in a heap somewhere, she&#39;ll pick it up and<br/>\nwash it.  I invariably tell her she doesn&#39;t have to do that for me, and she<br/>\nalways tells me that she doesn&#39;t get to &quot;baby&quot; me much anymore.  Considering<br/>\nhow poorly we get along most of the time, I appreciate a generous action<br/>\nlike that.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If it were a situation where I lived there and she continued to do<br/>\n&gt; &quot;everything&quot; for me, I&#39;d also start wondering why she seemed to have no<br/>\n&gt; respect for herself.  I DO think that part of living in a family means that<br/>\n&gt; everyone is responsible to everyone else-- creating a mess and then expecting<br/>\n&gt; someone else to clean it up for you is disrespectful.  If this occurred in my<br/>\n&gt; household and I&#39;d made a mess and my mom cleaned it up, I&#39;d feel as though she<br/>\n&gt; was allowing herself to be treated more like a servant than a mom.<br/>\n<br/>\n </span></blockquote>Since discussing parents can be loaded with old issues, think of this from<br/>\nyour children&#39;s point of view.  Do they really make a mess and *expect* you<br/>\nto clean it up?  Or are you bothered by the mess sooner than they are, so<br/>\nyou are the one who cleans it up?  If you left the mess for the mess-maker<br/>\nto deal with, would it happen?  If the mess is in a public area, would a<br/>\nsimple, calm comment that it&#39;s in the way get it picked up when someone had<br/>\na moment?  <br/>\n<br/>\nAnd also, do you really feel like you&#39;re being treated like a servant when<br/>\nyou clean up for your children?  Sometimes that&#39;s the only gift we can give<br/>\nour kids. <br/>\n<br/>\nWe had a 14-year old boy live with us one summer while his mother was<br/>\ndealing with her problems.  He didn&#39;t need me to help him get dressed, or<br/>\ngive him a bath, read to him, or whatever because he did all those things by<br/>\nhimself (unlike my son, who still needed those things)!   But I often made<br/>\nhim a sandwich before he went out, did his laundry, and picked up the<br/>\nmagazines strewn around his bed that he&#39;d flipped through the night before.<br/>\nThose were ways I could show him I cared.  It was a gift.  I know he said<br/>\nseveral times that his Mom never did stuff for him.  I told him I enjoyed<br/>\ndoing it, and I had.<br/>\n<br/>\nThat was 2 years ago.  I talked to him on the phone last night.  He called<br/>\nme in Germany because he had a problem and thought I could help.  I don&#39;t<br/>\nrecall any great advice I shelled out that summer, but the little stuff<br/>\nbuilt our relationship.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Maybe that&#39;s just me-- but I think that there&#39;s a certain level of give & take<br/>\n&gt; here.  <br/>\n<br/>\n </span></blockquote>I&#39;d be concerned if there was no give and take, but I really wonder if part<br/>\nof the issue is our attitudes as Mom.<br/>\n<br/>\nbrenda</div>","specialLinks":[]}],"prevTopicId":54275,"nextTopicId":54299}}