{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"The O&#39;Donnells","from":"The O&#39;Donnells &lt;praxis@...","replyTo":"LIST","senderId":"noy_oO2f9Bf_4PkUCa1wWjf8XHoqrlxYDVPSCWT6nPFTAPv2AVxXAABUeWH1gEErXkKgWokFpub5tmos2Mi25pG5n0ItJMvq9w","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Unschooling success","postDate":"936931259","msgId":2851,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4yMDAuMjg1MS45NTkyNjk3NDJAZUdyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":2850,"nextInTime":2852,"topicId":2851,"numMessagesInTopic":0,"msgSnippet":"Hi all! After all my concerns of recent I just have to share with you today s victories! This morning started out with my scheduling daughter scheduling once","messageBody":"<div id=\"ygrps-yiv-262984066\">Hi all!<br/>\n<br/>\nAfter all my concerns of recent I just have to share with you today&#39;s<br/>\nvictories!<br/>\n<br/>\nThis morning started out with my scheduling daughter scheduling once again<br/>\n- right down to question time and bathroom breaks!  Sparing you all the<br/>\ndetails the root of the problem came out.  The tears started flowing and I<br/>\nlearned that she was so aware that her old friends were back in school -<br/>\nschool buses going up and down the road, not hearing from the few she heard<br/>\nfrom during the summer, etc.  She was having a hard time with the whole<br/>\nthing (this is only our 2nd year hsing.)  After a much needed talk (this is<br/>\nwhat dd is like - a volcano - she builds up pressure, builds up pressure,<br/>\nmanifests it in strange ways (schedules in this case) and then explodes on<br/>\nme) she started playing joyfully like a trooper.  We even turned the whole<br/>\nschedule thing into an unschooling lesson about scheduling our time and how<br/>\nnot to try to force it on others!  In tears she told me &quot;I guess I have<br/>\nbeen trying to make our school seem like ps, huh?&quot;  Bless her heart.  They<br/>\ngo through so much sometimes.  <br/>\n<br/>\nShe wanted to tear up the schedule but I wouldn&#39;t let her.  We talked about<br/>\nhow it had helped her and that having a schedule in her private time was<br/>\nfine if that is what SHE wanted.  But I wouldn&#39;t go there!  They both<br/>\nreally learned so much from this.  Funny how it all worked out.<br/>\n<br/>\nThen after basically blowing off the day (compared to our other days) we<br/>\ncame home and &quot;did&quot; our math (no, don&#39;t throw tomatoes at me :o)  Only to<br/>\nrun across an introduction to division problem that my 6 yo took on with<br/>\nglee.  Something we had been doing together that I knew clicked with her in<br/>\ndivision I showed her on paper - she lit up like a light bulb and took off<br/>\nlike a tornado with division problems.  &quot;Mom make up some problems for me<br/>\nin division.&quot;  She learned the two ways to write division problems on<br/>\npaper, worked about 30 problems, used apples as counters (we picked apples<br/>\ntoday as well) and when she got to a problem that needed a decimal point<br/>\nshe mastered that too!  Yikes!  Try to stop her.   She bypassed that math<br/>\nbook at warp speed!  <br/>\n<br/>\nSo you Minquon (sp?) math lovers out there - is there a web site I can<br/>\nvisit?  I really saw tonight how the text book dumbs the kids down a lot!<br/>\nDD was really moving along until she started back with the apples and doing<br/>\nwhat they did in the book - it is like it gets more complicated than<br/>\nnecessary and boggles their little brains.  No wonder my older dd feels<br/>\nlike she is too stupid to do math - she is probably beating her head<br/>\nagainst imaginary walls trying to figure out the obvious.<br/>\n<br/>\nThen oldest daughter was typing and decided she wanted to learn proper<br/>\nkeyboard placement of her fingers - so I wrote her some exercises to start<br/>\noff with.  We will see how that goes.  Anyone know of a good source for her<br/>\nto use in this endeavor?<br/>\n<br/>\nOK, so Mom had a pretty good unschooling/deschooling day herself!  :o)<br/>\nIn His Service,<br/>\n<br/>\nLaraine<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:praxis@...\">praxis@...</a></div>","specialLinks":[]}],"prevTopicId":2774,"nextTopicId":2807}}