{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Generalizations vs Specifics","postDate":"1264650781","msgId":50168,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEIzREFBMEI3LTAzNTctNENGNC1COUNBLUExNUYyOEE4MDkyMEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDc5YzFkMWI0MTAwMTI3MTkyN240N2RiYjZjN3QzN2Q5ZGU0NWYzZjljODY4QG1haWwuZ21haWwuY29tPg==","referencesHeader":"PGhqcXMxcStpaTR2QGVHcm91cHMuY29tPiA8NzljMWQxYjQxMDAxMjcxOTI3bjQ3ZGJiNmM3dDM3ZDlkZTQ1ZjNmOWM4NjhAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":50167,"nextInTopic":0,"prevInTime":50167,"nextInTime":50169,"topicId":50165,"numMessagesInTopic":0,"msgSnippet":"-=-I smile because I know its going to be an adventure. I smile because I m going to get fabulous postcards. -=- Sometimes I get notes from people, and it s","messageBody":"<div id=\"ygrps-yiv-2123371249\">-=-I smile because I know its going to be an adventure. I smile because<br/>\nI&#39;m going to get fabulous postcards. -=-<br/>\n<br/>\nSometimes I get notes from people, and it&#39;s really wonderful.  I got  <br/>\nChristmas cards and that warmed my whole house and heart.<br/>\n<br/>\n<br/>\n-=-How it ends? I don&#39;t know till I&#39;m done. Sometimes I even don&#39;t  <br/>\nknow then.-=-<br/>\n<br/>\nI don&#39;t know whether it will ever end.  I don&#39;t know what jobs and  <br/>\neducation and partners and children my own children will have.  I  <br/>\ndon&#39;t know if they&#39;ll be happy for their whole lives.  I don&#39;t know  <br/>\nwhether they&#39;ll help other people unschool or whether they&#39;ll get  <br/>\ntired of the subject.  I don&#39;t know if I&#39;ll help for the rest of my  <br/>\nlife or become exhausted and change hobbies.  I don&#39;t know.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Generalizations vs Specifics","postDate":"1264650341","msgId":50167,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlFRDAzNzA1LTdGRjEtNDJCNy04QjUzLUJDNTFEN0REQkE2RkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhqcXMxcStpaTR2QGVHcm91cHMuY29tPg==","referencesHeader":"PGhqcXMxcStpaTR2QGVHcm91cHMuY29tPg=="},"prevInTopic":50166,"nextInTopic":50168,"prevInTime":50166,"nextInTime":50168,"topicId":50165,"numMessagesInTopic":0,"msgSnippet":"-=Old thinking Children need to go to sleep before they get too over tired and you miss the window . Last night Twyla was really excited. She was practicing","messageBody":"<div id=\"ygrps-yiv-929010737\">-=Old thinking &quot;Children need to go to sleep before they get too over  <br/>\ntired and you miss the window&quot;. Last night Twyla was really excited.  <br/>\nShe was practicing walking on the the bed and experimenting with  <br/>\nthrowing herself backwards. It started getting &#39;late&#39;. She started  <br/>\nplaying peekaboo and giggling. Then she got off the bed and went to  <br/>\nher book shelf and pulled lots of books off the shelf. She chose one  <br/>\nto read. She wanted me to read it over and over again. I read it about  <br/>\n10 times. It got a bit later. I started getting tired and went to lie  <br/>\ndown. She came and joined me and fell asleep almost immediately on my  <br/>\nbreast. -=-<br/>\n<br/>\nFor me, when Kirby was a baby, I believed the La Leche League Leaders  <br/>\nand the books I was reading about nursing, and about trusting babies  <br/>\nto know when they were full, or when they were hungry.<br/>\n<br/>\nThe sleeping stuff, I discovered on my own.  Keith and I were out a  <br/>\ncouple of times a week, and had people coming to our house to sing one  <br/>\nnight a week, and it was easy to take Kirby with us and let him fall  <br/>\nasleep on us, or in the car, or wherever.  It was very peaceful.  And  <br/>\naccepting that he might to to sleep early and wake up in the middle of  <br/>\nthe night wasn&#39;t so bad.  And sometimes he stayed awake until 10:00  <br/>\nand slept a long time.<br/>\n<br/>\nSometimes I would get kids to sleep by playing tapes they knew well,  <br/>\nand that were common bedtime tapes, but I would often stay with them,  <br/>\ntoo, and let them fall asleep next to me even when they were through  <br/>\nnursing.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":326782993,"authorName":"Vidyut Kale","from":"Vidyut Kale &lt;wide.aware@...&gt;","profile":"vidyutgore","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Generalizations vs Specifics","postDate":"1264649227","msgId":50166,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc5YzFkMWI0MTAwMTI3MTkyN240N2RiYjZjN3QzN2Q5ZGU0NWYzZjljODY4QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGhqcXMxcStpaTR2QGVHcm91cHMuY29tPg==","referencesHeader":"PGhqcXMxcStpaTR2QGVHcm91cHMuY29tPg=="},"prevInTopic":50165,"nextInTopic":50167,"prevInTime":50165,"nextInTime":50167,"topicId":50165,"numMessagesInTopic":0,"msgSnippet":"Thank you for sharing this is beautiful. I enjoy being in a place of standing on the edge of discovery. Its like standing with a beautiful waterfall at my","messageBody":"<div id=\"ygrps-yiv-432657516\">Thank you for sharing this is beautiful.<br/>\n<br/>\nI enjoy being in a place of standing on the edge of discovery. Its like<br/>\nstanding with a beautiful waterfall at my feet. I&#39;m already in the water,<br/>\nholding on, trying to understand where this all goes. I have a fair idea,<br/>\nbut I am yet to be there. A point comes, when I let go, or I&#39;ve unknowingly<br/>\nloosened my grip on the rocks and the current takes me on the ride I was<br/>\nstanding on the edge of. I&#39;m in. Its thrilling.<br/>\n<br/>\nBecause these edges of discovery bring me so much joy, I see another<br/>\nstanding there, describing the view of the journey tempting them, and I<br/>\nsmile. I smile because I know its going to be an adventure. I smile because<br/>\nI&#39;m going to get fabulous postcards. I smile because who knows, I&#39;m going to<br/>\nread those postcards and go and stand on that edge myself.<br/>\n<br/>\nHow it ends? I don&#39;t know till I&#39;m done. Sometimes I even don&#39;t know then.<br/>\nbut its great fun to have this new environment rushing around me, battering,<br/>\nchanging me, cushioning me. I often find that I can only reach those edges<br/>\nwhen I have the capacity for undertaking the journey in me.<br/>\n<br/>\nWhen I stand there and never let go, the water flowing on and on and on<br/>\nmakes me jealous. Why is it that I can&#39;t go that easily? Its easy for the<br/>\nwater to get dashed on the rocks. The more jealous I feel, the more I call<br/>\nmyself bored.<br/>\n<br/>\nVidyut<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":40442835,"authorName":"lillybluelilly","from":"&quot;lillybluelilly&quot; &lt;lillyblue27@...&gt;","profile":"lillybluelilly","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Generalizations vs Specifics","postDate":"1264644986","msgId":50165,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhqcXMxcStpaTR2QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":50166,"prevInTime":50164,"nextInTime":50166,"topicId":50165,"numMessagesInTopic":0,"msgSnippet":"My name is Lilly, I am 39 years old and my daughter Twyla is 14 months. I am exploring the space between the fears that evoke knee jerk reactions in me and the","messageBody":"<div id=\"ygrps-yiv-1069227770\">My name is Lilly, I am 39 years old and my daughter Twyla is 14 months. I am exploring the space between the fears that evoke knee jerk reactions in me and the reality of bringing the principles of Unschooling into our home. I am watching how ingrained ideas about child safety and health can get in the way of the reality of my daughter and her needs, experiences and abilities. I am moving from generalizations and fear, to trust and presence with my daughter and the reality of each moment. <br/>\n<br/>\nFor example my old thinking says &quot;it is unsafe for children to play with money because they could swallow it and choke.&quot; Twyla noticed jars of coins sitting on my desk. She clearly wanted to play with them. I sat with her on the floor and she poured all the coins out of the glass jar, then put them all carefully back in. Then she put the coins in her pram. She put a few in her mouth, then spat them out and handed them to me saying &quot;Ta Mama&quot;. <br/>\n<br/>\nOld thinking &quot;It is unhealthy for a child under two to watch television&quot;. At a friends place Twyla found the television remote control and learned which button turned the TV on. She turned it on and off over and over again. She learned how to change the channels, and change the volume, and turn on the blue screen for watching DVD&#39;s. She loved looking at the blue screen and turning it from black to blue. If I had said no because of my fear and judgement I would never have witnessed such beautiful moments of exploration and discovery.<br/>\n<br/>\nOld thinking &quot;Children need to go to sleep before they get too over tired and you miss the window&quot;. Last night Twyla was really excited. She was practicing walking on the the bed and experimenting with throwing herself backwards. It started getting &#39;late&#39;. She started playing peekaboo and giggling. Then she got off the bed and went to her book shelf and pulled lots of books off the shelf. She chose one to read. She wanted me to read it over and over again. I read it about 10 times. It got a bit later. I started getting tired and went to lie down. She came and joined me and fell asleep almost immediately on my breast. <br/>\n<br/>\nThere is a huge gap between general fears and the reality of Twyla and the precious moments of her life. <br/>\n<br/>\nI am just at the very beginning of learning how to bring the principles of Unschooling into the heart of our lives. I am enjoying the process. <br/>\n<br/>\nDoes anyone know of any groups or Unschoolers in Sydney, Australia? <br/>\n<br/>\nHave a wonderful day<br/>\n<br/>\nLilly</div>","specialLinks":[]}],"prevTopicId":50143,"nextTopicId":49936}}