{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Very sweet post from Schuyler","postDate":"1273509176","msgId":54012,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYyNTU2My4yOTEzMi5xbUB3ZWI4MTUwMy5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PDhDQ0JDRDVDNzk0RkYzMi0xOTU4LTE0ODU3QHdlYm1haWwtbTA1MC5zeXNvcHMuYW9sLmNvbT4=","referencesHeader":"PDhDQ0JDRDVDNzk0RkYzMi0xOTU4LTE0ODU3QHdlYm1haWwtbTA1MC5zeXNvcHMuYW9sLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":54011,"nextInTime":54013,"topicId":54012,"numMessagesInTopic":0,"msgSnippet":"I hope it is OK to bring this post here from another list. Schuyler has been on a roll today and this post is beautiful and inspiring. She was answering a","messageBody":"<div id=\"ygrps-yiv-1739453377\">I hope it is OK to bring this post here from another list.<br/>\nSchuyler has been on a roll today and this post is beautiful and inspiring.<br/>\nShe was answering a mom asking about her daughters leaving their bikes outside and what she should do.<br/>\n<br/>\n<br/>\nAlex <br/>\n <br/>\n-=-=-<br/>\n<br/>\n  <br/>\nIt is easy to fall prey to the idea that when you do for someone else they are in a position of taking advantage of you. When you see someone doing something fun and you know that you have to go and be responsible, it&#39;s easy to have the parable of the ant and the grasshopper run through your mind. It takes turning the idea over to look and see how by doing something for someone else you are loving them in the most wonderful of ways. Meredith wrote of George running outside in the rain, in the middle of the night to roll up her car windows. I doubt that he is feeling the least bit resentful when he does that. <br/>\n<br/>\nPeople have written beautifully about changing their perspective about chores and moving it to setting up the next moment of play for a child. http://sandradodd. com/chores/ shift has some, and you can back up a level to http://sandradodd. com/chores and read some more if you want. Rue Kream wrote: &quot;Jon and I do not see housework as a<br/>\nchore. We do it cheerfully, in order to make our home a place we all <br/>\nenjoy.&quot;<br/>\n<br/>\nI&#39;ve found, in my own experience that the more I do for Simon and for Linnaea and for David the more they do for me. David and I were talking about it a couple of days ago, how generous our lives are, how not mean. We work (maybe work isn&#39;t the right word, maybe play is better) we play to infuse our lives with joy and generousity and yesses and the things that make us, each of us, feel good. <br/>\n<br/>\nSome of the things are easy, some of the things are pleasure all round. I like creating food, so making rhubarb jam and bagels and cream cheese and butter and fresh bread and brownies and those kinds of things are easy for me, are an easy gift to offer because I so enjoy the process. David likes taking care of the cars, so keeping our cars safe and running and problem solving and thinking about them and getting on-line looking for solutions, those are an absolute joy of service for him to give and for me to receive. Linnaea likes doing that to and will hang outside with him, they put a new exhaust on our van together, chatting and lifting and laughing. Some things take thought, bringing a cup of tea to someone whose busy, or putting together a platter of food for Simon when he&#39;s not sure what he&#39;s craving. And some things take picturing the outcome to make them pleasurable, like putting away the clothes. Fortunately I know from experience that when I put<br/>\naway Linnaea&#39;s clothes she&#39;ll find something exciting and fantastic to wear and I&#39;ll know very quickly the fruits of my labours. So when I sort and fold I can picture her dancing and smiling to keep me going. <br/>\n<br/>\nOur rich and generous life means each of us often overflows with an ability to give to each other. Last night, Simon was snuggled up with David and Linnaea and I were snuggled up and we were all watching a new episode of Family Guy. I asked Linnaea if she would go and get a frozen grape for me and she danced into the kitchen and got one for me and one for Simon and one for herself (David doesn&#39;t like to eat that late in the day). None of the body language accompanied her favour to me that I can remember having when I was asked to do something, even something so small, by my mom or my dad. Far more often then not a request for help is met with a yes. And when it isn&#39;t, when a no is given, well, that&#39;s okay too. <br/>\n<br/>\nPutting away a bike means that the next time they want to ride it&#39;ll be dry, means that you care for them, means that your need for bikes being put away are met and that their needs for moving on to the next interesting thing in their day is met, means that maybe you&#39;ll be the one to see the cool thing skittering under the canoe or the way the spokes make a shadow on the lawn or whatever it is that is outside in that instance of your gift of service, of love. Puting away a bike is a small act of love and generousity and it will beget love and generousity in far greater measure than requiring an act from your children. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n____________ _________ _________ __<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":53740,"nextTopicId":53949}}