{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":49412617,"authorName":"coyote&#39;s corner","from":"&quot;coyote&#39;s corner&quot; &lt;janis@...&gt;","profile":"calourojm","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"[Stumps] Green Eggs and Subversion, Dr Seuss, Toronto Globe,20031123","postDate":"1070055794","msgId":17449,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAyM2QwMWMzYjVmOCRhMGRhMTZmMCRmNmMxZTA0NEBBb3Blbj4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":17448,"nextInTime":17450,"topicId":17449,"numMessagesInTopic":0,"msgSnippet":"Here it is.... Peace, Janis ... From: coyote s corner  To:  Sent: Monday, November 24, 2003 6:57","messageBody":"<div id=\"ygrps-yiv-1979417425\">Here it is....<br/>\nPeace,<br/>\nJanis<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- <br/>\nFrom: &quot;coyote&#39;s corner&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:coyote@...\">coyote@...</a>&gt;<br/>\nTo: &lt;alwaysLearning@yahoogroups. com&gt;<br/>\nSent: Monday, November 24, 2003 6:57 AM<br/>\nSubject: Fw: [Stumps] Green Eggs and Subversion, Dr Seuss, Toronto<br/>\nGlobe,20031123<br/>\n<br/>\n<br/>\n&gt; Good Morning,<br/>\n&gt; As a follow-up to the &quot;Cat in the Hat&quot; posts...I thought I&#39;d send this in.<br/>\n&gt; It offers great information about the books and the author....<br/>\n&gt; Peace,<br/>\n&gt; Janis<br/>\n&gt; Coyotes Corner<br/>\n&gt; Very Cool Stuff for the World<br/>\n&gt; Free Shipping until Dec. 21st!!<br/>\n&gt; &lt;www.coyotescorner.com&gt;<br/>\n&gt; 401-438-7678<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Sent: Sunday, November 23, 2003 5:10 PM<br/>\n&gt; Subject: [Stumps] Green Eggs and Subversion, Dr Seuss, Toronto<br/>\n&gt; Globe,20031123<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &gt;<br/>\n&gt;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.globeandmail.com/servlet/story/RTGAM.20031123.wseuss1123/BNStory/Entertainment/\">http://www.globeandmail.com/servlet/story/RTGAM.20031123.wseuss1123/BNStory/Entertainment/</a><br/>\n&gt; &gt;<br/>\n&gt; &gt; Green eggs and subversion<br/>\n&gt; &gt;<br/>\n&gt; &gt; By SARAH MILROY<br/>\n&gt; &gt; Globe and Mail Update<br/>\n&gt; &gt;<br/>\n&gt; &gt; POSTED AT 8:57 AM EST Sunday, Nov. 23, 2003<br/>\n&gt; &gt;<br/>\n&gt; &gt; Dr. Seuss. Even his name is a mystery. We all know the characters he<br/>\n&gt; created:<br/>\n&gt; &gt; the Grinch (which he claimed was a self-portrait), Horton the Elephant,<br/>\n&gt; the<br/>\n&gt; &gt; Star-Belly Sneetches, the Whos and, of course, his most famous creation,<br/>\n&gt; the<br/>\n&gt; &gt; Cat in the Hat, who springs to the silver screen across North America<br/>\nthis<br/>\n&gt; &gt; weekend in his newest, Mike Myers incarnation.<br/>\n&gt; &gt;<br/>\n&gt; &gt; But who the deuce was Seuss? Tell me, oh tell me, oh tell me, by Zeus!<br/>\n&gt; &gt;<br/>\n&gt; &gt; I&#39;ll tell you, I&#39;ll tell you, I&#39;ll tell you, by Zeus, in a way that I<br/>\npray<br/>\n&gt; &gt; will be not too abstruse.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Theodor Seuss Geisel, who died at 87 in his La Jolla, Calif., home on<br/>\n&gt; Sept.<br/>\n&gt; &gt; 24, 1991, was born in Springfield, Mass., the son of a brew master of<br/>\n&gt; German<br/>\n&gt; &gt; ancestry. With prohibition, his father lost his business and became the<br/>\n&gt; local<br/>\n&gt; &gt; parks superintendent responsible for, among other things, the zoo. His<br/>\nson<br/>\n&gt; &gt; Theodor liked to hang about the cages, drawing the animals.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Geisel went on to be educated at Dartmouth College and then at Oxford<br/>\n&gt; (where<br/>\n&gt; &gt; he studied Voltaire and Swift), coming back to the United States in 1927<br/>\n&gt; to<br/>\n&gt; &gt; work as creative talent in the advertising industry. Esso, NBC Radio and<br/>\n&gt; Ford<br/>\n&gt; &gt; were among his clients. Later, during the Second World War, he also<br/>\ntried<br/>\n&gt; his<br/>\n&gt; &gt; hand as a political cartoonist, publishing his rambunctious anti-fascist<br/>\n&gt; &gt; satires in Judge, Vanity Fair, Life and PM, the legendary left-wing New<br/>\n&gt; York<br/>\n&gt; &gt; newspaper. In 1941, Geisel was conscripted to work in the U.S. Special<br/>\n&gt; &gt; Services Division&#39;s Signal Corps Unit in Hollywood, under Frank Capra,<br/>\n&gt; &gt; creating films such as Hitler Lives and Design for Death -- both of<br/>\nwhich<br/>\n&gt; won<br/>\n&gt; &gt; Oscars.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Meanwhile, back in 1937, he had launched himself as a children&#39;s book<br/>\n&gt; writer<br/>\n&gt; &gt; and illustrator with the publication of And to Think That I Saw it on<br/>\n&gt; Mulberry<br/>\n&gt; &gt; Street (which was rejected by 27 publishers before he found a taker). To<br/>\n&gt; date,<br/>\n&gt; &gt; Geisel&#39;s 61 works for children have sold more than a half-billion copies<br/>\n&gt; &gt; around the world.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Next year, their maker will be celebrated across the United States with<br/>\na<br/>\n&gt; &gt; series of &quot;Seussentennial&quot; events marking the 100th anniversary of his<br/>\n&gt; birth<br/>\n&gt; &gt; -- from touring theatre shows to art exhibitions -- all generated by the<br/>\n&gt; &gt; California-based Dr. Seuss Enterprises, a privately owned company headed<br/>\n&gt; up by<br/>\n&gt; &gt; his widow, Audrey.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Canada, too, is getting in on the act. This month, as theatre queues are<br/>\n&gt; &gt; forming across the land for The Cat in the Hat, the Art Gallery of Nova<br/>\n&gt; Scotia<br/>\n&gt; &gt; is Grinching it up with their own Whoville extravaganza: elaborate stage<br/>\n&gt; sets<br/>\n&gt; &gt; and murals of Seuss décor, which frame drawings borrowed from the<br/>\n&gt; Mandeville<br/>\n&gt; &gt; Special Collections Library at the University of California at San<br/>\nDiego,<br/>\n&gt; the<br/>\n&gt; &gt; repository of Geisel&#39;s drawings and papers.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Despite all this attention, the author&#39;s motivations in writing the<br/>\nworks<br/>\n&gt; are<br/>\n&gt; &gt; still largely unexplored, or worse, dismissed as mere whimsy. We even<br/>\n&gt; &gt; pronounce his name wrong. Seuss, in fact, rhymes with &quot;zoice&quot; -- it was<br/>\n&gt; &gt; Geisel&#39;s mother&#39;s maiden name. (His outsider status as a child of German<br/>\n&gt; &gt; immigrant stock contributed, no doubt, to his lifelong shyness and<br/>\n&gt; distrust of<br/>\n&gt; &gt; the limelight. During the First World War, he was nicknamed &quot;the Kaiser&quot;<br/>\n&gt; by<br/>\n&gt; &gt; his schoolmates.) Geisel adopted the name Seuss when he was a student at<br/>\n&gt; &gt; Dartmouth, where he studied English and contributed to the<br/>\nJack-O-Lantern<br/>\n&gt; &gt; college newspaper. Caught drinking in his room with his friends, he was<br/>\n&gt; &gt; suspended by the dean from the magazine as punishment, but he continued<br/>\nto<br/>\n&gt; &gt; work under his assumed name. The &quot;Dr.&quot; honorific was adopted later,<br/>\nafter<br/>\n&gt; his<br/>\n&gt; &gt; departure from Oxford University, when he abandoned his academic career,<br/>\n&gt; and<br/>\n&gt; &gt; his father&#39;s ambitions that he would become a Ph.D., to pursue his love<br/>\nof<br/>\n&gt; &gt; drawing and cartooning.<br/>\n&gt; &gt;<br/>\n&gt; &gt; The very name Dr. Seuss is thus a product of Geisel&#39;s disobedience and<br/>\n&gt; refusal<br/>\n&gt; &gt; to conform, and this is important. Geisel was a genius, and the flavour<br/>\nof<br/>\n&gt; his<br/>\n&gt; &gt; genius is iconoclastic, revolutionary.<br/>\n&gt; &gt;<br/>\n&gt; &gt; In the fertile garden of American childhood of the postwar period,<br/>\nGeisel<br/>\n&gt; &gt; quietly sowed the seeds of critique in works that champion justice, the<br/>\n&gt; power<br/>\n&gt; &gt; of the imagination and the rights of the little guy, banishing<br/>\nconformity<br/>\n&gt; and<br/>\n&gt; &gt; authoritarianism and even the conventions of language itself.<br/>\n&gt; &gt;<br/>\n&gt; &gt; While the earlier books have their adherents, most true Seuss<br/>\nconnoisseurs<br/>\n&gt; &gt; agree that the &quot;essential Seuss&quot; is 1957&#39;s The Cat in the Hat, which can<br/>\n&gt; be<br/>\n&gt; &gt; read as a general call to arms for creative anarchy and freedom. The cat<br/>\n&gt; is<br/>\n&gt; &gt; the trickster, an agent of change who wreaks havoc in stultifying<br/>\nfifties<br/>\n&gt; &gt; suburbia.<br/>\n&gt; &gt;<br/>\n&gt; &gt; But Geisel&#39;s other works tackle a host of political issues with<br/>\nincreasing<br/>\n&gt; &gt; explicitness. The Butter Battle Book, with its escalating, fear-driven<br/>\n&gt; contest<br/>\n&gt; &gt; between the Yooks and the Zooks, is a cautionary tale about nuclear<br/>\n&gt; &gt; proliferation. Horton Hears a Who brings us a kindhearted elephant who<br/>\n&gt; saves<br/>\n&gt; &gt; the kingdom of microscopic Whos from extinction. (Are the Whos the<br/>\nJews?)<br/>\n&gt; &gt;<br/>\n&gt; &gt; Yertle the Turtle is, by the author&#39;s admission, a take on Hitler&#39;s rise<br/>\n&gt; to<br/>\n&gt; &gt; power. (In early drafts, Yertle sports the Fuhrer&#39;s short-cropped<br/>\n&gt; mustache.)<br/>\n&gt; &gt; And in The Sneetches, a capitalist named Sylvester McMonkey McBean<br/>\nprofits<br/>\n&gt; &gt; from the trade in imprinting and erasing stars on the bellies of the<br/>\n&gt; &gt; trend-conscious bird-like beasts, manipulating their desire like the<br/>\n&gt; expert<br/>\n&gt; &gt; Madison Avenue ad man Geisel himself once was. (These stars are also,<br/>\nfor<br/>\n&gt; many<br/>\n&gt; &gt; readers, an echo of the Star of David borne by Jews in Hitler&#39;s<br/>\nGermany.)<br/>\n&gt; &gt;<br/>\n&gt; &gt; Geisel&#39;s own favourite of his books, however, was The Lorax, in which<br/>\nthe<br/>\n&gt; &gt; rapacious Once-ler discovers the profits to be made from chopping down<br/>\nall<br/>\n&gt; the<br/>\n&gt; &gt; truffula trees, building factories and convincing the masses of the need<br/>\n&gt; for<br/>\n&gt; &gt; thneeds (an ambiguous knitted garment), which he produces in his<br/>\n&gt; &gt; pollution-spewing textile factory. The Swomee Swans fly away looking for<br/>\n&gt; fresh<br/>\n&gt; &gt; air, and the Humming-Fish die. At the end, just one seed is left from<br/>\n&gt; which<br/>\n&gt; &gt; regeneration might begin anew, held aloft by the Lorax, a short and<br/>\nfuzzy<br/>\n&gt; &gt; prophet of environmental doom, and a repository of wisdom for the<br/>\nfuture.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Readings of the book have taken place in anti-logging rallies from the<br/>\n&gt; Pacific<br/>\n&gt; &gt; Northwest to Australia, and several U.S. school boards have been<br/>\n&gt; petitioned,<br/>\n&gt; &gt; unsuccessfully, to censor the book, with Seuss detractors alleging that<br/>\nit<br/>\n&gt; &gt; misrepresents the forest-products industry.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Together these works are delicately coded moral parables on the perils<br/>\nof<br/>\n&gt; &gt; capitalism, xenophobia and intolerance.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Geisel&#39;s biographer, Neil Morgan (who wrote the definitive Dr. Seuss and<br/>\n&gt; Mr.<br/>\n&gt; &gt; Geisel with his wife, Judith), insists on the central importance of<br/>\n&gt; political<br/>\n&gt; &gt; ideas in Geisel&#39;s work, but says that the artist thought of it rather<br/>\njust<br/>\n&gt; as<br/>\n&gt; &gt; ethics, as a case of teaching kids, and maybe their parents, what&#39;s<br/>\nright<br/>\n&gt; and<br/>\n&gt; &gt; wrong.<br/>\n&gt; &gt;<br/>\n&gt; &gt; &quot;I&#39;m subversive as hell,&quot; Geisel declared in an interview decades<br/>\nearlier,<br/>\n&gt; &gt; shortly after winning the Pulitzer Prize. &quot;The Cat in the Hat is a<br/>\nrevolt<br/>\n&gt; &gt; against authority, but it&#39;s ameliorated by the fact that the cat cleans<br/>\nup<br/>\n&gt; &gt; everything in the end. It&#39;s revolutionary in that it goes as far as<br/>\n&gt; Kerensky<br/>\n&gt; &gt; and then stops. It doesn&#39;t quite go as far as Lenin.&quot;<br/>\n&gt; &gt;<br/>\n&gt; &gt; The origins of The Cat in the Hat, too, are political -- in the broadest<br/>\n&gt; sense<br/>\n&gt; &gt; of empowering the powerless. Geisel was of the opinion that &quot;too many<br/>\n&gt; writers<br/>\n&gt; &gt; have only contempt and condescension for children, which is why we give<br/>\n&gt; them<br/>\n&gt; &gt; degrading corn about bunnies.&quot; Clearly, they deserved better.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Responding to dropping literacy rates, his publisher Bennett Cerf<br/>\n&gt; challenged<br/>\n&gt; &gt; Geisel to write a book using just 220 easy-to-read words, a book that<br/>\n&gt; children<br/>\n&gt; &gt; could read on their own, and an antidote to the dreary wholesomeness of<br/>\nso<br/>\n&gt; &gt; much early reading. (Green Eggs and Ham, which followed it, was written<br/>\n&gt; using<br/>\n&gt; &gt; just 50 words.) It was, as Geisel put it, &quot;a way of kicking Dick and<br/>\nJane<br/>\n&gt; out<br/>\n&gt; &gt; of the school system.&quot;<br/>\n&gt; &gt;<br/>\n&gt; &gt; The result was a sensation and The Cat and the Hat has since been the<br/>\n&gt; subject<br/>\n&gt; &gt; of many an academic foray. Heinz Insu Fenkl, director of creative<br/>\nwriting<br/>\n&gt; at<br/>\n&gt; &gt; the State University of New York at New Paltz, who has written on<br/>\nSeuss&#39;s<br/>\n&gt; &gt; relationship to alchemy and cabalistic thought, describes the way in<br/>\nwhich<br/>\n&gt; cat<br/>\n&gt; &gt; (id) and fish (superego) battle for domination of the children. He<br/>\nnotes,<br/>\n&gt; as<br/>\n&gt; &gt; well, that the absence of the mother makes the story frightening.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Fenkl points to the ending as particularly charged, with the reader<br/>\nasked:<br/>\n&gt; &gt; &quot;What would you do if your mother asked you?&quot; Would you disclose the<br/>\ntruth<br/>\n&gt; &gt; about the day, or conceal it? &quot;Children who read this understand<br/>\n&gt; profoundly<br/>\n&gt; &gt; the nature of this transgression,&quot; he argues. &quot;They understand that the<br/>\n&gt; &gt; culture of children is actually quite different than that of adults,<br/>\nthat<br/>\n&gt; &gt; there are things that you keep from adults.&quot;<br/>\n&gt; &gt;<br/>\n&gt; &gt; Other interpretations are more political in focus. Art Spiegelman, in<br/>\nhis<br/>\n&gt; &gt; essay accompanying Richard Minear&#39;s Dr. Seuss Goes to War: The World War<br/>\n&gt; II<br/>\n&gt; &gt; Editorial Cartoons of Theodor Seuss Geisel, posits the cat as a<br/>\n&gt; permutation of<br/>\n&gt; &gt; Uncle Sam in his stovepipe hat. (In many of Geisel&#39;s earlier political<br/>\n&gt; &gt; cartoons, the U.S. is figured as a busted-down eagle in a high hat.)<br/>\n&gt; &gt;<br/>\n&gt; &gt; It&#39;s worth noticing that The Cat in the Hat was written not long after<br/>\nthe<br/>\n&gt; &gt; Americans ended their peacetime occupation of Germany and Japan. Can it<br/>\nbe<br/>\n&gt; &gt; read, one wonders, as a parable of American interventionism, with Geisel<br/>\n&gt; &gt; implying, albeit subliminally, that the United States always cleans up<br/>\nits<br/>\n&gt; &gt; mess? (Okay, so he had a few all-American blind spots.) Still, it&#39;s not<br/>\nso<br/>\n&gt; &gt; far-fetched when you consider that he declared Horton Hears a Who to be<br/>\n&gt; &gt; inspired by the plight of the Japanese following the war.<br/>\n&gt; &gt;<br/>\n&gt; &gt; The cat also serves as the distillation of a number of figures from<br/>\n&gt; children&#39;s<br/>\n&gt; &gt; literature. He&#39;s a cousin of Lewis Carroll&#39;s Mad Hatter, another famous<br/>\n&gt; &gt; subversive, but his oversized bow tie suggests Mickey Mouse, as do the<br/>\n&gt; white<br/>\n&gt; &gt; gloves. (Or do we detect a touch of Al Jolson here?) Fenkl notes, too,<br/>\nthe<br/>\n&gt; way<br/>\n&gt; &gt; we read Geisel&#39;s stories differently as we age, with the narratives<br/>\ntaking<br/>\n&gt; on<br/>\n&gt; &gt; new meanings from our more adult perspectives. &quot;Classic German fairy<br/>\ntales<br/>\n&gt; &gt; function in just this way,&quot; he says.<br/>\n&gt; &gt;<br/>\n&gt; &gt; The Cat in the Hat is not the only Dr. Seuss work to be subjected to<br/>\nclose<br/>\n&gt; &gt; analysis. Philip Nel of Kansas State University is the author of the<br/>\n&gt; &gt; forthcoming scholarly book, Dr. Seuss: American Icon, cataloguing<br/>\nGeisel&#39;s<br/>\n&gt; &gt; accomplishments and analyzing his legacy. In the course of his research,<br/>\n&gt; Nel<br/>\n&gt; &gt; has managed to scare up some exotic academic interpretations. Jonathan<br/>\n&gt; Cott,<br/>\n&gt; &gt; for example, has compared And to Think That I Saw It on Mulberry Street<br/>\nto<br/>\n&gt; &gt; Goethe&#39;s The Erl-King, an interpretation that Geisel evidently endorsed.<br/>\n&gt; &gt; (Goethe&#39;s story was a favourite of his in childhood.) There is also Mary<br/>\n&gt; &gt; Galbraith&#39;s Agony in the Kindergarten: Indelible German Images in<br/>\nAmerican<br/>\n&gt; &gt; Picture Books, which, Nel says, &quot;reads Mulberry Street and H. A. Rey&#39;s<br/>\n&gt; Curious<br/>\n&gt; &gt; George in terms of intersections between the author-illustrators&#39; lives<br/>\n&gt; and<br/>\n&gt; &gt; German and American history and identity.&quot;<br/>\n&gt; &gt;<br/>\n&gt; &gt; Alison Lurie&#39;s The Cabinet of Dr. Seuss examines the negative image of<br/>\n&gt; women<br/>\n&gt; &gt; in Seuss&#39;s books. (It&#39;s true -- they are usually the party poopers.)<br/>\nNaomi<br/>\n&gt; &gt; Goldenberg&#39;s lecture A Feminist, Psychoanalytic Exegesis of The Cat in<br/>\nthe<br/>\n&gt; Hat<br/>\n&gt; &gt; reads The Cat in the Hat Comes Back as a &quot;masculine attempt to overcome<br/>\n&gt; womb<br/>\n&gt; &gt; envy.&quot; And Shira Wolosky&#39;s Democracy in America: By Dr. Seuss interprets<br/>\n&gt; &gt; Geisel&#39;s work as endorsing &quot;classic American liberal individualism while<br/>\n&gt; &gt; exploring the dangers of extreme individualism.&quot;<br/>\n&gt; &gt;<br/>\n&gt; &gt; How, then, does the movie measure up to this weighty legacy? Is it a<br/>\n&gt; &gt; desecration or a reconsecration of Seuss&#39;s masterpiece? It can&#39;t be as<br/>\n&gt; bad,<br/>\n&gt; &gt; say, as the pseudo-Seuss books put out by Seuss Enterprises after<br/>\nGeisel&#39;s<br/>\n&gt; &gt; death, like Oh the Things You Can Do That Are Good for You -- with its<br/>\n&gt; &gt; encouraging words about personal hygiene and the benefits of healthy<br/>\nfood<br/>\n&gt; &gt; choices. Infamy!<br/>\n&gt; &gt;<br/>\n&gt; &gt; The critical response to the film has been overwhelmingly negative. And<br/>\nit<br/>\n&gt; &gt; certainly fiddles a fair bit with Geisel&#39;s original plot: A love<br/>\ninterest<br/>\n&gt; is<br/>\n&gt; &gt; inserted for mom, who works as a real-estate agent. The daughter has an<br/>\n&gt; &gt; electronic day timer. There is a babysitter. One&#39;s initial instinct is<br/>\nto<br/>\n&gt; bury<br/>\n&gt; &gt; one&#39;s face in one&#39;s hands and despair.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Worse still, the essential ambiguity of the cat (is he friend or foe?)<br/>\nhas<br/>\n&gt; &gt; been for the most part lost; he&#39;s now just a little too lovable. (Echoes<br/>\n&gt; of<br/>\n&gt; &gt; the giggling Uncle Albert from Mary Poppins and Oz&#39;s Cowardly Lion<br/>\ninflect<br/>\n&gt; &gt; Myers&#39;s rendition.) In Seuss&#39;s original, the children never smile until<br/>\n&gt; the<br/>\n&gt; &gt; very end, and we are never quite sure just whose side the cat is on.<br/>\n(His<br/>\n&gt; own,<br/>\n&gt; &gt; actually.) This uncertainty lends the character much of its mystique.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Still, all is not lost. Thing One and Thing Two are simultaneously<br/>\nhorrid<br/>\n&gt; and<br/>\n&gt; &gt; cute -- just as they should be. The fish is annoying and eminently<br/>\n&gt; &gt; dismissable. The sets and costumes are spectacular. And the major theme<br/>\nof<br/>\n&gt; the<br/>\n&gt; &gt; work is preserved and amplified: the dichotomy between order and chaos,<br/>\n&gt; and<br/>\n&gt; &gt; the need for both in everyone&#39;s life.<br/>\n&gt; &gt;<br/>\n&gt; &gt; What a movie can never do, however, is achieve all of this miraculously<br/>\n&gt; with<br/>\n&gt; &gt; just a few sheets of paper and a pencil, the simple tools of language<br/>\nand<br/>\n&gt; line.<br/>\n&gt; &gt;<br/>\n&gt; &gt; So go ahead and enjoy the movie, such as it is. What&#39;s not to love about<br/>\n&gt; Mike<br/>\n&gt; &gt; Myers dressed up as a giant pussycat? &quot;The problem is,&quot; as Nel puts it,<br/>\n&gt; &quot;Seuss<br/>\n&gt; &gt; is a genius. And you can&#39;t replicate that.&quot;<br/>\n&gt; &gt;<br/>\n&gt; &gt; More titles for fledgling dissidents<br/>\n&gt; &gt;<br/>\n&gt; &gt; The Rabbit&#39;s Wedding (1958) by Garth Williams. A tale of interracial<br/>\n&gt; marriage<br/>\n&gt; &gt; between a white and a black bunny.<br/>\n&gt; &gt;<br/>\n&gt; &gt; The Story of Ferdinand (1936) by Munro Leaf. A pacifist bull defies the<br/>\n&gt; &gt; patriarchy by preferring shade and quiet to the heroics of the bullring.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Spotty (1945) by Margret and H. A. Rey. A rabbit with spots stands out<br/>\n&gt; from<br/>\n&gt; &gt; the crowd. Will he find acceptance?<br/>\n&gt; &gt;<br/>\n&gt; &gt; The Last Flower (1939) by James Thurber. Set after World War XXII, the<br/>\n&gt; story<br/>\n&gt; &gt; contemplates environmental catastrophe.<br/>\n&gt; &gt;<br/>\n&gt; &gt; --S.M.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Bell Globemedia<br/>\n&gt; &gt; © 2003 Bell Globemedia Interactive Inc. All Rights Reserved.<br/>\n&gt; &gt;<br/>\n&gt; &gt; ====================================================================<br/>\n&gt; &gt; Tim Hermach<br/>\n&gt; &gt; Founder & President<br/>\n&gt; &gt; Native Forest Council<br/>\n&gt; &gt; PO Box 2190<br/>\n&gt; &gt; Eugene, OR  97402<br/>\n&gt; &gt; 541.688.2600<br/>\n&gt; &gt; eFax 305.768.0115 or 541.461.2156<br/>\n&gt; &gt;<br/>\n&gt; &gt; web page:  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.forestcouncil.org\">http://www.forestcouncil.org</a><br/>\n&gt; &gt;            <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.forestcouncil.org/join\">http://www.forestcouncil.org/join</a><br/>\n&gt; &gt; DEFENDING Life, Land & Liberty<br/>\n&gt; &gt; NO MORE TAKINGS OR COMPROMISES, ZERO CUT, ZERO EXTRACTION,<br/>\n&gt; &gt; Keep Our Public Lands FOREVER WILD & FREE.<br/>\n&gt; &gt;<br/>\n&gt;<br/>\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~<br/>\n&gt; ~~~~~<br/>\n&gt; &gt;<br/>\n&gt; &gt; _______________________________________________<br/>\n&gt; &gt; Stumps mailing list<br/>\n&gt; &gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Stumps@...\">Stumps@...</a><br/>\n&gt; &gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://redwood.forestcouncil.org/cgi-bin/mailman/listinfo/stumps\">http://redwood.forestcouncil.org/cgi-bin/mailman/listinfo/stumps</a><br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]}],"prevTopicId":17448,"nextTopicId":17454}}