{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":36194,"authorName":"Kerrin or Ralph","from":"&quot;Kerrin or Ralph&quot; &lt;kerrin@...&gt;","profile":"kerrin37","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] about &quot;teaching&quot; and learning","postDate":"1111101600","msgId":104615,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMzIwMWM1MmI0NyRkNzMxMWU0MCQ2ZTAwYThjMEBjb21wYXE+","referencesHeader":"PDFjNS4yM2Y1ZDRiZS4yZjZhZmEyY0Bhb2wuY29tPg=="},"prevInTopic":104593,"nextInTopic":0,"prevInTime":104614,"nextInTime":104616,"topicId":104593,"numMessagesInTopic":0,"msgSnippet":"... to ... I get it! Truly I do :-) Kerrin.","messageBody":"<div id=\"ygrps-yiv-113965504\"><blockquote><span title=\"ireply\">&gt; For those who are even more confused than I was, the issue is attachment<br/>\n </span></blockquote>to<br/>\n<blockquote><span title=\"ireply\"> &gt; the word/idea/concept of &quot;teaching.&quot;   It can help to dump that from  your<br/>\n&gt; thoughts<br/>\n<br/>\n<br/>\n </span></blockquote>I get it! Truly I do :-)<br/>\n<br/>\nKerrin.</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"about &quot;teaching&quot; and learning","postDate":"1111072812","msgId":104593,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFjNS4yM2Y1ZDRiZS4yZjZhZmEyY0Bhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":104615,"prevInTime":104592,"nextInTime":104594,"topicId":104593,"numMessagesInTopic":0,"msgSnippet":"In a message dated 3/16/2005 8:42:00 PM Mountain Standard Time, kerrin@xtra.co.nz writes: We were  talking about teaching as part of unschooling. Some people","messageBody":"<div id=\"ygrps-yiv-1397189670\">In a message dated 3/16/2005 8:42:00 PM Mountain Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kerrin@...\">kerrin@...</a> writes:<br/>\n<br/>\nWe were  talking about teaching as part of unschooling. Some people seemed to<br/>\nthink  that there couldn&#39;t be any teaching if you were unschooling.  I  was<br/>\ntrying to point out that teaching is ok if the child has asked for  it.<br/>\n<br/>\n<br/>\n<br/>\nBut was it &quot;teaching&quot; if the child didn&#39;t learn?<br/>\n <br/>\n-=-My shoelace story was an example of how teaching and learning are not  the<br/>\nsame thing, and that learning does not necessarily follow teaching.  It<br/>\nwasn&#39;t worth anything. Except maybe the value of my child knowing that  if<br/>\nshe asks me to help her with something, I will try.-=-<br/>\n <br/>\nRight.  Sorry.  I was trying to say the same thing.  &lt;g&gt;<br/>\n <br/>\nFor those who are even more confused than I was, the issue is attachment to  <br/>\nthe word/idea/concept of &quot;teaching.&quot;   It can help to dump that from  your <br/>\nthoughts and say instead (and think instead) that you helped her learn to  tie <br/>\nher shoes.  You showed her how you tie yours.  You maybe passed on  ideas or <br/>\ntricks that helped you.  <br/>\n <br/>\nAll the learning happens inside the learner.  Teaching (especially  teaching <br/>\nthat resulted in no learning) isn&#39;t as helpful to unschooling as is  helping a <br/>\nperson learn.  They&#39;re not always the same thing.  And when  they ARE the <br/>\nsame thing, it&#39;s more helpful to think of it as &quot;helping someone  learn.&quot;<br/>\n <br/>\n-=-So are you saying that learning does always follow teaching? I&#39;m sure  you<br/>\nsaid the opposite in an earlier post. I&#39;m a bit confused! anyway,  I&#39;m<br/>\nthinking!-=-<br/>\n <br/>\nIf I said it, what I meant was that if nobody learned, why would we say we  <br/>\n&quot;taught&quot;?<br/>\nBut in schools the definition of &quot;teach&quot; comes down to &quot;showed up, did  <br/>\nstuff, kept kids in room, gave them a test&quot; because they have to have a  <br/>\njustification for pay checks and benefits.   And there ARE measures  that are designed <br/>\nto prove that teachers taught.  Unfortunately, they&#39;re  based on grades and <br/>\ntests scores, neither of which shows much long-term evidence  of real learning.  <br/>\nAnd luckily for teachers, they often just show that he  kids got a year older <br/>\nand can do better on same-old-tests because they&#39;re more  mature and are <br/>\nprobably learning enough outside of school (and some inside) to  get a higher score <br/>\nthan the year before, so the teacher&#39;s paycheck is  justified.  <br/>\n <br/>\nOccasionally I teach a one-hour kind of thing.  I &quot;taught a class&quot; on  <br/>\nmedieval and Renaissance music a couple of years back.  I ran it toward  getting a <br/>\njoke, and at the end I played a fake gregorian chant that was actually  Queen&#39;s <br/>\n&quot;We will Rock You&quot; done in such a way that you&#39;d get twelve words in  before <br/>\nrealizing it wasn&#39;t REALLY a gregorian chant.  Anyone who &quot;got that  joke&quot; <br/>\nfelt he&#39;d learned something in that class.  Some people probably  caught a thing <br/>\nor two they still remember. Some were just there because there  wasn&#39;t another <br/>\nworkshop they wanted to attend in that hour, or they liked me, or  they liked <br/>\nmusic.  I was paid with a free lunch and a nice &#39;thank  you.&#39;    If no one <br/>\nlearned, at least I did my presentation.   But could I say I &quot;taught&quot; if truly <br/>\nnot a person learned a thing?    Depends on what I think teaching is, I guess.  <br/>\nLuckily, I showed them  pictures and played them music, and told them <br/>\nstories, so probably various of  them remember totally different bits and parts.  <br/>\n <br/>\n-=-the 1st definition of teach in my dictionary is: To help to  learn,<br/>\ntell or show-=-<br/>\n <br/>\nThat&#39;s a good definition!<br/>\n <br/>\n-=-If only they really did sing and dance! That would be a huge  <br/>\nimprovement!-=-<br/>\n <br/>\nAmen. <br/>\nI used to sing, when I taught Jr. High.  Fridays, a traditional ballad  each <br/>\nweek.  I called it poetry and literature, on the lesson plans.  I  told the <br/>\nkids &quot;on Fridays we&#39;ll just do a ballad.&quot;  When I see any of them  now, they <br/>\ntalk about that.  A friend of mine found she&#39;s working with one  of my former <br/>\nstudents at Sandia Labs; they&#39;re engineers.  So I exchanged a  couple of e-mails <br/>\nwith this long-ago student, whose name&#39;s Inez.  It was  very cool.  She <br/>\nmentioned the ballads, and said I taught her calligraphy,  after hours, and she <br/>\nstill does it (it was probably one session and a follow-up  when she had <br/>\nquestions).   I got to tell her that the person who first  taught me calligraphy (one <br/>\nlesson, but I still say &quot;taught&quot; because it  took!  I just needed to know how <br/>\nto operate the pen and ink and to see  someone do it who could give me <br/>\npointers) was... Rodema, the very woman she&#39;s  working with at Sandia.  They hadn&#39;t <br/>\nknown of that calligraphy  connection.  And I told her if I had given her a <br/>\n&quot;handout,&quot; it was probably  done by Rodema.<br/>\n <br/>\nSandra<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":104612,"nextTopicId":104622}}