{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Need help with figuring out where i went horribly wrong","postDate":"1134687764","msgId":110739,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc5RTAwRDQ2LTkzQTMtNDlEMC04RURFLTEyMjcyRUIyQTZFNUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGRucnZicitnNWY1QGVHcm91cHMuY29tPg==","referencesHeader":"PGRucnZicitnNWY1QGVHcm91cHMuY29tPg=="},"prevInTopic":110724,"nextInTopic":0,"prevInTime":110738,"nextInTime":110740,"topicId":110720,"numMessagesInTopic":0,"msgSnippet":"... I think it would have been wrong to train him to go to sleep without protest by the clock.  Maybe not wrong right now, but in the longrun it would create","messageBody":"<div id=\"ygrps-yiv-1295731399\">On Dec 15, 2005, at 7:42 AM, denise wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; What do i do now??? What did I do wrong???  We are working on  <br/>\n&gt; putting a t.v. in the boy&#39;s<br/>\n&gt; room as soon as we can,<br/>\n&gt; but other than that I don&#39;t know what else to do.<br/>\n<br/>\n<br/>\n </span></blockquote>I think it would have been wrong to train him to go to sleep without  <br/>\nprotest by the clock.  Maybe not &quot;wrong&quot; right now, but in the  <br/>\nlongrun it would create in him the desire to be up, sneak to get up,  <br/>\nstay up until daylight, and being up would be seen as &quot;mature&quot; and  <br/>\nadult, and going to sleep would seem babyish.    That&#39;s not healthy,  <br/>\nyet college kids everywhere show those symptoms.<br/>\n<br/>\n<br/>\nEven without a TV, can you get a CD player or tape player and find  <br/>\nsoothing stories or quiet music?<br/>\n<br/>\nCan you rock him to sleep or let him fall asleep next to you on the  <br/>\ncouch and leave him there, covered up?  Maybe he would like to fall  <br/>\nasleep where people are and just stay there.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Am I starting this too early?<br/>\n&gt; Is it that I&#39;ve started this too late?<br/>\n<br/>\n </span></blockquote>You already don&#39;t have &quot;a bedtime&quot; as in a time by the clock that he  <br/>\n&quot;has to&quot; go to bed, so when you say &quot;started this&quot; try to think  <br/>\nclearly of what &quot;this&quot; is, to you.   And give it time.  It will be  <br/>\nless new and he&#39;ll be less young every day.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":59925222,"authorName":"queenjane555","from":"&quot;queenjane555&quot; &lt;queenjane555@...&gt;","profile":"queenjane555","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Need help with figuring out where i went horribly wrong","postDate":"1134666433","msgId":110724,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRuczdzMStqb29hQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGRucnZicitnNWY1QGVHcm91cHMuY29tPg=="},"prevInTopic":110720,"nextInTopic":110739,"prevInTime":110723,"nextInTime":110725,"topicId":110720,"numMessagesInTopic":0,"msgSnippet":"I think others will probably have more specific, helpful advice. But i didnt want to comment that when my son was around that age, he always got more intense,","messageBody":"<div id=\"ygrps-yiv-39266549\">I think others will probably have more specific, helpful advice. But i <br/>\ndidnt want to comment that when my son was around that age, he always <br/>\ngot more intense, more wound-up, more &quot;awake&quot; RIGHT before he&#39;d fall <br/>\nasleep. If it seemed like he was &quot;bouncing off the walls&quot; or getting <br/>\nsuper hyper sleep was sure to follow soon. It helped to do something <br/>\nlike lying in bed reading a book, or turning down the lights and <br/>\nwatching a video, because that would often induce sleep. Sometimes <br/>\nthough, if it seemed like we&#39;ve read for awhile and he still wasnt <br/>\nsleeping, it meant it was too soon, and we got back up again. But he <br/>\ndid &quot;fight sleep&quot; until the last possible moment. <br/>\n<br/>\n<br/>\nKatherine</div>","specialLinks":[]},{"userId":46250780,"authorName":"denise","from":"&quot;denise&quot; &lt;de_perri@...&gt;","profile":"de_perri","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Need help with figuring out where i went horribly wrong","postDate":"1134657723","msgId":110720,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRucnZicitnNWY1QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":110724,"prevInTime":110719,"nextInTime":110721,"topicId":110720,"numMessagesInTopic":0,"msgSnippet":"This is what we used to do in regards to our 4 year old and bedtime: 1) watch for sleepy signs 2)then bring him up to his room (this would usually turn out to","messageBody":"<div id=\"ygrps-yiv-212685079\">This is what we used to do in regards to our 4 year old and bedtime:<br/>\n1) watch for sleepy signs<br/>\n2)then bring him up to his room (this would usually turn out to be around the same time <br/>\nevery night-between 7;10 and 7:30 p.m.)<br/>\n3)read books, listen to tapes, sing songs, talk-his choice-until he fell asleep.<br/>\n<br/>\nNormally he would fall asleep within 2 to 20 mins.<br/>\nNot bad, probably. He had a *bedtime* but it wasn&#39;t arbitrary.<br/>\n<br/>\nRegardless, he would *fight* sleeping almost every night.<br/>\nEven when his eyes were closing he would fight it and say, &quot;mom didn&#39;t you know? this is <br/>\nhow i sleep. with my eyes open&quot; and &quot;mom, i wasn&#39;t sleeping, i was just pretending.&quot; :)<br/>\nThere would also be lots of restlessness, and sometimes yelling.<br/>\nAlmost always he fell asleep quickly, but lately it had been taking 40 mins to an hour.<br/>\n<br/>\nTwo things happened for me<br/>\n-I thought maybe I need to change the bedtime, that I was *missing* his sleepy signals, <br/>\nand/or <br/>\n-that maybe now was the time to *lift* a *bedtime* guided by us.<br/>\n<br/>\nMy husband and I decided it was time to lift the bedtime. <br/>\nWe recognized that Marley has a really difficult time accepting when he is tired, he <br/>\nrecognizes it but fights fights FIGHTS it, and we wanted to help him get to a place where <br/>\nhe felt comfortable and o.k. with being sleepy and could/would tell US when he was tired <br/>\nand wanted to go to bed.<br/>\n<br/>\nWe have an older son, Sett, who is 10 1/2 who stays up till he decides he&#39;s ready for bed <br/>\nand has been doing that for awhile now. (about 8 months, i think).<br/>\nWe don&#39;t feel comfortable with Mars being downstairs either alone or with his brother for <br/>\nwhat could be long periods of time without us.<br/>\nThey get along really well but Sett is not ready (his determination which was also our <br/>\nguess)to be alone with Mars on that level.<br/>\nWhat we came up with was that Mars can stay downstairs as long as one of us (me or my <br/>\nhusband) are also down there.<br/>\nAfter that, he has the choice of either coming up to our room with us where he can watch <br/>\nt.v. or read or draw or whatever he wants that is on the quieter side of things till he falls <br/>\nasleep<br/>\nor <br/>\nhe can go to his room with one of us and do the same kinds of things till he falls asleep.<br/>\n<br/>\nHe can also tell us when he&#39;s sleepy and or fall asleep down with us and then we&#39;d take <br/>\nhim up.<br/>\n<br/>\nThe first night Mars fell asleep watching t.v (12:30 a.m.). and my husband, Adam, took <br/>\nhim up sometime after.<br/>\n<br/>\nThe second night Mars said he was sleepy and ready to go up when Sett said he was ready <br/>\nto go up(1:30 a.m.), but ended up fighting sleep once he was up there and saying he <br/>\nwasn&#39;t ready so my husband brought him back down and he fell asleep playing mega man.<br/>\n<br/>\nLast night my husband was ready to go up. (Adam and I had talked about being aware of <br/>\nwhen it was about 20-30 mins before we were absolutely ready to go to bed so that we <br/>\ncould help Mars transition from being downstairs to being upstairs.) <br/>\nAt 12:30 a.m. he started giving Marley time to adjust saying things like &quot;Mars, We&#39;re going <br/>\nup in 30 mins, in 20 mins, in 10, in 5, in 3...&quot;. (This is what has worked best, transitions-<br/>\nwise, for my guys in the past, giving time *warnings* so they know it&#39;s coming.)<br/>\nAdam had been asking Marley what and where he would like to do/go-our room, his <br/>\nroom, books, gameboy, etc., but Mars was not interested in deciding.<br/>\nSo when the time came to go up, Mars freaked out  and started screaming and yelling and <br/>\nkicking and refused to go up. <br/>\nI had been asleep but woke up when I heard him and came down. I sat with him on the <br/>\ncouch and held him and listened to him and he told me how he was feeling and I listened <br/>\nand gave him hugs and kisses. After he was in a calmner space, i started talking wiht him <br/>\nabout what his options were-of either our room or his and which did he want but he got <br/>\nreally upset again. Eventually I told him I was bringing him up to his room. He was still <br/>\nscreaming and was pretty upset and I laid him in his bed and laid with him untill he fell <br/>\nasleep about 5 minutes later. Even as he was falling asleep he was saying &quot;mom, i&#39;m so <br/>\nannoyed with you&quot; . (All of this, from when i came down to when he fell asleep, took about <br/>\n20 mins.)<br/>\n<br/>\nWhat do i do now??? What did I do wrong???  We are working on putting a t.v. in the boy&#39;s <br/>\nroom as soon as we can, <br/>\nbut other than that I don&#39;t know what else to do.<br/>\nAm I starting this too early?<br/>\nIs it that I&#39;ve started this too late?<br/>\nHelp. Please :)</div>","specialLinks":[]}],"prevTopicId":109163,"nextTopicId":110749}}