{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":135843572,"authorName":"24hrmom","from":"&quot;24hrmom&quot; &lt;24hrmom@...&gt;","profile":"learn2day2002","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] &quot;Wishcraft for Kids&quot; tips & stories","postDate":"1063224926","msgId":80204,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNjMwMWMzNzdkOCQ0ODVhZDcyMCQwMzAwYThjMEBUaW5rZXJiZWxsPg==","referencesHeader":"PDE2OC4yMzY4NWQzZS4yYzg4MDM2YUBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":80203,"nextInTime":80205,"topicId":80204,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-877395711\">&lt;&lt; But she needs help. She needs tips, ideas, and anecdotes. You can either<br/>\nhave your name included or not, as you prefer. She&#39;d love stories and ideas<br/>\nfrom kids and teens, as well. If we can come up with at least 100 useable<br/>\ntips and stories within the next month, she&#39;ll come to the conference.<br/>\n<br/>\nKathryn&gt;&gt;<br/>\n<br/>\nI know this is a bit late but, one tip is to not limit their time following<br/>\ntheir interests (or even express disdain at their interests).  My 11yo son<br/>\nreally enjoys his video games, and computer games to a lesser extent.  I<br/>\ndon&#39;t limit his time and it is amazing how much he is learning and where<br/>\nthis interest has taken him.  From the obvious reading component (the game<br/>\nitself, game guides, magazines etc), to the math and logic skills often<br/>\ninvolved in the game itself, regular discussions on plot and character<br/>\ndevelopment (if I&#39;m not there he&#39;ll run to find me to tell me things that<br/>\nhave happened and connections he&#39;s made), learning from the game content<br/>\nitself (tons of mythology in many of the games my son enjoys), it just goes<br/>\non and on.  I can add more to the list if you need.<br/>\n<br/>\nOne cool story is from the SC conference.  When Jim Weiss was telling his<br/>\nfirst story, the one about one of the labours of Hercules Joseph told me<br/>\nwhat his favourite of the 12 labours was (as well as some of the others) - I<br/>\ndidn&#39;t know he knew anything about them!  He continued to tell me the<br/>\ndifferences between the things Jim mentioned in his stories and what he had<br/>\nlearned from his games (I find the game developers take a lot of effort to<br/>\nmake game content true and to make all sorts of connections / interplay) and<br/>\nwhat he has read following up on his interest in mythology (directly<br/>\ndeveloped from the games).  It was cool that Jim even mentioned how there<br/>\nwere many different versions of the stories and how he did a lot of research<br/>\nto come up with his version.<br/>\n<br/>\nAnd related, we were camping a couple weeks ago with my kids and nieces and<br/>\nI brought along a book &quot;The Magical Worlds of Harry Potter&quot; that I had just<br/>\nbought.  I thought an opportunity may come up and I knew they all liked<br/>\nHarry Potter.  After dinner one night I brought it out and started reading<br/>\nexcerpts (the books is set up as questions and answers).  Well, the<br/>\nmythology Joseph knew and told us all related to what we were reading was<br/>\nphenomenal!!  He would often finish the sentence I was reading.  And he<br/>\nwould connect it back to some of the games he enjoys playing.  And he would<br/>\nconnect the games to each other.  Even though the games themselves weren&#39;t<br/>\nrelated, they were all drawing on the same mythological stories as their<br/>\nbasis, or maybe just for naming their characters and moves etc.  He was so<br/>\nexcited and kept explaining stuff to everyone (you have to understand that<br/>\nhe is typically a boy of FEW words).  We were all so enjoying ourselves I<br/>\nbrought the book in the tent with us and we continued until everyone else<br/>\nhad fallen asleep.<br/>\n<br/>\nOh, oh!!  One more along these lines.  After we had been unschooling for a<br/>\nfew months (he would have been 10) and he had been playing video games full<br/>\ntilt (no homework and school to get in his way LOL!), I was lying in bed<br/>\nwith him one night as he was going to sleep and out-of-the-blue he said &quot;I<br/>\nhave always thought of myself as a video game guy.  But I only seem to like<br/>\none kind of video game, those based back in time with swords and spells and<br/>\nbattles.  Maybe I&#39;m a guy who likes those old times and I am just using<br/>\nvideo games to learn about it!&quot;  I said &quot;yeah, maybe you&#39;re right&quot;, and then<br/>\nlaid back and marveled at his insight until I finally fell asleep.<br/>\n<br/>\nThey will earn so much if you allow them the freedom to pursue their<br/>\ninterests, even if you don&#39;t think they are worthwhile, they are worthwhile<br/>\nto the person pursuing them!<br/>\n<br/>\nPam L.</div>","specialLinks":[]}],"prevTopicId":80187,"nextTopicId":80207}}