{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":86201113,"authorName":"Donna B","from":"&quot;Donna B&quot; &lt;Donnabzy@...&gt;","profile":"donnabzy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Fw:  John Walker Lindh","postDate":"1008628230","msgId":30034,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAzMDAwMWMxODc0YSQ3MDMxNjZlMCQ1OWFhMWMzZkBkb25uYWJpcm9jemt5Pg==","referencesHeader":"PDAwMjEwMWMxODY2NyRiOTllNTc0MCQzMTVkZDFkMUBqaWRhMzU+IDwwMDYwMDFjMTg2YzIkYzQ3ODk5ZTAkYzg2YmEyMThAaG90LnJyLmNvbT4="},"prevInTopic":30006,"nextInTopic":30071,"prevInTime":30033,"nextInTime":30035,"topicId":29978,"numMessagesInTopic":0,"msgSnippet":"The link didn t work for me -- can you fill me in? I don t understand the leap from PS to John Walker s behavior to Osama? ... From: Charles Whittom Jr. To:","messageBody":"<div id=\"ygrps-yiv-1800326650\">The link didn&#39;t work for me -- can you fill me in? I don&#39;t understand the leap from PS to John Walker&#39;s behavior to Osama?<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: Charles Whittom Jr. <br/>\n  To: Unschooling-dotcom@yahoogroups.com <br/>\n  Sent: Sunday, December 16, 2001 10:19 PM<br/>\n  Subject: Re: [Unschooling-dotcom] Fw: John Walker Lindh<br/>\n<br/>\n<br/>\n  Preach on, Lynda!   <br/>\n<br/>\n  This is exactly what so many in PS need to hear today.  This IS what brought about the whole problem in the U.S.A. today, and in fact, the whole world.  Maybe that is also what led bin Laden into his role.  He got too much money and power and not enough guidance.<br/>\n<br/>\n  Charles Whittom, husband to DW Young, father to dd&#39;s Sasha (12), Stella (11) & ds Charles III (9)<br/>\n    ----- Original Message ----- <br/>\n    From: Lynda <br/>\n    To: Unschooling-dotcom@yahoogroups.com ; schools_out@yahoogroups.com ; UnschoolersCircle@yahoogroups.com ; Many-Paths@yahoogroups.com ; HEM-Networking@yahoogroups.com <br/>\n    Sent: Sunday, December 16, 2001 1:24 PM<br/>\n    Subject: [Unschooling-dotcom] Fw: John Walker Lindh<br/>\n<br/>\n<br/>\n    Hmmmm, interesting.<br/>\n<br/>\n    Lynda<br/>\n    ----- Original Message -----<br/>\n<br/>\n    &gt;<br/>\n    http://www.boston.com/dailyglobe2/347/oped/Blame_Lindh_s_permissive_parents%<br/>\n    2B.shtml<br/>\n    &gt;<br/>\n    &gt; Blame Lindh&#39;s permissive parents<br/>\n    &gt; By Jeff Jacoby, 12/13/2001<br/>\n    &gt;<br/>\n    &gt; IT ISN&#39;T THE CASE that the parents of John Walker Lindh - the Marin<br/>\n    &gt; County child of privilege turned Taliban terrorist - never drew the line<br/>\n    &gt; with their son.<br/>\n    &gt;<br/>\n    If she and Frank Lindh had been less concerned with flaunting their<br/>\n    &gt; open-mindedness and more concerned with developing their son&#39;s moral<br/>\n    &gt; judgment, he wouldn&#39;t be where he is today. His road to treason and<br/>\n    &gt; jihad didn&#39;t begin in Afghanistan. It began in Marin County, with<br/>\n    &gt; parents who never said &quot;no.&quot;<br/>\n<br/>\n<br/>\n<br/>\n  [Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n        Yahoo! Groups Sponsor <br/>\n              ADVERTISEMENT<br/>\n             <br/>\n       <br/>\n       <br/>\n<br/>\n  Message boards, timely articles, a free newsletter and more!<br/>\n  Check it all out at: http://www.unschooling.com<br/>\n<br/>\n  To unsubscribe, set preferences, or read archives:<br/>\n  http://groups.yahoo.com/group/Unschooling-dotcom<br/>\n<br/>\n  Another great list sponsored by Home Education Magazine!<br/>\n  http://www.home-ed-magazine.com <br/>\n<br/>\n<br/>\n<br/>\n  Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":85994576,"authorName":"Kolleen","from":"Kolleen &lt;Kolleen@...&gt;","profile":"kaydeecross","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Fw:  John Walker Lindh","postDate":"1008613079","msgId":30071,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEUxNkdPdU4tMDAwMDJZLTAwQHN3YW4ucHJvZC5pdGQuZWFydGhsaW5rLm5ldD4="},"prevInTopic":30034,"nextInTopic":0,"prevInTime":30070,"nextInTime":30072,"topicId":29978,"numMessagesInTopic":0,"msgSnippet":"... I m going to put myself in front of the proverbial fire on this one, and say that maybe the son was reacting to morals. Morals that *maybe* he feels the US","messageBody":"<div id=\"ygrps-yiv-1448846560\"><blockquote><span title=\"ireply\">&gt;&gt; Blame Lindh&#39;s permissive parents<br/>\n&gt;&gt; By Jeff Jacoby, 12/13/2001<br/>\n<br/>\n<br/>\n </span></blockquote>I&#39;m going to put myself in front of the proverbial fire on this one, and <br/>\nsay that maybe the son was reacting to morals. Morals that *maybe* he <br/>\nfeels the US and its horrific foreign policy has brought upon itself. <br/>\n(This is NOT to take away from the pain that has happened)<br/>\n<br/>\nIs is not the secure child that fights for what they feel is right, right <br/>\ndown to the moral fabric of their being. NOT to be brainwashed by a <br/>\nsuperpower that brainwashes its citizens by not telling them of their <br/>\ncovert actions and consequences over the years?<br/>\n<br/>\nThis American Taliban fighter probably has more morals, sense of right <br/>\nfrom wrong and knowlege of the USA&#39;s foregin policys than most of the <br/>\nAmerican people.<br/>\n<br/>\nI commend his ferver to fight for what he sees as right. As opposed to <br/>\ncondem the parents for giving him the will to stick up for his beleifs.<br/>\n<br/>\nLet me end this with Noam Chomsky&#39;s speech at MIT. It may clear up my <br/>\nfeeble attempts at explaining this person&#39;s perspective.<br/>\n<br/>\nregards,<br/>\nkolleen<br/>\nNYC<br/>\n<br/>\nThe New War Against Terror<br/>\n                                Noam Chomsky<br/>\n<br/>\n                   The Technology And Culture Forum At MIT<br/>\n                         <a rel=\"nofollow\" target=\"_blank\" href=\"http://web.mit.edu/tac/www/\">http://web.mit.edu/tac/www/</a><br/>\n<br/>\nEveryone knows it&#39;s the TV people who run the world [crowd laugher]. I <br/>\njust<br/>\ngot orders that I&#39;m supposed to be here, not there. Well the last talk I<br/>\ngave at this forum was on a light pleasant topic. It was about how humans<br/>\nare an endangered species and given the nature of their institutions they<br/>\nare likely to destroy themselves in a fairly short time. So this time <br/>\nthere<br/>\nis a little relief and we have a pleasant topic instead, the new war on<br/>\nterror. Unfortunately, the world keeps coming up with things that make it<br/>\nmore and more horrible as we proceed.<br/>\n<br/>\nI&#39;m going to assume 2 conditions for this talk.<br/>\n<br/>\nThe first one is just what I assume to be recognition of fact. That is <br/>\nthat<br/>\nthe events of September 11 were a horrendous atrocity probably the most<br/>\ndevastating instant human toll of any crime in history, outside of war. <br/>\nThe<br/>\nsecond assumption has to do with the goals. I&#39;m assuming that our goal is<br/>\nthat we are interested in reducing the likelihood of such crimes whether<br/>\nthey are against us or against someone else. If you don&#39;t accept those two<br/>\nassumptions, then what I say will not be addressed to you. If we do accept<br/>\nthem, then a number of questions arise, closely related ones, which merit <br/>\na<br/>\ngood deal of thought.<br/>\n<br/>\nOne question, and by far the most important one is what is happening right<br/>\nnow? Implicit in that is what can we do about it? The 2nd has to do with <br/>\nthe<br/>\nvery common assumption that what happened on September 11 is a historic<br/>\nevent, one which will change history. I tend to agree with that. I think<br/>\nit&#39;s true. It was a historic event and the question we should be asking is<br/>\nexactly why? The 3rd question has to do with the title, The War Against<br/>\nTerrorism. Exactly what is it? And there is a related question, namely <br/>\nwhat<br/>\nis terrorism? The 4th question which is narrower but important has to do<br/>\nwith the origins of the crimes of September 11th. And the 5th question <br/>\nthat<br/>\nI want to talk a little about is what policy options there are in fighting<br/>\nthis war against terrorism and dealing with the situations that led to it.<br/>\n<br/>\nI&#39;ll say a few things about each. Glad to go beyond in discussion and <br/>\ndon&#39;t<br/>\nhesitate to bring up other questions. These are ones that come to my mind <br/>\nas<br/>\nprominent but you may easily and plausibly have other choices.<br/>\n<br/>\nWell let&#39;s start with right now. I&#39;ll talk about the situation in<br/>\nAfghanistan. I&#39;ll just keep to uncontroversial sources like the New York<br/>\nTimes [crowd laughter]. According to the New York Times there are 7 to 8<br/>\nmillion people in Afghanistan on the verge of starvation. That was true<br/>\nactually before September 11th. They were surviving on international aid. <br/>\nOn<br/>\nSeptember 16th, the Times reported, I&#39;m quoting it, that the United States<br/>\ndemanded from Pakistan the elimination of truck convoys that provide much <br/>\nof<br/>\nthe food and other supplies to Afghanistan&#39;s civilian population. As far <br/>\nas<br/>\nI could determine there was no reaction in the United States or for that<br/>\nmatter in Europe. I was on national radio all over Europe the next day.<br/>\nThere was no reaction in the United States or in Europe to my knowledge to<br/>\nthe demand to impose massive starvation on millions of people. The threat <br/>\nof<br/>\nmilitary strikes right after September.....around that time forced the<br/>\nremoval of international aid workers that crippled the assistance <br/>\nprograms.<br/>\nActually, I am quoting again from the New York Times. Refugees reaching<br/>\nPakistan after arduous journeys from AF are describing scenes of <br/>\ndesperation<br/>\nand fear at home as the threat of American led military attacks turns <br/>\ntheir<br/>\nlong running misery into a potential catastrophe. The country was on a<br/>\nlifeline and we just cut the line. Quoting an evacuated aid worker, in the<br/>\nNew York Times Magazine.<br/>\n<br/>\nThe World Food Program, the UN program, which is the main one by far, were<br/>\nable to resume after 3 weeks in early October, they began to resume at a<br/>\nlower level, resume food shipments. They don&#39;t have international aid<br/>\nworkers within, so the distribution system is hampered. That was suspended<br/>\nas soon as the bombing began. They then resumed but at a lower pace while<br/>\naid agencies leveled scathing condemnations of US airdrops, condemning <br/>\nthem<br/>\nas propaganda tools which are probably doing more harm than good. That<br/>\nhappens to be quoting the London Financial Times but it is easy to <br/>\ncontinue.<br/>\nAfter the first week of bombing, the New York Times reported on a back <br/>\npage<br/>\ninside a column on something else, that by the arithmetic of the United<br/>\nNations there will soon be 7.5 million Afghans in acute need of even a <br/>\nloaf<br/>\nof bread and there are only a few weeks left before the harsh winter will<br/>\nmake deliveries to many areas totally impossible, continuing to quote, but<br/>\nwith bombs falling the delivery rate is down to * of what is needed. <br/>\nCasual<br/>\ncomment. Which tells us that Western civilization is anticipating the<br/>\nslaughter of, well do the arithmetic, 3-4 million people or something like<br/>\nthat. On the same day, the leader of Western civilization dismissed with<br/>\ncontempt, once again, offers of negotiation for delivery of the alleged<br/>\ntarget, Osama bin Laden, and a request for some evidence to substantiate <br/>\nthe<br/>\ndemand for total capitulation. It was dismissed. On the same day the <br/>\nSpecial<br/>\nRapporteur of the UN in charge of food pleaded with the United States to<br/>\nstop the bombing to try to save millions of victims. As far as I&#39;m aware<br/>\nthat was unreported. That was Monday. Yesterday the major aid agencies <br/>\nOXFAM<br/>\nand Christian Aid and others joined in that plea. You can&#39;t find a report <br/>\nin<br/>\nthe New York Times. There was a line in the Boston Globe, hidden in a <br/>\nstory<br/>\nabout another topic, Kashmir.<br/>\n<br/>\nWell we could easily go on....but all of that....first of all indicates to<br/>\nus what&#39;s happening. Looks like what&#39;s happening is some sort of silent<br/>\ngenocide. It also gives a good deal of insight into the elite culture, the<br/>\nculture that we are part of. It indicates that whatever, what will happen <br/>\nwe<br/>\ndon&#39;t know, but plans are being made and programs implemented on the<br/>\nassumption that they may lead to the death of several million people in <br/>\nthe<br/>\nnext couple of weeks....very casually with no comment, no particular <br/>\nthought<br/>\nabout it, that&#39;s just kind of normal, here and in a good part of Europe. <br/>\nNot<br/>\nin the rest of the world. In fact not even in much of Europe. So if you <br/>\nread<br/>\nthe Irish press or the press in Scotland...that close, reactions are very<br/>\ndifferent. Well that&#39;s what&#39;s happening now. What&#39;s happening now is very<br/>\nmuch under our control. We can do a lot to affect what&#39;s happening. And<br/>\nthat&#39;s roughly it.<br/>\n<br/>\nAlright let&#39;s turn to the slightly more abstract question, forgetting for<br/>\nthe moment that we are in the midst of apparently trying to murder 3 or 4<br/>\nmillion people, not Taliban of course, their victims. Let&#39;s go back...turn<br/>\nto the question of the historic event that took place on September 11th. <br/>\nAs<br/>\nI said, I think that&#39;s correct. It was a historic event. Not unfortunately<br/>\nbecause of its scale, unpleasant to think about, but in terms of the scale<br/>\nit&#39;s not that unusual. I did say it&#39;s the worst...probably the worst <br/>\ninstant<br/>\nhuman toll of any crime. And that may be true. But there are terrorist<br/>\ncrimes with effects a bit more drawn out that are more extreme,<br/>\nunfortunately. Nevertheless, it&#39;s a historic event because there was a<br/>\nchange. The change was the direction in which the guns were pointed. <br/>\nThat&#39;s<br/>\nnew. Radically new. So, take US history.<br/>\n<br/>\nThe last time that the national territory of the United States was under<br/>\nattack, or for that matter, even threatened was when the British burned <br/>\ndown<br/>\nWashington in 1814. There have been many...it was common to bring up Pearl<br/>\nHarbor but that&#39;s not a good analogy. The Japanese, what ever you think<br/>\nabout it, the Japanese bombed military bases in 2 US colonies not the<br/>\nnational territory; colonies which had been taken from their inhabitants <br/>\nin<br/>\nnot a very pretty way. This is the national territory that&#39;s been attacked<br/>\non a large scale, you can find a few fringe examples but this is unique.<br/>\n<br/>\nDuring these close to 200 years, we, the United States expelled or mostly<br/>\nexterminated the indigenous population, that&#39;s many millions of people,<br/>\nconquered half of Mexico, carried out depredations all over the region,<br/>\nCaribbean and Central America, sometimes beyond, conquered Hawaii and the<br/>\nPhilippines, killing several 100,000 Filipinos in the process. Since the<br/>\nSecond World War, it has extended its reach around the world in ways I <br/>\ndon&#39;t<br/>\nhave to describe. But it was always killing someone else, the fighting was<br/>\nsomewhere else, it was others who were getting slaughtered. Not here. Not<br/>\nthe national territory.<br/>\n<br/>\nIn the case of Europe, the change is even more dramatic because its <br/>\nhistory<br/>\nis even more horrendous than ours. We are an offshoot of Europe, <br/>\nbasically.<br/>\nFor hundreds of years, Europe has been casually slaughtering people all <br/>\nover<br/>\nthe world. That&#39;s how they conquered the world, not by handing out candy <br/>\nto<br/>\nbabies. During this period, Europe did suffer murderous wars, but that was<br/>\nEuropean killers murdering one another. The main sport of Europe for<br/>\nhundreds of years was slaughtering one another. The only reason that it <br/>\ncame<br/>\nto an end in 1945, was....it had nothing to do with Democracy or not <br/>\nmaking<br/>\nwar with each other and other fashionable notions. It had to do with the<br/>\nfact that everyone understood that the next time they play the game it was<br/>\ngoing to be the end for the world. Because the Europeans, including us, <br/>\nhad<br/>\ndeveloped such massive weapons of destruction that that game just have to <br/>\nbe<br/>\nover. And it goes back hundreds of years. In the 17th century, about<br/>\nprobably 40% of the entire population of Germany was wiped out in one war.<br/>\n<br/>\nBut during this whole bloody murderous period, it was Europeans <br/>\nslaughtering<br/>\neach other, and Europeans slaughtering people elsewhere. The Congo didn&#39;t<br/>\nattack Belgium, India didn&#39;t attack England, Algeria didn&#39;t attack France.<br/>\nIt&#39;s uniform. There are again small exceptions, but pretty small in scale,<br/>\ncertainly invisible in the scale of what Europe and us were doing to the<br/>\nrest of the world. This is the first change. The first time that the guns<br/>\nhave been pointed the other way. And in my opinion that&#39;s probably why you<br/>\nsee such different reactions on the two sides of the Irish Sea which I <br/>\nhave<br/>\nnoticed, incidentally, in many interviews on both sides, national radio on<br/>\nboth sides. The world looks very different depending on whether you are<br/>\nholding the lash or whether you are being whipped by it for hundreds of<br/>\nyears, very different. So I think the shock and surprise in Europe and its<br/>\noffshoots, like here, is very understandable. It is a historic event but<br/>\nregrettably not in scale, in something else and a reason why the rest of <br/>\nthe<br/>\nworld...most of the rest of the world looks at it quite differently. Not<br/>\nlacking sympathy for the victims of the atrocity or being horrified by <br/>\nthem,<br/>\nthat&#39;s almost uniform, but viewing it from a different perspective.<br/>\nSomething we might want to understand.<br/>\n<br/>\nWell, let&#39;s go to the third question, &#39;What is the war against terrorism?&#39;<br/>\nand a side question, &#39;What&#39;s terrorism?&#39;. The war against terrorism has <br/>\nbeen<br/>\ndescribed in high places as a struggle against a plague, a cancer which is<br/>\nspread by barbarians, by &quot;depraved opponents of civilization itself.&quot; <br/>\nThat&#39;s<br/>\na feeling that I share. The words I&#39;m quoting, however, happen to be from <br/>\n20<br/>\nyears ago. Those are...that&#39;s President Reagan and his Secretary of State.<br/>\nThe Reagan administration came into office 20 years ago declaring that the<br/>\nwar against international terrorism would be the core of our foreign<br/>\npolicy....describing it in terms of the kind I just mentioned and others.<br/>\nAnd it was the core of our foreign policy. The Reagan administration<br/>\nresponded to this plague spread by depraved opponents of civilization <br/>\nitself<br/>\nby creating an extraordinary international terrorist network, totally<br/>\nunprecedented in scale, which carried out massive atrocities all over the<br/>\nworld, primarily....well, partly nearby, but not only there. I won&#39;t run<br/>\nthrough the record, you&#39;re all educated people, so I&#39;m sure you learned<br/>\nabout it in High School. [crowd laughter]<br/>\n<br/>\nBut I&#39;ll just mention one case which is totally uncontroversial, so we <br/>\nmight<br/>\nas well not argue about it, by no means the most extreme but<br/>\nuncontroversial. It&#39;s uncontroversial because of the judgments of the<br/>\nhighest international authorities the International Court of Justice, the<br/>\nWorld Court, and the UN Security Council. So this one is uncontroversial, <br/>\nat<br/>\nleast among people who have some minimal concern for international law,<br/>\nhuman rights, justice and other things like that. And now I&#39;ll leave you <br/>\nan<br/>\nexercise. You can estimate the size of that category by simply asking how<br/>\noften this uncontroversial case has been mentioned in the commentary of <br/>\nthe<br/>\nlast month. And it&#39;s a particularly relevant one, not only because it is<br/>\nuncontroversial, but because it does offer a precedent as to how a law<br/>\nabiding state would respond to...did respond in fact to international<br/>\nterrorism, which is uncontroversial. And was even more extreme than the<br/>\nevents of September 11th. I&#39;m talking about the Reagan-US war against<br/>\nNicaragua which left tens of thousands of people dead, the country ruined,<br/>\nperhaps beyond recovery.<br/>\n<br/>\nNicaragua did respond. They didn&#39;t respond by setting off bombs in<br/>\nWashington. They responded by taking it to the World Court, presenting a<br/>\ncase, they had no problem putting together evidence. The World Court<br/>\naccepted their case, ruled in their favor, ordered the...condemned what <br/>\nthey<br/>\ncalled the &quot;unlawful use of force,&quot; which is another word for <br/>\ninternational<br/>\nterrorism, by the United States, ordered the United States to terminate <br/>\nthe<br/>\ncrime and to pay massive reparations. The United States, of course,<br/>\ndismissed the court judgment with total contempt and announced that it <br/>\nwould<br/>\nnot accept the jurisdiction of the court henceforth. Then Nicaragua then<br/>\nwent to the UN Security Council which considered a resolution calling on <br/>\nall<br/>\nstates to observe international law. No one was mentioned but everyone<br/>\nunderstood. The United States vetoed the resolution. It now stands as the<br/>\nonly state on record which has both been condemned by the World Court for<br/>\ninternational terrorism and has vetoed a Security Council resolution <br/>\ncalling<br/>\non states to observe international law. Nicaragua then went to the General<br/>\nAssembly where there is technically no veto but a negative US vote amounts<br/>\nto a veto. It passed a similar resolution with only the United States,<br/>\nIsrael, and El Salvador opposed. The following year again, this time the<br/>\nUnited States could only rally Israel to the cause, so 2 votes opposed to<br/>\nobserving international law. At that point, Nicaragua couldn&#39;t do anything<br/>\nlawful. It tried all the measures. They don&#39;t work in a world that is <br/>\nruled<br/>\nby force.<br/>\n<br/>\nThis case is uncontroversial but it&#39;s by no means the most extreme. We <br/>\ngain<br/>\na lot of insight into our own culture and society and what&#39;s happening now<br/>\nby asking &#39;how much we know about all this? How much we talk about it? How<br/>\nmuch you learn about it in school? How much it&#39;s all over the front <br/>\npages?&#39;<br/>\nAnd this is only the beginning. The United States responded to the World<br/>\nCourt and the Security Council by immediately escalating the war very<br/>\nquickly, that was a bipartisan decision incidentally. The terms of the war<br/>\nwere also changed. For the first time there were official orders<br/>\ngiven...official orders to the terrorist army to attack what are called<br/>\n&quot;soft targets,&quot; meaning undefended civilian targets, and to keep away from<br/>\nthe Nicaraguan army. They were able to do that because the United States <br/>\nhad<br/>\ntotal control of the air over Nicaragua and the mercenary army was <br/>\nsupplied<br/>\nwith advanced communication equipment, it wasn&#39;t a guerilla army in the<br/>\nnormal sense and could get instructions about the disposition of the<br/>\nNicaraguan army forces so they could attack agricultural collectives, <br/>\nhealth<br/>\nclinics, and so on...soft targets with impunity. Those were the official<br/>\norders.<br/>\n<br/>\nWhat was the reaction? It was known. There was a reaction to it. The <br/>\npolicy<br/>\nwas regarded as sensible by left liberal opinion. So Michael Kinsley who<br/>\nrepresents the left in mainstream discussion, wrote an article in which he<br/>\nsaid that we shouldn&#39;t be too quick to criticize this policy as Human <br/>\nRights<br/>\nWatch had just done. He said a &quot;sensible policy&quot; must &quot;meet the test of <br/>\ncost<br/>\nbenefit analysis&quot; -- that is, I&#39;m quoting now, that is the analysis of <br/>\n&quot;the<br/>\namount of blood and misery that will be poured in, and the likelihood that<br/>\ndemocracy will emerge at the other end.&quot; Democracy as the US understands <br/>\nthe<br/>\nterm, which is graphically illustrated in the surrounding countries. <br/>\nNotice<br/>\nthat it is axiomatic that the United States, US elites, have the right to<br/>\nconduct the analysis and to pursue the project if it passes their tests. <br/>\nAnd<br/>\nit did pass their tests. It worked. When Nicaragua finally succumbed to<br/>\nsuperpower assault, commentators openly and cheerfully lauded the success <br/>\nof<br/>\nthe methods that were adopted and described them accurately. So I&#39;ll quote<br/>\nTime Magazine just to pick one. They lauded the success of the methods<br/>\nadopted: &quot;to wreck the economy and prosecute a long and deadly proxy war<br/>\nuntil the exhausted natives overthrow the unwanted government themselves,&quot;<br/>\nwith a cost to us that is &quot;minimal,&quot; and leaving the victims &quot;with wrecked<br/>\nbridges, sabotaged power stations, and ruined farms,&quot; and thus providing <br/>\nthe<br/>\nUS candidate with a &quot;winning issue&quot;: &quot;ending the impoverishment of the<br/>\npeople of Nicaragua.&quot; The New York Times had a headline saying &quot;Americans<br/>\nUnited in Joy&quot; at this outcome.<br/>\n<br/>\nThat is the culture in which we live and it reveals several facts. One is<br/>\nthe fact that terrorism works. It doesn&#39;t fail. It works. Violence usually<br/>\nworks. That&#39;s world history. Secondly, it&#39;s a very serious analytic error <br/>\nto<br/>\nsay, as is commonly done, that terrorism is the weapon of the weak. Like<br/>\nother means of violence, it&#39;s primarily a weapon of the strong,<br/>\noverwhelmingly, in fact. It is held to be a weapon of the weak because the<br/>\nstrong also control the doctrinal systems and their terror doesn&#39;t count <br/>\nas<br/>\nterror. Now that&#39;s close to universal. I can&#39;t think of a historical<br/>\nexception, even the worst mass murderers view the world that way. So pick<br/>\nthe Nazis. They weren&#39;t carrying out terror in occupied Europe. They were<br/>\nprotecting the local population from the terrorisms of the partisans. And<br/>\nlike other resistance movements, there was terrorism. The Nazis were<br/>\ncarrying out counter terror. Furthermore, the United States essentially<br/>\nagreed with that. After the war, the US army did extensive studies of Nazi<br/>\ncounter terror operations in Europe. First I should say that the US picked<br/>\nthem up and began carrying them out itself, often against the same <br/>\ntargets,<br/>\nthe former resistance. But the military also studied the Nazi methods<br/>\npublished interesting studies, sometimes critical of them because they <br/>\nwere<br/>\ninefficiently carried out, so a critical analysis, you didn&#39;t do this <br/>\nright,<br/>\nyou did that right, but those methods with the advice of Wermacht officers<br/>\nwho were brought over here became the manuals of counter insurgency, of<br/>\ncounter terror, of low intensity conflict, as it is called, and are the<br/>\nmanuals, and are the procedures that are being used. So it&#39;s not just that<br/>\nthe Nazis did it. It&#39;s that it was regarded as the right thing to do by <br/>\nthe<br/>\nleaders of western civilization, that is us, who then proceeded to do it<br/>\nthemselves. Terrorism is not the weapon of the weak. It is the weapon of<br/>\nthose who are against &#39;us&#39; whoever &#39;us&#39; happens to be. And if you can <br/>\nfind a<br/>\nhistorical exception to that, I&#39;d be interested in seeing it.<br/>\n<br/>\nWell, an interesting indication of the nature of our culture, our high<br/>\nculture, is the way in which all of this is regarded. One way it&#39;s <br/>\nregarded<br/>\nis just suppressing it. So almost nobody has ever heard of it. And the <br/>\npower<br/>\nof American propaganda and doctrine is so strong that even among the <br/>\nvictims<br/>\nit&#39;s barely known. I mean, when you talk about this to people in <br/>\nArgentina,<br/>\nyou have to remind them. Oh, yeah, that happened, we forgot about it. It&#39;s<br/>\ndeeply suppressed. The sheer consequences of the monopoly of violence can <br/>\nbe<br/>\nvery powerful in ideological and other terms.<br/>\n<br/>\nWell, one illuminating aspect of our own attitude toward terrorism is the<br/>\nreaction to the idea that Nicaragua might have the right to defend itself.<br/>\nActually I went through this in some detail with database searches and <br/>\nthat<br/>\nsort of thing. The idea that Nicaragua might have the right to defend <br/>\nitself<br/>\nwas considered outrageous. There is virtually nothing in mainstream<br/>\ncommentary indicating that Nicaragua might have that right. And that fact<br/>\nwas exploited by the Reagan administration and its propaganda in an<br/>\ninteresting way. Those of you who were around in that time will remember<br/>\nthat they periodically floated rumors that the Nicaraguans were getting <br/>\nMIG<br/>\njets, jets from Russia. At that point the hawks and the doves split. The<br/>\nhawks said, &#39;ok, let&#39;s bomb &#39;em.&#39; The doves said, `wait a minute, let&#39;s <br/>\nsee<br/>\nif the rumors are true. And if the rumors are true, then let&#39;s bomb them.<br/>\nBecause they are a threat to the United States.&#39; Why, incidentally were <br/>\nthey<br/>\ngetting MIGs. Well they tried to get jet planes from European countries <br/>\nbut<br/>\nthe United States put pressure on its allies so that it wouldn&#39;t send them<br/>\nmeans of defense because they wanted them to turn to the Russians. That&#39;s<br/>\ngood for propaganda purposes. Then they become a threat to us. Remember,<br/>\nthey were just 2 days march from Harlingen, Texas. We actually declared a<br/>\nnational emergency in 1985 to protect the country from the threat of<br/>\nNicaragua. And it stayed in force. So it was much better for them to get<br/>\narms from the Russians. Why would they want jet planes? Well, for the<br/>\nreasons I already mentioned. The United States had total control over <br/>\ntheir<br/>\nairspace, was over flying it and using that to provide instructions to the<br/>\nterrorist army to enable them to attack soft targets without running into<br/>\nthe army that might defend them. Everyone knew that that was the reason.<br/>\nThey are not going to use their jet planes for anything else. But the idea<br/>\nthat Nicaragua should be permitted to defend its airspace against a<br/>\nsuperpower attack that is directing terrorist forces to attack undefended<br/>\ncivilian targets, that was considered in the United States as outrageous <br/>\nand<br/>\nuniformly so. Exceptions are so slight, you know I can practically list<br/>\nthem. I don&#39;t suggest that you take my word for this. Have a look. That<br/>\nincludes our own senators, incidentally.<br/>\n<br/>\nAnother illustration of how we regard terrorism is happening right now. <br/>\nThe<br/>\nUS has just appointed an ambassador to the United Nations to lead the war<br/>\nagainst terrorism a couple weeks ago. Who is he? Well, his name is John<br/>\nNegroponte. He was the US ambassador in the fiefdom, which is what it is, <br/>\nof<br/>\nHonduras in the early 1980&#39;s. There was a little fuss made about the fact<br/>\nthat he must have been aware, as he certainly was, of the large-scale<br/>\nmurders and other atrocities that were being carried out by the security<br/>\nforces in Honduras that we were supporting. But that&#39;s a small part of it.<br/>\nAs proconsul of Honduras, as he was called there, he was the local<br/>\nsupervisor for the terrorist war based in Honduras, for which his <br/>\ngovernment<br/>\nwas condemned by the world court and then the Security Council in a vetoed<br/>\nresolution. And he was just appointed as the UN Ambassador to lead the war<br/>\nagainst terror. Another small experiment you can do is check and see what<br/>\nthe reaction was to this. Well, I will tell you what you are going to <br/>\nfind,<br/>\nbut find it for yourself. Now that tells us a lot about the war against<br/>\nterrorism and a lot about ourselves.<br/>\n<br/>\nAfter the United States took over the country again under the conditions<br/>\nthat were so graphically described by the press, the country was pretty <br/>\nmuch<br/>\ndestroyed in the 1980&#39;s, but it has totally collapsed since in every <br/>\nrespect<br/>\njust about. Economically it has declined sharply since the US take over,<br/>\ndemocratically and in every other respect. It&#39;s now the second poorest<br/>\ncountry in the Hemisphere. I should say....I&#39;m not going to talk about it,<br/>\nbut I mentioned that I picked up Nicaragua because it is an <br/>\nuncontroversial<br/>\ncase. If you look at the other states in the region, the state terror was<br/>\nfar more extreme and it again traces back to Washington and that&#39;s by no<br/>\nmeans all.<br/>\n<br/>\nIt was happening elsewhere in the world too, take say Africa. During the<br/>\nReagan years alone, South African attacks, backed by the United States and<br/>\nBritain, US/UK-backed South African attacks against the neighboring<br/>\ncountries killed about a million and a half people and left 60 billion<br/>\ndollars in damage and countries destroyed. And if we go around the world, <br/>\nwe<br/>\ncan add more examples.<br/>\n<br/>\nNow that was the first war against terror of which I&#39;ve given a small<br/>\nsample. Are we supposed to pay attention to that? Or kind of think that <br/>\nthat<br/>\nmight be relevant? After all it&#39;s not exactly ancient history. Well,<br/>\nevidently not as you can tell by looking at the current discussion of the<br/>\nwar on terror which has been the leading topic for the last month.<br/>\n<br/>\nI mentioned that Nicaragua has now become the 2nd poorest country in the<br/>\nhemisphere. What&#39;s the poorest country? Well that&#39;s of course Haiti which<br/>\nalso happens to be the victim of most US intervention in the 20th century <br/>\nby<br/>\na long shot. We left it totally devastated. It&#39;s the poorest country.<br/>\nNicaragua is second ranked in degree of US intervention in the 20th <br/>\ncentury.<br/>\nIt is the 2nd poorest. Actually, it is vying with Guatemala. They<br/>\ninterchange every year or two as to who&#39;s the second poorest. And they <br/>\nalso<br/>\nvie as to who is the leading target of US military intervention. We&#39;re<br/>\nsupposed to think that all of this is some sort of accident. That is has<br/>\nnothing to do with anything that happened in history. Maybe.<br/>\n<br/>\nThe worst human rights violator in the 1990&#39;s is Colombia, by a long shot.<br/>\nIt&#39;s also the, by far, the leading recipient of US military aid in the<br/>\n1990&#39;s maintaining the terror and human rights violations. In 1999, <br/>\nColombia<br/>\nreplaced Turkey as the leading recipient of US arms worldwide, that is<br/>\nexcluding Israel and Egypt which are a separate category. And that tells <br/>\nus<br/>\na lot more about the war on terror right now, in fact.<br/>\n<br/>\nWhy was Turkey getting such a huge flow of US arms? Well if you take a <br/>\nlook<br/>\nat the flow of US arms to Turkey, Turkey always got a lot of US arms. It&#39;s<br/>\nstrategically placed, a member of NATO, and so on. But the arms flow to<br/>\nTurkey went up very sharply in 1984. It didn&#39;t have anything to do with <br/>\nthe<br/>\ncold war. I mean Russian was collapsing. And it stayed high from 1984 to<br/>\n1999 when it reduced and it was replaced in the lead by Colombia. What<br/>\nhappened from 1984 to 1999? Well, in 1984, [Turkey] launched a major<br/>\nterrorist war against Kurds in southeastern Turkey. And that&#39;s when US aid<br/>\nwent up, military aid. And this was not pistols. This was jet planes, <br/>\ntanks,<br/>\nmilitary training, and so on. And it stayed high as the atrocities <br/>\nescalated<br/>\nthrough the 1990&#39;s. Aid followed it. The peak year was 1997. In 1997, US<br/>\nmilitary aid to Turkey was more than in the entire period 1950 to 1983, <br/>\nthat<br/>\nis the cold war period, which is an indication of how much the cold war <br/>\nhas<br/>\naffected policy. And the results were awesome. This led to 2-3 million<br/>\nrefugees. Some of the worst ethnic cleansing of the late 1990&#39;s. Tens of<br/>\nthousands of people killed, 3500 towns and villages destroyed, way more <br/>\nthan<br/>\nKosovo, even under NATO bombs. And the United States was providing 80% of<br/>\nthe arms, increasing as the atrocities increased, peaking in 1997. It<br/>\ndeclined in 1999 because, once again, terror worked as it usually does <br/>\nwhen<br/>\ncarried out by its major agents, mainly the powerful. So by 1999, Turkish<br/>\nterror, called of course counter-terror, but as I said, that&#39;s universal, <br/>\nit<br/>\nworked. Therefore Turkey was replaced by Colombia which had not yet<br/>\nsucceeded in its terrorist war. And therefore had to move into first place<br/>\nas recipient of US arms.<br/>\n<br/>\nWell, what makes this all particularly striking is that all of this was<br/>\ntaking place right in the midst of a huge flood of self-congratulation on<br/>\nthe part of Western intellectuals which probably has no counterpart in<br/>\nhistory. I mean you all remember it. It was just a couple years ago. <br/>\nMassive<br/>\nself-adulation about how for the first time in history we are so<br/>\nmagnificent; that we are standing up for principles and values; dedicated <br/>\nto<br/>\nending inhumanity everywhere in the new era of this-and-that, and<br/>\nso-on-and-so-forth. And we certainly can&#39;t tolerate atrocities right near<br/>\nthe borders of NATO. That was repeated over and over. Only within the<br/>\nborders of NATO where we can not only can tolerate much worse atrocities <br/>\nbut<br/>\ncontribute to them. Another insight into Western civilization and our own,<br/>\nis how often was this brought up? Try to look. I won&#39;t repeat it. But it&#39;s<br/>\ninstructive. It&#39;s a pretty impressive feat for a propaganda system to <br/>\ncarry<br/>\nthis off in a free society. It&#39;s pretty amazing. I don&#39;t think you could <br/>\ndo<br/>\nthis in a totalitarian state.<br/>\n<br/>\nAnd Turkey is very grateful. Just a few days ago, Prime Minister Ecevit<br/>\nannounced that Turkey would join the coalition against terror, very<br/>\nenthusiastically, even more so than others. In fact, he said they would<br/>\ncontribute troops which others have not willing to do. And he explained <br/>\nwhy.<br/>\nHe said, We owe a debt of gratitude to the United States because the <br/>\nUnited<br/>\nStates was the only country that was willing to contribute so massively to<br/>\nour own, in his words &quot;counter-terrorist&quot; war, that is to our own massive<br/>\nethnic cleansing and atrocities and terror. Other countries helped a <br/>\nlittle,<br/>\nbut they stayed back. The United States, on the other hand, contributed<br/>\nenthusiastically and decisively and was able to do so because of the<br/>\nsilence, servility might be the right word, of the educated classes who<br/>\ncould easily find out about it. It&#39;s a free country after all. You can <br/>\nread<br/>\nhuman rights reports. You can read all sorts of stuff. But we chose to<br/>\ncontribute to the atrocities and Turkey is very happy, they owe us a debt <br/>\nof<br/>\ngratitude for that and therefore will contribute troops just as during the<br/>\nwar in Serbia. Turkey was very much praised for using its F-16&#39;s which we<br/>\nsupplied it to bomb Serbia exactly as it had been doing with the same <br/>\nplanes<br/>\nagainst its own population up until the time when it finally succeeded in<br/>\ncrushing internal terror as they called it. And as usual, as always,<br/>\nresistance does include terror. Its true of the American Revolution. <br/>\nThat&#39;s<br/>\ntrue of every case I know. Just as its true that those who have a monopoly<br/>\nof violence talk about themselves as carrying out counter terror.<br/>\n<br/>\nNow that&#39;s pretty impressive and that has to do with the coalition that is<br/>\nnow being organized to fight the war against terror. And it&#39;s very<br/>\ninteresting to see how that coalition is being described. So have a look <br/>\nat<br/>\nthis morning&#39;s Christian Science Monitor. That&#39;s a good newspaper. One of<br/>\nthe best international newspapers, with real coverage of the world. The <br/>\nlead<br/>\nstory, the front-page story, is about how the United States, you know <br/>\npeople<br/>\nused to dislike the United States but now they are beginning to respect <br/>\nit,<br/>\nand they are very happy about the way that the US is leading the war <br/>\nagainst<br/>\nterror. And the prime example, well in fact the only serious example, the<br/>\nothers are a joke, is Algeria. Turns out that Algeria is very enthusiastic<br/>\nabout the US war against terror. The person who wrote the article is an<br/>\nexpert on Africa. He must know that Algeria is one of the most vicious<br/>\nterrorist states in the world and has been carrying out horrendous terror<br/>\nagainst its own population in the past couple of years, in fact. For a<br/>\nwhile, this was under wraps. But it was finally exposed in France by<br/>\ndefectors from the Algerian army. It&#39;s all over the place there and in<br/>\nEngland and so on. But here, we&#39;re very proud because one of the worst<br/>\nterrorist states in the world is now enthusiastically welcoming the US war<br/>\non terror and in fact is cheering on the United States to lead the war. <br/>\nThat<br/>\nshows how popular we are getting.<br/>\n<br/>\nAnd if you look at the coalition that is being formed against terror it<br/>\ntells you a lot more. A leading member of the coalition is Russia which is<br/>\ndelighted to have the United States support its murderous terrorist war in<br/>\nChechnya instead of occasionally criticizing it in the background. China <br/>\nis<br/>\njoining enthusiastically. It&#39;s delighted to have support for the <br/>\natrocities<br/>\nit&#39;s carrying out in western China against, what it called, Muslim<br/>\nsecessionists. Turkey, as I mentioned, is very happy with the war against<br/>\nterror. They are experts. Algeria, Indonesia delighted to have even more <br/>\nUS<br/>\nsupport for atrocities it is carrying out in Ache and elsewhere. Now we <br/>\ncan<br/>\nrun through the list, the list of the states that have joined the <br/>\ncoalition<br/>\nagainst terror is quite impressive. They have a characteristic in common.<br/>\nThey are certainly among the leading terrorist states in the world. And <br/>\nthey<br/>\nhappen to be led by the world champion.<br/>\n<br/>\nWell that brings us back to the question, what is terrorism? I have been<br/>\nassuming we understand it. Well, what is it? Well, there happen to be some<br/>\neasy answers to this. There is an official definition. You can find it in<br/>\nthe US code or in US army manuals. A brief statement of it taken from a US<br/>\narmy manual, is fair enough, is that terror is the calculated use of<br/>\nviolence or the threat of violence to attain political or religious<br/>\nideological goals through intimidation, coercion, or instilling fear. <br/>\nThat&#39;s<br/>\nterrorism. That&#39;s a fair enough definition. I think it is reasonable to<br/>\naccept that. The problem is that it can&#39;t be accepted because if you <br/>\naccept<br/>\nthat, all the wrong consequences follow. For example, all the <br/>\nconsequences I<br/>\nhave just been reviewing. Now there is a major effort right now at the UN <br/>\nto<br/>\ntry to develop a comprehensive treaty on terrorism. When Kofi Annan got <br/>\nthe<br/>\nNobel prize the other day, you will notice he was reported as saying that <br/>\nwe<br/>\nshould stop wasting time on this and really get down to it.<br/>\n<br/>\nBut there&#39;s a problem. If you use the official definition of terrorism in<br/>\nthe comprehensive treaty you are going to get completely the wrong <br/>\nresults.<br/>\nSo that can&#39;t be done. In fact, it is even worse than that. If you take a<br/>\nlook at the definition of Low Intensity Warfare which is official US <br/>\npolicy<br/>\nyou find that it is a very close paraphrase of what I just read. In fact,<br/>\nLow Intensity Conflict is just another name for terrorism. That&#39;s why all<br/>\ncountries, as far as I know, call whatever horrendous acts they are <br/>\ncarrying<br/>\nout, counter terrorism. We happen to call it Counter Insurgency or Low<br/>\nIntensity Conflict. So that&#39;s a serious problem. You can&#39;t use the actual<br/>\ndefinitions. You&#39;ve got to carefully find a definition that doesn&#39;t have <br/>\nall<br/>\nthe wrong consequences.<br/>\n<br/>\nThere are some other problems. Some of them came up in December 1987, at <br/>\nthe<br/>\npeak of the first war on terrorism, that&#39;s when the furor over the plague<br/>\nwas peaking. The United Nations General Assembly passed a very strong<br/>\nresolution against terrorism, condemning the plague in the strongest <br/>\nterms,<br/>\ncalling on every state to fight against it in every possible way. It <br/>\npassed<br/>\nunanimously. One country, Honduras abstained. Two votes against; the usual<br/>\ntwo, United States and Israel. Why should the United States and Israel <br/>\nvote<br/>\nagainst a major resolution condemning terrorism in the strongest terms, in<br/>\nfact pretty much the terms that the Reagan administration was using? Well,<br/>\nthere is a reason. There is one paragraph in that long resolution which <br/>\nsays<br/>\nthat nothing in this resolution infringes on the rights of people <br/>\nstruggling<br/>\nagainst racist and colonialist regimes or foreign military occupation to<br/>\ncontinue with their resistance with the assistance of others, other <br/>\nstates,<br/>\nstates outside in their just cause. Well, the United States and Israel <br/>\ncan&#39;t<br/>\naccept that. The main reason that they couldn&#39;t at the time was because of<br/>\nSouth Africa. South Africa was an ally, officially called an ally. There <br/>\nwas<br/>\na terrorist force in South Africa. It was called the African National<br/>\nCongress. They were a terrorist force officially. South Africa in contrast<br/>\nwas an ally and we certainly couldn&#39;t support actions by a terrorist group<br/>\nstruggling against a racist regime. That would be impossible.<br/>\n<br/>\nAnd of course there is another one. Namely the Israeli occupied <br/>\nterritories,<br/>\nnow going into its 35th year. Supported primarily by the United States in<br/>\nblocking a diplomatic settlement for 30 years now, still is. And you can&#39;t<br/>\nhave that. There is another one at the time. Israel was occupying Southern<br/>\nLebanon and was being combated by what the US calls a terrorist force,<br/>\nHizbullah, which in fact succeeded in driving Israel out of Lebanon. And <br/>\nwe<br/>\ncan&#39;t allow anyone to struggle against a military occupation when it is <br/>\none<br/>\nthat we support so therefore the US and Israel had to vote against the <br/>\nmajor<br/>\nUN resolution on terrorism. And I mentioned before that a US vote<br/>\nagainst...is essentially a veto. Which is only half the story. It also<br/>\nvetoes it from history. So none of this was every reported and none of it<br/>\nappeared in the annals of terrorism. If you look at the scholarly work on<br/>\nterrorism and so on, nothing that I just mentioned appears. The reason is<br/>\nthat it has got the wrong people holding the guns. You have to carefully<br/>\nhone the definitions and the scholarship and so on so that you come out <br/>\nwith<br/>\nthe right conclusions; otherwise it is not respectable scholarship and<br/>\nhonorable journalism. Well, these are some of problems that are hampering<br/>\nthe effort to develop a comprehensive treaty against terrorism. Maybe we<br/>\nshould have an academic conference or something to try to see if we can<br/>\nfigure out a way of defining terrorism so that it comes out with just the<br/>\nright answers, not the wrong answers. That won&#39;t be easy.<br/>\n<br/>\nWell, let&#39;s drop that and turn to the 4th question, What are the origins <br/>\nof<br/>\nthe September 11 crimes? Here we have to make a distinction between 2<br/>\ncategories which shouldn&#39;t be run together. One is the actual agents of <br/>\nthe<br/>\ncrime, the other is kind of a reservoir of at least sympathy, sometimes<br/>\nsupport that they appeal to even among people who very much oppose the<br/>\ncriminals and the actions. And those are 2 different things.<br/>\n<br/>\nWell, with regard to the perpetrators, in a certain sense we are not <br/>\nreally<br/>\nclear. The United States either is unable or unwilling to provide any<br/>\nevidence, any meaningful evidence. There was a sort of a play a week or <br/>\ntwo<br/>\nago when Tony Blair was set up to try to present it. I don&#39;t exactly know<br/>\nwhat the purpose of this was. Maybe so that the US could look as though <br/>\nit&#39;s<br/>\nholding back on some secret evidence that it can&#39;t reveal or that Tony <br/>\nBlair<br/>\ncould strike proper Churchillian poses or something or other. Whatever the<br/>\nPR [public relations] reasons were, he gave a presentation which was in<br/>\nserious circles considered so absurd that it was barely even mentioned. So<br/>\nthe Wall Street Journal, for example, one of the more serious papers had a<br/>\nsmall story on page 12, I think, in which they pointed out that there was<br/>\nnot much evidence and then they quoted some high US official as saying <br/>\nthat<br/>\nit didn&#39;t matter whether there was any evidence because they were going to<br/>\ndo it anyway. So why bother with the evidence? The more ideological press,<br/>\nlike the New York Times and others, they had big front-page headlines. But<br/>\nthe Wall Street Journal reaction was reasonable and if you look at the<br/>\nso-called evidence you can see why. But let&#39;s assume that it&#39;s true. It is<br/>\nastonishing to me how weak the evidence was. I sort of thought you could <br/>\ndo<br/>\nbetter than that without any intelligence service [audience laughter]. In<br/>\nfact, remember this was after weeks of the most intensive investigation in<br/>\nhistory of all the intelligence services of the western world working<br/>\novertime trying to put something together. And it was a prima facie, it <br/>\nwas<br/>\na very strong case even before you had anything. And it ended up about <br/>\nwhere<br/>\nit started, with a prima facie case. So let&#39;s assume that it is true. So<br/>\nlet&#39;s assume that, it looked obvious the first day, still does, that the<br/>\nactual perpetrators come from the radical Islamic, here called,<br/>\nfundamentalist networks of which the bin Laden network is undoubtedly a<br/>\nsignificant part. Whether they were involved or not nobody knows. It <br/>\ndoesn&#39;t<br/>\nreally matter much.<br/>\n<br/>\nThat&#39;s the background, those networks. Well, where do they come from? We<br/>\nknow all about that. Nobody knows about that better than the CIA because <br/>\nit<br/>\nhelped organize them and it nurtured them for a long time. They were <br/>\nbrought<br/>\ntogether in the 1980&#39;s actually by the CIA and its associates elsewhere:<br/>\nPakistan, Britain, France, Saudi Arabia, Egypt, China was involved, they <br/>\nmay<br/>\nhave been involved a little bit earlier, maybe by 1978. The idea was to <br/>\ntry<br/>\nto harass the Russians, the common enemy. According to President Carter&#39;s<br/>\nNational Security Advisor, Zbigniew Brzezinski, the US got involved in mid<br/>\n1979. Do you remember, just to put the dates right, that Russia invaded<br/>\nAfghanistan in December 1979. Ok. According to Brzezinski, the US support<br/>\nfor the mojahedin fighting against the government began 6 months earlier. <br/>\nHe<br/>\nis very proud of that. He says we drew the Russians into, in his words, an<br/>\nAfghan trap, by supporting the mojahedin, getting them to invade, getting<br/>\nthem into the trap. Now then we could develop this terrific mercenary <br/>\narmy.<br/>\nNot a small one, maybe 100,000 men or so bringing together the best <br/>\nkillers<br/>\nthey could find, who were radical Islamist fanatics from around North<br/>\nAfrica, Saudi Arabia....anywhere they could find them. They were often<br/>\ncalled the Afghanis but many of them, like bin Laden, were not Afghans. <br/>\nThey<br/>\nwere brought by the CIA and its friends from elsewhere. Whether Brzezinski<br/>\nis telling the truth or not, I don&#39;t know. He may have been bragging, he <br/>\nis<br/>\napparently very proud of it, knowing the consequences incidentally. But<br/>\nmaybe it&#39;s true. We&#39;ll know someday if the documents are ever released.<br/>\nAnyway, that&#39;s his perception. By January 1980 it is not even in doubt <br/>\nthat<br/>\nthe US was organizing the Afghanis and this massive military force to try <br/>\nto<br/>\ncause the Russians maximal trouble. It was a legitimate thing for the<br/>\nAfghans to fight the Russian invasion. But the US intervention was not<br/>\nhelping the Afghans. In fact, it helped destroy the country and much more.<br/>\nThe Afghanis, so called, had their own...it did force the Russians to<br/>\nwithdrew, finally. Although many analysts believe that it probably delayed<br/>\ntheir withdrawal because they were trying to get out of it. Anyway,<br/>\nwhatever, they did withdraw.<br/>\n<br/>\nMeanwhile, the terrorist forces that the CIA was organizing, arming, and<br/>\ntraining were pursuing their own agenda, right away. It was no secret. One<br/>\nof the first acts was in 1981 when they assassinated the President of <br/>\nEgypt,<br/>\nwho was one of the most enthusiastic of their creators. In 1983, one <br/>\nsuicide<br/>\nbomber, who may or may not have been connected, it&#39;s pretty shadowy, <br/>\nnobody<br/>\nknows. But one suicide bomber drove the US army-military out of Lebanon. <br/>\nAnd<br/>\nit continued. They have their own agenda. The US was happy to mobilize <br/>\nthem<br/>\nto fight its cause but meanwhile they are doing their own thing. They were<br/>\nclear very about it. After 1989, when the Russians had withdrawn, they<br/>\nsimply turned elsewhere. Since then they have been fighting in Chechnya,<br/>\nWestern China, Bosnia, Kashmir, South East Asia, North Africa, all over <br/>\nthe<br/>\nplace.<br/>\n<br/>\nThey are telling us just what they think. The United States wants to <br/>\nsilence<br/>\nthe one free television channel in the Arab world because it&#39;s <br/>\nbroadcasting<br/>\na whole range of things from Powell over to Osama bin Laden. So the US is<br/>\nnow joining the repressive regimes of the Arab world that try to shut it <br/>\nup.<br/>\nBut if you listen to it, if you listen to what bin Laden says, it&#39;s worth<br/>\nit. There is plenty of interviews. And there are plenty of interviews by<br/>\nleading Western reporters, if you don&#39;t want to listen to his own voice,<br/>\nRobert Fisk and others. And what he has been saying is pretty consistent <br/>\nfor<br/>\na long time. He&#39;s not the only one but maybe he is the most eloquent. It&#39;s<br/>\nnot only consistent over a long time, it is consistent with their actions.<br/>\nSo there is every reason to take it seriously. Their prime enemy is what<br/>\nthey call the corrupt and oppressive authoritarian brutal regimes of the<br/>\nArab world and when the say that they get quite a resonance in the region.<br/>\nThey also want to defend and they want to replace them by properly <br/>\nIslamist<br/>\ngovernments. That&#39;s where they lose the people of the region. But up till<br/>\nthen, they are with them. From their point of view, even Saudi Arabia, the<br/>\nmost extreme fundamentalist state in the world, I suppose, short of the<br/>\nTaliban, which is an offshoot, even that&#39;s not Islamist enough for them. <br/>\nOk,<br/>\nat that point, they get very little support, but up until that point they<br/>\nget plenty of support. Also they want to defend Muslims elsewhere. They <br/>\nhate<br/>\nthe Russians like poison, but as soon as the Russians pulled out of<br/>\nAfghanistan, they stopped carrying out terrorist acts in Russia as they <br/>\nhad<br/>\nbeen doing with CIA backing before that within Russia, not just in<br/>\nAfghanistan. They did move over to Chechnya. But there they are defending<br/>\nMuslims against a Russian invasion. Same with all the other places I<br/>\nmentioned. From their point of view, they are defending the Muslims <br/>\nagainst<br/>\nthe infidels. And they are very clear about it and that is what they have<br/>\nbeen doing.<br/>\n<br/>\nNow why did they turn against the United States? Well that had to do with<br/>\nwhat they call the US invasion of Saudi Arabia. In 1990, the US <br/>\nestablished<br/>\npermanent military bases in Saudi Arabia which from their point of view is<br/>\ncomparable to a Russian invasion of Afghanistan except that Saudi Arabia <br/>\nis<br/>\nway more important. That&#39;s the home of the holiest sites of Islam. And <br/>\nthat<br/>\nis when their activities turned against the Unites States. If you recall, <br/>\nin<br/>\n1993 they tried to blow up the World Trade Center. Got part of the way, <br/>\nbut<br/>\nnot the whole way and that was only part of it. The plans were to blow up<br/>\nthe UN building, the Holland and Lincoln tunnels, the FBI building. I <br/>\nthink<br/>\nthere were others on the list. Well, they sort of got part way, but not <br/>\nall<br/>\nthe way. One person who is jailed for that, finally, among the people who<br/>\nwere jailed, was a Egyptian cleric who had been brought into the United<br/>\nStates over the objections of the Immigration Service, thanks to the<br/>\nintervention of the CIA which wanted to help out their friend. A couple<br/>\nyears later he was blowing up the World Trade Center. And this has been<br/>\ngoing on all over. I&#39;m not going to run through the list but it&#39;s, if you<br/>\nwant to understand it, it&#39;s consistent. It&#39;s a consistent picture. It&#39;s<br/>\ndescribed in words. It&#39;s revealed in practice for 20 years. There is no<br/>\nreason not to take it seriously. That&#39;s the first category, the likely<br/>\nperpetrators.<br/>\n<br/>\nWhat about the reservoir of support? Well, it&#39;s not hard to find out what<br/>\nthat is. One of the good things that has happened since September 11 is <br/>\nthat<br/>\nsome of the press and some of the discussion has begun to open up to some <br/>\nof<br/>\nthese things. The best one to my knowledge is the Wall Street Journal <br/>\nwhich<br/>\nright away began to run, within a couple of days, serious reports, <br/>\nsearching<br/>\nserious reports, on the reasons why the people of the region, even though<br/>\nthey hate bin Laden and despise everything he is doing, nevertheless <br/>\nsupport<br/>\nhim in many ways and even regard him as the conscience of Islam, as one<br/>\nsaid. Now the Wall Street Journal and others, they are not surveying <br/>\npublic<br/>\nopinion. They are surveying the opinion of their friends: bankers,<br/>\nprofessionals, international lawyers, businessmen tied to the United <br/>\nStates,<br/>\npeople who they interview in MacDonalds restaurant, which is an elegant<br/>\nrestaurant there, wearing fancy American clothes. That&#39;s the people they <br/>\nare<br/>\ninterviewing because they want to find out what their attitudes are. And<br/>\ntheir attitudes are very explicit and very clear and in many ways <br/>\nconsonant<br/>\nwith the message of bin Laden and others. They are very angry at the <br/>\nUnited<br/>\nStates because of its support of authoritarian and brutal regimes; its<br/>\nintervention to block any move towards democracy; its intervention to stop<br/>\neconomic development; its policies of devastating the civilian societies <br/>\nof<br/>\nIraq while strengthening Saddam Hussein; and they remember, even if we<br/>\nprefer not to, that the United States and Britain supported Saddam Hussein<br/>\nright through his worst atrocities, including the gassing of the Kurds, <br/>\nbin<br/>\nLaden brings that up constantly, and they know it even if we don&#39;t want <br/>\nto.<br/>\nAnd of course their support for the Israeli military occupation which is<br/>\nharsh and brutal. It is now in its 35th year. The US has been providing <br/>\nthe<br/>\noverwhelming economic, military, and diplomatic support for it, and still<br/>\ndoes. And they know that and they don&#39;t like it. Especially when that is<br/>\npaired with US policy towards Iraq, towards the Iraqi civilian society <br/>\nwhich<br/>\nis getting destroyed. Ok, those are the reasons roughly. And when bin <br/>\nLaden<br/>\ngives those reasons, people recognize it and support it.<br/>\n<br/>\nNow that&#39;s not the way people here like to think about it, at least <br/>\neducated<br/>\nliberal opinion. They like the following line which has been all over the<br/>\npress, mostly from left liberals, incidentally. I have not done a real <br/>\nstudy<br/>\nbut I think right wing opinion has generally been more honest. But if you<br/>\nlook at say at the New York Times at the first op-ed they ran by Ronald<br/>\nSteel, serious left liberal intellectual. He asks Why do they hate us? <br/>\nThis<br/>\nis the same day, I think, that the Wall Street Journal was running the<br/>\nsurvey on why they hate us. So he says &quot;They hate us because we champion a<br/>\nnew world order of capitalism, individualism, secularism, and democracy <br/>\nthat<br/>\nshould be the norm everywhere.&quot; That&#39;s why they hate us. The same day the<br/>\nWall Street Journal is surveying the opinions of bankers, professionals,<br/>\ninternational lawyers and saying `look, we hate you because you are <br/>\nblocking<br/>\ndemocracy, you are preventing economic development, you are supporting<br/>\nbrutal regimes, terrorist regimes and you are doing these horrible things <br/>\nin<br/>\nthe region.&#39; A couple days later, Anthony Lewis, way out on the left,<br/>\nexplained that the terrorist seek only &quot;apocalyptic nihilism,&quot; nothing <br/>\nmore<br/>\nand nothing we do matters. The only consequence of our actions, he says,<br/>\nthat could be harmful is that it makes it harder for Arabs to join in the<br/>\ncoalition&#39;s anti-terrorism effort. But beyond that, everything we do is<br/>\nirrelevant.<br/>\n<br/>\nWell, you know, that&#39;s got the advantage of being sort of comforting. It<br/>\nmakes you feel good about yourself, and how wonderful you are. It enables <br/>\nus<br/>\nto evade the consequences of our actions. It has a couple of defects. One <br/>\nis<br/>\nit is at total variance with everything we know. And another defect is <br/>\nthat<br/>\nit is a perfect way to ensure that you escalate the cycle of violence. If<br/>\nyou want to live with your head buried in the sand and pretend they hate <br/>\nus<br/>\nbecause they&#39;re opposed to globalization, that&#39;s why they killed Sadat 20<br/>\nyears ago, and fought the Russians, tried to blow up the World Trade <br/>\nCenter<br/>\nin 1993. And these are all people who are in the midst of ... corporate<br/>\nglobalization but if you want to believe that, yeh...comforting. And it <br/>\nis a<br/>\ngreat way to make sure that violence escalates. That&#39;s tribal violence. <br/>\nYou<br/>\ndid something to me, I&#39;ll do something worse to you. I don&#39;t care what the<br/>\nreasons are. We just keep going that way. And that&#39;s a way to do it. <br/>\nPretty<br/>\nmuch straight, left-liberal opinion.<br/>\n<br/>\nWhat are the policy options? Well, there are a number. A narrow policy<br/>\noption from the beginning was to follow the advice of really far out<br/>\nradicals like the Pope [audience laughter]. The Vatican immediately said<br/>\nlook it&#39;s a horrible terrorist crime. In the case of crime, you try to <br/>\nfind<br/>\nthe perpetrators, you bring them to justice, you try them. You don&#39;t kill<br/>\ninnocent civilians. Like if somebody robs my house and I think the guy who<br/>\ndid it is probably in the neighborhood across the street, I don&#39;t go out<br/>\nwith an assault rifle and kill everyone in that neighborhood. That&#39;s not <br/>\nthe<br/>\nway you deal with crime, whether it&#39;s a small crime like this one or <br/>\nreally<br/>\nmassive one like the US terrorist war against Nicaragua, even worse ones <br/>\nand<br/>\nothers in between. And there are plenty of precedents for that. In fact, I<br/>\nmentioned a precedent, Nicaragua, a lawful, a law abiding state, that&#39;s <br/>\nwhy<br/>\npresumably we had to destroy it, which followed the right principles. Now <br/>\nof<br/>\ncourse, it didn&#39;t get anywhere because it was running up against a power<br/>\nthat wouldn&#39;t allow lawful procedures to be followed. But if the United<br/>\nStates tried to pursue them, nobody would stop them. In fact, everyone <br/>\nwould<br/>\napplaud. And there are plenty of other precedents.<br/>\n<br/>\nWhen the IRA set off bombs in London, which is pretty serious business,<br/>\nBritain could have, apart from the fact that it was unfeasible, let&#39;s put<br/>\nthat aside, one possible response would have been to destroy Boston which <br/>\nis<br/>\nthe source of most of the financing. And of course to wipe out West <br/>\nBelfast.<br/>\nWell, you know, quite apart from the feasibility, it would have been<br/>\ncriminal idiocy. The way to deal with it was pretty much what they did. <br/>\nYou<br/>\nknow, find the perpetrators; bring them to trial; and look for the <br/>\nreasons.<br/>\nBecause these things don&#39;t come out of nowhere. They come from something.<br/>\nWhether it is a crime in the streets or a monstrous terrorist crime or<br/>\nanything else. There&#39;s reasons. And usually if you look at the reasons, <br/>\nsome<br/>\nof them are legitimate and ought to be addressed, independently of the<br/>\ncrime, they ought to be addressed because they are legitimate. And that&#39;s<br/>\nthe way to deal with it. There are many such examples.<br/>\n<br/>\nBut there are problems with that. One problem is that the United States <br/>\ndoes<br/>\nnot recognize the jurisdiction of international institutions. So it can&#39;t <br/>\ngo<br/>\nto them. It has rejected the jurisdiction of the World Court. It has <br/>\nrefused<br/>\nto ratify the International Criminal Court. It is powerful enough to set <br/>\nup<br/>\na new court if it wants so that wouldn&#39;t stop anything. But there is a<br/>\nproblem with any kind of a court, mainly you need evidence. You go to any<br/>\nkind of court, you need some kind of evidence. Not Tony Blair talking <br/>\nabout<br/>\nit on television. And that&#39;s very hard. It may be impossible to find.<br/>\n<br/>\nYou know, it could be that the people who did it, killed themselves. <br/>\nNobody<br/>\nknows this better than the CIA. These are decentralized, nonhierarchic<br/>\nnetworks. They follow a principle that is called Leaderless Resistance.<br/>\nThat&#39;s the principle that has been developed by the Christian Right<br/>\nterrorists in the United States. It&#39;s called Leaderless Resistance. You <br/>\nhave<br/>\nsmall groups that do things. They don&#39;t talk to anybody else. There is a<br/>\nkind of general background of assumptions and then you do it. Actually<br/>\npeople in the anti war movement are very familiar with it. We used to call<br/>\nit affinity groups. If you assume correctly that whatever group you are in<br/>\nis being penetrated by the FBI, when something serious is happening, you<br/>\ndon&#39;t do it in a meeting. You do it with some people you know and trust, <br/>\nan<br/>\naffinity group and then it doesn&#39;t get penetrated. That&#39;s one of the <br/>\nreasons<br/>\nwhy the FBI has never been able to figure out what&#39;s going on in any of <br/>\nthe<br/>\npopular movements. And other intelligence agencies are the same. They <br/>\ncan&#39;t.<br/>\nThat&#39;s leaderless resistance or affinity groups, and decentralized <br/>\nnetworks<br/>\nare extremely hard to penetrate. And it&#39;s quite possible that they just<br/>\ndon&#39;t know. When Osama bin Laden claims he wasn&#39;t involved, that&#39;s <br/>\nentirely<br/>\npossible. In fact, it&#39;s pretty hard to imagine how a guy in a cave in<br/>\nAfghanistan, who doesn&#39;t even have a radio or a telephone could have <br/>\nplanned<br/>\na highly sophisticated operation like that. Chances are it&#39;s part of the<br/>\nbackground. You know, like other leaderless resistance terrorist groups.<br/>\nWhich means it&#39;s going to be extremely difficult to find evidence.<br/>\n<br/>\nAnd the US doesn&#39;t want to present evidence because it wants to be able to<br/>\ndo it, to act without evidence. That&#39;s a crucial part of the reaction. You<br/>\nwill notice that the US did not ask for Security Council authorization <br/>\nwhich<br/>\nthey probably could have gotten this time, not for pretty reasons, but<br/>\nbecause the other permanent members of the Security Council are also<br/>\nterrorist states. They are happy to join a coalition against what they <br/>\ncall<br/>\nterror, namely in support of their own terror. Like Russia wasn&#39;t going to<br/>\nveto, they love it. So the US probably could have gotten Security Council<br/>\nauthorization but it didn&#39;t want it. And it didn&#39;t want it because it<br/>\nfollows a long-standing principle which is not George Bush, it was <br/>\nexplicit<br/>\nin the Clinton administration, articulated and goes back much further and<br/>\nthat is that we have the right to act unilaterally. We don&#39;t want<br/>\ninternational authorization because we act unilaterally and therefore we<br/>\ndon&#39;t want it. We don&#39;t care about evidence. We don&#39;t care about<br/>\nnegotiation. We don&#39;t care about treaties. We are the strongest guy <br/>\naround;<br/>\nthe toughest thug on the block. We do what we want. Authorization is a bad<br/>\nthing and therefore must be avoided. There is even a name for it in the<br/>\ntechnical literature. It&#39;s called establishing credibility. You have to<br/>\nestablish credibility. That&#39;s an important factor in many policies. It was<br/>\nthe official reason given for the war in the Balkans and the most <br/>\nplausible<br/>\nreason.<br/>\n<br/>\nYou want to know what credibility means, ask your favorite Mafia Don. <br/>\nHe&#39;ll<br/>\nexplain to you what credibility means. And it&#39;s the same in international<br/>\naffairs, except it&#39;s talked about in universities using big words, and <br/>\nthat<br/>\nsort of thing. But it&#39;s basically the same principle. And it makes sense.<br/>\nAnd it usually works. The main historian who has written about this in the<br/>\nlast couple years is Charles Tilly with a book called Coercion, Capital, <br/>\nand<br/>\nEuropean States. He points out that violence has been the leading <br/>\nprinciple<br/>\nof Europe for hundreds of years and the reason is because it works. You<br/>\nknow, it&#39;s very reasonable. It almost always works. When you have an<br/>\noverwhelming predominance of violence and a culture of violence behind it.<br/>\nSo therefore it makes sense to follow it. Well, those are all problems in<br/>\npursuing lawful paths. And if you did try to follow them you&#39;d really open<br/>\nsome very dangerous doors. Like the US is demanding that the Taliban hand<br/>\nover Osama bin Laden. And they are responding in a way which is regarded <br/>\nas<br/>\ntotally absurd and outlandish in the west, namely they are saying, Ok, but<br/>\nfirst give us some evidence. In the west, that is considered ludicrous. <br/>\nIt&#39;s<br/>\na sign of their criminality. How can they ask for evidence? I mean if<br/>\nsomebody asked us to hand someone over, we&#39;d do it tomorrow. We wouldn&#39;t <br/>\nask<br/>\nfor any evidence. [crowd laughter].<br/>\n<br/>\nIn fact it is easy to prove that. We don&#39;t have to make up cases. So for<br/>\nexample, for the last several years, Haiti has been requesting the United<br/>\nStates to extradite Emmanuel Constant. He is a major killer. He is one of<br/>\nthe leading figures in the slaughter of maybe 4000 or 5000 people in the<br/>\nyears in the mid 1990&#39;s, under the military junta, which incidentally was<br/>\nbeing, not so tacitly, supported by the Bush and the Clinton <br/>\nadministrations<br/>\ncontrary to illusions. Anyway he is a leading killer. They have plenty of<br/>\nevidence. No problem about evidence. He has already been brought to trial<br/>\nand sentenced in Haiti and they are asking the United States to turn him<br/>\nover. Well, I mean do your own research. See how much discussion there has<br/>\nbeen of that. Actually Haiti renewed the request a couple of weeks ago. It<br/>\nwasn&#39;t even mentioned. Why should we turn over a convicted killer who was<br/>\nlargely responsible for killing 4000 or 5000 people a couple of years ago.<br/>\nIn fact, if we do turn him over, who knows what he would say. Maybe he&#39;ll<br/>\nsay that he was being funded and helped by the CIA, which is probably <br/>\ntrue.<br/>\nWe don&#39;t want to open that door. And he is not he only one.<br/>\n<br/>\nI mean, for the last about 15 years, Costa Rica which is the democratic<br/>\nprize, has been trying to get the United States to hand over a John Hull, <br/>\na<br/>\nUS land owner in Costa Rica, who they charge with terrorist crimes. He was<br/>\nusing his land, they claim with good evidence as a base for the US war<br/>\nagainst Nicaragua, which is not a controversial conclusion, remember. <br/>\nThere<br/>\nis the World Court and Security Council behind it. So they have been <br/>\ntrying<br/>\nto get the United States to hand him over. Hear about that one? No.<br/>\n<br/>\nThey did actually confiscate the land of another American landholder, John<br/>\nHamilton. Paid compensation, offered compensation. The US refused. Turned<br/>\nhis land over into a national park because his land was also being used <br/>\nas a<br/>\nbase for the US attack against Nicaragua. Costa Rica was punished for that<br/>\none. They were punished by withholding aid. We don&#39;t accept that kind of<br/>\ninsubordination from allies. And we can go on. If you open the door to<br/>\nquestions about extradition it leads in very unpleasant directions. So <br/>\nthat<br/>\ncan&#39;t be done.<br/>\n<br/>\nWell, what about the reactions in Afghanistan. The initial proposal, the<br/>\ninitial rhetoric was for a massive assault which would kill many people<br/>\nvisibly and also an attack on other countries in the region. Well the Bush<br/>\nadministration wisely backed off from that. They were being told by every<br/>\nforeign leader, NATO, everyone else, every specialist, I suppose, their <br/>\nown<br/>\nintelligence agencies that that would be the stupidest thing they could<br/>\npossibly do. It would simply be like opening recruiting offices for bin<br/>\nLaden all over the region. That&#39;s exactly what he wants. And it would be<br/>\nextremely harmful to their own interests. So they backed off that one. And<br/>\nthey are turning to what I described earlier which is a kind of silent<br/>\ngenocide. It&#39;s a.... well, I already said what I think about it. I don&#39;t<br/>\nthink anything more has to be said. You can figure it out if you do the<br/>\narithmetic.<br/>\n<br/>\nA sensible proposal which is kind of on the verge of being considered, but<br/>\nit has been sensible all along, and it is being raised, called for by<br/>\nexpatriate Afghans and allegedly tribal leaders internally, is for a UN<br/>\ninitiative, which would keep the Russians and Americans out of it, <br/>\ntotally.<br/>\nThese are the 2 countries that have practically wiped the country out in <br/>\nthe<br/>\nlast 20 years. They should be out of it. They should provide massive<br/>\nreparations. But that&#39;s their only role. A UN initiative to bring together<br/>\nelements within Afghanistan that would try to construct something from the<br/>\nwreckage. It&#39;s conceivable that that could work, with plenty of support <br/>\nand<br/>\nno interference. If the US insists on running it, we might as well quit. <br/>\nWe<br/>\nhave a historical record on that one.<br/>\n<br/>\nYou will notice that the name of this operation....remember that at first <br/>\nit<br/>\nwas going to be a Crusade but they backed off that because PR (public<br/>\nrelations) agents told them that that wouldn&#39;t work [audience laughter]. <br/>\nAnd<br/>\nthen it was going to be Infinite Justice, but the PR agents said, wait a<br/>\nminute, you are sounding like you are divinity. So that wouldn&#39;t work. And<br/>\nthen it was changed to enduring freedom. We know what that means. But <br/>\nnobody<br/>\nhas yet pointed out, fortunately, that there is an ambiguity there. To<br/>\nendure means to suffer. [audience laughter]. And a there are plenty of<br/>\npeople around the world who have endured what we call freedom. Again,<br/>\nfortunately we have a very well-behaved educated class so nobody has yet<br/>\npointed out this ambiguity. But if its done there will be another problem <br/>\nto<br/>\ndeal with. But if we can back off enough so that some more or less<br/>\nindependent agency, maybe the UN, maybe credible NGO&#39;s (non governmental<br/>\norganizations) can take the lead in trying to reconstruct something from <br/>\nthe<br/>\nwreckage, with plenty of assistance and we owe it to them. Them maybe<br/>\nsomething would come out. Beyond that, there are other problems.<br/>\n<br/>\nWe certainly want to reduce the level of terror, certainly not escalate <br/>\nit.<br/>\nThere is one easy way to do that and therefore it is never discussed. <br/>\nNamely<br/>\nstop participating in it.&lt;br/&gt;&lt;br/&gt;(Message over 64 KB, truncated)</div>","specialLinks":[]},{"userId":59556253,"authorName":"Charles Whittom Jr.","from":"&quot;Charles Whittom Jr.&quot; &lt;cywhittom@...&gt;","profile":"cywhittom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Fw:  John Walker Lindh","postDate":"1008569961","msgId":30006,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNjAwMWMxODZjMiRjNDc4OTllMCRjODZiYTIxOEBob3QucnIuY29tPg==","referencesHeader":"PDAwMjEwMWMxODY2NyRiOTllNTc0MCQzMTVkZDFkMUBqaWRhMzU+"},"prevInTopic":29978,"nextInTopic":30034,"prevInTime":30005,"nextInTime":30007,"topicId":29978,"numMessagesInTopic":0,"msgSnippet":"Preach on, Lynda! This is exactly what so many in PS need to hear today.  This IS what brought about the whole problem in the U.S.A. today, and in fact, the","messageBody":"<div id=\"ygrps-yiv-1723284984\">Preach on, Lynda!   <br/>\n<br/>\nThis is exactly what so many in PS need to hear today.  This IS what brought about the whole problem in the U.S.A. today, and in fact, the whole world.  Maybe that is also what led bin Laden into his role.  He got too much money and power and not enough guidance.<br/>\n<br/>\nCharles Whittom, husband to DW Young, father to dd&#39;s Sasha (12), Stella (11) & ds Charles III (9)<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: Lynda <br/>\n  To: Unschooling-dotcom@yahoogroups.com ; schools_out@yahoogroups.com ; UnschoolersCircle@yahoogroups.com ; Many-Paths@yahoogroups.com ; HEM-Networking@yahoogroups.com <br/>\n  Sent: Sunday, December 16, 2001 1:24 PM<br/>\n  Subject: [Unschooling-dotcom] Fw: John Walker Lindh<br/>\n<br/>\n<br/>\n  Hmmmm, interesting.<br/>\n<br/>\n  Lynda<br/>\n  ----- Original Message -----<br/>\n<br/>\n  &gt;<br/>\n  http://www.boston.com/dailyglobe2/347/oped/Blame_Lindh_s_permissive_parents%<br/>\n  2B.shtml<br/>\n  &gt;<br/>\n  &gt; Blame Lindh&#39;s permissive parents<br/>\n  &gt; By Jeff Jacoby, 12/13/2001<br/>\n  &gt;<br/>\n  &gt; IT ISN&#39;T THE CASE that the parents of John Walker Lindh - the Marin<br/>\n  &gt; County child of privilege turned Taliban terrorist - never drew the line<br/>\n  &gt; with their son.<br/>\n  &gt;<br/>\n  If she and Frank Lindh had been less concerned with flaunting their<br/>\n  &gt; open-mindedness and more concerned with developing their son&#39;s moral<br/>\n  &gt; judgment, he wouldn&#39;t be where he is today. His road to treason and<br/>\n  &gt; jihad didn&#39;t begin in Afghanistan. It began in Marin County, with<br/>\n  &gt; parents who never said &quot;no.&quot;<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":1694471,"authorName":"Lynda","from":"&quot;Lynda&quot; &lt;lurine@...&gt;","profile":"anoydami","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Fw:  John Walker Lindh","postDate":"1008530684","msgId":29978,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMjEwMWMxODY2NyRiOTllNTc0MCQzMTVkZDFkMUBqaWRhMzU+"},"prevInTopic":0,"nextInTopic":30006,"prevInTime":29977,"nextInTime":29979,"topicId":29978,"numMessagesInTopic":0,"msgSnippet":"Hmmmm, interesting. Lynda ... http://www.boston.com/dailyglobe2/347/oped/Blame_Lindh_s_permissive_parents% 2B.shtml","messageBody":"<div id=\"ygrps-yiv-1152784228\">Hmmmm, interesting.<br/>\n<br/>\nLynda<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message -----<br/>\n<br/>\n&gt;<br/>\nhttp://www.boston.com/dailyglobe2/347/oped/Blame_Lindh_s_permissive_parents%<br/>\n2B.shtml<br/>\n&gt;<br/>\n&gt; Blame Lindh&#39;s permissive parents<br/>\n&gt; By Jeff Jacoby, 12/13/2001<br/>\n&gt;<br/>\n&gt; IT ISN&#39;T THE CASE that the parents of John Walker Lindh - the Marin<br/>\n&gt; County child of privilege turned Taliban terrorist - never drew the line<br/>\n&gt; with their son.<br/>\n&gt;<br/>\n&gt; True, they didn&#39;t do so when he was 14 and his consuming passion was<br/>\n&gt; collecting hip-hop CDs with especially nasty lyrics.<br/>\n&gt;<br/>\n&gt; And true, they didn&#39;t interfere when when he announced at 16 that he was<br/>\n&gt; going to drop out of Tamiscal High School - the elite &quot;alternative&quot;<br/>\n&gt; school where students determined their own course of study and only saw<br/>\n&gt; a teacher once a week.<br/>\n&gt;<br/>\n&gt; And granted, they didn&#39;t put their foot down when he decided to become a<br/>\n&gt; Muslim after reading &quot;The Autobiography of Malcolm X&quot; and took to<br/>\n&gt; wearing long white robes and an oversized skullcap. On the contrary: His<br/>\n&gt; father was &quot;proud of John for pursuing an alternative course&quot; and his<br/>\n&gt; mother told friends that it was &quot;good for a child to find a passion.&quot;<br/>\n&gt;<br/>\n&gt; Nor did they object when he began spending more and more time at a local<br/>\n&gt; mosque and set about trying to memorize the Koran.<br/>\n&gt;<br/>\n&gt; Nor when he asked his parents to pay his way to Yemen so he could learn<br/>\n&gt; to speak &quot;pure&quot; Arabic.<br/>\n&gt;<br/>\n&gt; Nor when he headed to Pakistan to join a madrassa in a region known to<br/>\n&gt; be a stronghold of Islamist extremists.<br/>\n&gt;<br/>\n&gt; And his parents didn&#39;t balk when he went to fight in Afghanistan - but<br/>\n&gt; that, at least, they didn&#39;t know about: He hadn&#39;t told them. Perhaps he<br/>\n&gt; had learned to take their consent for granted.<br/>\n&gt;<br/>\n&gt; Only once, it seems, did Frank Lindh and Marilyn Walker actually deny<br/>\n&gt; their son something he wanted. When he first adopted Islam and took the<br/>\n&gt; name Sule yman, they refused to use it and insisted on calling him John.<br/>\n&gt; After all, he had been named for one of the giants of our time: John<br/>\n&gt; Lennon.<br/>\n&gt;<br/>\n&gt; Their refusal must have amazed him. For as long as he could remember,<br/>\n&gt; his oh-so-progressive parents had answered &quot;yes&quot; to his every whim,<br/>\n&gt; indulged his every fancy, permitted - even praised - his every passion.<br/>\n&gt; The only thing they insisted on was that nothing be insisted on. Nothing<br/>\n&gt; in his life was important enough for them to make an issue of: not his<br/>\n&gt; schooling, not his religion, not his appearance, not even whether he<br/>\n&gt; stayed in America or moved - while still a minor - to a benighted Third<br/>\n&gt; World oligarchy halfway around the world. Nothing. Except, of course,<br/>\n&gt; their right to call him by the name of their favorite Beatle.<br/>\n&gt;<br/>\n&gt; Devout practitioners of the self-obsessed nonjudgmentalism for which the<br/>\n&gt; Bay Area is renowned, Lindh and Walker appear never to have rebuked<br/>\n&gt; their son or criticized his choices. In their world, there were no<br/>\n&gt; absolutes, no fixed truths, no mandatory behavior, no thou-shalt-nots.<br/>\n&gt; If they had one conviction, it was that all convictions are worthy -<br/>\n&gt; that nothing is intolerable except intolerance.<br/>\n&gt;<br/>\n&gt; But even in Marin County, there are times when children need to hear<br/>\n&gt; &quot;no&quot; and &quot;don&#39;t.&quot; They need to know that there are limits they must<br/>\n&gt; respect and expectations they must try to live up to. If they cannot<br/>\n&gt; find those limits at home, they are apt to look for them elsewhere.<br/>\n&gt; Newsweek calls it &quot;truly perplexing&quot; that John Lindh, who &quot;grew up in<br/>\n&gt; possibly the most liberal, tolerant place in America ... was drawn to<br/>\n&gt; the most illiberal, intolerant sect in Islam.&quot; There is nothing<br/>\n&gt; perplexing about it. He craved standards and discipline. Mom and Dad<br/>\n&gt; didn&#39;t offer any. The Taliban did.<br/>\n&gt;<br/>\n&gt; Even when it was clear that their son was sinking into Islamist<br/>\n&gt; fanaticism, they wouldn&#39;t pull back on the reins. When Osama bin Laden&#39;s<br/>\n&gt; terrorists bombed the USS Cole and killed 17 American servicemen, John<br/>\n&gt; Lindh e-mailed his father that the attack had been justified, since by<br/>\n&gt; docking the ship in Yemen, the United States had committed &quot;an act of<br/>\n&gt; war.&quot; Frank Lindh now says that the message &quot;raised my concerns&quot; - but<br/>\n&gt; that didn&#39;t stop him from wiring his son another $1,200. After all, says<br/>\n&gt; Dad, &quot;my days of molding him were over.&quot; It isn&#39;t clear that they ever<br/>\n&gt; began.<br/>\n&gt;<br/>\n&gt; It came as a jolt to his parents when John Lindh turned up at the<br/>\n&gt; fortress near Mazar-e-Sharif, sporting an AK-47 and calling himself<br/>\n&gt; Abdul Hamid. But the revelation that their son had enlisted in Al Qaeda<br/>\n&gt; and supported the Sept. 11 attacks brought no words of reproach to their<br/>\n&gt; lips.<br/>\n&gt;<br/>\n&gt; John Lindh deserved &quot;a little kick in the butt&quot; for keeping them in the<br/>\n&gt; dark about his plans, his father said, but otherwise they just wanted to<br/>\n&gt; &quot;give him a big hug.&quot; His mother, meanwhile, was quite sure that &quot;if he<br/>\n&gt; got involved with the Taliban he must have been brainwashed.... When<br/>\n&gt; you&#39;re young and impressionable, it&#39;s easy to be led by charismatic<br/>\n&gt; people.&quot;<br/>\n&gt;<br/>\n&gt; Yes, it is, and it&#39;s a pity that that didn&#39;t occur to her sooner. If she<br/>\n&gt; and Frank Lindh had been less concerned with flaunting their<br/>\n&gt; open-mindedness and more concerned with developing their son&#39;s moral<br/>\n&gt; judgment, he wouldn&#39;t be where he is today. His road to treason and<br/>\n&gt; jihad didn&#39;t begin in Afghanistan. It began in Marin County, with<br/>\n&gt; parents who never said &quot;no.&quot; </span></blockquote></div>","specialLinks":[]}],"prevTopicId":30070,"nextTopicId":30057}}