{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Lynda","from":"&quot;Lynda&quot; &lt;lurine@...&gt;","replyTo":"LIST","senderId":"gZubyECPgCNtmzyAfCrTSa_S4zAF1U5pnYEEa27bHs7_s5-igqsZ2VJTfIz-P8tHNDFh9c6BPn039nr6jNJLC6ZrTA","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Fw:  Indian Artifacts","postDate":"990599336","msgId":21786,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxMzIwMWMwZTM1NyQxZGVlNzJjMCQ5YjVkZDFkMUBsZGlvbm5vPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":21785,"nextInTime":21787,"topicId":21786,"numMessagesInTopic":0,"msgSnippet":"This is forwarded with the permission of the author.  As I said to him, perhaps folks on this list would better understand how we feel about folks that claim","messageBody":"<div id=\"ygrps-yiv-333816434\">This is forwarded with the permission of the author.  As I said to him,<br/>\nperhaps folks on this list would better understand how we feel about folks<br/>\nthat claim &quot;knowledge&quot; and other bits and pieces of our heritage and<br/>\nreligion if they read it from him.<br/>\n<br/>\nSo, for those that want a better understanding than my writing seems to have<br/>\ngiven, please read all the way to the end before you make your judgement.<br/>\n<br/>\nAlso, before you make a judgement, you need to understand that selling<br/>\n&quot;knowledge&quot; or &quot;history&quot; is frowned upon.  If one has &quot;knowledge,&quot; one is<br/>\nsuppose to share it.  The only &quot;price&quot; should be a place to sleep and a meal<br/>\nwhich should be volunteered and maybe a donation or two to cover gas to the<br/>\nnext stop in a traveler&#39;s journey.  And, yes this is done, still today.<br/>\n<br/>\nLynda<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message -----<br/>\n&gt; Lynda,<br/>\n&gt;<br/>\n&gt; Yes, I would be honored to have you &quot;borrow&quot; this<br/>\n&gt; piece.<br/>\n&gt;<br/>\n&gt; Thank you kindly,<br/>\n&gt; Richie<br/>\n<br/>\n &gt; ----- Original Message -----<br/>\n<br/>\n &gt; Here we go again...<br/>\n<br/>\n&gt;There was an advertisement for a presentation on,<br/>\n&gt; &quot;Native American Artifacts and Story Telling,&quot; to be<br/>\n&gt; held today in one of my neighboring communities.  My<br/>\n&gt; sister and I went because we wanted to see who the<br/>\n&gt; person was and what the presentation was. Wow!<br/>\n<br/>\n&gt; First off, let me share with you that &quot;Indian Time&quot; is<br/>\n&gt; alive and well! The presentation started at 10:00 am<br/>\n&gt; but we didn&#39;t get there until about 10:25. Then, once<br/>\n&gt; we get there, we had to pay a $3.00 fee. So, I&#39;m a<br/>\n&gt; good egg, paid my money and walked in. Wow!<br/>\n<br/>\n&gt; The presenter was a white lady with some of her<br/>\n&gt; &quot;collectables&quot; and she&#39;s telling her stories. I won&#39;t<br/>\n&gt; go into great detail on what she said or was saying,<br/>\n&gt; but I will say this: Typical. How many times do we see<br/>\n&gt; this happen across the country? How many times do<br/>\n&gt; we have to stand by and watch as someone from the<br/>\n&gt; community who collects things and can tell some<br/>\n&gt; stories of traveling acroos the US and then come back<br/>\n&gt; and share them as knowledgeable people on Native<br/>\n&gt; Americans? And, more shaming than ever, get paid for<br/>\n&gt; it!! Well, here&#39;s what my sister and I did the last<br/>\n&gt; thirty minutes of her presentation.<br/>\n<br/>\n&gt; First off, when we walked in the room, the look the<br/>\n&gt; lady gave us could&#39;ve stopped a train! Talk about<br/>\n&gt; crossing someone&#39;s boundaries. She gave us a look of<br/>\n&gt; pure disgust, it was then I knew we were welcomed!<br/>\n&gt; But to her credit, she kept right on talking. As she was<br/>\n&gt; making a point on something, someone in the crowd<br/>\n&gt; asked how many Indians there are in America. The lady<br/>\n&gt; said, &quot;I don&#39;t know, I don&#39;t really care about<br/>\n&gt; figures.&quot; So, I raised my hand and told them,<br/>\n&gt; &quot;Depending on the statistics you read, anywhere from<br/>\n&gt; 1.95 to 2.0 million.&quot; That&#39;s when I received another<br/>\n&gt; cold look!<br/>\n<br/>\n&gt; Now she was talking about the poverty, unemployment<br/>\n&gt; and economic status of Indian people, but then said<br/>\n&gt; the following: &quot;But the Navajo are one of the richest<br/>\n&gt; tribes in America because they mine uranium on their<br/>\n&gt; land.&quot; Up went my sister&#39;s hand. She then went on to<br/>\n&gt; tell everyone and correct the presenter about the<br/>\n&gt; mining issue. Cold look number two and three! By the<br/>\n&gt; way, after that response, she no longer called on me<br/>\n&gt; or my sister.<br/>\n<br/>\n&gt; When she was finished with her presentation, about<br/>\n&gt; five or six people came over by my sister and I and<br/>\n&gt; started to ask us more questions. Don&#39;t know if there<br/>\n&gt; was another cold look, but I did feel a small cool<br/>\n&gt; breeze down my back. When I was finished talking<br/>\n&gt; with these people, I went up to speak with the<br/>\n&gt; presenter.  She treated me very nice. We had a good<br/>\n&gt; conversation, but here&#39;s the kicker.<br/>\n<br/>\n&gt; She told me she has a collection of over 1600 items.<br/>\n&gt; She said she has been collecting for years and invited<br/>\n&gt; me over to see it. I told her, &quot;No thank you, I don&#39;t<br/>\n&gt; really need to see what you own. But I am curious, do<br/>\n&gt; you have any Eagle feathers?&quot; &quot;Oh, no,&quot; she said very<br/>\n&gt; firmly, &quot;It&#39;s illegal to own Eagle, Owl or Hawk<br/>\n&gt; feathers. Besides, they&#39;re sacred items. But, I do<br/>\n&gt; have some spiritual and sacred items that I never<br/>\n&gt; bring out. Maybe you&#39;d like to see those?&quot; I looked at<br/>\n&gt; her and said, &quot;If they are in fact sacred and<br/>\n&gt; spiritual, how did you come about getting them?&quot;<br/>\n&gt; She looked at me and said, &quot;Well, I bought most of<br/>\n&gt; them.&quot;<br/>\n<br/>\n&gt; For the life of me I should no longer be surprised at<br/>\n&gt; these things. But I still get pissed off. Here&#39;s a<br/>\n&gt; lady giving a speech on me and she has no clue at<br/>\n&gt; all on who I am. Now, before anyone gets their<br/>\n&gt; underwear all in a bind, let me say this: When I say she&#39;s<br/>\n&gt; talking about me, some people come back on me and<br/>\n&gt; say there&#39;s no way she&#39;s doing that. That she&#39;s<br/>\n&gt; talking about the heritage and culture of the Native<br/>\n&gt; American.<br/>\n<br/>\n&gt; Well, I got news for you, pal...THAT&#39;S WHO I AM!!!<br/>\n<br/>\n&gt; Joe Public seems to forget that we&#39;re still here and<br/>\n&gt; still living our lives as close to we can as it was<br/>\n&gt; before those boats landed. What&#39;s more amazing is the<br/>\n&gt; people in the audience...they&#39;re taking all this shit<br/>\n&gt; as gospel! I was sitting in the hall waiting for my<br/>\n&gt; sister when one of the ladies in attendance said,<br/>\n&gt; &quot;Well thank you very much. I learned so much about<br/>\n&gt; Native Americans today. Things I never knew before.&quot;<br/>\n<br/>\n&gt; I think I&#39;ll change my name.<br/>\n<br/>\n&gt;&quot;Richie Artifact&quot; has a good ring to it. I think I&#39;ll<br/>\n&gt; go on the raod and speak about the life and times<br/>\n&gt; of the Jewish Community and artifacts from Holland.<br/>\n<br/>\n&gt; Would you pay $3.00 a head to hear that?<br/>\n<br/>\n&gt; Me neither.<br/>\n<br/>\n&gt; Richie Plass<br/>\n&gt; Warren, Ohio </span></blockquote></div>","specialLinks":[]}],"prevTopicId":21763,"nextTopicId":21789}}