{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":134300842,"authorName":"Brenda Rose","from":"&quot;Brenda Rose&quot; &lt;rosebl@...&gt;","profile":"homeanduva2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: To do or not to do (college)","postDate":"1101504238","msgId":101413,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxZmYwMWM0ZDNmZSQzZTFmNTA1MCQ2NTAxYThjMEBCcmVuZGE+","referencesHeader":"PDExMDE0NjM5MDQuNTI1LjQ4NzQ1Lm0xMkB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":101412,"nextInTime":101414,"topicId":101413,"numMessagesInTopic":0,"msgSnippet":"This morning my 22 yo dd  Martha and I went shopping.   She is home for Thanksgiving from her 4-yr. private college, where she is a senior.  We saw a lady","messageBody":"<div id=\"ygrps-yiv-41284739\">This morning my 22 yo dd  Martha and I went shopping.   She is home for <br/>\nThanksgiving from her 4-yr. private college, where she is a senior.  We saw <br/>\na lady frrom our former church, whose dd just went to the same college as a <br/>\nfreshman this year.  The mother told us how hard the semester has been for <br/>\nher dd, that (public) high school was hard enough, but that the girl is <br/>\nreally having a tough transition.  She wants to stay, but already needs to <br/>\npull grades up.<br/>\n    Martha started telling how she had started by taking classes at the <br/>\nlocal community college, to get used to the level of work required, and then <br/>\nhad made the transition to the four year school.   It had worked very well, <br/>\nshe had adjusted then to being away from home, she was  glad she had chosen <br/>\nthat route, etc.<br/>\n    It was so good for me to hear that she actually liked the way she chose <br/>\nto do college and isn&#39;t sorry that she hadn&#39;t gone straight to a four-year <br/>\nor left home sooner.  She was homeschooled (very, very relaxed) after 2nd <br/>\ngrade until she began college.   My older ds had done college the same way, <br/>\nand it was good to hear Martha talking about it to someone else, telling her <br/>\nthe benefits, even though it&#39;s too late for her dd.  It gave me a nice warm <br/>\nfeeling to hear one of my children affirm that she liked the way we chose to <br/>\ndo things in our family, both the parts we chose for her (such as trying out <br/>\nhomeschooling) and the parts she chose herself.:-)<br/>\n<br/>\nI know that both my ds 26 and dd 22 are happy that they chose community <br/>\ncollege, first a few classes, then  full loads, then with 40+ credits, <br/>\ntransfer to a 4-year school.<br/>\nNeither ever took SATs or ACTs.  They both did well enough at the community <br/>\ncollege to have partial scholarships at the four-year.<br/>\n<br/>\nBy the way, ds knew pretty much what he wanted to do since age 5, and dd <br/>\ndecided on her major while at community college, but is now taking a <br/>\ndifferent direction for grad school.  And dd 24 chose to go to cosmetology <br/>\nschool and has been working happily in that field for about 6 years.  I <br/>\nreally believe that all children are unique and will approach life, <br/>\nlearning, possible college, and employment in their own way. FWIW<br/>\n<br/>\nBrenda Rose</div>","specialLinks":[]}],"prevTopicId":101376,"nextTopicId":101414}}