{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Lynda","from":"&quot;Lynda&quot; &lt;lurine@...&gt;","replyTo":"LIST","senderId":"iZZ-Ry1aj_HHBesI5xXwC5uvj1bPard6JN1nbPQqz8owe_vAvJyOWuirOFh-lIgColmb96jyoNBAS4W_ggpuRwO8rw","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Heads Up On OFBA","postDate":"980621463","msgId":15419,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAyMjkwMWMwODg5MiQxZjI1MTJlMCQyMjVkZDFkMUBsZGlvbm5vPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":15418,"nextInTime":15420,"topicId":15419,"numMessagesInTopic":0,"msgSnippet":"Dumbya owes big time for the support he received during his campaign from religious organizations.  He and Read My Lips have a long history of backroom deal","messageBody":"<div id=\"ygrps-yiv-1649841486\">Dumbya owes big time for the support he received during his campaign from<br/>\nreligious organizations.  He and Read My Lips have a long history of<br/>\nbackroom deal making (spell that money laundering) with the Catholic Church<br/>\nvia D&#39;Onofrio.  It would appear that it is no payback time.<br/>\n<br/>\nThis is no different than the way he kissed up to women during the campaign<br/>\nto get their votes with statements and evasions about abortion issues.<br/>\n<br/>\nHeaven help those that don&#39;t belong to an &quot;approved&quot; religious group if he<br/>\nmanages to get this through Congress!<br/>\n<br/>\nLynda<br/>\nIf Ignorance Is Bliss Why Aren&#39;t More People Happy?<br/>\n<br/>\n** AU REPORT ON &#39;FAITH-BASED&#39; INITIATIVES<br/>\n** The Dallas Morning News article on faith-based initiatives<br/>\n** Knight Ridder/Tribune News Service article on faith-based initiatives<br/>\n-------------------------------------------------------------------------<br/>\n<br/>\nJanuary 26, 2001<br/>\nAmericans United for Separation of Church and State<br/>\n<br/>\nPRESIDENT BUSH AND &#39;FAITH-BASED&#39; INITIATIVES<br/>\nAU Report And Answers To Frequently Asked Questions<br/>\n<br/>\nPresident George W. Bush has announced that the week of January 29, the<br/>\nsecond full week of his presidency, will be devoted to building support for<br/>\n&quot;faith-based&quot; government initiatives. As part of his approach, Bush<br/>\nreportedly will be unveiling a new federal office of &quot;faith-based action,&quot;<br/>\nalong with the details of his administration&#39;s plans to fund religious<br/>\ngroups to provide social services.<br/>\n<br/>\nAmericans United for Separation of Church and State has prepared this<br/>\ndocument to provide background information on Bush&#39;s position on the issue,<br/>\nhis record in Texas and a preview of what will likely be discussed based on<br/>\nthe president&#39;s materials and speeches made available during the<br/>\npresidential campaign.<br/>\n<br/>\n&quot;Bush intends to throw the massive weight of the federal government behind<br/>\nreligious groups and religious conversions,&quot; said the Rev. Barry W. Lynn,<br/>\nexecutive director of Americans United.  The president appears to believe<br/>\nthat the government should use religion to solve all of the nation&#39;s social<br/>\nproblems. This approach strikes at the heart of the religious freedoms<br/>\nguaranteed by the First Amendment.&quot;<br/>\n<br/>\nBush&#39;s Support For &#39;Charitable Choice&#39;<br/>\n<br/>\nDuring the 2000 presidential campaign, Bush was often vague about specific<br/>\npositions on public policy. On faith-based initiatives (or &quot;charitable<br/>\nchoice,&quot; as it is often called), Bush never vacillated in his enthusiastic<br/>\nsupport.<br/>\n<br/>\nCharitable choice originated with former-Sen. John Ashcroft (R-Mo.) during<br/>\nthe drafting of the 1996 Welfare Reform Act. The concept altered existing<br/>\nlaw to permit taxpayer-financed social service funding of houses of worship<br/>\nin a few welfare programs.<br/>\n<br/>\nThis legislative approach represented a radical change. In the past,<br/>\ngovernment would contract with religious groups to provide services, but<br/>\nsafeguards were kept in place to protect the integrity of the groups and the<br/>\ninterests of taxpayers. Religious institutions would have to create separate<br/>\nsecular entities to deal with public funds.  Charitable choice removed those<br/>\nsafeguards, allowing groups to evangelize while providing publicly financed<br/>\nservices. It also permits groups to discriminate in hiring on religious<br/>\ngrounds, despite financial support for the government.<br/>\n<br/>\nBush quickly became a fervent advocate of the policy, and as Texas&#39;<br/>\ngovernor, was among the nation&#39;s first chief executives to implement<br/>\ncharitable choice at the state level. Shortly after charitable choice became<br/>\nlaw in Washington, D.C., Bush created a 16-member Governor&#39;s Advisory Task<br/>\nForce on Faith-Based Community Service Groups, which issued a report calling<br/>\nfor a church-state partnership in the Lone Star State. Bush subsequently<br/>\nissued an executive order directing state agencies to work with houses of<br/>\nworship to provide social services while allowing them to maintain their<br/>\n&quot;unique ecclesiastical nature.&quot;<br/>\n<br/>\nExpanding Existing Programs As President<br/>\n<br/>\nAs president, Bush intends to expand the charitable choice approach to<br/>\nunprecedented levels, applying the principle to virtually all aspects of<br/>\ngovernment aid. (For specifics, see Bush&#39;s campaign website at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.georgewbush.com/issues/armiescompassion.html\">http://www.georgewbush.com/issues/armiescompassion.html</a><br/>\n<br/>\n&quot;In every instance when my administration sees a responsibility to help<br/>\npeople, we will look first to faith-based institutions, to charities and to<br/>\ncommunity groups that have shown their ability to save and change lives,&quot;<br/>\nBush said on July 22, 1999, at a rally in Indianapolis.<br/>\n<br/>\nAccording to news media reports, Bush proposes spending $8 billion during<br/>\nhis first year in office on tax incentives for charitable donations and in<br/>\ndirect support to charities and religious groups. (That figure may<br/>\nultimately be even higher. On Sept. 21, 2000, Bush wrote in USA Today that<br/>\nhe would allocate $80 billion over 10 years in tax incentives to help<br/>\nchurches provide services.) Bush has expressed concern that existing federal<br/>\nfunding mechanisms may not be efficient enough in distributing tax dollars<br/>\nto religious ministries so he has promised a new government agency to make<br/>\nthings easier.<br/>\n<br/>\nBush has explained that the new agency, once in place, will remove barriers<br/>\nthat prevent additional funding of religious groups, coordinate federal<br/>\nfunding from multiple government agencies and encourage states to establish<br/>\ntheir own faith-based offices to facilitate state funds going to religious<br/>\ngroups.<br/>\n<br/>\nIt is his position on this issue that serves as the single most serious<br/>\nthreat to church-state separation.<br/>\n<br/>\n&quot;Bush is proposing an unprecedented program of government funding of<br/>\nreligion, involving literally billions in taxpayer dollars,&quot; said Americans<br/>\nUnited&#39;s Lynn. &quot;His plan for social services would essentially merge church<br/>\nand state into a single bureaucracy that would dispense religion alongside<br/>\ngovernment aid.&quot;<br/>\n<br/>\nThe Effect Of Bush&#39;s Changes<br/>\n<br/>\nThe practical effects of Bush&#39;s proposals would be sweeping and dramatic.<br/>\nUnder his plan, Bush would distribute federal tax dollars to religious<br/>\ngroups to provide a plethora of social services now being provided by<br/>\ngovernment agencies or secular groups. He wants religious groups to provide<br/>\nservices in areas including after-school programs for children, job<br/>\ntraining, drug treatment, prison rehabilitation programs and abstinence<br/>\nprograms.<br/>\n<br/>\nIn other words, Bush intends to use tax dollars, houses of worship and his<br/>\noffice of faith-based action to create church-state &quot;partnerships&quot; at an<br/>\nunparalleled level. In the process, the president literally hopes to change<br/>\nthe lives of millions of Americans. As Bush wrote in the foreword to Marvin<br/>\nOlasky&#39;s Compassionate Conservatism, a 2000 book about expanding charitable<br/>\nchoice, &quot;Government can do certain things very well, but it cannot put hope<br/>\nin our hearts or a sense of purpose in our lives. That requires churches and<br/>\nsynagogues and mosques and charities.&quot;<br/>\n<br/>\nChurch-state experts describe the new faith-based government agency as part<br/>\nof a misguided and dangerous approach to public policy. &quot;The Constitution<br/>\nrequires a separation between religion and government, not a government<br/>\nagency designed to unite the two,&quot; said AU&#39;s Lynn. &quot;The very existence of a<br/>\nfederal office whose sole purpose is to give tax dollars to religious groups<br/>\nis in irreparable conflict with the First Amendment.&quot;<br/>\n<br/>\nAmericans United Responds To Frequently Asked Questions<br/>\n<br/>\n* How will the needy people who receive assistance from the religious groups<br/>\nbe affected by Bush&#39;s approach?<br/>\n<br/>\nThe religious freedom of beneficiaries would be threatened. Those in need<br/>\ncould be subjected to religious indoctrination when they are sent to a<br/>\nreligious organization to obtain their government benefits. Religious<br/>\norganizations are able to combine the government services with various forms<br/>\nof religious indoctrination, such as religious teaching or the excessive<br/>\ndisplay of religious icons or symbols.<br/>\n<br/>\nAll of this amounts to a serious violation of religious liberty. Imagine the<br/>\ndiscomfort of a Roman Catholic family referred to Louis Farrakhan&#39;s Nation<br/>\nof Islam for help, or a Hindu directed to a Mormon temple to get assistance.<br/>\n<br/>\nIn many communities, Bush&#39;s policies will put the poor in an impossible<br/>\nposition. They will either submit to religious coercion or go without food,<br/>\nshelter or other needed services to which they are legally entitled. Placing<br/>\npeople in need in this kind of position is wrong. In theory, charitable<br/>\nchoice is supposed to offer secular alternatives, but as a practical matter,<br/>\nthose alternatives are not always available to those in need.<br/>\n<br/>\n* Will Bush&#39;s policy lead to federally funded employment discrimination?<br/>\n<br/>\nAbsolutely. When religious groups receive tax dollars through charitable<br/>\nchoice, they are free to discriminate on religious grounds in hiring.<br/>\nAllowing religious groups to take tax aid and still discriminate will be a<br/>\ncentral part of the plan implemented by Bush&#39;s new government agency. A<br/>\nreligious group will be able to receive public tax dollars to pay for a job,<br/>\nbut still be free to hang up a sign that says &quot;Jews And Catholics Need Not<br/>\nApply.&quot;<br/>\n<br/>\nJust imagine: your money pays for a job that you can&#39;t have because of your<br/>\nreligious beliefs. That&#39;s not compassionate conservatism; that&#39;s outrageous.<br/>\n<br/>\nUnder Bush&#39;s plan, it will be perfectly legal. Taxpayer money should never<br/>\nbe used to subsidize any type of discrimination.<br/>\n<br/>\n* Isn&#39;t Bush concerned about the faith-based initiative conflicting with the<br/>\nFirst Amendment?<br/>\n<br/>\nBush is apparently aware of the constitutional difficulties surrounding<br/>\nexpansive public funding of ministries to provide government services, yet<br/>\nhe seems to have little use for church-state separation.<br/>\n<br/>\nFor example, in a July campaign speech, Bush brushed aside legal<br/>\ndifficulties. &quot;I&#39;m told by the legal experts that my initiative will pass<br/>\nconstitutional muster,&quot; Bush said. &quot;We will send money to fund services. But<br/>\nthe money does not go to fund the religious programs within the<br/>\ninstitution.&quot;<br/>\n<br/>\nThis is a distinction without a difference. In most cases, the services<br/>\nbeing provided are explicitly religious. Thus, there is no way to fund<br/>\nreligious programs without also funding religion.<br/>\n<br/>\n* If Bush believes religion is the key to changing lives, why doesn&#39;t he<br/>\nadmit he wants to fund religious services?<br/>\n<br/>\nIt&#39;s a half-hearted attempt to make this effort seem legal. But just as<br/>\nimportantly, it exposes a serious flaw in Bush&#39;s approach to this policy.<br/>\n<br/>\nOn the one hand, the president openly acknowledges that public funds cannot<br/>\ngo to finance religion. On the other hand, Bush believes adamantly that it<br/>\nis religion that has the power to &quot;change lives,&quot; which is why he thinks<br/>\nreligious ministries deserve government support. Complicating matters, Bush<br/>\nbelieves the groups should get public funds without strings. In a December<br/>\n1996 speech in San Antonio, Bush said Christian ministers will provide<br/>\npublic services with tax dollars &quot;on their terms, not ours.&quot;<br/>\n<br/>\nThis creates a paradox. Bush cannot change people&#39;s lives by funding<br/>\nreligious ministries and maintain the façade that tax dollars aren&#39;t<br/>\nfinancing religion. If Bush intends to change lives by funding religion,<br/>\nhe&#39;s violating the Constitution in the process. Unfortunately for his<br/>\nadministration, Bush can&#39;t have it both ways.<br/>\n<br/>\n* Will all religious groups be eligible for funding under Bush&#39;s plan?<br/>\n<br/>\nApparently not. Initially, Bush said all groups would be able to receive<br/>\ngovernment funds. In his 1999 speech in Indianapolis, Bush insisted that<br/>\nservices provided by ministries be &quot;non-sectarian&quot; and said, &quot;We will keep a<br/>\ncommitment to pluralism [and] not discriminate for or against Methodist or<br/>\nMormons or Muslims or good people with no faith at all.&quot;<br/>\n<br/>\nHowever, in the spring of 2000, Bush was asked if tax dollars would be<br/>\ndistributed to the Nation of Islam to provide publicly financed services. &quot;I<br/>\ndon&#39;t see how we can allow public dollars to fund programs where spite and<br/>\nhate is the core of the message,&quot; Bush said on March 2. &quot;Louis Farrakhan<br/>\npreaches hate.&quot;<br/>\n<br/>\nThese comments suggest that there are problems with the policy to which Bush<br/>\nhas not prepared solutions. Legal experts already question whether public<br/>\nfunding of multiple religious groups is legal, but Bush would run into an<br/>\nimmediate constitutional quagmire if he selects some faith traditions for<br/>\npublic support, while excluding others.<br/>\n<br/>\n* How will the religious institutions be affected by Bush&#39;s efforts?<br/>\n<br/>\nBush&#39;s plan threatens the independence of the religious institutions. The<br/>\ngovernment regulates activities that it subsidizes, since it is obliged to<br/>\nmake certain that taxpayer funds are properly spent. Once churches, temples,<br/>\nmosques and synagogues are being financed by the public, some of their<br/>\nfreedom will be placed in jeopardy by the almost certain regulation to<br/>\nfollow.<br/>\n<br/>\nFurthermore, many houses of worship already do a fine job operating soup<br/>\nkitchens and homeless shelters with voluntary contributions. Many houses of<br/>\nworship believe that they are called by their religious faith to provide<br/>\nthese services. Participation in these programs and the tendency of people<br/>\nin the pews to &quot;dig a little deeper&quot; to help fund them may draw congregants<br/>\nmore fully into the lives of their churches. Inevitably these contributions<br/>\nfrom church members will diminish if religious institutions start receiving<br/>\npublic dollars to provide services. In the long run, charitable choice will<br/>\nmake religious institutions dependent on the government for money and lessen<br/>\nchurch vitality.<br/>\n<br/>\n * * * * *<br/>\n&quot;There&#39;s nothing compassionate about Bush&#39;s legally dubious scheme,&quot;<br/>\nconcluded AU&#39;s Lynn. &quot;Contributions to religious groups must come from<br/>\nsupporters voluntarily, not be forced by the government. Bush&#39;s faith-based<br/>\ninitiative is a constitutional nightmare and a disastrous step in the wrong<br/>\ndirection.&quot;<br/>\n<br/>\nAmericans United is a religious liberty watchdog group based in Washington,<br/>\nD.C. Founded in 1947, the organization represents 60,000 members and allied<br/>\nhouses of worship in all 50 states.<br/>\n<br/>\n------------------------------------------------------------<br/>\nThe Dallas Morning News<br/>\nJanuary 26, 2001, Friday<br/>\n<br/>\nBush to roll out faith-based initiatives, prescription drug plan next week<br/>\n<br/>\nBy G. Robert Hillman<br/>\n<br/>\nWASHINGTON -- President Bush, working down his list of campaign promises,<br/>\nwill offer Congress next week his proposals to aid faith-based charities and<br/>\nhis plan to help the elderly meet the high costs of prescription drugs,<br/>\naides said Thursday.<br/>\nAs a prelude, the new president and first lady Laura Bush had dinner<br/>\nThursday night in eighboring Hyattsville, Md., with the Rev. Theodore<br/>\nMcCarrick, the Catholic archbishop of Washington who has been elevated to<br/>\ncardinal.<br/>\n<br/>\nWhite House press secretary Ari Fleischer, who previewed next week&#39;s agenda,<br/>\nnoted that Bush had made his faith-based initiatives a cornerstone of his<br/>\ncampaign and was determined to offer his proposals to Congress early in his<br/>\nadministration.<br/>\n<br/>\n&quot;There are more ways to help people,&quot; Fleischer said, calling Bush&#39;s<br/>\ninitiatives the next step in welfare reform.<br/>\n<br/>\n&quot;Faith-based solutions are one way to help those people make a better life.&quot;<br/>\n<br/>\nDuring the campaign, the former Texas governor vowed to rally the &quot;armies of<br/>\ncompassion&quot; to help deliver social services.<br/>\n<br/>\nHe has proposed to allow taxpayers who do not itemize to deduct their<br/>\ncharitable contributions, at a cost in lost revenue of about $6.3 billion a<br/>\nyear.<br/>\n<br/>\nAdditionally, he has called for another $1.7 billion in charitable grants<br/>\nand the creation of an Office of Faith-Based Action.<br/>\n<br/>\n&quot;The president made a series of promises during the campaign, and he&#39;s going<br/>\nto honor them,&quot; Fleischer said. &quot;There will be weeks where we have a strong<br/>\nfocus on an issue. There will be weeks where there will be several issues<br/>\ndiscussed.&quot;<br/>\n<br/>\nAlso next week, Fleischer said the president plans to address one of the<br/>\nmore contentious campaign issues: prescription drug benefits for the<br/>\nelderly.<br/>\n<br/>\nThe initial proposals to change the 35-year-old Medicare health-care program<br/>\nfor the elderly would involve only Bush&#39;s stop-gap program to provide poor<br/>\nseniors with some relief for the high costs of their prescription drugs,<br/>\nFleischer said.<br/>\n<br/>\nEven before the president formally offered his faith-based initiatives,<br/>\nhowever, critics continue to question whether they might violate the<br/>\nseparation of church and state provision of the Constitution.<br/>\n<br/>\n&quot;The Constitution created a separation between religion and government, not<br/>\na massive new bureaucracy designed to unite the two,&quot; said the Rev. Barry<br/>\nLynn, executive director of Americans United for Separation of Church and<br/>\nState.<br/>\n<br/>\nResponding, the president told reporters in a brief question-and-answer<br/>\nsession in the Cabinet Room that he was confident his proposals would meet<br/>\nconstitutional muster.</div>","specialLinks":[]}],"prevTopicId":15414,"nextTopicId":15418}}