{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":13,"messages":[{"userId":24983553,"authorName":"schuyler_waynforth","from":"&quot;schuyler_waynforth&quot; &lt;dwaynf@...&gt;","profile":"schuyler_waynforth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: &quot;socializing with non-homeschoolers&quot;: long and a bit academic","postDate":"1019587315","msgId":35741,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGFhNDl0aitvNjI4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE5Zi4xMmRhNmM4LjI5ZjZmYWE4QGFvbC5jb20+"},"prevInTopic":35739,"nextInTopic":0,"prevInTime":35740,"nextInTime":35742,"topicId":35675,"numMessagesInTopic":0,"msgSnippet":"... itself a factor ... school. ... child EVER ... measuring ... many who are ... I met a woman the other day who is unschooling her daughter.  Her daughter","messageBody":"<div id=\"ygrps-yiv-855028095\">--- In Unschooling-dotcom@y..., SandraDodd@a... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; And finding a group of homeschoolers and trying to make that <br/>\n </span></blockquote>itself a factor <br/>\n<blockquote><span title=\"ireply\"> &gt; will need to take into account whether the kids used to be in <br/>\n </span></blockquote>school.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; For example, about studying reading in unschooled kids--if that <br/>\n </span></blockquote>child EVER <br/>\n<blockquote><span title=\"ireply\"> &gt; went to school or had reading lessons, they&#39;re no longer good for <br/>\n </span></blockquote>measuring <br/>\n<blockquote><span title=\"ireply\"> &gt; how long it will take without being taught.   There aren&#39;t that <br/>\n </span></blockquote>many who are <br/>\n<blockquote><span title=\"ireply\"> &gt; a &quot;clean catch,&quot; untainted by other factors.<br/>\n&gt; <br/>\n&gt; &quot;Confounding variables&quot; are all over the damned place!!<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n<br/>\n </span></blockquote>I met a woman the other day who is unschooling her daughter.  Her <br/>\ndaughter went to school briefly (daughter&#39;s choice, mothers&#39; <br/>\nfrustration) and in that moment learned to read.  Now whenever they <br/>\ntalk about school derisively the daughter says &quot;But I learned how to <br/>\nread there.&quot;  No matter that the time in prior to that is how she <br/>\nreally learned to read.  Sigh...  So much schooling invading the <br/>\npurity of our unschooled little darlings.  <br/>\n<br/>\nSchuyler</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: &quot;socializing with non-homeschoolers&quot;: long and a bit academic","postDate":"1019584680","msgId":35739,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5Zi4xMmRhNmM4LjI5ZjZmYWE4QGFvbC5jb20+"},"prevInTopic":35728,"nextInTopic":35741,"prevInTime":35738,"nextInTime":35740,"topicId":35675,"numMessagesInTopic":0,"msgSnippet":"In a message dated 4/23/02 10:48:07 AM, dwaynf@unm.edu writes: ","messageBody":"<div id=\"ygrps-yiv-1426373725\">In a message dated 4/23/02 10:48:07 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dwaynf@...\">dwaynf@...</a> writes:<br/>\n<br/>\n&lt;&lt; As far as I know there are very few studies on homeschoolers in <br/>\ngeneral.  Homeschoolers are considered a self-selected population <br/>\nand due to that setting up causality becomes incredibly <br/>\nproblematic.  &gt;&gt;<br/>\n<br/>\nAnd finding a group of homeschoolers and trying to make that itself a factor <br/>\nwill need to take into account whether the kids used to be in school.<br/>\n<br/>\nFor example, about studying reading in unschooled kids--if that child EVER <br/>\nwent to school or had reading lessons, they&#39;re no longer good for measuring <br/>\nhow long it will take without being taught.   There aren&#39;t that many who are <br/>\na &quot;clean catch,&quot; untainted by other factors.<br/>\n<br/>\n&quot;Confounding variables&quot; are all over the damned place!!<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":24983553,"authorName":"schuyler_waynforth","from":"&quot;schuyler_waynforth&quot; &lt;dwaynf@...&gt;","profile":"schuyler_waynforth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: &quot;socializing with non-homeschoolers&quot;: long and a bit academic","postDate":"1019579256","msgId":35728,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGFhNDIxbytoN3NsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEwMi4xNDJhMjY4Zi4yOWY2YTU2M0Bhb2wuY29tPg=="},"prevInTopic":35720,"nextInTopic":35739,"prevInTime":35727,"nextInTime":35729,"topicId":35675,"numMessagesInTopic":0,"msgSnippet":"... As far as I know there are very few studies on homeschoolers in general.  Homeschoolers are considered a self-selected population and due to that setting","messageBody":"<div id=\"ygrps-yiv-1512325562\">--- In Unschooling-dotcom@y..., Katedavislawfirm@a... wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Does anyone know if there are any formal studies on this subject?<br/>\n&gt; <br/>\n&gt; Kate Davis<br/>\n<br/>\n </span></blockquote>As far as I know there are very few studies on homeschoolers in <br/>\ngeneral.  Homeschoolers are considered a self-selected population <br/>\nand due to that setting up causality becomes incredibly <br/>\nproblematic.  So, interpreting whether or not children who have been <br/>\nhomeschooled are less sexually precocious due to the amount of <br/>\nparental investment given or due to some other common denominator <br/>\namong homeschooled children is considered to difficult to be <br/>\ntenable. <br/>\n<br/>\nHowever, there are a number of studies on the direct care of <br/>\nchildren and the effect that has on age at first sexual <br/>\nexperience.  &quot;Risk factors and life processes associated with <br/>\nteenage pregnancy: Results of a prospective study from birth to 20 <br/>\nyears&quot;, Woodward L, Fergusson DM, Horwood LJ. JOURNAL OF MARRIAGE <br/>\nAND THE FAMILY v. 63(#4) pp. 1170-1184 NOV 2001.  This study found <br/>\nthat those girls who were raised in a &quot;family environment <br/>\ncharacterized by parental instability&quot; were more likely to have had <br/>\na teenage pregnancy. &quot;Sex differences in disposition towards kin, <br/>\nsecurity of adult attachment, and sociosexuality as a function of <br/>\nparental divorce&quot;, Barber N. EVOLUTION AND HUMAN BEHAVIOR v. 19(#2) <br/>\npp. 125-132 MAR 1998. Barber found that parental divorce - which he <br/>\npredicted to be associated with lower levels of parental care - was <br/>\nassociated with a higher sociosexuality index (a survey produced by <br/>\nSteve Gangestad and Jeffrey Simpson to measure willingness to be <br/>\nsexually active), a lower willingness to help others, and lower <br/>\nGPAs.  Of course another study done in Australia <br/>\n(&quot;What distinguishes women with unusually high numbers of sex <br/>\npartners?&quot;, Mikach SM, Bailey JM. EVOLUTION AND HUMAN BEHAVIOR v. 20<br/>\n(#3) pp. 141-150 MAY 1999) found no recalled family adversity linked <br/>\nwith a higher level of sociosexuality.  In fact the only link found <br/>\nwas: &quot;[o]n several measures related to masculinity, women with many <br/>\nsex partners were elevated compared with other women.&quot; Bailey, <br/>\nhowever, is heavily invested in attachment theory and later <br/>\nsuggested that the Sociosexuality Index while affective in measuring <br/>\nmale sexuality missed in measuring female sexuality as evidenced by <br/>\nthe findings he made in this study. Barber has done another study <br/>\n(&quot;The role of reproductive strategies in academic attainment&quot;, SEX <br/>\nROLES v. 38(#3-4) pp. 313-323 FEB 1998) that found an association <br/>\nbetween parental divorce and higher sociosexuality and lower GPA.  <br/>\n<br/>\nActually, it is hard to do this kind of search. Figuring out what <br/>\nthe keywords would be is really tricky. <br/>\n<br/>\nAnyhow. There are a few bodies of theory about early ages at first <br/>\nsexual experience and family dynamics.  Draper and Harpending (both <br/>\nanthropologists, but oddly using evolutionary psychology to examine <br/>\nearly age at first menstruation) found an association between father <br/>\nabsence and earlier ages at menarche (first menstruation).  They <br/>\nhypothesized that this was due to the environment of their <br/>\nupbringing.  That is, due to the absence of their father these girls <br/>\nwere being brought up in an environment that taught them that men <br/>\nwere unstable and that they should get all they can from men.  So <br/>\nthey become sexually active early in order to coerce resources from <br/>\npotential mates for a longer period of time.  This is all done <br/>\nbiologically and not consciously. The problem with this theory IMO <br/>\nis that they are speaking of an evolved mechanism that seems fairly <br/>\nrigid.  That is if the environment changes before menarche is <br/>\nreached--for example their mothers move into a more stable <br/>\nrelationship--than the systems are already in place and they reach <br/>\nmenarche early and they become sexual active in a way not predicted <br/>\nfor by their current environment.  And given that a number of <br/>\nstudies have recently found that the time of greatest effect of <br/>\nfather absence on likelihood of children to enter college is in the <br/>\nhigh school years, we seem to be fairly sensitive to our <br/>\nenvironment.  Also, these findings have not been replicated outside <br/>\nof modern populations.  Among Mayans and Ache (a population of <br/>\nhunter-gatherers living in Paraguay) my dh found that father absence <br/>\nwas associated with later ages at first reproduction in men(he was <br/>\nlooking at male sexuality).  There is also a recent, non-published <br/>\nstudy by Sara Grainger looking at 415 women in Liverpool that could <br/>\nnot replicate the findings of Draper and Harpending, of Belsky and <br/>\nof Ellis and of others. She argues that there may be type 1 errors <br/>\nin the sampling and statistical methods used by the researchers, as <br/>\nwell as confounding variables that may have produced findings that <br/>\nwould not have been found otherwise.<br/>\n<br/>\nThe main problem with this hypothesis is evolution.  Under the <br/>\nrubric of evolution those creatures that can produce the greatest <br/>\nnumber of offspring will have the greatest number of genetic <br/>\nrepresentatives in future generations. Reaching menarche earlier, if <br/>\nthere is no subsequent cost, should be associated with greater <br/>\noffspring number.  And greater offspring number (Kaplan, etal--don&#39;t <br/>\nremember the year) has been associated with greater grandchildren <br/>\nnumber.  So, why would humans have evolved so that the most <br/>\nadvantaged (i.e., those with two parent households) have the fewest <br/>\nnumber of offspring.  One, we may have historically, and <br/>\nprehistorically, suffered greater mortality when one parent was <br/>\nabsent.  Although Hill and Hurtado, 1996, found that parental <br/>\ndivorce had no effect on child mortality among the Ache it did <br/>\nstrongly effect the risk of child homicide. Two, we may have evolved <br/>\nto have sex not to have children (Perusse, again, can&#39;t remember the <br/>\nyear). This doesn&#39;t seem to be supported given the variation in <br/>\nSociosexuality Index, but having just done the search on Social <br/>\nScience, I haven&#39;t really thought about it long enough.  The third <br/>\npossibility is that the association is not at all to do with father <br/>\nabsence, but do to with poverty and the foods associated with <br/>\npoverty.  There is a process called twinning in sheep.  Sheep are <br/>\nkept at 3/4 rations for some proportion of the year prior to going <br/>\ninto heat.  And then, immediately before they do go into heat, the <br/>\nranchers will up their food rations to double what they need.  <br/>\nBecause of the flush environment they produce twins instead of <br/>\nhaving singleton births.  For the poor in many industrialized <br/>\npopulations the food is high in fat and calories and may be driving <br/>\nthe age of menarche lower and lower.  Father absence is heavily <br/>\nassociated with poverty. And diet has been clearly linked with <br/>\nearlier ages at menarche.  And poverty has been clearly linked with <br/>\nobesity.  It is an on-the-fly causal path model, I haven&#39;t put a lot <br/>\nof thought into it.  <br/>\n<br/>\nThere are other models.  Hillard Kaplan has a modified the economics <br/>\nhuman capital model.  His theory is that people will invest in <br/>\nthemselves so that they may better be able to invest in their <br/>\noffspring. Within a market economy he has found that there seems to <br/>\nbe no end to the returns of investing in one&#39;s self.  That is for <br/>\nhunter-gatherer&#39;s and other subsistence level populations there is a <br/>\npoint at which investing in the skills of hunting peccararies or of <br/>\ngathering palm hearts is finite.  The skills will never get any <br/>\ngreater.  But for those within market-based economies there is no <br/>\npoint when your skills are unimprovable.  So, you choose.  You <br/>\nchoose between quality of offspring or quantity of offspring.  And <br/>\nthat would be expressed in earlier ages of first sexual experience <br/>\nand earlier ages of first reproduction.  The decision, Hilly argues, <br/>\nis based upon the individuals ability to parlay time invested in <br/>\nthemselves into true skills.  So, if you are really capable of <br/>\nlearning and have had high levels of parental investment (he is <br/>\ntalking about monetary investment, and not time) than you should <br/>\ncontinue to invest in your own &quot;growth&quot; rather than into <br/>\nreproduction.  It ends up being an evolved mechanism gone awry in <br/>\nthe current generalized environment. Unfortunately there is no data <br/>\nto back this up.  <br/>\n<br/>\n<br/>\nBasic life-history theory argues that we have finite energy to be <br/>\nsplit up in three arenas: growth, reproduction, and soma, otherwise <br/>\nknown as maintenance.  I recognize that these catagories may <br/>\noverlap, but when modeling it is easier to lay them out as <br/>\nindividual groups. The division of energy is largely genetically <br/>\nbased.  However, within any species there is always variation.  <br/>\nThere was a wonderful study of two groups of American possum who <br/>\nlive in Virginia.  One group live on an island where there are no <br/>\ncars.  The other on the mainland and they suffer huge mortality <br/>\ncosts due to cars.  The island population are less precocious.  They <br/>\ngrow more slowly, they reach reproduction later and have on average <br/>\nthree litters.  The mainland population is characterized by early <br/>\nage at first reproduction, smaller body size, larger litter size, <br/>\nand earlier age at mortality.  There is no genetic difference.  The <br/>\ntwo populations have different life-histories due to differences in <br/>\nthe risk of dying.  Those individuals on the mainland who continued <br/>\nto delay reproduction so that they could grow were more likely to be <br/>\nhit by cars before they had babies who would also be more likely to <br/>\ndelay reproduction.  So, within our species what makes for a switch <br/>\nbetween growth to reproduction?  Girls stop growing when they reach <br/>\nmenarche.  Being small often leads to smaller offspring size. As <br/>\nwell as a higher risk of death during childbirth. Smaller babies <br/>\nhave a harder time surviving to sexual maturity.  And there is a <br/>\nrecent bout of literature suggesting that smaller babies have lower <br/>\nIQs.  <br/>\n<br/>\nWhen I was decided to homeschool I did a bit of research to arm <br/>\nmyself for the debates with my family.  There is a body of research <br/>\nthat argues that preschool is better than keeping children at home.  <br/>\nIt states that children are more precocious when they are put in <br/>\npreschool.  I have concluded that precociousness is overrated.  <br/>\nPrecocious individuals are individuals for whom growth is being <br/>\nstopped so that they may reproduce before they die an early death.  <br/>\n<br/>\nAnyhow.  I&#39;m sorry if this was a bit technical.  I really enjoyed <br/>\nwriting it.  I don&#39;t get a lot of opportunity to talk about life-<br/>\nhistory theory in my day to day.<br/>\n<br/>\nSchuyler</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] &quot;socializing with non-homeschoolers&quot;","postDate":"1019572663","msgId":35720,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU2LjI2ZTA4NjFjLjI5ZjZjYmI3QGFvbC5jb20+"},"prevInTopic":35718,"nextInTopic":35728,"prevInTime":35719,"nextInTime":35721,"topicId":35675,"numMessagesInTopic":0,"msgSnippet":"In a message dated 4/23/02 5:56:15 AM, Katedavislawfirm@aol.com writes:  I m sure there","messageBody":"<div id=\"ygrps-yiv-2053744770\">In a message dated 4/23/02 5:56:15 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Katedavislawfirm@...\">Katedavislawfirm@...</a> writes:<br/>\n<br/>\n&lt;&lt; Does anyone know if there are any formal studies on this subject? &gt;&gt;<br/>\n<br/>\nI&#39;m sure there aren&#39;t.  Not about unschoolers, anyway.  And if there&#39;s one <br/>\nthat has analyzed factors in early vs. late sexual activity, I&#39;m guessing all <br/>\ntheir subjects would be schooled kids, AND that many of them would by lying.<br/>\n<br/>\nThere used to be surveys of students when I was in school, and when I was <br/>\nteaching.  I remember being evasive on the surveys, not trusting that they <br/>\nweren&#39;t going to show them to parents.  And when I was a teacher, I&#39;d hear <br/>\nthe kids later, laughing about what they had written.  Those who were <br/>\nabsolutely confident that the forms WERE anonymous and unconnected with <br/>\nparticular kids would lie to make their sex or drug use MORE (or existent <br/>\nwhere it wasn&#39;t), and it seemed, in large part, just to goof with the people <br/>\nrunning the survey.<br/>\n<br/>\nLast night I read Kate&#39;s post about it being silliness (I know, she&#39;s changed <br/>\nher mind some &lt;g&gt;) to Marty, and when I read &quot;Am I wrong?&quot;  he said &quot;Yes, she <br/>\nis!&quot;<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: &quot;socializing with non-homeschoolers&quot;","postDate":"1019572123","msgId":35718,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE2NC5jYTQ4MGMyLjI5ZjZjOTliQGFvbC5jb20+"},"prevInTopic":35707,"nextInTopic":35720,"prevInTime":35717,"nextInTime":35719,"topicId":35675,"numMessagesInTopic":0,"msgSnippet":"In a message dated 4/22/02 10:38:59 PM, dwaynf@unm.edu writes: ","messageBody":"<div id=\"ygrps-yiv-1984673359\">In a message dated 4/22/02 10:38:59 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dwaynf@...\">dwaynf@...</a> writes:<br/>\n<br/>\n&lt;&lt; I just tell I&#39;m 33 so I must know infinitely more than <br/>\n<br/>\nhis friend does, so he should trust my opinion and age doesn&#39;t <br/>\n<br/>\nmatter.  &gt;&gt;<br/>\n<br/>\nSweet answer. &lt;g&gt;<br/>\n<br/>\n&lt;&lt;Those individuals within a species who have the <br/>\n<br/>\nleast desirable environment are most likely to grow less and <br/>\n<br/>\nreproduce earlier.  If you apply that theory to homeschooling it <br/>\n<br/>\nshould predict that the homeschooled is more likely to delay sexual <br/>\n<br/>\nactivity when compared with the schooled child.  &gt;&gt;<br/>\n<br/>\nThanks for the further explanation of what I&#39;m seeing in the teen world <br/>\naround me.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":55326806,"authorName":"rumpleteasermom","from":"&quot;rumpleteasermom&quot; &lt;rumpleteasermom@...&gt;","profile":"rumpleteasermom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: &quot;socializing with non-homeschoolers&quot;","postDate":"1019567161","msgId":35707,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGFhM203cCs0ZWM4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEwMi4xNDJhMjY4Zi4yOWY2YTU2M0Bhb2wuY29tPg=="},"prevInTopic":35702,"nextInTopic":35718,"prevInTime":35706,"nextInTime":35708,"topicId":35675,"numMessagesInTopic":0,"msgSnippet":"Well, here s more on this. First back to my crusade!  We need to reclaim the whole socialization thing.  Don t let ps parents bully you on it.  We KNOW our","messageBody":"<div id=\"ygrps-yiv-1514160683\">Well, here&#39;s more on this.<br/>\n<br/>\nFirst back to my crusade!  We need to reclaim the whole socialization <br/>\nthing.  Don&#39;t let ps parents bully you on it.  We KNOW our kids are <br/>\ngetting better socialization than theirs.  We need to start being <br/>\nupfront and in their face about it as they have been with us for so <br/>\nlong.<br/>\n<br/>\nSecond, about the sexuality thing.  Rachel is 17, has been on two <br/>\ndates and is not showing any signs of wanting to go on another.  I was <br/>\nchatting with another homeschooling friend of mine about it and the <br/>\nthought came up that it is because they have their own identities.  In <br/>\nother words, because they&#39;ve been allowed to find themselves, they <br/>\naren&#39;t still searching for themselves in sex.<br/>\n<br/>\nBut, I know other homeschoolers for whom I think the whole thing is <br/>\njust like it is in school.  So just being homeschooled is no <br/>\nguarentee.  In fact I think we are back to the super-saturation thing. <br/>\n The reason I think the problem is still there for the aforementioed <br/>\ngroup is because they have been together for years and their lives <br/>\nhave included a lot of structured classes and other time consuming <br/>\nthings.  It&#39;s been kind of a school away from school thing.<br/>\n<br/>\nBridget<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In Unschooling-dotcom@y..., Katedavislawfirm@a... wrote:<br/>\n<br/>\n&gt; <br/>\n&gt; Thank you all for the responses.<br/>\n&gt; <br/>\n&gt; I now have even more, then I had before, to chew on.<br/>\n&gt; <br/>\n&gt; I hadn&#39;t even really thought about homeschooling&#39;s effect on <br/>\nsocialization in <br/>\n&gt; this positive way.  (Don&#39;t get me wrong, I believe very strongly <br/>\nthat <br/>\n&gt; homeschooling is much better for a child&#39;s socialization <br/>\nopportunities and <br/>\n&gt; development.) </span></blockquote></div>","specialLinks":[]},{"userId":97649338,"authorName":"Katedavislawfirm@aol.com","from":"Katedavislawfirm@...","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] &quot;socializing with non-homeschoolers&quot;","postDate":"1019562851","msgId":35702,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEwMi4xNDJhMjY4Zi4yOWY2YTU2M0Bhb2wuY29tPg=="},"prevInTopic":35694,"nextInTopic":35707,"prevInTime":35701,"nextInTime":35703,"topicId":35675,"numMessagesInTopic":0,"msgSnippet":"In a message dated 4/23/2002 1:28:25 AM Eastern Daylight Time, PSoroosh@aol.com writes: ","messageBody":"<div id=\"ygrps-yiv-47092276\">In a message dated 4/23/2002 1:28:25 AM Eastern Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:PSoroosh@...\">PSoroosh@...</a> writes:<br/>\n<br/>\n&lt;&lt; In a message dated 4/22/2002 7:55:02 PM Pacific Daylight Time, <br/>\n <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> writes:<br/>\n <br/>\n <br/>\n<blockquote><span title=\"ireply\">  &gt; If things continue as they are now, when they have sex it will not be <br/>\n &gt; misconduct.  It will be a conscious, planned activity.<br/>\n <br/>\n </span></blockquote> It is common for the unschooled kids to be like the ones Sandra is <br/>\n describing. I&#39;m sure many do have sex - but it is private and a conscious <br/>\n decision. It isn&#39;t just impetuous sex based on happening to be up late in a <br/>\n group with no adults around.<br/>\n <br/>\n --pamS &gt;&gt;<br/>\n<br/>\n<br/>\nThank you all for the responses.<br/>\n<br/>\nI now have even more, then I had before, to chew on.<br/>\n<br/>\nI hadn&#39;t even really thought about homeschooling&#39;s effect on socialization in <br/>\nthis positive way.  (Don&#39;t get me wrong, I believe very strongly that <br/>\nhomeschooling is much better for a child&#39;s socialization opportunities and <br/>\ndevelopment.)<br/>\n<br/>\nMostly, my objection to public school has always been based upon the <br/>\neducationally-stunting effects of public school methods.  I also do not like <br/>\nthe numerous negative social episodes that occur in public schools (in the <br/>\nbathrooms and elsewhere), but I had never really thought to link premature <br/>\nsexual experimentation to public school.<br/>\n<br/>\nI feel like an idiot saying that, as it seems so obvious now that I have <br/>\nthought about it for a little more than three minutes.<br/>\n<br/>\nDoes anyone know if there are any formal studies on this subject?<br/>\n<br/>\nKate Davis</div>","specialLinks":[]},{"userId":1798873,"authorName":"PSoroosh@aol.com","from":"PSoroosh@...","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] &quot;socializing with non-homeschoolers&quot;","postDate":"1019539645","msgId":35694,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NC5jY2I3ZWFkLjI5ZjY0YWJkQGFvbC5jb20+"},"prevInTopic":35692,"nextInTopic":35702,"prevInTime":35693,"nextInTime":35695,"topicId":35675,"numMessagesInTopic":0,"msgSnippet":"In a message dated 4/22/2002 7:55:02 PM Pacific Daylight Time, ... It is common for the unschooled kids to be like the ones Sandra is describing. I m sure many","messageBody":"<div id=\"ygrps-yiv-820652808\">In a message dated 4/22/2002 7:55:02 PM Pacific Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If things continue as they are now, when they have sex it will not be <br/>\n&gt; misconduct.  It will be a conscious, planned activity.<br/>\n<br/>\n </span></blockquote>It is common for the unschooled kids to be like the ones Sandra is <br/>\ndescribing. I&#39;m sure many do have sex - but it is private and a conscious <br/>\ndecision. It isn&#39;t just impetuous sex based on happening to be up late in a <br/>\ngroup with no adults around.<br/>\n<br/>\n--pamS<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":24983553,"authorName":"schuyler_waynforth","from":"&quot;schuyler_waynforth&quot; &lt;dwaynf@...&gt;","profile":"schuyler_waynforth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: &quot;socializing with non-homeschoolers&quot;","postDate":"1019536699","msgId":35692,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGFhMm9mcitwNHVrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE1NC5jYzZlMjU2LjI5ZjYyNjdiQGFvbC5jb20+"},"prevInTopic":35683,"nextInTopic":35694,"prevInTime":35691,"nextInTime":35693,"topicId":35675,"numMessagesInTopic":0,"msgSnippet":"... the females is greater than the average male age. It s not for lack of opportunity to get in private places. It s from a surfeit of maturity and a lack","messageBody":"<div id=\"ygrps-yiv-1708417346\">--- In Unschooling-dotcom@y..., SandraDodd@a... wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Of the +/- 10 boys and +/- seven girls in question, the ages range <br/>\n&gt;from 13 to 18, and none is yet sexually active. The average age of <br/>\n </span></blockquote>the &gt;females is greater than the average male age. It&#39;s not for lack <br/>\nof &gt;opportunity to get in private places. It&#39;s from a surfeit of <br/>\nmaturity &gt;and a lack of desperation for affection, desperation for <br/>\nlove, or the &gt;strong desire to be grown fast and leave home. All of <br/>\nthem are still &gt;living at home, too. <br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;One of the very-schooled girls the boys here know has been <br/>\n </span></blockquote>discussed &gt;among them and from me and another parent. Her dad is <br/>\nmean to her &gt;(alternately ignoring and blaming), and she&#39;s expected <br/>\nto take care of &gt;her two younger brothers who are about 6 and 8 ALL <br/>\nthe time. She is &gt;pretty anxious to get the hell out of there, and <br/>\nshe tends to &quot;want a &gt;boyfriend,&quot; and to offer herself to an extent <br/>\nthe boys were REALLY &gt;uncomfortable with. They&#39;ve stopped hanging <br/>\nout with her at all. The &gt;first boy who will get her pregnant will <br/>\nbe her hero, because her dad &gt;will throw her out. She seems to be <br/>\nnot thinking much past that.<br/>\n---------------------------<br/>\n<br/>\nWithin life-history theory there is a basic trade-off between growth <br/>\nand reproduction.  Those individuals within a species who have the <br/>\nleast desirable environment are most likely to grow less and <br/>\nreproduce earlier.  If you apply that theory to homeschooling it <br/>\nshould predict that the homeschooled is more likely to delay sexual <br/>\nactivity when compared with the schooled child.  <br/>\n<br/>\nSo, homeschooled teenagers should be much safer than non-<br/>\nhomeschooled teenagers when it comes to sexual precociousness.<br/>\n<br/>\nSchuyler.<br/>\n<br/>\nP.S. I hate when my son (5 yrs old) plays with one of his schooled <br/>\nfriends.  He comes back completely wrapped up in the hierarchy of <br/>\nage.  Sigh  I just tell I&#39;m 33 so I must know infinitely more than <br/>\nhis friend does, so he should trust my opinion and age doesn&#39;t <br/>\nmatter.  Fortunately he hasn&#39;t sussed out that paradox, yet.  He <br/>\ndoesn&#39;t listen to me, anyhow.  He just laughs.</div>","specialLinks":[]},{"userId":2294225,"authorName":"freeform@juno.com","from":"freeform@...","profile":"freeform_ca","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] &quot;socializing with non-homeschoolers&quot;","postDate":"1019530988","msgId":35683,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIwNDIyLjIwMDMwOS4tMjA0MTkxLjIuZnJlZWZvcm1AanVuby5jb20+"},"prevInTopic":35679,"nextInTopic":35692,"prevInTime":35682,"nextInTime":35684,"topicId":35675,"numMessagesInTopic":0,"msgSnippet":"... non-homeshooled ... Yes. At least based on my experience. The unschooled teens I know don t do a lot of rationalizing and being really clever . They re","messageBody":"<div id=\"ygrps-yiv-826101176\">On Mon, 22 Apr 2002 22:38:16 EDT <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Katedavislawfirm@...\">Katedavislawfirm@...</a> writes:<br/>\n<blockquote><span title=\"ireply\"> &gt; Personally, I think the silliness is not in not trusting the <br/>\n </span></blockquote>non-homeshooled <br/>\n<blockquote><span title=\"ireply\"> &gt; children; I think the silliness is in trusting homeschooled children <br/>\n&gt; of  &quot;opposite&quot; genders to be &quot;non-sexual.&quot;  <br/>\n&gt; <br/>\n&gt; If they&#39;re &quot;really clever,&quot; they will be able to rationalize sexual <br/>\n&gt; &quot;mis&quot;conduct as just another part of &quot;unschooling.&quot;<br/>\n&gt; <br/>\n&gt; Am I wrong?<br/>\n<br/>\n </span></blockquote>Yes. At least based on my experience. <br/>\n<br/>\nThe unschooled teens I know don&#39;t do a lot of rationalizing and being<br/>\n&quot;really clever&quot;. They&#39;re pretty up front about things. They talk through<br/>\nissues a lot. They also stay up late and sleep in late and most of the<br/>\nones at our last big party didn&#39;t know how to do dishes without a<br/>\ndishwasher, or so they said ;-) We cheerfully enlightened them...<br/>\n<br/>\nI don&#39;t think it&#39;s that they&#39;re &quot;non-sexual&quot;; it&#39;s more that they&#39;ve<br/>\nalways recognized that these sorts of parties are not the appropriate<br/>\nplaces to be sexual. At the last party here, there were 13 or 14 of them<br/>\nand they had the whole guest house to themselves - I don&#39;t think any of<br/>\nthe adults were in there more than once the whole week. Cacie was,<br/>\nthough, and I just asked and she said there wasn&#39;t anything like that,<br/>\n&quot;Just the regular people piles and sitting in laps and stuff&quot;. <br/>\n<br/>\nUnschooling is all about trust...<br/>\n<br/>\nDar</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] &quot;socializing with non-homeschoolers&quot;","postDate":"1019530363","msgId":35679,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NC5jYzZlMjU2LjI5ZjYyNjdiQGFvbC5jb20+"},"prevInTopic":35676,"nextInTopic":35683,"prevInTime":35678,"nextInTime":35680,"topicId":35675,"numMessagesInTopic":0,"msgSnippet":"In a message dated 4/22/02 8:41:30 PM, Katedavislawfirm@aol.com writes: ","messageBody":"<div id=\"ygrps-yiv-63881642\">In a message dated 4/22/02 8:41:30 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Katedavislawfirm@...\">Katedavislawfirm@...</a> writes:<br/>\n<br/>\n&lt;&lt; <br/>\nPersonally, I think the silliness is not in not trusting the non-homeshooled <br/>\nchildren; I think the silliness is in trusting homeschooled children of <br/>\n&quot;opposite&quot; genders to be &quot;non-sexual.&quot;   &gt;&gt;<br/>\n<br/>\nIt might seem silly if the kids weren&#39;t often at my house, if I hadn&#39;t known <br/>\nhalf of them since they were born (my sister&#39;s 17 year old, both of Carol <br/>\nRice&#39;s kids), if the boys didn&#39;t confide in me, and if they hadn&#39;t camped <br/>\ntogether half a dozen times before already, with adults around too, but not <br/>\nmaking them go to sleep at a certain time, if I didn&#39;t know that they <br/>\ntravelled in little groups and didn&#39;t pair up, and if they didn&#39;t spend a lot <br/>\nof time sleeping overnight at my house.<br/>\n<br/>\nSo it&#39;s not &quot;silliness.&quot;  It&#39;s direct knowledge and confidence.<br/>\n<br/>\nTomorrow night four are coming from Espanola to go to a concert and stay <br/>\novernight here.  Some of the locals will probably spend the night here to get <br/>\nto visit them, because they all know each other.  <br/>\n<br/>\nI won&#39;t tell them where to sleep, and we won&#39;t separate boys from girls, but <br/>\nthere won&#39;t be any sexual activity.<br/>\n<br/>\n&lt;&lt;If they&#39;re &quot;really clever,&quot; they will be able to rationalize sexual <br/>\n&quot;mis&quot;conduct as just another part of &quot;unschooling.&quot;<br/>\n<br/>\n&lt;&lt;Am I wrong?&gt;&gt;<br/>\n<br/>\nFor now, yes.<br/>\nIf things continue as they are now, when they have sex it will not be <br/>\nmisconduct.  It will be a conscious, planned activity.<br/>\n<br/>\nOf the +/- 10 boys and +/- seven girls in question, the ages range from 13 to <br/>\n18, and none is yet sexually active.  The average age of the females is <br/>\ngreater than the average male age.  It&#39;s not for lack of opportunity to get <br/>\nin private places.  It&#39;s from a surfeit of maturity and a lack of desperation <br/>\nfor affection, desperation for love, or the strong desire to be grown fast <br/>\nand leave home.  All of them are still living at home, too.  <br/>\n<br/>\nOne of the very-schooled girls the boys here know has been discussed among <br/>\nthem and from me and another parent.  Her dad is mean to her (alternately <br/>\nignoring and blaming), and she&#39;s expected to take care of her two younger <br/>\nbrothers who are about 6 and 8 ALL the time.  She is pretty anxious to get <br/>\nthe hell out of there, and she tends to &quot;want a boyfriend,&quot; and to offer <br/>\nherself to an extent the boys were REALLY uncomfortable with.  They&#39;ve <br/>\nstopped hanging out with her at all.  The first boy who will get her pregnant <br/>\nwill be her hero, because her dad will throw her out. She seems to be not <br/>\nthinking much past that.<br/>\n<br/>\nSchooled kids sometimes have cliques and groups to report to on Monday about <br/>\nhow dates went.  What--no dates!?  There is pressure to keep up there, <br/>\nsometimes.  There was when I was in school and I know it still exists.<br/>\n<br/>\nThe homeschoolers we know aren&#39;t dating at all.  They go to movies in groups, <br/>\nand they do things in pairs, but they&#39;re not &quot;couples.&quot;<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":97649338,"authorName":"Katedavislawfirm@aol.com","from":"Katedavislawfirm@...","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] &quot;socializing with non-homeschoolers&quot;","postDate":"1019529496","msgId":35676,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdmLjI0ZjE2MGJhLjI5ZjYyMzE4QGFvbC5jb20+"},"prevInTopic":35675,"nextInTopic":35679,"prevInTime":35675,"nextInTime":35677,"topicId":35675,"numMessagesInTopic":0,"msgSnippet":"In a message dated 4/22/2002 10:28:46 PM Eastern Daylight Time, ... Personally, I think the silliness is not in not trusting the non-homeshooled children; I","messageBody":"<div id=\"ygrps-yiv-1228074432\">In a message dated 4/22/2002 10:28:46 PM Eastern Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &lt;&lt; <br/>\n&gt; At a recent hs support group meeting, the topic was &quot;socializing w/ <br/>\n&gt; non-homeschoolers&quot;.  &gt;&gt;<br/>\n&gt; <br/>\n&gt; I meant to comment on this, too:<br/>\n&gt; <br/>\n&gt; Just a little bit ago, we were talking about camping arrangements for Grand <br/>\n&gt; <br/>\n&gt; Outlandish, a big SCA event here Memorial Day weekend.  I suggested I&#39;d <br/>\n&gt; just <br/>\n&gt; as well have a small camp this year, just family (instead of the 25-person <br/>\n&gt; extravaganzas we&#39;ve had the past few years).  It was pointed out to me that <br/>\n&gt; <br/>\n&gt; we would have &quot;the teens&quot; anyway.  That means the crowd that&#39;s usually at <br/>\n&gt; our <br/>\n&gt; house (all but one homeschooled), and the unschoolers who are friends with <br/>\n&gt; my <br/>\n&gt; niece in another town.<br/>\n&gt; <br/>\n&gt; Someone said that another family (the mom I&#39;ve known for 23 years; the <br/>\n&gt; oldest <br/>\n&gt; kid is 15 or so) wanted to camp near us because they were going to have <br/>\n&gt; some <br/>\n&gt; visiting teenaged girls.<br/>\n&gt; <br/>\n&gt; I kind of froze inside and said, &quot;But they&#39;re schooled kids, and it will be <br/>\n&gt; <br/>\n&gt; different.&quot;<br/>\n&gt; <br/>\n&gt; Creepy feeling, having boys after all my years of being a girlchild and <br/>\n&gt; teenaged girl in a family of all girls!<br/>\n&gt; <br/>\n&gt; I realize that while I trust eight to ten homeschooled kids to be <br/>\n&gt; responsible <br/>\n&gt; and non-sexual and careful and to eventually go to bed in their own beds, I <br/>\n&gt; <br/>\n&gt; do NOT trust the addition of several school kids (of any gender, really).   <br/>\n&gt; <br/>\n&gt; It will just change the balance.   <br/>\n&gt; <br/>\n&gt; I&#39;m trying to tell myself it&#39;s silly, but something nags at me. <br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Personally, I think the silliness is not in not trusting the non-homeshooled <br/>\nchildren; I think the silliness is in trusting homeschooled children of <br/>\n&quot;opposite&quot; genders to be &quot;non-sexual.&quot;  <br/>\n<br/>\nIf they&#39;re &quot;really clever,&quot; they will be able to rationalize sexual <br/>\n&quot;mis&quot;conduct as just another part of &quot;unschooling.&quot;<br/>\n<br/>\nAm I wrong?<br/>\n<br/>\nKate Davis<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"&quot;socializing with non-homeschoolers&quot;","postDate":"1019528775","msgId":35675,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEwMy4xNDI4YmE1MC4yOWY2MjA0N0Bhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":35676,"prevInTime":35674,"nextInTime":35676,"topicId":35675,"numMessagesInTopic":0,"msgSnippet":"In a message dated 4/22/02 4:08:12 PM, jsjulian@earthlink.net writes: ","messageBody":"<div id=\"ygrps-yiv-551722313\">In a message dated 4/22/02 4:08:12 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jsjulian@...\">jsjulian@...</a> writes:<br/>\n<br/>\n&lt;&lt; <br/>\nAt a recent hs support group meeting, the topic was &quot;socializing w/ <br/>\nnon-homeschoolers&quot;.  &gt;&gt;<br/>\n<br/>\nI meant to comment on this, too:<br/>\n<br/>\nJust a little bit ago, we were talking about camping arrangements for Grand <br/>\nOutlandish, a big SCA event here Memorial Day weekend.  I suggested I&#39;d just <br/>\nas well have a small camp this year, just family (instead of the 25-person <br/>\nextravaganzas we&#39;ve had the past few years).  It was pointed out to me that <br/>\nwe would have &quot;the teens&quot; anyway.  That means the crowd that&#39;s usually at our <br/>\nhouse (all but one homeschooled), and the unschoolers who are friends with my <br/>\nniece in another town.<br/>\n<br/>\nSomeone said that another family (the mom I&#39;ve known for 23 years; the oldest <br/>\nkid is 15 or so) wanted to camp near us because they were going to have some <br/>\nvisiting teenaged girls.<br/>\n<br/>\nI kind of froze inside and said, &quot;But they&#39;re schooled kids, and it will be <br/>\ndifferent.&quot;<br/>\n<br/>\nCreepy feeling, having boys after all my years of being a girlchild and <br/>\nteenaged girl in a family of all girls!<br/>\n<br/>\nI realize that while I trust eight to ten homeschooled kids to be responsible <br/>\nand non-sexual and careful and to eventually go to bed in their own beds, I <br/>\ndo NOT trust the addition of several school kids (of any gender, really).   <br/>\nIt will just change the balance.   <br/>\n<br/>\nI&#39;m trying to tell myself it&#39;s silly, but something nags at me. <br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":35596,"nextTopicId":35677}}