{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1294635,"authorName":"HEM-Online-Newsletter  by way of Home Ed","from":"HEM-Online-Newsletter &lt;HEM-Editor@...&gt; (by way of Home Education Magazine)","profile":"hemhelen","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"HEM&#39;s Online News -  December 2002","postDate":"1039235989","msgId":50974,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PHAwNTAwMTkyM2JhMTcyYzBlZWI4ZUBbMjA4LjI2LjIzNS4xNDNdPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":50973,"nextInTime":50975,"topicId":50974,"numMessagesInTopic":0,"msgSnippet":"^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^ HOME EDUCATION MAGAZINE S ONLINE NEWS December 2002 ^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^ Welcome to HEM S ONLINE NEWS! For","messageBody":"<div id=\"ygrps-yiv-1653355967\">^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^<br/>\n<br/>\nHOME EDUCATION MAGAZINE&#39;S ONLINE NEWS<br/>\nDecember 2002<br/>\n<br/>\n^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^<br/>\n<br/>\nWelcome to HEM&#39;S ONLINE NEWS! For more information on Home Education <br/>\nMagazine, see the end of this newsletter or visit our web site at <br/>\nhttp://home-ed-magazine.com. Send your comments and questions to <br/>\neditor Carol Narigon at HEM-Newsletter@....<br/>\n<br/>\nIn the December issue:<br/>\n<br/>\n~ Decisions, Decisions ~<br/>\n~ California Homeschoolers ~<br/>\n~ Questions and Answers ~<br/>\n~ unschooling.com ~<br/>\n~ Free Audio Books Online ~<br/>\n~ Current Issue ~<br/>\n~ Looking for a Scholarship? ~<br/>\n~ The Happy Child  ~<br/>\n~ Get Your News Here!~<br/>\n~ Balloons! ~<br/>\n~ The Final Word ~<br/>\n<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nWhat keeps you going isn&#39;t some fine destination but just the road <br/>\nyou&#39;re on and the fact that you know how to drive. ~~ Barbara <br/>\nKingsolver<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nDECISIONS, DECISIONS<br/>\nhttp://home-ed-magazine.com/HEM/196.html<br/>\n<br/>\nI have been musing. My grandmother was born in 1897 and was 101 when <br/>\nshe died. She was born in the Ukraine and came to the US when she was <br/>\n14. Who would have, could have, imagined the changes in her lifetime? <br/>\nIn our lifetimes?<br/>\n<br/>\nI can only imagine what she would have said had she been told about <br/>\nbeing prepared for her future. For my grandmother: a new country, a <br/>\nnew language, a new culture, electricity, cars, telephones, man on <br/>\nthe moon, computers, Mars exploration--the list is endless.<br/>\n<br/>\nFor us, the list continues to grow. Who knows what the future will be <br/>\nfor our children?<br/>\n<br/>\nIt seems to me that when we are asked about preparing our kids for <br/>\ntheir futures, we and they truly can only be prepared to be active <br/>\nparticipants in the present--and if we know how to find out what we <br/>\nneed to know, we&#39;ll do just fine. We don&#39;t need to know all the <br/>\nanswers; we need to be able to ask the questions and to try to find <br/>\nout what we need to know.<br/>\n<br/>\nThe 21st century certainly doesn&#39;t need standardized thinkers.<br/>\n<br/>\nJust some thoughts<br/>\nDebra Bures, buresfam@...<br/>\n<br/>\nWho can imagine the future our children will face? Beyond the <br/>\nunfathomable changes in society, technology, medicine, and other <br/>\nvariables, what personal changes will affect their decisions, shape <br/>\ntheir lives? How can we best help them prepare for whatever curve <br/>\nballs life might decide to pitch their way?<br/>\n<br/>\nI&#39;ve always thought one of the most valuable and underrated aspects <br/>\nof homeschooling was the opportunity to makes one&#39;s own choices and <br/>\ndecisions, to step away from the mainstream herd-like group-think. <br/>\nAnd yet this singular advantage is in grave danger of disappearing as <br/>\nmore and more parents seek not something different from schools and <br/>\nschooling, but simply to teach school in a different location.<br/>\n<br/>\nThe message of homeschooling being advanced by many businesses (&quot;Our <br/>\ncurriculum guarantees success!&quot;), and organizations (&quot;Homeschoolers <br/>\ntest above average!&quot;) does nothing to dispel the notion of <br/>\nhomeschooling as merely school in the home. Combined with the scare <br/>\ntactics of an educational bureaucracy struggling to justify its <br/>\nexistence (&quot;If you can read this, thank a teacher!&quot;) and the <br/>\nceaseless drumbeating of a man who wants to be known as &quot;the <br/>\nEducation President&quot; (&quot;No Child Left Behind&quot;), there&#39;s little room <br/>\nfor parents to consider any decision that leads away from traditional <br/>\nmodels of education. Parents who were trained as children to use the <br/>\nschoolish model find reassurance in using the schoolish model with <br/>\ntheir own children, especially when the experts, professionals, and <br/>\neven some homeschooling recruiters tell them that&#39;s what works best. <br/>\nBut is it?<br/>\n~~ managing editor and co-publisher Helen Hegener in the Publisher&#39;s <br/>\nNote in the current issue of Home Education Magazine ~~<br/>\n<br/>\nYou can read the rest of this editorial, as well as a couple of <br/>\narticles and columns from the current HEM at the address above, but <br/>\nyou&#39;ll have to get the magazine--the one you hold in your hands--to <br/>\nread them all! See special subscription information in this <br/>\nnewsletter, or visit your local bookseller to get your copy today.<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nCALIFORNIA HOMESCHOOLERS<br/>\n<br/>\nCalifornia has no homeschooling law, but that could change. Public <br/>\nofficials who believe homeschooling should be defined and regulated <br/>\nhave become more outspoken in suggesting that we need a new law. <br/>\nCindy Cotter runs a discussion group devoted to considering the laws <br/>\nand legal issues that affect California homeschoolers. Is a new law <br/>\nimminent? Should we fight it or try to steer it?  What might a new <br/>\nlaw look like?  What can we live with? What do laws look like in <br/>\nother states? What would be the effect of a new law on our <br/>\nhomeschooling practices? Would a new law affect private ISP&#39;s? Who <br/>\nare our allies, who are our foes? What strategies would help as we <br/>\noppose or amend a bill? If you&#39;d like to join the discussion, you can <br/>\nfind the group at the following website: <br/>\nhttp://groups.yahoo.com/group/CA-HS-Law .<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nQUESTIONS AND ANSWERS<br/>\n<br/>\n&quot;My husband and I have made the decision to homeschool our two <br/>\nchildren. Our daughter is two and our little boy just 3 months old. <br/>\nSo what&#39;s my homeschooling problem this early in the game? All of my <br/>\nfriends with two-year-olds are enrolling them in preschool programs. <br/>\nSince I&#39;m going to homeschool, I really would prefer to teach our <br/>\nlittle girl her colors, numbers, alphabet at home. We belong to a <br/>\nplaygroup where she is learning to share and play with others. But am <br/>\nI missing something by denying her an official &quot;preschool <br/>\nexperience?&quot; ~ Jean Hershner ~<br/>\n<br/>\n&quot;What is different about parents who homeschool? Given all our <br/>\ncultural conditioning, that of our parents, and the school structure, <br/>\nwhat are the reasons that make some of us jump ship even at great <br/>\nsacrifice sometimes?&quot; ~ Jean Reed, author of The Home School Source <br/>\nBook ~<br/>\n<br/>\nTo answer a question, or propose your own question, please write to <br/>\nLaura Weldon via ReaderResponse@... or Questions & <br/>\nAnswers, c/o Home Education Magazine, PO Box 1083, Tonasket, WA <br/>\n98855. Your responses must meet our deadline of the 1st of next <br/>\nmonth. Please recognize that your submission may be edited for length <br/>\nor clarity. Indicate how you prefer your question or answer signed.<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nUNSCHOOLING.COM<br/>\nhttp://www.unschooling.com<br/>\n<br/>\nI eased into unschooling. Kirby didn&#39;t go to kindergarten. I <br/>\nregistered to homeschool, figuring if he did well I had the option to <br/>\nput him in first grade the next year. If he didn&#39;t do well, he could <br/>\ngo to kindergarten the year after, or we could keep homeschooling. I <br/>\nknew four homeschooling families from the babysitting co-op I was in. <br/>\nMost of the other moms were La Leche League Leaders. I wasn&#39;t a <br/>\nleader, but that was my &quot;gang of moms.&quot;<br/>\n<br/>\nTwo of the families were structured homeschoolers who (not <br/>\ncoincidentally, I think) hit their kids, shamed them, and weren&#39;t too <br/>\nclose and intimate with their kids intellectually. They had been <br/>\ngentle with the infants, and nursed on demand, but it didn&#39;t <br/>\ntranslate to the way they treated eight- and ten-year-olds.<br/>\n<br/>\nTwo families were unschooling. One family went from three to four <br/>\nchildren during that time (I still know them, and two of those <br/>\nnow-teens were over here last night). The other family went from four <br/>\nto five children in those babysitting co-op years, and they&#39;re up to <br/>\nnine and are probably not actively involved in homeschooling. Her <br/>\nhusband is a minister and some of the kids are going to a small <br/>\nschool the church runs.<br/>\n<br/>\nSurrounded by good and bad examples, and having seen how Kirby was in <br/>\ntwo classes he took (dance and art), I thought he and school would <br/>\nnot yet be a match. Within a month I was hooked and that was that for <br/>\nKirby, but I thought Marty was so much different from Kirby he might <br/>\nwant to go to school. He didn&#39;t.<br/>\n<br/>\nAnd then I thought maybe Holly would want to go to school just to be <br/>\naway from the boys, and independent.  She didn&#39;t. But yet she does, <br/>\nin a way. She likes to take classes and get herself into structured <br/>\nsituations. I support her but I don&#39;t play enforcer for her.<br/>\n<br/>\nSo, none of them has ever been to school. Marty hasn&#39;t even visited. <br/>\nHolly has visited three occasions (four if you count going to college <br/>\nclasses one day with a friend, from which the then-seven-year-old <br/>\nHolly learned about and later discussed &quot;inertia&quot;). Kirby has been to <br/>\na couple of school assembly functions, but not to a classroom.<br/>\n<br/>\n  Kirby was big into pointing at letters and naming them even before <br/>\nhe could tell someone how old he was. It didn&#39;t lead to early <br/>\nreading. He read when he was eight, fluently at ten, I guess.  Marty <br/>\nread at nine, fluently at ten or eleven.<br/>\n<br/>\nHolly wasn&#39;t reading at ten. She wasn&#39;t happy about it, either. She <br/>\nis at the point now where she is reading words without meaning to. <br/>\nFor fun she tries to walk around the house without recognizing any <br/>\nwords. At eleven, she&#39;s still not reading chapter books. But if you <br/>\nmet her and talked to her you wouldn&#39;t think for a second, &quot;I bet <br/>\nthis kid doesn&#39;t even read,&quot; because there&#39;s not much she can&#39;t talk <br/>\nabout, and if she knows nothing about it but it sounds interesting, <br/>\nshe&#39;ll ask intelligent questions.<br/>\n<br/>\nI like the amazement that it works. I still have it too, when one of <br/>\nmy kids says or does something that is news to me, and I wonder where <br/>\nthey got it. ~~ Sandra Dodd, unschooling.com message board ~~<br/>\n<br/>\nUnschooling.com offers a free monthly newsletter, message boards, an <br/>\nemail list and more just for unschoolers. To subscribe to the email <br/>\nlist send a blank email to:<br/>\nUnschooling-dotcom-subscribe@yahoogroups.com<br/>\nOr visit the email list website at: <br/>\nhttp://groups.yahoo.com/group/Unschooling-dotcom .<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nFREE AUDIO BOOKS ONLINE<br/>\n<br/>\nMy kids and I have spent many happy hours listening to audio books on <br/>\ntape and CD in the van. A trip to Grandma&#39;s house isn&#39;t complete <br/>\nwithout at least a couple of stories to listen to. We usually check <br/>\nthem out at the library, but now you can download them off the <br/>\nInternet and burn your own CDs or listen right on your computer. Most <br/>\nof the books at the following sites are in the public domain, so they <br/>\naren&#39;t the latest best sellers, but many have been around a while <br/>\nbecause they&#39;re a good read.<br/>\n<br/>\nOne site I really like is Free Audiobooks <br/>\n(http://www.audiobooksforfree.com). They have a wide selection of <br/>\nbooks from various genres, including classics, westerns, crime, <br/>\nscience fiction and more. Other sites to try are Alex Catalog of <br/>\nElectronic Texts (http://www.infomotions.com/alex) , the Electric <br/>\nBook Company (http://www.elecbook.com) , and Planet PDF <br/>\n(http://www.planetpdf.com/mainpage.asp?webpageid=2330).<br/>\n<br/>\n  &lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nHEM&#39;S CURRENT ISSUE<br/>\n<br/>\nIn the November/December issue of Home Education Magazine, you&#39;ll <br/>\nenjoy articles on how to run a self-directed conference, how one <br/>\nfamily dealt with a debilitating illness, homeschooling a special <br/>\nneeds child, placemat learning and more. Columns include: Linda <br/>\nDobson finds the gift of flow; Laura Weldon addresses record keeping; <br/>\nAnn Zeise shops online; and Elizabeth McCullough reviews 2 new <br/>\nhomeschool handbooks. Other columnists include Larry and Susan <br/>\nKaseman, Sandra Dodd, Becky Rupp, David Albert and Carol Narigon. HEM <br/>\nalso offers a popular essay by publisher Helen Hegener, classified <br/>\nads, letters and discussion, pen pals and networking, and more.<br/>\n<br/>\nSubscriptions to Home Education Magazine are regularly $32.00 for one <br/>\nyear/6 issues; single issue $6.50. To subscribe, visit our website at <br/>\nhttp://home-ed-magazine.com or send a check to Home Education <br/>\nMagazine, PO Box 1083, Tonasket WA 98855; for orders: toll-free <br/>\n1-800-236-3278; email orders@.... MC/Visa accepted.<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nLOOKING FOR A SCHOLARSHIP?<br/>\nhttp://www.fastweb.com<br/>\n<br/>\nFastWeb is a free scholarship search service that helps students <br/>\nchoose a college, pay for college and/or find jobs during and after <br/>\ncollege. Matches are made from a database of more than 800,000 <br/>\nscholarships totaling over $1 billion in possible scholarships. Also <br/>\na placement service, by using the student&#39;s profile FastWeb can match <br/>\nstudents with a 2- or 4-year college, and you can even sign up to be <br/>\nrecruited by that college. You do have to create a profile that <br/>\nincludes your email address so you can be contacted about the results <br/>\nof your search. As always, read the privacy statement carefully; <br/>\nhowever, I didn&#39;t find anything insidious in it.<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nTHE HAPPY CHILD<br/>\n<br/>\nOn a practical level, is a person who is taught not to think, but to <br/>\njam information in and push information out, valued in our <br/>\ncontemporary society? The children we are teaching today will be in <br/>\ntheir adulthood in a decade or two. In that world, the world of <br/>\ntwenty years from now, will a child who has been filled with <br/>\ninformationnot even contemporary information, but information from a <br/>\ndecade or two agobe skilled, functional, prized? Will a child who <br/>\nhas learned to hold and regurgitate information be esteemed? It is <br/>\nobvious that the computers will be doing it better, that the <br/>\ncomputers are already pushing information in and out better than most <br/>\nof us. It is not information that will be useful, but the ability to <br/>\nunderstand how to utilize it.<br/>\n<br/>\nLooking down the road to our children&#39;s future, what will be far more <br/>\nimportant than yesterday&#39;s factoids is the relationship our children <br/>\nwill have to the then-existing systems of information. A child who is <br/>\ngiven the chance to explore and investigate the sources of <br/>\ninformation, the meaning of information, the utility of information, <br/>\nand the skills of manipulating and crafting information will be able <br/>\nto move fluidly in this future.<br/>\n<br/>\nThe Happy Child: Changing the Heart of Education is not a <br/>\nhomeschooling book. Author Steven Harrison is more concerned with <br/>\nsaving all children (and adults) from lives of dead, worthless <br/>\n&quot;education.&quot;  He believes a child who learns in a holistic democratic <br/>\nenvironment will be self-motivated to learn and develop his own <br/>\npersonal potential. He adequately lists the problems with modern <br/>\nschooling and submits his own utopian model of how learning should <br/>\nlook in a modern learning environment.<br/>\n<br/>\nI like this book. I marked several pages to return to and mull over. <br/>\nHarrison&#39;s model is radically different from our modern-day lives in <br/>\ngeneral, but much of what he says will ring true for individual <br/>\nhomeschooling families. I hope he writes another book where he can <br/>\nspend more time on the solutions now that he has defined the problems <br/>\nwith our modern educational model so well. The Happy Child is <br/>\navailable from your local bookstore or online book dealer.<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nGET YOUR NEWS HERE!<br/>\nhttp://www.cosmictribune.org<br/>\n<br/>\nIf you&#39;re a news and information junkie, Cosmic Tribune is the site <br/>\nfor you. You&#39;ll find the latest news from the US and around the <br/>\nworld, as well as 99 columnists offering their opinions for your <br/>\nentertainment, cartoons, links to newspapers, magazines, the wires, <br/>\ncampus and military publications, government sites, references, a <br/>\nsearch engine and more. You can read the Des Moines Register in the <br/>\nmorning and move on to the Santiago Times after lunch. It sounds like <br/>\na lot and it is, but the site is well-organized and the lists are <br/>\nclean and color-coded.<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nBALLOONS!<br/>\nhttp://www.mbd2.com/index_ie.html<br/>\n<br/>\nThis site is just for fun. You&#39;ll be the hit of the next birthday <br/>\nparty when you learn how to make some of these fabulous balloon <br/>\ncreations. Some of his creations are expert-level complex, but you <br/>\ncan start with the easy ones like mice, dogs and airplanes and work <br/>\nyour way up to the more difficult ones. Balloon-dude Dale also offers <br/>\na bunch of ideas in the balloon gallery and a store in case you can&#39;t <br/>\nbuy balloon supplies near you. Have fun!<br/>\n<br/>\n^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^<br/>\n<br/>\nHEM ONLINE NEWS UNCLASSIFIED ADVERTISING<br/>\n<br/>\nFor information on purchasing unclassified advertising space in this <br/>\nnewsletter, please contact the editor at <br/>\nHEM-Newsletter@....<br/>\n<br/>\n________<br/>\n<br/>\nUSBORNE<br/>\nUsborneAmerica.com<br/>\n<br/>\nKid Kits are prepackaged books and items for immediate use -- great <br/>\nholiday gifts!  Shop online and receive FREE books at: <br/>\nhttp://www.UsborneAmerica.com . For personal shopping services, <br/>\ne-shows or e-book fairs, email sharonve@... or call 888-474-8499 <br/>\ntoll free. Sharon Vander Ende, Independent Supervisor, Usborne America<br/>\n________<br/>\n<br/>\nGNARLY MATH<br/>\ngnarlymath.com<br/>\n<br/>\nHAVE A HILARIOUS MATH CHRISTMAS. Join subscribers from around the <br/>\nworld who read our FREE math newsletter, the Gnarly Gnews. This <br/>\nmonth&#39;s issue features a space alien who teaches trig. You can enjoy <br/>\nthe first eighteen issues of the Gnews on a floppy disk for only <br/>\n$4.95. Or show your kids how easy and fun math can be while <br/>\nrefreshing your own math with our moneyback-guaranteed CD-ROM Solid <br/>\nGold Gnarly Math. Subscription blanks and order forms are at <br/>\nhttp://www.gnarlymath.com.<br/>\n_________<br/>\n<br/>\nTHE RESOURCEFUL HOMESCHOOLER<br/>\nresourcefulhomeschooler.com<br/>\n<br/>\nAttention unschoolers and eclectic homeschoolers! Looking for <br/>\nsomething to do? The Resourceful Homeschooler carries great books, <br/>\nscience materials and kits, learning games, and the most interesting <br/>\nsoftware. AND here is your opportunity to clear some shelf space! <br/>\nList or consign your surplus or used homeschooling materials. Store <br/>\ncredit available for consignments. Visit <br/>\nhttp://www.resourcefulhomeschooler.com. Materials to involve, inspire <br/>\nand support independent learners of all ages!<br/>\n_________<br/>\n<br/>\nTEACH YOUR CHILD TO READ!  TRY ONLINE LESSONS NOW FOR FREE!<br/>\nHeadsprout.com<br/>\n<br/>\nHeadsprout Reading is the fun, Internet-delivered beginning reading <br/>\nprogram that will give your child a real advantage by systematically <br/>\nteaching essential skills and strategies ensuring reading success and <br/>\nconfidence. Outstanding fast results!  After just five 20-minute <br/>\nanimated, interactive episodes, children read their first Headsprout <br/>\nbook. Act quickly! For a limited time you can try out Headsprout <br/>\nReading FOR FREE!<br/>\nhttp://www.headsprout.com Please enter the promotional code: HENQ12<br/>\n_________<br/>\n<br/>\n<br/>\nTHE GREAT WORD RACE<br/>\nTheGreatWordRace.com<br/>\n<br/>\nWhen was the last time your children enjoyed playing a game, and you <br/>\nwere happy they were playing it too?  This season, play the colorful <br/>\nboard game &#39;The Great Word Race&#39; where players of all ages will have <br/>\nfun for hours challenging their spelling skills.  Special playing <br/>\ncards work with word blends, prefixes and suffixes to try to help you <br/>\nbuild words.  Visit our website for game and purchasing information. <br/>\nHoliday gift wrapping is available. http://www.TheGreatWordRace.com<br/>\n_________<br/>\n<br/>\n<br/>\nHomeSchool FreeStuff<br/>\nHomeschoolFREEStuff.com<br/>\n<br/>\nHomeschool Curriculum-Fair In-A-Box!<br/>\nWhy go to the fair, when the fair can come to you? If you already use <br/>\na curriculum, you can find great ways to supplement your curriculum. <br/>\nIf you haven&#39;t selected a curriculum, this is the best way to find <br/>\nout! Now you can find out which curriculum is best for your child! <br/>\nhttps://www.3moms.com/html/SECURE_curriculum_sampler_kit.asp?adid=162<br/>\n<br/>\n^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^<br/>\n<br/>\nFINAL WORD<br/>\n<br/>\nFor December 31, 2002:<br/>\nhttp://www1.jawink.ne.jp/koji-y/java/jhanabi2e_b.htm<br/>\n<br/>\n^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^<br/>\n<br/>\nThanks for reading HEM&#39;s Online News! Pass it on to your friends! To <br/>\nsubscribe, visit our web site at <br/>\nhttp://www.home-ed-magazine.com/wlcm_hemnewsltr.html or send an email <br/>\nto majordomo@... with the words subscribe <br/>\nhem-online-newsletter followed by your name@your address.com in the <br/>\nbody of the email. (e.g. subscribe hem-online-newsletter <br/>\nyouremailaddress). To unsubscribe, send an email to <br/>\nmajordomo@... with the words unsubscribe <br/>\nhem-online-newsletter followed by your name@your address.com in the <br/>\nbody of the email. (e.g. unsubscribe hem-online-newsletter <br/>\nyouremailaddress). To change the address at which you receive the <br/>\nnewsletter, unsubscribe your old address and then subscribe to your <br/>\nnew one.<br/>\n<br/>\nSee you next month!<br/>\n<br/>\nCarol Narigon, Newsletter Editor<br/>\nHEM-Newsletter@...<br/>\nMark and Helen Hegener, Publishers of Home Education Magazine</div>","specialLinks":[]}],"prevTopicId":50955,"nextTopicId":40643}}