{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":42,"messages":[{"userId":194903596,"authorName":"Ruth","from":"&quot;Ruth&quot; &lt;grayfamily9@...&gt;","profile":"ladybird579","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: YES, how unschooling works","postDate":"1110380979","msgId":104314,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwM2EwMWM1MjRiYSQwM2JhODZjMCRjYWUxZjlkNUBwY2FiYTFkMzU1NTE5Zj4=","referencesHeader":"PGEwLjIzZDZhYzY0LjJmNjA2MGY2QGFvbC5jb20+"},"prevInTopic":104311,"nextInTopic":104315,"prevInTime":104313,"nextInTime":104315,"topicId":104221,"numMessagesInTopic":0,"msgSnippet":"I can t and wouldn t try to defend a family that had said, Well, I made some offers, but my kids weren t interested, so I just let them stay home in their","messageBody":"<div id=\"ygrps-yiv-1415353471\">I can&#39;t and wouldn&#39;t try to defend a family that had said, &quot;Well, I made  <br/>\nsome offers, but my kids weren&#39;t interested, so I just let them stay home in  <br/>\ntheir rooms because that&#39;s how they are.&quot;<br/>\n<br/>\nI agree with this. First I will introduce myself cos this is the 3rd time I have posted without saying who I am. I am Ruth, I unschool 7 kids between the ages of 6 year old twins up to a 15 old son in the UK. I joined this list to hear how others see unschooling. I have had a lot of flack for it and even had my mother complain about me to the education authority over it and had a social worker round as a result. The social worker was happy but relations with my mother ended over this and other things she had done. I know people like this whose kids sit around the house all day bored in the name of unschooling.   They go nowhere and don&#39;t do very much in the home either. they complain to my kids about their lives. I find it hard to understand parents who think that doing absolutely nothing at all to create a stimulating atmosphere is unschooling.  I think unschooling is harder than structured homeschooling cos it is harder to make opportunities to get a child&#39;s creativity going everyday than say sitting them down and say now we are doing maths for an hour.  Some people don&#39;t see that.  Unschooling was the hardest thing I have ever done  cos I have had to let go of all my preconceived notions of how children learn and how I was taught and trust them to know what they need to know. Not what others think they should know. <br/>\n<br/>\nRuth<br/>\n____________________________________________________________________________<br/>\nThis email and all attachments have been electronically scanned by Kingston<br/>\nCommunications&#39; email Anti-Virus service and no known viruses were detected.<br/>\n____________________________________________________________________________<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":163750020,"authorName":"tuckervill2@aol.com","from":"tuckervill2@...","profile":"tuckervill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] YES, how unschooling works","postDate":"1110379542","msgId":104307,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg4LjIyMzc0MzJlLjJmNjA2NjE2QGFvbC5jb20+"},"prevInTopic":104306,"nextInTopic":104310,"prevInTime":104306,"nextInTime":104308,"topicId":104221,"numMessagesInTopic":0,"msgSnippet":"In a message dated 3/7/2005 10:27:13 PM Central Standard Time, jjjwoolfolk@sbcglobal.net writes: because  we just maybe the kind who really don t have tons of ","messageBody":"<div id=\"ygrps-yiv-1526467625\">In a message dated 3/7/2005 10:27:13 PM Central Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jjjwoolfolk@...\">jjjwoolfolk@...</a> writes:<br/>\n<br/>\nbecause  we just maybe the kind who really don&#39;t have tons of <br/>\ncool conversations,  or go to the museums, or on trips, or spend money on <br/>\nstuff in the hopes  that ds will not look at it and say &quot;that looks <br/>\nstupid, or boring or  sucky&quot;.....<br/>\n<br/>\n<br/>\n<br/>\n~~~<br/>\n <br/>\nJulie, you and Josh are always in a power struggle over everything.   I&#39;m not <br/>\ntelling you something you don&#39;t already know.  Stop caring about  what he <br/>\nthinks about things so much.  Buy it, don&#39;t show it to him, put it  on the shelf, <br/>\nenjoy it yourself and don&#39;t worry about what he thinks.  It&#39;s  irrelavent. <br/>\n <br/>\nI happen to know that Josh is capable of cool conversations.  I had  one with <br/>\nhim about his Benjamin Franklin action figure.  And classical  music!  I&#39;ve <br/>\nseen him do improv on a stage with a big group of kids and  I&#39;ve seen him <br/>\nparticipate in boffery with complicated rules.  Maybe the  reason he doesn&#39;t have <br/>\ncool conversations with you is because you expect more  than he wants to give.  <br/>\nThe power struggle interferes.  When you push,  he pushes back.  You&#39;re too <br/>\nmuch alike.  <br/>\n <br/>\nTry not talking to him for a day.  Be quiet and observe.  Don&#39;t  criticize.  <br/>\nDon&#39;t roll your eyes.  Don&#39;t give it the old Al Gore  sigh.  Don&#39;t complain.  <br/>\nDon&#39;t condemn.*  Create a vacuum.   Not a punitive one, but one of open <br/>\nacceptance of everything he wants or does,  quietly, happily and without anxiety <br/>\nabout how or what he&#39;s doing.  As  if you&#39;re content with the world just the way <br/>\nit is.  And if you&#39;re not  content, fake it until you make it.  <br/>\n <br/>\nUnplug from that power struggle, dear.  <br/>\n <br/>\n*Dale Carnegie, in How to Win Friends and Influence People:  Never  <br/>\ncriticize, condemn or complain.<br/>\n <br/>\nKaren<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: YES, how unschooling works","postDate":"1110379166","msgId":104306,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFkNC4zN2FiZWNmNy4yZjYwNjQ5ZUBhb2wuY29tPg=="},"prevInTopic":104305,"nextInTopic":104307,"prevInTime":104305,"nextInTime":104307,"topicId":104221,"numMessagesInTopic":0,"msgSnippet":"In a message dated 3/9/2005 12:57:58 AM Mountain Standard Time, sheran@ptd.net writes: But most  of that isn t personality.  Most of that is attitude that ","messageBody":"<div id=\"ygrps-yiv-1024448391\">In a message dated 3/9/2005 12:57:58 AM Mountain Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sheran@...\">sheran@...</a> writes:<br/>\n<br/>\nBut most  of that isn&#39;t personality.  Most of that is attitude that <br/>\nthey&#39;ve  developed from some situation that isn&#39;t representative of <br/>\nwho they really  are deep down inside.  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n----------------------<br/>\n <br/>\nThen either they can&#39;t unschool, or they need to start NOW, right now, not  <br/>\ntomorrow, recovering from their bad attutide and &quot;situation.&quot;  <br/>\n <br/>\nIf a family doesn&#39;t have the ease of communication to make unschooling  work, <br/>\nthey shouldn&#39;t unschool.<br/>\n <br/>\nIf a parent&#39;s going to say, &quot;This is just how I am, I have a RIGHT to be  <br/>\nangry and negative because of the ozone level and the war&quot; then that person  <br/>\nshould put the kids in school and stay home worrying about things she can&#39;t  <br/>\nchange.  At least maybe the kids will find friends at school or teachers  who WILL <br/>\nsee them and be positive with them.  <br/>\n <br/>\nThere are depressed and unfocussed parents who don&#39;t have the ability to  <br/>\ncreate a busy, happy, child-nurturing environment.  But that&#39;s  okay!   They just <br/>\nneed to have other people teach their kids and not  take on a project they <br/>\ncan&#39;t handle.<br/>\n <br/>\n-=-Right, but a child who&#39;s been forced to be in school might have some  <br/>\nhealing to do and might need to do what looks like brooding and being  <br/>\nnegative for awhile.  Maybe not most kids and maybe not usually, but  <br/>\npeople heal and deal with things in different ways.  -=-<br/>\n <br/>\nThey don&#39;t have ten years to heal.  They have now.  RIght now,  get on it, or <br/>\ndon&#39;t try.<br/>\n <br/>\nJust for a wild, made-up example, say a family used to eat out a lot, twice  <br/>\na day or more, and if the kids had money and used to be able to get food out <br/>\nof  vending machines, but the family decides no, we&#39;re going to only eat at <br/>\nhome  now.  It will be fun!  It will be healthier.<br/>\n <br/>\nHow long before they need to go grocery shopping?<br/>\nHow long before they really need to start preparing some food?<br/>\nHow long can they just not have any dishes to use, or a knife to cut cheese  <br/>\nand vegetables with?  <br/>\nCan the mom say &quot;Well, I don&#39;t know how to cook, but my kids are NEVER  going <br/>\nto eat at restaurants again&quot;?  <br/>\nShould the dad say, &quot;We&#39;re saving a LOT of money not eating out.  I&#39;m  going <br/>\nto really think about how I want to do this food-at-home thing before we  <br/>\ninvest any money in it.&quot;<br/>\n <br/>\nThey can&#39;t wait. They have to feed those kids right away, and often.<br/>\nThey had alternatives, but they made a choice.<br/>\n <br/>\n <br/>\nUnschooling parents have alternatives.  If they&#39;re going to unschool,  they <br/>\nneed to DO it, not just be passive hopeful observers.<br/>\n <br/>\n-=- I&#39;m just saying that if we&#39;re going to trust our kids, <br/>\nit could be  that sometimes our kids might be desiring what looks to <br/>\nus like &quot;not  enough&quot;.  -=-<br/>\n <br/>\nGiven a rich environment and happy surroundings, I have confidence that any  <br/>\nchild can and will learn.  Given a dull environment and depressed or  <br/>\nuninvolved parents, no ability to get out and about, no new input, I have  confidence <br/>\nthat a child could slow down and stop learning much at all.  <br/>\n <br/>\n&quot;Trust our kids&quot; doesn&#39;t work in a vacuum.  That idea of trusting kids  to <br/>\nlearn is entirely wrapped in the assumption of a happy, involving, rich  <br/>\nenvironment.<br/>\n <br/>\n-=-The topic of abolishing schools is a completely different topic  <br/>\naltogether.  =-<br/>\n <br/>\nNo it isn&#39;t.  If unschooling doesn&#39;t even work for those family who  <br/>\nconsciously choose it, it would be insane to suggest that MORE people try  it.  And it <br/>\nis chosen because there are alternatives.  There are  public, private, <br/>\ncorrespondence, and at-home school options.  If someone is  unschooling out of <br/>\nlaziness, it&#39;s not going to work.  It will only work  when the main unschooling <br/>\nparent has the intent and ability to make life bigger  and better than it would <br/>\nhave been without the plan to unschool, and bigger and  better than it would be <br/>\nwith a curriculum, and bigger and better than school  would have been.<br/>\n <br/>\n-=-Some people might worry about not enough <br/>\nreading, others might worry  about not enough social activity, others <br/>\nmight worry about not enough  conversation. -=-<br/>\n <br/>\nI&#39;m worried about moms who seem worried about not enough lively activity,  <br/>\nnot enough learning.<br/>\n <br/>\n <br/>\nSandra<br/>\n <br/>\n <br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":163750020,"authorName":"tuckervill2@aol.com","from":"tuckervill2@...","profile":"tuckervill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] YES, how unschooling works","postDate":"1110378795","msgId":104305,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5Ni4zYTcyZWJjNi4yZjYwNjMyYkBhb2wuY29tPg=="},"prevInTopic":104304,"nextInTopic":104306,"prevInTime":104304,"nextInTime":104306,"topicId":104221,"numMessagesInTopic":0,"msgSnippet":"In a message dated 3/7/2005 10:27:13 PM Central Standard Time, jjjwoolfolk@sbcglobal.net writes: Its easier to do schoolish ~~~ Broaden your definition of","messageBody":"<div id=\"ygrps-yiv-589910931\">In a message dated 3/7/2005 10:27:13 PM Central Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jjjwoolfolk@...\">jjjwoolfolk@...</a> writes:<br/>\n<br/>\nIts  <br/>\neasier to do &quot;schoolish&quot;<br/>\n<br/>\n<br/>\n~~~<br/>\n <br/>\nBroaden your definition of schoolish.  Then, take the activity that  you <br/>\nincluded in that definition and tell Jim about it in his narrow definition&#39;s  <br/>\nterms.  You know, educationese.  <br/>\n <br/>\nJulie, you&#39;re one of the most well-read on the topic of home/unschooling  <br/>\npeople I know. You know how to do this.  Just do it.  ;)<br/>\n <br/>\nLove,<br/>\nKaren<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: YES, how unschooling works","postDate":"1110378230","msgId":104304,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGEwLjIzZDZhYzY0LjJmNjA2MGY2QGFvbC5jb20+"},"prevInTopic":104297,"nextInTopic":104305,"prevInTime":104303,"nextInTime":104305,"topicId":104221,"numMessagesInTopic":0,"msgSnippet":"In a message dated 3/9/2005 12:57:58 AM Mountain Standard Time, sheran@ptd.net writes: -=-  If a family decides when a child is 15 that it might ve been WAY ","messageBody":"<div id=\"ygrps-yiv-707274917\">In a message dated 3/9/2005 12:57:58 AM Mountain Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sheran@...\">sheran@...</a> writes:<br/>\n<br/>\n-=-&gt;  If a family decides when a child is 15 that it might&#39;ve been WAY   <br/>\nbetter for <br/>\n<blockquote><span title=\"ireply\"> &gt; unschooling if they had done a lot more sooner, it  will be too  <br/>\n </span></blockquote>late.  <br/>\n<br/>\n-=-I have had friends who don&#39;t  agree with unschooling say a similar <br/>\nthing to me about school  subjects.  They say stuff like, &quot;What if <br/>\nwhen they&#39;re adults they  wish you would have taught them math and <br/>\nreading more formally and at an  earlier age? What if you realize too <br/>\nlate that you were wrong about not  sending them to school?&quot;  -=-<br/>\n---------------------------------------<br/>\n <br/>\nThere are classes and books for learning to do math which are ONLY aimed  <br/>\ntoward adults.  Kirby&#39;s taking math 099, and having started without any  <br/>\nknowledge of formal mathematical notation he&#39;s getting an A after six weeks or  so.  <br/>\n <br/>\nKirby&#39;s 18.  Whatever I wish I had done with the ten year old Kirby or  the <br/>\n12 year old Kirby, it&#39;s too late.  Those days are gone.   <br/>\n <br/>\nMath and reading are skills kids can gain.  <br/>\nFreedom and a childhood relationship with a mother and the ability to learn  <br/>\nnaturally as a child are NOT things that can be gained as adults.<br/>\n <br/>\n <br/>\n<br/>\n-=-Are you saying that we can trust a child to learn to read when  he&#39;s <br/>\nready but we can&#39;t always trust a child to know how social he should  <br/>\nbe? -=-<br/>\n<br/>\n<br/>\n<br/>\nI&#39;m not talking about &quot;being social.&quot;  I&#39;m talking about exposure to  the <br/>\nworld.  A person can go to a museum or a movie without chatting with  others.  A <br/>\nmom can enrich the home environment without throwing  parties.  <br/>\n <br/>\n-=-It seems like I&#39;m arguing a lot but the thing is I agree with you.   I <br/>\njust find myself saying yes, &quot;but&quot; after a lot of things. -=-<br/>\n <br/>\nIt seems your defending people settling for bare-minimum effort and  <br/>\nactivity.  It sounds like you&#39;re justifying people doing a half-assed job  of <br/>\nunschooling.  I don&#39;t guess you mean to do that, but it seems like  it.<br/>\n <br/>\n-=- I have read about people who are people of few words though, who only  <br/>\nspeak when they must.  I don&#39;t know if that&#39;s a normal personality  <br/>\ntrait or something else.  If it is a normal personality trait then  <br/>\nI&#39;d say that it&#39;s okay for the person to be a person of few words.   <br/>\nIt can&#39;t be wrong to be who you are.  -=-<br/>\n <br/>\nIf there are enough factors that a family isn&#39;t unschooling well, then they  <br/>\nshould put their kids in school.<br/>\n <br/>\nNobody here is authorized to let anyone off the hook about compulsory  <br/>\neducation laws.  All of us put together can&#39;t save ONE FAMILY from the  place where <br/>\nthey live if they are found to just be cruising in some lazy,  avoidant <br/>\nfashion.  I&#39;m really unlikely to get in trouble, as my kids are  doing well and <br/>\nwould impress any government officials who might question  them about their lives, <br/>\nif we had somone complain about us.<br/>\n <br/>\nI can&#39;t and wouldn&#39;t try to defend a family that had said, &quot;Well, I made  <br/>\nsome offers, but my kids weren&#39;t interested, so I just let them stay home in  <br/>\ntheir rooms because that&#39;s how they are.&quot;<br/>\n <br/>\nUnschooling is one possible way to homeschool.  Homeschooling is one  <br/>\npossible way for people to fulfill state requirements.  If people can&#39;t do  it, they <br/>\ncan&#39;t and shouldn&#39;t.  If they DO want to do it, it&#39;s an active and  difficult <br/>\nway of life that can&#39;t be sloughed off until maybe a few years from  now.  It <br/>\nhas to be done and done right and well, or it&#39;s just  neglect.   <br/>\n <br/>\nWhen people come here and say &quot;Unschooling is just neglect,&quot; I&#39;d like to  say <br/>\n&quot;No, neglect isn&#39;t unschooling.&quot;<br/>\n <br/>\nIt seems there are people in this conversation suggesting that neglect is  <br/>\nunschooling.<br/>\n <br/>\nI&#39;d like for those few people to stop doing that on this list.  If you  want <br/>\nto start another list for &quot;unschooling is whatever the hell you want it to  be <br/>\nand introverted kids shouldn&#39;t ever be stimulated beyond their comfort at the <br/>\n moment,&quot; it&#39;s really easy to start a yahoolist.<br/>\n <br/>\nSandra<br/>\n <br/>\n <br/>\n <br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":213646924,"authorName":"Patti Diamondlady Diamond, SCHM","from":"&quot;Patti Diamondlady Diamond, SCHM&quot; &lt;Diamondlady1025@...&gt;","profile":"diamondlady1025","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: YES, how unschooling works","postDate":"1110360141","msgId":104311,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQwbWY4ZCt2aDVxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDVkMzliNWVhMjY1YzM3YmY3Y2RkZmIwMzMwMjRlMjY2QGVhcnRobGluay5uZXQ+"},"prevInTopic":104310,"nextInTopic":104314,"prevInTime":104310,"nextInTime":104312,"topicId":104221,"numMessagesInTopic":0,"msgSnippet":"Pam, I would agree with you. But I think I would also add though that some people may not have the financial resources or the research skills as parents to","messageBody":"<div id=\"ygrps-yiv-831782127\">Pam,<br/>\n<br/>\nI would agree with you. But I think I would also add though that some<br/>\npeople may not have the financial resources or the research skills as<br/>\nparents to help facillitate an exposure to learning outside of the home.<br/>\n<br/>\nI believe that this is where we as the people who have the resources,<br/>\nsupport, and guidance, that it is our job to step up to the plate and<br/>\nhelp them, as we on this list and on many others have and are doing<br/>\njust that!:)<br/>\n<br/>\nLove and Light,<br/>\n <br/>\nPatti Diamond and the boys (Life Long Learners Chris 13 1/2, Matthew<br/>\n8, Anthony 7)<br/>\nLife Long Learning Academy<br/>\nJUST PUBLISHED!! &quot;Life Long Learning ~ Transforming Learning -<br/>\nDiscovering Learning Through Living Life in Unlimitless Possibilities&quot;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.lifelonglearning4all.com\">http://www.lifelonglearning4all.com</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.diamondlady.net\">http://www.diamondlady.net</a><br/>\n <br/>\n*NOTE - Look for me to speak on Life Long Learning at the CHN<br/>\nHomelearning Expo June 10-11, 2005. For more information, go to<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.californiahomeschool.net\">http://www.californiahomeschool.net</a> See you there! *<br/>\n <br/>\n&quot;For no matter where knowledge and learning come from - no matter what<br/>\nshape, size, or dimension it assumes - it still is what it is,<br/>\nknowledge and learning. Therefore knowledge and learning should always<br/>\nbe embraced.&quot; ~ unknown<br/>\n  <br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, Pam Sorooshian<br/>\n&lt;pamsoroosh@e...&gt; wrote:<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; On Mar 8, 2005, at 12:28 PM, kayb85 wrote:<br/>\n&gt; <br/>\n&gt; &gt; If we say that some kids should be pushed out of their personalities<br/>\n&gt; &gt; because they aren&#39;t good personalities for unschooling, then it&#39;s not<br/>\n&gt; &gt; true that we can trust children (and people in general) to learn what<br/>\n&gt; &gt; they need to learn.<br/>\n&gt; <br/>\n&gt; I don&#39;t think you can trust children to learn in a deprived <br/>\n&gt; environment. I think human children are born with an urge to learn <br/>\n&gt; about the world, but parents, who have all kinds of baggage from THEIR <br/>\n&gt; own childhoods, might not be able to create an environment that is <br/>\n&gt; stimulating and enriching.<br/>\n&gt; <br/>\n&gt; &gt;  Then it would only be true that we can trust<br/>\n&gt; &gt; SOME people to learn what they need to learn and the whole theory of<br/>\n&gt; &gt; unschooling has just been shot down because we can no longer be sure<br/>\n&gt; &gt; that we can trust our kids.<br/>\n&gt; <br/>\n&gt; Clearly a kid cooped up in the house with always the same few resources <br/>\n&gt; is not going to have the same opportunities to discover his own <br/>\n&gt; interests and passions as a kid living in a house with many varied <br/>\n&gt; resources and who gets out of the house and is exposed to a variety of <br/>\n&gt; opportunities to learn about all kinds of things.<br/>\n&gt; <br/>\n&gt; -pam </span></blockquote></div>","specialLinks":[]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: YES, how unschooling works","postDate":"1110358956","msgId":104297,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVkMzliNWVhMjY1YzM3YmY3Y2RkZmIwMzMwMjRlMjY2QGVhcnRobGluay5uZXQ+","inReplyToHeader":"PGQwbDF1YStvYmpjQGVHcm91cHMuY29tPg==","referencesHeader":"PGQwbDF1YStvYmpjQGVHcm91cHMuY29tPg=="},"prevInTopic":104296,"nextInTopic":104304,"prevInTime":104296,"nextInTime":104298,"topicId":104221,"numMessagesInTopic":0,"msgSnippet":"... I don t think you can trust children to learn in a deprived environment. I think human children are born with an urge to learn about the world, but","messageBody":"<div id=\"ygrps-yiv-800079688\">On Mar 8, 2005, at 12:28 PM, kayb85 wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If we say that some kids should be pushed out of their personalities<br/>\n&gt; because they aren&#39;t good personalities for unschooling, then it&#39;s not<br/>\n&gt; true that we can trust children (and people in general) to learn what<br/>\n&gt; they need to learn.<br/>\n<br/>\n </span></blockquote>I don&#39;t think you can trust children to learn in a deprived <br/>\nenvironment. I think human children are born with an urge to learn <br/>\nabout the world, but parents, who have all kinds of baggage from THEIR <br/>\nown childhoods, might not be able to create an environment that is <br/>\nstimulating and enriching.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  Then it would only be true that we can trust<br/>\n&gt; SOME people to learn what they need to learn and the whole theory of<br/>\n&gt; unschooling has just been shot down because we can no longer be sure<br/>\n&gt; that we can trust our kids.<br/>\n<br/>\n </span></blockquote>Clearly a kid cooped up in the house with always the same few resources <br/>\nis not going to have the same opportunities to discover his own <br/>\ninterests and passions as a kid living in a house with many varied <br/>\nresources and who gets out of the house and is exposed to a variety of <br/>\nopportunities to learn about all kinds of things.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":213646924,"authorName":"Patti Diamondlady Diamond, SCHM","from":"&quot;Patti Diamondlady Diamond, SCHM&quot; &lt;Diamondlady1025@...&gt;","profile":"diamondlady1025","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: YES, how unschooling works","postDate":"1110357909","msgId":104310,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQwbWQybCs3bDM2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDViLjY1MWJjNTQ5LjJmNWY4NDY5QGFvbC5jb20+"},"prevInTopic":104307,"nextInTopic":104311,"prevInTime":104309,"nextInTime":104311,"topicId":104221,"numMessagesInTopic":0,"msgSnippet":"I agree that if we are to give our children the freedom, time, and space to know what they need and then trust that this is what they need, then if being as","messageBody":"<div id=\"ygrps-yiv-258953958\">I agree that if we are to give our children the freedom, time, and<br/>\nspace to know what they need and then trust that this is what they<br/>\nneed, then if being as what is deemed by sociey as &quot;introverted&quot; is<br/>\nwhat suits them and is who they wish to be, then we should allow our<br/>\nchildren to be who they wish to be, not attempting to &quot;change&quot; them.<br/>\nAs we cannot change others, we can only change ourselves and our<br/>\nreactions to others.<br/>\n<br/>\nBecause honestly, I think that my children prefer to be with others in<br/>\nsmaller groups and at times just on their own. And personally, I do<br/>\nnot see anything &quot;wrong&quot; with this, although I know as a societal<br/>\nwhole it is considered to be &quot;bad&quot;.<br/>\n<br/>\nThey learn well and interact with smaller groups of people, and I do<br/>\nnot think in the name of broadening their worldly scope so to speak<br/>\nthat I would ever consider forcing them into being &quot;out there&quot; more or<br/>\n&quot;doing&quot; more or &quot;being&quot; more active than they wish to be. I might<br/>\nsuggest or other these types of broader means in an attempt to show<br/>\nthem another view of life or something that they may wish to learn<br/>\npossibly, but never force them for the sake of trying to &quot;change&quot; them.<br/>\n<br/>\nIntroverted or extoverted, I think these are labels that we give toour<br/>\nchildren to attempt to classify them as somehow &quot;good&quot; or &quot;bad&quot;. Good<br/>\nsupposedly being extroverted by societal standards and introverted as<br/>\nsomehow that something is &quot;wrong&quot; with our children if they are.<br/>\n<br/>\nWhy can society not let our children just be who they are? Children,<br/>\npeople in society carving out their own way in life!:)<br/>\n<br/>\nIn Love and Light,<br/>\n <br/>\nPatti Diamond and the boys (Life Long Learners Chris 13 1/2, Matthew<br/>\n8, Anthony 7)<br/>\nLife Long Learning Academy<br/>\nJUST PUBLISHED!! &quot;Life Long Learning ~ Transforming Learning -<br/>\nDiscovering Learning Through Living Life in Unlimitless Possibilities&quot;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.lifelonglearning4all.com\">http://www.lifelonglearning4all.com</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.diamondlady.net\">http://www.diamondlady.net</a><br/>\n <br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, SandraDodd@a... wrote:<br/>\n&gt;  <br/>\n&gt; In a message dated 3/8/2005 1:34:34 PM Mountain Standard Time,  <br/>\n&gt; sheran@p... writes:<br/>\n&gt; <br/>\n&gt; So I  think it&#39;s up to every woman to decide for herself what exactly <br/>\n&gt; she&#39;s  feeling and why.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; ----------------------<br/>\n&gt;  <br/>\n&gt; To &quot;decide&quot;?  <br/>\n&gt; Or to keep trying to learn to know?<br/>\n&gt; <br/>\n&gt; The first, lots of people have decided they think they know what <br/>\nthey&#39;re <br/>\n&gt; feeling and why, only to express much sorrow later over having deluded  <br/>\n&gt; themselves or lived in justification or in doing what their mothers<br/>\nwanted them  to do.<br/>\n&gt;  <br/>\n&gt; There are people who come to these lists who are really terrified of<br/>\n defying <br/>\n&gt; their mothers, even though THEY are mothers with children.  Have  they <br/>\n&gt; decided for themselves what exactly they&#39;re feeling and why?  <br/>\nSometimes they don&#39;t <br/>\n&gt; even see what they&#39;re writing.  <br/>\n&gt;  <br/>\n&gt; -=- I&#39;m not saying that <br/>\n&gt; unschooling is about isolating our kids, but  that if we&#39;re trusting <br/>\n&gt; our kids to know what they need, and they seem to be  needing more <br/>\n&gt; isolation, then I say give them isolation.  <br/>\n&gt; -=-<br/>\n&gt;  <br/>\n&gt; Isolation comes from outside.  Isolation is something that is done to  <br/>\n&gt; someone by someone else.  Isolation is done to fundamentalist<br/>\nhomeschoolers  whose <br/>\n&gt; parents sometimes don&#39;t even want them going to church, but they<br/>\n&quot;home  church&quot; <br/>\n&gt; too.  That&#39;s what you&#39;ll pull up when you combine <br/>\nhomeschooling+isolation.<br/>\n&gt;  <br/>\n&gt; -=-There are people in a lot of states that say a child should know<br/>\nhow  <br/>\n&gt; to read by the time he&#39;s 6 or 7 or at the latest 8.  Yet lots of  <br/>\n&gt; unschooled kids learn to read later than that. -=-<br/>\n&gt;  <br/>\n&gt; MOST Of the kids in school learn to read much later than that, if<br/>\nthey were  <br/>\n&gt; to define reading the way I do.  But in school, those who can&#39;t read<br/>\nwere  <br/>\n&gt; just uncooperative or learning disabled or had parents who were<br/>\ninsufficiently  <br/>\n&gt; involved.  It&#39;s never the school&#39;s fault.<br/>\n&gt;  <br/>\n&gt; -=- Lots of would-be-<br/>\n&gt; unschoolers lose their nerve to unschool when  their 8 or 9 year old <br/>\n&gt; still isn&#39;t reading and they listen to the fear in  their heads that <br/>\n&gt; tells them that their child needs something more and they  make them <br/>\n&gt; sit down for reading lessons. -=-<br/>\n&gt;  <br/>\n&gt; Yes,and people here and in other unschooling places are able to help<br/>\nthem  <br/>\n&gt; through those fears.<br/>\n&gt;  <br/>\n&gt; -=-Isn&#39;t that fear of a child not knowing <br/>\n&gt; how to read similar to  a  fear that a child is not going out enough?  <br/>\n&gt; Just on a different  level or to a different degree?  -=-<br/>\n&gt;  <br/>\n&gt; No.<br/>\n&gt; When a child learns to read, you both know it, because he&#39;s reading.<br/>\n&gt;  <br/>\n&gt; If a family decides when a child is 15 that it might&#39;ve been WAY <br/>\nbetter for <br/>\n&gt; unschooling if they had done a lot more sooner, it will be too <br/>\nlate.  If the <br/>\n&gt; relationship between the parents and children withers because  the<br/>\nparents <br/>\n&gt; weren&#39;t engaging enough and so the child doesn&#39;t have an easy <br/>\nconversant <br/>\n&gt; relationship, and they&#39;re out of the habit of being together and <br/>\nlearning together, <br/>\n&gt; their unschooling won&#39;t be the best it could be.<br/>\n&gt;  <br/>\n&gt; If people are wanting this list to put a stamp of approval on<br/>\nbare-minimal  <br/>\n&gt; unschooling, it&#39;s not going to come from me. I have zero interest in<br/>\nmaking  <br/>\n&gt; people feel better about doing less, personally.<br/>\n&gt;  <br/>\n&gt; In any case in which the parents aren&#39;t worried and the children are<br/>\nhappy,  <br/>\n&gt; none of this conversation matters at all.<br/>\n&gt;  <br/>\n&gt; -=-Can anyone ever have a personality that keeps unschooling from  <br/>\n&gt; working well? -=-<br/>\n&gt;  <br/>\n&gt; Bigtime.<br/>\n&gt;  <br/>\n&gt; Parents who are negative and whiney and ashamed of curiosity and<br/>\nhave  no <br/>\n&gt; interest in learning are going to be crap at unschooling.   People <br/>\nwho are mean <br/>\n&gt; and violent and think children are to be seen and not heard, who <br/>\nwere abused <br/>\n&gt; as children and haven&#39;t even begun to deal with that emotionally <br/>\nshouldn&#39;t <br/>\n&gt; unschool.  Their kids will probably be safer and better off in  school.<br/>\n&gt;  <br/>\n&gt; -=- I&#39;ve seen how not allowing people to be who they are can <br/>\n&gt; really  lead to some difficult emotional issues, so I really like that <br/>\n&gt; with  unschooling we can just trust that no matter what the <br/>\n&gt; personality, the child  is accepted as he is and allowed to be that.  <br/>\n&gt; -=-<br/>\n&gt;  <br/>\n&gt; That sounds good, and in ideal circumstances it&#39;s great.<br/>\n&gt;  <br/>\n&gt; Some families don&#39;t have ideal circumstances, and unschooling won&#39;t<br/>\nwork  for <br/>\n&gt; them.<br/>\n&gt;  <br/>\n&gt; -=-If we say that some kids should be pushed out of their<br/>\npersonalities  <br/>\n&gt; because they aren&#39;t good personalities for unschooling, then it&#39;s not  <br/>\n&gt; true that we can trust children (and people in general) to learn what  <br/>\n&gt; they need to learn.-=-<br/>\n&gt;  <br/>\n&gt; I think all children can learn through unschooling, I don&#39;t think all  <br/>\n&gt; parents are suited to being unschooling parents.<br/>\n&gt;  <br/>\n&gt; It is possible that a child will already be so brainwashed by the<br/>\nage of  ten <br/>\n&gt; or twelve that he can&#39;t undo school.  If he would rather be in<br/>\nschool  and is <br/>\n&gt; thoroughly convinced that school is the only place he can learn,<br/>\nthen I  <br/>\n&gt; think the parents should let him stay in school.  I think having a<br/>\nchild  <br/>\n&gt; homeschooled against his will is as bad as a kid being in school<br/>\nagainst his  will, <br/>\n&gt; who wants out.<br/>\n&gt;  <br/>\n&gt; And if a child wants out of school and the parents say, &quot;Yes, sure,<br/>\nwe will  <br/>\n&gt; commit to this,&quot; then I think the child should be willing to DO<br/>\nthings in lieu <br/>\n&gt;  of school and the parents, too, should be very active in that<br/>\nchild&#39;s life, <br/>\n&gt; and  not just go home and shut the door and live a drab, negative life.<br/>\n&gt;  <br/>\n&gt; -=-Then it would only be true that we can trust <br/>\n&gt; SOME people to learn  what they need to learn and the whole theory of <br/>\n&gt; unschooling has just been  shot down because we can no longer be sure <br/>\n&gt; that we can trust our  kids. -=-<br/>\n&gt;  <br/>\n&gt; You have never read any long-years-experienced unschooler say that the  <br/>\n&gt; schools should be abolished and everyone should unschool. The<br/>\nthousands of hours  <br/>\n&gt; of writing that&#39;s been put in here, unschooling.com and various<br/>\nother places <br/>\n&gt; has  stressed that it takes a LOT of change and awareness on the<br/>\npart of the <br/>\n&gt; parents  to do this.  And it takes deschooling on the part of the<br/>\nchild and of <br/>\n&gt; the  parents.  It&#39;s not easy.  It&#39;s not something just anyone can<br/>\ndo.   And <br/>\n&gt; half-assed isn&#39;t good enough.  <br/>\n&gt;  <br/>\n&gt; Sandra<br/>\n&gt;  <br/>\n&gt;  <br/>\n&gt;  <br/>\n&gt;  <br/>\n&gt;  <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":1352017,"authorName":"kayb85","from":"&quot;kayb85&quot; &lt;sheran@...&gt;","profile":"kayb85","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: YES, how unschooling works","postDate":"1110339798","msgId":104296,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQwbHJjbSs4ajc3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDViLjY1MWJjNTQ5LjJmNWY4NDY5QGFvbC5jb20+"},"prevInTopic":104290,"nextInTopic":104297,"prevInTime":104295,"nextInTime":104297,"topicId":104221,"numMessagesInTopic":0,"msgSnippet":"... exactly ... Decide wasn t the best word I could have used.  I meant to look down deep inside of herself and find exactly what she s feeling and why. ... ","messageBody":"<div id=\"ygrps-yiv-899149938\"><blockquote><span title=\"ireply\">&gt; So I  think it&#39;s up to every woman to decide for herself what <br/>\n </span></blockquote>exactly <br/>\n<blockquote><span title=\"ireply\"> &gt; she&#39;s  feeling and why.<br/>\n&gt; <br/>\n<br/>\n&gt; To &quot;decide&quot;?  <br/>\n&gt; Or to keep trying to learn to know?<br/>\n<br/>\n </span></blockquote>Decide wasn&#39;t the best word I could have used.  I meant to look down <br/>\ndeep inside of herself and find exactly what she&#39;s feeling and why.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; -=- I&#39;m not saying that <br/>\n&gt; unschooling is about isolating our kids, but  that if we&#39;re <br/>\n </span></blockquote>trusting <br/>\n<blockquote><span title=\"ireply\"> &gt; our kids to know what they need, and they seem to be  needing more <br/>\n&gt; isolation, then I say give them isolation.  <br/>\n&gt; -=-<br/>\n&gt;  <br/>\n&gt; Isolation comes from outside.  Isolation is something that is done <br/>\n </span></blockquote>to  <br/>\n<blockquote><span title=\"ireply\"> &gt; someone by someone else. <br/>\n<br/>\n </span></blockquote>Okay.  I wasn&#39;t considering isolation as necessarily something done <br/>\nto someone by someone else.  I was thinking more along the lines of <br/>\nseclusion. Not someone secluding someone else against his will, but <br/>\nsomeone desiring to be alone a lot.  If someone craves seclusion, <br/>\nthen I think we should honor his desire to be alone.  <br/>\n<br/>\nAnd yet I agree that sometimes it looks like seclusion is what <br/>\nsomeone wants but it&#39;s just that we haven&#39;t done enough to get <br/>\nthrough and develop a good relationship with him or provide him just <br/>\nthe right thing that he  needs.  <br/>\n<br/>\nDeciding which exactly is needed is difficult sometimes and I don&#39;t <br/>\nthink we should take it lightly.  <br/>\n<br/>\nIsolation is done to fundamentalist homeschoolers  whose <br/>\n<blockquote><span title=\"ireply\"> &gt; parents sometimes don&#39;t even want them going to church, but <br/>\n </span></blockquote>they &quot;home  church&quot; <br/>\n<blockquote><span title=\"ireply\"> &gt; too.  That&#39;s what you&#39;ll pull up when you combine  <br/>\n </span></blockquote>homeschooling+isolation.<br/>\n<br/>\nI certainly didn&#39;t mean that!  <br/>\n<br/>\n  <br/>\n<blockquote><span title=\"ireply\"> &gt; If a family decides when a child is 15 that it might&#39;ve been WAY  <br/>\n </span></blockquote>better for <br/>\n<blockquote><span title=\"ireply\"> &gt; unschooling if they had done a lot more sooner, it will be too  <br/>\n </span></blockquote>late.  <br/>\n<br/>\nI have had friends who don&#39;t agree with unschooling say a similar <br/>\nthing to me about school subjects.  They say stuff like, &quot;What if <br/>\nwhen they&#39;re adults they wish you would have taught them math and <br/>\nreading more formally and at an earlier age? What if you realize too <br/>\nlate that you were wrong about not sending them to school?&quot;  <br/>\n<br/>\nAre you saying that we can trust a child to learn to read when he&#39;s <br/>\nready but we can&#39;t always trust a child to know how social he should <br/>\nbe? <br/>\n<br/>\nIf the <br/>\n<blockquote><span title=\"ireply\"> &gt; relationship between the parents and children withers because  the <br/>\n </span></blockquote>parents <br/>\n<blockquote><span title=\"ireply\"> &gt; weren&#39;t engaging enough and so the child doesn&#39;t have an easy  <br/>\n </span></blockquote>conversant <br/>\n<blockquote><span title=\"ireply\"> &gt; relationship, and they&#39;re out of the habit of being together and  <br/>\n </span></blockquote>learning together, <br/>\n<blockquote><span title=\"ireply\"> &gt; their unschooling won&#39;t be the best it could be.<br/>\n<br/>\n </span></blockquote>It seems like I&#39;m arguing a lot but the thing is I agree with you.  I <br/>\njust find myself saying yes, &quot;but&quot; after a lot of things.  I agree <br/>\nBUT I think we have to allow for some uncommon, even difficult <br/>\npersonalities to be who they are even when who they are doesn&#39;t <br/>\nproduce lives that look like what other unschoolers are doing. <br/>\n<br/>\nHaving a good relationship with our kids is very, very important and <br/>\nwe should do as much as we can to cultivate it.  <br/>\n<br/>\nI&#39;m really glad my kids and I do have an easy conversant <br/>\nrelationship, and I can&#39;t imagine being happy with anything less.  I <br/>\nhave read about people who are people of few words though, who only <br/>\nspeak when they must.  I don&#39;t know if that&#39;s a normal personality <br/>\ntrait or something else.  If it is a normal personality trait then <br/>\nI&#39;d say that it&#39;s okay for the person to be a person of few words.  <br/>\nIt can&#39;t be wrong to be who you are.  <br/>\n<br/>\nI&#39;m guessing that if someone is a person has a personality that&#39;s <br/>\nvery non-conversant that he&#39;s not going to do very well in school <br/>\neither.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If people are wanting this list to put a stamp of approval on bare-<br/>\n </span></blockquote>minimal  <br/>\n<blockquote><span title=\"ireply\"> &gt; unschooling, it&#39;s not going to come from me. I have zero interest <br/>\n </span></blockquote>in making  <br/>\n<blockquote><span title=\"ireply\"> &gt; people feel better about doing less, personally.<br/>\n<br/>\n </span></blockquote>I&#39;m certainly not advocating bare-minimal unschooling.  I&#39;m simply <br/>\nsaying that we should give the child what he wants even when what he <br/>\nwants is a lot of solitude.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; In any case in which the parents aren&#39;t worried and the children <br/>\n </span></blockquote>are happy,  <br/>\n<blockquote><span title=\"ireply\"> &gt; none of this conversation matters at all.<br/>\n<br/>\n </span></blockquote>This is another &quot;yes but&quot; thing for me.  I&#39;d say yes, BUT maybe the <br/>\nparents are worried for the wrong reason.  Or maybe the kid is happy <br/>\nbut because the parents don&#39;t understand his personality and can&#39;t <br/>\nimagine how anyone could be happy living life the way the child has <br/>\nchosen to live it, the parents could perceive a child as being <br/>\nunhappy when he really isn&#39;t.  <br/>\n  <br/>\nI&#39;m not saying that&#39;s how it&#39;s usually going to be.  What&#39;s usually <br/>\ngoing to be is what you&#39;re saying.  That a parent just hasn&#39;t worked <br/>\nhard enough to develop a good relationship and hasn&#39;t done enough of <br/>\nthe right thing to expose them to enough things, and just needs to <br/>\nwork harder.  My &quot;but&quot; is that there could be exceptions and that <br/>\nbecause there could be exceptions, a parent needs to look at his <br/>\nfamily&#39;s unique personalities and situations and figure out if it&#39;s a <br/>\ncase of the parent not doing enough or a case of the kid not needing <br/>\nmore or maybe a unique combination of both.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; -=-Can anyone ever have a personality that keeps unschooling from  <br/>\n&gt; working well? -=-<br/>\n&gt;  <br/>\n&gt; Bigtime.<br/>\n&gt;  <br/>\n&gt; Parents who are negative and whiney and ashamed of curiosity and <br/>\n </span></blockquote>have  no <br/>\n<blockquote><span title=\"ireply\"> &gt; interest in learning are going to be crap at unschooling.   People  <br/>\n </span></blockquote>who are mean <br/>\n<blockquote><span title=\"ireply\"> &gt; and violent and think children are to be seen and not heard, who  <br/>\n </span></blockquote>were abused <br/>\n<blockquote><span title=\"ireply\"> &gt; as children and haven&#39;t even begun to deal with that emotionally  <br/>\n </span></blockquote>shouldn&#39;t <br/>\n<blockquote><span title=\"ireply\"> &gt; unschool.  Their kids will probably be safer and better off in  <br/>\n </span></blockquote>school.<br/>\n<br/>\nBut most of that isn&#39;t personality.  Most of that is attitude that <br/>\nthey&#39;ve developed from some situation that isn&#39;t representative of <br/>\nwho they really are deep down inside.  <br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; I think all children can learn through unschooling, I don&#39;t think <br/>\n </span></blockquote>all  <br/>\n<blockquote><span title=\"ireply\"> &gt; parents are suited to being unschooling parents.<br/>\n<br/>\n </span></blockquote>Yep.  I know parents like that.  But they could be good unschooling <br/>\nparents if they&#39;d be willing to do the mental/emotional work required <br/>\nto unschool well. <br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt; It is possible that a child will already be so brainwashed by the <br/>\n </span></blockquote>age of  ten <br/>\n<blockquote><span title=\"ireply\"> &gt; or twelve that he can&#39;t undo school.  If he would rather be in <br/>\n </span></blockquote>school  and is <br/>\n<blockquote><span title=\"ireply\"> &gt; thoroughly convinced that school is the only place he can learn, <br/>\n </span></blockquote>then I  <br/>\n<blockquote><span title=\"ireply\"> &gt; think the parents should let him stay in school.  I think having a <br/>\n </span></blockquote>child  <br/>\n<blockquote><span title=\"ireply\"> &gt; homeschooled against his will is as bad as a kid being in school <br/>\n </span></blockquote>against his  will, <br/>\n<blockquote><span title=\"ireply\"> &gt; who wants out.<br/>\n<br/>\n </span></blockquote>Yep.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; And if a child wants out of school and the parents say, &quot;Yes, sure, <br/>\n </span></blockquote>we will  <br/>\n<blockquote><span title=\"ireply\"> &gt; commit to this,&quot; then I think the child should be willing to DO <br/>\n </span></blockquote>things in lieu <br/>\n<blockquote><span title=\"ireply\"> &gt;  of school and the parents, too, should be very active in that <br/>\n </span></blockquote>child&#39;s life, <br/>\n<blockquote><span title=\"ireply\"> &gt; and  not just go home and shut the door and live a drab, negative <br/>\n </span></blockquote>life.<br/>\n<br/>\nRight, but a child who&#39;s been forced to be in school might have some <br/>\nhealing to do and might need to do what looks like brooding and being <br/>\nnegative for awhile.  Maybe not most kids and maybe not usually, but <br/>\npeople heal and deal with things in different ways.  <br/>\n  <br/>\n<blockquote><span title=\"ireply\"> &gt; -=-Then it would only be true that we can trust <br/>\n&gt; SOME people to learn  what they need to learn and the whole theory <br/>\n </span></blockquote>of <br/>\n<blockquote><span title=\"ireply\"> &gt; unschooling has just been  shot down because we can no longer be <br/>\n </span></blockquote>sure <br/>\n<blockquote><span title=\"ireply\"> &gt; that we can trust our  kids. -=-<br/>\n&gt;  <br/>\n&gt; You have never read any long-years-experienced unschooler say that <br/>\n </span></blockquote>the  <br/>\n<blockquote><span title=\"ireply\"> &gt; schools should be abolished and everyone should unschool.<br/>\n<br/>\n </span></blockquote>The topic of abolishing schools is a completely different topic <br/>\naltogether.   I&#39;m just saying that if we&#39;re going to trust our kids, <br/>\nit could be that sometimes our kids might be desiring what looks to <br/>\nus like &quot;not enough&quot;.  Some people might worry about not enough <br/>\nreading, others might worry about not enough social activity, others <br/>\nmight worry about not enough conversation.  <br/>\n<br/>\n The thousands of hours  <br/>\n<blockquote><span title=\"ireply\"> &gt; of writing that&#39;s been put in here, unschooling.com and various <br/>\n </span></blockquote>other places <br/>\n<blockquote><span title=\"ireply\"> &gt; has  stressed that it takes a LOT of change and awareness on the <br/>\n </span></blockquote>part of the <br/>\n<blockquote><span title=\"ireply\"> &gt; parents  to do this.  And it takes deschooling on the part of the <br/>\n </span></blockquote>child and of <br/>\n<blockquote><span title=\"ireply\"> &gt; the  parents.  It&#39;s not easy. <br/>\n<br/>\n </span></blockquote>I agree 100%.  <br/>\n<br/>\n It&#39;s not something just anyone can do.   And <br/>\n<blockquote><span title=\"ireply\"> &gt; half-assed isn&#39;t good enough.  <br/>\n<br/>\n </span></blockquote>I don&#39;t think half-assed is good enough either.  <br/>\n<br/>\nSheila</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: YES, how unschooling works","postDate":"1110321769","msgId":104289,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDViLjY1MWJjNTQ5LjJmNWY4NDY5QGFvbC5jb20+"},"prevInTopic":104282,"nextInTopic":104290,"prevInTime":104288,"nextInTime":104290,"topicId":104221,"numMessagesInTopic":0,"msgSnippet":"In a message dated 3/8/2005 1:34:34 PM Mountain Standard Time, sheran@ptd.net writes: So I  think it s up to every woman to decide for herself what exactly ","messageBody":"<div id=\"ygrps-yiv-2034324925\">In a message dated 3/8/2005 1:34:34 PM Mountain Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sheran@...\">sheran@...</a> writes:<br/>\n<br/>\nSo I  think it&#39;s up to every woman to decide for herself what exactly <br/>\nshe&#39;s  feeling and why.<br/>\n<br/>\n<br/>\n----------------------<br/>\n <br/>\nTo &quot;decide&quot;?  <br/>\nOr to keep trying to learn to know?<br/>\n<br/>\nThe first, lots of people have decided they think they know what  they&#39;re <br/>\nfeeling and why, only to express much sorrow later over having deluded  <br/>\nthemselves or lived in justification or in doing what their mothers wanted them  to do.<br/>\n <br/>\nThere are people who come to these lists who are really terrified of  defying <br/>\ntheir mothers, even though THEY are mothers with children.  Have  they <br/>\ndecided for themselves what exactly they&#39;re feeling and why?   Sometimes they don&#39;t <br/>\neven see what they&#39;re writing.  <br/>\n <br/>\n-=- I&#39;m not saying that <br/>\nunschooling is about isolating our kids, but  that if we&#39;re trusting <br/>\nour kids to know what they need, and they seem to be  needing more <br/>\nisolation, then I say give them isolation.  <br/>\n-=-<br/>\n <br/>\nIsolation comes from outside.  Isolation is something that is done to  <br/>\nsomeone by someone else.  Isolation is done to fundamentalist homeschoolers  whose <br/>\nparents sometimes don&#39;t even want them going to church, but they &quot;home  church&quot; <br/>\ntoo.  That&#39;s what you&#39;ll pull up when you combine  homeschooling+isolation.<br/>\n <br/>\n-=-There are people in a lot of states that say a child should know how  <br/>\nto read by the time he&#39;s 6 or 7 or at the latest 8.  Yet lots of  <br/>\nunschooled kids learn to read later than that. -=-<br/>\n <br/>\nMOST Of the kids in school learn to read much later than that, if they were  <br/>\nto define reading the way I do.  But in school, those who can&#39;t read were  <br/>\njust uncooperative or learning disabled or had parents who were insufficiently  <br/>\ninvolved.  It&#39;s never the school&#39;s fault.<br/>\n <br/>\n-=- Lots of would-be-<br/>\nunschoolers lose their nerve to unschool when  their 8 or 9 year old <br/>\nstill isn&#39;t reading and they listen to the fear in  their heads that <br/>\ntells them that their child needs something more and they  make them <br/>\nsit down for reading lessons. -=-<br/>\n <br/>\nYes,and people here and in other unschooling places are able to help them  <br/>\nthrough those fears.<br/>\n <br/>\n-=-Isn&#39;t that fear of a child not knowing <br/>\nhow to read similar to  a  fear that a child is not going out enough?  <br/>\nJust on a different  level or to a different degree?  -=-<br/>\n <br/>\nNo.<br/>\nWhen a child learns to read, you both know it, because he&#39;s reading.<br/>\n <br/>\nIf a family decides when a child is 15 that it might&#39;ve been WAY  better for <br/>\nunschooling if they had done a lot more sooner, it will be too  late.  If the <br/>\nrelationship between the parents and children withers because  the parents <br/>\nweren&#39;t engaging enough and so the child doesn&#39;t have an easy  conversant <br/>\nrelationship, and they&#39;re out of the habit of being together and  learning together, <br/>\ntheir unschooling won&#39;t be the best it could be.<br/>\n <br/>\nIf people are wanting this list to put a stamp of approval on bare-minimal  <br/>\nunschooling, it&#39;s not going to come from me. I have zero interest in making  <br/>\npeople feel better about doing less, personally.<br/>\n <br/>\nIn any case in which the parents aren&#39;t worried and the children are happy,  <br/>\nnone of this conversation matters at all.<br/>\n <br/>\n-=-Can anyone ever have a personality that keeps unschooling from  <br/>\nworking well? -=-<br/>\n <br/>\nBigtime.<br/>\n <br/>\nParents who are negative and whiney and ashamed of curiosity and have  no <br/>\ninterest in learning are going to be crap at unschooling.   People  who are mean <br/>\nand violent and think children are to be seen and not heard, who  were abused <br/>\nas children and haven&#39;t even begun to deal with that emotionally  shouldn&#39;t <br/>\nunschool.  Their kids will probably be safer and better off in  school.<br/>\n <br/>\n-=- I&#39;ve seen how not allowing people to be who they are can <br/>\nreally  lead to some difficult emotional issues, so I really like that <br/>\nwith  unschooling we can just trust that no matter what the <br/>\npersonality, the child  is accepted as he is and allowed to be that.  <br/>\n-=-<br/>\n <br/>\nThat sounds good, and in ideal circumstances it&#39;s great.<br/>\n <br/>\nSome families don&#39;t have ideal circumstances, and unschooling won&#39;t work  for <br/>\nthem.<br/>\n <br/>\n-=-If we say that some kids should be pushed out of their personalities  <br/>\nbecause they aren&#39;t good personalities for unschooling, then it&#39;s not  <br/>\ntrue that we can trust children (and people in general) to learn what  <br/>\nthey need to learn.-=-<br/>\n <br/>\nI think all children can learn through unschooling, I don&#39;t think all  <br/>\nparents are suited to being unschooling parents.<br/>\n <br/>\nIt is possible that a child will already be so brainwashed by the age of  ten <br/>\nor twelve that he can&#39;t undo school.  If he would rather be in school  and is <br/>\nthoroughly convinced that school is the only place he can learn, then I  <br/>\nthink the parents should let him stay in school.  I think having a child  <br/>\nhomeschooled against his will is as bad as a kid being in school against his  will, <br/>\nwho wants out.<br/>\n <br/>\nAnd if a child wants out of school and the parents say, &quot;Yes, sure, we will  <br/>\ncommit to this,&quot; then I think the child should be willing to DO things in lieu <br/>\n of school and the parents, too, should be very active in that child&#39;s life, <br/>\nand  not just go home and shut the door and live a drab, negative life.<br/>\n <br/>\n-=-Then it would only be true that we can trust <br/>\nSOME people to learn  what they need to learn and the whole theory of <br/>\nunschooling has just been  shot down because we can no longer be sure <br/>\nthat we can trust our  kids. -=-<br/>\n <br/>\nYou have never read any long-years-experienced unschooler say that the  <br/>\nschools should be abolished and everyone should unschool. The thousands of hours  <br/>\nof writing that&#39;s been put in here, unschooling.com and various other places <br/>\nhas  stressed that it takes a LOT of change and awareness on the part of the <br/>\nparents  to do this.  And it takes deschooling on the part of the child and of <br/>\nthe  parents.  It&#39;s not easy.  It&#39;s not something just anyone can do.   And <br/>\nhalf-assed isn&#39;t good enough.  <br/>\n <br/>\nSandra<br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1352017,"authorName":"kayb85","from":"&quot;kayb85&quot; &lt;sheran@...&gt;","profile":"kayb85","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: YES, how unschooling works","postDate":"1110313738","msgId":104282,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQwbDF1YStvYmpjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGU1LmU5ZWFiOGQuMmY1ZjM5MzBAYW9sLmNvbT4="},"prevInTopic":104281,"nextInTopic":104289,"prevInTime":104281,"nextInTime":104283,"topicId":104221,"numMessagesInTopic":0,"msgSnippet":"... that ... limited and ... enough, then she ... bigger  life. Yep, but I think that it depends on what she s really feeling and why. Is she feeling what","messageBody":"<div id=\"ygrps-yiv-1415495629\"><blockquote><span title=\"ireply\">&gt; If she feels she&#39;s not doing enough, she should pay attention to <br/>\n </span></blockquote>that  <br/>\n<blockquote><span title=\"ireply\"> &gt; feeling.  <br/>\n&gt; If he&#39;s totally happy and enjoying his life but it&#39;s small and <br/>\n </span></blockquote>limited and  <br/>\n<blockquote><span title=\"ireply\"> &gt; could be bigger and better and she&#39;s feeling she&#39;s not doing <br/>\n </span></blockquote>enough, then she  <br/>\n<blockquote><span title=\"ireply\"> &gt; should do more because she will feel better and he will have a <br/>\n </span></blockquote>bigger  life.<br/>\n<br/>\nYep, but I think that it depends on what she&#39;s really feeling and why.<br/>\nIs she feeling what she&#39;s feeling because she&#39;s depressed?  Or is the <br/>\nchild depressed?  Or has she just been talking to a mainstream-push-<br/>\nyour-child-to-be-a-superchild mom who planted fear and worry in her <br/>\nhead?  Has she recently compared her child to a more outgoing child <br/>\nand started worrying?  Or is it honest to goodness maternal instinct <br/>\ntelling her that the child is in a stuck place and needs to be pushed <br/>\nout of it? <br/>\n<br/>\nIf it&#39;s the latter then I agree with everything you&#39;re saying.  I&#39;m <br/>\njust not convinced that it always (or usually!) is the latter.  I <br/>\nthink that a LOT of women in our society don&#39;t know how to really <br/>\nlisten to their own instincts because they&#39;ve been taught all their <br/>\nlives that they should do what is &quot;right&quot; according to mainstream <br/>\nsociety instead of what they sense in their hearts to be true.  So <br/>\nthey ignore that instinct until they don&#39;t even know how to use it <br/>\nanymore.  They &quot;feel&quot; their breastfed infant isn&#39;t getting enough so <br/>\nthey push formula and cereal onto him.  They &quot;feel&quot; their introvert <br/>\nisn&#39;t getting enough socially so they push that onto him. <br/>\n<br/>\nSo I think it&#39;s up to every woman to decide for herself what exactly <br/>\nshe&#39;s feeling and why.  If it&#39;s instinct, then definitely trust it <br/>\nand do what it&#39;s telling you.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If introversion leads to isolation and entropy,<br/>\n<br/>\n </span></blockquote>Entropy isn&#39;t good.  Isolation can be good, if it&#39;s what a person <br/>\nneeds. Or it can be bad if it&#39;s not what a person needs.  Some people <br/>\nmight create beautiful works of art or develop profound scientific <br/>\ntheories while in isolation and really thrive and become more in tune <br/>\nwith who they are.  Others might just go crazy or rot away in <br/>\nisolation.  Some might need isolation for just a period of time.  An <br/>\nhour or a day or a week or a month or a year.  Who really knows what <br/>\nthey need, other than the person himself, and maybe a mother who is <br/>\ntruly listening to her maternal instinct?  I&#39;m not saying that <br/>\nunschooling is about isolating our kids, but that if we&#39;re trusting <br/>\nour kids to know what they need, and they seem to be needing more <br/>\nisolation, then I say give them isolation.  <br/>\n<br/>\nIt all comes down to really getting to know our kids though, and <br/>\nreally learning to listen to our instincts (and knowing the <br/>\ndifference between instincts and fears) and trusting them.  We can&#39;t <br/>\nreally know if our kids are stuck, depressed and in a state of <br/>\nentropy or if they&#39;re simply thriving in their isolation if we don&#39;t <br/>\nknow the kids well.  <br/>\n<br/>\n and if what we&#39;re doing  does <br/>\n<blockquote><span title=\"ireply\"> &gt; have SOME expectation of helping a child gather the information he <br/>\n </span></blockquote>needs to  <br/>\n<blockquote><span title=\"ireply\"> &gt; have some equivalent to the education voters have decided (however <br/>\n </span></blockquote>indirectly) <br/>\n<blockquote><span title=\"ireply\"> &gt;  that people in their state should have by the time they&#39;re 18, <br/>\n </span></blockquote>then yes,  <br/>\n<blockquote><span title=\"ireply\"> &gt; introversion can be very bad.<br/>\n<br/>\n </span></blockquote>The people in their state don&#39;t know each child individually, so how <br/>\ncould they possibly know what each child needs to know by the time <br/>\nthey&#39;re 18?  Even the child might not know what he needs to know by <br/>\nthe time he&#39;s 18, but if he&#39;s trusted to be a whole person and to <br/>\nlisten to himself and know what he needs, then he will have <br/>\neverything that he needs by the time he&#39;s 18.  Even if that&#39;s <br/>\ndifferent than what &quot;the people in their state&quot; say he needs to <br/>\nknow.  <br/>\n<br/>\nThere are people in a lot of states that say a child should know how <br/>\nto read by the time he&#39;s 6 or 7 or at the latest 8.  Yet lots of <br/>\nunschooled kids learn to read later than that.  Lots of would-be-<br/>\nunschoolers lose their nerve to unschool when their 8 or 9 year old <br/>\nstill isn&#39;t reading and they listen to the fear in their heads that <br/>\ntells them that their child needs something more and they make them <br/>\nsit down for reading lessons.  Isn&#39;t that fear of a child not knowing <br/>\nhow to read similar to a  fear that a child is not going out enough?  <br/>\nJust on a different level or to a different degree?  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Yes, unless his personality is going to keep unschooling from <br/>\n </span></blockquote>working well  <br/>\n<blockquote><span title=\"ireply\"> &gt; enough to be an honest, legitimate alternative to school. <br/>\n<br/>\n </span></blockquote>Can anyone ever have a personality that keeps unschooling from <br/>\nworking well?  One of the things that I really like about unschooling <br/>\nis that it allows people to be whoever they are, and it allows that <br/>\nto shine.  I&#39;ve seen how not allowing people to be who they are can <br/>\nreally lead to some difficult emotional issues, so I really like that <br/>\nwith unschooling we can just trust that no matter what the <br/>\npersonality, the child is accepted as he is and allowed to be that.  <br/>\n<br/>\nIf we say that some kids should be pushed out of their personalities <br/>\nbecause they aren&#39;t good personalities for unschooling, then it&#39;s not <br/>\ntrue that we can trust children (and people in general) to learn what <br/>\nthey need to learn.  Then it would only be true that we can trust <br/>\nSOME people to learn what they need to learn and the whole theory of <br/>\nunschooling has just been shot down because we can no longer be sure <br/>\nthat we can trust our kids.  <br/>\n<br/>\n And one of the  <br/>\n<blockquote><span title=\"ireply\"> &gt; questions asked  seemed to lean toward what if the parents and  <br/>\n </span></blockquote>children are all <br/>\n<blockquote><span title=\"ireply\"> &gt; introverts and are happy being home and not talking about  it?<br/>\n<br/>\n </span></blockquote>I guess my answer would depend on knowing WHY they&#39;re not talking <br/>\nabout it.  Because if they&#39;re not talking about it because they&#39;re <br/>\nafraid or insecure or hiding some kind of emotional pain, then <br/>\nthey&#39;re not really happy.  But if they are really happy and whole, <br/>\nthen a family of introverts who are really happy and whole being home <br/>\nseems like a perfectly okay thing to me.  <br/>\n<br/>\nSheila</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: YES, how unschooling works","postDate":"1110313281","msgId":104281,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJFNTM3MzcwLjMxQzIwJWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDQyMkRFQ0UyLjkwNDAzMDBAZWFydGhsaW5rLm5ldD4="},"prevInTopic":104278,"nextInTopic":104282,"prevInTime":104280,"nextInTime":104282,"topicId":104221,"numMessagesInTopic":0,"msgSnippet":"... Why did you want him to go to the museum? Did you think there was a decent chance that he d have fun? Has he had fun on previous outings with those","messageBody":"<div id=\"ygrps-yiv-1492812599\">on 3/8/05 1:20 PM, Elizabeth Hill at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ecsamhill@...\">ecsamhill@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I made my child go to an art museum in January, because our group of friends<br/>\n&gt; was going.<br/>\n<br/>\n </span></blockquote>Why did you want him to go to the museum?<br/>\n<br/>\nDid you think there was a decent chance that he&#39;d have fun?<br/>\n<br/>\nHas he had fun on previous outings with those friends? And did he say he was<br/>\nglad you made him go when (if) he had fun or would he still have rather<br/>\nstayed home?<br/>\n<br/>\nDid the museum feel like something you &quot;should&quot; do? (For social reasons or<br/>\nbecause he should be out in the world more or because he needs exposure to<br/>\nmore than his narrow range of interests?)<br/>\n<br/>\nAs Sheila (I think) pointed out, we only get the benefit of the doubt on so<br/>\nmany &quot;You&#39;re going to have to trust me on this one. I really do think you&#39;ll<br/>\nlike it&quot;s. The more often we guess wrong, the less they trust us. And once<br/>\nwe lose their trust we need to be 100% on the mark with our guesses for<br/>\nquite a long while in order to regain it!<br/>\n<br/>\nI think I too often approach things with a &quot;We should do this because we&#39;ll<br/>\nhave fun&quot; type of attitude. And that&#39;s no way to sell something! (Maybe it<br/>\nis an engineer thing! ;-)<br/>\n<br/>\nMy husband on the other hand is sharing his interests with Kathryn. They&#39;re<br/>\ndoing things that he loves and his love is infecting her. (But it wouldn&#39;t<br/>\nwork if she didn&#39;t have an innate interest.)<br/>\n<br/>\nSo I&#39;m learning to approach things in a more inviting her to come with me<br/>\nbecause &quot;I know I&#39;m going to have fun with this&quot; attitude, rather than this<br/>\nis something you should enjoy because I like it attitude, if that makes<br/>\nsense.<br/>\n<br/>\nYou don&#39;t have to be out in the world in order to introduce him to stuff.<br/>\nThough, at least with Kathryn it&#39;s difficult to strew things around the<br/>\nhouse. It&#39;s rare that she&#39;ll pick something up that&#39;s laying around because<br/>\nher attention isn&#39;t focused on her environment. It&#39;s focused on me and what<br/>\nwe can do next.<br/>\n<br/>\nBut bringing other kids in can make what seemed like a piece of clutter<br/>\nsitting about into something interesting :-) You haven&#39;t mentioned much<br/>\nabout having kids over. Is that something he doesn&#39;t like?<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":1352017,"authorName":"kayb85","from":"&quot;kayb85&quot; &lt;sheran@...&gt;","profile":"kayb85","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: YES, how unschooling works","postDate":"1110307425","msgId":104290,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQwa3JwMSt0Zjg3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEwZWMwNWQ5YmFhNzRhNDIxMjk5ODA1MTQzMzNkNjczQGVhcnRobGluay5uZXQ+"},"prevInTopic":104289,"nextInTopic":104296,"prevInTime":104289,"nextInTime":104291,"topicId":104221,"numMessagesInTopic":0,"msgSnippet":"... that ... I was focusing on the going out aspects of it because I thought others who responded to Betsy were focusing on the going out aspects of it. I","messageBody":"<div id=\"ygrps-yiv-1459876707\"><blockquote><span title=\"ireply\">&gt; Sheila - you&#39;re focusing on the &quot;going out&quot; aspects of this - but <br/>\n </span></blockquote>that <br/>\n<blockquote><span title=\"ireply\"> &gt; isn&#39;t the critical point.<br/>\n<br/>\n </span></blockquote>I was focusing on the going out aspects of it because I thought <br/>\nothers who responded to Betsy were focusing on the going out aspects <br/>\nof it. I thought Betsy was concerned about her son and that she was <br/>\ngetting a lot of &quot;go out&quot; advice.  I was just saying that &quot;go out&quot; <br/>\nmight not be what he wants or needs&quot; and maybe she could focus on <br/>\nthe &quot;bring in&quot;.  <br/>\n<br/>\nOf course, none of us really knows for sure because we don&#39;t know <br/>\nBetsy&#39;s son.  I think when it comes right down to it Betsy listening <br/>\nto her instincts but making sure what she&#39;s listening to instincts <br/>\nand not society-induced fears and worries.  <br/>\n<br/>\n Both you and Betsy have sounded like  you <br/>\n<blockquote><span title=\"ireply\"> &gt; WANT your kids to want to go out more or something.<br/>\n<br/>\n </span></blockquote>I&#39;m not like that normally.  I&#39;ve just had occasional panic <br/>\nattacks.;) <br/>\n<br/>\n So - we can give <br/>\n<blockquote><span title=\"ireply\"> &gt; you suggestions of how to make that more likely - but the point of <br/>\n&gt; having a rich and stimulating lifestyle isn&#39;t dependent on <br/>\n </span></blockquote>being &quot;on <br/>\n<blockquote><span title=\"ireply\"> &gt; the go&quot; all the time - but it IS dependent on the parents bringing <br/>\n </span></blockquote>all <br/>\n<blockquote><span title=\"ireply\"> &gt; KINDS of information and ideas and facts and questions and <br/>\n </span></blockquote>experiences <br/>\n<blockquote><span title=\"ireply\"> &gt; and wonderings and interesting aspects of the world TO their kids <br/>\n </span></blockquote>in <br/>\n<blockquote><span title=\"ireply\"> &gt; all kinds of ways.<br/>\n<br/>\n </span></blockquote>I agree completely. <br/>\n<br/>\nSheila</div>","specialLinks":[]},{"userId":2300774,"authorName":"Elizabeth Hill","from":"Elizabeth Hill &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: YES, how unschooling works","postDate":"1110306018","msgId":104278,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyMkRFQ0UyLjkwNDAzMDBAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PGU1LmU5ZWFiOGQuMmY1ZjM5MzBAYW9sLmNvbT4=","referencesHeader":"PGU1LmU5ZWFiOGQuMmY1ZjM5MzBAYW9sLmNvbT4="},"prevInTopic":104273,"nextInTopic":104281,"prevInTime":104277,"nextInTime":104279,"topicId":104221,"numMessagesInTopic":0,"msgSnippet":"** If someone can t unschool, then they should get a curriculum or put their kids in school.  The laws of most place require that the kids have an  education ","messageBody":"<div id=\"ygrps-yiv-126605997\">**<br/>\n<br/>\nIf someone can&#39;t unschool, then they should get a curriculum or put their  <br/>\nkids in school.  The laws of most place require that the kids have an  education <br/>\nequivalent to the state&#39;s curriculum.  It IS possible to get that  knowledge <br/>\nall aswirl around a child so that he picks it up.  That is what  unschooling <br/>\ndepends on.  A family that can&#39;t or won&#39;t stir up enough  exposure to all the <br/>\nsubject areas schools are claiming to cover (whether they&#39;re  doing it or not <br/>\ndoesn&#39;t matter here), then they&#39;re not really unschooling,  they&#39;re just hiding <br/>\nout until the compulsory attendance days are over.**<br/>\n<br/>\n(In California, I don&#39;t have to prove that I covered the curriculum, and I certainly don&#39;t have to do the silly part of covering specific topics in specific years.)<br/>\n<br/>\nI really thought that unschooling meant letting go of the curriculum as checklist.  I thought unschooling depended on the idea that the things that are important to know in life come up in life, and that if trigonometry doesn&#39;t come up, then it might not (gasp!) be necessary.  And that if it is necessary, later in life, it can be learned then.<br/>\n<br/>\nIn all the discussions we&#39;ve had about not demonizing television, I never thought that moms who were worried about television were &quot;allowed&quot; (within the framework of the unschooling philosophy), to say &quot;turn off the TV, we&#39;re going to the festival, whether you want to or not&quot;.  (Assuming the child has been more graciously offered the opportunity and has declined it.)<br/>\n<br/>\nI made my child go to an art museum in January, because our group of friends was going.  I really thought I was committing an unschooling sin, when I did so, and really thought I would be a target for criticism if I mentioned it on this list.  He didn&#39;t show much interest in the exhibits, but at least he had his equally bored friends for company (a couple of the kids were interested), and we weren&#39;t in the museum for much more than an hour.  He liked playing in the sculpture garden and exploring the museum gift shop afterwards.<br/>\n<br/>\nBetsy</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: YES, how unschooling works","postDate":"1110302512","msgId":104265,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU1LmU5ZWFiOGQuMmY1ZjM5MzBAYW9sLmNvbT4="},"prevInTopic":104257,"nextInTopic":104272,"prevInTime":104264,"nextInTime":104266,"topicId":104221,"numMessagesInTopic":0,"msgSnippet":"In a message dated 3/7/2005 10:41:35 PM Mountain Standard Time, sheran@ptd.net writes: If he s  happy and enjoying his life, then is the do nothing too strong?","messageBody":"<div id=\"ygrps-yiv-900177792\">In a message dated 3/7/2005 10:41:35 PM Mountain Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sheran@...\">sheran@...</a> writes:<br/>\n<br/>\nIf he&#39;s  happy and enjoying his life, <br/>\nthen is the do nothing too strong?   <br/>\n<br/>\n<br/>\n<br/>\n<br/>\nIf she feels she&#39;s not doing enough, she should pay attention to that  <br/>\nfeeling.  <br/>\nIf he&#39;s totally happy and enjoying his life but it&#39;s small and limited and  <br/>\ncould be bigger and better and she&#39;s feeling she&#39;s not doing enough, then she  <br/>\nshould do more because she will feel better and he will have a bigger  life.<br/>\n <br/>\n-=-Is being an extrovert better than being an introvert? (I don&#39;t think  <br/>\nso).-=-<br/>\n <br/>\nIf introversion leads to isolation and entropy, and if what we&#39;re doing  does <br/>\nhave SOME expectation of helping a child gather the information he needs to  <br/>\nhave some equivalent to the education voters have decided (however indirectly) <br/>\n that people in their state should have by the time they&#39;re 18, then yes,  <br/>\nintroversion can be very bad.<br/>\n <br/>\nIf someone can&#39;t unschool, then they should get a curriculum or put their  <br/>\nkids in school.  The laws of most place require that the kids have an  education <br/>\nequivalent to the state&#39;s curriculum.  It IS possible to get that  knowledge <br/>\nall aswirl around a child so that he picks it up.  That is what  unschooling <br/>\ndepends on.  A family that can&#39;t or won&#39;t stir up enough  exposure to all the <br/>\nsubject areas schools are claiming to cover (whether they&#39;re  doing it or not <br/>\ndoesn&#39;t matter here), then they&#39;re not really unschooling,  they&#39;re just hiding <br/>\nout until the compulsory attendance days are over.<br/>\n <br/>\n-=-What if the introvert is at the extreme end of introvertedness <br/>\nand  rarely wants to go anywhere?  Not because they don&#39;t have <br/>\nsomewhere  willing to take them but just because that&#39;s how their <br/>\npersonality is  wired?  <br/>\n-=-<br/>\n <br/>\nSchool&#39;s not great for introverts, though some are good at being invisible  <br/>\nand bypassing most of the social interactions.  But if a family chooses an  <br/>\nalternate method, they shouldn&#39;t then also reject the alternate method, which  <br/>\nseems to me to require exposure to the world one way or another.<br/>\n <br/>\n-=-At what point does our coaxing turn into trying to get them to be  <br/>\nsomeone who they aren&#39;t?  If we trust them to know when they&#39;re ready  <br/>\nto read--all the time, why not trust them to know when they&#39;re ready <br/>\nto  leave the house--all the time?  If we wouldn&#39;t say, &quot;Oh, please <br/>\njust 15  minutes of spelling&quot;, why would we say, &quot;Oh, please just 15 <br/>\nminutes at a  festival?&quot;  -=-<br/>\n <br/>\nI know from La Leche League that some kids are willing to walk away from  <br/>\ntheir moms as soon as they can walk and some want mom&#39;s lap for four  years.  <br/>\nThat&#39;s fine.  I don&#39;t advocate moms putting their kids out and  away from them <br/>\nbefore the kid&#39;s ready at all.  I don&#39;t recommend helping  the child get along <br/>\nwithout mom.   But this isn&#39;t that.  It&#39;s the  child still being WITH mom, and <br/>\nthe mom being with the child, maybe just across  the street instead of kid in <br/>\nbedroom, mom in kitchen.<br/>\n <br/>\nI think the examples given are NOT child not wanting to go out, they might  <br/>\nbe child not wanting to go out with mom, so the analogy might not hold.<br/>\n <br/>\n-=-The festival I wanted to take my kids to had ice sculptures <br/>\nand I  thought that would have been cool for them to see.  But it&#39;s <br/>\nnot like  they&#39;ve never seen ice sculptures before-=-<br/>\n <br/>\nI&#39;m thrilled that we got to see the parade and ice sculputures in St. Paul  <br/>\none year.  New Mexico has an occasional swan at the Marriott&#39;s buffet, but  <br/>\nthat&#39;s about it. &lt;g&gt;<br/>\n <br/>\n-=-Is doing something so that someone else approves a good reason to do  <br/>\nanything?  -=-<br/>\n <br/>\nSometimes, yes, unless one wants to live as a hermit.  Even then, the  <br/>\nlandowner or government might have to approve them staying in that cave or  shack, <br/>\nso they need to  consider others to some extent.<br/>\n <br/>\n-=-If I told my kids to put their shoes on and get a jacket and let&#39;s go  <br/>\nhave fun at something they clearly didn&#39;t want to go to, they very <br/>\nwell  might refuse to get in the car.  My 11 year old might go, but <br/>\nshe&#39;d be  upset with me and she&#39;d be miserable and it would affect our <br/>\nrelationship  negatively.   -=-<br/>\n <br/>\nThen maybe the relationship is already affected negatively and the lack of  <br/>\nwillingness to go out is a symptom of that.  If it&#39;s not so at your house,  it <br/>\nmight be at others&#39;, and we should be discussing the ideas and how they  <br/>\naffect or fit in with unschooling.<br/>\n <br/>\n-=-I think that if a child isn&#39;t going out because he&#39;s not allowed to  <br/>\nor doesn&#39;t have the chance to, that&#39;s bad.  If a child isn&#39;t going  <br/>\nout because he&#39;s afraid of the world and no one has ever gently tried <br/>\nto  give him opportunities to do stuff outside of the house, that&#39;s <br/>\nbad.   But if that&#39;s just his personality, then it&#39;s good when it&#39;s <br/>\nhonored and no  one&#39;s trying to change it.  -=-<br/>\n <br/>\nYes, unless his personality is going to keep unschooling from working well  <br/>\nenough to be an honest, legitimate alternative to school.  And one of the  <br/>\nquestions asked  seemed to lean toward what if the parents and  children are all <br/>\nintroverts and are happy being home and not talking about  it?<br/>\n <br/>\n-=-What if the home is a hive of activity but people only come in and  <br/>\nout once in a while, and the child is still happy and thriving?   <br/>\n-=-<br/>\n <br/>\nThen that example doesn&#39;t apply at all to the questions of what if children  <br/>\nhave few interests and mom has even fewer.<br/>\n <br/>\nSandra<br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":165350390,"authorName":"Aimee","from":"Aimee &lt;aimeel73@...&gt;","profile":"aimeel73","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] YES, how unschooling works","postDate":"1110294390","msgId":104272,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUwMzA4MTUwNjMwLjIxMTUyLnFtYWlsQHdlYjgxNDA3Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDQyMkQyQTJGLjkwNTA5MDJAc2JjZ2xvYmFsLm5ldD4="},"prevInTopic":104265,"nextInTopic":104273,"prevInTime":104271,"nextInTime":104273,"topicId":104221,"numMessagesInTopic":0,"msgSnippet":"Hey ya ll, haven t been on list for ages...did ya MISS ME? lol ","messageBody":"<div id=\"ygrps-yiv-183130280\">Hey ya&#39;ll, haven&#39;t been on list for ages...did ya MISS<br/>\nME? lol <br/>\n<br/>\n&lt;&lt; Its easier to do &quot;schoolish&quot; shit for an hour and<br/>\nmark it done in my brain <br/>\nand go on to do what we want. &gt;&gt;<br/>\n<br/>\nI understand that when it comes to dishes, for<br/>\nexample, or taking out the garbage, lol, but for<br/>\nlearning?  Learning is more complex than that, and the<br/>\nsimple fact is, he won&#39;t learn much, if anything, if<br/>\nyou do schoolish stuff for an hour, there&#39;s no<br/>\ncontext, no richness, no real, lasting connections<br/>\nmade in his brain.  <br/>\n<br/>\nAsk your dh, is that what he wants? <br/>\n<br/>\nDoes he *really* want learning to be flat and lifeless<br/>\nand a chore?  <br/>\n<br/>\nAnd really, it&#39;s not easier.  I know it SEEMS easier,<br/>\nbut it&#39;s really not in the long run, it&#39;s ten times<br/>\nharder to wake up a kid to real learning after he&#39;s<br/>\nbeen bored stiff by schooly crap. :-) <br/>\n<br/>\n&lt;&lt;More then that, its easier to mark that <br/>\nstuff down and quiet that voice that says we not even<br/>\nvery good unschoolers because we just maybe the kind<br/>\nwho really don&#39;t have tons of cool conversations, or<br/>\ngo to the museums, or on trips, or spend money on <br/>\nstuff in the hopes that ds will not look at it and say<br/>\n&quot;that looks stupid, or boring or sucky&quot;.....&gt;&gt;<br/>\n<br/>\nI used to think we weren&#39;t that kind of unschooler,<br/>\ntoo.  We are homebodies, we don&#39;t have a lot of money<br/>\nfor activities or fieldtrips. But we do what we like,<br/>\nand we learn despite all that. Really. :-)<br/>\n<br/>\nOpen up your mind.  Try to let go of your preconceived<br/>\nnotions of what learning is and is not.  Pay attention<br/>\nto the processes that your son is going thru RIGHT<br/>\nNOW, TODAY.  Write about it tonite, see what ya see. <br/>\n<br/>\nAnd try not to minimize what he did do as just<br/>\n*whatever*.  See your son as a multi faceted person<br/>\nwho is spending his time learning about himself, at<br/>\nthe very least, whatever he happens to be doing.  <br/>\n<br/>\n&lt;&lt;It also could be this time of year when I always go<br/>\na bit crazy, plus I <br/>\njust got bifocals and they are making me quite annoyed<br/>\nabout everything.&gt;&gt;<br/>\n<br/>\n I can&#39;t imagine training my eyes to look thru the<br/>\ndifferent lenses, just thinking about it&#39;s giving me a<br/>\nheadache! lol Give yourself a break right now, then,<br/>\ndon&#39;t make decisions when you&#39;re annoyed.  I find if I<br/>\ndo that I have to go and undo them all, anyway, and<br/>\nthat&#39;s too much work! lol <br/>\n<br/>\n~Aimee<br/>\n<br/>\n<br/>\n=====<br/>\nIn times of change, learners inherit the Earth, while the learned find<br/>\nthemselves beautifully equipped to deal with a world that no longer exists.<br/>\n<br/>\n- Eric Hoffer</div>","specialLinks":[]},{"userId":177721839,"authorName":"Angela S","from":"&quot;Angela S&quot; &lt;game-enthusiast@...&gt;","profile":"autonomousangela","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [UnschoolingDiscussion] Re: YES, how unschooling works","postDate":"1110286866","msgId":104257,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUwMzA4MTMwMDU5LlpSQkg3Mjc3Lm10YTEwLmFkZWxwaGlhLm5ldEBsZWlnaD4=","inReplyToHeader":"PGQwamRlNCtvaHBxQGVHcm91cHMuY29tPg=="},"prevInTopic":104254,"nextInTopic":104265,"prevInTime":104256,"nextInTime":104258,"topicId":104221,"numMessagesInTopic":0,"msgSnippet":"From the time we started to homeschool (unschool) until the last year or two, I made sure I offered my children a variety of places to go, people to see and","messageBody":"<div id=\"ygrps-yiv-991143725\">From the time we started to homeschool (unschool) until the last year or<br/>\ntwo, I made sure I offered my children a variety of places to go, people to<br/>\nsee and meet, and things to do.  We went to the theater several times a<br/>\nyear, we joined a homeschooling group, we went to park days, we went to<br/>\ndifferent field trips with homeschool groups, we went bowling, and skating,<br/>\nand sliding, and skiing, we joined an art class, went to the animal rescue<br/>\nzoo, the museum, I offered a variety of classes (that were always turned<br/>\ndown), like dance, karate, baseball, etc.  We only went to things when they<br/>\nwould agree to go. That was working well for us at the time because my kids<br/>\ndidn&#39;t seem to have a passion for anything yet.  <br/>\n<br/>\n <br/>\n<br/>\nI knew other kids who had passions long before my kids.  Some were into<br/>\nkarate, some dance, and they really loved it.  My kids liked going to these<br/>\ndifferent things, but they hadn&#39;t found anything that really made them<br/>\ndrool.  :-)  That was until we went with a homeschool group on a riding<br/>\nstable tour.  :-)  I asked them if they&#39;d be interested in riding lessons<br/>\n(of course that was the most expensive thing I&#39;d ever offered.) and my<br/>\nyoungest said she was interested.  I didn&#39;t call right off.  Over the next<br/>\ncouple of weeks she kept reminding me to call.  (I was a little hesitant to<br/>\ncall, that&#39;s just me, not knowing if you had to be able to afford to go<br/>\nweekly, or whatever)  Her reminders let me know she was serious about it.  I<br/>\nfinally called and set up the first lesson.  (The instructor assured me it<br/>\nwas fine to come every other week)  The following week my older dd decided<br/>\nshe wanted to try it too.  (She likes to know exactly what to expect when<br/>\nshe goes somewhere, hence allowing her sister to try it first.)  <br/>\n<br/>\n <br/>\n<br/>\nThose first lessons were the beginning of a serious obsession with horses.<br/>\nNow, my kids are interested in leaving the house every day, but only to go<br/>\nto the barn up the road where we board our horse.  (I would never have<br/>\ndreamed after that trip to the barn with the homeschool group that we&#39;d have<br/>\nour own horse in two years!)  They will go to the grocery store out of<br/>\nnecessity.  (when we run out of carrots for the horse) and they do love the<br/>\ntack store or anything horse related (we went on a sleigh ride recently).<br/>\nBut pretty much, since last fall, those are the only places we&#39;ve been.<br/>\n(Well, except to friends and relative&#39;s houses for visits) We are all three<br/>\nreally happy with this for right now.  Their exposure to things other than<br/>\nhorses has been curbed tremendously.  Their interest in going other places<br/>\nhas come to an end.  But I am not worried that they are no longer exposed to<br/>\na wide variety of things because they have found their passion for right<br/>\nnow.  <br/>\n<br/>\n <br/>\n<br/>\nWhen we aren&#39;t at the barn, we have a houseful of great things to do and<br/>\nthey are happy to be at home when they are at home.  We all love board games<br/>\nand my kids still love pretend play.  (about horses of course)  We read<br/>\nabout horses, both fiction and non-fiction.  We watch horse training shows<br/>\nand events on TV.  They are happy and fulfilled and we&#39;ll continue on this<br/>\npath until they are no longer happy and fulfilled.  <br/>\n<br/>\n <br/>\n<br/>\nIf I were trying to get them out of the house to go to different events (so<br/>\nthey&#39;d look well rounded for their portfolio review) I am sure I&#39;d be met<br/>\nwith some serious resistance.  This year has not been a year that was filled<br/>\nwith a variety of social or educational trips.  From the outside I am sure<br/>\nwe all look like a bunch of hermits who don&#39;t go anywhere, but I don&#39;t care.<br/>\nWe are all happy and content with the way things are.  We aren&#39;t overly<br/>\nsocial by nature anyway and we&#39;ve all discovered we have a passion for<br/>\nhorses.  <br/>\n<br/>\n <br/>\n<br/>\nI don&#39;t think that I am being neglectful as an unschooler this year because<br/>\nI haven&#39;t offered to take them to a wide variety of places.  I know what<br/>\ntheir answer would be.  They&#39;d rather go to the barn and ride, and groom,<br/>\nand clean stalls.  I think they are lucky to be able to follow their passion<br/>\nfor right now.<br/>\n<br/>\n <br/>\n<br/>\nAngela<br/>\n<br/>\n*\t<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:game-enthusiast@...\">game-enthusiast@...</a>. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: YES, how unschooling works","postDate":"1110272911","msgId":104254,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEwZWMwNWQ5YmFhNzRhNDIxMjk5ODA1MTQzMzNkNjczQGVhcnRobGluay5uZXQ+","inReplyToHeader":"PGQwamRlNCtvaHBxQGVHcm91cHMuY29tPg==","referencesHeader":"PGQwamRlNCtvaHBxQGVHcm91cHMuY29tPg=="},"prevInTopic":104252,"nextInTopic":104257,"prevInTime":104253,"nextInTime":104255,"topicId":104221,"numMessagesInTopic":0,"msgSnippet":"... I honestly do not think this question is about being extroverted versus introverted. I know a couple of extremely introverted unschoolers - their lives","messageBody":"<div id=\"ygrps-yiv-1154864496\">On Mar 7, 2005, at 9:32 PM, kayb85 wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Is being an extrovert better than being an introvert?<br/>\n<br/>\n </span></blockquote>I honestly do not think this question is about being extroverted versus <br/>\nintroverted. I know a couple of extremely introverted unschoolers - <br/>\ntheir lives aren&#39;t as filled with other people, especially groups, but <br/>\nthey&#39;re filled with all kinds of interesting activities and experiences <br/>\n- they just tend to be filled with fewer &quot;interpersonal&quot; activities and <br/>\nexperiences.<br/>\n<br/>\nSheila - you&#39;re focusing on the &quot;going out&quot; aspects of this - but that <br/>\nisn&#39;t the critical point. Both you and Betsy have sounded like  you <br/>\nWANT your kids to want to go out more or something. So - we can give <br/>\nyou suggestions of how to make that more likely - but the point of <br/>\nhaving a rich and stimulating lifestyle isn&#39;t dependent on being &quot;on <br/>\nthe go&quot; all the time - but it IS dependent on the parents bringing all <br/>\nKINDS of information and ideas and facts and questions and experiences <br/>\nand wonderings and interesting aspects of the world TO their kids in <br/>\nall kinds of ways.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] YES, how unschooling works","postDate":"1110272410","msgId":104252,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA1MTQyYmYyNTdlNTYzMmFhZjA4MWMyMDVmMThlM2FhQGVhcnRobGluay5uZXQ+","inReplyToHeader":"PDQyMkQyQzQ2LjYwNzA4MDdAc2JjZ2xvYmFsLm5ldD4=","referencesHeader":"PDFmYi40OGYwMDFiLjJmNWRkOWViQGFvbC5jb20+IDw0MjJDQkQ3MS4zMDUwMjA4QHNiY2dsb2JhbC5uZXQ+IDw4ZWY0ZjI4MTMxMGRjMjNhMzVlMDliOGM0NjQ4MTFkM0BlYXJ0aGxpbmsubmV0PiA8NDIyRDJDNDYuNjA3MDgwN0BzYmNnbG9iYWwubmV0Pg=="},"prevInTopic":104249,"nextInTopic":104254,"prevInTime":104251,"nextInTime":104253,"topicId":104221,"numMessagesInTopic":0,"msgSnippet":"... Yes - I get the not wanting to feel like a fraud. When my kids were young, I didn t know where we d end up - I couldn t guarantee (even to myself) that","messageBody":"<div id=\"ygrps-yiv-1802133165\">On Mar 7, 2005, at 8:38 PM, julie w wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Wonder why I care, I normally could give a flying fig what other folks<br/>\n&gt; think....I  probably care in a detached kinda way that hinges more on<br/>\n&gt; feeling like a fraud but really wanting to keep the peace at home.<br/>\n<br/>\n </span></blockquote>Yes - I get the not wanting to feel like a fraud. When my kids were <br/>\nyoung, I didn&#39;t know where we&#39;d end up - I couldn&#39;t guarantee (even to <br/>\nmyself) that we&#39;d never end up using a curriculum, for example. I <br/>\ndidn&#39;t EXPECT to do that, but I had to be honest with myself and admit <br/>\nthat when my oldest started school, I never EXPECTED to end up <br/>\nhomeschooling, either. So - I couldn&#39;t completely rule out the <br/>\npossibility that there might be a time when we wouldn&#39;t entirely <br/>\nunschool. And I didn&#39;t want to have laid some sort of strong claim to <br/>\nbe an &quot;unschooler&quot; and then either feel like a fraud or feel I had to <br/>\nexplain a change of mind, if one happened, later. So - I hedged.<br/>\n<br/>\nBut no more.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":212111356,"authorName":"Laurel Santiago","from":"Laurel Santiago &lt;llsantiago1976@...&gt;","profile":"llsantiago1976","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] YES, how unschooling works","postDate":"1110265899","msgId":104273,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUwMzA4MDcxMTM5LjcyNTIxLnFtYWlsQHdlYjU0MTA0Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDhlZjRmMjgxMzEwZGMyM2EzNWUwOWI4YzQ2NDgxMWQzQGVhcnRobGluay5uZXQ+"},"prevInTopic":104272,"nextInTopic":104278,"prevInTime":104272,"nextInTime":104274,"topicId":104221,"numMessagesInTopic":0,"msgSnippet":"My husband is a little bit like that himself, but he came from very poor circumstances.  Education was not a priority in his family, and he has suffered","messageBody":"<div id=\"ygrps-yiv-1806963374\">My husband is a little bit like that himself, but he came from very poor circumstances.  Education was not a priority in his family, and he has suffered greatly because of the lack of effort and caring on the part of his family.  I think that he is afraid of being the same way with our family, but our children prove every day that their education is not being neglected, and I have often overheard him defending our position to busybodies even after he tells me that we are not doing enough.  I keep a box of every paper that they bring from church, scouting, artwork that they do on their own, and any coloring or workbook pages that the children complete.  This way he can have his paperwork, and the kids still have their time to explore.<br/>\n<br/>\nPam Sorooshian &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pamsoroosh@...\">pamsoroosh@...</a>&gt; wrote:Stop worrying about whether or not what you do is CALLED unschooling. <br/>\nThat&#39;s not the real question you need to be asking yourself.<br/>\n<br/>\nI really mean that. I don&#39;t care if what we do is called unschooling.<br/>\n<br/>\nI care to talk about unschooling - what it means, what it is based on, <br/>\nwhat unschooling parents do, and so on --- but if somebody else looks <br/>\nat my kids and says, &quot;That&#39;s not unschooling,&quot; so what? If I listed my <br/>\n100 goals of life - other people calling what we do &quot;unschooling&quot; would <br/>\nnot be on my list.<br/>\n<br/>\nIf you have to do an hour of something that works for your husband in <br/>\norder to have freedom the rest of the time - then so be it. If it buys <br/>\nyou a relaxed happy household - it might be worth it. On the other <br/>\nhand, if you can educate him to understanding what unschooling is all <br/>\nabout - then so much the better. And, if you put your mind to it, I bet <br/>\nyou can come up with things to do that satisfy him and aren&#39;t as <br/>\nschooly as, say, doing workbooks or reading textbooks/writing essays, <br/>\netc. It doesn&#39;t have to be all or nothing - you can use what YOU know <br/>\nabout learning in all kinds of ways to come up with enough to satisfy <br/>\nhim and still not really be &quot;doing school&quot; at home.<br/>\n<br/>\nBut, if you&#39;re asking if &quot;doing school&quot; an hour a day is still <br/>\nunschooling. Well, no. The answer is easy and clear. But so what? Is <br/>\nbeing called an unschooler what is important? No. It is how your family <br/>\nlives its life that is important and only you really know what will be <br/>\nthe best choice. Harmony in your family can be worth a lot. On the <br/>\nother hand, maybe your husband can be re-educated. Many of us had <br/>\nrecalcitrant spouses who either came around or gave in &lt;g&gt;.<br/>\n<br/>\nIn order to avoid any judgment by others about whether or not we were <br/>\n&quot;unschoolers&quot; - I called us &quot;unschoolish&quot; for years, as in, &quot;We&#39;re <br/>\npretty unschoolish.&quot; Hedged my bets &lt;G&gt;. Now I don&#39;t care anymore what <br/>\nother people call us.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Mar 7, 2005, at 12:45 PM, julie w wrote:<br/>\n<br/>\n&gt; How do you balance it all out and still call it unschooling?<br/>\n&gt; Hmmm, I must be having a bad day and I&#39;m getting tired of this internal<br/>\n&gt; struggle I&#39;m having over what and what is not unschooling.<br/>\n&gt; Julie W<br/>\n<br/>\n<br/>\n<br/>\n&quot;List Posting Policies&quot; are provided in the files area of this group. <br/>\n<br/>\nVisit the Unschooling website and message boards: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> <br/>\n<br/>\n<br/>\nYahoo! Groups SponsorADVERTISEMENT<br/>\n<br/>\n<br/>\n---------------------------------<br/>\nYahoo! Groups Links<br/>\n<br/>\n   To visit your group on the web, go to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/UnschoolingDiscussion/\">http://groups.yahoo.com/group/UnschoolingDiscussion/</a><br/>\n  <br/>\n   To unsubscribe from this group, send an email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a><br/>\n  <br/>\n   Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n\t\t<br/>\n---------------------------------<br/>\nCelebrate Yahoo!&#39;s 10th Birthday! <br/>\n Yahoo! Netrospective: 100 Moments of the Web <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":1352017,"authorName":"kayb85","from":"&quot;kayb85&quot; &lt;sheran@...&gt;","profile":"kayb85","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: YES, how unschooling works","postDate":"1110259972","msgId":104249,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQwamRlNCtvaHBxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDFmYi40OGYwMDFiLjJmNWRkOWViQGFvbC5jb20+"},"prevInTopic":104248,"nextInTopic":104252,"prevInTime":104248,"nextInTime":104250,"topicId":104221,"numMessagesInTopic":0,"msgSnippet":"... having to ... name of ... I think the do nothing can be too strong too.  But I haven t seen people who do nothing too strongly unless they re depressed","messageBody":"<div id=\"ygrps-yiv-795538349\"><blockquote><span title=\"ireply\">&gt; I think the &quot;do nothing&quot; CAN be too strong, and kids who are spared <br/>\n </span></blockquote>having to <br/>\n<blockquote><span title=\"ireply\"> &gt; go to school 180 days can do SOME things out of the house in the <br/>\n </span></blockquote>name of <br/>\n<blockquote><span title=\"ireply\"> &gt; actively living and learning.<br/>\n<br/>\n </span></blockquote>I think the &quot;do nothing&quot; can be too strong too.  But I haven&#39;t seen <br/>\npeople who &quot;do nothing&quot; too strongly unless they&#39;re depressed or if <br/>\nthey&#39;re so programmed by school that they don&#39;t know how to do <br/>\nsomething unless they&#39;re told to do it.  That&#39;s why I asked Betsy if <br/>\nher son was happy and content.  If he&#39;s happy and enjoying his life, <br/>\nthen is the do nothing too strong?  <br/>\n<br/>\nIs being an extrovert better than being an introvert? (I don&#39;t think <br/>\nso).  What if the introvert is at the extreme end of introvertedness <br/>\nand rarely wants to go anywhere?  Not because they don&#39;t have <br/>\nsomewhere willing to take them but just because that&#39;s how their <br/>\npersonality is wired?  <br/>\n<br/>\nAt what point does our coaxing turn into trying to get them to be <br/>\nsomeone who they aren&#39;t?  If we trust them to know when they&#39;re ready <br/>\nto read--all the time, why not trust them to know when they&#39;re ready <br/>\nto leave the house--all the time?  If we wouldn&#39;t say, &quot;Oh, please <br/>\njust 15 minutes of spelling&quot;, why would we say, &quot;Oh, please just 15 <br/>\nminutes at a festival?&quot;  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I think it SHOULD pop up once in a while, maybe without <br/>\n </span></blockquote>the &quot;educational&quot; <br/>\n<blockquote><span title=\"ireply\"> &gt; emphasis, but learning happens from exposure, and if people neglect <br/>\n </span></blockquote>to expose, <br/>\n<blockquote><span title=\"ireply\"> &gt; that&#39;s pretty heavy on the &quot;neglect&quot; end of the balance.<br/>\n<br/>\n </span></blockquote>I think it&#39;s heavy on the neglect end if people neglect to offer to <br/>\nexpose.  The festival I wanted to take my kids to had ice sculptures <br/>\nand I thought that would have been cool for them to see.  But it&#39;s <br/>\nnot like they&#39;ve never seen ice sculptures before.  As a matter of <br/>\nfact we were just recently looking at a magazine that had some really <br/>\ncool ice sculptures in it, and they ooohed and aaahed over them. AND <br/>\nI offered to take them to the festival and told them there would be <br/>\nsome neat ice sculptures there.  I asked them more than once.  I even <br/>\nsaid, &quot;Okay, how about if we just go get something to eat and then <br/>\ncome back home&quot;.  Nope, there really was no interest.  They stayed <br/>\nhome and enjoyed themselves a lot more than they would have if they <br/>\nhad gone to the festival.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If I couldn&#39;t inspire my kids to get up and out through my own <br/>\n </span></blockquote>personal <br/>\n<blockquote><span title=\"ireply\"> &gt; magnetism and salesmanship, I would go to Plan B which would be to <br/>\n </span></blockquote>say &quot;It&#39;s good <br/>\n<blockquote><span title=\"ireply\"> &gt; to do something that relatives and the government will see as <br/>\n </span></blockquote>educational <br/>\n<blockquote><span title=\"ireply\"> &gt; activity, and going to a festival looks good on the portfolio, and <br/>\n </span></blockquote>I can assure you <br/>\n<blockquote><span title=\"ireply\"> &gt; it&#39;s better than ANY day at school, so put your shoes on and get a <br/>\n </span></blockquote>jacket and <br/>\n<blockquote><span title=\"ireply\"> &gt; let&#39;s go have fun!&quot;<br/>\n<br/>\n </span></blockquote>Is doing something so that someone else approves a good reason to do <br/>\nanything?  <br/>\n<br/>\nIf I told my kids to put their shoes on and get a jacket and let&#39;s go <br/>\nhave fun at something they clearly didn&#39;t want to go to, they very <br/>\nwell might refuse to get in the car.  My 11 year old might go, but <br/>\nshe&#39;d be upset with me and she&#39;d be miserable and it would affect our <br/>\nrelationship negatively.   <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If it IS the same old thing, sliding down into a hole of immobility <br/>\n </span></blockquote>and the <br/>\n<blockquote><span title=\"ireply\"> &gt; family gets in the habit of NOT going out and NOT finding <br/>\n </span></blockquote>interesting things in <br/>\n<blockquote><span title=\"ireply\"> &gt; the community, that&#39;s not optimal unschooling.<br/>\n<br/>\n </span></blockquote>But it&#39;s possible to not be the same old thing and still not be doing <br/>\nmany things in the community.  My kids are rarely if ever bored.  <br/>\nThere is always all kinds of creative stuff going on around the <br/>\nhouse, and they&#39;re very often laughing and very excited about <br/>\nsomething cool they&#39;re doing.  It&#39;s just that more often than not, <br/>\nmost of the cool, creative, intersting stuff they do is at home, not <br/>\nout in the community.  <br/>\n<br/>\nOr maybe people are defining &quot;not going out much&quot; differently.  For <br/>\nsome people, going out once every other day is still staying home a <br/>\nlot.  For other people, going out once every 2 weeks is going out a <br/>\nlot.  <br/>\n<br/>\nI think that if a child isn&#39;t going out because he&#39;s not allowed to <br/>\nor doesn&#39;t have the chance to, that&#39;s bad.  If a child isn&#39;t going <br/>\nout because he&#39;s afraid of the world and no one has ever gently tried <br/>\nto give him opportunities to do stuff outside of the house, that&#39;s <br/>\nbad.  But if that&#39;s just his personality, then it&#39;s good when it&#39;s <br/>\nhonored and no one&#39;s trying to change it.  <br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If someone&#39;s own home is a hive of activity and people are coming <br/>\n </span></blockquote>in and out <br/>\n<blockquote><span title=\"ireply\"> &gt; all the time, the hours outside aren&#39;t as important,<br/>\n<br/>\n </span></blockquote>What if the home is a hive of activity but people only come in and <br/>\nout once in a while, and the child is still happy and thriving?  <br/>\n<br/>\n but if the child is still <br/>\n<blockquote><span title=\"ireply\"> &gt; and the mom is feeling uncomfortable, those are signs to MOVE.<br/>\n<br/>\n </span></blockquote>If the mom is feeling uncomfortable because she&#39;s truly listening to <br/>\nher instincts and senses that something is wrong, yes.  But if a mom <br/>\nis listening to insecurities and friends and relatives who worry too <br/>\nmuch, then the mom might need to center herself and listen to her gut <br/>\ninstincts then.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Letting kids decide to &quot;do nothing&quot; (though I don&#39;t think <br/>\n </span></blockquote>it&#39;s &quot;nothing&quot;) <br/>\n<blockquote><span title=\"ireply\"> &gt; isn&#39;t good unschooling.<br/>\n<br/>\n </span></blockquote>I don&#39;t understand how it would be good unschooling to NOT let them <br/>\ndo whatever they&#39;ve decided to do.  As long as they&#39;re happy and <br/>\nthriving of course.  <br/>\n<br/>\nSheila</div>","specialLinks":[]},{"userId":135609248,"authorName":"julie w","from":"julie w &lt;jjjwoolfolk@...&gt;","profile":"juliewinar","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] YES, how unschooling works","postDate":"1110256710","msgId":104248,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyMkQyQzQ2LjYwNzA4MDdAc2JjZ2xvYmFsLm5ldD4=","inReplyToHeader":"PDhlZjRmMjgxMzEwZGMyM2EzNWUwOWI4YzQ2NDgxMWQzQGVhcnRobGluay5uZXQ+","referencesHeader":"PDFmYi40OGYwMDFiLjJmNWRkOWViQGFvbC5jb20+IDw0MjJDQkQ3MS4zMDUwMjA4QHNiY2dsb2JhbC5uZXQ+IDw4ZWY0ZjI4MTMxMGRjMjNhMzVlMDliOGM0NjQ4MTFkM0BlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":104245,"nextInTopic":104249,"prevInTime":104247,"nextInTime":104249,"topicId":104221,"numMessagesInTopic":0,"msgSnippet":"... I liked the whole post especially the fact that 1 hour of school buys me a relaxed household in which ds is free to pretty much live as he wants and I","messageBody":"<div id=\"ygrps-yiv-607030779\">Pam Sorooshian wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; In order to avoid any judgment by others about whether or not we were<br/>\n&gt; &quot;unschoolers&quot; - I called us &quot;unschoolish&quot; for years, as in, &quot;We&#39;re<br/>\n&gt; pretty unschoolish.&quot; Hedged my bets &lt;G&gt;. Now I don&#39;t care anymore what<br/>\n&gt; other people call us.<br/>\n<br/>\n </span></blockquote>I liked the whole post especially the fact that 1 hour of &quot;school&quot; buys <br/>\nme a relaxed household in which ds is free to pretty much live as he <br/>\nwants and I only have to be annoyed with stupid people and these, so <br/>\nvery, very annoying bifocals.<br/>\n<br/>\nUnschoolish.<br/>\nCovering bases.<br/>\nThat&#39;s good.<br/>\nWonder why I care, I normally could give a flying fig what other folks <br/>\nthink....I  probably care in a detached kinda way that hinges more on <br/>\nfeeling like a fraud but really wanting to keep the peace at home.<br/>\n<br/>\nJulie W (who will be seeing Tuckervill tomorrow and that will make up <br/>\nfor the really annoying bifocals, which are also oh, so cool looking) in AR<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; -pam<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; On Mar 7, 2005, at 12:45 PM, julie w wrote:<br/>\n&gt;<br/>\n&gt; &gt; How do you balance it all out and still call it unschooling?<br/>\n&gt; &gt; Hmmm, I must be having a bad day and I&#39;m getting tired of this internal<br/>\n&gt; &gt; struggle I&#39;m having over what and what is not unschooling.<br/>\n&gt; &gt; Julie W<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &quot;List Posting Policies&quot; are provided in the files area of this group.<br/>\n&gt;<br/>\n&gt; Visit the Unschooling website and message boards: <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Sponsor<br/>\n&gt; ADVERTISEMENT<br/>\n&gt; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://us.ard.yahoo.com/SIG=129qvoon2/M=298184.6018725.7038619.3001176/D=groups/S=1705081972:HM/EXP=1110324913/A=2593423/R=0/SIG=11el9gslf/*http://www.netflix.com/Default?mqso=60190075\">http://us.ard.yahoo.com/SIG=129qvoon2/M=298184.6018725.7038619.3001176/D=groups/S=1705081972:HM/EXP=1110324913/A=2593423/R=0/SIG=11el9gslf/*http://www.netflix.com/Default?mqso=60190075</a>&gt; <br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ------------------------------------------------------------------------<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;     * To visit your group on the web, go to:<br/>\n&gt;       <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/UnschoolingDiscussion/\">http://groups.yahoo.com/group/UnschoolingDiscussion/</a><br/>\n&gt;        <br/>\n&gt;     * To unsubscribe from this group, send an email to:<br/>\n&gt;       <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a><br/>\n&gt;       &lt;mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a>?subject=Unsubscribe&gt;<br/>\n&gt;        <br/>\n&gt;     * Your use of Yahoo! Groups is subject to the Yahoo! Terms of<br/>\n&gt;       Service &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a>&gt;.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;------------------------------------------------------------------------<br/>\n&gt;<br/>\n&gt;No virus found in this incoming message.<br/>\n&gt;Checked by AVG Anti-Virus.<br/>\n&gt;Version: 7.0.308 / Virus Database: 266.6.0 - Release Date: 3/2/2005<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n </span></blockquote>  ----------<br/>\n<br/>\nNo virus found in this outgoing message.<br/>\nChecked by AVG Anti-Virus.<br/>\nVersion: 7.0.308 / Virus Database: 266.6.0 - Release Date: 3/2/2005<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":135609248,"authorName":"julie w","from":"julie w &lt;jjjwoolfolk@...&gt;","profile":"juliewinar","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] YES, how unschooling works","postDate":"1110256175","msgId":104245,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyMkQyQTJGLjkwNTA5MDJAc2JjZ2xvYmFsLm5ldD4=","inReplyToHeader":"PDJiLjZlNTdkZDAyLjJmNWUxYWRiQGFvbC5jb20+","referencesHeader":"PDJiLjZlNTdkZDAyLjJmNWUxYWRiQGFvbC5jb20+"},"prevInTopic":104240,"nextInTopic":104248,"prevInTime":104244,"nextInTime":104246,"topicId":104221,"numMessagesInTopic":0,"msgSnippet":"... Mostly because he would prefer to keep to his own schedule and my explanation gives him a push to just go along. No its not the best thing.... ... Yes, of","messageBody":"<div id=\"ygrps-yiv-1595320771\"><a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Why does your kid need to know that you&#39;re logging some math or <br/>\n&gt; history  time?<br/>\n<br/>\n </span></blockquote>Mostly because he would prefer to keep to his own schedule and my <br/>\nexplanation gives him a push to just go along.<br/>\nNo its not the best thing....<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I wouldn&#39;t &quot;do history&quot; in a answering questions way, but what if you <br/>\n&gt; say <br/>\n&gt; &quot;Let&#39;s look at the atlas for a whiel and find some cool stuff to tell <br/>\n&gt; dad about <br/>\n&gt; later,&quot; or &quot;I&#39;d feel better if we had a game to tell dad about every <br/>\n&gt; day, so <br/>\n&gt; let&#39;s play master mind&quot; (or whatever).<br/>\n<br/>\n </span></blockquote>Yes, of course and if I say &quot;do history&quot; I might just read to him for <br/>\nawhile, or watch something on the History Channel, or look though a <br/>\nbook.....which for the most part are things he does not want to spend <br/>\nhis time doing.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Or you could tell your husband that if he wants a schoolish hour a <br/>\n&gt; day,  that<br/>\n&gt; can be his contribution. <br/>\n<br/>\n </span></blockquote>I would so love that but he&#39;s got about 2 hours from the time he gets <br/>\nhome to the time he goes to bed. I can be pretty &quot;well if you don&#39;t like <br/>\nthe way I do it do it yourself&quot; mostly, but in this instance I have to <br/>\nprotect Jim from his own extraordinary work ethic. If he took it on, <br/>\nwhich he would if I suggested, he&#39;d never have any down time and <br/>\nprobably die from a heart attack......<br/>\nIt all sounds like excuses and maybe I just have given up on this point.....<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; -=-The man has come<br/>\n&gt; pretty far in the learning curve when it comes to  an &quot;unschooling&quot;<br/>\n&gt; lifestyle but he has a way to go.<br/>\n&gt; -=-<br/>\n&gt;<br/>\n&gt; He won&#39;t go those final steps if you cave in and do school.<br/>\n<br/>\n </span></blockquote>There is that giving up thing again.<br/>\n;-)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; -=-How do you balance it all out and still call it unschooling?-=-<br/>\n&gt;<br/>\n&gt; People call all kinds of things unschooling.  I don&#39;t think you meant  <br/>\n&gt; to ask<br/>\n&gt; your question that way.  I think you want to really be in the  natural<br/>\n&gt; learning, not in the part-time-school mode and calling it  unschooling.<br/>\n<br/>\n </span></blockquote>And  you are right of course and that is what is bugging me about the <br/>\nwhole thing.<br/>\nBut I am lazy...yes LAZY and some days its easier to just give up and <br/>\nnot have any more of those long, drawn out conversations with dh. Its <br/>\neasier to do &quot;schoolish&quot; shit for an hour and mark it done in my brain <br/>\nand go on to do what we want. More then that, its easier to mark that <br/>\nstuff down and quiet that voice that says we not even very good <br/>\nunschoolers because we just maybe the kind who really don&#39;t have tons of <br/>\ncool conversations, or go to the museums, or on trips, or spend money on <br/>\nstuff in the hopes that ds will not look at it and say &quot;that looks <br/>\nstupid, or boring or sucky&quot;.....<br/>\n<br/>\nIt also could be this time of year when I always go a bit crazy, plus I <br/>\njust got bifocals and they are making me quite annoyed about everything.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; Sandra<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &quot;List Posting Policies&quot; are provided in the files area of this group.<br/>\n&gt;<br/>\n&gt; Visit the Unschooling website and message boards: <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Sponsor<br/>\n&gt; ADVERTISEMENT<br/>\n&gt; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://us.ard.yahoo.com/SIG=12947huqv/M=298184.6018725.7038619.3001176/D=groups/S=1705081972:HM/EXP=1110316141/A=2593423/R=0/SIG=11el9gslf/*http://www.netflix.com/Default?mqso=60190075\">http://us.ard.yahoo.com/SIG=12947huqv/M=298184.6018725.7038619.3001176/D=groups/S=1705081972:HM/EXP=1110316141/A=2593423/R=0/SIG=11el9gslf/*http://www.netflix.com/Default?mqso=60190075</a>&gt; <br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ------------------------------------------------------------------------<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;     * To visit your group on the web, go to:<br/>\n&gt;       <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/UnschoolingDiscussion/\">http://groups.yahoo.com/group/UnschoolingDiscussion/</a><br/>\n&gt;        <br/>\n&gt;     * To unsubscribe from this group, send an email to:<br/>\n&gt;       <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a><br/>\n&gt;       &lt;mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a>?subject=Unsubscribe&gt;<br/>\n&gt;        <br/>\n&gt;     * Your use of Yahoo! Groups is subject to the Yahoo! Terms of<br/>\n&gt;       Service &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a>&gt;.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;------------------------------------------------------------------------<br/>\n&gt;<br/>\n&gt;No virus found in this incoming message.<br/>\n&gt;Checked by AVG Anti-Virus.<br/>\n&gt;Version: 7.0.308 / Virus Database: 266.6.0 - Release Date: 3/2/2005<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n </span></blockquote>  ----------<br/>\n<br/>\nNo virus found in this outgoing message.<br/>\nChecked by AVG Anti-Virus.<br/>\nVersion: 7.0.308 / Virus Database: 266.6.0 - Release Date: 3/2/2005<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] YES, how unschooling works","postDate":"1110238496","msgId":104240,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhlZjRmMjgxMzEwZGMyM2EzNWUwOWI4YzQ2NDgxMWQzQGVhcnRobGluay5uZXQ+","inReplyToHeader":"PDQyMkNCRDcxLjMwNTAyMDhAc2JjZ2xvYmFsLm5ldD4=","referencesHeader":"PDFmYi40OGYwMDFiLjJmNWRkOWViQGFvbC5jb20+IDw0MjJDQkQ3MS4zMDUwMjA4QHNiY2dsb2JhbC5uZXQ+"},"prevInTopic":104238,"nextInTopic":104245,"prevInTime":104239,"nextInTime":104241,"topicId":104221,"numMessagesInTopic":0,"msgSnippet":"Stop worrying about whether or not what you do is CALLED unschooling. That s not the real question you need to be asking yourself. I really mean that. I don t","messageBody":"<div id=\"ygrps-yiv-293944937\">Stop worrying about whether or not what you do is CALLED unschooling. <br/>\nThat&#39;s not the real question you need to be asking yourself.<br/>\n<br/>\nI really mean that. I don&#39;t care if what we do is called unschooling.<br/>\n<br/>\nI care to talk about unschooling - what it means, what it is based on, <br/>\nwhat unschooling parents do, and so on --- but if somebody else looks <br/>\nat my kids and says, &quot;That&#39;s not unschooling,&quot; so what? If I listed my <br/>\n100 goals of life - other people calling what we do &quot;unschooling&quot; would <br/>\nnot be on my list.<br/>\n<br/>\nIf you have to do an hour of something that works for your husband in <br/>\norder to have freedom the rest of the time - then so be it. If it buys <br/>\nyou a relaxed happy household - it might be worth it. On the other <br/>\nhand, if you can educate him to understanding what unschooling is all <br/>\nabout - then so much the better. And, if you put your mind to it, I bet <br/>\nyou can come up with things to do that satisfy him and aren&#39;t as <br/>\nschooly as, say, doing workbooks or reading textbooks/writing essays, <br/>\netc. It doesn&#39;t have to be all or nothing - you can use what YOU know <br/>\nabout learning in all kinds of ways to come up with enough to satisfy <br/>\nhim and still not really be &quot;doing school&quot; at home.<br/>\n<br/>\nBut, if you&#39;re asking if &quot;doing school&quot; an hour a day is still <br/>\nunschooling. Well, no. The answer is easy and clear. But so what? Is <br/>\nbeing called an unschooler what is important? No. It is how your family <br/>\nlives its life that is important and only you really know what will be <br/>\nthe best choice. Harmony in your family can be worth a lot. On the <br/>\nother hand, maybe your husband can be re-educated. Many of us had <br/>\nrecalcitrant spouses who either came around or gave in &lt;g&gt;.<br/>\n<br/>\nIn order to avoid any judgment by others about whether or not we were <br/>\n&quot;unschoolers&quot; - I called us &quot;unschoolish&quot; for years, as in, &quot;We&#39;re <br/>\npretty unschoolish.&quot; Hedged my bets &lt;G&gt;. Now I don&#39;t care anymore what <br/>\nother people call us.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Mar 7, 2005, at 12:45 PM, julie w wrote:<br/>\n<br/>\n&gt; How do you balance it all out and still call it unschooling?<br/>\n&gt; Hmmm, I must be having a bad day and I&#39;m getting tired of this internal<br/>\n&gt; struggle I&#39;m having over what and what is not unschooling.<br/>\n&gt; Julie W </span></blockquote></div>","specialLinks":[]},{"userId":78282269,"authorName":"soggyboysmom","from":"&quot;soggyboysmom&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: YES, how unschooling works","postDate":"1110234733","msgId":104238,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQwaWtwZCtsdGdnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwMjYwMWM1MjMzZCQ0NzMxYTQyMCQ2NTAzYThjMEBqb2huPg=="},"prevInTopic":104236,"nextInTopic":104240,"prevInTime":104236,"nextInTime":104239,"topicId":104221,"numMessagesInTopic":0,"msgSnippet":"... might... ... We re mostly introverts - DH and I are definitely and DS tends to go back and forth between wanting to be out and about with people and close","messageBody":"<div id=\"ygrps-yiv-1421226377\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, &quot;Diana Tashjian&quot; <br/>\n&lt;dtashjian@c...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; <br/>\n&gt; It sounds to me like your whole family might lean towards the<br/>\n&gt; introvert side. What I hear from other people sounds more like<br/>\n&gt; extroversion. How do introverts unschool? Does it look or sound<br/>\n&gt; different from the way extroverts unschool? It seems to me it <br/>\n </span></blockquote>might...<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n </span></blockquote>We&#39;re mostly introverts - DH and I are definitely and DS tends to go <br/>\nback and forth between wanting to be out and about with people and <br/>\nclose to home just us. I know that I&#39;ve grown more able to handle <br/>\npeople stuff as I&#39;ve gotten older - I just account for it by a chunk <br/>\nof downtime before or after it. So that&#39;s mostly what we do as a <br/>\nfamily - if we&#39;ve got a really people-filled few days, we&#39;ll then <br/>\ntry to clear out the schedule some and hunker down for movies, board <br/>\ngames, whatever and just be home together for a bit. Generally, <br/>\nFriday-Monday tends to be out and about so Tuesday-Thursday tends to <br/>\nbe closer to home - Thursday night is in-between - DH and I have our <br/>\nweekly date and DS plays with Grandma and toddler cousin Tyler at <br/>\nGrandma&#39;s house. We also keep an eye on how many different places we <br/>\ngo to in a given day - more than 2 or 3 is too much.<br/>\n<br/>\nJust my 2 cents</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] YES, how unschooling works","postDate":"1110229211","msgId":104236,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJiLjZlNTdkZDAyLjJmNWUxYWRiQGFvbC5jb20+"},"prevInTopic":104235,"nextInTopic":104238,"prevInTime":104235,"nextInTime":104238,"topicId":104221,"numMessagesInTopic":0,"msgSnippet":"In a message dated 3/7/2005 1:50:08 PM Mountain Standard Time, jjjwoolfolk@sbcglobal.net writes: listen  lets do some math and history and this will make Dad","messageBody":"<div id=\"ygrps-yiv-611909213\">In a message dated 3/7/2005 1:50:08 PM Mountain Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jjjwoolfolk@...\">jjjwoolfolk@...</a> writes:<br/>\n<br/>\n&quot;listen  lets <br/>\ndo some math and history and this will make Dad more comfortable  about <br/>\nall the rest of the time gaming, playing, watching tv, hanging out,  and <br/>\nletting you pretty much make all your own decisions&quot;? The man has come  <br/>\npretty far in the learning curve when it comes to an &quot;unschooling&quot;  <br/>\nlifestyle but he has a way to go.<br/>\n<br/>\n<br/>\n<br/>\nWhy does your kid need to know that you&#39;re logging some math or history  time?<br/>\n <br/>\nI wouldn&#39;t &quot;do history&quot; in a answering questions way, but what if you say  <br/>\n&quot;Let&#39;s look at the atlas for a whiel and find some cool stuff to tell dad about  <br/>\nlater,&quot; or &quot;I&#39;d feel better if we had a game to tell dad about every day, so  <br/>\nlet&#39;s play master mind&quot; (or whatever).  <br/>\n <br/>\nAnd then YOU tell your husband about Master Mind being deductive reasoning  <br/>\nif he&#39;s not already a Master Mind player from pre-fatherhood years.<br/>\n <br/>\nOr you could tell your husband that if he wants a schoolish hour a day,  that <br/>\ncan be his contribution.  (He probably wouldn&#39;t last a week, so it&#39;s a  safe <br/>\nsuggestion to make.)<br/>\n <br/>\n-=-The man has come <br/>\npretty far in the learning curve when it comes to  an &quot;unschooling&quot; <br/>\nlifestyle but he has a way to go.<br/>\n-=-<br/>\n <br/>\n<br/>\nHe won&#39;t go those final steps if you cave in and do school.<br/>\n <br/>\n-=-How do you balance it all out and still call it unschooling?-=-<br/>\n <br/>\nPeople call all kinds of things unschooling.  I don&#39;t think you meant  to ask <br/>\nyour question that way.  I think you want to really be in the  natural <br/>\nlearning, not in the part-time-school mode and calling it  unschooling.<br/>\n <br/>\nSandra<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":135609248,"authorName":"julie w","from":"julie w &lt;jjjwoolfolk@...&gt;","profile":"juliewinar","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] YES, how unschooling works","postDate":"1110228337","msgId":104235,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyMkNCRDcxLjMwNTAyMDhAc2JjZ2xvYmFsLm5ldD4=","inReplyToHeader":"PDFmYi40OGYwMDFiLjJmNWRkOWViQGFvbC5jb20+","referencesHeader":"PDFmYi40OGYwMDFiLjJmNWRkOWViQGFvbC5jb20+"},"prevInTopic":104233,"nextInTopic":104236,"prevInTime":104234,"nextInTime":104236,"topicId":104221,"numMessagesInTopic":0,"msgSnippet":"... Going out on a big limb here, but this makes me think of  a question that s been bugging me. My dh still would like an hour of so of what he recognizes as","messageBody":"<div id=\"ygrps-yiv-449562736\"><a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; If I couldn&#39;t inspire my kids to get up and out through my own personal<br/>\n&gt; magnetism and salesmanship, I would go to Plan B which would be to say <br/>\n&gt; &quot;It&#39;s good<br/>\n&gt; to do something that relatives and the government will see as educational<br/>\n&gt; activity, and going to a festival looks good on the portfolio, and I <br/>\n&gt; can assure you<br/>\n&gt; it&#39;s better than ANY day at school, so put your shoes on and get a <br/>\n&gt; jacket and<br/>\n&gt; let&#39;s go have fun!&quot;<br/>\n<br/>\n </span></blockquote>Going out on a big limb here, but this makes me think of  a question <br/>\nthat&#39;s been bugging me. My dh still would like an hour of so of what he <br/>\nrecognizes as learning each day. Is it unschooling to say &quot;listen lets <br/>\ndo some math and history and this will make Dad more comfortable about <br/>\nall the rest of the time gaming, playing, watching tv, hanging out, and <br/>\nletting you pretty much make all your own decisions&quot;? The man has come <br/>\npretty far in the learning curve when it comes to an &quot;unschooling&quot; <br/>\nlifestyle but he has a way to go.<br/>\nHow do you balance it all out and still call it unschooling?<br/>\nHmmm, I must be having a bad day and I&#39;m getting tired of this internal <br/>\nstruggle I&#39;m having over what and what is not unschooling.<br/>\nJulie W<br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\nNo virus found in this outgoing message.<br/>\nChecked by AVG Anti-Virus.<br/>\nVersion: 7.0.308 / Virus Database: 266.6.0 - Release Date: 3/2/2005</div>","specialLinks":[]},{"userId":152335345,"authorName":"Diana Tashjian","from":"&quot;Diana Tashjian&quot; &lt;dtashjian@...&gt;","profile":"d_tashjian","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] YES, how unschooling works","postDate":"1110217453","msgId":104233,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMjYwMWM1MjMzZCQ0NzMxYTQyMCQ2NTAzYThjMEBqb2huPg==","referencesHeader":"PDFmYi40OGYwMDFiLjJmNWRkOWViQGFvbC5jb20+IDwwMDA5MDFjNTIzMzQkMGU3YTYxMjAkNjEwMWE4YzBAbGF1bmNobW9kZW0uY29tPg=="},"prevInTopic":104226,"nextInTopic":104235,"prevInTime":104232,"nextInTime":104234,"topicId":104221,"numMessagesInTopic":0,"msgSnippet":"I don t know if this will help, Betsy, but I have hard time going out of the house frequently, always being on the go, especially to crowd-filled events or","messageBody":"<div id=\"ygrps-yiv-397748618\">I don&#39;t know if this will help, Betsy, but I have hard time going out<br/>\nof the house frequently, always being on the go, especially to<br/>\ncrowd-filled events or places. It&#39;s also not natural for me to want to<br/>\nalways have people over to my house or to want to go over all the time<br/>\nto other peoples&#39; houses. I&#39;m a bona fide introvert. My husband is<br/>\nexactly the opposite. I think it&#39;s good for me because although it<br/>\nleads to conflicts of interest that we have to work out, it causes me<br/>\nto stretch a little. Plus I have someone who can take my son places<br/>\nthat I&#39;d rather not go :o) I think it&#39;s good for my son because he<br/>\ngets to choose from the best of both worlds and he seems to lean more<br/>\ntowards the extrovert side.<br/>\n<br/>\nIt sounds to me like your whole family might lean towards the<br/>\nintrovert side. What I hear from other people sounds more like<br/>\nextroversion. How do introverts unschool? Does it look or sound<br/>\ndifferent from the way extroverts unschool? It seems to me it might...<br/>\n<br/>\nAnyway, just a thought...<br/>\n<br/>\nDiana Tashjian</div>","specialLinks":[]},{"userId":141102765,"authorName":"Mary","from":"&quot;Mary&quot; &lt;mummy124@...&gt;","profile":"mummyone24","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] YES, how unschooling works","postDate":"1110213493","msgId":104226,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDkwMWM1MjMzNCQwZTdhNjEyMCQ2MTAxYThjMEBsYXVuY2htb2RlbS5jb20+","referencesHeader":"PDFmYi40OGYwMDFiLjJmNWRkOWViQGFvbC5jb20+"},"prevInTopic":104221,"nextInTopic":104233,"prevInTime":104225,"nextInTime":104227,"topicId":104221,"numMessagesInTopic":0,"msgSnippet":"I guess I m very lucky that I don t have kids that complain when we take them somewhere that they haven t decided on themselves. Not sure if it s how they are","messageBody":"<div id=\"ygrps-yiv-765062966\">I guess I&#39;m very lucky that I don&#39;t have kids that complain when we take<br/>\nthem somewhere that they haven&#39;t decided on themselves. Not sure if it&#39;s how<br/>\nthey are or how we have all managed to be together.<br/>\n<br/>\nBut it happens around here. And most of the time the kids love being out and<br/>\nseeing the new stuff we have planned for us all. Sometimes we all decide it<br/>\nwasn&#39;t that great, but that we had a good time just being out and deciding<br/>\nfor ourselves.<br/>\n<br/>\nOne thing we have learned is that Joseph (10) doesn&#39;t like surprises when it<br/>\ncomes to going somewhere. Sierra (9) does like surprises so we act<br/>\naccordingly and Joseph is good about not saying anything. Alyssa (4) just<br/>\nreally likes to go out unless it&#39;s cold and she has to wear clothes. We have<br/>\nmanaged to get by that on a few occasions.<br/>\n<br/>\nThere is a big Renaissance Festival around here that we have never been too.<br/>\nThey use to have it at a park just down the street from us and we have never<br/>\ngone there either. Mostly because I thought it was really expensive for us<br/>\nall to get in. Now it&#39;s held about 40 minutes away and Joe (dh) was able to<br/>\nget us in for free.<br/>\n<br/>\nSo off we went with the 3 younger kids. Tara (18) had to work. I tried to<br/>\nexplain to the kids the best I could as to what it was about. I didn&#39;t make<br/>\nit half as interesting as it really was once we got there. It was wonderful<br/>\nand we all had a really good time. Definitely planning on going back next<br/>\nyear. In fact Joe and I went again yesterday just the two of us. I loved the<br/>\natmosphere and had such a good time with all the people in character there.<br/>\nThe shows were so funny I haven&#39;t laughed that hard in quite awhile. The<br/>\nfirst time we went, Joseph even volunteered to go up on stage with the<br/>\nmagician. Something he has never done. He had such a good time.<br/>\n<br/>\nSo sometimes things end up that way going to new places. Having a wonderful<br/>\ntime and deciding to do it again. Sometimes, like the Monster Truck Jam, we<br/>\nall decide it was a fun experience, but we won&#39;t be going back anytime soon!<br/>\n<br/>\nI can&#39;t say we have ever gone anywhere where we&#39;ve had an awful time. We<br/>\nmake the most out of being together and just doing something new.<br/>\n<br/>\nMary B</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"YES, how unschooling works","postDate":"1110212587","msgId":104221,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFmYi40OGYwMDFiLjJmNWRkOWViQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":104226,"prevInTime":104220,"nextInTime":104222,"topicId":104221,"numMessagesInTopic":0,"msgSnippet":"In a message dated 3/6/05 10:24:13 PM, sheran@ptd.net writes: ","messageBody":"<div id=\"ygrps-yiv-1219126549\">In a message dated 3/6/05 10:24:13 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sheran@...\">sheran@...</a> writes:<br/>\n<br/>\n&lt;&lt; When there was a winter festival at a nearby farm, I tried to get all <br/>\n<br/>\nmy kids to go.  They all said no, anso we didn&#39;<br/>\nZt go.  I could&#39;ve <br/>\n<br/>\ngone by myself, but when I seriously considered it, I realized that I <br/>\n<br/>\ndidn&#39;t really want to go for myself.  I wanted to go for them.  I <br/>\n<br/>\nthought it would have neat stuff to &quot;expose&quot; them to.  After the <br/>\n<br/>\nfestival was over there was a story and pictures in the paper about <br/>\n<br/>\nit, and I felt a pang of &quot;Darn, I wish we could&#39;ve gone&quot;, and again <br/>\n<br/>\nrealized that I wouldn&#39;t have felt that if I didn&#39;t have kids.  &gt;&gt;<br/>\n<br/>\nBut you wouldn&#39;t be homeschooling if you didn&#39;t have kids.<br/>\n<br/>\nI think the &quot;do nothing&quot; CAN be too strong, and kids who are spared having to <br/>\ngo to school 180 days can do SOME things out of the house in the name of <br/>\nactively living and learning.<br/>\n<br/>\n-=- I  really think it was a bit of schooly &quot;expose them to a lot of <br/>\n<br/>\neducational things&quot; kind of feeling that still pops up every once in <br/>\n<br/>\nawhile. -=-<br/>\n<br/>\nI think it SHOULD pop up once in a while, maybe without the &quot;educational&quot; <br/>\nemphasis, but learning happens from exposure, and if people neglect to expose, <br/>\nthat&#39;s pretty heavy on the &quot;neglect&quot; end of the balance.<br/>\n<br/>\n-=-I wasn&#39;t so much attracted to taking them to the festival <br/>\n<br/>\nbecause of anything there that I thought would particularly interest <br/>\n<br/>\nany one of them.  It was just that it was a &quot;good experience&quot; that I <br/>\n<br/>\nwanted to &quot;expose&quot; them to.  It would make me feel like a good, well-<br/>\n<br/>\nrounded unschooler.  And it would make me feel &quot;normal&quot;, like I go <br/>\n<br/>\nlots of cool places with my kids like everyone else.  -=-<br/>\n<br/>\nIt would have been doing something together, too, that would make memories <br/>\nand probably be a springboard to other connections, activities and discussions.<br/>\n<br/>\n-=-It&#39;s easier to explain unschooling to friends/relatives when you can <br/>\n<br/>\ntell them about theatre productions and festivals and museums that <br/>\n<br/>\nyou went to, because all that sounds very &quot;educational&quot; and <br/>\n<br/>\nimpressive.-=-<br/>\n<br/>\nIt also is being involved in your community, and that&#39;s not a school thing, <br/>\nthat&#39;s a good-human thing.  <br/>\n<br/>\n-=- In my state, it also makes good fodder for the <br/>\n<br/>\nportfolio.  But when your homebody kids stay home and read and cook <br/>\n<br/>\nand play video games and watch tv and play, and it seems that every <br/>\n<br/>\ntime you tell them about what your kids are doing it&#39;s the same <br/>\n<br/>\nthing, you feel a pressure to be &quot;exposing them&quot; to more so that you <br/>\n<br/>\nsound more impressive. -=-<br/>\n<br/>\nIf I couldn&#39;t inspire my kids to get up and out through my own personal <br/>\nmagnetism and salesmanship, I would go to Plan B which would be to say &quot;It&#39;s good <br/>\nto do something that relatives and the government will see as educational <br/>\nactivity, and going to a festival looks good on the portfolio, and I can assure you <br/>\nit&#39;s better than ANY day at school, so put your shoes on and get a jacket and <br/>\nlet&#39;s go have fun!&quot;<br/>\n<br/>\n-=-I know that it&#39;s not the same old thing every <br/>\n<br/>\nday and that they learn and do interesting stuff all the time but to <br/>\n<br/>\nother people who don&#39;t get unshcooling, it sounds like the same old <br/>\n<br/>\nthing sometimes I think.  -=-<br/>\n<br/>\nIf it IS the same old thing, sliding down into a hole of immobility and the <br/>\nfamily gets in the habit of NOT going out and NOT finding interesting things in <br/>\nthe community, that&#39;s not optimal unschooling.<br/>\n<br/>\nCouples even without kids get that way sometimes, to the point that they&#39;re <br/>\nnot going to parties anymore, not inviting people over anymore, and soon it&#39;s <br/>\njust the same thing all the time and they&#39;ve become immobilized and stuck.  <br/>\n<br/>\nStuck isn&#39;t a learning place.<br/>\n<br/>\nIf someone&#39;s own home is a hive of activity and people are coming in and out <br/>\nall the time, the hours outside aren&#39;t as important, but if the child is still <br/>\nand the mom is feeling uncomfortable, those are signs to MOVE.<br/>\n<br/>\nIn the past week, Kirby has played  a new Star Wars video game for over 55 <br/>\nhours.  He also went to work three times, class four times, karate for three <br/>\nhours, visited a friend LATE after work Saturday, and ran a long D&D session last <br/>\nnight at our house.  That was as full a week as I&#39;ve ever seen him have when <br/>\nhe wasn&#39;t out of town or at a gaming convention.  He hardly slept.  He&#39;ll be <br/>\nup again and off to class within an hour.  He eats at the desk or at work, and <br/>\nthat&#39;s a very, very busy week.  <br/>\n<br/>\nYesterday Marty took three friends to Explora, a hands-on museum for kids, <br/>\nmostly science and math, but not all.   The three friends hadn&#39;t been before.  <br/>\nMarty got them in on our family membership, though he was prepared to pay their <br/>\nway out of his own money if the desk had said no about the &quot;family.&quot;   Those <br/>\nother three, none homeschoolers) are Leif, who has a college degree and is <br/>\nprobably 25 years old, Ed who&#39;s 21 and a part-time college student, though he has <br/>\n a GOOD job with a security clearance, and Ryan, who&#39;s barely 21 and my <br/>\nfavorite of all their friends.  Marty is 16.    They followed Marty&#39;s <br/>\nrecommendation that it&#39;s a really great place to go, got there about 2:00 in the afternoon <br/>\nand stayed until it closed.   Last night they were all in Kirby&#39;s D&D game, <br/>\nand today Marty and Holly are watching another disc of Buffy with their <br/>\nBuffy-watching-partner-homeschooler friend, Julie.<br/>\n<br/>\nIf the kids get used to going and doing, when they get older you won&#39;t have <br/>\nto be their organizer or their driver. <br/>\n<br/>\nIf you can&#39;t get a young child up and going, you will probably not get a teen <br/>\nup and going.  SELL the world as a happy place, and to do that you need to <br/>\nSEE the world as a happy place full of things worth getting some shoes and a <br/>\ncoat on and taking pains (not just when it&#39;s easy) to GET OUT THERE.  Make it fun <br/>\nwhen you do go.  Play music in the car, stop and feed ducks, have a nice <br/>\nlunch packed if you can&#39;t afford to go out, stop at a good place to eat it.   <br/>\nTreat your child as an honored guest you just can&#39;t WAIT to show something cool.   <br/>\n<br/>\nLetting kids decide to &quot;do nothing&quot; (though I don&#39;t think it&#39;s &quot;nothing&quot;) <br/>\nisn&#39;t good unschooling.  Providing more choices for them, and more input and more <br/>\nopportunity is the duty of anyone who wants to say &quot;I&#39;m unschooling.&quot;  It <br/>\ntruly does need to be a &quot;doing,&quot; an action, a life lived purposefully and richly, <br/>\nnot just a hiding-out from school.  It SHOULD be so rich that anyone who <br/>\nhears stories is impressed and understands it.<br/>\n<br/>\nFor anyone new who might not know about this collection of typial days (or <br/>\nfor longtime readers who just haven&#39;t seen it for a while), here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/typical\">http://sandradodd.com/typical</a><br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":104411,"nextTopicId":104427}}