{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Hello and Intro.. (and Sandra-response to religion question)","postDate":"1008985996","msgId":1271,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc2LjE0OWNkYjVlLjI5NTU0MThjQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":1270,"nextInTime":1272,"topicId":1271,"numMessagesInTopic":0,"msgSnippet":"In a message dated 12/21/01 6:16:29 PM, anderclan@clas.net writes: ","messageBody":"<div id=\"ygrps-yiv-2034420864\">In a message dated 12/21/01 6:16:29 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:anderclan@...\">anderclan@...</a> writes:<br/>\n<br/>\n&lt;&lt; A special &#39;hello&#39; to Sandra.. I&#39;m a big fan of yours.. reading your site..<br/>\nlistening to you on the unschoolers forum..and also your articles in Home<br/>\nEducation magazine.&gt;&gt;<br/>\n<br/>\nOooh thanks!<br/>\nIt&#39;s nice to get feedback (other than the occasional &quot;you&#39;re mean and you <br/>\nsuck&quot; stuff I get sometimes).<br/>\n<br/>\n&lt;&lt;I&#39;m curious about your spiritual journey..raised<br/>\nSouthern Baptist..but now?? What changed for you?  &gt;&gt;<br/>\n<br/>\nGradually in a way and swiftly in a way, I examined everything I could get <br/>\nnear enough to look at, asked everyone who would talk what they believed and <br/>\nwhy, and so gradually in that there was a smooth curve, but swiftly in that <br/>\nthere were few breaks on my part, my beliefs evolved.<br/>\n<br/>\nAnd I really do see it as an evolution.  <br/>\nI&#39;ve seen others go through the more or less the same series of thoughts and <br/>\n&#39;tests&#39; and settlings, in more or less the same order, and come to the same <br/>\nbasic conclusions.<br/>\n<br/>\nMy parents were variably Baptist and Nazarene.  My dad&#39;s parents were more <br/>\nstable (Baptist) and my mom&#39;s family was moving around a lot but she <br/>\nidentified with Pentacostals and Baptists in the generic sort of <br/>\nindependent-church West-Texas-in-the-30&#39;s and 40&#39;s way.  <br/>\n<br/>\nWhen my parents were first together they weren&#39;t going to church.  My dad&#39;s <br/>\nparents did; my mom&#39;s had quit when their kids were grown, I think.<br/>\n<br/>\nThey/we tried church again when they thought I was old enough to need it, but <br/>\nthey didn&#39;t agree on which church, and how to act, and why it was important, <br/>\nso I went with neighbors because I really liked to go.<br/>\n<br/>\nWe moved, I wasn&#39;t in church for a while, and when I was nine started going <br/>\nagain, on my own (making parents drive me, and often--for years I went five <br/>\ntimes a week, as Baptists are wont to do when they&#39;re in the choir, and <br/>\ngirl&#39;s auxiliary and training union and prayer meeting).  I was going to be a <br/>\nmissionary.  I studied hard.  I studied too hard.  I read everything they had <br/>\nto read, spent my own allowance on stuff from the home office in Tennessee, an<br/>\nd about the time I had topped out on available reading material, started <br/>\ndoing guitar mass (folk mass, in a group of four musicians, of whom I was the <br/>\nlead when they all looked at me and shrugged because I had more experience <br/>\nand knew more songs).  So I would go to 9:30 at the Catholic church, and down <br/>\nthe road for 11:00 Baptist service.<br/>\n<br/>\nAt school we had an English teacher who was interested in eastern religion.  <br/>\nShe had us read philosophical stuff--Ayn Rand (gagged me philosophically, but <br/>\nI liked Atlas Shrugged as a novel, and I liked Anthem), and Siddhartha.  She <br/>\ntaught us meditation, and stuff about Hinduism and Buddhism.  I had already <br/>\nbought a series on comparative religion with my own money (crummy series--I <br/>\nwish we had had some of the kids&#39; books that are out now!!), and I was THERE. <br/>\n <br/>\n<br/>\nDid some church-hopping with two Catholic friends who were just curious.  <br/>\nWe&#39;d make a list, and go to services in town on Sundays.  Jerry Lopez and <br/>\nRudy Roybal.  Someone asked me about their whereabouts last month; I had not <br/>\na clue.  They were a year older than I was.  We never even used to go to <br/>\nlunch afterward.  Couldn&#39;t afford it, I guess, but we&#39;d take turns driving <br/>\neach other to some other church, like a team of archeologists.<br/>\n<br/>\nI did some more of that in college.  Just curious to the bone about what the <br/>\ndifferences and similarities were.<br/>\n<br/>\nIt was the early 70&#39;s and there were constant meetings of new (to us) <br/>\ngroups--Moonies, Baha&#39;i, 3H0 (American Sikhs)--I went to lots of those kinds <br/>\nof intro sessions and series of lectures and got their literature.  I <br/>\nlistened to on-campus evangelists.<br/>\n<br/>\nStill I identified myself as Baptist, and felt saved and all.  Gradually, as <br/>\nI read more and prodded people to see what their point of false-smile was and <br/>\nwhere they really were intolerant, I came to be embarrassed to be Baptist.  <br/>\nToo much willful ignorance.<br/>\n<br/>\nKnowing the stats on members and attendance were important at my hometown <br/>\nchurch, I tried to get them to undo my membership.  They had no way to do <br/>\nthat.  They could transfer it to another church, but they had never had <br/>\nanyone just ask them to remove them from the rolls.  <br/>\n<br/>\nWent to college.  Went to Catholic mass at the Neumann center fairly often <br/>\nbecause it was walking distance.  Went to Lutheran and really like <br/>\nPresbyterian.<br/>\n<br/>\n&quot;Went with&quot; (3.5 year relationship) a Hindu, Devender Singh, from India (by <br/>\nway of New Jersey, where he went to high school) through college.  He, too, <br/>\nwas interested in all religious matters, and was into church-hopping <br/>\nsometimes.  He could answer all kinds of questions about Hinduism, and told <br/>\nme about Jains, and Sikhs, and used to go with me to intro meetings of <br/>\nvarious groups.<br/>\n<br/>\n<br/>\nStill and always I was curious about other people&#39;s lives, and in the idea of <br/>\n&quot;religious experiences&quot; themselves.  Studied psychology (minored in school) <br/>\nand folklore (second minor in anthropology), always with an eye to learning <br/>\nand religion--how fairy tales were used to tap into the subconscious and what <br/>\ncharacters people identified with, and what was scary or soothing or instruct<br/>\nional in mythology.  <br/>\n<br/>\nWhile I was teaching and in my first marriage, I didn&#39;t go to church at all.  <br/>\nSpent most weekends reading students&#39; writings (teaching composition.)  Got <br/>\ninvolved in the SCA which took lots of weekend time.<br/>\n<br/>\nGot involved in Adult Children of Alcoholics, which was the most <br/>\nreligious/spiritual thing I had done for a long time.  (And it&#39;s not, but <br/>\ncompared to what I had been doing it was.)<br/>\n<br/>\nLa Leche League was the most physical of any &quot;study&quot; I had done to that <br/>\npoint, as it involved not ideas and feelings so much as attending to another <br/>\nperson&#39;s physical needs. And the definition of physical needs <br/>\nformed/overlapped a range of things that tied in with learning and <br/>\nspirituality.<br/>\n<br/>\nSo where I had always been, there I still was--surrounded with questions and <br/>\nideas about which parts of us are &quot;for learning&quot; or &quot;for spirituality&quot; or <br/>\n&quot;natural&quot; or &quot;common to all humans.&quot;  <br/>\n<br/>\nAnd where I was, here I am.<br/>\n<br/>\nAsk me more if you want.  I don&#39;t mind.<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":1268,"nextTopicId":1197}}