{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":99826381,"authorName":"Mary Bianco","from":"&quot;Mary Bianco&quot; &lt;mummyone24@...&gt;","profile":"mummyone24","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"How to stay strong","postDate":"1046542388","msgId":59923,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYxMjR6SUlKQ1V1R2RpWWVWV1UwMDAxODc4NUBob3RtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":59922,"nextInTime":59924,"topicId":59923,"numMessagesInTopic":0,"msgSnippet":"From: Tod and Emily   I see","messageBody":"<div id=\"ygrps-yiv-2063284022\">From: &quot;Tod and Emily&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:todandemily@...\">todandemily@...</a>&gt;<br/>\n<br/>\n<br/>\n&lt;&lt;How do you stay strong in your beliefs and committment to unschooling  in <br/>\nthe face of disapproval?&gt;&gt;<br/>\n<br/>\n<br/>\nI see what schools can do. My oldest has always gone to school and although <br/>\na &quot;good, private one&quot; it was awful in her early years. Her being in the <br/>\nsystem actually was one very main reason for my husband and I to homeschool. <br/>\nPlus I see what unschooling does and how my children are. That&#39;s definitely <br/>\nproof enough for me to overcome all the disapproval I can get. And I have <br/>\ngotten it from family. Not mine but my in laws. My mom is an ex school <br/>\nteacher and she is very supportive. She&#39;s quick to tell all her friends <br/>\nabout what we do and I must admit, I get more support from them than the <br/>\nyounger people. My mom is 77 and all her friends are that age and older. <br/>\nThey are extremely supportive. Maybe they all remember the days of the one <br/>\nroom schoolhouse and that makes a big difference from how schools are now. <br/>\nMy in laws have stopped commenting. Mostly because I just stay away from <br/>\nthem now but my MIL keeps her mouth shut. It was a losing battle. I&#39;m fierce <br/>\nwhen I really believe in something! Stick to your guns. Have a rehearsed <br/>\nspeech about unschooling if that makes you more comfortable. Be aware of all <br/>\nthe negatives you may get and be ready to answer them if that&#39;s important to <br/>\nyou. You could just walk away. Those around you hopefully will stop <br/>\neventually. But proof is in the pudding.<br/>\n<br/>\n<br/>\n<br/>\n&lt;&lt;Do you fear that your child will someday resent your descision not to put <br/>\nthem in school like &quot;normal&quot; kids? What do you do with that?&gt;&gt;<br/>\n<br/>\n<br/>\nWell hopefully my kids won&#39;t do that. All I can go by is the unschoolers I <br/>\nknow that are grown. They still love the idea that they were given such an <br/>\nopportunity. I really don&#39;t see it ending up a negative thing.<br/>\n<br/>\n<br/>\n<br/>\n&lt;&lt;I feel worried by this notion that even though I see that unschooling will <br/>\nbe vastly superior to public schooling, is it really ok to make such a big <br/>\ndecision for someone else?&gt;&gt;<br/>\n<br/>\n<br/>\nAt such a young age when the schools want our children, yes I think it is <br/>\nokay to make such a decision. Five is way too young for a child to be sent <br/>\noff with total strangers who I know nothing about to be cared for all day. <br/>\nThey don&#39;t have the skills yet to deal with it all and it can be <br/>\noverwhelming and harmful. When they are older and more aware of what school <br/>\nis, then it can be different. I&#39;m still on the fence about this one. I <br/>\nthought at one time I would never say okay to my kids going to school when <br/>\nthey got older. Now I&#39;m not so sure that I could deny them that if that&#39;s <br/>\nwhat they really wanted. I sure would hope if that happened, they would come <br/>\nrunning back home. It hasn&#39;t come up though and my two middle children say <br/>\nthey will never ever go to school! So far so good!<br/>\n<br/>\nMary B<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n_________________________________________________________________<br/>\nMSN 8 helps eliminate e-mail viruses. Get 2 months FREE*.  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://join.msn.com/?page=features/virus\">http://join.msn.com/?page=features/virus</a></div>","specialLinks":[]}],"prevTopicId":59922,"nextTopicId":59929}}