{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":59461774,"authorName":"Sarah","from":"Sarah &lt;sarahanne1@...&gt;","profile":"sarahanne1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"&quot;Typical&quot; (After-the-conference) Day","postDate":"1158334398","msgId":26943,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwOTE1MTUzMzE4LjI0MDc1LnFtYWlsQHdlYjUyMzEwLm1haWwueWFob28uY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":26942,"nextInTime":26944,"topicId":26943,"numMessagesInTopic":0,"msgSnippet":"Yesterday was a wonderful, better-write-it-down unschooling day.  A lot of it was  a direct reaction/response to the conference. We had a fairly typical","messageBody":"<div id=\"ygrps-yiv-537486764\">Yesterday was a wonderful, better-write-it-down<br/>\nunschooling day.  A lot of it was  a direct<br/>\nreaction/response to the conference.  <br/>\n<br/>\nWe had a fairly typical morning....I checked emails<br/>\nwhile the girls watched a show and ate their<br/>\nbreakfast...they watched the movie The Blue Butterfly.<br/>\n <br/>\n<br/>\nI ordered the girls pink guitars while they watched<br/>\nthe movie.  They both want guitars and Eva wants a<br/>\nukulele and a violin, too.  These will probably be for<br/>\na Christmas surprise.  Or maybe not :)<br/>\n<br/>\nThen we got ready to take our dog, Mayzie, to the<br/>\ngroomer.  I usually use an independent groomer, but<br/>\nwasn&#39;t impressed last time, so we went to Petsmart. <br/>\nPetsmart was, as usual, the next best thing to  a zoo.<br/>\n The girls decided they wanted an exotic rat and a<br/>\nguinea pig, and the conversation about small animals<br/>\npopped up throughout the day.  This was funny because<br/>\nthey have never even been interested in animals like<br/>\nthat...only kitties and puppies.  So we are now<br/>\nresearching small animals and the best pets for little<br/>\nhands.<br/>\n<br/>\nEarlier, I had called around to locate Manga cookies<br/>\n(the cookies served in the Manga funshop at the<br/>\nconference)...Pocky.  Turns out, our international<br/>\nmarket stocks Pocky!  Yay!  When we got to the market<br/>\n(attached to a Korean restaurant), we found Pocky<br/>\nstocked in four or five places throughout the store. <br/>\nFunny I had never paid attention to it before and it<br/>\nwas everywhere :)!  We bought strawberry and chocolate<br/>\npocky and a couple other tasties with Japanese<br/>\nwriting.<br/>\n<br/>\nLeaving the international store, we ended up on a dirt<br/>\nroad I had never driven on!  We went over an old<br/>\nbridge and passed an abandoned rock wall/dilapidated<br/>\nbuilding.  We hypothesized about its original purpose<br/>\nand decided it would be a perfect photo spot.<br/>\n<br/>\nWe came home for lunch, and Sophia really wanted to<br/>\nlook up vintage Midge dolls (Barbie&#39;s friend).  She<br/>\nlikes the 1962 or so versions.  We are looking for the<br/>\nperfect doll with the prettiest face on e-bay for less<br/>\nthan $50.00.  Well, we didn&#39;t find one so we decided<br/>\nto add to her growing Littlest Pet Shop collection. <br/>\nWe&#39;d never seen the seahorses!<br/>\n<br/>\nSophia had a playdate with five other homeschool<br/>\ngirls, and Eva and I picked up Mayzie from Petsmart<br/>\nand some great one-on-one time ensued.  It ensued<br/>\nwhile I was laying down feeling that<br/>\nmorning-sickness-in-the-afternoon feeling.<br/>\n<br/>\nA huge rain storm hit when we picked up Sophia (turns<br/>\nout the mountains are supposed to get snow this<br/>\nweekend), and we talked about lightening and thunder<br/>\nand distance and how much water our yard got since it<br/>\nwas also an irrigation day. We talked about rhythm and<br/>\nseasons and how we need a word for the<br/>\nin-between-seasons.  We talked about Benjamin Franklin<br/>\nand grounding and other great inventions.  We talked<br/>\nabout when he died and how old he&#39;d be. I also stopped<br/>\nto look at a house for sale and we talked about house<br/>\nprices, neighborhoods, and our ideal place to live.<br/>\n<br/>\nWhen my husband got home, we went to our favorite<br/>\nIndian restaurant which happens to also be a gas<br/>\nstation.  Guess what they had?  Henna for $2.50!  So<br/>\nwe bought Henna.  Today we&#39;re going to a really great<br/>\nstore here called Earthly Awakenings to buy an<br/>\napplicator.  <br/>\n<br/>\nThis reminds me, somewhere in there we bought the<br/>\nKlutz hair color kit.  The girls really wanted colored<br/>\nhair after the conference :)  I thought that would be<br/>\na good place for *me* to begin!<br/>\n<br/>\nWhen we got home, we watched Alice in Wonderland....at<br/>\nthe end is some black and white footage of non-cartoon<br/>\n&quot;Alice&quot; and crew.  We looked Alice up on the Internet<br/>\nto figure out her age and how old Walt Disney would be<br/>\nnow.  And how old Midge is in relation to those two :)<br/>\n <br/>\n<br/>\nSophia is our late-nighter, so after Eva and I read a<br/>\nwhole bunch of books and we were nearly asleep, Sophia<br/>\nwalks in with Pocky in one hand and a new Manga comic<br/>\nbook she invented...all done in Pink!  She explained<br/>\nevery picture which included an angel/devil character<br/>\nand a bully boy, and many plot lines!<br/>\n<br/>\nToday we&#39;re invited to the university&#39;s bug lab.  It<br/>\nis right by the french fry sculpture which is pretty<br/>\nclose to our campus&#39;s famous ice-cream which is pretty<br/>\nclose to my favorite homemade bread shop which is<br/>\nright off the bus stop which is all within walking<br/>\ndistance of my mom&#39;s office.  <br/>\n<br/>\nTomorrow is our community&#39;s parade and event called<br/>\nApple Days with games and child-sized trains and meals<br/>\nand booths and tons of candy!  They also do this weird<br/>\nthing where they blast candy from a cannon and the<br/>\nkids go nuts.  I imagine we&#39;ll be freshly henna-ed and<br/>\nready for the world!<br/>\n<br/>\nLife is good.<br/>\n<br/>\nSarah Anderson-Thimmes <br/>\nLivin&#39;in Utah<br/>\n<br/>\nP.S. Every time I write a day-in-the-life account, I<br/>\nwish I could add all the other interesting things we<br/>\ntalked about, the hugs we exchanged, the &quot;I love you&quot;<br/>\nsign language, the shared sister moments, the tomatoes<br/>\nfrom the garden, the apples from the tree, etc.  I so<br/>\ndo not subscribe to Hemingway&#39;s Iceberg Theory when<br/>\ntalking about unschooling.<br/>\n<br/>\n<br/>\n__________________________________________________<br/>\nDo You Yahoo!?<br/>\nTired of spam?  Yahoo! Mail has the best spam protection around <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.yahoo.com\">http://mail.yahoo.com</a></div>","specialLinks":[]}],"prevTopicId":26940,"nextTopicId":26949}}