{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":218609473,"authorName":"b0b_5mith","from":"&quot;b0b_5mith&quot; &lt;rws@...&gt;","profile":"b0b_5mith","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Seeking some encouragement","postDate":"1113327885","msgId":105268,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQzaDFlZCszamQ0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGQzZ2cybit2Z3RxQGVHcm91cHMuY29tPg=="},"prevInTopic":105261,"nextInTopic":0,"prevInTime":105267,"nextInTime":105269,"topicId":105261,"numMessagesInTopic":0,"msgSnippet":"Hi Tempe, You certainly don t need to apologize about the length of your response. I loved reading it. I nearly got tears in my eyes, too. I know what you mean","messageBody":"<div id=\"ygrps-yiv-341283920\">Hi Tempe,<br/>\n<br/>\nYou certainly don&#39;t need to apologize about the length of your <br/>\nresponse. I loved reading it. I nearly got tears in my eyes, too. I <br/>\nknow what you mean about watching your little ones and just <br/>\nappreciating them for who and what they are right then and there. I <br/>\nremember taking Hannah to preschool two years ago and how she cried <br/>\nwhen we left her, how I couldn&#39;t carry her in from the car, because <br/>\nshe&#39;d struggle and not want me to put her down. And as I think back, <br/>\nI feel so sad and wonder &quot;why?&quot; Why was it so important that she go <br/>\nto preschool, or sign up for soccer, or do all the other things that <br/>\nall the other kids were doing? <br/>\n<br/>\nI feel like we were putting expectations on her to be something or <br/>\nsomeone that she wasn&#39;t ready to be and I feel bad about it now. My <br/>\ndaughter loved to learn even before we sent her to preschool. I can&#39;t <br/>\nsay that preschool has increase it any, and perhaps decreased it a <br/>\nlittle. The only thing that I feel preschool has done for her is <br/>\nteach her how to &quot;fit in&quot; in the social scene of the other preschool <br/>\nkids. And who really cares about that anyway?! She&#39;s learned how to <br/>\nwhine. She&#39;s mastered it actually. :) No doubt something that works <br/>\nwhen you&#39;re trying to convince another preschooler to play the game <br/>\nyou want to play, and likely something she sees modeled on a day-to-<br/>\nday basis.<br/>\n<br/>\nIt was nice to read about your family and I&#39;m glad that homeschooling <br/>\nand more specifically unschooling is working for you. I&#39;ll be sure to <br/>\nread your response to my wife (I plan to read them all to her) and <br/>\nI&#39;m sure she&#39;ll be encouraged by your experiences.<br/>\n<br/>\nThanks again for taking the time to write that &quot;long&quot; response. I <br/>\nenjoyed it all!<br/>\n<br/>\nBob</div>","specialLinks":[]},{"userId":3516795,"authorName":"Tempe","from":"&quot;Tempe&quot; &lt;ribit@...&gt;","profile":"maziegrace","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Seeking some encouragement","postDate":"1113310103","msgId":105261,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQzZ2cybit2Z3RxQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":105268,"prevInTime":105260,"nextInTime":105262,"topicId":105261,"numMessagesInTopic":0,"msgSnippet":"Hi Bob, My name is Tempe, and we ve been homeschooling since the fall. My daughter went to K last year in the public school. She did well, but to me, it all","messageBody":"<div id=\"ygrps-yiv-1226460140\">Hi Bob,<br/>\nMy name is Tempe, and we&#39;ve been homeschooling since the fall. My <br/>\ndaughter went to K last year in the public school. She did well, but <br/>\nto me, it all ended up feeling very packed. The amount of material <br/>\nthey are required to pack in in a year seemed so much. She learned <br/>\nto read, which on one hand is good, and on the other hand I&#39;m of the <br/>\nmind that I think doing that in K is a little early. At the time, I <br/>\nwas still working full time and very pregnant with our third child, <br/>\nso homeschooling didn&#39;t seem like a possibility. But by April, I <br/>\nleft work and stayed at home with the two youngest. And by April my <br/>\ndaughter was coming home saying school was &quot;boring...all we do is <br/>\nwork, work, work.&quot;<br/>\n<br/>\nI was already thinking about homeschooling (I had thought about it <br/>\nsince before we had kids) and had read lots (I highly recommend John <br/>\nHolt - Teach Your Own and Learning All the Time are two I&#39;ve read, <br/>\nLinda Dobson, Ann Larson Fischer).<br/>\n<br/>\nAnyway, I used the summer as a trial period to see how it might be <br/>\nstaying home all the time with three. It was great. We went to the <br/>\nbeach, had playdates, went to a few fairs and festivals and mostly <br/>\nplayed!<br/>\n<br/>\nI had been thinking about maybe making up my own curriculum, or <br/>\nmaybe unschooling, but started feeling anxious just before <br/>\nthe &quot;official&quot; school year started. And yet I could see how the kids <br/>\nwere indeed &quot;learning all the time&quot;. It&#39;s amazing to witness! <br/>\nNeedless to say I started the year with some bought curriculum, and <br/>\nthere were some really good books we read from it, but overall by <br/>\nthe end of the first quarter, it felt like i was pulling teeth. My <br/>\ndaughter was resistant to daily reading aloud, and to the math <br/>\nworkbook, and one day I just followed my heart and said to myself&quot; <br/>\nOkay, I&#39;ll try it for a few days (unschooling), and ujst see what <br/>\nhappens.&quot; Well, it was two days later that I found my daughter and <br/>\nson (4) curled up in their closet and she was reading to him. It <br/>\nbrought tears to my eyes. Once i took the pressure off, she did this <br/>\nstuff on her own, because she wanted to! And they played and played <br/>\nall day. That was all I needed. I could see that in everything we <br/>\ndid in a day they were learning. From then on we&#39;ve been <br/>\nunschooling. <br/>\n<br/>\nMy daughter is learning math and amazes me what she can figure out <br/>\nin her head on her own, but we&#39;re not using workbooks and I&#39;m not <br/>\nquizzing her, it just happens in our daily life. We weigh things at <br/>\nthe store. We compare things - size, weight, whatever.We play games <br/>\nwith money and the kids pay for things with their own money <br/>\nsometimes. A lot of what the kids do is play, but i can see that <br/>\nthey learn so much from that. We play board games, we read a lot <br/>\nbefore bedtime, we paint, cut, glue, listen to all sorts of music. <br/>\nShe doesn&#39;t write a lot, but she can when she wants to. She asks for <br/>\nhelp spelling what she wants. We take walks and talk about things we <br/>\nsee. My daughter fell in love with a song we have by Mary Chapin <br/>\nCarpenter, called &quot;Halley came to Jackson&quot;. We have it on a tape <br/>\nthat has that same song on both sides, so it will play over and over <br/>\nin our car tape deck - That song got us talking about comets, and <br/>\nabout Halley and Hale-Bopp and that I had seen Hale-Bopp, and how <br/>\nold would each of us be the next time Halley comes around (every 76 <br/>\nyrs). And so on and so on.<br/>\n<br/>\nMy experience has been that you just have to try it and be open to <br/>\nseeing all kids learn in just living everyday life. And as others <br/>\nhave said, you can put things in their path and if it interests <br/>\nthem, you can go with helping them find out more of what they want <br/>\nto know/experience.<br/>\n<br/>\nSorry this is long. I have one more thing...not a day goes by when i <br/>\ndon&#39;t think about how grateful i am to be at home with my kids <br/>\nhomeschooling. It&#39;s often when we&#39;re outside playing, and I think <br/>\nabout how &quot;right now my daughter would be inside, in school&quot; or the <br/>\nbus goes by at 4 and I think, &quot;Winter would just be getting home <br/>\nnow!&quot;<br/>\n<br/>\nGood luck! And Easy Does It...The idea of unschooling can be <br/>\noverwhelming because it is unstructured, but it&#39;s worth it.<br/>\n<br/>\nTempe</div>","specialLinks":[]}],"prevTopicId":105252,"nextTopicId":105260}}