{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] How to explain unschooling to my children","postDate":"1325992575","msgId":64790,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY4MDQwQzUyLTk2QzgtNDhGMi05MDE5LTU5NzIxRDAyM0U4MkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDEzMjU5NzE4MzYuMzg5MTguWWFob29NYWlsTmVvQHdlYjEyMjUxNy5tYWlsLm5lMS55YWhvby5jb20+","referencesHeader":"PGplOHNzNCtoMWo0QGVHcm91cHMuY29tPiA8MTMyNTk3MTgzNi4zODkxOC5ZYWhvb01haWxOZW9Ad2ViMTIyNTE3Lm1haWwubmUxLnlhaG9vLmNvbT4="},"prevInTopic":64782,"nextInTopic":0,"prevInTime":64789,"nextInTime":64791,"topicId":64768,"numMessagesInTopic":0,"msgSnippet":"-= While they are happily in their own zones, bring them snacks and cuddles, read about unschooling, do kind acts of servitude towards them.  This is your","messageBody":"<div id=\"ygrps-yiv-223429330\">-= While they are happily in their own zones, bring them snacks and cuddles, read about unschooling, do kind acts of servitude towards them.  This is your chance at practicing patience and kindness towards your children.-=-<br/>\n<br/>\nDon&#39;t read to the children about unschooling. :-)<br/>\n<br/>\n-=-My question is how do I expain this to my children. How do I make them understand that they can learn without using texts and workbooks and without me spoonfeeding them the states standards-=-<br/>\n<br/>\nI wouldn&#39;t say anything like that at all.  <br/>\nI would say &quot;I don&#39;t want to use a curriculum&quot; (if they ask).<br/>\nOr &quot;I know I used to say we had to do that, but now I think I might have been wrong; let&#39;s go without it for a while and see how it goes.&quot;<br/>\n<br/>\n-=- While they are happily in their own zones, bring them snacks and cuddles, read about unschooling, do kind acts of servitude towards them. -=-<br/>\n<br/>\nActs of service might be a better way to think of that.  &quot;Servitude&quot; feels harsh, like a person doesn&#39;t have much choice.  <br/>\n<br/>\nHere are some nice ideas about doing things for others generously:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/chores/gift\">http://sandradodd.com/chores/gift</a><br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] How to explain unschooling to my children","postDate":"1325971836","msgId":64782,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMjU5NzE4MzYuMzg5MTguWWFob29NYWlsTmVvQHdlYjEyMjUxNy5tYWlsLm5lMS55YWhvby5jb20+","inReplyToHeader":"PGplOHNzNCtoMWo0QGVHcm91cHMuY29tPg==","referencesHeader":"PGplOHNzNCtoMWo0QGVHcm91cHMuY29tPg=="},"prevInTopic":64778,"nextInTopic":64790,"prevInTime":64781,"nextInTime":64783,"topicId":64768,"numMessagesInTopic":0,"msgSnippet":" ***I know that we need to do some deschooling before we can begin to unschool. My question is how do I expain this to my children. How do I make them","messageBody":"<div id=\"ygrps-yiv-1968351045\"> ***I know that we need to do some deschooling before we can begin to unschool. My question is how do I expain this to my children. How do I make them understand that they can learn without using texts and workbooks and without me spoonfeeding them the states standards. ***<br/>\n<br/>\nYou could tell them that you guys are going to try something different.  Perhaps ask them what they want to have more time to do.  Sit down with a weekly/monthly schedule and fill it in with those things.  Add to it, other outings that you guys want to try.  Include the familiar, like going to the library.<br/>\n<br/>\nAs the weeks go by and the month moves past, take note of what they&#39;ve done and what they&#39;ve enjoyed and make a new schedule and put those things on it.  Don&#39;t pressure to stay on schedule, don&#39;t pressure them to do any of the things on your schedule, just take note of what was done and what was enjoyed.  If, one day, they wake up and don&#39;t want to go to the library, say, &quot;no problem, what would you like to do instead?&quot;  Then do that thing, even if that thing is watching TV all day.  Whatever it is, find the enjoyment in it, see the potential for learning in it.<br/>\n<br/>\nYou might find them relaxing into doing nothing for a while and then you can relax and know that deschooling is at work.  While they are happily in their own zones, bring them snacks and cuddles, read about unschooling, do kind acts of servitude towards them.  This is your chance at practicing patience and kindness towards your children.<br/>\n<br/>\nAs the season changes, offer seasonally interesting things to enjoy, Farmer&#39;s Markets, gardening, walks in parks, playground activities, etc.  Do it ONLY because it sounds fun.  Shine a little light into what they are already into.  Like the difference between sitting in a dark living room with the curtains drawn, or opening them up to let the world in a bit.<br/>\n<br/>\nIf they ask about doing worksheets, ask them if they want to do them.  If they do, let them and hold no attachment to the outcome.  You could arrange the table with all kinds of things, like rulers and markers and scissors and paper and glue and googly eyes and set the worksheets right there in the mix.  You could say that you want the activity to be more interesting and to have fun.  Leave the room, go clean a bathroom or fold some laundry.  Set life up to be fun and interesting and take yourself out of the mix if you think you might be a fun ruiner in the moment. <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: How to explain unschooling to my children","postDate":"1325955693","msgId":64778,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGplOXRwZCt0dWM2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGplOHNzNCtoMWo0QGVHcm91cHMuY29tPg=="},"prevInTopic":64772,"nextInTopic":64782,"prevInTime":64777,"nextInTime":64779,"topicId":64768,"numMessagesInTopic":0,"msgSnippet":"... *************** What are they asking? If they re not asking anything, don t explain at this point. If they re asking are we doing homeschool? tell them","messageBody":"<div id=\"ygrps-yiv-2131313705\">&quot;Amy&quot; &lt;amymodlin@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;My question is how do I expain this to my children.  How do I make them understand that they can learn without using texts and workbooks and without me spoonfeeding them the states standards.<br/>\n </span></blockquote>***************<br/>\n<br/>\nWhat are they asking? If they&#39;re not asking anything, don&#39;t explain at this point. If they&#39;re asking &quot;are we doing homeschool?&quot; tell them you want to take a break for awhile, but maybe don&#39;t go into why just yet. If they&#39;re interested, it&#39;s okay to let them know you&#39;re learning some new things about how people learn - that maybe there&#39;s a better way than the kind of homeschooling you&#39;ve been doing, and you want to try to understand that before you go on. Tell them, if they&#39;re worried, that they won&#39;t have any trouble catching up later - kids take whole years off school to travel or go in the hospital, after all. <br/>\n<br/>\nWhen Ray left school, his biggest worry about &quot;unschooling&quot; was that there was some secret, hidden agenda, like he was supposed to figure out what he &quot;needed to learn&quot; and do it on his own. So it helped him to know that wasn&#39;t the case. At that point, he had an aversion to &quot;learning&quot; and associated it with school, so I told him he didn&#39;t have to learn anything if he didn&#39;t want to. I wouldn&#39;t say that to a kid who valued academics, though, it might come across as belittling. To Ray, it was a relief. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] How to explain unschooling to my children","postDate":"1325940381","msgId":64772,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFGM0RGOTg5LTg2REEtNEY5Ni1CMEM4LTUwNDFGMzhCMzFEMUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGplOHNzNCtoMWo0QGVHcm91cHMuY29tPg==","referencesHeader":"PGplOHNzNCtoMWo0QGVHcm91cHMuY29tPg=="},"prevInTopic":64768,"nextInTopic":64778,"prevInTime":64771,"nextInTime":64773,"topicId":64768,"numMessagesInTopic":0,"msgSnippet":"... How do you make them understand math? Or make them understand kindness? Or make them understand the purpose of talking? When you started a new curriculum,","messageBody":"<div id=\"ygrps-yiv-1217344707\">On Jan 7, 2012, at 2:39 AM, Amy wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; How do I make them understand<br/>\n<br/>\n </span></blockquote>How do you make them understand math? Or make them understand kindness? Or make them understand the purpose of talking?<br/>\n<br/>\nWhen you started a new curriculum, did you sit them down and make them understand why you were doing a different curriculum from last year?<br/>\n<br/>\nExpect them not to understand before hand. The beauty of natural learning is people don&#39;t need to understand in order to do. People just do and then they think about what&#39;s happening, think about what they like and what they don&#39;t like, figure out what works for them and what doesn&#39;t and why.<br/>\n<br/>\nTell them you want to do something completely different. Give them a sentence or two over view -- &quot;We&#39;re not going to do curriculum this time. We&#39;re going to explore whatever interests you,&quot; -- and then do :-)<br/>\n<br/>\nDo be prepared that they might ask for curriculum at some point. The pre- and early teens are times when kids sometimes get &quot;learning restless&quot; and think packaged learning is what will fix that. Let them pick out some workbooks and such from Barnes and Noble. Let them take classes. Let them get some kits. Let them explore ways to scratch that restless itch.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":464512853,"authorName":"Amy","from":"&quot;Amy&quot; &lt;amymodlin@...&gt;","profile":"amymodlin@ymail.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"How to explain unschooling to my children","postDate":"1325921988","msgId":64768,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGplOHNzNCtoMWo0QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":64772,"prevInTime":64767,"nextInTime":64769,"topicId":64768,"numMessagesInTopic":0,"msgSnippet":"I have not been on this list very long, but have posted a couple of times already.  I began homeschooling the fall of 2010.  My son is 11 and daughter is 10.","messageBody":"<div id=\"ygrps-yiv-597425732\">I have not been on this list very long, but have posted a couple of times already.  I began &quot;homeschooling&quot; the fall of 2010.  My son is 11 and daughter is 10.  I bought a curriculum and started to school.  Our days were mostly miserable because I was &quot;teaching&quot; them because that is what I thought I had to do.  Then, I met few unschoolers and became curious.  Curious was as far as I got.<br/>\n<br/>\nThis year began with a whole new curriculum.  By the end of the 2nd week, I was searching for someone to buy my mistake.  Every time someone asked me how homeschooling was going, I always said, &quot;okay.&quot;  Of course, it was anything but okay, but I was feeling like a failure and didn&#39;t want to admit it to anyone.  Then, a few weeks ago, someone asked me that same question.  My answer was a little different this time.  I said, &quot;I love having them home, I just don&#39;t like teaching them.&quot;<br/>\n<br/>\nSince joining this list, I have thought many times about dropping this yahoo group.  I am so glad that I didn&#39;t.  I know that we need to do some deschooling before we can begin to unschool.  My question is how do I expain this to my children.  How do I make them understand that they can learn without using texts and workbooks and without me spoonfeeding them the states standards.</div>","specialLinks":[]}],"prevTopicId":64777,"nextTopicId":64687}}