{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":179814481,"authorName":"puppyrat4750","from":"&quot;puppyrat4750&quot; &lt;puppyrat4750@...&gt;","profile":"puppyrat4750","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Please Check this out!","postDate":"1082503959","msgId":19327,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM2NGJ1bitoN3YwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAxOGIwMWM0MjcyYiQxM2M2YTkwMCQwMjAwYThjMEBUaW5rZXJiZWxsPg=="},"prevInTopic":19326,"nextInTopic":0,"prevInTime":19326,"nextInTime":19328,"topicId":19299,"numMessagesInTopic":0,"msgSnippet":"... you ll become about unschooling!   Especially if your daughter s personality is at odds with the school structure and their preferred learning styles","messageBody":"<div id=\"ygrps-yiv-1247088305\">-- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;24hrmom&quot; &lt;24hrmom@s...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt; And the more you learn about learning, the more certain <br/>\n </span></blockquote>you&#39;ll become about unschooling! &lt;grin&gt;  Especially if your <br/>\ndaughter&#39;s personality is at odds with the school structure and their <br/>\npreferred learning styles (just sit there and listen).  And you&#39;re <br/>\nright, I&#39;ve also found that the better I understand unschooling, the <br/>\nbetter I treat my kids.&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nI&#39;m SO certain!  There are other things that need to happen first <br/>\n(see below).<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;&gt; After you&#39;ve spent years trying to work with schools and <br/>\n </span></blockquote>teachers and and you suddenly come across unschooling it just makes <br/>\nso much sense immediately!&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nYes!  I&#39;m so tired of trying to deal with the schools.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;&gt;&gt; As for why she can&#39;t come home tomorrow, you could work on <br/>\n </span></blockquote>those reasons! &lt;grin&gt;  Bring them here and maybe some people will <br/>\nhave some great suggestions to help.  Maybe try to make her summer <br/>\nvacation so cool and unschooly that she doesn&#39;t want to bother going <br/>\nback.  If it&#39;s her friends she thinks she&#39;d miss, make sure she sees <br/>\nthem lots during the summer so she realizes that she doesn&#39;t have to <br/>\ngo to school just to hang with them.....&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nThe reasons we can&#39;t do it now are financial.  We&#39;re working towards <br/>\na change and hopefully by late fall we can make a move.  The <br/>\nlightbulb went off in my head quit quickly regarding unschooling and <br/>\nwhat it is.  My daughter and I have almost daily discussions about <br/>\nhomeschooling/unschooling.  Knowing her as well as I do, I know <br/>\nshe&#39;s &quot;getting&quot; what it&#39;s all about, but I also know that it&#39;s going <br/>\nto take her a long time to change her mindset (which is ok).  She&#39;s <br/>\nbeen in daycare and ps all her life, she doesn&#39;t handle transitions <br/>\nor sudden changes well (she needs to work it out in her mind, her <br/>\ninternal picture of the world needs to adjust).  I want her to be <br/>\nready, she has her own reasons and I respect that.  <br/>\n<br/>\nYes, she&#39;s concerned about not seeing friends, but I know she will <br/>\nmake new ones.  She doesn&#39;t see them over the summers much anyway, so <br/>\nI&#39;m not too concerned about her ability to adjust to this.  Plus <br/>\nshe&#39;ll make many NEW friends of all different ages.  But I have to <br/>\nlet her work this out for herself.  It will happen.<br/>\n<br/>\nI have to continue to work full-time through the fall, which includes <br/>\nsummer camp for her.  We have some get-aways planned (we just bought <br/>\na trailer last year) and will be building a new house/selling the one <br/>\nwe&#39;re in.  Until then, we do what we can to make school less <br/>\nstressful.  We&#39;ll get through it (because we have a goal and we know <br/>\nwhat we have to do to get it). <br/>\n<br/>\nThanks for your thoughts!  Even though I&#39;m &quot;sold&quot; on unschooling, <br/>\nit&#39;s going to take me a while to adjust my language, perceptions, <br/>\ncomments, (automatic) thoughts, etc etc...!  <br/>\nJann</div>","specialLinks":[]},{"userId":135843572,"authorName":"24hrmom","from":"&quot;24hrmom&quot; &lt;24hrmom@...&gt;","profile":"learn2day2002","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Please Check this out!","postDate":"1082501943","msgId":19326,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxOGIwMWM0MjcyYiQxM2M2YTkwMCQwMjAwYThjMEBUaW5rZXJiZWxsPg==","referencesHeader":"PGM2MjBoMitmdWhlQGVHcm91cHMuY29tPg=="},"prevInTopic":19318,"nextInTopic":19327,"prevInTime":19325,"nextInTime":19327,"topicId":19299,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1894355950\">&lt;&lt; puppyrat4750 wrote: What&#39;s an IRL? &gt;&gt;<br/>\n<br/>\nSorry! It means &quot;In Real Life&quot;.<br/>\n<br/>\n&lt;&lt; I am new to homeschooling and especially unschooling, so if you try to look at my comments from the point of view of someone who has never hs/us and has been stuck fighting the schools, you&#39;ll perhaps understand. &gt;&gt;<br/>\n<br/>\nHaving spent enough time dealing with schools myself I think I do understand.  I just wanted to give you another perspective.<br/>\n<br/>\n&lt;&lt; It HAS changed the way I treat my daughter to now understand unschooling.  For some of us, we need to learn more about learning, if that means understanding learning styles, that works for me! &gt;&gt;<br/>\n<br/>\nAnd the more you learn about learning, the more certain you&#39;ll become about unschooling! &lt;grin&gt;  Especially if your daughter&#39;s personality is at odds with the school structure and their preferred learning styles (just sit there and listen).  And you&#39;re right, I&#39;ve also found that the better I understand unschooling, the better I treat my kids.<br/>\n<br/>\n&lt;&lt; I&#39;ve only been learning about unschooling for a few weeks, but in those weeks I&#39;ve come to embrace the whole idea and I know it&#39;s right for my daughter. &gt;&gt;<br/>\n<br/>\nI know what you mean ... I found out about homeschooling and after only a couple of weeks discussion between dh and I they just didn&#39;t go back!  All three jumped at the chance to stay home.  After you&#39;ve spent years trying to work with schools and teachers and and you suddenly come across unschooling it just makes so much sense immediately!<br/>\n<br/>\n&lt;&lt; It&#39;s not going to happen today, or tomorrow, for many reasons, but I&#39;m learning as much as I can and I will be ready for her when the time comes. &gt;&gt;<br/>\n<br/>\n&lt;&lt; ... but also understand that, for now, I am in a place where I have to define things to the school to get her through (and she&#39;s moving on to MS in the fall, wants to go). &gt;&gt;<br/>\n<br/>\nAs for why she can&#39;t come home tomorrow, you could work on those reasons! &lt;grin&gt;  Bring them here and maybe some people will have some great suggestions to help.  Maybe try to make her summer vacation so cool and unschooly that she doesn&#39;t want to bother going back.  If it&#39;s her friends she thinks she&#39;d miss, make sure she sees them lots during the summer so she realizes that she doesn&#39;t have to go to school just to hang with them.  Try hard not to have her go back to a situation where she likely feels that she doesn&#39;t fit in, that she&#39;s &quot;dumb&quot; just because she doesn&#39;t learn the same way many of the other kids do ... I know that&#39;s how my son felt.  I am so glad he doesn&#39;t have to feel that way any more!<br/>\n<br/>\nPam L<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":179814481,"authorName":"puppyrat4750","from":"&quot;puppyrat4750&quot; &lt;puppyrat4750@...&gt;","profile":"puppyrat4750","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Please Check this out!","postDate":"1082426722","msgId":19318,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM2MjBoMitmdWhlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwMjkwMWM0MjYxZSRkMTkxNDc1MCQwMjAwYThjMEBUaW5rZXJiZWxsPg=="},"prevInTopic":19309,"nextInTopic":19326,"prevInTime":19317,"nextInTime":19319,"topicId":19299,"numMessagesInTopic":0,"msgSnippet":"... school and I was searching for labels to help the school & teachers understand him better.  I wanted them to understand him enough to treat him with","messageBody":"<div id=\"ygrps-yiv-2141323666\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;&gt;&gt; I came across the website 3-4 years back when my son was in <br/>\n </span></blockquote>school and I was searching for &quot;labels&quot; to help the school & teachers <br/>\nunderstand him better.  I wanted them to understand him enough to <br/>\ntreat him with respect, not as just a pain in the butt.  But I came <br/>\nto realize that with most teachers it had little to do with respect <br/>\nfor the children and much more to do with getting them to fit in.<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>I absolutely agree!<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; The thing was that while it was helpful to understand him a bit <br/>\n </span></blockquote>better in a larger context and to realize that there are other kids <br/>\nout there much like him (we&#39;d never really met any IRL), I found that <br/>\nthis knowledge didn&#39;t change the way we treated him.  Yes, it was <br/>\nnice to nod my head in agreement when they talked about the typical <br/>\nlearning style of these kids (in the same way I nodded to myself in <br/>\nagreement with a lot of stuff in Raising Your Spirited Child, Right-<br/>\nBrained Children in a Left-Brained World, and Whole Child / Whole <br/>\nParent to name a few), but did it (should it?) change the way we <br/>\ntreated him day-to-day?  No, we were already respectful of his <br/>\nchoices and his preferred way of doing things.  Most of <br/>\nthe &quot;suggestions&quot; to help cut down on conflict with these kids and <br/>\nhelp them learn he/we were already doing - not because we <br/>\nalready &quot;knew the label&quot;, but because we didn&#39;t try to force him into <br/>\na generic mould and we gradually came to many of these realizations <br/>\nall on our own.&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nWhat&#39;s an IRL? <br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;&gt; And since we discovered homeschooling (especially unschooling) <br/>\n </span></blockquote>there has been no need at all for any labels - not even thinking <br/>\nabout them.  There is no need to compare him with other kids or to <br/>\nfit him into a round hole.  He&#39;s just himself, in all his wonderful <br/>\nglory!  He is free to pursue his interests in whatever manner he <br/>\nchooses - visual-spatial style or not.  That is one of the wonderful <br/>\nfeatures of unschooling!&gt;&gt;&gt;&gt;<br/>\n<br/>\nAnd I hope to be there fully one day in the not too distant future!<br/>\n <br/>\nThanks for your input.  I am new to homeschooling and especially <br/>\nunschooling, so if you try to look at my comments from the point of <br/>\nview of someone who has never hs/us and has been stuck fighting the <br/>\nschools, you&#39;ll perhaps understand.  I&#39;ve only been learning about <br/>\nunschooling for a few weeks, but in those weeks I&#39;ve come to embrace <br/>\nthe whole idea and I know it&#39;s right for my daughter.  It&#39;s not going <br/>\nto happen today, or tomorrow, for many reasons, but I&#39;m learning as <br/>\nmuch as I can and I will be ready for her when the time comes.<br/>\n<br/>\nI don&#39;t see any book as &quot;the&quot; answer, but it certainly helps me <br/>\nunderstand my daughter better and how I can help her.  I read many <br/>\nbooks with an open mind, take what I like and leave the rest.  I&#39;m <br/>\nnot looking for a label, I can see how you would think that way, now <br/>\nthat I understand better how unschooling works (and that&#39;s NOT a <br/>\ncriticism!), but also understand that, for now, I am in a place where <br/>\nI have to define things to the school to get her through (and she&#39;s <br/>\nmoving on to MS in the fall, wants to go).  I don&#39;t have the option <br/>\nto pull her out today.  It HAS changed the way I treat my daughter to <br/>\nnow understand unschooling.  For some of us, we need to learn more <br/>\nabout learning, if that means understanding learning styles, that <br/>\nworks for me!<br/>\nJann</div>","specialLinks":[]},{"userId":135843572,"authorName":"24hrmom","from":"&quot;24hrmom&quot; &lt;24hrmom@...&gt;","profile":"learn2day2002","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Please Check this out!","postDate":"1082386727","msgId":19309,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMjkwMWM0MjYxZSRkMTkxNDc1MCQwMjAwYThjMEBUaW5rZXJiZWxsPg==","referencesHeader":"PGM1bjc4ait0MmJlQGVHcm91cHMuY29tPg=="},"prevInTopic":19304,"nextInTopic":19318,"prevInTime":19308,"nextInTime":19310,"topicId":19299,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-652912792\">&lt;&lt; I have been reading the most amazing book, &quot;Upside-Down Brilliance: The Visual Spatial Learner&quot; by Linda Kreger Silverman PhD. There&#39;s also a web site www.gifteddevelopment.com . &gt;&gt;<br/>\n<br/>\nI came across the website 3-4 years back when my son was in school and I was searching for &quot;labels&quot; to help the school & teachers understand him better.  I wanted them to understand him enough to treat him with respect, not as just a pain in the butt.  But I came to realize that with most teachers it had little to do with respect for the children and much more to do with getting them to fit in.<br/>\n<br/>\n&lt;&lt; I&#39;m still reading and absorbing - I URGE you to read this! It may help you in dealing with your gifted and unique children! &gt;&gt;<br/>\n<br/>\nThe thing was that while it was helpful to understand him a bit better in a larger context and to realize that there are other kids out there much like him (we&#39;d never really met any IRL), I found that this knowledge didn&#39;t change the way we treated him.  Yes, it was nice to nod my head in agreement when they talked about the typical learning style of these kids (in the same way I nodded to myself in agreement with a lot of stuff in Raising Your Spirited Child, Right-Brained Children in a Left-Brained World, and Whole Child / Whole Parent to name a few), but did it (should it?) change the way we treated him day-to-day?  No, we were already respectful of his choices and his preferred way of doing things.  Most of the &quot;suggestions&quot; to help cut down on conflict with these kids and help them learn he/we were already doing - not because we already &quot;knew the label&quot;, but because we didn&#39;t try to force him into a generic mould and we gradually came to many of these realizations all on our own.<br/>\n<br/>\nAnd since we discovered homeschooling (especially unschooling) there has been no need at all for any labels - not even thinking about them.  There is no need to compare him with other kids or to fit him into a round hole.  He&#39;s just himself, in all his wonderful glory!  He is free to pursue his interests in whatever manner he chooses - visual-spatial style or not.  That is one of the wonderful features of unschooling!<br/>\n<br/>\nA few months ago I came across the book you mentioned and I added it to my online cart and clicked &quot;Save for Later&quot;.  And you know, it&#39;s been there ever since.  Each time I look at it I think, what will change for me (and my son) by reading this book?  And I realize the answer is nothing!  So I save my money, putting it toward another video game (or game guide, or graphic novel etc.) for him. &lt;g&gt;<br/>\n<br/>\nPam L<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Please Check this out!","postDate":"1082379500","msgId":19304,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgwLjliOTdiMTMuMmRiNTI2ZWNAYW9sLmNvbT4="},"prevInTopic":19299,"nextInTopic":19309,"prevInTime":19303,"nextInTime":19305,"topicId":19299,"numMessagesInTopic":0,"msgSnippet":"In a message dated 4/19/04 5:20:57 AM, puppyrat4750@yahoo.com writes:  If they re unique,","messageBody":"<div id=\"ygrps-yiv-844704304\">In a message dated 4/19/04 5:20:57 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:puppyrat4750@...\">puppyrat4750@...</a> writes:<br/>\n<br/>\n&lt;&lt; It may help you in dealing with your gifted and unique <br/>\n<br/>\nchildren! &gt;&gt;<br/>\n<br/>\nIf they&#39;re unique, how can there be a book about them? &lt;g&gt;<br/>\n<br/>\nBe careful about thinking or saying &quot;gifted,&quot; too.  It can cause much harm <br/>\nand do little good.   <br/>\n<br/>\nIf you like the idea of the child being special and unique, maybe just use <br/>\nher name and details about her real life rather than labels whenever you can <br/>\nremember to.<br/>\n<br/>\nAnother thing (you&#39;ve probably already read it or about it, but there are <br/>\nalways people coming along for whom it&#39;s new) to consider is Howard Gardner&#39;s <br/>\ntheory of multiple intelligences.  People aren&#39;t one or two of them, they&#39;re <br/>\nvarious levels of most to all of them.  (Sometimes a person gets a miss on one or <br/>\nanother, but usually they have some of all.)  The first book about it was <br/>\nFrames of Mind, by Gardner, but there are other books and lots of websites.<br/>\n<br/>\nHere&#39;s one I had in favorite places:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.ibiblio.org/edweb/edref.mi.th.html\">http://www.ibiblio.org/edweb/edref.mi.th.html</a><br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":179814481,"authorName":"puppyrat4750","from":"&quot;puppyrat4750&quot; &lt;puppyrat4750@...&gt;","profile":"puppyrat4750","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Please Check this out!","postDate":"1082073171","msgId":19299,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM1bjc4ait0MmJlQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":19304,"prevInTime":19298,"nextInTime":19300,"topicId":19299,"numMessagesInTopic":0,"msgSnippet":"I have been reading the most amazing book, Upside-Down Brilliance: The Visual Spatial Learner by Linda Kreger Silverman PhD. There s also a web site","messageBody":"<div id=\"ygrps-yiv-59337852\">I have been reading the most amazing book, &quot;Upside-Down Brilliance: <br/>\nThe Visual Spatial Learner&quot; by Linda Kreger Silverman PhD. There&#39;s <br/>\nalso a web site  www.gifteddevelopment.com .  I am now convinced that <br/>\nmy daughter is NOT ADHD, but a visual-spatial learner with a central <br/>\nauditory processing disorder.  She had many ear infections in the <br/>\nfirst 3 yrs of her life and this is something the author attributes <br/>\nto this.   I&#39;m still reading and absorbing - I URGE you to read <br/>\nthis!  It may help you in dealing with your gifted and unique <br/>\nchildren!<br/>\nJann</div>","specialLinks":[]}],"prevTopicId":19321,"nextTopicId":19323}}