{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"The White&#39;s","from":"&quot;The White&#39;s&quot; &lt;jwwjr@...&gt;","replyTo":"LIST","senderId":"ntD5i1huLFcODdyFc5_mCXA70vdDiVAcvewED7mq3NR38q5jSkMAqPwo0eD-aYCGeOsciJqMX-PbkuEsAgj6bq7SoA5i1E1E","spamInfo":{"isSpam":false,"reason":"0"},"subject":"kid rant but new slant","postDate":"957905759","msgId":8467,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNTYwMWJmYmEyMCQ0ZDA3MzEyMCQyMWYyMGJkMEBuZW9jb21tLm5ldD4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":8466,"nextInTime":8468,"topicId":8467,"numMessagesInTopic":0,"msgSnippet":"Okay, I need to put a new slant on the kid rant thread.  I agree that you need to talk to a child who is at your house a lot about rules of the house & explain","messageBody":"<div id=\"ygrps-yiv-1285747514\">Okay, I need to put a new slant on the kid rant thread.  I agree that you<br/>\nneed to talk to a child who is at your house a lot about rules of the house<br/>\n& explain to them how you expect them to behave.<br/>\n<br/>\nMy problem is my husband&#39;s nieces.  We go on vacation with his family every<br/>\nyear for at least a week.  Usually my in-laws pick the nieces up & bring<br/>\nthem for the whole week although their Dad (my husband&#39;s brother) usually<br/>\nonly comes for a day or so.<br/>\n<br/>\nThe problem is that these girls, especially the oldest one, are very sneaky,<br/>\ndishonest and manipulative.  The oldest&#39;s favorite thing in the world is<br/>\ngetting someone else in trouble or making someone else cry.  She has NEVER<br/>\nbeen disciplined at all, there has NEVER been any consistancy in her life.<br/>\nThe few times Grandma and Grandpa came close to providing it they backed off<br/>\nbecause &quot;poor little thing has it so hard since the parents are divorced and<br/>\nMom is on Prozac&quot;.<br/>\n<br/>\nMy son is the same age (7) as they are (8 and 7).  He has wised up<br/>\nconsiderably and spends way too much time trying to &quot;change&quot; them.  I don&#39;t<br/>\nworry too much about him because he doesn&#39;t like to be around them anymore.<br/>\nBUT, my daughter (3)loves to go off into a room alone with them, especially<br/>\nthe older one.  She picks up way too much bad stuff, just in a week.  It<br/>\njust makes me very nervous.  The older one acts inappropriately also, doing<br/>\nthings like talking about genitalia and sex.<br/>\n<br/>\nMy husband and I tell our kids in front of the girls & in front of<br/>\nGrandma/Grandpa and their Dad that the girls are not our kids, we can&#39;t<br/>\ncontrol their behavior, but we can control our own kids&#39; behavior & they<br/>\nwill not act that way.  We also make a point to do lots of just our family<br/>\nstuff away from the others, but we can&#39;t do too much of that as it is a<br/>\nlarge family vacation.<br/>\n<br/>\nSince we are not in my home, I don&#39;t feel like I can make the house rules.<br/>\nI can only make the rules for my children & not allow them to play with the<br/>\nothers if the rules are not followed.  Sometimes this is so-so effective<br/>\nsince the nieces have learned that we will not include them or play with<br/>\nthem if they act ugly.  I told the older one last year when she began crying<br/>\nbecause my son would not play with her that I was not surprised and she<br/>\nshouldn&#39;t be either.  I asked her if she treated her friends at school the<br/>\nway she treats my children.  When she said no I asked her did she understand<br/>\nnow why my son didn&#39;t like her?  Would her friends at school like her if she<br/>\ntreated them the same?  I think she got it.<br/>\n<br/>\nAny suggestions?  Vacation time is quickly approaching.  Unfortunately I am<br/>\nalways the only Mother there, if you don&#39;t count Grandma.  I welcome any<br/>\nideas to keep my children safe and happy and to keep my relationship with my<br/>\nin-laws in tact (it&#39;s a good one).  They have a very blind-side with these<br/>\ngirls & I know talking to them won&#39;t help.  As the only Mom there I&#39;m<br/>\nexpected to do a lot for the nieces that I would not elect to do otherwise.<br/>\nWhen I am alone with them, away from the rest of the family, they do<br/>\nunderstand what my rules are and they follow them pretty well.  It&#39;s when we<br/>\nare all together that the problems start happening because the nieces know<br/>\nthey can get away with it.  HELP!<br/>\n<br/>\nThanks!<br/>\nCindy</div>","specialLinks":[]}],"prevTopicId":8461,"nextTopicId":8468}}