{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":9,"messages":[{"userId":159022987,"authorName":"Olga","from":"&quot;Olga&quot; &lt;mccluskieo@...&gt;","profile":"britcontoo","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: the book and this list","postDate":"1064449371","msgId":81471,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJrdGNncit1b3E4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGUuMzVkZWYxYWIuMmNhMjA1ODBAYW9sLmNvbT4="},"prevInTopic":81433,"nextInTopic":0,"prevInTime":81470,"nextInTime":81472,"topicId":81325,"numMessagesInTopic":0,"msgSnippet":"Kelly, ... the WORLD ... Talk about a great little reminder for me when I start to feel uncertain.  Although, it seems things are finally clicking here.  I ","messageBody":"<div id=\"ygrps-yiv-67892981\">Kelly,<br/>\n<br/>\nI just love this statement:<br/>\n<blockquote><span title=\"ireply\">  &gt; <br/>\n&gt; Again, unschooling is living as if school didn&#39;t exist---not as if <br/>\n </span></blockquote>the WORLD <br/>\n<blockquote><span title=\"ireply\"> &gt; didn&#39;t!<br/>\n&gt; <br/>\n&gt; ~Kelly<br/>\n&gt; <br/>\n </span></blockquote>Talk about a great little reminder for me when I start to feel <br/>\nuncertain.  Although, it seems things are finally clicking here.  I <br/>\nfinally get things that I was still trying to grasp early this <br/>\nyear.  I can see the learning full circle around us.  For example, <br/>\nmy son is playing Zelda with his Dad.  In this version you sail a <br/>\nboat and have to decide how to navigate it based on a map with <br/>\nislands.  Here is my 5yo figuring out which way to go and I thought <br/>\nthat has to beat those stupid map worksheets we used to do in <br/>\nschool.  Remember, you are here, the school is 2 blocks north, blah, <br/>\nblah, blah.  There is no decision to teach maps, it is just <br/>\nhappening as we play.    Pretty cool. <br/>\n<br/>\nOlga :)</div>","specialLinks":[]},{"userId":92084939,"authorName":"Heidi","from":"&quot;Heidi&quot; &lt;bunsofaluminum60@...&gt;","profile":"heidic40","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: the book and this list","postDate":"1064421524","msgId":81433,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJrc2hhays1Z2diQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE3My4xZmZlMTdhNy4yY2EzMWM4MUBhb2wuY29tPg=="},"prevInTopic":81425,"nextInTopic":81471,"prevInTime":81432,"nextInTime":81434,"topicId":81325,"numMessagesInTopic":0,"msgSnippet":"You know what s funny...before coming across a late starting reader I was a purely phonics type, believing all the writing out there about how you must","messageBody":"<div id=\"ygrps-yiv-938382582\">You know what&#39;s funny...before coming across a &quot;late starting reader&quot; <br/>\nI was a &quot;purely phonics&quot; type, believing all the writing out there <br/>\nabout how you must teach reading by phonics, or they won&#39;t learn how <br/>\nto read. Deep, analytical, take it apart and put it back together, <br/>\ntype phonics (love it! L)<br/>\n<br/>\nBut Katie taught me that all the phonics in the world is totally <br/>\nuseless to a brain that isn&#39;t ready to read. <br/>\n<br/>\nMy kids also taught me that, if they&#39;re not into it, they aren&#39;t <br/>\ngoing to learn. KONOS is a cool curriculum, jam-packed with hands-on <br/>\nideas about TONS of subjects. Heavy on History and Natural Science. <br/>\nWe had the most wonderful times with Medieval History and Eyesight <br/>\nand Light, using ideas from KONOS...and then I decided it was time to <br/>\nlearn about plants.<br/>\n<br/>\nwow! even my little scientist Abbie was &quot;no thanks.&quot; and all my <br/>\nwonderful plans for them simply fizzled out. <br/>\n<br/>\nWhat I&#39;m trying to say is, when it was all written out and I was <br/>\nreading about this stuff: how to make a lesson plan, how to teach <br/>\nreading, and the belief that there is knowledge that everyone needs <br/>\nto have and it is my job to hand them that knowledge...well, when I <br/>\nwas merely reading/preparing for educating my kids, I was in total <br/>\nagreement with that philosophy. When I actually got into it and was <br/>\ndoing/trying to do what was shown forth by &quot;the experts&quot;...it was a <br/>\ndifferent story altogether. My kids taught me this much: learning <br/>\ncomes from them, not from me. When I finally grasped that, and let go <br/>\nof the idea that *I* and *I alone* must be their teacher, is when we <br/>\nbegan to be joyful and happy with each other. Wanting to be together, <br/>\nwe spend time trying new things, doing old favorite things, visiting, <br/>\nhanging out...what&#39;s not to love? LOL<br/>\n<br/>\nblessings, HeidiC<br/>\n<br/>\n<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; When I was in college and was assigned to read John Holt, the <br/>\n </span></blockquote>professor told <br/>\n<blockquote><span title=\"ireply\"> &gt; me teaching was nonexistent.  There was no action, and that if <br/>\n </span></blockquote>teaching were a <br/>\n<blockquote><span title=\"ireply\"> &gt; legitimate transitive verb, you must be able to affect the object, <br/>\n </span></blockquote>but that <br/>\n<blockquote><span title=\"ireply\"> &gt; all the learning that takes place in a student takes place inside <br/>\n </span></blockquote>him on his <br/>\n<blockquote><span title=\"ireply\"> &gt; terms.  <br/>\n&gt; <br/>\n&gt; The term they wanted us to understand and strive to become <br/>\n </span></blockquote>was &quot;facilitator <br/>\n<blockquote><span title=\"qreply\"> &gt; of others&#39; learning.&quot; </span></blockquote></div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: the book and this list","postDate":"1064419969","msgId":81425,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE3My4xZmZlMTdhNy4yY2EzMWM4MUBhb2wuY29tPg=="},"prevInTopic":81417,"nextInTopic":81433,"prevInTime":81424,"nextInTime":81426,"topicId":81325,"numMessagesInTopic":0,"msgSnippet":"-=-Having read quite a bit of John Holt and done with him as I do with every author (keep what is good, toss what I can t use), I find his ideas about teaching","messageBody":"<div id=\"ygrps-yiv-757460272\">-=-Having read quite a bit of John Holt and done with him as I do with <br/>\n<br/>\nevery author (keep what is good, toss what I can&#39;t use), I find his <br/>\n<br/>\nideas about teaching to be reality based. I can&#39;t believe he was <br/>\n<br/>\nopposed to teaching, having been an educator himself for how long? I <br/>\n<br/>\nknow from experience, that you can NOT teach a kid something he is <br/>\n<br/>\nnot ready to learn...Katie&#39;s reading as my favorite case in point.-=-<br/>\n<br/>\nWhen I was in college and was assigned to read John Holt, the professor told <br/>\nme teaching was nonexistent.  There was no action, and that if teaching were a <br/>\nlegitimate transitive verb, you must be able to affect the object, but that <br/>\nall the learning that takes place in a student takes place inside him on his <br/>\nterms.  <br/>\n<br/>\nThe term they wanted us to understand and strive to become was &quot;facilitator <br/>\nof others&#39; learning.&quot;<br/>\n<br/>\nI&#39;m a facilitator of a LOT of people&#39;s learning, and have been my whole life. <br/>\n I was the sex-ed source for kids my age from the time I was nine, but I <br/>\nnever &quot;taught a class&quot; or prepared a lesson.  I answered questions and found <br/>\nresources.  I&#39;ve &quot;taught&quot; a lot of people vocal music, but what I did was find a <br/>\nsong, help them with their parts if they needed help, and then sing with them <br/>\nuntil we were all singing it without thinking very hard and it seemed natural.  <br/>\nI&#39;ve helped other people do all kind of things in everyday life because I&#39;ve <br/>\nalways been good at understanding procedures.   I was facilitating.<br/>\n<br/>\n-=-So, the question. Is this list anti-teaching? Is unschooling really <br/>\n<br/>\nabout a parent not purposely teaching their children anything?-=-<br/>\n<br/>\nI&#39;m against &quot;purposely teaching&quot; if the purpose is to try to wrest learning <br/>\naway from a child and turn it to traditional top-down delivery of information <br/>\npresented on a schedule.  And for most people, that&#39;s what &quot;teaching&quot; means.   <br/>\nI own information and will dole it out to you in 45 minute dollops, and it is <br/>\nyour DUTY to be attentive and apply yourself to learning, or you have wasted <br/>\nyour teacher&#39;s time.<br/>\n<br/>\nIsn&#39;t that the way it goes?  Teachers aren&#39;t accused of wasting their <br/>\nstudents&#39; time, but students who already know and so are distracted, or can&#39;t fathom <br/>\nat all what the guy&#39;s talking about, or who don&#39;t give a damn are accused of <br/>\nwasting their teacher&#39;s time.<br/>\n<br/>\n<br/>\n-=-For instance, I purposely taught about cutting up potatoes yesterday. <br/>\n<br/>\nAnd my hubby has purposely taught about chopping wood and laying a <br/>\n<br/>\nfire.-=-<br/>\n<br/>\nYou don&#39;t know that you &quot;taught&quot; them.  You talked about the best ways and <br/>\nthe dangers and you demonstrated.  If they already knew you didn&#39;t teach them.  <br/>\nIf they were wishing really hard to be elsewhere and so won&#39;t remember the <br/>\nnext time what you said, you didn&#39;t teach them.   If they really wanted to learn <br/>\nto cut up potatoes yesterday, they learned.  Your talking and doing was part <br/>\nof what they needed to learn.  If you&#39;re sure you taught, try teaching your <br/>\ndog, or a kid who can&#39;t use her hands at all, or someone who sees a knife and <br/>\njust wants to kill you with it and leave a message spelled out in potato-parts.   <br/>\n<br/>\n<br/>\n-=-Maybe it&#39;s the lack of a formal curriculum that makes Ms. Withrow <br/>\n<br/>\nnervous. Yet, if it came right down to it, and a kid wanted to know a <br/>\n<br/>\nlot about something, I&#39;d lay out a course, based on my experience and <br/>\n<br/>\nknowledge...&quot;course&quot; being the English translation of the word <br/>\n<br/>\ncurriculum.-=-<br/>\n<br/>\n&quot;Course&quot; is  where horses run.  You set a course, and you  make each horse <br/>\nfollow it in the same direction.  <br/>\n<br/>\n&lt;&lt; Maybe!!! oh, this is it, I bet. Maybe she wants me to lay <br/>\n<br/>\nout that course and set my kids on it, whether they want to learn <br/>\n<br/>\nabout the topic or not.&gt;&gt;<br/>\n<br/>\nWell DUH! &lt;g&gt;<br/>\n<br/>\n&lt;&lt; But I&#39;m not going to try and teach something that they aren&#39;t ready to <br/>\n<br/>\nlearn.&gt;&gt;<br/>\n<br/>\nSounds like you&#39;re against teaching, because part of what she means is the <br/>\nparent is in charge of when and what.<br/>\n<br/>\nSounds like your an unschooler who understands that a kid who&#39;s ready WANTS <br/>\nto learn and will appreciate help, and that trying to teach a child something <br/>\nhe doesn&#39;t want is going to hamper unschooling.<br/>\n<br/>\nPeople who want to be the teachers need to dislike unschoolers and find us <br/>\nwrong and lazy.  If they see or admit that our kids are doing well and we&#39;re <br/>\nspending quite a bit of energy and thought making sure that&#39;s true, then they <br/>\nhave a choice and they&#39;ve chosen something difficult and somewhat unworkable.   <br/>\nThen they&#39;re mad at us for having more fun.<br/>\n<br/>\nThis, I think, was the author&#39;s gut-level premise:<br/>\nIf two ways both work, the one that&#39;s least fun must be the most moral.<br/>\nIf it tastes bad it must be good for you.<br/>\nIf it feels good, don&#39;t do it.<br/>\n<br/>\nIt&#39;s much easier to condemn people who are having more fun than you are.<br/>\n<br/>\nBut back to teach/learn, here&#39;s why I think clarity about the difference is <br/>\nimportant, and I saved it in a more permanent place than these e-mails:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/wordswords\">http://sandradodd.com/wordswords</a><br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":70316959,"authorName":"AimeeL73@cs.com","from":"AimeeL73@...","profile":"aimeel73","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] the book and this list","postDate":"1064416828","msgId":81417,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNy4yNTRkNjY1MS4yY2EzMTAzY0Bjcy5jb20+"},"prevInTopic":81407,"nextInTopic":81425,"prevInTime":81416,"nextInTime":81418,"topicId":81325,"numMessagesInTopic":0,"msgSnippet":"... Oh, oh, oh!!  I LOVE THAT!!  LOL ~Aimee [Non-text portions of this message have been removed]","messageBody":"<div id=\"ygrps-yiv-1954972636\"><a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kbcdlovejo@...\">kbcdlovejo@...</a> writes: <br/>\n<blockquote><span title=\"ireply\"> &gt; Again, unschooling is living as if school didn&#39;t exist---not as if the <br/>\n&gt; WORLD <br/>\n&gt; didn&#39;t!<br/>\n&gt; <br/>\n&gt; ~Kelly<br/>\n<br/>\n<br/>\n </span></blockquote>Oh, oh, oh!!  I LOVE THAT!!  LOL <br/>\n<br/>\n~Aimee<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":92084939,"authorName":"Heidi","from":"&quot;Heidi&quot; &lt;bunsofaluminum60@...&gt;","profile":"heidic40","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: the book and this list","postDate":"1064414569","msgId":81407,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJrc2FoYSt1YWN0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwYmUwMWMzODIzYiQ2ZWNmMGMxMCQ2NTAyYThjMEAyMDAyZGVza3RvcD4="},"prevInTopic":81373,"nextInTopic":81417,"prevInTime":81406,"nextInTime":81408,"topicId":81325,"numMessagesInTopic":0,"msgSnippet":"I didn t see what book this thread is about, but I did visit the Leppert site and also the GAil Withrow site, and have a question. Maybe a rhetorical","messageBody":"<div id=\"ygrps-yiv-457740695\">I didn&#39;t see what &quot;book&quot; this thread is about, but I did visit the <br/>\nLeppert site and also the GAil Withrow site, and have a question.<br/>\n<br/>\nMaybe a rhetorical question. Actually, a rant. <br/>\n<br/>\nShe states that unschoolers are dead set against teaching. Hello? I <br/>\nteach my kids all the time, just not from forcing them to sit down <br/>\nand fill in the blanks or answer arbitrary questions about the <br/>\nreading they&#39;re doing. I teach them by talking with them about <br/>\nthings, doing things and them observing and helping, and sometimes, I <br/>\neven teach them by sitting down with them, a piece of paper, a <br/>\npencil, and a...gasp...workbook...so they can practice their cursive <br/>\nr&#39;s or their addition facts (and this, tis as the lady claims, is at <br/>\ntheir request. I don&#39;t come up to them and say &quot;today, you learn <br/>\nabout r&#39;s&quot; but when they find a need to learn how to sign their <br/>\nnames, and there is an r in there...? THEN)<br/>\n<br/>\nHaving read quite a bit of John Holt and done with him as I do with <br/>\nevery author (keep what is good, toss what I can&#39;t use), I find his <br/>\nideas about teaching to be reality based. I can&#39;t believe he was <br/>\nopposed to teaching, having been an educator himself for how long? I <br/>\nknow from experience, that you can NOT teach a kid something he is <br/>\nnot ready to learn...Katie&#39;s reading as my favorite case in point.<br/>\n<br/>\nLast year at this time, (pre-Natural Learning-days) her every &quot;let&#39;s <br/>\nsit down and work on your reading&quot; lesson was a study in pouting, <br/>\nhollering, frustration, hatred of the written word, and other very <br/>\nnegative things. From a kid who usually wants to please. This year, <br/>\nshe opens up her Nate the Great books and asks me to come over and <br/>\nlisten to her read. WITH PLEASURE, MY DEAR! :) I &quot;taught&quot; her <br/>\nand &quot;taught&quot; her until phonics was coming out my ears...and going in <br/>\none and out the other of HER ears...starting when she was five (the <br/>\nage I did phonics w/my other two, who then started reading) It&#39;s <br/>\namazing I didn&#39;t permanently kill her desire to read, with all my <br/>\nTEACHING!!!<br/>\n<br/>\nAnd guess what? With me sitting next to her and helping her with <br/>\n(many) words...I&#39;m STILL TEACHING HER! sheesh. I have nothing against <br/>\nteaching, Ms. Gail Windrow LOL sorry...Withrow...rant...matter of <br/>\nfact, since learning about Natural Learning, I&#39;m very much more <br/>\nattuned to my kids&#39; learning, more on the lookout for teaching <br/>\nmoments than I EVER was before. Before, it was &quot;do this many pages of <br/>\nwriting, finish reading that book, and a full problem set of math&quot; <br/>\nand if they did the seatwork, they were done. I wasn&#39;t teaching them <br/>\nin those days; I was marking their FREAKING papers! And making sure <br/>\nthey corrected whatever needed it, thus turning their days into <br/>\nstrongly divided chunks of time: seatwork time, and &quot;cool, get to go <br/>\nplay&quot; time...which one did they desire the most? three guesses. And <br/>\nduring which chunk of time did my kids gain knowledge that THEY HAVE <br/>\nKEPT? grrrrrr.<br/>\n<br/>\nOh, I take that back. Robby does know his times tables, thanks to the <br/>\nabout half an hour of study I &quot;forced&quot; on him, towards the end of our <br/>\nRobinson Curriculum days. But why, once he knew the times tables, did <br/>\nhe have to continue spouting them, day in and day out, a la Robinson <br/>\nand Saxon? He had learned them, and today, two years after learing <br/>\nthem, he still knows them. But Robinson expected him to continue in <br/>\nthe same vein, ad nauseum. The little twerp DIDN&#39;T LIKE IT. How dare <br/>\nhe not LOVE all that &quot;learning&quot;? LOL and Robby hasn&#39;t done a single <br/>\nbit of sit-down math since about January of this year...except one <br/>\ntime, near the beginning, when I got nervous and asked him to do some <br/>\nlong division...L He didn&#39;t know what I was talking about, until he <br/>\nsaw the problems I had written out for him to solve. Which he did <br/>\nwithout a hitch, and I&#39;ve never looked back since then. <br/>\n<br/>\nSo, the question. Is this list anti-teaching? Is unschooling really <br/>\nabout a parent not purposely teaching their children anything? If so, <br/>\nthen I&#39;m doing it wrong, because I do a lot of it in any given day. <br/>\nFor instance, I purposely taught about cutting up potatoes yesterday. <br/>\nAnd my hubby has purposely taught about chopping wood and laying a <br/>\nfire.<br/>\n<br/>\nMaybe it&#39;s the lack of a formal curriculum that makes Ms. Withrow <br/>\nnervous. Yet, if it came right down to it, and a kid wanted to know a <br/>\nlot about something, I&#39;d lay out a course, based on my experience and <br/>\nknowledge...&quot;course&quot; being the English translation of the word <br/>\ncurriculum. Maybe!!! oh, this is it, I bet. Maybe she wants me to lay <br/>\nout that course and set my kids on it, whether they want to learn <br/>\nabout the topic or not. I have no problem with suggesting a direction <br/>\nto my kids, one that I think would interest them and be useful. But <br/>\nI&#39;m not going to try and teach something that they aren&#39;t ready to <br/>\nlearn. And they&#39;ll be ready to learn when they&#39;ve found a need for <br/>\nit, from their day to day living. Some of what they need, I&#39;ll teach <br/>\nto them. Some, they will learn themselves through experience. And <br/>\nsome, dare I say it, they will find other mentors to learn from.<br/>\n<br/>\n*end rant*<br/>\n<br/>\nblessings, HeidiC<br/>\n<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, &quot;catherine aceto&quot; <br/>\n&lt;aceto3@v...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Lol -- well at least they think it is better than public school.<br/>\n&gt; <br/>\n&gt; -cat<br/>\n&gt; ----- Original Message -----<br/>\n&gt; From: &quot;pam sorooshian&quot; &lt;pamsoroosh@m...&gt;<br/>\n&gt; To: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>&gt;<br/>\n&gt; Sent: Tuesday, September 23, 2003 8:18 PM<br/>\n&gt; Subject: Re: [UnschoolingDiscussion] the book and this list<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; That book was written by Mary and Michael Leppert who run &quot;the Link&quot;<br/>\n&gt; conference where they had Gail Withrow as a speaker, talking against<br/>\n&gt; unschooling. Her website is:<br/>\n&gt; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.hometaught.com/app_unschooling.htm\">http://www.hometaught.com/app_unschooling.htm</a>&gt;. She says things <br/>\n </span></blockquote>like:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; &quot;John Holt&#39;s philosophy of unschooling is based on a false premise: <br/>\n </span></blockquote>the<br/>\n<blockquote><span title=\"ireply\"> &gt; premise that ideas are innate. His radical position is that children<br/>\n&gt; automatically know how and what to learn, that they&#39;re born with the<br/>\n&gt; knowledge of how to get knowledgewhich is utter nonsense.&quot;<br/>\n&gt; <br/>\n&gt; -pam<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; On Tuesday, September 23, 2003, at 01:22  PM, kbcdlovejo@a... wrote:<br/>\n&gt; <br/>\n&gt; &gt; That book was based on a few families the author chose to <br/>\n </span></blockquote>interview.<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; Had he<br/>\n&gt; &gt; come HERE, he would have gotten a different view of unschooling <br/>\n </span></blockquote>and<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; learning.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; &quot;List Posting Policies&quot; are provided in the files area of this <br/>\n </span></blockquote>group.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; To unsubscribe from this send an email to:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a><br/>\n&gt; <br/>\n&gt; Visit the Unschooling website and message boards: <br/>\n </span></blockquote><a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Your use of Yahoo! Groups is subject to <br/>\n </span></blockquote><a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a></div>","specialLinks":[]},{"userId":154343532,"authorName":"CabinOnTheLedge@aol.com","from":"CabinOnTheLedge@...","profile":"closeknitfamilyof3","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: the book and this list","postDate":"1064370123","msgId":81370,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGYzLjMwMjJiMWQ4LjJjYTI1OWNiQGFvbC5jb20+"},"prevInTopic":81352,"nextInTopic":81373,"prevInTime":81369,"nextInTime":81371,"topicId":81325,"numMessagesInTopic":0,"msgSnippet":" I just joined","messageBody":"<div id=\"ygrps-yiv-753807433\">&lt;&lt;And there are several unschooling lists out there that will say that <br/>\nletting <br/>\n<br/>\nthe child pick which workbook to use this hour is unschooling.&gt;&gt;<br/>\n<br/>\n<br/>\nI just joined one that mentioned workbooks and television and I left it <br/>\nbecause I thought it was a homeschooling list. Lots for us still to discover!<br/>\n<br/>\n<br/>\n&lt;&lt;We&#39;re the serious unschoolers! &lt;BWG&gt;&gt;&gt;<br/>\n<br/>\n<br/>\nSo then would you say that the serious unschoolers are really radical <br/>\nunschoolers? I hear that mentioned often also.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n&lt;&lt;YOU can pick and choose which unschoolers you&#39;d rather &quot;follow&quot;. Here <br/>\nyou&#39;ll <br/>\n<br/>\nfind open, gentle parents who understand learning and unschooling and will <br/>\ndiscuss it TO DEATH!&gt;&gt;<br/>\n<br/>\n<br/>\n<br/>\nWe went down the workbook, restricting and so on path and we were all <br/>\nmiserable. I wouldn&#39;t give up this way for anything. The changes in us and it in <br/>\nChristopher speak volumes. <br/>\n<br/>\n<br/>\nGuess I haven&#39;t done much research on other methods or how other unschoolers <br/>\ndo things. I found this list and have been glued here since. The book sort of <br/>\nsurprised Kevin and I. We thought this way was the only way. Still do!<br/>\n<br/>\n<br/>\n<br/>\n&lt;&lt;Again, unschooling is living as if school didn&#39;t exist---not as if the <br/>\nWORLD didn&#39;t!&gt;&gt;<br/>\n<br/>\n<br/>\n<br/>\nThanks Kelly! Another great saying for my collection.<br/>\n<br/>\nKim<br/>\nNot letting hubby buy any more books!</div>","specialLinks":[]},{"userId":149995806,"authorName":"catherine aceto","from":"&quot;catherine aceto&quot; &lt;aceto3@...&gt;","profile":"cat4cat15217","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] the book and this list","postDate":"1064367026","msgId":81373,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwYmUwMWMzODIzYiQ2ZWNmMGMxMCQ2NTAyYThjMEAyMDAyZGVza3RvcD4=","referencesHeader":"PDlENUZFNjdFLUVFMjQtMTFENy1BRTQ0LTAwMEE5NUUyOTJDNkBtYWMuY29tPg=="},"prevInTopic":81370,"nextInTopic":81407,"prevInTime":81372,"nextInTime":81374,"topicId":81325,"numMessagesInTopic":0,"msgSnippet":"Lol -- well at least they think it is better than public school. -cat ... From: pam sorooshian  To:","messageBody":"<div id=\"ygrps-yiv-848553943\">Lol -- well at least they think it is better than public school.<br/>\n<br/>\n-cat<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message -----<br/>\nFrom: &quot;pam sorooshian&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pamsoroosh@...\">pamsoroosh@...</a>&gt;<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>&gt;<br/>\nSent: Tuesday, September 23, 2003 8:18 PM<br/>\nSubject: Re: [UnschoolingDiscussion] the book and this list<br/>\n<br/>\n<br/>\nThat book was written by Mary and Michael Leppert who run &quot;the Link&quot;<br/>\nconference where they had Gail Withrow as a speaker, talking against<br/>\nunschooling. Her website is:<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.hometaught.com/app_unschooling.htm\">http://www.hometaught.com/app_unschooling.htm</a>&gt;. She says things like:<br/>\n<br/>\n&quot;John Holt&#39;s philosophy of unschooling is based on a false premise: the<br/>\npremise that ideas are innate. His radical position is that children<br/>\nautomatically know how and what to learn, that they&#39;re born with the<br/>\nknowledge of how to get knowledge—which is utter nonsense.&quot;<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\nOn Tuesday, September 23, 2003, at 01:22  PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kbcdlovejo@...\">kbcdlovejo@...</a> wrote:<br/>\n<br/>\n&gt; That book was based on a few families the author chose to interview.<br/>\n&gt; Had he<br/>\n&gt; come HERE, he would have gotten a different view of unschooling and<br/>\n&gt; learning.<br/>\n<br/>\n<br/>\n&quot;List Posting Policies&quot; are provided in the files area of this group.<br/>\n<br/>\nTo unsubscribe from this send an email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a><br/>\n<br/>\nVisit the Unschooling website and message boards: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n<br/>\nYour use of Yahoo! Groups is subject to <a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a> </span></blockquote></div>","specialLinks":[]},{"userId":141316284,"authorName":"pam sorooshian","from":"pam sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] the book and this list","postDate":"1064362705","msgId":81352,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlENUZFNjdFLUVFMjQtMTFENy1BRTQ0LTAwMEE5NUUyOTJDNkBtYWMuY29tPg==","inReplyToHeader":"PGUuMzVkZWYxYWIuMmNhMjA1ODBAYW9sLmNvbT4="},"prevInTopic":81325,"nextInTopic":81370,"prevInTime":81351,"nextInTime":81353,"topicId":81325,"numMessagesInTopic":0,"msgSnippet":"That book was written by Mary and Michael Leppert who run the Link conference where they had Gail Withrow as a speaker, talking against unschooling. Her","messageBody":"<div id=\"ygrps-yiv-757601623\">That book was written by Mary and Michael Leppert who run &quot;the Link&quot; <br/>\nconference where they had Gail Withrow as a speaker, talking against <br/>\nunschooling. Her website is: <br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.hometaught.com/app_unschooling.htm\">http://www.hometaught.com/app_unschooling.htm</a>&gt;. She says things like:<br/>\n<br/>\n&quot;John Holt&#39;s philosophy of unschooling is based on a false premise: the <br/>\npremise that ideas are innate. His radical position is that children <br/>\nautomatically know how and what to learn, that they&#39;re born with the <br/>\nknowledge of how to get knowledge—which is utter nonsense.&quot;<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Tuesday, September 23, 2003, at 01:22  PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kbcdlovejo@...\">kbcdlovejo@...</a> wrote:<br/>\n<br/>\n&gt; That book was based on a few families the author chose to interview. <br/>\n&gt; Had he<br/>\n&gt; come HERE, he would have gotten a different view of unschooling and <br/>\n&gt; learning. </span></blockquote></div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] the book and this list","postDate":"1064348544","msgId":81325,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGUuMzVkZWYxYWIuMmNhMjA1ODBAYW9sLmNvbT4="},"prevInTopic":0,"nextInTopic":81352,"prevInTime":81324,"nextInTime":81326,"topicId":81325,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/23/2003 3:51:13 PM Eastern Daylight Time, UnschoolingDiscussion@yahoogroups.com writes: . I know what is best for my family, just","messageBody":"<div id=\"ygrps-yiv-1299451790\">In a message dated 9/23/2003 3:51:13 PM Eastern Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a> writes:<br/>\n. I know what is best for my family, just wondering why some unschoolers say <br/>\nto give it up and the unschoolers here say not to.&lt;&lt;&lt;&lt;<br/>\n<br/>\n<br/>\nAnd there are several unschooling lists out there that will say that letting <br/>\nthe child pick which workbook to use this hour is unschooling. <br/>\n<br/>\nWe&#39;re the serious unschoolers! &lt;BWG&gt;<br/>\n<br/>\nThat book was based on a few families the author chose to interview. Had he <br/>\ncome HERE, he would have gotten a different view of unschooling and learning. <br/>\nYOU can pick and choose which unschoolers you&#39;d rather &quot;follow&quot;. Here you&#39;ll <br/>\nfind open, gentle parents who understand learning and unschooling and will <br/>\ndiscuss it TO DEATH!<br/>\n<br/>\nAgain, unschooling is living as if school didn&#39;t exist---not as if the WORLD <br/>\ndidn&#39;t!<br/>\n<br/>\n~Kelly<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":81458,"nextTopicId":81466}}