{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":32548609,"authorName":"saka30080","from":"&quot;saka30080&quot; &lt;savagewilson@...&gt;","profile":"saka30080","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Personality and grandparents  was Re: Digest Number 2288","postDate":"1030403285","msgId":42099,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGFrZWNjbCtxaWU0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE5YS43YWFlNjUxLjJhOWJjOWY0QGFvbC5jb20+"},"prevInTopic":42081,"nextInTopic":0,"prevInTime":42098,"nextInTime":42100,"topicId":42071,"numMessagesInTopic":0,"msgSnippet":"My personality probably won t support this kind of cheerleading. It s just not in my nature.  I could give her some positive updates on things he s doing","messageBody":"<div id=\"ygrps-yiv-647452022\">My personality probably won&#39;t support this kind of cheerleading.  <br/>\nIt&#39;s just not in my nature.  I could give her some positive updates <br/>\non things he&#39;s doing though and leave it at that.  Being non-<br/>\ndefensive ia the best advice.  I don&#39;t have anything to defend so it <br/>\nmakes sense.  I think she raises old fears and feelings I&#39;ve been <br/>\ntrying to get past, so I get irritated after talking to her.  But <br/>\nirritated is better than angry, which is how I felt after her third <br/>\nor fourth &quot;toilet-train him so he can go to pre-school&quot; speech.<br/>\n<br/>\nCherry<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In Unschooling-dotcom@y..., PSoroosh@a... wrote:<br/>\n&gt; In a message dated 8/26/2002 6:29:57 AM Pacific Daylight Time, <br/>\n&gt; Unschooling-dotcom@y... writes:<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; &gt; This time she asked me what he was learning.  <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Looking back, I realize that nobody in my family ever DARED to <br/>\nquestion our <br/>\n&gt; unschooling because I was always so boiling over with excitement <br/>\nand <br/>\n&gt; enthusiasm for what the kids were doing.<br/>\n&gt; <br/>\n&gt; I took every question, like the one above, as a chance to brag up <br/>\nwhatever <br/>\n&gt; the kids were into at the time. I didn&#39;t take it as an academic <br/>\nquestion, <br/>\n&gt; necessarily, but as just a way for a caring relative to ask me to <br/>\nopen a <br/>\n&gt; window into their beloved grandchild or niece&#39;s life.<br/>\n&gt; <br/>\n&gt; It helps to be nondefensive -- I really WAS so genuinely thrilled <br/>\nand <br/>\n&gt; facinated by the learning that my little ones were doing that I <br/>\ndidn&#39;t have <br/>\n&gt; to fake it. That&#39;s where having really thought a lot about learning <br/>\nand what <br/>\n&gt; is important and isn&#39;t and child development and what leads to <br/>\nwhat -- etc. <br/>\n&gt; -- comes in handy.<br/>\n&gt; <br/>\n&gt;  What I mean is that when my 4 yo spent the day and night and days <br/>\nand nights <br/>\n&gt; playing with stuffed animals --- that looked like &quot;real&quot; and <br/>\nimportant <br/>\n&gt; learning to me and I translated it as that to questioning <br/>\nrelatives. &quot;Rosie <br/>\n&gt; has been spending just hours and hours and hours in dramatic play --<br/>\n she&#39;s <br/>\n&gt; really developing her ability to create dialog and develop <br/>\ncharacters and <br/>\n&gt; learning all about plot lines.&quot; &lt;BEG&gt;  You know - I never really <br/>\nsaid that, <br/>\n&gt; exactly, but I KNEW that was what she was doing - along with a <br/>\nb&#39;zillion <br/>\n&gt; other &quot;developments&quot; such as practicing conflict resolution skills <br/>\n(by acting <br/>\n&gt; out with the stuffed animals) and trying on adult situations and <br/>\nroles and <br/>\n&gt; all kinds of other things.<br/>\n&gt; <br/>\n&gt;  I never ever thought of what the kids were doing when they were <br/>\nlittle as <br/>\n&gt; &quot;just&quot; playing -- even if all they were doing was sticking their <br/>\nfingers into <br/>\n&gt; a hole in the couch/sofa/davenport and feeling the stuffing, I saw <br/>\nthat as an <br/>\n&gt; exploration of the tactile properties of upholstery materials. I <br/>\nmight notice <br/>\n&gt; that the same kid who was doing that also liked to run her hands <br/>\nacross the <br/>\n&gt; wall as she walked through a room. I guess I might say to <br/>\nGrandma, &quot;She&#39;s <br/>\n&gt; really interested right now in how things feel - in their tactile <br/>\nqualities.&quot; <br/>\n&gt; (I have a friend who is an architect and she says that she touched <br/>\neverything <br/>\n&gt; - was always interested in how things felt - and that she had a <br/>\nprofessor in <br/>\n&gt; her university in Naples, Italy, who said that he was the same way -<br/>\n that his <br/>\n&gt; parents despaired because he always had dirty hands and was always <br/>\ntouching <br/>\n&gt; everything. So - there. Who the heck knows what something might <br/>\nlead to?)<br/>\n&gt; <br/>\n&gt; --pamS<br/>\n&gt; National Home Education Network<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.NHEN.org\">http://www.NHEN.org</a><br/>\n&gt; Changing the Way the World Sees Homeschooling!<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":2300774,"authorName":"Betsy","from":"Betsy &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Digest Number 2288","postDate":"1030387843","msgId":42081,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNENkE3ODgzLkZBRjczREY1QGVhcnRobGluay5uZXQ+","referencesHeader":"PDE5YS43YWFlNjUxLjJhOWJjOWY0QGFvbC5jb20+"},"prevInTopic":42077,"nextInTopic":42099,"prevInTime":42080,"nextInTime":42082,"topicId":42071,"numMessagesInTopic":0,"msgSnippet":"** Looking back, I realize that nobody in my family ever DARED to question our unschooling because I was always so boiling over with excitement and enthusiasm","messageBody":"<div id=\"ygrps-yiv-105194315\">**<br/>\nLooking back, I realize that nobody in my family ever DARED to question<br/>\nour <br/>\nunschooling because I was always so boiling over with excitement and <br/>\nenthusiasm for what the kids were doing.**<br/>\n<br/>\nI agree, Pam.  I think the best answer to casual critics is a blinding<br/>\nsmile and vigorous, Tigger-like enthusiasm for unschooling. <br/>\n(Eeyore-like outbursts won&#39;t make any friends. &lt;g&gt;)<br/>\n<br/>\nI&#39;m glad I started unschooling at the preschool age, because my<br/>\nconfidence has grown over the years.  Now that my son is big enough for<br/>\nstore clerks to ask us why he is &quot;AWOL&quot; from school, I have no trouble<br/>\nfacing them down.  When people ask me why he&#39;s not in school at that<br/>\nminute I give them a big, fat satisfied smile and tell them &quot;We<br/>\nhomeschool!&quot;  If I get any follow up about being at the store instead of<br/>\nat the kitchen table, I just gush that we have a very flexible schedule.<br/>\n<br/>\nI try to leave the impression that I&#39;m thrilled with homeschooling<br/>\n(unschooling) and that it&#39;s working great for us.  I want people to<br/>\nshake their heads when I leave and wonder &quot;what drugs is that lady on?&quot;  &lt;eg&gt;<br/>\n<br/>\nLife is good,<br/>\nBetsy  <br/>\n<br/>\nP.S.  (While I was having a great time at the Sac. conference, my s-i-l<br/>\nwas apparently plying my husband with skeptical questions about<br/>\nhomeschooling.  My smile may be blinding, but it apparently can&#39;t be<br/>\nseen from 30 miles away.)  (And I think, based on her behind-the-back<br/>\ntiming, that my s-i-l has learned to fear my Tigger-like enthusiasm.  Go figure!)</div>","specialLinks":[]},{"userId":1798873,"authorName":"PSoroosh@aol.com","from":"PSoroosh@...","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Digest Number 2288","postDate":"1030387162","msgId":42077,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM1LjI3Zjk0Y2MzLjJhOWJjZmRhQGFvbC5jb20+"},"prevInTopic":42071,"nextInTopic":42081,"prevInTime":42076,"nextInTime":42078,"topicId":42071,"numMessagesInTopic":0,"msgSnippet":"In a message dated 8/26/2002 6:29:57 AM Pacific Daylight Time, ... You may be interested in a list that discusses homeschooling and education-related politics","messageBody":"<div id=\"ygrps-yiv-602400840\">In a message dated 8/26/2002 6:29:57 AM Pacific Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My point is, and I do have one, why exactly do we keep jumping on <br/>\n&gt; Ned and Bob and anyone else who seems to have very strong feelings <br/>\n&gt; one way or the other on subjects that seem to me to fit very neatly <br/>\n&gt; into an unschooling discussion?<br/>\n<br/>\n </span></blockquote>You may be interested in a list that discusses homeschooling and <br/>\neducation-related politics - sounds like you are. I&#39;d like to suggest the <br/>\nNHEN legislative list for that purpose. <br/>\n(<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:NHEN-legislative-subscribe@yahoogroups.com\">NHEN-legislative-subscribe@yahoogroups.com</a>)<br/>\n<br/>\nI believe that it is accurate to say that this list is not really just a list <br/>\nfor unschoolers to talk and debate about absolutely anything -- it is a list <br/>\nthat is actually ABOUT unschooling. Although, yes, our kids can learn from <br/>\nanything and everything, this list isn&#39;t about anything and everything - it <br/>\nisn&#39;t about abortion  or immigration policies or tax reform or immunizations <br/>\nor lots of other things that could EASILY swamp the list and ruin it for any <br/>\ngood discussion and learning about unschooling. Maybe there is a place for <br/>\nsuch a list -- a list where unschoolers go to talk about anything and <br/>\neverything and political debates would be appropriate.<br/>\n<br/>\n Some people aren&#39;t actually all that interested in talking about and <br/>\nlearning about and getting support for unschooling their kids  --- but they <br/>\nhave other agendas that they&#39;d like to convince us of. This really isn&#39;t the <br/>\nplace for that. The list is SO big and so active - it is very tempting for <br/>\npeople to take us as a captive audience and draw us into political <br/>\ndiscussions. And there are people who don&#39;t mind and would enjoy those <br/>\ndiscussions. But that really isn&#39;t fair to the rest of us who just want to be <br/>\non a list to talk about unschooling our kids. <br/>\n<br/>\n I love discussion lists and have been on this list from its very early <br/>\nbeginnings, but I can&#39;t keep up here and a big reason for that is all the <br/>\ncontroversial and hostile debate stuff that is really not relevant. I do like <br/>\nthe NHEN legislative list -- on that list there is an attempt to shed light - <br/>\neven when hostilities do flare up (and they do) -- there are lots of <br/>\ninterested people there and they go out and investigate the topics and they <br/>\nreally help each other get to the truth, as much as possible. We aren&#39;t here <br/>\nto do that - not when it comes to government school financing or other <br/>\npolitical or off-topic discussions. It means that on this list, where the <br/>\nvast majority of us are here to talk about unschooling, a few people post <br/>\ntheir political opinions, a few people are drawn into debating them, hardly <br/>\nanybody has any evidence or in-depth information to rebutt what anybody else <br/>\nproclaims, and most people are just either yawning and signing off the list <br/>\nor wading through the stuff while frustratedly trying to get other topics <br/>\ngoing.<br/>\n<br/>\nI do my political discussions on a list that was created for that purpose and <br/>\nwhere all the other people on the list are there for that purpose. But I <br/>\nrefuse to do it here because I know, for a fact, that there are people who <br/>\ncomehere who are REALLY wanting to learn about unschooling (sometimes <br/>\nDESPERATELY wanting to learn about it or get support for it or figure out if <br/>\nit might rescue their child in some way) and wading through all the other <br/>\nstuff (including the extreme heat and hostility that politics always <br/>\ngenerates) makes it really hard for them to get what they need from this <br/>\nlist.<br/>\n<br/>\n<br/>\n--pamS<br/>\nNational Home Education Network<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.NHEN.org\">http://www.NHEN.org</a><br/>\nChanging the Way the World Sees Homeschooling!<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1798873,"authorName":"PSoroosh@aol.com","from":"PSoroosh@...","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Digest Number 2288","postDate":"1030385652","msgId":42071,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5YS43YWFlNjUxLjJhOWJjOWY0QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":42077,"prevInTime":42070,"nextInTime":42072,"topicId":42071,"numMessagesInTopic":0,"msgSnippet":"In a message dated 8/26/2002 6:29:57 AM Pacific Daylight Time, ... Looking back, I realize that nobody in my family ever DARED to question our unschooling","messageBody":"<div id=\"ygrps-yiv-1958315354\">In a message dated 8/26/2002 6:29:57 AM Pacific Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; This time she asked me what he was learning.  <br/>\n<br/>\n<br/>\n </span></blockquote>Looking back, I realize that nobody in my family ever DARED to question our <br/>\nunschooling because I was always so boiling over with excitement and <br/>\nenthusiasm for what the kids were doing.<br/>\n<br/>\nI took every question, like the one above, as a chance to brag up whatever <br/>\nthe kids were into at the time. I didn&#39;t take it as an academic question, <br/>\nnecessarily, but as just a way for a caring relative to ask me to open a <br/>\nwindow into their beloved grandchild or niece&#39;s life.<br/>\n<br/>\nIt helps to be nondefensive -- I really WAS so genuinely thrilled and <br/>\nfacinated by the learning that my little ones were doing that I didn&#39;t have <br/>\nto fake it. That&#39;s where having really thought a lot about learning and what <br/>\nis important and isn&#39;t and child development and what leads to what -- etc. <br/>\n-- comes in handy.<br/>\n<br/>\n What I mean is that when my 4 yo spent the day and night and days and nights <br/>\nplaying with stuffed animals --- that looked like &quot;real&quot; and important <br/>\nlearning to me and I translated it as that to questioning relatives. &quot;Rosie <br/>\nhas been spending just hours and hours and hours in dramatic play -- she&#39;s <br/>\nreally developing her ability to create dialog and develop characters and <br/>\nlearning all about plot lines.&quot; &lt;BEG&gt;  You know - I never really said that, <br/>\nexactly, but I KNEW that was what she was doing - along with a b&#39;zillion <br/>\nother &quot;developments&quot; such as practicing conflict resolution skills (by acting <br/>\nout with the stuffed animals) and trying on adult situations and roles and <br/>\nall kinds of other things.<br/>\n<br/>\n I never ever thought of what the kids were doing when they were little as <br/>\n&quot;just&quot; playing -- even if all they were doing was sticking their fingers into <br/>\na hole in the couch/sofa/davenport and feeling the stuffing, I saw that as an <br/>\nexploration of the tactile properties of upholstery materials. I might notice <br/>\nthat the same kid who was doing that also liked to run her hands across the <br/>\nwall as she walked through a room. I guess I might say to Grandma, &quot;She&#39;s <br/>\nreally interested right now in how things feel - in their tactile qualities.&quot; <br/>\n(I have a friend who is an architect and she says that she touched everything <br/>\n- was always interested in how things felt - and that she had a professor in <br/>\nher university in Naples, Italy, who said that he was the same way - that his <br/>\nparents despaired because he always had dirty hands and was always touching <br/>\neverything. So - there. Who the heck knows what something might lead to?)<br/>\n<br/>\n--pamS<br/>\nNational Home Education Network<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.NHEN.org\">http://www.NHEN.org</a><br/>\nChanging the Way the World Sees Homeschooling!<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":42057,"nextTopicId":42048}}