{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":10,"messages":[{"userId":377201113,"authorName":"julesmiel","from":"&quot;julesmiel&quot; &lt;julesmiel@...&gt;","profile":"julesmiel","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Letting Go","postDate":"1298110182","msgId":113518,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlqbzR0Nis1N2ViQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAzM0U3QTA0LTU3QUMtNDhDRC1CMjEwLTZFMTI1OTRDQzA0Q0BTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":113500,"nextInTopic":0,"prevInTime":113517,"nextInTime":113519,"topicId":105253,"numMessagesInTopic":0,"msgSnippet":"... Do you think the nasal spray might be an experiment? I ask because we re living with grandparents now, and my son (5) is really interested in their pills","messageBody":"<div id=\"ygrps-yiv-1107503744\"><blockquote><span title=\"ireply\">&gt; -=-My husband introduced the nasal spray and I think that stuff is  <br/>\n&gt; addictive so I am freaking out about that now. Is it that I like to  <br/>\n&gt; freak out or that I am missing a part in my brain that has the ability  <br/>\n&gt; to reason?-=-<br/>\n<br/>\n </span></blockquote>Do you think the nasal spray might be an experiment?<br/>\n<br/>\nI ask because we&#39;re living with grandparents now, and my son (5) is really interested in their pills and the idea of needing something, controlling something about your body, even the idea of being sick.<br/>\n<br/>\nHe lines up his paint bottles and tells me they&#39;re his medicine.  He describes what they do.  He has Nerds (the candy) that he takes one at a time for his pills.  He has spare Nerds he keeps in the car for car sickness.  <br/>\n<br/>\nHe enjoys telling us he&#39;s sick if we offer something (Do you want to go to the store?) and the answer is no.  He&#39;s noticed people around him saying, &quot;Oh, no.  I can&#39;t.  I&#39;m sick,&quot; so now he&#39;s trying that out.  <br/>\n<br/>\nI remember having fun taking baby aspirin, feeling important, enjoying the flavor.  <br/>\n<br/>\nI understand the freak out phase.  I know sometimes I can&#39;t free myself from it in the worst intensity of it.  Just got to wait until it passes.  But remembering that all this stuff around us is fodder for grand experimentation helps me keep things in perspective.<br/>\n<br/>\nJulie</div>","specialLinks":[]},{"userId":385920361,"authorName":"Kathleen","from":"&quot;Kathleen&quot; &lt;kathleenfleak@...&gt;","profile":"kathleenfleak","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Letting Go","postDate":"1290469743","msgId":113500,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGljZXZoZitrMWdwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDMzMjgxNS41Njg0NC5xbUB3ZWI4NjIwNC5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":113499,"nextInTopic":113518,"prevInTime":113499,"nextInTime":113501,"topicId":105253,"numMessagesInTopic":0,"msgSnippet":"... No, I don t think she is addicted.  Thanks for asking for clarity.  My drinking history is only mentioned to parallel my desperate commitment to","messageBody":"<div id=\"ygrps-yiv-2062205025\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, Schuyler &lt;s.waynforth@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; You start with your own sobriety and <br/>\n&gt; then, it seems, end with a discussion about your daughter&#39;s addiction to sugar. <br/>\n<br/>\n </span></blockquote>No, I don&#39;t think she is addicted.  Thanks for asking for clarity.  My drinking history is only mentioned to parallel my desperate commitment to unschooling.  I was desperate to stop drinking 19 years ago, and I feel desperate to get out of my daughters way in a healthy and loving way. <br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Am I understanding you correctly, do you think your daughter has an addiction to <br/>\n&gt; sugar?   No.<br/>\n<br/>\n </span></blockquote>You wrote that you have only recently committed to being a radical <br/>\n<blockquote><span title=\"ireply\"> &gt; unschooler, is that when you removed all the rules and regulations that you&#39;d <br/>\n&gt; had in place up to then? <br/>\n<br/>\n </span></blockquote>With me, she has not had rules.  Sugar became an issue when she was a baby, if I ate sugar, she couldn&#39;t poop and had horrible tummy pains.  I eliminated everything from my diet and then added things back in to find out what the problem was, so we determined that she must be allergic to sugar.  Weird, but OK.  I had our resident unschooling doctor&#39;s help, also.  So, as she got older, she couldn&#39;t breathe at night if she had a big sweets day.  <br/>\n<br/>\nWhen she is with her Dad, the rule was veggies first.  When we three were together, it was my way (no rules). <br/>\n<br/>\n<br/>\nWhen Jason removed his rules, it was a day when Hannah asked if she could have sweets, and her Dad said he really trusted her decisions and wondered how she would feel if he stopped requiring her to have veggies first.  She thought the idea was great, called me, and told me about her dad and her discussion, and I said, FINALLY!!!  We laughed.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If my assumptions are correct, why is your 10 year old having to work out the <br/>\n&gt; world on her own? <br/>\n<br/>\n </span></blockquote>She&#39;s not.<br/>\n<br/>\nWhy is she staying up all night all alone as she moves through <br/>\n<blockquote><span title=\"ireply\"> &gt; what seems like a radically switch in parenting approaches? <br/>\n<br/>\n </span></blockquote>In my email, I thought I wrote about being up all night with her until I literally couldn&#39;t keep my eyes open, and we sleep together, so we snuggle all the time.  We&#39;re like bear cubs all wrapped around each other (me, Jason, and Hannah).  I do have to go to work, some days I take care of my dad who has advanced parkinson&#39;s.  So, on those nights, Jason got up with her.<br/>\n<br/>\n<br/>\n ...leaving her with words like:  &quot;we have all struggled as you are, and <br/>\n<blockquote><span title=\"ireply\"> &gt; we know that you can figure this out in your own way.&quot;<br/>\n&gt; <br/>\n </span></blockquote>The one thing that applied was to help her when she asks for help and to NOT suggest she is to struggle on her own.  Thank you for that.<br/>\n<br/>\n <br/>\n It may be good to talk to her about how your understanding of sugar has changed, how you feel that food is food and that <br/>\n<blockquote><span title=\"ireply\"> &gt; sugar is sugar and that you don&#39;t feel that it is inherently dangerous. <br/>\n&gt; <br/>\n </span></blockquote>Great idea.  We discovered that Hannah was allergic to dogs/cats/trees/etc.... through a blood test after she got her first puppy.  Her immune system is hit hard when she eats a bunch of sweets.  When she was a baby, my dog Dewey slept with us.  He died when she was 7 years old.  We had no idea that this was what was actually happening.  Now that we know, we were only making sweets a big deal because Hannah got really scared when she couldn&#39;t breathe at night.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; You wrote that you said &quot;we have all struggled as you are, and we know that you <br/>\n&gt; can figure this out in your own way.&quot; <br/>\n<br/>\n </span></blockquote>My husband got on me about this.  It is indicative that I think sugar can be an addictive substance.  My hubby said to Hannah right then, &quot;that is not true, not many people struggle with sweets - afterall, he doesn&#39;t.&quot; <br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; <br/>\n&gt; I have a ten year old daughter.<br/>\n<br/>\n </span></blockquote>By chance, are you located in Sacramento, San Francisco, or L.A.?  If so, we are traveling, and would love to introduce our daughter to other children when we are in other cities. <br/>\n<br/>\n<br/>\nThank you Ms. Schuyler for all of your questions.  I am the kind of person who has to sit with what you say, and then see what applies.  I really feel peace around letting go of my unreasonable fears about my daughter sitting home eating sweets, watching TV, and basically relaxing.  She is already treating herself better, and has relaxed as have we.<br/>\n<br/>\nLetting Go...with all of your help...<br/>\n<br/>\nKathleen<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; ________________________________<br/>\n&gt; From: Kathleen &lt;kathleenfleak@...&gt;<br/>\n&gt; To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a><br/>\n&gt; Sent: Tuesday, 9 November, 2010 16:10:17<br/>\n&gt; Subject: [UnschoolingDiscussion] Letting Go<br/>\n&gt; <br/>\n&gt;   <br/>\n&gt; Good morning unschooler&#39;s,<br/>\n&gt; Thank you Sandra for all the links you provided me about food and children. I am <br/>\n&gt; 19 years sober and when I stopped drinking I then had to learn new tools to <br/>\n&gt; replace my old behavior. But first I was desperate to not pick up that first <br/>\n&gt; drink. <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; I have committed to unschooling since the HSC conference. Please realize that I <br/>\n&gt; only thought I was unschooling before then.  Hannah , my 10 year old, has never <br/>\n&gt; been in school, has belonged to SuNetwork Unschoolers since she was 6 months. My <br/>\n&gt; two best friends are radical unschoolers, and my daughters friends are mostly <br/>\n&gt; unschoolers. I, however, had a husband who was terrified, and I chose to meet <br/>\n&gt; him in the middle. Over time, I struggled because I saw so many problems with <br/>\n&gt; the authority my husband placed on Hannah to the point of contemplating divorce. <br/>\n&gt; We really are best friends, however, and try really hard to consider each other. <br/>\n&gt; So, when I fully committed to being a radical unschooler, I am finding that this <br/>\n&gt; delay in commitment wasn&#39;t about my husband at all. It was about my fears and <br/>\n&gt; Inability to trust my child. <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Now my husband just got onboard entirely. He isn&#39;t going to tell her to brush <br/>\n&gt; her teeth. Or eat her vegetables and he listened to me read some of the post to <br/>\n&gt; him.  So this makes a difference. It has been an unfolding process where my <br/>\n&gt; husband has apologized as he learned how to hear his daughter. I did stay out of <br/>\n&gt; that and when asked for my opinion i shared my experience strength and hope very <br/>\n&gt; benignly. <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Now that I am committed to not pick up the first &quot;authority attitude,&quot; I need <br/>\n&gt; help learning new tools to let go of my inner demons from my own childhood and <br/>\n&gt; from my now.  You see, I am angry inside because I am afraid of what will happen <br/>\n&gt; with my daughter if she sits home, watches TV and eats sweets all day. Now, she <br/>\n&gt; came to me last night and said I can&#39;t stop eating sugar, please help me. I <br/>\n&gt; don&#39;t know if my response was right or not, but my husband and I both said, &quot;we <br/>\n&gt; all have struggled as you are, and we know that you can figure this out in your <br/>\n&gt; own way.&quot; she said that she wants us to hide her candy, but that she doesn&#39;t <br/>\n&gt; think that works because she will sneak it anyway. And, she doesn&#39;t want us to <br/>\n&gt; control her candy intake with the two a day. So, she snorted some 12 hour nasal <br/>\n&gt; spray and went to bed so she could breathe.&quot;. I am dying inside without the <br/>\n&gt; ability to let go and let god (He/She/They).  My husband introduced the nasal <br/>\n&gt; spray and I think that stuff is addictive so I am freaking out about that now. <br/>\n&gt; Is it that I like to freak out or that I am missing a part in my brain that has <br/>\n&gt; the ability to reason?<br/>\n&gt; <br/>\n&gt; Regardless of my fears, and my inability to let go, I am committed to getting <br/>\n&gt; out of my daughters way. I will say that I have been super kind and loving to my <br/>\n&gt; daughter with lots of hugs. I have been woken at night all week because she <br/>\n&gt; can&#39;t sleep because of what she is eating, and, at first, I was a darling. Now, <br/>\n&gt; I tell her I would get up if I could, but I am exhausted. I love you honey. Or <br/>\n&gt; she can&#39;t wake me because I&#39;m exhausted.   I hope my story makes sense. I can&#39;t <br/>\n&gt; edit it because I am on my iPhone. <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Thanks for feedback,<br/>\n&gt; Kathleen<br/>\n&gt; <br/>\n&gt; This severe pendulum swing, I have read to be a normal response. But, this is <br/>\n&gt; really really hard. <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":209361242,"authorName":"JJ","from":"&quot;JJ&quot; &lt;jrossedd@...&gt;","profile":"jrossedd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Letting Go","postDate":"1289929465","msgId":113499,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlidWZ0cCtiM3J2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE0NjU2NDY0Ni0xMjg5NDMzNzc0LWNhcmRodV9kZWNvbWJvYnVsYXRvcl9ibGFja2JlcnJ5LnJpbS5uZXQtMTUzNDg1NzcwNS1AYmRhMjAwMS5iaXN4LnByb2Qub24uYmxhY2tiZXJyeT4="},"prevInTopic":113498,"nextInTopic":113500,"prevInTime":113498,"nextInTime":113500,"topicId":105253,"numMessagesInTopic":0,"msgSnippet":"I just had (am still having) these thoughts too. Young Son (15) and I have been cast in a community production of Scrooge: the Musical and the music director","messageBody":"<div id=\"ygrps-yiv-1153999678\">I just had (am still having) these thoughts too. Young Son (15) and I have been cast in a community production of &quot;Scrooge: the Musical&quot; and the music director found out Young So plays the bagpipes. There&#39;s a creepy scene with Jacob Marley and demon souls that would benefit from the mournful sound of the pipes, so both of them were all excited about having him play in that scene, hidden under the stage or up on the catwalk, for a minute or less.<br/>\n<br/>\nI immediately thought how cool AND no way! I had several practical concerns neither of them shared, not only how he&#39;d make the rapid switch (he&#39;s singing and dancing in almost every scene) but risking  he would get hurt in the dark climbing over or under with his pipes, and/or that the pipes would be damaged (they cost thousands of dollars and cannot be serviced locally.) And there are temperature concerns going from cold to warm, dry air. Pipes are hypersensitive.Last month he played outdoors at Stone Mountain in formal competition, where his chanter reed broke in the middle of the performance, etc etc. <br/>\n<br/>\nI tell the story not because these concerns weren&#39;t valid but because they WERE valid. They needed to be thought of and figured out, to make the performance possible. So I wasn&#39;t paranoid and I wasn&#39;t being negative for the sake of it, but I did catch myself sounding as if I were, a couple of times. And I think I was crossing the line a little, falling into an old pattern. <br/>\n<br/>\nAfter all these years of unschooling, I could recognize it at least and then redouble my intention to find solutions, to be on the same side with them, of helping it work out. <br/>\n<br/>\n(I was so thankful that he didn&#39;t recognize it though, never having experienced it before! So he didn&#39;t overreact to my concerns in return and accuse me. That was pretty great to think about later.)<br/>\n<br/>\nSo it worked out. He will play from the back balcony and the pipes will be safe up there, away from all the backstage frantic bumping around during a show. If they are out of tune due to conditions, it will just make them sound even creepier. He played them at rehearsal the other day and the whole cast and crew was amazed. He is very happy. His music director is happy. His mom is happy too. :) <br/>\n<br/>\nJJ<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, &quot;Theresa Vaz&quot; &lt;theresa.vaz@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; What good timing for me to read this. Today my daughter and I ate at a fast food place and I could hear myself going on about all the negatives about it and I thought what a really unfun person I am and what a drag for my kid. If I am going to do something I should do it with joy and not worry about all the reasons why its not a good idea and focus on why it is a good idea and make it a worthwhile experience. <br/>\n&gt; <br/>\n&gt; I know its a different experience the poster is talking about but sometimes this negative bug is hard to beat.<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":297797915,"authorName":"Theresa Vaz","from":"&quot;Theresa Vaz&quot; &lt;theresa.vaz@...&gt;","profile":"learningandlisteningmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Letting Go","postDate":"1289433455","msgId":113498,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0NjU2NDY0Ni0xMjg5NDMzNzc0LWNhcmRodV9kZWNvbWJvYnVsYXRvcl9ibGFja2JlcnJ5LnJpbS5uZXQtMTUzNDg1NzcwNS1AYmRhMjAwMS5iaXN4LnByb2Qub24uYmxhY2tiZXJyeT4=","inReplyToHeader":"PDAzM0U3QTA0LTU3QUMtNDhDRC1CMjEwLTZFMTI1OTRDQzA0Q0BTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGliYnJwOStpZjYwQGVHcm91cHMuY29tPjwwMzNFN0EwNC01N0FDLTQ4Q0QtQjIxMC02RTEyNTk0Q0MwNENAU2FuZHJhZG9kZC5jb20+"},"prevInTopic":113497,"nextInTopic":113499,"prevInTime":113497,"nextInTime":113499,"topicId":105253,"numMessagesInTopic":0,"msgSnippet":"What good timing for me to read this. Today my daughter and I ate at a fast food place and I could hear myself going on about all the negatives about it and I","messageBody":"<div id=\"ygrps-yiv-1315764327\">What good timing for me to read this. Today my daughter and I ate at a fast food place and I could hear myself going on about all the negatives about it and I thought what a really unfun person I am and what a drag for my kid. If I am going to do something I should do it with joy and not worry about all the reasons why its not a good idea and focus on why it is a good idea and make it a worthwhile experience. <br/>\n<br/>\nI know its a different experience the poster is talking about but sometimes this negative bug is hard to beat.<br/>\n<br/>\nTheresa<br/>\n-----Original Message-----<br/>\nFrom: Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt;<br/>\nSender: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a><br/>\nDate: Wed, 10 Nov 2010 01:06:18 <br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>&gt;<br/>\nReply-To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a><br/>\nSubject: Re: [UnschoolingDiscussion] Letting Go<br/>\n<br/>\n-=-My husband introduced the nasal spray and I think that stuff is  <br/>\naddictive so I am freaking out about that now. Is it that I like to  <br/>\nfreak out or that I am missing a part in my brain that has the ability  <br/>\nto reason?-=-<br/>\n<br/>\nSome people seem to get hooked on the energy or the biochemistry of  <br/>\nbeing freaked out.  Drama.  I don&#39;t know if that&#39;s the case with your  <br/>\nfreaking out about nasal spray, but it reminded me of some friends of  <br/>\nmine who LOVE to be cynical and to voice suspicions and misgivings,  <br/>\nalmost constantly.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/negativity\">http://sandradodd.com/negativity</a><br/>\nThere&#39;s something you can control the heck out of. :-)<br/>\n<br/>\nI don&#39;t think being addicted to nasal spray sounds very life  <br/>\nthreatening.  I&#39;ve never heard of women selling their bodies to get  <br/>\nnasal spray, nor anyone holding up a nasal spray shipment at  <br/>\ngunpoint.  Maybe you could relax about that.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":385920361,"authorName":"Kathleen","from":"&quot;Kathleen&quot; &lt;kathleenfleak@...&gt;","profile":"kathleenfleak","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Letting Go","postDate":"1289341649","msgId":113497,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGliY2hzaCtqYXJoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAzM0U3QTA0LTU3QUMtNDhDRC1CMjEwLTZFMTI1OTRDQzA0Q0BTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":113496,"nextInTopic":113498,"prevInTime":113496,"nextInTime":113498,"topicId":105253,"numMessagesInTopic":0,"msgSnippet":"Sandra,  thank you for reasoning out the nasal spray.  I am intelligent AND when the alarmist in me gets Hold of whatever alarm my mind gets stuck there.","messageBody":"<div id=\"ygrps-yiv-50357844\">Sandra,  thank you for reasoning out the nasal spray.  I am intelligent AND when the alarmist in me gets Hold of whatever &quot;alarm&quot; my mind gets stuck there.  That is one of the reason&#39;s I post.  Thanks again, got it!!  <br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; -=-My husband introduced the nasal spray and I think that stuff is  <br/>\n&gt; addictive so I am freaking out about that now. Is it that I like to  <br/>\n&gt; freak out or that I am missing a part in my brain that has the ability  <br/>\n&gt; to reason?-=-<br/>\n&gt; <br/>\n&gt; Some people seem to get hooked on the energy or the biochemistry of  <br/>\n&gt; being freaked out.  Drama.  I don&#39;t know if that&#39;s the case with your  <br/>\n&gt; freaking out about nasal spray, but it reminded me of some friends of  <br/>\n&gt; mine who LOVE to be cynical and to voice suspicions and misgivings,  <br/>\n&gt; almost constantly.<br/>\n&gt; <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/negativity\">http://sandradodd.com/negativity</a><br/>\n&gt; There&#39;s something you can control the heck out of. :-)<br/>\n&gt; <br/>\n&gt; I don&#39;t think being addicted to nasal spray sounds very life  <br/>\n&gt; threatening.  I&#39;ve never heard of women selling their bodies to get  <br/>\n&gt; nasal spray, nor anyone holding up a nasal spray shipment at  <br/>\n&gt; gunpoint.  Maybe you could relax about that.<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Letting Go","postDate":"1289331378","msgId":113496,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAzM0U3QTA0LTU3QUMtNDhDRC1CMjEwLTZFMTI1OTRDQzA0Q0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGliYnJwOStpZjYwQGVHcm91cHMuY29tPg==","referencesHeader":"PGliYnJwOStpZjYwQGVHcm91cHMuY29tPg=="},"prevInTopic":113495,"nextInTopic":113497,"prevInTime":113495,"nextInTime":113497,"topicId":105253,"numMessagesInTopic":0,"msgSnippet":"-=-My husband introduced the nasal spray and I think that stuff is addictive so I am freaking out about that now. Is it that I like to freak out or that I am","messageBody":"<div id=\"ygrps-yiv-624519733\">-=-My husband introduced the nasal spray and I think that stuff is  <br/>\naddictive so I am freaking out about that now. Is it that I like to  <br/>\nfreak out or that I am missing a part in my brain that has the ability  <br/>\nto reason?-=-<br/>\n<br/>\nSome people seem to get hooked on the energy or the biochemistry of  <br/>\nbeing freaked out.  Drama.  I don&#39;t know if that&#39;s the case with your  <br/>\nfreaking out about nasal spray, but it reminded me of some friends of  <br/>\nmine who LOVE to be cynical and to voice suspicions and misgivings,  <br/>\nalmost constantly.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/negativity\">http://sandradodd.com/negativity</a><br/>\nThere&#39;s something you can control the heck out of. :-)<br/>\n<br/>\nI don&#39;t think being addicted to nasal spray sounds very life  <br/>\nthreatening.  I&#39;ve never heard of women selling their bodies to get  <br/>\nnasal spray, nor anyone holding up a nasal spray shipment at  <br/>\ngunpoint.  Maybe you could relax about that.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyler_waynforth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Letting Go","postDate":"1289324433","msgId":113495,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMzMjgxNS41Njg0NC5xbUB3ZWI4NjIwNC5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PGliYnJwOStpZjYwQGVHcm91cHMuY29tPg==","referencesHeader":"PGliYnJwOStpZjYwQGVHcm91cHMuY29tPg=="},"prevInTopic":113494,"nextInTopic":113496,"prevInTime":113494,"nextInTime":113496,"topicId":105253,"numMessagesInTopic":0,"msgSnippet":"Your e-mail is very hard to interpret. You start with your own sobriety and then, it seems, end with a discussion about your daughter s addiction to sugar. Am","messageBody":"<div id=\"ygrps-yiv-1176226789\">Your e-mail is very hard to interpret. You start with your own sobriety and <br/>\nthen, it seems, end with a discussion about your daughter&#39;s addiction to sugar. <br/>\nAm I understanding you correctly, do you think your daughter has an addiction to <br/>\nsugar? You wrote that you have only recently committed to being a radical <br/>\nunschooler, is that when you removed all the rules and regulations that you&#39;d <br/>\nhad in place up to then? Was it fast and sudden and without a slow and gentle <br/>\nmovement to saying yes more. If there are any more barriers to be lowered it may <br/>\nbe easier on you and your daughter if you just say yes more instead of saying <br/>\nit&#39;s all free, go, have fun. Chaos isn&#39;t a lot of fun. It can be pretty <br/>\nstressful for all concerned. <br/>\n<br/>\nIf my assumptions are correct, why is your 10 year old having to work out the <br/>\nworld on her own? Why is she staying up all night all alone as she moves through <br/>\nwhat seems like a radically switch in parenting approaches? You implemented the <br/>\nchanges, you need to be by her side as she figures out this brave new world. Why <br/>\naren&#39;t you cuddling up to her and showing her how much you love her and how much <br/>\nyou care? Why aren&#39;t you nesting down with her and hanging out and talking <br/>\ninstead of leaving her with words like:  &quot;we have all struggled as you are, and <br/>\nwe know that you can figure this out in your own way.&quot;<br/>\n<br/>\nAbout sugar, I can&#39;t stop eating sugar nor do I want to. I love candy covered <br/>\nalmonds and brownies and chocolate cake and jaggery and carrot cupcakes with <br/>\ncream cheese icing and thai curry and tea with a spoonful of sugar and coffee <br/>\nwith a spoonful of sugar. I like fruit, some kinds, and wheat and carrots and, <br/>\nand, and. Sugar makes things taste good, like salt does. It opens up the other <br/>\nflavours somehow. <br/>\n<br/>\nIf you are moving from a world of sugar disapproval to a more ambivalent feeling <br/>\nabout sugar your daughter may be struggling with the freedoms. If before now you <br/>\nheld sugar as a separate energy source from other foods and controlled and <br/>\nlimited it, your changed approach may have left your daughter feeling a bit <br/>\nunloved and uncared for. It may be good to talk to her about how your <br/>\nunderstanding of sugar has changed, how you feel that food is food and that <br/>\nsugar is sugar and that you don&#39;t feel that it is inherently dangerous. <br/>\n<br/>\nYou wrote that you said &quot;we have all struggled as you are, and we know that you <br/>\ncan figure this out in your own way.&quot; I don&#39;t understand that. Does that mean <br/>\nthat you do feel that sugar has inherently addictive properties and that your <br/>\ndaughter needs to come up with her own strategies for dealing with those <br/>\nproperties? Or is it that as a former addict you feel that she needs to learn <br/>\nher own tools to replace her self-described unhealthy relationship with sugar?<br/>\n<br/>\nWhat are your feelings about sugar? Do you like sugar? Do you think that sugar <br/>\nis addictive? Have you described it that way in the past? If she was having <br/>\ntrouble sleeping for reasons other than her diet would you be more sympathetic? <br/>\nAre you sure that it&#39;s the food that is keeping her awake? Maybe there are other <br/>\nthings involved in her sleepless nights. Maybe the change in diet is just <br/>\ncoincident with whatever is disturbing her sleep patterns. <br/>\n<br/>\nI have a ten year old daughter. She didn&#39;t go to sleep last night until 5 in the <br/>\nmorning. She was having fun chatting and playing with friends on-line. It wasn&#39;t <br/>\nfood, it wasn&#39;t some other strange new thing, it was just the joy of <br/>\ncommunication and playing with someone. If she was having a hard time sleeping, <br/>\nif she was struggling with something, I would have stayed up with her and hung <br/>\nout and maybe watched a movie or chatted or played a game with her. But she was <br/>\nstaying up because she was doing something that she wanted to do. <br/>\n<br/>\nUnschooling isn&#39;t hands off, unschooling is so hands on, it&#39;s so about being <br/>\nwith and doing alongside and engaging. If you think the best response is to let <br/>\nher deal with it on her own, you need to rethink. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Kathleen &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kathleenfleak@...\">kathleenfleak@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a><br/>\nSent: Tuesday, 9 November, 2010 16:10:17<br/>\nSubject: [UnschoolingDiscussion] Letting Go<br/>\n<br/>\n  <br/>\nGood morning unschooler&#39;s,<br/>\nThank you Sandra for all the links you provided me about food and children. I am <br/>\n19 years sober and when I stopped drinking I then had to learn new tools to <br/>\nreplace my old behavior. But first I was desperate to not pick up that first <br/>\ndrink. <br/>\n<br/>\n<br/>\nI have committed to unschooling since the HSC conference. Please realize that I <br/>\nonly thought I was unschooling before then.  Hannah , my 10 year old, has never <br/>\nbeen in school, has belonged to SuNetwork Unschoolers since she was 6 months. My <br/>\ntwo best friends are radical unschoolers, and my daughters friends are mostly <br/>\nunschoolers. I, however, had a husband who was terrified, and I chose to meet <br/>\nhim in the middle. Over time, I struggled because I saw so many problems with <br/>\nthe authority my husband placed on Hannah to the point of contemplating divorce. <br/>\nWe really are best friends, however, and try really hard to consider each other. <br/>\nSo, when I fully committed to being a radical unschooler, I am finding that this <br/>\ndelay in commitment wasn&#39;t about my husband at all. It was about my fears and <br/>\nInability to trust my child. <br/>\n<br/>\n<br/>\nNow my husband just got onboard entirely. He isn&#39;t going to tell her to brush <br/>\nher teeth. Or eat her vegetables and he listened to me read some of the post to <br/>\nhim.  So this makes a difference. It has been an unfolding process where my <br/>\nhusband has apologized as he learned how to hear his daughter. I did stay out of <br/>\nthat and when asked for my opinion i shared my experience strength and hope very <br/>\nbenignly. <br/>\n<br/>\n<br/>\nNow that I am committed to not pick up the first &quot;authority attitude,&quot; I need <br/>\nhelp learning new tools to let go of my inner demons from my own childhood and <br/>\nfrom my now.  You see, I am angry inside because I am afraid of what will happen <br/>\nwith my daughter if she sits home, watches TV and eats sweets all day. Now, she <br/>\ncame to me last night and said I can&#39;t stop eating sugar, please help me. I <br/>\ndon&#39;t know if my response was right or not, but my husband and I both said, &quot;we <br/>\nall have struggled as you are, and we know that you can figure this out in your <br/>\nown way.&quot; she said that she wants us to hide her candy, but that she doesn&#39;t <br/>\nthink that works because she will sneak it anyway. And, she doesn&#39;t want us to <br/>\ncontrol her candy intake with the two a day. So, she snorted some 12 hour nasal <br/>\nspray and went to bed so she could breathe.&quot;. I am dying inside without the <br/>\nability to let go and let god (He/She/They).  My husband introduced the nasal <br/>\nspray and I think that stuff is addictive so I am freaking out about that now. <br/>\nIs it that I like to freak out or that I am missing a part in my brain that has <br/>\nthe ability to reason?<br/>\n<br/>\nRegardless of my fears, and my inability to let go, I am committed to getting <br/>\nout of my daughters way. I will say that I have been super kind and loving to my <br/>\ndaughter with lots of hugs. I have been woken at night all week because she <br/>\ncan&#39;t sleep because of what she is eating, and, at first, I was a darling. Now, <br/>\nI tell her I would get up if I could, but I am exhausted. I love you honey. Or <br/>\nshe can&#39;t wake me because I&#39;m exhausted.   I hope my story makes sense. I can&#39;t <br/>\nedit it because I am on my iPhone. <br/>\n<br/>\n<br/>\nThanks for feedback,<br/>\nKathleen<br/>\n<br/>\nThis severe pendulum swing, I have read to be a normal response. But, this is <br/>\nreally really hard. <br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":385920361,"authorName":"Kathleen","from":"&quot;Kathleen&quot; &lt;kathleenfleak@...&gt;","profile":"kathleenfleak","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Letting Go","postDate":"1289319017","msgId":113494,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGliYnJwOStpZjYwQGVHcm91cHMuY29tPg=="},"prevInTopic":105254,"nextInTopic":113495,"prevInTime":113493,"nextInTime":113495,"topicId":105253,"numMessagesInTopic":0,"msgSnippet":"Good morning unschooler s, Thank you Sandra for all the links you provided me about food and children. I am 19 years sober and when I stopped drinking I then","messageBody":"<div id=\"ygrps-yiv-416196853\">Good morning unschooler&#39;s,<br/>\nThank you Sandra for all the links you provided me about food and children. I am 19 years sober and when I stopped drinking I then had to learn new tools to replace my old behavior. But first I was desperate to not pick up that first drink. <br/>\n<br/>\nI have committed to unschooling since the HSC conference. Please realize that I only thought I was unschooling before then.  Hannah , my 10 year old, has never been in school, has belonged to SuNetwork Unschoolers since she was 6 months. My two best friends are radical unschoolers, and my daughters friends are mostly unschoolers. I, however, had a husband who was terrified, and I chose to meet him in the middle. Over time, I struggled because I saw so many problems with the authority my husband placed on Hannah to the point of contemplating divorce. We really are best friends, however, and try really hard to consider each other. So, when I fully committed to being a radical unschooler, I am finding that this delay in commitment wasn&#39;t about my husband at all. It was about my fears and Inability to trust my child. <br/>\n<br/>\nNow my husband just got onboard entirely. He isn&#39;t going to tell her to brush her teeth. Or eat her vegetables and he listened to me read some of the post to him.  So this makes a difference. It has been an unfolding process where my husband has apologized as he learned how to hear his daughter. I did stay out of that and when asked for my opinion i shared my experience strength and hope very benignly. <br/>\n<br/>\nNow that I am committed to not pick up the first &quot;authority attitude,&quot; I need help learning new tools to let go of my inner demons from my own childhood and from my now.  You see, I am angry inside because I am afraid of what will happen with my daughter if she sits home, watches TV and eats sweets all day. Now, she came to me last night and said I can&#39;t stop eating sugar, please help me. I don&#39;t know if my response was right or not, but my husband and I both said, &quot;we all have struggled as you are, and we know that you can figure this out in your own way.&quot; she said that she wants us to hide her candy, but that she doesn&#39;t think that works because she will sneak it anyway. And, she doesn&#39;t want us to control her candy intake with the two a day. So, she snorted some 12 hour nasal spray and went to bed so she could breathe.&quot;. I am dying inside without the ability to let go and let god (He/She/They).  My husband introduced the nasal spray and I think that stuff is addictive so I am freaking out about that now. Is it that I like to freak out or that I am missing a part in my brain that has the ability to reason?<br/>\n<br/>\nRegardless of my fears, and my inability to let go, I am committed to getting out of my daughters way. I will say that I have been super kind and loving to my daughter with lots of hugs. I have been woken at night all week because she can&#39;t sleep because of what she is eating, and, at first, I was a darling. Now, I tell her I would get up if I could, but I am exhausted. I love you honey. Or she can&#39;t wake me because I&#39;m exhausted.   I hope my story makes sense. I can&#39;t edit it because I am on my iPhone. <br/>\n<br/>\nThanks for feedback,<br/>\nKathleen<br/>\n<br/>\nThis severe pendulum swing, I have read to be a normal response. But, this is really really hard.</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Letting Go","postDate":"1113159721","msgId":105254,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFhNC4zNTkzMGE4ZC4yZjhhZDIyOUBhb2wuY29tPg=="},"prevInTopic":105253,"nextInTopic":113494,"prevInTime":105253,"nextInTime":105255,"topicId":105253,"numMessagesInTopic":0,"msgSnippet":"In a message dated 4/10/2005 12:20:03 PM Mountain Daylight Time, elaina.morrison@gmail.com writes: Don t  know what exactly my question is or if I even have a","messageBody":"<div id=\"ygrps-yiv-1668999182\">In a message dated 4/10/2005 12:20:03 PM Mountain Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:elaina.morrison@...\">elaina.morrison@...</a> writes:<br/>\n<br/>\nDon&#39;t  know <br/>\nwhat exactly my question is or if I even have a question, its just  <br/>\nhard to let go of these kind of ingrained  thoughts.<br/>\n<br/>\n<br/>\n<br/>\nHere&#39;s one article on deschooling and links to a few others.  None is  long, <br/>\nnone will hurt you. &lt;g&gt;<br/>\n_<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/deschooling_\">http://sandradodd.com/deschooling_</a> (<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/deschooling)\">http://sandradodd.com/deschooling)</a> <br/>\n <br/>\n <br/>\nHere&#39;s something with practical suggestions for what to do instead of  <br/>\nstructure:<br/>\n <br/>\n_<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/checklists_\">http://sandradodd.com/checklists_</a> (<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/checklists)\">http://sandradodd.com/checklists)</a> <br/>\n <br/>\n-=- DH thinks they need to sit down for hours a day and do school  <br/>\nwork-=-<br/>\n <br/>\nThe whole family will eventually have to agree and cooperate, but some of  <br/>\nwhat&#39;s above might help you relax enough to help show it to your husband and to  <br/>\nyourself too.  Until we see our own children doing real learning, it&#39;s just  <br/>\ntheory.<br/>\n <br/>\nPeople say &quot;I know psychology&quot; or &quot;I know how to cook&quot; or whatever, but  <br/>\nsometimes that means they know enough to pass a basic test, they know some  <br/>\nvocabulary, they know the definition of &quot;psychology.&quot;  <br/>\n <br/>\nSo someone could say &quot;I understand unschooling&quot; or &quot;I know that people  learn <br/>\nnaturally,&quot; but unless they&#39;ve really experienced it to the point of calm  <br/>\nacceptance and confidence, they still just kinda know, or know in theory.   <br/>\nMaybe they could pass a test or discuss it, but can they really put the math  <br/>\nbooks away?<br/>\n <br/>\nIf you see one thing working, it makes it easier to believe the next thing  <br/>\ncould work too.   Look around for those things, though.  Have  they learned <br/>\nsongs without a curriculum?  Have they learned to climb or  ride bikes or how to <br/>\nmake a sandwich without a chart and step-by-step  instructions, a review and a <br/>\ntest?<br/>\n <br/>\nSandra<br/>\n <br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":209727179,"authorName":"luv_my_three_kids","from":"&quot;luv_my_three_kids&quot; &lt;elaina.morrison@...&gt;","profile":"luv_my_three_kids","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Letting Go","postDate":"1113156831","msgId":105253,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQzYnFjditqbWMyQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":105254,"prevInTime":105252,"nextInTime":105254,"topicId":105253,"numMessagesInTopic":0,"msgSnippet":"Even though I have come to the conclusion that we mostly unschool here it is still hard for me to let go of the school idea. Especially since DH thinks they","messageBody":"<div id=\"ygrps-yiv-1434848788\">Even though I have come to the conclusion that we mostly unschool here <br/>\nit is still hard for me to let go of the &quot;school&quot; idea. Especially <br/>\nsince DH thinks they need to sit down for hours a day and do school <br/>\nwork. I understand the fact that children learn on their own and its a <br/>\nnatural process. I was looking through thier &quot;school&quot; books(we are <br/>\nusing a charter right now) trying to think of what to do for tomorrows <br/>\nlessons. Everything looked so pointless, I kept thinking why do they <br/>\nneed to sit down with this book and &quot;learn&quot; this, they can learn that <br/>\non their own. The only book I could possibly think of using is their <br/>\nmath book. Knowing all this and believing in  unschooling doesn&#39;t help <br/>\nme get over the idea that they need to sit and do lessons. Don&#39;t know <br/>\nwhat exactly my question is or if I even have a question, its just <br/>\nhard to let go of these kind of ingrained thoughts.</div>","specialLinks":[]}],"prevTopicId":113508,"nextTopicId":113487}}