{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":1352017,"authorName":"kayb85","from":"&quot;kayb85&quot; &lt;sheran@...&gt;","profile":"kayb85","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Being allowed to quit  was: Radical vs. Regular?","postDate":"1072205069","msgId":86680,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJzYTJlZCt1bDc0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDFkOC4xNzJlODVlNi4yZDE5YjExNkBhb2wuY29tPg=="},"prevInTopic":86651,"nextInTopic":0,"prevInTime":86679,"nextInTime":86681,"topicId":86651,"numMessagesInTopic":0,"msgSnippet":"I made a mistake when my daughter was into Chinese a few years ago. She really wanted to learn how to speak Chinese and she wanted to sign up for a children s","messageBody":"<div id=\"ygrps-yiv-114067329\">I made a mistake when my daughter was into Chinese a few years ago.  <br/>\nShe really wanted to learn how to speak Chinese and she wanted to <br/>\nsign up for a children&#39;s Chinese class at a local college.  She <br/>\nenjoyed it even though it was schooly.  But I was worried that she <br/>\nwasn&#39;t interested in studying for it and worried that she wouldn&#39;t do <br/>\nwell on the quizzes.  So I &quot;strongly encouraged&quot; (as in I made up <br/>\nflash cards and practically made her sit and study with me).  If she <br/>\ncould have just gone and listened to the lessons but then not worried <br/>\nabout &quot;studying&quot; that would have been cool.  Then she could have just <br/>\nhung out with her Chinese speaking friends and she probably would <br/>\nhave really enjoyed it and maybe would have stuck with it.  But <br/>\nI &quot;encouraged&quot; her interest in Chinese by &quot;studying&quot; with her and now <br/>\nshe isn&#39;t interested anymore.  <br/>\n<br/>\nShe played soccer for several years.  Last year for whatever reason <br/>\nshe really started disliking it. I think she was never really <br/>\npassionate about it but tolerated it ok. Before I was really into <br/>\nunschooling, I thought she needed a physical activity to make her <br/>\nactivities &quot;well rounded&quot; so I said, &quot;Let&#39;s sign up for soccer!&quot;  The <br/>\nlonger we were unschooling the more she really started knowing who <br/>\nshe is and knowing what she did and didn&#39;t want to do.  I think she <br/>\njust finally realized, &quot;This isn&#39;t me&quot; and started resisting it. (And <br/>\nI consider that to have been a healthy response and I&#39;m glad she got <br/>\nto that point where she knows Who She Is!)    She never wanted to go <br/>\nto practices and games.  I started &quot;making&quot; her go because of her <br/>\ncommitment to the team, telling her she didn&#39;t need to sign up again <br/>\nbut it wouldn&#39;t be nice to leave the team short on players.  It got <br/>\nvery unpleasant for her and for the whole family. Who wants to drive <br/>\n30 minutes to cheer on a player who doesn&#39;t want to be playing?  It <br/>\nstarted to become SO terrible getting her to go to those games that I <br/>\njust let her quit.  There weren&#39;t waiting lists for her team and she <br/>\nprobably left the team short on players (but still able to play if <br/>\nnot too many kids got sick at once).  <br/>\n<br/>\nMy son asked me to sign him up for soccer.  He said he wanted to, he <br/>\nknew what was involved, we bought him a uniform.  He was 5 1/2.  He <br/>\nhadn&#39;t realized how hard it would be for him to go out on the field <br/>\nwithout me.  So I started going out on the field and practicing <br/>\nsoccer with him, but it started to get to the point where he wanted <br/>\nto go off to the other side of the field, away from the other kids by <br/>\nourselves.  I kept trying to gravitate us to at least be playing in <br/>\nthe general area of the rest of the kids on the team.  He hated <br/>\nthat.  I ended up letting him quit before they even had their first <br/>\ngame because at the last practice we went to I couldn&#39;t even get him <br/>\nto get out of the car.  I would have had to literally drag him to the <br/>\nfield, and what good would that have done?  <br/>\n<br/>\nMy youngest son (who&#39;s 4 1/2 now) has recently been expressing an <br/>\ninterest in signing up for soccer.  I told him he could when he turns <br/>\n5 (our league&#39;s minimum age) and talked to him about it awhile.  I <br/>\ntold him it would be so fun for us to bring our lawn chairs and sit <br/>\non the sidelines and watch him play.  He said, &quot;No, I want you to <br/>\nsign up with me mommy&quot;.  I said that I could sign up to be a team <br/>\nparent or an assistant coach and come to all his practices and games, <br/>\nbut that&#39;s not what he wanted.   He wanted me to have a uniform too <br/>\nand play right alongside him.  Like a mother-son soccer team!  In the <br/>\nend, he told me that he wouldn&#39;t sign up unless I&#39;d sign up with <br/>\nhim.  :)  We do everything else together, he doesn&#39;t understand that <br/>\nthere are some activities where moms can&#39;t &quot;sign up&quot; right along with <br/>\ntheir kids.  <br/>\n<br/>\nSheila<br/>\n<br/>\n<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt;        The most painful unschooling mistake I made wasn&#39;t with <br/>\n </span></blockquote>sports or <br/>\n<blockquote><span title=\"ireply\"> &gt; games, but with piano and violin lessons. Sigh. All with the very <br/>\n </span></blockquote>best intentions <br/>\n<blockquote><span title=\"ireply\"> &gt; and only because our dd was genuinely interested. <br/>\n&gt; <br/>\n&gt;        In this one area of our unschooling lives, I thought <br/>\n </span></blockquote>somewhat like <br/>\n<blockquote><span title=\"ireply\"> &gt; Lillian sounds, with my circular justification that if dd liked it <br/>\n </span></blockquote>and wanted it, <br/>\n<blockquote><span title=\"ireply\"> &gt; my job was to back up the organization we&#39;d found to deliver it to <br/>\n </span></blockquote>her, and <br/>\n<blockquote><span title=\"ireply\"> &gt; to make sure she got what she wanted in full measure even in spite <br/>\n </span></blockquote>of herself! &lt;<br/>\n<blockquote><span title=\"ireply\"> &gt; rueful grin&gt;<br/>\n&gt; <br/>\n&gt;        So I now tend to see organized sports versus outdoor play <br/>\n </span></blockquote>the way I <br/>\n<blockquote><span title=\"ireply\"> &gt; see music lessons with required practice versus rock guitar or <br/>\n </span></blockquote>drums in the <br/>\n<blockquote><span title=\"ireply\"> &gt; garage or bedroom  when we were growing up -- <br/>\n&gt; <br/>\n&gt;        Or sleeping late after reading in bed under the covers <br/>\n </span></blockquote>versus missing <br/>\n<blockquote><span title=\"ireply\"> &gt; the schoolbus after staying up late to get the homework finished?<br/>\n&gt;            <br/>\n&gt;        I suggest that what truly matters isn&#39;t how much emphasis <br/>\n </span></blockquote>the activity <br/>\n<blockquote><span title=\"ireply\"> &gt; gets but who decides the emphasis, in other words whether such <br/>\n </span></blockquote>activity is <br/>\n<blockquote><span title=\"qreply\"> &gt; &quot;adult controlled&quot; or honestly belongs to the kids.   JJ<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":7143857,"authorName":"jrossedd@aol.com","from":"jrossedd@...","profile":"jrossedd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Being allowed to quit  was: Radical vs. Regular?","postDate":"1072191254","msgId":86651,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFkOC4xNzJlODVlNi4yZDE5YjExNkBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":86680,"prevInTime":86650,"nextInTime":86652,"topicId":86651,"numMessagesInTopic":0,"msgSnippet":"In a message dated 12/23/2003 8:05:12 AM Eastern Standard Time, ... But whether sports, or music, or reading or math or Latin, is over- or under- emphasized in","messageBody":"<div id=\"ygrps-yiv-666623753\">In a message dated 12/23/2003 8:05:12 AM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingdad@...\">unschoolingdad@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I think way too much emphasis is put on sports in general.  No matter what, <br/>\n&gt; it IS only a game.  If my kids choose to stop participating, fine.  I think <br/>\n&gt; it&#39;s usually the parents that get caught up in the pseudo-importance of <br/>\n&gt; keeping the team going, and can sometimes lose track of the things that really ARE <br/>\n&gt; important.  Leaving a team or group is not a life or death situation, but <br/>\n&gt; some people seem to look at it that way.  A sense of commitment is important in <br/>\n&gt; life, but I think being able to ascertain which commitments are truly <br/>\n&gt; important is a life lesson in itself.  Dropping out of a soccer or football team <br/>\n&gt; does not make the Truly Important list, IMO.  It&#39;s only a game.  <br/>\n&gt; <br/>\n&gt; Lyle <br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>       But whether sports, or music, or reading or math or Latin, is over- or <br/>\nunder- emphasized in our culture isn&#39;t Truly Important either, is it? <br/>\n<br/>\n       Video and fantasy gaming are &quot;only a game&quot; too but individual kids <br/>\noften deem such games Truly Important, with no parent coaching or modeling or <br/>\nadmonishing or reminding to stick with it for their own good. (I hope adults <br/>\naren&#39;t taking over this realm as they have so many kids&#39; sports?)<br/>\n<br/>\n       The most painful unschooling mistake I made wasn&#39;t with sports or <br/>\ngames, but with piano and violin lessons. Sigh. All with the very best intentions <br/>\nand only because our dd was genuinely interested. <br/>\n<br/>\n       In this one area of our unschooling lives, I thought somewhat like <br/>\nLillian sounds, with my circular justification that if dd liked it and wanted it, <br/>\nmy job was to back up the organization we&#39;d found to deliver it to her, and <br/>\nto make sure she got what she wanted in full measure even in spite of herself! &lt;<br/>\nrueful grin&gt;<br/>\n<br/>\n       So I now tend to see organized sports versus outdoor play the way I <br/>\nsee music lessons with required practice versus rock guitar or drums in the <br/>\ngarage or bedroom  when we were growing up -- <br/>\n<br/>\n       Or sleeping late after reading in bed under the covers versus missing <br/>\nthe schoolbus after staying up late to get the homework finished?<br/>\n           <br/>\n       I suggest that what truly matters isn&#39;t how much emphasis the activity <br/>\ngets but who decides the emphasis, in other words whether such activity is <br/>\n&quot;adult controlled&quot; or honestly belongs to the kids.   JJ<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":86537,"nextTopicId":86686}}