{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"dezignarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] Questions about unschooling","postDate":"1065089917","msgId":81891,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDAwMWMzODhjZSQ4ZjAyOWVlMCQzNDAwYThjMEByb2J5bm1hY2hpbmU+","inReplyToHeader":"PDAwMDcwMWMzODc2ZSQ0MDI2NzNjMCQ4ZTAyYThjMEBDYXRoeT4="},"prevInTopic":81851,"nextInTopic":0,"prevInTime":81890,"nextInTime":81892,"topicId":81794,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-29988378\">&lt;&lt;We will live overseas by the time she&#39;s 6 years old.  I don&#39;t know<br/>\nwhich country we will live in, but it could be anywhere around the<br/>\nworld.<br/>\nThey may or may not have great schools in the country we will be in.&gt;&gt;<br/>\n<br/>\n <br/>\n<br/>\nEvery country has different statutes about schooling and what is school<br/>\nage. It may be worth checking these first, if you have a choice about<br/>\nwhere you will be living.<br/>\n<br/>\n <br/>\n<br/>\n&lt;&lt;My daughter is in preschool now and loves being w/ children.  She<br/>\nwouldn&#39;t like being at home if she didn&#39;t get lots of involvement with<br/>\nother children.  She&#39;s very smart and is very precocious for her age.&gt;&gt;<br/>\n<br/>\n <br/>\n<br/>\nMy daughter is almost 4, and constantly surprises me. When people have<br/>\ncome here as beginning Unschoolers, they often make statements about<br/>\nwhat *would* happen, or what their child *would* do - especially along<br/>\nthe lines of &quot;if I let him, he would play video games/eat nothing but<br/>\ncandy/lie on the sofa watching TV all day long&quot;. If they are later able<br/>\nto embrace Unschooling freedoms, they find that these negative future<br/>\npredictions are not fulfilled. Perhaps you would find that your<br/>\ndaughter&#39;s social needs *would* be filled easily by playgroups,<br/>\nhomeschool support groups, neighborhood children, children she meets up<br/>\nwith by chance at the park, playdates at your house, teens that babysit,<br/>\nother adults that are your neighbors and friends, teachers and class<br/>\nmates that she meets in the course of things like dance or music<br/>\nclasses, her favorite librarian at the library, the kind cashier at the<br/>\nlocal grocery store, and last but by no means least, you yourself.<br/>\nUnschoolers assume that our children will interact with a wide variety<br/>\nof people of all ages, without the added burden of having their time<br/>\ncircumscribed by the dictates of the preschool curriculum.<br/>\n<br/>\n <br/>\n<br/>\n&lt;&lt;Some of my goals for her education include reading the classics and<br/>\nmathematics. &gt;&gt;<br/>\n<br/>\n <br/>\n<br/>\nUnschooling is about the child&#39;s goals for their life, right now and in<br/>\nthe future. &quot;Reading the classics&quot; is not a goal or endpoint, but<br/>\ncertainly a process, and perhaps a symbol of attainment for you.<br/>\nPersonally I return to classics I like many times - I am just now<br/>\nre-reading all of my Jane Austen&#39;s. The best way to inspire a love of<br/>\nthe classics is for her to see you reading and enjoying them yourself.<br/>\nMany have been made into movies and mini-series. Watching and comparing<br/>\nthe different interpretations from book to screen is something I love<br/>\ndoing for myself.<br/>\n<br/>\n <br/>\n<br/>\n&lt;&lt;I believe that math teaches logicalness and helps w/ all<br/>\nfunctions of life.  W/out math, I am condemning my child to poor wages.<br/>\nNo matter what I end up choosing for school,  I will hire a math<br/>\nteacher.&gt;&gt;<br/>\n<br/>\n <br/>\n<br/>\nThe amount of resources available to someone seeking to learn math for<br/>\ninterest to themselves are immense - books, internet, computer assisted<br/>\nprograms and computer games, and of course, tutors or teachers. However<br/>\na teacher is as useless for a disinterested homeschooler as they are for<br/>\na disinterested regular school student - without interest there will be<br/>\nno real understanding. The key difference is interest and need for math.<br/>\nHow many people in general society can&#39;t balance their checkbook, or<br/>\nhave a fuzzy notion of how the interest on their credit cards works? (I<br/>\nfit both those sorry categories). This is the result of &quot;teaching&quot; math<br/>\nfor 12+ years to people who are not interested in or ready for learning<br/>\nit, or have become phobic due to undue pressure, or have just forgotten<br/>\nafter the test was over. It is just not true that without knowing math<br/>\nyou can&#39;t earn a good wage, nor does knowing it assure you of one. The<br/>\nvery success of authors like Suze Orman attests to the general confusion<br/>\nabout money and math. Someone else mentioned using money for real<br/>\ntransactions, instead of false transactions as in the problems in text<br/>\nbooks. Jayn loves handing money to the cashier when buying something,<br/>\nand receiving change. In fact she gets irate if I try to get to near her<br/>\nin line.<br/>\n<br/>\n&lt;&lt;Can someone explain a bit more about unschooling?  I&#39;ve been reading<br/>\nthe<br/>\ngroup- but I&#39;m not getting a feel for it. &gt;&gt;<br/>\n<br/>\n <br/>\n<br/>\nThe list is currently discussing certain issues. Others come up at<br/>\nregular intervals. The archives can be searched by subject. The Message<br/>\nBoard archives have been further organized into broad topics and can<br/>\nfurnish endless hours of pleasurable research. I sometimes go there,<br/>\njust because I want a shot of pure joy in children.<br/>\n<br/>\n&lt;&lt;How do you ensure the child is meeting the criteria for a given year?<br/>\nWhat happens if your weak in a subject?&gt;&gt;<br/>\n<br/>\n <br/>\n<br/>\nThis is schoolish jargon. Read about deschooling for your child and<br/>\nyourself. Part of it is letting go of the language of &quot;education&quot;.<br/>\nOften merely making all-or-nothing statements in posting to the list is<br/>\nlikely to get a good long discussion started.<br/>\n<br/>\n <br/>\n<br/>\n&lt;&lt;Does the unschooling method result in children being accepted at top<br/>\nuniversities?&gt;&gt; <br/>\n<br/>\n <br/>\n<br/>\nIt is not a &quot;method&quot;. It is a philosophy of life. Others have already<br/>\nanswered &quot;yes&quot; you can get into colleges. One new book - &quot;The<br/>\nUnprocessed Child&quot;.<br/>\n<br/>\n <br/>\n<br/>\n&lt;&lt;Are the children learning more at home? &gt;&gt;<br/>\n<br/>\n <br/>\n<br/>\nThis is a question that bears examining. Most of us here believe that<br/>\neveryone is learning all the time - including unconsciously. Children<br/>\n*are* learning all day in classrooms. Children are still learning when<br/>\nthey leave the classroom each day - but what are they learning? Some of<br/>\nthe critiques of school point out that may be learning how to stifle<br/>\ntheir energy, or how to fit in with a crowd, or how to fool the teachers<br/>\n(see John Holt), or how to get away with the least amount of effort, or<br/>\nhow to pass a test without true understanding, or how to look<br/>\ninterested, but allow the mind to wander. Or they may learn that their<br/>\nparents are afraid of being seen as different from their neighbors, or<br/>\nthat their parents only approve of them according to their grades, or<br/>\nthat people should be categorized according to their superficial<br/>\nabilities in certain areas and that these categories are immutable and<br/>\neternal. (Now you see why I generally avoid getting drawn in to school<br/>\nconversations).<br/>\n<br/>\nThe answer is not learn &quot;more&quot;, but learn different and real stuff in<br/>\nvery different ways.<br/>\n<br/>\n <br/>\n<br/>\n&lt;&lt;I read about the family where the son was tanning hides to learn how<br/>\nthe<br/>\npioneers did it.  I thought that was great.&gt;&gt;<br/>\n<br/>\n <br/>\n<br/>\nI think it is great *if* the son was interested in learning how to tan<br/>\nhides at the time, or had a passion for Pioneer history, or was hoping<br/>\nto be on the next PBS Pioneer House series. I also think that there are<br/>\nother ways to learn about the pioneer methods than actually recreating<br/>\nthem, and it would depend on the need of the learner.<br/>\n<br/>\nI further think that learning to tan hides could have its own value,<br/>\nrather than necessarily being part of any history Unit Study, or being<br/>\nturned into a &quot;teachable moment&quot;. One thing that Unschoolers are able to<br/>\nsimply renounce is the need to deconstruct every experience into<br/>\nacademic study terms. (eg Chemistry for the tanning chemicals, Math for<br/>\nthe measuring, History, Anthropology, Biology of the animal). I know<br/>\nthat some States require everyone to go through these exercises in<br/>\nlabeling. I&#39;m glad to live in California. <br/>\n<br/>\nFor some reason I keep thinking of Sandra&#39;s essay about &quot;Moving the<br/>\nPuddle&quot;, and how if you then spend all your time seeking a puddle that<br/>\nneeds moving, you could miss some other equally rewarding experience.<br/>\n<br/>\n<br/>\n&lt;&lt;Why did you choose this method?&gt;&gt;  <br/>\n<br/>\n<br/>\n<br/>\n(See earlier comment - not method, philosophy) My husband and I<br/>\ninitially were interested in homeschooling from the negative point of<br/>\nview - we were dubious about the state of Public Schools in CA, and<br/>\nunable to afford private schools. Then the research started. I felt that<br/>\nI was being led on a path through John Holt, Gatto, various e-lists and<br/>\nmessage boards into believing that home education was good for its own<br/>\nsake. Holt says that home is better than even the best school. I<br/>\nfollowed another list member to this list at her recommendation, Pam S.<br/>\nto whom I owe eternal gratitude. I have been mentally and emotionally<br/>\nchallenged, and am so happy with our choice. I feel like I have nothing<br/>\nbut bliss ahead of us in our journey as a family. Not to say there won&#39;t<br/>\nbe challenges - but they will not be of some schoolteacher&#39;s making. I<br/>\nwas the head of my grade from 6th grade through 12th (dux of the school<br/>\n- I think that is the same as Valedictorean in USA) at one of the finest<br/>\nprivate girls&#39; schools in Australia. I have had my own deschooling<br/>\nprocess to go through, including realizing that my pride in my education<br/>\nhas been in no way justified my dissipated professional life. Must have<br/>\nbeen a low wage earner because I was only second in my class in Math. ;)<br/>\nOh no wait - it was because I chose to work until the last 10 years in<br/>\nthe fringes of radical theater.<br/>\n<br/>\n <br/>\n<br/>\nRobyn Coburn<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nYahoo! Groups Sponsor<br/>\n<br/>\n<br/>\n<br/>\nADVERTISEMENT<br/>\n <br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://rd.yahoo.com/M=256694.4002236.5216697.1261774/D=egroupweb/S=1705\">http://rd.yahoo.com/M=256694.4002236.5216697.1261774/D=egroupweb/S=1705</a><br/>\n081972:HM/A=1784493/R=0/id=noscript/SIG=11q7p9e7k/*http:/webevents.yahoo<br/>\n.com/universal/intolerablecruelty/&gt; <br/>\n<br/>\n<br/>\n <br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://us.adserver.yahoo.com/l?M=256694.4002236.5216697.1261774/D=egrou\">http://us.adserver.yahoo.com/l?M=256694.4002236.5216697.1261774/D=egrou</a><br/>\npmail/S=:HM/A=1784493/rand=807030717&gt; <br/>\n<br/>\n<br/>\n&quot;List Posting Policies&quot; are provided in the files area of this group. <br/>\n<br/>\nTo unsubscribe from this send an email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a> <br/>\n<br/>\nVisit the Unschooling website and message boards:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> <br/>\n<br/>\nYour use of Yahoo! Groups is subject to the Yahoo!<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a>&gt;  Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":77522235,"authorName":"Julie Bogart","from":"&quot;Julie Bogart&quot; &lt;julie@...&gt;","profile":"juliecinci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Questions about unschooling","postDate":"1065019146","msgId":81851,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJsZW91YSs0dTk0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJCQTA0NjI2LjFGMUJEJWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":81848,"nextInTopic":81891,"prevInTime":81850,"nextInTime":81852,"topicId":81794,"numMessagesInTopic":0,"msgSnippet":"Fantastic post Joyce. Glad you re moderator. :) ... but if you aren t willing to ... be frustrated ... What a great summary. One thing I ve noticed about my","messageBody":"<div id=\"ygrps-yiv-958223138\">Fantastic post Joyce. Glad you&#39;re moderator. :)<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, Fetteroll <br/>\n&lt;fetteroll@e...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; on 9/30/03 12:16 PM, cathy at cdgni@y... wrote:<br/>\n<br/>\n </span></blockquote>but if you aren&#39;t willing to<br/>\n<blockquote><span title=\"ireply\"> &gt; put joy, freedom and happiness before academic goals, you&#39;ll <br/>\n </span></blockquote>be frustrated<br/>\n<blockquote><span title=\"ireply\"> &gt; by unschooling.<br/>\n<br/>\n </span></blockquote>What a great summary.<br/>\n<br/>\nOne thing I&#39;ve noticed about my kids is that they don&#39;t have the <br/>\nsame reaction to rote learning that we schooled adults do. They <br/>\ndon&#39;t see the point of it. In fact, my two very moral kids explained <br/>\nthat they could see cheating as a viable way to get through <br/>\n&quot;school&quot; since kids were being forced to study what they don&#39;t <br/>\nwant to learn. Cheating is one way to avoid spending precious <br/>\nlife time studying what you don&#39;t care about so that the time could <br/>\nbe better spent on personal interests. Jaw dropped at this one.<br/>\n<br/>\nWe then had a discussion about what to do when you feel <br/>\ncoerced or oppressed (ways that preserve your integrity but <br/>\nminimize compliance with coercion). It was enlightening. <br/>\n<br/>\nThe revelatory moment for me, however, was realizing how much  <br/>\nI was still controlled by the belief that someone else (system, <br/>\nauthority) could be in charge of what I learn and how I spend my <br/>\ntime. My kids don&#39;t hold that belief. Amazing.<br/>\n<br/>\nJulie B</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Questions about unschooling","postDate":"1065012710","msgId":81848,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJCQTA0NjI2LjFGMUJEJWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDAwMDcwMWMzODc2ZSQ0MDI2NzNjMCQ4ZTAyYThjMEBDYXRoeT4="},"prevInTopic":81845,"nextInTopic":81851,"prevInTime":81847,"nextInTime":81849,"topicId":81794,"numMessagesInTopic":0,"msgSnippet":"... The goals of unschooling are different than those of school or academic leaning forms of homeschooling. Our goal is for our children to be happy and pursue","messageBody":"<div id=\"ygrps-yiv-1188279653\">on 9/30/03 12:16 PM, cathy at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:cdgni@...\">cdgni@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Some of my goals for her education include reading the classics and<br/>\n&gt; mathematics.<br/>\n<br/>\n </span></blockquote>The goals of unschooling are different than those of school or academic<br/>\nleaning forms of homeschooling.<br/>\n<br/>\nOur goal is for our children to be happy and pursue what they enjoy. Most<br/>\npeople have that goal too, but they believe children need prepared to do<br/>\nwhat they enjoy. We know that people will do what they need to do to do what<br/>\nthey enjoy when given the freedom to do it.<br/>\n<br/>\nYour life could look like unschooling if your daughter loved the classics<br/>\nand math. But if she didn&#39;t then the options in reaching your goal could<br/>\ninclude some unhappiness on her part, doing things she didn&#39;t enjoy as much<br/>\nas others, in order to get where you wanted her to go.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I believe that math teaches logicalness and helps w/ all<br/>\n&gt; functions of life.  W/out math, I am condemning my child to poor wages.<br/>\n&gt; No matter what I end up choosing for school,  I will hire a math<br/>\n&gt; teacher.<br/>\n<br/>\n </span></blockquote>And unschoolers know that math exists in life and that a better foundation<br/>\nthan years of teaching is using math and understanding it conceptually. It&#39;s<br/>\nfar easier to absorb what percentages are and what and how they&#39;re used and<br/>\n*then* tackle formal math than to tackle formal math while also trying to<br/>\nabsorb the concepts divorced from actually using them for real personally<br/>\nmeaningful reasons.<br/>\n<br/>\n(That is a word problem about buying a $5.74 toy with $10 isn&#39;t the same as<br/>\nactually having $10 and weighing all the factors involved in what to spend<br/>\nit on or even maybe to save it for something more costly.)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; How do you ensure the child is meeting the criteria for a given year?<br/>\n<br/>\n </span></blockquote>There are no school criteria for unschooling. Our children learn what they<br/>\nneed to as they need it.<br/>\n<br/>\nThere are state requirements. The message boards at Unschooling.com have<br/>\nfolders where unschoolers share how they unschooling and meet requirements.<br/>\n<br/>\nWhat criteria did you set up for you daughter acquiring English as a<br/>\ntoddler? How did you ensure she was meeting the criteria?<br/>\n<br/>\nIf you had no criteria, how did she learn to speak?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; What happens if your weak in a subject?<br/>\n<br/>\n </span></blockquote>What happens if you don&#39;t know about something that you want to know about?<br/>\nDo you find a way to learn it?<br/>\n<br/>\nPeople who are not a natural in subject and really need it for something<br/>\nthey love will learn what they need. Or they will learn it if they haven&#39;t<br/>\nexperienced years of having it forced on them which gives them the idea that<br/>\nit&#39;s hard and boring. People who aren&#39;t a natural at something they don&#39;t<br/>\nneed don&#39;t need to waste their time learning it. When people are honest with<br/>\nthemselves, they realize all the stuff that they learned that they&#39;ve never<br/>\nused.<br/>\n<br/>\nWhat people fear, though, is the things they&#39;ve needed that they assume<br/>\nthey&#39;d never have learned on their own because they were hard and boring.<br/>\nBut they&#39;re looking at learning from the point of view of someone who has<br/>\nbeen forced to learn abstract things in dull ways. The point of view of<br/>\nsomeone who hasn&#39;t had that -- who has instead learned by using -- is very<br/>\ndifferent. It isn&#39;t useful to extrapolate what an unschooled child would do<br/>\nfrom our own school experiences.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Does the unschooling method<br/>\n&gt; result in children being accepted at top universities?<br/>\n<br/>\n </span></blockquote>There was a woman who spoke at the Live and Learn unschooling conference in<br/>\nSC whose daughter got into Harvard. But Harvard isn&#39;t the goal of<br/>\nunschooling.<br/>\n<br/>\nUnschooling children will take the paths that will get where *they* want to<br/>\ngo, which might be through a top universtiy. But the unschooling path<br/>\ndoesn&#39;t lead to top universities. If you can see the distinction.<br/>\n<br/>\nThe goal of airlines is to get people where they want to go. If you want to<br/>\nget to California, an airline can get you there. But getting people to<br/>\nCalifornia isn&#39;t the focus of the airlines.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; What does a<br/>\n&gt; typical day look like for you?<br/>\n<br/>\n </span></blockquote>A typical day is much like a weekend day. (Except with more shopping ;-) No<br/>\nreason to torture myself fighting weekend shopping crowds.) My daughter<br/>\nfollows whatever she enjoys. I run things by her that she might enjoy.<br/>\n<br/>\nPeople often post their days here. If you go back in the archives you should<br/>\nbe able to find them.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; What is being taught at home that isn&#39;t<br/>\n&gt; being done in the school?<br/>\n<br/>\n </span></blockquote>No teaching involved. It&#39;s all learning. Unschooled kids are learning by<br/>\ndoing real things that they enjoy. My daughter spends a lot of time doing<br/>\nthings that support her love of telling stories about interesting people and<br/>\ncreatures in words and pictures: reading and drawing comics, watching<br/>\ncartoons, playing video games and so on.<br/>\n<br/>\nIt&#39;s the freedom to explore is the big defining factor between unschooling<br/>\nand school rather than what is or isn&#39;t &quot;taught&quot;.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Are the children learning more at home?<br/>\n<br/>\n </span></blockquote>Depends how you define it. The traditional definition of learning has to do<br/>\nwith how much testable type of information kids can spit back onto a test.<br/>\n<br/>\nThe way unschooled kids learn is very different. It&#39;s based more on the<br/>\nconnections kids can make with other things in the world rather than what<br/>\nthey can memorize. It&#39;s how your child learned to speak as opposed to how we<br/>\nall (didn&#39;t) learn a foreign language in school. It&#39;s all *real* learning<br/>\nbecause it&#39;s being put to use as opposed to memorizing abstract stuff that<br/>\nmight be useful for the future.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I<br/>\n&gt; read about the family where the son was tanning hides to learn how the<br/>\n&gt; pioneers did it.  I thought that was great.<br/>\n<br/>\n </span></blockquote>You might be more interested in eclectic homeschooling or relaxed<br/>\nhomeschooling or unit studies. Obviously I don&#39;t think they&#39;re as good for<br/>\nthe goal I want to reach or I&#39;d be using them, but if you aren&#39;t willing to<br/>\nput joy, freedom and happiness before academic goals, you&#39;ll be frustrated<br/>\nby unschooling.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Why did you choose this method?<br/>\n<br/>\n </span></blockquote>Because the unschoolers on the message board were having a whole lot more<br/>\nfun than those practicing any other methods. :-) And of my goals was for<br/>\nlearning to be fun. The other methods often involved finding fun ways to get<br/>\ninformation into my daughter, which involved a huge amount of combing<br/>\nthrough products and spending money on things that it&#39;s possible she&#39;d turn<br/>\nher nose up at.<br/>\n<br/>\nIt&#39;s lots easier (and we can spend money on things she actually wants to<br/>\nuse) to support her interests rather than support finding ways to get her<br/>\ninterested in the things I felt were important.<br/>\n<br/>\nIt&#39;s okay if you don&#39;t believe what I say or don&#39;t think it&#39;s for you.<br/>\nUnschooling works for others whether you believe it does or not. But for it<br/>\nto work for you, you&#39;ll need to want what it offers and understand how it<br/>\nwill get you there.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":41665094,"authorName":"cathy","from":"&quot;cathy&quot; &lt;cdgni@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Questions about unschooling","postDate":"1064938602","msgId":81845,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDcwMWMzODc2ZSQ0MDI2NzNjMCQ4ZTAyYThjMEBDYXRoeT4=","inReplyToHeader":"PDAwNDcwMWMzODc2NyRiZjY1YjFjMCQ2NDAxYThjMEBvZW1jb21wdXRlcj4="},"prevInTopic":81803,"nextInTopic":81848,"prevInTime":81844,"nextInTime":81846,"topicId":81794,"numMessagesInTopic":0,"msgSnippet":"I m new and trying to decide on the various methods of home schooling. I m not sold on any idea at present. This is our situation.  I am a single mother and","messageBody":"<div id=\"ygrps-yiv-1199813361\">I&#39;m new and trying to decide on the various methods of home schooling.<br/>\nI&#39;m not sold on any idea at present.<br/>\n<br/>\nThis is our situation.  I am a single mother and will work outside the<br/>\nhome.  However,  I can afford to hire someone to teach w/in the home.<br/>\nWe will live overseas by the time she&#39;s 6 years old.  I don&#39;t know which<br/>\ncountry we will live in, but it could be anywhere around the world.<br/>\nThey may or may not have great schools in the country we will be in.<br/>\n<br/>\nMy daughter is in preschool now and loves being w/ children.  She<br/>\nwouldn&#39;t like being at home if she didn&#39;t get lots of involvement with<br/>\nother children.  She&#39;s very smart and is very precocious for her age.  <br/>\n<br/>\nSome of my goals for her education include reading the classics and<br/>\nmathematics.  We are currently reading about Sinbad now.  The book is<br/>\nfor a much older child- but she enjoys it. We read and talk about it<br/>\nnightly. I believe that math teaches logicalness and helps w/ all<br/>\nfunctions of life.  W/out math, I am condemning my child to poor wages.<br/>\nNo matter what I end up choosing for school,  I will hire a math<br/>\nteacher.<br/>\n<br/>\nCan someone explain a bit more about unschooling?  I&#39;ve been reading the<br/>\ngroup- but I&#39;m not getting a feel for it.  <br/>\n<br/>\nHow do you ensure the child is meeting the criteria for a given year?<br/>\nWhat happens if your weak in a subject?  Does the unschooling method<br/>\nresult in children being accepted at top universities? What does a<br/>\ntypical day look like for you? What is being taught at home that isn&#39;t<br/>\nbeing done in the school?  Are the children learning more at home?  I<br/>\nread about the family where the son was tanning hides to learn how the<br/>\npioneers did it.  I thought that was great.<br/>\nWhy did you choose this method?  Have any of you put your kids back into<br/>\npublic/private school after doing this for a while?  If so, why?<br/>\n<br/>\nCathy</div>","specialLinks":[]},{"userId":109856460,"authorName":"nellebelle","from":"&quot;nellebelle&quot; &lt;nellebelle@...&gt;","profile":"lamaribelle","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] OT-need advice on unjobbing/single mother unschoo...","postDate":"1064935740","msgId":81803,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNDcwMWMzODc2NyRiZjY1YjFjMCQ2NDAxYThjMEBvZW1jb21wdXRlcj4=","referencesHeader":"PDE3ZS4yMGJmZTE1Zi4yY2FhZDMwM0Bhb2wuY29tPg=="},"prevInTopic":81794,"nextInTopic":81845,"prevInTime":81802,"nextInTime":81804,"topicId":81794,"numMessagesInTopic":0,"msgSnippet":" A woman in my community teaches Spanish","messageBody":"<div id=\"ygrps-yiv-1621194012\">&lt;&lt;&lt;Does anyone out there have resources for working out of the home? I am <br/>\ncompletely bilingual(Spanish/English).&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nA woman in my community teaches Spanish to children in her home.  We took one session a year ago in preparation for a trip to Mexico.  It was definitely too schoolish for me, but there are lots of people out there who want that sort of experience.  She started out with one class, word spread, and she is not quite busy.  The thing I liked best about her class is that she wanted the parents to stay.  Not all did though, as it wasn&#39;t required.  She used Risas and Sonrisas.  The program incorporates lots of games.<br/>\n<br/>\nMary Ellen<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":126884268,"authorName":"HMSL2@aol.com","from":"HMSL2@...","profile":"dobsiedoe","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] OT-need advice on unjobbing/single mother unschoo...","postDate":"1064925443","msgId":81794,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE3ZS4yMGJmZTE1Zi4yY2FhZDMwM0Bhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":81803,"prevInTime":81793,"nextInTime":81795,"topicId":81794,"numMessagesInTopic":0,"msgSnippet":"Put up a few free web sites and send emails to group moderators requesting permission to post to their lists. Not all say no. At the end of every email you","messageBody":"<div id=\"ygrps-yiv-1147303691\">Put up a few free web sites and send emails to group moderators requesting <br/>\npermission to post to their lists. Not all say no.<br/>\nAt the end of every email you write place your business information and web <br/>\naddress if you have one.  <br/>\nGet a list of new businesses and contract them about your product. Have them <br/>\npre pay only and with a minimum order. Send out some free ones to places that <br/>\nothers would view, be sure there is ample ads on the tapes and you should be <br/>\nable to grow your name that way also.<br/>\n<br/>\nWhen you have something together I would be interested. I have a son who is <br/>\nwanting to learn Spanish in a non traditional way.<br/>\n<br/>\n<br/>\nLaura<br/>\n&lt;&lt;&lt;Does anyone out there have resources for working out of the home? I am <br/>\ncompletely bilingual(Spanish/English). I am a former elementary school teacher, I <br/>\nam in final stages of production of a natural language learning video but <br/>\nwithout the cash to market it, a LLL leader, quick learner, versatile<br/>\n<br/>\nAny ideas? Feel free to contact me offline at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:wanderfree@...\">wanderfree@...</a><br/>\n<br/>\nThanks from a desperate mom, Christine<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":81833,"nextTopicId":81892}}