{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":2294225,"authorName":"freeform@juno.com","from":"freeform@...","profile":"freeform_ca","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] unschooling and working from home","postDate":"1018981527","msgId":35072,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIwNDE2LjExMzA0MS4tMjMwNzE5LjkuZnJlZWZvcm1AanVuby5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":35071,"nextInTime":35073,"topicId":35072,"numMessagesInTopic":0,"msgSnippet":"... anyone ... I m a single mom and I ve never gotten any money from Cacie s dad or anyone else (which is fine with me) so I ve had to work. For me, though, ","messageBody":"<div id=\"ygrps-yiv-896676547\">On Tue, 16 Apr 2002 04:57:12 -0700 marji &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:zintz@...\">zintz@...</a>&gt; writes:<br/>\n<blockquote><span title=\"ireply\"> &gt; By the way, what would be REALLY helpful to me would be to hear from <br/>\n </span></blockquote>anyone <br/>\n<blockquote><span title=\"ireply\"> &gt; who works from home and is unschooling and what that looks like in <br/>\n&gt; your  home.  That is the nut I am trying to crack.<br/>\n<br/>\n </span></blockquote>I&#39;m a single mom and I&#39;ve never gotten any money from Cacie&#39;s dad or<br/>\nanyone else (which is fine with me) so I&#39;ve had to work. For me, though,<br/>\nthe most important part is to live frugally enough that I don&#39;t need to<br/>\nearn a lot of money. *That* is actually something I&#39;m very good at, and<br/>\nthat&#39;s how I ended up having lots of money in the bank even though in the<br/>\npast 4 years I&#39;ve never made enough to owe any state income tax. I don&#39;t<br/>\nfeel deprived, and somehow we can afford things that our technically<br/>\nbetter-off friends can&#39;t, like riding lessons and theater camps... but <br/>\nwe don&#39;t buy a lot of stuff we don&#39;t need, we don&#39;t buy a lot of<br/>\npre-packaged food, we stock up during sales, we don&#39;t eat much meat, we<br/>\naccept all hand-me-downs and shop thrift stores, and we use libraries a<br/>\nlot.<br/>\n<br/>\nI worked for two years as an indpependent study teacher for a charter<br/>\nschool, and for part of that I was regional coordinator. The job required<br/>\nmeeting with about 15 families once a month, usually in their home, one<br/>\nor two monthly meetings, and lots of paperwork at home. Most of the<br/>\nfamilies had kids Cacie liked, so she would come with me - if she didn&#39;t<br/>\nwant to come, I left her with a friend. I did a lot of paperwork while we<br/>\nwatched tv in the evenings, or sometimes when she was asleep or visiting<br/>\na friend or had a friend over here. It helped that she had an active<br/>\nsocial life ;-)<br/>\n<br/>\nFor the past 6 months or so, I&#39;ve been making some money through selling<br/>\nthings on ebay and other places online. Cacie helps by spotting stuff at<br/>\nthift stores and yard sales - I give her half the profit on stuff she<br/>\nfinds - and by doing some of the photography for ebay. Other times,<br/>\nagain, she plays with friends, or reads, or does something that doesn&#39;t<br/>\nrequire much of my attention - although with everything I&#39;ve done, I can<br/>\nstop right away in an emergency, and if she has a question like &quot;Where is<br/>\nthe cream of tartar?&quot; I can usually come to a good stopping place in a<br/>\nfew minutes. I guess, basically, she has her stuff she&#39;s doing, and I<br/>\nhave my stuff, and sometimes we do stuff together... and mostly what I do<br/>\nfor $ is just my stuff.<br/>\n<br/>\nOn a typical day, I wake up an hour or two earlier than she does (she<br/>\noften goes to bed later than I do, usually reading). I drink coffee and<br/>\nread email, and that&#39;s a good time to get work done. During the day we<br/>\nusually have stuff going on, but she often  likes to relax and read or do<br/>\nthings by herself in the evening, so I can do my stuff, or else she&#39;ll go<br/>\nvisit the neighbors. If I know I have a lot to do in a short period of<br/>\ntime, I&#39;ll sometimes try to arrange for her to visit a friend, but it<br/>\ndoesn&#39;t come up much. <br/>\n<br/>\nDar</div>","specialLinks":[]}],"prevTopicId":35069,"nextTopicId":34943}}