{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":86585859,"authorName":"meghan anderson","from":"meghan anderson &lt;moonmeghan@...&gt;","profile":"moonmeghan","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Genetics and Religion","postDate":"1010123268","msgId":2098,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIwMTA0MDU0NzQ4LjYxOTQucW1haWxAd2ViMjA5MTAubWFpbC55YWhvby5jb20+","inReplyToHeader":"PDEwMTAxMTgzMzMuNjgzNy40MDkzNC5tMTBAeWFob29ncm91cHMuY29tPg=="},"prevInTopic":2090,"nextInTopic":0,"prevInTime":2097,"nextInTime":2099,"topicId":2068,"numMessagesInTopic":0,"msgSnippet":" Subject: Genetics and Religion Hi all.  I am new to this list Hiya Nanci! Nice to see you here. Loved your","messageBody":"<div id=\"ygrps-yiv-1196877727\">&lt;&lt;&lt;&lt;From: Nanci Kuykendall &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:aisliin@...\">aisliin@...</a>&gt;<br/>\nSubject: Genetics and Religion<br/>\n<br/>\nHi all.  I am new to this list&gt;&gt;&gt;&gt;<br/>\n<br/>\nHiya Nanci! Nice to &#39;see&#39; you here. Loved your post!<br/>\n<br/>\nMeghan :-)<br/>\n<br/>\n__________________________________________________<br/>\nDo You Yahoo!?<br/>\nSend your FREE holiday greetings online!<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://greetings.yahoo.com\">http://greetings.yahoo.com</a></div>","specialLinks":[]},{"userId":4635099,"authorName":"Nancy Wooton","from":"Nancy Wooton &lt;Felicitas@...&gt;","profile":"ikonstitcher","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Genetics and Religion","postDate":"1010118353","msgId":2090,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI4NUE2RTg4LjIwNkM4JUZlbGljaXRhc0BNYWMuY29tPg==","inReplyToHeader":"PDIwMDIwMTA0MDA0NDE5LjI4NDE2LnFtYWlsQHdlYjEzNzA5Lm1haWwueWFob28uY29tPg=="},"prevInTopic":2068,"nextInTopic":2098,"prevInTime":2089,"nextInTime":2091,"topicId":2068,"numMessagesInTopic":0,"msgSnippet":"... Thank you so much for your post! Likewise always learning, Nancy -- The more we live by our intellect, the less we understand the meaning of life. -Leo","messageBody":"<div id=\"ygrps-yiv-969280322\">on 1/3/02 4:44 PM, Nanci Kuykendall at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:aisliin@...\">aisliin@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I do not claim<br/>\n&gt; to be so wise as to say that anything is NOT Possible,<br/>\n&gt; or that I know more than a tiny bit about anything.<br/>\n&gt; Of course, I am still always learning.  ;-)<br/>\n<br/>\n </span></blockquote>Thank you so much for your post!<br/>\n<br/>\nLikewise always learning,<br/>\n<br/>\nNancy<br/>\n<br/>\n<br/>\n-- <br/>\nThe more we live by our intellect, the less we understand the meaning of<br/>\nlife. <br/>\n-Leo Tolstoy, author (1828-1910)</div>","specialLinks":[]},{"userId":67247159,"authorName":"Nanci Kuykendall","from":"Nanci Kuykendall &lt;aisliin@...&gt;","profile":"aisliin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"[AlwaysLearning] Genetics and Religion","postDate":"1010105059","msgId":2068,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIwMTA0MDA0NDE5LjI4NDE2LnFtYWlsQHdlYjEzNzA5Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDEwMDgzODMzNzAuMjI2OS4yMDAwMi5tM0B5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":2090,"prevInTime":2067,"nextInTime":2069,"topicId":2068,"numMessagesInTopic":0,"msgSnippet":"Hi all.  I am new to this list, but some of you may remember me from the Unschooling list, where I was from it s inception.  I have long ago put that list on ","messageBody":"<div id=\"ygrps-yiv-1325476158\">Hi all.  I am new to this list, but some of you may<br/>\nremember me from the Unschooling list, where I was<br/>\nfrom it&#39;s inception.  I have long ago put that list on<br/>\nno mail for various reasons, and a friend recommended<br/>\nI try Sandra&#39;s new list, so here I am.<br/>\n<br/>\nI was intrigued by these questions of Nancy&#39;s,<br/>\nalthough my intent was to read through all this<br/>\nbacklog of email that has built up from ISP problems<br/>\nlast month preventing my from accessng my email all<br/>\nmonth.  Ah well, I know better than to give myself<br/>\nexpectations (that dirty E word.)  <br/>\n<br/>\nJust remember that all these views are Mine, and so I<br/>\nclaim the right to be as Kooky as I wanna be.  In<br/>\nother words, don&#39;t confuse strong opinions with facts.<br/>\n What may be facts for me are simply facts for me, not<br/>\nnecessarily anyone else&#39;s reality.  Things are so<br/>\nsubjective in the spiritual aspects of our lives.  How<br/>\nwonderfully varied and rich a taperstry we weave. <br/>\nLike Ken Wilber&#39;s Specturm of Consciousness<br/>\nphilosophy, where all concious and unconscious thought<br/>\nand secular and spiritual beliefs are all part of the<br/>\nsame rich continuum, and all have merit and value<br/>\nwithout conflicting because they address differing<br/>\nlayers and facets of the spectrum.  Blue is no less<br/>\ndeep, satisfying and rich a color because Red is<br/>\nvibrant and alive.  They exist together yet apart,<br/>\nimportant and vital for their own qualities.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I have a deep topic knocking at the inside of my<br/>\n&gt;skull, trying to find its way out....  <br/>\n&gt;- Does faith depend on heredity?  <br/>\n<br/>\n </span></blockquote>I would hardly think that is true from the evidence of<br/>\nmine and my husband&#39;s families.  But that is not to<br/>\nsay that it is not possible.  ANYTHING is possible, in<br/>\nmy opinion.  My brother is athiest, my parents long<br/>\nago dissillusioned with churches and belongling to<br/>\nnone, but maintaining some vague, unspoken Lutheran<br/>\naffiliation.  My father&#39;s sisters are quite devout<br/>\nProtestants.<br/>\n<br/>\nMy husband&#39;s family are all passionate about their<br/>\nspiritual/religious path (men and women) but they have<br/>\nwildly differing paths.  We all respect each others<br/>\npaths and share holidays with each other accordingly. <br/>\nHis parents are devout Protestant as is his elder<br/>\nsister.  His younger sister is staunchly Jehovah<br/>\nWitness.  My husband and I are passionately eclectic<br/>\nPagan.  We all have strong values and beliefs and<br/>\nstrength and commitment in our faith.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Is there a brain structure or function which &gt;governs<br/>\n </span></blockquote>&quot;God&quot;?  <br/>\n<br/>\nSurely, as there is a brain structure which handles<br/>\nALL the varying parts of our complex selves.  I do not<br/>\nbelieve that this area of the brain &quot;creates&quot; our<br/>\nHigher Power for us, but perhaps helps determine in<br/>\nwhat ways we speak with and relate to that Higher<br/>\nPower.  How and where we find our faith is always very<br/>\nindividualized and personal, even between members of<br/>\nstrict sects.  No one has the exact same relationship<br/>\nwith the spirit or with their Higher Power.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;If a person who is religious can become an atheist<br/>\n&gt;because of depression, does it mean that faith, or<br/>\n </span></blockquote>the &gt;perception of God, or spirituality, is controlled<br/>\nby &gt;some function of the brain, which depression<br/>\n<blockquote><span title=\"ireply\"> &gt;interrupts?<br/>\n<br/>\n </span></blockquote>I suppose that is possible.  Although I can say from<br/>\npersonal experience that I have suffered from<br/>\ndepression in varying degrees all my life.  My<br/>\ndepression was worst as a child, beginning in infancy<br/>\nand continuing into adulthood.  During my childhood,<br/>\nin my questing, I was always a very spiritual person<br/>\nand immersed myself in the faiths and beliefs around<br/>\nme.  Luckily I grew up in San Francisco and had many<br/>\nto choose from.  I eventually found my spiritual home<br/>\nin the neo-Pagan movement when I was in my early teens<br/>\nand have ever found my faith to be a support for me in<br/>\nmy times of stress and depression.  I experienced deep<br/>\nepiphanies of faith while in black suicidal<br/>\ndepressions.  Connections with the weave of existance<br/>\nand my Higher Power often kept me alive in my<br/>\nchildhood, coming seemingly miraculously when I was at<br/>\nmy most self hating and apathetic, like a sweeping<br/>\nwave of passionate energy that swept me up and<br/>\nsustained me.  And no, they weren&#39;t drug induced.  LOL<br/>\n <br/>\n<br/>\nI have worshipped with many covens, groves, and<br/>\ngroups, but have never &quot;belonged&quot; to any church or<br/>\nideology.  I do not believe in organized religion<br/>\nbecause I believe that the journey of the spirit is<br/>\nvery intimate and personalized.  I would no more<br/>\nexpect my children or my husband&#39;s journeys through<br/>\ntheir lives to find spiritual fulfillment to echo my<br/>\nown, than I would follow my parent&#39;s apathetic path. <br/>\nGod/Goddess/Higher Power is a Mirror,(as the saying<br/>\ngoes.) Although the mirror never changes, each person<br/>\nwho gazes into it sees a different face.  Your Higher<br/>\nPower speaks to your soul in the most appropriate way<br/>\nfor you at any given time in your lifetime, or<br/>\nsoultime.  This may include times (or whole lifetimes<br/>\nfor those of us who believe in reincarnation) where<br/>\nthe soul is cut free from belief in Higher Power and<br/>\nset adrift to quest and learn lessons necessary for<br/>\nthe soul at that time.  All knowledge of the soul and<br/>\nthe spirit is good knowledge, regardless of<br/>\nideologies, dogmas and faith systems.  Deep and<br/>\nintimate knowledge of the self is good too, regardless<br/>\nof where it is found.<br/>\n<br/>\nThat is not to say there is no enrichment or merit to<br/>\nbe found in group worship, so long as individuals are<br/>\nresepected and allowed to guide their own personal<br/>\nideologies, simply that dogma is restrictive to the<br/>\ngrowth of the soul.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Do closed societies(the Amish, for instance) maintain<br/>\n&gt;their religion because the propensity to it is<br/>\n&gt;inherited?  Is there a &quot;God gene&quot;?<br/>\n<br/>\n </span></blockquote>One of the joys of life is the endless possibilities. <br/>\nAnything is possible.  But then, you also have folks<br/>\nmarrying into the Amish culture in a small but<br/>\nconsistent number, who come from varying secular and<br/>\nreligious traditions.  More telling I think, might be<br/>\na genetic predisposition for certain personality types<br/>\nwhich find fullfillment in the Amish way of life.  But<br/>\nthis may amount to the same thing, depending upon what<br/>\nyou devine to be the source of religious and spiritual<br/>\ninspiration in the mind.  The children of the Amish<br/>\nare always free to leave to culture, but seldom do. <br/>\nThis could not be only attributed to the fact that it<br/>\nis all they know, as human beings are endlessly<br/>\ncurious and flexible and constantly seeking newness. <br/>\nMore like this is what they want, knowing what options<br/>\nthey have.  They are predisposed to the life by<br/>\ngenetics in personality.  (Just an idea.)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;If the answer to any of that is &quot;yes,&quot; does it mean<br/>\n&gt;that God does not exist, that our perceptions are<br/>\n&gt;delusions which plague some but not others, or <br/>\n&gt;does it mean he/she/it *does* exist, and has created<br/>\n&gt;these structures or functions in order to have<br/>\n&gt;contact with us?  <br/>\n<br/>\n </span></blockquote>What a wonderful question to let your spirit ponder<br/>\non.  This type of questing is most undoubtedly good<br/>\nfor the soul.  Doubting your faith means that you are<br/>\nalive and awake and vibrant, not that you are<br/>\nunworthy.  Questioning and being reaffirmed in your<br/>\npath or in another path are all part of learning<br/>\nknowledge of the self and the soul and the universe.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;And does it mean that those without &gt;the capacity to<br/>\n&gt;perceive him are damned?  Or, if he &gt;is just, that<br/>\n&gt;those without the gene are equally &gt;saved without<br/>\n&gt;religion, since it would be unfair &gt;otherwise?  (I&#39;m<br/>\n&gt;using saved and damned in a general &gt;sense, as most<br/>\n&gt;religions promise some kind of reward for<br/>\n&gt;participation.)<br/>\n<br/>\n </span></blockquote>Mine does not.  That is to say.  I do not believe in<br/>\nsin, nor do any pagans that I know of have any concept<br/>\nof sin, retribution, punishment or reward in their<br/>\nfaith system.  There is simply energy in the world<br/>\nthat can be directed towards good or ill intent. <br/>\nThese energies create their own backlash of like to<br/>\nlike.  So ill actions get you ill returns and positive<br/>\nforces have positive affects on the practitioner.  So<br/>\nthis self regulates each practitioner to know<br/>\nlogically that if they crave good things for<br/>\nthemselves, they must do good things for others and be<br/>\nof good heart, sending out these positive energies<br/>\ninto the world.<br/>\n<br/>\nGod/Goddess as personified for me as a<br/>\ndual/multifaceted Higher Power is our Mother and our<br/>\nFather, much as the Catholic trinity is a trifaceted<br/>\nHigher Power.  As Mother/Father, God/Goddess gives us<br/>\nlife and guides us through transitions before and<br/>\nafter life.  God/Goddess creates all things and is all<br/>\nthings, the same way matter and energy are a part of<br/>\nall things, for these are the embodiment of<br/>\nGod/Goddes.  No matter the names, mythos, rituals or<br/>\ntraditions, for it is all speaking to the same Higher<br/>\nPower, who loves us all.  These things are tools for<br/>\nour minds to understand concepts beyond them, as well<br/>\nas they are true and real histories and happenings as<br/>\nmuch as any knowledge of the spirit.  We create<br/>\nreality by our belief, and God/Goddess sees this and<br/>\nis proud of our ability, like Him/Her, to create.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;And what of religions that practice meditation, or<br/>\n&gt;use drugs sacramentally?  My religion&#39;s hagiography<br/>\n&gt;is replete with saints whose visions could be just as<br/>\n&gt;easily described as hallucinations; were they just<br/>\n&gt;nuts, or can severe fasting account for them?<br/>\n </span></blockquote>Nancy<br/>\n<br/>\nAnd many cultures believe that dreams and visions are<br/>\njust as real and touchable as our physical reality,<br/>\nand in some cases much more vital and important.  Are<br/>\nwe so wise to say this is not so?  I never comfort my<br/>\nchildren after a nightmare by calling it &quot;Only a<br/>\ndream&quot;, for their dreams are real and important in<br/>\ntheir own right and part of the real world of the<br/>\nspirit.  Rather I encourage them to talk about them,<br/>\nthink about them and be empowered to take control of<br/>\nthem for good.  My elder son&#39;s chronic nightmares were<br/>\nvaquished by a sword of light he learned to wield<br/>\nagainst the monsters of his unconscious mind, and<br/>\nembodied by a toy sword he took to bed with him<br/>\nfaithfully for several years.  <br/>\n<br/>\nWho am I to say that this was pure psychology?  We all<br/>\nknow that the mind and the will can be greater than<br/>\nthe body, can will the body to live or to die beyond<br/>\nour physical reason or reality should allow.  We know<br/>\nthat other states of consciousness can so affect the<br/>\nbody as to allow endurance of pain, miraculous healing<br/>\nand other affects.  Who are we to say that even those<br/>\nexplained to the genetic and chemical level as<br/>\nmiracles of &quot;science&quot; are not still embodiments of the<br/>\nsoul/spirit and Higher Power at work?  I do not claim<br/>\nto be so wise as to say that anything is NOT Possible,<br/>\nor that I know more than a tiny bit about anything. <br/>\nOf course, I am still always learning.  ;-)<br/>\n<br/>\nNanci K.<br/>\n<br/>\n__________________________________________________<br/>\nDo You Yahoo!?<br/>\nSend your FREE holiday greetings online!<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://greetings.yahoo.com\">http://greetings.yahoo.com</a></div>","specialLinks":[]}],"prevTopicId":1886,"nextTopicId":2101}}