{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":120206043,"authorName":"averyschmidt","from":"&quot;averyschmidt&quot; &lt;patti.schmidt2@...&gt;","profile":"averyschmidt","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"unschooling as  not &quot;normal&quot;","postDate":"1052933686","msgId":69070,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGI5dHVubStsMjg4QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":69069,"nextInTime":69071,"topicId":69070,"numMessagesInTopic":0,"msgSnippet":"Last night, after a long tiring day trip and a few tense family moments, I was laying in bed with my 8 and 10 yo sons. At the moment when my oldest was about","messageBody":"<div id=\"ygrps-yiv-1126610\">Last night, after a long tiring day trip and a few tense family <br/>\nmoments, I was laying in bed with my 8 and 10 yo sons. At the <br/>\nmoment when my oldest was about to fall asleep he had an interesting <br/>\nthing to say out of the blue. Something like &quot;sometimes I wish you <br/>\njust put me in school when I was 5 like everyone else, and we never <br/>\neven knew about homeschooling, and then I&#39;d be normal.&quot; <br/>\nMy first reaction was heart-sinking panic (these words have been my <br/>\nworst homeschooling-related nightmare since he was five and didn&#39;t <br/>\ngo to school), but I covered it up pretty well and tried to respond <br/>\nrationally and explore with him why he felt that way.<br/>\nWe talked about how he&#39;s free to try school any time he wants to, <br/>\nbut that didn&#39;t satisfy him much since a.) he&#39;s already tasted <br/>\ncomlete freedom and knows that it&#39;s a hard act to follow, and b.) he <br/>\nfeels like it&#39;s a culture he doesn&#39;t understand and would stick out <br/>\nlike a sore thumb if he did go. My 8yo then piped up and said that <br/>\nhe *wants* to go to school but he&#39;s afraid that he&#39;ll look stupid <br/>\nsince he can&#39;t really read yet and struggles with handwriting. <br/>\n(He&#39;s aware that he knows more than other kids in *other* areas but <br/>\nthis doesn&#39;t help much when he pictures himself in a school setting.)<br/>\n<br/>\nWe left the conversation open, but I&#39;m sure it will come up again <br/>\ntoday, and I&#39;m trying very hard to not get too emotional and <br/>\noverride their opinions and desires with my own. I&#39;m also trying <br/>\nnot to let my pride get in the way. (Oh my God, the &quot;I told you <br/>\nso&quot;s that would fly if certain family members overheard that <br/>\nconversation!)<br/>\n<br/>\nHas anyone else gone through this? I should point out that we live <br/>\nin a small town where everyone goes to school, including their best <br/>\nfriends. Philosophically I&#39;m an unschooler at heart, so it pains me <br/>\nto even be thinking about these things.<br/>\nI&#39;m totally okay with not being &quot;normal&quot;, but apparently it&#39;s <br/>\nsomething that bothers my children sometimes. Their drive to be <br/>\npart of their immediate community is strong enough to override all <br/>\nof the &quot;you&#39;re so lucky&quot; comments they get from schooled friends. <br/>\nI need some new insights here.<br/>\n<br/>\n:-/<br/>\nPatti</div>","specialLinks":[]}],"prevTopicId":69067,"nextTopicId":69072}}