{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":14,"messages":[{"userId":396473338,"authorName":"ellinghamsandwich","from":"&quot;ellinghamsandwich&quot; &lt;ellinghamsandwich@...&gt;","profile":"ellinghamsandwich","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: About how to learn about unschooling","postDate":"1241839818","msgId":44794,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd1MnRjYStqaWs3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDU1MjE5My40Njk5MC5xbUB3ZWI4MTUwNi5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":44754,"nextInTopic":0,"prevInTime":44793,"nextInTime":44795,"topicId":44710,"numMessagesInTopic":0,"msgSnippet":"this is so true, alex.  i have a friend who drove my local unschoolers group batty (well 2 of the women at least...founding members) w/ all her questions...","messageBody":"<div id=\"ygrps-yiv-1875575793\">this is so true, alex.  i have a friend who drove my local unschoolers group batty (well 2 of the women at least...founding members) w/ all her questions... she just didn&#39;t seem to get what unschooling is about... she was totally consumed w/ worry and confusion about curriculum and how she was going to pull unschooling off and so forth. if she&#39;d read and done research she would have had a basic knowledge of what unschooling is and then could have come to the group w/ other questions to learn more upon her basic info she learned. <br/>\n<br/>\nneedless to say, she wound up leaving the group. her oldest son is in school but she desperatly still wants to unschool him. she still doesn&#39;t feel she can pull it off...again, she still isn&#39;t quite getting it. i&#39;m wondering though if part of it is due to her maybe not understanding the unschooling &#39;language&#39; or basics...she has only been in our country a few years... <br/>\n<br/>\nthere is so much info online (like jan hunts site, sandra&#39;s, dayna&#39;s..etc.) for the basics... i love researching. i must admit though that sometimes i get stuck and my mind blanks out on the simplest &#39;answers&#39; i intuitively already &#39;know&#39;. i agree w/ slowing down (which i&#39;m working on) and trusting myself, trusting my children to guide me and show me the way they wish to go...<br/>\nlis<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; <br/>\n&gt; My take on it is that some people have such a schoolish way of thinking that they want others to spoon feed them the answer to their questions.<br/>\n&gt; They just don&#39;t know or think to look, find and come to their own conclusions.<br/>\n&gt; Someone has to give them the &quot;right&quot; answer.<br/>\n&gt; I see that in other groups ( not usnchooling) I am in,&#39;<br/>\n&gt; One is about having a family dairy cow and people come and ask basic questions that would take them  10 minutes to google and read several links to find.<br/>\n&gt; It is different than coming after reading something and asking for clarifications of more debate about the topic.<br/>\n&gt;  <br/>\n&gt; Alex Polikowsky<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n&gt; <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: About how to learn about unschooling","postDate":"1241759826","msgId":44752,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1MjhGMEZCLTRFMEItNDcwRC1BQjEyLUNCNTQyQjRFQjlCRUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGd1MGNtYSt0NjM4QGVHcm91cHMuY29tPg==","referencesHeader":"PGd1MGNtYSt0NjM4QGVHcm91cHMuY29tPg=="},"prevInTopic":44750,"nextInTopic":44754,"prevInTime":44751,"nextInTime":44753,"topicId":44710,"numMessagesInTopic":0,"msgSnippet":"-=-I made our first ever monkey platters today, and it was a hit (and fun for me, I love arranging things to look pretty). I also decided to face my fear of","messageBody":"<div id=\"ygrps-yiv-160044637\">-=-I made our first ever monkey platters today, and it was a hit (and  <br/>\nfun for me, I love arranging things to look pretty). I also decided to  <br/>\nface my fear of the Red #40 bogeyman and bought some cherry jello and  <br/>\nmade finger jello. ;) So far, we&#39;re still alive and well! :P-=-<br/>\n<br/>\nIf there were photos...<br/>\n<br/>\nI&#39;ve made those hot dogs with spaghetti through them for the third  <br/>\ntime now, to surprise my friend Ben.   That was fun.<br/>\n<br/>\nI have some new sleeping-people photos I hope to process soon, and  <br/>\nanother monkey platter still not uploaded.<br/>\n<br/>\nTomorrow there&#39;s a chat.  For those who like the social aspect of  <br/>\nchatting, this might be a good outlet.  Inlet.   Medium.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/room\">http://sandradodd.com/room</a><br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":299867162,"authorName":"Maria","from":"&quot;Maria&quot; &lt;maria.veltman@...&gt;","profile":"trinity3857","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: About how to learn about unschooling","postDate":"1241757194","msgId":44750,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd1MGNtYSt0NjM4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDg0RTE4MjJBLTE0NjMtNEUxMi1BOEM4LTIxOEQ2RjcyRkQ2QUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":44740,"nextInTopic":44752,"prevInTime":44749,"nextInTime":44751,"topicId":44710,"numMessagesInTopic":0,"msgSnippet":"In my short time on this list, I haven t found anyone here mean or rude.  I find it very refreshing to have someone point out when emotions (like fear, thank","messageBody":"<div id=\"ygrps-yiv-518605790\">In my short time on this list, I haven&#39;t found anyone here mean or rude.  I find it very refreshing to have someone point out when emotions (like fear, thank you Sandra & Schuyler) are running my show, and ask the uncomfortable questions.  Who better to be more objective about it than someone completely outside the situation? <br/>\n<br/>\nA year ago, I said to a friend who&#39;s pursuing classical homeschooling (which I was considering) that unschoolers were just lazy (because setting up a curriculum looks daunting to me).  I&#39;m now quite convinced that&#39;s not true at all.  Everyday I&#39;m learning something new about myself, my son and our family, and working hard at being present, enjoying life, BREATHING, asking myself, &quot;What does he need?&quot;  And, recently, I&#39;ve noticed that the direction of this path has distanced me from some of my friends, who are not pursuing unschooling.  Not in an intentional sort of way, but more that I don&#39;t feel like I can share certain things with them.  And this is a place where I can share my little &quot;aha!&quot; moments and other celebratory things.<br/>\n<br/>\nIt&#39;s very cool that this list has aged well, and I&#39;m glad it&#39;s still here!  <br/>\n<br/>\nMaria<br/>\n<br/>\np.s. I made our first ever monkey platters today, and it was a hit (and fun for me, I love arranging things to look pretty).  I also decided to face my fear of the Red #40 bogeyman and bought some cherry jello and made finger jello. ;)  So far, we&#39;re still alive and well! :P</div>","specialLinks":[]},{"userId":62589750,"authorName":"JudithAnneMurphy@aol.com","from":"JudithAnneMurphy@...","profile":"shepherdlass","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: About how to learn about unschooling","postDate":"1241725322","msgId":44754,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJmMi41MDdkMjFjNS4zNzM0OTM4YUBhb2wuY29tPg=="},"prevInTopic":44752,"nextInTopic":44794,"prevInTime":44753,"nextInTime":44755,"topicId":44710,"numMessagesInTopic":0,"msgSnippet":"I have to say that it can be very daunting for a beginner to ask  advice on this loop, because you regulars do examine every word and concept  closely and are","messageBody":"<div id=\"ygrps-yiv-1629594966\">I have to say that it can be very daunting for a beginner to ask  advice on <br/>\nthis loop, because you regulars do examine every word and concept  closely <br/>\nand are usually very frank in your opinions.  But that  is what makes it <br/>\nsuch a trustworthy source of information.  I&#39;m fairly  certain that if I was <br/>\nsuggesting something that might harm our  <br/>\ndeschooling/unschooling/family-life-as-a-whole experience then at least one or  two of you would put me right in <br/>\nno uncertain terms.  I already have said  silly things and you have told me <br/>\nwhat you think.  It feels really  reassuring to read honest responses (even <br/>\nwhen they&#39;re critical) rather  than all manner of polite affirmations that <br/>\ncould mask  serious misgivings.<br/>\n <br/>\nAnd I&#39;ll add my vote to say that it&#39;d be great to see those YouTube vids on <br/>\n your site, Sandra.  I&#39;m an uptight Brit and I certainly can&#39;t see  <br/>\nanything &quot;tacky&quot; in uploading such a great source of  information.    <br/>\n <br/>\nJude x<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":336246301,"authorName":"carenkh","from":"&quot;carenkh&quot; &lt;dharmamama1@...&gt;","profile":"carenkh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: About how to learn about unschooling","postDate":"1241710276","msgId":44740,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd0dXVzNCs5NzVpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGd0dHRhdCs3ZXIxQGVHcm91cHMuY29tPg=="},"prevInTopic":44737,"nextInTopic":44750,"prevInTime":44739,"nextInTime":44741,"topicId":44710,"numMessagesInTopic":0,"msgSnippet":"People learn in different ways.  The feeling and visual clues matter to me, and when someone is speaking, I pick up quite a bit they might not even be aware","messageBody":"<div id=\"ygrps-yiv-1586221194\">&quot;People learn in different ways.  The feeling and visual clues matter to me, and when someone is speaking, I pick up quite a bit they might not even be aware of communicating just through a facial expression alone.  This adds dimension to the idea being conveyed, in my mind.  It anchors it for me.  Reading about ideas is good.  Some people also like to go hear and see people conveying ideas at conferences and so on.&quot;<br/>\n<br/>\nI was thinking about this in terms of the person who didn&#39;t like being sent links to read. I used to get *really* annoyed when people couldn&#39;t just google something - they&#39;d send an e-mail to ask, &quot;What&#39;s Firefly?&quot;, and I&#39;d think, &quot;In the time it took you to send the e-mail, you could have looked that up.&quot; There&#39;s kind of a snarky site <a rel=\"nofollow\" target=\"_blank\" href=\"http://lmgtfy.com/?q=firefly\">http://lmgtfy.com/?q=firefly</a>  that I&#39;ve come close to sending people, but it just seemed mean. (You can put any subject into that site, and it will make a link)<br/>\n<br/>\nSome people prefer to get their information through conversing. I am a reader, I will read up on something a million different ways before I open my mouth and ask (unless it&#39;s something simple), but to some people that seems arduous. They learn better socially, and reading can just seem like words swimming around.<br/>\n<br/>\nSo I&#39;m guessing (just guessing, I&#39;m not that person), the person who asked about typical days, or whatever it was, was hoping to have a conversation about that, not read about it.<br/>\n<br/>\nI know after being on lists for a while, to answer the same question over and over seems silly when the answer&#39;s clearly printed out somewhere, but it may be reading posts in an e-mail &quot;feels&quot; different than going to a site to read; it&#39;s more immediate and it&#39;s coming from one person in direct answer to your question - it&#39;s more social.<br/>\n<br/>\nJust some thoughts - <br/>\n<br/>\nCaren</div>","specialLinks":[]},{"userId":82912732,"authorName":"cindyjsowers","from":"&quot;cindyjsowers&quot; &lt;cindyjsowers@...&gt;","profile":"cindyjsowers","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: About how to learn about unschooling","postDate":"1241675933","msgId":44737,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd0dHRhdCs3ZXIxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEYyMjc0OERGLTA2N0QtNDY5Ni1CM0U5LTMxMTU4NkM3MzU3QUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":44735,"nextInTopic":44740,"prevInTime":44736,"nextInTime":44738,"topicId":44710,"numMessagesInTopic":0,"msgSnippet":"... Hmmm.  You aren t selling anything for $29.99 at the end :)  Doesn t strike *me* as tacky.  The videos added a further dimension for me.  People learn in","messageBody":"<div id=\"ygrps-yiv-959983874\"><blockquote><span title=\"qreply\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n<br/>\n-----Maybe I should put those youtube videos on my unschooling page, but it seems tacky to me for some reason.<br/>\n<br/>\n<br/>\nHmmm.  You aren&#39;t selling anything for $29.99 at the end :)  Doesn&#39;t strike *me* as tacky.  The videos added a further dimension for me.  People learn in different ways.  The feeling and visual clues matter to me, and when someone is speaking, I pick up quite a bit they might not even be aware of communicating just through a facial expression alone.  This adds dimension to the idea being conveyed, in my mind.  It anchors it for me.  Reading about ideas is good.  Some people also like to go hear and see people conveying ideas at conferences and so on.  The talks add dimension to the ideas.  Sometimes people hear talks before they read anything and it inspires them to do some reading.  Videos are somewhere in between reading and attending a live conference.  <br/>\n<br/>\n<br/>\n---I was really liking that period of time when people were judged online by just their ideas (maybe their grammar, some, and maybe their tone, but ideas could stand<br/>\nREALLY tall). <br/>\n<br/>\n<br/>\nIdeas are excellent, of course. But in practice it is often hard to divorce the ideas from the person conveying them.  We live in a world of ideas, certainly, but also in a world of people who have ideas. I think your speaking style is gentle enough that even if the idea of unschooling would seem a bit radical to a person, your speaking manner would effectively bypass some of their resistance and allow your ideas to be seeded.  Just my thought. <br/>\n<br/>\nCindy </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: About how to learn about unschooling","postDate":"1241665910","msgId":44735,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYyMjc0OERGLTA2N0QtNDY5Ni1CM0U5LTMxMTU4NkM3MzU3QUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGd0dGcyNSszMW1wQGVHcm91cHMuY29tPg==","referencesHeader":"PGd0dGcyNSszMW1wQGVHcm91cHMuY29tPg=="},"prevInTopic":44734,"nextInTopic":44737,"prevInTime":44734,"nextInTime":44736,"topicId":44710,"numMessagesInTopic":0,"msgSnippet":"-=...-and very direct in communicating your thoughts in written format, that some people might not realize that (that s not a criticism at all), and I think it","messageBody":"<div id=\"ygrps-yiv-582722029\">-=...-and very direct in communicating your thoughts in written  <br/>\nformat, that some people might not realize that (that&#39;s not a  <br/>\ncriticism at all), and I think it would be helpful for people just  <br/>\njoining to know that. When people communicate very clearly, getting  <br/>\nright to the point without a lot of coddling and reassuring, I think  <br/>\npeople who are feeling unclear within themselves can be easily  <br/>\nintimidated when communicating with someone who is so obviously clear,  <br/>\nand that can bring up a whole lot of yuck for them-=-<br/>\n<br/>\nMaybe I should put those youtube videos on my unschooling page, but it  <br/>\nseems tacky to me for some reason.<br/>\n<br/>\nStill, I see your point.  Long ago, when the AOL forum was the source  <br/>\nof the best of all homeschooling info, I spoke in Long Beach at a  <br/>\nsmall conference and someone who had been very critical of me online  <br/>\ncame up afterwards and said I was funny. She said it with surprise.    <br/>\nShe said she had been determined not to like me, but she was going to  <br/>\nhave to reconsider what she had read in that light.<br/>\n<br/>\n-=-I think if they watched how you talk and sound early on...-=-<br/>\n<br/>\nTimes change.  Change is a constant.   I was really liking that period  <br/>\nof time when people were judged online by just their ideas (maybe  <br/>\ntheir grammar, some, and maybe their tone, but ideas could stand  <br/>\nREALLY tall).  If people look they&#39;ll know I&#39;m old and that I don&#39;t  <br/>\nhave a fancy accent (whatever that might be; some people have a  <br/>\nprejudice against southwestern sounding people; not as bad as  <br/>\nsoutherners or Texans, but prejudices exist), and I&#39;m not beautiful  <br/>\nand I don&#39;t wear makeup.<br/>\n<br/>\nSo probably no matter what the criteria, there will be some people put  <br/>\noff, and there will always be people who live on the edge of put- <br/>\noffedness who are just looking for an excuse to leave in a storm of  <br/>\ninsult.<br/>\n<br/>\nI&#39;m a lightning rod for loonies sometimes.<br/>\nI guess it keeps some of the rest of you safe!<br/>\nNo problem for me, because it&#39;s rarely really about me.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":265299176,"authorName":"katherand@gmail.com","from":"katherand@...","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: About how to learn about unschooling","postDate":"1241664356","msgId":44734,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVlNzMzZmZjZTEwYjQ4MTQ3OTdmY2U1YTQyNGU5Y2ZmQGdtYWlsLmNvbT4=","inReplyToHeader":"PGd0dGcyNSszMW1wQGVHcm91cHMuY29tPg==","referencesHeader":"PGd0dGcyNSszMW1wQGVHcm91cHMuY29tPg=="},"prevInTopic":44733,"nextInTopic":44735,"prevInTime":44733,"nextInTime":44735,"topicId":44710,"numMessagesInTopic":0,"msgSnippet":"... without a lot of coddling and reassuring, I think people who are feeling unclear within themselves can be easily intimidated when communicating with","messageBody":"<div id=\"ygrps-yiv-1396758411\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt; When people communicate very clearly, getting right to the point <br/>\n </span></blockquote>without a lot of coddling and reassuring, I think people who are <br/>\nfeeling unclear within themselves can be easily intimidated when <br/>\ncommunicating with someone who is so obviously clear, and that can <br/>\nbring up a whole lot of yuck for them. &lt;&lt;&lt;&lt;<br/>\n<br/>\nThe videos are great.  I agree that seeing the entire communication <br/>\nstyle is really helpful to getting that Sandra is not only *not* a <br/>\nmeanie (heehee) but knows what she&#39;s saying from experience.  I can <br/>\ntell if I think someone knows what they&#39;re talking about and is <br/>\nconfident about what they&#39;re saying by watching them talk.<br/>\n<br/>\nWhen I was first reading online, I really couldn&#39;t tell that about <br/>\nSandra until I had been on the list for a while, like at least several <br/>\nmonths.  She doesn&#39;t mince her words, although the kindness came <br/>\nthrough in things like not saying a lot of words at once in reply to a <br/>\npost, posting links of content that had obviously been inspired by <br/>\nsimilar questions and which touched more on the topic, went further <br/>\nwith other helpful info in the same vein and was mostly written by <br/>\npeople like Joyce, Pam, Jenny and so on .. a long list of contributors.<br/>\n<br/>\nThe online writing is a plethora of info!  The speech and body language <br/>\nis not near as much info but it involves a different kind of <br/>\ninformation that the writing doesn&#39;t provide.<br/>\n<br/>\n~Katherine</div>","specialLinks":[]},{"userId":82912732,"authorName":"cindyjsowers","from":"&quot;cindyjsowers&quot; &lt;cindyjsowers@...&gt;","profile":"cindyjsowers","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: About how to learn about unschooling","postDate":"1241662341","msgId":44733,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd0dGcyNSszMW1wQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDg0RTE4MjJBLTE0NjMtNEUxMi1BOEM4LTIxOEQ2RjcyRkQ2QUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":44720,"nextInTopic":44734,"prevInTime":44732,"nextInTime":44734,"topicId":44710,"numMessagesInTopic":0,"msgSnippet":"... I think that s cool, too.  I haven t been reading here the entire 7, but maybe 4 or 5 years and early on tried to read back in years as much as possible.","messageBody":"<div id=\"ygrps-yiv-1577134515\"><blockquote><span title=\"qreply\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n<br/>\n--- This list is seven and a half years old now.  I think that&#39;s cool.   <br/>\n<br/>\nI think that&#39;s cool, too.  I haven&#39;t been reading here the entire 7, but maybe 4 or 5 years and early on tried to read back in years as much as possible.  I wanted to say that I have learned a ton of stuff from the advice/criticism/just plain information giving that you and some of the stronger voices on the list have offered, and also just reading what newer people think and how they change and develop over time.  There is an unbelievable wealth of information there for the taking.<br/>\n<br/>\nI have been obsessively playing Harvest Moon DS for several days with my 2 kids (we each got our own cartridge past week)and have sunk into a black hole of Nintendo-land, so have missed a lot of the posts this week.  I have been so busy electronic farming that my own 2 real-life sheep got out this week and I didn&#39;t notice for quite some time.  Bad farmer! :)<br/>\n<br/>\nI wanted to say, though, that please don&#39;t be shy about directing new people immediately to watch you on-line, Sandra, because you have a very gentle, soft communication style on screen, and I think, because you are very, very smart, and very direct in communicating your thoughts in written format, that some people might not realize that (that&#39;s not a criticism at all), and I think it would be helpful for people just joining to know that.  When people communicate very clearly, getting right to the point without a lot of coddling and reassuring, I think people who are feeling unclear within themselves can be easily intimidated when communicating with someone who is so obviously clear, and that can bring up a whole lot of yuck for them.  That is not to defend the yuck, but I think if they watched how you talk and sound early on, that they might be less intimidated momentarily and would feel less confrontational and willing to hang in long enough to pick up some really top-notch and useful information, which I am pretty sure they could use.<br/>\n<br/>\nAnyway, thanks again for what you do.  It has helped me and my people, and I am appreciative.  Loved the 2 vids, by the way.  Hoping more to come soon.<br/>\n<br/>\nCindy </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] About how to learn about unschooling","postDate":"1241637714","msgId":44720,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY1RDA2NDJGLTlCQUQtNDRDOC05REQyLTA3NjNENjFDRkZCM0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDU1MjE5My40Njk5MC5xbUB3ZWI4MTUwNi5tYWlsLm11ZC55YWhvby5jb20+","referencesHeader":"PDg0RTE4MjJBLTE0NjMtNEUxMi1BOEM4LTIxOEQ2RjcyRkQ2QUBTYW5kcmFkb2RkLmNvbT4gPDExRTZGRTVDNDY0ODQ5MERCNDE4RjQ1NDUzOTI1NThEQExZTEFMQVAyPiA8NTUyMTkzLjQ2OTkwLnFtQHdlYjgxNTA2Lm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":44718,"nextInTopic":44733,"prevInTime":44719,"nextInTime":44721,"topicId":44710,"numMessagesInTopic":0,"msgSnippet":"-=-My take on it is that some people have such a schoolish way of thinking that they want others to spoon feed them the answer to their questions.-=- You re","messageBody":"<div id=\"ygrps-yiv-1878971805\">-=-My take on it is that some people have such a schoolish way of  <br/>\nthinking that they want others to spoon feed them the answer to their  <br/>\nquestions.-=-<br/>\n<br/>\nYou&#39;re probably right.  How ironic, though, that they want help to  <br/>\ncreate learning for their kids but don&#39;t see that they are trying to  <br/>\nlearn naturally about something themselves.  They had taken the first  <br/>\nsteps.  They looked online.  They found people who knew.  They asked.   <br/>\nAnd those who stick around and get it end up helping others get it  <br/>\n(some of them; lots of them do).<br/>\n<br/>\n-=-They just don&#39;t know or think to look, find and come to their own  <br/>\nconclusions.  Someone has to give them the &quot;right&quot; answer.-=-<br/>\n<br/>\nBut the right answer is &quot;change the way you see these things.&quot;    <br/>\nThat&#39;s the the kind of right answer they were thinking they would  <br/>\nget.  The reject it without seeing it.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/seeingit\">http://sandradodd.com/seeingit</a><br/>\n<br/>\nMaybe I should have sent that, too, to the woman who left in a huff.   <br/>\nMaybe she hasn&#39;t really left, which would be fine.  Maybe she&#39;ll come  <br/>\nback or has a friend forwarding her the posts.  That would be good.<br/>\n<br/>\nBut would she have read it?  She hadn&#39;t read the other links people  <br/>\nhad sent before she assured me I was rude and should change my life to  <br/>\nsuit her expectations (NOT A QUOTE, but it seemed to be the intention).<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] About how to learn about unschooling","postDate":"1241636921","msgId":44718,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU1MjE5My40Njk5MC5xbUB3ZWI4MTUwNi5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PDExRTZGRTVDNDY0ODQ5MERCNDE4RjQ1NDUzOTI1NThEQExZTEFMQVAyPg==","referencesHeader":"PDg0RTE4MjJBLTE0NjMtNEUxMi1BOEM4LTIxOEQ2RjcyRkQ2QUBTYW5kcmFkb2RkLmNvbT4gPDExRTZGRTVDNDY0ODQ5MERCNDE4RjQ1NDUzOTI1NThEQExZTEFMQVAyPg=="},"prevInTopic":44713,"nextInTopic":44720,"prevInTime":44717,"nextInTime":44719,"topicId":44710,"numMessagesInTopic":0,"msgSnippet":"My take on it is that some people have such a schoolish way of thinking that they want others to spoon feed them the answer to their questions. They just","messageBody":"<div id=\"ygrps-yiv-530876248\">My take on it is that some people have such a schoolish way of thinking that they want others to spoon feed them the answer to their questions.<br/>\nThey just don&#39;t know or think to look, find and come to their own conclusions.<br/>\nSomeone has to give them the &quot;right&quot; answer.<br/>\nI see that in other groups ( not usnchooling) I am in,&#39;<br/>\nOne is about having a family dairy cow and people come and ask basic questions that would take them  10 minutes to google and read several links to find.<br/>\nIt is different than coming after reading something and asking for clarifications of more debate about the topic.<br/>\n <br/>\nAlex Polikowsky<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] About how to learn about unschooling","postDate":"1241631693","msgId":44713,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PERGQUE2ODAwLUM5QUEtNEM4RC04MkE5LTI1QUE5Q0MyMDQ4Q0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDExRTZGRTVDNDY0ODQ5MERCNDE4RjQ1NDUzOTI1NThEQExZTEFMQVAyPg==","referencesHeader":"PDg0RTE4MjJBLTE0NjMtNEUxMi1BOEM4LTIxOEQ2RjcyRkQ2QUBTYW5kcmFkb2RkLmNvbT4gPDExRTZGRTVDNDY0ODQ5MERCNDE4RjQ1NDUzOTI1NThEQExZTEFMQVAyPg=="},"prevInTopic":44711,"nextInTopic":44718,"prevInTime":44712,"nextInTime":44714,"topicId":44710,"numMessagesInTopic":0,"msgSnippet":"-=-one idea i had is to have an automatic questionairre that gets sent out by the list to any subscriber, upon subscription request.  this could be just a ","messageBody":"<div id=\"ygrps-yiv-836359989\">-=-one idea i had is to have an automatic &quot;questionairre&quot; that gets  <br/>\nsent out by<br/>\nthe list to any subscriber, upon subscription request.  this could be  <br/>\njust a<br/>\n&quot;tell the moderators a little about yourself and describe what you  <br/>\nimagine<br/>\nthis list will do for you&quot; kind of thing, or it can be a &quot;test&quot; (haha)  <br/>\nof<br/>\nhaving read the purpose statement....which would be kind of funny in an<br/>\nironic sort of way on an unschooling list...-=-<br/>\n<br/>\nAh.<br/>\nI know of a list that does that.  Sometimes I&#39;d just like to join a  <br/>\nlist without telling my life story. &lt;G&gt;<br/>\n<br/>\nAnd hey, returning a &quot;you&#39;re rude&quot; note every week or two is WAY less  <br/>\nwork than reading essays on what people think the list should be  <br/>\n(though the &quot;you sucks&quot; often tell me EXACTLY what the list should be,  <br/>\nand sometimes where I should stick the list).<br/>\n<br/>\nThen I get notes like this one, today, though:<br/>\n<br/>\n-=-Thank you so much for freely sharing such a wealth of information.  <br/>\nDo pass on my appreciation to Pam, Joyce and Jenny too. Your concise  <br/>\nwritings and discussion responses not only clear away self doubt, but  <br/>\ninspire and energise my unschooling life.-=-<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/feedback/\">http://sandradodd.com/feedback/</a><br/>\n<br/>\n<br/>\nAnd then some like this, which I&#39;m not letting through to the list  <br/>\nwith the person&#39;s name because I don&#39;t want her to be ashamed of  <br/>\nherself later:<br/>\n<br/>\n-=-Wow, that&#39;s all I can say. If you took my post to be a &quot;you<br/>\nsuck&quot; post, then you should really enjoy the second one I<br/>\nsent you. That was not at all the way I meant it, but maybe<br/>\nI should have. I guess you enjoy having all the followers of<br/>\nyour group worship the ground you walk on and live by the<br/>\nwords you say, but I guess that&#39;s just another reason I<br/>\ndon&#39;t belong. -=-<br/>\n<br/>\nThe people who belong on this list are those who want to learn more  <br/>\nabout unschooling.  Those who don&#39;t like the list format could go to  <br/>\nmy page or Joyce&#39;s or one of the live chats or to the MANY unschooling  <br/>\nblogs, or to Laura&#39;s Family RUNning, all of which are easily  <br/>\naccessible from <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/unschooling.\">http://sandradodd.com/unschooling.</a><br/>\n<br/>\nAnd anyone who wants to think I have this list so people will worship  <br/>\nme needs to work on breathing and being calmer.  I don&#39;t have time to  <br/>\ncoddle people who are needier than my children are.  But I do have  <br/>\nthese resources that might help:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/breathing\">http://sandradodd.com/breathing</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/parentingpeacefully\">http://sandradodd.com/parentingpeacefully</a><br/>\n<br/>\nThis list doesn&#39;t exist for us to coo and say &quot;good job!&quot; when a mom  <br/>\nrecites back what we&#39;ve written or says she&#39;s planning to consider  <br/>\nthinking about doing it.   I do have a coddling link, though, made of  <br/>\nactual real-life coddles:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/support\">http://sandradodd.com/support</a><br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":185586397,"authorName":"Lyla Wolfenstein","from":"&quot;Lyla Wolfenstein&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] About how to learn about unschooling","postDate":"1241628874","msgId":44711,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDExRTZGRTVDNDY0ODQ5MERCNDE4RjQ1NDUzOTI1NThEQExZTEFMQVAyPg==","inReplyToHeader":"PDg0RTE4MjJBLTE0NjMtNEUxMi1BOEM4LTIxOEQ2RjcyRkQ2QUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDg0RTE4MjJBLTE0NjMtNEUxMi1BOEM4LTIxOEQ2RjcyRkQ2QUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":44710,"nextInTopic":44713,"prevInTime":44710,"nextInTime":44712,"topicId":44710,"numMessagesInTopic":0,"msgSnippet":"sandra - i think the purpose of the list is very clear, and reading before posting as suggested is of course a great idea, etc.  that said - i think there are","messageBody":"<div id=\"ygrps-yiv-1875853157\">sandra - i think the purpose of the list is very clear, and reading before <br/>\nposting as suggested is of course a great idea, etc.  that said - i think <br/>\nthere are way more people than one might imagine who not only don&#39;t read the <br/>\n&quot;purpose of the list&quot; descriptions, but don&#39;t read the welcome message and <br/>\ninstructions they get - from any list.<br/>\n<br/>\none idea i had is to have an automatic &quot;questionairre&quot; that gets sent out by <br/>\nthe list to any subscriber, upon subscription request.  this could be just a <br/>\n&quot;tell the moderators a little about yourself and describe what you imagine <br/>\nthis list will do for you&quot; kind of thing, or it can be a &quot;test&quot; (haha) of <br/>\nhaving read the purpose statement....which would be kind of funny in an <br/>\nironic sort of way on an unschooling list...<br/>\n<br/>\nit  would make a little more work in terms of approving members, but it <br/>\nmight cut down on the work for rejecting posts, or dealing with people <br/>\nsaying you suck...<br/>\n<br/>\nwarmly, Lyla</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"About how to learn about unschooling","postDate":"1241628276","msgId":44710,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg0RTE4MjJBLTE0NjMtNEUxMi1BOEM4LTIxOEQ2RjcyRkQ2QUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":44711,"prevInTime":44709,"nextInTime":44711,"topicId":44710,"numMessagesInTopic":0,"msgSnippet":"This list is seven and a half years old now.  I think that s cool.   I add to my website every day.  Joyce s has a random generator now, and you should","messageBody":"<div id=\"ygrps-yiv-1084795223\">This list is seven and a half years old now.  I think that&#39;s cool.   I  <br/>\nadd to my website every day.  Joyce&#39;s has a random generator now, and  <br/>\nyou should definitely check that out if you haven&#39;t.   (links below)<br/>\n<br/>\nI&#39;ve just rejected a long &quot;you suck&quot; post (not worded that strongly)  <br/>\nand I rejected one a few days ago that said we, and Pam Sorooshian in  <br/>\nparticular, were mean and rude.   PAM!?<br/>\n<br/>\nIn a moderators&#39; discussion of the first situation, Joyce wrote  <br/>\nsomething wonderful (as usual) that might help the person whose post  <br/>\nwas returned today.  And for the record, some people have not liked  <br/>\nthe responses here.  And for the record, the purpose of the list isn&#39;t  <br/>\nserved by mud wrestling (though the pudding wrestling discussion went  <br/>\nwell after all).<br/>\n<br/>\nOne quote from none of the above:<br/>\n<br/>\n&quot;I read your entire website before I subscribed to the list. If all  <br/>\nyou can do is refer people to read more material – you cannot help me.  <br/>\nIf I wanted to read more about unschooling information I would buy a  <br/>\nbook. I have read everything I could get a hold of. What I need is  <br/>\nrewording of everyday situations.&quot;<br/>\n<br/>\nMy site and Joyce&#39;s consist entirely of the rewording of everyday  <br/>\nsituations.   I happen to know, because of recent activity, how many  <br/>\npages there are on my site and Joyce&#39;s.   Over 800.  And by &quot;page&quot; I  <br/>\nmean webpage, not piece-of-paper page.  Some of those, printed out,  <br/>\nwould be six or ten pages, probably.  And some, if you followed the  <br/>\nlinks too, would be like small books.   But even if they WERE &quot;only&quot;  <br/>\n800 paper pages, that&#39;s a BIG honkin&#39; book.<br/>\n<br/>\nBack to the quote above:<br/>\n-=-If all you can do is refer people to read more material – you  <br/>\ncannot help me.... I have read everything I could get a hold of. -=-<br/>\n<br/>\nStunning.<br/>\nHadn&#39;t read the links I had sent, but everything she could get hold  <br/>\nof, and was SURE I had NO IDEA what I was doing .<br/>\n<br/>\nHere&#39;s the classic description (by Joyce) of the way this list works:<br/>\n<br/>\n-=-The list is about ideas, not about people.<br/>\n-=-Think of ideas like balls and the list like a ball court. If  <br/>\nsomeone tosses an idea worth discussing into the court it&#39;s going to  <br/>\nget batted about. At that point what&#39;s going on is no longer about the  <br/>\nperson who tossed the idea in. It&#39;s about the idea and how well and  <br/>\ncleanly it&#39;s being tossed about. (Unless the tosser keeps jumping in  <br/>\nand grabbing the idea ball saying &quot;Mine!&quot;)    --Joyce-=-<br/>\n<br/>\nAnd Joyce&#39;s recent bit, which is perking up my whole morning:<br/>\n<br/>\n&quot;It&#39;s sort of like person A stops person B on the street and asks for  <br/>\ndirections to the bus. Person B says you have the wrong shoes for the  <br/>\ntrip to the bus. And you&#39;ll need to lose the coat. And where are your  <br/>\nkids ... By then Person A&#39;s upset because they didn&#39;t ask for  <br/>\ncriticism, just help. Person B tries to explain this isn&#39;t a street  <br/>\nand she isn&#39;t a passerby and the bus isn&#39;t what Person A thinks it is.  <br/>\nPerson A&#39;s just blinking in angry confusion because it&#39;s obviously a  <br/>\nstreet and obviously a passerby.&quot;<br/>\n<br/>\nIt&#39;s a great analogy, and it is *sort* of like that, only this list  <br/>\nisn&#39;t a bypasser.  This list seems to me to be clearly marked.    <br/>\nPerhaps not, and if not maybe that could be rectified.<br/>\n<br/>\nAre there ways people are finding this list other than my unschooling  <br/>\npage or a yahoo search?  Are people joining without going to the  <br/>\ngroup&#39;s main page at yahoo?<br/>\n<br/>\nLinks to go with much-of-the-above:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com\">http://joyfullyrejoycing.com</a> (upper right, randomizer)<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/random\">http://sandradodd.com/random</a> (click the doors)<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/lists/alwayslearning\">http://sandradodd.com/lists/alwayslearning</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/AlwaysLearning/\">http://groups.yahoo.com/group/AlwaysLearning/</a><br/>\n<br/>\nThat one starts off  &quot;How and why does unschooling work?What kind of  <br/>\nparents and parenting does it take? What will help, and what will  <br/>\nhinder?<br/>\n<br/>\n&quot;This is a list for the examination of the philosophy of unschooling  <br/>\nand attentive parenting and a place for sharing examined lives based  <br/>\non the principles underlying unschooling.&quot;<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":44758,"nextTopicId":44741}}