{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":100027905,"authorName":"TreeGoddess","from":"TreeGoddess &lt;treegoddess@...&gt;","profile":"odrade7","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"No Time for Teaching: Spontaneous Learning at Home","postDate":"1073400150","msgId":87977,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhFM0ZENUMyLTQwNTYtMTFEOC05MzY3LTAwMDM5M0E1REE2NkBjb21jYXN0Lm5ldD4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":87976,"nextInTime":87978,"topicId":87977,"numMessagesInTopic":0,"msgSnippet":"I read this article today from a past issue of Mothering magazine and wanted to pass it along.  :)  Tracy ","messageBody":"<div id=\"ygrps-yiv-650536321\">I read this article today from a past issue of Mothering magazine and  <br/>\nwanted to pass it along.  :)  Tracy<br/>\n<br/>\n........................................................................ <br/>\n............................<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.mothering.com/14-0-0/html/14-4-0/no-time.shtml\">http://www.mothering.com/14-0-0/html/14-4-0/no-time.shtml</a><br/>\n<br/>\nNo Time for Teaching: Spontaneous Learning at Home<br/>\nIssue 113, July/August 2002<br/>\nBy Becky Jackson<br/>\n<br/>\nIn the four years I spent pursuing an education degree, I learned a lot  <br/>\nabout what to teach and how to teach it. Then I spent four years as a  <br/>\nfull-time mother. I would have to say that I learned more from the  <br/>\nlatter. In fact, I&#39;ve discovered that the most effective way for young  <br/>\nchildren to learn is not the Program for Effective Teaching model or  <br/>\nthe whole-language approach: it&#39;s the natural relationship between a  <br/>\nmother and child.<br/>\n<br/>\nThat&#39;s a difficult lesson for those of us who are teachers by  <br/>\nprofession. When I first became a mother, I expected my children to  <br/>\nexcel because of my expertise. I was convinced that good parents should  <br/>\nwork continually to make their kids smarter, more capable students. But  <br/>\nI didn&#39;t realize how much they would learn by my simply being their  <br/>\nmom.<br/>\n<br/>\nWhen my oldest daughter was three, I thought it was time to start  <br/>\nteaching her numbers and the alphabet. After all, most kids went to  <br/>\npreschool. Since mine were at home, and I was a teacher myself, I felt  <br/>\ncompelled to emulate the school setting. I even bought some workbooks  <br/>\nand wrote out plans for educational activities. I&#39;ve always been driven  <br/>\nto give my children every possible head start. But after awhile, I had  <br/>\nto ask myself what was really best for my daughter, a head start or  <br/>\npermission to take it slow? In my race to help her climb to the top  <br/>\nacademically, I was losing sight of the value of play, leisure,  <br/>\nflexibility, and freedom-the very hallmarks of childhood.<br/>\n<br/>\nThere are only so many hours in a day and only a precious few years to  <br/>\nbe a child. In these days and years, children need time to play, time  <br/>\nto leisurely observe and daydream, and time to choose what they want to  <br/>\ndo. The teacher in me might see such activities as unproductive, but  <br/>\nthey are very important in the development of a happy, healthy person.  <br/>\nMy short-lived curriculum was pushed aside in favor of more spontaneous  <br/>\ninteraction like talking to and having fun with my kids. I realized  <br/>\nthat my success as a mother was more dependent on the number of smiles  <br/>\nand hugs I gave than on the amount of information I dispensed. Besides,  <br/>\nthe most teachable moments can&#39;t be planned for or regimented. They  <br/>\narise when my children spot a rainbow, ask where butterflies come from,  <br/>\nor want to write a note to Grandma. It is in these moments that they  <br/>\nare the most inquisitive and receptive to the knowledge I want to give  <br/>\nthem. Maternal guidance is a powerful teaching tool. Sometimes it&#39;s as  <br/>\npurposeful as reading a book or counting crackers with my child. But  <br/>\nmost of the time it&#39;s incidental, as when we talk about the weather,  <br/>\nthe animals we see, and the color of our clothes.<br/>\n<br/>\nEven with the rave reviews I hear about preschool teachers and  <br/>\ncurricula, I can&#39;t help thinking that I have the best program around.  <br/>\nMy schedule provides access to all types of play, art, reading, and  <br/>\nsinging, whenever my kids and I are in the mood. My three year old can  <br/>\nspend an hour coloring or finishing a puzzle. My four year old can ride  <br/>\nher bike or put on her pink tutu and dance on a whim. There are no set  <br/>\nroutines or time limits, no methods or lessons-just a mom interacting  <br/>\nand sharing the world with her children.<br/>\n<br/>\nMy kids have flourished in the simplicity of home life and loving,  <br/>\nresponsive maternal care. They have become quite precocious in reciting  <br/>\nnursery rhymes, recognizing shapes and letters, and other academic  <br/>\nskills, not because they were expertly taught, but because they learned  <br/>\nthrough countless one-on-one conversations and experiences with mom.<br/>\n<br/>\nI am, indeed, well qualified to help my children reach their  <br/>\npotential-but not because of my teaching degree. My real qualifications  <br/>\nare these: I&#39;m their mother, I love them, and I know them better than  <br/>\nanyone. My kids and I are learning a lot while I&#39;m not teaching.<br/>\n<br/>\nIf you want more information about the importance of play, see the  <br/>\nfollowing articles in past issues of Mothering: &quot;Let Them Play,&quot; no.  <br/>\n103; &quot;Let&#39;s Take a Bath in the Magical Forest,&quot; no. 102; &quot;Utopian  <br/>\nSchools in the Here and Now,&quot; no. 52; and &quot;Learning Through Play,&quot; no.  <br/>\n46.<br/>\n<br/>\nBecky Jackson is a full-time mom who lives in rural Arkansas with her  <br/>\nhusband, Mike, and their three children: Abby (7), Jasmine (6), and  <br/>\nSkyler (5). Becky and Mike are expecting their fourth child in June  <br/>\n2002. <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":87463,"nextTopicId":87984}}