{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] 4 year homeschooler chooses and does return to public school.  Need help.","postDate":"1345995079","msgId":68793,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc0NUE0OTBBLUJCREQtNEY4MS05OThDLTQ1NjA3QUU5NTFGOEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGsxZGUybStidG4wQGVHcm91cHMuY29tPg==","referencesHeader":"PGsxZGUybStidG4wQGVHcm91cHMuY29tPg=="},"prevInTopic":68791,"nextInTopic":0,"prevInTime":68792,"nextInTime":68794,"topicId":68791,"numMessagesInTopic":0,"msgSnippet":"-=-He happened to get a class with a girl who used to live down our block that he really likes and now says he is in love with. BTW, he is 11, he will turn 12","messageBody":"<div id=\"ygrps-yiv-1640982792\">-=-He happened to get a class with a girl who used to live down our block that he really likes and now says he is in love with. BTW, he is 11, he will turn 12 in November. The way he talks and carries himself has changed so much in just one week. Very often when speaking to his younger sister, (she&#39;s 10), he says things that are negative about her in one way or another.-=-<br/>\n<br/>\nHe&#39;s trying out being a different way.  Let him do that, and accept him seeming different.<br/>\n<br/>\nBut don&#39;t accept him disturbing the peace. <br/>\n<br/>\nI would just say to him kindly but seriously that you don&#39;t want the negative school energy coming home.  He might not know what you mean, so as examples come, maybe say to him quietly (not loudly in front of everyone in an embarrassing way) to be sweet to his family, or to spend some time alone if he doesn&#39;t feel like he can be nice.<br/>\n<br/>\nHe&#39;ll settle out, I think.<br/>\n<br/>\nI was in love more than not when I was in school.  That&#39;s not necessarily a problem. :-)  I nearly always had a boyfriend, even in elementary school.  <br/>\n<br/>\n-=-My husband is also having a difficult time with the changes and overall the tone of our house has become so gloomy. I have four children. My 10 year old is unschooling and then Zoe is going to be 3 in October and Jaya is 4 months. I want to also protect the peace and joy for my other children. -=-<br/>\n<br/>\nMaybe save a fun thing to do that you can share with your oldest boy a time or two a month.  Maybe every week, but he will need some adjustment time, and some down time, to recover from school, especially at first, probably.   And maybe ask him (in a nice way, not a challenging way) to tell what he&#39;s learning at school that might be fun for the rest of you.  It would be a way for him to share the good parts, and for you to admire his new knowledge.   <br/>\n<br/>\nTry not to make it an us-and-them situation, and maybe ask him to help think of ways to promote the peace at home, if things don&#39;t get better quickly.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":252464818,"authorName":"Christina","from":"&quot;Christina&quot; &lt;daharryrc@...&gt;","profile":"daharryrc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"4 year homeschooler chooses and does return to public school.  Need help.","postDate":"1345993622","msgId":68791,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGsxZGUybStidG4wQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":68793,"prevInTime":68790,"nextInTime":68792,"topicId":68791,"numMessagesInTopic":0,"msgSnippet":"Hi Everyone, I ve posted here a couple times before, but am new to unschooling so I mostly read and think.  I ve homeschooled my children for four years, but","messageBody":"<div id=\"ygrps-yiv-1539336103\">Hi Everyone,<br/>\n<br/>\nI&#39;ve posted here a couple times before, but am new to unschooling so I mostly read and think.  I&#39;ve homeschooled my children for four years, but began deschooling and moving towards radical unschooling about 7 mths ago. My husband and I have always given the children the choice to return to public school and to my surprise, my son chose to do so since it would be his first year of middle school.  He said he was curious about what it would be like, wanted to be able to ride the bus and have a locker and have classes with other kids.  We respected that and so he has been going.  I was surprised because of having just recently begun moving towards radical unschooling I thought he would be so happy with the changes in our family that the thought of returning to that kind of structure would be a turn-off for him, but there are so many other things he wants to experience.  <br/>\n<br/>\nMy concerns are he has only been going for a week and this is a learning experience for all of us since last time my kids were in PS they were really little, (K and 1st).  He happened to get a class with a girl who used to live down our block that he really likes and now says he is in love with.  BTW, he is 11, he will turn 12 in November.  The way he talks and carries himself has changed so much in just one week.  Very often when speaking to his younger sister, (she&#39;s 10), he says things that are negative about her in one way or another.  Example, &quot;I&#39;m glad you don&#39;t go to PS with me because you would embarrass me.&quot;  I am mindful that this is a BIG transition for him and that it must be very difficult as well as exciting.  How do I support him in this without feeling like this has brought a lot of negativity into our family?  All the negativity posts have felt like they have been just for me b/c I am having a difficult time staying in joy and peace with all the changes.  His attitude is so different, like he&#39;s trying to be an adult.  He asked me if as a 6th grader if he should feel more grown-up.   <br/>\n<br/>\nI&#39;ve read the information on Sandra&#39;s page about public schooling on our own terms.  Thank you for that!  I think a big part of my sadness and angst is that I was hoping that through moving towards unschooling I would help my bigger kids have a few years of the childhood I wish I had given them all along and now I feel like he has traded his childhood in and wants to be all grown up. <br/>\n<br/>\nMy husband is also having a difficult time with the changes and overall the tone of our house has become so gloomy.  I have four children.  My 10 year old is unschooling and then Zoe is going to be 3 in October and Jaya is 4 months.  I want to also protect the peace and joy for my other children. <br/>\n<br/>\nThanks for any thoughts and help. I always feel so jumbled up when I post, but you all are so wonderful at un-jumbling me and helping me get to the root of my issues and with information to help me move towards &quot;better&quot;.  Thank you!<br/>\n <br/>\nChristina.</div>","specialLinks":[]}],"prevTopicId":68751,"nextTopicId":68662}}