{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":141316284,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Am I just being naïve ?","postDate":"1053444666","msgId":70084,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyQThGNUNBLThBRDgtMTFENy1BNEY5LTAwMEE5NTZFMTA5RUBtYWMuY29tPg==","inReplyToHeader":"PGJhZGQ4ditvYXNtQGVHcm91cHMuY29tPg=="},"prevInTopic":70076,"nextInTopic":70089,"prevInTime":70083,"nextInTime":70085,"topicId":70076,"numMessagesInTopic":0,"msgSnippet":"... I have an 18 yo and a 15 yo and I know a lot of unschooled teens. I can tell you that now that they are mostly out on their own, with infinite","messageBody":"<div id=\"ygrps-yiv-1913156007\">On Tuesday, May 20, 2003, at 07:14 AM, melissa4123 wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My question though is this: Am I just being naïve?  My daughter is<br/>\n&gt; only 2 and it will be many more years before my husband and I<br/>\n&gt; have to face dating and boyfriends.  I know that many of you on<br/>\n&gt; this list have older kids so I wanted to ask you all.  Do &quot;they&quot;<br/>\n&gt; (meaning teenagers) just go ahead and do what &quot;they&quot; want<br/>\n&gt; regardless of what &quot;you&quot; (as parents) think?<br/>\n<br/>\n </span></blockquote>  I have an 18 yo and a 15 yo and I know a lot of unschooled teens. I <br/>\ncan tell you that now that they are mostly out on their own, with <br/>\ninfinite opportunities to make their own decisions, they very clearly <br/>\ndemonstrate that they care a LOT about our (parents) opinions. First, <br/>\nthey ask what we think - a lot - they want to talk about everything - <br/>\nall the dilemmas they face. Second, they tell me that they always have <br/>\nmy voice in their heads - that even when they don&#39;t talk directly to me <br/>\nabout things, they are aware of what I&#39;d probably say. They argue with <br/>\nme in their heads, too, and that helps them think through things. It <br/>\nisn&#39;t all sweet and agreeable and easy -- don&#39;t get me wrong - and <br/>\nsometimes it is hard to bite my tongue and NOT try to just give orders <br/>\nbecause I want so MUCH for them to make choices that I agree with - and <br/>\nthey don&#39;t always.<br/>\n<br/>\nThey will do what they want - but what they want will include serious <br/>\nconsideration of what we parents think. As an unschooling parent, you <br/>\nprobably won&#39;t feel totally shut out and you won&#39;t feel like they don&#39;t <br/>\neven care what you think at all, which is how it is with MANY schooled <br/>\nkids and their parents (but not all, obviously). Unschooled kids have a <br/>\nhabit of thinking for themselves and a lot of practice taking into <br/>\nconsideration parental input - they&#39;ve been doing it for many years - <br/>\nnothing changes except that the decisions seem to be more serious - <br/>\ndrugs, alcohol, sex, driving, traveling, working, college, moving out, <br/>\nmoving away, getting married, having babies, etc.<br/>\n<br/>\nStart talking about stuff early - parents need practice listening to <br/>\nthe difficult-to-hear stuff as much as kids need to be comfortable <br/>\ntalking about it.<br/>\n<br/>\nAgain, they WILL be making their own decisions - so, in that sense, <br/>\nthey&#39;ll do what they want. But they won&#39;t be like so MANY schooled kids <br/>\nwho totally disregard parental input - often don&#39;t even get any input <br/>\nbecause, by that time, they are living such separate lives.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":89346128,"authorName":"Angie","from":"&quot;Angie&quot; &lt;angiehewerdine@...&gt;","profile":"zenrubyangel","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Am I just being naïve?","postDate":"1053444372","msgId":70089,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJhZGhlaytxMHU5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGJhZGQ4ditvYXNtQGVHcm91cHMuY29tPg=="},"prevInTopic":70084,"nextInTopic":0,"prevInTime":70088,"nextInTime":70090,"topicId":70076,"numMessagesInTopic":0,"msgSnippet":"... only 2 and it will be many more years before my husband and I have to face dating and boyfriends. I know that many of you on this list have older kids so I","messageBody":"<div id=\"ygrps-yiv-1167720210\"><blockquote><span title=\"ireply\">&gt;&gt;: Am I just being naïve? My daughter is <br/>\n </span></blockquote>only 2 and it will be many more years before my husband and I <br/>\nhave to face dating and boyfriends. I know that many of you on <br/>\nthis list have older kids so I wanted to ask you all. Do &quot;they&quot; <br/>\n(meaning teenagers) just go ahead and do what &quot;they&quot; want <br/>\nregardless of what &quot;you&quot; (as parents) think?<br/>\n<br/>\n  I&#39;d like to respond to this, though I rarely post.  When I was very <br/>\nyoung, say between 7 and 12 yo, I used to say with all honesty that <br/>\nmy Mom was my best friend. I felt immense love towards her.  I told <br/>\nher everything.  She was a very permissive parent, meaning I <br/>\nbasically felt like I could do what I wanted, except for things like <br/>\nstaying up late (school the next day) and the like.  For a 10 yo <br/>\ngirl, though, I had it pretty good.   In Jr. High, I began taking <br/>\nadvantage of my mothers permissiveness, going places without her <br/>\nknowledge, sneaking <br/>\ncigarettes, tasting little sips of my best friends Dad&#39;d brandy.  I <br/>\nwas a good girl who was experimenting.  Once my mom found cigarettes <br/>\nin my purse.  I lied and told them they were not mine.  She seemed to <br/>\nbelieve me, and I didn&#39;t get in trouble, or even really talked to.  <br/>\nFrom there, I figured that she trusted me so much that I really COULD <br/>\nget away with anything, and that is where it began, by the time I was <br/>\n13, I was no longer a virgin, had shoplifted, started sneaking out of <br/>\nthe house at night, been very drunk many <br/>\ntimes, and began smoking pot.  I was hanging out with total losers, <br/>\nwhile still managing to get mostly A&#39;s on my report card and <br/>\nremaining first chair clarinet in Symphonic band.  When my mother did <br/>\nfind out about things that I had done, she&#39;d cry with me, tell me how <br/>\nworried she was, and that she loved me.  She made no real moves to <br/>\nHELP me get away from the negativity that I was breeeding. She didn&#39;t <br/>\nknow how she could.  My peers had won over the respect that i had for <br/>\nmy mom by the time I was 13.  My High school years were even <br/>\nworse...My mom did the best she could.  She was working 2 jobs for <br/>\nmost of my life to keep the bills paid, trying her best to keep 2 <br/>\nkids happy.  I am the one who betrayed that trust.  My &quot;friends&quot; had <br/>\nsuch a pull over me that I could not be stopped. If only I could have <br/>\ntaken a step back and seen those peers for who they really <br/>\nwere...kids just as troubled and lost as i was, with NO guidance or <br/>\nmotivation to succeed.  A lot of those kids ended up in jail or <br/>\nprison, some became <br/>\njunkies, some just got pregnant early and had abortions. Some died. A <br/>\nfew made it out OK. I was one of the few.  <br/>\n<br/>\nI guess that is one of the reasons why I unschool.  I want to be <br/>\nTHERE <br/>\nfor my daughter (11), not just tell her that I&#39;ll be there when she <br/>\nneeds me.  She needs my physical presence in her life daily, not just <br/>\nfor a couple of hours at night.  My relationship with my DD is even <br/>\nbetter than my early relationship with my Mom. I, too, am a <br/>\nvery permissive parent.  The difference it that I KNOW my daughters <br/>\nbeliefs on cigarettes, sex, drugs, stuck up people, risky behavior.  <br/>\nI know them because we talk about them,alot, not just try to sweep <br/>\nthem <br/>\nunder the rug.  When my mom found out that I was having sex at 13 ( <br/>\nafter all, she did trust that my boyfriend and I were just in my room <br/>\nbehind closed doors TALKING) she rushed me to the gyno and put me on <br/>\nthe pill.  We had never before talked about the dangers or risks <br/>\nassociated with sex.  She trusted me without having a basis for doing <br/>\nso.  She automatically assumed that I would not <br/>\ndo anything to hurt myself or others.  Unfortunately the &#39;friends&#39; <br/>\nthat I chose and the temptations surrounding those friendships were <br/>\nway too alluring.  And the whole time, I just knew I could get away <br/>\nwith it.  I don&#39;t want my dd to think that she can &#39;get away with <br/>\nanything&#39;.  I want her to make responsible choices.  She will not be <br/>\nable to make those responsible choices if left completely to her own <br/>\ndevices, however.  There has to be a good solid foundation from which <br/>\nshe can grow.  That is why I unschool, and I just hope it works.  It <br/>\nscares me to think that my dd could end up making the same mistakes <br/>\nas I did.  My dd, however, has a much healthier self-esteem than I <br/>\ndid at her age. She has a strong sense of who she is and where she <br/>\nwants her life to take her.  she is a very different young person <br/>\nthan I was. That being said,  I am making a concerted effort, every <br/>\nday, to keep the lines of communication OPEN.  I will never just <br/>\nASSUME that she knows what my feelings are, or that I know what hers <br/>\nare.  We talk about everything. And we do it often.  She is not <br/>\nafraid to ask questions about &#39;sensitive&#39; subjects, and I give her <br/>\nhonest answers, not scare tactics or denial, not threats. Also, I <br/>\nknow who her friends are.  To me this is KEY.  My mother never had a <br/>\nclue as to who the kids were that I was hanging out with. BTW, my mom <br/>\nand I now have a very open relationship.  She knows all about my past <br/>\nand my poor choices.  We have cried together several times as <br/>\nI &#39;confessed&#39; the things that I had done in my youth.  We understand <br/>\neach other, and she is, to this day, one of my best friends.  I&#39;m <br/>\njust glad that I am still here to be able to say that.</div>","specialLinks":[]},{"userId":143181466,"authorName":"melissa4123","from":"&quot;melissa4123&quot; &lt;melissa4123@...&gt;","profile":"melissa4123","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Am I just being naïve?","postDate":"1053440095","msgId":70076,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJhZGQ4ditvYXNtQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":70084,"prevInTime":70075,"nextInTime":70077,"topicId":70076,"numMessagesInTopic":0,"msgSnippet":"My sister-in-law and I were having a conversation last night about kids and homeschooling.  It started because I was telling her a story about teenagers,","messageBody":"<div id=\"ygrps-yiv-1510809315\">My sister-in-law and I were having a conversation last night <br/>\nabout kids and homeschooling.  It started because I was telling <br/>\nher a story about teenagers, dating, and sex.  Her comment was <br/>\nsomething along the lines of &quot;Well you can&#39;t stop them from <br/>\ndoing what they really want to do anyway.&quot;  My response was &quot;Of <br/>\ncourse you can!&quot;  If you raise your kids with moral values and <br/>\nsense of what&#39;s right and wrong then, they will make the right <br/>\ndecisions about these things.  She then asked about peer <br/>\npressure and said that kids do lots of the wrong things because <br/>\nof that.  That&#39;s how we got onto homeschooling because I told <br/>\nher that was one of the hundred reasons my husband and I were <br/>\nnot sending our daughter to school.  I just don&#39;t think that it&#39;s a <br/>\nsmart choice to throw a group of kids together, all in the same <br/>\nage range, with no life experience and expect them all to do the <br/>\nright thing.  <br/>\n<br/>\nMy question though is this: Am I just being naïve?  My daughter is <br/>\nonly 2 and it will be many more years before my husband and I <br/>\nhave to face dating and boyfriends.  I know that many of you on <br/>\nthis list have older kids so I wanted to ask you all.  Do &quot;they&quot; <br/>\n(meaning teenagers) just go ahead and do what &quot;they&quot; want <br/>\nregardless of what &quot;you&quot; (as parents) think?<br/>\n<br/>\nHope this makes sense, <br/>\nMelissa</div>","specialLinks":[]}],"prevTopicId":70081,"nextTopicId":69320}}