{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Live & Learn Unschooling Conference","postDate":"1081387701","msgId":92509,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFjYy4xZGYxOWZmMC4yZGE2MDRiNUBhb2wuY29tPg=="},"prevInTopic":62784,"nextInTopic":0,"prevInTime":92508,"nextInTime":92510,"topicId":39663,"numMessagesInTopic":0,"msgSnippet":"Where can I get more info on this conference?","messageBody":"<div id=\"ygrps-yiv-1537732889\">Where can I get more info on this conference?&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n<br/>\n<br/>\nwww.liveandlearnconference.org<br/>\n<br/>\n~Kelly<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":78134331,"authorName":"genant2@aol.com","from":"genant2@...","profile":"genant04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Live & Learn Unschooling Conference","postDate":"1049346242","msgId":62784,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE2MC4xZTUzZGQ0Ni4yYmJkMWFjMkBhb2wuY29tPg=="},"prevInTopic":62756,"nextInTopic":92509,"prevInTime":62783,"nextInTime":62785,"topicId":39663,"numMessagesInTopic":0,"msgSnippet":"In a message dated 4/2/03 6:24:58 PM Eastern Standard Time, ... What a wonderful collection of thoughts.  Made me tear up just reading it. My boys kudzu","messageBody":"<div id=\"ygrps-yiv-1325582836\">In a message dated 4/2/03 6:24:58 PM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kbcdlovejo@...\">kbcdlovejo@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Smiling, I think of my tribe, even those I’ve not yet met and how wonderful <br/>\n&gt; it will be<br/>\n&gt; to see them all.<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>What a wonderful collection of thoughts.  Made me tear up just reading it.  <br/>\nMy boys&#39; kudzu baskets full of the yarn they made from wool sit beside my <br/>\ncomputer to look at every day.  Can&#39;t wait until August.  <br/>\nPam G.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":117369878,"authorName":"Kelli Traaseth","from":"Kelli Traaseth &lt;kellitraas@...&gt;","profile":"kellitraas","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Live & Learn Unschooling Conference","postDate":"1049335530","msgId":62756,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMwNDAzMDIwNTMwLjY5MzI4LnFtYWlsQHdlYjQwMTAxLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDFlZC41YzhkMTJjLjJiYmNjOWUzQGFvbC5jb20+"},"prevInTopic":62747,"nextInTopic":62784,"prevInTime":62755,"nextInTime":62757,"topicId":39663,"numMessagesInTopic":0,"msgSnippet":"**Ren wrote this about last year s conference.** Thanks Ren,   nice. I m there. Kelli Yahoo! Groups SponsorADVERTISEMENT ~~~~ Don t forget! If you change","messageBody":"<div id=\"ygrps-yiv-1072483563\">**Ren wrote this about last year&#39;s conference.**<br/>\n <br/>\nThanks Ren,   nice.<br/>\n <br/>\nI&#39;m there.<br/>\n <br/>\nKelli<br/>\n <br/>\n <br/>\n<br/>\nYahoo! Groups SponsorADVERTISEMENT<br/>\n<br/>\n~~~~ Don&#39;t forget! If you change topics, change the subject line! ~~~~<br/>\n<br/>\nIf you have questions, concerns or problems with this list, please email the moderator, Joyce Fetteroll (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a>), or the list owner, Helen Hegener (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Editor@...\">HEM-Editor@...</a>).<br/>\n<br/>\nTo unsubscribe from this group, click on the following link or address an email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-unsubscribe@yahoogroups.com\">Unschooling-dotcom-unsubscribe@yahoogroups.com</a> <br/>\n<br/>\nVisit the Unschooling website: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> <br/>\n<br/>\nYour use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\nYahoo! Tax Center - File online, calculators, forms, and more<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Live & Learn Unschooling Conference","postDate":"1049325539","msgId":62747,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFlZC41YzhkMTJjLjJiYmNjOWUzQGFvbC5jb20+"},"prevInTopic":39663,"nextInTopic":62756,"prevInTime":62746,"nextInTime":62748,"topicId":39663,"numMessagesInTopic":0,"msgSnippet":"Ren wrote this about last year s conference.  She and I thought we d share it here and at the other unschooling sites to give those of you who weren t there","messageBody":"<div id=\"ygrps-yiv-493644430\">Ren wrote this about last year&#39;s conference.  She and I thought we&#39;d share it <br/>\nhere and at the other unschooling sites to give those of you who weren&#39;t <br/>\nthere some idea of what you missed---and to give those of you who were there <br/>\na few memories. It&#39;ll give those who *are thinking* about coming some <br/>\nincentive, maybe! *G*<br/>\n<br/>\n~Kelly                 <br/>\n<br/>\nLive & Learn Unschooling Conference 2002, Columbia SC<br/>\n<br/>\nAs an unschooler, it’s easy to feel like the lone misfit in a society that <br/>\nthat has no<br/>\nconcept of your lifestyle.<br/>\n<br/>\nAt work, with neighbors, in church, or anywhere daily living might take you, <br/>\nthere is a<br/>\nwide gap between your reality and how other people live.  Even among other<br/>\nhomeschoolers there can often be a lack of understanding.<br/>\n<br/>\nThere are some lucky folks (like myself) that enjoy the company of one or two <br/>\nother<br/>\nfamilies that embrace this lifestyle, but it is the rare family that would <br/>\nfind themselves<br/>\nsurrounded by the freedom loving, natural learning, radical type of people we <br/>\ncall<br/>\nunschoolers. Rare that is, until one fine day dawned in South Carolina last <br/>\nOctober<br/>\nunlike any that had dawned before.  A day that my children and I had planned<br/>\nmonths for. A day I had dreamt of and could only try to imagine, but in which <br/>\nmy<br/>\nimagination (for once) fell short of reality.  A day that for the first time <br/>\never, I was<br/>\nno longer a minority, no longer the odd one in a society that I felt <br/>\ndistanced from,<br/>\nbut a part of a group.<br/>\n<br/>\nIt isn’t easy to describe the feeling of finding one’s own people.  We had <br/>\ncome<br/>\nhome.<br/>\n<br/>\nThere was a sense of expectancy as we made that last leg of the journey into<br/>\nColumbia.  We pulled up to the hotel, weary and excited...we were finally <br/>\nthere,<br/>\nunschoolers paradise!  It warmed my heart to think of my comrades flying and <br/>\ndriving<br/>\ntheir way towards the same location.<br/>\n<br/>\nUpon registering, we heard the bad news that Sandra had fallen, breaking her <br/>\nleg<br/>\nand landing herself in the hospital.  I had missed her by less than an hour!! <br/>\n Everyone<br/>\nwas mourning the loss of her presence and scrambling to fill in her time slot <br/>\nwith<br/>\nanother speaker. Fortunately for all of us, her son Marty had come along.  <br/>\nThe conference wouldn’t <br/>\nbe totally Doddless after all.<br/>\n<br/>\nEvery time I turned a corner there was another familiar name....Anne Ohman, <br/>\nJoyce<br/>\nFetteroll, Zenmomma (Mary Gold), Tuck, Marji, Karin, Elissa, Kathryn and <br/>\nKelly Lovejoy of <br/>\ncourse....these were my heroes, my sanity and my sage matriarchs.  I had <br/>\nread,<br/>\nre-read, questioned and been utterly charmed by their words.  And here they <br/>\nwere, in<br/>\nthe flesh, looking so, well...so NORMAL!<br/>\n<br/>\nThe magic of meeting other unschoolers, especially those you’ve known from <br/>\nthe<br/>\ninternet, is the immediate connection.  There is a common bond, a feeling of <br/>\neasy<br/>\ncomeraderie one doesn’t find so common in this world.<br/>\n<br/>\nAfter dinner, we all headed for the Pajama party. Elissa saw my street <br/>\nclothes and<br/>\ninsisted that I actually wear pajamas...it was a PJ party after all, everyone <br/>\nELSE would<br/>\nbe in sleepwear right? HA! We were the only two adults in the entire room <br/>\nthat actually <br/>\nwore our nighttime clothing.  Fortunately it was a room of free thinkers, <br/>\nthey didn’t even<br/>\ngive us a second glance.  Fun, laughter and talk flowed into the room as <br/>\nnaturally as <br/>\nwine into a sparkling goblet.  Children and adults, enjoying, learning and <br/>\nplaying <br/>\ntogether. And we’d barely gotten started.<br/>\n<br/>\nSome tired, but brave souls greeted Saturday morning barefoot by the pool as <br/>\nLuz<br/>\nShosie led us through a Tai Chi class. As the cool morning air kissed our <br/>\nskin and<br/>\nthe earth spun it’s way to light, I couldn’t help but think of the other <br/>\nsane attendees<br/>\nsnuggled warmly in their beds.  Either they were all being considerate, and <br/>\ntrying to<br/>\nlet us have a small, intimate class or ....AH, who was I kidding?  They were <br/>\ntoo dang<br/>\ntired to come!!<br/>\n<br/>\nSaturday passed in a jubilant, magical haze of activity.  Chasing a small <br/>\ntoddler all<br/>\nweekend kept me more distracted than most, but also allowed me to catch <br/>\nsnatches<br/>\nof many different Funshops and speakers.  I see colors, happy faces and <br/>\ndreamy<br/>\nmoments all jumbled up in my mind like blankets during the building of a <br/>\nfort.<br/>\nThere was soul food, a feast that seemed unending and in between courses we<br/>\npaused from gorging and found quiet moments in which life long friendships <br/>\nwere<br/>\nformed.  As we dabbled and played our way towards Sunday, many forces pulled <br/>\nus<br/>\ntogether and etched people and events on our hearts that we will never <br/>\nforget.<br/>\nThe buffet included some unique experiences that will undoubtably stay with <br/>\nus for<br/>\nalways. <br/>\n<br/>\nThere is a snapshot in my mind of the concentration my nine year old <br/>\npossessed<br/>\nduring the “Unweaving” funshop with Errol Alger. Participants wove a floor <br/>\nto ceiling<br/>\nsculpture with colorful rope, twine and yarn.  This fantastic sculpture took <br/>\non new life<br/>\nevery hour or so as each child imbued it with their own version of perfection <br/>\n(until<br/>\nthe poor sculpture had enough perfection and finally collapsed).  On Sunday <br/>\nhe<br/>\ncharmed us with “Unequilibrious Art”, unique mobiles made from common <br/>\nkitchen <br/>\ntools. The room was awash with ethereal, colorful tools hanging from the <br/>\nceiling!<br/>\n<br/>\nIt was my privilege to witness joy firsthand in my Fun and Games on a Budget<br/>\nfunshop as children sculpted (and ate) with marshmallows, squished their <br/>\nhands in <br/>\nshaving cream and erected a geodesic dome of newspaper logs. The logs were <br/>\nrolled<br/>\nin solitary confinement in my hotel bathroom the night before out of respect <br/>\nfor the<br/>\nwimps that feel asleep before midnight. My late night meeting with the <br/>\nnewspaper<br/>\ncontributed immensely to the foggy brained feeling during Tai Chi.(I take no<br/>\nresponsibility for any inane comments I may have made during that time.)<br/>\n<br/>\nNancy Basket patiently led us through stories of Native American lore, shared <br/>\ntribal<br/>\nart and showed us how to use Kudzu in the most amazing ways.  There were<br/>\nmini-baskets and hand-made paper created by even the youngest attendees. It’s<br/>\npretty amazing to see nature shoved into a blender!<br/>\n<br/>\nKevin Dunn opened the doors of fascination with his static electricity <br/>\nfunshop.  The<br/>\nchildren especially loved turning the lights off to make static sparkle in <br/>\nthe dark. <br/>\nYou could almost see the neural pathways growing right in front of your eyes <br/>\nas<br/>\neveryone made connections through play.<br/>\n<br/>\nA particularly joyful escapade was the “Play with your food” funshop in <br/>\nwhich<br/>\nchildren delighted us with food that looked like people and things. Funny <br/>\nfaces and<br/>\nfunky arrangements bedecked the room for hours. We had the best decor in the<br/>\nhotel!<br/>\n<br/>\nOther workshops included soapmaking, handspinning and even Mother Goose <br/>\nflying<br/>\nby to share a few of her favorite tales!<br/>\n<br/>\nThe room was jammed full when Christian Thee shared slides of his artwork. He <br/>\nhas<br/>\na deep passion for magic and art, which he manages to blend seemlessly in the <br/>\nmost<br/>\namazing ways. You could actually hear the gasps in the audience when he <br/>\nshared a<br/>\npiece of art that changes, as if it were truly enchanted, right before your <br/>\nunbelieving<br/>\neyes. <br/>\n<br/>\nMeanwhile, the speakers upstairs were telling their truth from the heart. <br/>\nEnlightening<br/>\nand charming the audience, sharing with thirsty souls and causing us to think <br/>\ndeeply<br/>\nabout important issues.<br/>\n<br/>\nLike an enchantress, Anne Ohman waved her magic wand of trust and joy, <br/>\ndispelling<br/>\nthe darkness of fear.  We left calmed, hopeful and healed as her empowering <br/>\nwords<br/>\npenetrated our being.  The love she feels for children is evident not only in <br/>\nher<br/>\nspeaking, but in the natural flow of trust exhibited with her own children. <br/>\nShe<br/>\nreminded us of just how incredibly important it is to live mindfully and what <br/>\nthe<br/>\nrewards of living mindfully with children are when she said,<br/>\n“Discover the joys of learning FROM the children, the joys of seeing the <br/>\nworld<br/>\nthrough their eyes and their hearts. From their earliest days, the children <br/>\nare the<br/>\nmasters at living in the present moment! Also....are you on you very own path <br/>\nin life? <br/>\nHave you ever been on someone elses idea of what your path should be? <br/>\nChoosing to live mindfully develops your True Self, as you discover or <br/>\nre-discover<br/>\nyour passions, and as you continually define who you are as you change and <br/>\ngrow. <br/>\nWonderful things are waiting to happen.”<br/>\n<br/>\nWonderful things indeed........<br/>\n<br/>\nFiona Hutchison is an actress that reveled us with her stories of freedom in <br/>\nNew<br/>\nYork at age 13, when she left school.  In her charming English accent she <br/>\nreminded<br/>\nus just how important the attitude of her parents was in trusting her to find <br/>\nher own<br/>\npath. “I certainly don’t have all the answers to how unschooling works, but <br/>\nI can tell<br/>\nyou what worked for me when I was given the freedom to pursue my dreams.”<br/>\nMy favorite story was about her failing grades before leaving school, and her <br/>\nfather<br/>\nsaying “F is for Fantastic, my dear!”<br/>\n<br/>\nWe were reminded of the potential for social change when Lisa Bugg shared her<br/>\nexperiences of answering questions to outsiders that have no idea what<br/>\nhomeschooling, much less unschooling looks like from day to day.<br/>\n“When asked if homeschooled children are successful, I alway ask the <br/>\nquestioner to<br/>\ndefine success.  I scare a few people.  I make a few others angry.  But more <br/>\noften<br/>\nthan not, I plant seeds.  Re-evolutionary seeds that will sustain the future <br/>\ngrowth of<br/>\na changed society.” and “They have spent their lives thinking for <br/>\nthemselves.  I can’t<br/>\nwait to watch as thousands of homeschooled young adults begin to move out <br/>\ninto<br/>\nthe adult world.  We should be in store for some wonderful changes.”<br/>\n<br/>\nAnd Joyce, as usual, had straight forward, balanced advice on how to get to<br/>\nunschooling. Five seemingly simple steps that held an abundance of wisdom.<br/>\nIn step Five she comments “More often kids will slowly gather interesting <br/>\ntidbits,<br/>\nmaking connections as things occcur to them to create a foundation.  They’ll <br/>\nadd<br/>\npieces here and there over the years to build on that foundation.  This is <br/>\nnot easy to<br/>\nsee going on...and very easy to undervalue.” <br/>\n<br/>\nThe people at the conference with the most years of experience in the world <br/>\nof<br/>\nunschooling, Ned Vare and Luz Shosie, shared stories of their now grown son <br/>\nand<br/>\nwhat it was like in the early years, before homeschooling was common place. <br/>\nAbout<br/>\nraising their unschooled-from-birth son Cassidy, Ned said “Our role was to <br/>\nmake as<br/>\nmuch of the world available to him as we could, and then keep out of his way<br/>\nintellectually--to let him get his own impressions, and make his own choices <br/>\nand<br/>\ndecisions.”<br/>\n<br/>\nAnother forceful presence was Ben Lovejoy.  I suppose because men seem to <br/>\nhave<br/>\na harder time accepting unschooling over all, his fierce conviction was <br/>\ndeeply<br/>\nappreciated.  Several people joined him Saturday night to view the movie “<br/>\nDead<br/>\nPoets Society” and discuss the implication of the theme as related to <br/>\nunschooling. <br/>\nEarlier in the evening he held a discussion for the Dads, “Reluctant<br/>\nHusbands/Reluctant Fathers” which I heard had many of the participants left <br/>\nwith<br/>\nnew insight and understanding of what unschooling is really all about.<br/>\n<br/>\nThe common thread that wove all of these speakers together was the theme of<br/>\ntrust. Trusting in children, trusting that they will learn and that they know <br/>\nbest what is<br/>\nneeded for their unique life journey.<br/>\n<br/>\nEven Sandra was present in thought as each visitor to the hospital brought <br/>\nback<br/>\ntales of her fiesty defiance in the face of disaster.  Up until Sunday <br/>\nevening she was<br/>\nconvinced (and trying to convince us) that she would indeed make an <br/>\nappearance<br/>\npins in her leg or not, THANK YOU! I think the morphine may have had some<br/>\ninfluence, but then, knowing Sandra, perhaps not.<br/>\n<br/>\nI’ll never forget the looks of awe during the talent show Saturday night as <br/>\nKevin<br/>\nDunn told the Dr. Suess tale “The Pale Green Pants” with the help of young <br/>\nWill<br/>\nTucker on Kevin’s eerie music machine.  We were held captive in the darkened <br/>\nroom<br/>\nas his voice rose and fell with the passion of a true storyteller.<br/>\n<br/>\nSweet melodies and angelic voices enchanted us. Magicians astounded (the<br/>\nyoungest was only 6 years old) and dancers entertained.  There was so much <br/>\nenergy<br/>\nin the room it positively crackled with electricity.<br/>\n<br/>\nSunday brought more of the same. A panel discussion had questions flowing and <br/>\nan<br/>\ninteresting variety of unschoolers represented...the youngest (Marty Dodd) <br/>\nwas 13<br/>\nyears old, the oldest (Ned Vare) I’m not going to guess at his age since he <br/>\nseems<br/>\nso young at heart in spite of the grey hairs.<br/>\n<br/>\nThe energy that flowed between panel members and audience affected all. <br/>\nSandra<br/>\nsays of Marty’s experience: “Since I wasn’t there to be on a panel, Marty <br/>\nsat <br/>\n(I heard) and said people shouldn’t listen to those voices in their heads.  <br/>\nHe’s a fairly shy guy.  He missed hearing mespeak, and I missed his speaking, <br/>\n<br/>\nthough it wouldn’t have happened if I’d been there. At the end of the <br/>\nweekend Marty <br/>\nwas bigger and different.  Something we couldn’tand wouldn’t have planned <br/>\nlifted <br/>\nhim to another level of self-hood.  He’s been ready to return since we left.”<br/>\n<br/>\n<br/>\nDuring the weekend of bonding, of learning, of growing, there was a feeling <br/>\nof<br/>\nsafety.  We had found our tribe and we knew it.  The children knew it too and <br/>\nthey<br/>\nreveled in the freedom. In Jake Ohmans’ words “At the unschooling conference <br/>\nI felt<br/>\nfree. For the first time I was surrounded by people like myself, other kids <br/>\nwho understood <br/>\nwhat it means to learn from life. The friends I made at the conference were <br/>\nunlike other<br/>\nchildren that you meet every day because they seemed more intelligent, like<br/>\ntheir minds had been free to think all their lives. “  <br/>\n<br/>\nI wish I could put into words just what it is like to be utterly surrounded <br/>\nby these<br/>\namazing, unschooled children, the openness with which they approach adults <br/>\nand the<br/>\nrespect the adults had for everyone, regardless of age.  But anything written <br/>\ncan not<br/>\nrecreate the feeling of being with one’s own people.  The magic and aura of <br/>\nthat<br/>\nspectacular weekend will be with us forever.<br/>\n<br/>\nThe end of the conference brought a sense of sadness at the parting.  We were<br/>\ngoing back to our homes, our lives, but we were going back with a sense of<br/>\nrenewed purpose and joy (not to mention a deep gratitude for Kelly, Melinda <br/>\nand<br/>\neveryone that made the conference possible!!)<br/>\n<br/>\nThere is a special shelf in one corner of my house.  It holds some pressed <br/>\nleaves, a<br/>\npiece of tumbleweed, a cotton plant, a bundle of sage, a sprig of creasote, a <br/>\nkudzu<br/>\nbasket and some handmade paper. It is pieces of these people that have found <br/>\ntheir<br/>\nway into my heart and I am reminded of one magical weekend and these very <br/>\nspecial<br/>\nsouls each time I look at these items.<br/>\n<br/>\nIt represents their homes, something unique to the region where they live.  <br/>\nThey<br/>\ngifted me with these pieces of their lives, something tangible to remind me <br/>\nthat I am<br/>\nsurrounded by likeminded souls, scattered though we may be.  They gifted me <br/>\nwith<br/>\nso much more than those fragile pieces of nature, the true gifts are perhaps <br/>\nharder<br/>\nto see until closer inspection.  Because if you looked hard enough, you could <br/>\nsee<br/>\nthat the true gifts were their time, their wisdom and encouragement.  Their <br/>\ngifts show <br/>\nthrough each day, not so much on that special shelf, but in our lives as we <br/>\nlive more <br/>\npeacefully, more aware and more enriched.  I sniff my bundle of creasote <br/>\ntoday as <br/>\nI write and I know that anotheropportunity lies just around the corner, an <br/>\nopportunity <br/>\nthat should not be missed. <br/>\n<br/>\nSmiling, I think of my tribe, even those I’ve not yet met and how wonderful <br/>\nit will be<br/>\nto see them all.<br/>\n<br/>\nRen Allen</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Live & Learn Unschooling Conference","postDate":"1028292547","msgId":39663,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ0LjIzYjkyNmRlLjJhN2JkOWMzQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":62747,"prevInTime":39662,"nextInTime":39664,"topicId":39663,"numMessagesInTopic":0,"msgSnippet":"School s Out Support s Live & Learn Unschooling Conference Update The Early Bird Deadline for registration is right around the corner! Please get your","messageBody":"<div id=\"ygrps-yiv-816659111\">School&#39;s Out Support&#39;s <br/>\nLive & Learn Unschooling Conference<br/>\nUpdate<br/>\n<br/>\nThe Early Bird Deadline for registration is right around the corner! <br/>\nPlease get your registration to us by 15 August 2002---in time to take <br/>\nadvantage of this special rate!<br/>\n<br/>\nThis will be a wonderful opportunity to learn how learning happens, <br/>\nto erase any doubts about unschooling, <br/>\nand to have a great time with other unschoolers from around the country! <br/>\nDon&#39;t miss it!<br/>\n<br/>\nBe inspired by Sandra Dodd, Anne Ohman, Joyce Fetteroll, Lisa Bugg, <br/>\nNed Vare & Luz Shosie, Fiona Hutchison and others!<br/>\n<br/>\nFun for the whole family! <br/>\nAll presentations, funshops, and activities will be open to all ages.<br/>\nNo Age Descrimination!<br/>\n<br/>\nPayments will be accepted by Check, Money Order, or PayPal. <br/>\nDon&#39;t hesitate! Fill out your form today!<br/>\n<br/>\nClick here to go directly to the form!<br/>\n&lt;A HREF=&quot;<a rel=\"nofollow\" target=\"_blank\" href=\"http://schoolsoutsupport.org/form.html&quot;\">http://schoolsoutsupport.org/form.html&quot;</a>&gt;Schools Out Support&lt;/A&gt;:Registration<br/>\n<br/>\nAnd don&#39;t forget the hotel registration either! <br/>\n&lt;A HREF=&quot;<a rel=\"nofollow\" target=\"_blank\" href=\"http://schoolsoutsupport.org/clarion.html&quot;\">http://schoolsoutsupport.org/clarion.html&quot;</a>&gt;Clarion Town House &lt;/A&gt;<br/>\nDeadline for the conference rate and availability is 15 September 2002.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nKelly Lovejoy, Coordinator<br/>\nSchools Out Support<br/>\nmailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:coordinator@...\">coordinator@...</a><br/>\n803-776-4849<br/>\nFax: 803-776-7006<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.schoolsoutsupport.org\">http://www.schoolsoutsupport.org</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":92497,"nextTopicId":92511}}