{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":62434209,"authorName":"Jenny C","from":"&quot;Jenny C&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: why can&#39;t we be MAD?","postDate":"1242145204","msgId":44923,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd1Yzdqays1aW5sQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAyMWMwMWM5ZDJlMyQ5YTk5MzFmMCQ2NDBhYTlhOUBHb256bz4="},"prevInTopic":44895,"nextInTopic":0,"prevInTime":44922,"nextInTime":44924,"topicId":44893,"numMessagesInTopic":0,"msgSnippet":"... almost 5) ... angry ... I said ... angry, ... to ... possibly ... made ... emotions!) ... Perhaps you could ve scooped him up and asked him why he was so","messageBody":"<div id=\"ygrps-yiv-1509092774\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; The other day my son was mad at something his grandma said or did. So<br/>\n&gt; instead of asking why he was mad, my MIL told my son (who is 4.5,<br/>\n </span></blockquote>almost 5)<br/>\n<blockquote><span title=\"ireply\"> &gt; that he can&#39;t be mad. It was the weirdest thing. She said he could be<br/>\n </span></blockquote>angry<br/>\n<blockquote><span title=\"ireply\"> &gt; but not mad because that meant he was crazy like a lunatic or insane.<br/>\n </span></blockquote>I said<br/>\n<blockquote><span title=\"ireply\"> &gt; he could be mad if he wants to be! He is mad in the sense that he is<br/>\n </span></blockquote>angry,<br/>\n<blockquote><span title=\"ireply\"> &gt; there are multiple definitions of many words. (Meanwhile I just wanted<br/>\n </span></blockquote>to<br/>\n<blockquote><span title=\"ireply\"> &gt; try to figure out WHY he was saying he was mad at her, so we could<br/>\n </span></blockquote>possibly<br/>\n<blockquote><span title=\"ireply\"> &gt; remedy that feeling or she could explain whatever she said or did that<br/>\n </span></blockquote>made<br/>\n<blockquote><span title=\"ireply\"> &gt; him mad, which she completely ignored by trying to control his<br/>\n </span></blockquote>emotions!)<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n<br/>\n<br/>\n </span></blockquote>Perhaps you could&#39;ve scooped him up and asked him why he was so angry,<br/>\nand completely sidestepped the whole mincing of words!  His grandma has<br/>\nalready proven to be manipulative and bossy and I&#39;m sure your son felt<br/>\nthat, and maybe he even couldn&#39;t articulate why he was angry, but felt<br/>\nit none the less.  Perhaps help him find a way to articulate what makes<br/>\nhim angry when he is with his grandma, so that he doesn&#39;t get so angry,<br/>\nso that he can say &quot;please don&#39;t do that.&quot; and then change the subject<br/>\nand move onto something else.<br/>\n<br/>\nThat is a really hard skill for some kids to be able to do, but worth<br/>\nencouraging!</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] why can&#39;t we be MAD?","postDate":"1242131591","msgId":44895,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyRTlEMkRGLUI4OEMtNDNCMi04MDQ4LTEyM0ZCOTk0NDdFRUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDAyMWMwMWM5ZDJlMyQ5YTk5MzFmMCQ2NDBhYTlhOUBHb256bz4=","referencesHeader":"PDAyMWMwMWM5ZDJlMyQ5YTk5MzFmMCQ2NDBhYTlhOUBHb256bz4="},"prevInTopic":44893,"nextInTopic":44923,"prevInTime":44894,"nextInTime":44896,"topicId":44893,"numMessagesInTopic":0,"msgSnippet":"Kim, I m sympathetic to you and your frustration with your mother in law. Even though I know the want-to-do-something feeling of wishing a husband s mother","messageBody":"<div id=\"ygrps-yiv-786689186\">Kim,<br/>\n<br/>\nI&#39;m sympathetic to you and your frustration with your mother in law.    <br/>\nEven though I know the want-to-do-something feeling of wishing a  <br/>\nhusband&#39;s mother wouldn&#39;t be a dope with a young child (I&#39;ve known it  <br/>\npersonally and repeatedly), still I&#39;m going to comment in way of  <br/>\ntrying to help you see a balance.<br/>\n<br/>\nThe literal answer to your subect question, &quot;why can&#39;t we be MAD?&quot; is  <br/>\nbecause it doesn&#39;t create peace or learning in your home.<br/>\n<br/>\n<br/>\n-=-I was (mad/angry/resentful) when she pointed this out during  <br/>\ndinner, and<br/>\nwhen I argued, my husband agreed with his mom!!! Why do people feel  <br/>\nthe need<br/>\nto tell other people how to live or how to feel?-=-<br/>\n<br/>\nMaybe, though, you&#39;re wishing your husband had told her how to live  <br/>\nand how to feel.<br/>\n<br/>\n-=- It just felt like one more &quot;schooly&quot; influence,...-=-<br/>\n<br/>\nThis is way beyond and separate from school.   There were in-laws  <br/>\nbefore school was ever considered, and there&#39;s a biological/genetic  <br/>\nthing going here.   So don&#39;t think &quot;school,&quot; if you can help it.<br/>\n<br/>\n-=-... like a way for her to assert a little control over us<br/>\nor something. -=-<br/>\n<br/>\nSounds like she was defending herself, and maybe trying to be a little  <br/>\nfunny (not that it worked well) and maybe trying to influence your  <br/>\nson&#39;s mood.   I can think of a dozen worse things she could&#39;ve done  <br/>\nwithout even thinking hard.<br/>\n<br/>\n-=-Maybe I am paranoid.-=-<br/>\n<br/>\nYou have motherly instincts.  Those can feel like vigilance which can  <br/>\nfeel like paranoia, but don&#39;t exaggerate them past their own natural  <br/>\nstrength.<br/>\n<br/>\n-=- I am mostly trying to remember the beautiful day we spent at the  <br/>\nbeach with my MIL, everyone getting along wonderfully and lots of fun  <br/>\nhad by all. :) -=-<br/>\n<br/>\nSo you have a good example and a bad example.  Don&#39;t dwell on the bad  <br/>\none.  Think of what you could do to nurture or induce the good stuff  <br/>\nnext time.<br/>\n<br/>\nMaybe your son could&#39;ve done something different.  It&#39;s worth  <br/>\ndiscussing it with him.  Rather than try to change his grandmother,  <br/>\nyou might try to &quot;grandmother-proof&quot; him with some suggestions about  <br/>\nhow to respond to her, or to dodge questions or criticisms in sweet  <br/>\nways.   Holly asks about the tortoises and the yard.   How cute can  <br/>\nthat be?   They can ask her all about her hair dye or clothes or  <br/>\nboyfriend and she can say &quot;Are there baby tortoises yet?&quot; and smile.   <br/>\nMy kids learned tricks about grandma&#39;s house at an early age.<br/>\n<br/>\nHolly will be there today, with Keith.   His mom is not likely to live  <br/>\nmuch longer, though she&#39;s having her hair done this morning.  She has  <br/>\ncancer in several places including ribs, and she had an arm amputated  <br/>\nin early March.<br/>\n<br/>\n-=-I know it seems trivial compared<br/>\nto a lot of the posts on here, but if anyone has any insight or an  <br/>\nexample<br/>\nof how you would have handled this, that would be great. I am  <br/>\ncontemplating<br/>\nsending the dictionary definition to my DH and MIL. There is even a  <br/>\nlittle<br/>\nline about how some teachers like to correct people by saying that  <br/>\ninsane is<br/>\nthe only acceptable usage for the word mad, but it has been used to mean<br/>\nangry since 1300 and is now quite acceptable.-=-<br/>\n<br/>\nDon&#39;t pursue that definition.  Let it dissolve, breathe yourself  <br/>\ncalmer and happier, and think of the next time, not the last time.<br/>\n<br/>\nThere might be parallels in this list of how to screw up unschooling.   <br/>\nMaybe you could put your energy into a list of how to screw up visits  <br/>\nwith grandma.  Then you&#39;ll have a mental checklist of good things to  <br/>\ndo.   Mine always included getting the kids and grandparents out to a  <br/>\npublic place like the children&#39;s museum in Albuquerque or the train  <br/>\nmuseum in Alamogordo or someplace where kids could be cute and smart,  <br/>\nand it wasn&#39;t grandma&#39;s territory/chairs/property.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/screwitup\">http://sandradodd.com/screwitup</a><br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":208961162,"authorName":"Kim Zerbe","from":"&quot;Kim Zerbe&quot; &lt;kim.zerbe@...&gt;","profile":"zerbe2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"why can&#39;t we be MAD?","postDate":"1242120333","msgId":44893,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAyMWMwMWM5ZDJlMyQ5YTk5MzFmMCQ2NDBhYTlhOUBHb256bz4="},"prevInTopic":0,"nextInTopic":44895,"prevInTime":44892,"nextInTime":44894,"topicId":44893,"numMessagesInTopic":0,"msgSnippet":"The other day my son was mad at something his grandma said or did. So instead of asking why he was mad, my MIL told my son (who is 4.5, almost 5) that he can t","messageBody":"<div id=\"ygrps-yiv-1670284946\">The other day my son was mad at something his grandma said or did. So<br/>\ninstead of asking why he was mad, my MIL told my son (who is 4.5, almost 5)<br/>\nthat he can&#39;t be mad. It was the weirdest thing. She said he could be angry<br/>\nbut not mad because that meant he was crazy like a lunatic or insane. I said<br/>\nhe could be mad if he wants to be! He is mad in the sense that he is angry,<br/>\nthere are multiple definitions of many words. (Meanwhile I just wanted to<br/>\ntry to figure out WHY he was saying he was mad at her, so we could possibly<br/>\nremedy that feeling or she could explain whatever she said or did that made<br/>\nhim mad, which she completely ignored by trying to control his emotions!) <br/>\n <br/>\nIt doesn&#39;t make sense to correct a 4yr old when he is not even wrong. I&#39;ve<br/>\nbeen around several people who like to do this and I don&#39;t get it. Is this<br/>\njust their way of being right? Despite the harmful or uneasy feelings they<br/>\nconjure when they do this? <br/>\n <br/>\nI just looked up the definition at dictionary.com and yes, MAD can mean<br/>\ninsane, but it can also mean angry. It can also mean overcome by desire (to<br/>\nbe mad about opera was the example) as well as rabid and a few other<br/>\ndefinitions.<br/>\n <br/>\nI was (mad/angry/resentful) when she pointed this out during dinner, and<br/>\nwhen I argued, my husband agreed with his mom!!! Why do people feel the need<br/>\nto tell other people how to live or how to feel? It just felt like one more<br/>\n&quot;schooly&quot; influence, like a way for her to assert a little control over us<br/>\nor something. Maybe I am paranoid. I am mostly trying to remember the<br/>\nbeautiful day we spent at the beach with my MIL, everyone getting along<br/>\nwonderfully and lots of fun had by all. :) I know it seems trivial compared<br/>\nto a lot of the posts on here, but if anyone has any insight or an example<br/>\nof how you would have handled this, that would be great. I am contemplating<br/>\nsending the dictionary definition to my DH and MIL. There is even a little<br/>\nline about how some teachers like to correct people by saying that insane is<br/>\nthe only acceptable usage for the word mad, but it has been used to mean<br/>\nangry since 1300 and is now quite acceptable.<br/>\n <br/>\nKim Zerbe<br/>\nin cloudy, rainy Oregon<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":44850,"nextTopicId":44696}}