{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":24,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Family History","postDate":"1085072298","msgId":94325,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0NS4yYTBlYjcyMi4yZGRlM2RhYUBhb2wuY29tPg=="},"prevInTopic":94309,"nextInTopic":0,"prevInTime":94324,"nextInTime":94326,"topicId":94163,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/20/04 7:17:46 AM, crystal.pina@verizon.net writes: ","messageBody":"<div id=\"ygrps-yiv-2071309788\">In a message dated 5/20/04 7:17:46 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:crystal.pina@...\">crystal.pina@...</a> writes:<br/>\n<br/>\n&lt;&lt; I agree.  I&#39;ve instructed my daughter to get online to my unschooling <br/>\n<br/>\nmessage boards and request a new family should something happen to <br/>\n<br/>\nme.  &gt;&gt;<br/>\n<br/>\nI have thought that too.  Fantasy/daydream kind of way, like.... &quot;Hmmmm.  <br/>\nMaybe the Sorooshians could take Holly, and Marty could move in with Anne for a <br/>\nwhile; he&#39;s nearly grown... &quot;<br/>\n<br/>\nI had someone chosen before I knew I was pregnant with Holly, but now I <br/>\nwouldn&#39;t like that deal anymore.   We had paperwork, too.  But since then he <br/>\nmarried and has two younger kids, and his wife has a master&#39;s in early childhood Ed <br/>\n(one of the rush-jobs the NEA is pushing through so they can get stats on how <br/>\nmany unemployed MAs there are and how the government NEEDS to have public <br/>\nschool for toddlers).  They spank, too.  Blah.<br/>\n<br/>\nThen there&#39;s Wendy, who lived here a while and would have kept them, but <br/>\nshe&#39;s moved to Denver with a girlfriend, and so it wouldn&#39;t quite work.  They&#39;re <br/>\nbuying a house there.   But for a while they were our backup plan.  They would <br/>\ncome and live here and let things procede as usual until the kids were grown <br/>\nor got other plans, and then help them divie up assets.<br/>\n<br/>\nKirby will turn 18 this summer.  He would be fine.  He could probably help <br/>\ntake care of the other two, or the three of them could agree on an adult someone <br/>\nto live in the house with them and be guardian.  <br/>\n<br/>\nThe courts would turn to my sister or Keith&#39;s parents.  Keith&#39;s parents are <br/>\ntoo old and the kids wouldn&#39;t want to live with them anyway.  My sister would <br/>\nflutter around panic-like and ask the kids what they wanted to do, and help <br/>\nthem do it.<br/>\n<br/>\nI should talk to the kids.<br/>\n<br/>\nThe one panicky thing I personally have is having too many of my kids in one <br/>\nautomobile on road trips.  We went on a family trip, all five, with Kirby and <br/>\nMarty doing some of the driving.  I had to breathe deeply and think other <br/>\nthoughts sometimes not to have visions of wondering whether a flaming rollover <br/>\nwould take some of us out, cripple some physically, cripple survivors mentally to <br/>\nthe point they couldn&#39;t take care of the surviving cripples.  Bad, bad <br/>\nvisions.    Too many of us in one car at once.<br/>\n<br/>\nThough it wasn&#39;t a homeschooling situation, I  married a friend of mine when <br/>\nI was 21 so that his 10 and 7 year old siblings wouldn&#39;t be taken away.  Their <br/>\ndad died and less than three years later their mom died.  The brother (#2 of <br/>\n6 siblings) who had already been taking care of them even when she was living <br/>\nwas 23 and the only thing keeping the courts from approving him as guardian <br/>\nwas that he was unmarried.  So I married him.  <br/>\n<br/>\nThe &quot;ranking&quot; relatives on both sides of the family had to agree to Jimbo <br/>\nbeing guardian.  They were glad to.  The state required that we both be bonded <br/>\nfor three  years, because of the money management involved.  We were physical <br/>\nguardians (as a couple), an uncle was financial guardian.<br/>\n<br/>\nSo of all the weird reasons to get married, I got married to help babysit.  <br/>\n<br/>\nIt lasted three years and some, and I learned some things that help me now.  <br/>\nI could&#39;ve done better, as a foster mother, but I did better than either <br/>\nalternative family would&#39;ve done.  I did better with the girl than the boy (younger <br/>\nkid) who, poor guy, was traumatized.  We went with the therapist his <br/>\nfinancial-guardian uncle had chosen, and I regret that.  The guy was a long-term <br/>\nFreudian guy.  We did every other session Andy and the others another family member <br/>\nor combo.  He gave us a few pieces of useful advice, but mostly it was TOO <br/>\nslow to do us any practical good.  We needed something QUICK and helpful and <br/>\nuseful.  Now &quot;how do you feel when&quot; but &quot;here&#39;s what might help between now and <br/>\nnext week.&quot;<br/>\n<br/>\nThen for a while my mom and brother lived there.  She went away and left him <br/>\nwith us for most of a year.  He was 4 and 5 in those days.  So I was 21-24 and <br/>\nhad two and three kids for a few years (without the benefit of personal <br/>\nchildbirth experience), and was teaching Jr. High the whole time.  Trial by fire. <br/>\n<br/>\nI don&#39;t talk about that much.  It&#39;s so complicated, and I have wishes for <br/>\nhaving done some things better.  Other things were great.<br/>\n<br/>\nThat&#39;s the house and the relatives of the story of the little girl raised <br/>\nwithout sugar who took a sack of sugar into the garden, squatted between rows of <br/>\nvegetables and was eating sugar out of the bag with both hands as fast as she <br/>\ncould before she got caught.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":154033277,"authorName":"Crystal","from":"&quot;Crystal&quot; &lt;crystal.pina@...&gt;","profile":"crystalinma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Family History","postDate":"1085057236","msgId":94309,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM4aTljayt0OWhkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDQwNTE5MTYzNDMwLjM4MjcxLnFtYWlsQHdlYjQxNzEyLm1haWwueWFob28uY29tPg=="},"prevInTopic":94285,"nextInTopic":94325,"prevInTime":94308,"nextInTime":94310,"topicId":94163,"numMessagesInTopic":0,"msgSnippet":"... anyone in our family who could be trusted to raise our kids should something happen to us. ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ I agree.  I ve instructed my","messageBody":"<div id=\"ygrps-yiv-847027216\"><blockquote><span title=\"ireply\">&gt; Like Jenny, one thing that really troubles me is that we don&#39;t have <br/>\n </span></blockquote>anyone in our family who could be trusted to raise our kids should <br/>\nsomething happen to us.  <br/>\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~<br/>\nI agree.  I&#39;ve instructed my daughter to get online to my unschooling <br/>\nmessage boards and request a new family should something happen to <br/>\nme.  There is no one in my family now that would want her even for <br/>\novernight, never mind the rest of her life.  She has Aspberger&#39;s and <br/>\ncould never make it in school.  My family just thinks she&#39;s spoiled.  <br/>\nAlso, she&#39;s had the taste of freedom.  I doubt she would be capable <br/>\nof giving that mindset up to go along with the flow of school.<br/>\n<br/>\nCrystal</div>","specialLinks":[]},{"userId":180234378,"authorName":"Sylvia Toyama","from":"Sylvia Toyama &lt;sylgt04@...&gt;","profile":"sylgt04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] Re: Family History","postDate":"1084984470","msgId":94285,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwNTE5MTYzNDMwLjM4MjcxLnFtYWlsQHdlYjQxNzEyLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDIwMDQwNTE3MjIyNDQyLkxPQlc4MDY1Lm10YTEwLmFkZWxwaGlhLm5ldEBsZWlnaD4="},"prevInTopic":94236,"nextInTopic":94309,"prevInTime":94284,"nextInTime":94286,"topicId":94163,"numMessagesInTopic":0,"msgSnippet":"A quick intro first -- I m Sylvia, an unschooling Mom to 3 boys (one grown & gone), living in Albuquerque, with my husband Gary and our two younger boys.","messageBody":"<div id=\"ygrps-yiv-1361556148\">A quick intro first -- I&#39;m Sylvia, an unschooling Mom to 3 boys (one grown & gone), living in Albuquerque, with my husband Gary and our two younger boys.  Andy&#39;s almost 8, and Dan is 3.  <br/>\n <br/>\nI grew up in a house where my parents spanked, grounded, confiscated stuff, and the like -- but that was pretty much the way everyone I know was raised to some degree.  I don&#39;t know anyone who was never spanked.  I was also told often (by my Mom) that I was loved, beautiful, smart, and so on, and wasn&#39;t really shamed.  Never heard it from my Dad, but I&#39;m pretty sure he&#39;s incapable of actually feeling love in the way I do (he&#39;s just way too damaged), so I&#39;ve been able to move past that. Sure, our house was dysfunctional, but I knew lots of kids whose homes were much worse than mine -- kids in foster care because their parents abused them horribly, kids still in a home where Dad got drunk and beat everyone in sight.  Some of them turned out okay, some not so okay.<br/>\n <br/>\nLooking back, I know my Mom did a better job than her parents did.  Even my Dad did a better job (he was actually tied to chairs as a young child to make him behave!).  I&#39;ve improved on that -- even my siblings who still spank and ground, have improved on our parents&#39; methods.  <br/>\n <br/>\nLike Jenny, one thing that really troubles me is that we don&#39;t have anyone in our family who could be trusted to raise our kids should something happen to us.  The inlaws aren&#39;t abusive, but guilt and shame are their favorite parenting tools, and everyone is very school-oriented.  I&#39;ve actually thought I&#39;d choose my oldest son -- even with the usual challenges of being 19 -- to raise his brothers before anyone else.  Being a firstborn myself, I shudder to think of asking him to ever take on such a responsibility.   He&#39;s enough like me to want better for the boys, just way too young to have to do it.  I guess I&#39;ll just hold to my conviction that we&#39;ll both be just fine.<br/>\n <br/>\nAnyway, I don&#39;t know anyone who didn&#39;t have a dysfunctional childhood when I was a kid (it was the 70&#39;s after all) and no one I knew then unschools, or even homeschools.<br/>\n <br/>\nSyl<br/>\n <br/>\n <br/>\n  <br/>\n <br/>\n  <br/>\n<br/>\n\t\t<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\nSBC Yahoo! - Internet access at a great low price.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":77070457,"authorName":"Sanguinegirl83@aol.com","from":"Sanguinegirl83@...","profile":"sanguinegirl83","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Family History","postDate":"1084869838","msgId":94236,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU1LjU3YzJhOWQ0LjJkZGIyNmNlQGFvbC5jb20+"},"prevInTopic":94220,"nextInTopic":94285,"prevInTime":94235,"nextInTime":94237,"topicId":94163,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/17/2004 5:26:30 PM Eastern Daylight Time, ... Wow, I got that, big time. After a while, I refused to play the shame game-like the time my","messageBody":"<div id=\"ygrps-yiv-1610408786\">In a message dated 5/17/2004 5:26:30 PM Eastern Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kbcdlovejo@...\">kbcdlovejo@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But I wasn&#39;t shamed, that I remember.<br/>\n<br/>\n </span></blockquote>Wow, I got that, big time. After a while, I refused to play the shame <br/>\ngame-like the time my mother came down to my track practice and tried to goad me into <br/>\nrunning faster by &quot;out running&quot; me (and she was quite a bit older and quite <br/>\nfat). I just kept joggin along at my pace, even though all the other girls were <br/>\nyelling for me to &quot;run! beat her!&quot;-because I was damned if I was going to let <br/>\nher win-which was what would have happened if I had let her goad me into <br/>\nplaying her game. That was her way of &quot;controlling&quot; me whenever there was someone <br/>\naround to shame me in front of. Otherwise, she just beat me. I think that&#39;s <br/>\nwhy I don&#39;t embarrass, now. I was completely humiliated as a kid and a teen <br/>\n(puberty was a horror), so not much can bother me, now-except my own dumb <br/>\nmistakes! LOL It also affects the way I parent. I go out of my way to make sure I <br/>\ndon&#39;t humiliate him in public-well, anywhere. Which would be easy to do with <br/>\nprobably any other kid, since I&#39;m such a goof! LOL But he&#39;s so much like me, that <br/>\nreally isn&#39;t an issue, much.<br/>\nI was also told I was beautiful, smart, and that I could be/do <br/>\nanything I wanted.<br/>\nI got called fat (I wasn&#39;t-but the power of a mother&#39;s words convinced me I <br/>\nwas), and got those &quot;backhanded&quot; compliments: you have such a pretty face-if <br/>\nonly you&#39;d lose weight! Got told I could never be ____ (such as a vet) because <br/>\n_____ (I could NEVER get good enough grades-even though I was SMART enough to <br/>\nget them-I was just LAZY)... but that just helps to influence my parenting. <br/>\nUnfortunately, when I&#39;m upset or frustrated, sometimes my mother&#39;s parenting <br/>\nsurfaces. I hate that. It doesn&#39;t happen often, and so far, it hasn&#39;t been &quot;the <br/>\nworst&quot; of it-and it gets better as time goes by and I make my own way. I think <br/>\nthat is my greatest fear-is becoming my mother. (as a parent.) That&#39;s one of <br/>\nthe reasons I like this group so much! I get positive reinforcement for that <br/>\ngood, gentle, supportive parenting that I am aiming for and working at! :~)<br/>\n<br/>\nSíocháin ar domhan,<br/>\nSang<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":177721839,"authorName":"Angela","from":"&quot;Angela&quot; &lt;game-enthusiast@...&gt;","profile":"autonomousangela","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] Re: Family History","postDate":"1084832684","msgId":94220,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwNTE3MjIyNDQyLkxPQlc4MDY1Lm10YTEwLmFkZWxwaGlhLm5ldEBsZWlnaD4=","inReplyToHeader":"PDE0My4yOTYwOGM0ZC4yZGRhNmY1ZUBhb2wuY29tPg=="},"prevInTopic":94217,"nextInTopic":94236,"prevInTime":94219,"nextInTime":94221,"topicId":94163,"numMessagesInTopic":0,"msgSnippet":"Is seems likely that the people who question norms enough to consider unschooling have spent a considerable amount of time reflecting on other societal norms","messageBody":"<div id=\"ygrps-yiv-39309640\">Is seems likely that the people who question norms enough to consider<br/>\nunschooling have spent a considerable amount of time reflecting on other<br/>\nsocietal norms like mainstream parenting.  I think these people are just<br/>\nmore likely to understand that the way they were parented affects their<br/>\nadult lives because they&#39;ve spent more time thinking about it.  <br/>\n <br/>\nMost of the people I know in real life were parented the way most mainstream<br/>\nparents parent.  They were shamed (at least to some degree), made to follow<br/>\nrules blindly (because I said so), and talked down to because they were only<br/>\nchildren.  Most were spanked and dealt self- defeating comments of a regular<br/>\nbasis.  <br/>\n <br/>\nI know that my own parents, although not perfect parents, did better than<br/>\ntheir own parents.  I, in turn, have already improved upon their parenting<br/>\nand I hope my own children improve upon my parenting.<br/>\n <br/>\nI don&#39;t think that more unschoolers come from dysfunctional homes.  I agree<br/>\nwith Deborah, I think they are just more aware of it and more willing to<br/>\ntalk about it in order to improve upon their own lives and the lives of<br/>\ntheir children.  <br/>\n <br/>\nAngela <br/>\n &lt;mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:game-enthusiast@...\">game-enthusiast@...</a>&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:game-enthusiast@...\">game-enthusiast@...</a> <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Family History","postDate":"1084828979","msgId":94213,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyLjRlMjkwYzgzLjJkZGE4NzMzQGFvbC5jb20+"},"prevInTopic":94207,"nextInTopic":94217,"prevInTime":94212,"nextInTime":94214,"topicId":94163,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/17/2004 1:11:10 AM Eastern Daylight Time, jnjstau@gvtc.com writes: All this talk about parents demeaning their children makes me wonder if","messageBody":"<div id=\"ygrps-yiv-761125429\">In a message dated 5/17/2004 1:11:10 AM Eastern Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jnjstau@...\">jnjstau@...</a> writes:<br/>\nAll this talk about parents demeaning their children makes me wonder if many <br/>\npeople move to unschooling and respectful parenting as a reaction against <br/>\nabuses they received as a child.<br/>\n<br/>\nI wonder if a disproportionate number of unschoolers come from dysfunctional <br/>\nchildhoods.<br/>\n<br/>\nThe childhoods many people describe on this list are horrendous....I just <br/>\ncan&#39;t imagine the &quot;Miss Aster&quot; stuff....and I&#39;m very sad that anyone had to go <br/>\nthrough that.<br/>\n<br/>\nBut it seems much more common on this list than in real life....or at least <br/>\nmy real life.  Any thoughts?&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n<br/>\nMy parents spanked. A lot. It&#39;s still *my* first reaction when extremely <br/>\nstressed. It takes everything I have sometimes not to strike out. Just the way I <br/>\nwas brought up. I was hit with hands, belts, switches, hairbrushes---probably <br/>\nother things I can&#39;t quite recall. Cameron was spanked a little. Duncan, not at <br/>\nall.<br/>\n<br/>\nI was eleven before I knew someone who was NOT spanked! Really. Just the way <br/>\nthings were/are here. I was floored when I learned that she hadn&#39;t been <br/>\nspanked. And SHE turned out just fine too! &lt;g&gt;<br/>\n<br/>\nBut I wasn&#39;t shamed, that I remember. I was always told that I was <br/>\nloved----and frequently. I was also told I was beautiful, smart, and that I could be/do <br/>\nanything I wanted. I was given everything I asked for---within reason ( I <br/>\nnever got that black Arabian stallion! &lt;g&gt;). Sometimes I had to wait, though. My <br/>\nfather would go without in order to make sure Johnny and I had everything we <br/>\nneeded/wanted. I honestly can&#39;t remember being told &quot;no&quot; by my father.<br/>\n<br/>\nI was always held to higher expectations. I was fine in school. Liked it <br/>\nmostly, though I had no options. Homeschooling was illegal here in SC until 1985 <br/>\n(and I was married by then!).<br/>\n<br/>\nI know of a few families that were kinder, gentler than mine and a whole lot <br/>\nof families that were meaner. Ben&#39;s family comes to mind. They&#39;re just MEAN!<br/>\n<br/>\n~Kelly<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":140747339,"authorName":"Jennifer Altenbach","from":"&quot;Jennifer Altenbach&quot; &lt;salten@...&gt;","profile":"brownaltenbach","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] Family History","postDate":"1084826589","msgId":94217,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDAwMWM0M2M0ZiQ5MGU4YjdmMCQ2NTAxYThjMEBqZW5sYXB0b3A+","inReplyToHeader":"PDdkLjRlM2NmMDEwLjJkZGEzM2RmQGFvbC5jb20+"},"prevInTopic":94213,"nextInTopic":94220,"prevInTime":94216,"nextInTime":94218,"topicId":94163,"numMessagesInTopic":0,"msgSnippet":"About dysfunctional childhoods, Sandra wrote: ","messageBody":"<div id=\"ygrps-yiv-984871873\">About dysfunctional childhoods, Sandra wrote:<br/>\n<br/>\n&lt;&lt;&lt;&lt;-=-But it seems much more common on this list than in real<br/>\nlife....or at <br/>\nleast my real life.  Any thoughts?-=-<br/>\n<br/>\nI think it&#39;s much LESS common on this list than in real life.<br/>\n<br/>\nSandra&gt;&gt;&gt;&gt;&gt;<br/>\n <br/>\nSadly, I also think this is true.  We recently had a spammer get past<br/>\nthe moderators on the positive discipline list I am on.  He invited us<br/>\nto a yahoo group that he had set up that was basically a forum for<br/>\ndiscussing a disturbing fetish involving children.  I checked out his<br/>\ngroup, and the scary thing was that there were over 300 members already,<br/>\nand it was a new group! And the moderators said that they get at least<br/>\none of these every month (because the word &quot;discipline&quot; is in the name<br/>\nof the group). Then you look at some of those daytime talk shows, or<br/>\nwatch the news, and you can&#39;t help but think that there are a LOT of<br/>\nmessed up people out there, and few people are able to rise above the<br/>\ncontinuing cycle of abuse and neglect, for whatever reason.  I even have<br/>\na friend who uses all the attachment parenting practices with her babies<br/>\nand seems very progressive in her parenting philosophy, but who stunned<br/>\nme the other day by saying that she thinks that spanking is necessary<br/>\nsometimes.  <br/>\n <br/>\nI actually don&#39;t know ANYONE in real life who I would feel comfortable<br/>\nappointing as a guardian for my kids if anything were to happen to Chris<br/>\nand me(a dilemma that has been bugging me lately).  None of my friends<br/>\nor family members really &quot;get&quot; the way we are trying to raise our kids,<br/>\nalthough they do support my efforts.  Not that they all had horrendous<br/>\nchildhoods, but they were raised with a system of punishments and<br/>\nrewards, some were spanked, some were emotionally abused, they all went<br/>\nto school, and very few of them seem to be open to alternatives to the<br/>\nabove.  <br/>\n <br/>\nOK, so before you all get the impression that I am always this gloomy, I<br/>\nalso want to say how totally mind-blowing and inspiring I am finding<br/>\nthis list!  Last night as I did the dishes my mind was racing as I<br/>\nthought about several of the recent topics.  I just love it when I think<br/>\nI know it all and then I find out that so very much more is out there.<br/>\nYou all are amazing!!!!<br/>\n <br/>\nGotta go, my son needs me...<br/>\n <br/>\nJenny<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1123183,"authorName":"DACunefare@aol.com","from":"DACunefare@...","profile":"undermom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Family History","postDate":"1084822878","msgId":94207,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0My4yOTYwOGM0ZC4yZGRhNmY1ZUBhb2wuY29tPg=="},"prevInTopic":94205,"nextInTopic":94213,"prevInTime":94206,"nextInTime":94208,"topicId":94163,"numMessagesInTopic":0,"msgSnippet":"I think that everybody probably knows way more people who had crappy childhoods than they realize. Most people don t go around telling other people about their","messageBody":"<div id=\"ygrps-yiv-565853496\">I think that everybody probably knows way more people who had crappy <br/>\nchildhoods than they realize. Most people don&#39;t go around telling other people about <br/>\ntheir childhood traumas unless there&#39;s a good reason to share, for instance <br/>\nparents trying to figure out how to make their children&#39;s lives better. So it <br/>\nstands to reason you hear more about this on unschooling lists, and parenting <br/>\nlists, (and even on writers lists where folks are getting in touch with their <br/>\ninner selves).<br/>\n<br/>\nIt&#39;s not that more unschoolers came from dysfunctional families, it&#39;s that <br/>\nthe conversations unschoolers have about children and respect allow those who <br/>\ndid have crappy childhoods to talk about them and encourage others and <br/>\nthemselves to consider how not to mess up their childrens lives without thought.<br/>\n<br/>\nDeborah in IL<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Family History","postDate":"1084821452","msgId":94205,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1YS4zNTNkYmQ4OC4yZGRhNjljY0Bhb2wuY29tPg=="},"prevInTopic":94198,"nextInTopic":94207,"prevInTime":94204,"nextInTime":94206,"topicId":94163,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/17/04 11:20:54 AM, jrossedd@aol.com writes: ","messageBody":"<div id=\"ygrps-yiv-1431834368\">In a message dated 5/17/04 11:20:54 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jrossedd@...\">jrossedd@...</a> writes:<br/>\n<br/>\n&lt;&lt; Here is the Power of Story I see in this. By the teen years, being <br/>\nspanked and smacked becomes something its victims must either internalize and <br/>\ndefend, or break from their family&#39;s teachings to reject (two really poor <br/>\nlife <br/>\nchoices for a young teen, imo). &gt;&gt;<br/>\n<br/>\nWhen I was a teenager and in college, I defended my mom&#39;s spanking of my baby <br/>\nbrother, figuring that he wouldn&#39;t remember and so she could train him so <br/>\nthat when he was older she would never need to spank him.<br/>\n<br/>\nIt didn&#39;t take too long for me to change my mind, but I remember I defended <br/>\nthat position IN WRITING, in a journal for a professor to read, and I have it <br/>\nsomewhere.  And the professor didn&#39;t say &quot;Are you nuts?&quot; to me.  Maybe <br/>\nshould&#39;ve. &lt;g&gt;<br/>\n<br/>\nI&#39;m glad I got over defending my mom.  But even then I could tell it was a <br/>\njustification or a soothing of my own life.  I was explaining why MY life was as <br/>\nit was, and I wasn&#39;t prepared mentally or emotionally to start deconstructing <br/>\nit to look carefully.    Some people never want to be.   Or maybe they don&#39;t <br/>\nhave that intrapersonal thing Gardner talks about and so no interest, no <br/>\nwish/ability (wishability! &lt;g&gt;)<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":7143857,"authorName":"jrossedd@aol.com","from":"jrossedd@...","profile":"jrossedd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Family History","postDate":"1084814254","msgId":94198,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRiLmFjODc1OGQuMmRkYTRkYWVAYW9sLmNvbT4="},"prevInTopic":94189,"nextInTopic":94205,"prevInTime":94197,"nextInTime":94199,"topicId":94163,"numMessagesInTopic":0,"msgSnippet":"They never realized that there was anything wrong with it when it was done to them, so they continue the behavior because that s what they think is normal. ","messageBody":"<div id=\"ygrps-yiv-293044778\">They never realized that there was anything wrong with it when it was done to <br/>\n<br/>\nthem, so they continue the behavior because that&#39;s what they think is normal. <br/>\n<br/>\n&lt;&lt;&lt;&lt;<br/>\n<br/>\n<br/>\nRight. &quot;And *I* turned out just fine&quot; seems to be the mantra.<br/>\n<br/>\n<br/>\n*****************<br/>\n<br/>\n       DD14 just told me about a conversation along these lines.<br/>\n<br/>\n       She performed in a recital/musical theatre revue on Saturday. It <br/>\ninvolved all ages, but her own peer group within the &quot;company&quot; is six or seven <br/>\ngirls and a couple of boys, age 13-16 or so. (A couple are homeschooled, none is <br/>\nunschooled except DD, but a few others do have thoughtful, mindful parents.) <br/>\nThey&#39;d been together in the theatre almost around the clock, what with dress <br/>\nrehearsal and an earlier show that day, and they were cooling their heels in the <br/>\nwings in costume, before the first number of the second show. <br/>\n<br/>\n       As DD tells it, someone mentioned what a brat one of the youngest <br/>\ndancers was, what a pain, why didn&#39;t her parents make her behave better, be <br/>\nquieter and less of a prima donna.  DD helps work with the younger ones and knows <br/>\nthem pretty well, so she said oh, no, really they&#39;re all great kids. <br/>\n<br/>\n       Several of the others turned on her and said not this one, this one <br/>\nneeds lots more discipline, her parents spank her but apparently not hard enough <br/>\nor often enough (shocking the few who it seems, like DD, had never been <br/>\nspanked or slapped or even given a &quot;time-out.&quot;.) <br/>\n<br/>\n       One of these girls suggested maybe all the spanking and swatting could <br/>\nbe part of the problem rather than the answer, to a chorus of angry denial <br/>\nfrom those who grew up being hit by their parents. They started telling stories <br/>\nto show being spanked was necessary to being raised right, saying &quot;DUH - <br/>\nthat&#39;s why they call it *discipline*!&quot; and that it had made them moral and <br/>\nwell-behaved -- if ganging up to make mean remarks about some smaller child in your <br/>\ncircle can be considered moral or well-behaved &lt;grrr&gt;<br/>\n<br/>\n       What was really interesting though, and the reason I bring it up now, <br/>\nis that DD said she realized at that point there was nothing to say. At least <br/>\nthere was nothing anyone who&#39;d never been hit or punished could say. Her few <br/>\ngently parented peers there just seemed to sense that anything they said would <br/>\nsound like a put-down of someone else&#39;s parents. And that it wouldn&#39;t help <br/>\nanybody, anyway.<br/>\n<br/>\n       Here is the Power of Story I see in this. By the teen years, being <br/>\nspanked and smacked becomes something its victims must either internalize and <br/>\ndefend, or break from their family&#39;s teachings to reject (two really poor life <br/>\nchoices for a young teen, imo). But NOT being smacked and spanked seems by the <br/>\nteen years to foster a natural, internal kind of moral, well-behaved <br/>\nsensitivity (one that even the girls themselves weren&#39;t conscious of). <br/>\n<br/>\n       These lovely, thoughtful, beautifully mannered, compassionate and <br/>\nhappy girls were just sad and felt sorry about what others had been taught to <br/>\nbelieve, and so today I&#39;m thinking of this as one of the first world windows <br/>\nthrough which DD and her similarly parented peers are seeing for themselves the <br/>\nlogical results of how humans treat each other --  and DD and I both are <br/>\ndespairing  of how to ever share this with those who&#39;ve had other sensibilities beaten <br/>\ninto (or out of) them. JJ<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Family History","postDate":"1084807947","msgId":94186,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDExOC4zMmViZjNmMS4yZGRhMzUwYkBhb2wuY29tPg=="},"prevInTopic":94185,"nextInTopic":94188,"prevInTime":94185,"nextInTime":94187,"topicId":94163,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/17/04 5:50:27 AM, sheran@ptd.net writes: ","messageBody":"<div id=\"ygrps-yiv-2145496114\">In a message dated 5/17/04 5:50:27 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sheran@...\">sheran@...</a> writes:<br/>\n<br/>\n&lt;&lt; I think one difference is that on this list, people tend to recognize <br/>\n<br/>\nwhat the not so good parts about their childhoods were, realize that <br/>\n<br/>\nthey weren&#39;t right or normal, and determine to not pass them on to <br/>\n<br/>\ntheir kids.  &gt;&gt;<br/>\n<br/>\nGood point.<br/>\n<br/>\nThere are people in ear shot of our house who were raised badly and are <br/>\npassing it right along, phrases verbatim, hateful screaming and shaming that the <br/>\nneighbors can hear.  Our house is trying to NOT pass on those same kinds of <br/>\nbehaviors.<br/>\n<br/>\nAt Keith&#39;s house it was all very quiet.  His mother&#39;s meanness was more <br/>\nlikely to be silence or a snort than a phrase.  Similarly cruel, just not as <br/>\nquotable.  A more high-class, civilized kind of put-down.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Family History","postDate":"1084807647","msgId":94185,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdkLjRlM2NmMDEwLjJkZGEzM2RmQGFvbC5jb20+"},"prevInTopic":94183,"nextInTopic":94186,"prevInTime":94184,"nextInTime":94186,"topicId":94163,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/16/04 11:11:10 PM, jnjstau@gvtc.com writes: ","messageBody":"<div id=\"ygrps-yiv-653988374\">In a message dated 5/16/04 11:11:10 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jnjstau@...\">jnjstau@...</a> writes:<br/>\n<br/>\n&lt;&lt; All this talk about parents demeaning their children makes me wonder if <br/>\nmany people move to unschooling and respectful parenting as a reaction against <br/>\nabuses they received as a child. &gt;&gt;<br/>\n<br/>\nI wanted to be a teacher and I did that, and from that I saw LOTS of familes, <br/>\nworse than mine.  I saw how a child who&#39;s had a REALLY crappy overnight at <br/>\nhome can&#39;t even think or stay awake or care.  Some people&#39;s parents are <br/>\ndull-eyed and evil.   My mom was just ignorant and thoughtless.<br/>\n<br/>\n-=-I wonder if a disproportionate number of unschoolers come from <br/>\ndysfunctional childhoods.-=-<br/>\n<br/>\nNot that I know of.  It seems the proporion of dysfunctional people is about <br/>\nnormal for the times. <br/>\n<br/>\n-=-The childhoods many people describe on this list are horrendous....I just <br/>\ncan&#39;t imagine the &quot;Miss Aster&quot; stuff....and I&#39;m very sad that anyone had to go <br/>\nthrough that.-=-<br/>\n<br/>\nOh no, that&#39;s not horrendous.   Horrendous is two alcoholic parents, not just <br/>\none.  Violence between parents, which I never had.  Incest or other sexual <br/>\nabuse, which I never had.  Being forced to lie to cover family crap, which I <br/>\nnever had.<br/>\n<br/>\n-=-But it seems much more common on this list than in real life....or at <br/>\nleast my real life.  Any thoughts?-=-<br/>\n<br/>\nI think it&#39;s much LESS common on this list than in real life.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":121772804,"authorName":"Kate Sitzman","from":"&quot;Kate Sitzman&quot; &lt;kate@...&gt;","profile":"kate_sitzman","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] Family History","postDate":"1084807558","msgId":94189,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwNTE3MTUyNy5pNEhGUkNHUjAwNjIxOEBwcm94eTEuYWRkci5jb20+","inReplyToHeader":"PDAwNjIwMWM0M2JjYSQzNDNjZjgyMCRmMmJkYjFkOEB5b3VybzBrd2t3OWp3Yz4="},"prevInTopic":94188,"nextInTopic":94198,"prevInTime":94188,"nextInTime":94190,"topicId":94163,"numMessagesInTopic":0,"msgSnippet":"... dysfunctional childhoods.","messageBody":"<div id=\"ygrps-yiv-1569691794\"><blockquote><span title=\"ireply\">&gt;&gt;&quot;I wonder if a disproportionate number of unschoolers come from<br/>\n </span></blockquote>dysfunctional childhoods.&quot;&lt;&lt;<br/>\n<br/>\n<br/>\nI Don&#39;t think my childhood was dysfunctional, though it was fairly unusual.<br/>\nand I think it had a lot to do with what led me to unschooling. My mom<br/>\nworked in Education - teaching, college admissions, then school<br/>\nadministration. We moved a LOT when I was growing up so I had the<br/>\nopportunity to attend a lot of different kinds of schools - large, small,<br/>\npublic, private, even boarding school. I learned quickly that schools were<br/>\njust a game to be played and they just had different rules. I abandoned the<br/>\nmyth of the &#39;good school&#39;. I mastered the rules and even used them to skip 2<br/>\ngrades and graduate at 16 (I wanted OUT). I was also in the habit of missing<br/>\nabout 30 days of school every semester. My mom let me stay home almost any<br/>\ntime I wanted, and she would also pull me out to take me on business trips<br/>\nwith her whenever she could, because she felt I&#39;d get a lot more out of it<br/>\nthan the school was offering me. My mom would even have done my homework for<br/>\nme if I had let her (pretty funny for someone who later became a school<br/>\nprincipal). My mom would have been a perfect unschooling mom, but she never<br/>\nrealized it.  I was treated with a lot of respect and given a lot of freedom<br/>\nand responsibility. I think it was the taste of freedom and adventure I had<br/>\ngrowing up that lead me to seek it out more for my kids - I wanted them to<br/>\nhave the complete experience - that for me, was only hinted at.</div>","specialLinks":[]},{"userId":141316284,"authorName":"pam sorooshian","from":"pam sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Family History","postDate":"1084806941","msgId":94183,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBGN0JGQTMzLUE4MTUtMTFEOC05MTM4LTAwMEE5NUUyOTJDNkBtYWMuY29tPg==","inReplyToHeader":"PDAwMjAwMWM0M2MwZCRkOWNhMWYwMCQ2YjAyYThjMEAyMDAyZGVza3RvcD4=","referencesHeader":"PEJDQ0UwQkJDLjI2RjQwJWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0PiA8MDAyMDAxYzQzYzBkJGQ5Y2ExZjAwJDZiMDJhOGMwQDIwMDJkZXNrdG9wPg=="},"prevInTopic":94180,"nextInTopic":94185,"prevInTime":94182,"nextInTime":94184,"topicId":94163,"numMessagesInTopic":0,"msgSnippet":"... I think I liked it - I got excited every  year when summer vacation was over, anticipating the new school year. BUT - I can t really think clearly about","messageBody":"<div id=\"ygrps-yiv-20974331\">On May 17, 2004, at 5:52 AM, catherine aceto wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I had nice, functional parents, who never even said &quot;because I said <br/>\n&gt; so.&quot;<br/>\n<br/>\n&gt;  But I can&#39;t say that I liked school (even though I was *very* good at <br/>\n&gt; it).<br/>\n<br/>\n </span></blockquote>I think I liked it - I got excited every  year when summer vacation was <br/>\nover, anticipating the new school year. BUT - I can&#39;t really think <br/>\nclearly about it. We didn&#39;t have a choice. I never even considered the <br/>\npossibility of not going. I LOVED summer vacation and I loved weekends. <br/>\nI certainly do remember watching the clock and waiting for those last <br/>\nminutes of the day to click off and feeling like I was just exploding <br/>\ninto the freedom of &quot;after school.&quot; Every day! I never regretted the <br/>\nschool day ending, that&#39;s for sure. So in spite of the fact that I <br/>\nremember thinking I liked school, I think I was simply a positive <br/>\noptimistic kind of kid who bloomed where she was planted.<br/>\n<br/>\n-pam<br/>\nNational Home Education Network<br/>\n&lt;www.NHEN.org&gt;<br/>\nServing the entire homeschooling community since 1999<br/>\nthrough information, networking and public relations.</div>","specialLinks":[]},{"userId":137100818,"authorName":"Jason & Stephanie","from":"&quot;Jason & Stephanie&quot; &lt;thesixofus@...&gt;","profile":"mom_to_kbcj","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Family History","postDate":"1084803532","msgId":94188,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMmMwMWM0M2MxOSRlMWFlYmEzMCQzMWI1YzNkMUBXYWxkcm9ucz4=","referencesHeader":"PDAwNjIwMWM0M2JjYSQzNDNjZjgyMCRmMmJkYjFkOEB5b3VybzBrd2t3OWp3Yz4="},"prevInTopic":94186,"nextInTopic":94189,"prevInTime":94187,"nextInTime":94189,"topicId":94163,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-969410222\">&lt;&lt;&lt;All this talk about parents demeaning their children makes me wonder if many people move to unschooling and respectful parenting as a reaction against abuses they received as a child.<br/>\n<br/>\n  I wonder if a disproportionate number of unschoolers come from dysfunctional childhoods.&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n  ****It is definitely a big reason why we chose this life. I grew up very angry and rebellious, broken home, step parents, verbal abuse and step father punched me and I ran away, lots of stuff. We chose to have me stay home and be here with the kids, we chose home ed before we had kids. We naturally followed a path to unschooling about 2 years ago. I just usually read and absorb on lots of these lists.<br/>\n  Stephanie in PA(first time posting)<br/>\n<br/>\n  mom to 4<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":135843572,"authorName":"24hrmom","from":"&quot;24hrmom&quot; &lt;24hrmom@...&gt;","profile":"learn2day2002","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Family History","postDate":"1084802659","msgId":94180,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMWUwMWM0M2MxNyRkOTQ0NjhiMCQwMjAwYThjMEBUaW5rZXJiZWxsPg==","referencesHeader":"PDAwNjIwMWM0M2JjYSQzNDNjZjgyMCRmMmJkYjFkOEB5b3VybzBrd2t3OWp3Yz4="},"prevInTopic":94178,"nextInTopic":94183,"prevInTime":94179,"nextInTime":94181,"topicId":94163,"numMessagesInTopic":0,"msgSnippet":" Not me either.  My childhood was pretty typical with school,","messageBody":"<div id=\"ygrps-yiv-1467853441\">&lt;&lt; I wonder if a disproportionate number of unschoolers come from<br/>\ndysfunctional childhoods. &gt;&gt;<br/>\n<br/>\nNot me either.  My childhood was pretty typical with school, bedtimes,<br/>\nfinish your plate, and do what you&#39;re told but no spanking (maybe one or two<br/>\nswats in frustration that I can remember).  I remember it happily with lots<br/>\nof summers spent swimming in our pool, quite a few family vacations, and<br/>\nbeing actively involved in dancing for all my childhood.  And I was<br/>\ndefinitely a &quot;good&quot; student.<br/>\n<br/>\nPam L</div>","specialLinks":[]},{"userId":73238415,"authorName":"J. Stauffer","from":"&quot;J. Stauffer&quot; &lt;jnjstau@...&gt;","profile":"jnjstau","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Family History","postDate":"1084802246","msgId":94178,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMGMwMWM0M2MxNiRlMzhhMzg1MCQwYWJkYjFkOEB5b3VybzBrd2t3OWp3Yz4=","referencesHeader":"PEJDQ0UwQkJDLjI2RjQwJWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":94175,"nextInTopic":94180,"prevInTime":94177,"nextInTime":94179,"topicId":94163,"numMessagesInTopic":0,"msgSnippet":" Now that s just weird.  I wasn t convenient for my parents.  I was basically an anarchist, following only my","messageBody":"<div id=\"ygrps-yiv-1810135999\">&lt;&lt;&lt;And I basically liked school too :-)&gt;&gt;&gt;&gt;<br/>\n<br/>\nNow that&#39;s just weird. &lt;grin&gt;<br/>\n<br/>\nI wasn&#39;t convenient for my parents.  I was basically an anarchist, following<br/>\nonly my own sense of right or wrong.  When I think back on it, I am amazed<br/>\nat their patience and wisdom.<br/>\n<br/>\nJulie S.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- <br/>\nFrom: &quot;Fetteroll&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a>&gt;<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>&gt;<br/>\nSent: Monday, May 17, 2004 5:27 AM<br/>\nSubject: Re: [UnschoolingDiscussion] Family History<br/>\n<br/>\n<br/>\n&gt; on 5/17/04 12:48 AM, J. Stauffer at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jnjstau@...\">jnjstau@...</a> wrote:<br/>\n&gt;<br/>\n&gt; &gt; All this talk about parents demeaning their children makes me wonder if<br/>\nmany<br/>\n&gt; &gt; people move to unschooling and respectful parenting as a reaction<br/>\nagainst<br/>\n&gt; &gt; abuses they received as a child.<br/>\n&gt;<br/>\n&gt; Not me. I had nice parents. I don&#39;t remember anything traumatizing or even<br/>\n&gt; disturbing. Obviously I must have been thwarted at times but nothing that<br/>\n&gt; sticks out in my memory. I was a &quot;good&quot; kid (read convenient for parents<br/>\n;-)<br/>\n&gt; so there wasn&#39;t much need for us to clash.<br/>\n&gt;<br/>\n&gt; And I basically liked school too :-)<br/>\n&gt;<br/>\n&gt; Joyce<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &quot;List Posting Policies&quot; are provided in the files area of this group.<br/>\n&gt;<br/>\n&gt; Visit the Unschooling website and message boards:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Family History","postDate":"1084800370","msgId":94175,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE2Mi4yZmEyNzY5Zi4yZGRhMTc3MkBhb2wuY29tPg=="},"prevInTopic":94171,"nextInTopic":94178,"prevInTime":94174,"nextInTime":94176,"topicId":94163,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/17/2004 7:50:34 AM Eastern Daylight Time, sheran@ptd.net writes: They never realized that there was anything wrong with it when it was","messageBody":"<div id=\"ygrps-yiv-801797952\">In a message dated 5/17/2004 7:50:34 AM Eastern Daylight Time, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sheran@...\">sheran@...</a> <br/>\nwrites:<br/>\nThey never realized that there was anything wrong with it when it was done to <br/>\nthem, so they continue the behavior because that&#39;s what they think is normal. <br/>\n &lt;&lt;&lt;&lt;<br/>\n<br/>\n<br/>\nRight. &quot;And *I* turned out just fine&quot; seems to be the mantra.<br/>\n<br/>\nBen and hear it from our siblings all the time.....well, when we talk of <br/>\nthese things any more....which is never.<br/>\n<br/>\n~Kelly<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":149995806,"authorName":"catherine aceto","from":"&quot;catherine aceto&quot; &lt;aceto3@...&gt;","profile":"cat4cat15217","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Family History","postDate":"1084798365","msgId":94171,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMjAwMWM0M2MwZCRkOWNhMWYwMCQ2YjAyYThjMEAyMDAyZGVza3RvcD4=","referencesHeader":"PEJDQ0UwQkJDLjI2RjQwJWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":94169,"nextInTopic":94175,"prevInTime":94170,"nextInTime":94172,"topicId":94163,"numMessagesInTopic":0,"msgSnippet":"I had nice, functional parents, who never even said because I said so.   But I can t say that I liked school (even though I was *very* good at it). -Cat ","messageBody":"<div id=\"ygrps-yiv-125405354\">I had nice, functional parents, who never even said &quot;because I said so.&quot;   But I can&#39;t say that I liked school (even though I was *very* good at it).  <br/>\n <br/>\n-Cat  <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1352017,"authorName":"kayb85","from":"&quot;kayb85&quot; &lt;sheran@...&gt;","profile":"kayb85","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Family History","postDate":"1084792568","msgId":94169,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM4YTZ0bysycGx2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwNjIwMWM0M2JjYSQzNDNjZjgyMCRmMmJkYjFkOEB5b3VybzBrd2t3OWp3Yz4="},"prevInTopic":94167,"nextInTopic":94171,"prevInTime":94168,"nextInTime":94170,"topicId":94163,"numMessagesInTopic":0,"msgSnippet":"... wonder if many people move to unschooling and respectful parenting as a reaction against abuses they received as a child. I ve been realizing that there","messageBody":"<div id=\"ygrps-yiv-570495760\"><blockquote><span title=\"ireply\">&gt; All this talk about parents demeaning their children makes me <br/>\n </span></blockquote>wonder if many people move to unschooling and respectful parenting as <br/>\na reaction against abuses they received as a child.<br/>\n<br/>\nI&#39;ve been realizing that there are just a lot more people in this <br/>\nworld who came from dysfunctional or emotionally abusive families <br/>\nthan I ever would have imagined.  Not just on this list, but <br/>\neverywhere.  <br/>\n<br/>\nI think one difference is that on this list, people tend to recognize <br/>\nwhat the not so good parts about their childhoods were, realize that <br/>\nthey weren&#39;t right or normal, and determine to not pass them on to <br/>\ntheir kids.  Maybe the awareness comes from mindful parenting.  I&#39;m <br/>\nnot sure if you have to be more aware in order to get unschooling, or <br/>\nif being more aware leads you to unschooling.  A little of both <br/>\nmaybe.  I think it&#39;s really sad when people treat their children <br/>\npoorly just because that&#39;s what was done to them.  They never <br/>\nrealized that there was anything wrong with it when it was done to <br/>\nthem, so they continue the behavior because that&#39;s what they think is <br/>\nnormal.  <br/>\n<br/>\nSheila</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Family History","postDate":"1084789629","msgId":94167,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJDQ0UwQkJDLjI2RjQwJWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDAwNjIwMWM0M2JjYSQzNDNjZjgyMCRmMmJkYjFkOEB5b3VybzBrd2t3OWp3Yz4="},"prevInTopic":94165,"nextInTopic":94169,"prevInTime":94166,"nextInTime":94168,"topicId":94163,"numMessagesInTopic":0,"msgSnippet":"... Not me. I had nice parents. I don t remember anything traumatizing or even disturbing. Obviously I must have been thwarted at times but nothing that sticks","messageBody":"<div id=\"ygrps-yiv-1850424892\">on 5/17/04 12:48 AM, J. Stauffer at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jnjstau@...\">jnjstau@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; All this talk about parents demeaning their children makes me wonder if many<br/>\n&gt; people move to unschooling and respectful parenting as a reaction against<br/>\n&gt; abuses they received as a child.<br/>\n<br/>\n </span></blockquote>Not me. I had nice parents. I don&#39;t remember anything traumatizing or even<br/>\ndisturbing. Obviously I must have been thwarted at times but nothing that<br/>\nsticks out in my memory. I was a &quot;good&quot; kid (read convenient for parents ;-)<br/>\nso there wasn&#39;t much need for us to clash.<br/>\n<br/>\nAnd I basically liked school too :-)<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":161496537,"authorName":"Alyce","from":"&quot;Alyce&quot; &lt;Groups@...&gt;","profile":"alyce13j","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Family History","postDate":"1084771286","msgId":94165,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM4OWk0bSt1Z2RrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQ2QTJENDhGLUE3QzAtMTFEOC05MTM4LTAwMEE5NUUyOTJDNkBtYWMuY29tPg=="},"prevInTopic":94164,"nextInTopic":94167,"prevInTime":94164,"nextInTime":94166,"topicId":94163,"numMessagesInTopic":0,"msgSnippet":"... life....or at ... Interesting this would come up.  I m having the same discussion with my writer s group.  So might such and upbringing create unschoolers ","messageBody":"<div id=\"ygrps-yiv-2126595599\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, pam sorooshian <br/>\n&lt;pamsoroosh@m...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; But it seems much more common on this list than in real <br/>\n </span></blockquote>life....or at <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; least my real life.  Any thoughts?<br/>\n<br/>\n<br/>\n </span></blockquote>Interesting this would come up.  I&#39;m having the same discussion with <br/>\nmy writer&#39;s group.  So might such and upbringing create unschoolers <br/>\nor might it breed writers or might it just be that there&#39;s a lot <br/>\nmore maltreatment across the board going on than any of us realize? <br/>\n<br/>\nMy experience growing up would qualify more under the horrifying <br/>\ncategory. :)  So I write (not just the cheesy articles, but dark <br/>\nfiction that as yet has been unpublished - I&#39;ve been ambivalent <br/>\nabout exposing that side of myself, frankly) and I unschool... and <br/>\ntry for all the world to make sure my kids know how worthwhile and <br/>\nwonderful they are.<br/>\n<br/>\nAlyce</div>","specialLinks":[]},{"userId":141316284,"authorName":"pam sorooshian","from":"pam sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Family History","postDate":"1084770526","msgId":94164,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ2QTJENDhGLUE3QzAtMTFEOC05MTM4LTAwMEE5NUUyOTJDNkBtYWMuY29tPg==","inReplyToHeader":"PDAwNjIwMWM0M2JjYSQzNDNjZjgyMCRmMmJkYjFkOEB5b3VybzBrd2t3OWp3Yz4=","referencesHeader":"PDAwNjIwMWM0M2JjYSQzNDNjZjgyMCRmMmJkYjFkOEB5b3VybzBrd2t3OWp3Yz4="},"prevInTopic":94163,"nextInTopic":94165,"prevInTime":94163,"nextInTime":94165,"topicId":94163,"numMessagesInTopic":0,"msgSnippet":"My parents were kind and would never have said such things to us. They also never spanked us and the worst punishment we ever got was being told to go into our","messageBody":"<div id=\"ygrps-yiv-1255033697\">My parents were kind and would never have said such things to us. They <br/>\nalso never spanked us and the worst punishment we ever got was being <br/>\ntold to go into our room until we calmed down.<br/>\n<br/>\nBut, thinking about the neighborhood where I grew up, I can very <br/>\nquickly name off a number of parents who said these kinds of things <br/>\nregularly to their kids. I was a very sensitive kid and I was sometimes <br/>\nin agony worrying they&#39;d say something mean directly to me. When Sandra <br/>\ntalks about her mother, I always picture our next-door neighbor who <br/>\nused all those same phrases on her kids. There was also a neighbor man <br/>\nwho had mounted a belt above a hall doorway and he&#39;d point to it and <br/>\neverybody in the family would go silent. It really creeped my sister <br/>\nand me out a lot. There were a number of other parents who seemed <br/>\n&quot;mean&quot; to me and my sisters. We were scared of quite a few of them.<br/>\n<br/>\n-pam<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On May 16, 2004, at 9:48 PM, J. Stauffer wrote:<br/>\n<br/>\n&gt; But it seems much more common on this list than in real life....or at <br/>\n&gt; least my real life.  Any thoughts?<br/>\nNational Home Education Network<br/>\n&lt;www.NHEN.org&gt;<br/>\nServing the entire homeschooling community since 1999<br/>\nthrough information, networking and public relations. </span></blockquote></div>","specialLinks":[]},{"userId":73238415,"authorName":"J. Stauffer","from":"&quot;J. Stauffer&quot; &lt;jnjstau@...&gt;","profile":"jnjstau","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Family History","postDate":"1084769310","msgId":94163,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNjIwMWM0M2JjYSQzNDNjZjgyMCRmMmJkYjFkOEB5b3VybzBrd2t3OWp3Yz4="},"prevInTopic":0,"nextInTopic":94164,"prevInTime":94162,"nextInTime":94164,"topicId":94163,"numMessagesInTopic":0,"msgSnippet":"All this talk about parents demeaning their children makes me wonder if many people move to unschooling and respectful parenting as a reaction against abuses","messageBody":"<div id=\"ygrps-yiv-1169489452\">All this talk about parents demeaning their children makes me wonder if many people move to unschooling and respectful parenting as a reaction against abuses they received as a child.<br/>\n<br/>\nI wonder if a disproportionate number of unschoolers come from dysfunctional childhoods.<br/>\n<br/>\nThe childhoods many people describe on this list are horrendous....I just can&#39;t imagine the &quot;Miss Aster&quot; stuff....and I&#39;m very sad that anyone had to go through that.<br/>\n<br/>\nBut it seems much more common on this list than in real life....or at least my real life.  Any thoughts?<br/>\n<br/>\nJulie S.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":93734,"nextTopicId":94310}}