{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":11,"messages":[{"userId":163750020,"authorName":"tuckervill2@aol.com","from":"tuckervill2@...","profile":"tuckervill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: The dreaded phone call was real.... update...","postDate":"1095817678","msgId":99748,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY3LjMzZjQ5YzZjLjJlODIzM2NlQGFvbC5jb20+"},"prevInTopic":99747,"nextInTopic":0,"prevInTime":99747,"nextInTime":99749,"topicId":99659,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/21/2004 8:27:21 PM Central Standard Time, crrbuddy@yahoo.com writes: Whoops!  Forgot about Arkansas -- home of one of the most ","messageBody":"<div id=\"ygrps-yiv-1849374033\">In a message dated 9/21/2004 8:27:21 PM Central Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:crrbuddy@...\">crrbuddy@...</a> writes:<br/>\n<br/>\nWhoops!  Forgot about Arkansas -- home of one of the most  <br/>\nridiculously restrictive homeschooling laws in the country, founded  <br/>\nunder the NEA-charged Clinton regime and nurtured to extremity by  <br/>\nHSLDA.  Guess things haven&#39;t improved since we were advised to go  <br/>\nunderground there by the state Christian homeschool group in the <br/>\nearly  90&#39;s. <br/>\n<br/>\n<br/>\n~~~<br/>\n <br/>\nThings are not as bad as they were then.  The testing no longer holds  any <br/>\nstrings (although that could change with the recent Judicial Audit Committee  <br/>\nreview of the homeschool law).  We do have to test yearly, now, from grades  <br/>\n3-9, but the testing is not as lengthy and only in reading and math.   Parents <br/>\nare no longer required to have a high school diploma.  There&#39;s now  what I call <br/>\na &quot;pound of flesh&quot; provision, which prevents a parent from pulling  their kid <br/>\nout of school if they&#39;re under disciplinary action.  <br/>\n <br/>\nIt&#39;s still very easy to be undergound.<br/>\n <br/>\nUmbrella schools are still not a legal option, although out of state  <br/>\nboarding schools are.  (I&#39;m imagining an actual out of state boarding  school acting <br/>\nas a &quot;covering&quot; for those students who can afford to visit it once  in a <br/>\nwhile.)  I can&#39;t imagine a private school taking a &quot;homebound&quot; student  who wasn&#39;t <br/>\nactually homebound.  What good would that do for  socialization?  ;)<br/>\n <br/>\nKaren<br/>\n <br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":90027250,"authorName":"Penne & Buddies","from":"&quot;Penne & Buddies&quot; &lt;crrbuddy@...&gt;","profile":"crrbuddy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: The dreaded phone call was real.... update...","postDate":"1095789209","msgId":99747,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNpcHBxcCtsNmZsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDFlMC4yYjM3Yzc0MS4yZTgxNzVmZEBhb2wuY29tPg=="},"prevInTopic":99721,"nextInTopic":99748,"prevInTime":99746,"nextInTime":99748,"topicId":99659,"numMessagesInTopic":0,"msgSnippet":"... be ... written ... but ... requirements ... Arkansas. ... Whoops!  Forgot about Arkansas -- home of one of the most ridiculously restrictive homeschooling","messageBody":"<div id=\"ygrps-yiv-1212996228\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, tuckervill2@a... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; In a message dated 9/20/2004 6:00:14 PM Central Standard Time,  <br/>\n&gt; crrbuddy@y... writes:<br/>\n&gt; <br/>\n&gt; AFAIK,  in every state there is a provision in which parents must <br/>\n </span></blockquote>be <br/>\n<blockquote><span title=\"ireply\"> &gt; legally  informed of a violation in the homeschooling law by <br/>\n </span></blockquote>written <br/>\n<blockquote><span title=\"ireply\"> &gt; notice from  the school district (NOT the social workers) and you <br/>\n&gt; have at least two  weeks to comply.  <br/>\n&gt; ~~~<br/>\n&gt; There is no such provision in the law in Arkansas.  <br/>\n&gt; ~~~<br/>\n&gt; <br/>\n&gt; There  are umbrella groups for <br/>\n&gt; unschoolers everywhere -- they range from token  fees to pricey, <br/>\n </span></blockquote>but <br/>\n<blockquote><span title=\"ireply\"> &gt; they are legal and will show you how to meet the legal  <br/>\n </span></blockquote>requirements <br/>\n<blockquote><span title=\"ireply\"> &gt; easily.  Look for specific info at  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.homeedmag.com/\">http://www.homeedmag.com/</a><br/>\n&gt; <br/>\n&gt; <br/>\n&gt; ~~~<br/>\n&gt;  <br/>\n&gt; They&#39;re not legal for meeting the notification requirements in  <br/>\n </span></blockquote>Arkansas.<br/>\n<blockquote><span title=\"ireply\"> &gt;  <br/>\n&gt; Karen<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Whoops!  Forgot about Arkansas -- home of one of the most <br/>\nridiculously restrictive homeschooling laws in the country, founded <br/>\nunder the NEA-charged Clinton regime and nurtured to extremity by <br/>\nHSLDA.  Guess things haven&#39;t improved since we were advised to go <br/>\nunderground there by the state Christian homeschool group in the <br/>\nearly 90&#39;s.  They instructed us unschooling types who objected to <br/>\nmandatory teach-to-the-testing to take advantage of the &quot;private <br/>\nschool&quot; loophole which existed at the time.  &quot;Private school&quot; had <br/>\nthus far been defined as to what it is NOT (single homeschooling <br/>\nfamily,) but not yet what it IS as long as the next WANNABE case had <br/>\nnot been brought up for review by the courts.  This brilliant <br/>\nstrategy also worked to keep all the dissenters out of touch with <br/>\neach other when HSLDA swooped in to &quot;help&quot; the lay people out with <br/>\nall that complicated legal stuff.  <br/>\n<br/>\nWe found out a year or so later that the local affiliated group had <br/>\na little discussion about our family, and the general consensus was <br/>\nthat their role should be one of &quot;support&quot; rather than throwing <br/>\ntheir fellow homeschoolers to the wolves.  I informed the thoughtful <br/>\nperson that warned me about this potential threat that I was <br/>\nfollowing the advice of their own state leaders in continuing to <br/>\nfollow the program we had established under Mississippi law <br/>\n(modified Moore Associate program) before relocation.  <br/>\n<br/>\nAt the time of the move, I naively thought that all homeschooling <br/>\nlaws were as free and open as ours were in MS -- live and learn a <br/>\nlittle too late...  CPS didn&#39;t come aknockin&#39; at the door (or <br/>\nrather, campus) till years later -- ironically, during a summer <br/>\nvacation trip while touring my dad&#39;s alma mater in northern MS.  <br/>\nAnother word to the wise, don&#39;t go camping with a large family away <br/>\nfrom home(!)  Strangers might get the idea that you&#39;re homeless and <br/>\nunemployed, and question your homeschooling plan even when school&#39;s <br/>\nout!  <br/>\n<br/>\nWhether it&#39;s Arkansas or any other state, where there&#39;s a sincere <br/>\nwill to unschool freely, there&#39;s always a way!  Find a homeschool-<br/>\nfriendly private school and enroll as a homebound student, if need <br/>\nbe.  I don&#39;t remember all the specifics of the law in Arkansas, but <br/>\nI was sure that even they had a written notification provision to <br/>\nallow parents time to comply before siccing the dogs on them.  I&#39;m <br/>\nnot the least surprised to hear there is none, as the last time I <br/>\nheard, the one inclusive support group that had formed to defend <br/>\nwhat was left of our right to direct our kids&#39; education (before <br/>\nHSLDA managed to remove them permanently) was losing the battle <br/>\nthere.<br/>\n<br/>\nAnother tip on dealing with (in)Human Services:  Always answer the <br/>\ndoor and telephone immediately if you can, even if it&#39;s to make more <br/>\nanother apology for not being able to discuss legal matters without <br/>\nyour attorney (even if you haven&#39;t one, yet) per his explicit <br/>\ninstructions.  That made all the difference in the world with the <br/>\nsocial worker who took up the case when it was transferred back <br/>\nhome.  <br/>\n<br/>\nThis fella got upset when he got the answering machine the first <br/>\ncouple of times, and told me he suspected I was trying to avoid him <br/>\nor screening my calls (which I was,) even when I called him right <br/>\nback.  I politely explained that I took my homeschooling <br/>\nresponsibilities seriously (and I really do-just not in the <br/>\nconventional sense,) and had always discouraged people from dropping <br/>\nin on us unannounced, as well as relying on the answering machine to <br/>\navoid unwelcome interruptions to our day (solicitors and social <br/>\nworkers being the main culprits for the time being.)  <br/>\n<br/>\nNevertheless, I made sure he never felt rejected or neglected <br/>\nagain.  The last time he popped in for a random visit, I was in a <br/>\nmerry mood as we were in the midst of party preparations for DH&#39;s <br/>\nfortieth birthday.  It was a messy scene (which prompted a <br/>\nhalfhearted reprimand) with craft projects abounding, but he <br/>\ncouldn&#39;t help but catch our enthusiasm.  Even used our family in the <br/>\nfinal interview as an example of one who never belonged on their <br/>\ncasebooks when introducing us to a new trainee.<br/>\n<br/>\nA word on obtaining legal advice, the guy who runs MASS Outrage<br/>\n(.com) has some excellent information on selecting the right one -- <br/>\nand thankfully, his website is up&running again.  Our attorney was <br/>\nan integral part of the good ole boy network, having married into a <br/>\nwell-established family firm, and the social worker was in the <br/>\nminority and out of her league (even with her own counsel.)  Greg <br/>\nHession says to make sure you get someone who knows and despises CPS <br/>\nfor the corrupt agency it is.  <br/>\n<br/>\nGreg adamantly advises against signing any kind of &quot;case plan,&quot; <br/>\nstating that it is a trap which, thankfully, was never suggested to <br/>\nus!  The bottom line is don&#39;t fall for their bluffs and baldfaced <br/>\nlies or let &#39;em tell you what you can and cannot do -- get a second <br/>\n(third and fourth) opinion from a friendly, knowledgeable party as <br/>\nlong as you aren&#39;t backed into a corner (and don&#39;t get caught alone <br/>\nat home or lured into their office, if you can help it.  Again, they <br/>\nreally don&#39;t want any WITNESSES hanging around to mess up their <br/>\nplans.)  <br/>\n<br/>\nYou do have a right to legal counsel, even though they will do <br/>\neverything but deny that fact to get you to open up and spill your <br/>\nheart & soul to them.  I can&#39;t find National Outrage online anymore, <br/>\nbut their best advice is to SHUT UP!  Short, simple, and straight to <br/>\nthe heart of the matter.  Name, rank, and serial number (and I&#39;d <br/>\nkeep the latter to myself) is all that&#39;s required even when you&#39;re <br/>\nguilty until proven innocent.<br/>\n<br/>\nGodspeed ~ we&#39;re keeping the faith that you and your family will <br/>\nprevail!</div>","specialLinks":[]},{"userId":163750020,"authorName":"tuckervill2@aol.com","from":"tuckervill2@...","profile":"tuckervill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: The dreaded phone call was real.... update...","postDate":"1095769085","msgId":99721,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFlMC4yYjM3Yzc0MS4yZTgxNzVmZEBhb2wuY29tPg=="},"prevInTopic":99716,"nextInTopic":99747,"prevInTime":99720,"nextInTime":99722,"topicId":99659,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/20/2004 6:00:14 PM Central Standard Time, crrbuddy@yahoo.com writes: AFAIK,  in every state there is a provision in which parents must be ","messageBody":"<div id=\"ygrps-yiv-1090751937\">In a message dated 9/20/2004 6:00:14 PM Central Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:crrbuddy@...\">crrbuddy@...</a> writes:<br/>\n<br/>\nAFAIK,  in every state there is a provision in which parents must be <br/>\nlegally  informed of a violation in the homeschooling law by written <br/>\nnotice from  the school district (NOT the social workers) and you <br/>\nhave at least two  weeks to comply.  <br/>\n~~~<br/>\nThere is no such provision in the law in Arkansas.  <br/>\n~~~<br/>\n<br/>\nThere  are umbrella groups for <br/>\nunschoolers everywhere -- they range from token  fees to pricey, but <br/>\nthey are legal and will show you how to meet the legal  requirements <br/>\neasily.  Look for specific info at  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.homeedmag.com/\">http://www.homeedmag.com/</a><br/>\n<br/>\n<br/>\n~~~<br/>\n <br/>\nThey&#39;re not legal for meeting the notification requirements in  Arkansas.<br/>\n <br/>\nKaren<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":65261722,"authorName":"Elizabeth Roberts","from":"Elizabeth Roberts &lt;ladyeliza_r@...&gt;","profile":"ladyeliza_r","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: The dreaded phone call was real.... update...","postDate":"1095732696","msgId":99716,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwOTIxMDIxMTM2LjUxNzE4LnFtYWlsQHdlYjUxMTAxLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PGNpbmg1dStuYm4wQGVHcm91cHMuY29tPg=="},"prevInTopic":99710,"nextInTopic":99721,"prevInTime":99715,"nextInTime":99717,"topicId":99659,"numMessagesInTopic":0,"msgSnippet":"Having been there myself, I would second being very cautious about what you say and how it is said. Remind them that any reporting you must do by your state","messageBody":"<div id=\"ygrps-yiv-1466131407\">Having been there myself, I would second being very<br/>\ncautious about what you say and how it is said. Remind<br/>\nthem that any reporting you must do by your state laws<br/>\nis to the local school district superintendent and not<br/>\nto them. As long as the local school district is<br/>\nsatisfied with your children&#39;s educational progress<br/>\nthey don&#39;t have a leg to stand on. In my case, there<br/>\nwere many lies on the part of the school district and<br/>\nI am only now that we are out of the area able to<br/>\nprove it, although our case was dropped due to the<br/>\nmove. I did file complaints however and that has<br/>\nresulted in some of the personnel I was dealing with<br/>\nin the school system who are no longer either working<br/>\nfor the school or no longer working in the same<br/>\ncapacity. Sadly there is little recourse against DSS.<br/>\n<br/>\nIt is still very frustrating and I wish I&#39;d been<br/>\nstronger against both the school and DSS at the time<br/>\nthings were happening. I understand your fears. <br/>\n<br/>\nI will keep your family in my prayers that this is<br/>\nresolved easily! <br/>\n<br/>\nElizabeth<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n\t\t<br/>\n_______________________________<br/>\nDo you Yahoo!?<br/>\nDeclare Yourself - Register online to vote today!<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://vote.yahoo.com\">http://vote.yahoo.com</a></div>","specialLinks":[]},{"userId":90027250,"authorName":"Penne & Buddies","from":"&quot;Penne & Buddies&quot; &lt;crrbuddy@...&gt;","profile":"crrbuddy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: The dreaded phone call was real.... update...","postDate":"1095714814","msgId":99710,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNpbmg1dStuYm4wQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQxNEE0NEI2LjIwNzA3MDBAY2xhcy5uZXQ+"},"prevInTopic":99702,"nextInTopic":99716,"prevInTime":99709,"nextInTime":99711,"topicId":99659,"numMessagesInTopic":0,"msgSnippet":"AFAIK, in every state there is a provision in which parents must be legally informed of a violation in the homeschooling law by written notice from the school","messageBody":"<div id=\"ygrps-yiv-1434970643\">AFAIK, in every state there is a provision in which parents must be <br/>\nlegally informed of a violation in the homeschooling law by written <br/>\nnotice from the school district (NOT the social workers) and you <br/>\nhave at least two weeks to comply.  There are umbrella groups for <br/>\nunschoolers everywhere -- they range from token fees to pricey, but <br/>\nthey are legal and will show you how to meet the legal requirements <br/>\neasily.  Look for specific info at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.homeedmag.com/\">http://www.homeedmag.com/</a><br/>\n<br/>\nBest advice for dealing with DFS/CPS -- Make sure you have WITNESSES <br/>\nbefore you speak to them again -- good friends, family, neighbors -- <br/>\nfind at least one unbiased person (preferable two or more) you can <br/>\nsummon on short notice and have with you.  NEVER talk to them alone -<br/>\n- be friendly, be polite, be firm, and don&#39;t let them intimidate <br/>\nyou.  Just say that you would LOVE to speak with them, but your <br/>\nlawyer has advised you against speaking about this sort of thing <br/>\nwithout him present (make him the scapegoat and stand your ground as <br/>\nlong as there is no threat being made.*)  If you don&#39;t seem to have <br/>\na choice, a videocamera may tick them off, but it&#39;s better than <br/>\nnothing.  Check out the info at <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.familyrightsassociation.com\">http://www.familyrightsassociation.com</a><br/>\n<br/>\nAFRA also has a link to the controversial HSLDA on their HELP ME NOW <br/>\npage:<br/>\n*The Social Worker At Your Door: 10 Helpful Hints<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.hslda.org/docs/nche/000000/00000070.asp\">http://www.hslda.org/docs/nche/000000/00000070.asp</a><br/>\n<br/>\nTake this seriously, but don&#39;t let fear get the best of you.  Just <br/>\nunderstand the people you&#39;re dealing with -- they are not friendly, <br/>\nthat is an act.  They _will_ lie to you and about you -- they _will_ <br/>\ntry to be your &quot;friend&quot; and get you to be upfront and honest (after <br/>\nall, we have nothing to hide) and they _will_ use everything they <br/>\nhave against you -- twisted to suit their agenda.  Make sure they <br/>\nhave a piece of paper to back up every statement they make -- do NOT <br/>\ntake their word for it (my first mistake.)<br/>\n<br/>\nIf that sounds positively negative, it&#39;s because we were one of the <br/>\nones who escaped child protective (so-called) services with our <br/>\nfamily intact.  Since then, we have learned that this system is <br/>\ncorrupt (and has been for many, many years) in every single state <br/>\nAFAIK, and those of us who have had a close encounter with CPS are <br/>\njust now getting the courage to speak out!  If you haven&#39;t heard the <br/>\nhorror stories on the news, then you have been underground for <br/>\nawhile.  Take care and let us know if we can help in any way.<br/>\n<br/>\nKeep the Faith, Hope, and most of all, Love ~<br/>\nPenne & the Crew<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://connections.ardfamilyco-op.net/pdacard.jpg\">http://connections.ardfamilyco-op.net/pdacard.jpg</a><br/>\n<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, Julie Anderson <br/>\n&lt;anderclan@c...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Ok.. so today a DFS person and another lady from the county <br/>\n </span></blockquote>sheriffs <br/>\n<blockquote><span title=\"ireply\"> &gt; office came to my door.. I was tempted to let the dogs bark <br/>\n </span></blockquote>longer .. <br/>\n<blockquote><span title=\"ireply\"> &gt; but eventually I did go to the door. They identified themselves <br/>\n </span></blockquote>and <br/>\n<blockquote><span title=\"ireply\"> &gt; asked to come inside and ask a few  questions.. I said that the <br/>\n </span></blockquote>picnic <br/>\n<blockquote><span title=\"ireply\"> &gt; table would be fine.  They both got out their clipboards and began <br/>\n </span></blockquote>with <br/>\n<blockquote><span title=\"ireply\"> &gt; the questions..They told me that  I had been &#39;hot-lined&#39;. for <br/>\n&gt; educational neglect.. wanted to know the names, ages, of my kids <br/>\n </span></blockquote>and <br/>\n<blockquote><span title=\"ireply\"> &gt; what curriculum I used... how long I had been homeschooling..I <br/>\n </span></blockquote>told them <br/>\n<blockquote><span title=\"ireply\"> &gt; that we were homeschoolers and that should be enough.. that <br/>\n </span></blockquote>legally in <br/>\n<blockquote><span title=\"ireply\"> &gt; MO.. that is all DFS needs to know.  I&#39;m hoping I didn&#39;t say too <br/>\n </span></blockquote>much.. <br/>\n<blockquote><span title=\"ireply\"> &gt; they appeared to be friendly... wanted to look at my horses.. <br/>\n </span></blockquote>asked <br/>\n<blockquote><span title=\"ireply\"> &gt; questions about the farm and all.. wanted to just &#39;see&#39; my kids.. <br/>\n </span></blockquote>asked <br/>\n<blockquote><span title=\"ireply\"> &gt; if they could just come to the window.. I was so afraid.. shaking <br/>\n </span></blockquote>like a <br/>\n<blockquote><span title=\"ireply\"> &gt; leaf by the time they finally left.. still shaking.. as I remember <br/>\n </span></blockquote>and <br/>\n<blockquote><span title=\"ireply\"> &gt; type this... I asked them if this would be the end of it.. and the <br/>\n </span></blockquote>lady <br/>\n<blockquote><span title=\"ireply\"> &gt; said.. probably not. So that is a simiplified version of my <br/>\n </span></blockquote>day.. .. I <br/>\n<blockquote><span title=\"ireply\"> &gt; know I will be very busy this weekend.... &quot;getting my ducks in a <br/>\n&gt; row&quot;......waiting on the next phone call....<br/>\n&gt; Julie in MO..... ( oh, and thanks Karen.. for the tip on the Mo <br/>\n </span></blockquote>Logging <br/>\n<blockquote><span title=\"qreply\"> &gt; thing.. I downloaded it today) </span></blockquote></div>","specialLinks":[]},{"userId":1352017,"authorName":"kayb85","from":"&quot;kayb85&quot; &lt;sheran@...&gt;","profile":"kayb85","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: The dreaded phone call was real.... update...","postDate":"1095662654","msgId":99702,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNpbHU3dStub2tvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGNpZG41ayt0cTFxQGVHcm91cHMuY29tPg=="},"prevInTopic":99701,"nextInTopic":99710,"prevInTime":99701,"nextInTime":99703,"topicId":99659,"numMessagesInTopic":0,"msgSnippet":"Borrow test scores from other MO ... I don t think I would do that...It could backfire. Sheila","messageBody":"<div id=\"ygrps-yiv-567177710\">Borrow test scores from other MO <br/>\n<blockquote><span title=\"ireply\"> &gt; homeschooler, whiteout the names and re-copy.<br/>\n<br/>\n<br/>\n </span></blockquote>I don&#39;t think I would do that...It could backfire. <br/>\n<br/>\nSheila</div>","specialLinks":[]},{"userId":1352017,"authorName":"kayb85","from":"&quot;kayb85&quot; &lt;sheran@...&gt;","profile":"kayb85","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: The dreaded phone call was real.... update...","postDate":"1095662579","msgId":99701,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNpbHU1ais5NWt0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQxNEE0NEI2LjIwNzA3MDBAY2xhcy5uZXQ+"},"prevInTopic":99666,"nextInTopic":99702,"prevInTime":99700,"nextInTime":99702,"topicId":99659,"numMessagesInTopic":0,"msgSnippet":"((((((Julie))))))) A few things I learned from a friend who had child protective services called on her.  They can get a search warrant to come into your home.","messageBody":"<div id=\"ygrps-yiv-265011455\">((((((Julie)))))))<br/>\n<br/>\nA few things I learned from a friend who had child protective <br/>\nservices called on her.  They can get a search warrant to come into <br/>\nyour home.  Make sure kids&#39; bedrooms, kitchen, main living area is <br/>\ncleaned up. <br/>\n<br/>\nAnother thing you could do is take them to a doctor now, and have him <br/>\nwrite on paper that they are healthy and not abused in anyway.  I <br/>\nknow they are just saying &quot;educational neglect&quot; now, but it wouldn&#39;t <br/>\nhurt to have that done. <br/>\n<br/>\nSheila<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, Julie Anderson <br/>\n&lt;anderclan@c...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Ok.. so today a DFS person and another lady from the county <br/>\n </span></blockquote>sheriffs <br/>\n<blockquote><span title=\"ireply\"> &gt; office came to my door.. I was tempted to let the dogs bark <br/>\n </span></blockquote>longer .. <br/>\n<blockquote><span title=\"ireply\"> &gt; but eventually I did go to the door. They identified themselves and <br/>\n&gt; asked to come inside and ask a few  questions.. I said that the <br/>\n </span></blockquote>picnic <br/>\n<blockquote><span title=\"ireply\"> &gt; table would be fine.  They both got out their clipboards and began <br/>\n </span></blockquote>with <br/>\n<blockquote><span title=\"ireply\"> &gt; the questions..They told me that  I had been &#39;hot-lined&#39;. for <br/>\n&gt; educational neglect.. wanted to know the names, ages, of my kids <br/>\n </span></blockquote>and <br/>\n<blockquote><span title=\"ireply\"> &gt; what curriculum I used... how long I had been homeschooling..I told <br/>\n </span></blockquote>them <br/>\n<blockquote><span title=\"ireply\"> &gt; that we were homeschoolers and that should be enough.. that legally <br/>\n </span></blockquote>in <br/>\n<blockquote><span title=\"ireply\"> &gt; MO.. that is all DFS needs to know.  I&#39;m hoping I didn&#39;t say too <br/>\n </span></blockquote>much.. <br/>\n<blockquote><span title=\"ireply\"> &gt; they appeared to be friendly... wanted to look at my horses.. asked <br/>\n&gt; questions about the farm and all.. wanted to just &#39;see&#39; my kids.. <br/>\n </span></blockquote>asked <br/>\n<blockquote><span title=\"ireply\"> &gt; if they could just come to the window.. I was so afraid.. shaking <br/>\n </span></blockquote>like a <br/>\n<blockquote><span title=\"ireply\"> &gt; leaf by the time they finally left.. still shaking.. as I remember <br/>\n </span></blockquote>and <br/>\n<blockquote><span title=\"ireply\"> &gt; type this... I asked them if this would be the end of it.. and the <br/>\n </span></blockquote>lady <br/>\n<blockquote><span title=\"ireply\"> &gt; said.. probably not. So that is a simiplified version of my <br/>\n </span></blockquote>day.. .. I <br/>\n<blockquote><span title=\"ireply\"> &gt; know I will be very busy this weekend.... &quot;getting my ducks in a <br/>\n&gt; row&quot;......waiting on the next phone call....<br/>\n&gt; Julie in MO..... ( oh, and thanks Karen.. for the tip on the Mo <br/>\n </span></blockquote>Logging <br/>\n<blockquote><span title=\"qreply\"> &gt; thing.. I downloaded it today) </span></blockquote></div>","specialLinks":[]},{"userId":122454986,"authorName":"Sara","from":"&quot;Sara&quot; &lt;cheeps4u@...&gt;","profile":"cheeps4u","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: The dreaded phone call was real.... update...","postDate":"1095393268","msgId":99666,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNpZG41ayt0cTFxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQxNEE0NEI2LjIwNzA3MDBAY2xhcy5uZXQ+"},"prevInTopic":99663,"nextInTopic":99701,"prevInTime":99665,"nextInTime":99667,"topicId":99659,"numMessagesInTopic":0,"msgSnippet":"Julie Anderson  wrote: Ok.. so today a DFS person and another lady from the county sheriffs office came to my door.. I was tempted to let the","messageBody":"<div id=\"ygrps-yiv-1707688873\">Julie Anderson &lt;anderclan@c...&gt; wrote:<br/>\n&quot;Ok.. so today a DFS person and another lady from the county <br/>\nsheriffs office came to my door.. I was tempted to let the dogs bark <br/>\nlonger but eventually I did go to the door. They identified <br/>\nthemselves and asked to come inside and ask a few  questions.. I <br/>\nsaid that the picnic table would be fine.  They both got out their <br/>\nclipboards and began with the questions..They told me that  I had <br/>\nbeen &#39;hot-lined&#39;. for  educational neglect.. wanted to know the <br/>\nnames, ages, of my kids and what curriculum I used... how long I had <br/>\nbeen homeschooling...&quot;<br/>\n<br/>\n<br/>\nJulie...did they say who turned you in? Got any PO&#39;ed family or <br/>\nneighbors? Now that you&#39;ve had time to review, what did they focus <br/>\non? A certain child? I&#39;m glad you didn&#39;t let them in.<br/>\n<br/>\nI&#39;ll be sending the good vibes your way....just remember ,use <br/>\ndifferent color ink on attendence and put in a week of sick <br/>\ndays....everyone had a bout of real bad summer head colds, did you <br/>\nnot? Download some crappy schooly looking work sheets if you get <br/>\ntime and do some coloring....write spelling words ten times and make <br/>\nup sentences.....drag out any text looking reference and hang a <br/>\nbattered notebook in it. Borrow test scores from other MO <br/>\nhomeschooler, whiteout the names and re-copy.<br/>\n<br/>\nSome do-gooder had to have ratted you out. Sara</div>","specialLinks":[]},{"userId":2300774,"authorName":"Elizabeth Hill","from":"Elizabeth Hill &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] The dreaded phone call was real.... update...","postDate":"1095390200","msgId":99663,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxNEE1M0Y4LjQwMTA0MDNAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PDQxNEE0NEI2LjIwNzA3MDBAY2xhcy5uZXQ+","referencesHeader":"PDEwOTUzNjUyMjUuMTIwMS4zMjcwNi5tMkB5YWhvb2dyb3Vwcy5jb20+IDw0MTRBNDRCNi4yMDcwNzAwQGNsYXMubmV0Pg=="},"prevInTopic":99660,"nextInTopic":99666,"prevInTime":99662,"nextInTime":99664,"topicId":99659,"numMessagesInTopic":0,"msgSnippet":"**They both got out their clipboards and began with the questions..They told me that  I had been hot-lined . for educational neglect.. wanted to know the","messageBody":"<div id=\"ygrps-yiv-1026504919\">**They both got out their clipboards and began with<br/>\nthe questions..They told me that  I had been &#39;hot-lined&#39;. for<br/>\neducational neglect.. wanted to know the names, ages, of my kids and<br/>\nwhat curriculum I used...**<br/>\n<br/>\nOh, gosh.  Some states have dropped or set a low priority on <br/>\n&quot;educational neglect&quot; cases, but maybe MO is not one of them.<br/>\n<br/>\nAre you in touch with a homeschooling list or group in your state where <br/>\nyou can post your situation and get info about what else has been going <br/>\non locally?<br/>\n<br/>\nBest wishes,<br/>\nBetsy<br/>\n<br/>\nPS   I&#39;ve been reading a new biography of Ben Franklin, and for someone <br/>\nwho&#39;s education was essentially &quot;neglected&quot; as a kid, he grew up to be a <br/>\npretty competent guy. &lt;g&gt;</div>","specialLinks":[]},{"userId":192130945,"authorName":"Molly","from":"&quot;Molly&quot; &lt;mollymomm@...&gt;","profile":"mollymomm3","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: The dreaded phone call was real.... update...","postDate":"1095387618","msgId":99660,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNpZGhsMitqdXBnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQxNEE0NEI2LjIwNzA3MDBAY2xhcy5uZXQ+"},"prevInTopic":99659,"nextInTopic":99663,"prevInTime":99659,"nextInTime":99661,"topicId":99659,"numMessagesInTopic":0,"msgSnippet":"... sheriffs office came to my door.. Awww Julie, big hugs coming your way from a new-to-list lurker. We re in Texas where there are NO laws regarding hsing","messageBody":"<div id=\"ygrps-yiv-161150074\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, Julie Anderson <br/>\n&lt;anderclan@c...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Ok.. so today a DFS person and another lady from the county <br/>\n </span></blockquote>sheriffs office came to my door.. <br/>\n<br/>\nAwww Julie, big hugs coming your way from a new-to-list lurker.  <br/>\nWe&#39;re in Texas where there are NO laws regarding hsing and I had a <br/>\ntruant officer from the county knock on the door one afternoon last <br/>\nAugust.  He asked if I had any paperwork to &quot;prove&quot; we were <br/>\nhomeschooling and I told him there was none required.  We stood and <br/>\ntalked about who notified him(the school district) and a homeschooler <br/>\nin his own neighborhood.  Even though it was a positive visit I was <br/>\nVERY shaken and took days to get calm.  You can read about our <br/>\nexperiences with public school, CPS(from withdrawing our son from a <br/>\nps pre-k) and the local school district here... <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.geocities.com/mollymomm3/hsiscool.html\">http://www.geocities.com/mollymomm3/hsiscool.html</a><br/>\n<br/>\nHang in there, hopefully it will all blow over soon and you can get <br/>\nback to normal.  After my little run-in I made a BIG &quot;Proud <br/>\nHomeschooling Family&quot; sign on posterboard and put it in my son&#39;s <br/>\nwindow for all to see.  It made me feel better to display it.<br/>\n<br/>\nMolly</div>","specialLinks":[]},{"userId":943561,"authorName":"Julie Anderson","from":"Julie Anderson &lt;anderclan@...&gt;","profile":"julie6302001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"The dreaded phone call was real.... update...","postDate":"1095386294","msgId":99659,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxNEE0NEI2LjIwNzA3MDBAY2xhcy5uZXQ+","inReplyToHeader":"PDEwOTUzNjUyMjUuMTIwMS4zMjcwNi5tMkB5YWhvb2dyb3Vwcy5jb20+","referencesHeader":"PDEwOTUzNjUyMjUuMTIwMS4zMjcwNi5tMkB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":99660,"prevInTime":99658,"nextInTime":99660,"topicId":99659,"numMessagesInTopic":0,"msgSnippet":"Ok.. so today a DFS person and another lady from the county sheriffs office came to my door.. I was tempted to let the dogs bark longer .. but eventually I did","messageBody":"<div id=\"ygrps-yiv-312912525\">Ok.. so today a DFS person and another lady from the county sheriffs <br/>\noffice came to my door.. I was tempted to let the dogs bark longer .. <br/>\nbut eventually I did go to the door. They identified themselves and <br/>\nasked to come inside and ask a few  questions.. I said that the picnic <br/>\ntable would be fine.  They both got out their clipboards and began with <br/>\nthe questions..They told me that  I had been &#39;hot-lined&#39;. for <br/>\neducational neglect.. wanted to know the names, ages, of my kids and <br/>\nwhat curriculum I used... how long I had been homeschooling..I told them <br/>\nthat we were homeschoolers and that should be enough.. that legally in <br/>\nMO.. that is all DFS needs to know.  I&#39;m hoping I didn&#39;t say too much.. <br/>\nthey appeared to be friendly... wanted to look at my horses.. asked <br/>\nquestions about the farm and all.. wanted to just &#39;see&#39; my kids.. asked <br/>\nif they could just come to the window.. I was so afraid.. shaking like a <br/>\nleaf by the time they finally left.. still shaking.. as I remember and <br/>\ntype this... I asked them if this would be the end of it.. and the lady <br/>\nsaid.. probably not. So that is a simiplified version of my day.. .. I <br/>\nknow I will be very busy this weekend.... &quot;getting my ducks in a <br/>\nrow&quot;......waiting on the next phone call....<br/>\nJulie in MO..... ( oh, and thanks Karen.. for the tip on the Mo Logging <br/>\nthing.. I downloaded it today)</div>","specialLinks":[]}],"prevTopicId":99744,"nextTopicId":99210}}