{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Lynda","from":"&quot;Lynda&quot; &lt;lurine@...","replyTo":"LIST","senderId":"JF5gU15hfPQOCcgZfIW9E9ch-zKCrdm8bhrPqjwqFDFonZB2BoyrhpZ3hzO6__nUYFB8xPXb3r5TTO9HMD6ib7KtAQ","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Bad Shrinks, was Digest Number 311","postDate":"943562792","msgId":4858,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4zMTQuNDg1OC45NTkyNjk3NDRAZUdyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":4857,"nextInTime":4859,"topicId":4858,"numMessagesInTopic":0,"msgSnippet":"Kelly, I use to work at an acute psych rehab unit and this is NOT what you should expect NOR should you accept it!  Is this person a psychiatrist or a ","messageBody":"<div id=\"ygrps-yiv-1833315050\">Kelly, I use to work at an acute psych rehab unit and this is NOT what you<br/>\nshould expect NOR should you accept it!  Is this person a psychiatrist or a<br/>\npsychologist?  Her behavior was totally inappropriate and in fact, one part<br/>\ncould get her slapped by the medical association that is appropriate (be<br/>\nshe an &quot;rist&quot; or a &quot;gist&quot;).  To diagnose ADD/ADHD has absolutely nothing to<br/>\ndo with school.  It is now being recognized that children in school that<br/>\nare so readily given the label of ADD/ADHD are more than likely not.  To<br/>\ndiagnose ADD/ADHD takes a whole battery of tests which include among<br/>\nothers, sleep deprivation<br/>\n<br/>\nI am not sure I would trust her with my own care as she is obviously off in<br/>\nher own personal LaLa Land which has nothing to do with reality or<br/>\nprofessional ethics.  No professional shrink would make any recommendation<br/>\nbased on a short chat with you.  In fact, most shrinks want to see someone<br/>\nfor 3 to 6 months before they start making hard core decisions.<br/>\n<br/>\nThis broad is a flake and your reaction was appropriate.<br/>\n<br/>\nHave you read the book done by the Kaiser doc about diet for kids who might<br/>\nbe ADD/ADHD??  This is a definitive work and was done many years ago but is<br/>\nreally quite good.<br/>\n<br/>\nAlso, being so close to the situtation, you might be &quot;making mountains out<br/>\nof mole hills&quot; because you are afraid of what you might see.  I know I did<br/>\nthis when eldest son was diagnosed as ADHD and then second son was<br/>\ndiagnosed as ADD.  Poor third son felt like he was under a microscope as I<br/>\nexamined every little thing he did worrying about whether or not he was ADD<br/>\nor ADHD.  Both the kidlets who were diagnosed have only had to manage their<br/>\ndiets and do some education on their condition and know what they need to<br/>\ndo.  They have learned vocusing lessons and we did their rooms &quot;soft&quot; which<br/>\ngave them a place to desensitise and destress themselves.<br/>\n<br/>\nLynda, wishing you good luck in finding a real shrink.<br/>\n<br/>\n----------<br/>\nFrom: Kelly Thielen &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kellylyn@...\">kellylyn@...</a>&gt;<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; Hello,<br/>\n&gt; I am on digest mode of this list, and have not been active on the list<br/>\n&gt; either, for some time, due to time constraints.  I am writing now to ask<br/>\n&gt; for some much needed understanding and support(help?).<br/>\n&gt; <br/>\n&gt; Something happened yesterday, that made me realize my need for support,<br/>\n&gt; which will require a bit of background information, so here it is:<br/>\n&gt; <br/>\n&gt; What, if anything, should I do about this?  Is this sort of thing to be<br/>\n&gt; expected from a psychiatrist?  I am just so shocked.  Maybe I am living<br/>\n&gt; in a bubble and this is common discrimination.  Do the rest of you deal<br/>\n&gt; with this sort of nonsense?  If so, how do you deal with it?<br/>\n&gt; <br/>\n&gt; Thanks to all who read this whole thing, and thanks in advance to all<br/>\n&gt; who respond.  This has really upset me and I feel so alone right now.<br/>\n&gt; <br/>\n&gt; Kelly<br/>\n&gt; <br/>\n&gt; &gt; Message boards, timely articles, a free newsletter and more!<br/>\n&gt; Check it all out at: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> </span></blockquote></div>","specialLinks":[]}],"prevTopicId":4850,"nextTopicId":4861}}