{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"FUN (Billy & Nancy)","from":"&quot;FUN (Billy & Nancy)&quot; &lt;FUNLists@...","replyTo":"LIST","senderId":"pB7ZHWdxajixoHCKac-FCXdPRlKdb4EpYdxT-GLhnjT77O1YLtxGBpE1o6o54rIA5tXkUKw451ghLBynrcY7vMR3U3sr5NAOz54b3X77eCt_cA","spamInfo":{"isSpam":false,"reason":"0"},"subject":"hurricane Floyd, FUN Books","postDate":"937661246","msgId":3019,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4yMTEuMzAxOS45NTkyNjk3NDJAZUdyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":3018,"nextInTime":3020,"topicId":3019,"numMessagesInTopic":0,"msgSnippet":"We are just able to get back online having been without power since Floyd came through. Last week, we had a tremendous thunderstorm that fried our voice","messageBody":"<div id=\"ygrps-yiv-1660893357\">We are just able to get back online having been without power since Floyd<br/>\ncame through. Last week, we had a tremendous thunderstorm that fried our<br/>\nvoice mail/fax system. It was about 5 years old and it would cost 10 times<br/>\nas much as the original cost to replace it with something similar, so we<br/>\nopted to go with a regular answering machine and a fax machine as<br/>\nreplacements. Our computers were all fine since they each have battery<br/>\nbackup/surge protectors.<br/>\n<br/>\nThen Floyd came through and knocked out our power and knocked down three<br/>\npine trees (two were over 70 feet tall) in our backyard. One came close to<br/>\nour house! With no electricity, the sump pump stopped running, and with 10<br/>\ninches of rain coming down, we were hoping the power would come back soon.<br/>\nNo such luck. After about an hour, it was obvious the basement would flood.<br/>\nThe kids pitched in and worked like champs to move the most important books<br/>\nand papers to higher ground, but we soon had 5,000 gallons of water in the<br/>\nbasement (even in a crisis you can find time to learn about calculating<br/>\nvolume).<br/>\n<br/>\nI went out to a boating supply store and got a bilge pump (runs off 12<br/>\nvolts) and rigged it up to our car battery to start pumping out the<br/>\nbasement. It was rated at 750 gallons per hour, but having to take the water<br/>\nup 5 feet to a hose through the basement window dropped the rating to about<br/>\n400 gph. That meant it would take about 12 hours to pump out the basement.<br/>\nRadio reports indicated that power might be out until Tuesday! We had worked<br/>\ninto the early morning, and just as we were about to go to bed, the power<br/>\ncame back on! The regular sump pump soon got rid of the deepest water, and I<br/>\nused a shop vac to start getting rid of the rest. We were down to no<br/>\nstanding water and just saturated carpeting. We took time to put together a<br/>\ncouple of orders that we had promised would be shipped out that day, and<br/>\njust as we printed the last label, the power went out again. UPS requires<br/>\ncomputer generated labels, so we can&#39;t ship UPS orders without electricity.<br/>\n<br/>\nI was worried that after working so hard to get rid of the standing water<br/>\nthat the basement was going to flood again. I hooked my jury rigged bilge<br/>\npump up again and since it was no longer raining (it was actually pleasantly<br/>\ncool and sunny) the bilge pump was easily able to keep up with the water<br/>\ncoming into the sump well from the saturated ground. We were very happy to<br/>\nget up this morning and find that the power was back on. I&#39;m hoping it will<br/>\nstay on now!<br/>\n<br/>\nWe&#39;re sore from bailing water and hauling wet stuff out of the basement.<br/>\nI&#39;ll be making several trips to the dump this weekend. We also discovered<br/>\nthat unlike our old voice mail/fax system, the new setup did not retain<br/>\nmessages when the power went out. I&#39;ve since replaced the answering machine<br/>\nwith one that does.<br/>\n<br/>\n****<br/>\nIf anyone left an order on our answering machine in the last few days,<br/>\nplease call or e-mail us to confirm that we got it. If you called and didn&#39;t<br/>\nget through at all, please try again.<br/>\n*****<br/>\n<br/>\nWe will probably be too busy the next few days to check in with the list, so<br/>\nthat&#39;s why I&#39;m taking time now to post this long update (not to mention that<br/>\nit helps delay loading up the van for the first trip to the dump). We&#39;re<br/>\nconsidering this our trial run for a worst case scenario of any Y2K<br/>\nproblems!<br/>\n<br/>\nWe are safe and sound and hope all other list members were unaffected by<br/>\nFloyd.<br/>\n<br/>\nBilly<br/>\n<br/>\n&#92;/&#92;/&#92;/&#92;/&#92;/&#92;/&#92;/&#92;/&#92;/&#92;/&#92;/&#92;/&#92;/<br/>\nF.U.N. News - FUN Books<br/>\nVisit our web sites!<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.FUN-Books.com/\">http://www.FUN-Books.com/</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.org/\">http://www.unschooling.org/</a><br/>\nSubscribe to the FUN News on-line<br/>\nnewsletter. Send a message to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:FUNNews-subscribe@onelist.com\">FUNNews-subscribe@onelist.com</a><br/>\n&#92;/&#92;/&#92;/&#92;/&#92;/&#92;/&#92;/&#92;/&#92;/&#92;/&#92;/&#92;/&#92;/</div>","specialLinks":[]}],"prevTopicId":3008,"nextTopicId":3020}}