{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Susan and Theodore","from":"Susan and Theodore &lt;Stuff@...&gt;","replyTo":"LIST","senderId":"ej0nVv1XxmQSs8Bpx-DIJNd6lBhzKSkvnQQiIvvW_MxDJqMPLvtK8BnKfMk6RZRpfihr6g0bnhvlsGVoEL8ZWxEDsGNoBAW5Jqg7cI3y1Q","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Digest Number 706","postDate":"964927193","msgId":11616,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQuMi4yLjIwMDAwNzI5MjMxMzE5LjAwYTRmNjEwQG1haWwucHRkcHJvbG9nLm5ldD4=","inReplyToHeader":"PDk2NDg2MzY3Ni4yNDg5NEBlZ3JvdXBzLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":11615,"nextInTime":11617,"topicId":11616,"numMessagesInTopic":0,"msgSnippet":"... When my children are at their worst I find that I am too! I think the only solution for me and my family is to stop and reevaluate the situation (s) and","messageBody":"<div id=\"ygrps-yiv-546188004\">At 09:41 AM 7/29/00 +0000, you wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;HELP!<br/>\n&gt;<br/>\n&gt;My 7yo boy is rude and sassy all day long. When I ask him a question, he<br/>\n&gt;answers with, &quot;Duh!&quot; If I ask him to do something, he asks why, and when I<br/>\n&gt;explain, he argues with me. He pesters constantly to have friends over or to<br/>\n&gt;watch more TV. If I say no, he slams out of the room, pouts, yells, calls me<br/>\n&gt;mean, etc. When he wants a snack, he yells, &quot;MOM! I&#39;m HUNGRT! Get me<br/>\n&gt;something to eat!&quot; And when I object ot that he just doesn&#39;t answer or yells<br/>\n&gt;again. Sometimes I&#39;ll lightly rephrase his demand: &quot;Mom, can I have<br/>\n&gt;something to eat please?&quot; He ignores me. When I scold or admonish, he tells<br/>\n&gt;me to leave him alone or get out of his room. He is a total brat, in other<br/>\n&gt;words. Nothing seems to help.<br/>\n&gt;<br/>\n&gt;Meanwhile, my 3yo boy starts the day by calling me a &quot;dumb butt,&quot; and<br/>\n&gt;screams at me when I refuse him anything. He asks for food, then throws it<br/>\n&gt;down or ignores it, then screams at me when I dispose of it!<br/>\n&gt;<br/>\n&gt;On top of it all, the two of them bicker, fight, whine and chase each other<br/>\n&gt;around all day. It&#39;s better when we&#39;re out, or if they&#39;re settled in front<br/>\n&gt;of the TV, but we can&#39;t do either all day. There are lots of times when<br/>\n&gt;we&#39;re just home.<br/>\n&gt;<br/>\n&gt;I feel hurt and abused. I feel like a terrible mom. I don&#39;t know whether to<br/>\n&gt;get strict with them or just back off, but I have had some pretty drastic<br/>\n&gt;thoughts.<br/>\n&gt;<br/>\n&gt;Any suggestions or thoughts would be appreciated.<br/>\n<br/>\n </span></blockquote>When my children are at their worst I find that I am too!<br/>\nI think the only solution for me and my family is to stop and reevaluate <br/>\nthe situation (s) and then begin again<br/>\nI find that when I am trying to get the most done they want the most....so <br/>\nusually I get them to help in some way and then we have &quot;free&quot; time.<br/>\nWhen my kids are getting &quot;sassy&quot; I find the best solution is to not respond <br/>\nin anger.  I almost always find that it is influence from their <br/>\npeers.  After the sas I ALWAYS tell them that that type of behavior will <br/>\nnot be tolerated.  I then discuss the why hows etc of it and it usually <br/>\nends and if it begins again I tell them that I really do not appreciate <br/>\nthat behavior and if that is all they are gaining from their friendship <br/>\nwith so and so then maybe it is time to find a new friend.  (that is when I <br/>\nam at wits end and the behavior won&#39;t stop).....sometimes it takes weeks, I <br/>\nfind that my kids are basically on a two-week cycle.  They go into the test <br/>\nmom mode and see how much I will tolerate and eventually when they find <br/>\nthey can&#39;t get the attention that they need in this way (and sometimes all <br/>\nthey are asking for is some attention) they go back to our acceptable ways <br/>\nof life.<br/>\nHope that was understandable I kind of mushed alot of things together but <br/>\nmy time is so limited<br/>\nHave fun<br/>\nPOD</div>","specialLinks":[]}],"prevTopicId":11609,"nextTopicId":11584}}