{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":260299618,"authorName":"Grame Family","from":"Grame Family &lt;scatterville@...&gt;","profile":"poochieville","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: New Member and a Question","postDate":"1143123489","msgId":24788,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZGNzk3MkRCLTU3OEYtNDY1Ni04N0UyLUI0MzE0MjQwOTgzMUB0d2ludmFsbGV5Lm5ldD4=","inReplyToHeader":"PDExNDI5MDI3NDguNDYwLjY0NDM3Lm0xOEB5YWhvb2dyb3Vwcy5jb20+","referencesHeader":"PDExNDI5MDI3NDguNDYwLjY0NDM3Lm0xOEB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":24787,"nextInTime":24789,"topicId":24788,"numMessagesInTopic":0,"msgSnippet":"Hi!  I m not sure how much help I can be to you and your husband but when I read the below my gut reaction was why not?  Why does he have to work at a job he","messageBody":"<div id=\"ygrps-yiv-1486457216\">Hi!  I&#39;m not sure how much help I can be to you and your husband but  <br/>\nwhen I read the below my gut reaction was why not?  Why does he have  <br/>\nto work at a job he doesn&#39;t like to do?  Why does he keep doing it?   <br/>\nIf he doesn&#39;t like paying the bills then why cant he think of ways to  <br/>\neliminate them or at least conserve so they are not as high.<br/>\n<br/>\nI know I&#39;m not very good at thinking like the norm.  But why does a  <br/>\nchild need to stick anything out.  I love this with my own husband.   <br/>\nSometimes he says one of the kids should stick something out to, it&#39;s  <br/>\ningrained in our society.  With him it&#39;s about money.  I spent the  <br/>\nmoney for that &quot;class, sport etc&quot;  you should stick it out.  On the  <br/>\nother hand I always convince him there is more harm in sticking it  <br/>\nout then good.  The joy on my sons face when he is not made to  <br/>\ncontinue with something he knows in his mind and body is just not  <br/>\nfeeling right is wonderful!  What would the world be like if children  <br/>\nwere given the freedom to explore what feels right to them and then  <br/>\nto do what feels good.  Think of all those grumpy people in rush hour  <br/>\ntraffic who are unhappy and hate their jobs and lives for that matter  <br/>\nbut stick with it because that is all they have been taught?  Ok Rant  <br/>\nover.<br/>\n<br/>\nNow why can&#39;t Kianne come home since she is the one who wants to.   <br/>\nJust one child to start with.  It is possible to show your husband  <br/>\nthe joy in Kianne&#39;s face daily by having that freedom and if it is  <br/>\nthe two of you think of all the wonderful &quot;projects&quot; she could come  <br/>\nup with to do together. Ask her, what do you want to find out more  <br/>\nabout, what do you love to do?  Sit down with her, draft up a plan.  <br/>\nEx:  Oh you like knitting, lets take a class together, help her  <br/>\nexplore everything about it, how the needles are made, how to make  <br/>\nyour own, how to figure out the patterns with different yarn because  <br/>\nyou love that yarn (there&#39;s a math challenge for ya!@)  What animals  <br/>\ndo the yarn come from and I don&#39;t mean oh sheep. I mean what breeds  <br/>\nare best, how do your raise the sheep?  There is a life lesson.  I  <br/>\nknow several women who have followed their love of knitting and now  <br/>\nrun yarn stores, own their own flock of sheep and these skills were  <br/>\nnever taught in a classroom.  Have Kianne show the plan to dad and  <br/>\nsee what he thinks, maybe he can add things to it.  He may feel more  <br/>\ncomfortable knowing there is some type of plan not just that your  <br/>\ngoing to sit home all day and watch tv.  (Although, I believe sitting  <br/>\nat home all day watching tv can be great research too!)<br/>\n<br/>\n  It is totally possible that Holly seeing how fun and happy Kianne  <br/>\nis will follow suit and want to come home to.  Although with her you  <br/>\nmay need to try harder to find those opportunities for her to play  <br/>\nwith her friends on a almost daily basis and to find new friends who  <br/>\nshe can be social with during the day.  Some people just need to have  <br/>\nthat in their lives and that is something that needs to be respected  <br/>\nalso.<br/>\n<br/>\nI know you would like to bring them all home, and I am an all or  <br/>\nnothing kind of person so I totally relate to it, but sometimes going  <br/>\nslower is better for the other people (maybe your husband?) in our  <br/>\nlives.<br/>\n<br/>\nRaven<br/>\nMama to Tristan 8, Kess 6 and Wynn 3<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://scatterville.blogspot.com\">http://scatterville.blogspot.com</a><br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Mar 20, 2006, at 6:59 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a> wrote:<br/>\n<br/>\n&gt; My husband doesn&#39;t &quot;get&quot; or agree with unschooling at all. He is  <br/>\n&gt; saying right now to we need to make Kianne stick it out in school,  <br/>\n&gt; she can&#39;t just quit. You can&#39;t quit things just because you don&#39;t  <br/>\n&gt; like them. He went off on a rant saying &quot; I don&#39;t like having to  <br/>\n&gt; work, but I do it, I don&#39;t just quit; I don&#39;t like paying the  <br/>\n&gt; bills, but I can&#39;t just quit&quot; Good grief!!<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]}],"prevTopicId":24780,"nextTopicId":24790}}