{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Digest Number 4833 / waldorf","postDate":"1092068391","msgId":97554,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU0LjMwNWQxODljLjJlNDhmZTI3QGFvbC5jb20+"},"prevInTopic":97520,"nextInTopic":0,"prevInTime":97553,"nextInTime":97555,"topicId":97520,"numMessagesInTopic":0,"msgSnippet":"In a message dated 8/9/04 7:55:40 AM, leslie@fitnessmark.com writes: ","messageBody":"<div id=\"ygrps-yiv-1368616714\">In a message dated 8/9/04 7:55:40 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:leslie@...\">leslie@...</a> writes:<br/>\n<br/>\n&lt;&lt; o doubt about it, the soul becomes corrupted through using the French<br/>\n<br/>\nlanguage...It is also possible at the present time that the French will even<br/>\n<br/>\nruin their own blood, the very element which has kept their language going<br/>\n<br/>\nas a corpse. &gt;&gt;<br/>\n<br/>\nUh...<br/>\nYeah!<br/>\nBut now he&#39;s dead.<br/>\n<br/>\nSpeaking of which, it might be another thing they don&#39;t want to discuss, but <br/>\nare there anthropmorphististicists who think they know if or where Steiner has <br/>\nreincarnated himself?   That would be fun to know.<br/>\n<br/>\n-=-The American Indians died out, not because of European persecutions, but <br/>\nbecause<br/>\n<br/>\nthey were destined to succumb to those forces which hastened their<br/>\n<br/>\nextinction.-=-<br/>\n<br/>\nSome died out of bullet wounds and smallpox.<br/>\nNew Mexico has quite a few not at all dead, living where they lived 400 years <br/>\nago.<br/>\n<br/>\nMaybe in 1920 it looked like they were going to die out.  But they were <br/>\nsavages, after all, lower than the original level of humans in primevil times.  Not <br/>\ncool and civilized like Germans.<br/>\n<br/>\nI&#39;m surprised he still has a following.  The stuff that was quoted in <br/>\npositive ways seemed just as crazy and baseless (more baseless, when it had to do <br/>\nwith &quot;still evolving&quot; after birth, and looking less like your mom if you quit <br/>\nnursing at six months, and colors doing whateverall colors are supposed to do).   <br/>\nI&#39;m surprised there&#39;s a single Waldorf school, let alone thousands of them.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":189456166,"authorName":"Leslie Rice","from":"&quot;Leslie Rice&quot; &lt;leslie@...&gt;","profile":"fromthebeachhouse","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Digest Number 4833 / waldorf","postDate":"1092057201","msgId":97520,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMWMwMWM0N2UxMiRhNWU2ZTQ2MCQwNjAyYThjMEBhbGFuLmNvbT4=","referencesHeader":"PDEwOTE5OTEwNjUuMTQ4OC41ODEwNS5tMjJAeWFob29ncm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":97554,"prevInTime":97519,"nextInTime":97521,"topicId":97520,"numMessagesInTopic":0,"msgSnippet":"rudolf steiner was the founder of the waldorf schools and curriculum. The following is a collection of quotes that I came across when I looked into the waldorf","messageBody":"<div id=\"ygrps-yiv-1425938533\">rudolf steiner was the founder of the waldorf schools and curriculum. The<br/>\nfollowing is a collection of quotes that I came across when I looked into<br/>\nthe waldorf approach to education.  An eye opener to say the least!<br/>\n<br/>\nLeslie, who can never resist an opportunity to out the true purpose of the<br/>\nsteiner/waldorf movement.<br/>\n<br/>\n&quot;Today we study the true essence of human thought so we can train the child<br/>\nin the right kind of thinking&quot;<br/>\nrudolf steiner<br/>\n<br/>\n&quot;You see, when we really study science and history, we must conclude that if<br/>\npeople become increasingly strong, they will also become increasingly<br/>\nstupid. If the blonds and blue-eyed people die out, the human race will<br/>\nbecome increasingly dense if men do not arrive at a form of intelligence<br/>\nthat is independent of blondness. Blond hair actually bestows intelligence.<br/>\nIt is indeed true that the more the fair individuals die out the more will<br/>\nthe instinctive wisdom of humans vanish.&quot;    rudolf steiner<br/>\n<br/>\n&quot; Jewry as such has outlived itself for a long time. It does not have the<br/>\nright to exist in the modern life of nations. That it has survived,<br/>\nnevertheless is a mistake of world history, of which the consequences were<br/>\nbound to come.&quot;<br/>\nrudolf steiner<br/>\n<br/>\n * &quot;The girl L.K. in class 1...is one of those cases that are occurring more<br/>\nand more frequently where children are born and human forms exist which<br/>\nactually, with regard to the highest member the ego, are not human at all<br/>\nbut are inhabited by beings who do not belong to the human race...They are<br/>\nvery different from human beings where spiritual matters are concerned. For<br/>\ninstance they can never memorise sentences, only words. I do not like<br/>\nspeaking about these things, as there is considerable opposition about this.<br/>\nJust imagine what people would say if they heard that we are talking about<br/>\nhuman beings who are not human beings. Nevertheless these are facts.<br/>\nFurthermore, there would not be such a decline of culture if there were a<br/>\nstrong enough feeling for the fact that some people, the ones who are<br/>\nparticularly ruthless, are not human beings at all but demons in human form.<br/>\n&quot;But do not let us broadcast this. There is enough opposition already.<br/>\nThings like this give people a terrible shock. People were frightfully<br/>\nshocked when I had to say that a quite famous university professor with a<br/>\ngreat reputation had had a very short period between death and re-birth and<br/>\nwas a re-incarnated negro scientist.<br/>\n&quot;But don&quot;t let us publicise these things.&quot; (Steiner, 1923, CT-4 pp. 36-37)<br/>\n<br/>\n&quot;Whoever develops himself upwards, takes upon himself a tremendous<br/>\nresponsibility, that is the great tragedy; the corollary of every saint is<br/>\nthat a great number of beings are thrust down. There would be no development<br/>\nif this kind of thrusting down did not take place. A man must continually<br/>\nthrust others down, as he develops himself upwards. That is why all<br/>\ndevelopment which takes place out of self-interest is evil and<br/>\nreprehensible; it is only justifiable if done for the development of other<br/>\nbeings.&quot;     steiner [1905]<br/>\n<br/>\n<br/>\n&quot;We are within the great Root Race of humanity, which has peopled the earth,<br/>\nsince the land on which we now live rose up out of the inundations of the<br/>\nocean. Ever since the Atlantean Race began slowly to disappear, the great<br/>\nAryan Race has been the dominant one on earth. If we contemplate ourselves,<br/>\nwe here in Europe are thus the fifth Sub-Race of the great Aryan Root Race.<br/>\nThe first Sub-Race lived in the distant past in Ancient India&quot; steiner<br/>\n[1905]<br/>\n<br/>\nThough the Nazis banned Anthroposophy, this does not necessarily confer<br/>\nsainthood. The Thule Society, another source of Nazi mythology, was also<br/>\nbanned at the same time. These groups were suppressed as rivals, rather than<br/>\nopponents, of Nazism.....<br/>\n<br/>\n&quot;[W]hat the etheric body comprises derives from the maternal element, as<br/>\nhanded down from generation to generation, so that every man bears in his<br/>\nown etheric body the legacy of the maternal element, and in his physical<br/>\nbody, that of the paternal element. Now, by reason of consanguinity, the<br/>\ninheritance, perpetuating itself from etheric body to etheric body, was very<br/>\npotent, and from it derived the old faculty of clairvoyance. The offspring<br/>\nof endogamy inherited with the related blood the old capacity for wisdom in<br/>\nthe etheric body. But as blood became more and more mixed--as a result of<br/>\nincreasing intermarriage among tribes--the possibility of handing down the<br/>\nancient wisdom diminished; ...the mixing of different bloods obscured the<br/>\nancient wisdom more and more... We are, of course, still involved in this<br/>\nprocess of deterioration taking place in the human blood because, in as far<br/>\nas it has its origin in an ancient epoch, it will follow its lingering<br/>\ncourse to the end of *Earth* evolution.&quot; (Steiner, 1909, GSJ p. 226)<br/>\n<br/>\n<br/>\n<br/>\n&quot;The German spirit...is prepared for a truth that reveals itself to be true<br/>\nout of itself, not requiring external verification. The German spirit is<br/>\nprepared for this and evidence of this may be found everywhere. The thoughts<br/>\nof those who were truly working within the essence of the German spirit have<br/>\nalways taken the form of considering truth to be an inner gift of the human<br/>\nsoul.&quot; (Steiner, 1915, DIN p. 104)<br/>\n<br/>\n&quot;What has to come about for the civilization and culture of the future will<br/>\nonly come about if the German folk spirit finds souls that transplant the<br/>\nChrist impulse into their astral body and ego the way it can indeed be<br/>\nimplanted there in a state of full conscious awareness. It has to come about<br/>\nthrough harmony being established, by uniting with that which is consciously<br/>\nachieved in Central Europe--more and more consciously.<br/>\n&quot;This will need not just one or two centuries, but a very long time. The<br/>\ntime needed...I would say counting from the year 1400. Adding two thousand<br/>\nyears to 1400 we get the approximate time when something will emerge in the<br/>\nevolution of the earth that has had its seeds in the German life of the<br/>\nspirit...That is the intention of the cosmic intelligence...For the moment<br/>\nthe East is very far indeed from achieving this. The very best of them still<br/>\nfall far short. Short sightedly, they still refuse to accept what Central<br/>\nEuropean culture in particular is able to give.&quot; (Steiner, 1915, DIN p. 62)<br/>\n<br/>\n&quot;[The purpose of the Opium War] is not to help certain people make millions<br/>\nand grow rich but to prevent certain souls who would have come from the<br/>\nspiritual world round about now, to strengthen the cultural forces of<br/>\nEurope, from incarnating yet, and instead to surreptitiously fill European<br/>\nbodies with Chinese souls...In a great many European people a disharmony<br/>\nbetween soul and body has been brought about in the way I have just<br/>\ndescribed...Seen in this way, that Opium War meant the switching of a soul<br/>\nelement from a part of the earth to which it belonged--and where it might<br/>\nhave been of use, because it would have fitted--to another part of the earth<br/>\nwhere it could become a tool for forces whose designs are by no means<br/>\nnecessarily beneficial for mankind.&quot; (Steiner, 1916, KU1 p. 270)<br/>\n<br/>\n&quot;[T]he ancient Greeks dreamed of a uniform, perfect, beautiful type of human<br/>\nbeing that should have developed. This development did not occur because<br/>\nLucifer and Ahriman preserved older racial forms that had developed, so that<br/>\nthere was a coexistence of races rather than a succession.&quot; (Steiner, 1916,<br/>\nUH p. 76)<br/>\n<br/>\n&quot;[T]he representative people for the development of the consciousness soul,<br/>\nhence for what matters particularly in our age, is the Anglo-Saxon nation.<br/>\nThe Anglo-Saxon people are those who through their whole organization are<br/>\npredisposed to develop the consciousness soul to a special degree. The<br/>\nprominent position occupied by the Anglo-Saxon nation in our time is indeed<br/>\ndue to the fact that this nation is especially suited for the development of<br/>\nthe consciousness soul.&quot; (Steiner, 1921, MTA p. 195)<br/>\n<br/>\n&quot;No doubt about it, the soul becomes corrupted through using the French<br/>\nlanguage...It is also possible at the present time that the French will even<br/>\nruin their own blood, the very element which has kept their language going<br/>\nas a corpse. That is a terrible thing the French people are doing to other<br/>\npeople, the frightful cultural brutality of transplanting black people to<br/>\nEurope. It affects France itself worst of all. This has an incredibly strong<br/>\neffect on the blood, the race. This will substantially add to French<br/>\ndecadence. The French nation will be weakened as a race.&quot; (Steiner, 1923,<br/>\nCT-3 pp. 87-88)<br/>\n<br/>\n&quot;[W]e are not justified in thinking that human beings were originally like<br/>\nthe savages of today. The savages have developed into what they now<br/>\nare--with their superstitions, their magical practices and their unclean<br/>\nappearance--from states originally more perfect. The only superiority we<br/>\nhave over them is that, while starting from the same conditions, we did not<br/>\ndegenerate as they did. I might therefore say: The evolution of man has<br/>\ntaken two paths. It is not true that the savages of today represent the<br/>\noriginal condition of mankind. Mankind, though to begin with it looked more<br/>\nanimal-like, was highly civilized. ... Just as the present savages have<br/>\nfallen from the level of the human beings of primeval times, so the apes are<br/>\nbeings who have fallen still lower.&quot; (Steiner, 1924, EEM p. 126)<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.social-ecology.org/article.php?story=20031202113626595\">http://www.social-ecology.org/article.php?story=20031202113626595</a><br/>\n<br/>\n&quot;Jewry as such has long since outlived its time; it has no more<br/>\njustification within the modern life of peoples, and the fact that it<br/>\ncontinues to exist is a mistake of world history whose consequences are<br/>\nunavoidable. We do not mean the forms of the Jewish religion alone, but<br/>\nabove all the spirit of Jewry, the Jewish way of thinking.&quot; (steiner,<br/>\nGesammelte Aufsätze zur Literatur, GA 32, p. 152<br/>\n<br/>\nSteiner then insists that racially stratified hierarchy “is simply a<br/>\nuniversal law” and indeed a product of inescapable destiny: “The forces<br/>\nwhich determine man’s racial character follow this cosmic pattern. The<br/>\nAmerican Indians died out, not because of European persecutions, but because<br/>\nthey were destined to succumb to those forces which hastened their<br/>\nextinction.” (ibid. p. 76</div>","specialLinks":[]}],"prevTopicId":97530,"nextTopicId":97505}}