{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":99826381,"authorName":"Mary Bianco","from":"&quot;Mary Bianco&quot; &lt;mummyone24@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"newbie introduction","postDate":"1030927480","msgId":42656,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYyMTlMRGlLQnN1WjJLNHhEaDkwMDAwMDMwYUBob3RtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":42655,"nextInTime":42657,"topicId":42656,"numMessagesInTopic":0,"msgSnippet":"Hi all, I know one is suppose to wait a while before an intro but I figured with the topics going on now, this was a perfect time. My name is Mary and for the","messageBody":"<div id=\"ygrps-yiv-118379451\">Hi all,<br/>\n<br/>\nI know one is suppose to wait a while before an intro but I figured with the <br/>\ntopics going on now, this was a perfect time.<br/>\n<br/>\nMy name is Mary and for the sake of not getting confused, I&#39;ll go by Mary B <br/>\nas I have seen at least one other Mary.<br/>\n<br/>\nI&#39;m a mom to 4 kids. Our oldest at 16 attends a private school and has no <br/>\ninterest in homeschooling and at this time would probably be better staying <br/>\nin there. She does quite well in the system and we just keep saying, only 2 <br/>\nmore years when it really gets to us!!!<br/>\n<br/>\nNext is our son who is 7, a daughter at 6 and another daughter at almost 2. <br/>\nMy husband and I have known we would homeschool since our son was 2. That&#39;s <br/>\nwhen we joined the local support group and I found a great mentor who was a <br/>\ntotal unschooler raising 2 older children. I was hooked and never looked <br/>\nback. By the standards of my local group, we&#39;re quite radical in unschooling <br/>\nbut it works so very well for us all. My husband is totally supportive and <br/>\nnever questions my decisions. He knows how very thoroughly I look into <br/>\nsomething before I decide. Whether it&#39;s the unschooling issue or the non <br/>\nvaccinating one. I have total support from him and he&#39;s always here for me <br/>\nand the kids.<br/>\n<br/>\nMy mom, an ex school teacher who lives in an adjacent MIL quarters, is a <br/>\ngreat &quot;teacher if you will&quot; for the kids and also totally supports us. <br/>\nSeeing what goes on with our oldest in school these days certainly helps!!!!<br/>\n<br/>\nMy in laws on the other hand are a handful indeed and sadly we have <br/>\ndistanced ourselves from them due to necessity. My sanity and that of our <br/>\nkids! My MIL comes around once a week and asks how school is going and I <br/>\njust say great. She has no desire to really understand and I&#39;ve offered many <br/>\ntimes. She doesn&#39;t understand why school isn&#39;t good enough for our kids when <br/>\nit was fine for everyone else in the family. The non vaccination issue is a <br/>\nwhole other story. My 2 SIL&#39;s are pretty much the same and well, the <br/>\ncomments just got to be too much. Our kids don&#39;t need that kind of <br/>\ninterrogation and negativity. One SIL has said all the homeschool kids she <br/>\nknows are sneaky, (she&#39;s an office manager in the public school system) and <br/>\nthe other one just plain out called us weird. Doesn&#39;t understand why I don&#39;t <br/>\nfarm my kids out to other people. And yes she actually said that. They <br/>\npretty much blame me, God knows my husband has no mind of his own. &lt;BG&gt;<br/>\n<br/>\nI stay away and keep our kids away and my husband stays away for the most <br/>\npart too. We are happy and very secure in our unschooling ways. We are very <br/>\nrelaxed and our children are thriving. Our oldest is amazed at what the <br/>\nyounger ones know as she never really sees us do school stuff with them!<br/>\n<br/>\nOur kids are now reading on their own and interested in geography and <br/>\nscience and our son is extremely good in math. The baby is trying to count <br/>\nand do her alphabet, not in order of course but she tries so hard to keep up <br/>\nwith her brother and sister!<br/>\n<br/>\nOur days are full of play and outside fun and pets and field trips. And <br/>\nsometimes just computer games and reading and board games. I can honestly <br/>\nsay that so far, I have never had any doubt of what our kids are capable of <br/>\nand never a doubt that we haven&#39;t made the right decision. Unschooling for <br/>\nus is the only way to go and we are totally at ease with it all.<br/>\n<br/>\nI&#39;m glad to be here and share ideas and to listen and possibly ask for help <br/>\nwhen needed.<br/>\n<br/>\nThanks for listening.<br/>\n<br/>\nMary B<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n_________________________________________________________________<br/>\nMSN Photos is the easiest way to share and print your photos: <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://photos.msn.com/support/worldwide.aspx\">http://photos.msn.com/support/worldwide.aspx</a></div>","specialLinks":[]}],"prevTopicId":15963,"nextTopicId":42680}}