{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":11,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: a question about whether an odd situation is unschooling","postDate":"1329602993","msgId":65675,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM0QjdEM0Y4LTFDMzQtNDc0My04MEMxLUZFNDQ1QkYyNUFDRkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDEzMjk2MDE0OTQuNTUzMTAuWWFob29NYWlsTmVvQHdlYjgxNTAzLm1haWwubXVkLnlhaG9vLmNvbT4=","referencesHeader":"PGpob25pZis5NXYwQGVHcm91cHMuY29tPiA8MkVCNzcxOUYtNkVFQS00QkQ3LTg2RkEtRjZBMEVCMTNFQjFCQFNhbmRyYWRvZGQuY29tPiA8MTMyOTYwMTQ5NC41NTMxMC5ZYWhvb01haWxOZW9Ad2ViODE1MDMubWFpbC5tdWQueWFob28uY29tPg=="},"prevInTopic":65674,"nextInTopic":65676,"prevInTime":65674,"nextInTime":65676,"topicId":65653,"numMessagesInTopic":0,"msgSnippet":"-=-There are many many parents, probably much more than in schooling, that send their kids to school and are neglectful or much worse. It is not an unschooling","messageBody":"<div id=\"ygrps-yiv-1130011307\">-=-There are many many parents, probably much more than in schooling, that send their kids to school and are neglectful or much worse.<br/>\nIt is not an unschooling thing. -=-<br/>\n<br/>\nTrue.<br/>\nI had a huge falling out with another mom-friend of mine.  Our girls were in a summer dance and theater day-camp (all day every day for two weeks) and every day when I picked her daughter up there was either no lunch, or a promise of a lunch to be delivered.  After a couple of days the director of the school took me aside and said that Jasmine&#39;s grandfather had brought some lunch AFTER the lunch break was totally over.  I called my friend and said she HAD to have a lunch ready, and told the story.   She had said SHE would bring the lunch, but sent her dad, later, late.<br/>\n<br/>\nLooking back, I should have just brought enough lunch for both of them and not messed with my friend at all.  But there was another aspect to our relationship--the mom was a protege of mine within the SCA  (medieval studies club, so she was sort of like a squire to my knighthood, though it was another order/award, but the relationship was parallel).  So she was supposed to listen to my advice.  This was outside that organization, but it was the reason I even KNEW her enough to take her daughter to the same dance school where my daughter was going.   <br/>\n<br/>\nAfter the first rough week, she told me she had bought a big set of pre-made lunches, and they were in the fridge.  Monday I picked the girl up.  No lunch, she said (the mom wasn&#39;t there; she was gone, or asleep, or I forget what).   &quot;They&#39;re in the bottom of the fridge,&quot; I said.  No, they weren&#39;t.<br/>\n<br/>\nI was pretty cranky about having been lied to.   But honestly, why didn&#39;t *I* just take care of lunches for both of them?  Because I kept thinking that just a reminder, a plea, a report of the teacher&#39;s frustration, would cause a change.   It didn&#39;t.<br/>\n<br/>\nLots of parents get their kids late to school more days than they&#39;re on time.  Lots of parents fail to buy groceries, or fail to plan a dinner, or leave kids without any food they can make on their own.  The county doesn&#39;t take those kids away.<br/>\n<br/>\nYears ago, after I was grown and living apart, my alcoholic mother was neglecting my half brother, who was five or six or so, and I called social services, because they had been promised counselling and no one had called back.   I wanted to say things were not better, and where was the help they were supposed to be getting?  The social worker described the three most pressing cases they had.  I&#39;m not going to recite exactly what she said, though I remember it well.  Because my brother hadn&#39;t been burned, broken or sexually abused,  he was way down the bottom of the list.   I didn&#39;t bother them any more.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: a question about whether an odd situation is unschooling","postDate":"1329601494","msgId":65674,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMjk2MDE0OTQuNTUzMTAuWWFob29NYWlsTmVvQHdlYjgxNTAzLm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PDJFQjc3MTlGLTZFRUEtNEJENy04NkZBLUY2QTBFQjEzRUIxQkBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGpob25pZis5NXYwQGVHcm91cHMuY29tPiA8MkVCNzcxOUYtNkVFQS00QkQ3LTg2RkEtRjZBMEVCMTNFQjFCQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":65673,"nextInTopic":65675,"prevInTime":65673,"nextInTime":65675,"topicId":65653,"numMessagesInTopic":0,"msgSnippet":". But maybe the sitters didn t like hanging around a barn all day. I wouldn t if it were me. I d rather take the kids somewhere else (if it were me). And","messageBody":"<div id=\"ygrps-yiv-2129370000\">. &quot;But maybe the sitters didn&#39;t like hanging around a barn all day. I wouldn&#39;t if it were me. I&#39;d rather take the kids somewhere else (if it were me).&quot;<br/>\n<br/>\n<br/>\nAnd maybe the mom would have been OK with the sitter tanking the kids places after she got to know the sitter more and been able to observe the kids and sitter interactions.  <br/>\nIt is hard to tell in this case, by what the was posted, if it was the case of negligent parenting.<br/>\nI do agree that the mom was not very proactive that day about bringing food and drinks for an all day thing. <br/>\nBut it may have been that day only . It   may have been she was late and grabbed some granola bars or even forgotten a cooler at home.<br/>\nAre there neglectful unschooling parents?<br/>\nI have heard of them. I have seen some that were borderline and called themselves unschoolers. All the ones I have met that<br/>\nreally got unschooling were not neglectful. <br/>\nThere are many many parents, probably much more than in schooling, that send their kids to school and are neglectful or much worse.<br/>\nIt is not an unschooling thing. <br/>\n <br/>\n <br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":244921700,"authorName":"Renee McGraw","from":"Renee McGraw &lt;woman.evolving@...&gt;","profile":"dazynay","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: a question about whether an odd situation is unschooling","postDate":"1329600118","msgId":65676,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBRytUOFBYPUM2cF9OVTlrc1VqcjZNeUVqZm5Hej11QUtId3NBT19faU9nOVdrVmtTZ0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":65675,"nextInTopic":0,"prevInTime":65675,"nextInTime":65677,"topicId":65653,"numMessagesInTopic":0,"msgSnippet":"... sitters didn t like hanging around a barn all day. I wouldn t if it were me. I d rather take the kids somewhere else (if it were me). ... If it were me,","messageBody":"<div id=\"ygrps-yiv-1936404500\">On Feb 18, 2012 3:18 PM, &quot;Sandra Dodd&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; &quot;Would explain&quot; might be too long. Could or might explain. But maybe the<br/>\n </span></blockquote>sitters didn&#39;t like hanging around a barn all day. I wouldn&#39;t if it were<br/>\nme. I&#39;d rather take the kids somewhere else (if it were me).<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>If it were me, I&#39;d love the opportunity to hang around a farm all day with<br/>\nthe kids.<br/>\nI did it myself as a kid.<br/>\nI knew the dangers of harassing the cows, gullies that just drop off all of<br/>\na sudden, wire briars and half dead trees.   Not to mention all the tools<br/>\nand equipment.  :-)<br/>\n<br/>\nThe difference between my preference and Sandra&#39;s might also explain why<br/>\nthe mom has yet to find a good fit.  (If I were close I&#39;d jump at the<br/>\nchance to spend all day doing what I love with the kids and pocket a little<br/>\ncash as a bonus)<br/>\n<br/>\nOP:<br/>\n&quot;The 11-year-old said that she is happy to spend her whole day in the farm.<br/>\nThe girl expresses herself very well and she seems very confident. She<br/>\nloves reading about horses. She talks about having no schedule and enjoying<br/>\nthe farm. The family seems to be happy the way they live.&quot;<br/>\n<br/>\nTo me, this says a lot.<br/>\nIf  the OP were to decide to question the mom, maybe gear those questions<br/>\nas someone interested in how unschooling is working for them.  A peek in<br/>\nfor better understanding.<br/>\n<br/>\nRenee<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: a question about whether an odd situation is unschooling","postDate":"1329596310","msgId":65673,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJFQjc3MTlGLTZFRUEtNEJENy04NkZBLUY2QTBFQjEzRUIxQkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGpob25pZis5NXYwQGVHcm91cHMuY29tPg==","referencesHeader":"PGpob25pZis5NXYwQGVHcm91cHMuY29tPg=="},"prevInTopic":65672,"nextInTopic":65674,"prevInTime":65672,"nextInTime":65674,"topicId":65653,"numMessagesInTopic":0,"msgSnippet":"-=-As far as we know, the mom could be keeping the kids and babysitter close until she decides she can trust the sitter out of sight - perfectly reasonable,","messageBody":"<div id=\"ygrps-yiv-206604223\">-=-As far as we know, the mom could be keeping the kids and babysitter close until she decides she can trust the sitter out of sight - perfectly reasonable, and highly responsible of her. It would also explain why other &quot;sitters&quot; have only come for a day.-=-<br/>\n<br/>\n&quot;Would explain&quot; might be too long.  Could or might explain.  But maybe the sitters didn&#39;t like hanging around a barn all day.   I wouldn&#39;t if it were me.  I&#39;d rather take the kids somewhere else (if it were me).<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: a question about whether an odd situation is unschooling","postDate":"1329589684","msgId":65672,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMjk1ODk2ODQuODA3NzYuWWFob29NYWlsTmVvQHdlYjgxNTA0Lm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PGpob25pZis5NXYwQGVHcm91cHMuY29tPg==","referencesHeader":"PDlFRUMyOTkwLTE4NzctNEExRC1CQTQ4LTEyOTVEQzlFM0U2QUBTYW5kcmFkb2RkLmNvbT4gPGpob25pZis5NXYwQGVHcm91cHMuY29tPg=="},"prevInTopic":65669,"nextInTopic":65673,"prevInTime":65671,"nextInTime":65673,"topicId":65653,"numMessagesInTopic":0,"msgSnippet":"As someone who lives in a farm I would say that the only thing that I  would do different was to have more food and drinks available to the kids.|If I was","messageBody":"<div id=\"ygrps-yiv-441594003\">As someone who lives in a farm I would say that the only thing that I  would do different was to have<br/>\nmore food and drinks available to the kids.|If I was working outside and I hired another homeschooling mom<br/>\nto come spend the day with my kids while I worked  I would bring their electronics ( which apparently she does) and<br/>\nI would have a cooler with food and drinks available. I also take foods and drink everywhere even for a quick trip to town. <br/>\nBut that is me and most my friends do not. I also usually have extra clothing in the car  which has been awesome in many situations.|<br/>\n<br/>\nMy daughter , now just turned 6, has spend days outside with her dad doing chores. She absolutely loves it.|When she was just a year old and it was very cold outside she would cry and  want to go outside to be with the cows. She only lasted 5 minutes even all blundled up.|<br/>\nMy kids know all the dangers in our farm. It is totally different than having children over that have no idea about them.<br/>\nWhen I have kids over with their parents I always tell the parents to be right next to their children because of all the farm dangers.<br/>\nBut my kids are really aware of those. <br/>\n<br/>\nI also sometimes go help my husband with something urgent and I leave the kids alone in the house. <br/>\nLike the wood stove that Meredith mentioned we have a wood burning insert and that is something else my kids are used to it and many kids are not. Plus all the heavy machinery in the farm going around.<br/>\n<br/>\nMy daughter Gigi is so amazing with the cows and doing chores. She really loves it . SHe will spend all day outside with dad!<br/>\nSo maybe this mom is neglectful but maybe not. You cannot tell by spending one day with the kids. After all she is paying someone to look after the children and that shows she cares and is not  just leaving them alone.<br/>\n<br/>\nMaybe she is looking for someone who will be more fun and attentive to her children and not just watch them from a distance and that may be why other people do not stick around. They were not good enough for this mom. Maybe that is why she tried a homeschooling/unschooling mom!<br/>\n<br/>\nIt seems like the children are not unhappy with the situation. My son would have wanted to be home and not hanging all day outside in someone else&#39;s farm all day everyday so I know it probably would not have worked for him.<br/>\nBut if it is working for her children and they are happy and thriving then it maybe a good situation.|<br/>\n<br/>\nSome parents are home with their kids  all day ( with them and not working) and they pay less attention to their children that this mom maybe paying to hers! Keep in mind that she may not be while you are there and that is why she hired you. So she can get her work done and be done fast to be with her children.<br/>\n<br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: a question about whether an odd situation is unschooling","postDate":"1329587547","msgId":65669,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpob29ncisyY2xkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpob25pZis5NXYwQGVHcm91cHMuY29tPg=="},"prevInTopic":65668,"nextInTopic":65672,"prevInTime":65668,"nextInTime":65670,"topicId":65653,"numMessagesInTopic":0,"msgSnippet":"Woops! the quotes in my last post weren t by Sandra, but by an anonymous source, as passed on by Sandra!","messageBody":"<div id=\"ygrps-yiv-1699589570\">Woops! the quotes in my last post weren&#39;t by Sandra, but by an anonymous source, as passed on by Sandra!<br/>\n---Meredith</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: a question about whether an odd situation is unschooling","postDate":"1329586575","msgId":65668,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpob25pZis5NXYwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDlFRUMyOTkwLTE4NzctNEExRC1CQTQ4LTEyOTVEQzlFM0U2QUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":65656,"nextInTopic":65669,"prevInTime":65667,"nextInTime":65669,"topicId":65653,"numMessagesInTopic":0,"msgSnippet":"... By the standards of a full time homemaker, it probably did seem negligent - but those standards are pretty luxurious from my perspective. I work full time","messageBody":"<div id=\"ygrps-yiv-2064981442\">Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I kept having the feeling that the mom was negligent and that she might<br/>\n&gt; be confused about unschooling.  Is this considered child abuse?  Should<br/>\n&gt; I say something to the mom?<br/>\n<br/>\n </span></blockquote>By the standards of a full time homemaker, it probably did seem negligent - but those standards are pretty luxurious from my perspective. I work full time out of the home and my partner is juggling his home-based small business with being the at-home parent. That wouldn&#39;t have worked when Ray was little - did not work, which is how I got into the picture originally, as a nanny - but the situation works well with Mo who isn&#39;t nearly as social and is busy busy busy on her own projects all day long. <br/>\n<br/>\nThese kids aren&#39;t necessarily worse off than they would be in school, and may well be better off. And we have no idea what the home-life is like at the end of the work day. My work days are certainly very different from my evenings and days off! <br/>\n<br/>\nFrom the perspective of working parents (single or otherwise) it would seem like that mom found a reasonable situation, one where she could eat her cake and have it - work And be with her kids. It&#39;s not ideal, maybe, but it could very well be the best of the possible options she&#39;s found so far. It could very easily be better than school. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; She only asked my name. No other questions asked.  How can she let a<br/>\n&gt; complete stranger babysit her kids?<br/>\n<br/>\n </span></blockquote>She didn&#39;t leave them with the sitter, though, they were all there with her while she worked. The mom could have considered the day as something closer to an interview - I went to a day-long &quot;working&quot; interview myself the other day, where I was dropped right into the work day with a minimum of instruction while the owner was in and out, dealing with other aspects of the business. It&#39;s a pretty good way to assess a potential employee, actually. As far as we know, the mom could be keeping the kids and babysitter close until she decides she can trust the sitter out of sight - perfectly reasonable, and highly responsible of her. It would also explain why other &quot;sitters&quot; have only come for a day.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;It was cold.<br/>\n </span></blockquote>and<br/>\n<blockquote><span title=\"ireply\"> &gt;There were dangerous areas in the farm where this kids play.<br/>\n<br/>\n </span></blockquote>These observations could reflect a difference in lifestyle and expectations more than anything else. Those kids are likely very familiar with the dangers of their environment.<br/>\n<br/>\nI have a woodstove in my house - it&#39;s a hideously dangerous thing to have around toddlers and small children, if you&#39;re not used to them, but they&#39;re common where I live. Before she could actually pronounce the word, Mo could toddle into a strange home and identify the woodstove - even though there are dozens of different models of the things. She knew to beware of them. <br/>\n<br/>\nThere&#39;s a small waterfall not a hundred yards from my house, the most prominent weeds around my yard are toxic, and poisonous snakes and spiders may be found under any rock or stick, even inside my house. That was the reality in which I had very young children and now have a 10yo and 18yo. The only times I ever worried about my kids playing outside is when we&#39;ve had dog packs form and livestock was getting killed - and I kept them in until the local farmers took care of the problem.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;The only food that she brought<br/>\n&gt; for her kids were granola bars. I shared my lunch and water bottles with<br/>\n&gt; her kids.<br/>\n<br/>\n </span></blockquote>Again, lifestyle differences. Since we don&#39;t know anything about the home-life or the kids regular eating habits, they may not need more than granola bars. It may not look like picture-perfect unschooling, but it may well fit the needs of that family just fine. <br/>\n<br/>\nNow and then I&#39;ve taken Mo to work with me. I tend to bring a baggie of cold cereal for her, one of chips, and a few cookies. That&#39;s not all that more spectacular than a box of granola bars! But it&#39;s more than she&#39;s likely to eat during the day, and all foods I&#39;m confident she&#39;ll eat. <br/>\n<br/>\nIt&#39;s also important to keep in mind that a one day sample space isn&#39;t very large. It&#39;s hard to know what&#39;s &quot;normal&quot;. It could be mom just payed the property taxes and so the budget is slim at the moment. Property taxes come once a year, so some people forget to plan for them, even unschoolers.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I think that if social services finds out about this they would take her<br/>\n&gt; kids away from her.<br/>\n<br/>\n </span></blockquote>If it&#39;s a rural area, they&#39;re more likely to see those kids as coddled and spoiled than in danger, especially if they don&#39;t have chores around the farm (I wasn&#39;t clear on that fact from the description - one part mentioned the 11yo working, but other places she was described as having no schedule and being able to play video games if she wanted). There is a bathroom, a heater, and food. If they&#39;re meeting the local legal requirements for home ed, child services likely won&#39;t have any complaints. <br/>\n<br/>\nPeople fuss about child services, but I have friends in that business and for the most part they don&#39;t have the resources to deal with kids in iffy situations beyond checking in now and then. They&#39;re swamped with families in which children are in actual peril, often mortal peril. A nice homeschool mom who takes her kids to work on a farm is the picture of respectability by comparison.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; she might<br/>\n&gt; be confused about unschooling.<br/>\n<br/>\n </span></blockquote>She might - a lot of people are - but she may also be making the best of a less-than-ideal situation and we&#39;re only seeing a picture of her Work Day. If you look at other unschooling families during the work day you may see kids asleep all day, or kids with strangers during the day, or kids in daycare, or kids home alone, or kids helping out with the family business. Some of those families are confused about unschooling, but others are making do with the options they&#39;ve found so far, and the kids are happy.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] a question about whether an odd situation is unschooling","postDate":"1329538498","msgId":65656,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE3REY4QjlDLTczOTUtNEEzQy04RDU0LTE5NEMyOTc2M0I2MUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDlFRUMyOTkwLTE4NzctNEExRC1CQTQ4LTEyOTVEQzlFM0U2QUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDlFRUMyOTkwLTE4NzctNEExRC1CQTQ4LTEyOTVEQzlFM0U2QUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":65655,"nextInTopic":65668,"prevInTime":65655,"nextInTime":65657,"topicId":65653,"numMessagesInTopic":0,"msgSnippet":"-=-She only asked my name. No other questions asked. How can she let a complete stranger babysit her kids?-=- She was there, too.  You were all in the same","messageBody":"<div id=\"ygrps-yiv-244548237\">-=-She only asked my name. No other questions asked. How can she let a<br/>\ncomplete stranger babysit her kids?-=-<br/>\n<br/>\nShe was there, too.  You were all in the same place, right?<br/>\nSome people are more trusting than others.  Some kids have strong personalities and couldn&#39;t be easily snatched away or mistreated, especially with their mom within shouting range.<br/>\n<br/>\n-=-Some days the kids<br/>\nare loose in the farm, play video games and listen to music. The<br/>\n11-year-old wakes up at 6am and works in the farm until 5 pm. The<br/>\n4-year-old stays sitting in a corner watching his mom train horses and<br/>\nteaching. -=-<br/>\n<br/>\nWhich is it?  They play and listen to music, or they work and sit?  Maybe some and some.  Maybe when it&#39;s much warmer, they can climb and run and play.<br/>\n<br/>\n-=-The 11-year-old said that she is happy to spend her whole day in the<br/>\nfarm. The girl expresses herself very well and she seems very<br/>\nconfident. She loves reading about horses. She talks about having no<br/>\nschedule and enjoying the farm. The family seems to be happy the way<br/>\nthey live.-=-<br/>\n<br/>\nAnd you saw one part of one day.<br/>\n<br/>\nIt doesn&#39;t sound like the best example ever, but it&#39;s hard to know the whole story from one day.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] a question about whether an odd situation is unschooling","postDate":"1329537634","msgId":65655,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVDQzIxNkJCLUY1NUYtNDNBMy05MzNBLTFGQzY2Nzg0ODkxNUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDlFRUMyOTkwLTE4NzctNEExRC1CQTQ4LTEyOTVEQzlFM0U2QUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDlFRUMyOTkwLTE4NzctNEExRC1CQTQ4LTEyOTVEQzlFM0U2QUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":65654,"nextInTopic":65656,"prevInTime":65654,"nextInTime":65656,"topicId":65653,"numMessagesInTopic":0,"msgSnippet":"-=-I kept having the feeling that the mom was negligent and that she might be confused about unschooling.-=- Maybe. There are a lot of hours in the week, and a","messageBody":"<div id=\"ygrps-yiv-182178238\">-=-I kept having the feeling that the mom was negligent and that she might be confused about unschooling.-=-<br/>\n<br/>\nMaybe.<br/>\n<br/>\nThere are a lot of hours in the week, and a lot of days in the year.  You can&#39;t tell how much cool stuff they do at their house or on the mom&#39;s days off.  You didn&#39;t see their house.  Maybe it&#39;s full of food. :-)   <br/>\n<br/>\nI remember some school lunches that were much less substantial than a couple of granola bars.   Maybe some days there&#39;s more food there.<br/>\n<br/>\n-=- Is this considered child abuse?-=-<br/>\n<br/>\nIf anything, neglect.<br/>\nBut if the older girl is actually working--like employed, or helping the mom do work for which the mom is being paid--*maybe* someone could say something about child labor laws, but if she&#39;s helping out for fun, that&#39;s different. <br/>\n<br/>\nSchool is about six hours a day 180 days a year, generally, in the U.S.  More in some places in the world, maybe.  It&#39;s a common school-thinking assumption that learning should be happening Monday through Friday &quot;during school hours.&quot;  Unschooling doesn&#39;t need &quot;school hours&quot; or &quot;school days.&quot;<br/>\n<br/>\n-=- Should I say something to the mom?-=-<br/>\n<br/>\nIf you&#39;re going to babysit other times, maybe ask her to bring more things to do, and more food.  Or if you&#39;re going to babysit, YOU bring things to do maybe.  Maybe some blankets. :-)<br/>\n<br/>\nI suppose it depends on your relationship with her, whether you&#39;ll work for her or be her friend.<br/>\nIf neither of those will be continuing, then I don&#39;t think you should say anything.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] a question about whether an odd situation is unschooling","postDate":"1329537134","msgId":65654,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY3ODcxRDJFLTBGQjctNEY4RS04QTRFLTM1RDNEMkNEQTY4REBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDlFRUMyOTkwLTE4NzctNEExRC1CQTQ4LTEyOTVEQzlFM0U2QUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDlFRUMyOTkwLTE4NzctNEExRC1CQTQ4LTEyOTVEQzlFM0U2QUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":65653,"nextInTopic":65655,"prevInTime":65653,"nextInTime":65655,"topicId":65653,"numMessagesInTopic":0,"msgSnippet":"-=-I find it impossible to understand what unschooling is by just reading about it.-=- It s a good reason to join a discussion like this one, so welcome! It","messageBody":"<div id=\"ygrps-yiv-1823182528\">-=-I find it impossible to understand what unschooling is by just reading about it.-=-<br/>\n<br/>\nIt&#39;s a good reason to join a discussion like this one, so welcome!  <br/>\nIt can help to be around other unschoolers.  There are some gatherings and conferences listed here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://speakingsandradodd.blogspot.com/\">http://speakingsandradodd.blogspot.com/</a><br/>\nand if you can find some unschoolers in your state, they might know of others nearer you:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradod.com/world\">http://sandradod.com/world</a><br/>\n<br/>\nThere are stories of typical days (some fancy days, some very plain)  here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/typical\">http://sandradodd.com/typical</a><br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"a question about whether an odd situation is unschooling","postDate":"1329536344","msgId":65653,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlFRUMyOTkwLTE4NzctNEExRC1CQTQ4LTEyOTVEQzlFM0U2QUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":65654,"prevInTime":65652,"nextInTime":65654,"topicId":65653,"numMessagesInTopic":0,"msgSnippet":"Someone who hasn t ever met an unschooler met some.  I wrote to the author and asked if she was unschooling, herself, and the answer is as interesting as the","messageBody":"<div id=\"ygrps-yiv-1810122792\">Someone who hasn&#39;t ever met an unschooler met some.  I wrote to the author and asked if she was unschooling, herself, and the answer is as interesting as the original question.<br/>\n<br/>\nGo easy on this, and if you recognize the family from the description, keep that quiet, please.  It&#39;s not about who it is, or where.  It&#39;s about the ideas, and the impressions other people have, and such.  Let&#39;s be clinical.<br/>\n<br/>\nFirst, the response of the author after I inquired, and then the original question. <br/>\n<br/>\n---------------<br/>\nI find it impossible to understand what unschooling is by just reading about it.  I don&#39;t know if what I am doing is called unschooling.  My family belongs to 2 homeschool co-op.  When I talk to other homeschool families the conversations seem so fake.  It seems like we are scare of saying the wrong thing.<br/>\n <br/>\nI have heard that there are many unschoolers in this state but they keep it a secret.  People seem to be afraid of being labeled.  How can we understand unschooling if we are all afraid to talk about it.<br/>\n----------------<br/>\nOriginal post, anonymous for the list:<br/>\n----------------<br/>\n<br/>\nFor years I have been reading about unschooling.  Finally I met a family<br/>\nthat admited to be unschoolers in my state.  I would like to share my<br/>\nexperience with this unschooling family.<br/>\n<br/>\nThe other day I went to babysit for an unschooling mom.  She posted an<br/>\nad searching for someone to babysit her 4 -year- old.  I brought my<br/>\n8-year-old daughter because she was interested in playing with the boy.<br/>\n<br/>\nThe unschooling mom works full-time in a horse farm as a trainer and<br/>\ninstructor.  She studied with a renown horse instructor in the United<br/>\nStates.  I am impressed by her knowledge of horses.<br/>\n<br/>\nShe only asked my name. No other questions asked.  How can she let a<br/>\ncomplete stranger babysit her kids?<br/>\n<br/>\nShe also has an 11-year-old daughter.   I spent 6 hours babysitting her<br/>\n2 kids and my child in the farm.  It was cold. The owner of the farm<br/>\nonly allowed us to go inside her house to use her bathroom.  There was<br/>\nonly 1 heater in a small room of the stable.  The kids didn&#39;t mind about<br/>\nthe weather because they were playing.  The only food that she brought<br/>\nfor her kids were granola bars. I shared my lunch and water bottles with<br/>\nher kids.<br/>\n<br/>\nHer daughter told me that sometimes people come to the farm to babysit<br/>\nthem. However these people never come back again.  Some days the kids<br/>\nare loose in the farm, play video games and listen to music.  The<br/>\n11-year-old wakes up at 6am and works in the farm until 5 pm.  The<br/>\n4-year-old stays sitting in a corner watching his mom train horses and<br/>\nteaching.  There were dangerous areas in the farm where this kids play.<br/>\n<br/>\nThe 11-year-old said that she is happy to spend her whole day in the<br/>\nfarm.  The girl expresses herself very well and she seems very<br/>\nconfident.  She loves reading about horses.  She talks about having no<br/>\nschedule and enjoying the farm.  The family seems to be happy the way<br/>\nthey live.<br/>\n<br/>\nI think that if social services finds out about this they would take her<br/>\nkids away from her.<br/>\n<br/>\nI kept having the feeling that the mom was negligent and that she might<br/>\nbe confused about unschooling.  Is this considered child abuse?  Should<br/>\nI say something to the mom?<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":65639,"nextTopicId":65698}}