{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":326782993,"authorName":"Vidyut Kale","from":"Vidyut Kale &lt;wide.aware@...&gt;","profile":"vidyutgore","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Fairness & apologies","postDate":"1271237786","msgId":52723,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PHEyaTc5YzFkMWI0MTAwNDE0MDIzNnM1N2NjMGJiMHVlNjhlMzk0ZDBkNTE5NmJjQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDU0MThFODI5LTU2Q0YtNDhGMC05NzA3LTZFQkFGNTRENDAzQ0BtYWMuY29tPg==","referencesHeader":"PDU0MThFODI5LTU2Q0YtNDhGMC05NzA3LTZFQkFGNTRENDAzQ0BtYWMuY29tPg=="},"prevInTopic":52707,"nextInTopic":0,"prevInTime":52722,"nextInTime":52724,"topicId":52697,"numMessagesInTopic":0,"msgSnippet":"I made a big mistake by posting a link to her article. I will avoid such mistakes in the future by not posting. There is enough info in the archives so that I","messageBody":"<div id=\"ygrps-yiv-2087515487\">&quot;I made a big mistake by posting a link to her article. I will avoid such<br/>\nmistakes in the future by not posting. There is enough info in the archives<br/>\nso that I don&#39;t need to ask my own questions. I apologize for any trouble I<br/>\nhave caused here.&quot;<br/>\n<br/>\nThe mistake was not in asking questions. It was in asking questions<br/>\nelsewhere and linking to the output here. So, in essence, you haven&#39;t asked<br/>\nanything here other than opinions on your conversation with someone else.<br/>\n<br/>\nDoesn&#39;t help to say, &quot;Ok, so you didn&#39;t like me telling you that. I will not<br/>\ntell you anything&quot; variety stuff. Might be better to look at how<br/>\nconversations can be made to work. After all, isn&#39;t that what we learn to do<br/>\nwith our unschooling kids - to move away from all or none?<br/>\n<br/>\nI can speak for myself. It wasn&#39;t so much the asking as it was the way it<br/>\nwas asked, Though the documentary angle explains the &#39;tell me everything<br/>\nabout everything&#39; feeling I got when asked for opinions on an article that<br/>\nsays so many things. The conversation has already happened. The &#39;expert&#39;<br/>\nsounds conclusive and unavailable for dialogue. There are people who hit<br/>\ntheir kids in the world too. What can I do? I can only look and shrug and<br/>\nnot do those things myself. So I feel like a child asked to &quot;recite a poem&quot;.<br/>\n<br/>\nI would have appreciated at least knowing anything specific *you* wanted a<br/>\nconversation around out of that laundry list. If you had quoted what you<br/>\nfound interesting or would like opinions on; the link would have been a<br/>\nreference rather than an assignment and not offensive at all. You are a<br/>\nmember here, and a dialogue is possible. That changes everything.<br/>\n<br/>\nVidyut<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":143043046,"authorName":"Ed Wendell","from":"&quot;Ed Wendell&quot; &lt;ewendell@...&gt;","profile":"zelco123","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Fairness & apologies","postDate":"1271210195","msgId":52707,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCOTM5Q0Y5ODFFMDQyQTE5RUExRkFFNTBCNkRDMzJFQEVkUEM+","inReplyToHeader":"PDU0MThFODI5LTU2Q0YtNDhGMC05NzA3LTZFQkFGNTRENDAzQ0BtYWMuY29tPg==","referencesHeader":"PDU0MThFODI5LTU2Q0YtNDhGMC05NzA3LTZFQkFGNTRENDAzQ0BtYWMuY29tPg=="},"prevInTopic":52697,"nextInTopic":52723,"prevInTime":52706,"nextInTime":52708,"topicId":52697,"numMessagesInTopic":0,"msgSnippet":"But that was a private conversation (email) with Sandra - what about openness and clarity with the other posters on this list? You simply asked us to read the","messageBody":"<div id=\"ygrps-yiv-1566490048\">But that was a private conversation (email) with Sandra - what about openness and clarity with the other posters on this list?<br/>\n<br/>\nYou simply asked us to read the web site with Q&#39;s & A&#39;s and asked for our input for your better understanding.  Unless I missed something, I don&#39;t remember you stating to the group - posters that spend a huge part of their time reading and answering posts - that you were making a documentary.  I don&#39;t like feeling like a lab rat - when I&#39;m working a full time job AND unschooling my almost 16 year old son.  I feel like we were being observed through a one way window with questions meant only to pick our brains for a research project, not questions of a parent trying to understand how to be a better parent / have a better relationship with their child.<br/>\n<br/>\n<br/>\n<br/>\nLisa W.<br/>\n<br/>\n<br/>\n<br/>\n   &lt;   I wrote to Sandra that I was doing a documentary. &gt;<br/>\n<br/>\n   &lt;  I don&#39;t expect Sandra (or anybody) to remember every email you receive or write. But you can&#39;t accuse me now of having hidden something from you and I don&#39;t feel like i was treated with fairness by being repeatedly called not honest and not upfront when I was, in fact, upfront and honest with you.  &gt;<br/>\n<br/>\n  Clara<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":366686190,"authorName":"claramont@mac.com","from":"claramont@...","profile":"clara_bellar","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Fairness & apologies","postDate":"1271193835","msgId":52697,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU0MThFODI5LTU2Q0YtNDhGMC05NzA3LTZFQkFGNTRENDAzQ0BtYWMuY29tPg=="},"prevInTopic":0,"nextInTopic":52707,"prevInTime":52696,"nextInTime":52698,"topicId":52697,"numMessagesInTopic":0,"msgSnippet":"==When someone with a baby who hasn t been honest about her motivations for being on the list == I m not used to seeing my name associated with not honest. I","messageBody":"<div id=\"ygrps-yiv-877918724\">==When someone with a baby who hasn&#39;t been honest about her motivations for<br/>\nbeing on the list ==<br/>\nI&#39;m not used to seeing my name associated with not honest. I was going to let it go, thinking that any post trying to set the record straight would be banned. But it doesn&#39;t feel right.<br/>\nOn Jan 31, Sandra Dodd and I had an email exchange (about a banned post :) ) I wrote to Sandra that I was doing a documentary. Her response was:<br/>\n&quot;There have been people who have done documentaries on unschooling before, and newspaper articles, and magazine articles, and when I saw their results I was stunned at how little they understood.  I have been thoroughly interviewed many times, and nobody has understood it yet without being around unschoolers for a long time and really seeing it work.&quot;<br/>\nI don&#39;t expect Sandra (or anybody) to remember every email you receive or write. But you can&#39;t accuse me now of having hidden something from you and I don&#39;t feel like i was treated with fairness by being repeatedly called not honest and not upfront when I was, in fact, upfront and honest with you.<br/>\n<br/>\nAlso, the film I&#39;m working on is on Autonomous Learning, not on Radical Unschooling. I joined this list for personal reasons, for my growth and learning as a parent. It&#39;s helped a lot and I&#39;m grateful for that.<br/>\n<br/>\nYes, the quote was accurate. I didn&#39;t botch it, it came in two separate emails. Sandra, and everybody, feel free to email Naomi Aldort if you&#39;d like to check the accuracy of the quote or discuss any part of this with her. Her email is on website naomialdort.com I agree with those who wrote that any conversation with her should be happening directly.<br/>\n<br/>\nI made a big mistake by posting a link to her article. I will avoid such mistakes in the future by not posting. There is enough info in the archives so that I don&#39;t need to ask my own questions. I apologize for any trouble I have caused here.<br/>\n<br/>\nBest,<br/>\nClara<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":52710,"nextTopicId":52731}}