{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] The research we all have wanted to see!:)","postDate":"1084147904","msgId":93707,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyLjRkNmM1YWEzLjJkZDAyMmMwQGFvbC5jb20+"},"prevInTopic":93704,"nextInTopic":0,"prevInTime":93706,"nextInTime":93708,"topicId":93573,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/7/04 11:26:33 AM, pamsoroosh@mac.com writes: ","messageBody":"<div id=\"ygrps-yiv-1366039388\">In a message dated 5/7/04 11:26:33 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pamsoroosh@...\">pamsoroosh@...</a> writes:<br/>\n<br/>\n&lt;&lt; There are experimental methods in which the <br/>\nsubject is harmed or destroyed as part of the experiment.  &gt;&gt;<br/>\n<br/>\nAs testing would be for unschoolers.<br/>\n<br/>\nI think just generally that any research on homeschoolers done by the <br/>\neducational establishment would be more biased than even HSLDA could conjure up in <br/>\ntheir wildest apocalyptic dreams, because  they/school lose money and possibly <br/>\ntheir jobs themselves if they prove we&#39;re doing even okay (not just better).  <br/>\nTheir only acceptable results would be that we&#39;re harming our children, and <br/>\nusing their own criteria as guidelines, they could prove it (within their windows <br/>\nand on their timetables, not with ultimate or intangible results).<br/>\n<br/>\nAnd anyway, they&#39;re so intent upon and accustomed to blaming parents for <br/>\nkids&#39;s failures and not themselves or their system, that they can&#39;t see the noses <br/>\nin front of their own faces.<br/>\n<br/>\nSandra<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] The research we all have wanted to see!:)","postDate":"1084144803","msgId":93704,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFhZC4yMzYwZTI1ZC4yZGQwMTZhM0Bhb2wuY29tPg=="},"prevInTopic":93634,"nextInTopic":93707,"prevInTime":93703,"nextInTime":93705,"topicId":93573,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/7/04 4:04:48 AM, fetteroll@earthlink.net writes: ","messageBody":"<div id=\"ygrps-yiv-1096132560\">In a message dated 5/7/04 4:04:48 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a> writes:<br/>\n<br/>\n&lt;&lt; Even without the Christian/school-at-home bias, kids who are homeschooled<br/>\nhave involved caring parents. &gt;&gt;<br/>\n<br/>\nStatistically.<br/>\nNot absolutely.<br/>\n<br/>\nSome are at homeschooling by default, and aren&#39;t being too active with it.  <br/>\n(Not people on this list.  People I WISH were on this list so they&#39;d get some <br/>\nbetter ideas than the benign neglect being practiced here and there.  Not <br/>\nlots.  I hope.)<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":141316284,"authorName":"pam sorooshian","from":"pam sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] The research we all have wanted to\tsee!:)","postDate":"1083950593","msgId":93634,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM4MkQ4Q0UwLUEwNEItMTFEOC04QkRELTAwMEE5NUUyOTJDNkBtYWMuY29tPg==","inReplyToHeader":"PEJDQzBENzJDLjI2OUEzJWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","referencesHeader":"PEJDQzBENzJDLjI2OUEzJWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":93611,"nextInTopic":93704,"prevInTime":93633,"nextInTime":93635,"topicId":93573,"numMessagesInTopic":0,"msgSnippet":"This was a survey that homeschoolers 16 or over could take on the internet (or their parents could fill it in for them.) The survey was terrible. It has very","messageBody":"<div id=\"ygrps-yiv-175203705\">This was a survey that homeschoolers 16 or over could take on the <br/>\ninternet (or their parents could fill it in for them.) The survey was <br/>\nterrible. It has very intrusive and ridiculous questions and I have <br/>\nheard that many people taking it quit in the middle because they were <br/>\noffended by the questions or found them to be worded in ways that made <br/>\nit impossible to answer. It was also very long. And, parents completing <br/>\nFOR their grown children? That&#39;s so outside the realm of good research! <br/>\nBut, I know LOTS of people who filled it out, on the internet, just to <br/>\nbe able to read through it - so who knows what answers they gave. I&#39;d <br/>\nconclude that the results are entirely totally absolutely meaningless.<br/>\n<br/>\nThere are a million problems with survey research and this survey has <br/>\nevery weakness it could possibly have, imo.<br/>\n<br/>\nHowever, I do have to say that they made an effort to get homeschoolers <br/>\nof all types to fill it out - it was not sent only to HSLDA people, <br/>\nthey put some energy into getting grown homeschoolers who were not <br/>\nnecessarily &quot;Christian Homeschoolers,&quot; to fill it out and I know some <br/>\nwho did.<br/>\n<br/>\nA few weeks ago I was at a meeting of the American Education Research <br/>\nAssociation - I was on a panel debating homeschooling - and the point <br/>\nwas made by the researchers there, several times, that research done BY <br/>\nhomeschoolers on homeschoolers isn&#39;t exactly likely to be unbiased. So <br/>\nsurveys like this are pretty much disregarded by serious researchers.<br/>\n<br/>\nBrian Ray, author of this study, (who was also on the panel) pointed <br/>\nout that much of their research was not intended for the &quot;research <br/>\ncommunity,&quot; but that their audience was really other families who are <br/>\nconsidering homeschooling. To the extent that those families are coming <br/>\nto HSLDA for information and sort of tend to match the profiles of the <br/>\npeople in the surveys, then the information is perfectly good for them. <br/>\nHe pointed out that what they want to know is what is likely to happen <br/>\nin their lives if THEY homeschool and that hearing from thousands of <br/>\nhomeschooling families that their kids grew up and were successful is <br/>\nencouraging to them. So - viewed as surveys with that purpose, not with <br/>\nactual &quot;research&quot; purpose, they&#39;re perfectly fine.  I could survey <br/>\npeople on this list and report the results and as long as I didn&#39;t try <br/>\nto generalize the results to people who wouldn&#39;t be caught dead on this <br/>\nlist &lt;G&gt; and offered the results only to people who DO fit the profile <br/>\nof the people who filled out the survey, then it might be interesting.  <br/>\nIt is no different, really, than what we do all the time, sharing <br/>\nanecdotes and experiences and people feeling encouraged by them. The <br/>\ndifference is, we don&#39;t try to put it all in &quot;data&quot; form and publish it <br/>\nand imply that any of it applies to &quot;all&quot; homeschoolers.<br/>\n<br/>\nThere IS other research, done by impartial analysts. Not ALL research <br/>\nis done by NHERI (National Home Education Research Institute) which is <br/>\nrun by Brian Ray, homeschooler and libertarian and primarily funded by <br/>\nHSLDA.<br/>\n<br/>\nI&#39;m a little embarrassed, to be honest, by the research that NHERI <br/>\ndoes. It is SO easy to poke holes in it and the one thing that it does <br/>\nis make it seem like doing that kind of research on homeschoolers is <br/>\nOKAY with homeschoolers. I think we need to make the point, strongly <br/>\nand repeatedly, that the very act of researching us can be disruptive <br/>\nand destructive to what we are actually doing in our families. There <br/>\nare researchers (Rob Reich, for example) who want to regulate <br/>\nhomeschoolers so that data about homeschoolers can be more easily <br/>\ncollected. They are frustrated with the difficulty of studying us - <br/>\nheck, they point out, rightly, that they can&#39;t even COUNT us. But, my <br/>\nanswer is, sorry, but our right to privacy comes before your desire to <br/>\nmake doing research easier. There are experimental methods in which the <br/>\nsubject is harmed or destroyed as part of the experiment. Making <br/>\nresearch easier by regulating homeschoolers (requiring standardized <br/>\ntesting, curriculum approval or other intrusions like those) would <br/>\ndisrupt and harm homeschooling for many of us. This is a form of <br/>\ndestroying the thing you are studying as part of the experimental <br/>\nmethod and it is clearly unethical to do that to human beings. It <br/>\nseemed that many, but not all, of the researchers in the room at the <br/>\nAERA conference got that point and agreed.<br/>\n<br/>\nNational Home Education Network<br/>\n&lt;www.NHEN.org&gt;<br/>\nServing the entire homeschooling community since 1999<br/>\nthrough information, networking and public relations.</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] The research we all have wanted to\tsee!:)","postDate":"1083924204","msgId":93611,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJDQzBENzJDLjI2OUEzJWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGM3Y3BuYSsycGRrQGVHcm91cHMuY29tPg=="},"prevInTopic":93573,"nextInTopic":93634,"prevInTime":93610,"nextInTime":93612,"topicId":93573,"numMessagesInTopic":0,"msgSnippet":"... Well, I think it s best to keep in mind that the statistics were gathered by HSLDA and most HSLDA folks are conservative Christians who mostly do school at","messageBody":"<div id=\"ygrps-yiv-138851531\">on 5/6/04 3:32 AM, diamondlady1025 at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Diamondlady1025@...\">Diamondlady1025@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; here is some research to blow their mind away!<br/>\n<br/>\n </span></blockquote>Well, I think it&#39;s best to keep in mind that the statistics were gathered by<br/>\nHSLDA and most HSLDA folks are conservative Christians who mostly do school<br/>\nat home. Their goals are different than most unschoolers so their results<br/>\nare going to be different.<br/>\n<br/>\nFundamentalist Christianity, homeschooling, and politics are all tightly<br/>\nintertwined and that explains why some of the statistics are what they are,<br/>\neg, a higher proportion of the homeschooled support banning books from<br/>\nlibraries, only 4% of the respondents found politics to be too complicated<br/>\nto understand versus 35% of the general population, etc. (Patrick Henry<br/>\nCollege was created in a roundabout way as an offshoot of HSLDA to be a<br/>\ncollege specifically for homeschooled kids who are oriented towards<br/>\npolitics.)<br/>\n<br/>\nIt is interesting to look at what the statistics suggest when viewed as<br/>\nanswers from the Christian Right rather than answers from homeschoolers.<br/>\n(Not sure why &quot;only&quot; 88% are affiliated with a church (or some group) but it<br/>\nis significantly higher than 50% for the general population.)<br/>\n<br/>\nYes, they statistics support that homeschooling not only works but does<br/>\nbetter than school, but unless we understand why statistics look as they do<br/>\neven positive statistics can come back and bite us on the butt ;-)<br/>\n<br/>\nEven without the Christian/school-at-home bias, kids who are homeschooled<br/>\nhave involved caring parents. Schools are stuck with kids whose home life<br/>\nruns the gamut from parents who are involved to parents who are passed out<br/>\non drugs. *Any* form of education that requires involved parents will show<br/>\nbetter results than public schools.<br/>\n<br/>\n(Homeschools may also have a disproportionate number of kids with special<br/>\nneeds too but that&#39;s going to have more of a negative effect on statistics<br/>\nhaving to do with standardized testing.)<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":115881476,"authorName":"diamondlady1025","from":"&quot;diamondlady1025&quot; &lt;Diamondlady1025@...&gt;","profile":"diamondlady1025","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"The research we all have wanted to see!:)","postDate":"1083828778","msgId":93573,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM3Y3BuYSsycGRrQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":93611,"prevInTime":93572,"nextInTime":93574,"topicId":93573,"numMessagesInTopic":0,"msgSnippet":"Hi All, Have any of you seen this? Not that we need research to convince us that unschooling is right for us BUT for all the naysayers (like SOME of our","messageBody":"<div id=\"ygrps-yiv-812687997\">Hi All,<br/>\n <br/>\nHave any of you seen this? Not that we need research to convince us <br/>\nthat unschooling is right for us BUT for all the naysayers (like <br/>\nSOME of our friends and relatives whom think we are all just a bit <br/>\nnuts for homeschooling/unschooling - me personally, I can&#39;t even say <br/>\nunschooling in my husband&#39;s family, they FREAK!) here is some <br/>\nresearch to blow their mind away! I plan on getting Dr. Ray&#39;s book <br/>\ntoo!<br/>\n <br/>\nhttp://www.alternative-<br/>\nlearning.org/altlearn_map/articles/homeschoolinggrowsup.pdf<br/>\n <br/>\nand for more info and the book info too!<br/>\nhttp://www.nheri.org/modules.php?name=Content&pa=showpage&pid=27<br/>\n <br/>\nYou may have to copy and paste these in if the hyperlink does not <br/>\ncome out (I had trouble with this when I posted to another group!:)<br/>\n <br/>\nPatti and the boys (Chris 13, Matthew 7, Anthony 6)<br/>\n&quot;For no matter where knowledge and learning come from - no matter <br/>\nwhat shape, size, or dimension it assumes - it still is what it is, <br/>\nknowledge and learning. Therefore knowledge and learning should <br/>\nalways be embraced.&quot; ~ unknown</div>","specialLinks":[]}],"prevTopicId":93494,"nextTopicId":93709}}