{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":9,"messages":[{"userId":361639019,"authorName":"joanne.lopers","from":"&quot;joanne.lopers&quot; &lt;wilmalv@...&gt;","profile":"joanne.lopers","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: newbie questions","postDate":"1287880426","msgId":57879,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk5dnV0YStlYjkzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDkxOTk3NS40MzcwMy5xbUB3ZWIzMDMwNC5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":57874,"nextInTopic":0,"prevInTime":57878,"nextInTime":57880,"topicId":57863,"numMessagesInTopic":0,"msgSnippet":"While in my transition from more traditional parenting styles I found that I that I would slip and give a pleasant command like your example and get a similar","messageBody":"<div id=\"ygrps-yiv-608140991\">While in my transition from more traditional parenting styles I found that I that I would slip and give a pleasant command like your example and get a similar response.  I started telling them that they were definately allowed to say &quot;No&quot; if they did not want to do something that I requested and I would respect that as an answer but it made me feel bad, uncomfortable, irratated when they rolled their eyes or stomped their feet or slammed the doors. That&#39;s the truth and I think it helps kids to see that their actions do affect how another feels.  They are pretty good now at telling me when something I am doing is bothering them. I have been most successful when I have express my need, listen to their thought on the subject, and discussed a compromise that we could both agree on for the moment. We both would throw ideas into the pot to decide. If they didn&#39;t uphold what we agreed on I would comment that maybe we had to go back and make some revisions. Parroting back the child&#39;s emotion or action has helped I think too as well as stating the reason for the request.  So I might say, &quot;It seems that you are irritated, upsent, angry that I asked you to turn off the light. Our energy bill is higher when we leave the lights on when we are not home. I&#39;ll do it since you don&#39;t want to.&quot;  This helped me not to get so angry at what I expected and was not getting from them.  Sometimes they would tell me something like.  I didn&#39;t want to do it because I was going to get my favorite toy before we left.  It seemed to open up discussion.  I now tell them the reason I am making the request and they seem more willing to help without the hostility.  Like, &quot;Will you feed the dog that is begging at my feet while I finish dinner.  I&#39;m starving and want to get dinner on the table as quick as possible.&quot;  And then I accept the possible answer of no.  <br/>\nI know our family&#39;s relationship has benefited from the suggestions from this group.  Tools for the tool box of happy family living!<br/>\nJoanne<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, k j &lt;kbjones74@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; &quot;Respecting children means respecting them exactly where they are - and kids can <br/>\n&gt; find adult requests frustrating and overwhelming. After all, they Don&#39;t have our <br/>\n&gt; background and experience. They haven&#39;t been adults - but you&#39;ve been a child. <br/>\n&gt; Its up to you to find a way to see the world from her perspective&quot;<br/>\n&gt;  Thank you for a gentle reminder.  I think too often I do see them as &quot;little <br/>\n&gt; adults&quot; when they are not.  Of course the other side of the coin is trying to <br/>\n&gt; make all the decisions because they ARE children and don&#39;t see the big picture <br/>\n&gt; or the end result, etc.  I have so enjoyed this list!  <br/>\n&gt; <br/>\n&gt; Kristi<br/>\n&gt; <br/>\n&gt; <br/>\n&gt;       <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":119201959,"authorName":"k j","from":"k j &lt;kbjones74@...&gt;","profile":"kbjones74","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"newbie questions","postDate":"1287842487","msgId":57874,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkxOTk3NS40MzcwMy5xbUB3ZWIzMDMwNC5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":57873,"nextInTopic":57879,"prevInTime":57873,"nextInTime":57875,"topicId":57863,"numMessagesInTopic":0,"msgSnippet":"Respecting children means respecting them exactly where they are - and kids can find adult requests frustrating and overwhelming. After all, they Don t have","messageBody":"<div id=\"ygrps-yiv-1090591665\">&quot;Respecting children means respecting them exactly where they are - and kids can <br/>\nfind adult requests frustrating and overwhelming. After all, they Don&#39;t have our <br/>\nbackground and experience. They haven&#39;t been adults - but you&#39;ve been a child. <br/>\nIts up to you to find a way to see the world from her perspective&quot;<br/>\n Thank you for a gentle reminder.  I think too often I do see them as &quot;little <br/>\nadults&quot; when they are not.  Of course the other side of the coin is trying to <br/>\nmake all the decisions because they ARE children and don&#39;t see the big picture <br/>\nor the end result, etc.  I have so enjoyed this list!  <br/>\n<br/>\nKristi<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: newbie questions","postDate":"1287792001","msgId":57873,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE4RTJEMjcyLTE1MEYtNEZDQy05Q0MxLUVCMjVGQ0Q0NDM2QUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGk5c2Q5cCtjZDc3QGVHcm91cHMuY29tPg==","referencesHeader":"PGk5c2Q5cCtjZDc3QGVHcm91cHMuY29tPg=="},"prevInTopic":57872,"nextInTopic":57874,"prevInTime":57872,"nextInTime":57874,"topicId":57863,"numMessagesInTopic":0,"msgSnippet":"-=- I don t feel ... or anything ... But you and your husband aren t children, either. [Non-text portions of this message have been removed]","messageBody":"<div id=\"ygrps-yiv-1289581993\">-=-&gt;I don&#39;t feel<br/>\n<blockquote><span title=\"ireply\">  &gt; I am asking anything different or more than I would ask my husband  <br/>\n </span></blockquote>or anything<br/>\n<blockquote><span title=\"ireply\">  &gt; he would ask me.-=-<br/>\n<br/>\n </span></blockquote>But you and your husband aren&#39;t children, either.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: newbie questions","postDate":"1287764089","msgId":57872,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk5c2Q5cCtjZDc3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEwMjIzLjc1MTk0LnFtQHdlYjMwMzA3Lm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":57871,"nextInTopic":57873,"prevInTime":57871,"nextInTime":57873,"topicId":57863,"numMessagesInTopic":0,"msgSnippet":"... It helps a lot to shift your thinking about attitude - get that word right out of your vocabulary! When your dd is grumpy or iritable, see her as a","messageBody":"<div id=\"ygrps-yiv-369981080\">k j &lt;kbjones74@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;But I <br/>\n&gt; am having trouble with my oldest who is 10 doing things with a pleasant <br/>\n&gt; attitude.<br/>\n<br/>\n </span></blockquote>It helps a lot to shift your thinking about &quot;attitude&quot; - get that word right out of your vocabulary! When your dd is grumpy or iritable, see her as a friend who isn&#39;t having a great moment. She may not be able to tell you Why she isn&#39;t having a great moment, but she doesn&#39;t need your disapproval on top of her own feelings. Be gentle with her. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I don&#39;t feel <br/>\n&gt; I am asking anything different or more than I would ask my husband or anything <br/>\n&gt; he would ask me.<br/>\n<br/>\n </span></blockquote>But in the past you have, even if you are trying to get away from that now. In the past the answer to &quot;would you please...?&quot; couldn&#39;t be &quot;no&quot; - it wasn&#39;t a real question, just a sweetly phrased command. If &quot;No&quot; is now an acceptible answer, then its important to be very very clear about that. If she looks the least put out by your request, appologise and let her know you&#39;ll take care of it, whatever it is. <br/>\n<br/>\nThis part of deschooling is hard - its harder on your dd than on you, in many ways. Your dd won&#39;t trust you yet - won&#39;t trust that its okay for her to have thoughts and feelings and wishes and wants that run counter to your expectations. She doesn&#39;t trust your smiles and soft words. It can help to ask little to nothing of her for awhile - it was two years before Ray didn&#39;t tense up at being asked to help out around the house and we rarely asked during that time. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I don&#39;t feel <br/>\n&gt; I am asking anything different or more than I would ask my husband or anything <br/>\n&gt; he would ask me.<br/>\n<br/>\n </span></blockquote>While the analogy of a spouse is one way to understand unschooling, kids aren&#39;t adults. It may help more to imagine what you&#39;d ask of your husband if he were disabled. I have a girlfriend with MS and there are times when she&#39;ll look at me and say &quot;No, I Can&#39;t walk ten more feet!&quot; in a very annoyed tone - woops! I&#39;ve forgotten how different her needs and capabilities are from mine - so I appologise and find another option. Your daughter may often seem like she has more capabiliites than she really does. An energetic child, after all, &quot;should&quot; be able to do a few simple tasks... but her needs and capabilities are different than those of an active adult. Respecting children means respecting them exactly where they are - and kids can find adult requests frustrating and overwhelming. After all, they Don&#39;t have our background and experience. They haven&#39;t been adults - but you&#39;ve been a child. Its up to you to find a way to see the world from her perspective. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":119201959,"authorName":"k j","from":"k j &lt;kbjones74@...&gt;","profile":"kbjones74","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"newbie questions","postDate":"1287757665","msgId":57871,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgyMDMzMi44MzAyMi5xbUB3ZWIzMDMwMS5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":57870,"nextInTopic":57872,"prevInTime":57870,"nextInTime":57872,"topicId":57863,"numMessagesInTopic":0,"msgSnippet":"Thank you so much for your responses.  We have been homeschooling for 5 years.  We began a very traditional school at home and have gradually relaxed more","messageBody":"<div id=\"ygrps-yiv-28246479\">Thank you so much for your responses.  We have been homeschooling for 5 years.  <br/>\nWe began a very traditional school at home and have gradually relaxed more and <br/>\nmore until our &quot;school&quot; day no longer remotely resembles what we started with!  <br/>\nWe have begun exploring the ideas of unschooling for about a year.  I am trying <br/>\nto gradually let go more and more, and ease into this unfamiliar territory.  <br/>\nPerhaps I still have too many expectations.  It is difficult with my oldest <br/>\nbecause each stage, each thing, is so new to me.  I will try to give her a break <br/>\nfor a while and see how it goes.  It seems so much easier to look back and see <br/>\nthat having her desk a mess wasn&#39;t the end of the world.  I will definitely work <br/>\non slowing down before I speak and work on our relationship more.  Thank you <br/>\nagain, and I look forward to reading and learning more each day!<br/>\nKristi<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":284087656,"authorName":"Karen James","from":"Karen James &lt;semajrak@...&gt;","profile":"semajrak","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] newbie questions","postDate":"1287757542","msgId":57870,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGk9WGpKUTVhQUFPLXFld3d5NjR4ODhvOFEwZmJtSmRvYTk4aHA9dkBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDEwMjIzLjc1MTk0LnFtQHdlYjMwMzA3Lm1haWwubXVkLnlhaG9vLmNvbT4=","referencesHeader":"PDEwMjIzLjc1MTk0LnFtQHdlYjMwMzA3Lm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":57865,"nextInTopic":57871,"prevInTime":57869,"nextInTime":57871,"topicId":57863,"numMessagesInTopic":0,"msgSnippet":"... room before we leave?  as we are waiting by the door to go to an ... Off she stomps with eye rolling to turn of the lights. I am still working through","messageBody":"<div id=\"ygrps-yiv-999126220\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; My example:  &quot;could you please make sure the lights are off in your<br/>\n<br/>\n </span></blockquote>room before we leave?&quot;  as we are waiting by the door to go to an<br/>\n<blockquote><span title=\"ireply\"> &gt; appointment.<br/>\n<br/>\n </span></blockquote>Off she stomps with eye rolling to turn of the lights.<br/>\n<br/>\n<br/>\nI am still working through letting go of my expectations of others,<br/>\nespecially my son and husband.  Something a wonderful mom said to me that<br/>\nreally helped me keep things in perspective was:<br/>\n<br/>\nWhen someone (including our child/ren) says no to me, they are saying yes to<br/>\nsome need of their own.  Try not to take it personally.<br/>\n<br/>\nYour daughter might not feel like she has a choice to say no, and this would<br/>\nlikely feel frustrating to her.  I noticed that in our home just recently.<br/>\n As we let go of the rules around here, I was still making what I thought<br/>\nwere very polite requests, that were really still just disguised rules or<br/>\nexpectations.  Our son, though young, realized that before I did.  In<br/>\nresponse, he would stomp his feet, or give a great loud sigh.  He would roll<br/>\nhis eyes.  He would whine or cry.  He was protesting.  He was telling me<br/>\nloud and clear, in the language he could speak that he didn&#39;t really have a<br/>\nchoice, and that didn&#39;t feel good to him.<br/>\n<br/>\nNow I say things like: I&#39;m going to brush my teeth.  Want to join me?  He<br/>\ncan say no.  He did a lot at first, largely because he could.  In my mind,<br/>\nthere might have been lights and sirens of protest.  But, in my body and<br/>\nwords, I would say &quot;Okay,&quot; and simply stand up (without any emotion) and go<br/>\nto the bathroom and brush my own teeth.  I would ask him again before I went<br/>\nto sleep.  Again, he can say no, and has, but most of the time, now, he<br/>\nchooses to brush his teeth (without protest) with either my husband or<br/>\nmyself because it is fun for him that way.  And, what is obvious to us now,<br/>\nis that he feels noticeably empowered by the choice to take care of his own<br/>\nneeds in his own way, and by the knowledge that we truly respect his need<br/>\nfor choice.  Seeing this helps keep me on track.<br/>\n<br/>\nKaren.<br/>\njamesfamilyedutrip.blogspot.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":67727291,"authorName":"wtexans","from":"&quot;wtexans&quot; &lt;wtexans@...&gt;","profile":"wtexans","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: newbie questions","postDate":"1287711727","msgId":57865,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk5cXE1ZitkbHZiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEwMjIzLjc1MTk0LnFtQHdlYjMwMzA3Lm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":57864,"nextInTopic":57870,"prevInTime":57864,"nextInTime":57866,"topicId":57863,"numMessagesInTopic":0,"msgSnippet":"===My example:  could you please make sure the lights are off in your room before we leave?  as we are waiting by the door to go to an appointment. Off she","messageBody":"<div id=\"ygrps-yiv-2111734522\">===My example:  &quot;could you please make sure the lights are off in your room before we leave?&quot;  as we are waiting by the door to go to an appointment. Off she stomps with eye rolling to turn of the lights.  &quot;Do you mind cleaning off your desk before tomorrow because we have company coming.  You can do it anytime.  I&#39;ll be glad to help you.&quot;  Response was tears and again stomping, slamming things into drawers, etc.===<br/>\n<br/>\nIt sounds as if there&#39;s more going on if there are tears, stomping, and slamming of drawers.<br/>\n<br/>\nHow long have you all actually been unschooling? What came before that? <br/>\n<br/>\nEven though you said you&#39;ve been letting go of expectations, the two examples you gave above *are* expectations! You&#39;re expecting your daughter to do what you ask, compliantly and without complaint.<br/>\n<br/>\nWhen we leave our house, it&#39;s not uncommon for my hubby or I to do a quick walk-through of the house, turning off lights as we go. It&#39;s something that *we* want to have done, so we do it. At age 12, it&#39;s simply not on our son&#39;s radar as something of importance. When he&#39;s an adult and living elsewhere and paying his own utility bill, he might choose to turn off all lights when leaving home . . . or he may choose *not* to. <br/>\n<br/>\nWhy does your daughter&#39;s desk HAVE to be cleaned off before company comes over? Can&#39;t the door to her room be closed instead, so that her personal space can be in whatever state of messiness or tidiness that *she* prefers?<br/>\n<br/>\nWhen you phrase something to her as &quot;do you mind...?&quot;, if she doesn&#39;t tidy her desk or take you up on your offer to help her tidy it, then she&#39;s letting you know she *does* mind . . . she prefers that it remain the way it is. You&#39;re phrasing it as a choice, but the way you stated it in writing (and perhaps verbally to your daughter, as well) is that she does *not* have a choice. <br/>\n<br/>\n<br/>\n===We try talking about how we are a family, and we help each other to make our family a success.===<br/>\n<br/>\nWhat do you consider a successful family?<br/>\n<br/>\nIf your daughter doesn&#39;t go turn off her bedroom light or tidy her desktop because you ask her to, does that truly make your family less successful?<br/>\n<br/>\n<br/>\n===I am not exactly sure what to do or why it is happening.===<br/>\n<br/>\nMy suggestion would be to be more thoughtful about the requests you make, to think about which are truly necessary and which ones you can let go of, and to think about alternative options to requests you don&#39;t feel you can let go of.<br/>\n<br/>\nExamples: Instead of asking your daughter to turn off the light to her room, be the last one out the door so you can do it yourself, or let it be left on. Instead of asking her to tidy her desk because company&#39;s coming over, ask yourself if the desk being tidy is THAT important, and what alternatives there are to tidying it (shutting the bedroom door; letting the desk remain as-is; what else?).<br/>\n<br/>\nWhat helped me tremendously when we were new to unschooling was to think before I spoke. Before I made a request to my son or husband, or before I made a snarky or off-hand comment, I thought about those words and the impact they could have if I expressed them verbally. You would not believe how many times those words never made it out of my thoughts!<br/>\n<br/>\nI still do that, although it&#39;s more of an unconscious behavior now rather than something I have to make a conscious effort to do (that&#39;s a pretty cool unexpected benefit!). <br/>\n<br/>\nThere really aren&#39;t a lot of &quot;would you do this or that?&quot; requests I make to my son or husband anymore, in great part because I let go of what I classified as &quot;important&quot; or &quot;necessary&quot;. As for the things I still deem as important or necessary, I tend to mostly do them my own self, with a side benefit of that being that when I do ask for my guys&#39; help it&#39;s given without complaint.<br/>\n<br/>\nGlenda</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] newbie questions","postDate":"1287711579","msgId":57864,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI4N0U1RkU3LTg4NDgtNDE5MC1BNkI3LTcxOUZGM0YwNzk4M0BlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDEwMjIzLjc1MTk0LnFtQHdlYjMwMzA3Lm1haWwubXVkLnlhaG9vLmNvbT4=","referencesHeader":"PDEwMjIzLjc1MTk0LnFtQHdlYjMwMzA3Lm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":57863,"nextInTopic":57865,"prevInTime":57863,"nextInTime":57865,"topicId":57863,"numMessagesInTopic":0,"msgSnippet":"Figuring out why she is responding that way might be too much for us to do at a distance, unless you have some more insight to offer. But since making even","messageBody":"<div id=\"ygrps-yiv-835127969\">Figuring out why she is responding that way might be too much for us to do at a distance, unless you have some more insight to offer. But since making even polite and reasonable requests of her is clearly triggering a negative reaction, I would suggest completely and totally stopping for a while. Give her a chance to heal and move past whatever has left her feeling sensitive. Instead of asking her to do things either cheerfully do them yourself or leave them undone. After a year or more of this, you will be probably begin to notice her stepping up to do things unasked. Then you can tentatively ask for a very occasional quick thing and remind her about a few things. Take it slow and easy. Remember that your relationship is way way way more important than getting a desk cleared off. Don&#39;t set her up for situations where you expect her response to hostile and eye rolling. Maybe when you are feeling very close, you could ask what that response is about. <br/>\n<br/>\nPam<br/>\n<br/>\nFrom my iPod<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Oct 21, 2010, at 4:39 PM, k j &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kbjones74@...\">kbjones74@...</a>&gt; wrote:<br/>\n<br/>\n&gt; I&#39;ve been lurking for quite a while, reading as much as I can to adjust to such <br/>\n&gt; a different way of thinking.  I was brought up with a much more traditional view <br/>\n&gt; of schooling and parenting.  I am trying to say &quot;yes&quot; more.  I am trying to look <br/>\n&gt; at things from the point of view of my children and what they want.  I am trying <br/>\n&gt; to let go of more and more of my expectations of what they &quot;should&quot; do.  But I <br/>\n&gt; am having trouble with my oldest who is 10 doing things with a pleasant <br/>\n&gt; attitude.  My example:  &quot;could you please make sure the lights are off in your <br/>\n&gt; room before we leave?&quot;  as we are waiting by the door to go to an appointment.  <br/>\n&gt; Off she stomps with eye rolling to turn of the lights.  &quot;Do you mind cleaning <br/>\n&gt; off your desk before tomorrow because we have company coming.  You can do it <br/>\n&gt; anytime.  I&#39;ll be glad to help you.&quot;  Response was tears and again stomping, <br/>\n&gt; slamming things into drawers, etc.  I try very hard to do their requests happily <br/>\n&gt; and quickly, even though I may be in the middle of something else.  I don&#39;t feel <br/>\n&gt; I am asking anything different or more than I would ask my husband or anything <br/>\n&gt; he would ask me.  We try talking about how we are a family, and we help each <br/>\n&gt; other to make our family a success.    I am not exactly sure what to do or why <br/>\n&gt; it is happening.  So I would like some advise.  Thank you.<br/>\n&gt; Kristi<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":119201959,"authorName":"k j","from":"k j &lt;kbjones74@...&gt;","profile":"kbjones74","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"newbie questions","postDate":"1287704386","msgId":57863,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEwMjIzLjc1MTk0LnFtQHdlYjMwMzA3Lm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":0,"nextInTopic":57864,"prevInTime":57862,"nextInTime":57864,"topicId":57863,"numMessagesInTopic":0,"msgSnippet":"I ve been lurking for quite a while, reading as much as I can to adjust to such a different way of thinking.  I was brought up with a much more traditional","messageBody":"<div id=\"ygrps-yiv-1394897902\">I&#39;ve been lurking for quite a while, reading as much as I can to adjust to such <br/>\na different way of thinking.  I was brought up with a much more traditional view <br/>\nof schooling and parenting.  I am trying to say &quot;yes&quot; more.  I am trying to look <br/>\nat things from the point of view of my children and what they want.  I am trying <br/>\nto let go of more and more of my expectations of what they &quot;should&quot; do.  But I <br/>\nam having trouble with my oldest who is 10 doing things with a pleasant <br/>\nattitude.  My example:  &quot;could you please make sure the lights are off in your <br/>\nroom before we leave?&quot;  as we are waiting by the door to go to an appointment.  <br/>\nOff she stomps with eye rolling to turn of the lights.  &quot;Do you mind cleaning <br/>\noff your desk before tomorrow because we have company coming.  You can do it <br/>\nanytime.  I&#39;ll be glad to help you.&quot;  Response was tears and again stomping, <br/>\nslamming things into drawers, etc.  I try very hard to do their requests happily <br/>\nand quickly, even though I may be in the middle of something else.  I don&#39;t feel <br/>\nI am asking anything different or more than I would ask my husband or anything <br/>\nhe would ask me.  We try talking about how we are a family, and we help each <br/>\nother to make our family a success.    I am not exactly sure what to do or why <br/>\nit is happening.  So I would like some advise.  Thank you.<br/>\nKristi<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":57810,"nextTopicId":57850}}