{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":46,"messages":[{"userId":74604204,"authorName":"Deborah Lewis","from":"Deborah Lewis &lt;ddzimlew@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Low self-esteem? was Balance","postDate":"1040185156","msgId":52117,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIxMjE3LjIxMTkxNi4xNzQ0LjYuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":52116,"nextInTopic":52118,"prevInTime":52116,"nextInTime":52118,"topicId":51517,"numMessagesInTopic":0,"msgSnippet":"Yol, I m glad you stayed. We may not come to full agreement here but that s alright. I realize you thought my comment about low self esteem was meant to be ","messageBody":"<div id=\"ygrps-yiv-988973782\">Yol,<br/>\nI&#39;m glad you stayed.<br/>\nWe may not come to full agreement here but that&#39;s alright.  <br/>\nI realize you thought my comment about low self esteem was meant to be<br/>\ninsulting.<br/>\nThat wasn&#39;t my intention.  It has been my observation that people, women<br/>\nfriends of mine, who suffer from low self esteem feel insulted easily,<br/>\nand when no insult was given.  Similar to the way a woman who is abused<br/>\nflinches when someone raises a hand quickly.<br/>\nI wasn&#39;t making a crack about it, I was thinking out loud and trying to<br/>\nunderstand.   <br/>\nI was considering the possibility.   You don&#39;t have to agree.&lt;g&gt;<br/>\n<br/>\nI hope you can imaging me sounding gentle here, calm and interested and<br/>\nnot snarky.  <br/>\n<br/>\nI think I understand your point about meditation, that you wouldn&#39;t tell<br/>\nsomeone they had been doing it wrong when they come to you.   I<br/>\nunderstand keeping someone on the path, even if there isn&#39;t full<br/>\nunderstanding, because the path itself will eventually lead there.   But<br/>\nwhat if, once they&#39;re at your clinic they continued to practice in a way<br/>\nthat won&#39;t  move them forward?    Would you tell them then that they<br/>\nmight have to give up some old practices to understand the new ones?  <br/>\nHow would you encourage them to stretch beyond what they are comfortable<br/>\nwith?    And how would you translate that to helping someone make a<br/>\nstretch in unschooling?   If a mother was here trying to understand<br/>\nunschooling philosophies, but posting about spanking, how would you tell<br/>\nher she should stop spanking, or would you tell her at all?<br/>\n<br/>\nOne thing about the people offering advice here is that they don&#39;t want<br/>\none more child to have one more spanking.  If there is a good time to<br/>\nstop it&#39;s right now, this very minute, not in two months when the mother<br/>\nis finally beginning to understand, so many don&#39;t waste one minute saying<br/>\n&quot;STOP!   There&#39;s a better way and you can change everything right now.&quot;  <br/>\nOf course it&#39;s not all about spanking, but it&#39;s the same idea.  Do you<br/>\nsee that?   Maybe I&#39;m not being very clear. <br/>\n<br/>\nAnd as you said you wouldn&#39;t tell people who come to your meditation<br/>\ncenter that their previous experience wasn&#39;t really meditation  how do<br/>\nyou reconcile that with telling those here offering help, that they are<br/>\nnot really helpful?    Maybe you&#39;ll think this is a stretch on my part.<br/>\nYou might be right. &lt;g&gt;   My brain is not functioning at its highest<br/>\nlevel today.  <br/>\n<br/>\nI like the way you talk about your daughter.&lt;g&gt;  I&#39;m the only unschooler<br/>\nin my little town, and most of the talk I hear about and to children is<br/>\nnot nearly so loving and thoughtful.   <br/>\nI understand you&#39;re sensitivity.  I am the same way I think.  I wouldn&#39;t<br/>\nlike to hear someone tell me I&#39;m not conscious parent.   I guess we<br/>\ndiffer in our understanding though, of what people here are really saying<br/>\nwhen they suggest we make a stretch.   I don&#39;t hear them saying &quot;you&#39;re<br/>\ndoing it all wrong&quot;   I hear, &quot;it could be even better.&quot;    What is the<br/>\ndifference in us, do you think, that you feel it&#39;s personal and I don&#39;t? <br/>\n <br/>\n<br/>\nSome things I have changed about my parenting HAVE been very personal. <br/>\nSome understandings I have come to have been painful.   I suppose there<br/>\nis no way to look closely at ourselves and not be ashamed of some of the<br/>\nthings we find.    I have had my parenting criticized and it&#39;s not nice. <br/>\nBut I really don&#39;t think that&#39;s the same thing as what happens here.   I<br/>\nthink some of the discussions can inspire us to look more deeply at<br/>\nourselves and maybe find those things we&#39;re not proud of, but I don&#39;t<br/>\nthink the other parents here are telling anyone they are bad.    This may<br/>\nbe that place where we can&#39;t agree. &lt;g&gt;   <br/>\n<br/>\nI really am glad you&#39;re still here.  I have enjoyed your posts, I have<br/>\nfound your point of view on many things to be very interesting and I have<br/>\nappreciated your knowledge.   <br/>\n<br/>\nDeb L</div>","specialLinks":[]},{"userId":129256077,"authorName":"Yol, Vishnu & Shanti","from":"&quot;Yol, Vishnu & Shanti&quot; &lt;bluelotus@...&gt;","profile":"yolswandass","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Low self-esteem? was Balance","postDate":"1040184830","msgId":52116,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNERkZGNUZELkNCOTQzNTVFQGF0dC5uZXQ+","referencesHeader":"PDEwNDAwMDI5NDkuMTczMi42MTY0MC5tOUB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":52103,"nextInTopic":52117,"prevInTime":52115,"nextInTime":52117,"topicId":51517,"numMessagesInTopic":0,"msgSnippet":"... No, that is a wrong assumption. I happen to be on several lists and some people on other lists are or have been here as well. Someone  mentioned this one,","messageBody":"<div id=\"ygrps-yiv-921640734\"><blockquote><span title=\"ireply\">&gt; &gt; Again, lack of self-awareness... Never mind... I hardly doubt I will stick<br/>\n&gt; &gt; much longer in this clique. I&#39;ve heard people on other lists express the<br/>\n&gt; &gt; same things about you guys I see for<br/>\n&gt; &gt; myself. Except that I call it lack of self-awareness and they have much<br/>\n&gt; &gt; harsher words for it.<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; OH!!!! Now I see! Did you actually come here with a notion of what you&#39;d<br/>\n&gt; find? Did you come here because you wanted to see what &quot;the others&#39;&quot; were<br/>\n&gt; talking about?<br/>\n&gt; You came here looking for trouble. You stirred stuff up.<br/>\n<br/>\n&gt; Go back to your other lists and talk all you want.<br/>\n&gt; If you come to an email list  looking for a &quot;fight&quot; you&#39;ll find one. At ANY<br/>\n&gt; list.<br/>\n<br/>\n </span></blockquote>No, that is a wrong assumption. I happen to be on several lists and some people on other lists are or have been here as well. Someone  mentioned this one, and so on... I was already here. And no, I didn&#39;t come looking for trouble. And no, I am not fighting, I was simply expressing my opinion, just like everyone else in here.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;  You are what is known on email lists and newsgroups as a Troll<br/>\n<br/>\n </span></blockquote>I don&#39;t think so. You are making wrong assumptions. And if calling me a troll is meant to be an insult (it&#39;s the first time I hear that word), well... that&#39;s your choice.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Elissa<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>--<br/>\nBlue Lotus Therapeutics<br/>\nAyurveda, Homeopathy, Yoga and Therapeutic Massage.<br/>\nAsheville/Weaverville, NC<br/>\nwww.bluelotustherapeutics.com<br/>\n<br/>\nDhyanyoga Center of North Carolina<br/>\nMeditation - Kundalini Maha Yoga<br/>\nWeaverville, NC<br/>\nwww.dyc-nc.org<br/>\n<br/>\n***********************************<br/>\nWhen nothing is done, nothing is left undone. The world is ruled by letting things take their course. It cannot be ruled by interfering.<br/>\n-- Tao Te Ching<br/>\n***********************************<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":129256077,"authorName":"Yol, Vishnu & Shanti","from":"&quot;Yol, Vishnu & Shanti&quot; &lt;bluelotus@...&gt;","profile":"yolswandass","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Low self-esteem? was Balance","postDate":"1040177607","msgId":52103,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNERkZEOUM3LkVDNjQ1MzEwQGF0dC5uZXQ+","referencesHeader":"PDEwMzk5OTMyNzUuMTY3Mi41NTk4NC5tMTFAeWFob29ncm91cHMuY29tPg=="},"prevInTopic":51773,"nextInTopic":52116,"prevInTime":52102,"nextInTime":52104,"topicId":51517,"numMessagesInTopic":0,"msgSnippet":"Deb, First of all, I want to thank you for your reply. It seems that you do want to come to a mutual understanding, instead of just writing me off, labeling,","messageBody":"<div id=\"ygrps-yiv-1219998324\">Deb,<br/>\n<br/>\nFirst of all, I want to thank you for your reply. It seems that you do want to come to a mutual understanding, instead of just writing me off, labeling, of treating me like a kid who knows nothing about unschooling or this list, etc. I consider this a much more mature reaction than all the previous ones (yours and others&#39;) to my posts. And I truly appreciate that.<br/>\n<br/>\nSecond, I never felt *I* was picked on. But I have observed the attitude I was criticizing since I joined this list. So, no apology needed there. It was a general observation on the dynamics of this list, not a personal defense in particular. I do not take things so personally when it comes to e-lists, because to be totally honest with you, I don&#39;t care much about what others think of me. I&#39;ve always been what you may call *unconventional*<br/>\nand I tend to have very strong opinions about things.<br/>\n<br/>\nTo follow on your example of yoga, there is so much so-called yoga out there it&#39;s pretty amazing. It&#39;s become one of the best business in this country. have you noticed they use yoga postures to advertise everything now? Do I consider *that* to be yoga? No, of course. I am part of an ancient lineage where yoga still means &quot;union with God,&quot; where yoga is a series of sacred practices that lead to meditation and liberation, not the latest fad<br/>\nto to get a *sexy body* or *be cool* or things like that. We call that bhoga (or &quot;experience of the world&quot;).<br/>\n<br/>\nYet I know it&#39;s human nature to bend and distort and use and misuse everything we find. So, who am I to say &quot;This is yoga and this is not. You&#39;re wrong.&quot; It would just be my ego talking, and that would not be very yogic, right? We host a meditation center here in NC. Am I going to say, &quot;What you have been doing so far is not meditation!&quot;? NO, I take people from where they&#39;re at and move forward WITH them, sharing practices, tricks,<br/>\nexperiences, whatever. Otherwise they would leave and never come back, right?<br/>\n<br/>\nWhat I mean here is that if you follow an *unschooling* philosophy (which I think I do, regardless of what the &quot;experts&quot; may say), then it must be a philosophy of your whole life, of how you talk and relate to your kids, to your spouses, to your fellow homeschoolers, to your fellow list participants, and to life. That&#39;s what made me wonder if it was worth being on this list. I truly believe that if you want to unschool you need<br/>\nself-awareness: self-awarenes of your own school-trained mind, of the tendencies you grew up and were raised with, of all the crap you absorbed from your parents, siblings, teachers, partners, etc., that creeps up on you when you are faced with the responsibility of being a conscious parent and an unschooler. The way I see it, you have to constantly keep an eye on yourself because that&#39;s an important part of what your kids are learning.<br/>\n<br/>\nPerhaps I expected more self-awareness from this list. My mistake, I suppose. And my mistake again to try to bring it to the attention of its participants.<br/>\n<br/>\nI am a conscious parent, and I believe in unschooling as much as I believe in Rousseau&#39;s or Holt&#39;s ideas, the continuum concept, breastfeeding my daughter on demand til she was 4, having a family bed, and respecting her needs, her inner intelligence and her choices. And yes, I interrupt my conversations when she needs to tell me something because I consider she has less control over her impulses and I want her to feel heard and respected<br/>\nlike any adult. Or else, I ask her politely to wait a minute. I&#39;ve seen mothers almost spank their kids because they want to stop their dance class and go pee! I take my daughter seriously, her needs, her desires, her thoughts, her imaginations, her feelings, you name it. To me, that&#39;s unschooling. I would never say to her, listen, you haven&#39;t been on Earth long enough to understand what this is all about. I thrive on watching her unfold<br/>\nand discover for herself. So, I don&#39;t like it when someone here says that to me or someone else either. I hope you can understand that.<br/>\n<br/>\nI appreciate you wanting me to stay and participate. I am still here. I think it&#39;s important to have a place where we can share, learn and support each other in the choices we&#39;ve made for ourselves and our children.<br/>\n<br/>\nRegards,<br/>\n<br/>\nYol<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; ***What I&#39;m saying is that you guys need to check your hollier-than-thou<br/>\n&gt; attitude. In other words, it seems that you&#39;re trying to *teach*<br/>\n&gt; newcomers how to<br/>\n&gt; unschool, but you can have a different attitude with the people<br/>\n&gt; who-have-been-here-long-enough. It&#39;s a question of self-awareness, but of<br/>\n&gt; course that&#39;s an individual thing. I cannot make you se what you<br/>\n&gt; don&#39;t want to see. You guys are perhaps a little too defensive about YOUR<br/>\n&gt; concept of unschooling.***<br/>\n&gt;<br/>\n&gt; Yol, If I said to you, I love yoga, and I&#39;ve learned a lot and I really,<br/>\n&gt; really think it&#39;s the right thing for me, and I told you I practiced it<br/>\n&gt; by sitting in a half lotus at a cock fight while shooting up, (why do I<br/>\n&gt; persist in these horrible analogies?)  don&#39;t you think you would feel<br/>\n&gt; inclined to tell me I might not have the best understanding of yoga?<br/>\n&gt; Wouldn&#39;t you want to let me know that yoga can be so much more than a<br/>\n&gt; sitting posture, that it could in fact, be a life changing experience if<br/>\n&gt; only I&#39;d open my mind to all the possibilities?<br/>\n&gt; If you and I have such a different concept of yoga, would you be silent<br/>\n&gt; while I helped others find yoga the way I know it? Would that be the best<br/>\n&gt; yoga help they could get?   Or would it be better to hear more, and think<br/>\n&gt; of more possibilities?<br/>\n&gt;<br/>\n&gt; Because someone knows more possibilities of unschooling doesn&#39;t make them<br/>\n&gt; better people.   I&#39;ve never gotten the impression here that anyone thinks<br/>\n&gt; of themselves as better human beings than others.   But like all things<br/>\n&gt; some can have more experience, some can have broader understanding, some<br/>\n&gt; can have better ideas.   No one here is looking down on you.  You don&#39;t<br/>\n&gt; want my cheap (free!) psychoanalyses so I won&#39;t give it (but just barely)<br/>\n&gt; but no one thinks they are better than you are.<br/>\n&gt;<br/>\n&gt; I&#39;m sorry you have felt picked on.   I really think we would miss your<br/>\n&gt; contribution if you left.<br/>\n&gt;<br/>\n&gt; Deb L<br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>--<br/>\nBlue Lotus Therapeutics<br/>\nAyurveda, Homeopathy, Yoga and Therapeutic Massage.<br/>\nAsheville/Weaverville, NC<br/>\nwww.bluelotustherapeutics.com<br/>\n<br/>\nDhyanyoga Center of North Carolina<br/>\nMeditation - Kundalini Maha Yoga<br/>\nWeaverville, NC<br/>\nwww.dyc-nc.org<br/>\n<br/>\n***********************************<br/>\nWhen nothing is done, nothing is left undone. The world is ruled by letting things take their course. It cannot be ruled by interfering.<br/>\n-- Tao Te Ching<br/>\n***********************************<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":117369878,"authorName":"Kelli Traaseth","from":"Kelli Traaseth &lt;kellitraas@...&gt;","profile":"kellitraas","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] yoga reference","postDate":"1040048448","msgId":51773,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIxMjE2MTQyMDQ4LjI0NDg4LnFtYWlsQHdlYjQwMTA5Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PEYxODRiZko4VnJSUXZYbGFvWTkwMDAxMDUzNkBob3RtYWlsLmNvbT4="},"prevInTopic":51755,"nextInTopic":52103,"prevInTime":51772,"nextInTime":51774,"topicId":51517,"numMessagesInTopic":0,"msgSnippet":"Deb, I thought this analogy was great, I am just beginning my journey with yoga, so I m not trying to pass judgement.   I am only relaying some of my thoughts.","messageBody":"<div id=\"ygrps-yiv-1780534149\">Deb,  <br/>\n <br/>\nI thought this analogy was great,  <br/>\n <br/>\nI am just beginning my journey with yoga, so I&#39;m not trying to pass judgement.   I am only relaying some of my thoughts.   <br/>\n <br/>\nAlot of what I&#39;ve been reading on yoga doesn&#39;t jive with negativity,       I guess when I get caught up in negative or critical thinking,   I think--is this the way Patanjali (a great yogi)  would have acted or spoke?<br/>\n <br/>\nIts very hard to see past our own internal feelings and see what is actually happening.  I would guess that it is especially hard to see actuality on a computer screen.<br/>\n <br/>\nKind-of off the topic of unschooling, yet it has enabled me to stop and see my kids for who they are, not for who I want them to be.<br/>\n <br/>\nKelli<br/>\n <br/>\n Mary Bianco &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mummyone24@...\">mummyone24@...</a>&gt; wrote:&gt;From: Deborah Lewis &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ddzimlew@...\">ddzimlew@...</a>&gt;<br/>\n<br/>\n(snip) &lt;&lt;Yol, If I said to you, I love yoga, and I&#39;ve learned a lot and I <br/>\nreally, really think it&#39;s the right thing for me, and I told you I practiced <br/>\nit by sitting in a half lotus at a cock fight while shooting up,&gt;&gt;<br/>\n<br/>\nDeb L, I&#39;ve loved a lot of things you have said on this list, but this one <br/>\neven creeps me out! LOL!!!!!<br/>\n<br/>\nMary B<br/>\n<br/>\n_________________________________________________________________<br/>\nHelp STOP SPAM with the new MSN 8 and get 2 months FREE*  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://join.msn.com/?page=features/junkmail\">http://join.msn.com/?page=features/junkmail</a><br/>\n<br/>\n<br/>\n~~~~ Don&#39;t forget! If you change topics, change the subject line! ~~~~<br/>\n<br/>\nIf you have questions, concerns or problems with this list, please email the moderator, Joyce Fetteroll (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a>), or the list owner, Helen Hegener (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Editor@...\">HEM-Editor@...</a>).<br/>\n<br/>\nTo unsubscribe from this group, click on the following link or address an email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-unsubscribe@yahoogroups.com\">Unschooling-dotcom-unsubscribe@yahoogroups.com</a> <br/>\n<br/>\nVisit the Unschooling website: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> <br/>\n<br/>\nYour use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\nYahoo! Mail Plus - Powerful. Affordable. Sign up now<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":128307542,"authorName":"Earthmomma67@aol.com","from":"Earthmomma67@...","profile":"elissajc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Low self-esteem? was Balance","postDate":"1040045183","msgId":51755,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGFiLjI2OWUxMGM5LjJiMmYyZTdmQGFvbC5jb20+"},"prevInTopic":51746,"nextInTopic":51773,"prevInTime":51754,"nextInTime":51756,"topicId":51517,"numMessagesInTopic":0,"msgSnippet":"In a message dated 12/15/02 8:11:39 PM Eastern Standard Time, grlynbl@aol.com ... OK, How long has Yol been here? You have a tendacy to make snap judgements. ","messageBody":"<div id=\"ygrps-yiv-1058300870\">In a message dated 12/15/02 8:11:39 PM Eastern Standard Time, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:grlynbl@...\">grlynbl@...</a> <br/>\nwrites:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I dont think you know how long Yol has been here and what all she has <br/>\n&gt; contributed.  <br/>\n<br/>\n </span></blockquote>OK, How long has Yol been here?<br/>\nYou have a tendacy to make snap judgements.   <br/>\n<br/>\nHow do you know this?<br/>\nNow if Joyce or <br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Sandry or Ren  responds that Yol is a worthy and welcome member, i am sure <br/>\n&gt; you will start kissing Yol&#39;s butt like its covered in honey<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I doubt it.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Teresa<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":74604204,"authorName":"Deborah Lewis","from":"Deborah Lewis &lt;ddzimlew@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Low self-esteem? was Balance","postDate":"1040040456","msgId":51746,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIxMjE2LjA1MDczNy4xNDg4LjAuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":51727,"nextInTopic":51755,"prevInTime":51745,"nextInTime":51747,"topicId":51517,"numMessagesInTopic":0,"msgSnippet":"***Deb L, I ve loved a lot of things you have said on this list, but this one even creeps me out! LOL!!!!!*** Mary......come to the dark side......  Deb L,","messageBody":"<div id=\"ygrps-yiv-1704595728\">***Deb L, I&#39;ve loved a lot of things you have said on this list, but this<br/>\none <br/>\neven creeps me out! LOL!!!!!***<br/>\n<br/>\nMary......come to the dark side......<br/>\n<br/>\n&lt;G&gt;<br/>\nDeb L, who never did either of those nasty things, if that helps ease the<br/>\ncreeps.</div>","specialLinks":[]},{"userId":99826381,"authorName":"Mary Bianco","from":"&quot;Mary Bianco&quot; &lt;mummyone24@...&gt;","profile":"mummyone24","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Low self-esteem? was Balance","postDate":"1040018686","msgId":51727,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYxODRiZko4VnJSUXZYbGFvWTkwMDAxMDUzNkBob3RtYWlsLmNvbT4="},"prevInTopic":51706,"nextInTopic":51746,"prevInTime":51726,"nextInTime":51728,"topicId":51517,"numMessagesInTopic":0,"msgSnippet":"... (snip) ","messageBody":"<div id=\"ygrps-yiv-380046637\"><blockquote><span title=\"ireply\">&gt;From: Deborah Lewis &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ddzimlew@...\">ddzimlew@...</a>&gt;<br/>\n<br/>\n </span></blockquote>(snip) &lt;&lt;Yol, If I said to you, I love yoga, and I&#39;ve learned a lot and I <br/>\nreally, really think it&#39;s the right thing for me, and I told you I practiced <br/>\nit by sitting in a half lotus at a cock fight while shooting up,&gt;&gt;<br/>\n<br/>\nDeb L, I&#39;ve loved a lot of things you have said on this list, but this one <br/>\neven creeps me out! LOL!!!!!<br/>\n<br/>\nMary B<br/>\n<br/>\n_________________________________________________________________<br/>\nHelp STOP SPAM with the new MSN 8 and get 2 months FREE*  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://join.msn.com/?page=features/junkmail\">http://join.msn.com/?page=features/junkmail</a></div>","specialLinks":[]},{"userId":56051484,"authorName":"grlynbl@aol.com","from":"grlynbl@...","profile":"jaeschool","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Low self-esteem? was Balance","postDate":"1040009562","msgId":51706,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY5LjI2ZDJhNzAxLjJiMmVhMzVhQGFvbC5jb20+"},"prevInTopic":51703,"nextInTopic":51727,"prevInTime":51705,"nextInTime":51707,"topicId":51517,"numMessagesInTopic":0,"msgSnippet":"In a message dated 12/15/02 9:46:32 PM Eastern Standard Time, ... I think a big part of the conflict is that folks have not followed the thread closely ( not","messageBody":"<div id=\"ygrps-yiv-378488844\">In a message dated 12/15/02 9:46:32 PM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:robin9700@...\">robin9700@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  Although I do not remember who said what and to whom and first, I have <br/>\n&gt; perceived that both &quot;sides&quot; have hit below the belt. I am not on either <br/>\n&gt; side. <br/>\n<br/>\n </span></blockquote>I think a big part of the conflict is that folks have not followed the thread <br/>\nclosely ( not just you)  I have never percieved you as &quot;for or against&quot; <br/>\neither side or viewpoint.. I do appreciate that you have been able to express <br/>\nsome points that have eluded me.   I have felt like you offered some real <br/>\nlife situations that some folks want to sugar coat or pretend do not exist.   <br/>\nThanks again<br/>\n<br/>\nTeresa<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":56051484,"authorName":"grlynbl@aol.com","from":"grlynbl@...","profile":"jaeschool","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Low self-esteem? was Balance","postDate":"1040008621","msgId":51703,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQzLjE2OGIxZmY1LjJiMmU5ZmFkQGFvbC5jb20+"},"prevInTopic":51700,"nextInTopic":51706,"prevInTime":51702,"nextInTime":51704,"topicId":51517,"numMessagesInTopic":0,"msgSnippet":"In a message dated 12/15/02 8:44:10 PM Eastern Standard Time, ... Since responses are aimed at the general audience Please clarify to whom you are addressing","messageBody":"<div id=\"ygrps-yiv-1501233258\">In a message dated 12/15/02 8:44:10 PM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ddzimlew@...\">ddzimlew@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Please take a deep breath.   Please consider how you are going to feel<br/>\n&gt; when the weight of what you&#39;ve posted here is pressing on you sometime in<br/>\n&gt; the next day or so.  It is so easy to get lost in anger.<br/>\n&gt; <br/>\n&gt; If you are sure, despite calm suggestions to the contrary, that you have<br/>\n&gt; been treated badly by a group of immature egotists, then step higher on<br/>\n&gt; the ladder and be a shining example of maturity and decency.   You won&#39;t<br/>\n&gt; be sorry you were big enough to let it go.   <br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Since responses are aimed at the &quot;general audience&quot; Please clarify to whom <br/>\nyou are addressing this post.  I hope to God you mean Elissa.  Did you read <br/>\nwhat she said about Yol??????  Why cant she be the bigger better individual?? <br/>\n <br/>\n<br/>\nTeresa<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":118199625,"authorName":"robin9700@cs.com","from":"robin9700@...","profile":"teacher9700","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Low self-esteem? was Balance","postDate":"1040006716","msgId":51700,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNFRTQ2NTM0LjRCRTMzOTBFLjAzNDk1RUM2QGNzLmNvbT4="},"prevInTopic":51697,"nextInTopic":51703,"prevInTime":51699,"nextInTime":51701,"topicId":51517,"numMessagesInTopic":0,"msgSnippet":"... The statement I made is a universal statement, and it applies to me , asl well.  I think that maybe you are seeking validation for your observations","messageBody":"<div id=\"ygrps-yiv-504113421\"><a rel=\"nofollow\" target=\"_blank\" href=\"mailto:grlynbl@...\">grlynbl@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; In a message dated 12/15/02 7:09:07 PM Eastern Standard Time, <br/>\n&gt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:robin9700@...\">robin9700@...</a> writes:<br/>\n&gt;<br/>\n&gt;gt; Maybe she came here becasue her heartnbsp; and her mind are seeking a <br/>\n&gt;gt; resolution... Neither of us can really know, though.. Only she.nbsp; I think <br/>\n&gt;gt; that <br/>\n&gt;gt; is only for her to say.<br/>\n&gt;gt; What are you seeking by engaging?nbsp; <br/>\n&gt;gt; <br/>\n&gt;gt; Robin S.<br/>\n&gt;gt; <br/>\n&gt;<br/>\n&gt;I have to agree here.. A troll does look for trouble, instigates it, <br/>\n&gt;perpetuates it.nbsp; You are the one trolling. and flaming others too.<br/>\n&gt;<br/>\n&gt;Teresa,,&lt;&lt;<br/>\n<br/>\n </span></blockquote>The statement I made is a universal statement, and it applies to me , asl well.  I think that maybe you are seeking validation for your observations regarding the tone of the responses that you have received.  Although I do not remember who said what and to whom and first, I have perceived that both &quot;sides&quot; have hit below the belt. I am not on either side. Sometimes the best defense is no defense....one can choose to not take offense/defense (no matter how &quot;appealingly&quot; it is dished ouit!).  Ignore some of those voices and put some on &quot;the back burner&quot; to consider in time (your choice) on the way to refining your own truth...and that can change with time and experience (for everyone)...that&#39;s a good thing.<br/>\n<br/>\nBlessings and peace to you,<br/>\nRobin S.<br/>\n<blockquote><span title=\"qreply\"> &gt;<br/>\n&gt;<br/>\n&gt;[Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt; <br/>\n&gt; ~~~~ Don&#39;t forget! If you change topics, change the subject line! ~~~~<br/>\n&gt;<br/>\n&gt;If you have questions, concerns or problems with this list, please email the moderator, Joyce Fetteroll (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a>), or the list owner, Helen Hegener (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Editor@...\">HEM-Editor@...</a>).<br/>\n&gt;<br/>\n&gt;To unsubscribe from this group, click on the following link or address an email to:<br/>\n&gt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-unsubscribe@yahoogroups.com\">Unschooling-dotcom-unsubscribe@yahoogroups.com</a> <br/>\n&gt;<br/>\n&gt;Visit the Unschooling website: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> <br/>\n&gt;<br/>\n&gt;Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Being mean and hurtful","postDate":"1040004809","msgId":51697,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBMjJBMEY5LjEwQTk2JWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDE0NC41MzIzY2Q0LjJiMmU4MjkxQGFvbC5jb20+"},"prevInTopic":51693,"nextInTopic":51700,"prevInTime":51696,"nextInTime":51698,"topicId":51517,"numMessagesInTopic":0,"msgSnippet":"I ll follow Deb s lead and second the taking a deep breath. We re each responsible for the tone of the list. And I think we re all mature enough to handle","messageBody":"<div id=\"ygrps-yiv-1298629605\">I&#39;ll follow Deb&#39;s lead and second the taking a deep breath.<br/>\n<br/>\nWe&#39;re each responsible for the tone of the list.<br/>\n<br/>\nAnd I think we&#39;re all mature enough to handle insults to us or to the list<br/>\ncalmly and rationally without responding in kind. Paraphrasing Deb: don&#39;t<br/>\nstoop to the level you feel someone should be reprimanded for.<br/>\n<br/>\nAnneO posted this to the boards today:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I had four questions to ask yourself when you are able to stop and NOT yell (I<br/>\n&gt; believe they&#39;re from the book [Everyday Blessings by Jon Kabat-Zinn] I<br/>\n </span></blockquote>mentioned above): <br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; 1) Why am I reacting so strongly in this situation?<br/>\n&gt; <br/>\n&gt; 2) Where is this going to take me if I continue in this direction?<br/>\n&gt; <br/>\n&gt; 3) What does my child REALLY need from me right now?<br/>\n&gt; <br/>\n&gt; 4) What are my other choices besides this intense emotion that I&#39;m feeling?<br/>\n<br/>\n </span></blockquote>I think we could find ways those apply to responding to the list.<br/>\n<br/>\nJoyce<br/>\nUnschooling-dotcom moderator</div>","specialLinks":[]},{"userId":74604204,"authorName":"Deborah Lewis","from":"Deborah Lewis &lt;ddzimlew@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Low self-esteem? was Balance","postDate":"1040002929","msgId":51693,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIxMjE1LjE4NDIwOS4xNTQ0LjcuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":51691,"nextInTopic":51697,"prevInTime":51692,"nextInTime":51694,"topicId":51517,"numMessagesInTopic":0,"msgSnippet":"***I dont think you know how long Yol has been here and what all she has contributed.  You have a tendacy to make snap judgements.   Now if Joyce or Sandry or","messageBody":"<div id=\"ygrps-yiv-47576908\">***I dont think you know how long Yol has been here and what all she has <br/>\ncontributed.  You have a tendacy to make snap judgements.   Now if Joyce<br/>\nor <br/>\nSandry or Ren  responds that Yol is a worthy and welcome member, i am<br/>\nsure <br/>\nyou will start kissing Yol&#39;s butt like its covered in honey***<br/>\n<br/>\nPlease take a deep breath.   Please consider how you are going to feel<br/>\nwhen the weight of what you&#39;ve posted here is pressing on you sometime in<br/>\nthe next day or so.  It is so easy to get lost in anger.<br/>\n<br/>\nIf you are sure, despite calm suggestions to the contrary, that you have<br/>\nbeen treated badly by a group of immature egotists, then step higher on<br/>\nthe ladder and be a shining example of maturity and decency.   You won&#39;t<br/>\nbe sorry you were big enough to let it go.   <br/>\n<br/>\nDeb L</div>","specialLinks":[]},{"userId":56051484,"authorName":"grlynbl@aol.com","from":"grlynbl@...","profile":"jaeschool","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Low self-esteem? was Balance","postDate":"1040001169","msgId":51691,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0NC41MzIzY2Q0LjJiMmU4MjkxQGFvbC5jb20+"},"prevInTopic":51689,"nextInTopic":51693,"prevInTime":51690,"nextInTime":51692,"topicId":51517,"numMessagesInTopic":0,"msgSnippet":"In a message dated 12/15/02 7:29:30 PM Eastern Standard Time, ... I dont think you know how long Yol has been here and what all she has contributed.  You have","messageBody":"<div id=\"ygrps-yiv-852836670\">In a message dated 12/15/02 7:29:30 PM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Earthmomma67@...\">Earthmomma67@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; She came here, immediately became defensive and snarky. Then lets slip that <br/>\n&gt; she already knew what the list would be like. I think she came with <br/>\n&gt; preconceived notions and will report back that all her otehr &quot;unschooling&quot; <br/>\n&gt; friends were right about this list.<br/>\n&gt; Eissa<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I dont think you know how long Yol has been here and what all she has <br/>\ncontributed.  You have a tendacy to make snap judgements.   Now if Joyce or <br/>\nSandry or Ren  responds that Yol is a worthy and welcome member, i am sure <br/>\nyou will start kissing Yol&#39;s butt like its covered in honey<br/>\n<br/>\nTeresa<br/>\n<br/>\nTeresa<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":56051484,"authorName":"grlynbl@aol.com","from":"grlynbl@...","profile":"jaeschool","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Low self-esteem? was Balance","postDate":"1040000768","msgId":51689,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY1LjQ4Zjk0YTUuMmIyZTgxMDBAYW9sLmNvbT4="},"prevInTopic":51688,"nextInTopic":51691,"prevInTime":51688,"nextInTime":51690,"topicId":51517,"numMessagesInTopic":0,"msgSnippet":"In a message dated 12/15/02 7:09:07 PM Eastern Standard Time, ... I have to agree here.. A troll does look for trouble, instigates it, perpetuates it.  You are","messageBody":"<div id=\"ygrps-yiv-35056395\">In a message dated 12/15/02 7:09:07 PM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:robin9700@...\">robin9700@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Maybe she came here becasue her heart  and her mind are seeking a <br/>\n&gt; resolution... Neither of us can really know, though.. Only she.  I think <br/>\n&gt; that <br/>\n&gt; is only for her to say.<br/>\n&gt; What are you seeking by engaging?  <br/>\n&gt; <br/>\n&gt; Robin S.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I have to agree here.. A troll does look for trouble, instigates it, <br/>\nperpetuates it.  You are the one trolling. and flaming others too.<br/>\n<br/>\nTeresa<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":56051484,"authorName":"grlynbl@aol.com","from":"grlynbl@...","profile":"jaeschool","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Low self-esteem? was Balance","postDate":"1040000684","msgId":51688,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5ZS5kYjM3NjU3LjJiMmU4MGFjQGFvbC5jb20+"},"prevInTopic":51683,"nextInTopic":51689,"prevInTime":51687,"nextInTime":51689,"topicId":51517,"numMessagesInTopic":0,"msgSnippet":"In a message dated 12/15/02 6:55:47 PM Eastern Standard Time, ... When someone says things like this, I dont understand why others dont  say something about","messageBody":"<div id=\"ygrps-yiv-768199361\">In a message dated 12/15/02 6:55:47 PM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Earthmomma67@...\">Earthmomma67@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; OH!!!! Now I see! Did you actually come here with a notion of what you&#39;d <br/>\n&gt; find? Did you come here because you wanted to see what &quot;the others&#39;&quot; were <br/>\n&gt; talking about? <br/>\n&gt; You came here looking for trouble. You stirred stuff up.<br/>\n&gt; Go back to your other lists and talk all you want. <br/>\n&gt; If you come to an email list  looking for a &quot;fight&quot; you&#39;ll find one. At ANY <br/>\n&gt; <br/>\n&gt; list.<br/>\n&gt; You are what is known on email lists and newsgroups as a Troll<br/>\n&gt; Elissa<br/>\n&gt; <br/>\n <br/>\n<br/>\n </span></blockquote>When someone says things like this, I dont understand why others dont  say <br/>\nsomething about Elissa&#39;s comments. That was an out and out horrible <br/>\naccusation.  I almost feel like crying. I think that was the harshest thing I <br/>\nhave heard on here.   Yol was here on this list before I was.  She even <br/>\nsuggested I check it out.  She has never &quot;caused trouble&quot; on other lists, and <br/>\nI dont think she causes trouble on this one.  I usually dont say this, and I <br/>\nwill tolerate A LOT. but I think you owe her an apology.<br/>\n<br/>\nTeresa <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":128307542,"authorName":"Earthmomma67@aol.com","from":"Earthmomma67@...","profile":"elissajc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Low self-esteem? was Balance","postDate":"1039998522","msgId":51683,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE2Ni4xODhhYjBkZi4yYjJlNzgzYUBhb2wuY29tPg=="},"prevInTopic":51680,"nextInTopic":51688,"prevInTime":51682,"nextInTime":51684,"topicId":51517,"numMessagesInTopic":0,"msgSnippet":"In a message dated 12/15/02 7:09:30 PM Eastern Standard Time, ... She came here, immediately became defensive and snarky. Then lets slip that she already knew","messageBody":"<div id=\"ygrps-yiv-294636881\">In a message dated 12/15/02 7:09:30 PM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:robin9700@...\">robin9700@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Maybe she came here becasue her heart  and her mind are seeking a <br/>\n&gt; resolution... Neither of us can really know, though.. Only she.  I think <br/>\n&gt; that <br/>\n&gt; is only for her to say.<br/>\n&gt; What are you seeking by engaging?  <br/>\n&gt; <br/>\n&gt; Robin S.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>She came here, immediately became defensive and snarky. Then lets slip that <br/>\nshe already knew what the list would be like. I think she came with <br/>\npreconceived notions and will report back that all her otehr &quot;unschooling&quot; <br/>\nfriends were right about this list.<br/>\nEissa<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":118199625,"authorName":"robin9700@cs.com","from":"robin9700@...","profile":"teacher9700","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Low self-esteem? was Balance","postDate":"1039997299","msgId":51680,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0My41MzE5M2QzLjJiMmU3MzczQGNzLmNvbT4="},"prevInTopic":51678,"nextInTopic":51683,"prevInTime":51679,"nextInTime":51681,"topicId":51517,"numMessagesInTopic":0,"msgSnippet":"In a message dated 12/15/2002 6:55:25 PM Eastern Standard Time, ... Maybe she came here becasue her heart  and her mind are seeking a resolution... Neither of","messageBody":"<div id=\"ygrps-yiv-744315841\">In a message dated 12/15/2002 6:55:25 PM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Earthmomma67@...\">Earthmomma67@...</a> writes: <br/>\n<blockquote><span title=\"ireply\"> &gt; OH!!!! Now I see! Did you actually come here with a notion of what you&#39;d <br/>\n&gt; find? Did you come here because you wanted to see what &quot;the others&#39;&quot; were <br/>\n&gt; talking about? <br/>\n&gt; You came here looking for trouble. You stirred stuff up.<br/>\n&gt; Go back to your other lists and talk all you want. <br/>\n&gt; If you come to an email list  looking for a &quot;fight&quot; you&#39;ll find one. At ANY <br/>\n&gt; <br/>\n&gt; list.<br/>\n&gt; You are what is known on email lists and newsgroups as a Troll<br/>\n&gt; Elissa<br/>\n  <br/>\n </span></blockquote>Maybe she came here becasue her heart  and her mind are seeking a <br/>\nresolution... Neither of us can really know, though.. Only she.  I think that <br/>\nis only for her to say.<br/>\nWhat are you seeking by engaging?  <br/>\n<br/>\nRobin S.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":128307542,"authorName":"Earthmomma67@aol.com","from":"Earthmomma67@...","profile":"elissajc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Low self-esteem? was Balance","postDate":"1039996514","msgId":51678,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE2LjI5ZDRjOWQ4LjJiMmU3MDYyQGFvbC5jb20+"},"prevInTopic":51677,"nextInTopic":51680,"prevInTime":51677,"nextInTime":51679,"topicId":51517,"numMessagesInTopic":0,"msgSnippet":"In a message dated 12/15/02 12:37:24 PM Eastern Standard Time, ... OH!!!! Now I see! Did you actually come here with a notion of what you d find? Did you come","messageBody":"<div id=\"ygrps-yiv-1782985283\">In a message dated 12/15/02 12:37:24 PM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:bluelotus@...\">bluelotus@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Again, lack of self-awareness... Never mind... I hardly doubt I will stick <br/>\n&gt; much longer in this clique. I&#39;ve heard people on other lists express the <br/>\n&gt; same things about you guys I see for<br/>\n&gt; myself. Except that I call it lack of self-awareness and they have much <br/>\n&gt; harsher words for it.<br/>\n&gt; <br/>\n&gt; <br/>\n </span></blockquote>OH!!!! Now I see! Did you actually come here with a notion of what you&#39;d <br/>\nfind? Did you come here because you wanted to see what &quot;the others&#39;&quot; were <br/>\ntalking about? <br/>\nYou came here looking for trouble. You stirred stuff up.<br/>\nGo back to your other lists and talk all you want. <br/>\nIf you come to an email list  looking for a &quot;fight&quot; you&#39;ll find one. At ANY <br/>\nlist.<br/>\n You are what is known on email lists and newsgroups as a Troll<br/>\nElissa<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":128307542,"authorName":"Earthmomma67@aol.com","from":"Earthmomma67@...","profile":"elissajc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Low self-esteem? was Balance","postDate":"1039996182","msgId":51677,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1ZC4xOTA1ZGNmMS4yYjJlNmYxNkBhb2wuY29tPg=="},"prevInTopic":51662,"nextInTopic":51678,"prevInTime":51676,"nextInTime":51678,"topicId":51517,"numMessagesInTopic":0,"msgSnippet":"In a message dated 12/15/02 12:37:24 PM Eastern Standard Time, ... I don t know if you read this very quickly or not but she was saying one s OWN letters and","messageBody":"<div id=\"ygrps-yiv-1095687884\">In a message dated 12/15/02 12:37:24 PM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:bluelotus@...\">bluelotus@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt;If people never keep journals or re-read their old letters, it&#39;s harder for<br/>\n&gt; &gt;them to have a good perspective on their own progress.<br/>\n&gt; <br/>\n&gt; You sure sound like a teacher. Not everybody needs to keep the e-mails of <br/>\n&gt; the &quot;experts&quot; on this list to have a perspective on their progress.<br/>\n&gt; <br/>\n </span></blockquote>I don&#39;t know if you read this very quickly or not but she was saying one&#39;s <br/>\nOWN letters and old journals, not list postings.<br/>\nElissa<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":74604204,"authorName":"Deborah Lewis","from":"Deborah Lewis &lt;ddzimlew@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Low self-esteem? was Balance","postDate":"1039987027","msgId":51662,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIxMjE1LjE0MTcwNy4xNTQ0LjUuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":51640,"nextInTopic":51677,"prevInTime":51661,"nextInTime":51663,"topicId":51517,"numMessagesInTopic":0,"msgSnippet":"***What I m saying is that you guys need to check your hollier-than-thou attitude. In other words, it seems that you re trying to *teach* newcomers how to ","messageBody":"<div id=\"ygrps-yiv-286408236\">***What I&#39;m saying is that you guys need to check your hollier-than-thou<br/>\nattitude. In other words, it seems that you&#39;re trying to *teach*<br/>\nnewcomers how to<br/>\nunschool, but you can have a different attitude with the people<br/>\nwho-have-been-here-long-enough. It&#39;s a question of self-awareness, but of<br/>\ncourse that&#39;s an individual thing. I cannot make you se what you<br/>\ndon&#39;t want to see. You guys are perhaps a little too defensive about YOUR<br/>\nconcept of unschooling.***<br/>\n<br/>\nYol, If I said to you, I love yoga, and I&#39;ve learned a lot and I really,<br/>\nreally think it&#39;s the right thing for me, and I told you I practiced it<br/>\nby sitting in a half lotus at a cock fight while shooting up, (why do I<br/>\npersist in these horrible analogies?)  don&#39;t you think you would feel<br/>\ninclined to tell me I might not have the best understanding of yoga?<br/>\nWouldn&#39;t you want to let me know that yoga can be so much more than a<br/>\nsitting posture, that it could in fact, be a life changing experience if<br/>\nonly I&#39;d open my mind to all the possibilities? <br/>\nIf you and I have such a different concept of yoga, would you be silent<br/>\nwhile I helped others find yoga the way I know it? Would that be the best<br/>\nyoga help they could get?   Or would it be better to hear more, and think<br/>\nof more possibilities?<br/>\n<br/>\nBecause someone knows more possibilities of unschooling doesn&#39;t make them<br/>\nbetter people.   I&#39;ve never gotten the impression here that anyone thinks<br/>\nof themselves as better human beings than others.   But like all things<br/>\nsome can have more experience, some can have broader understanding, some<br/>\ncan have better ideas.   No one here is looking down on you.  You don&#39;t<br/>\nwant my cheap (free!) psychoanalyses so I won&#39;t give it (but just barely)<br/>\nbut no one thinks they are better than you are.  <br/>\n<br/>\nI&#39;m sorry you have felt picked on.   I really think we would miss your<br/>\ncontribution if you left.  <br/>\n<br/>\nDeb L</div>","specialLinks":[]},{"userId":90564959,"authorName":"gruvystarchild &lt;starsuncloud@cs.com&gt;","from":"&quot;gruvystarchild &lt;starsuncloud@...&gt;&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Low self-esteem? was Balance","postDate":"1039980294","msgId":51640,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGF0aWt1NitlNm5nQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDNERkNCRDhDLkM1MDBENTg1QGF0dC5uZXQ+"},"prevInTopic":51635,"nextInTopic":51662,"prevInTime":51639,"nextInTime":51641,"topicId":51517,"numMessagesInTopic":0,"msgSnippet":"I ve heard people on other lists express the same things about you guys I see for myself. Except that I call it lack of self-awareness and they have much","messageBody":"<div id=\"ygrps-yiv-1859890419\">&quot;I&#39;ve heard people on other lists<br/>\nexpress the same things about you guys I see for<br/>\nmyself. Except that I call it lack of self-awareness and they have <br/>\nmuch harsher<br/>\nwords for it.&quot;<br/>\n<br/>\nNow THAT sounds very cliqueish to me!!!<br/>\nFunny how people at other lists spend time and energy talking about <br/>\nthis  one, but nobody here seems to focus on what the other lists are <br/>\ndoing or saying....<br/>\nhmmmm?</div>","specialLinks":[]},{"userId":2300774,"authorName":"Betsy","from":"Betsy &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Low self-esteem? was Balance","postDate":"1039979146","msgId":51635,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNERkNEMjhCLjc5OEMyNzJCQGVhcnRobGluay5uZXQ+","referencesHeader":"PDEwMzk4ODg5NDMuMTI0MS40MjIyOS5tMTRAeWFob29ncm91cHMuY29tPiA8M0RGQ0JEOEMuQzUwMEQ1ODVAYXR0Lm5ldD4="},"prevInTopic":51633,"nextInTopic":51640,"prevInTime":51634,"nextInTime":51636,"topicId":51517,"numMessagesInTopic":0,"msgSnippet":"** You sure sound like a teacher. Not everybody needs to keep the e-mails of the experts on this list to have a perspective on their progress.** I think she","messageBody":"<div id=\"ygrps-yiv-1178666152\">**<br/>\n<br/>\nYou sure sound like a teacher. Not everybody needs to keep the e-mails<br/>\nof the &quot;experts&quot; on this list to have a<br/>\nperspective on their progress.**<br/>\n<br/>\nI think she suggested that the other person keep *her own* emails and<br/>\nlook back on them in the future.  Totally different scenario.<br/>\n<br/>\nBetsy</div>","specialLinks":[]},{"userId":112038769,"authorName":"Shyrley","from":"&quot;Shyrley&quot; &lt;shyrley.williams@...&gt;","profile":"bobalinga","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Low self-esteem? was Balance","postDate":"1039978739","msgId":51633,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIxMjE1MTg1NDE0LlRGQUw5Njc5Lm91dDAxMS52ZXJpem9uLm5ldEBtYXJrc2NvbXB1dGVyPg==","inReplyToHeader":"PDNERkNCRDhDLkM1MDBENTg1QGF0dC5uZXQ+"},"prevInTopic":51625,"nextInTopic":51635,"prevInTime":51632,"nextInTime":51634,"topicId":51517,"numMessagesInTopic":0,"msgSnippet":"... When I joined this group, not that long ago I came with an attitude that I wanted to learn and needed support. I ve always found answers to my questions","messageBody":"<div id=\"ygrps-yiv-946724093\">On 15 Dec 02, at 12:36, Yol, Vishnu & Shanti wrote:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; With me it&#39;s not so much about &quot;getting it.&quot; What I&#39;m saying is that<br/>\n&gt; you guys need to check your hollier-than-thou attitude. In other<br/>\n&gt; words, it seems that you&#39;re trying to *teach* newcomers how to<br/>\n&gt; unschool, but you can have a different attitude with the people<br/>\n&gt; who-have-been-here-long-enough. It&#39;s a question of self-awareness, but<br/>\n&gt; of course that&#39;s an individual thing. I cannot make you se what you<br/>\n&gt; don&#39;t want to see. You guys are perhaps a little too defensive about<br/>\n&gt; YOUR concept of unschooling.<br/>\n<br/>\n </span></blockquote>When I joined this group, not that long ago I came with an attitude <br/>\nthat I wanted to learn and needed support.<br/>\nI&#39;ve always found answers to my questions here plus a great deal of <br/>\nsupport for those times when I failed to trust my gut instinct and <br/>\nmy children and expressed my concerns about unschooling.<br/>\n<br/>\nI have learned a great deal from people here and have never felt <br/>\ncritised when I asked questions.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; You sure sound like a teacher. Not everybody needs to keep the e-mails<br/>\n&gt; of the &quot;experts&quot; on this list to have a perspective on their progress.<br/>\n<br/>\n </span></blockquote>Actually I&#39;ve kept some of Sandra&#39;s emails and Joyce&#39;s for times <br/>\nwhen I need a clever answer and my brain isnt working :-)<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; What I meant was that I didn&#39;t undestand what that had to do with my<br/>\n&gt; post. You&#39;re constantly projecting outside and very quick to label<br/>\n&gt; people. You&#39;re always right and the newcomers are the ones who have<br/>\n&gt; all the problems. Again, lack of self-awareness... Never mind... I<br/>\n&gt; hardly doubt I will stick much longer in this clique. I&#39;ve heard<br/>\n&gt; people on other lists express the same things about you guys I see for<br/>\n&gt; myself. Except that I call it lack of self-awareness and they have<br/>\n&gt; much harsher words for it.<br/>\n&gt; <br/>\n&gt; Yol<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I would call it experience myself. I for one am so pleased to be able <br/>\nto talk to people with older kids who unschool and learn from them <br/>\nas their kids approached college or whatever.<br/>\n<br/>\nJust my five eggs worth<br/>\n<br/>\nShyrley<br/>\n<br/>\n<br/>\n&quot;You laugh at me because I&#39;m different. I laugh at you because you are all the same.&quot;</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Low self-esteem? was Balance","postDate":"1039976951","msgId":51625,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBMjIzNDI3LjEwQTFCJWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDNERkNCRDhDLkM1MDBENTg1QGF0dC5uZXQ+"},"prevInTopic":51619,"nextInTopic":51633,"prevInTime":51624,"nextInTime":51626,"topicId":51517,"numMessagesInTopic":0,"msgSnippet":"... I think this is a good example of one of the types of misunderstandings that goes on here. It s all about miscommunication and hearing something other than","messageBody":"<div id=\"ygrps-yiv-858913741\">on 12/15/02 12:36 PM, Yol, Vishnu & Shanti at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:bluelotus@...\">bluelotus@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; If people never keep journals or re-read their old letters, it&#39;s harder for<br/>\n&gt;&gt; them to have a good perspective on their own progress.<br/>\n&gt; <br/>\n&gt; You sure sound like a teacher. Not everybody needs to keep the e-mails of the<br/>\n&gt; &quot;experts&quot; on this list to have a perspective on their progress.<br/>\n<br/>\n </span></blockquote>I think this is a good example of one of the types of misunderstandings that<br/>\ngoes on here. It&#39;s all about miscommunication and hearing something other<br/>\nthan what was written.<br/>\n<br/>\nHere&#39;s one of the things that happens:<br/>\n<br/>\nPerson A says &quot;I do such and such.&quot;<br/>\n<br/>\nPerson B says &quot;People who do such and such can have this problem.&quot;<br/>\n<br/>\nPerson A reads Person B&#39;s statement as &quot;Such and such is wrong. You&#39;re bad<br/>\nfor doing such and such. You should change to do it my way,&quot; and responds<br/>\ndefensively.<br/>\n<br/>\nThis is the result of the different ways we use language. It can be a result<br/>\nof how we&#39;ve heard sentence structures used in real life. The above may have<br/>\nbeen the sentence structure we heard as a child that was used as an insult<br/>\nso we &quot;hear&quot; that insulting tone when the writer obviously used no tone at<br/>\nall.<br/>\n<br/>\nAnd the above could be taken personally. You could respond with &quot;I didn&#39;t do<br/>\nthat&quot; or &quot;That&#39;s not what happened.&quot; But that would be taking it personally<br/>\nand not talking about the *idea* of miscommunication.<br/>\n<br/>\nThe first quote is about the *idea* of being able to look back and compare<br/>\nyears ago thinking with today&#39;s thinking.<br/>\n<br/>\nIf you look at the idea and don&#39;t see it as a personal comment, is there<br/>\nsomething untrue about &quot;If people never keep journals or re-read their old<br/>\nletters, it&#39;s harder for them to have a good perspective on their own<br/>\nprogress&quot;?<br/>\n<br/>\n(Though come to think of it, I *think* (though perhaps I&#39;m deluding myself!<br/>\n;-) I&#39;ve got a good memory of my past thinking to compare to present<br/>\nthinking. I keep drawing on it to explain to people why they believe<br/>\nsomething is true (for example, math needs hours of practice) and why that<br/>\nisn&#39;t right and what is right and why it&#39;s right.)<br/>\n<br/>\nBut what it *doesn&#39;t* say is &quot;You&#39;re a bad person if you don&#39;t keep a<br/>\njournal.&quot;<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Low self-esteem? was Balance","postDate":"1039975809","msgId":51619,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVmLjMxYjM1NDdiLjJiMmUxZjgxQGFvbC5jb20+"},"prevInTopic":51611,"nextInTopic":51625,"prevInTime":51618,"nextInTime":51620,"topicId":51517,"numMessagesInTopic":0,"msgSnippet":"In a message dated 12/15/02 10:37:29 AM, bluelotus@att.net writes:  If people never keep journals or re-read their old letters, it s harder for ... You","messageBody":"<div id=\"ygrps-yiv-917426173\">In a message dated 12/15/02 10:37:29 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:bluelotus@...\">bluelotus@...</a> writes:<br/>\n<br/>\n&lt;&lt; &gt; If people never keep journals or re-read their old letters, it&#39;s harder <br/>\nfor<br/>\n<blockquote><span title=\"ireply\"> &gt; them to have a good perspective on their own progress.<br/>\n<br/>\n </span></blockquote>You sure sound like a teacher. Not everybody needs to keep the e-mails of the <br/>\n&quot;experts&quot; on this list to have a perspective on their progress. &gt;&gt;<br/>\n<br/>\nI was talking about YOUR OWN e-mails.<br/>\nNot about saving anyone else&#39;s.  About saving the one in which you had <br/>\nsummarized your feelings.  I believe your feelings will change in two years.  <br/>\nIf you don&#39;t want to save that, you certainly don&#39;t have to, but if seeing <br/>\nhow far you&#39;ve come might make you feel good (as it makes lots of other <br/>\npeople feel good, me certainly and always) it might be a good thing to save.<br/>\n<br/>\n&lt;&lt;It&#39;s a question of self-awareness, but of course that&#39;s an individual <br/>\nthing. I cannot make you se what you don&#39;t want to see. You guys are perhaps <br/>\na little too defensive about YOUR concept of unschooling.&gt;&gt;<br/>\n<br/>\nI&#39;m confident that what my kids have experienced has not hurt them and has <br/>\nbeen good for them.  They&#39;re really open and reasonable and thoughtful <br/>\npeople.  More than I expected or could have predicted.   So when people come <br/>\nand suggest neglect or suggest that people here are exaggerating, or that we <br/>\njust happened to have good kids and what we did didn&#39;t affect them, SEVERAL <br/>\npeople are going to object to those glib summaries.<br/>\n<br/>\nIt is because my kids had freedom to make choices early that they don&#39;t <br/>\nagitate about decisions now.  It&#39;s because they&#39;ve been able to choose foods <br/>\nthat they don&#39;t eat a bunch of junk even though it&#39;s readily available.   <br/>\nIt&#39;s because they don&#39;t see history as something to be avoided that they can <br/>\ndiscuss history in the same tone and with the same enthusiasm as they discuss <br/>\nvideo games.   So if someone says &quot;Kids will learn to make decisions because <br/>\nwe&#39;ll tell them what good decisions look like,&quot; and &quot;unschooling works <br/>\ndifferently in different families; my kids have to do math and write,&quot; or &quot;My <br/>\nkids are just kids so I&#39;ll make decisions for them  until they&#39;re old enough <br/>\nto make decisions,&quot; those statements will be held up to experiences of <br/>\nfamilies who have with many years&#39; experience found that those &quot;management <br/>\ndecisions&quot; by parents will serve to hold kid back, not to give them wings.<br/>\n<br/>\n-=-Ayurveda, Homeopathy, Yoga and Therapeutic Massage.<br/>\nMeditation - Kundalini Maha Yoga-=-<br/>\n<br/>\nDoesn&#39;t stirring negativity go against those beliefs?<br/>\nDoesn&#39;t coming here and saying we suck and you&#39;re leaving violate your <br/>\nprinciples?<br/>\n<br/>\n(&quot;Never mind... I hardly doubt I will stick much longer in this clique. I&#39;ve <br/>\nheard people on other lists express the same things about you guys I see for <br/>\nmyself. Except that I call it lack of self-awareness and they have much <br/>\nharsher words for it.&quot;)<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":129256077,"authorName":"Yol, Vishnu & Shanti","from":"&quot;Yol, Vishnu & Shanti&quot; &lt;bluelotus@...&gt;","profile":"yolswandass","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Low self-esteem? was Balance","postDate":"1039973771","msgId":51611,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNERkNCRDhDLkM1MDBENTg1QGF0dC5uZXQ+","referencesHeader":"PDEwMzk4ODg5NDMuMTI0MS40MjIyOS5tMTRAeWFob29ncm91cHMuY29tPg=="},"prevInTopic":51608,"nextInTopic":51619,"prevInTime":51610,"nextInTime":51612,"topicId":51517,"numMessagesInTopic":0,"msgSnippet":"... With me it s not so much about getting it. What I m saying is that you guys need to check your hollier-than-thou attitude. In other words, it seems that","messageBody":"<div id=\"ygrps-yiv-1742101527\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; In a message dated 12/13/02 8:08:44 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:bluelotus@...\">bluelotus@...</a> writes:<br/>\n&gt;<br/>\n&gt; &lt;&lt; &gt; If you will save your post and re-read it in a couple of years, I think<br/>\n&gt; &gt; you&#39;ll see that Deb had a legitimate point.<br/>\n&gt;<br/>\n&gt; I don&#39;t save these posts. I simply read and move on. &gt;&gt;<br/>\n&gt;<br/>\n&gt; It&#39;s easy not to quite remember how clearly, then, some of the newcomers are<br/>\n&gt; hostile and confused, but if they stick around they VERY often say &quot;I used to<br/>\n&gt; think you guys were nuts, but I stuck around and now I get it.&quot;<br/>\n<br/>\n </span></blockquote>With me it&#39;s not so much about &quot;getting it.&quot; What I&#39;m saying is that you guys need to check your hollier-than-thou attitude. In other words, it seems that you&#39;re trying to *teach* newcomers how to<br/>\nunschool, but you can have a different attitude with the people who-have-been-here-long-enough. It&#39;s a question of self-awareness, but of course that&#39;s an individual thing. I cannot make you se what you<br/>\ndon&#39;t want to see. You guys are perhaps a little too defensive about YOUR concept of unschooling.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If people never keep journals or re-read their old letters, it&#39;s harder for<br/>\n&gt; them to have a good perspective on their own progress.<br/>\n<br/>\n </span></blockquote>You sure sound like a teacher. Not everybody needs to keep the e-mails of the &quot;experts&quot; on this list to have a perspective on their progress.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; -=-&gt; There is another pattern.  Those who are often so disruptive and<br/>\n&gt; defensive<br/>\n&gt; &gt; sometimes aren&#39;t committed to unschooling and end up going to eclectic or<br/>\n&gt; &gt; unit studies or something.<br/>\n&gt;<br/>\n&gt; -=-I am not sure what you&#39;re talking about. -=-<br/>\n&gt;<br/>\n&gt; That&#39;s okay.<br/>\n&gt;<br/>\n&gt; If you stick around long enough to see four or five incidents such as the one<br/>\n&gt; which is going on now that you claim not to be able to see, you will<br/>\n&gt; understand it.<br/>\n<br/>\n </span></blockquote>What I meant was that I didn&#39;t undestand what that had to do with my post. You&#39;re constantly projecting outside and very quick to label people. You&#39;re always right and the newcomers are the ones who have<br/>\nall the problems. Again, lack of self-awareness... Never mind... I hardly doubt I will stick much longer in this clique. I&#39;ve heard people on other lists express the same things about you guys I see for<br/>\nmyself. Except that I call it lack of self-awareness and they have much harsher words for it.<br/>\n<br/>\nYol<br/>\n<br/>\n--<br/>\nBlue Lotus Therapeutics<br/>\nAyurveda, Homeopathy, Yoga and Therapeutic Massage.<br/>\nAsheville/Weaverville, NC<br/>\nwww.bluelotustherapeutics.com<br/>\n<br/>\nDhyanyoga Center of North Carolina<br/>\nMeditation - Kundalini Maha Yoga<br/>\nWeaverville, NC<br/>\nwww.dyc-nc.org<br/>\n<br/>\n***********************************<br/>\nWhen nothing is done, nothing is left undone. The world is ruled by letting things take their course. It cannot be ruled by interfering.<br/>\n-- Tao Te Ching<br/>\n***********************************<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":117369878,"authorName":"Kelli Traaseth","from":"Kelli Traaseth &lt;kellitraas@...&gt;","profile":"kellitraas","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Seeing &#39;it&#39;","postDate":"1039972791","msgId":51608,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIxMjE1MTcxOTUxLjUwMDI2LnFtYWlsQHdlYjQwMTA2Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDE3LjMzMDI4NmRlLjJiMmNiODFhQGFvbC5jb20+"},"prevInTopic":51548,"nextInTopic":51611,"prevInTime":51607,"nextInTime":51609,"topicId":51517,"numMessagesInTopic":0,"msgSnippet":"... which is going on now that you claim not to be able to see, you will understand it. Sandra","messageBody":"<div id=\"ygrps-yiv-741665178\"><blockquote><span title=\"ireply\">&gt;&gt;If you stick around long enough to see four or five incidents such as the one <br/>\n </span></blockquote>which is going on now that you claim not to be able to see, you will <br/>\nunderstand it.<br/>\n<br/>\nSandra&lt;&lt;<br/>\n<br/>\nYes,  lets see I&#39;ve been on here for maybe 4-6 months....and I&#39;ve seen this 3 or 4 times  now.  <br/>\n <br/>\nDon&#39;t you think,  and I think someone said this,  that&#39;s its part of growth,  yes,  the shift,      Hey,  Sandra there&#39;s a title for you book!   &#39;The Shift&#39;  ?  (Paradigm, that is)<br/>\n <br/>\nKelli<br/>\n <br/>\n <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> wrote:<br/>\nIn a message dated 12/13/02 8:08:44 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:bluelotus@...\">bluelotus@...</a> writes:<br/>\n<br/>\n&lt;&lt; &gt; If you will save your post and re-read it in a couple of years, I think<br/>\n<blockquote><span title=\"ireply\"> &gt; you&#39;ll see that Deb had a legitimate point.<br/>\n<br/>\n </span></blockquote>I don&#39;t save these posts. I simply read and move on. &gt;&gt;<br/>\n<br/>\nIt&#39;s easy not to quite remember how clearly, then, some of the newcomers are <br/>\nhostile and confused, but if they stick around they VERY often say &quot;I used to <br/>\nthink you guys were nuts, but I stuck around and now I get it.&quot;<br/>\n<br/>\nIf people never keep journals or re-read their old letters, it&#39;s harder for <br/>\nthem to have a good perspective on their own progress.<br/>\n<br/>\n-=-&gt; There is another pattern.  Those who are often so disruptive and <br/>\ndefensive<br/>\n<blockquote><span title=\"ireply\"> &gt; sometimes aren&#39;t committed to unschooling and end up going to eclectic or<br/>\n&gt; unit studies or something.<br/>\n<br/>\n </span></blockquote>-=-I am not sure what you&#39;re talking about. -=-<br/>\n<br/>\nThat&#39;s okay.<br/>\n<br/>\nIf you stick around long enough to see four or five incidents such as the one <br/>\nwhich is going on now that you claim not to be able to see, you will <br/>\nunderstand it.<br/>\n<br/>\nSandra<br/>\n<br/>\n~~~~ Don&#39;t forget! If you change topics, change the subject line! ~~~~<br/>\n<br/>\nIf you have questions, concerns or problems with this list, please email the moderator, Joyce Fetteroll (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a>), or the list owner, Helen Hegener (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Editor@...\">HEM-Editor@...</a>).<br/>\n<br/>\nTo unsubscribe from this group, click on the following link or address an email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-unsubscribe@yahoogroups.com\">Unschooling-dotcom-unsubscribe@yahoogroups.com</a> <br/>\n<br/>\nVisit the Unschooling website: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> <br/>\n<br/>\nYour use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\nYahoo! Mail Plus - Powerful. Affordable. Sign up now<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Low self-esteem? was Balance","postDate":"1039883802","msgId":51548,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE3LjMzMDI4NmRlLjJiMmNiODFhQGFvbC5jb20+"},"prevInTopic":51523,"nextInTopic":51608,"prevInTime":51547,"nextInTime":51549,"topicId":51517,"numMessagesInTopic":0,"msgSnippet":"In a message dated 12/13/02 8:08:44 PM, bluelotus@att.net writes:  If you will save your post and re-read it in a couple of years, I think ... I don t save","messageBody":"<div id=\"ygrps-yiv-825799229\">In a message dated 12/13/02 8:08:44 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:bluelotus@...\">bluelotus@...</a> writes:<br/>\n<br/>\n&lt;&lt; &gt; If you will save your post and re-read it in a couple of years, I think<br/>\n<blockquote><span title=\"ireply\"> &gt; you&#39;ll see that Deb had a legitimate point.<br/>\n<br/>\n </span></blockquote>I don&#39;t save these posts. I simply read and move on. &gt;&gt;<br/>\n<br/>\nIt&#39;s easy not to quite remember how clearly, then, some of the newcomers are <br/>\nhostile and confused, but if they stick around they VERY often say &quot;I used to <br/>\nthink you guys were nuts, but I stuck around and now I get it.&quot;<br/>\n<br/>\nIf people never keep journals or re-read their old letters, it&#39;s harder for <br/>\nthem to have a good perspective on their own progress.<br/>\n<br/>\n-=-&gt; There is another pattern.  Those who are often so disruptive and <br/>\ndefensive<br/>\n<blockquote><span title=\"ireply\"> &gt; sometimes aren&#39;t committed to unschooling and end up going to eclectic or<br/>\n&gt; unit studies or something.<br/>\n<br/>\n </span></blockquote>-=-I am not sure what you&#39;re talking about. -=-<br/>\n<br/>\nThat&#39;s okay.<br/>\n<br/>\nIf you stick around long enough to see four or five incidents such as the one <br/>\nwhich is going on now that you claim not to be able to see, you will <br/>\nunderstand it.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":74604204,"authorName":"Deborah Lewis","from":"Deborah Lewis &lt;ddzimlew@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Low self-esteem? was Balance","postDate":"1039839749","msgId":51523,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIxMjEzLjIxMjIzMC4xNzEyLjQuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":51517,"nextInTopic":51548,"prevInTime":51522,"nextInTime":51524,"topicId":51517,"numMessagesInTopic":0,"msgSnippet":"***I find it very interesting that when someone who s been here for a long time says something words don t hold the same significance and meaning as when","messageBody":"<div id=\"ygrps-yiv-2052399240\">***I find it very interesting that when someone who&#39;s been here for &quot;a<br/>\nlong time&quot; says something words don&#39;t hold the same significance and<br/>\nmeaning as when &quot;new&quot; people express their views. So, Deb is okay and<br/>\nshouldn&#39;t be &quot;judged&quot; by her comments, but again the rest of us mortals<br/>\ncan be judged as much as<br/>\nthe-people-who&#39;s-been-on-this-list-for-a-long-time want? ***<br/>\n<br/>\nYou&#39;re free to question anything at all.   There are no gods here though<br/>\nyou&#39;ve been trying to draw a picture of some conflict between gods and<br/>\nmortals.  That conflict doesn&#39;t exist because we&#39;re all just moms and<br/>\ndads<br/>\nwith ideas about a better life for our kids.<br/>\n<br/>\nYou&#39;re free to judge my comments, anyone can,  but it means little to me<br/>\nbecause like everyone else here, my parenting choices have  been held up<br/>\nto much criticism and scrutiny over the years.   Theres very little I<br/>\nhaven&#39;t already heard, although I know I still have much to consider.<br/>\n<br/>\n***I am an observer and I express what I&#39;ve been observing.***<br/>\n<br/>\nIsn&#39;t this what I did and what you are now so angry about?<br/>\nIt&#39;s what happens here.  We read, we consider,  we learn, we question, we<br/>\nmake observations.   Is there some part of that seems contrary to what<br/>\nthis list is for? <br/>\n<br/>\nDeb L</div>","specialLinks":[]},{"userId":129256077,"authorName":"Yol, Vishnu & Shanti","from":"&quot;Yol, Vishnu & Shanti&quot; &lt;bluelotus@...&gt;","profile":"yolswandass","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Low self-esteem? was Balance","postDate":"1039835246","msgId":51517,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNERkFBMDZFLjY4RjcxOTAzQGF0dC5uZXQ+","referencesHeader":"PDEwMzk4MjA3MTkuMTQzOS4zMjY2NS5tMTFAeWFob29ncm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":51523,"prevInTime":51516,"nextInTime":51518,"topicId":51517,"numMessagesInTopic":0,"msgSnippet":"... I find it very interesting that when someone who s been here for a long time says something words don t hold the same significance and meaning as when","messageBody":"<div id=\"ygrps-yiv-48554610\"><blockquote><span title=\"ireply\">&gt; &lt;&lt; &gt; This is what I think.   I think it&#39;s possible posters who are quick to<br/>\n&gt; &gt; feel injured and claim they have been attacked are probably suffering<br/>\n&gt; &gt; from low self esteem.   I have noticed a connection between those who are<br/>\n&gt; &gt; afraid their children will take advantage of them or make them<br/>\n&gt; &gt; subservient and those who yell they&#39;ve been hurt when ever someone<br/>\n&gt; &gt; disagrees with them.<br/>\n&gt; &gt;<br/>\n&gt; &gt; I&#39;d bet my life (or not) that many who feel attacked here, feel attacked<br/>\n&gt; &gt; frequently other times and places as well and by all kinds of people, and<br/>\n&gt; &gt; have a long list of injuries in their lifetime. &gt;&gt;<br/>\n&gt;<br/>\n&gt; Deb wrote that and Yol wrote:<br/>\n&gt;<br/>\n&gt; -=-This kind of statement is plainly aggressive and judgmental, but of course<br/>\n&gt; later on you&#39;re going to say that you didn&#39;t mean anything by it... In my<br/>\n&gt; dictionary, that&#39;s simply not taking responsibility-=-<br/>\n&gt;<br/>\n&gt; Yol, some of us have been involved in these kinds of discussions for a long<br/>\n&gt; time.  This list is relatively new.  The discussions about unschooling<br/>\n&gt; aren&#39;t.   Three or four times a year someone will show up and be a bundle of<br/>\n&gt; defensive anger.  Deb&#39;s seen it often.  If you haven&#39;t seen it much, please<br/>\n&gt; withhold judgment on Deb&#39;s voluntary, free (you said &quot;cheap) summary theories.<br/>\n<br/>\n </span></blockquote>I find it very interesting that when someone who&#39;s been here for &quot;a long time&quot; says something words don&#39;t hold the same significance and meaning as when &quot;new&quot; people express their views. So, Deb is okay and shouldn&#39;t be &quot;judged&quot; by her comments, but again<br/>\nthe rest of us mortals can be judged as much as the-people-who&#39;s-been-on-this-list-for-a-long-time want? Let me quote you here:<br/>\n&quot;It&#39;s not just words, it&#39;s the thoughts we have that go with those words.&quot; I agre with that statement 100% but I think it applies to EVERYONE on this list, not just to those who haven&#39;t been-on-this-list-for-a-long-time.<br/>\n<br/>\nI don&#39;t mind a heated discussion. I am very passionate about what I believe in and have been in many heated discussions. It&#39;s the attitude some of you guys have that IMO needs a check. It&#39;s a bit hollier-than-thou, if you know what I mean, like you<br/>\ninvented unschooling or something.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If you will save your post and re-read it in a couple of years, I think<br/>\n&gt; you&#39;ll see that Deb had a legitimate point.<br/>\n<br/>\n </span></blockquote>I don&#39;t save these posts. I simply read and move on.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; There is another pattern.  Those who are often so disruptive and defensive<br/>\n&gt; sometimes aren&#39;t committed to unschooling and end up going to eclectic or<br/>\n&gt; unit studies or something.<br/>\n<br/>\n </span></blockquote>I am not sure what you&#39;re talking about. Who is &quot;defensive&quot; and &quot;disruptive&quot;? For being so UN-schooling you guys sure like to label things and people. Is this also part of your unschooling approach?<br/>\nI am an observer and I express what I&#39;ve been observing. This list actually smells too much like a clique to me.<br/>\n<br/>\nYol</div>","specialLinks":[]}],"prevTopicId":52366,"nextTopicId":52468}}