{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":383312070,"authorName":"crbrlw","from":"&quot;crbrlw&quot; &lt;carabarlow@...&gt;","profile":"crbrlw","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"looking for advice on teen&#39;s behavior","postDate":"1240606246","msgId":44274,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdzdDhuNittZG80QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":44273,"nextInTime":44275,"topicId":44274,"numMessagesInTopic":0,"msgSnippet":"Hi Everyone: I ve been reading this list for I think over a year, but rarely post. I m struggling with a teen problem right now, and am hoping for some ideas.","messageBody":"<div id=\"ygrps-yiv-715235872\">Hi Everyone:<br/>\n<br/>\nI&#39;ve been reading this list for I think over a year, but rarely post. I&#39;m struggling with a teen problem right now, and am hoping for some ideas. I&#39;m not sure if  it&#39;s an unschooling problem.<br/>\n<br/>\nI lead a 4-H group of homeschooled, unschooled and public-schooled teens. It&#39;s a small group (under 10 kids). I try to facilitate the group in an unschooling manner.<br/>\n<br/>\nMy issue is with one of the public-schooled girls, who is 13 and her<br/>\ninteractions with the unschooling boys in the group. This child lives in my neighborhood, she&#39;s a friend of my daughter, and I&#39;ve known her and her family for 7 years.<br/>\n<br/>\nNormally when she&#39;s visiting with my daughter I have no issue with her and enjoy her company.<br/>\n<br/>\nWhat I&#39;ve notice since she&#39;s joined our 4-H group is that when she&#39;s around the boys her behavior complete changes. She is constantly talking, asking thoughtless questions, complimenting the boys on how strong, smart, etc they are, shrieking for the smallest reason, when we&#39;re doing woodworking or moving equipment talking bout how weak she is (she isn&#39;t!) and generally acting like she has two brain cells. There is another ps girl in the group who also gets caught up in this behavior.<br/>\n<br/>\nThe boys receiving the unwanted attention are 15yo unschoolers. I have<br/>\ntalked with their parents, telling them I&#39;m trying to address the issue. My daughter has spoken with the boys about it. The boys appear to think the behavior is annoying.<br/>\n<br/>\nI talked with both of the girls privately, telling them that when they<br/>\nbehave this way it&#39;s distracting for everyone in the group, is a safety hazard (we are doing beekeeping) and that if it persists I will<br/>\nneed to ask them to step away from the group.<br/>\n<br/>\nLast week I spoke privately with the girl&#39;s parents. The parents were<br/>\ngreat, said this was not the first time they&#39;ve heard this, and<br/>\nthey did talk to their daughters.<br/>\n<br/>\nThe 13yo girl who is leading most of this behavior is still doing it. At the last meeting I had to threaten to send her home if she didn&#39;t<br/>\nstop making baaing noises at the boys that live next door to us - the<br/>\nneighbor boys were simply skateboarding on their driveway.<br/>\n<br/>\nIt&#39;s driving me crazy. It strikes me as sexual harassment of the boys. She seems to have no filter or understanding (until an adult<br/>\npoints it out to her) that her behavior is a problem.<br/>\n<br/>\nHow can I help her get this under control? Is this something I can help her with or should I just ask her to leave the group? My oldest daughter is 13 so I&#39;m just now moving into working with teens.<br/>\n<br/>\nBest wishes, Cara</div>","specialLinks":[]}],"prevTopicId":44245,"nextTopicId":44287}}