{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: how unschooling works","postDate":"1110813547","msgId":104485,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMyOURDMEI1LjQyNjc4ODMyLjBCOTdBM0ZCQGFvbC5jb20+"},"prevInTopic":104335,"nextInTopic":0,"prevInTime":104484,"nextInTime":104486,"topicId":104173,"numMessagesInTopic":0,"msgSnippet":"-=-=-=-=-I was perplexed by what sounded like some bashing of parents. I have been wondering if I should even remain a member but thought to stick it out","messageBody":"<div id=\"ygrps-yiv-1824184278\">-=-=-=-=-I was perplexed by what sounded like some bashing of parents. I have been wondering if I should even remain a member but thought to stick it out longer to get a better -=-=-<br/>\n<br/>\nJenn, it&#39;s a really good idea to hang around and read a lot to get the feel of a list (any list). There are a lot of different personalities here. Sometimes we come across as real bitches, but if you were to go back a read the archives for a few months, you could get a feel for who we really are.<br/>\n<br/>\nSometimes someone comes in and disrupts the list to the nth degree, and we all band together to keep the list true to its goal and purpose. Often we come across as difficult and a bit...ummmm....even nasty.<br/>\n<br/>\nI used to have a file, &quot;Shit on Kelly/compliments&quot; in which I stored all the hate mail and fan mail I received. More fan mail than hate mail, but---boy, were there some doozies! &lt;g&gt; One (and she knows who she is! &lt;g&gt;) wrote me BOTH! After she got to &quot;know&quot; me virtually, she realized I wasn&#39;t so bad! &lt;bwg&gt;<br/>\n<br/>\nDon&#39;t let the strong personalities scare you: these are the cream of the crop in understanding and explaining unschooling that you&#39;ll find anywhere!<br/>\n<br/>\nAs for &quot;how to&quot;---well, it looks different in each and every family. We (my family) DO spend a lot of money on travel, because that&#39;s what we, as a family, value. But there are plenty of folks who spend big money on electronics or books or art or critters or ---BACK HOES (or whatever that was up for discussion a few weeks ago! ???Road grader???) &lt;g&gt;<br/>\n<br/>\nIn my opinion, your most valuable unschooling &quot;tool&quot; is completely and totally FREE. It&#39;s YOU and your voice. Talk with your kids. Ask questions. Answer questions. Ask their opinions. Create with them. BE with them. Do WITH them. <br/>\n<br/>\nIt&#39;s cool that you get the &quot;why&quot;---most people have more trouble with that! The &quot;how&quot;---well, you have to figure that out for your own family---and each child may be different----and different from YOU! The &quot;how&quot; varies so much that it&#39;s hard----no! *impossible* to pinpoint.<br/>\n<br/>\nThe more you do it, the easier it gets. I promise! &lt;g&gt; And reading about how others do it can help a lot. And don&#39;t think you must provide something every minute of every day. Solitude and down time and daydreaming and veging out are all acceptable and important!<br/>\n<br/>\nStick around: you may find you *like* us!<br/>\n<br/>\n~Kelly</div>","specialLinks":[]},{"userId":141959941,"authorName":"Judy Anderson","from":"&quot;Judy Anderson&quot; &lt;temair@...&gt;","profile":"kblackclaw","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [UnschoolingDiscussion] Re: how unschooling works","postDate":"1110398025","msgId":104335,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PE1HRUxKTUNKRkhQTUZDQU5HSU9LR0VBS0RQQUEudGVtYWlyQGFkZWxwaGlhLm5ldD4=","inReplyToHeader":"PDgxLjIzMGVlZTQ4LjJmNjA5MTNjQGFvbC5jb20+"},"prevInTopic":104327,"nextInTopic":104485,"prevInTime":104334,"nextInTime":104336,"topicId":104173,"numMessagesInTopic":0,"msgSnippet":"I have just become a volunteer tutor for GED classes here in my town.  There is a professional teacher who is also volunteering and she told me that two thirds","messageBody":"<div id=\"ygrps-yiv-866806968\">I have just become a volunteer tutor for GED classes here in my town.  There<br/>\nis a professional teacher who is also volunteering and she told me that two<br/>\nthirds of high school graduates would fail a GED.  And after looking at the<br/>\nprep book and what they have to know, I was horrified at the expectations<br/>\n(or lack thereof) that public school students are supposed to meet.  One of<br/>\nmy sutdents has a diploma from Haiti where she grew up, but she feels she<br/>\nhas something to &quot;prove&quot;, so she is studying to take the GED in English.<br/>\n<br/>\nJudy<br/>\n  -----Original Message-----<br/>\n  From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a>]<br/>\n  Sent: Wednesday, March 09, 2005 12:50 PM<br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a><br/>\n  Subject: Re: [UnschoolingDiscussion] Re: how unschooling works<br/>\n<br/>\n<br/>\n<br/>\n  In a message dated 3/9/2005 10:22:52 AM Mountain Standard Time,<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:knkmoran@...\">knkmoran@...</a> writes:<br/>\n<br/>\n  -=-Just  this week alone I have heard these statements during<br/>\n  conversations with a  cousin and a close friend:  &quot;A GED is not worth<br/>\n  the paper it is  printed on.&quot; - huh? why is that??? -=-<br/>\n<br/>\n<br/>\n  -----------------------<br/>\n<br/>\n  And a high school diploma is worth.... how much? &lt;g&gt;<br/>\n<br/>\n  Sandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: how unschooling works","postDate":"1110390588","msgId":104327,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgxLjIzMGVlZTQ4LjJmNjA5MTNjQGFvbC5jb20+"},"prevInTopic":104323,"nextInTopic":104335,"prevInTime":104326,"nextInTime":104328,"topicId":104173,"numMessagesInTopic":0,"msgSnippet":"In a message dated 3/9/2005 10:22:52 AM Mountain Standard Time, knkmoran@hotmail.com writes: -=-Just  this week alone I have heard these statements during ","messageBody":"<div id=\"ygrps-yiv-496017807\">In a message dated 3/9/2005 10:22:52 AM Mountain Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:knkmoran@...\">knkmoran@...</a> writes:<br/>\n<br/>\n-=-Just  this week alone I have heard these statements during<br/>\nconversations with a  cousin and a close friend:  &quot;A GED is not worth<br/>\nthe paper it is  printed on.&quot; - huh? why is that??? -=-<br/>\n<br/>\n<br/>\n-----------------------<br/>\n <br/>\nAnd a high school diploma is worth.... how much? &lt;g&gt;<br/>\n <br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":173650678,"authorName":"Kim","from":"&quot;Kim&quot; &lt;knkmoran@...&gt;","profile":"knkmoran","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: how unschooling works","postDate":"1110388123","msgId":104323,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQwbmFpcityNHVrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDZFMTU0OUNBLjBFRDFDNDIzLjBCOTdBM0ZCQGFvbC5jb20+"},"prevInTopic":104302,"nextInTopic":104327,"prevInTime":104322,"nextInTime":104324,"topicId":104173,"numMessagesInTopic":0,"msgSnippet":"... huge, raging locomotive that is public education.  ... Isn t this the truth!!  I am still new to homeschooling/unschooling(less than a year), but each","messageBody":"<div id=\"ygrps-yiv-499312965\">--- &quot; It&#39;s the parents that are the problem. Parents, society, and the<br/>\nhuge, raging locomotive that is public education. &quot;<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n<br/>\n<br/>\n </span></blockquote>Isn&#39;t this the truth!!  I am still new to<br/>\nhomeschooling/unschooling(less than a year), but each week that<br/>\npasses, I am so glad of the decision to pull my 14 yo son out of school! <br/>\n<br/>\nJust this week alone I have heard these statements during<br/>\nconversations with a cousin and a close friend:  &quot;A GED is not worth<br/>\nthe paper it is printed on.&quot; - huh? why is that???  And, &quot;If your son<br/>\ndoesn&#39;t learn how to force himself to get through classes he doesn&#39;t<br/>\nlike now, then how will he be successful in college?  Again..huh?  <br/>\n <br/>\nObviously, both of these people are suffering from public education<br/>\nbrainwashing.  They both don&#39;t really get why I&#39;ve decided to<br/>\nhomeschool, even though I&#39;ve tried to explain. And they both have high<br/>\nschool-aged kids as well, and believe the experience is great. I feel<br/>\nsad for them, because this unschooling path that we are on has made<br/>\nsuch a difference in my previously sullen, negative son.  He is still<br/>\ndeschooling, but is slowly becoming more like his old playful, funny<br/>\nself that he used to be before school damaged his spirit.<br/>\n<br/>\nAnd on the subject of public high school...has anyone seen the movie<br/>\n&quot;Mean Girls?&quot;  Someone told me it was kind of funny, so I checked it<br/>\nout and couldn&#39;t believe what I saw!  <br/>\n<br/>\nThe main character lived in Africa with her parents and was<br/>\nhomeschooled her whole life - until her parents returned to the US to<br/>\nteach at a university, and put their daughter in a public HS.  Things<br/>\nwent downhill from there!  Everything that we hate about public HS,<br/>\nshe had to deal with: cliques, pretending to be dumb to get a guy&#39;s<br/>\nattention, not wearing the &quot;right&quot; clothes, the &quot;us against the<br/>\nadults&quot; mentality, pressure to party, the mean, manipulative behavior<br/>\nof peers, and on and on.  It was horrible - and she was miserable and<br/>\nconfused, but her parents kept her there.  And the worst part was, she<br/>\nwent thru all of this angst, just to discover that she wanted to be<br/>\nthe person she was before she started public school!  <br/>\n<br/>\nWhat torture for her - and for me to watch (but of course I couldn&#39;t<br/>\nturn it off - I needed to see how things were going end!). I didn&#39;t<br/>\nget it- we are supposed to be so happy at the end because she &quot;learned<br/>\nher lesson&quot;  and learned how to be herself again?   I think it was<br/>\nsupposed to make HS look like such a character-building time, but in<br/>\nmy opinion, it showed how horrible HS really is, and that the girl&#39;s<br/>\nreal character was developed because she had all those previous years<br/>\nof homeschooling.<br/>\n<br/>\nAny lingering doubts I still may have had about pulling my son out are<br/>\ncompletely gone now!  How can that public education experience be<br/>\npreferable to letting our children find their own path in a more<br/>\npositive and encouraging environment?!<br/>\n<br/>\nJust my recent observations... and proof that unschooling has been an<br/>\neye-opening experience for me as well.<br/>\n<br/>\n~Kim</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"how unschooling works","postDate":"1110375699","msgId":104302,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJDNTAxQUY5LjdGMjEwRjI2LjBCOTdBM0ZCQGFvbC5jb20+"},"prevInTopic":104300,"nextInTopic":104323,"prevInTime":104301,"nextInTime":104303,"topicId":104173,"numMessagesInTopic":0,"msgSnippet":"-=-=-=-If I say Hey, I m sure it will be fabulous , he makes a skeptical face.   And I think it s reasonable for him to be skeptical.  It s not clear to me","messageBody":"<div id=\"ygrps-yiv-1097473003\">-=-=-=-If I say &quot;Hey, I&#39;m sure it will be fabulous&quot;, he makes a skeptical face.   And I think it&#39;s reasonable for him to be skeptical.  It&#39;s not clear to me how to get past that.  When to try to sway him and when to fully accept his decision without argument.-=-=-=-<br/>\n<br/>\nI&#39;d be careful of actually *saying*, &quot;Hey, I&#39;m sure it will be fabulous!&quot;<br/>\n<br/>\nI might say, &quot;Yeah---it might be really lame. Hard to know if we don&#39;t go....&quot; &lt;g&gt; &quot;If it&#39;s fabulous, we can stay and know that we made the right decision and we won&#39;t regret having missed it. If it IS lame, we can leave and pick up sushi.&quot;<br/>\n<br/>\nGenerally mine won&#39;t miss the possibility for sushi! &lt;G&gt;<br/>\n<br/>\nBut mine have had years of learning to trust when I suggest something that might be fabulous. And they can also trust that we&#39;ll leave if it IS lame. <br/>\n<br/>\nTrust. Trust. Trust!<br/>\n<br/>\n~Kelly</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"how unschooling works","postDate":"1110373373","msgId":104300,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZFMTU0OUNBLjBFRDFDNDIzLjBCOTdBM0ZCQGFvbC5jb20+"},"prevInTopic":104173,"nextInTopic":104302,"prevInTime":104299,"nextInTime":104301,"topicId":104173,"numMessagesInTopic":0,"msgSnippet":"-=-=-=-=-You have never read any long-years-experienced unschooler say that the schools should be abolished and everyone should unschool. The thousands of","messageBody":"<div id=\"ygrps-yiv-1779882316\">-=-=-=-=-You have never read any long-years-experienced unschooler say that the schools should be abolished and everyone should unschool. The thousands of hours of writing that&#39;s been put in here, unschooling.com and various other places has  stressed that it takes a LOT of change and awareness on the part of the parents  to do this.  And it takes deschooling on the part of the child and of the  parents.  It&#39;s not easy.  It&#39;s not something just anyone can do.   And half-assed isn&#39;t good enough.  -=-=-=-=-=-<br/>\n<br/>\nWell, *I* have said that schools should be abolished and all kids should unschool! &lt;g&gt;<br/>\n<br/>\nBut I also know that it&#39;s absolutely impossible---for the reasons Sandra gave above.<br/>\n<br/>\nIt&#39;s hard. Hard work. I do believe that *all* children are capable of unschooling. It&#39;s the parents that are the problem. Parents, society, and the huge, raging locomotive that is public education. <br/>\n<br/>\nWon&#39;t happen. Can&#39;t happen.<br/>\n<br/>\n*Should* happen?     Uh huh! &lt;g&gt;<br/>\n<br/>\n&quot;You can say I&#39;m a dreamer....&quot; &lt;bwg&gt;<br/>\n<br/>\n~Kelly, also the realist!</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"how unschooling works","postDate":"1110032174","msgId":104173,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJiLjUyNzhhMjFmLjJmNWIxOTJlQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":104300,"prevInTime":104172,"nextInTime":104174,"topicId":104173,"numMessagesInTopic":0,"msgSnippet":"The negativity of the Not how unscholing works subject line was bothering me.  Found this this morning, a couple of older things  I saved: JUST ADD LIGHT","messageBody":"<div id=\"ygrps-yiv-1210669763\">The negativity of the &quot;Not how unscholing works&quot; subject line was bothering <br/>\nme. &lt;g&gt;<br/>\n<br/>\nFound this this morning, a couple of older things  I saved:<br/>\n<br/>\n<br/>\nJUST ADD LIGHT AND STIR<br/>\n<br/>\nIf you want unschooling to work just <br/>\nbecause you stick the curriculum under the couch, <br/>\nit won&#39;t! Get the world swirling around you <br/>\n(first) and your children (second) so there are <br/>\nsounds, sights, smells, tastes and textures for <br/>\nthem to process and build their internal model of <br/>\nthe universe from. GET MOVING, mentally and <br/>\nphysically. <br/>\n<br/>\n<br/>\n<br/>\nTHIS WAS THE PARENT WRITING of the article on disposable checklists, but this <br/>\nisn’t that, and it has some unmined good stuff for later writings.<br/>\n<br/>\n<br/>\nJust Add Light and Stir<br/>\n<br/>\n<br/>\nIn a message dated 2/1/02 7:10:56 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dawn@...\">dawn@...</a> writes:<br/>\n<br/>\n&lt;&lt; How did you get comfortable with not racing around and<br/>\n&quot;providing&quot; entertainment for your children.  &gt;&gt;<br/>\n<br/>\nGradually!<br/>\n<br/>\nI still provide entertainment for my children (and they provide things for <br/>\nthe rest of the family too, because (shhh...) they think that&#39;s just how <br/>\npeople in families are!  They don&#39;t associate it with unschooling directly.<br/>\n<br/>\n&lt;&lt; He&#39;s only interested in<br/>\nstanding them up and already I&#39;m thinking of chess tournaments&gt;&gt;<br/>\n<br/>\nFind a diagram of the board set up and leave it available.  He can copy that <br/>\npattern or not, but he&#39;ll realize there is a pattern.<br/>\n<br/>\nAnd it&#39;s cool when the chess pieces on the chart don&#39;t look exactly like his <br/>\nown.<br/>\n<br/>\nMaybe check out a book on chess pieces or history of game boards.  Not on <br/>\nchess strategy at all, but on gaming history so he can see the history of the <br/>\npieces and the different forms.  Or if you&#39;re near a games shop, wander by <br/>\nand look at different chess sets on display.  it will be like a teeny chess <br/>\nmuseum.<br/>\n<br/>\nIt doesn&#39;t have to be done at any one moment, just incorporate his interest <br/>\nin chess pieces into your daily considerations until the time when he knows <br/>\nmore about it than you do (unless you&#39;re a whiz, and then sorry for the <br/>\nassumption that you weren&#39;t).<br/>\n<br/>\nOne way for moms who love to checklist their days to provide without managing <br/>\nis to go afield of verbal presentation.  Go through a list of the senses.  <br/>\nAnd if each day you try to provide something interesting to taste, touch, <br/>\nhear, see and smell, his day will be more full than flat.  Too many families <br/>\nstop at things to hear and see. (Because school stops there, I guess.)<br/>\n<br/>\nBut you don&#39;t have to do this until he&#39;s 17.  You can do it until you&#39;re <br/>\nconfident that he&#39;s filled with experiences to cross-reference at his own <br/>\nleisure (in dreams, in fantasies, in future incidents which remind him of <br/>\nthose, etc.) and you feel satisfied that you&#39;re not a slacker.<br/>\n<br/>\nIf just &quot;the five sense&quot; seems a lame checklist and you want four dimensional <br/>\ninstead of three, maybe each day work into conversation something about the <br/>\npast and something about the future.  (I can hardly imagine a day without <br/>\nthose coming up naturally in my own family, but in case you&#39;re not really <br/>\ntalkative or something, it&#39;s something for the checklist.)  If it comes up <br/>\nnaturally in conversation you could say &quot;They didnt&#39; even have chainsaws <br/>\nuntil... [whenever little gasoline engines were common, or whatever the <br/>\nseminal technological feature is] and would have had to do all this with a <br/>\nhand saw, or an axe.  (That&#39;s if you cut firewood with a chainsaw, not if <br/>\nyou&#39;re sitting around working a jigsaw puzzle of tiger cubs in the forest.)  <br/>\nOr you could say &quot;How long do you think we will have these dishes?  When too  <br/>\nmany are broken, what kind should we get next?&quot; (if you have a girl with <br/>\nthose sorts of interests).  Various kinds of mind-casting conversations into <br/>\nthe past (personal past or technological past or cultural past or planetary <br/>\npast) or into the future (tomorrow, next year, next century) help kids build <br/>\ntheir internal model of the universe.  I know I&#39;ve used that phrase half a <br/>\ndozen times talking about unschooling, but I think it&#39;s one of the coolest <br/>\nideas.  <br/>\n<br/>\nAt school, there is a model of knowledge which they&#39;re hoping to insert into <br/>\neach child&#39;s head.  And it has things that are dumb and arbitrary.  Like that <br/>\nthe history of England is way more important than the history of China (in <br/>\nEnglish speaking countries, there&#39;s a lot of justification for that, but <br/>\nstill, let me run my imperfect little thang here), and that there are some <br/>\nauthors EVERYBODY has to know, and others that are TOTALLY optional, <br/>\nmarginal, don&#39;t even brag if you&#39;ve read them.  And that some historical <br/>\ncultures are hugely more important than others.  And some science is FACT and <br/>\nsome is marginal &quot;whatever,&quot; not appearing in this book.<br/>\n<br/>\nSchool kids don&#39;t know the world is a million times bigger than school&#39;s <br/>\nversion of it.<br/>\n<br/>\nUnschooled kids are also making a model of the universe inside them, but <br/>\nthey&#39;re making it their own way, and they&#39;re not valuing the school-bits over <br/>\nthe bits that their model has which are unique to them and their own personal <br/>\ninterests and experiences.<br/>\n<br/>\nThat&#39;s the main reason I think that an unschooler&#39;s checklist should look <br/>\nmore like the five senses and past/future than like science, history, <br/>\nlanguage, math, maybe-music-art-physical education.   Because that model is <br/>\nprescriptive and limiting.  And the other is descriptive and unlimited.<br/>\n<br/>\n(Maybe I just wrote the core of a column for HEM.  I&#39;m saving this one.)<br/>\n<br/>\nSandra<br/>\n<br/>\n=======<br/>\n<br/>\nThe column that became is here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/checklists\">http://sandradodd.com/checklists</a><br/>\n<br/>\nAs often happens, though, the original writing had a liveliness of its own <br/>\nthat didn&#39;t transfer.<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":16252,"nextTopicId":104487}}