{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":171830749,"authorName":"nycartgal2003","from":"&quot;nycartgal2003&quot; &lt;mranzer@...&gt;","profile":"nycartgal2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Was: Oppositional Defiant Disorder--Creating Peace","postDate":"1293849623","msgId":58653,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlmbTQ2bitmOWF1QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":58652,"nextInTime":58654,"topicId":58653,"numMessagesInTopic":0,"msgSnippet":"It s New Year s eve, my husband is working, and my 4 year old son Logan and I are sitting at the computer, he is watching Toy Story 3 , and I have been","messageBody":"<div id=\"ygrps-yiv-1370093899\">It&#39;s New Year&#39;s eve, my husband is working, and my 4 year old son Logan and I are sitting at the computer, he is watching &quot;Toy Story 3&quot;, and I have been reading the thread on this list about ODD.<br/>\n<br/>\nWe stop and chat, he asks me questions about the movie.<br/>\nWe&#39;ve had a busy, socially active few days, so this is downtime is perfect for both of us.<br/>\n<br/>\nI bring him a snack, he says he&#39;s not hungry, and a few minutes later he tells me that he is hungry after all. I could have said, &#39;You just told me you weren&#39;t hungry&quot;. That would have created an adversarial moment between us. Instead, I made a few suggestions, and he decides he wants cucumber. As I am cutting the slices I have a creative flash, and make the slices look like a face, with blueberries for the nose and pupils.<br/>\nHe is delighted with this, and after he finishes eating it, he asks me make another plate.<br/>\nI am getting into it at this point so I cut the slices of cucumber in half to make the smile look better, in my opinion. I knew I was taking a risk because Logan likes things a certain way, including his cucumbers, as circles.<br/>\nAs soon as he sees the plate, he tells me he does not like the cucumbers cut in half. I tell him I will remake it, no problem, and all was well.<br/>\n<br/>\nIn both instances I chose to be his partner and friend.<br/>\nI&#39;m getting better at it, and it pays off because the times I go back to to reacting, Logan reacts right back, and to an outsider, he might be viewed as defiant, difficult or spoiled.<br/>\nMost people don&#39;t examine the parents behavior.<br/>\n<br/>\nMy mom worries about him because she thinks he cries too much.<br/>\nHe has had some major meltdowns around my family, but as I reflect on why it happens I have to come back to me. I get nervous and stressed, and feel judged around them because I parent dfferently than the way I was raised, or how my sister is with my niece. Logan feels my energy, and minor things cause him to have major upsets.<br/>\nThey don&#39;t get the benefit of seeing our happy household on a daily basis.<br/>\n<br/>\nIt&#39;s up to my husband and I to create a loving and peaceful place for our son wherever we are.<br/>\n<br/>\nMeryl</div>","specialLinks":[]}],"prevTopicId":58544,"nextTopicId":58697}}