{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1160699,"authorName":"Penn Acres","from":"&quot;Penn Acres&quot; &lt;pennacres@...&gt;","profile":"mtnsky2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Long--&quot;being with Mom all the time&quot;","postDate":"1093638734","msgId":98908,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMjMwMWM0OGM3NSQwZDJhZmQ4MCQyOGUwYjVkMEBQZW5ubz4=","referencesHeader":"PDUuMi4xLjEuMi4yMDA0MDgyNjA4NDczNS4wMzBiYTY3OEBwb3Auc2hhbm5vbmVudGluLmNvbT4gPDQxMkY1QURDLjEwMDAxMDVAdGhvcm50b25jcmVlay5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":98907,"nextInTime":98909,"topicId":98908,"numMessagesInTopic":0,"msgSnippet":"This is long A couple of activities my  (now 9)  ggd,s tried and didnt want to continue with were: gymnastics, loved it at the early stage-which fortunately","messageBody":"<div id=\"ygrps-yiv-952390689\">This is long<br/>\nA couple of activities my  (now 9)  ggd,s tried and didnt want to continue with were:<br/>\ngymnastics, loved it at the early stage-which fortunately was in a huge arena.<br/>\nQuit because it got too crowded in an interim facility, too much waiting time for their turn, disliked the pushing and meaness from some of the boys when  they were waiting for their turn.  After a move to yet another  and now permanent facility  it began to focus more on the achievements of some  and away from the sheer joy of  movement. I had to stay very aware of the  situations as they arose  and  talk thm over.<br/>\nStephanie likes her figure skating but we don&#39;t go to  out of town performances.  The coldness and rudeness of some of the girls  makes it hard sometimes-she is an outsider in our little town , mainly because she doesnt go to the public school so they dont  see her often. She can&#39;t understand why some kids are like that-basically I tell her that  some kids are smart asses  and do it because they can. Her groups are always small so she gets lots of encouragemen from her instructers who are great. <br/>\nKara likes her  tap dance class  but dropped ballet last  year  before the recital practices started.she didnt want to dress up like a dog and there was no  flexability.Her new teacher  wasn.t   much fun  and  is a hugely phony person  -parents arent allowed which Kara doesnt mind  but apparently  her attitude  wasnt very nice when parents arent there. Kara clued onto that and just opted out.  She was disapointed when the few other girls in tap  wanted to fool around and not dance. Basically they were there because the parents  dropped them off and didnt have the option of quitting . She is really looking forward to it this year as she will have a great teacher she had before.She wants to take ballet if it is a divfferent instructor. She is not  a great dancer -just loves the movement.<br/>\nThey  went to kids soccer and liked it but decided not to go back. they love basketball  and  always look forward to that. <br/>\nThey went to Sparks  for two years and  Brownies for one. They loved Sparks-wonderful leaders. <br/>\nBrownies was right after school in the elemtary school gym and  I tell you it was NUTS&gt;<br/>\nTwo of the leaders were  good and really tried but take  20 7-8 yr olds that just walk down the hall  to the gym right after school on a Thursday and it was ridiculous. I sure dont blame the little girls a bit.<br/>\nOur girls never even mentioned going last fall.<br/>\nMy main  point I guess is think about what will work for &quot;you&quot; first, let the kids decide what they want to do within your abilities. -be aware of whats going on in the classes/sports all the time.<br/>\n Do I think its important? Yes.<br/>\n Actually we were driving  15 miles to  town 4 or 5 days a week  during fall-winter.<br/>\n We unschool-We live in an isolated area- the kids want to -and  get huge benefits from it. Also they are well fed and well rested and  not tired from a long day at school.<br/>\nIts a major part of Unschooling for them given our  circumstances.<br/>\nGrace<br/>\nIn the Rocky Mountains of BC where the sun is coming out..<br/>\ngetting ready to feed &#39;um and  go bring a horse home.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":98896,"nextTopicId":98909}}