{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":12,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Food and balance","postDate":"1315756175","msgId":62869,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgzMkE5RjczLTNGRjMtNEJERi1CQjc2LTk0OEE1ODIzREI1MEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGo0aWEwbit2MXYzQGVHcm91cHMuY29tPg==","referencesHeader":"PGo0aWEwbit2MXYzQGVHcm91cHMuY29tPg=="},"prevInTopic":62867,"nextInTopic":0,"prevInTime":62868,"nextInTime":62870,"topicId":62844,"numMessagesInTopic":0,"msgSnippet":"-=-I had forgotten to mention the very issue that prompted me to write in the first place. I ve noticed he does tend to get quite constipated when he hasn t","messageBody":"<div id=\"ygrps-yiv-564756814\">-=-I had forgotten to mention the very issue that prompted me to write in the first place. I&#39;ve noticed he does tend to get quite constipated when he hasn&#39;t eaten fruit for a few days. He gets very distressed by this. We do know several helpful things that can ease this problem, but obviously prefer to avoid it - seeing him in such discomfort and apparent pain is really hard to take. I think this has caused myself and my partner to perhaps be a bit pushy with fruit through our fear of seeing him go through it again. I regret this and really want to find a better way to help him.-=-<br/>\n<br/>\nIf he will take pills, or if you can work it in elsewhere, there is an Ayurvedic thing called TriPhala.  Don&#39;t get the laxative, just the basic pills.  It&#39;s a fruit combo without tasting or feeling like fruit.<br/>\n<br/>\nIf a child is still nursing, and he&#39;s surrounded by food, he&#39;s unlikely to starve.  If food is out in reach, he&#39;s provided for.  If he gets mad about you offering food, don&#39;t put it right in front of him and pressure him to eat it.  Put it out where you and others might also eat from it.  Maybe he&#39;s feeling that the monkey platters were more pressure and criticism than they were love.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Food and balance","postDate":"1315751646","msgId":62867,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTU3NTE2NDYuNTQ1NDcuWWFob29NYWlsTmVvQHdlYjgxNTA0Lm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PGo0aWdkcysyaHRsQGVHcm91cHMuY29tPg==","referencesHeader":"PGo0aWEwbit2MXYzQGVHcm91cHMuY29tPiA8ajRpZ2RzKzJodGxAZUdyb3Vwcy5jb20+"},"prevInTopic":62866,"nextInTopic":62869,"prevInTime":62866,"nextInTime":62868,"topicId":62844,"numMessagesInTopic":0,"msgSnippet":"Dulce the Leche is very easy to make at home. You get a can of condensed milk ( which is really good with apple slices too!) and you place in a pressure cooker","messageBody":"<div id=\"ygrps-yiv-1519740316\">Dulce the Leche is very easy to make at home. You get a can of condensed milk ( which is really good with apple slices too!)<br/>\nand you place in a pressure cooker covered with water and cook for an hour . Wait till it cools down before you open the can or it will explode out of it and burn you.<br/>\nYou can cook on a regular pot covered with water but then it will take more than two hours.<br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n <br/>\n <br/>\n <br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: sheeboo2 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:brmino@...\">brmino@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nSent: Sunday, September 11, 2011 9:26 AM<br/>\nSubject: [AlwaysLearning] Re: Food and balance<br/>\n<br/>\n<br/>\n  <br/>\nWe&#39;ve found that a teaspoon or two of honey is a yummy natural stool softener/laxative. I&#39;ve read why that is, but don&#39;t remember off-hand. You could google it. <br/>\n<br/>\nDo you know what Dulce de leche is? It&#39;s like carmel, but even more delicious, IMO.   I wonder if he&#39;d eat apple or pear slices dipped in that? <br/>\n<br/>\nBrie<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":472480490,"authorName":"sheeboo2","from":"&quot;sheeboo2&quot; &lt;brmino@...&gt;","profile":"sheeboo2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Food and balance","postDate":"1315751164","msgId":62866,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo0aWdkcysyaHRsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGo0aWEwbit2MXYzQGVHcm91cHMuY29tPg=="},"prevInTopic":62864,"nextInTopic":62867,"prevInTime":62865,"nextInTime":62867,"topicId":62844,"numMessagesInTopic":0,"msgSnippet":"We ve found that a teaspoon or two of honey is a yummy natural stool softener/laxative. I ve read why that is, but don t remember off-hand. You could google","messageBody":"<div id=\"ygrps-yiv-662944737\">We&#39;ve found that a teaspoon or two of honey is a yummy natural stool softener/laxative. I&#39;ve read why that is, but don&#39;t remember off-hand. You could google it.  <br/>\n<br/>\nDo you know what Dulce de leche is? It&#39;s like carmel, but even more delicious, IMO.   I wonder if he&#39;d eat apple or pear slices dipped in that?  <br/>\n<br/>\nBrie</div>","specialLinks":[]},{"userId":339854457,"authorName":"candimuse","from":"&quot;candimuse&quot; &lt;nandi@...&gt;","profile":"candimuse","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Food and balance","postDate":"1315744599","msgId":62864,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo0aWEwbit2MXYzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGo0ZTVncStkMHNnQGVHcm91cHMuY29tPg=="},"prevInTopic":62863,"nextInTopic":62866,"prevInTime":62863,"nextInTime":62865,"topicId":62844,"numMessagesInTopic":0,"msgSnippet":"Thanks for all your replies. Apologies for not responding sooner - my partner has been unwell so I haven t had a chance to write a reply until now. I had","messageBody":"<div id=\"ygrps-yiv-1879265681\">Thanks for all your replies. Apologies for not responding sooner - my partner has been unwell so I haven&#39;t had a chance to write a reply until now.<br/>\n<br/>\nI had forgotten to mention the very issue that prompted me to write in the first place. I&#39;ve noticed he does tend to get quite constipated when he hasn&#39;t eaten fruit for a few days. He gets very distressed by this. We do know several helpful things that can ease this problem, but obviously prefer to avoid it - seeing him in such discomfort and apparent pain is really hard to take. I think this has caused myself and my partner to perhaps be a bit pushy with fruit through our fear of seeing him go through it again. I regret this and really want to find a better way to help him.<br/>\n<br/>\nHe never eats a large quantity of fruit - I think eight small strawberries in one go is the most he&#39;s had in the past year. He hasn&#39;t had any fruit or vegetables at all for the last two days.<br/>\n<br/>\nThe fact is he really doesn&#39;t have a large appetite in general - he never has. <br/>\nI think another reason my concern suddenly increased is that he has just come to the end of a growth spurt, the only one he&#39;s ever had, so now is probably just returning to more of a subsistence way of eating, which is more usual for him. Maybe I need to accept that he really needs very little food to be okay.<br/>\n<br/>\nOne thing that does comfort me is that he is still breastfeeding  - and I notice he has more of my milk when he&#39;s eating less fresh fruit and vegetables.<br/>\n<br/>\nThanks for all the suggestions about baking - I will note the ideas that might have any chance of being appealing to him; he won&#39;t try pancakes or anything similar, or any bread except shop-bought soft white bread or tortilla wraps. Also he doesn&#39;t like anything with bits in it so no choc chips, dried fruit or anything that makes it taste a bit different. Even the taste of banana in a cake recipe puts him off, so nut or seed butters may be hard to disguise. He doesn&#39;t even like Nutella, which is strange as he loves chocolates with smooth hazelnut truffle centres - maybe ground almonds in small quantities might be okay. <br/>\nI&#39;d love to find a way to make tiny amounts of cake - he only has a tiny amount of cake even if it&#39;s a kind he really likes, and I don&#39;t like eating all the leftovers. Any tips welcome!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;Involve him in baking and making.<br/>\n<br/>\n </span></blockquote>Yes, thanks for reminding me - after I read that we made some molasses flapjacks together, great fun.<br/>\n<br/>\nAlso thanks for the tip about pasta made with legumes - I will look for some of that.<br/>\n<br/>\nOne of the things he&#39;s very specific about is that he doesn&#39;t like different foods mixed together, with a few exceptions. When he has pasta or rice he will only eat it completely plain - no sauce on it, no cheese. He goes through phases when he&#39;ll have a bit of olive oil on pasta. Once in a while he&#39;ll eat plain soya or Greek yogurt, usually on it&#39;s own but sometimes with raspberries added.<br/>\nHe will have a few things spread on bread - butter, mayonnaise, sometimes houmous or even a cheese sandwich. He won&#39;t eat home-made houmous of any kind - he can taste the difference between home-made and shop-bought and I haven&#39;t found how to replicate that taste.<br/>\n<br/>\nThanks for the reminder about vitamin supplements - one of the more recent changes is that he&#39;s gone from having maybe half a small glass of fruit juice or smoothie a day, to a few sips a day, so it seems to me he must be getting little or no &quot;antioxidant&quot; vitamins from food. We used to give him vitamin supplements but he went right off them about a year ago, but it might be worth having another look at finding a different supplement that he may like. I haven&#39;t found fortified versions of any of the foods he eats regularly.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;Sometimes having a taste for one food can signal a nutritional need - chocolate<br/>\n </span></blockquote>is a &quot;rich&quot; taste which suggests fat in particular. If he likes cookies and<br/>\ncakes, make them with added nuts - nut butters or meals can make a plain cake<br/>\nmix incredibly rich and also very filling, And you can feel good about him<br/>\neating it.<br/>\n<br/>\nYes, I have thought he may be trying to get protein or fat - so far I haven&#39;t found any other high fat or protein rich food that he&#39;ll eat regularly and he&#39;ll only eat tiny portions.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;&gt;Also, make up plates with several foods on them and put<br/>\n </span></blockquote>them where he is, rather than asking &quot;what do you want&quot;? Bring him a plate of<br/>\nchoices and let him eat without making an issue out of it.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;When I ask my kids what they want to eat, it&#39;s almost invariably some form<br/>\n </span></blockquote>of wheat or dairy. But when I put out a monkey platter with crackers,<br/>\ncheese, nuts, cucumbers, carrots, cherry tomatoes, apples, it&#39;ll pretty much<br/>\nall get eaten. Especially when the veggies come alongside...<br/>\n<br/>\nYes, we were in the habit of making monkey platters- it seemed great at first, but when he started eating only one of the foods on the plate and leaving all others, we became a bit discouraged and stopped offering them. It&#39;s probably worth trying again now though. But even presented in interested ways - different shapes and sizes, cooked, raw - he just won&#39;t eat them. Once in a while he tries a tiny nibble but always spits it straight out.<br/>\nI did one the evening I read the replies to my post - he ate all the white bread with butter and mayonnaise, the small piece of flapjack, a tiny nibble of digestive biscuit, all the cheese and didn&#39;t touch the banana or cherry tomato, but then he did ask for more cheese, which he wanted me to cut into tiny shapes before he would eat it - minuscule triangles, circles and letter shapes!<br/>\n<br/>\nHowever, more often he wants to be in direct control so wants only to be given food he has specifically asked for - if he has unasked for food left close to him when he feels this way he can get quite upset.<br/>\n<br/>\nSo, after all that - I think maybe what I need to do is step back and wait for a while. I will take note of all the ideas from your replies, and will be able to try them as seems appropriate. If anybody has any more ideas to add I&#39;d be very grateful and I&#39;ll put them on my list. Thanks again to all of you.<br/>\n<br/>\nNandi</div>","specialLinks":[]},{"userId":183568025,"authorName":"Bob Collier","from":"&quot;Bob Collier&quot; &lt;bobcollier@...&gt;","profile":"quaussiebob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Food and balance","postDate":"1315701883","msgId":62863,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo0aDA5cis3aDUwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PERGQzIzMTVGLUIzMEUtNDEzQy04RTBFLUVDMzM0ODY4QkFCMkB2ZXJpem9uLm5ldD4="},"prevInTopic":62855,"nextInTopic":62864,"prevInTime":62862,"nextInTime":62864,"topicId":62844,"numMessagesInTopic":0,"msgSnippet":"... Here s something I wrote before. Message #54523: Whenever the issue of food comes up, I m always tempted to mention how my son Patrick lived for two years","messageBody":"<div id=\"ygrps-yiv-1950895840\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Joyce Fetteroll &lt;jfetteroll@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; Four is the age when Kathryn&#39;s tastes narrowed too. Before that she  <br/>\n&gt; had a wide variety of foods she&#39;d eat. Between 4 and 11, it narrowed  <br/>\n&gt; way down. Then at pre-puberty suddenly food tasted good again. I  <br/>\n&gt; really think other than the few foods she&#39;d eat (cereal, fruit, fresh  <br/>\n&gt; macaroni and cheese, olives, ice cream) food honestly didn&#39;t taste good.<br/>\n&gt; <br/>\n&gt; It&#39;s so common, there must be a reason for it but it sure doesn&#39;t seem  <br/>\n&gt; logical or healthy! Growth up to puberty is very slow so that may be a  <br/>\n&gt; factor. But you&#39;d think the appetite would just go down, not the  <br/>\n&gt; number of foods.<br/>\n&gt; <br/>\n&gt; What helps loads is having read dozens of similar stories of kids who  <br/>\n&gt; did just fine during those years!<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Here&#39;s something I wrote before. Message #54523:<br/>\n<br/>\nWhenever the issue of food comes up, I&#39;m always tempted to mention how my son Patrick lived for two years on pasta, rice and water and an occasional spaghetti bolognese or visit to McDonald&#39;s for chicken nuggets and french fries and remained healthy, but I don&#39;t know if that&#39;s particularly helpful.<br/>\n<br/>\nIt&#39;s a true story anyway.<br/>\n<br/>\n<br/>\nThere&#39;s more detail in Message #46940.<br/>\n<br/>\nAnd before anybody takes me to task (and rightly so) for inaccurate thinking, please read &quot;hardly any of his diet is junk food&quot; as ... maybe ... &quot;hardly any of his diet is food that wouldn&#39;t get Jamie Oliver&#39;s tick of approval&quot;. :-)<br/>\n<br/>\nBob</div>","specialLinks":[]},{"userId":472480490,"authorName":"sheeboo2","from":"&quot;sheeboo2&quot; &lt;brmino@...&gt;","profile":"sheeboo2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Food and balance","postDate":"1315608922","msgId":62855,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo0ZTVncStkMHNnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGo0ZDFiZytmY29qQGVHcm91cHMuY29tPg=="},"prevInTopic":62851,"nextInTopic":62863,"prevInTime":62854,"nextInTime":62856,"topicId":62844,"numMessagesInTopic":0,"msgSnippet":"I don t think you need to worry--he sounds healthy. We experienced the same sudden discrimination at 4 too--what was helpful for me (for my own concern) was to","messageBody":"<div id=\"ygrps-yiv-1260993209\">I don&#39;t think you need to worry--he sounds healthy. We experienced the same sudden discrimination at 4 too--what was helpful for me (for my own concern) was to look for ways to make the things Noor liked more nutrient dense.  Instead of thinking about limiting things (like chocolate), look for ways to add to what he&#39;s eating.<br/>\n<br/>\nIn the past few years I started buying pasta that&#39;s made with legume flours and loaded with omegas for my daughter who easily eats pasta 4-5 times a week. It isn&#39;t like whole wheat pasta, which we both find too mushy and sweet.  It tastes just like semolina-only pasta. In the States, I buy Barilla Plus, which has 10g of protein per serving versus the 4g in the regular kind:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.barillaus.com/Pages/Product-Landing.aspx?brandID=5\">http://www.barillaus.com/Pages/Product-Landing.aspx?brandID=5</a><br/>\nThe first time I had something similar was in the UK, so I know the same thing, maybe a different brand, is available there too.<br/>\n<br/>\nDoes he like other kinds of bread besides white bread?  Breads made with sprouted grains and/or wheat berries are higher in protein.  Noor really likes wheat berries, so I add them to a lot of things when I&#39;m concerned about her protein intake.  Soaked over night, and then cooked, they&#39;re yummy mixed into rice. If you make brown rice, you can cook them with the rice, just add more water.  White rice cooks faster than the berries, so you&#39;ll need to cook them separately and then mix together.<br/>\n<br/>\nAnother thing we do is make Gamazio: toasted sesame seeds ground with a bit of salt that we use as a topping for rice and popcorn. I make a lot at once and freeze it.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://fanaticcook.blogspot.com/2005/01/gomasio-sesame-salt.html\">http://fanaticcook.blogspot.com/2005/01/gomasio-sesame-salt.html</a><br/>\n<br/>\nIt&#39;s awesome that he likes butter. Buy the highest quality butter you can afford and add it to everything he&#39;ll eat it with: pasta, rice, potatoes, popcorn.  Butter is one of those nutritional super foods in that it packs a lot of bang in small amounts--great source of fats and protein.<br/>\n<br/>\nHave you ever tried adding roasted red peppers to your hummus recipe?  Delish:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://allrecipes.com/Recipe/easy-roasted-red-pepper-hummus/detail.aspx\">http://allrecipes.com/Recipe/easy-roasted-red-pepper-hummus/detail.aspx</a><br/>\n<br/>\nSmoothies (frozen fruit, soaked almonds, yogurt, sometimes a green powder--some are super sweet and not at all like eating a handful of grass) have been a mainstay here for years. An exciting selection of drinking straws is a nice accompaniment.<br/>\n<br/>\nDoes he like pancakes? waffles? crepes?  other baked goods?  Look for recipes that you can play around with to increase the nutritional density with additional eggs, nut or legume flours like Meredith suggested, ground flax or other seeds, experiment with wheat, spelt, barley and oat flours. And like Joyce suggested, try adding nuts, fruit and veg AND chocolate chips to your baked goods--berries in muffins or pancakes, dried fruit in cookies, zucchini bread or carrot cake with chocolate chips....oooo, now I&#39;m hungry.<br/>\n<br/>\nBrie</div>","specialLinks":[]},{"userId":185586397,"authorName":"lylaw","from":"&quot;lylaw&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Food and balance","postDate":"1315588305","msgId":62851,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJEQTVFNUIyQUM4RDRGM0FBMEUzN0RGQTZGMzYwMjIxQEx5bGFQQz4=","inReplyToHeader":"PGo0ZDFiZytmY29qQGVHcm91cHMuY29tPg==","referencesHeader":"PGo0ZDFiZytmY29qQGVHcm91cHMuY29tPg=="},"prevInTopic":62849,"nextInTopic":62855,"prevInTime":62850,"nextInTime":62852,"topicId":62844,"numMessagesInTopic":0,"msgSnippet":"in addition to the feedback you’ve already gotten, have you tried monkey platters, rather than “offering” foods?  my son, who’s my selective eater","messageBody":"<div id=\"ygrps-yiv-1955855215\">in addition to the feedback you’ve already gotten, have you tried monkey platters, rather than “offering” foods?  my son, who’s my selective eater (still is at 13!), would almost always say no at age 4 if offered food.  even now, he prefers to tell me when he’s hungry, and then have me bring him food without asking what he wants, because his first reaction to every food offered is generally no, but when it’s just put in front of him, foods he would have rejected appeal more.  <br/>\n<br/>\nso, if you haven’t, try trays with little bits of everything he likes, (or several things) and maybe a new thing you think he might like, arranged in an appealing way. don’t even say anything – just set it down in his vicinity, while he’s doing something.  also, having easy access shelf, tray, and/or cupboard in the kitchen with easy to grab foods he likes might be appealing.  <br/>\n<br/>\nalso, the variety you list doesn’t seem that narrow to me, believe it or not.  I have known *many* children who ate no veggies or fruits at all for a while, and others who would only eat baby carrots, for instance.  it’s amazing how resilient our bodies are, and our kids seem to really know, for the most part, when they need something.  my son would go days with very little produce and then eat an entire basket or more of blackberries, 3 days in a row.  <br/>\n<br/>\nalso, the research I’ve read shows that young kids tend to balance out their nutrition over the course of a week or so, rather than day to day or meal to meal.  you might be surprised how balanced his intake is, over that time period!<br/>\n<br/>\nwarmly, lyla<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":223034209,"authorName":"Genevieve Raymond","from":"Genevieve Raymond &lt;genevieve.raymond@...&gt;","profile":"genevieveraymond","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Food and balance","postDate":"1315581501","msgId":62847,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBS0xzV1k0PVNMUmNmQnNPeTFBNDYtOGJya0JyeGlGbWdoT3B0aTlMQVJ5MUdTVj1vZ0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGo0ZDk0dStpZGZtQGVHcm91cHMuY29tPg==","referencesHeader":"PGo0ZDFiZytmY29qQGVHcm91cHMuY29tPgk8ajRkOTR1K2lkZm1AZUdyb3Vwcy5jb20+"},"prevInTopic":62846,"nextInTopic":62849,"prevInTime":62846,"nextInTime":62848,"topicId":62844,"numMessagesInTopic":0,"msgSnippet":"The monkey platter has really saved us here (or at least saved me from worry).  I wasn t clear from your message whether you re offering a wide variety of","messageBody":"<div id=\"ygrps-yiv-2000409401\">The monkey platter has really saved us here (or at least saved me from<br/>\nworry).  I wasn&#39;t clear from your message whether you&#39;re offering a wide<br/>\nvariety of foods by actually presenting them to him on a platter, all<br/>\ntogether, or just asking &quot;What would you like? Here&#39;s what we have...&quot;<br/>\n<br/>\nWhen I ask my kids what they want to eat, it&#39;s almost invariably some form<br/>\nof wheat or dairy.  But when I put out a monkey platter with crackers,<br/>\ncheese, nuts, cucumbers, carrots, cherry tomatoes, apples, it&#39;ll pretty much<br/>\nall get eaten.  Especially when the veggies come alongside...<br/>\n<br/>\n...vinaigrette!<br/>\n<br/>\nMy kids will eat ANYTHING dipped in vinaigrette.<br/>\n<br/>\nOh, and ditto on the smoothies.  And I&#39;ll throw a few leaves of young kale<br/>\ninto a smoothie, some nut butter, some cinnamon just to boost the<br/>\nnutritional content.<br/>\n<br/>\nAnother thing I&#39;ve noticed is that if I get the platter out before anybody<br/>\nstarts saying they&#39;re hungry, we don&#39;t hit the &quot;white foods&quot; (milk, wheat,<br/>\netc.) nearly as hard.<br/>\n<br/>\nOne last thing--I realized I was turning into a bit of a vegetable pusher to<br/>\nthe point where my once vegetable-eating kids were turning off to them.  I<br/>\nthink it probably happened right around the same age your son is, when their<br/>\ntastes narrowed, and I just started freaking out a little.  Even though I<br/>\n*knew* pushing veggies was only bound to make my kids more averse to them.<br/>\nLately my husband and I have really backed off from that.  Ice cream for<br/>\nbreakfast?  Sure!  Bowl after bowl of Cheerios?  What the heck!  Now my kids<br/>\ncan&#39;t stop exclaiming how much they love the salad I made or the quinoa or<br/>\nthe curried* *sweet potatoes or the [insert previously icky food here].<br/>\nThey&#39;ll even say to each other, &quot;You have to try the quinoa!  It&#39;s so good!&quot;<br/>\nThey&#39;re 6, almost 7 now, not sure if the age makes a difference too.<br/>\n<br/>\nGenevieve<br/>\n<br/>\nOn Fri, Sep 9, 2011 at 7:51 AM, plaidpanties666<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:plaidpanties666@...\">plaidpanties666@...</a>&gt;wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Four is a pretty common age for food choices to narrow down, And its also<br/>\n&gt; an age where kids tend to have more of an opinion as to what comes into the<br/>\n&gt; house in terms of food - before 4 kids are more interested in being able to<br/>\n&gt; choose from what&#39;s already in the house, I mean, which makes it easier for<br/>\n&gt; parents to provide options with which they are comfortable.<br/>\n&gt;<br/>\n&gt; &gt;&gt; The only fruit and vegetables he ever eats are strawberries,<br/>\n&gt; raspberries, blackberries, banana, cherry tomatoes and olives.<br/>\n&gt; *****************<br/>\n&gt;<br/>\n&gt; That&#39;s a pretty good assortment. It can help, in terms of reassuring<br/>\n&gt; yourself, to notice what he likes to drink, too. Some parents take solace in<br/>\n&gt; offering smoothies and home-made juices, although not all kids will go for<br/>\n&gt; them. If you&#39;re worried about him not getting enough vitamins, offer<br/>\n&gt; vitamins. But if he&#39;s healthy, that&#39;s a good sign that he&#39;s getting &quot;enough&quot;<br/>\n&gt; of what he needs. If the chips and cereal he eats are fortified, he&#39;s<br/>\n&gt; getting vitamins from those, too - that&#39;s something parents forget when<br/>\n&gt; worrying about &quot;fruits and vegetables&quot;. In our modern world, there are other<br/>\n&gt; sources of the same nutrients.<br/>\n&gt;<br/>\n&gt; &gt; Most of the time when he&#39;s hungry he just asks for chocolate.<br/>\n&gt;<br/>\n&gt; Isn&#39;t chocolate a food group? I&#39;m teasing you.<br/>\n&gt; Make sure you&#39;re offering plenty of foods with lots of protein and fat.<br/>\n&gt; Sometimes having a taste for one food can signal a nutritional need -<br/>\n&gt; chocolate is a &quot;rich&quot; taste which suggests fat in particular. If he likes<br/>\n&gt; cookies and cakes, make them with added nuts - nut butters or meals can make<br/>\n&gt; a plain cake mix incredibly rich and also very filling, And you can feel<br/>\n&gt; good about him eating it.<br/>\n&gt;<br/>\n&gt; &gt;He is often offered other food ... before he gets hungry enough to ask and<br/>\n&gt; sometimes he accepts, other times says he&#39;d prefer chocolate. Usually in<br/>\n&gt; this case I or my partner will suggest he has a bit of both, and our son is<br/>\n&gt; usually happy to do this.<br/>\n&gt; **************<br/>\n&gt;<br/>\n&gt; Sounds like a good plan. Also, make up plates with several foods on them<br/>\n&gt; and put them where he is, rather than asking &quot;what do you want&quot;? Bring him a<br/>\n&gt; plate of choices and let him eat without making an issue out of it.<br/>\n&gt;<br/>\n&gt; ---Meredith<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Food and balance","postDate":"1315579870","msgId":62846,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo0ZDk0dStpZGZtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGo0ZDFiZytmY29qQGVHcm91cHMuY29tPg=="},"prevInTopic":62845,"nextInTopic":62847,"prevInTime":62845,"nextInTime":62847,"topicId":62844,"numMessagesInTopic":0,"msgSnippet":"Four is a pretty common age for food choices to narrow down, And its also an age where kids tend to have more of an opinion as to what comes into the house in","messageBody":"<div id=\"ygrps-yiv-968623753\">Four is a pretty common age for food choices to narrow down, And its also an age where kids tend to have more of an opinion as to what comes into the house in terms of food - before 4 kids are more interested in being able to choose from what&#39;s already in the house, I mean, which makes it easier for parents to provide options with which they are comfortable. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; The only fruit and vegetables he ever eats are strawberries, raspberries, blackberries, banana, cherry tomatoes and olives.<br/>\n </span></blockquote>*****************<br/>\n<br/>\nThat&#39;s a pretty good assortment. It can help, in terms of reassuring yourself, to notice what he likes to drink, too. Some parents take solace in offering smoothies and home-made juices, although not all kids will go for them. If you&#39;re worried about him not getting enough vitamins, offer vitamins. But if he&#39;s healthy, that&#39;s a good sign that he&#39;s getting &quot;enough&quot; of what he needs. If the chips and cereal he eats are fortified, he&#39;s getting vitamins from those, too - that&#39;s something parents forget when worrying about &quot;fruits and vegetables&quot;. In our modern world, there are other sources of the same nutrients. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Most of the time when he&#39;s hungry he just asks for chocolate.<br/>\n<br/>\n </span></blockquote>Isn&#39;t chocolate a food group? I&#39;m teasing you. <br/>\nMake sure you&#39;re offering plenty of foods with lots of protein and fat. Sometimes having a taste for one food can signal a nutritional need - chocolate is a &quot;rich&quot; taste which suggests fat in particular. If he likes cookies and cakes, make them with added nuts - nut butters or meals can make a plain cake mix incredibly rich and also very filling, And you can feel good about him eating it. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;He is often offered other food ... before he gets hungry enough to ask and sometimes he accepts, other times says he&#39;d prefer chocolate. Usually in this case I or my partner will suggest he has a bit of both, and our son is usually happy to do this.<br/>\n </span></blockquote>**************<br/>\n<br/>\nSounds like a good plan. Also, make up plates with several foods on them and put them where he is, rather than asking &quot;what do you want&quot;? Bring him a plate of choices and let him eat without making an issue out of it. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":231415297,"authorName":"chris ester","from":"chris ester &lt;chris.homeschool@...&gt;","profile":"chris_e_bear","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Food and balance","postDate":"1315577966","msgId":62849,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBTXVqbWR2M2ZkejhUR3phUy11Mz14WlJGNS15T3ArYnhvR0x5QnJYdHVEcU10ZjkrQUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PERGQzIzMTVGLUIzMEUtNDEzQy04RTBFLUVDMzM0ODY4QkFCMkB2ZXJpem9uLm5ldD4=","referencesHeader":"PGo0ZDFiZytmY29qQGVHcm91cHMuY29tPgk8REZDMjMxNUYtQjMwRS00MTNDLThFMEUtRUMzMzQ4NjhCQUIyQHZlcml6b24ubmV0Pg=="},"prevInTopic":62847,"nextInTopic":62851,"prevInTime":62848,"nextInTime":62850,"topicId":62844,"numMessagesInTopic":0,"msgSnippet":"... going out with the group to gather (in stone age tech era) and so being reticent to taste just anything  would be safer.  Or maybe, since there is so much","messageBody":"<div id=\"ygrps-yiv-1364048109\">On Fri, Sep 9, 2011 at 9:10 AM, Joyce Fetteroll &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jfetteroll@...\">jfetteroll@...</a>&gt;wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &gt;&gt;I really think other than the few foods she&#39;d eat (cereal, fruit, fresh<br/>\n&gt; &gt;&gt;macaroni and cheese, olives, ice cream) food honestly didn&#39;t taste good.<br/>\n&gt;<br/>\n&gt; &gt;&gt;It&#39;s so common, there must be a reason for it but it sure doesn&#39;t seem<br/>\n&gt; &gt;&gt;logical or healthy! Growth up to puberty is very slow so that may be a<br/>\n&gt; &gt;&gt;factor. But you&#39;d think the appetite would just go down, not the<br/>\n&gt; &gt;&gt;number of foods.<br/>\n&gt;<br/>\n&gt; My theory is that this is the age and size when kids would probably start<br/>\n </span></blockquote>going out with the group to gather (in stone age tech era) and so being<br/>\nreticent to taste just anything  would be safer.  Or maybe, since there is<br/>\nso much else going on developmentally they just don&#39;t have the neurological<br/>\nprocessing space for a bunch of different taste.<br/>\n<br/>\nBut I agree that if you just hang on and trust they turn out just fine.  My<br/>\nson didn&#39;t drink milk for years, he would use soy milk on his cereal and he<br/>\nwould still eat some veggies (mostly broccoli and carrots) so I just kept<br/>\ntaking deep breaths and trusting.<br/>\n<br/>\nI just realized that my daughter was not as narrow as my son.  I wonder if<br/>\nthere is a gender difference?<br/>\nChris<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Food and balance","postDate":"1315573812","msgId":62845,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PERGQzIzMTVGLUIzMEUtNDEzQy04RTBFLUVDMzM0ODY4QkFCMkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGo0ZDFiZytmY29qQGVHcm91cHMuY29tPg==","referencesHeader":"PGo0ZDFiZytmY29qQGVHcm91cHMuY29tPg=="},"prevInTopic":62844,"nextInTopic":62846,"prevInTime":62844,"nextInTime":62846,"topicId":62844,"numMessagesInTopic":0,"msgSnippet":"... Four is the age when Kathryn s tastes narrowed too. Before that she had a wide variety of foods she d eat. Between 4 and 11, it narrowed way down. Then at","messageBody":"<div id=\"ygrps-yiv-1086321823\">On Sep 9, 2011, at 8:38 AM, candimuse wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I feel confused because it seems that though we are providing a wide  <br/>\n&gt; choice of fruit and vegetables, bread, pasta, grains, cheese, beans  <br/>\n&gt; and other protein foods as well as sweets, chocolate and crisps  <br/>\n&gt; (potato chips), my son is choosing less and less fruit and  <br/>\n&gt; vegetables and more and more chocolate, supplemented by white bread  <br/>\n&gt; and butter and pasta and maybe a few times a week very small amounts  <br/>\n&gt; of other foods - houmous, cheese, cake, crisps. The only fruit and  <br/>\n&gt; vegetables he ever eats are strawberries, raspberries, blackberries,  <br/>\n&gt; banana, cherry tomatoes and olives.<br/>\n<br/>\n </span></blockquote>Four is the age when Kathryn&#39;s tastes narrowed too. Before that she  <br/>\nhad a wide variety of foods she&#39;d eat. Between 4 and 11, it narrowed  <br/>\nway down. Then at pre-puberty suddenly food tasted good again. I  <br/>\nreally think other than the few foods she&#39;d eat (cereal, fruit, fresh  <br/>\nmacaroni and cheese, olives, ice cream) food honestly didn&#39;t taste good.<br/>\n<br/>\nIt&#39;s so common, there must be a reason for it but it sure doesn&#39;t seem  <br/>\nlogical or healthy! Growth up to puberty is very slow so that may be a  <br/>\nfactor. But you&#39;d think the appetite would just go down, not the  <br/>\nnumber of foods.<br/>\n<br/>\nWhat helps loads is having read dozens of similar stories of kids who  <br/>\ndid just fine during those years!<br/>\n<br/>\nWhat about combining some of the things he does like. Nutella on  <br/>\ntoast. Chocolate chip muffins. (I love them with pumpkin :-) Oatmeal  <br/>\nchocolate chip cookies.<br/>\n<br/>\nInvolve him in baking and making. And perhaps in the spring, a small  <br/>\ncontainer garden of his own choosing.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":339854457,"authorName":"candimuse","from":"&quot;candimuse&quot; &lt;nandi@...&gt;","profile":"candimuse","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Food and balance","postDate":"1315571888","msgId":62844,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo0ZDFiZytmY29qQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":62845,"prevInTime":62843,"nextInTime":62845,"topicId":62844,"numMessagesInTopic":0,"msgSnippet":"My son is 4 and a half. I have been reading Sandra Dodd s website and this list for at least a couple of years, and have been seeing my son blossom - the more","messageBody":"<div id=\"ygrps-yiv-1660205520\">My son is 4 and a half. I have been reading Sandra Dodd&#39;s website and this list for at least a couple of years, and have been seeing my son blossom - the more freedom he has and the more I have questioned my thoughts and opened my mind, the happier he seems to be. I want to express my immense gratitude to all contributors.<br/>\n<br/>\nOne aspect that I still find hard to deal with is his food choices. I have read all I could find here about other people&#39;s experiences with their children and eating and find none of these seem to match my own.<br/>\n <br/>\nI feel confused because it seems that though we are providing a wide choice of fruit and vegetables, bread, pasta, grains, cheese, beans and other protein foods as well as sweets, chocolate and crisps (potato chips), my son is choosing less and less fruit and vegetables and more and more chocolate, supplemented by white bread and butter and pasta and maybe a few times a week very small amounts of other foods - houmous, cheese, cake, crisps. The only fruit and vegetables he ever eats are strawberries, raspberries, blackberries, banana, cherry tomatoes and olives.<br/>\n<br/>\nHe seems very healthy and rarely catches cold and has never had any serious illness, but then in the past he did eat a slightly wider variety of foods.<br/>\n<br/>\nMost of the time when he&#39;s hungry he just asks for chocolate. He is often offered other food (usually pasta or bread as we know he is most likely to eat this) before he gets hungry enough to ask and sometimes he accepts, other times says he&#39;d prefer chocolate. Usually in this case I or my partner will suggest he has a bit of both, and our son is usually happy to do this.<br/>\n <br/>\nI find it really difficult to believe that he can stay healthy and grow if he carries on eating this way.<br/>\nI would really appreciate anybody&#39;s thoughts on this. I&#39;m wondering if I&#39;ve missed anything - or whether if I just wait and give him what he asks for, while occasionally offering other foods, he will eventually naturally adjust his diet.<br/>\n<br/>\nThank you for reading this,<br/>\nNandi</div>","specialLinks":[]}],"prevTopicId":62817,"nextTopicId":62792}}