{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] helping the one who wants to stay home","postDate":"1268160075","msgId":51851,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCOTY5NjRCLjcwMzA0MDVAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PDRFOTA0NUQxMEU2QzQxRkY5QkVEQ0VCNTlEM0ZCNTFDQExZTEFMQVAyPg==","referencesHeader":"PGhuNW44ZytrcnAzQGVHcm91cHMuY29tPiA8NEU5MDQ1RDEwRTZDNDFGRjlCRURDRUI1OUQzRkI1MUNATFlMQUxBUDI+"},"prevInTopic":51850,"nextInTopic":0,"prevInTime":51850,"nextInTime":51852,"topicId":51841,"numMessagesInTopic":0,"msgSnippet":"... Good point. And for you and the kids who wanted to go out, but are giving that up, think of how to make staying home more appealing (just like you re","messageBody":"<div id=\"ygrps-yiv-260888116\">On 3/9/2010 10:09 AM, Lyla Wolfenstein wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; i think it&#39;s really important that his voice and temperament are <br/>\n&gt; &quot;heard&quot; and honored and fed too. not just &quot;if other arrangements can <br/>\n&gt; be made&quot; - as an actual sacrifice on your part - since he is truly <br/>\n&gt; sacrificing each time he is made to go out.<br/>\n<br/>\n </span></blockquote>Good point. And for you and the kids who wanted to go out, but are <br/>\ngiving that up, think of how to make staying home more appealing (just <br/>\nlike you&#39;re thinking of ways to make going out more appealing to your son).<br/>\n<br/>\nIf you have a yard, fix it up to be a good hang-out place for you and <br/>\nyour kids, but also to invite over a couple of other moms and their <br/>\nkids. Your son can be at home and have the choice whether or not to play <br/>\noutdoors with other kids or hang out on his own in the house.<br/>\n<br/>\nWe have a pool, so this was a good option for us - I&#39;d invite two other <br/>\nmoms with 4 or 5 kids, plus my three. It was a reasonable number - so it <br/>\nwasn&#39;t like a huge pool party. They&#39;d bring their own picnic lunch and <br/>\nwe&#39;d stay outdoors the whole time. It was great for Roxana, my middle <br/>\ndaughter, who would hang out with the other kids a bit, and spend some <br/>\ntime on her own in the house - her choice.  I liked having two other <br/>\nmoms, not just one, because I could feel more free to go inside and hang <br/>\nout a bit with Roxana, too.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":185586397,"authorName":"Lyla Wolfenstein","from":"&quot;Lyla Wolfenstein&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] helping the one who wants to stay home","postDate":"1268158162","msgId":51850,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRFOTA0NUQxMEU2QzQxRkY5QkVEQ0VCNTlEM0ZCNTFDQExZTEFMQVAyPg==","inReplyToHeader":"PGhuNW44ZytrcnAzQGVHcm91cHMuY29tPg==","referencesHeader":"PGhuNW44ZytrcnAzQGVHcm91cHMuY29tPg=="},"prevInTopic":51849,"nextInTopic":51851,"prevInTime":51849,"nextInTime":51851,"topicId":51841,"numMessagesInTopic":0,"msgSnippet":"he doesn t just feel outvoted  - he IS being outvoted.  my son has been the same  - he s less so now, but was INTENSELY home focused at age 7, and 8, and 9","messageBody":"<div id=\"ygrps-yiv-1288867911\">he doesn&#39;t just feel outvoted  - he IS being outvoted.  my son has been the same  - he&#39;s less so now, but was INTENSELY home focused at age 7, and 8, and 9 (and 4 and 5 and 6).   i would encourage you to not only bring home along and do all the things others recommended and you are already doing, but ALSO to do what *he* wants sometimes - not just if someone else is available.  let another family take your other kids to the park some times.  or keep everyone  home and do somethng together there - in the yard or on the stoop if you want sun.  i think it&#39;s really important that his voice and temperament are &quot;heard&quot; and honored and fed too.  not just &quot;if other arrangements can be made&quot; - as an actual sacrifice on your part - since he is truly sacrificing each time he is made to go out.<br/>\n<br/>\nwarmly, lyla<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: lalow66 <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a> <br/>\n  Sent: Tuesday, March 09, 2010 6:50 AM<br/>\n  Subject: [AlwaysLearning] helping the one who wants to stay home<br/>\n<br/>\n<br/>\n    <br/>\n  of my 4 kids, i have one who typically chooses to stay home. he is only 7 though so i cant leave him alone. so he is often asked to come with us despite not wanting to.<br/>\n  when my husband is around he stays with him, or like yesterday,he didnt want to go to an activity and i asked a close friend if he could hang out at her house, which he was happy to do. i try to work with him on what would make this appealing to him as well but in the end, he is asked to go along alot more than he is comfortable with and then we get break downs etc. on some occasions he has opted to bring a game for us to play while the kids are doing their activity but he often wont really even discuss options, he just doesnt want to go.. he likes being at home.<br/>\n  today for example it is beautiful outside, the other kids and I would like to go to the park and play with some friends, it has been a long cold winter and we are seeing our first nice days. he doesnt want to go. i have offered to play a game with him if he wants to bring an activity for us to do, i have offered to go by sonic and pick up lunch to take there. all no&#39;s. the friend he stayed with yesterday are coming with us so that isnt an option. and so once again he feels out voted. <br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] helping the one who wants to stay home","postDate":"1268151898","msgId":51849,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCOTY3NjVBLjYwMTAyMDVAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PGhuNW44ZytrcnAzQGVHcm91cHMuY29tPg==","referencesHeader":"PGhuNW44ZytrcnAzQGVHcm91cHMuY29tPg=="},"prevInTopic":51843,"nextInTopic":51850,"prevInTime":51848,"nextInTime":51850,"topicId":51841,"numMessagesInTopic":0,"msgSnippet":"... Take home with you as much as possible. Get an old suitcase and you and he can pack it up with things to take when you go out. Books (not too many -","messageBody":"<div id=\"ygrps-yiv-1155460385\">On 3/9/2010 6:50 AM, lalow66 wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; today for example it is beautiful outside, the other kids and I would <br/>\n&gt; like to go to the park and play with some friends, it has been a long <br/>\n&gt; cold winter and we are seeing our first nice days. he doesnt want to <br/>\n&gt; go. i have offered to play a game with him if he wants to bring an <br/>\n&gt; activity for us to do, i have offered to go by sonic and pick up lunch <br/>\n&gt; to take there. all no&#39;s. the friend he stayed with yesterday are <br/>\n&gt; coming with us so that isnt an option. and so once again he feels out <br/>\n&gt; voted.<br/>\n<br/>\n </span></blockquote>Take &quot;home&quot; with you as much as possible. Get an old suitcase and you <br/>\nand he can pack it up with things to take when you go out. Books (not <br/>\ntoo many - they&#39;re heavy), games, a blanket/pillow, dolls, toys, art <br/>\nsupplies, or whatever - let him come up with ideas. Wherever you go, set <br/>\nhim up with his own little home-base. Put &quot;his&quot; blanket down (for one of <br/>\nmy daughters, I used to even take a little cheap tent for her). Arrange <br/>\nhis stuff around him. Make a big effort to get this all set up so it is <br/>\nlater easy to do. Before you go out, when he is feeling reluctant, it <br/>\ncan help with the transition if he has a routine of checking his &quot;home <br/>\naway from home&quot; supplies.<br/>\n<br/>\nAnd - get little things to add to his supplies. A rubick&#39;s cube, a lego <br/>\nkit, etc. when you&#39;re out and about and happen to see something that is <br/>\nsmall and portable and he might enjoy.<br/>\n<br/>\nAlso - hand-held game systems like a DS - are WONDERFUL for this kind of <br/>\nthing. If you can afford it, a little portable DVD player can be awesome <br/>\nbecause then you can collect movies and cartoons and stuff that he can <br/>\ntake with him.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":342163414,"authorName":"Chris Sanders","from":"Chris Sanders &lt;iowaunschoolers@...&gt;","profile":"iaunschoolers","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] helping the one who wants to stay home","postDate":"1268148012","msgId":51843,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNDMDE4RDhGLUIyQjAtNDQxRi1BMERDLTYwOTcwOTk3MEE0MEBnbWFpbC5jb20+","inReplyToHeader":"PGhuNW44ZytrcnAzQGVHcm91cHMuY29tPg==","referencesHeader":"PGhuNW44ZytrcnAzQGVHcm91cHMuY29tPg=="},"prevInTopic":51841,"nextInTopic":51849,"prevInTime":51842,"nextInTime":51844,"topicId":51841,"numMessagesInTopic":0,"msgSnippet":"... Can you park the car close to where you ll be sitting and let him stay in the car, reading, coloring, playing a handheld video game or something else that","messageBody":"<div id=\"ygrps-yiv-1700563150\"><blockquote><span title=\"ireply\">&gt; he likes being at home.<br/>\n&gt; today for example it is beautiful outside, the other kids and I  <br/>\n&gt; would like to go to the park and play with some friends, it has been  <br/>\n&gt; a long cold winter and we are seeing our first nice days. he doesnt  <br/>\n&gt; want to go. i have offered to play a game with him if he wants to  <br/>\n&gt; bring an activity for us to do, i have offered to go by sonic and  <br/>\n&gt; pick up lunch to take there. all no&#39;s. the friend he stayed with  <br/>\n&gt; yesterday are coming with us so that isnt an option. and so once  <br/>\n&gt; again he feels out voted.<br/>\n<br/>\n </span></blockquote>Can you park the car close to where you&#39;ll be sitting and let him stay  <br/>\nin the car, reading, coloring, playing a handheld video game or  <br/>\nsomething else that he can do solitarily but away from home?  My son  <br/>\nis introverted and my daughter is not. We used to all go to the park  <br/>\ngatherings together but he would often find a tree to sit under and  <br/>\nplay his Gameboy (now it&#39;d be a DS) or read a book.  Sometimes, his  <br/>\nfriends would persuade him to come play with them but I always  <br/>\nsupported him hanging out by himself if that is what he needed.  He  <br/>\nalso sometimes just hung out in the car, nearby and I tried to keep  <br/>\nour park visit to a minimal length of time, for his sake.<br/>\n<br/>\nChris in IA<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":222835102,"authorName":"lalow66","from":"&quot;lalow66&quot; &lt;lalow@...&gt;","profile":"lalow66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"helping the one who wants to stay home","postDate":"1268146256","msgId":51841,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhuNW44ZytrcnAzQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":51843,"prevInTime":51840,"nextInTime":51842,"topicId":51841,"numMessagesInTopic":0,"msgSnippet":"of my 4 kids, i have one who typically chooses to stay home.  he is only 7 though so i cant leave him alone.  so he is often asked to come with us despite not","messageBody":"<div id=\"ygrps-yiv-400009180\">of my 4 kids, i have one who typically chooses to stay home.  he is only 7 though so i cant leave him alone.  so he is often asked to come with us despite not wanting to.<br/>\nwhen my husband is around he stays with him, or like yesterday,he didnt want to go to an activity and i asked a close friend if he could hang out at her house, which he was happy to do.  i try to work with him on what would make this appealing to him as well but in the end, he is asked to go along alot more than he is comfortable with and then we get break downs etc.  on some occasions he has opted to bring a game for us to play while the kids are doing their activity but he often wont really even discuss options, he just doesnt want to go.. he likes being at home.<br/>\ntoday for example it is beautiful outside, the other kids and I would like to go to the park and play with some friends, it has been a long cold winter and we are seeing our first nice days.  he doesnt want to go.  i have offered to play a game with him if he wants to bring an activity for us to do, i have offered to go by sonic and pick up lunch to take there.  all no&#39;s. the friend he stayed with yesterday are coming with us so that isnt an option. and so once again he feels out voted.</div>","specialLinks":[]}],"prevTopicId":51696,"nextTopicId":51725}}