{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":109856460,"authorName":"nellebelle","from":"&quot;nellebelle&quot; &lt;nellebelle@...&gt;","profile":"lamaribelle","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] I quit, too!","postDate":"1138134054","msgId":111472,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxNWIwMWM2MjEyMyRiMWZlOGZlMCQ2NDAxYThjMEBob21lPg==","referencesHeader":"PDIwMDYwMTIyMjIyMjI2LjQ0MTc2LnFtYWlsQHdlYjUyMDA1Lm1haWwueWFob28uY29tPg=="},"prevInTopic":111363,"nextInTopic":0,"prevInTime":111471,"nextInTime":111473,"topicId":111363,"numMessagesInTopic":0,"msgSnippet":"I take offense with the assertion that all humans (save a select few) are mindless, rushing consumers. ... Some things must take time, but we live in an age","messageBody":"<div id=\"ygrps-yiv-170678774\">I take offense with the assertion that all humans (save a select few) are mindless, rushing consumers.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;In this day and age humans are on an instant gratification kick and cannot seem to get their minds around gradual change.&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>Some things must take time, but we live in an age where many things CAN happen quickly.  Is it bad to cook food in a microwave or on top of the stove rather than start a fire and wait for it to turn to coals?  Is a bath &quot;better&quot; if the water is heated a bucket at a time?  Is it &quot;instant gratification&quot; if I drive to the grocery store (5 miles to the nearest), rather than walk?  Would I be a better person if I only ate food I produced myself?<br/>\n<br/>\nI&#39;ve lived without electricity and running water as an adult.  While I&#39;m glad to have had the experience, I&#39;ll take my flush toilet any day, thank you.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt; if we have any hope of escaping from the negative cyclic nature of our present day crisis.&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>What crisis?<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;What I mean by this is that we have created a system in this country that requires us to live beyond our means.&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>Really?  Who is &quot;requiring us&quot; to do so?<br/>\n<br/>\n<br/>\nI happen to be reading Walden right now, where similar ideas are presented, or should I say, were presented, over 100 years ago.<br/>\n<br/>\nMary Ellen<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":227139139,"authorName":"elizabeth roberts","from":"elizabeth roberts &lt;joyfullzoo@...&gt;","profile":"joyfullzoo","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"I quit, too!","postDate":"1137968546","msgId":111363,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwMTIyMjIyMjI2LjQ0MTc2LnFtYWlsQHdlYjUyMDA1Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDIwMDYwMTIwMTQwOTI5Ljg1MTU3LnFtYWlsQHdlYjM2NzA5Lm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":0,"nextInTopic":111472,"prevInTime":111362,"nextInTime":111364,"topicId":111363,"numMessagesInTopic":0,"msgSnippet":"From Steve, FatManWalking.com 11/10/05: Middle way is a Buddhist concept of not living to excess either by over indulgence or by estheticism. But instead","messageBody":"<div id=\"ygrps-yiv-658945806\">From Steve, FatManWalking.com <br/>\n   <br/>\n  11/10/05: <br/>\n   <br/>\n  Middle way is a Buddhist concept of not living to excess either by over indulgence or by estheticism. But instead finding the middle road, ground, method or way and for our purposes here following a slow and steady development towards change. This is very appropriate to obesity and weightloss. Slow steady development is better than repaid weight loss.  Rapid weight loss is not true weight loss and one side of the Yo-yo effect of dieting.  <br/>\n   <br/>\n  In this day and age humans are on an instant gratification kick and cannot seem to get their minds around gradual change.  We want things fast and then to double that. There seems to be no end to our desire for instant gratification and it is killing us as much as a famine, a plague or war would do. It is a curse on society and will eventually result in a lot of grief and hardship before we decide as a people to make a change. Like any change in society it starts with a single person and grows from there.  <br/>\n   <br/>\n  We need to learn the middle way and practice patience with all things if we have any hope of escaping from the negative cyclic nature of our present day crisis.  I was talking with a friend today about socio-political issues and told him about what I think this era of American life really should be labeled.  We spoke about the virtues and evils of both Communism and Capitalism and I told him that we now have transitioned far, far away from both.  We now live in a society of Consumerism.  <br/>\n   <br/>\n  What I mean by this is that we have created a system in this country that requires us to live beyond our means. To be a consumer is required to support our infrastructure and to try and get away from this behavior is inherently dangerous to our very way of life.  If we all decided to get rid of our credit card debt or to not buy a new (Insert item here) every time the newest version comes out the system would crumble and our way of life with it.  <br/>\n   <br/>\n  An important thing to realize here is that this is a system of built upon and fueled by dissatisfaction.  We simply cannot be happy with what we have because there is always something better around the corner.  We cannot be happy with who we are because we can easily have it altered, enhanced or installed. We cannot be content with the people that we have become because there is always a better lifestyle, body, husband/wife or whatever right around the corner.  We are divorcing at a disturbing rate and there seems to be no end in sight to the rise in those numbers.  In our self-centeredness we cannot see that this is eating us away from the inside out.  <br/>\n   <br/>\n  We need then to medicate ourselves against the hollowness and pain with alcohol, drugs, TV, video games, food, work or whatever.  Curing the symptoms becomes all important to us and then that mindset becomes part of the problem, and all these are necessary aspects of consumerism.  We think that we can buy happiness, buy a cure or relief of our problems.  <br/>\n   <br/>\n  This is something that has lately become crystal clear to me, the solitude of this walk is responsible for that and I am eternally indebted to this journey for that one simple understanding. I have always said that if you want a good indication of how your mental health really is spend an hour in an isolated place with no distractions, just be alone with your thoughts, and be alone with you. Then you we see whether you really like who you are.  Having to face your own inner thoughts is much more difficult than it seems. <br/>\n   <br/>\n  I said early on in this trip that after a few days of isolation I really started to realize that I am a pretty boring guy.  I said this in jest but I really did mean it.  I soon learned that without external input to keep me busy I was alone with myself and we had nothing to talk about. I was a stranger in my own head. Luckily on this trip I spent a lot of time there and then started to see that I really wasnt as boring as I had originally suspected. Instead I found a lot of old mes that had been long disregarded and were just waiting around to be dealt with.  I found that there really is a lot more to me than I had ever given myself credit for in the past and most importantly I discovered that I am a fully self contained unit capable of dealing with any of the things that required my attention.  I discovered that I came equipped with my very own medicine cabinet full of cures that I had not visited it in a long, long time.  <br/>\n   <br/>\n  Someone said to me the other day that we are the only animal born without the inherent ability to take care of ourselves, cats, dogs, and rabbits, whatever, are born with an innate sense of what is needed.  Watch a sleeping cat as he wakes up, what is the first thing that he will always do before going anywhere? He will yawn and stretch his legs. Everytime!  Why then do we as the higher species think that we need to buy a book or video to learn this? It seems like the guy was right doesnt it?  Well he isnt right. We are born with the same senses but we were cursed with the ability of abstract thought.  We wake up and immediately start thinking about everything else except looking out for ourselves.  We think about schedules, work, TV shows or whatever else.  We are too consumed with life to actually do what is necessary to live that life effectively.  Cats, now they dont have that curse. Wake upstretchwhere is that rubber ball anyway...Im hungry.  <br/>\n  <br/>\nWe on the other had hit the ground running in the morning, this after an insufficient nights sleep usually and then we start the gratification ritual, like clockwork. I need a cigarette! I cant get started without my coffee! What is for breakfast? Where is my day-planner?  Do I know you!?!  <br/>\n   <br/>\n  But we forget to watch the sunrise, take a peek at the kids sleeping or stretch out and wake up.  No, we hit the ground running. We need to get to the job to get the money to get the stuff to get happy.  When you really consider this is it is a very sick and unhealthy dynamic. This is why we are unhealthy. We are what we live. <br/>\n   <br/>\n  Well I quit! I only have a limited time in this life and I am not going to waste another minute artificially propping up a machine whose very nature requires my absolute devotion and ultimate sacrifice.  I am not going freely give my children as sacrifice at its altar neither.  I am going to live each day as if it were my last because sooner or later it will be. I do not want to look back at my life regretting having freely given it away.<br/>\n   <br/>\n  **************************Love it! :-) I quit awhile ago, but I&#39;m still in the process of working away from it all in some ways.  I figured if anyone else around I know can understand, it would be a bunch of other unschoolers, so I thought I&#39;d share this here! :-) <br/>\n   <br/>\n  Beth<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\nSing, Dance, Laugh...LOVE!<br/>\n\t\t<br/>\n---------------------------------<br/>\nYahoo! Photos<br/>\n Ring in the New Year with Photo Calendars. Add photos, events, holidays, whatever.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":111413,"nextTopicId":111359}}