{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Nicole Brown","from":"Nicole Brown &lt;nbrown@...&gt;","replyTo":"LIST","senderId":"4-vPla0mqCXO4hAW3HilhRD1imthkHl1xmTNqKbmlPMdN0fZWvO0_ysV438T15OVGajtoGZPn-3wklShNd2QVrL8Qr8ftg","spamInfo":{"isSpam":false,"reason":"0"},"subject":"New Member - intro and reading list request","postDate":"968270403","msgId":12931,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM5QjZBMjQzLjQyMzg2NEQzQGJidGVsLmNvbT4=","referencesHeader":"PDk2NzkxNjQxMS4xMzQyM0BlZ3JvdXBzLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":12930,"nextInTime":12932,"topicId":12931,"numMessagesInTopic":0,"msgSnippet":"Hi all, I just subscribed about a week ago, and have been lurking... thought it was about time I introduced myself. My name is Nicole, I m 29 and pregnant with","messageBody":"<div id=\"ygrps-yiv-961715938\">Hi all,<br/>\n<br/>\nI just subscribed about a week ago, and have been lurking... thought it<br/>\nwas about time I introduced myself. My name is Nicole, I&#39;m 29 and<br/>\npregnant with my first, due in about 3 weeks! My boyfriend (or<br/>\n&quot;baby-daddy&quot; in talk-show lingo) Terry and I live in rural Kentucky. <br/>\n<br/>\nWhile Terry is more traditional about things, I tend to research and<br/>\nlook for the best alternative... which is usually NOT the way &quot;most<br/>\npeople&quot; do things. At least not the people we know. For instance, I find<br/>\na vegetarian lifestyle the best way to live, for my own health and<br/>\nkarma. Terry likes to grill burgers and hotdogs. I have decided on<br/>\nhomebirth with a trained midwife as the best way to go - and although<br/>\nTerry still thinks it&#39;d be &quot;safer&quot; to have the baby in the hospital, he<br/>\nis going along with me on this one. Homeschooling/unschooling sounds<br/>\nlike a terrific idea to me, although I was not quite as poisoned by<br/>\npublic school as most folks have been... I went to &quot;alternative&quot; schools<br/>\nin Kansas grades K-6, where kids are given more autonomy and<br/>\nresposibility and learn stuff outside the 3 R&#39;s (i.e. we had a garden<br/>\nand a class in geology, made papier mache volcanoes, etc.). <br/>\n<br/>\nI realize now that the stuff I learned because I took it upon myself -<br/>\noutside of school - is the stuff I still know and use today. Stuff that<br/>\nwas drilled into my head in high school and college, I don&#39;t know<br/>\nanymore and could give a rat&#39;s butt. ~:^ )  I did have some meaningful<br/>\nsocial interaction in school, and a few really terrific teachers, but<br/>\nwas not involved in much extracurricular activity.<br/>\n<br/>\nTerry had a traditional ps education, and says his parents never had any<br/>\ninterest in his schooling at all - didn&#39;t care whether he did his<br/>\nhomework, etc. He has a phobic aversion to reading, whereas I am a<br/>\ncompulsive reader! Anyway, we&#39;ve been lightly discussing the<br/>\nhomeschooling topic, and he seems to be open to it, though not to the<br/>\nextent that I&#39;d like. One thing that helps is the dubious quality of the<br/>\npublic schools around here, and the fact that they&#39;ll hire anyone off<br/>\nthe street to be a teacher because they&#39;re desperate. Another thing is<br/>\nthat he thinks I&#39;d be an excellent teacher (he thinks I ought to get one<br/>\nof those jobs - no thanks!), and so well suited to educating our<br/>\ndaughter. I touched on the philosophy of unschooling (vs.<br/>\nhomeschooling), but he&#39;s one that takes his knowledge a little bite at a<br/>\ntime, so we&#39;ll see. <br/>\n<br/>\nI&#39;d like to hear more on the discipline topic, please. The Aletha Solter<br/>\nexcerpts make sense, but how do her ideas work in the real world?<br/>\n<br/>\nHow about a recommended reading list? Not just for educating but for<br/>\nparenting in general. I need something to take to the small-town<br/>\nlibrary, see if I can challenge them a bit to find what I want to read.<br/>\n~:^ )<br/>\n<br/>\nThanks y&#39;all!<br/>\n<br/>\nNicole<br/>\nbarefoot AND pregnant in KY (yes I HAVE shoes, but who wants to wear<br/>\nthem? Besides, my feet are swollen...)</div>","specialLinks":[]}],"prevTopicId":12930,"nextTopicId":12893}}