{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Lynda","from":"&quot;Lynda&quot; &lt;lurine@...&gt;","replyTo":"LIST","senderId":"hts_0T6fGSHw6IB545Dfz6xgSUGFIoxW_fu3c1xQcyTpaJ2V05A3QotaAfSHl0sBUS35kDfmP5_PG3WLTaA00wKjDg","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Fw: Spyware","postDate":"974913363","msgId":14208,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxM2YwMWMwNTRhYiRlYWEwNzkyMCQ0MjVkZDFkMUBsZGlvbm5vPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":14207,"nextInTime":14209,"topicId":14208,"numMessagesInTopic":0,"msgSnippet":"... that ... happened ... debate ... which ... of ... your ... the ... track ... through ... reputable ... back ... the ... was ... to ... what ... passwords? ","messageBody":"<div id=\"ygrps-yiv-1821818422\">----- Original Message -----<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.zonelabs.com/newsletter/beware1100.html\">http://www.zonelabs.com/newsletter/beware1100.html</a><br/>\n&gt; Beware Spyware<br/>\n&gt; Experts have discovered that those free software products that ask only<br/>\n </span></blockquote>that<br/>\n<blockquote><span title=\"ireply\"> &gt; you accept some advertising may be seriously invading your privacy.<br/>\n&gt; When a U.S. senator asks Congress to intervene in the way some software is<br/>\n&gt; sold, it&#39;s a good sign there may be a problem. That&#39;s exactly what<br/>\n </span></blockquote>happened<br/>\n<blockquote><span title=\"ireply\"> &gt; in October 2000 when North Carolina Democratic Senator John Edwards<br/>\n&gt; introduced legislation that would force software makers to disclose when<br/>\n&gt; they use Spyware in the products they sell.<br/>\n&gt; Senator Edwards commented &quot;I have been closely following the privacy<br/>\n </span></blockquote>debate<br/>\n<blockquote><span title=\"ireply\"> &gt; for some time now, and I am struck by how often I discover new ways in<br/>\n </span></blockquote>which<br/>\n<blockquote><span title=\"ireply\"> &gt; our privacy is being eroded. Spyware is among the more startling examples<br/>\n </span></blockquote>of<br/>\n<blockquote><span title=\"ireply\"> &gt; how this erosion is occurring.&quot;<br/>\n&gt; At Zone Labs, we draw a distinction between Spyware and Adware. Adware<br/>\n&gt; includes a piece of code that can be used by software vendors to track<br/>\n </span></blockquote>your<br/>\n<blockquote><span title=\"ireply\"> &gt; use of a product that contains advertising, so that the vendor can bill<br/>\n </span></blockquote>the<br/>\n<blockquote><span title=\"ireply\"> &gt; advertisers whose products or services are advertised on the software, and<br/>\n&gt; in some cases to track your use of the software to determine your behavior<br/>\n&gt; as a user.<br/>\n&gt; It&#39;s usually a fair trade - you the user allow the software vendor to<br/>\n </span></blockquote>track<br/>\n<blockquote><span title=\"ireply\"> &gt; your use of their product so they can target appropriate advertising<br/>\n </span></blockquote>through<br/>\n<blockquote><span title=\"ireply\"> &gt; the product - and you get the software free. And while Adware from<br/>\n </span></blockquote>reputable<br/>\n<blockquote><span title=\"ireply\"> &gt; companies is rarely malicious, it does raise some important privacy<br/>\n&gt; questions, especially whether it&#39;s enough to take the vendor&#39;s word that<br/>\n&gt; they will use the information for advertising only, and no other purpose.<br/>\n&gt; Spyware is much more malicious, and is increasingly used by hackers to get<br/>\n&gt; inside your PC, track your behaviour, steal your data, and use you as a<br/>\n </span></blockquote>back<br/>\n<blockquote><span title=\"ireply\"> &gt; door into your employer&#39;s corporate network.<br/>\n&gt; And many security and privacy experts believe that the confusion between<br/>\n&gt; Adware and Spyware could be a big problem for many consumers, especially<br/>\n&gt; when it comes to privacy. One of the largest distributors of free software<br/>\n&gt; claims to sell more than 500 different titles to more than 28 million<br/>\n&gt; consumers. And although the company freely admits to using Adware in its<br/>\n&gt; products, it also claims that it&#39;s only to best target advertising through<br/>\n&gt; these products.<br/>\n&gt; When one user of that company&#39;s free software conducted a simple and free<br/>\n&gt; test to see if his computer did in fact contain any Adware, a total of<br/>\n&gt; twenty-seven Adware &quot;parasites&quot; were detected.<br/>\n&gt; The test is called Opt Out, offered by Gibson Research, and you can try<br/>\n </span></blockquote>the<br/>\n<blockquote><span title=\"ireply\"> &gt; free service yourself at &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://grc.com/optout.htm\">http://grc.com/optout.htm</a>&gt;<br/>\n&gt; When a spokesperson for toy-maker Mattel was asked why they used Adware in<br/>\n&gt; more than 100 children&#39;s software titles, the response was &quot;The program<br/>\n </span></blockquote>was<br/>\n<blockquote><span title=\"ireply\"> &gt; originally designed to offer consumers additional product content and to<br/>\n&gt; communicate fixes.&quot;<br/>\n&gt; While Mattel&#39;s intentions were entirely honorable and an obvious benefit<br/>\n </span></blockquote>to<br/>\n<blockquote><span title=\"ireply\"> &gt; consumers, parents could be forgiven for being alarmed when they first<br/>\n&gt; stumbled across the secret. And suspicion is often further increased when<br/>\n&gt; the information being sent over the Internet from your computer to an<br/>\n&gt; unknown source is so heavily encrypted there&#39;s no way of telling what&#39;s<br/>\n&gt; being sent.<br/>\n&gt; If the information is not encrypted, who else can grab and use is? And<br/>\n </span></blockquote>what<br/>\n<blockquote><span title=\"ireply\"> &gt; if a disgruntled programmer designed the Adware to do something much more<br/>\n&gt; sinister? Like siphon off email addresses, credit card number, or<br/>\n </span></blockquote>passwords?<br/>\n<blockquote><span title=\"ireply\"> &gt; What to Do?<br/>\n&gt; Think twice about how free &quot;free&quot; advertising-based software really is,<br/>\n </span></blockquote>and<br/>\n<blockquote><span title=\"ireply\"> &gt; whether it&#39;s worth the loss of privacy.<br/>\n&gt;<br/>\n&gt; If you&#39;re considering using advertising-supported free software, ask the<br/>\n&gt; manufacturer if they use Adware or any other mechanism to track your use<br/>\n </span></blockquote>of<br/>\n<blockquote><span title=\"ireply\"> &gt; the software.<br/>\n&gt;<br/>\n&gt; Use the free OptOut program to test if you already have Spyware or Adware<br/>\n </span></blockquote>on<br/>\n<blockquote><span title=\"ireply\"> &gt; your PC.<br/>\n&gt;<br/>\n&gt; Be vigilant - a product like ZoneAlarm will always warn you when Adware or<br/>\n&gt; Spyware is trying to connect to the Internet and send your information<br/>\n </span></blockquote>back<br/>\n<blockquote><span title=\"ireply\"> &gt; to base. By clicking on the &quot;More Info&quot; button of a ZoneAlarm Alert you<br/>\n </span></blockquote>can<br/>\n<blockquote><span title=\"ireply\"> &gt; find the source for these attempts.<br/>\n&gt; ==================<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.zonelabs.com/newsletter/howtoprotect1100.html\">http://www.zonelabs.com/newsletter/howtoprotect1100.html</a><br/>\n&gt; Ask The Expert<br/>\n&gt;<br/>\n&gt; Q: We&#39;re planning on installing a local area network - we have around<br/>\n </span></blockquote>twenty<br/>\n<blockquote><span title=\"ireply\"> &gt; PCs, between two offices, as well as half a dozen laptops. What security<br/>\n&gt; precautions should we consider?<br/>\n&gt;<br/>\n&gt; A: It is recommended that you first determine what it is you want to<br/>\n&gt; protect. For the purposes of discussion, it&#39;s assumed that it is<br/>\n </span></blockquote>information<br/>\n<blockquote><span title=\"ireply\"> &gt; you ultimately want to protect. If so, then you should identify who &quot;owns&quot;<br/>\n&gt; that information (a business owner and not always the system<br/>\n </span></blockquote>administrator);<br/>\n<blockquote><span title=\"ireply\"> &gt; who the owner wants to grant access to the information to; and over what<br/>\n&gt; systems, networks, databases, and applications that access is to be<br/>\n </span></blockquote>granted.<br/>\n<blockquote><span title=\"ireply\"> &gt; The more sensitive the information, the more safeguards you have to employ<br/>\n&gt; to protect that information.<br/>\n&gt;<br/>\n&gt; Another point to consider is how critical the information is to the<br/>\n&gt; company&#39;s operations. How long can your company continue to operate<br/>\n </span></blockquote>without<br/>\n<blockquote><span title=\"ireply\"> &gt; the availability of the information? The more critical information is to<br/>\n&gt; your business operations, the more safeguards you have to implement to<br/>\n&gt; ensure its availability.<br/>\n&gt;<br/>\n&gt; Typical security precautions, however, include the following:<br/>\n&gt;<br/>\n&gt; Inventory and baseline your systems, networks, and peripheral equipment.<br/>\n&gt; It&#39;s virtually impossible to do an effective job of protecting your<br/>\n&gt; architecture if you don&#39;t know what you have to protect.<br/>\n&gt; Institute configuration control procedures and review the impact to your<br/>\n&gt; overall security environment from any subsequent system/network changes.<br/>\n&gt; Put the LAN server and routers behind locked doors in a room or<br/>\n&gt; well-ventilated closet with physical access restricted to the absolute<br/>\n&gt; minimum number of people on your staff.<br/>\n&gt; Ensure users have to log-in with effective IDs and passwords before being<br/>\n&gt; granted access to the system.<br/>\n&gt; Establish a one-time password capability (like SecureID or Safeword<br/>\n&gt; Softoken) for your employees when they dial into the company&#39;s system<br/>\n&gt; through an extranet modem pool or over the Internet via IP connection.<br/>\n&gt; Audit user activities while in the system. Simply making sure they have<br/>\n&gt; access isn&#39;t enough. You want to be able to know what it is they are doing<br/>\n&gt; in your system and make them accountable for their actions.<br/>\n&gt; &quot;Harden&quot; your operating systems. If using NT, run the C2 configuration<br/>\n&gt; utility from your Resource Toolkit. On Sun Solaris operating systems,<br/>\n&gt; consider stripping out unnecessary commands like the &quot;r commands&quot; or<br/>\n </span></blockquote>&quot;tftp&quot;<br/>\n<blockquote><span title=\"ireply\"> &gt; if not essential to business operations.<br/>\n&gt; Restrict the number of &quot;share&quot; drives or directories as well as how many<br/>\n&gt; users can see files in those shared resources.<br/>\n&gt; Implement Access Control Lists (ACLs) on your router(s). You can filter<br/>\n&gt; activity based upon IP packet criteria. Ensure that router activity is<br/>\n&gt; logged and (as with Cisco routers) both levels of access to the router are<br/>\n&gt; secured with ID/password access controls.<br/>\n&gt; Encrypt your most sensitive information so that only those with a<br/>\n&gt; &quot;need-to-know&quot; can decrypt it and read it.<br/>\n&gt; Encrypt network traffic between critical or sensitive nodes on your<br/>\n </span></blockquote>network.<br/>\n<blockquote><span title=\"ireply\"> &gt; Encrypt email if you send sensitive information.<br/>\n&gt; Utilize firewalls between critical LAN nodes/file servers/etc. and less<br/>\n&gt; secure zones or the Internet. DON&#39;T poke so many holes in your firewall<br/>\n&gt; business rules that it becomes essentially &quot;swiss cheese&quot; useless.<br/>\n&gt; Purchase security cables and locks to secure your highly portable laptops<br/>\n&gt; during business hours. Don&#39;t leave laptops out on the desk at night. Lock<br/>\n&gt; them up in a drawer or take them home with you.<br/>\n&gt; Install disk security and encryption on laptops so that if they are<br/>\n </span></blockquote>stolen,<br/>\n<blockquote><span title=\"ireply\"> &gt; the sensitive information on them is not compromised.<br/>\n&gt; If you can afford to, hire an information security expert to help you<br/>\n </span></blockquote>build<br/>\n<blockquote><span title=\"ireply\"> &gt; a Security Risk Management Program.<br/>\n&gt; Document security procedures and policies. Enforce them. Monitor<br/>\n&gt; system/network use to ensure compliance with policy and procedures.<br/>\n&gt; Draft up an Acceptable Use Policy (AUP) for email, Internet, and system<br/>\n </span></blockquote>use.<br/>\n<blockquote><span title=\"qreply\"> &gt; Familiarize and sensitize your staff with security awareness through<br/>\n&gt; informational media and some sort of orientation program.<br/>\n&gt; Make sure all laptops and home computers have the same protection as<br/>\n&gt; business PCs so employees don&#39;t take hidden risks to work with them. </span></blockquote></div>","specialLinks":[]}],"prevTopicId":14200,"nextTopicId":14186}}