{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":139365078,"authorName":"v_malott","from":"&quot;v_malott&quot; &lt;vmalott@...&gt;","profile":"v_malott","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Another newbie","postDate":"1067374965","msgId":17114,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJubWxobCtxMDFsQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":17113,"nextInTime":17115,"topicId":17114,"numMessagesInTopic":0,"msgSnippet":"Hello, I ve been subscribed for a day and have been sitting back, reading the archives, and following Flora s newbie thread with interest.  Not to throw this","messageBody":"<div id=\"ygrps-yiv-749875037\">Hello,<br/>\nI&#39;ve been subscribed for a day and have been sitting back, reading <br/>\nthe archives, and following Flora&#39;s newbie thread with interest.  Not <br/>\nto throw this in your face, Flora, but MAN, I&#39;m realizing just how <br/>\nlucky I am.<br/>\n<br/>\nWe&#39;re going into our third year of homeschooling in the official <br/>\nsense: that is, sending in &quot;required&quot; notification for the state of <br/>\nOhio for our two compulsory-aged children.  My husband and I have <br/>\nfive children altogether, between the ages of 9 years and 11 months <br/>\n(g, b, g, b, b).  I have made some lame attemtpts to structure their <br/>\nlearning in the past.  It usually happens around the time of <br/>\nthose &quot;back-to-school&quot; ads and I get myself all geared up to &quot;do <br/>\nsomething.&quot; Fortunately, I quickly come back to my senses and fall <br/>\nback into our peaceful unschooling mode of life.<br/>\n<br/>\nAnyway, our oldest daughter attended Catholic school for K (which was <br/>\na pleasant experience) and 1st grade (which was psychologically <br/>\ndamaging).  By the end of 1st grade, I was so fed up with the school, <br/>\nher teacher, and the principal that I was tempted to never send any <br/>\nof my kids back there.  Still, we registered for the following year <br/>\nand came within a month of sending our son to K there.  A week <br/>\nfollowing K orientation, I decided once and for all that we&#39;d be <br/>\nhomeschooling and it was the best thing I&#39;ve ever done for our family.<br/>\n<br/>\nMy mother is bewildered by how I could possibly manage to homeschool <br/>\nmy kids with all five of them being home all day.  I think this is <br/>\njust because she had two kids, 7.5 years apart and worked full-time <br/>\nwhen I started going to middle school.  Still, she is very supportive <br/>\nand LOVES when I send her articles by John Taylor Gatto and John <br/>\nHolt.  Having worked with school officials (county superintendant) <br/>\nfor most of her working years, I think she realizes how corrupt and <br/>\npolitical the whole business is, and how most of it doesn&#39;t really <br/>\ncare about kids and real learning at all.<br/>\n<br/>\nMy in-laws are also incredibly supportive.  I think my MIL is just <br/>\nhappy that I chose to stay home to raise her grandchildren.  They <br/>\nwere concerned about the socialization issue at first, but they know <br/>\nhow active we are with the local support groups and other homeschool <br/>\nfamilies that it isn&#39;t a concern.  They see how bright and articulate <br/>\nthe kids are, how well they can speak to grown-up strangers, that <br/>\nthey don&#39;t really care what or how they are learning.  <br/>\n<br/>\nMy DH isn&#39;t completely aware that what we&#39;re doing is called <br/>\nunschooling.  He just knows that we don&#39;t sit there all day plowing <br/>\nthrough text books.  There&#39;s a part of him that would like to see <br/>\ncertain things improve, like our son&#39;s handwriting (why? he&#39;s only 7) <br/>\nand our daughter&#39;s math facts (why? she can do math when she&#39;s <br/>\nsufficiently motivated), so there&#39;s a little bit of deschooling left <br/>\nfor him.  I&#39;m proud of him, though.  He &quot;teaches&quot; 7th grade Sunday <br/>\nschool and the other teachers get so frustrated with him when he <br/>\nrallies against efforts to try to standardize and test the students.  <br/>\nWhen confronted with the question &quot;Well, then, how will you know that <br/>\nthey &#39;get it&#39;?&quot;  His response: &quot;I talk to them!&quot;  Imagine that!  <br/>\nyeah, most of the kids are there because their parents want them to <br/>\nbe there, but they definitely enjoy the change of pace for their 7th <br/>\ngrade year.<br/>\n<br/>\nEnough about me,<br/>\nValerie in Cincinnati, OH</div>","specialLinks":[]}],"prevTopicId":17102,"nextTopicId":17116}}