{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":0,"authorName":"meakerfam@juno.com","from":"meakerfam@...","replyTo":"LIST","senderId":"BPvD_8BvqixQ45qoDAMKgKp2tSsHfX9LMBysx1R3UpoCF8tAqJVh6Xq3_ijdHiIGVSyc6WuoRBls","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: OT: Internet Privacy","postDate":"966459573","msgId":11999,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhuZXZibCt1NnQxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDM5NzlGNTc3Ljk4RThBNUQxQGFsZHVzLm5vcnRobmV0Lm9yZz4="},"prevInTopic":11473,"nextInTopic":0,"prevInTime":11998,"nextInTime":12000,"topicId":11473,"numMessagesInTopic":0,"msgSnippet":"... Hash: SHA1 Carnivore IS for real.  The answer is email encryption!!  I am a DIE HARD advocate of encryption in general and PGP in particular!!!!!! Get it","messageBody":"<div id=\"ygrps-yiv-340613533\">-----BEGIN PGP SIGNED MESSAGE-----<br/>\nHash: SHA1<br/>\n<br/>\nCarnivore IS for real.  The answer is email encryption!!  I am a DIE<br/>\nHARD advocate of encryption in general and PGP in particular!!!!!! <br/>\nGet it as there is NO SUCH THING AS FREE SPEECH ANYMORE!<br/>\n<br/>\n<br/>\n:::::hopping off soap box:::<br/>\n<br/>\n<br/>\nPax,<br/>\nCrys<br/>\n<br/>\n-----BEGIN PGP SIGNATURE-----<br/>\nVersion: PGPfreeware 6.5.3 for non-commercial use &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.pgp.com\">http://www.pgp.com</a>&gt;<br/>\n<br/>\niQA/AwUBOZsAqYWtLXeX9UvWEQJKEACgks+QY4iBXRTc1I6ibuCDY0BhzkMAn2c7<br/>\nVB9BbfNYJf0bWOgyoeIvFsZd<br/>\n=ZraL<br/>\n-----END PGP SIGNATURE-----</div>","specialLinks":[]},{"userId":0,"authorName":"Linda Dobson","from":"Linda Dobson &lt;ldobson@...&gt;","replyTo":"LIST","senderId":"a8f3h27JXbd5eppILFo6W2rGLMna6OElwfIosIF-l0EK7WifIFwc-w7UMuI888MALHXxCJGdfITY410pbvymBglWgec6GGLHf-SNKtsmNTc","spamInfo":{"isSpam":false,"reason":"0"},"subject":"OT: Internet Privacy","postDate":"964294012","msgId":11473,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM5NzlGNTc3Ljk4RThBNUQxQGFsZHVzLm5vcnRobmV0Lm9yZz4=","referencesHeader":"PDMuMC4yLjMyLjIwMDAwNzIyMTQ1NTQzLjAwZTk3NzI0QG1haWwuZWFydGhsaW5rLm5ldD4="},"prevInTopic":0,"nextInTopic":11999,"prevInTime":11472,"nextInTime":11474,"topicId":11473,"numMessagesInTopic":0,"msgSnippet":"This came from a librarian who says he s checked it out and it s for real.  You may receive this on more than one list; forgive me. Linda ... Date: Sat, 22 Jul","messageBody":"<div id=\"ygrps-yiv-1946523421\">This came from a librarian who says he&#39;s checked it out and it&#39;s for real.  You<br/>\nmay receive this on more than one list; forgive me.<br/>\n<br/>\nLinda<br/>\n<br/>\n---------- Forwarded message ----------<br/>\nDate: Sat, 22 Jul 2000 10:25:01 -0400<br/>\nFrom: Maren Miles &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mmiles@...\">mmiles@...</a>&gt;<br/>\nTo: Recipient List Suppressed:  ;<br/>\nSubject: Urgent Action Item: Help Kill the Carnivore!<br/>\n<br/>\nFrom: &quot;Privacy News ListManager&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:owner-privacy-news@...\">owner-privacy-news@...</a>&gt;<br/>\n<br/>\n* Immediate action required: Help us Kill the Carnivore!<br/>\n<br/>\nOn July 14 we issued a press release about an FBI cybersnooping<br/>\ndevice code-named Carnivore, which can scan millions of e-mails<br/>\nper second. Because Carnivore has unlimited power to spy on<br/>\nalmost everyone with an e-mail account, it may be the biggest<br/>\nthreat to your digital privacy ever.<br/>\n<br/>\nAlmost immediately after the existence of this project was<br/>\ndisclosed in a July 11 Wall Street Journal article, public<br/>\noutrage began to mount -- and now Congress has been pressured<br/>\ninto holding hearings on Carnivore.<br/>\n<br/>\nTo capitalize on Monday&#39;s hearing before a House Judiciary<br/>\nCommittee panel, weve launched a campaign to &quot;Kill the<br/>\nCarnivore&quot;!<br/>\n<br/>\nPoliticians on Capitol Hill may be planning to mollify the<br/>\npublic by starting an &quot;investigation&quot; into the system, but<br/>\nthat&#39;s not enough: We want to stop the Carnivore in its tracks<br/>\nand kill it -- before it devours your privacy.<br/>\n<br/>\nPlease read this e-mail and *IMMEDIATELY* take the action<br/>\nbelow. Then forward this e-mail to friends, and ask them to do<br/>\nthe same.<br/>\n<br/>\nBACKGROUND: Carnivore is a hardware-software device that the<br/>\nFBI secretly developed at its lab in Quantico, Va.  Dubbed<br/>\nCarnivore because of its ability to find &quot;the meat&quot; among<br/>\nmillions of e-mails, Carnivore scans every incoming and<br/>\noutgoing e-mail message on a network looking for telltale words<br/>\nor names, and saves those messages for later retrieval by law<br/>\nenforcement. Carnivore can also track instant messages, visits<br/>\nto websites, and Internet relay chat sessions.<br/>\n<br/>\nThe FBI admits that Carnivore will scan millions of e-mail<br/>\nmessages from innocent people to find a tiny number of messages<br/>\nfrom people suspected of crimes.  That&#39;s no different than if<br/>\nthe FBI opened everyone&#39;s mail hoping to find a letter from a<br/>\ncriminal, or listened in on everyone&#39;s phone calls just in case<br/>\na crime was being discussed.<br/>\n<br/>\nThough Carnivore&#39;s existence was just publicly revealed, the<br/>\nFBI has already installed the device at dozens of Internet<br/>\nService Providers (ISPs) around the country, and claims it has<br/>\nused it &quot;fewer than 50 times&quot; so far. In many cases, the FBI<br/>\nkeeps the device in a locked cage on the ISP&#39;s premises, with<br/>\nagents making daily visits to retrieve the captured data.<br/>\n<br/>\nMany ISPs have refused to allow the FBI to install Carnivore,<br/>\nciting concerns that the privacy of all their customers could<br/>\nbe violated. But earlier this year, a federal judge ruled<br/>\nagainst one such ISP, leaving it no choice but to allow the FBI<br/>\naccess to its system.<br/>\n<br/>\nPredictably, the FBI promises to limit surveillance to messages<br/>\nfrom suspected hackers, terrorists, or drug dealers. But<br/>\nconsidering that this is the same agency that quietly inserted<br/>\n&quot;roving telephone tap&quot; authority into federal law and illegally<br/>\nturned over confidential personnel files to the Clinton White<br/>\nHouse, you shouldn&#39;t be expected to trust it with your<br/>\nconfidential e-mails.<br/>\n<br/>\nBut Carnivore is more than a threat to your ordinary e-mail<br/>\ncorrespondence -- it also gives government bureaucrats the<br/>\nability to spy on your online banking transactions, because it<br/>\nhas the ability to monitor all digital communications. The<br/>\nbottom line is that your privacy won&#39;t be protected as long as<br/>\nCarnivore is on the loose.<br/>\n<br/>\nAt this point, no legislation to eliminate Carnivore has been<br/>\nproposed. However, with your help we can change that. Keep in<br/>\nmind that we kicked off our campaign to kill the FDIC&#39;s &quot;Know<br/>\nYour Customer&quot; bank spy scheme last year before any legislation<br/>\nexisted. But once we informed the public about this threat to<br/>\ntheir financial privacy, they swung into action and demanded an<br/>\nimmediate end to the program. Americans flooded Capitol Hill<br/>\nwith over 300,000 angry e-mails and phone calls, and within<br/>\nweeks, Know Your Customer was withdrawn.<br/>\n<br/>\nWe believe that once Americans learn about Carnivore&#39;s<br/>\noutrageous assault on their electronic privacy, they will<br/>\ndemand legislation to abolish it as well.<br/>\n<br/>\nThat&#39;s why we&#39;re asking you to join the &quot;Kill the Carnivore&quot;<br/>\ncampaign!<br/>\n<br/>\n<br/>\nWHAT TO DO:<br/>\n<br/>\nCall the Congressional switchboard, toll free, at<br/>\n1-888-449-3511. If that number is busy try 202-225-3121 or<br/>\n202-224-3121. Then ask to speak to the office of your<br/>\nCongressional representative. The switchboard is open 24 hours,<br/>\nand most House offices have voice mail, so please make the call<br/>\nas soon as you get this message.<br/>\n<br/>\n<br/>\nWHAT TO SAY:<br/>\n<br/>\n(1) Identify yourself and let them know you are a voter in<br/>\ntheir district. Leave your name, address, complete with ZIP<br/>\ncode, and phone number. Please be brief, especially if you are<br/>\nleaving a message.<br/>\n<br/>\n(2) Let them know that you&#39;re calling in response to Monday&#39;s<br/>\nhearing on the FBI&#39;s Carnivore e-mail spy scheme. (The hearing<br/>\nis being held by the House Judiciary Committee&#39;s subcommittee<br/>\non the Constitution.) Tell them that Carnivore poses an<br/>\nimmediate threat to your e-mail privacy and that you want it<br/>\nabolished. Specifically, ask your representative to personally<br/>\nsponsor or co-sponsor legislation to abolish the FBI&#39;s<br/>\nCarnivore program now! Insist that you do *not* want an<br/>\ninvestigation, or Congressional hearings, or a &quot;blue ribbon&quot;<br/>\ncommission -- you want to Kill the Carnivore now!<br/>\n<br/>\n(3) Ask them to write you a letter spelling out their position<br/>\non Carnivore, and detailing what they intend to do.<br/>\n<br/>\nOne more thing: Please forward this e-mail to friends, and ask<br/>\nthem to call their representative, too. Thank you for your help!</div>","specialLinks":[]}],"prevTopicId":11997,"nextTopicId":12000}}