{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":56051484,"authorName":"grlynbl@aol.com","from":"grlynbl@...","profile":"tbb1967","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Sunday SCHOOL- Confirmation &quot;class&quot;","postDate":"1048514009","msgId":61825,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJhLjNhYjJhZTM0LjJiYjA2N2Q5QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":61824,"nextInTime":61826,"topicId":61825,"numMessagesInTopic":0,"msgSnippet":"We belong to a methodist church.  When Landon went through confirmation, they met every week on Sunday afternoons.  It was a very casual atmosphere and Landon","messageBody":"<div id=\"ygrps-yiv-1005823980\">We belong to a methodist church.  When Landon went through confirmation, they <br/>\nmet every week on Sunday afternoons.  It was a very casual atmosphere and <br/>\nLandon never complained (although he is accustomed to &quot;class&quot; since goes to <br/>\nschool)  <br/>\n<br/>\nAnna is going through confirmation right now and they have changed the format <br/>\nto something much better.  Now, the confirmands each have a mentor.  They <br/>\nmeet ( at their convenience) with their mentor to ask questions, have <br/>\nconversations, and discuss the bible scripture they are supposed to read ( I <br/>\nknow, I know, an &#39;assignment&quot;.. Anna has not had a problem with that though.  <br/>\nShe reads some of it and I read some of it aloud to her. no big deal)  The <br/>\nwhole experience is one on one.  Much more personal and communicative.  They <br/>\nwill meet as a group one time for supper and mingling.    She is learning a <br/>\nlot going through confirmation and he has really enjoyed her special time <br/>\nwith her mentor.  The goal is for them to continue this relationship and for <br/>\nthe confirmands to feel they always have someone they can call, ask for <br/>\nadvice, and be a role model for them.   <br/>\n<br/>\nAnna really likes her grandparents church a lot better because there have a <br/>\nmuch larger and more active youth group than  our church.   She said that she <br/>\nmay want to go to church there instead.  She felt a little &quot;weird&quot; going <br/>\nthrough confirmation and then maybe &quot;ditching&quot; our  church for a different <br/>\none.  I told her that was all a personal choice for her.  If she wants to <br/>\nfinish confirmation, then that is fine.  If she wants to stop, thats fine <br/>\ntoo.  She can be active in both churches.  She can pick and chose which <br/>\nactivities she wants to do at each one.   Or, she can not go to church at a<br/>\nll.  She wants to finish confirmation because she is enjoying it and likes <br/>\nher mentor.  But who knows, she may become a baptimeth or something.. :-)<br/>\n<br/>\nTeresa<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":61815,"nextTopicId":61828}}