{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Covert","from":"Covert &lt;covert@...&gt;","replyTo":"LIST","senderId":"jysufFzM6jIlRejlU4_ScjzQdJiBZ7I2n_u4VUISvDLrj1XwNB9lU5SVsrqdY4nm-NZ2GTt71Ku0-u3aF6lnwRuTPiwu0w","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Japanese teens speak on forced volunteering","postDate":"970483773","msgId":13576,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDAxMDAyMTA0OS5UQUEwMDAzNkBzbXRwMi5kdGkubmUuanA+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":13575,"nextInTime":13577,"topicId":13576,"numMessagesInTopic":0,"msgSnippet":"Hi all, An article here about the current proposal before the Japanese government on compulsory community service in Japanese schools. This was written by a","messageBody":"<div id=\"ygrps-yiv-73539470\">Hi all,<br/>\n<br/>\nAn article here about the current proposal before the Japanese government <br/>\non compulsory community service in Japanese schools. This was written by <br/>\na staff writer of the Asahi Shimbun newspaper and translated into English <br/>\nfor today&#39;s edition of the Asahi Evening News.<br/>\n<br/>\nAll too rare these days are the news articles that ask young people <br/>\nthemselves what they think about forced volunteering and other issues <br/>\nthat directly affect them. This story helps to bridge that gap in its own <br/>\nway.<br/>\n<br/>\nRegards,<br/>\n<br/>\nBrian Covert<br/>\n(KnoK NEWS)<br/>\nin Osaka, Japan<br/>\n<br/>\n---------------------<br/>\n<br/>\n2 Oct. 2000 - Asahi Evening News<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.asahi.com/english/asahi/1002/asahi100212.html\">http://www.asahi.com/english/asahi/1002/asahi100212.html</a><br/>\n<br/>\n<br/>\nWILL COMPULSION ENHANCE STUDENTS&#39; COMMUNITY SPIRIT?<br/>\n<br/>\nThe official proposal to put &#39;service activities&#39; on the school <br/>\ncurriculum is lauded by some -- but decried by many.<br/>\n<br/>\n<br/>\nBy KYOKO FUJIU<br/>\n<br/>\nThe National Commission on Educational Reform, an advisory body to the <br/>\nprime minister, has proposed making &quot;service activities&quot; compulsory for <br/>\nschool students, and the government has indicated its intention to <br/>\nintroduce a bill in the Diet next year containing a provision for <br/>\ncompulsory community service.<br/>\n<br/>\nHowever, opposition to the idea remains strong, and revolves around two <br/>\nmain questions. The first is whether there is anything wrong with <br/>\nincluding an element of compulsion in activities that have generally been <br/>\nthe preserve of volunteers, and where the spontaneity of willing <br/>\ninvolvement is highly valued. The second is whether it is necessary to <br/>\ninstill a sense of community spirit in everyone.<br/>\n<br/>\nAsahi Shimbun asked a number of young volunteer workers around Tokyo for <br/>\ntheir views, and the response was overwhelmingly -- but not exclusively <br/>\n-- that compulsion would take the true meaning out of community service.<br/>\n<br/>\nNearly all the 10 Tokyo high school students interviewed, who were <br/>\ncurrently engaged in volunteer work, objected strongly to the way adults <br/>\ntalk about &quot;service activities.&quot; Their responses included: &quot;Stuffy and <br/>\nold-fashioned&quot; and &quot;Weird -- it would be like homework.&quot;<br/>\n<br/>\nKanako Inoue of the municipal Oyama High School hadn&#39;t been working as a <br/>\nvolunteer for very long. A fashionable young woman wearing a silver chain <br/>\naround her neck, she was adamant that true service requires commitment.<br/>\n<br/>\n&quot;I do it because I&#39;m interested. I continue because I enjoy it,&quot; she said.<br/>\n<br/>\nBut she has had some surprises, too. One day when she was collecting <br/>\ndonations, for example, she said a young man with bleached, golden-brown <br/>\nhair told her, &quot;Keep up the good work.&quot;<br/>\n<br/>\nModestly, though, Inoue said, &quot;It&#39;s nothing special, nothing particularly <br/>\nworthy. I&#39;m just doing what I can. I don&#39;t think it&#39;s something you can <br/>\nmake obligatory.&quot;<br/>\n<br/>\nMariko Suzuki, who attends the private Tokyo Jogakkan High School, is <br/>\nalso against compulsion. She has been volunteering at a retirement home <br/>\nsince she was in junior high school. She keeps the elderly residents <br/>\ncompany and helps with the preparation of meals. Some of the residents <br/>\nreceive no visits from their families, and some are bedridden. Helping <br/>\nout at the home has made Mariko think about things she would never have <br/>\ndreamed of in the ordinary course of life.<br/>\n<br/>\nSomething to give<br/>\n<br/>\nIn particular, she said she will never forget the time she spent with one <br/>\nelderly lady who always said, &quot;Thank you.&quot;<br/>\n<br/>\n&quot;You become a volunteer because you have something to give to others. If <br/>\nthey make (community service) compulsory, that side of it will be <br/>\nweakened,&quot; she said, adding, &quot;That&#39;s the last thing we need.&quot;<br/>\n<br/>\nRyoji Takano, from the municipal Minami Tama High School, expressed <br/>\nirritation at the suggestion by some adults that making young people do <br/>\ncommunity service would be some kind of solution to youth crime and other <br/>\nproblems affecting Japanese youth.<br/>\n<br/>\n&quot;Our generation don&#39;t exactly stand up for ourselves, do we? If we&#39;re <br/>\ngoing to be graded on it for internal assessments, everyone will <br/>\nvolunteer, especially those goody-two-shoes, hypocritical, A-grade <br/>\nstudents who are always worried what the people in charge are thinking of <br/>\nthem.<br/>\n<br/>\n&quot;If it&#39;s made compulsory, I&#39;m afraid the tendency will only get <br/>\nstronger,&quot; he warned.<br/>\n<br/>\nHowever, a small minority of the students interviewed thought it wasn&#39;t <br/>\nsuch a bad idea to make community service compulsory.<br/>\n<br/>\nNobuyuki Ome, an 18-year-old Oyama High School student, described how one <br/>\nof his friends who was habitually lethargic suddenly came alive when <br/>\nplaying with the children in a nursery school. After seeing how grateful <br/>\nthe residents were, he said he too had felt the value of visiting a <br/>\nretirement home, even though it was not exactly what he would have chosen <br/>\nto do. &quot;Some of them were on the point of tears,&quot; he said.<br/>\n<br/>\nIf it gives young people an awareness of the importance of human contact <br/>\nthat they wouldn&#39;t otherwise have, it&#39;s not such a bad thing, he concluded.<br/>\n<br/>\nNami Matsuura, aged 16, from Minami Tama High School, worked as a <br/>\nvolunteer at a nursery school during the summer vacation. &quot;Even if you&#39;re <br/>\nmade to do it, it opens up opportunities,&quot; she said.<br/>\n<br/>\nAs an only child, Matsuura was grateful for the chance to get to know a <br/>\nwider variety of people. But she confessed she had to tread carefully <br/>\nwith people she didn&#39;t much like.<br/>\n<br/>\nA third group also agreed with the idea of compulsory service under <br/>\ncertain conditions.<br/>\n<br/>\n&quot;How about building in a trial period?&quot; asked18-year-old Oyama High <br/>\nSchool student Yoko Mita. &quot;If people try it and don&#39;t like it, let them <br/>\nquit. And they could be allowed to choose what they prefer from a range <br/>\nof activities. I&#39;d agree as long as we&#39;re guaranteed that level of <br/>\nfreedom,&quot; she said.<br/>\n<br/>\nNoboru Hayase, head of the Japan NPO Center, has heard it all before, <br/>\nsince calls for compulsory community service have been around since the <br/>\n1970s. However, one recent development is that would-be teachers are now <br/>\nobliged to spend time working in a care facility, or something similar, <br/>\nin order to obtain a teaching license. Unfortunately, though, many of the <br/>\ninstitutions they&#39;re supposed to be helping are rather unhappy with the <br/>\narrangement.<br/>\n<br/>\n&quot;Volunteer activities are a kind of love affair,&quot; Hayase said. &quot;People do <br/>\nthem because they like to, and that is the source of true community <br/>\nspirit.&quot;<br/>\n<br/>\nHe believes the arguments of those who call for compulsory service <br/>\nschemes are based on thinking that puts the whole before the individual. <br/>\nThey&#39;re taking things too far, he said.<br/>\n<br/>\nAkira Kurihara, a Rikkyo University professor speaking for the Japan <br/>\nAssociation for Volunteer Activities, estimated that the National <br/>\nCommission on Educational Reform was more than 20 years behind the times <br/>\nwith its confrontational concept of community service; of people who <br/>\nserve and people who are served; and with its thinking that community <br/>\nservice would take place mainly in agriculture and in caring for the <br/>\nsick, the elderly and the disabled. In his view, it&#39;s not much different <br/>\nfrom a group of middle-aged people sitting in a bar, drinking beer and <br/>\ngrumbling about the &quot;young people today.&quot;<br/>\n<br/>\nAgainst the tide<br/>\n<br/>\nAccording to Kurihara, the commission is clearly going against the tide <br/>\nin an age when ordinary citizens are networking spontaneously in ways <br/>\nquite different from the old-style community groups and opposition <br/>\nmovements. Its goal, he said, is obviously a revision of the Fundamentals <br/>\nof Education Act.<br/>\n<br/>\nRyoichi Kawakami chairs the group Professional Teachers and is a member <br/>\nof the National Commission on Educational Reform. As someone who knows <br/>\nwell how the situation stands in the country&#39;s schools, he supports <br/>\ncompulsion. Education Ministry policy has, he explained, concentrated <br/>\nmainly on lesson content, with less and less in the way of formal <br/>\nactivities. The result is, he said, that children are receiving less <br/>\nexperience in doing things together in groups.<br/>\n<br/>\nMoreover, even younger teachers are incapable of leading group <br/>\nactivities, he complained. And if things go on as they are, there will be <br/>\nmore and more people inept at anything that involves working together <br/>\nwith others.<br/>\n<br/>\nYoungsters will learn something from the experience, even if they are <br/>\nforced into it, Kawakami said. Instead of always pouncing on others&#39; <br/>\nweaknesses, they should be given a chance to learn at first hand the <br/>\nimportance of doing something for other people.<br/>\n <br/>\n<br/>\nCopyright 2000 - Asahi Shimbun</div>","specialLinks":[]}],"prevTopicId":13563,"nextTopicId":13577}}