{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":2300774,"authorName":"Betsy","from":"Betsy &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] one typical and one LONG SCARY statement of  faith","postDate":"1036772324","msgId":49504,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNEQ0JFM0UzLjMzODQ5MDJAZWFydGhsaW5rLm5ldD4=","referencesHeader":"PDI5LjMwYjMzN2Q1LjJhZmM5OWM1QGFvbC5jb20+"},"prevInTopic":49457,"nextInTopic":0,"prevInTime":49503,"nextInTime":49505,"topicId":49457,"numMessagesInTopic":0,"msgSnippet":"**We believe in the deity of our Lord Jesus Christ, in His virgin birth, in His sinless life, in His miracles, in His vicarious and atoning death through His","messageBody":"<div id=\"ygrps-yiv-1443144024\">**We believe in the deity of our Lord Jesus Christ, in His virgin birth,<br/>\nin His sinless life, in His miracles, in His vicarious and atoning death<br/>\nthrough His shed blood, in His bodily resurrection, in His ascension to<br/>\nthe right hand of the Father, and in His visible and physical return to<br/>\nearth. **<br/>\n<br/>\n<br/>\nIf people are only saved by faith, how come they have to be carefully<br/>\nobedient for their entire lives, starting as babies?<br/>\n<br/>\nBetsy</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"one typical and one LONG SCARY statement of faith","postDate":"1036730309","msgId":49457,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI5LjMwYjMzN2Q1LjJhZmM5OWM1QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":49504,"prevInTime":49456,"nextInTime":49458,"topicId":49457,"numMessagesInTopic":0,"msgSnippet":"In a message dated 11/7/02 9:16:47 PM, ecsamhill@earthlink.net writes: ","messageBody":"<div id=\"ygrps-yiv-1205767471\">In a message dated 11/7/02 9:16:47 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ecsamhill@...\">ecsamhill@...</a> writes:<br/>\n<br/>\n&lt;&lt; Does anyone have a typical Statement of Faith from a major exclusionary<br/>\nChristian homeschooling group?  That might clarify what specific beliefs<br/>\nwe are talking about.<br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Statement of Faith<br/>\n<br/>\nWe believe the Bible to be the only infallible authoritative Word of God. (II <br/>\nTim. 3:16) <br/>\nWe believe God is one divine Spirit eternally manifested as Father, Son and <br/>\nHoly Spirit. (Jn 10:29f; Jn 10:30 ; Jn 15:26) <br/>\n<br/>\nWe believe in the deity of our Lord Jesus Christ, in His virgin birth, in His <br/>\nsinless life, in His miracles, in His vicarious and atoning death through His <br/>\nshed blood, in His bodily resurrection, in His ascension to the right hand of <br/>\nthe Father, and in His visible and physical return to earth. <br/>\n<br/>\nWe believe all have sinned and as a result are alienated from God (Rom. 3:23, <br/>\n5:12), and that eternal redemption is only brought about by faith in the <br/>\nfinished work of the Lord Jesus Christ (Rom. 10: 9-10; Eph. 2:8-9). <br/>\n<br/>\nWe believe that if one rejects the finished work of the Lord Jesus Christ, he <br/>\nsubjects himself to eternal damnation and separation from God the Father and <br/>\nwill spend eternity in a literal place called hell (Rev. 21:8). <br/>\n<br/>\nWe believe in the present ministry of the Holy Spirit, by whose indwelling, <br/>\nthe Christian is enabled to live a godly life. (Rom. 8:13-14; I Cor. 3:16, <br/>\n6:19-20; Eph. 4:30, 5:18). <br/>\n<br/>\nWe believe in the spiritual unity of believers in our Lord Jesus Christ. <br/>\n<br/>\n<br/>\nConfession of Faith from<br/>\nThe Old Schoolhouse™<br/>\n<br/>\nJesus Christ, the Word is God. God the Father is God. The Holy Spirit is God. <br/>\nThere are no gods but one God<br/>\n.<br/>\nWe believe in God the Father who is the Maker of the heavens and the earth; <br/>\nand in Jesus Christ, His only Son, our Lord. Jesus Christ was conceived by <br/>\nthe Holy Spirit, and was born of a virgin, Mary. He ministered to many during <br/>\nHis ministry, never once sinning. He suffered tremendously under Pontius <br/>\nPilate, was crucified on a cross, died, was buried (descending into Hades at <br/>\nthat time), and then ROSE again on the third day, from the dead! After <br/>\nrising, which shocked and amazed many witnesses, causing them to worship Him <br/>\nand acknowledge Him as God in the flesh, Jesus ascended into Heaven, where He <br/>\nsits at the right hand of God the Father. Back to Earth He shall come again, <br/>\nto judge the living and the dead.<br/>\n<br/>\nWe believe in the Holy Spirit, one holy Christian church, the communion of <br/>\nall true saints, the forgiveness of sins, the resurrection of the body, and <br/>\nthe eternal (never-ending) gift of life.<br/>\n<br/>\nWe believe that the Bible is the ONLY inerrant Word of God. In it we can find <br/>\nall instructions in righteousness, holiness and faith. It is our <br/>\nauthoritative &quot;handbook&quot; for Christian living...the ONLY book that is <br/>\nnecessary for our faith.<br/>\n<br/>\nWe believe that there is one God, eternally existent in three persons; <br/>\nFather, Son and Holy Spirit. This ONE God is omnipotent, omnipresent and <br/>\nomniscient. This God is also holy, righteous, good, loving and full of mercy, <br/>\nby character. He is the Creator of all things. He sustains all things.<br/>\n<br/>\nWe believe that Jesus Christ, Who is our Lord God, is fully God, yet fully <br/>\nman. Only through Jesus Christ can man find redemption, and have eternal <br/>\nlife. Without Jesus Christ, man cannot find eternal life, but will spend <br/>\neternity apart from God, in suffering. This eternal life with God is freely <br/>\ngiven of God, but must be accessed His way, which is through His son, our <br/>\nLord Jesus Christ.<br/>\n<br/>\nWe believe in the full deity of the Holy Spirit, and acknowledge His role as <br/>\nGod, in creation and in redemption, and very importantly as our Comforter. <br/>\nThe present ministry of the Holy Spirit, among many things is to indwell in <br/>\nthe Christian, enabling him to live a godly life.<br/>\n<br/>\nWe believe that man is in rebellion against God because of Adam&#39;s sin. Man&#39;s <br/>\nvery nature is evil, and all are bound for hell, a place of eternal darkness <br/>\nand torment, unless the Father calls him. For salvation of any man, <br/>\nregeneration by the Holy Spirit is absolutely necessary. We are made <br/>\nrighteous by God, through faith in Him, and although faith without works is <br/>\ndead, it is faith ALONE which brings salvation.<br/>\n<br/>\nWe believe in the resurrection of both the saved and the lost; those who are <br/>\nsaved to the resurrection of life, and those who are lost to the resurrection <br/>\nof damnation.<br/>\n<br/>\nWe believe that at the perfect time in history, God chose to reveal Himself, <br/>\nand to declare His will to His Church. Afterwards, for the purpose of <br/>\npreserving and propagating the truth, and for the more certain establishment <br/>\nand comfort of the Church against corruption, and the malice of Satan and of <br/>\nthe world, it pleased Him to commit this revealed will to the written word. <br/>\nThis word, the Word (Bible), is very necessary to the Church, vitally <br/>\nimportant, for His former methods of revealing His will to His people are now <br/>\nceased.<br/>\n<br/>\nThe Holy Scripture (the Bible or the Word) consists of all of the books of <br/>\nthe Old and New Testaments, which are Genesis through Malachi, and Matthew <br/>\nthrough Revelation, respectively. Each and every one of these books are given <br/>\nby inspiration of God, to be the rule of faith and life.<br/>\nThere are several books, commonly called the Apocrypha, which are not of <br/>\ndivine inspiration, and are no part of the canon of Scripture. Therefore, <br/>\nthey can not be used as an authority from which to draw from, in the Church <br/>\nof God. They are not to be more esteemed, or made use of, than any other <br/>\nworks of printed materials.<br/>\n<br/>\nThe authority of the Bible does not depend on the testimony or tradition of <br/>\nany man or church, but entirely upon God, who is Truth itself, and the Author <br/>\nof truth. It is therefore to be received as the highest authority, and can be <br/>\ndepended on fully, without any supplementation. It is the divinely inspired <br/>\nWord of God.<br/>\n<br/>\nThe whole counsel of God, concerning all things necessary for God&#39;s glory, <br/>\nman&#39;s salvation, faith and life, is either expressly set down in Scripture or <br/>\nmay be deduced from Scripture. Nothing whatsoever is to be added to this, <br/>\nwhether by &quot;new revelations&quot; of the Spirit or by the traditions of man.<br/>\n<br/>\nThe infallible rule of interpretation of Scripture is the Scripture itself. <br/>\nTherefore, when there is a question or misunderstanding about the true and <br/>\nfull sense of any passage in the Bible, it must be searched and known by <br/>\nother places in God&#39;s Word that speak more clearly, always considering <br/>\nbiblical context.<br/>\n<br/>\nWe believe that there is one living and true God. He is infinite, perfect, <br/>\npure. He is the Rewarder of those who diligently seek Him. He is most just in <br/>\nHis judgments, hating all sin, and He will by no means clear the guilty. God <br/>\nis loving, gracious, merciful, patient, abundant in goodness and truth. He <br/>\nforgives sin, but there is only One way He will forgive sin, only One -- <br/>\nthrough His Son, our Lord Jesus Christ, Who sacrificed Himself on the cross <br/>\nfor His Church. Many men say their ways &quot;seem&quot; right, but in God&#39;s holy Word, <br/>\nwe find what God Himself requires for the forgiveness of our sins, and <br/>\neternal life with Him. <br/>\n<br/>\nGod has all life, glory, goodness, blessedness, in and of Himself. He is not <br/>\nin need of any creatures which He has made. He has most sovereign dominion <br/>\nover all creatures -- over them, to do by them, for them and upon them. He <br/>\ndoes what He pleases, and nothing to Him is contingent or uncertain. He is <br/>\nmost holy in His counsels, His works and in all His commands. To Him, and Him <br/>\nalone is due from angels and mankind, and any other creature, whatever <br/>\nworship, service or obedience He is pleased to require of them. <br/>\n<br/>\nPlease send us a note if you would like more information on spending eternity <br/>\nwith God. Click on mailbox graphic below.</div>","specialLinks":[]}],"prevTopicId":49469,"nextTopicId":49513}}