{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":8,"messages":[{"userId":77662315,"authorName":"arcarpenter2003","from":"&quot;arcarpenter2003&quot; &lt;arcarpenter@...&gt;","profile":"arcarpenter2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: living la vida buena","postDate":"1074625438","msgId":89582,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJ1anUydSt1bGdyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PE5JQkJKSk5NT05BSkpDQlBJSURPQUVJRkNDQUEuYnVnbmJhdEBkaXJlY3dheS5jb20+"},"prevInTopic":89522,"nextInTopic":0,"prevInTime":89581,"nextInTime":89583,"topicId":89049,"numMessagesInTopic":0,"msgSnippet":"...  wrote: ","messageBody":"<div id=\"ygrps-yiv-469170249\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, Tim & Jennifer Johnson <br/>\n&lt;bugnbat@d...&gt; wrote:<br/>\n&lt;&lt;I&#39;m personally<br/>\ninterested in a more primitive (aka native) existence, but the beauty <br/>\nof<br/>\ncommunity is that we can be as involved with each other as is <br/>\ncomfortable.&gt;&gt;<br/>\n<br/>\nYou might be interested in reading Daniel Quinn -- he advocates, not <br/>\ncommunal living (as Sandra pointed out, there are reasons that <br/>\ncommunes don&#39;t tend to last that long), but tribal working <br/>\narrangments.  I won&#39;t go into it here, as I don&#39;t want to go too OT, <br/>\nbut check out _Beyond Civilization_ for a quick and dirty look at his <br/>\nthoughts.<br/>\n<br/>\nPeace,<br/>\nAmy</div>","specialLinks":[]},{"userId":168044812,"authorName":"Amy McCormick","from":"&quot;Amy McCormick&quot; &lt;cottagevt@...&gt;","profile":"cottagevt","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] living la vida buena","postDate":"1074486445","msgId":89522,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAyMjEwMWMzZGU0NCQ4YTk2YjFlMCQ2NDAxYThjMEBBbG95c2l1cz4=","referencesHeader":"PE5JQkJKSk5NT05BSkpDQlBJSURPSUVQR0NDQUEuYnVnbmJhdEBkaXJlY3dheS5jb20+"},"prevInTopic":89323,"nextInTopic":89582,"prevInTime":89521,"nextInTime":89523,"topicId":89049,"numMessagesInTopic":0,"msgSnippet":"Thanks for the clarification on the original post.  I have learned even more now, thanks to the additional information in your post (checked out the Farm in","messageBody":"<div id=\"ygrps-yiv-66331774\">Thanks for the clarification on the original post.  I have learned even more now, thanks to the additional information in your post (checked out the Farm in TN, etc.).  I am not as evolved as you are in your undertaking, but this has caused me to reassess what our original goals were when we moved to VT.  More below on your post.<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: Tim & Jennifer Johnson <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a> <br/>\n  Sent: Sunday, January 18, 2004 4:04 PM<br/>\n  Subject: RE: [UnschoolingDiscussion] living la vida buena<br/>\n<br/>\n<br/>\n  [Tim & Jennifer Johnson] We haven;t had this issue yet.  I know that not<br/>\n  attending school and being around the class system all day has delayed this,<br/>\n  but I can imagine that one day it will rear it&#39;s ugly head.&gt;&gt;<br/>\n<br/>\n  It&#39;s funny, I just saw a commercial today that played on this very thing we are talking about.  I only saw it once, so forgive any errors.  A couple of (male) hikers are walking along a country road, talking about how they want to live off the grid, back to nature, etc. They hitch a ride with a passing car, and when they get in, they slowly look around in awe at the &quot;beautiful&quot; (expensive) car - then there is a close up of the logo: RANGE ROVER.  In the face of capitalistic avarice the dream of a simple life went right out the window.  <br/>\n<br/>\n  In my opinion, the &quot;awe&quot; could also have been dismay over the fact that someone would choose to drive/own this $40-50k hulking conglomeration of plastic and metal spewing its unnecessarily immense polluting emissions without regard over the pristine land, but that&#39;s just me.<br/>\n<br/>\n  In any case, this commercial also plays on the common theory that only young idealists want to go counter-culture.  &quot;Ah, youth (chuckle, chuckle, wink, wink).&quot;  (It also lets those who have &quot;achieved&quot; the Range Rover-lifestyle  thing sit back in their leather recliner and smugly reminisce over their own apparently misguided, idealistic youth.  How silly I was then before I gained control of my EMPIRE!!!) Sorry, I love to pick apart commercials.  Anyway.<br/>\n<br/>\n  However, there are a growing number of us who, instead of rejecting it all, are CHUCKING it all.  We are mid-30s to mid-40s, we have had the big careers, big investments, big house(s), the expensive cars, the ability to buy whatever we want, and the trust fund to cushion our falls, and we don&#39;t want that kind of life because it does not bring us the joy and fulfillment we seek.  I&#39;m not saying all of us are in this boat, but we do exist.  We hunger to be in harmony, in tune with the world, and we have a nagging intuition that it doesn&#39;t involve joining Dad&#39;s country club or summering on our yacht.  After the American Dream is reality, a new dream must take shape, perhaps a Global Dream - of a better earth.  A philanthropy to future generations.<br/>\n<br/>\n  It also is interesting to note that no matter how radical someone may think your choice to drastically simplify may be (actually, it sounds quite complex and intricate and fascinating, full of personal sacrifice, but I digress), we ALL are somewhere along the spectrum, either by choice or by government mandate.  Regulations on industrial and other pollution to our atmosphere, the (belated) protection of our oceans, the contamination of our water supply are beginning to affect all of us.  Many new houses being built are done with an eye toward using solar energy, maximizing site placement, improving windows and insulation (less power/heat/air usage), etc.  I guess the &quot;hippies&quot; were on to something 30-40 years ago, and the world will be better for it.<br/>\n<br/>\n  I think your commitment to the incredible change in your lifestyle as a personal, social, (and political?) statment is commendable, and I for one would be fascinated to hear more.  <br/>\n<br/>\n  Since the group has introduced me to Blogs (I lurk), I might add that I for one would regularly tune in to read how this transformation progresses. How about it? <br/>\n<br/>\n  &lt;&lt;I&#39;ll be happy to<br/>\n  keep you posted as to what transpires next.<br/>\n  Peace, Jennifer&gt;&gt;<br/>\n<br/>\n  I look forward to it!<br/>\n  A m y<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":160969203,"authorName":"Wendy Carr","from":"&quot;Wendy Carr&quot; &lt;WendyWCarr@...&gt;","profile":"wendycarrga","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] living la vida buena","postDate":"1074465482","msgId":89323,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTUtRjE0aXFLU3J4MXpLdGEwMDA0NGQ4YUBob3RtYWlsLmNvbT4="},"prevInTopic":89316,"nextInTopic":89522,"prevInTime":89322,"nextInTime":89324,"topicId":89049,"numMessagesInTopic":0,"msgSnippet":"This is my dream! We were about to buy some land and settle in and grow our own food and unschool our kids and just be ourselves, but then the army had ","messageBody":"<div id=\"ygrps-yiv-20340127\">This is my dream! We were about to buy some land and settle in and grow our <br/>\nown food and unschool our kids and just be ourselves, but then the army had <br/>\ndifferent plans for us and now we are headed to Germany. Everything happens <br/>\nfor a reason, so I am sure we are supposed to go to Germany (We have got <br/>\nGermany Orders 3 times and got out of them each time, but we keep getting <br/>\nthem, so now we are going cause we are supposed to go I guess). I am sure <br/>\nGermany will offer up some awsome unschooling times for us! BUT, when we get <br/>\nback, in 07, we are buying land and growing our own garden!!!<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;From: &quot;Danielle Conger&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:danielle.conger@...\">danielle.conger@...</a>&gt;<br/>\n&gt;Reply-To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a><br/>\n&gt;To: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>&gt;<br/>\n&gt;Subject: Re: [UnschoolingDiscussion] living la vida buena<br/>\n&gt;Date: Sun, 18 Jan 2004 16:56:27 -0500<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>Wendy Carr<br/>\nWhen the first baby laughed for the first time, the laugh broke into a <br/>\nthousand pieces and they all went skipping about, and that was the beginning <br/>\nof fairies. - Barrie<br/>\nMom to Austyn(8) and Caitlin(5 months)<br/>\n<br/>\nProud  To Home-school!<br/>\n<br/>\n_________________________________________________________________<br/>\nGet a FREE online virus check for your PC here, from McAfee. <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://clinic.mcafee.com/clinic/ibuy/campaign.asp?cid=3963\">http://clinic.mcafee.com/clinic/ibuy/campaign.asp?cid=3963</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":164542605,"authorName":"Danielle Conger","from":"&quot;Danielle Conger&quot; &lt;danielle.conger@...&gt;","profile":"danielleconger","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] living la vida buena","postDate":"1074462987","msgId":89316,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNDUwMWMzZGUwZCRlYzQ4YTFmMCQ2NDAxYThjMEBqZ2s2OTAwPg==","referencesHeader":"PE5JQkJKSk5NT05BSkpDQlBJSURPQUVJRkNDQUEuYnVnbmJhdEBkaXJlY3dheS5jb20+IDwwMGNlMDFjM2RkMWEkMmE4MDEwYjAkNjQwMWE4YzBAQWxveXNpdXM+"},"prevInTopic":89310,"nextInTopic":89323,"prevInTime":89315,"nextInTime":89317,"topicId":89049,"numMessagesInTopic":0,"msgSnippet":"Amy wrote: Also, how will you manage subsistence crops, if you are traveling?  (You mention not wanting to use supermarkets.)  I think you mean when you do","messageBody":"<div id=\"ygrps-yiv-1501859650\">Amy wrote: <br/>\n  Also, how will you manage subsistence crops, if you are traveling?  (You mention not wanting to use supermarkets.)  I think you mean when you do find land? This is something -- well, not at a subsistence level, I have to admit -- something I am interested in doing more with but am intimidated by.  I dabble in gardening, but when it comes to pest control, etc., I become overwhelmed.  I guess i just need to throw myself into it and use trial and error; I need to gain some confidence.<br/>\n  =================================================================<br/>\n<br/>\nI toy with this idea on a small scale, myself. I would love to have a bit more land here than we do, but I&#39;ve done a lot to our acre. I&#39;ve tried to plant as many edibles as possible, and many edible plants are quite ornamental (regional limitations apply, of course, we&#39;re on the Western Shore of the Chesapeake Bay and have quite an extended growing season compared to Vermont).<br/>\n<br/>\nI think it&#39;s really cool to be able to walk outside and grab what I need for cooking or snacking, or whatever. I read in an organic gardening book once about walking outside and taking note of all the things you could live off in your yard, and that stuck with me. I&#39;d love to take it a bit further, but I&#39;m no purist either. I have no problem with rounding out my production at the grocery store or the other local farm markets. &lt;g&gt; I also have dreams of someday raising sheep, and then I&#39;ll be joining you guys in the spinning and dying conversations. ;)<br/>\n<br/>\nWe have lots of herbs, plant lots of veggies, and have blueberries, blackberries and strawberries. I&#39;d love to get some pole apples to try, but they&#39;re supposed to be pretty hard to keep organically. Our crops provide so many learning opportunities! We&#39;re outside a lot in the nicer months, which always makes me feel better about being hunkered inside on days like today. &lt;g&gt; Even our failures we&#39;ve turned into successes. Carrots don&#39;t do much in our soil, but the swallowtail caterpillars *love* them, so now we plant them near our butterfly bushes just for the caterpillars. Our first season planting here was a terrible drought, but we had a bumper crop of beautiful hot peppers that lasted all through the winter once we&#39;d roasted and frozen them--made the transition from New Mexico a little easier to bear. &lt;g&gt;<br/>\n<br/>\nI knew very little about gardening when we moved into this house 2.5 years ago other than I desperately wanted to do it. We had a very small garden in Albuquerque that grew a couple of things, and my grandmother was a big gardener--grew up on farms in Virginia. But most of my knowledge is just from reading books and trial and error. Jump into it! It&#39;s great fun, and seeds don&#39;t cost a whole lot.<br/>\n<br/>\n--danielle<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":168765671,"authorName":"Tim & Jennifer Johnson","from":"Tim & Jennifer Johnson &lt;bugnbat@...&gt;","profile":"bugnbat","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] living la vida buena","postDate":"1074459889","msgId":89310,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PE5JQkJKSk5NT05BSkpDQlBJSURPSUVQR0NDQUEuYnVnbmJhdEBkaXJlY3dheS5jb20+","inReplyToHeader":"PDAwY2UwMWMzZGQxYSQyYTgwMTBiMCQ2NDAxYThjMEBBbG95c2l1cz4="},"prevInTopic":89275,"nextInTopic":89316,"prevInTime":89309,"nextInTime":89311,"topicId":89049,"numMessagesInTopic":0,"msgSnippet":"Hi Amy, we have been in search of community for about a year now.  Not desperately, but in our travels, if we knew of one down the road, we made an attempt to","messageBody":"<div id=\"ygrps-yiv-1025450173\">Hi Amy, we have been in search of community for about a year now.  Not<br/>\ndesperately, but in our travels, if we knew of one down the road, we made an<br/>\nattempt to check it out.  Some communities had a focus of interpersonal<br/>\nrelationships, which I am all for, but not to the detriment of my<br/>\nsurroundings.  We are very much into alternative building and off-grid<br/>\nlifestyles, and some of the communities we looked into just didn&#39;t factor<br/>\nthose issues into their lives.  We have now limited our search to<br/>\neco-villages, generally.  I did find a community which I fell in love with<br/>\nin North Carolina, but their membership fees were extremely high, and were<br/>\nrequired before even becoming a member.  It would have depleted our savings,<br/>\nand left no room to build nor create a home business.  We would again be in<br/>\nthe trap of having a mortgage, and the emotions that coincide with that<br/>\nventure.<br/>\nAs far as what we would want to share, people are not included.  I have even<br/>\nread of one community that shares the children.  When you join the<br/>\ncommunity, you relinquish your &quot;ownership&quot; for severe lack of a better word,<br/>\nand all the children become everyone&#39;s children.  Very different from our<br/>\nculture, and I don&#39;t know how well I would do at that. By sharing things i<br/>\nmeant meals, stories, laughter, books, gardens, farm animals (for milk,<br/>\neggs, and meat), toys, games, arts, music, tools, appliances, and vehicles.<br/>\nThis would necessitate a common space for these activities.  I imagine a<br/>\ncentral common area surrounded loosely by private accommodations.<br/>\n<br/>\nYou have mentioned money and savings.  personally, the sale of our home gave<br/>\nus a little next egg which we dip into to travel.  I suppose that we will<br/>\nuse whatever is left to sustain us as we search, and subsequently join a<br/>\ncommunity.  We intend to build a cob house, so that will be dirt cheap, but<br/>\nthe systems will require some capital. As for retirement, that would depend<br/>\non what type of community you join.  Many communities have home based<br/>\nbusinesses, large enough to support many in the community, or small enough<br/>\nto support only one family, and saving for retirement in these situations<br/>\nwould work the same as in a small business.  Some communities pool all<br/>\nresources, and provide all members with health care, lodging, and a stipend<br/>\nfor their entire membership. This is very reassuring to those with no<br/>\ninitial savings, but can be frustrating for members who eventually wish to<br/>\nleave but have little monetarily to show for their efforts while at the<br/>\ncommunity. Some offer a combination of the above.  it depends on what you<br/>\nwant.  Personally, I will probably seek out the first option, but, depending<br/>\non the group of people, I may consider an income sharing type of scenario.<br/>\nI know that Stephen Gaskin of The Farm is developing an assisted living<br/>\nfacility on the community, where older people who have no family, or older<br/>\nmembers can live out their lives in peace with the extended family of<br/>\ncommunity to support them.  I don&#39;t know the logistics, but it is definitely<br/>\nan interesting concept, and needed too, as the Farm enters it&#39;s third decade<br/>\nof existence.<br/>\nI thought this post was very interesting.  I know an unschooler (whose<br/>\nchildren are grown now) who bought property with another unschooling family<br/>\nwhen their children were young, and they together became a family.  I know<br/>\nit was very successful for them.  The concept itself has a certain appeal.<br/>\nI wonder how many homeschoolers/unschoolers are forming this kind of<br/>\nsymbiotic relationship.<br/>\n<br/>\n<br/>\n  BUT - How do you remain true to your convictions when friends are busy<br/>\naccumulating and building bigger houses to hold the bumf?  My daughter is<br/>\nbeginning to notice one friend&#39;s huge house and &quot;wants to be rich, too,&quot;<br/>\neven though WE probably have more money on paper than the &quot;rich&quot; friends (no<br/>\ndebt, nice retirement accounts). We discuss different types of being &quot;rich,&quot;<br/>\nwhich helps, but the &quot;I wants&quot; seem to be a congenital defect of our<br/>\nspecies. :)<br/>\n[Tim & Jennifer Johnson] We haven;t had this issue yet.  I know that not<br/>\nattending school and being around the class system all day has delayed this,<br/>\nbut I can imagine that one day it will rear it&#39;s ugly head.<br/>\nAlso, how will you manage subsistence crops, if you are traveling?<br/>\n[Tim & Jennifer Johnson] Yes, I definitely meant when we are done traveling.<br/>\nWe are in a tiny trailer, 13&#39;, and so even growing sprouts is difficult.<br/>\nFruits rot in a day or two, and veggies literally melt or freeze, depending<br/>\nit we leave them out or put them in the ice chest. In many ways, living in<br/>\nour suburb house was more environmentally appropriate. I organic gardened,<br/>\ncomposted, and used cloth instead of paper for everything. I miss cloth<br/>\ndiapers and composting more than I ever thought that I would.  We do hope to<br/>\nsettle into a place this year, and have had some wonderful options come our<br/>\nway even since we wrote this initial email strand.  In the meantime, we will<br/>\nfrequent national parks,. and communities along the way.<br/>\n<br/>\n[Tim & Jennifer Johnson] About the only thing that I look for in a community<br/>\nwhen it comes to my children is the following.  The  kids have to like it.<br/>\nDo they feel welcome?  Are they allowed to be themselves? Do people treat<br/>\nthem with respect as they would an adult? Are they open to the idea of<br/>\nnatural learning? Do they have lots of rules when it comes to kids, are<br/>\nthere lots of things that aren&#39;t allowed for kids?  I also would have to<br/>\nthink long and hard before i joined a community where there were lots of<br/>\nother kids, and they were all public schooled.<br/>\nI checked out Summerhill School, which is I think what you are referring to.<br/>\n[Tim & Jennifer Johnson]  We have thought(together with another family) of<br/>\ncreating a village, as a business of sorts. We don&#39;t want to provide a<br/>\nschool for kids, necessarily. Rather, we would like to create a place where<br/>\nanyone, regardless of age,can come and learn native/aboriginal skills,<br/>\nwilderness skills, and survival skills, and learn to live in tune with<br/>\nnature.  i imagine a village of people who are all learners, who are all<br/>\nthere to gain the knowledge that they seek, creating a real village.  I<br/>\nagree that many kids can create a pack society.  what I envision is more<br/>\nlike a multi-generational learning center. A place where people learn off<br/>\neach other, regardless of age.  Only interest guides learning.<br/>\n&lt;&lt; I&#39;m personally interested in a more primitive (aka native) existence, but<br/>\nthe beauty of<br/>\ncommunity is that we can be as involved with each other as is comfortable.&gt;&gt;<br/>\n[Tim & Jennifer Johnson] That is what Tim meant.  To have an extension of<br/>\nthat as a community.  Where members are a village, a tribe, all doing<br/>\nindividual, yet cooperative tasks for the good of everyone.  helping each<br/>\nother, and being helped by each other. Without keeping score/<br/>\n<br/>\n Anyway, that is just a rough sketch of what we are thinking now.  of<br/>\ncourse, the reality will probably be a variation of that, at most.<br/>\nCommunity if nothing else is truly the art of negotiation. I&#39;ll be happy to<br/>\nkeep you posted as to what transpires next.<br/>\nPeace, Jennifer<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n&quot;List Posting Policies&quot; are provided in the files area of this group.<br/>\n<br/>\nTo unsubscribe from this send an email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a><br/>\n<br/>\nVisit the Unschooling website and message boards: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n----------------------------------------------------------------------------<br/>\n----<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n    a.. To visit your group on the web, go to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/UnschoolingDiscussion/\">http://groups.yahoo.com/group/UnschoolingDiscussion/</a><br/>\n<br/>\n    b.. To unsubscribe from this group, send an email to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a><br/>\n<br/>\n    c.. Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service.<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n&quot;List Posting Policies&quot; are provided in the files area of this group.<br/>\n<br/>\nTo unsubscribe from this send an email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a><br/>\n<br/>\nVisit the Unschooling website and message boards: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n----------------------------------------------------------------------------<br/>\n----<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n    a.. To visit your group on the web, go to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/UnschoolingDiscussion/\">http://groups.yahoo.com/group/UnschoolingDiscussion/</a><br/>\n<br/>\n    b.. To unsubscribe from this group, send an email to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a><br/>\n<br/>\n    c.. Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service.<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] living la vida buena","postDate":"1074446441","msgId":89275,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFhMC4xZjczYWI1YS4yZDNjMWE2OUBhb2wuY29tPg=="},"prevInTopic":89268,"nextInTopic":89310,"prevInTime":89274,"nextInTime":89276,"topicId":89049,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/18/04 9:54:26 AM, cottagevt@adelphia.net writes: ","messageBody":"<div id=\"ygrps-yiv-877320373\">In a message dated 1/18/04 9:54:26 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:cottagevt@...\">cottagevt@...</a> writes:<br/>\n<br/>\n&lt;&lt; We discuss different types of being &quot;rich,&quot; which helps, but the &quot;I wants&quot; <br/>\nseem to be a congenital defect of our species. :) &gt;&gt;<br/>\n<br/>\n<br/>\nIf people didn&#39;t naturally want to improve their surroundings, nobody would <br/>\nwant to &quot;get back to nature&quot; or live differently than those around them.   <br/>\nEvery advance, discovery, bit of art, and experiment seem to come from the natural <br/>\nhuman need to see if they can&#39;t do a little more or a little better that day. <br/>\n  If people accomplish what they think they want to do to be happy, that <br/>\nunsettled curiosity and desire is still in them.<br/>\n<br/>\nAnd by &quot;people&quot; I mean the people we admire and reward and emulate.<br/>\n<br/>\nThere are people who wake up and don&#39;t want more and don&#39;t care about <br/>\nmaintenance of what they have.  That&#39;s not considered to be good by many people at <br/>\nall, though it cam be handy if they&#39;re in a nursing home or a hospital, for them <br/>\nto be quiet and content.  It&#39;s helpful if they&#39;re in poverty on the outskirts <br/>\nof some giant city living in a tin hut.   <br/>\n<br/>\n-=-Also, how will you manage subsistence crops, if you are traveling?  (You <br/>\nmention not wanting to use supermarkets.)  I think you mean when you do find <br/>\nland? -=-<br/>\n<br/>\nThe original poster mentioned New Mexico.   People can&#39;t even begin to <br/>\nmaintain themselves in New Mexico unless they&#39;re near the river, with irrigation, <br/>\nand they have a greenhouse, and they concentrate on food production.   <br/>\n<br/>\n-=- if anything I said rings true<br/>\nwith something that you are thinking please write, if anyone is interested<br/>\nin a better life please write back-=-<br/>\n<br/>\nHooking up with people who are discontented with life as it is has happened <br/>\nthroughout the ages, but unless a group has a leader and then followers who are <br/>\nwilling to ignore their own preferences and go with the leader&#39;s, it tends <br/>\nnot to be a group at all, nor for long.   One person&#39;s definition of &quot;a better <br/>\nlife&quot; is as unlikely to match another person&#39;s (unless they are both following <br/>\nthe philosophy of the same absent philosopher/leader/fantasy writer) as for <br/>\nthem both to get jackpots sitting next to each other at a casino.<br/>\n<br/>\nOne&#39;s &quot;better&quot; might involve American Indian religion (which is very <br/>\ndifferent from tribe to tribe and much of which cannot/does not translate outside the <br/>\ngroup anyway) and another&#39;s might involved vegetarianism, and another might <br/>\nnot want to limit clothing choices and another thinks only natural fibers should <br/>\nbe worn.   <br/>\n<br/>\nAnyone interested in communal living probably already has looked into the <br/>\ncauses and successes and failures of communes of the past, whether voluntary or <br/>\ngovernment created, and seen what bases could maintain one for a while and what <br/>\nproblems arise.<br/>\n<br/>\nThose problems will be seen to be the desire of people to have &quot;the &#39;I <br/>\nwants&#39;,&quot; and often the &quot;want&quot; is just for more freedom of movement or choice than <br/>\nthe group is set up to allow.<br/>\n<br/>\nUnless people have a common family, language, background and possibly <br/>\nreligion, it will be hard for them to feel they are living in a natural human culture <br/>\n(because they won&#39;t be), and they will be, to some extent, playing at <br/>\nculture.  Playing community, until it&#39;s not fun anymore.<br/>\n<br/>\nI&#39;m not against playing.  <br/>\nSome people don&#39;t think about culture and government when they want two or <br/>\neight families to bind together even for one growing season.   <br/>\n<br/>\nThere were lots of hippie communes and situations in northern New Mexico when <br/>\nI was in my teens and twenties.  The very few that are left are <br/>\nreligion-based, and didn&#39;t begin as hippie communes, but as retreats for study and worship. <br/>\n The &quot;communities&quot; now are more along the lines of food co-ops and extended <br/>\nfamilies that still live in nuclear-family situations but get together for <br/>\nholidays.  And most involved someone with a lot of money to get land/building <br/>\nstarted, and the person with the lot of money ends up with more power.<br/>\n<br/>\nSome things you can&#39;t get away from.  Even if you left the planet, someone&#39;s <br/>\nvision of the new community would need to prevail.  Someone payed for the jet <br/>\nfuel to get you pat gravity, and someone was smart enough to figure out how to <br/>\nland and survive.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":168044812,"authorName":"Amy McCormick","from":"&quot;Amy McCormick&quot; &lt;cottagevt@...&gt;","profile":"cottagevt","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] living la vida buena","postDate":"1074358294","msgId":89268,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwY2UwMWMzZGQxYSQyYTgwMTBiMCQ2NDAxYThjMEBBbG95c2l1cz4=","referencesHeader":"PE5JQkJKSk5NT05BSkpDQlBJSURPQUVJRkNDQUEuYnVnbmJhdEBkaXJlY3dheS5jb20+"},"prevInTopic":89049,"nextInTopic":89275,"prevInTime":89267,"nextInTime":89269,"topicId":89049,"numMessagesInTopic":0,"msgSnippet":"I thought this post was very interesting.  I know an unschooler (whose children are grown now) who bought property with another unschooling family when their","messageBody":"<div id=\"ygrps-yiv-919004317\">I thought this post was very interesting.  I know an unschooler (whose children are grown now) who bought property with another unschooling family when their children were young, and they together became a family.  I know it was very successful for them.  The concept itself has a certain appeal.  I wonder how many homeschoolers/unschoolers are forming this kind of symbiotic relationship.<br/>\n<br/>\n&lt;&lt;The reasons we sold our home and began this latest phase in our life are because we no longer wanted to live in square homes on grid-iron streets, unconnected to our neighbors,and from nature itself. &gt;&gt;<br/>\n<br/>\nI completely agree with this.  We used to live in the Washington, D.C. area, with accordingly high-stress jobs and lots of time spent commuting.  We made a conscious decision to sell our house and move to Vermont, specifically right on Lake Champlain, to be closer to nature and give our daughter and any other children in our lives (and US) a more simple, back-to-nature, joyful life. I work from home now, and my husband works retail (that&#39;s what&#39;s available here locally) -- our income dropped to 25% of what we had earned previously.  The idea of just selling the house and travelling is VERY appealing to me, but I cannot overcome practicality and adding to our retirement plans, etc., to make the leap that you have.  I find it FASCINATING, however, and would love to hear more about how you reached this conclusion in terms of practical steps - retirement, insurance, etc.<br/>\n<br/>\n&lt;&lt;In many ways unschooling was as much about us learning as it was for our<br/>\nchildren, when you begin to question the necessity of one thing suddenly<br/>\nother things which you thought you could never do without seen trivial.&gt;&gt;<br/>\n<br/>\nI strongly agree.  This is exactly the transformation we made.  BUT - How do you remain true to your convictions when friends are busy accumulating and building bigger houses to hold the bumf?  My daughter is beginning to notice one friend&#39;s huge house and &quot;wants to be rich, too,&quot; even though WE probably have more money on paper than the &quot;rich&quot; friends (no debt, nice retirement accounts). We discuss different types of being &quot;rich,&quot; which helps, but the &quot;I wants&quot; seem to be a congenital defect of our species. :)<br/>\n<br/>\nAlso, how will you manage subsistence crops, if you are traveling?  (You mention not wanting to use supermarkets.)  I think you mean when you do find land? This is something -- well, not at a subsistence level, I have to admit -- something I am interested in doing more with but am intimidated by.  I dabble in gardening, but when it comes to pest control, etc., I become overwhelmed.  I guess i just need to throw myself into it and use trial and error; I need to gain some confidence.<br/>\n<br/>\n&lt;&lt;After the earthships we began looking into alternative diets, something more<br/>\nin tune with what the planet can sustain, more veggies, more whole foods,<br/>\nless processed, less packaging.&gt;&gt;<br/>\n<br/>\nWonderful!  We were macrobiotic for years due to health reasons, now mellowing a bit to mostly vegetarian.  But our main staple is still short grain brown rice.  Meat is a condiment in our diet, not &quot;what&#39;s for diner.&quot;  Have you read &quot;Diet for a New America&quot;?  If not, I highly recommend it.  You&#39;ll be high on whole foods by the end.<br/>\n<br/>\nI get the idea of what an &quot;intentional community&quot; is like, but I&#39;ll check out the web site too.  Thanks for the site address.  You mention that you are particular about the environment for your children (he**, yes!); what about these communities is objectionable?  I am picturing a commune type of environment, but this is completely out of my own ignorance.<br/>\n<br/>\nI checked out Summerhill School, which is I think what you are referring to.  Here is a quick quote from the web site: <br/>\n&quot;Summerhill School is unique. Itis a progressive, co-educational, residential school... Summerhill is first and foremost a placewhere children can be free.  There are two features of theschool which visitors usually single out as being particularlyunusual. The first is that all lessons are optional. A schoolwhich compelled its pupils to go to lessons would be, at best, atravesty of freedom&gt;&gt;<br/>\n<br/>\nIt goes on to mention that there are something like 80 kids currently. I think this sounds interesting and I&#39;ll be reading more on the web site.  I personally believe that when people get together in groups that large there is a group mentality, the subject of which there have been scientific studies and &quot;in the field&quot; examples.  (Remember the person screaming for help on a New York street and tens of people drawing their drapes against the sound, thinking someone else would help? No one did.  Unless someone asks I won&#39;t go on with the shock experiments that were done to try to understand Hitler and his followers atrocities.)  I realize this might be an extreme comparison and with little causality between them (a nonsequitor, as it were), but I personally tend to withdraw from any kind of learning environment that is that large.  I think things tend to veer off the needs of the individual when that happens.  I suppose I need more information; I&#39;ll continue looking at the Summerhill site.<br/>\n<br/>\n&lt;&lt;Best of all they have open minds.&gt;&gt;<br/>\n&lt;&lt; I&#39;m personally interested in a more primitive (aka native) existence, but the beauty of<br/>\ncommunity is that we can be as involved with each other as is comfortable.&gt;&gt;<br/>\n<br/>\nThere&#39;s open-minded and then there&#39;s open-minded. :)  I consider myself open-minded, but I won&#39;t be going to a nudist colony or supporting partner-swapping!  This is very tongue-in-cheek -- I just started to go, &quot;whoa...&quot; when I read the above. :) I really am just asking you to define your term, &quot;open minds&quot; and &quot;native&quot; existence.  <br/>\n<br/>\n&lt;&lt;If anyone is interested please write us back, if anything I said rings true<br/>\nwith something that you are thinking please write, if anyone is interested<br/>\nin a better life please write back.&gt;&gt;<br/>\n<br/>\nMUCH of what you say rings true for us.  We have made major changes in our life similar to your beginnings, it sounds like, but your beginning became our end -- for now.  We  have actually considered the sell-everything-and-travel option; we haven&#39;t been willing to accept all that that would entail, however.  I am very curious, if you are willing to share, how this has affected long-term plans for retirement income, insurance, etc. and I mentioned above,  How does one get around these practical things?  Of course, if one lives simply, the retirement income &quot;rules&quot; do not quite apply, but I would love to hear about how someone who has thought it all through has gotten around/sees through all of that FEAR.<br/>\n<br/>\nBest wishes to you and yours,<br/>\nA m y<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n&quot;List Posting Policies&quot; are provided in the files area of this group. <br/>\n<br/>\nTo unsubscribe from this send an email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a> <br/>\n<br/>\nVisit the Unschooling website and message boards: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n--------------------------------------------------------------------------------<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n    a.. To visit your group on the web, go to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/UnschoolingDiscussion/\">http://groups.yahoo.com/group/UnschoolingDiscussion/</a><br/>\n      <br/>\n    b.. To unsubscribe from this group, send an email to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a><br/>\n      <br/>\n    c.. Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":168765671,"authorName":"Tim & Jennifer Johnson","from":"Tim & Jennifer Johnson &lt;bugnbat@...&gt;","profile":"bugnbat","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"living la vida buena","postDate":"1074214139","msgId":89049,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PE5JQkJKSk5NT05BSkpDQlBJSURPQUVJRkNDQUEuYnVnbmJhdEBkaXJlY3dheS5jb20+"},"prevInTopic":0,"nextInTopic":89268,"prevInTime":89048,"nextInTime":89050,"topicId":89049,"numMessagesInTopic":0,"msgSnippet":"Hello all, Some of you may know me (Tim Johnson) or more likely my wife Jennifer as she is the one that usually reads the hundreds of unschooling related posts","messageBody":"<div id=\"ygrps-yiv-1251152211\">Hello all,<br/>\n    Some of you may know me (Tim Johnson) or more likely my wife Jennifer as<br/>\nshe is the one that usually reads the hundreds of unschooling related posts<br/>\non the various mailing lists we are on.  I want to talk a little about<br/>\nourselves first and then make a plea later.  Even if we were not unschoolers<br/>\nwe would still be thought of as a little odd.  Most recently we sold our<br/>\nhome and took off down the road this last spring.  The reasons we sold our<br/>\nhome and began this latest phase in our life are because we no longer wanted<br/>\nto live in square homes on grid-iron streets, unconnected to our neighbors,<br/>\nand from nature itself.  While driving around in a 1967 VW bus may not be<br/>\nthe perfect answer to our needs it was better than paying a mortgage to live<br/>\na life that we thought of as unfulfilling.  The money is better spent on gas<br/>\nat least for now.  But this is already off of the topic, I do that a lot.<br/>\nIn many ways unschooling was as much about us learning as it was for our<br/>\nchildren, when you begin to question the necessity of one thing suddenly<br/>\nother things which you thought you could never do without seen trivial.<br/>\nThis includes stud-frame houses, supermarkets, cities, and still more that I<br/>\ndon&#39;t want to hit you with right now at the sake of sounding like a wacko.<br/>\nShortly after we made to choice to allow our children to pursue their<br/>\neducation we discovered Earthships www.earthship.org and we decided to rent<br/>\none on a vacation we took to New Mexico.  Do you know how when a dam starts<br/>\nto break (not a real one just the one you make out of sand at the beach) and<br/>\nwhen the water starts to trickle through the whole wall will soon fall, that<br/>\nwas what it felt like after being in the earthship, we started on the design<br/>\nof our own non-polluting, off-grid home, we are still working on a design.<br/>\nAfter the earthships we began looking into alternative diets, something more<br/>\nin tune with what the planet can sustain, more veggies, more whole foods,<br/>\nless processed, less packaging.  When you realize that it is not the makers<br/>\nof the product that is polluting the land but the people who buy from them<br/>\nand keep them in business then you realize where the blame should lie, I<br/>\ncould not and can not allow myself to be the bad guy.  Later we joined a<br/>\nlocal vegetarian society, actually we just started going to meals, so that<br/>\nwe could learn how to cook a more sustainable diet.  Of course if I didn&#39;t<br/>\nmention a certain person here I would be leaving out an important piece of<br/>\nthe puzzle, my wife&#39;s friend Linda.  In many ways more radical than us, I<br/>\nthink less so in others, she introduced us to much that has shaped our<br/>\nfamily.  Non-violent communication, unending patience, her<br/>\nnon-confrontational way of dealing with situations in many ways still leaves<br/>\nme slack-jawed.  My wife and Linda were like those Asian birds of prey that<br/>\nlock talons and spin toward the earth to see who would let go first, any<br/>\nidea the one had the other would add energy to it and build it stronger.  I<br/>\ndon&#39;t know if you have ever had someone like that in your life but it is<br/>\nrare.  Sadly Linda is no longer in our life, I&#39;m sure I could hazard a<br/>\nreason as to why but without her input it would be lacking.  Anyway here we<br/>\nare on the road traveling and we found that we missed having a positive<br/>\ninfluence and someone to talk with. So, with an intentional communities<br/>\ndirectory in hand www.ic.org we decided to visit communities to see if any<br/>\nof these fit.  Well we have traveled 10000 miles so far and visited almost a<br/>\ndozen communities and none of them are quite right, usually what is wrong<br/>\nrevolves around our children, we are very particular about them and their<br/>\nenvironment.  So, here we are, visiting family for the winter (with<br/>\nsatellite internet) and I said to my wife what if I asked the unschooling<br/>\ninternet community if anyone was willing to set up a community of<br/>\nunschoolers (I&#39;m thinking something loosely like summerhill) and other<br/>\npeople wanting to be more normal in the way they live their lives.  I&#39;m<br/>\nthinking that we don&#39;t have to worry about getting the kids out of school at<br/>\nleast for the most part, and one parent usually is not tied to a job, and<br/>\nbest of all they have open minds.  Well we don&#39;t have land yet so there is<br/>\nno location, and we at least are highly flexible (obviously if we can sell<br/>\neverything and travel full-time with our three children).  I&#39;m personally<br/>\ninterested in a more primitive (aka native) existence, but the beauty of<br/>\ncommunity is that we can be as involved with each other as is comfortable.<br/>\nIf anyone is interested please write us back, if anything I said rings true<br/>\nwith something that you are thinking please write, if anyone is interested<br/>\nin a better life please write back.<br/>\n    The Johnsons<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":89497,"nextTopicId":89588}}