{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: What about mythical beings/lying to children?","postDate":"1352647814","msgId":69609,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGs3b2dhNitsZGQwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDBlMWMwMWNkYmY5YSQ2ZDM2Zjc0MCQ0N2E0ZTVjMCRAY29tY2FzdC5uZXQ+"},"prevInTopic":69606,"nextInTopic":0,"prevInTime":69608,"nextInTime":69610,"topicId":69595,"numMessagesInTopic":0,"msgSnippet":"... Since I don t really have fond recollections of family traditions, I found it helped me to step back from thinking about holidays (including brithdays,","messageBody":"<div id=\"ygrps-yiv-1289602260\">&quot;Robert and Colleen&quot; &lt;3potatoes@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; If I think about Christmas intersecting with unschooling, I don&#39;t think<br/>\n&gt; about &quot;lying to children.&quot;  I think about sharing family traditions <br/>\n<br/>\n </span></blockquote>Since I don&#39;t really have fond recollections of family traditions, I found it helped me to step back from thinking about holidays (including brithdays, &quot;summer holidays&quot; and long weekends) in terms of Tradition and instead touch base with the principles I wanted to express in my life. That has made it much easier for me to see what my kids find wonderful and valuable and intersting about holidays rather than dragging all my own baggage into the mix.<br/>\n<br/>\nAbout three years ago Morgan declared she wanted a christmas tree. No-one else in the family had any desire for one - if anything we all (Ray and George and I) shuddered at the thought for different reasons. Ray and George dislike the annual tree harvest and I had baggage around the family ritual of Decorating The Tree. We agreed to find a small one to put in Mo&#39;s room, since she was so eager for the thing - we all wanted to be kind and gracious to her and found her enthusiasm charming for its own sake. Then she discovered one could buy pink artificial trees at Walmart - I don&#39;t know how... although one of our neighbors may have had one in the yard, he loves tacky outdoor xmas decor. Ironically, we all loved the idea so much we put it in the living room and Mo spent days making paper decorations for it. <br/>\n<br/>\nGeorge reminded me that when Mo was younger we explained Santa as a kind of imaginary friend and so &quot;real&quot; in that sense - real to the individual on some personal level. It was an idea that allowed us both to step past our own Santa baggage and be sweet in whatever way worked for Mo - if she wanted us to play along with her and her imaginary friend, we could be okay with that. <br/>\n<br/>\nNot long ago, after Mo had eaten all the chocolate out of her halloween candy, she asked George to take her out to buy some peanut butter cups for me, since she had no more to share. It was sweet of her. Being sweet to the people we love is an ongoing theme in our family, and I&#39;m glad of it. My life gets to be full of sweetness all year round. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":439465581,"authorName":"Robert and Colleen","from":"&quot;Robert and Colleen&quot; &lt;3potatoes@...&gt;","profile":"trespotatoes","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] Re: What about mythical beings/lying to children?","postDate":"1352589823","msgId":69606,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBlMWMwMWNkYmY5YSQ2ZDM2Zjc0MCQ0N2E0ZTVjMCRAY29tY2FzdC5uZXQ+","inReplyToHeader":"PENBTjhGeEwySFJ6S1loRXJRZ3FoakFTbUZyM2FHKzVkYlRhU0hQOVgyY1Q2TG1SOXEtQUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PHF0bnM2OTk2cmMzZDBzZjlwand3aTZnYS4xMzUyNTYyNjY2NzAxQGVtYWlsLmFuZHJvaWQuY29tPiA8Q0FOOEZ4TDJIUnpLWWhFclFncWhqQVNtRnIzYUcrNWRiVGFTSFA5WDJjVDZMbVI5cS1BQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":69604,"nextInTopic":69609,"prevInTime":69605,"nextInTime":69607,"topicId":69595,"numMessagesInTopic":0,"msgSnippet":"***I guess it s how you look at it and what that can mean for your children. And we do tell them about St. Nick, and about how different cultures celebrate","messageBody":"<div id=\"ygrps-yiv-467254547\">***I guess it&#39;s how you look at it and what that can mean for your children.<br/>\nAnd we do tell them about St. Nick, and about how different cultures<br/>\ncelebrate this time of year.***<br/>\n<br/>\n <br/>\n<br/>\nIf I think about Christmas intersecting with unschooling, I don&#39;t think<br/>\nabout &quot;lying to children.&quot;  I think about sharing family traditions - in our<br/>\ncase, festive meals, doing for others, time with family, secret surprise<br/>\nhomemade presents, Santa filling stockings, etc.  I think about exploring<br/>\nhow other families and other cultures celebrate Christmas - relevant in our<br/>\nparticular family as we blend in foods and traditions from stemming from<br/>\nPoland, Cuba, etc.  I think about how when he was four or five, my son (now<br/>\n9) was rather annoyed :-) when he discovered that the woman I work for is<br/>\nJewish and chooses to celebrate both Hanukkah and Christmas - he immediately<br/>\nwanted to know when we would begin also celebrating both holidays.  We<br/>\ntouched base with her right away, got some suggestions, and added a<br/>\nmini-Hanukkah to our December that year :-)  The next couple years, he<br/>\nwanted only Christmas - then last year Hanukkah resurfaced for him and he<br/>\nwas *delighted* when an elderly non-holiday-celebrating friend broke with<br/>\nher own bah-humbug sort of December, went and got him a couple presents,<br/>\nwrapped them in blue and white Star of David paper, printed a bunch of<br/>\ninformation about Hanukkah from the internet, and invited him over for a day<br/>\nof fun and exploring new traditions.  When it comes to some people we&#39;ve<br/>\nencountered over the years, unschooling (in terms of sharing the joy so<br/>\npresent in learning and in exploring new things) seems to be sort of<br/>\ncontagious :-)<br/>\n<br/>\n <br/>\n<br/>\nMovies are a fun part of unschooling in our family, and we often watch<br/>\nChristmas movies together - movies that, if one is paying attention :-)<br/>\ncan&#39;t help but sneak in the idea that Santa might not *exactly* be just one<br/>\nguy in a red suit who sneaks down chimneys on 12/24 all over the world.<br/>\nArthur Christmas - A Christmas Story - Home Alone - The Santa Clause - Polar<br/>\nExpress - Muppet Christmas Carol - How the Grinch Stole Christmas. we&#39;ve<br/>\nwatched these and tons more, and in just about every one, characters<br/>\nquestion whether Santa is &quot;real&quot; or talk about how Christmas only works &quot;if<br/>\nyou believe.&quot;<br/>\n<br/>\n <br/>\n<br/>\nBeing together and doing things together - also a big part of unschooling in<br/>\nour family.  In that vein, my son has always been welcome at the social<br/>\nservice agency for which I work part-time (and have since before he was<br/>\nborn).  He knows about how people bring in donations of presents and coats<br/>\nand food for children who otherwise wouldn&#39;t have Christmas presents under<br/>\nthe tree or a holiday meal, because he&#39;s seen it firsthand, and has taken<br/>\npart in sorting Toys for Tots presents.  He has met ex-convicts who are also<br/>\nparents, parents who are on work-release, kids who are in foster care or who<br/>\nlive with their families in homeless shelters - all of whom have a different<br/>\nChristmas experience than what happens at our house.  And being around all<br/>\ndifferent people with all different holiday experiences and expectations has<br/>\nprovided plenty of opportunity for questions, conversations, and learning.<br/>\nThat part might not be typical, kids and families and parents of all sorts<br/>\nand situations being right there in all unschooled-kids&#39; lives - but<br/>\ncertainly walking around and seeing the Salvation Army bell-ringers, the<br/>\nToys for Tots donation boxes, etc. would seem to me to provide plenty of<br/>\nconversation starters for those kids who are interested in such ideas as<br/>\n&quot;why doesn&#39;t Santa really bring presents to EVERYONE who believes??&quot;  :-)<br/>\n<br/>\n <br/>\n<br/>\nSo those are just a handful of examples of things we&#39;ve done - everyone&#39;s<br/>\nexamples and priorities will be unique.  But we don&#39;t look at it as a<br/>\nholiday that Has To Be One Way.  We don&#39;t look at it as a Lie.  We look at<br/>\nit as a fun time - an excuse to celebrate, eat good food, and enjoy.  When<br/>\nmy son was 2, we told him some people believe Santa comes on Christmas Eve<br/>\nand brings kids presents.  He said he believed that.  And ever since then,<br/>\nwe&#39;ve referred to it as a belief - not a Fact.  We&#39;ve shared lots of things<br/>\n(as above) that give him the opportunity to question and wonder and think<br/>\nand ponder and develop his own ideas about Santa, holidays, traditions, and<br/>\ncelebrations.  And to me that&#39;s unschooling intersecting Christmas.  What<br/>\ndoes he think?  What does he want to do?  What does he want to believe?<br/>\nWhat is important to others in our family (togetherness, etc.) and how can<br/>\nwe incorporate what we all want to do during what, for many people all over<br/>\nthe world, is a special time of year.<br/>\n<br/>\n <br/>\n<br/>\nColleen <br/>\n<br/>\n <br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":443652592,"authorName":"Stephanie Selby","from":"Stephanie Selby &lt;babelsgp@...&gt;","profile":"babelsgp","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: What about mythical beings/lying to children?","postDate":"1352581654","msgId":69604,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBTjhGeEwySFJ6S1loRXJRZ3FoakFTbUZyM2FHKzVkYlRhU0hQOVgyY1Q2TG1SOXEtQUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PHF0bnM2OTk2cmMzZDBzZjlwand3aTZnYS4xMzUyNTYyNjY2NzAxQGVtYWlsLmFuZHJvaWQuY29tPg==","referencesHeader":"PHF0bnM2OTk2cmMzZDBzZjlwand3aTZnYS4xMzUyNTYyNjY2NzAxQGVtYWlsLmFuZHJvaWQuY29tPg=="},"prevInTopic":69603,"nextInTopic":69606,"prevInTime":69603,"nextInTime":69605,"topicId":69595,"numMessagesInTopic":0,"msgSnippet":"Well I feel out of place! But I believe in Santa. At 19, I secretly hoped he would still visit in my apartment with goods, though I knew it wouldn t really","messageBody":"<div id=\"ygrps-yiv-587881650\">Well I feel out of place! But I believe in Santa. At 19, I secretly hoped<br/>\nhe would still visit in my apartment with goods, though I knew it wouldn&#39;t<br/>\nreally happen. To me, Santa is that feeling you get around Christmastime,<br/>\nthe feeling Christmas inspires in people. We, as a society, try to look out<br/>\nfor one another, we try to be more caring, and we try to give, even those<br/>\ncrazy people in the mall that are stressed out and cranky are there because<br/>\nthey care about someone in their lives. We get together and try to create<br/>\nsomething nice for friends and family. Maybe this started when winter was<br/>\nabout to show it&#39;s face and we all knew it was coming so this was a coming<br/>\ntogether time, maybe it started because the little amount of oil lasted<br/>\njust long enough, maybe it started with Jesus, but it has culminated in our<br/>\nHoliday with a symbolic big jolly red fella. Around that time of year<br/>\nsomething magical happens in our society. He&#39;s a symbol of that feeling and<br/>\nof that time and I feel warm when I see his jolly face. So we celebrate<br/>\nwith him as our spirit of Christmas, reminding us to be kind to one<br/>\nanother. So when our children ask if he is real, well the feeling of<br/>\nChristmas is alive if you are looking for it, and that is real. The time of<br/>\nactively giving and thinking of someone other than yourself, is being<br/>\nsomeone&#39;s Santa. That any of us can be Santa. I know things shouldn&#39;t be<br/>\ndone just once a year, but isn&#39;t it great that our society tries at least<br/>\nonce a year to actively do something, that&#39;s Santa.<br/>\n<br/>\nI guess it&#39;s how you look at it and what that can mean for your children.<br/>\nAnd we do tell them about St. Nick, and about how different cultures<br/>\ncelebrate this time of year.<br/>\nStephanie<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sat, Nov 10, 2012 at 10:51 AM, Julie Batt &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:julie@...\">julie@...</a>&gt; wrote:<br/>\n<br/>\n&gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Because of religious beliefs, I&#39;ve known several people that don&#39;t &quot;do<br/>\n&gt; Santa&quot;, including my parents with my younger sisters. Santa was explained<br/>\n&gt; as something fun to believe in and pretend. What&#39;s funny, is my sisters<br/>\n&gt; wanted so desperately to believe (maybe because of society and friends who<br/>\n&gt; believed), they convinced themselves he was real and believed it for years.<br/>\n&gt;<br/>\n&gt; Friends of mine have talked about the origin of Santa (St. Nick), that he<br/>\n&gt; was a real man once upon a time, with their children.<br/>\n&gt;<br/>\n&gt; I&#39;ve felt similarly that I didn&#39;t want to lie to my children, but my<br/>\n&gt; husband fondly remembers Santa so we indulge. I try to keep things vague,<br/>\n&gt; turning it back to my kids, &quot;he&#39;s real as long as you believe,&quot; kinda like<br/>\n&gt; the polar express movie. My older has asked what happens when you stop<br/>\n&gt; believing and I&#39;ve told him, &quot;then mom and dad bring the presents.&quot; I think<br/>\n&gt; he&#39;s suspected for 3+ years now, but he hasn&#39;t made up his mind yet. He<br/>\n&gt; talks about Disneyland and how he thinks the characters are just people<br/>\n&gt; dressed up. I don&#39;t affirm or deny, but I say, &quot;but it sure is fun to<br/>\n&gt; pretend then?&quot;<br/>\n&gt;<br/>\n&gt; So kinda like the unicorn story, it&#39;s not that Santa *isn&#39;t* real, cuz he<br/>\n&gt; is in her mind as long as she chooses and as long as you keep putting out<br/>\n&gt; those presents in secret.<br/>\n&gt;<br/>\n&gt; Julie Batt<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":77246888,"authorName":"Julie Batt","from":"Julie Batt &lt;julie@...&gt;","profile":"julieannebatt","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: What about mythical beings/lying to children?","postDate":"1352562666","msgId":69603,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PHF0bnM2OTk2cmMzZDBzZjlwand3aTZnYS4xMzUyNTYyNjY2NzAxQGVtYWlsLmFuZHJvaWQuY29tPg=="},"prevInTopic":69598,"nextInTopic":69604,"prevInTime":69602,"nextInTime":69604,"topicId":69595,"numMessagesInTopic":0,"msgSnippet":"Because of religious beliefs, I ve known several people that don t do Santa , including my parents with my younger sisters. Santa was explained as something","messageBody":"<div id=\"ygrps-yiv-1417214631\">Because of religious beliefs, I&#39;ve known several people that don&#39;t &quot;do Santa&quot;, including my parents with my younger sisters. Santa was explained as something fun to believe in and pretend. What&#39;s funny, is my sisters wanted so desperately to believe (maybe because of society and friends who believed), they convinced themselves he was real and believed it for years.<br/>\n<br/>\nFriends of mine have talked about the origin of Santa (St. Nick), that he was a real man once upon a time, with their children.<br/>\n<br/>\nI&#39;ve felt similarly that I didn&#39;t want to lie to my children, but my husband fondly remembers Santa so we indulge. I try to keep things vague, turning it back to my kids, &quot;he&#39;s real as long as you believe,&quot; kinda like the polar express movie. My older has asked what happens when you stop believing and I&#39;ve told him, &quot;then mom and dad bring the presents.&quot; I think he&#39;s suspected for 3+ years now, but he hasn&#39;t made up his mind yet. He talks about Disneyland and how he thinks the characters are just people dressed up. I don&#39;t affirm or deny, but I say, &quot;but it sure is fun to pretend then?&quot;<br/>\n<br/>\nSo kinda like the unicorn story, it&#39;s not that Santa *isn&#39;t* real, cuz he is in her mind as long as she chooses and as long as you keep putting out those presents in secret.<br/>\n<br/>\nJulie Batt</div>","specialLinks":[]},{"userId":528074100,"authorName":"Katharina","from":"&quot;Katharina&quot; &lt;katharina@...&gt;","profile":"katharinakurwig","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: What about mythical beings/lying to children?","postDate":"1352431447","msgId":69598,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGs3aHQwbis1dGh2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PFNOVDEzMy1kczIwOTIzNjQ0QTcxOTBDMjY4MjA4M0VDNDZBMEBwaHguZ2JsPg=="},"prevInTopic":69596,"nextInTopic":69603,"prevInTime":69597,"nextInTime":69599,"topicId":69595,"numMessagesInTopic":0,"msgSnippet":"Hi, My name is Katharina, and I ve been listening and reading on this list for more than a year now. This is my first post, and I d like to apologize upfront","messageBody":"<div id=\"ygrps-yiv-376818043\">Hi, <br/>\nMy name is Katharina, and I&#39;ve been listening and reading on this list for more than a year now. This is my first post, and I&#39;d like to apologize upfront for the fact that my English probably isn&#39;t correct all the time (I&#39;m native German), and that my response might swerve a bit form the topic of &#39;unschooling&#39;. The subject hit a nerve.<br/>\n<br/>\nI agree with Sandra in a way that my experience is that adults seem to have more dramatic feelings around the subject of &quot;the truth about fairies and other mystical beings&quot;, than children do. Like as if adults mostly feel a need to proof that they exist or they don&#39;t in some kind of scientific way. I&#39;d like to share a brief story of my daughter&#39;s take on the subject, because I feel it might help to see a more light hearted approach.<br/>\n<br/>\nMy daughter (8 yrs) was once asked in her preschool (4 yrs old; we started unschooling after her kindergarten year) to choose an animal and do some research to find out what the animal&#39; eats, where it lives and other things. My daughter chose the unicorn and the teachers were very worried about her choice. How would she find out about what a unicorn eats and where it lives, and do a presentation to her class? They didn&#39;t want her to have a negative experience with this project. So they talked to me hoping to get some idea&#39;s on how to resolve the &quot;problem&quot;. I asked them if they had asked my daughter how she intended to do the project. It turned out that they had been so worried that she would find out that there is no unicorn walking around, that they hadn&#39;t even asked her about her ideas. The teachers were convinced that unicorns don&#39;t exist as animals which you can research, and they assumed that my daughter would feel very bad if she was to find out about that truth.<br/>\nThey finally asked her - and her answer to it: &quot;This is very easy. I close my eyes and then I see everything. The unicorn, where it lives and what is eats, it&#39;s friends and other stuff. And then I draw it on paper.&quot;<br/>\nAnd when the boys in her class were teasing and challenging her, saying that there aren&#39;t any unicorns and all of her presentation is nonsense, she responded: &quot; Just because you can&#39;t see them when you close your eyes, doesn&#39;t mean they don&#39;t exist. I see them.&quot;<br/>\n<br/>\nI would ask my kids what they believe about Santa and leave it there, and when their believe changes (and it very likely will), just go with it.<br/>\n<br/>\nBest<br/>\nKatharina<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;CASS KOTRBA&quot; &lt;caskot@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; I am looking for suggestions on the best way to handle Santa, the tooth fairy and the Easter bunny.  I have never wanted to lie to my children but I feel like I&#39;ve been forced into this lie by my society and now I don&#39;t know how to get out of it.  Initially I tried to take a light hearted approach to the subject and let on to the children that it was a game we were playing but my daughter (now 10) is in love with the idea that these beings really exist, love her and bring her gifts.  She says things like &quot;Some people don&#39;t believe in Santa but I do.  He&#39;s real, right mommy?&quot;.  I&#39;ve tried saying &quot;What do you think?&quot; and she 100% thinks it&#39;s true and seems to want very much to continue believing it.  My son ,8, is very quiet on the subject and I really don&#39;t know what he thinks but I haven&#39;t pursued it with him because I don&#39;t know what to say.  When I was a kid my brother and I found a Santa suit hanging in a closet at my grandma&#39;s house and questioned my mom, who confessed.  I remember being heart broken, feeling betrayed and wondering what else they were lying to me about.  I don&#39;t want my kids to have that type of experience and it is important to me to be honest with them but in the past I have felt like telling them would deprive them of their fun.  I&#39;m thinking I should start breaking it to them gently but am unsure how to proceed.  I really don&#39;t know how to handle the situation and would appreciate other peoples thoughts.<br/>\n&gt; <br/>\n&gt; Thanks for your help!<br/>\n&gt; Cass<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: [AlwaysLearning] What about mythical beings/lying to children?","postDate":"1352310978","msgId":69596,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU0QkYyQ0E0LThDOTAtNEQ0MC05MkZBLUZDRjM3MTRGQkIxNkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PFNOVDEzMy1kczIwOTIzNjQ0QTcxOTBDMjY4MjA4M0VDNDZBMEBwaHguZ2JsPg==","referencesHeader":"PFNOVDEzMy1kczIwOTIzNjQ0QTcxOTBDMjY4MjA4M0VDNDZBMEBwaHguZ2JsPg=="},"prevInTopic":69595,"nextInTopic":69598,"prevInTime":69595,"nextInTime":69597,"topicId":69595,"numMessagesInTopic":0,"msgSnippet":"What I m going to point out from your questions is the way you ve couched it as a great struggle with winners and losers. -=-I am looking for suggestions on","messageBody":"<div id=\"ygrps-yiv-740143100\">What I&#39;m going to point out from your questions is the way you&#39;ve couched it as a great struggle with winners and losers.<br/>\n<br/>\n-=-I am looking for suggestions on the best way to handle Santa, the tooth fairy and the Easter bunny.-=-<br/>\n<br/>\n&quot;To handle&quot; Santa?  They&#39;re not real people.   I know it&#39;s a normal everyday expression, but it ounds there as though there&#39;s a struggle between you and this small army of &quot;mythical beings.&quot;  <br/>\n<br/>\n-=-I feel like I&#39;ve been forced into this lie by my society -=-<br/>\n<br/>\nThis is very dramatic.  It might not seem that way to you.  If not, it may be because you&#39;re used to thinking of things in harsh, dramatic ways in which you are a powerless victim.<br/>\n<br/>\n-=-...and questioned my mom, who confessed. I remember being heart broken, feeling betrayed and wondering what else they were lying to me about.-=-<br/>\n<br/>\nIt might be a personality trait of yours to feeel huge emotion about things, or to see yourself as forced and betrayed.  <br/>\n<br/>\nSo before you consider any of the ideas people might bring to you or link here for you to read, this is important:<br/>\n<br/>\nReposition yourself, on the battlefield you have created in your mind, in this way:  You are your child&#39;s partner.  You&#39;re doing things together.  You&#39;re helping her have a nice life.  Nobody is forcing you to betray her or break her heart.  It&#39;s not that life-or-death a deal.<br/>\n<br/>\nWhen she says &quot;Santa is real, right?&quot;  you could say &quot;there are guys dressed like Santa in malls.  They&#39;re acting.  There are people pretending to be Santa in movies.  That&#39;s not the real Santa.&quot;  <br/>\n<br/>\nYou could give her information that is true and helpful to help her figure it out.  <br/>\n<br/>\nWhat I told my kids was &quot;I never saw Santa, but what I do know is then I put a stocking out at night, there were toys and candy in the morning, so I think you ought to put a stocking up.&quot;<br/>\n<br/>\nSay what IS true.  You don&#39;t need to embroider or explain how he will get down a chimney or through a locked door.  You could say &quot;Who knows?&quot;  Or &quot;It&#39;s something that just happens differently different places.&quot;  <br/>\n<br/>\nBut be calmer within your own soul.  Don&#39;t feel helpless and forced.  And don&#39;t tell us you don&#39;t feel helpless and forced because noone pressed you to write to us, and you chose your own words.  You might deny the feeling, but your word choices do show something of your feelings.  <br/>\n<br/>\nThese will help:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/choices\">http://sandradodd.com/choices</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/negativity\">http://sandradodd.com/negativity</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/phrases\">http://sandradodd.com/phrases</a><br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":443923164,"authorName":"CASS KOTRBA","from":"&quot;CASS KOTRBA&quot; &lt;caskot@...&gt;","profile":"cass.kotrba","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"What about mythical beings/lying to children?","postDate":"1352306476","msgId":69595,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFNOVDEzMy1kczIwOTIzNjQ0QTcxOTBDMjY4MjA4M0VDNDZBMEBwaHguZ2JsPg=="},"prevInTopic":0,"nextInTopic":69596,"prevInTime":69594,"nextInTime":69596,"topicId":69595,"numMessagesInTopic":0,"msgSnippet":"I am looking for suggestions on the best way to handle Santa, the tooth fairy and the Easter bunny.  I have never wanted to lie to my children but I feel like","messageBody":"<div id=\"ygrps-yiv-1678006669\">I am looking for suggestions on the best way to handle Santa, the tooth fairy and the Easter bunny.  I have never wanted to lie to my children but I feel like I&#39;ve been forced into this lie by my society and now I don&#39;t know how to get out of it.  Initially I tried to take a light hearted approach to the subject and let on to the children that it was a game we were playing but my daughter (now 10) is in love with the idea that these beings really exist, love her and bring her gifts.  She says things like &quot;Some people don&#39;t believe in Santa but I do.  He&#39;s real, right mommy?&quot;.  I&#39;ve tried saying &quot;What do you think?&quot; and she 100% thinks it&#39;s true and seems to want very much to continue believing it.  My son ,8, is very quiet on the subject and I really don&#39;t know what he thinks but I haven&#39;t pursued it with him because I don&#39;t know what to say.  When I was a kid my brother and I found a Santa suit hanging in a closet at my grandma&#39;s house and questioned my mom, who confessed.  I remember being heart broken, feeling betrayed and wondering what else they were lying to me about.  I don&#39;t want my kids to have that type of experience and it is important to me to be honest with them but in the past I have felt like telling them would deprive them of their fun.  I&#39;m thinking I should start breaking it to them gently but am unsure how to proceed.  I really don&#39;t know how to handle the situation and would appreciate other peoples thoughts.<br/>\n<br/>\nThanks for your help!<br/>\nCass<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":69597,"nextTopicId":69599}}