{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":123172440,"authorName":"Julia","from":"&quot;Julia&quot; &lt;julia55413@...&gt;","profile":"julia55413","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"OT: Parenting Conference in Minneapolis","postDate":"1081392934","msgId":92513,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM1MmV2NithbnJpQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":92512,"nextInTime":92514,"topicId":92513,"numMessagesInTopic":0,"msgSnippet":"Hi, I mostly lurk on this list, but I wanted to let you all know about a conference for parents that is taking place in downtown Minneapolis this summer.  July","messageBody":"<div id=\"ygrps-yiv-580066219\">Hi,<br/>\n<br/>\nI mostly lurk on this list, but I wanted to let you all know about a <br/>\nconference for parents that is taking place in downtown Minneapolis <br/>\nthis summer.  July 16-18 are the dates and lots more info can be <br/>\nfound at the web-site www.mamagathering.org. There will be lots of <br/>\nunschoolers there and we are hoping for more! Please check it out and <br/>\nforward freely.  Thanks!<br/>\n<br/>\nmama gathering is back in 2004 to pack another mean mama punch of the <br/>\ntastiest, sexiest, most defiant fun around. it&#39;s the only time of <br/>\nyear when you can kick it with your mama homegirls from all over the <br/>\nglobe, and this july it will touch down in minneapolis, minnesota, <br/>\nwhere rest assured it is only cold in the winter. so bring your <br/>\nshades, spaghetti straps, sandals, and something to show off those <br/>\nfab stretch marks, cuz this is gonna be one hot scene.<br/>\n<br/>\nby day, get empowered at some of the smartest, edgiest workshops <br/>\naround. from parenting topics to social justice issues to artist&#39;s <br/>\nofferings, there&#39;s bound to be something for everymama. this time is <br/>\nyours to learn, teach, network, and reinforce that the hand that <br/>\nrawks the cradle truly does rule the world. and while you exchange <br/>\nwisdom and experiences with your mama cohorts, turn your kiddos loose <br/>\nto take part in supervised kid activities and workshops, broken down <br/>\nby age for the best fit available. all workshops and kidshops will be <br/>\nheld at the quality inn hotel in downtown minneapolis, where a block <br/>\nof rooms will be mama gathering&#39;s home base.<br/>\n<br/>\nby night, venture out into the city for some luscious night life. <br/>\nboth friday and saturday evenings will feature off site shindigs <br/>\naccessable by shuttle. whether you wanna kick back or kick it up a <br/>\nnotch, the gathering&#39;s unique, kid-approved venues, gourmet grub and <br/>\nstage shows will inspire you to mix it up and boogie down. and where <br/>\nyou take it from there...well, that&#39;s entirely up to you.<br/>\n<br/>\nso, come one, come all to the biggest, baddest, most subversive <br/>\nparenting conference and party of the year! whether you&#39;re pierced or <br/>\npinstriped, geeky or glam, a teenage mom or mom of teenagers, whether <br/>\nyou drive a beemer, drive a junker, or drive yourself nuts trying to <br/>\nget your stroller on the bus, whether you breastfed, formula fed, or <br/>\nwere so sleep deprived you don&#39;t remember, this is your gathering, <br/>\nmama.<br/>\n<br/>\nwe&#39;ll see you there.</div>","specialLinks":[]}],"prevTopicId":92495,"nextTopicId":92514}}