{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":11,"messages":[{"userId":1941157,"authorName":"Natrlmama@aol.com","from":"Natrlmama@...","profile":"natrlmama","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Activities Question","postDate":"1013283532","msgId":4536,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ0LjFhY2E4NmJmLjI5OTZkNGNjQGFvbC5jb20+"},"prevInTopic":4526,"nextInTopic":0,"prevInTime":4535,"nextInTime":4537,"topicId":4431,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/7/02 11:58:25 PM Pacific Standard Time, Katguts@hotmail.com writes: ","messageBody":"<div id=\"ygrps-yiv-375226515\">In a message dated 2/7/02 11:58:25 PM Pacific Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Katguts@...\">Katguts@...</a> writes:<br/>\n<br/>\n&lt;&lt; Then you hear about think &#39;window&#39; of time for people who go on to be <br/>\ngreat and how their paren&#39;t always started then at 2,3, or 4.  (Ok the <br/>\nOlymipc thing is getting me I guess).  :)  It&#39;s just too easy to second guess <br/>\nall of this.<br/>\n <br/>\n What is you guys&#39; take on it?  Are they better off figuring it out on their <br/>\nown?  She&#39;s sort of at an age where she would happily do anything but if I <br/>\ntry to interfere by &#39;helping&#39; she becomes immidiatly helpless and &#39;forgets&#39; <br/>\nhow to do it.  Like drawing.  If I try to draw too at the same time as her <br/>\n(different paper and everything) then she won&#39;t draw anymore and only wants <br/>\nme to draw for her.  I&#39;d love to know if anyone else has struggled with this <br/>\nand what happened there. &gt;&gt;<br/>\n<br/>\nI just dig in my heels when I think about little kids doing classes.  I know, <br/>\nI know<br/>\nsome folks, their kids just love it (and that is usually they very social <br/>\nones--of<br/>\nwhich I have two social children) and thats for them to decide, but I am <br/>\nreally<br/>\nfor keeping my little people at home and activity/class level low.  My kids<br/>\nride motorcycles and dh would have let them race a couple of years ago<br/>\nat 5 & 6.  Other parents do.  The kids aren&#39;t beggig, or even asking to do it<br/>\nThey ride now for fun, on trail rides<br/>\nor on our neighbors motocross field he made.  No pressure.  And they<br/>\nlove it.   I have a dh who thinks they should be racing now if they want a<br/>\nmotocross career (two of mine might I can see that, they are good) but<br/>\nhe doesn&#39;t push and really respects me on this.  My feeling is if they<br/>\nwait another year, two or four &lt;g&gt; they won&#39;t be behind because they<br/>\nhave still been riding all this time.  So anyhow I don&#39;t think its necessary<br/>\nfor kids to do classes at 2, 3, 4.  In fact my 4 yr old wanted to play soccer<br/>\nwith a hs class we had and the coach let him and he was developmentally<br/>\ntoo young to do this much constant running (he is active, he is just 4),<br/>\nso that would be my other concern of classes for preschool age from my<br/>\nexperiences.<br/>\n<br/>\nKathy</div>","specialLinks":[]},{"userId":1339984,"authorName":"Dan Vilter","from":"Dan Vilter &lt;dvilter@...&gt;","profile":"dvilter","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Activities Question","postDate":"1013277647","msgId":4526,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI4OEFBM0NELjc4QUYlZHZpbHRlckBtYWMuY29tPg==","inReplyToHeader":"PE9FNjJBcGFjelNsb2VYaGswSjcwMDAxMjFjYkBob3RtYWlsLmNvbT4="},"prevInTopic":4509,"nextInTopic":4536,"prevInTime":4525,"nextInTime":4527,"topicId":4431,"numMessagesInTopic":0,"msgSnippet":"... NOOooooooooooooooooooooo!!! I m sorry. Rational Thought... [Climbing onto my soap box] This is a hot button for me. I work at a performing arts center. A","messageBody":"<div id=\"ygrps-yiv-1818325804\">on 2/7/02 11:50 PM, Katrina Gutleben at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Katguts@...\">Katguts@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So my sister says as we are walking off &quot;We need to get her in Sunshine<br/>\n&gt; Generation (a kids dancing and singing group).&quot;  I guess it hit me deeper than<br/>\n&gt; I initially realized because I come home and I&#39;m thinking does she need to be<br/>\n&gt; in some kind of class like that??  The thing is she would love it.<br/>\n<br/>\n<br/>\n </span></blockquote>NOOooooooooooooooooooooo!!!<br/>\n<br/>\nI&#39;m sorry.<br/>\nRational Thought...<br/>\n<br/>\n[Climbing onto my soap box]<br/>\n<br/>\nThis is a hot button for me.<br/>\n<br/>\nI work at a performing arts center. A place where dance schools have<br/>\nperformances to show case their student&#39;s work. There are currently about 8<br/>\nschools that use our facility and I can&#39;t think of a one that has the<br/>\nchild&#39;s interest as it&#39;s primary focus. Some are better than others. In one<br/>\nform or another all of them use shame, humiliation, and, massive amounts of<br/>\ncoercion to put their shows together to sell to the student&#39;s friends and<br/>\nfamilies. I see hours and hours of kids waiting to appear on stage, sitting<br/>\non the floor in the hallway being hassled for taking or playing or even<br/>\ndrawing while passing the time. &quot;Homework&quot; is often the only acceptable<br/>\nactivity.  On stage they are often herded to place and screamed at for the<br/>\nslightest misstep. I have seen 4 year olds humiliated for asking to go to<br/>\nthe restroom. And I have seen kids so scared they have peed their pants, on<br/>\nstage, and then berated in front of everyone present for doing so.<br/>\nThese concerts are a major money making endeavor for many of the schools.<br/>\nAfter paying for the classes, parents (and friends) must pay as much as $50<br/>\na ticket, inflated prices for costumes and props that the schools provide.<br/>\nThen the fees for the party, the class picture, the performance picture,<br/>\netc, etc, etc.  From my view it is a racket.<br/>\n<br/>\nOne of my best friends is a producer, director, and owns his own production<br/>\nand costume company. He knows dozens of choreographers and hundreds of<br/>\ndancers. It took him months of searching to find an appropriate school for<br/>\nhis 6 year old to attend. One that was [relatively] non coercive, where<br/>\nperformance was optional, where parents could be in the room during classes<br/>\nand where the instructor cared about each student including the slow<br/>\ngraceless ones. I know that there must be many good dance schools out there.<br/>\nBut I was dumbfounded that a person with that much inside knowledge, who was<br/>\nwilling to drive 20 miles in any direction, encompassing millions of people<br/>\nin Southern California had such a difficult time finding one.<br/>\n<br/>\nIf your daughter is singing and dancing on her own, why do you think she<br/>\nneeds a class? If you are worried about her learning the &#39;proper&#39; way of<br/>\ndancing isn&#39;t there plenty of time to learn when *she* thinks it is<br/>\nimportant? Have you ever read the biographies of great dancers? Did you see<br/>\nhow much time, how much of their lives, they had to give up to become great?<br/>\nWhenever I see a great performance by a young person I get a pang of guilt<br/>\nknowing that they have traded (usually through coercion and guilt) some<br/>\nessential part of their childhood for that *great* performance that I am<br/>\nenjoying.<br/>\n<br/>\nI love Dance. I know of no better kinetic expression of what it is to be<br/>\nhuman than Dance. The moments of human Truth I have experienced while<br/>\nwatching a Ballet or an introspective modern dance work cannot be perceived<br/>\nany other way. But lets not mix the difference of participating in the art<br/>\nform as an audience member and as a performer. If you have ever been<br/>\nbackstage during a performance and seen the evolved preparation, the<br/>\nexertion and pain required to give those seemingly effortless moves life,<br/>\nthe agony in the faces as theses artists come into the wings and the despair<br/>\nof a person who&#39;s career has been ended by a seemingly minor injury, You<br/>\nmight wonder why anyone does it. I do.<br/>\n<br/>\nI don&#39;t want to be a damper on something I love so much. But so much of path<br/>\nto those magical, Truthful moments in the performance of Dance goes against<br/>\nthe unschooling lifestyle that my family enjoys.<br/>\n<br/>\nIn contrast, one of the best performances I have *ever* been a part of in<br/>\nthe 30 years I have been involved in entertainment, is the Talent Show at<br/>\nthe Homeschool Association of California conference this past August. Pam<br/>\ngot Jocelyn and I to supply the lighting and sound for the event and the<br/>\nthree of us acted as stage managers facilitating the flow of the evening.<br/>\nAnyone at the conference who *wanted to* signed up for their minutes of fame<br/>\nand presented whatever they cared to.  This included dancing and singing and<br/>\njugging, skateboarding, and free form improvisational poetry. There was a<br/>\nhistory talk given from the heart of a history lover. Sandra played a<br/>\nrecorder duet with herself on tape. There were three young people that<br/>\nserved as Masters of Ceremony.  I thoroughly enjoyed it, even from the<br/>\nwings. What made it so worthwhile for me was that the performances came from<br/>\nwithin each of the performers. *Roxana don&#39;t read this next part* You could<br/>\nhave floated me down the American river I was so buoyant with pride as Pam&#39;s<br/>\nkids, who I consider good personal friends of mine, performed for their<br/>\nhearts. *OK Roxana* Later Sandra said of all the performers of the evening,<br/>\nthat they *had* to perform. That no one made them perform but that there was<br/>\nsomething in them that led them to the stage. That performing was better<br/>\nthen not performing.  I saw no coercion or humiliation, no agony as they<br/>\nleft the stage.  This performance is closer, by far, to the hopes and dreams<br/>\nthat I have while I am perusing my AlwaysLeaning life than usual<br/>\nprofessional work I do in entertainment.<br/>\n<br/>\n-Dan Vilter<br/>\n[Stepping down from his soap box]</div>","specialLinks":[]},{"userId":1509055,"authorName":"Tia Leschke","from":"Tia Leschke &lt;leschke@...&gt;","profile":"leschke2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Activities Question","postDate":"1013228840","msgId":4509,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUuMC4yLjEuMC4yMDAyMDIwODIwMTkxNS4wMjkyNTU5MEBsb2NhbGhvc3Q+","inReplyToHeader":"PE9FNjJBcGFjelNsb2VYaGswSjcwMDAxMjFjYkBob3RtYWlsLmNvbT4="},"prevInTopic":4497,"nextInTopic":4526,"prevInTime":4508,"nextInTime":4510,"topicId":4431,"numMessagesInTopic":0,"msgSnippet":"... I think that if she would love a class situation because she s so social, then eventually you re going to have to let her take some classes.  If you don t,","messageBody":"<div id=\"ygrps-yiv-1775965328\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt;<br/>\n&gt;I guess the way I see it is that she is developing quite nicely on her own <br/>\n&gt;(thank you very much) and no she may not be learning the &#39;proper&#39; ways of <br/>\n&gt;doing it but she&#39;s having a ball.  Then you hear about think &#39;window&#39; of <br/>\n&gt;time for people who go on to be great and how their paren&#39;t always started <br/>\n&gt;then at 2,3, or 4.  (Ok the Olymipc thing is getting me I <br/>\n&gt;guess).  :)  It&#39;s just too easy to second guess all of this.<br/>\n<br/>\n </span></blockquote>I think that if she would love a class situation because she&#39;s so social, <br/>\nthen eventually you&#39;re going to have to let her take some classes.  If you <br/>\ndon&#39;t, she&#39;ll probably agitate to go to school, like my granddaughter <br/>\ndid.  That said, there&#39;s no reason to put her into one now.  There&#39;s plenty <br/>\nof time, once she actually expresses a desire for classes.<br/>\n<br/>\nAnd about that window of opportunity thing...  In the first place, it only <br/>\napplies in the case of someone wanting to go to the Olympics or perform <br/>\nprofessionally, and not necessarily even then.  The conductor of one of the <br/>\norchestras I play in didn&#39;t start playing the violin until he was 10.  He <br/>\nwent on to be concertmaster of some pretty high class symphony orchestras, <br/>\nas well as founding first violinist of the Purcell Quartet, before moving <br/>\nto conducting after a shoulder injury.  An unschooled young man I know <br/>\nstarted piano at about age 9 and added violin a couple of years <br/>\nlater.  He&#39;s now, at 18, welcome in the best amateur orchestras in town, <br/>\nbut he isn&#39;t home often enough.  He&#39;s busy touring with his band.  He plays <br/>\nfiddle, keyboard, and accordian.<br/>\nTia<br/>\n<br/>\nNo one can make you feel inferior without your consent.<br/>\nEleanor Roosevelt<br/>\n*********************************************<br/>\nTia Leschke<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:leschke@...\">leschke@...</a><br/>\nOn Vancouver Island</div>","specialLinks":[]},{"userId":69247285,"authorName":"Sharon Rudd","from":"Sharon Rudd &lt;bearspawprint@...&gt;","profile":"bearspawprint","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Activities Question","postDate":"1013216052","msgId":4497,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIwMjA5MDA1NDEyLjcxODcxLnFtYWlsQHdlYjE0MzA0Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDc0LjE3YjdhYzdkLjI5OTU1YjczQGFvbC5jb20+"},"prevInTopic":4481,"nextInTopic":4509,"prevInTime":4496,"nextInTime":4498,"topicId":4431,"numMessagesInTopic":0,"msgSnippet":"If I had a daughter I would want to arrange a match. Sharon of the Swamp ... __________________________________________________ Do You Yahoo!? Send FREE","messageBody":"<div id=\"ygrps-yiv-1043667412\">If I had a daughter I would want to arrange a match.<br/>\n<br/>\nSharon of the Swamp<br/>\n....................................<br/>\n--- <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:conniecolten@...\">conniecolten@...</a> wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Hi,<br/>\n&gt; <br/>\n&gt; I am new to this list, and wanted to add my 2 cents<br/>\n&gt; to this question.  My <br/>\n&gt; son, Shawn (aged 27), who learned at home except for<br/>\n&gt; kindergarten and then <br/>\n&gt; college, is a performer.  He was a skateboarder from<br/>\n&gt; ages 8-14.  When an <br/>\n&gt; injury sidelined him he taught himself to juggle,<br/>\n&gt; and took that to a <br/>\n&gt; performing stage when he discovered gymnastics.  He<br/>\n&gt; was way too old to be <br/>\n&gt; starting(about 19), but loved it, and is still<br/>\n&gt; teaching it as one of his <br/>\n&gt; part-time jobs while he is in school.<br/>\n&gt; <br/>\n&gt; That took him into diving (springboard, and tower),<br/>\n&gt; which he is doing at <br/>\n&gt; college in PA right now.  He will go to Nationals<br/>\n&gt; soon, and we&#39;ll see how he <br/>\n&gt; does.  In the meantime he has done a little<br/>\n&gt; stuntwork in TV stuff, and had a <br/>\n&gt; small part in an African movie, plus modeled.  He<br/>\n&gt; went to jr. college here in <br/>\n&gt; CA, and now is majoring in acting while on the dive<br/>\n&gt; team in PA.  <br/>\n&gt; <br/>\n&gt; He got to PA because he was in a dive show at 6<br/>\n&gt; Flags in Houston, and met a <br/>\n&gt; dive coach that knew a coach etc.<br/>\n&gt; <br/>\n&gt; Did he ever take classes?  NO-- not until he was old<br/>\n&gt; enough to drive himself, <br/>\n&gt; and pay for them thro exchange work.  Maybe I was a<br/>\n&gt; lazy mom or maybe they <br/>\n&gt; don&#39;t need to start &quot;classes&quot; but can work at<br/>\n&gt; learning at their own pace.<br/>\n&gt; <br/>\n&gt; For instance - he learned the juggling with books<br/>\n&gt; and video, and then <br/>\n&gt; regularly went to Balboa Park to join a group that<br/>\n&gt; did street performing to <br/>\n&gt; practice and learn with them.<br/>\n&gt; <br/>\n&gt; I think he retained his natural enthusiam by not<br/>\n&gt; &quot;having&quot; to do anything.  He <br/>\n&gt; could make the choices by being older and being in<br/>\n&gt; control.<br/>\n&gt; <br/>\n&gt; Connie Colten<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been<br/>\n&gt; removed]<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n<br/>\n </span></blockquote>__________________________________________________<br/>\nDo You Yahoo!?<br/>\nSend FREE Valentine eCards with Yahoo! Greetings!<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://greetings.yahoo.com\">http://greetings.yahoo.com</a></div>","specialLinks":[]},{"userId":63839307,"authorName":"Janet","from":"&quot;Janet&quot; &lt;jefhdvm@...&gt;","profile":"jefhdvm","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Activities Question","postDate":"1013200693","msgId":4481,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNGQwMWMxYjBlMiQ4NDAxMjZkMCQwMTAwYThjMEB1cHN0YWlycz4=","referencesHeader":"PDEwMTMxODUxODUuMjIyMi45MzM1Ni5tMkB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":4465,"nextInTopic":4497,"prevInTime":4480,"nextInTime":4482,"topicId":4431,"numMessagesInTopic":0,"msgSnippet":"... rigid and wants all the kids, even the little ones to do as their told, I think that wouldn t be any fun and would even spoil her love of performing.  ","messageBody":"<div id=\"ygrps-yiv-1089131056\"><blockquote><span title=\"ireply\">&gt;&gt;I think  it would really depend on the class.  If the dance teacher is<br/>\n </span></blockquote>rigid and wants all the kids, even the little ones to do as their told, I<br/>\nthink that wouldn&#39;t be any fun and would even spoil her love of<br/>\nperforming.  &lt;&lt;<br/>\n<br/>\nThis is so very true!  My ds, age 3 1/2, is very introverted, but he likes<br/>\nto get out there and do stuff.  There is a place here that offers a<br/>\nhomeschool gymnastics class:   ~36 kids divided into 4 groups by age.<br/>\nBefore I signed the kids up, I asked ds if he wanted to go.  He said yes, he<br/>\nwas very excited.  The first class, he ran right in with his sister.  They<br/>\nhave a circle time warm up, all the kids together for about 15 minutes, then<br/>\nthey split up.  He was a bit overwhelmed by all of the kids and just kind of<br/>\nwatched.   After the groups split, he had a blast.  Problem was, that there<br/>\nwasn&#39;t enough order and the other kids were pushing past my ds to get a turn<br/>\non the equipment (balance beams to walk on, mats to roll on, things to climb<br/>\nup and over, slide down, hang from, etc).  My ds isn&#39;t the kind to say<br/>\nanything, though I could tell he was getting upset.  After the class, we<br/>\ntalked about it, and he was OK.  Next class, same thing, but he did stick up<br/>\nfor himself more and take his turns.  Then, apparently the teacher realized<br/>\nshe needed more control, and now she has the kids line up in a certain<br/>\norder, they can&#39;t have a turn until it&#39;s their turn, they must sit still and<br/>\nwait......too far the other way, esp. for 3 & 4 yr olds.  Now ds doesn&#39;t<br/>\nwant to go.  He does want to go play on the equipment, but he doesn&#39;t want<br/>\nall of the structure.  I have been talking with him, and the past couple of<br/>\nclasses he participated about half the time, then came out and joined me.<br/>\n<br/>\nNow, the teacher is after me to just &quot;hand him over&quot; at the beginning of the<br/>\nclass, let him cry for his &quot;30 seconds&quot; (her terms) and he&#39;ll be fine.  On<br/>\nthe contrary, ds does not take well to others &quot;controlling&quot; him without<br/>\nregard to his feelings (he has enough stuff in his life he can&#39;t control<br/>\nalready that he has to deal with) and she&#39;s concerned that &quot;the other kids<br/>\nhave been told that their moms can&#39;t stay with them, so they wonder why T&#39;s<br/>\ncan&quot; (apparently the other moms agreed to this).  So, here we are, with 3<br/>\nclasses left.  I have been talking with T and he&#39;s pretty sure he doesn&#39;t<br/>\nwant to go anymore.  That&#39;s fine with me (though he&#39;ll be dressed<br/>\nappropriately in case he changes his mind, which he&#39;s prone to do :)<br/>\n<br/>\nOn the other hand, dd, age 7, could stay and play all day.  She has trouble<br/>\nfollowing directions (always has) but doesn&#39;t seem to mind being corrected<br/>\nwhen she gets out of hand (carried away, too much enthusiasm, overactive).<br/>\n<br/>\nOur experience with classes and the younger set.<br/>\n<br/>\nJanet, mom to Caroline, 7, and Thomas, 3 1/2<br/>\nSponsor me in the Suzuki Rock & Roll Marathon as I raise money for the<br/>\nLeukemia & Lymphoma Society.  I&#39;ll be running in honor of my 3 yr old son,<br/>\nThomas, who was diagnosed with leukemia in Oct. 2000. E-mail me<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jefhdvm@...\">jefhdvm@...</a> for details!</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Activities Question","postDate":"1013187658","msgId":4465,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdkLjIxZjQ0YTU0LjI5OTU1ZTRhQGFvbC5jb20+"},"prevInTopic":4462,"nextInTopic":4481,"prevInTime":4464,"nextInTime":4466,"topicId":4431,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/8/02 9:50:18 AM, conniecolten@aol.com writes: ","messageBody":"<div id=\"ygrps-yiv-1357739067\">In a message dated 2/8/02 9:50:18 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:conniecolten@...\">conniecolten@...</a> writes:<br/>\n<br/>\n&lt;&lt; I think he retained his natural enthusiam by not &quot;having&quot; to do anything.  <br/>\nHe <br/>\ncould make the choices by being older and being in control. &gt;&gt;<br/>\n<br/>\nThere&#39;s a homeschooled family of five kids here who are professional <br/>\nperformers.  Until the oldest was about 14 and the youngest five or six, <br/>\nthey&#39;d  never done anything but sing songs together.  But one song needed a <br/>\ntrick knife for a stabbing (they were acting out the ballad of The Twa <br/>\nSisters), and they rigged up a SCARY looking, metal, retractable blade (with <br/>\nrubber bands inside a tube--I held it before and after, and to have held it <br/>\nand THEN see them stab their skinny sister with it was truly scary.<br/>\n<br/>\nThe oldest is 24 now.  They have a magic show, VERY original juggling, are <br/>\nadding aeriel kind of stuff, there&#39;s comedy, music, it is SO COOL.  They&#39;re <br/>\ncalled The Clan Tynker (&quot;the Tynkers&quot;) and you&#39;ll all probably see them on TV <br/>\nsomeday.  They did meet a guy, after they were getting this all together, who <br/>\ntaught them some theatricals.  And the oldest boy worked in a magic shop for <br/>\na while.  But most of the tricks and ALL the equipment they&#39;ve made <br/>\nthemselves.  Even the bars they use for the flips, the whole rig with its guy <br/>\nropes and all was home made.  <br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":10590565,"authorName":"conniecolten@aol.com","from":"conniecolten@...","profile":"conniecolten","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Activities Question","postDate":"1013186931","msgId":4462,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc0LjE3YjdhYzdkLjI5OTU1YjczQGFvbC5jb20+"},"prevInTopic":4451,"nextInTopic":4465,"prevInTime":4461,"nextInTime":4463,"topicId":4431,"numMessagesInTopic":0,"msgSnippet":"Hi, I am new to this list, and wanted to add my 2 cents to this question.  My son, Shawn (aged 27), who learned at home except for kindergarten and then ","messageBody":"<div id=\"ygrps-yiv-936303646\">Hi,<br/>\n<br/>\nI am new to this list, and wanted to add my 2 cents to this question.  My <br/>\nson, Shawn (aged 27), who learned at home except for kindergarten and then <br/>\ncollege, is a performer.  He was a skateboarder from ages 8-14.  When an <br/>\ninjury sidelined him he taught himself to juggle, and took that to a <br/>\nperforming stage when he discovered gymnastics.  He was way too old to be <br/>\nstarting(about 19), but loved it, and is still teaching it as one of his <br/>\npart-time jobs while he is in school.<br/>\n<br/>\nThat took him into diving (springboard, and tower), which he is doing at <br/>\ncollege in PA right now.  He will go to Nationals soon, and we&#39;ll see how he <br/>\ndoes.  In the meantime he has done a little stuntwork in TV stuff, and had a <br/>\nsmall part in an African movie, plus modeled.  He went to jr. college here in <br/>\nCA, and now is majoring in acting while on the dive team in PA.  <br/>\n<br/>\nHe got to PA because he was in a dive show at 6 Flags in Houston, and met a <br/>\ndive coach that knew a coach etc.<br/>\n<br/>\nDid he ever take classes?  NO-- not until he was old enough to drive himself, <br/>\nand pay for them thro exchange work.  Maybe I was a lazy mom or maybe they <br/>\ndon&#39;t need to start &quot;classes&quot; but can work at learning at their own pace.<br/>\n<br/>\nFor instance - he learned the juggling with books and video, and then <br/>\nregularly went to Balboa Park to join a group that did street performing to <br/>\npractice and learn with them.<br/>\n<br/>\nI think he retained his natural enthusiam by not &quot;having&quot; to do anything.  He <br/>\ncould make the choices by being older and being in control.<br/>\n<br/>\nConnie Colten<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":74604204,"authorName":"ddzimlew@juno.com","from":"ddzimlew@...","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Activities Question","postDate":"1013183939","msgId":4451,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIwMjA4LjA4NTkwNi4tMzA3NzkuMi5kZHppbWxld0BqdW5vLmNvbT4="},"prevInTopic":4434,"nextInTopic":4462,"prevInTime":4450,"nextInTime":4452,"topicId":4431,"numMessagesInTopic":0,"msgSnippet":"I think  it would really depend on the class.  If the dance teacher is rigid and wants all the kids, even the little ones to do as their told, I think that","messageBody":"<div id=\"ygrps-yiv-822837653\">I think  it would really depend on the class.  If the dance teacher is<br/>\nrigid and wants all the kids, even the little ones to do as their told, I<br/>\nthink that wouldn&#39;t be any fun and would even spoil her love of<br/>\nperforming.    Performing for your little kid is all about imagination<br/>\nand an instructor will want to introduce all the other stuff.  Will your<br/>\ndaughter really like waiting for her turn to sing?  Dancing just the way<br/>\nsomeone else says?    If you really wonder, go and visit a few of the<br/>\nclasses and see how engaged the other little kids are and if they&#39;re<br/>\nreally happy.   Putting someone else&#39;s structure to a three year old<br/>\nimagination might spoil everything.<br/>\n<br/>\nThree is so little.   When Dylan was four some of his friends were<br/>\nplaying soccer.  He decided to try.  He didn&#39;t like jumping in the middle<br/>\nof other kids to try and kick the ball, but he did like rolling in the<br/>\ngrass, and crawling around inside the ball bag.   He made friends with a<br/>\nlittle girl who liked the same things ( and looking for airplanes)  and<br/>\nthe next year soccer season came her mom and I just sewed big bags and<br/>\ntook them to the park a couple times a week.  They had just as much fun<br/>\nand it was free.  He did try soccer again, and might another time too,<br/>\nbut sometimes the social part of any organized kid thing can be had in<br/>\nother ways that are even more fun for the kid.  So, maybe some<br/>\ninteresting dress up stuff and  lots of little songs to sing,  would be<br/>\nmore fun and full of her own imaginings and just right at three.  <br/>\n<br/>\nDeb L</div>","specialLinks":[]},{"userId":2018196,"authorName":"sjogy@aol.com","from":"sjogy@...","profile":"sjogypls","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Activities Question","postDate":"1013177282","msgId":4433,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc2LjE3MGIxMjRjLjI5OTUzNWMyQGFvbC5jb20+"},"prevInTopic":4431,"nextInTopic":4434,"prevInTime":4432,"nextInTime":4434,"topicId":4431,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/8/02 1:58:33 AM, Katguts@hotmail.com writes: ","messageBody":"<div id=\"ygrps-yiv-680619889\">In a message dated 2/8/02 1:58:33 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Katguts@...\">Katguts@...</a> writes:<br/>\n<br/>\n&lt;&lt; Then you hear about think &#39;window&#39; of time for people who go on to be <br/>\ngreat and how their paren&#39;t always started then at 2,3, or 4.  (Ok the <br/>\nOlymipc thing is getting me I guess).  :)  &gt;&gt;<br/>\n<br/>\nWell, it&#39;s not true for performing, that&#39;s for sure. It takes a lot to stop <br/>\nsomeone who really wants to perform. You could do it, but it doesn&#39;t sound <br/>\nlike YOU could do it.<br/>\n<br/>\n<br/>\nOTOH, though your sister sounds irritating, don&#39;t automatically dismiss <br/>\nsomething your daughter might like just because she suggests it. Go with your <br/>\ninstincts on how it would work for your family.<br/>\n<br/>\nPaula</div>","specialLinks":[]},{"userId":84135975,"authorName":"Pat Cald...","from":"&quot;Pat Cald...&quot; &lt;homeschoolmd@...&gt;","profile":"homeschoolmd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Activities Question","postDate":"1013177194","msgId":4434,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxNGEwMWMxYjBhOSRkMTRmOTVlMCQ2NDAxYThjMEBvZmZpY2U+","referencesHeader":"PE9FNjJBcGFjelNsb2VYaGswSjcwMDAxMjFjYkBob3RtYWlsLmNvbT4="},"prevInTopic":4433,"nextInTopic":4451,"prevInTime":4433,"nextInTime":4435,"topicId":4431,"numMessagesInTopic":0,"msgSnippet":"I am going to give you the perspective of someone whose children were in school up to 4th and 6th grade so I don t have the same frame of reference as others","messageBody":"<div id=\"ygrps-yiv-753073089\">I am going to give you the perspective of someone whose children were in school up to 4th and 6th grade so I don&#39;t have the same frame of reference as others on this list.<br/>\n<br/>\nLife is full of negative messages that our children pick up all the time.  Our job is to coach them along the way and help them develop into their own person.  There are positive as well as negative things about preschool and dance class just as there are positive and negative things about TV.  If you think she would love the social interaction and other positive things than by keeping her out, you are saying she is not capable of handling the negative things.  At some point, she will probably ask to take a dance class so it is really just a matter of when.  If you think she is too young now and will be too greatly influenced by her classmates, wait but this could also be the time to help her deal with some of these things.  You would know best.<br/>\n<br/>\nI know my children have a few scars from ps but mostly because I bought into the system and only in the areas I bought into.  They have also built up some calluses that would have been hard to build without the stuff they had to deal with.  I think these calluses are very beneficial in dealing with other kids and the world as it is.<br/>\n <br/>\nPat<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- <br/>\nFrom: Katrina Gutleben <br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a> <br/>\nSent: Friday, February 08, 2002 2:50 AM<br/>\nSubject: [AlwaysLearning] Activities Question<br/>\n<br/>\n<br/>\nMy sister, who is very against Unschooling, and I were talking the other day about my daughter who is very social.  She feels that she would love the preschool program that her daughters are in because she is so social.  Personally it&#39;s not an environment I want my kids in and I said as much while trying to be respectful to her views on education.  The the next day we were at the mall and my dd (she&#39;s 3 by the way) climbed up on a little raised &#39;stage&#39; they have there for performances and did a very adorable an *loud* redition of her ABC&#39;s followed by Twinkle Twinkle Little Star complete with hand motions and a deep deep bow to finish it off.  She even attracted a small crowd.  :)<br/>\n<br/>\nSo my sister says as we are walking off &quot;We need to get her in Sunshine Generation (a kids dancing and singing group).&quot;  I guess it hit me deeper than I initially realized because I come home and I&#39;m thinking does she need to be in some kind of class like that??  The thing is she would love it.  She would also love preschool though.  And I can&#39;t help but think that the things I don&#39;t like about preschool would be about the same things that I would hate about her being in a dancing class.  Part of the beauty of her right now is that she&#39;s just like this.  She&#39;s *not* in a class, she doesn&#39;t ask permission to sing, she doesn&#39;t think to be shy or raise her hand or stand in a line or.... all that.<br/>\n<br/>\nI guess the way I see it is that she is developing quite nicely on her own (thank you very much) and no she may not be learning the &#39;proper&#39; ways of doing it but she&#39;s having a ball.  Then you hear about think &#39;window&#39; of time for people who go on to be great and how their paren&#39;t always started then at 2,3, or 4.  (Ok the Olymipc thing is getting me I guess).  :)  It&#39;s just too easy to second guess all of this.<br/>\n<br/>\nWhat is you guys&#39; take on it?  Are they better off figuring it out on their own?  She&#39;s sort of at an age where she would happily do anything but if I try to interfere by &#39;helping&#39; she becomes immidiatly helpless and &#39;forgets&#39; how to do it.  Like drawing.  If I try to draw too at the same time as her (different paper and everything) then she won&#39;t draw anymore and only wants me to draw for her.  I&#39;d love to know if anyone else has struggled with this and what happened there.<br/>\n<br/>\nKatieGet more from the Web.  FREE MSN Explorer download : <a rel=\"nofollow\" target=\"_blank\" href=\"http://explorer.msn.com\">http://explorer.msn.com</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n      Yahoo! Groups Sponsor <br/>\n            ADVERTISEMENT<br/>\n           <br/>\n     <br/>\n     <br/>\n<br/>\nTo unsubscribe from this group, send an email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning-unsubscribe@yahoogroups.com\">AlwaysLearning-unsubscribe@yahoogroups.com</a><br/>\n<br/>\n<br/>\n<br/>\nYour use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":10804628,"authorName":"Katrina Gutleben","from":"&quot;Katrina Gutleben&quot; &lt;Katguts@...&gt;","profile":"birdiebutt2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Activities Question","postDate":"1013154630","msgId":4431,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PE9FNjJBcGFjelNsb2VYaGswSjcwMDAxMjFjYkBob3RtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":4433,"prevInTime":4430,"nextInTime":4432,"topicId":4431,"numMessagesInTopic":0,"msgSnippet":"My sister, who is very against Unschooling, and I were talking the other day about my daughter who is very social.  She feels that she would love the preschool","messageBody":"<div id=\"ygrps-yiv-508609712\">My sister, who is very against Unschooling, and I were talking the other day about my daughter who is very social.  She feels that she would love the preschool program that her daughters are in because she is so social.  Personally it&#39;s not an environment I want my kids in and I said as much while trying to be respectful to her views on education.  The the next day we were at the mall and my dd (she&#39;s 3 by the way) climbed up on a little raised &#39;stage&#39; they have there for performances and did a very adorable an *loud* redition of her ABC&#39;s followed by Twinkle Twinkle Little Star complete with hand motions and a deep deep bow to finish it off.  She even attracted a small crowd.  :)<br/>\n<br/>\nSo my sister says as we are walking off &quot;We need to get her in Sunshine Generation (a kids dancing and singing group).&quot;  I guess it hit me deeper than I initially realized because I come home and I&#39;m thinking does she need to be in some kind of class like that??  The thing is she would love it.  She would also love preschool though.  And I can&#39;t help but think that the things I don&#39;t like about preschool would be about the same things that I would hate about her being in a dancing class.  Part of the beauty of her right now is that she&#39;s just like this.  She&#39;s *not* in a class, she doesn&#39;t ask permission to sing, she doesn&#39;t think to be shy or raise her hand or stand in a line or.... all that.<br/>\n<br/>\nI guess the way I see it is that she is developing quite nicely on her own (thank you very much) and no she may not be learning the &#39;proper&#39; ways of doing it but she&#39;s having a ball.  Then you hear about think &#39;window&#39; of time for people who go on to be great and how their paren&#39;t always started then at 2,3, or 4.  (Ok the Olymipc thing is getting me I guess).  :)  It&#39;s just too easy to second guess all of this.<br/>\n<br/>\nWhat is you guys&#39; take on it?  Are they better off figuring it out on their own?  She&#39;s sort of at an age where she would happily do anything but if I try to interfere by &#39;helping&#39; she becomes immidiatly helpless and &#39;forgets&#39; how to do it.  Like drawing.  If I try to draw too at the same time as her (different paper and everything) then she won&#39;t draw anymore and only wants me to draw for her.  I&#39;d love to know if anyone else has struggled with this and what happened there.<br/>\n<br/>\nKatieGet more from the Web.  FREE MSN Explorer download : <a rel=\"nofollow\" target=\"_blank\" href=\"http://explorer.msn.com\">http://explorer.msn.com</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":4527,"nextTopicId":4541}}