{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":221591978,"authorName":"Bernadette Lynn","from":"Bernadette Lynn &lt;bernadette.lynn@...&gt;","profile":"bwalyalynn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: kids choosing &quot;schooly&quot; things, long","postDate":"1268335297","msgId":51927,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU2OGY4YWExMDAzMTExMTIxazQ2NzYxZWM5cDc1NmM2MTU5ODEzNzEzZTBAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PGhuYjlmOStoNWFlQGVHcm91cHMuY29tPg==","referencesHeader":"PFNOVDEwNS1XMzBENDg4NUM4NzVDMEU2NkVCMURFNEJFMzIwQHBoeC5nYmw+CSA8aG5iOWY5K2g1YWVAZUdyb3Vwcy5jb20+"},"prevInTopic":51918,"nextInTopic":0,"prevInTime":51926,"nextInTime":51928,"topicId":51879,"numMessagesInTopic":0,"msgSnippet":"... ==== Another trick which helps memorising is learning things backwards; learn the last line, then the last two lines, then the last three and so on. That","messageBody":"<div id=\"ygrps-yiv-2013000668\">On 11 March 2010 17:32, Cary &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:cary.seston@...\">cary.seston@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; ***** He is struggling a little with memorizing the 10 minute speech that<br/>\n&gt; he is required to give to pass the exam. ******<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ====<br/>\n&gt; Think of it like 4 songs.  He knows the words to 4 songs, no?  We trick<br/>\n&gt; ourselves into thinking memorizing is hard because it&#39;s 10 loooong minutes,<br/>\n&gt; but I know the entire Indigo Girls Nomads, Indians, and Saints album without<br/>\n&gt; even thinking about it.  :o)<br/>\n&gt;<br/>\n&gt; Better yet---all 10 minutes are not of the same weight.  It&#39;s the 80/20<br/>\n&gt; rule.  20% is really important and the other 80% just gets you there.  SO<br/>\n&gt; organize the memorizing around operative words and operative phrases (your<br/>\n&gt; real intention) and it&#39;ll give you a focal point.  Then maybe the work can<br/>\n&gt; just be in small chunks in between XBox sessions around each operative<br/>\n&gt; phrase.  (even if it looks like the entire 10 minutes is operative...there<br/>\n&gt; is probably still 20% that is even more operative!)<br/>\n&gt;<br/>\n </span></blockquote>====<br/>\n<br/>\nAnother trick which helps memorising is learning things backwards; learn the<br/>\nlast line, then the last two lines, then the last three and so on. That way<br/>\nyou always know where you&#39;re headed and don&#39;t run into a blank. It&#39;s easy<br/>\nenough to refresh your memory with the beginning just before you start.<br/>\n<br/>\n<br/>\nBernadette.<br/>\n-- <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.bbc.co.uk/dna/h2g2/U15459\">http://www.bbc.co.uk/dna/h2g2/U15459</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":334703817,"authorName":"Cary","from":"&quot;Cary&quot; &lt;cary.seston@...&gt;","profile":"cary.seston","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: kids choosing &quot;schooly&quot; things, long","postDate":"1268328745","msgId":51918,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhuYjlmOStoNWFlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PFNOVDEwNS1XMzBENDg4NUM4NzVDMEU2NkVCMURFNEJFMzIwQHBoeC5nYmw+"},"prevInTopic":51879,"nextInTopic":51927,"prevInTime":51917,"nextInTime":51919,"topicId":51879,"numMessagesInTopic":0,"msgSnippet":"***** He is struggling a little with memorizing the 10 minute speech that he is required to give to pass the exam. ****** I went to acting school for 4 years","messageBody":"<div id=\"ygrps-yiv-294788734\">***** He is struggling a little with memorizing the 10 minute speech that he is required to give to pass the exam. ******<br/>\n<br/>\n<br/>\nI went to acting school for 4 years and have been in many many plays and done scene work, etc. and have lots of experience memorizing.  <br/>\n<br/>\nSome things that might help:<br/>\n<br/>\nThink of it like 4 songs.  He knows the words to 4 songs, no?  We trick ourselves into thinking memorizing is hard because it&#39;s 10 loooong minutes, but I know the entire Indigo Girls Nomads, Indians, and Saints album without even thinking about it.  :o)<br/>\n<br/>\nBetter yet---all 10 minutes are not of the same weight.  It&#39;s the 80/20 rule.  20% is really important and the other 80% just gets you there.  SO organize the memorizing around operative words and operative phrases (your real intention) and it&#39;ll give you a focal point.  Then maybe the work can just be in small chunks in between XBox sessions around each operative phrase.  (even if it looks like the entire 10 minutes is operative...there is probably still 20% that is even more operative!)<br/>\n<br/>\nYou can help out a lot by &quot;playing the other role&quot;  Invent leading questions that remind your son of the next section based on the most important points of the speech.  Pretty soon, you can drop the questions.  If you just work by feeding him lines, in my experience, it&#39;s harder to remember the lines.  It&#39;s hard to memorize lines.  It&#39;s easier to just know the lines by knowing your intention.   <br/>\n<br/>\nI don&#39;t know what this speech is in content, but it might help to think of it as &quot;a really important speech that will inform many people who don&#39;t know about TKD&quot; rather than a speech for people who are testing you.  Maybe pretend the audience has never heard the content and it is up to your ds to help them out.  Thinking of it like that can help you to discover the 80/20 or the ebb and flow.    <br/>\n<br/>\nGood luck. Hope it goes well and is fun for him!<br/>\n<br/>\nCary</div>","specialLinks":[]},{"userId":197421595,"authorName":"Katy Jennings","from":"Katy Jennings &lt;kjennings95@...&gt;","profile":"coyotegoddess95","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"kids choosing &quot;schooly&quot; things, long","postDate":"1268269418","msgId":51879,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFNOVDEwNS1XMzBENDg4NUM4NzVDMEU2NkVCMURFNEJFMzIwQHBoeC5nYmw+"},"prevInTopic":0,"nextInTopic":51918,"prevInTime":51878,"nextInTime":51880,"topicId":51879,"numMessagesInTopic":0,"msgSnippet":"Things have been very different around my house these last few weeks.  I have been helping Richard write a speech, then condense it down to an outline, and try","messageBody":"<div id=\"ygrps-yiv-462486768\">Things have been very different around my house these last few weeks.  I have been helping Richard write a speech, then condense it down to an outline, and try to memorize it.  I have been helping him put together a binder logging his TaeKwonDo training and instructor hours, class schedules (80!), and a Journey Document that has all sorts of information about his TaeKwonDo training from the time he was 9 years old until now, and a book report.  It all seems very schooly to me.  &lt;g&gt; <br/>\n<br/>\n <br/>\n<br/>\nAll this is because he has decided to test to be a Restricted (under 18) Certified TaeKwonDo Instructor.  He wants to to this, and so I am doing all I can to help him.  Really, most of the writing, typing, preparing documents, etc has been done by myself or my niece, who is all ready a Restricted Certified Instructor (turning 18 this week and will be a full fledged instructor).  It is a lot of work for all 3 of us!   I was a little annoyed by some of the requirements, which are the same for a teen as they are for an adult, but maybe that is just mama bear syndrome.  &lt;g&gt;  <br/>\n<br/>\n <br/>\n<br/>\nIt has been really interesting for me to observe him during all of this.  Richard is 14 and has never been to school (some daycare).  He is struggling a little with memorizing the 10 minute speech that he is required to give to pass the exam.  I have been helping him as much as I can, encouraging him, telling him that if he decides to back out of the testing it is ok.  I have been showing him see that he all ready knows most of the information, it is just putting it together and memorizing the proper terminology.  <br/>\n<br/>\n <br/>\n<br/>\nI think one of the biggest surprises for me was when I told him about mnemonic devices.  I explained what they are, and he said &#39;Oh yeah, like how I remember the 5 elements of transformational language by thinking of iPapa!&#39;  Uh, yeah, exactly!  He thinks of an iPod and his grandpa (Papa), and he has the first letters of the 5 elements.  I had been confused and a little annoyed about him changing the order of the elements in his speech (not sure why, I guess I just felt like they should be in the order that they were in the book! &lt;g&gt;), and it turns out that he changed them to fit his mnemonic device.  Makes sense.  I guess he didn&#39;t have to know what mnemonic devices were to use one!  <br/>\n<br/>\n <br/>\n<br/>\nI have also found it interesting thinking about his (and my) reactions to my prodding him to work on the speech.  He forgets, gets involved in his xbox or airsoft or whatever, and the deadline is fast approaching.  I remember when I was younger and I would be involved in something and my mom would tell me to do my homework, or take out the trash, or whatever.  She thought I was just being lazy, difficult.  When I mention to Richard that maybe he should work on his speech a little, I can see those traditional parenting thoughts in my head.  I can see myself getting annoyed that he has *just* been playing xbox all day and he needs to work on this!  But I have been able to stop those thoughts from coming out of my mouth.  I think about it, then remember how much I would have liked it if my mom saw something positive in what I was doing, and let me finish.  He is not JUST playing xbox.  He is learning, working on complex strategies, connecting with is online and in person friends, having fun!  I ask him if he is near a stopping place in his game, and when he gets to one can I help him with his speech for a while?  He has yet to say no, though sometimes he forgets and I cheerfully remind him again.  &lt;g&gt; <br/>\n<br/>\n <br/>\n<br/>\nThis situation could have been so difficult, but being Richard&#39;s partner in this, rather than just yelling at him to get it done (after all he chose it!), has made it really pleasant!  We have had a lot of time together to work on it, and that has been fun.  We have laughed, I have shared stories about giving speeches myself and my own horrible stage fright, and we learned a lot about each other.  Not what I would have expected from such an arduous undertaking!<br/>\n<br/>\n <br/>\n<br/>\nKaty<br/>\n \t\t \t   \t\t  <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":51885,"nextTopicId":51909}}