{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re:sister posting no boy signs","postDate":"1088435512","msgId":19949,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFlOC4yNDAzYzRhZS4yZTExOGYzOEBhb2wuY29tPg=="},"prevInTopic":19944,"nextInTopic":0,"prevInTime":19948,"nextInTime":19950,"topicId":19939,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/26/04 12:24:34 PM, maryfhickman@jps.net writes: ","messageBody":"<div id=\"ygrps-yiv-423050888\">In a message dated 6/26/04 12:24:34 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:maryfhickman@...\">maryfhickman@...</a> writes:<br/>\n<br/>\n&lt;&lt; To meet her needs he needs to be totally away. To meet his needs he needs <br/>\nto be totally included. I tend to support whoever needs the support the most <br/>\nin the moment. &gt;&gt;<br/>\n<br/>\nBut that can lead to a needy or an expressive child wrecking another child&#39;s <br/>\nlife by being &quot;the most needy&quot; in the moment.<br/>\n<br/>\n&lt;&lt;Sometimes the girls seem to provoke attack like play, teasing the boys to <br/>\nchase them, then going behind doors and writing No Boys ever. &gt;&gt;<br/>\n<br/>\nWe had some of this, as Kirby exluded Marty for a couple of years, and then <br/>\nthey both excluded Holly for a while.  They&#39;ve all gotten over it almost <br/>\ncompletely.   Last night Kirby was going to a movie for a friend&#39;s birthday (with a <br/>\ngroup) and though Marty would probaby have been included, he had company <br/>\nalready and Kirby told me it might be best for him not to invite Marty this time.  <br/>\n(They&#39;re 17 and 15.)  That was fine.<br/>\n<br/>\nHolly was being a part of the group of friends Marty had over to play orc <br/>\nball.  The orc ball game hadn&#39;t happened, but they&#39;d stayed and played a board <br/>\ngame and watched a movie, and Holly was involved.<br/>\n<br/>\nBut when they were little, I would find something special for the child who <br/>\nwas left out, and at the same time as the older ones not to be hurtful about <br/>\nit.  It can&#39;t be perfect, but it can be minimalized.<br/>\n<br/>\n&lt;&lt; the reaction my son has is too intense and then he loses control and <br/>\nhurts. &gt;&gt;<br/>\n<br/>\nHurts inside?<br/>\nOr hurts others, or things?<br/>\n<br/>\n&lt;&lt;My older daughter thinks nothing of being mean. That is where the problem <br/>\nlies. She controls play completely, does not listen well and gets intense <br/>\nherself. I want to stop having her friends over. &gt;&gt;<br/>\n<br/>\nThat would be mean, to keep her from having friends.<br/>\n<br/>\nCan she go to the friends&#39; house more often?  Maybe, since the house is <br/>\nsmall, you could help provide snacks or movies for her and her friends at another <br/>\nhouse, and so your son wouldn&#39;t feel so crowded, and maybe get more into being <br/>\nwith you.<br/>\n<br/>\n-=. I expect her to be kind to others yet she does not. How do I help her see <br/>\nher own meanness, the pain she inflicts on her sibs in a peaceful way. -=-<br/>\n<br/>\nBy examples when you see others being mean, or when someone has been mean to <br/>\nher, mention gently that that&#39;s probably how her brother feels sometimes.  But <br/>\nit&#39;s not fair to make her responsible for her brother&#39;s happiness.  She <br/>\ndidn&#39;t &quot;have a brother,&quot; you had another child, so the burden of providing safety <br/>\nand optimal peace falls on you, the mom.<br/>\n<br/>\n-=-Riley has grown recently in his ability to cope. It breaks my heart to see <br/>\nhim so hurt, though, day in and day out, by someone I also love.-=-<br/>\n<br/>\nMy kids don&#39;t remember their hurts as vividly as I was afraid they would.  <br/>\nThey&#39;ve really come to like each other, but it wasn&#39;t always so.   <br/>\n<br/>\nWould it help to have special toys or games, either that he hasn&#39;t seen or <br/>\nhasn&#39;t seen lately, and bring them out when she has company?  Or rent a new <br/>\nkid-movie he hasn&#39;t seen, when she has company, and tell her and her friends to <br/>\nleave him alone to watch the movie if they can&#39;t include him?<br/>\n<br/>\nIs it possible for you to plan some things to do with all the kids and be in <br/>\non it instead of letting her plan her whole party in a more private, <br/>\nbehind-doors fashion?  Or at least an activity when they&#39;re first all there?  <br/>\nSculptures with mini-marshmallows and flat toothpicks, or a game that involves teams, <br/>\nand words or singing (Encore, or Blurt, both are good with mixed ages).  If the <br/>\nyounger kids have an opportunity to interact, maybe they won&#39;t feel so <br/>\n&quot;other,&quot; and the older kids will find common ground and reason to respect them a bit <br/>\nfor something real, not because a mom said to.<br/>\n<br/>\nCan you find a peaceful time when nobody else is home and brainstorm with the <br/>\nkids all together about what might help in the future?  And remember the <br/>\nfuture will change.  They&#39;ll be a year older in just one year. &lt;g&gt;<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":73238415,"authorName":"J. Stauffer","from":"&quot;J. Stauffer&quot; &lt;jnjstau@...&gt;","profile":"jnjstau","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re:sister posting no boy signs","postDate":"1088282859","msgId":19944,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMjUwMWM0NWJiZSRkMjNmNjNhMCQ2NGJkYjFkOEB5b3VybzBrd2t3OWp3Yz4=","referencesHeader":"PDU3ODg5NS4xMDg4Mjc0MjEzNzU2LkphdmFNYWlsLnJvb3RAZG9uYWxkLnBzcC5wYXMuZWFydGhsaW5rLm5ldD4="},"prevInTopic":19939,"nextInTopic":19949,"prevInTime":19943,"nextInTime":19945,"topicId":19939,"numMessagesInTopic":0,"msgSnippet":" What was your relationship","messageBody":"<div id=\"ygrps-yiv-404375823\">&lt;&lt;&lt;&lt;It breaks my heart to see him so hurt, though, day in and day out, by<br/>\nsomeone I also love. Strange deals raising a family.&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nWhat was your relationship like with your siblings?  With friends?  I am<br/>\nwondering if there are some leftover issues.  Just a thought.<br/>\n<br/>\nPersonally, I would no longer worry about distracting the brother.  I would<br/>\nset a firm boundary that he is not allowed to interfere with the sister&#39;s<br/>\nplaydates, period.  I would offer him alternatives, but if I needed to<br/>\nphysically pick him up and remove him, I would.<br/>\n<br/>\nI would tell the daughter that I am willing to do what it takes to give her<br/>\nspace but at the same time, I am absolutely unwilling to have her torture<br/>\nanyone.  If it meant breaking up the playdate I would.  (If an adult in the<br/>\nfamily had a party and she and a guest emotionally battered another family<br/>\nmember, the party would bust up or the victim and I would leave.  Since you<br/>\ncan&#39;t just abandon your dd, I would have no problem busting up the  party.)<br/>\n<br/>\nIt sounds like the kids have very much gotten into the habit of not<br/>\nrespecting each other, not treating each other as a full human.  I talk to<br/>\nthe kids about how it is my job to keep them safe, even if that means safe<br/>\nfrom each other.  I talk to them about how I wouldn&#39;t let someone outside<br/>\nthe family treat them like that so how can I sit by while they do it.<br/>\n<br/>\nJulie S.---the hardnose<br/>\n<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- <br/>\nFrom: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:maryfhickman@...\">maryfhickman@...</a>&gt;<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>&gt;<br/>\nSent: Saturday, June 26, 2004 1:23 PM<br/>\nSubject: [AlwaysLearning] Re:sister posting no boy signs<br/>\n<br/>\n<br/>\n&gt; Hello,<br/>\n&gt;<br/>\n&gt; Here&#39;s a bit more backround about my situation. Riley does not want to do<br/>\nother things with me, even very cool things.  He simply wants to share in<br/>\nwhatever his sis is doing. I have spent since he was 2 distracting, finding<br/>\nfriends for him to play with also. He doesn&#39;t like to go to other peoples<br/>\nhomes much, unless I too stay. We just lost yet another one of his best<br/>\nbuddies to moving out of town. He has a limited number of friends because he<br/>\nis very selective. He likes much older boys in the homeschooling community.<br/>\nOur neighbor thinks our boys, 7 and 11 are too far apart in age to have<br/>\nsleepovers. I see him forging a few new friends in a swim team recently all<br/>\n9 and 10 year olds. He sis has 0 tolerance to his presence when she has<br/>\nfriends over. She is mean in her words and actions towards him. To meet her<br/>\nneeds he needs to be totally away. To meet his needs he needs to be totally<br/>\nincluded. I tend to support whoever needs the support the most in the<br/>\nmoment. I also have a 4.5 year girl. She is included more in the girl play<br/>\nsimply because my daughter&#39;s friends like to have a living doll to make up,<br/>\ndress, etc. Sometimes the girls seem to provoke attack like play, teasing<br/>\nthe boys to chase them, then going behind doors and writing No Boys ever.<br/>\nPart of it is play, but the reaction my son has is too intense and then he<br/>\nloses control and hurts.<br/>\n&gt;<br/>\n&gt; Having friends over for Riley helps, yet is not always possible. Our home<br/>\nis tiny, 3 bedrooms and 1 bath., just under 1000sq. feet.  My older daughter<br/>\nthinks nothing of being mean. That is where the problem lies. She controls<br/>\nplay completely, does not listen well and gets intense herself. I want to<br/>\nstop having her friends over. I am not reacting to this, though, and<br/>\ncontinue to try again, hoping for improved relations. This daughter has a<br/>\nhug cup and asks for more all the time. She rarely seems satisfied no matter<br/>\nhow much loving has been given her. Even when her brother is sincerely<br/>\ngiving her some dose of loving response, she snaps at him as if she had<br/>\nheard nothing. I think she is poor at picking up other people&#39;s body cues.<br/>\nClassic type A personality, going going no matter what she crushes in her<br/>\npath. I&#39;m asking for some ideas to give her boundries which others have<br/>\nfound useful. I expect her to be kind to others yet she does not. How do I<br/>\nhelp her see her own meanness, the pain she inflicts on her sibs in a<br/>\npeaceful way. How do others react when the expectations are not met. She<br/>\nalso wants to hear no complaints and blows up if anyone tries to show her a<br/>\nbetter way. My thoughts tend towards ackowledging when she does some minor<br/>\nnice things with her sibs, which does happen. The intensity of the mean<br/>\nreactions far outweighs the intensity of the nice reactions. Will others<br/>\nstop having kids over if the sib. can not be kind to her family. I really<br/>\nwant to avoid a punishment type of experience as I know from experience it<br/>\ndoes not generate a peaceful solution. She also asks to have friends over<br/>\nfor sleepovers often, which I support.<br/>\n&gt;<br/>\n&gt; This got longer than I planned, thank you for reading. The relationship<br/>\nbetween these 2 kids has been and I know will continue to be intense. Riley<br/>\nhas grown recently in his ability to cope. It breaks my heart to see him so<br/>\nhurt, though, day in and day out, by someone I also love. Strange deals<br/>\nraising a family.<br/>\n&gt;<br/>\n&gt; Mary<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":117956499,"authorName":"maryfhickman@jps.net","from":"maryfhickman@...","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:sister posting no boy signs","postDate":"1088274213","msgId":19939,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU3ODg5NS4xMDg4Mjc0MjEzNzU2LkphdmFNYWlsLnJvb3RAZG9uYWxkLnBzcC5wYXMuZWFydGhsaW5rLm5ldD4="},"prevInTopic":0,"nextInTopic":19944,"prevInTime":19938,"nextInTime":19940,"topicId":19939,"numMessagesInTopic":0,"msgSnippet":"Hello, Here s a bit more backround about my situation. Riley does not want to do other things with me, even very cool things.  He simply wants to share in","messageBody":"<div id=\"ygrps-yiv-808423822\">Hello,<br/>\n<br/>\nHere&#39;s a bit more backround about my situation. Riley does not want to do other things with me, even very cool things.  He simply wants to share in whatever his sis is doing. I have spent since he was 2 distracting, finding friends for him to play with also. He doesn&#39;t like to go to other peoples homes much, unless I too stay. We just lost yet another one of his best buddies to moving out of town. He has a limited number of friends because he is very selective. He likes much older boys in the homeschooling community. Our neighbor thinks our boys, 7 and 11 are too far apart in age to have sleepovers. I see him forging a few new friends in a swim team recently all 9 and 10 year olds. He sis has 0 tolerance to his presence when she has friends over. She is mean in her words and actions towards him. To meet her needs he needs to be totally away. To meet his needs he needs to be totally included. I tend to support whoever needs the support the most in the moment. I also have a 4.5 year girl. She is included more in the girl play simply because my daughter&#39;s friends like to have a living doll to make up, dress, etc. Sometimes the girls seem to provoke attack like play, teasing the boys to chase them, then going behind doors and writing No Boys ever. Part of it is play, but the reaction my son has is too intense and then he loses control and hurts. <br/>\n<br/>\nHaving friends over for Riley helps, yet is not always possible. Our home is tiny, 3 bedrooms and 1 bath., just under 1000sq. feet.  My older daughter thinks nothing of being mean. That is where the problem lies. She controls play completely, does not listen well and gets intense herself. I want to stop having her friends over. I am not reacting to this, though, and continue to try again, hoping for improved relations. This daughter has a hug cup and asks for more all the time. She rarely seems satisfied no matter how much loving has been given her. Even when her brother is sincerely giving her some dose of loving response, she snaps at him as if she had heard nothing. I think she is poor at picking up other people&#39;s body cues. Classic type A personality, going going no matter what she crushes in her path. I&#39;m asking for some ideas to give her boundries which others have found useful. I expect her to be kind to others yet she does not. How do I help her see her own meanness, the pain she inflicts on her sibs in a peaceful way. How do others react when the expectations are not met. She also wants to hear no complaints and blows up if anyone tries to show her a better way. My thoughts tend towards ackowledging when she does some minor nice things with her sibs, which does happen. The intensity of the mean reactions far outweighs the intensity of the nice reactions. Will others stop having kids over if the sib. can not be kind to her family. I really want to avoid a punishment type of experience as I know from experience it does not generate a peaceful solution. She also asks to have friends over for sleepovers often, which I support.<br/>\n<br/>\nThis got longer than I planned, thank you for reading. The relationship between these 2 kids has been and I know will continue to be intense. Riley has grown recently in his ability to cope. It breaks my heart to see him so hurt, though, day in and day out, by someone I also love. Strange deals raising a family.<br/>\n<br/>\nMary</div>","specialLinks":[]}],"prevTopicId":19941,"nextTopicId":19950}}