{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: censoring tv/media","postDate":"1092741852","msgId":98208,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJENDc2MzFDLjJBMjFGJWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDIwMDQwODE2MjAyNzIxLjM0MTg3LnFtYWlsQHdlYjIwNzA0Lm1haWwueWFob28uY29tPg=="},"prevInTopic":98206,"nextInTopic":0,"prevInTime":98207,"nextInTime":98209,"topicId":98162,"numMessagesInTopic":0,"msgSnippet":"... So you re saying she wants to see Sex, blood, gore, violence, murdering folks, raping folks, porn and that you are preventing her? How does she know she","messageBody":"<div id=\"ygrps-yiv-962239425\">on 8/16/04 4:27 PM, Ali Kat at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sweetgypsiedncer@...\">sweetgypsiedncer@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; This is part of my concern in allowing my daughter to watch whatever she<br/>\n&gt; wants.<br/>\n<br/>\n </span></blockquote>So you&#39;re saying she wants to see &quot;Sex, blood, gore, violence, murdering<br/>\nfolks, raping folks, porn&quot; and that you are preventing her? How does she<br/>\nknow she wants to see those things?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; but I limit her exposure to what she can understand and emotionally<br/>\n&gt; handle.<br/>\n<br/>\n </span></blockquote>Do you want to be exposed to things you find upsetting and can&#39;t emotionally<br/>\nhandle? Would you want to be sitting watching a movie and have your husband<br/>\nkeep silent about an upcoming scene he knew would upset you?<br/>\n<br/>\nIf there were a movie you&#39;d heard good things about and wanted to see would<br/>\nyou want your husband to say &quot;No, you can&#39;t see that,&quot; and stop you from<br/>\nwatching it or &quot;I&#39;ve heard there&#39;s a violent rape scene and I know you don&#39;t<br/>\nlike such scenes,&quot; and then let you decide? The first removes control from<br/>\nyou, puts the decision power in his hands. The second gives you some<br/>\ninformation to help make your own decision or to find out more.<br/>\n<br/>\n(I&#39;m not advocating giving kids information and then shrugging your<br/>\nshoulders when they make a different decision than you&#39;d want them to.<br/>\nThey&#39;re going to want to want to test their personal boundaries to see what<br/>\nthey&#39;re capable of handling and we need them to know we&#39;ll be there to<br/>\nsupport them while they explore.)<br/>\n<br/>\nIf we give our kids the idea we&#39;re trying to protect them from the world and<br/>\nprotect them from their own under-developed powers of judgement, they&#39;ll<br/>\nresent being told &quot;No, you don&#39;t want to see that,&quot; since it means you&#39;re<br/>\ntaking the power to decide away from them. But if we build a sense of trust<br/>\nin them that they understand we&#39;re trying to help them see what they want to<br/>\nsee and avoid what they want to avoid, they&#39;ll hear &quot;No, you don&#39;t want to<br/>\nsee that,&quot; as trusted advice. I&#39;d also tell my daughter why, but I&#39;d leave<br/>\nthe decision up to her. If she decided to watch anyway, I&#39;d be there with<br/>\nher to pause or fast forward or talk about it or turn it off and find<br/>\nsomething else to do, or whatever would help her tackle something that might<br/>\nbe a little difficult for her. If she decides she&#39;s ready to test her wings,<br/>\nI&#39;ll happily stand under her with a net. :-)<br/>\n<br/>\nI&#39;ve knee jerk said &quot;No you have to go to class,&quot; when she doesn&#39;t want to<br/>\nsee the afternoon spent on a lot of driving for a 1 hour class. And she then<br/>\n*really* doesn&#39;t want to go. But when I realize what I&#39;ve said and tell her<br/>\nof course she doesn&#39;t have to go, she thinks about it and generally decides<br/>\nshe&#39;ll go. She doesn&#39;t want to do the things she &quot;shouldn&#39;t&quot;. (Not going to<br/>\na class isn&#39;t a good example of a &quot;shouldn&#39;t&quot; but I can&#39;t think of a better<br/>\none at the moment.) What she does want is to have the choice.<br/>\n<br/>\nKids don&#39;t want to do things that are bad for them. But they often will do<br/>\nthings they don&#39;t want to do because they aren&#39;t given the choice. Kids have<br/>\nbeen known to sit through a horror movie that disturbs them if they think<br/>\nthat this is the only chance they&#39;ll ever get to watch it, that if they turn<br/>\nit off or if they end up with nightmares, mom will say she was right to not<br/>\nwant them to watch it and she&#39;ll never let them see something she feels<br/>\nuncomfortable about again.<br/>\n<br/>\nBut if they know they can watch whatever they want, that mom will do her<br/>\nbest to give them information if she knows something might be disturbing,<br/>\nand they know they can turn it off at any time, and that mom will be there<br/>\nto help them, they&#39;ll learn to listen to what their feelings are inside of<br/>\nthem to help them make decisions. It&#39;s way better than basing decisions on<br/>\nwhat someone else says they are feeling or will feel.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: censoring tv/media","postDate":"1092739925","msgId":98206,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5ZC4yODYxOWY1OS4yZTUzM2Q1NUBhb2wuY29tPg=="},"prevInTopic":98162,"nextInTopic":98208,"prevInTime":98205,"nextInTime":98207,"topicId":98162,"numMessagesInTopic":0,"msgSnippet":"In a message dated 8/16/2004 5:11:35 PM Eastern Daylight Time, sweetgypsiedncer@yahoo.com writes: I can  remember the first time I saw a movie where a woman","messageBody":"<div id=\"ygrps-yiv-618871844\">In a message dated 8/16/2004 5:11:35 PM Eastern Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sweetgypsiedncer@...\">sweetgypsiedncer@...</a> writes:<br/>\n<br/>\nI can  remember the first time I saw a movie where a woman got raped in front <br/>\nof her  son and I had to ask what &quot;rape&quot; meant.  I vomited, and to this very <br/>\nday  it is emotionally disturbing to me.  I still have images of violent porn  <br/>\nthat I was exposed to (or &quot;allowed&quot; to decide to watch) at young ages in my  <br/>\nhead.  I loved alien stuff, but watched/read so much that it freaks me  out <br/>\nnow.  I don&#39;t know how that can be considered &quot;healthy&quot;, and often  wish that my <br/>\nmother or someone would have paid enough attention to me to step  in and <br/>\nmonitor what I was reading and  seeing. &lt;&lt;&lt;&lt;&lt;&lt;<br/>\n <br/>\nAlert! Alert! That last sentence was the most telling!<br/>\n <br/>\nNo one here is suggesting that your child watch tv in a vacuum. We suggest  <br/>\nthat you be there WITH your child. Pay ATTENTION to your child. Be with her,  <br/>\nwatch with her, answer her questions, ask her questions.<br/>\n <br/>\nEven YOU wish for that same thing.<br/>\n <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;What do you do about that?  What do you do if your  child sees or hears <br/>\n </span></blockquote>about something like that and wants to see it for  themselves?&lt;&lt;&lt;&lt;&lt;<br/>\n <br/>\nI&#39;m there. And he knows he can turn it off if he wants to. He knows we can  <br/>\ntalk about it before, during, and after and after and after.<br/>\n <br/>\nBig difference.<br/>\n <br/>\n~Kelly<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":184936771,"authorName":"Ali Kat","from":"Ali Kat &lt;sweetgypsiedncer@...&gt;","profile":"sweetgypsiedncer","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: censoring tv/media","postDate":"1092688041","msgId":98162,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwODE2MjAyNzIxLjM0MTg3LnFtYWlsQHdlYjIwNzA0Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDEwOTI1ODE2MTguMTg1Mi4xNjY3NS5tMjJAeWFob29ncm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":98206,"prevInTime":98161,"nextInTime":98163,"topicId":98162,"numMessagesInTopic":0,"msgSnippet":"****************Nope. Not if it were something the child(ren) wanted to see. What image (that they would want to watch) would be so unpeaceful that I would","messageBody":"<div id=\"ygrps-yiv-562612964\">****************Nope.<br/>\n <br/>\nNot if it were something the child(ren) wanted to see. What image (that  <br/>\nthey <br/>\nwould want to watch) would be so &quot;unpeaceful&quot; that I would need to  <br/>\ncensor? <br/>\nand justify?<br/>\n <br/>\n~Kelly<br/>\n***********************<br/>\n<br/>\n <br/>\n<br/>\nSex, blood, gore, violence, murdering folks, raping folks, porn etc...  Of course, I am thinking on young child terms (lets say under 10).  This is part of my concern in allowing my daughter to watch whatever she wants.  It is not that I shelter her from the knowledge that these things exist, but I limit her exposure to what she can understand and emotionally handle.<br/>\n<br/>\nI can remember the first time I saw a movie where a woman got raped in front of her son and I had to ask what &quot;rape&quot; meant.  I vomited, and to this very day it is emotionally disturbing to me.  I still have images of violent porn that I was exposed to (or &quot;allowed&quot; to decide to watch) at young ages in my head.  I loved alien stuff, but watched/read so much that it freaks me out now.  I don&#39;t know how that can be considered &quot;healthy&quot;, and often wish that my mother or someone would have paid enough attention to me to step in and monitor what I was reading and seeing.  <br/>\n<br/>\nWhat do you do about that?  What do you do if your child sees or hears about something like that and wants to see it for themselves?<br/>\n<br/>\nCurious...  <br/>\n<br/>\n\t\t<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\nYahoo! Mail - You care about security. So do we.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":98195,"nextTopicId":98223}}