{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":85994576,"authorName":"Kolleen","from":"Kolleen &lt;Kolleen@...&gt;","profile":"kaydeecross","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"NY Times article","postDate":"1010023019","msgId":30663,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIwMTAzMDE1Ni5nMDMxdWVxMzAwNDg3OEBueWNzbXRwMm91dC5yZGMtbnljLnJyLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":30662,"nextInTime":30664,"topicId":30663,"numMessagesInTopic":0,"msgSnippet":"From today s New York Times-- Augmenting a Home-School Education January 2, 2002 By RICHARD ROTHSTEIN HELENA, Mont. -- About 2 percent of American students are","messageBody":"<div id=\"ygrps-yiv-948934953\">From today&#39;s New York Times--<br/>\n<br/>\n<br/>\n<br/>\nAugmenting a Home-School Education<br/>\n<br/>\nJanuary 2, 2002 <br/>\n<br/>\nBy RICHARD ROTHSTEIN<br/>\n<br/>\n<br/>\n <br/>\n<br/>\nHELENA, Mont. -- About 2 percent of American students are<br/>\nnow taught at home. Educators are confused about how this<br/>\ngrowing practice should be regulated, and also wonder<br/>\nwhether children who are not fully enrolled in school<br/>\nshould nonetheless get some public services. The issue<br/>\nshows how blurred the line between public and private<br/>\neducation can become, even when that private education is<br/>\ndelivered at home. <br/>\n<br/>\nProbably about half the parents who teach at home are<br/>\nreligiously motivated and use lessons by mail (or Internet)<br/>\nfrom church schools. Perhaps an additional fourth have<br/>\nphilosophical doubts about public education, think schools<br/>\nare unsafe or feel that their children have special needs<br/>\nthat regular schools don&#39;t meet. In some cases, parents<br/>\nhome- school to evade compulsory education; they do minimal<br/>\nteaching while having older children care for siblings or<br/>\nwork in home businesses. <br/>\n<br/>\nAlthough children often learn well at home, weak<br/>\nregulations in most states mean that officials rarely<br/>\nchallenge or monitor parents who say they are<br/>\nhome-schooling. With growing frequency, however, public<br/>\nschools offer services to the home- schooled. Districts may<br/>\npermit them to enroll part time, for instance; educators<br/>\nfear that otherwise these children could later return full<br/>\ntime with serious academic weaknesses, and in any case some<br/>\ndistricts wanting to qualify for state aid can benefit from<br/>\npart-timers filling empty seats. <br/>\n<br/>\nHere in Helena, Mary Brown has taught her 12 children at<br/>\nhome while manufacturing clothing there in her nonteaching<br/>\nhours. Mrs. Brown says her motive is to give more training<br/>\nin basics (like phonics) than public schools offer. Most of<br/>\nher curriculum is from a church school, with tests returned<br/>\nby mail. <br/>\n<br/>\nTwo years ago her seventh child, Andrea, wanting to join<br/>\nregular athletic programs, enrolled at Capital High School.<br/>\nAndrea soon changed her mind and resumed home study. But<br/>\nshe had liked gym and chorus, so Mrs. Brown asked that she<br/>\nbe allowed to continue in them while taking other courses<br/>\nat home. <br/>\n<br/>\nThe school board then voted to permit home- and<br/>\nprivate-school students to attend public school part time.<br/>\nAbout a dozen do so. Andrea, now a junior, is taking chorus<br/>\nand pottery; others take French, English, chemistry or math<br/>\ncourses that parents don&#39;t feel able to teach or that<br/>\nprivate schools don&#39;t offer. <br/>\n<br/>\nSome board members feared an exodus in which a flood of<br/>\nregular students would take only some classes and claim to<br/>\nbe studying the rest at home. The worry turned out to be<br/>\nunfounded. <br/>\n<br/>\nBruce Messinger, Helena&#39;s superintendent of schools, said<br/>\nhe had supported Mrs. Brown&#39;s request, partly to get more<br/>\nstate aid but also to unite the community, keeping the 5<br/>\npercent of Helena students in private- school or home<br/>\nsettings from being seen as a separate camp. <br/>\n<br/>\nJulie Mitchell, the board&#39;s chairwoman, noted that the<br/>\npolicy let the district expand its efforts to serve the<br/>\nneeds of individual students. For instance, Helena, like<br/>\nmany districts, already had dropouts gaining diplomas<br/>\nthrough independent study. Other students attend an<br/>\nalternative school with mental health services and fewer<br/>\nstudents per teacher. <br/>\n<br/>\nThe Helena experience is one of the varied accommodations<br/>\nmade to home schooling nationwide. Montana asks<br/>\nhome-schooling parents to register but regulates no<br/>\nfurther. Nebraska requires them to be qualified teachers.<br/>\nMaryland home-schoolers must file study plans, which<br/>\ndistricts evaluate to ensure nominal conformity with public<br/>\nschool standards. <br/>\n<br/>\nIowa requires parents teaching at home to give standardized<br/>\nexams or hire a regular teacher to test proficiency;<br/>\nparents of children who fall in the bottom 30 percent must<br/>\nfile a remediation plan or seek help from a public school.<br/>\nIn Des Moines, teachers will visit home-schooled students<br/>\nevery two weeks to offer advice if parents request it; each<br/>\nteacher serves about 45 students, and the district gets<br/>\nstate aid for the program. <br/>\n<br/>\nEvery state now recognizes a right to teach at home. To<br/>\nbind the community together, as Dr. Messinger said, it<br/>\nseems wise to let home- schooled children come to public<br/>\nschools for chorus or chemistry lab. <br/>\n<br/>\nBut where should lines be drawn? <br/>\n<br/>\nIn California,<br/>\nhome-schoolers organized into a charter school to get state<br/>\nfunds. <br/>\n<br/>\nAnd Andrea Brown is now taking a home biology course in<br/>\nwhich the teaching of evolution is optional. Should Helena<br/>\nbe rounding out the home program of students like Andrea<br/>\nwith attractive in-school electives, giving them an<br/>\nincentive to remain at home and evade standard curriculums,<br/>\nwhether for religious reasons or out of simple neglect? <br/>\n<br/>\nThere are many controversies - about charter schools,<br/>\nvouchers, federal aid, private contractors or home<br/>\nschooling - where lines between public and private<br/>\neducation have become fuzzy. The reason is that there is no<br/>\nconsensus about how private education, whether in<br/>\ninstitutions or in homes, should be regulated. While<br/>\naccountability in public education grows, so do<br/>\nquasi-private options - like home schooling - with little<br/>\naccountability. That contradiction has yet to be addressed.<br/>\n<br/>\n<br/>\nE-mail: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:rrothstein@...\">rrothstein@...</a>.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.nytimes.com/2002/01/02/education/02LESS.html?ex=1011004659&ei=1&\">http://www.nytimes.com/2002/01/02/education/02LESS.html?ex=1011004659&ei=1&</a><br/>\nen=c942e99c962bbdb5</div>","specialLinks":[]}],"prevTopicId":30638,"nextTopicId":30667}}