{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"&quot;success&quot; (was my kid)","postDate":"1075736246","msgId":90092,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyOC4zYTk3NzAwNy4yZDRmYzhiNkBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":90091,"nextInTime":90093,"topicId":90092,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/2/04 1:03:07 AM, pamsoroosh@mac.com writes: ","messageBody":"<div id=\"ygrps-yiv-595792727\">In a message dated 2/2/04 1:03:07 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pamsoroosh@...\">pamsoroosh@...</a> writes:<br/>\n<br/>\n&lt;&lt; You know what? That concept of &quot;succeeding&quot; in life -- is the cause of <br/>\nSO much unhappiness and needless worry. Life isn&#39;t a contest or a <br/>\nproject you can win or succeed at - it is an experience. &gt;&gt;<br/>\n<br/>\nAnd the definition of success changes slowly and surely.  <br/>\n<br/>\nI&#39;ve just finished reading Sense and Sensibility, a two-hundred year old <br/>\nnovel, which can&#39;t help but be moralistic and steeped in the cultural expectations <br/>\nof the time.<br/>\n<br/>\nThe writing was irritating.   And I thought it would never end, when suddenly <br/>\nlast night it ended, and I discovered that the last &lt;1/3 of the book was <br/>\nbackground, source material, reviews from when the book was new, etc.   There were <br/>\nmini-sermons there, and instructional stories (I read one from The Parents <br/>\nCompanion ?) and though there was a definite idea of success, it wasn&#39;t today&#39;s. <br/>\n It was as oppressive and as difficult to achieve, but just different.<br/>\n<br/>\nThere were times in the Middle Ages when, much as in India with the caste <br/>\nsystem, success was accepting your lot in life gratefully and piously, because <br/>\nGod knew what he was doing, and to wish for more or different was blasphemous <br/>\nand ungrateful.<br/>\n<br/>\nNow we&#39;re in a culture where accepting less than everything is considered by <br/>\nsome to be lazy and a sign of low intelligence.   If someone swims but doesn&#39;t <br/>\nwant to compete, that&#39;s a flaw.  If someone competes but doesn&#39;t want to <br/>\ntrade up for a better coach and national competition, must be something wrong with <br/>\nher.  If someone&#39;s in a rock band and is happy to play locally and go home <br/>\nevery night, he has no passion or drive or confidence.<br/>\n<br/>\nWe&#39;re stuck there.   But we don&#39;t have to let it sweep us away in its waves <br/>\nof prl homelife) and failure for thousands.   &quot;Settling&quot; has become a bad word.<br/>\n<br/>\nSo if we&#39;re going to discuss and maybe even live by a philosophy that <br/>\ninvolves stepping off those conveyor belts, we need to consider our own definitions <br/>\nof success.   Some unschoolers do say &quot;I&#39;d like to make sure he could slip <br/>\nright back into school without trouble if he needed to.&quot;   That&#39;s not a viable <br/>\ngoal, really.  There are a few kids with remarkably good handwriting and early <br/>\nreading who could probably do it!  There are more who wouldn&#39;t last a day <br/>\nwithout balking at the doofy assignments and their lack of freedom to go take a leak <br/>\nwithout a written permit.<br/>\n<br/>\nInteresting topic, but not an easy topic.  <br/>\n<br/>\nAt this snapshot moment I feel a sense of success because Kirby is trusted <br/>\nand trustworthy and he&#39;s not afraid of other people, neither adults nor kids, <br/>\nnot authority figures or crazy homeless guys who put their arm around him and <br/>\nfeel his hair admiringly. (Well there was only one of the latter, but I already <br/>\nhad my sentence structure going with plurals.  &lt;g&gt;)<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":89977,"nextTopicId":90093}}