{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":9,"messages":[{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Apology was Opportunites for Experience (Was Book, Reading etc.)","postDate":"1118903939","msgId":22489,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PGQ4cWc0aSsya2xqQGVHcm91cHMuY29tPg=="},"prevInTopic":22487,"nextInTopic":0,"prevInTime":22488,"nextInTime":22490,"topicId":22452,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1678636016\">&lt;&lt;&lt;&lt;&lt;I really don&#39;t think that is what I was doing at all.  They&#39;ve <br/>\nexpressed and I&#39;ve &quot;read&quot; in them some needs that I feel I am <br/>\nstumbling in meeting and I was asking for some suggestions and <br/>\nencouragement.  That&#39;s neither desperately and dramatically urgent, <br/>\nnor is it manufactured drama, but it&#39;s important enough to us to be <br/>\nworth spending time to solve.&gt;&gt;&gt;<br/>\n<br/>\nI&#39;m so very sorry Nanci, I sure didn&#39;t mean to minimize your concerns or<br/>\nissues, although now I see that is how it came out. <br/>\n<br/>\nFar from intending that, I was trying to offer some praise and encourage to<br/>\nyou to appreciate yourself for all the good things you are clearly already<br/>\ndoing. Thanks for the gentle redirection of thought.<br/>\n<br/>\nI hope the new Unschooling group you found works out.<br/>\n<br/>\nRobyn L. Coburn <br/>\n<br/>\n-- <br/>\nNo virus found in this outgoing message.<br/>\nChecked by AVG Anti-Virus.<br/>\nVersion: 7.0.323 / Virus Database: 267.7.5/18 - Release Date: 6/15/2005</div>","specialLinks":[]},{"userId":67247159,"authorName":"Nanci K.","from":"&quot;Nanci K.&quot; &lt;aisliin@...&gt;","profile":"aisliin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Opportunites for Experience (Was Book, Reading etc.)","postDate":"1118880722","msgId":22487,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQ4cWc0aSsya2xqQGVHcm91cHMuY29tPg=="},"prevInTopic":22485,"nextInTopic":22489,"prevInTime":22486,"nextInTime":22488,"topicId":22452,"numMessagesInTopic":0,"msgSnippet":"... Does it have to be a situation of desperate urgency to be worthy of thinking about or discussing or asking questions about? ... I really don t think that","messageBody":"<div id=\"ygrps-yiv-69171744\"><blockquote><span title=\"ireply\">&gt; This was another post where I kept waiting for the problem to be <br/>\n&gt;revealed.<br/>\n&gt; All I saw was that they are hoping for some more friends, but it <br/>\n&gt;didn&#39;t sound like a scenario of desperate urgency. <br/>\n<br/>\n </span></blockquote>Does it have to be a situation of desperate urgency to be worthy of <br/>\nthinking about or discussing or asking questions about?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Life can be allowed to be simple and good and free of drama, <br/>\n&gt;without us having to create a fear of impending doom or wondering <br/>\n&gt;if it is too good to be true.<br/>\n<br/>\n </span></blockquote>I really don&#39;t think that is what I was doing at all.  They&#39;ve <br/>\nexpressed and I&#39;ve &quot;read&quot; in them some needs that I feel I am <br/>\nstumbling in meeting and I was asking for some suggestions and <br/>\nencouragement.  That&#39;s neither desperately and dramatically urgent, <br/>\nnor is it manufactured drama, but it&#39;s important enough to us to be <br/>\nworth spending time to solve.<br/>\n<br/>\nNanci K.</div>","specialLinks":[]},{"userId":67247159,"authorName":"Nanci K.","from":"&quot;Nanci K.&quot; &lt;aisliin@...&gt;","profile":"aisliin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Opportunites for Experience","postDate":"1118873087","msgId":22485,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQ4cThsditibGdmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDUwNjE1MDA0MDE4LlFRT1IxNzE0MC5tdGExMC5hZGVscGhpYS5uZXRAU3VnYXI+"},"prevInTopic":22474,"nextInTopic":22487,"prevInTime":22484,"nextInTime":22486,"topicId":22452,"numMessagesInTopic":0,"msgSnippet":"... Thanks for that.  It s reassuring to know that there are other kids and families for whom that kind of lifestyle works. ... We ve not had good results from","messageBody":"<div id=\"ygrps-yiv-1501282533\"><blockquote><span title=\"ireply\">&gt; Your kids sound a lot like mine.  Most of the time they are <br/>\n&gt;content to do the at-home things we do all the time.  .....But once <br/>\n&gt;in a while they seem a bit restless and in need of more interaction <br/>\n&gt;with other kids.  <br/>\n<br/>\n </span></blockquote>Thanks for that.  It&#39;s reassuring to know that there are other kids <br/>\nand families for whom that kind of lifestyle works.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;It can be hard (outside my comfort level) to reach out to others <br/>\n&gt;sometimes but I have always been glad that we made the effort when<br/>\n&gt; we did, even if it didn&#39;t work out that we made a new friend each <br/>\n&gt;time.  <br/>\n<br/>\n </span></blockquote>We&#39;ve not had good results from trying to meet people from our only <br/>\nlocal homeschooling list, mainly because of lack of understanding, <br/>\npatience or flexibility re: high functioning autism.  It makes me <br/>\nvery leery of that list.  I had thought about posting something on <br/>\nthe board at the county library as an option, and I have posted to a <br/>\nlocal homeschooling register site with no results to speak of after <br/>\na couple of years.  I just accidentally found out about a group of <br/>\nunschoolers meeting on Fridays at the gym of the town community <br/>\ncenter to play and we&#39;re going to try that group next.  Hopefully <br/>\ngood things will come from that.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  I am wondering if the need for more friends is truly theirs or is <br/>\n&gt;it something that you are feeling that they would benefit from?  <br/>\n<br/>\n </span></blockquote>Good question.  Well, Thomas (8.5) has specifically asked for more <br/>\nfriends recently.  He just met a little girl last weekend (one of <br/>\nthe Friday group at the community center) who he instantly fell in <br/>\nlove with though, so he&#39;s excited about that.  He keeps talking <br/>\nabout (sigh) Mahhd-ah-liine (the little girl, Madeline) in this sing <br/>\nsongey voice.  He&#39;s always been a sucker for girls.  <br/>\n<br/>\nAlex (7) I am concerned is getting really quirky because his <br/>\n(almost) only friend and playmate is his autistic brother Thomas.  <br/>\nHe&#39;s picked up problem behaviors that we&#39;ve been trying to help his <br/>\nbrother to overcome, as well as typically autistic self soothing <br/>\nstims like rocking, humming and hand flapping.  Alex also <br/>\nspecifically asks for breaks from his intense and often overbearing <br/>\nbrother.  When we go on playdates he often uses the time when Thomas <br/>\nis playing with another child to go off on his own or to visit with <br/>\nthe adults.  I wonder if he would be more inclined to make friends <br/>\nof his own, something he seems to have no interest in, if he didn&#39;t <br/>\nfeel such a pressing need to get a break from his brother.  He plays <br/>\nwell with other children, but doesn&#39;t ask for them, seems to be able <br/>\nto take or leave them when they are there although he&#39;s eager to go <br/>\nto playdates when we ask him.  In fact he is agreeable to any other <br/>\nevent or activity we ask him about but often doesn&#39;t like them after <br/>\nhe arrives.  I am processing as I write, and thinking that maybe <br/>\nwhat&#39;s really going on is that Alex doesn&#39;t know what he wants right <br/>\nnow and just says yes to everything so that he can try it out and <br/>\nsee how it feels.  It&#39;s me that the uncertainty bothers.  It will be <br/>\nintresting to see where he settles in his interests and social <br/>\nproclivities.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But you don&#39;t need to do organized things.  It might make you look <br/>\n&gt;like a better homeschool mom to outsiders if your kids were  <br/>\n&gt;involved in lots of outside activities, but it isn&#39;t necessarily <br/>\n&gt;what will make your kids happy.<br/>\n<br/>\n </span></blockquote>I&#39;m not concerned with what others think or how I look to them.  <br/>\nJust ask my long suffering extended family (haha)  :-P  I am mainly <br/>\ntrying to help them meet other people and saw the organized <br/>\nactivities as possible venues for that.  Even if we didn&#39;t stick <br/>\nwith them we might meet some cool people, Alex could maybe get a <br/>\nbreak from Thomas and be involved in something that didn&#39;t concern <br/>\nThomas at all, which would be a relief to Alex I know, and Thomas <br/>\ncould meet more friends and take more focus away from his quietly <br/>\noverwhelmed brother.  I think I am going to need to look for other <br/>\navenues though.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So do mine.  Isn&#39;t it great that they can be at whatever emotional <br/>\n&gt;level they are naturally without feeling the need to keep up with <br/>\n&gt;other kids their age?<br/>\n<br/>\n </span></blockquote>Yes!  I love that they are free to be themselves and so confident.  <br/>\nThey don&#39;t worry about what people think of them or about fitting in <br/>\nwith the crowd.  They never express concern about being like or <br/>\nunlike others.  I didn&#39;t mean it was a problem for me when I <br/>\nsaid &quot;maybe the problem is&quot;  I meant maybe it was part of the <br/>\nproblem with finding things they would like to do or that suit <br/>\nthem.  <br/>\n<br/>\nNanci K.</div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] Re: Opportunites for Experience (Was Book, Reading etc.)","postDate":"1118805803","msgId":22474,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PGQ4bnNwdCt0bW05QGVHcm91cHMuY29tPg=="},"prevInTopic":22471,"nextInTopic":22485,"prevInTime":22473,"nextInTime":22475,"topicId":22452,"numMessagesInTopic":0,"msgSnippet":" This was another post where I kept waiting for the problem to be","messageBody":"<div id=\"ygrps-yiv-1481214244\">&lt;&lt;&lt;&lt; I should just make &quot;They are Happy&quot; my <br/>\nmantra I guess, to remind me where to focus.&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nThis was another post where I kept waiting for the problem to be revealed.<br/>\nAll I saw was that they are hoping for some more friends, but it didn&#39;t<br/>\nsound like a scenario of desperate urgency. You are supporting your<br/>\nchildren&#39;s needs and individual preferences, by your own description. <br/>\n<br/>\nLife can be allowed to be simple and good and free of drama, without us<br/>\nhaving to create a fear of impending doom or wondering if it is too good to<br/>\nbe true. Every ointment doesn&#39;t have to contain flies. Time to start<br/>\ntrusting yourself, as you seem to already be trusting your kids. :) <br/>\n<br/>\nRobyn L. Coburn<br/>\n<br/>\n-- <br/>\nNo virus found in this outgoing message.<br/>\nChecked by AVG Anti-Virus.<br/>\nVersion: 7.0.323 / Virus Database: 267.7.3/15 - Release Date: 6/14/2005</div>","specialLinks":[]},{"userId":168245244,"authorName":"Laura Moseley","from":"Laura Moseley &lt;lsam400803@...&gt;","profile":"lsam400803","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Opportunites for Experience (Kids don&#39;t like groups)","postDate":"1118798738","msgId":22471,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUwNjE1MDEyNTM4LjYxMjk1LnFtYWlsQHdlYjUxNzAzLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDIwMDUwNjE0MjIzODExLjMzODQucW1haWxAd2ViNTE5MDcubWFpbC55YWhvby5jb20+"},"prevInTopic":22467,"nextInTopic":22474,"prevInTime":22470,"nextInTime":22472,"topicId":22452,"numMessagesInTopic":0,"msgSnippet":"My ds is 15 and only likes groups of 2 or 3, he gets it from his Nana. lol  We have found 2 other guys his age and they bowl, have book discussions, play","messageBody":"<div id=\"ygrps-yiv-286140992\">My ds is 15 and only likes groups of 2 or 3, he gets it from his Nana. lol  We have found 2 other guys his age and they bowl, have book discussions, play Magic, have LAN parties, talk on AIM, they went to a homeschool prom.  This has worked out great and I think they may end up life long friends who can depend on each other and that is very important to have someone who you can talk to and lean on if need be.  I never put him in a class situation that just does not work with him.  He also likes to be with people who are older than he is.  I think because he is not so into the &quot;teenage&quot; thing.  He thinks its silly.<br/>\n <br/>\nAlso I have learned to listen to my ds and I don&#39;t mean just hear, I mean watch actions/expressions so on.  I can tell about 90% of the time when he is not comfortable and does not want to be, go or stay somewhere and I try to respect that.  It is hard because I am a control freak and I think things should be my way because that is best,  I am learning to let that go.<br/>\n <br/>\nI don&#39;t know if this helps, but I just thought I would through it in.<br/>\n <br/>\nLaura<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":177721839,"authorName":"Angela S.","from":"&quot;Angela S.&quot; &lt;game-enthusiast@...&gt;","profile":"autonomousangela","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] Opportunites for Experience (Was Book, Reading etc.)","postDate":"1118796021","msgId":22467,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUwNjE1MDA0MDE4LlFRT1IxNzE0MC5tdGExMC5hZGVscGhpYS5uZXRAU3VnYXI+","inReplyToHeader":"PDIwMDUwNjE0MjIzODExLjMzODQucW1haWxAd2ViNTE5MDcubWFpbC55YWhvby5jb20+"},"prevInTopic":22464,"nextInTopic":22471,"prevInTime":22466,"nextInTime":22468,"topicId":22452,"numMessagesInTopic":0,"msgSnippet":"Hi Nanci, ... And you wrote: They ... Your kids sound a lot like mine.  Most of the time they are content to do the at-home things we do all the time.  For us,","messageBody":"<div id=\"ygrps-yiv-143681433\">Hi Nanci,<br/>\nYou wrote:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; At this time the only thing they are interested in is<br/>\n&gt; 1-2 dates a week to get together and play with a<br/>\n&gt; friend or two at home or elsewhere and a weekly<br/>\n&gt; library trip.  They are happy to stay home the rest of<br/>\n&gt; the time, playing inside and outside with us and each<br/>\n&gt; other.  <br/>\n<br/>\n </span></blockquote>And you wrote:<br/>\n<br/>\nThey<br/>\n<blockquote><span title=\"ireply\"> &gt; have said they want more friends, which I am trying to<br/>\n&gt; facilitate, but it&#39;s hard to meet families when we&#39;re<br/>\n&gt; home so much.  <br/>\n<br/>\n </span></blockquote>Your kids sound a lot like mine.  Most of the time they are content to do<br/>\nthe at-home things we do all the time.  For us, its board games, reading to<br/>\nthem, riding our horse and hanging out at the barn, swimming in the pool,<br/>\nplaying on the computer, watching TV, etc.  But once in a while they seem a<br/>\nbit restless and in need of more interaction with other kids.  <br/>\n<br/>\nIn the past I have arranged play dates via a local home school list.  I have<br/>\norganized wiffle ball games and it worked out well because only a handful of<br/>\nkids came and that was the perfect amount for us.  Is there some interest<br/>\nthat they have that you can use to help them meet other kids with similar<br/>\ninterests?  Or maybe ask if there are kids out there on a local homeschool<br/>\nlist of similar ages who might like to come jump on your trampoline or<br/>\nsomething like that.  It can be hard (outside my comfort level) to reach out<br/>\nto others sometimes but I have always been glad that we made the effort when<br/>\nwe did, even if it didn&#39;t work out that we made a new friend each time.  If<br/>\nthe kids seem to want to meet some new friends, I remind them that once upon<br/>\na time the friends they have now were strangers and if we hadn&#39;t made the<br/>\neffort to get to know them, we would have missed out on a great friendship. <br/>\n<br/>\nThe most recent friends my kids have made are kids who ride at the barn we<br/>\nboard at.  They are both public schooled kids but they all share an interest<br/>\nin horses and that is what matters to the kids.  We have the flexibility to<br/>\nwork around their school schedules and get together when it works for them.<br/>\nAnd summer vacation starts this week so we should be able to see them more,<br/>\nvery soon.<br/>\n<br/>\nFor the last year or so my kids were content with having one close friend.<br/>\nI sometimes felt like it would benefit them to make more friends and branch<br/>\nout a little bit but that was my concern and not theirs.  In their own time<br/>\nthey eventually found the need to branch out and make more friends.  I am<br/>\nwondering if the need for more friends is truly theirs or is it something<br/>\nthat you are feeling that they would benefit from?  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; They will make exceptions to spend an hour or two at a<br/>\n&gt; fair for example, but then they are done and want to<br/>\n&gt; go someplace quiet.  They can handle anonymity in a<br/>\n&gt; large crowd better than they handle a group of 10 or<br/>\n&gt; 30 as well.<br/>\n<br/>\n </span></blockquote>My kids are also like that.  They can handle a fair much better than a<br/>\nbirthday party with a dozen kids with expectations that they participate.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Both my boys dislike class type settings, taking<br/>\n&gt; &quot;direction&quot; and so forth.  Even when we play board<br/>\n&gt; games at home we usually toss the rules and make up<br/>\n&gt; our own.<br/>\n<br/>\n </span></blockquote>That&#39;s awesome and creative.<br/>\n<br/>\n  They love fantasy play, athletic games but<br/>\n<blockquote><span title=\"ireply\"> &gt; not &quot;sports&quot; per se, making art, watching movies,<br/>\n&gt; cooking, books, games, music, dance, puzzles, their<br/>\n&gt; trampoline, water play, the beach, the park, camping<br/>\n&gt; and other things.<br/>\n<br/>\n </span></blockquote>Not everyone is cut out for organized sports but as long as they feel their<br/>\nlife is rich and rewarding, that&#39;s fine.<br/>\n<br/>\n  The trouble is that I have yet to<br/>\n<blockquote><span title=\"ireply\"> &gt; match up any of these things with any activities, or<br/>\n&gt; to offer things that may expand their world/interests<br/>\n&gt; in which they have shown the least bit of interest.<br/>\n<br/>\n </span></blockquote>But you don&#39;t need to do organized things.  It might make you look like a<br/>\nbetter homeschool mom to outsiders if your kids were involved in lots of<br/>\noutside activities, but it isn&#39;t necessarily what will make your kids happy.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m worried that I am not offering enough, or the<br/>\n&gt; right things, or falling down on the job as a<br/>\n&gt; homeschooling/unschooling parent and could use some<br/>\n&gt; encouragement here.<br/>\n<br/>\n </span></blockquote>I would continue to offer things that you think might interest them and be<br/>\nprepared to accept a &quot;no&quot; if that is how they feel.  I felt the same way<br/>\nmyself for a long time and then I offered horse back riding lessons and that<br/>\nwas the beginning of a new found interest/love for all of us.  It&#39;s been an<br/>\namazing ride.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Maybe my problem is that my kids just seem emotionally<br/>\n&gt; young, compared to other kids (schooled kids?)  <br/>\n<br/>\n </span></blockquote>So do mine.  Isn&#39;t it great that they can be at whatever emotional level<br/>\nthey are naturally without feeling the need to keep up with other kids their<br/>\nage?<br/>\n<br/>\nShould<br/>\n<blockquote><span title=\"ireply\"> &gt; I just shut up and be happy that they are still so<br/>\n&gt; young at heart and their needs are so uncomplicated?<br/>\n<br/>\n </span></blockquote>I think being happy that your kids are happy is a good idea.  No need to<br/>\nworry if they are happy and content.<br/>\n<br/>\nAngela S.]<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Game-enthusiast@...\">Game-enthusiast@...</a></div>","specialLinks":[]},{"userId":67247159,"authorName":"Nanci K.","from":"&quot;Nanci K.&quot; &lt;aisliin@...&gt;","profile":"aisliin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Opportunites for Experience (Was Book, Reading etc.)","postDate":"1118795389","msgId":22464,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQ4bnNwdCt0bW05QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDFmOS5iYmU2MjAyLjJmZTBjNmFkQGFvbC5jb20+"},"prevInTopic":22457,"nextInTopic":22467,"prevInTime":22463,"nextInTime":22465,"topicId":22452,"numMessagesInTopic":0,"msgSnippet":"... end  date ? They don t like that stuff.  (I don t either, much. ... Not precisely.  Hubby and I don t care for those much either and it s likely our","messageBody":"<div id=\"ygrps-yiv-286116811\"><blockquote><span title=\"ireply\">&gt; Do you mean &quot;organized group activities with a schedule and an <br/>\n </span></blockquote>end  date&quot;? They don&#39;t like that stuff.  (I don&#39;t either, much.  <br/>\n<blockquote><span title=\"ireply\"> &gt;Marty hates  it.)<br/>\n<br/>\n<br/>\n </span></blockquote>Not precisely.  Hubby and I don&#39;t care for those much either and <br/>\nit&#39;s likely our opinions are either genetically or environmentally <br/>\ninfluencing the boys.  I guess I mean activities outside of home, <br/>\nwhere they can meet and interact with other kids and with adults who <br/>\nare not us.  Fun things for them to try and places to check out.  I <br/>\nam not trying to get rid of them or wanting to spend less time with <br/>\nthem, just concerned that they don&#39;t see much of others.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; These things expand their world and interests:<br/>\n<br/>\n </span></blockquote>Yeah...I can hear that in their expanding questions and discussions <br/>\nwith us.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; They&#39;re happy!!<br/>\n&gt; Lots of those kids with the scheduled activities and near <br/>\n </span></blockquote>neighbors are  very <br/>\n<blockquote><span title=\"ireply\"> &gt; UNhappy.<br/>\n&gt; Your kids are happy.<br/>\n<br/>\n </span></blockquote>OK, deep breathing.  I do know this, about overscheduled kids, and I <br/>\nhear from friends who visit (kids *and* their parents) about how <br/>\nlovely, quiet, fun, interesting, fill-in-the-positive-blank our <br/>\nwoods are compared to town.  I should just make &quot;They are Happy&quot; my <br/>\nmantra I guess, to remind me where to focus.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Bring in more movies, food to cook, new music, more puzzles, new <br/>\n </span></blockquote>water play  equipment and different beaches.<br/>\n<br/>\nActually we do all of this regularly, but I didn&#39;t think of it as <br/>\nexpanding their horizons.  We just got new art supplies, 6 new <br/>\npuzzles, tried some new recipes, got some new music, and borrowed <br/>\nsome cool movies/shows from the library this week.  I guess more of <br/>\nthe same is in order is what they are telling me.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; -=- and be happy that they are still so<br/>\n&gt; young at heart and their  needs are so uncomplicated?-=-<br/>\n&gt; yes but be with them, not shut up (Unless the noise you&#39;re talking <br/>\n </span></blockquote>about is  pressuring them to want to be out and do differently and <br/>\nwish for  differences.  If that&#39;s the noise, then I take back my <br/>\nfirst &quot;no.&quot;)<br/>\n<blockquote><span title=\"ireply\"> &gt;  <br/>\n&gt; Sandra<br/>\n<br/>\n </span></blockquote>LOL  No, I just do that in my own head and with my hubby, oh and <br/>\nhere of course, where it belongs.  I don&#39;t burden the kids with my <br/>\nbaggage, or I try not to anyway.  I gotta get off the computer now <br/>\nthough, because one of my boys just discovered a passion for <br/>\ncartooning and wants me to write the dialogue for the comic book <br/>\nhe&#39;s making for his dad for Father&#39;s Day, and the other game loving <br/>\nson is helping me design a roughly Clue based game for Daddy called <br/>\nPirate Treasure and I need to make cards and game pieces and stuff <br/>\nwith him now that we have basic game play worked out.  Plus I have a <br/>\npile of books on bigfoot to read to a newly obsessed child and a <br/>\ncamping trip to plan somewhere closeby to &quot;look for Bigfoot.&quot;<br/>\n<br/>\nThanks Sandra.<br/>\n<br/>\nNanci K.</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Opportunites for Experience (Was Book, Reading etc.)","postDate":"1118792877","msgId":22457,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFmOS5iYmU2MjAyLjJmZTBjNmFkQGFvbC5jb20+"},"prevInTopic":22452,"nextInTopic":22464,"prevInTime":22456,"nextInTime":22458,"topicId":22452,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/14/2005 4:39:09 PM Mountain Daylight Time, aisliin@yahoo.com writes: -=-The  trouble is that I have yet to match up any of these things","messageBody":"<div id=\"ygrps-yiv-136766125\">In a message dated 6/14/2005 4:39:09 PM Mountain Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:aisliin@...\">aisliin@...</a> writes:<br/>\n<br/>\n-=-The  trouble is that I have yet to<br/>\nmatch up any of these things with any  activities. . .-=-<br/>\n<br/>\n<br/>\nThose things are in and of themselves activities.<br/>\n <br/>\n-=- They love fantasy play, athletic games but<br/>\nnot &quot;sports&quot; per se,  making art, watching movies,<br/>\ncooking, books, games, music, dance, puzzles,  their<br/>\ntrampoline, water play, the beach, the park, camping<br/>\nand other  things-=-<br/>\n <br/>\nThat&#39;s what activities look like!<br/>\n<br/>\nDo you mean &quot;organized group activities with a schedule and an end  date&quot;?<br/>\nThey don&#39;t like that stuff.  (I don&#39;t either, much.  Marty hates  it.)<br/>\n <br/>\n-=-, or to offer things that may expand their world/interests<br/>\nin which  they have shown the least bit of interest.-=-<br/>\n <br/>\nThese things expand their world and interests:<br/>\n <br/>\nfantasy play, athletic games but<br/>\nnot &quot;sports&quot; per se, making art,  watching movies,<br/>\ncooking, books, games, music, dance, puzzles,  their<br/>\ntrampoline, water play, the beach, the park, camping<br/>\nand other  things<br/>\n <br/>\n-=-They are happy to stay home the rest of<br/>\nthe time, playing inside and  outside with us and each<br/>\nother.  They don&#39;t see any neighbors as we are  in the<br/>\nmiddle of a forest and our driveway is nearly a mile<br/>\nthrough the  woods to a dead end private road.-=-<br/>\n <br/>\nThey&#39;re happy!!<br/>\nLots of those kids with the scheduled activities and near neighbors are  very <br/>\nUNhappy.<br/>\nYour kids are happy.<br/>\n <br/>\n-=-They have hinted at wanting more stuff<br/>\nto do but shown no interest in  what&#39;s been offered. -=-<br/>\n <br/>\nBring in more movies, food to cook, new music, more puzzles, new water play  <br/>\nequipment and different beaches.<br/>\n <br/>\n-=-I&#39;m worried that I am not offering enough, or the<br/>\nright things, or  falling down on the job as a<br/>\nhomeschooling/unschooling parent and could use  some<br/>\nencouragement here.-=-<br/>\n <br/>\n_<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/deschooling_\">http://sandradodd.com/deschooling_</a> (<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/deschooling)\">http://sandradodd.com/deschooling)</a> <br/>\nlots of ideas there, and in links from there.<br/>\n_<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/strewing/_\">http://sandradodd.com/strewing/_</a> (<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/strewing/)\">http://sandradodd.com/strewing/)</a> <br/>\n <br/>\nif the links don&#39;t work, clean junk off the ends until they do.<br/>\n <br/>\n-=-Should<br/>\nI just shut up-=-<br/>\n <br/>\nno<br/>\n <br/>\n-=- and be happy that they are still so<br/>\nyoung at heart and their  needs are so uncomplicated?-=-<br/>\n <br/>\nyes<br/>\nbut be with them, not shut up<br/>\n(Unless the noise you&#39;re talking about is  pressuring them to want to be out <br/>\nand do differently and wish for  differences.  If that&#39;s the noise, then I <br/>\ntake back my first &quot;no.&quot;)<br/>\n <br/>\nSandra<br/>\n <br/>\n <br/>\n <br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":67247159,"authorName":"Nanci Kuykendall","from":"Nanci Kuykendall &lt;aisliin@...&gt;","profile":"aisliin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"[AlwaysLearning] Opportunites for Experience (Was Book, Reading etc.)","postDate":"1118788691","msgId":22452,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUwNjE0MjIzODExLjMzODQucW1haWxAd2ViNTE5MDcubWFpbC55YWhvby5jb20+","inReplyToHeader":"PDExMTg3NjEzMDEuMjEyMy41ODY1NS5tMjZAeWFob29ncm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":22457,"prevInTime":22451,"nextInTime":22453,"topicId":22452,"numMessagesInTopic":0,"msgSnippet":"... I think my topic/question got hijacked by a (ahem) confused person, to put it nicely.  A lot of it was fascinating stuff regarding reading and learning, ","messageBody":"<div id=\"ygrps-yiv-946667789\"><blockquote><span title=\"ireply\">&gt;It will look like taking them places and giving them<br/>\n&gt;opportunities to experience things we think they<br/>\n&gt;might enjoy. (Give them opportunities to expand <br/>\n&gt;their interests.)<br/>\n<br/>\n </span></blockquote>I think my topic/question got hijacked by a (ahem)<br/>\nconfused person, to put it nicely.  A lot of it was<br/>\nfascinating stuff regarding reading and learning,<br/>\nmostly what came from other folks on the list, not<br/>\nso...disturbed.<br/>\n<br/>\nTo get back on track for my own dilema, the above<br/>\nquote (sorry I didn&#39;t get who said it) is where I am<br/>\nhaving difficulty at this time.  The question about<br/>\nthe library program was an outgrowth of what I now<br/>\nrealize is more an issue of finding things to do in<br/>\ngeneral.  It&#39;s not so much availability or access, as<br/>\nwe can make that happen despite not living &quot;in town&quot;<br/>\nas I&#39;m sure others here who live in the country can<br/>\nattest.  The problem I am running into is lack of<br/>\ninterest from the kids.  They both hate or are<br/>\nadversely affected by crowds and busy/overstimulating<br/>\nenvironments.  More than 8 people makes them squirmily<br/>\nuncomfortable, just because of personality/temperment<br/>\nand other factors.  We have not always lived out of<br/>\ntown, and they have been around malls, fairs, and<br/>\nother public events/places plenty of times.  They are<br/>\nnot uncomfortable due to lack of crowd experience,<br/>\nthey just don&#39;t like it very often or for very long. <br/>\nThey will make exceptions to spend an hour or two at a<br/>\nfair for example, but then they are done and want to<br/>\ngo someplace quiet.  They can handle anonymity in a<br/>\nlarge crowd better than they handle a group of 10 or<br/>\n30 as well.<br/>\n<br/>\nBoth my boys dislike class type settings, taking<br/>\n&quot;direction&quot; and so forth.  Even when we play board<br/>\ngames at home we usually toss the rules and make up<br/>\nour own.  They love fantasy play, athletic games but<br/>\nnot &quot;sports&quot; per se, making art, watching movies,<br/>\ncooking, books, games, music, dance, puzzles, their<br/>\ntrampoline, water play, the beach, the park, camping<br/>\nand other things.  The trouble is that I have yet to<br/>\nmatch up any of these things with any activities, or<br/>\nto offer things that may expand their world/interests<br/>\nin which they have shown the least bit of interest.<br/>\n<br/>\nAt this time the only thing they are interested in is<br/>\n1-2 dates a week to get together and play with a<br/>\nfriend or two at home or elsewhere and a weekly<br/>\nlibrary trip.  They are happy to stay home the rest of<br/>\nthe time, playing inside and outside with us and each<br/>\nother.  They don&#39;t see any neighbors as we are in the<br/>\nmiddle of a forest and our driveway is nearly a mile<br/>\nthrough the woods to a dead end private road.  They<br/>\nhave said they want more friends, which I am trying to<br/>\nfacilitate, but it&#39;s hard to meet families when we&#39;re<br/>\nhome so much.  They have hinted at wanting more stuff<br/>\nto do but shown no interest in what&#39;s been offered. <br/>\nI&#39;m worried that I am not offering enough, or the<br/>\nright things, or falling down on the job as a<br/>\nhomeschooling/unschooling parent and could use some<br/>\nencouragement here.<br/>\n<br/>\nMaybe my problem is that my kids just seem emotionally<br/>\nyoung, compared to other kids (schooled kids?)  Should<br/>\nI just shut up and be happy that they are still so<br/>\nyoung at heart and their needs are so uncomplicated?<br/>\n<br/>\nNanci K.</div>","specialLinks":[]}],"prevTopicId":22483,"nextTopicId":22491}}