{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] driving; sacrifice","postDate":"1125189045","msgId":108015,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYyLjViYzkwNzhmLjMwNDI1ZmI1QGFvbC5jb20+"},"prevInTopic":108011,"nextInTopic":0,"prevInTime":108014,"nextInTime":108016,"topicId":107994,"numMessagesInTopic":0,"msgSnippet":"... I believe there is a sacredness. People are embarrassed by the idea of the sacred in everyday life.   They reject it, often, unless it s part of a","messageBody":"<div id=\"ygrps-yiv-1018217318\">In a message dated 8/26/05 10:33:56 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:contact@...\">contact@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Is there sacredness hidden somewhere in sacrifice? Is sacrifice one of <br/>\n&gt; those words that has become corrupted? I like the idea of &#39;giving&#39; and &#39;letting <br/>\n&gt; go&#39; embedded in sacrifice. I feel that without these does perhaps the notion <br/>\n&gt; of sacrifice becomes a burden for all?<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I believe there is a sacredness.<br/>\nPeople are embarrassed by the idea of &quot;the sacred&quot; in everyday life.   They <br/>\nreject it, often, unless it&#39;s part of a specific, brief ceremony (grace before <br/>\na meal; Friday night candles and formal meal; bowing to a family altar).    <br/>\nThe idea that making a bed for someone could be about love and preparation of a <br/>\nspecial place to rest and dream seems too mushy, I think.<br/>\n<br/>\nI sacrifice my peace to allow my boys to drive away in vehicles powerful to <br/>\nkill them and others.<br/>\nMy husband sacrifices money and &quot;power&quot; to let them use two of his cars as <br/>\nthough they were theirs.   <br/>\n<br/>\nIt&#39;s a loving sacrifice, but it&#39;s a choice we&#39;ve made.   If it&#39;s not our <br/>\nchoice, it&#39;s not really a sacrifice.   Without choice, we would&#39;ve been just trod <br/>\nupon, and robbed, and abused.<br/>\n<br/>\nThe notion of valuing generosity or inconvenience or sharing or compromise in <br/>\nterms of something spiritual is <br/>\n1) beyond some people&#39;s understanding<br/>\n2) embarrassing to many<br/>\n3) &quot;not in the Bible&quot; (pick your religion, but probably not on the short list <br/>\nof what one &quot;has&quot; to do)<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1675643,"authorName":"Cally Brown","from":"Cally Brown &lt;mjcmbrwn@...&gt;","profile":"cally_marg","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] driving; sacrifice","postDate":"1125179133","msgId":108011,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQzMTBERUZELjUwNTA2MDlAaWh1Zy5jby5uej4=","referencesHeader":"PDE1NC41N2ZlMWM4MS4zMDQxYzExMEBhb2wuY29tPg=="},"prevInTopic":107996,"nextInTopic":108015,"prevInTime":108010,"nextInTime":108012,"topicId":107994,"numMessagesInTopic":0,"msgSnippet":"... We live in the country with an accident prone road between us and the city where my sons work and play. I have always been nervous about this and asked","messageBody":"<div id=\"ygrps-yiv-872859807\"><blockquote><span title=\"ireply\">&gt; It&#39;s a  blessing.   It&#39;s &quot;I want you to come home safely because I <br/>\n&gt; love  you.&quot;<br/>\n<br/>\n </span></blockquote>We live in the country with an accident prone road between us and the <br/>\ncity where my sons work and play. I have always been nervous about this <br/>\nand asked them to let me know when they arrive in town, and when they <br/>\nare leaving - there is no cell phone coverage on much of the road, and <br/>\nespecially on the windy hill part. They resented this at times, and <br/>\ndidn&#39;t always comply but..... in January my 21yo had an accident. The <br/>\npolice &#39;forgot&#39; to ring us, so he was by himself for an hour longer than <br/>\nhe should have been. He is still suffering the physical, emotional and <br/>\nmonetary consequences, which would happen anyway - but I wish I could <br/>\nhave been there with him for that extra hour.<br/>\n<br/>\nNow my kids (21 and 18) text me to let me know they are okay. It&#39;s <br/>\nbecome a bit of a joke, the neurotic mother thing, but serious too. When <br/>\nI went on a 8 hour trip with my 15yo a few weeks ago, I kept dh informed <br/>\nof our progress, and thus the 18yo as well who was with dh. Things went <br/>\na bit wrong and our journey took an extra 4 hours. After 8 1/2 hours I <br/>\ngot a text fron the 21yo who was in town- &#39;aren&#39;t you there yet, are you <br/>\nokay?&#39; - after the mild irritation he sometimes expressed, I hadn&#39;t <br/>\nrealised he was expecting to hear from me!<br/>\n<br/>\nMy 18yo went on a 3 hour drive to another city the other day. the day <br/>\nbefore he went some 14yo @#$%#@**! threw a concrete block off an <br/>\noverbridge and killed someone driving on that same motorway. Ds texted <br/>\nme to say he was ok when he got there. over the next 2 days 2 copycat <br/>\nconcrete throwers did the same thing (no more deaths thank goodness). Ds <br/>\nunderstood that I would be anxious - he was a bit anxious himself!<br/>\n<br/>\nI say to them, it&#39;s not that I don&#39;t trust you, it&#39;s not that I want to <br/>\npoke my nose into your private life, I don&#39;t need to know exactly where <br/>\nyou are or who you&#39;re with, I just love you and want to know you&#39;re <br/>\nsafe. And it seems that not only do they understand now but also they <br/>\nfeel the same about me :-) Well, about the being safe bit - they seem to <br/>\nthink they are entitled to be kept fully informed of where I am, who I&#39;m <br/>\nwith, who I&#39;m talking to on the phone, and to be given reasons why I <br/>\ndidn&#39;t organise visits with friends at a time they can come too....<br/>\n<br/>\nCally</div>","specialLinks":[]},{"userId":163750020,"authorName":"tuckervill2@aol.com","from":"tuckervill2@...","profile":"tuckervill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] driving; sacrifice","postDate":"1125148432","msgId":107996,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NC41N2ZlMWM4MS4zMDQxYzExMEBhb2wuY29tPg=="},"prevInTopic":107994,"nextInTopic":108011,"prevInTime":107995,"nextInTime":107997,"topicId":107994,"numMessagesInTopic":0,"msgSnippet":"In a message dated 8/26/2005 11:33:59 PM Central Standard Time, contact@beverleypaine.com writes: It s a  blessing.   It s I want you to come home safely","messageBody":"<div id=\"ygrps-yiv-1629675093\">In a message dated 8/26/2005 11:33:59 PM Central Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:contact@...\">contact@...</a> writes:<br/>\n<br/>\nIt&#39;s a  blessing.   It&#39;s &quot;I want you to come home safely because I love  you.&quot;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n~~~<br/>\n <br/>\nWhen my mother said it, I never took it as a blessing.  I took it as,  &quot;Don&#39;t <br/>\nget hurt or wreck the car because I don&#39;t need that hassle in my  life.&quot;  Or, <br/>\n&quot;If you mess up you&#39;ll be in trouble!&quot;<br/>\n <br/>\nNow that she&#39;s 67, she really means it as &quot;I don&#39;t have anyone else in my  <br/>\nlife and I don&#39;t want anything to happen to you.&quot;  Better, but still  <br/>\nself-centered.<br/>\n <br/>\nKaren<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":191465758,"authorName":"Beverley Paine","from":"&quot;Beverley Paine&quot; &lt;contact@...&gt;","profile":"beverleypaine1958","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"driving; sacrifice","postDate":"1125116590","msgId":107994,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMzcwMWM1YWFjMCQ2YmZlMDcyMCQxM2ZkYWRjYkB3b3JrYWhvbGljPg==","referencesHeader":"PDExMjUwNzI1NTkuMjI4My40ODg4OC5tMzFAeWFob29ncm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":107996,"prevInTime":107993,"nextInTime":107995,"topicId":107994,"numMessagesInTopic":0,"msgSnippet":"Sandra wrote: It s a blessing.   It s I want you to come home safely because I love you. Thanks for that. It s a lovely way of looking at the be safe","messageBody":"<div id=\"ygrps-yiv-489766745\">Sandra wrote:<br/>\nIt&#39;s a blessing.   It&#39;s &quot;I want you to come home safely because I love you.&quot;<br/>\n<br/>\nThanks for that. It&#39;s a lovely way of looking at the &#39;be safe&#39; statement/request. I find myself requesting more than stating and I guess that&#39;s my problem - I need to let go. Then the words will become a blessing and will gift us all. <br/>\n<br/>\nThomas rolled his brother&#39;s car two weeks after he got his licence (17). The road was left in an appalling condition after roadworks and had no warning or speed restriction signs posted, despite the fact that heavy downpours were forecast. The car landed on it&#39;s wheels on a steep slope a few feet from a 50 foot deep ravine with a rocky creek at the base. No injuries to speak off thankfully. Thomas was travelling slowly when the car began sliding on the road and after examining the crash site carefully we all agree there was nothing he could have done, except been crawling home that night - something a much more experienced driver may have done. Sometimes, it&#39;s only experience - the sort that comes from practice - that helps. But we&#39;re really thankful that Thomas paid close attention when his brother and sister learned to drive, and is an attentive passenger, because it&#39;s those quiet &#39;absorbed&#39; lessons that kept both young men safe that night. <br/>\n<br/>\nThomas has since thanked me for my calmness that night when we went to pick them up from the nearby farm, plus the way I handled the police the next day (who wanted to charge Thomas for reckless driving!) and organised our defence. If we hadn&#39;t taken photos before the council workers turned up the next morning to bulldoze the evidence of their sloppy road making Thomas may have lost his licence. <br/>\n<br/>\nMy first reaction at times like this is to offer support. There is no time for judgement, for blaming. I&#39;m quick to work out what is needed to protect my kids and then go into hyperdrive to achieve it. My ability to imagine &#39;what if&#39; scenarios so that we have all angles covered is a skill the children have learned - perhaps from me, but maybe they would have anyway. <br/>\n<br/>\nWhen the car was towed home, the interview with the police done, the evidence gathered, and Thomas had driven again (I was pretty worried that he would lose his confidence - he later confessed he had, and that&#39;s why he had to drive again quickly) - the day after we sorted out the mess, I allowed the shock and anxiety out and had a real bad day. By then Roger and Thomas were able to support me. <br/>\n<br/>\nUltimately the best I can do is take a deep breath and let them go, each and every time they get into their cars. I know I may never see them alive again. The thought is humbling and grounds me. We take so many risks in our fast-paced lives! And I&#39;m not sure why. <br/>\n<br/>\nAll three of my kids knew how to pull apart a car and put it back together again before they ventured onto the road as drivers and that instilled a lot of confidence in me. April &#39;listens&#39; as she drives and can identify bits of the car that need attention. No mechanic is going to pull the wool over her eyes! Roger hugs the road and speeds around corners in his Fiat X19 and I ask him to go slower as it worries me, but he knows where his car is on the road and has control. I tell him, &quot;that&#39;s fine, and I trust your driving, it&#39;s just that I don&#39;t feel safe and I&#39;m getting anxious and the only way I can alleviate that is to ask you to go slower or stop the car and let me out.&quot; We have conversations like that all the time! My kids think I&#39;m fragile, but honour my feelings and support me. <br/>\n<br/>\nOver the years I&#39;ve tried to aim for support, rather than approval. We began parenting hooked on approval. It&#39;s caused lots of issues that we&#39;ve had to deal with, and still deal with, especially with the older two. I am SO glad they had so little schooling because I think that the school system really cements the constant need for approval in place. <br/>\n<br/>\nSandra wrote:<br/>\nYet I was treating him like he was going ice climbing alone without a jacket.<br/>\n<br/>\nMy nephew is about ten years older than my kids. I learned a lot from my sister and her parenting. David used to go ice climbing - frozen waterfalls were his speciality. As a young man he&#39;d save up his earnings, buy a ticket and then hike in the mountains, often alone, usually in the Rockies or Canada, or in the Aussie mountains close to home. My sister taught me the importance of &#39;letting go&#39;. Even so, it was hard to do with my children, at any age. I&#39;d lie awake for hours when they were babies, terrified of cot death! It&#39;s hard coming to terms with the mortality of one&#39;s offspring! <br/>\n<br/>\nSandra wrote:<br/>\nMy worry is out of proportion, but at least I can see that. &lt;g&gt;<br/>\n<br/>\nAnd if we communicate that to our kids they appreciate it. It&#39;s not controlling then, but sharing. They seem able to deal with that better. <br/>\n<br/>\nDanielle wrote:<br/>\nMy mother is so afraid someone might &quot;take advantage&quot; of her that she refuses to help anyone. This fear results in an extreme lack of generosity.<br/>\n<br/>\nI find the same thing in many people born before WW2 and who experienced childhood during the Depression. I&#39;ve met more with this attitude to life than not in that category and think the conditions then may have something to do with it. It has resulted in the next generation having a view of the universe as being a place of limits, rather than abundance, and hence the belief that there isn&#39;t enough to go around. It&#39;s hard to be generous with that core belief. I find this belief permeates every area of life -from money, to hugs, to food, to property, to love and so on. It&#39;s sad and I&#39;m trying to overcome this conditioning within myself.  <br/>\n<br/>\nIs there sacredness hidden somewhere in sacrifice? Is sacrifice one of those words that has become corrupted? I like the idea of &#39;giving&#39; and &#39;letting go&#39; embedded in sacrifice. I feel that without these does perhaps the notion of sacrifice becomes a burden for all? <br/>\n<br/>\n<br/>\nwishing you peace and prosperity, <br/>\nBeverley Paine<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://homeschoolaustralia.beverleypaine.com\">http://homeschoolaustralia.beverleypaine.com</a> and <br/>\nAlways Learning Books - www.alwayslearningbooks.com.au <br/>\nPO Box 371, Yankalilla 5203 South Australia<br/>\n<br/>\nSend a self-addressed, stamped envelope for a free getting started <br/>\nwith homeschooling information newsletter to the above address.<br/>\nRead latest Homeschool Australia blog: <a rel=\"nofollow\" target=\"_blank\" href=\"http://hablog.beverleypaine.com\">http://hablog.beverleypaine.com</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://homeschoolaustralia.beverleypaine.com\">http://homeschoolaustralia.beverleypaine.com</a><br/>\nReceive regular tips about how easy homeschooling can be, as well as book reviews:<br/>\nemail: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dailyhomeschoolingtips-subscribe@yahoogroups.com\">dailyhomeschoolingtips-subscribe@yahoogroups.com</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":108012,"nextTopicId":108018}}