{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":219597491,"authorName":"watersportgirl","from":"&quot;watersportgirl&quot; &lt;watersportgirl@...&gt;","profile":"watersportgirl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Watersportgirl&#39;s Newbie Introduction :)","postDate":"1112381089","msgId":105107,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQyazRyMSttazdrQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":105106,"nextInTime":105108,"topicId":105107,"numMessagesInTopic":0,"msgSnippet":"Hi everyone! :) We are in San Diego, love the beach, have two boys at home (ages 19 and 8) and one gigantic, gentle Golden Retriever --- and are absolute fans","messageBody":"<div id=\"ygrps-yiv-897888960\">Hi everyone! :)<br/>\n<br/>\nWe are in San Diego, love the beach, have two boys at home (ages 19 <br/>\nand 8) and one gigantic, gentle Golden Retriever --- and are <br/>\nabsolute fans and proponents of the unschooling philosophy. :)  <br/>\n<br/>\nI&#39;ve written the following as my &quot;testament&quot; to all my friends and <br/>\nrelatives who are inquiring the famous &quot;What?&quot; and &quot;Why?&quot; over our <br/>\nnew lifestyle:<br/>\n<br/>\n:) Lori<br/>\n<br/>\nP.S.  Today is my son&#39;s last day in public school (whew!).  I cannot <br/>\nwait to bring him home!  Last night was Open House and what was <br/>\nglaring apparent to me what the assinine work they do (color <br/>\nworksheets and staple them together) and how they made my son feel <br/>\ninferior because he didn&#39;t want to do that.  His beautiful poster <br/>\ndisplays that were made on his own about his trip to Yellowstone, <br/>\nMt. Rushmore and Custer State Park were shoved in a drawer and never <br/>\ngiven attention.  arrrrghhhhh.........<br/>\n<br/>\n-----------------<br/>\nHello Friends!<br/>\n<br/>\nI write today with extreme enthusiasm - an epiphany, to be exact! I <br/>\nhave found &quot;the&quot; answer for my son. No more labels. No more testing. <br/>\nNo more desk-bound, convergent, in-the-box, get-the-one-right-<br/>\nanswer, artificial curriculum based learning that defeats his <br/>\nimagination, divergent style thinking, passions, risk-taking and <br/>\nself-confidence.  I am going to homeschool him. More precisely, I am <br/>\ngoing to &quot;unschool&quot; him. <br/>\n<br/>\nIt was a big decision, one which I struggled with at first, but now <br/>\nI am fully confident that it is absolutely right for him. In talking <br/>\nwith another mother, my answer to her inquiry (of why?) was <br/>\nthis: &quot;My son was born into this world a happy, confident, risk-<br/>\ntaking, inquisitive, exploring little guy with wonderful rhythm and <br/>\na song on his lips. After three years of public schooling, I hardly <br/>\nrecognize him.&quot; <br/>\n<br/>\nThe truth is that children are born with a love of learning - they <br/>\nspend their early years investigating the world, making connections, <br/>\nand testing hypotheses. This love of learning is destroyed with <br/>\nthe &quot;open your books and I will teach you what you need to know&quot; <br/>\nstyle that forces artificial timelines, constant evaluations and <br/>\nlabels children that aren&#39;t &quot;productive&quot; or &quot;achieving&quot; some <br/>\nartificially-imposed curriculum that teaches task-oriented behavior -<br/>\n not higher levels of thinking.<br/>\n<br/>\nWhat kind of students does this style yield?  Sometime in high <br/>\nschool or college - after 10-12 years of task-oriented classwork - <br/>\nprofessors/teachers sigh in disdain over students who cannot <br/>\nthink &quot;outside the box&quot; and &quot;make connections&quot; and &quot;explore and <br/>\nevaluate ideas&quot;!! Is this no surprise???? They have been conditioned <br/>\notherwise for so many years. And what is the answer that government <br/>\ncomes up with? More testing, more evaluations and the likes of No <br/>\nChild Left Behind. The government tells schools that if they want <br/>\nmoney, they had better have high test scores. So schools have <br/>\nlearned that they must teach students how to get right answers on <br/>\ntests - task oriented behavior.<br/>\n<br/>\nThe world is not in a shortage of people to perfom task-oriented <br/>\njobs. The world is in shortage of great thinkers. Task-oriented <br/>\npeople require directions and step-by-step instructions before they <br/>\ncan proceed (or dare to proceed, even then with fear). Thinkers look <br/>\nfor connections and reason their way to problem solving. They may <br/>\nnot want to &quot;go from A to B&quot; without more information. They may need <br/>\ninformation on C, D, E, F and a host of other details to form their <br/>\nbig picture analysis, and then decide that going from A to B is (or <br/>\nperhaps is not) the answer!<br/>\n<br/>\nMy son is intelligent. Quite so! He does not need an IEP or special <br/>\neducation - when the truth is he is thinking on a higher level that <br/>\nwhat is required!  He sees connections and has deep insight into a <br/>\nlot of things. Maybe not everything, but who does? He does math <br/>\nperfectly well with shells on the beach. He reads books that <br/>\ninterest him just fine, with nearly perfect phonetics and lively <br/>\ninflection. He can memorize things that interest him, including <br/>\nsequences. Standardized tests do not reveal these things. My son is <br/>\nlike a rare, beautiful plant -- he does not grow anywhere, in any <br/>\nlight, in any soil, like common plants do -- he needs the right <br/>\ncultivating conditions, and then he grows in ways that amaze us all.<br/>\n<br/>\nMy son is excited about homeschooling. But he needs to <br/>\nbe &quot;deschooled&quot; for a while (new terminology I&#39;m learning) to shake <br/>\noff the paradigms that didn&#39;t work in the classroom and identities <br/>\nthat do not belong to him. I had absolute confirmation that my <br/>\ndecision was right when he came into our bedroom one night, after he <br/>\nhad been put to bed for a while, carrying a brand new folder he <br/>\nfound in his bookshelf. He announced, &quot;This can be my <br/>\nnew &quot;Unfinished Work&quot; folder for home!&quot; I hugged him and <br/>\nsaid, &quot;Hunny, we do not need an Unfinished Work folder at all.&quot; He <br/>\nwas confused, as this wretched folder that has caused us to much <br/>\ngrief at school has become part of his identity. The shame of it! <br/>\n<br/>\nI joked with my husband that maybe we should have an ceremonial <br/>\nburning of it --- and throw in the &quot;star chart&quot; too. I want my child <br/>\nto learn because he loves to learn. Learning should be the reward in <br/>\nitself. If he has to feign interest in something to earn a star on <br/>\nhis chart - what is the point of that? Has any real learning taken <br/>\nplace? Why are math, science, literature and art separate subjects <br/>\nthat are approached as solitary domains? No wonder students sigh and <br/>\nsay, &quot;I&#39;ll never use this stuff.&quot; It is no surprise.<br/>\n<br/>\nWe&#39;re off on a fantastic, adventuresome journey of sailing (physics <br/>\nof the wind), making paper airplanes, IMAX films, museums, turtle <br/>\nwatching, shell collecting - whatever catches our interest.  We will <br/>\nfind glory in the integrated, whole life approach to math, science, <br/>\nliterature and art.  We are abandoning who the public school thinks <br/>\nwe are and what we should know and are reaching for the skies..</div>","specialLinks":[]}],"prevTopicId":105100,"nextTopicId":105104}}