{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Making Excuses with Friends","postDate":"1491487893","msgId":77927,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEExMTNGQzgwLTM3MzUtNEI5Qi04Q0JDLUNBMjkyQUE1RDZFREBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PG9jNDIxNysxYzZtaWZvQFlhaG9vR3JvdXBzLmNvbT4=","referencesHeader":"PDU3NDczOTYwNi44Mzk3LjE0OTE0MTc2ODYwOTAucmVmQG1haWwueWFob28uY29tPiA8NTc0NzM5NjA2LjgzOTcuMTQ5MTQxNzY4NjA5MEBtYWlsLnlhaG9vLmNvbT4gPG9jNDIxNysxYzZtaWZvQFlhaG9vR3JvdXBzLmNvbT4="},"prevInTopic":77926,"nextInTopic":0,"prevInTime":77926,"nextInTime":77928,"topicId":77925,"numMessagesInTopic":0,"msgSnippet":"-=-If I thought the neighbor deliberately let them loose, it would be a whole different discussion. -=- But you’re irritated with the neihbor, and it seems","messageBody":"<div id=\"ygrps-yiv-536225306\">-=-If I thought the neighbor deliberately let them loose, it would be a whole different discussion. -=-<br/>\n<br/>\nBut you’re irritated with the neihbor, and it seems you do suspect him.  We had neighbors and friends who were irritating to me, and sometimes there would be a secret or some sneakiness.  I think it’s better to let those things run their young-child course, or to deal with them lightly and philosophically in kid terms, rather than waiting for the high-stakes problems that can come with teens and young adults.<br/>\n<br/>\n-=- When he told me about it, my son said he opened the door because his friend wanted to see them, but I&#39;ve got strong hunch that isn&#39;t how it happened. -=-<br/>\n-=-The chickens got rounded up and I asked my son about it (he stuck to his story and I told him it didn&#39;t matter how they got out, but ...).-=-<br/>\n<br/>\nYour hunch and “he stuck to his story” sound like you’re angry with the neighbor for your son’s behavior.  I’ve been there with a few kids, usually with Marty who was agreeable to things.  Nick.  Logan.  I remember those kids. :-)  They would be sneaky when it was unnecessary because they were used to being sneaky, and Marty wouldn’t think to say “My mom wouldn’t mind.”<br/>\n<br/>\nIt imght help for you to communicate with the boy directly yourself, but do it with a smile if you can manage it.<br/>\n<br/>\nIf he’s an only child and a talkative guy, he’s probably needy of company.  We provided for three separate only-child boys over the years.  Kirby was an indoors video game, board game, card games guy.  Marty was an outdoors bike and rollerblade guy.  That was great for the visitors.  Sometimes the three would do something together, but sometimes the guy would play with Marty a  while and then Kirby a while, so my job was to comfort Marty when he was jealous that the guest was tired of doing what Marty wanted to do.  Kirby never minded someone leaving him alone so much.<br/>\n<br/>\n-=-I hoped he wasn&#39;t taking the blame for someone else-=-<br/>\n<br/>\nDepending why he would do that, it’s not necessarily a horrible thing.  It can also be part of being a good host.  You might have done something like that yourself, if you look back over the years.  Or maybe you would still, now, under some circumstances.  “Well, it’s my fault, because…” can be true even when a visitor did something no one in the family would have done. <br/>\n<br/>\nSome kids are impetuous and quick and exciteable.  Give them plastic cups instead of breakable glass.  (And generalize that to other things.)<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":50712510,"authorName":"","from":"michelle_m29@...","profile":"michelle_m29","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Making Excuses with Friends","postDate":"1491438439","msgId":77926,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PG9jNDIxNysxYzZtaWZvQFlhaG9vR3JvdXBzLmNvbT4=","inReplyToHeader":"PDU3NDczOTYwNi44Mzk3LjE0OTE0MTc2ODYwOTBAbWFpbC55YWhvby5jb20+","referencesHeader":"PDU3NDczOTYwNi44Mzk3LjE0OTE0MTc2ODYwOTAucmVmQG1haWwueWFob28uY29tPgk8NTc0NzM5NjA2LjgzOTcuMTQ5MTQxNzY4NjA5MEBtYWlsLnlhaG9vLmNvbT4="},"prevInTopic":77925,"nextInTopic":77927,"prevInTime":77925,"nextInTime":77927,"topicId":77925,"numMessagesInTopic":0,"msgSnippet":"Re-reading that, I don t think I was clear about the chickens. I don t have reason to think that their getting loose was anything but an accident. Someone","messageBody":"<div id=\"ygrps-yiv-2139930366\">Re-reading that, I don&#39;t think I was clear about the chickens. I don&#39;t have reason to think that their getting loose was anything but an accident. Someone opened the door and either wasn&#39;t careful enough to keep them from slipping out, or didn&#39;t latch it. If I thought the neighbor deliberately let them loose, it would be a whole different discussion.&nbsp;<div><br><div>Michelle&nbsp;</div></div></div>","specialLinks":[]},{"userId":50712510,"authorName":"Michelle Marr","from":"Michelle Marr &lt;michelle_m29@...&gt;","profile":"michelle_m29","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Making Excuses with Friends","postDate":"1491417686","msgId":77925,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU3NDczOTYwNi44Mzk3LjE0OTE0MTc2ODYwOTBAbWFpbC55YWhvby5jb20+","referencesHeader":"PDU3NDczOTYwNi44Mzk3LjE0OTE0MTc2ODYwOTAucmVmQG1haWwueWFob28uY29tPg=="},"prevInTopic":0,"nextInTopic":77926,"prevInTime":77924,"nextInTime":77926,"topicId":77925,"numMessagesInTopic":0,"msgSnippet":"My eleven-year-old son recently made friends with the little boy next door. I ve met both parents and the family seems nice enough. Our sons enjoy running","messageBody":"<div id=\"ygrps-yiv-2083404759\">My eleven-year-old son recently made friends with the little boy next door. I&#39;ve met both parents and the family seems nice enough. Our sons enjoy running around outside in the mud together and are working on a tree fort that my older children abandoned years ago. <br/>\n<br/>\n<br/>\nBut there are some complications. <br/>\n<br/>\n<br/>\nThe neighbor boy also wants my twelve-year-old to play. He&#39;ll send my younger son in to get him, or come to the door and tell me that he -needs- him. The first couple of times he invited him out to play, my son went. The next time, he got up and trudged out, saying that &quot;Manners mean I have to do it.&quot; I&#39;ve offered to be the bad guy and say that he&#39;s grounded (maybe that&#39;s wrong -- but I used my own mom as a get out of jail free card while growing up and my older teens have used &quot;Mom&#39;s the bad guy&quot; to their advantage when it suited their purposes) but he said that would be embarrassing. So we&#39;ve settled on &quot;He&#39;s busy with a project.&quot; Sitting on the couch watching Youtube videos, or anything else, *is* busy with a project.<br/>\n<br/>\n<br/>\nNow, my eleven-year-old isn&#39;t excited to go out every single time his friend comes over, but he feels like he has to, to be a good friend. How do I explain to him that he doesn&#39;t need to be at this other child&#39;s beck and call and that it&#39;s not lying or mean to sometimes say he&#39;s busy with something else? The neighbors homeschool so we don&#39;t have the buffer of long school days. And summer is coming so we&#39;ll lose the school-at-home buffer. <br/>\n<br/>\n<br/>\nI&#39;m also trying to decide if I should be concerned -- a couple of days ago, someone let our chickens out of the coop. When he told me about it, my son said he opened the door because his friend wanted to see them, but I&#39;ve got strong hunch that isn&#39;t how it happened. And it doesn&#39;t matter who opened the door. The chickens got rounded up and I asked my son about it (he stuck to his story and I told him it didn&#39;t matter how they got out, but I hoped he wasn&#39;t taking the blame for someone else). Neighbor Boy had already asked me to  cover up for a minor incident a couple of days earlier. (He got wet, I called his mom and told her he was running around with soaked jeans in case she wanted him to come home and change), so that, coupled with some body language and whispering makes me wonder. <br/>\n<br/>\n<br/>\nHow do I help my eleven-year-old understand that there&#39;s a balance between always giving your friend his way and being too pushy/selfish/demanding yourself? He seems to have the hang of it with other people and relationships, but I think this other boy is used to getting his own way, with kids and adults.  <br/>\n<br/>\n<br/>\nMichelle</div>","specialLinks":[]}],"prevTopicId":77914,"nextTopicId":77928}}