{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":74,"messages":[{"userId":279647515,"authorName":"d.lewis","from":"&quot;d.lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Our struggles with fury was What would be ideal ...unschooling interview?","postDate":"1295715144","msgId":59064,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlERDM4MEM0Rjk2NjQ5MEQ5QjM2RDRDNEM4N0E4REVDQGRlYm9yYWg3NmE3OWh2Pg==","referencesHeader":"PGloZTNhYytubXZzQGVHcm91cHMuY29tPg=="},"prevInTopic":59059,"nextInTopic":59116,"prevInTime":59063,"nextInTime":59065,"topicId":58949,"numMessagesInTopic":0,"msgSnippet":"***What also helped was hearing stories about other kids who had slivers of commonality with my daughter s temperament.*** My sister was something like you","messageBody":"<div id=\"ygrps-yiv-1245663850\">***What also helped was hearing stories about other kids who had slivers of <br/>\ncommonality with my daughter&#39;s temperament.***<br/>\n<br/>\nMy sister was something like you describe Jayn.   I was afraid of her.  What <br/>\nI know about her now is that she needed a lot of time alone, and a lot more <br/>\nspace, and that just never happened at our house.  We were five to a bedroom <br/>\nin a small house with a stay at home mom.  Sue was right in the middle. <br/>\nShe later said she sometimes hated even *seeing* one of us, even if we <br/>\ndidn&#39;t speak to her, mom most of all, because mom tried to help her and that <br/>\njust pissed her off.  She later said that the concerned look on mom&#39;s face <br/>\nmade her want to kill her.   She was the first daughter and my parents were <br/>\nvery protective of her, never let her out of their sight.  She could not <br/>\njust go off and be alone like the boys could.  She was too confined.<br/>\n<br/>\nShe&#39;s a really nice person now!  Has been for a long time!  She never had <br/>\nkids, lives in the country with her nice husband, and only goes out when <br/>\n*she* wants to.<br/>\n<br/>\nIt was better for me because I was the last child.    My parents were either <br/>\ncalmer or worn out by the time I was born.   I&#39;m not a people person. <br/>\nSometimes even looking at someone irritates me.  When my fifth grade teacher <br/>\nread The Tell Tale Heart I *so* identified with the killer.  I knew why the <br/>\nguy with the dead staring eye had to go.  &lt;g&gt;    It irritates me when people <br/>\ntry to help me.   Sometimes it irritates me when people just are. &lt;g&gt;<br/>\n<br/>\nAs an adult I can deal with these things without being rude or yellish.  I <br/>\nknow it&#39;s my issue and has nothing to do with others.  I know if I get <br/>\nreally *a lot* of exercise, I&#39;m a nicer person.   As a kid I don&#39;t remember <br/>\nhow I handled it.  I don&#39;t think I was ever as scary as my sister.   And <br/>\nit&#39;s fine now.  No one&#39;s dead. &lt;g&gt;<br/>\n<br/>\nSo, maybe in the long, long view you&#39;ll be able to see why Jayn yelled and <br/>\nwas irritated.  Maybe what Jayn needed was so different from what you knew <br/>\nabout humans that you couldn&#39;t get it right.  Maybe Jayn needs more time to <br/>\nfigure it out.    Maybe if you could have lived in a big house in the <br/>\ncountry and she could have wandered and roamed it would be different.  Maybe <br/>\nnot. &lt;g&gt;<br/>\n<br/>\nDeb Lewis</div>","specialLinks":[]},{"userId":287815876,"authorName":"dezignarob","from":"&quot;dezignarob&quot; &lt;dezigna@...&gt;","profile":"dezignarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Our struggles with fury was What would be ideal ...unschooling interview?","postDate":"1295683724","msgId":59059,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGloZTNhYytubXZzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFDODY4NUE0LUVGNDgtNDY0NC1BQ0NBLTk1MTE2MEE5OUE1Q0BTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":59048,"nextInTopic":59064,"prevInTime":59058,"nextInTime":59060,"topicId":58949,"numMessagesInTopic":0,"msgSnippet":"I started to write the long answer, partly about the concept of self-control - I really appreciate the volcano analogy and I have some thinking to do on that","messageBody":"<div id=\"ygrps-yiv-2003964719\">I started to write the long answer, partly about the concept of self-control - I really appreciate the volcano analogy and I have some thinking to do on that which should help. But, not having had time for that to sink in, I realized my long answer was sounding pretty defensive - neither helpful nor needful, so here is the short(ish) answer.<br/>\n<br/>\n==perhaps asking rudely SHOULD have made things come more slowly, many years ago. ==<br/>\n== it was never to accept being bossed, pushed, punished or having things thrown at me.   If I say &quot;I would have said something every time,&quot; it might seem like I&#39;m talking about saying something for eight years, but I&#39;m thinking I would have said something every time for a few months, or occasionally, and it wouldn&#39;t have been eight years.===<br/>\n<br/>\nPlease know that I tried these ideas and more over the last several years. Of course I tried saying something to her every time, for a looong time. Of course I tried showing and telling her that her behavior was making it harder for me to give her what she wanted.<br/>\n<br/>\nFor years I have felt so desperately alone on this one issue. So completely helpless in the face of being told not to &quot;accept&quot; something. In the absence of punishment, without withdrawing love, given the failure of the suggested strategies, I don&#39;t know how to &quot;not accept&quot; something from Jayn. <br/>\n<br/>\nI scoured Sandra&#39;s blog and others, searched archives of the lists and other places for posts about anger, reread all the history that I have posted over the years in different places to try to see the emergence, read avidly when people had similar issues. Mention a book - I&#39;ve probably read it. So I&#39;d heard all this advice.<br/>\n<br/>\nEvery now and then I would find something of comfort. When the &quot;tell her how you feel answer&quot; crashed and the &quot;go slower response&quot; did nothing but exacerbate the moments of anguish, I remembered this from Joyfully Rejoyceing by Amy:<br/>\n<br/>\n&quot;I would have said, &quot;I don&#39;t like being yelled at, but here&#39;s your apple, sweetie. Did you want it cut up?&quot; Nicely -- no smarminess in my tone at all.<br/>\n<br/>\nNow what would he have to yell about?<br/>\n<br/>\nYou&#39;d be amazed how things start to change when you don&#39;t create the power struggle yourself.<br/>\n<br/>\nTo some, that looks like &quot;rewarding&quot; him for yelling. But there&#39;s another way to see it -- you have modeled kindness, and calmness. He has screamed out, &quot;Do you love me?! Even now?!&quot; And you have sweetly answered, &quot;Yes. Here&#39;s your apple, love.&quot; &quot;<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com/changing%20parenting/rudedefiant.html\">http://joyfullyrejoycing.com/changing%20parenting/rudedefiant.html</a><br/>\n<br/>\nIt helped. Just cheerfully give her what she wants/needs. She&#39;s imagining a power struggle where none has to exist, so don&#39;t make the struggle real with my reaction. Her empathy had to grow sufficiently for someone else&#39;s feelings to matter to her. It&#39;s taken pretty much til now.<br/>\n<br/>\nSometimes she is not shouting about an unmet need. Sometimes her unmet need *is* to shout.<br/>\n<br/>\nWhat also helped was hearing stories about other kids who had slivers of commonality with my daughter&#39;s temperament. Many of these were Pam S&#39;s. Roya talking at the conference about climbing out the window to make a point about control.<br/>\n<br/>\nThese helped.<br/>\n<br/>\nSandra, knowing that sometimes things get bad even with you and Holly helps in an odd sort of way.<br/>\n<br/>\nBut what I&#39;ve realized is that the usual strategies of conventional unschooling (there&#39;s an unlikely phrase) were not going to help me and my different daughter.<br/>\n<br/>\nWhat has helped, what is helping, was the most basic unschooling advice of all.<br/>\n<br/>\nLook, really look, at my daughter and see what she needs, and <br/>\nThink For Myself.<br/>\n<br/>\n...and I still don&#39;t have all the answers. But I have an idea of which ones seem to be wrong, at least for us.<br/>\n<br/>\nRobyn L. Coburn<br/>\nCertified SDU Scrapbooking Teacher<br/>\nwww.robyncoburn.blogspot.com<br/>\nwww.iggyjingles.blogspot.com<br/>\nwww.allthingsdoll.blogspot.com</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: What would be ideal in an unschooling interview?","postDate":"1295648690","msgId":59048,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFDODY4NUE0LUVGNDgtNDY0NC1BQ0NBLTk1MTE2MEE5OUE1Q0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGloY3ZpZytqcHYxQGVHcm91cHMuY29tPg==","referencesHeader":"PGloY3ZpZytqcHYxQGVHcm91cHMuY29tPg=="},"prevInTopic":59046,"nextInTopic":59059,"prevInTime":59047,"nextInTime":59049,"topicId":58949,"numMessagesInTopic":0,"msgSnippet":"-=-She is almost always told yes within the bounds of real life, always given what she asks for to the extent of our ability and budget, not bossed or pushed","messageBody":"<div id=\"ygrps-yiv-275555122\">-=-She is almost always told yes within the bounds of real life, always given what she asks for to the extent of our ability and budget, not bossed or pushed or punished - so why does she act as if we are fighting her, why does she act as if we said &quot;no&quot; and she has to fight until we give in? Why does she feel the need to scream &quot;NOW!&quot; when I&#39;m already on my feet getting it for her? Asking rudely doesn&#39;t make anything come faster or slower, it just makes everyone feel angry or hurt. -=-<br/>\n<br/>\nI don&#39;t know those answers, but perhaps asking rudely SHOULD have made things come more slowly, many years ago.  It did at my house.  <br/>\n<br/>\nPerhaps, maybe, being an only child she had other factors and thoughts that siblings could have counselled her about or objected to.  Sometimes if one of my kids is being shrill or impatient, another one of them will say &quot;dude&quot; at least, or as Kirby said to Holly in December, &quot;That&#39;s quite an over-reaction.&quot;  He stated it calmly and didn&#39;t even look at her for a response, just kept doing what he was doing.  It did slow her down a bit.<br/>\n<br/>\nThe way you phrased some of the things above sound to me like crowded or restless.  If my children were being impatient or rude, I would suspect &quot;needs food&quot; (as you did) or &quot;needs out of here&quot; or &quot;needs other people.&quot;  Even without them being onlies.<br/>\n<br/>\n-=-It has only been in the last 6 or so months that Jayn has matured enough to start being kinder to James and I, and started the practice the self-control she is perfectly able to exercise with other people outside of home, at home, instead of lashing out instantly. And it has been wonderful to see that at last. <br/>\n<br/>\nNo doubt maturity is part of it, but the &quot;practice self-control&quot; seems off.  I doubt she&#39;s needing to control herself greatly when she&#39;s out with other people.  It&#39;s just a very different dynamic and situation.  I think &quot;self control&quot; suggests a volcano of potential danger.  But choices, and seeing her as making more mature choices about how to respond, keeps her from sounding so much in need of control (her own or anyone else&#39;s).<br/>\n<br/>\n-=-So maybe questions about dealing with difficult behavior from kids - that challenging behavior still occurs, but the response is different with unschooling.-=-<br/>\n<br/>\nMy response was different with unschooling, but it was never to accept being bossed, pushed, punished or having things thrown at me.   If I say &quot;I would have said something every time,&quot; it might seem like I&#39;m talking about saying something for eight years, but I&#39;m thinking I would have said something every time for a few months, or occasionally, and it wouldn&#39;t have been eight years.<br/>\n<br/>\n<br/>\n<br/>\n-=-Maybe something about the idea of not giving up too soon, that there might be difficult times, that children mature at different rates (so comparisons are odious); that sometimes having been in school gives an illusion of emotional maturity that is basically a child in survival mode; that sometimes unschooled children appear wilder; that in the absence of punishment as a strategy you will need a lot more Patience; that if you can hold on and believe all will be well. -=-<br/>\n<br/>\nIll try to keep that in mind for the questions for the interview situation, but I don&#39;t think patience by itself is the sole answer.<br/>\n<br/>\nSometimes a parent and child clash.  Holly, as a teen, is harder for me to get along with than Marty ever was.  It&#39;s not horrible, but after two who were rarely volatile or  emotional, the difference is striking to me. But Keith and Holly seem never to be frustrated with one another at all, so when it gets bad, I go trade places with Keith and he calms her easily.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":287815876,"authorName":"dezignarob","from":"&quot;dezignarob&quot; &lt;dezigna@...&gt;","profile":"dezignarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: What would be ideal in an unschooling interview?","postDate":"1295647120","msgId":59046,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGloY3ZpZytqcHYxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDc0NEY1QjBBOTJCRTQwM0VBM0E4NjFDRDU5N0Y4MDZGQGRlYm9yYWg3NmE3OWh2Pg=="},"prevInTopic":59029,"nextInTopic":59048,"prevInTime":59045,"nextInTime":59047,"topicId":58949,"numMessagesInTopic":0,"msgSnippet":"==== I really wanted to know that Dylan would be ok.  That when he was grown he d be smart and self assured and happy.   When I realized traditional schooling","messageBody":"<div id=\"ygrps-yiv-1331649040\">====&gt; I really wanted to know that Dylan would be ok.  That when he was grown he&#39;d be smart and self assured and happy.   When I realized traditional schooling offered no guarantee of that, and in many ways it could leave a person feeling stupid and insecure and unhappy, I was calmer about my choice and more dedicated to avoiding the problems that schooling could cause.====    <br/>\n<br/>\nKinda connected to this - the idea that the kids will be ok.<br/>\n<br/>\nThere have been and still are times when I feel discouraged because so many of the reports of kids are about how fabulous they are, seemingly all the time, and Jayn is often not fabulous in her behavior to me.<br/>\n<br/>\nSometimes in the online world of unschooling, there can be a feeling that all you have to do is follow a formula:<br/>\nIf you don&#39;t lie to your children, then they won&#39;t ever lie to you.<br/>\nIf you are always respectful, then they will be respectful back.<br/>\nIf you are kind to them, then they will be kind to you.<br/>\nIf they are not spanked, then they won&#39;t hit.<br/>\n<br/>\nA lot of the visions of sugar plums and perfection, especially of young folk demonstrating a lot of empathy for others. That isn&#39;t how life is here.<br/>\n<br/>\nI have seen all the predictions about academic learning come absolutely true. Yes Jayn learned to read effortlessly, yes she spontaneously (seeming spontaneous in the moment) demonstrates all kinds of math skills, yes she has a surprising at times knowledge of various elements of history or geography. She asks amazing questions, has deep philosophical insights. She&#39;s artistic and creative and makes lots of good choices all day about how she will spend her time and where she will direct her attention.<br/>\n<br/>\nI read once that one important telling thing was how they behaved when you weren&#39;t there to watch them. Jayn generally behaves very well in public, is polite to people, courteous and pleasant in public places and when visiting her friends. She stands in lines and waits her turn, she respects the rules of conduct in places we visit. Other parents take her out with them, and all is well. She used to have a tendency to bossy her friends, but that seems to have waned a lot. We&#39;ve talked about that issue, and she has also listened to her friends.<br/>\n<br/>\nBut...<br/>\nIn private at home I have spent the last few years, since she was probably 7, being shouted at, sworn at, hit, pushed, ducking thrown objects, spoken to in a rude and demanding tone, told to &quot;shut up&quot;, at least once every day, sometimes several times in the course of a day. The kinds of behavior for which I absolutely would have been spanked had I tried it (so I didn&#39;t). The kind of behavior that cause other parents I know to instantly impose a grounding or other punishment the first time it happens. So a nice challenge to my own personal growth as a parent.<br/>\n<br/>\nSometimes her raging was because she got hungry (which is a disaster) - so that making sure she isn&#39;t ever hungry started to feel like an obsession for me. Sometimes there seemed to be no discernable reason for it and I was completely blindsided by the suddenness of the episode.  <br/>\n<br/>\nShe is almost always told yes within the bounds of real life, always given what she asks for to the extent of our ability and budget, not bossed or pushed or punished - so why does she act as if we are fighting her, why does she act as if we said &quot;no&quot; and she has to fight until we give in? Why does she feel the need to scream &quot;NOW!&quot; when I&#39;m already on my feet getting it for her? Asking rudely doesn&#39;t make anything come faster or slower, it just makes everyone feel angry or hurt. <br/>\n<br/>\nShe did not learn to speak this way from my example or James&#39;. <br/>\n<br/>\nIt has only been in the last 6 or so months that Jayn has matured enough to start being kinder to James and I, and started the practice the self-control she is perfectly able to exercise with other people outside of home, at home, instead of lashing out instantly. And it has been wonderful to see that at last. <br/>\n<br/>\nSo maybe questions about dealing with difficult behavior from kids - that challenging behavior still occurs, but the response is different with unschooling.<br/>\n<br/>\nMaybe something about the idea of not giving up too soon, that there might be difficult times, that children mature at different rates (so comparisons are odious); that sometimes having been in school gives an illusion of emotional maturity that is basically a child in survival mode; that sometimes unschooled children appear wilder; that in the absence of punishment as a strategy you will need a lot more Patience; that if you can hold on and believe all will be well. <br/>\n<br/>\nRobyn L. Coburn<br/>\nCertified SDU Instructor<br/>\nwww.robyncoburn.blogspot.com<br/>\nwww.iggyjingles.blogspot.com<br/>\nwww.allthingsdoll.blogspot.com</div>","specialLinks":[]},{"userId":474012053,"authorName":"spidercraft@ymail.com","from":"&quot;spidercraft@...&quot; &lt;spidercraft@...&gt;","profile":"spidercraft@ymail.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: What would be ideal in an unschooling interview?","postDate":"1295598971","msgId":59029,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGloYmdocitkNmh2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFDRjk5QzMwLURDM0QtNDZGMC04RDlBLUJFOTY2QTMwNjQwRUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":59012,"nextInTopic":59046,"prevInTime":59028,"nextInTime":59030,"topicId":58949,"numMessagesInTopic":0,"msgSnippet":"The question I get most is what if they need to do something they don t want to do?  Usually this is referring to learning stuff to get into college and get","messageBody":"<div id=\"ygrps-yiv-720980299\">The question I get most is &quot;what if they need to do something they don&#39;t want to do?&quot;  Usually this is referring to learning stuff to get into college and get a certain degree.  People have a really hard time imagining that children would choose to do something they dislike...even if the end result is what they really want.<br/>\n<br/>\nI usually answer this with a comparison to my loathing of cutting fabric.  I hate it, but I do it anyway because I enjoy sewing.  Can&#39;t have one without the other.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; I&#39;m going to be interviewed in a few months, and it will be publicized in advance.  I&#39;ve been asked for a list of 15-20 questions people typically ask me about unschooling.  I would  like to avoid the baby/basic questions, and go with more interesting angles.  I can look through some interviews and find things that led in rich directions, I guess, but I thought asking here might get lots of people thinking about the idea of what makes a good interview.<br/>\n&gt; <br/>\n&gt; Some of you will interview people, and some of you will be interviewed.  Some of you HAVE been interviewed.  Do you have any great questions for me to put on this list?<br/>\n&gt; <br/>\n&gt; I&#39;m five days late with this.  I thought the request had been 1/15, but it was 1/10.   I was pretty busy that day, and today was my first day off for a long time.  So I&#39;m late.  I said I would send something Sunday.  <br/>\n&gt; <br/>\n&gt; What questions do you wish you could have asked or seen an answer to when you first wondered about unschooling?  Or what information helped you get it when it seemed odd and crazy, when you first hear of it?<br/>\n&gt; <br/>\n&gt; Thanks,<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":291337950,"authorName":"alma","from":"&quot;alma&quot; &lt;almadoing@...&gt;","profile":"almadoing","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: What would be ideal in an unschooling interview?","postDate":"1295542141","msgId":59012,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGloOXAxdCtodjdhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE5N0YyQTcwLTQyRTItNEJCNC04RkNELUY1NUVGM0EyOUI0OUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":58980,"nextInTopic":59029,"prevInTime":59011,"nextInTime":59013,"topicId":58949,"numMessagesInTopic":0,"msgSnippet":"We got the kit second hand, and looking on line it appears to be discontinued. But to look at it I found this http://www.discoverthis.com/volcano-kit.html The","messageBody":"<div id=\"ygrps-yiv-2132638147\">We got the kit second hand, and looking on line it appears to be discontinued. But to look at it I found this <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.discoverthis.com/volcano-kit.html\">http://www.discoverthis.com/volcano-kit.html</a><br/>\n<br/>\nThe listed term for the jigsaw puzzle I mentioned is the &quot;plate tectonics puzzle&quot;. It&#39;s such a great idea for a puzzle.<br/>\n<br/>\nAlison<br/>\nDS1(8) and DS2(5)<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra dd &lt;Sandra@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; -=-the absolutely coolest thing about this kit is the jigsaw of the world where the breaks in the puzzle are the earth&#39;s fault lines and ...-=-<br/>\n&gt; <br/>\n&gt; I&#39;ve never known of a puzzle like that at all!   Do you have a link to it online, if it&#39;s still in print?  Or could you take a photo of it if you get a chance?<br/>\n&gt; <br/>\n&gt; Thanks,<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: What would be ideal in an unschooling interview?","postDate":"1295389204","msgId":58980,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5N0YyQTcwLTQyRTItNEJCNC04RkNELUY1NUVGM0EyOUI0OUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGloMXQwNCs0bm42QGVHcm91cHMuY29tPg==","referencesHeader":"PGloMXQwNCs0bm42QGVHcm91cHMuY29tPg=="},"prevInTopic":58976,"nextInTopic":59012,"prevInTime":58979,"nextInTime":58981,"topicId":58949,"numMessagesInTopic":0,"msgSnippet":"-=-the absolutely coolest thing about this kit is the jigsaw of the world where the breaks in the puzzle are the earth s fault lines and ...-=- I ve never","messageBody":"<div id=\"ygrps-yiv-659559628\">-=-the absolutely coolest thing about this kit is the jigsaw of the world where the breaks in the puzzle are the earth&#39;s fault lines and ...-=-<br/>\n<br/>\nI&#39;ve never known of a puzzle like that at all!   Do you have a link to it online, if it&#39;s still in print?  Or could you take a photo of it if you get a chance?<br/>\n<br/>\nThanks,<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":291337950,"authorName":"alma","from":"&quot;alma&quot; &lt;almadoing@...&gt;","profile":"almadoing","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: What would be ideal in an unschooling interview?","postDate":"1295284036","msgId":58976,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGloMXQwNCs0bm42QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQzNzI0Ny41MTE2OC5xbUB3ZWI4MTUwMS5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":58975,"nextInTopic":58980,"prevInTime":58975,"nextInTime":58977,"topicId":58949,"numMessagesInTopic":0,"msgSnippet":"... And not just video games. I was in our local charity shop and they had this big volcano and earthquake kit, never opened, for a couple of pounds. While I","messageBody":"<div id=\"ygrps-yiv-795150244\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;... it is so important to be interested in <br/>\n&gt; what your children like. I see too many parents who just say&quot; I do not like <br/>\n&gt; Video Games&quot; and miss the opportunity to connect with their children.<br/>\n&gt; How fun to discover things together and share new things because you were open <br/>\n&gt; to your child&#39;s passion even if they are something you would normally not choose <br/>\n&gt; for yourself.<br/>\n<br/>\n<br/>\n </span></blockquote>And not just video games. I was in our local charity shop and they had this big volcano and earthquake kit, never opened, for a couple of pounds. While I was paying for it the checkout lady asked if it was for my son and I started raving about how many bits were in the kit and although we&#39;d done the volcano experiment before it would be such fun to use the mould and paints and ... the absolutely coolest thing about this kit is the jigsaw of the world where the breaks in the puzzle are the earth&#39;s fault lines and ...<br/>\n<br/>\nAs I was leaving the lady commented that she hoped my son would have fun, as clearly I would!<br/>\n<br/>\nI suddenly remembered how, when pregnant with my first, I was worried I would have a boy because I didn&#39;t have aaany boy interests. I have learnt sooo much wonderful stuff from my sons interests.<br/>\n<br/>\nAlison <br/>\nDS(8) and DS(5)</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] interview question","postDate":"1295282662","msgId":58975,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI0Njk3RTQ3LUMwN0UtNDIwMy04NkMwLTExMDI1Qjg0RDNBOEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEFBTkxrVGltQVBYaEdIUVlVODZfV1lWYSs5Mko9PWI9b0QrNGFSLTF6d0tlNkBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PGlndjk5cStsN2wxQGVHcm91cHMuY29tPiA8NDM2QkMxNTItN0MzMi00NzQzLTk2MkMtNkFGRDgwMjMxOTFGQFNhbmRyYWRvZGQuY29tPiA8QUFOTGtUaW1BUFhoR0hRWVU4Nl9XWVZhKzkySj09Yj1vRCs0YVItMXp3S2U2QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":58974,"nextInTopic":58976,"prevInTime":58974,"nextInTime":58976,"topicId":58949,"numMessagesInTopic":0,"msgSnippet":"These are good, Dola: *what are the fears about the children that one needs to see and overcome? *what are the many control issues and expectations that one","messageBody":"<div id=\"ygrps-yiv-1307553066\">These are good, Dola:<br/>\n<br/>\n*what are the fears about the children that one needs to see and overcome?<br/>\n<br/>\n*what are the many control issues and expectations that one could do with dropping?<br/>\n<br/>\n*How does one live without &quot;goals&quot; and &quot;ambitions&quot; as seen from a conventional way of life?<br/>\n<br/>\nPeople will have little heart attacks even THINKING about &quot;dropping&quot; control and expectations.  Maybe I should say &quot;amending.&quot;  :-)<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":143043046,"authorName":"Ed Wendell","from":"&quot;Ed Wendell&quot; &lt;ewendell@...&gt;","profile":"zelco123","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] What would be ideal in an unschooling interview?","postDate":"1295273027","msgId":58971,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM2NjBBRDc5QzZFMzQ0RTk4NzJDMkRBMzQzMTBENTREQEVkUEM+","inReplyToHeader":"PDQzNzI0Ny41MTE2OC5xbUB3ZWI4MTUwMS5tYWlsLm11ZC55YWhvby5jb20+","referencesHeader":"PEFDRjk5QzMwLURDM0QtNDZGMC04RDlBLUJFOTY2QTMwNjQwRUBTYW5kcmFkb2RkLmNvbT4gPDc0NEY1QjBBOTJCRTQwM0VBM0E4NjFDRDU5N0Y4MDZGQGRlYm9yYWg3NmE3OWh2PiA8MTkxOTU4LjY4Nzc1LnFtQHdlYjgxNTA4Lm1haWwubXVkLnlhaG9vLmNvbT4gPDk1NDk5OUM0LTU4RDUtNEUwRC04NjAyLUQ3MDgzMDNGOEJGRUBTYW5kcmFkb2RkLmNvbT4gPDQzNzI0Ny41MTE2OC5xbUB3ZWI4MTUwMS5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":58970,"nextInTopic":58974,"prevInTime":58970,"nextInTime":58972,"topicId":58949,"numMessagesInTopic":0,"msgSnippet":"Zachariah (16) loves to find You-Tube videos about games / manga / anime / warfare / movie trailers / movie outtakes and share those with me.  That is a very","messageBody":"<div id=\"ygrps-yiv-1233837727\">Zachariah (16) loves to find You-Tube videos about games / manga / anime / warfare / movie trailers / movie outtakes and share those with me.  That is a very easy way for Ed and I to connect with him over his interests.  He likes to share songs that way too - well just about anything really that he can find on you-tube that he likes and wants to share - comedians, patriotic war videos, snippets of old shows like Animal from The Muppet Show; etc.   He finds a lot of things late at night while we&#39;re asleep and puts them in favorites and shares them later.<br/>\n<br/>\nAnother way we connect is:  He belongs to an airsoft team - I have no interest in dressing up in fatigues and reenacting world events - and getting shot with BB&#39;s ;)  - however I CAN support him by looking at things on-line (dreaming and planning for items) and going to army surplus stores, etc.  We were just shopping for new protective gloves the other day at the hardware store and then on Amazon and eBay.  I also listen to him retell the days events.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nHow fun to discover things together and share new things because you were open <br/>\nto your child&#39;s passion even if they are something you would normally not choose <br/>\nfor yourself.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":458624268,"authorName":"dola dasgupta-banerji","from":"dola dasgupta-banerji &lt;doladg@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] interview question","postDate":"1295245627","msgId":58974,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGltQVBYaEdIUVlVODZfV1lWYSs5Mko9PWI9b0QrNGFSLTF6d0tlNkBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDQzNkJDMTUyLTdDMzItNDc0My05NjJDLTZBRkQ4MDIzMTkxRkBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGlndjk5cStsN2wxQGVHcm91cHMuY29tPgk8NDM2QkMxNTItN0MzMi00NzQzLTk2MkMtNkFGRDgwMjMxOTFGQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":58971,"nextInTopic":58975,"prevInTime":58973,"nextInTime":58975,"topicId":58949,"numMessagesInTopic":0,"msgSnippet":"I thought of these questions: what are the fears about the children that one needs to see and overcome? what are the many control issues and expectations that","messageBody":"<div id=\"ygrps-yiv-1375019167\">I thought of these questions:<br/>\n<br/>\nwhat are the fears about the children that one needs to see and overcome?<br/>\n<br/>\nwhat are the many control issues and expectations that one could do with<br/>\ndropping?<br/>\n<br/>\nHow does one live without &quot;goals&quot; and &quot;ambitions&quot; as seen from a<br/>\nconventional way of life?<br/>\n<br/>\nDola<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sun, Jan 16, 2011 at 11:02 PM, Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; I&#39;m guessing the first part would be describing unschooling to those who<br/>\n&gt; have never heard of it, but the second part would be discussing it in more<br/>\n&gt; detail for those who are listening because they are unschoolers or would<br/>\n&gt; like to be. Please clarify the audience and the focus or thrust of it.<br/>\n&gt; What&#39;s the trajectory? :-)<br/>\n&gt;<br/>\n&gt; Sandra<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: What would be ideal in an unschooling interview?","postDate":"1295224866","msgId":58970,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBRDA4ODdFLUYzQUUtNDczMi1BMkZGLUM5RkNFOUM2M0UyMEBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGlndmQ5NCs5bzRtQGVHcm91cHMuY29tPg==","referencesHeader":"PGlndmQ5NCs5bzRtQGVHcm91cHMuY29tPg=="},"prevInTopic":58969,"nextInTopic":58971,"prevInTime":58969,"nextInTime":58971,"topicId":58949,"numMessagesInTopic":0,"msgSnippet":"-=- Or what information helped you get it when it seemed odd and crazy, when you first hear of it? ***************** Your child is not you - that one","messageBody":"<div id=\"ygrps-yiv-50415788\">-=-&gt;&gt;Or what information helped you get it when it seemed odd and crazy, when you first hear of it?<br/>\n*****************<br/>\n<br/>\n&quot;Your child is not you&quot; - that one stopped me cold, way back, when I was resisting, thinking it All sounded odd and crazy. It was a gigantic &quot;well duh&quot; moment in the best way. It was so obvious! And yet I was using my adult needs and fears waaaaay too much to make decisions about what my kids &quot;needed&quot; or &quot;needed to learn&quot;. -=-<br/>\n<br/>\nAnother &quot;needs&quot; comment.  I have begun a collection.  :-)<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/needs\">http://sandradodd.com/needs</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] What would be ideal in an unschooling interview?","postDate":"1295209662","msgId":58969,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQzNzI0Ny41MTE2OC5xbUB3ZWI4MTUwMS5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PDk1NDk5OUM0LTU4RDUtNEUwRC04NjAyLUQ3MDgzMDNGOEJGRUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PEFDRjk5QzMwLURDM0QtNDZGMC04RDlBLUJFOTY2QTMwNjQwRUBTYW5kcmFkb2RkLmNvbT4gPDc0NEY1QjBBOTJCRTQwM0VBM0E4NjFDRDU5N0Y4MDZGQGRlYm9yYWg3NmE3OWh2PiA8MTkxOTU4LjY4Nzc1LnFtQHdlYjgxNTA4Lm1haWwubXVkLnlhaG9vLmNvbT4gPDk1NDk5OUM0LTU4RDUtNEUwRC04NjAyLUQ3MDgzMDNGOEJGRUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":58967,"nextInTopic":58970,"prevInTime":58968,"nextInTime":58970,"topicId":58949,"numMessagesInTopic":0,"msgSnippet":"Our family visited DC in July 2000, so Marty was 12. He s a very geographical kid. We went to the Smithsonian, the Washington Monument, and saw fireworks at ","messageBody":"<div id=\"ygrps-yiv-46980937\">&quot;Our family visited DC in July 2000, so Marty was 12. He&#39;s a very geographical <br/>\nkid. We went to the Smithsonian, the Washington Monument, and saw fireworks at <br/>\nthe reflecting pool on the mall. We also travelled by the Metro, so he was ALL <br/>\nset up to appreciate that Fallout game. :-)&quot;<br/>\n<br/>\nOh how exciting!!!! Those are the reasons it is so important to be interested in <br/>\nwhat your children like. I see too many parents who just say&quot; I do not like <br/>\nVideo Games&quot; and miss the opportunity to connect with their children.<br/>\nHow fun to discover things together and share new things because you were open <br/>\nto your child&#39;s passion even if they are something you would normally not choose <br/>\nfor yourself.<br/>\nYou don;t even have to play those games ( Fallout is way to hard for me!) but <br/>\njust be open to listen to your child and interested in learning a bit about it.<br/>\n<br/>\n<br/>\n <br/>\n <br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] What would be ideal in an unschooling interview?","postDate":"1295204975","msgId":58967,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk1NDk5OUM0LTU4RDUtNEUwRC04NjAyLUQ3MDgzMDNGOEJGRUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDE5MTk1OC42ODc3NS5xbUB3ZWI4MTUwOC5tYWlsLm11ZC55YWhvby5jb20+","referencesHeader":"PEFDRjk5QzMwLURDM0QtNDZGMC04RDlBLUJFOTY2QTMwNjQwRUBTYW5kcmFkb2RkLmNvbT4gPDc0NEY1QjBBOTJCRTQwM0VBM0E4NjFDRDU5N0Y4MDZGQGRlYm9yYWg3NmE3OWh2PiA8MTkxOTU4LjY4Nzc1LnFtQHdlYjgxNTA4Lm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":58966,"nextInTopic":58969,"prevInTime":58966,"nextInTime":58968,"topicId":58949,"numMessagesInTopic":0,"msgSnippet":"-=-I know very little about Fallout games but enough to know the story behind it and what a Pitboy is. I also know Fallout 3 is in a post apocalyptic","messageBody":"<div id=\"ygrps-yiv-305782003\">-=-I know very little about Fallout games but enough to know the story behind it <br/>\nand what a Pitboy is. I also know Fallout 3 is in a post apocalyptic Washington <br/>\nDC are. Now MD really wants to go visit DC with me and go to all the places of <br/>\nthe game like The Mall and the Museums. I am so looking forward to doing that <br/>\nwith him! I showed him pictures how those place on Fallout are real places. He <br/>\nis very excited about it.-=-<br/>\n<br/>\nOur family visited DC in July 2000, so Marty was 12.  He&#39;s a very geographical kid.  We went to the Smithsonian, the Washington Monument, and saw fireworks at the reflecting pool on the mall.  We also travelled by the Metro, so he was ALL set up to appreciate that Fallout game. :-)<br/>\n<br/>\nI&#39;m really loving the ideas in this topic.  Thank you all tons.  I&#39;m alway disappointed when people want &quot;to interview&quot; me but all they have is the same list of questions they ask everyone, or they want me to come up with the questions.   But that&#39;s the way of the world, thanks to school, I think.  People do as little as they &quot;have to&quot; do.  I realize I&#39;m kind of freakish in trying to do as much as I can. :-)<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] What would be ideal in an unschooling interview?","postDate":"1295203541","msgId":58966,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5MTk1OC42ODc3NS5xbUB3ZWI4MTUwOC5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PDc0NEY1QjBBOTJCRTQwM0VBM0E4NjFDRDU5N0Y4MDZGQGRlYm9yYWg3NmE3OWh2Pg==","referencesHeader":"PEFDRjk5QzMwLURDM0QtNDZGMC04RDlBLUJFOTY2QTMwNjQwRUBTYW5kcmFkb2RkLmNvbT4gPDc0NEY1QjBBOTJCRTQwM0VBM0E4NjFDRDU5N0Y4MDZGQGRlYm9yYWg3NmE3OWh2Pg=="},"prevInTopic":58965,"nextInTopic":58967,"prevInTime":58965,"nextInTime":58967,"topicId":58949,"numMessagesInTopic":0,"msgSnippet":"There is also an idea that unschooling parents are lazy, that they do what they like while their kids flounder, and grow more ignorant. I think a questions ","messageBody":"<div id=\"ygrps-yiv-1184257619\">&quot;&quot;&quot;There is also an idea that unschooling parents are lazy, that they do what <br/>\nthey like while their kids flounder, and grow more ignorant. I think a questions <br/>\nsomething like: What should unschooling parents do or be able to do to <br/>\nfacilitate their child&#39;s learning? Or : How involved with their children&#39;s <br/>\nlearning should unschooling parents be? Or something. &quot;&quot;<br/>\n<br/>\n<br/>\nI think  this a great point to make as I  have seen and heard unschooling <br/>\nparents that really do nothing  or very little   and think it is unschooling. I <br/>\nknow we discussed this  in the chats and how it will be different for <br/>\nevery child, family, and how it varies even in the same week .<br/>\nBut just &quot; LETTING THEM DO WHATEVER THEY WANT&quot;  and the parent is completely <br/>\nliving their own life with no connection to the child or interest in what they <br/>\nare doing is benign neglect.<br/>\nIs very difficult or me to explain  but I try to learn about all the things my <br/>\nkids have interest in so we can share and I can have knowledge (even if minimal) <br/>\nto talk to them about it or to listen to them talk about it, a biggie for my <br/>\nson. <br/>\n<br/>\nI know very little about Fallout games but enough to know the story behind it <br/>\nand what a Pitboy is. I also know Fallout 3 is in a post apocalyptic Washington <br/>\nDC are. Now MD really wants to go visit DC with me and go to all the places of <br/>\nthe game like The Mall and the Museums. I am so looking forward to doing that <br/>\nwith him! I showed him pictures how those place on Fallout are real places. He <br/>\nis very excited about it.<br/>\n<br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] What would be ideal in an unschooling interview?","postDate":"1295203073","msgId":58965,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYxMERGNkY4LTc0RjEtNDAzMi04OUY5LTYxNUQzQ0VCRkIyQ0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDc0NEY1QjBBOTJCRTQwM0VBM0E4NjFDRDU5N0Y4MDZGQGRlYm9yYWg3NmE3OWh2Pg==","referencesHeader":"PEFDRjk5QzMwLURDM0QtNDZGMC04RDlBLUJFOTY2QTMwNjQwRUBTYW5kcmFkb2RkLmNvbT4gPDc0NEY1QjBBOTJCRTQwM0VBM0E4NjFDRDU5N0Y4MDZGQGRlYm9yYWg3NmE3OWh2Pg=="},"prevInTopic":58964,"nextInTopic":58966,"prevInTime":58964,"nextInTime":58966,"topicId":58949,"numMessagesInTopic":0,"msgSnippet":"I love this one:  How can a child know what s best for him when he has no idea about what adult life will bring? How can a school know? How can parents know?","messageBody":"<div id=\"ygrps-yiv-422019296\">I love this one:  &quot;How can a child know what&#39;s best for him when he has no idea about what adult life will bring?&quot;<br/>\n<br/>\nHow can a school know?<br/>\nHow can parents know?<br/>\n<br/>\n-=-How can American children become world leaders or world class mathematicians and scientist if they have no formal foundation of knowledge in those fields? (the implication being unschooling parents are potentially undermining American political and economic strength)-=-<br/>\n<br/>\nAnd further assumptions being that 1) formal education in the U.S. is providing a strong foundation in math and science, and 2) that if some families unschool, all umpty-million of them will!<br/>\n<br/>\nThis is just beautiful.  Deb Lewis wrote this:<br/>\n<br/>\n-=-I really wanted to know that Dylan would be ok. That when he was grown he&#39;d be smart and self assured and happy. When I realized traditional schooling offered no guarantee of that, and in many ways it could leave a person feeling stupid and insecure and unhappy, I was calmer about my choice and more dedicated to avoiding the problems that schooling could cause. -=-<br/>\n<br/>\nBeautiful.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: What would be ideal in an unschooling interview?","postDate":"1295202404","msgId":58964,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlndmQ5NCs5bzRtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFDRjk5QzMwLURDM0QtNDZGMC04RDlBLUJFOTY2QTMwNjQwRUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":58963,"nextInTopic":58965,"prevInTime":58963,"nextInTime":58965,"topicId":58949,"numMessagesInTopic":0,"msgSnippet":"... ************ How is say yes more different from never say no ? What s the difference between moving away from arbitrary limits and a free-for-all? ...","messageBody":"<div id=\"ygrps-yiv-2035118390\">Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; What questions do you wish you could have asked or seen an answer to when you first wondered about unschooling?<br/>\n </span></blockquote>************<br/>\n<br/>\nHow is &quot;say yes more&quot; different from &quot;never say no&quot;?<br/>\n<br/>\nWhat&#39;s the difference between &quot;moving away from arbitrary limits&quot; and a free-for-all?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Or what information helped you get it when it seemed odd and crazy, when you first hear of it?<br/>\n </span></blockquote>*****************<br/>\n<br/>\n&quot;Your child is not you&quot; - that one stopped me cold, way back, when I was resisting, thinking it All sounded odd and crazy. It was a gigantic &quot;well duh&quot; moment in the best way. It was so obvious! And yet I was using my adult needs and fears waaaaay too much to make decisions about what my kids &quot;needed&quot; or &quot;needed to learn&quot;. <br/>\n<br/>\nOther than that, reading stories of unschooling days and lives - blogs and essays (Moving a Puddle is still one of my favorites) even shorter stories on message boards - anything that had real life details and showed parents questioning themselves gently and finding new solutions. Those all helped me build up my own ability to find more options in the moment. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":279647515,"authorName":"David Lewis","from":"&quot;David Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] What would be ideal in an unschooling interview?","postDate":"1295202015","msgId":58963,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc0NEY1QjBBOTJCRTQwM0VBM0E4NjFDRDU5N0Y4MDZGQGRlYm9yYWg3NmE3OWh2Pg==","referencesHeader":"PEFDRjk5QzMwLURDM0QtNDZGMC04RDlBLUJFOTY2QTMwNjQwRUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":58961,"nextInTopic":58964,"prevInTime":58962,"nextInTime":58964,"topicId":58949,"numMessagesInTopic":0,"msgSnippet":"These were some of the questions asked online last year after the Good Morning America segment on unschooling.    They are paraphrased and not quoted. How can","messageBody":"<div id=\"ygrps-yiv-2109134143\">These were some of the questions asked online last year after the Good Morning America segment on unschooling.    They are paraphrased and not quoted.   <br/>\n<br/>\nHow can children become disciplined adults if they&#39;re never made to stick to and finish difficult or unpleasant tasks?<br/>\n<br/>\nHow can a child know what&#39;s best for him when he has no idea about what adult life will bring?<br/>\n<br/>\nHow can American children become world leaders or world class mathematicians and scientist if they have no formal foundation of knowledge in those fields?   (the implication being unschooling parents are potentially undermining American political and economic strength)<br/>\n<br/>\nWon&#39;t a child&#39;s psychology be so different from schooled children that he&#39;ll never be able to fit into society?   <br/>\n<br/>\nMany people also commented on how awful they thought it was for children to have to be with their parents all the time.  That might be too basic, but many people do seem to think kids who don&#39;t get out of the house to go to school, never get out of the house at all. <br/>\n<br/>\nThere is also an idea that unschooling parents are lazy, that they do what they like while their kids flounder, and grow more ignorant.   I think a questions something like:  What should unschooling parents do or be able to do to facilitate their child&#39;s learning?  Or :  How involved with their children&#39;s learning should unschooling parents be?    Or something. <br/>\n<br/>\n***What questions do you wish you could have asked or seen an answer to when you first wondered about unschooling? Or what information helped you get it when it seemed odd and crazy, when you first hear of it?***<br/>\n<br/>\nI really wanted to know that Dylan would be ok.  That when he was grown he&#39;d be smart and self assured and happy.   When I realized traditional schooling offered no guarantee of that, and in many ways it could leave a person feeling stupid and insecure and unhappy, I was calmer about my choice and more dedicated to avoiding the problems that schooling could cause.    <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"interview question","postDate":"1295199124","msgId":58961,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQzNkJDMTUyLTdDMzItNDc0My05NjJDLTZBRkQ4MDIzMTkxRkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGlndjk5cStsN2wxQGVHcm91cHMuY29tPg==","referencesHeader":"PGlndjk5cStsN2wxQGVHcm91cHMuY29tPg=="},"prevInTopic":58960,"nextInTopic":58963,"prevInTime":58960,"nextInTime":58962,"topicId":58949,"numMessagesInTopic":0,"msgSnippet":"I m guessing the first part would be describing unschooling to those who have never heard of it, but the second part would be discussing it in more detail for","messageBody":"<div id=\"ygrps-yiv-2083704676\">I&#39;m guessing the first part would be describing unschooling to those who have never heard of it, but the second part would be discussing it in more detail for those who are listening because they are unschoolers or would like to be.  Please clarify the audience and the focus or thrust of it.  What&#39;s the trajectory? :-)<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":255893983,"authorName":"piscesgrrl","from":"&quot;piscesgrrl&quot; &lt;piscesgrrl@...&gt;","profile":"piscesgrrl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: What would be ideal in an unschooling interview?","postDate":"1295198330","msgId":58960,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlndjk5cStsN2wxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlndTlybCtmZmZsQGVHcm91cHMuY29tPg=="},"prevInTopic":58958,"nextInTopic":58961,"prevInTime":58959,"nextInTime":58961,"topicId":58949,"numMessagesInTopic":0,"msgSnippet":"These are the questions I mostly get, but they come from people in general, not people wanting to unschool: How do you know they re learning? What about things","messageBody":"<div id=\"ygrps-yiv-1327925162\">These are the questions I mostly get, but they come from people in general, not people wanting to unschool:<br/>\n<br/>\nHow do you know they&#39;re learning?<br/>\nWhat about things like physics and calculus?<br/>\nIs that legal?<br/>\nHow do you know they&#39;re keeping up with their school peers?<br/>\nHow will they get into college?<br/>\nWhat if all they want to do is play video games/watch tv?<br/>\n<br/>\n<br/>\nFrom people wanting to unschool (or who think they unschool), I mostly get:<br/>\n<br/>\nHow do you get your kids to listen to you?  Do chores?  Go to bed on time?<br/>\nAnd lots of &quot;that works for your kids because they&#39;re inquisitive, etc, but MY kids would just watch tv/play video games all day if I let them.&quot;<br/>\n<br/>\nLaura<br/>\nwww.piscesgrrrl.blogspot.com</div>","specialLinks":[]},{"userId":284087656,"authorName":"Karen James","from":"Karen James &lt;semajrak@...&gt;","profile":"semajrak","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: What would be ideal in an unschooling interview?","postDate":"1295190065","msgId":58958,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGk9cHRrWFJfUEJEUFRicmgzd3pLckxHUTNKQTRRc2dEOHpPYkJVR0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGlndjBhbSs5YTR2QGVHcm91cHMuY29tPg==","referencesHeader":"PEFDRjk5QzMwLURDM0QtNDZGMC04RDlBLUJFOTY2QTMwNjQwRUBTYW5kcmFkb2RkLmNvbT4JPGlndjBhbSs5YTR2QGVHcm91cHMuY29tPg=="},"prevInTopic":58957,"nextInTopic":58960,"prevInTime":58957,"nextInTime":58959,"topicId":58949,"numMessagesInTopic":0,"msgSnippet":"Some of the controls I was holding on to, I let go of all at once--like junk foods, media time, bedtime.  This led to less clarity about what we were hoping to","messageBody":"<div id=\"ygrps-yiv-1893217232\">Some of the controls I was holding on to, I let go of all at once--like junk<br/>\nfoods, media time, bedtime.  This led to less clarity about what we were<br/>\nhoping to accomplish in the long run.  At the time, it just looked like<br/>\nchaos.  I feel I should have approached it much differently--a more natural<br/>\ntransition of yeses and observation, and not this big all-at-once shift.<br/>\nPerhaps a question like:<br/>\n<br/>\nHow do we invite the influences we fear into our lives, and begin to trust<br/>\nthat we can live and learn from/with them?<br/>\n<br/>\nKaren.<br/>\n<br/>\n----------<br/>\njamesfamilyedutrip.blogspot.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":472480490,"authorName":"sheeboo2","from":"&quot;sheeboo2&quot; &lt;brmino@...&gt;","profile":"sheeboo2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: What would be ideal in an unschooling interview?","postDate":"1295189142","msgId":58957,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlndjBhbSs5YTR2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFDRjk5QzMwLURDM0QtNDZGMC04RDlBLUJFOTY2QTMwNjQwRUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":58956,"nextInTopic":58958,"prevInTime":58956,"nextInTime":58958,"topicId":58949,"numMessagesInTopic":0,"msgSnippet":"* How to face/quiet all the fear; how attempting to control (learning, TV, food, another s behavior) comes from a place of fear. (Reading the Rat Park study","messageBody":"<div id=\"ygrps-yiv-756042561\">* How to face/quiet all the fear; how attempting to control (learning, TV, food, another&#39;s behavior) comes from a place of fear. (Reading the Rat Park study was a major turning point for me)<br/>\n<br/>\n* As someone else mentioned, and in reference to yesterday&#39;s Add Light and Stir, all the rich ways learning happens (differently than the school-age/grade-model) prior to reading and what is lost by privileging print over all other media<br/>\n<br/>\n* Choice, right here--right now to act/be kinder, more open, more aware of our child(ren) for who they really are. &quot;Have to&quot;.....<br/>\n<br/>\nBrie</div>","specialLinks":[]},{"userId":363518215,"authorName":"Claire","from":"&quot;Claire&quot; &lt;claire.horsley08@...&gt;","profile":"claire.horsley08","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: What would be ideal in an unschooling interview?","postDate":"1295179563","msgId":58955,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlndW12Yis1ZDFjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEM5NDg3NDhCLUFFREYtNDZCMi1BQTlDLTFEQkM4NzE2OTZGMkBmcmlpLmNvbT4="},"prevInTopic":58954,"nextInTopic":58956,"prevInTime":58954,"nextInTime":58956,"topicId":58949,"numMessagesInTopic":0,"msgSnippet":"Something about relationships being at the heart of a wonderful and peaceful unschooling life. About the way connecting with your child through little daily","messageBody":"<div id=\"ygrps-yiv-294605770\">Something about relationships being at the heart of a wonderful and peaceful unschooling life. About the way connecting with your child through little daily events forms the basis for something big - a profound and deeply enriching connection for both parent and child.<br/>\n<br/>\nI think one of the best skills an unschooling parent can possess is the ability to be open. Open to other ways of doing things, other timeframes, open to admitting they made a mistake, open to change. Unschooling will only really fly if the parents face up to and deal with their shizz so it is not passed on. Parents stand between school and their kids, but also between their kids and the hurts of previous generations. If they can stop those hurts being passed on, who knows what their kids can do!<br/>\n<br/>\nClaire</div>","specialLinks":[]},{"userId":333388203,"authorName":"Rinelle","from":"&quot;Rinelle&quot; &lt;rinelle@...&gt;","profile":"rinelle2011","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] What would be ideal in an unschooling interview?","postDate":"1295176617","msgId":58956,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQ1MTc0NjBGRUQyMTRFRUI4Qzg4RDhCRDc0NjZBRkJEQFRhbWFyYT4=","inReplyToHeader":"PEFDRjk5QzMwLURDM0QtNDZGMC04RDlBLUJFOTY2QTMwNjQwRUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PEFDRjk5QzMwLURDM0QtNDZGMC04RDlBLUJFOTY2QTMwNjQwRUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":58955,"nextInTopic":58957,"prevInTime":58955,"nextInTime":58957,"topicId":58949,"numMessagesInTopic":0,"msgSnippet":"From: Sandra Dodd  ** What questions do you wish you could have asked or seen an answer to when you first wondered about unschooling?","messageBody":"<div id=\"ygrps-yiv-1663591611\">From: &quot;Sandra Dodd&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt;<br/>\n<br/>\n** What questions do you wish you could have asked or seen an answer to when <br/>\nyou first wondered about unschooling?  Or what information helped you get it <br/>\nwhen it seemed odd and crazy, when you first hear of it? **<br/>\n<br/>\nI think a big one is &quot;How will he/she ever learn to do something he/she <br/>\ndoesn&#39;t like if I don&#39;t make him?&quot;  I hear that one a LOT.<br/>\n<br/>\nTamara</div>","specialLinks":[]},{"userId":67727291,"authorName":"wtexans","from":"&quot;wtexans&quot; &lt;wtexans@...&gt;","profile":"wtexans","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: What would be ideal in an unschooling interview?","postDate":"1295166133","msgId":58954,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlndTlybCtmZmZsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDg3NjQ5REIyLUVBNjQtNDQxNi1BNDNDLTczN0Q5NzlGMkQ2OEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":58953,"nextInTopic":58955,"prevInTime":58953,"nextInTime":58955,"topicId":58949,"numMessagesInTopic":0,"msgSnippet":"===I figured one question could be what are the questions you answer over and over?=== How will he learn what he needs to know? -- This was one of the big","messageBody":"<div id=\"ygrps-yiv-115935798\">===I figured one question could be what are the questions you answer over and over?===<br/>\n<br/>\n&quot;How will he learn what he needs to know?&quot; -- This was one of the big questions my husband and I had when we first explored homeschooling, and then unschooling.<br/>\n<br/>\nI like presenting it from the perspective of, &quot;Think about the things you learned *other than* in school -- knowledge specific to your job and/or knowledge specific to a hobby. How did you learn those things if you didn&#39;t learn them in school?&quot; I wish *that* perspective was one someone had suggested back when we were new to unschooling. When someone eventually presented it to me that way, it gave me something solid to which I could refer, something personal to which I could relate. It was substantially more helpful than a generic reassurance that my child *would* learn.<br/>\n<br/>\nIn conjunction with the above, becoming thoughtful about the word &quot;need&quot; helped nudge me towards a big perspective shift. Not just in relation to what my child &quot;needed to learn&quot;, but also in relation to every part of my life (&quot;need to clean the kitchen&quot;; &quot;need to make my child shower daily&quot;; &quot;we need to sleep &#39;normal&#39; hours; ec.).<br/>\n<br/>\nGlenda</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: What would be ideal in an unschooling interview?","postDate":"1295160671","msgId":58953,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg3NjQ5REIyLUVBNjQtNDQxNi1BNDNDLTczN0Q5NzlGMkQ2OEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGlndTA5aituOGZlQGVHcm91cHMuY29tPg==","referencesHeader":"PGlndTA5aituOGZlQGVHcm91cHMuY29tPg=="},"prevInTopic":58952,"nextInTopic":58954,"prevInTime":58952,"nextInTime":58954,"topicId":58949,"numMessagesInTopic":0,"msgSnippet":"-=-Who s the target audience? What I would consider basic questions for folks who already homeschool differs somewhat from what I d consider basic questions","messageBody":"<div id=\"ygrps-yiv-1170748737\">-=-Who&#39;s the target audience? What I would consider basic questions for folks who already homeschool differs somewhat from what I&#39;d consider basic questions for folks who haven&#39;t thought much about homeschooling, much less unschooling.-=-<br/>\n<br/>\nSome of both.<br/>\n<br/>\nI suppose there should be some general into questions and some less same-old.  I figured one question could be what are the questions you answer over and over?<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":147283564,"authorName":"Jill Parmer","from":"Jill Parmer &lt;jparmer@...&gt;","profile":"jparm02","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] What would be ideal in an unschooling interview?","postDate":"1295157946","msgId":58952,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM5NDg3NDhCLUFFREYtNDZCMi1BQTlDLTFEQkM4NzE2OTZGMkBmcmlpLmNvbT4=","inReplyToHeader":"PEFDRjk5QzMwLURDM0QtNDZGMC04RDlBLUJFOTY2QTMwNjQwRUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PEFDRjk5QzMwLURDM0QtNDZGMC04RDlBLUJFOTY2QTMwNjQwRUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":58951,"nextInTopic":58953,"prevInTime":58951,"nextInTime":58953,"topicId":58949,"numMessagesInTopic":0,"msgSnippet":"... Something along the lines of what could the parent shift for themselves to get unschooling faster? ... Look through the perspective of your child.  I m","messageBody":"<div id=\"ygrps-yiv-2071438284\">On Jan 15, 2011, at 8:57 PM, Sandra Dodd wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &lt;&lt;&lt;What questions do you wish you could have asked or seen an answer to when you first wondered about unschooling?&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>Something along the lines of what could the parent shift for themselves to get unschooling faster?   <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &lt;&lt;&lt;Or what information helped you get it when it seemed odd and crazy, when you first hear of it?&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>Look through the perspective of your child.  I&#39;m trying to remember what I read often on the old unschooling message boards...  Look at life through the eyes of your child.<br/>\n<br/>\n~Jill P<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] What would be ideal in an unschooling interview?","postDate":"1295156896","msgId":58951,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM3NjkwLjEwNTMwLnFtQHdlYjExMDQwNS5tYWlsLmdxMS55YWhvby5jb20+","inReplyToHeader":"PEFDRjk5QzMwLURDM0QtNDZGMC04RDlBLUJFOTY2QTMwNjQwRUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PEFDRjk5QzMwLURDM0QtNDZGMC04RDlBLUJFOTY2QTMwNjQwRUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":58950,"nextInTopic":58952,"prevInTime":58950,"nextInTime":58952,"topicId":58949,"numMessagesInTopic":0,"msgSnippet":"I didn t catch on right away how very different an unschooled child s knowledge was from a schooled child.  I didn t realize how much I really needed to know ","messageBody":"<div id=\"ygrps-yiv-134180085\">I didn&#39;t catch on right away how very different an unschooled child&#39;s knowledge <br/>\nwas from a schooled child.  I didn&#39;t realize how much I really needed to know <br/>\nabout natural child development and how vastly different it looked within a <br/>\nschool setting.  I found it so much easier to relax into unschooling once I <br/>\nreally understood that it did NOT look at all the same, not even the tiniest bit <br/>\nclose!<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":67727291,"authorName":"wtexans","from":"&quot;wtexans&quot; &lt;wtexans@...&gt;","profile":"wtexans","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: What would be ideal in an unschooling interview?","postDate":"1295156339","msgId":58950,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlndTA5aituOGZlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFDRjk5QzMwLURDM0QtNDZGMC04RDlBLUJFOTY2QTMwNjQwRUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":58949,"nextInTopic":58951,"prevInTime":58949,"nextInTime":58951,"topicId":58949,"numMessagesInTopic":0,"msgSnippet":"===I m going to be interviewed in a few months, and it will be publicized in advance.=== Who s the target audience? What I would consider basic questions for","messageBody":"<div id=\"ygrps-yiv-379361801\">===I&#39;m going to be interviewed in a few months, and it will be publicized in advance.===<br/>\n<br/>\nWho&#39;s the target audience? What I would consider basic questions for folks who already homeschool differs somewhat from what I&#39;d consider basic questions for folks who haven&#39;t thought much about homeschooling, much less unschooling.<br/>\n<br/>\nGlenda</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"What would be ideal in an unschooling interview?","postDate":"1295150254","msgId":58949,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFDRjk5QzMwLURDM0QtNDZGMC04RDlBLUJFOTY2QTMwNjQwRUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":58950,"prevInTime":58948,"nextInTime":58950,"topicId":58949,"numMessagesInTopic":0,"msgSnippet":"I m going to be interviewed in a few months, and it will be publicized in advance.  I ve been asked for a list of 15-20 questions people typically ask me about","messageBody":"<div id=\"ygrps-yiv-167865151\">I&#39;m going to be interviewed in a few months, and it will be publicized in advance.  I&#39;ve been asked for a list of 15-20 questions people typically ask me about unschooling.  I would  like to avoid the baby/basic questions, and go with more interesting angles.  I can look through some interviews and find things that led in rich directions, I guess, but I thought asking here might get lots of people thinking about the idea of what makes a good interview.<br/>\n<br/>\nSome of you will interview people, and some of you will be interviewed.  Some of you HAVE been interviewed.  Do you have any great questions for me to put on this list?<br/>\n<br/>\nI&#39;m five days late with this.  I thought the request had been 1/15, but it was 1/10.   I was pretty busy that day, and today was my first day off for a long time.  So I&#39;m late.  I said I would send something Sunday.  <br/>\n<br/>\nWhat questions do you wish you could have asked or seen an answer to when you first wondered about unschooling?  Or what information helped you get it when it seemed odd and crazy, when you first hear of it?<br/>\n<br/>\nThanks,<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":59092,"nextTopicId":59323}}