{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: from Enel/Rannalearning:   Happy to join you ... with a lot of questions","postDate":"1257874045","msgId":48542,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFGQjFEQUMyLUFDODUtNEZDOS1CMUFFLUY5MjUwNkE1OTNCN0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDQ4NDkyNC42MDgwMy5xbUB3ZWIxMTMwMTIubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PDQ4NDkyNC42MDgwMy5xbUB3ZWIxMTMwMTIubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":48539,"nextInTopic":0,"prevInTime":48541,"nextInTime":48543,"topicId":48521,"numMessagesInTopic":0,"msgSnippet":"... I don t think it s reasonable to expect her to expand beyond her school duties. Lots of teachers and counselors begin, eager to make exciting changes and","messageBody":"<div id=\"ygrps-yiv-370225437\">On Nov 9, 2009, at 1:37 PM, Enel Woods wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; From the description that I have given her she has taken very  <br/>\n&gt; little, and probably done no research her own.<br/>\n<br/>\n </span></blockquote>I don&#39;t think it&#39;s reasonable to expect her to expand beyond her  <br/>\nschool duties.<br/>\n<br/>\nLots of teachers and counselors begin, eager to make exciting changes  <br/>\nand help people. They soon realize they and their jobs exist to  <br/>\nsupport the school system, not the kids. Their new and exciting  <br/>\nthings are not welcome.<br/>\n<br/>\nTeachers and counselors all want to help kids (or they all start out  <br/>\nwanting to help!), but schools aren&#39;t made to help individual kids.  <br/>\nSchools are made to treat kids like products on an assembly line.  <br/>\nSchools were originally designed when assembly lines in factories  <br/>\nwere brand new and wonderful and efficient. Assembly lines are good  <br/>\nfor making cheap uniform products. But assembly lines aren&#39;t good for  <br/>\nindividuals. Assembly lines need products that are all the same. So  <br/>\nschools hire counselors to change the troublesome students into  <br/>\nuniform products so they can be slipped back onto the assembly line.<br/>\n<br/>\nAssembly lines may make schools cheap to run. But assembly lines  <br/>\naren&#39;t good for learning! They aren&#39;t good for individuals!<br/>\n<blockquote><span title=\"ireply\"> &gt; he did give my son a academic assignment (to write 2 essays of  <br/>\n&gt; rental historic movies)<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>You trust that because the counselor is a professional that what  <br/>\nshe&#39;s assigning will be good for your son.<br/>\n<br/>\nThe problem is that no one in the school system knows anything about  <br/>\nhow children naturally learn. They only know the effect of forced  <br/>\nlearning. They only know ways to try to get kids who resist forced  <br/>\nlearning to accept forced learning.<br/>\n<br/>\nHer *job* requires that she get your son to produce something so that  <br/>\nshe can prove to those who oversee her that she&#39;s getting him to  <br/>\n(supposedly) learn. But producing something *doesn&#39;t* mean someone  <br/>\nhas learned something! *All* it means is someone produced something  <br/>\nthey were told to.<br/>\n<br/>\nReal learning often happens silently and in no predictable order.  <br/>\nIt&#39;s very hard to prove that real learning is happening.<br/>\n<br/>\nYour son will learn fine without producing something. Your son will  <br/>\nlearn fine without proving to someone he&#39;s learning. A far far better  <br/>\nuse for his time is to watch a movie and have a natural conversation  <br/>\nwith you about it, about what you each liked and didn&#39;t like, what  <br/>\nyou thought could be better, how it compared to some other movie ...  <br/>\nThat is, a typical conversation he might have with a friend who was  <br/>\nalso passionate about something.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Do you think it is time to let the counselor go or should I give it  <br/>\n&gt; another try to explain her our principles of not pushing and giving  <br/>\n&gt; time to heal?<br/>\n<br/>\n </span></blockquote>I think the best healing will be done far from anything that  <br/>\nresembles what crushed his spirit before. Declare it vacation time  <br/>\nand do things he loves to do. :-)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; He was on suicide watch with county mental health (where the  <br/>\n&gt; counselor is also) wen we stumbled to Anna - local homeschooling  <br/>\n&gt; veteran ... I pulled my kids out from CAVA the next day :)<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>If he still feels suicidal, that&#39;s the most important thing to deal  <br/>\nwith.<br/>\n<br/>\nIf he felt suicidal because of school and activities that reminded  <br/>\nhim of school, then school is like poison to him and dropping school  <br/>\nis the best thing you can do for him and the quickest way to help  <br/>\nhim  heal.<br/>\n<br/>\nIf he needs more counseling to deal with the depression, you could  <br/>\nhelp him best by finding a counselor who is unschooling friendly, who  <br/>\nwould understand that you&#39;re trying to help him be happy, not trying  <br/>\nto &quot;fix&quot; him so he&#39;ll fit into school.<br/>\n<blockquote><span title=\"ireply\"> &gt; Is it time for me to take a breath and just analize where I am and  <br/>\n&gt; where my family is? To just relax?<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Relaxing is good!<br/>\n<br/>\nFocus only on their happiness and well being. Forget academics.<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":416561718,"authorName":"Enel Woods","from":"Enel Woods &lt;rannalearning@...&gt;","profile":"rannalearning","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: from Enel/Rannalearning :  Happy to join you ... with a lot of questions","postDate":"1257791852","msgId":48539,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ4NDkyNC42MDgwMy5xbUB3ZWIxMTMwMTIubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":48521,"nextInTopic":48542,"prevInTime":48538,"nextInTime":48540,"topicId":48521,"numMessagesInTopic":0,"msgSnippet":"Thank you, Robyn, for your very wise words. Like soothing rain I really appreciate it at this time of transition and uncertainty in my life. I felt very","messageBody":"<div id=\"ygrps-yiv-671852850\">Thank you, Robyn, for your very wise words. Like soothing rain I really appreciate it at this time of transition and uncertainty in my life.<br/>\n<br/>\nI felt very foolish and bad all day and night yesterday ... analyzing  my reaction to your first response to my post, what distorted my understanding of your message ... I could understand that fear of rejection and fear of letting more mistakes happen to potentially further harm my kids triggered something in my psyche to misread your truly supportive words, to react defensively. My deepest apologies to you.<br/>\n<br/>\nAs for my older son - the counselor has been pleasure to try and work with through the public school days, but she has no knolege about homeschooling or unschooling. From the description that I have given her she has taken very little, and probably done no research her own. She did give my son a academic assignment (to write 2 essays of rental historic movies) and my son has found many excuses to not do it ... reluctant to even watch the movies we got. I am not pushing him at all, and suggested to go to library to rent something he likes (we ended up watching his favorite Aliens together yesterday after I put the little ones to bed).<br/>\nDo you think it is time to let the counselor go or should I give it another try to explain her our principles of not pushing and giving time to heal? <br/>\nMy sons depression was related to school where he never felt like he fits in, never wanted to make friends and eventually ended being bullied. We lived in this school district years ago when he went through a lot of stress after we moved to this country, having &quot;tantrums&quot; at school where paramedics were called, being bullied and not understood by teachers. We moved to San Diego to get more extended family support for 2 years and things improved for him greatly ... while my marriage crumbled since my husband was still working in LA. So we moved back leaving the new friends of my sons and the school that felt safe to him. It was 2 years ago and his depression has escalated to the point where he no longer agreed to go out of the house or even his bed ... that is when I decided to try well advertised K12 program (CAVA) that ended up being still just a public school but virtual, far from what I imagined homeschooling to be. My teen liked the idea of not going<br/>\n to schoolhouse, but all the new info and the pressure to keep up crumbled him totally!!! He was on suicide watch with county mental health (where the counselor is also) wen we stumbled to Anna - local homeschooling veteran ... I pulled my kids out from CAVA the next day :)<br/>\n<br/>\nThat is where the healing began. But I think I need to take a little break too - I&#39;ve been on the computer most of the time gathering info, learning ... Is it time for me to take a breath and just analize where I am and where my family is? To just relax? <br/>\nBut I feel like I have missed out on all this good stuff for years! I still feel like I have so many questions when I took to my shoulders such big responsibility ...<br/>\n<br/>\nAnd I will put my fears aside about my younger son and let him enjoy the whole experience as it folds :) That little trooper is doing much better without the public school system also, even when he misses the kids from his class. <br/>\n<br/>\nThank you all!<br/>\nEnel<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":416561718,"authorName":"Enel Woods","from":"Enel Woods &lt;rannalearning@...&gt;","profile":"rannalearning","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: from Enel/Rannalearning :  Happy to join you ... with a lot of questions","postDate":"1257743322","msgId":48521,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcxNjU5Ny45MzIwMi5xbUB3ZWIxMTMwMDIubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":0,"nextInTopic":48539,"prevInTime":48520,"nextInTime":48522,"topicId":48521,"numMessagesInTopic":0,"msgSnippet":"Thank you Lyla! Now that I read it again I understand. And sincere apologies to Robyn. I have been very critical of myself and also internalizing things too","messageBody":"<div id=\"ygrps-yiv-1437043992\">Thank you Lyla! Now that I read it again I understand. And sincere apologies to Robyn.<br/>\nI have been very critical of myself and also internalizing things too fast. I too am still healing and learning.<br/>\nTalking about learning - my letter ended up forwarded to a wrong place anyhow. This is not the &quot;service desk&quot; I was looking for ... I apologise for this, and thank you all for kind advice and your time.<br/>\nEnel<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":48446,"nextTopicId":48501}}