{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Iraq","postDate":"1044304598","msgId":57695,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBNjQzRDA2LjEzNjlBJWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDNFM0VCRDJELjY3OTBCQ0VAdmVyaXpvbi5uZXQ+"},"prevInTopic":57686,"nextInTopic":0,"prevInTime":57694,"nextInTime":57696,"topicId":57686,"numMessagesInTopic":0,"msgSnippet":"Let s do our best not to bring up the subject of Iraq. There are families here with loved ones who could be involved and the subject is a painful one for them.","messageBody":"<div id=\"ygrps-yiv-1058239167\">Let&#39;s do our best not to bring up the subject of Iraq. There are families<br/>\nhere with loved ones who could be involved and the subject is a painful one<br/>\nfor them.<br/>\n<br/>\nThanks.<br/>\n<br/>\nJoyce<br/>\nUnschooling-dotcom moderator</div>","specialLinks":[]},{"userId":112038769,"authorName":"Shyrley","from":"Shyrley &lt;shyrley.williams@...&gt;","profile":"bobalinga","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Interesting article - long though","postDate":"1044299054","msgId":57686,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNFM0VCRDJELjY3OTBCQ0VAdmVyaXpvbi5uZXQ+","referencesHeader":"PDFkNy4xODI0ZjQ1LjJiNzAxMjc5QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":57695,"prevInTime":57685,"nextInTime":57687,"topicId":57686,"numMessagesInTopic":0,"msgSnippet":"Randolph T. Holhut: Searching for truth about this war Posted on Monday, February 03 @ 09:37:44 EST By Randolph T. Holhut, American Reporter Correspondent ","messageBody":"<div id=\"ygrps-yiv-265698292\">Randolph T. Holhut: &#39;Searching for<br/>\n                     truth about this war&#39;<br/>\n                     Posted on Monday, February 03 @ 09:37:44 EST<br/>\n<br/>\n                     By Randolph T. Holhut, American<br/>\n                     Reporter Correspondent<br/>\n<br/>\n                     DUMMERSTON, Vt. -- Sam Smith, editor of The Progressive<br/>\n                     Review (prorev.com), recently offered what he called the<br/>\n                     &quot;Standardized Conflagration Competency Exam.&quot;<br/>\n<br/>\n                     His 10 questions should be asked of everyone in the Bush<br/>\n                     administration.<br/>\n<br/>\n                          1. In order to get rid of Saddam Hussein it is likely that<br/>\n                          some Americans will be killed as well. How many do<br/>\n                          you think is a reasonable number? How many is too<br/>\n                          many?<br/>\n<br/>\n                          2. Some reports indicate that there are other people<br/>\n                          living in Iraq besides Saddam Hussein. How many<br/>\n                          would be worth killing in order to get rid of Hussein?<br/>\n                          How many is too many? Does this also apply to those<br/>\n                          who have no weapons of mass destruction in their<br/>\n                          homes?<br/>\n<br/>\n<br/>\n<br/>\n                          3. When will the Afghan invasion be over? How can we<br/>\n                          tell?<br/>\n<br/>\n                          4. If we bomb Baghdad, some targets in the U.S. may be<br/>\n                          hit in retaliation. Which of the following are<br/>\n                          expendable in order to rid Iraq of Saddam Hussein?<br/>\n                               The Sears Tower;<br/>\n<br/>\n                               The New York Stock Exchange;<br/>\n<br/>\n                               Hoover Dam;<br/>\n<br/>\n                               New York City;<br/>\n<br/>\n                               New York City excluding Manhattan;<br/>\n<br/>\n                               The New York Times and Washington Post<br/>\n                               editorial offices; or<br/>\n<br/>\n                               The headquarters of the Council on Foreign<br/>\n                               Relations<br/>\n                          5. List the names of all relatives you consider<br/>\n                          expendable in the effort to rid Iraq of Saddam Hussein.<br/>\n<br/>\n                          6. List those cities that could be damaged by chemical,<br/>\n                          biological, or nuclear attack without discommoding<br/>\n                          the New American Century.<br/>\n<br/>\n                          7. After we obliterate Iraq, how many more countries<br/>\n                          do we need to invade?<br/>\n<br/>\n                          8. Are the people selling their stocks in the various<br/>\n                          markets appeasers, hippies, and Stalinists? If not, why<br/>\n                          are they so worried about war?<br/>\n<br/>\n                          9. How did you get to be so smart about military<br/>\n                          operations?<br/>\n<br/>\n                          10. What can high level military doubters do to reach<br/>\n                          your level of proficiency in these matters?<br/>\n<br/>\n                     Smith may be arch in the extreme with this little quiz, but the<br/>\n                     essential truth of this exercise is undeniable; namely, how<br/>\n                     much are the people who are gung ho for war willing to<br/>\n                     sacrifice?<br/>\n<br/>\n                     As has been pointed out many times in the past few months,<br/>\n                     the architects of this war - President Bush, Vice President<br/>\n                     Cheney, Defense Secretary Rumsfeld, Secretary of State<br/>\n                     Powell, National Security Advisor Rice and foreign policy<br/>\n                     underlings Wolfowitz, Perle and Armitage - have, with the<br/>\n                     exception of Powell, no direct experience with war. None of<br/>\n                     them have family members in the military. None of them<br/>\n                     have made any visible sacrifice in the &quot;war on terror.&quot; Yet,<br/>\n                     they are determined to plunge this nation into war.<br/>\n<br/>\n                     Yes, Saddam Hussein is evil and the world would be better off<br/>\n                     without him. But how many American and Iraqis will have to<br/>\n                     die in a preemptive, unprovoked war based on a threat that<br/>\n                     the U.S. created?<br/>\n<br/>\n                     A reminder of the nonsense that was fed to us during the<br/>\n                     runup to the first Persian Gulf War in 1990-91 is needed here.<br/>\n<br/>\n                     Begin with the unpleasant facts regarding relationship<br/>\n                     between the U.S. and Iraq in the 1980s. There was a reason<br/>\n                     why the U.S. decided to remove 8,000 pages from the dossier<br/>\n                     that Iraq presented to the UN Security Council before sharing<br/>\n                     it with the council&#39;s non-permanent members.<br/>\n<br/>\n                     As reported in December by the German newspaper Die<br/>\n                     Tageszeitung, dozens of American companies and the U.S.<br/>\n                     government itself provided assistance to Iraq in developing<br/>\n                     nuclear, chemical and biological weapons. When Iraq used<br/>\n                     chemical weapons during its 1980-88 war with Iran, the U.S.<br/>\n                     looked the other way since the U.S. was hoping Iraq would<br/>\n                     destroy Iran, or even better, both sides would destroy each<br/>\n                     other.<br/>\n<br/>\n                     There also wasn&#39;t much concern at first in the summer of<br/>\n                     1990 when Iraq threatened to invade Kuwait. April Glaspie,<br/>\n                     the U.S. ambassador to Iraq, told Saddam Hussein in July<br/>\n                     1990 that the U.S. had &quot;no opinion on Arab-Arab conflicts,<br/>\n                     like your border agreement with Kuwait.&quot; Not surprisingly,<br/>\n                     Saddam welcomed that statement and invaded Kuwait the<br/>\n                     following month.<br/>\n<br/>\n                     President George H.W. Bush&#39;s national security team at first<br/>\n                     didn&#39;t make much of a fuss about Saddam&#39;s actions. But the<br/>\n                     hawk faction, led by then-Defense Secretary Cheney,<br/>\n                     recognized an opportunity. It had only been a few months<br/>\n                     after the fall of the Berlin Wall and the end of Soviet control of<br/>\n                     Eastern Europe. With the Cold War ending, a war with Iraq<br/>\n                     would be the first step toward creating a &quot;new world order&quot;<br/>\n                     where the U.S. would be the unquestioned leader.<br/>\n<br/>\n                     This meant two things had to happen. One was that any<br/>\n                     attempts at a diplomatic solution that would avert war must<br/>\n                     be discouraged. The other was that Saddam Hussein had to be<br/>\n                     demonized to the extent of becoming a second Adolf Hitler.<br/>\n<br/>\n                     One of the lasting images from the propaganda campaign was<br/>\n                     the tearful testimony of a young Kuwaiti woman before a<br/>\n                     Congressional committee that Iraqi soldiers had tossed<br/>\n                     newborn babies out of hospital incubators in Kuwait and left<br/>\n                     them to die. It was a riveting tale; it just wasn&#39;t true.<br/>\n<br/>\n                     It wasn&#39;t until after the war that we found out the young<br/>\n                     woman was really the daughter of the Kuwaiti ambassador to<br/>\n                     the U.S., and that her testimony was arranged by the<br/>\n                     Washington-based public relations firm Hill & Knowlton as<br/>\n                     part of a PR campaign funded by Kuwait to bring the U.S. into<br/>\n                     the war.<br/>\n<br/>\n                     But this was just the tip of the misinformation iceberg. You<br/>\n                     may recall the stories of Iraqi troops - anywhere between<br/>\n                     200,000 and 500,000, depending on whose account you<br/>\n                     heard - that were massed on the Saudi Arabian border and<br/>\n                     poised to strike.<br/>\n<br/>\n                     The U.S. satellite photos that allegedly showed these troops<br/>\n                     were part of the evidence used to justify a war with Iraq -<br/>\n                     except that Russian satellite photos taken of the same area at<br/>\n                     the same time showed no Iraqi troops. The U.S. photos are<br/>\n                     still classified, and you can probably deduce the reason why.<br/>\n<br/>\n                     When the shooting war finally began on Jan. 16, 1991, the<br/>\n                     press was kept away and only a totally sanitized, heavily<br/>\n                     censored version of events was shown. The dominant image<br/>\n                     came from the gunsight cameras - video game-like footage of<br/>\n                     laser guided &quot;smart bombs&quot; hitting their targets. The reality<br/>\n                     was that more than 90 percent of the 142,000 tons of<br/>\n                     ordinance dropped on Iraq were old-fashioned, unguided<br/>\n                     dumb bombs.<br/>\n<br/>\n                     One of those &quot;dumb&quot; bombs hit a factory in a Baghdad suburb<br/>\n                     that produced infant formula. The U.S. claimed it was a<br/>\n                     military installation. While the Iraqis may have been clumsy<br/>\n                     in their counter-propaganda (like the big sign out front of the<br/>\n                     plant that read &quot;BABY MILK FACTORY&quot; in English), the reality<br/>\n                     - according to declassified U.S. State Department documents -<br/>\n                     was that the plant did indeed produce baby milk.<br/>\n<br/>\n                     But the U.S. won that propaganda battle and avoided the<br/>\n                     scrutiny that should have come from deliberately and<br/>\n                     systematically targeting civilian infrastructure in the<br/>\n                     bombing campaign - something that&#39;s in total violation of the<br/>\n                     Geneva Convention prohibitions.<br/>\n<br/>\n                     Even the number of Iraqi causalities in Gulf War I have not<br/>\n                     been truthfully reported. Part of it is U.S. reluctance to admit<br/>\n                     the lopsidedness of the war. While there were only 79 U.S.<br/>\n                     soldiers killed in action, it&#39;s estimated that more than 45,000<br/>\n                     Iraqi soldiers and civilians died during the war.<br/>\n<br/>\n                     Then throw in the 100,000 Iraqis who died from the<br/>\n                     post-war violence and disease. Throw on top of that the more<br/>\n                     than 500,000 Iraqi children that have died from starvation<br/>\n                     and disease in the decade after the war. And don&#39;t forget the<br/>\n                     five million refugees the war produced.<br/>\n<br/>\n                     Most of the cast of characters that shaped Gulf War I are on<br/>\n                     the national security team of George W. Bush and they have<br/>\n                     been planning for Gulf War II almost since the first war<br/>\n                     ended. And the lies from the first war are being amplified as<br/>\n                     we head into the second.<br/>\n<br/>\n                     Have we seen an honest accounting of the extent that the<br/>\n                     U.S., Britain, Germany and other Western countries aided the<br/>\n                     Iraqi weapons program? Or of how many Iraqis died in the<br/>\n                     first Gulf War? Or of the extent of the damage done to Iraq by<br/>\n                     the war and the 11 years of economic sanctions and periodic<br/>\n                     bombings? Or why are there 160,000 U.S. veterans of Gulf<br/>\n                     War I receiving medical treatment for a variety of ailments<br/>\n                     related to the various toxins they were exposed to in the war?<br/>\n<br/>\n<br/>\n                     The answer is no.<br/>\n<br/>\n                     And then there are the fresh lies. For example, the Bush<br/>\n                     administration recently lowered the estimated cost of Gulf<br/>\n                     War II down to about $60 billion. Not because the cost has<br/>\n                     gone down, mind you. The new lower cost of the war is pure<br/>\n                     fiction dreamt up because the more realistic $200 billion<br/>\n                     cost we heard a few months ago was deemed to be too scary.<br/>\n<br/>\n                     There is little debate that the world is better off without<br/>\n                     Saddam Hussein, but the big question remains unanswered<br/>\n                     by the people who are rushing us off to war. Is the effort to<br/>\n                     get rid of him is worth the price that other people - and not<br/>\n                     the architects of this new war - will have to pay?<br/>\n<br/>\n                     Randolph T. Holhut has been a journalist in New England for<br/>\n                     more than 20 years. He edited &quot;The George Seldes Reader&quot;<br/>\n                     (Barricade Books).<br/>\n<br/>\n                     Copyright 2003 Joe Shea The American Reporter.<br/>\n<br/>\n                     Reprinted from The American Reporter:<br/>\n                     <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.american-reporter.com/\">http://www.american-reporter.com/</a><br/>\n                     2031W/3.html</div>","specialLinks":[]}],"prevTopicId":57687,"nextTopicId":57696}}