{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":257127,"authorName":"Deb","from":"Deb &lt;herbtea@...&gt;","profile":"live_oak2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Jewish Messiah Requirements","postDate":"1028822301","msgId":40297,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNENTI5NTFELkE4MDFBRTNBQGd0ZS5uZXQ+","referencesHeader":"PDEwMjg4MTMyODguMTY5My42MjA1MC5tM0B5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":40284,"nextInTopic":0,"prevInTime":40296,"nextInTime":40298,"topicId":40284,"numMessagesInTopic":0,"msgSnippet":"Elissa, thank you. That was the most awesome, clear and well-spoken message about what and why Jews believe. It is not often that Jewish views are spoken in","messageBody":"<div id=\"ygrps-yiv-1784959468\">Elissa, thank you. That was the most awesome, clear and well-spoken<br/>\nmessage about what and why Jews believe. It is not often that Jewish<br/>\nviews are spoken in public and clarified, while our Christian friends<br/>\nand neighbors speak theirs. I appreciate your speaking for us.<br/>\n<br/>\nDebbie<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;By contrast, Judaism believes that God created the physical world not to<br/>\n </span></blockquote>frustrate us, but for our pleasure. Jewish spirituality comes through<br/>\ngrappling with the mundane world in a way that uplifts and elevates.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;The Talmud says if a person has the opportunity to taste a new fruit and<br/>\n </span></blockquote>refuses to do so, he will have to account for that in the World to Come.<br/>\nJewish rabbinical schools teach how to live amidst the bustle of<br/>\ncommercial<br/>\nactivity. Jews don&#39;t retreat from life, we elevate it.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;Jews have never actively sought converts to Judaism because the Torah<br/>\n </span></blockquote>prescribes a righteous path for gentiles to follow, known as the &quot;Seven<br/>\nLaws<br/>\nof Noah.&quot; Maimonides explains that any human being who faithfully<br/>\nobserves<br/>\nthese basic moral laws earns a proper place in heaven.</div>","specialLinks":[]},{"userId":9440128,"authorName":"ElissaJC@concentric.net","from":"&lt;ElissaJC@...&gt;","profile":"elissajc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Jewish Messiah Requirements","postDate":"1028808382","msgId":40284,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxZWQwMWMyM2VkNCQwNDg5NmZlMCQ1ZTJhMDM0MEBFbGlzc2FKQz4="},"prevInTopic":0,"nextInTopic":40297,"prevInTime":40283,"nextInTime":40285,"topicId":40284,"numMessagesInTopic":0,"msgSnippet":"Sorry this took so long to get onto the list, I ve been a bit overwhelmed with moving and being without email for two months!! (I have 704 messages waiting -","messageBody":"<div id=\"ygrps-yiv-1097618569\">Sorry this took so long to get onto the list, I&#39;ve been a bit overwhelmed<br/>\nwith moving and being without email for two months!! (I have 704 messages<br/>\nwaiting - mostly from porn sites. It&#39;s taking a long time to read, er, I<br/>\nmean, delete them!)&#92;<br/>\nAnyway here is the Jewish view:<br/>\nElissa<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://members.aol.com/lazera/moshiach.htm\">http://members.aol.com/lazera/moshiach.htm</a><br/>\nan excerpt:<br/>\n&quot;The word moshiach means anointed. It is commonly translated as messiah.<br/>\nThe Moshiach will be a very righteous man from the family of King David with<br/>\na total commitment to the Torah. He will be anointed as king of the Jewish<br/>\npeople. He will reestablish the dynasty of King David, rebuild the Holy<br/>\nTemple in Jerusalem, and gather together all the Jews from throughout the<br/>\nworld to the land of Israel directing all of them to properly observe all of<br/>\nHaShem&#39;s laws. He will reestablish the laws of a Jewish Kingdom, including<br/>\nthe sacrificial service and other practices. Finally, he will perfect the<br/>\nworld, leading all humanity to serve HaShem in unity. The entire world will<br/>\nrealize that HaShem is the only God and they will all worship HaShem<br/>\ntogether. The world will be completely at peace.&quot;<br/>\nAnother from the same site:<br/>\nHow Do We Identify The Moshiach?<br/>\nWhen a person comes forth and claims to be the Moshiach, how can we know if<br/>\nhe is the real thing? Unfortunately, Jewish history has had several false<br/>\nclaimants to the title of Moshiach. Some of these false messiahs caused<br/>\ngreat turmoil and suffering. Christianity was founded by the followers of<br/>\none such false Moshiach. So we see that it is very important to have clear<br/>\nrules to identify the real Moshiach.<br/>\n<br/>\nThere are two stages in the identification of the Moshiach. The first stage<br/>\nis when someone first comes and claims to be Moshiach. He must fulfill the<br/>\nfollowing conditions:<br/>\n<br/>\nHe must be a father-to-son descendant of King David. Therefore, a Kohein,<br/>\nLevi, or a convert (and his children) cannot be Moshiach.<br/>\n<br/>\nHe must be completely immersed in the study of Torah, just like his ancestor<br/>\nDavid.<br/>\n<br/>\nHe must follow the entire Torah, both the Written and the Oral.<br/>\n<br/>\nHe must lead all the Jews back to the Torah, so that they follow all its<br/>\nlaws.<br/>\n<br/>\nIf a man comes who fulfills all of these conditions, then we assume that he<br/>\nis the Moshiach. This is the first stage of the identification of Moshiach.<br/>\nThe second stage is completed when the presumed Moshiach succeeds in<br/>\nrebuilding the Holy Temple in Jerusalem and gathering all the Jewish people<br/>\nin the land of Israel. At that point we know that he is certainly Moshiach.<br/>\n<br/>\nThese are the minimum requirements. Until a person succeeds in fulfilling<br/>\nall the requirements of the first stage, we are not allowed to accept him as<br/>\nMoshiach.<br/>\n<br/>\nIt is also important to know that the Moshiach does not have to perform<br/>\nmiracles to prove that he is the Moshiach. If he fulfills the requirements<br/>\nlisted above then he is the Moshiach, even if he never performed a single<br/>\nmiracle. Nevertheless, the Moshiach will be a great prophet. His level of<br/>\nprophecy will be higher than any other prophet except Moses.<br/>\n<br/>\nWhat Moshiach Is Not<br/>\nThere are many false ideas about Moshiach in the world. Many of these ideas<br/>\nhave been spread by Christianity. It is therefore important to clarify some<br/>\nof these points:<br/>\nMoshiach will be a normal human being born from human parents. He will not<br/>\nbe a god, or a son of god.<br/>\n<br/>\nMoshiach will be mortal. He will not live forever. When he dies he will be<br/>\nsucceeded by his son, like any normal king.<br/>\n<br/>\nMoshiach will not atone for our sins. Every person must atone for his own<br/>\nsins; no one else can do it for you.<br/>\n<br/>\nMoshiach will not change the laws of the Torah in any way. If he attempts to<br/>\ndo so then we know that he is a false messiah.<br/>\n<br/>\nAll of these issues point to a fundamental belief of Judaism. We must<br/>\nrecognize that the Moshiach is only a person who is a messenger from HaShem.<br/>\nHe is not our actual redeemer, for redemption only comes from HaShem. The<br/>\nMoshiach will be like Moses who took us out of Egypt. It was really HaShem<br/>\nwho took us out of Egypt, not Moses. That is one reason why we never even<br/>\nmention Moses in the entire Haggadah which we read at the Pesach Seder.<br/>\nMoses only served as a prophet, conveying the news of redemption to the<br/>\nJewish people and to Pharaoh and the Egyptians. The Moshiach will serve the<br/>\nsame function. It is important that we always focus on HaShem as our savior,<br/>\nand not on any human being. It is especially important that we never pray to<br/>\nany human being instead of HaShem. &quot;<br/>\nAnd lastly from another site:<br/>\n( <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.aish.com/rabbi/ATR_browse.asp?l=m&offset=9\">http://www.aish.com/rabbi/ATR_browse.asp?l=m&offset=9</a> )<br/>\nI am a Christian, and I was just wondering why Jesus is denied as the<br/>\nMessiah, even though he fulfills every prophecy written regarding the<br/>\nMessiah.<br/>\n<br/>\nI am not writing to be rude to you, I have a deep respect and love for the<br/>\nJewish people, and I know there are those who call themselves Christians,<br/>\nwho have said and done terrible things in the name of Jesus.<br/>\n<br/>\nThanks for taking time to read my letter. I hope to hear from you soon.<br/>\n<br/>\nTHE AISH RABBI REPLIES:<br/>\n<br/>\nThank you for your thoughtful question. For 2,000 years, Jews have rejected<br/>\nChristianity and the idea of Jesus as messiah. It is important to understand<br/>\nwhy Jews don&#39;t believe in Jesus. The purpose is not to disparage other<br/>\nreligions, but rather to clarify the Jewish position. The more data that&#39;s<br/>\navailable, the better-informed choices people can make about their spiritual<br/>\npath.<br/>\n<br/>\nJews do not accept Jesus as the messiah because:<br/>\n<br/>\n1) Jesus did not fulfill the messianic prophecies.<br/>\n<br/>\n2) Jesus did not embody the personal qualifications of the Messiah.<br/>\n<br/>\n3) Biblical verses &quot;referring&quot; to Jesus are mistranslations.<br/>\n<br/>\n4) Jewish belief is based on national revelation.<br/>\n<br/>\nAt the end of this answer, we will examine these additional topics:<br/>\n<br/>\n5) Christianity contradicts Jewish theology<br/>\n<br/>\n6) Jews and Gentiles<br/>\n<br/>\n7) Bringing the Messiah<br/>\n<br/>\n-------------------------------<br/>\n<br/>\n1) JESUS DID NOT FULFILL THE MESSIANIC PROPHECIES<br/>\n<br/>\nWhat is the Messiah supposed to accomplish? The Bible says that he will:<br/>\n<br/>\nA. Build the Third Temple (Ezekiel 37:26-28).<br/>\n<br/>\nB. Gather all Jews back to the Land of Israel (Isaiah 43:5-6).<br/>\n<br/>\nC. Usher in an era of world peace, and end all hatred, oppression, suffering<br/>\nand disease. As it says: &quot;Nation shall not lift up sword against nation,<br/>\nneither shall man learn war anymore.&quot; (Isaiah 2:4)<br/>\n<br/>\nD. Spread universal knowledge of the God of Israel, which will unite<br/>\nhumanity as one. As it says: &quot;God will be King over all the world -- on that<br/>\nday, God will be One and His Name will be One&quot; (Zechariah 14:9).<br/>\n<br/>\nThe historical fact is that Jesus fulfilled none of these messianic<br/>\nprophecies.<br/>\n<br/>\nChristians counter that Jesus will fulfill these in the Second Coming, but<br/>\nJewish sources show that the Messiah will fulfill the prophecies outright,<br/>\nand no concept of a second coming exists.<br/>\n<br/>\n---------------------------------------<br/>\n<br/>\n2) JESUS DID NOT EMBODY THE PERSONAL QUALIFICATIONS OF MESSIAH<br/>\n<br/>\nA. MESSIAH AS PROPHET<br/>\n<br/>\nJesus was not a prophet. Prophecy can only exist in Israel when the land is<br/>\ninhabited by a majority of world Jewry. During the time of Ezra (circa 300<br/>\nBCE), when the majority of Jews refused to move from Babylon to Israel,<br/>\nprophecy ended upon the death of the last prophets -- Haggai, Zechariah and<br/>\nMalachi.<br/>\n<br/>\nJesus appeared on the scene approximately 350 years after prophecy had<br/>\nended.<br/>\n<br/>\nB. DESCENDENT OF DAVID<br/>\n<br/>\nThe Messiah must be descended on his father&#39;s side from King David (see<br/>\nGenesis 49:10 and Isaiah 11:1). According to the Christian claim that Jesus<br/>\nwas the product of a virgin birth, he had no father -- and thus could not<br/>\nhave possibly fulfilled the messianic requirement of being descended on his<br/>\nfather&#39;s side from King David!<br/>\n<br/>\nC. TORAH OBSERVANCE<br/>\n<br/>\nThe Messiah will lead the Jewish people to full Torah observance. The Torah<br/>\nstates that all mitzvot remain binding forever, and anyone coming to change<br/>\nthe Torah is immediately identified as a false prophet. (Deut. 13:1-4)<br/>\n<br/>\nThroughout the New Testament, Jesus contradicts the Torah and states that<br/>\nits commandments are no longer applicable. (see John 1:45 and 9:16, Acts<br/>\n3:22 and 7:37)<br/>\n<br/>\n----------------------------------<br/>\n<br/>\n3) MISTRANSLATED VERSES &quot;REFERRING&quot; TO JESUS<br/>\n<br/>\nBiblical verses can only be understood by studying the original Hebrew<br/>\ntext -- which reveals many discrepancies in the Christian translation.<br/>\n<br/>\nA. VIRGIN BIRTH<br/>\n<br/>\nThe Christian idea of a virgin birth is derived from the verse in Isaiah<br/>\n7:14 describing an &quot;alma&quot; as giving birth. The word &quot;alma&quot; has always meant<br/>\na young woman, but Christian theologians came centuries later and translated<br/>\nit as &quot;virgin.&quot; This accords Jesus&#39; birth with the first century pagan idea<br/>\nof mortals being impregnated by gods.<br/>\n<br/>\nB. CRUCIFIXION<br/>\n<br/>\nThe verse in Psalms 22:17 reads: &quot;Like a lion, they are at my hands and<br/>\nfeet.&quot; The Hebrew word ki-ari (like a lion) is grammatically similar to the<br/>\nword &quot;gouged.&quot; Thus Christianity reads the verse as a reference to<br/>\ncrucifixion: &quot;They pierced my hands and feet.&quot;<br/>\n<br/>\nC. SUFFERING SERVANT<br/>\n<br/>\nChristianity claims that Isaiah chapter 53 refers to Jesus, as the<br/>\nsuffering servant.<br/>\n<br/>\nIn actuality, Isaiah 53 directly follows the theme of chapter 52, describing<br/>\nthe exile and redemption of the Jewish people. The prophecies are written in<br/>\nthe singular form because the Jews (&quot;Israel&quot;) are regarded as one unit. The<br/>\nTorah is filled with examples of the Jewish nation referred to with a<br/>\nsingular pronoun.<br/>\n<br/>\nIronically, Isaiah&#39;s prophecies of persecution refer in part to the 11th<br/>\ncentury when Jews were tortured and killed by Crusaders who acted in the<br/>\nname of Jesus.<br/>\n<br/>\nFrom where did these mistranslations stem? St. Gregory, 4th century Bishop<br/>\nof Nanianzus, wrote: &quot;A little jargon is all that is necessary to impose on<br/>\nthe people. The less they comprehend, the more they admire.&quot;<br/>\n<br/>\n--------------------------------------------<br/>\n<br/>\n4) JEWISH BELIEF IS BASED SOLELY ON NATIONAL REVELATION<br/>\n<br/>\nOf the 15,000 religions in human history, only Judaism bases its belief on<br/>\nnational revelation -- i.e. God speaking to the entire nation. If God is<br/>\ngoing to start a religion, it makes sense He&#39;ll tell everyone, not just one<br/>\nperson.<br/>\n<br/>\nJudaism, unique among all of the world&#39;s major religions, does not rely on<br/>\n&quot;claims of miracles&quot; as the basis for its religion. In fact, the Bible says<br/>\nthat God sometimes grants the power of &quot;miracles&quot; to charlatans, in order to<br/>\ntest Jewish loyalty to the Torah (Deut. 13:4).<br/>\n<br/>\nMaimonides states (Foundations of Torah, ch. 8):<br/>\n<br/>\nThe Jews did not believe in Moses, our teacher, because of the miracles he<br/>\nperformed. Whenever anyone&#39;s belief is based on seeing miracles, he has<br/>\nlingering doubts, because it is possible the miracles were performed through<br/>\nmagic or sorcery. All of the miracles performed by Moses in the desert were<br/>\nbecause they were necessary, and not as proof of his prophecy.<br/>\n<br/>\nWhat then was the basis of [Jewish] belief? The Revelation at Mount Sinai,<br/>\nwhich we saw with our own eyes and heard with our own ears, not dependent on<br/>\nthe testimony of others... as it says, Face to face, God spoke with you...<br/>\nThe Torah also states: God did not make this covenant with our fathers, but<br/>\nwith us -- who are all here alive today.&quot; (Deut. 5:3)<br/>\n<br/>\nJudaism is not miracles. It is the personal eyewitness experience of every<br/>\nman, woman and child, standing at Mount Sinai 3,300 years ago.<br/>\n<br/>\n-----------------------------------------------<br/>\n<br/>\n5) CHRISTIANITY CONTRADICTS JEWISH THEOLOGY<br/>\n<br/>\nThe following theological points apply primarily to the Roman Catholic<br/>\nChurch, the largest Christian denomination, and the one most familiar to the<br/>\nWestern world.<br/>\n<br/>\nA. GOD AS THREE?<br/>\n<br/>\nThe Catholic idea of Trinity breaks God into three separate beings: The<br/>\nFather, the Son and the Holy Ghost (Matthew 28:19).<br/>\n<br/>\nContrast this to the Shema, the basis of Jewish belief: &quot;Hear O Israel, the<br/>\nLord our God, the Lord is ONE&quot; (Deut. 6:4). Jews declare the Shema every<br/>\nday, while writing it on doorposts (Mezuzah), and binding it to the hand and<br/>\nhead (Tefillin). This statement of God&#39;s One-ness is the first words a<br/>\nJewish child is taught to say, and the last words uttered before a Jew dies.<br/>\n<br/>\nIn Jewish law, worship of a three-part god is considered idolatry -- one of<br/>\nthe three cardinal sins that a Jew should rather give up his life than<br/>\ntransgress. This explains why during the Inquisitions and throughout<br/>\nhistory, Jews gave up their lives rather than convert.<br/>\n<br/>\nB. MAN AS GOD?<br/>\n<br/>\nChristians believe that God came down to earth in human form, as Jesus said:<br/>\n&quot;I and the Father are one&quot; (John 10:30).<br/>\n<br/>\nMaimonides devotes most of the &quot;Guide for the Perplexed&quot; to the fundamental<br/>\nidea that God is incorporeal, meaning that He assumes no physical form. God<br/>\nis Eternal, above time. He is Infinite, beyond space. He cannot be born, and<br/>\ncannot die. Saying that God assumes human form makes God small, diminishing<br/>\nboth His unity and His divinity. As the Torah says: &quot;God is not a mortal&quot;<br/>\n(Numbers 23:19).<br/>\n<br/>\nJudaism says that the Messiah will be born of human parents, and possess<br/>\nnormal physical attributes like other people. He will not be a demi-god, and<br/>\nwill not possess supernatural qualities. In fact, an individual is alive in<br/>\nevery generation with the capacity to step into the role of the Messiah.<br/>\n(see Maimonides - Laws of Kings 11:3)<br/>\n<br/>\nC. INTERMEDIARY FOR PRAYER?<br/>\n<br/>\nThe Catholic belief is that prayer must be directed through an<br/>\nintermediary -- i.e. confessing one&#39;s sins to a priest. Jesus himself is an<br/>\nintermediary, as Jesus said: &quot;No man cometh unto the Father but by me.&quot;<br/>\n<br/>\nIn Judaism, prayer is a totally private matter, between each individual and<br/>\nGod. As the Bible says: &quot;God is near to all who call unto Him&quot; (Psalms<br/>\n145:18). Further, the Ten Commandments state: &quot;You shall have no other gods<br/>\nBEFORE ME,&quot; meaning that it is forbidden to set up a mediator between God<br/>\nand man. (see Maimonides - Laws of Idolatry ch. 1)<br/>\n<br/>\nD. INVOLVEMENT IN THE PHYSICAL WORLD<br/>\n<br/>\nCatholic doctrine often treats the physical world as an evil to be avoided.<br/>\nMary, the holiest woman, is portrayed as a virgin. Priests and nuns are<br/>\ncelibate. And monasteries are in remote, secluded locations.<br/>\n<br/>\nBy contrast, Judaism believes that God created the physical world not to<br/>\nfrustrate us, but for our pleasure. Jewish spirituality comes through<br/>\ngrappling with the mundane world in a way that uplifts and elevates.<br/>\nIntimacy in the proper context is one of the holiest acts we can perform.<br/>\n<br/>\nThe Talmud says if a person has the opportunity to taste a new fruit and<br/>\nrefuses to do so, he will have to account for that in the World to Come.<br/>\nJewish rabbinical schools teach how to live amidst the bustle of commercial<br/>\nactivity. Jews don&#39;t retreat from life, we elevate it.<br/>\n<br/>\n--------------------------------------<br/>\n<br/>\n6) JEWS AND GENTILES<br/>\n<br/>\nJudaism does not demand that everyone convert to the religion. The Torah of<br/>\nMoses is a truth for all humanity, whether Jewish or not. King Solomon asked<br/>\nGod to heed the prayers of non-Jews who come to the Holy Temple (Kings I<br/>\n8:41-43). The prophet Isaiah refers to the Temple as a &quot;House for all<br/>\nnations.&quot;<br/>\n<br/>\nThe Temple service during Sukkot featured 70 bull offerings, corresponding<br/>\nto the 70 nations of the world. The Talmud says that if the Romans would<br/>\nhave realized how much benefit they were getting from the Temple, they&#39;d<br/>\nnever have destroyed it.<br/>\n<br/>\nJews have never actively sought converts to Judaism because the Torah<br/>\nprescribes a righteous path for gentiles to follow, known as the &quot;Seven Laws<br/>\nof Noah.&quot; Maimonides explains that any human being who faithfully observes<br/>\nthese basic moral laws earns a proper place in heaven.<br/>\n<br/>\n-------------------------------------------------<br/>\n<br/>\n7) BRINGING THE MESSIAH<br/>\n<br/>\nMaimonides states that the popularity of Christianity (and Islam) is part of<br/>\nGod&#39;s plan to spread the ideals of Torah throughout the world. This moves<br/>\nsociety closer to a perfected state of morality and toward a greater<br/>\nunderstanding of God. All this is in preparation for the Messianic age.<br/>\n<br/>\nIndeed, the world is in desperate need of Messianic redemption. War and<br/>\npollution threaten our planet; ego and confusion erode family life. To the<br/>\nextent we are aware of the problems of society, is the extent we will yearn<br/>\nfor redemption. As the Talmud says, one of the first questions a Jew is<br/>\nasked on Judgment Day is: &quot;Did you yearn for the arrival of the Messiah?&quot;<br/>\n<br/>\nHow can we hasten the coming of the Messiah? The best way is to love all<br/>\nhumanity generously, to keep the mitzvot of the Torah (as best we can), and<br/>\nto encourage others to do so as well.<br/>\n<br/>\nDespite the gloom, the world does seem headed toward redemption. One<br/>\napparent sign is that the Jewish people have returned to the Land of Israel<br/>\nand made it bloom again. Additionally, a major movement is afoot of young<br/>\nJews returning to Torah tradition.<br/>\n<br/>\nThe Messiah can come at any moment, and it all depends on our actions. God<br/>\nis ready when we are. For as King David says: &quot;Redemption will come today --<br/>\nif you hearken to His voice.&quot;<br/>\n<br/>\nFor further study, read &quot;The Real Messiah&quot; by Rabbi Aryeh Kaplan<br/>\n<br/>\n<br/>\nREADER COMMENTS:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; From: Bob<br/>\n </span></blockquote>Thank you for your kind, tactful, and informative response to the nice woman<br/>\nwho asked, &quot;Why don&#39;t Jews believe in Jesus?&quot; In reaching out to our<br/>\nChristian friends (to educate, not convert) it is so important that we do so<br/>\nwith the lovingkindess that embodies our Jewish nation. Thanks again.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; From: &quot;Lasassop@<br/>\n<br/>\n </span></blockquote>Thank you, thank you, thank you for that concise explanation of why Jews do<br/>\nnot accept Jesus as messiah. I converted to Judaism after being raised in a<br/>\nChristian community. When people ask why I converted, I say something simple<br/>\nabout &quot;beliefs.&quot; But your response brought back so many memories of all the<br/>\nquestions I had begun to ask myself even in childhood! And eventually the<br/>\nanswers led me to Judaism. Thanks again for your wonderful letter.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; From: David<br/>\n </span></blockquote>I am a Christian who realizes that God exists in ways human beings cannot<br/>\nunderstand. I do not understand much, but try to grow. I do believe that the<br/>\nGospels were written to prove that Jesus was the Messiah, and that the<br/>\nWritings were manipulated to prove this. The Jewish way is a better one than<br/>\nmodern Christianity. Thank you so much for your valuable time. We waste so<br/>\nmuch on myth that we miss the heart and spirit of God.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; From: Natalie &quot;<br/>\n<br/>\n </span></blockquote>This is one of the most pragmatic, logical and clear explanations I have<br/>\never heard to the questions of Jesus. Thank you. I will pass this on to at<br/>\nleast 20 people who have asked these questions, or to Jews who would not be<br/>\nable to respond to these questions.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n~Elissa Cleaveland<br/>\n&quot;It is nothing short of a miracle that the modern methods of instruction<br/>\nhave<br/>\nnot yet entirely strangled the holy curiosity of inquiry.&quot; A. Einstein</div>","specialLinks":[]}],"prevTopicId":40293,"nextTopicId":40299}}