{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":77669557,"authorName":"gailbrocop@aol.com","from":"gailbrocop@...","profile":"gailbrocop","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"She&#39;s Back","postDate":"1270054605","msgId":52425,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDQzlGMEE0N0M5N0IwNC1CMjAtMTExMzhAd2VibWFpbC1kMDYxLnN5c29wcy5hb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":52424,"nextInTime":52426,"topicId":52425,"numMessagesInTopic":0,"msgSnippet":"My 20 year old daughter was in a similar situation this past fall when she left after beginning her 2nd year at a college 4 hours from home.  She had a very","messageBody":"<div id=\"ygrps-yiv-1966685036\">My 20 year old daughter was in a similar situation this past fall when she left after beginning her 2nd year at a college 4 hours from home.  She had a very rough transition but is now back to pursuing things she loved and for now that does not include college.  She spoke about her experience at college and her decision to leave in a presentation at The Autodidact Symposium a few weeks ago.  With her permission, I&#39;m sending a short portion of that speech.  <br/>\n<br/>\nAfter taking several months to decompress, she is leaving tomorrow for Boston and a month long internship at a pottery studio.  She&#39;ll be staying with unschooling friends along the way and also during the month she is there.  After that, she&#39;s heading out to Oregon for a couple of weeks and then joining us at the Life Is Good Unschooling Conference in late May.<br/>\n<br/>\nHere&#39;s a bit of what she said...<br/>\n<br/>\n<br/>\n<br/>\n &quot;&quot;&quot;I left after a year. It was a bittersweet parting. I had made friendswith my fellow students and I was really excited to be a part of theNew College community, but I also didn’t feel passionate about thethings that I was learning, and I wasn’t convinced that the degree Iwas pursuing was going to enable me to do the things I wanted to aftergraduation. I can handle one or the other. I’m willing to learn boringstuff if it’s going to get me where I want to go, and I’m willing tolearn exciting stuff for its own sake, but I can’t deal with learningboring stuff for no reason. Hindsight is twenty/twenty, and I kind ofwish now that I had waited a bit- a year or two- to make sure I knewwhat I wanted before I jumped into the college game head first. That’ssomething that I would absolutely recommend to any unschoolerconsidering college. Don’t feel like you need to go when you’reeighteen. Eighteen is the age when you’re finally legally able to do somuch cool stuff, and eighteen is also still so young. You should be outtraveling the world and howling at the moon.&quot;<br/>\n<br/>\nShe&#39;s doing some &quot;howling&quot; now and seems excited about life again.   As much as I will miss her as she goes out on her new adventures, my own heart is just so happy to see her pursuing what she loves.<br/>\n<br/>\nGail<br/>\n<br/>\n<br/>\n <br/>\n=<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":52387,"nextTopicId":52408}}