{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":123374705,"authorName":"ejcrewe@aol.com","from":"ejcrewe@...","profile":"ejcrewe2002","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] RE:  Plug in Drug and Ads","postDate":"1048778398","msgId":62192,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMi4xY2UxMDhkNS4yYmI0NzA5ZUBhb2wuY29tPg=="},"prevInTopic":62187,"nextInTopic":0,"prevInTime":62191,"nextInTime":62193,"topicId":62155,"numMessagesInTopic":0,"msgSnippet":"In a message dated 3/26/2003 2:28:21 PM Central Standard Time, ... Tory, not so!  I used to think the four saddest words in the English language were:  Time","messageBody":"<div id=\"ygrps-yiv-1705599180\">In a message dated 3/26/2003 2:28:21 PM Central Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:torywalk@...\">torywalk@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I think I am the only mom I know who really actually <br/>\n&gt; loved the Teletubbies<br/>\n<br/>\n </span></blockquote>Tory, not so!  I used to think the four saddest words in the English language <br/>\nwere:  &quot;Time for Tubby bye-bye.&quot;<br/>\n<br/>\nElizabeth, who is hoping her children will watch tv all day long because her <br/>\nhead cold is like a fish globe filled with water secured to her head with <br/>\nsticky tape.  At least the  rubber mallet pounding on this fish globe <br/>\novernight has been quieted!<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":8378727,"authorName":"zenmomma *","from":"&quot;zenmomma *&quot; &lt;zenmomma@...&gt;","profile":"zenmomma2kids","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] RE: Plug in Drug and Ads","postDate":"1048777434","msgId":62187,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTEtRjE4MjVFdHJVVllLa3AwMDAxZWY5ZEBob3RtYWlsLmNvbT4="},"prevInTopic":62155,"nextInTopic":62192,"prevInTime":62186,"nextInTime":62188,"topicId":62155,"numMessagesInTopic":0,"msgSnippet":"... Ooh, that gives me goosebumps, Tory. Thanks for sharing your story. Life is good. ~Mary The miracle is not to walk on water. The miracle is to walk on the","messageBody":"<div id=\"ygrps-yiv-1415819039\"><blockquote><span title=\"ireply\">&gt;&gt;Everything finally feels right.<br/>\n&gt;<br/>\n&gt;Tory<br/>\n<br/>\n </span></blockquote>Ooh, that gives me goosebumps, Tory. Thanks for sharing your story.<br/>\n<br/>\nLife is good.<br/>\n~Mary<br/>\n<br/>\n&quot;The miracle is not to walk on water. The miracle is to walk on the green <br/>\nearth, dwelling deeply in the present moment and feeling truly alive.&quot;<br/>\n<br/>\n                      ~ Thich Nhat Hanh<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n_________________________________________________________________<br/>\nMSN 8 with e-mail virus protection service: 2 months FREE*  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://join.msn.com/?page=features/virus\">http://join.msn.com/?page=features/virus</a></div>","specialLinks":[]},{"userId":101354964,"authorName":"moonstarshooter","from":"&quot;moonstarshooter&quot; &lt;torywalk@...&gt;","profile":"moonstarshooter","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE:  Plug in Drug and Ads","postDate":"1048710331","msgId":62155,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGI1dDJicit2MzB1QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":62187,"prevInTime":62154,"nextInTime":62156,"topicId":62155,"numMessagesInTopic":0,"msgSnippet":"You know, thank you seems so understated when I try to express my gratefulness for all the posts regarding TV lately.  I have a 5yod who has loved tv from","messageBody":"<div id=\"ygrps-yiv-2053243589\">You know, &quot;thank you&quot; seems so understated when I try to express my <br/>\ngratefulness for all the posts regarding TV lately.  I have a 5yod <br/>\nwho has loved tv from the time she was just an infant.  When <br/>\nshe was about 7 months old and in her jumpy-seat (you know, the ones <br/>\nthat attach to a doorway threshold) she would jump and spin like you <br/>\nwouldn&#39;t believe to Barney&#39;s opening song, and she would watch it the <br/>\nwhole way through.  <br/>\n<br/>\nTo try to make this long story short, I started feeling like I should <br/>\nlimit her tv viewing because she would sit and watch it for hours, <br/>\neven as a 1yo.  (And I was always beside her watching it also, <br/>\nsinging along...I think I am the only mom I know who really actually <br/>\nloved the Teletubbies...my husband and I would even watch it on <br/>\nFriday nights after she had gone to bed...boy, did I just admit <br/>\nthat?)  Anyway, I would go through periods of limiting, and for one <br/>\nreason or another, I would slack off and she would be watching it <br/>\nmore and more.  Then I would get concerned again and step back in <br/>\nwith my restrictions.  But as many of you have pointed out, there was <br/>\nno way for her to know if she was going to be able to watch what she <br/>\nwanted today, or if mom was going to tell her she needed to turn it <br/>\noff, so she just watched and watched and watched...<br/>\n<br/>\nThen two things happened that slapped me in the face about it.  One <br/>\nnight, my mom and dad took her to visit her great-grandparents, and <br/>\non the way she asked a question that would make any grandparent sit <br/>\nup and listen:  &quot;Do you know what the worst thing that my parents do <br/>\nis?&quot;  Let me tell you, they were about to jump out of their seats <br/>\nwaiting to hear the answer to that one.  Then she sadly said, &quot;Every <br/>\nnight after I go to bed, they watch tv ALL night.&quot;  When I heard this <br/>\nstory I first thought, well if that is the worst we do, we aren&#39;t <br/>\ndoing too bad.  But then it set in how hypocritical I was being, and <br/>\nhypocrisy is the one thing that I despise the MOST in the world.<br/>\n<br/>\nSo I started letting her watch more tv.  But I still was trying to <br/>\nimpose on what she could and couldn&#39;t watch.  I kept &quot;encouraging&quot; <br/>\nher to watch things like Dora and Liberty Kids because she <br/>\ncould &quot;learn&quot; from them.  Finally, she had had enough one day and she <br/>\njust looked at me with sad eyes and said, &quot;Well I think I am just <br/>\nfine the way I am, with what I know and what I don&#39;t know.&quot;  <br/>\nHmmm...And you know what, she is right.  She is an extremely smart <br/>\nlittle girl, and I wasn&#39;t giving her the credit she deserved.  Shame <br/>\non me.<br/>\n<br/>\nSo I am proud to say that the tv has been on almost continually for <br/>\nthe last couple of weeks, and yes, she has been a couch potato, but <br/>\nshe is so happy!  She comes to me and says, &quot;Mommy, I do learn stuff <br/>\nfrom the Goofy movie.  I learn how not to act, like the boys on the <br/>\nother skateboard team.  That is rude.&quot;<br/>\n<br/>\nAnd sometimes I think it is good for her to see kids acting rudely on <br/>\ntv, because she CAN be a passive viewer and see how acting that way <br/>\naffects the other person.  If she were IN the situation, it would be <br/>\nMUCH harder to separate how something she or her friends were doing <br/>\nthat might be hurtful to another child.<br/>\n<br/>\nAnd as far as ads, I too was worried about the constant bombardment <br/>\nof toys and such.  But as I was watching with her one day, I noticed <br/>\nhow there must have been at least 25 commercials during that period <br/>\n(maybe more) and only once did she say, &quot;Hey mom, that&#39;s cool!  Can I <br/>\nhave that?&quot;  So yes, I believe it does expose them to all kinds <br/>\nof &quot;neat&quot; things, but I also believe they have the ability to discern <br/>\nwhich of those things really appeal to them.  (Plus it helps me with <br/>\nher birthday list for next month!)  And I always think it funny how <br/>\nshe mutes the tv when the Hooked on Phonics commercial comes on (over <br/>\nand over and over again.)  It drives her nuts.  But this has led to <br/>\ngreat conversations regarding marketing and target audiences and such.<br/>\n<br/>\nSo anyway, thanks for all the posts (and thanks for reading this <br/>\nnovel to the end.)  Everything finally feels right.  <br/>\n<br/>\nTory</div>","specialLinks":[]}],"prevTopicId":62169,"nextTopicId":62208}}