{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"faith buckley","from":"faith buckley &lt;faithb@...&gt;","replyTo":"LIST","senderId":"HNkFigCY-hxSusuGnEkize3b4I0MUVWGqzf4x9UXX7A9IfAWwySlFJW100bYhcpduTC89NwATq4L0Q_FndGpo9XcPNF15A","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Unschooling Curious","postDate":"937040902","msgId":2881,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4yMDIuMjg4MS45NTkyNjk3NDJAZUdyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":2880,"nextInTime":2882,"topicId":2881,"numMessagesInTopic":0,"msgSnippet":"I just thought I might introduce myself , seeing as I have been eavesdropping on all of your conversations for the past two weeks.  My name is Faith and I am","messageBody":"<div id=\"ygrps-yiv-1972238328\">I just thought I might introduce myself , seeing as I have been<br/>\neavesdropping on all of your conversations for the past two weeks.  My<br/>\nname is Faith and I am the mother of 4.  I have a 7yob, 5yog, 2yog, and<br/>\na 2mo. old girl. (I am really new at all of this computer lingo so bear<br/>\nwith me!  And if someone would be so kind as to tell me what all of the<br/>\nabbreviations, (i.e. dh, dd, lol, etc.) mean, I would be ever so<br/>\ngrateful!<br/>\n<br/>\nMy husband and I were faced with the decision of &quot;SCHOOL&quot;  for our son<br/>\ntwo years ago and the thought of putting him into a ps frightened the<br/>\ndaylights out of us.  First of all the schools around here are just<br/>\nscary (they teach some weird curr. that go way against our faith), and<br/>\nsecond, our son is way to vulnerable to be inindated by the garbage that<br/>\nflies around the ps (i.e. language, stories, behavior, etc.).  We had a<br/>\nfriend from church who was hs and running a daycare who told me I should<br/>\nhs.  My 7yo is a least a half a year ahead of his peers so I couldn&#39;t<br/>\nimagine him in ps.  He&#39;s the type who would get bored waiting for the<br/>\nrest of the class to catch up and end up in the principle&#39;s office!<br/>\nHe&#39;s a VERY quick learner and he likes learning on his own.  By the time<br/>\nI would wake up in the morning, he would already be at his desk working<br/>\non his school books so he could get done in order to play. (Now I know<br/>\nsome of you are going to ooo and awww at him not being able to play<br/>\nuntil his work was done, but remember I just heard about unschooling,<br/>\nok?)<br/>\n<br/>\nSo, this is my 3rd year hsing and I really love it .  I love being the<br/>\none who gets to see when the light bulbs go on in my childrens&#39; heads,<br/>\nand their eyes light up because of something they have just discovered.<br/>\nAlthough, for the past 2 years I have constantly been down on myself<br/>\nbecause I wasn&#39;t making my house a &#39;SCHOOL&#39;.  I thought it was wrong and<br/>\nmy son wasn&#39;t really being &#39;taught&#39; or learning because it wasn&#39;t<br/>\nstructured enough.<br/>\n<br/>\nNow, since I have been &#39;listening&#39; to you guys, I find that it&#39;s ok?<br/>\nWOW!!  You mean I don&#39;t have to have a set schedule and a &#39;classroom&#39;<br/>\natmosphere and my children are still going to learn?<br/>\n<br/>\nOne of the posts I read was talking about kindergarten and getting on<br/>\nkids for not writing neatly.  I am ashamed to say, but I realized I was<br/>\ndoing that to my 5yo.  Boy, do I feel bad.  I remember kindergarten as<br/>\nnothing but fun playtime with friends not what I have been trying to<br/>\nmake it.  I definately need to relax!<br/>\n<br/>\nI have really been enjoying the insights I have received in the past<br/>\ncouple of weeks.  Thank you.  I don&#39;t know if I can completely go to<br/>\n&#39;unschooling&#39; but I am going to &#39;try&#39; to can this scheduleing and stop<br/>\ntrying to make my home a &#39;school&#39;!<br/>\n<br/>\nAlso, about this socialization thing.  My dad has been the only one to<br/>\nsay anything about my kids not being able to socialize enough.  But I<br/>\nalways remind him that my children are at church at least 3 times a week<br/>\n(sunday school, Royal Rangers and Missionettes (like girls and boys<br/>\nscouts), and youth outreaches) where my kids are around a ton of kids<br/>\ntheir age.  Around here there are a lot of hs families.  Probably 50% of<br/>\nour church families hs and I&#39;m hearing of more people I know turning to<br/>\nhs.  Usually when people ask my kids what school they go to and they<br/>\nfind out we hs, I hear, &quot;Wow, that&#39;s great!  I wish I could&#39;ve hs my<br/>\nkids.&quot; or &quot;I&#39;m thinking about doing that myself!&quot; It&#39;s almost becoming<br/>\ntrendy!  I think more people would if they knew unschooling was out<br/>\nthere.  I think some people are so afraid of it because they think they<br/>\nhave to make it like &#39;school&#39;!  If they knew they could relax and just<br/>\nhave fun with their kids they would be more willing.<br/>\n<br/>\nWell, I&#39;ve rambled enough!!!!  Sorry, but thanks for listening!<br/>\n<br/>\nA King&#39;s Kid,<br/>\n<br/>\nFaith</div>","specialLinks":[]}],"prevTopicId":2863,"nextTopicId":2887}}