{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":0,"authorName":"Marbleface@aol.com","from":"Marbleface@...","replyTo":"LIST","senderId":"SXmW-d46Yrs40tLvBabe8QcgQBGitv88S8Dg1VHX5j0yZi4avtq725TrFyLfT3OrXzYNWYSVgWmG","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: I&#39;d like to introduce myself!","postDate":"945452445","msgId":5337,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4zNDMuNTMzNy45NTkyNjk3NDRAZUdyb3Vwcy5jb20+"},"prevInTopic":5335,"nextInTopic":0,"prevInTime":5336,"nextInTime":5338,"topicId":5334,"numMessagesInTopic":0,"msgSnippet":"In a message dated 12/17/1999 3:31:17 PM !!!First Boot!!!, deejay@gate.net writes: ","messageBody":"<div id=\"ygrps-yiv-235574038\">In a message dated 12/17/1999 3:31:17 PM !!!First Boot!!!, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:deejay@...\">deejay@...</a> <br/>\nwrites:<br/>\n<br/>\n&lt;&lt; What I would like to do is chronicle our unschooling efforts for a full <br/>\nyear - maybe even daily entries - for all of 2000.  It may turn out to be <br/>\ncompletely boring or it may be inspiring to someone who is interested but <br/>\nafraid to try.<br/>\n <br/>\n Any thoughts or suggestions or if you are in the Lakeland area and want to <br/>\nget together! - I look forward to hearing from you.<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>Hi!<br/>\n<br/>\nWe are relaxed or un (depending on our mood and your definition) <br/>\nhomeschoolers and we live in Hobe Sound, FL.  This is our first year and I <br/>\nhave a 6 1/2 yo boy and 5 yo daughter.<br/>\n<br/>\nYour post made me giggle because I had thought I would keep our daily <br/>\nlog/journal on the computer too.  Not to post -- just to have instead of the <br/>\nhandwritten version we have now.   I wish you luck in getting it up and <br/>\nrunning and maintained -- I&#39;d love to see it -- but -- I warn you -- the days <br/>\nfly by!!  Last night I sat down and tried to write down several things we&#39;ve <br/>\ndone since the last time I posted to our journal.  It had been 3 days and I <br/>\nhadn&#39;t even realized!  <br/>\n<br/>\nAnyway, Lakeland is probably too far for a visit but I would love to see the <br/>\nprogress you make on the computerized journal.  To someone not involved, it <br/>\nmight be boring but if you&#39;re going thru it, I think it would be interesting.<br/>\n<br/>\nGood luck with everything!!<br/>\n<br/>\nNance<br/>\n<br/>\nP.S. We don&#39;t use any sort of organized curriculum so I hope you willl let us <br/>\nknow what you think of that too!</div>","specialLinks":[]},{"userId":0,"authorName":"Dwbtrhalf@aol.com","from":"Dwbtrhalf@...","replyTo":"LIST","senderId":"7Q-1L2Z-YbSZtP_fPw9g3GV1QOvhfjICAZhQ33EiKlp_B9T5tiPZVWM-EP88WEbwl5WICfXiSsg","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: I&#39;d like to introduce myself!","postDate":"945445024","msgId":5335,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4zNDMuNTMzNS45NTkyNjk3NDRAZUdyb3Vwcy5jb20+"},"prevInTopic":5334,"nextInTopic":5337,"prevInTime":5334,"nextInTime":5336,"topicId":5334,"numMessagesInTopic":0,"msgSnippet":"In a message dated 12/17/99 10:31:15 AM Eastern Standard Time, deejay@gate.net writes: ","messageBody":"<div id=\"ygrps-yiv-763164528\">In a message dated 12/17/99 10:31:15 AM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:deejay@...\">deejay@...</a> writes:<br/>\n<br/>\n&lt;&lt;  I haven&#39;t come across anything that chronicles the (mis)adventures of a <br/>\nfamily who is just plunging into the whole home/unschooling arena.  Have any <br/>\nof you seen any sites like this? Most of the accounts I&#39;ve seen start out <br/>\nlike, &quot;We have been homeschooling for xx number of years and here is how we <br/>\ndo it&quot;.  What I would like to do is chronicle our unschooling efforts for a <br/>\nfull year - maybe even daily entries - for all of 2000.  It may turn out to <br/>\nbe completely boring or it may be inspiring to someone who is interested but <br/>\nafraid to try. &gt;&gt;<br/>\n<br/>\nBetsy, I look forward to your chronicle.  This is our first year of home <br/>\nschooling also.  We started out really structured and have found out that it <br/>\ndoesn&#39;t work for us.  I&#39;ve talked with my oldest about where we&#39;re going <br/>\nafter the first of the year.  She is a little nervous, as she has been for <br/>\nthe past month, about unschooling, but has expressed that the more <br/>\ndifferently we do things from her former school, the more she has liked it.  <br/>\n<br/>\nMarcie</div>","specialLinks":[]},{"userId":0,"authorName":"deejay@xxxx.xxx","from":"deejay@...","replyTo":"LIST","senderId":"pTNZecz8dWVopdtks0WcPfNVBbagJMy-iF23OEoTznB30AMQJgsysRcryN7GqqbP4J_jUS_A","spamInfo":{"isSpam":false,"reason":"0"},"subject":"I&#39;d like to introduce myself!","postDate":"945444640","msgId":5334,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4zNDMuNTMzNC45NTkyNjk3NDRAZUdyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":5335,"prevInTime":5333,"nextInTime":5335,"topicId":5334,"numMessagesInTopic":0,"msgSnippet":"Hi Unschoolers! I have been enjoying reading all your interesting posts and realized I hadn t made my presence known yet. My name is Betsy Wright and I live in","messageBody":"<div id=\"ygrps-yiv-1203342037\">Hi Unschoolers!<br/>\n<br/>\nI have been enjoying reading all your interesting posts and realized I hadn&#39;t made my presence known yet.<br/>\n<br/>\nMy name is Betsy Wright and I live in Lakeland, FL.  Today is my last day of &quot;work&quot; and after the holidays I&#39;ll begin homeschooling 3 of our kids.  (Our 13 year old can&#39;t spell either, by the way)  <br/>\n<br/>\nI have been doing alot of research on unschooling and am ready to give it a try.  My husband is a little leary, but also willing to try.  I think the kids think I&#39;m kidding when they ask me all these questions about what homeschool will be like.  At this point I am just telling them I&#39;m not sure exactly what we&#39;ll be doing - because frankly - I don&#39;t know.  They want to know if they&#39;ll have to do P.E., take tests, sit at a desk etc.  I ask them:  &quot;Do you want to take tests - Do you want me to give you specific assignments?&quot;.  They are just baffled at the thought that things are not going to be completely scheduled and dictated.  So I told me husband that this is a great opportunity to begin to allow unschooling to happen naturally.  The kids are sufficiently confused and off guard, so this is the perfect time to start :)<br/>\n<br/>\nWe have ordered curriculum through Core Curriculum Of America.  They put materials together for each of our kids based on their interests, strengths, weaknesses, likes, dislikes, personalities, etc.  I told the kids when we get our materials in next week, my husband David and I would sit down with each of them individually and discuss what they would like to learn, time frames and so on.  That has satisfied them - for now.<br/>\n<br/>\nI have started a web page just for fun, but had an interesting idea.  I have enjoyed going through a number of sites other homeschooling families have put together and found them interesting and informative - especially what their days are like.  I haven&#39;t come across anything that chronicles the (mis)adventures of a family who is just plunging into the whole home/unschooling arena.  Have any of you seen any sites like this? Most of the accounts I&#39;ve seen start out like, &quot;We have been homeschooling for xx number of years and here is how we do it&quot;.  What I would like to do is chronicle our unschooling efforts for a full year - maybe even daily entries - for all of 2000.  It may turn out to be completely boring or it may be inspiring to someone who is interested but afraid to try.<br/>\n<br/>\nAny thoughts or suggestions or if you are in the Lakeland area and want to get together! - I look forward to hearing from you.<br/>\n<br/>\nOur website is still under construction stop by if you like:  www.angelfire.com/fl3/homeschoolingwrights/index.html<br/>\n<br/>\nBetsy</div>","specialLinks":[]}],"prevTopicId":5331,"nextTopicId":5339}}