{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] I Think I&#39;m Understanding Unschooling","postDate":"1042148047","msgId":54122,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFiZi4xYWFiZjc1YS4yYjRmNDRjZkBhb2wuY29tPg=="},"prevInTopic":54112,"nextInTopic":0,"prevInTime":54121,"nextInTime":54123,"topicId":54112,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/9/03 1:15:44 PM, HappyMato2@aol.com writes: ","messageBody":"<div id=\"ygrps-yiv-1399024856\">In a message dated 1/9/03 1:15:44 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HappyMato2@...\">HappyMato2@...</a> writes:<br/>\n<br/>\n&lt;&lt;   Right now my children love to brush their teeth, comb <br/>\ntheir hair, help with chores.  I know this will not always be the case.  &gt;&gt;<br/>\n<br/>\nIt might be.<br/>\nIf you treat them with joyful respect, why would they want to change the <br/>\nthings they enjoy doing?<br/>\n<br/>\nUnless there&#39;s spite or avoidance involved, they can keep having fun for a <br/>\nlong time.<br/>\n<br/>\n&lt;&lt;Although it may seem <br/>\nlike coersion to some, parents should not expect children to make decisions <br/>\nand suffer the consequences if the children are not experienced or don&#39;t <br/>\nreally understand the consequences.&gt;&gt;<br/>\n<br/>\nI didn&#39;t quite understand this part.<br/>\n<br/>\nKids make decisions within the contexts of their own real everyday lives.  No <br/>\nglaring big lifelong decisions are likely to jump out at them.  Just the <br/>\neveryday stuff.<br/>\n<br/>\n&lt;&lt;It&#39;s not because my parents were <br/>\nstrict or forbade us, it&#39;s because they taught us how to make decisions and <br/>\nreally think about things and their consequences before doing them.  I never <br/>\nhad a curfew, I was never grounded, I was never punished (even after wrecking <br/>\nmy parents car for playing around on the road).  They never needed to do <br/>\nthose things.  My friends were very surprised I didn&#39;t get into trouble for <br/>\nwrecking the car.&gt;&gt;<br/>\n<br/>\nYou&#39;re way ahead of where many of us started, then!<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":132256168,"authorName":"HappyMato2@aol.com","from":"HappyMato2@...","profile":"home_ed4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"I Think I&#39;m Understanding Unschooling","postDate":"1042143223","msgId":54112,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg0LjZjZWU5OWUuMmI0ZjMxZjdAYW9sLmNvbT4="},"prevInTopic":0,"nextInTopic":54122,"prevInTime":54111,"nextInTime":54113,"topicId":54112,"numMessagesInTopic":0,"msgSnippet":"I went to the unschooling.com website and read a lot about unschooling.  I think I m understanding more about it. My big concern with the unschooling way of","messageBody":"<div id=\"ygrps-yiv-73909037\">I went to the unschooling.com website and read a lot about unschooling.  I <br/>\nthink I&#39;m understanding more about it.<br/>\n<br/>\nMy big concern with the unschooling way of life was my thought that children <br/>\nwould grow up very selfish, not care about anyone else&#39;s feelings, have lots <br/>\nof cavaties, be very sick from only eating candy and cookies, and be hard to <br/>\ndeal with.  I know now how ignorant I was when thinking this.  I didn&#39;t think <br/>\nthat kids would grow up this way because than why would unschoolers do this, <br/>\nbut I thought how could they not?  A quote I read helped me understand this.  <br/>\nThe quote is &quot;When I require something of my children, it is usually becasue <br/>\nthere is an immediate and very real *need* for it-to keep them healthy and <br/>\nsafe, to keep the family functioning, to respect someone else&#39;s needs or <br/>\nfeelings, ect.&quot;  This quote may not be how all unschoolers think, but it <br/>\nmakes sense to me.  Right now my children love to brush their teeth, comb <br/>\ntheir hair, help with chores.  I know this will not always be the case.  As <br/>\nthey grow older and understand more, I can let go of things and let them make <br/>\ntheir own decisions.  Right now my kids are only 3 and 4 so they are too <br/>\nyoung to really understand that if they never brush their teeth, they&#39;ll get <br/>\ncavaties, gum disease, etc.  Even if I explain to them what that means, they <br/>\ndon&#39;t understand.  When they are able to understand the choices, then they <br/>\ncan begin to make decisions.  As my children get older and older, they can <br/>\nbegin to make more and more decisions, like staying up until midnight if they <br/>\nwant to do that.  Another thing I read and agree with is that parents should <br/>\nrespect their children&#39;s needs, feelings and desires.  Although it may seem <br/>\nlike coersion to some, parents should not expect children to make decisions <br/>\nand suffer the consequences if the children are not experienced or don&#39;t <br/>\nreally understand the consequences.<br/>\n<br/>\nThis is something I&#39;ll add about someone I know who was able to do whatever <br/>\nshe wanted at too young of an age.  The little girl was young and was not <br/>\nrequired to brush her teeth, eat healthy foods if she didn&#39;t want to.  When I <br/>\nmean young, I mean toddler and up.  Her teeth are rotting out of her head all <br/>\nready and she&#39;s only 14.  Even though she sees a dentist on a regular basis, <br/>\nit&#39;s not enough to combat all the junk food and neglect.  At first I thought, <br/>\nis this what unschoolers mean?  Let children do whatever they want all the <br/>\ntime, even if they really don&#39;t understand the consequences?  Most children <br/>\ncould care less about what might happen in the future.  Most children only <br/>\nthink of the present.  Maybe they think this way because they were never <br/>\ntaught how to make decisions, they were never given the responsibility to <br/>\nmake decisions when they were mature enough, and they were never explained <br/>\nwhy but only given orders?  We often hear that teenagers are too young to <br/>\nmake important decisions because many are not mature enough to think about <br/>\nthe consequences, which is in the future.  Many young teens begin to smoke, <br/>\nbut they really don&#39;t think about what that means, ie. they stink, their <br/>\nteeth may turn yellow, they can spend the money on something else that they&#39;d <br/>\nwant to do or have, and it&#39;s not good for their health.  I know none of the <br/>\nkids in my family smoked or did drugs.  It&#39;s not because my parents were <br/>\nstrict or forbade us, it&#39;s because they taught us how to make decisions and <br/>\nreally think about things and their consequences before doing them.  I never <br/>\nhad a curfew, I was never grounded, I was never punished (even after wrecking <br/>\nmy parents car for playing around on the road).  They never needed to do <br/>\nthose things.  My friends were very surprised I didn&#39;t get into trouble for <br/>\nwrecking the car.<br/>\n<br/>\nIf I&#39;m still not understanding unschooling, or I&#39;m a little wrong, please let <br/>\nme know.  I think I&#39;m starting to get it.<br/>\n<br/>\nPatti<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":54121,"nextTopicId":54124}}