{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"hjshaltz@aol.com","from":"hjshaltz@...","replyTo":"LIST","senderId":"YTpEMLDIY9TgnKpmn0X3w9xSC8TmOlcPQu5OdTdQi-9zJhDWb2NO6XiCQl8td0M4X-iYswYAWw","spamInfo":{"isSpam":false,"reason":"0"},"subject":"helping unschooled teens get out of the house","postDate":"955981697","msgId":8205,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYyLjI4Njk0NWIuMjYyYzc5ODFAYW9sLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":8204,"nextInTime":8206,"topicId":8205,"numMessagesInTopic":0,"msgSnippet":"And here s another comment, FWIW :) When my sons were in their mid teens, we were stationed at Fort Hood, in TX. My older son had taken Tae Kwon Do before our","messageBody":"<div id=\"ygrps-yiv-709250814\">And here&#39;s another comment, FWIW :)<br/>\n<br/>\nWhen my sons were in their mid teens, we were stationed at Fort Hood, in TX.  <br/>\nMy older son had taken Tae Kwon Do before our move to Ft Hood, but couldn&#39;t <br/>\nresume after the move.  My younger son had never really found a group he felt <br/>\ncomfortable in.  So for a while, both of them were house potatoes--we never <br/>\nwatched much TV, but they spent lots of time in their rooms reading.<br/>\n<br/>\nMy older one got motivated out of the house when an opportunity opened up for <br/>\nhim to work as a summer hire in the mail room on Ft Hood.  He enjoyed being a <br/>\nvalued part of a team so much that when the money ran out, he went back as a <br/>\nvolunteer.  He eventually worked about 45 hours a week, until he joined the <br/>\nArmy, taking no holidays and only one sick day.  I never would have thought <br/>\nhe would be interested in such a mundane, dull job--but he was important to <br/>\nthem, without him they couldn&#39;t have done as good a job, so he stuck with it. <br/>\n He ended up training the new people when they came in, who were always at <br/>\nleast a couple years older, and sometimes had several years in the Army <br/>\nbefore arriving.<br/>\n<br/>\nI finally talked my younger son (then 14) to work in the volunteer center on <br/>\npost, doing data entry on an important data base that had been trashed by <br/>\naccident.  He started out working about 10 hours a week, but slowly expanded <br/>\nuntil he was doing 20-30 on that project, working as an office assistant and <br/>\nlater almost the office manager, helping to maintain, debug, and otherwise <br/>\nassist all the other computer users in the building, and then was invited to <br/>\nbe a &#39;Teen Trainer&#39; in a pilot program--they thought he was already 15 even <br/>\nthough he was small for his age :)  He ended up organizing and chairing <br/>\nmeetings, setting agendas, and giving classes, in addition to the office <br/>\nresponsibilities he had.  In addition, the data base he set up was copied by <br/>\nother similar organizations throughout the Army, and he wrote a couple <br/>\narticles for a national publication serving those organizations.<br/>\n<br/>\nIt&#39;s not that hard to get a teen out of the home and in the real world, IF <br/>\nyou are willing to scout out some opportunities that might interest them.  My <br/>\nyounger son would never have gone to work at that place if computers hadn&#39;t <br/>\nlured him out; my older son was motivated by money at first.  Later both <br/>\ndiscovered the value of being an important member of a team.  And both (gotta <br/>\nbrag :) won awards for what they did.<br/>\n<br/>\nIn looking at their situations, the most important thing was that I didn&#39;t <br/>\nfocus my efforts on finding something for them to do with their age peers.  <br/>\nInstead, I found things for them to do which followed what they were most <br/>\ninterested in at the time.  Then, they found friends, skills, and <br/>\nopportunities that kept them enthused and motivated.  And it&#39;s worth noting <br/>\nthat I didn&#39;t start out with kids who were super extroverted and used to <br/>\ndoing things outside the home.  Aside from Tae Kwon Do, my older son spent <br/>\nmost of his time in his room before working as a summer hire.  My younger son <br/>\nrepeatedly tried to make friends with age peers and failed, until he became <br/>\ninvolved in that program.  If I had waited until they decided to look outside <br/>\nthe home, they might still be here.  It&#39;s hard being a teen today, there&#39;s so <br/>\nfew places where teens are trusted with any responsibility at all.  It will <br/>\noften take a parent willing to make a few promises and guarantees before <br/>\nopportunities come open.<br/>\n<br/>\nHolly<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:hjshaltz@...\">hjshaltz@...</a><br/>\nHJS Studio and Shaltz Farm Shetlands and Angora Rabbits<br/>\nList Mom, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:FiberFlock@onelist.com\">FiberFlock@onelist.com</a> and <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:FiberProfessionals@onelist.com\">FiberProfessionals@onelist.com</a></div>","specialLinks":[]}],"prevTopicId":8204,"nextTopicId":8210}}