{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1123183,"authorName":"dacunefare@aol.com","from":"dacunefare@...","profile":"undermom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"UNSCHOOLING.COM ONLINE NEWS Mid September 2002","postDate":"1032848619","msgId":44571,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE4My5lZTAzMjRkLjJhYzE1ZWViQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":44570,"nextInTime":44572,"topicId":44571,"numMessagesInTopic":0,"msgSnippet":"... UNSCHOOLING.COM ONLINE NEWS Mid-September 2002 ... In this Issue: Life is a Journey What About Socialization? Islands of Expertise Do you like to learn? ","messageBody":"<div id=\"ygrps-yiv-1560593650\">::::::::::::::::::::::::::::::::::::::::::::::::::<br/>\n<br/>\nUNSCHOOLING.COM ONLINE NEWS<br/>\nMid-September 2002<br/>\n<br/>\n::::::::::::::::::::::::::::::::::::::::::::::::::<br/>\n<br/>\nIn this Issue:<br/>\n<br/>\nLife is a Journey<br/>\nWhat About Socialization? <br/>\nIslands of Expertise <br/>\nDo you like to learn?<br/>\nGroup functions<br/>\nNature Helps<br/>\nForms of Curiosity<br/>\nPhotography on the Web<br/>\nT.C. Confesses<br/>\nNHEN - Homeschoolers Helping Homeschoolers<br/>\nUnschool Friendly Conferences<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nLife is a journey. Our unschooling life is just the path we&#39;ve taken, it&#39;s <br/>\nnot the <br/>\ndestination. Our kids will continue on this path their whole lives. There&#39;s <br/>\nno <br/>\nreason for them to know everything in the whole wide world right now. It&#39;s <br/>\nnot <br/>\neven possible. Knowing what it is to really be alive, to ask questions and <br/>\nquestion the answers...that&#39;s the path we&#39;re on.<br/>\n<br/>\nMary (zenmomma) writing on the Unschooling-dotcom email list<br/>\nTo join the conversation send a blank email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-subscribe@yahoogroups.com\">Unschooling-dotcom-subscribe@yahoogroups.com</a><br/>\nOr visit the group web site at:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/Unschooling-dotcom/\">http://groups.yahoo.com/group/Unschooling-dotcom/</a><br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nWhat About Socialization? <br/>\n<br/>\n&quot;Despite its growing acceptance, there are nagging shortcomings to home<br/>\nschooling. If you spend time with home schoolers, you get a sense that some<br/>\nof them have missed out on whole swaths of childhood; the admirable efforts<br/>\nby their parents to ensure their education and safety sometimes seem to<br/>\nhave gone too far. In 1992 psychotherapist Larry Shyers did a study while at<br/>\nthe University of Florida in which he closely examined the behavior of 35 home<br/>\nschoolers and 35 public schoolers. He found that home schoolers were<br/>\ngenerally more patient and less competitive. They tended to introduce<br/>\nthemselves to one another more; they didn&#39;t fight as much. And the home<br/>\nschoolers were much more prone to exchange addresses and phone numbers.<br/>\nIn short, they behaved like miniature adults. &quot;<br/>\n<br/>\nFrom Time Magazine cover article, August 2001 - Seceding from school<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.time.com/time/covers/1101010827/index.html\">http://www.time.com/time/covers/1101010827/index.html</a><br/>\n<br/>\n<br/>\n&quot;Kids today are missing some essential social skills for relating to each <br/>\nother.<br/>\nThey don&#39;t know how to introduce themselves to other kids. They don&#39;t know<br/>\nhow to negotiate or sustain a conversation. They relate to each other via<br/>\nput-downs.&quot;<br/>\n<br/>\nTeacher describing school children in &quot;The Shelter of Each Other&quot; by Mary<br/>\nPipher (Ballantine 1996)<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nIslands of Expertise <br/>\nby Eric D. Gyllenhaal<br/>\n<br/>\n&quot;Islands of expertise&quot; is a term coined by Kevin Crowley, Ph.D., an <br/>\neducational <br/>\nresearcher at University of Pittsburgh who studies the ways that children and <br/>\nparents learn together in museums ( <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.kevincrowley.com\">http://www.kevincrowley.com</a> ). It refers <br/>\nto the areas of relatively deep and rich knowledge children develop when they <br/>\nare passionately interested in something like dinosaurs, Pokémon, rocks, <br/>\nturtles and other things. These islands emerge over weeks or months as <br/>\nchildren talk, read and learn about their passions. <br/>\n<br/>\nOn their islands of expertise, children remember, reason and explain in more <br/>\nadvanced ways than they usually do when submerged in the wider sea of <br/>\nknowledge. Even preschoolers can think more like an expert does, which is <br/>\nvery <br/>\ndifferent from a beginner&#39;s approach to the subject. I guess you could also <br/>\nsay <br/>\nthey think more like an adult, growing up faster on their island than in the <br/>\nrest <br/>\nof their lives. (Just the opposite of Peter Pan.) <br/>\n<br/>\nCrowley emphasizes that children aren&#39;t alone on their islands. They build <br/>\nand <br/>\ninhabit them with their parents through the things they do together every <br/>\nday. <br/>\nPreschoolers especially need their parents&#39; help...<br/>\n<br/>\nRead the rest of this wonderful article at <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://saltthesandbox.org/ChicagoParentArticle2.htm\">http://saltthesandbox.org/ChicagoParentArticle2.htm</a><br/>\n<br/>\nEric Gyllenhaal has a PhD in paleontology from the University of Chicago. <br/>\nHe&#39;s <br/>\ncurrently a stay-at-home dad and a part-time museum consultant. I&#39;m <br/>\nbecoming quite a fan of his writings about children and learning.<br/>\n<br/>\nThis article appeared in the September, 2002 issue of Chicago Parent<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nDo you like to learn?<br/>\n<br/>\nFour years ago, two riding pals asked me to write an article about learning.<br/>\nI did not consider them students, although one would ask for a little help<br/>\noccasionally and the other set up a lesson a couple of times a year, if that<br/>\noften, for which she insisted on paying. When she finally explained that <br/>\npaying<br/>\nfor the information meant that she would learn, I stopped protesting. It was<br/>\nmy first exposure to this sort of thinking. I did not understand it, but I <br/>\nwanted<br/>\nto.<br/>\n<br/>\nThey were both good riders who&#39;d learned &quot;the old way&quot; and they wanted to<br/>\nimprove. They pressed me to share with them anything I knew about learning<br/>\nhow-to-relearn to ride. I told them I also had questions--more questions than <br/>\nI<br/>\nhad answers. This struck me as a good opportunity to ferret out some<br/>\nanswers, so I started researching this article right then. It began with a <br/>\nshort<br/>\ninterview and a few days later I interviewed three more people we knew. It was<br/>\na simple interview: one question. &quot;Do you like learning?&quot; Their five unanimous<br/>\nanswers stunned me.<br/>\n<br/>\nThey all answered with the question: &quot;What do you mean?&quot;<br/>\n<br/>\nLeslie Diamond writing for The Trail Less Traveled<br/>\nRead the rest of this fascinating article at: <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.lesliedesmond.com/articles/us/horse13-4.asp\">http://www.lesliedesmond.com/articles/us/horse13-4.asp</a><br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nGroup Functions<br/>\n<br/>\n&quot;I can no longer stand group outings with other families. I tried for a few <br/>\nyears<br/>\nto get used to them, to accept them, to think that I was just being an <br/>\nuncooperative pain, but then I realized no, I would rather be with JUST my <br/>\nkids <br/>\nand not have to worry about whether six or ten other moms thought it was <br/>\nokay for them to balance on the curb or the parking bumpers, whether the <br/>\nother moms thought their T-shirts were acceptable, or whether they could get <br/>\na gumball or a soda, or whether they should sit lined up with the other kids <br/>\nwith their hands folded.&quot; <br/>\n<br/>\nFrom a recent conversation on the Unschooling.com message boards about <br/>\ngroup classes for small children, field trips, and other &quot;contrived <br/>\nlearning&quot;. To<br/>\njoin (or just read) the conversation, go to: <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com/discus/messages/537/6578.html?WednesdaySeptember112\">http://www.unschooling.com/discus/messages/537/6578.html?WednesdaySeptember112</a><br/>\n<br/>\n0020924am<br/>\nTo find the rest of the messages click on Contrived Learning in the header of<br/>\nthe page.<br/>\nCheck out all the engrossing topics on our message boards at:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com/discus/messages/board-topics.html\">http://www.unschooling.com/discus/messages/board-topics.html</a><br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nNature Helps<br/>\n<br/>\nLooking for plants or animals native to your area? Find wildflowers, birds, <br/>\nreptiles, and more at www.enature.com -- home of online field guides you can <br/>\nsearch by zip code. We found this site useful to identify the spider that <br/>\nrecently set up housekeeping in our window well. <br/>\n<br/>\nFind plans to make your own flower press at:<br/>\nPressing Flowers<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.vandycks.com/kids/projects/flowerpressing/default.htm\">http://www.vandycks.com/kids/projects/flowerpressing/default.htm</a><br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nForms of Curiosity<br/>\n<br/>\nChildren are tremendously curious about a wide variety of subjects. If you <br/>\ntook <br/>\na class of twenty-five first-graders and researched what really turned them <br/>\non, you&#39;d find that each boy and girl has a burning desire to learn more <br/>\nabout <br/>\nsomething. One child may be curious about birds, another might have all sorts <br/>\nof questions about the planets, and a third might be fascinated by cars. On a <br/>\nmore general level, we know the areas that children are eager to explore and <br/>\nlearn about: why people treat them the way they do, their own bodies, sports, <br/>\nhow to make things, drawing, music, and so on. Very few children, however, <br/>\nare naturally curious about the subjects school forces them to learn. Most <br/>\nkids don&#39;t have an intense curiosity about Dickens, state capitals, or <br/>\nalgorithms.<br/>\n<br/>\n...This is the problem with school and curiosity. Most kids only ask <br/>\nquestions <br/>\nabout the subjects they&#39;re being taught out of a sense of &quot;duty&quot; or because <br/>\nthey&#39;re worried they&#39;ll be criticized or downgraded, not because they&#39;re <br/>\nreally <br/>\ncurious about the answers. In fact, school tends to answer questions kids <br/>\ndon&#39;t have rather than the ones they want answered. When you don&#39;t have <br/>\nquestions about a subject, you don&#39;t learn. You simply memorize, take the <br/>\ntest, and forget.<br/>\n<br/>\nHeartfelt questions, then, are a manifestation of inquisitiveness. When your <br/>\nchild starts asking you a million question about a specific topic, this <br/>\nidentifies <br/>\na real area of interest. The fact that he&#39;s curious about something weird or <br/>\ntrivial -- why cats land on their feet when dropped off the balcony, or the <br/>\nsmell, texture, and taste of coffee beans -- is neither here nor there. No <br/>\nmatter where curiosity originates, it&#39;s a valid starting point, which as <br/>\nwe&#39;ll see <br/>\ncan lead to other, more &quot;useful&quot; areas of inquiry.<br/>\n<br/>\nQuestions, however, aren&#39;t the only form curiosity takes. People express <br/>\ntheir <br/>\ncuriosity through different behaviors. A teenager, for instance, might drive <br/>\nfast because he&#39;s curious about how fast his car can go. A younger kid is <br/>\ncurious about what will happen if he invites the new student to his house for <br/>\nlunch. A chemist is curious about what might happen if he mixes the liquids <br/>\nin <br/>\ntest tubes X and Y. A kid is curious about what might happen if he fixes his <br/>\nbest friend up with the girl who sits next to him in math class. Picasso was <br/>\none <br/>\nof the most curious of modern artists, constantly experimenting with his <br/>\npainting techniques. In a very real sense, inquisitiveness involves <br/>\nexperimentation. Like scientists, curious people are fascinated to see &quot;what <br/>\nwould happen if...&quot; An avant-garde musician experiments with different <br/>\ntonalities and instruments in the same way a small child experiments with <br/>\ndifferent types of balls to see how they bounce.<br/>\n<br/>\nCuriosity is a curious thing, especially when we probe beneath the surface of <br/>\nour questions and behaviors and see how it helps us learn.<br/>\n<br/>\nRoger Schank - from Coloring Outside the Lines - Raising a Smarter Kid By <br/>\nBreaking All the Rules (Harper Collins 2000)<br/>\nMr. Schank considers school mostly inescapable, thus the book is a treatise <br/>\non <br/>\nhow to minimize the damage school does to a child&#39;s intelligence. Unschoolers <br/>\nwill still find it a fascinating look at how learning happens, and full of <br/>\ncautionary tales -- what not to do to your children in the name of <br/>\n&quot;education&quot;.<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nPhotographic Collections<br/>\n<br/>\nI think one of the best uses of the internet is as limitless exhibition space <br/>\n- <br/>\nthe infinite museum. Here are some of my favorite browsing spots for <br/>\nphotographic collections.<br/>\n<br/>\nTranscontinental Railroad Exhibits<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://CPRR.org/Museum/Exhibits.html\">http://CPRR.org/Museum/Exhibits.html</a><br/>\n<br/>\nPhotos, stereographs, engravings, postcards, maps about the Central Pacific <br/>\nRailroad, includes a section of 1868 and 1997 photo comparatives<br/>\n<br/>\nHome Page: American Memory from the Library of Congress<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://memory.loc.gov/ammem/amhome.html\">http://memory.loc.gov/ammem/amhome.html</a><br/>\nAmerican Memory: Historical collections for the National Digital Library  <br/>\n<br/>\nAmerican Museum of Photography <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.photographymuseum.com/\">http://www.photographymuseum.com/</a><br/>\n<br/>\nThe History Place<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.historyplace.com/\">http://www.historyplace.com/</a><br/>\nPhoto galleries include the work of Dorothea Lange, who photographed migrant <br/>\nfarm families and Lewis Hine, whose photos of child laborers 1908 - 1912 <br/>\nhelped fuel the child protection movement<br/>\n<br/>\nExploratorium: Ten Cool Sites: Photography<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.exploratorium.edu/learning_studio/cool/photography.html\">http://www.exploratorium.edu/learning_studio/cool/photography.html</a><br/>\nFrom San Francisco&#39;s Exploratorium - a collection of ten great photography <br/>\nweb site links. Warning - not for when you&#39;ve only got a few minutes to <br/>\nspare. <br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nT.C. Confesses<br/>\n<br/>\nOne group that fascinated me was the unschoolers. It is nearly impossible to <br/>\naccurately define unschooling, but foundationally it rests upon the idea that <br/>\nif <br/>\nyou provide a rich learning environment and plenty of opportunity, a child <br/>\nwill <br/>\nlearn what he needs to know when he needs to know it. Intellectually, my head <br/>\nwas nodding over this one; I knew it worked for me, personally, and could see <br/>\nwhere it would work for children too, especially considering the progress <br/>\nThomas had made during a year of NO SCHOOL. Not, mind you, that I would dare <br/>\ntry unschooling my own sonsespecially since I was surrounded by people <br/>\n(mostly relatives) who questioned the legitimacy of our homeschooling anyway. <br/>\nI only saw it as being a really good thing for those who possessed the <br/>\nwhatever it took to actually do it.<br/>\n<br/>\nTammy Cardwell - Eclectic Homeschool Online columnist<br/>\nConfession Time<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://eho.org/features/confession_time.htm\">http://eho.org/features/confession_time.htm</a><br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nHomeschoolers Helping Homeschoolers<br/>\nby Pam Sorooshian and Sue Patterson, NHEN<br/>\n<br/>\nThis year, record numbers of families are choosing home education. They are <br/>\noften confused, scared and apprehensive. Support from experienced <br/>\nhomeschoolers can sometimes provide just what they need to help them gain <br/>\nconfidence in themselves. Homeschooling moms are happy to help all the new <br/>\nfamilies choosing home education. Read what they have to say -- it may be <br/>\n*just* what you needed to hear today!<br/>\n<br/>\nRead the entire article at: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.nhen.org/newhser/default.asp?id=408\">http://www.nhen.org/newhser/default.asp?id=408</a><br/>\n<br/>\nLook at the special webpages for New Homeschoolers: <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.nhen.org/newhser/default.asp?id=227\">http://www.nhen.org/newhser/default.asp?id=227</a><br/>\n<br/>\nSubscribe to the N-H-E-N (New Homeschoolers&#39; Encouragement Newsletter) <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.nhen.org/newhser/default.asp?id=402\">http://www.nhen.org/newhser/default.asp?id=402</a><br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nUnschool Friendly Conferences<br/>\n<br/>\nFeeling like a fish out of water after attending a large curriculum oriented <br/>\nhomeschool convention?  The following conferences have unschooling presenters <br/>\nand participants, including many regular posters at the unschooling.com <br/>\nwebsite and email discussion list. <br/>\n<br/>\nTexas Family Learning Conference<br/>\nKeynote Speakers - David Albert, Sandra Dodd<br/>\nOctober 4 & 5, 2002<br/>\nSheraton Brookhollow in Houston, Texas<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.angelfire.com/tx/wlr/conference.html\">http://www.angelfire.com/tx/wlr/conference.html</a><br/>\n<br/>\nLive and Learn Unschool Conference<br/>\nOctober 11 - 13, 2002<br/>\nColumbia, SC<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.schoolsoutsupport.org/index.html\">http://www.schoolsoutsupport.org/index.html</a><br/>\n<br/>\nIf you have information on other unschooling friendly conferences please <br/>\nemail <br/>\nthe editor at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:newsletter@...\">newsletter@...</a> <br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nUNSCHOOLING.COM ONLINE NEWS UNCLASSIFIED ADVERTISING<br/>\n<br/>\nFor information on purchasing unclassified advertising space in this <br/>\nnewsletter, please contact the editor at: <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:newsletter@...\">newsletter@...</a><br/>\n________________________<br/>\n<br/>\nTHE RESOURCEFUL HOMESCHOOLER<br/>\nwww.resourcefulhomeschooler.com<br/>\n<br/>\nWhat do you call your family? Unschoolers...Interest-Based <br/>\nLearners...Life-Long Learners...Eclectic Homeschoolers...Learner-Led <br/>\nSchoolers...Relaxed Homeschoolers...Whatever you call yourselves, The <br/>\nResourceful Homeschooler carries great books, science materials and kits, <br/>\nlearning games, and the most interesting software. Visit us at <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.resourcefulhomeschooler.com\">http://www.resourcefulhomeschooler.com</a><br/>\nMaterials to involve, inspire and support independent learners of all ages!<br/>\n________________________<br/>\n<br/>\nHOME EDUCATION MAGAZINE<br/>\n<br/>\nThe September/October issue of Home Education Magazine includes an interview <br/>\nwith Daniel Pink, author of Free Agent Nation; articles on unschooling and <br/>\ndeschooling; and a wonderful piece by the founder of the apricotpie.com web <br/>\nsite for young homeschooled writers! Check out the HEM web site for a free <br/>\nsample issue and the best subscription deals: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com\">http://www.home-ed-magazine.com</a><br/>\n<br/>\nSubscriptions to Home Education Magazine are regularly $32.00 for oneyear/6 <br/>\nissues; single issue $6.50. Take advantage of our &quot;Don&#39;t Send Your Kids to <br/>\nSchool!&quot; offer, a one year subscription for only $20.00:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com/ORD/_nottoschool.html\">http://www.home-ed-magazine.com/ORD/_nottoschool.html</a><br/>\n<br/>\nOr write Home Education Magazine, PO Box 1083, Tonasket WA 98855; for orders: <br/>\ntoll-free 1-800-236-3278; email <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:orders@...\">orders@...</a>. MC/Visa cards <br/>\naccepted.<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nFinal Thought<br/>\n<br/>\n&quot;Children will happily dig and fill holes all through the gardens of their <br/>\nminds. It <br/>\nis only through repeatedly hammering our particular posts into those holes <br/>\nthat we set up fences around their learning.&quot;<br/>\n<br/>\nSue Truscott - &quot;Are There Holes in Their Education&quot;<br/>\nLife Learning Magazine July/August 2002<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.lifelearningmagazine.com/\">http://www.lifelearningmagazine.com/</a><br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nThanks for reading the Unschooling.com newsletter! Feel free to forward this <br/>\nnewsletter to all your friends, your local support group, and your <br/>\nmother-in-law!<br/>\n<br/>\nTo subscribe, visit our web site at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> or send an <br/>\nemail to <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:majordomo@...\">majordomo@...</a> with the words subscribe <br/>\nunschooling-newsletter followed by your name@your address.com in the body of <br/>\nthe email. (e.g. subscribe unschooling-newsletter youremailaddress). <br/>\n<br/>\nTo unsubscribe, send an email to <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:majordomo@...\">majordomo@...</a> with the words <br/>\nunsubscribe unschooling-newsletter followed by your <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:name@...\">name@...</a> in <br/>\nthe body of the email. (e.g. unsubscribe unschooling-newsletter <br/>\nyouremailaddress). <br/>\n<br/>\nTo change the address at which you receive the newsletter, unsubscribe your <br/>\nold address and then subscribe with your new one.<br/>\n<br/>\nSee you in October!<br/>\n<br/>\nDeborah A Cunefare, Newsletter Editor<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:newsletter@...\">newsletter@...</a><br/>\n<br/>\nUnschooling.com is a service of Home Education Magazine</div>","specialLinks":[]}],"prevTopicId":44551,"nextTopicId":44578}}