{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":689589,"authorName":"KT","from":"KT &lt;Tuck@...&gt;","profile":"tuckervill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: 2244 - the Goal","postDate":"1029503683","msgId":41256,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNENUNGQUMzLjMwODA4MDJAbWlkc291dGgucnIuY29tPg==","referencesHeader":"PEI5ODFCMENGLjEzOUQlbmVkdmFyZUBudHBseC5uZXQ+"},"prevInTopic":41235,"nextInTopic":0,"prevInTime":41255,"nextInTime":41257,"topicId":41235,"numMessagesInTopic":0,"msgSnippet":"... Great post, Ned.  Made me teary, too. It occurred to me that I might be writing similar things in 20 years. The situation with my kids is similar to yours.","messageBody":"<div id=\"ygrps-yiv-1300376153\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt;<br/>\n&gt;The message here is: Let.  Let it happen.  Watch, and trust, and help if you<br/>\n&gt;can, but also trust from just the right distance, not too close, not<br/>\n&gt;distant. Hands on, but not massaging. So....Let..&..Trust.<br/>\n&gt;<br/>\n&gt;There does seem to be a plan. Our job seems to be not to make it, but to<br/>\n&gt;watch it unfold.      ...there I go, crying again.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Great post, Ned.  Made me teary, too.<br/>\n<br/>\nIt occurred to me that I might be writing similar things in 20 years. <br/>\n The situation with my kids is similar to yours. (Don&#39;t you have old <br/>\nchildren who went to school?)  My 8 yo is already a self-governing <br/>\nperson.  But I think there are going to be a whole lot more young people <br/>\nlike him, too.  How lucky your son was to find someone like that!<br/>\n<br/>\nI&#39;m curious about your son when he was 8, and your mindset then, too. <br/>\n I&#39;m sure you&#39;ve written about it some, but there&#39;s a lot of reading to do!<br/>\n<br/>\nTuck</div>","specialLinks":[]},{"userId":36888606,"authorName":"Luz Shosie and Ned Vare","from":"Luz Shosie and Ned Vare &lt;nedvare@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: 2244 - the Goal","postDate":"1029463840","msgId":41235,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI5ODFCMENGLjEzOUQlbmVkdmFyZUBudHBseC5uZXQ+","inReplyToHeader":"PDEwMjkzNDMzNDcuMzMwLjY5NzYxLm0xMkB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":41256,"prevInTime":41234,"nextInTime":41236,"topicId":41235,"numMessagesInTopic":0,"msgSnippet":"on 8/14/02 12:42 PM, Unschooling-dotcom@yahoogroups.com at Unschooling-dotcom@yahoogroups.com wrote: ... Ned adds: Our son decided on his own to go to college.","messageBody":"<div id=\"ygrps-yiv-582140937\">on 8/14/02 12:42 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a> at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a> wrote:<br/>\n<br/>\nNed wrote: <br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; <br/>\n&gt;&gt; If he had asked me whether I wanted him to go to college or if I thought<br/>\n&gt;&gt; college was a good way to spend time and money, I&#39;m sure that my honest<br/>\n&gt;&gt; answer would have been no. But he didn&#39;t ask and I didn&#39;t say, even though I<br/>\n&gt;&gt; believe he knew my feelings anyway - I don&#39;t hide a lot of my views....as<br/>\n&gt;&gt; you might have noticed.<br/>\n&gt; <br/>\n&gt; ROFL!<br/>\n&gt; <br/>\n&gt;&gt; Our goal for him was never college. Now that it&#39;s past, the goal is still<br/>\n&gt;&gt; his happiness, not any other. His self-government and our trust in him have<br/>\n&gt;&gt; so far been the foundation for everything, I believe.<br/>\n&gt; <br/>\n&gt; That&#39;s what I thought.  Just checking.  I have a hard time with the<br/>\n&gt; attitude of some homeschoolers that doing really well academically is *the*<br/>\n&gt; proof that homeschooling works.<br/>\n&gt; Tia<br/>\n<br/>\n </span></blockquote>Ned adds: <br/>\nOur son decided on his own to go to college. He got himself accepted to<br/>\nHunter College in NYC - about 80 miles from our home in CT.<br/>\n<br/>\nWhen he left for the city, in late August four years ago, his words were,<br/>\n&quot;I&#39;m not just going to college, I&#39;m leaving home.&quot;  He didn&#39;t mean that he<br/>\nwas ending his relationship with us -- we get along great -- but he was<br/>\nstating his break with day to day dependence, he was ready for independence<br/>\neven though he accepted our paying his tuition and living expenses.<br/>\n<br/>\nHis first true test of his abilities was not academics but how to survive in<br/>\nthat city. He needed a place to live first -- the dorms had been filled, not<br/>\nthat he wanted to live in one anyway. He found a roommate, a girl from<br/>\nCalifornia, through a bulletin board at the college, who also wanted to live<br/>\noff campus (campus is three skyscrapers in mid-town plus a theater and a few<br/>\nother smaller buildings)<br/>\n<br/>\nThose two got to know each other really well and quickly because they did<br/>\nnot move into their own place until November 7th. In the meantime, they<br/>\nstayed in several different hotels and weekly-rent rooming houses, living<br/>\nout of suitcases, eating in restaurants, doing laundry, taking the subway to<br/>\nschool and taking their unfamiliar courses in unfamiliar places, and having<br/>\nto move at short notice and not even know where they would move to, each<br/>\ntime. An adventure that most parents could not imagine having their kids<br/>\nendure even at college age...we think of going to college would be a gentle<br/>\nexperience with food and lodging taken care of among grassy courtyards and<br/>\nshade trees with only other students to deal with. These two were thrust<br/>\ninto the raging city, the big apple, the 24 hour nightmare.<br/>\n<br/>\nWhat I realized was that kids who had been told what to do all their lives<br/>\ncould never have survived what these two did -- the girl, even younger than<br/>\nour son, was accustomed to being her own boss and dealing with her own<br/>\nfinances and responsibilities. She was really far from home, but managed it<br/>\nwell.<br/>\n<br/>\n They never complained. They told the story almost as if it were a bad movie<br/>\nhappening to them. But brother did they learn a lot. And when classes<br/>\nstarted (in mid Sept.) and during the always-confusing intruductory period,<br/>\nour son was the one whom   others asked what to do. He got it right away,<br/>\nwithout ever going to school, and we believed that it was exactly because he<br/>\nhad never been to school and was always deciding things, and figuring them<br/>\nout, for himself. It had been the unschooling that prepared him for such<br/>\ndealing with a complex and difficult situation.<br/>\n<br/>\nThey found a beautiful new apartment building with a decent sized LR 2br/<br/>\n2b/K/small balcony/ 3rd Fl unit that turned out to be an enviable situation<br/>\ndowntown - where many such young folks want to be, and are - a short walk to<br/>\nthe subway (access to the whole city) and a twenty minute ride to the<br/>\ncollege (which has it&#39;s own station), plenty of ethnic restaurants in the<br/>\nneighborhood (called the Lower East Side), markets and stores and night<br/>\nclubs of every description.<br/>\n<br/>\nThe two of them stayed in that apartment for the entire four years and<br/>\nbecame fast friends, both did well in their fields, and both seemed to<br/>\nmanage themselves and their relationships well. In our son&#39;s case, we and he<br/>\ngive the credit to how we raised him to make his own decisions. In one essay<br/>\nfor freshman English, the assignment was to describe their upbringing. He<br/>\ndescribed his unschooling life in what were, to him, normal terms of a<br/>\nself-governing experience, but of course to the professor (a woman --<br/>\nthirtyish) his was a most unusual story, and her comment, which we treasure,<br/>\nof course, was that he must have had incredibly trusting parents to raise<br/>\nhim that way. He was happy to show it to us. We cried, of course.<br/>\n<br/>\nThe message here is: Let.  Let it happen.  Watch, and trust, and help if you<br/>\ncan, but also trust from just the right distance, not too close, not<br/>\ndistant. Hands on, but not massaging. So....Let..&..Trust.<br/>\n<br/>\nThere does seem to be a plan. Our job seems to be not to make it, but to<br/>\nwatch it unfold.      ...there I go, crying again.<br/>\n<br/>\nNed Vare</div>","specialLinks":[]}],"prevTopicId":41182,"nextTopicId":41255}}