{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Lynda","from":"&quot;Lynda&quot; &lt;lurine@...&gt;","replyTo":"LIST","senderId":"q3adnLjh6LaRoorFBifxOsS4Bvyy45OZA8AugAUpl5d1EkD4T3PBSZmSUtTDAB0canBVxNrKVX0khiz8eiM7rSFM2g","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Words from the lawyer, was 6 Kids in Idaho","postDate":"991754164","msgId":22440,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwYzUwMWMwZWRkMiQ3YTRhYTA0MCQ2NjVkZDFkMUBsZGlvbm5vPg==","referencesHeader":"PGNiLjExY2UxOGZhLjI4NGUyNTA1QGFvbC5jb20+IDwwMmU3MDFjMGVkYzkkMDdiM2IwYzAkNjYwMWE4YzBAdmRlbm5pcz4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":22439,"nextInTime":22441,"topicId":22440,"numMessagesInTopic":0,"msgSnippet":"More info. Lynda From: Billie Nix, Central Point, Oregon Sent: Tuesday, June 05, 2001 1:06 AM This interview with Edgar Steele, Joann McGuckin s atty. was just","messageBody":"<div id=\"ygrps-yiv-595956853\">More info.<br/>\n<br/>\nLynda<br/>\n<br/>\nFrom: Billie Nix, Central Point, Oregon<br/>\n<br/>\nSent: Tuesday, June 05, 2001 1:06 AM<br/>\n<br/>\nThis interview with Edgar Steele, Joann McGuckin&#39;s atty.<br/>\nwas just aired (9:50pm pacific) on the Roger Fredinburg<br/>\nradio show: (I&#39;m transcribing as I go...no grammar/spelling<br/>\npolice, PLEASE!)S=Edgar Steele, F=Roger Fredinburg.<br/>\n<br/>\nS: I was her lawyer until Friday morning when the local<br/>\nauthorities cut off all contact between me and my client.<br/>\n<br/>\nF: Is that what happened?<br/>\n<br/>\nS: And it was demanded that I communicate with them in<br/>\nwriting through the court appointed attorney.<br/>\n<br/>\nF: We have the attorney in exile, Edgar Steele. First and<br/>\nforemost the information is that you were fired by Joann<br/>\nMcGuckin, true or false?<br/>\n<br/>\nS: False.<br/>\n<br/>\nF: How does the state remove a lawyer from representation?<br/>\n<br/>\nS:The STATE does not remove a lawyer from<br/>\nreperesentation..... I withdrew ... They refused to let me<br/>\ntalk to her.....I said I gotta talk to her in person. They<br/>\nsaid, well you&#39;re not the lawyer, and I said but I AM. They<br/>\nsaid no, this other guy is.......I said he is the criminal<br/>\ndefense lawyer, I am her personal civil lawyer....people DO<br/>\nhave more than one lawyer for things in life. They said,<br/>\nsorry, we are under orders of the Bonner County prosecuting<br/>\nattorney, Phil Robinson, to NOT allow you to talk to her.<br/>\n<br/>\nF: Well, that&#39;s just plainly idiotic! So what&#39;s his phone<br/>\nnumber so people can call him and tell him what an idiot he<br/>\nis tomorrow??I&#39;m Serious!(laughter from Mr. Steele) S: Oh,<br/>\nI LOVE it!.....I&#39;m not going to subscribe to that, of<br/>\ncourse (faciously).<br/>\n<br/>\nF: You can&#39;t, no, let me do it. Let me call him an idiot!<br/>\nYou&#39;re an idiot, PHIL!<br/>\n<br/>\nS: His phone number is 208-263-6714.<br/>\n<br/>\nS:You see this was at the time the standoff was still going<br/>\non. Now, I could of gone into court, I could have gotten an<br/>\norder and I could have forced them to produce my client,<br/>\nJoann McGuckin, in person. But, I felt that was non<br/>\nproductive, given the sensitivity of the situation at the<br/>\ntime. And I still think that was appropriate, however,<br/>\ngiven the representation that she wanted to communicate to<br/>\nme only in writing and ONLY through the court appointed<br/>\nattorney, according to bar ethics rules, I had to comply<br/>\nwith that even though she hadn&#39;t personally told me. I<br/>\ndidn&#39;t want to do that. She hired me and by God, she was<br/>\nthe one I was going to talk to. I wasn&#39;t going to open my<br/>\nfiles to this guy, I wasn&#39;t going to take orders from this<br/>\nguy.<br/>\n<br/>\nF: NO! Oh, I&#39;m with you 100% on this, Edgar, that&#39; good<br/>\nrepresentation......<br/>\n<br/>\nLet&#39;s talk about the child abuse garbage that Joann has<br/>\nbeen accused of, any reality, any truth there?<br/>\n<br/>\nS: I think you charactarized it just right. I don&#39;t think<br/>\nthere&#39;s any reality to it at all. Consider the following:<br/>\nThe kids were spirited out of that house Saturday night,<br/>\ntaken directly to the hospital and the word that came out<br/>\nof the hospital was that they were quote&quot; in good<br/>\ncondition&quot;.<br/>\n<br/>\nF: Did they force vaccinations or anything on those kids<br/>\nthat had otherwise been disallowed by their family?<br/>\n<br/>\nS: They haven&#39;t announced that, but, what do you think??F:<br/>\nI think that probabaly they did.<br/>\n<br/>\nS: If they were in good condition after 5 days being hold<br/>\nup in the bathroom , WHICH is where they WERE, because they<br/>\nwere convinced that any moment the storm troopers were<br/>\ngoing to break in and kill them. The same way that they<br/>\nthought their mother was already dead! SO, AFTER 5 days of<br/>\nTHAT, they are in good shape..clearly...what WAS the felony<br/>\ninjury to these children for which she was originally<br/>\narrested??S: It&#39;s not real clear, but it appears that it&#39;s<br/>\nthe oldest daughter, Erina (sp??)who had returned from out<br/>\nof town, was somewhat estranged from the family,and<br/>\ncontacted the local authorities.....they were on the outs<br/>\nbecause they considered that she had abandoned them because<br/>\nshe left home just as the father was really sinking into<br/>\nthe final part of his illness.<br/>\n<br/>\nF:...So, we need you the MOST, and YOU&#39;RE gone!<br/>\n<br/>\nF: The property. Who bought it?<br/>\n<br/>\nS: It was bought in May 25, 1999, by Bonner County for<br/>\n$8700.00 in back taxes. A year and 3 months later, Bonner<br/>\nCounty then sold it to some people with the last name<br/>\nKorengutt(CHECK SPELLING!), who we have not been able to<br/>\ntrack down.<br/>\n<br/>\nF: I called JT Deihl&#39;s office several times, he refuses to<br/>\nreturn my calls. What do you know about him?<br/>\n<br/>\nS: YOU TOO!! He won&#39;t talk to me either.<br/>\n<br/>\nF: It looks to me like there was a little , uh, of &quot;help my<br/>\nfriends make money&quot; deal goin&#39; on here, but I can&#39;t prove<br/>\nit until I find the evidence.<br/>\n<br/>\nS: Yea, it would be inappropriate to speculate in that<br/>\nregard, however, it stinks to high heaven.<br/>\n<br/>\nF: Did the McGuckins own the property?<br/>\n<br/>\nS: Yes, free and clear, worth half million dollars,<br/>\nminimum, it&#39;s gorgeous property.<br/>\n<br/>\nF: So, we KNOW what the motivation is, we just have to find<br/>\nthe evidence. How about redemption laws in Idaho?<br/>\n<br/>\nS: Idaho has a one year redemption law. It&#39;s cut off once<br/>\nthe county vends the property, so it was cut off when they<br/>\nsold it to these Korengutts. However, my staff and my<br/>\nlawyers and investigators have been booking on this, even<br/>\nover the weekends since I&#39;ve been in exile as the lawyer,<br/>\nand we&#39;ve identified a number of points upon which we feel<br/>\nwe can not only file a lawsuit but survive demurers<br/>\n(sp!!)and we think that there is a reasonable chance of<br/>\nsuccess in undoing this sale.<br/>\n<br/>\nF: Have you looked at the federal law?<br/>\n<br/>\nS: ..There are federal statutes, I think the most<br/>\ninteresting one regards the violation of her CIVIL RIGHTS.<br/>\n<br/>\nF: My focus would be to generate revenue by using the<br/>\nnational show and asking people to donate to the trust<br/>\nfund, if the money was going to be used for something we<br/>\ncould all be sure of.<br/>\n<br/>\nS: Well, the money&#39;s been coming in, my wife added it up<br/>\ntonight, comes out like $2500.00 that came in over the last<br/>\n2 days and my prime motivation in calling you up was to say<br/>\nTHANK YOU for publicising it and to thank your listeners<br/>\nfor being so kind. AND I want to guarantee you, I will<br/>\nPERSONALLY see, with my last dying breath that every penny<br/>\nof this goes to JoAnn. There will NOT be any of this paid<br/>\nEVER to any lawyer or ANY court, as long as I breathe.<br/>\n<br/>\n                  **********************<br/>\nSubmitted by Billie Nix, Central Point, Oregon</div>","specialLinks":[]}],"prevTopicId":22439,"nextTopicId":22441}}