{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":70316959,"authorName":"AimeeL73@cs.com","from":"AimeeL73@...","profile":"aimeel73","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] Too busy?","postDate":"1062253478","msgId":79498,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE4NS4xZmI5NWM5MC4yYzgyMGRhNkBjcy5jb20+"},"prevInTopic":79491,"nextInTopic":79512,"prevInTime":79497,"nextInTime":79499,"topicId":79490,"numMessagesInTopic":0,"msgSnippet":"... Or because they re seeing how well it works? You guys sound really happy and fulfilled, and dontcha know, you re not supposed to? lol You were supposed to ","messageBody":"<div id=\"ygrps-yiv-977261817\"><a rel=\"nofollow\" target=\"_blank\" href=\"mailto:schorsewoman@...\">schorsewoman@...</a> writes: <br/>\n<blockquote><span title=\"ireply\"> &gt; I have noticed that well-meaning friends are starting to be more openly <br/>\n&gt; critical of unschooling. I don&#39;t know whether it is because they have held their <br/>\n&gt; tongues for so long that they can&#39;t resist &lt;grin&gt;...or whether there is some <br/>\n&gt; validity in their criticisms of the way we do unschooling.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Or because they&#39;re seeing how well it works? You guys sound really happy and <br/>\nfulfilled, and dontcha know, you&#39;re not supposed to? lol You were supposed to <br/>\nscrew it up somehow, and they&#39;re looking for how?  * It&#39;s gotta be here <br/>\nsomewhere....*  lol  Honestly, they&#39;re nit picking at this point, from what you&#39;ve <br/>\nsaid in this post.  <br/>\n<br/>\n&lt;&lt;My friends are constantly telling me that we are gone too much, that we <br/>\nneed to be home more, etc. &gt;&gt;<br/>\n<br/>\nAnd mine say that we should get out more.  Well, more my family than my <br/>\nfriends, but of course, never during &quot;school hours&quot;.  But we&#39;re not joiners, we&#39;re <br/>\nhappy homebodies, and that&#39;s the way we like it.  We still go out and do <br/>\nthings, but *nothing* scheduled.  Oh, I hear all the ways that I am permanently <br/>\nharming my child because of THAT!  But it works for us, the same way lots of <br/>\nactivities work for your family.  And even for a homebody, those things sound fun <br/>\nand worthwhile, and not at all like &quot;too&quot; much.  Maybe if you had 6 hours of <br/>\ncurriculum work each day it would be too much for the kids, but thank goodness, <br/>\nthat&#39;s not the case.  <br/>\n<br/>\n&lt;&lt;Then the comments come out about unschooling---that my kids are pursuing <br/>\nextracurricular stuff in place of &quot;real&quot; schooling. My kids are pretty intense <br/>\nabout what they do, so I don&#39;t feel that way. There is a lot of math and <br/>\nscience involved in learning to fly airplanes just for one example.<br/>\n<br/>\nAnyone else ever get this kind of reaction? <br/>\n<br/>\nDeana&gt;&gt;<br/>\n<br/>\n*sigh*  My general theory is, they&#39;re jealous (which you already mentioned) <br/>\nand uncomfortable at the same time.  <br/>\n<br/>\nSome people just can&#39;t get their minds around the fact that unschoolers live <br/>\nlife consciously, that we have the complete freedom to choose what to do.  No <br/>\nmatter how we use that freedom, or what we choose to do, it&#39;ll be seen as <br/>\nwrong, somehow.  Too many people for too long have been brainwashed in believing <br/>\nthat there is something fundamentally wrong with educational choice and <br/>\nfreedom. Freedom will breed chaos, and that&#39;s what the schools are for, to manage our <br/>\nchildren efficiently.    Most hs like to do that managing themselves, but, <br/>\nother than that, it&#39;s no different than the schools.  So they say you&#39;re not <br/>\n&quot;managing them&quot; like you should, of course.  <br/>\n<br/>\nIt&#39;s disconcerting to people, and when they bring this up it usually goes <br/>\nback to this need to control their kids, (or mine!) out of fear.  The fact that <br/>\nwe don&#39;t carry that fear around with us, and that they can&#39;t trigger us into <br/>\nthat fear with their &quot;concerns&quot;, is too hard for some people to really accept as <br/>\nreality. Something&#39;s gotta be &quot;wrong&quot;.   <br/>\n<br/>\n My Mom, bless her, throwing all these &quot;obvious&quot; concerns at me, ( he won&#39;t <br/>\nget a well rounded education!) and I&#39;m cool as a cucumber explaining things to <br/>\nher (no Mom, he&#39;s got lots of sharp edges lol)  and she&#39;s just getting so <br/>\nworked up I&#39;m afraid she&#39;s gonna pop something.  I don&#39;t know why she thinks she&#39;s <br/>\ngonna be able to convince me of that fear/control thing now at 29 when I <br/>\ndidn&#39;t go for it at 7, 13, 15, 19, 21, or 25!!!  But it&#39;s just inexplicable to <br/>\nher, and to a lot of people.<br/>\n<br/>\n<br/>\n~Aimee<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] Too busy?","postDate":"1062247969","msgId":79512,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJCNzYxNjYxLjFEQUY3JWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDIwMDMwODMwMTIwMDM2LjkzMjU4LnFtYWlsQHdlYjQxNjEyLm1haWwueWFob28uY29tPg=="},"prevInTopic":79498,"nextInTopic":0,"prevInTime":79511,"nextInTime":79513,"topicId":79490,"numMessagesInTopic":0,"msgSnippet":"... I think maybe the key is there in those two sentences. They are jealous. Their lives aren t as happy and joyous as yours. And they need there to be a ","messageBody":"<div id=\"ygrps-yiv-1804163867\">on 8/30/03 8:00 AM, DW at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:schorsewoman@...\">schorsewoman@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My line has been &quot;Well, this works for us.&quot;  Sometimes I think the criticism<br/>\n&gt; borders on jealousy because my kids choose their own activities and are<br/>\n&gt; self-motivated.<br/>\n<br/>\n </span></blockquote>I think maybe the key is there in those two sentences. They are jealous.<br/>\nTheir lives aren&#39;t as happy and joyous as yours. And they need there to be a<br/>\ngreater reward for sacrificing their family&#39;s joy otherwise they&#39;re being<br/>\nmiserable for no reason at all.<br/>\n<br/>\nAnd in the first sentence I&#39;m sensing defensiveness which will come across<br/>\nas weakness. They *want* you to be doubting so they can feel more confident<br/>\nthat their own more sacrificial choices are better.<br/>\n<br/>\nI liked Sandra&#39;s answers :-)<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] Too busy?","postDate":"1062246401","msgId":79491,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE2ZC4yMTM2Yjg2MC4yYzgxZjIwMUBhb2wuY29tPg=="},"prevInTopic":79490,"nextInTopic":79498,"prevInTime":79490,"nextInTime":79492,"topicId":79490,"numMessagesInTopic":0,"msgSnippet":"In a message dated 8/30/03 6:01:26 AM, schorsewoman@yahoo.com writes: ","messageBody":"<div id=\"ygrps-yiv-1353924624\">In a message dated 8/30/03 6:01:26 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:schorsewoman@...\">schorsewoman@...</a> writes:<br/>\n<br/>\n&lt;&lt; There are a lot of hsers in my area, but they don&#39;t do anything during the <br/>\nday.   &gt;&gt;<br/>\n<br/>\nI bet they would take exception to your summary of their SERIOUS <br/>\nhomeschooling!! LOL!<br/>\n<br/>\n&lt;&lt;My friends are constantly telling me that we are gone too much, that we <br/>\nneed to be home more, etc. &gt;&gt;<br/>\n<br/>\nGet new friends?<br/>\n<br/>\n&lt;&lt; How should I respond to this nagging? They make me feel like I am harming <br/>\nmy children.  I am the one who drives them and I don&#39;t mind. &gt;&gt;<br/>\n<br/>\nI don&#39;t know the dynamics.  Maybe you&#39;re younger than the friends, or their <br/>\nkids are older than yours, or they&#39;re feeling that you&#39;re soliciting their <br/>\nadvice.<br/>\n<br/>\nYou could say &quot;We LIKE to be out and about!&quot;<br/>\nYou could say &quot;You should get your kids OUT more!&quot; (just joshing them back, <br/>\nopposite)<br/>\n<br/>\n&lt;&lt;My line has been &quot;Well, this works for us.&quot;  Sometimes I think the <br/>\ncriticism borders on jealousy because my kids choose their own activities and are <br/>\nself-motivated.&gt;&gt;<br/>\n<br/>\nThat could be the plain and simple truth.  They&#39;re critical because they <br/>\ncan&#39;t figure out what to say and maybe your life makes them feel vaguely or <br/>\nspecifically uncomfortable.<br/>\n<br/>\n&lt;&lt;Then the comments come out about unschooling---that my kids are pursuing <br/>\nextracurricular stuff in place of &quot;real&quot; schooling.&gt;&gt;<br/>\n<br/>\nTell them that stuff IS their &quot;curricular stuff&quot; and so is every other waking <br/>\nmoment of their lives.<br/>\n<br/>\nOr you could say &quot;In the absence of curriculum, there is no such thing as <br/>\n&#39;extra-curricular.&#39;&quot;<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":134042206,"authorName":"DW","from":"DW &lt;schorsewoman@...&gt;","profile":"schorsewoman","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Too busy?","postDate":"1062244836","msgId":79490,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMwODMwMTIwMDM2LjkzMjU4LnFtYWlsQHdlYjQxNjEyLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDEwNjIxNzA2NTEuNDI0NC42NzM5OS5tMTBAeWFob29ncm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":79491,"prevInTime":79489,"nextInTime":79491,"topicId":79490,"numMessagesInTopic":0,"msgSnippet":"Hi! I have noticed that well-meaning friends are starting to be more openly critical of unschooling. I don t know whether it is because they have held their","messageBody":"<div id=\"ygrps-yiv-264904223\">Hi!<br/>\nI have noticed that well-meaning friends are starting to be more openly critical of unschooling. I don&#39;t know whether it is because they have held their tongues for so long that they can&#39;t resist &lt;grin&gt;...or whether there is some validity in their criticisms of the way we do unschooling.<br/>\n <br/>\nI disliked school as a kid, but loved learning.  I was always a self-motivated kid...and I am still a lifelong learner. I am always learning something new, always reading...I love finding out about resources, new ideas, places,  etc.  I always said that when I had kids I would expose them to as much as I could and let them follow their interests.  I am also an on-the-go type of person.  Sitting in front of TV, while I see nothing wrong with it, is not my style. I like to be in motion.<br/>\n <br/>\nI guess apples don&#39;t fall far from trees because my kids love to be in motion. They love to travel and they love getting involved in activities.  They are home all day doing whatever with me or their dad...dad works evenings so he is around every day all day long actively involved in their lives.  <br/>\n <br/>\nThere are a lot of hsers in my area, but they don&#39;t do anything during the day.  They are very conservative and don&#39;t think kids should be out in the community drawing attention to themselves.  As a result, there aren&#39;t many hs youth activities during the day.  Everything seems to happen at night so we are out most nights.<br/>\n <br/>\nMy kids are involved in Scouts (both kids), violin lessons, 2 ensembles each (both kids), Civil Air Patrol (one kid), dance (one kid), and horses (both kids).  My friends are constantly telling me that we are gone too much, that we need to be home more, etc.  But in our household the kids and one parent...and most of the time two parents...are home all day!  Yes, we are busy at night...and there are camping trips and field trips associated with Scouts and Civil Air Patrol on weekends, but we have a great time.  <br/>\n <br/>\nThese same friends have their kids in sports, which meet 4-6 times a week.  But they count it as one activity.  How should I respond to this nagging? They make me feel like I am harming my children.  I am the one who drives them and I don&#39;t mind.  I love it that they have interests and are committed to those interests.  I wish I had had similar opportunities when I was a kid.<br/>\n <br/>\nMy line has been &quot;Well, this works for us.&quot;  Sometimes I think the criticism borders on jealousy because my kids choose their own activities and are self-motivated. I think it bothers some of my friends that their kids aren&#39;t as involved and aren&#39;t as self-motivated.  It just happens to be my kids personality...and they have im-motion parents as their role models.  My competent kids in some way trigger competitive feelings. I certainly don&#39;t think every kid should have to be like mine. We are who we are though.<br/>\n <br/>\nThen the comments come out about unschooling---that my kids are pursuing extracurricular stuff in place of &quot;real&quot; schooling.  My kids are pretty intense about what they do, so I don&#39;t feel that way. There is a lot of math and science involved in learning to fly airplanes just for one example.<br/>\n <br/>\nAnyone else ever get this kind of reaction? <br/>\n <br/>\nDeana<br/>\n<br/>\n<br/>\n<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\nYahoo! SiteBuilder - Free, easy-to-use web site design software<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":1732,"nextTopicId":79286}}