{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"June Hodge","from":"&quot;June Hodge&quot; &lt;hodge@...","replyTo":"LIST","senderId":"OZu3-NUP-3M7PLVKzBxaCqH-qmF2M9eIegI0Za5j_Wx7I-Ivj9KfH7hJJURh14s3NurP3CPAGpKbRBAxT_3E9w0acrEi","spamInfo":{"isSpam":false,"reason":"0"},"subject":"FW: Re: child-led potty training","postDate":"946520727","msgId":5437,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4zNTUuNTQzNy45NTkyNjk3NDVAZUdyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":5436,"nextInTime":5438,"topicId":5437,"numMessagesInTopic":0,"msgSnippet":"Not so. The aforementioned book toilet training in less than a day specifically teaches toilet independance.  Getting their own pants up and down, emptying","messageBody":"<div id=\"ygrps-yiv-1607095826\">Not so. The aforementioned book &quot;toilet training in less than a day&quot;<br/>\nspecifically teaches toilet independance.  Getting their own pants up and<br/>\ndown, emptying their own potty. If U help them to learn to pull their pants<br/>\ndown and up instead of just doing it yourself that can be done before an<br/>\nattempt at pottying.<br/>\n    You can tell when they are ready to train as they go longer between<br/>\nurinating and are usually  dry in the morning. Of course,  this depends on<br/>\nwhat they eat.  Lots of Juice (sugar) that some think is healthy? cows milk,<br/>\nwhich makes them pee more.  My just turned a yr old is already dry some<br/>\nmornings.  Yes she breastfeeds in the night. my 3 yr old dd has had dry<br/>\npants since 2 yr.   with 1 accident and 1 bed wetting.   How about a stool<br/>\nat the sink so they can easily wash themselves.   I only took extra<br/>\nunderwear and pants with me for 2 weeks. Never did use them.  That method<br/>\nteaches true independance.  No I don&#39;t ask them if they need to go potty or<br/>\nremind them except to tell them we are going somewhere (so we all go potty<br/>\nfirst)<br/>\n   IMO, people make pottying harder than it needs to be.<br/>\n ok  done.<br/>\n June in WA<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nThe thing I have seen with moms who train before 2 is that they then must<br/>\nspend the next year asking the children every half hour if they need to go,<br/>\nand leading them to the potty about six times a day, and of course they<br/>\nspend quite a lot of time in the bathroom taking pants on and off, wiping<br/>\nand helping wash hands. They have to have extra underwear and pants packed<br/>\nwherever they go and deal with about one accident a day for quite a while.<br/>\nGranted mine didn&#39;t learn til he was 3.5, but once he did it was all his own<br/>\naffair: He went when he needed to without being reminded or led, took his<br/>\npants on and off himself, and knew to wash up afterward, and had maybe half<br/>\na dozen accidents total. And then, what about when the child is visiting<br/>\nsomeone without you, or you are out somewhere where it&#39;s not convenient to<br/>\nsit on the potty so often? I think someone did observe recently that mothers<br/>\nof the past stayed home with their children a lot more of the time.<br/>\n<br/>\nMy mom, who had us both out of diapers before we were 2, admitted that for<br/>\nthat first year, it was not the toddler but her who was trained. I guess<br/>\nit&#39;s just a matter of how you want to go about it.<br/>\n<br/>\nAs I said I don&#39;t think it hurts either way, but it does seem more tedious<br/>\nfor all concerned if you train before they are really ready to be<br/>\nindependent potty-goers.<br/>\n<br/>\nAnnette<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Message: 6<br/>\n&gt;    Date: Mon, 27 Dec 1999 18:53:59 -0800<br/>\n&gt;    From: &quot;Lynda&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:lurine@...\">lurine@...</a>&gt;<br/>\n&gt;Subject: Re: Unschooling potty-training and weaning<br/>\n&gt;<br/>\n&gt;Well, I&#39;m going to play devil&#39;s advocate here.  Can someone tell me exactly<br/>\n&gt;what is wrong with early toilet training if it is done right?  By right, I<br/>\n&gt;would guess the way that we did it back in the dark ages.  It wasn&#39;t a big<br/>\n&gt;deal, you were in the bathroom for whatever reason and you plotted the<br/>\n&gt;kidlet on the toilet and asked if they thought they might want to [insert<br/>\n&gt;name of choice] in the big potty.  You folded towels and put them away, put<br/>\n&gt;on your make-up, cleaned the sink, whatever.  If they did, cheering, if<br/>\n&gt;they didn&#39;t, no big deal and a o.k., maybe next time.  No trauma, no force,<br/>\n&gt;no big deal.  Of course, the boys were the easiest as they liked to watch<br/>\n&gt;it splash, kind of a monkey see, monkey do thing with daddy or uncle or big<br/>\n&gt;brother.  Again, no big deal.  As long as you caught them before the<br/>\n&gt;terrible 2&#39;s it wasn&#39;t any big deal.  They love making the toilet flush and<br/>\n&gt;watching the water swirl and gurgle, too.<br/>\n&gt;<br/>\n&gt;Sure, some folks got carried away and it became a competition but you are<br/>\n&gt;going to see that in any area of child rearing.  And, all in all, it is<br/>\n&gt;healthier for the kids to be out of the diapers.<br/>\n&gt;<br/>\n&gt;Lynda<br/>\n&gt;<br/>\n&gt;----------<br/>\n<br/>\n </span></blockquote>Message boards, timely articles, a free newsletter and more!<br/>\nCheck it all out at: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a></div>","specialLinks":[]}],"prevTopicId":5436,"nextTopicId":5438}}