{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Lisa Bugg","from":"&quot;Lisa Bugg&quot; &lt;LisaBugg@...","replyTo":"LIST","senderId":"9tBO_0qNQbpzu9Bppc4b-uF6zgill3fwsq7qCdla2uVXGUQhxbP2gtYjwLZTjVe107aq37tc49IQBV5jMbkY8yB4vWzc7BCtiq44Feo","spamInfo":{"isSpam":false,"reason":"0"},"subject":"News from AHA-Networking","postDate":"929709256","msgId":1176,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy44OC4xMTc2Ljk1OTI2OTc0MEBlR3JvdXBzLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":1175,"nextInTime":1177,"topicId":1176,"numMessagesInTopic":0,"msgSnippet":"Good Morning, Here is some fast breaking news from the AHA-networking list.  To follow the conversation even more closely you may want to subscribe to the","messageBody":"<div id=\"ygrps-yiv-1791304616\">Good Morning, <br/>\n <br/>\n  Here is some fast breaking news from the AHA-networking list.  To follow the conversation even more closely you may want to subscribe to the AHA-Networking list.  You can do this by sending email &lt;mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AHA-Networking-subscribe@...\">AHA-Networking-subscribe@...</a>&gt;  Below is a brief synopsis of what&#39;s up.<br/>\n<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:NarigonC@...\">NarigonC@...</a><br/>\n<br/>\nIn a message dated 6/16/99 10:35:29 PM Eastern Daylight Time, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sandbar@...\">sandbar@...</a> <br/>\nwrites:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Oops!  Carol, I know nothing about this.  Got the scoopage?<br/>\n<br/>\n </span></blockquote>Sandy, I&#39;ll tell this the best I can and as short as I can. The court <br/>\nproceedings are all a matter of public record in Washington state. <br/>\n<br/>\nCheryl Lindsey Seelhoff is the publisher/editor of a magazine called Gentle <br/>\nSpirit. It was pretty popular about 6 years ago with conservative Christian <br/>\nhomeschoolers and she was a popular speaker at conferences,. Gentle Spirit <br/>\nrecently came back into publication after a forced hiatus of about 5 years. <br/>\nSeems Cheryl&#39;s very abusive husband left her and their 9 kids in some pretty <br/>\ndire straights about 5 years ago. When she refused to take him back under <br/>\norders of some of the homeschool &quot;pillars&quot;, they set out to put her out of <br/>\nbusiness. And did. They made sure she lost the sole support of herself and <br/>\nher 9 children by calling her advertisers, columnists and subscribers and <br/>\ntelling them some pretty nasty tales. She was followed around online <br/>\nand....it&#39;s hard to describe how badly some people will treat someone who was <br/>\nhighly respected and then disappointed them. It was awful to read the vitriol <br/>\npeople posted online about this woman. Even before I knew what any of it was <br/>\nabout, I was just appalled that people would act that way toward another <br/>\nhuman being.<br/>\n<br/>\nSo she filed suit in United States District Court claiming, among other <br/>\nthings negligence, public disclosure of private facts, defamation, outrage, <br/>\nantitrust violations, and violations of the Lanham Act. The defendants named <br/>\nin the suit were Mary Pride, Sue Welch of Teaching Home, Gregg Harris <br/>\n(HSLDA), Christian Life Workshops, Christian Home Educators of Tacoma,  <br/>\nCalvary Chapel of Tacoma, Calvary Chapel of Costa Mesa, and Christian Home <br/>\nEducators of Ohio. Mary Pride, Gregg Harris, Calvary of Costa Mesa, and CHEO <br/>\nsettled out of court. <br/>\n<br/>\nSue Welch decided to let a jury hear the case. Probably not a good move on <br/>\nher part, although she had some pretty big names in the conservative <br/>\nChristian homeschool community testifying for her, including  Michael Boutot, <br/>\nformer chair of CHEO, Mary Pride, Gregg Harris, and Robert Green, Editor of <br/>\nQuit You Like Men. <br/>\n<br/>\nThe jury found Sue Welch guilty of conspiracy under the Sherman Anti-trust <br/>\nAct and that she had damaged Cheryl under the Sherman Anti-trust Act.  I <br/>\nthink the ones who settled out of court were probably pretty glad they did. <br/>\nWhatever the jury gives in an anti-trust suit is automatically tripled, I <br/>\nbelieve, and she had to pay Cheryl&#39;s legal fees as well.<br/>\n<br/>\nWhen I heard about this, I was pretty surprised that I&#39;d lived and <br/>\nhomeschooled in Ohio through the whole thing and didn&#39;t hear a word about it. <br/>\nSeems like this would be something a support group wouldn&#39;t keep from its <br/>\nmembership. Maybe I just don&#39;t travel in the right circles though. Anybody <br/>\nelse from Ohio hear anything about CHEO&#39;s involvement? I&#39;m sure there must be <br/>\nrecords some where.<br/>\n<br/>\nCarol</div>","specialLinks":[]}],"prevTopicId":1174,"nextTopicId":1183}}