{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":36,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: [AlwaysLearning] Re: 13yr old Boy","postDate":"1281033002","msgId":56698,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFBMEVFNDZGLUU4RkQtNEUwMy05QTdFLThFOTJBRTFENEY1NkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGkzZXQwNCszNHJ0QGVHcm91cHMuY29tPg==","referencesHeader":"PGkzZXQwNCszNHJ0QGVHcm91cHMuY29tPg=="},"prevInTopic":56696,"nextInTopic":56699,"prevInTime":56697,"nextInTime":56699,"topicId":56572,"numMessagesInTopic":0,"msgSnippet":"-=-If she s really determined to get up earlier, do it in tiny increments rather than big leaps. Don t try to get her up Hours before her usual time, get her","messageBody":"<div id=\"ygrps-yiv-1159084419\">-=-If she&#39;s really determined to get up earlier, do it in tiny  <br/>\nincrements rather than big leaps. Don&#39;t try to get her up Hours before  <br/>\nher usual time, get her up Minutes before her usual time. Give her  <br/>\nseveral days to a week to adjust before changing by another increment.  <br/>\nThat still means you&#39;ll need to shift your expectations, though. Going  <br/>\nfrom a 1pm wake-up to 10am in ten minute increments will take months!-=-<br/>\n<br/>\nIf in the absence of parental judgment she&#39;s determined to get up  <br/>\nearlier, let her use her alarm clock.<br/>\n<br/>\nWe found that if the reason to get up was real and big, the kid had no  <br/>\nproblem at all getting up.  My kids have worked ALL kinds of times,  <br/>\nand they get themselves up.   They didn&#39;t need to practice or use  <br/>\nincrements to get up when they need to.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":185586397,"authorName":"lylaw","from":"&quot;lylaw&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] 13 year old girl (was, not the same person... Re: 13yr old Boy","postDate":"1281032765","msgId":56699,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEMxQTE4QTM4NzRBNDRBNDVBMUE0QTM3QTE1MkZFMkNEQEx5bGFQQz4=","inReplyToHeader":"PDYyQjI5RTE5LUJGMzctNERBRC1CQjBBLUVDN0ExMEY2RjY2N0BTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGkzZWk1ZyszZmhiQGVHcm91cHMuY29tPiA8NjJCMjlFMTktQkYzNy00REFELUJCMEEtRUM3QTEwRjZGNjY3QFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":56698,"nextInTopic":56702,"prevInTime":56698,"nextInTime":56700,"topicId":56572,"numMessagesInTopic":0,"msgSnippet":"I agree with everything sandra said and wanted to add a couple things, because I have a former 13 year old girl (now 15) who also couldn t seem to please me in","messageBody":"<div id=\"ygrps-yiv-976089209\">I agree with everything sandra said and wanted to add a couple things, because I have a former 13 year old girl (now 15) who also couldn&#39;t seem to please me in many areas of her life, and about whom I used to have those same kinds of long term, catastrophic thoughts about &quot;who she was becoming&quot;, etc. <br/>\n<br/>\nthat attitude CAN be changed (by the mom) and in so doing, the relationship and struggle can be healed.  it&#39;s SO worth doing, because those kinds of messages about who your daughter &quot;might be becoming&quot; and the heavy handed disappointment in who she IS right now, is a prescription for a whole host of other issues, both personally for her, and in your relationship with her, as she grows into an adult.<br/>\n<br/>\nfor NOW though, if she really, truly wants help waking up early (and I&#39;d suggest making that only on the days she needs to be up for something (with the word &quot;need&quot; defined really loosely)  what about *connecting* with her in the helping process.  instead of seeing it as an irritation or disappointment, go climb in bed with her, if she&#39;d welcome that.  nuzzle her and snuggle her and wake her up sweetly.  <br/>\n<br/>\nor if you don&#39;t have that kind of relationship right now, bring her tea, or breakfast in bed.  or sit at the side of her bed and stroke her head and speak softly and sweetly to her.  I bet 15 minutes of sweet connection will go a lot further in the wakeup process than coming back for 30 seconds every 15 minutes to remind her, in essence, that when she does get up you will be disappointed with her.<br/>\n<br/>\nmy daughter still needs help waking up, mostly, if she has something to get up for.  but now, if I wasn&#39;t going to be home, she&#39;d use an alarm clock, even though she prefers me to come wake her up gently.  she will sometimes sleep til 3pm, and other times get up at 7, if she really needs to (for an airplane or a job).  she also wouldn&#39;t commit to getting up for something if she didn&#39;t plan to actually do it, but that&#39;s because I wouldn&#39;t push her to do so.   <br/>\n<br/>\nnot sure if 11am was the ONLY time your husband could get away for birthday stuff, but if you know your daughter&#39;s sleep needs and patterns, and that it&#39;s an area of stress already between you, you probably couldn&#39;t/shouldn&#39;t ask her to get up for something AND have a gift wrapped, at that time.  you could have scheduled it for later in the day, for instance.   set your child up for *success* not failure.  I wrote a blog post about that actually, in case it would be helpful to anyone:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://lylawolf.blogspot.com/2010/07/geting-outside-box-and-setting-up-for.html\">http://lylawolf.blogspot.com/2010/07/geting-outside-box-and-setting-up-for.html</a><br/>\n<br/>\nwarmly, lyla<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: 13yr old Boy","postDate":"1281029956","msgId":56696,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkzZXQwNCszNHJ0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGkzZWk1ZyszZmhiQGVHcm91cHMuY29tPg=="},"prevInTopic":56694,"nextInTopic":56698,"prevInTime":56695,"nextInTime":56697,"topicId":56572,"numMessagesInTopic":0,"msgSnippet":"... **************** Sometimes you can push a body onto a different schedule, but not always. It could be better to step back from the expectation that this is","messageBody":"<div id=\"ygrps-yiv-353083927\">&quot;jennifer.neary&quot; &lt;pcjen@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; If Pearl was happy to be a night owl, I&#39;d understand it and work with it.  But Pearl really doesn&#39;t like it when she gets up at 1:00 or 2:00 in the afternoon.  And I don&#39;t like it either.  I miss her!  I feel we are missing out on so much, that there are so many cool things we could be doing if we had more time together during the day. <br/>\n </span></blockquote>****************<br/>\n<br/>\nSometimes you can push a body onto a different schedule, but not always. It could be better to step back from the expectation that this is something that can be changed easily - it will either be a massive effort that requires a lot of help, or it won&#39;t happen. That&#39;s something to talk about together. Can you both accept that this is going to be her schedule for awhile and embrace that? <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; The other issue is that I fear that Pearl has become a person who does not keep her word. <br/>\n </span></blockquote>***********<br/>\n<br/>\nAll the more reason to change your expectations. If she had a job that kept her up certain hours, or if she had, say, chronic fatigue, you wouldn&#39;t be heaping on her the expectation of changing her sleep schedule to do other things. Treat her with that same courtesy. Make plans around her schedule. <br/>\n<br/>\nThat may mean she doesn&#39;t get out as much for awhile. It may mean more evening parties, late afternoon times to get out of the house. It may mean you shift your own schedule so that she doesn&#39;t feel quite so isolated. <br/>\n<br/>\nIf she&#39;s really determined to get up earlier, do it in tiny increments rather than big leaps. Don&#39;t try to get her up Hours before her usual time, get her up Minutes before her usual time. Give her several days to a week to adjust before changing by another increment. That still means you&#39;ll need to shift your expectations, though. Going from a 1pm wake-up to 10am in ten minute increments will take months!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;at a certain point she has to do her part<br/>\n<br/>\n </span></blockquote>That&#39;s an expectation that can wreck a relationship. It&#39;s already made inroads into your realtionship with your dd. See her as doing as much as she can already. More than that, she needs help.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: 13yr old Boy","postDate":"1281024432","msgId":56694,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYwNjg1Nzc5OTFFOTQ2MUE5Rjk3REQ3N0ZFRkNCMjc2QGRlYm9yYWg0M2YxM2ZkPg==","referencesHeader":"PGkzZWk1ZyszZmhiQGVHcm91cHMuY29tPg=="},"prevInTopic":56693,"nextInTopic":56696,"prevInTime":56693,"nextInTime":56695,"topicId":56572,"numMessagesInTopic":0,"msgSnippet":"***One of the issues is that Pearl *wants* to get up earlier and go to bed earlier but says she just can t. She says she s trying but can t. I have responded","messageBody":"<div id=\"ygrps-yiv-495198159\">***One of the issues is that Pearl *wants* to get up earlier and go to bed earlier but says she just can&#39;t. She says she&#39;s trying but can&#39;t. I have responded that I don&#39;t see her taking any steps to change, such as going to bed earlier. And by earlier I mean 1:00 vs. 3:30.***<br/>\n<br/>\nIt might be that her &quot;wanting&quot; is to please you, so you won&#39;t be as frustrated with her.  She might not really have an internalized desire to change her sleep pattern.  Or maybe she does want to!   But biology is a powerful force. <br/>\n<br/>\nShe didn&#39;t learn to crawl or walk all at once the first time you put her on the floor or stood her on her feet and held her hands.  She didn&#39;t learn it the tenth time either.  She learned it after being on the floor just the right amount of time for her to figure it out.   <br/>\n<br/>\nIt&#39;s that way with understanding her sleeping and waking needs too.   She won&#39;t learn to wake up for appointments and outings because you remind her ten times or a hundred times.   She&#39;ll learn it after she better understands her own sleep needs.  That might take years and it will surely take longer if she keeps feeling pressed to sleep and wake when you want her to. <br/>\n<br/>\nI remember missing Dylan when he slept late.  Use that time in the morning and early afternoon to get stuff done so that when she does wake up you can take off and do something together. <br/>\n<br/>\n***The other issue is that I fear that Pearl has become a person who does not keep her word. It is really important to me that my children be trustworthy.*** <br/>\n<br/>\nIt&#39;s way to early to decide she&#39;s not trustworthy!   She couldn&#39;t keep her word when she was two either, but it didn&#39;t worry you then,  I&#39;ll bet.  It didn&#39;t worry you because you knew she was learning and growing everyday.   She still is!  <br/>\n<br/>\nIf you were sick and missed an appointment that wouldn&#39;t make you untrustworthy.  She might not be physically ill but she is physically supercharging with new hormones.   <br/>\n<br/>\nDeb Lewis<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"13 year old girl (was, not the same person... Re: 13yr old Boy","postDate":"1281021961","msgId":56693,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYyQjI5RTE5LUJGMzctNERBRC1CQjBBLUVDN0ExMEY2RjY2N0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGkzZWk1ZyszZmhiQGVHcm91cHMuY29tPg==","referencesHeader":"PGkzZWk1ZyszZmhiQGVHcm91cHMuY29tPg=="},"prevInTopic":56692,"nextInTopic":56694,"prevInTime":56692,"nextInTime":56694,"topicId":56572,"numMessagesInTopic":0,"msgSnippet":"-=- She has asked me to wake her in the morning, which I happily do. But then she doesn t get up. Or she asks for 10 more minutes, then 10 more then 10 more. I","messageBody":"<div id=\"ygrps-yiv-276487344\">-=-<br/>\nShe has asked me to wake her in the morning, which I happily do. But  <br/>\nthen she doesn&#39;t get up. Or she asks for 10 more minutes, then 10 more  <br/>\nthen 10 more. I get annoyed by this; I don&#39;t want to stop what I&#39;m  <br/>\ndoing to wake her up every 10 minutes. Especially when my experience  <br/>\nis that she won&#39;t get up anyway. -=-<br/>\n<br/>\nI would just say no. Nicely, but no.<br/>\n<br/>\nShe won&#39;t learn to sleep as long as she needs to and then wake up  <br/>\nthrough ANY amount of discussion or outside &quot;assistance&quot;/interference.<br/>\n<br/>\nBut another important aspect is for the mom NOT to make a deal about  <br/>\nit.   If she wakes up a little and her first thought is guilt or fear,  <br/>\nthat&#39;s not restful.<br/>\n<br/>\nI would give her the alarm clock and tell her you&#39;re going to let her  <br/>\nsleep until she gets up.<br/>\n<br/>\nIf there&#39;s an event the next day, appointment, trip, guests, then the  <br/>\nday before I&#39;d remind her, and at night again.   Our standard phrase  <br/>\nhere is &quot;When do you need to get up?  Count back from that.&quot;   It  <br/>\nwasn&#39;t &quot;You have to go to bed at midnight because you&#39;re waking up at  <br/>\n8:00.&quot;   Sometimes six hours is enough.  It&#39;s help to organize the  <br/>\nwhole plan, not an enforcement of a plan.<br/>\n<br/>\n-=-She spent a week at camp, and like the original poster, I had hoped  <br/>\nthis would be the event that would get her off the nocturnal schedule.  <br/>\nThe two of us even discussed this. She had to get up at 7:00 a.m. each  <br/>\nmorning at camp, and she did. But after she got home she got right  <br/>\nback into her late to bed, late to rise schedule. It was disappointing  <br/>\nto say the least.-=-<br/>\n<br/>\nEeek!  Let it go.  Don&#39;t be disappointed.  Don&#39;t have expectations or  <br/>\nideals about when it&#39;s better to be awake.  If she didn&#39;t need to  <br/>\nsleep she wouldn&#39;t.<br/>\n<br/>\nOn the other hand, the maternal disappointment could become a REASON  <br/>\nto sleep.  If she is at peace asleep, and the object of disappointment  <br/>\nwhen she&#39;s awake, sleep wins out.<br/>\n<br/>\n-=-So there is no shortage of information about the fact that she  <br/>\nneeds to get up for something. And yet it&#39;s a huge struggle to get her  <br/>\nup for that thing. And often she says she didn&#39;t know she had to get  <br/>\nup, or that it was that important that she get up. It is baffling and  <br/>\nfrustrating.-=-<br/>\n<br/>\nWe review the next day every night, even now that the kids are grown.   <br/>\nOr when someone&#39;s going out for the evening, it&#39;s not considered an  <br/>\ninvasive question to ask &quot;What are your plans tomorrow?&quot;<br/>\n<br/>\nTuesday night Marty wanted to go and visit our friend Sadie, who just  <br/>\ngot back from three months or so in Mongolia.  But he needed to be up  <br/>\nfor a GED test session the next morning, and BE somewhere at 8:00.  He  <br/>\ntold me he would be back at midnight.<br/>\n<br/>\nAt 10:45 I was going to go to be, and I thought maybe it would be  <br/>\nworth seeing whether Marty would like a reminder not to stay too  <br/>\nlong.  I partly worried that there would be drinking going on over  <br/>\nthere.   I called him, and asked him if he thought maybe coming home  <br/>\nearlier would be a good idea.  He said &quot;Mom, I&#39;m upstairs in the  <br/>\nbathroom.&quot;   He was already home. &lt;g&gt;<br/>\n<br/>\nIf I had bugged Marty and shamed him when he was 13, I don&#39;t think the  <br/>\nstory above could have been told.  If it was the thousandth time I had  <br/>\nsuggested maybe he should go to bed, he might not even BE home at the  <br/>\nage of 21, telling me in advance where he was going and when he  <br/>\nplanned to come home.<br/>\n<br/>\n-=- The day before I asked her to please make sure her gift was  <br/>\nwrapped and ready, and that she was awake and ready by 11:00. I  <br/>\noffered to wrap the gift. Short version: she wasn&#39;t ready, her gift  <br/>\nwasn&#39;t wrapped. It was a bad scene. I thought it was really selfish of  <br/>\nher to put this kind of strain on Cas&#39; birthday celebration.-=-<br/>\n<br/>\nIt was a bad scene because you had visions of how it should be.  You  <br/>\ncould have just sweetly told him &quot;And later there&#39;s another gift  <br/>\ncoming, from Pearl!&quot;<br/>\n<br/>\nYou set up a situation in which she lost.  There was no winning for  <br/>\nher, it seems.<br/>\nIf she wrapped the gift the day before, you won and she lost.<br/>\n<br/>\n-=-I guess I&#39;m mostly frustrated because I am completely willing to do  <br/>\nwhatever I can to help her, but at a certain point she has to do her  <br/>\npart. And I&#39;m worried that she is becoming (or has already become)  <br/>\nsomeone who cannot be counted on to keep her word.-=-<br/>\n<br/>\nI think she&#39;s 13 and not yet legally of age to be expected to  <br/>\nnegotiate contracts.  Seriously.  &quot;To keep her word&quot; is a heavy onus  <br/>\nfor a little kid.<br/>\n<br/>\nPerhaps you mean she&#39;s not reliably doing what you tell her to do, or  <br/>\nfulfilling your image of how she should be.<br/>\n<br/>\nDeb Lewis wrote in another thread just this week:<br/>\n&quot;Your daughter has no responsibility to be the daughter you imagined.  <br/>\nYou have<br/>\na responsibility to be the mother your real daughter needs. Stop  <br/>\nlooking at<br/>\nwhat you don&#39;t have. Look instead at what you do have with an attitude  <br/>\nof<br/>\nacceptance and maturity.&quot;<br/>\n<br/>\nIf you relax, more than half the stress in the situation will be gone  <br/>\nimmediately.  She can&#39;t grow up in her own way if you keep holding the  <br/>\ntemplate up and shaking your head in disgust that she doesn&#39;t fit your  <br/>\nexpectations.<br/>\n<br/>\nI bet you $25 things will be better if you relax for a year.  Save  <br/>\nthis, and if you relax and stop bugging her about it for a year and  <br/>\nyou don&#39;t feel better about her, send it to me.  (You don&#39;t owe me  <br/>\nanything if she gets better.  It&#39;s a guarantee, not a wager.  God  <br/>\nforbid you would bet against your own child.)<br/>\n<br/>\nSandra<br/>\n<br/>\nmaybe, possibly, look at these:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/lazy\">http://sandradodd.com/lazy</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/partners/child\">http://sandradodd.com/partners/child</a><br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":258687292,"authorName":"Josh Moll","from":"Josh Moll &lt;josje_wosje@...&gt;","profile":"josje_wosje","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: 13yr old Boy","postDate":"1281021516","msgId":56692,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcxNTkyLjUyNDgwLnFtQHdlYjUyNjA3Lm1haWwucmUyLnlhaG9vLmNvbT4=","inReplyToHeader":"PGkzZWk1ZyszZmhiQGVHcm91cHMuY29tPg==","referencesHeader":"PGkzZWk1ZyszZmhiQGVHcm91cHMuY29tPg=="},"prevInTopic":56691,"nextInTopic":56693,"prevInTime":56691,"nextInTime":56693,"topicId":56572,"numMessagesInTopic":0,"msgSnippet":"________________________________ She has asked for my help and I ve given it.  She has rejected many of my suggestions such as set an alarm clock and put it in","messageBody":"<div id=\"ygrps-yiv-1919258676\">________________________________<br/>\n<br/>\n<br/>\nShe has asked for my help and I&#39;ve given it.  She has rejected many of my <br/>\nsuggestions such as set an alarm clock and put it in a place where you have to <br/>\nget up to turn it off.  She says that will just jar her awake and make her make <br/>\nher want to stay in bed.  I see it as &quot;that&#39;s the point; the alarm&#39;s purpose is <br/>\nto wake you up.&quot;  But we got nowhere with that idea.<br/>\n<br/>\nShe has asked me to wake her in the morning, which I happily do.  But then she <br/>\ndoesn&#39;t get up.  Or she asks for 10 more minutes, then 10 more then 10 more.  I <br/>\nget annoyed by this; I don&#39;t want to stop what I&#39;m doing to wake her up every 10 <br/>\nminutes.  Especially when my experience is that she won&#39;t get up anyway. <br/>\n<br/>\n<br/>\n<br/>\n****<br/>\nJust a small tip in the midst of this question. When my son had this problem we <br/>\nbought a lightclock. That helped very much. Gradually a light goes on, it takes <br/>\nhalf an hour to get fully bright and it has nature sounds getting slowly louder, <br/>\nin the same time. It made him wake up peacefully. If I went in around the fully <br/>\nbright time, with a cup of tea and something to eat he would get out of bed <br/>\nafterward and be present.<br/>\nIt was really difficult for him to wake, even if he wanted, because sleep was <br/>\nreally overpowering, and he wavered a lot between, &quot;my body needs this, so I <br/>\ncomply&quot;and &quot;I want to be able to wake up when I want to wake up so I&#39;ll force <br/>\nmyself&quot;. The lightclock helped to wake when he really wanted it.<br/>\nJosh<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":76178688,"authorName":"jennifer.neary","from":"&quot;jennifer.neary&quot; &lt;pcjen@...&gt;","profile":"jennifer.neary","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: 13yr old Boy","postDate":"1281018864","msgId":56691,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkzZWk1ZyszZmhiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGkzNWprZitjMm5zQGVHcm91cHMuY29tPg=="},"prevInTopic":56687,"nextInTopic":56692,"prevInTime":56690,"nextInTime":56692,"topicId":56572,"numMessagesInTopic":0,"msgSnippet":"Boy does this discussion come at a good time for me.  Summer 2010 is shaping up to be The Summer that Pearl Slept.  My recently turned 13 year old daughter","messageBody":"<div id=\"ygrps-yiv-1302455527\">Boy does this discussion come at a good time for me.  Summer 2010 is shaping up to be &quot;The Summer that Pearl Slept.&quot;  My recently turned 13 year old daughter always did stay up later and sleep later than me, but lately it&#39;s been way more so.<br/>\n<br/>\nI have read about teen&#39;s need for sleep and how they are naturally inclined to this type of schedule, and I&#39;m happy that because we unschool we can accommodate those natural rhythms.  If Pearl was happy to be a night owl, I&#39;d understand it and work with it.  But Pearl really doesn&#39;t like it when she gets up at 1:00 or 2:00 in the afternoon.  And I don&#39;t like it either.  I miss her!  I feel we are missing out on so much, that there are so many cool things we could be doing if we had more time together during the day. <br/>\n<br/>\nWe&#39;ve been struggling with each other over it all summer, and many, if not most, of our days have gotten off on the wrong foot because of it.  One of the issues is that Pearl *wants* to get up earlier and go to bed earlier but says she just can&#39;t.  She says she&#39;s trying but can&#39;t.  I have responded that I don&#39;t see her taking any steps to change, such as going to bed earlier.  And by earlier I mean 1:00 vs. 3:30.<br/>\n<br/>\nShe has asked for my help and I&#39;ve given it.  She has rejected many of my suggestions such as set an alarm clock and put it in a place where you have to get up to turn it off.  She says that will just jar her awake and make her make her want to stay in bed.  I see it as &quot;that&#39;s the point; the alarm&#39;s purpose is to wake you up.&quot;  But we got nowhere with that idea.<br/>\n<br/>\nShe has asked me to wake her in the morning, which I happily do.  But then she doesn&#39;t get up.  Or she asks for 10 more minutes, then 10 more then 10 more.  I get annoyed by this; I don&#39;t want to stop what I&#39;m doing to wake her up every 10 minutes.  Especially when my experience is that she won&#39;t get up anyway.  <br/>\n<br/>\nShe spent a week at camp, and like the original poster, I had hoped this would be the event that would get her off the nocturnal schedule.  The two of us even discussed this. She had to get up at 7:00 a.m. each morning at camp, and she did.  But after she got home she got right back into her late to bed, late to rise schedule.  It was disappointing to say the least.<br/>\n<br/>\nThe other issue is that I fear that Pearl has become a person who does not keep her word.  It is really important to me that my children be trustworthy.  She has very few things she needs to get up for, and none on a regular basis.  But sometimes there are things she needs to get out of bed for.  Typically these are things she wants to do, or things the family has planned to do, like leave for a weekend trip.  So we discuss it beforehand, often several times. I have a written schedule on the refrigerator that lists all the activities we&#39;re doing that week that will take one or more of us out of the house.  We talk about what I can do to help her successfully get up with the least amount of stress. So there is no shortage of information about the fact that she needs to get up for something.  And yet it&#39;s a huge struggle to get her up for that thing.  And often she says she didn&#39;t know she had to get up, or that it was that important that she get up.  It is baffling and frustrating.<br/>\n<br/>\nFor example:  it was my son&#39;s birthday, and my husband was going to come home from work at 11:00 so Cas could open his presents.  I talked to Pearl a lot about this.  About how excited Cas was about his birthday, and that her Dad was going to take some time away from work to come home.  The day before I asked her to please make sure her gift was wrapped and ready, and that she was awake and ready by 11:00.  I offered to wrap the gift. Short version: she wasn&#39;t ready, her gift wasn&#39;t wrapped.  It was a bad scene.  I thought it was really selfish of her to put this kind of strain on Cas&#39; birthday celebration.<br/>\n<br/>\nAfter reading some of the posts on this topic yesterday, I thought about how I could react differently, how I could make things better.  Pearl and I had planned to clean up her room together.  She had been saying she was going to do it, but she never got to it, so I offered to help.  It was super messy and kind of dangerous in there; there were sharp metal shavings on the floor from a project she&#39;d been doing.  Instead of waiting for her to get up so we could do it together, I just cleaned it up for her.  She was very surprised and very grateful.  And we had a good day.<br/>\n<br/>\nI guess I&#39;m mostly frustrated because I am completely willing to do whatever I can to help her, but at a certain point she has to do her part.  And I&#39;m worried that she is becoming (or has already become) someone who cannot be counted on to keep her word.<br/>\n<br/>\nJennie</div>","specialLinks":[]},{"userId":373387508,"authorName":"troubadour4me","from":"&quot;troubadour4me&quot; &lt;ronniegreek@...&gt;","profile":"troubadour4me","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: 13yr old Boy","postDate":"1280962918","msgId":56687,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkzY3JoNis3NzJsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGkzY28xaisybjJpQGVHcm91cHMuY29tPg=="},"prevInTopic":56683,"nextInTopic":56691,"prevInTime":56686,"nextInTime":56688,"topicId":56572,"numMessagesInTopic":0,"msgSnippet":"I have some tips for gamers and their systems and games. What i do is clean the games with rubbing alcohol on a clothe. also,the psp,dsi screens and then use a","messageBody":"<div id=\"ygrps-yiv-12804989\">I have some tips for gamers and their systems and games. What i do is clean the games with rubbing alcohol on a clothe. also,the psp,dsi screens and then use a dry clothe. I got a game working doing this. I then wax the system screens....car wax. This protects them. I wax watch and phone screens too. <br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;wtexans&quot; &lt;wtexans@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; ===Holly says 64s are good, but the controllers were not sturdy so they&#39;re hard to find.===<br/>\n&gt; <br/>\n&gt; Andrew&#39;s had good luck finding new and used gaming stuff, including N64 controllers, via Amazon Marketplace. We&#39;ve only ever had one thing not work (a controller), and the vendor replaced it at no cost immediately after I notified him about it. It still surprises me how often we find never-been-opened games and accessories for older game systems there!<br/>\n&gt; <br/>\n&gt; One thing we&#39;ve noticed about the N64 is that some used game cartridges are *very* picky about how they&#39;re inserted into the system, so we try to find new N64 games whenever possible because of that.<br/>\n&gt; <br/>\n&gt; Used GameCube games at GameStop can be quite inexpensive. If you buy one that doesn&#39;t work and you don&#39;t have success cleaning it with disc cleaner (we use the heck out of that stuff!), GameStop will swap it out or give you a refund. Same with any used game systems or handheld game systems you buy from them. (I don&#39;t work for them or get paid to endorse them; we&#39;re just happy, repeat customers!)<br/>\n&gt; <br/>\n&gt; Glenda<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: 13yr old Boy","postDate":"1280962411","msgId":56683,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcyNjYxNy43NzQ5MS5xbUB3ZWIxMTA0MTEubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PGkzYjhzMStldHFzQGVHcm91cHMuY29tPg==","referencesHeader":"PGkzYjhzMStldHFzQGVHcm91cHMuY29tPg=="},"prevInTopic":56682,"nextInTopic":56687,"prevInTime":56682,"nextInTime":56684,"topicId":56572,"numMessagesInTopic":0,"msgSnippet":"***usually they want to use the computer too (we have only one at this time and it due to other choices we cannot purchase another one for at least 6-9 ","messageBody":"<div id=\"ygrps-yiv-1957931276\">***usually they want to use the computer too (we have only one at this time and <br/>\nit due to other choices we cannot purchase another one for at least 6-9 <br/>\nmonths).***<br/>\n<br/>\nYou mean a new one right?  If this were my situation, I&#39;d find a used one, even <br/>\nan older one, one still usable for pc games and internet for the other kids. <br/>\n That can be very cheap, as cheap as $50 and maybe as much as $300, but still <br/>\nmuch much cheaper than a new fancy one, and sometimes people actually give away <br/>\nolder computers. <br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":67727291,"authorName":"wtexans","from":"&quot;wtexans&quot; &lt;wtexans@...&gt;","profile":"wtexans","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: 13yr old Boy","postDate":"1280959347","msgId":56682,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkzY28xaisybjJpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEE2QkMyQTk4LTFDRjgtNDM1OS04MTkxLTU0M0VEQjIyMjJCOEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":56669,"nextInTopic":56683,"prevInTime":56681,"nextInTime":56683,"topicId":56572,"numMessagesInTopic":0,"msgSnippet":"===Holly says 64s are good, but the controllers were not sturdy so they re hard to find.=== Andrew s had good luck finding new and used gaming stuff, including","messageBody":"<div id=\"ygrps-yiv-68861079\">===Holly says 64s are good, but the controllers were not sturdy so they&#39;re hard to find.===<br/>\n<br/>\nAndrew&#39;s had good luck finding new and used gaming stuff, including N64 controllers, via Amazon Marketplace. We&#39;ve only ever had one thing not work (a controller), and the vendor replaced it at no cost immediately after I notified him about it. It still surprises me how often we find never-been-opened games and accessories for older game systems there!<br/>\n<br/>\nOne thing we&#39;ve noticed about the N64 is that some used game cartridges are *very* picky about how they&#39;re inserted into the system, so we try to find new N64 games whenever possible because of that.<br/>\n<br/>\nUsed GameCube games at GameStop can be quite inexpensive. If you buy one that doesn&#39;t work and you don&#39;t have success cleaning it with disc cleaner (we use the heck out of that stuff!), GameStop will swap it out or give you a refund. Same with any used game systems or handheld game systems you buy from them. (I don&#39;t work for them or get paid to endorse them; we&#39;re just happy, repeat customers!)<br/>\n<br/>\nGlenda</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: [AlwaysLearning] Re: 13yr old Boy","postDate":"1280948602","msgId":56669,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE2QkMyQTk4LTFDRjgtNDM1OS04MTkxLTU0M0VEQjIyMjJCOEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEFBTkxrVGluMStDUnN5Y3Q9bnRhNEd1WEVydXZqaD1yQzRUWmFLa3hKeFFHbkBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEFBTkxrVGluTTZnNlFaN2V5WmV5RWdmU19RdEEwZ2QtVTNtSnhHak9CckxlLUBtYWlsLmdtYWlsLmNvbT4gPGkzYzljaStmczZqQGVHcm91cHMuY29tPiA8QUFOTGtUaW4xK0NSc3ljdD1udGE0R3VYRXJ1dmpoPXJDNFRaYUtreEp4UUduQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":56667,"nextInTopic":56682,"prevInTime":56668,"nextInTime":56670,"topicId":56572,"numMessagesInTopic":0,"msgSnippet":"-=-We got an old Nintendo 64 console with 2 controllers for $35 at a flea market and it came with some games (Super Mario 64, for one). I ve seen them in a","messageBody":"<div id=\"ygrps-yiv-49079839\">-=-We got an old Nintendo 64 console with 2 controllers for $35 at a  <br/>\nflea<br/>\nmarket and it came with some games (Super Mario 64, for one). I&#39;ve<br/>\nseen them in a couple of thrift stores too. We asked to plug it in<br/>\nbefore buying it to see if it still works and it sure does! I&#39;ve seen<br/>\nGamecubes too. And Gamestop still has lots of used games for<br/>\nGamecube.. which is still pretty popular.-=-<br/>\n<br/>\nHolly says 64s are good, but the controllers were not sturdy so  <br/>\nthey&#39;re hard to find.<br/>\n<br/>\nGamecube, she says the joy sticks were made better.<br/>\n<br/>\nThose are Holly&#39;s recommedations.  She&#39;s used all the systems.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: 13yr old Boy","postDate":"1280945163","msgId":56667,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGltVW5aeXlfX1RFUV82X18rX2tVcGk5UkZOPVVHTXRES2gyV05nZkBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PEFBTkxrVGluMStDUnN5Y3Q9bnRhNEd1WEVydXZqaD1yQzRUWmFLa3hKeFFHbkBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEFBTkxrVGluTTZnNlFaN2V5WmV5RWdmU19RdEEwZ2QtVTNtSnhHak9CckxlLUBtYWlsLmdtYWlsLmNvbT4JPGkzYzljaStmczZqQGVHcm91cHMuY29tPgk8QUFOTGtUaW4xK0NSc3ljdD1udGE0R3VYRXJ1dmpoPXJDNFRaYUtreEp4UUduQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":56666,"nextInTopic":56669,"prevInTime":56666,"nextInTime":56668,"topicId":56572,"numMessagesInTopic":0,"msgSnippet":"And if you don t have another tv, I almost got one of the huge screen tv s on freecycle but I didn t have a truck or trailer or muscle for hauling the thing.","messageBody":"<div id=\"ygrps-yiv-67871975\">And if you don&#39;t have another tv, I almost got one of the huge screen<br/>\ntv&#39;s on freecycle but I didn&#39;t have a truck or trailer or muscle for<br/>\nhauling the thing. Those pop up as people replace old tv sets with<br/>\nnewer flat screens. Great for gaming. You could also check Craigslist<br/>\nfor used ones for cheap.<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 8/4/10, k &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:katherand@...\">katherand@...</a>&gt; wrote:<br/>\n&gt; You can research which models were the better made ones. Probably most<br/>\n&gt; of them were made with the frustration factor in mind. ;) We got a $15<br/>\n&gt; Nerf armor for Karl&#39;s DS which snaps on the body very snuggly and has<br/>\n&gt; saved it from all but the loosening of the hinge (which could be fixed<br/>\n&gt; probably). He&#39;s had the thing for close to 4 years now.<br/>\n&gt;<br/>\n&gt; We got an old Nintendo 64 console with 2 controllers for $35 at a flea<br/>\n&gt; market and it came with some games (Super Mario 64, for one). I&#39;ve<br/>\n&gt; seen them in a couple of thrift stores too. We asked to plug it in<br/>\n&gt; before buying it to see if it still works and it sure does! I&#39;ve seen<br/>\n&gt; Gamecubes too. And Gamestop still has lots of used games for<br/>\n&gt; Gamecube.. which is still pretty popular.<br/>\n&gt;<br/>\n&gt; ~Katherine<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; On 8/4/10, plaidpanties666 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:plaidpanties666@...\">plaidpanties666@...</a>&gt; wrote:<br/>\n&gt;&gt; Used console systems (Xbox, PS2, Game Cube) can relieve a lot of<br/>\n&gt;&gt; competition<br/>\n&gt;&gt; for computers. Get the older models and the games will be cheaper, too.<br/>\n&gt;&gt; If<br/>\n&gt;&gt; there are pawn shops in your area, they&#39;re often good places for cheap<br/>\n&gt;&gt; electronics.<br/>\n&gt;&gt;<br/>\n&gt;&gt; ---Meredith<br/>\n&gt;&gt;<br/>\n&gt;&gt;<br/>\n&gt;&gt;<br/>\n&gt;&gt;<br/>\n&gt;&gt; ------------------------------------<br/>\n&gt;&gt;<br/>\n&gt;&gt; Yahoo! Groups Links<br/>\n&gt;&gt;<br/>\n&gt;&gt;<br/>\n&gt;&gt;<br/>\n&gt;&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: 13yr old Boy","postDate":"1280945003","msgId":56666,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGluMStDUnN5Y3Q9bnRhNEd1WEVydXZqaD1yQzRUWmFLa3hKeFFHbkBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGkzYzljaStmczZqQGVHcm91cHMuY29tPg==","referencesHeader":"PEFBTkxrVGluTTZnNlFaN2V5WmV5RWdmU19RdEEwZ2QtVTNtSnhHak9CckxlLUBtYWlsLmdtYWlsLmNvbT4JPGkzYzljaStmczZqQGVHcm91cHMuY29tPg=="},"prevInTopic":56665,"nextInTopic":56667,"prevInTime":56665,"nextInTime":56667,"topicId":56572,"numMessagesInTopic":0,"msgSnippet":"You can research which models were the better made ones. Probably most of them were made with the frustration factor in mind. ;) We got a $15 Nerf armor for","messageBody":"<div id=\"ygrps-yiv-1583639104\">You can research which models were the better made ones. Probably most<br/>\nof them were made with the frustration factor in mind. ;) We got a $15<br/>\nNerf armor for Karl&#39;s DS which snaps on the body very snuggly and has<br/>\nsaved it from all but the loosening of the hinge (which could be fixed<br/>\nprobably). He&#39;s had the thing for close to 4 years now.<br/>\n<br/>\nWe got an old Nintendo 64 console with 2 controllers for $35 at a flea<br/>\nmarket and it came with some games (Super Mario 64, for one). I&#39;ve<br/>\nseen them in a couple of thrift stores too. We asked to plug it in<br/>\nbefore buying it to see if it still works and it sure does! I&#39;ve seen<br/>\nGamecubes too. And Gamestop still has lots of used games for<br/>\nGamecube.. which is still pretty popular.<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 8/4/10, plaidpanties666 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:plaidpanties666@...\">plaidpanties666@...</a>&gt; wrote:<br/>\n&gt; Used console systems (Xbox, PS2, Game Cube) can relieve a lot of competition<br/>\n&gt; for computers. Get the older models and the games will be cheaper, too. If<br/>\n&gt; there are pawn shops in your area, they&#39;re often good places for cheap<br/>\n&gt; electronics.<br/>\n&gt;<br/>\n&gt; ---Meredith<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ------------------------------------<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: 13yr old Boy","postDate":"1280944338","msgId":56665,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkzYzljaStmczZqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFBTkxrVGluTTZnNlFaN2V5WmV5RWdmU19RdEEwZ2QtVTNtSnhHak9CckxlLUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":56663,"nextInTopic":56666,"prevInTime":56664,"nextInTime":56666,"topicId":56572,"numMessagesInTopic":0,"msgSnippet":"Used console systems (Xbox, PS2, Game Cube) can relieve a lot of competition for computers. Get the older models and the games will be cheaper, too. If there","messageBody":"<div id=\"ygrps-yiv-1149662077\">Used console systems (Xbox, PS2, Game Cube) can relieve a lot of competition for computers. Get the older models and the games will be cheaper, too. If there are pawn shops in your area, they&#39;re often good places for cheap electronics. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: 13yr old Boy","postDate":"1280944155","msgId":56663,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGlram1UbmVHZk4rZUJ1bjRzaGtXNHZMPWkwUD1GU08zcE42ZW1lS0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PEFBTkxrVGluTTZnNlFaN2V5WmV5RWdmU19RdEEwZ2QtVTNtSnhHak9CckxlLUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEZFOTQzREVCLUUyMkQtNEZFMy04QjU1LTc5OTEwMjNERkVDQUBTYW5kcmFkb2RkLmNvbT4JPGkzYjhzMStldHFzQGVHcm91cHMuY29tPgk8QUFOTGtUaW5NNmc2UVo3ZXlaZXlFZ2ZTX1F0QTBnZC1VM21KeEdqT0JyTGUtQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":56661,"nextInTopic":56665,"prevInTime":56662,"nextInTime":56664,"topicId":56572,"numMessagesInTopic":0,"msgSnippet":"... lites and the new DSi aren t too horribly pricey... less than $200","messageBody":"<div id=\"ygrps-yiv-767141670\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;For younger kids, it doesn&#39;t have to be topnotch gaming equipment. DS<br/>\n </span></blockquote>lites and the new DSi aren&#39;t too horribly pricey... less than $200&lt;&lt;&lt;<br/>\n<br/>\nDS lites are $129 and I found cheaper used ones at Gamestop<br/>\nDSi is $169 and even the DSi XL is $189 but refurbished ones are under $100<br/>\nPersonally I like the DS lite because it can play DS cartridges as<br/>\nwell as the older (cheaper) Gameboy Advance cartridges but it has no<br/>\ncamera like the DSi.<br/>\n<br/>\n~Katherine</div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: 13yr old Boy","postDate":"1280943131","msgId":56661,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGluTTZnNlFaN2V5WmV5RWdmU19RdEEwZ2QtVTNtSnhHak9CckxlLUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGkzYjhzMStldHFzQGVHcm91cHMuY29tPg==","referencesHeader":"PEZFOTQzREVCLUUyMkQtNEZFMy04QjU1LTc5OTEwMjNERkVDQUBTYW5kcmFkb2RkLmNvbT4JPGkzYjhzMStldHFzQGVHcm91cHMuY29tPg=="},"prevInTopic":56642,"nextInTopic":56663,"prevInTime":56660,"nextInTime":56662,"topicId":56572,"numMessagesInTopic":0,"msgSnippet":"I got a used computer for free one time on freecycle (it was a university town so the item was luckily available). It was good enough for playing online games","messageBody":"<div id=\"ygrps-yiv-1603155781\">I got a used computer for free one time on freecycle (it was a<br/>\nuniversity town so the item was luckily available). It was good enough<br/>\nfor playing online games for a while. I also got several monitors and<br/>\nstill have a couple of them. Good ones, CRT monitors people were<br/>\ngetting rid of in favor of flat screens.<br/>\n<br/>\nCraigslist might have something for cheap. Some computer fixing<br/>\nbusinesses sell at least low-end computers for fairly cheap.<br/>\n<br/>\nFor younger kids, it doesn&#39;t have to be topnotch gaming equipment. DS<br/>\nlites and the new DSi aren&#39;t too horribly pricey... less than $200 and<br/>\nmaybe they could each have one and play Mario Kart or something like<br/>\nthat together. Karl spends hours on his sometimes, and I hope to get a<br/>\nDS lite for myself pretty soon cuz I know he&#39;d love to have a game<br/>\nbuddy, especially one he could beat every time (haha).<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 8/4/10, mummichellec &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:justinmichellec@...\">justinmichellec@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt; I cannot exactly pinpoint when we started unschooling because it has been<br/>\n&gt; such a gradual process of letting go.  It has been in &#39;process&#39; since my<br/>\n&gt; youngest was born - Alex is now 6.<br/>\n&gt;<br/>\n&gt; Yes, he is at Boyscout Camp and my DH is there with him and we will be<br/>\n&gt; changing up tomorrow and I wiil go have some fun at camp too.  It is his 3rd<br/>\n&gt; time going to camp and he has always had his parents there with him at every<br/>\n&gt; Scouting event.<br/>\n&gt;<br/>\n&gt; In response to other posts,  I do intervene when he is being disturbed by<br/>\n&gt; his brothers - usually they want to use the computer too (we have only one<br/>\n&gt; at this time and it due to other choices we cannot purchase another one for<br/>\n&gt; at least 6-9 months). I am always bringing him food, water etc.  I do not<br/>\n&gt; try to get him off the computer and I do ask questions about his games.<br/>\n&gt;<br/>\n&gt; I am new to the group and appreciate the comments...<br/>\n&gt;<br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n&gt;&gt;<br/>\n&gt;&gt; -=-He is at BoyScout Camp this week - yeah!<br/>\n&gt;&gt; But as soon as he gets home, he will be on the computer and up all night<br/>\n&gt;&gt; again. Should I be concerned?-=-<br/>\n&gt;&gt;<br/>\n&gt;&gt; I&#39;m a little concerned that you consider boy scout camp to be vastly<br/>\n&gt;&gt; superior to his being safe at home.<br/>\n&gt;&gt;<br/>\n&gt;&gt; He&#39;s 13.  How long has he been unschooled?<br/>\n&gt;&gt;<br/>\n&gt;&gt; Sandra<br/>\n&gt;&gt;<br/>\n&gt;&gt; [Non-text portions of this message have been removed]<br/>\n&gt;&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ------------------------------------<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":238176887,"authorName":"mummichellec","from":"&quot;mummichellec&quot; &lt;justinmichellec@...&gt;","profile":"mummichellec","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: 13yr old Boy","postDate":"1280911041","msgId":56642,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkzYjhzMStldHFzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEZFOTQzREVCLUUyMkQtNEZFMy04QjU1LTc5OTEwMjNERkVDQUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":56638,"nextInTopic":56661,"prevInTime":56641,"nextInTime":56643,"topicId":56572,"numMessagesInTopic":0,"msgSnippet":"I cannot exactly pinpoint when we started unschooling because it has been such a gradual process of letting go.  It has been in process since my youngest was","messageBody":"<div id=\"ygrps-yiv-350491290\">I cannot exactly pinpoint when we started unschooling because it has been such a gradual process of letting go.  It has been in &#39;process&#39; since my youngest was born - Alex is now 6.  <br/>\n<br/>\nYes, he is at Boyscout Camp and my DH is there with him and we will be changing up tomorrow and I wiil go have some fun at camp too.  It is his 3rd time going to camp and he has always had his parents there with him at every Scouting event.  <br/>\n<br/>\nIn response to other posts,  I do intervene when he is being disturbed by his brothers - usually they want to use the computer too (we have only one at this time and it due to other choices we cannot purchase another one for at least 6-9 months). I am always bringing him food, water etc.  I do not try to get him off the computer and I do ask questions about his games.  <br/>\n<br/>\nI am new to the group and appreciate the comments...<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; -=-He is at BoyScout Camp this week - yeah!<br/>\n&gt; But as soon as he gets home, he will be on the computer and up all night<br/>\n&gt; again. Should I be concerned?-=-<br/>\n&gt; <br/>\n&gt; I&#39;m a little concerned that you consider boy scout camp to be vastly  <br/>\n&gt; superior to his being safe at home.<br/>\n&gt; <br/>\n&gt; He&#39;s 13.  How long has he been unschooled?<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":183568025,"authorName":"Bob Collier","from":"&quot;Bob Collier&quot; &lt;bobcollier@...&gt;","profile":"quaussiebob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: 13yr old Boy","postDate":"1280901585","msgId":56638,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkzYXZraCtzdnBhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDNFRTY1QzNDLTkxREYtNEY4Ri1BODYwLTE5QkRBRUVDNUZCM0BTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":56623,"nextInTopic":56642,"prevInTime":56637,"nextInTime":56639,"topicId":56572,"numMessagesInTopic":0,"msgSnippet":"... Just a thought from my own experience. I don t think anybody ever has total freedom. My son doesn t have total freedom even though he does things that may","messageBody":"<div id=\"ygrps-yiv-321853532\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; -=-Jordan has always been homeschooled and we have been unschooling  <br/>\n&gt; for about 4yrs. However, he wanted to try 6th grade last fall....he  <br/>\n&gt; hated it and lasted 3 days (to my relief). In the last six months I  <br/>\n&gt; have been letting go of all the &#39;rules, expectations etc&#39; and have  <br/>\n&gt; given him and his siblings their total freedom. -=-<br/>\n&gt; <br/>\n&gt; &quot;Their total freedom&quot; isn&#39;t a concept that&#39;s promoted on this list.<br/>\n&gt; <br/>\n&gt; If you told him he could do whatever he wanted to do, that he HAD  <br/>\n&gt; &quot;total freedom,&quot; then that&#39;s the deal at your house now, and you  <br/>\n&gt; shouldn&#39;t be asking us how to change it.<br/>\n&gt; <br/>\n&gt; I think it was a mistake for you to have replaced rules and  <br/>\n&gt; expectations with &quot;&#39;their&#39; total freedom&quot; under any circumstances.<br/>\n&gt; <br/>\n&gt; And if it&#39;s only recently that you stopped telling them what to do,  <br/>\n&gt; then he&#39;s making up for not having had choices for 13 years.  That  <br/>\n&gt; WILL take a while.<br/>\n&gt; <br/>\n&gt; Be careful with your words.  That will  help you be careful with your  <br/>\n&gt; thoughts.   Thoughts and feelings can&#39;t be separated.  So if your  <br/>\n&gt; feelings don&#39;t match your words, there&#39;s your problem.<br/>\n&gt; <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/words\">http://sandradodd.com/words</a><br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/gradualchange\">http://sandradodd.com/gradualchange</a><br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Just a thought from my own experience. <br/>\n<br/>\nI don&#39;t think anybody ever has total freedom. My son doesn&#39;t have total freedom even though he does things that may make it appear as if he does, such as play videogames all night and sleep in until lunchtime or later. He does what he chooses to do. Occasionally what he chooses to do is comply with a request to do what somebody else wants him to do at the time. He isn&#39;t given chores, for example, but I might ask him to load the dishwasher if that needs to be done right now and I&#39;m doing something else. That kind of thing. That&#39;s all as it should be I think, since we live interactive lives.<br/>\n<br/>\nWhat&#39;s been useful to me is to aim for &quot;maximum freedom&quot;. I&#39;ve found with that in mind that I can push the &quot;boundaries&quot; of behaviour out a long long way before I start to get &quot;edgy&quot;. :-)<br/>\n<br/>\nBob</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: 13yr old Boy","postDate":"1280886797","msgId":56623,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc0NjUzMy4yMzY5NC5xbUB3ZWIxMTA0MDgubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PGkzODZodSthcnFiQGVHcm91cHMuY29tPg==","referencesHeader":"PGkzODZodSthcnFiQGVHcm91cHMuY29tPg=="},"prevInTopic":56611,"nextInTopic":56638,"prevInTime":56622,"nextInTime":56624,"topicId":56572,"numMessagesInTopic":0,"msgSnippet":"***In the last six months I have been letting go of all the rules, expectations etc and have given him and his siblings their total freedom. Since we are so ","messageBody":"<div id=\"ygrps-yiv-1302937436\">***In the last six months I have been letting go of all the &#39;rules, expectations <br/>\netc&#39; and have given him and his siblings their total freedom. Since we are so <br/>\n&#39;different&#39; than our neighbors and other homeschoolers, it has been hard to <br/>\nconnect with other teens like him. I have told him that I am giving him his <br/>\nfreedom and I don&#39;t want him to think I am ignoring him or don&#39;t care about <br/>\nhim.***<br/>\n<br/>\nHave you replaced the rules and expectations with something else?  Freedom is <br/>\ngreat, but if kids are used to rules and expectations, they might not know what <br/>\nto do instead.  It can takes years of kind interactions with one another for <br/>\nkids to stop reacting to one another in the ways in which they did when they had <br/>\nrules and expectations.<br/>\n<br/>\nI think kids will need MORE of mom rather than less, if mom has taken away rules <br/>\nand expectations, at least for a while until things even out.  Mom should be <br/>\nmore present, more aware, more available to settle disputes and give food and <br/>\ncomfort.  If you have a rule of &quot;no hitting&quot;, kids might still hit each other, <br/>\nbut if they&#39;ve done so, the punishment is the end, mom is done and the child has <br/>\nbeen punished for his crime and done his time, but if you abolish the rule, kids <br/>\nstill might hit, but mom needs to help settle disputes and listen and talk and <br/>\nredirect, and more than anything prevent it from happening in the first place. <br/>\n That kind of stuff takes time, but once it flows, life actually become easier.<br/>\n<br/>\nDon&#39;t ignore your son, be there more for him, maybe not physically sitting next <br/>\nto him all the time, but keep the younger ones away from his space, make sure <br/>\nhe&#39;s got comfort and food and all that good stuff, help him keep his peace.<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":301108410,"authorName":"Marina DeLuca-Howard","from":"Marina DeLuca-Howard &lt;delucahoward@...&gt;","profile":"matedgirl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: 13yr old Boy","postDate":"1280873902","msgId":56611,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGk9blB3aS1ZaTZpM2ZUTnMzTENja1BrPU9BeXNweDdkRm4xVlkzWEBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDNFRTY1QzNDLTkxREYtNEY4Ri1BODYwLTE5QkRBRUVDNUZCM0BTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGkzODZodSthcnFiQGVHcm91cHMuY29tPgk8M0VFNjVDM0MtOTFERi00RjhGLUE4NjAtMTlCREFFRUM1RkIzQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":56603,"nextInTopic":56623,"prevInTime":56610,"nextInTime":56612,"topicId":56572,"numMessagesInTopic":0,"msgSnippet":"My boys are 7, 10 and 14.  They are quite similar to yours, though Rowan will invite the others to go to the corner store on a pop and chip run on occasion. My","messageBody":"<div id=\"ygrps-yiv-977559839\">My boys are 7, 10 and 14.  They are quite similar to yours, though Rowan<br/>\nwill invite the others to go to the corner store on a pop and chip run on<br/>\noccasion.<br/>\n<br/>\nMy children have conflicts, though Rowan is very very patient, but more<br/>\ntolerant of the younger brother than the middle child, who he feels talks<br/>\ntoo much and is extremely boring.<br/>\n<br/>\nRowan tried being up all night, though we never officially had a bed time he<br/>\ndecided he didn&#39;t like it enough to make it permanent.  So if he&#39;s playing<br/>\nan new RPG or watching a new cartoon or reading a new book he will immerse<br/>\nhimself in it and may not sleep until 5 or 6am.<br/>\n<br/>\nHe is perfectly willing to share a meal with me alone if I invite him, as<br/>\nhis brothers and dad are away right now.  He even comes grocery shopping on<br/>\noccasion although not if his younger brothers are going.<br/>\n<br/>\nIf you are truly allowing him his freedom, accepting an invitation is not<br/>\ngoing to be seen as an issue by your son.  But from your description you are<br/>\nallowing him to make choices but then redirecting his choices, or worrying.<br/>\n If you have an issue you ought to talk to him and try to understand his<br/>\nchoices.  He seems to be doing lots besides just being on the computer.<br/>\n<br/>\nDo you run interference for him when the younger siblings are bugging him?<br/>\nMarina<br/>\n<br/>\n<br/>\n-- <br/>\nIf you want to build a boat, do not instruct the men to saw wood, stitch<br/>\nthe sails, prepare the tools and organize the work, but make them long for<br/>\nsetting sail and travel to distant lands.  Antoine De Saint-Exupry<br/>\n<br/>\nRent our cottage:  <a rel=\"nofollow\" target=\"_blank\" href=\"http://davehoward.ca/cottage/\">http://davehoward.ca/cottage/</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: 13yr old Boy","postDate":"1280856167","msgId":56603,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNFRTY1QzNDLTkxREYtNEY4Ri1BODYwLTE5QkRBRUVDNUZCM0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGkzODZodSthcnFiQGVHcm91cHMuY29tPg==","referencesHeader":"PGkzODZodSthcnFiQGVHcm91cHMuY29tPg=="},"prevInTopic":56600,"nextInTopic":56611,"prevInTime":56602,"nextInTime":56604,"topicId":56572,"numMessagesInTopic":0,"msgSnippet":"-=-Jordan has always been homeschooled and we have been unschooling for about 4yrs. However, he wanted to try 6th grade last fall....he hated it and lasted 3","messageBody":"<div id=\"ygrps-yiv-383306305\">-=-Jordan has always been homeschooled and we have been unschooling  <br/>\nfor about 4yrs. However, he wanted to try 6th grade last fall....he  <br/>\nhated it and lasted 3 days (to my relief). In the last six months I  <br/>\nhave been letting go of all the &#39;rules, expectations etc&#39; and have  <br/>\ngiven him and his siblings their total freedom. -=-<br/>\n<br/>\n&quot;Their total freedom&quot; isn&#39;t a concept that&#39;s promoted on this list.<br/>\n<br/>\nIf you told him he could do whatever he wanted to do, that he HAD  <br/>\n&quot;total freedom,&quot; then that&#39;s the deal at your house now, and you  <br/>\nshouldn&#39;t be asking us how to change it.<br/>\n<br/>\nI think it was a mistake for you to have replaced rules and  <br/>\nexpectations with &quot;&#39;their&#39; total freedom&quot; under any circumstances.<br/>\n<br/>\nAnd if it&#39;s only recently that you stopped telling them what to do,  <br/>\nthen he&#39;s making up for not having had choices for 13 years.  That  <br/>\nWILL take a while.<br/>\n<br/>\nBe careful with your words.  That will  help you be careful with your  <br/>\nthoughts.   Thoughts and feelings can&#39;t be separated.  So if your  <br/>\nfeelings don&#39;t match your words, there&#39;s your problem.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/words\">http://sandradodd.com/words</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/gradualchange\">http://sandradodd.com/gradualchange</a><br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: 13yr old Boy","postDate":"1280852066","msgId":56600,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE2NUMyNDU5LUFGM0MtNDg2Ri05RDRGLTBDRDMwNzMxM0ZEM0Bjb21jYXN0Lm5ldD4=","inReplyToHeader":"PGkzODZodSthcnFiQGVHcm91cHMuY29tPg==","referencesHeader":"PGkzODZodSthcnFiQGVHcm91cHMuY29tPg=="},"prevInTopic":56598,"nextInTopic":56603,"prevInTime":56599,"nextInTime":56601,"topicId":56572,"numMessagesInTopic":0,"msgSnippet":"... I m curious. If you have been unschooling for 4 years and you hadn t gradually let go of rules and expectations in that time, what was happening? What do","messageBody":"<div id=\"ygrps-yiv-874173851\"><blockquote><span title=\"ireply\">&gt; Jordan has always been homeschooled and we have been unschooling for  <br/>\n&gt; about 4yrs.  However, he wanted to try 6th grade last fall....he  <br/>\n&gt; hated it and lasted 3 days (to my relief).<br/>\n&gt; In the last six months I have been letting go of all the &#39;rules,  <br/>\n&gt; expectations etc&#39; and have given him and his siblings their total  <br/>\n&gt; freedom.<br/>\n<br/>\n </span></blockquote>I&#39;m curious. If you have been unschooling for 4 years and you hadn&#39;t  <br/>\ngradually let go of rules and expectations in that time, what was  <br/>\nhappening? What do you mean by &quot;total freedom&quot;?<br/>\n<br/>\nYou&#39;ll notice that this list will recommend going slowly with changes,  <br/>\nsaying yes more, Sandra&#39;s &quot;&quot;read a little, try a little, wait a while,  <br/>\nwatch&quot; approach.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Since we are so &#39;different&#39; than our neighbors and other  <br/>\n&gt; homeschoolers, it has been hard to connect with other teens like  <br/>\n&gt; him.  I have told him that I am giving him his freedom and I don&#39;t  <br/>\n&gt; want him to think I am ignoring him or don&#39;t care about him.  My DH  <br/>\n&gt; commented that &quot;Jordan is just working on his computer skills all  <br/>\n&gt; night long.&quot; I just keep on breathing and having faith he is doing  <br/>\n&gt; what he needs to do.<br/>\n<br/>\n </span></blockquote>It appears you&#39;re new here, so I suggest reading more to help you  <br/>\n&quot;have faith&quot; (though I wonder if maybe your husband has been reading  <br/>\nfor a while &lt;g&gt;). Here are a couple of pages from Sandra&#39;s site about  <br/>\nteens and gaming to start you off.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/teen/\">http://sandradodd.com/teen/</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/videogames/\">http://sandradodd.com/videogames/</a><br/>\n(that&#39;s my daughter, dressed as her character in World of Warcraft, at  <br/>\nBlizzcon)<br/>\n<br/>\nRobin B.</div>","specialLinks":[]},{"userId":238176887,"authorName":"mummichellec","from":"&quot;mummichellec&quot; &lt;justinmichellec@...&gt;","profile":"mummichellec","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: 13yr old Boy","postDate":"1280810366","msgId":56598,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkzODZodSthcnFiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGkzNmZxbitrc2FmQGVHcm91cHMuY29tPg=="},"prevInTopic":56594,"nextInTopic":56600,"prevInTime":56597,"nextInTime":56599,"topicId":56572,"numMessagesInTopic":0,"msgSnippet":"Thanks! I need the support. Jordan has always been homeschooled and we have been unschooling for about 4yrs.  However, he wanted to try 6th grade last","messageBody":"<div id=\"ygrps-yiv-781087582\">Thanks! I need the support.<br/>\n<br/>\nJordan has always been homeschooled and we have been unschooling for about 4yrs.  However, he wanted to try 6th grade last fall....he hated it and lasted 3 days (to my relief). In the last six months I have been letting go of all the &#39;rules, expectations etc&#39; and have given him and his siblings their total freedom. Since we are so &#39;different&#39; than our neighbors and other homeschoolers, it has been hard to connect with other teens like him.  I have told him that I am giving him his freedom and I don&#39;t want him to think I am ignoring him or don&#39;t care about him.  My DH commented that &quot;Jordan is just working on his computer skills all night long.&quot; I just keep on breathing and having faith he is doing what he needs to do.  <br/>\n<br/>\nMichelle (Alex 6, Trevor 10, Jordan 13)<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Some teens go through a period where they need a looooot of time alone. When Ray was 13, he was mostly nocturnal and played Runescape for hours and hours a night. He didn&#39;t want to be around younger kids and kept up the friendships he could online.  Your guy has some regular social outtings, it seems like - he may not need more than that right now.  <br/>\n&gt; <br/>\n&gt; How long has your guy been out of school? It took Ray over a year to decompress from his time in school, and he spent most of that, it seemed, on the computer.<br/>\n&gt; <br/>\n&gt; ---Meredith (Mo 8, Ray 16)<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] 13yr old Boy","postDate":"1280798090","msgId":56594,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyRDQ2Mzg1LUYxMkItNEQwMy1CRkZBLTBBOTZCNDhEMTIxOEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDExMDA3NC42NDY3My5xbUB3ZWIxMTA0MDQubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PGkzNWprZitjMm5zQGVHcm91cHMuY29tPiA8MTEwMDc0LjY0NjczLnFtQHdlYjExMDQwNC5tYWlsLmdxMS55YWhvby5jb20+"},"prevInTopic":56593,"nextInTopic":56598,"prevInTime":56593,"nextInTime":56595,"topicId":56572,"numMessagesInTopic":0,"msgSnippet":"-=-***He fights with his younger brothers and won t let them use the computer or be in the room with him. He teases his 6 year old brother when they are around","messageBody":"<div id=\"ygrps-yiv-1674782408\">-=-***He fights with his<br/>\nyounger brothers and won&#39;t let them use the computer or be in the room<br/>\nwith him. He teases his 6 year old brother when they are around each<br/>\nother and this results in physical/verbal fights between them. ***<br/>\n<br/>\n-=-Then by all means, don&#39;t force them to spend time together and keep  <br/>\nthe younger<br/>\nkids out of his space and help them respect his privacy! If you are  <br/>\nhelping the<br/>\nyounger kids do that, stay away and out of his space, when he does  <br/>\nspend time<br/>\nwith the family, he won&#39;t be so testy to his siblings because they  <br/>\nhaven&#39;t been<br/>\nannoying him. Even if you don&#39;t think his siblings are annoying him, HE<br/>\nprobably feels that they are, so don&#39;t let it happen.-=-<br/>\n<br/>\n<br/>\nKirby was mean to Marty and wanted him to leave him alone with Kirby  <br/>\nwas 13 and Marty was 10 and 11.<br/>\n<br/>\nA few days ago Marty drove from Albuquerque to Austin (a long way) to  <br/>\nsurprise Kirby for his birthday.   They had a really good time together.<br/>\n<br/>\nThey didn&#39;t have to wait 11 years for that, though. By the time Marty  <br/>\nwas 13 and Kirby was 15/16, Kirby was usually inviting Marty to go  <br/>\nalong with him when he went gaming or for a party, and when Kirby  <br/>\nmoved, Marty was already a solid part of the same social groups, and  <br/>\ninherited all the friends. :-)<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: 13yr old Boy","postDate":"1280795577","msgId":56593,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEMxMDNEMDFDLTk4MEYtNDdGOC04QUYwLUVBODMyQjlDMzM5REBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGkzNmZxbitrc2FmQGVHcm91cHMuY29tPg==","referencesHeader":"PGkzNmZxbitrc2FmQGVHcm91cHMuY29tPg=="},"prevInTopic":56591,"nextInTopic":56594,"prevInTime":56592,"nextInTime":56594,"topicId":56572,"numMessagesInTopic":0,"msgSnippet":"-=-Some teens go through a period where they need a looooot of time alone. When Ray was 13, he was mostly nocturnal and played Runescape for hours and hours a","messageBody":"<div id=\"ygrps-yiv-1860264175\">-=-Some teens go through a period where they need a looooot of time  <br/>\nalone. When Ray was 13, he was mostly nocturnal and played Runescape  <br/>\nfor hours and hours a night.-=-<br/>\n<br/>\nKirby did too, and he hadn&#39;t been to school.  I think it&#39;s normal, and  <br/>\na great luxury to let them figure out what is normal.<br/>\n<br/>\nI think traditionally b0ys that age were put out to watch sheep or  <br/>\nguard something, because they weren&#39;t sleeping so much at night anyway.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":180190530,"authorName":"casa_divina","from":"&quot;casa_divina&quot; &lt;casa_divina@...&gt;","profile":"casa_divina","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: 13yr old Boy","postDate":"1280785034","msgId":56591,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkzN2RxYStwMGFnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDExMDA3NC42NDY3My5xbUB3ZWIxMTA0MDQubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":56588,"nextInTopic":56593,"prevInTime":56590,"nextInTime":56592,"topicId":56572,"numMessagesInTopic":0,"msgSnippet":"When he gets home, ... My daughter is 6 and has just about the same schedule as your son. Except she watches TV, not so much computer time as she doesn t read","messageBody":"<div id=\"ygrps-yiv-761209681\">When he gets home, <br/>\n<blockquote><span title=\"ireply\"> &gt; let him return to his comfortable place, wherever that is when he gets home. <br/>\n&gt;  Don&#39;t assume what he&#39;ll do.  Be his partner in helping him be comfortable and <br/>\n&gt; happy in whatever it is he wants to do!<br/>\n&gt;  <br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>My daughter is 6 and has just about the same schedule as your son. Except she watches TV, not so much computer time as she doesn&#39;t read much yet. <br/>\n<br/>\nToday, after a few days at home watching her favorite programs (Ben 10, Battle Force 5, Pucca and more) with no more than a few short breaks to eat and sleep, she left with her dad to go to a sports class for a few hours. When she gets home she will find a new mattress, new blankets and a clean table next to her bed with all of her favorite items: sharpened pencils for drawing while she watches, organized and stacked notebooks, remote control and a glass of water. She will be so happy to get back into bed! And I am so happy I can give that to her. I can&#39;t wait to snuggle with her in her new bed tonight and watch more Ben 10!<br/>\n<br/>\nFind something you can do for your son while he&#39;s gone that will make him happy to be home!<br/>\n<br/>\nMolly in Ecuador<br/>\nDivina 6<br/>\nSabina 5</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] 13yr old Boy","postDate":"1280782294","msgId":56588,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEZFOTQzREVCLUUyMkQtNEZFMy04QjU1LTc5OTEwMjNERkVDQUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGkzNWprZitjMm5zQGVHcm91cHMuY29tPg==","referencesHeader":"PGkzNWprZitjMm5zQGVHcm91cHMuY29tPg=="},"prevInTopic":56584,"nextInTopic":56591,"prevInTime":56587,"nextInTime":56589,"topicId":56572,"numMessagesInTopic":0,"msgSnippet":"-=-He is at BoyScout Camp this week - yeah! But as soon as he gets home, he will be on the computer and up all night again. Should I be concerned?-=- I m a","messageBody":"<div id=\"ygrps-yiv-1892974310\">-=-He is at BoyScout Camp this week - yeah!<br/>\nBut as soon as he gets home, he will be on the computer and up all night<br/>\nagain. Should I be concerned?-=-<br/>\n<br/>\nI&#39;m a little concerned that you consider boy scout camp to be vastly  <br/>\nsuperior to his being safe at home.<br/>\n<br/>\nHe&#39;s 13.  How long has he been unschooled?<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] 13yr old Boy","postDate":"1280775953","msgId":56584,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDExMDA3NC42NDY3My5xbUB3ZWIxMTA0MDQubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PGkzNWprZitjMm5zQGVHcm91cHMuY29tPg==","referencesHeader":"PGkzNWprZitjMm5zQGVHcm91cHMuY29tPg=="},"prevInTopic":56577,"nextInTopic":56588,"prevInTime":56583,"nextInTime":56585,"topicId":56572,"numMessagesInTopic":0,"msgSnippet":"***My 13 year old stays up all night (4-5AM) playing online games - Wizard101, Halo or watching TV. He gets up around 2PM and goes down to the Computer","messageBody":"<div id=\"ygrps-yiv-1970713875\">***My 13 year old stays up all night (4-5AM)<br/>\nplaying online games - Wizard101, Halo or watching TV. He gets up<br/>\naround 2PM and goes down to the Computer immediately.***<br/>\n<br/>\nOh, I remember that schedule!  When Chamille was 12, 13, and 14, she kept those <br/>\nhours and was very connected to her computer.<br/>\n<br/>\n***He doesn&#39;t want to do anything with<br/>\nthe family. I talk to him after everyone is in bed. He likes what he is<br/>\ndoing......I take any opportunity to be with him (reading to him so he<br/>\ncan fall asleep earlier, fixing him meals). I always ask him if he<br/>\nneeds food, fun, friends etc and he says no.***<br/>\n<br/>\nHis family isn&#39;t meeting his needs right now.  Does he like you to come in and <br/>\ntalk to him?  Does he like you to try to get him to fall asleep earlier?  Stop <br/>\nassuming that he needs something other than what he&#39;s seeking.  He has friends <br/>\nonline, in Halo.  He&#39;s having fun doing that.  Fix him food and be kind, help <br/>\nhim make his nest comfortable.<br/>\n<br/>\n***He fights with his<br/>\nyounger brothers and won&#39;t let them use the computer or be in the room<br/>\nwith him. He teases his 6 year old brother when they are around each<br/>\nother and this results in physical/verbal fights between them. ***<br/>\n<br/>\nThen by all means, don&#39;t force them to spend time together and keep the younger <br/>\nkids out of his space and help them respect his privacy!  If you are helping the <br/>\nyounger kids do that, stay away and out of his space, when he does spend time <br/>\nwith the family, he won&#39;t be so testy to his siblings because they haven&#39;t been <br/>\nannoying him.  Even if you don&#39;t think his siblings are annoying him, HE <br/>\nprobably feels that they are, so don&#39;t let it happen.<br/>\n<br/>\n***I ask<br/>\nhim if he is okay/lonely etc and he says he is fine.***<br/>\n<br/>\nQuit asking him this!  Let him tell you if he feels those things.  It seems if <br/>\nyou&#39;ve asked repeatedly and the answer is always the same, then you should STOP <br/>\nasking him.  He will feel as if you are trying to change him when he doesn&#39;t <br/>\nfeel that way at all.  It cuts of lines of communication if you are always <br/>\npresenting yourself to him in this way.  When you go in late at night, bring him <br/>\nfood and ask him about his games, but only if he seems receptive.<br/>\n<br/>\n***He is pale because he doesn&#39;t<br/>\nspend a lot of time outside. He is at BoyScout Camp this week - yeah! ***<br/>\n<br/>\nYou have a very clear bias against him being indoors and up all night.  I hope <br/>\nhe&#39;s enjoying his camp!  There is nothing wrong with being pale, less chance of <br/>\nskin cancer.  Make sure he&#39;s getting some vitamin D to offset his lack of sun!<br/>\n<br/>\n***I am assuming he<br/>\nis now a teenager and this is normal?***<br/>\n<br/>\n***But as soon as he gets home, he will be on the computer and up all night<br/>\nagain. Should I be concerned?***<br/>\n<br/>\nIf he&#39;s 13, then you don&#39;t have to assume, he IS a teenager.  When he gets home, <br/>\nlet him return to his comfortable place, wherever that is when he gets home. <br/>\n Don&#39;t assume what he&#39;ll do.  Be his partner in helping him be comfortable and <br/>\nhappy in whatever it is he wants to do!<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: 13yr old Boy","postDate":"1280754327","msgId":56577,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkzNmZxbitrc2FmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGkzNWprZitjMm5zQGVHcm91cHMuY29tPg=="},"prevInTopic":56572,"nextInTopic":56584,"prevInTime":56576,"nextInTime":56578,"topicId":56572,"numMessagesInTopic":0,"msgSnippet":"Some teens go through a period where they need a looooot of time alone. When Ray was 13, he was mostly nocturnal and played Runescape for hours and hours a","messageBody":"<div id=\"ygrps-yiv-873690619\">Some teens go through a period where they need a looooot of time alone. When Ray was 13, he was mostly nocturnal and played Runescape for hours and hours a night. He didn&#39;t want to be around younger kids and kept up the friendships he could online.  Your guy has some regular social outtings, it seems like - he may not need more than that right now.  <br/>\n<br/>\nHow long has your guy been out of school? It took Ray over a year to decompress from his time in school, and he spent most of that, it seemed, on the computer.<br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":238176887,"authorName":"mummichellec","from":"&quot;mummichellec&quot; &lt;justinmichellec@...&gt;","profile":"mummichellec","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"13yr old Boy","postDate":"1280725455","msgId":56572,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkzNWprZitjMm5zQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":56577,"prevInTime":56571,"nextInTime":56573,"topicId":56572,"numMessagesInTopic":0,"msgSnippet":"I have 3 boys, 6, 10 and 13.  My 13 year old stays up all night (4-5AM) playing online games - Wizard101, Halo or watching TV.  He gets up around 2PM and  goes","messageBody":"<div id=\"ygrps-yiv-191550327\">I have 3 boys, 6, 10 and 13.  My 13 year old stays up all night (4-5AM)<br/>\nplaying online games - Wizard101, Halo or watching TV.  He gets up<br/>\naround 2PM and  goes down to the Computer immediately.  He won&#39;t come<br/>\nout of his &#39;cave&#39; for anything but a meal, Soccer game twice a week or a<br/>\nBoyscout event  -camping/canoeing.  He doesn&#39;t want to do anything with<br/>\nthe family. I talk to him after everyone is in bed.  He likes what he is<br/>\ndoing......I take any opportunity to be with him (reading to him so he<br/>\ncan fall asleep earlier, fixing him meals).  I always ask him if he<br/>\nneeds food, fun, friends etc and he says no.   He fights with his<br/>\nyounger brothers and won&#39;t let them use the computer or be in the room<br/>\nwith him.  He teases his 6 year old brother when they are around each<br/>\nother and this results in physical/verbal fights between them.  I ask<br/>\nhim if he is okay/lonely etc and he says he is fine.  I am assuming he<br/>\nis now a teenager and this is normal?  He is pale because he doesn&#39;t<br/>\nspend a lot of time outside.  He is at BoyScout Camp this week - yeah! <br/>\nBut as soon as he gets home, he will be on the computer and up all night<br/>\nagain.  Should I be concerned?<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":56741,"nextTopicId":56597}}