{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"How unschooling and life can be better","postDate":"1313340780","msgId":62367,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENEM0FEODczLTE3MTktNDhEMy04ODNELURBMEZCNkRENEVCN0BTYW5kcmFEb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":62366,"nextInTime":62368,"topicId":62367,"numMessagesInTopic":0,"msgSnippet":"This is about how unschooling and life can be better, and how this list can be used to help facilitate better. No one is required to post to this list, ever.","messageBody":"<div id=\"ygrps-yiv-664032115\">This is about how unschooling and life can be better, and how this list can be used to help facilitate &quot;better.&quot;<br/>\n<br/>\nNo one is required to post to this list, ever.  All posts are voluntary.  If anyone posts without having read, considered and believed the advice about posting, and then if that person&#39;s feelings are hurt, I think it is likely to be because the person posted without have read the advice on the front page and the links for new members, and the guidelines for posting (which are also e-mailed to each new member), or they didn&#39;t consider them at all, or they thought &quot;Right.  Doesn&#39;t apply to me.&quot;<br/>\n<br/>\nThe list exists for the discussion of what makes natural learning work well, and what kind of family life and relationships will help or hinder.  It doesn&#39;t exist for any other reasons, honestly.  That&#39;s not a trick; that&#39;s the simple, plain situation.<br/>\n<br/>\nSometimes a reader&#39;s personal understanding takes a leap from something she herself wrote (writing can be clarifying) or from something positive and inspiring she read.  Sometimes a reader&#39;s personal understanding takes a giant sproing from reading something negative and defensive, and thinking about what, why, how, why not, who would!?, oh no, not here, used to and glad we don&#39;t anymore.<br/>\n<br/>\nThose are forms of natural learning, too.  What ideas hold up?  Which are control, painted otherwise?  Which are mainstream, clung to?  Which might be really useful to that person in that imperfect situation, but not good advice for unschoolers in general?<br/>\n<br/>\nFor anyone with any interest in the topic of the existence of this list and its best uses and purpose, read on a bit.  <br/>\nIF what&#39;s above sounded foreign at all, though, review here:  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/AlwaysLearning/\">http://groups.yahoo.com/group/AlwaysLearning/</a><br/>\n<br/>\nEach week a dozen or more new members join.  I&#39;m sharing this for their benefit, mostly.  I got an apology on the side, but I think it should be shared for a couple of reasons. Others had responded to related posts, too.  This could have been from any of dozens of list members frustrated by responses here over the past year, so it doesn&#39;t matter (for the purposes of list discussions) who wrote it.<br/>\n----------------------------------------<br/>\n<br/>\n-=- I am sorry I let my ego muck up your list -- I know it&#39;s a lot of work...-=-<br/>\n<br/>\nElipses were in the original; I didn&#39;t leave anything out.  <br/>\nWhen a person&#39;s ego causes defensiveness, it doesn&#39;t muck up the list.  It creates an opportunity for readers who don&#39;t post much to guess what the regular posters might say.  That&#39;s valuable.  When my daughter was young, she said family sitcoms were like educational programs for parents, who could guess what the characters were going to do, and think of what they would have done better.  She had been watching a lot of Mr. Rogers and Sesame Street, where there was a moment given for the viewer to think of what was going to happen next, and why, and what might have been better.  She saw that opportunity in shows about parents of children.<br/>\n<br/>\nThe list doesn&#39;t exist to create defensive situations, though.  The warning is in bright green words on the main page.  When someone&#39;s ego leads to a tussle, that ends up being a learning situation for those who consider the ideas as they unfold and are shuffled and spotlighted.  (Ideally it&#39;s a learning situation for the person who got defensive, too; if not right now, sometimes later one the ideas come back to them.)<br/>\n<br/>\n-=-All the points that were brought up do help to put unschooling as a lifestyle choice in a perspective that readers may not have considered...my response to replies was prompted because so many people made assumptions that were not true.-=-<br/>\n<br/>\nThe first part is the purpose of the list.  The second part is a problem.  Once a topic is put out for discussion, the original poster can&#39;t control the responses or assumptions or discussion, and shouldn&#39;t really try to.  Joyce, a moderator and longtime poster known personally to many on the list,  wrote very elegantly of this a few years ago:<br/>\n<br/>\n-----------------------------------------------<br/>\nThe list is about ideas, not about people.<br/>\nThink of ideas like balls and the list like a ball court. If someone tosses an idea worth discussing into the court it&#39;s going to get batted about. At that point what&#39;s going on is no longer about the person who tossed the idea in. It&#39;s about the idea and how well and cleanly it&#39;s being tossed about. (Unless the tosser keeps jumping in and grabbing the idea ball saying &quot;Mine!&quot;)<br/>\n<br/>\nJoyce<br/>\n-----------------------------------------------<br/>\n<br/>\nThat is on a page linked from the main page of the discussion.<br/>\n<br/>\nThe last paragraph of the side mail:<br/>\n<br/>\n-=-Instead of looking at it from a &quot;how can we learn from this?&quot; point of view, I took it personally.  I found it odd that so many replies included such assumptions...    I wondered why -- maybe people were just trying to make a point about how my influences, subtle or not, were not in-sync with radical unschooling, and if there were responses to that end I would have been more open to hearing and accepting it.  Instead, I went on the defensive trying to clarify false assumptions and felt the need to set the record straight (for no one&#39;s benefit but my own...and for that I am sorry.)  I shouldn&#39;t have taken it so personally and should have accepted it for what it was -- other people&#39;s assumptions about me that are not based in reality, which usually doesn&#39;t bother me, but in this case it did.-=-<br/>\n<br/>\nThose ellipses are mine (after assumptions); I delete one minor phrase to let it be more anonymous.   The middle part &quot;I found it odd&quot; and &quot;maybe people were just trying to make a point...&quot; is evidence of not having read, considered or understood the list&#39;s purpose and descriptions.   <br/>\n<br/>\nNo one is &quot;just trying to make a point&quot; about whether things are in sync with radical unschooling.<br/>\nNot &quot;just.&quot;  <br/>\nEveryone who posts should be directly making that point.  Straight on making that point honestly, sincerely and clearly (and then proofreading it).  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/lists/alwayslearningPOSTS\">http://sandradodd.com/lists/alwayslearningPOSTS</a><br/>\n<br/>\nThen the apology breaks down, because the list is blamed twice.  <br/>\n<br/>\n-=- and if there were responses to that end I would have been more open to hearing and accepting it.-=-<br/>\n<br/>\nEvery response was to that end.  It&#39;s not an &quot;if.&quot;<br/>\n<br/>\nThe apology for overreacting and taking things personally is fine, but the defense that people were making assumptions about things not based in reality is not.  They weren&#39;t assumptions abut the individual person, but responses to what had been written and posted.  Each phrase posted here IS reality.  It shows up in mailboxes and can be read on the site.  We don&#39;t know what the writer looks like or whether there&#39;s a dog at the house, or they&#39;re in a city or live rurally, and that doesn&#39;t matter, especially on first reading (and never, if the situation doesn&#39;t involve geography or pets).   What matters is what the poster wrote and decided to put out for discussion.<br/>\n<br/>\nThe list wasn&#39;t mucked up at all.  It is a lot of work, but I would rather write for a group than to have one-on-one e-mail with individual list members, so this is the response to an e-mail, sent here to benefit the list and future discussions and understandings.  The more people who are clear about the purpose of the list, the better the discussions will work.<br/>\n<br/>\nAnd more than all that, the list exists so that children&#39;s lives can be better, more than that mothers can feel better about clinging to what might not make their children&#39;s lives better.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":62314,"nextTopicId":62328}}