{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":14,"messages":[{"userId":276080282,"authorName":"delphini004","from":"&quot;delphini004&quot; &lt;delphini004@...&gt;","profile":"delphini004","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Accountablility, responsibility (to relatives)","postDate":"1318105136","msgId":63349,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo2cWI3Zys5N2xmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQ4RDM0QkY2LTQ5ODMtNEE5Ni04RTI0LUJFQTU0ODFEQUIyNUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":63341,"nextInTopic":0,"prevInTime":63348,"nextInTime":63350,"topicId":63281,"numMessagesInTopic":0,"msgSnippet":"When I suggested here that this quote would be a good post on Just Add Light and Stir, I was thinking about me, in the past years. It was about answering","messageBody":"<div id=\"ygrps-yiv-1313470170\">When I suggested here that this quote would be a good post on Just Add Light and Stir, I was thinking about me, in the past years. It was about answering relatives, yes, but also with anyone, anywhere. Probably due to my school and family education with a father who had an occupation related to the law (and who liked to give orders), I realized, quite young, and I continued to * believe * then that I had to give a *good* answer immediately to any question addressed to me, no matter where and no matter by whom, sometimes even people I barely knew. As if I was a soldier ask by a sergeant, or something like that... <br/>\n<br/>\nOnly when I became a mother, when we removed our son from school, and over the years, I gradually felt that maybe I should not be accountable to everyone all the time. Sandra wrote a very good and inspiring text called &quot;The School in my head.&quot; This text touched me deeply because I have a school in my head - especially filled with numbers, as I am often told by my son -  but I also have the laws and obligations between the lines of my life, which was extremely difficult to undo. <br/>\n<br/>\nI will take a look at my writings soon, to see if I can find something that can add a bit for this page that Sandra wants so kindly to publish on her website. <br/>\n<br/>\nAnd I thank you all here for these valuable suggestions you make.<br/>\n<br/>\nEdith<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; In the &quot;writing&quot; topic/thread, Edith wrote:<br/>\n&gt; <br/>\n&gt; -=-That would be a good post for Just Add Light and Stir; I would have like someone to tell me that long ago. I always feel kind of forced to answer to everyone who asks questions, as if I was accountable for what I do and how I do it. -=-<br/>\n&gt; <br/>\n&gt; The quote she&#39;s referring to is <br/>\n&gt; <br/>\n&gt; ***** -- You don&#39;t have to explain yourself to everyone. You can say, &quot;I know it&#39;s hard to understand, sorry.&quot;<br/>\n&gt; You could say &quot;If you want to read more about it, I can give you some links.&quot;-- *****<br/>\n&gt; <br/>\n&gt; While I&#39;m willing to share that on that blog ( <a rel=\"nofollow\" target=\"_blank\" href=\"http://justaddlightandstir.blogspot.com\">http://justaddlightandstir.blogspot.com</a>  ) I was hoping people here could think of other places or existing writings where that&#39;s already discussed.  I would need something to link it to.<br/>\n&gt; <br/>\n&gt; It&#39;s harsh to recommend someone say to his own mother &quot;It&#39;s none of your business,&quot; but I talked recently with a fully competent grown man, father of more than one child, bright and whole, who was afraid of his parents.   There have been people on this list who are afraid of their mothers.<br/>\n&gt; <br/>\n&gt; So I&#39;d like to talk about that a bit because I have a swirl of ideas in my head that aren&#39;t coalescing into one solid thing.<br/>\n&gt; <br/>\n&gt; There are some pages on my site about what to say to relatives, but they&#39;re not particularly well organized.  I&#39;ve been thinking of making a pamphlet or booklet addressed to grandparents of unschooled children, and was thinking about that earlier today as I loaded the dishwasher. :-)  <br/>\n&gt; <br/>\n&gt; There are factors:  <br/>\n&gt; Living quarters (being in the house with grandparents DOES give them rights to know what&#39;s going on; renting from them in a separate house?  Not as much)<br/>\n&gt; Money/financial assistance/inheritance  (is unschooling worth losing $10,000?  $1,000,000?)<br/>\n&gt; Loss of visitation?<br/>\n&gt; Loss of affection?<br/>\n&gt; Ruination of family reunions?<br/>\n&gt; <br/>\n&gt; Religion.  There are religions obligations and principles to consider sometimes.<br/>\n&gt; <br/>\n&gt; Let&#39;s have it, then.  Don&#39;t write anything you don&#39;t want to share.  Don&#39;t write things you don&#39;t want &quot;out there.&quot;  If people want to send me things directly to be put here anonymously, proofread them for names before you send them.  Make it anonymous and I can pass it on anonymously, if necessary.<br/>\n&gt; <br/>\n&gt; WHAT WILL HELP?<br/>\n&gt; What confidence or courage do some people need to stand up to older relatives?<br/>\n&gt; Would a list of possible responses help?  A &quot;kit&quot; of sorts?  But isn&#39;t that creepy, to script &quot;comebacks&quot; to insults?<br/>\n&gt; <br/>\n&gt; I don&#39;t know those answers, but am willing to help sort through data and a brainstormed dump.<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Accountablility, responsibility (to relatives)","postDate":"1317994948","msgId":63341,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIyMTZFRTNGLTFGQ0EtNEMwQy04QzdGLTEyNzFFQzdEQkMxREBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEUwMjRFNDIwQjM5QzQwRkY4MzlFQzZGNzc2RDM0RTQ5QFRhbWFyYT4=","referencesHeader":"PGo2azhlcSsxYmtiQGVHcm91cHMuY29tPiA8RTAyNEU0MjBCMzlDNDBGRjgzOUVDNkY3NzZEMzRFNDlAVGFtYXJhPg=="},"prevInTopic":63338,"nextInTopic":63349,"prevInTime":63340,"nextInTime":63342,"topicId":63281,"numMessagesInTopic":0,"msgSnippet":"-=-I d probably tell her that you don t focus into seperating learning out into subjects, but instead focus on integrated learning . When I was studying ","messageBody":"<div id=\"ygrps-yiv-422804669\">-=-I&#39;d probably tell her that you don&#39;t focus into seperating learning out into <br/>\nsubjects, but instead focus on &#39;integrated learning&#39;. When I was studying <br/>\neducation (10 odd years ago now), integrating the curriculum was a big deal, <br/>\nand there was lots of focus on how to do it. We get to do it naturally! <br/>\nBut the integrated learning should help her to understand what you are doing <br/>\na little better.-=-<br/>\n<br/>\nGood idea.  Individualized, integrated learning. :-)<br/>\n<br/>\nYou might consider asking her to write down her concerns and say then you can think about them and address them in writing, later, when you have more particular examples to share with her.<br/>\n<br/>\nThere are several articles by Deb Lewis new on my site, and some of them might give you ideas, too (linked below)<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\nAll new pages, all Deb Lewis!<br/>\n<br/>\n<br/>\nAnd if you like these ideas, please consider coming to the ALL Unschooling Symposium December 29-31, where Deb will speak about unschooling for the first time.  <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/all\">http://sandradodd.com/all</a><br/>\n<br/>\nHow a Monster and a Dead Guy Named Howard Led a Boy to a World of Connections, by Deb Lewis<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/deblewis/monster\">http://sandradodd.com/deblewis/monster</a><br/>\n<br/>\nSympathetic, Empathetic, or Simply Pathetic?<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/deblewis/sympathetic\">http://sandradodd.com/deblewis/sympathetic</a><br/>\n<br/>\nCultural Ideas and Change<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/deblewis/culturalideas\">http://sandradodd.com/deblewis/culturalideas</a><br/>\nHow accepted truths (memes) make unschooling difficult to see and believe.<br/>\n<br/>\nThe Evidence of Years: hindsight, milestones, and big differences<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/deblewis/years\">http://sandradodd.com/deblewis/years</a><br/>\n<br/>\nUnschooler&#39;s Pipe Wrench<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/deblewis/humor\">http://sandradodd.com/deblewis/humor</a><br/>\n&quot;We understand we don&#39;t always have a choice about what life brings us, but we always have a choice about how we face it. And we face it wearing big red clown noses.&quot;<br/>\n<br/>\nNot Even Close to All For McNaught<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/deblewis/notevenclose\">http://sandradodd.com/deblewis/notevenclose</a><br/>\n<br/>\nConfessions of a Lawbreaker: &quot;My son Dylan has been voting for years. According to the Twenty sixth Amendment he doesn&#39;t have the right to vote until he&#39;s eighteen years old, but we amended that amendment, at least in our own minds....&quot;<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/deblewis/confessions\">http://sandradodd.com/deblewis/confessions</a></div>","specialLinks":[]},{"userId":333388203,"authorName":"Rinelle","from":"&quot;Rinelle&quot; &lt;rinelle@...&gt;","profile":"rinelle2011","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Accountablility, responsibility (to relatives)","postDate":"1317965101","msgId":63338,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEUwMjRFNDIwQjM5QzQwRkY4MzlFQzZGNzc2RDM0RTQ5QFRhbWFyYT4=","inReplyToHeader":"PGo2azhlcSsxYmtiQGVHcm91cHMuY29tPg==","referencesHeader":"PGo2azhlcSsxYmtiQGVHcm91cHMuY29tPg=="},"prevInTopic":63334,"nextInTopic":63341,"prevInTime":63337,"nextInTime":63339,"topicId":63281,"numMessagesInTopic":0,"msgSnippet":"... I d probably tell her that you don t focus into seperating learning out into subjects, but instead focus on integrated learning .  When I was studying ","messageBody":"<div id=\"ygrps-yiv-1616380359\"><blockquote><span title=\"ireply\">&gt; So my mother in law asks how homeschooling is going, we say it is going <br/>\n&gt; great and we are enjoying it, and then she<br/>\n&gt; asks what subjects he is learning about. It seems odd to jump right into <br/>\n&gt; saying it is hard to understand. Should I just<br/>\n&gt; ignore the use of &quot;subjects&quot; and talk about the many things we are <br/>\n&gt; learning? Or should I say something like, &quot;Well, it<br/>\n&gt; doesn&#39;t really work that way for us. We are learning about all sorts of <br/>\n&gt; things [and give some examples] but right now<br/>\n&gt; we don&#39;t focus on subjects,&quot; and then if she continues to ask I could say <br/>\n&gt; it is hard to understand?<br/>\n<br/>\n </span></blockquote>I&#39;d probably tell her that you don&#39;t focus into seperating learning out into <br/>\nsubjects, but instead focus on &#39;integrated learning&#39;.  When I was studying <br/>\neducation (10 odd years ago now), integrating the curriculum was a big deal, <br/>\nand there was lots of focus on how to do it.  We get to do it naturally! <br/>\nBut the integrated learning should help her to understand what you are doing <br/>\na little better.<br/>\n<br/>\nTamara</div>","specialLinks":[]},{"userId":323183227,"authorName":"Stephanie Tang","from":"Stephanie Tang &lt;lily47848@...&gt;","profile":"lily47848","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Accountablility, responsibility (to relatives)","postDate":"1317924121","msgId":63334,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkzMTZCOUVELUU3NTQtNDJFOS1BNzcyLUQwMzc2NzIwM0QzMUB5YWhvby5jb20+"},"prevInTopic":63333,"nextInTopic":63338,"prevInTime":63333,"nextInTime":63335,"topicId":63281,"numMessagesInTopic":0,"msgSnippet":"My inlaws came for a week after three years of phone calls with my husband and random emails between me and my mother inlaw. They live in Malaysia.  My husband","messageBody":"<div id=\"ygrps-yiv-106616077\">My inlaws came for a week after three years of phone calls with my husband and random emails between me and my mother inlaw. They live in Malaysia.  My husband was sent to the US for education by the universities here. They both are retired teachers, and my father inlaw was a headmaster/principal for his career.  <br/>\nA wave of excitement first came over me at the news of their visit. Then the worries started because they had indeed been presenting questions to my husband of what the educational (their words) future of the kids would be.  I had all these scenarios of what their questioning would be while here.  A few weeks before their arrival I wanted to be rid of these worries and it dawned on me this was part of my letting go (my words for the year).  These scenarios hadn&#39;t even happened yet though their questioning had happened on our previous gathering three years before and at that time it was our parenting style. These moments were not the present and I had to let them go because afterall unschooling is most about the moment. I knew at the moment I was confident in myself, husband, and children so why not maintain instead of over thinking or explaining.<br/>\nThey came and went with having a good time and some late night discussions which didn&#39;t even take any of the turns my false scenarios had planned.  I asked many questions of their lives instead.  I relaxed into the visit and just let our home speak for itself however that came across. I let go and stayed in the moment. <br/>\nAfter they returned to their country they made suggestions to help pay for the official schooling of the children if it was money as the issue. My husband gently explained again that we were choosing this route to home nuture the kids for now.  They asked for a syllabus. At first I was taken aback. I thought didn&#39;t they see all the natural learning I saw during their stay??  There was kite flying, gardening, bike riding, tree swinging, croquet playing, show watching, cooking, toasting, and eating while all enjoying.  I thought though a syllabus could be fun and funny since we don&#39;t live our lives in subjects but to break it down that way is amusing and showed me the fullness of our days.   I didn&#39;t plan much of it, but used what we had actually lived, and I knew would be usual for our season.  This is what I sent them email. <br/>\nWe follow the four seasons which outline our days and months. We follow and guide the children on their level of comprehension with all the below. Our objective above all is to enjoy each moment as a happy memory with stability, freedom, and unconditional love/support. We see each moment as a chance to learn and seek out information for better enjoyment and understanding of life.<br/>\nFall/Winter 2011<br/>\nScience, Health, and Art<br/>\nWe will explore the leaves changing and which local trees change what color and when.<br/>\nCraft leaf prints and rubbings, colleague labeling each leaf, coloring using seasonal colors, gathering field flowers for identifying.  Build bug hotel for their winter. Christmas tree family picking out event. Homemade decorations for the season yet to be decided. Talk of snow, weather, and experiments with snow. <br/>\n<br/>\nWe will purchase local seasonal fruit and veggies which could and will spark conversations of the season&#39;s blessings.  Along with preserving the summer season&#39;s blessings to enjoy throughout winter.  Our preparation for the colder months.  Filling our cold calendar days with play and growing with new household projects.  <br/>\nWe will play as hard as we can while the weather is cooling watching squirrels and other local creatures gather for winter hibernation.<br/>\nDiscussions of preparation for hibernation, migration, and death from the cooling weather will arise.  We talk of seeds flying in the wind and laying dormant through the winter.  <br/>\n<br/>\nMath, Reading, and Computers<br/>\nWe use many tangibles for math comprehension.  Also, the use of household measuring objects via baking and cooking.  We use moments around and throughout our day for finding math problems.<br/>\nSit down story reading happens daily and nightly.  We really do read all day rather it be a package, on the TV, or via gaming.  Zeppelin has recently learned the word OFF from using the stove. He is sounding out random words through the day.  Oliver notices letters, Sis likes looking at picture books. <br/>\nWe visit the library once every couple of weeks having a theme in mind of seasonal books, certain animals or creatures, and children&#39;s novel series for zeppelin. Michael makes up stories and I make up songs in the day on car rides during cooking, cleaning, playing, etc. <br/>\n<br/>\nPhysical education and health again<br/>\nAll three wash their hands well and independently or minimal guidance before and after meals, bathroom, and playing outside.  Sis is potty training on her own this week. We have been without her using diapers for this week. Yay!<br/>\nZeppelin can prepare his own snack if necessary and get drinks. Oliver helps himself to fruit and water.  We will move forward with meal preparation at age level. <br/>\nThey have been working towards learning to swim and appreciation of water. Zeppelin has taught himself this season with trips to the lake, pool, and creek.  Both underwater and above water swimming without floaty pads or life jacket. <br/>\nCurrently his interest has led him to chess and checkers.  Oliver is advancing on his understanding and levels in games. Sissy enjoys playing and loving on her baby dolls.<br/>\n<br/>\nWe will explore the holidays within the upcoming fall and winter months. Answering and bringing about questions of the season. <br/>\n<br/>\nThis is just a portion of our plans for the upcoming seasons and where the children are at in their lives. <br/>\n<br/>\nSent from my iPhone</div>","specialLinks":[]},{"userId":311108332,"authorName":"Eva","from":"&quot;Eva&quot; &lt;evawitsel@...&gt;","profile":"evawitsel","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Accountablility, responsibility (to relatives)","postDate":"1317922202","msgId":63333,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo2a29pcStxN21lQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGo2azhlcSsxYmtiQGVHcm91cHMuY29tPg=="},"prevInTopic":63332,"nextInTopic":63334,"prevInTime":63332,"nextInTime":63334,"topicId":63281,"numMessagesInTopic":0,"msgSnippet":"... I always have some examples of cool things my children learned recently. Most people really aren t that interested in *how* my children learned those","messageBody":"<div id=\"ygrps-yiv-1904967917\">--- Should I just ignore the use of &quot;subjects&quot; and talk about the many things we are learning?---<br/>\n<br/>\nI always have some examples of cool things my children learned recently. Most people really aren&#39;t that interested in *how* my children learned those things, so I don&#39;t explain it. <br/>\n<br/>\nWhen we first started homeschooling, I read some advice that Sandra wrote. It was something along the lines of &#39;At the moment they are happy, they are learning lots, we&#39;ll see how it goes. They can always go to school when it stops working&#39;. I always use that one, works really well to reassure worried family members/friends :-) Especially when combined with stories of the things we have been doing recently and examples of things they learned.<br/>\n<br/>\nMaybe you can ask your mother in law for some advice, does she know of anything really nice to introduce to your son that would be in line with his current interests. I find that most people are really pleased if you ask for their opinion and immediately start speaking instead of asking questions ;-)<br/>\nIf your mother in law is that way, that may help.<br/>\n<br/>\nEva<br/>\nBerend (6) & Fiene (4)<br/>\nFrom The Netherlands</div>","specialLinks":[]},{"userId":269767646,"authorName":"Kelly Hunt","from":"Kelly Hunt &lt;keh1973@...&gt;","profile":"kellyh_01","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Accountablility, responsibility (to relatives)","postDate":"1317919456","msgId":63332,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBRXVKQ3hkUzlhZjVVK2FlZGRRN2lDdF9ENE41X2NDX21XRzNxYi12UmZtZHpEVjFGQUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGo2azhlcSsxYmtiQGVHcm91cHMuY29tPg==","referencesHeader":"PEEwMzQ5OUJCLTYwQUYtNDI3Ni05NzNDLTFDN0MwRTU0RjZENEBTYW5kcmFkb2RkLmNvbT4JPGo2azhlcSsxYmtiQGVHcm91cHMuY29tPg=="},"prevInTopic":63330,"nextInTopic":63333,"prevInTime":63331,"nextInTime":63333,"topicId":63281,"numMessagesInTopic":0,"msgSnippet":"I m a first-time poster, so forgive me if this is out of line, but why can t you just give her an answer that is more mainstream and at her level of ","messageBody":"<div id=\"ygrps-yiv-214220210\">I&#39;m a first-time poster, so forgive me if this is out of line, but why can&#39;t<br/>\nyou just give her an answer that is more mainstream and at her level of<br/>\nunderstanding?  For example, last week my daughter caught some moths and we<br/>\nbaked a pie.  An answer for the mother in law could be, &quot;In science we are<br/>\nstudying insects and the life cycle of moths and butterflies.  And she&#39;s<br/>\nreally starting to understand fractions.&quot;  To me that gives a simple answer<br/>\nto their question without being evasive or untruthful.<br/>\n<br/>\nKelly<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Thu, Oct 6, 2011 at 5:54 AM, railyuh &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:railyuh@...\">railyuh@...</a>&gt; wrote:<br/>\n<br/>\n&gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; So my mother in law asks how homeschooling is going, we say it is going<br/>\n&gt; great and we are enjoying it, and then she asks what subjects he is learning<br/>\n&gt; about. It seems odd to jump right into saying it is hard to understand.<br/>\n&gt; Should I just ignore the use of &quot;subjects&quot; and talk about the many things we<br/>\n&gt; are learning? Or should I say something like, &quot;Well, it doesn&#39;t really work<br/>\n&gt; that way for us. We are learning about all sorts of things [and give some<br/>\n&gt; examples] but right now we don&#39;t focus on subjects,&quot; and then if she<br/>\n&gt; continues to ask I could say it is hard to understand?<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Accountablility, responsibility (to relatives)","postDate":"1317911449","msgId":63330,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY0MjI1MDMyLUIzMEYtNEYzNS1CQjI5LUZDOUM5MEQwODRGNUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGo2azhlcSsxYmtiQGVHcm91cHMuY29tPg==","referencesHeader":"PGo2azhlcSsxYmtiQGVHcm91cHMuY29tPg=="},"prevInTopic":63329,"nextInTopic":63332,"prevInTime":63329,"nextInTime":63331,"topicId":63281,"numMessagesInTopic":0,"msgSnippet":"... It will help to see from her viewpoint to figure out why she s asking the questions so you can craft answers that will help her get the answers *she*","messageBody":"<div id=\"ygrps-yiv-1281406068\">On Oct 6, 2011, at 8:54 AM, railyuh wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My mother in law and I already have a strained relationship so I  <br/>\n&gt; really don&#39;t want to make it worse, and I do think she&#39;ll feel like  <br/>\n&gt; I am being rude and dismissive if I don&#39;t attempt some kind of answer.<br/>\n<br/>\n </span></blockquote>It will help to see from her viewpoint to figure out why she&#39;s asking  <br/>\nthe questions so you can craft answers that will help her get the  <br/>\nanswers *she* wants. Don&#39;t try to give her the understanding you want  <br/>\nher to have (to be able to talk about it, or whatever your goals might  <br/>\nbe.)<br/>\n<br/>\nShe&#39;s worried. She cares about her grandkids. The more confidence you  <br/>\ncan project in your answers, the better. If you&#39;re hesitant, it will  <br/>\nmake her worry more ... and ask more questions.<br/>\n<br/>\nYou don&#39;t need to know all the answers to questions about how kids  <br/>\nlearn through unschooling, just be confident that what you&#39;re doing is  <br/>\nworking for now. And when it stops working, you&#39;ll try something else.<br/>\n<br/>\nAt some point you can enthusiastically say &quot;If you&#39;d like to discuss  <br/>\nit, I have several books you can read. But the wide open possibilities  <br/>\nof helping one child learn is so different from helping a whole room  <br/>\nfull of kids learn while confined to a classroom with one teacher,  <br/>\nthat it&#39;s hard to understand. They really aren&#39;t the same things so  <br/>\nit&#39;s hard to discuss in terms of what a classroom needs.&quot; And then  <br/>\ngive her a list of books.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":299670620,"authorName":"railyuh","from":"&quot;railyuh&quot; &lt;railyuh@...&gt;","profile":"railyuh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Accountablility, responsibility (to relatives)","postDate":"1317905690","msgId":63329,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo2azhlcSsxYmtiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEEwMzQ5OUJCLTYwQUYtNDI3Ni05NzNDLTFDN0MwRTU0RjZENEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":63321,"nextInTopic":63330,"prevInTime":63328,"nextInTime":63330,"topicId":63281,"numMessagesInTopic":0,"msgSnippet":"... What about what comes between the question and your response? So my mother in law asks how homeschooling is going, we say it is going great and we are","messageBody":"<div id=\"ygrps-yiv-1768778969\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; -=I guess what I am wondering is how can I answer questions about favorite subjects, curriculum, what subjects we study, what kind of work he has to show for it, etc. -=-<br/>\n&gt; <br/>\n&gt; I wouldn&#39;t do it.<br/>\n&gt; <br/>\n&gt; I would say it&#39;s hard to understand and you&#39;re still learning about it, and you&#39;ll let her know how it&#39;s going as time goes on.<br/>\n<br/>\n </span></blockquote>What about what comes between the question and your response? <br/>\n<br/>\nSo my mother in law asks how homeschooling is going, we say it is going great and we are enjoying it, and then she asks what subjects he is learning about. It seems odd to jump right into saying it is hard to understand. Should I just ignore the use of &quot;subjects&quot; and talk about the many things we are learning? Or should I say something like, &quot;Well, it doesn&#39;t really work that way for us. We are learning about all sorts of things [and give some examples] but right now we don&#39;t focus on subjects,&quot; and then if she continues to ask I could say it is hard to understand?<br/>\n<br/>\nOur parents aren&#39;t antagonistic about homeschooling, they just are hesitant and concerned because it is new to them, and jumping to saying it is hard to understand seems kind of dismissive of their concerns. My mother in law and I already have a strained relationship so I really don&#39;t want to make it worse, and I do think she&#39;ll feel like I am being rude and dismissive if I don&#39;t attempt some kind of answer. And maybe that is okay because honestly sometimes it doesn&#39;t matter what I say or do--she&#39;s going to think what she thinks. But I would like to try. I think what I want is to be able to share what we are doing and learning and not get into the whole philosophy behind it. So if she asks those kinds of questions directly, I&#39;m not sure if I should redirect and talk about what we do instead, or if I should address it briefly without an explanation (just state the fact, no, we don&#39;t use curriculum and then move on). <br/>\n<br/>\nI can definitely see how the response you suggested is something I could say at some point during a conversation with my mother in law, but I do feel hesitant about jumping to it right away.<br/>\n<br/>\n-Annie</div>","specialLinks":[]},{"userId":299670620,"authorName":"railyuh","from":"&quot;railyuh&quot; &lt;railyuh@...&gt;","profile":"railyuh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Accountablility, responsibility (to relatives)","postDate":"1317862798","msgId":63321,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo2aXVpZStpc2w1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEUyOUIyMDE4LUE2NDktNDhFQy05M0RFLTFGNEUyRjM0QzRFNkBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":63320,"nextInTopic":63329,"prevInTime":63320,"nextInTime":63322,"topicId":63281,"numMessagesInTopic":0,"msgSnippet":"... I m not sure why she isn t, but that just isn t my mother in law. She has been expressing concern over our son s speech for about a year.  I showed her","messageBody":"<div id=\"ygrps-yiv-438948202\"><blockquote><span title=\"ireply\">&gt; I doubt it - not if she was a preschool teacher before the last decade or so. Preschool teachers are really the cutting edge of understanding how children learn best - through developmentally appropriate activities and play!!<br/>\n&gt; <br/>\n&gt; Some terminology to use with her -- developmentally appropriate is a really important one.  You can also say you are &quot;delaying academics&quot; to allow them to build a foundation. You don&#39;t have to say that you&#39;re delaying academics for the next 13 years! &lt;g&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>I&#39;m not sure why she isn&#39;t, but that just isn&#39;t my mother in law. She has been expressing concern over our son&#39;s speech for about a year.  I showed her sources that showed it was normal for a 5 year old not to have mastered sounds like S and CH and it didn&#39;t make a difference to her. She still thinks we should get him speech therapy. That&#39;s just one example, but you would think after years of teaching preschool (and teaching special needs) she might be up on developmental milestones, but she isn&#39;t. She is also the type to quiz them on colors and shapes and letters, and she can&#39;t read him a book without sounding out every word like a phonics lesson. She&#39;s even tried teaching him how to do math problems, so I don&#39;t think she&#39;s got delayed academics on her radar. But after thinking about what you said, I do think it might be a good term to use when explaining our approach to her. Thanks :) <br/>\n<br/>\nMy inlaws definitely have this picture in their mind that we are going to get up early, get dressed (in nice clothes, khakis and polo shirts) and she was asking if I had a backpack for him yet. I find it sort of bizarre. I&#39;m not surprised that they expect school-at-home, but I do find it strange that they expect us to be that formal about it all. She even sent us the khakis and polo shirts a few weeks ago.<br/>\n<br/>\nI just requested The Hurried Child from my library, thanks for the suggestion!</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Accountablility, responsibility (to relatives)","postDate":"1317861033","msgId":63320,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEEwMzQ5OUJCLTYwQUYtNDI3Ni05NzNDLTFDN0MwRTU0RjZENEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGo2aTZwZCtjNjV1QGVHcm91cHMuY29tPg==","referencesHeader":"PGo2aTZwZCtjNjV1QGVHcm91cHMuY29tPg=="},"prevInTopic":63314,"nextInTopic":63321,"prevInTime":63319,"nextInTime":63321,"topicId":63281,"numMessagesInTopic":0,"msgSnippet":"-=I guess what I am wondering is how can I answer questions about favorite subjects, curriculum, what subjects we study, what kind of work he has to show for","messageBody":"<div id=\"ygrps-yiv-1947545229\">-=I guess what I am wondering is how can I answer questions about favorite subjects, curriculum, what subjects we study, what kind of work he has to show for it, etc. -=-<br/>\n<br/>\nI wouldn&#39;t do it.<br/>\n<br/>\nI would say it&#39;s hard to understand and you&#39;re still learning about it, and you&#39;ll let her know how it&#39;s going as time goes on.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Accountablility, responsibility (to relatives)","postDate":"1317855910","msgId":63314,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEUyOUIyMDE4LUE2NDktNDhFQy05M0RFLTFGNEUyRjM0QzRFNkBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGo2aTZwZCtjNjV1QGVHcm91cHMuY29tPg==","referencesHeader":"PGo2aTZwZCtjNjV1QGVHcm91cHMuY29tPg=="},"prevInTopic":63311,"nextInTopic":63320,"prevInTime":63313,"nextInTime":63315,"topicId":63281,"numMessagesInTopic":0,"msgSnippet":"On Oct 5, 2011, at 11:14 AM, railyuh wrote: ... ***** I doubt it - not if she was a preschool teacher before the last decade or so. Preschool teachers are","messageBody":"<div id=\"ygrps-yiv-659947667\"><blockquote><span title=\"qreply\">On Oct 5, 2011, at 11:14 AM, railyuh wrote:<br/>\n*******<br/>\n&gt; My mother in law was also a preschool teacher for many years so I think she&#39;d love to see work samples and that sort of thing <br/>\n*****<br/>\n<br/>\nI doubt it - not if she was a preschool teacher before the last decade or so. Preschool teachers are really the cutting edge of understanding how children learn best - through developmentally appropriate activities and play!!<br/>\n<br/>\nSome terminology to use with her -- developmentally appropriate is a really important one.  You can also say you are &quot;delaying academics&quot; to allow them to build a foundation. You don&#39;t have to say that you&#39;re delaying academics for the next 13 years! &lt;g&gt;<br/>\n<br/>\nMaybe mention David Elkind&#39;s book - The Hurried Child. Read it if you haven&#39;t - it will give you lots of insight and, really, early childhood people are generally on the same wavelength of not pushing.<br/>\n<br/>\n-pam<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":299670620,"authorName":"railyuh","from":"&quot;railyuh&quot; &lt;railyuh@...&gt;","profile":"railyuh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Accountablility, responsibility (to relatives)","postDate":"1317838445","msgId":63311,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo2aTZwZCtjNjV1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGo2ZDllNSs5cG9xQGVHcm91cHMuY29tPg=="},"prevInTopic":63283,"nextInTopic":63314,"prevInTime":63310,"nextInTime":63312,"topicId":63281,"numMessagesInTopic":0,"msgSnippet":"... I think scripts would be helpful for me, and not necessarily to repeat verbatim, but as a start to brainstorming responses. Unschooling is this big huge","messageBody":"<div id=\"ygrps-yiv-993699600\"><blockquote><span title=\"ireply\">&gt; I think scripts are incredibly helpful for some people.  I have never had a problem speaking my mind, but I have friends who will avoid conflict at all costs.  Having the words in mind to say when they know a certain situation will arise, gives them the courage to say &quot;No, I will not let you bully me about this issue.  Either drop it or I will hang up the phone.&quot;  And then the courage to do it if the person won&#39;t stop without feeling like they are being &quot;mean.&quot;  <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I think scripts would be helpful for me, and not necessarily to repeat verbatim, but as a start to brainstorming responses. Unschooling is this big huge life-changing mind-shifting thing that I find it really difficult to give a quick answer. I tend to babble anyway, so when this comes up with my inlaws it would be helpful to have a sound-bite answers for some common questions. <br/>\n<br/>\nI&#39;ve been thinking about this a lot because my inlaws will be here in a couple of weeks and I&#39;ll be alone with them the first day so I can&#39;t rely on my husband fielding the questions. It is also their first visit since we became &quot;official&quot; homeschoolers so I have a feeling there will be more questions about what exactly we are doing during our &quot;school days&quot;. My mother in law was also a preschool teacher for many years so I think she&#39;d love to see work samples and that sort of thing (which we don&#39;t really have aside from drawings, art projects, and random scraps of paper). I do blog and share a lot of photos about things we do, and I know she appreciates that but it still not the &quot;schoolwork&quot; she is expecting.<br/>\n<br/>\nI guess what I am wondering is how can I answer questions about favorite subjects, curriculum, what subjects we study, what kind of work he has to show for it, etc. without giving cursory answers like, &quot;He likes to read, we study the same subjects kids study in school, etc.&quot; I want to give more of an answer than that, but at the same time I don&#39;t expect them to understand our way of life right now.I could go on and on about all the many things we do and show them what a full life we live, and a few years down the road I am hopeful that those things will be enough of an answer for them. But at the same time I know right now they want to see a schoolish result or answer. I don&#39;t expect to fully satisfy them at all, but it would be nice to have some help translating our life into answers that might alleviate some of their concerns and help them to understand what we are doing a little bit better. <br/>\n<br/>\n-Annie</div>","specialLinks":[]},{"userId":457058835,"authorName":"emstrength3","from":"&quot;emstrength3&quot; &lt;emstrength@...&gt;","profile":"emstrength3","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Accountablility, responsibility (to relatives)","postDate":"1317677317","msgId":63283,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo2ZDllNSs5cG9xQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQ4RDM0QkY2LTQ5ODMtNEE5Ni04RTI0LUJFQTU0ODFEQUIyNUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":63281,"nextInTopic":63311,"prevInTime":63282,"nextInTime":63284,"topicId":63281,"numMessagesInTopic":0,"msgSnippet":"... People on another message board I m on have frequent discussions about boundaries in relation to this sort of thing.  One connotation of the word","messageBody":"<div id=\"ygrps-yiv-830491868\"><blockquote><span title=\"ireply\">&gt; WHAT WILL HELP?<br/>\n&gt; What confidence or courage do some people need to stand up to older relatives?<br/>\n&gt; Would a list of possible responses help?  A &quot;kit&quot; of sorts?  But isn&#39;t that creepy, to script &quot;comebacks&quot; to insults?<br/>\n&gt; <br/>\n&gt; I don&#39;t know those answers, but am willing to help sort through data and a brainstormed dump.<br/>\n&gt; <br/>\n<br/>\n<br/>\n </span></blockquote>People on another message board I&#39;m on have frequent discussions about boundaries in relation to this sort of thing.  One connotation of the word &quot;boundaries&quot; is of setting rules for kids, but that is not the way they use it.  There is a book called Boundaries where the authors use the word to mean putting a protective fence around yourself.  <br/>\n<br/>\nWith some people, people who are generally respectful of your space, time and feelings, your fence can be a single board with lots of space beneath it and above it and lots of gates.  That&#39;s the boundaries you have with that best friend who you let come over when your house is a mess and she helps herself in your kitchen, and that&#39;s ok because you know you can call her in the middle of the night for moral support because you baby won&#39;t stop crying.  That&#39;s also the person who you can tell &quot;I can&#39;t discuss that issue with you&quot; and they won&#39;t bring it up again and won&#39;t be offended, because she respects your boundaries.<br/>\n<br/>\nWith some people, your boundaries need to be a castle with a moat and a draw bridge pulled up.  Maybe that&#39;s an abusive and unrepentant parent who will continue to berate you and yell at you even though you are an adult.  Don&#39;t call them or let them know where you live or return the messages they pass on to your cousins.  They are toxic.<br/>\n<br/>\nAnd then there is everyone in between, and sometimes those boundaries are fluid with the person depending on the situation.  Set up a sturdy fence with a gate and let them through that gate as long as they are being respectful of you.  But when your mom, as normally loving and good with the kids as she may be, insists that it is her *right* to have the option to spank them when she babysits them, slam that gate shut and don&#39;t let her babysit.  Opening the gate for visits while you are present doesn&#39;t mean leaving it open to anything and everything she might think she has a right to do.  <br/>\n<br/>\nI think scripts are incredibly helpful for some people.  I have never had a problem speaking my mind, but I have friends who will avoid conflict at all costs.  Having the words in mind to say when they know a certain situation will arise, gives them the courage to say &quot;No, I will not let you bully me about this issue.  Either drop it or I will hang up the phone.&quot;  And then the courage to do it if the person won&#39;t stop without feeling like they are being &quot;mean.&quot;  <br/>\n<br/>\n<br/>\n<br/>\nEmily</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Accountablility, responsibility (to relatives)","postDate":"1317652741","msgId":63281,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ4RDM0QkY2LTQ5ODMtNEE5Ni04RTI0LUJFQTU0ODFEQUIyNUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":63283,"prevInTime":63280,"nextInTime":63282,"topicId":63281,"numMessagesInTopic":0,"msgSnippet":"In the writing topic/thread, Edith wrote: -=-That would be a good post for Just Add Light and Stir; I would have like someone to tell me that long ago. I","messageBody":"<div id=\"ygrps-yiv-1770036933\">In the &quot;writing&quot; topic/thread, Edith wrote:<br/>\n<br/>\n-=-That would be a good post for Just Add Light and Stir; I would have like someone to tell me that long ago. I always feel kind of forced to answer to everyone who asks questions, as if I was accountable for what I do and how I do it. -=-<br/>\n<br/>\nThe quote she&#39;s referring to is <br/>\n<br/>\n***** -- You don&#39;t have to explain yourself to everyone. You can say, &quot;I know it&#39;s hard to understand, sorry.&quot;<br/>\nYou could say &quot;If you want to read more about it, I can give you some links.&quot;-- *****<br/>\n<br/>\nWhile I&#39;m willing to share that on that blog ( <a rel=\"nofollow\" target=\"_blank\" href=\"http://justaddlightandstir.blogspot.com\">http://justaddlightandstir.blogspot.com</a>  ) I was hoping people here could think of other places or existing writings where that&#39;s already discussed.  I would need something to link it to.<br/>\n<br/>\nIt&#39;s harsh to recommend someone say to his own mother &quot;It&#39;s none of your business,&quot; but I talked recently with a fully competent grown man, father of more than one child, bright and whole, who was afraid of his parents.   There have been people on this list who are afraid of their mothers.<br/>\n<br/>\nSo I&#39;d like to talk about that a bit because I have a swirl of ideas in my head that aren&#39;t coalescing into one solid thing.<br/>\n<br/>\nThere are some pages on my site about what to say to relatives, but they&#39;re not particularly well organized.  I&#39;ve been thinking of making a pamphlet or booklet addressed to grandparents of unschooled children, and was thinking about that earlier today as I loaded the dishwasher. :-)  <br/>\n<br/>\nThere are factors:  <br/>\nLiving quarters (being in the house with grandparents DOES give them rights to know what&#39;s going on; renting from them in a separate house?  Not as much)<br/>\nMoney/financial assistance/inheritance  (is unschooling worth losing $10,000?  $1,000,000?)<br/>\nLoss of visitation?<br/>\nLoss of affection?<br/>\nRuination of family reunions?<br/>\n<br/>\nReligion.  There are religions obligations and principles to consider sometimes.<br/>\n<br/>\nLet&#39;s have it, then.  Don&#39;t write anything you don&#39;t want to share.  Don&#39;t write things you don&#39;t want &quot;out there.&quot;  If people want to send me things directly to be put here anonymously, proofread them for names before you send them.  Make it anonymous and I can pass it on anonymously, if necessary.<br/>\n<br/>\nWHAT WILL HELP?<br/>\nWhat confidence or courage do some people need to stand up to older relatives?<br/>\nWould a list of possible responses help?  A &quot;kit&quot; of sorts?  But isn&#39;t that creepy, to script &quot;comebacks&quot; to insults?<br/>\n<br/>\nI don&#39;t know those answers, but am willing to help sort through data and a brainstormed dump.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":63306,"nextTopicId":63286}}