{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Expressing Disapproval of Child&#39;s Choice or Action?","postDate":"1314443973","msgId":62516,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJDQzQzMzY5LUYzQUMtNDI0OS05QjdFLTg2QUI5NzkwOEJEQ0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGozYTZqMCtsOHJkQGVHcm91cHMuY29tPg==","referencesHeader":"PGozYTZqMCtsOHJkQGVHcm91cHMuY29tPg=="},"prevInTopic":62515,"nextInTopic":0,"prevInTime":62515,"nextInTime":62517,"topicId":62511,"numMessagesInTopic":0,"msgSnippet":"Joanna said all the good stuff. I just thought I would say that I ve been wah wah wah at both Marty and Holly just this week, about this or that.  Even as I","messageBody":"<div id=\"ygrps-yiv-2067621376\">Joanna said all the good stuff.<br/>\n<br/>\nI just thought I would say that I&#39;ve been &quot;wah wah wah&quot; at both Marty and Holly just this week, about this or that.  Even as I was &quot;expressing my concerns,&quot; I knew it wasn&#39;t helping.  It&#39;s HARD to be quiet sometimes.    And it&#39;s harmful not to be quiet sometimes.</div>","specialLinks":[]},{"userId":439731658,"authorName":"Joanna","from":"&quot;Joanna&quot; &lt;ridingmom@...&gt;","profile":"ridingmom1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Expressing Disapproval of Child&#39;s Choice or Action?","postDate":"1314430368","msgId":62515,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGozYTZqMCtsOHJkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGozOGo1Nythc3UyQGVHcm91cHMuY29tPg=="},"prevInTopic":62511,"nextInTopic":62516,"prevInTime":62514,"nextInTime":62516,"topicId":62511,"numMessagesInTopic":0,"msgSnippet":"... But what else?  I am really committed to learning to have a more respectful, loving, peaceful relationship with my kids, and yesterday I realized that I","messageBody":"<div id=\"ygrps-yiv-1516350340\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;kelly_sturman&quot; &lt;kelly@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n </span></blockquote>But what else?  I am really committed to learning to have a more respectful, loving, peaceful relationship with my kids, and yesterday I realized that I don&#39;t really know how to  express disrespect for their actions without it feeling like I disrespect them.<br/>\n=================================================================<br/>\n<br/>\n<br/>\nIt seems to me like you might be right on the verge of a major shift. You are asking the right question, &quot;How can I express disapproval without feeling like I am shaming and pressuring them?&quot;<br/>\n<br/>\nYou have to stop shaming and pressuring them.<br/>\n<br/>\nYou can have a conversation about the pros and cons of bots. If I&#39;m going to have a talk of this nature I usually ask permission. I&#39;ve always received a yes. But I make it clear that the choices we are talking about are theirs. We just talk about the issues and I express my opinion without the shame or pressure. I keep in mind that there are many ways to live and that I trust my kids to choose those ways that will be the healthiest for them in the end, if not always in that moment. Sometimes they need to take a side track and explore something.<br/>\n<br/>\nMy daughter will always use whatever &quot;cheats&quot; are available to her, and that&#39;s how she enjoys playing. My son doesn&#39;t use cheats and doesn&#39;t respect them. His purposes in gaming are different than hers. She&#39;s also enjoyed &quot;griefing&quot; other players, which drives my son nuts. We talk about the consequences, briefly, because she already knows--but I know that she&#39;s learning about boundaries and relationships. Would I do it? No. But she does, and she&#39;s been banned from her guild before. I think she may have slowed down a lot after that happened.<br/>\n<br/>\nI don&#39;t need my kids to always make the right choices. These choices are theirs to make, and as long as they realize what they&#39;re doing and what the stakes are, it&#39;s up to them. (And it&#39;s NOT analogous to running in front of a speeding car. :-)) I see that they are getting more and more sophisticated at interacting with feedback from their world--friends, both online and irl.<br/>\n<br/>\nI think that allowing their kids to make real choices, and sometimes making the wrong ones, is one of the hardest things for mothers to do. We want our kids to be successful people, with all that that entails--likeable, lots of friends,etc., and traditional parenting says that &quot;Mother knows best.&quot; But they need the room to grow into the people they will be. With support and partnership from you, they can. If you shame them, then they will likely just hide those parts of themselves from you. And often the wrong choices provide the most learning opportunities.<br/>\n<br/>\nJoanna</div>","specialLinks":[]},{"userId":480242910,"authorName":"kelly_sturman","from":"&quot;kelly_sturman&quot; &lt;kelly@...&gt;","profile":"kelly_sturman","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Expressing Disapproval of Child&#39;s Choice or Action?","postDate":"1314377703","msgId":62511,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGozOGo1Nythc3UyQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":62515,"prevInTime":62510,"nextInTime":62512,"topicId":62511,"numMessagesInTopic":0,"msgSnippet":"Yesterday, I lectured two of my children, and I m unhappy that I did that.  We used to be relaxed eclectic homeschoolers, and I have definitely shamed,","messageBody":"<div id=\"ygrps-yiv-1305765566\">Yesterday, I lectured two of my children, and I&#39;m unhappy that I did that.  We used to be relaxed eclectic homeschoolers, and I have definitely shamed, punished, and pressured these kids in the past.  I don&#39;t ever want to be that kind of a mother again, but something happened yesterday that made me realize I really am not sure how to express disapproval without feeling like I am shaming and pressuring them.<br/>\n<br/>\nThis is what happened:<br/>\n<br/>\nI walked into the room and realized that there was a dispute going on.  My two 11 year olds (a son and a daughter) have been using bots in Runescape, and my 12 year old daughter and 14 year old son were expressing their disapproval of that.  As soon as I walked into the room, my 12 year old daughter asked me what I thought about it.  This has been an ongoing discussion in the household, so she already knew the answer to her question before she asked me it.<br/>\n<br/>\nI said that I don&#39;t use bots, and that I don&#39;t like it when other people do, and that I don&#39;t respect their choice to do so.  I said that it&#39;s cheating, and it&#39;s lying, and it&#39;s breaking a promise, because everybody who plays signs a User Agreement that forbids the use of bots.  I asked &quot;What&#39;s the value of a skill cape if people don&#39;t do the work themselves to get their skill level up high enough to earn the cape?  Is a skill cape worth anything at all if you got it using a bot?&quot;  I said, &quot;If you wear a skill cape, but you got it with a bot, then you are lying.  You are telling everybody that you did the work required to earn the cape, when really you didn&#39;t.&quot;  I also mentioned malware, and that I think that running the bot could mess up the programming of the game, which would then interfere with everybody&#39;s gaming experience.<br/>\n<br/>\nAnd then I said, &quot;I don&#39;t want to lecture you.  But I don&#39;t like botting.  I don&#39;t respect botting.  I don&#39;t bot, and I really don&#39;t like it that you do.  It&#39;s not cool.&quot;  I wasn&#39;t yelling during any of this--in the past, I probably would have been--but I&#39;m sure my tone of voice and body language conveyed, &quot;I feel strongly about what I am saying to you right now.&quot;<br/>\n<br/>\nI didn&#39;t tell them not to bot.  I didn&#39;t tell them they couldn&#39;t play the game.  I didn&#39;t take their laptops away.  (In the past, I have done all of these things.)  So, things here are definitely better, more peaceful, more respectful that they used to be.  But I&#39;m pretty sure they could be better still.  (We&#39;ve been unschooling on and off for three years, with two breaks of four to six months each in which I let my fears convince me that I &quot;had to&quot; use traditional parenting methods.  We&#39;ve been unschooling again for six months now, and I am finally getting it enough to know that I for sure don&#39;t ever again want to go back to they way things used to be around here.)  <br/>\n<br/>\nLater in the day, the 14 year old son came to me to say that the 11 year old son had unfriended a whole bunch of players, all of the ones who bot and were encouraging him (the 11 year old) to bot, too.<br/>\n<br/>\nI guess it would have been better if I had stopped after the first two sentences:  &quot;I don&#39;t use bots and I don&#39;t like it when other players do.&quot;  I&#39;ve said that several times in the past as this debate has been going on in the household for awhile now (a month maybe?).  In the past I&#39;ve also said, &quot;You know, if another player reports that you&#39;re botting, you could be banned.&quot;  And they&#39;d respond, &quot;Yeah, I know...&quot; and keep on botting.<br/>\n<br/>\nBeing more passionate about my feelings this time &quot;worked&quot; in that now, the kids aren&#39;t botting. But I&#39;m feeling really uncomfortable with the thought that my children changed their behavior because &quot;Mom *really* doesn&#39;t like it when people do this...&quot;<br/>\n<br/>\nI&#39;m going back to read &quot;Balancing in the Middle Ground&quot; again.  And I&#39;m realizing that I did not need to mention the part about the skill capes *three times in a row*.  But what else?  I am really committed to learning to have a more respectful, loving, peaceful relationship with my kids, and yesterday I realized that I don&#39;t really know how to  express disrespect for their actions without it feeling like I disrespect them.<br/>\n<br/>\nKelly Sturman</div>","specialLinks":[]}],"prevTopicId":62490,"nextTopicId":62528}}