{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] being calm","postDate":"1091374099","msgId":97152,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5Yy4yNzU5ZThhMS4yZTNlNjYxM0Bhb2wuY29tPg=="},"prevInTopic":97146,"nextInTopic":0,"prevInTime":97151,"nextInTime":97153,"topicId":97096,"numMessagesInTopic":0,"msgSnippet":"In a message dated 8/1/04 7:58:49 AM, Heatherette@comcast.net writes:  You don t like","messageBody":"<div id=\"ygrps-yiv-1150864883\">In a message dated 8/1/04 7:58:49 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Heatherette@...\">Heatherette@...</a> writes:<br/>\n<br/>\n&lt;&lt; If you have any *specific* suggestions I am glad to hear them.  &gt;&gt;<br/>\n<br/>\nYou don&#39;t like general suggestions about changing your thinking?<br/>\n<br/>\nYou don&#39;t like discussion of thinking patterns and priorities?<br/>\n<br/>\n-=-The points<br/>\nmentioned here about kids reflecting their parents stress level is exactly<br/>\nwhat is going on here.  In my heart and mind I feel very strongly about<br/>\nnatural learning and keeping them out of a dumbing down environment.  I<br/>\nhaven&#39;t had any good role models growing up to emulate and so I am trying to<br/>\nabsorb as much as I can from my friends and reading etc.  -=-<br/>\n<br/>\nYou might make better progress if you don&#39;t try to predict or dictate what <br/>\nexact sort of advice you think you need.<br/>\n<br/>\n-=-On one hand, I desperately want to enjoy my children<br/>\nand interacting with them, and on the other, I do spend a large amount of<br/>\ntime trying to figure out how to escape them because mothering is<br/>\noverwhelming for me. -=-<br/>\n<br/>\nWe&#39;re trying to help you.  The specific suggestions people are making is to <br/>\nchange your perceptions.  We know it&#39;s doable, because we&#39;ve all done it.<br/>\n<br/>\nHere are more things to read if you want.  <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/life\">http://sandradodd.com/life</a><br/>\n<br/>\nI should really just transcribe that talk on Peaceful Parenting.  I&#39;ll have <br/>\nsome copies of the cassette tape at the conference in Boston.<br/>\n<br/>\n-=-If you have any *specific* suggestions I am glad to hear them. -=-<br/>\n<br/>\nI thought I had put this link here.  You can&#39;t get much more specific than <br/>\nthis total play-by-play of something that works for more than just the single <br/>\nincident, but helps people for the next times:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/peace/fighting\">http://sandradodd.com/peace/fighting</a><br/>\n<br/>\nSandra<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":98863955,"authorName":"Heather Hall","from":"Heather Hall &lt;Heatherette@...&gt;","profile":"harrietsmama","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] being calm","postDate":"1091368679","msgId":97146,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJEMzI2RjI3LjU1RjAlaGVhdGhlcmV0dGVAY29tY2FzdC5uZXQ+","inReplyToHeader":"PDEwOTEzNTY0MDcuODM5LjIwNDU0Lm0xMkB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":97118,"nextInTopic":97152,"prevInTime":97145,"nextInTime":97147,"topicId":97096,"numMessagesInTopic":0,"msgSnippet":"If you have any *specific* suggestions I am glad to hear them.  Like I said, when they figure it out on their own it seems to work better.  When I try to get","messageBody":"<div id=\"ygrps-yiv-400017408\">If you have any *specific* suggestions I am glad to hear them.  Like I said,<br/>\nwhen they figure it out on their own it seems to work better.  When I try to<br/>\nget involved, they fight more, I get so frustrated the next thing ya know<br/>\nI&#39;m screaming my head off and grabbing and slamming doors.  The points<br/>\nmentioned here about kids reflecting their parents stress level is exactly<br/>\nwhat is going on here.  In my heart and mind I feel very strongly about<br/>\nnatural learning and keeping them out of a dumbing down environment.  I<br/>\nhaven&#39;t had any good role models growing up to emulate and so I am trying to<br/>\nabsorb as much as I can from my friends and reading etc.  I ended up with on<br/>\nunattainable ideal initially and I still haven&#39;t figured out how to believe<br/>\nI can be a good mom.  On one hand, I desperately want to enjoy my children<br/>\nand interacting with them, and on the other, I do spend a large amount of<br/>\ntime trying to figure out how to escape them because mothering is<br/>\noverwhelming for me.  I can handle snuggling really well, but they just<br/>\ndon&#39;t want to snuggle all day.  I can read 15 books in a row, I can turn on<br/>\nthe hose, I can get Barbie&#39;s clothes on & off.  I think I fake it pretty<br/>\nwell.  In reality I still am just not comfortable with my role.  I had the<br/>\nidea and strong picture of being a perfect parent and I didn&#39;t realize until<br/>\nmy babies were here that it had nothing to do with actual children.  Now<br/>\nthey are here, they are amazing and I love them intensely, but so often I<br/>\nwish I could watch them through a window so I wouldn&#39;t have to interact with<br/>\nthem.  How do I fix that?<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Sometimes they are hitting each other, but I tell them if they don&#39;t<br/>\n&gt;&gt; like it, the 2 of them are going to have to figure out a better way<br/>\n&gt;&gt; to play together or decide to play apart.  Mommy needs some time to<br/>\n&gt;&gt; herself!  <br/>\n&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n&gt; <br/>\n&gt; My time to myself shouldn&#39;t come at my kids expense. hitting is completely<br/>\n&gt; unacceptable and I have to step in as the enforcer in those situations. I do<br/>\n&gt; let them work things out at times but it&#39;s usually when there&#39;s a minor spat<br/>\n&gt; going on. About half the time they work it out, if it escalates to yelling I<br/>\n&gt; step in and help them come up with solutions. If there&#39;s hitting, everything<br/>\n&gt; stops. The one hit gets hugs while the one that hits goes to their room to<br/>\n&gt; calm done and the toy that was used (so often the case) gets put  up for the<br/>\n&gt; day. Kids can&#39;t sort these things out by themselves if you haven&#39;t first shown<br/>\n&gt; them where the boundaries are and the only way to do that is to step in.<br/>\n&gt; They&#39;ve only got a few years practice at living and usually not the experience<br/>\n&gt; to negotiate sometimes complicated situations. Have you thought that you&#39;re<br/>\n&gt; also telling them that when they are in situations where they are extremely<br/>\n&gt; angry, scared, etc., not to come to you? that you don&#39;t want them sharing<br/>\n&gt; their problems and you&#39;re time is more important?<br/>\n&gt; <br/>\n&gt; I do fight for me time sometimes and unless I can get right out of the house<br/>\n&gt; it rarely works. If I&#39;m there, they need me and that&#39;s just how it works. The<br/>\n&gt; funny thing, when I give up the fight and surrender...It gets sooo much<br/>\n&gt; better. We have fun and I can just be myself with them.<br/>\n&gt; <br/>\n&gt; Dawn (in NS)<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>-- <br/>\nHeather, mom to<br/>\nHarriet 12.15.99<br/>\nCrispin 01.25.02<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:heatherette@...\">heatherette@...</a></div>","specialLinks":[]},{"userId":162967824,"authorName":"Dawn Adams","from":"&quot;Dawn Adams&quot; &lt;Wishbone@...&gt;","profile":"bluenosegoddess","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: being calm","postDate":"1091274781","msgId":97118,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNGQwMWM0NzZmNCRlZWMwNjMyMCQ3NTRjZGUxOEBhb2xkc2wubmV0Pg==","referencesHeader":"PGNlZWdsbis5b3RyQGVHcm91cHMuY29tPg=="},"prevInTopic":97111,"nextInTopic":97146,"prevInTime":97117,"nextInTime":97119,"topicId":97096,"numMessagesInTopic":0,"msgSnippet":"... My time to myself shouldn t come at my kids expense. hitting is completely unacceptable and I have to step in as the enforcer in those situations. I do let","messageBody":"<div id=\"ygrps-yiv-1332353917\"><blockquote><span title=\"ireply\">&gt;Sometimes they are hitting each other, but I tell them if they don&#39;t <br/>\n  &gt;like it, the 2 of them are going to have to figure out a better way <br/>\n  &gt;to play together or decide to play apart.  Mommy needs some time to <br/>\n  &gt;herself!  <br/>\n  &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>  My time to myself shouldn&#39;t come at my kids expense. hitting is completely unacceptable and I have to step in as the enforcer in those situations. I do let them work things out at times but it&#39;s usually when there&#39;s a minor spat going on. About half the time they work it out, if it escalates to yelling I step in and help them come up with solutions. If there&#39;s hitting, everything stops. The one hit gets hugs while the one that hits goes to their room to calm done and the toy that was used (so often the case) gets put  up for the day. Kids can&#39;t sort these things out by themselves if you haven&#39;t first shown them where the boundaries are and the only way to do that is to step in. They&#39;ve only got a few years practice at living and usually not the experience to negotiate sometimes complicated situations. Have you thought that you&#39;re also telling them that when they are in situations where they are extremely angry, scared, etc., not to come to you? that you don&#39;t want them sharing their problems and you&#39;re time is more important?<br/>\n<br/>\n  I do fight for me time sometimes and unless I can get right out of the house it rarely works. If I&#39;m there, they need me and that&#39;s just how it works. The funny thing, when I give up the fight and surrender...It gets sooo much better. We have fun and I can just be myself with them. <br/>\n<br/>\n  Dawn (in NS)<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: being calm","postDate":"1091226453","msgId":97111,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY0LjQxYWJjMzU1LjJlM2MyNTU1QGFvbC5jb20+"},"prevInTopic":97109,"nextInTopic":97118,"prevInTime":97110,"nextInTime":97112,"topicId":97096,"numMessagesInTopic":0,"msgSnippet":"In a message dated 7/30/2004 4:08:40 PM Mountain Daylight Time, queenjane555@yahoo.com writes: My son is almost 8, and his niece just turned 9, and i still","messageBody":"<div id=\"ygrps-yiv-960934342\">In a message dated 7/30/2004 4:08:40 PM Mountain Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:queenjane555@...\">queenjane555@...</a> writes:<br/>\nMy son is almost 8, and his niece just turned <br/>\n9, and i still have to help them work things out sometimes.<br/>\n----------<br/>\n<br/>\nI agree.  <br/>\n<br/>\nMine are 12, 15 and (as of yesterday) 18 and I&#39;m willing to help them work <br/>\nthings out everytime, because they don&#39;t need to be harrassed by someone they <br/>\ndidn&#39;t choose to live with.<br/>\n<br/>\n-=- Can maybe you take them somewhere every day, like the <br/>\npark, and read while they play on the equiptment? When my son was a <br/>\nbit younger, and i wanted some time to read, or just zone out a <br/>\nlittle, i would take him to Chuck E Cheese, or McDonalds Playplace, <br/>\nand let him play while i focused on my magazine or whatever. Your <br/>\nkids might be less likely to fight if they are in a new, interesting, <br/>\nneutral location like that. <br/>\n-=-<br/>\n<br/>\nGood idea!<br/>\n<br/>\nThen they don&#39;t have the space and ownership problems they have at home.<br/>\n<br/>\nWe used to meet other families at parks sometimes just so we didn&#39;t have to <br/>\nnegotiate which family&#39;s rules or stuff or sharing traditions or whatever to go <br/>\nby.  Neutral space, neutral rules, and LOTS of room to wander away to avoid <br/>\nsomething or get over frustration.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":59925222,"authorName":"queenjane555","from":"&quot;queenjane555&quot; &lt;queenjane555@...&gt;","profile":"queenjane555","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: being calm","postDate":"1091225079","msgId":97109,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNlZWdsbis5b3RyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJEMkZGRTBCLjU1NTYlaGVhdGhlcmV0dGVAY29tY2FzdC5uZXQ+"},"prevInTopic":97103,"nextInTopic":97111,"prevInTime":97108,"nextInTime":97110,"topicId":97096,"numMessagesInTopic":0,"msgSnippet":"... I noticed in your sig line your kids are ages 2 and 4? Thats really really young. I think too young to expect them to work things out on their own or left","messageBody":"<div id=\"ygrps-yiv-510147155\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, Heather Hall <br/>\n&lt;Heatherette@c...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I have recently consciously made the effort to just let go <br/>\n&gt;sometimes.  Even if my kids are completely emptying the bookshelves <br/>\n&gt;or arguing or whatever, I just tell them they are going to have to <br/>\n&gt;figure it out for themselves.<br/>\n<br/>\n </span></blockquote>I noticed in your sig line your kids are ages 2 and 4? Thats really <br/>\nreally young. I think too young to expect them to work things out on <br/>\ntheir own or left unsupervised for long periods of time. I would <br/>\nthink at this age they really need you right there helping them work <br/>\nout disagreements, helping brainstorm solutions that they both like, <br/>\nengaging them in play. My son is almost 8, and his niece just turned <br/>\n9, and i still have to help them work things out sometimes. <br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Sometimes they are hitting each other, but I tell them if they don&#39;t <br/>\n&gt;like it, the 2 of them are going to have to figure out a better way <br/>\n&gt;to play together or decide to play apart.  Mommy needs some time to <br/>\n&gt;herself!  <br/>\n<br/>\n </span></blockquote>I only have the one child, so i might be way off base, but i think <br/>\nthere has to be a better solution, when one child is hitting another, <br/>\nto say &quot;if you don&#39;t like it leave the room&quot;...i think first and <br/>\nforemost i would want to immediately stop the hitting behavior. <br/>\nSandra has made some good comments in the past about siblings hitting <br/>\neach other. Its really important to create a safe zone where this <br/>\nstuff is taken seriously (esp if its usually one doing most of the <br/>\nhitting)and talked about, and stopped. That being said, i have 7 <br/>\nbrothers and sisters and i know that kids can get rough with each <br/>\nother. But i just think toddler and preschool age kids need a great <br/>\ndeal of supervision.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I&#39;d rather have 2 hours to myself totally absorbed in a magazine or <br/>\n&gt;whatever and have to reassemble their room later, than to fight for <br/>\n&gt;2 hours and keep it tidy.<br/>\n<br/>\n </span></blockquote>Again, i don&#39;t have 2 preschoolers so maybe i am wrong here, but i <br/>\nthink your expectations are too high. It seems you are saying (and i <br/>\nadmittedly havent read the entire thread)that you want to be able to <br/>\nbe totally uninterrupted for two hours, to be able to focus on you <br/>\nduring that time. I dont think you&#39;ll get the kind of mommy time you <br/>\nwant until your kids are older. I&#39;ve also found that my son and his <br/>\nniece have much better behavior and get along more effectively when i <br/>\nam there with them, helping them figure stuff out, rather than when <br/>\nthey are in a room by themselves left to their own devices. <br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;itfelt so mean the first few times but they can actually figure it <br/>\n&gt;ut now after hearing me say over and over &#39;what do you want to be <br/>\n&gt;ifferent? Ok, so tell him that!&#39; etc.  <br/>\n<br/>\n </span></blockquote>I think if something &quot;felt mean&quot; to you, you should listen to that <br/>\ninstinct and really look at *why* it felt mean. The above statement <br/>\nreminds me of the justification for letting a baby cry himself to <br/>\nsleep &quot;it felt mean to let him cry but after several nights of him <br/>\nknowing we werent picking him up, he stopped crying and went to sleep <br/>\non his own. It worked!&quot; But did it really? I think that you can give <br/>\nthe same kind of info you were giving them (&quot;Tell him what you want <br/>\nto be different&quot;)but present it in a more positive way. I encourage <br/>\nmy niece and my son to work things out themselves, but i also try to <br/>\nmodel some good communication strategies (&quot;Anna, you seem to saying <br/>\nyou feel its not fair that seamus is taking more turns at the game <br/>\nthan you, and now you want to stop playing? Seamus, you seem to be <br/>\nsaying that the reason you took more turns is because anna said it <br/>\nwas ok, and now you feel she is punishing you for that. How can we <br/>\nwork this out? What do you think would be fair to both of you?&quot;)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; did give direction I guess, but I refused to get up from my spot.<br/>\n <br/>\n </span></blockquote>You seem to be saying that you don&#39;t care how they work things out <br/>\njust as long as they don&#39;t bug you while you are getting your <br/>\ndowntime. I can see how, with a mom who is stressed with very young <br/>\nkids, who feels she needs this time to stay sane, it might be a <br/>\nbetter strategy than, say, spanking them into submission, or putting <br/>\nthem in time out, or locking them out of the house. But it doesnt <br/>\nseem ideal. Can maybe you take them somewhere every day, like the <br/>\npark, and read while they play on the equiptment? When my son was a <br/>\nbit younger, and i wanted some time to read, or just zone out a <br/>\nlittle, i would take him to Chuck E Cheese, or McDonalds Playplace, <br/>\nand let him play while i focused on my magazine or whatever. Your <br/>\nkids might be less likely to fight if they are in a new, interesting, <br/>\nneutral location like that. <br/>\n<br/>\nThat being said, i really do feel for you. I can only imagine how <br/>\nexhausting it can be to have more than one. By the end of each week, <br/>\ni am ready to send my niece back to her home, so we can have piece <br/>\nand quiet again. <br/>\n<br/>\n<br/>\nKatherine</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] being calm","postDate":"1091220024","msgId":97103,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0Ny4yZmEyNjc1Ny4yZTNjMGMzOEBhb2wuY29tPg=="},"prevInTopic":97096,"nextInTopic":97109,"prevInTime":97102,"nextInTime":97104,"topicId":97096,"numMessagesInTopic":0,"msgSnippet":"In a message dated 7/30/2004 12:09:57 PM Mountain Daylight Time, Heatherette@comcast.net writes: Even if my kids are completely emptying the bookshelves or","messageBody":"<div id=\"ygrps-yiv-1180331743\">In a message dated 7/30/2004 12:09:57 PM Mountain Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Heatherette@...\">Heatherette@...</a> writes:<br/>\n  Even<br/>\nif my kids are completely emptying the bookshelves or arguing or whatever, I<br/>\njust tell them they are going to have to figure it out for themselves.<br/>\n-----------------<br/>\n<br/>\nPoor kids, though.  If an adult can&#39;t figure it out, how can little kids?<br/>\n<br/>\nMy parents raised two cousins along with me and my sister.  The ages went <br/>\nlike this (and so forth along)  10, 9, 7, 6. My sister and I were 9 and 6 in that <br/>\nlineup.<br/>\n<br/>\nThe second cousin (7) was abusive to the rest of us. Mean, sneaky, she hit. <br/>\nThere was no &quot;figuring it out.&quot;  We needed to be defended from her and <br/>\nprotected from her.  So because of my experience with that, I bristle when mother <br/>\nblythely announced that they will let their kids work out their differences.<br/>\n<br/>\nEach child should have peace and safety in her own home.<br/>\nI just wrote this earlier today somewhere else. &lt;g&gt;<br/>\n<br/>\n-=-So far no one has bled<br/>\nor broken anything.  They have gotten very loud and frustrated sometimes,<br/>\nbut I choose not to take the bait and tell them to figure it out. -=-<br/>\n<br/>\nThere are hurts that don&#39;t bleed.<br/>\n&quot;Take the bait&quot;?  You think their argument is about you?<br/>\n<br/>\n-=-I think the<br/>\nbiggest thing that helped was figuring out what was the time of day I needed<br/>\nthe break most.  From 2-4 pm, I hit a wall.  I am tired, cranky, short<br/>\ntempered and mean.  -=-<br/>\n<br/>\nMaybe you&#39;re hungry.  Maybe food would help at 1:45.  Protein, maybe.<br/>\n<br/>\n-=- but they can actually figure it out now after<br/>\nhearing me say over and over &#39;what do you want to be different? Ok, so tell<br/>\nhim that!&#39; etc.  I did give direction I guess, but I refused to get up from<br/>\nmy spot.-=-<br/>\n<br/>\nI recommend not saying ANY thing over and over. Say it a new way every time.<br/>\nAnd maybe you could get up from &quot;your spot&quot; and give them some food, a drink <br/>\nof juice, a hug. <br/>\n<br/>\n-=- Mommy is the &#39;safe&#39; zone where they can let it all out and<br/>\ntest etc.  <br/>\n-=-<br/>\n<br/>\nAre you less guarded and formal with your husband than with strangers?<br/>\nI know I am.   <br/>\n<br/>\nBut just because he&#39;s the safest person in my life doesn&#39;t mean I&#39;m testing <br/>\nhim when I let thing out.  I doubt your kids are &quot;testing you.&quot;<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":98863955,"authorName":"Heather Hall","from":"Heather Hall &lt;Heatherette@...&gt;","profile":"harrietsmama","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] being calm","postDate":"1091208651","msgId":97096,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJEMkZGRTBCLjU1NTYlaGVhdGhlcmV0dGVAY29tY2FzdC5uZXQ+","inReplyToHeader":"PDEwOTExODQ1MDguNDYwLjkzMTMubTEyQHlhaG9vZ3JvdXBzLmNvbT4="},"prevInTopic":0,"nextInTopic":97103,"prevInTime":97095,"nextInTime":97097,"topicId":97096,"numMessagesInTopic":0,"msgSnippet":"I hear you!  and the voice in my head too ;) I have recently consciously made the effort to just let go sometimes.  Even if my kids are completely emptying the","messageBody":"<div id=\"ygrps-yiv-329627574\">I hear you!  and the voice in my head too ;)<br/>\n<br/>\nI have recently consciously made the effort to just let go sometimes.  Even<br/>\nif my kids are completely emptying the bookshelves or arguing or whatever, I<br/>\njust tell them they are going to have to figure it out for themselves.  I<br/>\ncan&#39;t always fix everything or be a constant moderator.  Sometimes they are<br/>\nhitting each other, but I tell them if they don&#39;t like it, the 2 of them are<br/>\ngoing to have to figure out a better way to play together or decide to play<br/>\napart.  Mommy needs some time to herself!  I&#39;d rather have 2 hours to myself<br/>\ntotally absorbed in a magazine or whatever and have to reassemble their room<br/>\nlater, than to fight for 2 hours and keep it tidy.  So far no one has bled<br/>\nor broken anything.  They have gotten very loud and frustrated sometimes,<br/>\nbut I choose not to take the bait and tell them to figure it out.  It felt<br/>\nso mean the first few times but they can actually figure it out now after<br/>\nhearing me say over and over &#39;what do you want to be different? Ok, so tell<br/>\nhim that!&#39; etc.  I did give direction I guess, but I refused to get up from<br/>\nmy spot.  Now they have figured out how to play either together, side by<br/>\nside, or that they also can choose to get up and go find something else to<br/>\ndo on their own.  And then of course sometimes they don&#39;t ;)  I think the<br/>\nbiggest thing that helped was figuring out what was the time of day I needed<br/>\nthe break most.  From 2-4 pm, I hit a wall.  I am tired, cranky, short<br/>\ntempered and mean.  So, I interact much more with my kids at other times and<br/>\nsave that time for &#39;leave me alone&#39; time.<br/>\nThe other thing is - I *know* they are capable of getting along and enjoying<br/>\neach other.  They do it very well when I am not around, like when I swap<br/>\ndate night with a friend or something.  I return to wonderful compliments<br/>\nabout how kind and gentle they are etc.  I no longer try to participate in<br/>\ngetting them ready for bed and to sleep because if I do, they fight and<br/>\nargue and stay awake forever.  With my dh, they read some books, brush<br/>\nteeth, turn out the lights, sing a few songs, and fall asleep 10 minutes<br/>\nlater or less.  Mommy is the &#39;safe&#39; zone where they can let it all out and<br/>\ntest etc.  <br/>\nNow what I *haven&#39;t* figured out is how to get them to cooperate with me<br/>\nwhen I need to get in & out of a store or whatever.  Charles can take them<br/>\nall day on errands and they get along great.  For me, they fight argue, beg,<br/>\nwhine.  Sigh.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If I sit down<br/>\n&gt; with a cup of tea after playing with them or serving lunch and cleaning the<br/>\n&gt; kitchen, I can&#39;t even finish it without getting up several times to deal<br/>\n&gt; with something.  I don&#39;t suppose that this is unsual for a mother with 3<br/>\n&gt; young children, and I guess that&#39;s the crux of it.  I&#39;m thinking that unless<br/>\n&gt; I can come up with some money for an occasional sitter or mother&#39;s helper,<br/>\n&gt; then this is it for awhile.  I can&#39;t tell you how much I wish I could truly<br/>\n&gt; relax for a WHOLE day! LOL<br/>\n&gt; <br/>\n&gt; Anyway, sorry to overwhelm everyone with my long and intense post.  I&#39;m kind<br/>\n&gt; of embarrassed now.  Oh well, I&#39;m embarrassed even when I&#39;m all alone with<br/>\n&gt; myself.  I hear this voice in my head, &quot;What&#39;s wrong with you?  Breathe.<br/>\n&gt; How can this be so hard?&quot;<br/>\n<br/>\n </span></blockquote>-- <br/>\nHeather, mom to<br/>\nHarriet 12.15.99<br/>\nCrispin 01.25.02<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:heatherette@...\">heatherette@...</a></div>","specialLinks":[]}],"prevTopicId":97151,"nextTopicId":97157}}