{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":84919601,"authorName":"Rosybluestar@cs.com","from":"Rosybluestar@...","profile":"rosybluestar","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Parenting In The Positive Article","postDate":"1085438089","msgId":19657,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFjYS4yMWM1YjY4Mi4yZGUzZDI4OUBjcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":19656,"nextInTime":19658,"topicId":19657,"numMessagesInTopic":0,"msgSnippet":"I m happy to post it, thanks, Sandra! Here it is; hope it s insightful. The link is to a slightly rougher version and may not be active for a few days. This","messageBody":"<div id=\"ygrps-yiv-674607411\">I&#39;m happy to post it, thanks, Sandra! Here it is; hope it&#39;s insightful. The <br/>\nlink is to a slightly rougher version and may not be active for a few days. <br/>\nThis was originally created to help give parents who punish their children tools <br/>\nto handle things differently.  I was asked to keep it short but could&#39;ve went <br/>\non for pages! It&#39;s commonsense that most people who subscribe to attachment <br/>\nparenting philosophies are already doing...but I do find myself rerreading as a <br/>\nreminder~:)<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.stophitting.org/disathome/parentinginthepositive.php\">http://www.stophitting.org/disathome/parentinginthepositive.php</a><br/>\n<br/>\nParenting In The Positive<br/>\nBy Debbie Rose<br/>\n<br/>\n<br/>\nAs parents and caregivers I&#39;m sure we can agree that we want to do what is <br/>\nbest for our children. If we really search our hearts and are honest we learn <br/>\nthat hurting a child, no matter the intention, is not truly in the best interest <br/>\nof the child. Nor is &quot;punishment.&quot; But we&#39;re at a loss. What&#39;s the <br/>\nalternative? Most of us simply know of no other way.<br/>\n<br/>\nThe following are suggestions that have been especially helpful to families, <br/>\nperhaps one just like yours, and they are beneficial for the whole family.<br/>\n<br/>\n· Be trustworthy.  Keep your word and do your best to keep agreements.<br/>\n<br/>\n· Be a &quot;safe&quot; person your child can talk with and confide in.<br/>\n<br/>\n· Eliminate from your life whatever you can that takes your patience away <br/>\nfrom your child.<br/>\n<br/>\n· Practice stress release techniques. Paint, write, walk, breathe. Make sure <br/>\nyou&#39;re staying hydrated and drinking enough water. When you&#39;re feeling well, <br/>\nyou&#39;re in a better position to think clearly and be there for your child.<br/>\n<br/>\n· Be respectful, kind and supportive of one another. Be courteous.  Say <br/>\n&quot;please&quot; and &quot;thank you.&quot; <br/>\n<br/>\n· Allow all family members (including toddlers) to contribute to the welfare <br/>\nof the family. This empowers everyone and helps them feel they belong. Make it <br/>\nfun and not a &quot;chore.&quot;<br/>\n<br/>\n· Teach children to respect their bodies (spanking and/or hitting them is not <br/>\nteaching respect for their bodies). Allow the word &quot;no&quot; to be an acceptable, <br/>\nokay and safe word in your family. In a dangerous situation both could save <br/>\nyour child&#39;s life.<br/>\n<br/>\n· Discover and celebrate your child&#39;s unique gifts and hidden talents. We&#39;re <br/>\nall different and unique; it&#39;s what makes us special.<br/>\n<br/>\n· A daily dose of love goes a long way. Give your child hugs and say, &quot;I love <br/>\nyou,&quot; every day.<br/>\n<br/>\n· When a child &quot;acts out&quot; they are asking, (sometimes begging) for your <br/>\nacknowledgment, love and attention. It&#39;s up to you as the parent to figure out <br/>\nwhat&#39;s going on and why.<br/>\n<br/>\n· Have family meetings where everyone&#39;s voice is welcome and heard (including <br/>\nbabies). Keep them a pleasant and safe space where anything can be discussed.<br/>\n<br/>\n· Take care of yourself. Give yourself  &quot;me&quot; time. Whether it&#39;s a fifteen <br/>\nminute bath everyday, a moment to take a &quot;time-out&quot; or &quot;cool-down&quot; for a few deep <br/>\nbreaths when you&#39;re feeling overwhelmed and stressed or an hour massage once <br/>\na month. Whatever is nurturing for you.<br/>\n<br/>\n· Establish a family ritual such as a daily evening stroll after dinner or a <br/>\nweekly pizza and game night. These are what create enjoyable, loving and <br/>\nlasting memories and give everyone something to look forward to as a family.<br/>\n<br/>\n· Remember that children learn about the world around them from us. Not <br/>\nreally by what we say but by what we do. What example are you setting?<br/>\n<br/>\n· Always be on the lookout for ways to empower your child instead of taking <br/>\ntheir power away.<br/>\n<br/>\n· Catch your child being &quot;good&quot; and express your appreciation. Remain mindful <br/>\nthat there really is no such thing as a &quot;bad&quot; child.<br/>\n<br/>\n· Talk, talk, talk. Find out what&#39;s going on. Truly listen and care. Talk <br/>\nwith; not at and no lectures.<br/>\n<br/>\n· Strive to have a family where everyone is equal, including babies and <br/>\nyounger children. We&#39;re all humans worthy of acknowledgment, dignity and respect.<br/>\n<br/>\n· Provide an environment where it&#39;s safe to feel and explore all feelings. <br/>\nIt&#39;s how we express those feelings that may be appropriate or inappropriate. <br/>\nMake sure your child knows it is okay to have and experience all emotions.<br/>\n<br/>\n· Know your child&#39;s developmental level. They may not be emotionally or <br/>\nneurologically capable of behaving how you are expecting them to behave.<br/>\n<br/>\n· Diet matters. Too much sugar, caffeine (i.e. cola drinks and chocolate) and <br/>\njunk food can cause anyone to feel grumpy, impatient or overwhelmed.<br/>\n<br/>\n· Provide positive opportunities for expressing and processing emotions. <br/>\nOffer art supplies, musical instruments, your child&#39;s favorite CD&#39;s and something <br/>\nto play them on, books, paper…whatever they&#39;re into and find helpful in order <br/>\nto express themselves safely. Encourage and suggest tactile, interactive <br/>\nactivities such as gardening, water play, making mud pies, looking at cloud <br/>\nformations, having a picnic under a tree or going for a walk. <br/>\n<br/>\n· Provide a safe space your child can retreat to that&#39;s all their own. It <br/>\ndoesn&#39;t have to be a whole room, just a comfy, cozy spot where they can go to <br/>\nrelax and unwind preferably with some favorite, comforting things nearby. A safe <br/>\nretreat to go to can help shift the focus away from a situation that feels <br/>\noverwhelming or that has become too stressful to resolve in the moment and is <br/>\njust nice to have at any time.<br/>\n<br/>\nThese are just a few ideas to get you started. There are many more in the <br/>\nresources listed below and elsewhere. The bottom line is that children who are <br/>\nforced to live in an environment where they are under the threat of physical <br/>\npunishment, shame, humiliation or any other form of punishment are, on some <br/>\nlevel, existing in a constant state of fear. They are always in survival mode. Not <br/>\nan ideal place for a child to be.<br/>\n<br/>\nWould you prefer to teach your children through fear or through love? There <br/>\nis no such thing as &quot;loving punishment.&quot; Would you like to provide an <br/>\natmosphere of constant fear or to provide a kind, loving and safe home? The choice is <br/>\nup to you.<br/>\n<br/>\n<br/>\nThe following is a list of resources I have found helpful.<br/>\n<br/>\nBeing Happy!  A Handbook to Greater Confidence and Security, by Andrew <br/>\nMatthews.<br/>\n<br/>\nHow to Talk So Kids Will Listen and Listen So Kids Will Talk, by Adele Faber <br/>\nand Elaine Mazlish.<br/>\n<br/>\nThe Natural Child Project - an award winning website with an absolute <br/>\ntreasure-trove of information including free, inspirational parenting cards you can <br/>\ntry online.<br/>\nwww.naturalchild.org<br/>\n<br/>\nThe Positive Discipline Series of books, by Dr. Jane Nelsen. <br/>\nwww.positivediscipline.com<br/>\n<br/>\nwww.onionhead.com - a fun interactive site dedicated to helping people of all <br/>\nages process emotions constructively.<br/>\n<br/>\nwww.coloringtherapy.com - information and products on the healing benefits of <br/>\ncolor therapy.<br/>\n<br/>\nFor Christians who feel they must discipline for religious reasons:<br/>\nwww.parentinginjesusfootsteps.org - suggestions and resources on how to be a <br/>\nChristian parent without punishing.<br/>\n<br/>\nDebbie Rose is an editor and writer. She is a single, stay-at-home, and <br/>\nhomeschooling mom and mother to her wonderfully inquisitive, magical and energetic <br/>\nson, Shane. They live in Santa Fe, New Mexico with their many dogs, cats and <br/>\nfish. She can be reached through her website www.supercoolbooks.com or at <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:rosybluestar@...\">rosybluestar@...</a>.<br/>\n<br/>\n<br/>\nOriginally created for The Center For Effective Discipline, <br/>\nwww.stophitting.org. The author and the CFED grant permission to reprint and distribute in <br/>\nentirety.<br/>\n<br/>\n<br/>\nIn a message dated 5/24/04 12:09:13 PM Mountain Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a> writes: <br/>\n<blockquote><span title=\"ireply\"> &gt; Subject: Re: Re: need advice<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; In a message dated 5/23/04 9:53:12 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Rosybluestar@...\">Rosybluestar@...</a> writes:<br/>\n&gt; <br/>\n&gt; &lt;&lt;I recently wrote an article that you may find helpful. It was created for <br/>\n&gt; a <br/>\n&gt; nonprofit that educates parents and schools on alternatives to hitting, but <br/>\n&gt; there are some tips and more sources you might find helpful. Email me and <br/>\n&gt; I&#39;m <br/>\n&gt; happy to send it to you. &gt;&gt;<br/>\n&gt; <br/>\n&gt; If you want to post it or put a link on the list (if it&#39;s online) that would <br/>\n&gt; <br/>\n&gt; be fine with me!<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; the list-owner-person<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":19655,"nextTopicId":19648}}