{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: family decisions","postDate":"1356888869","msgId":70058,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGticHR2NStrZjM5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBNzIzN0Q0LUU5NkUtNEVBOS04QTI3LTk5NzlBMkM5RUNCQkBmcmVlbmV0LmRlPg=="},"prevInTopic":70042,"nextInTopic":0,"prevInTime":70057,"nextInTime":70059,"topicId":69984,"numMessagesInTopic":0,"msgSnippet":"... Can you step back from wanting to make a perfect decision? You can t predict the future. What you can do is make your best guess based on what you know","messageBody":"<div id=\"ygrps-yiv-296183812\">tania &lt;tania.loewe@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; he wants to see his grandparents today and tomorrow.  <br/>\n&gt; and there it stops. which means i am only informing him, the decision  <br/>\n&gt; is ours. and that doesn&#39;t feel good. if i had the impression he does  <br/>\n&gt; actually have an understanding about the whole thing i would consider  <br/>\n&gt; his wishes more. and this doesn&#39;t feel good..<br/>\n<br/>\n </span></blockquote>Can you step back from wanting to make a perfect decision? You can&#39;t predict the future. What you can do is make your best guess based on what you know now. <br/>\n<br/>\nMoving is hard - it&#39;s stressful for adults as well as children. Rather than focusing on a perfect destination, it might be better to think about ways to make that difficult transition easier for everyone in the family. Plan on doing a lot of whatever you and your child find reassuring and comforting wherever you move. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":300168973,"authorName":"tania","from":"tania &lt;tania.loewe@...&gt;","profile":"tania.loewe","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: family decisions","postDate":"1356815358","msgId":70042,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBNzIzN0Q0LUU5NkUtNEVBOS04QTI3LTk5NzlBMkM5RUNCQkBmcmVlbmV0LmRlPg==","inReplyToHeader":"PGtiZG4zcyszajFzQGVHcm91cHMuY29tPg==","referencesHeader":"PGtiZG4zcyszajFzQGVHcm91cHMuY29tPg=="},"prevInTopic":69995,"nextInTopic":70058,"prevInTime":70041,"nextInTime":70043,"topicId":69984,"numMessagesInTopic":0,"msgSnippet":"thank you, jen. ... yes, this we do. it remains the problem that cold(er) weather and school (in some years) or having to move again are all not things he can","messageBody":"<div id=\"ygrps-yiv-1393405038\">thank you, jen.<br/>\n<br/>\n<br/>\nAm 26/dic/12 um 03:23 schrieb jencookies43:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Having said all that, I would take your family on a vacation where  <br/>\n&gt; you and your husband would like to move to. Or view as much as you  <br/>\n&gt; can on the web, in travel books, etc. talk about what it would be  <br/>\n&gt; like. Ask him his concerns and joys. Be very familiar with him and  <br/>\n&gt; any fears he may have. Explain about the cold weather and having to  <br/>\n&gt; attend school. Let him experience the cold weather in a visit to a  <br/>\n&gt; colder climate near you. Maybe he has changed his opinion on being  <br/>\n&gt; cold. Talk about what school would be like in Germany. Inform him  <br/>\n&gt; about every aspect that you two can think of together.<br/>\n&gt;<br/>\n </span></blockquote>yes, this we do. it remains the problem that cold(er) weather and  <br/>\nschool (in some years) or having to move again are all not things he  <br/>\ncan really grasp. he wants to see his grandparents today and tomorrow.  <br/>\nand there it stops. which means i am only informing him, the decision  <br/>\nis ours. and that doesn&#39;t feel good. if i had the impression he does  <br/>\nactually have an understanding about the whole thing i would consider  <br/>\nhis wishes more. and this doesn&#39;t feel good..<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; After our move to Arizona, my grandparents would always drive out to  <br/>\n&gt; pick my sister and I up so we could spend the whole summer with  <br/>\n&gt; them. It was bliss for me. That maybe something you can present to  <br/>\n&gt; him as well. That he can spend time with his grandpa for a few weeks  <br/>\n&gt; here and there.<br/>\n&gt;<br/>\n </span></blockquote>the contact is pretty close, my mother visits us regularly for two  <br/>\nweeks and we spent every year a month with them. but it is not enough  <br/>\nfor him. and because we are anyway moving, why not move in with them?  <br/>\nthat&#39;s what he thinks.<br/>\n<br/>\nthank you again, tania<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":332164648,"authorName":"Rippy and Graham Dusseldorp","from":"Rippy and Graham Dusseldorp &lt;ripgray@...&gt;","profile":"rdusseldorp","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [AlwaysLearning] family decisions","postDate":"1356691872","msgId":69995,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEIxMDg5MzA3LUU0ODMtNDMzQy1BRDBBLUE1N0EzRDZDRDBEQUBnbWFpbC5jb20+","inReplyToHeader":"PDk4MTdCNzE5LUQyQ0YtNDhCQS1BNDMzLTg2NTE4QzMzQTZCREBmcmVlbmV0LmRlPg==","referencesHeader":"PDk4MTdCNzE5LUQyQ0YtNDhCQS1BNDMzLTg2NTE4QzMzQTZCREBmcmVlbmV0LmRlPg=="},"prevInTopic":69990,"nextInTopic":70042,"prevInTime":69994,"nextInTime":69998,"topicId":69984,"numMessagesInTopic":0,"msgSnippet":"-=- what would you do in a situation like that? -=- I would physically spend time in the places I m interested in living. I would rent a place to stay (or camp","messageBody":"<div id=\"ygrps-yiv-722442521\">-=- what would you do in a situation like that? -=-<br/>\n<br/>\nI would physically spend time in the places I&#39;m interested in living. I would rent a place to stay (or camp or caravan) and imagine what our unschooling lives would be like in that community. I would think about the types of activities we would do, places we would visit, resources we would have access to, travel distances to family and friends, etc.<br/>\n<br/>\n-=- i dont know if he can really tell what a difference for example the weather makes. he doesnt really understand (i think) that it is much warmer here than in germany and what this means for his life (he spends a good part of every day out and up to now he dislikes the cold very much).-=- <br/>\n<br/>\nCould you go for an extended holiday to visit your parents this winter? It would give you and your son an idea of the types of activities he could do in the winter. You can also get an idea of how it would be like to visit your family for an extended period of time. Maybe their house is big enough to comfortably stay there for a few weeks at a time. If not, you can research short term rental possibilities in the area. If your son is thriving there, it might be a good option.<br/>\n<br/>\nThis concerns me though:<br/>\n<br/>\n-=- unschooling since pregnancy with the first, now nearly four, the second son three months. -=-<br/>\n<br/>\nYou have been *learning* about unschooling since pregnancy, but you have not yet started unschooling. Unschooling is an alternative to school. A family starts unschooling once their eldest child reaches school age. <br/>\n<br/>\nThis distinction is important, especially in a place like Europe. When your children are very young, there are usually lots of other preschool children around. It&#39;s easier to fit in and not stand out. When the majority of your son&#39;s age mates start going to school, you may face some scrutiny and your son may miss having friends during school hours. I imagine a place like Germany could be isolating for unschoolers. Most children may start attending school before attendance is compulsory and German homeschooled children are a rarity. <br/>\n<br/>\nAre your parents supportive of unschooling? Some grandparents feel very uncomfortable when their grandchild is the only child in their city not attending school (we have personal experience with this). That might be something to think about. <br/>\n<br/>\n-=- my husband and i would like to move close to people we like, we want to eat together with, maybe even do projects together like farming, animals, music and so on. -=-<br/>\n<br/>\nHave you heard of wwoofing (world wide opportunities on organic farms)? It is an exchange of volunteer labour for room and board on a working farm. You might find interesting opportunities with them, and sometimes wwoofers are homeschoolers themselves. Some places may have space for two families. It might be an inexpensive way to explore different areas to live: www.wwoof.org<br/>\n<br/>\nOur family also had the luxury of being able to choose where to live. I wrote about how we came to our decision on my blog. Maybe some parts of our decision making process will be helpful to you: www.seekingnectar.blogspot.nl/2012/11/effervescence.html<br/>\n<br/>\nWe do a lot of extended visits in our family. We get several visitors each year. Our local friends joke that we&#39;re a little B&B. Sometimes local friends stay over too, even though some only live a 5 minute bike ride away :-)<br/>\n<br/>\nMy mom usually lives with us (or we live with her) for three months each year. Our guest bedroom is called &#39;Nanima&#39;s room&#39; all year round. I think it gives the idea to the children that Nanima (grandmom) is not too far, even though she lives a 10 hour flight away. Our parents make sure that their grandchildren have their own space in each of their homes. Gianluca and Gisele feel very much at home at both their grandparents. <br/>\n<br/>\n-=- what would you do in a situation like that? -=-<br/>\n<br/>\nI would choose a place to live that would be interesting and vibrant for my children. If my children had big social needs, I would choose a place with other homeschooled children within a reasonable distance. I would make sure there was enough space for our loved ones to come visit and stay for extended periods of time. I would do my best to make sure my children could visit people that they love for extended periods of time.<br/>\n<br/>\nRippy<br/>\n(Gianluca 8, Gisele 6)<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":454595162,"authorName":"tucsonhmn","from":"&quot;tucsonhmn&quot; &lt;holistictucson@...&gt;","profile":"tucsonhmn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: family decisions","postDate":"1356537495","msgId":69990,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtiZjZxbisybWd0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEM2NDI0NDU4LUY1NjAtNDcyMy05OUEyLTRFQTQ3NEEyNTA1OUB2ZXJpem9uLm5ldD4="},"prevInTopic":69987,"nextInTopic":69995,"prevInTime":69989,"nextInTime":69991,"topicId":69984,"numMessagesInTopic":0,"msgSnippet":"We had a similar situation and we regret our decision... We moved to Arizona in 2004 and my son was born there. Originally my husband and I moved there from","messageBody":"<div id=\"ygrps-yiv-865549215\">We had a similar situation and we regret our decision... We moved to Arizona in 2004 and my son was born there. Originally my husband and I moved there from Pennsylvania which is 2000 miles away across the U.S.  We were happy with our homeschool community and other friends. We loved the Arizona weather, the lifestyle, the pace, etc.<br/>\n<br/>\nWhen our son was almost 5 we thought that it may be better to move back to where family was in Pennsylvania and New Jersey for various reasons. Since we arrived here we have had so many problems and family was not really as close and supportive as the friends we left behind. My son&#39;s behavior deteriorated from not having the type of friends he left. He really is an outdoor desert kid with the need to be outdoors all year around with friends...and with the winters, people tend to stay inside where we now live when itis cold. Our unschooling is very boring. Even though we still homeschool here, the homeschool community is lacking the unity we used to have. Our son is turning eight in February and we are trying to plan a move back to Arizona. It was not worth the move here as we could have just done extended visits with family and kept living the way we did in the warmth of Arizona. <br/>\n<br/>\nI am not sure what traveling to Germany from Italy is like but have your son consider how much time he will actually spend in Germany with family and being in school versus being in Italy with friends in unschooling freedom and extended visits with family.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Joyce Fetteroll &lt;jfetteroll@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; <br/>\n&gt; On Dec 24, 2012, at 4:46 PM, tania wrote:<br/>\n&gt; <br/>\n&gt; &gt; my son would like to live closer to his friends (also the same family) <br/>\n&gt; &gt; but mainly he wants to live close to or even with my parents who live <br/>\n&gt; &gt; in germany. <br/>\n&gt; <br/>\n&gt; While I would take his preferences seriously, it&#39;s good to recognize that he&#39;s 4 and at 5, at 8, at 12 he&#39;ll be a very different person with different needs. It wouldn&#39;t be reasonable to build a life around someone who won&#39;t be there next year, so to speak.<br/>\n&gt; <br/>\n&gt; I think it&#39;s easier to visit grandparents for extended stays than friends that you don&#39;t see often.<br/>\n&gt; <br/>\n&gt; Joyce<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] family decisions","postDate":"1356524163","msgId":69987,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM2NDI0NDU4LUY1NjAtNDcyMy05OUEyLTRFQTQ3NEEyNTA1OUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDk4MTdCNzE5LUQyQ0YtNDhCQS1BNDMzLTg2NTE4QzMzQTZCREBmcmVlbmV0LmRlPg==","referencesHeader":"PDk4MTdCNzE5LUQyQ0YtNDhCQS1BNDMzLTg2NTE4QzMzQTZCREBmcmVlbmV0LmRlPg=="},"prevInTopic":69985,"nextInTopic":69990,"prevInTime":69986,"nextInTime":69988,"topicId":69984,"numMessagesInTopic":0,"msgSnippet":"... While I would take his preferences seriously, it s good to recognize that he s 4 and at 5, at 8, at 12 he ll be a very different person with different","messageBody":"<div id=\"ygrps-yiv-529737167\">On Dec 24, 2012, at 4:46 PM, tania wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; my son would like to live closer to his friends (also the same family) <br/>\n&gt; but mainly he wants to live close to or even with my parents who live <br/>\n&gt; in germany. <br/>\n<br/>\n </span></blockquote>While I would take his preferences seriously, it&#39;s good to recognize that he&#39;s 4 and at 5, at 8, at 12 he&#39;ll be a very different person with different needs. It wouldn&#39;t be reasonable to build a life around someone who won&#39;t be there next year, so to speak.<br/>\n<br/>\nI think it&#39;s easier to visit grandparents for extended stays than friends that you don&#39;t see often.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":304763189,"authorName":"jencookies43","from":"&quot;jencookies43&quot; &lt;cookiesforthree@...&gt;","profile":"jencookies43","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: family decisions","postDate":"1356488636","msgId":69985,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtiZG4zcyszajFzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDk4MTdCNzE5LUQyQ0YtNDhCQS1BNDMzLTg2NTE4QzMzQTZCREBmcmVlbmV0LmRlPg=="},"prevInTopic":69984,"nextInTopic":69987,"prevInTime":69984,"nextInTime":69986,"topicId":69984,"numMessagesInTopic":0,"msgSnippet":"When my family moved from California to Arizona, I was miserable. I was 7 years old and most of my belongings were sold, without my permission, to make room","messageBody":"<div id=\"ygrps-yiv-771764781\">When my family moved from California to Arizona, I was miserable. I was 7 years old and most of my belongings were sold, without my permission, to make room for more &quot;important&quot; things. As a child I only knew that I was loosing... Things, family, friends, familiarity. <br/>\n<br/>\nHaving said all that, I would take your family on a vacation where you and your husband  would like to move to. Or view as much as you can on the web, in travel books, etc. talk about what it would be like. Ask him his concerns and joys. Be very familiar with him and any fears he may have. Explain about the cold weather and having to attend school. Let him experience the cold weather in a visit to a colder climate near you. Maybe he has changed his opinion on being cold. Talk about what school would be like in Germany. Inform him about every aspect that you two can think of together. <br/>\n<br/>\nAfter our move to Arizona, my grandparents would always drive out to pick my sister and I up so we could spend the whole summer with them. It was bliss for me. That maybe something you can present to him as well. That he can spend time with his grandpa for a few weeks here and there. <br/>\n<br/>\nWhen my husband and I were thinking of moving, we rented a house in the town we were interested in. The kids were apprehensive about a new unfamiliar place to live. By renting the house and exploring the town, after 4 days, my kids were all on board and ready to move. And, we did not sell a single one of their belongings. ;)<br/>\n<br/>\n~Jen</div>","specialLinks":[]},{"userId":300168973,"authorName":"tania","from":"tania &lt;tania.loewe@...&gt;","profile":"tania.loewe","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"family decisions","postDate":"1356392787","msgId":69984,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk4MTdCNzE5LUQyQ0YtNDhCQS1BNDMzLTg2NTE4QzMzQTZCREBmcmVlbmV0LmRlPg=="},"prevInTopic":0,"nextInTopic":69985,"prevInTime":69983,"nextInTime":69985,"topicId":69984,"numMessagesInTopic":0,"msgSnippet":"hello to all, not new to the list but hardly ever writing. so i present myself: 32, a german in italy, unschooling since pregnancy with the first, now nearly","messageBody":"<div id=\"ygrps-yiv-241477541\">hello to all,<br/>\n<br/>\nnot new to the list but hardly ever writing. so i present myself: 32,  <br/>\na german in italy, unschooling since pregnancy with the first, now  <br/>\nnearly four, the second son three months.<br/>\n<br/>\nwe are currently looking for a new house. we are not bound to a place,  <br/>\nnot even to a country, my husband and i both dont work, mainly because  <br/>\nwe both want to stay home with the kids. i am asking myself how to  <br/>\ninvolve my son in the decision making where to move.<br/>\n<br/>\nmy husband and i would like to move close to people we like, we want  <br/>\nto eat together with, maybe even do projects together like farming,  <br/>\nanimals, music and so on. and to live close to children who dont go to  <br/>\nkindergarden and school - something pretty rare in italy. we are  <br/>\ncurrently looking together with a unschooling family with three girls.  <br/>\nwe also want to be not too far from the sea and in the countryside.<br/>\n<br/>\nmy son would like to live closer to his friends (also the same family)  <br/>\nbut mainly he wants to live close to or even with my parents who live  <br/>\nin germany. germany would be - because of having to attend school -  <br/>\nonly a solution for nearly three years, but also then my son could  <br/>\ndecide that being close to his grandparents is more important than not  <br/>\ngoing to school? we can make it happen to go to germany. i dont know  <br/>\nif he can really tell what a difference for example the weather makes.  <br/>\nhe doesnt really understand (i think) that it is much warmer here than  <br/>\nin germany and what this means for his life (he spends a good part of  <br/>\nevery day out and up to now he dislikes the cold very much). he says  <br/>\nhe wants to be close to the sea, he wants to have animals around and  <br/>\nso on but his main point remains being close to his grandparents. (i  <br/>\nwould also like to live with my parents, but my father is still  <br/>\nworking and is in general quite bound to his city where he was also  <br/>\nborn. plus: they both dont speak italian.)<br/>\n<br/>\nall this so you understand a bit the kind of decision we are making.  <br/>\nwhat would you do in a situation like that? i hope you understand my  <br/>\nquestion, thank you, tania</div>","specialLinks":[]}],"prevTopicId":70021,"nextTopicId":70008}}