{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":141316284,"authorName":"pam sorooshian","from":"pam sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"secondary course of study for unschooling families who need one","postDate":"1084390665","msgId":93945,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQ3ODVERkQyLUE0NEItMTFEOC1BQzNGLTAwMEE5NUUyOTJDNkBtYWMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":93944,"nextInTime":93946,"topicId":93945,"numMessagesInTopic":0,"msgSnippet":"There is an elementary version of this too, if anybody is interested. Also - this just says that these subjects are offered, not that a kid takes every one","messageBody":"<div id=\"ygrps-yiv-28282335\">There is an elementary version of this too, if anybody is interested.<br/>\n<br/>\nAlso - this just says that these subjects are offered, not that a kid <br/>\n&quot;takes&quot; every one of them...just like in high school not all kids take <br/>\nall subjects offered.<br/>\n<br/>\nI offer this to you as something to do to handle legalities without <br/>\nhaving to pretend you&#39;re doing school-like coursework. It puts learning <br/>\ninto language school officials can comprehend - with their limited <br/>\nspecialized vocabularies, y&#39;know how they are! &lt;G&gt;<br/>\n<br/>\n~~~~~~~~~~~~~~~~~~~~~~~~~<br/>\n~The World is Our Classroom~<br/>\n~~~~~~~~~~~~~~~~~~~~~~~~~<br/>\n<br/>\nCourse of Study<br/>\nSecondary Students<br/>\nWe believe that the family is the most fundamental social institution <br/>\nand the preferred means of caring for, preparing, and training children <br/>\nto be productive members of society. We promote and support a <br/>\nfamily-centered education.<br/>\n<br/>\nOur education program, in which children learn primarily under the <br/>\nimmediate direction, guidance, and support of their parents and other <br/>\ncaring and involved adults, offers an outstanding educational <br/>\nopportunity by providing a natural learning environment, extensive <br/>\nreal-world experience, flexibility of schedule, and the ability to <br/>\nrespond to the specific needs and inclinations of the child. Each <br/>\nstudent’s program is developmentally appropriate, integrated and fully <br/>\nindividualized, and continually built upon student strengths and <br/>\ninterests throughout the year.<br/>\n<br/>\nEnglish: Students will develop knowledge of, and appreciation for <br/>\nliterature and the language, as well as the skills of speaking, <br/>\nreading, listening, spelling, handwriting, and composition.<br/>\n<br/>\nStudents will read from self-chosen or parent-chosen literature on a <br/>\nregular basis and will engage in reflection on those literature pieces <br/>\nin a variety of ways, such as: journal writing, book reviews, <br/>\nconversations, drama based on the books, book clubs. Our educational <br/>\ngoal is for students to read for pleasure, to gain exposure to a wide <br/>\nvariety of genres, and to be able to reflect critically on what they <br/>\nread.<br/>\n<br/>\nStudents will read content-related non-fiction materials to support <br/>\ntheir chosen areas of interest. They will reflect on these pieces in a <br/>\nvariety of ways, such as: journal writing, writing articles for <br/>\nsubmission to magazines or newspapers, discussions, or development of a <br/>\nscrapbook in an area of interest. Our goal is for students to learn to <br/>\nread critically for information, to understand and be able to reflect <br/>\non materials read, to be able to compare them to other sources of <br/>\ninformation, and to learn how and where to find written resources as <br/>\nneeded.<br/>\n<br/>\nWriting, spelling and grammar will be covered as part of students’ <br/>\nnatural writing processes. Students will develop their ability to write <br/>\ncreatively, to write letters and lists, to create and write drama <br/>\npieces, informational essays, persuasive articles, etc. Our goal is for <br/>\nstudents to enjoy writing, to gain expertise in both the writing <br/>\nprocess and in technical writing and editing skills, and to develop a <br/>\nsense of power over the written word.<br/>\n<br/>\nScience: Students will develop their scientific knowledge with emphasis <br/>\non basic concepts, theories, and processes of scientific investigation <br/>\nand on the place of humans in ecological systems, and with appropriate <br/>\napplications of the interrelation and interdependence of the sciences. <br/>\nThese will be related to areas of special student interest by engaging <br/>\nin hands-on activities, watching science videos, reading related <br/>\nwritten materials, conducting scientific experiments, keeping journals, <br/>\nmaking and recording observations, visiting scientists in their work <br/>\nplaces, visiting local science museums, participating in science fairs <br/>\nand workshops, or through cooperative learning. Our goal is for <br/>\nstudents to experience a wide range of scientific exposure in their <br/>\nareas of interest, to develop a positive interest in science, to learn <br/>\nto think scientifically, to develop a respect for the work scientists <br/>\ndo, and to understand the importance science has in daily life.<br/>\n<br/>\nSocial Studies: Students will develop their understanding of the social <br/>\nsciences and humanities by reading and discussing fiction and <br/>\nnon-fiction materials, participating in field trips to historic and <br/>\npolitically or culturally significant sites, or through discussion and <br/>\ndebate. Anthropology, economics, psychology, geography, history, <br/>\npolitical science, and sociology are fully integrated into the students <br/>\nstudies in a wide variety of ways, such as: the use of time lines and <br/>\nmaps, discussion, journal writing, cooking, plays, road trips, <br/>\ninvention building, field trips, and art. Our goal is for students to <br/>\ndevelop a foundation for understanding the history, resources, <br/>\ndevelopment, and government of California and the United States of <br/>\nAmerica; the American legal system; the operation of the juvenile and <br/>\nadult criminal justice systems and the rights and duties of citizens <br/>\nunder the criminal and civil law and the State and Federal <br/>\nconstitutions; the development of the American economic system <br/>\nincluding the role of the entrepreneur and labor; the relations of <br/>\npersons to their human and natural environment; eastern and western <br/>\ncultures and civilizations; human rights issues, with particular <br/>\nattention to the study of the inhumanity of genocide, slavery, and the <br/>\nHolocaust; and contemporary issues including the wise use of natural <br/>\nresources.<br/>\n<br/>\nHealth and Physical Education: Health and physical education will be <br/>\nfully integrated as a part of daily living skills and participation in <br/>\nthe wider community. Students will learn to care for their health and <br/>\nphysical environment in a variety of ways, such as: shopping for and <br/>\npreparing food, discussing the necessity of a healthy diet, <br/>\nparticipation in fire drills and other emergency preparedness <br/>\nactivities, exercise both as play and as part of a structured group <br/>\nexperience and through camping, hiking, and other outdoor activity. Our <br/>\ngoal is for students to appreciate the necessity of a healthy body and <br/>\nto develop lifelong habits of regular exercise and good nutrition.<br/>\n<br/>\nApplied Arts and Vocation/Technical Education: Consumer and homemaker <br/>\neducation, industrial arts, general business education, and general <br/>\nagriculture will be offered in a variety of ways. Students’ interests <br/>\nwill determine the direction of their applied arts and vocation <br/>\nprojects, which may include apprenticeships, mentorships, or specific <br/>\ntraining. Our goal is for students to develop skills and knowledge to <br/>\nmeet their own future vocational and avocational requirements.<br/>\n<br/>\nVisual and Performing Arts: Students will develop their knowledge of <br/>\nart, music, and drama through informal and structured methods in a <br/>\nvariety of ways, such as: art classes, instrumental lessons, choral <br/>\nsinging, listening to various styles of music, learning about the <br/>\npeople who have influenced music through history, or working on <br/>\nindividualized or group projects that relate to music, art, and drama, <br/>\nincluding acting and performing in a variety of venues and genres.  Our <br/>\ngoal is for students to enjoy a wide variety of art, music, and drama <br/>\nexperiences, including performance, while developing an understanding <br/>\nand appreciation of the importance of art, music, and drama as creative <br/>\nexpressions of human life experiences.<br/>\n<br/>\nMathematics: Students will develop mathematical concepts, operational <br/>\nskills, and problem solving through participation in daily real-world <br/>\nactivities such as cooking, building, shopping, budgeting, computing, <br/>\netc. Mathematics materials will be chosen to support students’ <br/>\nindividual learning styles in order to achieve competency in <br/>\noperational skills and insight into problem-solving procedures.  Our <br/>\ngoal is for students to gain a strong conceptual knowledge of <br/>\nmathematics as well as an appreciation for the daily applications of <br/>\nmathematics in their lives.<br/>\n<br/>\nAutomobile Driver Education: Students will be offered the opportunity <br/>\nto develop the knowledge and skills necessary to become safe drivers.<br/>\n<br/>\nForeign Language: Students will have the opportunity to develop <br/>\nunderstanding, speaking, reading, and writing skills in a foreign <br/>\nlanguage of their choice.<br/>\n<br/>\nParenting Skills: Students will acquire parenting skills primarily <br/>\nthrough first-hand interaction with, and observation of, young children <br/>\nand through direct adult instruction in skills and knowledge including: <br/>\neffective parenting, prevention of child abuse, nutrition, household <br/>\nfinances and budgeting, personal and family interactions and relations, <br/>\nmethods to promote self-esteem, effective decision-making skills, <br/>\nfamily and individual health, child growth and development, parental <br/>\nresponsibilities, personal hygiene, maintenance of healthy <br/>\nrelationships, and teen-parenting issues.</div>","specialLinks":[]}],"prevTopicId":93940,"nextTopicId":93936}}