{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"creating an environment","postDate":"1122407377","msgId":107523,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGUzLjE4MzY0YjdiLjMwMTdlZGQxQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":107522,"nextInTime":107524,"topicId":107523,"numMessagesInTopic":0,"msgSnippet":"In a message dated 7/26/05 9:22:44 AM, arcarpenter@gmail.com writes: -=-It s funny that the words peaceful parenting became an issue in the previous","messageBody":"<div id=\"ygrps-yiv-2029040025\">In a message dated 7/26/05 9:22:44 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:arcarpenter@...\">arcarpenter@...</a> writes:<br/>\n-=-It&#39;s funny that the words &quot;peaceful parenting&quot; became an issue in the<br/>\nprevious discussion, because all that forethought and attention to<br/>\nfactors outside of the actual incident between kids, all that *action*<br/>\nbut not *reaction* -- that *is* what I think of as peaceful parenting.<br/>\nNot just the talk -- heck, my 2 y.o. doesn&#39;t talk yet and as I said,<br/>\nmy 8 y.o. sometimes can&#39;t verbalize.  But seeing the whole picture,<br/>\nand seeing the world through my children&#39;s eyes, so I can create a<br/>\nspace for them that leads to more peaceful living -- all that, to me,<br/>\nis peaceful parenting.-=-<br/>\n<br/>\n<br/>\nThis is all of unschooling to me, including the parenting and the learning <br/>\nsituation and the freedom and respect and choices.    I consider it my role as <br/>\nthe parent who wants these things to happen and to unfold really well to create <br/>\na nest, and environment, in which learning happens easily, children can get <br/>\nalong with each other or get away from each other, choices are varied and <br/>\nworkable, there is safety to come home to any hour of the day, and there are <br/>\nopportunities for various combinations of people (Holly really likes to be with <br/>\nMarty lately; Keith sometimes wants to find good reasons to spend time with Kirby, <br/>\netc.).   There needs to be a variety of good and interesting food.   Clothes <br/>\nand towels need to be clean.   If I want kids to keep taking baths because <br/>\nthey want to, soap, shampoo and conditioner need to be readily available.   <br/>\n<br/>\nI know from personal experience LOTS of ways to create an edgy, <br/>\ninsecure-feeling environment.   I could drink a lot, only buy toilet paper when it runs <br/>\nout, not feed the dog but just yell at kids if the dogfood dish was empty, give <br/>\naway or throw away kids&#39; clothes I didn&#39;t like, throw away any odd puzzle or <br/>\ngame pieces I came across, not tell people where I was going or when I&#39;d be <br/>\nback, play music loudly if it&#39;s something I like that others don&#39;t like...    Oh I <br/>\ncould go on, but having that checklist inside me keeps me alert to who to be. <br/>\n   And so I don&#39;t drink a lot, I get toilet paper before we&#39;re out, I keep <br/>\nthe dog fed (and others help willingly), I never throw things away without <br/>\nasking, I try to keep games and puzzles intact, I am considerate about movies and <br/>\nmusic and leave a note if I&#39;m going somewhere (or tell people, if they&#39;re awake <br/>\nand home).    I learned those things from knowing what it feels like to wish <br/>\nI had them.<br/>\n<br/>\nI try to give my children what I wish I had had, or at least I offer it.   I <br/>\ntry to do for them what I was glad people did for me when I was growing up.   <br/>\nI watch them for clues, needs, desires, curiosities, interests, and I feather <br/>\nthe next with what they seem to lack.<br/>\n<br/>\nWhen there&#39;s a disagreement about something, not only does each child learn a <br/>\nlittle (or a lot) about how to avoid it in the future, but I also learn what <br/>\nI could do to help them have more space or opportunity to avoid such <br/>\nfrustrations &quot;next time&quot; (preventing many &quot;next times&quot; as we go).<br/>\n<br/>\nI chose to live with my husband.   I chose to have children.    Holly didn&#39;t <br/>\nchoose to live with Kirby.   Kirby didn&#39;t choose to live with Marty.    They <br/>\ndon&#39;t have to maintain a relationship for the rest of their lives.   I think <br/>\nthey will choose to do so, but they don&#39;t have the legal or social obligation I <br/>\nhave to Keith and that I have to each of them.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":107522,"nextTopicId":107475}}