{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":111436570,"authorName":"lurningathome@aol.com","from":"lurningathome@...","profile":"tolearnwithfreedom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Digest Number 2250....history","postDate":"1029448284","msgId":41211,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGYyLjIwMjhlNzJmLjJhOGQ3YzVjQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":41210,"nextInTime":41212,"topicId":41211,"numMessagesInTopic":0,"msgSnippet":"In a message dated 8/15/2002 3:01:43 PM Central Daylight Time, ... Scalping was taught to them...... I have read many books on the subject of native history","messageBody":"<div id=\"ygrps-yiv-707054017\">In a message dated 8/15/2002 3:01:43 PM Central Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; scalping  <br/>\n<br/>\n<br/>\n </span></blockquote>Scalping was taught to them...... I have read many books on the subject of <br/>\nnative history (real books not the ones that are.....we you know, from people <br/>\nwith other agendas). <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://ct.essortment.com/historyscalpin_rdrp.htm\">http://ct.essortment.com/historyscalpin_rdrp.htm</a><br/>\nThe history of Indian and European scalping <br/>\n<br/>\nHow did the Indians start scalping their victims? Very simply, they learned <br/>\nit from the European settlers. A few Indian tribes had practiced scalping to <br/>\na very limited extent before the Europeans arrived. More often than not, <br/>\nscalping was practiced as a response in kind. The Eurpoeans had taught them, <br/>\nfirst hand, the horror of viewing the mutilated remains of their families and <br/>\nfriends after an attack by white settlers. By inflicting the same mutilation <br/>\non their enemies they had hoped to stem the onslaught of these white settlers <br/>\nthat were invading their land. To some Indians,if the attacks could not stop <br/>\nthe whites, at least it would send the message that they were prepared to be <br/>\nas unscrupulous as the Europeans. The Iroquois in particular, used scalping <br/>\nto this purpose. <br/>\n In the 11th century, the Earl of Wessex scalped his enemies. When the <br/>\nEnglish and the Dutch came to the new world they brought the custom with <br/>\nthem. This activity was brought not so much as an official method of warfare, <br/>\nbut as a bounty to ease the anger of the frontiersmen. The western border of <br/>\nthe colonies was being populated with settlers that were comprised of a <br/>\ndubious lot. They were outlaws and runaways. With them they brought disease <br/>\nand alcohol. The frontier was a breeding ground for conflict with the Indian <br/>\npopulation. Initially the frontiersmen turned on the Indians in an attempt to <br/>\nmove them off the land. When the Indians retaliated, the settlers turned to <br/>\nthe government for help. The settlers demanded retribution for the Indian <br/>\nreprisals. The Dutch, and soon after the English, government created the <br/>\nscalp bounty as a means to pacify the settlers. Simply, they paid a fee for <br/>\neach scalp that was delivered to the locally appointed magistrate. Although <br/>\nthe army was accomplishing the task of displacing the Indians, the bounty <br/>\nencouraged settlers to mount attacks on the Indians whenever they could. In <br/>\n1703, Massachusetts paid 12 pounds for an Indian scalp. By 1723 the price had <br/>\nsoared to 100 pounds. To the frontiersmen, it did not matter if the scalp <br/>\ncame from an Indian or a white man. All that mattered was the bonus. The <br/>\npractice eventually became widespread. The French used the bounty on scalps <br/>\nto eradicate a peaceful tribe in Newfoundland. During the French and Indian <br/>\nWars, the English offered their troops a bounty of 200 pounds for the scalp <br/>\nof the chief of the Delaware tribe, Shinngass. This was 25 times the price <br/>\nthat they offered their Indian allies for the scalp of a French soldier. This <br/>\npractice of paying a bounty for Indian scalps continued into the 19th century <br/>\nbefore the public put an end to the practice. This practice of paying a scalp <br/>\nbounty inspired a widespread retaliation from the Indians. White frontiersmen <br/>\nwould scalp not only the warriors but also the women and the children. In <br/>\nmany cases the scalp was not even taken from an Indian. The government could <br/>\nnot tell the difference. However, the Indians were blamed for initiating the <br/>\npractice, because no European would stoop so low as to take a scalp. It <br/>\nshould also be noted that only the Indians were held accountable for the <br/>\npractice. <br/>\n<br/>\nAuthor&#39;s name omitted by request<br/>\n<br/>\n    <br/>\n    <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":41208,"nextTopicId":41212}}