{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] an old post about helping settle fights","postDate":"1075821309","msgId":90163,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFjMi4xNDg4ZWY3NS4yZDUxMTRmZEBhb2wuY29tPg=="},"prevInTopic":90147,"nextInTopic":0,"prevInTime":90162,"nextInTime":90164,"topicId":90095,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/3/04 5:40:27 AM, fetteroll@earthlink.net writes:  ","messageBody":"<div id=\"ygrps-yiv-1584063452\">In a message dated 2/3/04 5:40:27 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a> writes:<br/>\n<br/>\n&lt;&lt; Was it this one? I have a lot of those sibling conflict type posts of yours<br/>\nsaved  &gt;&gt;<br/>\n<br/>\nYES!!!  Thank you, thank you, thank you!!!<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] an old post about helping settle\tfights","postDate":"1075812420","msgId":90147,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJDNDUwMjc0LjI0MzhGJWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDY2LjNiZjEyNmViLjJkNGZkMTFlQGFvbC5jb20+"},"prevInTopic":90095,"nextInTopic":90163,"prevInTime":90146,"nextInTime":90148,"topicId":90095,"numMessagesInTopic":0,"msgSnippet":"... Was it this one? I have a lot of those sibling conflict type posts of yours saved since it makes so much sense when yoy say it and it s alien territory to","messageBody":"<div id=\"ygrps-yiv-634530044\">on 2/2/04 11:13 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I got this by e-mail.  I do remember doing a long description of how I help<br/>\n&gt; Kirby and Marty when they have a disagreement, but I don&#39;t remember if it was<br/>\n&gt; here or on unschooling.com.  If anyone happens to remember where, or the<br/>\n&gt; topic, <br/>\n&gt; or had maybe saved it please let me know at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a><br/>\n&gt; <br/>\n&gt; Thanks!<br/>\n<br/>\n </span></blockquote>Was it this one? I have a lot of those sibling conflict type posts of yours<br/>\nsaved since it makes so much sense when yoy say it and it&#39;s alien territory<br/>\nto me (since I only have one) ;-)<br/>\n<br/>\nIf this isn&#39;t it, I can keep looking.<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\nIn a message dated 2/2/03 2:49:25 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:wanderfree@...\">wanderfree@...</a> writes:<br/>\n<br/>\n -=-I can&#39;t just let it go because there seems to be no natural consequence<br/>\nfor hitting. -=-<br/>\n<br/>\nI&#39;ve told kids from time to time when it was fast and severe that if they do<br/>\nNOT learn to control their tempers they could end up in prison or dead.<br/>\nBecause just in brief, the natural consequences of being a violent adult are<br/>\noften retaliatory violence or conviction of a crime.<br/>\n<br/>\nFor little kids at home, I separate them.  A trick I learned as a Jr. High<br/>\nteacher has served well.  To break up a fight, grab the loser and remove<br/>\nhim.   He WANTS to be saved.  If you grab the winning participant, you<br/>\nmight get  hurt.  If you remove the underdog, they both save face.  He can<br/>\nthink he  wouldn&#39;t have necessarily lost.  The winner still thinks he won.<br/>\n<br/>\nI talk to the apparent victim first.  Sometimes it turns out he wasn&#39;t such<br/>\na  victim.  But In our case at home, with my boys, that has usually been<br/>\nMarty,  who&#39;s younger by two and a half years.  At the moment they&#39;re 16 and<br/>\n14 and  physical problems might be over.  Kirby&#39;s learned enough karate that<br/>\nhe&#39;s  developed the self control that ideally comes with being able to<br/>\nseriously  hurt someone.  And they&#39;re both verbal, so physical isn&#39;t their<br/>\nfirst  thought.  So what I&#39;m going to tell is a summary of various things<br/>\nover the  years when they were younger, in various stages.<br/>\n<br/>\nWhat has worked best is taking the one away and letting him tell me what<br/>\nhappened.  While he&#39;s calming down and stating his case, I&#39;m asking him what<br/>\nhe did to try to make things better.  &quot;Did you think of doing this?&quot;  &quot;No,&quot;<br/>\nor &quot;Yes, but it didn&#39;t work.&quot;<br/>\n<br/>\nSo partly it&#39;s a session in possibilities.   Then that kid&#39;s calmer.  But I<br/>\nremind them that I&#39;m responsible for seeing that BOTH of them are safe in<br/>\ntheir own homes, and happy.<br/>\n<br/>\nThen I go to the other kid (usually Kirby) who&#39;s calm by then too, and ask<br/>\nfor his side.  He tells me the whole thing, and I ask him at the end (since<br/>\nI&#39;m wanting his whole story to compare to the other whole version) whether<br/>\nhe  doesn&#39;t think he could have prevented it by this or that.<br/>\n<br/>\nThen I say &quot;Marty says you said/did this.&quot;<br/>\n<br/>\nUnfortunately in many of the scenarios, Marty had sneaked up close enough to<br/>\nhear and jumped in with &quot;I DID NOT!&quot; so I have to go and deposit Marty<br/>\nelsewhere and say later &quot;That really didn&#39;t help me convince him, y&#39;know.&quot;<br/>\n<br/>\nSo Kirby tells me his version of the evils Marty contributed to the<br/>\nargument.   <br/>\n<br/>\nI remind Kirby he&#39;s older and has a responsibility to show some maturity and<br/>\nset an example (as appropriate, if appropriate).  And I tell him yada yada,<br/>\nMarty needs to be safe in his own home, and not feel like his life is ruined<br/>\nbecause he has an older brother who&#39;s bullying him (if appropriate...)<br/>\n<br/>\nFinally I&#39;d go back to Marty and say &quot;Why didn&#39;t you tell me this part?&quot;<br/>\nor  &quot;Kirby says you threw this/said this...&quot;  And I go through it again with<br/>\nMarty.  <br/>\n<br/>\nI know lots of people say to let kids work out their own stuff but I think<br/>\nit&#39;s lazy at best and sadistic at worst.  My parents raised two cousins of<br/>\nmine and one was mean and violent and frustrated and hurt both me and my<br/>\nsister.  There should have been more active supervision and peace making and<br/>\nadvisement.  <br/>\n<br/>\nI know some people believe each soul chose their family and they need to<br/>\nlearn to work out their own interactions.  I think it&#39;s random, personally.<br/>\nI don&#39;t think any one of my kids needs to be the material on which another<br/>\nkid works out his karma unchecked anyway.<br/>\n<br/>\nSo in the interest of helping them develop a set of alternative responses<br/>\nand  social skills, and keeping them safe, I let each tell his story in<br/>\nprivate  instead of in front of the other.  It cuts out arguments instead of<br/>\nturning a  little argument into a big one (Jerry Springer show style, in<br/>\nworst cases).   And it lets each kid vent to me about his frustrations about<br/>\nthe other one.   They NEED to express that.  Better to me than to friends<br/>\noutside the family,  I think.  Because in this case they have a lot of<br/>\nmutual friends.  It&#39;s to  the benefit of lots of people for them to be<br/>\nsociably at peace.  And it lets  me commiserate with them about the flaws of<br/>\nthe sibling and to tell them how  hard it is to be a parent and to love both<br/>\nkids but to see when one is being  hurt without me saying in front of one<br/>\n&quot;Yeah, I know it can be a drag&quot; in  front of the other one.<br/>\n<br/>\nThat might not be clear.  It&#39;s not that I&#39;ll say to Marty &quot;Yeah, Kirby<br/>\nsucks,  doesn&#39;t he?&quot;  It&#39;s more like &quot;Marty, I really did want to have you.<br/>\nI LOVE  you.  And things would be different if you were the oldest.  I&#39;m<br/>\nsorry it  frustrates you.  But I was an oldest and there are disadvantages<br/>\nto that  too.&quot;   It helps the relationship between me and each child for me<br/>\nto be able  to discuss the emotions and reactions in some depth with them.<br/>\n<br/>\nOn verbal abuse, one thing that has worked here is to remind them that it&#39;s<br/>\ntheir own reputation and self/soul that they&#39;re hurting when they&#39;re mean.<br/>\nIf someone is cruel, it makes him a cruel person.  It might hurt the other<br/>\nkid too, but it immediately hurts the one who was mean for meanness sake.<br/>\nAnd it disturbs the peace of the others around them.  If two kids are<br/>\nfighting, the other kid isn&#39;t having peace either.<br/>\n<br/>\nGood luck!  I wish you could get back to San Diego and to the situation you<br/>\nhad before.  I hope things get better for you soon.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"an old post about helping settle fights","postDate":"1075738398","msgId":90095,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY2LjNiZjEyNmViLjJkNGZkMTFlQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":90147,"prevInTime":90094,"nextInTime":90096,"topicId":90095,"numMessagesInTopic":0,"msgSnippet":"I got this by e-mail.  I do remember doing a long description of how I help Kirby and Marty when they have a disagreement, but I don t remember if it was here","messageBody":"<div id=\"ygrps-yiv-342603869\">I got this by e-mail.  I do remember doing a long description of how I help <br/>\nKirby and Marty when they have a disagreement, but I don&#39;t remember if it was <br/>\nhere or on unschooling.com.  If anyone happens to remember where, or the topic, <br/>\n or had maybe saved it please let me know at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a><br/>\n<br/>\nThanks!<br/>\n<br/>\n-=-Sandra, I remember reading a post of yours a year or so ago where you <br/>\ndescribed how you handled it when your kids were fighting. Seems like it was <br/>\nmostly Marty and Kirby you were talking about. You had a way of helping the <br/>\nunderdog not feel so much the underdog and a way to help the big dog not feel <br/>\noutnumbered either. A good friend of mine is really bothered by how much her kids <br/>\nfight and I wanted to send her the post but can&#39;t find it. -=-<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":90156,"nextTopicId":90048}}