{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Covert","from":"Covert &lt;covert@...-net.ne.jp&gt;","replyTo":"LIST","senderId":"Qy4Izn9fWo87Nv4zlpMzpy8ud2gqe1IlHK2tWZaXT1393K6wA8MKsRK1E-O7NHaIBSjugXwF47A9tRsqAVa0pqDRAMN_2Hk","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Homelearning in Japan article!","postDate":"962247044","msgId":10198,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDAwNjI5MDI0MS5MQUEyNDAxMEBtYWlsLndhMi5zby1uZXQubmUuanA+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":10197,"nextInTime":10199,"topicId":10198,"numMessagesInTopic":0,"msgSnippet":"Hi everybody, Great news from the Far Eastern front: An EXCELLENT article on home-based learning appears today in a major Japanese newspaper! You can see the","messageBody":"<div id=\"ygrps-yiv-1433728350\">Hi everybody,<br/>\n<br/>\nGreat news from the Far Eastern front: An EXCELLENT article on home-based <br/>\nlearning appears today in a major Japanese newspaper!<br/>\n<br/>\nYou can see the Japan Times article on the paper&#39;s website at:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.japantimes.co.jp/cgi-bin/getarticle.pl5?fl20000629a2.htm\">http://www.japantimes.co.jp/cgi-bin/getarticle.pl5?fl20000629a2.htm</a><br/>\n<br/>\nHowever, the article is just too good to pass up sharing with others, so <br/>\nI&#39;ll take the liberty of posting it here. The writer, Carol Hui, does a <br/>\nsuperb job of framing the current conditions of Japan&#39;s homelearning <br/>\nenvironment -- especially regarding the motivations of Japanese <br/>\nhomelearners vs. foreign-resident ones. This is one of the few stories on <br/>\nhomelearning that I&#39;ve seen in Japan by the English-language press.<br/>\n<br/>\nKudos to Ms. Hui for a job well-done!<br/>\n<br/>\nThis article, while it stands solidly on its own merits, should be viewed <br/>\nin the bigger picture of media coverage of homelearning issues in Japan: <br/>\nThe Japanese press, as I&#39;ve been pointing out, is generally treating the <br/>\nidea and practice of homelearning in Japan these days with a high degree <br/>\nof seriousness and respect not ususally found in other areas of news <br/>\ncoverage in this country. This is a very good sign.<br/>\n<br/>\nThe homelearning community in Japan faces many struggles ahead, <br/>\nobviously, but articles like this help tremendously in spreading the word <br/>\nin a positive way.<br/>\n<br/>\nWho said media coverage of homelearning couldn&#39;t be done well? Pass *this <br/>\none* around!<br/>\n<br/>\nBrian Covert<br/>\n(KnoK NEWS)<br/>\nin Osaka, Japan<br/>\n<br/>\n---------------------------------------<br/>\n<br/>\n[JAPAN TIMES - Thursday, 29 June 2000]<br/>\n<br/>\n<br/>\nMaking home a school away from school <br/>\n<br/>\n<br/>\nBy CAROL HUI <br/>\n<br/>\n<br/>\nA typical day at school for 12-year-old Sophie Kimura could be a social <br/>\nstudies lesson which involves finding out what life is like in Illinois <br/>\nwhere her &quot;e-pal&quot; Dawn lives.<br/>\n<br/>\nOr it could be spent expanding her vocabulary skills by reading the <br/>\nlatest adventure of Harry Potter. It could also be used to write a review <br/>\nof a Marc Chagall exhibit for Kidstown.global, a Web site produced by <br/>\nchildren.<br/>\n<br/>\nWhat Sophie ends up doing that day largely depends on herself. &quot;I&#39;m my <br/>\nown teacher,&quot; she explains.<br/>\n<br/>\nFor the last two years, Sophie has been a homeschooler after attending a <br/>\npublic Japanese school until the third grade. Her mother, Katherine <br/>\nCombs, felt that kids in the later elementary years do not have enough <br/>\ntime to spend with their families, due to mandatory participation in <br/>\nclubs. After teaching English in Japan for over 14 years, Combs also <br/>\nobserved that the Japanese school system did not teach students, <br/>\nespecially girls, self-expression.<br/>\n<br/>\nHoning Sophie&#39;s communication skills -- from being able to speak with <br/>\nadults to writing down her opinions -- was a major educational <br/>\nmotivation. While these skills take time for students in any educational <br/>\nsystem to develop, the more easily achievable goal of raising Sophie&#39;s <br/>\nEnglish reading and writing abilities to native fluency was reached <br/>\nsurprisingly quickly. Sophie has the answer why: &quot;You get to study what <br/>\nyou want.&quot;<br/>\n<br/>\nIt is impossible to gauge the number of students being homeschooled in <br/>\nJapan because of the various forms that type of schooling takes. Some <br/>\nfamilies simply supplement their children&#39;s school education with the <br/>\nteaching of subjects such as language or religion, while others instruct <br/>\ntheir children entirely at home.<br/>\n<br/>\nDepending on the educational goals set by each family, the style of <br/>\nhomeschooling also differs radically. Some use a standardized curriculum <br/>\nthat corresponds to a particular school system. Materials based on <br/>\ndevelopment, not age, are there to help parents individualize their <br/>\nchildren&#39;s learning capabilities. Some, like Sophie, are &quot;unschooled&quot; -- <br/>\nshe does not follow any particular curriculum but learns by going on <br/>\nfield trips and writing and reading about topics she finds interesting.<br/>\n<br/>\nHomeschooling is not a new trend and has always been practiced by foreign <br/>\nparents in Japan, particularly those on Christian missions. However, as <br/>\nthe foreign community grows and diversifies, parents are homeschooling <br/>\nfor a wider variety of reasons, and it is becoming an appealing <br/>\nalternative to the expense and exclusivity of international schools.<br/>\n<br/>\nSingaporean Aileen Kawagoe laments the price tag of a quality education <br/>\nin Japan. &quot;In Singapore, it would only cost a fraction of what <br/>\ninternational schools do here,&quot; she says. To ensure that her son is <br/>\nbilingual and has a global perspective on life, she supplements his <br/>\nJapanese education with afterschooling at home.<br/>\n<br/>\nKawagoe shares her extensive research on homeschooling and other <br/>\neducational issues in Japan in an informative newsletter, which covers <br/>\neverything from comparisons of preschools using the Montessori and <br/>\nWaldorf methods to bullying prevention tactics. The newsletter is <br/>\nfeatured on a Web site Combs set up last October in an attempt to reach <br/>\nout to other homeschooling practitioners in Japan. The site also includes <br/>\ninformation on events, resources and suggested educational outings.<br/>\n<br/>\nThe majority of practitioners, both children and parents, seem to enjoy <br/>\nthe homeschooling experience. Joseph Jones, who homeschools the older <br/>\nfive of his seven children, is committed to this style of teaching. As a <br/>\nmissionary for 10 years, he often worked as a private tutor.<br/>\n<br/>\n&quot;This experience showed me the tremendous potential of being able to mold <br/>\nchildren in a life that is free of peer pressure and more supportive of <br/>\ntheir individual interests. I can instill in them a biblical attitude of <br/>\nnot living for yourself but helping one another and showing concern for <br/>\nthe disadvantaged by your actions.&quot; His children like not having to wake <br/>\nup early in the morning.<br/>\n<br/>\nFor homeschooling parents, the biggest challenge is to provide <br/>\ninteresting material constantly to stimulate their children. The School <br/>\nSupport Service of the Christian Academy in Higashi Kurume has been an <br/>\nessential resource in providing material and support for parents.<br/>\n<br/>\nHomeschooling is also done by Japanese parents, but it is often a <br/>\nreactive decision propelled by circumstances such as bullying or school <br/>\nrefusal. For many foreign parents who school at home, it is a proactive <br/>\nchoice intended to enhance their children&#39;s education.<br/>\n<br/>\nA major difference is that many foreign universities recognize <br/>\nalternative forms of education and base entrance on aptitude test scores, <br/>\nnot high school pedigrees. This remains a major advantage for <br/>\nhomeschooling in English. The stigma of homeschooling in Japanese means <br/>\nthat it is difficult (though not impossible) to enter Japanese <br/>\nuniversities without the conventional credentials. As pressure increases <br/>\nto develop more open policies, this is also changing.<br/>\n<br/>\nCombs feels Japanese parents should have more confidence in teaching <br/>\ntheir own children, especially if they have concerns about the Japanese <br/>\nschool system.<br/>\n<br/>\n&quot;I hear many mothers who say that they could not possibly teach,&quot; she <br/>\nsays. &quot;It&#39;s much easier if you take the attitude of learning along with <br/>\nyour children. I feel no pressure to provide all the answers in every <br/>\nsubject myself, but I do present learning as fun. I believe all knowledge <br/>\nis connected and one thing will lead to another, so I&#39;m enjoying the <br/>\nwonder of discovery along with my children.&quot;<br/>\n<br/>\nFor Kawagoe&#39;s newsletter and more information on homeschooling and other <br/>\neducational issues in Japan, see the Web site at:<br/>\n<br/>\nwww2.gol.com/users/milkat/<br/>\n<br/>\n<br/>\n[(C) The Japan Times: June 29, 2000]</div>","specialLinks":[]}],"prevTopicId":10194,"nextTopicId":10207}}