{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":134300842,"authorName":"Brenda Rose","from":"&quot;Brenda Rose&quot; &lt;rosebl@...&gt;","profile":"homeanduva2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: A Clean House (was Allowances, etc)","postDate":"1088004463","msgId":95894,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMzMwMWM0NTkzNiRhMGQxYjMyMCQ2NDAxYThjMEBCcmVuZGE+","referencesHeader":"PDEwODc5Nzg3NTQuNjM5LjQ1MTU4Lm0xMkB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":95893,"nextInTime":95895,"topicId":95894,"numMessagesInTopic":0,"msgSnippet":"Glena, I m so sorry that happens.  I feel like you in that what is important to me is the people - especially my own family!  I remember years ago we went to ","messageBody":"<div id=\"ygrps-yiv-2126520256\">Glena,<br/>\n<br/>\nI&#39;m so sorry that happens.  I feel like you in that what is important to me<br/>\nis the people - especially my own family!  I remember years ago we went to<br/>\nmy BIL&#39;s for Christmas.  They had a lot of the family staying with them, so<br/>\nnot enough beds for everyone.  My SIL thought we would be more comfortable<br/>\nat a house, in beds, fewer sharing the bathroom, etc., so she had us stay at<br/>\nthe house of one of their friend&#39;s.  It was like a mansion to us, very<br/>\nluxurious, but I was afraid of the children touching anything.  The worst<br/>\npart of it was that our family felt left out, like from late night,<br/>\nsit-around discussions and other little things that mean so much in making<br/>\nmemories.  My husband especialy wanted to stay up late and talk to his<br/>\nbrother and mom, whom he only saw about once a year.  So even though my SIL<br/>\ndid it for really kind reasons, plus some practical such as the bathroom<br/>\nneeds, it left us feeling outside the group.  We would much rather have just<br/>\nslept on the floor of the den in sleeping bags.   But not everyone is like<br/>\nthat.  I don&#39;t think my in-laws would enjoy it if that&#39;s what we offered<br/>\nthem when they came to visit us. Actually, except for one time that they<br/>\nspent the night with us and slept on a hide-a-bed, they always stayed with<br/>\ntheir friends who had really big houses with lots of extra bedroom space.<br/>\nOh, well.  It&#39;s not always even a clean house, but sometimes just<br/>\nexpectations of comfort that put barriers between people and how they choose<br/>\nto live.  I&#39;d rather have space on a couch (I can&#39;t do the floor very well<br/>\nanymore) and stay at someone&#39;s home than to be away and miss out on spending<br/>\ntime together.  That&#39;s how my children are, too, and I&#39;m really thankful.<br/>\n<br/>\nBrenda</div>","specialLinks":[]}],"prevTopicId":95762,"nextTopicId":95895}}