{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":65,"messages":[{"userId":151819905,"authorName":"barbaramatessa","from":"&quot;barbaramatessa&quot; &lt;bjelwell@...&gt;","profile":"barbaramatessa","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Empathy was Optimism was Re: Learning is Learning","postDate":"1351361441","msgId":69458,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGs2aDgzMSttdHVzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDk1MUMwMDdELTc3MUYtNDEwRi1BOEUwLTg2RUJCMTIwRkE0REBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":69457,"nextInTopic":69460,"prevInTime":69457,"nextInTime":69459,"topicId":69403,"numMessagesInTopic":0,"msgSnippet":"==What does it look like when people are compassionate and empathetic -- but not conspiratorial -- with pessimistic or complaining people?== I find compassion","messageBody":"<div id=\"ygrps-yiv-1026505411\">==What does it look like when people are<br/>\ncompassionate and empathetic -- but not conspiratorial -- with pessimistic or<br/>\ncomplaining people?==<br/>\n<br/>\nI find compassion and empathy much easier to practice than optimism, so how to practice both is a very good question.  My observation is that the people I know who are very optimistic are less skilled in empathy.  The rare person is gifted in both, and what a joy that is to be around.<br/>\n<br/>\nI&#39;ve found the work of Marshall Rosenberg and Non Violent Communication very helpful in responding with empathy to internal or external conflict.  NVC is a language of compassion based on awareness of feelings and needs.  As humans, we share the same feelings and needs, although they are different depending on the situation.  The trick is to be very curious about what feelings and needs are present in one&#39;s self or others at any given time.  Not to assume, but to be present and curious.<br/>\n<br/>\n== That might be part of the problem, too.   If you believe that every person&#39;s struggle/thoughts/reactions are equally valid, you will find it difficult to choose among them.==<br/>\n<br/>\nAccording to the language of NVC, it&#39;s desirable to see all feelings and needs as equally valid.  That&#39;s the place of empathy.  Strategies to meet those feelings and needs are NOT equally valid.  Some are violent, including conventional parenting strategies.  <br/>\n <br/>\n<br/>\n==If it&#39;s not possible for a change of thoughts and choices to make life better, then there&#39;s no reason on earth to discuss any of that.==<br/>\n<br/>\nAgain, I think the distinction between choices/strategies and the feeling/need is a worthwhile one.  <br/>\n <br/>\nI think what often prevents people from making the less violent choice is lack of empathy for themselves.  Naomi Aldort writes about her SALVE method, which includes the parent taking time to respond to their own triggered self with empathy.  If that doesn&#39;t happen, it&#39;s pretty difficult to respond to our children with empathy.<br/>\n<br/>\nA couple of days ago I shared the drama of my son&#39;s shoes.  If I had taken a minute to give myself some empathy in the midst of my baby crying and our rush to get out the door, I might have responded differently to his wanting to wear sandals.  <br/>\n<br/>\nInstead of my automatic negative script, I might have said something like...&quot;I&#39;m feeling very stressed and anxious.  Katie is crying and we need to get Andy to his program.  What do I need?  Cooperation, peace, etc... What choices do I have?&quot;  The work Sandra and others have done around priorities would have been helpful here, too.  Was my priority to get to the program on time?  No, that&#39;s a pretty schoolish mindset.  My priority is our relationships.<br/>\n<br/>\nI guess the belief that everyone&#39;s feelings and needs can be met is a rather optimistic outlook.  My problem is translating this into a general sense of joy de vivre, which I lack.  <br/>\n<br/>\nBarbara</div>","specialLinks":[]},{"userId":247112349,"authorName":"michelle_m29","from":"&quot;michelle_m29&quot; &lt;mmarr@...&gt;","profile":"michelle_m29","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Optimism was Re: Learning is Learning","postDate":"1351361178","msgId":69457,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGs2aDdxcSs0MDF1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBT09UYVhQPT1BS2FWZHgwZC1QRFBYTmRUUXROcUJvaEx6PVd1NXdKOXRIRFpMSEc3d0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":69453,"nextInTopic":69458,"prevInTime":69456,"nextInTime":69458,"topicId":69403,"numMessagesInTopic":0,"msgSnippet":"I have (had?) a friend who is so negative that I just don t want to deal with it any more. The straw that broke the camel s back was the day she told me that","messageBody":"<div id=\"ygrps-yiv-1529349875\">I have (had?) a friend who is so negative that I just don&#39;t want to deal with it any more. The straw that broke the camel&#39;s back was the day she told me that &quot;the universe doesn&#39;t want (or won&#39;t let - I can&#39;t remember the exact choice of words) me (her not me) to be happy.&quot; <br/>\n<br/>\nLast week, it was my eight year old&#39;s birthday and my husband had to work a twelve hour shift, so it was my job to come up with an adventure for the family. (If hubby is home on birthdays, we usually do something bigger than I can pull of on my own.)  Teenage Daughter and I decided on a pumpkin patch about sixty miles from home that has mazes and a zip line and a whole ton of different activities. <br/>\n<br/>\nThe day was getting closer and the weather predictions were getting steadily worse.  I usually don&#39;t get scared off by the weather forecast, but since we had to drive so far and admission for the whole family was going to be fairly expenseive, I was stressing about spending so much money on something we might not be able to even do. And my daughter had invited a friend (the plan was for the girls to go do their own thing so I could focus on the boys), so I had the pressure of maybe cancelling at the last minute and messing up that family&#39;s plans... I was ready to just give up on the whole idea.<br/>\n<br/>\nMy daughter wouldn&#39;t let me. According to her it was going to be just fine, we&#39;d bundle up in warm coats and extra socks and if it poured too hard we&#39;d do things inside.... That girl was not going to admit defeat, even if everyone else over the age of twelve was telling me to give up on the idea. <br/>\n<br/>\nThe day turned out to be absolutely gorgeous. We had to take our coats back to the car because everyone got too warm to wear them, and wound up staying until the pumpkin patch closed. <br/>\n<br/>\nAnd on the way home, it hit me. My friend is convinced that the universe absolutely won&#39;t let her be happy. My daughter is convinced that the universe won&#39;t fail her and that Quinn was going to have his day playing on the zip lines and riding bug trains and jumping on the bounce pillow. Whether we got wet in the process or not. <br/>\n<br/>\nI think I want an attitude like my daugher&#39;s! <br/>\n<br/>\nMichelle</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Optimism was Re: Learning is Learning","postDate":"1351357571","msgId":69453,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk1MUMwMDdELTc3MUYtNDEwRi1BOEUwLTg2RUJCMTIwRkE0REBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEJBWTQwMS1FQVM0NTVBNzNGQjc2OTU1Q0Q4NUNERTI0MTlEN0QwQHBoeC5nYmw+","referencesHeader":"PEJBWTQwMS1FQVM0NTVBNzNGQjc2OTU1Q0Q4NUNERTI0MTlEN0QwQHBoeC5nYmw+"},"prevInTopic":69452,"nextInTopic":69457,"prevInTime":69452,"nextInTime":69454,"topicId":69403,"numMessagesInTopic":0,"msgSnippet":"-=-However, I m really challenged by practicing this same intention with adults doing other types of complaining. What does it look like when people are","messageBody":"<div id=\"ygrps-yiv-172609252\">-=-However, I&#39;m really challenged by practicing this same intention with adults doing other types of complaining. What does it look like when people are compassionate and empathetic -- but not conspiratorial -- with pessimistic or complaining people?-=-<br/>\n<br/>\nWhen you&#39;re thinking about &quot;practicing an intention&quot; instead of choosing and acting, it probably makes it more difficult to see clearly.<br/>\n<br/>\nIf you sunburned easily, and it was better for you to be in shade than sun, or to wear sunscreen and a hat, that wouldn&#39;t be practicing an intention.  It would be avoiding the sun, and being careful not to get a sunburn.<br/>\n<br/>\nBe careful not to let negativity into your life.  It might not mean rejecting friends or wanting them to change.  It might be spending more time with the more cheery friends, limiting your exposure to long tales of sorrow.<br/>\n<br/>\n-=- For example, if people are complaining, whether or not it seems valid to me at the moment (which really is irrelevant, since each person&#39;s struggle is valid in that moment), ...-=-<br/>\n<br/>\nThat might be part of the problem, too.   If you believe that every person&#39;s struggle/thoughts/reactions are equally valid, you will find it difficult to choose among them.<br/>\n<br/>\nPeople can get in a habit of seeing the worst in every situation, and feeling martyrly and mistreated and put-upon.   THAT is what people in this thread are suggesting that unschoolers need NOT to do.  If the people on this list thought that each person&#39;s struggle was valid in that moment, then why have the discussion at all?<br/>\n<br/>\nIf it&#39;s not possible for a change of thoughts and choices to make life better, then there&#39;s no reason on earth to discuss any of that.  But it IS possible. Not all whining is equally valid.  Not all struggle is equally worthy.  A hangover has a cause that can be prevented in the future.  Someone who seems surprised every single month her period starts, as though it&#39;s never happened before, and she isn&#39;t learning to plan in advance for it, should be reminded that it&#39;s going to happen next month too, and to find ways to keep it from impacting everyone she knows.  <br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":504505579,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Optimism was Re: Learning is Learning","postDate":"1351354951","msgId":69452,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBT09UYVhQPT1BS2FWZHgwZC1QRFBYTmRUUXROcUJvaEx6PVd1NXdKOXRIRFpMSEc3d0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PEJBWTQwMS1FQVM0NTVBNzNGQjc2OTU1Q0Q4NUNERTI0MTlEN0QwQHBoeC5nYmw+","referencesHeader":"PEJBWTQwMS1FQVM0NTVBNzNGQjc2OTU1Q0Q4NUNERTI0MTlEN0QwQHBoeC5nYmw+"},"prevInTopic":69451,"nextInTopic":69453,"prevInTime":69451,"nextInTime":69453,"topicId":69403,"numMessagesInTopic":0,"msgSnippet":"On Sat, Oct 27, 2012 at 1:10 AM, Sarah Stone-Francisco ","messageBody":"<div id=\"ygrps-yiv-1234886699\">On Sat, Oct 27, 2012 at 1:10 AM, Sarah Stone-Francisco &lt;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:stone_francisco@...\">stone_francisco@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; However, I&#39;m really challenged by practicing this same intention with<br/>\n&gt; adults doing other types of complaining. What does it look like when people<br/>\n&gt; are compassionate and empathetic -- but not conspiratorial -- with<br/>\n&gt; pessimistic or complaining people?&gt;&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>My sister, whose dearly-loved husband and father of her three children died<br/>\nat 32 years old, is really really good at being super compassionate and<br/>\nkind and very helpful to people dealing with tragedy or difficulty, but not<br/>\nbeing sucked into negativity at all. She had to figure out how not to be<br/>\nseverely depressed after her husband died - she did a lot of inner work at<br/>\nthat time and learned a lot.<br/>\n<br/>\nHer way of handling negativity is that she &quot;does something.&quot; When we were<br/>\nat the hospital last week, for a week, she went to our house and got my<br/>\nyounger daughter to help her pick out DVDs that they thought would be at<br/>\nleast a little distracting for us and she brought them to the hospital. She<br/>\nbrought some really nice body lotion and gave my daughter (who was the one<br/>\nhospitalized) a foot rub. She took me out to dinner for an hour away from<br/>\nthe hospital. While &quot;doing something,&quot; though, she gives off the feeling of<br/>\nan assumption that this is temporary - it will pass. It isn&#39;t dismissive at<br/>\nALL. But it is confidence that we&#39;ll get through it and be okay.<br/>\n<br/>\nSo - I&#39;ve seen her do this many times with other people and not just in<br/>\ntimes of really awful tragedy, but just times of difficulty/unhappiness<br/>\nwith some situation. She &quot;does something.&quot; Often just a very small thing.<br/>\nWe&#39;ll be going out to get a cup of coffee and hang out and she&#39;ll say, &quot;Oh,<br/>\nlet&#39;s stop by so-and-so&#39;s house, I want to drop off this little thing for<br/>\nher because she had a really tough day at work the other day.&quot; It will be<br/>\njust a muffin with a bow tied around it. Something like that.<br/>\n<br/>\nSo she&#39;s VERY compassionate and thoughtful and kind. But, she can seem a<br/>\nlittle coldhearted, too.  She&#39;s sympathetic and does something and then<br/>\nmoves on. That can sometimes mean leaving a situation entirely or it can<br/>\nmean changing the subject. It can mean avoiding and breaking off<br/>\nrelationships with people who are routinely negative. She&#39;s very picky<br/>\nabout friendships. Has no patience with chronic complainers. Keeps people<br/>\nat a distance who are not positive to be around. Sometimes it seems a<br/>\nlittle harsh when she does it. It is really obvious to me that she<br/>\ncarefully protects herself and her life from being sucked in to other<br/>\npeople&#39;s problems and complaints.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":332164648,"authorName":"Rippy and Graham Dusseldorp","from":"Rippy and Graham Dusseldorp &lt;ripgray@...&gt;","profile":"rdusseldorp","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Optimism was Re: Learning is Learning","postDate":"1351333514","msgId":69450,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU5NTlBRUI3LTJDMjItNERDRi1CQzQxLURGQ0REMDk3RThCMkBnbWFpbC5jb20+","inReplyToHeader":"PDAzRDk2REY3QzE0MjRDMTJCMzZEOTU2QkVERTNBNzcxQExhcHB5SFA+","referencesHeader":"PGs2ZTVjNCs2OGNyQGVHcm91cHMuY29tPiA8N0U4REU1RDMtOUFGNy00NzRFLTg0OUItNDg4RUFDMzdERUFGQFNhbmRyYWRvZGQuY29tPiA8MDNEOTZERjdDMTQyNEMxMkIzNkQ5NTZCRURFM0E3NzFATGFwcHlIUD4="},"prevInTopic":69448,"nextInTopic":69451,"prevInTime":69449,"nextInTime":69451,"topicId":69403,"numMessagesInTopic":0,"msgSnippet":"-=- There have been lots of times that I have had to curtail my joy and excitement because it pissed other people off. -=- When I was growing up, I used to get","messageBody":"<div id=\"ygrps-yiv-1946441100\">-=- There have been lots of times that I have had to curtail my joy and excitement because it pissed other people off. -=-<br/>\n<br/>\nWhen I was growing up, I used to get in trouble for being too happy ;-)<br/>\n<br/>\nMy mom would ask, &#39;What are you so happy about&#39;? The unknown source of my happiness confused her, made her suspicious, and/or irritated her. Sometimes I would be punished for making a mess or not doing what I was told. She found it frustrating that even when she took away privileges (friends, toys, t.v., books, telephone), I would still daydream happy thoughts and ideas and not look like I suffered.<br/>\n<br/>\nHaving a daughter that was &#39;happy for no good reason&#39; was stressful for her.<br/>\n<br/>\nI&#39;m different. I am drawn to people who are happy for no good reason. When my optimism and hopefulness took a big dive after my dad died, I sought those people out. One of my friends had lost her dad the year prior and she was very close to him. I noticed she regained her ability to laugh and smile effortlessly. I knew if she could do it, I might be able to do it one day too. I met a waitress who had lost her entire family in the war in Sierra Leone. She found a way to no longer be swallowed up in sadness. She talked about her family with great love and glowed when she spoke. After meeting her, I know that maybe one day I could glow again.<br/>\n<br/>\nRippy<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":234525027,"authorName":"Sarah Stone-Francisco","from":"Sarah Stone-Francisco &lt;stone_francisco@...&gt;","profile":"birdiesmama","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Optimism was Re: Learning is Learning","postDate":"1351325409","msgId":69451,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTQwMS1FQVM0NTVBNzNGQjc2OTU1Q0Q4NUNERTI0MTlEN0QwQHBoeC5nYmw+"},"prevInTopic":69450,"nextInTopic":69452,"prevInTime":69450,"nextInTime":69452,"topicId":69403,"numMessagesInTopic":0,"msgSnippet":"-===- Surround yourself with optimistic happy people.  Do not engage in conversation when people are complaining about their children or husbands.  |If a","messageBody":"<div id=\"ygrps-yiv-56163782\">-===-<br/>\nSurround yourself with optimistic happy people.  Do not engage in conversation when people are complaining about their children or husbands.  |If a friend comes to you to complain about her kids  I try to turn around and point out to them how that characteristic could be good or some other great thing about their children. Or I change the subject. <br/>\n-===-<br/>\n<br/>\nVery good advice and something that I philosophically and practically struggle with. I have practiced this most of my life and have found in adulthood that it has led me to being less accepting of others&#39; struggles.  For example, if people are complaining, whether or not it seems valid to me at the moment (which really is irrelevant, since each person&#39;s struggle is valid in that moment), I tend to want to get the other person to move on, stop complaining, see the bright side, remember that everything works out in the end, see another perspective, etc. However, wanting someone to be where they aren&#39;t or  be different than they are now, feels like it lacks compassion.<br/>\n<br/>\nSomething I&#39;m working on is figuring out how to be compassionate and empathetic to people without getting pulled into their emotional drama or complaints or pessimistic state of expression. <br/>\n<br/>\nOne place I don&#39;t have difficulty countering pessimism or complaining is when people say negative things about children in front of them. I always find an easy, fluid way to give the child a glance and say something about how perfect they are, in a way that excludes neither the parent nor child, but also isn&#39;t confrontationally directed at the parent. I&#39;m not trying to correct anyone, more like counteracting the negativity.<br/>\n<br/>\nHowever, I&#39;m really challenged by practicing this same intention with adults doing other types of complaining. What does it look like when people are compassionate and empathetic -- but not conspiratorial -- with pessimistic or complaining people?<br/>\n<br/>\nlove, sarah</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Optimism was Re: Learning is Learning","postDate":"1351303687","msgId":69448,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEwOEZFQzRELUEzQjAtNDQ4NS05MUY5LTgxQkQyQjRFNDEyQkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDAzRDk2REY3QzE0MjRDMTJCMzZEOTU2QkVERTNBNzcxQExhcHB5SFA+","referencesHeader":"PGs2ZTVjNCs2OGNyQGVHcm91cHMuY29tPiA8N0U4REU1RDMtOUFGNy00NzRFLTg0OUItNDg4RUFDMzdERUFGQFNhbmRyYWRvZGQuY29tPiA8MDNEOTZERjdDMTQyNEMxMkIzNkQ5NTZCRURFM0E3NzFATGFwcHlIUD4="},"prevInTopic":69447,"nextInTopic":69450,"prevInTime":69447,"nextInTime":69449,"topicId":69403,"numMessagesInTopic":0,"msgSnippet":"-=-When I was preparing to marry my husband, I was so excited. I am not sure if I was being a bridezilla or what but my excitement was dashed by a family ","messageBody":"<div id=\"ygrps-yiv-483788698\">-=-When I was preparing to marry my husband, I was so excited. I am not sure if <br/>\nI was being a bridezilla or what but my excitement was dashed by a family <br/>\nmember telling me that I needed to stop talking about it because I might <br/>\nmake one of my siblings jealous. Later, when we bought our first house, I <br/>\nwas advised to not talk about it for the same reasons. There have been lots <br/>\nof times that I have had to curtail my joy and excitement because it pissed <br/>\nother people off. Even now, I am not always comfortable sharing my joy and <br/>\ngratefulness because there are people that will belittle it or try to find <br/>\nways to screw it up.-=-<br/>\n<br/>\nIf you think back to a particular situation though, it might be something about the person who asked you not to talk about it.  It might be partly that there was something in the way you were telling it that belittled someone else in the situation, or was insensitive. <br/>\n<br/>\nIt&#39;s possible to be joyous without hurting other people&#39;s feelings.  It&#39;s also possible to be effusive about something without considering the effect on others.  I didn&#39;t describe our new big house to my brother who was off-and-on homeless, fifteen years ago when we moved.<br/>\n<br/>\nThis week&#39;s episode of The Big Bang Theory is about Howard talking about being in space too much.  He brings it up about every single thing.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.huffingtonpost.com/2012/10/26/big-bang-theory-buzz-aldrin-video_n_2021243.html\">http://www.huffingtonpost.com/2012/10/26/big-bang-theory-buzz-aldrin-video_n_2021243.html</a>   <br/>\nBuzz Aldrin cameos, giving out Halloween candy.  <br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":439465581,"authorName":"Robert and Colleen","from":"&quot;Robert and Colleen&quot; &lt;3potatoes@...&gt;","profile":"trespotatoes","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] Optimism was Re: Learning is Learning","postDate":"1351295066","msgId":69446,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAzMjgwMWNkYjNkMyRkNWMyZmVkMCQ4MTQ4ZmM3MCRAY29tY2FzdC5uZXQ+","inReplyToHeader":"PDMzNjQ5NkFCLUM4MjEtNDY1OC04REJFLTQzNTE3NDZFNzVFQ0BTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGs2ZDJicys3MWtzQGVHcm91cHMuY29tPiA8azZlNWM0KzY4Y3JAZUdyb3Vwcy5jb20+IDwxMzUxMjY0MDcxLjM4NjkxLllhaG9vTWFpbE5lb0B3ZWI4MTUwNy5tYWlsLm11ZC55YWhvby5jb20+IDwzMzY0OTZBQi1DODIxLTQ2NTgtOERCRS00MzUxNzQ2RTc1RUNAU2FuZHJhZG9kZC5jb20+"},"prevInTopic":69437,"nextInTopic":69447,"prevInTime":69445,"nextInTime":69447,"topicId":69403,"numMessagesInTopic":0,"msgSnippet":"****I am aware that some people feel intelligent when they criticize art, music or movies.**** I have never been a fan of Scooby Doo - not when I was little,","messageBody":"<div id=\"ygrps-yiv-1577699625\">****I am aware that some people feel intelligent when they criticize art,<br/>\nmusic or movies.****<br/>\n<br/>\n <br/>\n<br/>\nI have never been a fan of Scooby Doo - not when I was little, and not as I<br/>\ngrew older - wasn&#39;t my &quot;type&quot; of cartoon and simply didn&#39;t appeal to me :-)<br/>\n<br/>\n <br/>\n<br/>\nA few years ago, my now 9 year old son discovered Scooby Doo cartoons on TV<br/>\nand was instantly smitten.  He thought they were absolutely laugh-out-loud<br/>\nfunny, and he wanted to watch the old version of the cartoons, the new ones,<br/>\nand the movies.  I kept my dislike of them and my critical thoughts firmly<br/>\ninside my own head, added everything Scooby Doo I could find to our Netflix<br/>\nqueue, and watched with him.  I didn&#39;t laugh as hard as he did - but I did<br/>\nfind some clever moments and came to appreciate some of the characters and<br/>\nstorylines.  <br/>\n<br/>\n <br/>\n<br/>\nHe hasn&#39;t watched Scooby Doo for quite some time now, having moved on to<br/>\nother interests. But this morning when he asked me if we were still<br/>\nexpecting the giant storm that&#39;s being predicted for our area (that<br/>\nforecasters yesterday had, much to his amusement, termed the<br/>\n&quot;Snor&#39;eastercane&quot;) I told him yes, but that now it was called Frankenstorm.<br/>\nI told him I expected it was going to be quite the storm and said we&#39;d<br/>\nprobably need to start prepping today.  <br/>\n<br/>\n <br/>\n<br/>\nHe thought for no more than a second, and then very excitedly told me:<br/>\n<br/>\n <br/>\n<br/>\n&quot;Mom, Frankenstein is not evil. People just think he&#39;s evil but he&#39;s not -<br/>\nhe&#39;s just trying to be good even though he&#39;s failing.  Even though I haven&#39;t<br/>\nread the book or saw the movie if they make one, I know that pretty much<br/>\nfrom Scooby Doo.  So we have nothing to worry about with the hurricane if<br/>\nnow it&#39;s Frankenstorm because Frankenstein is good.  If we were supposed to<br/>\nbe scared, then they should have picked a better name!&quot;<br/>\n<br/>\n <br/>\n<br/>\nMany, many times in my daily life with my son, I am reminded that there is<br/>\nvalue in so very many things - be those things Scooby Doo or Pokemon or Star<br/>\nWars or Harry Potter or 1,000 other &quot;easy to criticize&quot; forms of media or<br/>\nentertainment.  Life is so much more fun when you look to the happy parts,<br/>\nlook for the good, and keep an open mind :-)<br/>\n<br/>\n<br/>\n<br/>\nColleen <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":506338775,"authorName":"Miriam Pinheiro","from":"Miriam Pinheiro &lt;miriam.pinheiro@...&gt;","profile":"pinheiro.miriam","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Optimism was Re: Learning is Learning","postDate":"1351279015","msgId":69437,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBUHU1UVEyNDdVdSs4RmkwNURQdUhBTGV2UE96NzQrVlEwdGsxV3pHVjlmRkJCOFF6QUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":69436,"nextInTopic":69446,"prevInTime":69436,"nextInTime":69438,"topicId":69403,"numMessagesInTopic":0,"msgSnippet":"Yes, my daughter went to private school until 10th grade and then she did 1/2 of 10th and 11th at a Sudbury School.  In 10th grade she went into a horrible","messageBody":"<div id=\"ygrps-yiv-261038683\">Yes, my daughter went to private school until 10th grade and then she did<br/>\n1/2 of 10th and 11th<br/>\nat a Sudbury School.  In 10th grade she went into a horrible depression<br/>\n(one reason I got her out<br/>\nof the school).  She felt like she did not fit in, etc. She is better now<br/>\nbut still negative...  I have<br/>\nhope for her though! (There&#39;s my optimism again)!<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Optimism was Re: Learning is Learning","postDate":"1351278944","msgId":69436,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI2MTkxRTc1LUU0N0UtNERFOS1CMTZFLTUyQzRGMDlDMzkwNUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PENBT09UYVhNMXk5bU1jY3lEaUJhVGFKTE1kcmJ6eGJwTjRmN2VETFZxMitPTHFKM0ZVQUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PGs2ZDJicys3MWtzQGVHcm91cHMuY29tPiA8azZlNWM0KzY4Y3JAZUdyb3Vwcy5jb20+IDwxMzUxMjY0MDcxLjM4NjkxLllhaG9vTWFpbE5lb0B3ZWI4MTUwNy5tYWlsLm11ZC55YWhvby5jb20+IDxDQU9PVGFYTTF5OW1NY2N5RGlCYVRhSkxNZHJienhicE40ZjdlRExWcTIrT0xxSjNGVUFAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":69435,"nextInTopic":69437,"prevInTime":69435,"nextInTime":69437,"topicId":69403,"numMessagesInTopic":0,"msgSnippet":"-=-Quite a few times when someone has been going on and on relating negative stuff about their kid, I ve said something positive and the parent has reacted","messageBody":"<div id=\"ygrps-yiv-37984583\">-=-Quite a few times when someone has been going on and on relating negative<br/>\nstuff about their kid, I&#39;ve said something positive and the parent has<br/>\nreacted with tears and saying, &quot;That&#39;s the first nice thing anybody has<br/>\nsaid about my kid in years.&quot;-=-<br/>\n<br/>\nWow.<br/>\n<br/>\nI&#39;ve done it too, when I know the parent and the child, and I defend the child from a flood of complaint, but usually the parent has just kind of blinked at me and said &quot;Oh, you&#39;re right.&quot;  Like it reset them.<br/>\n<br/>\nIt&#39;s a terribly destructive trait, in people to want other adults to praise them for being negative, critical, oppressive and shaming parents.   It happens on this list, too.  Sometimes someone comes here wanting us to do that--to say &quot;Oh, you&#39;re right; parenting it hard; your child is not doing the right things.&quot;  And when we say &quot;But look--you&#39;re causing those problems with your limits and your rules and your own harsh reactions,&quot; then they get angry because we weren&#39;t &quot;supportive.&quot;<br/>\n<br/>\nI want to support people getting to the kind of peace and happiness Pam and Alex are writing about.  I have zero interest supporting anyone in NOT getting there.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: [AlwaysLearning] Optimism was Re: Learning is Learning","postDate":"1351278746","msgId":69435,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBDQUFBQzM3LTMzQjctNDNDRi1BRERCLTczRTIyMjVBRjdCRkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PENBUHU1UVExZ0thb3JoNlBQcVIxbXlmOXN0blpXS21zPXBNVDI9RFBLWlRNWXFjV19VUUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PENBUHU1UVExZ0thb3JoNlBQcVIxbXlmOXN0blpXS21zPXBNVDI9RFBLWlRNWXFjV19VUUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":69434,"nextInTopic":69436,"prevInTime":69434,"nextInTime":69436,"topicId":69403,"numMessagesInTopic":0,"msgSnippet":"-=- However, my 17-year-old daughter is very negative and my father and husband tend to be also.-=- If your daughter went to school, in some cases, school can","messageBody":"<div id=\"ygrps-yiv-242374388\">-=- However, my 17-year-old daughter is very<br/>\nnegative and my father and<br/>\nhusband tend to be also.-=-<br/>\n<br/>\nIf your daughter went to school, in some cases, school can create a situation in which teachers and other kids bring out the darkest worst in a person.  <br/>\n<br/>\nI think there can also be a genetic component, but unschooling can draw each person toward their most optimistic potential. :-)<br/>\nIf not optimistic, at least peacefully at rest.  Not actively critical.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Optimism was Re: Learning is Learning","postDate":"1351273400","msgId":69433,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMzNjQ5NkFCLUM4MjEtNDY1OC04REJFLTQzNTE3NDZFNzVFQ0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDEzNTEyNjQwNzEuMzg2OTEuWWFob29NYWlsTmVvQHdlYjgxNTA3Lm1haWwubXVkLnlhaG9vLmNvbT4=","referencesHeader":"PGs2ZDJicys3MWtzQGVHcm91cHMuY29tPiA8azZlNWM0KzY4Y3JAZUdyb3Vwcy5jb20+IDwxMzUxMjY0MDcxLjM4NjkxLllhaG9vTWFpbE5lb0B3ZWI4MTUwNy5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":69432,"nextInTopic":69434,"prevInTime":69432,"nextInTime":69434,"topicId":69403,"numMessagesInTopic":0,"msgSnippet":"-=-Choose today to be optimistic.  Choose to look at the beauty around you and to see life and people through loving eyes. That is all it takes. -=- Simple,","messageBody":"<div id=\"ygrps-yiv-1802098667\">-=-Choose today to be optimistic.  Choose to look at the beauty around you and to see life and people through loving eyes.<br/>\nThat is all it takes. -=-<br/>\n<br/>\nSimple, but not easy.<br/>\n<br/>\nYou have to do that over and over, many times a day.  But it iwill get easier.   Because each time you give yourself two choices and pick the more positive and beautiful one, you will find it easier to think of two positive choices the next time.  And there will be many more next times.<br/>\n<br/>\nThis is all wonderful:  <br/>\n<br/>\n-=-Surround yourself with optimistic happy people.  Do not engage in conversation when people are complaining about their children or husbands.  |If a friend comes to you to complain about her kids  I try to turn around and point out to them how that characteristic could be good or some other great thing about their children. Or I change the subject. <br/>\n<br/>\n-=-Look at what you have, not what you do not have. If all you focus is in negative things that is all you will see. If you always look for the positive slowly you will, more and more, see the positive and the beauty around you and that will become who you are.-=-<br/>\n<br/>\nI am aware that some people feel intelligent when they criticize art, music or movies.  But if you read those things, it&#39;s very often someone who knows very little thinking they know a lot.  Or someone thinking that if they can list flaws in Star Wars, that it makes them as big as George Lucas.  I get criticism sometimes from people who know little to nothing about me or unschooling, but they feel that if they criticize me, they are equal or better, that they have bested me, or annulled me.  <br/>\n<br/>\nDon&#39;t do that to your children.<br/>\nDon&#39;t do that about their interests, or their jokes, or songs they like.<br/>\nPractice acceptance, and finding the good in what someone does.<br/>\n<br/>\nI was frustrated recently about some very bad advice that was given in public.   But nobody and nobody&#39;s army could ever stem the flow of bad advice in the world.  I need to accept that there is lame and damaging advice out there, and just keep on trying to provide better suggestions.<br/>\nIn my experience, Alex&#39;s summary above is good advice. :-)<br/>\n<br/>\nThere is a saying on t-shirts and such places &quot;If you aren&#39;t outraged, you don&#39;t understand the situation.&quot;   <br/>\nOutrage isn&#39;t a good state to induce, in parents or children.  Let single people be outraged if they want.  Let childless people frolic in outrage.  But parents of children should create a peaceful nest.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":506338775,"authorName":"Miriam Pinheiro","from":"Miriam Pinheiro &lt;miriam.pinheiro@...&gt;","profile":"pinheiro.miriam","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Optimism was Re: Learning is Learning","postDate":"1351273337","msgId":69434,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBUHU1UVExZ0thb3JoNlBQcVIxbXlmOXN0blpXS21zPXBNVDI9RFBLWlRNWXFjV19VUUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":69433,"nextInTopic":69435,"prevInTime":69433,"nextInTime":69435,"topicId":69403,"numMessagesInTopic":0,"msgSnippet":"I am an optimistic person.  However, my 17-year-old daughter is very negative and my father and husband tend to be also. [Non-text portions of this message","messageBody":"<div id=\"ygrps-yiv-2090420557\">I am an optimistic person.  However, my 17-year-old daughter is very<br/>\nnegative and my father and<br/>\nhusband tend to be also.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":504505579,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Optimism was Re: Learning is Learning","postDate":"1351273157","msgId":69432,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBT09UYVhNMXk5bU1jY3lEaUJhVGFKTE1kcmJ6eGJwTjRmN2VETFZxMitPTHFKM0ZVQUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDEzNTEyNjQwNzEuMzg2OTEuWWFob29NYWlsTmVvQHdlYjgxNTA3Lm1haWwubXVkLnlhaG9vLmNvbT4=","referencesHeader":"PGs2ZDJicys3MWtzQGVHcm91cHMuY29tPgk8azZlNWM0KzY4Y3JAZUdyb3Vwcy5jb20+CTwxMzUxMjY0MDcxLjM4NjkxLllhaG9vTWFpbE5lb0B3ZWI4MTUwNy5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":69431,"nextInTopic":69433,"prevInTime":69431,"nextInTime":69433,"topicId":69403,"numMessagesInTopic":0,"msgSnippet":"On Fri, Oct 26, 2012 at 8:07 AM, BRIAN POLIKOWSKY ","messageBody":"<div id=\"ygrps-yiv-1130117301\">On Fri, Oct 26, 2012 at 8:07 AM, BRIAN POLIKOWSKY &lt;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:polykowholsteins@...\">polykowholsteins@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If a friend comes to you to complain about her kids  I try to turn around<br/>\n&gt; and point out to them how that characteristic could be good or some other<br/>\n&gt; great thing about their children.<br/>\n<br/>\n<br/>\n </span></blockquote>Quite a few times when someone has been going on and on relating negative<br/>\nstuff about their kid, I&#39;ve said something positive and the parent has<br/>\nreacted with tears and saying, &quot;That&#39;s the first nice thing anybody has<br/>\nsaid about my kid in years.&quot;<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar","from":"&quot;otherstar&quot; &lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Optimism was Re: Learning is Learning","postDate":"1351272270","msgId":69447,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAzRDk2REY3QzE0MjRDMTJCMzZEOTU2QkVERTNBNzcxQExhcHB5SFA+","inReplyToHeader":"PDdFOERFNUQzLTlBRjctNDc0RS04NDlCLTQ4OEVBQzM3REVBRkBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGs2ZTVjNCs2OGNyQGVHcm91cHMuY29tPiA8N0U4REU1RDMtOUFGNy00NzRFLTg0OUItNDg4RUFDMzdERUFGQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":69446,"nextInTopic":69448,"prevInTime":69446,"nextInTime":69448,"topicId":69403,"numMessagesInTopic":0,"msgSnippet":"... When I was preparing to marry my husband, I was so excited. I am not sure if I was being a bridezilla or what but my excitement was dashed by a family ","messageBody":"<div id=\"ygrps-yiv-2100702215\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;&gt;&gt;People belittled optimism and joy. &lt;&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n </span></blockquote>When I was preparing to marry my husband, I was so excited. I am not sure if <br/>\nI was being a bridezilla or what but my excitement was dashed by a family <br/>\nmember telling me that I needed to stop talking about it because I might <br/>\nmake one of my siblings jealous. Later, when we bought our first house, I <br/>\nwas advised to not talk about it for the same reasons. There have been lots <br/>\nof times that I have had to curtail my joy and excitement because it pissed <br/>\nother people off. Even now, I am not always comfortable sharing my joy and <br/>\ngratefulness because there are people that will belittle it or try to find <br/>\nways to screw it up.<br/>\nI had an awesome discussion with my oldest daughter this morning. She was <br/>\ntelling me how beautiful the world is even with all of the bad stuff that <br/>\nhappens. She said, “I mean, you look up in the sky and you see the clouds <br/>\nand poof, it is all there. It’s amazing and beautiful.” She is so <br/>\ninsightful. She was telling me the other day that she is a happy person. She <br/>\nlikes to joke around but she also likes to be very serious and talk about <br/>\nthings that amaze her or confuse her and she comments that it makes it <br/>\nreally difficult to find people to relate to because so many people are so <br/>\nangsty and unhappy.<br/>\nConnie <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: [AlwaysLearning] Optimism was Re: Learning is Learning","postDate":"1351271007","msgId":69430,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdFOERFNUQzLTlBRjctNDc0RS04NDlCLTQ4OEVBQzM3REVBRkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGs2ZTVjNCs2OGNyQGVHcm91cHMuY29tPg==","referencesHeader":"PGs2ZTVjNCs2OGNyQGVHcm91cHMuY29tPg=="},"prevInTopic":69429,"nextInTopic":69431,"prevInTime":69429,"nextInTime":69431,"topicId":69403,"numMessagesInTopic":0,"msgSnippet":"When I spoke in France this summer, I said there are some places where people actively discourage optimism, and seem to believe that cynicism and criticality","messageBody":"<div id=\"ygrps-yiv-433486680\">When I spoke in France this summer, I said there are some places where people actively discourage optimism, and seem to believe that cynicism and criticality are the same as intelligence, and that in the U.S., that was New York city.  People belittled optimism and joy.    The whole audience started to kind of laugh and look nervously at each other, and smile.  &quot;What?&quot;   They said all of France was that way.<br/>\n<br/>\nI liked the explanation:  School teaches people to question everything.<br/>\n<br/>\nSo if school encourages people not to have faith or acceptance of what they learn in school, that seems quite unstable, culturally and socially.  Or maybe they&#39;re only requiring kid to do a token amount of questioning.<br/>\n<br/>\nCritical thought is good.<br/>\nRejection of every idea tha comes long is as bad as blind acceptance of every idea that comes along.<br/>\n<br/>\nSome people live in happier places than others.  But everyone can learn to make their immediate environment happier and more peaceful.   Families who choose not to do that can find that unschooling doesn&#39;t work for them.  I mentioned that this week on a little video I made for an online collection.   It&#39;s here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.doliferightinc.com/2012/10/25/doing-unschooling-right-video-25-2012-teleconference/\">http://www.doliferightinc.com/2012/10/25/doing-unschooling-right-video-25-2012-teleconference/</a><br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Optimism was Re: Learning is Learning","postDate":"1351264071","msgId":69429,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNTEyNjQwNzEuMzg2OTEuWWFob29NYWlsTmVvQHdlYjgxNTA3Lm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PGs2ZTVjNCs2OGNyQGVHcm91cHMuY29tPg==","referencesHeader":"PGs2ZDJicys3MWtzQGVHcm91cHMuY29tPiA8azZlNWM0KzY4Y3JAZUdyb3Vwcy5jb20+"},"prevInTopic":69427,"nextInTopic":69430,"prevInTime":69428,"nextInTime":69430,"topicId":69403,"numMessagesInTopic":0,"msgSnippet":"    == Would you say you are a naturally optimistic person, or is it something you developed over time as a result of this lifestyle?  Others who have been","messageBody":"<div id=\"ygrps-yiv-2055323201\"> <br/>\n  <br/>\n== Would you say you are a naturally optimistic person, or is it something you developed over time as a result of this lifestyle?  Others who have been on the path awhile, did optimism come naturally?==<br/>\n<br/>\n<br/>\nDecide to no hold on to your pessimism.  Choose today to be optimistic.  Choose to look at the beauty around you and to see life and people through loving eyes.<br/>\nThat is all it takes. <br/>\nSurround yourself with optimistic happy people.  Do not engage in conversation when people are complaining about their children or husbands.  |If a friend comes to you to complain about her kids  I try to turn around and point out to them how that characteristic could be good or some other great thing about their children. Or I change the subject. <br/>\nLook at what you have, not what you do not have. If all you focus is in negative things that is all you will see. If you always look for the positive slowly you will, more and more, see the positive and the beauty around you and  that will become who you are.<br/>\n<br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":526735221,"authorName":"haydee deldenovese","from":"haydee deldenovese &lt;shybarbie22@...&gt;","profile":"shybarbie22","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Optimism was Re: Learning is Learning","postDate":"1351261892","msgId":69431,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBRlpqNytRRjlEQUV6bis1Y242R1RoRXQzX3ExVEZ6ZXVXPWVyalNoaEVDclh3S3pIQUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":69430,"nextInTopic":69432,"prevInTime":69430,"nextInTime":69432,"topicId":69403,"numMessagesInTopic":0,"msgSnippet":"I would have to say that in my case, I was always an optimistic child. Through the years, and with many negative comments to my ways, I became more of a","messageBody":"<div id=\"ygrps-yiv-798579529\">I would have to say that in my case, I was always an optimistic child.<br/>\nThrough the years, and with many negative comments to my ways, I became<br/>\nmore of a pesimist, yet now again, I am back to being my happy optimistic<br/>\nself, and do believe that unschooling has a lot to do with it. Although I<br/>\nam still in the deschooling phase, I do see changes and love what I see...<br/>\ngood luck to you and your family in the unchooling journey!<br/>\n<br/>\nHaydee<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":332901363,"authorName":"keetry","from":"&quot;keetry&quot; &lt;keetry@...&gt;","profile":"keetry","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Optimism was Re: Learning is Learning","postDate":"1351260356","msgId":69427,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGs2ZTVjNCs2OGNyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGs2ZDJicys3MWtzQGVHcm91cHMuY29tPg=="},"prevInTopic":69426,"nextInTopic":69429,"prevInTime":69426,"nextInTime":69428,"topicId":69403,"numMessagesInTopic":0,"msgSnippet":"== Would you say you are a naturally optimistic person, or is it something you developed over time as a result of this lifestyle?  Others who have been on the","messageBody":"<div id=\"ygrps-yiv-1860459027\">== Would you say you are a naturally optimistic person, or is it something you developed over time as a result of this lifestyle?  Others who have been on the path awhile, did optimism come naturally?==<br/>\n<br/>\nI had been a pessimist as long as I could remember. I was not a happy child or a happy adult for a long time. Unschooling has really changed things for me. I am much more optimistic. I actively look for the good in everything, especially my children. <br/>\n<br/>\nAlysia</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Learning is Learning","postDate":"1351252659","msgId":69426,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQwMjVCMzM1LUNGN0YtNDMyMi1BQjhFLTY4RjZBRUExMDc0MUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGs2ZDJicys3MWtzQGVHcm91cHMuY29tPg==","referencesHeader":"PGs2ZDJicys3MWtzQGVHcm91cHMuY29tPg=="},"prevInTopic":69423,"nextInTopic":69427,"prevInTime":69425,"nextInTime":69427,"topicId":69403,"numMessagesInTopic":0,"msgSnippet":"The  next three paragraphs are a quote from Ren Allen s words at http://sandradodd.com/rentalk ... To be whole, to be sound, balanced, joyful, curious...these","messageBody":"<div id=\"ygrps-yiv-878257018\">The  next three paragraphs are a quote from Ren Allen&#39;s words at <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/rentalk\">http://sandradodd.com/rentalk</a><br/>\n----------------------<br/>\n<br/>\nTo be whole, to be sound, balanced, joyful, curious...these are the things I wish for my children. The focus on academic topics and grades seem so irrelevant when contrasted to the really important tools for this life&#39;s journey.<br/>\n<br/>\nPlato said: &quot;The most effective kind of education is that a child should play amongst lovely things.&quot;<br/>\n<br/>\nWhile I agree wholeheartedly, I think he should have said &quot;The most effective kind of education is that PEOPLE should play amongst lovely things.&quot; Learning is for always. Playing amongst lovely things has the power to heal lives, heal families and liberate people. That&#39;s really what unschooling is in a nutshell—playing with lovely things, ideas, people and places. We say &quot;living is learning&quot; but &quot;playing is learning&quot; too.</div>","specialLinks":[]},{"userId":151819905,"authorName":"barbaramatessa","from":"&quot;barbaramatessa&quot; &lt;bjelwell@...&gt;","profile":"barbaramatessa","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Learning is Learning","postDate":"1351224508","msgId":69423,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGs2ZDJicys3MWtzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBT09UYVhOZ29YNHgyZ29QME0xUEdoRWk3R3JZMWpnOGt6K1ZSZ2FKR0NvMCtrWTRhZ0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":69413,"nextInTopic":69426,"prevInTime":69422,"nextInTime":69424,"topicId":69403,"numMessagesInTopic":0,"msgSnippet":"Would you say you are a naturally optimistic person, or is it something you developed over time as a result of this lifestyle?  Others who have been on the","messageBody":"<div id=\"ygrps-yiv-1247970183\">Would you say you are a naturally optimistic person, or is it something you developed over time as a result of this lifestyle?  Others who have been on the path awhile, did optimism come naturally?<br/>\n  <br/>\nI am hoping that by taking steps towards radical unschooling, I will discover more optimism and joy.  I already see my son becoming happier and more relaxed. <br/>\n<br/>\nI care more about my kids&#39; mental health than I do about their academic edcation.  This leads me to believe I&#39;m on the right path, even though I have a long way to go to becoming the joyful parent I want to be.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Pam Sorooshian &lt;pamsoroosh@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; At the upcoming Always Learning Live Unschooling Symposium (ALL) in<br/>\n&gt; December, I&#39;m going to be talking about what made me think unschooling<br/>\n&gt; was a good idea back umpteen years ago when we started. I&#39;ve been<br/>\n&gt; thinking about that a lot, lately. I thought SO much more in terms of<br/>\n&gt; &quot;education&quot; back then, that my reasons all had to do with how the kids<br/>\n&gt; would learn math or science or history or reading and writing in<br/>\n&gt; natural ways that wouldn&#39;t destroy their love of learning. It is<br/>\n&gt; really interesting to me, now, that those are NOT the main reasons I<br/>\n&gt; think unschooling is wonderful. They seem pretty trivial in comparison<br/>\n&gt; to the really big important things in life that have so much more to<br/>\n&gt; do with character and behavior. I&#39;ll talk about them, but I no longer<br/>\n&gt; have any concern about whether or not unschooled kids will learn to<br/>\n&gt; read or write or do math or whether they&#39;ll have &quot;gaps&quot; in their<br/>\n&gt; education. I guess I&#39;ll talk about why that seems like a complete<br/>\n&gt; nonissue to me, these days.<br/>\n&gt; <br/>\n&gt; I&#39;m also going to talk about what I have learned about unschooling.<br/>\n&gt; I&#39;ve learned a lot about it in just in the past week, so this talk is<br/>\n&gt; definitely a work in progress. What I have in mind is talking about<br/>\n&gt; some of the things I did not know about unschooling until we&#39;d done<br/>\n&gt; it. The one thing I&#39;ve been thinking about this week is that<br/>\n&gt; unschooling is a profoundly optimistic decision and that it involves a<br/>\n&gt; huge commitment to living a very optimistic life. I&#39;m going to talk<br/>\n&gt; more about what I mean by that and what happens when children grow up<br/>\n&gt; that way - kind of amazing.<br/>\n&gt; <br/>\n&gt; I&#39;m also thinking a lot about the damage done by schooling - thinking<br/>\n&gt; of this in contrast to the above. Schooling is a quite pessimistic<br/>\n&gt; endeavor. It assumes negative behaviors are normal, expects the worst,<br/>\n&gt; and sets up system with a zillion rules and consequences for breaking<br/>\n&gt; the rules. It assumes kids don&#39;t want to learn and have to be bribed<br/>\n&gt; or punished to get the learning into them. What effect does living in<br/>\n&gt; such a pessimistic environment have on kids?<br/>\n&gt; <br/>\n&gt; Scientists who study this stuff report that pessimism and optimism<br/>\n&gt; seem to be slightly inherited - maybe due to being connected to other<br/>\n&gt; factors that are genetic. But they are also largely learned habits of<br/>\n&gt; attitude. I think it is possible that THE most significant thing<br/>\n&gt; unschooling does is nurture optimism.<br/>\n&gt; <br/>\n&gt; -pam<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":332164648,"authorName":"Rippy and Graham Dusseldorp","from":"Rippy and Graham Dusseldorp &lt;ripgray@...&gt;","profile":"rdusseldorp","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Learning is Learning","postDate":"1351187979","msgId":69413,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYyNThGRkQzLTYyNTMtNDQ4NS04NDEyLTNDMDhEQzU0RTE2N0BnbWFpbC5jb20+","inReplyToHeader":"PENBT09UYVhQRmtTcW00Z3BpT055Z0V3UmQwS2dTNS1rZTFaK3hfU3ZnY3JkVmctVWtEd0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEREQUU1QzlGLTREOTEtNDhFOS04NTJDLUY1ODhGNzgxRTQxQkBTYW5kcmFkb2RkLmNvbT4gPGs2OTg3YytydDk5QGVHcm91cHMuY29tPiA8Q0FPT1RhWFBGa1NxbTRncGlPTnlnRXdSZDBLZ1M1LWtlMVoreF9TdmdjcmRWZy1Va0R3QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":69411,"nextInTopic":69423,"prevInTime":69412,"nextInTime":69414,"topicId":69403,"numMessagesInTopic":0,"msgSnippet":"Pam Sorooshian wrote: -=- ... it seems to involve an underlying assumption that people can change, be better by choice. That assumption - that we can choose","messageBody":"<div id=\"ygrps-yiv-398820211\">Pam Sorooshian wrote:<br/>\n<br/>\n-=- ... it seems to involve an underlying assumption that people can change, be better by choice. That assumption - that we can choose who we are - what kind of person we are - how we want to react to life events - unschooling seems to lead to that kind of thinking. -=-<br/>\n<br/>\nFor me, this is one of the most beautiful aspects of unschooling. Having parents that nurture optimism, hopefulness, and contentment gives children an extraordinary advantage in life. <br/>\n<br/>\nShawn Achor, a researcher and teacher of positive psychology, calls it the happiness advantage - your brain at positive performs significantly better than it does at negative, neutral or stressed. Your intelligence rises, as does your creativity, energy levels and your resiliency. You adapt to the world in a different way.<br/>\n<br/>\nIn his amusing Ted Talk (<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.ted.com/talks/shawn_achor_the_happy_secret_to_better_work.html\">http://www.ted.com/talks/shawn_achor_the_happy_secret_to_better_work.html</a> ), he asserts that our reality is shaped by the lens through which our brain processes the world and that we can choose our own lens. He claims that 90% of our long term happiness is predicted by the way our brain processes the world and not by our external world. He talks about how you can rewire your brain to be more optimistic. Doing things such as taking notice of things that you are grateful for, journaling, exercise, meditation, and random acts of kindness helps with this. <br/>\n<br/>\nI have personal experience of how dramatically beneficial it can be to process the world in a different way. A few years ago, I was depressed, anxious and having panic attacks after a stressful series of events involving Gisele. I could not find a way to see the world as I used to - safe, kind, on my side. It was hugely debilitating and I couldn&#39;t seem to find a way to get better. My doctor recommended seeing a therapist who would help me process the stressful events by helping me rewire my trauma related memories in my brain. It is called EMDR (Eye Movement Desensitization and Reprocessing) therapy. I am still amazed at what a difference it made. The only thing that changed was how I processed things internally. My external world stayed the same. <br/>\n<br/>\nRippy<br/>\n(Gianluca 7, Gisele 6)<br/>\n<br/>\nNote: At the bottom right of the Ted Talk, there is an option for subtitles in 36 different languages.<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":199638520,"authorName":"rachelshphrd","from":"&quot;rachelshphrd&quot; &lt;rachelshphrd@...&gt;","profile":"rachelshphrd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Learning is Learning","postDate":"1351170077","msgId":69411,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGs2YmQ2dCs0Y2JqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGs2OHU1ais1bDIwQGVHcm91cHMuY29tPg=="},"prevInTopic":69409,"nextInTopic":69413,"prevInTime":69410,"nextInTime":69412,"topicId":69403,"numMessagesInTopic":0,"msgSnippet":"Thank you so much for sharing that. I just started unschooling this year and I love that validation. I absolutely love what your son said. Good for him. He has","messageBody":"<div id=\"ygrps-yiv-1680036756\">Thank you so much for sharing that. I just started unschooling this year and I love that validation. I absolutely love what your son said. Good for him. He has a mind of his own. <br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;malvarez5412&quot; &lt;hayesalvarez@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; My son had an observation about pessimism in school.  He had spent several years in a very optimistic, progressive cooperative school (with no grades or tests and a lot of freedom to choose how to spend one&#39;s time).  Then we moved.  His brother chose not to attend school, but he chose to try public school.  When I asked him after a few weeks what he thought of it, he responded that while the &quot;materials&quot; are much less interesting than at his previous school, he still finds good ideas to &quot;follow up on.&quot;  &quot;But,&quot; he said, &quot;the problem is all the assessment.&quot; These teachers are giving me materials to work with, and I want to learn about this stuff, and I read and write about it, but then they challenge me.  They act like maybe I&#39;m not really interested, just pretending, and that I have to &quot;prove it to them&quot; that I&#39;m learning something.  &quot;I just think all this assessing is really not nice.&quot;  <br/>\n&gt; <br/>\n&gt; The conversation was interesting to me because I didn&#39;t know he was familiar with the word or the concept of &quot;assessing&quot; and &quot;assessment.&quot;  And because he was right!  Asking an individual to *prove* that his engagement is real or adequate isn&#39;t nice!  I told him that I agreed that it was disrespectful to ask him to prove he&#39;s learning and then we had a conversation about taxes and public schools and public anxiety about learning.<br/>\n&gt; <br/>\n&gt; --Elizabeth <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Pam Sorooshian &lt;pamsoroosh@&gt; wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt; At the upcoming Always Learning Live Unschooling Symposium (ALL) in<br/>\n&gt; &gt; December, I&#39;m going to be talking about what made me think unschooling<br/>\n&gt; &gt; was a good idea back umpteen years ago when we started. I&#39;ve been<br/>\n&gt; &gt; thinking about that a lot, lately. I thought SO much more in terms of<br/>\n&gt; &gt; &quot;education&quot; back then, that my reasons all had to do with how the kids<br/>\n&gt; &gt; would learn math or science or history or reading and writing in<br/>\n&gt; &gt; natural ways that wouldn&#39;t destroy their love of learning. It is<br/>\n&gt; &gt; really interesting to me, now, that those are NOT the main reasons I<br/>\n&gt; &gt; think unschooling is wonderful. They seem pretty trivial in comparison<br/>\n&gt; &gt; to the really big important things in life that have so much more to<br/>\n&gt; &gt; do with character and behavior. I&#39;ll talk about them, but I no longer<br/>\n&gt; &gt; have any concern about whether or not unschooled kids will learn to<br/>\n&gt; &gt; read or write or do math or whether they&#39;ll have &quot;gaps&quot; in their<br/>\n&gt; &gt; education. I guess I&#39;ll talk about why that seems like a complete<br/>\n&gt; &gt; nonissue to me, these days.<br/>\n&gt; &gt; <br/>\n&gt; &gt; I&#39;m also going to talk about what I have learned about unschooling.<br/>\n&gt; &gt; I&#39;ve learned a lot about it in just in the past week, so this talk is<br/>\n&gt; &gt; definitely a work in progress. What I have in mind is talking about<br/>\n&gt; &gt; some of the things I did not know about unschooling until we&#39;d done<br/>\n&gt; &gt; it. The one thing I&#39;ve been thinking about this week is that<br/>\n&gt; &gt; unschooling is a profoundly optimistic decision and that it involves a<br/>\n&gt; &gt; huge commitment to living a very optimistic life. I&#39;m going to talk<br/>\n&gt; &gt; more about what I mean by that and what happens when children grow up<br/>\n&gt; &gt; that way - kind of amazing.<br/>\n&gt; &gt; <br/>\n&gt; &gt; I&#39;m also thinking a lot about the damage done by schooling - thinking<br/>\n&gt; &gt; of this in contrast to the above. Schooling is a quite pessimistic<br/>\n&gt; &gt; endeavor. It assumes negative behaviors are normal, expects the worst,<br/>\n&gt; &gt; and sets up system with a zillion rules and consequences for breaking<br/>\n&gt; &gt; the rules. It assumes kids don&#39;t want to learn and have to be bribed<br/>\n&gt; &gt; or punished to get the learning into them. What effect does living in<br/>\n&gt; &gt; such a pessimistic environment have on kids?<br/>\n&gt; &gt; <br/>\n&gt; &gt; Scientists who study this stuff report that pessimism and optimism<br/>\n&gt; &gt; seem to be slightly inherited - maybe due to being connected to other<br/>\n&gt; &gt; factors that are genetic. But they are also largely learned habits of<br/>\n&gt; &gt; attitude. I think it is possible that THE most significant thing<br/>\n&gt; &gt; unschooling does is nurture optimism.<br/>\n&gt; &gt; <br/>\n&gt; &gt; -pam<br/>\n&gt; &gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Learning is Learning","postDate":"1351120139","msgId":69409,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI3NTNGOTcxLTg3Q0QtNDZGQS04MDU1LUUxNzU3NzM1QkQxQ0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PENBT09UYVhQRmtTcW00Z3BpT055Z0V3UmQwS2dTNS1rZTFaK3hfU3ZnY3JkVmctVWtEd0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEREQUU1QzlGLTREOTEtNDhFOS04NTJDLUY1ODhGNzgxRTQxQkBTYW5kcmFkb2RkLmNvbT4gPGs2OTg3YytydDk5QGVHcm91cHMuY29tPiA8Q0FPT1RhWFBGa1NxbTRncGlPTnlnRXdSZDBLZ1M1LWtlMVoreF9TdmdjcmRWZy1Va0R3QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":69408,"nextInTopic":69411,"prevInTime":69408,"nextInTime":69410,"topicId":69403,"numMessagesInTopic":0,"msgSnippet":"-=Hopefulness - that s in the mix, too. -=-And maybe it is existentialism. I m not very clear on the full meaning of that, but it seems to involve an","messageBody":"<div id=\"ygrps-yiv-1885768327\">-=Hopefulness - that&#39;s in the mix, too.<br/>\n<br/>\n-=-And maybe it is existentialism. I&#39;m not very clear on the full meaning of<br/>\nthat, but it seems to involve an underlying assumption that people can<br/>\nchange, be better by choice. That assumption - that we can choose who we<br/>\nare - what kind of person we are - how we want to react to life events -<br/>\nunschooling seems to lead to that kind of thinking.-=-<br/>\n<br/>\nUnschooling requires that kind of thinking.  Without choosing to be different from parents who send their kids to school because it seems the default and easy thing, unschooling can&#39;t be accessed.<br/>\n<br/>\nThe idea that people can be better by choice is also part of humanism.  The old accusation that unschooling was humanistic (which used to seem like a harsh accusation to some people, when all homeschoolers were in one pool) is triggered by that idea that we can determine our morality, and that children aren&#39;t born sinful.  <br/>\n<br/>\nBelow is a quote from something longer:<br/>\n<br/>\n  One member stated that unschooling is about trusting your children.  The concept is humanistic in worldview.  (Humanist meaning focusing on human values or interests).<br/>\n<br/>\nThe rest is here:  <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/feedback/humanism\">http://sandradodd.com/feedback/humanism</a><br/>\n<br/>\nI have nothing against &quot;humanism&quot; as an insult.  I accept it.  <br/>\nIt can be good, though, to know the arguments and objections of others.<br/>\n <br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":504505579,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Learning is Learning","postDate":"1351101816","msgId":69408,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBT09UYVhQRmtTcW00Z3BpT055Z0V3UmQwS2dTNS1rZTFaK3hfU3ZnY3JkVmctVWtEd0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGs2OTg3YytydDk5QGVHcm91cHMuY29tPg==","referencesHeader":"PEREQUU1QzlGLTREOTEtNDhFOS04NTJDLUY1ODhGNzgxRTQxQkBTYW5kcmFkb2RkLmNvbT4JPGs2OTg3YytydDk5QGVHcm91cHMuY29tPg=="},"prevInTopic":69407,"nextInTopic":69409,"prevInTime":69407,"nextInTime":69409,"topicId":69403,"numMessagesInTopic":0,"msgSnippet":"Hopefulness - that s in the mix, too. And maybe it is existentialism. I m not very clear on the full meaning of that, but it seems to involve an underlying","messageBody":"<div id=\"ygrps-yiv-740721290\">Hopefulness - that&#39;s in the mix, too.<br/>\n<br/>\nAnd maybe it is existentialism. I&#39;m not very clear on the full meaning of<br/>\nthat, but it seems to involve an underlying assumption that people can<br/>\nchange, be better by choice. That assumption - that we can choose who we<br/>\nare - what kind of person we are - how we want to react to life events -<br/>\nunschooling seems to lead to that kind of thinking.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Wed, Oct 24, 2012 at 10:23 AM, Tori &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:tandosmama@...\">tandosmama@...</a>&gt; wrote:<br/>\n<br/>\n&gt; Yes. Seems like it&#39;s optimism, contentment and a strong sense of<br/>\n&gt; confidence that life is a good place to be. I also feel lucky to have<br/>\n&gt; discovered unschooling; so does my husband. But our kids....there was<br/>\n&gt; nothing to discover. As my daughter says, DAILY, &quot;Today is the best day<br/>\n&gt; ever!&quot;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":324592498,"authorName":"Tori","from":"&quot;Tori&quot; &lt;tandosmama@...&gt;","profile":"tandosmama@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Learning is Learning","postDate":"1351099436","msgId":69407,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGs2OTg3YytydDk5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEREQUU1QzlGLTREOTEtNDhFOS04NTJDLUY1ODhGNzgxRTQxQkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":69406,"nextInTopic":69408,"prevInTime":69406,"nextInTime":69408,"topicId":69403,"numMessagesInTopic":0,"msgSnippet":"... Yes. Seems like it s optimism, contentment and a strong sense of confidence that life is a good place to be. I also feel lucky to have discovered","messageBody":"<div id=\"ygrps-yiv-2031486369\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; <br/>\n&gt; -=-But, really, it *is* optimism. Bright, warm, wonderful optimism! -=-<br/>\n&gt; <br/>\n&gt; I think it could also be contentment.<br/>\n&gt; <br/>\n&gt; <br/>\n </span></blockquote>Yes. Seems like it&#39;s optimism, contentment and a strong sense of confidence that life is a good place to be. I also feel lucky to have discovered unschooling; so does my husband. But our kids....there was nothing to discover. As my daughter says, DAILY, &quot;Today is the best day ever!&quot;<br/>\n<br/>\nTori</div>","specialLinks":[]},{"userId":528306112,"authorName":"malvarez5412","from":"&quot;malvarez5412&quot; &lt;hayesalvarez@...&gt;","profile":"malvarez5412","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Learning is Learning","postDate":"1351089139","msgId":69406,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGs2OHU1ais1bDIwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBT09UYVhOZ29YNHgyZ29QME0xUEdoRWk3R3JZMWpnOGt6K1ZSZ2FKR0NvMCtrWTRhZ0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":69405,"nextInTopic":69407,"prevInTime":69405,"nextInTime":69407,"topicId":69403,"numMessagesInTopic":0,"msgSnippet":"My son had an observation about pessimism in school.  He had spent several years in a very optimistic, progressive cooperative school (with no grades or tests","messageBody":"<div id=\"ygrps-yiv-89293225\">My son had an observation about pessimism in school.  He had spent several years in a very optimistic, progressive cooperative school (with no grades or tests and a lot of freedom to choose how to spend one&#39;s time).  Then we moved.  His brother chose not to attend school, but he chose to try public school.  When I asked him after a few weeks what he thought of it, he responded that while the &quot;materials&quot; are much less interesting than at his previous school, he still finds good ideas to &quot;follow up on.&quot;  &quot;But,&quot; he said, &quot;the problem is all the assessment.&quot; These teachers are giving me materials to work with, and I want to learn about this stuff, and I read and write about it, but then they challenge me.  They act like maybe I&#39;m not really interested, just pretending, and that I have to &quot;prove it to them&quot; that I&#39;m learning something.  &quot;I just think all this assessing is really not nice.&quot;  <br/>\n<br/>\nThe conversation was interesting to me because I didn&#39;t know he was familiar with the word or the concept of &quot;assessing&quot; and &quot;assessment.&quot;  And because he was right!  Asking an individual to *prove* that his engagement is real or adequate isn&#39;t nice!  I told him that I agreed that it was disrespectful to ask him to prove he&#39;s learning and then we had a conversation about taxes and public schools and public anxiety about learning.<br/>\n<br/>\n--Elizabeth <br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Pam Sorooshian &lt;pamsoroosh@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; At the upcoming Always Learning Live Unschooling Symposium (ALL) in<br/>\n&gt; December, I&#39;m going to be talking about what made me think unschooling<br/>\n&gt; was a good idea back umpteen years ago when we started. I&#39;ve been<br/>\n&gt; thinking about that a lot, lately. I thought SO much more in terms of<br/>\n&gt; &quot;education&quot; back then, that my reasons all had to do with how the kids<br/>\n&gt; would learn math or science or history or reading and writing in<br/>\n&gt; natural ways that wouldn&#39;t destroy their love of learning. It is<br/>\n&gt; really interesting to me, now, that those are NOT the main reasons I<br/>\n&gt; think unschooling is wonderful. They seem pretty trivial in comparison<br/>\n&gt; to the really big important things in life that have so much more to<br/>\n&gt; do with character and behavior. I&#39;ll talk about them, but I no longer<br/>\n&gt; have any concern about whether or not unschooled kids will learn to<br/>\n&gt; read or write or do math or whether they&#39;ll have &quot;gaps&quot; in their<br/>\n&gt; education. I guess I&#39;ll talk about why that seems like a complete<br/>\n&gt; nonissue to me, these days.<br/>\n&gt; <br/>\n&gt; I&#39;m also going to talk about what I have learned about unschooling.<br/>\n&gt; I&#39;ve learned a lot about it in just in the past week, so this talk is<br/>\n&gt; definitely a work in progress. What I have in mind is talking about<br/>\n&gt; some of the things I did not know about unschooling until we&#39;d done<br/>\n&gt; it. The one thing I&#39;ve been thinking about this week is that<br/>\n&gt; unschooling is a profoundly optimistic decision and that it involves a<br/>\n&gt; huge commitment to living a very optimistic life. I&#39;m going to talk<br/>\n&gt; more about what I mean by that and what happens when children grow up<br/>\n&gt; that way - kind of amazing.<br/>\n&gt; <br/>\n&gt; I&#39;m also thinking a lot about the damage done by schooling - thinking<br/>\n&gt; of this in contrast to the above. Schooling is a quite pessimistic<br/>\n&gt; endeavor. It assumes negative behaviors are normal, expects the worst,<br/>\n&gt; and sets up system with a zillion rules and consequences for breaking<br/>\n&gt; the rules. It assumes kids don&#39;t want to learn and have to be bribed<br/>\n&gt; or punished to get the learning into them. What effect does living in<br/>\n&gt; such a pessimistic environment have on kids?<br/>\n&gt; <br/>\n&gt; Scientists who study this stuff report that pessimism and optimism<br/>\n&gt; seem to be slightly inherited - maybe due to being connected to other<br/>\n&gt; factors that are genetic. But they are also largely learned habits of<br/>\n&gt; attitude. I think it is possible that THE most significant thing<br/>\n&gt; unschooling does is nurture optimism.<br/>\n&gt; <br/>\n&gt; -pam<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Learning is Learning","postDate":"1351048227","msgId":69405,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEREQUU1QzlGLTREOTEtNDhFOS04NTJDLUY1ODhGNzgxRTQxQkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGs2N2dldCs1YmxqQGVHcm91cHMuY29tPg==","referencesHeader":"PGs2N2dldCs1YmxqQGVHcm91cHMuY29tPg=="},"prevInTopic":69404,"nextInTopic":69406,"prevInTime":69404,"nextInTime":69406,"topicId":69403,"numMessagesInTopic":0,"msgSnippet":"-=-and then said, I don t know. There s something special about each one. I like them all. -=-The way he said this, cause me to pause. But, it wasn t just","messageBody":"<div id=\"ygrps-yiv-1968344817\">-=-and then said, &quot;I don&#39;t know. There&#39;s something special about each one. I like them all.&quot; <br/>\n<br/>\n-=-The way he said this, cause me to pause. But, it wasn&#39;t just his words. His whole tone was full of something really warm. Most often it is, and I deeply admire him for that. In my mind I was searching for a word to describe it. After some time, I came up with &quot;positive.&quot; But, really, it *is* optimism. Bright, warm, wonderful optimism! -=-<br/>\n<br/>\nI think it could also be contentment.<br/>\n<br/>\nLast week Holly created an Artist trading card I&#39;ll be using for Just Add Light tomorrow, along with a quote from Schuyler Waynforth.   You can peek at the trading card in advance, if you want to. :-)<br/>\n<br/>\nShe made one to give to Erika, and one to keep.  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://i26.photobucket.com/albums/c111/SandraDodd/website%20various%20bits/addlight/addlight10/DSC00520.jpg\">http://i26.photobucket.com/albums/c111/SandraDodd/website%20various%20bits/addlight/addlight10/DSC00520.jpg</a><br/>\n<br/>\nHolly is at home in the world.  I wasn&#39;t, when I was a kid.  Something I wrote ten years ago about that is here:  <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/fullofyourself\">http://sandradodd.com/fullofyourself</a><br/>\n<br/>\nThis is about contentment:  <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/joy\">http://sandradodd.com/joy</a><br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":284087656,"authorName":"Karen","from":"&quot;Karen&quot; &lt;semajrak@...&gt;","profile":"semajrak","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Learning is Learning","postDate":"1351042333","msgId":69404,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGs2N2dldCs1YmxqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBT09UYVhOZ29YNHgyZ29QME0xUEdoRWk3R3JZMWpnOGt6K1ZSZ2FKR0NvMCtrWTRhZ0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":69403,"nextInTopic":69405,"prevInTime":69403,"nextInTime":69405,"topicId":69403,"numMessagesInTopic":0,"msgSnippet":"This is so wonderful.  I hope there might be a transcript of your talk. So many interesting ah-ha moments come to me while I m driving in the car with my son.","messageBody":"<div id=\"ygrps-yiv-488368763\">This is so wonderful.  I hope there might be a transcript of your talk.<br/>\n<br/>\nSo many interesting ah-ha moments come to me while I&#39;m driving in the car with my son.  I think it&#39;s because we like to chat while we travel.  Anyway, today we were going to my piano lesson.  The colours of the changing NY State leaves are simply amazing this time of year.  This year it seems even more so for some reason.  Brilliant oranges and reds lined both sides of the highway we were driving down.  I remarked on how beautiful the colours were, and my son looked up and around.  He agreed, and commented that it was starting to get cooler.  I love the winter, so I said, &quot;Yay!  Winter&#39;s coming!&quot;  I asked him what was his favourite season.  He thought about his answer for a moment, and then said, &quot;I don&#39;t know.  There&#39;s something special about each one. I like them all.&quot;  <br/>\n<br/>\nThe way he said this, cause me to pause.  But, it wasn&#39;t just his words.  His whole tone was full of something really warm.  Most often it is, and I deeply admire him for that.  In my mind I was searching for a word to describe it.  After some time, I came up with &quot;positive.&quot;  But, really, it *is* optimism.  Bright, warm, wonderful optimism!  <br/>\n<br/>\nKaren.<br/>\n<br/>\n  <br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Pam Sorooshian &lt;pamsoroosh@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; At the upcoming Always Learning Live Unschooling Symposium (ALL) in<br/>\n&gt; December, I&#39;m going to be talking about what made me think unschooling<br/>\n&gt; was a good idea back umpteen years ago when we started. I&#39;ve been<br/>\n&gt; thinking about that a lot, lately. I thought SO much more in terms of<br/>\n&gt; &quot;education&quot; back then, that my reasons all had to do with how the kids<br/>\n&gt; would learn math or science or history or reading and writing in<br/>\n&gt; natural ways that wouldn&#39;t destroy their love of learning. It is<br/>\n&gt; really interesting to me, now, that those are NOT the main reasons I<br/>\n&gt; think unschooling is wonderful. They seem pretty trivial in comparison<br/>\n&gt; to the really big important things in life that have so much more to<br/>\n&gt; do with character and behavior. I&#39;ll talk about them, but I no longer<br/>\n&gt; have any concern about whether or not unschooled kids will learn to<br/>\n&gt; read or write or do math or whether they&#39;ll have &quot;gaps&quot; in their<br/>\n&gt; education. I guess I&#39;ll talk about why that seems like a complete<br/>\n&gt; nonissue to me, these days.<br/>\n&gt; <br/>\n&gt; I&#39;m also going to talk about what I have learned about unschooling.<br/>\n&gt; I&#39;ve learned a lot about it in just in the past week, so this talk is<br/>\n&gt; definitely a work in progress. What I have in mind is talking about<br/>\n&gt; some of the things I did not know about unschooling until we&#39;d done<br/>\n&gt; it. The one thing I&#39;ve been thinking about this week is that<br/>\n&gt; unschooling is a profoundly optimistic decision and that it involves a<br/>\n&gt; huge commitment to living a very optimistic life. I&#39;m going to talk<br/>\n&gt; more about what I mean by that and what happens when children grow up<br/>\n&gt; that way - kind of amazing.<br/>\n&gt; <br/>\n&gt; I&#39;m also thinking a lot about the damage done by schooling - thinking<br/>\n&gt; of this in contrast to the above. Schooling is a quite pessimistic<br/>\n&gt; endeavor. It assumes negative behaviors are normal, expects the worst,<br/>\n&gt; and sets up system with a zillion rules and consequences for breaking<br/>\n&gt; the rules. It assumes kids don&#39;t want to learn and have to be bribed<br/>\n&gt; or punished to get the learning into them. What effect does living in<br/>\n&gt; such a pessimistic environment have on kids?<br/>\n&gt; <br/>\n&gt; Scientists who study this stuff report that pessimism and optimism<br/>\n&gt; seem to be slightly inherited - maybe due to being connected to other<br/>\n&gt; factors that are genetic. But they are also largely learned habits of<br/>\n&gt; attitude. I think it is possible that THE most significant thing<br/>\n&gt; unschooling does is nurture optimism.<br/>\n&gt; <br/>\n&gt; -pam<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":504505579,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Learning is Learning","postDate":"1351039791","msgId":69403,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBT09UYVhOZ29YNHgyZ29QME0xUEdoRWk3R3JZMWpnOGt6K1ZSZ2FKR0NvMCtrWTRhZ0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":69404,"prevInTime":69402,"nextInTime":69404,"topicId":69403,"numMessagesInTopic":0,"msgSnippet":"At the upcoming Always Learning Live Unschooling Symposium (ALL) in December, I m going to be talking about what made me think unschooling was a good idea back","messageBody":"<div id=\"ygrps-yiv-1713310818\">At the upcoming Always Learning Live Unschooling Symposium (ALL) in<br/>\nDecember, I&#39;m going to be talking about what made me think unschooling<br/>\nwas a good idea back umpteen years ago when we started. I&#39;ve been<br/>\nthinking about that a lot, lately. I thought SO much more in terms of<br/>\n&quot;education&quot; back then, that my reasons all had to do with how the kids<br/>\nwould learn math or science or history or reading and writing in<br/>\nnatural ways that wouldn&#39;t destroy their love of learning. It is<br/>\nreally interesting to me, now, that those are NOT the main reasons I<br/>\nthink unschooling is wonderful. They seem pretty trivial in comparison<br/>\nto the really big important things in life that have so much more to<br/>\ndo with character and behavior. I&#39;ll talk about them, but I no longer<br/>\nhave any concern about whether or not unschooled kids will learn to<br/>\nread or write or do math or whether they&#39;ll have &quot;gaps&quot; in their<br/>\neducation. I guess I&#39;ll talk about why that seems like a complete<br/>\nnonissue to me, these days.<br/>\n<br/>\nI&#39;m also going to talk about what I have learned about unschooling.<br/>\nI&#39;ve learned a lot about it in just in the past week, so this talk is<br/>\ndefinitely a work in progress. What I have in mind is talking about<br/>\nsome of the things I did not know about unschooling until we&#39;d done<br/>\nit. The one thing I&#39;ve been thinking about this week is that<br/>\nunschooling is a profoundly optimistic decision and that it involves a<br/>\nhuge commitment to living a very optimistic life. I&#39;m going to talk<br/>\nmore about what I mean by that and what happens when children grow up<br/>\nthat way - kind of amazing.<br/>\n<br/>\nI&#39;m also thinking a lot about the damage done by schooling - thinking<br/>\nof this in contrast to the above. Schooling is a quite pessimistic<br/>\nendeavor. It assumes negative behaviors are normal, expects the worst,<br/>\nand sets up system with a zillion rules and consequences for breaking<br/>\nthe rules. It assumes kids don&#39;t want to learn and have to be bribed<br/>\nor punished to get the learning into them. What effect does living in<br/>\nsuch a pessimistic environment have on kids?<br/>\n<br/>\nScientists who study this stuff report that pessimism and optimism<br/>\nseem to be slightly inherited - maybe due to being connected to other<br/>\nfactors that are genetic. But they are also largely learned habits of<br/>\nattitude. I think it is possible that THE most significant thing<br/>\nunschooling does is nurture optimism.<br/>\n<br/>\n-pam</div>","specialLinks":[]}],"prevTopicId":73956,"nextTopicId":73969}}