{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":67247159,"authorName":"Nanci Kuykendall","from":"Nanci Kuykendall &lt;aisliin@...&gt;","profile":"aisliin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"[AlwaysLearning] Getting Kids to Taste Something","postDate":"1079731164","msgId":19109,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwMzE5MjExOTI0LjY0NDI2LnFtYWlsQHdlYjEzNzAxLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDEwNzk3MDI0NjQuNTU5Ljc1OTM1Lm0xMkB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":19108,"nextInTime":19110,"topicId":19109,"numMessagesInTopic":0,"msgSnippet":"This is an interesting conversation.  I wonder if it is a genetic predisposition, some kind of hunter gatherer sensativity to certain textures.  Maybe it has","messageBody":"<div id=\"ygrps-yiv-160600336\">This is an interesting conversation.  I wonder if it<br/>\nis a genetic predisposition, some kind of hunter<br/>\ngatherer sensativity to certain textures.  Maybe it<br/>\nhas to do with racial heritage, or maybe it&#39;s just a<br/>\nrandom thing.  I know that I am almost all Irish, and<br/>\nI can&#39;t eat (either from allergies or from dislike)<br/>\nmany tropical foods, like coconuts, bananas, avacados,<br/>\nand others.  Then again, I adore lemons, and those are<br/>\nnot cool weather fruits, so it&#39;s probably just a<br/>\ncoincidence, but an interesting one.  I grew up in a<br/>\nhousehold where cooking was considered a high art, and<br/>\nin a city world famous for it&#39;s restaurants, with<br/>\nparents who liked to eat out , travel and eat out, and<br/>\nto host gatherings where food was a focal point.  They<br/>\nwere in gourmet clubs for many years.  So I had<br/>\nexposure to many different incarnations of foods<br/>\nbearing the items I dislike, prepared very well, but<br/>\nwas still never able to eat them.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Hey I did this with my son in law.  He hates tomatoes<br/>\n&gt;he said.  I asked him when the last time he tried<br/>\n&gt;them, after all he loves sauce and ketchup.  <br/>\n&gt;He willing tried it again after admitting it had been<br/>\n&gt;years, shook his head no and went to the trash. <br/>\n&gt;Something about the texture. <br/>\n<br/>\n </span></blockquote>This is me too.  I love sun dried tomatoes, tomates in<br/>\nstews, sauces, pizza, etc, but fresh tomatoes, blech! <br/>\nUnless they are cut up very small.  I guess it&#39;s<br/>\ntextures.  I always peel them off sandwiches and<br/>\nburgers and things like that.  I peel off the warm<br/>\nwilty sauce covered lettuce too, puke!<br/>\n<br/>\nMy husband, when we first got married, had dislikes to<br/>\na lot of foods, like a number of vegetables, many<br/>\ndifferent dishes (like meatloaf, or pork chops) many<br/>\nspices, and other things.  I was dismayed at the<br/>\nlimitations in what he said was appealing to him for<br/>\nme to cook.  It turns out that almost all of these<br/>\ndislikes are due to his being raised in a household<br/>\nwithout very impressive cooking, where vegetables came<br/>\nout of the freezer or a can, a lot of margarine was<br/>\nused, and everthing was boiled and overcooked.  I&#39;m a<br/>\npretty good cook, and I use mostly fresh ingredients,<br/>\nalways of good quality, lots of herbs and spices,<br/>\nenjoy experimenting and have a pretty good sense of<br/>\nwhat tastes and textures go well together.  I have<br/>\nnever cooked anything that he tasted and didn&#39;t like. <br/>\nAlmost without exception he raves over it.  <br/>\n<br/>\nNow my meatloaf, pork chops, stuffed peppers, steamed<br/>\nveggies and many other things he never used to eat are<br/>\nhis favorite things.  Just this morning he was doing a<br/>\nlittle happy dance because he got to take leftover<br/>\nmeatloaf to work for his lunch.  He loves getting all<br/>\nkinds of envious comments from his coworkers when he<br/>\nheats up his good smelling lunches and dinners at work<br/>\n(he teaches night classes.)  He&#39;s learned to be quite<br/>\na good cook in his own right, making things from<br/>\nscratch, baking bread, and using spices with<br/>\nconfidence.  He often marvels at how he is eating<br/>\nsomething with relish now (like a big salad with lots<br/>\nof veggies, or candied yams) that he never would have<br/>\neven wanted to put in his mouth before.  It makes me<br/>\nwonder how much of some food dislikes are due to<br/>\nenvironment or limited experience and how much are<br/>\njust inborn. <br/>\n<br/>\nNanci K.</div>","specialLinks":[]}],"prevTopicId":19107,"nextTopicId":19112}}