{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: about spoiled kids, but not from an unschooler","postDate":"1120077242","msgId":107069,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk5LjYxNjkwOTVmLjJmZjQ1ZmJhQGFvbC5jb20+"},"prevInTopic":107064,"nextInTopic":0,"prevInTime":107068,"nextInTime":107070,"topicId":106849,"numMessagesInTopic":0,"msgSnippet":"... Thanks. What I often think when I m being patient with someone is that there is a child on the other side of that communication whose life   might be about","messageBody":"<div id=\"ygrps-yiv-1059190730\"><blockquote><span title=\"ireply\">&gt; I am quickly skimming and i don&#39;t usually post, but I just had to take<br/>\n&gt; a moment to say (publically) to you Sandra, you are SO AMAZINGLY<br/>\n&gt; PATIENT with people and I don&#39;t quite know how you do it.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Thanks.<br/>\nWhat I often think when I&#39;m being patient with someone is that there is a <br/>\nchild on the other side of that communication whose life   might be about to <br/>\nbecome a lot happier.   I do it for their children, and for the hope that my <br/>\nchildren (and yours; other unschoolers&#39;) will have more adults to run into when <br/>\nthey&#39;re grown who were also brought up gently and happily and richly (regardless <br/>\nof money--not financial riches, but a richly textured life).<br/>\n<br/>\nWhen I&#39;m impatient (which my detractors will tell you is ALL THE TIME), it&#39;s <br/>\nwhen it seems the person asking the questions is unwilling to change, <br/>\nuninterested in focussing on her children&#39;s happiness, and unlikely to add positively <br/>\nto the group experience.<br/>\n<br/>\nSome people are easily swayed, either because they&#39;re insecure or they&#39;re SO <br/>\nbalanced on the fence that they really haven&#39;t begun to decide whether <br/>\nunschooling will work for them.   When someone comes along who&#39;s honestly curious, <br/>\nit&#39;s fun to answer those questions and pursue those &quot;what ifs,&quot; but when one is <br/>\nhostile and defensive and seems intent on showing that unschooling is stupid, <br/>\nthat their children are bigger/better/smarter than the average everyday <br/>\nunschoolers discussed on the list, etc., my patience evaporates in the heat.   I can <br/>\nonly last a little while when I feel I&#39;m assisting someone (however ind<br/>\nirectly) to plant doubts and negativity in discussions that can be otherwise really <br/>\npostive and hope-filled.<br/>\n<br/>\nI&#39;m moving files from two older computers to a new computer, and came across <br/>\na ten year old set of writings, chats mostly, which were once up on a time <br/>\nsent out on request as &quot;The Unschooling Barrage.&quot;   I read some of a couple of <br/>\nthem, and remembered why &quot;the AOL days&quot; were so vibrant and lifechanging.   It <br/>\nwas the days before personal webpages, and sometimes the best one could hope <br/>\nfor was to download a text file, or to join a users&#39; group.   The message boards <br/>\nat AOL were the most modern and easily accessible thing going at the time.   <br/>\nOnce a week I ran a two-hour live chat on unschooling.   Deb Cunefare helped <br/>\non lots of them, when they were hosted by the homeschooling forum and we (and <br/>\nsome others still around) were volunteering at AOL.   For each hour of work we <br/>\ndid, we got one free hour of AOL, which was then $3 an hour for online time.   <br/>\nThen for a while I did chats for Home Education Magazine (after AOL went to a <br/>\nfixed-rate and volunteering was much more frustration than it was worth).<br/>\n<br/>\nNot long after, AOL put people in charge of the homeschooling area who <br/>\nweren&#39;t even homeschoolers at   all, and the magic all ebbed away.   But by then the <br/>\ninternet was accessible to lots of people, and people scattered.   <br/>\n<br/>\nThe only reason it&#39;s related to the question of patience and motive, I <br/>\nsuppose, is that I was just this morning reading answers to the same kinds of <br/>\nquestions, but ten years ago. &lt;bwg&gt;   I&#39;m planning to make those old documents <br/>\navailable to read online, too.   I&#39;ll announce it here when I have them up.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":79168236,"authorName":"Amy Childs","from":"&quot;Amy Childs&quot; &lt;amyc@...&gt;","profile":"aimmee36","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: about spoiled kids, but not from an unschooler","postDate":"1120067586","msgId":107064,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQ5dW42Mit0NjRtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE1Ni41MzUyZWE1Ny4yZmU4OWE3N0Bhb2wuY29tPg=="},"prevInTopic":106852,"nextInTopic":107069,"prevInTime":107063,"nextInTime":107065,"topicId":106849,"numMessagesInTopic":0,"msgSnippet":"... publically asked questions of unschoolers, but at some point... I am quickly skimming and i don t usually post, but I just had to take a moment to say","messageBody":"<div id=\"ygrps-yiv-1417062884\"><blockquote><span title=\"ireply\">&gt; I don&#39;t want to make a form letter that says &quot;I only answer the <br/>\n </span></blockquote>publically asked questions of unschoolers,&quot; but at some point...  <br/>\n<br/>\nI am quickly skimming and i don&#39;t usually post, but I just had to take <br/>\na moment to say (publically) to you Sandra, you are SO AMAZINGLY <br/>\nPATIENT with people and I don&#39;t quite know how you do it.<br/>\n<br/>\n~amy</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] about spoiled kids, but not from an unschooler","postDate":"1119309557","msgId":106852,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5Zi4zNjIxMTY4Yy4yZmU4YThmNUBhb2wuY29tPg=="},"prevInTopic":106850,"nextInTopic":107064,"prevInTime":106851,"nextInTime":106853,"topicId":106849,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/20/2005 5:01:32 PM Mountain Daylight Time, bacwoodz@earthlink.net writes: maybe  they are not sure what exactly their need is but are","messageBody":"<div id=\"ygrps-yiv-889869734\">In a message dated 6/20/2005 5:01:32 PM Mountain Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:bacwoodz@...\">bacwoodz@...</a> writes:<br/>\n<br/>\nmaybe  they are not sure what exactly their &quot;need&quot; is but are trying to fill <br/>\nit with  outside things. Adults often do this with  shopping.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nI do that.<br/>\nI just learned to get my fix in a thrift store or a crafts shop or flea  <br/>\nmarket.<br/>\n <br/>\n-=-<br/>\nYou know it is interesting that she is reading your pages. I am sure  that <br/>\nthere are people out there that may read them - and they aren&#39;t going to  jump <br/>\ninto unschooling overnight....and they may never... but it is sowing seeds  and <br/>\nyou never know when something you wrote may stimulate them to change their  <br/>\nbehavior.-=-<br/>\n <br/>\nI get non-unschoolers finding the video games page quite a bit, and a few  <br/>\nhave found the anti-spanking page.  I guess she was looking for info on  spoiled <br/>\nchildren and found that article, sandradodd/spoiled.<br/>\n <br/>\nMaybe, though, with her kids in school, some of the suggestions I made are  <br/>\njust dangerous. &lt;g&gt;  I&#39;m kinda joking but not totally.  I think  having a kid <br/>\nin high school who doesn&#39;t have a bedtime or curfew would be  insanely <br/>\ndangerous.   With my kids, though, it works great.  I  think the biggest difference is <br/>\ntheir lack of school-assigned &quot;peers&quot; to  pressure them to get away with <br/>\nmore, more, more.  They just never did learn  to be sneaky.  They never felt the <br/>\nanger and resentment many teens have  against their parents and other adults.<br/>\n <br/>\nSandra<br/>\n <br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":60283004,"authorName":"Heather Woodward","from":"&quot;Heather Woodward&quot; &lt;bacwoodz@...&gt;","profile":"bacwoodz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] about spoiled kids, but not from an unschooler","postDate":"1119308469","msgId":106850,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxYjEwMWM1NzVlYiRmMzQxMTQyMCRhOTRhNTZkMUBoZWF0aGVyYWM1dGJjcD4=","referencesHeader":"PDE1Ni41MzUyZWE1Ny4yZmU4OWE3N0Bhb2wuY29tPg=="},"prevInTopic":106849,"nextInTopic":106852,"prevInTime":106849,"nextInTime":106851,"topicId":106849,"numMessagesInTopic":0,"msgSnippet":"I wanted to comment on some of this - I feel that sometimes my children are not thankful . There are days when I feel there is no end to their wants . I know","messageBody":"<div id=\"ygrps-yiv-638950733\">I wanted to comment on some of this - I feel that sometimes my children are not &quot;thankful&quot;. There are days when I feel there is no end to their &quot;wants&quot;. I know there are times that I am not &quot;thankful&quot; inwardly..... but perhaps they are more vocal or they can somehow &quot;feel&quot; my &quot;negative unthankful-ness &quot;?  I also think that maybe in my case, I am more conscious of non-thankful behavior because I am worried about it within myself.<br/>\n<br/>\nMy kids don &#39;t yell I hate you or anything - but I could buy them 20 things they ask for in a store and when they ask for the 21st and its like the sky is falling I will say - &quot;we&#39;ll have to wait a bit - because we have a limited budget here - if you wanted to put back something else and get this instead that would be ok&quot; . There have been other times where they have wanted something that I know I can&#39;t get this week - and I will say &quot;That would make a great b-day present for you&quot; and sometimes this is well received.  I can understand the mothers frustration with the stress of providing more and more.  Where does it end? For me one of the things I notice is that some adults - myself included do not always behave in the best possible way - and yet we somehow expect kids to behave perfectly. There is a learning curve for everyone involved. <br/>\n<br/>\nIt sounds that the issue here is the resentment the mother is feeling - whether she wants to work or not it seems that it is motivated by the desire for material things rather then time and energy. I think it boils down to what you said about the kids being needy - and maybe they are not sure what exactly their &quot;need&quot; is but are trying to fill it with outside things. Adults often do this with shopping.<br/>\n<br/>\n<br/>\nYou know it is interesting that she is reading your pages. I am sure that there are people out there that may read them - and they aren&#39;t going to jump into unschooling overnight....and they may never... but it is sowing seeds and you never know when something you wrote may stimulate them to change their behavior.<br/>\n<br/>\nHeather<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a> <br/>\n  Sent: Monday, June 20, 2005 3:17 PM<br/>\n  Subject: [UnschoolingDiscussion] about spoiled kids, but not from an unschooler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  I don&#39;t want to make a form letter that says &quot;I only answer the publically  <br/>\n  asked questions of unschoolers,&quot; but at some point...   Well, I hope  something <br/>\n  helped her, but I thought this might be interesting to unschoolers,  and I <br/>\n  thought to ask whether you think my whole theory on spoiled kids has to do  with <br/>\n  attachment parented unschooled kids, not just any kids.  I hope  not.<br/>\n<br/>\n  (Also thought that &quot;spoiled&quot; kids won&#39;t want plastic toys from piano  <br/>\n  teachers, only kids whose moms never buy them plastic toys. &lt;g&gt;)<br/>\n<br/>\n  Okay, to this, which was by e-mail from someone I&#39;d never heard  of:<br/>\n  ==============================================================================<br/>\n  ======================<br/>\n<br/>\n  I was just reading your articles and I had a question for you.<br/>\n<br/>\n  Our two girls, ages 7 and 8 1/2 are very smart and expressive. They are  <br/>\n  outspoken and upset when they don&#39;t get their way.<br/>\n<br/>\n  It always happens that when we spend a day out with them and buy them  things <br/>\n  or take them places, and then they may not get just one thing because  either <br/>\n  it is too late, or we just don&#39;t have the money - they get angry, yell,  tell <br/>\n  us they hate us, etc. The older one more than the younger. I end up getting  <br/>\n  really angry at them and try to defend our situation. Then I have told them <br/>\n  they  are spoiled and not grateful for everything we have tried to do for them.<br/>\n<br/>\n  I should add that we haven&#39;t had a lot of money lately because I have been  a <br/>\n  stay at home mom. Life has been miserable not being able to enjoy things the  <br/>\n  way we used to. But I think I am returning to work in a few weeks and I am  <br/>\n  afraid that now they will really be thinking they can have everything they <br/>\n  want.  Mostly because I am so happy to finally get some money in my hands. But I <br/>\n  want  to teach some values.<br/>\n<br/>\n<br/>\n  I need some help on how to address this problem. I know I over react. It  <br/>\n  really hurts my feelings. I try to talk to them about how we want to take them  <br/>\n  places and do things, but they have to understand we can only do so much. They  <br/>\n  seem to understand, but when it actually happens, they just can&#39;t be patient <br/>\n  or  just enjoy all the other things they had going for them throughout the  <br/>\n  day.<br/>\n<br/>\n  Any suggestions greatly appreciated.<br/>\n<br/>\n  ===============================================<br/>\n<br/>\n<br/>\n  Are you homeschooling?  <br/>\n  Are you on the UnschoolingDiscussion list or AlwaysLearning?<br/>\n<br/>\n  If your girls are in school, the things I write might be removed from the  <br/>\n  realities of your life.  <br/>\n<br/>\n  Let me know a little more about your situation.<br/>\n<br/>\n<br/>\n  I can say that saying &quot;you are spoiled and ungrateful&quot; wouldn&#39;t be  <br/>\n  recommended by anyone, I&#39;m pretty sure.  Saying &quot;That makes me wish we  hadn&#39;t gone, <br/>\n  because it spoiled all the fun&quot; might be closer.  Talking  about yourself is <br/>\n  fair.  Telling them they&#39;re bad is insult to  injury.  Should they not have felt <br/>\n  injured?  Maybe.  But telling  them their feelings are wrong is only going to <br/>\n  make it worse.<br/>\n<br/>\n  Sandra<br/>\n<br/>\n<br/>\n  ===============================<br/>\n<br/>\n  I agree. I definitely reacted in a way that I shouldn&#39;t. But they are very  <br/>\n  strong willed kids, very creative and have no problems expressing their  <br/>\n  feelings. That can be difficult at times, because they often hurt mine when they  <br/>\n  don&#39;t get their way.<br/>\n<br/>\n  No, they are not home schooled. I have to work and I don&#39;t have the  patience <br/>\n  to teach academics. I love the school they are in.<br/>\n<br/>\n  I want to teach them to enjoy the things we can do for them, but not be so  <br/>\n  angry when they don&#39;t get their way. I want them to learn patience. I know that <br/>\n  their behavior comes from some of our behaviors as parents, it is just hard <br/>\n  to  recognize them when they are happening.<br/>\n<br/>\n  Thank you for your input.<br/>\n<br/>\n<br/>\n  =======================================<br/>\n<br/>\n  But they  are very strong willed kids, very creative and have no problems <br/>\n  expressing  their feelings. That can be difficult at times, because they often <br/>\n  hurt mine  when they don&#39;t get their way.<br/>\n<br/>\n<br/>\n  I used to get my feelings hurt when my kids were younger, but I worked  <br/>\n  consciously on getting over that.  They need to have a safe place to  practice <br/>\n  interpersonals, and they NEED home as a haven to relax, especially as  they go to <br/>\n  school.<br/>\n<br/>\n  School is stressful.  It is a HUGE wad of not getting your way.  <br/>\n<br/>\n  Kids at home get lots of their parents in all kinds of ways.   Schoolkids <br/>\n  often get a lot of parents-backing-up-school time about homework and  bedtimes <br/>\n  and get-your-clothes-ready.<br/>\n<br/>\n  Trying to make home less school focussed might help.  Spending more  <br/>\n  one-on-one time with the girls might help.  <br/>\n<br/>\n  With my kids to keep them from being competitive at a time and dollar  level, <br/>\n  we purposely and early on did very different things and got them very  <br/>\n  different things, discussing all the while why this or that thing would be ideal  <br/>\n  for this particular child.  They all knew they would have special stuff and  <br/>\n  experiences too, so they haven&#39;t been the kinds of kids who say &quot;You spent $10  <br/>\n  on her, you have to spend $10 on me.&quot;   We spent time recently with a  family <br/>\n  that was exactly that way, but partly it might be because the dad  died a few <br/>\n  years ago and the kids don&#39;t have as much opportunity to be alone  with the mom.<br/>\n<br/>\n  -=-I want to teach them to enjoy the things we can do for them, but not be  <br/>\n  so angry when they don&#39;t get their way. I want them to learn patience.-=-<br/>\n<br/>\n  If you weren&#39;t invested in schooling, I could say some things about  this.  <br/>\n  Teaching and learning rarely happen in conjunction.  There are  things you <br/>\n  can&#39;t &quot;teach&quot; them, but you can help them learn.  It would help  if you, at least, <br/>\n  would look into the difference.  If you see opportunities  through which they <br/>\n  can learn, and you could discuss the situation with them  without feeling <br/>\n  like you&#39;re &quot;teaching&quot; them, it would change your relationships  in good ways.<br/>\n<br/>\n  Here&#39;s something about that:<br/>\n  _<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/wordswords_\">http://sandradodd.com/wordswords_</a> (<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/wordswords)\">http://sandradodd.com/wordswords)</a> <br/>\n<br/>\n<br/>\n  My overriding guess is the kids are feeling needy and don&#39;t feel they  <br/>\n  should.  You don&#39;t need to discuss that with them, just give them more of  yourself, <br/>\n  more casual touch, more attention, more listening, more personal  cushion.<br/>\n<br/>\n  Sandra<br/>\n<br/>\n<br/>\n<br/>\n  [Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n  &quot;List Posting Policies&quot; are provided in the files area of this group. <br/>\n<br/>\n  Visit the Unschooling website and message boards: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> <br/>\n<br/>\n<br/>\n<br/>\n------------------------------------------------------------------------------<br/>\n  Yahoo! Groups Links<br/>\n<br/>\n    a.. To visit your group on the web, go to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/UnschoolingDiscussion/\">http://groups.yahoo.com/group/UnschoolingDiscussion/</a><br/>\n      <br/>\n    b.. To unsubscribe from this group, send an email to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a><br/>\n      <br/>\n    c.. Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"about spoiled kids, but not from an unschooler","postDate":"1119305847","msgId":106849,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1Ni41MzUyZWE1Ny4yZmU4OWE3N0Bhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":106850,"prevInTime":106848,"nextInTime":106850,"topicId":106849,"numMessagesInTopic":0,"msgSnippet":"I don t want to make a form letter that says I only answer the publically asked questions of unschoolers, but at some point...   Well, I hope  something ","messageBody":"<div id=\"ygrps-yiv-1504730996\">I don&#39;t want to make a form letter that says &quot;I only answer the publically  <br/>\nasked questions of unschoolers,&quot; but at some point...   Well, I hope  something <br/>\nhelped her, but I thought this might be interesting to unschoolers,  and I <br/>\nthought to ask whether you think my whole theory on spoiled kids has to do  with <br/>\nattachment parented unschooled kids, not just any kids.  I hope  not.<br/>\n <br/>\n(Also thought that &quot;spoiled&quot; kids won&#39;t want plastic toys from piano  <br/>\nteachers, only kids whose moms never buy them plastic toys. &lt;g&gt;)<br/>\n <br/>\nOkay, to this, which was by e-mail from someone I&#39;d never heard  of:<br/>\n==============================================================================<br/>\n======================<br/>\n <br/>\nI was just reading your articles and I had a question for you.<br/>\n <br/>\nOur two girls, ages 7 and 8 1/2 are very smart and expressive. They are  <br/>\noutspoken and upset when they don&#39;t get their way.<br/>\n <br/>\nIt always happens that when we spend a day out with them and buy them  things <br/>\nor take them places, and then they may not get just one thing because  either <br/>\nit is too late, or we just don&#39;t have the money - they get angry, yell,  tell <br/>\nus they hate us, etc. The older one more than the younger. I end up getting  <br/>\nreally angry at them and try to defend our situation. Then I have told them <br/>\nthey  are spoiled and not grateful for everything we have tried to do for them.<br/>\n <br/>\nI should add that we haven&#39;t had a lot of money lately because I have been  a <br/>\nstay at home mom. Life has been miserable not being able to enjoy things the  <br/>\nway we used to. But I think I am returning to work in a few weeks and I am  <br/>\nafraid that now they will really be thinking they can have everything they <br/>\nwant.  Mostly because I am so happy to finally get some money in my hands. But I <br/>\nwant  to teach some values.<br/>\n <br/>\n <br/>\nI need some help on how to address this problem. I know I over react. It  <br/>\nreally hurts my feelings. I try to talk to them about how we want to take them  <br/>\nplaces and do things, but they have to understand we can only do so much. They  <br/>\nseem to understand, but when it actually happens, they just can&#39;t be patient <br/>\nor  just enjoy all the other things they had going for them throughout the  <br/>\nday.<br/>\n <br/>\nAny suggestions greatly appreciated.<br/>\n <br/>\n===============================================<br/>\n <br/>\n<br/>\n Are you homeschooling?  <br/>\nAre you on the UnschoolingDiscussion list or AlwaysLearning?<br/>\n <br/>\nIf your girls are in school, the things I write might be removed from the  <br/>\nrealities of your life.  <br/>\n <br/>\nLet me know a little more about your situation.<br/>\n <br/>\n <br/>\nI can say that saying &quot;you are spoiled and ungrateful&quot; wouldn&#39;t be  <br/>\nrecommended by anyone, I&#39;m pretty sure.  Saying &quot;That makes me wish we  hadn&#39;t gone, <br/>\nbecause it spoiled all the fun&quot; might be closer.  Talking  about yourself is <br/>\nfair.  Telling them they&#39;re bad is insult to  injury.  Should they not have felt <br/>\ninjured?  Maybe.  But telling  them their feelings are wrong is only going to <br/>\nmake it worse.<br/>\n <br/>\nSandra<br/>\n<br/>\n <br/>\n===============================<br/>\n <br/>\nI agree. I definitely reacted in a way that I shouldn&#39;t. But they are very  <br/>\nstrong willed kids, very creative and have no problems expressing their  <br/>\nfeelings. That can be difficult at times, because they often hurt mine when they  <br/>\ndon&#39;t get their way.<br/>\n <br/>\nNo, they are not home schooled. I have to work and I don&#39;t have the  patience <br/>\nto teach academics. I love the school they are in.<br/>\n <br/>\nI want to teach them to enjoy the things we can do for them, but not be so  <br/>\nangry when they don&#39;t get their way. I want them to learn patience. I know that <br/>\n their behavior comes from some of our behaviors as parents, it is just hard <br/>\nto  recognize them when they are happening.<br/>\n <br/>\nThank you for your input.<br/>\n <br/>\n<br/>\n=======================================<br/>\n<br/>\nBut they  are very strong willed kids, very creative and have no problems <br/>\nexpressing  their feelings. That can be difficult at times, because they often <br/>\nhurt mine  when they don&#39;t get their way.<br/>\n<br/>\n<br/>\nI used to get my feelings hurt when my kids were younger, but I worked  <br/>\nconsciously on getting over that.  They need to have a safe place to  practice <br/>\ninterpersonals, and they NEED home as a haven to relax, especially as  they go to <br/>\nschool.<br/>\n <br/>\nSchool is stressful.  It is a HUGE wad of not getting your way.  <br/>\n <br/>\nKids at home get lots of their parents in all kinds of ways.   Schoolkids <br/>\noften get a lot of parents-backing-up-school time about homework and  bedtimes <br/>\nand get-your-clothes-ready.<br/>\n <br/>\nTrying to make home less school focussed might help.  Spending more  <br/>\none-on-one time with the girls might help.  <br/>\n <br/>\nWith my kids to keep them from being competitive at a time and dollar  level, <br/>\nwe purposely and early on did very different things and got them very  <br/>\ndifferent things, discussing all the while why this or that thing would be ideal  <br/>\nfor this particular child.  They all knew they would have special stuff and  <br/>\nexperiences too, so they haven&#39;t been the kinds of kids who say &quot;You spent $10  <br/>\non her, you have to spend $10 on me.&quot;   We spent time recently with a  family <br/>\nthat was exactly that way, but partly it might be because the dad  died a few <br/>\nyears ago and the kids don&#39;t have as much opportunity to be alone  with the mom.<br/>\n <br/>\n-=-I want to teach them to enjoy the things we can do for them, but not be  <br/>\nso angry when they don&#39;t get their way. I want them to learn patience.-=-<br/>\n <br/>\nIf you weren&#39;t invested in schooling, I could say some things about  this.  <br/>\nTeaching and learning rarely happen in conjunction.  There are  things you <br/>\ncan&#39;t &quot;teach&quot; them, but you can help them learn.  It would help  if you, at least, <br/>\nwould look into the difference.  If you see opportunities  through which they <br/>\ncan learn, and you could discuss the situation with them  without feeling <br/>\nlike you&#39;re &quot;teaching&quot; them, it would change your relationships  in good ways.<br/>\n <br/>\nHere&#39;s something about that:<br/>\n_<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/wordswords_\">http://sandradodd.com/wordswords_</a> (<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/wordswords)\">http://sandradodd.com/wordswords)</a> <br/>\n <br/>\n <br/>\nMy overriding guess is the kids are feeling needy and don&#39;t feel they  <br/>\nshould.  You don&#39;t need to discuss that with them, just give them more of  yourself, <br/>\nmore casual touch, more attention, more listening, more personal  cushion.<br/>\n <br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":107043,"nextTopicId":107079}}