{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":0,"authorName":"adarl52357@aol.com","from":"adarl52357@...","replyTo":"LIST","senderId":"FCYo2sPSESwoBmrBP824lZS1WarUFjIG2NgrtEYBECREZBkyrQMG2muGThM8MK1mAV1jmCT4rt4J","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Aware baby, was To Amy re nursing toddlers","postDate":"977376020","msgId":14704,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGI5LjlkYTJmMjMuMjc3MmVkMTRAYW9sLmNvbT4="},"prevInTopic":14693,"nextInTopic":0,"prevInTime":14703,"nextInTime":14705,"topicId":14693,"numMessagesInTopic":0,"msgSnippet":"In a message dated 12/20/00 4:52:13 PM Pacific Standard Time, diamondair@email.msn.com writes: ","messageBody":"<div id=\"ygrps-yiv-1395030409\">In a message dated 12/20/00 4:52:13 PM Pacific Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:diamondair@...\">diamondair@...</a> writes:<br/>\n<br/>\n&lt;&lt;  If Solter&#39;s theory were<br/>\n correct, I would think you would find the opposite. My own anecdotal<br/>\n evidence suggests that Solter&#39;s theory is backwards.  &gt;&gt;<br/>\n<br/>\n    I find that each approach has it&#39;s merits and perhaps all of them go a <br/>\nbit too far with their theories. Ultimately we need to be authentic with our <br/>\nchildren and tune in to each unique child and each situation. I too am needy <br/>\nand have addictive tendencies. I know that part of the reason is not having <br/>\nbeen nursed or nurtured enough as a baby. On the other hand I found Solter&#39;s <br/>\napproach to be useful when my son was an older baby. I also do my best to <br/>\ncommunicate clearly and learned a lot from &quot;How to Talk....&quot;<br/>\n    As for expressing anger there&#39;s a time and a necessity for self <br/>\nexpression and release of emotion. There&#39;s also a need to learn self <br/>\ncontainment. A lot of this is, I think, developmental. We focused a lot on <br/>\nlearning about feelings and their expression when the kids were little. As <br/>\nthey got older we found we needed to learn more about self containment. Still <br/>\nit&#39;s all pretty much out in the open around here;&gt;)</div>","specialLinks":[]},{"userId":0,"authorName":"DiamondAir","from":"&quot;DiamondAir&quot; &lt;diamondair@...&gt;","replyTo":"LIST","senderId":"NQ_5IkcijmaO7wjai1p4bMAe6Qauho92FGLpSORzeN8WBWp3c-ORTtnZ78QdfYqWUV335eBDMdnn3egxTIR78VbFAsicwlM3_dleiE0J","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Aware baby, was To Amy re nursing toddlers","postDate":"977359373","msgId":14693,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMWIwMWMwNmFlNyRkZmFmYmQ4MCRiNmQ0MGUzZkA4MzhmMzAxPg==","referencesHeader":"PDk3NzI1NzY3NC41NzMyMkBlZ3JvdXBzLmNvbT4="},"prevInTopic":0,"nextInTopic":14704,"prevInTime":14692,"nextInTime":14694,"topicId":14693,"numMessagesInTopic":0,"msgSnippet":"... I do agree that as people in our culture we seem to be very concerned with keeping kids quiet and not allowing them to express their feelings. I really ","messageBody":"<div id=\"ygrps-yiv-1373673968\"><blockquote><span title=\"ireply\">&gt;    From: &quot;Nicoletta Manns&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:snmanns@...\">snmanns@...</a>&gt;<br/>\n&gt; Aletha Solter says that even young babies experience stress, toddlers<br/>\n&gt; even more so. I don&#39;t think we can argue that point. She goes on to<br/>\n&gt; say, however, and this is where some people cringe, that<br/>\n&gt; babies/toddlers/children need to be allowed to cry and rage to<br/>\n&gt; release these stresses from their bodies. She says that babies who<br/>\n&gt; have not released stress may use nursing as a &quot;control pattern&quot; to<br/>\n&gt; suppress their upset feelings and that it can lead to further control<br/>\n&gt; pattern later in life, in other words: addictive behaviours like<br/>\n&gt; smoking, drinking, over eating, watching too much TV, being on the<br/>\n&gt; computer too much :-) etc....<br/>\n<br/>\n<br/>\n </span></blockquote>I do agree that as people in our culture we seem to be very concerned with<br/>\nkeeping kids quiet and not allowing them to express their feelings. I really<br/>\nlike the &quot;How to talk so Kids Will Listen and Listen so Kids Will Talk&quot;<br/>\nseries of books for this reason, they talk about naming the child&#39;s feelings<br/>\nwithout judging and I&#39;ve found that works really well for my kids (even my<br/>\nbaby). If they are upset I will help them to understand what is happening<br/>\nwithout putting a judgement on it, e.g. &quot;You sound very angry&quot;, or &quot;that<br/>\nmade you sad and made you feel like really crying&quot;. OTOH, we also do set<br/>\nlimits on where/when this is acceptable. It is not acceptable to rage/cry in<br/>\na movie theatre for instance where others are trying to hear the movie.<br/>\n<br/>\nOTOH, I think that nursing is a fine comfort and that babies/toddlers/kids<br/>\nwill take exactly as much of it as they personally need. My son is a big<br/>\ncomfort nurser and that&#39;s how he tends to want to resolve things, nurse and<br/>\nsnuggle. My daughter is not, she would rather rage or bang her head against<br/>\na wall to show me how mad she is. Only when she&#39;s truly over the rage or<br/>\nsadness will she nurse or even let me touch her. They each know what they<br/>\nneed in order to deal with overwhelming emotions, I just need to trust in<br/>\nthat. I don&#39;t believe that nursing leads to addictive behavior, indeed I<br/>\nfeel the opposite. A need unmet shows up over and over in life. My<br/>\ngeneration (born in the 60&#39;s) is probably the least-breastfed generation of<br/>\nAmericans ever, and we have huge problems with addictive behavior. Only 20%<br/>\nof us were breastfed at all, most of them for only a few weeks, yet as a<br/>\ngeneration we seem to have overhwhelming addictions to alcohol, cigarettes,<br/>\ngambling, drugs, shopping, watching TV, etc.. If Solter&#39;s theory were<br/>\ncorrect, I would think you would find the opposite. My own anecdotal<br/>\nevidence suggests that Solter&#39;s theory is backwards. My husband and one of<br/>\nhis brothers were the only ones breastfed out of 7 children, and the only<br/>\nones without any addictions (the others are alcoholic, obese, addicted to<br/>\ngambling, etc.). I was breastfed for over a year and suffer no addictions<br/>\nthat I know of. I only know a few adults who were nursed for longer than a<br/>\nyear or two, but all of them seem to be remarkably well-adjusted<br/>\nindividuals. So, although I know this is purely anecdotal, I find it hard to<br/>\nbelieve these theories, especially coupled with the societal evidence I<br/>\nmentioned before.<br/>\n<br/>\nI find that following your baby&#39;s lead with how they need to resolve things<br/>\n(whether that is a need for nursing, holding, cuddling, or just standing<br/>\nthere in loving silence while they get it all out) is probably a better<br/>\nguide than anything, and that leads directly into following your child&#39;s<br/>\nlead with learning, and them being able to follow their own lead with<br/>\nregards to life.<br/>\n<br/>\n<br/>\nBlue Skies!<br/>\n  -Robin-<br/>\nMom to Mackenzie (8/28/96) &quot;What if there was no gravity, but we all held on<br/>\nto something really tight??&quot;<br/>\nand Asa (10/5/99) who says &quot;Odwalla!&quot; (her favorite treat at the store)<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.geocities.com/the_clevengers\">http://www.geocities.com/the_clevengers</a>   Flying Clevenger Family</div>","specialLinks":[]}],"prevTopicId":14700,"nextTopicId":14641}}