{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":49804702,"authorName":"Bob Iyall","from":"&quot;Bob Iyall&quot; &lt;bob_iyall@...&gt;","profile":"wertheimer_iyall","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Deschooling, Boredom and Anxiety","postDate":"1074935243","msgId":18438,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTUtREFWMTIybzQwMVIyWHUwMDAwZWQ1MEBob3RtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":18437,"nextInTime":18439,"topicId":18438,"numMessagesInTopic":0,"msgSnippet":"Hi, I just wanted to thank Laura M. for her kind response to my long winded email earlier today. We feel our ET is indeed a very gifted and creative being and","messageBody":"<div id=\"ygrps-yiv-831509285\">Hi,<br/>\nI just wanted to thank Laura M. for her kind response to my long winded email earlier today. We feel our ET is indeed a very gifted and creative being and are doing all we can to show her open doorways to explore, and teach her to trust and love herself. She has never been medicated, except for allergies and infections. But she was all too aware of bad medicine practice a few years back when our HMO decided to give  DH tranquilizers and  more for chronic pain management. He had a paradoxical response to the drugs, and it increased his anxiety to the point he was a different person altogether. It then took many weeks to slowly get all that nasty stuff out of his system. The drugs that were supposedly non addicting, created lengthy withdrawal problems for him. I think that is when ET decided that medicine was not a safe prospect. Many times I have wished for a volume knob on this child; to dial down the intensity of her awareness and sensitivity so she could be more comfortable in the world outside our cozy home. But then she wouldn&#39;t have all the raw material she uses to create from. I agree that creativity really isn&#39;t about producing output. Those nesting in the dark days are just the thing needed to find the next segment in a novel she is writing, or dream an image that needs painting. My DH is a Fine Art Photographer and has studied many artists, I do my own creative self therapy in clay and fibers. I guess ET landed in a family that is a good fit for her &lt;G&gt;. Tonight ET & I had fun making necklaces while watching Monk. We spread all the bead boxes out on the floor and while I was waffling over color and composition on a gift for a buddy, she found a very large rose quartz bead and created a lovely necklace for herself. &quot;Rose quartz is calming&quot;, she explained, &quot;and I thought that sounded like a good idea&quot;. Being surrounded by a rainbow of glass beads tonight felt grand!<br/>\nI&#39;m off to bed, Thanks for the support!<br/>\nSheri<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":18428,"nextTopicId":18395}}