{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1294635,"authorName":"HEM-Online-Newsletter  by way of Home Ed","from":"HEM-Online-Newsletter &lt;HEM-Editor@...&gt; (by way of Home Education Magazine)","profile":"hemhelen","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"HEM&#39;s Online News -  March 2003","postDate":"1047160195","msgId":60454,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PHAwNTAwMTk0ZGJhOTAxNWZiNjNhYkBbMTIuMjEuMjA4LjExNF0+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":60453,"nextInTime":60455,"topicId":60454,"numMessagesInTopic":0,"msgSnippet":"^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^ HOME EDUCATION MAGAZINE S ONLINE NEWS March 2003 ^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^ Welcome to HEM S ONLINE NEWS! For more","messageBody":"<div id=\"ygrps-yiv-2019386075\">^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^<br/>\n<br/>\nHOME EDUCATION MAGAZINE&#39;S ONLINE NEWS<br/>\nMarch 2003<br/>\n<br/>\n^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^<br/>\n<br/>\nWelcome to HEM&#39;S ONLINE NEWS! For more information on Home Education <br/>\nMagazine, see the end of this newsletter or visit our web site at <br/>\nhttp://home-ed-magazine.com.<br/>\n<br/>\nIn the March issue:<br/>\n<br/>\n~ Good-bye ~<br/>\n~ Circles ~<br/>\n~ Extracting DNA ~<br/>\n~ Ask Carol ~<br/>\n~ unschooling.com ~<br/>\n~ Online Learning ~<br/>\n~ NHEN Advocacy Report ~<br/>\n~ The MegaPenny Project ~<br/>\n~ HEM Lists ~<br/>\n~ National What Month? ~<br/>\n~ Equipped to Survive ~<br/>\n~ The Final Word ~<br/>\n<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nSome contend, in poetry, that the mind is dangerous and should be <br/>\nleft out. Well, the mind is dangerous and should be left in. ~~ <br/>\nRobert Frost ~~<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nGOOD-BYE<br/>\n<br/>\nThis is the most difficult part of this month&#39;s newsletter to write, <br/>\nbecause this is my &quot;good-bye&quot; as the editor of HEM&#39;s Online News. My <br/>\nfirst newsletter was the April, 1999 issue only four short years ago. <br/>\nDuring those four years I&#39;ve learned a lot just by surfing the <br/>\nInternet to find the best websites and resources to pass on to you. <br/>\nBut more than that, I&#39;ve been blessed to write for some of the <br/>\nkindest, most complimentary subscribers an editor could hope for. OK, <br/>\nand a few people who thought I missed the mark every now and then. <br/>\n:-) I&#39;ve appreciated and treasured every email I&#39;ve received, and I <br/>\nthank all of you who wrote and told me your stories and your <br/>\nopinions. Thank you for reading and sharing the joys of homeschooling <br/>\nwith me.<br/>\n<br/>\nI&#39;m not leaving HEM though. I&#39;ll still write the Ask Carol column for <br/>\nevery issue of Home Education Magazine, and last fall I took over as <br/>\narticles editor. So instead of websites, excerpts and resource <br/>\nrecommendations, I&#39;ll be bringing you the best homeschooling articles <br/>\nyou&#39;ll find in any magazine. If you ever want to get in touch, you <br/>\ncan email me at HEM-articles@ home-ed-magazine.com.<br/>\n<br/>\nShay Seaborne will take over as editor with the April issue. Shay is <br/>\nan experienced editor and writer who will keep you entertained and <br/>\ninformed every month in her own special way. Welcome, Shay!<br/>\n<br/>\nThanks for reading!  ~~ Carol Narigon ~~<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nCIRCLES<br/>\nhttp://www.home-ed-magazine.com/HEM/202.html<br/>\n<br/>\nLove seems like the best of all reasons for homeschooling. Not the <br/>\nonly reason, of course--there are as many different reasons as there <br/>\nare children to be homeschooled--but the love a parent feels for his <br/>\nchildren ensures a desire to keep those children from harm&#39;s way, to <br/>\nprotect and defend them from any perceived dangers, whether physical, <br/>\nemotional, or bureaucratic. The experts might not understand it, and <br/>\nmight in fact even disagree, but parents have the right--indeed, they <br/>\nhave the responsibility--to intervene when their children need help, <br/>\nprotection, or assistance in finding another way.<br/>\n<br/>\nThousands of parents have started down the path toward homeschooling <br/>\nby doing nothing more than acting on their love for their children. <br/>\nMark has often said all you need to homeschool successfully is love <br/>\nand a library card, and the library card is optional. Listen to your <br/>\nheart and trust yourself, and trust your children.<br/>\n<br/>\nWhen my children were small I remember sometimes sitting and just <br/>\nwatching them be children, playing or scuffling or reading or <br/>\nsleeping, and my heart would just ache to see how quickly they were <br/>\ngrowing up, mastering the mechanics of life, racing through childhood <br/>\nto take their own place as parents. I watch our sons now with their <br/>\nown young children and I see that same light of love, that <br/>\nbittersweet knowledge that the days of childhood are so special, so <br/>\naltogether fleeting and short.<br/>\n<br/>\nBabies grow so quickly into toddlers, and toddlers grow into young <br/>\nchildren, who will be stretching into teenagers before you know it. <br/>\nThe hours and days and years we&#39;re given to spend with them are so <br/>\nfew, so very small a piece of one&#39;s lifetime. And yet schooling <br/>\neasily consumes the bulk of childhood: Five to six hours per day or <br/>\nmore, five days a week, for three-quarters of each year, for twelve <br/>\nlong years. So much of a child&#39;s time; so much of a parent&#39;s rightful <br/>\njoy.   ~~ HEM managing editor Helen Hegener in the brand-new <br/>\nMarch/April issue of Home Education Magazine ~~<br/>\n<br/>\nYou can read the rest of this article, as well as a couple other <br/>\narticles and columns from the current HEM at the address above, but <br/>\nyou&#39;ll have to get the magazine--the one you hold in your hands--to <br/>\nread them all! See special subscription information in this <br/>\nnewsletter, or visit your local bookseller to get your copy today.<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nEXTRACTING DNA<br/>\n<br/>\nIn February our thoughts turn to science and our homeschool group&#39;s <br/>\nannual science fair. This year the project my daughter and I did was <br/>\nso much fun I just had to share it with you. Believe it or not, we <br/>\nextracted DNA from her cells and from wheat germ. Although the <br/>\nscience fair is over, we intend to tease out DNA from onions and <br/>\nyeast as well.<br/>\n<br/>\nWho would have thought you could do that in your own kitchen? It <br/>\nwasn&#39;t as hard as it sounds, and you may have everything you need <br/>\nalready in your kitchen cupboards. Even kids as young as 6 can <br/>\nprobably do this with lots of help from you. Here are some of the <br/>\nwebsites we used:<br/>\nhttp://gslc.genetics.utah.edu/units/activities/extraction<br/>\nhttp://www.nal.usda.gov/bic/Education_res/protocols/onion.extract.html<br/>\nhttp://www.onlyinternet.net/preceptor/rm118/downloading%20files/dna.doc<br/>\nhttp://gslc.genetics.utah.edu/units/activities/wheatgerm<br/>\n<br/>\nAlthough most sites call for beakers and test tubes, we made do with <br/>\nwhat we had-glass measuring cups and spoons and small jars. We did <br/>\nget some ethyl alcohol at the pharmacy, but had good luck with <br/>\nregular rubbing alcohol as well. Have fun!<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nASK CAROL<br/>\n<br/>\nIn addition to editing this newsletter, I write a column for Home <br/>\nEducation Magazine. Now, I don&#39;t want to take Dear Abby&#39;s place, but <br/>\nI will take those thorny questions and problems you struggle with and <br/>\ntry to give you some options or information that might help you. <br/>\nAlthough I don&#39;t answer the questions in this newsletter (this month <br/>\nis an exception), I do answer them in every issue of HEM, the <br/>\noriginal print version where homeschoolers have found support for <br/>\nover 20 years. A couple of them are online <br/>\n(http://www.home-ed-magazine.com), but most you have to read in the <br/>\nmagazine.<br/>\n<br/>\nI really like to get your questions-any questions at all, even if you <br/>\nthink your question is too stupid and you&#39;re the only one who has <br/>\nyour particular problem (probably not true). So, don&#39;t be shy; don&#39;t <br/>\nprocrastinate; send me your questions. I even have a special email <br/>\naddress: askcarol@... . Of course, I don&#39;t promise I <br/>\ncan answer every question in the magazine (especially if you don&#39;t <br/>\nsend one!), but I try to respond to each one, whether I use it for a <br/>\ncolumn or not. Don&#39;t wait! (~ CN ~)<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nUNSCHOOLING.COM<br/>\nhttp://www.unschooling.com<br/>\n<br/>\nBeginning unschoolers need to REALLY be with their kids, a lot. <br/>\nLetting a month or a year go by thinking that after that time you&#39;ll <br/>\nREALLY concentrate on unschooling can lead to discouragement on the <br/>\npart of everyone concerned, and until the parents really see and <br/>\nbelieve how natural learning works, they&#39;re in danger of throwing in <br/>\nstructure to appease their internal fears.<br/>\n<br/>\nIf someone says &quot;What? I have to spend six hours a day being an <br/>\nunschooling mom?&quot; I think no, the answer is you have to spend twenty <br/>\nfour hours a day being an unschooling mom.<br/>\n<br/>\nIt&#39;s not going to take LESS time and energy to have kids home instead <br/>\nof in school. The energy is different, and that&#39;s good. The energy is <br/>\nless on someone else&#39;s schedule (few to none of those panicky <br/>\nmornings when forms weren&#39;t signed, fees aren&#39;t available, lunch <br/>\nisn&#39;t made, socks aren&#39;t clean, bus is coming), but the kids still <br/>\nhave the same amount of time in their days and if they&#39;re to spend it <br/>\nstaying out of the way of a housecleaning mom, it&#39;s possible, in some <br/>\ncases, that they&#39;d be better off in school.<br/>\n<br/>\nWhen there&#39;s only one child, I think the moms should put some extra <br/>\nenergy into finding play partners, other families with kids, trading <br/>\nout trips to little parks with playgrounds, or SOMETHING to keep from <br/>\nbeing their child&#39;s sole source of entertainment. Unless it&#39;s in the <br/>\nchild&#39;s personality and the mom&#39;s too that they&#39;re quite sufficiently <br/>\nenough for each other week after week. It does happen. It didn&#39;t <br/>\nhappen with me and Kirby. He wanted to see OTHER people&#39;s stuff and <br/>\nother people&#39;s houses and other people&#39;s dogs and cats and cars. ~~ <br/>\nSandra Dodd on the unschooling.com message board~~<br/>\n<br/>\nUnschooling.com offers a free monthly newsletter, message boards, an <br/>\nemail list and more just for unschoolers. To subscribe to the email <br/>\nlist send a blank email to:<br/>\nUnschooling-dotcom-subscribe@yahoogroups.com<br/>\nOr visit the email list website at: <br/>\nhttp://groups.yahoo.com/group/Unschooling-dotcom .<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nONLINE LEARNING<br/>\nwww.WorldWideLearn.com<br/>\n<br/>\nWorld Wide Learn claims to be the largest online directory for online <br/>\neducation. I believe it. Divided into 155 subject areas, this site <br/>\ncontains links to hundreds (maybe thousands) of places where you can <br/>\ntake classes online. I found many that were free; others require a <br/>\nfee, but you can sometimes receive a discount if you take a for-fee <br/>\nclass through the World  Wide Learn website. You can choose from <br/>\nonline degree programs, business and training courses, single classes <br/>\nand continuing education programs. If you&#39;re interested in learning <br/>\nsomething new, why not give this site a glance.<br/>\n<br/>\n  &lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nHEM&#39;S CURRENT ISSUE<br/>\n<br/>\nIn the March/April issue of Home Education Magazine, you&#39;ll enjoy <br/>\narticles on conkers, how one family learned history with hamsters, <br/>\nthe ABC&#39;s of unschooling, hosting a Japanese student, being an <br/>\neclectic heretic and more. Column topics include: Linda Dobson <br/>\nwatches a baby learn; Laura Weldon decides about preschool; Ann Zeise <br/>\ngoogles; and Elizabeth McCullough reviews 2 new homeschool books. <br/>\nOther columnists include Larry and Susan Kaseman, Sandra Dodd, Becky <br/>\nRupp, David Albert and Carol Narigon. HEM also offers a popular essay <br/>\nby publisher Helen Hegener, classified ads, letters and discussion, <br/>\npen pals and networking, and more.<br/>\n<br/>\nTo mark our 20th year, Home Education Magazine is offering a one year <br/>\nintroductory subscription for $20.00! (reg $32.00)<br/>\n<br/>\nTo take advantage of this price mention HEM Online News when <br/>\ncontacting us. To order write: Home Education Magazine, PO Box 1083, <br/>\nTonasket WA 98855; call toll-free 1-800-236-3278; email <br/>\norders@....  Or use our secure online form at: <br/>\nhttp://www.home-ed-magazine.com/ORD/_hemonline.html.<br/>\nMC/Visa/Disc cards accepted.<br/>\n<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nNHEN ADVOCACY REPORT<br/>\nwww.nhen.org<br/>\n<br/>\nThe NHEN Advocacy Report informs the homeschooling community about <br/>\nany legal/legislative networking by NHEN members as well as sharing <br/>\ntopics that are being discussed on the busy NHEN-Legislative <br/>\nyahoogroup list. The newsletter is published monthly, but more <br/>\nfrequently if events warrant. Read the current issue of the NHEN <br/>\nAdvocacy Report posted in the Legal/Legislative section at <br/>\nhttp://www.nhen.org/news/include_advocacy.asp?IDCategory=5.<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nTHE MEGAPENNY PROJECT<br/>\nhttp://www.kokogiak.com/megapenny<br/>\n<br/>\nEver wonder what a thousand pennies looks like? OK, you&#39;ve got that <br/>\nmany in a jar under your bed, right? How about a million pennies? A <br/>\nbillion? A quadrillion? The MegaPenny Project attempts to give you <br/>\nsome perspective on the many penny situation. In addition to a visual <br/>\nmodel, they give you height, weight, value and area. Next time your <br/>\ncurious child asks how many a million is, this is a site where you <br/>\ncan try to get a grasp of large amounts of small copper disks.<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nHEM LISTS<br/>\n<br/>\nHome Education Magazine offers almost a dozen free email lists for <br/>\nhomeschoolers. You can check out any of the lists below at the <br/>\nwebsites listed or send an email to HEM-editor@... <br/>\nand type &quot;Free Email Lists&quot; in the subject line.<br/>\n<br/>\n* HEM Networking<br/>\nFor more information about the HEM-Networking List, or to join the<br/>\nlist, visit this website: <br/>\nhttp://groups.yahoo.com/community/HEM-Networking or send a blank <br/>\nemail message to HEM-Networking-subscribe@yahoogroups.com.<br/>\n<br/>\n* HEM Political Action<br/>\nhttp://groups.yahoo.com/group/HEM-PoliticalAction<br/>\nemail: HEM-PoliticalAction-subscribe@yahoogroups.com<br/>\n<br/>\n* HEM Unschooling<br/>\nhttp://groups.yahoo.com/group/HEM-Unschooling<br/>\nemail: HEM-Unschooling-subscribe@yahoogroups.com<br/>\n<br/>\n* HEM Support Groups<br/>\nhttp://groups.yahoo.com/community/HEM-SupportGroups<br/>\nemail: HEM-SupportGroups-subscribe@yahoogroups.com<br/>\n<br/>\n* HEM Conferences<br/>\nhttp://groups.yahoo.com/community/HEM-Conferences<br/>\nemail: HEM-Conferences-subscribe@yahoogroups.com<br/>\n<br/>\n* HEM Homeschooling Resources<br/>\nhttp://groups.yahoo.com/community/HEM-Resources<br/>\nemail: HEM-Resources-subscribe@yahoogroups.com<br/>\n<br/>\n* HEM Movielovers<br/>\nhttp://groups.yahoo.com/community/HEM-Movielovers<br/>\nemail: message to HEM-Movielovers-subscribe@yahoogroups.com<br/>\n<br/>\n* HEM EdPrograms<br/>\nhttp://groups.yahoo.com/community/HEM-EdPrograms<br/>\nemail: HEM-EdPrograms-subscribe@yahoogroups.com<br/>\n<br/>\n* HEM Writers<br/>\nhttp://groups.yahoo.com/community/HEM-Writers<br/>\nemail: HEM-Writers-subscribe@yahoogroups.com<br/>\n<br/>\n* HEM&#39;s History of Homeschooling<br/>\nhttp://groups.yahoo.com/community/HistoryofHomeschooling<br/>\nemail: HistoryofHomeschooling-subscribe@yahoogroups.com<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nNATIONAL WHAT MONTH?<br/>\n<br/>\nMost people know this is Women&#39;s History Month. One of the best <br/>\nwebsites for links and resources is the National Women&#39;s History <br/>\nProject site at http://www.nwhp.org/tlp/links/links.html. For more <br/>\ninformation, check out the women&#39;s history page at about.com at <br/>\nhttp://womenshistory.about.com.<br/>\n<br/>\nDon&#39;t stop with women&#39;s history, though. Did you know March is also <br/>\nIrish-American Heritage Month? You can learn a lot at Conrad Bladey&#39;s <br/>\nIrish Studies Pages, where you&#39;ll find stories, folklore, <br/>\nbiographies, music and crafts.<br/>\nhttp://www.ncf.carleton.ca/~bj333/HomePage.home.html#Main<br/>\n<br/>\nLooking for more unusual topics for the month? How about National <br/>\nFrozen Food Month (I&#39;d celebrate with ice cream), National Craft <br/>\nMonth (http://www.i-craft.com), Optimism Month (for those who believe <br/>\nspring will finally come), National Umbrella Month (you&#39;ll need one <br/>\nif spring ever comes and Play-The-Recorder Month <br/>\n(http://ourworld.compuserve.com/homepages/recorder). For more unusual <br/>\nobservances, both monthly and daily, check out <br/>\nhttp://www.brownielocks.com/march.html.<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nEQUIPPED TO SURVIVE<br/>\nwww.equipped.org<br/>\n<br/>\nSurvival is on a lot of people&#39;s minds right now. Here&#39;s an excellent <br/>\nwebsite with information on surviving all kinds of situations. The <br/>\neditor of the website has this to say about it:<br/>\n<br/>\n&quot;The Equipped To Survive Web site provides an excellent resource for <br/>\nchildren and adults on the subject of survival in wilderness, marine, <br/>\nand aviation environments.  It is used regularly by students <br/>\nresearching school assignments, by teachers assigning projects and <br/>\nhomework and by homeschoolers.<br/>\n<br/>\nThe site also includes a special section for children, &quot;Survival For <br/>\nKids,&quot; (http://www.equipped.org/kidsrvl.htm) that provides <br/>\npotentially lifesaving survival information written especially for <br/>\nchildren K-8 and their parents. The Web site is supported by the <br/>\nnon-profit Equipped To Survive Foundation.&quot;<br/>\n<br/>\n<br/>\n^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^<br/>\n<br/>\nHEM ONLINE NEWS UNCLASSIFIED ADVERTISING<br/>\n<br/>\nFor information on purchasing unclassified advertising space in this <br/>\nnewsletter, please contact the editor at <br/>\nHEM-Newsletter@....<br/>\n_________<br/>\n<br/>\nPOWER-GLIDE<br/>\n<br/>\nIT&#39;S EASY TO TEACH LANGUAGE with Power-Glide! Fully accredited <br/>\nforeign language courses made with the &quot;non-speaking&quot; instructor in <br/>\nmind. Whether you&#39;re a teacher, homeschooling parent, or just want to <br/>\nlearn on your own; NO previous language knowledge is required. Just <br/>\nread what our customers say about our courses!<br/>\n<br/>\n&quot;With Power-Glide you won&#39;t be intimidated to teach a foreign <br/>\nlanguage, and people will wonder where your child prepped.&quot; - Kathy <br/>\nvon Duyke, Editor: KONOS Helps!<br/>\n<br/>\nREAD MORE testimonials here:<br/>\nhttp://www.power-glide.com/testimonials.asp?from=HEM_eNewsletter_March<br/>\nORDER NOW at: http://www.power-glide.com/?from=HEM_eNewsletter_March<br/>\n<br/>\n________<br/>\n<br/>\nUSBORNE<br/>\nUsborneAmerica.com<br/>\n<br/>\nCastles, our newest internet-linked history title, will entice and <br/>\ndelight everyone in your family!  Browse our new titles list and <br/>\nenter a drawing for $50 in free books at <br/>\nhttp://www.UsborneAmerica.com.  Email sharonve@... or call <br/>\n888-474-8499 for personal shopping service.  Sharon Vander Ende, <br/>\nIndependent supervisor, Usborne America.<br/>\n________<br/>\n<br/>\nGNARLY MATH<br/>\n<br/>\nNEW! HOMESCHOOLER BARGAIN. 25% OFF FOR FIVE COPIES of our CD-ROM <br/>\nSolid Gold Gnarly Math. You and four other homeschool families can <br/>\nthen learn how to make algebra, geometry, trig, and probability easy, <br/>\nnatural, and fun. Go to http://www.gnarlymath.com to learn more and <br/>\nto subscribe to our free math newsletter. This month the Gnarly Gnews <br/>\ntakes you back to Egypt in 2590 BC, and teaches you how the Egyptians <br/>\nwrote hieroglyphics, and how they found the area of a circle.<br/>\n_________<br/>\n<br/>\nTHE RESOURCEFUL HOMESCHOOLER<br/>\nresourcefulhomeschooler.com<br/>\n<br/>\nLooking for something to do? Why not:  ** Stage a Costume Ball from <br/>\nthe Middle Ages ** Fly Through Human Anatomy ** Take a Virtual Walk <br/>\nthrough the Rainforest ** Program a Robot ** Build a Computer Game ** <br/>\nThe Resourceful Homeschooler carries great books, science materials <br/>\nand kits, learning games, and the most interesting software. Visit <br/>\nhttp://www.resourcefulhomeschooler.com. Materials to involve, inspire <br/>\nand support independent learners of all ages!<br/>\n_________<br/>\n<br/>\nTEACH YOUR CHILD TO READ!  TRY ONLINE LESSONS NOW FOR FREE!<br/>\nHeadsprout.com<br/>\n<br/>\nHeadsprout Reading is the fun, Internet-delivered beginning reading <br/>\nprogram that will give your child a real advantage by systematically <br/>\nteaching essential skills and strategies ensuring reading success and <br/>\nconfidence. Outstanding fast results!  After just five 20-minute <br/>\nanimated, interactive episodes, children read their first Headsprout <br/>\nbook. Act quickly! For a limited time you can try out Headsprout <br/>\nReading FOR FREE!<br/>\nhttp://www.headsprout.com Please enter the promotional code: HENC3<br/>\n<br/>\n<br/>\n^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^<br/>\n<br/>\nFINAL WORD<br/>\n<br/>\nhttp://www.exploratorium.edu/exhibits/ladle<br/>\n<br/>\n^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^<br/>\n<br/>\nThanks for reading HEM&#39;s Online News! Pass it on to your friends! To <br/>\nsubscribe, visit our web site at <br/>\nhttp://www.home-ed-magazine.com/wlcm_hemnewsltr.html or send an email <br/>\nto majordomo@... with the words subscribe <br/>\nhem-online-newsletter followed by your name@your address.com in the <br/>\nbody of the email. (e.g. subscribe hem-online-newsletter <br/>\nyouremailaddress). To unsubscribe, send an email to <br/>\nmajordomo@... with the words unsubscribe <br/>\nhem-online-newsletter followed by your name@your address.com in the <br/>\nbody of the email. (e.g. unsubscribe hem-online-newsletter <br/>\nyouremailaddress). To change the address at which you receive the <br/>\nnewsletter, unsubscribe your old address and then subscribe to your <br/>\nnew one.<br/>\n<br/>\nGood-bye for now!<br/>\n<br/>\nCarol Narigon, Newsletter Editor<br/>\nHEM-Newsletter@...<br/>\nMark and Helen Hegener, Publishers of Home Education Magazine</div>","specialLinks":[]}],"prevTopicId":60189,"nextTopicId":60417}}