{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":9440128,"authorName":"ElissaJC@concentric.net","from":"&lt;ElissaJC@...&gt;","profile":"elissajc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] conversation starter","postDate":"1015860572","msgId":32251,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBhNGEwMWMxYzkxMSQ4YmJiMDBjMCRmNzI0YWRjZUBFbGlzc2FKQz4="},"prevInTopic":32249,"nextInTopic":0,"prevInTime":32250,"nextInTime":32252,"topicId":32249,"numMessagesInTopic":0,"msgSnippet":"That sounds like a really fun life. Your post made me giggle (well, chuckle, I m not really a giggle type) to the end. Emily and Max have been going up to teh","messageBody":"<div id=\"ygrps-yiv-1502332993\">That sounds like a really fun life. Your post made me giggle (well, chuckle,<br/>\nI&#39;m not really a giggle type) to the end.<br/>\nEmily and Max have been going up to teh CSA farm with me, I&#39;ve taken on the<br/>\nproject of starting herbs from seed, in order to learn more about seed<br/>\nstarting for when we move to our homestead.<br/>\nMax is very into star wars, I have started getting VERY interested in Star<br/>\nTrek: TNG, love the pseudo-science! I would like to take max to a science<br/>\nfiction/star wars/star trek convention. Any one have ideas?<br/>\nEmily and I have been focused on building her socila life. Not that it is<br/>\nreally lacking there are just some kids that she is intent on getting to<br/>\nknow better. Our unschooling community is really growing. That is the worst<br/>\nthing about moving out of the area, leaving my tribe. BUT, I&#39;ll just make a<br/>\nnew one! There&#39;s unschoolers in NYstate!<br/>\n~Elissa Cleaveland<br/>\n&quot;It is nothing short of a miracle that the modern methods of instruction<br/>\nhave<br/>\nnot yet entirely strangled the holy curiosity of inquiry.&quot; A. Einstein</div>","specialLinks":[]},{"userId":55326806,"authorName":"rumpleteasermom","from":"&quot;rumpleteasermom&quot; &lt;rumpleteasermom@...&gt;","profile":"rumpleteasermom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"conversation starter","postDate":"1015858356","msgId":32249,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGE2aWdiaytyNjB0QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":32251,"prevInTime":32248,"nextInTime":32250,"topicId":32249,"numMessagesInTopic":0,"msgSnippet":"Well, this list has been a bit too quiet lately so let s chat. What are all of your kidlets up to these days? Here s what mine are doing: DISCLAIMER -- They","messageBody":"<div id=\"ygrps-yiv-1018771787\">Well, this list has been a bit too quiet lately so let&#39;s chat.<br/>\n<br/>\nWhat are all of your kidlets up to these days?<br/>\n<br/>\nHere&#39;s what mine are doing:<br/>\nDISCLAIMER -- They signed up for this stuff on their own, so I guess <br/>\nwe can still call it unschooling.<br/>\n<br/>\nMy girls decided to take a another chemistry class this spring at a <br/>\nlocal college.  A group of homeschoolers arranged it.  My girls go <br/>\nbecause they think it&#39;s a funthing to do.  They made silly putty in <br/>\nthe first class, incinerated popcorn in the second one and are waiting <br/>\nto get to blow something up.<br/>\n<br/>\nThey also decided that their dad was never going to get around to <br/>\nhelping them get their amateur radio licenses, so they signed up for <br/>\nthe class dh&#39;s friend was starting up for a group of boy scouts.  I&#39;m <br/>\nanxious to see how they get along with the boy scouts.  They have a <br/>\npersonality conflict with the homeschoolers mentioned above.  They <br/>\njust are so plain different from the other teens that they don&#39;t fit <br/>\nin, but they don&#39;t care either and they sort of revel in it.  It&#39;ll be <br/>\ninteresting to see if they make friends with the boy scouts.<br/>\n<br/>\nThey went to youth group meeting at a friend&#39;s church yesterday.  They <br/>\ngo to be subversive, I think.  Rachel claims to be a Militant Agnostic <br/>\nProcrastinator.  Jenni is becoming a witch I think.  Alas, last night <br/>\nwas compliment night.  They sat in a circle and took turns being in <br/>\nthe middle.  They went around the circle giving compliments to the <br/>\nperson in the center.  Rachel is apparently Smart, Nice, Funny, and <br/>\nTreats those younger than herself as friends.  Jenni is Quiet, Nice, <br/>\nPatient, Has nice hair and is smart.  They both have nice boots!  But <br/>\nthey didn&#39;t get to be subtly subversive!<br/>\n<br/>\nNormally, I would discourage this behaviour and explain that other <br/>\npeople&#39;s parents may not appreciate it.  However, they keep getting <br/>\ninvited because their friend&#39;s father is trying to &quot;save&quot; them.  I <br/>\nfigure, it goes both ways.  Besides, they are having such fun with it <br/>\nand who am I to tell them what to do?<br/>\n<br/>\nWell, spring is coming.  We have had a few very warm days.  Rachel put <br/>\nin one new flower bed already.  She has many plans for more.  I&#39;ve <br/>\ngiven up trying to get my ideas in.  She is really good at designing <br/>\nthem, so, I&#39;ve decide to just let her run with it even if it isn&#39;t <br/>\nexactly what I was picturing.<br/>\n<br/>\nOther signs of spring:  <br/>\nJenni has started reading on the tree swing again.  That&#39;s like seeing <br/>\nthe first robin!<br/>\n<br/>\nAll three of my kids have decided kite flying is cool.  Now, they just <br/>\nneed to learn that kite flying with gusts up to 40 mph is not a good <br/>\nthing!<br/>\n<br/>\nWyndham is wearing his winter coat.  He only does that when it is <br/>\nwarming up.  When it was 25 degrees out, he left the house without it <br/>\non a regular basis.<br/>\n<br/>\nOther than taking care of their invalid (they pronounce it like the <br/>\nword that means &quot;not valid&quot;) mother and doing their ongoing crafty <br/>\nstuff, that about wraps  it up  I think.<br/>\n<br/>\nBridget</div>","specialLinks":[]}],"prevTopicId":26128,"nextTopicId":32262}}