{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Need Advice","postDate":"1075822531","msgId":90167,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMzLjQzOTU1ODEzLjJkNTExOWMzQGFvbC5jb20+"},"prevInTopic":90091,"nextInTopic":0,"prevInTime":90166,"nextInTime":90168,"topicId":90091,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/2/04 8:35:57 AM, kbcdlovejo@aol.com writes: ","messageBody":"<div id=\"ygrps-yiv-1177868989\">In a message dated 2/2/04 8:35:57 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kbcdlovejo@...\">kbcdlovejo@...</a> writes:<br/>\n<br/>\n&lt;&lt; I suggested that the next time it happens (because we ALL knew it would!) <br/>\nshe <br/>\nshould walk over to her mother and smack her bare thigh as hard as she could <br/>\nand scream, &quot;I&#39;ve told you and TOLD you NOT to spank my child! Don&#39;t do it <br/>\nagain!&quot; &gt;&gt;<br/>\n<br/>\nYes, but that&#39;s illegal and the mom could call the police and they would <br/>\ncome!  And the mom who hit her would probably have to go to jail (depending on <br/>\nlocal domestic violence policies).<br/>\n<br/>\nAnd it was not illegal for the grandma to smack a baby that wasn&#39;t even hers.<br/>\n<br/>\nSad, huh?<br/>\n<br/>\nWhen people I&#39;ve been with have chosen not to say anything to smacking moms <br/>\nI&#39;ve said &quot;Wouldn&#39;t you say something if a man hit a woman at WalMart?&quot;   It&#39;s <br/>\nbeen years since I&#39;ve just let something go by without saying something.  If a <br/>\nparent is being really mean to a child I at least give them the big glare and <br/>\nkeep my eyes on them until they turn away nervously and become pointedly <br/>\nnicer to the child.   I&#39;ve said &quot;Don&#39;t do that&quot; to strangers.  One cussed me.  One <br/>\nsaid &quot;Mind your own business,&quot; but I didn&#39;t avert my eyes, and they were both <br/>\nnicer right after that.   I haven&#39;t heard my neighbor behind me be hateful to <br/>\nhis kids one time since I marched out into our shared neighboring vacant lot <br/>\nand told him to be nicer to his kids, in front of his kid and wife.    If he&#39;s <br/>\nstill being abusive, he&#39;s at least gotten quieter about it, which is what I <br/>\ntold him when he said it was none of my F**KING business.   I told him if I <br/>\ncould hear it from my house it was my business.<br/>\n<br/>\nBut at least his kids know that other adults, and parents, disagree with his <br/>\ndad&#39;s actions.<br/>\n<br/>\nThe police were looking for him in the neighborhood TWICE after that and <br/>\ndidn&#39;t find him.  That might be inspiring him to tone down his evil ways too.<br/>\n<br/>\n-=-I used to be too shy and too <br/>\nworried about what&#39;s proper socially, but I&#39;ve HAD it with the way some folks <br/>\nwant to treat my boys.-=-<br/>\n<br/>\nI haven&#39;t had much trouble with other people.  My husband&#39;s mom is kinda <br/>\ncreepy-mean, but what I&#39;ve done when she&#39;s done something I didn&#39;t agree with was <br/>\nto just talk directly to my child as though she were a lifesize animatronic <br/>\nDisney character, and we could have a discussion without her hearing it or <br/>\nsomething.  When she told Marty he couldn&#39;t have dessert, I just passed mine over <br/>\nto him and said, &quot;Here, you can have mine&quot; without a glance at her, and he <br/>\ndidn&#39;t look at her either, when he smiled at me and said &quot;thanks!&quot;     When she <br/>\nhas said &quot;get down&quot; in public to toddlers I&#39;ve said, &quot;It&#39;s okay&quot; *to the <br/>\ntoddler* not to her.  I never used the exact words &quot;You can ignore grandma,&quot; but she <br/>\nknew that&#39;s what it meant.    <br/>\n<br/>\nWhat I have done is when I&#39;m not directly in a stressful situation with her, <br/>\nI&#39;ll tell her a story about some positive feedback we&#39;ve gotten on the kids, <br/>\nor something cool they did, and I tell it in a conversational yet intructive <br/>\nway.  She can take from it or not.  <br/>\n<br/>\nThey&#39;re big enough to defend themselves not, and I have no doubt they would.  <br/>\nHer abuse is all in the disdain department, and insult.     Not hitting.  <br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Need Advice","postDate":"1075736031","msgId":90091,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhmLjM3OWM3ZmEzLjJkNGZjN2RmQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":90167,"prevInTime":90090,"nextInTime":90092,"topicId":90091,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/31/2004 12:14:06 AM Eastern Standard Time, UnschoolingDiscussion@yahoogroups.com writes: If it didn t help, I would respond to everything","messageBody":"<div id=\"ygrps-yiv-1580234697\">In a message dated 1/31/2004 12:14:06 AM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a> writes:<br/>\nIf it didn&#39;t help, I would respond to everything my mom said in that<br/>\nsing-song voice people tend to reserve for children and then stand too<br/>\nclose, sit too close, etc..  It won&#39;t take long for mom to get annoyed and<br/>\nyou can point out that this is exactly how your daughter feels when they do<br/>\nit to her.&lt;&lt;&lt;&lt;&lt;&lt;&lt;<br/>\nI&#39;ve recommended this once as well, but in a spanking situation. My friend&#39;s <br/>\nmother was/is a spanker. One day my friend went over to pick up her <br/>\njust-turned-two year old son from her mom&#39;s. The baby started screaming when he heard <br/>\nhis mom at the door. The grandmother went over and smacked him HARD on his bare <br/>\nthigh---left a handprint---and said, &quot;I told you not to scream.&quot; My friend was <br/>\nlivid, snatched him up, and called me. She was completely distraught; she had <br/>\nasked her mom many times NOT to spank him. Her mother&#39;s answer to *this* one <br/>\nwas that she had repeatedly told him (just two years old!) not to scream.<br/>\n<br/>\nI suggested that the next time it happens (because we ALL knew it would!) she <br/>\nshould walk over to her mother and smack her bare thigh as hard as she could <br/>\nand scream, &quot;I&#39;ve told you and TOLD you NOT to spank my child! Don&#39;t do it <br/>\nagain!&quot;<br/>\n<br/>\nViolence to end violence is stupid, I know. BUT! This grandmother had *never* <br/>\nlooked at it from the baby&#39;s point of view. NOW she knew it hurt, she knew it <br/>\nwas humiliating, and she was sorry----and not just for hitting her grandson, <br/>\nbut for hitting her daughter too.<br/>\n<br/>\nShe hasn&#39;t done it again.<br/>\n<br/>\nI&#39;d do the same thing to this mom who won&#39;t leave my child in peace. I&#39;d get <br/>\nin her face, stay annoying, speak in the &quot;poodle voice&quot; and do everything <br/>\nthey&#39;ve been doing to my child for the entire visit. I used to be too shy and too <br/>\nworried about what&#39;s proper socially, but I&#39;ve HAD it with the way some folks <br/>\nwant to treat my boys.<br/>\n<br/>\nYou may now all scream at me for suggesting the spanking of a parent!&lt;g&gt;<br/>\n<br/>\n~Kelly<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":90048,"nextTopicId":90131}}