{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Our game this morning","postDate":"1238667562","msgId":43650,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNhOTNmZmYxMDkwNDAyMDMxOWsyY2ZiOTk2ZHkyY2ZmNjhlMWM5ODJiMTEzQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDEwMDZCNzZENzExMDQ2RkY5QjM2N0YwNTMzMzZEMzFBQFJvYnluUEM+","referencesHeader":"PDEwMDZCNzZENzExMDQ2RkY5QjM2N0YwNTMzMzZEMzFBQFJvYnluUEM+"},"prevInTopic":43649,"nextInTopic":0,"prevInTime":43649,"nextInTime":43651,"topicId":43649,"numMessagesInTopic":0,"msgSnippet":"... and chemistry, and awareness of ecological ideas - the deepest ideas of the interconnectedness of all life - whether these ideas can just come up in the ","messageBody":"<div id=\"ygrps-yiv-612033450\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt; But for someone curious about whether &quot;Important Topics&quot;, like biology<br/>\n </span></blockquote>and chemistry, and awareness of ecological ideas - the deepest ideas of the<br/>\ninterconnectedness of all life - whether these ideas can just come up in the<br/>\ncourse of living an enjoyable life - OH YES, they really can. &lt;&lt;&lt;&lt;<br/>\n<br/>\nFor Karl, digestion is a favorite topic and he often wants to hear again<br/>\nabout how that takes place.  Our Invisible Man (see thru plastic figure with<br/>\ndetachable organs ... 88 cents from Walmart) is one of his props for this<br/>\nstory.  For him it is a story and he knows it&#39;s real but we talk about it<br/>\nvery much in our imaginations.  He is still trying to figure out some things<br/>\nabout digestion than I have said (of course there&#39;s more to it and there&#39;s<br/>\nalways more details I could put in than I have) or he just likes to hear it<br/>\nrepeated.  All naturally about eating and pottying and what happens to the<br/>\nfood.  Gosh boy stuff.  Lots of laughter and silliness and seriousness of<br/>\nthe best kind too.<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":287815876,"authorName":"Robyn L. Coburn","from":"&quot;Robyn L. Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Our game this morning","postDate":"1238643003","msgId":43649,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEwMDZCNzZENzExMDQ2RkY5QjM2N0YwNTMzMzZEMzFBQFJvYnluUEM+"},"prevInTopic":0,"nextInTopic":43650,"prevInTime":43648,"nextInTime":43650,"topicId":43649,"numMessagesInTopic":0,"msgSnippet":"This is an example of learning happening naturally, and also one of those possibly confusing (to newbie) instances where an activity could have looked","messageBody":"<div id=\"ygrps-yiv-1596106554\">This is an example of learning happening naturally, and also one of those possibly confusing (to newbie) instances where an activity could have looked &quot;schooly&quot; was fine because Jayn and dh and I have been at this for a while and she has never been to school or subjected to that teacherly thing of &quot;making a game out of a lesson&quot; OR that eclectic home schooling thing of &quot;making a lesson out of a game&quot; (ie teachable moments). Since I believe that intention matters and that the magic of unschooling is in moments of serendipity, today was a wonderful unschooling moment.<br/>\n<br/>\nJayn and I were playing in the bedroom. We have a hiding under the covers game, which I find a bit tough because sometimes it&#39;s hard to breathe. So I was risking attracting the attention of the imaginary creatures by holding the edge of the comforter up to let in air. I found when I moved my leg that cool air rushed in over my hand. I got a bit excited and invited Jayn to feel the air wooshing by, remarking really in passing that it was like our lungs being filled by our diaphragm. <br/>\n<br/>\nShe enjoyed that and suggested that it was as if we were inside the lungs, which led to a game of us being Oxygen atoms travelling around the human body. It was her idea to go into the blood from the lungs, and then we had a conversation about how arterial blood travels through the chambers of the heart before being pumped all over, into capillaries, and then pretended to travel to the brain and enter a cell. I told her a little bit about Oxygen being used to burn glucose for energy, and we pulled the pillow case off a pillow, then both latched on to the &quot;Carbon atom&quot; (so that we were CO2) and returned via veins (talking about how veins do not pulse but are moved by muscle movement), and then out through the lungs. <br/>\n<br/>\nI asked her where we should go now, and recalled after a moment that plants reversed the process with photosynthesis, and after more discussion (still both clutching our carbon atom) we decided to go into the ocean and be taken up by green algae in the sun. We split off from our pillow carbon, and then were transpired to be dissolved in water. I know I used the word &quot;ionized&quot; at some point. We travelled through the gills of a fish, and the game then gently petered out and we moved on to a more cosmological discussion about how the atoms never are destroyed, but just continue combinine and recombining eternally. <br/>\n<br/>\nI said that we could have had atoms that were once part of Leonardo Da Vinci (the first historical luminary that popped in to my mind), and Jayn immediately decided that she was made of atoms that might have been part of Cleopatra (it&#39;s been a while since she was into Egypt stuff but I think &quot;Death on the Nile&quot; has reignited that particular spark).<br/>\n<br/>\nThis was a long game. We were oxygen atoms for close to half an hour, and Jayn wants to play again tomorrow. It might still look attractive to her in the morning, or not, but that doesn&#39;t matter.<br/>\n<br/>\nNor does what we &quot;covered&quot; in that game. I don&#39;t have to account for how we spend our time, or whether Jayn is following any state standards - lucky me in CA. <br/>\n<br/>\nBut for someone curious about whether &quot;Important Topics&quot;, like biology and chemistry, and awareness of ecological ideas - the deepest ideas of the interconnectedness of all life - whether these ideas can just come up in the course of living an enjoyable life - OH YES, they really can.<br/>\n<br/>\nRobyn L. Coburn<br/>\nwww.Iggyjingles.etsy.com<br/>\nwww.iggyjingles.blogspot.com<br/>\nwww.allthingsdoll.blogspot.com<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":43517,"nextTopicId":43568}}