{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Jacquie&#39;s missing post","postDate":"1126150918","msgId":108128,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc0LjViYWNkM2JkLjMwNTEwZDA2QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":108127,"nextInTime":108129,"topicId":108128,"numMessagesInTopic":0,"msgSnippet":"I don t know why this didn t go through before.   It wasn t in pending messages anymore, but I was able to find it.   Maybe it was sent twice, and two ","messageBody":"<div id=\"ygrps-yiv-1801725760\">I don&#39;t know why this didn&#39;t go through before.   It wasn&#39;t in pending <br/>\nmessages anymore, but I was able to find it.   Maybe it was sent twice, and two <br/>\ndifferent moderators deleted one as a duplicate (but deleted different ones).     <br/>\nAll new members are on moderation.   Please don&#39;t send posts twice.   <br/>\nModerators are volunteers and have kids and need to sleep too.   It might take several <br/>\nhours.    <br/>\n================================<br/>\n<br/>\nFROM: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kraus12@...\">kraus12@...</a><br/>\nDATE: Sat, 03 Sep 2005 16:42:05 -0000<br/>\nSUBJECT: Re: I need some help... from someone new to unschooling (ideas to <br/>\nencourage)<br/>\n<br/>\n<br/>\nFrom: &quot;Jacquie Krauskopf&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kraus12@...\">kraus12@...</a>&gt;<br/>\nSubject: Re: I need some help... from someone new to unschooling (ideas to <br/>\nencourage)<br/>\n<br/>\n<br/>\nI have a single son who is 5 years old. I had planned the first 8<br/>\nweeks of his kindergarten but then after the first day of making him<br/>\nsit down and learn and him and I both being miserable we moved on to<br/>\ndo our own thing.<br/>\n<br/>\n  My son is really into dinosaurs. So we use this love for dinosaurs<br/>\nfor his learning. We encourage him to count his dinos . He groups<br/>\nthem into catergories. He knows what a carnivore is and a herbavore.<br/>\nI have read countless books to him and that lead to furthure<br/>\nquestions and more books. He now knows what an astroid is.<br/>\n<br/>\n   He has a great sense of geogrqaphy from looking at the maps of<br/>\nwhere the dinosaurs lived and where the fossils are found. He knows<br/>\nabout skeltons now because I read him a book on skeltons in people.<br/>\nWe have done some measurement- like footprints.<br/>\n<br/>\n   He does worksheets (he likes them- i think because it gives him a<br/>\ngreat sense of acomplishment)<br/>\n<br/>\n  We also do most of our reading before we go to bed. I cannot tell<br/>\nyou the number of times that he refuses to do any reading all day<br/>\nthen suddenly wants to read at night. Some people are sharpest at<br/>\nnight and if my son is one of them, how would he acomplish much<br/>\nschoolwork during th day?<br/>\n<br/>\n<br/>\n   From this I would take each of your older child&#39;s interests<br/>\nseperately. Get books on that interest. Encourage him/her to ask<br/>\nquestions. This will lead to more books or experiments.<br/>\n<br/>\n  We also started a wall caterpilliar. I made a face for a<br/>\ncaterpilliar from small paperplates. I taped it to the wall and made<br/>\nanother plate with the number 1 and the word one on it. We counted to<br/>\none. Yes he can count more than that but I still wanted to start at<br/>\none. Each day we add another number and count to the number and stop.<br/>\nI was shocked to, one day on the way out the door to go to the park,<br/>\nhe stopped me telling me we cannot go because we have to add a new<br/>\nnumber on the wall! We are now up to 25 and we do this daily.<br/>\n  <br/>\n      What does your 8 year old play? Does she play with her barbies?<br/>\ndoes he play with his cars? Does she put all the Barbie shoes in a<br/>\nbox or pile together? Maybe he has a pile of cars with vans in one<br/>\npile and cars in another? Maybe he plays with the matchbox size cars<br/>\ntogether sometimes and the bigger Tonka trucks together at other<br/>\ntimes, if so, they are doing math! If you play cars with him or<br/>\nBarbies with her, ask for specific items. &quot;Honey I need the vans<br/>\nnow.&quot; or the high heeled shoes, or whatever. They are grouping<br/>\nobjects.<br/>\n   We went for a walk at the park last night. We let Jonah ride his<br/>\nscooter. My husband told him: &quot;Go the lightpost number two which is<br/>\nthe 2nd one, and wait for us. This taught him to follow directions,<br/>\nand the numbers being used as 1st, 2nd ect. and best of all he loved<br/>\nit! I went home and put it in the book I am writing in.<br/>\n<br/>\n   The video games your children play- they are learning! If it is<br/>\nnot some skill to it then why is my son better than me at it?<br/>\n<br/>\n   Think of the family games you have. For instance we have hungry<br/>\nhungry hippo. Here he needs to count the numbers of marbles each of<br/>\nus have after the hippos gobble them up to determine the winner. He<br/>\nis doing Math. We also do the letter of the week and I get all the<br/>\nbooks I can find on the subjects with that letter. Last week we<br/>\nlearned about Christopher Columbus, cats, crickets, cows. I figure<br/>\nthis opens his world to find other interests. if the book is making<br/>\nhim miserable we do not read it. We get lots of different books<br/>\naudios and videos from the library- I cannot stress the library<br/>\nenough. We go to three different library&#39;s a week and I fill the huge<br/>\nbook bag fully.<br/>\n<br/>\n   Talk to your children- tell them things. We read both non-fiction<br/>\nand fiction and so I taught him the difference of the two.<br/>\n<br/>\n   Pokeman cards. Have your children write a story about Pokeman-  if<br/>\nthey cannot write then you dictate it. Count the cards. Do they have<br/>\nnumbers? Put them in numural order. What number comes after...?<br/>\nBefore? Make a pokeman cake and have them help you measure things-<br/>\nlots of math here! I admit we are not to Pokeman yet. Can they be<br/>\ndivided into catergories? Do they divide them up between themselves?<br/>\nCan they be bought for money somehow? Can they be used to<br/>\nmeasurements? How many Pokeman cards long is Adams bed? Is there any<br/>\ngeography in Pokeman? Show them a map where Pokeman is from. If it is<br/>\nfiction place, then make their own map or drawing of what the place<br/>\nmight look like.<br/>\n<br/>\n   Have them help with groceries at the grocery store. Count things<br/>\naloud in front of them, do math problems aloud so they see you do<br/>\nthem. Spell the words of signs you see aloud so they see you<br/>\nspelling. When reading, if the word is repeated say : This word<br/>\nsays &quot;Go&quot; so what does this word say: and point to he other word that<br/>\nsays go. <br/>\n   <br/>\n    I am new to this line of thought, but believe me it works. It<br/>\ntruly is unbelieveable, but it does work.<br/>\nIf you do like my ideas and want to e-mail me for more ideas on a<br/>\nmore personal level I will be happy to help you on a more custom<br/>\nlevel.<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kraus12@...\">kraus12@...</a><br/>\n<br/>\nI hope this helps!<br/>\nJacquie<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":108111,"nextTopicId":108133}}