{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1294635,"authorName":"Home Education Magazine  by way of Home","from":"Home Education Magazine &lt;HEM-Editor@...&gt; (by way of Home Education Magazine)","profile":"hemhelen","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"HEM&#39;s Online News -  October 2002","postDate":"1033721279","msgId":45291,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PHAwNTAwMTk0MmI5YzMwNjM2NjgwNUBbMjA4LjI2LjIyNy4yMTFdPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":45290,"nextInTime":45292,"topicId":45291,"numMessagesInTopic":0,"msgSnippet":"^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^ HOME EDUCATION MAGAZINE S ONLINE NEWS October 2002 ^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^ Welcome to HEM S ONLINE NEWS! For","messageBody":"<div id=\"ygrps-yiv-2117550200\">^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^<br/>\n<br/>\nHOME EDUCATION MAGAZINE&#39;S ONLINE NEWS<br/>\nOctober 2002<br/>\n<br/>\n^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^<br/>\n<br/>\nWelcome to HEM&#39;S ONLINE NEWS! For more information on Home Education<br/>\nMagazine, see the end of this newsletter or visit our web site at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://home-ed-magazine.com\">http://home-ed-magazine.com</a> Send your comments and questions to<br/>\neditor Carol Narigon at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Newsletter@...\">HEM-Newsletter@...</a>.<br/>\n<br/>\nWe think parents and kids should be together! So with this issue<br/>\nwe&#39;re continuing our subscription special to encourage you to do just<br/>\nthat--be with your kids. Our &quot;Don&#39;t Send Your Kids to School!&quot;<br/>\nspecial is available to HEM&#39;s Online News readers and offers a<br/>\none-year subscription for only $20.00. Subscribe at:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com/ORD/_nottoschool.html\">http://www.home-ed-magazine.com/ORD/_nottoschool.html</a> , or see<br/>\ncontact info near the end of this newsletter.<br/>\n<br/>\nIn the October issue:<br/>\n<br/>\n~ Unschooling Is My Job ~<br/>\n~ Questions and Answers ~<br/>\n~ unschooling.com ~<br/>\n~ Calling All College Applicants ~<br/>\n~ Homeschool Books ~<br/>\n~ Spike&#39;s Science Projects ~<br/>\n~ Homeschoolers Helping Homeschoolers ~<br/>\n~ Heart Man ~<br/>\n~ Disgustoscope ~<br/>\n~ The Final Word ~<br/>\n<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nLet&#39;s not cast ourselves in roles either -- good parent, bad parent,<br/>\npermissive parent, authoritarian parent.  Let&#39;s start thinking of<br/>\nourselves as human beings first, with great potential for growth and<br/>\nchange.  The process of living or working with children is demanding<br/>\nand exhausting. It requires heart, intelligence, and stamina.  When<br/>\nwe don&#39;t live up to our own expectations -- and we won&#39;t always --<br/>\nlet&#39;s be as kind to ourselves as we are to our youngsters.  If our<br/>\nchildren deserve a thousand chances, and then one more, let&#39;s give<br/>\nourselves a thousand chances -- and then two more.&quot; ~~ from &quot;How to<br/>\nTalk So Kids Will Listen & Listen So Kids Will Talk&quot; by Adele Faber<br/>\nand Elaine Mazlish ~~<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nUNSCHOOLING IS MY JOB<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com/HEM/195/sounschool.html\">http://www.home-ed-magazine.com/HEM/195/sounschool.html</a><br/>\n<br/>\nWhat makes unschooling so hard for me is its very nature. Incredible<br/>\nthings happen, but I don&#39;t know when they are going to happen and<br/>\nsometimes the timing is disconcerting. Occasionally I hunger for a<br/>\nschedule that is written in stone. I want us all to get up at the<br/>\nsame time in the morning and do our chores and start on our<br/>\nactivities together at the same time. I want us all to eat at the<br/>\nsame time. I want the kids to want to read when I want to read and I<br/>\nwant them to need my help when I have scheduled it into the day.<br/>\nThere are moments when I&#39;ve had enough of spontaneity.<br/>\n<br/>\nI&#39;d like to think that unschooling is not a &quot;thing,&quot; it is just life.<br/>\nAnd perhaps if we were homesteading and training our kids to take<br/>\ntheir places beside ours in the struggle for survival, it would be an<br/>\norganic part of life. But we&#39;re not. The reality is that this home is<br/>\na temporary way station for my kids to live before they go off on<br/>\ntheir own. And on subtle and not-so-subtle levels they feel the<br/>\ndifference. They love us, and especially as they get older, they do<br/>\nseem to feel a genuine desire to help us out, but they don&#39;t have a<br/>\nreal stake in our present community because they know they will be<br/>\nleaving it.<br/>\n<br/>\nKnowing this has made my job as family manager all the more complex.<br/>\nIt has been my repeated hope that when the kids are adults they will<br/>\nwant to come visit us because of what we share, and not out of some<br/>\nform of guilt. In the families of the past, I believe that<br/>\nspirituality and hard work bound people together. If you didn&#39;t pull<br/>\nyour weight in the garden or on the hunt, everyone went hungry. For<br/>\nthis family, at this time, that is not the case. Since we are not<br/>\nstruggling for survival, the question comes up, &quot;What are we doing<br/>\nhere at all?&quot;<br/>\n<br/>\nSo, always on my mind is the hope that our daily living will provide<br/>\nus with interests that hold us together when everyone is grown, and<br/>\nit seems to be happening. This past week Sara gave me a cookbook that<br/>\nI have used every day. She recommended two books on nutrition that I<br/>\nam buying for our library. She and April are working on piano duets<br/>\nthat they play when they get together. Sara is out of the house but<br/>\nher relationship with all of us continues to grow. It is the same<br/>\nwith Jake.<br/>\n<br/>\nHow do I quantify the kind of hours of work that went into creating a<br/>\nhome where this is the outcome? It is a thrilling outcome, but it is<br/>\nnot always so easy to see when I am bogged down in the daily routine<br/>\nof getting someone - anyone - to just clean the bathroom and be quiet<br/>\nabout it.<br/>\n<br/>\nBeing a mother is the first job to which I ever felt completely,<br/>\ntotally committed. If I were to analyze it, I would say that I looked<br/>\nat the work that needed to be done and wrote my own job description.<br/>\nI had to take into account the century in which we live and the<br/>\ngeographical location in which we find ourselves as well as our means<br/>\nof monetary support. I also had to define what my purpose is in<br/>\nraising children.<br/>\n<br/>\nI will not win the Nobel Prize for this job, nor will I earn any<br/>\nmoney for it. Whether I homeschool or unschool, the reality is that I<br/>\nwill not be able to follow up on all the great writing ideas that<br/>\ncome into my head. Nevertheless I will try, because part of my job<br/>\ndescription is to have my own interests and eventually phase myself<br/>\nout of my job.<br/>\n~~ excerpt from an article by Ruthe Friedner Matilsky ~~<br/>\n<br/>\nYou can read the rest of this article, as well as a couple of<br/>\narticles and columns from the September/October issue at the address<br/>\nabove, but you&#39;ll have to get the magazine--the one you hold in your<br/>\nhands--to read them all! See special subscription information at the<br/>\ntop and end of this newsletter, or visit your local bookseller to get<br/>\nyour copy today.<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nQUESTIONS AND ANSWERS<br/>\n<br/>\n&quot;This may seem silly, but the thing I most enjoyed about my own<br/>\nschool years were the little awards, the teacher&#39;s compliments on my<br/>\nreport card and other tangible signs that I was smart and valuable.<br/>\nWhat on earth can homeschoolers do to provide a shoebox full of<br/>\nmemories for our children?&quot; ~~ newly homeschooling in Wisconsin ~~<br/>\n<br/>\n&quot;I am a very concerned educator in Indiana who has a relative in<br/>\nColorado. I am very concerned about this relative who is SUPPOSEDLY<br/>\nhomeschooling two young boys.  One boy should be in 8th grade and the<br/>\nother 3rd or 4th grade.  They have not gone to a public or private<br/>\nschool at least 3 years.  I feel that the mother, who would be the<br/>\nhomeschool educator, is not planning, educating, evaluating, keeping<br/>\npermanent records or putting forth the time or effort to educate<br/>\nthese boys.  I feel that in the future I might regret keeping not<br/>\nalerting the proper authorities of what I might know. Here&#39;s the<br/>\nquestion:  Is there a way to have these boys checked on to see if<br/>\nthis supposed homeschooling is being done?  I feel that these boys<br/>\nwill fall through the cracks of the homeschool system!&quot;  ~~ Concerned<br/>\nrelative ~~<br/>\n<br/>\nTo answer a question, or propose your own question, please write to<br/>\nLaura Weldon via <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ReaderResponse@...\">ReaderResponse@...</a> or Questions &<br/>\nAnswers, c/o Home Education Magazine, PO Box 1083, Tonasket, WA<br/>\n98855.  Your responses must meet our deadline of the 1st.  Please<br/>\nrecognize that your submission may be edited for length or clarity.<br/>\nIndicate how you prefer your question or answer signed.<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nUNSCHOOLING.COM<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n<br/>\nI think people have inherent interests that will find an outlet in<br/>\nwhatever way they can, like water seeping through cracks. Sure the<br/>\nlimitations will be there, as they are in whatever situation one is<br/>\nin; limitations help shape us for our destiny. It is my hope that I<br/>\ncan assist my children to encounter people or mediums that have the<br/>\nsort of information that they find fascinating and compelling, as I<br/>\ncertainly can&#39;t provide everything that they need. I have faith that<br/>\nlife in its divine, rich Wholeness can though. ~~ Neri, on the<br/>\nunschooling.com message board ~~<br/>\n<br/>\nUnschooling.com offers a free monthly newsletter, message boards, an<br/>\nemail list and more just for unschoolers. To subscribe to the email<br/>\nlist send a blank email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-subscribe@yahoogroups.com\">Unschooling-dotcom-subscribe@yahoogroups.com</a><br/>\nOr visit the email list website at:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/Unschooling-dotcom\">http://groups.yahoo.com/group/Unschooling-dotcom</a> .<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nCALLING ALL COLLEGE APPLICANTS<br/>\n<br/>\nMy name is Joanna; I am a production assistant for The Merrow Report, PBS&#39;s<br/>\npremiere series on youth and learning. We are currently in<br/>\npre-production for a piece on applying to college from homeschool.<br/>\nAlthough the angle is undecided, we are leaning toward the journey of<br/>\nhomeschooled seniors applying to major national universities.<br/>\n<br/>\nIf you or anyone you know is graduating or has recently graduated and fits this<br/>\ndescription, you could be a focus for our documentary and I would<br/>\nlove to hear from you. Also, any current issues in the world of<br/>\nhomeschooling that may be interesting to cover are welcome ideas.<br/>\nThanks, and my email is <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jgc221@...\">jgc221@...</a> . Hope to hear from you.<br/>\n<br/>\n   &lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nHOMESCHOOL BOOKS<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com/catalog/index.html\">http://www.home-ed-magazine.com/catalog/index.html</a><br/>\n<br/>\nDid you know you can buy homeschool books at the Home Education<br/>\nMagazine website? We&#39;ve narrowed the selection down to a few we think<br/>\nare best. You&#39;ll find some of your favorite HEM columnists there,<br/>\nalong with other popular homeschool writers.<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nSPIKE&#39;S SCIENCE PROJECTS<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://spikesworld.spike-jamie.com/science/index.html\">http://spikesworld.spike-jamie.com/science/index.html</a><br/>\n<br/>\nJan McCormick writes of her science projects site: &quot;The science<br/>\nprojects on this site were written by a musician and philosopher; not<br/>\na scientist.&quot; That may be true, but you&#39;ll still find a lot of good<br/>\nscience on this site and the projects are accessible and fun. If your<br/>\nhomeschool group does a science fair or cooperative classes, or if<br/>\nyou just like science projects, you&#39;ll find plenty of ideas to keep<br/>\nkids interested with projects like &quot;Mr. Icky,&quot; &quot;Light Bulb vs. the<br/>\nSun,&quot; &quot;Territorial Battles of Air and Liquid&quot; and &quot;Is There a Genie<br/>\nin the Bottle?&quot;<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nHOMESCHOOLERS HELPING HOMESCHOOLERS<br/>\nby Pam Sorooshian and Sue Patterson<br/>\n<br/>\nThis year, record numbers of families are choosing home education.<br/>\nThey are often confused, scared and apprehensive. Support from<br/>\nexperienced homeschoolers can sometimes provide just what they need<br/>\nto help them gain confidence in themselves. The National Home<br/>\nEducation Network&#39;s website offers information, networking, and<br/>\nsupport for new homeschoolers at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.nhen.org/newhser/default.asp?id=227.\">http://www.nhen.org/newhser/default.asp?id=227.</a> Here is a sampling of<br/>\nwords of advice offered there by long-time homeschoolers from all<br/>\nover the country.<br/>\n<br/>\n&quot;I&#39;m fond of telling folks that the what and how will come if they do<br/>\none simple thing: Observe the children as they play and learn, get a<br/>\n&#39;feel&#39; for the best way to go about this to &#39;fit&#39; the individual<br/>\nchild. The children themselves give us remarkable clues, if we as<br/>\nparents have but the wisdom and patience to interpret them.&quot;<br/>\n~ Linda Dobson, New York ~<br/>\n<br/>\nStart with the child, not the resource<br/>\n2. Ask for your child&#39;s input, regardless of their age. I have always<br/>\nbeen surprised at how well my kids know what they need and how they<br/>\nwant to go about getting it.<br/>\n3. Don&#39;t buy anything expensive the first year.<br/>\n4. Kids don&#39;t have to finish everything they start - sometimes they<br/>\ncome back to it (even years later) and sometimes they don&#39;t.<br/>\n5. The child is in charge of the learning -- always, regardless of<br/>\nwhat resource, method, or philosophy you employ or hold.<br/>\n6. Homeschooling is a long-term adventure. There are few things that<br/>\nhave to be accomplished by a particular age.<br/>\n7. School schedules and school resources were developed for ease of<br/>\nteaching not for ease of learning. Big difference. ~ Christine Webb,<br/>\nOregon ~<br/>\n<br/>\n&quot;Children need the opportunity to experience the world personally,<br/>\nusing hands, bodies, and all the senses, as well as the mind. These<br/>\nexperiences could include water, sand, mud, plants, animals, cooking,<br/>\nrepair, all aspects of family life, social relation -ships, privacy,<br/>\nbooks, art, construction, crafts, dance, model building, sports,<br/>\ndrama, math, communication, machinery (including anything from<br/>\ncrowbars to computers), music, science, spiritual belief systems,<br/>\nliterature, history, travel, and more. Paper and pencil<br/>\nrepresentations of reality (i.e. packaged curriculums or dependence<br/>\non workbooks) are occasionally a valuable tool. Used excessively,<br/>\nsuch materials are a flavorless substitute for the real thing.&quot; ~ Ann<br/>\nLahrson-Fisher, Oregon ~<br/>\n<br/>\n(You can read the rest of this article at the NHEN web address found<br/>\nin the body of this excerpt.)<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nDISGUSTOSCOPE<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.eskimo.com/~billb/amateur/dscope.html\">http://www.eskimo.com/~billb/amateur/dscope.html</a><br/>\n<br/>\nHere&#39;s a variation on the beautiful, infinitely changing<br/>\nkaleidoscope-a disgustoscope. Inventor William J. Beaty calls it,<br/>\n&quot;Beautiful radial symmetry and pristine mathematics, perverted into a<br/>\nrevolting, horrible, yet highly amusing little optical toy.&quot;<br/>\nPersonally, I&#39;m going to ask my husband to take this one.<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nHEART MAN<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://members.aol.com/cjsteer\">http://members.aol.com/cjsteer</a><br/>\n<br/>\nWhat have you got to lose? It&#39;s free and it&#39;s a video about the<br/>\nheart, the effects of alcohol and nicotine on the heart and it stars<br/>\na man who lives with both a donated heart and a kidney. He shows his<br/>\nold diseased heart, just in case anybody doesn&#39;t believe he knows<br/>\nwhat he&#39;s talking about. I haven&#39;t received mine yet, so I can&#39;t tell<br/>\nyou any more than what&#39;s on the website, but it sounds interesting.<br/>\nFor kids age 13 and up.<br/>\n<br/>\n^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^<br/>\n<br/>\nHEM ONLINE NEWS UNCLASSIFIED ADVERTISING<br/>\n<br/>\nFor information on purchasing unclassified advertising space in this<br/>\nnewsletter, please contact the editor at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Newsletter@...\">HEM-Newsletter@...</a>.<br/>\n<br/>\n________<br/>\n<br/>\nUSBORNE<br/>\nUsborneAmerica.com<br/>\n<br/>\nNew internet-linked history and science books for fall are<br/>\nin...several new series to engage and delight your children and you.<br/>\nShop online and earn FREE books at: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.UsborneAmerica.com\">http://www.UsborneAmerica.com</a><br/>\nFor personal shopping service, e-shows or e-book fairs, email<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SharonVE@...\">SharonVE@...</a> or call 888-474-8499 toll free. FREE business kit<br/>\nfor the first two callers in October! Sharon Vander Ende, Independent<br/>\nSupervisor, Usborne America<br/>\n<br/>\n________<br/>\n<br/>\nGNARLY MATH<br/>\ngnarlymath.com<br/>\n<br/>\nCAMELBACK AND SAILING, BABYLON TO LYDIA with our indestructible young<br/>\nlady mathematician. Join her in 558 BC as she deals with ancient<br/>\nEgyptian musical instruments. It&#39;s all in the latest issue of our<br/>\nFREE hilarious math newsletter, the Gnarly Gnews. Subscribe right now<br/>\nto the Gnews, download free examples of our moneyback-guaranteed<br/>\nCD-ROM Solid Gold Gnarly Math, show your children how easy and fun<br/>\nAlgebra, Geometry, Trig, Topology, and Probability can be, and<br/>\nrefresh your own math, all at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.gnarlymath.com\">http://www.gnarlymath.com</a> .<br/>\n_________<br/>\n<br/>\nTHE RESOURCEFUL HOMESCHOOLER<br/>\nresourcefulhomeschooler.com<br/>\n<br/>\nAttention unschoolers and eclectic homeschoolers! Looking for<br/>\nsomething to do? The Resourceful Homeschooler carries great books,<br/>\nscience materials and kits, learning games, and the most interesting<br/>\nsoftware. AND here is your opportunity to clear some shelf space!<br/>\nList or consign your surplus or used homeschooling materials. Store<br/>\ncredit available for consignments. Visit<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.resourcefulhomeschooler.com\">http://www.resourcefulhomeschooler.com</a> Materials to involve, inspire<br/>\nand support independent learners of all ages!<br/>\n_________<br/>\n<br/>\nTEACH YOUR CHILD TO READ!  TRY ONLINE LESSONS NOW FOR FREE!<br/>\nHeadsprout.com<br/>\n<br/>\nHeadsprout Reading is the fun, Internet-delivered beginning reading<br/>\nprogram that will give your child a real advantage by systematically<br/>\nteaching essential skills and strategies ensuring reading success and<br/>\nconfidence. Outstanding fast results!  After just five 20-minute<br/>\nanimated, interactive episodes, children read their first Headsprout<br/>\nbook. Act quickly! For a limited time you can try out Headsprout<br/>\nReading FOR FREE! <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.headsprout.com\">http://www.headsprout.com</a> Please enter the<br/>\npromotional code: HENM1<br/>\n_________<br/>\n<br/>\n<br/>\nTHE GREAT WORD RACE<br/>\nTheGreatWordRace.com<br/>\n<br/>\nHave fun while learning! It&#39;s a great concept, especially when your<br/>\nchildren won&#39;t even realize that they&#39;re playing a game with an<br/>\neducational benefit.  That&#39;s right, enhance your spelling and word<br/>\nbuilding skills with a game.  No word is too simple or small.<br/>\nSpecial playing cards work with word blends, prefixes and suffixes to<br/>\ntry to help you build words.  Give your child some extra help by<br/>\nplaying in teams.  No matter how you play it, you&#39;ll have hours of<br/>\nfun.  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.TheGreatWordRace.com\">http://www.TheGreatWordRace.com</a><br/>\n__________<br/>\n<br/>\nHomeSchool FreeStuff<br/>\nHomeschoolFREEStuff.com<br/>\n<br/>\nEvery week this FREE email newsletter brings you FREE curriculum,<br/>\nresources, lesson plans, unit studies, interactive online studies and<br/>\nmore! It&#39;s even FREE to subscribe! Because Everyone Deserves A Treat<br/>\nOnce In A While!<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.homeschoolfreestuff.com/html/home.asp?adid=26\">http://www.homeschoolfreestuff.com/html/home.asp?adid=26</a><br/>\n_________<br/>\n<br/>\nHOME EDUCATION MAGAZINE<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com\">http://www.home-ed-magazine.com</a><br/>\n<br/>\nThe Sept/Oct issue of Home Education Magazine features an interview<br/>\nwith Daniel Pink, articles on getting the school out, unschooling as<br/>\na job, a barn raising and more.  From the columnists: the Kaseman&#39;s<br/>\nconnect with other homeschoolers; Becky Rupp visits dinosaurs; David<br/>\nAlbert wears a silver dress sword; Sandra Dodd deschools; Elizabeth<br/>\nMcCullough reviews &quot;Creative Homeschooling for Gifted Children;&quot; and<br/>\nCarol Narigon (that&#39;s me) volunteers. Other columnists include<br/>\nBarbara Theisen, Ann Zeise, Peter Kowalke, Linda Dobson, and Laura<br/>\nWeldon. HEM also offers a special essay by publisher Helen Hegener,<br/>\nclassified ads, letters and discussion, pen pals and networking, and<br/>\nmore.<br/>\n<br/>\nSubscriptions to Home Education Magazine are currently $20.00 for our<br/>\n&quot;Don&#39;t Send Your Kids to School!&quot; special (regularly $32.00) for one<br/>\nyear/6 issues; a single issue is just $6.50. Home Education Magazine,<br/>\nPO Box 1083, Tonasket WA 98855; for orders: toll-free 1-800-236-3278;<br/>\nemail <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:orders@...\">orders@...</a>. MC/Visa cards accepted.<br/>\n<br/>\n^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^<br/>\n<br/>\nFINAL WORD<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.mysanantonio.com/opinion/cartoons/083002nacho.jpg\">http://www.mysanantonio.com/opinion/cartoons/083002nacho.jpg</a><br/>\n<br/>\n^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^<br/>\n<br/>\nThanks for reading HEM&#39;s Online News! Pass it on to your friends! To<br/>\nsubscribe, visit our web site at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com/wlcm_hemnewsltr.html\">http://www.home-ed-magazine.com/wlcm_hemnewsltr.html</a> or send an email<br/>\nto <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:majordomo@...\">majordomo@...</a> with the words subscribe<br/>\nhem-online-newsletter followed by your name@your address.com in the<br/>\nbody of the email. (e.g. subscribe hem-online-newsletter<br/>\nyouremailaddress). To unsubscribe, send an email to<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:majordomo@...\">majordomo@...</a> with the words unsubscribe<br/>\nhem-online-newsletter followed by your name@your address.com in the<br/>\nbody of the email. (e.g. unsubscribe hem-online-newsletter<br/>\nyouremailaddress). To change the address at which you receive the<br/>\nnewsletter, unsubscribe your old address and then subscribe to your<br/>\nnew one.<br/>\n<br/>\nSee you next month!<br/>\n<br/>\nCarol Narigon, Newsletter Editor<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Newsletter@...\">HEM-Newsletter@...</a><br/>\nMark and Helen Hegener, Publishers of Home Education Magazine</div>","specialLinks":[]}],"prevTopicId":45290,"nextTopicId":45292}}