{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":56,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: How could I haven handled this better?","postDate":"1317301916","msgId":63231,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNDMkFBQkEwLUVCODAtNDgxMS1BRDMxLTc4RDc5MTY4ODNBOUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGo2MGgwcStpYjVlQGVHcm91cHMuY29tPg==","referencesHeader":"PGo2MGgwcStpYjVlQGVHcm91cHMuY29tPg=="},"prevInTopic":63230,"nextInTopic":63232,"prevInTime":63230,"nextInTime":63232,"topicId":63201,"numMessagesInTopic":0,"msgSnippet":"To speak gratitude is courteous and pleasant, to enact gratitude is generous and noble, but to live gratitude is to touch Heaven. - Johannes A. Gaertner I","messageBody":"<div id=\"ygrps-yiv-1518269214\">To speak gratitude is courteous and pleasant,<br/>\nto enact gratitude is generous and noble,<br/>\nbut to live gratitude is to touch Heaven.<br/>\n<br/>\n     - Johannes A. Gaertner<br/>\n<br/>\nI brought that from a friend&#39;s daily mailing, to set next to this:<br/>\n<br/>\n-=-You are probably right. I am really feeling the inconvenience of not having a car. Things that would take a 10 minute drive now take leaving 20 minutes early to get to the bus stop, and sometimes nearly an hour on the bus and then doing it all again on the way back. So I&#39;ve been making the choices that take into consideration all the factors and try to make it *easiest* on all of us, regardless of what we *want* to do. With most things, I do take everyone&#39;s desires into account, but I guess I&#39;m not being very flexible about this. -=-<br/>\n<br/>\n&quot; try to make it *easiest* on all of us, regardless of what we *want* to do.&quot; doesn&#39;t sound fun at all.  The dance class probably isn&#39;t worth four people doing something that is NOT easy, that they do NOT want to do.<br/>\n<br/>\nAll the resentment poured toward a child will come flooding back out of them someday.  All the love and compassion will make the better, happier and stronger.  <br/>\n<br/>\nYou don&#39;t have a car, that&#39;s true.  You have a daughter who can walk, and dance.  What about dancing to DVDs or Youtube videos instead of an inaccessible dance class?  Winter is coming.  Won&#39;t that all get worse? <br/>\n<br/>\nMaybe when you do have a car you could take her to a dance class.  Or maybe you could find another dance class right near a bus stop, at a better time.<br/>\n<br/>\nJoy and peace should be higher priorities than any dance class.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":324592498,"authorName":"Tori","from":"&quot;Tori&quot; &lt;tandosmama@...&gt;","profile":"tandosmama@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: How could I haven handled this better?","postDate":"1317294763","msgId":63230,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo2MWpyYitla2ZjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGo2MGNhcitmN2F2QGVHcm91cHMuY29tPg=="},"prevInTopic":63229,"nextInTopic":63231,"prevInTime":63229,"nextInTime":63231,"topicId":63201,"numMessagesInTopic":0,"msgSnippet":"... But I don t know what to say in those situations! ... Perhaps think beyond talking--are there things you might do? It strikes me that Tess may be right;","messageBody":"<div id=\"ygrps-yiv-1309825043\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;emstrength3&quot; &lt;emstrength@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n </span></blockquote>But I don&#39;t know what to say in those situations!  <br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n<br/>\n </span></blockquote>Perhaps think beyond talking--are there things you might do? It strikes me that Tess may be right; when my kids are unsettled about something they&#39;ll sometimes make rather irrational sounding complaints or keep switching the complaint so I can&#39;t possibly help. I try to look at it as a request for help with big exclamation points rather than complaining or whining. <br/>\n<br/>\nI&#39;m thinking maybe a really genuine hug or whatever sort of interaction your daughter finds most soothing may help more than words. When she&#39;s more calm maybe she&#39;ll be ready to share what&#39;s really bothering her if she feels you&#39;re on her side.<br/>\n<br/>\nI agree with the suggestions of a stroller; ours makes all the difference for my 4 yr old twins, their stuff, my stuff.<br/>\n<br/>\nIt&#39;s great that you carried your kids for so long, but it may help to shift attention to being grateful for your ability to do so. Your words make it sounds more of a burden. I still carry my two kids when they request it. It makes me happy to help them feel secure and they smell so darn good. :)</div>","specialLinks":[]},{"userId":84464362,"authorName":"jo70mo","from":"&quot;jo70mo&quot; &lt;ben@...&gt;","profile":"jo70mo","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: How could I haven handled this better?","postDate":"1317283297","msgId":63229,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo2MThsMSs2cnNvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGo2MGQ2NCtzaTNnQGVHcm91cHMuY29tPg=="},"prevInTopic":63228,"nextInTopic":63230,"prevInTime":63228,"nextInTime":63230,"topicId":63201,"numMessagesInTopic":0,"msgSnippet":"If she loves the dance class she may well be fine doing that after walking there as she enjoys it. It is still a walk one way and a class but the fun bit is","messageBody":"<div id=\"ygrps-yiv-2054074682\">If she loves the dance class she may well be fine doing that after walking there as she enjoys it. It is still a walk one way and a class but the fun bit is after the walk rather than being faced by a walk after the class.<br/>\nGetting home 2 hours later may seem frustrating if you concentrate on the fact that you could get home in 20 mins. However if you see the 2 hrs as an activity in itself maybe less so.<br/>\nMaybe she will just be happy that you have let her do it her way and never need to do it again. Maybe she will love it and it will be easier for all of you.<br/>\nPerhaps doing it for the dance would be enough and if there is no bus home at all after gymnastics you could do it her way for dance and the other way for gymnastics. If you are accomodating her on the journey where that is possible she may find it easier to accept the journey where it is not possible. She may not.<br/>\nYou won&#39;t know unless you start to try out some of her plans where you can do so.<br/>\nI think you may find she is very attached to her plan because you haven&#39;t ler her try it out. Having tried it out you may find she doesn&#39;t want to do it every time and you may find that she moves on to new ideas and plans once she has tried out this version.<br/>\nI can easily revisit times in my past when my parents wouldn&#39;t let me try my way of doing things and wanted me to think of other ideas. It made no sense to me as I could see no valid (to me) reason why we couldn&#39;t try my plan except they didn&#39;t want to. It frustrated me that their not wanting to trumped my not wanting to do it their way on a regular basis. It wasn&#39;t conducive to me looking for other ideas.<br/>\nThe gymnastics may make it impossible to get a bus back but it seems it is possible to do it your daughters way on the dance class days.<br/>\nJo<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;emstrength3&quot; &lt;emstrength@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; &gt; I am confused by why u have to take the bus there if it&#39;s walking distance<br/>\n&gt; &gt; and walk back if there&#39;s a bus?  lyla<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Because if we walk there, they will be tired during the class and even more exhausted on the walk home.  When my husband can come with us, we do walk there if they want to and we bring the wagon.  <br/>\n&gt; <br/>\n&gt; After gymnastics, the bus does not run that late.  After dance, the timing would mean getting home 2 hours after class gets out (and still walking home from the bus stop) rather than walking and getting home in 20 minutes.<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: How could I haven handled this better?","postDate":"1317282775","msgId":63227,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTcyODI3NzUuMzg2NDAuWWFob29NYWlsUkNAd2ViODczMDkubWFpbC5pcmQueWFob28uY29tPg==","inReplyToHeader":"PGo2MGQwbis1YzJnQGVHcm91cHMuY29tPg==","referencesHeader":"PGo2MGQwbis1YzJnQGVHcm91cHMuY29tPg=="},"prevInTopic":63226,"nextInTopic":63228,"prevInTime":63226,"nextInTime":63228,"topicId":63201,"numMessagesInTopic":0,"msgSnippet":"======Just because a child can read, sometimes parents stop reading to them. Because a child can read Hop on Pop, the parent won t read Treasure Island to him.","messageBody":"<div id=\"ygrps-yiv-102557541\">======Just because a child can read, sometimes parents stop reading to them.   <br/>\nBecause a child can read Hop on Pop, the parent won&#39;t read Treasure Island to <br/>\nhim.  Sometimes a three year old can walk a long way, for a three year old, but <br/>\nfor her to learn that her mother will never carry her again seems harsh.  Not <br/>\neven in a stroller?=========<br/>\n<br/>\nI do carry my three year old when she needs me to.  I just did it yesterday with <br/>\nthe baby on my back and a heavy bag in my arms while my 5 year old lagged behind <br/>\ncomplaining about how hard it was to walk.  <br/>\n<br/>\n-------------------------------------------------------------<br/>\n<br/>\nFor a 5 year old it is hard to walk. Even if for you it was harder, you were <br/>\nchoosing, fully choosing your actions. Your 5 year old was marching to your <br/>\ndrummer. Your 5 year old didn&#39;t make you have a 3 year old or another baby. Your <br/>\n5 year old may have been happier if you&#39;d stopped with her.  You&#39;ve made a bunch <br/>\nof choices that aren&#39;t her choices and then you tell her given the choices I&#39;ve <br/>\nmade you have to live this life. And you resent her for not carrying on in good <br/>\nstyle alongside you. Instead of hating all the weight that you were hauling, <br/>\ncould you have taken more breaks? Could you have talked about how heavy <br/>\neverything is and how sometimes it&#39;s hard for you to walk, too? Shared the moan <br/>\nwith your daughters, your 3 year old and your 5 year old. Sorted through the bag <br/>\nand figured out what weighed the most and moaned about that thing. <br/>\n<br/>\n<br/>\n5 seems so young when my children are 14 and 11. I can remember, though, that <br/>\nSimon seemed old enough at 5 when Linnaea was 2. Sort of punishment for him that <br/>\nbecause he was relatively older I was expecting him to be absolutely older. <br/>\nThings were much better when I saw that he was ready to do what he was ready to <br/>\ndo and that however old he was didn&#39;t come into it. <br/>\n<br/>\n<br/>\nCan you go out less? Can you get things delivered? Can you think bigger than if <br/>\nI can carry a baby, a 3 year old and a heavy bag she can at least walk? <br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":332164648,"authorName":"Rippy Dusseldorp","from":"&quot;Rippy Dusseldorp&quot; &lt;ripgray@...&gt;","profile":"rdusseldorp","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: How could I haven handled this better?","postDate":"1317281201","msgId":63228,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo2MTZqaCtzdTVnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGo2MGdmcStpdnY3QGVHcm91cHMuY29tPg=="},"prevInTopic":63227,"nextInTopic":63229,"prevInTime":63227,"nextInTime":63229,"topicId":63201,"numMessagesInTopic":0,"msgSnippet":"===Would an alphabet walk be where you try to find the letters on signs and license plates?==== Yes. I carry a small notebook that fits in the back pocket of","messageBody":"<div id=\"ygrps-yiv-252265513\">===Would an alphabet walk be where you try to find the letters on signs and license plates?====<br/>\n<br/>\nYes.<br/>\n<br/>\nI carry a small notebook that fits in the back pocket of my jeans with all sorts of different games. It&#39;s an old habit of mine from being a play leader for my city&#39;s parks and recreation department when I was in my late teens. Maybe you can get books such as the following from the library for inspiration:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.amazon.co.uk/Great-Big-Book-Childrens-Games/dp/0071422463/ref=sr_1_1?ie=UTF8&qid=1317280669&sr=8-1\">http://www.amazon.co.uk/Great-Big-Book-Childrens-Games/dp/0071422463/ref=sr_1_1?ie=UTF8&qid=1317280669&sr=8-1</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.amazon.co.uk/Games-Learning-Peggy-Kaye/dp/0374522863/ref=sr_1_1?s=books&ie=UTF8&qid=1317280730&sr=1-1\">http://www.amazon.co.uk/Games-Learning-Peggy-Kaye/dp/0374522863/ref=sr_1_1?s=books&ie=UTF8&qid=1317280730&sr=1-1</a><br/>\n<br/>\nThere&#39;s often fantastic game ideas suggested on this list and I try to note them in my little book. <br/>\n<br/>\nThe advice I got when I was training to be a play leader was to keep the games light, playful, imaginative and fun. And to change the game as soon as the enthusiasm shows signs of waning. It&#39;s good advice that has helped me with unschooling too.<br/>\n<br/>\nRippy</div>","specialLinks":[]},{"userId":221591978,"authorName":"Bernadette Lynn","from":"Bernadette Lynn &lt;bernadette.lynn@...&gt;","profile":"bwalyalynn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: How could I haven handled this better?","postDate":"1317260987","msgId":63226,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBTTZBM04wPWlGaVRYMEFKZVhUclpMcjUrdXN5aVpVal95cz1hektwODZiQXRGTFY1QUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGo2MGQwbis1YzJnQGVHcm91cHMuY29tPg==","referencesHeader":"PDRBNDQ4QjgyLTA5NEQtNDEyNC05OUE1LTE0M0RDMTE2MTE4MUBTYW5kcmFkb2RkLmNvbT4gPGo2MGQwbis1YzJnQGVHcm91cHMuY29tPg=="},"prevInTopic":63225,"nextInTopic":63227,"prevInTime":63225,"nextInTime":63227,"topicId":63201,"numMessagesInTopic":0,"msgSnippet":"... Are you sure that pushing a double buggy with two children and a bag in the bottom with a baby on your back would be harder than carrying two children and","messageBody":"<div id=\"ygrps-yiv-2142215216\">On 29 September 2011 01:09, emstrength3 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:emstrength@...\">emstrength@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; =================<br/>\n&gt;<br/>\n&gt; I do carry my three year old when she needs me to.  I just did it yesterday<br/>\n&gt; with the baby on my back and a heavy bag in my arms while my 5 year old<br/>\n&gt; lagged behind complaining about how hard it was to walk.<br/>\n&gt;<br/>\n&gt; =================<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Are you sure that pushing a double buggy with two children and a bag in the<br/>\nbottom with a baby on your back would be harder than carrying two children<br/>\nand a bag? I always found it much easier to take the buggy than to carry<br/>\nmore than one child - I have sometimes had three children sitting one in<br/>\nfront of the other in my single buggy (with the seat laid flat) plus bags<br/>\nand coats in the bottom; even when I was pregnant with the fourth that was<br/>\neasier than trying to carry everything and everyone. On one or two occasions<br/>\nI&#39;ve had all four of them in the buggy, even when the eldest was 8 or 9.<br/>\n<br/>\nIf a buggy is out of the question I would second the suggestion of a<br/>\nscooter; if you can&#39;t afford one you could try looking on Freecycle.<br/>\n<br/>\nAnother thing you could try maybe is to find somewhere to sit and rest for<br/>\nhalf an hour after the lesson, with a drink and a snack, before walking<br/>\nhome. Even if your child can manage the distance, it may be too much on top<br/>\nof a dancing or gymnastics lesson, so finding somewhere to rest in between<br/>\nmight make a difference.<br/>\n<br/>\nBernadette.<br/>\n-- <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.bbc.co.uk/dna/h2g2/U15459\">http://www.bbc.co.uk/dna/h2g2/U15459</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":457058835,"authorName":"emstrength3","from":"&quot;emstrength3&quot; &lt;emstrength@...&gt;","profile":"emstrength3","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: How could I haven handled this better?","postDate":"1317259098","msgId":63225,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo2MGgwcStpYjVlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEY4RDUzOUYwRUMwNDREMDFBOTRFREEyMTI5Rjc5REVCQFRhbWFyYT4="},"prevInTopic":63224,"nextInTopic":63226,"prevInTime":63224,"nextInTime":63226,"topicId":63201,"numMessagesInTopic":0,"msgSnippet":"... You are probably right.  I am really feeling the inconvenience of not having a car.  Things that would take a 10 minute drive now take leaving 20 minutes","messageBody":"<div id=\"ygrps-yiv-451470471\">======== It sounds to me like you have made a decision about how it is to be done, <br/>\n<blockquote><span title=\"ireply\"> &gt; and you&#39;re not willing to budge, for any reason.  I suspect this is what is <br/>\n&gt; making your daughter so unhappy, rather than the actual fact of either <br/>\n&gt; walking or taking the bus.=======<br/>\n<br/>\n </span></blockquote>You are probably right.  I am really feeling the inconvenience of not having a car.  Things that would take a 10 minute drive now take leaving 20 minutes early to get to the bus stop, and sometimes nearly an hour on the bus and then doing it all again on the way back.  So I&#39;ve been making the choices that take into consideration all the factors and try to make it *easiest* on all of us, regardless of what we *want* to do.  With most things, I do take everyone&#39;s desires into account, but I guess I&#39;m not being very flexible about this.  <br/>\n<br/>\nEmily</div>","specialLinks":[]},{"userId":457058835,"authorName":"emstrength3","from":"&quot;emstrength3&quot; &lt;emstrength@...&gt;","profile":"emstrength3","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: How could I haven handled this better?","postDate":"1317258554","msgId":63224,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo2MGdmcStpdnY3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGo2MGNuZCt0YnN0QGVHcm91cHMuY29tPg=="},"prevInTopic":63223,"nextInTopic":63225,"prevInTime":63223,"nextInTime":63225,"topicId":63201,"numMessagesInTopic":0,"msgSnippet":"==========We also play lots of games when we are walking, taking the bus or going by train - trying to catch and squish each other s shadows, going on an","messageBody":"<div id=\"ygrps-yiv-1909712585\">==========We also play lots of games when we are walking, taking the bus or going by train - trying to catch and squish each other&#39;s shadows, going on an alphabet walk, learning the lyrics of a favourite song together, playing I Spy games (where we make drawings of things we might see while we are traveling and then checking them off), word association games, rhyming games, &quot;if I could have anything in the world&quot; type games, creating a story together, etc.========<br/>\n<br/>\nThank you!  Would an alphabet walk be where you try to find the letters on signs and license plates?  I had forgotten about that game, but I used to love it when I was a kid.  I will suggest that to her.  And the others are great too.  I will try those!  <br/>\n<br/>\nEmily</div>","specialLinks":[]},{"userId":383546898,"authorName":"Sadie Bugni","from":"Sadie Bugni &lt;lotsagr8kidz@...&gt;","profile":"mesarylee","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: How could I haven handled this better?","postDate":"1317258286","msgId":63223,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBTXVoc3N4R2JRSm0xcmJFRmVOeDBZYXlFTHRXS3U4YmFOK21QYzJLY3crZzRkemE1Z0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGo2MGQwbis1YzJnQGVHcm91cHMuY29tPg==","referencesHeader":"PDRBNDQ4QjgyLTA5NEQtNDEyNC05OUE1LTE0M0RDMTE2MTE4MUBTYW5kcmFkb2RkLmNvbT4JPGo2MGQwbis1YzJnQGVHcm91cHMuY29tPg=="},"prevInTopic":63222,"nextInTopic":63224,"prevInTime":63222,"nextInTime":63224,"topicId":63201,"numMessagesInTopic":0,"msgSnippet":"I m not sure how to quote things on my phone, but your response about having 2 children younger than the 5yo doesn t change the fact that she s only 5. My","messageBody":"<div id=\"ygrps-yiv-241471584\">I&#39;m not sure how to quote things on my phone, but your response about having<br/>\n2 children younger than the 5yo doesn&#39;t change the fact that she&#39;s only 5.<br/>\nMy husband and I decided to have a large family, but we agreed that it was<br/>\nstill important to keep a small family mentality, meaning that we needed to<br/>\nfind joyful ways to be with all our kids and not take away from their<br/>\nexperiences because they had younger sibs. We&#39;ve travel all over the US, do<br/>\nlots of theme parks and other day to day activities that many would see<br/>\nreserved for those with 1 or 2 or 3 kids.<br/>\nI have had a quad stroller, triple stroller, double with a walking child<br/>\nseat and many slings and backpacks.  Right now we usually use our triple,<br/>\nbut often 2 or more seats are empty for most of the trip. It sure is useful<br/>\nto have them instead of making littles walk though.<br/>\nMy sil has always made 4yo her cutoff for stroller use, and they  hardly<br/>\never want to go anywhere because the kids complain too much.  She chooses<br/>\nnot go many places with us because she says it&#39;s about her and how much she<br/>\ncan handle and not the kids.  They really do miss out on a lot because they<br/>\nhave shifted the focus from fun to arbitrary social norms for stroller use,<br/>\ncarrying, ect.<br/>\n<br/>\nSadie Bugni<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sep 28, 2011 8:33 PM, &quot;emstrength3&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:emstrength@...\">emstrength@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt; =========You wrote this: I&#39;m done with my 5 year old.========<br/>\n&gt;<br/>\n&gt; I meant done carrying/pushing her on a regular basis. I wouldn&#39;t mind if<br/>\nshe were an only child or even with 2 kids (like I said, I have carried her<br/>\na LOT and didn&#39;t mind), but I have 2 younger ones and only so much energy<br/>\nand strength.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Can you find the joy in the situation? Maybe not going to the dance class<br/>\nwould be better, if it&#39;s causing so much grief.=========<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; I offered that and she said she wants to continue, so I was trying to come<br/>\nup with ideas to make walking or taking the bus easier. I do try to make it<br/>\nfun- we play I Spy on the bus and sing songs while we walk.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ======Just because a child can read, sometimes parents stop reading to<br/>\nthem. Because a child can read Hop on Pop, the parent won&#39;t read Treasure<br/>\nIsland to him. Sometimes a three year old can walk a long way, for a three<br/>\nyear old, but for her to learn that her mother will never carry her again<br/>\nseems harsh. Not even in a stroller?=========<br/>\n&gt;<br/>\n&gt; I do carry my three year old when she needs me to. I just did it yesterday<br/>\nwith the baby on my back and a heavy bag in my arms while my 5 year old<br/>\nlagged behind complaining about how hard it was to walk.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Emily<br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":283914803,"authorName":"Jo","from":"Jo &lt;jokirby2004@...&gt;","profile":"jokirby2004","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: How could I haven handled this better?","postDate":"1317257175","msgId":63222,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIxRTAwMThFLUE4RUYtNEIzRi04OTQ0LUMyNDNGMUJFNEExRUB5YWhvby5jby51az4=","inReplyToHeader":"PDEzMTcyNTU3MzMuNDQ1OTUuWWFob29NYWlsTmVvQHdlYjgxNTAxLm1haWwubXVkLnlhaG9vLmNvbT4=","referencesHeader":"PDYxNjdEQTJFLTE1RDUtNEJDMC05RkFDLTYyMEFFRDczM0VDRkBTYW5kcmFkb2RkLmNvbT4gPGo2MGI3dis1b3BnQGVHcm91cHMuY29tPiA8MTMxNzI1NTczMy40NDU5NS5ZYWhvb01haWxOZW9Ad2ViODE1MDEubWFpbC5tdWQueWFob28uY29tPg=="},"prevInTopic":63221,"nextInTopic":63223,"prevInTime":63221,"nextInTime":63223,"topicId":63201,"numMessagesInTopic":0,"msgSnippet":"I m wondering if your daughter would like a bit more control. Could you ask her if she really wants to go, and if she does, explain the ways of getting","messageBody":"<div id=\"ygrps-yiv-1471732535\">I&#39;m wondering if your daughter would like a bit more control. Could you ask her if she really wants to go, and if she does, explain the ways of getting there/home and ask which she would like to do? <br/>\n<br/>\nI notice she is your eldest isn&#39;t she?, I wonder if she would like to be treated a little bit &#39;grown up&#39;, and get to make the sort of decisions and planning mummy gets to make.<br/>\n<br/>\nMaybe you are over-thinking the potential &#39;problems&#39; (the wait, the late return etc.), at the expense of your daughter&#39;s sense of autonomy and choice?<br/>\n<br/>\nI also just thought about a scooter, my son loves his and it&#39;s easy to carry and take on buses when he&#39;s had enough. <br/>\n<br/>\nAll the best,<br/>\nJo <br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 29 Sep 2011, at 01:22, BRIAN POLIKOWSKY &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:polykowholsteins@...\">polykowholsteins@...</a>&gt; wrote:<br/>\n<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; &lt;&lt;&lt;Even if I could get one for free, I don&#39;t know if I would be willing to do that. The walk is less than a mile, and she has been capable of doing that since she was 3. She asks to go on hikes and walks where she walks that far. It would mean me pushing 85 pounds of children (including my 3 year old who does all or most of the walk without complaint) and carrying the baby on my back, plus struggling with it on the bus one way. I don&#39;t mind carrying my kids past the socially acceptable norm, or in this case pushing them (last summer I carried her at 4 years old on my back with her sister who was 2 on the front while I was pregnant fairly often. Now I carry the baby and my 3 year old), but think I&#39;m done with my 5 year old. &gt;&gt;&gt;<br/>\n&gt; <br/>\n&gt; So you are unwilling to do anything that may help your daughter?? Why did you ask her then? Did you want people to say it was OK to make her walk without complaining ?<br/>\n&gt; Maybe she rather not go to gymnastics and dance.  <br/>\n&gt; Maye walk back and forth with a stroller does not mean she and the 3 year old will want to ride the whole time in it.<br/>\n&gt; I used to take my stroller everywhere ( a jogging one with fat wheels that can go on rough terrain). It was a life saver sometimes and it was great to take stuff in it like water, extra clothes and snacks. Sometimes I took it just to carry stuff!<br/>\n&gt; I am debating this Friday if I should take it to the Renaissance Fair we are going ( I did take last year mostly to carry stuff). My daughter is 5  and we will be walking all day and the stroller is awesome to carry stuff. <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":333388203,"authorName":"Rinelle","from":"&quot;Rinelle&quot; &lt;rinelle@...&gt;","profile":"rinelle2011","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: How could I haven handled this better?","postDate":"1317256900","msgId":63221,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY4RDUzOUYwRUMwNDREMDFBOTRFREEyMTI5Rjc5REVCQFRhbWFyYT4=","inReplyToHeader":"PDEzMTcyNTU3MzMuNDQ1OTUuWWFob29NYWlsTmVvQHdlYjgxNTAxLm1haWwubXVkLnlhaG9vLmNvbT4=","referencesHeader":"PDYxNjdEQTJFLTE1RDUtNEJDMC05RkFDLTYyMEFFRDczM0VDRkBTYW5kcmFkb2RkLmNvbT4gPGo2MGI3dis1b3BnQGVHcm91cHMuY29tPiA8MTMxNzI1NTczMy40NDU5NS5ZYWhvb01haWxOZW9Ad2ViODE1MDEubWFpbC5tdWQueWFob28uY29tPg=="},"prevInTopic":63219,"nextInTopic":63222,"prevInTime":63220,"nextInTime":63222,"topicId":63201,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1248182363\">&lt;&lt;&lt;Even if I could get one for free, I don&#39;t know if I would be willing to <br/>\ndo that.  The walk is less than a mile, and she has been capable of doing <br/>\nthat since she was 3.  She asks to go on hikes and walks where she walks <br/>\nthat far.  It would mean me pushing 85 pounds of children (including my 3 <br/>\nyear old who does all or most of the walk without complaint) and carrying <br/>\nthe baby on my back, plus struggling with it on the bus one way.  I don&#39;t <br/>\nmind carrying my kids past the socially acceptable norm, or in this case <br/>\npushing them (last summer I carried her at 4 years old on my back with her <br/>\nsister who was 2 on the front while I was pregnant fairly often.  Now I <br/>\ncarry the baby and my 3 year old), but think I&#39;m done with my 5 year old. <br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>My daughter is 7 this year, and I still carry her when she gets tired. <br/>\n(Admittedly she is not heavy for her age).  Piggy backs are good for kids <br/>\nwho are a little bigger and heavier.  Certainly if we were having to walk <br/>\nfrequently, I&#39;d pull out the pram and push her if she wasn&#39;t wanting to <br/>\nwalk.  When she was a few years younger, we used to go to the markets each <br/>\nweek for fresh fruit and veg.  My mum bought a second hand pram to carry our <br/>\nfruit and veg, but of course, my then 5yo wanted to ride in it.  It made <br/>\ntaking her to the markets far more pleasant for her, so my mum and I, and <br/>\nlater just me when my mum moved away, would push her and our fruit and veg <br/>\naround the markets, in a very old pram, on rough dirt.gravel paths.  Was it <br/>\neasy?  No.  But my daughter didn&#39;t really want to be there, and was only <br/>\nthere because of my need.  I could argue that she benefited from the fruit <br/>\nand veg too, but still, it was my choice to be there at that time.<br/>\n<br/>\nEven now, when we&#39;re shopping, she will ride in the trolley rather than walk <br/>\naround the shops by herself.  This isn&#39;t to say she doesn&#39;t walk anywhere. <br/>\nShe loves going on hikes/bushwalks, and has no trouble walking a 3km (about <br/>\n2 miles?) track.  But sometimes she doesn&#39;t want to walk.<br/>\n<br/>\nI can see that you are frustrated by your daughter wanting to do whatever <br/>\nyou&#39;re not wanting to do at the time (walk when you want to bus, bus when <br/>\nyou want to walk), rather than just by her not walking, but I think what is <br/>\nstressing her (or what would be stressing my daughter in a similar <br/>\nsituation), is not having a choice in which you do.  Is it possible to leave <br/>\nearly enough that if your daughter says she wants to walk when you&#39;re at the <br/>\nbus stop, you can say OK?  And if she wants to catch the bus on the way <br/>\nback, explain that that will mean waiting, and let her sometimes make that <br/>\nchoice.  Perhaps she will choose to walk anyway after waiting for a bit, <br/>\nperhaps not, but I&#39;m willing to bet that if she knows she will be able to <br/>\nhave a say in which you do, then she will be more willing to work with you <br/>\non finding solutions.<br/>\n<br/>\nIt sounds to me like you have made a decision about how it is to be done, <br/>\nand you&#39;re not willing to budge, for any reason.  I suspect this is what is <br/>\nmaking your daughter so unhappy, rather than the actual fact of either <br/>\nwalking or taking the bus.<br/>\n<br/>\nTamara</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: How could I haven handled this better?","postDate":"1317255733","msgId":63215,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTcyNTU3MzMuNDQ1OTUuWWFob29NYWlsTmVvQHdlYjgxNTAxLm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PGo2MGI3dis1b3BnQGVHcm91cHMuY29tPg==","referencesHeader":"PDYxNjdEQTJFLTE1RDUtNEJDMC05RkFDLTYyMEFFRDczM0VDRkBTYW5kcmFkb2RkLmNvbT4gPGo2MGI3dis1b3BnQGVHcm91cHMuY29tPg=="},"prevInTopic":63214,"nextInTopic":63216,"prevInTime":63214,"nextInTime":63216,"topicId":63201,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-55512355\">&lt;&lt;&lt;Even if I could get one for free, I don&#39;t know if I would be willing to do that.  The walk is less than a mile, and she has been capable of doing that since she was 3.  She asks to go on hikes and walks where she walks that far.  It would mean me pushing 85 pounds of children (including my 3 year old who does all or most of the walk without complaint) and carrying the baby on my back, plus struggling with it on the bus one way.  I don&#39;t mind carrying my kids past the socially acceptable norm, or in this case pushing them (last summer I carried her at 4 years old on my back with her sister who was 2 on the front while I was pregnant fairly often.  Now I carry the baby and my 3 year old), but think I&#39;m done with my 5 year old. &gt;&gt;&gt;<br/>\n<br/>\nSo you are unwilling to do anything that may help your daughter?? Why did you ask her then? Did you want people to say it was OK to make her walk without complaining ?<br/>\nMaybe she rather not go to gymnastics and dance.  <br/>\nMaye walk back and forth with a stroller does not mean she and the 3 year old will want to ride the whole time in it.<br/>\nI used to take my stroller everywhere ( a jogging one with fat wheels that can go on rough terrain). It was a life saver sometimes and it was great to take stuff in it like water, extra clothes and snacks. Sometimes I took it just to carry stuff!<br/>\nI am debating this Friday if I should take it to the Renaissance Fair we are going ( I did take last year mostly to carry stuff). My daughter is 5  and we will be walking all day and the stroller is awesome to carry stuff. <br/>\n<br/>\n<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":457058835,"authorName":"emstrength3","from":"&quot;emstrength3&quot; &lt;emstrength@...&gt;","profile":"emstrength3","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: How could I haven handled this better?","postDate":"1317255378","msgId":63218,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo2MGRjaSt2bThAZUdyb3Vwcy5jb20+","inReplyToHeader":"PDRBNDQ4QjgyLTA5NEQtNDEyNC05OUE1LTE0M0RDMTE2MTE4MUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":63217,"nextInTopic":63219,"prevInTime":63217,"nextInTime":63219,"topicId":63201,"numMessagesInTopic":0,"msgSnippet":"==== So your daughter is kind of like you?  Because people have cheerfully made suggestions, and you ve said no, that s not what you want.  Even if it was","messageBody":"<div id=\"ygrps-yiv-1795134993\">==== So your daughter is kind of like you?  Because people have cheerfully made suggestions, and you&#39;ve said no, that&#39;s not what you want.  Even if it was free, you wouldn&#39;t want it.======<br/>\n<br/>\nI&#39;m sorry, I realized I am just arguing with the suggestions.  I&#39;m sure she does get it from me!  <br/>\n<br/>\nI do appreciate the ideas.  <br/>\n<br/>\nEmily</div>","specialLinks":[]},{"userId":457058835,"authorName":"emstrength3","from":"&quot;emstrength3&quot; &lt;emstrength@...&gt;","profile":"emstrength3","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: How could I haven handled this better?","postDate":"1317255172","msgId":63217,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo2MGQ2NCtzaTNnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBREZVMFNBNC09clRCYS1NcEpiQnFZcVk1VjZVMnV1TXFhSF8rLWZzUXNGS1FMb3NhQUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":63216,"nextInTopic":63218,"prevInTime":63216,"nextInTime":63218,"topicId":63201,"numMessagesInTopic":0,"msgSnippet":"... Because if we walk there, they will be tired during the class and even more exhausted on the walk home.  When my husband can come with us, we do walk there","messageBody":"<div id=\"ygrps-yiv-867322346\"><blockquote><span title=\"ireply\">&gt; I am confused by why u have to take the bus there if it&#39;s walking distance<br/>\n&gt; and walk back if there&#39;s a bus?  lyla<br/>\n<br/>\n<br/>\n </span></blockquote>Because if we walk there, they will be tired during the class and even more exhausted on the walk home.  When my husband can come with us, we do walk there if they want to and we bring the wagon.  <br/>\n<br/>\nAfter gymnastics, the bus does not run that late.  After dance, the timing would mean getting home 2 hours after class gets out (and still walking home from the bus stop) rather than walking and getting home in 20 minutes.</div>","specialLinks":[]},{"userId":457058835,"authorName":"emstrength3","from":"&quot;emstrength3&quot; &lt;emstrength@...&gt;","profile":"emstrength3","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: How could I haven handled this better?","postDate":"1317254999","msgId":63216,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo2MGQwbis1YzJnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDRBNDQ4QjgyLTA5NEQtNDEyNC05OUE1LTE0M0RDMTE2MTE4MUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":63215,"nextInTopic":63217,"prevInTime":63215,"nextInTime":63217,"topicId":63201,"numMessagesInTopic":0,"msgSnippet":"=========You wrote this:   I m done with my 5 year old.======== I meant done carrying/pushing her on a regular basis.  I wouldn t mind if she were an only","messageBody":"<div id=\"ygrps-yiv-1824193706\">=========You wrote this:   I&#39;m done with my 5 year old.========<br/>\n<br/>\nI meant done carrying/pushing her on a regular basis.  I wouldn&#39;t mind if she were an only child or even with 2 kids (like I said, I have carried her a LOT and didn&#39;t mind), but I have 2 younger ones and only so much energy and strength. <br/>\n<br/>\n<br/>\nCan you find the joy in the situation?  Maybe not going to the dance class would be better, if it&#39;s causing so much grief.=========<br/>\n<br/>\n<br/>\nI offered that and she said she wants to continue, so I was trying to come up with ideas to make walking or taking the bus easier.  I do try to make it fun- we play I Spy on the bus and sing songs while we walk.   <br/>\n<br/>\n<br/>\n======Just because a child can read, sometimes parents stop reading to them.   Because a child can read Hop on Pop, the parent won&#39;t read Treasure Island to him.  Sometimes a three year old can walk a long way, for a three year old, but for her to learn that her mother will never carry her again seems harsh.  Not even in a stroller?=========<br/>\n<br/>\nI do carry my three year old when she needs me to.  I just did it yesterday with the baby on my back and a heavy bag in my arms while my 5 year old lagged behind complaining about how hard it was to walk.  <br/>\n<br/>\n<br/>\nEmily</div>","specialLinks":[]},{"userId":185586397,"authorName":"Lyla Wolfenstein","from":"Lyla Wolfenstein &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] How could I haven handled this better?","postDate":"1317254719","msgId":63213,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBREZVMFNBNC09clRCYS1NcEpiQnFZcVk1VjZVMnV1TXFhSF8rLWZzUXNGS1FMb3NhQUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGo2MDNyOSs0dWZ1QGVHcm91cHMuY29tPg==","referencesHeader":"PGo2MDNyOSs0dWZ1QGVHcm91cHMuY29tPg=="},"prevInTopic":63212,"nextInTopic":63214,"prevInTime":63212,"nextInTime":63214,"topicId":63201,"numMessagesInTopic":0,"msgSnippet":"I am confused by why u have to take the bus there if it s walking distance and walk back if there s a bus?  lyla ... somewhere. These are all places she wants","messageBody":"<div id=\"ygrps-yiv-642322454\">I am confused by why u have to take the bus there if it&#39;s walking distance<br/>\nand walk back if there&#39;s a bus?  lyla<br/>\n<blockquote><span title=\"qreply\"> On Sep 28, 2011 2:33 PM, &quot;emstrength3&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:emstrength@...\">emstrength@...</a>&gt; wrote:<br/>\n&gt; Recently my 5 year old has been having a difficult time every time we go<br/>\nsomewhere. These are all places she wants to go, but she complains about<br/>\nhaving to walk or having to take the bus. Yesterday, we went to dance class<br/>\nand we needed to take the bus there and walk home. She complained about<br/>\ntaking the bus there (&quot;I don&#39;t want to ride the bus! I want to walk! We<br/>\nnever get to go on walks! Fine, if I can&#39;t walk there, I&#39;m not going!&quot;) Once<br/>\nwe got on the bus, she was fine until it was time to go home. (&quot;I don&#39;t want<br/>\nto walk! I&#39;m too tired, it&#39;s too hot, my legs hurt. Why can&#39;t we take the<br/>\nbus?! Fine, if I can&#39;t take the bus, I&#39;m not going home!&quot;)<br/>\n&gt;<br/>\n&gt; As we walked home, I told her that taking the bus and walking home is part<br/>\nof doing dance and gymnastics right now. I tried to brainstorm ideas to make<br/>\nwalking easier for her, but the only thing I could come up with is that she<br/>\ncould ride her bike once she learns how. I already bring food, water,<br/>\ncomfortable shoes, we sing songs (ants go marching and that kind of thing).<br/>\n&gt;<br/>\n&gt; Today, we took the bus to the library story time and back home. While<br/>\nwalking to the bus stop and waiting for the bus, she was complaining about<br/>\ntaking the bus (&quot;I want to walk! We NEVER get to walk anywhere! I&#39;m not<br/>\ngetting on the bus!&quot;) So I told her (calmly, matter of factly) that I was<br/>\ntired of listening to her complain every time we went somewhere, and that<br/>\ntomorrow she can stay home with her dad while I take her sister to<br/>\ngymnastics, because I don&#39;t want to listen to it on the way home. Then I<br/>\nrealized that that was really like punishment, so I said that she could go<br/>\nto gymnastics if we could come up with some ideas to make walking easier for<br/>\nher. She was not interested in brainstorming, she just started saying over<br/>\nand over &quot;I want to go! I want to go!&quot;<br/>\n&gt;<br/>\n&gt; I told her that she could choose to sit there and cry about not going or<br/>\nshe could choose to brainstorm ways to make walking easier so that she could<br/>\ngo and get home without complaining, but it was her choice and crying about<br/>\nit wasn&#39;t going to change my mind.<br/>\n&gt;<br/>\n&gt; We didn&#39;t talk about it again until we got home and she brought up my idea<br/>\nto ride her bike. That will be fine at some point, but right now, it needs<br/>\nto be fixed and she doesn&#39;t know how to ride it. So, we are going to work on<br/>\nthat, but in the meantime, what do I do about gymnastics tomorrow? We have<br/>\nto take the bus there and walk home.<br/>\n&gt;<br/>\n&gt; I don&#39;t like the way I handled it, but I don&#39;t know what else to do. Any<br/>\nideas for making the walk easier and how I can handle future situations<br/>\nbetter?<br/>\n&gt;<br/>\n&gt; Emily<br/>\n&gt;<br/>\n&gt; (Ezabella 5, Liliana 3, Zaria 9 mo)<br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":332164648,"authorName":"Rippy Dusseldorp","from":"&quot;Rippy Dusseldorp&quot; &lt;ripgray@...&gt;","profile":"rdusseldorp","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: How could I haven handled this better?","postDate":"1317254701","msgId":63219,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo2MGNuZCt0YnN0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGo2MDNyOSs0dWZ1QGVHcm91cHMuY29tPg=="},"prevInTopic":63218,"nextInTopic":63221,"prevInTime":63218,"nextInTime":63220,"topicId":63201,"numMessagesInTopic":0,"msgSnippet":"We used a walking bike to get to places when the children were younger and my 4 year old still uses hers to get around. I found a second hand bike like this","messageBody":"<div id=\"ygrps-yiv-1800681449\">We used a walking bike to get to places when the children were younger and my 4 year old still uses hers to get around. I found a second hand bike like this one: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.amazon.co.uk/Puky-LR-M/dp/B003MXRLLS\">http://www.amazon.co.uk/Puky-LR-M/dp/B003MXRLLS</a><br/>\n<br/>\nWe also play lots of games when we are walking, taking the bus or going by train - trying to catch and squish each other&#39;s shadows, going on an alphabet walk, learning the lyrics of a favourite song together, playing I Spy games (where we make drawings of things we might see while we are traveling and then checking them off), word association games, rhyming games, &quot;if I could have anything in the world&quot; type games, creating a story together, etc.<br/>\n<br/>\nFor my two children, 4 and 6, the journey has to be an event on its own. Something special and exciting, otherwise it&#39;s much more stressful for all of us.<br/>\n<br/>\nRippy</div>","specialLinks":[]},{"userId":457058835,"authorName":"emstrength3","from":"&quot;emstrength3&quot; &lt;emstrength@...&gt;","profile":"emstrength3","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: How could I haven handled this better?","postDate":"1317254299","msgId":63214,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo2MGNhcitmN2F2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDRFODNBMzhBLjUwOTA4MDdAbGl2aW5nam95ZnVsbHkuY2E+"},"prevInTopic":63213,"nextInTopic":63215,"prevInTime":63213,"nextInTime":63215,"topicId":63201,"numMessagesInTopic":0,"msgSnippet":"... This is something I have been trying to work out in my own mind lately.   Often I try to help her brainstorm ideas and help in other ways and she just gets","messageBody":"<div id=\"ygrps-yiv-2047576843\">========= By  continually emphasizing that it&#39;s *her choice* it can come across like you&#39;re laying the blame for your frustration at her feet. She&#39;s knows<br/>\n<blockquote><span title=\"ireply\"> &gt; you&#39;re frustrated. It&#39;s also likely she would prefer not to be crying, not to be upset, but her behaviour is all she can come up with in the moment -<br/>\n&gt; she&#39;s gotten to point where she doesn&#39;t see any other choices. Telling her she&#39;s choosing to be upset isn&#39;t giving her any useful information to move<br/>\n&gt; forward through the situation. ============<br/>\n<br/>\n </span></blockquote>This is something I have been trying to work out in my own mind lately.   Often I try to help her brainstorm ideas and help in other ways and she just gets stuck.  She won&#39;t move past whatever she is upset about.  I validate her feelings, give her time and space, but ultimately it&#39;s like she is blaming me for her upset when I have done everything in my power to help.  I don&#39;t want her growing up with a victim mentality (&quot;I can&#39;t do anything.  Everyone is out to make my life miserable.&quot;), so I get to a point when I say things like that.  &quot;You can cry about it or you can do xyz (and I always give ideas) to change it.&quot;  <br/>\n<br/>\nNow I totally get that in this situation I was the one who was setting up the choices (either brainstorm ideas so you are ok on the walk home or I won&#39;t let you go), so it would be my fault that she couldn&#39;t go if I didn&#39;t let her go.  That&#39;s why I didn&#39;t feel right about saying that this time.  But I don&#39;t know what to say in those situations!  <br/>\n<br/>\n<br/>\nEmily</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: How could I haven handled this better?","postDate":"1317254190","msgId":63211,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRBNDQ4QjgyLTA5NEQtNDEyNC05OUE1LTE0M0RDMTE2MTE4MUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGo2MGI3dis1b3BnQGVHcm91cHMuY29tPg==","referencesHeader":"PGo2MGI3dis1b3BnQGVHcm91cHMuY29tPg=="},"prevInTopic":63210,"nextInTopic":63212,"prevInTime":63210,"nextInTime":63212,"topicId":63201,"numMessagesInTopic":0,"msgSnippet":"-=-Even if I could get one for free, I don t know if I would be willing to do that-=- -=-Whether we take the bus or walk, she complains and wants to do the","messageBody":"<div id=\"ygrps-yiv-553758325\">-=-Even if I could get one for free, I don&#39;t know if I would be willing to do that-=-<br/>\n<br/>\n-=-Whether we take the bus or walk, she complains and wants to do the other on-=-<br/>\n<br/>\nSo your daughter is kind of like you?  Because people have cheerfully made suggestions, and you&#39;ve said no, that&#39;s not what you want.  Even if it was free, you wouldn&#39;t want it.<br/>\n<br/>\n-=-Now I carry the baby and my 3 year old), but think I&#39;m done with my 5 year old. -=-<br/>\n<br/>\n<br/>\nYou wrote this:   I&#39;m done with my 5 year old.<br/>\n<br/>\nThat&#39;s a very strong thing to write.  Not willing to push her, might take the bicycle she doesn&#39;t know how to ride yet (that sounded very, very dangerous when you wrote it before, and you know you would end up lifting it in and out of a bus, and then probably walking it along the road, but that was on your list of possibilities)....<br/>\n<br/>\nI have no idea what you expected us to recommend.<br/>\n<br/>\nIf you&#39;re done with your five year old, you could put her up for adoption.  It sounds like she&#39;s never happy and you&#39;re not willing to compromise.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nYeah, that&#39;s very extreme, on purpose.  Will you choose to keep her?  Can you find the joy in the situation?  Maybe not going to the dance class would be better, if it&#39;s causing so much grief.<br/>\n<br/>\nJust because a child can read, sometimes parents stop reading to them.   Because a child can read Hop on Pop, the parent won&#39;t read Treasure Island to him.  Sometimes a three year old can walk a long way, for a three year old, but for her to learn that her mother will never carry her again seems harsh.  Not even in a stroller?<br/>\n<br/>\nIt might help to think of the principle of the thing and of your priorities.  The purpose of walking home is to get home.  MAYBE it would be more fun to do something and wait for the later bus than to endure the unhappiness.  Maybe if being home is important, staying home would solve the problem.  <br/>\n<br/>\nSandra<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":327852347,"authorName":"Tress Miles","from":"Tress Miles &lt;milesdt@...&gt;","profile":"abacaxi7476","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: How could I haven handled this better?","postDate":"1317254062","msgId":63212,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBRkxLeTMza2hMZXJEQ1FDaTRMb2daWkpnbXJZWnoyUUhyNFpDNEhiQWFWNkc1M0stQUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGo2MGJqbitxcThsQGVHcm91cHMuY29tPg==","referencesHeader":"PDZGQjQ0RkYzLTNDQ0EtNEQxNi04QzlBLTlBQTQyQjk0RDdEREBTYW5kcmFkb2RkLmNvbT4JPGo2MGJqbitxcThsQGVHcm91cHMuY29tPg=="},"prevInTopic":63211,"nextInTopic":63213,"prevInTime":63211,"nextInTime":63213,"topicId":63201,"numMessagesInTopic":0,"msgSnippet":"When my daughter complains about something, it s almost always about something else that has nothing to do with the original complaint.  Is it possible","messageBody":"<div id=\"ygrps-yiv-236097680\">When my daughter complains about something, it&#39;s almost always about<br/>\nsomething else that has nothing to do with the original complaint.  Is it<br/>\npossible something else is going on?  Can you look &quot;beneath the surface?&quot;<br/>\nTress<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Wed, Sep 28, 2011 at 7:45 PM, emstrength3 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:emstrength@...\">emstrength@...</a>&gt; wrote:<br/>\n<br/>\n&gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; You made it about you. Sometimes that&#39;s fine, but you could have made a<br/>\n&gt; list of times you&#39;ve walked, just to clarify that &quot;never&quot; wasn&#39;t true.<br/>\n&gt; ======<br/>\n&gt;<br/>\n&gt; I reminded her of the night before when we walked and she said the whole<br/>\n&gt; way home that she wanted to take the bus.<br/>\n&gt;<br/>\n&gt; ====Did you have snacks with you? A drink? Did you have a smile and a song?<br/>\n&gt; A toy?===========<br/>\n&gt;<br/>\n&gt; Yes, all of the above.<br/>\n&gt;<br/>\n&gt; Emily<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":457058835,"authorName":"emstrength3","from":"&quot;emstrength3&quot; &lt;emstrength@...&gt;","profile":"emstrength3","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: How could I haven handled this better?","postDate":"1317253559","msgId":63210,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo2MGJqbitxcThsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDZGQjQ0RkYzLTNDQ0EtNEQxNi04QzlBLTlBQTQyQjk0RDdEREBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":63209,"nextInTopic":63211,"prevInTime":63209,"nextInTime":63211,"topicId":63201,"numMessagesInTopic":0,"msgSnippet":"... I reminded her of the night before when we walked and she said the whole way home that she wanted to take the bus. ====Did you have snacks with you?  A","messageBody":"<div id=\"ygrps-yiv-518959412\"><blockquote><span title=\"ireply\">&gt; <br/>\n&gt; You made it about you.  Sometimes that&#39;s fine, but you could have made a list of times you&#39;ve walked, just to clarify that &quot;never&quot; wasn&#39;t true.  ======<br/>\n<br/>\n<br/>\n </span></blockquote>I reminded her of the night before when we walked and she said the whole way home that she wanted to take the bus.  <br/>\n<br/>\n<br/>\n<br/>\n====Did you have snacks with you?  A drink?  Did you have a smile and a song?  A toy?===========<br/>\n<br/>\nYes, all of the above.  <br/>\n<br/>\n<br/>\nEmily</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] How could I haven handled this better?","postDate":"1317253285","msgId":63208,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFFRjlCNzZBLTMwNTUtNEIxOC1BOEY4LUVCMEMwNzJFN0Y2M0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDRFODNBMzhBLjUwOTA4MDdAbGl2aW5nam95ZnVsbHkuY2E+","referencesHeader":"PGo2MDNyOSs0dWZ1QGVHcm91cHMuY29tPiA8NEU4M0EzOEEuNTA5MDgwN0BsaXZpbmdqb3lmdWxseS5jYT4="},"prevInTopic":63207,"nextInTopic":63209,"prevInTime":63207,"nextInTime":63209,"topicId":63201,"numMessagesInTopic":0,"msgSnippet":"-=- And don t hold her agreement over her head if it doesn t work out the next time. Try something else. And something else. In the bigger picture, with","messageBody":"<div id=\"ygrps-yiv-1831718521\">-=- And don&#39;t hold her<br/>\n&quot;agreement&quot; over her head if it doesn&#39;t work out the next time. Try something else. And something else. In the bigger picture, with every step in the<br/>\nprocess you guys are figuring out ways to work things out together.-=-<br/>\n<br/>\nGood advice from Pam L.   Also, remember she&#39;s older every time.  You&#39;re not working longterm to figure out how to keep a five year old happy.  Soon she won&#39;t be five anymore.  You&#39;re helping her grow up into a thoughtful woman.  <br/>\n<br/>\n&quot;As we get older and our kids grow up, we eventually come to realize that all the big things in our lives are really the direct result of how we&#39;ve handled all the little things.&quot; �Pam Sorooshian, June 4, 2007<br/>\n<br/>\nTo read more by either or both of those wise moms named Pam:  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/pamsorooshian\">http://sandradodd.com/pamsorooshian</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/pamlaricchia\">http://sandradodd.com/pamlaricchia</a><br/>\n(and each of those leads out to the writer&#39;s own site)<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":457058835,"authorName":"emstrength3","from":"&quot;emstrength3&quot; &lt;emstrength@...&gt;","profile":"emstrength3","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: How could I haven handled this better?","postDate":"1317253183","msgId":63209,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo2MGI3dis1b3BnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDYxNjdEQTJFLTE1RDUtNEJDMC05RkFDLTYyMEFFRDczM0VDRkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":63208,"nextInTopic":63210,"prevInTime":63208,"nextInTime":63210,"topicId":63201,"numMessagesInTopic":0,"msgSnippet":"... Dance class ends at 5:15, the bus would not come to that stop until 6:05 and then we would have to ride it until 7 to get to the stop nearest our house","messageBody":"<div id=\"ygrps-yiv-1397113199\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; -=-Why can&#39;t we take the bus?! Fine, if I can&#39;t take the bus, I&#39;m not going home!&quot;)<br/>\n&gt; <br/>\n&gt; -=-As we walked home, I told her that taking the bus and walking home is part of doing dance and gymnastics right now. -=-<br/>\n&gt; <br/>\n&gt; Could you explain it to us?  Why couldn&#39;t you take the bus back too?<br/>\n&gt; <br/>\n&gt; I like the stroller suggestion.<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n<br/>\n </span></blockquote>Dance class ends at 5:15, the bus would not come to that stop until 6:05 and then we would have to ride it until 7 to get to the stop nearest our house which would still require several blocks of walking.   <br/>\n<br/>\nGymnastics is later in the evening and the bus does not run at all that late.<br/>\n<br/>\nWhether we take the bus or walk, she complains and wants to do the other one, so I&#39;ve made the decisions based on time of day (trying not to walk in the worst heat), how long the bus ride will be, trying to take the bus before class so they aren&#39;t tired from the walk during class, etc.<br/>\n<br/>\nThanks for the stroller suggestion.  We don&#39;t own one and the budget is very tight right now.  My husband is doing an little construction job right now that will end in a few weeks, and there is nothing else lined up.   <br/>\n<br/>\nEven if I could get one for free, I don&#39;t know if I would be willing to do that.  The walk is less than a mile, and she has been capable of doing that since she was 3.  She asks to go on hikes and walks where she walks that far.  It would mean me pushing 85 pounds of children (including my 3 year old who does all or most of the walk without complaint) and carrying the baby on my back, plus struggling with it on the bus one way.  I don&#39;t mind carrying my kids past the socially acceptable norm, or in this case pushing them (last summer I carried her at 4 years old on my back with her sister who was 2 on the front while I was pregnant fairly often.  Now I carry the baby and my 3 year old), but think I&#39;m done with my 5 year old.   <br/>\n<br/>\nSometimes my husband comes with us and then we take the wagon and walk both ways, but he can&#39;t always come.    <br/>\n<br/>\nEmily</div>","specialLinks":[]},{"userId":383546898,"authorName":"Sadie Bugni","from":"Sadie Bugni &lt;lotsagr8kidz@...&gt;","profile":"mesarylee","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] How could I haven handled this better?","postDate":"1317251154","msgId":63207,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBTXVoc3N6OT1rd0ZKMS1oS21MM1dPek01QjBEMEx5Y3BfZjg0dmhXK1Vnbk5GOTZEd0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDZGQjQ0RkYzLTNDQ0EtNEQxNi04QzlBLTlBQTQyQjk0RDdEREBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGo2MDNyOSs0dWZ1QGVHcm91cHMuY29tPgk8NkZCNDRGRjMtM0NDQS00RDE2LThDOUEtOUFBNDJCOTREN0REQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":63206,"nextInTopic":63208,"prevInTime":63206,"nextInTime":63208,"topicId":63201,"numMessagesInTopic":0,"msgSnippet":"We have lots of littles and one thing we decided early on was to always have a big enough stroller so that they have option to walk or ride. When we hike, we","messageBody":"<div id=\"ygrps-yiv-181446409\">We have lots of littles and one thing we decided early on was to always have<br/>\na big enough stroller so that they have option to walk or ride. When we<br/>\nhike, we only have a double jogging stroller so my husband and I each wear<br/>\nfront or backpacks to compensate for the lack of seats.<br/>\n5 is still pretty little, so to expect walking on an adult&#39;s terms is kinda<br/>\nunrealistic, I think. My kiddos havn&#39;t been ready to walk independently<br/>\nuntil at least 6 or 7 full time.<br/>\nAt first, many of them want to walk when we go out so we usually start by<br/>\ndeclaring that we&#39;re some kind of team (dinosaur or super hero or<br/>\nwhatever).  They&#39;re usually enthusiastic at that point and so we keep it<br/>\ngoing with stomping or flying or something along those lines. Yes, we get<br/>\nstrange looks often, but the kids are happy and we&#39;re moving along nicely.<br/>\nWe also play I spy or guessing games as we walk.  This can get really fun if<br/>\nwe&#39;re at the zoo or museum. It amazes me to see the things they pick out of<br/>\nthe scenery.<br/>\nI think the biggest thing is to keep it fun and recognize when they&#39;re done.<br/>\nA good stroller and a positive attitude can go a long way.<br/>\n<br/>\nSadie Bugni<br/>\n<blockquote><span title=\"qreply\"> On Sep 28, 2011 5:54 PM, &quot;Sandra Dodd&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; wrote:<br/>\n&gt; -=-Yesterday, we went to dance class and we needed to take the bus there<br/>\nand walk home-=-<br/>\n&gt; -=-...what do I do about gymnastics tomorrow? We have to take the bus<br/>\nthere and walk home.-=-<br/>\n&gt;<br/>\n&gt; It is way uphill on the way and downhill on the way back?<br/>\n&gt;<br/>\n&gt; If it&#39;s level ground, why can&#39;t you walk to class and take the bus back<br/>\n(when you&#39;re tired and would like to get home more quickly)?<br/>\n&gt;<br/>\n&gt; -=- We have to -=-<br/>\n&gt;<br/>\n&gt; The &quot;have to&quot; alarm went off. <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/haveto\">http://sandradodd.com/haveto</a><br/>\n&gt;<br/>\n&gt; -=-she was complaining about taking the bus (&quot;I want to walk! We NEVER get<br/>\nto walk anywhere! I&#39;m not getting on the bus!&quot;) So I told her (calmly,<br/>\nmatter of factly) that I was tired of listening to her complain every time<br/>\nwe went somewhere-=-<br/>\n&gt;<br/>\n&gt; You made it about you. Sometimes that&#39;s fine, but you could have made a<br/>\nlist of times you&#39;ve walked, just to clarify that &quot;never&quot; wasn&#39;t true.<br/>\n&gt;<br/>\n&gt; Just because someone wants to eat doesn&#39;t means she ALWAYS wants to eat.<br/>\nJust because I turn down food when I&#39;m full doesn&#39;t mean I never want food<br/>\nagain.<br/>\n&gt;<br/>\n&gt; Sometimes someone might want to walk, but that doesn&#39;t mean she never<br/>\nwants to sit down, or never wants to take the bus.<br/>\n&gt;<br/>\n&gt; It sounds like you&#39;re both dealing in extremes.<br/>\n&gt;<br/>\n&gt; -=- She was not interested in brainstorming, she just started saying over<br/>\nand over &quot;I want to go! I want to go!&quot; -=-<br/>\n&gt;<br/>\n&gt; Did you have snacks with you? A drink? Did you have a smile and a song? A<br/>\ntoy?<br/>\n&gt;<br/>\n&gt; Sandra<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":231154952,"authorName":"Pam Laricchia","from":"Pam Laricchia &lt;pam@...&gt;","profile":"learn2day2002","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] How could I haven handled this better?","postDate":"1317249930","msgId":63206,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRFODNBMzhBLjUwOTA4MDdAbGl2aW5nam95ZnVsbHkuY2E+","inReplyToHeader":"PGo2MDNyOSs0dWZ1QGVHcm91cHMuY29tPg==","referencesHeader":"PGo2MDNyOSs0dWZ1QGVHcm91cHMuY29tPg=="},"prevInTopic":63205,"nextInTopic":63207,"prevInTime":63205,"nextInTime":63207,"topicId":63201,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1530248550\">&lt;&lt; I told her that she could choose to sit there and cry about not going or she could choose to brainstorm ways to make walking easier so that she<br/>\ncould go and get home without complaining, but it was her choice and crying about it wasn&#39;t going to change my mind.  &gt;&gt;<br/>\n<br/>\nBy  continually emphasizing that it&#39;s *her choice* it can come across like you&#39;re laying the blame for your frustration at her feet. She&#39;s knows<br/>\nyou&#39;re frustrated. It&#39;s also likely she would prefer not to be crying, not to be upset, but her behaviour is all she can come up with in the moment -<br/>\nshe&#39;s gotten to point where she doesn&#39;t see any other choices. Telling her she&#39;s choosing to be upset isn&#39;t giving her any useful information to move<br/>\nforward through the situation. It can help to look at things from her perspective. From there you may be able to suss out why she&#39;s thinking things<br/>\nlike &quot;We never get to walk anywhere&quot;.<br/>\n<br/>\nCold starts to conversations with younger kids are challenging. They don&#39;t have much experience to draw on or to make connections to that help start<br/>\noff brainstorming for solutions on their own. I&#39;ve had better success when I start the ball rolling (in a calm and relaxed moment later, not during<br/>\nthe frustration), something like &quot;I was thinking we could play XX on the bus ride home tomorrow to help it go faster.&quot; Or &quot;Shall we bring YY with us<br/>\nwhen we walk to gymnastics tomorrow?&quot; Or vice versa.<br/>\n<br/>\nStarting with your own suggestion shows her that you&#39;re thinking about it, about her. That you&#39;re making an effort to make things more pleasant for<br/>\nher knowing that she wants to go. It also gives her a starting place to think about the situation herself. She may say &quot;Oh, that&#39;ll be fun!&quot; and it<br/>\nwill be something to look forward to about the bus or walk. Or she may say &quot;No, I want to bring ZZ.&quot; Cool! Another idea. And don&#39;t hold her<br/>\n&quot;agreement&quot; over her head if it doesn&#39;t work out the next time. Try something else. And something else. In the bigger picture, with every step in the<br/>\nprocess you guys are figuring out ways to work things out together.<br/>\n<br/>\nPam<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] How could I haven handled this better?","postDate":"1317246738","msgId":63205,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYxNjdEQTJFLTE1RDUtNEJDMC05RkFDLTYyMEFFRDczM0VDRkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDEzMTcyNDYwNDUuNjMzNjEuWWFob29NYWlsTmVvQHdlYjgxNTAyLm1haWwubXVkLnlhaG9vLmNvbT4=","referencesHeader":"PGo2MDNyOSs0dWZ1QGVHcm91cHMuY29tPiA8MTMxNzI0NjA0NS42MzM2MS5ZYWhvb01haWxOZW9Ad2ViODE1MDIubWFpbC5tdWQueWFob28uY29tPg=="},"prevInTopic":63204,"nextInTopic":63206,"prevInTime":63204,"nextInTime":63206,"topicId":63201,"numMessagesInTopic":0,"msgSnippet":"-=-Why can t we take the bus?! Fine, if I can t take the bus, I m not going home! ) -=-As we walked home, I told her that taking the bus and walking home is","messageBody":"<div id=\"ygrps-yiv-1625266807\">-=-Why can&#39;t we take the bus?! Fine, if I can&#39;t take the bus, I&#39;m not going home!&quot;)<br/>\n<br/>\n-=-As we walked home, I told her that taking the bus and walking home is part of doing dance and gymnastics right now. -=-<br/>\n<br/>\nCould you explain it to us?  Why couldn&#39;t you take the bus back too?<br/>\n<br/>\nI like the stroller suggestion.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] How could I haven handled this better?","postDate":"1317246664","msgId":63204,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZGQjQ0RkYzLTNDQ0EtNEQxNi04QzlBLTlBQTQyQjk0RDdEREBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGo2MDNyOSs0dWZ1QGVHcm91cHMuY29tPg==","referencesHeader":"PGo2MDNyOSs0dWZ1QGVHcm91cHMuY29tPg=="},"prevInTopic":63203,"nextInTopic":63205,"prevInTime":63203,"nextInTime":63205,"topicId":63201,"numMessagesInTopic":0,"msgSnippet":"-=-Yesterday, we went to dance class and we needed to take the bus there and walk home-=- -=-...what do I do about gymnastics tomorrow? We have to take the bus","messageBody":"<div id=\"ygrps-yiv-433310495\">-=-Yesterday, we went to dance class and we needed to take the bus there and walk home-=-<br/>\n-=-...what do I do about gymnastics tomorrow? We have to take the bus there and walk home.-=-<br/>\n<br/>\nIt is way uphill on the way and downhill on the way back?<br/>\n<br/>\nIf it&#39;s level ground, why can&#39;t you walk to class and take the bus back (when you&#39;re tired and would like to get home more quickly)?<br/>\n<br/>\n-=- We have to -=-<br/>\n<br/>\nThe &quot;have to&quot; alarm went off.  <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/haveto\">http://sandradodd.com/haveto</a><br/>\n<br/>\n-=-she was complaining about taking the bus (&quot;I want to walk! We NEVER get to walk anywhere! I&#39;m not getting on the bus!&quot;) So I told her (calmly, matter of factly) that I was tired of listening to her complain every time we went somewhere-=-<br/>\n<br/>\nYou made it about you.  Sometimes that&#39;s fine, but you could have made a list of times you&#39;ve walked, just to clarify that &quot;never&quot; wasn&#39;t true.  <br/>\n<br/>\nJust because someone wants to eat doesn&#39;t means she ALWAYS wants to eat.  Just because I turn down food when I&#39;m full doesn&#39;t mean I never want food again.<br/>\n<br/>\nSometimes someone might want to walk, but that doesn&#39;t mean she never wants to sit down, or never wants to take the bus.  <br/>\n<br/>\nIt sounds like you&#39;re both dealing in extremes.<br/>\n<br/>\n-=- She was not interested in brainstorming, she just started saying over and over &quot;I want to go! I want to go!&quot; -=-<br/>\n<br/>\nDid you have snacks with you?  A drink?  Did you have a smile and a song?  A toy?<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] How could I haven handled this better?","postDate":"1317246426","msgId":63203,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTcyNDY0MjYuMjI0MzUuWWFob29NYWlsTmVvQHdlYjEyMjUxNi5tYWlsLm5lMS55YWhvby5jb20+","inReplyToHeader":"PGo2MDNyOSs0dWZ1QGVHcm91cHMuY29tPg==","referencesHeader":"PGo2MDNyOSs0dWZ1QGVHcm91cHMuY29tPg=="},"prevInTopic":63202,"nextInTopic":63204,"prevInTime":63202,"nextInTime":63204,"topicId":63201,"numMessagesInTopic":0,"msgSnippet":"***...what do I do about gymnastics tomorrow? We have to take the bus there and walk home. I don t like the way I handled it, but I don t know what else to do.","messageBody":"<div id=\"ygrps-yiv-425202909\">***...what do I do about gymnastics tomorrow? We have to take the bus there and walk home.<br/>\n<br/>\nI don&#39;t like the way I handled it, but I don&#39;t know what else to do. Any ideas for making the walk easier and how I can handle future situations better?***<br/>\n<br/>\n<br/>\nWhat about walking TO gymnastics and taking the bus home, rather than the other way around.  That makes sense given that the kids would me less tired on the way to somewhere than on the way home.  Can you take a stroller or wagon with you for tired kids?  Maybe dad can take the kid with the class, to class while you stay home and go on a pleasant, non rushed walk.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] How could I haven handled this better?","postDate":"1317246045","msgId":63202,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTcyNDYwNDUuNjMzNjEuWWFob29NYWlsTmVvQHdlYjgxNTAyLm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PGo2MDNyOSs0dWZ1QGVHcm91cHMuY29tPg==","referencesHeader":"PGo2MDNyOSs0dWZ1QGVHcm91cHMuY29tPg=="},"prevInTopic":63201,"nextInTopic":63203,"prevInTime":63201,"nextInTime":63203,"topicId":63201,"numMessagesInTopic":0,"msgSnippet":"can you use a stroller? I see that you have other little ones . What about a double stroller? Or call a cab once in a while?   Alex Polikowsky       ","messageBody":"<div id=\"ygrps-yiv-837695902\">can you use a stroller? I see that you have other little ones . What about a double stroller? Or call a cab once in a while?<br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n <br/>\n <br/>\n <br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: emstrength3 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:emstrength@...\">emstrength@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nSent: Wednesday, September 28, 2011 4:33 PM<br/>\nSubject: [AlwaysLearning] How could I haven handled this better?<br/>\n<br/>\n<br/>\n  <br/>\nRecently my 5 year old has been having a difficult time every time we go somewhere.  These are all places she wants to go, but she complains about having to walk or having to take the bus.  Yesterday, we went to dance class and we needed to take the bus there and walk home.  She complained about taking the bus there (&quot;I don&#39;t want to ride the bus! I want to walk!  We never get to go on walks!  Fine, if I can&#39;t walk there, I&#39;m not going!&quot;)  Once we got on the bus, she was fine until it was time to go home.  (&quot;I don&#39;t want to walk!  I&#39;m too tired, it&#39;s too hot, my legs hurt.  Why can&#39;t we take the bus?!  Fine, if I can&#39;t take the bus, I&#39;m not going home!&quot;)<br/>\n<br/>\nAs we walked home, I told her that taking the bus and walking home is part of doing dance and gymnastics right now.  I tried to brainstorm ideas to make walking easier for her, but the only thing I could come up with is that she could ride her bike once she learns how.  I already bring food, water, comfortable shoes, we sing songs (ants go marching and that kind of thing). <br/>\n<br/>\nToday, we took the bus to the library story time and back home.  While walking to the bus stop and waiting for the bus, she was complaining about taking the bus (&quot;I want to walk!  We NEVER get to walk anywhere!  I&#39;m not getting on the bus!&quot;)  So I told her (calmly, matter of factly) that I was tired of listening to her complain every time we went somewhere, and that tomorrow she can stay home with her dad while I take her sister to gymnastics, because I don&#39;t want to listen to it on the way home.  Then I realized that that was really like punishment, so I said that she could go to gymnastics if we could come up with some ideas to make walking easier for her.  She was not interested in brainstorming, she just started saying over and over &quot;I want to go!  I want to go!&quot; <br/>\n<br/>\nI told her that she could choose to sit there and cry about not going or she could choose to brainstorm ways to make walking easier so that she could go and get home without complaining, but it was her choice and crying about it wasn&#39;t going to change my mind. <br/>\n<br/>\nWe didn&#39;t talk about it again until we got home and she brought up my idea to ride her bike.  That will be fine at some point, but right now, it needs to be fixed and she doesn&#39;t know how to ride it.  So, we are going to work on that, but in the meantime, what do I do about gymnastics tomorrow?  We have to take the bus there and walk home.<br/>\n<br/>\nI don&#39;t like the way I handled it, but I don&#39;t know what else to do.  Any ideas for making the walk easier and how I can handle future situations better?<br/>\n<br/>\nEmily<br/>\n<br/>\n(Ezabella 5, Liliana 3, Zaria 9 mo)<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":457058835,"authorName":"emstrength3","from":"&quot;emstrength3&quot; &lt;emstrength@...&gt;","profile":"emstrength3","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"How could I haven handled this better?","postDate":"1317245609","msgId":63201,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo2MDNyOSs0dWZ1QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":63202,"prevInTime":63200,"nextInTime":63202,"topicId":63201,"numMessagesInTopic":0,"msgSnippet":"Recently my 5 year old has been having a difficult time every time we go somewhere.  These are all places she wants to go, but she complains about having to","messageBody":"<div id=\"ygrps-yiv-671762952\">Recently my 5 year old has been having a difficult time every time we go somewhere.  These are all places she wants to go, but she complains about having to walk or having to take the bus.  Yesterday, we went to dance class and we needed to take the bus there and walk home.  She complained about taking the bus there (&quot;I don&#39;t want to ride the bus! I want to walk!  We never get to go on walks!  Fine, if I can&#39;t walk there, I&#39;m not going!&quot;)  Once we got on the bus, she was fine until it was time to go home.  (&quot;I don&#39;t want to walk!  I&#39;m too tired, it&#39;s too hot, my legs hurt.  Why can&#39;t we take the bus?!  Fine, if I can&#39;t take the bus, I&#39;m not going home!&quot;)<br/>\n<br/>\nAs we walked home, I told her that taking the bus and walking home is part of doing dance and gymnastics right now.  I tried to brainstorm ideas to make walking easier for her, but the only thing I could come up with is that she could ride her bike once she learns how.  I already bring food, water, comfortable shoes, we sing songs (ants go marching and that kind of thing).  <br/>\n<br/>\nToday, we took the bus to the library story time and back home.  While walking to the bus stop and waiting for the bus, she was complaining about taking the bus (&quot;I want to walk!  We NEVER get to walk anywhere!  I&#39;m not getting on the bus!&quot;)  So I told her (calmly, matter of factly) that I was tired of listening to her complain every time we went somewhere, and that tomorrow she can stay home with her dad while I take her sister to gymnastics, because I don&#39;t want to listen to it on the way home.  Then I realized that that was really like punishment, so I said that she could go to gymnastics if we could come up with some ideas to make walking easier for her.  She was not interested in brainstorming, she just started saying over and over &quot;I want to go!  I want to go!&quot;  <br/>\n<br/>\nI told her that she could choose to sit there and cry about not going or she could choose to brainstorm ways to make walking easier so that she could go and get home without complaining, but it was her choice and crying about it wasn&#39;t going to change my mind.   <br/>\n<br/>\nWe didn&#39;t talk about it again until we got home and she brought up my idea to ride her bike.  That will be fine at some point, but right now, it needs to be fixed and she doesn&#39;t know how to ride it.  So, we are going to work on that, but in the meantime, what do I do about gymnastics tomorrow?  We have to take the bus there and walk home.<br/>\n<br/>\nI don&#39;t like the way I handled it, but I don&#39;t know what else to do.  Any ideas for making the walk easier and how I can handle future situations better?<br/>\n<br/>\nEmily<br/>\n<br/>\n(Ezabella 5, Liliana 3, Zaria 9 mo)</div>","specialLinks":[]}],"prevTopicId":63170,"nextTopicId":63309}}