{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":158112576,"authorName":"TeresaBnNC@aol.com","from":"TeresaBnNC@...","profile":"tbb1967","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] V.Long Rant about Jayn&#39;s friend was Attitudes in ...","postDate":"1062538029","msgId":79758,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMxLjNkNWNiMDU0LjJjODY2NTJkQGFvbC5jb20+"},"prevInTopic":79743,"nextInTopic":0,"prevInTime":79757,"nextInTime":79759,"topicId":79728,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/2/03 11:30:39 AM Eastern Daylight Time, genant2@aol.com ... I was just thinking when I read Robyn s  post about Jayn and how the other ","messageBody":"<div id=\"ygrps-yiv-741079841\">In a message dated 9/2/03 11:30:39 AM Eastern Daylight Time, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:genant2@...\">genant2@...</a> <br/>\nwrites:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; We don&#39;t go over much and this boy doesn&#39;t visit much but it was hard for <br/>\n&gt; me. <br/>\n&gt; I had to cry to Teresa about it and talk a while to get it out of my system. <br/>\n&gt; <br/>\n&gt; She had to explain that kids in public school are like this.  Friends one <br/>\n&gt; minute and not another and friends again the next day.  My boys are just not <br/>\n&gt; <br/>\n&gt; like that.  They are friends with everyone and will play with anyone. <br/>\n<br/>\n </span></blockquote>I was just thinking when I read Robyn&#39;s  post about Jayn and how the other <br/>\ngirl bullies her about how well my kids have gotten along with other <br/>\nhomeschoolers.  Most especially the unschoolers we know.   ( Which is just Pam and her <br/>\nboys and one other family with 3 kids)    It is so refreshing and really amazing <br/>\n( coming from a school environment) to see kids just all play and get along!  <br/>\n Hardly ever,  ( I&#39;m thinking if it has been ever?)  do the kids come up at <br/>\nplay day or any other hs activity and whine and cry about some other kid.  You <br/>\ndo not hear name calling or bullying.   All the kids pretty much share thier <br/>\nstuff or politely decline to share. ( not in a mean spirited, selfish way)   <br/>\nThe only time anybody has got hurt at play day was when JP accidentally hit a <br/>\nlittle girl in the mouth with a hockey stick.  He was swinging it around.   The <br/>\nlittle girl had a bloody mouth, and she was pretty traumatized, but everyone <br/>\nwas very understanding that he didnt mean to do it.  I thought.. dag, if he had <br/>\nbeen at school and an accident like that happened, they would probably have <br/>\ncalled me to come get him..  Hell, we would probably be involved in a law suit <br/>\nright now.. lol.   But the kids at play day do not hit or kick or yell at each <br/>\nother.  If there is any animosity or squabbles, it&#39;s usually between <br/>\nsiblings.   It&#39;s so cool.!   My kids do not have public school friends.    Our <br/>\nneighbors avoid us... maybe avoid is a strong word,.. we just don&#39;t cross paths.    <br/>\nThe only children that go to school that my friends play with are their <br/>\ncousins.   That is not too bad, cause when their cousins exhibit typical school yard <br/>\nbehavior, we can tell them what we think about it.. LOL.  And, really, none of <br/>\nthem are &quot;bad&quot;... Although, one cousin JP&#39;s age did strongarm him into <br/>\ntrading his best imaginext figures for some lameo lego men.  JP really didnt want to <br/>\ntrade... I was not with them when he traded, and JP was bummed when Levi went <br/>\nhome with his prized &quot;men&quot;   I told him that maybe we can ask Levi next time <br/>\nwe go to his house if we can trade back.  <br/>\n<br/>\nTeresa<br/>\n<br/>\n <br/>\n  <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":123374705,"authorName":"ejcrewe@aol.com","from":"ejcrewe@...","profile":"ejcrewe2002","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] V.Long Rant about Jayn&#39;s friend was Attitudes in ...","postDate":"1062526069","msgId":79743,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0MS4xODQyMGI1OS4yYzg2MzY3NUBhb2wuY29tPg=="},"prevInTopic":79729,"nextInTopic":79758,"prevInTime":79742,"nextInTime":79744,"topicId":79728,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/2/2003 4:26:06 AM Central Standard Time, ... Robyn, You ll probably get a bunch of suggestions on how to respond to the situation.  But I","messageBody":"<div id=\"ygrps-yiv-206696895\">In a message dated 9/2/2003 4:26:06 AM Central Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dezigna@...\">dezigna@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Most shameful of all, I am glad that this child is going<br/>\n&gt; to school. She will be away for hours every day, and then they will need<br/>\n&gt; their family time. I hope she makes a ton of other friends and drops<br/>\n&gt; Jayn like a hot potato.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Robyn,<br/>\n<br/>\nYou&#39;ll probably get a bunch of suggestions on how to respond to the <br/>\nsituation.  But I think you have done the right thing by your little girl.  We had the <br/>\nsame problem here with a little boy who had the same concept of &quot;sharing&quot; as <br/>\nJayn&#39;s friend.  My son would become all crazy and violent around him, they were <br/>\nconstantly at each other&#39;s throats.  First, I decided to have them play only <br/>\nwhen I was right with them, then I started limited their contact all together. <br/>\n The final straw for me was when my son asked me where hell was and why he <br/>\nwould want to go there!  I&#39;m still dealing with the &quot;you&#39;re not my friend <br/>\nanymore&quot; thing, but it&#39;s happening less and less.  <br/>\n<br/>\nEveryone has people that are toxic to them.  I think little kids do too.  <br/>\nSometimes adults have a hard time eliminating the toxic people in their lives, I <br/>\nthink it would be almost impossible for a not even four year old to do it.  My <br/>\nfive year old has been able to reduce his contact with an eight year old <br/>\nneighbor because he was teased incessantly and decided it wasn&#39;t worth it to be <br/>\nfriends with him.  We talked about it a lot, but he reached the decision on his <br/>\nown.  Just a few months ago, he couldn&#39;t have done that.<br/>\n<br/>\nI&#39;m so happy Jayn has you to help her navigate her social world.  Some <br/>\nparents (like someone&#39;s soccer coach recently) would make the kid stick it out to <br/>\ntoughen them up.<br/>\n<br/>\nElizabeth<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":78134331,"authorName":"genant2@aol.com","from":"genant2@...","profile":"genant04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] V.Long Rant about Jayn&#39;s friend was Attitudes in ...","postDate":"1062516886","msgId":79729,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0MC4xODNmOTg0OS4yYzg2MTI5NkBhb2wuY29tPg=="},"prevInTopic":79728,"nextInTopic":79743,"prevInTime":79728,"nextInTime":79730,"topicId":79728,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/2/03 5:26:06 AM Eastern Daylight Time, ... I know exactly what you mean.  My boys and this Schooled child are very similar.  What I","messageBody":"<div id=\"ygrps-yiv-1715130514\">In a message dated 9/2/03 5:26:06 AM Eastern Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dezigna@...\">dezigna@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; . I hope she makes a ton of other friends and drops<br/>\n&gt; Jayn like a hot potato.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I know exactly what you mean.  My boys and this Schooled child are very <br/>\nsimilar.  What I decided to do it this.  We only have the boys over when his <br/>\nparents can come as well.  So when my boys ask to see him I say &quot;lets make a <br/>\ncook-out out of it&quot; or something like that.  He seems to behave better if his parents <br/>\nare here.  Also we go and do things with lots of homeschooled children so <br/>\nthey are building new friendships.  This boy&#39;s Mom works for my husband so they <br/>\nhave been friends since they were small.  My boys have started to develop a <br/>\nfriendship with Teresa&#39;s son.  And they have started to ask if JP can come over <br/>\ninstead of this schooled child.  Etc.  It has worked for us and I am not taking <br/>\naway their friend.<br/>\n<br/>\nI call him the schooled child as he is the only friend they have that goes to <br/>\npublic school.  <br/>\nPam G<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":78134331,"authorName":"genant2@aol.com","from":"genant2@...","profile":"genant04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] V.Long Rant about Jayn&#39;s friend was Attitudes in ...","postDate":"1062516372","msgId":79728,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNjLjM0NTdjYWNkLjJjODYxMDk0QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":79729,"prevInTime":79727,"nextInTime":79729,"topicId":79728,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/2/03 5:26:06 AM Eastern Daylight Time, ... That is such a hurtful phrase.  We had something like this happen a while ago with a schooled","messageBody":"<div id=\"ygrps-yiv-436437558\">In a message dated 9/2/03 5:26:06 AM Eastern Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dezigna@...\">dezigna@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &quot;You&#39;re not my best friend and I don&#39;t<br/>\n&gt; love you&quot; to another dear friend, completely unprovoked. When I asked<br/>\n&gt; Jayn if it was true she told me &quot;no&quot;. She also could give no reason for<br/>\n&gt; saying it - I suspect she was trying to find out what would happen. <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>That is such a hurtful phrase.  We had something like this happen a while ago <br/>\nwith a schooled friend of my boys.  We were at his house and they were <br/>\nplaying not too far away.  My son started crying hysterically, which led to the <br/>\nschooled boy calling my son names and made it worse (another story).  But anyway <br/>\nhe said he was crying because he accidentally bumped the boy and the boy got <br/>\nmad and said &quot;your not my friend anymore.&quot;  Dallen was crushed to think that he <br/>\nhad lost a friend.  He apologized and asked what he could do to make it up to <br/>\nthe boy and he didn&#39;t budge &quot;no friendship.&quot;  I took Dallen off to talk and <br/>\nthe mother stepped in while we were away and demanded that the child apologize <br/>\nfor what he said and ordered him to be friends again. (Not what I had in mind.) <br/>\n Dallen got over it pretty quickly, although he was shaken by the events and <br/>\nwe had to talk about why the boy&#39;s Mom made him apologize and all this when we <br/>\ngot home.  They are friends again.  The other boy seems to have forgotten.  <br/>\n<br/>\nWe don&#39;t go over much and this boy doesn&#39;t visit much but it was hard for me. <br/>\n I had to cry to Teresa about it and talk a while to get it out of my system. <br/>\n She had to explain that kids in public school are like this.  Friends one <br/>\nminute and not another and friends again the next day.  My boys are just not <br/>\nlike that.  They are friends with everyone and will play with anyone.  I have <br/>\nnever heard them take away their friendship over something, they usually talk <br/>\nabout problems and try to compromise etc.  I am so proud of them but it hurts to <br/>\nsee them hurt.  I guess that is part of being a parent.<br/>\n<br/>\nAnyway, way too long for me.  <br/>\nPam G.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":79723,"nextTopicId":79761}}