{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":96795689,"authorName":"tuckervill@aol.com","from":"tuckervill@...","profile":"tuckervill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] fiddling","postDate":"1042396479","msgId":54531,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5NS4xM2M5NzM3Ny4yYjUzMGYzZkBhb2wuY29tPg=="},"prevInTopic":54359,"nextInTopic":0,"prevInTime":54530,"nextInTime":54532,"topicId":54358,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/11/2003 3:47:32 PM Central Standard Time, ... Ooh, I d LOVE to have a post like that about ukulele s!  But I m not holding my breath.  :) ","messageBody":"<div id=\"ygrps-yiv-1716864865\">In a message dated 1/11/2003 3:47:32 PM Central Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:abtleo@...\">abtleo@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Warning: Long and boring unless you really care about fiddle music!<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Ooh, I&#39;d LOVE to have a post like that about ukulele&#39;s!  But I&#39;m not holding <br/>\nmy breath.  :)<br/>\n<br/>\nTuck<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":39764976,"authorName":"Alan & Brenda Leonard","from":"Alan & Brenda Leonard &lt;abtleo@...&gt;","profile":"abtleo","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] fiddling","postDate":"1042321763","msgId":54358,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBNDY0RTZGLjFBRTklYWJ0bGVvQGVhcnRobGluay5uZXQ+","inReplyToHeader":"PDEwNDIzMTE1NjYuMTUzNS4xNzcyNC5tOUB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":54359,"prevInTime":54357,"nextInTime":54359,"topicId":54358,"numMessagesInTopic":0,"msgSnippet":"Warning: Long and boring unless you really care about fiddle music! I m not Sandra (and I won t apologize for it! ), but I do teach violin. Buy String","messageBody":"<div id=\"ygrps-yiv-321664297\">Warning: Long and boring unless you really care about fiddle music!<br/>\n<br/>\nI&#39;m not Sandra (and I won&#39;t apologize for it! &lt;g&gt;), but I do teach violin.<br/>\n<br/>\nBuy String Magazine; they show up on the rack at big bookstores, or you can<br/>\nprobably get a trial copy at www.stringsmagazine.com  They do lots of<br/>\narticles on fiddling and fiddlers, along with other string related stuff.<br/>\nPlus they&#39;re full of great ads for that sort of thing.  Strings also<br/>\npublishes a Buyer&#39;s Guide (which used to be much better named a Resource<br/>\nGuide) listing societies and violin shops by state and country.  You might<br/>\nbe able to acess that online, I&#39;m not sure.  Never tried, since mine lives<br/>\non my desk.<br/>\n<br/>\nCheck with the nearest violin shop or folk-music type shop.  These are not<br/>\nthe kind of places that sell mainly electric pianos and guitars.  Look<br/>\naround for a good one, because they can steer you in the direction of<br/>\nteachers and other great resources.  If you want to email me off list and<br/>\ntell me what state you&#39;re in and what towns are nearby, I&#39;ll look in my<br/>\nStrings Buyer&#39;s Guide and see what I can find.  You really ought to be<br/>\ndrowning in folks out there in the Blue Ridge Mountains!<br/>\n<br/>\nSome of the books I use for fiddling are:<br/>\n<br/>\nKidfiddle: 46 Easy Folk Songs for Fiddle with Chordal Accomp. (Mel Bay<br/>\nProductions) -- very easy, which makes them a good play-through book to have<br/>\naround.<br/>\n<br/>\nFiddlers Philharmonic Encore!: Traditional Fiddling in the String Orchestra<br/>\n(Alfred) -- designed for school use, but fine for 1 person.  Includes the<br/>\nsolo line and then a 3 part version (tune, break, backup) for playing with<br/>\nother people.  nice for playing with your teacher or a couple friends.<br/>\n<br/>\nThe Scottish Folks Fiddle 3rd Position book (Taigh na teud: Harpstring House<br/>\nPublishing, distributed by Music Sales Corporation) -- this one is really<br/>\nnice, but not so easy to find; it&#39;s published on Isle of Skye, Scotland.<br/>\n<br/>\nAnthology of Fiddle Styles (Mel Bay) -- comprehensive, my personal favorite.<br/>\nEven the cruddy music stores at the mall stock Mel Bay stuff, so it&#39;s easy<br/>\nto find.<br/>\n<br/>\nThe Renaissance Fiddler&#39;s Tune Book: A collection of 21 olde tunes composed<br/>\nbetween the years 1100 and 1650 (homepublished by Deborah Greenblatt,<br/>\navailable from her or through Shar) -- not in your son&#39;s &quot;area&quot;, but a nice<br/>\ncollection.  Some are more Celtic, and all are easy enough to play.<br/>\n<br/>\nI get most of my music from Shar Products -- 1-800-248-SHAR, I think, or<br/>\nlook for their website.  They have piles of fiddle music, neatly sorted by<br/>\nstyle, and most include enough description that you&#39;ll be able to figure out<br/>\nwhether it would be too hard or easy.<br/>\n<br/>\nI do get red flags in my mind about you son not wanting to play (NOT<br/>\npractice! ugh!) his fiddle between lessons.  Even if he really likes his<br/>\ncurrent teacher (which may or may not be true -- ask pointed questions),<br/>\nthree teachers in 2 years can be tough.  Ask him if his new teacher is<br/>\nasking him to change his position/posture/bow grip, etc.  Everyone plays a<br/>\nlittle differently, but having to change a bunch of times to please<br/>\ndifferent people is a surefire way to make students hate playing.  If that&#39;s<br/>\nthe case, you might talk with the teacher and ask her if she could lay off<br/>\nthat stuff for a bit and work on &quot;developing his repertoire&quot; (as in,<br/>\nlearning more music so he has more stuff he can just play through and have<br/>\nfun).  <br/>\n<br/>\nIf he still wants to go to lessons and is asking you why it feels like a<br/>\nchore, I&#39;m betting he hasn&#39;t changed his mind, but needs something different<br/>\nthan what he&#39;s getting.  At 10, and 2 years playing, he may not be old<br/>\nenough to know what that is, or even articulate the problem very well.<br/>\n<br/>\nHe has heard of Mark O&#39;Conner, right?  He&#39;s the biggest name in fiddling I<br/>\ncan come up with right now (it&#39;s getting late here in Germany and my brain<br/>\nis fading).  Good stuff to listen to, that man can PLAY!<br/>\n<br/>\nLet me know if I can help you in any other way.<br/>\n<br/>\nbrenda<br/>\n<br/>\n<br/>\n1/11/03 19:59:<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; Dillon (10) aspires to be a Celtic/bluegrass fiddler.  He has been taking<br/>\n&gt; &quot;violin&quot; lessons for about 2 years and doing pretty good.  We&#39;ve changed<br/>\n&gt; teachers twice(the first time our choice, then that teacher stopped teaching<br/>\n&gt; so the school assigned us a new teacher).  He never complains about going to<br/>\n&gt; his lesson, but he never touches his fiddle outside of class anymore.<br/>\n&gt; <br/>\n&gt; Here&#39;s the question.  Can you give me more info about the type of things Holly<br/>\n&gt; practices?  What book is she using, what CD&#39;s are her &quot;required&quot; listening.<br/>\n&gt; Dillon is never asked to listen to anything, but his teacher is Asian and<br/>\n&gt; frankly doesn&#39;t know anything about roots music.  She is very good with Dillon<br/>\n&gt; and is more than willing to teach his music that we bring to her.  Luckily his<br/>\n&gt; dad loves roots music and Dillon listens daily to all sorts of fiddlers and<br/>\n&gt; other musicians. <br/>\n&gt; <br/>\n&gt; I  just talked to Dillon about his lessons the other day.  He says that he<br/>\n&gt; wants to keep going to lessons although he feels that practicing is too much<br/>\n&gt; like a chore (I remind him rather than force him).  I&#39;ve tried to find a<br/>\n&gt; fiddler to teach him with no luck (although we live in the Blue Ridge Mtns).<br/>\n&gt; Dad takes him to shows and introduces him to the musicians (Dad is a taper and<br/>\n&gt; knows lots of them that way).  Dillon even asks me why I think fiddling feels<br/>\n&gt; like a chore.  I&#39;ve asked him what he thinks, I&#39;ve offered ideas and<br/>\n&gt; reinforced that learning to fiddle is his choice and I will do what I can to<br/>\n&gt; make it work for him.  But that if he has tired of it or changed his mind it&#39;s<br/>\n&gt; okay to stop.  <br/>\n&gt; <br/>\n&gt; Any other ideas? </span></blockquote></div>","specialLinks":[]},{"userId":39764976,"authorName":"Alan & Brenda Leonard","from":"Alan & Brenda Leonard &lt;abtleo@...&gt;","profile":"abtleo","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] fiddling","postDate":"1042321763","msgId":54359,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBNDY0RjYxLjFBRTklYWJ0bGVvQGVhcnRobGluay5uZXQ+","inReplyToHeader":"PDEwNDIzMTE1NjYuMTUzNS4xNzcyNC5tOUB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":54358,"nextInTopic":54531,"prevInTime":54358,"nextInTime":54360,"topicId":54358,"numMessagesInTopic":0,"msgSnippet":"... A is easiest, D is next easiest. brenda","messageBody":"<div id=\"ygrps-yiv-617846086\">1/11/03 19:59:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Her teacher uses another kind of very easy to read notation that shows string<br/>\n&gt; and finger.  So far since they&#39;re doing everythign in whatever key you get<br/>\n&gt; naturally on a violin (G?  F?  something not C), it&#39;s simple to read.    I<br/>\n&gt; even read some yesterday.<br/>\n<br/>\n </span></blockquote>A is easiest, D is next easiest.<br/>\n<br/>\nbrenda</div>","specialLinks":[]}],"prevTopicId":54320,"nextTopicId":54231}}