{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":321996436,"authorName":"Alex","from":"&quot;Alex&quot; &lt;missalexmissalex@...&gt;","profile":"missalexmissalex","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Healing my relationship with my oldest child","postDate":"1337317771","msgId":67207,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpwNGxpYitkcjljQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpvdmxwaytkNjFtQGVHcm91cHMuY29tPg=="},"prevInTopic":67194,"nextInTopic":0,"prevInTime":67206,"nextInTime":67208,"topicId":67176,"numMessagesInTopic":0,"msgSnippet":"I don t have a teenager yet, and I m hesistant to post as I just rejoined the group, though I was on it previously for years. My point of reference is that I","messageBody":"<div id=\"ygrps-yiv-377849623\">I don&#39;t have a teenager yet, and I&#39;m hesistant to post as I just rejoined the group, though I was on it previously for years. My point of reference is that I have been wrestling with having built an in-law unit to help my mother-in-law get back on her feet, only to have her put all her energy into her 28yo son, who she had move in with her. He was diagnosed with severe ADHD as a child and often has no idea what I told him, to the point where I cannot let him babysit, though he is amazingly sweet with my child. While not physically threatening, he also does not deal well with conflict. I spent years trying to work around him when he was not able to deal with reasonable requests without freaking out, because that was the family policy, that he just flooded so you should never upset him.  <br/>\n<br/>\nWhat I hear you saying in part reminds me of how my MIL approaches my BIL. Wanting to maintain the relationship, help him through hard times, understanding he may be a late bloomer, &quot;just being a mom&quot; etc...it&#39;s sweet, she&#39;s sweet, and he&#39;s sweet too, but it hasn&#39;t worked, for years, and it sounds like what you&#39;re doing hasn&#39;t worked either. My BIL&#39;s 28, and he&#39;s floundered in work and school for 10 years. He&#39;s never lived away from his mom, except from 6 months of his marriage that failed to a great degree because he expected his wife to do everything and not be negative in any way, like his mom. When they were breaking up he swallowed a bottle of pills. And then there&#39;s the massive debt. <br/>\n<br/>\nI like them a lot, since I had the courage to start treating him like I expected him to be a responsible, respectful adult who contributed equally to the household. It provoked a bit of a shit storm, but we got through it. <br/>\n<br/>\nThis all of course did a number on me with my own extensive family history of anxiety and I couldn&#39;t take the meds that had helped me because I was trying to conceive. <br/>\n<br/>\nSo I started reading a lot about brain chemistry, trying to figure out what supplements I could take, things I could do, etc. And recommend to my BIL too! I really, really encourage you to check out Dr. Daniel Amen&#39;s books. The fact that your dad was similar makes me think that your son may very well have inherited a brain imbalance, an area of higher or lower activity that makes it hard for him to avoid rages. A minor-seeming head injury, like a fall off a skateboard, the kind of thing that is likely at 12, can influence future brain activity too. <br/>\n<br/>\nI don&#39;t have a great answer for what you should do based on that, other than to consider how you would think of the situation if there was a good chance that there was a physical problem involved, a problem that will continue to hurt his family and other relationships, as well as work/school/independent living ability, unless he gets professional help of some kind. I&#39;m lucky that my BIL chose on his own to go to therapy, and has persisted. <br/>\n<br/>\nI think we are all lucky that my MIL is living in my house so that my husband and I could eventually draw up a contract and ask him if he would like to stay under those conditions. He does yard work. He helps make family dinners. He forfeits a little money into the fixer house fund if he doesn&#39;t come hang out without hostility or reminders for at least 30 minutes one weekday evening a week, has to double his visit the next week too if he misses it, and if that fails he moves out. If we have a responsibility to him because he is a family member, then he has a responsibilty to us to an active and respectful member of our family. Also, if he screams obscenities in front of my daughter again he has 30 days to get out. Plus, he pays me money every month that I put into a envelope for when he moves out. This is crucial because it keeps me from feeling trapped by his financial decisions. We also set a date when he moves out, far into the future, but firm. And you know what? Our relationship has never been better. He feels good about himself. We do emphasize that we want to him be marriagable and sucessful in future group living situations. It may be that in your family, anger management or therapy attendance needs to be mandatory to live with you. It sounds like that would be great for all of you. <br/>\n<br/>\nI get the feeling, that in the moment you are so consumed with fear--and partially love--that you are just unable to set limits, and stick to them. So the advice here can only help you so much, and the same goes for reading anything else. I mean, you&#39;ve pretty much said so. You are so scarred from your dad&#39;s abuse that you are letting your younger child be subjected to abuse as well. Please, please seek in person therapy. (I promise this is the last post for a long time where I suggest therapy!)  The difference between that and this is making a commitment to an actual person to do something that is good for yourself, and going back to unpack how doing or not doing that thing worked. Regardless of whether your older son lives with you much longer, you will need new skills to do relationship healing. Your son is already angry at you, and you&#39;re bending over backwards to be sweet. He might as well switch to being angry with you for taking steps that are likely to help you all. It would really help you to clarify the ways in which you can help him while still supporting him in independence and not putting yourself or your son in an unhealthy situation.<br/>\n<br/>\nHope that helps-<br/>\nAlex<br/>\nmama to Katya</div>","specialLinks":[]},{"userId":359707411,"authorName":"dezignarob","from":"&quot;dezignarob&quot; &lt;dezignarob@...&gt;","profile":"dezignarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Healing my relationship with my oldest child","postDate":"1337198960","msgId":67194,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpwMTFoZytoM3ZyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpvdmxwaytkNjFtQGVHcm91cHMuY29tPg=="},"prevInTopic":67186,"nextInTopic":67207,"prevInTime":67193,"nextInTime":67195,"topicId":67176,"numMessagesInTopic":0,"msgSnippet":"=== Even so, now that his brother has returned, he is contemptuous and unkind to him. He calls him a momma s boy, a pussy, says he s lazy, that he stinks,","messageBody":"<div id=\"ygrps-yiv-557073659\">=== Even so, now that his brother has returned, he is contemptuous and unkind to him. He calls him a momma&#39;s boy, a pussy, says he&#39;s lazy, that he stinks, implies he is stupid (in ways easily understood by the younger one), and criticizes his weight. He hurls vicious insults with very little provocation. Fuck you is not uncommon. I have learned over the years how to redirect him or de-escalate this sort of thing (not eliminate it, alas), but the awful truth is that I am afraid of my older son&#39;s cruel outbursts. If I tell him unequivocally to stop, he turns very nasty very quickly. To make matters worse, his brother plays it up and actually acts like spoiled brat just to piss him off, although not in an aggressive way -- in a very passive, cat-like way. I have discussed this with the 13yo. It&#39;s not cool with me at all, but I don&#39;t think it&#39;s the root of the problem. Many times, my oldest attacks while the youngest is totally engaged in a movie or a game and not interacting with him at all. He also criticizes him frequently behind his back to me and to everyone in my family. I think the youngest&#39;s passive-aggression is his only weapon.====<br/>\n<br/>\nThere is something here that is buried.<br/>\n<br/>\n==  I have learned over the years ===<br/>\n<br/>\nOver the years.<br/>\n<br/>\nI&#39;m sorry that your oldest son is being hateful. It sounds like he has always been aggressive. He is your child, but he is not a child. Sounds like he is acting like a child, perhaps falling into old patterns.<br/>\n<br/>\nI think you may be done apologizing. It sets you up as in the wrong, and he may be playing on your guilt.<br/>\n<br/>\n== If I tell him unequivocally to stop, he turns very nasty very quickly. ===<br/>\n<br/>\nYou also have a right to be safe in your own home. I&#39;m not sure that I would welcome him back. I missed whether there was Dad at home. Perhaps another respected man could have a talk with him about restraint. <br/>\n<br/>\nI wonder if he has found his true calling. If college did not work out, it may be that he wasn&#39;t in the right program. He may be struggling to know what he really wants to do. I don&#39;t suppose he has considered the military? <br/>\n<br/>\nDo not leave them alone together.<br/>\n<br/>\nRobyn L. Coburn<br/>\nwww.iggyjingles.blogspot.com<br/>\nwww.allthingsdoll.blogspot.com<br/>\nwww.robyncoburn.blogspot.com</div>","specialLinks":[]},{"userId":504505579,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Healing my relationship with my oldest child","postDate":"1337190418","msgId":67186,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBT09UYVhPNlpoYWJfcGlnVTVYTjdIcmNnSzNNYkhnWnZBWl9jZ1BqcTVIQkQtOU9XUUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGpvdmxwaytkNjFtQGVHcm91cHMuY29tPg==","referencesHeader":"PGpvdmxwaytkNjFtQGVHcm91cHMuY29tPg=="},"prevInTopic":67178,"nextInTopic":67194,"prevInTime":67185,"nextInTime":67187,"topicId":67176,"numMessagesInTopic":0,"msgSnippet":"I don t think you seem to know where your mistake was made.... When he said the stuff about it being the other kids mess and you should make him clean it, you","messageBody":"<div id=\"ygrps-yiv-2026629950\">I don&#39;t think you seem to know where your mistake was made....<br/>\n<br/>\nWhen he said the stuff about it being the other kids&#39; mess and you should<br/>\nmake him clean it, you told him HE had no obligation to clean it. That was<br/>\nso NOT the issue, right? Your son was saying that you should make the one<br/>\nwho made the mess clean it and you said &quot;YOU don&#39;t have to clean it.&quot;<br/>\nNonresponsive - dismissive of his point.<br/>\n<br/>\nYou ignored his point. And then he said he would be &quot;the good son&quot; and do<br/>\nit and you told him not to -- poor guy, he was trying to be a good son.<br/>\nEven though he said it sarcastically and with an angry edge, listen to what<br/>\nhe actually said - he wants to be a good son!!! You wouldn&#39;t let him. He<br/>\ngot furious because he felt he can&#39;t do anything right and you so clearly<br/>\nlove his brother more than him, and he&#39;s just a big loser, etc. (Saying the<br/>\nthings probably in his head, not that &quot;I&quot; think them - that he does.)<br/>\n<br/>\nThat could have been a nice moment - you could have responded with, &quot;I do<br/>\nso much appreciate it because I AM tired, but I&#39;d enjoy doing it together<br/>\nwith you.&quot;<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Wed, May 16, 2012 at 12:42 AM, PamelaC &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:p_corkey@...\">p_corkey@...</a>&gt; wrote:<br/>\n<br/>\n&gt; Tonight I made a very foolish mistake. I went into the kitchen and found a<br/>\n&gt; mess and asked the boys if they could help me out (I was fully prepared to<br/>\n&gt; accept a &quot;no&quot; with grace. That I&#39;ve got down cold). The oldest said, &quot;Why<br/>\n&gt; should I? It&#39;s all his mess (meaning the little one, who&#39;d made lasagna.<br/>\n&gt; Messily.). You should make him clean it.&quot; I told him he had no obligation<br/>\n&gt; to help at all, that it was no big deal and I&#39;d do it, but he argued that I<br/>\n&gt; was surely tired after work and he would be the good son and clean it. I<br/>\n&gt; said no thanks but he insisted, this time with an edge.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Healing my relationship with my oldest child","postDate":"1337174932","msgId":67178,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM1Nzc3QjhELTRFQTUtNDlCNy1CQUVGLTE3NzlFMjNGRUJGM0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGpvdmxwaytkNjFtQGVHcm91cHMuY29tPg==","referencesHeader":"PGpvdmxwaytkNjFtQGVHcm91cHMuY29tPg=="},"prevInTopic":67176,"nextInTopic":67186,"prevInTime":67177,"nextInTime":67179,"topicId":67176,"numMessagesInTopic":0,"msgSnippet":"-=-My eldest is home for a few weeks between leaving college and starting a summer job in another city this June. Things have been tense.-=- He s probably full","messageBody":"<div id=\"ygrps-yiv-604457582\">-=-My eldest is home for a few weeks between leaving college and starting a summer job in another city this June. Things have been tense.-=-<br/>\n<br/>\nHe&#39;s probably full of frustration about whatever all led to his dropping out, and frustrated and embarrassed.  Keith suggested you might want to read some of the many articles out and about now about &quot;boomerang kids,&quot; even though he&#39;s only there temporarily.<br/>\n<br/>\n-=- I know he is especially raw and feeling lost after dropping out. He is lonely. He is scared. He may be depressed.<br/>\n<br/>\n-=-Even so, now that his brother has returned, he is contemptuous and unkind to him. He calls him a momma&#39;s boy, a pussy, says he&#39;s lazy, that he stinks,-=-<br/>\n<br/>\nI would not let a single thing like that go by without saying &quot;Stop.  He has a right to feel safe in his own home.&quot;<br/>\n<br/>\nIf you wouldn&#39;t let a stranger do it, you shouldn&#39;t let your son do it.  <br/>\n<br/>\nYou have an obligation to maintain the peace in your house, and that obligation is stronger, I think, than your obligation to give either of your kids space and freedom to hurt the other one, or you.  Or to frighten you.  Or to abuse you.  He doesn&#39;t have that right.<br/>\n<br/>\nI have said to my kids (who have never said things that awful to each other) that if they&#39;re not going to be nice, they can&#39;t stay here.  Maybe you could tell him that he can stay ONLY IF he can be in the civil-to-kind range, and if not, to go on to the other town early.  And if he wants to yell about it or rage, you could say &quot;Stop.&quot;  And it could be be &quot;Stop or I&#39;ll call the police&quot; if he really scares you.<br/>\n<br/>\nCould he maybe stay with your parents for these two weeks?<br/>\n<br/>\nAlso, if unschooling isn&#39;t working for you, it&#39;s not.  If you need to tell both of them what to do (help with the kitchen, not make such a mess when cooking), then do it.   Sanity and safety are important, and you&#39;re needing to deal with the end of the semester at the college where you work, right?  If your younger son isn&#39;t safe at the house with you gone, that&#39;s a serious consideration.  <br/>\n<br/>\nMaybe there are other relatives than your parents you could call on for help for just a week or two.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":254240390,"authorName":"PamelaC","from":"&quot;PamelaC&quot; &lt;p_corkey@...&gt;","profile":"p_corkey","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Healing my relationship with my oldest child","postDate":"1337154164","msgId":67176,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpvdmxwaytkNjFtQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":67178,"prevInTime":67175,"nextInTime":67177,"topicId":67176,"numMessagesInTopic":0,"msgSnippet":"Dear All, I am seeking clarity and perspective as well as ideas and advice. I have two sons, one 13 and unschooled for the past 2 years, and one 21, who has","messageBody":"<div id=\"ygrps-yiv-330030242\">Dear All,<br/>\n<br/>\nI am seeking clarity and perspective as well as ideas and advice. I have two sons, one 13 and unschooled for the past 2 years, and one 21, who has had an erratic school experience (public, private, Sudbury Valley, private again, expulsions, time off, and just a few weeks ago dropped out of college for the second time).<br/>\n<br/>\nMy eldest is home for a few weeks between leaving college and starting a summer job in another city this June. Things have been tense. I can see that he is jealous of the compassion, support, and peace that his little brother is enjoying. He thinks I am being overly permissive and that his brother is spoiled. I have taken his feelings seriously and apologized deeply for not giving him the same things, for being punitive and rigid when he was his brother&#39;s age. I have taken him to unschooling conferences and discussed my new approach as much as he seemed to want. I have also tried to surround him with love and attention and support during these past few years.<br/>\n<br/>\nI have tried ardently to fill my son&#39;s cup -- I brought his little brother to stay with my parents for the first week he was home from college so that I could give him more time with me one-on-one. I know he is especially raw and feeling lost after dropping out. He is lonely. He is scared. He may be depressed.<br/>\n<br/>\nEven so, now that his brother has returned, he is contemptuous and unkind to him. He calls him a momma&#39;s boy, a pussy, says he&#39;s lazy, that he stinks, implies he is stupid (in ways easily understood by the younger one), and criticizes his weight. He hurls vicious insults with very little provocation. Fuck you is not uncommon. I have learned over the years how to redirect him or de-escalate this sort of thing (not eliminate it, alas), but the awful truth is that I am afraid of my older son&#39;s cruel outbursts. If I tell him unequivocally to stop, he turns very nasty very quickly. To make matters worse, his brother plays it up and actually acts like spoiled brat just to piss him off, although not in an aggressive way -- in a very passive, cat-like way. I have discussed this with the 13yo. It&#39;s not cool with me at all, but I don&#39;t think it&#39;s the root of the problem. Many times, my oldest attacks while the youngest is totally engaged in a movie or a game and not interacting with him at all. He also criticizes him frequently behind his back to me and to everyone in my family. I think the youngest&#39;s passive-aggression is his only weapon.<br/>\n<br/>\nTonight I made a very foolish mistake. I went into the kitchen and found a mess and asked the boys if they could help me out (I was fully prepared to accept a &quot;no&quot; with grace. That I&#39;ve got down cold). The oldest said, &quot;Why should I? It&#39;s all his mess (meaning the little one, who&#39;d made lasagna. Messily.). You should make him clean it.&quot; I told him he had no obligation to help at all, that it was no big deal and I&#39;d do it, but he argued that I was surely tired after work and he would be the good son and clean it. I said no thanks but he insisted, this time with an edge. I could feel the tension mounting and knew it was not a good situation. I tried again to take over cleaning the kitchen but he took the sponge and blocked the door, insisting a second time. I went into the living room and enlisted the younger child in helping me pick up out there, largely as a show to my oldest, but it was too late. I brought a dish into the kitchen and asked him a question about his day and he said, through gritted teeth, not to dare speak to him. Then he went into his room and slammed the door. Now I was scared. This was common behavior during his teens. My next mistake: I called to him that I wished he wouldn&#39;t shut down and would talk to me. He burst back out of the room, punched the refrigerator next to my head and screamed in my face, close with spit flying, that his little brother shuts down all the time and I never pressure him at all. Every other word was &quot;fuck&quot;. Veins on the forehead. He&#39;s 6&#39; 1&quot;. I was terrified and my heart was racing.<br/>\n<br/>\nNow, I wish I could have a redo. I would not ask for help with the dishes, not because it&#39;s unreasonable to do so, but because of our specific situation. I should have known it was a landmine. I also should not have called after him. I should have given him his space to calm down. What I said was not helpful in that moment, to say the least. <br/>\n<br/>\nBut here is the crux of it: I am scared of him. His emotional abuse terrifies me. My father was emotionally abusive and I just want to get away from it. Rage, threatening body language, personal attacks. I also hate for my 13 year old to experience it. It feels like this sort of meltdown is seconds away at all times if either one of us makes the wrong move. When my oldest is not around, things are peaceful in the house. Even my relationship with him seems good via phone calls and short visits.<br/>\n<br/>\nAfter the summer, my oldest son will not have a job or a place to live. He expects to move in with us. I want so badly for the three of us to be able to live together, to heal our family and feel safe and happy, but it seems untenable -- I&#39;m not calm or wise enough with regards to him or he&#39;s too angry at me or I want to prioritize a peaceful home for my younger son. Maybe all or none of the above? I think I may have to work on healing my relationship with him without having him at home. Or should I challenge myself to be stronger than this? Am I succumbing to selfishness and my own childhood wounds? Do I owe it to him, to all of us, to nut up and figure this stuff out? If so, how?<br/>\n<br/>\nBeyond or beside all of this, he seems to be in crisis -- lost and alienated from the world. He left school because of his &quot;shitty friends&quot; and not caring about any of his studies.  I am seriously worried about him. I want to hold him and surround him with love, but he&#39;s so angry and threatening to me. It has been this way since he was 12. <br/>\n<br/>\nIs it up to him to sort himself out now, being as he is a young adult?<br/>\n<br/>\nAs is plain, I am having trouble figuring this out. Right now I just want him away from me. Is that reason or fear? Is that a &quot;no duh?&quot; sort of response to aggression, or egregious selfishness? Or something else entirely? Something to push past toward something better and stronger?<br/>\n<br/>\nOn this list are some of the wisest, most clear-headed and loving people I know. I&#39;d really appreciate your thoughts. <br/>\n<br/>\nPamela</div>","specialLinks":[]}],"prevTopicId":67165,"nextTopicId":67160}}