{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Alternatives to taking sides","postDate":"1300999375","msgId":60415,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ5ODMwMy4xNTkwMS5xbUB3ZWIxMTA0MTMubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PEFBTkxrVGlrSzBhd29MOEZMaWh5X3ZLbWVkckxrU3FYZEtEMlpnY25Sd213a0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEFBTkxrVGlrSzBhd29MOEZMaWh5X3ZLbWVkckxrU3FYZEtEMlpnY25Sd213a0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":60409,"nextInTopic":0,"prevInTime":60414,"nextInTime":60416,"topicId":60392,"numMessagesInTopic":0,"msgSnippet":"***The kids said they really don t want to go back and started crying. Andri says it s my fault for giving them these ideas that school is a bad place...*** My","messageBody":"<div id=\"ygrps-yiv-238418964\">***The kids said they really don&#39;t<br/>\nwant to go back and started crying. Andri says it&#39;s my fault for giving them<br/>\nthese ideas that school is a bad place...***<br/>\n<br/>\nMy oldest daughter never got the impression that school was a bad place.  She <br/>\nwatched shows like Arthur, which highly emphasizes how cool and fun school is. <br/>\n She was never in school.  She never really questioned why she didn&#39;t go to <br/>\nschool.  The things we did instead were fun and interesting.  My younger <br/>\ndaughter is a bit terrified of the whole idea of school.  She&#39;s never been <br/>\neither, but in her own thinking and understanding, it&#39;s not something she would <br/>\nenjoy at all.  This is mostly based on the fact that she would be going with the <br/>\nneighbor kids, all of whom she finds mean and unsavory, and the thought of <br/>\nhaving to spend all day with them sounds like a terrible idea to her.<br/>\n<br/>\nBoth of your kids have been to school.  You and your husband have both been in <br/>\nschool.  Right at this moment, you each of your own understanding of what school <br/>\nis like and what you like or dislike about it.  My husband liked school, he went <br/>\nto school in a small town where everyone knew everyone else.  I was bored in <br/>\nschool and never really liked it, the bigness and noise.  I went to large <br/>\nsuburban schools where nobody really knew each other.<br/>\n<br/>\nThere have been times that my husband defended school where I didn&#39;t.  He did a <br/>\nlot of questioning about my choice to not send our kids to school.  Probably the <br/>\nbiggest thing that impacted his thinking about school and my choice to unschool, <br/>\nwould be the neighborhood children.  The way they played, the pecking order, the <br/>\nbossy play, the playground style taunting, the bullying, all of that, he saw and <br/>\nrecognized it for what it was and where it came from.<br/>\n<br/>\n***I litteraly feel dismembered between them... How can I shift my thinking?***<br/>\n<br/>\nIf you have 4 people, all with differing ideas and wants and needs, it might <br/>\nhelp to step back a bit to see how and where they each connect and fit.  The <br/>\ngoal is to find a peaceable solution.  What your husband wants is to see that <br/>\nhis kids are going to grow up and turn into fine young adults who are thriving. <br/>\n It&#39;s a noble goal, one that he shares with lots of parents.  One of the worst <br/>\nparents I know wants that too.  What we DO as parents, all the little things, <br/>\nrespecting our kids and valuing what they value, is what makes all the <br/>\ndifference.  Schools have little impact on that.  I know kids in school who <br/>\nthrive there and a large part of why they do, is because their parents, even <br/>\nwith school in the mix, respect and value their kids.  I know kids in school who <br/>\ndon&#39;t thrive there, and by and large, those are the kids whose parents don&#39;t <br/>\nrespect and value their kids.<br/>\n<br/>\nIn my experience, schools play a very small part in that.  It&#39;s the parents and <br/>\ntheir attitudes that play a bigger part.  <br/>\n<br/>\nCan the conversation shift away from school and more towards parenting goals? <br/>\n That will make more of a difference with or without school in the mix.  Keep <br/>\nschool as an option of many.  It IS an option. It is there and waiting.<br/>\n<br/>\nJust like having 2 kids with different needs in the moment, work towards a goal. <br/>\n If the goal is for each person to feel a bit of peace and happiness, what you <br/>\ndo will be different than if your goal is to get one person what they want and <br/>\nthen the next person.   You come away feeling pulled and pushed around moving <br/>\nfrom one person&#39;s want to the next, never really satisfying either kid happily. <br/>\n It&#39;s not that they can&#39;t take turns getting what they want, but in the moment <br/>\nwhen each wants something seemingly opposite of each other, they both want peace <br/>\nand happiness.  They both would assuredly like to feel happy about their <br/>\ndecision, their choice, their want or need.   <br/>\n<br/>\nWork together.  Think about &quot;we&quot; the team.  The team WANTS to get along and have <br/>\nfun playing.  It might be a bit of a shift in thinking for a while, you might <br/>\nhit a snag here or there.  You may have an upset kid or husband.  If you keep at <br/>\nit, peaceable happy goal oriented team work will prevail.<br/>\n<br/>\n <br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Alternatives to taking sides","postDate":"1300983920","msgId":60409,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg2NzQwMS4xNTEzMi5xbUB3ZWI4MTUwNy5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PEE4MUIxN0VDLUIwRDQtNEEzNy04MzVCLUVDMjE1ODUwNTNFN0B2ZXJpem9uLm5ldD4=","referencesHeader":"PEFBTkxrVGlrSzBhd29MOEZMaWh5X3ZLbWVkckxrU3FYZEtEMlpnY25Sd213a0BtYWlsLmdtYWlsLmNvbT4gPEE4MUIxN0VDLUIwRDQtNEEzNy04MzVCLUVDMjE1ODUwNTNFN0B2ZXJpem9uLm5ldD4="},"prevInTopic":60400,"nextInTopic":60415,"prevInTime":60408,"nextInTime":60410,"topicId":60392,"numMessagesInTopic":0,"msgSnippet":"My sister just put her 9 and 7 year old back in school because of her husband. From he begining he was worried and wanted to see the kids doing something . I","messageBody":"<div id=\"ygrps-yiv-1723731826\">My sister just put her 9 and 7 year old back in school because of her husband. <br/>\nFrom he begining <br/>\n<br/>\nhe was worried and wanted to see the kids &quot;doing something&quot;. <br/>\nI told my sister so many times how she could  writee down everyday what the boys <br/>\nwere doing. If they were reading in a game then they worked on reading, things <br/>\nlike that. I sent her link, she read here for a while.<br/>\nShe said she was going to work with the kids but never did.<br/>\nShe never did anything. So finally her husband  and her were fighting so much <br/>\nabout it that she agreed and put the kids back in school last week.<br/>\n There was a local Conference last year with a great speaker, unschooling <br/>\nfriendly and all. They did not go.<br/>\nShe did not make an effort, she righ away said it was a bad day to go.<br/>\nI offer to keep the kids and all.<br/>\n  Her husband&#39;s worries were not taken seriously. So for the sake of their <br/>\nmarriage she agreed to put the kids back in school. <br/>\n<br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Alternatives to taking sides","postDate":"1300972814","msgId":60400,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU1QzkwRDlGLTE4RTYtNDc4NS1CRENDLTY4QkU5MjIzOUJDQUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEFBTkxrVGlrSzBhd29MOEZMaWh5X3ZLbWVkckxrU3FYZEtEMlpnY25Sd213a0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEFBTkxrVGlrSzBhd29MOEZMaWh5X3ZLbWVkckxrU3FYZEtEMlpnY25Sd213a0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":60398,"nextInTopic":60409,"prevInTime":60399,"nextInTime":60401,"topicId":60392,"numMessagesInTopic":0,"msgSnippet":"-=-I really need help in this... it s showing up everywhere in my life... Andri (my husband) wants the kids back in school... I told him I would not force him","messageBody":"<div id=\"ygrps-yiv-1153703108\">-=-I really need help in this... it&#39;s showing up everywhere in my life... Andri<br/>\n(my husband) wants the kids back in school... I told him I would not force<br/>\nhim into unschooling against his will... he said he wants the kids back in<br/>\nschool in september.-=-<br/>\n<br/>\nIt&#39;s not common nor fully acceptable in France, at all.  I think for now you should go with your husband&#39;s preference.   It&#39;s true of any couple (and even more true with shared-custody divorces) that it&#39;s not up to just one person.  The two need to agree.  And at first, the agreement might need to come from you agreeing to school.<br/>\n<br/>\nIf school is as bad as you think, let that show itself without your narration.  Let your husband see it, but don&#39;t try to make it more obvious than it is.  If you set up an antagonistic situation with your husband, one of you will lose.  Both of you will lose.  The children will lose.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/divorce\">http://sandradodd.com/divorce</a><br/>\n<br/>\n-=-The kids said they really don&#39;t want to go back and started crying. Andri says it&#39;s my fault for giving them<br/>\nthese ideas that school is a bad place...-=-<br/>\n<br/>\nHe might be right, in part.<br/>\nI never recommend that parents vilify school.   There are many reasons children might end up in school, and if they&#39;ve been told school is the devil then that in itself will be more frightening than the school would be.   Some kids love school.  For some kids, school is more peaceful and stimulating than home.   If parents are fighting and unhappy with each other, school might be better.<br/>\n<br/>\nThe way to make your homelife more appealing is to be at peace with your husband.  It seems wrong and odd, but whether they&#39;re in school or not, parents who love each other are more important to their longterm lives than whether they&#39;re in school or not when they&#39;re seven.<br/>\n<br/>\n-=- He is in 1st grade and not the least interrested in learning to read. He found it too hard and started to say things like &quot;I can&#39;t do it,-=-<br/>\n<br/>\nLearning to read doesn&#39;t come from an interest in learning to read. It probably was too hard.  He probably couldn&#39;t do it.  That doesn&#39;t mean leaving school is the answer.   You could say &quot;You&#39;ll get it someday; don&#39;t worry,&quot; and do sweet, fun things with him to distract him from his fear.<br/>\n<br/>\n-=-Avana (my 5 year old daughter) was bored to death in preschool. She wants to<br/>\nread and write but it&#39;s not on the program yet... She said &quot;school is way<br/>\ntoo easy, it&#39;s boring and I don&#39;t have time for anything else&quot;...<br/>\n-=-<br/>\n<br/>\n&quot;Bored to death&quot; is an overstatement.  Overstatements harm thinking.<br/>\nif she wants to read and write but it&#39;s not on the program yet, help her read and write at home.  She might not be ready for it.<br/>\n<br/>\nYou might make suggestions to her about how to amuse herself in a boring situation.<br/>\n<br/>\n-=-I litteraly feel dismembered between them... How can I shift my thinking?-=-<br/>\n<br/>\nBy not thinking of it in terms of death and dismemberment.<br/>\n<br/>\n-=-I regularly feel torn between<br/>\nmy kid&#39;s conflictings wants. Like Jolan wants to go home and Avana wants to<br/>\nstay where we are... or vice versa. Or they both scream and fight because<br/>\nthey want exclusive time with me, now...<br/>\n<br/>\n-=-There has to be something there I am not seeing... help...-=-<br/>\n<br/>\nThey will get older quickly.  Go for peace and smiles and laughter, rather than for home education right now.  Find happy ways to describe going to school.  Find joyful things to do when you pick them up.  Find gratitude and not doom.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":336246301,"authorName":"NCMama","from":"&quot;NCMama&quot; &lt;dharmamama1@...&gt;","profile":"carenkh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Alternatives to taking sides","postDate":"1300969528","msgId":60398,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGltZmQ3bytpZDFyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEE4MUIxN0VDLUIwRDQtNEEzNy04MzVCLUVDMjE1ODUwNTNFN0B2ZXJpem9uLm5ldD4="},"prevInTopic":60397,"nextInTopic":60400,"prevInTime":60397,"nextInTime":60399,"topicId":60392,"numMessagesInTopic":0,"msgSnippet":"===If you search the archives here it should pop right up.=== This may have been mentioned here (hey! I could do a search!) but the search function on yahoo","messageBody":"<div id=\"ygrps-yiv-1081434844\">===If you search the archives here it should pop right up.===<br/>\n<br/>\nThis may have been mentioned here (hey! I could do a search!) but the search function on yahoo groups didn&#39;t work for quite a long time - over a year! A search would return results up to a certain date, and none beyond that, or it would return no results, even if the subject was in the archives.<br/>\n<br/>\nSearch works now! I can&#39;t remember when it started working; but if you&#39;ve searched unsuccessfully in the past, a search will probably be successful now.<br/>\n<br/>\nI did a search for &quot;blogging&quot;, and got these thorough (including recent!) results:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/AlwaysLearning/msearch?query=blogging&submit=Search&charset=UTF-8\">http://groups.yahoo.com/group/AlwaysLearning/msearch?query=blogging&submit=Search&charset=UTF-8</a><br/>\n<br/>\nCaren</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Alternatives to taking sides","postDate":"1300966061","msgId":60397,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE4MUIxN0VDLUIwRDQtNEEzNy04MzVCLUVDMjE1ODUwNTNFN0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PEFBTkxrVGlrSzBhd29MOEZMaWh5X3ZLbWVkckxrU3FYZEtEMlpnY25Sd213a0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEFBTkxrVGlrSzBhd29MOEZMaWh5X3ZLbWVkckxrU3FYZEtEMlpnY25Sd213a0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":60395,"nextInTopic":60398,"prevInTime":60396,"nextInTime":60398,"topicId":60392,"numMessagesInTopic":0,"msgSnippet":"... Well, school is his *solution* to what s bothering him. It s not the only solution. What are his worries and fears? What are his two biggest fears? Ask him","messageBody":"<div id=\"ygrps-yiv-286389475\">On Mar 24, 2011, at 3:55 AM, Claire Darbaud wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Andri<br/>\n&gt; (my husband) wants the kids back in school...<br/>\n<br/>\n&gt;  I know he is doing his best and he wants the best for his kids...<br/>\n&gt; he&#39;s afraid if we let them free they will not learn anything and  <br/>\n&gt; they will<br/>\n&gt; blame him for turning into loosers...<br/>\n<br/>\n </span></blockquote>Well, school is his *solution* to what&#39;s bothering him. It&#39;s not the  <br/>\nonly solution.<br/>\n<br/>\nWhat are his worries and fears? What are his two biggest fears? Ask  <br/>\nhim :-) Write them down and take them seriously.<br/>\n<br/>\nWhat can help him feel more comfortable day to day with unschooling?  <br/>\nWhat *little* things would feel like learning to him?<br/>\n<br/>\nIt&#39;s possible he&#39;s been worried for a long time and it&#39;s built up into  <br/>\nthis big mass of confusion of worry which has exploded into his  <br/>\nsolution (school) to put a stop to this massive worry that feels like  <br/>\nhe has no control over. It would help you to break the worry down into  <br/>\ntackleable pieces.<br/>\n<br/>\nWhat about a blog so he can feel more a part of the process and see  <br/>\nwhat&#39;s going on while he&#39;s away. There was a thread here recently  <br/>\nabout blogging. If you search the archives here it should pop right up.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":67727291,"authorName":"wtexans","from":"&quot;wtexans&quot; &lt;wtexans@...&gt;","profile":"wtexans","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Alternatives to taking sides","postDate":"1300960964","msgId":60395,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGltZjRzNCtoaWRmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFBTkxrVGlrSzBhd29MOEZMaWh5X3ZLbWVkckxrU3FYZEtEMlpnY25Sd213a0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":60392,"nextInTopic":60397,"prevInTime":60394,"nextInTime":60396,"topicId":60392,"numMessagesInTopic":0,"msgSnippet":"===he said he wants the kids back in school in september. I feel lost and down. The kids said they really don t want to go back and started crying=== I have","messageBody":"<div id=\"ygrps-yiv-1709835105\">===he said he wants the kids back in school in september. I feel lost and down. The kids said they really don&#39;t want to go back and started crying===<br/>\n<br/>\nI have two suggestions:<br/>\n<br/>\n(1) If at all possible, find a way for your family, or at least you and your husband, to get to an unschooling conference or gathering. Preferably where he can be around experienced, unschooling dads.<br/>\n<br/>\n(2) Perhaps your husband would be willing for you all to homeschool using a curriculum -- either one you put together yourself, or a prepackaged one. Find out which areas of concern he has and target those areas.<br/>\n<br/>\nIf he&#39;s agreeable to homeschooling with a curriculum, be sure to find ways to keep him in the loop on what&#39;s going on while he&#39;s at work / away from home. Keep a blog or put pictures on Flickr and/or stick them on your fridge. Have an area in your house where it&#39;s okay for the kids to leave stuff out they&#39;ve been building or painting or otherwise messing around with, so their dad can see some of the things they&#39;ve been doing. <br/>\n<br/>\nIf reading is a concern, letter magnets on the fridge might be fun, and they&#39;re visible to everyone. If math is a concern, there are all sorts of fun ways to play around with math -- various &quot;Junior&quot; board games (Monopoly Jr., Sorry Jr., etc.), set up a play store and use toy money or made-up money (their dad can be a shopper!), and so forth.<br/>\n<br/>\nGlenda</div>","specialLinks":[]},{"userId":261223738,"authorName":"Claire Darbaud","from":"Claire Darbaud &lt;cdarbaud@...&gt;","profile":"cdarbaud","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Alternatives to taking sides","postDate":"1300953358","msgId":60392,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGlrSzBhd29MOEZMaWh5X3ZLbWVkckxrU3FYZEtEMlpnY25Sd213a0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":60395,"prevInTime":60391,"nextInTime":60393,"topicId":60392,"numMessagesInTopic":0,"msgSnippet":"2011/3/22 plaidpanties666  in post: Newbie questions ... I really need help in this... it s showing up everywhere in my life...","messageBody":"<div id=\"ygrps-yiv-502388854\">2011/3/22 plaidpanties666 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:plaidpanties666@...\">plaidpanties666@...</a>&gt; in post: &quot;Newbie<br/>\nquestions&quot;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; -=- It can help to look for alternatives that aren&#39;t about &quot;sides&quot; but<br/>\n&gt; about helping people get what they need. -=-<br/>\n<br/>\n<br/>\n </span></blockquote>I really need help in this... it&#39;s showing up everywhere in my life... Andri<br/>\n(my husband) wants the kids back in school... I told him I would not force<br/>\nhim into unschooling against his will... he said he wants the kids back in<br/>\nschool in september. I feel lost and down. The kids said they really don&#39;t<br/>\nwant to go back and started crying. Andri says it&#39;s my fault for giving them<br/>\nthese ideas that school is a bad place...<br/>\n<br/>\nI can tell learning about unschooling is the same thing as any learning. If<br/>\nI push, if I try to force him, it will only cause him to resist more and<br/>\nmore... I know he is doing his best and he wants the best for his kids...<br/>\nhe&#39;s afraid if we let them free they will not learn anything and they will<br/>\nblame him for turning into loosers...<br/>\n<br/>\nJolan (my 7 year old son) was unhappy at school. He is in 1st grade and not<br/>\nthe least interrested in learning to read. He found it too hard and started<br/>\nto say things like &quot;I can&#39;t do it, I&#39;m not a good reader like the others&quot;<br/>\nand other things like that :-( I so don&#39;t want to force him to go back...<br/>\nAvana (my 5 year old daughter) was bored to death in preschool. She wants to<br/>\nread and write but it&#39;s not on the program yet... She said &quot;school is way<br/>\ntoo easy, it&#39;s boring and I don&#39;t have time for anything else&quot;...<br/>\n<br/>\nI litteraly feel dismembered between them... How can I shift my thinking?<br/>\n<br/>\nAnd I can tell this is happening very often. I regularly feel torn between<br/>\nmy kid&#39;s conflictings wants. Like Jolan wants to go home and Avana wants to<br/>\nstay where we are... or vice versa. Or they both scream and fight because<br/>\nthey want exclusive time with me, now...<br/>\n<br/>\nThere has to be something there I am not seeing... help...<br/>\n<br/>\nClaire<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":60370,"nextTopicId":60367}}