{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":224898497,"authorName":"unschoolarama","from":"&quot;unschoolarama&quot; &lt;mrust6@...&gt;","profile":"unschoolarama","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: introvert and extrovert","postDate":"1191461528","msgId":30960,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZlMWZxbyttNjMwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEUxMUEzQ0I4NTEwQzREMjU5QUY0RUVCMTZFMTNERTZGQEFtaWVQQz4="},"prevInTopic":30921,"nextInTopic":0,"prevInTime":30959,"nextInTime":30961,"topicId":30908,"numMessagesInTopic":0,"msgSnippet":"We are big WoW players here too. The best idea I can come up with is offer to print out some pages about how to maximize the armor, talent build, pets, skills","messageBody":"<div id=\"ygrps-yiv-1130884196\">We are big WoW players here too. <br/>\n<br/>\nThe best idea I can come up with is offer to print out some pages <br/>\nabout how to maximize the armor, talent build, pets, skills or <br/>\nbattleground play related to his calss for him to read while you are <br/>\nout. <br/>\n<br/>\nWe sometimes &quot;study&quot; WoW in this way. <br/>\n<br/>\nIt can be about an unfamiliar class or one that is a main character, <br/>\nbut it adds a little WoW to anywhere you are &lt;lol&gt;.<br/>\n<br/>\nIt&#39;s sort of like how my dd brings a book or ipod to appointments so <br/>\nshe won&#39;t be bored waiting.</div>","specialLinks":[]},{"userId":62434209,"authorName":"jenstarc4","from":"&quot;jenstarc4&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: introvert and extrovert","postDate":"1191264149","msgId":30921,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZkcmYybCtxdjdqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEUxMUEzQ0I4NTEwQzREMjU5QUY0RUVCMTZFMTNERTZGQEFtaWVQQz4="},"prevInTopic":30908,"nextInTopic":30960,"prevInTime":30920,"nextInTime":30922,"topicId":30908,"numMessagesInTopic":0,"msgSnippet":"... having one child that is an introvert, and one that is an extrovert? What ages are your kids?  Could the one that wants to stay at home do that?  It also","messageBody":"<div id=\"ygrps-yiv-708054221\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Amie&quot; &lt;amiersa2@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Can anyone share ideas on what has worked in their homes as far as <br/>\n </span></blockquote>having one child that is an introvert, and one that is an extrovert? <br/>\n<br/>\nWhat ages are your kids?  Could the one that wants to stay at home do <br/>\nthat?  It also depends on what your laws say about the ages kids <br/>\ncould stay at home by themselves too.  <br/>\n<br/>\nI have a younger child that often doesn&#39;t want to go, but she really <br/>\nis too young to stay at home by herself.  Generally we find a way to <br/>\naccomodate her by finding ways for her to enjoy herself while we are <br/>\nout.  Right now, my older daughter&#39;s needs are more pressing.  There <br/>\nhave been times when my younger daughter&#39;s needs to stay home were <br/>\nmore pressing than the need for the older one to go out and do <br/>\nthings.  <br/>\n<br/>\nIt&#39;s something that we talk about together and try to find solutions <br/>\ntogether.  I would truly love to have some nice kids for my younger <br/>\ndaughter to hang out with here and there so that my older daughter <br/>\nand I could go and do things together, but so far haven&#39;t found that.<br/>\n<br/>\nSome folks have been able to make those kind of arrangments or child <br/>\nswaps to accomodate varying kids and their needs.  Sometimes, it&#39;s <br/>\nnice to be able to drop a kid off somewhere to do something fun and <br/>\ngive the other one undivided attention, or the other way around.<br/>\n<br/>\nWe know a family that does dates with their kids.  Each weekend the <br/>\nmom and dad trade off kids to have a date for a couple of hours with <br/>\nthe one kid at a time doing something with just them.  We kind of do <br/>\nthat here.  I&#39;ve had to press for it with my husband.  He didn&#39;t <br/>\nnecessarily recognize that my older daughter NEEDED my undivided <br/>\nattention outside of the house.  I try to do that on the weekends or <br/>\nevenings and do my trade off during the weekday with my younger child <br/>\nbecause my older child can stay at home by herself.<br/>\n<br/>\nI have a time alloted today for my younger daughter to go and do <br/>\nsomething with her while sister stays at home.  It was part of the <br/>\ndeal I made with her yesterday to let me go and do something with her <br/>\nolder sister without being upset about it.  She was cool about it <br/>\nbecause I promised her today.<br/>\n<br/>\nThe key is to make good on the promise, or it won&#39;t ever happen again <br/>\nwhere she is cool about it.</div>","specialLinks":[]},{"userId":133126509,"authorName":"Amie","from":"&quot;Amie&quot; &lt;amiersa2@...&gt;","profile":"mascire2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"introvert and extrovert","postDate":"1191123385","msgId":30908,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEUxMUEzQ0I4NTEwQzREMjU5QUY0RUVCMTZFMTNERTZGQEFtaWVQQz4="},"prevInTopic":0,"nextInTopic":30921,"prevInTime":30907,"nextInTime":30909,"topicId":30908,"numMessagesInTopic":0,"msgSnippet":"Can anyone share ideas on what has worked in their homes as far as having one child that is an introvert, and one that is an extrovert? We try to do some","messageBody":"<div id=\"ygrps-yiv-2007384865\">Can anyone share ideas on what has worked in their homes as far as having one child that is an introvert, and one that is an extrovert? We try to do some things in the evening that Sam (extrovert) wants to do, but sometimes that isn&#39;t possible. I hate labels, but it seems like this is what we are dealing with right now. Eric would be pretty happy never leaving, except to play outside. He hates going places. Although, alot of times he says he hates going, but then ends up having more fun than Sam. Maybe there is more to this question than I realize. Eric is very into WOW right now, so that is part of what is making our situation somewhat hard. He would like to play all day, and sometimes all night. I really don&#39;t have a problem with that. It is just difficult because Sam is getting frustrated and angry because he likes to go places during the day and Eric refuses alot of the time. They end up arguing, and sometimes we don&#39;t come up with a solution that they are both happy with. Many times dh or I will agree to stay home with Eric (in the evening or on weekends) because he won&#39;t go anywhere. Most of the time it works out, but there are many times when I start feeling resentful, because I would have liked to go. We do get a &quot;babysitter&quot; to come over sometimes, but sometimes he refuses that too. So, any ideas, or experiences to share? I need some other ways to look at this. <br/>\n<br/>\nThanks,<br/>\nAmie<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":30945,"nextTopicId":30962}}