{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Linda Dobson","from":"Linda Dobson &lt;ldobson@...)","replyTo":"LIST","senderId":"WXyjdOIYgsjmjcqzX5_-w3gSSK_9VXB_gh-ySMKB-qOHqheXxa1ue73CO76L13euR7Nql3GYVSbmCtK_zdSr2DPWkEyf6pDjd0PUxWkorXViyPj5Hq7GuTgd4eTEtnlqior3jrtsol_-Rpg3sSTvrz8Sh_Phub9HyOGyvw","spamInfo":{"isSpam":false,"reason":"0"},"subject":"FWD from AHA-Watchdogs: Just In","postDate":"928637058","msgId":593,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy41Ni41OTMuOTU5MjY5NzM5QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":592,"nextInTime":594,"topicId":593,"numMessagesInTopic":0,"msgSnippet":"From: Linda Dobson  FYI.  Preliminary comments are not mine - but could have been... Linda ... Got an opinion? ","messageBody":"<div id=\"ygrps-yiv-1390783146\">From: Linda Dobson &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ldobson@...\">ldobson@...</a>&gt;<br/>\n<br/>\nFYI.  Preliminary comments are not mine - but could have been...<br/>\n<br/>\nLinda<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;-----------------------<br/>\n&gt;Thought you all might be interested in checking out an editorial by Jeff<br/>\n&gt;Berry in the recent Creative Loafing (you can find it at their website:<br/>\n&gt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.clnetwork.net/\">http://www.clnetwork.net/</a>  - scroll down the page to &quot;Columns&quot; then click<br/>\n&gt;on Jeff Berry).<br/>\n&gt;<br/>\n&gt;If you have high blood pressure, take care!  Mr. Berry feels<br/>\n&gt;homeschooling should not be legal - and his view of homeschoolers is<br/>\n&gt;unfortunately as limited and uninformed as that of many of our<br/>\n&gt;legislators.  We need better - and more accurate publicity!<br/>\n&gt;<br/>\n&gt;A suggestion to anyone interested in responding to Jeff Berry: flaming<br/>\n&gt;him back will not accomplish much - educating him might.  As with any<br/>\n&gt;lobbying attempts or letters to legislators, thoughtful, polite and<br/>\n&gt;reasonable communications accomplish far more in the long run.  Now take<br/>\n&gt;a deep breath, calm yourself - and check out the article.<br/>\n&gt;Miranda (Paymer)<br/>\n&gt;-----------------------<br/>\n&gt;<br/>\n&gt;Stop home schooling<br/>\n&gt;By Jeff Berry<br/>\n&gt;Special class: Ignorance & paranoia 101<br/>\n&gt;<br/>\n&gt;   Many of you may not know that in addition to being a fabulously<br/>\n&gt;talented writer, I am also a lawyer, brain surgeon and architect.<br/>\n&gt;   I did not go to college to obtain my lofty degrees. I didn&#39;t have to.<br/>\n&gt;Using the logic of a burgeoning conservative movement in this country, I<br/>\n&gt;home-schooled myself in these disciplines and awarded myself the<br/>\n&gt;diplomas. I was an excellent student, with a perfect 4.0 grade-point<br/>\n&gt;average. I graduated at the top of my class.<br/>\n&gt;   And by schooling myself at home instead of at some pointy-headed<br/>\n&gt;&quot;university, &quot; I was kept safe from the twin evils of liberal elitism and<br/>\n&gt;godless secular humanism.<br/>\n&gt;   Throughout America, it has become rather fashionable among the<br/>\n&gt;conservative kook set to withhold children from public and private<br/>\n&gt;educational institutions in order to &quot;school&quot; them at home. To hear them<br/>\n&gt;tell it, they have all had great success with their youngsters, who are<br/>\n&gt;insulated in a loving home far away from gangs, violence and people of<br/>\n&gt;other races.<br/>\n&gt;  \tYes indeed, conservative stay-at-home moms with high school educations<br/>\n&gt;all over the nation are instructing their children in such advanced<br/>\n&gt;academic pursuits as laundry folding, soap-opera watching and house<br/>\n&gt;cleaning -- the skills every child needs to succeed.<br/>\n&gt;  \tOh sure, Mom occasionally refers the kids to some printed material<br/>\n&gt;written by a TV evangelist that is supposed to serve as the child&#39;s<br/>\n&gt;home-school &quot;curriculum,&quot; but that&#39;s usually only a momentary distraction<br/>\n&gt;from the day&#39;s home-school schedule. The core of their academic day --<br/>\n&gt;consisting mainly of shopping, telephone calls, and television -- is<br/>\n&gt;rarely interrupted with an attempt at actual &quot;instruction.&quot;<br/>\n&gt;  \tThese parents believe that every school is a hopeless drug-infested<br/>\n&gt;wasteland. In their minds, they are simply exercising the essence of<br/>\n&gt;freedom -- which is to &quot;school&quot; their children at home, far from the<br/>\n&gt;corrupting influences of teachers with college &quot;degrees&quot; and people whose<br/>\n&gt;religion, race or political ideology may be different from their own.<br/>\n&gt;   But to my mind, they are guilty of aggravated child abuse.<br/>\n&gt;  \tRemoving a child from school is to reject the very basis of human<br/>\n&gt;intelligence in an enlightened society. It prevents children from<br/>\n&gt;acquiring passable social skills, it deprives them of the opportunity to<br/>\n&gt;forge lasting personal relationships, and it causes ignorance and<br/>\n&gt;outright stupidity on a grand scale. Home schooling creates an atmosphere<br/>\n&gt;of insular paranoia that breeds intolerance and suspicion of people who<br/>\n&gt;are different.<br/>\n&gt;  \tBut hey, if our culture is willing to allow children to obtain a high<br/>\n&gt;school equivalency certificate even though they have never set foot in a<br/>\n&gt;schoolhouse, why can&#39;t I home-school myself in the advanced sciences,<br/>\n&gt;such as medicine or law? What liberal tyrant would deprive me of that<br/>\n&gt;God-given right?<br/>\n&gt;  \tConservatives often use 1950s America as an example of the cultural<br/>\n&gt;morality to which all Americans should adhere. But in the 1950s, refusing<br/>\n&gt;to send your child to school would have gotten a parent tossed in jail,<br/>\n&gt;and the child charged with truancy.<br/>\n&gt;  \tAn Internet search on the subject of home schooling clearly reveals<br/>\n&gt;that the  phenomenon is being perpetuated by a host of societal misfits,<br/>\n&gt;fringe political activists and fundamentalist religious zealots. Such<br/>\n&gt;people are extremely hostile to any assault upon what they believe to be<br/>\n&gt;their Constitutional right to deprive their children of an education. As<br/>\n&gt;one home &quot;schooling&quot; parent asked me, &quot;Why are you so concerned about how<br/>\n&gt;other people elect to educate their kids, Mr. Berry?&quot;<br/>\n&gt;\t  &quot;It&#39;s Doctor Berry,&quot; I replied. &quot;And home schooling is nothing but<br/>\n&gt;parentally sanctioned truancy. It should be outlawed.&quot;<br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>------------------------------------------------------------------------<br/>\nGot an opinion?<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.onelist.com\">http://www.onelist.com</a><br/>\nMake it count!  Sign up for the ONElist Weekly Survey now.</div>","specialLinks":[]}],"prevTopicId":583,"nextTopicId":584}}