{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1123183,"authorName":"dacunefare@aol.com","from":"dacunefare@...","profile":"undermom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Reading desire WAS bob books","postDate":"1032284198","msgId":44279,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEwOC4xODE0ZDJjOS4yYWI4YzIyNkBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":44278,"nextInTime":44280,"topicId":44279,"numMessagesInTopic":0,"msgSnippet":"**My kids didn t want to READ, they wanted to read specific things.** Perhaps most kids do. But not all. 3 out of 4 of my kids were as you describe here,","messageBody":"<div id=\"ygrps-yiv-128608642\">**My kids didn&#39;t want to &quot;READ,&quot; they wanted to read specific things.**<br/>\n<br/>\nPerhaps most kids do. But not all. 3 out of 4 of my kids were as you describe <br/>\nhere, learning to read at various ages because they found it a useful skill, <br/>\nbecause there were things they wanted to read. <br/>\n<br/>\nThe 4th though, the one whose learning to read I&#39;ve previously described <br/>\nhere, wanted to &quot;READ&quot;. She didn&#39;t have anything in particular in mind, no <br/>\nparticular book she wanted to read or information she wanted to have - she <br/>\nknew how to get those by utilizing adult readers. She desparately wanted to <br/>\nread for herself. I&#39;d have been content for her to wait much longer and be a <br/>\n&quot;late&quot; reader, but she wasn&#39;t. It wouldn&#39;t have been respectful of me to say <br/>\nto her &quot;sorry, you&#39;ll just have to wait&quot; without trying to support her <br/>\nlearning when that was what she wanted. To my mind, that&#39;s as important a <br/>\nfunction of an unschooling parent as sheilding them from the expectations of <br/>\noutsiders.<br/>\n<br/>\nMaybe it&#39;s comparable to learning to ride a bike. Some kids want to ride <br/>\nbecause they have somewhere they want to go. Some want to ride because it <br/>\nlooks like fun. And some want to ride because they see it as a grown up skill.<br/>\n<br/>\nOften kids look at grown up skill stuff and they play at it. They play act <br/>\ngoing to work, taking care of children, driving the car. They do the shopping <br/>\nand run the train and man the phone lines and generally mess around with <br/>\ntrying on the world for size.<br/>\n<br/>\nSarah wanted the grown up skill. She didn&#39;t want to wait to grow into it, and <br/>\neven while she played at having it and using it she tried desparately to get <br/>\nit, to own it, to claim it for herself. She wasn&#39;t going to wait to get <br/>\nolder, especially not while her twin was barrelling along reading everything <br/>\nhe laid his eyes on, seemingly effortlessly from her point of view. It really <br/>\nwasn&#39;t FAIR! :)<br/>\n<br/>\nShe asked for help. I did my best.<br/>\n<br/>\n**Perhaps I see Bob Books as little walking-chair-substitutes made just for <br/>\nthat purpose and no other. A special color, a special size, to stash around <br/>\nthe room so kids can walk.  And it seems families can just use chairs they <br/>\nalready have.**<br/>\n<br/>\nFor most kids, most times, special walking chair substitutes aren&#39;t necessary <br/>\nat all, and while they might come in handy for a short time, they&#39;d mostly be <br/>\na waste of space and money. But some kids DO need extra help, and for them <br/>\nthose substitutes might be the difference between a painful struggle toward <br/>\nsuccess and an agonizing failure.<br/>\n<br/>\nSarah saw the BOB books at the public library and asked for her own. So we <br/>\nbought them. The fact that they&#39;re absolutely positively simple, uncluttered, <br/>\nnot about much of anything was just what she wanted. She could concentrate on <br/>\njust trying to match sounds to letter code. Real books were frustrating for <br/>\nthat purpose - she would want to understand the story/information and lose <br/>\nfocus.<br/>\n<br/>\nShe didn&#39;t learn to read with the BOB books, but they helped her feel she was <br/>\nreading when it was important to her to feel that.<br/>\n<br/>\nShe&#39;d have been labeled and remediated and turned into a nonreader in <br/>\nschools, but here we just supported her as best we could and gave her lessons <br/>\nwhen she asked, held her when she was frustrated, and tried to give her <br/>\n&quot;child size tools&quot; when they seemed indicated.<br/>\n<br/>\nNone of which is to say that I&#39;d generally &quot;recommend&quot; BOB widely, but I <br/>\ncertainly tell folks that they might want to look at them if they&#39;ve got a <br/>\nfrustrated reader.<br/>\n<br/>\nDeborah in IL</div>","specialLinks":[]}],"prevTopicId":22611,"nextTopicId":44284}}