{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":12,"messages":[{"userId":92084939,"authorName":"Heidi &lt;bunsofaluminum60@hotmail.com&gt;","from":"&quot;Heidi &lt;bunsofaluminum60@...&gt;&quot; &lt;bunsofaluminum60@...&gt;","profile":"heidic40","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"finding our way (was what did you do today)","postDate":"1044719580","msgId":58284,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGIyMzk0cyt2aDF0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEyZi4yMjZhYTFkNC4yYjc0NmZlM0Bhb2wuY29tPg=="},"prevInTopic":58255,"nextInTopic":0,"prevInTime":58283,"nextInTime":58285,"topicId":58106,"numMessagesInTopic":0,"msgSnippet":"... him ... Well, he measured and cut out all of the smaller planets, except Mercury. He wanted Mercury to be brown, and we didn t have any brown construction","messageBody":"<div id=\"ygrps-yiv-1134586708\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a>, SandraDodd@a... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; In a message dated 2/6/03 6:47:11 PM, bunsofaluminum60@h... writes:<br/>\n&gt; <br/>\n&gt; &lt;&lt; Robby wanted to know if <br/>\n&gt; <br/>\n&gt; Pluto was really smaller than Mercury in our model, and I assured <br/>\n </span></blockquote>him <br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; it was. <br/>\n&gt; <br/>\n&gt;  &gt;&gt;<br/>\n&gt; <br/>\n&gt; How did you assure him?  <br/>\n&gt; Would letting him measure them have been out of the question?<br/>\n&gt; Could he do it at a distance somehow?<br/>\n<br/>\n </span></blockquote>Well, he measured and cut out all of the smaller planets, except <br/>\nMercury. He wanted Mercury to be brown, and we didn&#39;t have any brown <br/>\nconstruction paper, so he got all the other small planets measured <br/>\nand put in an envelope, and then took off to do something else. When <br/>\nI got to it, I colored a piece of white paper, with a brown marker, <br/>\nand cut Mercury out of that. He didn&#39;t get to measure Mercury, you <br/>\nsee. <br/>\n<br/>\nAnyways, &quot;I assured him it was&quot; means, we took a look at both <br/>\nplanets, and Robby could see with the naked eye LOL the difference in <br/>\nsize. Pluto actually is a hole punch circle from black paper. If he&#39;d <br/>\nneeded to, we could have put a chair under the planets and measured <br/>\nthem with a ruler, but he was satisfied.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; &lt;&lt; Katie (8) and I <br/>\n&gt; <br/>\n&gt; watched &quot;Fly Away Home&quot; together.&gt;&gt;<br/>\n&gt; <br/>\n&gt; That&#39;s a very cool movie for unschooling families.  For anyone, I <br/>\n </span></blockquote>bet.  But <br/>\n<blockquote><span title=\"ireply\"> &gt; there really is a lot there.<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n<br/>\n<br/>\n </span></blockquote>You know what? I&#39;m discovering the lack of passion and vision in my <br/>\nown life. MOst certainly, I am laid back and not driven, so I&#39;m not <br/>\ngoing to go for it as intensely as a more choleric type...but &quot;I <br/>\ndon&#39;t know what I want to be when I grow up&quot;, you know? Starting at <br/>\nage 15, I haven&#39;t known what I wanted to do with my life, and I&#39;ve <br/>\nsort of drifted, like a piece of bleached wood in the surf. My life <br/>\nis good, don&#39;t get me wrong, but I feel really unproductive, more a <br/>\nconsumer than a producer, and I don&#39;t like it. And I don&#39;t want my <br/>\nkids&#39; innate desire to live quelched by unnatural, inhuman methods. I <br/>\ndon&#39;t want them to think they have to play the game or jump through <br/>\nthe hoops in order to have a terrific life. <br/>\n<br/>\nGatto has helped me so much, to see that the very methodology in use <br/>\nfor &quot;schooling&quot; today, is inappropriate. I&#39;m finding connections <br/>\nbetween him and my favorite (conservative) Christian educator/authors <br/>\nthat just bring tears to my eyes. It&#39;s like, finding the connecting <br/>\nideas between authors of The Great Books: &quot;Yeah! I&#39;ve read this <br/>\nsomewhere else! He is clarifying this point, made in that book by <br/>\nthat author, by coming at the same idea from a different angle. But <br/>\nit&#39;s the SAME IDEA!&quot; That is very exciting. We are starting to pick <br/>\nup on &quot;how the Cranes are going to do it&quot;. I&#39;m not wringing my hands, <br/>\nwondering if we&#39;re doing it right; I&#39;m searching and finding OUR way <br/>\nof doing it.<br/>\n<br/>\n<br/>\n<br/>\npeace, heidi</div>","specialLinks":[]},{"userId":89681911,"authorName":"Angela","from":"&quot;Angela&quot; &lt;unschooling@...&gt;","profile":"autonomousangela","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [Unschooling-dotcom] new to the  list and can you tell me what you did today?","postDate":"1044662281","msgId":58255,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDAwMWMyY2YwNCRjMGZlZmI3MCQ2OTAwYThjMEBsZWlnaD4=","inReplyToHeader":"PDY3Ljk0MDkyNmYuMmI3NDJmNDVAYW9sLmNvbT4="},"prevInTopic":58202,"nextInTopic":58284,"prevInTime":58254,"nextInTime":58256,"topicId":58106,"numMessagesInTopic":0,"msgSnippet":"Well, I just wrote what we have been up to lately to another list and I thought I would share it here too. My girls are 6 and 8.  My 6 yo is a an incredible","messageBody":"<div id=\"ygrps-yiv-1671292030\">Well, I just wrote what we have been up to lately to another list and I<br/>\nthought I would share it here too.  <br/>\n<br/>\nMy girls are 6 and 8.  My 6 yo is a an incredible story teller.  I just got<br/>\nher a cassette deck so she can tape her stories and I can type them at my<br/>\nleisure.  Some days she will dictate for 3 hours straight and it is very<br/>\nhard on my brain and my hands trying to keep up with her talking.  :0) The<br/>\nfirst day I got the tape deck, I had only 1 90 minute tape for her to use<br/>\nand she filled it that evening with 3 stories.  Some of her books are 10<br/>\nchapters long and she hopes to publish them one day.  :0)  Some days she<br/>\nwill write her stories by hand and they are wonderful, but not as long and<br/>\ncomplicated as the stories she dictates because she can go much faster.  <br/>\n<br/>\nBoth girls enjoy playing hangman lately.  We can always find paper and a pen<br/>\nin my purse and play while we are waiting in waiting rooms or whatever.  We<br/>\nhave been doing words in certain categories, like horse related words.<br/>\nSpeaking of which, both girls are now taking horse back riding lessons and<br/>\nare enjoying it very much.  <br/>\n<br/>\nOur recent favorite read alouds are by Bruce Coville books, esp. the Unicorn<br/>\nChronicles and the Magic Shop books.  We are also enjoying Lemony Snicket&#39;s<br/>\nbooks in the series &quot;A Series of Unfortunate Events&quot; tremendously.  They are<br/>\nwonderful books and they leave you hanging at the end of every chapter.  <br/>\n<br/>\nMy 8 yo has been enjoying playing a dice game where we take turns and roll a<br/>\ntwenty sided die and add up the the rolls for our score.  The first one to<br/>\n200 or 300 wins. We have also been playing it as a subtraction game starting<br/>\nat 300 and subtracting.  The first one to get to zero wins.  We got the<br/>\npolyhedral dice for Christmas and she loves it. (which really surprised me!)<br/>\nShe has learned how to borrow and carry when adding on paper and actually<br/>\nlikes it.  :0)  The is amazing from my kids who hate work books and stuff<br/>\nlike that. <br/>\n<br/>\nWe still love playing all sorts of games and lately the ones we play the<br/>\nmost are Presto Change-o, PayDay, and Life.  We also got Blink and Quiddler<br/>\nfor Christmas and have been enjoying those periodically, as well as<br/>\nZoombinis for the computer.  The kids are pretty sick of the computer games<br/>\nwe have.  They loved computer games until they got too school-ish.  Both<br/>\nlike<br/>\nto play Need for Speed though. (whoops!  it is Midtown Madness, not need for<br/>\nspeed)<br/>\n<br/>\nHmmm, we go to the pool regularly as the girls and I love to swim.  We are<br/>\ngetting tired of the cold and snow, but have done some skiing and<br/>\nsnowshoeing as well as sliding this winter.  We have also watched quite a<br/>\nfew movies...Just watched &quot;Walking With Prehistoric Beasts&quot; today.  That was<br/>\npretty cool.  <br/>\n<br/>\n<br/>\n<br/>\nAngela in <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Maine-unschooling@...\">Maine-unschooling@...</a><br/>\n &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://userpages.prexar.com/rickshaw/\">http://userpages.prexar.com/rickshaw/</a>&gt;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://userpages.prexar.com/rickshaw/\">http://userpages.prexar.com/rickshaw/</a><br/>\n<br/>\n&quot;What you are shouts so loudly in my ears I cannot hear what you say.&quot;<br/>\nEmerson<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":101672438,"authorName":"Bill and Diane","from":"Bill and Diane &lt;cen46624@...&gt;","profile":"thegreatdiane","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] new to the  list and can you tell me what you did today?","postDate":"1044621716","msgId":58202,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNFNDNBOTk0LjUwNTA3MDJAdm9sLmNvbT4=","referencesHeader":"PDEwNDQ1NjEzMjcuMjE5Ny4yNzMyNC5tM0B5YWhvb2dyb3Vwcy5jb20+IDwwMDA5MDFjMmNlMjAkOGRmYzY5NDAkZDAyODc2NDBAY29tcHV0ZXI+"},"prevInTopic":58199,"nextInTopic":58255,"prevInTime":58201,"nextInTime":58203,"topicId":58106,"numMessagesInTopic":0,"msgSnippet":"... Yesterday we played with trains until about noon, then got everyone dressed and went to Chuck E. Cheese s. We went for a drive in the snow, then came back","messageBody":"<div id=\"ygrps-yiv-1606443843\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt;<br/>\n&gt;Can you tell me what you did today?<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Yesterday we played with trains until about noon, then got everyone <br/>\ndressed and went to Chuck E. Cheese&#39;s. We went for a drive in the snow, <br/>\nthen came back home and played with blocks.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Can  you tell me your definition of unschooling?  Do you use any workbook at<br/>\n&gt;all or is that what unschooling is all about?<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>My kids occasionally play with workbooks, but they&#39;re not limited to <br/>\nusing them the way the manufacturer had in mind. Occasionally they&#39;ll <br/>\nfollow the directions on the page, but more often they do something else <br/>\nwith each page. But they do enjoy them occasionally.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Right now my oldest just wants to read his Garfield comic books or watch TV<br/>\n&gt;or listen to the radio or play on the computer or go sledding.  ANYTHING,<br/>\n&gt;but &quot;school&quot;.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>THAT is what we do! Anything BUT school! We play, and live joyously <br/>\n(except this week, when I&#39;ve been sick and not so joyous). I got a new <br/>\nparka and hood so I can take my kids sledding, but now that we have snow <br/>\nagain, I&#39;m too sick to take them.    :-(   Bleah!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So I thought, well maybe he&#39;s stressed by the workbooks, so we<br/>\n&gt;cut some out of our day.  No change in him.  Sometimes I think he&#39;s just<br/>\n&gt;taking this being home thing for granted and needs a dose of what it could<br/>\n&gt;be like!<br/>\n&gt;<br/>\n&gt;Anyone have any tips?<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Yeah, take the rest of the year off and have fun. Watch movies. Read <br/>\nyour son&#39;s comics. Go sledding. Take turns playing on the computer. Do <br/>\nfun stuff--ANYTHING but schooly stuff.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt;      (`&#39;·.¸(`&#39;·.¸ ¸.·&#39;´)¸.·&#39;´)<br/>\n&gt;  «´¨`·..*    Tyra    *..·´¨`»<br/>\n&gt;       (¸.·&#39;(¸.·&#39;´ `&#39;·.¸)`&#39;·.¸)<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>:-) Diane</div>","specialLinks":[]},{"userId":1352017,"authorName":"kayb85 &lt;sheran@ptd.net&gt;","from":"&quot;kayb85 &lt;sheran@...&gt;&quot; &lt;sheran@...&gt;","profile":"kayb85","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: new to the  list and can you tell me what you did today?","postDate":"1044603434","msgId":58199,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGIxdm5uYSsxdnR2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwMDkwMWMyY2UyMCQ4ZGZjNjk0MCRkMDI4NzY0MEBjb21wdXRlcj4="},"prevInTopic":58173,"nextInTopic":58202,"prevInTime":58198,"nextInTime":58200,"topicId":58106,"numMessagesInTopic":0,"msgSnippet":"Can you tell me what you did ... Well, last night Luke (3) woke up at 11:30 and couldn t go back to sleep. (The attic door is in his room and he s been scared","messageBody":"<div id=\"ygrps-yiv-375887156\">Can you tell me what you did<br/>\n<blockquote><span title=\"ireply\"> &gt; today?<br/>\n<br/>\n </span></blockquote>Well, last night Luke (3) woke up at 11:30 and couldn&#39;t go back to <br/>\nsleep. (The attic door is in his room and he&#39;s been scared of the <br/>\nattic lately). After laying in his bed with him for awhile it became <br/>\nobvious that he was wide awake and wouldn&#39;t be falling asleep any <br/>\ntime soon.  So we went downstairs, read 3 Clifford books, made blue <br/>\npopcorn, and put on the Brave Little Toaster.  I ended up sleeping <br/>\nwith him downstairs on the sofa bed so that he could fall asleep <br/>\nwatching the video.  He didn&#39;t go to sleep until 2:30 am (which of <br/>\ncourse means I didn&#39;t go to sleep until 2:30 am).  I don&#39;t usually <br/>\nsleep the greatest on the sofa bed, so when Alisha (9) came down at <br/>\n8:30 and woke us up, Luke and I went upstairs to sleep in my bed <br/>\nfor &quot;just a half hour&quot;.  I asked her to wake me at 9 and she did, but <br/>\nI got up at 10. :)  Luke didn&#39;t get up until noon.  <br/>\n<br/>\nWhen I got up, I started cleaning the kitchen and diningroom right <br/>\naway and made lunch.  Two of their friends were coming over at noon <br/>\nand Alisha had chosen a menu--brocolli with velveeta cheese on top, <br/>\ntomato soup, and toasted cheese sandwiches.  I put on the Horse <br/>\nWhisperer on audio tape to listen to while I worked--audio tapes from <br/>\nthe library make cleaning more fun. :)  And what do you know--Alisha <br/>\ncleaned up the livingroom without even being asked!  I was just going <br/>\nto let the livingroom go, but she straightened it up and then got her <br/>\ndolls out and lined them up on the couch.  <br/>\n<br/>\nWhile they were eating lunch, I got the mail.  I had won an ebay <br/>\nauction for computer games and they came today--Pajama Sam Not afraid <br/>\nof the dark, Little Bear Rainy Day activities and Castle Creator.  <br/>\nAfter they ate they played computer games for quite awhile.  <br/>\n<br/>\nLuke asked me to play Presto Chango with him and Alisha joined in but <br/>\ndidn&#39;t finish the game because her friend asked her to play Mario <br/>\nParty with her.  Luke lost interest too and asked to go outside.  We <br/>\nplayed with sidewalk chalk, cleaned the windows with glass cleaner, <br/>\nand (his idea) tried to chip away at the piles of icy snow on the <br/>\nsidewalk.  <br/>\n<br/>\nThen Alisha and her friend came out and tried to go sledding in the <br/>\nyard, but there&#39;s no snow left, only ice, and it was too uneven and <br/>\nhard to go down smoothly.  They got some tools and tried to chip away <br/>\nat the ice to make it ok for sleds but gave up on that pretty <br/>\nquickly.  <br/>\n<br/>\nThen they asked me to take them to a store for candy.  They were <br/>\ngoing to have some kind of club house or something and needed candy <br/>\nfor it for something.  I took Alisha, Luke, and one of the friends to <br/>\nthe store.  Matt (5) and the other friend stayed home on the <br/>\ncomputers.  While we were out I asked them what they wanted for <br/>\nsupper, and they all said, &quot;Bonanza! (steak house with a good salad <br/>\nbar)&quot;  So I came back home, picked up the other friend and went to <br/>\nBonanza(Matt and dh decided to stay home--dh doesn&#39;t like Bonanza and <br/>\nMatt generally doesn&#39;t choose to leave the house very often)<br/>\n<br/>\nWe got home and the kids were just starting to set up cushions in the <br/>\nlivingroom to do gymnastics on when the friends&#39; mom came and picked <br/>\nthem up.  <br/>\n<br/>\nDh and I watched the Michael Jackson special while the kids played.  <br/>\nI was supposed to be taking Alisha and 3 friends snow tubing tomorrow <br/>\nbut cancelled (and will reschedule) because we&#39;re supposed to get up <br/>\nto 5 inches tomorrow (&#39;d be driving 2 hours in snow).  On top of <br/>\nthat, the temp is supposed to be a high of 28 but feel like 14, so it <br/>\nwould be COLD outside!)  So because we&#39;ll be staying home tomorrow <br/>\nand because Luke has been having trouble sleeping in his room, the <br/>\nkids and I laid out comforters and sleeping bags on the livingroom <br/>\nfloor to have a special sleepover in the livingroom.  Alisha and I <br/>\nplayed two games of Sorry.  One played the normal way and one where <br/>\nwe each had two colors at the same time.  Then we popped in a movie <br/>\ncalled No More Baths--It is a great movie so far about kids who were <br/>\ninspired by Martin Luther King to protest about an elderly friend <br/>\nbeing forced off of his home.  They protested by getting all the kids <br/>\nin town to refuse to take baths.  We were probably 3/4 of the way <br/>\nthrough the movie when Luke fell asleep and the other two asked me to <br/>\nturn it off so they could go to sleep.  <br/>\n<br/>\nAfter I got everyone drinks and hugs and sang goodnight songs, I <br/>\nsnuck off to the computer.  It&#39;s 2:40 am and I&#39;m sure tomorrow <br/>\nmorning I&#39;ll be sorry I stayed up so late!</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: new to the  list and can you tell me what you did today?","postDate":"1044583907","msgId":58173,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyZi4yMjZhYTFkNC4yYjc0NmZlM0Bhb2wuY29tPg=="},"prevInTopic":58168,"nextInTopic":58199,"prevInTime":58172,"nextInTime":58174,"topicId":58106,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/6/03 6:47:11 PM, bunsofaluminum60@hotmail.com writes: ","messageBody":"<div id=\"ygrps-yiv-2027868288\">In a message dated 2/6/03 6:47:11 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:bunsofaluminum60@...\">bunsofaluminum60@...</a> writes:<br/>\n<br/>\n&lt;&lt; Robby wanted to know if <br/>\n<br/>\nPluto was really smaller than Mercury in our model, and I assured him <br/>\n<br/>\nit was. <br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;<br/>\n<br/>\n </span></blockquote>How did you assure him?  <br/>\nWould letting him measure them have been out of the question?<br/>\nCould he do it at a distance somehow?<br/>\n<br/>\n&lt;&lt; Katie (8) and I <br/>\n<br/>\nwatched &quot;Fly Away Home&quot; together.&gt;&gt;<br/>\n<br/>\nThat&#39;s a very cool movie for unschooling families.  For anyone, I bet.  But <br/>\nthere really is a lot there.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":92084939,"authorName":"Heidi &lt;bunsofaluminum60@hotmail.com&gt;","from":"&quot;Heidi &lt;bunsofaluminum60@...&gt;&quot; &lt;bunsofaluminum60@...&gt;","profile":"heidic40","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: new to the  list and can you tell me what you did today?","postDate":"1044582333","msgId":58168,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGIxdjMzdStvOHQ3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwMDkwMWMyY2UyMCQ4ZGZjNjk0MCRkMDI4NzY0MEBjb21wdXRlcj4="},"prevInTopic":58165,"nextInTopic":58173,"prevInTime":58167,"nextInTime":58169,"topicId":58106,"numMessagesInTopic":0,"msgSnippet":"Hi Tyra I like that cool decoration in your sig line. This is the day we had (I am just on the edges of unschooling, and my kids are really more deschooling","messageBody":"<div id=\"ygrps-yiv-693011459\">Hi Tyra<br/>\n<br/>\nI like that cool decoration in your sig line.<br/>\n<br/>\nThis is the day we had (I am just on the edges of unschooling, and my <br/>\nkids are really more &quot;deschooling&quot; right now)<br/>\n<br/>\nI got up at 5:30 and got some laundry started, then spent an hour or <br/>\nso reading some John Taylor Gatto online, and writing in my journal. <br/>\nAlso, wrote a letter to my best friend and sent it, with the second <br/>\nchapter in HER story, that I gave her for her b-day and am sending <br/>\none chapter at a time, to keep the suspense up.<br/>\n<br/>\nKids were up by 9:00ish. They slept in, because last night was a late <br/>\nnight for them. We stuck Jupiter back on the ceiling. It&#39;s heavy, and <br/>\nthe tape doesn&#39;t hold it very well anymore. Robby wanted to know if <br/>\nPluto was really smaller than Mercury in our model, and I assured him <br/>\nit was. <br/>\n<br/>\nI had the kids all bring their dirty clothes from their rooms into <br/>\nthe laundry room, and folded the whites while Katie (8) and I <br/>\nwatched &quot;Fly Away Home&quot; together. It hit me strongly, this time <br/>\naround.  The passion and vision of that father and that girl; the <br/>\ncourage of following their dreams. Hmm. Funny how things come into <br/>\nyour life that dovetail so amazingly with other things.<br/>\n<br/>\nWhile we watched the movie, Robby was playing computer, and Abbie <br/>\nstudying some for the correspondence school we have her enrolled in. <br/>\nShe also figured out a couple of tunes on her Irish Flute. She&#39;s <br/>\ntrying to perfect the sharps and flats on that instrument. <br/>\n<br/>\nAfter lunch, my hubby took Abbie to her drama class and Robby went <br/>\nwith them. He wanted to see if the library had computer games to <br/>\ncheck out. He&#39;s reading Hardy Boys mysteries right now, and wants to <br/>\nmake sure he always has two at hand, but for some reason, not more <br/>\nthan two. the one he&#39;s reading, plus one right available for when he <br/>\nfinishes. He and I also talked about what he&#39;d like to do that <br/>\ninvolved math (I know, I know, it isn&#39;t unschooling to separate the <br/>\nsubjects out of life like that....I&#39;m getting there, but I ain&#39;t <br/>\nthere yet) No, he doesn&#39;t want to do problems on paper. He&#39;d rather <br/>\nplay Clue Finders or Operation Neptune on the computer. <br/>\n<br/>\nKatie went outside to sled, and I read some more Gatto and talked to <br/>\na friend on the phone. straightened up the front room and dining <br/>\nroom. Sketched out a picture I&#39;m thinking about. Katie, meanwhile, <br/>\nwas in and out. We listened to Hank the Cow Dog in Monkey Business <br/>\nand laughed our heads off.<br/>\n<br/>\nThe rest of the family got home, and Dad took Robby with him, on some <br/>\nmore errands. &quot;Boys&#39; Evening Out.&quot; Abbie posted some on an online <br/>\nLOTR forum and talked on the phone with a friend. Katie has some <br/>\ncandles lit in the middle of the table, for what purpose I&#39;m not <br/>\nsure...she tells me &quot;to light it up in here.&quot; She&#39;s having a snack <br/>\nand enjoying the candlelight.<br/>\n<br/>\nReally, this has been more of a hanging out day. Not even a speck <br/>\nbusy. Just being home and doing whatever. Tomorrow, we ski. ack. <br/>\nFirst time for the kids; first time in 25 years, for me! ack.<br/>\n<br/>\nAs for &quot;tips.&quot; Even if unschooling was completely wacked out and <br/>\nutter nonsense, to be avoided at all costs, I would advise, <br/>\nespecially if they&#39;ve been in school...let them decompress for the <br/>\nfirst year. Don&#39;t &quot;do school&quot; with them at all, but build the <br/>\nrelationship by just being with them and enjoying each other. Don&#39;t <br/>\nworry about academics one bit, but just be with them. Do stuff <br/>\ntogether. Spend time with each other.<br/>\n<br/>\npeace, Heidi<br/>\n<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a>, &quot;from Tyra&quot; &lt;mtwalte@p...&gt; <br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Hi everyone. We are new to the list.  We have two boys in early <br/>\n </span></blockquote>elementary<br/>\n<blockquote><span title=\"ireply\"> &gt; age.  I&#39;d really like to make this unschooling/delight directed<br/>\n&gt; philosophie(s) work, but I&#39;m really struggling with the ...concept <br/>\n </span></blockquote>I guess<br/>\n<blockquote><span title=\"ireply\"> &gt; or the guilt maybe of not doing &quot;anything&quot;.  Can you tell me what <br/>\n </span></blockquote>you did<br/>\n<blockquote><span title=\"ireply\"> &gt; today?<br/>\n&gt; <br/>\n&gt; Can  you tell me your definition of unschooling?  Do you use any <br/>\n </span></blockquote>workbook at<br/>\n<blockquote><span title=\"ireply\"> &gt; all or is that what unschooling is all about?<br/>\n&gt; <br/>\n&gt; Right now my oldest just wants to read his Garfield comic books or <br/>\n </span></blockquote>watch TV<br/>\n<blockquote><span title=\"ireply\"> &gt; or listen to the radio or play on the computer or go sledding.  <br/>\n </span></blockquote>ANYTHING,<br/>\n<blockquote><span title=\"ireply\"> &gt; but &quot;school&quot;. So I thought, well maybe he&#39;s stressed by the <br/>\n </span></blockquote>workbooks, so we<br/>\n<blockquote><span title=\"ireply\"> &gt; cut some out of our day.  No change in him.  Sometimes I think he&#39;s <br/>\n </span></blockquote>just<br/>\n<blockquote><span title=\"ireply\"> &gt; taking this being home thing for granted and needs a dose of what <br/>\n </span></blockquote>it could<br/>\n<blockquote><span title=\"qreply\"> &gt; be like!<br/>\n&gt; <br/>\n&gt; Anyone have any tips?<br/>\n&gt; <br/>\n&gt;       (`&#39;·.¸(`&#39;·.¸ ¸.·&#39;´)¸.·&#39;´)<br/>\n&gt;     «´¨`·..*    Tyra    *..·´¨`»<br/>\n&gt;        (¸.·&#39;(¸.·&#39;´ `&#39;·.¸)`&#39;·.¸) </span></blockquote></div>","specialLinks":[]},{"userId":109856460,"authorName":"nellebelle","from":"&quot;nellebelle&quot; &lt;nellebelle@...&gt;","profile":"lamaribelle","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] new to the  list and can you tell me what you did today?","postDate":"1044580994","msgId":58165,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxM2QwMWMyY2U0NyRmMTdkMGYyMCQ2NTAxYThjMEBvZW1jb21wdXRlcj4=","referencesHeader":"PDE4Ny4xNWI3MGUyNy4yYjc0NGQ4M0Bhb2wuY29tPg=="},"prevInTopic":58155,"nextInTopic":58168,"prevInTime":58164,"nextInTime":58166,"topicId":58106,"numMessagesInTopic":0,"msgSnippet":"I usually get out of bed after Pat (dh) takes his shower.  He makes me a latte every morning and we sit at the table sharing the newspaper before he leaves for","messageBody":"<div id=\"ygrps-yiv-1487745385\">I usually get out of bed after Pat (dh) takes his shower.  He makes me a<br/>\nlatte every morning and we sit at the table sharing the newspaper before he<br/>\nleaves for work.  Jackie got up before he left.<br/>\n<br/>\nMy kids called me to come see Julie Andrews on TV earlier today.  She was<br/>\ndoing some sort of reading promotion.  When it was over I commented that it<br/>\nseemed strange to see all this stuff trying to convince parents to read to<br/>\ntheir kids.  I told them that I read to them because I like to read to them<br/>\nand they like it too.  Lisa (10) asked if she could read to me this morning<br/>\nand what did I want her to read.  I mentioned a couple of books, (fiction<br/>\nand non-fiction).  She read to me from a book about hamsters that I got<br/>\nyesterday at the library.  We got a hamster last week.<br/>\n<br/>\nI went with her this morning for her petsitting job.  We walked Woody, and<br/>\nwhen he pooped, as he always does, I picked it up for her because she thinks<br/>\nit&#39;s really gross and I told her that she should give me part of her money<br/>\nsince I do the poop scooping, (even though I thinks it&#39;s gross too, but I<br/>\nguess we moms get sort of used to poopy jobs), anyway, the poop was steaming<br/>\nin the cold air and I commented on that, which led to a conversation about<br/>\nthings in and coming out of our bodies are warm like our bodies.<br/>\n<br/>\nI watched a baby Looney tunes cartoon with the kids.  The babies all overate<br/>\ncereal because the granny said they couldn&#39;t have the toys in the cereal<br/>\nuntil the cereal was gone.  They were all &quot;punished&quot; with terrible stomach<br/>\naches (lots of cartoon burping there) and the next day grammy fed them<br/>\noatmeal instead.  There was a Trix cereal commercial and I said that I loved<br/>\nTrix when I was a kid, but I don&#39;t like it anymore.  The rabbit said &quot;Trix<br/>\nis for kids&quot;.<br/>\n<br/>\nJackie (7)  asked me to listen to her sing a song on her karaoke.  I told<br/>\nher that I noticed the movements she made to go along with the lyrics and<br/>\nshe demonstrated a couple of them again.<br/>\n<br/>\nBoth kids made a bead design, the kind that you put little beads on a frame,<br/>\nthen iron it.  Lisa made a heart shaped one with an &quot;L&quot; in the middle.<br/>\nJackie spelled LOVE and she is giving it to Daddy for Valentine&#39;s Day.  She<br/>\nhad to redo the V and E because she didn&#39;t like the way they looked the<br/>\nfirst time.  Later, Jackie started another one, and asked me if Daddy knows<br/>\nhow to iron.  I suspect that she is making it for me :-)<br/>\n<br/>\nWe had some homeschooling friends visit today.  Jackie and Josie made<br/>\ncookies.  They also went skating, biking, and scootering.  All the kids<br/>\nplayed on the swing set for a while.  Lisa and Sarah played with play dough,<br/>\nthen Sarah and her mom went off to the first day of Sarah&#39;s six session art<br/>\nclass.  Lisa saw the neighbor walking three dogs and pushing a stroller and<br/>\nwent out to join her for a little while.<br/>\n<br/>\nI made soup and bread.  Lisa helped me braid the dough.<br/>\n<br/>\nThe neighbor girl came over and now she and Jackie are working on a 550<br/>\npiece puzzle.  We have had a puzzle going on a table in the corner of the<br/>\nliving room for about a month now.  When we finish one, we leave it a day or<br/>\ntwo, then take it down and start a new one.<br/>\n<br/>\nTonight we are sitting for Jackie&#39;s friend Edward for a couple of hours<br/>\nwhile his mom is at the PTO meeting and Dad is at Karate.  Jackie is very<br/>\nhappy that he will be coming over.<br/>\n<br/>\nMary Ellen<br/>\n<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message -----<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.comicspage.com/looseparts/index.html\">http://www.comicspage.com/looseparts/index.html</a><br/>\n&gt; If you read this after Thursday, go back to the 2/6 cartoon.<br/>\n&gt; The caption is &quot;Marty discovers the Reading is FUNdamentalists.&quot; </span></blockquote></div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] new to the  list and can you tell me what you did today?","postDate":"1044575107","msgId":58155,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE4Ny4xNWI3MGUyNy4yYjc0NGQ4M0Bhb2wuY29tPg=="},"prevInTopic":58147,"nextInTopic":58165,"prevInTime":58154,"nextInTime":58156,"topicId":58106,"numMessagesInTopic":0,"msgSnippet":"http://www.comicspage.com/looseparts/index.html If you read this after Thursday, go back to the 2/6 cartoon. The caption is Marty discovers the Reading is","messageBody":"<div id=\"ygrps-yiv-933236331\"><a rel=\"nofollow\" target=\"_blank\" href=\"http://www.comicspage.com/looseparts/index.html\">http://www.comicspage.com/looseparts/index.html</a><br/>\n<br/>\nIf you read this after Thursday, go back to the 2/6 cartoon.<br/>\n<br/>\nThe caption is &quot;Marty discovers the Reading is FUNdamentalists.&quot;</div>","specialLinks":[]},{"userId":1248344,"authorName":"Jodi","from":"&quot;Jodi&quot; &lt;jmoore@...&gt;","profile":"jodimoor","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] new to the  list and can you tell me what you did today?","postDate":"1044573477","msgId":58147,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAzNDEwMWMyY2UzNiQwMjE2MzFjMCQ5NWNiMjM0MEBncmV5Y2F0Pg==","referencesHeader":"PDEwNDQ1NjEzMjcuMjE5Ny4yNzMyNC5tM0B5YWhvb2dyb3Vwcy5jb20+IDwwMDA5MDFjMmNlMjAkOGRmYzY5NDAkZDAyODc2NDBAY29tcHV0ZXI+"},"prevInTopic":58118,"nextInTopic":58155,"prevInTime":58146,"nextInTime":58148,"topicId":58106,"numMessagesInTopic":0,"msgSnippet":"... We are new too and I still have days where I worry, they are getting less now. Here is our day today. I woke later than usual a little after 8:30. All four","messageBody":"<div id=\"ygrps-yiv-42838110\">Tyra wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Hi everyone. We are new to the list.  We have two boys in early elementary<br/>\n&gt; age.  I&#39;d really like to make this unschooling/delight directed<br/>\n&gt; philosophie(s) work, but I&#39;m really struggling with the ...concept I guess<br/>\n&gt; or the guilt maybe of not doing &quot;anything&quot;.  Can you tell me what you did<br/>\n&gt; today?<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>We are new too and I still have days where I worry, they are getting less<br/>\nnow. Here is our day today.<br/>\nI woke later than usual a little after 8:30. All four kids were playing<br/>\nhappily upstairs so I got on the computer to read emails while I ate my<br/>\nbagel for breakfast. I had offered to do bagels for the kids but they had<br/>\nalready gotten their own breakfast of crackers, vegetarian cheese slices and<br/>\nvegetarian baloney slices. Eventually all 4 kids made their way downstairs<br/>\nand started batteries for their remote control cars charging.<br/>\nOnce downstairs the kids remembered there were still lots of balloons left<br/>\nfrom Colin&#39;s 5th birthday on Tuesday. So then they blew some up and drew<br/>\nfaces on them or wrote words on them. Then they decided to make water<br/>\nballoons. The oldest, Trevor age 8 1/2 was trying to figure out how much<br/>\nwater you could put in before it would pop, or why the air always went to<br/>\nthe top and the water to the bottom. Hayley-7 made a special balloon for<br/>\neach of her brothers with drawings on them. Tristan-3 1/2 and Colin-newly 5<br/>\nthen went to watch TV while the older two continued the balloon game. Then<br/>\nthey were tossing the water balloons to each other and I got a little<br/>\nworried about a flooded kitchen! The little guys watched Cailou and<br/>\nsomething else then the big two came in when they heard Scooby doo start.<br/>\nAll four watched that show while I cooked dinner. We have our big meal<br/>\naround 1:00 since DH works nights. DH woke up somewhere around then and<br/>\nshowered. Then we all had dinner and the kids did some creative food trading<br/>\nand tried to get the puppy to play with their brussel sprouts and see if she<br/>\nwould eat one (some of them like brussel sprouts I wasn&#39;t being a mean<br/>\nmummy!!!) The puppy did not eat a brussel sprout for anyone wondering :-).<br/>\nAfter dinner the pattern blocks set was taken out by Hayley and she and the<br/>\nyounger boys played with that for about an hour. Trevor put charged<br/>\nbatteries back into remote control cars. Then they all played with Colin&#39;s<br/>\nnew remote control fire truck. It squirts water, which I did not know when<br/>\nwe bought it! I let them play with it in the kitchen and they made targets<br/>\nto shoot the water at. Eventually all 4 made their way upstairs again and I<br/>\nfound them playing with a variety of toys. About 5:00 pm as I was<br/>\nconsidering supper Colin asked if he could learn to use the toaster now that<br/>\nhe&#39;s 5. So I showed him how it works and he made bagels for all his<br/>\nsiblings. Tristan wanted something different so I got that for him and he<br/>\nalso shared my popcorn. The other 3 worked out how best to split Tristans<br/>\nbagel. Then Trevor wanted 2 sandwiches as well, which I made for him. That<br/>\nboy never stops eating. Everyone got drinks and younger three headed<br/>\nupstairs to watch a video of Nick Jr. shows. Trevor stayed downstairs to<br/>\nwatch cyberchase and now he has spongebob on while I am reading emails.<br/>\nWe have used a variety of curriculum over the past 3 years, this year was<br/>\nBob Jones homesat. We are definetly de-schooling at the moment. My oldest<br/>\nhas SID/Aspergers and hates workbooks. It makes me cring to think I made him<br/>\ndo some before we came to unschooling. He is really blosoming now, he told<br/>\nme the other day he counted to 1000 when he couldn&#39;t sleep one night (when<br/>\nhe had chicken pox last week) and then he counted to 500 by 5&#39;s and 10&#39;s!<br/>\n<br/>\nJodi</div>","specialLinks":[]},{"userId":2300774,"authorName":"Betsy","from":"Betsy &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] new to the  list and can you tell me what you  did today?","postDate":"1044567634","msgId":58118,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNFNDJENjUyLjU2MDVEMDk2QGVhcnRobGluay5uZXQ+","referencesHeader":"PDEwNDQ1NjEzMjcuMjE5Ny4yNzMyNC5tM0B5YWhvb2dyb3Vwcy5jb20+IDwwMDA5MDFjMmNlMjAkOGRmYzY5NDAkZDAyODc2NDBAY29tcHV0ZXI+"},"prevInTopic":58117,"nextInTopic":58147,"prevInTime":58117,"nextInTime":58119,"topicId":58106,"numMessagesInTopic":0,"msgSnippet":"**Can  you tell me your definition of unschooling?  Do you use any workbook at all or is that what unschooling is all about? Right now my oldest just wants to","messageBody":"<div id=\"ygrps-yiv-395405782\">**Can  you tell me your definition of unschooling?  Do you use any<br/>\nworkbook at all or is that what unschooling is all about?<br/>\n<br/>\nRight now my oldest just wants to read his Garfield comic books or watch TV<br/>\nor listen to the radio or play on the computer or go sledding. **<br/>\n<br/>\n<br/>\nHi, Tyra --<br/>\n<br/>\nMy son is 8 and a half.  Reading comic books (incl. Garfield), riding<br/>\nhis scooter, watching TV and playing on the computer are the most common<br/>\nthings he does with his time.  We also play with friends and have<br/>\ninteresting conversations about what we see or read.  He doesn&#39;t do any<br/>\nworkbooks, and I don&#39;t ask him to.  He has gained a lot of math practice<br/>\nplaying games, especially Monopoly.<br/>\n<br/>\nIt was fun to go to www.googlism.com and put &quot;unschooling&quot; in the search<br/>\nfield.  I got a lot of partial definitions of unschooling, kind of like<br/>\none would find in a fortune cookie.<br/>\n<br/>\n(I&#39;m terrible at writing my own definitions.)<br/>\n<br/>\nBetsy</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] new to the  list and can you tell me what you did today?","postDate":"1044567365","msgId":58117,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY3Ljk0MDkyNmYuMmI3NDJmNDVAYW9sLmNvbT4="},"prevInTopic":58106,"nextInTopic":58118,"prevInTime":58116,"nextInTime":58118,"topicId":58106,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/6/03 1:42:01 PM, mtwalte@powerweb.net writes: ","messageBody":"<div id=\"ygrps-yiv-11568228\">In a message dated 2/6/03 1:42:01 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mtwalte@...\">mtwalte@...</a> writes:<br/>\n<br/>\n&lt;&lt; I&#39;d really like to make this unschooling/delight directed<br/>\n<br/>\nphilosophie(s) work, but I&#39;m really struggling with the ...concept I guess&gt;&gt;<br/>\n<br/>\nIf somewhere in your life your sons are supposed to &quot;do school&quot; (instead of <br/>\nsledding,  read his Garfield comic books or watch TV<br/>\n<br/>\nor listen to the radio or play on the computer) then you&#39;re not unschooling.<br/>\n<br/>\nWorkbooks aren&#39;t unschooling materials.<br/>\n<br/>\nThat said, my daughter finished a workbook last week.  But she started it <br/>\nabout five years ago, or maybe one of her brothers did.  It was in box of <br/>\npuzzle books, coloring books, and such.  It was an Animaniacs 2nd grade math <br/>\nbook.  She finished it, some pages in a more difficult way than the authors <br/>\nintended, and all for fun, and just for her own amusement.<br/>\n<br/>\n&lt;&lt;...or the guilt maybe of not doing &quot;anything&quot;.  &gt;&gt;<br/>\n<br/>\nUntil you think of &quot;schoolwork&quot; as the small nothing and the rest of life as <br/>\nthe big something, unschooling won&#39;t work.<br/>\n<br/>\nYou should be doing EVERYTHING with your children.  <br/>\nNot nothing.<br/>\n<br/>\n&lt;&lt; Sometimes I think he&#39;s just<br/>\n<br/>\ntaking this being home thing for granted and needs a dose of what it could<br/>\n<br/>\nbe like!&gt;&gt;<br/>\n<br/>\nOf what being home could be like you mean?<br/>\nYou should spend a few weeks finding out what being home can really be like!! <br/>\nFind out how sweet and peaceful and funny and wonderful it can be at home <br/>\nwith your children and NO school thoughts whatsoever, just happy life and <br/>\nlots of togetherness.   When you get to that happy place, learning will just <br/>\nfill up all the empty spaces entirely.<br/>\n<br/>\nIf they ARE being home, why wouldn&#39;t they &quot;take that for granted&quot;?<br/>\nDo they take it for granted that they are your sons?  Do they take for <br/>\ngranted that the sun will come up tomorrow?   No problem!  If it doesn&#39;t, we <br/>\ncan worry about that when it doesn&#39;t happen! &lt;g&gt;<br/>\n<br/>\n&lt;&lt;Anyone have any tips?&gt;&gt;<br/>\n<br/>\nRead here, and at www.unschooling.com, where people write about their days <br/>\nevery day.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":52066284,"authorName":"from Tyra","from":"&quot;from Tyra&quot; &lt;mtwalte@...&gt;","profile":"sb4tyra","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"new to the  list and can you tell me what you did today?","postDate":"1044564272","msgId":58106,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDkwMWMyY2UyMCQ4ZGZjNjk0MCRkMDI4NzY0MEBjb21wdXRlcj4=","referencesHeader":"PDEwNDQ1NjEzMjcuMjE5Ny4yNzMyNC5tM0B5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":58117,"prevInTime":58105,"nextInTime":58107,"topicId":58106,"numMessagesInTopic":0,"msgSnippet":"Hi everyone. We are new to the list.  We have two boys in early elementary age.  I d really like to make this unschooling/delight directed philosophie(s) work,","messageBody":"<div id=\"ygrps-yiv-767922236\">Hi everyone. We are new to the list.  We have two boys in early elementary<br/>\nage.  I&#39;d really like to make this unschooling/delight directed<br/>\nphilosophie(s) work, but I&#39;m really struggling with the ...concept I guess<br/>\nor the guilt maybe of not doing &quot;anything&quot;.  Can you tell me what you did<br/>\ntoday?<br/>\n<br/>\nCan  you tell me your definition of unschooling?  Do you use any workbook at<br/>\nall or is that what unschooling is all about?<br/>\n<br/>\nRight now my oldest just wants to read his Garfield comic books or watch TV<br/>\nor listen to the radio or play on the computer or go sledding.  ANYTHING,<br/>\nbut &quot;school&quot;. So I thought, well maybe he&#39;s stressed by the workbooks, so we<br/>\ncut some out of our day.  No change in him.  Sometimes I think he&#39;s just<br/>\ntaking this being home thing for granted and needs a dose of what it could<br/>\nbe like!<br/>\n<br/>\nAnyone have any tips?<br/>\n<br/>\n      (`&#39;·.¸(`&#39;·.¸ ¸.·&#39;´)¸.·&#39;´)<br/>\n  «´¨`·..*    Tyra    *..·´¨`»<br/>\n       (¸.·&#39;(¸.·&#39;´ `&#39;·.¸)`&#39;·.¸)</div>","specialLinks":[]}],"prevTopicId":58276,"nextTopicId":58287}}