{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":0,"authorName":"Buresmom@xxx.xxx","from":"Buresmom@...","replyTo":"LIST","senderId":"r4Jcfo9ePaf4xmOwap-pEhutqwqqwJ_-BoIB10q3uya6SAZ9_WVDFylZJM7ArLQbnho0Wz0zag","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Math issues","postDate":"936795161","msgId":2757,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4xOTYuMjc1Ny45NTkyNjk3NDFAZUdyb3Vwcy5jb20+"},"prevInTopic":2669,"nextInTopic":0,"prevInTime":2756,"nextInTime":2758,"topicId":2669,"numMessagesInTopic":0,"msgSnippet":"In a message dated 09/06/1999 11:50:01 PM Eastern Daylight Time, jillmca@worldnet.att.net writes: ","messageBody":"<div id=\"ygrps-yiv-1392408030\">In a message dated 09/06/1999 11:50:01 PM Eastern Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jillmca@...\">jillmca@...</a> writes:<br/>\n<br/>\n&lt;&lt;  <br/>\n It seems to me that any discussion about learning math should also ask the<br/>\n question &quot;why are so many people (who went through the school system) phobic<br/>\n about math?&quot;  My guess is that many people would label themselves as math<br/>\n phobic/ can&#39;t do math/don&#39;t get math &gt;&gt;<br/>\n<br/>\n  when folks talk about math--i think they&#39;re usually talking about <br/>\ncalculation--which is a very small part of mathemathics.  We are surrounded <br/>\nby mathematics--we all arrange furniture--that&#39;s design and proportion. We <br/>\ncook. We figure out how much things cost at the store.  Some people play <br/>\npool, or golf (geometry). We garden (look at the center of flowers, notice <br/>\nthe pattern)  An on and on.  There is a book, Math Art. Which might be useful <br/>\nfor the calculation phobis among us...<br/>\n Debra</div>","specialLinks":[]},{"userId":0,"authorName":"Jill","from":"&quot;Jill&quot; &lt;jillmca@...","replyTo":"LIST","senderId":"P4CGEyvcB6Q4qbjJikZOWSz2rqoLZZdIwABDr3QQysGFD5C2yYIqMUuCfGCJIDPTVOcRB1nIrfqSvxwSE8rXNNdXcJkUUBas","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Math issues","postDate":"936676155","msgId":2669,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4xOTEuMjY2OS45NTkyNjk3NDFAZUdyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":2757,"prevInTime":2668,"nextInTime":2670,"topicId":2669,"numMessagesInTopic":0,"msgSnippet":"It seems to me that any discussion about learning math should also ask the question why are so many people (who went through the school system) phobic about","messageBody":"<div id=\"ygrps-yiv-230304645\">It seems to me that any discussion about learning math should also ask the<br/>\nquestion &quot;why are so many people (who went through the school system) phobic<br/>\nabout math?&quot;  My guess is that many people would label themselves as math<br/>\nphobic/ can&#39;t do math/don&#39;t get math.  It would be difficult to feel like<br/>\nyou could introduce math to your children if you feel that way - you won&#39;t<br/>\nbe able to answer their questions etc, etc.  From my personal experience it<br/>\nwould be impossible to hide math basics from your children.  They will<br/>\nprobably have their own building blocks however.  My children talk about<br/>\nnumbers a lot, sometimes they quiz each other.  They have their own ways of<br/>\nfiguring things out.  Recently my older son wanted to know how many families<br/>\nhe would have if he had 20 children who were twins.  We looked at it in a<br/>\nfew different ways and talked about dividing.  I am not sure how he does the<br/>\ncalculation or exactly what he got out of it but it is one more bit to add<br/>\nto his foundation of knowledge.<br/>\nI think all knowledge is accumulated in this way.  I think we remember<br/>\nbetter when we can attach new information to something we already know.  So<br/>\nthere are building blocks which we attach new information to.  The important<br/>\nthing is that the building blocks are not some set of facts we can all<br/>\nlearn.  They are unique and based on our personal experiences.  My children<br/>\nmay be exposed to exactly the same things (not true) but they perceive them<br/>\nin different ways and different aspects are important to each of them so<br/>\ntheir basic knowledge is different.<br/>\nI think this is one of the reasons why unschooling makes sense.  Each<br/>\nchild/person can accumulate information in a way that makes sense and is<br/>\nretrievable for them.  When we are forced to learn certain material on<br/>\nsomeone else&#39;s (the teacher) schedule we totally disrupt this process.  No<br/>\nwonder we can&#39;t remember what we learned in school.  This is also the reason<br/>\nwhy there is not some standard set of information that we need to know at a<br/>\ncertain stage of our life.  This is also why testing for specific knowledge<br/>\ngives misleading information about a person&#39;s knowledge.<br/>\nAnother way of thinking about unschooling is to think about how you learn.<br/>\nSay, I tell you to go and learn how to play the piano or complete a course<br/>\nin Algebra 1.  I am not going to give you any incentive - just do it because<br/>\nI said to.  I know that you will need to know that stuff, I know better than<br/>\nyou.  What are you going to learn?  On the other hand think about the last<br/>\ntime you wanted to know or learn something.  How did you go about it?  Was<br/>\nit fun?  Did you have trouble figuring out the interim steps to get to your<br/>\ngoal?  We often have to learn some basic technique or acquire a basic tool<br/>\nbefore we can achieve our goal.  If we are motivated it isn&#39;t a stumbling<br/>\nblock.  The example of person who posted about wanting to become a nurse but<br/>\nhad to do the Algebra first.  Without the goal of becoming a nurse it is<br/>\nunlikely she would have studied the algebra but she was very successful at<br/>\nit.  Most adult learning is like that.  Why do we expect children to learn<br/>\nin a different way?<br/>\nHope this helps.<br/>\nJill</div>","specialLinks":[]}],"prevTopicId":2629,"nextTopicId":2609}}