{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":332164648,"authorName":"Rippy and Graham Dusseldorp","from":"Rippy and Graham Dusseldorp &lt;ripgray@...&gt;","profile":"rdusseldorp","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] How to Introduce The Unschooling Concept","postDate":"1371371031","msgId":71627,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU3MUQzQjRDLUM1MkMtNDRCNS04NTYyLTBCMEQwMzAwODAxQkBnbWFpbC5jb20+","inReplyToHeader":"PDA2Q0VGMjNGLTk0RUItNDIzNi1CNjNDLTFBM0ExRUNBN0EyOEBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGtwaWFtcSttNGEyQGVHcm91cHMuY29tPiA8MDZDRUYyM0YtOTRFQi00MjM2LUI2M0MtMUEzQTFFQ0E3QTI4QFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":71626,"nextInTopic":0,"prevInTime":71626,"nextInTime":71628,"topicId":71623,"numMessagesInTopic":0,"msgSnippet":"-=- There are some more mainstream things here, that you might sneak in on him gradually. :-) -=- One of my favourite mainstream books to leave lying around","messageBody":"<div id=\"ygrps-yiv-185010078\">-=- There are some more mainstream things here, that you might sneak in on him gradually. :-) -=- <br/>\n<br/>\nOne of my favourite mainstream books to leave lying around the house when skeptic family and friends come to visit is Clark Aldrich&#39;s Unschooling Rules: 55 Ways to Unlearn What We Know About Schools and Rediscover Education. It&#39;s short and concise and each chapter takes about a minute or so to read. I usually leave it in the bathroom and I suspect people secretly read it, even though they might not want to ;-)<br/>\n<br/>\nI don&#39;t think Clark Aldrich is an unschooler, but he is an admirer of unschooling. <br/>\n<br/>\nThe back of the book describes him as &quot;a global education thought leader, labeled a guru by Fortune Magazine. He works with corporate, military, government, and academic organizations at both the board level and as a hands-on implementer. ...His work has been featured in hundreds of sources, including CBS, ABC, the New York Times, Wall Street Journal, CNN, ...&quot;<br/>\n<br/>\nIf I see someone reading it, I might say something casual like &quot;it makes you think, doesn&#39;t it?&quot; and then move on to a different topic unless the person shows some enthusiasm for an unschooling discussion.<br/>\n<br/>\nRippy<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: How to Introduce The Unschooling Concept","postDate":"1371344739","msgId":71626,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtwajMxMyticjVoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGtwaWFtcSttNGEyQGVHcm91cHMuY29tPg=="},"prevInTopic":71625,"nextInTopic":71627,"prevInTime":71625,"nextInTime":71627,"topicId":71623,"numMessagesInTopic":0,"msgSnippet":"... I wouldn t bring up the academic side of unschooling at all unless he suddenly starts wondering when you re going to start teaching something. Make life","messageBody":"<div id=\"ygrps-yiv-100267013\">&quot;jacharakis&quot; &lt;jacharakis@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I feel I ought to do this sooner rather than later<br/>\n<br/>\n </span></blockquote>I wouldn&#39;t bring up the academic side of unschooling at all unless he suddenly starts wondering when you&#39;re going to start teaching something. Make life wonderful and fun so he can see his son loving to learn - then you can talk about wanting to preserve and nurture that love of learning and joy in discovery. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;he&#39;s wonderful with the boys (he has a 10 year old) and is gewnerally more peaceful and responsive, during times of stress he tends to be very curt and abrupt<br/>\n </span></blockquote>**************<br/>\n<br/>\nDo you think its his goal to be an asshole? It&#39;s a real question - some men think it&#39;s their role as dads to be the bad guy, the disciplinarian of the family. <br/>\n<br/>\nIf he Doesn&#39;t value that and doesn&#39;t Want to be an ass to his kids, be supportive of all the times and ways he is sweet and gentle with them. Set him up for success as much as possible - not necessarily by managing or interfering, which can seem like criticism, but by helping him be calmer and feel better about himself. <br/>\n<br/>\nI didn&#39;t talk to George about unschooling at first. He didn&#39;t want to hear about educational theories, he wanted to know he wasn&#39;t a loser, wasn&#39;t doomed to be the same asshole of a dad that he grew up with. He wasn&#39;t oblivious to how he behaved when he was stressed, he just wasn&#39;t sure he believed in his own ability to do better. So I loved him up - just like a kid who needed a lot of reassurance (not because I think men are like children, but because children and men are people). I let him know that I could see how much he cared about his son. I noticed out loud when he was patient or thoughtful or calm so that he could see it too. I asked if he wanted help and what kind? So then when things were getting rough, I could step in and it felt, to George, like help rather than criticism. And he started to step in and help when I was having a rough time, too. <br/>\n<br/>\nTalking about unschooling came later, more of a &quot;oh, yeah, this philosophy of being kind to our kids has a name&quot; sort of thing than some kind of statement of intent. And after that there was a time when George was feeling less appreciated (because I&#39;d stopped being so appreciative!) and he talked to me about that - how he was feeling less important than the kids and that hurt, and would I please extend the same care and consideration toward him that I did toward them. I did - and he&#39;s one of the staunchest unschooling parents I know these days. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] How to Introduce The Unschooling Concept","postDate":"1371327671","msgId":71625,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA2Q0VGMjNGLTk0RUItNDIzNi1CNjNDLTFBM0ExRUNBN0EyOEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGtwaWFtcSttNGEyQGVHcm91cHMuY29tPg==","referencesHeader":"PGtwaWFtcSttNGEyQGVHcm91cHMuY29tPg=="},"prevInTopic":71624,"nextInTopic":71626,"prevInTime":71624,"nextInTime":71626,"topicId":71623,"numMessagesInTopic":0,"msgSnippet":"-=- Sending articles does not work well as he won t even read them. Something we can watch together works well, but is there a video out there that can get him","messageBody":"<div id=\"ygrps-yiv-1405887752\">-=- Sending articles does not work well as he won&#39;t even read them. Something we can watch together works well, but is there a video out there that can get him hooked and searching for more?-=-<br/>\n<br/>\nMAYBE this:  Tell him I spoke in Lisbon, with Joyce Fetteroll, and by the time we speak in Ashford, we will also both have spoken in Scotland and the Netherlands.<br/>\nHe might be willing to come and hear us.  And it&#39;s likely to be his last chance.  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/video/doright\">http://sandradodd.com/video/doright</a><br/>\n<br/>\n<br/>\n-=-Short of buying him a ticket to the upcoming conference in Ashford (he may or may not attend though), what else can I do?-=-<br/>\n<br/>\nRushing him and pressuring him isn&#39;t the answer.<br/>\n<br/>\nThere are some more mainstream things here, that you might sneak in on him gradually. :-)<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://unschooling.blogspot.com\">http://unschooling.blogspot.com</a><br/>\n<br/>\nAnd if he will listen to sound files, there are several here you can download for free.  If he does a commute, there might be something he would listen to in the car.  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/listen\">http://sandradodd.com/listen</a><br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":332164648,"authorName":"Rippy and Graham Dusseldorp","from":"Rippy and Graham Dusseldorp &lt;ripgray@...&gt;","profile":"rdusseldorp","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] How to Introduce The Unschooling Concept","postDate":"1371324761","msgId":71624,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEIyMTEzQ0ZELUQyN0QtNEYwMS04MDFGLUMxNEQyQTgxRTRGOUBnbWFpbC5jb20+","inReplyToHeader":"PGtwaWFtcSttNGEyQGVHcm91cHMuY29tPg==","referencesHeader":"PGtwaWFtcSttNGEyQGVHcm91cHMuY29tPg=="},"prevInTopic":71623,"nextInTopic":71625,"prevInTime":71623,"nextInTime":71625,"topicId":71623,"numMessagesInTopic":0,"msgSnippet":"-=-Short of buying him a ticket to the upcoming conference in Ashford (he may or may not attend though) -=- Honestly, I think that may be one of the best","messageBody":"<div id=\"ygrps-yiv-769849008\">-=-Short of buying him a ticket to the upcoming conference in Ashford (he may or may not attend though) -=-<br/>\n<br/>\nHonestly, I think that may be one of the best things you can do. <br/>\n<br/>\nJames Daniel will be speaking at the conference and he&#39;s quite the impressive dad. He graduated with a Maths degree from Cambridge University and is unschooling 8 year old Adam, with his wife Julie. The Daniels are one of my favourite families - they are kind, fun and great unschooling advocates (I know them in real life). <br/>\n<br/>\nI think hearing an unschooling dad sharing his experiences will be hugely helpful to your husband. If he is not interested in attending the entire conference, maybe just ask if he&#39;d be willing to go to a couple of talks. If he can be there for the talks given by Sandra, Joyce and James, it might be enough to get him interested.<br/>\n<br/>\nHere&#39;s more information on James: www.lttl.org.uk/jamesdaniel.html<br/>\n<br/>\n-=- but is there a video out there that can get him hooked and searching for more? -=- <br/>\n<br/>\nMaybe he would like this short video: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.euronews.com/2012/03/14/unschooling-the-new-class-of-learning/#.T2nbpnjYZWY.facebook\">http://www.euronews.com/2012/03/14/unschooling-the-new-class-of-learning/#.T2nbpnjYZWY.facebook</a><br/>\n<br/>\nRippy<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":265768694,"authorName":"jacharakis","from":"&quot;jacharakis&quot; &lt;jacharakis@...&gt;","profile":"jacharakis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"How to Introduce The Unschooling Concept","postDate":"1371319834","msgId":71623,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtwaWFtcSttNGEyQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":71624,"prevInTime":71622,"nextInTime":71624,"topicId":71623,"numMessagesInTopic":0,"msgSnippet":"My first post here, been reading a little and trying a little up to now, and I m seeing encouraging results in my 32 month old son whom we intend to home","messageBody":"<div id=\"ygrps-yiv-1321849182\">My first post here, been reading a little and trying a little up to now, and I&#39;m seeing encouraging results in my 32 month old son whom we intend to home educate and I intend to unschool. <br/>\n<br/>\nMy question is about how to introduce unschooling to my husband and have him fully on board. He&#39;s fine about us home educating, and left it all to me. He said I&#39;ll be doing all the &#39;teaching&#39; (thinking of a structured school at home approach), but I chimed in, saying I&#39;m happy to have this role fall upon me, but that we&#39;d follow our son&#39;s lead and if our son is interested in things he is interested in and he&#39;s able to help facilitate, then it would be great for him to do that, and then we&#39;d be partners. But I have not broached unschooling with him as I really do not know where to start.<br/>\n<br/>\nI feel I ought to do this sooner rather than later, as although he&#39;s wonderful with the boys (he has a 10 year old) and is gewnerally more peaceful and responsive, during times of stress he tends to be very curt and abrupt, and I find myself defending our son from him (trying to remind him of the gentler approach, respect for the little one etc), which has resulted in him feeling picked on and under-appreciated. He had an unusual for him outburst a few days ago and since then, I feel I&#39;m treading on eggshells. I must admit that I got too engrossed in the unschooling lifestyle that I just assumed he&#39;d dive in with me, but that obviously isn&#39;t the case. <br/>\n<br/>\nShort of buying him a ticket to the upcoming conference in Ashford (he may or may not attend though), what else can I do? Sending articles does not work well as he won&#39;t even read them. Something we can watch together works well, but is there a video out there that can get him hooked and searching for more?<br/>\n<br/>\nMany thanks,<br/>\n<br/>\nJacquie</div>","specialLinks":[]}],"prevTopicId":71622,"nextTopicId":71638}}