{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"susan","from":"susan &lt;fxfireob@...&gt;","replyTo":"LIST","senderId":"Wurr2WAYjguD4G0LFq4ERQxvJBvCFi3T5xadZyL_G8QYcbeniJ6mxec8n-tPXmqXKhfxW7O7hDNt1KRjTCEECXM","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] intro and comment","postDate":"955974832","msgId":8216,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM4RkIwNDkyLjkwRDY2REU0QGZsYXNoLm5ldD4=","referencesHeader":"PDQuMjllMmJhOS4yNjJjNzk3Y0Bhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":8215,"nextInTime":8217,"topicId":8216,"numMessagesInTopic":0,"msgSnippet":"... well pulling some notion of possible desires out of the air makes the discussion unreal and impossible.  the desire to play piano and the desire to break","messageBody":"<div id=\"ygrps-yiv-561964610\">\n<html>\nhjshaltz@... wrote:\n<blockquote><span title=\"qreply\"> <blockquote TYPE=\"CITE\">I strongly disagree with this :)&nbsp; Unschooling,\nIMO, is indeed about following\n<br>the child&#39;s lead--I like to refer to it as child-led learning.&nbsp;\nHowever,\n<br>parents are not obligated to allow the child to lead anywhere she wants!&nbsp;\nI\n<br>don&#39;t think you&#39;d let your child lead you to give her lessons in arson,\nif\n<br>she were interested in burning things, would you? :)&nbsp; There are\nalways limits\n<br>in the real world.</blockquote>\nwell pulling some notion of possible &#39;desires&#39; out of the air makes the\ndiscussion unreal and impossible.&nbsp; the desire to play piano and the\ndesire to break the law are hardly comparable and removes the whole element\nof safety which is of concern to every parent.&nbsp; imo this statement\nwould fall nicely under teri&#39;s request for fallacies of unschooling &#39;unschoolers\nallow their children to learn anything even if it&#39;s illegal&#39;.&nbsp;&nbsp;\nso my question to you is:&nbsp; have you known of a child who had this\ntype of desire?&nbsp; do you know unschooling parents who willing endanger\nthe lives of their children and the lives of others just because their\nchild expressed an interest?\n<blockquote TYPE=\"CITE\">If my daughter had her way, we&#39;d provide gymnastics,\nswimming, horseback\n<br>riding, piano lessons, and a host of other enriching activities.&nbsp;\nI would\n<br>love to give her ample opportunity for each and every one of these\n<br>activities, but there&#39;s a few problems.&nbsp; One, there&#39;s simply not\nenough time\n<br>to do all these things; Two, we don&#39;t have the money; and Three, she\nis not\n<br>real serious about any of the ones she&#39;s tried so far.</blockquote>\neven holt says that &#39;you don&#39;t have to have every resource for your child&#39;\n(<u>teach your own</u> pg 42) and even if you could there simply is not\nenough time to utilize these resources, but this is somewhat common sense\nand if it&#39;s not it&#39;s quickly learned once in the trenches.&nbsp;&nbsp;\ni would like to add that there is a clear difference between a desire and\na whim,&nbsp; your statement disregards the possibility of a dialog between\nparent and child where this information could easily be obtained.&nbsp;\nimo this dialog is key and is an essential component to unschooling.&nbsp;\neveryone works within their own given limitation (such is the nature of\nlife and since unschooler learn from life this too would become apparent\nif not already experienced e.g. if 2 events are at the same time you have\nchoose one and not the other hence limitation is experienced so most children\nare aware of this reality)&nbsp; but the piano lesson example was given\nin the context of the mother rejecting her own experience of having to\ntake lessons putting this in place of her daughters desire to learn piano.&nbsp;\nno other reason was given (e.i $, safety, whim etc.)\n<blockquote TYPE=\"CITE\">But when she doesn&#39;t follow through on her end\n<br>of the deal--for example, wearing the safety equipment needed, or placing\nher\n<br>hands on the keys like her teachers says--then it&#39;s time to rethink\nthe\n<br>lessons.&nbsp; Periodically we&#39;ll give her a new chance to try if she&#39;s\nstill\n<br>interested, and if she&#39;s willing to be fully cooperative with the\n<br>restrictions inherent in the situation, then lessons will continue\nas long as\n<br>she is cooperative and we can work out any other problems.&nbsp; But\nI&#39;m under no\n<br>obligation to provide opportunities to someone who won&#39;t appreciate\nand make\n<br>the most of them.</blockquote>\nthis is completely personal and between you and your daughter.&nbsp; these\nhurdles, found in all relationships,&nbsp; are typically handles as the\nrelationship warrants,&nbsp; it is not for me to say (unless of course\nyou would ask my opinion:)&nbsp;&nbsp;&nbsp; i&#39;m a firm believer in dialoging\nbut that&#39;s me and my son seems to do very well with this type of relationship.&nbsp;\nwe have a budget (we&#39;re luck to clear $28,000/yr) and all decisions on\nhow we spend our money is made by the whole family and even though rene&#39;\nis only 4 his opinion is always regarded as valid and important (we are\npresently saving up for a chemistry lab and microscope - he had a choice\nbetween this and a video game player, he chose a chem. lab).&nbsp; he also\nknows when it comes to safety it falls in my domain and we discuss it and\nfind a safe way he can reach his goals -&nbsp; we just had to deal w this\nbecause of the chem lab and we&#39;ve had to limit the type of chemicals because\nof his age and dexterity.\n<blockquote TYPE=\"CITE\">If my child had a burning *need* to do something--for\nexample, a child who is\n<br>a serious competitive swimmer, or who finds that music, or animals,\nor\n<br>whatever, is her life, then I would move heaven and earth to provide\nthat\n<br>opportunity.&nbsp; But most kids are just experimenting, which is fine,\nif done\n<br>with the understanding that it not take over the family&#39;s time and\nincome.\n<p>Well, so much for my plan to lurk :)\n<p>Holly\n<br>hjshaltz@...\n<br>HJS Studio and Shaltz Farm Shetlands and Angora Rabbits\n<br>List Mom, FiberFlock@onelist.com and FiberProfessionals@onelist.com</p></blockquote>\ni&#39;m sorry that you interpreted my statement as completely disregarding\nreality.&nbsp; imo unschooling is <u>always</u> in context of real life\nand family - one member&#39;s desires should never always usurp another rights\nand desires.&nbsp; yes we must juggle the desires of all the members of\nthe family (and for some people the state and extended family as well)\nthough this is challenging at times it&#39;s also beautiful when it&#39;s working.\n<p>-susan\n<br>austin,tx\n<br>&#39;unity through diversity&#39;</p></span></blockquote></html>\n</div>","specialLinks":[]}],"prevTopicId":8215,"nextTopicId":8209}}