{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Carolyn Talarr","from":"&quot;Carolyn Talarr&quot; &lt;talarr@...","replyTo":"LIST","senderId":"RgZzyH2lk4qAPgn2iUDI9ySh1dVLd-bcvGDpg74oNUaASUt5Lx47pc0PyoRNSnIkrZ09IfSKtwZpyDbBme4K2_3JR5_XaMOEWVr6HlpB3g","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Intro (LONG)","postDate":"939000125","msgId":3550,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4yMzkuMzU1MC45NTkyNjk3NDJAZUdyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":3549,"nextInTime":3551,"topicId":3550,"numMessagesInTopic":0,"msgSnippet":"Hi Stephanie, We lived in University City, 47th and Pine to be precise.  At least a murder a year on our block, in addition to countless car thefts, muggings,","messageBody":"<div id=\"ygrps-yiv-494587433\">Hi Stephanie,<br/>\n<br/>\nWe lived in University City, 47th and Pine to be precise.  At least a murder<br/>\na year on our block, in addition to countless car thefts, muggings, the<br/>\neveryday occurence of unleashed pit bulls who you know weren&#39;t trained to be<br/>\nsweet and friendly roaming the streets, and oil collecting on our window<br/>\nscreens and probably our lungs blowing up from the refineries in South<br/>\nPhilly.<br/>\n<br/>\nBoring, strange suburban life down here seems like a party every day<br/>\ncompared to that.  Suburban Phila is of course not as bad as where we were.<br/>\nWe even looked in Lansdowne but couldn&#39;t afford anything that wasn&#39;t falling<br/>\napart and would need renovations that we couldn&#39;t afford!<br/>\n<br/>\nEzzo.   Hmmm....Below I&#39;ve copied two articles from another list I&#39;m on,<br/>\nfrom a member in the UK who&#39;s very concerned that Babywise not spread to her<br/>\nshores.  She&#39;s been working with Penelope Leach, actually, on this.<br/>\n<br/>\nThe first is from the London Independent, and the second is just a public<br/>\nrelease, not published anywhere.  But it tells the story of Ezzoing from an<br/>\ninside perspective.  You&#39;ll see.<br/>\n<br/>\nThe Independent (London)<br/>\n<br/>\nSeptember 24, 1999, Friday<br/>\n<br/>\nHEADLINE: SMACK THE CHILD, PRAISE THE LORD!; A CALIFORNIAN COUPLE<br/>\nBELIEVE BABIES SHOULD BE BEATEN INTO OBEDIENCE. NOW THEY ARE BRINGING<br/>\nTHEIR METHODS TO BRITAIN. AND CHILDCARE EXPERT PENELOPE LEACH IS LEADING<br/>\nTHE BATTLE TO KEEP THEM AWAY. BY MARY BRAID<br/>\n<br/>\nGary and Ann Marie Ezzo have caused a storm in the United States with<br/>\ntheir controversial programme for bringing up baby the Lord&#39;s way, with<br/>\ncritics claiming their extreme views have resulted in infants being<br/>\nrushed to hospital suffering from severe malnutrition and dehydration.<br/>\n<br/>\nA month before they wash up on British shores, bringing their strict<br/>\nchild-rearing &quot;first-time obedience&quot; programme in which even babies get<br/>\na taste of corporal punishment, the evangelical couple from California<br/>\nare already being roundly denounced. &quot;I don&#39;t want them over here<br/>\nspeaking to our parents,&quot; says the British child -care expert Penelope<br/>\nLeach, already the Ezzos&#39; arch enemy on the US conference circuit.<br/>\n<br/>\nLeach makes no apologies for sounding draconian about the Ezzos, whom<br/>\nshe condemned this week at a BMA children&#39;s conference in London.<br/>\n&quot;Everyone has a right to their opinion until it amounts to cruelty to<br/>\nbabies,&quot; she says. &quot;What they say should carry a government health<br/>\nwarning.&quot;<br/>\n<br/>\nThe antipathy is mutual. Gary Ezzo claims parental indulgence has<br/>\nbrought &quot;moral decline&quot; to the US and Britain. He sees Leach as the<br/>\ndevil&#39;s agent and will, in turn, denounce her child-centred philosophy<br/>\nat public appearances in Britain next month.<br/>\n<br/>\nThe Ezzos look benign enough, if a touch over-starched. Mrs Ezzo, a<br/>\nnurse, favours chaste Puritan lace collars and her husband a scrubbed,<br/>\nclosely shorn Mormon look. A few years ago the couple were nobodies.<br/>\nThen they started parenting classes at their local church, apparently<br/>\nbecause their own well-disciplined brood was the envy of the<br/>\ncongregation.<br/>\n<br/>\nBusiness has boomed as American parents have clamoured for the Ezzos&#39;<br/>\nheavily Christian teaching materials, and their secular books in which<br/>\nGod gets hardly a mention on the journey to the lucrative wider market.<br/>\nTheir promise of well -behaved children, who sleep through the night,<br/>\nhas created the multimillion-dollar &quot;ministry&quot; Growing Families<br/>\nInternational.<br/>\n<br/>\nIt is easy to see why the Ezzos are reviled by the child-care<br/>\nestablishment. In On Becoming Babywise, a best-seller in the States,<br/>\nthey decree that babies as young as eight months can be taught high-<br/>\nchair manners, such as special Ezzo &quot;signs&quot; for &quot;please&quot; and &quot;thank<br/>\nyou&quot;, and to sit up straight with their arms by their sides. They<br/>\nrecommend that baby&#39;s arms are held in position until the message sinks<br/>\nin.<br/>\n<br/>\nThat the difference between right and wrong cannot yet be appreciated<br/>\nshould not prevent morally degenerative behaviour being stamped out, so<br/>\nparents must stop babies banging on high-chair tables, flipping over<br/>\nplates and wilfully arching their backs, by swotting baby&#39;s hand or<br/>\nsqueezing it until &quot;it causes discomfort&quot;.<br/>\n<br/>\nIt is best to obey at the earliest opportunity for the corporal<br/>\npunishment stakes rise as baby grows.<br/>\n<br/>\nAt 18 months children should be smacked for poor table manners, with a<br/>\nplastic spatula to &quot;inflict pain but not break bones or damage skin<br/>\ntissue&quot;. And if that causes tears, mothers should not worry because &quot;God<br/>\ndid not intervene when His Son cried out on the cross&quot;.<br/>\n<br/>\nThe Ezzos advise parents to put themselves first and make baby fit their<br/>\nroutine, which might explain why their message drifted from the pews to<br/>\nthe mass market.<br/>\n<br/>\n&quot;Teach the child to obey according to the character of true obedience,<br/>\nimmediately, completely, without challenge and without complaint,&quot; they<br/>\nadvise, warning parents not to cuddle too much or to follow the Leach<br/>\nprinciple of feeding on demand unless they want to be slaves to their<br/>\nchildren.<br/>\n<br/>\nThey recommend feeding every four hours and offer a method that promises<br/>\nto have a new baby soon sleeping through the night.<br/>\n<br/>\nThe Ezzos have horrified child development experts by advising mothers<br/>\nto leave even six-month-olds alone in their playpens for up to 30<br/>\nminutes, twice a day. To avoid &quot;unhealthy attachment&quot;, mothers must stay<br/>\nout of sight and persevere even through tears. &quot;(If left to cry) your<br/>\nbaby will not lose brain cells, experience a drop in IQ or have feelings<br/>\nof rejection that will leave him manic depressive at age 30,&quot; states<br/>\nBabywise. Their strictest - and surely most unrealistic - dictum is that<br/>\na child not potty trained by two and a half must be made to take<br/>\nresponsibility for cleaning up its own mess.<br/>\n<br/>\nAccording to Arthur Roderick, of the Maranatha Foundation for Christian<br/>\nEducation Europe, the Swindon-based evangelical organisation which is<br/>\nbringing the Ezzos to Britain, the couple are misunderstood and<br/>\nmisrepresented. He claims to have seen nothing about toddlers cleaning<br/>\nup their own mess or any other extreme advice in the materials the Ezzos<br/>\nhave sent to him. Of allegations that children on the Ezzo programme<br/>\nhave been hospitalised, Mr Roderick says the Ezzos cannot be responsible<br/>\nfor &quot;disciples that go ten times further&quot; than they recommend.<br/>\n<br/>\nThe couple, who say the British press is prejudiced [Praise the Lord<br/>\nthey are!], are not giving interviews before they arrive on 27 October<br/>\nbut Mr Roderick says they have the support of mainstream American<br/>\nevangelical churches. It is not so. The Ezzos have divided evangelical<br/>\nChristians. Their former church has distanced itself from their<br/>\nprogramme and leading Christian figures claim they are distorting<br/>\nscripture. The American Association of Paediatricians has received a<br/>\nflood of complaints about the couple, and is currently investigating<br/>\ntheir methods.<br/>\n<br/>\nEarlier this year The Washington Post printed some worrying messages<br/>\nposted on the Ezzos&#39; website which suggested their programme was being<br/>\nover-zealously applied, especially by those who seem to believe it<br/>\ncarries the Lord&#39;s endorsement. One exasperated mother complained that<br/>\nher two- year-old was still disobedient despite the welts on her bottom.<br/>\n<br/>\nA father said that even after discipline his 13-month-old daughter was<br/>\nstill refusing to give the Ezzo sign for &quot;all done&quot; after eating, and a<br/>\nmother said she was astonished that her six-month-old had begun to arch<br/>\nher back in her high chair. &quot;It&#39;s sad to see that they are really<br/>\nsinners,&quot; she wrote.<br/>\n<br/>\nWhile Leach insists that the most worrying aspect of the Ezzos&#39; theory<br/>\nis that it interferes with normal child development, one mother told The<br/>\nWashington Post that she felt the Ezzo programme had turned her<br/>\noffspring into &quot;Stepford children&quot;. But every attack on the Ezzos brings<br/>\na little flurry of complaints from American parents who claim their<br/>\nadvice transformed a difficult baby.<br/>\n<br/>\nMr Roderick, who supplies teaching materials to 40 independent<br/>\nevangelical schools in Britain and 400 Christian families who teach<br/>\ntheir children at home, is the only distributor in Britain of the Ezzo<br/>\nprogramme. He swears by it. His own nine grandchildren - all under four<br/>\n- are on it and well-behaved. Corporal punishment, he insists, is only a<br/>\nsmall element in the philosophy but a useful deterrent for &quot;a wayward or<br/>\nsinful child&quot;. Without proper discipline, he argues, we will  always<br/>\nhave &quot;13-year-old boys impregnating 12-year-old girls&quot; [Note: recently,<br/>\ntwo 12yo girls were reported pregnant in the UK media. Later, one of the<br/>\nfathers, a 23yo, was prosecuted for actual and statutory rape. The other<br/>\nchild was the product of a violent and abusive father].<br/>\n<br/>\nSurely it is an overreaction to think that the programme, despite its<br/>\npopularity in America, will reach the mainstream in less loopy Britain?<br/>\nLeach warns against complacency. Smacking is still popular with British<br/>\nparents - about 75 per cent still smack the under-ones. Offering a<br/>\nsimple message in complicated times, the Ezzo programme, Leach warns,<br/>\ncould well find a home on deprived, desperate sink estates, especially<br/>\nwhen Tony Blair&#39;s government has such &quot;unreasonable expectations&quot; of<br/>\nparents.<br/>\n<br/>\nRachel Hodgkin, senior policy officer with the National Children&#39;s<br/>\nBureau and a supporter of the anti-corporal punishment campaign Epoch,<br/>\nurges the Government to condemn the Ezzo methods ahead of the visit. &quot;As<br/>\nfar as I can see, it is all about breaking a child&#39;s spirit as early as<br/>\nyou can,&quot; she says. &quot;It should be taken seriously. I think the<br/>\nDepartment of Health should come out and say that this amounts to<br/>\nemotional and physical neglect of babies.&quot;<br/>\n<br/>\n*****************<br/>\n*****************<br/>\n<br/>\nAnd now, the second post, which is graphic and quite disturbing.  I include<br/>\nit partially for Faith, since these folks went into this with the best of<br/>\nintentions and were basically brainwashed to the point that their child<br/>\nalmost died and has serious longterm repercussions.<br/>\n<br/>\nIf you get upset easily (as I did), it&#39;s probably not such a good idea to<br/>\nread it unless you&#39;re seriously considering Ezzoing or seriously concerned<br/>\nabout someone who is...There are a few footnotes and leads to other<br/>\nsites/cites at the end of the article.<br/>\n<br/>\nCarolyn<br/>\n<br/>\n  ------- Forwarded message follows -------<br/>\nMichael & Michelle Hsieh<br/>\n4325 127th Pl. SE<br/>\nEverett, WA 98208<br/>\n(425) 357-8557<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mahsieh@...\">mahsieh@...</a><br/>\n<br/>\nAN OPEN LETTER REGARDING THE DANGERS OF PREPARATION FOR PARENTING<br/>\n(BABYWISE)<br/>\n<br/>\nThe following is Matthew Hsieh&#39;s history as described by his parents,<br/>\nMichael & Michelle Hsieh, April 1999.<br/>\n<br/>\nThe purpose of this letter is to generate public awareness about yet<br/>\nanother child who has surely suffered due to following a Christian<br/>\nparenting program entitled Preparation for Parenting/Preparation for the<br/>\nToddler Years (secular versions marketed in stores as On Becoming<br/>\nBabyWise 1 & 2) by Gary and Anne Marie Ezzo1. We hope that knowledge of<br/>\nhis case can be used to promote existing and future efforts to inform<br/>\ncommunities of the extremely serious dangers associated with following<br/>\nthe Ezzos&#39; program, even in its newest editions. It is our hope that, as<br/>\nawareness grows, popularity for its teachings will diminish to the<br/>\nextent that most churches will no longer promote or choose to be<br/>\naffiliated with them.<br/>\n<br/>\nInitially, we would like to qualify a couple of points. We are both<br/>\ncollege graduates from prestigious universities. Michelle has a business<br/>\ndegree with an accounting concentration from the University of<br/>\nWashington (a rigorous and highly acclaimed program), and Michael has a<br/>\nmechanical engineering degree from the University of California,<br/>\nBerkeley. He currently works in international sales in the high-tech<br/>\nindustry, while Michelle is currently a full-time mom. We point this out<br/>\nto say that we are not uneducated, fly-by-night, take-whatever-we-hear-<br/>\nas-gospel types of people. In fact, we have always prided ourselves on<br/>\npossessing strong common sense, thinking things through in an analytical<br/>\nmanner, and distinguishing between right and wrong. Secondly, we want to<br/>\nstress that the classes we attended were, and still are as of this<br/>\nwriting, the most up-to-date versions of the program. For instance, the<br/>\nprogram&#39;s infant feeding schedules have been revised to suggest feeding<br/>\nevery two-and-one-half to three hours and to incorporate &quot;flexibility,&quot;<br/>\nyet the overall message is indeed the very same as in earlier editions<br/>\n(it was shocking to us to learn what they used to recommend!). Major<br/>\nproblems still exist with following the Ezzos&#39; parenting program.<br/>\n<br/>\nMatthew was born March 26, 1998. Just prior to his birth, we took the<br/>\nfirst parenting class, Preparation for Parenting (Prep), in a series of<br/>\nwhat was promoted to be the most Christian-based, medically accurate<br/>\nparenting information. We took the second class, Preparation for the<br/>\nToddler Years, a couple of months later. As first time parents, we were<br/>\nexcited about applying the principles, thereby raising our children to<br/>\nbe both loving and obedient. The messages were strong and clear, and the<br/>\nboastful claims of thousands of parents correctly applying the<br/>\nprinciples with only optimum results left little room for debate or need<br/>\nto question the material. A couple of times we remember hearing there<br/>\nwas controversy regarding the program, but we were encouraged to dismiss<br/>\nit as coming from parents not using good judgement or incorrectly<br/>\napplying the principles, or as simply &quot;secular&quot; society&#39;s attack due to<br/>\nthe program&#39;s Christian affiliation.<br/>\n<br/>\nOther than his first week, Matthew&#39;s first two months went rather<br/>\nsmoothly. His first week was tough, and, looking back, it should have<br/>\nbeen our first indication not to follow the feeding schedule we were<br/>\ntaught in Prep. We should point out that Matthew was a small newborn.<br/>\nAlthough he was full-term and healthy, he was just under six pounds at<br/>\nbirth, possibly due to low amniotic fluid levels, which, although not<br/>\nsignificantly alarming, prompted the obstetrician to induce labor eleven<br/>\ndays early. (Induction is a relatively common practice, and Matthew was<br/>\nstill considered full-term.) Matthew was born on a Thursday; we were<br/>\ndischarged on Friday, and yet, during that first week of life, we were<br/>\nback at the hospital every day but one. In his third day, he already<br/>\nappeared to be losing a little too much weight too quickly, and he was<br/>\ngetting increasingly jaundiced. His before/after nursing weights<br/>\nindicated that he was getting adequate amounts of breastmilk, even<br/>\nthough he was found to be an extremely efficient eater-normally five<br/>\nminutes on one side, and he was done. However, telling the lactation<br/>\nconsultants and nurses that he was fed every two-and-one-half to three<br/>\nhours gave them the intended message that he was being fed on demand.<br/>\nYet, &quot;we knew better&quot;-demand feeding was unhealthy, and we were using<br/>\nthe Ezzos&#39; parent-directed feeding (PDF) approach.<br/>\n<br/>\nTuesday his jaundice was severe enough to require hospitalization, and<br/>\nwhile there our pediatrician also had mother-baby compatibility tests<br/>\nperformed to see if his body was rejecting Michelle&#39;s milk-tests were<br/>\nnormal. We were sent home the following day but continued on home photo-<br/>\ntherapy for the following couple of days. This required a daily visit<br/>\nfrom a nurse. Michelle remembers them telling us 1) to be sure to feed<br/>\non demand, 2) not to press beyond the two-and-one-half- to three-hour<br/>\nmark, and 3) to monitor (actually document) all feeding times and<br/>\nwet/poopy diapers. Again, we chose to ignore the feeding on demand<br/>\nadvice due to our &quot;medically supported training,&quot; but we did make sure<br/>\nto feed him in the time frame suggested, as this went right along with<br/>\nPDF.<br/>\n<br/>\nIgnoring this advice to feed on demand (or cue) was our FIRST BIG<br/>\nMISTAKE. However, despite our scheduled feedings, Matthew&#39;s jaundice did<br/>\nclear up, and his wet/poopy diapers met the minimum number, although<br/>\nthey did seem fairly &quot;weightless.&quot; As new parents having no experience<br/>\nto compare it against, we assumed infants just eliminated very tiny<br/>\namounts fairly often. Things continued this way through his two month<br/>\nappointment, where his weight registered in the twenty-fifth percentile.<br/>\nAlthough his nursing continued to be short in length, the milk supply<br/>\nseemed adequate, and Matthew was fairly content.<br/>\n<br/>\nThings slowly began to change at this point. Matthew became more<br/>\nfussy/irritable and Michelle found herself always questioning her milk<br/>\nsupply, wondering if he had colic or excess gas (we tried Mylicon Drops)<br/>\nor was just overtired. She began pumping regularly, hopefully to ensure<br/>\nsufficient milk supply, and also tried supplementing with a bottle, but<br/>\nhe repeatedly and vehemently refused, becoming so upset that he would<br/>\neven refuse the breast at that feeding. Many times Michelle&#39;s intuition<br/>\ntold her that Matthew was hungry before the scheduled time, yet she<br/>\nchose to ignore those signals and instead comfort him back to sleep, due<br/>\nto the Ezzos&#39; scheduled feeding philosophies, which had been drilled<br/>\ninto us. Our training specifically said that regularly feeding him<br/>\nsooner than our schedule would interrupt his hunger, digestive, and<br/>\nsleep/wake cycles, causing him to be a snacker, and this would just be<br/>\nunhealthy for him (and us) overall. We had no reason to argue with this<br/>\nsupposed medically-backed advice. On very rare occasions, Michelle would<br/>\nexercise &quot;flexibility&quot; and feed him before &quot;time&quot; due to his<br/>\nuncontrollable cries, but most often he would &quot;submit&quot; to her comforting<br/>\nhim to sleep.<br/>\n<br/>\nIt was at Matthew&#39;s three-month (possibly between three & four months)<br/>\ncheck-up that we discovered his weight, in terms of percentiles, had<br/>\nplummeted. He had dropped off the charts altogether. To say the least,<br/>\nwe were very alarmed, as he was soon diagnosed as &quot;Failure to Thrive&quot;<br/>\n(FTT). Again, when asked about nursing frequencies, we answered every<br/>\ntwo-and-one-half to three hours and of the lack of success in getting<br/>\nhim to supplement with a bottle. We were told that as long as we had<br/>\nalways fed on demand, Michelle&#39;s supply should meet his needs. We were<br/>\ntold to continue as we were, and to come in for frequent weight checks<br/>\nbetween well-child appointments. During this time Matthew&#39;s temperament<br/>\nhad evened out a bit, and once again he seemed fairly content. What we<br/>\nnow believe, in fact, to have been the case was that Matthew had become<br/>\nresigned to taking only small amounts of milk-not nearly close to what<br/>\nhe needed to &quot;thrive.&quot;<br/>\n<br/>\nWe began introducing solid food, which Matthew took to very eagerly. We<br/>\nhoped this would help him to put on some more weight. We again followed<br/>\nthe strict suggestions for proper training from our parenting class, and<br/>\nencouraged Matthew to keep his hands down while we spoon fed him. He did<br/>\nNOT like this, but we were encouraged to persevere, as our training had<br/>\nindicated that he could and would learn to keep his hands down and out<br/>\nof/away from his food.<br/>\n<br/>\nThis was our SECOND BIG MISTAKE. He did, in fact, learn to submit to<br/>\nkeeping his hands down (or our holding them down), but his interest in<br/>\nfood was quickly diminishing. At six months, we knew beyond a doubt that<br/>\nhe was still getting far below adequate amounts of milk (we rented a<br/>\nhighly accurate scale and did before- and after-feeding weights to get<br/>\nhis total intake for twenty-four-hour periods), and felt we had no other<br/>\nchoice but to keep feeding him solids as well. His growth had not<br/>\nimproved, and he was still off the charts.<br/>\n<br/>\nMore and more, Matthew was losing interest in nursing, while still<br/>\nrefusing outside supplementation by bottle or cup. It was obvious that<br/>\nnursing was not a &quot;comfort&quot; to him, as Michelle had always read and<br/>\nheard it to be for other babies (a trust issue). It was increasingly<br/>\ncommon for him to arch his back and display other obvious signs that he<br/>\ndid not want to nurse any longer-just a couple of minutes every four<br/>\nhours or so, and he had enough. His back arching was interpreted as a<br/>\npossible sign of acid reflux, so we tried Zantac but experienced no<br/>\nchange in behavior.<br/>\n<br/>\nIf we had rigidly been following the Ezzos&#39; advice in this scenario, we<br/>\nwould have punished him for his defiant arching. However, Michelle was<br/>\nunwilling to punish Matthew for this, in fear that it would cause him to<br/>\nreject nourishment even more. At this time (still about six months)<br/>\nMichelle was placed on Metaclopramide, a generic form of Reglin, to<br/>\nincrease her milk supply. It worked wonders. It was obvious through<br/>\npumping that she now had plenty of milk. However, Matthew&#39;s behavior<br/>\nabout nursing did not change. For so long he had resigned himself to<br/>\nsmall amounts, we believe he had learned to feel full on that<br/>\ninsufficient amount of milk.<br/>\n<br/>\nThings continued like this until Matthew was nine-and-one-half months<br/>\nold. He was learning up through this time to supplement breastfeeding by<br/>\ntaking formula from a cup, but again, extremely small amounts of maybe<br/>\nan ounce or two. His spoon-fed and fingerfoods were, however, on the<br/>\ndecline to the point where he would refuse to swallow the spoon-fed food<br/>\nwe did get in, and wanted nothing to do with fingerfoods. Then, within a<br/>\ntwo-day period, Matthew stopped nursing altogether (apparently due to<br/>\nMichelle becoming pregnant, which changes breastmilk flavor). Over the<br/>\nnext week he became increasingly dehydrated, with a fever above 103-104<br/>\ndegrees. He would take perhaps eight ounces of formula over the whole<br/>\nday, and, still to his dislike, we continued to spoon feed him until he<br/>\nwould protest too loudly or stop swallowing. We felt we had no choice<br/>\nbut to push the baby foods, as we were so concerned with his lack of<br/>\nformula intake. With his continued rapid decline in<br/>\nenergy/health/weight, he was admitted to Children&#39;s Hospital to begin<br/>\nnaso-gastric (NG) tube feedings. He was released from the hospital after<br/>\n4 days but has remained on the NG tube.<br/>\n<br/>\nTo say the least, these last months with him on the NG tube have been<br/>\nthe hardest ever. There were times that he was throwing up so much we<br/>\ndidn&#39;t know if he would make it. However, with the proper amounts of<br/>\nnourishment, his weight has begun to climb dramatically, along with his<br/>\nenergy and disposition. At the beginning of the tube feedings, he was<br/>\nalmost ten months old and weighed a mere fourteen pounds, eleven ounces.<br/>\n(If he had continued following the curve he set in his first couple of<br/>\nmonths, he would&#39;ve been just shy of 20lbs at this point.) At twelve<br/>\nmonths, he showed significant progress, weighing in at a wonderful<br/>\neighteen pounds (still off the charts, but getting closer).<br/>\n<br/>\nDuring this time, we spent a lot of time reflecting on what brought a<br/>\nperfectly healthy baby boy to this state of complete food<br/>\naversion/infant anorexia. He has undergone every test (a grueling<br/>\nprocess) to rule out medical problems, which left us with an unexplained<br/>\n&quot;behavioral&quot; diagnosis. It was then that a chance reading of an article<br/>\nwarning against Babywise in a local paper led Michelle to do a little<br/>\nmore research into the Ezzos&#39; parenting program that we had been so sold<br/>\non.<br/>\n<br/>\nWhat we found was astonishing. Matthew is just one of hundreds who have<br/>\nbeen diagnosed with improper weight gain or &quot;Failure to Thrive&quot;<br/>\nassociated with this program. We were not just looking for somewhere to<br/>\nput the blame. We had complete respect for the Ezzos and their methods.<br/>\nFriends have followed through with the program with only &quot;success.&quot; In<br/>\nour hearts, we just knew, as we looked back over his history, analyzed<br/>\nmedical reports and other articles, that this program indeed was the<br/>\nsignificant reason for his problems.<br/>\n<br/>\nWe cannot begin to explain the feelings of anger, guilt, and remorse<br/>\nthat accompany the realization that due to some very improper and<br/>\nunsound medical advice and child-rearing techniques, our son has had to<br/>\nendure so much. &quot;Unpleasant&quot; doesn&#39;t even come close to describing how<br/>\nit feels to force this unnatural tube down our son&#39;s nose as he is held<br/>\nthere screaming, only to have to do it again if he pulls it out or,<br/>\nworse, throws it up. And to think that it has been recommended and is<br/>\nquite probable that we will have to proceed with the invasive surgery<br/>\nfor the more permanent stomach tube.<br/>\n<br/>\nIt is our firm opinion that the Ezzos lack the background and,<br/>\ntherefore, the authority to be preaching about step-by-step methods for<br/>\nraising an infant into a thriving toddler. They allow no room for<br/>\nindividual temperament, size (premies, low birth weight babies, etc.),<br/>\nstomach capacity and digestion speed, along with a variety of other<br/>\nfactors. When their program doesn&#39;t work just right, or they are<br/>\nnotified of cases of low weight gain, the Ezzos immediately seem to<br/>\nattribute it to the parents (a guilt trip) for either not following<br/>\nteachings correctly, or following them too rigidly, which is<br/>\ncontradictory. It has been proven that there is a 300% variation among<br/>\nmothers for storage capacity of breastmilk2. Those with larger<br/>\ncapacities can more often nurse at longer intervals, whereas women with<br/>\nsmaller capacities need to nurse much more frequently. Most importantly,<br/>\nit was noted that all women in these studies had the ability to produce<br/>\nplenty of milk over twenty-four hours; what varied was the maximum<br/>\namount they could deliver at one sitting. It is also known that if an<br/>\ninfant is fed on demand, more appropriately titled &quot;cue feeding,&quot; during<br/>\nthe first couple of months, the mother is much more likely to establish<br/>\nappropriate milk quantities. We were taught to ignore those &quot;cues.&quot; Yes,<br/>\nwe were told to incorporate some &quot;flexibility&quot; when the child was<br/>\nobviously hungry (like crying to be fed), or when it was to suit our own<br/>\nneeds. However, the Ezzos&#39; definition of demand feeding as feeding a<br/>\nbaby only when it cries is simply wrong. In fact, demand feeding is<br/>\nactually recognizing the child&#39;s hunger cues (before crying, as crying<br/>\nis often a late sign of hunger3) and feeding them accordingly. We<br/>\nremember those cues vividly, and yet ignored them and tried to pacify<br/>\nMatthew in other ways until his &quot;appropriate&quot; feeding time. How very<br/>\nsadly wrong we were.<br/>\n<br/>\nHow obviously wrong we were again to choose to follow the seemingly<br/>\nmedical and biblical advice of the Ezzos in Preparation for the Toddler<br/>\nYears. Here we were taught to teach our child appropriate &quot;highchair<br/>\nmanners&quot; of holding his hands down while he was being fed, and again it<br/>\nwas said all children can learn obedience in this area. Health and<br/>\nmedical professionals in the feeding therapy arena would all say this is<br/>\nactually one of the worst things one can do. A child naturally wants to<br/>\ntouch, experiment, etc.-this is a developmental stage/activity all<br/>\nchildren should be allowed to experiment with. Is avoiding a messy floor<br/>\nor table to teach compliance worth the possible costs? Yes, some infants<br/>\nand maybe even most will learn to be happy to let you hold their hands<br/>\ndown while spoon feeding and then to let them experiment after with<br/>\nfinger foods. But, it can be argued, is this really success? Or, is<br/>\nsuccess worth the possible cost of later food aversion? Let us tell you,<br/>\nit most definitely is not! We remember heartily laughing at a friend<br/>\nwho, having not taken the parenting program offered by the Ezzos, often<br/>\nhad to give her six-month-old a bath after a feeding. &quot;How do you keep<br/>\nhim from exploring with the food and keep it out of his hair?&quot; she would<br/>\nask. We would simply think how much extra work she was creating for<br/>\nherself by allowing her child to be, as the Ezzos might describe, &quot;out<br/>\nof control and sinful.&quot; Her child is now a healthy, well-behaved one-<br/>\nyear-old, and that laugh was sadly at our own expense.<br/>\n<br/>\nSo, did we have success with the parenting program? Obviously not. Do<br/>\nothers have success? Some think they do, as their children learn to be<br/>\nfed on schedules, sleep through the night, and otherwise be &quot;obedient.&quot;<br/>\nHowever, is there a long term cost of this obedience? Have bond and<br/>\ntrust areas been unknowingly damaged? We really wonder. There are plenty<br/>\nof good parenting books and classes, but any one of those that comes<br/>\nacross as if theirs is the only good way (for it is God&#39;s way, right?),<br/>\nnot only has a lot of nerve but should be questioned in other areas as<br/>\nwell. If readers take the time to do this, we are confident that they<br/>\nwill find not only that many of the Ezzos&#39; ideas on parenting are being<br/>\nwidely questioned as unreliable and outright wrong, but that deeper<br/>\nissues of integrity, accountability, and honesty are also in question.<br/>\nAnd, contrary to what we were told about &quot;secular&quot; criticism, much of<br/>\nthe questioning has come from within the Christian community.<br/>\n<br/>\nPlease, don&#39;t just take our word for it. Do your own research. When you<br/>\nare finished, we believe you will draw the same conclusions we have. We<br/>\nthought we were following sound parenting information and doing what was<br/>\nproclaimed to be in the best interest of our son. We could not have been<br/>\nmore wrong, and we will always live with that knowledge. We now believe<br/>\nnursing on demand, especially in the early months of life, is among the<br/>\nmost critical things one can do for the long-term health and well-being<br/>\nof their child. The harm that has been associated with the Ezzos&#39;<br/>\nparent-directed feeding schedules is not always easily undone, and is<br/>\nsimply not worth the potential risks. No other child or parents deserve<br/>\nto endure what we have suffered.<br/>\n<br/>\nIt is our sincere prayer that as awareness of the controversies and<br/>\nproblems with the Ezzos&#39; Preparation for Parenting and Preparation for<br/>\nthe Toddler Years (On Becoming BabyWise, books 1 & 2) programs<br/>\nincreases, the followers will decrease.<br/>\nFor more information, you may contact us at the address, phone number,<br/>\nor e-mail given below.  Here is also a short list of the many<br/>\narticles/commentaries regarding the Ezzos&#39; parenting programs.  A full<br/>\nbibliography of information relating to this subject may be found at the<br/>\nfollowing website:  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.mailing-list.net/redrhino/Ezzo/Files.html\">http://www.mailing-list.net/redrhino/Ezzo/Files.html</a><br/>\n<br/>\nMichael & Michelle Hsieh<br/>\n4235 127th Pl. SE<br/>\nEverett, WA  98208<br/>\n(425) 357-8557<br/>\n<br/>\n* &quot;Babies in Danger?&quot; by Jenny Deam, Ladies Home Journal, April, 1999,<br/>\npp. 102, 104, 106, 189.<br/>\n<br/>\n* &quot;Getting Wise to &#39;Babywise,&#39;&quot; by Katie Allison Granju, Salon, August<br/>\n6, 1998.  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.salonmagazine.com/MWT/feature/1998/08/cov_06feature\">http://www.salonmagazine.com/MWT/feature/1998/08/cov_06feature</a><br/>\n.html<br/>\n<br/>\n* &quot;More than a Parenting Ministry: The Cultic Characteristics of Growing<br/>\nFamilies International,&quot; by Kathleen Terner and Elliot Miller, Christian<br/>\nResearch Journal, April-June 1998, pp. 11-19, 27, 43-45.  Synopsis and<br/>\nordering information: http: //www.fix.net/~rprewett/CRI.html Publisher:<br/>\nChristian Research Institute, (888) 7000-CRI, <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.equip.org\">http://www.equip.org</a><br/>\n<br/>\n* &quot;Babywise advice linked to dehydration, failure to thrive,&quot; by Matthew<br/>\nAney, MD, AAP News, Volume 14, No. 4, April 1998, p. 21<br/>\n<br/>\n* &quot;Examining the Evidence for Cue Feeding of Breastfed Infants,&quot; by Lisa<br/>\nMarasco, BA, IBCLC and Jan Barger, MA, RN, IBCLC.  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.fix.net/~r\">http://www.fix.net/~r</a><br/>\nprewett/evidence.html<br/>\n<br/>\n1 The BabyWise books list Gary Ezzo and Robert Bucknam, M.D., as<br/>\nauthors, but their content is virtually the same as Gary and Anne Marie<br/>\nEzzos&#39; books Preparation for Parenting and Preparation for the Toddler<br/>\nYears, with religious references removed.<br/>\n2 See &quot;Examining the Evidence for Cue feeding of Breastfed Infants&quot; by<br/>\nLisa Marasco, BA, IBCLC, and Jan Barger, MA, RN, IBCLC at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.fix\">http://www.fix</a><br/>\n.net/~rprewett/evidence.html.<br/>\n3 See &quot;Breastfeeding and the Use of Human Milk (RE9729),&quot; the December<br/>\n1997 statement of the American Academy of Pediatrics.<br/>\n--</div>","specialLinks":[]}],"prevTopicId":3484,"nextTopicId":3557}}