{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"the Australian article","postDate":"1125320953","msgId":22933,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFjMi4yZmI2NjI5OC4zMDQ0NjJmOUBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":22932,"nextInTime":22934,"topicId":22933,"numMessagesInTopic":0,"msgSnippet":"I don t have the reference.    It was sent to me whole from someone who got it whole.   Sorry. I would have just left a link and respected copyright and all,","messageBody":"<div id=\"ygrps-yiv-1983964635\">I don&#39;t have the reference.    It was sent to me whole from someone who got <br/>\nit whole.   Sorry.<br/>\nI would have just left a link and respected copyright and all, but I don&#39;t <br/>\nhave a link and Google won&#39;t find something that came out today.   I&#39;ll see if I <br/>\ncan find it from the icon address, but in the meantime, here it is (AND I <br/>\ndon&#39;t know the name of the article).     (Thanks, Susan, for sending it to me.)<br/>\n<br/>\n<br/>\nBy David Stonehouse<br/>\nAugust 27, 2005<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://smh.com.au/technology/icon/\">http://smh.com.au/technology/icon/</a>&gt;Icon<br/>\n<br/>\n<br/>\nPage Tools<br/>\n<br/>\nIt was an awakening for American writer Steven Johnson - just a hint of the<br/>\neducational power of video games. Johnson was whizzing his seven-year-old<br/>\nnephew through a tour of SimCity 2000, a top-selling game that allows<br/>\nplayers to build virtual cities on their computers.<br/>\n<br/>\nIt was just a 20-minute introduction - a chance for Johnson to show off<br/>\nwhat he had achieved in building an urban empire. But when he expressed<br/>\nfrustration at not being able to revive a dilapidated industrial area, the<br/>\nyoungster&#39;s reply astounded him: &quot;I think you need to lower your industrial<br/>\ntax rates.&quot;<br/>\n<br/>\nReflecting on that years later, Johnson could not help but think that if<br/>\nhis nephew had been in some urban studies class instead, he would have been<br/>\nnodding off. If there was a moment that helped convince him video games can<br/>\nenrich young minds, this was one. &quot;He was learning in spite of himself,&quot;<br/>\nJohnson says.<br/>\n<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.stevenberlinjohnson.com/\">http://www.stevenberlinjohnson.com/</a>&gt;Johnson went on to write a book that<br/>\ndares to suggest that video games are actually good for your kids. Recently<br/>\nreleased in Australia, Everything Bad Is Good for You: How Today&#39;s Popular<br/>\nCulture Is Actually Making Us Smarter contends that not only is gaming<br/>\nbeneficial but so is popular television.<br/>\nAdvertisementAdvertisement<br/>\n<br/>\n&quot;The most debased forms of mass diversion - video games and violent<br/>\ntelevision dramas and juvenile sitcoms - turn out to be nutritional after<br/>\nall,&quot; Johnson says in the book.<br/>\n<br/>\nThe writer, who lives in New York, rejects the notion that his beliefs have<br/>\nmade him public enemy No.1 with parents. &quot;I&#39;ve had a lot of parents come up<br/>\nto me and say, &#39;I appreciate this because one of my favourite memories in<br/>\nthe last couple of years with my kids is sitting around playing Legends of<br/>\nZelda or Sims together for a couple of weeks and it was a really great. It<br/>\nwas amazing how good they were at the game - and I learned what it is they<br/>\nwere doing.&quot;<br/>\n<br/>\nIn the book, and in a piece he wrote for the July issue of the science<br/>\nmagazine &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.discover.com/\">http://www.discover.com/</a>&gt;Discover, he presents the evidence as to<br/>\nwhy video games are not such a bad influence.<br/>\n<br/>\nHe proffers scientific studies carried out over the past decade that show<br/>\ngamers can be faster at visual recognition, can condition their brains to<br/>\nuse less energy and can even be more social, confident and comfortable in<br/>\nproblem-solving than those who don&#39;t play.<br/>\n<br/>\nJohnson is such a believer in the enriching powers of video games that he&#39;d<br/>\nlike to see them come with a &quot;cognitive challenge&quot; rating alongside ratings<br/>\nfor violence and language so parents are advised on their mental stimulation.<br/>\n<br/>\nVideo games have come under intense scrutiny after a gamer discovered the<br/>\npopular title Grand Theft Auto: San Andreas contains hidden sex scenes.<br/>\nHowever, these are only accessible after downloading and installing<br/>\nseparate computer code. The episode led to<br/>\n&lt;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://smh.com.au/news/breaking/popular-game-pulled-from-sale/2005/07/29/1122144013522.html\">http://smh.com.au/news/breaking/popular-game-pulled-from-sale/2005/07/29/1122144013522.html</a>&gt;an<br/>\noutright ban of the sale of the game in Australia and an adults-only R<br/>\nrating in the US.<br/>\n<br/>\nThe game was already well known for its crime-and-prostitution-riddled<br/>\nthemes and for the violence that pervades its scenes. But Johnson dismisses<br/>\nthe debate over games inciting violence and aggression among young people<br/>\nby arguing they have led to a decrease in violent juvenile crime.<br/>\n<br/>\nAs evidence, he cites the Child Well-Being Index prepared by sociologists<br/>\nat Duke University in North Carolina. The latest index, released in March,<br/>\nshows violent crime amongst teens and adolescents in the US has plunged by<br/>\nalmost two-thirds since 1975 - to less than 10 juveniles per 1000 people.<br/>\n<br/>\n&quot;If you look just at something like Grand Theft Auto - the primary crime<br/>\nyou commit in GTA is car jacking, right? You run in and throw somebody out<br/>\nof their car and you jump in their car. And since Grand Theft Auto came<br/>\nout, car jacking has dropped in half,&quot; he says.<br/>\n<br/>\n&quot;We talk about crimes like car jacking as thrill crimes, right? People are<br/>\ndoing it not because they have any kind of dire economic need but because<br/>\nthey are showing off - jumping into a car and intimidating someone and<br/>\nthrowing them out and racing around in a car. And it is entirely possible<br/>\nthat kids now get those thrills from video games.<br/>\n<br/>\n&quot;They don&#39;t need to actually carjack people the way that they needed to 10<br/>\nor 15 years ago because the games are so accurate in their simulations. So<br/>\nit may well be that video games function as a kind of a safety valve - they<br/>\nlet kids who would otherwise be doing violent things for the thrill of it<br/>\nget out those kind of feelings sitting at home at a screen.&quot;<br/>\n<br/>\nJane Healy, an educational psychologist in Colorado, is much more wary.<br/>\nHealy isn&#39;t against video games but she is concerned about overuse and an<br/>\nincreasing reliance on computers in schools. The author of Failure to<br/>\nConnect: How Computers Affect Our Children&#39;s Minds, she argues that<br/>\nchildren have to be supervised properly both at home and at school to make<br/>\nsure they are, indeed, learning and don&#39;t fall into dangerous territory.<br/>\n<br/>\n&quot;The bottom line is parents have to be on top of this. This is not a benign<br/>\ntechnology. You are sending your kids out into what is a potentially bad<br/>\nneighbourhood when you let them use a computer, and it is up to you to make<br/>\nsure they don&#39;t wander into the wrong places and do the wrong things,&quot; she<br/>\nsays.<br/>\n<br/>\n&quot;These are questions that have never before been considered by parents.<br/>\nToday&#39;s parents are the pioneers. The kids are the ones that are going to<br/>\nsuffer the outcome. There is a cardinal rule to be developed here: it&#39;s to<br/>\nbe cautious - this could be dangerous stuff; it can also be useful. It is<br/>\nup to you to try to draw the line.&quot;<br/>\n<br/>\nThe problem for avid believers such as Johnson is that the research has yet<br/>\nto be done to support his theory or look at what other benefits games and<br/>\nsimulations can bring to youngsters. &quot;This is this wonderful, mostly<br/>\nunexplored area of research: are the lessons learned carried over into the<br/>\nreal world?&quot; says Mark Pesce, a lecturer of interactive media at the<br/>\nAustralian Film Television and Radio School and author of<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://playfulworld.com/\">http://playfulworld.com/</a>&gt;The Playful World: How Technology is Transforming<br/>\nOur Imagination.<br/>\n<br/>\n&quot;We train pilots in simulations so they can carry those lessons over into<br/>\nthe real world. We even train army personnel in simulations so they can<br/>\ncarry those lessons over to the real world. Are our children carrying those<br/>\nlessons over into the real world? That&#39;s an open question. I don&#39;t think<br/>\nanybody knows the answer to that.&quot;<br/>\n<br/>\nJames Paul Gee, a pioneer in video-game research at the University of<br/>\nWisconsin, says the field is still so new nobody can prove anything. &quot;It<br/>\nshows that games can improve your problem solving. There is well-known<br/>\nresearch that they improve surgeons&#39; hand-eye co-ordination and skills in<br/>\nsurgery,&quot; he says.<br/>\n<br/>\n&quot;There is research that we have collected that it is good for language<br/>\nacquisition early in school because so many of the games, especially games<br/>\nlike Pokemon, involve very complex language.&quot; The author of What Video<br/>\nGames Have to Teach Us About Learning and Literacy adds: &quot;But it is a new<br/>\nfield so proof right now is a very strong word - nobody can prove anything.&quot;<br/>\n<br/>\nStill, the ideas are moving forward. Since 2002, researchers at the<br/>\nMassachusetts Institute of Technology have been spearheading an effort<br/>\ndubbed Education Arcade to study the educational benefits of games and to<br/>\ndevelop games for schools.<br/>\n<br/>\nAs well as looking at the education use of popular games such as The Sims<br/>\nand Civilization, the group has developed its own games to test on<br/>\nmiddle-school students - science games with names such as Virus and<br/>\nSupercharged!<br/>\n<br/>\nEric Klopfer, one of the researchers, was not sure the students would be<br/>\nable to grasp the science lessons within the games but &quot;the fact that it is<br/>\nthrough a video game makes it a bit more accessible to them and a little<br/>\nbit more eager for them to try out.&quot;<br/>\n<br/>\nElyssebeth Leigh, a senior lecturer at the University of Technology,<br/>\nSydney, believes in the power of video games, too. She says they teach<br/>\nchildren how to interact with technology. And they can help children<br/>\nexperiment with the world around them in a safe way - and learn about<br/>\nchoices, strategy, risks and consequences without leaving the living room.<br/>\n<br/>\nLeigh, who is also general secretary of the International Simulation and<br/>\nGaming Association (www.isaga.info), says parents should take the time to<br/>\ntalk to their children about the games they choose and why they choose them.<br/>\n<br/>\nWired for school<br/>\n<br/>\nVideo games, aka computer simulations, are widely used at<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.cherrybrok-h.schools.nsw.edu.au\">http://www.cherrybrok-h.schools.nsw.edu.au</a>&gt;Cherrybrook Technology High<br/>\nSchool, in northern Sydney. Students use simulations to learn about<br/>\neverything from how a plane flies to the intricacies of artificial<br/>\nintelligence.<br/>\n<br/>\nIt is not an unusual sight to walk into a classroom and see them engaged in<br/>\na flight simulator, a chess game or even programming a computer to bring to<br/>\nlife gaming concepts from their own imaginations.<br/>\n<br/>\nJames Laird, head of IT at the school, says learning through the computer<br/>\nis a natural fit for students today. &quot;There is an ease of learning and<br/>\ndegree of comfort that they get out of it. Given that this is a tool in the<br/>\nenvironment that they live with these days, it is not something they have<br/>\nto think about - they just do it,&quot; he says.<br/>\n<br/>\nBut just because the students are engaged in simulations at school doesn&#39;t<br/>\nmean the lessons are all fun and games. The students are expected to study<br/>\nthe theories and details behind what is unfolding on the screen.<br/>\n<br/>\nIn the chess game they are expected to study the strategies of chess and<br/>\ndeduce whether the computer is relying on textbook moves in its matches<br/>\nagainst human players or acting on its own.<br/>\n<br/>\n&quot;They are having a look at artificial intelligence: is the computer really<br/>\nthinking or is the computer responding using predefined strategies?&quot; Laird<br/>\nsays.<br/>\n<br/>\n&quot;Is it adapting to the game, finding out one strategy isn&#39;t working and<br/>\nswitching over to another strategy to counter what you are doing?&quot;<br/>\n<br/>\nLaird says that other schools are catching on to simulations as teaching<br/>\ntools as well.<br/>\n<br/>\nInfofile<br/>\n<br/>\nThe first known graphics-based computer game was invented in 1952 at the<br/>\nUniversity of Cambridge. A man named A.S. Douglas created a computerised<br/>\nversion of tic-tac-toe called OXO as part of his thesis on human-computer<br/>\ninteraction.<br/>\n<br/>\n<br/>\n%%%%%%%%%%%%%%%%%%%<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":22914,"nextTopicId":22934}}