{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":9,"messages":[{"userId":132859234,"authorName":"Paula Sjogerman","from":"Paula Sjogerman &lt;sjogy@...&gt;","profile":"psjogy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Book proposal call for participants.","postDate":"1256852782","msgId":48193,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIzMjA5MUQ2LTVCMEQtNDc3QS05QUYzLUZCMkQ2RTdGRTUxMEBzYmNnbG9iYWwubmV0Pg==","inReplyToHeader":"PEJCMEQ2NjgxQTgzNTRFOEFBMjFBRkJCMEQyNEI2NkVGQFJvYnluUEM+","referencesHeader":"PGhjY2w2cytkZTV2QGVHcm91cHMuY29tPiA8QkIwRDY2ODFBODM1NEU4QUEyMUFGQkIwRDI0QjY2RUZAUm9ieW5QQz4="},"prevInTopic":48190,"nextInTopic":0,"prevInTime":48192,"nextInTime":48194,"topicId":48153,"numMessagesInTopic":0,"msgSnippet":"... Hey Robyn! I think my family fits what you are looking for - but you can be the final judge of that. My husband, Craig, and I are both theater artists. And","messageBody":"<div id=\"ygrps-yiv-1570370267\">On Oct 29, 2009, at 3:47 PM, Robyn L. Coburn wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If you would like to be part of this book project, will you please  <br/>\n&gt; let me<br/>\n&gt; know, and we can get started at once.<br/>\n<br/>\n<br/>\n </span></blockquote>Hey Robyn! I think my family fits what you are looking for - but you  <br/>\ncan be the final judge of that. My husband, Craig, and I are both  <br/>\ntheater artists. And we always knew that we would be very family  <br/>\ncentered, even before we were totally certain that we would  <br/>\nhomeschool. When I was pregnant with Zoe (who just turned 20!) we  <br/>\nstarted a locally touring children&#39;s theater company. For the next  <br/>\nten years, we all worked and played together. The office was in our  <br/>\nliving room, Zoe (and then Quinn) came with us to rehearsals and  <br/>\nperformances, and sometimes Zoe performed with us.<br/>\n<br/>\nIn 1995, I started a theater program for my homeschool group, which  <br/>\nmy partner and I still run today. This helped fulfill both my  <br/>\nartistic dreams and those of Zoe who has continued to go on to become  <br/>\n(or at least try to become!) a professional. She just graduated from  <br/>\nthe American Academy of Dramatic Arts in Manhattan. We do several  <br/>\nshows a year and assorted classes along the way. Craig&#39;s also taught  <br/>\nsome classes to the homeschool group.<br/>\n<br/>\nWe&#39;ve made all of our professional decisions based on keeping the  <br/>\nkids - and homeschooling - our top priority. That has meant limited  <br/>\ntouring work, no long term theater committments for me, etc. We&#39;re  <br/>\npoor, but still pretty happy &lt;g&gt;.<br/>\n<br/>\nSo if that seems right, let me know what&#39;s next.<br/>\n<br/>\nPaula</div>","specialLinks":[]},{"userId":287815876,"authorName":"Robyn L. Coburn","from":"&quot;Robyn L. Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Book proposal call for participants.","postDate":"1256849238","msgId":48190,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJCMEQ2NjgxQTgzNTRFOEFBMjFBRkJCMEQyNEI2NkVGQFJvYnluUEM+","inReplyToHeader":"PGhjY2w2cytkZTV2QGVHcm91cHMuY29tPg==","referencesHeader":"PGhjY2w2cytkZTV2QGVHcm91cHMuY29tPg=="},"prevInTopic":48188,"nextInTopic":48193,"prevInTime":48189,"nextInTime":48191,"topicId":48153,"numMessagesInTopic":0,"msgSnippet":"I m writing a book currently called Mending, Making and Mothering . It s about living an artistic lifestyle as a family, with case studies from parents who","messageBody":"<div id=\"ygrps-yiv-559272905\">I&#39;m writing a book currently called &quot;Mending, Making and Mothering&quot;. It&#39;s <br/>\nabout living an artistic lifestyle as a family, with case studies from <br/>\nparents who are doing it.<br/>\n<br/>\nI&#39;m interested in documenting how artists combine a continuing arts and <br/>\ncrafts practice with parenting, as well as how they prioritize creativity in <br/>\ntheir family life, schedules and spaces. I&#39;m investigating whether and how <br/>\nparents, especially unschoolers, are able to create a synergistic creative <br/>\narts practice that is part of, perhaps the core of, their learning <br/>\nenvironment. It&#39;s about creativity exercises, practice and philosophy.<br/>\n<br/>\nThe focus will not be on strategies for parents to &quot;carve out&quot; time for <br/>\ntheir art away from their children, or artisan parents compartmentalizing <br/>\ntheir life into private adult art activities versus doing &quot;kid crafts&quot; with <br/>\ntheir children as busywork. It&#39;s not that I think artists don&#39;t need time <br/>\nalone to work, or that the demands of family life and young children will <br/>\nnever conflict with the burning desire just to paint or play or write. What <br/>\nI am interested in is how artistic families manage to resolve these issues <br/>\nwhen the priority is family centered living.<br/>\n<br/>\nCreative living - making, designing, writing, crafting, making music, <br/>\nperforming - can be a lifelong vocation or avocation. I hope in the course <br/>\nof writing the book and compiling to case studies, to give equal time to the <br/>\nactivities of all generations in the family. Part memoir, part how-to, I&#39;ll <br/>\nbe including my own family&#39;s story as well as creative activities and <br/>\ninspirational practices and ideas that seem to work around here.<br/>\n<br/>\nI&#39;m not sure how the chapters will be organized. Possible as a conceit I <br/>\nmight organize it around the four seasons. I want to wait and see if the <br/>\ninformation I gather naturally suggests thematic organizing principles.<br/>\n<br/>\nInitially I will send an email questionnaire to the people who are <br/>\ninterested in participating. Give answers as long or brief as you like. I <br/>\nmay have follow up questions, mostly because I will be learning how to <br/>\nphrase questions best and discovering any holes in my interview.<br/>\n<br/>\nIf you have photos that you would be willing to include that would be <br/>\nwonderful, especially of art work and artists in action. There will be photo <br/>\nreleases for the participants and the photographer, and a contract/release <br/>\nfor using your story.<br/>\n<br/>\nMy plan is to have a blog with the participants profiled and links to your <br/>\nown blogs and especially Etsy or other online stores. Later this blog could <br/>\nbe a collection place for readers&#39; stories of being inspired.<br/>\n<br/>\nAt this time, for the sake of speed, I am thinking of self publishing <br/>\nthrough Lulu - where the copies are printed as they are ordered, and the <br/>\nquality of illustrations looks very high. I&#39;d like to offer all families a <br/>\nfree copy. Can I get back to you on that?<br/>\n<br/>\nIf you would like to be part of this book project, will you please let me <br/>\nknow, and we can get started at once.<br/>\nRobyn L. Coburn<br/>\nwww.Iggyjingles.etsy.com<br/>\nwww.iggyjingles.blogspot.com<br/>\nwww.allthingsdoll.blogspot.com</div>","specialLinks":[]},{"userId":394894674,"authorName":"pilkington.christina","from":"&quot;pilkington.christina&quot; &lt;pilkington.christina@...&gt;","profile":"pilkington.christina","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: 3 year old &quot;Homebody&quot;","postDate":"1256839196","msgId":48188,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhjY2w2cytkZTV2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PENDNzVCREI1LUFFODMtNEQzRC05RDVGLTFBNDI0N0NENDk0OEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":48170,"nextInTopic":48190,"prevInTime":48187,"nextInTime":48189,"topicId":48153,"numMessagesInTopic":0,"msgSnippet":"... This is awesome advice!  I have newly turned three and a half year old boy/girl twins and sometimes it seems like even if I give them a list of ten","messageBody":"<div id=\"ygrps-yiv-1728034405\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Maybe you could just do the thing yourself, and not say &quot;Now let&#39;s do  <br/>\n&gt; this.&quot;  If what you&#39;re doing looks interesting she might watch, or she  <br/>\n&gt; might want to join, or she might think about it a while and want to  <br/>\n&gt; try something similar in a week or a month.<br/>\n<br/>\n </span></blockquote>This is awesome advice!  I have newly turned three and a half year old boy/girl twins and sometimes it seems like even if I give them a list of ten different things to do (when they seem listless and like they want some direction in what to do next), they say no to everything. However, if I take out Legos, or the castle or Playdough, they come right over almost every time to play with me. <br/>\n<br/>\nI try to save house work time when they are really into something they come up with on their own and don&#39;t seem to need me to participate, which means some days things get very cluttered around here!  <br/>\n<br/>\nChris</div>","specialLinks":[]},{"userId":222835102,"authorName":"lalow66","from":"&quot;lalow66&quot; &lt;lalow@...&gt;","profile":"lalow66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: 3 year old &quot;Homebody&quot;","postDate":"1256817764","msgId":48170,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhjYzA5NCsxazlhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQxNGYzNzhjMDkxMDI4MTE0MXMxMjk3ZWEzYWw1NTJhZGUzMWE5ZGUxN2E2QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":48168,"nextInTopic":48188,"prevInTime":48169,"nextInTime":48171,"topicId":48153,"numMessagesInTopic":0,"msgSnippet":"... Often, If I say, do you all want to do such and such they say no.Either because they dont really know what I am talking about or they feel they have done","messageBody":"<div id=\"ygrps-yiv-1496473492\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; I&#39;ve found that just doing the activity, as if I&#39;m doing it for myself works<br/>\n&gt; really well, so I can attest to the good advice. <br/>\n<br/>\n </span></blockquote>Often, If I say, &quot;do you all want to do such and such&quot; they say no.Either because they dont really know what I am talking about or they feel they have done it before. More often I just get the things out and start. Most of the time the activity changes and adapts.  Sometimes, , I am left by myself while they all head off to something else...but it gave them an idea.  I will follow or use that time to empty the dishwasher.<br/>\nYesterday, we pulled out some leaves we had pressed a few days ago.  I origionally thought we could make a picture with them. But we ended up putting paper on them and doing rubbings.  That turned into at my 6 year olds request, rubbings of lots of other things..mostly coins. I wish I had the rubbings my mom did when I was kid. We lived in The Netherlands and she would go to churches and do rubbings of graves stones the like.</div>","specialLinks":[]},{"userId":255246581,"authorName":"kim meltzer","from":"kim meltzer &lt;kimcronin.meltzer@...&gt;","profile":"kimcroninmeltzer","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: 3 year old &quot;Homebody&quot;","postDate":"1256755305","msgId":48168,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxNGYzNzhjMDkxMDI4MTE0MXMxMjk3ZWEzYWw1NTJhZGUzMWE5ZGUxN2E2QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PENDNzVCREI1LUFFODMtNEQzRC05RDVGLTFBNDI0N0NENDk0OEBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGhjOXU1aytiazZoQGVHcm91cHMuY29tPgkgPENDNzVCREI1LUFFODMtNEQzRC05RDVGLTFBNDI0N0NENDk0OEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":48161,"nextInTopic":48170,"prevInTime":48167,"nextInTime":48169,"topicId":48153,"numMessagesInTopic":0,"msgSnippet":"I ve found that just doing the activity, as if I m doing it for myself works really well, so I can attest to the good advice.  My son often doesn t like to","messageBody":"<div id=\"ygrps-yiv-627672665\">I&#39;ve found that just doing the activity, as if I&#39;m doing it for myself works<br/>\nreally well, so I can attest to the good advice.  My son often doesn&#39;t like<br/>\nto work on the project, but loves playing with the finished result of<br/>\nwhatever project I have made.  We read Henry the Sailor Cat by Mary Calhoun<br/>\nyesterday, and I made a tissue paper ocean in a shoe box lid, and a visiting<br/>\nfive year old friend made the little pipe cleaner characters and a whale and<br/>\ndolphin which my three year old was reenacting the story with, today.  He<br/>\njust loves homemade whatevers to pretend with.<br/>\n<br/>\nWe do a lot of storytime, and then story acting.  We&#39;ll put together a<br/>\nlittle stage with sofa cushions or whatever .  My five and three year old<br/>\nreally like doing that. Sometimes we do the acting out with playdough with<br/>\nblocks and little plastic animals as stages, etc.<br/>\n<br/>\nKim<br/>\nBaltimore<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: 3 year old &quot;Homebody&quot;","postDate":"1256752622","msgId":48161,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENDNzVCREI1LUFFODMtNEQzRC05RDVGLTFBNDI0N0NENDk0OEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhjOXU1aytiazZoQGVHcm91cHMuY29tPg==","referencesHeader":"PGhjOXU1aytiazZoQGVHcm91cHMuY29tPg=="},"prevInTopic":48159,"nextInTopic":48168,"prevInTime":48160,"nextInTime":48162,"topicId":48153,"numMessagesInTopic":0,"msgSnippet":"-=-. Lately, it seems that I can hardly even start a fun project without her telling me, no! We are not doing that now, you are doing that wrong, etc etc. =- ","messageBody":"<div id=\"ygrps-yiv-662103045\">-=-. Lately, it seems that I can hardly even start a fun project  <br/>\nwithout her telling me, no! We are not doing that now, you are doing  <br/>\nthat wrong, etc etc. =-<br/>\n<br/>\nMaybe you could just do the thing yourself, and not say &quot;Now let&#39;s do  <br/>\nthis.&quot;  If what you&#39;re doing looks interesting she might watch, or she  <br/>\nmight want to join, or she might think about it a while and want to  <br/>\ntry something similar in a week or a month.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":335633701,"authorName":"DaBreeze21","from":"&quot;DaBreeze21&quot; &lt;susanmay15@...&gt;","profile":"DaBreeze21","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: 3 year old &quot;Homebody&quot;","postDate":"1256750068","msgId":48159,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhjOXU1aytiazZoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDc5QTY5NjI5LTU5NzUtNDE3RS1CMDAwLTE2MUY5NzZGNDE3RUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":48157,"nextInTopic":48161,"prevInTime":48158,"nextInTime":48160,"topicId":48153,"numMessagesInTopic":0,"msgSnippet":"... Thanks for the ideas. Yes I have actually started to think of it in this way -- even to the extent that it might be fun to get in the car and let her tell","messageBody":"<div id=\"ygrps-yiv-1766395151\"><blockquote><span title=\"ireply\">&gt; You could drive without having other people&#39;s houses as a destination,  <br/>\n&gt; maybe.<br/>\n&gt; A picnic, or sightseeing, or to a drive-through for french fries or  <br/>\n&gt; milk shakes (something hard to make at home).<br/>\n&gt; Talking in the car can be The BEST!<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/truck\">http://sandradodd.com/truck</a><br/>\n&gt; <br/>\n&gt; <br/>\n&gt; So maybe don&#39;t think of the car or as getting out as necessarily  <br/>\n&gt; involving other people.<br/>\n&gt; <br/>\n&gt; Do you have a friend who would come to visit you, maybe?<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n<br/>\n </span></blockquote>Thanks for the ideas. Yes I have actually started to think of it in this way -- even to the extent that it might be fun to get in the car and let her tell me which way to go with no destination in mind. My only concern with too long of rides is that the baby isn&#39;t too happy in the car sometimes.<br/>\n<br/>\nOther things rumbling around in my mind (this might jump around a bit) is that today isn&#39;t a typical day because she didn&#39;t get enough sleep. She really just wants to be home. I would prefer a car ride to someplace fun (because she would take a shorter earlier nap than if we just stay home) but she just really doesn&#39;t want to - she actually told me she wants to be home where it is warm and soft like a bed! Also we have had a very busy month with a visit to family and then my husband taking time off and us doing a lot of things so she might just need some home time. So this is only day 3 of us having a car... I need to be patient and give it more time.<br/>\n<br/>\nI love having other people over, but this is another issue I am dealing with. She really does NOT want to have people over and the friend&#39;s I have made since we moved here are all moms/dads with small children too. She does NOT want to share any of her toys. So I have backed off on having people here too.<br/>\n<br/>\nSo, I am really learning to be home with her and my baby and to just love our time together! It isn&#39;t a bad thing; I am more of a get out and see people person than she is, but really am doing quite well with this new way of being... <br/>\n<br/>\nMy final issue then, is how to make being home as &quot;sparkly&quot; as possible while we are at home- which is why I was looking at all of those fun ideas for things to do with young children. Lately, it seems that I can hardly even start a fun project without her telling me, no! We are not doing that now, you are doing that wrong, etc etc. She is definitely her own person and knows what she wants which I think are huge strengths for the most part... I am just learning how to work with them!<br/>\n<br/>\nSusan</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] 3 year old &quot;Homebody&quot;","postDate":"1256747105","msgId":48157,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc5QTY5NjI5LTU5NzUtNDE3RS1CMDAwLTE2MUY5NzZGNDE3RUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhjOW92citwODA0QGVHcm91cHMuY29tPg==","referencesHeader":"PGhjOW92citwODA0QGVHcm91cHMuY29tPg=="},"prevInTopic":48153,"nextInTopic":48159,"prevInTime":48156,"nextInTime":48158,"topicId":48153,"numMessagesInTopic":0,"msgSnippet":"-=-Added to this is that we just got a second car so I feel like we should be using it! (a lot of shoulds ) I know that the important thing is to keep doing","messageBody":"<div id=\"ygrps-yiv-1265781366\">-=-Added to this is that we just got a second car so I feel like we  <br/>\nshould be using it! (a lot of &quot;shoulds&quot;) I know that the important  <br/>\nthing is to keep doing what makes us all happy, but was hoping to hear  <br/>\nsome different perspectives to help me. Thanks!-=-<br/>\n<br/>\nYou could drive without having other people&#39;s houses as a destination,  <br/>\nmaybe.<br/>\nA picnic, or sightseeing, or to a drive-through for french fries or  <br/>\nmilk shakes (something hard to make at home).<br/>\nTalking in the car can be The BEST!<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/truck\">http://sandradodd.com/truck</a><br/>\n<br/>\n<br/>\nSo maybe don&#39;t think of the car or as getting out as necessarily  <br/>\ninvolving other people.<br/>\n<br/>\nDo you have a friend who would come to visit you, maybe?<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":335633701,"authorName":"DaBreeze21","from":"&quot;DaBreeze21&quot; &lt;susanmay15@...&gt;","profile":"DaBreeze21","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"3 year old &quot;Homebody&quot;","postDate":"1256744763","msgId":48153,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhjOW92citwODA0QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":48157,"prevInTime":48152,"nextInTime":48154,"topicId":48153,"numMessagesInTopic":0,"msgSnippet":"I have a 3 yo daughter and a 3 month old son. I feel like I am coming out of the new baby fog :-) I was reviewing the page on Sandra s website from a chat","messageBody":"<div id=\"ygrps-yiv-1893111282\">I have a 3 yo daughter and a 3 month old son. I feel like I am coming out of the &quot;new baby fog&quot; :-)<br/>\n<br/>\nI was reviewing the page on Sandra&#39;s website from a chat about things to do with younger children. <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/youngchildren\">http://sandradodd.com/youngchildren</a><br/>\n<br/>\nI also re-read this page:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/strew/deblist\">http://sandradodd.com/strew/deblist</a><br/>\n<br/>\nI was struck by Joyce&#39;s comment about her daughter loving to be home. That is EXACTLY how my daughter is. For the most part it is fine for all of us to stay home a lot. She loves to watch TV, play computer games, and play with all her toys -- especially now that she is into pretending. <br/>\n<br/>\nHowever, I still get the feeling that it is good for all of us, me especially, to get out a couple of times per week. My husband is working 12 hour days and we live far from family so it can be isolating to be home all day every day (although I have gotten much better at it!) <br/>\n<br/>\nAnyways, I guess I&#39;m struggling with the feeling that we &quot;Should&quot; get out, especially when I know that she does usually enjoy it when we do. One thing that I have learned is that unless she agrees to go somewhere, it will not be fun... so I really try hard to make things sound fun, entice her etc... the problem is that I am not very motivated and once it gets to a certain point in the day I just give up on the idea.  <br/>\n<br/>\nAdded to this is that we just got a second car so I feel like we should be using it! (a lot of &quot;shoulds&quot;) I know that the important thing is to keep doing what makes us all happy, but was hoping to hear some different perspectives to help me. Thanks!<br/>\n<br/>\nSusan</div>","specialLinks":[]}],"prevTopicId":48162,"nextTopicId":48201}}