{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":141316284,"authorName":"pam sorooshian","from":"pam sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: support groups","postDate":"1104742055","msgId":102190,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFENDNBRjBFLTVENjQtMTFEOS1BMEZCLTAwMEE5NTdFRkU0NkBtYWMuY29tPg==","inReplyToHeader":"PDAxMDMyMDA1MDgxMy4yNDg0My40MUQ4RkVCQTAwMEYxMjM1MDAwMDYxMEIyMjA3MDAzMjAxMDIwRTAzMDUwQzA3MDgwMDAzQGNvbWNhc3QubmV0Pg==","referencesHeader":"PDAxMDMyMDA1MDgxMy4yNDg0My40MUQ4RkVCQTAwMEYxMjM1MDAwMDYxMEIyMjA3MDAzMjAxMDIwRTAzMDUwQzA3MDgwMDAzQGNvbWNhc3QubmV0Pg=="},"prevInTopic":102189,"nextInTopic":0,"prevInTime":102189,"nextInTime":102191,"topicId":102189,"numMessagesInTopic":0,"msgSnippet":"... Hang in there, Mary.  I KNOW you re Riley s ally and I m glad he knows it, too. Keep it up! -pam","messageBody":"<div id=\"ygrps-yiv-1920388545\">On Jan 3, 2005, at 12:13 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mfhickman@...\">mfhickman@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Pam, I just reread the Explosive Child in 2 days and what is so <br/>\n&gt; comforting is that I have become Riley&#39;s ally. He has an easy repoire <br/>\n&gt; with me and he knows I am here to help him when he can not see how to <br/>\n&gt; help himself. He has grown alot and he still losses it and explodes <br/>\n&gt; sometimes and kicks or hits or swears. Mostly he stomps off, collects <br/>\n&gt; and comes back.<br/>\n<br/>\n </span></blockquote>Hang in there, Mary.  I KNOW you&#39;re Riley&#39;s ally and I&#39;m glad he knows <br/>\nit, too. Keep it up!<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":202023256,"authorName":"mfhickman@comcast.net","from":"mfhickman@...","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: support groups","postDate":"1104740027","msgId":102189,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxMDMyMDA1MDgxMy4yNDg0My40MUQ4RkVCQTAwMEYxMjM1MDAwMDYxMEIyMjA3MDAzMjAxMDIwRTAzMDUwQzA3MDgwMDAzQGNvbWNhc3QubmV0Pg=="},"prevInTopic":0,"nextInTopic":102190,"prevInTime":102188,"nextInTime":102190,"topicId":102189,"numMessagesInTopic":0,"msgSnippet":"Hi all, My support group has had quite the weekend digesting the tales of my son having the police called after a fight. The mother who called has sent out","messageBody":"<div id=\"ygrps-yiv-1809678154\">Hi all,<br/>\n<br/>\nMy support group has had quite the weekend digesting the tales of my son having the police called after a fight. The mother who called has sent out extremely lengthy notes about the very minute details of our heated exchange and even cross posted onto a county list. oops. Thank you Daron for cutting this off.<br/>\n<br/>\nThe end so far is no personal contact from the mother. I have sent a letter of apology and now 2 other emails, one documenting I want resolution and a request for the boys to get together and at least see eachother eye to eye. I took Sandras advise on this and sent the note to 2 other moms I trust. My paper trail. The other to tell her to stop assuming she knows what goes one in my home. To know I am not in denial of my explosive child and to ask her when if ever she is going to contact me.<br/>\n<br/>\nOn a brighter note, my support group has put up a donations request for help mediating this and have suggested 2 outlets for help, one being a local service, the other a 2-4 session meeting addressing conflict resolution with Ronalle Berry. I am loved out in our community and I know I will find many a shoulder to lean on while Riley grows into the person he will become.<br/>\n<br/>\nPam, I just reread the Explosive Child in 2 days and what is so comforting is that I have become Riley&#39;s ally. He has an easy repoire with me and he knows I am here to help him when he can not see how to help himself. He has grown alot and he still losses it and explodes sometimes and kicks or hits or swears. Mostly he stomps off, collects and comes back.<br/>\n<br/>\nParkdays are a trigger, so we won&#39;t be going for  awhile. My sister&#39;s intense kids are a trigger. They were here today. They triggered Riley after 2 hours. He stood his ground and used his words. He even sat up and said I have told Wyatt 3 times now to stop stopping the top, so I stopped his hands. I am sorry I scared him. Wyatt is 4. Riley yelled loudly, please stop pinching my butt to his 6 year old intense intense cousin. He did not hit, kick, slam or cause bodily harm. He doesn&#39;t want to any more than the rest of us do. He and I high 5&#39;d his excellent way of dealing with his cousins. They did not stay for dinner. My sister knows Riley and she clearly saw he was finished with his visitng cousins. She. my sister, can be a trigger for Riley also as she has yelled in his face following her own frustrations parenting. I have told her what&#39;s up with him and she showed real respect this time and helpful parenting as we stood between our kids helpng them find the words and feelings, and she left before Riley lost it.<br/>\n<br/>\nRiley is asleep now next to his little sister, wrapped arm in arm. I am going to read and read and write and read for the rest of the night. We will stay home, in again tomorrow as my littlest has a cough.<br/>\n<br/>\nMary<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":101964,"nextTopicId":102193}}