{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Miscellany:  a difficult problem, Christmas, clutter... (catch-up post)","postDate":"1104172217","msgId":101792,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyZi41MzU4ZWI5NC4yZjAxYWViOUBhb2wuY29tPg=="},"prevInTopic":101791,"nextInTopic":0,"prevInTime":101791,"nextInTime":101793,"topicId":101791,"numMessagesInTopic":0,"msgSnippet":"In a message dated 12/27/04 11:16:04 AM, crrbuddy@yahoo.com writes: ","messageBody":"<div id=\"ygrps-yiv-538652649\">In a message dated 12/27/04 11:16:04 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:crrbuddy@...\">crrbuddy@...</a> writes:<br/>\n<br/>\n&lt;&lt; DH is also skeptical about communication &quot;techniques,&quot; although we <br/>\n<br/>\ndid have some success with the materials from the Stepfamily <br/>\n<br/>\nAssociation in getting us over one particular rough spot with the <br/>\n<br/>\nex.  She promised to play along, but didn&#39;t, so we were only able to <br/>\n<br/>\nimprove communication with our son when he was with us &gt;&gt;<br/>\n<br/>\nBut the really cool thing about improvement is that ANY improvement is <br/>\nabsolute improvement!<br/>\n<br/>\n-=One thing that impressed me the most about CS and NVC is the fact <br/>\n<br/>\nthat both can be practiced with or without cooperation from others <br/>\n<br/>\n(including dear hubby.)  -=-<br/>\n<br/>\nLike that. &lt;g&gt;<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":90027250,"authorName":"Penne & Buddies","from":"&quot;Penne & Buddies&quot; &lt;crrbuddy@...&gt;","profile":"crrbuddy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Miscellany:  a difficult problem, Christmas, clutter... (catch-up post)","postDate":"1104171193","msgId":101791,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNxcGpicCtobmM1QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":101792,"prevInTime":101790,"nextInTime":101792,"topicId":101791,"numMessagesInTopic":0,"msgSnippet":"Thanks for the fabulous links, Sandra -- yes, those were just what I was asking for (forgot about the truck) and more! Thanks also for clarifying the take on","messageBody":"<div id=\"ygrps-yiv-901896346\">Thanks for the fabulous links, Sandra -- yes, those were just what I <br/>\nwas asking for (forgot about the truck) and more! Thanks also for <br/>\nclarifying the take on dysfunctional aftermath with the reference to <br/>\nAl-Anon.  I wholeheartedly agree that it&#39;s important to find a <br/>\nresource which can help one get to a place where they can see <br/>\nthemselves as empowered individuals and not victims.  Your voice of <br/>\nreason seemed to be one crying in the wilderness for a moment there, <br/>\nbut I&#39;m thrilled to see Steph felt comfortable enough to join in the <br/>\ndiscussion and confirm that she hasn&#39;t fallen prey to a victim <br/>\nmentality.<br/>\n<br/>\nRetrouvaille sounds awesome (take the extra underscore out of the <br/>\naddress line if you click the link in the original message,) but if <br/>\nSteph&#39;s husband is anything like mine -- getting him to a retreat <br/>\n(especially one sponsored as a ministry) would be nigh impossible.  <br/>\nI&#39;m also tandem nursing two toddlers, so even if I had someone to <br/>\ntake the other kids for the weekend, there would be no way to manage <br/>\nit for us.  <br/>\n<br/>\nDH is also skeptical about communication &quot;techniques,&quot; although we <br/>\ndid have some success with the materials from the Stepfamily <br/>\nAssociation in getting us over one particular rough spot with the <br/>\nex.  She promised to play along, but didn&#39;t, so we were only able to <br/>\nimprove communication with our son when he was with us (and he <br/>\neventually ended splitting time between us more frequently to avoid <br/>\ndealing with the problems.)<br/>\n<br/>\nOne thing that impressed me the most about CS and NVC is the fact <br/>\nthat both can be practiced with or without cooperation from others <br/>\n(including dear hubby.)  In some ways they are similar to Al-Anon <br/>\nand other programs focusing on various forms of self-reliance in <br/>\nthat they teach ways to see others&#39; problems separate from our own <br/>\nand work from that mindset.  <br/>\n<br/>\nOTOH, CS & NVC show how to work from the standpoint of unity of <br/>\npurpose and need with the idea that we are basically caring <br/>\nindividuals who have been educated away from a true understanding of <br/>\nour Being.  It is possible to get back to that place and on our way <br/>\nthere, bring others along.  Bottom line is that healing takes place <br/>\nwithin and radiates to touch others&#39; lives without. <br/>\n<br/>\nThese two methods also hold great appeal to me in that they are <br/>\ngeared to the self-taught individual -- the online resources are <br/>\nextensive, powerful, and effective for those who are ready and <br/>\nwilling to put in the effort to make it happen.  Here are the links <br/>\nagain for Steph and anyone else who might want to check it out:<br/>\n<br/>\nHealing Unlimited <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.christianscience.org\">http://www.christianscience.org</a><br/>\n<br/>\nCenter for Nonviolent Communication <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.cnvc.org\">http://www.cnvc.org</a><br/>\n<br/>\nWe&#39;ve been at this marriage & family business for the past twenty <br/>\nyears ourselves -- me helping raise my stepson from the age of three <br/>\nand unschooling with him (part-time in the pre/teen years) and eight <br/>\nof his siblings, the oldest of which is nearly nineteen now.  She <br/>\ngot up in the wee hours on Christmas morn to help me wrap presents <br/>\nfor one of the kids who had bemoaned the fact that we stopped <br/>\nplaying the holiday game years ago.  So, to change the subject...<br/>\n<br/>\nDad picked up an artificial tree and we decorated it all month with <br/>\norigami and other homemade ornaments, strung popcorn, etc.  I picked <br/>\nup some wrapping paper and bows, and we broke out a big bin of <br/>\nstored toys that hadn&#39;t been played with in a long while.  The <br/>\nyounger kids had never seen most of the stuff, and the older kids <br/>\ngot a kick out of unwrapping their old toys to show off to the <br/>\nyounger ones.  Ear to ear grins all around.  <br/>\n<br/>\nDH had picked up a chuck roast, potatoes, and carrots, so I got to <br/>\ntry out the new stoneware bowl for Christmas dinner.  He marinated <br/>\nit the night before, so all I did was plop it in the bowl along with <br/>\nthe veggies, cover it with the baker and let it roast.  Rave reviews <br/>\nfrom my often hard-to-please hubby (second time this week that I&#39;ve <br/>\nreceived a compliment on my cooking -- I&#39;m now officially hooked on <br/>\nstoneware -- those of you who are planning on roast next year are <br/>\ninvited to visit our PC site* and check it out!)<br/>\n<br/>\nNo friends or relatives, just the family.  Grandma always sends <br/>\nmoney in their birthday and Christmas cards (we&#39;ve been long-<br/>\ndistance from relatives who don&#39;t travel our way for most of our <br/>\nmarried life,) so they pick up things throughout the year if they <br/>\nwant something special or there&#39;s a good sale going on.  We started <br/>\ntaking &quot;field trips&quot; and going out for a nice meal on special <br/>\noccasions in lieu of stockpiling for the sake of gift-giving years <br/>\nago.  <br/>\n<br/>\nThe kids make each other happies or present something of their own <br/>\nthat someone has admired, and seem genuinely happy with the way <br/>\nthings work for now.  That is, until the kid who had just about <br/>\ndecided we must be related to the Grinch came along.  When we <br/>\nfinally hit the hay that night, he whispered a sigh of thanks to us <br/>\nfor making a big fuss over Christmas, and I told him I was a little <br/>\nworried that hand-me-down gifts might be a disappointment.  He <br/>\nblithely commented that most of it was all new to him anyway, and <br/>\nall-in-all, it was a really nice surprise.  I love the way <br/>\nunschooling has given us the gift of flexibility and freedom to <br/>\nthink out of the box (pun intended :o)  <br/>\n<br/>\nHappy New Year, Everyone!<br/>\nPenne & the Crew<br/>\n<br/>\n&#39;Tis the Season for Giving from the Heart<br/>\n*<a rel=\"nofollow\" target=\"_blank\" href=\"http://kitchencrew.ardfamilyco-op.net\">http://kitchencrew.ardfamilyco-op.net</a></div>","specialLinks":[]}],"prevTopicId":101789,"nextTopicId":101793}}