{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":66,"messages":[{"userId":99826381,"authorName":"Mary Bianco","from":"&quot;Mary Bianco&quot; &lt;mummyone24@...&gt;","profile":"mummyone24","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: Adult time","postDate":"1034706218","msgId":46438,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYxMjVpZDRpMDZiMXlvdW14VGMwMDAwN2FiZkBob3RtYWlsLmNvbT4="},"prevInTopic":46437,"nextInTopic":46439,"prevInTime":46437,"nextInTime":46439,"topicId":46256,"numMessagesInTopic":0,"msgSnippet":"... ","messageBody":"<div id=\"ygrps-yiv-1606600958\"><blockquote><span title=\"ireply\">&gt;From: &quot;Pam Hartley&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pamhartley@...\">pamhartley@...</a>&gt;<br/>\n<br/>\n </span></blockquote>&lt;&lt;But you see, &quot;I&quot; don&#39;t need to do any of this, so saying &quot;you need&quot;<br/>\nis not relevant for my real life. You also don&#39;t know what the<br/>\nposter you were talking to &quot;needs&quot;.&gt;&gt;<br/>\n<br/>\n<br/>\nAnd again, I don&#39;t &quot;need&quot; to do these things either with my children. I have <br/>\nfound that most parents who let the children have no limits, and by this I <br/>\nreally mean let them have NO limits. Those children do self regulate <br/>\nthemselves. I know of parents who say they don&#39;t restrict and when around <br/>\nthem, I beg to differ. Talking out loud in front of the children or to ones <br/>\npartner about how the children have had enough or maybe should start <br/>\nthinking of stopping whatever they are doing, in my opinion isn&#39;t imposing <br/>\nno restrictions. A parent can easily restrict without actually turning off <br/>\nthe TV and pulling the food away from the child. I also think some parents <br/>\ndon&#39;t give their children the time the children need to know what they want <br/>\nthemselves. It doesnt&#39; come as quick to some kids.<br/>\n<br/>\nI also think if there are other outside negative influences, one should <br/>\n&quot;restrict&quot; those. My in laws are a perfect example. They just don&#39;t see the <br/>\nkids anymore because of what they say. Very harmful stuff in my opinion and <br/>\nmuch worse than unlimited TV and food!<br/>\n<br/>\n<br/>\n<br/>\n&lt;&lt;I am interested in my chldren&#39;s complete health - mental,<br/>\nphysical, emotional. I have seen claims of &quot;health&quot; to excuse<br/>\ncontrol before (he&#39;s not healthy if he eats too much chocolate or<br/>\ndrinks too much milk or watches too much TV or doesn&#39;t go to<br/>\nsleep by 8:30). I don&#39;t believe children are intentionally self-<br/>\ndestructive. I don&#39;t believe that children are incapable of<br/>\nunderstanding what excess sugar or lack of sleep or lack of<br/>\nexercise feels like, and how to avoid those feelings. They might<br/>\nnot &quot;get it&quot; as quickly as Mom would like, but I believe they will get<br/>\nit.<br/>\n<br/>\nI trust my children. I am not looking for reasons to control them,<br/>\nso it turns out they are able and willing to control themselves.<br/>\nThat may be the difference in success or not in &quot;no limits&quot;.&gt;&gt;<br/>\n<br/>\n<br/>\nI totally agree with this also. I don&#39;t see kids as being self destructive <br/>\nbeing raised the way we are speaking of from a young age either. And yes <br/>\nsome do get it much quicker than others. I think talking to them about <br/>\nconsequences and helping them understand them is essential. That I think is <br/>\ngood guidance. And I have found that the more I trust my children, which <br/>\nlately has changed, especially with my oldest school child, the more <br/>\nconfidence I have in them when I see them make the right choices. It&#39;s all <br/>\none great big circle that makes us all happy!!!<br/>\n<br/>\nMary B<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n_________________________________________________________________<br/>\nMSN Photos is the easiest way to share and print your photos: <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://photos.msn.com/support/worldwide.aspx\">http://photos.msn.com/support/worldwide.aspx</a></div>","specialLinks":[]},{"userId":1572768,"authorName":"Stephanie Elms","from":"&quot;Stephanie Elms&quot; &lt;stephanie.elms@...&gt;","profile":"elmsfam","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [Unschooling-dotcom] Re: Adult time","postDate":"1034706090","msgId":46437,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlENkNGOUNFQTc2ODNDNEQ4RjQxNUEzRjU0RDFDMDY2MDEzREM3OENAZHN0cDEuZGVsdGFzb2x1dGlvbnMuY29tPg=="},"prevInTopic":46433,"nextInTopic":46438,"prevInTime":46436,"nextInTime":46438,"topicId":46256,"numMessagesInTopic":0,"msgSnippet":"... If it was immediate harm (like running into the street) then yes I would stop them. Additives in food are not going to kill them today. To be honest with","messageBody":"<div id=\"ygrps-yiv-707209325\"><blockquote><span title=\"ireply\">&gt;   ** You&#39;re saying that if your children were doing something <br/>\n&gt; that could harm them, you wouldn&#39;t step in and restrict them <br/>\n&gt; from doing whatever it is? I assumed all parents would, if <br/>\n&gt; not, then yes, that should be an &quot;I need&quot;. <br/>\n<br/>\n </span></blockquote>If it was immediate harm (like running into the street) then yes I would<br/>\nstop them. Additives in food are not going to kill them today. To be honest<br/>\nwith you, one of the reasons why not limiting junk food appeals to me is<br/>\nbecause I believe that Jason will be *more* open to listening to me when I<br/>\ntalk about healthy eating if I let it be his choice. If I make the decision <br/>\nfor him he will concentrate more on what I am not letting have rather then<br/>\non the why.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; etc. She had a lot of rules, etc, that they had to follow <br/>\n&gt; since they were in her house. They learned that mommy and <br/>\n&gt; nana had very different beliefs and expectations, and they <br/>\n&gt; very often tended to do only what nana wouldn&#39;t allow when we <br/>\n&gt; were at home. Three years of that is a hard habit to break, I <br/>\n&gt; would think. <br/>\n<br/>\n </span></blockquote>Hmmm...then they really have not had free reign to choose what they want.<br/>\nEven though you were not the one restricting, they were still restricted. So<br/>\ncan you really say that you let them choose and all they chose was junk?<br/>\nWhen I recently brought up letting Jason choose his own food, he reminded me<br/>\nof the week when he was around 3 or so when we decided to let him eat all<br/>\nthe junk he wanted. We panicked after a couple of days and reinstituted our limits.<br/>\nHe says that &quot;no limits failed&quot;. But did they really? I honestly don&#39;t think<br/>\nthat we gave it long enough or expected it to work. This time around I am <br/>\nreally do feel it will work. Keeping my fingers crossed!<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;   ** I agree, but how to make a 5 yr old understand that he <br/>\n&gt; can only have one of these cookies every now and then because <br/>\n&gt; they have aspartame (sp?) in them, but he can have these <br/>\n&gt; other cookies all he wants because they only have brown <br/>\n&gt; sugar? I would think it would be much easier all around to <br/>\n<br/>\n </span></blockquote>Actually, I do think that my 5 yo would be able to understand this. I don&#39;t<br/>\nlike him having soda with lots of caffeine or aspartame (in diet drinks).<br/>\nI have told him this and more often then not he chooses the decaffeinated<br/>\nnon-diet drink. If he chooses one with caffeine, I let him have it. I have <br/>\nalso found lately that he is interested in having me read ingredient labels<br/>\nto him and we talk a lot about artificial colorings and the like. And why<br/>\nI like to choose things with the fewest ingredients etc. I think that it is<br/>\nstarting to make sense to him. Time will tell. But I think that if I just <br/>\nrefused to buy him something he would be less likely to listen to me, focusing<br/>\ninstead on what I was not letting him have.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; aspartame can do to him. It&#39;s not a matter of being <br/>\n&gt; self-destructive, it&#39;s a matter of understanding and <br/>\n&gt; comprehending. We also have a very large and long history of <br/>\n&gt; allergies in the family, by keeping away or limiting from <br/>\n&gt; certain foods (peanuts, milk, wheat, etc) I&#39;m hoping to help <br/>\n&gt; them avoid many of the allergies so common in my family. It&#39;s <br/>\n&gt; been proven the later you introduce common allergy-foods, and <br/>\n&gt; the smaller the quantity after introducing them, the risk of <br/>\n&gt; developing an allergy to it decreases by a huge amount. <br/>\n<br/>\n </span></blockquote>I have a good friend whose son has *major* allergies...wheat peanuts,<br/>\ngluten etc. She also has 2 other girls, so there is food he is allergic<br/>\nin the house. Her son is 4 and knows what he can eat and what he can not.<br/>\nEven when he was younger, she could explain to him that it was not good <br/>\nfor him. She makes him special snacks and makes sure to have lots of treats<br/>\nthat he can eat around. It has never been an issue. <br/>\n<br/>\nStephanie E.</div>","specialLinks":[]},{"userId":10294444,"authorName":"Myranda","from":"&quot;Myranda&quot; &lt;myrandab@...&gt;","profile":"randascloudream","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: Adult time","postDate":"1034705296","msgId":46433,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAyZjUwMWMyNzQ3NSRkNmQ1NjRhMCQwMTNmZmVhOUBjb21wdXRlcj4=","referencesHeader":"PGFvaGhrYitoOHMxQGVHcm91cHMuY29tPiA8M0RBQzU0RDcuRDlDMkVCMzFAbGlubWF4LnNhby5hcml6b25hLmVkdT4="},"prevInTopic":46429,"nextInTopic":46437,"prevInTime":46432,"nextInTime":46434,"topicId":46256,"numMessagesInTopic":0,"msgSnippet":"Keep in mind that the effects of certain foods and ingrediants do not present themselves until adulthood - how can young children learn in those cases? How do","messageBody":"<div id=\"ygrps-yiv-1549704478\">Keep in mind that the effects of certain foods and ingrediants do not present themselves until adulthood - how can young children learn in those cases? How do you later explain that &quot;I&#39;m sorry, one possible cause of your (insert health problem here) is because I let you have (insert food or ingrediant here) any time you wanted because that&#39;s what you wanted and I trusted you to know what is best&quot;? Small comfort to a 10 yr old going thru numerous shots for allergy testing or a teenager having kidney stones or a grown child going thru chemo for cancer or any other numerous medical proceedures. I would encourage all parents to do more research into what the dangers are in certain foods, and what the benefits are in other foods. This is one area that by the time a child gets old enough and aware enough to want to look into him or herself, it may be too late for some effects. <br/>\n<br/>\nSo many people breastfeed for the good effects that last throughout the child&#39;s lifetime, why not continue a good, healthy diet for the same reason? <br/>\nMyranda<br/>\n<br/>\n<br/>\n  Hear! Hear! <br/>\n<br/>\n  You know today it is about food, soft drinks, TV. In the fifties it was about<br/>\n  food, soft drinks and germs. Mothers are still concerned about the same<br/>\n  things, they want the best for their children and they don&#39;t know the harm<br/>\n  they can cause by not letting their children learn for themselves. There is no<br/>\n  substitute for experience when learning to make good choices. We can make our<br/>\n  children anxious and nervous and fearful but we cannot teach them to make good<br/>\n  choices by making the choices for them -- they have to learn by personal<br/>\n  experience.<br/>\n<br/>\n  Peggy<br/>\n<br/>\n        Yahoo! Groups Sponsor <br/>\n              ADVERTISEMENT<br/>\n             <br/>\n       <br/>\n       <br/>\n<br/>\n  ~~~~ Don&#39;t forget! If you change topics, change the subject line! ~~~~<br/>\n<br/>\n  If you have questions, concerns or problems with this list, please email the moderator, Joyce Fetteroll (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a>), or the list owner, Helen Hegener (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Editor@...\">HEM-Editor@...</a>).<br/>\n<br/>\n  To unsubscribe from this group, click on the following link or address an email to:<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-unsubscribe@yahoogroups.com\">Unschooling-dotcom-unsubscribe@yahoogroups.com</a> <br/>\n<br/>\n  Visit the Unschooling website: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> <br/>\n<br/>\n  Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1512150,"authorName":"Peggy","from":"Peggy &lt;peggy@...&gt;","profile":"margotapple","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: Adult time","postDate":"1034704087","msgId":46429,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNEQUM1NEQ3LkQ5QzJFQjMxQGxpbm1heC5zYW8uYXJpem9uYS5lZHU+","referencesHeader":"PGFvaGhrYitoOHMxQGVHcm91cHMuY29tPg=="},"prevInTopic":46427,"nextInTopic":46433,"prevInTime":46428,"nextInTime":46430,"topicId":46256,"numMessagesInTopic":0,"msgSnippet":"... Hear! Hear! You know today it is about food, soft drinks, TV. In the fifties it was about food, soft drinks and germs. Mothers are still concerned about","messageBody":"<div id=\"ygrps-yiv-388950180\">Pam wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  I trust my children. I am not looking for reasons to control them, <br/>\n&gt; so it turns out they are able and willing to control themselves. <br/>\n&gt; That may be the difference in success or not in &quot;no limits&quot;.<br/>\n<br/>\n<br/>\n </span></blockquote>Hear! Hear! <br/>\n<br/>\nYou know today it is about food, soft drinks, TV. In the fifties it was about<br/>\nfood, soft drinks and germs. Mothers are still concerned about the same<br/>\nthings, they want the best for their children and they don&#39;t know the harm<br/>\nthey can cause by not letting their children learn for themselves. There is no<br/>\nsubstitute for experience when learning to make good choices. We can make our<br/>\nchildren anxious and nervous and fearful but we cannot teach them to make good<br/>\nchoices by making the choices for them -- they have to learn by personal<br/>\nexperience.<br/>\n<br/>\nPeggy</div>","specialLinks":[]},{"userId":10294444,"authorName":"Myranda","from":"&quot;Myranda&quot; &lt;myrandab@...&gt;","profile":"randascloudream","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: Adult time","postDate":"1034702483","msgId":46427,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAyOTYwMWMyNzQ2ZiQ0YTM2ZWE2MCQwMTNmZmVhOUBjb21wdXRlcj4=","referencesHeader":"PGFvaGhrYitoOHMxQGVHcm91cHMuY29tPg=="},"prevInTopic":46426,"nextInTopic":46429,"prevInTime":46426,"nextInTime":46428,"topicId":46256,"numMessagesInTopic":0,"msgSnippet":"From: Pam Hartley But you see, I don t need to do any of this, so saying you need is not relevant for my real life. You also don t know what the poster you","messageBody":"<div id=\"ygrps-yiv-964992731\">From: Pam Hartley <br/>\n  But you see, &quot;I&quot; don&#39;t need to do any of this, so saying &quot;you need&quot; <br/>\n  is not relevant for my real life. You also don&#39;t know what the <br/>\n  poster you were talking to &quot;needs&quot;.<br/>\n<br/>\n  You might feel that you need to do these things, but in that case <br/>\n  you might say, &quot;I need&quot;.<br/>\n  ** You&#39;re saying that if your children were doing something that could harm them, you wouldn&#39;t step in and restrict them from doing whatever it is? I assumed all parents would, if not, then yes, that should be an &quot;I need&quot;. <br/>\n<br/>\n<br/>\n  Maybe you should not have them at your parents a lot and see <br/>\n  what decisions they would make for themselves with actual <br/>\n  freedom now, instead of the sometimes-freedom they got then.<br/>\n<br/>\n  ** They&#39;re not around them much at all anymore, Just Sunday mornings for church and lunch afterwards, but for three years we were there daily because of my work-at-home job. My mom had the room for a complete office to be set-up, including multiple phone lines and multiple computers, fax, phones, etc. She had a lot of rules, etc, that they had to follow since they were in her house. They learned that mommy and nana had very different beliefs and expectations, and they very often tended to do only what nana wouldn&#39;t allow when we were at home. Three years of that is a hard habit to break, I would think. <br/>\n  I am interested in my chldren&#39;s complete health - mental, <br/>\n  physical, emotional. I have seen claims of &quot;health&quot; to excuse <br/>\n  control before (he&#39;s not healthy if he eats too much chocolate or <br/>\n  drinks too much milk or watches too much TV or doesn&#39;t go to <br/>\n  sleep by 8:30). I don&#39;t believe children are intentionally self-<br/>\n  destructive. I don&#39;t believe that children are incapable of <br/>\n  understanding what excess sugar or lack of sleep or lack of <br/>\n  exercise feels like, and how to avoid those feelings. They might <br/>\n  not &quot;get it&quot; as quickly as Mom would like, but I believe they will get <br/>\n  it.<br/>\n<br/>\n  ** I agree, but how to make a 5 yr old understand that he can only have one of these cookies every now and then because they have aspertine (sp?) in them, but he can have these other cookies all he wants because they only have brown sugar? I would think it would be much easier all around to only keep the cookies with brown sugar in the house until he gets a few years older and can understand the things aspertine can do to him. It&#39;s not a matter of being self-destructive, it&#39;s a matter of understanding and comprehending. We also have a very large and long history of allergies in the family, by keeping away or limiting from certain foods (peanuts, milk, wheat, etc) I&#39;m hoping to help them avoid many of the allergies so common in my family. It&#39;s been proven the later you introduce common allergy-foods, and the smaller the quantity after introducing them, the risk of developing an allergy to it decreases by a huge amount. <br/>\n<br/>\n  I trust my children. I am not looking for reasons to control them, <br/>\n  so it turns out they are able and willing to control themselves. <br/>\n  That may be the difference in success or not in &quot;no limits&quot;.<br/>\n<br/>\n  Pam<br/>\n<br/>\n<br/>\n<br/>\n        Yahoo! Groups Sponsor <br/>\n              ADVERTISEMENT<br/>\n             <br/>\n       <br/>\n       <br/>\n<br/>\n  ~~~~ Don&#39;t forget! If you change topics, change the subject line! ~~~~<br/>\n<br/>\n  If you have questions, concerns or problems with this list, please email the moderator, Joyce Fetteroll (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a>), or the list owner, Helen Hegener (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Editor@...\">HEM-Editor@...</a>).<br/>\n<br/>\n  To unsubscribe from this group, click on the following link or address an email to:<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-unsubscribe@yahoogroups.com\">Unschooling-dotcom-unsubscribe@yahoogroups.com</a> <br/>\n<br/>\n  Visit the Unschooling website: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> <br/>\n<br/>\n  Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2523757,"authorName":"Pam Hartley","from":"&quot;Pam Hartley&quot; &lt;pamhartley@...&gt;","profile":"pdhartley2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Adult time","postDate":"1034701259","msgId":46426,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGFvaGhrYitoOHMxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAxOTkwMWMyNzQ2MCRkNDQ4ODRjMCQwMTNmZmVhOUBjb21wdXRlcj4="},"prevInTopic":46424,"nextInTopic":46427,"prevInTime":46425,"nextInTime":46427,"topicId":46256,"numMessagesInTopic":0,"msgSnippet":"... you need to do while they are too young to make decisions on their own. Supervise is what you need to do so you ll know what s going on. Imposing ","messageBody":"<div id=\"ygrps-yiv-700384058\"><blockquote><span title=\"ireply\">&gt;&gt;No, the words don&#39;t all mean the same thing. Guiding is what <br/>\n </span></blockquote>you need to<br/>\ndo while they are too young to make decisions on their own. <br/>\nSupervise is what<br/>\nyou need to do so you&#39;ll know what&#39;s going on. Imposing <br/>\nrestrictions is what<br/>\nshould be done if they are doing something harmful to <br/>\nthemselves or others and<br/>\n<blockquote><span title=\"ireply\"> &gt;are not willing or able to self-regulate.<br/>\n<br/>\n </span></blockquote>But you see, &quot;I&quot; don&#39;t need to do any of this, so saying &quot;you need&quot; <br/>\nis not relevant for my real life. You also don&#39;t know what the <br/>\nposter you were talking to &quot;needs&quot;.<br/>\n<br/>\nYou might feel that you need to do these things, but in that case <br/>\nyou might say, &quot;I need&quot;.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Mine did have the chance to make the<br/>\n </span></blockquote>choices first, but when all they chose was the &quot;bad&quot; stuff, I <br/>\nimposed some<br/>\nlimits. I&#39;m of the opinion that since they were around my parents <br/>\na lot, and<br/>\nheard a lot about what they could and couldn&#39;t do over there, <br/>\nwhat they should<br/>\nand shouldn&#39;t say, do, etc that they chose to do nothing but those <br/>\nthings at<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;home. Maybe I&#39;m wrong there, but it does seem like it.<br/>\n<br/>\n </span></blockquote>Maybe you should not have them at your parents a lot and see <br/>\nwhat decisions they would make for themselves with actual <br/>\nfreedom now, instead of the sometimes-freedom they got then.<br/>\n<br/>\nI am interested in my chldren&#39;s complete health - mental, <br/>\nphysical, emotional. I have seen claims of &quot;health&quot; to excuse <br/>\ncontrol before (he&#39;s not healthy if he eats too much chocolate or <br/>\ndrinks too much milk or watches too much TV or doesn&#39;t go to <br/>\nsleep by 8:30). I don&#39;t believe children are intentionally self-<br/>\ndestructive. I don&#39;t believe that children are incapable of <br/>\nunderstanding what excess sugar or lack of sleep or lack of <br/>\nexercise feels like, and how to avoid those feelings. They might <br/>\nnot &quot;get it&quot; as quickly as Mom would like, but I believe they will get <br/>\nit.<br/>\n<br/>\nI trust my children. I am not looking for reasons to control them, <br/>\nso it turns out they are able and willing to control themselves. <br/>\nThat may be the difference in success or not in &quot;no limits&quot;.<br/>\n<br/>\nPam</div>","specialLinks":[]},{"userId":2523757,"authorName":"Pam Hartley","from":"&quot;Pam Hartley&quot; &lt;pamhartley@...&gt;","profile":"pdhartley2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Adult time","postDate":"1034700352","msgId":46424,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGFvaGdvMCtqYjg0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwMjQwMWMyNzQ0NiQ1YzBhMzIyMCQwMTNmZmVhOUBjb21wdXRlcj4="},"prevInTopic":46422,"nextInTopic":46426,"prevInTime":46423,"nextInTime":46425,"topicId":46256,"numMessagesInTopic":0,"msgSnippet":"... The idea is to guide, imposing restrictions if necessary, the children toward safe and healthful decisions while young, and gradually let go of the","messageBody":"<div id=\"ygrps-yiv-569469500\">--- In Unschooling-dotcom@y..., &quot;Myranda&quot; &lt;myrandab@b...&gt; <br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Here&#39;s my take on this, someone correct me if I&#39;m wrong! &lt;g&gt; <br/>\n </span></blockquote>The idea is to guide, imposing restrictions if necessary, the <br/>\nchildren toward safe and healthful decisions while young, and <br/>\ngradually let go of the guidance and/or restrictions as they get <br/>\nolder and better able to regulate themselves. <br/>\n<br/>\n:::big snip:::<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; By limiting the choices you have in the house, children will find <br/>\n </span></blockquote>it easier to regulate themselves, and you can gradually add <br/>\nchoices as they get better at it. If a child has 20 new computer <br/>\ngames to play, they&#39;re not going to willingly leave the computer, <br/>\nno matter how tired they get of it. If they have unlimited TV <br/>\nchannels to watch, they&#39;ll always be able to find something to <br/>\nkeep them glued to the TV. If there are 4 different kinds of cola in <br/>\nthe house, but no tea or juice or milk, guess what they&#39;re going to <br/>\ndrink? By limiting choices available, you don&#39;t have to supervise <br/>\nand impose limits yourself half as often. This works for small <br/>\nchildren, but I have no idea how well it would work for older <br/>\nchildren. I&#39;m sure it would work to a certain degree, though. But it <br/>\nwould be much harder to take something away than it is to start <br/>\nout with little and gradually add to it like you can with younger <br/>\nchildren. <br/>\n<br/>\nWe don&#39;t limit. <br/>\n<br/>\nWe don&#39;t limit TV to 10 channels, but they are not glued to the TV.<br/>\n<br/>\nWe don&#39;t limit sweets to once per day, but they don&#39;t over-eat on <br/>\nsweets or under-eat on other foods.<br/>\n<br/>\nPam</div>","specialLinks":[]},{"userId":1509055,"authorName":"Tia Leschke","from":"&quot;Tia Leschke&quot; &lt;leschke@...&gt;","profile":"leschke2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Adult time","postDate":"1034696875","msgId":46422,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwZjcwMWMyNzQ2NiRmYTdlZGVlMCQxYzcxOGU4YkBlYnVzNDk+","referencesHeader":"PDIwMDIxMDE1LjAzNDgzMS44OTYuMC5kZHppbWxld0BqdW5vLmNvbT4="},"prevInTopic":46418,"nextInTopic":46424,"prevInTime":46421,"nextInTime":46423,"topicId":46256,"numMessagesInTopic":0,"msgSnippet":"... My dh used to get up and have breakfast with his dad who got up really early, like 5 am, to go logging.  Then he d go back to bed.  Maybe this boy would","messageBody":"<div id=\"ygrps-yiv-870733422\"><blockquote><span title=\"ireply\">&gt; &gt; My son gets up at 7:00 in the morning to see his Dad<br/>\n&gt; &gt; off before he goes to work. He goes to bed at 8: 30.<br/>\n&gt;<br/>\n&gt; I&#39;m wondering if he didn&#39;t have a bed time would he have more time with<br/>\n&gt; his dad at night and not feel like he needs to get up that early?  I<br/>\n&gt; don&#39;t know.  I&#39;m assuming he gets up on his own to see his dad and you&#39;re<br/>\n&gt; not yanking him out of bed because you think he needs to see his dad.&lt;g&gt;<br/>\n<br/>\n </span></blockquote>My dh used to get up and have breakfast with his dad who got up really<br/>\nearly, like 5 am, to go logging.  Then he&#39;d go back to bed.  Maybe this boy<br/>\nwould end up doing something similar if he stayed up later.<br/>\nTia</div>","specialLinks":[]},{"userId":10294444,"authorName":"Myranda","from":"&quot;Myranda&quot; &lt;myrandab@...&gt;","profile":"randascloudream","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Adult time","postDate":"1034696271","msgId":46418,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxOTkwMWMyNzQ2MCRkNDQ4ODRjMCQwMTNmZmVhOUBjb21wdXRlcj4=","referencesHeader":"PEY1ZlpXalNlS2cxYnp1RHdQNlMwMDAwMGFkMEBob3RtYWlsLmNvbT4="},"prevInTopic":46417,"nextInTopic":46422,"prevInTime":46417,"nextInTime":46419,"topicId":46256,"numMessagesInTopic":0,"msgSnippet":"From: Mary Bianco I disagree. Well you knew someone had to!!! I m sure someone else will put it better than I can but I ll take a try. I think imposing","messageBody":"<div id=\"ygrps-yiv-1574579636\">From: Mary Bianco <br/>\n  I disagree. Well you knew someone had to!!! I&#39;m sure someone else will put <br/>\n  it better than I can but I&#39;ll take a try. I think imposing restrictions is <br/>\n  the key here. You are setting limits according to your standards of what is <br/>\n  appropriate. How do you know what those limits &#39;should&#39; be for your child if <br/>\n  they never had the chance to experience for themselves? I think guiding your <br/>\n  child and imposing restrictions are totally different things. The way I <br/>\n  guide my children is by having lots of really neat stuff around for them to <br/>\n  play with. That goes from reference books to blocks. If I go out without <br/>\n  them and want to bring back new stuff, I guide by not bringing back sex <br/>\n  books but childrens books or even adult books that the kids would enjoy. <br/>\n  There will come a time when the sex books will come &lt;BG&gt; but not right now. <br/>\n  They are learning their sex stuff from the animals! That&#39;s the guiding I do. <br/>\n  Which some would say isn&#39;t really guiding at all. :p~~~~~ on them!!<br/>\n<br/>\n<br/>\n  ** Of course someone (probably several someones) have to disagree! LOL By imposing restrictions, I&#39;m talking about not letting a 3 yr old watch HBO movies, not allowing a 6 yr old with a sugar-sensitivity problem eat unlimited sweets, etc. See, I started out with NO restrictions whatever (besides ones of safety like no running in parking lots, no wandering off in stores, etc). I learned that I had to add some restrictions when my sugar-sensitive son would literally crave more and more sugar every time he got a bit, and he would become impossible to live with and miserable himself. After a year of trying to get him to self-regulate, I had to impose the rule of one sweet per day. We&#39;ve all been much happier since. I&#39;ve also done a lot of research into what a lot of artificial ingrediants can do to a person, and feel that it&#39;s my duty to protect my children from too much of those things if they do not do it themselves. <br/>\n<br/>\n<br/>\n  I totally disagree again. I think children can find their limits and know <br/>\n  them by still being able to have unlimited access to them. From very little, <br/>\n  we&#39;ve always had all kinds of things to drink in this house. We are not soda <br/>\n  drinkers but I have it here sometimes for others. There has been beer, <br/>\n  gatorade, water, milk, juice you name it. My oldest only drinks ice tea and <br/>\n  water. My son only drinks chocolate milk and water at sports camp only. My <br/>\n  daughter only drinks water with an occasional soda out somewhere. My baby <br/>\n  only choc. milk and water. Why did they choose those when we always had so <br/>\n  much more for them to choose from? They know what they like. How could I <br/>\n  without them trying? Your statement about only having soda in the house is <br/>\n  accurate. If there is only soda there, what is their choice? But to provide <br/>\n  more, you are assuming that the child will always make the wrong choice.<br/>\n<br/>\n  ** See, I could not handle my children only drinking milk. IMO, milk, that comes from the grocery store, has way too many hormones and other things in it for it to be safe for a child to drink more than a cup or so each day. That falls into a safety thing for me. I cannot watch my children do things that could harm their health in the name of freedom. When they are old enough to understand what their choices can mean for their bodies, then it will be completely their choice. Ice Tea is not a choice I&#39;d be comfortable with all the time either - not regular tea, anyway. Now the natural kinds from health food stores, I&#39;d be fine with. <br/>\n<br/>\n  You said the same with the computer and TV. My kids have a zillion channels <br/>\n  to choose from and plenty of video games and gameboy and computer games too. <br/>\n  They do not sit in front of the TV/gameboy/computer all day long. Not for <br/>\n  long at all in fact. They also have a very wide array of foods to choose <br/>\n  from and are always allowed to try whatever new they want to from the <br/>\n  grocery store. With no fear of not liking it and me being mad or of them <br/>\n  liking it and me not allowing it anymore. I never see them excessively <br/>\n  eating anything. I did have to watch my little one with chocolate, only <br/>\n  because too much gave her diarrhea and I know that from experience. If I <br/>\n  never let her, I would have never known and not known now that she is pretty <br/>\n  much over that stage of me having to watch. I guess it was a baby thing.<br/>\n<br/>\n  ** See, my children got to where they&#39;d do the &quot;zoning out&quot; thing with a lot of channels, games, etc to choose from and would not do anything else. I gave it about a year to see if it was something they&#39;d outgrow, and they didn&#39;t. So I packed up most of the games, and restricted the TV channels. Poof - instant activity in the house! Board games being played, wanting to build things, wanting to go outside, all these things they hadn&#39;t done in months and months. They were happier too!<br/>\n<br/>\n  You use words like guide, supervise, impose and restrictions altogether and <br/>\n  I see those as words that don&#39;t all mean the same thing let alone connect <br/>\n  together. I just don&#39;t see how starting out with little is giving your child <br/>\n  the chance to experience and find out for themselves what they like. I also <br/>\n  don&#39;t see it as trusting your child before they even get a chance to make <br/>\n  the right choices. You are assuming bad things by unlimiting. Not so.<br/>\n<br/>\n  ** No, the words don&#39;t all mean the same thing. Guiding is what you need to do while they are too young to make decisions on their own. Supervise is what you need to do so you&#39;ll know what&#39;s going on. Imposing restrictions is what should be done if they are doing something harmful to themselves or others and are not willing or able to self-regulate. Mine did have the chance to make the choices first, but when all they chose was the &quot;bad&quot; stuff, I imposed some limits. I&#39;m of the opinion that since they were around my parents a lot, and heard a lot about what they could and couldn&#39;t do over there, what they should and shouldn&#39;t say, do, etc that they chose to do nothing but those things at home. Maybe I&#39;m wrong there, but it does seem like it. They do experience new and different things, usually outside of the house, and if it&#39;s not bad for their health, and if they like it, we&#39;ll then bring it into the house. Our house is so full of things they like and enjoy now, we&#39;re gonna have to get some of it out before too many more new things can come in!!!<br/>\n  Myranda<br/>\n<br/>\n<br/>\n  Mary B<br/>\n<br/>\n  _________________________________________________________________<br/>\n  Chat with friends online, try MSN Messenger: <a rel=\"nofollow\" target=\"_blank\" href=\"http://messenger.msn.com\">http://messenger.msn.com</a><br/>\n<br/>\n<br/>\n<br/>\n        Yahoo! Groups Sponsor <br/>\n              ADVERTISEMENT<br/>\n             <br/>\n       <br/>\n       <br/>\n<br/>\n  ~~~~ Don&#39;t forget! If you change topics, change the subject line! ~~~~<br/>\n<br/>\n  If you have questions, concerns or problems with this list, please email the moderator, Joyce Fetteroll (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a>), or the list owner, Helen Hegener (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Editor@...\">HEM-Editor@...</a>).<br/>\n<br/>\n  To unsubscribe from this group, click on the following link or address an email to:<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-unsubscribe@yahoogroups.com\">Unschooling-dotcom-unsubscribe@yahoogroups.com</a> <br/>\n<br/>\n  Visit the Unschooling website: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> <br/>\n<br/>\n  Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":99826381,"authorName":"Mary Bianco","from":"&quot;Mary Bianco&quot; &lt;mummyone24@...&gt;","profile":"mummyone24","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Adult time","postDate":"1034693760","msgId":46417,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY1ZlpXalNlS2cxYnp1RHdQNlMwMDAwMGFkMEBob3RtYWlsLmNvbT4="},"prevInTopic":46415,"nextInTopic":46418,"prevInTime":46416,"nextInTime":46418,"topicId":46256,"numMessagesInTopic":0,"msgSnippet":"...  The idea is to guide, imposing restrictions if necessary, the children toward safe and ","messageBody":"<div id=\"ygrps-yiv-1541906064\"><blockquote><span title=\"ireply\">&gt;From: &quot;Myranda&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:myrandab@...\">myrandab@...</a>&gt;<br/>\n<br/>\n </span></blockquote>&lt;&lt;Here&#39;s my take on this, someone correct me if I&#39;m wrong! &lt;g&gt; The idea is <br/>\nto guide, imposing restrictions if necessary, the children toward safe and <br/>\nhealthful decisions while young, and gradually let go of the guidance and/or <br/>\nrestrictions as they get older and better able to regulate themselves.&gt;&gt;<br/>\n<br/>\n<br/>\nI disagree. Well you knew someone had to!!! I&#39;m sure someone else will put <br/>\nit better than I can but I&#39;ll take a try. I think imposing restrictions is <br/>\nthe key here. You are setting limits according to your standards of what is <br/>\nappropriate. How do you know what those limits &#39;should&#39; be for your child if <br/>\nthey never had the chance to experience for themselves? I think guiding your <br/>\nchild and imposing restrictions are totally different things. The way I <br/>\nguide my children is by having lots of really neat stuff around for them to <br/>\nplay with. That goes from reference books to blocks. If I go out without <br/>\nthem and want to bring back new stuff, I guide by not bringing back sex <br/>\nbooks but childrens books or even adult books that the kids would enjoy. <br/>\nThere will come a time when the sex books will come &lt;BG&gt; but not right now. <br/>\nThey are learning their sex stuff from the animals! That&#39;s the guiding I do. <br/>\nWhich some would say isn&#39;t really guiding at all. :p~~~~~ on them!!<br/>\n<br/>\n<br/>\n<br/>\n&lt;&lt;By limiting the choices you have in the house, children will find it <br/>\neasier to regulate themselves, and you can gradually add choices as they get <br/>\nbetter at it. If a child has 20 new computer games to play, they&#39;re not <br/>\ngoing to willingly leave the computer, no matter how tired they get of it. <br/>\nIf they have unlimited TV channels to watch, they&#39;ll always be able to find <br/>\nsomething to keep them glued to the TV. If there are 4 different kinds of <br/>\ncola in the house, but no tea or juice or milk, guess what they&#39;re going to <br/>\ndrink? By limiting choices available, you don&#39;t have to supervise and impose <br/>\nlimits yourself half as often. This works for small children, but I have no <br/>\nidea how well it would work for older children. I&#39;m sure it would work to a <br/>\ncertain degree, though. But it would be much harder to take something away <br/>\nthan it is to start out with little and gradually add to it like you can <br/>\nwith younger children.&gt;&gt;<br/>\n<br/>\n<br/>\nI totally disagree again. I think children can find their limits and know <br/>\nthem by still being able to have unlimited access to them. From very little, <br/>\nwe&#39;ve always had all kinds of things to drink in this house. We are not soda <br/>\ndrinkers but I have it here sometimes for others. There has been beer, <br/>\ngatorade, water, milk, juice you name it. My oldest only drinks ice tea and <br/>\nwater. My son only drinks chocolate milk and water at sports camp only. My <br/>\ndaughter only drinks water with an occasional soda out somewhere. My baby <br/>\nonly choc. milk and water. Why did they choose those when we always had so <br/>\nmuch more for them to choose from? They know what they like. How could I <br/>\nwithout them trying? Your statement about only having soda in the house is <br/>\naccurate. If there is only soda there, what is their choice? But to provide <br/>\nmore, you are assuming that the child will always make the wrong choice.<br/>\n<br/>\nYou said the same with the computer and TV. My kids have a zillion channels <br/>\nto choose from and plenty of video games and gameboy and computer games too. <br/>\nThey do not sit in front of the TV/gameboy/computer all day long. Not for <br/>\nlong at all in fact. They also have a very wide array of foods to choose <br/>\nfrom and are always allowed to try whatever new they want to from the <br/>\ngrocery store. With no fear of not liking it and me being mad or of them <br/>\nliking it and me not allowing it anymore. I never see them excessively <br/>\neating anything. I did have to watch my little one with chocolate, only <br/>\nbecause too much gave her diarrhea and I know that from experience. If I <br/>\nnever let her, I would have never known and not known now that she is pretty <br/>\nmuch over that stage of me having to watch. I guess it was a baby thing.<br/>\n<br/>\nYou use words like guide, supervise, impose and restrictions altogether and <br/>\nI see those as words that don&#39;t all mean the same thing let alone connect <br/>\ntogether. I just don&#39;t see how starting out with little is giving your child <br/>\nthe chance to experience and find out for themselves what they like. I also <br/>\ndon&#39;t see it as trusting your child before they even get a chance to make <br/>\nthe right choices. You are assuming bad things by unlimiting. Not so.<br/>\n<br/>\nMary B<br/>\n<br/>\n_________________________________________________________________<br/>\nChat with friends online, try MSN Messenger: <a rel=\"nofollow\" target=\"_blank\" href=\"http://messenger.msn.com\">http://messenger.msn.com</a></div>","specialLinks":[]},{"userId":1572768,"authorName":"Stephanie Elms","from":"&quot;Stephanie Elms&quot; &lt;stephanie.elms@...&gt;","profile":"elmsfam","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [Unschooling-dotcom] Adult time","postDate":"1034693408","msgId":46415,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlENkNGOUNFQTc2ODNDNEQ4RjQxNUEzRjU0RDFDMDY2MDEzREM3OEJAZHN0cDEuZGVsdGFzb2x1dGlvbnMuY29tPg=="},"prevInTopic":46412,"nextInTopic":46417,"prevInTime":46414,"nextInTime":46416,"topicId":46256,"numMessagesInTopic":0,"msgSnippet":"Hi Dalene! I am a little newer to some of the ideas being talked about and when I first started reading I had many of the same concerns as you. Don t know if","messageBody":"<div id=\"ygrps-yiv-243743998\">Hi Dalene! I am a little newer to some of the ideas being talked about <br/>\nand when I first started reading I had many of the same concerns as you.<br/>\nDon&#39;t know if my perspective will help, but I will try. :o) Actually<br/>\nit probably will help me as I am still trying to digest things. My boys<br/>\nare 5 and 2.<br/>\n<br/>\nI am a pretty laid back when it comes to parenting. However, I have recently<br/>\nbeen looking at areas in which I am more controlling. About a month ago<br/>\nI removed all restrictions on tv and about 2 weeks ago I decided to<br/>\nremove all restrictions on food. It has been interesting, but more on that <br/>\nlater. :o)<br/>\n<br/>\nAs far as bedtimes, I have never forced the boys to go to sleep without me (sounds<br/>\nlike you do not either). Kyle (2) is really easy, his dad walks and rocks him and he<br/>\nis usually out by 8:30. With Jason (5), I have had to have much more creativity.<br/>\nWe have gone through lots of iterations, but right now we have an agreement that if he <br/>\nis not ready to go to sleep after we get ready and read, then he can stay up with me<br/>\nin my craft room (my hobby is rubber stamping). He plays quietly and we talk, but I get<br/>\nto do my crafting. If he seems to be getting tired, I ask him if he is ready to go to<br/>\nbed. Sometimes he says yes and other times he still wants to stay up. My goal is that<br/>\nhe will learn to trust his cues. Lately he has been really wanting to stay up late and <br/>\nthe next day is a bear. But I think that is part of the learning process. Jason can<br/>\nbe a very intense little boy, very extroverted, wanting to be played with all the time.<br/>\nThere have been some days when I have been totally worn out and asked Jason to stay in<br/>\nhis room (he did not have to go to sleep). I try not to do this too often because it is<br/>\nnot his favorite thing. I am trying to come up with other options for these days, but dh <br/>\nis not as accommodating and has no problem with bedtimes.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I really do like the unschooling approach and appreciate some <br/>\n&gt; of the TCS theories, but I do think there is a problem in <br/>\n&gt; saying, if you don&#39;t do it the way we do, you&#39;re being a bad parent.<br/>\n<br/>\n </span></blockquote>I agree that people here are not saying that you are a bad parent. Just that they<br/>\nhave different ways and reasons for doing what they are doing. When I first started<br/>\nreading here, I did take some things said personally, but as I think more and more<br/>\nabout it, I can see where they are coming from. It does take some time (at least<br/>\nfor me!) because it has meant rethinking a lot of concepts that I have taken as <br/>\ngivens. It was also hard for me, because I have had to admit that I *am* controlling<br/>\nin many ways. And I had always prided myself on how relaxed I was as a mom...not many<br/>\nrules (but still some). Most of my friends think that I am *too* relaxed, so to find<br/>\na bunch of folks that say that I can give up even *more* control shook me a little. But<br/>\nfrom what I can tell, they are on to something! And it makes sense to me, deep down.<br/>\nWhich is why I am willing to give it a chance.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; TV for example. I know the unschooling approach is to let <br/>\n&gt; children make that decision themselves. I can see that to be <br/>\n&gt; a fair approach for older children, but I strongly believe <br/>\n&gt; younger children need our protection. Being responsible is as <br/>\n&gt; important as being loving. What do you do?? Just ignore all <br/>\n&gt; the research that points the negatives of TV?? I can not <br/>\n&gt; believe that it could be good for a five  year old to watch <br/>\n&gt; adult programmes - violence, sex, bad language. I would not <br/>\n&gt; expose my child to any of that in day to day living, why <br/>\n&gt; would I let him see it on TV??<br/>\n<br/>\n </span></blockquote>I have just lifted restrictions on tv about 4 weeks ago. They can choose how much<br/>\nthey watch and what they watch. This does not mean that I am turning on NYPD<br/>\nBlue in the middle of the day and showing him. We have tivo, which means that we<br/>\ncan tape everything and he does not have to watch what is on at a particular time.<br/>\nHe likes Junkyard Wars, Bill Nye the Science Guy, Monster Garage, Liberty&#39;s Kids,<br/>\nEmergency Vets and a few others. I have not seen him want to watch too many adult<br/>\nshows. Back in sept, I had taped a few of the Sept 11th shows. Jason went into one<br/>\nby accident (it was not what he was looking for). My initial impulse was to turn<br/>\nit off immediately, but instead I told him what it was about and that it was going<br/>\nto be pretty sad. He watched the plane go into the building (he had seen this once<br/>\nor twice before last year) and decided that he did not want to watch and went on<br/>\nto another show. If I had told him he couldn&#39;t watch, he might have tried to watch when<br/>\nI was not around, merely because he was curious. <br/>\n<br/>\nJason tends to be sensitive to scary shows...he has watched cartoons at friends houses and<br/>\nbeen scared (includes scooby doo and other cartoons with more &quot;violence&quot;). We have<br/>\ntalked about what scares him and if he wants to watch something that I think might scare<br/>\nhim, I let him know. He then makes the decision. Most times he is not interested in watching<br/>\nI feel that this is very responsible and is helping him learn to make decisions for <br/>\nwhat is right for him. Having &quot;no restrictions&quot; is not the same as exposing them to everything.<br/>\nWe usually do not watch the news (especially now as we live in Northern Va and the sniper<br/>\nis on everywhere) when the boys are awake. They know that there is news but they have never<br/>\nasked to watch it. It is the same with most adult shows (I have watched friends or Ed when<br/>\nthey were up). <br/>\n<br/>\nAs far as research...I was a big believer in the evils of tv. Made sense to me. Watching<br/>\ntv *all* day long on a regular basis would not be a good thing in my opinion. I don&#39;t<br/>\nwant my kids to become couch potatoes or not be able to entertain themselves with<br/>\nanything other then tv. However, what I have found since lifting the tv restrictions is<br/>\nthat although the tv is *on* more, that does not really mean that they are watching more.<br/>\nBefore, if I turned on the tv, Jason would sit glued, staring, doing nothing else. Now<br/>\nhe is definitely doing more things while the tv is on...playing cars, legos, board games<br/>\nwith me. He is also more likely to turn it off (I do ask sometimes because the noise starts<br/>\ndriving me crazy and sometimes he chooses to turn it off as well). <br/>\n<br/>\nOne thing that helped me take the plunge with tv is realizing that the studies were based<br/>\non kids in school who with school and homework only have a few hours of free time. So<br/>\nspending 2 hrs or more watching tv would cut out a lot of other things they could<br/>\ndo with their free time. When hsing, our kids have lots more control over their<br/>\ntime. I realized that if Jason really choose to watch tv all day long, then I would<br/>\nprobably need to look at *why* there was nothing else that was more interesting to him.<br/>\nWatching 2 hrs of tv (or even more) still leaves lots of time to do other things. I have<br/>\nfound that Jason watches more tv when he is tired or not feeling well. I don&#39;t think<br/>\nthat is a  bad thing if he wants some downtime. I know that I could not keep up with<br/>\nhis pace! So some downtime can be good for him. And he still has lots of time to be<br/>\ncreative and we read a lot. One other thing that I have found since I lifted tv limits<br/>\nis that I no longer have my ace in the hole when I want to get something done...I used<br/>\nto be able to turn on the tv and they were glued...it doesn&#39;t work that way now!<br/>\n<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; The same goes with social issues in later life - sex, porno, <br/>\n&gt; drugs?? Do we not protect our children from that or at least <br/>\n&gt; try to. And I do realize that the theory is that children <br/>\n&gt; should be trusted in the same way than adults not to do. But <br/>\n&gt; some are more curious than others. <br/>\n<br/>\n </span></blockquote>This is assuming that kids will always be drawn to the worst in life. I think<br/>\nthat being open and talking about why these issues as they come up is more<br/>\neffective then just forbidding it. A woman on my local hsing list recently<br/>\ntold of finding her 13 yo in a private chat she had been invited to by someone<br/>\non a Harry Potter chat. Instead of immediately restricting her internet access for<br/>\nbreaking a rule, the mom sat down with her. By asking some questions it soon became<br/>\napparent that this was not a kid and he was not real knowledgeable about HP. This<br/>\nfreaked the daughter out and taught her a heck of a lot more then any punishment<br/>\nwould have. Also gave the mom a little heads up to be a little more observant of<br/>\nwhat her dd was doing on the computer. <br/>\n<br/>\nI think that what people are saying here is that if you give more chances to make<br/>\ndecisions when they are younger, they will be more experienced and comfortable<br/>\nwith making the harder decisions when they are older. When you remove limits, you<br/>\nare not saying &quot;you are on your own, do what you want&quot;, you are giving them the freedom<br/>\nto learn with your help. And by leaving it truly up to them, they are more likely<br/>\nto listen to what you say. Removing restrictions on junk food does not mean that I <br/>\ndo not talk with them about healthy eating. It also does not mean that I go out and<br/>\nbuy only junk food. Jason has never had a twinkie before. I do not plan on introducing<br/>\nthem to him, but if he sees one in the store or has one at a friends house and asks<br/>\nfor one, I will buy them.<br/>\n<br/>\nNot sure if this helps, but it has gotten  long enough I think!<br/>\n<br/>\nStephanie E.</div>","specialLinks":[]},{"userId":99826381,"authorName":"Mary Bianco","from":"&quot;Mary Bianco&quot; &lt;mummyone24@...&gt;","profile":"mummyone24","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Adult time","postDate":"1034691846","msgId":46412,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY0NkJIeTNTcHdCR3BFSTJyVjQwMDAwMDYyNkBob3RtYWlsLmNvbT4="},"prevInTopic":46408,"nextInTopic":46415,"prevInTime":46411,"nextInTime":46413,"topicId":46256,"numMessagesInTopic":0,"msgSnippet":"... ","messageBody":"<div id=\"ygrps-yiv-764114702\"><blockquote><span title=\"ireply\">&gt;From: Deborah Lewis &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ddzimlew@...\">ddzimlew@...</a>&gt;<br/>\n<br/>\n </span></blockquote>&lt;&lt;I&#39;ll take a stab at this, but I&#39;m making excuses right up front, I&#39;m<br/>\ntired this morning and may not make any sense.<br/>\n(So, pretty much the same as usual.)&gt;&gt;<br/>\n<br/>\nWell once again, I think you did an incredible job, tired or not!!!<br/>\n<br/>\nMary B<br/>\n<br/>\n<br/>\n<br/>\n_________________________________________________________________<br/>\nSend and receive Hotmail on your mobile device: <a rel=\"nofollow\" target=\"_blank\" href=\"http://mobile.msn.com\">http://mobile.msn.com</a></div>","specialLinks":[]},{"userId":10294444,"authorName":"Myranda","from":"&quot;Myranda&quot; &lt;myrandab@...&gt;","profile":"randascloudream","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Adult time","postDate":"1034684904","msgId":46408,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMjQwMWMyNzQ0NiQ1YzBhMzIyMCQwMTNmZmVhOUBjb21wdXRlcj4=","referencesHeader":"PDIwMDIxMDE0LjE0NTE0Ni4xMzQwLjYuZGR6aW1sZXdAanVuby5jb20+IDwwMGRjMDFjMjczZWYkY2I5OTYxODAkY2Y1MzM3ZDJAaHBwYXY+"},"prevInTopic":46404,"nextInTopic":46412,"prevInTime":46407,"nextInTime":46409,"topicId":46256,"numMessagesInTopic":0,"msgSnippet":"Here s my take on this, someone correct me if I m wrong!  The idea is to guide, imposing restrictions if necessary, the children toward safe and healthful","messageBody":"<div id=\"ygrps-yiv-1102194514\">Here&#39;s my take on this, someone correct me if I&#39;m wrong! &lt;g&gt; The idea is to guide, imposing restrictions if necessary, the children toward safe and healthful decisions while young, and gradually let go of the guidance and/or restrictions as they get older and better able to regulate themselves. <br/>\n<br/>\nThis kinda reminds me of clothes-shopping with the boys. While they were babies, I picked out all of their clothes. By age 12-18mths, I&#39;d hold up two outfits and let them choose which one they wanted. At around age 2, I&#39;d pick out a selection and let them choose what all they wanted out of it. By age 3, I&#39;d let them wander around the department choosing things, but I&#39;d have to select the correct size and if what they picked out was inappropriate I&#39;d tell them so and we wouldn&#39;t get it. By age 4, they could pick out what they wanted and the correct size by looking at the color thing on the hanger, and I let them pick out a couple inappropriate things so they would learn what they needed and didn&#39;t need. And from age 5 and on, unless something was way out of our price range, they have picked out their own clothes 100%. <br/>\n<br/>\nFor TV, my boys can watch unlimited TV - but can only watch about 10 channels - Disney, Toon Disney, Nick, PBS, TLC, History, Travel, Home and Garden, Weather, and Sports. These channels are the only ones the TV will flip to, so there&#39;s never an issue about whether or not they can watch something. Anything else is watched only if me or Daddy is there to sit with them and talk about it. For movies, they can watch most G-rated anytime they want, but must have either me or Daddy there to watch anything over that. I do pre-watch a lot of movies for content - no one&#39;s asked about sex yet, and I don&#39;t want them getting it from a TV show or movie. <br/>\n<br/>\nAs for food, they can eat whenever they want, and usually get their pick of what they want for meals, but I have to limit sweet snacks to once a day. Same for drink, I set a limit of two cups of juice a day. We don&#39;t allow colas or things with a lot of food coloring or presertives for health reasons - so I simply don&#39;t bring those things into the house. I&#39;m not going to have something available that they&#39;re not allowed to have. If it&#39;s not here, they never ask for it so it&#39;s not even an issue. <br/>\n<br/>\nComputer game time is not limited, but we only keep maybe two games at any one time, so when they get tired of those they leave the computer by their own choice. <br/>\n<br/>\nBy limiting the choices you have in the house, children will find it easier to regulate themselves, and you can gradually add choices as they get better at it. If a child has 20 new computer games to play, they&#39;re not going to willingly leave the computer, no matter how tired they get of it. If they have unlimited TV channels to watch, they&#39;ll always be able to find something to keep them glued to the TV. If there are 4 different kinds of cola in the house, but no tea or juice or milk, guess what they&#39;re going to drink? By limiting choices available, you don&#39;t have to supervise and impose limits yourself half as often. This works for small children, but I have no idea how well it would work for older children. I&#39;m sure it would work to a certain degree, though. But it would be much harder to take something away than it is to start out with little and gradually add to it like you can with younger children. <br/>\nMyranda &lt;--- just my .02<br/>\n<br/>\n <br/>\n  From: Dalene and Andy <br/>\n<br/>\n  I agree and I would think that is why most of us are here, because we do put our children first.<br/>\n<br/>\n<blockquote><span title=\"ireply\">         &gt;&gt;I think there are ways for moms to get a few quiet<br/>\n </span></blockquote>    minutes to calm down, or think or just plain rest while their little ones<br/>\n    are little and require a lot of energy and I don&#39;t think imposing a<br/>\n    bedtime is the best way to do it.  Get up a little early, stay up a<br/>\n    little later or  let dad play with them. <br/>\n<br/>\n  I still have difficulty in understanding why bedtime is so wrong?? I do understand that it is a problem if you have a child kicking and screaming that wouldn&#39;t want to go to bed. <br/>\n<br/>\n  But I think we need to understand that everyone here have a different reality. Mine for example is two children in two different sleep pattern. My son gets up at 7:00 in the morning to see his Dad off before he goes to work. He goes to bed at 8: 30. My daughter on the other hand sometimes stays up until 10:30. I&#39;m sorry to say if that makes me a bad mother, but by that time I&#39;m all mothered out and I do need time to recharge myself. Why not stay up after she&#39;s gone to be or get up before her?? Because she likes cuddling up with me in bed, and usually wakes up to call me if I&#39;m not there.<br/>\n<br/>\n  My son on the other hand, needs a certain number of hours sleep. If he doesn&#39;t get it, he will end up tearful and upset, because he gets overtired. To let him go there, seems cruel and irresponsible to me.<br/>\n<br/>\n  Time for me?? Why don&#39;t we do Playdates?? My son doesn&#39;t like staying at other people&#39;s houses. Babysitting??  He doesn&#39;t like it when other people look after him?? Daycare (even for an hour at the gym)?? An absolute no go, both for him and us. Kids coming over to play?? Sure we do, but that doesn&#39;t really entertain the two year old?? Why don&#39;t I just adapt to having young children?? I have. I have moved from needing several hours of solitude daily, to an hour or less on good days.<br/>\n<br/>\n  I really do like the unschooling approach and appreciate some of the TCS theories, but I do think there is a problem in saying, if you don&#39;t do it the way we do, you&#39;re being a bad parent.<br/>\n<br/>\n  TV for example. I know the unschooling approach is to let children make that decision themselves. I can see that to be a fair approach for older children, but I strongly believe younger children need our protection. Being responsible is as important as being loving. What do you do?? Just ignore all the research that points the negatives of TV?? I can not believe that it could be good for a five  year old to watch adult programmes - violence, sex, bad language. I would not expose my child to any of that in day to day living, why would I let him see it on TV??<br/>\n<br/>\n  The same goes with social issues in later life - sex, porno, drugs?? Do we not protect our children from that or at least try to. And I do realise that the theory is that children should be trusted in the same way than adults not to do. But some are more curious than others. <br/>\n<br/>\n  I&#39;m still confused.<br/>\n<br/>\n  Dalene<br/>\n<br/>\n<br/>\n  [Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n        Yahoo! Groups Sponsor <br/>\n              ADVERTISEMENT<br/>\n             <br/>\n       <br/>\n       <br/>\n<br/>\n  ~~~~ Don&#39;t forget! If you change topics, change the subject line! ~~~~<br/>\n<br/>\n  If you have questions, concerns or problems with this list, please email the moderator, Joyce Fetteroll (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a>), or the list owner, Helen Hegener (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Editor@...\">HEM-Editor@...</a>).<br/>\n<br/>\n  To unsubscribe from this group, click on the following link or address an email to:<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-unsubscribe@yahoogroups.com\">Unschooling-dotcom-unsubscribe@yahoogroups.com</a> <br/>\n<br/>\n  Visit the Unschooling website: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> <br/>\n<br/>\n  Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":74604204,"authorName":"Deborah Lewis","from":"Deborah Lewis &lt;ddzimlew@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Adult time","postDate":"1034675310","msgId":46404,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIxMDE1LjAzNDgzMS44OTYuMC5kZHppbWxld0BqdW5vLmNvbT4="},"prevInTopic":46390,"nextInTopic":46408,"prevInTime":46403,"nextInTime":46405,"topicId":46256,"numMessagesInTopic":0,"msgSnippet":"On Tue, 15 Oct 2002 15:08:45 +1300 Dalene and Andy  ... I ll take a stab at this, but I m making excuses right up front, I m tired this","messageBody":"<div id=\"ygrps-yiv-545771905\">On Tue, 15 Oct 2002 15:08:45 +1300 &quot;Dalene and Andy&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mactier@...\">mactier@...</a>&gt;<br/>\nwrites:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I still have difficulty in understanding why bedtime is so wrong?? I <br/>\n&gt; do understand that it is a problem if you have a child kicking and <br/>\n&gt; screaming that wouldn&#39;t want to go to bed. <br/>\n<br/>\n </span></blockquote>I&#39;ll take a stab at this, but I&#39;m making excuses right up front, I&#39;m<br/>\ntired this morning and may not make any sense. <br/>\n(So, pretty much the same as usual.) <br/>\n<br/>\nIf we think about unschooling as natural learning then it has to<br/>\nencompass all of life.  If unschooling is just going to be letting our<br/>\nchildren learn school subjects or academics naturally we&#39;re missing a<br/>\nwhole other part of human beings as natural learners. <br/>\nIf you&#39;re going to believe your child will read when he&#39;s ready and add<br/>\nand subtract when he&#39;s ready and understand the periodic table and know<br/>\nwho the president is and all that good stuff when he&#39;s ready then why not<br/>\ntake the next step and believe he will learn to understand his own body&#39;s<br/>\nneeds and his own time tables naturally as well.  If you don&#39;t think it&#39;s<br/>\nright to impose a unit study about Joan of Arc on a kid then is it right<br/>\nto impose a bed time? <br/>\n<br/>\nIt takes a whole lot of pondering to figure out why one person would have<br/>\nthe right to decide when another person must go to bed.  Some people<br/>\nthink they know how much a kid should eat too, and when,  instead of just<br/>\nletting the kid decide.  It&#39;s a whole other realm of parenting, thinking<br/>\nbeyond what everyone else has always done.  It will either make you nuts<br/>\nor it will make you the most amazing mom ever.  But for certain, our real<br/>\nconsideration of our children&#39;s rights as human beings will make their<br/>\nlives better. <br/>\n<br/>\nThere were really good posts by Joyce just recently regarding bedtime as<br/>\na power issue.  I think that subject line was &quot;the role of frustration&quot;. <br/>\nShe wrote amazing and wonderful things that I can&#39;t do justice to so if<br/>\nyou&#39;re interested read through some of those.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My son gets up at 7:00 in the morning to see his Dad <br/>\n&gt; off before he goes to work. He goes to bed at 8: 30.<br/>\n<br/>\n </span></blockquote>I&#39;m wondering if he didn&#39;t have a bed time would he have more time with<br/>\nhis dad at night and not feel like he needs to get up that early?  I<br/>\ndon&#39;t know.  I&#39;m assuming he gets up on his own to see his dad and you&#39;re<br/>\nnot yanking him out of bed because you think he needs to see his dad.&lt;g&gt; <br/>\n   <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;My daughter on <br/>\n&gt; the other hand sometimes stays up until 10:30. I&#39;m sorry to say if <br/>\n&gt; that makes me a bad mother, but by that time I&#39;m all mothered out <br/>\n&gt; and I do need time to recharge myself. Why not stay up after she&#39;s <br/>\n&gt; gone to be or get up before her?? Because she likes cuddling up with <br/>\n&gt; me in bed, and usually wakes up to call me if I&#39;m not there.<br/>\n<br/>\n </span></blockquote>I don&#39;t remember how old you said your kids were, I&#39;m sorry.  It&#39;s nice<br/>\nthat you&#39;re there for your little one. But she really won&#39;t need you this<br/>\nmuch forever.  If there are times you can slip out of bed and leave her<br/>\nsleeping take advantage of those. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My son on the other hand, needs a certain number of hours sleep. If <br/>\n&gt; he doesn&#39;t get it, he will end up tearful and upset, because he gets <br/>\n&gt; overtired. To let him go there, seems cruel and irresponsible to <br/>\n&gt; me.<br/>\n<br/>\n </span></blockquote>It took my son a while to understand the reason he sometimes felt bad was<br/>\nlack of sleep.  But he did come to understand it.  When I knew he was<br/>\nready to sleep but didn&#39;t want to leave all the fun, I arranged a quiet<br/>\nhouse.  I turned down lights, turned down the TV.  Got into my own pj&#39;s, <br/>\noffered to read or lay down with him.  It did take more effort on my part<br/>\nthen a bed time would have but he learned to trust his own signals about<br/>\nhis body&#39;s limits and he did it without ever feeling like he was being<br/>\ntreated unfairly. <br/>\nKids might not learn about their own body&#39;s limits right away.  They<br/>\nmight not have it all figured out in a month or two months, but they do<br/>\nget it figured out.  We shouldn&#39;t place unnatural time tables on this<br/>\nkind of learning any more than we should about reading or writing (man, I<br/>\njust typed writhing there) or tying shoes or riding a bike.  All learning<br/>\nis personal and should be on the learners schedule, not on ours.   And<br/>\nthe amount of time my son has needed to sleep has not been constant.  <br/>\nJust because it&#39;s nine hours now doesn&#39;t mean it will be nine hours a<br/>\nmonth from now.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Time for me?? Why don&#39;t we do Playdates?? My son doesn&#39;t like <br/>\n&gt; staying at other people&#39;s houses. Babysitting??  He doesn&#39;t like it <br/>\n&gt; when other people look after him?? Daycare (even for an hour at the <br/>\n&gt; gym)?? An absolute no go, both for him and us. Kids coming over to <br/>\n&gt; play?? Sure we do, but that doesn&#39;t really entertain the two year <br/>\n&gt; old?? Why don&#39;t I just adapt to having young children?? I have. I <br/>\n&gt; have moved from needing several hours of solitude daily, to an hour <br/>\n&gt; or less on good days.<br/>\n<br/>\n </span></blockquote>My son never liked being at someone else&#39;s house either.  He never had a<br/>\nbaby sitter, he never went to day care. I understand all that.  I&#39;m not<br/>\nunderstanding why his dad couldn&#39;t take over the  parenting thing in the<br/>\nevenings for a few hours for you, so you could go for a walk or take a<br/>\nshower or whatever.  An older (teen aged) helper could be a good thing<br/>\ntoo, to play with your kids in your own yard or house while you have an<br/>\nhour to nap.  It is hard being on demand for all the people who need us. <br/>\nBut the demands our children make don&#39;t maintain that same intensity<br/>\nforever.  It really doesn&#39;t last forever.    <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I really do like the unschooling approach and appreciate some of the <br/>\n&gt; TCS theories, but I do think there is a problem in saying, if you <br/>\n&gt; don&#39;t do it the way we do, you&#39;re being a bad parent.<br/>\n<br/>\n </span></blockquote>Nobody said you were a bad parent.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; TV for example. I know the unschooling approach is to let children <br/>\n&gt; make that decision themselves. I can see that to be a fair approach <br/>\n&gt; for older children, but I strongly believe younger children need our <br/>\n&gt; protection. Being responsible is as important as being loving. What <br/>\n&gt; do you do?? Just ignore all the research that points the negatives <br/>\n&gt; of TV?? I can not believe that it could be good for a five  year old <br/>\n&gt; to watch adult programmes - violence, sex, bad language. I would not <br/>\n&gt; expose my child to any of that in day to day living, why would I let <br/>\n&gt; him see it on TV??<br/>\n<br/>\n </span></blockquote>I do ignore all the research that says TV is bad.  All of it.  In the<br/>\nsame way I ignore research that says spanking is ok, discipline is<br/>\nnecessary and school is good.  <br/>\nI don&#39;t think adult programing appeals to five year olds and when  my<br/>\nfive year old wanted to watch TV I didn&#39;t  make him sit through a blood<br/>\nbath or a sex orgy.  I let him find whatever it was that a five year old<br/>\nwanted to watch.   Letting a five year old make TV choices and watching<br/>\n&quot;Blood Sucking Freaks&quot; while your five year old is in the room are not<br/>\nthe same thing. <br/>\nNow, that said, my own son was in front of the TV on one occasion when a<br/>\nmovie ended and another started and sometime later I wandered by to see a<br/>\npretty graphic sex scene.  I asked if he was watching it, and what it was<br/>\nand he said it was just some lady having noisy sex.  He had looked long<br/>\nenough to see what it was but had found the legos more interesting than<br/>\nall that skin.  Kids really don&#39;t watch what isn&#39;t interesting to kids.<br/>\nMy son always made his own TV and movie choices and I&#39;ve never known him<br/>\nto watch anything disgusting.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The same goes with social issues in later life - sex, porno, drugs?? <br/>\n&gt; Do we not protect our children from that or at least try to. And I <br/>\n&gt; do realise that the theory is that children should be trusted in the <br/>\n&gt; same way than adults not to do. But some are more curious than <br/>\n&gt; others. <br/>\n<br/>\n </span></blockquote>If you have a long history of letting your child make his own choices, <br/>\nhe&#39;s going to have a lot of experience at making good ones.   If he&#39;s<br/>\nreceived the respect of his parents and can trust your advice to him is<br/>\nnot any kind of power play, he&#39;ll be much more inclined to respect what<br/>\nyou advise.   <br/>\nBut if he never gets to learn and trust his own experiences about<br/>\nsleeping and eating and choosing entertainment how will he be able to<br/>\nmake good choices about other things when you&#39;re not around? <br/>\nLots of parents have thought they could protect their children by<br/>\ncontrolling them and have found they only pushed their kids away. <br/>\n<br/>\nDeb L</div>","specialLinks":[]},{"userId":2523757,"authorName":"Pam Hartley","from":"Pam Hartley &lt;pamhartley@...&gt;","profile":"pdhartley2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Adult time","postDate":"1034657493","msgId":46390,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBINDAwMEEwS0FUWVIwQG10YTUuc25mYzIxLnBiaS5uZXQ+"},"prevInTopic":46384,"nextInTopic":46404,"prevInTime":46389,"nextInTime":46391,"topicId":46256,"numMessagesInTopic":0,"msgSnippet":"... Because an enforced bedtime takes something that a child knows best himself and/or needs to learn best for himself (when he is tired) and puts it in the ","messageBody":"<div id=\"ygrps-yiv-559801284\"><blockquote><span title=\"ireply\">&gt; I still have difficulty in understanding why bedtime is so wrong??<br/>\n<br/>\n </span></blockquote>Because an enforced bedtime takes something that a child knows best himself<br/>\nand/or needs to learn best for himself (when he is tired) and puts it in the<br/>\ncontrol of someone else. It forces him to ignore his own body rhythms, and<br/>\ndoes nothing to encourage him to find them and react to them, instead of<br/>\ndealing with an arbitrary time set for his mom&#39;s convenience.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My son on the other hand, needs a certain number of hours sleep. If he<br/>\n&gt; doesn&#39;t get it, he will end up tearful and upset, because he gets<br/>\n&gt; overtired. To let him go there, seems cruel and irresponsible to me.<br/>\n<br/>\n </span></blockquote>Everyone needs a certain number of hours sleep. By helping your son to<br/>\nrecognize when he&#39;s tired, by encouraging him to rest if he is and offering<br/>\nto help him if he needs help (cuddling, reading quiet stories to him,<br/>\nwhatever) you are paying attention and helping him learn to pay attention.<br/>\nIf he is cranky and overtired the next day, he will soon figure out why. You<br/>\ncan also help him recognize that, non-judgmentally (&quot;Do you feel kind of<br/>\nupset today? I get that way if I don&#39;t get enough sleep sometimes, so if you<br/>\nwant we can go lay down and read for awhile and see if some rest helps. If<br/>\nthat doesn&#39;t help, we&#39;ll try something else.&quot;)<br/>\n<br/>\nDoing something along those lines is a far cry from an arbitrary bedtime. He<br/>\nmay need a certain number of hours sleep, but that doesn&#39;t mean he needs<br/>\nthem when you think he does, or that those hours won&#39;t change from day to<br/>\nday or week to week.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Why don&#39;t I just adapt to<br/>\n&gt; having young children?? I have. I have moved from needing several hours of<br/>\n&gt; solitude daily, to an hour or less on good days.<br/>\n<br/>\n </span></blockquote>And you can&#39;t get an hour or less from your husband on some or most days?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I really do like the unschooling approach and appreciate some of the TCS<br/>\n&gt; theories, but I do think there is a problem in saying, if you don&#39;t do it<br/>\n&gt; the way we do, you&#39;re being a bad parent.<br/>\n<br/>\n </span></blockquote>Not one person said that. I&#39;m sorry if your reaction to what people wrote is<br/>\nto think that. I have no idea what kind of parent you are, except in very<br/>\nsmall windows with what you write. As far as I know you are the greatest<br/>\nparent ever to walk the planet and you make me look like Mommy Dearest. All<br/>\nI can tell you is that I personally disagree with arbitrary bedtimes, and<br/>\nwhy.<br/>\n<br/>\nAs I wrote before, you are under no compulsion to agree with me. I am under<br/>\nno compulsion to agree with you. I do not get the desire people have to<br/>\nhear, &quot;Well, whatever you do is fine.&quot; Color me obtuse. :)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; TV for example. I know the unschooling approach is to let children make<br/>\n&gt; that decision themselves. I can see that to be a fair approach for older<br/>\n&gt; children, but I strongly believe younger children need our protection.<br/>\n&gt; Being responsible is as important as being loving. What do you do?? Just<br/>\n&gt; ignore all the research that points the negatives of TV?? I can not believe<br/>\n&gt; that it could be good for a five  year old to watch adult programmes -<br/>\n&gt; violence, sex, bad language. I would not expose my child to any of that in<br/>\n&gt; day to day living, why would I let him see it on TV??<br/>\n<br/>\n </span></blockquote>You are suffering from a lack of trust (my opinion). A typical five year old<br/>\ndoes not sit around channel flipping to find violence, sex and bad language.<br/>\nThey tune those things out and turn the channel or wander away. An observant<br/>\nparent helps them find what they really want to watch instead.<br/>\n<br/>\nI do just ignore all the research about TV. I&#39;m not a Believer in every<br/>\nstudy (or even most studies) that come down the pike. I have no idea what<br/>\nconditions those studies were done in, what biases the &quot;studiers&quot; have. I do<br/>\nknow, from observing both my own children and some other families who have<br/>\nno restrictions on television, what non-restriction looks like. I have not<br/>\never seen a child with both unrestricted access to television *and* a parent<br/>\nwho paid attention and saw that options of other activities were always<br/>\nopen, consistently choose age-inappropriate television.<br/>\n<br/>\nOf course, my view of what constitutes &quot;sex and violence&quot; may be far more<br/>\nliberal than many. I don&#39;t think of &quot;Friends&quot; as sex and &quot;Looney Toons&quot; as<br/>\nviolence, but I know some do.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; The same goes with social issues in later life - sex, porno, drugs?? Do we<br/>\n&gt; not protect our children from that or at least try to. And I do realise<br/>\n&gt; that the theory is that children should be trusted in the same way than<br/>\n&gt; adults not to do. But some are more curious than others.<br/>\n<br/>\n </span></blockquote>The way I try to protect my children from things I think are harmful is to<br/>\nbe the kind of parent who they can trust, talk to, and not fear I will flip.<br/>\nBy giving them control now, while they are very young, I am helping them<br/>\nlearn how to control themselves and not rely on me or any other human<br/>\nbesides themselves to put on the brakes. In my opinion this is the best and<br/>\nmost important life skill I can help them to master, and it all starts with<br/>\nme trusting them so they&#39;ll trust me. It&#39;s all physics and karma.<br/>\n<br/>\nPam</div>","specialLinks":[]},{"userId":1512150,"authorName":"Peggy","from":"Peggy &lt;peggy@...&gt;","profile":"margotapple","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Adult time","postDate":"1034655645","msgId":46384,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNEQUI5NzlELkVFMTNDQjBDQGxpbm1heC5zYW8uYXJpem9uYS5lZHU+","referencesHeader":"PEY0NjViSGVPNldjSVNLRUhSZk8wMDAwMWE1N0Bob3RtYWlsLmNvbT4gPDAwMzUwMWMyNzNmZSQ3M2M4NzY4MCQ5MTZhMzZkMkBocHBhdj4="},"prevInTopic":46379,"nextInTopic":46390,"prevInTime":46383,"nextInTime":46385,"topicId":46256,"numMessagesInTopic":0,"msgSnippet":"... And then it changes too, just when you get used to one way they decide to do sleep on a different schedule! It all evens out eventually. One thing that ","messageBody":"<div id=\"ygrps-yiv-1392207184\">Dalene and Andy wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; MAry,<br/>\n&gt; <br/>\n&gt; I think we are kind of in the same position - your young ones grt 11 -12 hours sleep, mine gets slightly less - head to bed at 8: 30. Usually sleeping by 9:00 and up by 7:00.<br/>\n&gt; <br/>\n&gt; i think the problem with bed times would be if you expect them to spend more hours in bed, than what they need.<br/>\n<br/>\n </span></blockquote>And then it changes too, just when you get used to one way they decide to do<br/>\nsleep on a different schedule! It all evens out eventually. One thing that<br/>\nreally helped me understand was baby massage. I did it with both of my kids<br/>\nand they were so different, right from the very start. One had a lot more<br/>\ntension and kinetic energy to release before she could relax enough to go to<br/>\nsleep. Knowing that helped me set the stage for her to relax. We did a quiet<br/>\ntime before bed. Just puzzles or reading, Turned down the lights and turned<br/>\noff the TV. Quiet talk. Low key activities and then bed. I&#39;d lay down with her<br/>\nuntil she went to sleep and then get up and do what I wanted. Takes a little<br/>\nmore effort but I couldn&#39;t stand the  whole idea of having to enforce a<br/>\nbedtime and telling them to go to bed and stay there. That gets too punitive<br/>\nand sometimes they just aren&#39;t ready.<br/>\n<br/>\nI just kept telling myself it wasn&#39;t forever, and it wasn&#39;t. By the time they<br/>\nboth hit 5 or 6 years old it was a whole different deal.<br/>\n<br/>\nThe early years are really hard but they don&#39;t last forever. <br/>\n<br/>\nPeggy</div>","specialLinks":[]},{"userId":80046248,"authorName":"Dalene and Andy","from":"&quot;Dalene and Andy&quot; &lt;mactier@...&gt;","profile":"mactiers","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Adult time","postDate":"1034654020","msgId":46379,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMzUwMWMyNzNmZSQ3M2M4NzY4MCQ5MTZhMzZkMkBocHBhdj4=","referencesHeader":"PEY0NjViSGVPNldjSVNLRUhSZk8wMDAwMWE1N0Bob3RtYWlsLmNvbT4="},"prevInTopic":46367,"nextInTopic":46384,"prevInTime":46378,"nextInTime":46380,"topicId":46256,"numMessagesInTopic":0,"msgSnippet":"MAry, I think we are kind of in the same position - your young ones grt 11 -12 hours sleep, mine gets slightly less - head to bed at 8: 30. Usually sleeping by","messageBody":"<div id=\"ygrps-yiv-1620230906\">MAry,<br/>\n<br/>\nI think we are kind of in the same position - your young ones grt 11 -12 hours sleep, mine gets slightly less - head to bed at 8: 30. Usually sleeping by 9:00 and up by 7:00.<br/>\n<br/>\ni think the problem with bed times would be if you expect them to spend more hours in bed, than what they need.<br/>\n<br/>\nDalene<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":99826381,"authorName":"Mary Bianco","from":"&quot;Mary Bianco&quot; &lt;mummyone24@...&gt;","profile":"mummyone24","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Adult time","postDate":"1034650956","msgId":46367,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY0NjViSGVPNldjSVNLRUhSZk8wMDAwMWE1N0Bob3RtYWlsLmNvbT4="},"prevInTopic":46361,"nextInTopic":46379,"prevInTime":46366,"nextInTime":46368,"topicId":46256,"numMessagesInTopic":0,"msgSnippet":"...  Not sure","messageBody":"<div id=\"ygrps-yiv-1413663698\"><blockquote><span title=\"ireply\">&gt;From: &quot;Darlene and Andy&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mactier@...\">mactier@...</a>&gt;<br/>\n<br/>\n </span></blockquote>&lt;&lt;But I think we need to understand that everyone here have a different <br/>\nreality. Mine for example is two children in two different sleep pattern&gt;&gt;<br/>\n<br/>\n<br/>\nNot sure what to tell you about this one Darlene. I am fortunate enough that <br/>\nmy kids all seem to be pretty much the same way when it comes to sleep. The <br/>\noldest (16) does as she pleases and that&#39;s fine by me. My two youngest girls <br/>\nneed more sleep than my son. They are 2 and 6. Generally we start heading <br/>\nthem to bed around 11:00. That&#39;s when both of them start to wind down and <br/>\nyawn. There is never a problem with either one not wanting to sleep. <br/>\nSometimes, occasions arise when they are up later. They can wake anywhere <br/>\nbetween 10 and 11 in the morning. My son says his goodnights when they do <br/>\nbut stays up. He&#39;s 7. He&#39;ll read or watch TV or do gameboy. Sometimes he <br/>\njust comes and talks with us or has me read a book to him. My husband <br/>\nsometimes goes to bed before he does. I stay up late and my son does along <br/>\nwith me. He usually winds down around 12 or 12:30. Sometimes earlier if he&#39;s <br/>\nhad a long day. He gets up anywhere between 8:00-9:15. He entertains himself <br/>\nuntil he sees me as he enjoys his alone time too. As I said, I&#39;m lucky. I <br/>\nthink as yours get older, you will settle in better with what works for all.<br/>\n<br/>\n<br/>\n<br/>\n&lt;&lt;TV for example. I know the unschooling approach is to let children make <br/>\nthat decision themselves. I can see that to be a fair approach for older <br/>\nchildren, but I strongly believe younger children need our protection. Being <br/>\nresponsible is as important as being loving. What do you do?? Just ignore <br/>\nall the research that points the negatives of TV?? I can not believe that it <br/>\ncould be good for a five  year old to watch adult programmes - violence, <br/>\nsex, bad language. I would not expose my child to any of that in day to day <br/>\nliving, why would I let him see it on TV??&gt;&gt;<br/>\n<br/>\n<br/>\nI&#39;m kind of with you on this one to a certain extent. My oldest of course <br/>\nnow and for quite awhile has chosen what she wants to watch. My youngest has <br/>\nno interest in TV what so ever so that&#39;s real easy for me! The two middle <br/>\nones, they watch what they want now. There are times when flipping through <br/>\nchannels, they see something that might make them uncomfortable and change <br/>\nthe station. Not sure what it is as I just hear my son tell his sister that <br/>\nhe thinks that&#39;s something they shouldn&#39;t be watching. I have never said to <br/>\nthem that they can&#39;t watch a certain show, with the exception of years ago, <br/>\nsaying no to The Simpsons. They might have been like 3 and 4 and naturally <br/>\nsaw cartoon and wanted to watch. After about 5 minutes, I didn&#39;t like what I <br/>\nheard for them at that age and said no. Now as soon as they see it, they <br/>\nchange the channel. Haven&#39;t said a word since that one day years ago. I just <br/>\ndon&#39;t want them seeing and hearing that in a cartoon kid like venue. Some <br/>\nmovies that they mention they would like to see I screen first or use the <br/>\nscreen it site. Like Scorpion King for instance and The Mummy or one of <br/>\ntheir favorites, the Tremors movies. The language doesn&#39;t bother me as they <br/>\nknow they are just words that they might here at the grocery store and that <br/>\nthey don&#39;t use them. The violence doesn&#39;t bother me if it&#39;s not coming from <br/>\na &#39;real&#39; person. No Michael Meyers movies for them. They get scared. If it&#39;s <br/>\nan animal or alien or something not real, like Starship Troopers, they are <br/>\nfine. The sex I keep an eye on as my son gets very uncomfortable with it and <br/>\nrecently even hides his eyes from his 2 year old sister when she&#39;s naked. He <br/>\nobviously is uncomfortable with it and I respect that. I&#39;m sure it will <br/>\nchange as they get older and I&#39;ll cross that bridge when I come to it.<br/>\n<br/>\nMary B<br/>\n<br/>\n_________________________________________________________________<br/>\nChat with friends online, try MSN Messenger: <a rel=\"nofollow\" target=\"_blank\" href=\"http://messenger.msn.com\">http://messenger.msn.com</a></div>","specialLinks":[]},{"userId":80046248,"authorName":"Dalene and Andy","from":"&quot;Dalene and Andy&quot; &lt;mactier@...&gt;","profile":"mactiers","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Adult time","postDate":"1034647725","msgId":46361,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwZGMwMWMyNzNlZiRjYjk5NjE4MCRjZjUzMzdkMkBocHBhdj4=","referencesHeader":"PDIwMDIxMDE0LjE0NTE0Ni4xMzQwLjYuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":46331,"nextInTopic":46367,"prevInTime":46360,"nextInTime":46362,"topicId":46256,"numMessagesInTopic":0,"msgSnippet":"... away from their kids.  That the best way to be a good parent is to put themselves first. I don t agree with that, I think our children always need to come","messageBody":"<div id=\"ygrps-yiv-1034155153\"><blockquote><span title=\"ireply\">&gt;&gt;I feel sad when I hear women talk like they can only find fulfillment<br/>\n </span></blockquote>  away from their kids.  That the best way to be a good parent is to put<br/>\n  themselves first. I don&#39;t agree with that, I think our children always<br/>\n  need to come first.<br/>\n<br/>\nI agree and I would think that is why most of us are here, because we do put our children first.<br/>\n<br/>\n<blockquote><span title=\"ireply\">       &gt;&gt;I think there are ways for moms to get a few quiet<br/>\n </span></blockquote>  minutes to calm down, or think or just plain rest while their little ones<br/>\n  are little and require a lot of energy and I don&#39;t think imposing a<br/>\n  bedtime is the best way to do it.  Get up a little early, stay up a<br/>\n  little later or  let dad play with them. <br/>\n<br/>\nI still have difficulty in understanding why bedtime is so wrong?? I do understand that it is a problem if you have a child kicking and screaming that wouldn&#39;t want to go to bed. <br/>\n<br/>\nBut I think we need to understand that everyone here have a different reality. Mine for example is two children in two different sleep pattern. My son gets up at 7:00 in the morning to see his Dad off before he goes to work. He goes to bed at 8: 30. My daughter on the other hand sometimes stays up until 10:30. I&#39;m sorry to say if that makes me a bad mother, but by that time I&#39;m all mothered out and I do need time to recharge myself. Why not stay up after she&#39;s gone to be or get up before her?? Because she likes cuddling up with me in bed, and usually wakes up to call me if I&#39;m not there.<br/>\n<br/>\nMy son on the other hand, needs a certain number of hours sleep. If he doesn&#39;t get it, he will end up tearful and upset, because he gets overtired. To let him go there, seems cruel and irresponsible to me.<br/>\n<br/>\nTime for me?? Why don&#39;t we do Playdates?? My son doesn&#39;t like staying at other people&#39;s houses. Babysitting??  He doesn&#39;t like it when other people look after him?? Daycare (even for an hour at the gym)?? An absolute no go, both for him and us. Kids coming over to play?? Sure we do, but that doesn&#39;t really entertain the two year old?? Why don&#39;t I just adapt to having young children?? I have. I have moved from needing several hours of solitude daily, to an hour or less on good days.<br/>\n<br/>\nI really do like the unschooling approach and appreciate some of the TCS theories, but I do think there is a problem in saying, if you don&#39;t do it the way we do, you&#39;re being a bad parent.<br/>\n<br/>\nTV for example. I know the unschooling approach is to let children make that decision themselves. I can see that to be a fair approach for older children, but I strongly believe younger children need our protection. Being responsible is as important as being loving. What do you do?? Just ignore all the research that points the negatives of TV?? I can not believe that it could be good for a five  year old to watch adult programmes - violence, sex, bad language. I would not expose my child to any of that in day to day living, why would I let him see it on TV??<br/>\n<br/>\nThe same goes with social issues in later life - sex, porno, drugs?? Do we not protect our children from that or at least try to. And I do realise that the theory is that children should be trusted in the same way than adults not to do. But some are more curious than others. <br/>\n<br/>\nI&#39;m still confused.<br/>\n<br/>\nDalene<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1512150,"authorName":"Peggy","from":"Peggy &lt;peggy@...&gt;","profile":"margotapple","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Adult time","postDate":"1034633702","msgId":46331,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNEQUI0MUU2LjhENjEyRkBsaW5tYXguc2FvLmFyaXpvbmEuZWR1Pg==","referencesHeader":"PDIwMDIxMDE0LjE0NTE0Ni4xMzQwLjYuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":46330,"nextInTopic":46361,"prevInTime":46330,"nextInTime":46332,"topicId":46256,"numMessagesInTopic":0,"msgSnippet":"... OK Deb, I do rant a bit when I get going. ;) My point is, take the first few years easy on the kids -- harder on the adults. It won t last forever and","messageBody":"<div id=\"ygrps-yiv-606573461\">Deborah Lewis wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Peggy, I liked your post very much and agree with you.<br/>\n&gt; We have such a short time with our kids and the rest of our lives after<br/>\n&gt; they&#39;re grown.  I used to remind my husband he had thirty three years to<br/>\n&gt; do what he wanted before Dylan was born and he&#39;d have, (maybe&lt;g&gt;)<br/>\n&gt; that much more after Dylan was grown.<br/>\n&gt; <br/>\n&gt; And more than that we get no guarantees our kids will always be with us.<br/>\n&gt; That we&#39;ll have them long enough to watch them grow up.  No guarantees at<br/>\n&gt; all that we get a tomorrow.<br/>\n&gt; <br/>\n&gt; I feel sad when I hear women talk like they can only find fulfillment<br/>\n&gt; away from their kids.  That the best way to be a good parent is to put<br/>\n&gt; themselves first. I don&#39;t agree with that, I think our children always<br/>\n&gt; need to come first.  I think there are ways for moms to get a few quiet<br/>\n&gt; minutes to calm down, or think or just plain rest while their little ones<br/>\n&gt; are little and require a lot of energy and I don&#39;t think imposing a<br/>\n&gt; bedtime is the best way to do it.  Get up a little early, stay up a<br/>\n&gt; little later or  let dad play with them.<br/>\n&gt; <br/>\n&gt; I didn&#39;t think these women were talking about getting away from their<br/>\n&gt; kids, I assumed they were talking about getting a few moments alone to<br/>\n&gt; pee, or eat or write a shopping list.&lt;g&gt;<br/>\n&gt; <br/>\n&gt; Deb L<br/>\n<br/>\n </span></blockquote>OK Deb, I do rant a bit when I get going. ;) <br/>\n<br/>\nMy point is, take the first few years easy on the kids -- harder on the<br/>\nadults. It won&#39;t last forever and adults can either wait or get creative.<br/>\nThere is a real tension in being a partner, a mother, a woman. I don&#39;t know<br/>\nthat there is a solution that fits all three of those roles. I think as women,<br/>\nwith practice, we become more comfortable with balancing on that high wire.<br/>\nBut, to try to explain that to someone just starting out, new at the game?<br/>\nWhat can one say that makes sense? The only answer is that there is no answer? <br/>\n<br/>\nThe best advice that anyone ever gave to me is: &quot;You are the mother. You know<br/>\nbest in your heart, if something has to give don&#39;t let it be your child&#39;s<br/>\nheart.&quot;<br/>\n<br/>\nPeggy</div>","specialLinks":[]},{"userId":10294444,"authorName":"Myranda","from":"&quot;Myranda&quot; &lt;myrandab@...&gt;","profile":"randascloudream","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Adult time","postDate":"1034631902","msgId":46330,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMzgwMWMyNzNjYSRmNDhjMDQwMCQwMTNmZmVhOUBjb21wdXRlcj4=","referencesHeader":"PDIwMDIxMDE0LjE0NTE0Ni4xMzQwLjYuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":46329,"nextInTopic":46331,"prevInTime":46329,"nextInTime":46331,"topicId":46256,"numMessagesInTopic":0,"msgSnippet":"Wait a minute, you mean to tell me it *is* possible to pee or eat alone?!?!? Myranda ","messageBody":"<div id=\"ygrps-yiv-913218133\">Wait a minute, you mean to tell me it *is* possible to pee or eat alone?!?!? <br/>\nMyranda &lt;---- who hasn&#39;t had a hot meal since 1995 LOL<br/>\n<br/>\n<br/>\nPeggy, I liked your post very much and agree with you. <br/>\nWe have such a short time with our kids and the rest of our lives after<br/>\nthey&#39;re grown.  I used to remind my husband he had thirty three years to<br/>\ndo what he wanted before Dylan was born and he&#39;d have, (maybe&lt;g&gt;) <br/>\nthat much more after Dylan was grown.<br/>\n<br/>\nAnd more than that we get no guarantees our kids will always be with us. <br/>\nThat we&#39;ll have them long enough to watch them grow up.  No guarantees at<br/>\nall that we get a tomorrow. <br/>\n<br/>\nI feel sad when I hear women talk like they can only find fulfillment<br/>\naway from their kids.  That the best way to be a good parent is to put<br/>\nthemselves first. I don&#39;t agree with that, I think our children always<br/>\nneed to come first.  I think there are ways for moms to get a few quiet<br/>\nminutes to calm down, or think or just plain rest while their little ones<br/>\nare little and require a lot of energy and I don&#39;t think imposing a<br/>\nbedtime is the best way to do it.  Get up a little early, stay up a<br/>\nlittle later or  let dad play with them. <br/>\n<br/>\nI didn&#39;t think these women were talking about getting away from their<br/>\nkids, I assumed they were talking about getting a few moments alone to<br/>\npee, or eat or write a shopping list.&lt;g&gt; <br/>\n<br/>\nDeb L<br/>\n<br/>\n<br/>\n      Yahoo! Groups Sponsor <br/>\n            ADVERTISEMENT<br/>\n           <br/>\n            <br/>\n     <br/>\n     <br/>\n<br/>\n<br/>\n~~~~ Don&#39;t forget! If you change topics, change the subject line! ~~~~<br/>\n<br/>\nIf you have questions, concerns or problems with this list, please email the moderator, Joyce Fetteroll (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a>), or the list owner, Helen Hegener (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Editor@...\">HEM-Editor@...</a>).<br/>\n<br/>\nTo unsubscribe from this group, click on the following link or address an email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-unsubscribe@yahoogroups.com\">Unschooling-dotcom-unsubscribe@yahoogroups.com</a> <br/>\n<br/>\nVisit the Unschooling website: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> <br/>\n<br/>\nYour use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":74604204,"authorName":"Deborah Lewis","from":"Deborah Lewis &lt;ddzimlew@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Adult time","postDate":"1034628706","msgId":46329,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIxMDE0LjE0NTE0Ni4xMzQwLjYuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":46325,"nextInTopic":46330,"prevInTime":46328,"nextInTime":46330,"topicId":46256,"numMessagesInTopic":0,"msgSnippet":"Peggy, I liked your post very much and agree with you. We have such a short time with our kids and the rest of our lives after they re grown.  I used to remind","messageBody":"<div id=\"ygrps-yiv-1047306297\">Peggy, I liked your post very much and agree with you. <br/>\nWe have such a short time with our kids and the rest of our lives after<br/>\nthey&#39;re grown.  I used to remind my husband he had thirty three years to<br/>\ndo what he wanted before Dylan was born and he&#39;d have, (maybe&lt;g&gt;) <br/>\nthat much more after Dylan was grown.<br/>\n<br/>\nAnd more than that we get no guarantees our kids will always be with us. <br/>\nThat we&#39;ll have them long enough to watch them grow up.  No guarantees at<br/>\nall that we get a tomorrow. <br/>\n<br/>\nI feel sad when I hear women talk like they can only find fulfillment<br/>\naway from their kids.  That the best way to be a good parent is to put<br/>\nthemselves first. I don&#39;t agree with that, I think our children always<br/>\nneed to come first.  I think there are ways for moms to get a few quiet<br/>\nminutes to calm down, or think or just plain rest while their little ones<br/>\nare little and require a lot of energy and I don&#39;t think imposing a<br/>\nbedtime is the best way to do it.  Get up a little early, stay up a<br/>\nlittle later or  let dad play with them. <br/>\n<br/>\nI didn&#39;t think these women were talking about getting away from their<br/>\nkids, I assumed they were talking about getting a few moments alone to<br/>\npee, or eat or write a shopping list.&lt;g&gt; <br/>\n<br/>\nDeb L</div>","specialLinks":[]},{"userId":1512150,"authorName":"Peggy","from":"Peggy &lt;peggy@...&gt;","profile":"margotapple","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Adult time","postDate":"1034626335","msgId":46325,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNEQUIyNTFGLkJGRjI5NjFCQGxpbm1heC5zYW8uYXJpem9uYS5lZHU+","referencesHeader":"PDIwMDIxMDE0LjEyMjAzOS4xMjUyLjIuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":46317,"nextInTopic":46329,"prevInTime":46324,"nextInTime":46326,"topicId":46256,"numMessagesInTopic":0,"msgSnippet":"Who could possibly decide in advance what kind of time they will have with their young children? Some children need more of a parent s time and commitment when","messageBody":"<div id=\"ygrps-yiv-1141917384\">Who could possibly decide in advance what kind of time they will have with<br/>\ntheir young children? Some children need more of a parent&#39;s time and<br/>\ncommitment when young. I always look on it as, &quot;You can pay now, or you can<br/>\npay (and pay and pay and pay) later.&quot; Both of my children were high need, but<br/>\nI didn&#39;t really understand how or why until they were older than five.  Now I<br/>\ncan look back and see what I didn&#39;t see before. Now I understand why some<br/>\nthings were so difficult. That&#39;s hard to do when you are right in the middle<br/>\nof it. <br/>\n<br/>\nThe very same qualities that made them high need when babies are the qualities<br/>\nthat I value today: sensitivity, intelligence, awareness, curiosity,<br/>\ncreativity. The more that I see and hear and read about early childhood<br/>\nexperience, the more I am convinced that we help create mental weakness in our<br/>\nchildren or even possible illness when we do not treat them sensitively and<br/>\nresponsibly and put their needs before our own. We are the adults. If we can&#39;t<br/>\nwait for some idealized and scheduled &quot;me time&quot;, no matter what is happening<br/>\nto our children emotionally and physically, then maybe we weren&#39;t mature<br/>\nenough to have children. Every child is different and I don&#39;t know which would<br/>\nworry me less: the noisy child who lets the adults around him know when he is<br/>\nnot happy, or the &quot;good&quot; baby who has given up getting what he needs and sits<br/>\nplacid and undemanding in his playpen. <br/>\n<br/>\nYoung babies and children are a lot of work and take intense care and<br/>\ncommitment especially in their first vulnerable years. The things that they<br/>\nlearn in those early years, about trust and caring and being human, will last<br/>\nthem for the rest of their lives. Those lessons are NEVER forgotten, unlike<br/>\nlater lessons. The early years affect the later years of a child&#39;s life with<br/>\ndisproportionate influence; just because they are not verbal does not mean<br/>\nthey do not remember -- they remember with every fiber of their being. When<br/>\npeople tell parents that children are resilient and that they recover from<br/>\ntheir experiences easily, they do so to make the *parent* feel good and to<br/>\nease the *parent&#39;s* guilt. When we feel guilty we need to examine our<br/>\nconscience and change our attitudes and actions if we need to, not bury our<br/>\nguilt under pleasant platitudes that contain key phrases like, &quot;all parents&quot;<br/>\nand &quot;kids get over it&quot;, and &quot;everyone needs.&quot; I&#39;m old enough to see have seen<br/>\nway too many grown-up children who didn&#39;t get over it and suffer terribly from<br/>\nnot getting their early needs met because their parents were too needy<br/>\nthemselves. Stop the Cycle and create a life for your children that will equip<br/>\nthem to be responsible parents themselves. In other words, we need to get over<br/>\nourselves, and get on with acting as adults for our children. There is no job,<br/>\nno accolade, no perk that will make us feel better in the future if we screw<br/>\nup raising our children now. <br/>\n<br/>\nAs John Lennon said, &quot;Life is what happens while you are busy making other<br/>\nplans. <br/>\n<br/>\nPeggy<br/>\n<br/>\nDeborah  wrote:<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; *** Do I understand you all correctly in saying that you as the adult do<br/>\n&gt; not have the right to claim any time to yourself??***<br/>\n&gt; <br/>\n&gt; You do have the right to claim time for yourself.   It&#39;s that you don&#39;t<br/>\n&gt; necessarily have the right to control someone else&#39;s time  in order to do<br/>\n&gt; so.<br/>\n&gt; <br/>\n&gt; Have your husband help you  as someone else suggested.  Find an older<br/>\n&gt; neighborhood kid who would come and play with your little ones for a few<br/>\n&gt; hours.  Trade with other moms.<br/>\n&gt; <br/>\n&gt; They&#39;re little for such a short time and getting bigger now and then big<br/>\n&gt; forever.<br/>\n&gt; <br/>\n&gt; I used to get up with my husband  at two, when he left for work and stay<br/>\n&gt; up, to have those few hours for myself, to read or dust or clean the tub<br/>\n&gt; or just watch a movie I&#39;d been wanting to see without having someone<br/>\n&gt; shove a peanut butter and jelly sandwich in the VCR.&lt;g&gt;<br/>\n&gt; <br/>\n&gt; The down side to that is now I sleep four hours and I&#39;m awake and that&#39;s<br/>\n&gt; that, whether I like it or not.  But there&#39;s still that alone time!<br/>\n&gt; <br/>\n&gt; Dylan has never had a bed time, goes to bed when I do sometimes and<br/>\n&gt; sometimes stays up to finish a movie or a drawing, or just because.  He&#39;s<br/>\n&gt; ten now and remembers those times he fell asleep on the piano bench or<br/>\n&gt; under the table.&lt;g&gt;<br/>\n&gt; <br/>\n&gt; When Dylan was four we took care of my little nephew for a year.  He was<br/>\n&gt; a year old when he came to us and was a special needs baby, who had to be<br/>\n&gt; fed through a tube and needed to be on a monitor at night, etc.  It was a<br/>\n&gt; difficult time and his mom was a single parent with an older child and<br/>\n&gt; simply burned out trying to do it all herself.  I was much older, and had<br/>\n&gt; the help of my husband and that makes all the difference.<br/>\n&gt; <br/>\n&gt; Deb L<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":74604204,"authorName":"Deborah Lewis","from":"Deborah Lewis &lt;ddzimlew@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Adult time","postDate":"1034615239","msgId":46317,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIxMDE0LjEyMjAzOS4xMjUyLjIuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":46307,"nextInTopic":46325,"prevInTime":46316,"nextInTime":46318,"topicId":46256,"numMessagesInTopic":0,"msgSnippet":"*** Do I understand you all correctly in saying that you as the adult do not have the right to claim any time to yourself??*** You do have the right to claim","messageBody":"<div id=\"ygrps-yiv-1653726194\">*** Do I understand you all correctly in saying that you as the adult do<br/>\nnot have the right to claim any time to yourself??***<br/>\n<br/>\nYou do have the right to claim time for yourself.   It&#39;s that you don&#39;t<br/>\nnecessarily have the right to control someone else&#39;s time  in order to do<br/>\nso.  <br/>\n<br/>\nHave your husband help you  as someone else suggested.  Find an older<br/>\nneighborhood kid who would come and play with your little ones for a few<br/>\nhours.  Trade with other moms.  <br/>\n<br/>\nThey&#39;re little for such a short time and getting bigger now and then big<br/>\nforever.  <br/>\n<br/>\nI used to get up with my husband  at two, when he left for work and stay<br/>\nup, to have those few hours for myself, to read or dust or clean the tub<br/>\nor just watch a movie I&#39;d been wanting to see without having someone<br/>\nshove a peanut butter and jelly sandwich in the VCR.&lt;g&gt;<br/>\n<br/>\nThe down side to that is now I sleep four hours and I&#39;m awake and that&#39;s<br/>\nthat, whether I like it or not.  But there&#39;s still that alone time!  <br/>\n<br/>\nDylan has never had a bed time, goes to bed when I do sometimes and<br/>\nsometimes stays up to finish a movie or a drawing, or just because.  He&#39;s<br/>\nten now and remembers those times he fell asleep on the piano bench or<br/>\nunder the table.&lt;g&gt;<br/>\n<br/>\nWhen Dylan was four we took care of my little nephew for a year.  He was<br/>\na year old when he came to us and was a special needs baby, who had to be<br/>\nfed through a tube and needed to be on a monitor at night, etc.  It was a<br/>\ndifficult time and his mom was a single parent with an older child and<br/>\nsimply burned out trying to do it all herself.  I was much older, and had<br/>\nthe help of my husband and that makes all the difference.  <br/>\n<br/>\nDeb L</div>","specialLinks":[]},{"userId":8226888,"authorName":"the_clevengers","from":"&quot;the_clevengers&quot; &lt;diamondair@...&gt;","profile":"the_clevengers","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Adult time","postDate":"1034609566","msgId":46307,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGFvZW8ydStsMDRiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAxZjMwMWMyNzI3MCQ5OTdiNjY2MCRkODk3MzdkMkBocHBhdj4="},"prevInTopic":46291,"nextInTopic":46317,"prevInTime":46306,"nextInTime":46308,"topicId":46256,"numMessagesInTopic":0,"msgSnippet":"... saying that you do not take any time for you all. If you answer is yes you take time, whenever your kids do other things, I ask what if your kids aren t","messageBody":"<div id=\"ygrps-yiv-624605670\">--- In Unschooling-dotcom@y..., &quot;Dalene and Andy&quot; &lt;mactier@x&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; So please tell me again, do I understand you all correctly in <br/>\n </span></blockquote>saying that you do not take any time for you all. If you answer is <br/>\nyes you take time, whenever your kids do other things, I ask what if <br/>\nyour kids aren&#39;t old enough to have their own interests, like mine??&lt;&lt;<br/>\n<br/>\n<br/>\nMy kids are about the same ages as yours (they just turned 6 and 3 in <br/>\nthe last month). They only sleep about 9 hours a night, so getting my <br/>\nown time alone when they&#39;re asleep is a lost cause in our house! I <br/>\nblame DH&#39;s genetics, he only sleeps 5 hours a night.<br/>\n<br/>\nBut I also firmly believe in time to myself. In fact, it was part of <br/>\nour &quot;parenting contract&quot; that I made with DH before getting pregnant. <br/>\nI knew that I couldn&#39;t deal with parenting unless I got an hour or <br/>\ntwo a day to myself to exercise, which is my way of recharging. So <br/>\nour deal was that I get two hours to myself each day, regardless. <br/>\nThere are days when that doesn&#39;t work out - if he&#39;s swamped at work <br/>\nor whatever, but those are few and far between. Some days when he&#39;s <br/>\nreal busy, I do a workout swap with another mom friend. The kids have <br/>\na playdate and first one, then the other of us goes out for a run or <br/>\nwhatever we want to do. In a 3 hour playdate, that means we each get <br/>\nan hour and a half to ourselves and the kids have a blast. Sometimes <br/>\nthere will be several moms and we take turns, and we have done this <br/>\nat parks, the beach, etc. I sometimes use the childcare at the gym so <br/>\nI can do yoga, spinning, or other classes. Also, DH comes along when <br/>\nI do triathlons (my main interest) and watches the kids, or else if <br/>\nit is a local race, I just leave the kids at home for a few hours <br/>\nwhile I go and do it. While I&#39;m very much an attachment parent and <br/>\nnursing mother, at the ages they&#39;re at now they&#39;re completely capable <br/>\nof hanging out with dad for half a day here and there.<br/>\n<br/>\nLast winter, I started writing a novel, and while I was doing that, <br/>\nDH tried to give me an additional two hours a day to go out of the <br/>\nhouse with my laptop and write. Yes, I married a peach of a guy! But <br/>\nI&#39;m also very firm about what my needs are and I make sure that he <br/>\nrespects them. There are times when it is tough, but I&#39;m with the <br/>\nkids the other 20 - 22 hours a day, I don&#39;t think it is too much to <br/>\nask to have 2 - 4 hours by myself to accomplish my own goals.<br/>\n<br/>\nWhen my kids were younger, other creative ways I&#39;d get &quot;me&quot; time <br/>\nwould be to go running with them in the jogging stroller or biking <br/>\nwith them in my bike trailer. Also, they napped when they were <br/>\nyounger, so that left some time for me. I would read books while <br/>\nlying down and nursing too, or do my internet time while the littlest <br/>\nwas nursing. As they&#39;ve gotten older, I&#39;ve realized that I had to cut <br/>\nway back on my internet time as it was sucking up a lot of my free <br/>\ntime. So I haven&#39;t posted on this list in probably close to a year, <br/>\nand I only read it occasionally. Sometimes you have more free time <br/>\nthan you think, but if you don&#39;t keep clear priorities about what you <br/>\nwant to do with it, it gets frittered away. Creating or finding a <br/>\ngood group of friends that are also parents can also be a great way <br/>\nto share child-watching duties and get free time either as an <br/>\nindividual, or as a couple. Utilizing grandparents and other people <br/>\nin your life can help, if they&#39;re available.<br/>\n<br/>\nBlue Skies,<br/>\n-Robin-</div>","specialLinks":[]},{"userId":117369878,"authorName":"Kelli Traaseth","from":"Kelli Traaseth &lt;kellitraas@...&gt;","profile":"kellitraas","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: Adult time","postDate":"1034538996","msgId":46291,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIxMDEzMTk1NjM2LjY3MjcxLnFtYWlsQHdlYjQwMTEwLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDBIM1gwMDVON0YyUDEyQG10YTYuc25mYzIxLnBiaS5uZXQ+"},"prevInTopic":46268,"nextInTopic":46307,"prevInTime":46290,"nextInTime":46292,"topicId":46256,"numMessagesInTopic":0,"msgSnippet":"We are just getting to this age right now; ds 9, dd 8, dd 5.   And it is quite challenging,  they like to stay up until about 10:00.  And I m peetering out","messageBody":"<div id=\"ygrps-yiv-64555064\">We are just getting to this age right now; ds 9, dd 8, dd 5.   And it is quite challenging,  they like to stay up until about 10:00.  And I&#39;m peetering out about 9:00, they are also very talkative.  They know I&#39;ve been with them all day so from 9 to 10 they are kind-of on their own.  My husband then takes a more active role,  they will read or play together.  I have noticed that bed times are going alot more smoothly if we aren&#39;t rushing it.  My husband and I also know that this time in our lives will end very soon.  We will have lots of time together when the kids are grown.  I do take my own time in the early a.m. (my yoga time) but I also feel like I have chosen to have children and take time for them also! <br/>\nTake Care,<br/>\nKelli<br/>\n Pam Hartley &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pamhartley@...\">pamhartley@...</a>&gt; wrote:<br/>\n<br/>\n----------<br/>\n<blockquote><span title=\"ireply\"> &gt;From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a><br/>\n&gt;To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a><br/>\n&gt;Subject: [Unschooling-dotcom] Digest Number 2478<br/>\n&gt;Date: Sun, Oct 13, 2002, 2:17 AM<br/>\n&gt;<br/>\n<br/>\n&gt; So please tell me again, do I understand you all correctly in saying that<br/>\n&gt; you do not take any time for you all. If you answer is yes you take time,<br/>\n&gt; whenever your kids do other things, I ask what if your kids aren&#39;t old<br/>\n&gt; enough to have their own interests, like mine??<br/>\n<br/>\n<br/>\n </span></blockquote>First, I have just got beyond the stage of very-very-young-children and I<br/>\nunderstand feeling like you&#39;ll jump out the window if you can&#39;t have five<br/>\nminutes by yourself. :)<br/>\n<br/>\nI do not have bedtimes for either of my children (very brief exception was<br/>\nthere was a time when both were afraid of being the &quot;last one awake&quot; even if<br/>\nsomeone else was sleeping in the room with them. Since they could at that<br/>\npoint simply outlast me, we did all work it out here to have temporary<br/>\nbedtime for all of us for a few months -- theirs being an hour before mine,<br/>\nso I would be &quot;last awake&quot;), until they were no longer afraid to be the last<br/>\nperson awake in the household, then we gratefully reverted to &quot;no bedtime&quot;.<br/>\n<br/>\nAt five and two, your children are sleeping longer hours than you are,<br/>\neither in nap time or in actual stretch of time at night, or both. So if you<br/>\nneed 8 hours and they need 12 hours, you can get some &quot;alone time&quot; right<br/>\nthere (unless they are helpfully on different schedules entirely &lt;g&gt; I know<br/>\nthat happens, too!)<br/>\n<br/>\nIf that fails, you can and should hand them off to your husband a couple of<br/>\ntimes per week the moment he walks in the door at night and have him take<br/>\nthem to the mall or any other safe indoor space, or stay home with them<br/>\nwhile YOU go out or go take a bath or a nap or whatever you want. If<br/>\nweekdays are too hectic for this, do it on a weekend. You may not get &quot;time<br/>\nto yourself&quot; every day. It&#39;s not necessarily a reasonable goal at their<br/>\nages. But if you get time to yourself with some regularity it&#39;ll help. :)<br/>\n<br/>\nMy husband had a really, really hard time believing me when I told him that<br/>\nour time as &quot;just&quot; Mommy and Daddy and not nearly often enough Husband and<br/>\nWife was a temporary thing while we had very young children, not permanent.<br/>\nHe was wrong, I was right, ha ha. &lt;ggg&gt; Now, with mine 7 and 5, it&#39;s a very<br/>\nsimple matter to tell them &quot;Our door is going to be closed for awhile&quot;. If<br/>\nthey need something urgent, they can knock.<br/>\n<br/>\nThey will learn to play on their own. I was not sure what you meant about<br/>\nthe television: that they aren&#39;t interested in watching it, or that you<br/>\nrestrict it so they can&#39;t? If the latter, that&#39;s a whole nother control<br/>\ntopic beyond bedtimes, but I always enjoy that debate, too. ;)<br/>\n<br/>\nPam<br/>\n<br/>\nYahoo! Groups SponsorADVERTISEMENT<br/>\n<br/>\n~~~~ Don&#39;t forget! If you change topics, change the subject line! ~~~~<br/>\n<br/>\nIf you have questions, concerns or problems with this list, please email the moderator, Joyce Fetteroll (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a>), or the list owner, Helen Hegener (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Editor@...\">HEM-Editor@...</a>).<br/>\n<br/>\nTo unsubscribe from this group, click on the following link or address an email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-unsubscribe@yahoogroups.com\">Unschooling-dotcom-unsubscribe@yahoogroups.com</a> <br/>\n<br/>\nVisit the Unschooling website: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> <br/>\n<br/>\nYour use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\nFaith Hill - Exclusive Performances, Videos, & more<br/>\nfaith.yahoo.com<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2523757,"authorName":"Pam Hartley","from":"Pam Hartley &lt;pamhartley@...&gt;","profile":"pdhartley2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Adult time","postDate":"1034523025","msgId":46268,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBIM1gwMDVON0YyUDEyQG10YTYuc25mYzIxLnBiaS5uZXQ+"},"prevInTopic":46265,"nextInTopic":46291,"prevInTime":46267,"nextInTime":46269,"topicId":46256,"numMessagesInTopic":0,"msgSnippet":"... First, I have just got beyond the stage of very-very-young-children and I understand feeling like you ll jump out the window if you can t have five minutes","messageBody":"<div id=\"ygrps-yiv-536700071\">----------<br/>\n<blockquote><span title=\"ireply\"> &gt;From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a><br/>\n&gt;To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a><br/>\n&gt;Subject: [Unschooling-dotcom] Digest Number 2478<br/>\n&gt;Date: Sun, Oct 13, 2002, 2:17 AM<br/>\n&gt;<br/>\n<br/>\n&gt; So please tell me again, do I understand you all correctly in saying that<br/>\n&gt; you do not take any time for you all. If you answer is yes you take time,<br/>\n&gt; whenever your kids do other things, I ask what if your kids aren&#39;t old<br/>\n&gt; enough to have their own interests, like mine??<br/>\n<br/>\n<br/>\n </span></blockquote>First, I have just got beyond the stage of very-very-young-children and I<br/>\nunderstand feeling like you&#39;ll jump out the window if you can&#39;t have five<br/>\nminutes by yourself. :)<br/>\n<br/>\nI do not have bedtimes for either of my children (very brief exception was<br/>\nthere was a time when both were afraid of being the &quot;last one awake&quot; even if<br/>\nsomeone else was sleeping in the room with them. Since they could at that<br/>\npoint simply outlast me, we did all work it out here to have temporary<br/>\nbedtime for all of us for a few months -- theirs being an hour before mine,<br/>\nso I would be &quot;last awake&quot;), until they were no longer afraid to be the last<br/>\nperson awake in the household, then we gratefully reverted to &quot;no bedtime&quot;.<br/>\n<br/>\nAt five and two, your children are sleeping longer hours than you are,<br/>\neither in nap time or in actual stretch of time at night, or both. So if you<br/>\nneed 8 hours and they need 12 hours, you can get some &quot;alone time&quot; right<br/>\nthere (unless they are helpfully on different schedules entirely &lt;g&gt; I know<br/>\nthat happens, too!)<br/>\n<br/>\nIf that fails, you can and should hand them off to your husband a couple of<br/>\ntimes per week the moment he walks in the door at night and have him take<br/>\nthem to the mall or any other safe indoor space, or stay home with them<br/>\nwhile YOU go out or go take a bath or a nap or whatever you want. If<br/>\nweekdays are too hectic for this, do it on a weekend. You may not get &quot;time<br/>\nto yourself&quot; every day. It&#39;s not necessarily a reasonable goal at their<br/>\nages. But if you get time to yourself with some regularity it&#39;ll help. :)<br/>\n<br/>\nMy husband had a really, really hard time believing me when I told him that<br/>\nour time as &quot;just&quot; Mommy and Daddy and not nearly often enough Husband and<br/>\nWife was a temporary thing while we had very young children, not permanent.<br/>\nHe was wrong, I was right, ha ha. &lt;ggg&gt; Now, with mine 7 and 5, it&#39;s a very<br/>\nsimple matter to tell them &quot;Our door is going to be closed for awhile&quot;. If<br/>\nthey need something urgent, they can knock.<br/>\n<br/>\nThey will learn to play on their own. I was not sure what you meant about<br/>\nthe television: that they aren&#39;t interested in watching it, or that you<br/>\nrestrict it so they can&#39;t? If the latter, that&#39;s a whole nother control<br/>\ntopic beyond bedtimes, but I always enjoy that debate, too. ;)<br/>\n<br/>\nPam</div>","specialLinks":[]},{"userId":99826381,"authorName":"Mary Bianco","from":"&quot;Mary Bianco&quot; &lt;mummyone24@...&gt;","profile":"mummyone24","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Adult time","postDate":"1034521014","msgId":46265,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYxMzBVOFFWanAzYjZ1SVUxR2owMDAwMDBmOEBob3RtYWlsLmNvbT4="},"prevInTopic":46263,"nextInTopic":46268,"prevInTime":46264,"nextInTime":46266,"topicId":46256,"numMessagesInTopic":0,"msgSnippet":"Hi Darlene, My children are 16, 7, 6 and 2. The oldest of course pretty much comes and goes as she pleases. But again there are always her friends and","messageBody":"<div id=\"ygrps-yiv-1375684351\">Hi Darlene,<br/>\n<br/>\nMy children are 16, 7, 6 and 2. The oldest of course pretty much comes and <br/>\ngoes as she pleases. But again there are always her friends and boyfriend <br/>\nhere too. Part of the deal and when they are here, I don&#39;t mind at all. <br/>\nExcept for raiding the kitchen, we don&#39;t see them a lot!!!<br/>\nThe 6 and 7 year olds keep themselves busy pretty much although they have <br/>\nmany times during the day where there are questions or they want to play a <br/>\ngame or read a book and I&#39;m included in on that. My 2 year old, is just <br/>\ngetting to the point where she can spend some time alone. Notice I said <br/>\nsome! She will play with the other two and then there are many times when <br/>\nshe wants me to play with her. So like, I&#39;m on pretty much all day long. I <br/>\nalso have cats, dogs, fish and a snake in this array to take care of.<br/>\n<br/>\nI put the 2 year old down for a nap every day. She can go without it but <br/>\nturns into a bear so off she goes at 3:00. That&#39;s usually when the other 2 <br/>\nwatch TV for the day and I get to have breakfast. I try to do it in the <br/>\nliving room so I can have my alone time. I need alone time. That&#39;s it for me <br/>\nfor the day. I get about a good hour if I&#39;m lucky and then off to houseclean <br/>\nor wash something!<br/>\n<br/>\nMy husband is home at around 7:00 and spends the rest of the evening pretty <br/>\nmuch non stop with the kids. Our alone time is when the kids all go to bed. <br/>\nWe don&#39;t have a set bedtime but we do suggest to the younger three around <br/>\n11:00 or so. Sometimes later, like last night we all watched Scorpion King <br/>\nand it was after 11:30 when it ended. Our two younger girls need their <br/>\nsleep. Our son could go all night long without it. He went to bed at <br/>\nmidnight last night and woke up at 9:00 this morning. That&#39;s all he needs <br/>\nand he constantly goes and never stops talking unless something on TV <br/>\ncatches his mind.<br/>\n<br/>\nSo I know what you are saying.<br/>\n<br/>\nWhen it&#39;s bedtime for the kids, I usually hit the computer or watch TV with <br/>\nmy husband. But he goes to bed earlier than I as he gets up early. So our <br/>\nalone time is pretty much slim at home. I usually stay up until 2:00 and <br/>\nthat&#39;s my time I need. I need to spend quiet time by myself. My husband and <br/>\nI will grab time on the weekends by doing dinner and a movie or once in <br/>\nawhile running off together to Target or something!!! I know it&#39;s hard but I <br/>\nfigure it will get better as the kids get older. My husband and I try hard <br/>\nto make the time we have alone count. Sometimes just walking the dogs gives <br/>\nus some good conversation time. We make sure we don&#39;t lose ourselves so when <br/>\nthe kids are all gone, we still recognize each other!!!<br/>\n<br/>\nIt works for us but I would say if a parent or a couple need more time, they <br/>\nshould take it. Not at the expense of their children, but to make time to <br/>\nhave to themselves. Just as some moms need time to get out alone, some <br/>\ncouples need time alone too. What the parents need I think is a big priority <br/>\nas if they don&#39;g get it, the kids will suffer. I think people here were just <br/>\nsaying not to send them to bed at 8:00 if they are no where near sleepy just <br/>\nto be alone with them. It&#39;s a compromise.<br/>\n<br/>\nMary B<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n_________________________________________________________________<br/>\nChat with friends online, try MSN Messenger: <a rel=\"nofollow\" target=\"_blank\" href=\"http://messenger.msn.com\">http://messenger.msn.com</a></div>","specialLinks":[]},{"userId":10645038,"authorName":"sal3school","from":"&quot;sal3school&quot; &lt;sal3school@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Adult time","postDate":"1034517522","msgId":46263,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMmMwMWMyNzJjMCRhNTQyYzkyMCQxMDAxMmE0MkBvZW1jb21wdXRlcj4=","referencesHeader":"PDAxZjMwMWMyNzI3MCQ5OTdiNjY2MCRkODk3MzdkMkBocHBhdj4="},"prevInTopic":46256,"nextInTopic":46265,"prevInTime":46262,"nextInTime":46264,"topicId":46256,"numMessagesInTopic":0,"msgSnippet":"I hear you Dalene and Andy! I talked to my husband about the recent messages and he agrees w/ me-we need time alone to recharge our batteries. I feel this is","messageBody":"<div id=\"ygrps-yiv-1003786463\">I hear you Dalene and Andy!<br/>\nI talked to my husband about the recent messages and he agrees w/ me-we need<br/>\ntime alone to recharge our batteries. I feel this is good for us and the<br/>\nkids and yes, I know we are going to have these children for the next 18<br/>\nplus years God willing. We love our children and consider them Blessings,<br/>\nbut I don&#39;t feel we need to be glued at the waist at every minute of the<br/>\nday! We have off and on times. Sometimes my kids play alone and sometimes we<br/>\ndo things together. So long, Amy<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message -----<br/>\nFrom: Dalene and Andy &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mactier@...\">mactier@...</a>&gt;<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a>&gt;<br/>\nSent: Saturday, October 12, 2002 9:25 PM<br/>\nSubject: [Unschooling-dotcom] Adult time<br/>\n<br/>\n<br/>\n&gt; I&#39;m catching up on the bedtime discussion. Do I understand you all<br/>\ncorrectly in saying that you as the adult do not have the right to claim any<br/>\ntime to yourself??<br/>\n&gt;<br/>\n&gt; That seems a very unkind to yourself??<br/>\n&gt;<br/>\n&gt; I have a two-year old and a five-year old. They get up anything from 7:00<br/>\nin the mornings. I&#39;m blessed with two talkative children. They talk non-stop<br/>\nand ask questions, sometimes without a pause. I don&#39;t drop them off, nobody<br/>\nbaby sit them, they don&#39;t spend hours entertained in front of the TV and<br/>\nthey will only play where I am. So we spend the entire day together,<br/>\ninteracting with each other.<br/>\n&gt;<br/>\n&gt; At night time, I&#39;m done. The eldest one has a bedtime - 8:30 - his father<br/>\nset it - storytime and then he is allowed to do whatever he wishes, but he<br/>\nneed to stay in his room. The room is right next to us, so he is not scared<br/>\nor lonely. It doesn&#39;t seem as he finds it stressful, but I hear you that one<br/>\ncan&#39;t always tell what stresses them and what not. We have a bedtime for<br/>\nhim, to give us some time out. I need time on my own, in peace to recharge.<br/>\nI honestly believe that if I don&#39;t get that, at all, I won&#39;t be a very good<br/>\nmother. To be honest, I think my husband is the one that is being neglected<br/>\nby me, because he doesn&#39;t get much time from me. My husband usually uses<br/>\nthis time to watch the news - something he doesn&#39;t do when the kids are<br/>\nawake, because of all the violence on TV.<br/>\n&gt;<br/>\n&gt; Another issue is, that my son gets up at 7:00 to see his Dad off to work<br/>\nin the mornings. So in all honesty he needs a certain number of hours to be<br/>\nable to get through the days. He doesn&#39;t nap, and he can keep himself awake<br/>\nfar longer than what is good for him - like Mum and Dad.<br/>\n&gt;<br/>\n&gt; With the youngest one we&#39;re still a bit more flexible, because she naps in<br/>\nthe afternoon, and then sometimes she is not tired at nights. But we do try<br/>\nto get her to go bed the same time than her brother, but it doesn&#39;t always<br/>\nwork out.<br/>\n&gt;<br/>\n&gt; So please tell me again, do I understand you all correctly in saying that<br/>\nyou do not take any time for you all. If you answer is yes you take time,<br/>\nwhenever your kids do other things, I ask what if your kids aren&#39;t old<br/>\nenough to have their own interests, like mine??<br/>\n&gt;<br/>\n&gt; Dalene<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ~~~~ Don&#39;t forget! If you change topics, change the subject line! ~~~~<br/>\n&gt;<br/>\n&gt; If you have questions, concerns or problems with this list, please email<br/>\nthe moderator, Joyce Fetteroll (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a>), or the list owner,<br/>\nHelen Hegener (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Editor@...\">HEM-Editor@...</a>).<br/>\n&gt;<br/>\n&gt; To unsubscribe from this group, click on the following link or address an<br/>\nemail to:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-unsubscribe@yahoogroups.com\">Unschooling-dotcom-unsubscribe@yahoogroups.com</a><br/>\n&gt;<br/>\n&gt; Visit the Unschooling website: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n&gt;<br/>\n&gt; Your use of Yahoo! Groups is subject to <a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n-------------------------------------------<br/>\nIntroducing NetZero Long Distance<br/>\nUnlimited Long Distance only $29.95/ month!<br/>\nSign Up Today! www.netzerolongdistance.com </span></blockquote></div>","specialLinks":[]},{"userId":80046248,"authorName":"Dalene and Andy","from":"&quot;Dalene and Andy&quot; &lt;mactier@...&gt;","profile":"mactiers","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Adult time","postDate":"1034483142","msgId":46256,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxZjMwMWMyNzI3MCQ5OTdiNjY2MCRkODk3MzdkMkBocHBhdj4="},"prevInTopic":0,"nextInTopic":46263,"prevInTime":46255,"nextInTime":46257,"topicId":46256,"numMessagesInTopic":0,"msgSnippet":"I m catching up on the bedtime discussion. Do I understand you all correctly in saying that you as the adult do not have the right to claim any time to","messageBody":"<div id=\"ygrps-yiv-2023195808\">I&#39;m catching up on the bedtime discussion. Do I understand you all correctly in saying that you as the adult do not have the right to claim any time to yourself??<br/>\n<br/>\nThat seems a very unkind to yourself??<br/>\n<br/>\nI have a two-year old and a five-year old. They get up anything from 7:00 in the mornings. I&#39;m blessed with two talkative children. They talk non-stop and ask questions, sometimes without a pause. I don&#39;t drop them off, nobody baby sit them, they don&#39;t spend hours entertained in front of the TV and they will only play where I am. So we spend the entire day together, interacting with each other.<br/>\n<br/>\nAt night time, I&#39;m done. The eldest one has a bedtime - 8:30 - his father set it - storytime and then he is allowed to do whatever he wishes, but he need to stay in his room. The room is right next to us, so he is not scared or lonely. It doesn&#39;t seem as he finds it stressful, but I hear you that one can&#39;t always tell what stresses them and what not. We have a bedtime for him, to give us some time out. I need time on my own, in peace to recharge. I honestly believe that if I don&#39;t get that, at all, I won&#39;t be a very good mother. To be honest, I think my husband is the one that is being neglected by me, because he doesn&#39;t get much time from me. My husband usually uses this time to watch the news - something he doesn&#39;t do when the kids are awake, because of all the violence on TV.<br/>\n<br/>\nAnother issue is, that my son gets up at 7:00 to see his Dad off to work in the mornings. So in all honesty he needs a certain number of hours to be able to get through the days. He doesn&#39;t nap, and he can keep himself awake far longer than what is good for him - like Mum and Dad.<br/>\n<br/>\nWith the youngest one we&#39;re still a bit more flexible, because she naps in the afternoon, and then sometimes she is not tired at nights. But we do try to get her to go bed the same time than her brother, but it doesn&#39;t always work out.<br/>\n<br/>\nSo please tell me again, do I understand you all correctly in saying that you do not take any time for you all. If you answer is yes you take time, whenever your kids do other things, I ask what if your kids aren&#39;t old enough to have their own interests, like mine??<br/>\n<br/>\nDalene<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":47067,"nextTopicId":46895}}