{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":11,"messages":[{"userId":0,"authorName":"Sandra Brown","from":"&quot;Sandra Brown&quot; &lt;sbrown2@...","replyTo":"LIST","senderId":"yJKFTUtA8B7whDxVdvA-xKk1N5JETBcbkzrb8riPkLX0OqPBJ9plrhXvOi79LbaXmAOcGISM_eoXIH3ciyqJbHcRmiRg4X5QThkO","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Trying School","postDate":"936360719","msgId":2491,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4xODMuMjQ5MS45NTkyNjk3NDFAZUdyb3Vwcy5jb20+"},"prevInTopic":2474,"nextInTopic":0,"prevInTime":2490,"nextInTime":2492,"topicId":2313,"numMessagesInTopic":0,"msgSnippet":"Wow, Sandra, I think the greatest lesson of all during this experience will be how much you value your daughter s feelings. I can t think of anything ","messageBody":"<div id=\"ygrps-yiv-969107191\">&lt;snip&gt;Wow, Sandra, I think the greatest lesson of all during this experience<br/>\nwill<br/>\nbe how much you value your daughter&#39;s feelings. I can&#39;t think of anything<br/>\nmore important for a kid to know!   Lori in TX<br/>\n<br/>\n<br/>\nThank you , Lori.  You are so right.  Last night the bugs started crawling<br/>\nout, Emily started telling me about how mean most of the boys are with<br/>\nteasing and being rowdy in class.  The teacher is constantly telling them to<br/>\nto be quiet or sit down.  I don&#39;t know if this is a problem with the kids,<br/>\nor the teacher.  My gut feeling when I walked into her classroom ten minutes<br/>\nearly yesterday was that these kids were trouble!!  I told her that is<br/>\nalways a problem in school, and it makes it harder for her to to hear the<br/>\nteacher or get attention.  For the first time all week I contrasted school<br/>\nwith homeschooling, but she was firm.  She said she doesn&#39;t want to<br/>\nhomeschool because it&#39;s boring.<br/>\n<br/>\nSandra Brown<br/>\nAnn Arbor, MI</div>","specialLinks":[]},{"userId":0,"authorName":"RRAINENJ@xxx.xxx","from":"RRAINENJ@...","replyTo":"LIST","senderId":"XcdaHlxHY1K90cGaNAEX3xLH16nsYP1UBubwy8oaOJtCycPlQjq1HKyAa0KfCY1R8_zeZ6jYRg","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Trying School","postDate":"936285362","msgId":2474,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4xODIuMjQ3NC45NTkyNjk3NDFAZUdyb3Vwcy5jb20+"},"prevInTopic":2471,"nextInTopic":2491,"prevInTime":2473,"nextInTime":2475,"topicId":2313,"numMessagesInTopic":0,"msgSnippet":"Wow, Sandra, I think the greatest lesson of all during this experience will be how much you value your daughter s feelings. I can t think of anything more","messageBody":"<div id=\"ygrps-yiv-1670574314\">Wow, Sandra, I think the greatest lesson of all during this experience will <br/>\nbe how much you value your daughter&#39;s feelings. I can&#39;t think of anything <br/>\nmore important for a kid to know!   Lori in TX</div>","specialLinks":[]},{"userId":0,"authorName":"Sandra Brown","from":"&quot;Sandra Brown&quot; &lt;sbrown2@...","replyTo":"LIST","senderId":"-6vVohea5Ok0tB67oBuBY-P7H03OUXSPiqKCQRQAn03HD0EpiDaAsozSa5Es3BHR0uZS0Oi6D7M18h-TBOWKAY0VClOVZbr7sh9-","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Trying School","postDate":"936275047","msgId":2471,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4xODIuMjQ3MS45NTkyNjk3NDFAZUdyb3Vwcy5jb20+"},"prevInTopic":2440,"nextInTopic":2474,"prevInTime":2470,"nextInTime":2472,"topicId":2313,"numMessagesInTopic":0,"msgSnippet":"Well, today is Emily s third day of school and so far she loves the Open School.  She has made a lot of friends, and really likes her teacher. Interesting","messageBody":"<div id=\"ygrps-yiv-910010566\">Well, today is Emily&#39;s third day of school and so far she loves the Open<br/>\nSchool.  She has made a lot of friends, and really likes her teacher.<br/>\nInteresting coincidence, the principle of her school homeschooled her three<br/>\ngrown children through Clonlara, so she likes Emily right away.<br/>\n<br/>\nThe school is really interesting so far, they have morning Meetings and<br/>\nafternoon Choice where they can do just about anything.  Emily&#39;s teacher was<br/>\nreally impressed with her, and told me a neat little story when I picked her<br/>\nup yesterday.<br/>\n<br/>\nOn the first day everyone did introductions and Emily was the only child<br/>\nthere who  had homeschooled.  One of the boys piped up and said, &quot;That&#39;s<br/>\nwhere your Mom and Dad teach you the lessons.&quot; and Emily replied, &quot;my Mom<br/>\nand Dad don&#39;t teach me, I teach myself.&quot;  What a girl!<br/>\n<br/>\nMy only concern with her is that after the novelty wears off that she might<br/>\ngrow bored, but we&#39;ll cross that bridge when we come to it.  Of course now<br/>\nher two little sisters want to go school.  This is such a huge shift; we<br/>\nhave been a homeschooling family for *years*, and I have been a<br/>\nhomeschooling advocate/activist.  All of the reasons that we talk about<br/>\nhomeschooling are true; the school routine does take over your whole family.<br/>\nEvenings used to be full of projects and spontaneous trips; now we have to<br/>\nget everybody cleaned up and in bed for early rising.  Just having to get up<br/>\none hour earlier is taking some adjustment.<br/>\n<br/>\nWe&#39;ll see how things play out.  I keep reminding myself that she may do<br/>\nreally well in an open school, and also that it isn&#39;t necessarily permanent.<br/>\nShe may choose to come home next week, next month, or even next year.  She<br/>\nknows it&#39;s an option, something I didn&#39;t have when I hated school.<br/>\n<br/>\nAll that said, it&#39;s still a school, and they are held to following the<br/>\nstate&#39;s requirements.  No matter how good the teacher, I have trouble<br/>\nbelieving that any real learning can occur when material has to be packaged<br/>\nand presented to a group of children.  I fail to see how there can be any<br/>\nreal exploration and in depth personal learning and growth in the school<br/>\nmodel.  It all seems so superfical; there are collages in shoe boxes and<br/>\npaper mache models, but no garden!  It feels very cold and hard, inorganic.<br/>\nSo removed from real life.<br/>\n<br/>\nEnough of that; one of the things the parents there like about the Open<br/>\nSchool is that parents are welcomed and encouraged to participate at all<br/>\ntimes.  They even plan Open Fridays when parents are encouraged to come in<br/>\nand lead an activity of their interest and skills.  I can see that if Emily<br/>\nlasts, I will be starting a garden committee...<br/>\n<br/>\nSandra Brown<br/>\nAnn Arbor, MI</div>","specialLinks":[]},{"userId":0,"authorName":"Joel Hawthorne","from":"Joel Hawthorne &lt;jhawthorne@...","replyTo":"LIST","senderId":"_Yea5-W6CveCSXl9xUuj3DbeYx5IKN3HmxmhdbCrPag5CqzJJK-76-xhfZt0-oDI8WqIvA6-QL-sECgAPZZmYKuu5wrZCTvU-jiy","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Trying School","postDate":"936049474","msgId":2440,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4xNzkuMjQ0MC45NTkyNjk3NDFAZUdyb3Vwcy5jb20+"},"prevInTopic":2351,"nextInTopic":2471,"prevInTime":2439,"nextInTime":2441,"topicId":2313,"numMessagesInTopic":0,"msgSnippet":"Why not let her go a few days and discover she doesn t like it?  Is it costing money?  Are you afraid she will never stick to anything? Are you afraid she ","messageBody":"<div id=\"ygrps-yiv-732295765\">Why not let her go a few days and discover she doesn&#39;t like it?  Is it costing<br/>\nmoney?  Are you afraid she will never &quot;stick to&quot; anything? Are you afraid she<br/>\nwill regret having quit and always think it was better than it was?  Talk to her<br/>\nabout it if she decides to quit.  I think quitting after the first hour should<br/>\nbe an option.  Sometimes I know enough in a short time to quit something or<br/>\nleave some place that is obnoxious for me.<br/>\n<br/>\nSandra Brown wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; From: &quot;Sandra Brown&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sbrown2@...\">sbrown2@...</a>&gt;<br/>\n&gt;<br/>\n&gt; We are entering the next phase of our life adventures. My oldest, Emily, who<br/>\n&gt; will be eight in October, has been insistent that she wants to try school.<br/>\n&gt; After much time spent dicussing what she wanted to do and why, and<br/>\n&gt; discussing a number of alternative options, it seems to me that she has the<br/>\n&gt; idea that school is like an all day play date every day with a lot of kids.<br/>\n&gt; This from a sensitive, artist type girl who likes to spend a lot of time<br/>\n&gt; alone, and when we have a full calendar says to me, &quot;Mom, why do we have to<br/>\n&gt; go somewhere everyday?  Why can&#39;t someone come over our house?&quot;<br/>\n&gt;<br/>\n&gt; But she is adamant about going to school.  We are very fortunate to now be<br/>\n&gt; living in Ann  Arbor.  Where we used to live I wouldn&#39;t even dream about<br/>\n&gt; sending her to school.  So here we were able to investigate a wide range of<br/>\n&gt; private schools (none of which we could afford), several public charter<br/>\n&gt; schools, (all of which focused on Math, Science, and Technology; you know,<br/>\n&gt; prepare kids for the ecomony type education:^p) and the public Open school.<br/>\n&gt;<br/>\n&gt; Most of the families in our church send their children to the Open school,<br/>\n&gt; which is based on the philosophy that each child arrives at school with<br/>\n&gt; their own strengths and potential and it is up to the teacher to facilitate<br/>\n&gt; learning.  Also, each student is democratically represented, and time is<br/>\n&gt; spent on cooperation and comunication.  There is  a much higher (than<br/>\n&gt; traditional schools) number of field trips and guests, and each child is<br/>\n&gt; free to choose to be in any classroom, the media center, the music room, the<br/>\n&gt; art room, or the science lab throughout the day.<br/>\n&gt;<br/>\n&gt; So all things considered, I feel very fortunate that we have this option<br/>\n&gt; here.  I know if Emily had to go to traditional school, she probably<br/>\n&gt; wouldn&#39;t choose to, because she has already told me that she is not the<br/>\n&gt; sitting still do work all day kind of girl.  Still, I went through a period<br/>\n&gt; of wondering what  I did to fail her in some way.  I have realized that<br/>\n&gt; following my principles of respecting the child and trusting that they will<br/>\n&gt; commincate their needs to me,  responding to her and trusting her means<br/>\n&gt; having faith in her.<br/>\n&gt;<br/>\n&gt; My husband and I both agreed years ago that when the kids were old enough to<br/>\n&gt; choose, that they would have that option.  I am still dealing with my own<br/>\n&gt; unschooling ideals that any school, even an open school, is too far removed<br/>\n&gt; from the real world of society and the natural rhthym of nature to be<br/>\n&gt; useful.<br/>\n&gt;<br/>\n&gt; How many of you have had children choose to go to school?  How long do you<br/>\n&gt; think would be an appropriate trial period?  I don&#39;t want her to go for a<br/>\n&gt; few days and then want to quit because she&#39;s tired or something.  I think it<br/>\n&gt; would be important to go for at least 4-6 weeks to really give it a good<br/>\n&gt; effort, and get over the hump of adjusting to the routine.  Any suggestions?<br/>\n&gt;<br/>\n&gt; Sandra Brown<br/>\n&gt; Ann Arbor, MI<br/>\n&gt;<br/>\n&gt; --------------------------- ONElist Sponsor ----------------------------<br/>\n&gt;<br/>\n&gt; ONElist:  home to the world&#39;s liveliest email communities.<br/>\n&gt;<br/>\n&gt; ------------------------------------------------------------------------<br/>\n&gt; Check it out!<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n<br/>\n </span></blockquote>--<br/>\nbest wishes<br/>\nJoel<br/>\n<br/>\nAll children behave as well as they are treated. The Natural Child<br/>\nProject   <a rel=\"nofollow\" target=\"_blank\" href=\"http://naturalchild.com/home/\">http://naturalchild.com/home/</a><br/>\n<br/>\nWork together to reinvent justice using methods that are fair; which conserve,<br/>\nrestore and even create harmony, equity and good will in society i.e.<br/>\nrestorative justice.<br/>\nWe are the prisoners of the prisoners we have taken - J. Clegg<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.cerj.org\">http://www.cerj.org</a></div>","specialLinks":[]},{"userId":0,"authorName":"MORELFAM@xxx.xxx","from":"MORELFAM@...","replyTo":"LIST","senderId":"oNTR2L3ZP4TdpSivugbhPGkA6hTD_pXOzw6Z49pbaQXals4h64dJ970O9vSVUyIfZz-7xNKcOA","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Trying School","postDate":"935792277","msgId":2351,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4xNzMuMjM1MS45NTkyNjk3NDFAZUdyb3Vwcy5jb20+"},"prevInTopic":2337,"nextInTopic":2440,"prevInTime":2350,"nextInTime":2352,"topicId":2313,"numMessagesInTopic":0,"msgSnippet":"wow sandra, sounds like a neat school and that you have thought it thru quite well!  i am with you on the 4-6wk thing, bc it seems an adjustment period should","messageBody":"<div id=\"ygrps-yiv-1150340211\">wow sandra, sounds like a neat school and that you have thought it thru quite <br/>\nwell!  i am with you on the 4-6wk thing, bc it seems an adjustment period <br/>\nshould be expected and would taint a real assessment right off the bat.  good <br/>\nluck!  erin</div>","specialLinks":[]},{"userId":0,"authorName":"Sandra Brown","from":"&quot;Sandra Brown&quot; &lt;sbrown2@...","replyTo":"LIST","senderId":"Euhl0h1mDm60-tOt7umJXB3KfssL5dp7CEtNCLLlPaOwwss5bmhzXu0zJ9cIhFl3G0ZswUM12ZObsXCMuHTD0GgJi9qxS-WcyPJt","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Trying School","postDate":"935761790","msgId":2337,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4xNzMuMjMzNy45NTkyNjk3NDFAZUdyb3Vwcy5jb20+"},"prevInTopic":2318,"nextInTopic":2351,"prevInTime":2336,"nextInTime":2338,"topicId":2313,"numMessagesInTopic":0,"msgSnippet":"... them ... even ... 769-4511. ... Thank you Sam, Clonlara s tuition  is over $6K/year, something we could not afford.  They do have single classes for","messageBody":"<div id=\"ygrps-yiv-1263244323\"><blockquote><span title=\"ireply\">&gt; You know, since you&#39;re in Ann Arbor, you might want to look into Clonlara<br/>\n&gt; School...it&#39;s based on Holt&#39;s teachings.   I have my dd registered with<br/>\n </span></blockquote>them<br/>\n<blockquote><span title=\"ireply\"> &gt; just to keep everything legal, but they&#39;re very open.  I&#39;ve heard that<br/>\n </span></blockquote>even<br/>\n<blockquote><span title=\"ireply\"> &gt; at the actual school they don&#39;t use textbooks.  Just a suggestion.  Their<br/>\n&gt; address is 1289 Jewett, Ann Arbor, MI 48104...their phone is (734)<br/>\n </span></blockquote>769-4511.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Sam<br/>\n<br/>\n </span></blockquote>Thank you Sam, Clonlara&#39;s tuition  is over $6K/year, something we could not<br/>\nafford.  They do have single classes for homeschoolers (still a bit steep in<br/>\nmy opinion) which I offered to my daughter, but she refused. She wants to do<br/>\nthe whole day school thing of being there every day with all the other kids.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Their son made a list of all the questions they had about<br/>\n&gt; school.....everything  they were wondering about.<br/>\n&gt; Then, they made an appointment with the school principal, and the child<br/>\n&gt; interviewed the principal, and had all their questions answered......<br/>\n&gt; that was enough to change their mind.  I think it was a fantastic way<br/>\n&gt; for the decision to be made.<br/>\n<br/>\n </span></blockquote>We spent a lot of time writing lists of what Emily wanted to do and various<br/>\nways of accomplishing this.  We made lists of what she wanted to learn, what<br/>\nshe wanted to do, what she thought she might get out of school, why she<br/>\nwanted to go. We wrote down all of our options for school, and what it might<br/>\nbe like.  We called all of the local schools and asked questions.  We<br/>\nvisited the schools before we made our choice.  Emily was enamored of the<br/>\nOpen School, and looking forward to  being there with a lot of the kids from<br/>\nchurch.  Now my 5 year old twins want to go to school, but there are 45 kids<br/>\non a waiting list, so they&#39;ll  have to wait whether they like it or not!  I<br/>\nwant to wait a while and see how Emily fares before I go putting her sisters<br/>\non a waiting list at their young age.<br/>\n<br/>\nThank you so much those of you who wrote with suggestions.  I like the two<br/>\nday idea, too, but am thinking it is really hard to really get an idea of<br/>\nwhat the school is like in the first two days, especially a free place like<br/>\nthe Open School.  I think it takes the first week to get over being tired<br/>\nand unsure of what&#39;s going to happen next. I think I will sit down with<br/>\nEmily and ask her what she thinks, if she wants to talk about it after a<br/>\nweek, or after the first month.<br/>\n<br/>\nI am beginning to get over my own concerns (which I have kept to myself<br/>\nreally well) and trusting more.<br/>\n<br/>\nSandra Brown<br/>\nAnn Arbor, MI</div>","specialLinks":[]},{"userId":0,"authorName":"Campbell & Wyman","from":"Campbell & Wyman &lt;brynlee@...","replyTo":"LIST","senderId":"tMo93-uL4kqfqypvxVy1Z9iLxgYgNEqyddO0JZY90cRyWDuOsIpZa5fyzT_XOJqdEu1zbAQZDsgEy5WgM7EgYPi8wFd3QnawMg8G0XJIlFAU","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Trying School","postDate":"935677386","msgId":2318,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4xNzIuMjMxOC45NTkyNjk3NDFAZUdyb3Vwcy5jb20+"},"prevInTopic":2317,"nextInTopic":2337,"prevInTime":2317,"nextInTime":2319,"topicId":2313,"numMessagesInTopic":0,"msgSnippet":"Hi there, Our daughter was adamant about trying school at the same age as your daughter. She is now 10 and there is no looking back ...homeschooling is her No.","messageBody":"<div id=\"ygrps-yiv-1562448249\">Hi there,<br/>\n<br/>\nOur daughter was adamant about trying school at the same age as your<br/>\ndaughter. She is now 10 and there is no looking back ...homeschooling is<br/>\nher No. 1 choice.<br/>\n<br/>\nI must admit that it was a stretch to try to be positive about her choice<br/>\nto try school, but I did it.  We (dh and I) decided to let her try a school<br/>\nfor a few days so that if it was a disaster she could leave and save face.<br/>\nWe told her that after a two day trial she could decide whether to stay<br/>\nhome or try school for a semester. <br/>\n<br/>\nWe chose a school that we would have sent her to in the first place (if we<br/>\nhad to) and with her best buddy. We packed a lunch and drove to school. My<br/>\nheart was in my throat...<br/>\nFor two days she attended the school and didn&#39;t say anything much about the<br/>\nexperience but seemed keen to return the second day. I kept breathing...<br/>\n<br/>\nOn the second day as we drove home from school I asked, &quot;So, would like you<br/>\nlike to give school a try??&quot;<br/>\nHer response was solid. She did not want to return to an institution..she<br/>\nfound the space physically &#39;hard&#39; and unwelcoming (I found this<br/>\nparticularly interesting ...that she would key in on the hard floor, the<br/>\nconcrete walls, the hard desks, ..)and she found that she spent a lot of<br/>\ntime pretending to be doing work so that the teacher would not give her<br/>\nanother project (the kids taught her this...). She basically told me that<br/>\nit was a waste of her time and that she loved being able to work when she<br/>\nfelt like it.  &quot;I have decided to stay home until grade 12 and then I will<br/>\nwrite my exams for college,&quot; she said this with total authority. My life<br/>\nflashed before my eyes...I am here for a few more years  :)<br/>\n<br/>\nIn retrospect, I think that if we had fought her on her choice or given our<br/>\nopinions of school she might have stayed longer but we tried to stay out of<br/>\nher process. And I think that it must take a lot of courage to ask to go to<br/>\nschool if you know your parents are not too keen on the idea. I had to<br/>\nhonour her courageous (and inquisitive) act. I am glad that she went<br/>\nbecause she now knows that she is happiest at home.<br/>\n<br/>\nTake care, <br/>\nBrooke in British Columbia<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:brynlee@...\">brynlee@...</a></div>","specialLinks":[]},{"userId":0,"authorName":"Sam926@xxx.xxx","from":"Sam926@...","replyTo":"LIST","senderId":"UVo_8VZLtUFRfzEz6D_INRDpBBjRivDgy5IzKwFtt-lKrP8HmuP0F6ia0WVysAkPWf7gz8M","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Trying School","postDate":"935673002","msgId":2315,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4xNzIuMjMxNS45NTkyNjk3NDFAZUdyb3Vwcy5jb20+"},"prevInTopic":2314,"nextInTopic":2317,"prevInTime":2314,"nextInTime":2316,"topicId":2313,"numMessagesInTopic":0,"msgSnippet":"In a message dated 08/26/1999 8:55:47 AM Eastern Daylight Time, sbrown2@provide.net writes: ","messageBody":"<div id=\"ygrps-yiv-1814161248\">In a message dated 08/26/1999 8:55:47 AM Eastern Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sbrown2@...\">sbrown2@...</a> writes:<br/>\n<br/>\n&lt;&lt;   Any suggestions?<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;<br/>\n </span></blockquote>Hi Sandra,<br/>\n<br/>\nYou know, since you&#39;re in Ann Arbor, you might want to look into Clonlara <br/>\nSchool...it&#39;s based on Holt&#39;s teachings.   I have my dd registered with them <br/>\njust to keep everything legal, but they&#39;re very open.  I&#39;ve heard that even <br/>\nat the actual school they don&#39;t use textbooks.  Just a suggestion.  Their <br/>\naddress is 1289 Jewett, Ann Arbor, MI 48104...their phone is (734) 769-4511.<br/>\n<br/>\nSam</div>","specialLinks":[]},{"userId":0,"authorName":"A.Y.","from":"&quot;A.Y.&quot; &lt;hooperck@...","replyTo":"LIST","senderId":"tA4vhBitlK8x7LFe4lsMISvXKpJDxbBnNw0PH64MC86n5BUFuNpJRTyG3mdWC35Qa-lDreFbDdPr_nyEtiak8nqihjRf","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Trying School","postDate":"935672685","msgId":2314,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4xNzIuMjMxNC45NTkyNjk3NDFAZUdyb3Vwcy5jb20+"},"prevInTopic":2313,"nextInTopic":2315,"prevInTime":2313,"nextInTime":2315,"topicId":2313,"numMessagesInTopic":0,"msgSnippet":"Somebody on this list had a terrific idea about trying school , of course I can t remember what it was, and can t find where I saved it.  Anyone remember what","messageBody":"<div id=\"ygrps-yiv-1758034347\">Somebody on this list had a terrific idea about &quot;trying school&quot;, of course I<br/>\ncan&#39;t remember what it was, and can&#39;t find where I saved it.  Anyone remember<br/>\nwhat it was?  I remember it was her son, and he decided not to go once he saw<br/>\nwhat it was really like.<br/>\nAnn</div>","specialLinks":[]},{"userId":0,"authorName":"Sandra Brown","from":"&quot;Sandra Brown&quot; &lt;sbrown2@...&gt;","replyTo":"LIST","senderId":"GByp08Qh_n6YXQFZcY30kIHIIwcBHwwgOeCQ1zWOM7v3zaJF5N2h5kyA09-cOZxK4R3bDQf0BdrzmTXRL_mkW3QReWL_-slINb5U","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Trying School","postDate":"935672245","msgId":2313,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4xNzIuMjMxMy45NTkyNjk3NDFAZUdyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":2314,"prevInTime":2312,"nextInTime":2314,"topicId":2313,"numMessagesInTopic":0,"msgSnippet":"We are entering the next phase of our life adventures. My oldest, Emily, who will be eight in October, has been insistent that she wants to try school. After","messageBody":"<div id=\"ygrps-yiv-1099262340\">We are entering the next phase of our life adventures. My oldest, Emily, who<br/>\nwill be eight in October, has been insistent that she wants to try school.<br/>\nAfter much time spent dicussing what she wanted to do and why, and<br/>\ndiscussing a number of alternative options, it seems to me that she has the<br/>\nidea that school is like an all day play date every day with a lot of kids.<br/>\nThis from a sensitive, artist type girl who likes to spend a lot of time<br/>\nalone, and when we have a full calendar says to me, &quot;Mom, why do we have to<br/>\ngo somewhere everyday?  Why can&#39;t someone come over our house?&quot;<br/>\n<br/>\nBut she is adamant about going to school.  We are very fortunate to now be<br/>\nliving in Ann  Arbor.  Where we used to live I wouldn&#39;t even dream about<br/>\nsending her to school.  So here we were able to investigate a wide range of<br/>\nprivate schools (none of which we could afford), several public charter<br/>\nschools, (all of which focused on Math, Science, and Technology; you know,<br/>\nprepare kids for the ecomony type education:^p) and the public Open school.<br/>\n<br/>\nMost of the families in our church send their children to the Open school,<br/>\nwhich is based on the philosophy that each child arrives at school with<br/>\ntheir own strengths and potential and it is up to the teacher to facilitate<br/>\nlearning.  Also, each student is democratically represented, and time is<br/>\nspent on cooperation and comunication.  There is  a much higher (than<br/>\ntraditional schools) number of field trips and guests, and each child is<br/>\nfree to choose to be in any classroom, the media center, the music room, the<br/>\nart room, or the science lab throughout the day.<br/>\n<br/>\nSo all things considered, I feel very fortunate that we have this option<br/>\nhere.  I know if Emily had to go to traditional school, she probably<br/>\nwouldn&#39;t choose to, because she has already told me that she is not the<br/>\nsitting still do work all day kind of girl.  Still, I went through a period<br/>\nof wondering what  I did to fail her in some way.  I have realized that<br/>\nfollowing my principles of respecting the child and trusting that they will<br/>\ncommincate their needs to me,  responding to her and trusting her means<br/>\nhaving faith in her.<br/>\n<br/>\nMy husband and I both agreed years ago that when the kids were old enough to<br/>\nchoose, that they would have that option.  I am still dealing with my own<br/>\nunschooling ideals that any school, even an open school, is too far removed<br/>\nfrom the real world of society and the natural rhthym of nature to be<br/>\nuseful.<br/>\n<br/>\nHow many of you have had children choose to go to school?  How long do you<br/>\nthink would be an appropriate trial period?  I don&#39;t want her to go for a<br/>\nfew days and then want to quit because she&#39;s tired or something.  I think it<br/>\nwould be important to go for at least 4-6 weeks to really give it a good<br/>\neffort, and get over the hump of adjusting to the routine.  Any suggestions?<br/>\n<br/>\nSandra Brown<br/>\nAnn Arbor, MI</div>","specialLinks":[]},{"userId":0,"authorName":"Jeff & Diane Gwirtz","from":"&quot;Jeff & Diane Gwirtz&quot; &lt;jagwirtz@...","replyTo":"LIST","senderId":"EhMrIEVlcbsAcMy4i8qzlT5-kZL0Q_Jk6aXWtawRnF6ZqsPahRLciqG1NEhvgRJGEdqlOgy400JlDh5YBnVGK9prf2qaMg9w9E4dJwtEuA","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Trying School","postDate":"935658447","msgId":2317,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4xNzIuMjMxNy45NTkyNjk3NDFAZUdyb3Vwcy5jb20+"},"prevInTopic":2315,"nextInTopic":2318,"prevInTime":2316,"nextInTime":2318,"topicId":2313,"numMessagesInTopic":0,"msgSnippet":"... My son returned to school last year when he was 12 and in 7th grade. We didn t have any of the choices you have (small town), but he wanted to see what","messageBody":"<div id=\"ygrps-yiv-1416609358\"><blockquote><span title=\"ireply\">&gt; From:          &quot;Sandra Brown&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sbrown2@...\">sbrown2@...</a>&gt;<br/>\n<br/>\n&gt; How many of you have had children choose to go to school?  How long do you<br/>\n&gt; think would be an appropriate trial period?  I don&#39;t want her to go for a<br/>\n&gt; few days and then want to quit because she&#39;s tired or something.  I think it<br/>\n&gt; would be important to go for at least 4-6 weeks to really give it a good<br/>\n&gt; effort, and get over the hump of adjusting to the routine.  Any suggestions?<br/>\n&gt; <br/>\n </span></blockquote>My son returned to school last year when he was 12 and in 7th grade.  <br/>\nWe didn&#39;t have any of the choices you have (small town), but he <br/>\nwanted to see what middle school was like, and we respected that.<br/>\nWe had a simple agreement.  You can come back home whenever you want, <br/>\nbut once you&#39;re home, you stay for the rest of the school year.  <br/>\nAlso,  while he chose to be at school,  he was expected to &quot;play the <br/>\ngame,&quot; so to speak - do the work,  do his best to learn, etc.  <br/>\nAnyway, he stayed for about 11 weeks until right after Thanksgiving <br/>\nand has been home every since.<br/>\n<br/>\n<br/>\n<br/>\nDiane from KS<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jagwirtz@...\">jagwirtz@...</a></div>","specialLinks":[]}],"prevTopicId":2477,"nextTopicId":2473}}