{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":44,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Help with manners and family relationships","postDate":"1365596138","msgId":71159,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEZCMERCOEQzLTJDMTgtNDFCRi05OEQ1LTcxNUY0MkQ2RkI1RkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGtrMm5lZStzcW5qQGVHcm91cHMuY29tPg==","referencesHeader":"PGtrMm5lZStzcW5qQGVHcm91cHMuY29tPg=="},"prevInTopic":71158,"nextInTopic":71160,"prevInTime":71158,"nextInTime":71160,"topicId":71034,"numMessagesInTopic":0,"msgSnippet":"-=-However, if I put both on and he didn t want mayonnaise, he wouldn t make a quiet choice about it. He would get really upset that I d put mayonnaise on his","messageBody":"<div id=\"ygrps-yiv-164129970\">-=-However, if I put both on and he didn&#39;t want mayonnaise, he wouldn&#39;t make a quiet choice about it. He would get really upset that I&#39;d put mayonnaise on his plate. He would shout and maybe even cry a little until I took it off again. So I ask to avoid that scenario. -=-<br/>\n<br/>\nYou&#39;re asking the wrong question, though.<br/>\nIf we help you with ketchup, will you be able to translate that to bathtub, or socks?<br/>\n<br/>\nLive by principles.  <br/>\nBe his kind partner.  If you know he doesn&#39;t respond well to &quot;Do you want A, or B?&quot; then that question will be a trap, or a test he will lose.<br/>\n<br/>\nPeople in this thread seem to have failed a test of yours, in a way.  Lots of suggestions, but you&#39;re defending your position, rather than reading a little, trying a little, waiting and watching.<br/>\n<br/>\n-=-At the moment, I&#39;m taking my chances and just putting ketchup without asking. That will work until the day he decides he wants mayonnaise again and seems better in the short-term. -=-<br/>\n<br/>\n&quot;Taking your chances&quot; sounds scary.  Do you see him as a dangerous enemy?  Then how must he see you?<br/>\n<br/>\nIf you think he wants ketchup, you could say this, before you put anything on, &quot;Ketchup?&quot;<br/>\nOr put ketchup on if you&#39;re sure he likes it, but if you&#39;re not sure, and you put ketchup, and he doesn&#39;t like it, then YOU eat that one and make him another one.  Or throw it away.  Because food is cheap compared to mental health and peaceful relationships, and it shouldn&#39;t be something to fight about or to stress about or to &quot;take your chances&quot; about.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":363268824,"authorName":"keeliereader","from":"&quot;keeliereader&quot; &lt;keeliebean@...&gt;","profile":"keeliereader","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Help with manners and family relationships","postDate":"1365565710","msgId":71158,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtrMm5lZStzcW5qQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGtrMWM2bSsybmx0QGVHcm91cHMuY29tPg=="},"prevInTopic":71151,"nextInTopic":71159,"prevInTime":71157,"nextInTime":71159,"topicId":71034,"numMessagesInTopic":0,"msgSnippet":"... I agree that limiting questions is helpful in maintaining the peace. However, if I put both on and he didn t want mayonnaise, he wouldn t make a quiet","messageBody":"<div id=\"ygrps-yiv-1371841953\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Karen&quot; &lt;semajrak@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; &gt;&gt;&gt;&gt;&gt; It&#39;s kind of wearing when you are asking whether someone wants mayonnaise or ketchup with the fish fingers you cooked because they didn&#39;t want the main dinner cooked and they scream &#39;KETCHUP!&#39;. &lt;&lt;&lt;&lt;&lt;<br/>\n&gt; <br/>\n&gt;I&#39;m wondering if it would help your son if you tried to limit asking him questions where you can, depending on what kind of mood you sense he might be in.  For example, in an instance such as this, without saying anything, you could put a bit of each on his plate so he can make his own quiet choice.  <br/>\n&gt; <br/>\n </span></blockquote>I agree that limiting questions is helpful in maintaining the peace. However, if I put both on and he didn&#39;t want mayonnaise, he wouldn&#39;t make a quiet choice about it. He would get really upset that I&#39;d put mayonnaise on his plate. He would shout and maybe even cry a little  until I took it off again. So I ask to avoid that scenario. <br/>\n<br/>\nAt the moment, I&#39;m taking my chances and just putting ketchup without asking. That will work until the day he decides he wants mayonnaise again and seems better in the short-term.</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Help with manners and family relationships","postDate":"1365529949","msgId":71151,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtrMWtndCtsZDI4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGtqdDFsOSs4ZGptQGVHcm91cHMuY29tPg=="},"prevInTopic":71149,"nextInTopic":71158,"prevInTime":71150,"nextInTime":71152,"topicId":71034,"numMessagesInTopic":0,"msgSnippet":"... *************** Some kids love crafty things, projecty things. Some enjoy structured activities. Others, not so much. If you think your son would enjoy","messageBody":"<div id=\"ygrps-yiv-583519032\">&quot;keeliereader&quot; &lt;keeliebean@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;all those cutesy things they do at kinder - they&#39;re not happening and I want him to have access to those things <br/>\n </span></blockquote>***************<br/>\n<br/>\nSome kids love &quot;crafty&quot; things, projecty things. Some enjoy structured activities. Others, not so much. If you think your son would enjoy that sort of thing, be on the look out for &quot;rainy day activity&quot; books - they often have them in grocery and dollar stores (in the US, anyway). The kinds of magazine staged right by the checkout often have simple craft projects as well as good ideas for things to do in the kitchen. You can look through them with your son and see if anything looks exciting to him. Or you can browse through and schedule something, if that&#39;s more helpful to you. <br/>\n<br/>\nBut he might not be interested in that sort of thing, and that&#39;s okay too. Those cutesy things are really frustrating and annoying to some kids.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Help with manners and family relationships","postDate":"1365522086","msgId":71147,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRENTJBMzA5LThCN0QtNEQ3RS1BODA5LTNDRjk0OTdDQUM4M0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGtrMWM2bSsybmx0QGVHcm91cHMuY29tPg==","referencesHeader":"PGtrMWM2bSsybmx0QGVHcm91cHMuY29tPg=="},"prevInTopic":71146,"nextInTopic":71149,"prevInTime":71146,"nextInTime":71148,"topicId":71034,"numMessagesInTopic":0,"msgSnippet":"-=-Also, if your son is introverted, it is my understanding that introverts are very perceptive of other people s emotions-=- I think that s true of some but","messageBody":"<div id=\"ygrps-yiv-981091978\">-=-Also, if your son is introverted, it is my understanding that introverts are very perceptive of other people&#39;s emotions-=-<br/>\n<br/>\nI think that&#39;s true of some but not all.  I don&#39;t think introversion is equal to &quot;very perceptive of other people&#39;s feelings,&quot; and if Howard Gardner is right, then that would be interpersonal intelligence, and that should be fairly evenly spread in the population.    If someone avoids interaction bcause of that perceptiveness, that would make sense.  But there might be others who avoid interaction because they are NOT very perceptive and it tires them out to try to figure out what other people want of them.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":284087656,"authorName":"Karen","from":"&quot;Karen&quot; &lt;semajrak@...&gt;","profile":"semajrak","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Help with manners and family relationships","postDate":"1365521430","msgId":71146,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtrMWM2bSsybmx0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGtqdDFsOSs4ZGptQGVHcm91cHMuY29tPg=="},"prevInTopic":71144,"nextInTopic":71147,"prevInTime":71145,"nextInTime":71147,"topicId":71034,"numMessagesInTopic":0,"msgSnippet":"... Depending on how he is feeling, my husband can become a bit crabby if he is asked too many questions by me.  I ve learned to read his body language, and be","messageBody":"<div id=\"ygrps-yiv-971094259\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;&gt; It&#39;s kind of wearing when you are asking whether someone wants mayonnaise or ketchup with the fish fingers you cooked because they didn&#39;t want the main dinner cooked and they scream &#39;KETCHUP!&#39;. &lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Depending on how he is feeling, my husband can become a bit crabby if he is asked too many questions by me.  I&#39;ve learned to read his body language, and be with him more quietly when I can see he is feeling a bit over stimulated or in need of more quiet company.  I&#39;m wondering if it would help your son if you tried to limit asking him questions where you can, depending on what kind of mood you sense he might be in.  For example, in an instance such as this, without saying anything, you could put a bit of each on his plate so he can make his own quiet choice.  <br/>\n<br/>\nAlso, if your son is introverted, it is my understanding that introverts are very perceptive of other people&#39;s emotions, and that can overwhelm them socially at times.  Perhaps, in the scenario you shared above, your son felt (even if you did not express it in words) some irritation on your part for having to cook another dinner.  Maybe he was feeling sensitive or defensive.</div>","specialLinks":[]},{"userId":343381924,"authorName":"lucy.web","from":"&quot;lucy.web&quot; &lt;lucy.web@...&gt;","profile":"lucylists","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Help with manners and family relationships","postDate":"1365504123","msgId":71144,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU1OTM3RTIwLTdENjEtNEYxQi1CNzVCLTBDQ0FGQ0ZFQzFCNEBtYWMuY29tPg==","inReplyToHeader":"PGtqdDFsOSs4ZGptQGVHcm91cHMuY29tPg==","referencesHeader":"PGtqdDFsOSs4ZGptQGVHcm91cHMuY29tPg=="},"prevInTopic":71143,"nextInTopic":71146,"prevInTime":71143,"nextInTime":71145,"topicId":71034,"numMessagesInTopic":0,"msgSnippet":"... Are there any sweet things that he does that you can focus on to compensate in those moments, and help keep you patient? My youngest is a little like you","messageBody":"<div id=\"ygrps-yiv-1397769345\">On 8 Apr 2013, at 02:06, keeliereader wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Sometimes I do wish I had a different child and that makes me feel really sad. I&#39;m his mother - obviously I love him to bits and I think he is amazing. But sometimes I can&#39;t handle the prickles. It&#39;s kind of wearing when you are asking whether someone wants mayonnaise or ketchup with the fish fingers you cooked because they didn&#39;t want the main dinner cooked and they scream &#39;KETCHUP!&#39;. <br/>\n<br/>\n </span></blockquote>Are there any sweet things that he does that you can focus on to compensate in those moments, and help keep you patient?<br/>\n<br/>\nMy youngest is a little like you describe at times and I can definitely imagine the &quot;Ketchup!&quot; yelling thing happening in our house.  There is much, much less yelling generally in our house now that we&#39;ve been radically unschooling for a while, though.   <br/>\n<br/>\nWhile the yelling was still going on, I found it really useful to identify and remember the sweet little things that my daughter does do for me, when she is being &#39;nice&#39; in her own sweet way, rather than in the ways I might wish.  For example I clearly remember one time when I had a bad cold and she unexpectedly kept a steady supply of clean hankies delivered to my bedside without being asked.   That was really sweet, and much appreciated at the time, and remembering it now helps me keep my patience through the times when she was not feeling and being so sweet.<br/>\n<br/>\nSomeone mentioned a while back about introverts perhaps having more difficulty in the goodbye/hello greetings.   I score 90% introversion on the Myers Briggs tests, and I definitely struggle with those greetings.   My youngest struggles too and even now - at 10 years old - I sometimes have to speak for my team on her behalf.   That&#39;s never been a problem for me though because I can completely relate to her feelings.  She is a child who 100% knows her own mind though and I can well imagine that she&#39;s not going to be content to let her Mum speak for her forever!   I don&#39;t mind supporting her in the meantime.<br/>\n<br/>\nI do get many, many comments about how she &quot;wouldn&#39;t be allowed to be so shy if she were in school&quot; but I am thankful that my family have this opportunity to enable and witness my daughter growing up being her own, genuine self.    It&#39;s also very healing for me, personally.    I was schooled, and it&#39;s taken me until my 40s to rediscover and celebrate my genuine introverted self.   Even now it&#39;s a work in progress!<br/>\n<br/>\nLucy<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":91509136,"authorName":"Caioprod","from":"Caioprod &lt;caioprod@...&gt;","profile":"caioprod","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Help with manners and family relationships","postDate":"1365499461","msgId":71149,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU1QzE4QkQwLTU0QzQtNENBRS04NjE5LUEwRUQzMjcyNkY0MkB5YWhvby5jb20+","inReplyToHeader":"PGtrMDNmMitvNzZzQGVHcm91cHMuY29tPg==","referencesHeader":"PGtrMDNmMitvNzZzQGVHcm91cHMuY29tPg=="},"prevInTopic":71147,"nextInTopic":71151,"prevInTime":71148,"nextInTime":71150,"topicId":71034,"numMessagesInTopic":0,"msgSnippet":"Hi Keelie, My son is almost 4 and he almost never wants to say goodbye and I totally don t make him. We do not see many people because he does not want that","messageBody":"<div id=\"ygrps-yiv-1967641056\">Hi Keelie,<br/>\n<br/>\nMy son is almost 4 and he almost never wants to say goodbye and I totally don&#39;t make him. We do not see many people because he does not want that but to the people outside our family (which at the moment is just me) he almost never wants to say good bye. It seems that for him it is easier to put end they do not go away if he does not say goodbye, be it waving, a hug, a kiss or anything else.<br/>\n<br/>\nHe does these &quot;goodbye&quot; things easily and willingly without being asked if the person does not leave so it is not the&quot;things&quot; themselves but it is the parting that he does not want too take part in.<br/>\n<br/>\nAnd this happens especially if he had a good time - actually the occasions that he enthusiastically says good bye are the ones when he is happy that the person leaves.. something that I do not say to the one who goes - and they get very enthusiastic that he says good bye in a &quot;proper manner&quot;.. :-))<br/>\n<br/>\nIoana<br/>\n<br/>\n<br/>\nOp 9 apr. 2013 om 05:55 heeft &quot;keeliereader&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:keeliebean@...\">keeliebean@...</a>&gt; het volgende geschreven:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; -=-His best friend came to play the other day and I thought it would be interesting to observe the dynamic between them. There were two occasions where Jack got frustrated that his friend wasn&#39;t playing the way he wanted him to and he screamed at him. Jack&#39;s logic is that they are his toys and he gets to choose how the game goes (this is over five hours so it was mostly peaceful play). -=-<br/>\n&gt; &gt; <br/>\n&gt; &gt; Do you mean you don&#39;t usually observe them?<br/>\n&gt; &gt; Do you mean that you didn&#39;t interact with the boys for five hours? <br/>\n&gt; &gt; <br/>\n&gt; &gt; I&#39;m pretty sure netiher of those is true, but it&#39;s unclear from the description.<br/>\n&gt; <br/>\n&gt; Sorry, what I meant was it was interesting to observe how Jack interacts with his friend as opposed to how he interacts with his parents since I&#39;m assuming he won&#39;t bark at a friend the way he sometimes barks at us. What I observed is that while he&#39;s not always &#39;polite&#39; or nice, his friend doesn&#39;t seem at all fazed. In fact, he thought it was funny. I guess that&#39;s why they are friends. <br/>\n&gt; <br/>\n&gt; I sat with them for the first half an hour putting together some Lego toys and then I left them to play. Our house is small so I&#39;m always close by. I also sat with them for lunch but I didn&#39;t get involved in their game. <br/>\n&gt; <br/>\n&gt; It wasn&#39;t the sharing of toys that bothered him, it was the direction of the game play. His friend was doing something he didn&#39;t like in the game. <br/>\n&gt; <br/>\n&gt; In hindsight I think it was time for a break as it was towards the end of a pretty intense play session. I did offer to take them both out for ice cream but his friend said he didn&#39;t want to eat any &#39;junk&#39; as he&#39;d been sick recently. And that kind of threw me! Next time I&#39;ll have some more options ready and I will check in more often to pre-empt the screaming situation. <br/>\n&gt; <br/>\n&gt; It&#39;s reasuring to hear other children struggle with goodbyes. That helps me re-commit to supporting Jack during his goodbyes rather than wishing he would do it differently. I will &#39;do the talking for my team&#39;. <br/>\n&gt; <br/>\n&gt; Thanks everyone, <br/>\n&gt; Keelie<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":363268824,"authorName":"keeliereader","from":"&quot;keeliereader&quot; &lt;keeliebean@...&gt;","profile":"keeliereader","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Help with manners and family relationships","postDate":"1365479714","msgId":71142,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtrMDNmMitvNzZzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQwQ0I3ODRFLUZFM0EtNEM4QS1CMzY3LTY4QkEzODEwRTE0NUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":71141,"nextInTopic":71143,"prevInTime":71141,"nextInTime":71143,"topicId":71034,"numMessagesInTopic":0,"msgSnippet":"... Sorry, what I meant was it was interesting to observe how Jack interacts with his friend as opposed to how he interacts with his parents since I m assuming","messageBody":"<div id=\"ygrps-yiv-168497694\"><blockquote><span title=\"ireply\">&gt; -=-His best friend came to play the other day and I thought it would be interesting to observe the dynamic between them. There were two occasions where Jack got frustrated that his friend wasn&#39;t playing the way he wanted him to and he screamed at him. Jack&#39;s logic is that they are his toys and he gets to choose how the game goes (this is over five hours so it was mostly peaceful play). -=-<br/>\n&gt; <br/>\n&gt; Do you mean you don&#39;t usually observe them?<br/>\n&gt; Do you mean that you didn&#39;t interact with the boys for five hours?  <br/>\n&gt; <br/>\n&gt; I&#39;m pretty sure netiher of those is true, but it&#39;s unclear from the description.<br/>\n<br/>\n </span></blockquote>Sorry, what I meant was it was interesting to observe how Jack interacts with his friend as opposed to how he interacts with his parents since I&#39;m assuming he won&#39;t bark at a friend the way he sometimes barks at us. What I observed is that while he&#39;s not always &#39;polite&#39; or nice, his friend doesn&#39;t seem at all fazed. In fact, he thought it was funny. I guess that&#39;s why they are friends. <br/>\n<br/>\nI sat with them for the first half an hour putting together some Lego toys and then I left them to play. Our house is small so I&#39;m always close by. I also sat with them for lunch but I didn&#39;t get involved in their game. <br/>\n<br/>\nIt wasn&#39;t the sharing of toys that bothered him, it was the direction of the game play. His friend was doing something he didn&#39;t like in the game. <br/>\n<br/>\nIn hindsight I think it was time for a break as it was towards the end of a pretty intense play session. I did offer to take them both out for ice cream but his friend said he didn&#39;t want to eat any &#39;junk&#39; as he&#39;d been sick recently. And that kind of threw me! Next time I&#39;ll have some more options ready and I will check in more often to pre-empt the screaming situation. <br/>\n<br/>\nIt&#39;s reasuring to hear other children struggle with goodbyes. That helps me re-commit to supporting Jack during his goodbyes rather than wishing he would do it differently. I will &#39;do the talking for my team&#39;.  <br/>\n<br/>\nThanks everyone, <br/>\nKeelie</div>","specialLinks":[]},{"userId":363268824,"authorName":"keeliereader","from":"&quot;keeliereader&quot; &lt;keeliebean@...&gt;","profile":"keeliereader","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Help with manners and family relationships","postDate":"1365478165","msgId":71143,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtrMDF1bCtkY2FhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIxN0ZBQzI0LUFCODktNDUwQi04RTQyLTE2MkVEMzI1N0UxM0BTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":71142,"nextInTopic":71144,"prevInTime":71142,"nextInTime":71144,"topicId":71034,"numMessagesInTopic":0,"msgSnippet":"... I will certainly encourage him to come along. It would be great for him to hear about unschooling from you guys. He tends to take information more","messageBody":"<div id=\"ygrps-yiv-791686393\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; -=-Sandra, I am so coming to see you and Joyce in Melbourne! can&#39;t wait. -=-<br/>\n&gt; <br/>\n&gt; Cool.  Will your husband come?<br/>\n<br/>\n<br/>\n </span></blockquote>I will certainly encourage him to come along. It would be great for him to hear about unschooling from you guys. He tends to take information more seriously when it comes from people other than me!</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Help with manners and family relationships","postDate":"1365422804","msgId":71141,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIxN0ZBQzI0LUFCODktNDUwQi04RTQyLTE2MkVEMzI1N0UxM0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGtqdDFsOSs4ZGptQGVHcm91cHMuY29tPg==","referencesHeader":"PGtqdDFsOSs4ZGptQGVHcm91cHMuY29tPg=="},"prevInTopic":71140,"nextInTopic":71142,"prevInTime":71140,"nextInTime":71142,"topicId":71034,"numMessagesInTopic":0,"msgSnippet":"-=-Sandra, I am so coming to see you and Joyce in Melbourne! can t wait. -=- Cool.  Will your husband come? If a child screams ketchup, you could say something","messageBody":"<div id=\"ygrps-yiv-756224703\">-=-Sandra, I am so coming to see you and Joyce in Melbourne! can&#39;t wait. -=-<br/>\n<br/>\nCool.  Will your husband come?<br/>\n<br/>\nIf a child screams ketchup, you could say something light, but serious.  &quot;Why are you screaming?&quot; or &quot;You&#39;ll scare the ketchup away,&quot; or (if nobody&#39;s sleeping and it won&#39;t disturb anyone) yell back as though you didn&#39;t quite understand him, &quot;KETCHUP??&quot; and then say &quot;Why are we yelling?&quot;  <br/>\n<br/>\nAcknowledge somehow that it&#39;s inapproriate.  That might be enough.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":9683811,"authorName":"Katie Oxford","from":"&quot;Katie Oxford&quot; &lt;katie@...&gt;","profile":"katie.oxford","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] Re: Help with manners and family relationships","postDate":"1365400826","msgId":71139,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxZDIwMWNlMzQxZSQ1ZTVkNzc1MCQxYjE4NjVmMCRAc3ppaXNvZnQuY29tPg==","inReplyToHeader":"PDQwQ0I3ODRFLUZFM0EtNEM4QS1CMzY3LTY4QkEzODEwRTE0NUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGtqc3Vscit0OXMyQGVHcm91cHMuY29tPiA8NDBDQjc4NEUtRkUzQS00QzhBLUIzNjctNjhCQTM4MTBFMTQ1QFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":71138,"nextInTopic":71140,"prevInTime":71138,"nextInTime":71140,"topicId":71034,"numMessagesInTopic":0,"msgSnippet":"-=- I m okay with Jack ignoring adults but I struggle when he won t even say goodbye to his friends.-=- I went through this with my daughter. She is an Aspie","messageBody":"<div id=\"ygrps-yiv-1366393873\">-=- I&#39;m okay with Jack ignoring adults but I struggle when he won&#39;t even say<br/>\ngoodbye to his friends.-=-<br/>\n<br/>\nI went through this with my daughter. She is an Aspie and really didn&#39;t<br/>\nspeak to anyone (besides family or very familiar people) until she was about<br/>\n8. When she was about 6 I started working with her on hellos and goodbyes.<br/>\nIt was so hard for her, but it was really hard for me too to see these<br/>\npeople say hi or goodbye to her and have her not even acknowledge them.<br/>\nAfter about 2 years of gentle, private reminders that other people would<br/>\nenjoy being acknowledged when they talk to her even if it&#39;s just a smile or<br/>\neye contact, she now says hello or goodbye about 80% of the time and all I<br/>\nhave to do now is sometimes point out that someone has greeted her because<br/>\nshe doesn&#39;t always know or notice. <br/>\n<br/>\nAt first I was embarrassed that she didn&#39;t acknowledge others and I hated<br/>\nhow awkward it made social interactions, but I just started saying the<br/>\nhellos and goodbyes for her, making eye contact and smiling at the kids who<br/>\ntalked to and greeted her, and you know what? Those kids still say hi to her<br/>\nand now they say hi to me, too. I know all those kids&#39; names and they know<br/>\nmine and they say hi to me even if she isn&#39;t there and I think that&#39;s pretty<br/>\ncool. I just realized it was better to offer some genuine friendliness to<br/>\n&#39;our&#39; friends than to pressure her to do it or to worry about the silence<br/>\nthat was returned upon their greetings. I don&#39;t need to gush, apologize or<br/>\ncompensate. I just speak the words she can&#39;t - and I mean them.<br/>\n<br/>\nIf your kid is going to struggle with hellos and goodbyes and those kids<br/>\nwant to be friends with them, they&#39;ll figure out that it&#39;s just part of the<br/>\ndeal. My daughter&#39;s friends know that their greetings or comments may go<br/>\nunanswered or that their attempts at conversation may fizzle and die but the<br/>\nones that are good friends will shrug it off and try again later or another<br/>\nday. Had I sugar-coated or made excuses for her lack of response they may<br/>\nstill have confusion about who she is or what to expect, but they know the<br/>\nreal her and it&#39;s much better for all of us that way J<br/>\n<br/>\n-Katie<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Help with manners and family relationships","postDate":"1365393308","msgId":71138,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQwQ0I3ODRFLUZFM0EtNEM4QS1CMzY3LTY4QkEzODEwRTE0NUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGtqc3Vscit0OXMyQGVHcm91cHMuY29tPg==","referencesHeader":"PGtqc3Vscit0OXMyQGVHcm91cHMuY29tPg=="},"prevInTopic":71137,"nextInTopic":71139,"prevInTime":71137,"nextInTime":71139,"topicId":71034,"numMessagesInTopic":0,"msgSnippet":"-=-His best friend came to play the other day and I thought it would be interesting to observe the dynamic between them. There were two occasions where Jack","messageBody":"<div id=\"ygrps-yiv-703090598\">-=-His best friend came to play the other day and I thought it would be interesting to observe the dynamic between them. There were two occasions where Jack got frustrated that his friend wasn&#39;t playing the way he wanted him to and he screamed at him. Jack&#39;s logic is that they are his toys and he gets to choose how the game goes (this is over five hours so it was mostly peaceful play). -=-<br/>\n<br/>\nDo you mean you don&#39;t usually observe them?<br/>\nDo you mean that you didn&#39;t interact with the boys for five hours?  <br/>\n<br/>\nI&#39;m pretty sure netiher of those is true, but it&#39;s unclear from the description.<br/>\n<br/>\n-=-How do I help him in the moment to communicate more peacefully? I just said that he might find a better way to express himself than screaming since no one likes to be screamed at.-=-<br/>\n<br/>\nIf you&#39;re his partner, though, and your team has a guest, and the guest is being yelled at, you&#39;re a party to that.  I would say &quot;Don&#39;t yell.&quot;  Or I would call him away, in private, and let him calm down, and say something sweet and encouraging to the guest, try to add humor.  <br/>\n<br/>\nOr another thing to do when kid aren&#39;t getting along is to offer food or drinks, or a movie, or something outside.  Change the scene when the play isn&#39;t going well.<br/>\n<br/>\n-=-I didn&#39;t know how to respond to the toy ownership thing since I feel somewhat torn between the idea of guests feeling comfortable and welcome in our home and Jack having ownership of his toys - but it wasn&#39;t really a sharing issue. More a control issue. -=-<br/>\n<br/>\nPlan ahead.  Only have toys out that are to be shared.  Put the other ones up high, or hidden away.  <br/>\n<br/>\n-=- I&#39;m okay with Jack ignoring adults but I struggle when he won&#39;t even say goodbye to his friends.-=-<br/>\n<br/>\nRather than being okay with him ignoring adults or anyone, either jump in and make all the good byes and thank yous yourself (without explaining why he&#39;s not talking; just do the talking for your team), or discuss and review in advance what&#39;s polite to say when someone&#39;s leaving (adult OR child) and why.  Act through things.   Discuss kind greetings and good-byes you see on movies or TV shows.  <br/>\n<br/>\nIn a partnership between a parent and child, the parent does most of the work at first and less as time goes by, and when you&#39;re getting old, the child might do most of the work sometimes.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Help with manners and family relationships","postDate":"1365381295","msgId":71137,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtqdDNiZitkZW84QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGtqc3Vscit0OXMyQGVHcm91cHMuY29tPg=="},"prevInTopic":71136,"nextInTopic":71138,"prevInTime":71136,"nextInTime":71138,"topicId":71034,"numMessagesInTopic":0,"msgSnippet":"... ************ I m not entirely sure what you mean by choice or lack of but it s good to keep in mind that he s only 4 and that limits his ability to make","messageBody":"<div id=\"ygrps-yiv-1563008452\">&quot;keeliereader&quot; &lt;keeliebean@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;I&#39;ve been watching Jack to see when these things happen and there is a definite pattern with choice - or lack of. <br/>\n </span></blockquote>************<br/>\n<br/>\nI&#39;m not entirely sure what you mean by &quot;choice or lack of&quot; but it&#39;s good to keep in mind that he&#39;s only 4 and that limits his ability to make thoughtful choices in the moment. It&#39;s easy for a little kid to be so overwhelmed by his feelings and reactions in the moment - so an important way for you to help him is by managing things so he&#39;s not as likely to be overwhelmed. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Jack&#39;s logic is that they are his toys and he gets to choose how the game goes (this is over five hours so it was mostly peaceful play).<br/>\n </span></blockquote>**************<br/>\n<br/>\nThis is where meeting on neutral territory or having &quot;company&quot; toys (or mom&#39;s toys) can be helpful, by reducing the tensions of &quot;my space&quot; and &quot;my toys&quot;. <br/>\n<br/>\nBut if your son isn&#39;t reacting this way all the time, it&#39;s good to look for other issues as well. For instance, I know my daughter takes a bit to warm up to a friend, especially a friend who&#39;s likely to be incautious of her personal space, so I make sure to be on hand to smooth things over at the start, maybe make conversation with the guest child and run a little interference until Mo&#39;s ready. I also know she&#39;ll need a break after a couple hours so I plan for that too. In essence, I take over the hostess duties when Mo can&#39;t handle them in the moment. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; How do I help him in the moment to communicate more peacefully?<br/>\n<br/>\n </span></blockquote>In the moment, when he&#39;s all worked up, you may not be able to do that right now. That&#39;s why it&#39;s important to manage things and reduce those sorts of moments and to have backup plans when they happen. A change of scenery or activity is a good general backup plan - go outside, start a movie, start a game, offer snacks, offer to make something gooey in the kitchen. A change like that also lets you see if the problem is really that someone is hungry, or needs a break. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I&#39;m okay with Jack ignoring adults but I struggle when he won&#39;t even say goodbye to his friends.<br/>\n </span></blockquote>************<br/>\n<br/>\nSay his goodbyes for him. Mo finds goodbyes hugely stressful - but she has one friend who loves lengthy goodbyes. So I say the goodbyes and offer lots of reassurances to the guest, letting her know that Mo loves seeing her, loves playing with her, and is so sad she&#39;s leaving - all of which is true. Over time Mo has gone from not even wanting to acknowledge her friend is leaving to being able to say goodbye - but not much more than that. It&#39;s still too stressful to go through the whole big long goodbye fest.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;When I think about why I make certain choices or respond in a particular way my mind feels very murky. Is this a practice thing?<br/>\n </span></blockquote>**************<br/>\n<br/>\nMaybe. Or it may be that you&#39;re confused as to which principles apply to which situations. With guests, it&#39;s helpful to think in terms of being a good hostess. Part of being a good hostess is managing things a bit to try and avoid hurt feelings, and part is moving things along after feelings have been hurt, shifting the dynamics back to something more pleasant. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":363268824,"authorName":"keeliereader","from":"&quot;keeliereader&quot; &lt;keeliebean@...&gt;","profile":"keeliereader","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Help with manners and family relationships","postDate":"1365379561","msgId":71140,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtqdDFsOSs4ZGptQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGtpaHBjcCtiMnZkQGVHcm91cHMuY29tPg=="},"prevInTopic":71139,"nextInTopic":71141,"prevInTime":71139,"nextInTime":71141,"topicId":71034,"numMessagesInTopic":0,"msgSnippet":"Alison wrote: I m guessing a lot of this is about underlying fear. In order to trust this whole unschooling thing you re perhaps wanting to see tangible","messageBody":"<div id=\"ygrps-yiv-882711369\">Alison wrote: I&#39;m guessing a lot of this is about underlying fear. In order to trust this whole unschooling thing you&#39;re perhaps wanting to see tangible results that Jack is at least as polite, clever, amenable, well-exercised etc etc as his peers or you worry it is not working or that others around you will point out that it&#39;s not.<br/>\n<br/>\nYes, I think this is a big part of it. We are way more accommodating than most of the parents we know and we get some judgement around Jack&#39;s behavior because of it. I don&#39;t know how much is temperament and how much is down to us. It&#39;s hard when you see other kids saying goodbye, please and thank you and they seem quite happy to do it. <br/>\n<br/>\nAs you said Meredith, I think I did expect that if I didn&#39;t push it by this point he&#39;d have a handle on it. If not please and thank you, at least a nice tone of voice rather than an imperious order! <br/>\n<br/>\nJoyce wrote: Trust that he doesn&#39;t want to irritate you. But for some reason he&#39;s got prickly cactuses inside of him that make life uncomfortable. Don&#39;t add prickles to his outside too! You were given the child you were given. He needs your understanding that life isn&#39;t as easy for him as it is for others. He doesn&#39;t need parents who wish they had a different child.<br/>\n<br/>\nSometimes I do wish I had a different child and that makes me feel really sad. I&#39;m his mother - obviously I love him to bits and I think he is amazing. But sometimes I can&#39;t handle the prickles. It&#39;s kind of wearing when you are asking whether someone wants mayonnaise or ketchup with the fish fingers you cooked because they didn&#39;t want the main dinner cooked and they scream &#39;KETCHUP!&#39;. <br/>\n<br/>\nThis is all compounded I guess by my DH&#39;s underlying belief that adults should be in control. We&#39;ve talked a lot about unschooling and in some ways he makes better kinder choices than me more instinctively. But it&#39;s underpinned by memories of children being seen and not heard, getting a slap when out of line and generally parents rules - not that these things happen in our house but DH does get frustrated at our perceived lack of control. I gave him Sandra&#39;s book to read. He hasn&#39;t read it yet but says he will...<br/>\n<br/>\nHe knows I want to homeschool and he&#39;s coming round to the idea. This year is a kind of test run to show that I can make it work - for him it&#39;s not working probably because of the way Jack behaves sometimes and him feeling that Jack&#39;s needs get met at the expense of his - I&#39;m working on this. <br/>\n<br/>\nAs for my own fears, I&#39;m worried that I just haven&#39;t got what it takes to unschool. I&#39;m working from home (part-time) at the moment but even when I haven&#39;t got work on it seems like another day passes and I haven&#39;t managed to do anything crafty or &#39;schoolish&#39; with Jack. Jack has learnt to count and knows some of his letters. I haven&#39;t set out to &#39;teach&#39; him any of those things - most of it he learned from iPad games. So I see how learning is happening and how he gradually makes leaps in understanding. I see the drive in him to learn numbers and letters without any interference from us. <br/>\n<br/>\nBut I feel as if I should be doing more - providing more games, more opportunities for learning. We go to the library, visit friends, play with toys, read books but also spend a lot of time playing iPad games and Skylander and watching videos on uTube (Lego videos, spiderman and Ben 10 computer games mostly). But all those cutesy things they do at kinder - they&#39;re not happening and I want him to have access to those things even if he&#39;s not at kinder. I guess I am just doubtful as to whether I have the drive to provide a really rich learning environment for him. <br/>\n<br/>\nOkay, I&#39;m going to sign off there. Thanks for reading (if you got this far!).   <br/>\n<br/>\n<br/>\nKeelie<br/>\nxxx<br/>\n<br/>\nP.s. Sandra, I am so coming to see you and Joyce in Melbourne! can&#39;t wait.</div>","specialLinks":[]},{"userId":363268824,"authorName":"keeliereader","from":"&quot;keeliereader&quot; &lt;keeliebean@...&gt;","profile":"keeliereader","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Help with manners and family relationships","postDate":"1365376507","msgId":71136,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtqc3Vscit0OXMyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGtpaHBjcCtiMnZkQGVHcm91cHMuY29tPg=="},"prevInTopic":71049,"nextInTopic":71137,"prevInTime":71135,"nextInTime":71137,"topicId":71034,"numMessagesInTopic":0,"msgSnippet":"I d like to resurrect this topic as I have some questions. I appreciate all for your words and advice and also the stories that of politeness and kindness that","messageBody":"<div id=\"ygrps-yiv-1338505298\">I&#39;d like to resurrect this topic as I have some questions. I appreciate all for your words and advice and also the stories that of politeness and kindness that came up. I&#39;ve been watching Jack to see when these things happen and there is a definite pattern with choice - or lack of. <br/>\n<br/>\nHis best friend came to play the other day and I thought it would be interesting to observe the dynamic between them. There were two occasions where Jack got frustrated that his friend wasn&#39;t playing the way he wanted him to and he screamed at him. Jack&#39;s logic is that they are his toys and he gets to choose how the game goes (this is over five hours so it was mostly peaceful play). <br/>\n<br/>\nHow do I help him in the moment to communicate more peacefully? I just said that he might find a better way to express himself than screaming since no one likes to be screamed at. I didn&#39;t know how to respond to the toy ownership thing since I feel somewhat torn between the idea of guests feeling comfortable and welcome in our home and Jack having ownership of his toys - but it wasn&#39;t really a sharing issue. More a control issue. <br/>\n<br/>\nWhen his friend left his mum asked him &#39;what do you say?&#39; and we went through the &#39;thanks for having me&#39; script. Jack looked at the floor and ignored him completely. I&#39;m okay with Jack ignoring adults but I struggle when he won&#39;t even say goodbye to his friends. We&#39;ve talked about how saying goodbye is a way of acknowledging the friendship and the good time you&#39;ve had. If my friend ignored me I&#39;d probably feel sad and a bit confused. <br/>\n<br/>\nHe says he is too shy to say goodbye and he&#39;s happy for me to say it for him - which I do. And this worked well when he was younger but gets more awkward now that all his friends seem to manage it fine. Is there something I can say in the moment to smooth it over? I sometimes say that Jack doesn&#39;t like to say goodbye. But I feel bad for his friends!<br/>\n<br/>\nI think some of this is compounded by my own confusion over my principles and using them to make decisions. When I think about why I make certain choices or respond in a particular way my mind feels very murky. Is this a practice thing?<br/>\n<br/>\nI want to respond to some of the other points raised but I&#39;ll do that in a separate email. <br/>\n<br/>\nThanks, <br/>\nKeelie</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Help with manners and family relationships","postDate":"1364090353","msgId":71049,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBRUQ2MjEwLUQ3QkYtNERBRC1BNkU4LTlERENFNzA1NUYzQkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PENBREZVMFNDYWdoeTBRV3BvYkZ5K3FxWHhxV0QzVTlqU3JzQndOTFZRZ1AzYnB6WndhZ0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PGtpa201aCt1aW82QGVHcm91cHMuY29tPiA8MThFQzQyMDQtMTE4NC00NTE0LTgwNDQtMDI1M0E5REFDMEMwQFNhbmRyYWRvZGQuY29tPiA8Q0FPT1RhWE80SFhvV09DYnprYWViQ1lzNUVTMDFleVkxb1VHQjlRRDhVZEZaZXFTZXNRQG1haWwuZ21haWwuY29tPiA8Q0FERlUwU0NhZ2h5MFFXcG9iRnkrcXFYeHFXRDNVOWpTcnNCd05MVlFnUDNicHpad2FnQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":71048,"nextInTopic":71136,"prevInTime":71048,"nextInTime":71050,"topicId":71034,"numMessagesInTopic":0,"msgSnippet":"-=-that kind of thoughtfulness *really* doesn t come from drilling or rules or requirements. :)-=- I agree with Lyla.  If kids are taught to do those things,","messageBody":"<div id=\"ygrps-yiv-260161543\">-=-that kind of thoughtfulness *really* doesn&#39;t come from drilling or rules or<br/>\nrequirements. :)-=-<br/>\n<br/>\nI agree with Lyla.  If kids are &quot;taught&quot; to do those things, they&#39;re reciting like trained birds.  AND... if they&#39;re taught to do it, the parent gets full credit, and can say &quot;I taught you better than that&quot; if the kid ever fails.  It&#39;s just not partnership.  It&#39;s trainer/performer.<br/>\n<br/>\n-=-Sandra probably didn&#39;t know this, but I just got the best thank you note<br/>\nfrom her daughter, Holly, that I&#39;ve ever seen.-=-<br/>\n<br/>\nWow.  I didn&#39;t see it, but I knew she wrote one, for two reasons:<br/>\nYesterday she told me what she wanted to do before the end of the day, and a thank-you note to Pam was top of her list, but she was also missing Will, her boyfriend.  After a long road trip, she hadn&#39;t seen him all week and was getting frustrated.  We talked about that a long time.  Boys.  Girls&#39; relative neediness.  Introverts (which he is) and how they can baffle and frustrate extroverts (which she is).  I made some suggestions she didn&#39;t want to hear.  I was feeling like I was talking too much, and so forth and so on.   But she took one of the suggestions, and he agreed to go to lunch with her on his break from his student-aid job.  They&#39;ve spent lots of time together since then, and she&#39;s back out with him now, but she did say last night that she hadn&#39;t finished the letter to Pam.   <br/>\n<br/>\nSo even though she was reunited with her sweetie, she was still thinking about what she had planned to do.  I like that. :-)<br/>\n<br/>\nSo she was here for a few hours this afternoon, and asked me what she should put as the subject line on a thank-you note.  I said... &quot;Thank you?&quot;<br/>\n<br/>\nShe laughed and didn&#39;t tell me what she was going to call it and I didn&#39;t ask.  She asked me whether to capitalize words in a subject line, like a title.    So although she has used e-mail since she could write, I guess she was treating this one as more important than others.  I said no, that e-mail used the traditions of office memos, from, to, and &quot;regarding&quot; and that would be a phrase with a capital on the first word.<br/>\n<br/>\nAnd that&#39;s all I knew of her note to Pam until Pam wrote about it here. :-)<br/>\n<br/>\nI think this is an example of something wonderful Pam wrote once:<br/>\n&quot;As we get older and our kids grow up, we eventually come to realize that all the big things in our lives are really the direct result of how we&#39;ve handled all the little things.&quot; Pam Sorooshian, June 4, 2007<br/>\n<br/>\nI love that quote, and I put it right at the top of this.  I&#39;ve opened that page and cut and pasted that quote half a dozen times, and will probably do it many more times over years to come.  <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/pamsorooshian\">http://sandradodd.com/pamsorooshian</a><br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":185586397,"authorName":"Lyla Wolfenstein","from":"Lyla Wolfenstein &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Help with manners and family relationships","postDate":"1364085464","msgId":71048,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBREZVMFNDYWdoeTBRV3BvYkZ5K3FxWHhxV0QzVTlqU3JzQndOTFZRZ1AzYnB6WndhZ0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PENBT09UYVhPNEhYb1dPQ2J6a2FlYkNZczVFUzAxZXlZMW9VR0I5UUQ4VWRGWmVxU2VzUUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PGtpa201aCt1aW82QGVHcm91cHMuY29tPgk8MThFQzQyMDQtMTE4NC00NTE0LTgwNDQtMDI1M0E5REFDMEMwQFNhbmRyYWRvZGQuY29tPgk8Q0FPT1RhWE80SFhvV09DYnprYWViQ1lzNUVTMDFleVkxb1VHQjlRRDhVZEZaZXFTZXNRQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":71047,"nextInTopic":71049,"prevInTime":71047,"nextInTime":71049,"topicId":71034,"numMessagesInTopic":0,"msgSnippet":"i have a little story too - i ve never had a rule about saying thank you, etc., but, like sandra, might remind my kids when they were younger that a person","messageBody":"<div id=\"ygrps-yiv-1513853621\">i have a little story too - i&#39;ve never had a &quot;rule&quot; about saying thank you,<br/>\netc., but, like sandra, might remind my kids when they were younger that a<br/>\nperson might appreciate hearing it, or ask them if they wanted to say<br/>\nthanks before we left somewhere where someone had hosted or done something<br/>\nnice for them.<br/>\n<br/>\nmy kids are 14 and almost 18 now, and the other week, an acquaintance was<br/>\nat my house, cleaning it for me, on a barter arrangement.  my son had never<br/>\nmet her before, and he was just waking up and getting going while she was<br/>\nhere cleaning (and i was gone, with my daughter.)  i just heard from her<br/>\nyesterday that he was super appreciative and sweet - thanking her for all<br/>\nshe was doing, and even going so far as to ask if there was anything he<br/>\ncould to to help!<br/>\n<br/>\nthat kind of thoughtfulness *really* doesn&#39;t come from drilling or rules or<br/>\nrequirements. :)<br/>\n<br/>\nlyla<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sat, Mar 23, 2013 at 5:15 PM, Pam Sorooshian &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pamsoroosh@...\">pamsoroosh@...</a>&gt;wrote:<br/>\n<br/>\n&gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; On Sat, Mar 23, 2013 at 10:47 AM, Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt;<br/>\n&gt; wrote:<br/>\n&gt;<br/>\n&gt; When I would coach, I might say &quot;When you leave, thank the kid&#39;s mom for<br/>\n&gt; &gt; letting you play, if you think about it.&quot; or &quot;If you get a chance, tell<br/>\n&gt; her<br/>\n&gt; &gt; I said thank you, too.&quot; I didn&#39;t check back later, and I never was rough<br/>\n&gt; &gt; or mean about it, because they saw the value in it and they wanted to do<br/>\n&gt; &gt; it, but sometimes they forgot. And because it wasn&#39;t &quot;a rule,&quot; they<br/>\n&gt; &gt; didn&#39;t &quot;break a rule.&quot;&gt;&gt;<br/>\n&gt;<br/>\n&gt; Sandra probably didn&#39;t know this, but I just got the best thank you note<br/>\n&gt; from her daughter, Holly, that I&#39;ve ever seen. I helped her just a bit in<br/>\n&gt; planning a trip through my state. (I wish I could have helped more, all I<br/>\n&gt; really did was talk a bit with her about it and give her some ideas.)<br/>\n&gt; Anyway, she wrote me a thank you email which was super sweet, very specific<br/>\n&gt; and thoughtful, told me exactly what she appreciated, that she&#39;d thought of<br/>\n&gt; me during the trip (and why), and she attached a photo that was<br/>\n&gt; specifically of interest to me. If she&#39;d been taking lessons in thank you<br/>\n&gt; note writing, it couldn&#39;t have been more perfect, but it could have been<br/>\n&gt; less genuine. My reaction was to be very glad I&#39;d helped her out as much as<br/>\n&gt; I could, and to hope I&#39;d have the chance to help her again in the future.<br/>\n&gt; My next reaction was to once again be impressed by her ability to write so<br/>\n&gt; clearly and in her own voice. And then I thought about how she appreciated<br/>\n&gt; something that wasn&#39;t even at all concrete - she sent me a really nice<br/>\n&gt; thank you note for a conversation! I really don&#39;t think many young adults<br/>\n&gt; would even think of doing that!<br/>\n&gt;<br/>\n&gt; -pam<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":504505579,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Help with manners and family relationships","postDate":"1364084112","msgId":71047,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBT09UYVhPNEhYb1dPQ2J6a2FlYkNZczVFUzAxZXlZMW9VR0I5UUQ4VWRGWmVxU2VzUUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDE4RUM0MjA0LTExODQtNDUxNC04MDQ0LTAyNTNBOURBQzBDMEBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGtpa201aCt1aW82QGVHcm91cHMuY29tPgk8MThFQzQyMDQtMTE4NC00NTE0LTgwNDQtMDI1M0E5REFDMEMwQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":71046,"nextInTopic":71048,"prevInTime":71046,"nextInTime":71048,"topicId":71034,"numMessagesInTopic":0,"msgSnippet":"On Sat, Mar 23, 2013 at 10:47 AM, Sandra Dodd  wrote: When I would coach, I might say When you leave, thank the kid s mom for ... ","messageBody":"<div id=\"ygrps-yiv-498792489\"><blockquote><span title=\"qreply\">On Sat, Mar 23, 2013 at 10:47 AM, Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; wrote:<br/>\n<br/>\nWhen I would coach, I might say &quot;When you leave, thank the kid&#39;s mom for<br/>\n&gt; letting you play, if you think about it.&quot; or &quot;If you get a chance, tell her<br/>\n&gt; I said thank you, too.&quot;   I didn&#39;t check back later, and I never was rough<br/>\n&gt; or mean about it, because they saw the value in it and they wanted to do<br/>\n&gt; it, but sometimes they forgot.   And because it wasn&#39;t &quot;a rule,&quot; they<br/>\n&gt; didn&#39;t &quot;break a rule.&quot;&gt;&gt;<br/>\n<br/>\n<br/>\nSandra probably didn&#39;t know this, but I just got the best thank you note<br/>\nfrom her daughter, Holly, that I&#39;ve ever seen. I helped her just a bit in<br/>\nplanning a trip through my state. (I wish I could have helped more, all I<br/>\nreally did was talk a bit with her about it and give her some ideas.)<br/>\nAnyway, she wrote me a thank you email which was super sweet, very specific<br/>\nand thoughtful, told me exactly what she appreciated, that she&#39;d thought of<br/>\nme during the trip (and why), and she attached a photo that was<br/>\nspecifically of interest to me. If she&#39;d been taking lessons in thank you<br/>\nnote writing, it couldn&#39;t have been more perfect, but it could have been<br/>\nless genuine. My reaction was to be very glad I&#39;d helped her out as much as<br/>\nI could, and to hope I&#39;d have the chance to help her again in the future.<br/>\nMy next reaction was to once again be impressed by her ability to write so<br/>\nclearly and in her own voice. And then I thought about how she appreciated<br/>\nsomething that wasn&#39;t even at all concrete - she sent me a really nice<br/>\nthank you note for a conversation! I really don&#39;t think many young adults<br/>\nwould even think of doing that!<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Help with manners and family relationships","postDate":"1364067683","msgId":71046,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtpbDBoMyt0ZjllQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGtpa201aCt1aW82QGVHcm91cHMuY29tPg=="},"prevInTopic":71045,"nextInTopic":71047,"prevInTime":71045,"nextInTime":71047,"topicId":71034,"numMessagesInTopic":0,"msgSnippet":"... ************* I wonder if there s a difference in how often/easily extroverts and introverts express courtesy as children - something related to this idea","messageBody":"<div id=\"ygrps-yiv-1547116038\">&quot;Karen&quot; &lt;semajrak@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;But as for being polite or well mannered or considerate of others, he&#39;s decided for himself how he would like to interact with people<br/>\n </span></blockquote>*************<br/>\n<br/>\nI wonder if there&#39;s a difference in how often/easily extroverts and introverts express courtesy as children - something related to this idea of empathy and that true courtesy is something other than a song and dance routine. Because it&#39;s stressful for introverts to deal with other people, I wonder if they&#39;re less likely to be &quot;the polite children&quot; regardless. <br/>\n<br/>\nMo&#39;s more often polite to other kids than to adult - but then adults are more likely to treat her with the weird artificial manners adults use on kids. When adults talk to Morgan like a person rather than a child, she&#39;s significantly more likely to be warm and courteous. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;The gentleman at the fish counter was not in a hurry to serve me, but I didn&#39;t mind.  When he did come by, I asked in a warm manner, &quot;May I please have about a pound of that salmon?&quot;  While he grabbed it, he looked up at me and said, &quot;That is the nicest anyone has asked me for help in a long time.  Thanks.&quot;  <br/>\n </span></blockquote>***************<br/>\n<br/>\nWhen I first moved to the South I was amazed at how appallingly rude people were, especially salespeople. There&#39;s this idea that Southerners are super-polite, but to me they seemed anything but - they dawdled around, talking about nothing at all and never getting to the point. It took awhile for me to relax into the slow-motion version of Southern politeness, and I still give a little sigh of relief when I head back up into the Midwest and people get down to business with alacrity and only Then make polite chit-chat. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Help with manners and family relationships","postDate":"1364060855","msgId":71045,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE4RUM0MjA0LTExODQtNDUxNC04MDQ0LTAyNTNBOURBQzBDMEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGtpa201aCt1aW82QGVHcm91cHMuY29tPg==","referencesHeader":"PGtpa201aCt1aW82QGVHcm91cHMuY29tPg=="},"prevInTopic":71044,"nextInTopic":71046,"prevInTime":71044,"nextInTime":71046,"topicId":71034,"numMessagesInTopic":0,"msgSnippet":"-=- By that time, it was becoming second nature, I think, for me to be more pleasant and considerate of others, and to treat others with more respect. It","messageBody":"<div id=\"ygrps-yiv-643528815\">-=- By that time, it was becoming second nature, I think, for me to be more pleasant and considerate of others, and to treat others with more respect. It actually gave me a great amount of joy to be kind. I think my son could sense that, because when he started talking, and asking for things, it kind of surprised me how polite he was. -=-<br/>\n<br/>\nKeith and I were together for six years before we got married, and two more before Kirby was born.  We had always, from the very beginning of hanging out (not exactly &quot;dating&quot;) and first being a couple, said &quot;please&quot; and &quot;thanks&quot; about the smallest things, like a tissue, or a glass of water, or pass some food.  He was just that way, and I was just that way, so we liked that about the other person.<br/>\n<br/>\nWe said &quot;please&quot; to our kids before they could talk or understand us, and as they began to understand, they heard &quot;Could you bring that over here, please?&quot; and not &quot;Go Get THAT.&quot;  I heard other parents, in public places, or when I visited,&quot; talking to their children in really rude ways, as though the kids were awful, sneaky, worthless little nobodies.  It took me aback, and I think my mom talked to me that way a lot.   <br/>\n<br/>\nLuckily, various little tweaks and changes in my life had not brought me to be that same way.   <br/>\n<br/>\nOf course when people get tired and hungry their mom can come out of them, so how cool for kids who, if they channel their mom, will still be defaulting to something polite!  :-)<br/>\n<br/>\nWe never &quot;made&quot; our kids say please or thank you, but sometimes I would coach them if they were going somewhere and I wouldn&#39;t be there.  Or if someone gave one of them something and he was too excited by the new thing to remember to say thanks, then I would say thanks for him, and often in a better way.   &quot;Thank you&quot; by itself doesn&#39;t even mean anything.  It&#39;s the leftover bits of some longer, forgotten phrase, the way &quot;good bye&quot; just means.....   good bye (but has the vestigial parts of &quot;god be with you&quot; or &quot;God by ye&quot; more specifically).<br/>\n<br/>\nI would more likely say something like &quot;OH!  This is so cool, Chris.  I&#39;m so glad you thought of Kirby.  He&#39;s really going to have fun with this.  Thank you!&quot;  Sometimes if it seemed the other person was waiting for a &quot;thank you&quot; I might say &quot;I think he&#39;s too excited to say thanks, but that means he really loves it!  Thank you!&quot;  <br/>\n<br/>\nWhen I would coach, I might say &quot;When you leave, thank the kid&#39;s mom for letting you play, if you think about it.&quot; or &quot;If you get a chance, tell her I said thank you, too.&quot;   I didn&#39;t check back later, and I never was rough or mean about it, because they saw the value in it and they wanted to do it, but sometimes they forgot.   And because it wasn&#39;t &quot;a rule,&quot; they didn&#39;t &quot;break a rule.&quot;  <br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":284087656,"authorName":"Karen","from":"&quot;Karen&quot; &lt;semajrak@...&gt;","profile":"semajrak","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Help with manners and family relationships","postDate":"1364057073","msgId":71044,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtpa201aCt1aW82QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGtpZTBxNCtmZWttQGVHcm91cHMuY29tPg=="},"prevInTopic":71043,"nextInTopic":71045,"prevInTime":71043,"nextInTime":71045,"topicId":71034,"numMessagesInTopic":0,"msgSnippet":"... When I was younger and living alone, I visited a fish market one afternoon in preparation for a dinner I was making for Doug and I.  We had just started","messageBody":"<div id=\"ygrps-yiv-1704669976\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;&gt; I really would welcome some advice on the way our son (4.5) talks to us and asks for things. He sounds so demanding.&lt;&lt;&lt;&lt;&lt; <br/>\n<br/>\n </span></blockquote>When I was younger and living alone, I visited a fish market one afternoon in preparation for a dinner I was making for Doug and I.  We had just started dating at the time.  I was in a good mood, feeling excited about our evening together.  The gentleman at the fish counter was not in a hurry to serve me, but I didn&#39;t mind.  When he did come by, I asked in a warm manner, &quot;May I please have about a pound of that salmon?&quot;  While he grabbed it, he looked up at me and said, &quot;That is the nicest anyone has asked me for help in a long time.  Thanks.&quot;  <br/>\n<br/>\nI felt really good about that.  So good, in fact, that as I walked back to my apartment with the rest of my groceries, I decided that I would try to communicate in a more kind and generous way to more people.  Over the years, I feel like I lived up to that quiet, private goal.  <br/>\n<br/>\nFast forward several years from that initial shopping experience, and I had my son, Ethan.  By that time, it was becoming second nature, I think, for me to be more pleasant and considerate of others, and to treat others with more respect.  It actually gave me a great amount of joy to be kind.  I think my son could sense that, because when he started talking, and asking for things, it kind of surprised me how polite he was.  I think it surprised others too.  In fact, I remember at my dad&#39;s 80th birthday a few years ago, Ethan ordered his food by saying, &quot;May I please have the...&quot;  The young woman put a hand on her chest and complimented him on lovely his manners were.  Everyone looked at him.  Then everyone looked at me.  <br/>\n<br/>\nI would say both Ethan and I felt a bit uncomfortable for that focused moment of attention, but it was also kind of delightful.  For, I had never coached Ethan on how to ask for anything.  I have reminded him to say thanks for things.  But, I know he likes to give thanks, and sometimes he forgets.  When he realizes he&#39;s forgotten, he expresses disappointment.  So, I do help him there.  But as for being polite or well mannered or considerate of others, he&#39;s decided for himself how he would like to interact with people, and I believe he&#39;s gotten feedback from seeing how I interact with people and the delight I feel when I&#39;ve made someone&#39;s day a bit lighter.<br/>\n<br/>\nReading this over made me remember one of my son&#39;s favourite books when he was younger.  It was &quot;How Kind&quot; by Mary Murphy.  He used to ask me to read that one over and over and over, and always liked to call out &quot;How kind!&quot; when those parts came along in the book.  That&#39;s a sweet memory :-)  I can still hear his voice.</div>","specialLinks":[]},{"userId":291337950,"authorName":"alma","from":"&quot;alma&quot; &lt;almadoing@...&gt;","profile":"almadoing","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Help with manners and family relationships","postDate":"1364056095","msgId":71043,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtpa2w2ditsOXBqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGtpaTUwZys5ZHZjQGVHcm91cHMuY29tPg=="},"prevInTopic":71042,"nextInTopic":71044,"prevInTime":71042,"nextInTime":71044,"topicId":71034,"numMessagesInTopic":0,"msgSnippet":"... Yes - indeed. Which is why if you are expecting a child to learn politeness as a consequence of your being polite to the child it is missing the point. If","messageBody":"<div id=\"ygrps-yiv-269775630\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Meredith&quot; &lt;plaidpanties666@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;  &quot;alma&quot; &lt;almadoing@&gt; wrote:<br/>\n&gt; &gt;&gt; If your goal is for Jack to say his please and thank yous there are perhaps more effective ways to achieve that at age 4 than unschooling eg sticker charts.<br/>\n&gt; **************<br/>\n&gt; <br/>\n&gt; But whether Any teaching or behavior modification method will work the way you want it to work depends on your child and your ability to adapt to your child. If the method you choose doesn&#39;t fit the way your child thinks and learns, it will fail - and you&#39;ll be left with options about increasing degrees of punishment and/or modifying your approach. <br/>\n&gt; <br/>\n&gt; ---Meredith<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>Yes - indeed. Which is why if you are expecting a child to learn politeness as a consequence of your being polite to the child it is missing the point. If you are being polite to a child because you believe that being polite, kind, respectful etc to the child is the *right* thing to do, rather than as a means to an end, you are then setting up a situation that the child knows what those things really look and feel like. When the child feels kindness and respect in his or her own heart, the behaviours (eg thanking or apologising) are more readily forthcoming. <br/>\n<br/>\nAlison</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Help with manners and family relationships","postDate":"1363973968","msgId":71042,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtpaTUwZys5ZHZjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGtpaHBjcCtiMnZkQGVHcm91cHMuY29tPg=="},"prevInTopic":71041,"nextInTopic":71043,"prevInTime":71041,"nextInTime":71043,"topicId":71034,"numMessagesInTopic":0,"msgSnippet":"... ************** But whether Any teaching or behavior modification method will work the way you want it to work depends on your child and your ability to","messageBody":"<div id=\"ygrps-yiv-391190430\">&quot;alma&quot; &lt;almadoing@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; If your goal is for Jack to say his please and thank yous there are perhaps more effective ways to achieve that at age 4 than unschooling eg sticker charts.<br/>\n </span></blockquote>**************<br/>\n<br/>\nBut whether Any teaching or behavior modification method will work the way you want it to work depends on your child and your ability to adapt to your child. If the method you choose doesn&#39;t fit the way your child thinks and learns, it will fail - and you&#39;ll be left with options about increasing degrees of punishment and/or modifying your approach. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":247112349,"authorName":"michelle_m29","from":"&quot;michelle_m29&quot; &lt;mmarr@...&gt;","profile":"michelle_m29","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Help with manners and family relationships","postDate":"1363970479","msgId":71041,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtpaTFqZitycWlmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGtpZmhmcys0N2xhQGVHcm91cHMuY29tPg=="},"prevInTopic":71040,"nextInTopic":71042,"prevInTime":71040,"nextInTime":71042,"topicId":71034,"numMessagesInTopic":0,"msgSnippet":"... Meredith, you ve just completely solved a puzzle that I ve been wrestling with since Thanksgiving -- thank you! Several times while the family was","messageBody":"<div id=\"ygrps-yiv-1843421254\"><blockquote><span title=\"ireply\">&gt;Imagine every time you wanted something having to stand on one foot &gt;and sing a little song - to a little kid, the effort of courtesy is &gt;like that. And if he stands on the wrong foot, or sings the wrong &gt;song, someone tells him off. <br/>\n<br/>\n </span></blockquote>Meredith, you&#39;ve just completely solved a puzzle that I&#39;ve been wrestling with since Thanksgiving -- thank you! <br/>\n<br/>\nSeveral times while the family was together, my two-year-old neice asked me for something and another adult jumped in, completely stopped both of us, and made her repeat herself and say please. <br/>\n<br/>\nI saw the same thing happen many more times when I wasn&#39;t directly involved and it was driving me absolutely nuts. My four kids all say please and thank you and no one ever drilled it into them like that. <br/>\n<br/>\nNow I get it. Maddie WAS asking me nicely. She had the right tone of voice, but as far as the other adults in the room were concerned, she wasn&#39;t doing -exactly- the right little song and dance.  I was seeing her requests as polite enough for a toddler. And they were just as polite as most of the adults in the room would have been if they&#39;d asked me to hand them something.    <br/>\n<br/>\nI&#39;d never thought of it as a precise little performance that we require of our kids. Seeing it that was explains a lot. <br/>\n<br/>\nMichelle</div>","specialLinks":[]},{"userId":291337950,"authorName":"alma","from":"&quot;alma&quot; &lt;almadoing@...&gt;","profile":"almadoing","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Help with manners and family relationships","postDate":"1363962073","msgId":71040,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtpaHBjcCtiMnZkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGtpZTBxNCtmZWttQGVHcm91cHMuY29tPg=="},"prevInTopic":71039,"nextInTopic":71041,"prevInTime":71039,"nextInTime":71041,"topicId":71034,"numMessagesInTopic":0,"msgSnippet":"I m guessing a lot of this is about underlying fear. In order to trust this whole unschooling thing you re perhaps wanting to see tangible results that Jack is","messageBody":"<div id=\"ygrps-yiv-361519891\">I&#39;m guessing a lot of this is about underlying fear. In order to trust this whole unschooling thing you&#39;re perhaps wanting to see tangible results that Jack is at least as polite, clever, amenable, well-exercised etc etc as his peers or you worry it is not working or that others around you will point out that it&#39;s not.<br/>\n<br/>\nIf your goal is for Jack to say his please and thank yous there are perhaps more effective ways to achieve that at age 4 than unschooling eg sticker charts. Unschooling is NOT a short term fix for these things.  Also, if you are generally patient and kind with Jack but sometimes you&#39;re frustrated, or fearful, or exasperated then might Jack pick up on this. Your big emotions around how you parent are maybe reflected in his big responses.<br/>\n<br/>\nThe stroller thing too seems about fear - Jack&#39;ll be unfit if I honour his desire to use the stroller to go and buy lemonade. From Jack&#39;s perspective the focus was on the lemonade, and the quickest and easiest way to get it, from that perspective, was in the stroller. To insist on walking seems, from that perspective, deliberately obstructive. [Incidentally, I still have a stroller for this sort of occasional use and my younger son is 8!] Perhaps Jack would have been interested in scootering to the shop, or racing Dad, or having a pillow fight or ball kick-about later in the day etc etc. <br/>\n<br/>\nUnschooling parents want polite and fit children as much as any others. In your examples though you can see that the in-the-moment risks to the relationships between you all were far greater than the risks to Jack&#39;s politeness or fitness. This is what I think you need to think about if you are considering unschooling.<br/>\n<br/>\nI&#39;d also recommend &quot;Playful Parenting&quot; by Lawrence J Cohen. A lot of his ideas really helped me loosen up and deal with these sorts of incidents with silly playfulness rather than serious talking. <br/>\n<br/>\nAlison<br/>\nDS(10) and DS(8)<br/>\n<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;keeliereader&quot; &lt;keeliebean@...&gt; wrote:&gt;<br/>\n<blockquote><span title=\"qreply\"> &gt; I really would welcome some advice on the way our son (4.5) talks to us and asks for things. He sounds so demanding. Occasionally he will say please &quot; he knows how to phrase things politely. Weve talked about using kind words when you ask others to do things for you but sometimes it comes out as I told you I want x right now!. <br/>\n&gt; <br/>\n&gt; I guess until now weve been patient, reacted with kindness, said things like Im happy to do it for you, but I prefer to be asked nicely. And now we dont feel so patient. We try to accommodate all of his requests and Im tired of the way he talks to us.  <br/>\n&gt; <br/>\n&gt; I woke up with mild food poisoning this morning. DH offered to stay home. I declined but then when I realised standing up was making me sick, I gratefully accepted and he came home. DH and Jack went to the shops to buy some lemonade and thats when it started. Jack is not the most active kid and he asked to go in the stroller. DH refused saying Jack needs to get more exercise &quot; he loves certain TV programs, movies, games and youtube videos and DH worries about too much screen time. (We dont limit. Weve talked about offering him something more exciting if we are uncomfortable with it). <br/>\n&gt; <br/>\n&gt; Anyway, meltdown ensued and eventually DH conceded and took Jack in the stroller (its a 12 minute return walk). That obviously could have been totally avoided by giving Jack the choice to go in the stroller. <br/>\n&gt; <br/>\n&gt; Then DH cooked rice for lunch (lack of choice again). Jack said he didnt want rice he wanted popcorn. Hes not keen on eating rice (at home). And we descended into tears again because Jack was demanding popcorn and DH said he would be happy to do it if he was asked nicely. <br/>\n&gt; <br/>\n&gt; Jack refused and came into the bedroom. He cried and raged and said he didnt want to say please.  I listened and empathised. He asked me to intervene and I refused &quot; because it affects my relationship with DH when I advocate for Jack (I didnt say that. I said it was between him and daddy to resolve). Plus I dont think DH was being totally unreasonable asking him to rephrase it.  <br/>\n&gt; <br/>\n&gt; This is part of a bigger issue I guess where DH and Jack have a tricky relationship sometimes (Jack often says he doesnt like DH). But also, Jack seems really unhappy. Hes always been a little bit grumpy but we dont know why this is so hard for him.  I know that hunger is a big trigger for him but is this normal at his age?  And how do I help father and son build a more positive relationship without getting in between them?<br/>\n&gt; <br/>\n&gt; For background, my son goes to day care one day a week, although last year he was going 3 days. Its a very nurturing relaxed environment and his best friend is there the same day as him. He is happy to go (although given the choice would probably stay at home). <br/>\n&gt; <br/>\n&gt; Ive started working from home part-time so hes now at home a lot more. I would like to home school (unschool) although I have some fears around that. His dad is less keen on the idea so its something I want us to choose together. <br/>\n&gt; <br/>\n&gt; Jack recently started kinder (Australian kids attend 15 hours of kinder a week in preparation for school) &quot; he wanted to go because big boys go to kinder. He loved it for two weeks then suddenly did not want to go so we dropped it. <br/>\n&gt; <br/>\n&gt; All this to say were not unschoolers but someday maybebut I find the advice on this list second to none and thats why Im posting here. I feel stuck - please help. <br/>\n&gt; <br/>\n&gt; Thanks, <br/>\n&gt; Keelie<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Help with manners and family relationships","postDate":"1363888444","msgId":71039,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtpZmhmcys0N2xhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGtpZTBxNCtmZWttQGVHcm91cHMuY29tPg=="},"prevInTopic":71038,"nextInTopic":71040,"prevInTime":71038,"nextInTime":71040,"topicId":71034,"numMessagesInTopic":0,"msgSnippet":"... ************* As young as your son is, keeping things positive between father and son may involve getting between them. Some 4yos are still much, much more","messageBody":"<div id=\"ygrps-yiv-1190972223\">&quot;keeliereader&quot; &lt;keeliebean@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;how do I help father and son build a more positive relationship without getting in between them?<br/>\n </span></blockquote>*************<br/>\n<br/>\nAs young as your son is, keeping things positive between father and son may involve getting between them. Some 4yos are still much, much more interested in mom than in dad. My daughter was like that. It wasn&#39;t until she was old enough to understand her dad&#39;s sense of humor that they really started to be friends - and that&#39;s with a dad committed to radical unschooling. They weren&#39;t fighting about anything, George just wasn&#39;t mommy. <br/>\n<br/>\nIn the interim, I ran a bit of interference and did what I could so Mo didn&#39;t feel &quot;stuck&quot; with her dad - if they were going to be together I set them up for a good time. It helped that George wasn&#39;t interested in asserting his authority or any of the usual dad sorts of things - he was happy to keep things as light and fun as he could and give Mo lots of space when she needed it. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; I guess until now weve been patient, reacted with kindness, said things like Im happy to do it for you, but I prefer to be asked nicely. And now we dont feel so patient.<br/>\n </span></blockquote>***************<br/>\n<br/>\nIt sounds like you expected he&#39;d start being polite by a certain age or after a certain number of repetitions - you thought he&#39;d have it figured out by now. And he might, but he&#39;s also 4. He&#39;s learning about language and people and bodies and dirt and cartoons and physics and music and patterns and coordination and a whole lot more - and sometimes learning all those things at once will get in the way of remembering all the details of courtesy. Details like how to pitch his voice so it&#39;s a &quot;nice voice&quot;, and which words to say in which order. Imagine every time you wanted something having to stand on one foot and sing a little song - to a little kid, the effort of courtesy is like that. And if he stands on the wrong foot, or sings the wrong song, someone tells him off. <br/>\n<br/>\nSome kids figure out the song and dance of courtesy early - just like some kids learn to read early. For some, it&#39;s easy! But there are plenty of adults who still struggle to get the song and dance right, especially if they&#39;re tired or hungry or out of sorts. <br/>\n<br/>\nIt will help, in terms of how you see your son, to look for the kind and sweet things he does. The catch is that because he&#39;s so little &quot;kind and sweet&quot; will be from his perspective. Like allowing you to hold a dead bug he found. Or smiling and petting your arm... with sticky hands ;) The more you can see him being naturally kind and sweet, the easier it will be for you to wait on maturity, when he&#39;ll be able to sing and dance.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I guess until now weve been patient, reacted with kindness, said things like Im happy to do it for you, but I prefer to be asked nicely.<br/>\n </span></blockquote>**************<br/>\n<br/>\nThat&#39;s something to say now and then, not frequently. Certainly not every time. Now and then, when he doesn&#39;t seem tired or hungry or frustrated or otherwise out of sorts, offer him a little extra information. If you&#39;re saying it a lot, it ends up being blah, blah, blah, blah - the noise mom makes when she&#39;s getting a cup of milk. Be polite; it&#39;s polite to give helpful informatin, but not polite to belabor a point.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Help with manners and family relationships","postDate":"1363878022","msgId":71037,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAzQjU4NTdDLTZERUMtNEYyQi1CMDU4LUFCRDFDNDIwRkQzQUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGtpZTBxNCtmZWttQGVHcm91cHMuY29tPg==","referencesHeader":"PGtpZTBxNCtmZWttQGVHcm91cHMuY29tPg=="},"prevInTopic":71035,"nextInTopic":71038,"prevInTime":71036,"nextInTime":71038,"topicId":71034,"numMessagesInTopic":0,"msgSnippet":"I liked Joyce s responses. If you and your husband are uninterested in adjusting your thoughts and responses from antagonism and he s just a child to seeing","messageBody":"<div id=\"ygrps-yiv-1976795268\">I liked Joyce&#39;s responses.<br/>\n<br/>\nIf you and your husband are uninterested in adjusting your thoughts and responses from antagonism and &quot;he&#39;s just a child&quot; to seeing it as more of a partnership, where you&#39;re helping your son explore the world, and to have choices, things will not get better.  As Joyce pointed out, when there will be a loser and a winner, you will always have a loser, and sometimes everyone loses.  Ultimately the whole family loses.<br/>\n<br/>\nThese situations could have been avoided if your husband was accustomed to asking your son what he would like to do, and respecting the response:  <br/>\n-=-Anyway, meltdown ensued and eventually DH conceded and took Jack in the stroller (its a 12 minute return walk). That obviously could have been totally avoided by giving Jack the choice to go in the stroller. <br/>\n<br/>\n-=-Then DH cooked rice for lunch (lack of choice again). Jack said he didnt want rice he wanted popcorn. Hes not keen on eating rice (at home). And we descended into tears again because Jack was demanding popcorn and DH said he would be happy to do it if he was asked nicely. -=-<br/>\n<br/>\nThis might help:  <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/respect\">http://sandradodd.com/respect</a><br/>\nIf he&#39;s not respected, he can&#39;t be full of respect.  How can he &quot;show respect&quot; if he doesn&#39;t have any?  Give him some!  It can start to flow both ways, but it will never honestly flow all in one direction.<br/>\n<br/>\n-=-All this to say were not unschoolers but someday maybebut I find the advice on this list second to none and thats why Im posting here. I feel stuck - please help. -=-<br/>\n<br/>\nThanks for saying the advice is second to none.  That&#39;s nice.<br/>\nBut the advice is about unschooling, and might not work in a situation in which unschooling isn&#39;t being incorporated into the family&#39;s life and decisions.  <br/>\n<br/>\n-=-For background, my son goes to day care one day a week, although last year he was going 3 days. Its a very nurturing relaxed environment and his best friend is there the same day as him. He is happy to go (although given the choice would probably stay at home). -=-<br/>\n<br/>\nCould you have the best friend at your house on that day or some of those days?   What if your son DID have the choice?  He might still choose to go to the daycare to play with his friend.  (I&#39;m not asking the question to get a response, but only for you to consider it.)<br/>\n<br/>\nJoyce and I will be in Australia in late September and early October.  Depending where you are, maybe you could come somewhere where we&#39;ll be.  It&#39;s still vague and fuzzy, though. :-)<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":547671143,"authorName":"supermomblues","from":"&quot;supermomblues&quot; &lt;supermom2jakeandemmy@...&gt;","profile":"supermomblues","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Help with manners and family relationships","postDate":"1363874358","msgId":71038,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtpZjNubStudnRqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGtpZTBxNCtmZWttQGVHcm91cHMuY29tPg=="},"prevInTopic":71037,"nextInTopic":71039,"prevInTime":71037,"nextInTime":71039,"topicId":71034,"numMessagesInTopic":0,"msgSnippet":"... My son is five and just now starting to use manners . How did it happen? His father and I use OUR manners. Every time we talk to him or make a request we","messageBody":"<div id=\"ygrps-yiv-710824356\"><blockquote><span title=\"ireply\">&gt;&gt;&gt; I really would welcome some advice on the way our son (4.5) talks to us and asks for things. He sounds so demanding. Occasionally he will say please &quot; he knows how to phrase things politely. Weve talked about using kind words when you ask others to do things for you but sometimes it comes out as I told you I want x right now!.&lt;&lt;<br/>\n<br/>\n </span></blockquote>My son is five and just now starting to use &quot;manners&quot;. How did it happen? His father and I use OUR manners. Every time we talk to him or make a request we say &quot;would you mind doing so-and-so for me please?&quot; And when he does it we say &quot;thank you&quot;. If he doesn&#39;t or says &quot;I don&#39;t want to&quot; we say &quot;that&#39;s okay, thanks for thinking about it&quot; and don&#39;t make a big deal out of it.<br/>\n<br/>\nSomething else: I noticed that the meltdowns occurred when his freedom of choice was taken from him:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Jack is not the most active kid and he asked to go in the stroller. DH refused saying Jack needs to get more exercis&lt;&lt;<br/>\n<br/>\n&gt;&gt;Then DH cooked rice for lunch (lack of choice again). Jack said he didnt want rice he wanted popcorn. Hes not keen on eating rice (at home). And we descended into tears again because Jack was demanding popcorn and DH said he would be happy to do it if he was asked nicely.&lt;&lt;<br/>\n<br/>\n </span></blockquote>Maybe you need to offer more choices.<br/>\nIt sounds to me like Jack is a normal four year old young man. The bigger a deal you make out of it, the more he&#39;s going to push back and rebel. That&#39;s human - and especially young human - nature.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I know that hunger is a big trigger for him but is this normal at his age? &lt;&lt;<br/>\n<br/>\n </span></blockquote>I don&#39;t thing hunger was the trigger here. <br/>\nAnd yes, it is normal. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I would like to home school (unschool) although I have some fears around that. His dad is less keen on the idea so its something I want us to choose together.&lt;&lt;<br/>\n<br/>\n </span></blockquote>What is your fear of unschooling? Is your fear because of or affecting your husband&#39;s fears? Until you are willing to let go of that fear it won&#39;t work. Like Sandra says: &quot;Read a little, try a little, wait a little, watch&quot;. Read up on unschooling. Educate yourself and your husband.  Then, let go and watch the magic unfold - and it will unfold little by little.<br/>\n<br/>\nJennifer<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;keeliereader&quot; &lt;keeliebean@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; I really would welcome some advice on the way our son (4.5) talks to us and asks for things. He sounds so demanding. Occasionally he will say please &quot; he knows how to phrase things politely. Weve talked about using kind words when you ask others to do things for you but sometimes it comes out as I told you I want x right now!. <br/>\n&gt; <br/>\n&gt; I guess until now weve been patient, reacted with kindness, said things like Im happy to do it for you, but I prefer to be asked nicely. And now we dont feel so patient. We try to accommodate all of his requests and Im tired of the way he talks to us.  <br/>\n&gt; <br/>\n&gt; I woke up with mild food poisoning this morning. DH offered to stay home. I declined but then when I realised standing up was making me sick, I gratefully accepted and he came home. DH and Jack went to the shops to buy some lemonade and thats when it started. Jack is not the most active kid and he asked to go in the stroller. DH refused saying Jack needs to get more exercise &quot; he loves certain TV programs, movies, games and youtube videos and DH worries about too much screen time. (We dont limit. Weve talked about offering him something more exciting if we are uncomfortable with it). <br/>\n&gt; <br/>\n&gt; Anyway, meltdown ensued and eventually DH conceded and took Jack in the stroller (its a 12 minute return walk). That obviously could have been totally avoided by giving Jack the choice to go in the stroller. <br/>\n&gt; <br/>\n&gt; Then DH cooked rice for lunch (lack of choice again). Jack said he didnt want rice he wanted popcorn. Hes not keen on eating rice (at home). And we descended into tears again because Jack was demanding popcorn and DH said he would be happy to do it if he was asked nicely. <br/>\n&gt; <br/>\n&gt; Jack refused and came into the bedroom. He cried and raged and said he didnt want to say please.  I listened and empathised. He asked me to intervene and I refused &quot; because it affects my relationship with DH when I advocate for Jack (I didnt say that. I said it was between him and daddy to resolve). Plus I dont think DH was being totally unreasonable asking him to rephrase it.  <br/>\n&gt; <br/>\n&gt; This is part of a bigger issue I guess where DH and Jack have a tricky relationship sometimes (Jack often says he doesnt like DH). But also, Jack seems really unhappy. Hes always been a little bit grumpy but we dont know why this is so hard for him.  I know that hunger is a big trigger for him but is this normal at his age?  And how do I help father and son build a more positive relationship without getting in between them?<br/>\n&gt; <br/>\n&gt; For background, my son goes to day care one day a week, although last year he was going 3 days. Its a very nurturing relaxed environment and his best friend is there the same day as him. He is happy to go (although given the choice would probably stay at home). <br/>\n&gt; <br/>\n&gt; Ive started working from home part-time so hes now at home a lot more. I would like to home school (unschool) although I have some fears around that. His dad is less keen on the idea so its something I want us to choose together. <br/>\n&gt; <br/>\n&gt; Jack recently started kinder (Australian kids attend 15 hours of kinder a week in preparation for school) &quot; he wanted to go because big boys go to kinder. He loved it for two weeks then suddenly did not want to go so we dropped it. <br/>\n&gt; <br/>\n&gt; All this to say were not unschoolers but someday maybebut I find the advice on this list second to none and thats why Im posting here. I feel stuck - please help. <br/>\n&gt; <br/>\n&gt; Thanks, <br/>\n&gt; Keelie<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Help with manners and family relationships","postDate":"1363861352","msgId":71035,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFDMDdFMjAzLTVBOUUtNEQ3Qy1CRERDLTQwMDVDQzFFNTE5OEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGtpZTBxNCtmZWttQGVHcm91cHMuY29tPg==","referencesHeader":"PGtpZTBxNCtmZWttQGVHcm91cHMuY29tPg=="},"prevInTopic":71034,"nextInTopic":71037,"prevInTime":71034,"nextInTime":71036,"topicId":71034,"numMessagesInTopic":0,"msgSnippet":"... Is the goal for dad to win or to help Jack be more polite? Is refusing to comply until someone says something a certain way modeling politeness? Is","messageBody":"<div id=\"ygrps-yiv-771733536\">On Mar 21, 2013, at 12:03 AM, keeliereader wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Jack was demanding popcorn and DH said he would be happy to do it if he was asked nicely. <br/>\n&gt; <br/>\n&gt; Jack refused and came into the bedroom.<br/>\n<br/>\n </span></blockquote>Is the goal for dad to win or to help Jack be more polite?<br/>\n<br/>\nIs refusing to comply until someone says something a certain way modeling politeness?<br/>\n<br/>\nIs demanding someone stop demanding a way to show someone how to get someone to do something for you?<br/>\n<br/>\nDon&#39;t see making Jack parrot politeness as the same as helping him be polite. Parroting is quick if the child complies BUT it isn&#39;t sincere. He&#39;d be jumping through a hoop to get a need met. It can, at worst, cause embarrassment and resentment. Imagine if your husband insisted the only way you could get sex is if you said &quot;Pretty please.&quot;<br/>\n<br/>\nCreating an atmosphere for learning can take a long time to have an effect -- depending on the child&#39;s personality -- but the child will ask nicely because it *feels* nice to do so.<br/>\n<br/>\nI can understand that how he&#39;s asking is irritating But he&#39;s 4 and he&#39;s having a hard time with life for some reason. And, on top of that, the people he trusts to help him are making life even harder with their refusals of his requests and they demand that he jump through hoops before they&#39;ll help him.<br/>\n<br/>\nThe feedback your husband gave was good. But then he used his greater power to withhold food until the child did what he wanted.<br/>\n<br/>\n Maybe better is &quot;It makes it much easier to help you when you ask nicely,&quot; as he&#39;s getting what&#39;s been asked for. Change up how you give him feedback. Give it different ways. Try humor. Try a &quot;Hey, buddy, a kind voice is really appreciated,&quot; when you can manage it. If it&#39;s not tiredness or hunger and he&#39;s especially irritating, get down on his level and look him in the eye and say &quot;I&#39;d really like to help you but it makes it hard when you don&#39;t ask nicely.&quot; And then get what he&#39;s asking for. But, again, this isn&#39;t to force him to change. This is information, feedback, that he can use to change when he&#39;s developmentally able to use it.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But also, Jack seems really unhappy. He&#39;s always been a<br/>\n&gt; little bit grumpy but we don&#39;t know why this is so hard for him.<br/>\n<br/>\n </span></blockquote>Does making it harder for him make it easier? Does it help you understand him better? Or is it creating an atmosphere of you against him? Where someone is always losing. (And even when Jack &quot;wins&quot; by not jumping through the hoop, I doubt it feels much like winning to him.)<br/>\n<br/>\nTrust that he doesn&#39;t want to irritate you. But for some reason he&#39;s got prickly cactuses inside of him that make life uncomfortable. Don&#39;t add prickles to his outside too! You were given the child you were given. He needs your understanding that life isn&#39;t as easy for him as it is for others. He doesn&#39;t need parents who wish they had a different child.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; DH refused saying Jack needs to get more exercise he loves <br/>\n&gt; certain TV programs, movies, games and youtube videos and DH <br/>\n&gt; worries about too much screen time.<br/>\n<br/>\n </span></blockquote>And how well did that work?<br/>\n<br/>\nYou can&#39;t make him exercise more. You can, though, make him want to not exercise more by wrapping it in negative emotions. A forced 12 minute march doesn&#39;t sound like an exercise program many people would embrace.<br/>\n<br/>\nWhat kind of active things *does* he like? Do more of those. Instead of thinking of ways to get him to exercise more, think of fun things to do that happen to involve movement. Make fun the priority, exercise secondary.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; (Jack often says he doesn&#39;t like DH). <br/>\n<br/>\n<br/>\n </span></blockquote>Invite him to do thoughtful things with you for his dad. Draw him into doing thoughtful things for him too so the nice things aren&#39;t always about someone else. :-) (Do you do spontaneously nice things for Jack? Or is it mostly responding to his needs? Most kids will probably feel the nice things their parents do for them so making it more transparent won&#39;t be necessary. But it&#39;s possible, since life feels prickly to him, the thoughtful things you do for him feel like meeting needs. He&#39;s 4. His view of the world and his body is changing as he grows.)<br/>\n<br/>\nIt&#39;s okay if he refuses or says he hates his dad. Don&#39;t make it about him. Make it about you and your desire to do something nice for someone else. Say, &quot;Well, I like him and I like to do things that make him smile.&quot; Not as a guilting thing! It&#39;s not about him. It&#39;s information about your feelings and what you&#39;d like to do.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":363268824,"authorName":"keeliereader","from":"&quot;keeliereader&quot; &lt;keeliebean@...&gt;","profile":"keeliereader","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Help with manners and family relationships","postDate":"1363838596","msgId":71034,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtpZTBxNCtmZWttQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":71035,"prevInTime":71033,"nextInTime":71035,"topicId":71034,"numMessagesInTopic":0,"msgSnippet":"I really would welcome some advice on the way our son (4.5) talks to us and asks for things. He sounds so demanding. Occasionally he will say please  he","messageBody":"<div id=\"ygrps-yiv-1696998555\">I really would welcome some advice on the way our son (4.5) talks to us and asks for things. He sounds so demanding. Occasionally he will say please &quot; he knows how to phrase things politely. Weve talked about using kind words when you ask others to do things for you but sometimes it comes out as I told you I want x right now!. <br/>\n<br/>\nI guess until now weve been patient, reacted with kindness, said things like Im happy to do it for you, but I prefer to be asked nicely. And now we dont feel so patient. We try to accommodate all of his requests and Im tired of the way he talks to us.  <br/>\n<br/>\nI woke up with mild food poisoning this morning. DH offered to stay home. I declined but then when I realised standing up was making me sick, I gratefully accepted and he came home. DH and Jack went to the shops to buy some lemonade and thats when it started. Jack is not the most active kid and he asked to go in the stroller. DH refused saying Jack needs to get more exercise &quot; he loves certain TV programs, movies, games and youtube videos and DH worries about too much screen time. (We dont limit. Weve talked about offering him something more exciting if we are uncomfortable with it). <br/>\n<br/>\nAnyway, meltdown ensued and eventually DH conceded and took Jack in the stroller (its a 12 minute return walk). That obviously could have been totally avoided by giving Jack the choice to go in the stroller. <br/>\n<br/>\nThen DH cooked rice for lunch (lack of choice again). Jack said he didnt want rice he wanted popcorn. Hes not keen on eating rice (at home). And we descended into tears again because Jack was demanding popcorn and DH said he would be happy to do it if he was asked nicely. <br/>\n<br/>\nJack refused and came into the bedroom. He cried and raged and said he didnt want to say please.  I listened and empathised. He asked me to intervene and I refused &quot; because it affects my relationship with DH when I advocate for Jack (I didnt say that. I said it was between him and daddy to resolve). Plus I dont think DH was being totally unreasonable asking him to rephrase it.  <br/>\n<br/>\nThis is part of a bigger issue I guess where DH and Jack have a tricky relationship sometimes (Jack often says he doesnt like DH). But also, Jack seems really unhappy. Hes always been a little bit grumpy but we dont know why this is so hard for him.  I know that hunger is a big trigger for him but is this normal at his age?  And how do I help father and son build a more positive relationship without getting in between them?<br/>\n<br/>\nFor background, my son goes to day care one day a week, although last year he was going 3 days. Its a very nurturing relaxed environment and his best friend is there the same day as him. He is happy to go (although given the choice would probably stay at home). <br/>\n<br/>\nIve started working from home part-time so hes now at home a lot more. I would like to home school (unschool) although I have some fears around that. His dad is less keen on the idea so its something I want us to choose together. <br/>\n<br/>\nJack recently started kinder (Australian kids attend 15 hours of kinder a week in preparation for school) &quot; he wanted to go because big boys go to kinder. He loved it for two weeks then suddenly did not want to go so we dropped it. <br/>\n<br/>\nAll this to say were not unschoolers but someday maybebut I find the advice on this list second to none and thats why Im posting here. I feel stuck - please help. <br/>\n<br/>\nThanks, <br/>\nKeelie</div>","specialLinks":[]}],"prevTopicId":71145,"nextTopicId":71176}}