{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":9,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: revolving door","postDate":"1308301067","msgId":61623,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk3RDJEOTFELUJFQjgtNDZGNC05NjM0LTQ2RjdBQTA5RkU0RUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGl0ZTA1ZytuaHNmQGVHcm91cHMuY29tPg==","referencesHeader":"PGl0ZTA1ZytuaHNmQGVHcm91cHMuY29tPg=="},"prevInTopic":61621,"nextInTopic":0,"prevInTime":61622,"nextInTime":61624,"topicId":61604,"numMessagesInTopic":0,"msgSnippet":"-=-It really is hard to know, though, when a child s behavior is because of personality and when it s because of parenting. I think people tend to assume,","messageBody":"<div id=\"ygrps-yiv-962696122\">-=-It really is hard to know, though, when a child&#39;s behavior is because of personality and when it&#39;s because of parenting. I think people tend to assume, based on their own experiences. My sister still assumes that I couldn&#39;t have taken my son out enough when he was younger (he&#39;s a big old 5 year old now) or else he would be just like her daughter. -=-<br/>\n<br/>\nFriends of ours had a docile, shy daughter when we only had Kirby, who was neither of those things.   They were pretty confident that they were good parents and we weren&#39;t.<br/>\n<br/>\nThen they had another daughter, and we had Marty.   They ate crow then, because Marty was quiet, observant, charming, bright and didn&#39;t touch things without permission, while their second daughter was wildly impetuous and sneaky and mean.<br/>\n<br/>\nI got an effusive apology in those days, in which the other mom admitted they used to think they were great parents and Keith and i were totally messing our kid up. :-)<br/>\n<br/>\nSometimes people with only one child take too much blame or credit.<br/>\n<br/>\nJust being around a lot of other kids with the hope and intention of learning can help a lot, too.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":359600026,"authorName":"maryann","from":"&quot;maryann&quot; &lt;maryannh@...&gt;","profile":"maryannhh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: revolving door","postDate":"1308263408","msgId":61621,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGl0ZTA1ZytuaHNmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDU0ODI2NC43NTU4Mi5xbUB3ZWIxMjA1MDkubWFpbC5uZTEueWFob28uY29tPg=="},"prevInTopic":61618,"nextInTopic":61623,"prevInTime":61620,"nextInTime":61622,"topicId":61604,"numMessagesInTopic":0,"msgSnippet":"... I know alot of people who think kids ... I m noticing this may have alot to do with the kinds of kids people are familiar with, and how much they attribute","messageBody":"<div id=\"ygrps-yiv-2055102353\"><blockquote><span title=\"qreply\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, cindy jusino &lt;cindyjusino@...&gt; wrote:<br/>\nI know alot of people who think kids <br/>\n&gt; should have to just sit there quietly all day and not &quot;run around&quot;.  It&#39;s sad that&#39;s normal, why shouldn&#39;t kids be kids? <br/>\n&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nI&#39;m noticing this may have alot to do with the kinds of kids people are familiar with, and how much they attribute young children&#39;s behavior directly to parenting.  <br/>\n<br/>\nMy sister says her daughter, 3 1/2 years, wakes up every morning saying &quot;Where are we going today?&quot;  She loves to go anywhere, as long as it&#39;s not home.  One time after eating out with them--which was the max limit of my boy&#39;s being-still-in-public time--we asked them to go play at an indoor play area with us.  But my sister wanted new shoes, and wanted US to go shoe shopping with them instead of playing with us.  SHOE SHOPPING!  After lunch out, with two toddlers and two preschoolers and only two adults.  Why would I do that to us?  We did not go, because I knew it would not go well for us, and there was no good reason to put us through it.<br/>\n<br/>\nBut my niece loves shopping, will sit still, admire the shoes, give her opinion, cooperate, charm strangers with conversation, etc.  If there was any problem, I&#39;m sure my sister could say, &quot;Stop that or we&#39;re leaving&quot; about just about anything, while shoe shopping or waiting at the BMV, and her child would stop.  When I tell my child, &quot;They won&#39;t let us be here if we&#39;re doing that&quot;, he sometimes says, &quot;Let&#39;s go!&quot; (Then I usually explain why I need to be there and try harder to engage him more while we wait/shop/etc., or I hurry and go.)<br/>\n<br/>\nPoint is, my sister says she thinks her child likes going out and is good at behaving while out **because** she&#39;s always taken her out and &quot;expected her to behave&quot;.  The mother believes she has created a 3 1/2 year old child who is always cooperative and outgoing in public solely because of her parenting skills.  <br/>\n<br/>\nI used to take my son out ALOT.  When he was an infant and toddler, we went to LaLecheLeague meetings, weekly playgroup, library story time, parks, various stores, etc., etc. (My sister lived out of state until a few months ago, so she didn&#39;t witness this.)  Over time, my son began letting me know that he didn&#39;t enjoy being out as much as playing at home, and we&#39;ve gone out less and less since.  I&#39;m so glad he is able to think about it that way and make a choice (most of the time) that&#39;s best for him.<br/>\n<br/>\nMy boy is getting better and better at being out and about.  But it&#39;s not because I&#39;m making him go out alot. (I&#39;m not.) And I don&#39;t think his lack of ability to be still and enjoy someone else&#39;s shoe shopping trip at age 4 1/2 is because I haven&#39;t taken him out enough and taught him proper behavior.  I think it&#39;s because he&#39;s kind of like me ;) and he&#39;s ALOT like my brother was at his age.  And my sister&#39;s daughter happens to be alot like her.  <br/>\n<br/>\nIt really is hard to know, though, when a child&#39;s behavior is because of personality and when it&#39;s because of parenting.  I think people tend to assume, based on their own experiences.  My sister still assumes that I couldn&#39;t have taken my son out enough when he was younger (he&#39;s a big old 5 year old now) or else he would be just like her daughter.  <br/>\n<br/>\nIf we would have gone shoe shopping that day, I know my sister would have been mortified and offended that my son would not have joyfully participated.  And she seems to feel she&#39;s a superior parent for socializing her daughter so well.  That girl would sit in a doctor&#39;s office and charm everyone for an hour.  My boy would hide behind my leg if anyone so much as smiled at him, and would dart for the revolving door the first chance he got, yelling at his baby sister to join him.<br/>\n<br/>\nNeither of these is the parents&#39; fault or credit. It&#39;s nice when people know that. :)  The parenting part is all the redirecting I do in those situations, and the working out plans ahead of time for making sure he has time to play at home beforehand, bringing snacks and entertainment for him, looking up stuff about revolving doors, etc.  Or arranging to not bring him.<br/>\n<br/>\nAt 3 1/2, my niece is talkative to strangers and can sit still just fine when needed.  At 5, my son is shy and impulsive and active and sometimes can sit still just fine too.  I think these are related to personality traits and how they are expressed at these ages, not a function of parenting.  The parenting is how we work with the child we have to best help him in any given situation.  Sometimes just &quot;expecting him to behave&quot; doesn&#39;t work.  I&#39;ve tried.  ;)  Maybe if I threatened, shamed and punished I&#39;d get more results like my mom did, but in the end I don&#39;t really want those results!  I&#39;ve seen how it turned out in the long run.<br/>\n<br/>\nThanks for letting me share!  talkative today.<br/>\n<br/>\nmaryann </span></blockquote></div>","specialLinks":[]},{"userId":359600026,"authorName":"maryann","from":"&quot;maryann&quot; &lt;maryannh@...&gt;","profile":"maryannhh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Unschooling in Public was Re: revolving door","postDate":"1308256255","msgId":61618,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGl0ZHA1ditoZnFxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGl0ZGYzayszOW5zQGVHcm91cHMuY29tPg=="},"prevInTopic":61615,"nextInTopic":61621,"prevInTime":61617,"nextInTime":61619,"topicId":61604,"numMessagesInTopic":0,"msgSnippet":"... Yes!!  We do have fun if we can time it right, like this.  :) Often 5yo plays happily at home with daddy while 20mo and I do errands in the evening.","messageBody":"<div id=\"ygrps-yiv-561401306\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n&gt; It helped, when Ray was younger, to take him places when I was feeling feisty and energetic, able to *be* engaging and fun as well as get my errands run - and along with that to budget in extra time so that he could look around and explore without me going batty trying to do two things at once. The flip side of that was Not taking him out when I just needed to run through a quick bunch of errands - it was a set-up for frustration for both of us. <br/>\n&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>Yes!!  We do have fun if we can time it right, like this.  :)  <br/>\nOften 5yo plays happily at home with daddy while 20mo and I do errands in the evening.  win-win.  :)  <br/>\n<br/>\nSandra asked about explaining Why-- Yes, we work hard to think about reasons behind rules and explain them. Like, we don&#39;t run in particular places because we might accidentally run in to someone (like great-grandma) who could fall and really get hurt.  My boy understands this in theory, but at moments he forgets or just isn&#39;t thinking about it.  Carts are nice. :)  But mostly, I just need to keep him right with me, finding ways to keep him engaged with me, rather than running off to something else.  I guess the unschooling part is that when one of us does see something else interesting, we talk about it and make a point to check it out.  I just can&#39;t always keep up!</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: revolving door","postDate":"1308248193","msgId":61613,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkyQjhDM0JGLTEyM0MtNDcyNi05RjVDLTQxQTExNDI5RDE4Q0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGl0ZGNjays2M25tQGVHcm91cHMuY29tPg==","referencesHeader":"PGl0ZGNjays2M25tQGVHcm91cHMuY29tPg=="},"prevInTopic":61611,"nextInTopic":61614,"prevInTime":61612,"nextInTime":61614,"topicId":61604,"numMessagesInTopic":0,"msgSnippet":"-=-I do wish I knew better how to keep my son engaged and well-behaved away from home, because I d like to take him places more often, if he would enjoy","messageBody":"<div id=\"ygrps-yiv-570281553\">-=-I do wish I knew better how to keep my son engaged and &quot;well-behaved&quot;<br/>\naway from home, because I&#39;d like to take him places more often, if he<br/>\nwould enjoy it.-=-<br/>\n<br/>\n-=-Right now when we do get in the car to go someplace, I talk about me<br/>\nbeing the &quot;leader&quot; and how I need him to follow my lead because I know<br/>\nwhat we&#39;re supposed to be doing and he might not, so if he follows my<br/>\nlead I can help him behave appropriately. He is smart and gets this,<br/>\nbut is young and can&#39;t do it for long. Those spaces under the clothing<br/>\nracks at stores just seem to scream out his name! -=-<br/>\n<br/>\nThat sounds pretty good for a young child, and &quot;follow my lead&quot; is like a game.  It will help if you explain (briefly) why certain behavior is expected.  If it&#39;s &quot;I&#39;ll be the leader&quot; then how will he figure out what to do when you&#39;re not there?    It can work sometimes, though.<br/>\n<br/>\nMy kids loved those round clothing racks with the secret room in the middle, too, and depending on how crowded the store or how fancy the clothes, I might let them, but I&#39;d stay near.  Thrift stores were sometimes good places for that.  And sometimes not. :-)<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: revolving door","postDate":"1308245940","msgId":61615,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGl0ZGYzayszOW5zQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGl0ZGNjays2M25tQGVHcm91cHMuY29tPg=="},"prevInTopic":61614,"nextInTopic":61618,"prevInTime":61614,"nextInTime":61616,"topicId":61604,"numMessagesInTopic":0,"msgSnippet":"... It helped, when Ray was younger, to take him places when I was feeling feisty and energetic, able to *be* engaging and fun as well as get my errands run -","messageBody":"<div id=\"ygrps-yiv-508806861\">&quot;maryann&quot; &lt;maryannh@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I do wish I knew better how to keep my son engaged and &quot;well-behaved&quot;<br/>\n&gt; away from home, because I&#39;d like to take him places more often<br/>\n<br/>\n </span></blockquote>It helped, when Ray was younger, to take him places when I was feeling feisty and energetic, able to *be* engaging and fun as well as get my errands run - and along with that to budget in extra time so that he could look around and explore without me going batty trying to do two things at once. The flip side of that was Not taking him out when I just needed to run through a quick bunch of errands - it was a set-up for frustration for both of us. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: revolving door","postDate":"1308244914","msgId":61614,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRERkEzQkIyLjcwMjA1QGVhcnRobGluay5uZXQ+","inReplyToHeader":"PGl0ZGNjays2M25tQGVHcm91cHMuY29tPg==","referencesHeader":"PGl0ZGNjays2M25tQGVHcm91cHMuY29tPg=="},"prevInTopic":61613,"nextInTopic":61615,"prevInTime":61613,"nextInTime":61615,"topicId":61604,"numMessagesInTopic":0,"msgSnippet":"... Those are fantastic! Taking little kids clothes shopping isn t a great idea, I m sure you know. Grocery stores can be really fun, though, if you re not in","messageBody":"<div id=\"ygrps-yiv-2026916164\">On 6/16/2011 9:52 AM, maryann wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; And<br/>\n&gt; lately I&#39;ve started researching hand-held video game thingys to probably<br/>\n&gt; buy him sometime soon, to take with us when I want to go someplace that<br/>\n&gt; he may not be super interested in.<br/>\n<br/>\n </span></blockquote>Those are fantastic! Taking little kids clothes shopping isn&#39;t a great <br/>\nidea, I&#39;m sure you know. Grocery stores can be really fun, though, if <br/>\nyou&#39;re not in a hurry and take time to be really present with the child <br/>\nwhile you&#39;re also doing your shopping.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":359600026,"authorName":"maryann","from":"&quot;maryann&quot; &lt;maryannh@...&gt;","profile":"maryannhh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: revolving door","postDate":"1308243156","msgId":61611,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGl0ZGNjays2M25tQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEYyRDZGMUYzLUVBQ0YtNDU3Ny1CMjFELUU0NDAwQ0YzREM4NkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":61605,"nextInTopic":61613,"prevInTime":61610,"nextInTime":61612,"topicId":61604,"numMessagesInTopic":0,"msgSnippet":"... In your own home you can let your kids run around all you want to. In my house, it s up to me how much they get to touch, climb, yell, run. In a store or","messageBody":"<div id=\"ygrps-yiv-1401795500\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n </span></blockquote>In your own home you can let your kids run around all you want to. In my<br/>\nhouse, it&#39;s up to me how much they get to touch, climb, yell, run.<br/>\nIn a store or doctor&#39;s office, it&#39;s up to the manager or receptionist<br/>\nwhether you can touch, climb, yell, run.  And the answer will probably<br/>\nbe &quot;not so much.&quot;<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>Thanks for this.<br/>\nMany times I have expressed to my husband that I feel like I&#39;m only<br/>\nunschooling at home.<br/>\nMy 5 yo boy is energetic, curious, resourceful, creative, and at home he<br/>\nhas fun playing out lots of his ideas.  Away from home he is all that<br/>\nand more. ;)  Very shy of people and easily overwhelmed/distracted and<br/>\nmuch less ability to attend to my directions (which there are alot more<br/>\nof!).<br/>\nHe usually chooses not to go out much. :/  But I think that&#39;s because<br/>\nhome is SO much better (more fun, easier, more free) than anywhere else.<br/>\nI do wish I knew better how to keep my son engaged and &quot;well-behaved&quot;<br/>\naway from home, because I&#39;d like to take him places more often, if he<br/>\nwould enjoy it.<br/>\nRight now when we do get in the car to go someplace, I talk about me<br/>\nbeing the &quot;leader&quot; and how I need him to follow my lead because I know<br/>\nwhat we&#39;re supposed to be doing and he might not, so if he follows my<br/>\nlead I can help him behave appropriately.  He is smart and gets this,<br/>\nbut is young and can&#39;t do it for long.  Those spaces under the clothing<br/>\nracks at stores just seem to scream out his name!  And he also sometimes<br/>\nseems to feel compelled to try out the opposite of what I say the rules<br/>\nare, to see if I&#39;m right/to see what would happen or just if it looks<br/>\nreally fun, or especially if he sees another child doing it, etc.<br/>\nIt does help to keep things very short and to involve him in something<br/>\nactively, like finding certain items at the grocery store, etc.   And<br/>\nlately I&#39;ve started researching hand-held video game thingys to probably<br/>\nbuy him sometime soon, to take with us when I want to go someplace that<br/>\nhe may not be super interested in.<br/>\nmaryann<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] revolving door","postDate":"1308241614","msgId":61605,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYyRDZGMUYzLUVBQ0YtNDU3Ny1CMjFELUU0NDAwQ0YzREM4NkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDU0ODI2NC43NTU4Mi5xbUB3ZWIxMjA1MDkubWFpbC5uZTEueWFob28uY29tPg==","referencesHeader":"PDU0ODI2NC43NTU4Mi5xbUB3ZWIxMjA1MDkubWFpbC5uZTEueWFob28uY29tPg=="},"prevInTopic":61604,"nextInTopic":61611,"prevInTime":61604,"nextInTime":61606,"topicId":61604,"numMessagesInTopic":0,"msgSnippet":"-=-I think people are shocked and think of us as bad mothers when we allow are children to find creative ways have fun. Anything out of the norm, of a child ","messageBody":"<div id=\"ygrps-yiv-412737811\">-=-I think people are shocked and think of us as bad mothers when we allow are <br/>\nchildren to find creative ways have fun. Anything out of the norm, of a child <br/>\nsitting still next to people seem to make people upset and think you are a bad <br/>\nparent-=-<br/>\n<br/>\nIf your children are bothering me, I won&#39;t be happy about it.  Even though I&#39;m an unschooling parent.   My space is my space.  My property is my property.<br/>\n<br/>\n-=-I think conventional schooling is to blame <br/>\nthink about it everyone was forced to sit there quietly 8hrs a day being bored <br/>\ndoing things they didn&#39;t want to do and I know alot of people who think kids <br/>\nshould have to just sit there quietly all day and not &quot;run around&quot;. -=-<br/>\n<br/>\nSchool doesn&#39;t last 8 hours.<br/>\nNothing needs to be &quot;to blame.&quot;<br/>\n<br/>\nIn your own home you can let your kids run around all you want to.<br/>\nIn my house, it&#39;s up to me how much they get to touch, climb, yell, run.<br/>\nIn a store or doctor&#39;s office, it&#39;s up to the manager or receptionist whether you can touch, climb, yell, run.  And the answer will probably be &quot;not so much.&quot;<br/>\n<br/>\n-=-It&#39;s sad that&#39;s normal, why shouldn&#39;t kids be kids? -=-<br/>\n<br/>\nDon&#39;t be reactionary.<br/>\nDon&#39;t aim for the most different from what you dislike.<br/>\nAim for the sensible, considerate middle.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/balance\">http://sandradodd.com/balance</a><br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":474627286,"authorName":"cindy jusino","from":"cindy jusino &lt;cindyjusino@...&gt;","profile":"cindyjusino@ymail.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"revolving door","postDate":"1308234571","msgId":61604,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU0ODI2NC43NTU4Mi5xbUB3ZWIxMjA1MDkubWFpbC5uZTEueWFob28uY29tPg=="},"prevInTopic":0,"nextInTopic":61605,"prevInTime":61603,"nextInTime":61605,"topicId":61604,"numMessagesInTopic":0,"msgSnippet":"I think people are shocked and think of us as bad mothers when we allow are children to find creative ways have fun.  Anything out of the norm, of a child ","messageBody":"<div id=\"ygrps-yiv-890662793\">I think people are shocked and think of us as bad mothers when we allow are <br/>\nchildren to find creative ways have fun.  Anything out of the norm, of a child <br/>\nsitting still next to people seem to make people upset and think you are a bad <br/>\nparent.  Thats how I feel anyway.  I think conventional schooling is to blame <br/>\nthink about it everyone was forced to sit there quietly 8hrs a day being bored <br/>\ndoing things they didn&#39;t want to do and I know alot of people who think kids <br/>\nshould have to just sit there quietly all day and not &quot;run around&quot;.  It&#39;s sad <br/>\nthat&#39;s normal, why shouldn&#39;t kids be kids? <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":61585,"nextTopicId":61607}}