{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Drug questions","postDate":"1034860005","msgId":46683,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYwLjI3OTk1ZmM3LjJhZTAwZmU1QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":46682,"nextInTime":46684,"topicId":46683,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/16/2002 6:07:19 AM Eastern Daylight Time, ... No longer hypothetical here! That s exactly what we ve done! I HAVE a teenager---14; he ll","messageBody":"<div id=\"ygrps-yiv-2142481567\">In a message dated 10/16/2002 6:07:19 AM Eastern Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a> writes:<br/>\n<blockquote><span title=\"ireply\"> &gt; A hypothetical question comes to mind. What would you all do if your young <br/>\n&gt; teenager experiences with serious drugs?? I can not imagine giving them all <br/>\n&gt; the information and sit back and wait for them to make the right choice?? <br/>\n&gt; Off course it would be near impossible to coerce them into giving it up, <br/>\n&gt; but I do think I will try.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>No longer hypothetical here!<br/>\n<br/>\nThat&#39;s exactly what we&#39;ve done! I HAVE a teenager---14; he&#39;ll be 15 in <br/>\nJanuary (Time flies!). We&#39;ve dicussed drugs for years. I&#39;ve never even puffed <br/>\na joint (I&#39;m 42), so my personal experience is quite limited. But we&#39;ve <br/>\ntalked and talked and talked. <br/>\n<br/>\nAll his friends are doing all kinds of drugs. He told me the other day that <br/>\nhe had just tried marijuana with some buddies. I had told him that I&#39;d rather <br/>\nthat he get in touch with a friend of mine who gets organic dope so that we <br/>\nKNOW what&#39;s in it, but anyway...he thought they were all really goofy and it <br/>\nwasn&#39;t so much the getting high and smoking, but the whole act of DEFYING <br/>\ntheir parents. He may do it again and again---I can&#39;t say, but he had wanted <br/>\nto see what all the hullabaloo was about. He&#39;s not impressed with some of his <br/>\nbuddies who have become pot-heads---they do NOTHING in their spare time but <br/>\nsmoke. He has other interets (these boys are all in school).<br/>\n<br/>\nTheir parents said only, &quot;Don&#39;t do it!&quot;. I think the more extreme the limits, <br/>\nthe more likely that the child will MEAN to defy. Cameron told me a day or <br/>\ntwo afterwards. I didn&#39;t shame him or demand that he NEVER do it again. I DID <br/>\nreiterate that you can&#39;t be sure what all&#39;s in the joint (laced with PCP?), <br/>\nand that I&#39;d rather he question where it came from, etc. As for its leading <br/>\nto other drugs, why? He has SO much freedom--and he always has. He&#39;s <br/>\ncomfortable talking to me about it all. <br/>\n<br/>\nYou can&#39;t force a teen to do anything---other than really look forward to <br/>\ngetting out of your home and into his own---just to get away from YOU! That <br/>\nworks every day! I hear teens ALL the time saying how they can&#39;t WAIT to get <br/>\naway.<br/>\n<br/>\nYou CAN be open and honest and giving and forgiving. You CAN have a teen <br/>\nconfide in you and trust you and believe in you.<br/>\n<br/>\nDo I want Cameron to &quot;get into&quot; drugs? Not my choice. He will or won&#39;t. I <br/>\njust want him to be informed. And to come to me if there&#39;s a problem. I won&#39;t <br/>\nshame him if he becomes a coke-head. If he wants to change, I&#39;m there to <br/>\nhelp. Besides, it&#39;s an INTERNAL thing. I can&#39;t coerce him to stop if he&#39;s not <br/>\nwilling. It MUST be HIS decision. As are all things.<br/>\n<br/>\nHe&#39;s fifteen (almost). He&#39;ll be twenty in a VERY short time. If I&#39;ve done my <br/>\njob right, he&#39;ll be a healthy, well-adjusted adult who CAN make wise choices <br/>\nbecause he&#39;s always been allowed to, not because he&#39;s been forced to. (Same <br/>\nwith food, by the way---some of those children who have been denied <br/>\nMcDonald&#39;s all their lives may turn into regular junk-food junkies! Think <br/>\nabout it! &lt;G&gt;)<br/>\n<br/>\nKelly<br/>\n(Here and Doing it)<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":46678,"nextTopicId":46529}}