{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Part 4:  Saga of Schooled Teen Niece   (Long)","postDate":"1121875243","msgId":107386,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDNzVCNUI1MTUwRjVGRi1DRkMtNTA4QkBNQkxLLU0yNS5zeXNvcHMuYW9sLmNvbT4=","inReplyToHeader":"PGRianEzYityOGJqQGVHcm91cHMuY29tPg==","referencesHeader":"PGRianEzYityOGJqQGVHcm91cHMuY29tPg=="},"prevInTopic":107363,"nextInTopic":0,"prevInTime":107385,"nextInTime":107387,"topicId":107363,"numMessagesInTopic":0,"msgSnippet":"... From: m59z85  I felt it important to post this as the whole episode made me even more committed to unschooling. It underscored for me","messageBody":"<div id=\"ygrps-yiv-863409076\">-----Original Message-----<br/>\nFrom: m59z85 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:maggioncalda@...\">maggioncalda@...</a>&gt;<br/>\n<br/>\n I felt it important to post this as the whole episode made me even<br/>\nmore committed to unschooling. It underscored for me that it is<br/>\nimportant for my children to have choice and be respected and have a<br/>\nvoice in our family. I hope to have a close relationship with my<br/>\nchildren when they are 14.<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nWhen I used to have doubts about unschooling or our parenting, a trip <br/>\nto my in-laws was all I needed for reassurance! &lt;g&gt;<br/>\n<br/>\nNow, my children&#39;s experiences with their friends are a great <br/>\nreassurance.<br/>\n<br/>\nDuncan just told me last week, cuddled up in my arms &lt;g&gt;, that he felt <br/>\nsorry for his friends. They all had bad lives. Parents that yelled at <br/>\nthem. Spanked them. Shamed them. Just didn&#39;t seem to care. Or sent them <br/>\nto school! He wished they all could liive with us! &lt;g&gt;<br/>\n<br/>\nCameron&#39;s friends have all asked for info on unschooling for their <br/>\nchildren and future children. I guess they think he turned out OK! &lt;g&gt;<br/>\n<br/>\n~Kelly<br/>\n<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\nOctober 6-9, 2005<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://liveandlearnconference.org\">http://liveandlearnconference.org</a></div>","specialLinks":[]},{"userId":171053152,"authorName":"m59z85","from":"&quot;m59z85&quot; &lt;maggioncalda@...&gt;","profile":"m59z85","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Part 4:  Saga of Schooled Teen Niece   (Long)","postDate":"1121807275","msgId":107363,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRianEzYityOGJqQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":107386,"prevInTime":107362,"nextInTime":107364,"topicId":107363,"numMessagesInTopic":0,"msgSnippet":"This is the end . . . really!  Thank you to all who have read my messages and for the wonderful comments and empathy for Noelle. As painful as this whole","messageBody":"<div id=\"ygrps-yiv-2067381909\">This is the end . . . really!  Thank you to all who have read my <br/>\nmessages and for the wonderful comments and empathy for Noelle.  <br/>\n<br/>\nAs painful as this whole episode was, I had a feeling that something <br/>\nbigger was going on.  One of my local homeschool buddies made the <br/>\ncomment that school and work can break the bond between parent and <br/>\nchild and that seems to have happened in this case.  She also said <br/>\nthat growth sometimes comes through tension and that this situation <br/>\nwas creating a lot of tension in Noelle.  And in me!<br/>\n<br/>\nWhile Noelle was still watching &quot;Star Wars&quot; with the kids at church, <br/>\nher mother (my sister-in-law) called.  I started our conversation by <br/>\nrepeating what I had told my BIL:<br/>\n<br/>\nMe:  Noelle&#39;s really very unhappy here and wants to come home.<br/>\n<br/>\nSIL:  I don&#39;t get it.  She wanted to go and she made the <br/>\nreservations and about 2 days before she threw this huge fit and <br/>\nsaid we were making her go and that she didn&#39;t want to do it.<br/>\n<br/>\nMe:  And you still decided to send her?<br/>\n<br/>\nSIL:  Well, it just seemed so weird and out of nowhere.  We thought <br/>\nit was PMS or low blood sugar.  We told her she needed to go because <br/>\nshe had a commitment to you.<br/>\n<br/>\nMe:  I wouldn&#39;t have cared.  I would rather have known.  We just <br/>\nwant her to be happy.<br/>\n<br/>\nSIL:  I wanted her to go and have some experiences.  She just sits <br/>\nat home and does nothing while I&#39;m at work all day.  I know those <br/>\nare my values I&#39;m putting on her.<br/>\n<br/>\nMe:  It may seem like nothing to you but it is something to her.  <br/>\nShe IMs her friends and talks to them on the phone and they make <br/>\nplans together.  Plus, maybe she is laying low and gathering her <br/>\nenergy to start at that new school in the fall.  <br/>\n<br/>\n(Note:  Noelle is going in to high school. She is not going to the <br/>\npublic high school with all of her friends but to a private college-<br/>\nprep school where she doesn&#39;t know anyone.  Her parents are making <br/>\nher take marching band and band camp which she told me she doesn&#39;t <br/>\nwant to do.)<br/>\n<br/>\nSIL:  We thought that might be it--that maybe she is stressed out <br/>\nabout the move to the new school.   <br/>\n<br/>\nMe:  Well, she said she wasn&#39;t sure what she wants to do about <br/>\ncoming home early so you need to ask her to be sure, but I think she <br/>\nwants to come home and that would work best for all of us.<br/>\n<br/>\nSIL:  Has she been giving you any lip?<br/>\n<br/>\nMe:  We&#39;ve had words, but that is between us.  I don&#39;t want her to <br/>\nget in trouble for that.  She wants to come home but is afraid to <br/>\nbecause she says she will be in trouble.<br/>\n<br/>\nSIL:  Well she says what she thinks. What time is she coming home <br/>\ntonight?<br/>\n<br/>\nMe: 9 o&#39;clock<br/>\n<br/>\nSIL:  I can&#39;t talk to her tonight because I go to bed early for <br/>\nwork.  Tell her I will talk to her after work tomorrow night.<br/>\n<br/>\nMe:  OK (although I planned to have Noelle call no matter what time <br/>\nit was!)(I was also flabbergasted that, knowing her daughter was in <br/>\npretty severe emotional distress, SIL wasn&#39;t willing to stay up past <br/>\nher bedtime to do whatever she needed to do to help her daughter.)<br/>\n<br/>\nNoelle called her parents that night and the short version of the <br/>\nstory is that my husband ended up changing her reservation and <br/>\ncharging the fee on our credit card because her dad was balking at <br/>\nthe fee.  Her parents have since sent us a check.<br/>\n<br/>\nThis all happened on a Wedsnesday and Noelle left late Saturday <br/>\nafternoon.  The next 3 days Noelle was pretty peaceful and happy <br/>\nbecause she was going home.<br/>\n<br/>\nMy husband and I told Noelle that we weren&#39;t sending her home <br/>\nbecause we were angry with her but that we wanted her to be happy.  <br/>\nShe said she knew and understood but on Friday I overheard her say <br/>\nto Olivia &quot;your Mom&#39;s mad at me.&quot;  I told her that I wasn&#39;t mad at <br/>\nher but at her parents.  That they should have listened to her.  <br/>\nThat none of this was her fault.  At the airport I hugged her and <br/>\njust said &quot;have a safe trip&quot;--that&#39;s all I could think of at the <br/>\ntime. Noelle said, &quot;Sorry for the inconvenience.&quot;<br/>\n<br/>\nEnd of Story, really!  (I&#39;m going to try to do another post with a <br/>\ncollection of Noelle&#39;s comments about homeschooling.  I hope I can <br/>\nremember them all.)  Thank you to all who have read this far. <br/>\n<br/>\n I felt it important to post this as the whole episode made me even <br/>\nmore committed to unschooling. It underscored for me that it is <br/>\nimportant for my children to have choice and be respected and have a <br/>\nvoice in our family. I hope to have a close relationship with my <br/>\nchildren when they are 14.</div>","specialLinks":[]}],"prevTopicId":107381,"nextTopicId":107371}}