{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Lynda","from":"&quot;Lynda&quot; &lt;lurine@...&gt;","replyTo":"LIST","senderId":"rygejSetq2hJgZXwqSI64uJ32o8scTsjyA040vzGRZa1IGTHUJNc18245XBSDCWZh9F1m1Zz9bV6cs8S4bZTOy2x-g","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Fw:  NYTimes.com Article: Bush to Open Country to Mexican Truckers","postDate":"981589698","msgId":16101,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxMDIwMWMwOTE2MSQwNjlhM2FjMCQxNjVkZDFkMUBsZGlvbm5vPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":16100,"nextInTime":16102,"topicId":16101,"numMessagesInTopic":0,"msgSnippet":"About a year ago on a couple of the lists I m on, we talked about NAFTA and the danger of allowing just any trucks on U.S. highways.  Anyone who has traveled","messageBody":"<div id=\"ygrps-yiv-1418849066\">About a year ago on a couple of the lists I&#39;m on, we talked about NAFTA and<br/>\nthe danger of allowing just any trucks on U.S. highways.  Anyone who has<br/>\ntraveled extensively in Mexico and/or owns a trucking outfit knows that the<br/>\nconditions of commericial vehicles are pathetic AND extremely dangerous with<br/>\nthe vast majority not having any insurance and a good percentage of the<br/>\ndrivers not being licensed.<br/>\n<br/>\nWell, the roads are dangerous enough and now Texas, Arizona, New Mexico and<br/>\nCalifornia in particular can look forward to even more problems on their<br/>\nroads!<br/>\n<br/>\nAll the bright boys that thought up NAFTA ought to be shot!<br/>\n<br/>\nLynda<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message -----<br/>\n<br/>\n&gt; Bush to Open Country to Mexican Truckers<br/>\n&gt;<br/>\n&gt; February 7, 2001<br/>\n&gt;<br/>\n&gt; By STEVEN GREENHOUSE<br/>\n&gt;<br/>\n&gt; The Bush administration indicated yesterday that it would reverse a<br/>\n&gt; Clinton administration policy and begin allowing Mexican trucks to<br/>\n&gt; haul goods throughout the United States, notwithstanding concerns<br/>\n&gt; about the trucks&#39; safety problems.<br/>\n&gt;<br/>\n&gt;  Administration officials disclosed the plan on the same day that a<br/>\n&gt; dispute-resolution panel ruled that the United States was violating<br/>\n&gt; the North American Free Trade Agreement by not already allowing<br/>\n&gt; Mexican trucks to enter.<br/>\n&gt;<br/>\n&gt;  &quot;The president has said that Nafta trucking provisions should be<br/>\n&gt; implemented, and we intend to do that,&quot; said Clair Buchan, a White<br/>\n&gt; House spokeswoman.<br/>\n&gt;<br/>\n&gt;  The proposed change, long sought by Mexico, comes just 10 days<br/>\n&gt; before Mr. Bush travels to Mexico.<br/>\n&gt;<br/>\n&gt;  The president has not decided on the exact timing of the move,<br/>\n&gt; administration officials said, noting that it remained unclear<br/>\n&gt; whether he would agree to a limited opening of the border or a<br/>\n&gt; broad one.<br/>\n&gt;<br/>\n&gt;  The plan is expected to generate protests. Union officials voice<br/>\n&gt; fears that Mexican truckers, who often earn one-fourth as much as<br/>\n&gt; unionized American truckers, will take American jobs. And consumer<br/>\n&gt; groups, noting that 41 percent of Mexican trucks failed American<br/>\n&gt; inspections at the border, argue that the trucks will endanger<br/>\n&gt; Americans.<br/>\n&gt;<br/>\n&gt;  Bret Caldwell, a spokesman for the Teamsters union, said, &quot;We will<br/>\n&gt; continue to fight the opening of the border until the Mexican<br/>\n&gt; government can guarantee their standards are higher and the U.S.<br/>\n&gt; can guarantee that we have the inspection facilities to keep unsafe<br/>\n&gt; trucks out.&quot;<br/>\n&gt;<br/>\n&gt;  The administration&#39;s move surprised some union leaders, because<br/>\n&gt; Mr. Bush has courted the Teamsters more than any other union.<br/>\n&gt;<br/>\n&gt;  Under Nafta, the United States was supposed to give broad access<br/>\n&gt; to Mexican trucks in 1995, but President Bill Clinton, under heavy<br/>\n&gt; pressure from his union allies, kept the provision from taking<br/>\n&gt; effect, saying Mexico had to do more to address safety problems<br/>\n&gt; first.<br/>\n&gt;<br/>\n&gt;  That year, the Mexican government, invoking Nafta&#39;s provisions,<br/>\n&gt; asked that a five-member panel be set up to determine whether<br/>\n&gt; Washington was violating the accord.<br/>\n&gt;<br/>\n&gt;  In its decision, the panel - two Americans, two Mexicans and a<br/>\n&gt; British chairman - unanimously ruled that the United States would<br/>\n&gt; be in violation if it did not begin considering applications from<br/>\n&gt; Mexican trucking companies. More than 160 applications are pending.<br/>\n&gt;<br/>\n&gt;  &quot;The decision says the Department of Transportation must consider<br/>\n&gt; applications on individual merit and may not refuse authority<br/>\n&gt; across the board to all Mexican companies,&quot; said an American trade<br/>\n&gt; official who had read the decision, which is to be released today.<br/>\n&gt;<br/>\n&gt;  The official said the panel made clear that the United States was<br/>\n&gt; entitled under Nafta to set its own safety standards and to ensure<br/>\n&gt; that Mexican trucking companies meet them.<br/>\n&gt;<br/>\n&gt;  &quot;As we move forward, the United States will not compromise highway<br/>\n&gt; safety in any way,&quot; the official said.<br/>\n&gt;<br/>\n&gt;  Currently, Mexican truckers can drive up to 25 miles north of the<br/>\n&gt; border. Then they normally transfer their loads to American trucks.<br/>\n&gt; Each year, about five million commercial trucks cross the border,<br/>\n&gt; hauling about three-fourths of the $250 billion in United<br/>\n&gt; States-Mexico trade.<br/>\n&gt;<br/>\n&gt;  Mexican officials say opening the border will save American<br/>\n&gt; consumers millions of dollars by lowering transportation costs.<br/>\n&gt;<br/>\n&gt;  &quot;The cost has been lost business opportunities for Mexican<br/>\n&gt; trucking companies,&quot; said Luís de la Calle, under secretary in<br/>\n&gt; Mexico&#39;s Economy Ministry. &quot;The system we have today is archaic. To<br/>\n&gt; change tractors at the border creates lines, which means more lost<br/>\n&gt; time and greater costs of doing business.&quot;<br/>\n&gt;<br/>\n&gt;  A 1996 letter that Mr. Bush, then Texas&#39; governor, signed with the<br/>\n&gt; governors of Arizona, California and New Mexico, said, &quot;This<br/>\n&gt; transborder trucking delay robs the entire U.S.- Mexico border<br/>\n&gt; region of the full economic benefits that Nafta promises.&quot;<br/>\n&gt;<br/>\n&gt;  Under Nafta rules, the United States could continue to keep the<br/>\n&gt; trucks out, but then it would have to compensate Mexico by, for<br/>\n&gt; example, agreeing to let it impose punitive tariffs on some<br/>\n&gt; American goods.<br/>\n&gt;<br/>\n&gt;  Critics warned that opening the border could backfire politically<br/>\n&gt; for Mr. Bush if Mexican truckers caused accidents that killed<br/>\n&gt; Americans.<br/>\n&gt;<br/>\n&gt;  &quot;It is imperative that we continue to limit access for these<br/>\n&gt; dangerous trucks even if it means paying trade sanctions,&quot; said<br/>\n&gt; Joan Claybrook, president of Public Citizen, a consumer safety<br/>\n&gt; group. &quot;It is impossible to inspect every truck, and we cannot<br/>\n&gt; knowingly put drivers at risk by inviting dangerous rigs onto U.S.<br/>\n&gt; highways.&quot;<br/>\n<br/>\n&gt;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.nytimes.com/2001/02/07/politics/07BORD.html?ex=982560571&ei=1&en=\">http://www.nytimes.com/2001/02/07/politics/07BORD.html?ex=982560571&ei=1&en=</a><br/>\n5f882d4d9f97faa2 </span></blockquote></div>","specialLinks":[]}],"prevTopicId":16062,"nextTopicId":16103}}