{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":0,"authorName":"cunian@aol.com","from":"cunian@...","replyTo":"LIST","senderId":"jH9MYHPNiaXEib6lb3ZsLhBYAUZd7oZ75dAZEa1P-4BBZhIkaimz0Astvm5tVLi4UIMNfV8","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] SCA","postDate":"952131571","msgId":6921,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkwLjE2YmQ3MWIuMjVmMWI5ZjNAYW9sLmNvbT4="},"prevInTopic":6919,"nextInTopic":0,"prevInTime":6920,"nextInTime":6922,"topicId":6911,"numMessagesInTopic":0,"msgSnippet":"Linda, The web page with all the local groups and contacts for Trimaris, (Florida), is http://www.trimaris.org/contacts.html A shire might have been suspended","messageBody":"<div id=\"ygrps-yiv-755019616\">Linda, <br/>\n    The web page with all the local groups and contacts for Trimaris, <br/>\n(Florida), is <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.trimaris.org/contacts.html\">http://www.trimaris.org/contacts.html</a><br/>\n    A shire might have been suspended for something simple and easy to fix <br/>\nlike an on-going lack of paperwork, or it might be something that would <br/>\nrequire you to look at the next local group over.  <br/>\n    The other thing you might do is look at the kingdom calendar<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.trimaris.org/calendar.html\">http://www.trimaris.org/calendar.html</a><br/>\nand find an event happening reasonably close to you.  Contact the contact <br/>\nperson for the sponsoring group and explain that you&#39;re new and would like to <br/>\nattend and see if they can loan appropriate clothes to your family for the <br/>\nday.  <br/>\n<br/>\nKaren, (with Helen, 7, Agent of Chaos, and Gordon, 4, Agent of Destruction)</div>","specialLinks":[]},{"userId":0,"authorName":"Mamalin21@aol.com","from":"Mamalin21@...","replyTo":"LIST","senderId":"qoKVn1x4F1gXbVhjSMPRBUONwdVhCE0djO_tLaerHY80Wk_aDMwTJvhzljuWkwn4wtXr8odowIM","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] SCA","postDate":"952126986","msgId":6919,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIyLjJiNTg2YzUuMjVmMWE4MGFAYW9sLmNvbT4="},"prevInTopic":6915,"nextInTopic":6921,"prevInTime":6918,"nextInTime":6920,"topicId":6911,"numMessagesInTopic":0,"msgSnippet":"I love that you guys are talking about this right now! We ve been wanting to get involved with our local group, but when I checked it out online the other day,","messageBody":"<div id=\"ygrps-yiv-1380150488\">I love that you guys are talking about this right now! We&#39;ve been wanting to <br/>\nget involved with our local group, but when I checked it out online the other <br/>\nday, it said they were suspended, or something like that:(  I emailed someone <br/>\nrequesting information, but haven&#39;t heard anything yet.  <br/>\n<br/>\nWe&#39;re going to the Medieval Faire in Sarasota this weekend (our favorite <br/>\nthing to do!), so I&#39;m hoping I may be able to get some info there.  Anybody <br/>\nfamiliar with SW FL?<br/>\n<br/>\nAnyway, thanks for this thread - I love it!<br/>\n<br/>\nLinda in FL :)</div>","specialLinks":[]},{"userId":0,"authorName":"Shannon CC","from":"Shannon CC &lt;shannoncc@...&gt;","replyTo":"LIST","senderId":"fI98b2NqJ28vR3sA-ICSP5K-F7GrioISE8CD7Maxsn_GaMd187Ik5OsqzjGr5PKEU7fObb9EL3i_J6XdFWdExOFmGh4zqQ","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] SCA","postDate":"952112999","msgId":6915,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM4QzAxNzY3LjM1REQzMzU3QGhvbWUuY29tPg==","referencesHeader":"PGM0LjFhZmRhMTkuMjVmMTVlOTJAYW9sLmNvbT4="},"prevInTopic":6913,"nextInTopic":6919,"prevInTime":6914,"nextInTime":6916,"topicId":6911,"numMessagesInTopic":0,"msgSnippet":"... This depends on your group. As I said, our Barony just had a baby boom so it s the new moms and dads who are scrambling to come up with stuff to do. If you","messageBody":"<div id=\"ygrps-yiv-1449887159\"><a rel=\"nofollow\" target=\"_blank\" href=\"mailto:cunian@...\">cunian@...</a> wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; The SCA is just beginning to make provisions<br/>\n&gt; for the interests of younger children<br/>\n<br/>\n </span></blockquote>This depends on your group. As I said, our Barony just had a baby boom<br/>\nso it&#39;s the new moms and dads who are scrambling to come up with stuff<br/>\nto do. If you are in an area with not many children, you might need to<br/>\nbe the one to come up with and implement ideas (not addressing this to<br/>\nyou specifically Karen, but to anyone interested). Here is a post I got<br/>\nfrom the SCA moms list which was forwarded from the SCA cooks list. It<br/>\nsounds really fun! <br/>\n<br/>\nShannon, Mom to Bridget (OCt.8.98)<br/>\n<br/>\n<br/>\n<br/>\nSo, I saw a need to fill and decided to run with it.<br/>\nI really wanted to work with this problem for the past<br/>\ncouple of years, but never really had the nerve to do it.<br/>\nI now have that nerve.<br/>\n<br/>\nThe problem:<br/>\n<br/>\n1) unknown foods at events<br/>\n2) children witn nothing to do<br/>\n3) need for unskilled labor in kitchen (paring , mixing,<br/>\nchopping, washing, etc.)<br/>\n4) need for more  training for more active roles in kitchen<br/>\n<br/>\nThe positive influences:<br/>\n<br/>\n1) A bored child is more willing to try anything to not be bored<br/>\n2) A child is more often willing to eat something he has helped create.<br/>\n3) What we see as unskilled labor is fun to children (Messy is good!)<br/>\n4) Experience in a friendly atmosphere creates a liking for kitchen<br/>\nduties.<br/>\n5) I work well with children ( teaching and nursing background).<br/>\n6) My mom taught me how a kitchen  can be made fun .<br/>\n<br/>\nThe negative influences:<br/>\n1) Period food is often strange to  a modern child<br/>\n2) Previous help in the kitchen may have been unnoticed or unrewarded.<br/>\n3) The decidedly adult atmosphere scares the timid child.<br/>\n<br/>\nMy response:<br/>\n<br/>\nSmall classes (of ten children) given out in areas requesting a<br/>\nUniversity style format.<br/>\n<br/>\nExample: At our most recent East Kingdom University, I provided a<br/>\nworkable (albeit, not typical) kitchen in which a maximum of ten<br/>\nchildren <br/>\ncould create, and eat a small feast based on period sources. However,<br/>\nthe <br/>\ncooking itself was thoroughly modern due to the constraints of the<br/>\nworking <br/>\narea in a conventional classroom). I have a portable oven <br/>\n(convection/broiler/microwave acquired in the 70&#39;s), an electric<br/>\nsteamer, <br/>\nand a good quality crockpot.<br/>\n<br/>\nThe menu:  Hirchones     from Harleian  MS 279<br/>\n           La maniere de faire compost  from The Menagier du Paris<br/>\n           Applemoyl from Harleian  MS 279<br/>\n           Hot spiced cider<br/>\n<br/>\nThe result: A class of six, one child under five ( I had limited the<br/>\nages from 6 to 12) , the father stayed to help the five year old. There<br/>\nwere <br/>\nno other adults present.<br/>\n<br/>\nThe chopping and paring took a great deal of time. The results were ill <br/>\nformed and messy. They were incorporated into the final recipes with<br/>\ngreat <br/>\nadmiration of a job well done and smiles from all.<br/>\n<br/>\nThe spiced cider was a hit ! I encouraged  mortar and pestle use for the <br/>\nspices and they also grated a nutmeg into the brew.  All pronounced it <br/>\nexcellent !<br/>\n<br/>\nThe hedgehogs, ended up looking like space aliens (one done like Pikach<br/>\nby <br/>\nan older child who could not just make a hedgehog like the others) , but <br/>\nthree were fully eaten, one had the almonds eaten off, and two went home<br/>\nto <br/>\nshow Mom how cool this was!<br/>\n<br/>\nThe compost( mostly carrots) were considered to be  good. They really<br/>\nliked the honey sauce ( no surprise here) and were promptly eaten.<br/>\n<br/>\nThe applemoyl  had the best result of all , it was inhaled! The spices<br/>\n(now, <br/>\nall familiar: I explained what they were and we &quot;sampled&quot; them before<br/>\nadding <br/>\nthem) mixed with  the apples and the other ingredients were very good.<br/>\nWhile it did not look as visually pleasing to the adult eye (due to the <br/>\nchopping episodes) it tasted better than it looked.<br/>\n<br/>\nThe downside: While I had brought games to occupy them during the<br/>\ncooking phase, I had forgotten that some do not participate well in<br/>\ngroup <br/>\ngames. Next time I will bring solo activities too.<br/>\n<br/>\n<br/>\nFinal Note:  All in all, we had a good time. I learned a lot, and so did <br/>\nthey. I think the best thing that happened to me is that when I asked<br/>\nthem <br/>\nif they would do this again, EVERY ONE said yes!  My next class is this <br/>\nweekend and I already have two on the schedule for Pennsic!! And at<br/>\nPennsic, <br/>\nwe will be using  camp fire cooking  techniques and be discovering how<br/>\nto <br/>\nuse a turf oven !<br/>\n<br/>\nAndrea MacIntyre<br/>\nOstgardr, East Kingdom</div>","specialLinks":[]},{"userId":0,"authorName":"cunian@aol.com","from":"cunian@...","replyTo":"LIST","senderId":"QLlZQSqdqrzOAy7C-DjHvAthOt4ElnRRRVRKUZ9b3ARPIGwNNJGDD2LiFFP81EqePQw4-s8","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] SCA","postDate":"952108178","msgId":6913,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM0LjFhZmRhMTkuMjVmMTVlOTJAYW9sLmNvbT4="},"prevInTopic":6911,"nextInTopic":6915,"prevInTime":6912,"nextInTime":6914,"topicId":6911,"numMessagesInTopic":0,"msgSnippet":"We do SCA also.  My daughter is 7 and enjoys the SCA a lot, though she professes to despise history generally, probably to save herself from DH s monologues on","messageBody":"<div id=\"ygrps-yiv-1867759804\">We do SCA also.  My daughter is 7 and enjoys the SCA a lot, though she <br/>\nprofesses to despise history generally, probably to save herself from DH&#39;s <br/>\nmonologues on any given period or event.  She had a lot of fun at all the <br/>\nPennsic classes when we went when she was 5.  She did needlepoint, made a <br/>\nscroll, played chess and boffer swords and target archery.  She helps with <br/>\narmor at practices and occasionally embroiders a favor for someone.  My son <br/>\noccasionally puts on bits of armor, but mostly he just likes banging on <br/>\nthings with sticks right now.  The SCA is just beginning to make provisions <br/>\nfor the interests of younger children, and DD does get bored at some of the <br/>\nless interesting events, but she is always excited to go to another one the <br/>\nnext time.  I didn&#39;t know about the SCA moms list.  (Like I really need <br/>\nanother list!)<br/>\n<br/>\nKaren, (with Helen, 7, Agent of Chaos and Gordon, 4, Agent of Destruction)<br/>\nCunian Beornhelm, of Atlantia</div>","specialLinks":[]},{"userId":0,"authorName":"Shannon CC","from":"Shannon CC &lt;shannoncc@...&gt;","replyTo":"LIST","senderId":"t4cVCXw_2MPTAmKqnN1bLXo_rzLnVbnYlxUUI_QmITLe9Mc8zoP8y2ly0pwZiUbMP2OBR4xbuY2n_nZv1qgjcSdsiRVZWw","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] SCA","postDate":"952100338","msgId":6911,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM4QkZFNUYyLkMxNzhBQjJGQGhvbWUuY29tPg==","referencesHeader":"PDAxMzYwMWJmODUxOCQyMDE2MzlhMCQwNDQ1YmE4Y0B5b2dhLmNvbT4="},"prevInTopic":0,"nextInTopic":6913,"prevInTime":6910,"nextInTime":6912,"topicId":6911,"numMessagesInTopic":0,"msgSnippet":"Hello fellow Scadian and Shannon :-) I m Maire by the river in the SCA. Where are you? I m in the East Kingdom. The SCA does have a lot of learning","messageBody":"<div id=\"ygrps-yiv-1396106193\">Hello fellow Scadian and Shannon :-) I&#39;m Maire by the river in the SCA.<br/>\nWhere are you? I&#39;m in the East Kingdom. <br/>\n<br/>\nThe SCA does have a lot of learning possibilities. My dd is very young<br/>\nhowever, so we are just getting used to the SCA with a child. It was a<br/>\nwhole different ballgame when I was single and childless! I am on the<br/>\nSCA moms list (also at Onelist) and there was recently a post about a<br/>\nfeast cooking class for young children (6 and up) that sounded like so<br/>\nmuch fun! They had a group of children in the kitchen making and then<br/>\neating a mini medieval feast from period recipes. Using modern tools<br/>\ntho, but at Pennsic this year (big camping event in the East and Mid)<br/>\nthey will be repeating the class using period tools (no gas oven, no<br/>\nelectricity, etc.). <br/>\n<br/>\nIn our area we&#39;ve recently had a baby boom so people are coming up with<br/>\nall sorts of ideas of things to do with young children. To not only keep<br/>\nthem occupied, but to teach them about medieval history. And of course,<br/>\nthe SCA covers a bit more than strictly medieval, so you have options on<br/>\ntime periods. And cultures too. Most people are European, but we have a<br/>\ngood size Japanese group around here. <br/>\n<br/>\nShannon, Mom to Bridget (Oct.8.98)<br/>\n<br/>\n<br/>\nShannon Brophy wrote:<br/>\n<blockquote><span title=\"qreply\"> &gt; We have an unusual approach to history, which covers medieval history. We go<br/>\n&gt; to SCA (Society for Creative Anachronism). It is a group that re-encacts the<br/>\n&gt; middle ages wearing costumes. I do it because it is alot of fun, but it is<br/>\n&gt; also educational for all of us. There are experts in crafts (needlework,<br/>\n&gt; spinning, costume making,<br/>\n&gt; cooking, woodworking,all sorts of things...), herbalism, games, dancing, and<br/>\n&gt; of course, history of the times. People involved pick a persona which is a<br/>\n&gt; person they create in history, a name, and research all about the life and<br/>\n&gt; times of the persona they create, along with their skills and hobbies. I am<br/>\n&gt; figuring out what my Irish name in the 1500s will be, and think I am a wise<br/>\n&gt; woman healer type (as I used to be a midwife in regular life).Eithne, Aine,<br/>\n&gt; Liadan, and Niv are names that I like.<br/>\n&gt; <br/>\n&gt; At SCA events, they often have simulated safe fighting<br/>\n&gt; too (fencing, pretend swords, armor, etc.)<br/>\n&gt; There seem to be people willing to share expertise and that will be<br/>\n&gt; wonderful for Gabe when he is bigger and able to make use of these mentors.<br/>\n&gt; I am learning alot from them.<br/>\n&gt; Learn more at www.sca.org . I don&#39;t think I have explained it well.There are<br/>\n&gt; events where one can go, be loaned &quot;garb&quot; to wear, and watch and participate<br/>\n&gt; in the current middle ages.<br/>\n&gt; GWS mag has an article about living history and another on archeaology this<br/>\n&gt; issue. The teens had chosen to learn<br/>\n&gt; what they did.<br/>\n&gt; Seems like your boy could find some aspect of history and learn alot about<br/>\n&gt; it in this way.<br/>\n&gt; Shannon<br/>\n&gt; new to list<br/>\n&gt; mom to Gabe, almost 3 </span></blockquote></div>","specialLinks":[]}],"prevTopicId":6917,"nextTopicId":6899}}