{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":18,"messages":[{"userId":294520986,"authorName":"Joanna","from":"&quot;Joanna&quot; &lt;ridingmom@...&gt;","profile":"ridingmom1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Philosophical question regarding &quot;teaching/learning&quot; character traits","postDate":"1263358887","msgId":49545,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhpamszNytucDVwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDYyNjk3OC4zOTU3OC5xbUB3ZWIxMTA0MTIubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":49544,"nextInTopic":0,"prevInTime":49544,"nextInTime":49546,"topicId":49522,"numMessagesInTopic":0,"msgSnippet":"... YES!  I ve seen my son go through a big phase of taking on and repeating back what I ve said (parroting) which made me only more conscious of really","messageBody":"<div id=\"ygrps-yiv-1532760784\"><blockquote><span title=\"ireply\">&gt; ***I know that &quot;teaching&quot; character in this way is not unschooling -- and that we want to avoid telling our kids what is &quot;right&quot; and what is &quot;wrong.&quot; After all, these things are mostly subjective, yes?***<br/>\n&gt; <br/>\n&gt; Well yes and no... I&#39;m opinionated, there&#39;s no way around that.  My kids get to here my opinion all the time!  I tell them what I think is right and wrong, and they get to decide what they think is right and wrong and have an opinion on that too.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>YES!  I&#39;ve seen my son go through a big phase of taking on and repeating back what I&#39;ve said (parroting) which made me only more conscious of really believing and discussing the opinions I&#39;ve expressed, but now that he&#39;s a little older, he does firmly get that he can has his own opinions.  <br/>\n<br/>\nAnd he questions me all the time on mine, which is GREAT!  He is shockingly unafraid to bring up subjects when he&#39;s perceived an inconsistency, and then he grills me until he&#39;s satisfied that I have had integrity and consistency.  It&#39;s SO COOL!!  I think a lot about stuff, about my life, about living my life through consistent principles, and he has observed this and been part of that process for all of his 14 years.  I would say he&#39;s probably internalized a very important value that I hold of self reflection and integrity.  He may have been born with that propensity to start with, but it&#39;s definitely been nurtured living with me.<br/>\n<br/>\nAnd those character traits were passed on with no more than me living life and involving him in lots of conversation (well, both my kids).<br/>\n<br/>\nMy daughter is still in a parroting phase, but I trust that she&#39;ll move into forming her own opinions as well.  I suspect it&#39;s pretty normal.<br/>\n<br/>\nJoanna</div>","specialLinks":[]},{"userId":294520986,"authorName":"Joanna","from":"&quot;Joanna&quot; &lt;ridingmom@...&gt;","profile":"ridingmom1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Philosophical question regarding &quot;teaching/learning&quot; character traits","postDate":"1263357835","msgId":49544,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhpamoyYitzZ2RjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhpaWhjZStmbmFjQGVHcm91cHMuY29tPg=="},"prevInTopic":49543,"nextInTopic":49545,"prevInTime":49543,"nextInTime":49545,"topicId":49522,"numMessagesInTopic":0,"msgSnippet":"... It s not that I think this is untrue--but it s not enough. It s more than just trusting your kids.  It s actively engaging with them and most importantly","messageBody":"<div id=\"ygrps-yiv-592700619\"><blockquote><span title=\"ireply\">&gt;&quot; I think all of this stuff keeps boiling down to trust:  trust that your kids are good people, that they are learning, that they want to find ways to contribute, and that they will gravitate toward things that make them feel they are growing and becoming more competent.&quot;<br/>\n&gt; <br/>\n&gt;<br/>\n </span></blockquote>It&#39;s not that I think this is untrue--but it&#39;s not enough.  <br/>\n<br/>\nIt&#39;s more than just trusting your kids.  It&#39;s actively engaging with them and most importantly fostering, nurturing and maintaining a relationship where they trust YOU.  Then the two of you can navigate the rough terrain.  <br/>\n<br/>\nWhen that trust is broken by parents, children close themselves off, in emotional self defense, from the wealth of knowledge that a parent might have been able to share with them and are left alone to figure stuff out, and they often do it badly.<br/>\n<br/>\nI&#39;ve watched multiple times now, through my son&#39;s eyes (14), what has happened to his friends when this happens, and it&#39;s sad.  The friends begin relying on their friends to figure stuff out.  They will sometimes call him for his advice, to which he responds in two ways.  The first is that he recommends that they talk with their parents, and the second is that he comes to me, gets my advice, and then calls them back as though it&#39;s coming from him so that they don&#39;t feel &quot;betrayed.&quot;   I<br/>\n<br/>\nJoanna</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Philosophical question regarding &quot;teaching/learning&quot; character traits","postDate":"1263357607","msgId":49543,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk4NDgwQjVCLTA5MUYtNDQxNy1BNDMyLTA2MjhFMzdGN0U3MUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhpamk1bCtqaDRuQGVHcm91cHMuY29tPg==","referencesHeader":"PGhpamk1bCtqaDRuQGVHcm91cHMuY29tPg=="},"prevInTopic":49542,"nextInTopic":49544,"prevInTime":49542,"nextInTime":49544,"topicId":49522,"numMessagesInTopic":0,"msgSnippet":"-=-The unschooling approach is a lot more far reaching than I d originally thought. -=- There s basic vanilla unschooling, and then there s the more far- ","messageBody":"<div id=\"ygrps-yiv-2115763083\">-=-The unschooling approach is a lot more &quot;far reaching&quot; than I&#39;d  <br/>\noriginally thought. -=-<br/>\n<br/>\nThere&#39;s basic vanilla unschooling, and then there&#39;s the more far- <br/>\nreaching radical unchooling, where academics aren&#39;t separated from  <br/>\nother learning.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":349996549,"authorName":"momsclubmh","from":"&quot;momsclubmh&quot; &lt;momsclubmh@...&gt;","profile":"momsclubmh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Philosophical question regarding &quot;teaching/learning&quot; character traits","postDate":"1263356917","msgId":49542,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhpamk1bCtqaDRuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhpZ3VxZStsMXZ1QGVHcm91cHMuY29tPg=="},"prevInTopic":49538,"nextInTopic":49543,"prevInTime":49541,"nextInTime":49543,"topicId":49522,"numMessagesInTopic":0,"msgSnippet":"I don t have any thoughts or ideas for you, but I m also very eager to hear what others have to say. The unschooling approach is a lot more far reaching than","messageBody":"<div id=\"ygrps-yiv-782442895\">I don&#39;t have any thoughts or ideas for you, but I&#39;m also very eager to hear what others have to say. The unschooling approach is a lot more &quot;far reaching&quot; than I&#39;d originally thought. These are also some really new concepts for me and I&#39;ve enjoyed letting them wash over me...but I&#39;ve wondered a lot of the same things you&#39;re questioning here, too.<br/>\n<br/>\nPamela<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Hael&quot; &lt;dlmckee@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; One of the things I had been pondering before considering the unschooling approach (we have been homeschooling for years) was devoting part of our &quot;school day&quot; to exploring specific character traits -- maybe one a week -- with my step-son.<br/>\n&gt; <br/>\n&gt; I had been trying to come up with ways to instill such ideas in him -- through quotations and readings -- and I needed a place to start, to suggest some character traits I could get on board with.  (Again, this was before I began to understand the ideas behind unschooling, particularly the concept of not wishing &quot;to instill&quot; anything.)<br/>\n&gt; <br/>\n&gt; At that time, I found a website / organization, called Character First, that lists 49 character qualities, and gives a short description of each, and maybe a quote.<br/>\n&gt; <br/>\n&gt; For example, &quot;Tolerance vs. Prejudice,&quot; and the quote offered is &quot;We should look to the mind, and not to the outward appearance.&quot; Aesop <br/>\n&gt; <br/>\n&gt; I thought these might offer glimpses into ways of being, and then we could explore it a little, then just have it in the back of our mind for the week, and hopefully longer.  It wouldn&#39;t be a lecture or anything lengthy.<br/>\n&gt; <br/>\n&gt; It would be part vocabulary-building, and part quotation-reading, and part thinking about what kind of person we want to become.<br/>\n&gt; <br/>\n&gt; I know that &quot;teaching&quot; character in this way is not unschooling -- and that we want to avoid telling our kids what is &quot;right&quot; and what is &quot;wrong.&quot;  After all, these things are mostly subjective, yes?<br/>\n&gt; <br/>\n&gt; But as I&#39;ve been modifying my thoughts, and embracing unschooling, I have been trying to put some thought into this issue of instilling character or values.  Is there a way to do it, without coercion, without &quot;making&quot; them?<br/>\n&gt; <br/>\n&gt; It&#39;s not a school subject.  It&#39;s something that our family values and puts to use on a daily basis. Some of these things ARE &quot;lessons&quot; we teach as part of working together.  We run a family business together, and there are some &quot;rights and wrongs&quot; about running our business -- things that are taught, handed down from generation to generation, not because the child asked about it, but because we rely on their work and their contribution, and because we want them to learn how to treat customers, how to work in ways that help and don&#39;t harm, how to increase enjoyment in working with others.  And we do engage their thinking in passing along these ideas -- we don&#39;t just say, &quot;You have to be courteous to customers.&quot;  We have discussions about our way of life, and about what types of behavior tend to make our business more successful, our products more appealing, and what makes someone in our business a &quot;happy&quot; person, versus someone who seems to be unhappy. We also make it clear that they are not, obviously, required to be part of this business long-term...but it is an option, and these ideas are transferable.<br/>\n&gt; <br/>\n&gt; Of course, as I&#39;ve been reading so many wonderful posts about the importance of putting relationships before material things or control issues such as orderliness, etc., I keep wondering whether exposing my children to some of these values is not the same as &quot;forcing&quot; them to sit at a desk and learn a certain subject that is irrelevant to them at the time.<br/>\n&gt; <br/>\n&gt; I really do want my kids to know the words for these behaviors and ideas; I want them to spend time in thought about what it means to be &quot;flexible&quot; vs. &quot;resistant,&quot; among other traits.<br/>\n&gt; <br/>\n&gt; My stepson, who is a big reader, often asks questions such as, &quot;What does *conscience* mean?&quot;  Okay...is that an opening for a discussion of right and wrong, or some kind of exploration of self-control or virtue or guilt? Or should I just give him the dictionary definition and move on? <br/>\n&gt; <br/>\n&gt; Is the main idea here to try not to put our own personal opinions out there as the only right way?  I often couch our discussions in terms of, &quot;Some people think...&quot; or &quot;some people believe...&quot; and we often say things like, &quot;but no one really knows for sure,&quot; or &quot;there are a lot of other equally intelligent people who think...&quot; etc.<br/>\n&gt; <br/>\n&gt; I want to make it clear to my children that there are ideas out there that they can explore and reject, or explore and embrace, or embrace one day and reject the next.<br/>\n&gt; <br/>\n&gt; Should I be undertaking this &quot;character&quot; study out of my own interest?  Posting quotes because I happen to like them, and see what comes of it?  Should I &quot;strew&quot; books that happen to explore certain character traits or ideas and see what kind of discussions occur?<br/>\n&gt; <br/>\n&gt; Love to hear thoughts and ideas on this topic.<br/>\n&gt; <br/>\n&gt; Deb<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Philosophical question regarding &quot;teaching/learning&quot; character traits","postDate":"1263334384","msgId":49538,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc2MDYwNi45ODczNS5xbUB3ZWIxMTA0MDMubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PDRCNENBQTIyLjUwMTAzMDRAbWFjLmNvbT4=","referencesHeader":"PGhpZ3VxZStsMXZ1QGVHcm91cHMuY29tPiA8NEI0Q0FBMjIuNTAxMDMwNEBtYWMuY29tPg=="},"prevInTopic":49537,"nextInTopic":49542,"prevInTime":49537,"nextInTime":49539,"topicId":49522,"numMessagesInTopic":0,"msgSnippet":"***Go for honesty in your relationship - stop thinking of how to manipulate them into learning what you want them to learn and trust that they can t help","messageBody":"<div id=\"ygrps-yiv-451141099\">***Go for honesty in your relationship - stop thinking of how to manipulate <br/>\nthem into learning what you want them to learn and trust that they can&#39;t <br/>\nhelp learning and that your role is to provide the environment that is <br/>\ninteresting and fun and offers lots of fertile ground for them to learn <br/>\nwhatever they learn. ***<br/>\n<br/>\nNot sure why your whole post reminded me of the Sims, but there it is!  Our kids aren&#39;t Sims, we don&#39;t get to decide what kind of traits they have when we create them!  They will have some similar traits to each of the genetic parents, and some traits totally unique to them.<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Philosophical question regarding &quot;teaching/learning&quot; character traits","postDate":"1263334293","msgId":49537,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCNENGMzk1LjgwMjA1MDdAbWFjLmNvbT4=","inReplyToHeader":"PDYyNjk3OC4zOTU3OC5xbUB3ZWIxMTA0MTIubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PGhpZ3VxZStsMXZ1QGVHcm91cHMuY29tPiA8NjI2OTc4LjM5NTc4LnFtQHdlYjExMDQxMi5tYWlsLmdxMS55YWhvby5jb20+"},"prevInTopic":49536,"nextInTopic":49538,"prevInTime":49536,"nextInTime":49538,"topicId":49522,"numMessagesInTopic":0,"msgSnippet":"... At the Santa Fe Symposium, two of my three kids said that they d sometimes played games with me because they knew how much I like those games - not","messageBody":"<div id=\"ygrps-yiv-1475077832\">On 1/12/2010 1:26 PM, Jenny Cyphers wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Except they may not be interested in those things.  They could be interested in what mom is interested in and not internally be driven to explore those same things.  My oldest is usually interested in what I have to say and what I think, but it doesn&#39;t mean she&#39;s going to own those things too.<br/>\n&gt;    <br/>\n<br/>\n </span></blockquote>At the Santa Fe Symposium, two of my three kids said that they&#39;d <br/>\nsometimes played games with me because they knew how much &quot;I&quot; like those <br/>\ngames - not because they like them so much. They said they didn&#39;t mind, <br/>\nin fact they seemed a little gleeful about it, because they knew how <br/>\nmuch stuff I did because they liked to do it. This was Roxana and Roya - <br/>\nI&#39;m pretty sure Rosie plays with me because she likes to play, too, not <br/>\nonly to be nice to me. Rox and Roya both quickly qualified themselves <br/>\nand said they&#39;d had fun, too, it was okay - but it was clear that it <br/>\nwouldn&#39;t have been their first choice if it hadn&#39;t been something they <br/>\nknew I like a lot.<br/>\n<br/>\nI think they&#39;re talking about when they were young teens, by the way, so <br/>\nI&#39;d built up a lot of unschooling mom credit by that time.  Also, they <br/>\nabsolutely knew, from experience, that they could say, &quot;I don&#39;t want to <br/>\nplay&quot; and I wouldn&#39;t pressure them and they knew they could quit at any <br/>\ntime with no hard feelings. So - they were free to give me a sweet gift <br/>\nand they did it without ever holding it over my head or using it as a <br/>\nbargaining tool or anything like that.<br/>\n<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Philosophical question regarding &quot;teaching/learning&quot; character traits","postDate":"1263331609","msgId":49536,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYyNjk3OC4zOTU3OC5xbUB3ZWIxMTA0MTIubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PGhpZ3VxZStsMXZ1QGVHcm91cHMuY29tPg==","referencesHeader":"PGhpZ3VxZStsMXZ1QGVHcm91cHMuY29tPg=="},"prevInTopic":49534,"nextInTopic":49537,"prevInTime":49535,"nextInTime":49537,"topicId":49522,"numMessagesInTopic":0,"msgSnippet":"***It would be part vocabulary-building , and part quotation-reading, and part thinking about what kind of person we want to become.*** One thing that has","messageBody":"<div id=\"ygrps-yiv-1879787272\">***It would be part vocabulary-building , and part quotation-reading, and part thinking about what kind of person we want to become.***<br/>\n<br/>\nOne thing that has really helped me be a better unschooling parent, was to stop seeing my kids for what they will become, and see what they are right now.  When I started focusing on that, and seeing all the wonderful things they are doing and being right now, it was hard for me to imagine them being any different from the wonderful people they are today, except maybe even better and wiser and more interesting as they grow up.<br/>\n<br/>\n***I know that &quot;teaching&quot; character in this way is not unschooling -- and that we want to avoid telling our kids what is &quot;right&quot; and what is &quot;wrong.&quot; After all, these things are mostly subjective, yes?***<br/>\n<br/>\nWell yes and no... I&#39;m opinionated, there&#39;s no way around that.  My kids get to here my opinion all the time!  I tell them what I think is right and wrong, and they get to decide what they think is right and wrong and have an opinion on that too.<br/>\n<br/>\n***But as I&#39;ve been modifying my thoughts, and embracing unschooling, I have been trying to put some thought into this issue of instilling character or values. Is there a way to do it, without coercion, without &quot;making&quot; them?***<br/>\n<br/>\nKids already have character and values.  Look directly at them and really try to see who they are and what kinds of character traits they have and what values they have right now.  <br/>\n<br/>\n***I really do want my kids to know the words for these behaviors and ideas; I want them to spend time in thought about what it means to be &quot;flexible&quot; vs. &quot;resistant,&quot; among other traits.***<br/>\n<br/>\nExcept they may not be interested in those things.  They could be interested in what mom is interested in and not internally be driven to explore those same things.  My oldest is usually interested in what I have to say and what I think, but it doesn&#39;t mean she&#39;s going to own those things too.  It&#39;s the same way that I&#39;m interested in what she is into, even though I&#39;m not necessarily going to explore those things in my own free time the way she does.<br/>\n<br/>\n***My stepson, who is a big reader, often asks questions such as, &quot;What does *conscience* mean?&quot; Okay...is that an opening for a discussion of right and wrong, or some kind of exploration of self-control or virtue or guilt? Or should I just give him the dictionary definition and move on? ***<br/>\n<br/>\nDiscuss and answer for as long as everyone is still interested and stop when it seems natural to do so or when the conversation takes a tangent in another direction.  Chamille, my oldest, has a funny way of diverting the conversation, and it always seems to involve blow up dolls as sex toys, and that is always my cue that I&#39;ve talked too much.<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Philosophical question regarding &quot;teaching/learning&quot; character traits","postDate":"1263324763","msgId":49534,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVBNUQ3NUQxLTJEMTEtNDk0RS04MTRBLUNCRkFEQUUzNjMwM0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhpaWhjZStmbmFjQGVHcm91cHMuY29tPg==","referencesHeader":"PGhpaWhjZStmbmFjQGVHcm91cHMuY29tPg=="},"prevInTopic":49533,"nextInTopic":49536,"prevInTime":49533,"nextInTime":49535,"topicId":49522,"numMessagesInTopic":0,"msgSnippet":"-=-I think all of this stuff keeps boiling down to trust: trust that your kids are good people, that they are learning, that they want to find ways to","messageBody":"<div id=\"ygrps-yiv-1197083039\">-=-I think all of this stuff keeps boiling down to trust: trust that  <br/>\nyour kids are good people, that they are learning, that they want to  <br/>\nfind ways to contribute, and that they will gravitate toward things  <br/>\nthat make them feel they are growing and becoming more competent.-=-<br/>\n<br/>\nKeep boiling it down, though.<br/>\n<br/>\nLearn to know that your kids are learning, that they WILL contribute,  <br/>\nthat they WILL grow and become more competent.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":240838916,"authorName":"Hael","from":"&quot;Hael&quot; &lt;dlmckee@...&gt;","profile":"hael_harobed","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Philosophical question regarding &quot;teaching/learning&quot; character traits","postDate":"1263323342","msgId":49533,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhpaWhjZStmbmFjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhpZ3VxZStsMXZ1QGVHcm91cHMuY29tPg=="},"prevInTopic":49532,"nextInTopic":49534,"prevInTime":49532,"nextInTime":49534,"topicId":49522,"numMessagesInTopic":0,"msgSnippet":"Thank you all for some good thought-provoking ideas here. I think all of this stuff keeps boiling down to trust:  trust that your kids are good people, that","messageBody":"<div id=\"ygrps-yiv-1348168824\">Thank you all for some good thought-provoking ideas here.<br/>\n<br/>\nI think all of this stuff keeps boiling down to trust:  trust that your kids are good people, that they are learning, that they want to find ways to contribute, and that they will gravitate toward things that make them feel they are growing and becoming more competent.<br/>\n<br/>\nThanks again.<br/>\n<br/>\nDeb</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Philosophical question regarding &quot;teaching/learning&quot; character traits","postDate":"1263316743","msgId":49532,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCNENBRjA3LjUwMzA4MDFAbWFjLmNvbT4=","inReplyToHeader":"PDRCNENBQTIyLjUwMTAzMDRAbWFjLmNvbT4=","referencesHeader":"PGhpZ3VxZStsMXZ1QGVHcm91cHMuY29tPiA8NEI0Q0FBMjIuNTAxMDMwNEBtYWMuY29tPg=="},"prevInTopic":49531,"nextInTopic":49533,"prevInTime":49531,"nextInTime":49533,"topicId":49522,"numMessagesInTopic":0,"msgSnippet":"... I meant to say that word really sucks. I cringe whenever I hear that word applied to children - it has a science fiction or medical sense to it, in my","messageBody":"<div id=\"ygrps-yiv-1515218073\">On 1/12/2010 8:58 AM, Pam Sorooshian wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; It isn&#39;t that we don&#39;t want to &quot;instill&quot; (that works really sucks)<br/>\n<br/>\n </span></blockquote>I meant to say that &quot;word&quot; really sucks. I cringe whenever I hear that <br/>\nword applied to children - it has a science fiction or medical sense to <br/>\nit, in my head, and my reaction is to flinch in anticipated pain.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Philosophical question regarding &quot;teaching/learning&quot; character traits","postDate":"1263316683","msgId":49531,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJFMkMyRjlELTY5RjMtNDJGNS1CNDA5LTc2REIwMkM0NEI1MEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDRCNENBQTIyLjUwMTAzMDRAbWFjLmNvbT4=","referencesHeader":"PGhpZ3VxZStsMXZ1QGVHcm91cHMuY29tPiA8NEI0Q0FBMjIuNTAxMDMwNEBtYWMuY29tPg=="},"prevInTopic":49529,"nextInTopic":49532,"prevInTime":49530,"nextInTime":49532,"topicId":49522,"numMessagesInTopic":0,"msgSnippet":"-=-It isn t that we don t want to instill (that works really sucks) good character into our children=- I like that word! I don t think I do it much to my","messageBody":"<div id=\"ygrps-yiv-575750634\">-=-It isn&#39;t that we don&#39;t want to &quot;instill&quot; (that works really sucks)  <br/>\ngood<br/>\ncharacter into our children=-<br/>\n<br/>\nI like that word!<br/>\nI don&#39;t think I do it much to my kids, but I think there are things  <br/>\n&quot;instilled&quot; in them by their own creation.<br/>\n<br/>\nI have had SCA students (still have one) who have come and asked me  <br/>\nvery politely if I would help instill some things in them!  If someone  <br/>\nwants coaching, then the coach is instilling (installing &lt;g&gt;) all  <br/>\nkinds of things, consciously.<br/>\n<br/>\n-=-Live it - and talk about issues that come up in your<br/>\nown real lives or that you observe on tv or in movies or books or other<br/>\npeople&#39;s lives.-=-<br/>\n<br/>\nThat, combined with their respect for the parent&#39;s judgment, will  <br/>\ninstill in them those positive traits and better choices that the  <br/>\nparents might hope good people would gain.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Philosophical question regarding &quot;teaching/learning&quot; character traits","postDate":"1263315490","msgId":49529,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCNENBQTIyLjUwMTAzMDRAbWFjLmNvbT4=","inReplyToHeader":"PGhpZ3VxZStsMXZ1QGVHcm91cHMuY29tPg==","referencesHeader":"PGhpZ3VxZStsMXZ1QGVHcm91cHMuY29tPg=="},"prevInTopic":49528,"nextInTopic":49531,"prevInTime":49528,"nextInTime":49530,"topicId":49522,"numMessagesInTopic":0,"msgSnippet":"... Can you relax more and not think in terms of what you are instilling or teaching them. Try thinking more in terms of just having conversations about all","messageBody":"<div id=\"ygrps-yiv-1005756600\">On 1/11/2010 8:46 PM, Hael wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; My stepson, who is a big reader, often asks questions such as, &quot;What does*conscience*  mean?&quot;  Okay...is that an opening for a discussion of right and wrong, or some kind of exploration of self-control or virtue or guilt? Or should I just give him the dictionary definition and move on?<br/>\n&gt;    <br/>\n<br/>\n </span></blockquote>Can you relax more and not think in terms of what you are instilling or <br/>\nteaching them. Try thinking more in terms of just having conversations <br/>\nabout all the interesting stuff that comes up in your happy and <br/>\ninteresting daily lives. If my kid asked, &quot;What does conscience mean?&quot; I <br/>\nwould answer best I could - and wait to see if they wanted to talk more <br/>\nabout it. Or, I might, if I&#39;m thinking quickly, relate it to something <br/>\nelse they are interested in. My first thought in response to this <br/>\nquestion was about the tv show, Dexter, which Rosie and Rox and a lot of <br/>\ntheir friends are really into watching these days. (Serial murderer who <br/>\nkills bad people.) So, my response might have been to say, &quot;What Dexter <br/>\ndoesn&#39;t have.&quot; But, then, I&#39;d have probably thought more and said, <br/>\n&quot;Well, maybe he does....&quot; and then we&#39;d talk about it in the context of <br/>\nDexter.<br/>\n<br/>\nAs far as the vocabulary of character traits goes - you don&#39;t have to <br/>\nconsciously introduce that terminology, it will come up in their reading <br/>\nand conversations over time. Read, watch tv, go to movies and shows, and <br/>\nhave lots of good conversation!  If you feel like you don&#39;t have that <br/>\nvocabulary yourself, you could read the Character Counts stuff (which IS <br/>\nused in lots of public schools and probably having exactly the opposite <br/>\neffect that they&#39;re hoping for). I read &quot;The Virtues Project&quot; stuff, in <br/>\nthe past, and so there is some of that in my head - I found it kind of <br/>\ninteresting to see all the quotes from different religions. Nothing <br/>\nwrong with pursuing an interest of our own and, of course, anything we <br/>\nknow more about will be something we have to draw upon IF it comes up <br/>\nnaturally in the course of our lives with our children. I&#39;m guessing <br/>\nmaybe you feel a bit lacking in the ability to pass along these good <br/>\ncharacter traits just by modeling and natural conversation - but really <br/>\nthat IS how it works.<br/>\n<br/>\nIt isn&#39;t that we don&#39;t want to &quot;instill&quot; (that works really sucks) good <br/>\ncharacter into our children, it is that we don&#39;t think trying to teach <br/>\nit to them by telling it to them s very useful and could be very <br/>\ncounterproductive. Live it - and talk about issues that come up in your <br/>\nown real lives or that you observe on tv or in movies or books or other <br/>\npeople&#39;s lives.<br/>\n<br/>\nI once had a class in which we had to memorize a set of good character <br/>\ntraits. It was alphabetical - one for each letter of the alphabet. It <br/>\nwas a monkey trick - monkey see/monkey do. It was exactly like how in <br/>\n4th grade I memorized all the &quot;being verbs&quot; and I can still recite them <br/>\n- is, am, are, was, were, be, being, been, has, have had, do, does, did, <br/>\nshall, will, should, would, may, might, must, can, could --- there they <br/>\nare. Doesn&#39;t mean I can use them any better than anybody else, just <br/>\nbecause I can recite them &lt;G&gt;.<br/>\n<blockquote><span title=\"ireply\"> &gt; Is the main idea here to try not to put our own personal opinions out there as the only right way?<br/>\n </span></blockquote>That is not at all the &quot;main&quot; idea, no. But do we let our kids know <br/>\nabout our personal opinions? Of course. Do we pretend that everybody <br/>\nelse on the planet is always wrong and we&#39;re always right? No.<br/>\n<br/>\nAre you reacting to parents who expected you to always spout off exactly <br/>\ntheir opinions and not think for yourself? Unschooling parents are <br/>\nsupporting their kids in thinking - not in spouting off someone else&#39;s <br/>\nideas.<br/>\n<br/>\nThink more in terms of good conversation with another person. Both <br/>\nparties to a good conversation have an important role - it isn&#39;t a <br/>\none-sided lecture, it is an interaction.<br/>\n<blockquote><span title=\"ireply\"> &gt;   I often couch our discussions in terms of, &quot;Some people think...&quot; or &quot;some people believe...&quot; and we often say things like, &quot;but no one really knows for sure,&quot; or &quot;there are a lot of other equally intelligent people who think...&quot; etc.<br/>\n&gt;    <br/>\n<br/>\n </span></blockquote>Say what you really believe - don&#39;t couch your discussions. If YOU <br/>\nreally think something say, &quot;I really think that ....whatever...., but <br/>\nother people think .....&quot;.  And you could go on with explaining why you <br/>\ndon&#39;t agree. That doesn&#39;t demand the kid think what you think - that <br/>\nallows the kid to see into your thought processes about the topic.<br/>\n<br/>\nit would be dishonest and disingenuous to pretend you don&#39;t have any <br/>\npositions or opinions, yourself, or to hold out on telling the kid what <br/>\nyou believe and why.<br/>\n<blockquote><span title=\"ireply\"> &gt; I want to make it clear to my children that there are ideas out there that they can explore and reject, or explore and embrace, or embrace one day and reject the next.<br/>\n&gt;    <br/>\n<br/>\n </span></blockquote>You do that by doing it - yourself and with them, when they are <br/>\ninterested.  But do you really want to leave them with the impression <br/>\nthat you think all ideas are equally smart and valid and good?<br/>\n<br/>\nGo for honesty in your relationship - stop thinking of how to manipulate <br/>\nthem into learning what you want them to learn and trust that they can&#39;t <br/>\nhelp learning and that your role is to provide the environment that is <br/>\ninteresting and fun and offers lots of fertile ground for them to learn <br/>\nwhatever they learn. You really and truly do not have to worry about <br/>\n&quot;what&quot; they are learning - you don&#39;t have to make sure they&#39;ll learn to <br/>\nbe honest and you do not have to make sure they&#39;ll learn to read or do <br/>\nbasic math. These are real-life things that will come up naturally.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":240358028,"authorName":"Kristi","from":"&quot;Kristi&quot; &lt;foehn_jye@...&gt;","profile":"foehn_jye","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Philosophical question regarding &quot;teaching/learning&quot; character traits","postDate":"1263315130","msgId":49528,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhpaTlicStmZGNvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhpZ3VxZStsMXZ1QGVHcm91cHMuY29tPg=="},"prevInTopic":49527,"nextInTopic":49529,"prevInTime":49527,"nextInTime":49529,"topicId":49522,"numMessagesInTopic":0,"msgSnippet":"... My family and I have run an outdoor retail store and service shop for years. One of the advantages of a family-owned store is that we know each other","messageBody":"<div id=\"ygrps-yiv-223401255\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;We run a family business together, and there are some &quot;rights and wrongs&quot; about running our business -- things that are taught, handed down from generation to generation, not because the child asked about it, but because we rely on their work and their contribution, and because we want them to learn how to treat customers, how to work in ways that help and don&#39;t harm, how to increase enjoyment in working with others.&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>My family and I have run an outdoor retail store and service shop for years. One of the advantages of a family-owned store is that we know each other really well, and therefore know what &quot;roles&quot; each person feels comfortable with based on their personality.  My sister-in-law, for instance, is highly chatty and extraordinarily good at providing information about a product to someone, and often a customer will buy something after interacting with her.  My husband, on the other hand, prefers to be in the back, wrenching on bikes or tuning skis and snowboards--out of the way and with minimal interaction with customers. I&#39;m great at handling paperwork, my mother-in-law loves to do window displays...<br/>\n<br/>\nWhile I understand what you are saying in wanting to pass your work ideals down to your children, the best and most obvious way for them to understand how you treat customers and work with others is for them to see how you do it.  If some of the customers are always treated respectfully and in a friendly manner, but others are treated coldly and with an untrusting manner, it would be unfair for you to tell them to treat ALL customers with respect and courtesy.  What they see is not what they are being told.  Granted, in theory, ALL customers should be treated with respect, but the reality of real business interactions often proves otherwise.  This is where I would be honest with my kids...if Rude Joe customer comes into the store and demands a refund because of a problem that was obviously not the store&#39;s fault, but I give a refund anyway, I&#39;d discuss the interaction with my kids afterwards and let them know why I did what I did, and maybe ask them what they thought about it...how might they have handled the situation if I wasn&#39;t there.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;Of course, as I&#39;ve been reading so many wonderful posts about the importance of putting relationships before material things or control issues such as orderliness, etc., I keep wondering whether exposing my children to some of these values is not the same as &quot;forcing&quot; them to sit at a desk and learn a certain subject that is irrelevant to them at the time.&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>When it comes to working in the business, it seems like you are actually exposing them to experiences (not values) that occur in your day to day life, and maybe you talk about your values throughout the day. On face value, I wouldn&#39;t say that&#39;s in any way related to sitting at a desk learning irrelevancies. Of course, if they are being forced to sit there all day and work with you in the business when they&#39;d rather be drawing or playing on the computer, what you are trying to promote may become irrelevant to them. <br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;Should I be undertaking this &quot;character&quot; study out of my own interest?  Posting quotes because I happen to like them, and see what comes of it?&lt;&lt;&lt;  <br/>\n<br/>\n </span></blockquote>In my opinion, if you are interested in character studies, you should pursue them and delve into your interest in the topic.  I pursue many of my own interests, and my kids see my excited passion for all sorts of diverse things. If anything, it shows that learning never ends...even busy Moms have things they want to learn.  But I&#39;m not going to throw quotations about natural childbirth around just because I hope that should they decide to have kids they will choose to have their babies at home.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Philosophical question regarding &quot;teaching/learning&quot; character traits","postDate":"1263310811","msgId":49527,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQ3NkQ5QzA5LTBFMTUtNEE4My04M0Y2LTAwRTM5QzE0RDREQ0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhpZ3VxZStsMXZ1QGVHcm91cHMuY29tPg==","referencesHeader":"PGhpZ3VxZStsMXZ1QGVHcm91cHMuY29tPg=="},"prevInTopic":49525,"nextInTopic":49528,"prevInTime":49526,"nextInTime":49528,"topicId":49522,"numMessagesInTopic":0,"msgSnippet":"Character First was created as a remedial morality program for school kids, I think.  Because school goes against some of the natural cultural paths of","messageBody":"<div id=\"ygrps-yiv-1854719569\">&quot;Character First&quot; was created as a remedial morality program for  <br/>\nschool kids, I think.  Because school goes against some of the natural  <br/>\ncultural paths of learning, there are things kids don&#39;t learn from  <br/>\nother kids.  And when schools set up an &quot;us vs. them&quot; of adults and  <br/>\nkids, the kids tend to reject the adults&#39; values as being &quot;of them/ <br/>\nothers.&quot;<br/>\n<br/>\nSo it seems in an unschooling situation where children are around  <br/>\nadults other than just their parents and around other people of  <br/>\nvarious ages, they should be able to pick and choose from all those  <br/>\nexamples the things they would like to emulate without a peer group  <br/>\ntelling them who to ignore and what to do.<br/>\n<br/>\nThis isn&#39;t a recommendation for anyone else, but just a full  <br/>\ndisclosure moment. &lt;g&gt;  Holly and Marty have both come to sessions I  <br/>\nran on medieval virtues.  Marty was invited, and often had gaming or  <br/>\nother things to do, and the first time Holly went was because it was  <br/>\nat a restaurant near our house and she was hungry, so she walked over  <br/>\nto ask me to buy her dinner, and stayed.  And came back.<br/>\n<br/>\nThose discussions were based on knightly virtues of the middle ages,  <br/>\nand some of them are deep and esoteric.   &quot;Franchise&quot; is the hardest  <br/>\nof them.   &quot;Chastity,&quot; when it&#39;s not just sexual, and it&#39;s not just  <br/>\nfor little girls.   &quot;Chastity&quot; as a virtue for adult men.<br/>\n<br/>\nHere are some of the notes on those.  I&#39;m &quot;AElflaed&quot; on those pages:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/duckford/virtue/lists\">http://sandradodd.com/duckford/virtue/lists</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/duckford/mindfulness\">http://sandradodd.com/duckford/mindfulness</a><br/>\n<br/>\nThose were not designed for my children, but for several adult friends  <br/>\nwho were already knights or hoping to become knights in the medieval  <br/>\nstudies group my other life is in. &lt;g&gt;  I wasn&#39;t &quot;teaching&quot; those  <br/>\npeople.  I was helping them explore.  It did involve quotes and  <br/>\nvocabulary, and nobody &quot;had to&quot; be there.<br/>\n<br/>\nSome of the things I learned there I&#39;ve brought here.  Something I  <br/>\nwrote here, I took there (&quot;here&quot; meaning unschooling discussions, not  <br/>\nnecessarily this very list, though it might have been).<br/>\n<br/>\nIn my children&#39;s lives this was natural learning, but not everyone&#39;s  <br/>\nmom runs series of discussions on knightly virtues.  So I want to say  <br/>\nmy kids (the younger two) have had this opportunity.<br/>\n<br/>\nFor my personal self, I love (love!) movies about the redemption of  <br/>\nyoung men, who were thoughtless, selfish bad guys, or guys with bad  <br/>\nattitudes, who become virtuous.  Seven Years in Tibet.  Guarding  <br/>\nTess.  Stand By Me, in a way.  Enemy Mine.  About a Boy.  You don&#39;t  <br/>\nneed to talk about those, if you watch them.  Just let them speak for  <br/>\nthemselves, and some of what they tell won&#39;t kick in for a year or ten  <br/>\nor twenty.  No problem.<br/>\n<br/>\nIf someone lives another 20 years, they have time to learn more.  If  <br/>\nsomeone&#39;s not going to live that long, they didn&#39;t need that knowledge  <br/>\nanyway.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Philosophical question regarding &quot;teaching/learning&quot; character traits","postDate":"1263308699","msgId":49525,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc3NkQ5Rjg3LUVENzctNDJEMC1CRjU5LTBGRkRFRTBCMzMyNEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhpZ3VxZStsMXZ1QGVHcm91cHMuY29tPg==","referencesHeader":"PGhpZ3VxZStsMXZ1QGVHcm91cHMuY29tPg=="},"prevInTopic":49524,"nextInTopic":49527,"prevInTime":49524,"nextInTime":49526,"topicId":49522,"numMessagesInTopic":0,"msgSnippet":"-=-I want to make it clear to my children that there are ideas out there that they can explore and reject, or explore and embrace, or embrace one day and","messageBody":"<div id=\"ygrps-yiv-1791695103\">-=-I want to make it clear to my children that there are ideas out  <br/>\nthere that they can explore and reject, or explore and embrace, or  <br/>\nembrace one day and reject the next.-=-<br/>\n<br/>\nI never talked to my kids about anything like that.<br/>\n<br/>\nThe best way to make that true (if not clear) is to be calm when an  <br/>\ninterest wanes or grows, and not to criticize them for changing their  <br/>\nminds.  Or tell them (brief) stories of things you&#39;ve changed your  <br/>\nmind about, maybe.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Philosophical question regarding &quot;teaching/learning&quot; character traits","postDate":"1263308600","msgId":49524,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVFQzZGQUQxLUQ0QkMtNDZCQy05REQzLTc1NzIxMUQxQzQyMEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhpZ3VxZStsMXZ1QGVHcm91cHMuY29tPg==","referencesHeader":"PGhpZ3VxZStsMXZ1QGVHcm91cHMuY29tPg=="},"prevInTopic":49523,"nextInTopic":49525,"prevInTime":49523,"nextInTime":49525,"topicId":49522,"numMessagesInTopic":0,"msgSnippet":"-=-I know that teaching character in this way is not unschooling -- and that we want to avoid telling our kids what is right and what is wrong. After","messageBody":"<div id=\"ygrps-yiv-603810995\">-=-I know that &quot;teaching&quot; character in this way is not unschooling --  <br/>\nand that we want to avoid telling our kids what is &quot;right&quot; and what is  <br/>\n&quot;wrong.&quot; After all, these things are mostly subjective, yes?-=-<br/>\n<br/>\nPlease be very careful about any &quot;we&quot; statements, anywhere in your  <br/>\nlife.  Even about your own family.   You qualified it kind of, by  <br/>\nasking a question, but nobody can speak for all unschoolers without  <br/>\nthe danger of the next unschooler over saying &quot;I don&#39;t.&quot;<br/>\n<br/>\nThere are some things about which right and wrong are subjective.   <br/>\nCovered midriff.  Exposed arms on a woman.  Beard on a man.<br/>\nThose are the kinds of things 18th and 19th century Christian  <br/>\nmissionaries ran up against and imposed a &quot;right&quot; that didn&#39;t take  <br/>\nculture or  climate into account.<br/>\n<br/>\nAs to whether rape is right or wrong, that&#39;s not subjective at all.   <br/>\nWhether causing another person to cry from embarrassment or shame is  <br/>\nwrong, if you&#39;re around the house and one kid makes another kid cry,  <br/>\nI&#39;d say &quot;wrong.&quot;  If it&#39;s a courtroom and a judge or lawyer makes a  <br/>\ncriminal cry, that&#39;s fine with me.<br/>\n<br/>\n-=-I know that &quot;teaching&quot; character in this way is not unschooling --  <br/>\nand that we want to avoid telling our kids what is &quot;right&quot; and what is  <br/>\n&quot;wrong.&quot; After all, these things are mostly subjective, yes?-=-<br/>\n<br/>\n&quot;It depends&quot; is the best response I can give.  Each instance is  <br/>\ndifferent, and the opportunities to discuss what comes up naturally  <br/>\ncan&#39;t be repeated in other families.  Things happen, parents and  <br/>\nchildren discuss them, children learn a little more each time, adding  <br/>\nto what they already know and believe.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Philosophical question regarding &quot;teaching/learning&quot; character traits","postDate":"1263304185","msgId":49523,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQwQjEyODA5LUQyRjMtNDY4QS05QzU3LTczOEYyODFCNTdERUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGhpZ3VxZStsMXZ1QGVHcm91cHMuY29tPg==","referencesHeader":"PGhpZ3VxZStsMXZ1QGVHcm91cHMuY29tPg=="},"prevInTopic":49522,"nextInTopic":49524,"prevInTime":49522,"nextInTime":49524,"topicId":49522,"numMessagesInTopic":0,"msgSnippet":"... Unschooling is more in the why than in the what. Two kids doing math worksheets can look like they re doing the same thing, but if one is doing it for fun","messageBody":"<div id=\"ygrps-yiv-1376070987\">On Jan 11, 2010, at 11:46 PM, Hael wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I thought these might offer glimpses into ways of being, and then  <br/>\n&gt; we could explore it a little, then just have it in the back of our  <br/>\n&gt; mind for the week, and hopefully longer. It wouldn&#39;t be a lecture  <br/>\n&gt; or anything lengthy.<br/>\n<br/>\n </span></blockquote>Unschooling is more in the why than in the what. Two kids doing math  <br/>\nworksheets can look like they&#39;re doing the same thing, but if one is  <br/>\ndoing it for fun and the other is doing it because it&#39;s required,  <br/>\nthey really aren&#39;t doing the same thing.<br/>\n<br/>\nOne of my suggestions for new unschoolers who are wrapped up in  <br/>\nlearning looking like doing textbooks is that unschooling can look  <br/>\nlike watching all the James Bond movies in order and talking about  <br/>\nthe changes in attitudes towards women, how the bad guys and their  <br/>\ngoals changed, film making styles and so forth.<br/>\n<br/>\nWhat you&#39;re suggesting above *could* be similar. If it&#39;s something  <br/>\nyou wanted to do for yourself, if it&#39;s something your children  <br/>\nthought sounded intriguing.<br/>\n<br/>\nBut if you have an agenda of putting a set of information into their  <br/>\nheads because you think it&#39;s important, it will interfere with their  <br/>\nfree exploration.<br/>\n<br/>\nIt might help if you turned it around. What if your husband had  <br/>\nstumbled across Character First and decided he wanted to devote part  <br/>\nof his time with you exploring character traits because he&#39;d been  <br/>\ntrying to come up with ideas of ways to instill those in you.<br/>\n<br/>\nWouldn&#39;t it feel insulting? Wouldn&#39;t it feel like he was judging you  <br/>\nas falling short of his ideals for you? Wouldn&#39;t it feel like he was  <br/>\ntrying to mold you into something he could think better of?<br/>\n<br/>\nOn the other hand, if he&#39;d stumbled across it and said, &quot;Hey, this is  <br/>\ncool,&quot; and shared the parts that fascinated him with you with no  <br/>\nhidden agenda other than coolness and interest, that&#39;s what  <br/>\nunschooling can look like. It could even be unschooling if he asked  <br/>\nif you wanted to explore it with you. Assuming your husband&#39;s only  <br/>\nagenda is spending time with you on something you both might enjoy  <br/>\nthen it&#39;s no different than asking if you&#39;d like to go to a movie  <br/>\nwith him.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It would be part vocabulary-building, and part quotation-reading,  <br/>\n&gt; and part thinking about what kind of person we want to become.<br/>\n<br/>\n </span></blockquote>It will help to drop the idea of vocabulary building. See that as a  <br/>\nside effect of living rather than a goal you&#39;re headed towards.<br/>\n<br/>\nYou can&#39;t make him think about what kind of person he wants to  <br/>\nbecome. He might though, as a side effect, think about who he wants  <br/>\nto be if the discussion were about how other people became who they  <br/>\nwere and about how you became who you are and how you continue to  <br/>\ngrow and change. *And* he was enjoying the discussions.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I know that &quot;teaching&quot; character in this way is not unschooling --  <br/>\n&gt; and that we want to avoid telling our kids what is &quot;right&quot; and what  <br/>\n&gt; is &quot;wrong.&quot; After all, these things are mostly subjective, yes?<br/>\n<br/>\n </span></blockquote>Wellllll, it depends on what someone&#39;s goals are. Someone who wants  <br/>\nto be dictator of the world will have different values than someone  <br/>\nwho wants to take their doctoring skills to the slums of India.<br/>\n<br/>\nBut we don&#39;t do our kids a favor by suggesting that right and wrong  <br/>\nare all subjective. Part of unschooling is helping kids navigate the  <br/>\nworld in safe and respectful ways. So it&#39;s practicing kindness to  <br/>\nthem to help them find solutions that are kind and respectful.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But as I&#39;ve been modifying my thoughts, and embracing unschooling,  <br/>\n&gt; I have been trying to put some thought into this issue of  <br/>\n&gt; instilling character or values. Is there a way to do it, without  <br/>\n&gt; coercion, without &quot;making&quot; them?<br/>\n<br/>\n </span></blockquote>Yes, by living those values yourself. An important part of that is  <br/>\nusing those values in your interactions with them, in how you treat  <br/>\nthem, in how you help them solve problems.<br/>\n<br/>\nOne of the problems with conventional parenting is that it blinds  <br/>\npeople to how horribly disrespectful and unkind it causes parents to  <br/>\nbe toward children. And by the time they&#39;re teens kids can be nasty  <br/>\nand rude and doing bad things (because they&#39;re fighting control). So  <br/>\nit seems like passing on values is hard and uncertain.<br/>\n<br/>\nBut it isn&#39;t. While we can&#39;t ensure our kids will have the same set  <br/>\nof values we do, kids who are treated kindly, respectfully, who  <br/>\naren&#39;t lied to and so on, drink all those in and return them. They  <br/>\n*value* being treated that way.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It&#39;s not a school subject. It&#39;s something that our family values  <br/>\n&gt; and puts to use on a daily basis. Some of these things ARE  <br/>\n&gt; &quot;lessons&quot; we teach as part of working together.<br/>\n<br/>\n </span></blockquote>It will help your thinking be clearer about the difference between  <br/>\nlearning and being taught if you don&#39;t see what people pick up from  <br/>\nlife as lessons.<br/>\n<br/>\nIt can be argued that teaching and lessons and learning and modeling  <br/>\nare all the same, but that emphasizes their similarities. What&#39;s  <br/>\nimportant when beginning unschooling is focusing on their differences  <br/>\nbecause the differences are profound. For a learner, there&#39;s a huge  <br/>\ninternal difference between being made to read a book and reading a  <br/>\nbook they picked up purely out of interest. There&#39;s a huge internal  <br/>\ndifference between someone trying to move another person from A to B  <br/>\n(from fuzzy values to honesty) and someone using honesty in their  <br/>\ndealings with that person and helping them find honest ways to deal  <br/>\nwith others.<br/>\n<br/>\nThis and the links should be helpful:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/teaching/\">http://sandradodd.com/teaching/</a><br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; We have discussions about our way of life, and about what types of  <br/>\n&gt; behavior tend to make our business more successful, our products  <br/>\n&gt; more appealing, and what makes someone in our business a &quot;happy&quot;  <br/>\n&gt; person, versus someone who seems to be unhappy. We also make it  <br/>\n&gt; clear that they are not, obviously, required to be part of this  <br/>\n&gt; business long-term...but it is an option, and these ideas are  <br/>\n&gt; transferable.<br/>\n<br/>\n </span></blockquote>And that&#39;s how learning from life works. There are practical reasons  <br/>\nfor values. It&#39;s not &quot;just because that&#39;s who I want you to be&quot;.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Of course, as I&#39;ve been reading so many wonderful posts about the  <br/>\n&gt; importance of putting relationships before material things or  <br/>\n&gt; control issues such as orderliness, etc., I keep wondering whether  <br/>\n&gt; exposing my children to some of these values is not the same as  <br/>\n&gt; &quot;forcing&quot; them to sit at a desk and learn a certain subject that is  <br/>\n&gt; irrelevant to them at the time.<br/>\n&gt;<br/>\n&gt; I really do want my kids to know the words for these behaviors and  <br/>\n&gt; ideas; I want them to spend time in thought about what it means to  <br/>\n&gt; be &quot;flexible&quot; vs. &quot;resistant,&quot; among other traits.<br/>\n<br/>\n </span></blockquote>And that will trip you up on the path of unschooling ;-)<br/>\n<br/>\nIt&#39;s not wrong to want something for our kids. I want my daughter to  <br/>\nbe kind. But it&#39;s going to damage our relationship if I try to make  <br/>\nher be a kind person. On the other hand, if I&#39;m kind to her, if I  <br/>\nhelp her get what she wants while helping her avoid being unkind to  <br/>\nothers, she will see and feel the value of being kind, she will see  <br/>\nand value what will be lost by being unkind.<br/>\n<br/>\nThere&#39;s a difference in how values are absorbed if they&#39;re used as a  <br/>\ntool and when they&#39;re imposed to change someone&#39;s character.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My stepson, who is a big reader, often asks questions such as,  <br/>\n&gt; &quot;What does *conscience* mean?&quot; Okay...is that an opening for a  <br/>\n&gt; discussion of right and wrong, or some kind of exploration of self- <br/>\n&gt; control or virtue or guilt? Or should I just give him the  <br/>\n&gt; dictionary definition and move on?<br/>\n<br/>\n </span></blockquote>If he wanted a dictionary definition he could look that up. The  <br/>\ninformation is less important than the interaction between you.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Is the main idea here to try not to put our own personal opinions  <br/>\n&gt; out there as the only right way? I often couch our discussions in  <br/>\n&gt; terms of, &quot;Some people think...&quot; or &quot;some people believe...&quot; and we  <br/>\n&gt; often say things like, &quot;but no one really knows for sure,&quot; or  <br/>\n&gt; &quot;there are a lot of other equally intelligent people who think...&quot;  <br/>\n&gt; etc.<br/>\n<br/>\n </span></blockquote>Sounds good. :-) If he asks, do let him know what you believe. If  <br/>\nyou&#39;re a person he values, your opinion will count for more, but  <br/>\nthat&#39;s not something parents can help! (Nor should they try.) It&#39;s  <br/>\ngood to be aware that we have influence over them and to avoid  <br/>\nabusing it. But I wouldn&#39;t fear that sharing your opinion is the same  <br/>\nas not giving him the freedom to choose.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I want to make it clear to my children that there are ideas out  <br/>\n&gt; there that they can explore and reject, or explore and embrace, or  <br/>\n&gt; embrace one day and reject the next.<br/>\n<br/>\n </span></blockquote>Why do you think you need to make that clear? Why do you think they  <br/>\ndon&#39;t know that?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Should I be undertaking this &quot;character&quot; study out of my own  <br/>\n&gt; interest? Posting quotes because I happen to like them, and see  <br/>\n&gt; what comes of it? Should I &quot;strew&quot; books that happen to explore  <br/>\n&gt; certain character traits or ideas and see what kind of discussions  <br/>\n&gt; occur?<br/>\n<br/>\n </span></blockquote>It could be a fun thing to do together like an Akira Kurosawa  <br/>\nmarathon. It could get in the way of unschooling if you have goals  <br/>\nfor what you&#39;d like them to get out of it. I think it&#39;s a red flag  <br/>\nthat you have a goal if you want to strew books about the character  <br/>\ntraits. It&#39;s like a trick to get them to follow your path. (If your  <br/>\nhusband was studying something he wanted you to study too, wouldn&#39;t  <br/>\nfinding books left out feel manipulative? IT&#39;s because the books are  <br/>\nabout what he wants for you not help in you find things you want for  <br/>\nyou.)<br/>\n<br/>\nUse strewing for things you think they might enjoy. Keep the focus on  <br/>\nthem rather than where you would like them to go.<br/>\n<br/>\nIf they do show interest in what you&#39;re doing, then a couple of books  <br/>\nwould be in keeping with that.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":240838916,"authorName":"Hael","from":"&quot;Hael&quot; &lt;dlmckee@...&gt;","profile":"hael_harobed","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Philosophical question regarding &quot;teaching/learning&quot; character traits","postDate":"1263271566","msgId":49522,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhpZ3VxZStsMXZ1QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":49523,"prevInTime":49521,"nextInTime":49523,"topicId":49522,"numMessagesInTopic":0,"msgSnippet":"One of the things I had been pondering before considering the unschooling approach (we have been homeschooling for years) was devoting part of our school day","messageBody":"<div id=\"ygrps-yiv-636245230\">One of the things I had been pondering before considering the unschooling approach (we have been homeschooling for years) was devoting part of our &quot;school day&quot; to exploring specific character traits -- maybe one a week -- with my step-son.<br/>\n<br/>\nI had been trying to come up with ways to instill such ideas in him -- through quotations and readings -- and I needed a place to start, to suggest some character traits I could get on board with.  (Again, this was before I began to understand the ideas behind unschooling, particularly the concept of not wishing &quot;to instill&quot; anything.)<br/>\n<br/>\nAt that time, I found a website / organization, called Character First, that lists 49 character qualities, and gives a short description of each, and maybe a quote.<br/>\n<br/>\nFor example, &quot;Tolerance vs. Prejudice,&quot; and the quote offered is &quot;We should look to the mind, and not to the outward appearance.&quot; Aesop <br/>\n<br/>\nI thought these might offer glimpses into ways of being, and then we could explore it a little, then just have it in the back of our mind for the week, and hopefully longer.  It wouldn&#39;t be a lecture or anything lengthy.<br/>\n<br/>\nIt would be part vocabulary-building, and part quotation-reading, and part thinking about what kind of person we want to become.<br/>\n<br/>\nI know that &quot;teaching&quot; character in this way is not unschooling -- and that we want to avoid telling our kids what is &quot;right&quot; and what is &quot;wrong.&quot;  After all, these things are mostly subjective, yes?<br/>\n<br/>\nBut as I&#39;ve been modifying my thoughts, and embracing unschooling, I have been trying to put some thought into this issue of instilling character or values.  Is there a way to do it, without coercion, without &quot;making&quot; them?<br/>\n<br/>\nIt&#39;s not a school subject.  It&#39;s something that our family values and puts to use on a daily basis. Some of these things ARE &quot;lessons&quot; we teach as part of working together.  We run a family business together, and there are some &quot;rights and wrongs&quot; about running our business -- things that are taught, handed down from generation to generation, not because the child asked about it, but because we rely on their work and their contribution, and because we want them to learn how to treat customers, how to work in ways that help and don&#39;t harm, how to increase enjoyment in working with others.  And we do engage their thinking in passing along these ideas -- we don&#39;t just say, &quot;You have to be courteous to customers.&quot;  We have discussions about our way of life, and about what types of behavior tend to make our business more successful, our products more appealing, and what makes someone in our business a &quot;happy&quot; person, versus someone who seems to be unhappy. We also make it clear that they are not, obviously, required to be part of this business long-term...but it is an option, and these ideas are transferable.<br/>\n<br/>\nOf course, as I&#39;ve been reading so many wonderful posts about the importance of putting relationships before material things or control issues such as orderliness, etc., I keep wondering whether exposing my children to some of these values is not the same as &quot;forcing&quot; them to sit at a desk and learn a certain subject that is irrelevant to them at the time.<br/>\n<br/>\nI really do want my kids to know the words for these behaviors and ideas; I want them to spend time in thought about what it means to be &quot;flexible&quot; vs. &quot;resistant,&quot; among other traits.<br/>\n<br/>\nMy stepson, who is a big reader, often asks questions such as, &quot;What does *conscience* mean?&quot;  Okay...is that an opening for a discussion of right and wrong, or some kind of exploration of self-control or virtue or guilt? Or should I just give him the dictionary definition and move on? <br/>\n<br/>\nIs the main idea here to try not to put our own personal opinions out there as the only right way?  I often couch our discussions in terms of, &quot;Some people think...&quot; or &quot;some people believe...&quot; and we often say things like, &quot;but no one really knows for sure,&quot; or &quot;there are a lot of other equally intelligent people who think...&quot; etc.<br/>\n<br/>\nI want to make it clear to my children that there are ideas out there that they can explore and reject, or explore and embrace, or embrace one day and reject the next.<br/>\n<br/>\nShould I be undertaking this &quot;character&quot; study out of my own interest?  Posting quotes because I happen to like them, and see what comes of it?  Should I &quot;strew&quot; books that happen to explore certain character traits or ideas and see what kind of discussions occur?<br/>\n<br/>\nLove to hear thoughts and ideas on this topic.<br/>\n<br/>\nDeb</div>","specialLinks":[]}],"prevTopicId":49505,"nextTopicId":49631}}