{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Pam Hartley","from":"Pam Hartley &lt;pamhartley@...&gt;","profile":"pamhartley966","replyTo":"LIST","senderId":"byOxqFz-wh8x7fmgXOZ_trjH1SyVPS_yJszMItmwHr1nBWjrCaKGfeloKJt0qLjkNcMeBQ6ahbvqGADJSfu37SLnCFqjld8qWbT1YqLK","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Why the sea is boiling hot, and whether pigs have wings...","postDate":"1005671117","msgId":27660,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBHTVIwMDJWVzBTVFBHQG10YTYuc25mYzIxLnBiaS5uZXQ+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":27659,"nextInTime":27661,"topicId":27660,"numMessagesInTopic":0,"msgSnippet":"... There was a time in our lives when we were without a TV for several months (no money to purchase a new one). We missed it, and we didn t think it was for","messageBody":"<div id=\"ygrps-yiv-1598551229\">----------<br/>\n<blockquote><span title=\"ireply\"> &gt;From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a><br/>\n&gt;To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a><br/>\n&gt;Subject: [Unschooling-dotcom] Digest Number 1581<br/>\n&gt;Date: Tue, Nov 13, 2001, 4:59 AM<br/>\n&gt;<br/>\n<br/>\n&gt; Please remember-you are the adult.  If you are uncomfortable about the<br/>\n&gt; amount of television your child is watching-and especially it&#39;s content.<br/>\n&gt; You can do something about it.  Put the tv in the garage for a month and see<br/>\n&gt; how life changes.  I promise it will be for the better.  And you may find<br/>\n&gt; that nobody misses it.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>There was a time in our lives when we were without a TV for several months<br/>\n(no money to purchase a new one).<br/>\n<br/>\nWe missed it, and we didn&#39;t think it was for the better.<br/>\n<br/>\nMy young children monitor their own viewing very well. Until recently, my 7<br/>\nyear old would not watch any &quot;adult&quot; TV outside of Survivor. My four year<br/>\nold still does not.<br/>\n<br/>\nIt&#39;s fascinating to me to watch the dynamic of adults arguing about<br/>\ntelevision viewing, and about diet (and bedtimes and spanking...)<br/>\n<br/>\nEven those who really do hand over control of television, or want to, often<br/>\nsay things like, &quot;But they only watch Discovery Channel&quot; or &quot;and she doesn&#39;t<br/>\neven turn the thing on!&quot;<br/>\n<br/>\nSame thing with diet.<br/>\n<br/>\nHardly anyone says right out: We love television. We find it entertaining as<br/>\nwell as educational. There are times we watch quite a bit of it. I would not<br/>\nmiss an episode of The West Wing if you paid me. Television for us is<br/>\nsometimes thought-provoking and relevant, and sometimes pure mind candy.<br/>\nPretty much exactly the same as books or music.<br/>\n<br/>\nWe also like candy, cookies, cereal that comes with prizes, and ice cream<br/>\nfrom cows without resumes.<br/>\n<br/>\nWe eat some &quot;good&quot; food and watch some &quot;good&quot; television, but that doesn&#39;t<br/>\nmean we don&#39;t fully enjoy and eat and watch &quot;too much&quot; at times of the &quot;bad&quot;<br/>\nstuff.<br/>\n<br/>\nThere&#39;s a self-righteousness about hating TV (or dairy or caffeine) that I<br/>\nconfess used to make me irritable (or maybe that was the caffeine &lt;g&gt;). I am<br/>\nlucky to have outgrown that reaction (unschooling cured me -- the<br/>\nself-righteousness of everyone who thinks and thought I was nuts acted as a<br/>\npsychiatric immersion).<br/>\n<br/>\nNow, that self-righteousness almost amuses me, because the picture people<br/>\npaint of television is that smart people either a) Don&#39;t watch it or b) Only<br/>\nwatch mentally stimulating, tasteful programming.<br/>\n<br/>\nI hate to break it to you, but I&#39;m pretty smart. Not a genius, but I can<br/>\nhold my own. So are my daughters, and my husband&#39;s not bad for a guy &lt;g&gt;. We<br/>\nread books (well, the girls aren&#39;t reading yet, but they beg to be read to).<br/>\n<br/>\nWe eat what we want and it balances out (there are two HUGE buckets of<br/>\nleftover Halloween candy downstairs, right now, on the rolling table, that<br/>\nhave gone down very little since October 31. Soon I&#39;ll have to throw them<br/>\nout just to make room for the pretty Christmas candy I like to keep around<br/>\nafter Thanksgiving.) What did my daughter ask for for dinner? Salad. If my<br/>\ndaughter ever really did eat nothing but celery and peanut butter I&#39;m<br/>\nconfident I&#39;d notice it and be paying attention to what the problem REALLY<br/>\nwas before she was suffering from malnutrition. For a child to behave in<br/>\nsuch a bizarre fashion, presuming she was given options, will show up in<br/>\nmany ways besides diet.<br/>\n<br/>\nI don&#39;t have a lot of goals for myself or my children, outside doing what<br/>\nmakes us happy. People who are happy tend to eat well, monitor their own<br/>\nactivities, learn, think, grow. They don&#39;t tend to be malnourished or do<br/>\nabsolutely nothing but watch TV or fail to learn how to read (in a reading<br/>\nhousehold), or drink Clorox or play on the freeway or not think or not grow.<br/>\n<br/>\nThere are plenty of parents who are invested in thinking they have to<br/>\ncontrol diet or television or education. Some people think we are all doing<br/>\nour children a huge disservice by not sending them to school. It&#39;s not fake,<br/>\nsome really do believe that.<br/>\n<br/>\nThe wonderful thing about lists like this is that people reading, who are<br/>\nundecided, can (and will, the little devils) make up their own minds about<br/>\nit. I used to fret over those people reading viewpoints that I found crazed<br/>\nand bad for children. I don&#39;t anymore. People are going to believe what<br/>\nthey&#39;re going to believe, do what is comfortable for them to wrap their<br/>\nbrains around. If someone out there wants to believe that a healthy, happy<br/>\nchild really DOES eat nothing but celery and peanut butter until her life is<br/>\nin danger, I have the maturity to bear up, even if I don&#39;t like the<br/>\nunnecessary control they then place on their kids, and even if I&#39;m still<br/>\ncompelled to say so.<br/>\n<br/>\nPam, who should also just come right out of the closet and admit to liking<br/>\nromance novels.</div>","specialLinks":[]}],"prevTopicId":27657,"nextTopicId":27538}}