{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Covert","from":"Covert &lt;covert@...&gt;","replyTo":"LIST","senderId":"GdANAYCyexMmfzS1IHvP-fdj-LWihLUdztEYD2AbiATRZHtYWqVAoeganCUfecp80sAA5NOQn5FBGBxkahvUFeG1N86q-Q","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Japan news: &quot;Classroom breakdown&quot;","postDate":"971773027","msgId":13686,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDAxMDE3MDg1Ni5SQUEyMjI2MUBzbXRwMi5kdGkubmUuanA+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":13685,"nextInTime":13687,"topicId":13686,"numMessagesInTopic":0,"msgSnippet":"Hi everybody, Here s a story that ran a few days ago in a major Japanese paper on that all-too-frequent phenomenon known in Japan as *gakkyu hokai*, or ","messageBody":"<div id=\"ygrps-yiv-341703177\">Hi everybody,<br/>\n<br/>\nHere&#39;s a story that ran a few days ago in a major Japanese paper on that <br/>\nall-too-frequent phenomenon known in Japan as *gakkyu hokai*, or <br/>\nbreakdown of order in school classrooms.<br/>\n<br/>\nThe following article covers a seminar on this issue that was recently <br/>\nheld in Tokyo, and touches upon how other countries have dealt with -- or <br/>\nnot dealt with -- classroom breakdown on their own home turfs.<br/>\n<br/>\nRegards,<br/>\n<br/>\nBrian Covert<br/>\n(KnoK NEWS)<br/>\nOsaka, Japan<br/>\n<br/>\n---------------------------<br/>\n<br/>\n <br/>\nAsahi Evening News - 14 October 2000<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.asahi.com/english/asahi/1014/asahi101408.html\">http://www.asahi.com/english/asahi/1014/asahi101408.html</a><br/>\n<br/>\n<br/>\nSTUDENTS NEED AN OUTLET FOR THEIR EMOTIONS<br/>\n<br/>\nThe problem of &#39;classroom breakdown&#39; is rooted<br/>\nin children&#39;s growing sense of powerlessness,<br/>\nsay education experts.<br/>\n<br/>\n<br/>\nBy Kazue Suzuki<br/>\nAsahi Evening News<br/>\n<br/>\nGone are the days when teachers conducted lessons with confidence and <br/>\nstudents listened to them with respect.<br/>\n<br/>\nToday, many schoolteachers in Japan -- from elementary schools to high <br/>\nschools, in the city and countryside alike -- say that class management <br/>\nis more difficult, with some students walking out, resorting to violence <br/>\nor chatting among themselves during what are supposed to be study periods.<br/>\n<br/>\nThe phenomenon is so disturbing that it has even been given a name of its <br/>\nown: *gakkyu hokai* (classroom breakdown). <br/>\n<br/>\n&quot;Beyond Classroom Breakdown,&quot; an international symposium held on Sept. 22 <br/>\nin Tokyo, focused on this widespread problem.<br/>\n<br/>\nKarol DeFalco, a panelist from the United States, said: &quot;Rather than <br/>\ntrying to fit the children into a mold that suits our schools, (let&#39;s) <br/>\nthink about changing the schools to fit the needs of the students.&quot;<br/>\n<br/>\nDeFalco, who works to facilitate social development programs in New <br/>\nHaven, Connecticut, was addressing the 700 people who filled Tokyo&#39;s <br/>\nYurakucho Asahi Hall to capacity last month.<br/>\n<br/>\nChanging the curriculum to meet the students&#39; needs is exactly what <br/>\nDeFalco&#39;s team has been doing in New Haven -- a city of 130,000 people. <br/>\nTo cope with the problem of classroom disorder, the city&#39;s Board of <br/>\nEducation in the 1980s set up a special team to identify and tackle the <br/>\nunderlying causes.<br/>\n<br/>\n&quot;Behind the problem were changes in students&#39; attitudes and behavior,&quot; <br/>\nshe said. It took a year for the team -- consisting of 75 community <br/>\nmembers, including teachers, university professors, students and parents <br/>\n-- to identify why some students were behaving in ways that were holding <br/>\nback their academic and personal progress.<br/>\n<br/>\nThe study found that students rated poorly in self-awareness, stress <br/>\nmanagement, ability to control their impulses, problem-solving and <br/>\ncommunication skills. As these findings came to light, courses were <br/>\ndeveloped to fulfill their needs.<br/>\n<br/>\nPretend to be 6 years old<br/>\n<br/>\nThe new social skills course was first tested in DeFalco&#39;s class. &quot;For <br/>\nhalf a year, I gave up 45 minutes each day to teach social skills,&quot; she <br/>\nsaid. Changes in her students&#39; attitudes and improvement in academic <br/>\nperformances led to the course being extended to all the city&#39;s public <br/>\nschools. Now, said DeFalco, &quot;it&#39;s not a support program; it is part of <br/>\nthe curriculum from elementary school through high school.&quot;<br/>\n<br/>\nDeFalco asked audience members to imagine they were a class and she was <br/>\ntheir teacher, to give them a feel for how her classes work. Everyone was <br/>\nasked to pretend to be the 6-year-old boy who was the protagonist in the <br/>\nstory she read aloud.<br/>\n<br/>\n&quot;In this story he is going to share with you some of his feelings,&quot; she <br/>\nbegan.<br/>\n<br/>\n&quot;&#39;Yesterday, my class went on a trip to the nature center, and I was so <br/>\nexcited,&#39;&quot; she read, and asked the audience to show excitement on their <br/>\nfaces. As the story went on, her commands had them looking &quot;scared,&quot; <br/>\n&quot;embarrassed&quot; and &quot;relieved&quot; in turn.<br/>\n<br/>\nShe said that sharing feelings in this way helped students understand one <br/>\nanother better. In the actual class, &quot;facial expressions&quot; lessons are <br/>\nfollowed by homework assignments, sometimes with simple instructions such <br/>\nas: &quot;Look at other people&#39;s faces in the cafeteria.&quot;<br/>\n<br/>\nThese and other lessons are an everyday event throughout the school year, <br/>\nand through them children learn how to empathize and solve problems, she <br/>\nadded.<br/>\n<br/>\nAnother panelist -- Naoki Ogi, an education critic and former junior high <br/>\nschool teacher -- reported that one in six elementary schools in Tokyo <br/>\nfaces classroom breakdown, quoting a survey of 1,388 elementary schools.<br/>\n<br/>\nHaving visited hundreds of schools during the past seven years, he said <br/>\nhe had seen for himself that classroom breakdown was not only widespread <br/>\nbut complex in its causes.<br/>\n<br/>\n*Gakkyu hokai* first attracted media attention around 1996. But three <br/>\nyears earlier, Ogi had noticed that some Tokyo teachers were beginning to <br/>\nreport that &quot;panic boys,&quot; youths turning violent in class, were on the <br/>\nincrease.<br/>\n<br/>\nWith today&#39;s stressful social climate, he told the symposium, children <br/>\nare losing hope for their future.<br/>\n<br/>\nStill, Ogi was not completely pessimistic, telling his listeners: &quot;In the <br/>\ncoming century, classroom breakdown will provide an opportunity to <br/>\nrebuild adult-child relationships: they will be working as equal partners.<br/>\n<br/>\n&quot;If we apply this concept to the building of a school community, children <br/>\nwill be able to participate in actual school management.&quot;<br/>\n<br/>\nThe notion of &quot;children&#39;s active participation in class&quot; -- let alone <br/>\nschool management -- is not a present-day reality in the Republic of <br/>\nKorea (South Korea), according to another speaker, Yoon Chul-Kyoung, a <br/>\nresearcher with the Korea National Youth Development Institute.<br/>\n<br/>\nA government survey of classroom breakdown for which Yoon conducted <br/>\nresearch found that 60 percent of teachers at junior and senior high <br/>\nschools were thinking of quitting. Another striking discovery was that 67 <br/>\npercent of teachers said the most effective solution to class breakdown <br/>\nwas to give teachers more authority.<br/>\n<br/>\n&quot;Korean teachers&#39; tendency to cling to their authority will only make it <br/>\nharder to reach a solution,&quot; commented Yoon. &quot;We need to see things <br/>\nthrough children&#39;s eyes.<br/>\n<br/>\n&quot;Disorder in schools, having first surfaced among high school students in <br/>\n(South) Korea sometime in the 1990s, is now spreading to elementary <br/>\nschools,&quot; said Yoon.<br/>\n<br/>\nYoon also pointed to rigidity in the nation&#39;s curricula, lamenting: &quot;Most <br/>\nof our curricula are designed to make lessons a one-way street.&quot; But she <br/>\nvoiced the hope that Korean children, adopting a flexible approach, might <br/>\nreform the school environment.<br/>\n<br/>\n&quot;Opening the school&quot; is one solution, said Mayumi Ujioka, an editorial <br/>\nwriter for Asahi Shimbun who acted as a moderator of the symposium. <br/>\nPanelists also offered hints on reducing teachers&#39; stress levels and <br/>\nrevitalizing school communities.<br/>\n<br/>\nAsk parents to help out<br/>\n<br/>\nIkuo Komatsu, director of the Educational Management Research Department <br/>\nat Japan&#39;s National Institute for Educational Research, said that in <br/>\nBritain parents, schools and the community at large were cooperating <br/>\nclosely to restore order in the publicly funded school system.<br/>\n<br/>\n&quot;(In Britain) teachers protect their own rest time by hiring the parents <br/>\nto take care of children&#39;s safety,&quot; he said. He also advised: &quot;Trust in <br/>\nchildren&#39;s resilience.&quot;<br/>\n<br/>\nAkira Yoshida issued a challenge to those attending the session. Yoshida, <br/>\ndeputy director of pediatrics at the Japan Red Cross Wakayama Medical <br/>\nCenter, also heads a group called Kinokuni Kodomo Support Net, which <br/>\nfocuses on the well-being and education of the young.<br/>\n<br/>\n&quot;Why not ask ourselves, each of us, what we can do to overcome classroom <br/>\nbreakdown? Teachers, please ask for help and say: &#39;I have such and such <br/>\nproblems in my class but I can&#39;t solve them all by myself.&#39;<br/>\n<br/>\nParents, ask yourselves what sort of school you want for your children.&quot;<br/>\n<br/>\nOgi proposed that more than two teachers should be responsible for each <br/>\nclass at elementary school: &quot;Not only does this reduce the burden on each <br/>\nteacher but it gives the children the sense that many teachers are united <br/>\nin taking care of them.&quot;<br/>\n<br/>\nAmong those busy taking notes at the symposium was Shiro Yasuda, a <br/>\nretired principal from the town of Takahata, Yamagata Prefecture, three <br/>\nhours outside Tokyo on the Tohoku Shinkansen line. &quot;Schools in a <br/>\npeaceful, close-knit community like my town may soon be seeing classroom <br/>\nbreakdown, too. My sympathies are with teachers who can no longer provide <br/>\na traditional education,&quot; he told this reporter.<br/>\n<br/>\nYoshie Ishiwata, who teaches elementary school in the Tokyo suburb of <br/>\nHigashi Murayama, was struck by the U.S. educationist DeFalco&#39;s advice <br/>\nthat schools need to adapt to children&#39;s needs.<br/>\n<br/>\n&quot;I will think about what I can do here and now (toward that end),&quot; she <br/>\nsaid.<br/>\n<br/>\nHiroko Ichinose, a part-time teacher from Saitama Prefecture, said she <br/>\nliked the idea, advocated by many panelists, of schools calling on <br/>\n&quot;outside resources.&quot;<br/>\n<br/>\nBut she said there was a big stumbling block: &quot;In reality, it&#39;s not easy <br/>\nto discuss your classroom problems even with the teacher next door.&quot;<br/>\n<br/>\n<br/>\nCopyright 2000 Asahi Shimbun</div>","specialLinks":[]}],"prevTopicId":13685,"nextTopicId":13683}}