{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":231415297,"authorName":"chris ester","from":"chris ester &lt;chris.homeschool@...&gt;","profile":"chris_e_bear","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Kinder people, who would look at me","postDate":"1404792824","msgId":74510,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBTXVqbWR2YlN5VlVCS1ErNDFtOXU3S21zUGFyK01xYWF3T1JXPXhZRVlnaE1zN0J6Z0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PEMwMEU0NkZDLUNCNzMtNENGRS04MDQ4LTY3NkEyQUE3OEYyQ0BTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PEMwMEU0NkZDLUNCNzMtNENGRS04MDQ4LTY3NkEyQUE3OEYyQ0BTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":74509,"nextInTopic":0,"prevInTime":74509,"nextInTime":74512,"topicId":74509,"numMessagesInTopic":0,"msgSnippet":"... Pressure from others to take kids out of school if the kids are fine and the family is functioning is damaging to families.","messageBody":"<div id=\"ygrps-yiv-1001035385\"><blockquote><span title=\"ireply\"><div dir=\"ltr\"><div>&gt;&gt;&gt;&gt;&gt;&gt;Pressure from others to do things isn&#39;t helpful to natural learning. Pressure from others to take kids out of school if the kids are fine and the family is functioning is damaging to families.&lt;&lt;&lt;&lt;&lt;&lt;</div>\n </div></span></blockquote><div><br></div>Many years ago now, when I first started homeschooling I had friends who LOVED the idea of natural learning but decided to &quot;opt in&quot; (their words, not mine) to the local school system.  The mom was raised in a very religious household with missionary parents.  She was always in religious schools or in schools that her mother set up for the local population in one far off African nation or another.  Not all of these were happy memories.<div>\n<br></div><div>She and I had many uncomfortable conversations where she was explaining to me why her child would be better off in school.  I was rather clueless and at first was defensive because I thought that she was criticizing homeschooling.  Finally (before our friendship was ruined) I realized that my friend was feeling pressure from her family to protect her children from public schools, that they were either subtly or not so subtly telling her that the &quot;RIGHT&quot;thing to do would be to homeschool her children, which neither parent wanted to do for a host of reasons.  </div>\n<div><br></div><div>When I realized that we had been talking past each other, I apologized for having given her the impression that I thought her choices were not as good as mine.  I told her that in the end we must all do what is best for our family as it is, not as someone else thinks it should be or even as we might wish it to be.  It has been every bit of 13 years since we had that discussion and they moved to another state and we are not in touch very often, though we exchange brief letters about the latest changes around the holidays.  The whole family is wonderful and happy and their children have grown into amazing young adults that went to public schools.  Just as my kids are amazing young adults who didn&#39;t go to school.</div>\n<div>chris</div></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Kinder people, who would look at me","postDate":"1404791415","msgId":74509,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEMwMEU0NkZDLUNCNzMtNENGRS04MDQ4LTY3NkEyQUE3OEYyQ0BTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":74510,"prevInTime":74508,"nextInTime":74510,"topicId":74509,"numMessagesInTopic":0,"msgSnippet":"I came across this in commentary on someone else s blog, from 2011. It s my writing, but I hadn t saved it, so I m bringing it here. The topic of the blog post","messageBody":"<div id=\"ygrps-yiv-1823865940\">I came across this in commentary on someone else&#39;s blog, from 2011. It&#39;s my writing, but I hadn&#39;t saved it, so I&#39;m bringing it here.  <br/>\nThe topic of the blog post was that it&#39;s a lie homeschoolers tell, that homeschooling isn&#39;t for everyone—that it IS.  <br/>\n<br/>\nMost of my response:<br/>\n________<br/>\nI&#39;ve been helping unschoolers for 20 years now, and unschooling isn&#39;t for all homeschoolers.<br/>\n<br/>\nPressure from others to do things isn&#39;t helpful to natural learning. Pressure from others to take kids out of school if the kids are fine and the family is functioning is damaging to families. We had fundamentalist Christian neighbors when my kids were young who went to a church where homeschooling was considered virtuous and Godly. The mom did NOT want to homeschool, but she felt no choice. That family ended up divorced and scattered and the kids very unhappy, while our godless family is still together.<br/>\n<br/>\nPeople who learn to see their options and choices will live with an increasingly healthy awareness of why they are choosing their actions, words and thoughts.<br/>\n<br/>\nFor me, as a child, homeschooling would not have been good. I needed to get away from my mean alcoholic mother as much as I could, and school was a place where there were kinder people, sober people, who read books and had travelled and who could look at me and talk to me without shaming or scaring me. I learned to be a better parent by having adults in my life other than my own parents. (My dad was sweet, but working and watching TV more than interacting with us.)<br/>\n<br/>\n____________<br/>\n<br/>\nThe date seems fictional.  I don&#39;t know what time it was, but the date was 11/11/11. :-)<br/>\n<br/>\nSome of the ideas seem worth looking at (by me, again, if not by others).<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":74494,"nextTopicId":74497}}