{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":1123183,"authorName":"DACunefare@aol.com","from":"DACunefare@...","profile":"undermom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: compliance with homeschooling laws","postDate":"1218989439","msgId":37166,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGMwMi40MGEyM2MxNC4zNWQ5YTc3ZkBhb2wuY29tPg=="},"prevInTopic":37149,"nextInTopic":0,"prevInTime":37165,"nextInTime":37167,"topicId":37145,"numMessagesInTopic":0,"msgSnippet":"When Mike was retiring from the Navy and looking for a new job I gave him a short list of states I would only consent to move to if we if we absolutely had no","messageBody":"<div id=\"ygrps-yiv-1046730940\">When Mike was retiring from the Navy and looking for a new job I gave him a <br/>\nshort list of states I would only consent to move to if we if we absolutely had <br/>\nno other options. It was solely based on those states having homeschooling <br/>\nlaws or regulations that I would find it impossible to comply with in good <br/>\nfaith. Our youngest kids were 3 years old at the time and I just couldn&#39;t get <br/>\nenthusiastic about a decade or more of being an outlaw. <br/>\n<br/>\nDeborah in IL<br/>\n<br/>\n<br/>\n**************<br/>\nLooking for a car that&#39;s sporty, fun and fits in <br/>\nyour budget? Read reviews on AOL Autos.<br/>\n      <br/>\n(<a rel=\"nofollow\" target=\"_blank\" href=\"http://autos.aol.com/cars-Volkswagen-Jetta-2009/expert-review?ncid=aolaut00030000000007\">http://autos.aol.com/cars-Volkswagen-Jetta-2009/expert-review?ncid=aolaut00030000000007</a> )<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":143043046,"authorName":"Ed Wendell","from":"&quot;Ed Wendell&quot; &lt;ewendell@...&gt;","profile":"zelco123","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] compliance with homeschooling laws","postDate":"1218900519","msgId":37149,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE2RTk1REJDRDhEOTRCQTlCNzBEN0RFRkQ4QTcxRDVFQEVkUEM+","inReplyToHeader":"PDIwMDgwODE1MjM1NDMxLklFVjNELjIwNzk3NS5yb290QGZlcHdlYjE2Pg==","referencesHeader":"PDIwMDgwODE1MjM1NDMxLklFVjNELjIwNzk3NS5yb290QGZlcHdlYjE2Pg=="},"prevInTopic":37148,"nextInTopic":37166,"prevInTime":37148,"nextInTime":37150,"topicId":37145,"numMessagesInTopic":0,"msgSnippet":"We tell what I call white lies about our homeschooling with people we know.  I have no idea if they know and can read between the lines or not.  They do not","messageBody":"<div id=\"ygrps-yiv-2145119388\">We tell what I call &quot;white lies&quot; about our homeschooling with people we know.  I have no idea if they know and can read between the lines or not.  They do not call me on it, so we let sleeping dogs lie ;)<br/>\n<br/>\nFor example everyone in our circle of influence knows that Ed (dad/hubby) is disabled and sick. So we always answer inquires into our homeschooling as &quot;We homeschool in the evenings when I get home from work&quot;  It is the truth as we never stop &quot;learning&quot; in our home but I know it is a &quot;white lie&quot; and misleading in that they assume it means we do school at home in the evenings.<br/>\n<br/>\nBut then they never ask why they never interupt our school at home - or ask about what we are studying - or curriculum - so maybe they are more savy than I give them credit for.  I do answer curriculum questions with a general comment of, we study what we are interested in.<br/>\n<br/>\n<br/>\nAs far as laws go we do not have to register - we just had to give a letter to the district stating we were homeschooling when we pulled Zac from school - which stopped the authorities from checking up on us.  We are supposed to keep detailed records and a protfolio in case we are ever asked for it (not much incentive there)  For a protfolio we do take pictures a lot and store them on disks, plus we keep what we can as far as tickets, fliers, programs, etc in a huge tub - I just throw everything in the tub together - the tub is full and it has been 5 years.  I date the fliers - for example we went to a cave this summer & I picked up one of their brochures/fliers and wrtoe the date on it and threw it in the tub.  We also write the big stuff on a calendar when we remember to.  But as far as recording every day how many minutes he spent on each subject doing which specific thing - no we do not - total waste of time in my opinion - it would amount to hours of recording and paper work - just in case the state ever asks for proof.  I do feel that if they did ever ask, they would not just knock on our door and ask for records that minute.  They would have to give due notice and I could then spend hours doing logs based upon the calendars and tub of stuff we have.  For our state the only people that I&#39;ve heard of going to court and &quot;getting in trouble&quot; are the ones involved in divorce, legal disputes of some type, one was a severely disabled child and the state ordered that child to go to school because the parents did not have adequate logs.  I figure that as long as we&#39;re flying under the radar they will leave us alone.<br/>\n<br/>\nSince Zac is 14 we do have discussions with him though.  He was also 8 1/2 when we pulled him from school so he was old enough to understand that sometimes it is better to just keep your mouth closed.  One time he made a comment to my sister about not doing any math - she lives 16 hours away and we were visiting about a year after we began homeschooling/unschooling - <br/>\nshe made a comment about what we work on in our schooling and he made a flip comment about how we don&#39;t do any math - she just looked at me and winked - she thought he was pulling her leg.  I later told him that relatives and most people do not understand what we are doing and to keep the stress out of our lives I&#39;d just as soon we keep it to ourselves for now.  That we did not need them deciding that they knew better than us and reporting us to the state and creating a legal mess.  We might have to get a lawyer which would make it impossible to spend money on the fun stuff, ect.<br/>\n<br/>\nZac knows we are suposed to keep this record/log and that we do not.  He knows we are suposed to spend so many hours per year on the core subjects and that we are doing it in our own unconventional way.  He also know not to go around bragging about it - because he has done this before.<br/>\n<br/>\nAlso we have discussions about where he goes and what he does - for ex:  he had some friends over - all teens and one was 18 - they wanted to visit some caves near us.  These caves are limestone caves that were made from mining therefore they are on private property.  I had a discussion with them about how it would look if a bunch of teens were there messing around instead of being in school - in other words flying under the radar / not drawing attention to oneself can be useful.<br/>\n<br/>\nThat said - I do know we are very luck that we live in a state that has such relaxed homeschooling laws.  Many are not so fortunate.<br/>\n<br/>\nLisa W.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":198239998,"authorName":"Joylyn","from":"Joylyn &lt;joylyn1@...&gt;","profile":"joylynrsf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] compliance with homeschooling laws","postDate":"1218858871","msgId":37148,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDgwODE1MjM1NDMxLklFVjNELjIwNzk3NS5yb290QGZlcHdlYjE2Pg==","inReplyToHeader":"PDFFQzE1NkJCLUMyMzYtNDJEQy1BQTFCLUExMzc0QzQyQjg2REBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":37147,"nextInTopic":37149,"prevInTime":37147,"nextInTime":37149,"topicId":37145,"numMessagesInTopic":0,"msgSnippet":"I registered (ie, filled out the form here in California) two years ago but not last year.  Then when Alexx wanted to take a class at the CC, they needed my","messageBody":"<div id=\"ygrps-yiv-1484957437\">I &quot;registered&quot; (ie, filled out the form here in California) two years ago but not last year.  Then when Alexx wanted to take a class at the CC, they needed my form, so I did it at that time.  This year I will complete the form in Oct, when required, as I am sure the college will ask for it.<br/>\n<br/>\nI break the law all the time, but I call it civil disobedience.  I drive over the speed limit, and I know if I get caught, I will get a ticket.  I allow the girls to sip my drink--wine, beer, etc.  Alexx has driven, in out of the way places.  I purposely violated a judge&#39;s direct order to allow my ex to have unsupervised visits with my children--he was a danger to the children and they did not want unsupervised visits, so I protected my children.  I may one day get in trouble for this, but I doubt it.  Protecting my children was more important than any judge&#39;s order.  I have also violated other laws.  Laws don&#39;t concern me--morality does.  I try to be a moral person, to treat others with respect, to treat others as I would like to be treated, and to be kind and gentle and fair and helpful and honest in all I say and do. (sounds like the girl scout promise and law--for a reason.)  My children have violated the law, and we talk about it and we talk about the possible consequences, and we make informed choices.  <br/>\n<br/>\nJoylyn</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] compliance with homeschooling laws","postDate":"1218840960","msgId":37147,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFFQzE1NkJCLUMyMzYtNDJEQy1BQTFCLUExMzc0QzQyQjg2REBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEY0OTc1MkI4RTQ2NTQ3OTVCRkM5NDRFMTg4RTc5RUEzQHdhbGRyb24wbnU4M2Y5Pg==","referencesHeader":"PGc4NG0xaysxMDJsNUBlR3JvdXBzLmNvbT4gPEY0OTc1MkI4RTQ2NTQ3OTVCRkM5NDRFMTg4RTc5RUEzQHdhbGRyb24wbnU4M2Y5Pg=="},"prevInTopic":37146,"nextInTopic":37148,"prevInTime":37146,"nextInTime":37148,"topicId":37145,"numMessagesInTopic":0,"msgSnippet":"-=-If Sandra doesn t want this discussed here I have a yahoo group set up for this but it has been quiet. Feel free to join and maybe we can get a good thread","messageBody":"<div id=\"ygrps-yiv-1377035367\">-=-If Sandra doesn&#39;t want this discussed here I have a yahoo group  <br/>\nset up for this but it has been quiet.<br/>\nFeel free to join and maybe we can get a good thread going.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/Freedom_in_Unschooling/\">http://groups.yahoo.com/group/Freedom_in_Unschooling/</a><br/>\n<br/>\n--------------------------------------------------<br/>\n<br/>\nEither way or both.<br/>\n<br/>\nThe question was asked in so general a way that it seems we can  <br/>\ndiscuss it philosophically.<br/>\n<br/>\nI have a couple of insights in general, in theory, and I&#39;ll come back  <br/>\nto those later, because I need to reboot my computer and reshoe my  <br/>\nfeet.  I&#39;ve been up cooking and my feet are really tired, and I was  <br/>\ndownloading something and it&#39;s ready.<br/>\n<br/>\n<br/>\n<br/>\nBUT THIS:<br/>\n<br/>\n-=-But I would love to hear how others handle their homeschooling  <br/>\nlaws... and if they don&#39;t register, what they tell their kids.-=-<br/>\n<br/>\nI registered, years ago.  Holly has never been registered.  I just  <br/>\ntold them &quot;I&#39;ll register if we have to, but right now you&#39;re not  <br/>\nregistered, so stay out of trouble.&quot;  But a few times when I needed  <br/>\nto show I was unschooling, I would show something I had published.  I  <br/>\nmust be an unschooler if I have articles published saying I am. &lt;g&gt;<br/>\n<br/>\nA few times I took an &quot;educator&#39;s discount,&quot; but I would rather let  <br/>\nthat go than argue with a store, and much rather let that go than to  <br/>\nregister.  And anyway, where I am they don&#39;t give you a registration  <br/>\ncard or anything anyway.<br/>\n<br/>\n<br/>\n<br/>\nIn discussing this, because we&#39;re discussing disregard for a law and  <br/>\nthat can be touchy, I want everyone to think of three things they  <br/>\nhave done that are illegal.   You don&#39;t have to confess them.  You  <br/>\ndon&#39;t have to write them down.  But try to put this in the context of  <br/>\nyour life.<br/>\n<br/>\nI don&#39;t know anyone who has ever reported taxes on what they earned  <br/>\nin a yard sale or in barter (maybe this just applies in the U.S., but  <br/>\nwe&#39;re supposed to report the value of what we gain in a trade as  <br/>\nincome).<br/>\n<br/>\nI don&#39;t always drive the speed limit.<br/>\n<br/>\nWe have had a non-running vehicle on our property in the City of  <br/>\nAlbuquerque.  (Not always the same vehicle, and the longterm one, we  <br/>\ngave to charity after a while.)  That violates the law here.<br/>\n<br/>\nOur pets do not have microchip identification.<br/>\n<br/>\nWe let Marty drink at Kirby&#39;s birthday party.  Most of the guests  <br/>\nwere 21 or older, but Marty wasn&#39;t.<br/>\n<br/>\n<br/>\n<br/>\nYou don&#39;t have to share your transgressions, but I&#39;m assuming  <br/>\neveryone draws the line somewhere.<br/>\n<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":265930215,"authorName":"Jason & Stephanie","from":"&quot;Jason & Stephanie&quot; &lt;jay_steph93@...&gt;","profile":"mom_to_kbcj","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] compliance with homeschooling laws","postDate":"1218832648","msgId":37146,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY0OTc1MkI4RTQ2NTQ3OTVCRkM5NDRFMTg4RTc5RUEzQHdhbGRyb24wbnU4M2Y5Pg==","referencesHeader":"PGc4NG0xaysxMDJsNUBlR3JvdXBzLmNvbT4="},"prevInTopic":37145,"nextInTopic":37147,"prevInTime":37145,"nextInTime":37147,"topicId":37145,"numMessagesInTopic":0,"msgSnippet":"If Sandra doesn t want this discussed here I have a yahoo group set up for this but it has been  quiet. Feel free to join and maybe we can get a good thread","messageBody":"<div id=\"ygrps-yiv-1849252535\">If Sandra doesn&#39;t want this discussed here I have a yahoo group set up for this but it has been  quiet.<br/>\n<br/>\n  Feel free to join and maybe we can get a good thread going. <br/>\n<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/Freedom_in_Unschooling/\">http://groups.yahoo.com/group/Freedom_in_Unschooling/</a><br/>\n<br/>\n  Stephanie in TN<br/>\n                                                                    <br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.learningthroughliving-stephanie.blogspot.com\">http://www.learningthroughliving-stephanie.blogspot.com</a><br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://familyrun.ning.com/profile/Stephanie\">http://familyrun.ning.com/profile/Stephanie</a><br/>\n<br/>\n  &quot;When you take the free will out of education, that turns it into schooling.&quot; -- John Taylor Gatto<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":130027733,"authorName":"Bea","from":"&quot;Bea&quot; &lt;bmantovani@...&gt;","profile":"bmantovani","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"compliance with homeschooling laws","postDate":"1218829172","msgId":37145,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGc4NG0xaysxMDJsNUBlR3JvdXBzLmNvbT4="},"prevInTopic":0,"nextInTopic":37146,"prevInTime":37144,"nextInTime":37146,"topicId":37145,"numMessagesInTopic":0,"msgSnippet":"Somebody in another discussion wrote: I m not abiding by the laws for homeschoolers in my state. Yes, it s against the law, yes, I could be fined and forced","messageBody":"<div id=\"ygrps-yiv-299867515\">Somebody in another discussion wrote:<br/>\n&quot;I&#39;m not abiding by the laws for homeschoolers in my state.<br/>\nYes, it&#39;s against the law, yes, I could be fined and forced to comply,<br/>\nbut I&#39;m making an informed choice. My kids are aware of that choice and<br/>\nunderstand why. One could say that I&#39;m lying to the state and setting<br/>\nan unhealthy precedent for my children, however I see it differently.<br/>\nI&#39;m practicing civil disobedience and not blindly following the law that<br/>\nI see as extremely wrong.&quot;<br/>\n<br/>\nI was wondering if we could discuss that?  (I don&#39;t know if it&#39;s okay<br/>\nto do so on this list,Sandra?)<br/>\n<br/>\nI recently moved to Quebec, where a lot of homeschoolers simply do not<br/>\nregister because some (if not most) school boards have very harsh<br/>\nhomeschool requirements.  Most of these &quot;under the radar&quot;<br/>\nhomeschoolers, though, are afraid that child protective services will<br/>\ncome knock on their doors (apparently it has happened, although I<br/>\ndon&#39;t know how often it does happen.)  My daughter will turn 3 next<br/>\nmonth, and doesn&#39;t have to be registered until the age of 7, so I have<br/>\nsome time to figure it out (or the law might change, or we might<br/>\nmove.) But I would love to hear how others handle their homeschooling<br/>\nlaws... and if they don&#39;t register, what they tell their kids.<br/>\n<br/>\nBea</div>","specialLinks":[]}],"prevTopicId":37150,"nextTopicId":37205}}