{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"connecting dots","postDate":"1097508982","msgId":100583,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGUxLjJkZmMyYWMuMmU5YzAyNzZAYW9sLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":100582,"nextInTime":100584,"topicId":100583,"numMessagesInTopic":0,"msgSnippet":"Marty and I went to Pecos, New Mexico yesterday for a tour of the Glorieta battlefield.  It was a van tour with a national parks volunteer, and we stopped five","messageBody":"<div id=\"ygrps-yiv-141306072\">Marty and I went to Pecos, New Mexico yesterday for a tour of the Glorieta <br/>\nbattlefield.  It was a van tour with a national parks volunteer, and we stopped <br/>\nfive places, where the soldiers had come and gone and met and run away over <br/>\nthree days&#39; time back then.  It was very cool.<br/>\n<br/>\nThe tourguide was glad to know more, and two things were brought up he hadn&#39;t <br/>\nthought of or known, and he told us a couple of things that aren&#39;t in books, <br/>\nand it was just altogether inspiring and fun.<br/>\n<br/>\nMarty and I have been planning to go to Silver City (far SW N.Mex) and I was <br/>\nlooking at websites of historical sites in that area, and in a page on a <br/>\nlittle town called Columbus, I found the following paragraph which I liked:<br/>\n<br/>\n-=- No write-up on Columbus  would be complete without a nod to Mrs. Susan <br/>\nParks Kendrick. On the morning of the famous raid, Mrs. Parks, a telephone <br/>\noperator in Columbus, called for help and alerted several residents of the danger <br/>\nfrom her switchboard. The switchboard is on display in the Columbus Museum, <br/>\nonly a few feet away from Pancho Villa&#39;s death mask -- two items one would never <br/>\nexpect to find in a room together. The distance between any two dissimilar <br/>\nobjects - like the border between two countries - can sometimes be remarkably <br/>\nthin. -=-<br/>\n<br/>\nThe author of that, David Pike, has a nice site on ghost towns in New Mexico. <br/>\n His writing style is sweet.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://kumo.swcp.com/nm/ghosts/ghosts.html\">http://kumo.swcp.com/nm/ghosts/ghosts.html</a><br/>\n<br/>\nBut that reminded me of the whole exercise Thinking Sticks involves, which is <br/>\ntying together disparate ideas.   <br/>\n<br/>\nI think we&#39;re going to go sooner than we had planned, because there&#39;s a <br/>\nhistorical reenactment in Shakespeare on October 23.<br/>\n<br/>\nI&#39;m really enjoying these times with Marty.   We were worried from the <br/>\nbeginning that he might feel very &quot;middle child&quot; in his life because Kirby&#39;s dynamic <br/>\nand Holly&#39;s cute and he&#39;s in the middle, and so by trying to remember to make <br/>\nMarty&#39;s life special, I&#39;m afraid sometimes he&#39;s going to leave the other two <br/>\nin the dust in a way or two.  Luckily Holly has no cowboy/19th century <br/>\ninterest, and Kirby has no touristish inclinations, so we can go without feeling <br/>\nguilty!  We invited Holly yesterday to the civil war tour, but she clearly wanted <br/>\nto stay home instead.  Ah, the virtue of offering and then hearing, &quot;I&#39;d <br/>\nrather not, but thanks for inviting me!&quot;<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":100567,"nextTopicId":100407}}