{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":55,"messages":[{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] husband not on unschooling train","postDate":"1278098458","msgId":55624,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg0NzM0MC4yMTIyOS5xbUB3ZWIxMTA0MDkubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PDA5NTkwMWNiMTljNSQxODFiNWZkMCQwNjBmYThjMEBHb256bz4=","referencesHeader":"PDA3ZGMwMWNiMThiNCQ4YmQwYWRjMCQwNjBmYThjMEBHb256bz4gPEMxNDdFODUwLTE0NkMtNDY3NC1BM0RGLTQ2MEYxQjhBNTJCRkBTYW5kcmFkb2RkLmNvbT4gPDA4NGQwMWNiMTkwZSRhZDU3N2U2MCQwNjBmYThjMEBHb256bz4gPDRCM0E5RTJCLTg4QjctNEQyMi1CRDk0LTVBOUFBNzdDRTVBMkBTYW5kcmFkb2RkLmNvbT4gPDA5NTkwMWNiMTljNSQxODFiNWZkMCQwNjBmYThjMEBHb256bz4="},"prevInTopic":55623,"nextInTopic":55625,"prevInTime":55623,"nextInTime":55625,"topicId":55561,"numMessagesInTopic":0,"msgSnippet":"*** We discussed the meaning of the words (controversial, it does say endowed by their Creator but we don t think they meant GOD in the sense that christians","messageBody":"<div id=\"ygrps-yiv-1850767632\">*** We discussed the meaning of the words<br/>\n(controversial, it does say &quot;endowed by their Creator&quot; but we don&#39;t think<br/>\nthey meant GOD in the sense that christians believe in god), and then Damon<br/>\nsaid something about gods and &quot;who is god?&quot; and asked if that was like<br/>\nPosidon and Zeus. So then we got sidetracked talking about Greek and Roman<br/>\ngods and Geoff and I took turns naming some and what powers they had. But<br/>\nthat didn&#39;t last long enough to look things up on the laptop, Damon kept<br/>\ntrying to get us to go play wii, which we eventually DID.***<br/>\n<br/>\nYou can talk about God the same way you talk about mythology.  When the Greeks and Romans believed in those gods, I&#39;m sure they didn&#39;t think of it as mythology, the same can be said for Christianity and the belief in a single deity.<br/>\n<br/>\nOne thing you could do, if you want to add to that conversation is get a really cool wall poster of Greek mythology.  Don&#39;t go to the library for books on it.  Our use of the library is more specific to pc games and movies, and while picking up those things, we may browse a bit.   <br/>\n<br/>\n***The next day we stopped at the library on the way home from a play date to<br/>\nfind some books on Mythology. But even though I told him why we were in<br/>\nthere, he didn&#39;t want to stay long enough to find a book and kept trying to<br/>\nget me to leave the library and go to the park next door.***<br/>\n<br/>\nKim, that&#39;s huge though, he went to the park and wanted to continue playing!  He wasn&#39;t desperately wanting to go home and play wii!  Perhaps you could have pretended to BE mythological gods while playing on the playground.  Find the learning in the playground.  What can a kid learn from playing in the playground?  <br/>\n<br/>\nLearning doesn&#39;t need to be in books.  You know that.  Is part of the bookishness defense for showing learning?  If that&#39;s the case, come at this from a different angle.  First graders don&#39;t read books all day.  They don&#39;t even do worksheets all day.  Those early elementary years are much more about inspired learning through doing things, and that doesn&#39;t change until about 3rd grade.  Third grade is the year that seems to the most problematic for kids, if they are going to have problems in school.  It&#39;s the most commonly stated grade that a parent pulls their kid out of, to homeschool.  <br/>\n<br/>\nHere&#39;s what you can do maybe; Everywhere you go and all that you do, really look for the learning in those moments.  Swings?  How about gravity and pendulums?  Mud?  What about biology, what lives in mud, or water cycles?  Where does that water go?  Anything that he seems interested in, pick up that cue, don&#39;t make it a learning lesson, but keep it light and conversational, an interest in the world around you.  Why is the sky blue?  Why are the clouds shaped like that?  What are those clouds called?  I wonder what speed that merry go round is going?  Is there a troll under that bridge?  What are trolls and where can I know more about them?  That can tie into mythology too, as trolls are a take on giants which are very prevalent in mythology, even in the bible there is a giant.  There are people who ARE giants.  We knew a woman at the Saturday Market that had a form of giantism, although, I know that&#39;s not really what it&#39;s called, can&#39;t think of the word.<br/>\n  <br/>\n<br/>\nThese are the things that you should document.  Don&#39;t discuss it with Damon, write it down somewhere the next time he&#39;s completely engaged in playing wii.  Take that list that Bob sent and plug it into one of those categories for grade one, check list it.  Keep doing that.  When you&#39;ve checklisted enough or lots, show your husband and then show him the next list you are going to work on.<br/>\n<br/>\n***Part of me wants to tell you all I have a challenging child, but I don&#39;t<br/>\nwant to think of him that way. Can I say he is a strong willed? He has a<br/>\nvery strong sense of SELF, he knows what he wants and does what he can to<br/>\nget it.***<br/>\n<br/>\nALL kids have their challenges!  Really!  Some kids are way easier to be with than others, and that&#39;s a lot to do with personality!  I can say, as an outsider looking in, that Damon has changed a lot in the last year, mellowed out a lot and communicates easier and calmer.  I watched him show Margaux how to play the wii and how to navigate the game.  I&#39;ve seen older kids try to do that and don&#39;t even come close to how articulate and patient he was and is, and all that it required was a &quot;whoa, wait up, help explain for a minute.&quot;  That&#39;s it, really!  He got it, just like that, and he&#39;s only 5!  I don&#39;t know many 5 yr olds that have that kind of patience and articulation to do that in the heat of a video game with the impending doom lurking around the corner.  I saw him snap out of frustration like and on/off switch.<br/>\n<br/>\n***Grandma came to visit a month ago and asked Damon what he wanted to do. He<br/>\nwanted a new wii game and said &quot;go to Gamestop.&quot; She was hoping for<br/>\nsomething else I think, so he said &quot;it&#39;s right next to Sushi Town! We can<br/>\nget lunch!&quot; knowing how she loves sushi.***<br/>\n<br/>\nSee?  Strategy and problem solving in the social realm!  <br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: husband not on unschooling train","postDate":"1278097941","msgId":55623,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRDMkUzQTE1LjIwNjAzMDVAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PEVCQzJGMDE2LUJEOTAtNDA5Ri04NTY1LTNDMkY1Qjk4N0IyMkBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGkwbDVkbyt2YW5vQGVHcm91cHMuY29tPiA8RUJDMkYwMTYtQkQ5MC00MDlGLTg1NjUtM0MyRjVCOTg3QjIyQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":55622,"nextInTopic":55624,"prevInTime":55622,"nextInTime":55624,"topicId":55561,"numMessagesInTopic":0,"msgSnippet":"... But, really, not in a I m pulling something over on my husband way. What Sandra described sounds like use one to me, but I guess not using it in the","messageBody":"<div id=\"ygrps-yiv-263257687\">On 7/2/2010 11:59 AM, Sandra Dodd wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; You said your husband said to get a curriculum, not to use one.<br/>\n<br/>\n </span></blockquote>But, really, not in a &quot;I&#39;m pulling something over on my husband&quot; way.<br/>\n<br/>\nWhat Sandra described sounds like &quot;use one&quot; to me, but I guess not using <br/>\nit in the way the curriculum manufacturer means. Use it as a source of <br/>\nideas.<br/>\n<br/>\nBut - I don&#39;t get the feeling that this particular dad is going to be <br/>\nsatisfied with that.<br/>\n<br/>\nYou could get the &quot;What Your X-Grader Should Know&quot; book for the <br/>\nappropriate grade level and say your plan is to use that book. If he <br/>\nlooks through it - it should satisfy him - it is based on the &quot;Core <br/>\nKnowledge Curriculum&quot; if that helps. And then you could read the book <br/>\nand just toss ideas out. Or, if dad requires more, your son could be <br/>\nasked to read a certain amount of the book each week or something.<br/>\n<br/>\nI don&#39;t want to post on this list about how not to unschool - and I&#39;ve <br/>\ngone farther already in that direction than I&#39;m comfortable with, in the <br/>\nabove paragraph.<br/>\n<br/>\nBut I think it is better to compromise and do some gentle homeschooling <br/>\nthan to battle his dad or to be disingenuous about what you are doing.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: husband not on unschooling train","postDate":"1278097147","msgId":55620,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVCQzJGMDE2LUJEOTAtNDA5Ri04NTY1LTNDMkY1Qjk4N0IyMkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGkwbDVkbyt2YW5vQGVHcm91cHMuY29tPg==","referencesHeader":"PGkwbDVkbyt2YW5vQGVHcm91cHMuY29tPg=="},"prevInTopic":55619,"nextInTopic":55622,"prevInTime":55619,"nextInTime":55621,"topicId":55561,"numMessagesInTopic":0,"msgSnippet":"-=-If you re struggling to see learning in something, ask here! Tell us what games he s playing and what he likes to do on the playground, what other fun","messageBody":"<div id=\"ygrps-yiv-765193581\">-=-If you&#39;re struggling to see learning in something, ask here! Tell  <br/>\nus what games he&#39;s playing and what he likes to do on the playground,  <br/>\nwhat other fun things he enjoys, and someone can help you turn that  <br/>\ninto something &quot;educational&quot; to show your family. -=-<br/>\n<br/>\nThere&#39;s this, too:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/seeingit\">http://sandradodd.com/seeingit</a><br/>\n<br/>\nYou said your husband said to get a curriculum, not to use one.<br/>\nI wasn&#39;t suggesting you follow a curriculum, but obtain one so that  <br/>\nyou can check that off your list.  Mess with it, don&#39;t &quot;use it&quot; or  <br/>\n&quot;follow it.&quot;  See what&#39;s in there, to get some ideas and to find some  <br/>\nreassurance.<br/>\n<br/>\nIf there&#39;s something in there you hadn&#39;t considered at all, then go  <br/>\ntoward that thing.  If he doesn&#39;t know his address and phone number by  <br/>\nmemory, maybe make up a little song about them, and when he knows that  <br/>\nsong, check it off the list.  If he doesn&#39;t know left from right, or  <br/>\ncan&#39;t balance on a curb, go play with that.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":330565882,"authorName":"LydiaL","from":"&quot;LydiaL&quot; &lt;princessjasmine05@...&gt;","profile":"lidjalynne05","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: husband not on unschooling train","postDate":"1278093197","msgId":55622,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkwbDkyZCsxMG1qM0BlR3JvdXBzLmNvbT4=","inReplyToHeader":"PDA5NTkwMWNiMTljNSQxODFiNWZkMCQwNjBmYThjMEBHb256bz4="},"prevInTopic":55620,"nextInTopic":55623,"prevInTime":55621,"nextInTime":55623,"topicId":55561,"numMessagesInTopic":0,"msgSnippet":"Hi Kim, I don t have much unschooling advice to give, b/c my kids are still toddlers.  I did have an idea about the library, though.  I don t go to the library","messageBody":"<div id=\"ygrps-yiv-1718515739\">Hi Kim, I don&#39;t have much unschooling advice to give, b/c my kids are still toddlers.  I did have an idea about the library, though.  I don&#39;t go to the library to browse the stacks anymore, it just doesn&#39;t work with two little ones.  I always search for books online and then request them, so I can just run in and pick them up and leave.  If the kids are interested, we can browse for books or other things they are interested in (one library has puppets, and things like that).  Maybe that will help.  I find it too stressful to be in the library when the kids don&#39;t want to be there.  <br/>\n<br/>\nLydia<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Kim Zerbe&quot; &lt;kim.zerbe@...&gt; wrote:<br/>\n&gt; The next day we stopped at the library on the way home from a play date to<br/>\n&gt; find some books on Mythology. But even though I told him why we were in<br/>\n&gt; there, he didn&#39;t want to stay long enough to find a book and kept trying to<br/>\n&gt; get me to leave the library and go to the park next door. (We had played at<br/>\n&gt; the park for an hour, I just wanted to get some books before the library<br/>\n&gt; closed! I said we could play more after!) I also wanted to get some books on<br/>\n&gt; CD and look at movies and possibly other types of books, but he disappears<br/>\n&gt; while I&#39;m in the stacks and would actually leave the library so I just got a<br/>\n&gt; couple (one drawn like a comic book!) and checked out. When I wanted to read<br/>\n&gt; him a story from that book last night, he said no way. He didn&#39;t want to<br/>\n&gt; hear any of those stories. </span></blockquote></div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] husband not on unschooling train","postDate":"1278091483","msgId":55619,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGlrNVRmRVREN1lFSXZLT3NpN3JLblRHU2VYdzMtbWhJMG5ZaWc2REBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDRDMkRGODkyLjMwODAxQGVhcnRobGluay5uZXQ+","referencesHeader":"PDA3ZGMwMWNiMThiNCQ4YmQwYWRjMCQwNjBmYThjMEBHb256bz4JPEMxNDdFODUwLTE0NkMtNDY3NC1BM0RGLTQ2MEYxQjhBNTJCRkBTYW5kcmFkb2RkLmNvbT4JPDA4NGQwMWNiMTkwZSRhZDU3N2U2MCQwNjBmYThjMEBHb256bz4JPDRCM0E5RTJCLTg4QjctNEQyMi1CRDk0LTVBOUFBNzdDRTVBMkBTYW5kcmFkb2RkLmNvbT4JPDA5NTkwMWNiMTljNSQxODFiNWZkMCQwNjBmYThjMEBHb256bz4JPDRDMkRGODkyLjMwODAxQGVhcnRobGluay5uZXQ+"},"prevInTopic":55617,"nextInTopic":55620,"prevInTime":55618,"nextInTime":55620,"topicId":55561,"numMessagesInTopic":0,"msgSnippet":"... I m really glad we ve been looking at unschooling as long as Brian and I have because we ve definitely gone through the above with Karl, together as well","messageBody":"<div id=\"ygrps-yiv-1625708899\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;The message you are sending out to him, loud and clear, &quot;Your interests aren&#39;t good enough.&quot;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>I&#39;m really glad we&#39;ve been looking at unschooling as long as Brian and<br/>\nI have because we&#39;ve definitely gone through the above with Karl,<br/>\ntogether as well as individually. Karl responded all kinds of ways to<br/>\nget us to stop. We did. (whew)<br/>\n<br/>\nSometimes a worry will crop up that nothing&#39;s going on with Karl. I<br/>\nworry that he isn&#39;t &quot;doing&quot; anything by watching walkthrough after<br/>\nwalkthrough. Brian worries that he&#39;s turning into a &quot;couch potato.&quot;<br/>\nBut that&#39;s not what&#39;s happening.<br/>\n<br/>\nSitting down with Karl as he shares what he&#39;s watching... the Paper<br/>\nMario playthrough (a lot of those lately) for instance, and oh my gosh<br/>\nthe reading he does with those as well as the accent he&#39;s hearing of<br/>\nthe guy who posted the Youtube, which he comments on and imitates<br/>\n(funnnnny). He knows how the numbering of episodes work in Youtube<br/>\n(really challenging if you don&#39;t know-- sometimes they&#39;re incomplete,<br/>\nor very out of order) and I know he&#39;s reading those because when he<br/>\ncan&#39;t find them, he gets me to do it. He wants to see it in order<br/>\nthroughout the game. So as I was sitting on the couch and he scrolled<br/>\ndown for the next one, I thought he may not know what it says but he<br/>\nis matching the letters. Well, he *is* matching the letters and often<br/>\nhe *does* know what it says or at least partly, like the game<br/>\ninstructions &quot;create new&quot; which at first he read as create now, and<br/>\nthen he corrected himself saying &quot;No, that&#39;s *new*.&quot; As he was<br/>\nthinking out loud (I&#39;m so lucky he does that).<br/>\n<br/>\nLet me stress that what Karl is learning has not been happening<br/>\novernight.  I&#39;ve seen his reading ability progress bit by bit since he<br/>\nwas 4. But the nice thing is that he&#39;s been interested the whole way<br/>\nthrough. He has played with Starfall as well as reading software such<br/>\nas Reader Rabbit once in a blue moon but other than that, not much<br/>\nthat resembles curriculum. However, reading is in all his vidgames and<br/>\nanywhere he goes online plus all over the place in our house and<br/>\noutside our house on billboards, street signs, stores. And Karl asks<br/>\nquestions about any and all those when his curiosity is piqued, which<br/>\nis pretty frequently but not constant. No, he is not reading small<br/>\neasy books. Yes, he sometimes lets me read out loud to him.<br/>\n<br/>\nI know he&#39;s learning all the time, that it doesn&#39;t look academic. And<br/>\nI&#39;m experiencing it as well as having learned it from other<br/>\nunschoolers, who say the same thing about their kids. So *I* know it<br/>\nboth ways and share what I know with Brian when I get a chance. That<br/>\nway, he gets frequent reassurance that Karl is doing well and also<br/>\nthat he&#39;s having fun. He likes knowing what Karl is into. Just in<br/>\nconversation. I just make sure I mention it. *I&#39;m* getting constant<br/>\nreassurance that Karl is learning. Sometimes I get lax about telling<br/>\nBrian and hear the worrying start again.<br/>\n<br/>\n~Katherine</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: husband not on unschooling train","postDate":"1278089464","msgId":55617,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkwbDVkbyt2YW5vQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGkwbDNscys2MGdnQGVHcm91cHMuY29tPg=="},"prevInTopic":55615,"nextInTopic":55619,"prevInTime":55616,"nextInTime":55618,"topicId":55561,"numMessagesInTopic":0,"msgSnippet":"... Woops, I forgot about the other issue, the husband and MIL part of the picture. Forget about learning in the sense of teaching - you ve really conflated","messageBody":"<div id=\"ygrps-yiv-2100234617\">&lt;plaidpanties666@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Try to forget about learning for awhile.<br/>\n<br/>\n </span></blockquote>Woops, I forgot about the other issue, the husband and MIL part of the picture. <br/>\n<br/>\nForget about learning in the sense of &quot;teaching&quot; - you&#39;ve really conflated the two so that you&#39;re seeing your son learning as a product of your words and offerings. Step back from that. Actively look at what He&#39;s doing and try to see learning happening. What&#39;s he learning playing those Wii games? What&#39;s he learning at the playground? Re-read that curriculum stuff at Sandra&#39;s site with the assumption that its all built after the fact, based on observation, rather than trying to project forward how you can create that curriculum. <br/>\n<br/>\nOnce you get a sense of the kinds of things and ways your guy really learns its easier to project forward and say &quot;he&#39;ll be learning about physics and math and history and language using these resources&quot; because those are things he&#39;s already doing.<br/>\n<br/>\nIf you&#39;re struggling to see learning in something, ask here! Tell us what games he&#39;s playing and what he likes to do on the playground, what other fun things he enjoys, and someone can help you turn that into something &quot;educational&quot; to show your family. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: husband not on unschooling train","postDate":"1278087676","msgId":55615,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkwbDNscys2MGdnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDA5NTkwMWNiMTljNSQxODFiNWZkMCQwNjBmYThjMEBHb256bz4="},"prevInTopic":55611,"nextInTopic":55617,"prevInTime":55614,"nextInTime":55616,"topicId":55561,"numMessagesInTopic":0,"msgSnippet":"... When Mo was younger she didn t like to hear a lot of words at a time and would shush me or anyone who exceeded her word limit . She s not really","messageBody":"<div id=\"ygrps-yiv-287509082\">&quot;Kim Zerbe&quot; &lt;kim.zerbe@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I often see him covering ears, walking away, saying he&#39;s not<br/>\n&gt; interested in that. I&#39;m feeling like that is his most common reaction, but I<br/>\n&gt; suspect I am wrong. Just today I said something in a &quot;did you know?&quot; sort of<br/>\n&gt; way and he asked more questions and said Cool. I probably need to pay more<br/>\n&gt; attention and realize there are those times too!<br/>\n<br/>\n </span></blockquote>When Mo was younger she didn&#39;t like to hear a lot of words at a time and would &quot;shush&quot; me or anyone who exceeded her &quot;word limit&quot;. She&#39;s not really non-verbal, but speech is probably her least favorite way to gain information. She&#39;d rather look or touch or do. I found tone of voice mattered a lot - if I was using a very very casual tone of voice she&#39;d accept more words, but it was like nine instead of four. That was hard for me, because I tend to be a little didactic in the way I communicate, but I learned to think hard about what I wanted to say and why I wanted to say it *and* pare everything down to a minimum number of words. <br/>\n<br/>\nWhen he covers his ears or even begins to look disinterested Stop Talking! Assume he&#39;s no longer listening and all he&#39;s hearing is &quot;Waa wa wa waaa.&quot; (Charlie Brown adult speech). Covering his ears is big, clear communication! Its up to you to &quot;listen&quot; to what he&#39;s &quot;saying&quot;. <br/>\n<br/>\n&quot;We talked about how a bunch of people wrote the<br/>\n<blockquote><span title=\"ireply\"> &gt; Declaration of Independence in 1776 and committed treason. Geoff said &quot;we<br/>\n&gt; hold these truths to be self-evident,&quot; and we both weren&#39;t totally sure what<br/>\n&gt; else was in there, so he got his laptop out and looked it up.&quot;<br/>\n<br/>\n </span></blockquote>Imagine you go out to eat with a couple friends and the spend the whole dinner talking about people you&#39;ve never met, doing things you don&#39;t much care about - that&#39;s likely how your ds felt hearing all that. He&#39;s not interested in chatting about a bunch of dead guys doing things that don&#39;t make sense to him. If he were to see a movie or play a game or read a story that mentioned those dead guys and/or what they were doing, he might become interested for a little while. That&#39;s something that happens a lot in unschooling - topics come up in the middle of doing other things. <br/>\n<br/>\nRecently Morgan asked me a question about the expression &quot;the British are coming&quot; that came up in some movie or other. I don&#39;t recall the details, but the movie had nothing to do with the American Revolution, it was a referential line. She wanted to know what it meant, so I told her that long ago the US had been at war with Great Britain. She was interested enough to ask why and we got into a conversation about colonization and revolution and the expansion of Europeans into North America which eventually led to a brief mention of the Trail of Tears because we live in Tennessee. It wasn&#39;t straight-forward and scholarly, it swirled around with reference to movies and songs, stories and pictures that have crossed Mo&#39;s path. I think we sang Yankee Doodle at some point, although that might have been a different conversation. That&#39;s what natural learning looks like a lot of times: topics swirl around one into the other and a box of mac-n-cheese leads you somewhere you never would have expected. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;He wanted to go play wii but he wanted us to go with<br/>\n&gt; him and we weren&#39;t finished eating.<br/>\n<br/>\n </span></blockquote>Could you have brought a plate into the other room? Or if not, at least chatted with him about his game, what level he was on, had he played the boss battle yet? Its like you deliberately excluded him from the conversation because he didn&#39;t have any interest in the subject. It&#39;s no less rude to shut someone out because he&#39;s a child.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;But even though I told him why we were in<br/>\n&gt; there, he didn&#39;t want to stay long enough to find a book and kept trying to<br/>\n&gt; get me to leave the library and go to the park next door.<br/>\n<br/>\n </span></blockquote>The library may not be the best resource for you right now, if your guy doesn&#39;t have the stamina for the place. It can be really rough on an active kid to deal with the waiting, the quiet, the stillness when all his muscles and senses are clamoring for more stimulation. I gave up on the library after Mo was scolded for doing the one thing she found she could do there that seemed to meet the rules of the place - read to other children. Looking at books for minutes and minutes and minutes was rough for her, but she could grab one off a table and walk up to some other child who wasn&#39;t happy to be in the library and offer a mutually beneficial solution. Since then I use the computer more to buy books. We&#39;ve gone to bookstores now and then with specific goals in mind, and as she&#39;s getting older Mo has a lot more interest in actually browsing the shelves herself, but at 5 it wasn&#39;t an option for her. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I don&#39;t know how else to DO this! We talk. We read. We look things up. I<br/>\n&gt; think I&#39;m continuing the topic by getting books at the library, but by the<br/>\n&gt; next day he&#39;s not interested any more?!<br/>\n<br/>\n </span></blockquote>You&#39;re missing a substantial piece of understanding as to how natural learning works. Ideas and topics swirl around naturally, there&#39;s no need to &quot;continue&quot; anything, unless your ds comes back and asks... and maybe asks again and again. Learning happens in moments of connection - five minutes about Greek gods may be more than enough, much less trying to bring the conversation back around to the subject a whole day later. Let the topic fall by the wayside and move on. If he&#39;s playing video games, there will be Plenty of other chances to talk about mythology, I promise you. <br/>\n<br/>\nHave you read Sandra&#39;s essay Moving a Puddle? <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/puddle\">http://sandradodd.com/puddle</a><br/>\n<br/>\nTry to forget about learning for awhile. Live and talk and play. If your dh likes to be didactic, find ways to share that with him that don&#39;t bore your other friend, your child-friend who has different interests than your dh. Maybe your son will come to share some of your dh&#39;s interests, but there&#39;s no guarantee. Ray&#39;s sort of the odd bird out in our family, with widely different interests than the rest of us, so Geoge and I stretch as much as we can to enjoy things with Ray, to value his interests because we value him, his company and his presence in our family. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] husband not on unschooling train","postDate":"1278081170","msgId":55611,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRDMkRGODkyLjMwODAxQGVhcnRobGluay5uZXQ+","inReplyToHeader":"PDA5NTkwMWNiMTljNSQxODFiNWZkMCQwNjBmYThjMEBHb256bz4=","referencesHeader":"PDA3ZGMwMWNiMThiNCQ4YmQwYWRjMCQwNjBmYThjMEBHb256bz4gPEMxNDdFODUwLTE0NkMtNDY3NC1BM0RGLTQ2MEYxQjhBNTJCRkBTYW5kcmFkb2RkLmNvbT4gPDA4NGQwMWNiMTkwZSRhZDU3N2U2MCQwNjBmYThjMEBHb256bz4gPDRCM0E5RTJCLTg4QjctNEQyMi1CRDk0LTVBOUFBNzdDRTVBMkBTYW5kcmFkb2RkLmNvbT4gPDA5NTkwMWNiMTljNSQxODFiNWZkMCQwNjBmYThjMEBHb256bz4="},"prevInTopic":55607,"nextInTopic":55615,"prevInTime":55610,"nextInTime":55612,"topicId":55561,"numMessagesInTopic":0,"msgSnippet":"... Kim - he sounds just absolutely fine, to me. YOU are pushing too hard, though, and that s why he s resistant. That dinnertime conversation your recounted","messageBody":"<div id=\"ygrps-yiv-1406907641\">On 7/2/2010 2:00 AM, Kim Zerbe wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Part of me wants to tell you all I have a challenging child, but I don&#39;t<br/>\n&gt; want to think of him that way. Can I say he is a strong willed? He has a<br/>\n&gt; very strong sense of SELF, he knows what he wants and does what he can to<br/>\n&gt; get it.<br/>\n<br/>\n </span></blockquote>Kim - he sounds just absolutely fine, to me. YOU are pushing too hard, <br/>\nthough, and that&#39;s why he&#39;s resistant. That dinnertime conversation your <br/>\nrecounted about the Declaration of Independence and Mythology, etc., was <br/>\nexhausting just to read. Too much all at once. AND too much pushing <br/>\nfollow-up on a kid who was only very casually interested in the first place.<br/>\n<br/>\nSeriously, 10 percent of all that would have been enough for a nice <br/>\ndinner conversation.<br/>\n<br/>\nYou (maybe because of your husband) come across as desperate to shove <br/>\nlearning down his throat.<br/>\n<br/>\nPoor kid just wants to go play on his Wii.<br/>\n<br/>\nRemember - unschooling means supporting HIS interests. Yes, introduce <br/>\nhim to the whole wide world. But don&#39;t force it - just lightly mention <br/>\nthings and then be super aware of hist interest level and don&#39;t <br/>\noverpower it.<br/>\n<br/>\nYour dinnertime conversation might have been better and more valuable if <br/>\nyou&#39;d all talked about what he&#39;s currently playing on the wii, instead <br/>\nof trying to shove history/government and mythology on him well past the <br/>\npoint of his very minimal interest level.<br/>\n<br/>\nThe message you are sending out to him, loud and clear, &quot;Your interests <br/>\naren&#39;t good enough.&quot;<br/>\n<br/>\nHe&#39;s going to start avoiding you and your husband because time spent <br/>\nwith you isn&#39;t pleasant.<br/>\n<br/>\nBecause your husband is not on board with unschooling, I really suggest <br/>\nyou get a very light program of some kind and let that be what <br/>\nsatisifies this urge you two have to make him learn. Then, the rest of <br/>\nthe time, you can relax and support his actual interests and have fun <br/>\ntogether without seeming so desperate.<br/>\n<br/>\nSandra mentioned Oak Meadow -- I think it requires a lot of parental <br/>\nwork and it is pretty extensive, I think you&#39;d spend a lot of time <br/>\nsetting up activities and then trying to make your son do them. I&#39;m <br/>\nthinking try to find something that takes a whole lot less time and effort.<br/>\n<br/>\nI also do not think the radical unschooling conferences are really a <br/>\nvery good place to take many doubting dads. The kids often appear out of <br/>\ncontrol, adults sometimes seem off-the-deep-end kind of crazy extremists <br/>\nand very possibly irresponsible. It can be off-putting to more <br/>\nconventional dads who really aren&#39;t looking to jump into some kind of <br/>\nnew tribe, but just want their kid to learn a lot and grow up into a <br/>\ncompetent and capable adult. I think the radical unschooling conferences <br/>\nare great for those seeking a deeper understanding of unschooling, but <br/>\nnot for those who are already resistant to it. Also, I think sometimes <br/>\none parent, usually mom, is really inspired by the conference - often <br/>\nthe sense of community appeals a lot, they are thrilled to find <br/>\nlike-minded people - and the other parent gets brought along <br/>\nunenthusiasticaly and shows up looking at it far more critically and <br/>\nfeels out of their element and uncomfortable. And wrong. And defensive.  <br/>\nNot the desired outcome.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] husband not on unschooling train","postDate":"1278076708","msgId":55607,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAyNjQ5Njc5LUI4MTYtNDBDQS1CODQ3LTNFRjIyMTk1Q0I0REBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDA5NTkwMWNiMTljNSQxODFiNWZkMCQwNjBmYThjMEBHb256bz4=","referencesHeader":"PDA3ZGMwMWNiMThiNCQ4YmQwYWRjMCQwNjBmYThjMEBHb256bz4gPEMxNDdFODUwLTE0NkMtNDY3NC1BM0RGLTQ2MEYxQjhBNTJCRkBTYW5kcmFkb2RkLmNvbT4gPDA4NGQwMWNiMTkwZSRhZDU3N2U2MCQwNjBmYThjMEBHb256bz4gPDRCM0E5RTJCLTg4QjctNEQyMi1CRDk0LTVBOUFBNzdDRTVBMkBTYW5kcmFkb2RkLmNvbT4gPDA5NTkwMWNiMTljNSQxODFiNWZkMCQwNjBmYThjMEBHb256bz4="},"prevInTopic":55606,"nextInTopic":55611,"prevInTime":55606,"nextInTime":55608,"topicId":55561,"numMessagesInTopic":0,"msgSnippet":"-=-My dominant impression is that Damon is turned off by ANYTHING resembling teaching.-=- I don t see a problem with that. -=- I often see him covering ears,","messageBody":"<div id=\"ygrps-yiv-654466665\">-=-My<br/>\ndominant impression is that Damon is turned off by ANYTHING resembling<br/>\nteaching.-=-<br/>\n<br/>\nI don&#39;t see a problem with that.<br/>\n<br/>\n-=- I often see him covering ears, walking away, saying he&#39;s not<br/>\ninterested in that. I&#39;m feeling like that is his most common reaction,  <br/>\nbut I<br/>\nsuspect I am wrong. Just today I said something in a &quot;did you know?&quot;  <br/>\nsort of<br/>\nway and he asked more questions and said Cool. I probably need to pay  <br/>\nmore<br/>\nattention and realize there are those times too!-=-<br/>\n<br/>\nAre you thinking of your &quot;did you know?&quot; conversation as teaching?   <br/>\n&quot;Those times too...&quot; makes me think you&#39;re seeing it as an exception  <br/>\nto the &quot;turned off by...teaching&quot; thought.<br/>\n<br/>\nA conversation should be a conversation.  If things are interesting  <br/>\nand new, there will be learning, probably on both sides.  Don&#39;t think  <br/>\nof those things as teaching.  Think of them as life.<br/>\n<br/>\n-=- We discussed the meaning of the words<br/>\n(controversial, it does say &quot;endowed by their Creator&quot; but we don&#39;t  <br/>\nthink<br/>\nthey meant GOD in the sense that christians believe in god), and then  <br/>\nDamon<br/>\nsaid something about gods and &quot;who is god?&quot; and asked if that was like<br/>\nPosidon and Zeus. So then we got sidetracked talking about Greek and  <br/>\nRoman<br/>\ngods and Geoff and I took turns naming some and what powers they had.  <br/>\nBut<br/>\nthat didn&#39;t last long enough to look things up on the laptop, Damon kept<br/>\ntrying to get us to go play wii, which we eventually DID. -=-<br/>\n<br/>\n-=-it does say &quot;endowed by their Creator&quot; but we don&#39;t think<br/>\nthey meant GOD in the sense that christians believe in god-=-<br/>\n<br/>\nBut they were all Christian.  I seriously doubt they meant anything  <br/>\nother than the Judeo-Christian God.<br/>\n<br/>\n-=-So then we got sidetracked ...-=-<br/>\n<br/>\nIf you think of Damon&#39;s questions as &quot;sidetracking,&quot; that suggests you  <br/>\nwanted to stay on the original topic.  That&#39;s teaching, not  <br/>\nconversations.  The best conversations sidetrack all over the place.<br/>\n<br/>\n-=- But that didn&#39;t last long enough to look things up on the  <br/>\nlaptop, ...-=-<br/>\n<br/>\nI&#39;m glad you&#39;re writing so much because others can help you see where  <br/>\nyou&#39;re missing your opportunities.<br/>\nNOTHING needs to &quot;last long enough&quot; for anything.  One question  <br/>\nanswered, to someone who actually cared (who asked, who was listening)  <br/>\nis plenty.  It doesn&#39;t need to &quot;stay on track&quot; or have a google- <br/>\nfollowup session.   When that happens, it&#39;s turning into &quot;a lesson,&quot;  <br/>\nand you&#39;ve already said he doesn&#39;t like lessons.<br/>\n<br/>\n-=-The next day we stopped at the library on the way home from a play  <br/>\ndate to<br/>\nfind some books on Mythology. But even though I told him why we were in<br/>\nthere, ...-=-<br/>\n<br/>\nMaybe BECAUSE you told him that&#39;s why you were there.<br/>\nYou had no reason to do that.  You have a laptop.  You could have  <br/>\nfound some cool site (the best of several you could have looked at  <br/>\nwithout ever calling him to see at all) and casually mention what&#39;s  <br/>\ncool about it (not &quot;Here is the answer to the question you asked the  <br/>\nother night when we were ignoring you about the Wii...&quot;).  Maybe he  <br/>\nwould want to look.<br/>\n<br/>\nOr better still, you could rent/buy/pull of the shelf the Disney  <br/>\nHercules, and NOT TALK ABOUT IT, just let it be what it is.  Or other  <br/>\nmovies about mythology.  Argonauts kinds of things.  There are stop- <br/>\nanimation things he might like.<br/>\n<br/>\n-=-(We had played at<br/>\nthe park for an hour, I just wanted to get some books before the library<br/>\nclosed! I said we could play more after!) I also wanted to get some  <br/>\nbooks on<br/>\nCD and look at movies and possibly other types of books, but he  <br/>\ndisappears<br/>\nwhile I&#39;m in the stacks and would actually leave the library so I just  <br/>\ngot a<br/>\ncouple (one drawn like a comic book!) and checked out. When I wanted  <br/>\nto read<br/>\nhim a story from that book last night, he said no way. He didn&#39;t want to<br/>\nhear any of those stories. -=-<br/>\n<br/>\nThose stories might have represented your greater interest in those  <br/>\nstories than in him.<br/>\nIt seems a determination to ignore what he wants in favor of what you  <br/>\nwant him to want.<br/>\n<br/>\n-=-We talk. We read. We look things up. -=-<br/>\n<br/>\nI don&#39;t think you should say &quot;we.&quot;<br/>\nYOU talk (too much, he&#39;s saying, if he&#39;s putting his fingers in his  <br/>\nears, covering his ears (both plainly reported by you in those words).<br/>\nYou&#39;re reading.  You even want to pretend to be reading aloud to  <br/>\nyourself in order to keep reading to him when he&#39;s begging you to stop.<br/>\nYou look things up when he would rather be at the park.<br/>\n<br/>\n-=-Part of me wants to tell you all I have a challenging child, but I  <br/>\ndon&#39;t<br/>\nwant to think of him that way. Can I say he is a strong willed? He has a<br/>\nvery strong sense of SELF, he knows what he wants and does what he can  <br/>\nto<br/>\nget it.-=-<br/>\n<br/>\nA strong sense of self is good.<br/>\nYou seem to be trying to mold him into a different child, who comes  <br/>\nand sits by you while you stay on track with something he&#39;s not  <br/>\ninterested in, rather than following him to the park or the Wii and  <br/>\nonly answering the questions he asks.  Those things WILL lead to other  <br/>\nthings, but I think he has a challenging mother, who is strong willed  <br/>\nand knows what she wants.  But what you want isn&#39;t leading toward  <br/>\nunschooling.  It&#39;s leading toward a child with fingers in his ears,  <br/>\nleaving the library without you, whose dad is worried that things  <br/>\naren&#39;t working.<br/>\n<br/>\n-=-Grandma came to visit a month ago and asked Damon what he wanted to  <br/>\ndo. He<br/>\nwanted a new wii game and said &quot;go to Gamestop.&quot; She was hoping for<br/>\nsomething else I think, so he said &quot;it&#39;s right next to Sushi Town! We  <br/>\ncan<br/>\nget lunch!&quot; knowing how she loves sushi. She agreed, they ate sushi,  <br/>\nbought<br/>\nthe new game he wanted, then she wanted to do something different but he<br/>\njust wanted to go home and play his new game.-=-<br/>\n<br/>\nMaybe coach him next time, that Grandma has no interest in Wii and so  <br/>\nhe should not play it while she&#39;s there.<br/>\nMaybe you could think of something yourself to recommend that you know  <br/>\nwould work out better for both of them.  For us once it was miniature  <br/>\ngolf.  Another time it was the children&#39;s museum.  In those contexts,  <br/>\nour kids were able to impress their grandparents in such a way that it  <br/>\nwas going to take at least an hour anyway, so the grandparents were  <br/>\nable to really relax into the situation.<br/>\n<br/>\nThat doesn&#39;t work in either of the homes, nor at restaurants.  In  <br/>\nthose contexts there is critical impatience on both sides.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":183568025,"authorName":"Bob Collier","from":"&quot;Bob Collier&quot; &lt;bobcollier@...&gt;","profile":"quaussiebob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: husband not on unschooling train","postDate":"1278075644","msgId":55606,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkwa250cyttZGY5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDFGRTE2NEI3LUNBN0EtNEUwQS05NzhELTFFNjFFQTA3Mzc2MkBzdXBlbm4uY29tPg=="},"prevInTopic":55605,"nextInTopic":55607,"prevInTime":55605,"nextInTime":55607,"topicId":55561,"numMessagesInTopic":0,"msgSnippet":"... This is something I was looking at today: Free homeschool curriculum standards checklists through high school ","messageBody":"<div id=\"ygrps-yiv-1755543424\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Su Penn &lt;su@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; <br/>\n&gt; On Jun 30, 2010, at 8:30 PM, Kim Zerbe wrote:<br/>\n&gt; <br/>\n&gt; &gt; It&#39;s all about having a PLAN now. What is my plan for him? How will he learn<br/>\n&gt; &gt; reading and math? What lessons will I sign him up for? If I don&#39;t have a<br/>\n&gt; &gt; PLAN in place by the end of summer, Geoff says HE will enroll Damon in<br/>\n&gt; &gt; school!!!<br/>\n&gt; <br/>\n&gt; Then why not make a plan? Depending on what your husband is going to be comfortable with, it needn&#39;t be a full curriculum (though I saw Sandra mentioned Clonlara and Oak Meadow--I don&#39;t know a lot about Oak Meadow, but Clonlara I believe can be very flexible in working with families). I _always_ have a plan, because I&#39;m a planner, though mostly my plan consists of bringing stuff I think is cool into the house and from time to time bringing it to the kids&#39; notice in some way, or offering to do it with them. But even so, off the top of my head right now I could construct a &quot;curriculum&quot; around stuff we already have.<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>This is something I was looking at today:<br/>\n<br/>\nFree homeschool curriculum standards checklists through high school <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.examiner.com/x-10046-Unschooling-Examiner~y2009m7d31-Free-homeschool-curriculum-standards-checklists\">http://www.examiner.com/x-10046-Unschooling-Examiner~y2009m7d31-Free-homeschool-curriculum-standards-checklists</a><br/>\n<br/>\nPrintable checklists created using the World Book Encyclopedia Typical Course of Study curriculum standards and learning requirements for students across North America (P-12).<br/>\n<br/>\nStructured in terms of &quot;educational ideas&quot; but with plenty of room for creativity.<br/>\n<br/>\nBob</div>","specialLinks":[]},{"userId":336246301,"authorName":"NCMama","from":"&quot;NCMama&quot; &lt;dharmamama1@...&gt;","profile":"carenkh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Natural Learning WAS husband not on unschooling train","postDate":"1278072898","msgId":55605,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkwa2w4MitqM2gxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDA5NTkwMWNiMTljNSQxODFiNWZkMCQwNjBmYThjMEBHb256bz4="},"prevInTopic":55602,"nextInTopic":55606,"prevInTime":55604,"nextInTime":55606,"topicId":55561,"numMessagesInTopic":0,"msgSnippet":"-=-I don t know how else to DO this! We talk. We read. We look things up. I think I m continuing the topic by getting books at the library, but by the next day","messageBody":"<div id=\"ygrps-yiv-1059461843\">-=-I don&#39;t know how else to DO this! We talk. We read. We look things up. I think I&#39;m continuing the topic by getting books at the library, but by the next day he&#39;s not interested any more?!-=-<br/>\n<br/>\nIt sounds as though you expect natural learning to look like school learning - it doesn&#39;t, most of the time.<br/>\n<br/>\nThe way natural learning works is your son will pick up one piece of information from a conversation - let&#39;s use the example of the Declaration of Independence, what it is, what it means. So, you showed him the picture, he wanted to go play - BUT he has that bit of information, the picture, and the name &quot;Declaration of Independence&quot;, (even if he might not remember that in a later conversation), and that it has something to do with America&#39;s freedom, because of your prior conversation.<br/>\n<br/>\nIf he wants to move on, move on! But a few months later, he might see or hear something about it again, in a TV show, or in a book. Another tiny bit of information.<br/>\n<br/>\nSome time after that, another tiny bit of information - or, maybe a big chunk, like if he happens to see Schoolhouse Rock. (Don&#39;t get copies of Schoolhouse Rock, thinking &quot;THIS is how I&#39;ll get the information into him!&quot;)<br/>\n<br/>\nNatural learning happens... well, it happens naturally. In conversations and watching TV and playing with Bionicles and visits with Grandma. IF something sparks something in him, and he ASKS more about it, absolutely follow that interest. Or, if he doesn&#39;t mind a dash into the library to get videos and books, then grab them and go and have them available, but don&#39;t turn it into a lesson plan! Just have them around, and if he picks one up, he picks one up... but that&#39;s not MORE valuable than him picking up a Wii controller.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/strewing\">http://sandradodd.com/strewing</a><br/>\n<br/>\nHe will learn in what he&#39;s interested in learning, he will pick it up because of that interest - or, he&#39;ll pick it up in the course of his day, and after a couple of years, he&#39;ll surprise you by how much he knows about a certain subject. He might not have been that interested, but pieces of information got lodged in his brain as part of something else he was interested in.<br/>\n<br/>\nHere&#39;s a post from my poor neglected blog, about learning, if you&#39;re interested in further thoughts:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://openheartedlife.blogspot.com/2009/06/unschooling-meme.html\">http://openheartedlife.blogspot.com/2009/06/unschooling-meme.html</a><br/>\n<br/>\nIn our home, it has rarely looked like ONE &quot;subject&quot; being followed for a period of time. I&#39;m trying to remember if it&#39;s EVER looked like that... Oh, yeah, when we first started unschooling, Evan got interested in Australia, and he spent a fair amount of time reading books about it, watching videos, sending emails to a friend-of-a-friend who lived there. I wonder if we weren&#39;t deschooling, if it wouldn&#39;t have looked so much like a unit study? We didn&#39;t do anything he wasn&#39;t interested in...<br/>\n<br/>\nI&#39;m still guilty of occasionally getting TOO enthusiastic, when they ask questions. I&#39;ll start to google, and Seth (who sounds like Damon, in that he really resists being TAUGHT) will roll his eyes. I haven&#39;t done that in a while, but I reckon I might again, because sometimes *I* want to know! I just remember to STOP when he reaches that point, and let. it. go.<br/>\n<br/>\n-=-Do I read anyway when we go to bed?-=-<br/>\n<br/>\nIn a word, NO! Read what he wants. Don&#39;t make bedtime into a lesson! (Don&#39;t make ANYthing into a lesson!) Offer those books, but don&#39;t be hurt or worried if he declines. Offer them because you know he&#39;ll love the story, not because he&#39;ll learn something. Learning happens, you can&#39;t stop it from happening. You CAN become devalued as a source if he thinks you&#39;ll keep steamrolling over him with YOUR agenda.<br/>\n<br/>\n-=-I am interested myself in these stories, I could read to me and see if he wants to listen.-=- <br/>\nDo you normally read aloud to yourself? Read them if you&#39;re interested, don&#39;t make a show about it. If they have cool pictures, and YOU find it cool, and think he might find it cool, show him. Just, &quot;Isn&#39;t this cool?&quot; Not with the intention of drawing him in, but with the intention of sharing something you think he&#39;ll enjoy. Actually, maybe take some time from doing THAT, if he&#39;s sticking his fingers in his ears. Take a sabbatical from anything that looks like you&#39;re pushing facts and information AT him.<br/>\n<br/>\npeace,<br/>\nCaren</div>","specialLinks":[]},{"userId":208961162,"authorName":"Kim Zerbe","from":"&quot;Kim Zerbe&quot; &lt;kim.zerbe@...&gt;","profile":"zerbe2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] husband not on unschooling train","postDate":"1278061259","msgId":55602,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA5NTkwMWNiMTljNSQxODFiNWZkMCQwNjBmYThjMEBHb256bz4=","inReplyToHeader":"PDRCM0E5RTJCLTg4QjctNEQyMi1CRDk0LTVBOUFBNzdDRTVBMkBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDA3ZGMwMWNiMThiNCQ4YmQwYWRjMCQwNjBmYThjMEBHb256bz4gPEMxNDdFODUwLTE0NkMtNDY3NC1BM0RGLTQ2MEYxQjhBNTJCRkBTYW5kcmFkb2RkLmNvbT4gPDA4NGQwMWNiMTkwZSRhZDU3N2U2MCQwNjBmYThjMEBHb256bz4gPDRCM0E5RTJCLTg4QjctNEQyMi1CRDk0LTVBOUFBNzdDRTVBMkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":55590,"nextInTopic":55605,"prevInTime":55601,"nextInTime":55603,"topicId":55561,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1593549893\">&lt;&lt;&lt; Don&#39;t ever teach him anything. If he&#39;s covering his ears, you are doing<br/>\nsomething wrong. <br/>\nIf Damon is &quot;acting bored&quot; he&#39;s communicating with you. Don&#39;t discount that.<br/>\nHe&#39;s not acting bored. He *is* bored.&gt;&gt;&gt; <br/>\n <br/>\nI know! This bothers me! I&#39;m trying to pay more attention lately. I hope I<br/>\nam wrong about how often he responds this way, maybe I&#39;m a bit down on<br/>\nmyself for not doing the right things or just not doing &quot;enough&quot; as in fun,<br/>\nsparkly, amazing things that would engage and encourage learning. My<br/>\ndominant impression is that Damon is turned off by ANYTHING resembling<br/>\nteaching. I often see him covering ears, walking away, saying he&#39;s not<br/>\ninterested in that. I&#39;m feeling like that is his most common reaction, but I<br/>\nsuspect I am wrong. Just today I said something in a &quot;did you know?&quot; sort of<br/>\nway and he asked more questions and said Cool. I probably need to pay more<br/>\nattention and realize there are those times too!<br/>\n<br/>\n&lt;&lt;&lt; If Geoff is &quot;sharing facts&quot; that&#39;s not conversational. He should speak<br/>\nto your son the way he would to a new friend. &gt;&gt;&gt; <br/>\n <br/>\nThat IS the way he would speak to a friend! Here&#39;s how that looks... So the<br/>\nother night at dinner we were talking about the 4th of July and how it&#39;s the<br/>\nbirthday of America and what that means. Geoff and I were talking, Damon was<br/>\neating and maybe listening. We talked about how a bunch of people wrote the<br/>\nDeclaration of Independence in 1776 and committed treason. Geoff said &quot;we<br/>\nhold these truths to be self-evident,&quot; and we both weren&#39;t totally sure what<br/>\nelse was in there, so he got his laptop out and looked it up. That led to<br/>\nhim reading the DoI and showing Damon a photo of the Declaration and how<br/>\nJohn Hancock&#39;s name is really big and how that meant that he wanted to make<br/>\nsure the King of England could read it. Damon did look at it, but said he<br/>\nwanted to go play wii. He walked around the kitchen (he does that during<br/>\nmeals, he&#39;s a grazer). He wanted to go play wii but he wanted us to go with<br/>\nhim and we weren&#39;t finished eating. We discussed the meaning of the words<br/>\n(controversial, it does say &quot;endowed by their Creator&quot; but we don&#39;t think<br/>\nthey meant GOD in the sense that christians believe in god), and then Damon<br/>\nsaid something about gods and &quot;who is god?&quot; and asked if that was like<br/>\nPosidon and Zeus. So then we got sidetracked talking about Greek and Roman<br/>\ngods and Geoff and I took turns naming some and what powers they had. But<br/>\nthat didn&#39;t last long enough to look things up on the laptop, Damon kept<br/>\ntrying to get us to go play wii, which we eventually DID. <br/>\n <br/>\nThe next day we stopped at the library on the way home from a play date to<br/>\nfind some books on Mythology. But even though I told him why we were in<br/>\nthere, he didn&#39;t want to stay long enough to find a book and kept trying to<br/>\nget me to leave the library and go to the park next door. (We had played at<br/>\nthe park for an hour, I just wanted to get some books before the library<br/>\nclosed! I said we could play more after!) I also wanted to get some books on<br/>\nCD and look at movies and possibly other types of books, but he disappears<br/>\nwhile I&#39;m in the stacks and would actually leave the library so I just got a<br/>\ncouple (one drawn like a comic book!) and checked out. When I wanted to read<br/>\nhim a story from that book last night, he said no way. He didn&#39;t want to<br/>\nhear any of those stories. <br/>\n<br/>\n&lt;&lt;&lt; I&#39;m glad you told that story, because it might be key to the problems.<br/>\nMaybe you&#39;ve missed the mark on unschooling, as to HOW kids learn in a<br/>\nnatural way from the real world, and what you can do to help prime that<br/>\npump. &gt;&gt;&gt;<br/>\n <br/>\nI don&#39;t know how else to DO this! We talk. We read. We look things up. I<br/>\nthink I&#39;m continuing the topic by getting books at the library, but by the<br/>\nnext day he&#39;s not interested any more?! Do I read anyway when we go to bed?<br/>\nI am interested myself in these stories, I could read to me and see if he<br/>\nwants to listen. He&#39;s equally likely to stick his fingers in his ears and<br/>\nsing nonsense as he is to snuggle up and be interested. <br/>\n <br/>\nPart of me wants to tell you all I have a challenging child, but I don&#39;t<br/>\nwant to think of him that way. Can I say he is a strong willed? He has a<br/>\nvery strong sense of SELF, he knows what he wants and does what he can to<br/>\nget it.<br/>\n <br/>\nGrandma came to visit a month ago and asked Damon what he wanted to do. He<br/>\nwanted a new wii game and said &quot;go to Gamestop.&quot; She was hoping for<br/>\nsomething else I think, so he said &quot;it&#39;s right next to Sushi Town! We can<br/>\nget lunch!&quot; knowing how she loves sushi. She agreed, they ate sushi, bought<br/>\nthe new game he wanted, then she wanted to do something different but he<br/>\njust wanted to go home and play his new game.<br/>\n <br/>\nI&#39;m also realizing that Damon does enjoy things outside the house, it&#39;s just<br/>\nthe getting him out that seems hard. I know he needs time for transition,<br/>\nwarning. Sometimes it helps to talk up the event, sometimes that doesn&#39;t<br/>\nhelp. Most often he has a good time where we go, but sometimes not and on<br/>\nthose times he&#39;ll keep saying he wants to go home until we go home and<br/>\nforget about stopping anywhere on the way home. Anyway, I should start a<br/>\njournal or blog and see if I can track things like that. <br/>\n <br/>\nKim in oregon<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] husband not on unschooling train","postDate":"1278019781","msgId":55590,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGlsRDRwczFaRkx5WlUtRllXVHVWVmwtdnFiVXh3eHl3ZU1LNVpUcUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDRCM0E5RTJCLTg4QjctNEQyMi1CRDk0LTVBOUFBNzdDRTVBMkBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDA3ZGMwMWNiMThiNCQ4YmQwYWRjMCQwNjBmYThjMEBHb256bz4JPEMxNDdFODUwLTE0NkMtNDY3NC1BM0RGLTQ2MEYxQjhBNTJCRkBTYW5kcmFkb2RkLmNvbT4JPDA4NGQwMWNiMTkwZSRhZDU3N2U2MCQwNjBmYThjMEBHb256bz4JPDRCM0E5RTJCLTg4QjctNEQyMi1CRDk0LTVBOUFBNzdDRTVBMkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":55587,"nextInTopic":55602,"prevInTime":55589,"nextInTime":55591,"topicId":55561,"numMessagesInTopic":0,"msgSnippet":"Some people like to teach or share facts and maybe in combo with not as much social bent, it may (or may not) go well to say talk as though to a new friend.","messageBody":"<div id=\"ygrps-yiv-676975350\">Some people like to teach or share facts and maybe in combo with not<br/>\nas much social bent, it may (or may not) go well to say talk as though<br/>\nto a new friend. This is definitely true of Brian. I get the geek-out<br/>\nthing totally even though I can usually choose not to do it much<br/>\nmyself, but as to how to suggest not to do it to Karl without sounding<br/>\nlike criticism, I dunno. Any suggestions would be very welcome though.<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Thu, Jul 1, 2010 at 3:30 PM, Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; wrote:<br/>\n&gt; I&#39;m going to comment on some of the rest of it, but this jumped out:<br/>\n&gt;<br/>\n&gt; -=-I have all these ideas and<br/>\n&gt; aspirations and things I want to share with my son, but I don&#39;t want to<br/>\n&gt; force it or have it become unfun. He senses when I or his dad might be<br/>\n&gt; &quot;teaching&quot; him something and covers his ears! Geoff is a wealth of<br/>\n&gt; knowledge<br/>\n&gt; on many topics and always has interesting facts to share (I learn from<br/>\n&gt; him<br/>\n&gt; all the time!) but Damon tends to act bored. -=-<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Share that with your husband--by cut and paste if you need to.<br/>\n&gt;<br/>\n&gt; Don&#39;t ever teach him anything. If he&#39;s covering his ears, you are<br/>\n&gt; doing something wrong.<br/>\n&gt;<br/>\n&gt; If Geoff is &quot;sharing facts&quot; that&#39;s not conversational. He should<br/>\n&gt; speak to your son the way he would to a new friend.<br/>\n&gt;<br/>\n&gt; If Damon is &quot;acting bored&quot; he&#39;s communicating with you. Don&#39;t<br/>\n&gt; discount that. He&#39;s not acting bored. He *is* bored.<br/>\n&gt;<br/>\n&gt; I&#39;m glad you told that story, because it might be key to the<br/>\n&gt; problems.  Maybe you&#39;ve missed the mark on unschooling, as to HOW<br/>\n&gt; kids learn in a natural way from the real world, and what you can do<br/>\n&gt; to help prime that pump.<br/>\n&gt;<br/>\n&gt; Sandra<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ------------------------------------<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] husband not on unschooling train","postDate":"1278014851","msgId":55587,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk2QjVENjY1LUZEOTYtNDdENS1BNzc2LTFBOTJCOEVCRUVDOUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDA4NGQwMWNiMTkwZSRhZDU3N2U2MCQwNjBmYThjMEBHb256bz4=","referencesHeader":"PDA3ZGMwMWNiMThiNCQ4YmQwYWRjMCQwNjBmYThjMEBHb256bz4gPEMxNDdFODUwLTE0NkMtNDY3NC1BM0RGLTQ2MEYxQjhBNTJCRkBTYW5kcmFkb2RkLmNvbT4gPDA4NGQwMWNiMTkwZSRhZDU3N2U2MCQwNjBmYThjMEBHb256bz4="},"prevInTopic":55586,"nextInTopic":55590,"prevInTime":55586,"nextInTime":55588,"topicId":55561,"numMessagesInTopic":0,"msgSnippet":"-=-Did you keep a blog? **No, but I started one last June with that intent, I just never seem to find (ok, make) the time to update it! I take pictures all the","messageBody":"<div id=\"ygrps-yiv-416709500\">-=-Did you keep a blog?<br/>\n**No, but I started one last June with that intent, I just never seem to<br/>\nfind (ok, make) the time to update it! I take pictures all the time, I  <br/>\nhave<br/>\ntons of photographic evidence of things we&#39;ve been doing. -=-<br/>\n<br/>\nSo maybe because you have the experience AND the images in your head  <br/>\nyou assume your husband does too.  Community property doesn&#39;t cover  <br/>\nthoughts.   Keith and I  keep trying that, but it just doesn&#39;t work. :-)<br/>\n<br/>\n-=-I never said I would buy a curriculum. I fear it would be a waste of<br/>\nmoney. Apparently Geoff told his mom I was looking into it, trying to  <br/>\nfind a<br/>\ngood one, to get her off his back. But he forgot to tell me. -=-<br/>\n<br/>\nSee??  He thought it, but you didn&#39;t read his mind.  Darn that  <br/>\ncommunity property failure.<br/>\n<br/>\n-=-He has as much right to enroll your son in school as you have to keep<br/>\nhim out against your husband&#39;s will. In fact, he has MORE right to do<br/>\nthat than you do to homeschool, let alone unschooling.<br/>\n**I don&#39;t get why he would have MORE right than me. Do you mean if we  <br/>\nget<br/>\ndivorced and things get ugly? He could demand school? -=-<br/>\n<br/>\nThe default is school.<br/>\nThe law is school.<br/>\nThe cultural expectation is school.<br/>\n<br/>\nWhen you put some new idea, heard to understand, on the balance scale  <br/>\nwith default/law/culture, it will not put a dent in that balance.<br/>\n<br/>\n-=I get that, but in a<br/>\ndiscussion and trying to meet somewhere in the middle, there&#39;s no way  <br/>\nwe can<br/>\nboth get what we want, there must be compromise.-=-<br/>\n<br/>\nYou wrote &quot;I get that,&quot; but you don&#39;t know what it is, so I don&#39;t  <br/>\nthink you do get &quot;it.&quot;<br/>\nAnd you don&#39;t have to compromise. You need to agree.  Right now the  <br/>\nagreement is going to be about you making unschooling be impressive.   <br/>\nYou failed to do that last year, so you&#39;re making up for lost time and  <br/>\nopportunity.  No one should need to &quot;compromise&quot; with the fact that  <br/>\nyou didn&#39;t really get on it and create a sparkly, swirly unschooling  <br/>\nworld in all your lives.<br/>\n<br/>\nWhen people say or write &quot;I get that, but...&quot; or &quot;Yeah, but&quot; it sounds  <br/>\nlike they&#39;re saying &quot;hush,&quot; or &quot;stop.&quot;  Sometimes I think they&#39;re  <br/>\nsaying &quot;tell me what I&#39;m doing is fine and that other people are being  <br/>\nwrong/mean.&quot;  &quot;Yeah, but...&quot; isn&#39;t ever really relationship building.<br/>\n<br/>\nYou could practice on this list communicating in a way that isn&#39;t so  <br/>\ndefensive, if you want to.<br/>\n<br/>\n-=-I&#39;m sure it doesn&#39;t help that Damon has been telling people he is  <br/>\nwii-schooled.-=-<br/>\n<br/>\nProbably that doesn&#39;t help.<br/>\n<br/>\nMaybe you could get some educational-supply magazines sent to your  <br/>\nmom--some of the cool games catalogs or toys for genius kids or  <br/>\nwhatever, and she could buy things she thinks would be fun.  She would  <br/>\nbe involved then.  Or maybe the two of you could go to a museum gift  <br/>\nshop or fancy toy store and talk about what he likes, and how  <br/>\nexpensive such things are, and that just because something &quot;has  <br/>\npotential&quot; doesn&#39;t mean the child would be interested.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] husband not on unschooling train","postDate":"1278014633","msgId":55586,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRFQzVERkE5LTg0QUMtNDM4QS1BRUE3LTY0QkVCMkU2NDMwOEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDA4NGQwMWNiMTkwZSRhZDU3N2U2MCQwNjBmYThjMEBHb256bz4=","referencesHeader":"PDA3ZGMwMWNiMThiNCQ4YmQwYWRjMCQwNjBmYThjMEBHb256bz4gPEMxNDdFODUwLTE0NkMtNDY3NC1BM0RGLTQ2MEYxQjhBNTJCRkBTYW5kcmFkb2RkLmNvbT4gPDA4NGQwMWNiMTkwZSRhZDU3N2U2MCQwNjBmYThjMEBHb256bz4="},"prevInTopic":55585,"nextInTopic":55587,"prevInTime":55585,"nextInTime":55587,"topicId":55561,"numMessagesInTopic":0,"msgSnippet":"-=-That can change though! I think we ve been just getting by this year with the house issue and now is the time for a frest start. We ve been getting out a","messageBody":"<div id=\"ygrps-yiv-200318970\">-=-That can change though! I think we&#39;ve been<br/>\njust getting by this year with the house issue and now is the time for a<br/>\nfrest start. We&#39;ve been getting out a bit more, baby steps.-=-<br/>\n<br/>\nI have this about fresh starts<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/morning\">http://sandradodd.com/morning</a><br/>\n<br/>\nand this about baby steps:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/doit\">http://sandradodd.com/doit</a><br/>\n<br/>\nYou don&#39;t have time for baby steps.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] husband not on unschooling train","postDate":"1278014140","msgId":55585,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEExMjFDQzkzLUNDNjctNEFBMi04QjEwLUI1MUYyRUZDRjEzNUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDQyNzA1Ni41MTU0OC5xbUB3ZWIxMTA0MTIubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PDA3ZGMwMWNiMThiNCQ4YmQwYWRjMCQwNjBmYThjMEBHb256bz4gPEMxNDdFODUwLTE0NkMtNDY3NC1BM0RGLTQ2MEYxQjhBNTJCRkBTYW5kcmFkb2RkLmNvbT4gPDA4NGQwMWNiMTkwZSRhZDU3N2U2MCQwNjBmYThjMEBHb256bz4gPDQyNzA1Ni41MTU0OC5xbUB3ZWIxMTA0MTIubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":55584,"nextInTopic":55586,"prevInTime":55584,"nextInTime":55586,"topicId":55561,"numMessagesInTopic":0,"msgSnippet":"-=-I d even go so far as to buy those cool laminated wall charts with all the facts and information on them, get lots of them and put them up in Damon s hang","messageBody":"<div id=\"ygrps-yiv-1533878510\">-=-I&#39;d even go so far as to buy those cool laminated wall charts with  <br/>\nall the facts and information on them, get lots of them and put them  <br/>\nup in Damon&#39;s hang out spots and the hallway near his room. By star  <br/>\ncharts and multiplication charts and the periodic table and world maps  <br/>\nand<br/>\nUS maps and solar system poster, and whatever else looks fun and  <br/>\ninteresting.-=-<br/>\n<br/>\nThat&#39;s not so far to go.  We have some in the bathroom, and posters  <br/>\nand maps up all the time, always have, even before we had kids.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] husband not on unschooling train","postDate":"1278012613","msgId":55584,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCM0E5RTJCLTg4QjctNEQyMi1CRDk0LTVBOUFBNzdDRTVBMkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDA4NGQwMWNiMTkwZSRhZDU3N2U2MCQwNjBmYThjMEBHb256bz4=","referencesHeader":"PDA3ZGMwMWNiMThiNCQ4YmQwYWRjMCQwNjBmYThjMEBHb256bz4gPEMxNDdFODUwLTE0NkMtNDY3NC1BM0RGLTQ2MEYxQjhBNTJCRkBTYW5kcmFkb2RkLmNvbT4gPDA4NGQwMWNiMTkwZSRhZDU3N2U2MCQwNjBmYThjMEBHb256bz4="},"prevInTopic":55580,"nextInTopic":55585,"prevInTime":55583,"nextInTime":55585,"topicId":55561,"numMessagesInTopic":0,"msgSnippet":"I m going to comment on some of the rest of it, but this jumped out: -=-I have all these ideas and aspirations and things I want to share with my son, but I","messageBody":"<div id=\"ygrps-yiv-1987773621\">I&#39;m going to comment on some of the rest of it, but this jumped out:<br/>\n<br/>\n-=-I have all these ideas and<br/>\naspirations and things I want to share with my son, but I don&#39;t want to<br/>\nforce it or have it become unfun. He senses when I or his dad might be<br/>\n&quot;teaching&quot; him something and covers his ears! Geoff is a wealth of  <br/>\nknowledge<br/>\non many topics and always has interesting facts to share (I learn from  <br/>\nhim<br/>\nall the time!) but Damon tends to act bored. -=-<br/>\n<br/>\n<br/>\nShare that with your husband--by cut and paste if you need to.<br/>\n<br/>\nDon&#39;t ever teach him anything.  If he&#39;s covering his ears, you are  <br/>\ndoing something wrong.<br/>\n<br/>\nIf Geoff is &quot;sharing facts&quot; that&#39;s not conversational.  He should  <br/>\nspeak to your son the way he would to a new friend.<br/>\n<br/>\nIf Damon is &quot;acting bored&quot; he&#39;s communicating with you.  Don&#39;t  <br/>\ndiscount that. He&#39;s not acting bored.  He *is* bored.<br/>\n<br/>\nI&#39;m glad you told that story, because it might be key to the  <br/>\nproblems.   Maybe you&#39;ve missed the mark on unschooling, as to HOW  <br/>\nkids learn in a natural way from the real world, and what you can do  <br/>\nto help prime that pump.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] husband not on unschooling train","postDate":"1278010685","msgId":55580,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyNzA1Ni41MTU0OC5xbUB3ZWIxMTA0MTIubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PDA4NGQwMWNiMTkwZSRhZDU3N2U2MCQwNjBmYThjMEBHb256bz4=","referencesHeader":"PDA3ZGMwMWNiMThiNCQ4YmQwYWRjMCQwNjBmYThjMEBHb256bz4gPEMxNDdFODUwLTE0NkMtNDY3NC1BM0RGLTQ2MEYxQjhBNTJCRkBTYW5kcmFkb2RkLmNvbT4gPDA4NGQwMWNiMTkwZSRhZDU3N2U2MCQwNjBmYThjMEBHb256bz4="},"prevInTopic":55579,"nextInTopic":55584,"prevInTime":55579,"nextInTime":55581,"topicId":55561,"numMessagesInTopic":0,"msgSnippet":"***He was extremely negative about everything, saw only the bad, arrived too late to attend the SSUDS group on Sat, refused to attend any of the presentations","messageBody":"<div id=\"ygrps-yiv-548573616\">***He was extremely negative about<br/>\neverything, saw only the bad, arrived too late to attend the SSUDS group on<br/>\nSat, refused to attend any of the presentations or chats on Sun, and<br/>\nbombarded me with the PLAN and school ultimatum AT the conference. He also<br/>\ntook Damon home on Sunday while I stayed until Monday by myself. (Damon<br/>\nwasn&#39;t having a good time, unfortunately, and was better off at home.) I<br/>\nforgot to mention that I got some good advice from Robyn Bentley and another<br/>\nmom that last night, but this has been brewing inside me for a month and<br/>\nwhile I&#39;ve taken a few steps, it feels like I need to take some BIG step or<br/>\ndo so much all at once and I didn&#39;t know how!***<br/>\n<br/>\nI&#39;ve been thinking about it too!  Normally Geoff is a fun jokester kind of guy.  Most of the times that I&#39;ve been around him, he&#39;s been fun and smiley and joking around.  At the conference this year, he seemed way out of his element.  Perhaps he was still tired and stressed from the sale you had the week before?  Even when he was feeling negative, he was still kind to Damon, and that is something to be commended for sure.  His focus went straight to his son, playing with him and just being with him, which also caused him to feel a bit protective of him, especially because of the gaming room issues.  Damon is an exceptional gamer and wasn&#39;t allowed to play any of the games in the gaming room because the older kids simply wouldn&#39;t give him a turn.  That was a BIG issue that caused a lot of frustration and tears and that is what Geoff walked into at the conference, combined with a very active hotel room with lack of hotel housekeeping.  I shared a room with<br/>\n Kim and Damon and then Geoff and even though I went in several times throughout the day to clean up, it was still messy due to lack of hotel housekeeping.  There were a lot of factors that contributed to his overall negative experience, part of it being his own inability to jump in and go with the conference flow, but I get why.<br/>\n<br/>\n***I don&#39;t get why he would have MORE right than me. Do you mean if we get<br/>\ndivorced and things get ugly? He could demand school? I get that, but in a<br/>\ndiscussion and trying to meet somewhere in the middle, there&#39;s no way we can<br/>\nboth get what we want, there must be compromise. He doesn&#39;t really want to<br/>\nsend Damon to school, so I feel it&#39;s more ME who is having to compromise.<br/>\nBut I will if that&#39;s what it takes!***<br/>\n<br/>\nI think that is very often the case.  The onus is on the stay at home parent.  My impression of Geoff, and you can correct me if I&#39;m wrong here, is that he doesn&#39;t like conflict, but when he feels conflicted, he stone walls a bit, he becomes less flexible and brings out a big emotional response.  I see that same trait in Damon.  Margaux does that too and so did my own husband.  My husband was aware that he was doing it and has taken great strides to not do that and in so doing has become a really great flexible parent who really gets unschooling.  So, take away the conflicting feelings that he has, make your home look more schoolish, like there is a hubbub of learning going on.  I&#39;d even go so far as to buy those cool laminated wall charts with all the facts and information on them, get lots of them and put them up in Damon&#39;s hang out spots and the hallway near his room.  By star charts and multiplication charts and the periodic table and world maps and<br/>\n US maps and solar system poster, and whatever else looks fun and interesting.  Make it look like there are TONS of really great things to learn from all around Damon, a bubble of learning.  Chances are Damon WILL check out that stuff, the kid pays attention to everything around him, even when it seems he isn&#39;t.<br/>\n<br/>\n***I told Geoff I could<br/>\ntalk to some people and see what they use/like, but then not much time has<br/>\nelapsed and his mom is bugging him again. I felt no rush and did not agree<br/>\nto a deadline, this is just the way she is, once she has a question she<br/>\nwon&#39;t rest until she has an answer so now apparently it&#39;s an urgent matter<br/>\nfor me.***<br/>\n<br/>\nYour MIL has a lot of influence on your husband.  Give your husband things to give her.  Can you print out screen shots from any of his wii games?  I&#39;m curious about that because Damon does some creative screen shots.  If you could get those out on paper and cut and paste, collage style and send her notes in the mail from Damon, maybe she won&#39;t feel so intense about what Damon is or isn&#39;t doing. <br/>\n<br/>\n***Do you go to a playgroup? <br/>\n**Nothing regular. We have plenty of friends we can make play dates with,<br/>\nand we&#39;re starting to again. We didn&#39;t really invite friends over Jan-May<br/>\nbecause there&#39;s hardly room in the apt, so I was trying to get us out more.<br/>\nNow I&#39;m thinking about inviting kids over again, once we get the basement<br/>\nset up and move the wii down there!***<br/>\n<br/>\nYou have a great house for hosting stuff.  If you invite people they would come.  That way Damon doesn&#39;t have to leave his house.  You could have gaming parties or other themed parties.  You could do boffer parties since Damon likes the pretend fighting stuff where there is also a potential of being hurt or hurting others, but not hurt badly.<br/>\n<br/>\n***Geoff is a wealth of knowledge<br/>\non many topics and always has interesting facts to share (I learn from him<br/>\nall the time!) but Damon tends to act bored.***<br/>\n<br/>\nYes, that used to happen here with dad and kids!  John is a wealth of info too!  The key was to find something that both of them were interested in and help set that up and encourage that, no pressure style.  John loves playing music and has a lot of instruments.  All was fine noodling around with the occasional advice on how to do something cool, but as soon as it seemed like a music lesson, things would go downhill fast.  Helping dads do fun stress free stuff with their kids is a really good thing.  Often times dads don&#39;t get child development stuff at all and have expectations of their young children that don&#39;t match the reality.  I have another really good friend whose daughter is now 16 and for years it was like that.  The dad just didn&#39;t really deal well with small children at all, didn&#39;t know what to do with his daughter.  The mom helped them find at least one or two things they could do together that wouldn&#39;t involve too much work on the part of<br/>\n the dad.  One was watching anime and the other was playing DnD.  It was hard for many years for mom to be in the middle and act as buffer between father and daughter, but it payed off.  <br/>\n<br/>\nIt&#39;s possible that Geoff will back off on fact sharing with Damon, if he feels like Damon is getting enough of it during the day from mom, then it could be JUST fact sharing, not lesson giving.<br/>\n<br/>\n*** (She is more apt<br/>\nto ask him questions she thinks he should know, like what number comes after<br/>\n38 and before 40? And Damon is prone to saying I DON&#39;T KNOW! Leave me<br/>\nalone!)***<br/>\n<br/>\nCan you tell her that you guys are on summer vacation and between now and this weekend buy or know what you are going to buy and let her know what you are using once school starts up again?  Would it work to give a lighthearted, &quot;hey no quizzing Damon on his summer vacation&quot;?  Schooled kids would get annoyed by such a thing and give the same kind of answer.<br/>\n<br/>\nYou CAN DO THIS Kim!!!!  Really, you get unschooling at the heart of it.  Now let all that go and give your all to your hubby so that he can feel peace and really trust that you know what you&#39;re doing! <br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":313964989,"authorName":"austin.connorsmom","from":"&quot;austin.connorsmom&quot; &lt;tripsofalifetime@...&gt;","profile":"austin.connorsmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: husband not on unschooling train","postDate":"1278005503","msgId":55579,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkwaWpkditmMHVnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDA3ZGMwMWNiMThiNCQ4YmQwYWRjMCQwNjBmYThjMEBHb256bz4="},"prevInTopic":55577,"nextInTopic":55580,"prevInTime":55578,"nextInTime":55580,"topicId":55561,"numMessagesInTopic":0,"msgSnippet":"Hi my name is Gina and I am mom to 2 boys a 9 year old and 4 year old. I have been reading the posts and haven t posted anything yet. This post is something I","messageBody":"<div id=\"ygrps-yiv-755441876\">Hi my name is Gina and I am mom to 2 boys a 9 year old and 4 year old. I have been reading the posts and haven&#39;t posted anything yet. This post is something I can completely relate to.  My dh also isn&#39;t on board and the train is still at the station waiting for him!  I have an agreement with him  to do a certain amount of Math and Language Arts daily and then unschooling everything else. It&#39;s not perfect, but as soon as we came up with this compromise life got much easier on me and the kids. We have a much less stressed day and although I&#39;d like it to be completely unschooling my family is together and happy. To me that&#39;s what is important. I will continue sitting on my unschooling train at the station waiting for my dh to be on board, so as a family we can make this journey together. <br/>\n:-)<br/>\nThanks for all the wonderful info available here.<br/>\n<br/>\nSincerely,<br/>\nGina Chapa<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Kim Zerbe&quot; &lt;kim.zerbe@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; I know this has been brought up before and this won&#39;t be the last time, but<br/>\n&gt; I&#39;m struggling with a husband who is not on board with unschooling. I<br/>\n&gt; thought he was. We have similar ideas of how to parent our child, but lately<br/>\n&gt; we seem to be fighting or having heated discussions which is leaving me<br/>\n&gt; uncomfortable. I feel attacked. I don&#39;t like arguing with my husband, but I<br/>\n&gt; cannot accept his ultimatum. I don&#39;t know what to do.<br/>\n&gt;  <br/>\n&gt; Over a year ago he agreed that Damon would not be attending public<br/>\n&gt; Kindergarten and he (dad) was fine with Damon staying home with me (mom) as<br/>\n&gt; long as he was learning something. (I felt pretty confident he would be<br/>\n&gt; &quot;learning something&quot; and was happy with that arrangement! In my mind, we<br/>\n&gt; would prove how awesome unschooling is in this one year that dad would<br/>\n&gt; support future years without question.) I had already rejected sending my<br/>\n&gt; child off to preschool as many of my friends were doing.<br/>\n&gt;  <br/>\n&gt; So we basically continued doing what we had been doing for 5 years, living<br/>\n&gt; life, learning as we go, doing a melange of things from day to day, with the<br/>\n&gt; added knowledge that this year people expected him to be in school and there<br/>\n&gt; might even be some expecation (from family and friends) that he &quot;should&quot; be<br/>\n&gt; learning certain things or hitting certain milestones. I don&#39;t have much<br/>\n&gt; contact with my own family, so there&#39;s little conflict to deal with there. I<br/>\n&gt; do have a sister with 5 kids who wants to know more about homeschooling as 2<br/>\n&gt; of her 3 have seen injustices in the school system and she herself has been<br/>\n&gt; pushed out of participating in the PTO. (That may return as a new topic<br/>\n&gt; soon! Although I don&#39;t think she&#39;s ready to unschool!)<br/>\n&gt;  <br/>\n&gt; We do however have a great close relationship with Geoff&#39;s mom, she lives<br/>\n&gt; just over an hour away from us and we see her at least a couple times a<br/>\n&gt; month. She&#39;s a kind and loving grandma to Damon. But lately she is getting<br/>\n&gt; quite vocal about her opinion that he needs to be in school. She has<br/>\n&gt; addressed her concerns to me, but I think I was too cavalier with my<br/>\n&gt; responses (he&#39;ll read when he&#39;s ready, he has plenty of friends, he doesn&#39;t<br/>\n&gt; need to go to bed now there&#39;s nowhere we need to be tomorrow). She doesn&#39;t<br/>\n&gt; like our schedule. I thought we were OK with her, that she has figured out<br/>\n&gt; that we are different than her other kids and what we are doing works for<br/>\n&gt; us. Apparently not. She has taken up her cause with my husband, calling him<br/>\n&gt; at work or on his cell phone when he&#39;s not at home. He comes home saying<br/>\n&gt; things like: Damon needs a curriculum, when are you going to buy him a<br/>\n&gt; curriculum? I had to endure 20 minutes of crap from my mom about how we are<br/>\n&gt; ruining our son, how he is a loser and he&#39;ll never be able to get a good job<br/>\n&gt; in the real world. He needs more friends. He needs more activities and<br/>\n&gt; lessons. He needs structure. Grandma wants to know if you&#39;ve found him a<br/>\n&gt; math curriculum yet and stop pretending that you are looking into it, just<br/>\n&gt; buy something so I can tell her you have a PLAN!<br/>\n&gt;  <br/>\n&gt; It&#39;s all about having a PLAN now. What is my plan for him? How will he learn<br/>\n&gt; reading and math? What lessons will I sign him up for? If I don&#39;t have a<br/>\n&gt; PLAN in place by the end of summer, Geoff says HE will enroll Damon in<br/>\n&gt; school!!! Now this is the ultimate insult. (I may have yelled NO HE WON&#39;T!)<br/>\n&gt; It&#39;s not that I&#39;ve been doing NOTHING with Damon for a year (6 yrs) but some<br/>\n&gt; days when dad comes home from work it does look a lot like nothing happened<br/>\n&gt; all day. And Geoff has made it very clear that he does NOT WANT to send<br/>\n&gt; Damon to school, but he feels I&#39;m too unstructured. Basically he wants me to<br/>\n&gt; show him some sort of PLAN of action (and I&#39;m not clear what that IS!) that<br/>\n&gt; he will be satisfied with (or maybe that will satisfy his mom?) so Damon can<br/>\n&gt; remain at home. Apparently Year 1 was not very impressive. To him anyway. <br/>\n&gt;  <br/>\n&gt; We&#39;ve been married over 16 years, 20 total together (met in college, age 19<br/>\n&gt; and 20), and we&#39;ve been through our share of ups and downs so I am not<br/>\n&gt; interested in throwing my marriage out the window in favor of defending my<br/>\n&gt; desire to unschool our child (we have 1 child who just turned 6 last week).<br/>\n&gt; I just reread the page on Divorce in Sandra&#39;s Big Book and it says: Married<br/>\n&gt; and school is better than divorced and unschooling. So maybe the advice I<br/>\n&gt; need is how to strengthen my marriage? I also feel this pressure to make<br/>\n&gt; unschooling look like the best thing EVER, not just to me and Damon, but<br/>\n&gt; somehow so Geoff and his mom can see it too.<br/>\n&gt;  <br/>\n&gt; Thanks,<br/>\n&gt;  <br/>\n&gt; Kim in Oregon<br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: husband not on unschooling train","postDate":"1278003981","msgId":55577,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkwaWh1ZCtsMmhkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDFGRTE2NEI3LUNBN0EtNEUwQS05NzhELTFFNjFFQTA3Mzc2MkBzdXBlbm4uY29tPg=="},"prevInTopic":55575,"nextInTopic":55579,"prevInTime":55576,"nextInTime":55578,"topicId":55561,"numMessagesInTopic":0,"msgSnippet":"... ************** A good way to spin some of the things that don t look so schoolish is to tell family we have a strong focus on science/arts . It gives","messageBody":"<div id=\"ygrps-yiv-1413379914\">Su Penn &lt;su@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; But over time we do a surprising amount of stuff that would look to _anybody_, no matter how school-minded they were, like &quot;learning activities,&quot; even if that wasn&#39;t the primary motivation for doing them.<br/>\n </span></blockquote>**************<br/>\n<br/>\nA good way to &quot;spin&quot; some of the things that don&#39;t look so &quot;schoolish&quot; is to tell family &quot;we have a strong focus on science/arts&quot;. It gives you a place to start talking about how all &quot;subjects&quot; really tie in to each other. For instance, Mo and George have been doing a lot of animal identification this year - birds and snakes and bugs... anything that crosses their path. They aren&#39;t doing that as part of a science curriculum, but its really easy to spin that to grandparents as such and show how it incorporates things like reading and research skills and even has tie ins to things like &quot;social studies&quot;. <br/>\n<br/>\nAnother way to help grandparents feel good about &quot;education&quot; is to ask them for things that will seem &quot;educational&quot; for gifts. Bulk art supplies, a microscope, reference books, anatomy books, maps and globes, a sewing machine, a telescope... you get the idea! And send little notes or blog about times you use those fantastic resources.<br/>\n<br/>\nMindware is a good source for fun &quot;geek toys&quot; and games:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.mindwareonline.com/MWESTORE/Home/HomePage.aspx\">http://www.mindwareonline.com/MWESTORE/Home/HomePage.aspx</a><br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":240358028,"authorName":"kristi_beguin","from":"&quot;kristi_beguin&quot; &lt;foehn_jye@...&gt;","profile":"kristi_beguin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: husband not on unschooling train","postDate":"1277999436","msgId":55575,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkwaWRnYytvdXFtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDRDMTQwQkJELTJGOEYtNEVGMi1BQTBELTU5QTkxMzQ2MjU0NkBzdXBlbm4uY29tPg=="},"prevInTopic":55572,"nextInTopic":55577,"prevInTime":55574,"nextInTime":55576,"topicId":55561,"numMessagesInTopic":0,"msgSnippet":"This resource page has a lot of different curricula to look through and learn about: http://www.educationrevolution.org/homeeducation.html If you know other","messageBody":"<div id=\"ygrps-yiv-929987007\">This resource page has a lot of different curricula to look through and learn about:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.educationrevolution.org/homeeducation.html\">http://www.educationrevolution.org/homeeducation.html</a><br/>\n<br/>\nIf you know other homeschoolers, you might ask if they have leftover curricula that you could borrow, or buy at a discounted price.  A good friend of mine gave us her Christopherus Waldorf curriculum for ages 4 through 7 and there were lots of fun ideas for crafts, projects, and learning.<br/>\n<br/>\nThinking of curricula as resource books to draw from might help shift your thought from them being a &quot;waste of money&quot; or creating an environment that is &quot;too structured.&quot;</div>","specialLinks":[]},{"userId":223803785,"authorName":"Su Penn","from":"Su Penn &lt;su@...&gt;","profile":"marie101365","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] husband not on unschooling train","postDate":"1277997337","msgId":55572,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRDMTQwQkJELTJGOEYtNEVGMi1BQTBELTU5QTkxMzQ2MjU0NkBzdXBlbm4uY29tPg==","inReplyToHeader":"PDA4NGQwMWNiMTkwZSRhZDU3N2U2MCQwNjBmYThjMEBHb256bz4=","referencesHeader":"PDA3ZGMwMWNiMThiNCQ4YmQwYWRjMCQwNjBmYThjMEBHb256bz4gPEMxNDdFODUwLTE0NkMtNDY3NC1BM0RGLTQ2MEYxQjhBNTJCRkBTYW5kcmFkb2RkLmNvbT4gPDA4NGQwMWNiMTkwZSRhZDU3N2U2MCQwNjBmYThjMEBHb256bz4="},"prevInTopic":55571,"nextInTopic":55575,"prevInTime":55571,"nextInTime":55573,"topicId":55561,"numMessagesInTopic":0,"msgSnippet":"... I try never to think of stuff I bring into the house as a waste of money, even if the kids don t click with it, even if we use it only partly. I think of","messageBody":"<div id=\"ygrps-yiv-918237261\">On Jul 1, 2010, at 7:15 AM, Kim Zerbe wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; **I never said I would buy a curriculum. I fear it would be a waste of<br/>\n&gt; money<br/>\n<br/>\n </span></blockquote>I try never to think of stuff I bring into the house as a waste of money, even if the kids don&#39;t &quot;click&quot; with it, even if we use it only partly. I think of it as part of exploring opportunities. It&#39;s hard for me; I like to &quot;use things up,&quot; and a half-finished book of mazes is like an affront to me. I&#39;m also disappointed when I bring home something I think one of the kids will love, and they don&#39;t. I&#39;ve had to work on this.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; . Apparently Geoff told his mom I was looking into it, trying to find a<br/>\n&gt; good one, to get her off his back. But he forgot to tell me. When he did<br/>\n&gt; mention it I told him I don&#39;t really know what to buy because Damon doesn&#39;t<br/>\n&gt; like workbooks.<br/>\n<br/>\n </span></blockquote>So, part of the problem is that your husband wants his mother off his back. OK! If Damon doesn&#39;t like workbooks, and you want to buy a curriculum so your husband can tell grandma, &quot;Yeah, we&#39;ve got this great curriculum,&quot; you could get something like Right Start Math. Some friends of mine who aren&#39;t unschoolers use it, and their kids really have liked it. It&#39;s got piles and piles of different manipulatives, and uses card and other games. A lot of it looks really fun to me, and if money were no object I might have bought some of the materials just because I think the kids would find them fun to mess around with. I wouldn&#39;t normally recommend such a thing on an unschooling list, and for some people (I&#39;m one, sometimes) having curriculum stuff around can be dangerous as you start to think you have to do it! All! In order!<br/>\n<br/>\nSo, &quot;Hey, Right Start Math looks pretty good!&quot; is by no means to be taken as a blanket recommendation. But for a person who is stronger in unschooling than I am, or for a person like you who has family pressure, it could be a good thing. Grandma knows you have a math curriculum; she chills out and stops haranguing your husband, your husband gets happier. You and Damon use the materials in whatever way works for you.<br/>\n<br/>\nSu, mom to Eric, 9; Carl, 6; Yehva, 2.5</div>","specialLinks":[]},{"userId":223803785,"authorName":"Su Penn","from":"Su Penn &lt;su@...&gt;","profile":"marie101365","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] husband not on unschooling train","postDate":"1277996368","msgId":55571,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFGRTE2NEI3LUNBN0EtNEUwQS05NzhELTFFNjFFQTA3Mzc2MkBzdXBlbm4uY29tPg==","inReplyToHeader":"PDA3ZGMwMWNiMThiNCQ4YmQwYWRjMCQwNjBmYThjMEBHb256bz4=","referencesHeader":"PDA3ZGMwMWNiMThiNCQ4YmQwYWRjMCQwNjBmYThjMEBHb256bz4="},"prevInTopic":55569,"nextInTopic":55572,"prevInTime":55570,"nextInTime":55572,"topicId":55561,"numMessagesInTopic":0,"msgSnippet":"... Then why not make a plan? Depending on what your husband is going to be comfortable with, it needn t be a full curriculum (though I saw Sandra mentioned","messageBody":"<div id=\"ygrps-yiv-853919220\">On Jun 30, 2010, at 8:30 PM, Kim Zerbe wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It&#39;s all about having a PLAN now. What is my plan for him? How will he learn<br/>\n&gt; reading and math? What lessons will I sign him up for? If I don&#39;t have a<br/>\n&gt; PLAN in place by the end of summer, Geoff says HE will enroll Damon in<br/>\n&gt; school!!!<br/>\n<br/>\n </span></blockquote>Then why not make a plan? Depending on what your husband is going to be comfortable with, it needn&#39;t be a full curriculum (though I saw Sandra mentioned Clonlara and Oak Meadow--I don&#39;t know a lot about Oak Meadow, but Clonlara I believe can be very flexible in working with families). I _always_ have a plan, because I&#39;m a planner, though mostly my plan consists of bringing stuff I think is cool into the house and from time to time bringing it to the kids&#39; notice in some way, or offering to do it with them. But even so, off the top of my head right now I could construct a &quot;curriculum&quot; around stuff we already have.<br/>\n<br/>\nMight it be enough for your husband to know you&#39;ve thought through some ideas and activities? If you can say, &quot;I&#39;ve got cuisinaire rods and connect-the-dots books and this cool software game for math; for reading I&#39;ve got a set of the Bob books and some early readers like Frog and Toad for us to read together, plus some Letter Factory DVDs; for science here are some cool projects I&#39;d like to try from this big book on doing science with kids I got from the library; here&#39;s a list of books I thought we might do for read-alouds that includes some books set in historical periods or about historical figures, and this great one about the space program, and this one about the civil rights movement. I made this list of field trips we might go on, too.&quot;<br/>\n<br/>\nThat might be enough to show your husband first, that you listened to his concerns, and second, that you have thought this through. And then you can say, &quot;Let&#39;s give this another year, I think you&#39;ll really see Damon is learning a lot.&quot;<br/>\n<br/>\nIn practice, using all that stuff on your lists doesn&#39;t have to look like sitting down every day at 9 a.m. to do a little reading, then a little math, then a science experiment, and then reading an edifying book together. It can look like you saying, &quot;Hey, Damon, want to do some connect-the-dots with me?&quot; or even just leaving the connect-the-dots book where Damon can easily get to it. Or like you saying, &quot;I thought after lunch we&#39;d try this experiment from this book; does that sound fun?&quot;<br/>\n<br/>\nWhen _I_ feel the need to be more organized, I make sure I have a lot of ideas and then at some point during the day I&#39;ll check in with the boys and offer them an array of options they _might_ do with me. So I might say, &quot;Hey, you guys, you wanna do something together? I have the stuff to bake a lemon cake, or I thought we could play a board game, or I&#39;ve got this cool experiment with a lightbulb I&#39;ve been wanting to try.&quot; And sometimes they pick one of those, and sometimes they suggest something else, or one of them wants to and the other doesn&#39;t, or they&#39;re both busy with other stuff. Or sometimes I&#39;ll just jump in with something--taking down The Art Book and looking through it myself, and maybe they come look over my shoulder and we have a talk about some of the pictures. <br/>\n<br/>\nBut over time we do a surprising amount of stuff that would look to _anybody_, no matter how school-minded they were, like &quot;learning activities,&quot; even if that wasn&#39;t the primary motivation for doing them.<br/>\n<br/>\nSu, mom to Eric, 9; Carl, 6; Yehva, 2.5<br/>\ntapeflags.blogspot.com</div>","specialLinks":[]},{"userId":255388392,"authorName":"Kelly Halldorson","from":"&quot;Kelly Halldorson&quot; &lt;kelly@...&gt;","profile":"kellygrafx","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] husband not on unschooling train","postDate":"1277990340","msgId":55569,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI0MTYxQTA3RUIxNjREMzc5QkRBOUE4NDRBNjE3QkQ5QFBIUFZpZGVvVkFJTz4=","inReplyToHeader":"PDk4QjI5QjA2LUUxQ0YtNDFDNC1CMzUwLTJCNDE1QzU5NDQxM0B2ZXJpem9uLm5ldD4=","referencesHeader":"PDA3ZGMwMWNiMThiNCQ4YmQwYWRjMCQwNjBmYThjMEBHb256bz4gPDk4QjI5QjA2LUUxQ0YtNDFDNC1CMzUwLTJCNDE1QzU5NDQxM0B2ZXJpem9uLm5ldD4="},"prevInTopic":55568,"nextInTopic":55571,"prevInTime":55568,"nextInTime":55570,"topicId":55561,"numMessagesInTopic":0,"msgSnippet":"... your son. You want the change so it s up to you to find ways for your husband not to fear it. It s not up to him to not fear. It s not up to him to get","messageBody":"<div id=\"ygrps-yiv-732227394\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;Think of your husband and mother-in-law living under great fear for <br/>\n </span></blockquote>your son. You want the change so it&#39;s up to you to find ways for your <br/>\nhusband not to fear it. It&#39;s not up to him to not fear. It&#39;s not up to <br/>\nhim to get unschooling. It&#39;s up to him to love your child and in the <br/>\nface of fear, he&#39;s doing what he thinks is best.&lt;&lt;&lt;<br/>\n<br/>\nI think it&#39;s often both a fear for the kids, as well as a resentment. Parents/Mothers feel as though you think their parenting wasn&#39;t *good enough* or any where near good enough because you want to do this thing that  is so completely different from how they raised you. Or more simply they think you think you are better than they are.<br/>\n<br/>\nI think spouses get this a little too. They come, more, from a direction of thinking you don&#39;t believe they are good enough. Your husband may feel you want to raise your son differently than he was raised because you don&#39;t want your kids to &quot;turn out&quot; like him. I think that is more where the anger is coming from. I think the sadness and frustration is coming from the fear. <br/>\n<br/>\nAlso, men can be goal oriented (so can women). You might need to make unschooling look more goal-oriented. Show him *your* goals by parenting them in this way. <br/>\n<br/>\nHere are some of my goals in unschoolng (yours may be different) maybe you can show this type of thing in your home so your husband can learn/see it for himself.<br/>\n<br/>\n- great relationship with my kids<br/>\n- reduce the amount of negative conflict in my home <br/>\n- raise well-adjusted individuals that are compassionate and kind<br/>\n- raise adults who understand/realize all things in life are choices<br/>\n- allow for my children to explore the world and learn from it naturally<br/>\n- for my kids to be inspired and adventurous, not tamed<br/>\n<br/>\nI say similar to what Joyce and Sandra said. Make it wonderful. Make your husband happy. Make it look amazing. Make your kids laugh and smile more. Make your home, your life, your relationship with your kids and husband something to envy. Make it something so beautiful that people (including hubby & mom) want to learn about it rather than fear or resent it. Then they&#39;ll ask, &quot;How do I get that too?&quot;<br/>\n<br/>\nPeace,<br/>\nKelly Halldorson<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":208961162,"authorName":"Kim Zerbe","from":"&quot;Kim Zerbe&quot; &lt;kim.zerbe@...&gt;","profile":"zerbe2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [AlwaysLearning] husband not on unschooling train","postDate":"1277982912","msgId":55568,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA4NGQwMWNiMTkwZSRhZDU3N2U2MCQwNjBmYThjMEBHb256bz4=","inReplyToHeader":"PEMxNDdFODUwLTE0NkMtNDY3NC1BM0RGLTQ2MEYxQjhBNTJCRkBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDA3ZGMwMWNiMThiNCQ4YmQwYWRjMCQwNjBmYThjMEBHb256bz4gPEMxNDdFODUwLTE0NkMtNDY3NC1BM0RGLTQ2MEYxQjhBNTJCRkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":55567,"nextInTopic":55569,"prevInTime":55567,"nextInTime":55569,"topicId":55561,"numMessagesInTopic":0,"msgSnippet":"I m not sure how to do this properly so it makes sense (because I know fonts and colors won t go through), now that there is my original post, Sandra s reply,","messageBody":"<div id=\"ygrps-yiv-297372804\">I&#39;m not sure how to do this properly so it makes sense (because I know fonts<br/>\nand colors won&#39;t go through), now that there is my original post, Sandra&#39;s<br/>\nreply, and now my reply to hers, but here goes! <br/>\n <br/>\n -=- In my mind, we<br/>\nwould prove how awesome unschooling is in this one year that dad would<br/>\nsupport future years without question.)-=-<br/>\n<br/>\nDid you go to a conference?  <br/>\n**YES! I&#39;ve been to LIFE is Good 3 times (Damon was 3 the first time, when I<br/>\nhad just found out about unschooling and needed a transition from attachment<br/>\nparenting since most of my friends from that group were sending their kids<br/>\nto preschool and no longer had time for us). Geoff (DH) is only able to<br/>\nattend on the weekends (mainly due to the fact that it is not his thing and<br/>\nhe does not wish to take vacation days to attend more), and his attitude<br/>\nthis time was very different than last time. He was extremely negative about<br/>\neverything, saw only the bad, arrived too late to attend the SSUDS group on<br/>\nSat, refused to attend any of the presentations or chats on Sun, and<br/>\nbombarded me with the PLAN and school ultimatum AT the conference. He also<br/>\ntook Damon home on Sunday while I stayed until Monday by myself. (Damon<br/>\nwasn&#39;t having a good time, unfortunately, and was better off at home.) I<br/>\nforgot to mention that I got some good advice from Robyn Bentley and another<br/>\nmom that last night, but this has been brewing inside me for a month and<br/>\nwhile I&#39;ve taken a few steps, it feels like I need to take some BIG step or<br/>\ndo so much all at once and I didn&#39;t know how!<br/>\n<br/>\nDid you keep a blog? <br/>\n**No, but I started one last June with that intent, I just never seem to<br/>\nfind (ok, make) the time to update it! I take pictures all the time, I have<br/>\ntons of photographic evidence of things we&#39;ve been doing. <br/>\n <br/>\nDid you make friends with other unschooling families?  <br/>\n**YES! I have a good handful of friends who live near me and we try to get<br/>\ntogether when we can. There are a fair amount of unschoolers in my area<br/>\n(considering the greater metro area, I&quot;m in a suburb of Portland, OR). There<br/>\nare gatherings posted on a local yahoo group and we have attended some<br/>\nevents both with the friends we see regularly and some we only see<br/>\noccationally (due to how far apart we live, we seem to meet in the middle).<br/>\n <br/>\n <br/>\n-=-He comes home saying things like: Damon needs a curriculum, when are you<br/>\ngoing to buy him a curriculum? -=-<br/>\n<br/>\nIf you have a bunch of money, buy one. Buy Oak Meadow, or sign up <br/>\nwith Clonlara. If you don&#39;t have a bunch of money, go here and create one:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/unschoolingcurriculum\">http://sandradodd.com/unschoolingcurriculum</a><br/>\n<br/>\nYou&#39;re talking first grade. Don&#39;t over-react. <br/>\n**Wow, that is really GREAT information! I did a lot of reading and clicking<br/>\nand reading, it seems we&#39;ve covered (inadvertantly? or at least not in a<br/>\nlesson plan sort of way) most of what schools expect kids to learn in K and<br/>\nsome of grade 1. I hadn&#39;t considered writing it down or putting it into<br/>\nwords, but I might just do that from what I&#39;ve collected, creating my own<br/>\ncurriculum. I&#39;ve come a long way from being a complete control freak and I<br/>\nnow almost patently reject anything that looks like order, but I can see how<br/>\nhaving a list (esp making my own) would be helpful to the part of me that<br/>\nlikes that sort of thing, and will be great for my husband too. AND his mom!<br/>\n <br/>\n <br/>\nWhen you wrote &quot;my mom&quot; did you mean your husband?<br/>\n**OK, I see that I made a mistake and it&#39;s hard to understand who is<br/>\ntalking. That was Geoff talking about HIS mom. I should have put in<br/>\nquotation marks so it looks like this:<br/>\n <br/>\nHe (Geoff, husband/dad) comes home saying things like: &quot;Damon needs a<br/>\ncurriculum, when are you going to buy him a curriculum? I had to endure 20<br/>\nminutes of crap from my mom about how we are ruining our son, how he is a<br/>\nloser and he&#39;ll never be able to get a good job in the real world. He needs<br/>\nmore friends. He needs more activities and lessons. He needs structure.<br/>\nGrandma (him talking about his own mom) wants to know if you&#39;ve found him a<br/>\nmath curriculum yet and stop pretending that you are looking into it, just<br/>\nbuy something so I can tell her you have a PLAN!&quot;<br/>\n<br/>\nIf you were pretending that you were looking into it, that&#39;s pretty bad.<br/>\nIf you&#39;re being dodgy and dishonest, what they were saying isn&#39;t crap <br/>\nat all. <br/>\n**I never said I would buy a curriculum. I fear it would be a waste of<br/>\nmoney. Apparently Geoff told his mom I was looking into it, trying to find a<br/>\ngood one, to get her off his back. But he forgot to tell me. When he did<br/>\nmention it I told him I don&#39;t really know what to buy because Damon doesn&#39;t<br/>\nlike workbooks. He really liked them when he was 3-4, they were easy mazes<br/>\nand cutting and writing letters and numbers and he mastered all of those<br/>\nbooks, but at some point I got out more Activity Books (as I called them) to<br/>\ndo he said &quot;no way&quot; and it&#39;s been &quot;no way&quot; every since. I told Geoff I could<br/>\ntalk to some people and see what they use/like, but then not much time has<br/>\nelapsed and his mom is bugging him again. I felt no rush and did not agree<br/>\nto a deadline, this is just the way she is, once she has a question she<br/>\nwon&#39;t rest until she has an answer so now apparently it&#39;s an urgent matter<br/>\nfor me.  <br/>\n <br/>\n<br/>\nJust buy something so he can tell her you have a plan! Just do it.<br/>\nIf that&#39;s all it takes to end this noise for another year, do it! <br/>\n**I love it! This is funny advice from an unschooler, but I get it. Point<br/>\ntaken. Money is not in short supply here, I just didn&#39;t feel we needed it.<br/>\nNow I see WHY we do need it, to keep the peace. ;) Actually I did recently<br/>\ngo to a Learning Palace store last week and bought a bunch of stuff I<br/>\nthought could help us, no curriculum per se, but some manipulative tools I<br/>\nsaw as useful for exploring math concepts plus other fun things. The manager<br/>\nsaid her daughter was in Kindergarten and their classroom had some of the<br/>\nthings I was looking at and the kids really liked them so I kind of felt<br/>\nlike I had done some research before buying, lol. So I&#39;ll incorporate that<br/>\ninto my overall tailored curriculum or whatever we call it.<br/>\n<br/>\n<br/>\n-=-What lessons will I sign him up for? If I don&#39;t have a<br/>\nPLAN in place by the end of summer, Geoff says HE will enroll Damon in<br/>\nschool!!! Now this is the ultimate insult. (I may have yelled NO HE <br/>\nWON&#39;T!)-=-<br/>\n<br/>\nI thought you said you didn&#39;t want to throw your marriage away.<br/>\nHe has as much right to enroll your son in school as you have to keep <br/>\nhim out against your husband&#39;s will. In fact, he has MORE right to do <br/>\nthat than you do to homeschool, let alone unschooling. <br/>\n**I don&#39;t get why he would have MORE right than me. Do you mean if we get<br/>\ndivorced and things get ugly? He could demand school? I get that, but in a<br/>\ndiscussion and trying to meet somewhere in the middle, there&#39;s no way we can<br/>\nboth get what we want, there must be compromise. He doesn&#39;t really want to<br/>\nsend Damon to school, so I feel it&#39;s more ME who is having to compromise.<br/>\nBut I will if that&#39;s what it takes!<br/>\n <br/>\n<br/>\n-=-And Geoff has made it very clear that he does NOT WANT to send<br/>\nDamon to school, but he feels I&#39;m too unstructured. -=-<br/>\n<br/>\nSo be more structured. I don&#39;t see the problem with that.  <br/>\n**I&#39;m getting the message. I actually agree with this. We have been less<br/>\nstructured than I had wanted to be this year, but there were 2 reasons. <br/>\n <br/>\n1. Damon is generally happy at home. This winter was a cold one and I was<br/>\nmostly content to stay indoors as well. We stayed home a lot more than I<br/>\nwould have liked. When I got itching to get OUT of the house, I had to<br/>\ncajole him to leave, basically bribing him but in a respectful way. Damon<br/>\nLOVES the wii. He&#39;s really good at it and it is very difficult to get him to<br/>\nwillingly leave the wii to do other things. Even saying certain friends<br/>\nwould be at the outing (zoo, indoor play place, friend&#39;s house) weren&#39;t<br/>\noften enticing to him. Sometimes he would say OK and get in the car, but<br/>\nmore often than not there was resistance and he gets physical so it really<br/>\ndepended on how badly I wanted to go somewhere.<br/>\n <br/>\n2. I just realized there was another BIG thing that threw us off this year<br/>\nand that was the fact that our house flooded from a burst pipe on Jan 3, so<br/>\n2010 got off to a bad start for us. Two levels of our home were completely<br/>\nflooded. The basement had water raining through the ceiling vents and down<br/>\nthe walls so everything had to be removed and replaced: ceilings, walls,<br/>\nflooring, furniture, etc. They packed up all of our belongings and it all<br/>\nwent into storage. We moved into a small apartment above our garage,<br/>\nthinking it would be a month or so and we could move back into the house.<br/>\nIt&#39;s like a studio apt or extended stay hotel, it has a shower, fridge,<br/>\nsmall kitchen space. We were OK there for a while but it got really HARD.<br/>\nDealing with the contractors was a nightmare, strain on our marriage too.<br/>\nAll 3 of us sleeping in a queen sized bed sucked and we started sleeping at<br/>\nthe house as soon as we could (our bedroom was OK, on the 3rd floor, but we<br/>\nonly slept there on weekends because of the noise and smells during the<br/>\nweek). <br/>\n <br/>\nSo between Damon wanting to stay HOME and me feeling cramped with nothing to<br/>\ndo in the small apt, it was tense. I&#39;d drag him to the children&#39;s museum,<br/>\nindoor play places (a must have in the NW!), but most times it felt like<br/>\ndragging, he wouldn&#39;t play, he&#39;d just sit next to me and ask when we could<br/>\ngo home and play wii. Even when I tried to make the outing really special,<br/>\nit felt like so much work and he just wanted to go home. I read a lot about<br/>\nhow many kids go through that sort of phase and I stopped worrying so much<br/>\nthat he wasn&#39;t normal. A few times I know he had a wonderful time -- in Feb<br/>\nwe went to a play of Pinocchio, then had lunch downtown, then toured the art<br/>\nmuseum and took pictures of Damon in front of the sculptures. But the next<br/>\ntime a play came up he wouldn&#39;t go.<br/>\n <br/>\nWe finally moved back into our house at the end of April, got boxes<br/>\ndelivered early May, but the house wasn&#39;t completely DONE done, we still<br/>\nhave a few things to do and furniture to buy (to replace what was ruined).<br/>\nMy big consignment sale event was mid May (also months spent planning that),<br/>\nthen we went to the LIG Conference, so nothing happened around the house<br/>\nuntil June. We are still in a sort of limbo with the TV and wii still in the<br/>\napartment and boxes all over the place. If I spend a day emptying boxes, I&#39;m<br/>\nignoring Damon, except when I did his room, he played with the toys I was<br/>\nunpacking. I can really relate to the recent post about Keeping House, I<br/>\nfeel I&#39;m neglecting my kid when I work on the house! He just plays wii. But<br/>\nit so needs to get done!<br/>\n <br/>\n <br/>\nDo you go to a playgroup?  <br/>\n**Nothing regular. We have plenty of friends we can make play dates with,<br/>\nand we&#39;re starting to again. We didn&#39;t really invite friends over Jan-May<br/>\nbecause there&#39;s hardly room in the apt, so I was trying to get us out more.<br/>\nNow I&#39;m thinking about inviting kids over again, once we get the basement<br/>\nset up and move the wii down there!<br/>\n <br/>\n <br/>\nDo you have memberships to the zoo and the museum?  <br/>\n**We did, but they expired and I haven&#39;t renewed due to Damon not wanting to<br/>\ngo. I think it might be time to pick those up again. We have been using a<br/>\npass you can borrow from the library here (it&#39;s a membership the library<br/>\nbought) for one of the museums.<br/>\n <br/>\n <br/>\nDo you have a collection, or photos of things you&#39;ve done? You could <br/>\nmake a letter every week (or blogpost) for your mother-in-law showing <br/>\ncool things he couldn&#39;t have done if he were in school. <br/>\n**I do have a lot of photos, but it would take time to sort through and<br/>\norganize. I&#39;m way behind on that since my computer where I keep the photos<br/>\nwas in storage until recently and is still not hooked up to this one. I<br/>\nknow, excuses, excuses, they are getting in the way!<br/>\n<br/>\n<br/>\n<br/>\nUh.... Yes. I&#39;m sorry you didn&#39;t feel some of that pressure from this <br/>\ngroup. I&#39;m sorry when your husband said (...and I&#39;m trusting your <br/>\naccount and hoping you weren&#39;t just pretending...) &quot;he was fine with <br/>\nDamon staying home with me (mom) as long as he was learning something&quot; <br/>\nthat it didn&#39;t strike you as a little pressure to make unschooling <br/>\nlook good!! <br/>\n**I want to make it look good! Amazing even! I have all these ideas and<br/>\naspirations and things I want to share with my son, but I don&#39;t want to<br/>\nforce it or have it become unfun. He senses when I or his dad might be<br/>\n&quot;teaching&quot; him something and covers his ears! Geoff is a wealth of knowledge<br/>\non many topics and always has interesting facts to share (I learn from him<br/>\nall the time!) but Damon tends to act bored. I am guilty of waiting for him<br/>\nto show some interest before I pursue things and less of the strewing<br/>\ninteresting things just because. That can change though! I think we&#39;ve been<br/>\njust getting by this year with the house issue and now is the time for a<br/>\nfrest start. We&#39;ve been getting out a bit more, baby steps. Although<br/>\nyesterday we bought the new Lego Harry Potter game and came home and played<br/>\nfor many hours! Today we ate lunch with dad, had a play date with a friend,<br/>\nplayed at a park, then dinner at home, then more wii. I&#39;m sure it doesn&#39;t<br/>\nhelp that Damon has been telling people he is wii-schooled.<br/>\n <br/>\n <br/>\nI think you should chill completely to a standstill until maybe July <br/>\n7. Be sweet and generous and interesting, maybe sexy, maybe <br/>\nfascinating. Cook. Leave notes for people. Send your mother in law <br/>\na thank you card for something--anything. Turn your back on the crazy <br/>\nmess you described to us. Step away from it emotionally and <br/>\nmentally. Step away from it physically. Do different things, GOOD <br/>\nthings, charming things.<br/>\n<br/>\nIn a week, when you&#39;re calm, do those things your husband asked you to <br/>\ndo, and do them generously. You&#39;re risking having a child in school. <br/>\nIt&#39;s not a good risk to take.<br/>\n<br/>\nMaybe look at the links above, but not a whole lot of other <br/>\nunschooling stuff. Take a break from it. Remember it&#39;s supposed to <br/>\nbe one of many things you do with the family you love. You can&#39;t be <br/>\nlooking at your husband as the enemy of unschooling. You need to <br/>\nreview your vows, look at your wedding photos, get centered again. <br/>\n <br/>\n**This is getting quite long, but I really want to say THANK YOU to Sandra<br/>\n(and Pam) for the kindness and great ideas. I appreciate the time you spent<br/>\non my issue and thoughts you shared. I have read the links above and will<br/>\nhave to read more later, say in a week or so. We are spending this coming<br/>\nholiday weekend with the Grandma in question (my MIL), so I might have to<br/>\nshow her some of the stuff I bought or maybe I&#39;ll just jot down a list of<br/>\nthings we covered this year in homeschool. ;) I hate asking him to perform<br/>\nor show off what he knows, so hopefully she can believe me. (She is more apt<br/>\nto ask him questions she thinks he should know, like what number comes after<br/>\n38 and before 40? And Damon is prone to saying I DON&#39;T KNOW! Leave me<br/>\nalone!) Coincidentally we are meeting her next weekend too, at a ranch in<br/>\ncentral Oregon where we will ride pur dirt bikes while she watches Damon, so<br/>\n2 doses of Grandma in 2 weeks! Not sure it will help our marriage much, but<br/>\nwe&#39;ll have time in the car. Wish us luck!<br/>\n <br/>\nKim in Oregon<br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] husband not on unschooling train","postDate":"1277978806","msgId":55567,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk4QjI5QjA2LUUxQ0YtNDFDNC1CMzUwLTJCNDE1QzU5NDQxM0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDA3ZGMwMWNiMThiNCQ4YmQwYWRjMCQwNjBmYThjMEBHb256bz4=","referencesHeader":"PDA3ZGMwMWNiMThiNCQ4YmQwYWRjMCQwNjBmYThjMEBHb256bz4="},"prevInTopic":55565,"nextInTopic":55568,"prevInTime":55566,"nextInTime":55568,"topicId":55561,"numMessagesInTopic":0,"msgSnippet":"... Think of your husband and mother-in-law living under great fear for your son. You want the change so it s up to you to find ways for your husband not to","messageBody":"<div id=\"ygrps-yiv-954618778\">This was the Word a Day quote today:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Neither a man nor a crowd nor a nation can be trusted to act  <br/>\n&gt; humanely or to think sanely under the influence of a great fear. - <br/>\n&gt; Bertrand Russell, philosopher, mathematician, author, Nobel laureate  <br/>\n&gt; (1872-1970)<br/>\n<br/>\n </span></blockquote>Think of your husband and mother-in-law living under great fear for  <br/>\nyour son. You want the change so it&#39;s up to you to find ways for your  <br/>\nhusband not to fear it. It&#39;s not up to him to not fear. It&#39;s not up to  <br/>\nhim to get unschooling. It&#39;s up to him to love your child and in the  <br/>\nface of fear, he&#39;s doing what he thinks is best.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":67727291,"authorName":"wtexans","from":"&quot;wtexans&quot; &lt;wtexans@...&gt;","profile":"wtexans","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: husband not on unschooling train","postDate":"1277949511","msgId":55565,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkwZ3NvNytqOWs0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDA3ZGMwMWNiMThiNCQ4YmQwYWRjMCQwNjBmYThjMEBHb256bz4="},"prevInTopic":55564,"nextInTopic":55567,"prevInTime":55564,"nextInTime":55566,"topicId":55561,"numMessagesInTopic":0,"msgSnippet":"===So maybe the advice I need is how to strengthen my marriage?=== Do what you need to so that the heat your husband is taking from his mother is lessened.","messageBody":"<div id=\"ygrps-yiv-92379687\">===So maybe the advice I need is how to strengthen my marriage?===<br/>\n<br/>\nDo what you need to so that the heat your husband is taking from his mother is lessened. Shift your perspective so that you see that by helping him you&#39;re helping your marriage, which helps unschooling remain an option. <br/>\n<br/>\nWhen he&#39;s comfortable with what y&#39;all are doing, it&#39;ll be easier for him to respond to his mom&#39;s questions. If having a plan in place makes him comfortable, then it&#39;s worth making a plan. <br/>\n<br/>\nIf the concerns are reading and math, address just those things rather than doing a whole curriculum. If you can afford things like computer games and the types of card and board and other games you find at teacher supply stores, find out if your husband would be comfortable using those rather than a more structured curriculum. Would he be comfortable defending those to his mother? Do what makes him comfortable, because you can always work back from that as time goes on.<br/>\n<br/>\nOur experience has been that our son&#39;s grandparents&#39; worries have lessened as he&#39;s gotten older -- we&#39;ve been unschooling for long enough that they are able to see that, yes, he&#39;s learned to read and add and subtract and multiply and divide and he plays well with other kids and isn&#39;t lonely or unhappy. There&#39;s still one grandparent who can&#39;t wrap her brain around unschooling, but she&#39;s relaxed as the years have passed. That doesn&#39;t mean she still doesn&#39;t worry, but she also worries about her grandkids who are in school -- the worry&#39;s not limited to just &quot;Andrew the Unschooled Kid&quot;. Bottom-line, she wants to be sure ALL of her grandkids achieve whatever they want to once they&#39;re beyond school-age and that they are healthy and happy along the way. Even though it has seemed at times like it was an unschooling issue, it actually hasn&#39;t been. That&#39;s been a helpful perspective for me to remember.<br/>\n<br/>\nGlenda</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] husband not on unschooling train","postDate":"1277948663","msgId":55564,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRDMkJGMkY3LjMwMDA3MDBAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PDA3ZGMwMWNiMThiNCQ4YmQwYWRjMCQwNjBmYThjMEBHb256bz4=","referencesHeader":"PDA3ZGMwMWNiMThiNCQ4YmQwYWRjMCQwNjBmYThjMEBHb256bz4="},"prevInTopic":55562,"nextInTopic":55565,"prevInTime":55563,"nextInTime":55565,"topicId":55561,"numMessagesInTopic":0,"msgSnippet":"... They sound like they ll be happier if you have a plan - so maybe you need one that better describes and supports unschooling. Right now it does sound like","messageBody":"<div id=\"ygrps-yiv-1261576819\">On 6/30/2010 5:30 PM, Kim Zerbe wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Grandma wants to know if you&#39;ve found him a<br/>\n&gt; math curriculum yet and stop pretending that you are looking into it, just<br/>\n&gt; buy something so I can tell her you have a PLAN!<br/>\n<br/>\n </span></blockquote>They sound like they&#39;ll be happier if you have a plan - so maybe you <br/>\nneed one that better describes and supports unschooling. Right now it <br/>\ndoes sound like you&#39;ve been too cavalier. Unschooling is &quot;something.&quot; It <br/>\nisn&#39;t just nothing. But you might have made it appear to be nothing.<br/>\n<br/>\nIdeas:<br/>\n<br/>\nPrint out an unschooling course of study - there are a couple to choose <br/>\nfrom on Sandra&#39;s site. One was written by Carol Narigon and then I <br/>\nstarted with hers and did a bunch of adding and rewriting to suit my <br/>\npurposes. You are free to edit for your own purposes. <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/acme1\">http://sandradodd.com/acme1</a><br/>\n<br/>\nKeep records to show your husband. He might need some things to say to <br/>\nhis mom beyond that your son played all day. Equip him. You could use <br/>\nthis Record-Keeping for Unschoolers form, rather than put it into <br/>\nconventional subjects. <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://learninghappens.wordpress.com/record-keeping-for-unschoolers/\">http://learninghappens.wordpress.com/record-keeping-for-unschoolers/</a><br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] husband not on unschooling train","postDate":"1277945536","msgId":55562,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEMxNDdFODUwLTE0NkMtNDY3NC1BM0RGLTQ2MEYxQjhBNTJCRkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDA3ZGMwMWNiMThiNCQ4YmQwYWRjMCQwNjBmYThjMEBHb256bz4=","referencesHeader":"PDA3ZGMwMWNiMThiNCQ4YmQwYWRjMCQwNjBmYThjMEBHb256bz4="},"prevInTopic":55561,"nextInTopic":55564,"prevInTime":55561,"nextInTime":55563,"topicId":55561,"numMessagesInTopic":0,"msgSnippet":"-=-but I m struggling with a husband -=- Don t struggle. -=- lately we seem to be fighting or having heated discussions which is leaving me uncomfortable. I","messageBody":"<div id=\"ygrps-yiv-7769419\">-=-but I&#39;m struggling with a husband -=-<br/>\n<br/>\nDon&#39;t struggle.<br/>\n<br/>\n-=- lately<br/>\nwe seem to be fighting or having heated discussions which is leaving me<br/>\nuncomfortable. I feel attacked. I don&#39;t like arguing with my husband-=-<br/>\n<br/>\nThen don&#39;t argue.  Try not to feel attacked.  Feel that discomfort and  <br/>\nstop fighting.<br/>\n<br/>\n-=-So maybe the advice I<br/>\nneed is how to strengthen my marriage? -=-<br/>\n<br/>\nYou might want to read the archives of this list:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://uk.groups.yahoo.com/group/unschoolingpartnerships/\">http://uk.groups.yahoo.com/group/unschoolingpartnerships/</a><br/>\n<br/>\n-=-husband not on unschooling train-=-<br/>\n<br/>\nThinking of it as a train, you seem to be suggesting you&#39;ve left the  <br/>\nstation without him.  But you&#39;re still home, and that&#39;s good.   If you  <br/>\nmove away from the proverbial, metaphorical train tracks and look at  <br/>\nnest building, it should help:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/nest\">http://sandradodd.com/nest</a><br/>\n<br/>\n-=- In my mind, we<br/>\nwould prove how awesome unschooling is in this one year that dad would<br/>\nsupport future years without question.)-=-<br/>\n<br/>\nDid you go to a conference?<br/>\nDid you keep a blog?<br/>\nDid you make friends with other unschooling families?<br/>\n<br/>\n-=-He comes home saying<br/>\nthings like: Damon needs a curriculum, when are you going to buy him a<br/>\ncurriculum? -=-<br/>\n<br/>\nIf you have a bunch of money, buy one.  Buy Oak Meadow, or sign up  <br/>\nwith Clonlara.<br/>\nIf you don&#39;t have a bunch of money, go here and create one:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/unschoolingcurriculum\">http://sandradodd.com/unschoolingcurriculum</a><br/>\n<br/>\nYou&#39;re talking first grade.  Don&#39;t over-react.<br/>\n<br/>\n-=- I had to endure 20 minutes of crap from my mom about how we are<br/>\nruining our son, how he is a loser and he&#39;ll never be able to get a  <br/>\ngood job<br/>\nin the real world.-=-<br/>\n<br/>\nYour mom or your mother in law?<br/>\nIf you thought of it as &quot;crap,&quot; I doubt you were very analytical about  <br/>\nwhat her emotions and motives were so that you could reassure her.<br/>\n<br/>\n-=- I had to endure 20 minutes of crap from my mom about how we are<br/>\nruining our son, how he is a loser and he&#39;ll never be able to get a  <br/>\ngood job<br/>\nin the real world. He needs more friends. He needs more activities and<br/>\nlessons. He needs structure. Grandma wants to know if you&#39;ve found him a<br/>\nmath curriculum yet and stop pretending that you are looking into it,  <br/>\njust<br/>\nbuy something so I can tell her you have a PLAN!-=-<br/>\n<br/>\nAh.<br/>\nWhen you wrote &quot;my mom&quot; did you mean your husband?<br/>\n<br/>\nProofreading posts is a really good idea, but letting things slip that  <br/>\nway can be even better, if you see something you didn&#39;t know you had  <br/>\nthought, written and mailed.<br/>\n<br/>\nIf you were pretending that you were looking into it, that&#39;s pretty bad.<br/>\nIf you&#39;re being dodgy and dishonest, what they were saying isn&#39;t crap  <br/>\nat all.<br/>\n<br/>\nJust buy something so he can tell her you have a plan!  Just do it.<br/>\nIf that&#39;s all it takes to end this noise for another year, do it!<br/>\n<br/>\n-=-What lessons will I sign him up for? If I don&#39;t have a<br/>\nPLAN in place by the end of summer, Geoff says HE will enroll Damon in<br/>\nschool!!! Now this is the ultimate insult. (I may have yelled NO HE  <br/>\nWON&#39;T!)-=-<br/>\n<br/>\nI thought you said you didn&#39;t want to throw your marriage away.<br/>\nHe has as much right to enroll your son in school as you have to keep  <br/>\nhim out against your husband&#39;s will.  In fact, he has MORE right to do  <br/>\nthat than you do to homeschool, let alone unschooling.<br/>\n<br/>\n-=-And Geoff has made it very clear that he does NOT WANT to send<br/>\nDamon to school, but he feels I&#39;m too unstructured. -=-<br/>\n<br/>\nSo be more structured.   I don&#39;t see the problem with that.  Do you go  <br/>\nto a playgroup?  Do you have memberships to the zoo and the museum?   <br/>\nDo you have a collection, or photos of things you&#39;ve done?  You could  <br/>\nmake a letter every week (or blogpost) for your mother-in-law showing  <br/>\ncool things he couldn&#39;t have done if he were in school.<br/>\n<br/>\n-=-Basically he wants me to<br/>\nshow him some sort of PLAN of action (and I&#39;m not clear what that IS!)  <br/>\nthat<br/>\nhe will be satisfied with (or maybe that will satisfy his mom?) so  <br/>\nDamon can<br/>\nremain at home. Apparently Year 1 was not very impressive. To him  <br/>\nanyway. -=-<br/>\n<br/>\nApparently not.  Perhaps you should have made it very impressive.<br/>\nPerhaps you&#39;re getting another chance, and you should figure out how  <br/>\nto make an impressive unschooling environment.<br/>\n<br/>\nI think everyone should.  I think you should&#39;&#39;ve done that last year.<br/>\n<br/>\n-=-I also feel this pressure to make<br/>\nunschooling look like the best thing EVER, not just to me and Damon, but<br/>\nsomehow so Geoff and his mom can see it too.-=-<br/>\n<br/>\nUh.... Yes.  I&#39;m sorry you didn&#39;t feel some of that pressure from this  <br/>\ngroup. I&#39;m sorry when your husband said (...and I&#39;m trusting your  <br/>\naccount and hoping you weren&#39;t just pretending...)  &quot;he  was fine with  <br/>\nDamon staying home with me (mom) as long as he was learning something&quot;  <br/>\nthat it didn&#39;t strike you as a little pressure to make unschooling  <br/>\nlook good!!<br/>\n<br/>\n-=-I felt pretty confident he would be<br/>\n&quot;learning something&quot; and was happy with that arrangement! In my mind, we<br/>\nwould prove how awesome unschooling is in this one year that dad would<br/>\nsupport future years without question.-=-<br/>\n<br/>\nSomething happened.  It&#39;s not enough for it to be just in your mind.   <br/>\nIt should be cool looking to the neighbors, to strangers.<br/>\n<br/>\nI just added a new quote at the top of this page, just before I saw  <br/>\nyour e-mail:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/spouses\">http://sandradodd.com/spouses</a><br/>\n<br/>\nI think you should chill completely to a standstill until maybe July  <br/>\n7.  Be sweet and generous and interesting, maybe sexy, maybe  <br/>\nfascinating.  Cook.  Leave notes for people.  Send your mother in law  <br/>\na thank you card for something--anything.  Turn your back on the crazy  <br/>\nmess you described to us.  Step away from it emotionally and  <br/>\nmentally.  Step away from it physically.  Do different things, GOOD  <br/>\nthings, charming things.<br/>\n<br/>\nIn a week, when you&#39;re calm, do those things your husband asked you to  <br/>\ndo, and do them generously.  You&#39;re risking having a child in school.   <br/>\nIt&#39;s not a good risk to take.<br/>\n<br/>\nMaybe look at the links above, but not a whole lot of other  <br/>\nunschooling stuff.  Take a break from it.  Remember it&#39;s supposed to  <br/>\nbe one of many things you do with the family you love.  You can&#39;t be  <br/>\nlooking at your husband as the enemy of unschooling.  You need to  <br/>\nreview your vows, look at your wedding photos, get centered again.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":208961162,"authorName":"Kim Zerbe","from":"&quot;Kim Zerbe&quot; &lt;kim.zerbe@...&gt;","profile":"zerbe2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"husband not on unschooling train","postDate":"1277944200","msgId":55561,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA3ZGMwMWNiMThiNCQ4YmQwYWRjMCQwNjBmYThjMEBHb256bz4="},"prevInTopic":0,"nextInTopic":55562,"prevInTime":55560,"nextInTime":55562,"topicId":55561,"numMessagesInTopic":0,"msgSnippet":"I know this has been brought up before and this won t be the last time, but I m struggling with a husband who is not on board with unschooling. I thought he","messageBody":"<div id=\"ygrps-yiv-1411485798\">I know this has been brought up before and this won&#39;t be the last time, but<br/>\nI&#39;m struggling with a husband who is not on board with unschooling. I<br/>\nthought he was. We have similar ideas of how to parent our child, but lately<br/>\nwe seem to be fighting or having heated discussions which is leaving me<br/>\nuncomfortable. I feel attacked. I don&#39;t like arguing with my husband, but I<br/>\ncannot accept his ultimatum. I don&#39;t know what to do.<br/>\n <br/>\nOver a year ago he agreed that Damon would not be attending public<br/>\nKindergarten and he (dad) was fine with Damon staying home with me (mom) as<br/>\nlong as he was learning something. (I felt pretty confident he would be<br/>\n&quot;learning something&quot; and was happy with that arrangement! In my mind, we<br/>\nwould prove how awesome unschooling is in this one year that dad would<br/>\nsupport future years without question.) I had already rejected sending my<br/>\nchild off to preschool as many of my friends were doing.<br/>\n <br/>\nSo we basically continued doing what we had been doing for 5 years, living<br/>\nlife, learning as we go, doing a melange of things from day to day, with the<br/>\nadded knowledge that this year people expected him to be in school and there<br/>\nmight even be some expecation (from family and friends) that he &quot;should&quot; be<br/>\nlearning certain things or hitting certain milestones. I don&#39;t have much<br/>\ncontact with my own family, so there&#39;s little conflict to deal with there. I<br/>\ndo have a sister with 5 kids who wants to know more about homeschooling as 2<br/>\nof her 3 have seen injustices in the school system and she herself has been<br/>\npushed out of participating in the PTO. (That may return as a new topic<br/>\nsoon! Although I don&#39;t think she&#39;s ready to unschool!)<br/>\n <br/>\nWe do however have a great close relationship with Geoff&#39;s mom, she lives<br/>\njust over an hour away from us and we see her at least a couple times a<br/>\nmonth. She&#39;s a kind and loving grandma to Damon. But lately she is getting<br/>\nquite vocal about her opinion that he needs to be in school. She has<br/>\naddressed her concerns to me, but I think I was too cavalier with my<br/>\nresponses (he&#39;ll read when he&#39;s ready, he has plenty of friends, he doesn&#39;t<br/>\nneed to go to bed now there&#39;s nowhere we need to be tomorrow). She doesn&#39;t<br/>\nlike our schedule. I thought we were OK with her, that she has figured out<br/>\nthat we are different than her other kids and what we are doing works for<br/>\nus. Apparently not. She has taken up her cause with my husband, calling him<br/>\nat work or on his cell phone when he&#39;s not at home. He comes home saying<br/>\nthings like: Damon needs a curriculum, when are you going to buy him a<br/>\ncurriculum? I had to endure 20 minutes of crap from my mom about how we are<br/>\nruining our son, how he is a loser and he&#39;ll never be able to get a good job<br/>\nin the real world. He needs more friends. He needs more activities and<br/>\nlessons. He needs structure. Grandma wants to know if you&#39;ve found him a<br/>\nmath curriculum yet and stop pretending that you are looking into it, just<br/>\nbuy something so I can tell her you have a PLAN!<br/>\n <br/>\nIt&#39;s all about having a PLAN now. What is my plan for him? How will he learn<br/>\nreading and math? What lessons will I sign him up for? If I don&#39;t have a<br/>\nPLAN in place by the end of summer, Geoff says HE will enroll Damon in<br/>\nschool!!! Now this is the ultimate insult. (I may have yelled NO HE WON&#39;T!)<br/>\nIt&#39;s not that I&#39;ve been doing NOTHING with Damon for a year (6 yrs) but some<br/>\ndays when dad comes home from work it does look a lot like nothing happened<br/>\nall day. And Geoff has made it very clear that he does NOT WANT to send<br/>\nDamon to school, but he feels I&#39;m too unstructured. Basically he wants me to<br/>\nshow him some sort of PLAN of action (and I&#39;m not clear what that IS!) that<br/>\nhe will be satisfied with (or maybe that will satisfy his mom?) so Damon can<br/>\nremain at home. Apparently Year 1 was not very impressive. To him anyway. <br/>\n <br/>\nWe&#39;ve been married over 16 years, 20 total together (met in college, age 19<br/>\nand 20), and we&#39;ve been through our share of ups and downs so I am not<br/>\ninterested in throwing my marriage out the window in favor of defending my<br/>\ndesire to unschool our child (we have 1 child who just turned 6 last week).<br/>\nI just reread the page on Divorce in Sandra&#39;s Big Book and it says: Married<br/>\nand school is better than divorced and unschooling. So maybe the advice I<br/>\nneed is how to strengthen my marriage? I also feel this pressure to make<br/>\nunschooling look like the best thing EVER, not just to me and Damon, but<br/>\nsomehow so Geoff and his mom can see it too.<br/>\n <br/>\nThanks,<br/>\n <br/>\nKim in Oregon<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":55465,"nextTopicId":55593}}