{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Parental anxiety","postDate":"1534571152","msgId":78428,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyQTk4NDQ1LTIzNkQtNEJBRC1CMUNBLTFGMjVGOEU4NDk3N0BTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":78427,"nextInTime":78429,"topicId":78428,"numMessagesInTopic":0,"msgSnippet":"Lisa wrote about anxiety: _________ In my son s kindergarten class there is a child with two parents who were really anxious about her (invisible to me)","messageBody":"<div id=\"ygrps-yiv-144172094\">Lisa wrote about anxiety:<br/>\n_________<br/>\n<br/>\nIn my son&#39;s kindergarten class there is a child with two parents who were really anxious about her (invisible to me) disabilities and sensitivities, and the first day was clearly very fretful and difficult for them—the parents—but I had the opportunity to observe the child when they were gone, and she seemed to do *much* better away from them and all their anxiety. Their anxiety and inability to manage it might well be the actual source of her &quot;disabilities.&quot; <br/>\n<br/>\nI might have *been* them three or four years ago, with my then-youngest child. I have done a *lot* of intentional work, because peace and well-being for learning were priorities for me, to sort through my fears and anxieties and put the useless ones to rest. <br/>\n<br/>\nI have known children with similar parents with similar concerns and beliefs, and those children were stuck at home, without the chance to thrive and relax elsewhere in the presence of other less anxious people--OR maybe even to just be at school with people who saw them just as broken, but were less personal and attached about it.<br/>\n_____________<br/>\n<br/>\nA few days ago, someone wrote to me on the side, and the story is pretty similar!<br/>\nThe “caravan” was a pop-up camper trailer.  She’s not in north America, and trailers that roll… anyway...<br/>\n_____________<br/>\nbegin quote<br/>\n_______________<br/>\n<br/>\nI sold my caravan to a lady and her 10 year old son whom she said had anxiety. When they came to my home to inspect the caravan the kid was as curious as the other 10 year olds I know, wanting to know how the lock worked on the caravan and asking valid questions about the van I was selling. I saw that he was asking questions that the mother hadn’t thought of. I saw the mother had the cash and the idea in her mind that she wanted this van to help her child with his anxiety and that to back down would mean she would have to face the ‘problem’ again.<br/>\n<br/>\nI realized that it was actually the mother who had the anxiety and because she wasn’t aware enough to see it and deal with it she was projecting it onto her child. Now he has the anxiety, when really he is just a kid who is curious and trying to make sense of the world and is lacking support to do so.<br/>\n________________<br/>\nEnd<br/>\n_______________<br/>\n<br/>\nYears ago, when Asperger’s was first being described and discussed (early 1990s), I noticed that one of the parents had the same traits, but maybe not as marked or severe.  And because Howard Gardner’s multiple intelligences were also new news in those days, it seemed as simple to say that it was a lower level of interpersonal  (and maybe intrapersonal) intelligence.  It didn’t preclude any other intelligences.  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/intelligences\">http://sandradodd.com/intelligences</a><br/>\n<br/>\nMaybe that’s related to the other stories above, and maybe it isn’t.  <br/>\n<br/>\nNot only are intelligences likely to be similar to the biological parents, there are also “the big five” personality traits.  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"https://www.verywellmind.com/the-big-five-personality-dimensions-2795422\">https://www.verywellmind.com/the-big-five-personality-dimensions-2795422</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"https://en.wikipedia.org/wiki/Big_Five_personality_traits\">https://en.wikipedia.org/wiki/Big_Five_personality_traits</a><br/>\n<br/>\nIt won’t hurt a bit for unschooling parents to read and consider some of those things.  Keep them in the back of your mind as you meet other families.  <br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":78390,"nextTopicId":78418}}