{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: parenting agreements and unschooling school","postDate":"1324234522","msgId":64539,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpjbGN1cSt1dmE0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzMjQyMjQ5ODIuODEzMS5ZYWhvb01haWxOZW9Ad2ViMTIwNzA2Lm1haWwubmUxLnlhaG9vLmNvbT4="},"prevInTopic":64538,"nextInTopic":0,"prevInTime":64538,"nextInTime":64540,"topicId":64535,"numMessagesInTopic":0,"msgSnippet":"... *************** Since she s a girl, you may be able to soften the hurt to him by letting him know that girls in divorces often prefer to live with their","messageBody":"<div id=\"ygrps-yiv-806854128\">erika &lt;blissland1234@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; And the issue is, in his opinion the situation isn&#39;t fair. that we need to agree on these lifestyle choices and that it isn&#39;t fair that i allow her things that he doesn&#39;t because she will always choose to be at my house. This argument works on me sometimes, and I get confused about what co-parents have to agree on.<br/>\n </span></blockquote>***************<br/>\n<br/>\nSince she&#39;s a girl, you may be able to soften the hurt to him by letting him know that girls in divorces often prefer to live with their moms once they reach adolescence. It might help. But custody issues are tricky. Sometimes you&#39;re stuck without a lot of good options, but you don&#39;t &quot;have to&quot; agree on lifestyle choices. It&#39;s better when you&#39;re more-or-less on the same page about the biggies like school and medical care, but beyond that, you both agreed to give up some control over the other person&#39;s lifestyle and parenting when you separated. That&#39;s one of the &quot;down sides&quot; of divorce. <br/>\n<br/>\nBut that doesn&#39;t mean you have to be ugly about it! It&#39;s worth considering how much you value your daughter&#39;s feelings and her relationship with her father. Kids generally want to have some kind of positive relationship with a known parent, so do what you can to foster that. That&#39;s not the same as supporting his parenting style by &quot;being consistent&quot;! In fact, it can be more helpful to your daughter&#39;s relationship with her dad to know that she only has to play his way at his house. It takes some of the pressure off her. You can give her a warm, supportive place to relax So That she has more energy to deal with his rules and expectations.  <br/>\n<br/>\nAt the same time, though, it&#39;s important to impress upon her that she can&#39;t use the differences between the two households as ammunition in arguments with her dad, and you can&#39;t &quot;back&quot; her if she tries to get him to change. Can not. You gave up anything like a right to tell him how to run his life when you got divorced. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Since this change I have seen how much of a<br/>\n&gt;  relief of pressure it has been for her, to be able to eat what everyone else eats.<br/>\n </span></blockquote>*******************<br/>\n<br/>\nYes! And even having that relief Some of the time will help - help her be happier in general And help her get along with her dad. But it may be to talk with your daughter about the need to down-play the fact that your lifestyle is different from his - not in the sense of lying, but it Is important that she not throw things up in his face in an argument like &quot;But Mom Lets Me!&quot; Make a deal with her, maybe that you&#39;ll work on saying yes more if she works on being discrete about the differences in lifestyle while at dad&#39;s house.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; So, I feel like I am not unschooling school - that I&#39;m not allowing her a choice in this situation and i feel uncomfortable about it.<br/>\n </span></blockquote>****************<br/>\n<br/>\nTo some extent, it&#39;s not your choice - it&#39;s only half your choice. You can get ugly about it and drag the family into court and likely get your way, but that comes with it&#39;s own complications.<br/>\n<br/>\nMake school contingent on other things working out. If your daughter can get along with dad His way, while you work on saying Yes more at home, then you&#39;ll work on school. Get the &quot;work on school&quot; ball rolling by looking at summer programs and seeing if she can take specific classes at the local school in the fall - art or PE or science or maybe something extracurricular - so she can see you&#39;re holding up your end of the deal. It may be that y&#39;all can soften dad up with good behavior and then start to ease in to school, once he can see she&#39;s not totally ruined by being around all those &quot;mainstream&quot; kids. But for that to have any chance of working, she&#39;s got to be little miss crunchy when she&#39;s with dad. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] parenting agreements and unschooling school","postDate":"1324233757","msgId":64538,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEMxODYzNjQ3LTVDMTAtNDg3My1BRjI4LUQzODU1MTIzRkM5REB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDEzMjQyMjQ5ODIuODEzMS5ZYWhvb01haWxOZW9Ad2ViMTIwNzA2Lm1haWwubmUxLnlhaG9vLmNvbT4=","referencesHeader":"PDEzMjQyMjQ5ODIuODEzMS5ZYWhvb01haWxOZW9Ad2ViMTIwNzA2Lm1haWwubmUxLnlhaG9vLmNvbT4="},"prevInTopic":64535,"nextInTopic":64539,"prevInTime":64537,"nextInTime":64539,"topicId":64535,"numMessagesInTopic":0,"msgSnippet":"... By that logic, if you re both parenting strictly, as soon as she feels running away is an option, she ll choose neither house.(And 11 wouldn t be too young","messageBody":"<div id=\"ygrps-yiv-1660254407\">On Dec 18, 2011, at 11:16 AM, erika wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; it isn&#39;t fair that i allow her things that he doesn&#39;t<br/>\n&gt;  she will always choose to be at my house.<br/>\n<br/>\n </span></blockquote>By that logic, if you&#39;re both parenting strictly, as soon as she feels running away is an option, she&#39;ll choose neither house.(And 11 wouldn&#39;t be too young to run away.)<br/>\n<br/>\nIt sounds like he&#39;s running an experiment with tightly controlled conditions, not growing a relationship with another human being. What he realizes is that unless she&#39;s kept in the cage all the time -- e.g., extending it to your house -- she won&#39;t willingly go back in the cage when she returns to his house.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  get confused about what co-parents have to agree on<br/>\n<br/>\n </span></blockquote>There isn&#39;t a &quot;have to&quot;. Ideally, you each make choices that support the other&#39;s reasonable requests. Ideally, you each are aware of when your requests might be stepping on the others&#39; toes and either ask as you would a friend for something you know is inconvenient for them or don&#39;t ask.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So, I feel like I am not unschooling school -<br/>\n&gt; that I&#39;m not allowing her a choice in this situation<br/>\n<br/>\n </span></blockquote>It won&#39;t help you think clearly to use muddy phrasing like unschooling school. Keep it simple and clear: You&#39;re not allowing her to choose.<br/>\n<br/>\nYou didn&#39;t go into why you won&#39;t allow her the choice. Is it just because of her father? Because you&#39;d both agreed not to allow it before the divorce?<br/>\n<br/>\n11 is a fairly typical age to want school or to start being concerned about not &quot;learning enough.&quot; And social kids get even more social. (Which is just the beginning of the next social step up as teens.)<br/>\n<br/>\nIf you&#39;re not filling her up socially, no list of what you do and how difficult it is to do more, will make her need less. She&#39;s going to continue to express that her needs aren&#39;t being met by saying home is boring. If her needs are important, you&#39;ll find a way for her to connect socially with kids, either through school or finding -- or creating yourself -- groups of kids for her to be with.<br/>\n<br/>\nWhat else is she needing? If she could wave a magic wand and create what she wanted, what would it be? Keep up a running dialogue with her. Write down what she wants so she knows you&#39;re taking it seriously. And then do take is seriously.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":216757719,"authorName":"erika","from":"erika &lt;blissland1234@...&gt;","profile":"blissland1234","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"parenting agreements and unschooling school","postDate":"1324224982","msgId":64535,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMjQyMjQ5ODIuODEzMS5ZYWhvb01haWxOZW9Ad2ViMTIwNzA2Lm1haWwubmUxLnlhaG9vLmNvbT4="},"prevInTopic":0,"nextInTopic":64538,"prevInTime":64534,"nextInTime":64537,"topicId":64535,"numMessagesInTopic":0,"msgSnippet":"Hi. I have never posted before but I have been reading all of the posts daily, enjoying everyone s imput.  I am a mother of an 11 year-old girl who has been","messageBody":"<div id=\"ygrps-yiv-1100846871\">Hi. I have never posted before but I have been reading all of the posts daily, enjoying everyone&#39;s imput.  I am a mother of an 11 year-old girl who has been unschooled (not radically though, as you will read) her whole life and have two issues that are burning for me right now and I&#39;m curious how readers of this list would respond. I will try to cut to the chase.<br/>\n<br/>\nThe first, is that I am struggling with sending my daughter to her father, whom i&#39;ve been separated from for years. Together he and I agree on dividing her time half and half but really, she wants to live with me and for him to visit here and there. One of the main reasons is that he is a very controlling father who believes that when she is at his house she must live the lifestyle he chooses - which is quite eco-fanatical and overly anti-mainstream in my opinion. There is quite a list of rules there but most difficult is that she has to follow his strict diet and promise when she goes to other&#39;s houses that she won&#39;t eat anything forbidden (although she eats what she wants and tells me all about it later). Over the last year in my house, I have let go of his insistence that we be &#39;consistant&#39; and not make changes in the diet she has had since she was young (even though she&#39;s been fighting it since that time). Since this change I have seen how much of a<br/>\n relief of pressure it has been for her, to be able to eat what everyone else eats.<br/>\n<br/>\nAnd the issue is, in his opinion the situation isn&#39;t fair. that we need to agree on these lifestyle choices and that it isn&#39;t fair that i allow her things that he doesn&#39;t because she will always choose to be at my house. This argument works on me sometimes, and I get confused about what co-parents have to agree on. Have any of you been in this situation?<br/>\n <br/>\nThe second issue is when to unschool unschooling. My daughter has been begging me to go school since she was old enough to know what school is. These days her time is about half full with friends and movement We have one full day of homeschool family meeting which she loves to meet and play with her small group of friends. She goes another day or two to a circus class, and she sees her school friends after school and on the weekends. She also spends the nights at friends houses here and there. Besides the neighbor kids I have to take her at least an hour away to see these other homeschooled kids. Her reasons for wanting to go to school, she says, is that she wants LOTS of friends - she wants to be surrounded by kids to do things with on a daily basis that all live nearby, and she also says that she wants to be forced to learn things (I guess what she sees her friends doing in their homework). She tells her school friends how boring it is to be at home<br/>\n and they should not envy her. She also has a hard time connecting with school kids because their lives revolve around school. Her dad is completely anti-school and won&#39;t hear about it. Makes his skin crawl to think she wants to &#39;join the crowd.&#39; He thinks she doesn&#39;t need more than a few friends and boredom is good for her. It seems that all my friends in our homeschooling group&#39;s kids don&#39;t ever ask to go to school.<br/>\n<br/>\nSo, I feel like I am not unschooling school - that I&#39;m not allowing her a choice in this situation and i feel uncomfortable about it.  any suggestions?<br/>\n<br/>\nerika<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":64519,"nextTopicId":64570}}