{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":0,"authorName":"Michele Moss","from":"&quot;Michele Moss&quot; &lt;michele@...","replyTo":"LIST","senderId":"t1P2leOpweXXQqt6FbIA-fM5_ih2AoQugT-LxINsSueNKP1_BGVTkQDHVB30TkAjU_rlG7_ayXN1AFag-AFdx-Tl9tl7rqPsnXMq","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: inclusive groups was spirited children","postDate":"934678068","msgId":2053,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4xNTQuMjA1My45NTkyNjk3NDFAZUdyb3Vwcy5jb20+"},"prevInTopic":2033,"nextInTopic":0,"prevInTime":2052,"nextInTime":2054,"topicId":2033,"numMessagesInTopic":0,"msgSnippet":"... oh no, i figured you were as busy as i ve been this week.    and i m still trying to get used to the volume of posts that come through this list.   so i","messageBody":"<div id=\"ygrps-yiv-160461583\"><blockquote><span title=\"ireply\">&gt; From:          Brown &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mjcmbrwn@...\">mjcmbrwn@...</a>&gt;<br/>\n&gt; From: Brown &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mjcmbrwn@...\">mjcmbrwn@...</a>&gt;<br/>\n&gt; <br/>\n&gt; Hi Michele<br/>\n&gt; <br/>\n&gt; I haven&#39;t ignored your message - I&#39;ve been thinking about it a lot.<br/>\n&gt; And still haven&#39;t come up with definitive answers &lt;g&gt;<br/>\n<br/>\n </span></blockquote>  oh no, i figured you were as busy as i&#39;ve been this week.  &lt;G&gt;  and <br/>\ni&#39;m still trying to get used to the volume of posts that come through <br/>\nthis list.   so i didn&#39;t think anything of it!<br/>\n<br/>\n The mother of this<br/>\n<blockquote><span title=\"ireply\"> &gt; particular child is a very thoughtful person who believes very<br/>\n&gt; strongly that her children need to learn to be assertive in their<br/>\n&gt; own right, that children should learn to live and manage their own<br/>\n&gt; lives.<br/>\n<br/>\n </span></blockquote>  i agree that children should learn to live and manage their own <br/>\nlives too.  i am raising Sterling to be as independent and <br/>\nself-sufficient as he possibly can be and to learn to solve his own <br/>\nproblems.  However, let&#39;s think about this for a moment.  in fact, <br/>\nlet&#39;s take out the homeschooling variable for a minute to simplify <br/>\nthis even more.  Regardless of how much you would like to let <br/>\nchildren figure out things on their own, they still guidance from <br/>\nsomewhere as the basis for figuring out those things on their own.  <br/>\nthe have not lived long enough to have experienced enough of the world <br/>\naround them to always enough information yet to make sound decisions. <br/>\nthat&#39;s not to say that we should give them the answers or enforce <br/>\ncontrol over their every move... no, that would be managing thier <br/>\nlives for them while they learn nothing by always being told what to <br/>\ndo and when.  <br/>\n<br/>\n She has seen for herself the problems that develop when a<br/>\n<blockquote><span title=\"ireply\"> &gt; child is totally managed / protected by its mother. She wants to see<br/>\n&gt; the children sort out problems for themselves.<br/>\n<br/>\n </span></blockquote>  right...  &quot;totally managed/protected&quot;.  i think we are talking <br/>\nextremes here - all or nothing.  don&#39;t you think there should be some <br/>\nhappy medium somewhere in between?  we provide &quot;guidance&quot; to an <br/>\ninfant in learning lots of new skills.  Before we know they are <br/>\ncapable, we do certain things for them - feed them, change their <br/>\ndiapers, etc.  We hope that they will learn to feed themselves.  Do <br/>\nwe withhold food so that they will learn how to feed themselves when <br/>\nthey are starving enough?  NO!  We provide the guidance initially <br/>\nwhile gradually shifting the responsibility over to them for figuring <br/>\nit out themselves once we know they are armed with the information <br/>\nneeded to figure it out on their own.  <br/>\n<br/>\n  if a child goes to grab a sharp knife, do we let them do it and cut <br/>\ntheir finger off for the sake of &quot;letting them figure things out on <br/>\ntheir own&quot;? not hardly.  <br/>\n<br/>\n  Stepping in and providing guidance at critical milestones of <br/>\ngrowing up does not take away thier opportunity to figure things out <br/>\non their own and make their own decisions, it enhances it!    <br/>\n<br/>\n She would have no<br/>\n<blockquote><span title=\"ireply\"> &gt; problem in me telling her son I don&#39;t like being hit on the head. Or<br/>\n&gt; my son telling hers he doesn&#39;t want to be strangled. She just<br/>\n&gt; doesn&#39;t notice that he doesn&#39;t listen, nor that he is much bigger<br/>\n&gt; and stronger than other kids his age.<br/>\n&gt; <br/>\n&gt; But who makes the house rules?<br/>\n&gt; <br/>\n </span></blockquote>  well, after reading down through the rest of your message and <br/>\nlearning more about the group, then i would say everyone collectively <br/>\nshould make the house rules.  and i hate to use the word rules but <br/>\nactually that&#39;s real life!  everywhere you go, there are rules and <br/>\neven unschooled children need to learn that - whether they figure it <br/>\nout themselves or not, what better place to practice?  If they are <br/>\nserved some rules in the group it gives them a chance to figure it <br/>\nout for themselves in a more neutral environment before going out in <br/>\nthe real world to be crudely awakened on unfamiliar ground.  let&#39;s <br/>\nface it, there are rules everywhere we go!  and breaking some of <br/>\nthose rules can have some pretty serious consequences!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Our group has kids from 0 - 17, and includes a range of acivities<br/>\n&gt; including sports. That does make it difficult to make definitive<br/>\n&gt; rules that can be understood by all ages &lt;sigh&gt;. And again, people&#39;s<br/>\n&gt; ideas about social skills differ considerably.<br/>\n&gt; <br/>\n </span></blockquote>   well, i&#39;m not suggesting that there has to be a lot of complicated <br/>\nridiculous rules.  i think it would undermind the purpose of the <br/>\ngroup!  and too many rules... well then you might as well send them <br/>\nto school where they even have to go pee by the rules.  (sorry so <br/>\ncrude but hey.)  just some basic rules that encourage respect for <br/>\nothers - no hitting or shoving.  are there not at least some rules <br/>\nalready like &quot;no fighting&quot;?  maybe that is too general for a younger <br/>\nchild to grasp.  and some forms of hitting are not done within the <br/>\nscope of fighting, but in other aggressive means like to get <br/>\nsomeone&#39;s attention.  a younger child understands no hitting.  if you <br/>\ncan&#39;t hit, you can&#39;t fight but also if you can&#39;t hit, you can&#39;t <br/>\nphysically disrespect someone.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Some parents don&#39;t believe a parent should &#39;enforce&#39; anything on<br/>\n&gt; children.<br/>\n&gt; <br/>\n </span></blockquote>  Enforce might be a strong word.  maybe direct or guide would be <br/>\nmore appropriate.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; And that is what I have decided is the crux of the matter. We are a<br/>\n&gt; group of very independant people and we try to operate as a<br/>\n&gt; cooperative, and as a consequence have no-one that every one agrees<br/>\n&gt; is &#39;in charge&#39;.<br/>\n&gt; <br/>\n </span></blockquote>  i can understand this philosophy too... and i think it&#39;s great if it<br/>\nworks out.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It is a social session, held in a church complex which has a gym<br/>\n&gt; where the older kids can play basketball, dance etc., a small<br/>\n&gt; outside area with a trampoline, a sandpit and water for the younger<br/>\n&gt; ones, plus rooms to paint, play cards, board games....., and a place<br/>\n&gt; for homeschooling mothers to get together and network. Sounds great,<br/>\n&gt; doesn&#39;t it? <br/>\n<br/>\n </span></blockquote>  yes!  and as i was reading i found myself wishing there was <br/>\nsomething like that here! <br/>\n<br/>\nAnd it is, a lot of the time, I realise as I&#39;m typing.<br/>\n<blockquote><span title=\"ireply\"> &gt; And it seems very important to me to have a place that is inclusive,<br/>\n&gt; so that people can come along freely, and perhaps have their eyes<br/>\n&gt; opened to other ways of doing things. But...... &lt;sigh&gt;<br/>\n&gt; <br/>\n </span></blockquote>  but then if you have to ask yourself whether you would feel <br/>\ncomfortable bringing someone, then i guess it doesn&#39;t fit the bill of <br/>\ninclusive anymore, does it?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Oh Michelle, if you knew how many people would die laughing to hear<br/>\n&gt; &#39;over-cautious&#39; suggested of me! But perhaps you&#39;re right - after 13<br/>\n&gt; years of winning the homeschooling golden spoon award for stirring,<br/>\n&gt; maybe I&#39;ve tired of making enemies &lt;g&gt;  (?? Do you use that<br/>\n&gt; expession &#39;stirring&#39;? As in stirring up trouble??)<br/>\n&gt; <br/>\n </span></blockquote>  happy to be of service and add some giggles to your day!  &lt;G&gt;  i <br/>\nhaven&#39;t heard the expression &quot;stirring up&quot; in your context in a long <br/>\ntime.  my mom used to use it all the time though!<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; I think maybe I&#39;m getting too old and weary to be tolerant. Maybe<br/>\n&gt; I&#39;ve passed the age of inclusiveness, democracy and cooperation and<br/>\n&gt; I just need to start another group where I can be dictator and make<br/>\n&gt; the rules on a take it or leave it basis?<br/>\n&gt; <br/>\n </span></blockquote>  h-m-m-m-m-m.  no comment!  &lt;G&gt;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Thanks, anyway, Michelle, for pushing me into thinking more clearly<br/>\n&gt; about what is bothering me.<br/>\n&gt; <br/>\n&gt; Carol<br/>\n&gt; <br/>\n </span></blockquote>   well, we certainly have a book going here don&#39;t we!  <br/>\n<br/>\nMichele Moss<br/>\nMom of Sterling Tyler age 3 yrs old<br/>\nParents of Spirited Kids Resource Web site:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.icstech.net/~michele\">http://www.icstech.net/~michele</a><br/>\nParents of Spirited Kids Discussion Group:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.egroups.com/list/psk\">http://www.egroups.com/list/psk</a></div>","specialLinks":[]},{"userId":0,"authorName":"Brown","from":"Brown &lt;mjcmbrwn@...","replyTo":"LIST","senderId":"sEMjHua2UJ5NZvC30WSu17CYGyG2b4N11HZWJbhndcMHx9XAqmFBuwb3kSzW2h06fO38JWTb5Afa8xhzbAmSzZ6T","spamInfo":{"isSpam":false,"reason":"0"},"subject":"inclusive groups was spirited children","postDate":"934667085","msgId":2033,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4xNTMuMjAzMy45NTkyNjk3NDFAZUdyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":2053,"prevInTime":2032,"nextInTime":2034,"topicId":2033,"numMessagesInTopic":0,"msgSnippet":"Hi Michele I haven t ignored your message - I ve been thinking about it a lot. And still haven t come up with definitive answers  ... I can t imagine anyone","messageBody":"<div id=\"ygrps-yiv-1806752571\">Hi Michele<br/>\n<br/>\nI haven&#39;t ignored your message - I&#39;ve been thinking about it a lot. And<br/>\nstill haven&#39;t come up with definitive answers &lt;g&gt;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;    their choice of methods for parenting and homeshooling are one<br/>\n&gt; thing - anyone&#39;s kids being allowed to become physically aggressive<br/>\n&gt; with other kids and/or adults is another.  If two children at the<br/>\n&gt; group ended up in a full blown knock down fight, would everyone just<br/>\n&gt; stand around and watch if the parents were of the mindset that they<br/>\n&gt; should be allowed to fight it out as a lesson?  what if one of the<br/>\n&gt; kids drew a knife out of nowhere (or worse yet, the unspeakable!),<br/>\n&gt; what then?   why should &quot;one hit on the head&quot;  done in an obviously<br/>\n&gt; aggressive manner be any different?   being inclusive and respectful<br/>\n&gt; of everyone&#39;s parenting or homeschooling methods should not mean that<br/>\n&gt; anyone (or their kids) should have to endure physical attacks of<br/>\n&gt; aggression - i&#39;m sorry....  spirited, gifted, ADD...  that is no<br/>\n&gt; longer the issue here.  the issue is that this aggressive behavior is<br/>\n&gt; not only being tolerated at someone else&#39;s expense, but by allowing<br/>\n&gt; it, it is encouraging the fact that it&#39;s okay to treat others this<br/>\n&gt; way and a means to get your own way!  this is not right IMO under any<br/>\n&gt; circumstances!<br/>\n<br/>\n </span></blockquote>I can&#39;t imagine anyone not trying to intervene if a kid drew a knife or a<br/>\ngun. Yet there is a continuum of behaviours that lead to that point, and it<br/>\nseems there is almost as great a continuum of parental attitudes. Line<br/>\ndrawing is very difficult. The mother of this particular child is a very<br/>\nthoughtful person who believes very strongly that her children need to learn<br/>\nto be assertive in their own right, that children should learn to live and<br/>\nmanage their own lives. She has seen for herself the problems that develop<br/>\nwhen a child is totally managed / protected by its mother. She wants to see<br/>\nthe children sort out problems for themselves. She would have no problem in<br/>\nme telling her son I don&#39;t like being hit on the head. Or my son telling<br/>\nhers he doesn&#39;t want to be strangled. She just doesn&#39;t notice that he<br/>\ndoesn&#39;t listen, nor that he is much bigger and stronger than other kids his<br/>\nage.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;    it&#39;s nice that the group is inclusive of all parenting and<br/>\n&gt; homeschooling styles but i think it does need a couple &quot;house rules&quot;<br/>\n&gt; that everyone should have to abide by.  how each parent enforces<br/>\n&gt; those rules with thier children is where the everyone else&#39;s respect<br/>\n&gt; of the choice of that parent&#39;s style comes into play.<br/>\n<br/>\n </span></blockquote>But who makes the house rules?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;   no, why should your family be impositioned or deprived of utilizing<br/>\n&gt; the benefits of a group because some kids are being allowed to be<br/>\n&gt; physical and hurt others?  I used to take Sterling to a playgroup at<br/>\n&gt; the local gymnastics center.  it&#39;s intent was to give the kids safe<br/>\n&gt; equipment and area to play in, to learn their social skills when<br/>\n&gt; playing with other kids, and to give parents the environment to be<br/>\n&gt; able to teach their kids these things.  the playgroup was for 2-6 yo.<br/>\n&gt; the rules were simple - no running, no physical contact (hitting,<br/>\n&gt; pushing, shoving),<br/>\n<br/>\n </span></blockquote>Our group has kids from 0 - 17, and includes a range of acivities including<br/>\nsports. That does make it difficult to make definitive rules that can be<br/>\nunderstood by all ages &lt;sigh&gt;. And again, people&#39;s ideas about social skills<br/>\ndiffer considerably.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; parents were to be with their kids at all times,<br/>\n&gt; parents would ensure their kids were following the rules (no matter<br/>\n&gt; what parenting style they chose to use to enforce them).<br/>\n<br/>\n </span></blockquote>Some parents don&#39;t believe a parent should &#39;enforce&#39; anything on children.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &lt;cut&gt; There was a monitor present at all times<br/>\n&gt; and everyone knew that if a child continually broke the rules and the<br/>\n&gt; parent was not doing anything about it, that the monitor could<br/>\n&gt; intervene and they could also be asked to leave if the parent did not<br/>\n&gt; want to participate in keeping the group enjoyable for everyone by<br/>\n&gt; controlling their child.<br/>\n<br/>\n </span></blockquote>And that is what I have decided is the crux of the matter. We are a group of<br/>\nvery independant people and we try to operate as a cooperative, and as a<br/>\nconsequence have no-one that every one agrees is &#39;in charge&#39;.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  With everyone knowing these expectations,<br/>\n&gt; it was a fun place for the kids to go.  but kids will be kids and i<br/>\n&gt; think every single child at some time or another lashed out<br/>\n&gt; inappropriately.  however, it was dealt with immediately because of<br/>\n&gt; the rules that were in place and everyone was able to get past it<br/>\n&gt; quickly, put it behind, and enjoy the rest of the session.  in a<br/>\n&gt; nutshell, learning to treat others the way you want to be treated and<br/>\n&gt; making sure no one gets physically hurt and having fun, was the basis<br/>\n&gt; of the group.<br/>\n&gt;<br/>\n&gt; Perhaps this is the philosophy that needs to be adopted by the group<br/>\n&gt; and implementing any rules necessary for that philosophy to<br/>\n&gt; materialize.  after all, isn&#39;t part of homeschooling teaching values<br/>\n&gt; and respect for others?<br/>\n<br/>\n </span></blockquote>Weeell - I have met people who are in it solely for academic reasons, and<br/>\nfor whom values seem to be remote! And those who tell their children they<br/>\ncan&#39;t associate with mine because we are evil atheists - I personally<br/>\nwouldn&#39;t call that respect - at least we don&#39;t have to contend with that<br/>\ngroup at our activities! &lt;g&gt;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;   i have a question about the group.  what is it&#39;s purpose?  is it a<br/>\n&gt; meeting to discuss homeschooling issues?  is it a social setting for<br/>\n&gt; kids to play?  is it a learning session for kids to get together and<br/>\n&gt; help each other academically?<br/>\n<br/>\n </span></blockquote>It is a social session, held in a church complex which has a gym where the<br/>\nolder kids can play basketball, dance etc., a small outside area with a<br/>\ntrampoline, a sandpit and water for the younger ones, plus rooms to paint,<br/>\nplay cards, board games....., and a place for homeschooling mothers to get<br/>\ntogether and network. Sounds great, doesn&#39;t it? And it is, a lot of the<br/>\ntime, I realise as I&#39;m typing. And it seems very important to me to have a<br/>\nplace that is inclusive, so that people can come along freely, and perhaps<br/>\nhave their eyes opened to other ways of doing things.<br/>\nBut...... &lt;sigh&gt;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;   no, i don&#39;t think you&#39;re a coward.  perhaps a little over-cautious<br/>\n&gt; to not make waves<br/>\n<br/>\n </span></blockquote>Oh Michelle, if you knew how many people would die laughing to hear<br/>\n&#39;over-cautious&#39; suggested of me! But perhaps you&#39;re right - after 13 years<br/>\nof winning the homeschooling golden spoon award for stirring, maybe I&#39;ve<br/>\ntired of making enemies &lt;g&gt;  (?? Do you use that expession &#39;stirring&#39;? As in<br/>\nstirring up trouble??)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; for the group or appear to go against the<br/>\n&gt; principles of the group?  perhaps the principles of the group need to<br/>\n&gt; be better defined.  how long has this group existed?<br/>\n<br/>\n </span></blockquote>Just this year, although it arose out of a previous group that had been<br/>\ngoing about 8 years, and only stopped because the venue was no longer<br/>\navailable.<br/>\n<br/>\nI think maybe I&#39;m getting too old and weary to be tolerant. Maybe I&#39;ve<br/>\npassed the age of inclusiveness, democracy and cooperation and I just need<br/>\nto start another group where I can be dictator and make the rules on a take<br/>\nit or leave it basis?<br/>\n<br/>\nThanks, anyway, Michelle, for pushing me into thinking more clearly about<br/>\nwhat is bothering me.<br/>\n<br/>\nCarol</div>","specialLinks":[]}],"prevTopicId":2049,"nextTopicId":2057}}