{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"John O. Andersen","from":"&quot;John O. Andersen&quot; &lt;andersen@...","replyTo":"LIST","senderId":"nZe93kMU1XyhOdkqY17b7YQe9vYQxe_j4HGQwjGRuXk-WCKxHgQhNAnkcn_VJwjrMyJk6N8Av3SURID6XNcY1iTtjnxchVeFAESpgFXSb0anag","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Unschooling and becoming a hobo","postDate":"947356404","msgId":5541,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4zNjUuNTU0MS45NTkyNjk3NDVAZUdyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":5540,"nextInTime":5542,"topicId":5541,"numMessagesInTopic":0,"msgSnippet":"Hello, Two days ago, we as a family returned home from a car journey which took us from Portland, Oregon to Madison, Wisconsin and back.  We left the day after","messageBody":"<div id=\"ygrps-yiv-128586332\">Hello,<br/>\n<br/>\nTwo days ago, we as a family returned home from a car journey which took us<br/>\nfrom Portland, Oregon to Madison, Wisconsin and back.  We left the day after<br/>\nChristmas.  The trip took us through the desert of Eastern Oregon, the<br/>\nmountains of Northern Idaho and Montana, the Little Bighorn Battlefield<br/>\n(site of Custer&#39;s Last Stand), Mt Rushmore, South Dakota and Southern<br/>\nMinnesota.<br/>\n<br/>\nWe met people, had many hours of interesting conversation, and enjoyed<br/>\nunexpectedly good driving conditions.  We we&#39;re truly fortunate!!!!  I&#39;m<br/>\nglad we drove, because if we had flown, we would have missed all of those<br/>\nhours together and all of that beautiful scenery.  My younger brother who<br/>\nlives in Wisconsin, and travels a lot for business, was most generous in<br/>\nproviding vouchers for us to stay in comfortable, warm, and clean motels<br/>\nalong the way.  Thank goodness for people like him.<br/>\n<br/>\nThis experience helped me to imagine living on the road for more than just a<br/>\ntwo week vacation.  At some point, I&#39;d like to take to the road for an<br/>\nextended period of time.  The idea of becoming a hobo intrigues me<br/>\n(http://www.hobo.com).   Actually, for the right person, at the right stage<br/>\nof life, hoboism could be the perfect career.  It could be an ideal way to<br/>\nlearn while earning your keep; to broaden the mind by seeing the world and<br/>\nmaking a living at the same time.  People who love to write or create works<br/>\nof art could thrive in such an experience-rich lifestyle.<br/>\n<br/>\nIf learning and life experiences mean significantly more to you than<br/>\ncommunity status, a permanent address, or a mainstream level of creature<br/>\ncomforts, becoming a hobo could be a good career move.  There are plenty of<br/>\nemployers who are always looking for reliable seasonal workers.  Plus, some<br/>\npeople have skills which they can take anywhere and easily find a job.  For<br/>\ninstance, I&#39;m a professional cleaner by trade.  I&#39;m certain I could go<br/>\nanywhere and get a job cleaning dirty toilets, or soiled carpets.    Perhaps<br/>\nthe pay wouldn&#39;t put me in the upper middle class income brackets, but after<br/>\nthe children are on their own, and we have substantial savings accumulated,<br/>\nI&#39;m sure there would be a way to do it.<br/>\n<br/>\nOne day while on our way home from Wisconsin, we listened to a fascinating<br/>\ninterview on a public radio station with the author Errol Lincoln Uys about<br/>\nhis new book &quot;Riding the Rails: Teenagers on the Move During the Great<br/>\nDepression&quot;  (http://www.erroluys.com/frontpage.htm).   I&#39;m going to order<br/>\nthe book from the library.  Uys pointed out how many teenagers rode the<br/>\nrails in search of work during the Depression.  On the whole, at that time<br/>\nit wasn&#39;t a glamorous lifestyle, even though the element of adventure was<br/>\ncertainly an important factor.  For many of those young people, however,<br/>\ntheir adolescent hoboism became the defining experience of their lives.<br/>\n(Note:  I&#39;m not recommending this for teenagers of today.)<br/>\n<br/>\nOh, one other site to look at (http://www.workersonwheels.com/wisdom.htm).<br/>\nThis is a great site about &quot;Workers on Wheels.&quot;  Be sure to read some of the<br/>\nprofiles.  For me all of this highlights just how many options there are<br/>\noutside of the 9-5 work-a-day, teamplayer world into which society<br/>\nconditions us to fit.<br/>\n<br/>\nJohn Andersen<br/>\nhttp://members.xoom.com/joandersen</div>","specialLinks":[]}],"prevTopicId":5532,"nextTopicId":5543}}