{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":43,"messages":[{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Reading when ready!","postDate":"1339539883","msgId":67623,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpyOGZqYitzMTdqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PFNOVDEzNS1XNDJGMjQ4MkY5MzQ1MUU1MzU1QTA1MEI4RjYwQHBoeC5nYmw+"},"prevInTopic":67619,"nextInTopic":67626,"prevInTime":67622,"nextInTime":67624,"topicId":67525,"numMessagesInTopic":0,"msgSnippet":"... *************** I want to clarify this a bit, because it doesn t always look like a child becoming interested and deciding to learn, especially kids who","messageBody":"<div id=\"ygrps-yiv-490020781\">Rah Wheelihan &lt;wheelihan82@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; When a child decides she wants to read, that spark of desire drives the exploration process within the child.<br/>\n </span></blockquote>***************<br/>\n<br/>\nI want to clarify this a bit, because it doesn&#39;t always &quot;look like&quot; a child becoming interested and deciding to learn, especially kids who don&#39;t learn to read in a linear, systematic fashion. Some kids learn by such a subtle, understated process that it seems nearly magical: poof! they can read! And sometimes learning to read seems more like a side-effect of something else - playing video games is a good example. Kids are interested in the information they get through print, but not necessarily interested in &quot;exploring reading&quot; per se. <br/>\n<br/>\nOn top of that, sometimes kids want to read before they&#39;re ready. Educators tend to spread the idea that interest in reading is a sign of &quot;reading readiness&quot; but that&#39;s an artifact of school - since teachers know kids don&#39;t learn nearly as well when they aren&#39;t interested, they look for ways to create and exploit interests whenever they can. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; &gt; If you are reading to your child the things she enjoys and wants to hear...<br/>\n<br/>\n </span></blockquote>Which may not be stories! Sometimes parents get the idea that kids should want to read lots and lots of stories, and while that&#39;s true of many kids, it isn&#39;t true of all children. Some kids want to know what instructions and signs say, but aren&#39;t really interested in stories - Mo wasn&#39;t, when she was little, but learned to read just fine. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":240358028,"authorName":"kristi_beguin","from":"&quot;kristi_beguin&quot; &lt;foehn_jye@...&gt;","profile":"kristi_beguin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Reading when ready!","postDate":"1339528757","msgId":67618,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpyODRubCtnaHIxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBRFJoMGU4TFZKT29EQVBOQ3AtZXlvaG92a2UtYXVPK2IwdDk1NHFDZ1pGcUFYZ1U2Z0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":67617,"nextInTopic":67619,"prevInTime":67617,"nextInTime":67619,"topicId":67525,"numMessagesInTopic":0,"msgSnippet":"My 9-year old daughter recently started reading chapter books.  She has been learning words through typing, YouTube searches, the menu guide on our satellite","messageBody":"<div id=\"ygrps-yiv-1484995598\">My 9-year old daughter recently started reading chapter books.  She has been learning words through typing, YouTube searches, the menu guide on our satellite TV system, video games, and reading lyrics on YouTube karaoke videos.  She hasn&#39;t had much interest in me reading to her, or in reading things herself, other than those mentioned above. Last year I worried a bit about it, but I just kept telling myself to see what it was she was already doing, things like typing and asking for help in spelling, and then all the searching she was doing for video games and on YouTube.  The other day, during a moment of quiet and in between play bursts, she wondered aloud whether she could read a chapter book.  I said, &quot;go for it.&quot;  She read the book in two days, and then pulled out the big stack she&#39;d inherited from her cousins.  While on vacation this past weekend, she had a lot of fun scouring for new books in a bookstore.  I think the most poignant thing for both of us was the simplicity with which it happened. I never pressured her to read, and she never worried about reading, but I did help her with spelling when she asked.</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Reading when ready!","postDate":"1339522496","msgId":67617,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpyN3VrMCthcTA1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY3MkJEQTc0LTczQkMtNDNGMS1CMkYwLUZBNkNFNjU3OTlFNEBjdWx0dXJlbGFiLm9yZy5hdT4="},"prevInTopic":67616,"nextInTopic":67618,"prevInTime":67616,"nextInTime":67618,"topicId":67525,"numMessagesInTopic":0,"msgSnippet":"... if I could find more fun ways to do this kind of tool giving but that feels forced to me and I don t know how parents and teachers manage to solicit this","messageBody":"<div id=\"ygrps-yiv-1237386023\">Catherine Hassall &lt;cat@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;I&#39;m not sure<br/>\n </span></blockquote>if I could find more fun ways to do this kind of &#39;tool giving&#39; but that feels<br/>\nforced to me and I don&#39;t know how parents and teachers manage to solicit this<br/>\nkind of cooperation.<br/>\n****************<br/>\n<br/>\nThey don&#39;t, not really - it&#39;s an ongoing issue among teachers and some kids, invariably &quot;slip through the cracks&quot;. In some cases, trying to teach kids to read can actually prevent them from learning to read. In any case, schools define &quot;reading&quot; differently for children than for adults - kids in school are expected to &quot;read&quot; at a year or two behind their ability to comprehend spoken language, with a fairly minimal level of comprehension, the level you&#39;d get skimming something, or reading something in a foreign language you kinda-sorta understand. But the real level of understanding is eclipsed by quizzes and &quot;skill building&quot; exercises and the fact that kids who learn to read on their own dominate the class and the others learn dozens of tricks to keep their heads down. <br/>\n<br/>\nA couple good books describing how reading happens without kids being taught are Literacy Through Play, and Much More than just the ABCs. They study kids in open classrooms, rather than homeschoolers, but that can make the information more useful for people who have a lot of baggage in education. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; I have been feeling concerned about this &#39;issue&#39; of reading for some time - and even more so as she is 7 now and not showing much interest or ability. <br/>\n </span></blockquote>**************<br/>\n<br/>\nThere are theories of education which recommend that reading not be taught before age 7 or 8 because the majority of children aren&#39;t ready to read before 7. <br/>\n<br/>\nKids who read without being taught seem to fall into three general groups in terms of when they&#39;re ready. Some learn to read around 4ish. Some, the largest group, are ready around 8, while others aren&#39;t ready to read until puberty.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":134340090,"authorName":"Rah Wheelihan","from":"Rah Wheelihan &lt;wheelihan82@...&gt;","profile":"wheelihan82","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] Re: Reading when ready!","postDate":"1339517975","msgId":67619,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFNOVDEzNS1XNDJGMjQ4MkY5MzQ1MUU1MzU1QTA1MEI4RjYwQHBoeC5nYmw+","inReplyToHeader":"PDY3MkJEQTc0LTczQkMtNDNGMS1CMkYwLUZBNkNFNjU3OTlFNEBjdWx0dXJlbGFiLm9yZy5hdT4=","referencesHeader":"PDY3MkJEQTc0LTczQkMtNDNGMS1CMkYwLUZBNkNFNjU3OTlFNEBjdWx0dXJlbGFiLm9yZy5hdT4="},"prevInTopic":67618,"nextInTopic":67623,"prevInTime":67618,"nextInTime":67620,"topicId":67525,"numMessagesInTopic":0,"msgSnippet":"Listening, understanding and enjoying spoken language comes before putting it on paper and decoding the written word. If that s not developed, decoding won t","messageBody":"<div id=\"ygrps-yiv-487850666\">Listening, understanding and enjoying spoken language comes before putting it on paper and decoding the written word. If that&#39;s not developed, decoding won&#39;t be useful without comprehension. It isn&#39;t early reading that is critical; it is early experiences that allow the child to develop so that she&#39;s ready to read later. <br/>\n<br/>\nChildren born into today&#39;s unschooling families have different experiences than children of your mother&#39;s youth. <br/>\n<br/>\nWhen a child decides she wants to read, that spark of desire drives the exploration process within the child.<br/>\n<br/>\nIf you are reading to your child the things she enjoys and wants to hear, she will be gaining language skills and knowledge and be exposed to new ideas that she would if she were reading it herself. There is no loss in that, and it enables her to hear things beyond what might be her reading ability. We didn&#39;t stop reading to our children. My daughter came home from college and her dad read to her for fun.<br/>\n<br/>\nI knew a boy who asked his mom when he was going to read because he was 8 and his friends had been reading for some time. His mom told him he would read when he was ready. He wondered when he would be ready, and he looked out the car window at the road signs as they passed and began reading them. He was delighted and said he was ready!<br/>\n<br/>\nRah<br/>\n<br/>\n<br/>\n<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:cat@...\">cat@...</a><br/>\nDate: Tue, 12 Jun 2012 22:37:44 +1000<br/>\nSubject: [AlwaysLearning] Re: Reading when ready!<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n    <br/>\n      <br/>\n      <br/>\n      Hello<br/>\n<br/>\n<br/>\n<br/>\nI decided to write this evening to ask for some help about . . . reading!  And I found this thread - I hope I am not hijacking the OP but hope it might extend the thread with further clarifications for me and others.  Perhaps I should rename it - perhaps someone with more experience in the list can do that if they think it is required?<br/>\n<br/>\n<br/>\n<br/>\nI am staying at with my parents - this only happens 2 or 3 times a year as we are at opposite ends of the country.  My mum has been an &#39;early childhood educator&#39; since she went to teachers college at 16 and she worked as an infants teacher ever since except for a few years when we were little - she eventually became a primary school principal - a lifetime career she is very proud of.  She is 75 now and has been very concerned about our choices to homeschool and especially not using a curriculum/(standard)lessons/approaches.  Both my brothers and one of their wives are also teachers . . . <br/>\n<br/>\n<br/>\n<br/>\nThis evening after I had been reading The Enchanted Wood to our daughter before she went to sleep, my mum said that when I was 7 I was reading that book to myself and that they did not need to read to me because I was reading everything I &#39;could get my hands on&#39; and &#39;of course Maya would be too&#39; IF (now I am paraphrasing) she had the tools because &#39;you can&#39;t tell a child to go and build a garden if they don&#39;t have the tools for it and of course Maya does not have those tools and Patrick (another grandchild) was also reading Harry Potter at 7 and Maya clearly has no tools because she can&#39;t even recognise simple words like &#39;the&#39; etc&#39;.  I said a couple of things to support our approach while my dad looked at the carpet & my mum continued to dispute it and all I came away with was a terrible feeling of letting my daughter down and wondering why she didn&#39;t want/learn to read already and whether or not I am doing any of the right things to support this.<br/>\n<br/>\n<br/>\n<br/>\nI have been feeling concerned about this &#39;issue&#39; of reading for some time - and even more so as she is 7 now and not showing much interest or ability.  I am bouyed up by a line from The Big Book Of Unschooling - &#39;don&#39;t deprive your children of the experience of them learning to read by themselves&#39;  but somehow this does not hold up against the doubts that pile up about whether or not I am doing the right thing by her and whether I should/could do more.  Basically, my experience is that she doesn&#39;t want to be approached in any way that feels (to her) like being &#39;taught&#39; to read - too much sounding out or asking questions or explaining sounds/words and she says &#39;come on mum, just read&#39;.  So I&#39;m not sure if I could find more fun ways to do this kind of &#39;tool giving&#39; but that feels forced to me and I don&#39;t know how parents and teachers manage to solicit this kind of cooperation.  I have no doubt that Maya would respond to school type teaching situations - she is more than happy to do as she&#39;s asked/told at ballet and violin (so far! - she has begun both this year - a term of the former and 3 classes of the latter) but she does not want that from me, and certainly not in relation to reading.<br/>\n<br/>\n<br/>\n<br/>\nSo, inspite of having read a lot about reading, I am still full of doubt.  I am concerned that I am letting her down. I am concerned about what kind of options I am providing for her by not having settled her into the pathways of early reading.  I am concerned that she is not going to learn to read well or properly or understand language and writing in a way that will enable her access into future options. As you can see from my background I come from a very &#39;schooled&#39; family and I was a top 5% kind of student and an English literature major etc so perhaps I am having trouble deschooling around this area . . . I just wonder if I have let her down.  <br/>\n<br/>\n<br/>\n<br/>\nI don&#39;t know how to find a way to feel more confident about our approach - sometimes it seems so very radical and unproven and I am in a wilderness with no real examples of people learning in this way.  Of course I can see all kinds of learning taking place for her and she has compiled her own yoga routine (for example) which she voluntarily executes on many mornings - so clearly she can put things together by herself based on her observations.  But still I am so full of doubt.  Especially when faced by people who are so confident about their own schooled approach.<br/>\n<br/>\n<br/>\n<br/>\nLast week I met a woman whose homeschooled daughters follow an American homeschool curriculum program (we are in Australia) and the 12 year old is up till 10 every night to finish assignments/lessons.  And even though I think this is crazy I am still left with doubts that I am letting my daughter down because she will not have the opportunities available to her that are available to schooled children.  And if I am closing the door to those opportunities, then what opportunities am I providing her with?  Can they be named?<br/>\n<br/>\n<br/>\n<br/>\nI am tired by this doubt but cannot seem to let go.  Will my daughter be 17 and I am still full of doubt?  What a shame that would be.  But what if I am not actually providing my daughter with everything she needs in the midst of our lives . . . juggling a smaller child, and running the house, supporting the family income etc.  How can I know if what I do is enough? or if they are the right things?<br/>\n<br/>\n<br/>\n<br/>\nSO yes, I really am feeling stuck here.  <br/>\n<br/>\n<br/>\n<br/>\nwith thanks<br/>\n<br/>\nCatherine<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n    <br/>\n     <br/>\n<br/>\n    <br/>\n    <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n \t\t \t   \t\t  <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":266230379,"authorName":"Aisha Alkhani","from":"Aisha Alkhani &lt;alwaysaisha@...&gt;","profile":"alkhani_tribe","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Reading when ready!","postDate":"1339517745","msgId":67616,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBRFJoMGU4SndaOWJMV3ZwQ2o2OUJfQVNoaXBOdjkxSy0tamozYmI1VWU3UTNQQXM1QUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PEZBMUJFN0VDLUNDRjItNDgxOS04NUY3LTVFRTA2RUIxRUQyMUB2ZXJpem9uLm5ldD4=","referencesHeader":"PDY3MkJEQTc0LTczQkMtNDNGMS1CMkYwLUZBNkNFNjU3OTlFNEBjdWx0dXJlbGFiLm9yZy5hdT4JPEZBMUJFN0VDLUNDRjItNDgxOS04NUY3LTVFRTA2RUIxRUQyMUB2ZXJpem9uLm5ldD4="},"prevInTopic":67615,"nextInTopic":67617,"prevInTime":67615,"nextInTime":67617,"topicId":67525,"numMessagesInTopic":0,"msgSnippet":"So today I am sending a round of applause and thank you to both Catherine and Joyce!  Firstly all the advice that was given is so on target, and exactly what I","messageBody":"<div id=\"ygrps-yiv-1664034736\">So today I am sending a round of applause and thank you to both Catherine<br/>\nand Joyce!  Firstly all the advice that was given is so on target, and<br/>\nexactly what I needed, (promptly pasted on my fridge for support) and<br/>\nsecondly to Catherine for letting me know im not alone in this doubt of<br/>\nmine.<br/>\n<br/>\nI do however, want to share some amazing news!  Yesterday in he car my 7 yr<br/>\nold asks me &quot;do you know what that brown sign says?&quot;  I tell him no its out<br/>\nof my range and he promptly replies &quot;ZOO&quot;.  Mind you just like all of you<br/>\nhave said, it WILL HAPPEN on its OWN.  And that is what happened.  When I<br/>\nasked him how he knew that he told me that Z is for Zee his friends name<br/>\nand he added and the O&#39;s are for the sound Boo like my name!<br/>\n<br/>\nThat wasnt reading eggs or ticket to read or any time I have spent with him<br/>\ntrying to teach him phonics.  I havent even introduced those letters!  That<br/>\nwas him, his wiring connecting when it was ready.  And nothing short of a<br/>\nmiracle for me that I needed in such a great time of doubt.  I think too<br/>\nmany times my &quot;teacher&quot; brain gets in the way, and just like the little<br/>\ndevil on my shoulder need to put her away!  Learning to be a guide, is not<br/>\nalways easy!<br/>\n<br/>\nIt will happen, I just need to be patient!  Im just glad I was at a stop<br/>\nlight when it all happened because it was nothing short of sheer bliss!<br/>\n<br/>\n<br/>\nAnyhow, thank you again.  I cant tell you how much more perfect the timing<br/>\nhas been in this discussion.<br/>\n<br/>\nAisha<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Tue, Jun 12, 2012 at 8:16 AM, Joyce Fetteroll &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jfetteroll@...\">jfetteroll@...</a>&gt;wrote:<br/>\n<br/>\n&gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; On Jun 12, 2012, at 8:37 AM, Catherine Hassall wrote:<br/>\n&gt;<br/>\n&gt; &gt; I am concerned about what kind of options I am providing<br/>\n&gt; &gt; for her by not having settled her into the pathways of early reading.<br/>\n&gt;<br/>\n&gt; Well, it sounds like you may have read a lot about unschoolers learning to<br/>\n&gt; read but didn&#39;t take in what was actually being said.<br/>\n&gt;<br/>\n&gt; No matter what your mom or anyone else believes, a child can&#39;t read until<br/>\n&gt; they are developmentally ready. Reading practice will not cause someone to<br/>\n&gt; develop faster. Only time will do that.<br/>\n&gt;<br/>\n&gt; People believe they&#39;re teaching kids to read because kids are developing<br/>\n&gt; at the same time the reading instruction happens.<br/>\n&gt;<br/>\n&gt; If walking lessons started at 9 months for all kids, by 14 months it would<br/>\n&gt; seem like the walking lessons were a huge success. And the kids who<br/>\n&gt; couldn&#39;t walk at 14 months would seem defective.<br/>\n&gt;<br/>\n&gt; That reading instruction is supposedly necessary and works is a huge<br/>\n&gt; mental block that it&#39;s hard to see around because nearly everyone believes<br/>\n&gt; it&#39;s true. And, more importantly, *no teachers have experience with kids<br/>\n&gt; who have learned without instruction.* (Except for those freaky 4 yos who<br/>\n&gt; sometimes spontaneously read. But with reading instruction happening<br/>\n&gt; earlier and earlier, the instruction is being seen as the reason even for<br/>\n&gt; them :-/)<br/>\n&gt;<br/>\n&gt; Think about that for a moment. Without a control group who aren&#39;t being<br/>\n&gt; instructed in reading, there&#39;s no way for teachers to know what happens<br/>\n&gt; when kids aren&#39;t instructed. All kids are instructed so teachers are<br/>\n&gt; positive it&#39;s necessary. *But teachers don&#39;t know.*<br/>\n&gt;<br/>\n&gt; Only unschoolers know the truth. We&#39;re the control group. *All* of our<br/>\n&gt; kids read and read just fine. Because our kids read when they&#39;re<br/>\n&gt; developmentally ready, because they read what they find meaningful for<br/>\n&gt; them, because they read for their own information not to answer someone<br/>\n&gt; else&#39;s pretend questions, they read just fine and without the trauma of<br/>\n&gt; feeling stupid and with the dislike of reading that can result from the<br/>\n&gt; pressure of instruction.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &gt; I don&#39;t know how to find a way to feel more confident about our approach<br/>\n&gt; -<br/>\n&gt; &gt; sometimes it seems so very radical and unproven and I am in a wilderness<br/>\n&gt; &gt; with no real examples of people learning in this way.<br/>\n&gt;<br/>\n&gt; Back in the 60s it was a wilderness. Now there&#39;s the internet.<br/>\n&gt;<br/>\n&gt; Have you read Sandra&#39;s or my pages (and the links) on reading?<br/>\n&gt;<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/reading\">http://sandradodd.com/reading</a><br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com\">http://joyfullyrejoycing.com</a><br/>\n&gt;<br/>\n&gt; If you need someone with a degree to reassure you, Peter Gray does a lot<br/>\n&gt; of writing about learning and much of it has to do with unschooling:<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.psychologytoday.com/blog/freedom-learn/201002/children-teach-themselves-read\">http://www.psychologytoday.com/blog/freedom-learn/201002/children-teach-themselves-read</a><br/>\n&gt;<br/>\n&gt; You can subscribe to his Freedom to Learn articles that he publishes in<br/>\n&gt; Psychology Today at:<br/>\n&gt;<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.psychologytoday.com/experts/peter-gray\">http://www.psychologytoday.com/experts/peter-gray</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &gt; And even though I think this is crazy I am still left with doubts<br/>\n&gt; &gt; that I am letting my daughter down because she will not have<br/>\n&gt; &gt; the opportunities available to her that are available to schooled<br/>\n&gt; children.<br/>\n&gt;<br/>\n&gt; If you look at school and curriculum objectively rather than the fonts of<br/>\n&gt; knowledge they&#39;re touted to be, it&#39;s easier to see how hugely limiting they<br/>\n&gt; are.<br/>\n&gt;<br/>\n&gt; Kids are stuck inside memorizing facts about life and the world from<br/>\n&gt; someone predigested facts about it.<br/>\n&gt;<br/>\n&gt; Unschooled kids are out in the world learning as humans are designed to<br/>\n&gt; learn: by gathering in what they observe and pulling understanding from it.<br/>\n&gt;<br/>\n&gt; Schooled kids lives are limited. Unschooled kids lives are as big as the<br/>\n&gt; world around them. And with the internet and TV, that&#39;s practically<br/>\n&gt; infinite!<br/>\n&gt;<br/>\n&gt; One of the big problems of shifting from a school vision of learning to a<br/>\n&gt; vision of real learning is that learning by pouring in information seems<br/>\n&gt; more efficient and to make more sense than each person rebuilding<br/>\n&gt; understanding that others have already done.<br/>\n&gt;<br/>\n&gt; But our brains aren&#39;t wired to memorize understanding. *That&#39;s* why<br/>\n&gt; schools have such a hard time. Learning is easy. We do it as easily as<br/>\n&gt; breathing. Memorizing and trying to understand what you&#39;ve memorized his<br/>\n&gt; hard and incredibly inefficient.<br/>\n&gt;<br/>\n&gt; Think back to what you learned in school, especially the subjects that<br/>\n&gt; weren&#39;t interesting to you. Compared to the number of hours you put in, how<br/>\n&gt; well do you feel you know those subjects? Could you pass a test right now<br/>\n&gt; on the Civil War, acids and bases, the themes and symbols of Hamlet, the<br/>\n&gt; proper use of the semi-colon, what to do with the polynomial equation and<br/>\n&gt; how to factor fractions, what Charlemagne&#39;s role was in European history?<br/>\n&gt;<br/>\n&gt; Well, maybe you could if you were top 5%! And if you see learning as<br/>\n&gt; memorization -- as many people do -- then it&#39;s hard to see how kids who<br/>\n&gt; aren&#39;t memorizing are learning.<br/>\n&gt;<br/>\n&gt; But if you don&#39;t remember all that it&#39;s because you didn&#39;t learn it.<br/>\n&gt; Knowledge was thrown at you. It&#39;s like throwing spaghetti at someone and<br/>\n&gt; calling it nourishment. It sticks for a bit -- long enough for the test --<br/>\n&gt; but eventually most of it falls off.<br/>\n&gt;<br/>\n&gt; But if someone pulls it in because they love spaghetti, then they&#39;re<br/>\n&gt; getting nourished by it.<br/>\n&gt;<br/>\n&gt; I too was rewarded with good grades for my ability to absorb what was<br/>\n&gt; thrown at me. I pulled in much of the spaghetti that was thrown at me ;-)<br/>\n&gt; But the analogy breaks down there because it only got partially digested.<br/>\n&gt; Much of it remained as memorized facts. Despite my good grades in math and<br/>\n&gt; several math courses in college, it wasn&#39;t until I had graduated and<br/>\n&gt; started using math for real that I finally grasped what it was about. I<br/>\n&gt; realized I never understood what I was doing. I just recognized patterns<br/>\n&gt; and did what I was told.<br/>\n&gt;<br/>\n&gt; Even more telling, I had 3 semesters of college physics. In my 20s I was<br/>\n&gt; required to write a paper for my black belt in Tae Kwon Do. I figured the<br/>\n&gt; physics of a punch would be easy. It turns out that despite decent grades I<br/>\n&gt; didn&#39;t get forces and energy at all. I had to unlearn so much and basically<br/>\n&gt; start from scratch.<br/>\n&gt;<br/>\n&gt; Think about the things you do well and know inside and out. Things that<br/>\n&gt; you do because you find them rewarding. Did you learn that in school? Or<br/>\n&gt; did you learn it by pulling it in because you were fascinated?<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &gt; I am concerned that she is not going to learn to read well or properly<br/>\n&gt; or understand language and writing in a way that will enable her access<br/>\n&gt; into future options. As you can see from my background I come from a very<br/>\n&gt; &#39;schooled&#39; family and I was a top 5% kind of student and an English<br/>\n&gt; literature major etc so perhaps I am having trouble deschooling around this<br/>\n&gt; area<br/>\n&gt;<br/>\n&gt; I&#39;d say definitely.<br/>\n&gt;<br/>\n&gt; *If* you expect real learning to look like school learning, you&#39;ll have a<br/>\n&gt; horrible time grasping unschooling. Unschooling looks nothing like school.<br/>\n&gt; It looks like play. Play -- which is actually free form experimentation and<br/>\n&gt; analysis -- is how we -- humans and really all mammals -- are designed to<br/>\n&gt; make sense of the world around us. We build up an understanding of how the<br/>\n&gt; universe works by trying things out and seeing what happens. Then taking<br/>\n&gt; that new understanding to try more stuff out.<br/>\n&gt;<br/>\n&gt; Written that way it sounds formal and directed. In actual practice it is<br/>\n&gt; free ranging and chaotic. But it works wonderfully well because it&#39;s what<br/>\n&gt; we&#39;re designed to do.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &gt; How can I know if what I do is enough? or if they are the right things?<br/>\n&gt;<br/>\n&gt; By looking at your daughter and what she&#39;s interested in rather than<br/>\n&gt; looking outward at everyone else and all the things you want to pour into<br/>\n&gt; her. FOcus on her. Give her more of what she enjoys. Sit with her. Listen<br/>\n&gt; to her. Learn from her! Strew things about the house that she might find<br/>\n&gt; interesting (or ignore). Offer related things *she* will find interesting.<br/>\n&gt; Take her to places that connect to her interest.<br/>\n&gt;<br/>\n&gt; Don&#39;t use her interests to get your agenda into her. Use her interests as<br/>\n&gt; a window into who she is. And help her reach for more.<br/>\n&gt;<br/>\n&gt; Joyce<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\n<br/>\n&quot;There is no flag large enough to cover the shame of killing innocent<br/>\npeople for a purpose which is unattainable&quot; .  Howard Zinn<br/>\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~<br/>\n&quot;Learning can only happen when a child is interested. If he&#39;s not<br/>\ninterested it&#39;s like throwing marshmallows at his head and calling it<br/>\neating.&quot; -  Katrina Gutleben<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Reading when ready!","postDate":"1339514164","msgId":67615,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEZBMUJFN0VDLUNDRjItNDgxOS04NUY3LTVFRTA2RUIxRUQyMUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDY3MkJEQTc0LTczQkMtNDNGMS1CMkYwLUZBNkNFNjU3OTlFNEBjdWx0dXJlbGFiLm9yZy5hdT4=","referencesHeader":"PDY3MkJEQTc0LTczQkMtNDNGMS1CMkYwLUZBNkNFNjU3OTlFNEBjdWx0dXJlbGFiLm9yZy5hdT4="},"prevInTopic":67614,"nextInTopic":67616,"prevInTime":67614,"nextInTime":67616,"topicId":67525,"numMessagesInTopic":0,"msgSnippet":"... Well, it sounds like you may have read a lot about unschoolers learning to read but didn t take in what was actually being said. No matter what your mom or","messageBody":"<div id=\"ygrps-yiv-1750917733\">On Jun 12, 2012, at 8:37 AM, Catherine Hassall wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I am concerned about what kind of options I am providing<br/>\n&gt; for her by not having settled her into the pathways of early reading.<br/>\n<br/>\n </span></blockquote>Well, it sounds like you may have read a lot about unschoolers learning to read but didn&#39;t take in what was actually being said.<br/>\n<br/>\nNo matter what your mom or anyone else believes, a child can&#39;t read until they are developmentally ready. Reading practice will not cause someone to develop faster. Only time will do that.<br/>\n<br/>\nPeople believe they&#39;re teaching kids to read because kids are developing at the same time the reading instruction happens.<br/>\n<br/>\nIf walking lessons started at 9 months for all kids, by 14 months it would seem like the walking lessons were a huge success. And the kids who couldn&#39;t walk at 14 months would seem defective.<br/>\n<br/>\nThat reading instruction is supposedly necessary and works is a huge mental block that it&#39;s hard to see around because nearly everyone believes it&#39;s true. And, more importantly, *no teachers have experience with kids who have learned without instruction.* (Except for those freaky 4 yos who sometimes spontaneously read. But with reading instruction happening earlier and earlier, the instruction is being seen as the reason even for them :-/)<br/>\n<br/>\nThink about that for a moment. Without a control group who aren&#39;t being instructed in reading, there&#39;s no way for teachers to know what happens when kids aren&#39;t instructed. All kids are instructed so teachers are positive it&#39;s necessary. *But teachers don&#39;t know.*<br/>\n<br/>\nOnly unschoolers know the truth. We&#39;re the control group. *All* of our kids read and read just fine. Because our kids read when they&#39;re developmentally ready, because they read what they find meaningful for them, because they read for their own information not to answer someone else&#39;s pretend questions, they read just fine and without the trauma of feeling stupid and with the dislike of reading that can result from the pressure of instruction.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I don&#39;t know how to find a way to feel more confident about our approach - <br/>\n&gt; sometimes it seems so very radical and unproven and I am in a wilderness <br/>\n&gt; with no real examples of people learning in this way.<br/>\n<br/>\n </span></blockquote>Back in the 60s it was a wilderness. Now there&#39;s the internet.<br/>\n<br/>\nHave you read Sandra&#39;s or my pages (and the links) on reading?<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/reading\">http://sandradodd.com/reading</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com\">http://joyfullyrejoycing.com</a><br/>\n<br/>\nIf you need someone with a degree to reassure you, Peter Gray does a lot of writing about learning and much of it has to do with unschooling:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.psychologytoday.com/blog/freedom-learn/201002/children-teach-themselves-read\">http://www.psychologytoday.com/blog/freedom-learn/201002/children-teach-themselves-read</a><br/>\n<br/>\nYou can subscribe to his Freedom to Learn articles that he publishes in Psychology Today at:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.psychologytoday.com/experts/peter-gray\">http://www.psychologytoday.com/experts/peter-gray</a><br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; And even though I think this is crazy I am still left with doubts<br/>\n&gt; that I am letting my daughter down because she will not have <br/>\n&gt; the opportunities available to her that are available to schooled children.<br/>\n<br/>\n </span></blockquote>If you look at school and curriculum objectively rather than the fonts of knowledge they&#39;re touted to be, it&#39;s easier to see how hugely limiting they are.<br/>\n<br/>\nKids are stuck inside memorizing facts about life and the world from someone predigested facts about it.<br/>\n<br/>\nUnschooled kids are out in the world learning as humans are designed to learn: by gathering in what they observe and pulling understanding from it.<br/>\n<br/>\nSchooled kids lives are limited. Unschooled kids lives are as big as the world around them. And with the internet and TV, that&#39;s practically infinite!<br/>\n<br/>\nOne of the big problems of shifting from a school vision of learning to a vision of real learning is that learning by pouring in information seems more efficient and to make more sense than each person rebuilding understanding that others have already done.<br/>\n<br/>\nBut our brains aren&#39;t wired to memorize understanding. *That&#39;s* why schools have such a hard time. Learning is easy. We do it as easily as breathing. Memorizing and trying to understand what you&#39;ve memorized his hard and incredibly inefficient.<br/>\n<br/>\nThink back to what you learned in school, especially the subjects that weren&#39;t interesting to you. Compared to the number of hours you put in, how well do you feel you know those subjects? Could you pass a test right now on the Civil War, acids and bases, the themes and symbols of Hamlet, the proper use of the semi-colon, what to do with the polynomial equation and how to factor fractions, what Charlemagne&#39;s role was in European history?<br/>\n<br/>\nWell, maybe you could if you were top 5%! And if you see learning as memorization -- as many people do -- then it&#39;s hard to see how kids who aren&#39;t memorizing are learning.<br/>\n<br/>\nBut if you don&#39;t remember all that it&#39;s because you didn&#39;t learn it. Knowledge was thrown at you. It&#39;s like throwing spaghetti at someone and calling it nourishment. It sticks for a bit -- long enough for the test -- but eventually most of it falls off.<br/>\n<br/>\nBut if someone pulls it in because they love spaghetti, then they&#39;re getting nourished by it.<br/>\n<br/>\nI too was rewarded with good grades for my ability to absorb what was thrown at me. I pulled in much of the spaghetti that was thrown at me ;-) But the analogy breaks down there because it only got partially digested. Much of it remained as memorized facts. Despite my good grades in math and several math courses in college, it wasn&#39;t until I had graduated and started using math for real that I finally grasped what it was about. I realized I never understood what I was doing. I just recognized patterns and did what I was told.<br/>\n<br/>\nEven more telling, I had 3 semesters of college physics. In my 20s I was required to write a paper for my black belt in Tae Kwon Do. I figured the physics of a punch would be easy. It turns out that despite decent grades I didn&#39;t get forces and energy at all. I had to unlearn so much and basically start from scratch. <br/>\n<br/>\nThink about the things you do well and know inside and out. Things that you do because you find them rewarding. Did you learn that in school? Or did you learn it by pulling it in because you were fascinated?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I am concerned that she is not going to learn to read well or properly or understand language and writing in a way that will enable her access into future options. As you can see from my background I come from a very &#39;schooled&#39; family and I was a top 5% kind of student and an English literature major etc so perhaps I am having trouble deschooling around this area <br/>\n<br/>\n </span></blockquote>I&#39;d say definitely.<br/>\n<br/>\n*If* you expect real learning to look like school learning, you&#39;ll have a horrible time grasping unschooling. Unschooling looks nothing like school. It looks like play. Play -- which is actually free form experimentation and analysis -- is how we -- humans and really all mammals -- are designed to make sense of the world around us. We build up an understanding of how the universe works by trying things out and seeing what happens. Then taking that new understanding to try more stuff out.<br/>\n<br/>\nWritten that way it sounds formal and directed. In actual practice it is free ranging and chaotic. But it works wonderfully well because it&#39;s what we&#39;re designed to do.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; How can I know if what I do is enough? or if they are the right things?<br/>\n<br/>\n<br/>\n </span></blockquote>By looking at your daughter and what she&#39;s interested in rather than looking outward at everyone else and all the things you want to pour into her. FOcus on her. Give her more of what she enjoys. Sit with her. Listen to her. Learn from her! Strew things about the house that she might find interesting (or ignore). Offer related things *she* will find interesting. Take her to places that connect to her interest. <br/>\n<br/>\nDon&#39;t use her interests to get your agenda into her. Use her interests as a window into who she is. And help her reach for more.<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":238430032,"authorName":"Catherine Hassall","from":"Catherine Hassall &lt;cat@...&gt;","profile":"caterinasenang","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Reading when ready!","postDate":"1339504664","msgId":67614,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY3MkJEQTc0LTczQkMtNDNGMS1CMkYwLUZBNkNFNjU3OTlFNEBjdWx0dXJlbGFiLm9yZy5hdT4="},"prevInTopic":67596,"nextInTopic":67615,"prevInTime":67613,"nextInTime":67615,"topicId":67525,"numMessagesInTopic":0,"msgSnippet":"Hello I decided to write this evening to ask for some help about . . . reading!  And I found this thread - I hope I am not hijacking the OP but hope it might","messageBody":"<div id=\"ygrps-yiv-1314488197\">Hello<br/>\n<br/>\nI decided to write this evening to ask for some help about . . . reading!  And I found this thread - I hope I am not hijacking the OP but hope it might extend the thread with further clarifications for me and others.  Perhaps I should rename it - perhaps someone with more experience in the list can do that if they think it is required?<br/>\n<br/>\n  I am staying at with my parents - this only happens 2 or 3 times a year as we are at opposite ends of the country.  My mum has been an &#39;early childhood educator&#39; since she went to teachers college at 16 and she worked as an infants teacher ever since except for a few years when we were little - she eventually became a primary school principal - a lifetime career she is very proud of.  She is 75 now and has been very concerned about our choices to homeschool and especially not using a curriculum/(standard)lessons/approaches.  Both my brothers and one of their wives are also teachers . . . <br/>\n<br/>\nThis evening after I had been reading The Enchanted Wood to our daughter before she went to sleep, my mum said that when I was 7 I was reading that book to myself and that they did not need to read to me because I was reading everything I &#39;could get my hands on&#39; and &#39;of course Maya would be too&#39; IF (now I am paraphrasing) she had the tools because &#39;you can&#39;t tell a child to go and build a garden if they don&#39;t have the tools for it and of course Maya does not have those tools and Patrick (another grandchild) was also reading Harry Potter at 7 and Maya clearly has no tools because she can&#39;t even recognise simple words like &#39;the&#39; etc&#39;.  I said a couple of things to support our approach while my dad looked at the carpet & my mum continued to dispute it and all I came away with was a terrible feeling of letting my daughter down and wondering why she didn&#39;t want/learn to read already and whether or not I am doing any of the right things to support this.<br/>\n<br/>\nI have been feeling concerned about this &#39;issue&#39; of reading for some time - and even more so as she is 7 now and not showing much interest or ability.  I am bouyed up by a line from The Big Book Of Unschooling - &#39;don&#39;t deprive your children of the experience of them learning to read by themselves&#39;  but somehow this does not hold up against the doubts that pile up about whether or not I am doing the right thing by her and whether I should/could do more.  Basically, my experience is that she doesn&#39;t want to be approached in any way that feels (to her) like being &#39;taught&#39; to read - too much sounding out or asking questions or explaining sounds/words and she says &#39;come on mum, just read&#39;.  So I&#39;m not sure if I could find more fun ways to do this kind of &#39;tool giving&#39; but that feels forced to me and I don&#39;t know how parents and teachers manage to solicit this kind of cooperation.  I have no doubt that Maya would respond to school type teaching situations - she is more than happy to do as she&#39;s asked/told at ballet and violin (so far! - she has begun both this year - a term of the former and 3 classes of the latter) but she does not want that from me, and certainly not in relation to reading.<br/>\n<br/>\nSo, inspite of having read a lot about reading, I am still full of doubt.  I am concerned that I am letting her down. I am concerned about what kind of options I am providing for her by not having settled her into the pathways of early reading.  I am concerned that she is not going to learn to read well or properly or understand language and writing in a way that will enable her access into future options. As you can see from my background I come from a very &#39;schooled&#39; family and I was a top 5% kind of student and an English literature major etc so perhaps I am having trouble deschooling around this area . . . I just wonder if I have let her down.  <br/>\n<br/>\nI don&#39;t know how to find a way to feel more confident about our approach - sometimes it seems so very radical and unproven and I am in a wilderness with no real examples of people learning in this way.  Of course I can see all kinds of learning taking place for her and she has compiled her own yoga routine (for example) which she voluntarily executes on many mornings - so clearly she can put things together by herself based on her observations.  But still I am so full of doubt.  Especially when faced by people who are so confident about their own schooled approach.<br/>\n<br/>\nLast week I met a woman whose homeschooled daughters follow an American homeschool curriculum program (we are in Australia) and the 12 year old is up till 10 every night to finish assignments/lessons.  And even though I think this is crazy I am still left with doubts that I am letting my daughter down because she will not have the opportunities available to her that are available to schooled children.  And if I am closing the door to those opportunities, then what opportunities am I providing her with?  Can they be named?<br/>\n<br/>\nI am tired by this doubt but cannot seem to let go.  Will my daughter be 17 and I am still full of doubt?  What a shame that would be.  But what if I am not actually providing my daughter with everything she needs in the midst of our lives . . . juggling a smaller child, and running the house, supporting the family income etc.  How can I know if what I do is enough? or if they are the right things?<br/>\n<br/>\nSO yes, I really am feeling stuck here.  <br/>\n<br/>\nwith thanks<br/>\nCatherine</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Reading when ready!","postDate":"1339399440","msgId":67596,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY4QURGQTZELUEwQjMtNDcxQi1CNEU1LTEwMzg5NkU1QTE4M0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDEzMzkzNzA2MTQuNDUxNy5ZYWhvb01haWxDbGFzc2ljQHdlYjEyMTcwNC5tYWlsLm5lMS55YWhvby5jb20+","referencesHeader":"PDEzMzkzNzA2MTQuNDUxNy5ZYWhvb01haWxDbGFzc2ljQHdlYjEyMTcwNC5tYWlsLm5lMS55YWhvby5jb20+"},"prevInTopic":67591,"nextInTopic":67614,"prevInTime":67595,"nextInTime":67597,"topicId":67525,"numMessagesInTopic":0,"msgSnippet":"-=My older son was in public school for many years, and all his friends are there. He still goes in for band and art (his choice). His girlfriend and friends","messageBody":"<div id=\"ygrps-yiv-1112482359\">-=My older son was in public school for many years, and all his friends are there. He still goes in for band and art (his choice). His girlfriend and friends would quiz him and make him feel badly sometimes. I remind him that he shouldn&#39;t be comparing himself. He decides what he wants to learn, what he thinks is interesting or important. I do think he&#39;s never totally embraced the unschooling world because of that foot in the school world. Would love input as well for any help combating that negativity. -=-<br/>\n<br/>\nYou can&#39;t have everything at the same time.<br/>\n<br/>\nHe can&#39;t be in school and have the advantages of not having been in school.<br/>\n<br/>\nIf he&#39;s old enough to take band and art, he&#39;s old enough to understand you saying &quot;School kids are like that.&quot;  And as he IS a school kid in large part, you won&#39;t need to tell him.<br/>\n<br/>\nI note this, though, and it&#39;s a problem:   &quot;He decides what he wants to learn, what he thinks is interesting or important.&quot;<br/>\n<br/>\nWhen unschooling is working well, learning happens without deciding to learn.  <br/>\nLearning happens without someone thinking something is &quot;important.&quot;  <br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Reading when ready!","postDate":"1339371883","msgId":67591,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMzkzNzE4ODMuNTc4MTguWWFob29NYWlsTmVvQHdlYjgxNTA3Lm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PENBRFJoMGU4TFZKT29EQVBOQ3AtZXlvaG92a2UtYXVPK2IwdDk1NHFDZ1pGcUFYZ1U2Z0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PDYxODMxNzNELTZCNEItNDhGQi1BRTJBLUE4OEE3RkMzQkFDMkB2ZXJpem9uLm5ldD4gPGpyMmFucyt1Z2JhQGVHcm91cHMuY29tPiA8Q0FEUmgwZThMVkpPb0RBUE5DcC1leW9ob3ZrZS1hdU8rYjB0OTU0cUNnWkZxQVhnVTZnQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":67590,"nextInTopic":67596,"prevInTime":67590,"nextInTime":67592,"topicId":67525,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1276540618\">&lt;&lt;&lt;&quot;I have been looking into programs like<br/>\n<br/>\nTicket to Read and Reading Eggs and a couple of others.  I certainly dont<br/>\nexpect the program to teach them if they arent ready, but thought that<br/>\nmaybe this just might be the answer to getting them at least interested in<br/>\nreading.&quot;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nWhat about looking for games purely because they will have fun and enjoy them?<br/>\nAt 5 my son started playing Roblox on line. At 6 he really wanted to communicate via messaging with other players.<br/>\nI sat with him and typed and read to him. then he wanted to type while I spelled what he wanted to write to him.<br/>\nHe needed me less and less until he was reading fluently pretty much anything ! and fast!!<br/>\nI had no intention to teach him how to read. It was a consequence of him playing a game for fun.<br/>\n<br/>\n<br/>\n&lt;&lt;&lt;&quot;So with that thought in mind, would you say that if not beneficial<br/>\n<br/>\nare these programs at least fun and without negative impact if children are<br/>\nlet to play at their leisure vs you must do a lesson.  Are there other<br/>\nprograms out there for funs sake that any of you might recommend?&quot;&gt;&gt;&gt;<br/>\n<br/>\nIf they are playing for fun that is great. If you are turning them into a lesson that could create a lot of issues.<br/>\nThere are tons of programs that are free out there.<br/>\nThere are tons of games in the internet that are free.<br/>\nWhy not look for something they want to do?<br/>\nOr offer things that they can pick or not.<br/>\nIf they play a game for a week and they are done with it how would you feel about it?<br/>\n<br/>\nMy daughter Gigi, 6. asked me to get her ABC Mouse. Her friends got it and she saw the commercials,. She played for a while.|She really liked the part where<br/>\nyou do stuff to get money to buy hamsters ( cyber ones) That was her goal. She has now had enough of that and is back to playing Pixie Hallow.<br/>\nShe told me I can cancel her account. She and I had no expectations about playing ABC Mouse . For her it was for fun.<br/>\nShe is learning to read and write from many different things. Its fun to watch!<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce","from":"&quot;Joyce&quot; &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Reading when ready!","postDate":"1339371494","msgId":67589,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpyM2I1Nis3ZXVzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBRFJoMGU4TFZKT29EQVBOQ3AtZXlvaG92a2UtYXVPK2IwdDk1NHFDZ1pGcUFYZ1U2Z0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":67587,"nextInTopic":67590,"prevInTime":67588,"nextInTime":67590,"topicId":67525,"numMessagesInTopic":0,"msgSnippet":"... Why not look at the games they re interested in and related games rather than reading programs disguised as gaming? :-) Look right at them rather than at","messageBody":"<div id=\"ygrps-yiv-1112433915\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Aisha Alkhani &lt;alwaysaisha@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; They do love gaming so I have been looking into programs like<br/>\n&gt; Ticket to Read and Reading Eggs and a couple of others.<br/>\n<br/>\n </span></blockquote>Why not look at the games they&#39;re interested in and related games rather than reading programs disguised as gaming? :-) Look right at them rather than at reading as you wonder how to get it into them. Support what they love rather than using their interests to get what you want for them?<br/>\n<br/>\nWhat if you were interested in Italian cooking? And your husband supported your cooking by steering French cooking books, shows and catalogs your way? Would it feel like he was supporting your interest? Or that he saw your interest only in terms of how he could use it to get what he wanted, which was French meals?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I certainly dont<br/>\n&gt; expect the program to teach them if they arent ready,<br/>\n<br/>\n </span></blockquote>For unschooling it helps to catch your uses of &quot;teach&quot; and substitute &quot;learn&quot;. Teach is moving information into someone. It&#39;s done to someone. Learn is pulling it in. It&#39;s what someone does.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  but thought that<br/>\n&gt; maybe this just might be the answer to getting them at least interested in<br/>\n&gt; reading. <br/>\n<br/>\n </span></blockquote>I think it will be a step back at this point. You&#39;re looking at how to get what you want into them. Look at them and help them get what they&#39;re reaching for. If reading is truly useful they can&#39;t explore what interests them without bumping into it in ways that are meaningful to them. They will extract information from the written word because they need it as they&#39;re brains are developing. They&#39;ll memorize EXIT and SAVE and McDonalds. That will be more important to them than whatever some bunch of programmers who were trying to appeal to generic kids.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":342782030,"authorName":"K Pennell","from":"K Pennell &lt;mrsringsabre@...&gt;","profile":"mrsringsabre","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Reading when ready!","postDate":"1339370614","msgId":67590,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMzkzNzA2MTQuNDUxNy5ZYWhvb01haWxDbGFzc2ljQHdlYjEyMTcwNC5tYWlsLm5lMS55YWhvby5jb20+","inReplyToHeader":"PGpyMmFucyt1Z2JhQGVHcm91cHMuY29tPg=="},"prevInTopic":67589,"nextInTopic":67591,"prevInTime":67589,"nextInTime":67591,"topicId":67525,"numMessagesInTopic":0,"msgSnippet":"My grandmother, a retired teacher, is 90. She asks my sons what are you doing for schoolwork now? My youngest, who was never at school, always has sort of a","messageBody":"<div id=\"ygrps-yiv-498399695\">My grandmother, a retired teacher, is 90. She asks my sons &quot;what are you doing for schoolwork now?&quot; My youngest, who was never at school, always has sort of a blank look at the question. I translate &quot;She might like to hear about what we just finished reading, or the museum we went to last week or the snake show we saw&quot;. In her case, she KNOWS what the public schools were like 30 years ago, and knows they are &quot;worse&quot; (her word) now. She is supportive, she just would not get the concept of unschooling and her questions reflect that. It isn&#39;t too hard for us, because we don&#39;t see her often, and she just wants to hear the news and feel connected. She isn&#39;t sabotaging, like it sounds like your m-i-l is. I just explain that we follow their interests and do lots of cool stuff, and she loves to hear about it so she can mull it over later in all her alone time (which for her is most of it).<br/>\nThere are folks that do seem to sabotage, though. My older son was in public school for many years, and all his friends are there. He still goes in for band and art (his choice). His girlfriend and friends would quiz him and make him feel badly sometimes. I remind him that he shouldn&#39;t be comparing himself. He decides what he wants to learn, what he thinks is interesting or important. I do think he&#39;s never totally embraced the unschooling world because of that foot in the school world. Would love input as well for any help combating that negativity.<br/>\n<blockquote><span title=\"qreply\"> --- On Sun, 6/10/12, louise.king76 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:louise.j.king@...\">louise.j.king@...</a>&gt; wrote:<br/>\n<br/>\nFrom: louise.king76 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:louise.j.king@...\">louise.j.king@...</a>&gt;<br/>\nSubject: [AlwaysLearning] Reading when ready!<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nDate: Sunday, June 10, 2012, 10:25 AM<br/>\n<br/>\n<br/>\n&gt; Reading ability comes from the brain being developmentally ready to read. And the only way to get there is by waiting. A brain can&#39;t read before it&#39;s ready any more than legs can walk before they&#39;re ready. A reading program will be just as frustrating and useless to a non-reader as walking programs to a non-walker.<br/>\n <br/>\n&gt; That sounds wrong because schools falsely operate under the assumption that reading is purely mechanical. By applying all these mechanical reading processes to kids, most of the kids eventually read. So it *seems* like the processes worked.<br/>\n <br/>\n&gt; But the kids have also grown older in that time.<br/>\n <br/>\n&gt; It would only be a wild theory that time was important in learning to read if there weren&#39;t 1000s of unschooled kids who&#39;ve learned to read without the mechanics of instruction. What they have is time and positive and useful-to-them experiences with print. They all learn to read. And without the bad side effects of force-fed reading instruction that leaves many kids feeling stupid and hating reading.<br/>\n <br/>\n&gt; (Not all unschooled kids love to read just as not all unschooled kids love to ride bikes. But their opinions about reading are personal preferences not because of bad experiences with reading instruction.)<br/>\n <br/>\n<br/>\n<br/>\nThank you Joyce, I really wish this understanding about children&#39;s reading development was more widely known. There is so much fear around it for parents and children. Rudolf Steiner was a big fan of allowing children to read in their own time and in Holland they still believe this in many schools. <br/>\n<br/>\nI think my daughter is not fully UNschooled, she still compares her educational experiences at home with her school experience and if we aren&#39;t behaving in the same way doesn&#39;t believe she is learning.It doesn&#39;t help that her best friend is now going back to school after just a year of being home educated. <br/>\nOf course I won&#39;t have this issue with my son who will never go to school.<br/>\n<br/>\n<br/>\n&gt; If she&#39;s having fun with it, fine. If she believes she&#39;ll learn to read from it, not fine.<br/>\n<br/>\nYour right about the Reading Eggs. I came to the conclusion recently, that we can see no evidence of the package &quot;helping&quot; in anyway, so what&#39;s the point, as you say unless she is having fun with it.<br/>\n<br/>\nSomething else I would really like to ask is how other Unschoolers deal with people who are very negative about how we are educationing our children?<br/>\n<br/>\nMy mother-in-law is really difficult. She works in a State Junior School and every time we see or speak with her, she goes on and on about the children not reading yet, not being at the same level as other children in school. She says every thing in front of my daughter and son so they hear all this negative stuff. <br/>\n<br/>\nShe is so undermining, I feel really tense and uncomfortable around her but my children love her so much, so not seeing her isn&#39;t an option. <br/>\nEven if I am not there, she will say little things to the children about them needing to be in school as they will &quot;learn more&quot; there! She is always questioning them about what they have been doing and sometimes will say, in response to their answers &quot;That&#39;s not learning!&quot;.<br/>\n<br/>\nDoes anyone have any suggestions of how to deal with a family member or anyone really, who criticises your choice to Home educated. <br/>\n<br/>\nregards<br/>\nLouise <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n------------------------------------<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":266230379,"authorName":"Aisha Alkhani","from":"Aisha Alkhani &lt;alwaysaisha@...&gt;","profile":"alkhani_tribe","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Reading when ready!","postDate":"1339358778","msgId":67587,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBRFJoMGU4TFZKT29EQVBOQ3AtZXlvaG92a2UtYXVPK2IwdDk1NHFDZ1pGcUFYZ1U2Z0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGpyMmFucyt1Z2JhQGVHcm91cHMuY29tPg==","referencesHeader":"PDYxODMxNzNELTZCNEItNDhGQi1BRTJBLUE4OEE3RkMzQkFDMkB2ZXJpem9uLm5ldD4JPGpyMmFucyt1Z2JhQGVHcm91cHMuY29tPg=="},"prevInTopic":67584,"nextInTopic":67589,"prevInTime":67586,"nextInTime":67588,"topicId":67525,"numMessagesInTopic":0,"msgSnippet":"Hello all~ This discussion comes at a perfect time for us.  I have a 7 yr old son and a 5 yr old son.  Both of whom could care less about reading.  It truly","messageBody":"<div id=\"ygrps-yiv-1602835542\">Hello all~<br/>\n<br/>\nThis discussion comes at a perfect time for us.  I have a 7 yr old son and<br/>\na 5 yr old son.  Both of whom could care less about reading.  It truly has<br/>\nno purpose for them right now.  That includes having stories read to them.<br/>\n We take a ton of library trips, and as always they play computer at the<br/>\nlibrary!  They do love gaming so I have been looking into programs like<br/>\nTicket to Read and Reading Eggs and a couple of others.  I certainly dont<br/>\nexpect the program to teach them if they arent ready, but thought that<br/>\nmaybe this just might be the answer to getting them at least interested in<br/>\nreading. So with that thought in mind, would you say that if not beneficial<br/>\nare these programs at least fun and without negative impact if children are<br/>\nlet to play at their leisure vs you must do a lesson.  Are there other<br/>\nprograms out there for funs sake that any of you might recommend?<br/>\n<br/>\nThanks for any answers :D<br/>\n<br/>\nAisha<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sun, Jun 10, 2012 at 7:25 AM, louise.king76 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:louise.j.king@...\">louise.j.king@...</a>&gt;wrote:<br/>\n<br/>\n&gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &gt; Reading ability comes from the brain being developmentally ready to<br/>\n&gt; read. And the only way to get there is by waiting. A brain can&#39;t read<br/>\n&gt; before it&#39;s ready any more than legs can walk before they&#39;re ready. A<br/>\n&gt; reading program will be just as frustrating and useless to a non-reader as<br/>\n&gt; walking programs to a non-walker.<br/>\n&gt;<br/>\n&gt; &gt; That sounds wrong because schools falsely operate under the assumption<br/>\n&gt; that reading is purely mechanical. By applying all these mechanical reading<br/>\n&gt; processes to kids, most of the kids eventually read. So it *seems* like the<br/>\n&gt; processes worked.<br/>\n&gt;<br/>\n&gt; &gt; But the kids have also grown older in that time.<br/>\n&gt;<br/>\n&gt; &gt; It would only be a wild theory that time was important in learning to<br/>\n&gt; read if there weren&#39;t 1000s of unschooled kids who&#39;ve learned to read<br/>\n&gt; without the mechanics of instruction. What they have is time and positive<br/>\n&gt; and useful-to-them experiences with print. They all learn to read. And<br/>\n&gt; without the bad side effects of force-fed reading instruction that leaves<br/>\n&gt; many kids feeling stupid and hating reading.<br/>\n&gt;<br/>\n&gt; &gt; (Not all unschooled kids love to read just as not all unschooled kids<br/>\n&gt; love to ride bikes. But their opinions about reading are personal<br/>\n&gt; preferences not because of bad experiences with reading instruction.)<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Thank you Joyce, I really wish this understanding about children&#39;s reading<br/>\n&gt; development was more widely known. There is so much fear around it for<br/>\n&gt; parents and children. Rudolf Steiner was a big fan of allowing children to<br/>\n&gt; read in their own time and in Holland they still believe this in many<br/>\n&gt; schools.<br/>\n&gt;<br/>\n&gt; I think my daughter is not fully UNschooled, she still compares her<br/>\n&gt; educational experiences at home with her school experience and if we aren&#39;t<br/>\n&gt; behaving in the same way doesn&#39;t believe she is learning. It doesn&#39;t help<br/>\n&gt; that her best friend is now going back to school after just a year of being<br/>\n&gt; home educated.<br/>\n&gt; Of course I won&#39;t have this issue with my son who will never go to school.<br/>\n&gt;<br/>\n&gt; &gt; If she&#39;s having fun with it, fine. If she believes she&#39;ll learn to read<br/>\n&gt; from it, not fine.<br/>\n&gt;<br/>\n&gt; Your right about the Reading Eggs. I came to the conclusion recently, that<br/>\n&gt; we can see no evidence of the package &quot;helping&quot; in anyway, so what&#39;s the<br/>\n&gt; point, as you say unless she is having fun with it.<br/>\n&gt;<br/>\n&gt; Something else I would really like to ask is how other Unschoolers deal<br/>\n&gt; with people who are very negative about how we are educationing our<br/>\n&gt; children?<br/>\n&gt;<br/>\n&gt; My mother-in-law is really difficult. She works in a State Junior School<br/>\n&gt; and every time we see or speak with her, she goes on and on about the<br/>\n&gt; children not reading yet, not being at the same level as other children in<br/>\n&gt; school. She says every thing in front of my daughter and son so they hear<br/>\n&gt; all this negative stuff.<br/>\n&gt;<br/>\n&gt; She is so undermining, I feel really tense and uncomfortable around her<br/>\n&gt; but my children love her so much, so not seeing her isn&#39;t an option.<br/>\n&gt; Even if I am not there, she will say little things to the children about<br/>\n&gt; them needing to be in school as they will &quot;learn more&quot; there! She is always<br/>\n&gt; questioning them about what they have been doing and sometimes will say, in<br/>\n&gt; response to their answers &quot;That&#39;s not learning!&quot;.<br/>\n&gt;<br/>\n&gt; Does anyone have any suggestions of how to deal with a family member or<br/>\n&gt; anyone really, who criticises your choice to Home educated.<br/>\n&gt;<br/>\n&gt; regards<br/>\n&gt; Louise<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\n<br/>\n&quot;There is no flag large enough to cover the shame of killing innocent<br/>\npeople for a purpose which is unattainable&quot; .  Howard Zinn<br/>\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~<br/>\n&quot;Learning can only happen when a child is interested. If he&#39;s not<br/>\ninterested it&#39;s like throwing marshmallows at his head and calling it<br/>\neating.&quot; -  Katrina Gutleben<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":529985200,"authorName":"louise.king76","from":"&quot;louise.king76&quot; &lt;louise.j.king@...&gt;","profile":"louise.king76","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Reading when ready!","postDate":"1339338300","msgId":67584,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpyMmFucyt1Z2JhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDYxODMxNzNELTZCNEItNDhGQi1BRTJBLUE4OEE3RkMzQkFDMkB2ZXJpem9uLm5ldD4="},"prevInTopic":67579,"nextInTopic":67587,"prevInTime":67583,"nextInTime":67585,"topicId":67525,"numMessagesInTopic":0,"msgSnippet":"... Thank you Joyce, I really wish this understanding about children s reading development was more widely known. There is so much fear around it for parents","messageBody":"<div id=\"ygrps-yiv-723572245\"><blockquote><span title=\"ireply\">&gt; Reading ability comes from the brain being developmentally ready to read. And the only way to get there is by waiting. A brain can&#39;t read before it&#39;s ready any more than legs can walk before they&#39;re ready. A reading program will be just as frustrating and useless to a non-reader as walking programs to a non-walker.<br/>\n <br/>\n&gt; That sounds wrong because schools falsely operate under the assumption that reading is purely mechanical. By applying all these mechanical reading processes to kids, most of the kids eventually read. So it *seems* like the processes worked.<br/>\n <br/>\n&gt; But the kids have also grown older in that time.<br/>\n <br/>\n&gt; It would only be a wild theory that time was important in learning to read if there weren&#39;t 1000s of unschooled kids who&#39;ve learned to read without the mechanics of instruction. What they have is time and positive and useful-to-them experiences with print. They all learn to read. And without the bad side effects of force-fed reading instruction that leaves many kids feeling stupid and hating reading.<br/>\n <br/>\n&gt; (Not all unschooled kids love to read just as not all unschooled kids love to ride bikes. But their opinions about reading are personal preferences not because of bad experiences with reading instruction.)<br/>\n <br/>\n<br/>\n<br/>\n </span></blockquote>Thank you Joyce, I really wish this understanding about children&#39;s reading development was more widely known. There is so much fear around it for parents and children.  Rudolf Steiner was a big fan of allowing children to read in their own time and in Holland they still believe this in many schools.  <br/>\n<br/>\nI think my daughter is not fully UNschooled, she still compares her educational experiences at home with her school experience and if we aren&#39;t behaving in the same way doesn&#39;t believe she is learning.   It doesn&#39;t help that her best friend is now going back to school after just a year of being home educated. <br/>\nOf course I won&#39;t have this issue with my son who will never go to school.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If she&#39;s having fun with it, fine. If she believes she&#39;ll learn to read from it, not fine.<br/>\n<br/>\n </span></blockquote>Your right about the Reading Eggs.  I came to the conclusion recently, that we can see no evidence of the package &quot;helping&quot; in anyway, so what&#39;s the point, as you say unless she is having fun with it.<br/>\n<br/>\nSomething else I would really like to ask is how other Unschoolers deal with people who are very negative about how we are educationing our children?<br/>\n<br/>\nMy mother-in-law is really difficult.  She works in a State Junior School and every time we see or speak with her, she goes on and on about the children not reading yet, not being at the same level as other children in school.  She says every thing in front of my daughter and son so they hear all this negative stuff. <br/>\n<br/>\nShe is so undermining, I feel really tense and uncomfortable around her but my children love her so much, so not seeing her isn&#39;t an option.  <br/>\nEven if I am not there, she will say little things to the children about them needing to be in school as they will &quot;learn more&quot; there!  She is always questioning them about what they have been doing and sometimes will say, in response to their answers &quot;That&#39;s not learning!&quot;.<br/>\n<br/>\nDoes anyone have any suggestions of how to deal with a family member or anyone really, who criticises your choice to Home educated. <br/>\n<br/>\nregards<br/>\nLouise</div>","specialLinks":[]},{"userId":124256069,"authorName":"Bun","from":"&quot;Bun&quot; &lt;alohabun@...&gt;","profile":"alohabun","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: motivating my daughter!","postDate":"1339301785","msgId":67579,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpyMTcycCs3ODZlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBT09UYVhQMk55MlNpaFhUeS05MGpWPUc0WWN3Y1BSOTUtZ1Q9UmNjNExZLWZMZS1uZ0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":67576,"nextInTopic":67584,"prevInTime":67578,"nextInTime":67580,"topicId":67525,"numMessagesInTopic":0,"msgSnippet":"... Some Horrible History videos are available on youtube - Here s one... http://www.youtube.com/watch?v=8ZYfDOwXheM&feature=related Laurie","messageBody":"<div id=\"ygrps-yiv-889696622\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Pam Sorooshian &lt;pamsoroosh@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; There is a book series that I&#39;d recommend because it is SO fun....it is the&gt; series called: Horrible Histories by Terry Deary. Google it. &gt;They currently &gt; have a tv series, too, it is a BBC production, I &gt;believe, and I&#39;m not sure &gt; if it is available outside of England.<br/>\n<br/>\n </span></blockquote>Some Horrible History videos are available on youtube - Here&#39;s one...<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.youtube.com/watch?v=8ZYfDOwXheM&feature=related\">http://www.youtube.com/watch?v=8ZYfDOwXheM&feature=related</a><br/>\n<br/>\nLaurie</div>","specialLinks":[{"url":"http://www.youtube.com/embed/8ZYfDOwXheM?wmode=opaque","type":"VIDEO"}]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: motivating my daughter!","postDate":"1339255373","msgId":67575,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY4RkQ0MDBDREMxQjQzOTVCRTQ4OERDMDQ0NkQ3NDc1QERlYm9yYWhQQz4=","inReplyToHeader":"PEU1NTEyMzZCLUFCQkYtNDU2Ni05REYwLTNDODFEQkMxMkFENkBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGpxcWowNCtuazM1QGVHcm91cHMuY29tPiA8RTU1MTIzNkItQUJCRi00NTY2LTlERjAtM0M4MURCQzEyQUQ2QFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":67574,"nextInTopic":67576,"prevInTime":67574,"nextInTime":67576,"topicId":67525,"numMessagesInTopic":0,"msgSnippet":"***If taping things on the wall disturbs you, what about cards to lay out on the table in the order in which they go?*** Dylan loved dinosaurs when he was","messageBody":"<div id=\"ygrps-yiv-1880955642\">***If taping things on the wall disturbs you, what about cards to lay out on the table in the order in which they go?***  <br/>\n<br/>\nDylan loved dinosaurs when he was little so we had pictures on the floor between his room, which was the cretaceous period, and our living room, which was now (in 1997&lt;g&gt;) .  He was frequently traveling back and forth through time and stopping to play in different places.  <br/>\n<br/>\nWe had the solar system on a wall with the planets (including poor Pluto in those days) in order from the sun, and we could put little space ships up there and little astronaut dudes on the planets.  We could add a mystery planet if wed just watched some crazy movie. We had several asteroid catastrophes. We had action figures taped up there sometimes, cavemen on Jupiter, dinosaurs on Mars. <br/>\n<br/>\nThe other day Dylan showed me a gif of our galaxy colliding with Andromeda and I thought about our little house in those days and how I might have had posters we could have been scooching ever closer together during our space exploration games, and how cool hes making gifs now that seem directly related to all that fun, low tech play fifteen years ago.&lt;g&gt; <br/>\n<br/>\nSo, I second the timeline recommendation, is what I meant to say. &lt;g&gt; <br/>\n<br/>\nDeb Lewis<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":483965502,"authorName":"oneredpoppy","from":"&quot;oneredpoppy&quot; &lt;japoppy@...&gt;","profile":"oneredpoppy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: motivating my daughter!","postDate":"1339255075","msgId":67576,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpxdnBmMytmdmVpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEMwNUExRTkxLURFMUUtNEY2Mi1COUYyLUMwRUI3QjY1ODk2REBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":67575,"nextInTopic":67579,"prevInTime":67575,"nextInTime":67577,"topicId":67525,"numMessagesInTopic":0,"msgSnippet":"My 11 yr. old son Cutter and I love Timeline: Inventions (the card game): http://bit.ly/KjhP8E We found it in our local Barnes and Noble. The pictures are","messageBody":"<div id=\"ygrps-yiv-1156282988\">My 11 yr. old son Cutter and I love Timeline: Inventions (the card game): <a rel=\"nofollow\" target=\"_blank\" href=\"http://bit.ly/KjhP8E\">http://bit.ly/KjhP8E</a> We found it in our local Barnes and Noble.<br/>\n<br/>\nThe pictures are beautiful, and it&#39;s been fun to be surprised that certain inventions came along before others - and it&#39;s a great, simple game that he can play with his 80 yr. old grandma.<br/>\n<br/>\nJen</div>","specialLinks":[]},{"userId":342782030,"authorName":"K Pennell","from":"K Pennell &lt;mrsringsabre@...&gt;","profile":"mrsringsabre","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: motivating my daughter!","postDate":"1339197971","msgId":67574,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMzkxOTc5NzEuNzc4MTcuWWFob29NYWlsQ2xhc3NpY0B3ZWIxMjE3MDMubWFpbC5uZTEueWFob28uY29tPg==","inReplyToHeader":"PEMwNUExRTkxLURFMUUtNEY2Mi1COUYyLUMwRUI3QjY1ODk2REBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":67573,"nextInTopic":67575,"prevInTime":67573,"nextInTime":67575,"topicId":67525,"numMessagesInTopic":0,"msgSnippet":"There is a Chronology Jr. board game too, which is pretty fun. My younger son likes it. ... From: Sandra Dodd  Subject: Re:","messageBody":"<div id=\"ygrps-yiv-91178178\">There is a Chronology Jr. board game too, which is pretty fun. My younger son likes it.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Fri, 6/8/12, Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; wrote:<br/>\n<br/>\nFrom: Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt;<br/>\nSubject: Re: [AlwaysLearning] Re: motivating my daughter!<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nDate: Friday, June 8, 2012, 6:46 PM<br/>\n<br/>\nI played another game like Chronology today on an iPad. It&#39;s in French or English (language-switching option). It&#39;s called Timeline but that&#39;s hard to find in the App store, so put in Bombyx Timeline. It&#39;s $3. There&#39;s more info here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://boardgamegeek.com/blogpost/7969/ios-review-timeline-for-ipad\">http://boardgamegeek.com/blogpost/7969/ios-review-timeline-for-ipad</a><br/>\nIt might be too difficult for younger children. Don&#39;t use it if it&#39;s going to make someone afraid of history or trivia!<br/>\n<br/>\nSandra<br/>\n<br/>\n------------------------------------<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: motivating my daughter!","postDate":"1339195594","msgId":67573,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEMwNUExRTkxLURFMUUtNEY2Mi1COUYyLUMwRUI3QjY1ODk2REBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGpxdDI2dCtibWplQGVHcm91cHMuY29tPg==","referencesHeader":"PGpxdDI2dCtibWplQGVHcm91cHMuY29tPg=="},"prevInTopic":67566,"nextInTopic":67574,"prevInTime":67572,"nextInTime":67574,"topicId":67525,"numMessagesInTopic":0,"msgSnippet":"I played another game like Chronology today on an iPad.  It s in French or English (language-switching option).  It s called Timeline but that s hard to find","messageBody":"<div id=\"ygrps-yiv-1914778284\">I played another game like Chronology today on an iPad.  It&#39;s in French or English (language-switching option).  It&#39;s called Timeline but that&#39;s hard to find in the App store, so put in Bombyx Timeline.  It&#39;s $3.  There&#39;s more info here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://boardgamegeek.com/blogpost/7969/ios-review-timeline-for-ipad\">http://boardgamegeek.com/blogpost/7969/ios-review-timeline-for-ipad</a><br/>\nIt might be too difficult for younger children.  Don&#39;t use it if it&#39;s going to make someone afraid of history or trivia!<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":472480490,"authorName":"sheeboo2","from":"&quot;sheeboo2&quot; &lt;brmino@...&gt;","profile":"sheeboo2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: motivating my daughter!","postDate":"1339165725","msgId":67566,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpxdDI2dCtibWplQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpxcWowNCtuazM1QGVHcm91cHMuY29tPg=="},"prevInTopic":67563,"nextInTopic":67573,"prevInTime":67565,"nextInTime":67567,"topicId":67525,"numMessagesInTopic":0,"msgSnippet":"... of history, we visited an Iron age Celtic Village and she wanted to know whether the Romans came before or after, and what about Beatrice Potter s time and","messageBody":"<div id=\"ygrps-yiv-172866641\">---- Just finished &quot;what is Strewing&quot; and had a thought, my daughter has been asking a lot<br/>\nof history, we visited an Iron age Celtic Village and she wanted to know whether<br/>\nthe Romans came before or after, and what about Beatrice Potter&#39;s time and Jane<br/>\nAustin, and Egypt, where did they all fit in time? ----<br/>\n<br/>\nAt the ALL in May conference Sandra introduced some of us to the Chronology card game: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.ccgarmory.com/chronologygame.html\">http://www.ccgarmory.com/chronologygame.html</a><br/>\n<br/>\nIt was a lot of fun! I used up the last of my phone battery while we were playing because some of the answers gave rise to more questions I wanted to Google.<br/>\n<br/>\nBrie</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: motivating my daughter!","postDate":"1339160439","msgId":67563,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMzkxNjA0MzkuMTQ4MTEuWWFob29NYWlsTmVvQHdlYjgxNTA3Lm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PGpxc2ttMStzdWc3QGVHcm91cHMuY29tPg==","referencesHeader":"PENBT09UYVhOMzBRRj14a0hPMU12QXc5QTktS3ZZeDY2eWI0UEp4c1ZvU09mc3BPeXlkZ0BtYWlsLmdtYWlsLmNvbT4gPGpxc2ttMStzdWc3QGVHcm91cHMuY29tPg=="},"prevInTopic":67562,"nextInTopic":67566,"prevInTime":67562,"nextInTime":67564,"topicId":67525,"numMessagesInTopic":0,"msgSnippet":"Here ( right side) http://sandradodd.com/books  Alex Polikowsky [Non-text portions of this message have been removed]","messageBody":"<div id=\"ygrps-yiv-2037551631\">Here ( right side)<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/books%c2%a0\">http://sandradodd.com/books%c2%a0</a><br/>\n<br/>\n<br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: motivating my daughter!","postDate":"1339160343","msgId":67562,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMzkxNjAzNDMuMzM4MjEuWWFob29NYWlsTmVvQHdlYjgxNTA1Lm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PGpxc2ttMStzdWc3QGVHcm91cHMuY29tPg==","referencesHeader":"PENBT09UYVhOMzBRRj14a0hPMU12QXc5QTktS3ZZeDY2eWI0UEp4c1ZvU09mc3BPeXlkZ0BtYWlsLmdtYWlsLmNvbT4gPGpxc2ttMStzdWc3QGVHcm91cHMuY29tPg=="},"prevInTopic":67560,"nextInTopic":67563,"prevInTime":67561,"nextInTime":67563,"topicId":67525,"numMessagesInTopic":0,"msgSnippet":"I ve read Dayne Martins, Radical Unschooling book which i like a lot but can you recommend any other books for me to read on the subject. -=-=-=-=- Well","messageBody":"<div id=\"ygrps-yiv-1314036367\">I&#39;ve read Dayne Martins, Radical Unschooling book which i like a lot but can you recommend any other books for me to read on the subject.<br/>\n<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\n<br/>\nWell that may be the problem :)<br/>\nI would say that is the last book I would read on unschooling!! Dayna is all about Laws of Attraction and that is not unschooling.<br/>\nTo be honest I have not read the book. But having read many things she has written and having lurked on her yahoo group did not make me want to.<br/>\n<br/>\nSandra has two book.<br/>\nMoving a Puddle and<br/>\nThe Big Book of Unschooling ( my bedside table book)<br/>\n<br/>\nPam Larrichia has one that just came out.<br/>\nThere are a a couple other small books that were pretty good too.<br/>\nI think Sandra may have them listed on her site.<br/>\n<br/>\nBut you also have SAndra&#39;s website and Joyces Website chuck full of great stuff!<br/>\n<br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] motivating my daughter!","postDate":"1339156443","msgId":67560,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYxODMxNzNELTZCNEItNDhGQi1BRTJBLUE4OEE3RkMzQkFDMkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGpxcWowNCtuazM1QGVHcm91cHMuY29tPg==","referencesHeader":"PGpxcWowNCtuazM1QGVHcm91cHMuY29tPg=="},"prevInTopic":67558,"nextInTopic":67562,"prevInTime":67559,"nextInTime":67561,"topicId":67525,"numMessagesInTopic":0,"msgSnippet":"... The peers who *can t* read are keeping quiet so (they hope) no one realizes. So she s seeing only a skewed sample of everyone s reading ability. ... If","messageBody":"<div id=\"ygrps-yiv-1565037123\">On Jun 7, 2012, at 11:56 AM, louise.king76 wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; One of the issues she struggles with is her level of reading ability compared to all her friends.<br/>\n<br/>\n </span></blockquote>The peers who *can&#39;t* read are keeping quiet so (they hope) no one realizes. So she&#39;s seeing only a skewed sample of everyone&#39;s reading ability.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; We loves stories and have always read to her and now have found a reading<br/>\n&gt; package on line called Reading Eggs which she loves but she still doesn&#39;t Get reading.<br/>\n&gt; This is fine with me but she feels unhappy because all her friends<br/>\n&gt; are reading well by now.  So, any ideas on that one would be great.  <br/>\n<br/>\n </span></blockquote>If she&#39;s having fun with it, fine. If she believes she&#39;ll learn to read from it, not fine.<br/>\n<br/>\nReading ability comes from the brain being developmentally ready to read. And the only way to get there is by waiting. A brain can&#39;t read before it&#39;s ready any more than legs can walk before they&#39;re ready. A reading program will be just as frustrating and useless to a non-reader as walking programs to a non-walker.<br/>\n<br/>\nThat sounds wrong because schools falsely operate under the assumption that reading is purely mechanical. By applying all these mechanical reading processes to kids, most of the kids eventually read. So it *seems* like the processes worked.<br/>\n<br/>\nBut the kids have also grown older in that time.<br/>\n<br/>\nIt would only be a wild theory that time was important in learning to read if there weren&#39;t 1000s of unschooled kids who&#39;ve learned to read without the mechanics of instruction. What they have is time and positive and useful-to-them experiences with print. They all learn to read. And without the bad side effects of force-fed reading instruction that leaves many kids feeling stupid and hating reading.<br/>\n<br/>\n(Not all unschooled kids love to read just as not all unschooled kids love to ride bikes. But their opinions about reading are personal preferences not because of bad experiences with reading instruction.)<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: motivating my daughter!","postDate":"1339154745","msgId":67558,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVGNTE5RUQ1LTczREYtNDkxQy05MTdDLTk0QTA4REUwN0U0MUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGpxc2ttMStzdWc3QGVHcm91cHMuY29tPg==","referencesHeader":"PGpxc2ttMStzdWc3QGVHcm91cHMuY29tPg=="},"prevInTopic":67557,"nextInTopic":67560,"prevInTime":67557,"nextInTime":67559,"topicId":67525,"numMessagesInTopic":0,"msgSnippet":"http://sandradodd.com/books has four books. Two are mine, on is new, and good, by Pam Laricchia.  One is by Rue Kream. I have them there in the order in which","messageBody":"<div id=\"ygrps-yiv-1562535394\"><a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/books\">http://sandradodd.com/books</a> has four books. Two are mine, on is new, and good, by Pam Laricchia.  One is by Rue Kream.<br/>\n<br/>\nI have them there in the order in which I think people should buy them. :-)   But Pam Laricchia&#39;s book is good for people who have no idea what unschooling is about (grandparents, in-laws, parents, neighbors, friends).  My &quot;Big Book&quot; is good for people who DO know what it is, and want help to do it well.   Both those books are good to have.<br/>\n<br/>\nI don&#39;t recommend the one you&#39;ve already read, ever, because it&#39;s basically a summary of what the author had read other places, and not a very clear summary.  And rather than credit her sources, she tries to give the impression that the ideas and understandings are her own, which is misleading.  Dishonest.  Plagiarism in some passages.  I&#39;m sorry you didn&#39;t come upon a better book earlier, but for now it might help for you to know that there are other sources and resources.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":529985200,"authorName":"louise.king76","from":"&quot;louise.king76&quot; &lt;louise.j.king@...&gt;","profile":"louise.king76","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: motivating my daughter!","postDate":"1339151873","msgId":67557,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpxc2ttMStzdWc3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBT09UYVhOMzBRRj14a0hPMU12QXc5QTktS3ZZeDY2eWI0UEp4c1ZvU09mc3BPeXlkZ0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":67536,"nextInTopic":67558,"prevInTime":67556,"nextInTime":67558,"topicId":67525,"numMessagesInTopic":0,"msgSnippet":"Thank you Pam, (and Sandra)  this is all really useful advice.   I cetainly do have a lot to ponder on, feeling a bit panick that i won t be able to break free","messageBody":"<div id=\"ygrps-yiv-586652674\">Thank you Pam, (and Sandra)  this is all really useful advice.   I cetainly do have a lot to ponder on, feeling a bit panick that i won&#39;t be able to break free from my old ideas of education which are so ingrained that you don&#39;t also realise you are carrying them! <br/>\nAlso trying not beat myself up for not being a &quot;good enough&quot; Unschoolers/ Parent which is easy to do. <br/>\nI&#39;ve read Dayne Martins, Radical Unschooling book which i like a lot but can you recommend any other books for me to read on the subject. <br/>\n<br/>\nBest wishes <br/>\nLouise x <br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Pam Sorooshian &lt;pamsoroosh@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; On Thu, Jun 7, 2012 at 10:06 AM, Pam Sorooshian &lt;pamsoroosh@...&gt; wrote:<br/>\n&gt; &gt; So, i&#39;ve order some illustrated history books (i like Usborne) and started<br/>\n&gt; &gt; planning a project BUT now I&#39;ve read about strewing and strings attached,<br/>\n&gt; &gt; I&#39;m thinking planning a project is not the thing to do.<br/>\n&gt; <br/>\n&gt; By the way, you&#39;ll have deschooled and moved into unschooling<br/>\n&gt; thoroughly when statements like the above seem clearly inappropriate<br/>\n&gt; to you.<br/>\n&gt; <br/>\n&gt; Can you spot what it is that I&#39;m seeing that makes me say that?<br/>\n&gt; <br/>\n&gt; It is that you say &quot;I like Usborne.&quot; What &quot;you&quot; like isn&#39;t relevant. A<br/>\n&gt; deepened unschooler would say, &quot;My daughter likes Usborne.&quot; If it is<br/>\n&gt; true - maybe it is, maybe it isn&#39;t - but that you said &quot;I&quot; is really<br/>\n&gt; significant and something for you to ponder further.<br/>\n&gt; <br/>\n&gt; -pam<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: motivating my daughter!","postDate":"1339094924","msgId":67536,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ4NTYzOTRGLTUxQjktNDRGRi05NUEzLUM0QjAyOUUyMEVGN0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PENBT09UYVhOMzBRRj14a0hPMU12QXc5QTktS3ZZeDY2eWI0UEp4c1ZvU09mc3BPeXlkZ0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PGpxcWowNCtuazM1QGVHcm91cHMuY29tPiA8Q0FPT1RhWFAyTnkyU2loWFR5LTkwalY9RzRZY3djUFI5NS1nVD1SY2M0TFktZkxlLW5nQG1haWwuZ21haWwuY29tPiA8Q0FPT1RhWE4zMFFGPXhrSE8xTXZBdzlBOS1Ldll4NjZ5YjRQSnhzVm9TT2ZzcE95eWRnQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":67530,"nextInTopic":67557,"prevInTime":67535,"nextInTime":67537,"topicId":67525,"numMessagesInTopic":0,"msgSnippet":"-=-It is that you say I like Usborne. What you like isn t relevant. A deepened unschooler would say, My daughter likes Usborne. If it is true - maybe it","messageBody":"<div id=\"ygrps-yiv-1953491417\">-=-It is that you say &quot;I like Usborne.&quot; What &quot;you&quot; like isn&#39;t relevant. A<br/>\ndeepened unschooler would say, &quot;My daughter likes Usborne.&quot; If it is<br/>\ntrue - maybe it is, maybe it isn&#39;t - but that you said &quot;I&quot; is really<br/>\nsignificant and something for you to ponder further.-=-<br/>\n<br/>\nOn the other hand, I like someone saying &quot;I like Usborne&quot; better than saying &quot;We like Usborne,&quot; when the meaning is really &quot;I like Usborne, and my kids will go along with it.&quot;<br/>\n<br/>\nI LOVED Usborne books when my kids were young, and bought more than they really wanted, but I liked them. :-)   <br/>\nI have given some away over the years, but some were never for my kids in the first place.  Shakespeare, and some of the music books were always mine, Mine, MINE!!  :-)<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: motivating my daughter!","postDate":"1339089753","msgId":67530,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU1NTEyMzZCLUFCQkYtNDU2Ni05REYwLTNDODFEQkMxMkFENkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGpxcWowNCtuazM1QGVHcm91cHMuY29tPg==","referencesHeader":"PGpxcWowNCtuazM1QGVHcm91cHMuY29tPg=="},"prevInTopic":67528,"nextInTopic":67536,"prevInTime":67529,"nextInTime":67531,"topicId":67525,"numMessagesInTopic":0,"msgSnippet":"-=- We loves stories and have always read to her and now have found a reading package on line called Reading Eggs which she loves but she still doesn t Get","messageBody":"<div id=\"ygrps-yiv-204281294\">-=- We loves stories and have always read to her and now have found a reading package on line called Reading Eggs which she loves but she still doesn&#39;t Get reading.  This is fine with me but she feels unhappy because all her friends are reading well by now.  So, any ideas on that one would be great.  -=-<br/>\n<br/>\nGet away from Reading Eggs UNLESS she&#39;s just playing with it, without thinking that&#39;s how one needs to learn to read.<br/>\n<br/>\nI would say infuse her life with input, and books!  But not books on paper that don&#39;t make sense to her.  Books you read, or audio books, or movies of books.   Spend the next months and maybe years not even talking about reading, but living lives where information flows all around.  <br/>\n<br/>\nShe will read, and will be happy to do it, unless continued feelings of failure and &#39;being behind&#39; cause it to be more difficult.  School does that to &quot;late readers&quot; by calling them &quot;non-readers.&quot;  Don&#39;t do it at home.  Learning does not require reading.   (And reading does not guarantee learning.)<br/>\n<br/>\n-=- I have been reading more of Sandra&#39;s blog and articles. Just finished &quot;what is Strewing&quot; and had a thought, my daughter has been asking a lot of history, we visited an Iron age Celtic Village and she wanted to know whether the Romans came before or after, and what about Beatrice Potter&#39;s time and Jane Austin, and Egypt, where did they all fit in time?  So, i&#39;ve order some illustrated history books (i like Usborne) and started planning a project BUT now I&#39;ve read about strewing and strings attached, I&#39;m thinking planning a project is not the thing to do.  Just looking at the books together when they arrive as i love history too and then seeing what my daughter would like to do with them, if anything.  -=-<br/>\n<br/>\nYou read about strewing,<br/>\nShe asked some specific questions,<br/>\nand you&#39;re waiting for books!?  <br/>\n<br/>\nNo, no, no.   You&#39;re missing a world of opportunities. <br/>\n<br/>\nYou could build a timeline by writing down the date of the Iron Age village and taping it to the wall, and putting Beatrice Potter (or a picture of Peter Rabbit) on a card and taping it on the wall, and maybe a card that says &quot;Jane Austen&quot; or that has a picture of one of her books, and putting it on the wall in relationship to those others.  It doesn&#39;t need to be measured into years or even centuries.  Just relative.  &quot;Which one came first?&quot; was her question.  <br/>\n<br/>\nWhy wait for books while you&#39;re sitting at a computer writing to us?   Google it!<br/>\n<br/>\nIf taping things on the wall disturbs you, what about cards to lay out on the table in the order in which they go?<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":504505579,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: motivating my daughter!","postDate":"1339089318","msgId":67528,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBT09UYVhOMzBRRj14a0hPMU12QXc5QTktS3ZZeDY2eWI0UEp4c1ZvU09mc3BPeXlkZ0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PENBT09UYVhQMk55MlNpaFhUeS05MGpWPUc0WWN3Y1BSOTUtZ1Q9UmNjNExZLWZMZS1uZ0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PGpxcWowNCtuazM1QGVHcm91cHMuY29tPgk8Q0FPT1RhWFAyTnkyU2loWFR5LTkwalY9RzRZY3djUFI5NS1nVD1SY2M0TFktZkxlLW5nQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":67527,"nextInTopic":67530,"prevInTime":67527,"nextInTime":67529,"topicId":67525,"numMessagesInTopic":0,"msgSnippet":"... By the way, you ll have deschooled and moved into unschooling thoroughly when statements like the above seem clearly inappropriate to you. Can you spot","messageBody":"<div id=\"ygrps-yiv-1003667684\">On Thu, Jun 7, 2012 at 10:06 AM, Pam Sorooshian &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pamsoroosh@...\">pamsoroosh@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; So, i&#39;ve order some illustrated history books (i like Usborne) and started<br/>\n&gt; planning a project BUT now I&#39;ve read about strewing and strings attached,<br/>\n&gt; I&#39;m thinking planning a project is not the thing to do.<br/>\n<br/>\n </span></blockquote>By the way, you&#39;ll have deschooled and moved into unschooling<br/>\nthoroughly when statements like the above seem clearly inappropriate<br/>\nto you.<br/>\n<br/>\nCan you spot what it is that I&#39;m seeing that makes me say that?<br/>\n<br/>\nIt is that you say &quot;I like Usborne.&quot; What &quot;you&quot; like isn&#39;t relevant. A<br/>\ndeepened unschooler would say, &quot;My daughter likes Usborne.&quot; If it is<br/>\ntrue - maybe it is, maybe it isn&#39;t - but that you said &quot;I&quot; is really<br/>\nsignificant and something for you to ponder further.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":504505579,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: motivating my daughter!","postDate":"1339088819","msgId":67527,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBT09UYVhQMk55MlNpaFhUeS05MGpWPUc0WWN3Y1BSOTUtZ1Q9UmNjNExZLWZMZS1uZ0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGpxcWowNCtuazM1QGVHcm91cHMuY29tPg==","referencesHeader":"PGpxcWowNCtuazM1QGVHcm91cHMuY29tPg=="},"prevInTopic":67526,"nextInTopic":67528,"prevInTime":67526,"nextInTime":67528,"topicId":67525,"numMessagesInTopic":0,"msgSnippet":"... Treat her unhappiness about not yet reading the same way you d respond to any other unhappiness that you can t fix immediately. Be sympathetic and ","messageBody":"<div id=\"ygrps-yiv-1962705167\">On Thu, Jun 7, 2012 at 8:56 AM, louise.king76 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:louise.j.king@...\">louise.j.king@...</a>&gt;wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; One of the issues she struggles with is her level of reading ability<br/>\n&gt; compared to all her friends. We loves stories and have always read to her<br/>\n&gt; and now have found a reading package on line called Reading Eggs which she<br/>\n&gt; loves but she still doesn&#39;t Get reading.  This is fine with me but she<br/>\n&gt; feels unhappy because all her friends are reading well by now.  So, any<br/>\n&gt; ideas on that one would be great.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Treat her unhappiness about not yet reading the same way you&#39;d respond to<br/>\nany other unhappiness that you can&#39;t fix immediately. Be sympathetic and<br/>\ncomforting and reassuring. Don&#39;t let her wallow in it by being SO<br/>\nsympathetic that you make it worse. Sometimes it helps to simply be<br/>\ndistracting. Help her when she wants help, but be careful not to act<br/>\nanxious or worried, yourself.<br/>\n<br/>\nProtect her from potentially embarrassing moments by thinking ahead. If she<br/>\njoins Girl Guides, for example, talk to the leader about whether she often<br/>\nasks the girls to read aloud - let her know that would embarrass your<br/>\ndaughter and you&#39;d appreciate if she&#39;d give you advance warning so she<br/>\ncould practice the reading first. You could start a Girl Guides troop<br/>\nyourself, by the way, get the training and BE the leader - it is great fun<br/>\n(I was a Girl Scout leader for around 15 years, myself.) If you&#39;re the<br/>\nleader, you&#39;ll have control over how any &quot;reading&quot; at meetings or events is<br/>\nhandled. AND you&#39;ll get to know the other girls and parents and can support<br/>\nyour daughter&#39;s social life even more easily.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I feel i still have a lot of old parenting beliefs i need to drop and i&#39;m<br/>\n&gt; working on those. I have been reading more of Sandra&#39;s blog and articles.<br/>\n&gt; Just finished &quot;what is Strewing&quot; and had a thought, my daughter has been<br/>\n&gt; asking a lot of history, we visited an Iron age Celtic Village and she<br/>\n&gt; wanted to know whether the Romans came before or after, and what about<br/>\n&gt; Beatrice Potter&#39;s time and Jane Austin, and Egypt, where did they all fit<br/>\n&gt; in time?  So, i&#39;ve order some illustrated history books (i like Usborne)<br/>\n&gt; and started planning a project BUT now I&#39;ve read about strewing and strings<br/>\n&gt; attached, I&#39;m thinking planning a project is not the thing to do.  Just<br/>\n&gt; looking at the books together when they arrive as i love history too and<br/>\n&gt; then seeing what my daughter would like to do with them, if anything. &gt;&gt;&gt;<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>You are still thinking &quot;books&quot; or &quot;projects&quot; as the way to learn. I have a<br/>\n24-year old daughter who is studying history in college - she&#39;s just<br/>\nstarting graduate school. As a kid, she always loved history. So I have a<br/>\nlot of experience with supporting that particular interest.<br/>\n<br/>\nDo you live in a place where you have access to cool museums? Get<br/>\nmemberships so you can go frequently for short visits. Go to science, art,<br/>\nnatural history, technology, and all kinds of specialty museums. We have<br/>\n(in Los Angeles near where I live) an automotive museum that is<br/>\nsurprisingly extraordinarily fascinating and fun and all about the modern<br/>\nhistory of the world seen through the lens of the development of cars.<br/>\n<br/>\nSounds like you live in a place where there are lots of historical sites -<br/>\nvisit those as often as possible, again, even just for short stops (in<br/>\nother words, these can become part of daily life, not big special<br/>\noccasions). When you go anywhere, check for historically interesting things<br/>\n- always google and find out any interesting things about that place. A<br/>\nzillion times I have driven a little out of our way just to be at a<br/>\nlocation where I could say, &quot;This is where X happened.&quot; That&#39;s it. Maybe<br/>\nthat would lead to a big conversation or not. Stop at graveyards and wander<br/>\naround. Go into churches. Notice old architectural styles - point out older<br/>\nbuildings.<br/>\n<br/>\nI have a friend whose sone collected &quot;National Historical Landmarks.&quot; In<br/>\nthe US, these are sites officially designated by the National Park Service.<br/>\nOften there is just a plaque there - sometimes a statue - sometimes a<br/>\nstructure and sometimes an actual restoration of a site. This boy had a<br/>\njournal in which he kept a photo and note about each historical site they<br/>\nwent to. The sites are all over - sometimes just off the side of a major<br/>\nhighway or down a little backstreet alley. We traveled sometimes with them<br/>\nand we&#39;d often go searching for one of the sites - it led us to some<br/>\ninteresting and unexpected places.<br/>\n<br/>\nIf you play games - there are games that have been around<br/>\nforever...backgammon, chess, card games. You might read, yourself, a bit<br/>\nabout the history of those games and then just mention it when you happen<br/>\nto be playing.<br/>\n<br/>\nChoose movies and tv shows that are historically based.<br/>\n<br/>\nGo to re-enactment events and festivals. Go in costume. Spend time making<br/>\nthose costumes in advance. My kids spent a lot of their childhoods in<br/>\ncostumes - depending on their interests at the time. They spent time<br/>\nlooking at pictures of people of the time/place of interest in order to<br/>\nfigure out what to wear.<br/>\n<br/>\nGo to cultural events - we have Scottish games and Irish dance and Persian<br/>\nnew year and Chinese new year and so on - all of those have public<br/>\ncelebrations with food, dance, costumes, and so on.<br/>\n<br/>\nOne night, for dinner, together plan and make food that would have been<br/>\ntypical for some time period/location. American homeschoolers are fond of<br/>\nthe &quot;Little House on the Prairie&quot; book series and there is a cookbook to go<br/>\nalong with it and my kids occasionally would want to make something from<br/>\nthat cookbook while dressed up in bonnets and long dresses.<br/>\n<br/>\nThere is a book series that I&#39;d recommend because it is SO fun....it is the<br/>\nseries called: Horrible Histories by Terry Deary. Google it. They currently<br/>\nhave a tv series, too, it is a BBC production, I believe, and I&#39;m not sure<br/>\nif it is available outside of England.<br/>\n<br/>\nOkay - so that&#39;s a taste of how I supported my daughter&#39;s interests in<br/>\nhistorical stuff - and it is just a taste. BUT - at the same time - I<br/>\ndidn&#39;t bombard her and overwhelm her with it - I just had all these sort of<br/>\nat my fingertips ready to offer or to slip in throughout our days and weeks<br/>\nas we did all kinds of other things, too.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":504505579,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: motivating my daughter!","postDate":"1339086531","msgId":67526,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBT09UYVhPXzB3cW83OVBuVW1ESDI0QWpFM015QllQM2FqMEZmcmk3R2JfSnVVR0t4d0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGpxcWowNCtuazM1QGVHcm91cHMuY29tPg==","referencesHeader":"PGpxcWowNCtuazM1QGVHcm91cHMuY29tPg=="},"prevInTopic":67525,"nextInTopic":67527,"prevInTime":67525,"nextInTime":67527,"topicId":67525,"numMessagesInTopic":0,"msgSnippet":"... Not sure where you live - you mention bush crafts and Native American culture. If you re in the USA, 4-H might be an option for meeting other kids who like","messageBody":"<div id=\"ygrps-yiv-152628853\">On Thu, Jun 7, 2012 at 8:56 AM, louise.king76 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:louise.j.king@...\">louise.j.king@...</a>&gt;wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; One idea is to join more local groups such as girl guides, this way my<br/>\n&gt; daughter can meet other girls her own age even if they are not home<br/>\n&gt; schoolers.  She loves bush craft activities and is fascinated by the Native<br/>\n&gt; American culture, she also loves Vintage anything and fashions of the past.<br/>\n<br/>\n<br/>\n </span></blockquote>Not sure where you live - you mention bush crafts and Native American<br/>\nculture. If you&#39;re in the USA, 4-H might be an option for meeting other<br/>\nkids who like to do &quot;heritage crafts&quot; like needlepoint or canning or cake<br/>\ndecorating or leatherwork.<br/>\n<br/>\nWe also have a couple of chains of craft stores that offer workshops in<br/>\nthose kinds of things. Does she knit or crochet? If so, there are groups<br/>\nthat meet to do those. Along with finding more girls her general age, also<br/>\nthink about finding more groups or people who share her interests, no<br/>\nmatter what ages they are. Even signing up for workshops here and there can<br/>\nhelp her find people who share that interest. Spend lots of time at places<br/>\npeople with those interests hang out.<br/>\n<br/>\nMy now-27 yo has always loved heritage crafts - and made lots of friends of<br/>\nmany ages throughout the years based on that interest. Now she sells her<br/>\ncreations online and at craft fairs.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":529985200,"authorName":"louise.king76","from":"&quot;louise.king76&quot; &lt;louise.j.king@...&gt;","profile":"louise.king76","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: motivating my daughter!","postDate":"1339084612","msgId":67525,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpxcWowNCtuazM1QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":67526,"prevInTime":67524,"nextInTime":67526,"topicId":67525,"numMessagesInTopic":0,"msgSnippet":"Thank you to all whom responded to my last post, there were some wise words. Just to clarify, you are totally right about Steiner education and the journey","messageBody":"<div id=\"ygrps-yiv-192160466\">Thank you to all whom responded to my last post, there were some wise words.<br/>\nJust to clarify, you are totally right about Steiner education and the journey of letting go of that over the last year has been liberating for me and my children. I now view it, like you as very limiting on children and very prescriptive. I&#39;ve has great fun saying &quot;Yes&quot; to plastic toys, dvd&#39;s and computer games even enjoying them myself. I do feel i support my daughters needs as much as i can, she loves ballet and flute. We do have long plays and sleepovers which she loves. But, your both right, there might be more i could do. We need to find more girls!<br/>\n<br/>\nOne idea is to join more local groups such as girl guides, this way my daughter can meet other girls her own age even if they are not home schoolers. She loves bush craft activities and is fascinated by the Native American culture, she also loves Vintage anything and fashions of the past.<br/>\n<br/>\nOne of the issues she struggles with is her level of reading ability compared to all her friends. We loves stories and have always read to her and now have found a reading package on line called Reading Eggs which she loves but she still doesn&#39;t Get reading. This is fine with me but she feels unhappy because all her friends are reading well by now. So, any ideas on that one would be great. <br/>\n<br/>\n<br/>\nI feel i still have a lot of old parenting beliefs i need to drop and i&#39;m working on those. I have been reading more of Sandra&#39;s blog and articles. Just finished &quot;what is Strewing&quot; and had a thought, my daughter has been asking a lot of history, we visited an Iron age Celtic Village and she wanted to know whether the Romans came before or after, and what about Beatrice Potter&#39;s time and Jane Austin, and Egypt, where did they all fit in time? So, i&#39;ve order some illustrated history books (i like Usborne) and started planning a project BUT now I&#39;ve read about strewing and strings attached, I&#39;m thinking planning a project is not the thing to do. Just looking at the books together when they arrive as i love history too and then seeing what my daughter would like to do with them, if anything. <br/>\n<br/>\n<br/>\nThank you again<br/>\nLouise</div>","specialLinks":[]}],"prevTopicId":67661,"nextTopicId":67749}}