{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"mrstar","from":"&quot;mrstar&quot; &lt;mrstar@...","replyTo":"LIST","senderId":"K9igEr8hgw1aA3jLIGLn4Hg-XckPYc-qCZdO9d3tEI4fVqmxqNRtJgkBVZejfyPIXHB4rHQKq8GOJwPoNXUePhVHCuc","spamInfo":{"isSpam":false,"reason":"0"},"subject":"What if this was you?","postDate":"941523797","msgId":4156,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4yNzcuNDE1Ni45NTkyNjk3NDNAZUdyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":4155,"nextInTime":4157,"topicId":4156,"numMessagesInTopic":0,"msgSnippet":"The words below are from a woman who is on one of the lists I belong to. Her husband died suddenly a little bit ago and these are some of the things she has","messageBody":"<div id=\"ygrps-yiv-1993558635\">The words below are from a woman who is on one of the lists I belong to. Her<br/>\nhusband died suddenly a little bit ago and these are some of the things she<br/>\nhas said about his passing and their situation. I pass this on because maybe<br/>\nsome of you out there can help. Whether it is to donate to the fund that has<br/>\nbeen set up for this family or maybe just a bear to the program mentioned<br/>\nbelow in this fellow&#39;s name or more prayers, they sound like they could use<br/>\nplenty of those. I do hope no one feels this is spam, I have gotten to know<br/>\nthis lady on the list we are on and I really feel for her in her loss.<br/>\nBlessings to you all.<br/>\n<br/>\nMary (Starfreedom)<br/>\n<br/>\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~<br/>\n    Thank you one and all for your concern and prayers.  Yes, things are<br/>\nquite crazy around here.  The Memorial Service was so unbelievable.  There<br/>\nwere 2,200 people in attendance and 50 fire engines/ladder rigs/medic vans,<br/>\netc., in the procession.  Steve was a very well loved 20 year lieutenant<br/>\nfirefighter and received national acclaim for his inception of the teddy<br/>\nbear<br/>\nprogram, which is now worldwide in scope.  (Giving teddies to children in<br/>\nfire/trauma/accident/health crises.)<br/>\n    The three major Seattle news stations covered the service and procession<br/>\nand there were articles in the Seattle, Tacoma, and Olympia newspapers as<br/>\nwell as news clips on the weekend news last week.<br/>\n    The fire dept. bought Steve a Class A uniform in which to be buried and<br/>\nall the pallbearers plus the one carrying his bunker gear through the<br/>\nceremonies all also purchased Class A uniforms for the event.  The fire<br/>\ndept.<br/>\nprovided four 10-person limosines and four brand new vans just to haul<br/>\naround<br/>\nthe immediate family!!! (Steve was one of 14 children and they all came with<br/>\ntheir spouses and children and grandchildren!!)<br/>\n    The procession was over five miles long from start to finish and we<br/>\ndrove<br/>\naround ten miles to the cemetery from the service.  Police were stationed at<br/>\nevery intersection directing traffic.  All badges in the county- fire and<br/>\npolice - are all crossed in black and every fire dept. in the state has half<br/>\nmast flags.<br/>\n    The entire district fire service personnel attended the funeral and the<br/>\ndistrict were covered voluntarily by another district personnel and all<br/>\ntheir<br/>\novertime has been donated to the Steve Henderson Memorial Fund at any<br/>\nHeritage Bank in Washington.<br/>\n    I&#39;ve heard from places all over the world from people donating teddy<br/>\nbears to their local fire depts. in Steve&#39;s honor.<br/>\n    Steve was a very loved, very honored firefighter.  His casket was<br/>\nbrought<br/>\nto the cemetery on Engine 34 - his engine for 20 years - with his driver<br/>\ndriving him one last time.  The show of all the respect and admiration for<br/>\neveryone&#39;s &quot;Hero&quot; was astounding.  He was a wonderful husband and father,<br/>\ntoo.<br/>\n    Our four teenaged daughters got up in front of 2,200 people and talked<br/>\nabout their Daddy.  His best friend and driver, Pat, the Chief, the Pastor,<br/>\nand Fire Commissioner spoke.  They showed two videos - one of the family set<br/>\nto &quot;Wind Beneath My Wings&quot; and one of the fire service set to &quot;He&#39;s Not<br/>\nHeavy, He&#39;s My Brother.&quot;  There were five bagpipers (traditional at fire and<br/>\npolice funerals), they had Steve&#39;s Harley in front of the church along with<br/>\nhundreds of donated teddy bears decorating the huge sanctuary.<br/>\n    They talked about how Steve was named National Firefighter of the Year<br/>\nin<br/>\n1986 for the Teddy Bear Program and how Governor Booth Gardner proclaimed<br/>\nSteve Henderson Day in the State of Washington April 10, 1987.  He was given<br/>\nso many awards and honors during his life and everyone loved him.<br/>\n    We miss him so much.  My daughters are lost without their Daddy.  He was<br/>\nonly 50 and this was so sudden.  The autopsy said heart attack.<br/>\n    Anyway....before I go on more, thank you for asking.  I am looking for<br/>\nwork now - I&#39;m the breadwinner now!  Steve was on LEOFF2 which means he only<br/>\nwould get the big life insurance if he was killed on duty.  Since he wasn&#39;t,<br/>\nwe&#39;re getting $15,000 and $8,000 goes to the funeral expenses.  I&#39;m hoping<br/>\nthat Steve Henderson Memorial Fund helps us!  I heard there was $900 in it<br/>\nso<br/>\nfar!!  Our mortgage is $1,800 a month and we have no savings, so we&#39;ll have<br/>\nto sell the house and move.  Our car (Steve was working on it when he died)<br/>\nis toast so we&#39;ll need another car, too.  Steve&#39;s brother is buying his<br/>\nHarley so we&#39;ll get $5,000 for that so I can get another car for that.  I<br/>\nhave to have a reliable car!!<br/>\n    So, keep praying - LOT-O-DECISIONS to be made.  I&#39;ve been home raising<br/>\nand homeschooling kids for 21 years and I need to get a job to support my<br/>\nfamily, so I think that&#39;s the main prayer request!!<br/>\n    Thanks for asking and caring.<br/>\n<br/>\nLove, Lynnie<br/>\n<br/>\n<br/>\nThank you for your encouraging words.  This is such a weird time.  Each<br/>\nmorning I think he&#39;s still going to be coming in the door after his shift<br/>\n(he<br/>\nwas gone for 24 hrs. every third day, you see).  The tears still slow pretty<br/>\nfreely around here.  My husband was such a wonderful man.  He loved his<br/>\nfamily above all but God.  He really did.  My four daughters have lost the<br/>\nmost wonderful example of what a husband and father should be.  I&#39;m sorry<br/>\nI&#39;m<br/>\npuddling again.<br/>\n    As for the job part, I&#39;ve been substituting at a Christian high school<br/>\nin<br/>\nTacoma (45 mins away) but need a full time job.  I can&#39;t be certified in WA<br/>\nState until I take a &quot;student teaching course&quot; but I don&#39;t think I want to<br/>\nteach a classroom, anyway.  Subbing and teaching (or should I say CROWD<br/>\nCONTROL) is very stressful, even at a Christian school!!!  My field is more<br/>\ncounseling, but that doesn&#39;t pay enough.<br/>\n    Just pray and God will guide, I know he will!!  Here&#39;s the bank address<br/>\nfor the Memorial Fund.  So far they tell me they have $900 in the account!!<br/>\nPretty cool - but it&#39;s HALF of ONE mortgage payment!!<br/>\n    I&#39;ve got to sell this house and buy down, but I can&#39;t until I have a<br/>\njob.<br/>\nWe are on such time constraints, I can&#39;t tell you.  I think we can only<br/>\nsurvive one more month (November) on the money that was given to us by the<br/>\nfamily and fire dept.  So...I&#39;ve GOT to get a job!!!<br/>\n    Our medical benefits end Nov. 1st as well and I have to pay COBRA to<br/>\nkeep<br/>\non the policy - $300 a month.  I can&#39;t NOT have any medical coverage for us,<br/>\n(and I have to continue the policy at the fire dept. because NO ONE else<br/>\nwill<br/>\ntake me - I&#39;ve had breast cancer twice and Stage IV bone cancer involvement<br/>\nin 19 places, with a bone marrow transplant in 1991 - successful, praise the<br/>\nLord!!)  So you see, no one else will cover me - maybe even not a job - so I<br/>\nhave to keep that policy in effect.  Sorry, I&#39;m venting again....<br/>\n    Thank you, dear friends, for your prayers and uplifting encouragement.<br/>\nGod WILL provide.  I have to remember that.  He will come through.  I don&#39;t<br/>\nblame Him for wanting Steve to come home to Him.  It was His will.  None of<br/>\nmy daughters are bitter, either, thank the Lord.  They are just so sad.  We<br/>\nall are.  We miss our Daddy.<br/>\n<br/>\nThe Steve Henderson Memorial Fund<br/>\nHeritage Bank<br/>\nIndian Summer Branch<br/>\n5800 Rainier Loop SE<br/>\nLacey, WA 98503<br/>\n<br/>\nLove, Lynnie</div>","specialLinks":[]}],"prevTopicId":4154,"nextTopicId":4144}}