{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":8,"messages":[{"userId":327852347,"authorName":"Tress Miles","from":"Tress Miles &lt;milesdt@...&gt;","profile":"abacaxi7476","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: value of computer games","postDate":"1316982152","msgId":63151,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBRkxLeTMwTzFhTWpGb3BjX1YyaEJHNFdSbXY4TGNkTVpBZTZuQUxhbjZLX1pMX1Rwd0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDlFNEJGQTA0LUIxNkQtNEZDQS1BNTNCLTRGQUIxMENFRTMwMEBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGo1bmhkdStwYWh1QGVHcm91cHMuY29tPgk8OUU0QkZBMDQtQjE2RC00RkNBLUE1M0ItNEZBQjEwQ0VFMzAwQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":63147,"nextInTopic":0,"prevInTime":63150,"nextInTime":63152,"topicId":63140,"numMessagesInTopic":0,"msgSnippet":"All the responses have been very helpful, especially the anecdotal stories. Thank you very much!  I m already doing a lot of the things that were suggested,","messageBody":"<div id=\"ygrps-yiv-1452063284\">All the responses have been very helpful, especially the anecdotal stories.<br/>\nThank you very much!  I&#39;m already doing a lot of the things that were<br/>\nsuggested, although I hadn&#39;t mentioned them in my original post.  I was a<br/>\npreschool and kg. teacher for 27 years prior to unschooling my daughter, so<br/>\nI&#39;m still stuck with many attitudes and terminologies.  I hope this group<br/>\nwill help me shed them!<br/>\nTress, mom to Lillie<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sun, Sep 25, 2011 at 12:18 PM, Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; wrote:<br/>\n<br/>\n&gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; -=-As an added note, people who learn to read in the tweens and teens are<br/>\n&gt; more likely to use a strategy other than &quot;sounding out&quot; to learn - so if<br/>\n&gt; she&#39;s sounding things out, let her know that many people find it easier just<br/>\n&gt; to memorize words. For people who learn by visual cues rather than phonetic<br/>\n&gt; cues, &quot;sounding out&quot; can actually prevent them from learning to read because<br/>\n&gt; they can&#39;t move information from short term to long term memory.-=-<br/>\n&gt;<br/>\n&gt; Holly read at 11, and the second thing she read was a Stephen King novella.<br/>\n&gt;<br/>\n&gt; The post office where I go nearly every day has three really quick, bright<br/>\n&gt; clerks and one guy who&#39;s newer and much slower. I&#39;ve shipped books from<br/>\n&gt; there for several years, and most of the people working there know what I do<br/>\n&gt; and don&#39;t want and they don&#39;t ask. This one guy asks me every time all the<br/>\n&gt; official questions, just as though I&#39;m new and he&#39;s new. But the worst thing<br/>\n&gt; is this: I use flat-rate Priority Mail envelopes. He works at the post<br/>\n&gt; office. Every single time, he turns the envelope over and reads the words<br/>\n&gt; &quot;flat rate envelope&quot; and he reads them slowly. He doesn&#39;t recognize the<br/>\n&gt; front of the envelope, and can&#39;t read that phrase at a mere glance.<br/>\n&gt;<br/>\n&gt; He&#39;s a nice man, and probably a military veteran, and that&#39;s a bonus for<br/>\n&gt; employment at the post office. But somewhere, somehow, he was taught<br/>\n&gt; phonics, and told that was how reading worked, and he&#39;s stuck right there.<br/>\n&gt;<br/>\n&gt; Had he learned to read in his own way, it might&#39;ve been a few years later,<br/>\n&gt; but it wouldn&#39;t be something that seems to slow him down rather than speed<br/>\n&gt; him up.<br/>\n&gt;<br/>\n&gt; He would have been much better off (though he&#39;s too old for it to have been<br/>\n&gt; a childhood option) to have been playing video games than practicing<br/>\n&gt; phonics.<br/>\n&gt;<br/>\n&gt; Sandra<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: value of computer games","postDate":"1316967516","msgId":63147,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlFNEJGQTA0LUIxNkQtNEZDQS1BNTNCLTRGQUIxMENFRTMwMEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGo1bmhkdStwYWh1QGVHcm91cHMuY29tPg==","referencesHeader":"PGo1bmhkdStwYWh1QGVHcm91cHMuY29tPg=="},"prevInTopic":63146,"nextInTopic":63151,"prevInTime":63146,"nextInTime":63148,"topicId":63140,"numMessagesInTopic":0,"msgSnippet":"-=-As an added note, people who learn to read in the tweens and teens are more likely to use a strategy other than sounding out to learn - so if she s","messageBody":"<div id=\"ygrps-yiv-691425608\">-=-As an added note, people who learn to read in the tweens and teens are more likely to use a strategy other than &quot;sounding out&quot; to learn - so if she&#39;s sounding things out, let her know that many people find it easier just to memorize words. For people who learn by visual cues rather than phonetic cues, &quot;sounding out&quot; can actually prevent them from learning to read because they can&#39;t move information from short term to long term memory.-=-<br/>\n<br/>\nHolly read at 11, and the second thing she read was a Stephen King novella.<br/>\n<br/>\nThe post office where I go nearly every day has three really quick, bright clerks and one guy who&#39;s newer and much slower.  I&#39;ve shipped books from there for several years, and most of the people working there know what I do and don&#39;t want and they don&#39;t ask.  This one guy asks me every time all the official questions, just as though I&#39;m new and he&#39;s new.   But the worst thing is this:   I use flat-rate Priority Mail envelopes.  He works at the post office.  Every single time, he turns the envelope over and reads the words &quot;flat rate envelope&quot; and he reads them slowly.  He doesn&#39;t recognize the front of the envelope, and can&#39;t read that phrase at a mere glance.  <br/>\n<br/>\nHe&#39;s a nice man, and probably a military veteran, and that&#39;s a bonus for employment at the post office.   But somewhere, somehow, he was taught phonics, and told that was how reading worked, and he&#39;s stuck right there.<br/>\n<br/>\nHad he learned to read in his own way, it might&#39;ve been a few years later, but it wouldn&#39;t be something that seems to slow him down rather than speed him up.<br/>\n<br/>\nHe would have been much better off (though he&#39;s too old for it to have been a childhood option) to have been playing video games than practicing phonics.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] value of computer games","postDate":"1316967075","msgId":63146,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVDRDU3NkQyLURBRUMtNDIxOS04QzgyLUQ1NDc2Q0MxNjcwOEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDQ1MjExMzc2NDBDNzQyQjBCM0U1OTU1MTc4OENBODUzQEVkUEM+","referencesHeader":"PENBRkxLeTMzM0tkZ1IrYjhzZW9LOUpfTm1ELTRyODlrYkN1ZXJoeitRSlA5TXFzXzRjd0BtYWlsLmdtYWlsLmNvbT4gPDI2NTg5MDBCLTY1QzQtNDk2My1CNjg4LUVGQ0Q5ODgxQUM4MkBlYXJ0aGxpbmsubmV0PiA8NDUyMTEzNzY0MEM3NDJCMEIzRTU5NTUxNzg4Q0E4NTNARWRQQz4="},"prevInTopic":63145,"nextInTopic":63147,"prevInTime":63145,"nextInTime":63147,"topicId":63140,"numMessagesInTopic":0,"msgSnippet":"Lisa s response reminded me of Holly and Harvest Moon.  There s reading.  So one of us (me, or Kirby, usually) would be in the room with her to read for her. I","messageBody":"<div id=\"ygrps-yiv-443643912\">Lisa&#39;s response reminded me of Holly and Harvest Moon.  There&#39;s reading.  So one of us (me, or Kirby, usually) would be in the room with her to read for her. I printed out some online charts, and copied some things out of the little flyer, scanned and enlarged, so she could find things in the game, and learn the calendar, and combine things (cooking/kitchen).  We would help her with that, too.  When she wanted to name a farm animal, one of us would write down the name she wanted to use, and she would enter the letters one by one.<br/>\n<br/>\nHolly played through various Harvest Moon games several times.  The logic and decision making are very cool in those games.<br/>\n<br/>\nThere are better resources these days, but the ideas are still valid.<br/>\n<br/>\nLong ago my kids played a game called Treasure Mountain.  Part of the puzzle was a little like a Set game--looking for two of something, or of a pattern.  They would have a goal like two evergreens.  Any two objects was a match, and any evergreens, but two evergreens was the real thing.  (As I remember.)    But they needed to see it in words and images both, so I had hand-written a card that they left near the computer, before they could read.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: value of computer games","postDate":"1316964606","msgId":63145,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo1bmhkdStwYWh1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBRkxLeTMzM0tkZ1IrYjhzZW9LOUpfTm1ELTRyODlrYkN1ZXJoeitRSlA5TXFzXzRjd0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":63144,"nextInTopic":63146,"prevInTime":63144,"nextInTime":63146,"topicId":63140,"numMessagesInTopic":0,"msgSnippet":"... Take it over how? What are you seeing right now? What are the experiences of long term unschooling families where kids play a lot of video and computer","messageBody":"<div id=\"ygrps-yiv-144337158\">Tress Miles &lt;milesdt@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I have this feeling<br/>\n&gt; that I need to limit her time at the computer so it won&#39;t &quot;take over her<br/>\n&gt; brain.&quot; <br/>\n<br/>\n </span></blockquote>Take it over how? What are you seeing right now? What are the experiences of long term unschooling families where kids play a lot of video and computer games? It&#39;s good to ask yourself those kinds of questions so that generalized parenting advice doesn&#39;t &quot;take over&quot; Your brain ;) Or unschooling advice for that matter!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;There is one particular game called Minecraft that involves<br/>\n&gt; building different structures, is very creative and does not involve<br/>\n&gt; winning/losing.  Through reading the prompts on the screen, she seems to be<br/>\n&gt; slowly teaching herself to read.<br/>\n<br/>\n </span></blockquote>That doesn&#39;t sound like a child who is somehow becoming a computer zombie. Are you spending time hanging out with your daughter while she&#39;s playing? That&#39;s a good way to reassure yourself and a good way to connect with her, too. I don&#39;t mean sit with her all day - but hang out now and then, bring her snacks, rub her shoulders if she seems to be getting stiff from a lot of sitting, offer to read things for her if she wants. Get a sense of what she seems to like from the game so you can offer other things if she seems like she needs more - but she may be perfectly happy right now to dive in deep and get all she can from the game. <br/>\n<br/>\nA note about reading - some kids read quite a bit later than others. The time span for &quot;reading readiness&quot; is something like ages 4-16. No kidding! Some people have an instinctive grasp of the concept very early, some learn in a logical sequence usually between ages 7 and 10, while others need a good bit more time to store up lots and lots of little pieces of information until it all comes together. The Most important thing you can do is believe that she Will read when she&#39;s ready and reassure her of the same if she seems to be worried about that. Its actually easier to learn to read later than earlier, provided there aren&#39;t any barriers of shame over &quot;not reading&quot;. <br/>\n<br/>\nAs an added note, people who learn to read in the tweens and teens are more likely to use a strategy other than &quot;sounding out&quot; to learn - so if she&#39;s sounding things out, let her know that many people find it easier just to memorize words. For people who learn by visual cues rather than phonetic cues, &quot;sounding out&quot; can actually prevent them from learning to read because they can&#39;t move information from short term to long term memory.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":143043046,"authorName":"Ed Wendell","from":"&quot;Ed Wendell&quot; &lt;ewendell@...&gt;","profile":"zelco123","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] value of computer games","postDate":"1316963000","msgId":63144,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ1MjExMzc2NDBDNzQyQjBCM0U1OTU1MTc4OENBODUzQEVkUEM+","inReplyToHeader":"PDI2NTg5MDBCLTY1QzQtNDk2My1CNjg4LUVGQ0Q5ODgxQUM4MkBlYXJ0aGxpbmsubmV0Pg==","referencesHeader":"PENBRkxLeTMzM0tkZ1IrYjhzZW9LOUpfTm1ELTRyODlrYkN1ZXJoeitRSlA5TXFzXzRjd0BtYWlsLmdtYWlsLmNvbT4gPDI2NTg5MDBCLTY1QzQtNDk2My1CNjg4LUVGQ0Q5ODgxQUM4MkBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":63142,"nextInTopic":63145,"prevInTime":63143,"nextInTime":63145,"topicId":63140,"numMessagesInTopic":0,"msgSnippet":"When our son (now 17) was around your daughter s age he found an on-line computer game that had a lot of script to it that required reading and writing","messageBody":"<div id=\"ygrps-yiv-2085645655\">When our son (now 17) was around your daughter&#39;s age he found an on-line computer game that had a lot of script to it that required reading and writing (typing).  It sounds a lot like minecraft.  I would sit close enough to him that I could glance up and read something to him if he asked me to or help him spell if he asked me to.  I sat and read or did needle work - now that we have 2 laptops in the house as well as the desktop we could configure things differently but that is what we did then when we had only the desktop.  I was also close enough to connect in various ways as well - physically and conversationally.<br/>\n<br/>\n<br/>\nWhen he got a bit older we got him a device called &quot;Franklin Spelling Ace&quot; so he could look up how to spell words on his own if he wanted.  We also showed him how to cut and paste to check spellings on the internet/Google/Dictionary.com/ etc.  We helped him discover ways to help himself along the way.  But when he was younger (your daughter&#39;s age) we simply offered help.<br/>\n<br/>\nHe also went though a period where he wanted game guides for games and we provided those.  There are sites that provide game guides - sometimes we&#39;d print off more than one if he asked.  Now if he wants a game guide he uses a laptop so we don&#39;t have to print it.<br/>\n<br/>\nGaming: computer, Playstation, Wii, Magic The Gathering, board games have been instrumental in his learning to read - but it evolved over time - years.  <br/>\n<br/>\nGaming led to reading Manga, when he discovered Manga he found another passion involving reading.  <br/>\n<br/>\nEach thing has a connection - kind of like a web where every strand is woven and leads to another connection.  For example: Zac&#39;s love of Manga has led to his carving swords and knives from wood to look like weapons in the books.  He is currently taking a Japanese oral and written language course that he found by going to a Japanese cultural event last spring. He has developed a love of things Japanese - especially the Samurai.  He has books on the fighting techniques of the Samurai (he loves anything to do with war).  Has made Samurai armour for himself & a Samurai costume for a horse (Halloween contest in which he won), etc.<br/>\n<br/>\nEven though he spends a lot of his time gaming, he has various interests and knowledge that have evolved over the years.<br/>\n<br/>\nWe too went out a lot to various things outside the house - museums, festivals, nature centers, etc.  <br/>\n<br/>\nI would say, follow the child and be lovingly patient and helpful.  That has paid off in tremendous ways for our son.<br/>\n<br/>\n<br/>\nLisa W.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] value of computer games","postDate":"1316923731","msgId":63142,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI2NTg5MDBCLTY1QzQtNDk2My1CNjg4LUVGQ0Q5ODgxQUM4MkBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PENBRkxLeTMzM0tkZ1IrYjhzZW9LOUpfTm1ELTRyODlrYkN1ZXJoeitRSlA5TXFzXzRjd0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PENBRkxLeTMzM0tkZ1IrYjhzZW9LOUpfTm1ELTRyODlrYkN1ZXJoeitRSlA5TXFzXzRjd0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":63141,"nextInTopic":63144,"prevInTime":63141,"nextInTime":63143,"topicId":63140,"numMessagesInTopic":0,"msgSnippet":"... Support it and encourage it and help her be able to do it by bring her little plates of finger food. Enhance it by finding things that are related (for","messageBody":"<div id=\"ygrps-yiv-1082798703\">On Sep 24, 2011, at 7:54 PM, Tress Miles wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Can<br/>\n&gt; someone give me some advice/perspective on this? Do I need to limit<br/>\n&gt; computer time?<br/>\n<br/>\n </span></blockquote>Support it and encourage it and help her be able to do it by bring her little plates of finger food. Enhance it by finding things that are related (for example, surprise her next time you&#39;re in the car by putting on the music from Minecraft - google it, it is very very cool stuff).  Help her immerse herself in it as much as she wants. <br/>\n<br/>\nThere are lots of people here whose kids love Minecraft, too. <br/>\n<br/>\nIf you&#39;re really interested in the value of video games, you might want to read an amazing book called, &quot;Reality is Broken,&quot; by Jane McGonigal. <br/>\n<br/>\n-pam<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] value of computer games","postDate":"1316921573","msgId":63141,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZFOUI4NjhGLUM3NjctNDNBRi1CRjQ3LTc1MjVGQUY3RDYwOEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PENBRkxLeTMzM0tkZ1IrYjhzZW9LOUpfTm1ELTRyODlrYkN1ZXJoeitRSlA5TXFzXzRjd0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PENBRkxLeTMzM0tkZ1IrYjhzZW9LOUpfTm1ELTRyODlrYkN1ZXJoeitRSlA5TXFzXzRjd0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":63140,"nextInTopic":63142,"prevInTime":63140,"nextInTime":63142,"topicId":63140,"numMessagesInTopic":0,"msgSnippet":"-=- I read in an unschooling blog that children will spend a lot of time at one activity if they are learning something valuable from it. Can someone give me","messageBody":"<div id=\"ygrps-yiv-793501654\">-=- I read in an unschooling blog that children will spend a lot of<br/>\ntime at one activity if they are learning something valuable from it. Can<br/>\nsomeone give me some advice/perspective on this? -=-<br/>\n<br/>\nI think if kids have choices in what to do, and where, and how, and if they feel safe and supported, they will choose things they&#39;re enjoying, and if they enjoy the things, they will be learning.<br/>\n<br/>\n-=-So basically for the past 3 1/2 years, we have played whatever she wanted to<br/>\nplay, indoors and outdoors, and gone on lots of field trips.-=-<br/>\n<br/>\nFor a clearer understanding of unschooling, it will help not to call them &quot;field trips&quot; (meaning outside of the classroom).   You&#39;re living in the world. You&#39;re going places--real places.  Call it &quot;going out,&quot; &quot;to the museum,&quot; whatever it is, not &quot;field trips.&quot;  Otherwise you&#39;re dividing the world into educational and non-educational, and that will not help you fully relax into unschooling.<br/>\n<br/>\n-=-Through reading the prompts on the screen, she seems to be slowly teaching herself to read. -=-<br/>\n<br/>\nShe&#39;s learning.  Not teaching herself.  It&#39;s an important difference to consider.<br/>\n<br/>\nI hope you&#39;re reading to her when she needs it, and not using the game as a lesson, or pressing her to figure it out.  She WILL learn to read, and better, more easily, and more joyfully without pressure from you or anyone else.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/reading\">http://sandradodd.com/reading</a><br/>\n<br/>\nAll three of mine made great strides from video games or game guides:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/r/threereaders\">http://sandradodd.com/r/threereaders</a><br/>\n<br/>\n-=-Here is my question. I have this feeling that I need to limit her time at the computer so it won&#39;t &quot;take over her<br/>\nbrain.&quot;. . . Do I need to limit computer time?-=-<br/>\n<br/>\nHave you played the game too, yourself?  Or are there other games you&#39;ve played?  <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/videogames/minecraft\">http://sandradodd.com/videogames/minecraft</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/partners/child\">http://sandradodd.com/partners/child</a><br/>\n<br/>\nAbout learning (rather than teaching, or &quot;teaching oneself&quot;):<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/teaching\">http://sandradodd.com/teaching</a><br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":327852347,"authorName":"Tress Miles","from":"Tress Miles &lt;milesdt@...&gt;","profile":"abacaxi7476","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"value of computer games","postDate":"1316919244","msgId":63140,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBRkxLeTMzM0tkZ1IrYjhzZW9LOUpfTm1ELTRyODlrYkN1ZXJoeitRSlA5TXFzXzRjd0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":63141,"prevInTime":63139,"nextInTime":63141,"topicId":63140,"numMessagesInTopic":0,"msgSnippet":"I am new to this group, although I have been unschooling for 3 1/2 years.  I am the single mom of a 9 year old girl adopted internationally at age two with a","messageBody":"<div id=\"ygrps-yiv-475330738\">I am new to this group, although I have been unschooling for 3 1/2 years.  I<br/>\nam the single mom of a 9 year old girl adopted internationally at age two<br/>\nwith a trauma history.  Four and a half years ago I gave up my job, sold my<br/>\nhouse, and we moved in with my elderly widowed father so I could stay home<br/>\nwith dd.  We did try public kindergarten but dd lasted only 7 months.  She<br/>\nwas completely overwhelmed by the school experience.  I have tried<br/>\nhomeschooling, but dd resists any kind of organized &quot;lessons.&quot;  At this<br/>\npoint she can read only simple 3 and 4 letter words and short sentences. She<br/>\nis very bright.   I did have her evaluated by a developmental pediatrician<br/>\nat a teaching hospital in our state to rule out any obvious physical/medical<br/>\nreasons why she isn&#39;t reading at a  higher level..    Our therapist&#39;s theory<br/>\nis that dd has been so preoccupied with coping with the trauma memories that<br/>\nshe has not been able to put much energy into anything else.<br/>\n<br/>\nSo basically for the past 3 1/2 years, we have played whatever she wanted to<br/>\nplay, indoors and outdoors, and gone on lots of field trips.  She has also<br/>\nwatched a lot of TV, videos and DVDs.  She does lots of arts and crafts<br/>\nprojects that she designs herself.  I provide a variety of materials.<br/>\n<br/>\nDD has recently begun spending a LOT of time at online computer games, some<br/>\ndays as much as 7 hours at a stretch with no break except to go to the<br/>\nbathroom.  There is one particular game called Minecraft that involves<br/>\nbuilding different structures, is very creative and does not involve<br/>\nwinning/losing.  Through reading the prompts on the screen, she seems to be<br/>\nslowly teaching herself to read.  Here is my question.  I have this feeling<br/>\nthat I need to limit her time at the computer so it won&#39;t &quot;take over her<br/>\nbrain.&quot;  But I read in an unschooling blog that children will spend a lot of<br/>\ntime at one activity if they are learning something valuable from it.  Can<br/>\nsomeone give me some advice/perspective on this?  Do I need to limit<br/>\ncomputer time?<br/>\n<br/>\nThanks so much,<br/>\nTress, mom to Lillie<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":63090,"nextTopicId":63093}}