{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":78282269,"authorName":"soggyboysmom","from":"&quot;soggyboysmom&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: learning to ease up/unschool","postDate":"1122133936","msgId":107431,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRidHAzZys5aGNxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGNlLjZkMDNlNjk5LjMwMTNhNjU2QGFvbC5jb20+"},"prevInTopic":107430,"nextInTopic":0,"prevInTime":107430,"nextInTime":107432,"topicId":107384,"numMessagesInTopic":0,"msgSnippet":"... I ve been enjoying watching the development of understanding fiction, non-fiction, based on a true story in DS (7). There are even times, like when I m","messageBody":"<div id=\"ygrps-yiv-255798371\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, CelticFrau@a... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;  Sometimes in a movie they&#39;ll ask me  &quot;Is this real/&quot; <br/>\n&gt; and I&#39;ll let them know it&#39;s all pretend, (fiction) or that it&#39;s  <br/>\n&gt;based on a true <br/>\n&gt; story but these are actors totally pretending.<br/>\n&gt;  <br/>\n&gt; Nancy B.<br/>\n&gt; <br/>\n </span></blockquote>I&#39;ve been enjoying watching the development of understanding fiction, <br/>\nnon-fiction, &quot;based on a true story&quot; in DS (7). There are even times, <br/>\nlike when I&#39;m watching a tear jerker movie, that he&#39;ll say &quot;It&#39;s okay, <br/>\nit&#39;s fiction, they&#39;re not really (sad, hurt, whatever)&quot; to comfort me. <br/>\nAnd I explain that even though I know it is fiction, thinking about <br/>\n(whatever) can make me sad.<br/>\n<br/>\n--Deb</div>","specialLinks":[]},{"userId":7527178,"authorName":"CelticFrau@aol.com","from":"CelticFrau@...","profile":"celticfrau","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: learning to ease up/unschool","postDate":"1122126934","msgId":107430,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNlLjZkMDNlNjk5LjMwMTNhNjU2QGFvbC5jb20+"},"prevInTopic":107423,"nextInTopic":107431,"prevInTime":107429,"nextInTime":107431,"topicId":107384,"numMessagesInTopic":0,"msgSnippet":"In a message dated 7/20/2005 6:36:14 PM Eastern Standard Time, dezigna@comcast.net writes: Another  thing that has helped Jayn, is for me to join in playacting","messageBody":"<div id=\"ygrps-yiv-246591387\">In a message dated 7/20/2005 6:36:14 PM Eastern Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dezigna@...\">dezigna@...</a> writes:<br/>\n<br/>\nAnother  thing that has helped Jayn, is for me to join in playacting and<br/>\nfantasy  play about scary situations - games that she has instigated -<br/>\nwithout  negative judgments even if the play seems dark or  macabre.<br/>\n<br/>\n<br/>\n***************************<br/>\nRobyn, that is really cool.  You&#39;re such a good mom! :o)<br/>\n <br/>\nWe have a foster girl (10 years old) who, when she came, seemed to try and  <br/>\n&quot;shock&quot; us by saying she loves movies like Chucky, Friday the 13th, &quot;Freddy  <br/>\nKruger.&quot;  Instead of judging, I just said, &quot;Oh?&quot; and let her talk about  them.  <br/>\nWe&#39;ve watched scary stuff with her, and realized her and another one  of our <br/>\nkids had a hard time telling the difference between real and  pretend.  <br/>\n <br/>\nWe had a long talk about how they make the movies, the make-up, the  <br/>\nsets...we even watched a couple of &quot;making of&quot; movies (phantom of the opera,  etc) so <br/>\nthey could see all the work that goes into making something seem so  real.  <br/>\nWOW...it really helped.  Sometimes in a movie they&#39;ll ask me  &quot;Is this real/&quot; <br/>\nand I&#39;ll let them know it&#39;s all pretend, (fiction) or that it&#39;s  based on a true <br/>\nstory but these are actors totally pretending.<br/>\n <br/>\nNancy B.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2300774,"authorName":"Betsy Hill","from":"Betsy Hill &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] learning to ease up/unschool","postDate":"1122073548","msgId":107423,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyRTE3QkNDLjkwNzA3MDRAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PDZGOUVCNDQ3LjREQzVGNjI1Ljg0RTkxQUE5QG5ldHNjYXBlLm5ldD4=","referencesHeader":"PDZGOUVCNDQ3LjREQzVGNjI1Ljg0RTkxQUE5QG5ldHNjYXBlLm5ldD4="},"prevInTopic":107390,"nextInTopic":107430,"prevInTime":107422,"nextInTime":107424,"topicId":107384,"numMessagesInTopic":0,"msgSnippet":"**He chooses books, workbooks, even no books, whatever he finds interesting.  I have to admit, he chooses a lot of things that I think are too difficult still,","messageBody":"<div id=\"ygrps-yiv-348927879\">**He chooses books, workbooks, even no books, whatever he finds <br/>\ninteresting.  I have to admit, he chooses a lot of things that I think <br/>\nare too difficult still, but he seems quite happy and challenged.**<br/>\n<br/>\nThat&#39;s a useful observation.<br/>\n<br/>\nI&#39;ve been thinking a little bit along these lines.<br/>\n<br/>\nI think when school takes &quot;information&quot; and breaks it down into little <br/>\ntiny pieces, like a few names or some dates, they peel off almost <br/>\neverything that is interesting and the facts that are left are very <br/>\ndull.  More complicated stuff is almost always more interesting.   Maybe <br/>\nit isn&#39;t surprising that a kid would like complicated or &quot;advanced&quot; <br/>\nstuff, as long as he had the freedom to slow down, or stop, or get more <br/>\ninformation when they became confused or frustrated.<br/>\n<br/>\nBetsy</div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [UnschoolingDiscussion] Re: learning to ease up/unschool","postDate":"1121898890","msgId":107390,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PGRibWFtbytsdDU3QGVHcm91cHMuY29tPg=="},"prevInTopic":107388,"nextInTopic":107423,"prevInTime":107389,"nextInTime":107391,"topicId":107384,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-751794135\">&lt;&lt;&lt;&lt;&lt;Also, I might gently suggest that if things like chips were <br/>\navailable (maybe get some of the baked type - less grease/fat), they <br/>\nmight be less likely to scarf them at grandpa&#39;s in such quantities.&gt;&gt;&gt;&gt;<br/>\n<br/>\nsnip<br/>\n<br/>\n&lt;&lt;&lt;&lt;&lt;his dear, precious grandkids, this item can cause (specific, unsafe) <br/>\nissues.&gt;&gt;&gt;&gt;<br/>\n<br/>\nI would take the suggestion even further and, in consultation with the kids<br/>\nfind a chip or chip-like crunchy snack that is not fatty, and buy plenty for<br/>\nhome and enough to send them along when they visit. Include the explanation<br/>\nabout the health issues to grandpa. That way they still get to have the<br/>\nenjoyable communion of watching a movie and snacking together. <br/>\n<br/>\nI&#39;m sorry about the nightmares. Are they watching dvd&#39;s/videos or broadcast<br/>\nprograms? What Jayn always wants is to fast forward through scary moments.<br/>\nIf Grandpa is not amenable to choosing titles that the kids like better<br/>\n(again bring some dvd&#39;s along), although I would be pretty concerned if he<br/>\nwasn&#39;t, then maybe there are some ways you can support them working through<br/>\ntheir fears. Maybe the nightmares are coming from not being allowed to work<br/>\nthrough the emotions fully before sleeping.<br/>\n<br/>\nJayn likes to watch movies over and over, including the ones with scary or<br/>\ndisturbing moments. One idea might be to ask if the kids wish to see the<br/>\nsame thing again with you there, so that you can talk about some of the<br/>\nimages or ideas that are bothering them. Jayn used to fast forward/skip, or<br/>\njust listen with covered eyes, or just watch with the sound down, different<br/>\nparts of films that she can now watch fully without fear. We also have<br/>\ntalked about the tricks of filmmaking, computer generated or miniature<br/>\neffects, and sometimes looked at the &quot;making of&quot; parts of dvd&#39;s - although<br/>\nshe is usually bored pretty fast by those. <br/>\n<br/>\nAnother thing that has helped Jayn, is for me to join in playacting and<br/>\nfantasy play about scary situations - games that she has instigated -<br/>\nwithout negative judgments even if the play seems dark or macabre.<br/>\n<br/>\nRobyn L. Coburn <br/>\n<br/>\n-- <br/>\nNo virus found in this outgoing message.<br/>\nChecked by AVG Anti-Virus.<br/>\nVersion: 7.0.323 / Virus Database: 267.9.2/52 - Release Date: 7/19/2005</div>","specialLinks":[]},{"userId":78282269,"authorName":"soggyboysmom","from":"&quot;soggyboysmom&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: learning to ease up/unschool","postDate":"1121889816","msgId":107388,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRibWFtbytsdDU3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGUwLjE3ZDAyZDExLjMwMGZkYzY0QGFvbC5jb20+"},"prevInTopic":107385,"nextInTopic":107390,"prevInTime":107387,"nextInTime":107389,"topicId":107384,"numMessagesInTopic":0,"msgSnippet":"... on the ... Hey, you said what I was going to say! Glad I checked the rest of the posts first... Also, I might gently suggest that if things like chips","messageBody":"<div id=\"ygrps-yiv-1226546162\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, SandraDodd@a... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; In a message dated 7/20/05 10:39:12 AM, leobellalace@n... writes:<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; &gt; It&#39;s a little tough making sure he has access to the information <br/>\n&gt;he wants <br/>\n&gt; &gt; when he wants it (sometimes a trip to the library has to occur <br/>\n </span></blockquote>on &gt;the <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; following day instead)<br/>\n&gt; &gt; <br/>\n&gt; <br/>\n&gt; Use google!<br/>\n&gt; You don&#39;t need to wait for the library to get him information.<br/>\n&gt;<br/>\n </span></blockquote>Hey, you said what I was going to say! Glad I checked the rest of <br/>\nthe posts first...<br/>\n<br/>\nAlso, I might gently suggest that if things like chips were <br/>\navailable (maybe get some of the baked type - less grease/fat), they <br/>\nmight be less likely to scarf them at grandpa&#39;s in such quantities. <br/>\nI know both my ILs and my family (especially my SIL) have at times <br/>\nbeen caught flat footed when my DS would say no thanks to a sweet <br/>\ntreat - he&#39;s not limited (except by things like budget, sometimes <br/>\nstuff just has to wait for the next grocery trip) so he has no need <br/>\nto go nuts with ice cream or whatever. You don&#39;t specify the food <br/>\nissues so maybe potato chips need to be off limits entirely, in <br/>\nwhich case, grandpa needs to know that these foods are *unsafe* for <br/>\nthe kids, not just the usual &quot;they&#39;re junk food&quot; type message (which <br/>\nis so everywhere that it&#39;s easy to tune out) but reinforce that for <br/>\nhis dear, precious grandkids, this item can cause (specific, unsafe) <br/>\nissues.</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] learning to ease up/unschool","postDate":"1121878628","msgId":107385,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGUwLjE3ZDAyZDExLjMwMGZkYzY0QGFvbC5jb20+"},"prevInTopic":107384,"nextInTopic":107388,"prevInTime":107384,"nextInTime":107386,"topicId":107384,"numMessagesInTopic":0,"msgSnippet":"... Use google! You don t need to wait for the library to get him information. He could send notes to his grumpier grandma with links to websites he s liked,","messageBody":"<div id=\"ygrps-yiv-1758800162\">In a message dated 7/20/05 10:39:12 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:leobellalace@...\">leobellalace@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It&#39;s a little tough making sure he has access to the information he wants <br/>\n&gt; when he wants it (sometimes a trip to the library has to occur on the <br/>\n&gt; following day instead)<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Use google!<br/>\nYou don&#39;t need to wait for the library to get him information.<br/>\n<br/>\nHe could send notes to his grumpier grandma with links to websites he&#39;s <br/>\nliked, too.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":163488104,"authorName":"leobellalace@netscape.net","from":"leobellalace@...","profile":"leobellalace","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"learning to ease up/unschool","postDate":"1121875258","msgId":107384,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZGOUVCNDQ3LjREQzVGNjI1Ljg0RTkxQUE5QG5ldHNjYXBlLm5ldD4="},"prevInTopic":0,"nextInTopic":107385,"prevInTime":107383,"nextInTime":107385,"topicId":107384,"numMessagesInTopic":0,"msgSnippet":"I usually just read the messages but this morning felt I had to post. I was not raised in an unschool environment in the least, so the concept of unforced","messageBody":"<div id=\"ygrps-yiv-1268146997\">I usually just read the messages but this morning felt I had to post.<br/>\n<br/>\nI was not raised in an unschool environment in the least, so the concept of unforced learning was shocking, but welcome.  (It did take a bit to stop looking quite so wide-eyed at the thought.)  School and &quot;fitting in&quot; were really pushed when I was younger - Unfortunately I rarely fit in, didn&#39;t know how and was furious that I had to act like someone else to have &quot;friends.&quot;  Of course, insecurity and shyness played a big part, but I do have one redeeming (???) quality - Instantaneous Rebellion...  I have a smart mouth, I loathe taking orders (especially frivolous ones) and I can rebel in the wink of an eye.  Hence, if I put a little effort into it, I can usually &quot;tick off&quot; a person in a short amount of time.  LOL!  (It is fairly recent that I **TRULY** realized, &quot;Who honestly wants to be a carbon copy of every neighbor they have?  What is so wrong with *not* being exactly like everyone else?&quot;)<br/>\n<br/>\nI also absolutely HATED school for the most part and my fondest wish was to land on a deserted island somewhere with a ton of books and an open grocery store (well, and horses, in spades!)  I love to read, always have, since I was 3 or 4.  I am constantly going after books and getting sidetracked researching something that has caught my interest.<br/>\n<br/>\nMy boys are still fairly young but seem to be following the same path of curiosity, although they are more social than I was (maybe they get that from their father?)  We are pretty relaxed; I don&#39;t push them very often with their studies, usually only when I am nervous about an upcoming possible conflict with a family member over education decisions - my ex-MIL is a teacher and principal who &quot;wants&quot; him back in school this fall.  (Having only started this past spring, confrontation over this is nerve-racking at best.)  My mother, on the other hand, is a rock and has even said that homeschooling would probably have been a *much* better situation for me.  (I agreed, by the way. LOL)  <br/>\n<br/>\nWith my son, I am not a true unschooler.  I probably will never be, due to the need to avoid custody complaints, but I have probably moved more toward unschooling than anything else.  I would say it was laziness on my part since I won&#39;t put the day&#39;s activities on a little sheet and check them off as I go, but my son really likes learning, just on his own terms - he just swallows information.  It&#39;s a little tough making sure he has access to the information he wants when he wants it (sometimes a trip to the library has to occur on the following day instead) but otherwise it is going swimmingly.  He just wants to do it on his own time and in his own way.  He doesn&#39;t want any instructions, etc.  He says that he can read the directions and that he will ask if he has any questions.  Surprisingly enough, he manages his time much better than when I &quot;scheduled&quot; his activities.  So...  he works at his own pace, skips the busy work and moves to the next level.  If he has problems, which happily is a rare occurance, we go back and &quot;fix&quot; the hole.  He chooses books, workbooks, even no books, whatever he finds interesting.  I have to admit, he chooses a lot of things that I think are too difficult still, but he seems quite happy and challenged.  When he has picked something too hard, he wrinkles his nose, comments to me and puts it away.  Sometimes he gets something else immediately, sometimes he plays for a while, but I have yet to see him not go back to that item at some point.  It&#39;s like he is testing himself against that particular thing, and when it is no longer frustratingly difficult, he picks it back up.<br/>\n<br/>\nHe is quite good choosing his snacks as well.  There are some health concerns which partially limit what can be in the house, but for the most part the boys will choose healthy snacks.  We do have a problem at the grandparents&#39; home, but the eating habits there are extremely poor, resulting in barely-managed diabetes, obesity, digestive problems and (probably) heart issues.  Unfortunately those habits are being picked up by the younger two and steering them toward a snack that won&#39;t make them ill later is becoming increasingly complex.  I can ensure there are good choices available, but sitting with grandpa &quot;vegging out&quot; on TV and inappropriate movies (nightmares) and scarfing down an entire bag of potato chips is becoming all too common.  The fact that the kid wakes up screaming from nightmares most nights and diahrrea from the grease/oil in the chips doesn&#39;t seem to make an impression.  The little ones are 1 and 3, by the way, so they don&#39;t understand why they are sick for hours after they eat.  (It would be extremely difficult to keep the kids away from that house as their father lives with his parents.)<br/>\n<br/>\nAre there any suggestions for dealing with the respective grandparents on either the education or health issues?<br/>\n<br/>\n__________________________________________________________________<br/>\nSwitch to Netscape Internet Service.<br/>\nAs low as $9.95 a month -- Sign up today at <a rel=\"nofollow\" target=\"_blank\" href=\"http://isp.netscape.com/register\">http://isp.netscape.com/register</a><br/>\n<br/>\nNetscape. Just the Net You Need.<br/>\n<br/>\nNew! Netscape Toolbar for Internet Explorer<br/>\nSearch from anywhere on the Web and block those annoying pop-ups.<br/>\nDownload now at <a rel=\"nofollow\" target=\"_blank\" href=\"http://channels.netscape.com/ns/search/install.jsp\">http://channels.netscape.com/ns/search/install.jsp</a></div>","specialLinks":[]}],"prevTopicId":107347,"nextTopicId":107366}}