{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"mrstar","from":"&quot;mrstar&quot; &lt;mrstar@...&gt;","replyTo":"LIST","senderId":"77otl7jD1jSJimnSApmWo60WOTG-mAGHliu7p5qQuHf9KbF__1-7oMLeaVncVT1bMm2pQHQoK5dWKm1fn1RZbn2JQl4","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Unschooling others/was Returning to public school","postDate":"935424488","msgId":2224,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4xNjcuMjIyNC45NTkyNjk3NDFAZUdyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":2223,"nextInTime":2225,"topicId":2224,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1482305294\">&lt;&lt;&lt;Now, there&#39;s a thought -- I wonder, have any of you unschooled or are any<br/>\nof<br/>\nyou unschooling any children who are not your own?  How did it come about?<br/>\nWould you do it again?<br/>\n<br/>\nCandice in OK&gt;&gt;&gt;<br/>\n<br/>\nI am starting out that way Candice. I am (an plan to continue to)<br/>\nunschooling my 3 children, my stepdaughter and her sister. My stepdaughter<br/>\nis 5 and her sister is 2. I have them full time and their mother tells<br/>\neveryone that I am unschooling them. She is very happy with the situation as<br/>\nit takes the burden of responsibility of off her shoulders. She is a young<br/>\nsingle mom with 2 kids from two different fathers, the other father is<br/>\ntotally not involved and has no plans of getting involved ever.  She works<br/>\nfull time and is going to school part time. She has said time and time again<br/>\n&quot;I could never stay home all day with the kids, I don&#39;t know how you do it<br/>\nbut I am glad you do.&quot; She even has plans to sign papers that would grant us<br/>\nguardianship over the little girl in the even that something happens to her<br/>\n(mom). It all started before the younger child was conceived. I managed to<br/>\nmake friends with my husbands ex when their daughter had just turned 2 and<br/>\nour youngest had just been born. Up to that point they had not gotten along<br/>\nvery well and we had seen very little of their daughter. At the point where<br/>\nthe ex and I made friends we made fast friends. She is exactly 6 years<br/>\nyounger than me (my dh is 5 yrs younger than me and they were highschool<br/>\nsweethearts.) and she tends to look to me for advice on just about<br/>\neverything imaginable. It is really neat, her and I have allot in common in<br/>\nour beliefs and perspectives, the difference between us is our attitudes.<br/>\nShe has followed me into unschooling, eating a healthy, chemical free diet.<br/>\nShe is learning from me and I am learning because of her. It is a good<br/>\nrelationship. So, I unschool and co-parent her children, we don&#39;t have to<br/>\npay child support, dh gets to see his daughter as much as he wants, we get<br/>\nan extra daughter most of the time with out most of the added expense but<br/>\nall the love and the ex gladly comes over a few times a month and stays with<br/>\nthe kids so that we can go out. We don&#39;t believe in sitters but she is like<br/>\nfamily (is family) so she doesn&#39;t count. We plan on continuing the<br/>\narrangement indefinitely. She feels the same as we do about schools so there<br/>\nis no worry that she will decide either of them should be sent to ps. Of<br/>\ncourse, no situation is ideal. She is very immature and self-centered and<br/>\ntalks way too loudly but I have known far worse situations with exs so I am<br/>\nnot complaining. Anyway, you asked, yes I unschool other peoples children.<br/>\nThey aren&#39;t school age but they will still be here when they are. Any<br/>\nquestions?<br/>\n<br/>\nMary in Idaho (who doesn&#39;t have a sane bone in her body)</div>","specialLinks":[]}],"prevTopicId":2200,"nextTopicId":2162}}