{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Corpse Flower live webcam","postDate":"1089119233","msgId":96065,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGI3LjQyODUyM2RjLjJlMWJmZTAxQGFvbC5jb20+"},"prevInTopic":96064,"nextInTopic":0,"prevInTime":96064,"nextInTime":96066,"topicId":96064,"numMessagesInTopic":0,"msgSnippet":"In a message dated 7/6/04 5:22:43 AM, fetteroll@earthlink.net writes:  I had read about those","messageBody":"<div id=\"ygrps-yiv-815541692\">In a message dated 7/6/04 5:22:43 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a> writes:<br/>\n<br/>\n&lt;&lt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://florawww.eeb.uconn.edu/Titanum/Titanum2004.html\">http://florawww.eeb.uconn.edu/Titanum/Titanum2004.html</a> &gt;&gt;<br/>\n<br/>\nI had read about those before.<br/>\n<br/>\nWeb cams are pretty wonderful.  Weird, but wonderful. &lt;g&gt;<br/>\n<br/>\nIn some towns in Germany and northern Italy (maybe all over there) they have <br/>\nsome public ones and people tell their friends and relatives what time they&#39;ll <br/>\nbe there to wave hi from that location.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Corpse Flower live webcam","postDate":"1089112084","msgId":96064,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJEMTAwMDU0LjI4QzcwJWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDIwMDQwNjI4MDIyNi5pNVMyUXJRRjA5OTgzN0Bwcm94eTEuYWRkci5jb20+"},"prevInTopic":0,"nextInTopic":96065,"prevInTime":96063,"nextInTime":96065,"topicId":96064,"numMessagesInTopic":0,"msgSnippet":"Apparently the corpse flower only blooms once every 75 years and then only for a few days. There s a webcam on one at the University of Connecticut. Apparently","messageBody":"<div id=\"ygrps-yiv-1247699624\">Apparently the corpse flower only blooms once every 75 years and then only<br/>\nfor a few days.<br/>\n<br/>\nThere&#39;s a webcam on one at the University of Connecticut. Apparently its<br/>\nblooming is imminent!<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.news.uconn.edu/2004/jun2004/rel04065.htm\">http://www.news.uconn.edu/2004/jun2004/rel04065.htm</a><br/>\n<br/>\nHere&#39;s the article from the webpage:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; STORRS, Conn.  Within the next few weeks, New Englanders will have the<br/>\n&gt; opportunity to see and smell one of the strangest productions of the vegetable<br/>\n&gt; kingdom: the titan arum, or corpse flower, which features a gigantic bloom <br/>\n&gt; and a mighty stench -- is expected to open sometime near the end of June, at<br/>\n&gt; the University of Connecticut&#39;s Department of Ecology and Evolutionary Biology<br/>\n&gt; Conservatory. Live Webcam<br/>\n&gt; <br/>\n&gt; The last time a corpse flower opened in the northeast was in the 1930s, at the<br/>\n&gt; New York Botanical Garden. Fewer than two-dozen have flowered in the United<br/>\n&gt; States since the titan arum bloomed for the first time in cultivation, at the<br/>\n&gt; Royal Botanic Gardens in Kew, England, in 1889.<br/>\n&gt; <br/>\n&gt; Currently, the UConn-based flower bud is more than three feet high and growing<br/>\n&gt; by several inches each day. Clint Morse, plant growth facilities manager and<br/>\n&gt; the researcher who obtained and planted the titan arum, is estimating the<br/>\n&gt; plant will flower between June 28 and July 2. He emphasizes, however, that<br/>\n&gt; those dates only represent his best guess.<br/>\n&gt; <br/>\n&gt; The fully open flower lasts only a few days, so visitors hoping to catch it at<br/>\n&gt; its peak will have to time their visit carefully. The infamous odor of the<br/>\n&gt; corpse flower is strongest just as the flower opens, becoming faint, for<br/>\n&gt; better or worse, after the first day. Already, gardeners, botanists and<br/>\n&gt; curiosity-seekers from across the northeast and beyond are making plans to<br/>\n&gt; travel to Storrs to experience the horticultural equivalent of twin NCAA<br/>\n&gt; basketball championships.<br/>\n&gt; <br/>\n&gt; The titan arum (Amorphophallus titanum) is a native of the sultry equatorial<br/>\n&gt; rainforests of the Indonesian island of Sumatra, where it is known as bunga<br/>\n&gt; bangkai, the corpse flower. Plants grow from a potato-like underground tuber,<br/>\n&gt; which produces umbrella-shaped leaves 10 feet high and 15 feet across. Only a<br/>\n&gt; single leaf is present at any one time, but it is dissected into many smaller<br/>\n&gt; leaflets. The whole looks something like a palm tree with a spotted green<br/>\n&gt; trunk, and is rather attractive. A leaf can last for several years before it<br/>\n&gt; withers and is replaced, all the time quietly capturing sunlight and storing<br/>\n&gt; food in the tuber. Eventually, after the tuber has grown to weigh as much as<br/>\n&gt; an average man, the corpse flower decides to bloom. The bud on the UConn plant<br/>\n&gt; could grow to more than six-feet-tall before it opens.<br/>\n&gt; <br/>\n&gt; Corpse flowers bloom directly from their tubers, in between cycles of leaf<br/>\n&gt; production (like an amaryllis). Flowers are about 6 feet high and 3 feet<br/>\n&gt; across, shaped like an urn, with a tall spike rising from the center.<br/>\n&gt; (Technically, this is a composite of many small flowers, but it looks like one<br/>\n&gt; gigantic flower.) They are similar in shape to the flowers of local woodland<br/>\n&gt; plants like jack-in-the-pulpit and skunk cabbage, or to calla lilies, all of<br/>\n&gt; which are distant relatives.<br/>\n&gt; <br/>\n&gt; The corpse flower is specifically adapted to attract carrion flies and<br/>\n&gt; beetles, which ferry pollen between plants so they can produce seed, a job<br/>\n&gt; accomplished for more ordinary plants by bees or butterflies. The colors of<br/>\n&gt; the corpse flower  a sickly yellow and blackish purple -- imitate a pot roast<br/>\n&gt; that sat out in the sun for a week. The fragrance is universally described as<br/>\n&gt; being powerful and revolting, with elements of old socks, dead fish and rotten<br/>\n&gt; vegetables. As if that isn&#39;t weird enough, the corpse flower is actually<br/>\n&gt; warm-blooded, heating itself up at the height of flowering, probably to help<br/>\n&gt; spread its putrid odor. All of this is totally irresistible to flies, who must<br/>\n&gt; think they&#39;ve chanced upon a dead elephant, and are tricked into pollinating<br/>\n&gt; the plant. <br/>\n&gt; <br/>\n&gt; The corpse flower is uncommon and difficult to locate in the wilds of Sumatra,<br/>\n&gt; and very rare in cultivation. Recent greenhouse flowerings in California,<br/>\n&gt; Washington, D.C., and London have attracted coverage from the international<br/>\n&gt; media, and thousands of visitors who braved longlines and foul odors for a<br/>\n&gt; glimpse of this botanical marvel. The UConn bloom will be the first ever in<br/>\n&gt; New England, and the only one anywhere in the northeast since the New York<br/>\n&gt; Botanical Gardens had a specimen in the 1930s. That earlier flowering inspired<br/>\n&gt; the designation of Amorphophallus titanum as the official flower of the Bronx,<br/>\n&gt; a title that was maintained until quite recently, when a more innocuous form<br/>\n&gt; of vegetation was chosen to replace it.<br/>\n&gt; <br/>\n&gt; The Connecticut corpse flower was started 10 years ago, from a seed the size<br/>\n&gt; of a lima bean, donated to UConn by botanical explorer James Symon. Since<br/>\n&gt; then, the plant has been nurtured in an environment of bright light, high<br/>\n&gt; humidity, and constant warmth. It also receives plenty of food, in the form of<br/>\n&gt; plain houseplant fertilizer. It is not carnivorous, as some people suppose.<br/>\n&gt; Only now, after growing a tuber that is splitting the sides of a pot bigger<br/>\n&gt; than a garbage can, has the plant stored enough resources to bloom. Readers<br/>\n&gt; may check the progress of the flower bud in person at the Department of<br/>\n&gt; Ecology and Evolutionary Biology&#39;s Conservatory, located behind the Torrey<br/>\n&gt; Life Sciences Building on North Eagleville Road, or on the web at:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://florawww.eeb.uconn.edu/Titanum/Titanum2004.html\">http://florawww.eeb.uconn.edu/Titanum/Titanum2004.html</a><br/>\n&gt; <br/>\n&gt; It tends to be warm in the greenhouse, so bring water and light clothing.<br/>\n&gt; Admission is free.<br/>\n&gt; <br/>\n&gt; About the University of Connecticut Ecology and Evolutionary Biology<br/>\n&gt; Conservatory <br/>\n&gt; <br/>\n&gt; The UConn EEB Conservatory is the finest collection of exotic plants under<br/>\n&gt; glass between New York and Montreal, with outstanding displays of orchids,<br/>\n&gt; cacti and succulents, carnivorous plants, tropical ferns, and many other<br/>\n&gt; groups. The collections are used for classes, public outreach, and research<br/>\n&gt; into plant biology and conservation.<br/>\n&gt; <br/>\n&gt; The Conservatory is open to the public from 8 a.m.-4 p.m. weekdays. While the<br/>\n&gt; corpse flower is open, the Conservatory will be open from 8 a.m.-8 p.m., daily<br/>\n&gt; and on weekends. [Update]<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Joyce</div>","specialLinks":[]}],"prevTopicId":96035,"nextTopicId":96031}}