{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":0,"authorName":"Billy or Nancy","from":"&quot;Billy or Nancy&quot; &lt;FUNLists@...&gt;","replyTo":"LIST","senderId":"GlTj7uWbtH0Byw5-buCP3OVJwiyWZOeRh9lzKUthfHRzb3CiHikuMKMy2zU0j18IpBffWbuBZnue2ZfyLs9dyQbzp-upyF63GewH7J4","spamInfo":{"isSpam":false,"reason":"0"},"subject":"New John Taylor Gatto book!","postDate":"962923708","msgId":10734,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDkwMWJmZTc5YyQ1ODQzOGU0MCRiY2VhNGUwY0BiaWxseT4=","inReplyToHeader":"PDM5NTI2RkM3LjE2MDMzODhBQGhvbWUuY29tPg=="},"prevInTopic":9622,"nextInTopic":0,"prevInTime":10733,"nextInTime":10735,"topicId":9622,"numMessagesInTopic":0,"msgSnippet":"We got our first shipment in today! The Underground History of American Education by John Taylor Gatto: A Schoolteachers Intimate Investigation Into the","messageBody":"<div id=\"ygrps-yiv-412116402\">We got our first shipment in today!<br/>\n<br/>\nThe Underground History of American Education by John Taylor Gatto: A<br/>\nSchoolteachers Intimate Investigation Into the Problem of Modern Schooling<br/>\n<br/>\nOur favorite radical education theorist has done it again! Seven years in<br/>\nthe making, over 300,000 words and 412 pages with an extensive index - this<br/>\nis definitely not a fluff book. John Taylor Gatto is a former New York<br/>\nCity and New York State Teacher of the year. Author of Dumbing Us Down,<br/>\nGatto is an advocate of homeschooling.<br/>\n<br/>\nWhat do the Prussian military, coal mining companies, the industrial<br/>\nrevolution, and the principles of scientific management have in common?<br/>\nAccording to Gatto, they forever changed our early educational practices and<br/>\ncontributed to the creation of our modern American school system, and that<br/>\nis definitely not a good thing!<br/>\n<br/>\nGeorge Washington, with no schooling until he was eleven (and then only two<br/>\nyears of school) could handle geometry and trigonometry that would challenge<br/>\nmany college students today. He became the architect of his own estate and<br/>\nstarted several successful businesses as a young man. Gatto tells us that<br/>\ntoday, No public school in the United States is set up to allow a George<br/>\nWashington to happen. Washingtons in the bud stage are screened, browbeaten,<br/>\nor bribed to conform to a narrow outlook on social truth. Boys like Andrew<br/>\nCarnegie who begged his mother not to send him to school and was well on his<br/>\nway to immortality and fortune at the age of thirteen would be referred<br/>\ntoday for psychological counseling; Thomas Edison would find himself in<br/>\nSpecial Ed until his peculiar genius had been tamed.<br/>\n<br/>\nAt times scholarly, at times stream-of-consciousness, and at times<br/>\npassionate cheerleading, this is a book that will challenge many of your<br/>\nideas about education while at the same time confirming many of your<br/>\nsuspicions. I can assure you that as you read this book you may at times<br/>\nfind yourself exclaiming out loud in agreement with what you read, or<br/>\nmuttering disagreements under your breath, but you definitely wont find<br/>\nyourself bored.<br/>\n<br/>\nThis is an Authors Special Pre-publication Edition. The market first<br/>\nedition will not be released until January 31, 2001, so get these while they<br/>\nlast! List price is $30, available from FUN Books for $24, item #0040X<br/>\n<br/>\nwww.FUN-Books.com<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fun@...\">fun@...</a><br/>\n888 386-7020<br/>\n<br/>\n(Feel free to distribute this review as you see fit as long as it is used in<br/>\nits entirety)<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; -----Original Message-----<br/>\n&gt;<br/>\n&gt; Award winning teacher launches new salvo against government schooling<br/>\n&gt; The Underground History of American Education<br/>\n&gt; A Schoolteacher&#39;s Intimate Investigation into the Problem of Modern<br/>\n&gt; Schooling<br/>\n&gt; by John Taylor Gatto<br/>\n&gt; (Oxford Village Press, 2000) </span></blockquote></div>","specialLinks":[]},{"userId":0,"authorName":"Sandra","from":"Sandra &lt;hearthome@...&gt;","replyTo":"LIST","senderId":"rGfDEX-KrLPNx2U9D7vCKknrQsXXpJ5CjfV-d1Ys_G7oyWlokdy73tbCk3SxwwYTzFgDu_CyBescr1BfE0Z6UvR4","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] new book coming out!","postDate":"961703880","msgId":9622,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM5NTI2RkM3LjE2MDMzODhBQGhvbWUuY29tPg==","referencesHeader":"PDk2MTYyNDk4Mi4xNTQ3OUBlZ3JvdXBzLmNvbT4="},"prevInTopic":0,"nextInTopic":10734,"prevInTime":9621,"nextInTime":9623,"topicId":9622,"numMessagesInTopic":0,"msgSnippet":"Wow, check this out.  It was sent to me from another loop. Sandi in VA http://www.laissezfaire.org/ed8194.cfm#TOP This book is not yet in stock. We will be","messageBody":"<div id=\"ygrps-yiv-1308917161\">Wow, check this out.  It was sent to me from another loop.<br/>\n<br/>\nSandi in VA<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.laissezfaire.org/ed8194.cfm#TOP\">http://www.laissezfaire.org/ed8194.cfm#TOP</a><br/>\n  This book is not yet in stock.<br/>\nWe will be happy to backorder it for you.<br/>\n<br/>\nAward winning teacher launches new salvo against government schooling<br/>\nThe Underground History of American Education<br/>\nA Schoolteacher&#39;s Intimate Investigation into the Problem of Modern<br/>\nSchooling<br/>\nby John Taylor Gatto<br/>\n(Oxford Village Press, 2000)<br/>\n<br/>\n   ED8194W (paperback) 448p.  List Price: $30.00<br/>\nOur Price: $21.00 You save 30%!<br/>\nBookclub members take an additional 10% off!<br/>\n----------------------------------------------------------------------------<br/>\n----<br/>\nreviewed by Jim Powell<br/>\n<br/>\nGatto, the fabled New York City Teacher of the Year who made headlines when<br/>\nhe turned against government schooling, reminds the historically minded of<br/>\nWilliam Lloyd Garrison with his slashing moral attacks against government<br/>\nschooling.<br/>\n<br/>\nHe denounces it &quot;as a gigantic indoctrination and sorting machine, robbing<br/>\npeople of their children. . . . You aren&#39;t compelled to loan your car to<br/>\nanyone who wants it, but you are compelled to surrender your school age<br/>\nchild to strangers who process children.&quot;<br/>\n<br/>\n&quot;Government schooling kills the family by monopolizing the best times of<br/>\nchildhood and by teaching disrespect for home and parents.&quot; He exposes the<br/>\nerrors of &quot;short-answer tests, bells, uniform time blocks, age grading,<br/>\nstandardization, and all the rest of the school religion.&quot; Schools, he says,<br/>\n&quot;don&#39;t need more money or a longer year, they need free-market choices,<br/>\nvariety that speaks to every need.&quot;<br/>\n<br/>\nThis book is brilliant. When I finished it I felt like I&#39;d just gone fifteen<br/>\nrounds with me champ. This book is unlike any other, for my money the best<br/>\napproach to an understanding of the mythology of public education in America<br/>\naround.<br/>\n--Chris Mercogliano, Director, The Albany Free School<br/>\n<br/>\nGatto&#39;s voice is strong and unique, a Socrates of the educational world.<br/>\nDon&#39;t deny yourself the blood-curdling pleasure of reading this perverse<br/>\nhistory of American education as a design for a real life. I loved this<br/>\nbook!<br/>\n--Thomas Moore, author of Care of the Soul<br/>\n<br/>\nI&#39;ve loved John Gatto&#39;s work ever since I first encountered his astounding<br/>\nessays in The Rerun. This analysis of schooling is presented with daring,<br/>\npanache, and a humorous passion that leaps off the page. I give this book a<br/>\nstanding ovation! Bravo!<br/>\n--Christiane Northrup, M.D., author of Women&#39;s Bodies, Women&#39;s Wisdom<br/>\n<br/>\nThe emotional effect of Underground History cannot be overstated. It reminds<br/>\nme of the reporter watching the Hindenburg burst into flames who cried, &quot;Oh,<br/>\nthe humanity!&quot; Gatto is crying here, &quot;Oh, the Children!&quot; This is the most<br/>\nimportant education book of my lifetime.<br/>\n--Michael Farris, President, Home School Legal Defense Association<br/>\n<br/>\nThese pages burn with insight and controversy. You cannot read this book<br/>\nwithout changing the way you look at schools.<br/>\n--Pat Farenga, President, John Holt Associates<br/>\n<br/>\nAnyone interested in the fate of our schools should make this book a<br/>\npriority. Gatto&#39;s insistence on calling a spade a spade in recognizing the<br/>\nbases on which modern schooling has been built leaves no doubt that our<br/>\nwell-being requires us to leave behind the concept of institutional<br/>\neducation as a social good.<br/>\n--Dan Greenberg, co-founder, The Sudbury Valley School<br/>\n<br/>\nGatto tells us straight up what&#39;s wrong with school in his powerful<br/>\ntrademark blend of passion and hard thinking. Grounded in a careful study of<br/>\nhistory, craned out of the context of his own brilliant 30-year teaching<br/>\ncareer, this book will validate your own shadowy intuition about schooling.<br/>\n--Grace Llewelyn, author of The Teenage Liberation Handbook<br/>\n<br/>\nHe paints a scathing picture of caring people&#39;s best intentions undermined.<br/>\n. . . examines the psychology, economics, sociology, anthropology, and<br/>\npolitics of modern institutionalized forced schooling, concluding it cannot<br/>\nbe reformed because it is doing exactly what it is designed to do. Don&#39;t<br/>\nmiss this inspiring rebel educator.<br/>\n--The Open Center, New York City<br/>\n<br/>\nI can honestly say there are few things I&#39;ve read recently, or probably<br/>\never, that provoked me to exclaim &quot;This is so RIGHT!&quot; with such alarming<br/>\nregularity.<br/>\n--Chersteen Anderson, Director, Sisters Under the Skin<br/>\n<br/>\nThought-provoking, entertaining, and intelligent. Based on years of reading<br/>\neducation books I was expecting a drowsy read of little or no content. Was I<br/>\nsurprised! Wonderful.<br/>\n--Judith Current, Teacher, Colorado<br/>\n<br/>\nIn my opinion this is one of the most important books on education ever<br/>\nwritten. Gatto takes us on a journey, tracing the development of his own<br/>\nthinking about government schooling. Here is the whole story, the hidden<br/>\nagendas, the true believers, the dumbing down. If you care at all about<br/>\nchildren, you&#39;ll be livid as you read.<br/>\n--Cathy Duly, THE LINK<br/>\n<br/>\nA breathtaking work of scholarship and encyclopedic scope . . . history<br/>\naccompanied by an incisive and illuminating narrative. Gatto delivers for<br/>\nour consideration an astonishing cast of cranks while revealing the nest of<br/>\nspecial interests which profit from schools just as they are. This marvelous<br/>\nbook should be required reading for anyone interested in the frightening<br/>\ntruth about the enterprise we call &quot;education.&quot;<br/>\n--Adam Robinson, author, What Smart Students Know<br/>\n<br/>\nGatto addresses the deadening heart of compulsory schooling with its<br/>\nassumptions and structures which stamp out the self-knowledge, curiosity,<br/>\nconcentration, and solitude which are essential to learning. He speaks of<br/>\nthe contradiction between human purpose and abstract state purpose, giving<br/>\nexamples of what can happen when the everyday genius of ordinary people is<br/>\nallowed to develop.<br/>\n--Human Scale Education Annual Conference, London<br/>\n<br/>\nThe most important book on education I have ever read. It will open your<br/>\neyes and, God willing, change your children&#39;s lives.<br/>\n--Mary Pride, author, The Big Book of Home Learning</div>","specialLinks":[]}],"prevTopicId":10678,"nextTopicId":10739}}