{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"David Albert","from":"David Albert &lt;shantinik@...","replyTo":"LIST","senderId":"hWsJR2wiiovuByFPIQzbSfT8ct4FReM3WRyah7ZBfGaYPJDn7WMEIj2ILR7hLBQRRVNFZG0L1A_xcgq02jHrXsXcCBkQAxH4rtyRah8","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Deschooling and Religion (long)","postDate":"937006751","msgId":2875,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4yMDEuMjg3NS45NTkyNjk3NDJAZUdyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":2874,"nextInTime":2876,"topicId":2875,"numMessagesInTopic":0,"msgSnippet":"... I hope you ll permit the long answer to this question, but it is one ... We also believe that there is a piece of the divine -- the divine spark or the","messageBody":"<div id=\"ygrps-yiv-953722206\">Joel Hawthorne wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; From: Joel Hawthorne &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jhawthorne@...\">jhawthorne@...</a>&gt;<br/>\n&gt;<br/>\n&gt; I wonder if the difficulty some folks have with their kids<br/>\n&gt; &quot;deschooling&quot; may be<br/>\n&gt; related to matters of religious belief.  Now I have some trepidation<br/>\n&gt; in bringing<br/>\n&gt; this up and I want to do it in a diplomatic and respectful way.<br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>I hope you&#39;ll permit the long answer to this question, but it is one<br/>\nabout which I have thought long and hard:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;    There is no question in my mind that my religious persuasion deeply<br/>\n&gt; informs our approach to homeschooling.  As Friends (Quakers), we<br/>\n&gt; believe firmly in &quot;continuing revelation&quot;, the reality that the divine<br/>\n&gt; can reveal itself to us at any time, in the oddest of moments, in the<br/>\n&gt; strangest of places, with no necessary relationship to our desserts,<br/>\n&gt; and that this revelation can have enduring transformative value for<br/>\n&gt; our lives.  And, in my experience, children are more clearly attuned<br/>\n&gt; to this possibility (even if they would never use the heavy language<br/>\n&gt; to express it.)  Our educational approach is much about seizing the<br/>\n&gt; moment, listening for and cultivating the creative spark (the fountain<br/>\n&gt; which flows from the divine), and allowing for transformations to<br/>\n&gt; occur in ways we never would have expected.<br/>\n<br/>\n </span></blockquote>We also believe that there is a piece of the divine -- the divine spark<br/>\nor the inner light -- in each living soul, and that we must do it<br/>\nsuitable homage.  The testimony of the 18th century Quaker abolitionist<br/>\nJohn Woolman (which I include in my forthcoming homeschooling book) is<br/>\nprobably the best statement I know of this principle:<br/>\n<br/>\n &quot;I...was early convinced in my mind that true religion consisted in an<br/>\ninward life, wherein the heart doth reverence God the Creator and learns<br/>\nto exercise true justice and goodness, not only toward all men but also<br/>\ntoward the brute creatures;  that as the mind was moved on an inward<br/>\nprinciple to love God as an invisible, incomprehensible being, on the<br/>\nsame principle it was moved to love him in all his manifestations in the<br/>\nvisible world; that as by his breath the flame of life was kindled in<br/>\nall animal and sensitive creatures, to say we love God as unseen and at<br/>\nthe same time exercise cruelty toward the least creature moving by his<br/>\nlife, or by life derived from him, was a contradiction in itself...<br/>\n<br/>\n There is a principle which is pure, placed in the human mind, which in<br/>\ndifferent places and ages hath had different names; it is, however,<br/>\npure, and proceeds from God.  It is deep, and inward, confined to no<br/>\nforms of religion, nor excluded from any, where the heart stands in<br/>\nperfect sincerity.  In whomsoever this takes root and grows, of what<br/>\nnation soever, they become brethren.&quot;<br/>\n<br/>\n It is from this belief that Friends&#39; pacifism and commitment to<br/>\ncommunity service flows.  We also hold testimonies about the importance<br/>\nof simplicity and community which we hope will inform our daily living,<br/>\nlearning included.<br/>\n<br/>\n Deschooling?  Here&#39;s what William Penn, the founder of the &quot;Holy<br/>\nExperiment&quot; which became the Commonwealth of Pennsylvania, had to say<br/>\nabout education in 1693:<br/>\n<br/>\n  &quot;The first Thing obvious to Children is what is sensible; and that we<br/>\nmake no Part of their Rudiments.  We press their Memory too soon, and<br/>\npuzzle, strain, and load them with Words and Rules; to know Grammer and<br/>\nRhetorick, and a strange Tongue or two, that is ten to one may never be<br/>\nuseful to them; Leaving their natural Genius to Mechanical and Physical,<br/>\nor natural Knowledge uncultivated and neglected; which would be of<br/>\nexceeding Use and Pleasure to them through the whole Course of their<br/>\nLife...<br/>\n<br/>\n It were Happy if we studied Nature more in natural Things; and acted<br/>\naccording to Nature; whose rules are few, plain and most reasonable.<br/>\nLet us begin where she begins, go her Pace, and close always where she<br/>\nends, and we cannot miss of being good Naturalists.  The Creation would<br/>\nno longer be a Riddle to us:  The Heavens, Earth, and Waters, with their<br/>\nrespective, various and numerous Inhabitants:  Their Productions,<br/>\nNatures, Seasons, Sympathies and Antipathies; their Use, Benefit and<br/>\nPleasure, would be better understood by us:  And an eternal Wisdom,<br/>\nPower, Majesty, and Goodness, very conspicuous to us, thro&#39; those<br/>\nsensible and passing Forms:  The World wearing the Mark of its Maker,<br/>\nwhose Stamp is everywhere visible, and the Characters very legible to<br/>\nthe Children of Wisdom.<br/>\n<br/>\n And it would go a great way to caution and direct People in their Use<br/>\nof the World, that they were better studied and known in the Creation of<br/>\nit.  For how could Man find the Confidence to abuse it, while they<br/>\nshould see the Great Creator stare them in the Face, in all and every<br/>\npart thereof?&quot;<br/>\n<br/>\nI guess I&#39;ve probably said enough here.  But to add to the discussion, I<br/>\nhave posted the chapter of my book on nature education (&quot;Dog Kitties&quot;)<br/>\nup on my website (see below), so folks can see how it (for our family)<br/>\nplays out in actual practice.  Comments welcome!<br/>\n<br/>\nDavid Albert<br/>\n<br/>\n<br/>\n<br/>\n--<br/>\nMy book &quot;And the Skylark Sings with Me: Adventures in Homeschooling and<br/>\nCommunity-Based Education&quot; will be off the press around September 20.<br/>\nTo read a sample chapter, reviewers&#39; comments, or the foreword, visit my<br/>\nwebsite at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.skylarksings.com\">http://www.skylarksings.com</a></div>","specialLinks":[]}],"prevTopicId":2864,"nextTopicId":2496}}