{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: rough play and toddlers (edited)","postDate":"1264005034","msgId":49784,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhFNDkzOUNGLTE3NEQtNDUzMS05NDBBLTI2RTI4NzFGREU3MUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhqNjRhNytqYzE0QGVHcm91cHMuY29tPg==","referencesHeader":"PGhqNjRhNytqYzE0QGVHcm91cHMuY29tPg=="},"prevInTopic":49782,"nextInTopic":0,"prevInTime":49783,"nextInTime":49785,"topicId":49764,"numMessagesInTopic":0,"msgSnippet":"I m glad you wrote this, Joanna: -=-I have noticed, over many years of reading this list, that the people that have a huge, emotional situation and post in a","messageBody":"<div id=\"ygrps-yiv-895256287\">I&#39;m glad you wrote this, Joanna:<br/>\n<br/>\n-=-I have noticed, over many years of reading this list, that the  <br/>\npeople that have a huge, emotional situation and post in a &quot;crisis&quot;  <br/>\nmode end up getting defensive, and then not being able to use all the  <br/>\ninformation and suggestions nearly as well as people who post in a  <br/>\ncalmer, more thoughtful frame of mind. It makes sense, because the  <br/>\ncomments, which are directed to that intense, big, hairy situation  <br/>\nsound intense, big and hairy. -=-<br/>\n<br/>\nSome of the best growth probably comes in those people who post  <br/>\nemotionally, GET emotional, show some more emotion, have it pointed  <br/>\nout to them, and then find the grace or ability to think about what  <br/>\njust happened to them.   Few mothers of young children have time or  <br/>\nmoney for leisurely therapy.   Showing their worst moments and having  <br/>\npeople suggest what horrors can come from not getting over worst  <br/>\nmoments (and on a smaller level, what unexpected information can come  <br/>\nby e-mail of posting horrors to huge discussions lists) might be a  <br/>\ntherapeutic jolt of *hello!*<br/>\n<br/>\nWhile it can take a little while to recover from such a shock, the  <br/>\nresults can potentially prevent the children from harming other  <br/>\nchildren because they, in turn, are too poor or busy twenty years out  <br/>\nto afford therapy.<br/>\n<br/>\nPart of seeing one&#39;s harmful impulses laid out is the ability to  <br/>\ndecide whether to defend and keep them (now knowing more) or, having  <br/>\nhad a big light shone on the problem, to dismantle and replace those  <br/>\nbehaviors.<br/>\n<br/>\nIf they fall, they can fall into the pillow of Joyce&#39;s site and mine,  <br/>\nand the people on this list who are still willing to help them  <br/>\nuntangle and disentangle and help their children.<br/>\n<br/>\nI know some people&#39;s initial jolt here is that posters seem to care  <br/>\nmore about their children&#39;s feelings than about the posters&#39;.  If  <br/>\nthere is any magic to unschooling, it&#39;s when the parent really cares  <br/>\nmore about her children&#39;s feelings than her own, the whole world  <br/>\nshifts toward the light.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] rough play and toddlers (edited)","postDate":"1263993370","msgId":49782,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVEMDY5QzZCLTRGREYtNDE5Mi1BOTE0LTI1Qjg4MTc2OEI4REB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDU5NDYyOS42NTY5Mi5xbUB3ZWIzMzEwOC5tYWlsLm11ZC55YWhvby5jb20+","referencesHeader":"PDU5NDYyOS42NTY5Mi5xbUB3ZWIzMzEwOC5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":49778,"nextInTopic":49784,"prevInTime":49781,"nextInTime":49783,"topicId":49764,"numMessagesInTopic":0,"msgSnippet":"... It s good not to be a helicopter parent, hovering over kids, solving every problem they encounter. It s good to be nearby to step in before straining","messageBody":"<div id=\"ygrps-yiv-2040257772\">On Jan 19, 2010, at 5:13 PM, gertrude lee wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I certainly feel it is my duty to take care of my children by  <br/>\n&gt; allowing them the opportunity to take care of themseves.<br/>\n<br/>\n </span></blockquote>It&#39;s good not to be a helicopter parent, hovering over kids, solving  <br/>\nevery problem they encounter.<br/>\n<br/>\nIt&#39;s good to be nearby to step in before straining tempers lead to  <br/>\nproblems kids shouldn&#39;t have to take care of themselves.<br/>\n<br/>\nAt what point a parent steps in will be based on a parent&#39;s  <br/>\nunderstanding of her kids. Kids screaming in one family could be  <br/>\nexuberant kids. Kids screaming in another could be a situation that&#39;s  <br/>\ngone way beyond the point where a parent should have interceded.<br/>\n<br/>\nBeing attuned to kids and their needs will help parents help them.  <br/>\nObvious and easier to write than learn! ;-) But what you wrote above  <br/>\ndoesn&#39;t help someone move to that. It sounds like get out of the  <br/>\nchildren&#39;s way until they call for help. There&#39;s lots of stories from  <br/>\nadults whose own parents let the kids solve their own problems and  <br/>\nwho were silently bullied into submission by an older sibling. The  <br/>\nparents never knew and the child was too afraid to speak up! I don&#39;t  <br/>\nthink that&#39;s what you&#39;re advocating! But the words do encompass that.  <br/>\nIt can be tricky to figure out how words will be understood by  <br/>\nothers. Feedback is a big help in hearing what our words sound like  <br/>\nto others!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I said ***I am very much a follower of the continuum concept and  <br/>\n&gt; beleive in<br/>\n&gt; my childs ability to in self<br/>\n&gt;  preservation but i got really nervous***<br/>\n&gt; I am not sure if you are familiar with the Continuum concept but  <br/>\n&gt; how i reacted to my situation last night was not at all in  <br/>\n&gt; alignment with CC.  And i dont follow a philosophy i simply use  <br/>\n&gt; pieces of others discoveries when they resonate with me.<br/>\n<br/>\n </span></blockquote>If your words say one thing but you mean something different, the  <br/>\nresponses will be to your words, not to your meaning. If you say  <br/>\nyou&#39;re &quot;very much a follower of the continuum concept&quot; then why would  <br/>\nit be read differently?<br/>\n<br/>\nBut it *sounds* like you were following the notion that kids should  <br/>\nhave the opportunity to take care of themselves which prevented you  <br/>\nfrom being present and finding something to defuse the situation  <br/>\nbefore you felt the need to control your son&#39;s behavior.<br/>\n<br/>\nWhether that&#39;s accurate or not depends entirely on the words you  <br/>\nsend. But even if it&#39;s not accurate for your family, as general  <br/>\nadvice, it is sound and may have helped someone else.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Are you implying that i am allowing my son to bully her by playing  <br/>\n&gt; rough.<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>I&#39;m not implying anything. I&#39;m responding to the words written. The  <br/>\nonly ability I have to peek into your problem is your words.<br/>\n<br/>\nWhether you get help for your situation depends on your ability to  <br/>\ndescribe it for others to understand.<br/>\n<br/>\nBut my words are true in general, nonetheless. Someone may have read  <br/>\nthe discussion of the idea picture you painted and felt some  <br/>\nresonance and moved closer to understanding unschooling and being  <br/>\nmore present for their own kids.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; We have a 1/2 wall inbetween our living room and kitchen<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Not everyone does. The principle is to be more present with them.  <br/>\nGenerally that means being in the same room. In some houses it will  <br/>\nlook like Mom standing on the other side of the half wall as she  <br/>\nlistens and feels the dynamics. That&#39;s why we say live by principles  <br/>\nrather than rules. A principle is be more present. A rule is always  <br/>\nbe in the same room and never be more than 3&#39; from them when they&#39;re  <br/>\ntogether. ;-) That might be how the principle will look in a family  <br/>\nwith a child whose emotions go from 0 to 60 in a second! But  <br/>\nprinciples are much more useful than rules. Understanding why  <br/>\nsomething is done is more important than what it looks like in a  <br/>\nparticular family.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Their most recent developement finds them venturing to other parts  <br/>\n&gt; of the house where i cant see them and i somtimes dont have any  <br/>\n&gt; real reason to be there with them other than just being there.<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>And as general advice, that&#39;s not a good idea for a toddler and a 4  <br/>\nyo. General advice would be to be with them. That *is* a real reason  <br/>\nto be there. If you need something to do, bring laundry to fold or a  <br/>\nbook or a craft or something they might jump in on.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Joyce said ***Unless there&#39;s abuse or mental illness, it doesn&#39;t  <br/>\n&gt; matter.***<br/>\n&gt;<br/>\n&gt; What does that mean ? There is abuse and mental illness.<br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>And there isn&#39;t a way to know that unless someone says so.<br/>\n<br/>\nAbuse and mental illness makes situations more complex, obviously, so  <br/>\ngeneral advice won&#39;t be as helpful.<br/>\n<br/>\nIt sounds like a healthy solution would be to move away from his  <br/>\nfamily. (Yes, I&#39;m sure you have dozens of reasons why that&#39;s not  <br/>\npossible. Nos are *way* easier than yeses. That&#39;s why parents use no  <br/>\nso much!)<br/>\n<br/>\nBut regardless of even mental illness and abuse, you can&#39;t make him  <br/>\nchange. He has to want to change. What you *can* do are change what  <br/>\nyou&#39;re doing and do things that will help him want to change, things  <br/>\nthat will make it easier to change, to clear that pathway. What that  <br/>\nwill look like for your family, maybe only you or a family therapist  <br/>\ncan figure out. But the principle, the general idea that we can&#39;t  <br/>\nchange others, only ourselves, is the same nonetheless. It applies to  <br/>\nkids. It applies to spouses. It applies to the mean neighbor.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Are you asking me to consider a divorce or putting my children in  <br/>\n&gt; school ?<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>I&#39;m not sure how what I wrote could be read like that.<br/>\n<br/>\nDivorce generally means the end of unschooling. It&#39;s unfortunate that  <br/>\njudges (or whoever ends up deciding which parent&#39;s idea gets  <br/>\nimplemented) don&#39;t understand how great unschooling can be, but the  <br/>\nreality is they tend to be conservative. If one parent wants the norm  <br/>\nfor their kids and the other wants something out of the norm, the  <br/>\njudge will almost always side with the conservative parent. That  <br/>\nmeans unschooling is out.<br/>\n<br/>\nFor your desire for unschooling to hold sway, you need documented  <br/>\nevidence that he&#39;s not a fit parent. It sounds like that&#39;s not true.  <br/>\n(But that&#39;s a way way bigger topic than this thread can support!)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; What will help, to put my kids in school, or to get a divorce ?<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Neither will lead to better relationships and the list is all about  <br/>\nhelping parents forge better relationships.<br/>\n<br/>\nA big part of that will be a good relationship with a spouse. Maybe  <br/>\nsomeone can&#39;t achieve great, but better is better than worse! Because  <br/>\nworse can lead toward divorce and divorce isn&#39;t good for  <br/>\nrelationships and is very very often the end of unschooling.<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":294520986,"authorName":"Joanna","from":"&quot;Joanna&quot; &lt;ridingmom@...&gt;","profile":"ridingmom1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: rough play and toddlers (edited)","postDate":"1263965319","msgId":49778,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhqNjRhNytqYzE0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDZFRTdGMTVDLUM4RkQtNDBDMC1BREFFLUE0NDk2RUZBQ0M3RkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":49766,"nextInTopic":49782,"prevInTime":49777,"nextInTime":49779,"topicId":49764,"numMessagesInTopic":0,"msgSnippet":"...and my frustration led me to post on here. -=- ... I have noticed, over many years of reading this list, that the people that have a huge, emotional","messageBody":"<div id=\"ygrps-yiv-666402921\">&quot;...and my frustration led me to post on here.&quot;-=-<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt;&quot; I hope your desire to get feedback led you to post here.  People  <br/>\n&gt; should post from a desire to see more clearly how unschooling can  <br/>\n&gt; help, not post from frustration.&quot;<br/>\n&gt; <br/>\n </span></blockquote>I have noticed, over many years of reading this list, that the people that have a huge, emotional situation and post in a &quot;crisis&quot; mode end up getting defensive, and then not being able to use all the information and suggestions nearly as well as people who post in a calmer, more thoughtful frame of mind.  It makes sense, because the comments, which are directed to that intense, big, hairy situation sound intense, big and hairy.  <br/>\n<br/>\nYou have to remember that people can only comment on what and how you&#39;ve presented it, and also that we are commenting on a dynamic at its very worst, and most people are probably aware that your family is not always in that state.  &lt;g&gt;  Imho it&#39;s not necessary to go back and then paint the picture of how calm and happy and wonderful everything is when the crisis isn&#39;t happening.  Everyone&#39;s life has ups and downs!<br/>\n<br/>\nJoanna</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] rough play and toddlers (edited)","postDate":"1263942530","msgId":49766,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZFRTdGMTVDLUM4RkQtNDBDMC1BREFFLUE0NDk2RUZBQ0M3RkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDU5NDYyOS42NTY5Mi5xbUB3ZWIzMzEwOC5tYWlsLm11ZC55YWhvby5jb20+","referencesHeader":"PDU5NDYyOS42NTY5Mi5xbUB3ZWIzMzEwOC5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":49764,"nextInTopic":49778,"prevInTime":49765,"nextInTime":49767,"topicId":49764,"numMessagesInTopic":0,"msgSnippet":"-=-I certainly feel it is my duty to take care of my children by allowing them the opportunity to take care of themseves.  When they signal the need for help i","messageBody":"<div id=\"ygrps-yiv-1752521678\">-=-I certainly feel it is my duty to take care of my children by  <br/>\nallowing them the opportunity to take care of themseves.  When they  <br/>\nsignal the need for help i am there -=-<br/>\n<br/>\nThey shouldn&#39;t need to signal for help.<br/>\n<br/>\n-=-Are you implying that i am allowing my son to bully her by playing  <br/>\nrough.  I am not entirely comfortable with that,-=-<br/>\n<br/>\nThis list doesn&#39;t exist to make mothers comfortable.  You described  <br/>\nhis actions as constant and repeating.  You said you tell him to stop  <br/>\nand he doesn&#39;t.  That, then, is bullying.   You SHOULD be  <br/>\nuncomfortable with that.<br/>\n<br/>\n-= I did not want to make anyone feel uncomfortable and i know my son  <br/>\ndid not understand what he was doing or what i was trying to say and  <br/>\nmy frustration led me to post on here.-=-<br/>\n<br/>\nI hope your desire to get feedback led you to post here.  People  <br/>\nshould post from a desire to see more clearly how unschooling can  <br/>\nhelp, not post from frustration.<br/>\n<br/>\n-=-Their most recent developement finds them venturing to other parts  <br/>\nof the house where i cant see them and i somtimes dont have any real  <br/>\nreason to be there with them other than just being there.  I think  <br/>\nthat is fine.  I have noticed my sons conflict resolution skills  <br/>\nimprove greatly as they spend more time away from me. -=-<br/>\n<br/>\nA three or four year old left alone with a toddler has no need for  <br/>\n&quot;conflict resolution skills.&quot;  She probably can&#39;t talk much.  They  <br/>\nneed to be  supervised.<br/>\n<br/>\n-=-Joyce said ***If you want him to reach out -- and you *do* because  <br/>\ndivorce should<br/>\nbe considered also the end of unschooling (Read here: http://<br/>\nsandradodd.com/ divorce) (yes, occasionally unschooling can continue<br/>\nbut no one should count on that) -- then you&#39;ll need to be the path<br/>\nbuilder. Doing one nice thoughtful thing a day for him will help<br/>\nenormously.***<br/>\n<br/>\n-=-Are you asking me to consider a divorce or putting my children in  <br/>\nschool ?-=-<br/>\n<br/>\nHad you read the link that Joyce provided and that I re-posted, you  <br/>\nwouldn&#39;t have asked that question.<br/>\n<br/>\n-=- For me i hope divorce does not mean the end of unschooling.-=-<br/>\n<br/>\nIt almost always means the end of unschooling.  Even if at first  <br/>\nunschooling continues, when the husband re-marries or the exes aren&#39;t  <br/>\ngetting along so well, unschooling is the first thing to go.   I would  <br/>\nlike to say I&#39;ll never see it happen again, but I&#39;ve seen it before  <br/>\nand I probably will see it again.<br/>\n<br/>\n-=-Thank you Joyce I look forward to reading the archive file on  <br/>\ndivorse and unschooling.-=-<br/>\n<br/>\nPlease, next time someone offers a link to what has already been  <br/>\nwritten, read it then, rather than posting more.<br/>\nThe links were offered as assistance for a situation you came and  <br/>\ndescribed.  HUNDREDS of people are reading these posts.  Try to make  <br/>\nthe posts as clear and useful as possible, for the benefit of all  <br/>\nthose reading, and out of courtesy to the dozen or two dozen who might  <br/>\noffer their time and knowledge in writing to help you.<br/>\n<br/>\nSandra, the list owner<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":140577128,"authorName":"gertrude lee","from":"gertrude lee &lt;yoginidharma@...&gt;","profile":"yoginidharma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"rough play and toddlers (edited)","postDate":"1263939225","msgId":49764,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU5NDYyOS42NTY5Mi5xbUB3ZWIzMzEwOC5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":0,"nextInTopic":49766,"prevInTime":49763,"nextInTime":49765,"topicId":49764,"numMessagesInTopic":0,"msgSnippet":"This is very lengthy but i think it would interest those of you who have emotional or physical abuse as a reality in your lives. . I said *** I am very much","messageBody":"<div id=\"ygrps-yiv-34442977\">This is very lengthy but i think it would interest those of you who have emotional or physical abuse as a reality in your lives.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nI said *** I am very much a follower of the continuum concept and beleive <br/>\nin my childs ability in self<br/>\npreservation ***<br/>\n<br/>\nSandra said ***Do you mean you want your children to take care of themselves?***<br/>\nI certainly feel it is my duty to take care of my children by allowing them the opportunity to take care of themseves.  When they signal the need for help i am there (well atleast that is my goal, i fell off track obviously last night).  For example my children are playing rough on the couch again today, both lauging having fun, when my daughter has enough she sends out her distress signals gets off the couch and comes to me.  Now if her distress escalated and my son did not allow her passage of the couch i would get up certainly and hopefully gently approach the situation. By pointing out her distress signals to my son and physically getting in there and make sure her passage off the couch was a rewarding learning experience for all of us. <br/>\n <br/>\n Last night i did not allow my children the opportunity to que each others needs, overreacted and allmost entirely ruined everybodies night.  We usually dont watch alot of tv beuase i had ideas that it would ruin his imagination but after reading Allways Learning archives I am reconcidering and do not stifle his curiosity to watch tv.  I think letting go of my pre-conceptions of tv adding a element to my stress as well, but i am glad that my son will choose to help me or play creatively the majority of the time.<br/>\n <br/>\n <br/>\nI said *** I wanted to finish up cleaning the kitchen before bed so i could <br/>\nnot hang out with them.***<br/>\n<br/>\nSandra said ***You could have had one child in the kitchen with you. If the choice <br/>\nis taking care of a baby and a three year old or cleaning the kitchen, <br/>\nmaybe the kitchen could wait.***<br/>\n<br/>\nSandra also said ***Could you wear the baby? Could your son have helped with the dishes, <br/>\nor watched videos in the kitchen with you, or sing with you or <br/>\nsomething?***<br/>\n <br/>\n <br/>\n I really could have done things alot differently and i do usually have both the kids in the kitchen helping me in some way because they want to be. For such youngsters they can work well together my daughter passes the dishes to my son to put away and such.  We usually have music on and sing and dance inbetween chores.  Last night my son really wanted to watch tv and my daughter really wanted to be on the couch. I probably should of just left the kitchen and sat with them a little bit and then brought them to bed and come back to the kitchen later.   <br/>\n <br/>\nThank you sandra for your considerate words, i look forward to listening to the sound file.<br/>\n <br/>\n I said ***I am very much a follower of the continuum concept and beleive in <br/>\nmy childs ability to in self<br/>\n preservation but i got really nervous***<br/>\n<br/>\nJoyce said <br/>\n***I think she&#39;ll respect you a lot more if she knows you will keep her <br/>\nsafe from bullies in her own home than that you&#39;re the good follower <br/>\nof someone else&#39;s philosophy.***<br/>\n <br/>\nI am not sure if you are familiar with the Continuum concept but how i reacted to my situation last night was not at all in alignment with CC.  And i dont follow a philosophy i simply use pieces of others discoveries when they resonate with me.  Just like the information i collect from this forum.<br/>\n <br/>\n Are you implying that i am allowing my son to bully her by playing rough.  I am not entirely comfortable with that, I think a bully is someone who derives pleasure and seeks to make others uncomfortable.  I felt like a &quot;bully&quot; last night towards my son as my daughter witnessed minus the the pleasure.  I did not want to make anyone feel uncomfortable and i know my son did not understand what he was doing or what i was trying to say and my frustration led me to post on here.<br/>\n <br/>\nMy son has difficulty reading peoples distress signals sometimes because he is used to seeing my husband and i often having stressfull conversations and when he was very little, his father was more physically domineering.  My son is navigating through his experience of what we preach and what we do, we are certainly doing are best to model healthy relations and practice what we preach but sometimes fall into the pitfalls of our own upbringing.<br/>\n <br/>\nJoyce said ***Right now, the two need to not be alone together. That&#39;s just your <br/>\nreality until it isn&#39;t any more***<br/>\n <br/>\nLast night they needed not to be alone together, in general i take that decision moment by moment that is my reality.  We have a 1/2 wall inbetween our living room and kitchen so the majority of the time i can see both of them. Their most recent developement finds them venturing to other parts of the house where i cant see them and i somtimes dont have any real reason to be there with them other than just being there.  I think that is fine.  I have noticed my sons conflict resolution skills improve greatly as they spend more time away from me.  I have had times where i go to intervene becuase my daughter is getting a little distressed, she stops, smiles as me, shakes her head, leans out of my lap towards her brother and she goes up to him and continues to cry and babble until she gets what she wants from him, and he does work very hard to figure out what she wants.  As a matter of fact that just happened right now, but my son was yelling<br/>\n and i being cautious went to offer myelf to her and she refused.  Now they are laughing.<br/>\n <br/>\n I said ***My husband and i have modelled a very poor relationship for the <br/>\nmost part, my husband usually ignores me most of the time,while he <br/>\ndotes constantly on the children***  <br/>\n <br/>\n <br/>\n <br/>\nJoyce said*** Have you tried doing nice things for him? Undoubtedly there&#39;s a huge history that has led to this but people don&#39;t turn away for no <br/>\nreason. Perhaps a series of hurts you&#39;ve each done to the other (many <br/>\nprobably without even realizing it) that have built to the point you <br/>\nfeel justified in being hurtful and have eroded the trust.***<br/>\n <br/>\nI do nice things for him everyday, i once asked him what can i do to show him i love him becuase nothing i am trying seems to work, he asked me to give him a kiss and tell him i love him every day.  I do that.  My husband comes from a very physically and mentally abusive family back ground.  When I met him and married him i knew that.  He was very kind and caring and to put in his own words, looked forward discovering himself with me as he healed these things.  When his family moved close to us shortly after we got married, he went to work in his family business started to shut me out and abuse followed.  When things started to get manageable again, we had children, but emotional abuse was alot more infiltrating that i realized.<br/>\n <br/>\nJoyce said ***Unless there&#39;s abuse or mental illness, it doesn&#39;t matter.***<br/>\n <br/>\nWhat does that mean ? There is abuse and mental illness.<br/>\n <br/>\nJoyce said *** Wanting him to change won&#39;t make him change any more than him wanting you to change will make you change. It just drives a wedge deepeer.*** <br/>\n <br/>\n <br/>\nIf wanting him to have healthy relationships is wanting him to change and guess i do what him to change, but i want him to change back to the person i married and not the little boy that put up with horrific family abuse that had to shut every one out to cope.  I give him alot of space and dont nag him, unless i get attacked, then i try to work out things in the healthiest way possible.<br/>\n <br/>\nJoyce said ***If you want him to reach out -- and you *do* because divorce should <br/>\nbe considered also the end of unschooling (Read here: http:// <br/>\nsandradodd.com/ divorce) (yes, occasionally unschooling can continue <br/>\nbut no one should count on that) -- then you&#39;ll need to be the path <br/>\nbuilder. Doing one nice thoughtful thing a day for him will help <br/>\nenormously.***<br/>\n <br/>\nAre you asking me to consider a divorce or putting my children in school ?  The later does not seem like a solution to me. ( putting my kids in with alot of other people that are not even conscious of the abuse dished out, other kids and their teachers).  For me i hope divorce does not mean the end of unschooling.  When i am financially independant i will have to make that decision, until then i am devoted to creating healthy relationships with my family as well as others and i can embrace the reality that i might not be able to continue that journey with my husband. <br/>\n <br/>\n <br/>\n   As far as having my husband reach out, i am not sure if that is what i want, i really want us to have healthy relationships with other people as well as ourselves.  Does wanting him to reach out mean that we should concider divorce ?  I have a couple close relationships, but i certainly feel like i need more.  My huband does not trust other people and has no desire to make new friends (His Words)  We may get divorced, but he will still be a father that loves his children.   <br/>\n <br/>\nJoyce said ***It will help remove one more stress from your life and help you live <br/>\nthe relationship you&#39;d like your kids to have with their future partners***<br/>\n <br/>\nWhat will help, to put my kids in school, or to get a divorce ? I am all about creating healthy relationships with everyone i encounter.  That is why i am Allways Learning. <br/>\n <br/>\nThank you Joyce I look forward to reading the archive file on divorse and unschooling.<br/>\n <br/>\nThanks for reading this and i hope this dialogue helps some one else as do the posts i read.  Thank you all very much.<br/>\n <br/>\nTrudy<br/>\n<br/>\n <br/>\n<br/>\n <br/>\n <br/>\n  <br/>\n <br/>\nJoyce said &quot;Have you tried doing nice things for him? Undoubtedly there&#39;s a huge <br/>\nhistory that has led to this but people don&#39;t turn away for no <br/>\nreason. Perhaps a series of hurts you&#39;ve each done to the other (many <br/>\nprobably without even realizing it) that have built to the point you <br/>\nfeel justified in being hurtful and have eroded the trust. Unless <br/>\nthere&#39;s abuse or mental illness, it doesn&#39;t matter. Wanting him to <br/>\nchange won&#39;t make him change any more than him wanting you to change <br/>\nwill make you change. It just drives a wedge deeper between you.<br/>\n<br/>\nIf you want him to reach out -- and you *do* because divorce should <br/>\nbe considered also the end of unschooling (Read here: http:// <br/>\nsandradodd.com/ divorce) (yes, occasionally unschooling can continue <br/>\nbut no one should count on that) -- then you&#39;ll need to be the path <br/>\nbuilder. Doing one nice thoughtful thing a day for him will help <br/>\nenormously. Read the archives here:&quot;<br/>\n <br/>\nMy husband comes from a very violent upbringing emotionally and physically.  When we got married i knew this.  He was very kind and caring and worked very hard to find ways to rebuild or as he would say discover himself.  Shortly after we were married his family moved close to us, they started a family business and he shut me out and the abuse started.  We spent alot of time working through alot of issues and started to have children when things seemed to be getting better then things got even worse because emotional abuse is alot more subtle then i realized, in his culture women and children are like owning property, he started to treat me more like a person, but his children like property, i showed him healthy ways to treat children and askhim how he thinks he might have felt if he was treated respectfully as a child, he has certainly replaced alot of abusive mechanisms with thoughtfull ones, but the problem is they are my thoughts not his,he<br/>\nhaqs not completely owned, or discovered foer him selkf healthy interactions.  We are positively working through things in the best way possible, i spend alot of time reading about healing relationships from abuse but it is hard to be the therapist as well as a recipient of abuse and some days i cant take it. figure out the best way to comunicate with my husband ( and my children, the childs book as well).  <br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":49783,"nextTopicId":49705}}