{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":11,"messages":[{"userId":383312070,"authorName":"Cara Barlow","from":"Cara Barlow &lt;carabarlow@...&gt;","profile":"crbrlw","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] career path as an unschooling mom","postDate":"1346604728","msgId":68898,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBRWhNejUrZUVoNFRDdmJENGpFRlRMS19IQVlKRnNtZWhadXJjTW1RYUQyQUxnTG49QUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PENBQWsyY2Y4R0tLbThGRUVuT0RDejdSXy1ZOS1KK1l5KzhjR0V5OGZ3Vk9hRmNlbjBwQUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PENBQWsyY2Y4R0tLbThGRUVuT0RDejdSXy1ZOS1KK1l5KzhjR0V5OGZ3Vk9hRmNlbjBwQUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":68894,"nextInTopic":0,"prevInTime":68897,"nextInTime":68899,"topicId":68852,"numMessagesInTopic":0,"msgSnippet":"Hi: I ve worked for most of my children s lives, though it s not been a straightforward, what-people-think-of as career path. Molly and Anna are now 14 and 16","messageBody":"<div id=\"ygrps-yiv-1510805719\">Hi: I&#39;ve worked for most of my children&#39;s lives, though it&#39;s not been a<br/>\nstraightforward, what-people-think-of as career path.<br/>\n<br/>\nMolly and Anna are now 14 and 16 years old, and they&#39;ve been homeschooled<br/>\n(approx 1.5 years) then unschooled since 2004, when they were 6 and 8 years<br/>\nold. I&#39;m married and we have my husband&#39;s income, but he&#39;s happier when I<br/>\nhave a job too - I think it makes him feel a bit more financially secure.<br/>\n<br/>\nI have a master&#39;s degree in library science that I earned in my early 20&#39;s.<br/>\nBack then I expected to be a library director by the time I was 40yo.<br/>\n<br/>\nWhen my oldest was born I was working full-time as a public library grant<br/>\nmanager for the Massachusetts Board of Library Commissioners. I realized<br/>\nafter Anna was born that I couldn&#39;t bring myself to put her into daycare,<br/>\nbut we had no local family to help and my husband was overseas in the<br/>\nmilitary.<br/>\n<br/>\nI resigned and stayed home with her for a few months in Boston, then moved<br/>\nto Southern NH to work for then gradually take over my mother and<br/>\nstepfather&#39;s printing business - they wanted to retire and sell me the<br/>\nbusiness.<br/>\n<br/>\nThat (fortunately in hindsight) didn&#39;t work out, so I found a part-time job<br/>\nfirst as a copyeditor, then as a reporter for a local newspaper. I wrote at<br/>\nhome and emailed in my work, made phone calls from home and brought Anna<br/>\nwith me when I went into the paper or was out covering a story. She was<br/>\nactually a great ice-breaker when talking with people &lt;g&gt;. I did that until<br/>\nmy second daughter was almost 2yo.<br/>\n<br/>\nAt that point I started doing in-home daycare - we were already the house<br/>\nthat neighborhood kids gravitated to, so I figured I should get paid for<br/>\nwatching, playing with and feeding all these extra kids. I ran the daycare<br/>\nuntil Anna and Molly got tired of having others in our home so often. I<br/>\nusually had 1-3 children that weren&#39;t my own a few days a week. During this<br/>\ntime I was also writing a column for the newspaper at night.<br/>\n<br/>\nAfter that I worked as a teacher&#39;s assistant at a Montessori school for a<br/>\ncouple of years while Molly attended there, and then we started<br/>\nhomeschooling.<br/>\n<br/>\nThe first year the girls were home with me I didn&#39;t bring any money. We cut<br/>\nour budget as much as we could. For a while I sold old books, vintage items<br/>\nand antiques on ebay but when the recession happened, that all fell apart.<br/>\n<br/>\nBy then the kids were 9 and 12 years old, and I felt like I could start<br/>\nworking out of the house. Because I have a MLS and had worked as a<br/>\nlibrarian before I had children, I was able to find a part time evening job<br/>\nworking as a reference librarian at a local art school library (my<br/>\nundergraduate degree is in studio art). That&#39;s what I did until just a few<br/>\nmonths ago - I worked as a part-time reference librarian. I arranged my<br/>\nschedule so that I would be working when my husband could be home with the<br/>\ngirls. When Anna and Molly were 12 and 14 I started working one day and one<br/>\nevening.<br/>\n<br/>\nThe girls are now 14 and 16 years old. Anna has a job at a clothing store<br/>\ntwo days a week, is working towards instructor certification at the dojo<br/>\nshe&#39;s involved with, and then next year (fall 2013) she wants to enter<br/>\ncosmetology school. Molly wants to start working towards an architectural<br/>\ndrafting certificate at the local community college when she&#39;s 15 (also the<br/>\nfall of 2013). Plus Anna will need to get a car and insurance to drive to<br/>\ncosmetology school. And our 120yo house needs some work done on it that we<br/>\ncan&#39;t put off any longer. I don&#39;t want to borrow money for school tuition<br/>\nor a car and we don&#39;t have the savings to pay it. I realized that I needed<br/>\nto get a full-time job.<br/>\n<br/>\nAfter an unexpectedly short job-search, I started working full-time a few<br/>\nweeks ago as the supervisor of the music, art and media department of a<br/>\nlargish urban public library about 30 minutes from our house. Anna got her<br/>\ndriver&#39;s license this summer and we found a older car for her, so she&#39;s<br/>\ndriving herself to work, the dojo, and will be taking Molly to her<br/>\nactivities when they start up this fall. I call or text to check in with<br/>\nboth of them during the day, and when I&#39;m home I&#39;m really focused on<br/>\nspending time and doing things together and making home a fun, happy place.<br/>\n<br/>\nEven though I took some long and winding side trips in my work life, I<br/>\nfound myself back in the field I started out in. Those side-trips have help<br/>\nmake me who I am and I have no regrets - I think they&#39;ve made me better at<br/>\nmy job - better than I would have been if I had remained working full-time<br/>\nin the library field and had not unschooled our children.<br/>\n<br/>\nWe&#39;re continuing to unschool and I think it&#39;s going to work out (no pun<br/>\nintended &lt;g&gt;). When we hit some bumps, we&#39;ll adjust and then move forward.<br/>\nI think the key is to be flexible, consider what suits your family and<br/>\nre-evaluate regularly as you and your children change and grow older.<br/>\n<br/>\nBest wishes, Cara<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":472959096,"authorName":"catiamaciel@want.com.pt","from":"catiamaciel@...","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: [AlwaysLearning] career path as an unschooling mom","postDate":"1346552595","msgId":68894,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMTIwOTAyMDQyMzE1LjI1NjY0N2hzanpuejVuMnJAd3d3LndhbnQuY29tLnB0Pg==","inReplyToHeader":"IDxDQUFrMmNmOEdLS204RkVFbk9EQ3o3Ul8tWTktSitZeSs4Y0dFeThmd1ZPYUZjZW4wcEFAbWFpbC5nbWFpbC5jb20+","referencesHeader":"IDxDQUFrMmNmOEdLS204RkVFbk9EQ3o3Ul8tWTktSitZeSs4Y0dFeThmd1ZPYUZjZW4wcEFAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":68893,"nextInTopic":68898,"prevInTime":68893,"nextInTime":68895,"topicId":68852,"numMessagesInTopic":0,"msgSnippet":"i forgot to say that in the 1st year my husband would go with me to the university and play on the garden, stay at the café, go to the sea that was a few km","messageBody":"<div id=\"ygrps-yiv-911666243\">i forgot to say that in the 1st year my husband would go with me to  <br/>\nthe university and play on the garden, stay at the café, go to the sea  <br/>\nthat was a few km away, so he could bring me our son every hour to  <br/>\nbreast feed. If he needed to breast feed before that, we would change  <br/>\nsms&#39;s to know if he could come. Everyone knows me as the breastfeeding  <br/>\nmon. That gave very interesting converstaions with the students. It is  <br/>\npsi and medical school so i was entitled to the very big speaches  <br/>\nabout how much my ideas about breastfeeding where harmfull to me and  <br/>\nour son. Now they just don&#39;t care anymore.</div>","specialLinks":[]},{"userId":472959096,"authorName":"catiamaciel@want.com.pt","from":"catiamaciel@...","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: [AlwaysLearning] career path as an unschooling mom","postDate":"1346552103","msgId":68893,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMTIwOTAyMDQxNTAzLjIwMzM2N2FpZ2dncXE0MnZAd3d3LndhbnQuY29tLnB0Pg==","inReplyToHeader":"IDxDQUFrMmNmOEdLS204RkVFbk9EQ3o3Ul8tWTktSitZeSs4Y0dFeThmd1ZPYUZjZW4wcEFAbWFpbC5nbWFpbC5jb20+","referencesHeader":"IDxDQUFrMmNmOEdLS204RkVFbk9EQ3o3Ul8tWTktSitZeSs4Y0dFeThmd1ZPYUZjZW4wcEFAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":68872,"nextInTopic":68894,"prevInTime":68892,"nextInTime":68894,"topicId":68852,"numMessagesInTopic":0,"msgSnippet":"hello, even if your question to unschooling moms and our son is just 3 years old, so not unschooling yet, i decided to send a reply with our experience. i m a","messageBody":"<div id=\"ygrps-yiv-1888715149\">hello,<br/>\n<br/>\neven if your question to unschooling moms and our son is just 3 years  <br/>\nold, so not unschooling yet, i decided to send a reply with our  <br/>\nexperience.<br/>\n<br/>\ni&#39;m a college teacher and, since our son was born, we decided i would  <br/>\nteach, face to fae,  8 to 10 ours per week instead of the previous 18  <br/>\nto 20. This means i teach just one face-to-face discipline instead to  <br/>\n2. I also used to teach on 2 online courses but i&#39;m not doing that  <br/>\nsince our sons birth because it was to demanding in terms of computer  <br/>\nwork/time.<br/>\n<br/>\n<br/>\nwe also decided i will teach just one semester per year, instead of 2.<br/>\n<br/>\ni teach the 8 to 10 hours in just one day and my husband asked at work  <br/>\nto have is paid holidays once a week - every time i teach - to stay at  <br/>\nhome with our son. He uses almost all his payd holidays to stay at  <br/>\nhome with our son. The remaining days are used to spend xmas with  <br/>\nfamily (they are all on other sides of the country) and to help at  <br/>\nhome when we need.<br/>\n<br/>\ni also tryed to teach several dyas a week from 8am to 10 am and my  <br/>\nhusband will stay with or son until i arrived and then go to work but  <br/>\nthe traffic to be back home was impossible and it would take to musch  <br/>\ntime so it didn&#39;t worked.<br/>\n<br/>\nThe university where i teach is not in the city where i live so i need  <br/>\n2 hours to comute (one to each side) what means i work 12 hours in one  <br/>\nday. That&#39;s every monday. Tuesday i take time to be with our son,  <br/>\ndoing nothing else, normaly out of the house. Wednesday there is a  <br/>\nbaby sitter coming to stay with him so i can prepare more classes,  <br/>\nrespond to the students needs etc.. sometimes she cleans the flat with  <br/>\nme and the boy or we go outside and she cleans alone. It depends on  <br/>\nhow much work i have to from the university. When we are short on  <br/>\nmoney she does not come to help and i catch up from the university at  <br/>\nnigth. Not having her is very exausting since our son is not a big  <br/>\nsleeper.<br/>\n<br/>\nThe ideia was to work less only during the 1st semester,m them the  <br/>\n1rst year, then until the 3th year and now i know i will not return to  <br/>\nthe full time job in the next years.<br/>\n<br/>\nbecause of this option, i&#39;m not doing my PHD anymore, i dont have  <br/>\nprojects at the university, i dont have an office there either. I just  <br/>\ngo there to the classes. I recieve less than 1/3 of the salary i used  <br/>\nto win before our son was born. I&#39;m not thinkig about a carrear  <br/>\nanymore. I work to keep the money coming to the house but my work is  <br/>\nnot my main objective. My main objective is to be at home with our son.<br/>\n<br/>\nThis was very difficult to integrate in the 1st years and i still have  <br/>\nperiods where i believe it will not be possibçe to continue like this  <br/>\nbecause of the lack of money. Our way of living changed a lot and we  <br/>\nstill gathering all the possible tips about living with less money. I  <br/>\nthink that the fact that Portugal is facing a major crisis is helping  <br/>\nus not to feel very poor... everyone is poor now. Sometimes people ask  <br/>\nme, with a very sad look, if life is very difficult without a job and  <br/>\ni always smile and say that maybe it is for the womens who did not  <br/>\nchoose to stay  at home but, for me, when i complain i always think  <br/>\nthat is was my choice...<br/>\n<br/>\nMy husband likes a lot the time he spends alone with our son. That  <br/>\ngives him 3 days with him and 4 days working.<br/>\n<br/>\nOne day i will be back to work, or i will work more hours. We have  <br/>\nloans to pay so i&#39;m looking for a way to stay at home and win money at  <br/>\nthe same time. In this moment i can&#39;t see how that will be but i  <br/>\nimagine it will become easier, one day... nevertheless, now i think  <br/>\nabout work, not about a career anymore.<br/>\n<br/>\ni also find that deschooling and being a teacher is a very difficult  <br/>\ntask. I see all the teaching at the university as if i was an alien. I  <br/>\nthink i have a more close relation with the studens because of the  <br/>\nunschooling principles but to see how much they are hurt and how litle  <br/>\nthey expect from me, it&#39;s sill very difficult to me.<br/>\n<br/>\ni hope our experience can give some ideias.<br/>\n<br/>\ncátia maciel</div>","specialLinks":[]},{"userId":73632602,"authorName":"singledadunschooler_steve","from":"&quot;singledadunschooler_steve&quot; &lt;steve@...&gt;","profile":"singledadunschooler_steve","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: career path as an unschooling mom","postDate":"1346424854","msgId":68872,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGsxcWo2bStwdXRqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGsxb3JqdStrNnBqQGVHcm91cHMuY29tPg=="},"prevInTopic":68866,"nextInTopic":68893,"prevInTime":68871,"nextInTime":68873,"topicId":68852,"numMessagesInTopic":0,"msgSnippet":"I m a single unschooling dad of an 8-year-old and a 10-year-old.  Their mother lives many states away and there s no family in town, so I m on my own. I m home","messageBody":"<div id=\"ygrps-yiv-1633878494\">I&#39;m a single unschooling dad of an 8-year-old and a 10-year-old.  Their mother lives many states away and there&#39;s no family in town, so I&#39;m on my own.<br/>\n<br/>\nI&#39;m home all day every day, so they&#39;ve got me as a rock.  But, since I work much of the day, I can&#39;t give them the kind of direct attention that they could get from an always-available unschooling mom.<br/>\n<br/>\nBut hey, it works for us - the kids are always happy and working on things they are interested in.  About once a day, we either go somewhere (like a public pool) or they have friends over.<br/>\n<br/>\nAnd since my job is completely portable, we end up spending a couple months at their grandparents&#39; house or near their mother&#39;s house, which simultaneously fills their love tanks and satisfies my yearning to travel and explore.<br/>\n<br/>\nSteve</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] career path as an unschooling mom","postDate":"1346389198","msgId":68866,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ3NTk0OTNFLUNFQzItNDk4QS04MUY0LUEyQTg5NEJDM0E1OUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PENBQWsyY2Y4R0tLbThGRUVuT0RDejdSXy1ZOS1KK1l5KzhjR0V5OGZ3Vk9hRmNlbjBwQUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PENBQWsyY2Y4R0tLbThGRUVuT0RDejdSXy1ZOS1KK1l5KzhjR0V5OGZ3Vk9hRmNlbjBwQUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":68863,"nextInTopic":68872,"prevInTime":68865,"nextInTime":68867,"topicId":68852,"numMessagesInTopic":0,"msgSnippet":"Here are some things for single parents, about unschooling: http://sandradodd.com/singleparent Sandra","messageBody":"<div id=\"ygrps-yiv-978183172\">Here are some things for single parents, about unschooling:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/singleparent\">http://sandradodd.com/singleparent</a><br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":240358028,"authorName":"kristi_beguin","from":"&quot;kristi_beguin&quot; &lt;foehn_jye@...&gt;","profile":"kristi_beguin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: career path as an unschooling mom","postDate":"1346368066","msgId":68863,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGsxb3JvMitqOGpwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGsxb3JqdStrNnBqQGVHcm91cHMuY29tPg=="},"prevInTopic":68862,"nextInTopic":68866,"prevInTime":68862,"nextInTime":68864,"topicId":68852,"numMessagesInTopic":0,"msgSnippet":"Whoops, typo! ...even though I *couldn t* be present all day each day, I could still be present all night, every night.","messageBody":"<div id=\"ygrps-yiv-237446630\">Whoops, typo! <br/>\n&quot;...even though I *couldn&#39;t* be present all day each day, I could still be present all night, every night.</div>","specialLinks":[]},{"userId":240358028,"authorName":"kristi_beguin","from":"&quot;kristi_beguin&quot; &lt;foehn_jye@...&gt;","profile":"kristi_beguin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: career path as an unschooling mom","postDate":"1346367934","msgId":68862,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGsxb3JqdStrNnBqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBQWsyY2Y4R0tLbThGRUVuT0RDejdSXy1ZOS1KK1l5KzhjR0V5OGZ3Vk9hRmNlbjBwQUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":68861,"nextInTopic":68863,"prevInTime":68861,"nextInTime":68863,"topicId":68852,"numMessagesInTopic":0,"msgSnippet":"I, too, work outside the home 4 days per week.  My husband works from home around my schedule. Our children are 7 and 10, but I have worked outside the home,","messageBody":"<div id=\"ygrps-yiv-1616549345\">I, too, work outside the home 4 days per week.  My husband works from home around my schedule. Our children are 7 and 10, but I have worked outside the home, part-time, since my youngest was 18 months old.  When she was still nursing, I went to work very early, and came home earlier in the day so that I could nurse her down for her nap.  As she got older I rearranged my schedule so that I could be with both of them more during the day.  Flexibility has been key.<br/>\n<br/>\nWe are very fortunate to have a lot of family support. My in-laws live next door and my mother-in-law spends two days a week caring for my children.  My mother also helps us out frequently.  My husband has several commitments, and we&#39;ve learned how to make a graceful dance out of our busy schedules. As the kids have grown older, things seem much easier. I have made a concerted effort to ensure that I am meeting their needs as much as I possibly can while still helping our lives to run smoothly and happily.  <br/>\n<br/>\nI think Meredith stated it very well, &quot;A big part of what makes unschooling work is prioritizing the needs of kids. In terms of a job, that often means a good bit of flexibility - actively looking for ways to have more time at home with your kids.&quot; <br/>\n<br/>\nAnother thing I think helped very much was co-sleeping.  In many ways it seemed that even though I could be present all day each day, I could still be present all night, every night.</div>","specialLinks":[]},{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: career path as an unschooling mom","postDate":"1346352159","msgId":68861,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYyMzE5M0JGLUMyODMtNDIxNi1BQkFELTFCMjMyRDMzNTZBQUBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PGsxbzhrcys5czV1QGVHcm91cHMuY29tPg==","referencesHeader":"PGsxbzhrcys5czV1QGVHcm91cHMuY29tPg=="},"prevInTopic":68860,"nextInTopic":68862,"prevInTime":68860,"nextInTime":68862,"topicId":68852,"numMessagesInTopic":0,"msgSnippet":"... And sometimes, it means rethinking the amount of money you need and whether one parent being home is worth more than what it will cost not to be there","messageBody":"<div id=\"ygrps-yiv-1397435143\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; . A big part of what makes unschooling work is prioritizing the  <br/>\n&gt; needs of kids. In terms of a job, that often means a good bit of  <br/>\n&gt; flexibility - actively looking for ways to have more time at home  <br/>\n&gt; with your kids. Sometimes that means working longer hours and fewer  <br/>\n&gt; days. Sometimes it means working from home (although depending on  <br/>\n&gt; what you do, that can be frustrating!!). Sometimes it means turning  <br/>\n&gt; down promotions which would require you to spend more time on your  <br/>\n&gt; job. Sometimes it means involving family in childcare and  <br/>\n&gt; compromising a bit on what you expect in terms of &quot;unschooling&quot;.<br/>\n<br/>\n </span></blockquote>And sometimes, it means rethinking the amount of money you need and  <br/>\nwhether one parent being home is worth more than what it will cost not  <br/>\nto be there (both in financial and emotional terms).<br/>\n<br/>\nRobin B.</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: career path as an unschooling mom","postDate":"1346348508","msgId":68860,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGsxbzhrcys5czV1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBQWsyY2Y4R0tLbThGRUVuT0RDejdSXy1ZOS1KK1l5KzhjR0V5OGZ3Vk9hRmNlbjBwQUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":68857,"nextInTopic":68861,"prevInTime":68859,"nextInTime":68861,"topicId":68852,"numMessagesInTopic":0,"msgSnippet":"... Right now I work full time away from home, and my partner is building a small business, essentially from home... but our kids are 11 and 19. They don t","messageBody":"<div id=\"ygrps-yiv-435158835\">Ai Addyson-Zhang &lt;aizhang79@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;i want to know<br/>\n&gt; if moms working full time can do unschooling? or maybe part-time or home<br/>\n&gt; business are better alternatives?<br/>\n<br/>\n </span></blockquote>Right now I work full time away from home, and my partner is building a small business, essentially from home... but our kids are 11 and 19. They don&#39;t need the big time and energy commitment that a young child needs. A big part of what makes unschooling work is prioritizing the needs of kids. In terms of a job, that often means a good bit of flexibility - actively looking for ways to have more time at home with your kids. Sometimes that means working longer hours and fewer days. Sometimes it means working from home (although depending on what you do, that can be frustrating!!). Sometimes it means turning down promotions which would require you to spend more time on your job. Sometimes it means involving family in childcare and compromising a bit on what you expect in terms of &quot;unschooling&quot;. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":229711483,"authorName":"peanutyogi","from":"&quot;peanutyogi&quot; &lt;peanutyogi@...&gt;","profile":"peanutyogi","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: career path as an unschooling mom","postDate":"1346306976","msgId":68857,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGsxbjAzMCtlb3M1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBQWsyY2Y4R0tLbThGRUVuT0RDejdSXy1ZOS1KK1l5KzhjR0V5OGZ3Vk9hRmNlbjBwQUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":68852,"nextInTopic":68860,"prevInTime":68855,"nextInTime":68858,"topicId":68852,"numMessagesInTopic":0,"msgSnippet":"Ai, When my son was born I was managing and teaching a yoga studio. He came to the studio with me. I stopped working when he was a year and a half due to","messageBody":"<div id=\"ygrps-yiv-1595896544\">Ai,<br/>\n<br/>\nWhen my son was born I was managing and teaching a yoga studio.<br/>\nHe came to the studio with me.<br/>\nI stopped working when he was a year and a half due to exhaustion, as I am raising him alone.  He and I moved into a tiny studio and I let my mother pay the rent for the next year and half while I rested and recovered, and he and I bonded further.  Then when he was three I started a bookkeeping business that I run from my computer at home.  <br/>\nI, also, work a couple days each week in a minimum wage task that gets us out of the house, gets me away from the computer, and that allows him to be with me.<br/>\n<br/>\nWe live a VERY simple life, in a small apartment, in a very small (1200 pop.) safe town.  We live on what is considered &quot;poverty level&quot; income, but I would not change a thing.  We can walk to the grocery, post office and library (which is close enough that he can walk to alone now).  <br/>\n<br/>\nIt can be helpful to ask oneself, &quot;What is the most important thing to me?&quot;  Once that answer is found then every action can move from there.  <br/>\nFor me the answer was &quot;being available to serve my son to his and my highest good&quot;.   Then each time I took an action I asked myself if it met that goal.  Some actions meet that goal repeatedly (year after year), and some actions fail and fall away gradually, some actions are immediately thrown out as incongruous with my life purpose.<br/>\nHaving a nanny at home and working my business outside of the house, served the purpose for about 6 months, then I brought it all back to the living room.  <br/>\n<br/>\nThis process, I am sure, becomes a bit more complicated when a spouse in involved, but it can still be done.<br/>\n<br/>\nWishing you all the Best Ai,<br/>\n<br/>\nCookie<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Ai Addyson-Zhang &lt;aizhang79@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Hello Moms,<br/>\n&gt; My name is Ai, a new mom to a one-year old son named Aidan. I am new to the<br/>\n&gt; list, but i have gained a tremendous amount of useful information over the<br/>\n&gt; past several days. Thank you everyone for sharing their thought and<br/>\n&gt; experience, which is very helpful for me.<br/>\n&gt; <br/>\n&gt; I am seriously considering unschooling our child(ren). However, i still<br/>\n&gt; have a full-time job. i am a college professor teaching at a liberal arts<br/>\n&gt; college. So, i have summer and winter break. These breaks used to seem so<br/>\n&gt; long, but now, as i have my son, they seem to be so short. The past summer<br/>\n&gt; is the first time that i had a chance to spend everyday with my son. it&#39;s a<br/>\n&gt; bless! I enjoyed every minute of it and exploring life together with him!<br/>\n&gt; We established a very good bond. My son by nature is a very happy boy,<br/>\n&gt; always smiling to people and laughing. Now, the semester has just started,<br/>\n&gt; both my son and i are having a hard adjusting, even though i will only be<br/>\n&gt; gone three days a week. Today is the first day that i return to work. It is<br/>\n&gt; very hard for Aidan to adjust since i am still breastfeeding. It is also<br/>\n&gt; very hard for me to hear him crying when i called our babysitter in the<br/>\n&gt; afternoon when i got a short break. i miss him so much while i was at<br/>\n&gt; work....<br/>\n&gt; <br/>\n&gt; So, i was wondering how the moms on this list balance their work and life?<br/>\n&gt; Or, do most moms make career readjustment so that they can stay at home to<br/>\n&gt; be with their children to explore life and play together?<br/>\n&gt; <br/>\n&gt; I am very troubled by this recently. I would greatly appreciate if some<br/>\n&gt; moms here doing unschooling can share their careers choices. i want to know<br/>\n&gt; if moms working full time can do unschooling? or maybe part-time or home<br/>\n&gt; business are better alternatives?<br/>\n&gt; <br/>\n&gt; Thank you very much in advance!<br/>\n&gt; <br/>\n&gt; Ai<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":202130345,"authorName":"Ai Addyson-Zhang","from":"Ai Addyson-Zhang &lt;aizhang79@...&gt;","profile":"allison_zhang","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"career path as an unschooling mom","postDate":"1346296137","msgId":68852,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBQWsyY2Y4R0tLbThGRUVuT0RDejdSXy1ZOS1KK1l5KzhjR0V5OGZ3Vk9hRmNlbjBwQUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":68857,"prevInTime":68851,"nextInTime":68853,"topicId":68852,"numMessagesInTopic":0,"msgSnippet":"Hello Moms, My name is Ai, a new mom to a one-year old son named Aidan. I am new to the list, but i have gained a tremendous amount of useful information over","messageBody":"<div id=\"ygrps-yiv-597449853\">Hello Moms,<br/>\nMy name is Ai, a new mom to a one-year old son named Aidan. I am new to the<br/>\nlist, but i have gained a tremendous amount of useful information over the<br/>\npast several days. Thank you everyone for sharing their thought and<br/>\nexperience, which is very helpful for me.<br/>\n<br/>\nI am seriously considering unschooling our child(ren). However, i still<br/>\nhave a full-time job. i am a college professor teaching at a liberal arts<br/>\ncollege. So, i have summer and winter break. These breaks used to seem so<br/>\nlong, but now, as i have my son, they seem to be so short. The past summer<br/>\nis the first time that i had a chance to spend everyday with my son. it&#39;s a<br/>\nbless! I enjoyed every minute of it and exploring life together with him!<br/>\nWe established a very good bond. My son by nature is a very happy boy,<br/>\nalways smiling to people and laughing. Now, the semester has just started,<br/>\nboth my son and i are having a hard adjusting, even though i will only be<br/>\ngone three days a week. Today is the first day that i return to work. It is<br/>\nvery hard for Aidan to adjust since i am still breastfeeding. It is also<br/>\nvery hard for me to hear him crying when i called our babysitter in the<br/>\nafternoon when i got a short break. i miss him so much while i was at<br/>\nwork....<br/>\n<br/>\nSo, i was wondering how the moms on this list balance their work and life?<br/>\nOr, do most moms make career readjustment so that they can stay at home to<br/>\nbe with their children to explore life and play together?<br/>\n<br/>\nI am very troubled by this recently. I would greatly appreciate if some<br/>\nmoms here doing unschooling can share their careers choices. i want to know<br/>\nif moms working full time can do unschooling? or maybe part-time or home<br/>\nbusiness are better alternatives?<br/>\n<br/>\nThank you very much in advance!<br/>\n<br/>\nAi<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":68896,"nextTopicId":68905}}