{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":36888606,"authorName":"Luz Shosie and Ned Vare","from":"Luz Shosie and Ned Vare &lt;nedvare@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: recovered formerly schooled kids","postDate":"1026677218","msgId":39186,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI5NTc1MDM1LkVFMyVuZWR2YXJlQG50cGx4Lm5ldD4=","inReplyToHeader":"PDEwMjY2MTc5NjYuMzQxLjEzNzYwLm0xMkB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":39181,"nextInTopic":0,"prevInTime":39185,"nextInTime":39187,"topicId":39165,"numMessagesInTopic":0,"msgSnippet":"... You re welcome & you re right -- we all go through many stages. I remember especially macho periods at around ages 4 and 8. Then I have a photo of ","messageBody":"<div id=\"ygrps-yiv-1711161358\"><blockquote><span title=\"ireply\">&gt; Date: Sun, 14 Jul 2002 03:31:14 GMT<br/>\n&gt; From: &quot;llindsey&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:llindsey@...\">llindsey@...</a>&gt;<br/>\n&gt; Subject: Re: Re: recovered formerly schooled kids<br/>\n&gt; <br/>\n&gt; wow.. thanks so much for posting these bits ... it is very<br/>\n&gt; encouraging to me.. My son, 8, is now free of school... and<br/>\n&gt; i, too am seeing some difference already.. (and i&#39;ts still<br/>\n&gt; summer.) i am really really trying to convince myself that<br/>\n&gt; his obsession with wrestling and behaving just like the<br/>\n&gt; totally offensive wrestlers on tv is not to be worried too<br/>\n&gt; much about.. i am sure he will eventually lose the need to<br/>\n&gt; be so obnoxious... (please, somebody, tell me i am right...<br/>\n&gt; )<br/>\n<br/>\n </span></blockquote>You&#39;re welcome & you&#39;re right -- we all go through many stages. I remember<br/>\nespecially &quot;macho&quot; periods at around ages 4 and 8. Then I have a photo of<br/>\nCassidy&#39;s 9th birthday showing 5 boys with their extremely cute and cuddly<br/>\nPound Puppies (little stuffed dogs).<br/>\n<br/>\nHave faith in your son&#39;s wisdom in following his particular path to<br/>\nadulthood. And have faith in your own wisdom and love -- be prepared to love<br/>\nand support a &quot;totally offensive wrestler&quot; if that turns out to be his path<br/>\nof bliss. I bet (I hope) Jesse Ventura&#39;s mother loves him!<br/>\n<br/>\nLuz</div>","specialLinks":[]},{"userId":68872153,"authorName":"julie means","from":"&quot;julie means&quot; &lt;jmeans@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"recovered formerly schooled kids","postDate":"1026647707","msgId":39181,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMjMwMWMyMmIyZCQ0ZDQ5YTU3MCRiMTM3MmNjZkBsNWw2YzA+","referencesHeader":"PDE0YS4xMGIyNjhkYS4yYTYwMmE0ZkBhb2wuY29tPg=="},"prevInTopic":39177,"nextInTopic":39186,"prevInTime":39180,"nextInTime":39182,"topicId":39165,"numMessagesInTopic":0,"msgSnippet":"thanks to sandra, and luz, and linda for posting their words of encouragement on whether the damage caused by schools is permanent or not. i guess i m thinking","messageBody":"<div id=\"ygrps-yiv-1844762127\">thanks to sandra, and luz, and linda for posting their words of encouragement on whether the damage caused by schools is permanent or not.  <br/>\n<br/>\ni guess i&#39;m thinking that it&#39;s possible that some damage might be permanent, but life itself - the great unschool itself! - is so full of challenges that parents sometimes have no control over. we can&#39;t raise a child completely free of negative consequences to his personality no matter how hard we may try.  and who is to say what damage is caused by the school experience, and what is caused by other factors, like moving a lot, or experiencing divorce, etc.<br/>\n<br/>\nwe do the best we can and love them.  <br/>\n<br/>\njulie<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a> <br/>\n  Sent: Friday, July 12, 2002 8:49 AM<br/>\n  Subject: Re: [Unschooling-dotcom] recovered formerly schooled kids<br/>\n<br/>\n<br/>\n<br/>\n  In a message dated 7/12/02 6:02:31 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jmeans@...\">jmeans@...</a> writes:<br/>\n<br/>\n  &lt;&lt; we are going thru this process now with kian, my 10 year old, and i just <br/>\n  read some very disturbing viewpoints on another list....beginning with <br/>\n  personality change and permanent damage after 2 years of schooling; &gt;&gt;<br/>\n<br/>\n  You can&#39;t go back, though, only forward.<br/>\n  If there were no problems you probably wouldn&#39;t be taking him out of school.  <br/>\n  And at this point your choice is keep him out or put him back in, right?  So <br/>\n  don&#39;t look back.  Don&#39;t look far into the future.  Look now.<br/>\n<br/>\n  Boys hang out at our house.  One, Jesse, was an only child and came to <br/>\n  homeschooling from Montessori when he was eight.  Jesse had that look of hurt <br/>\n  confusion, was quiet and wouldn&#39;t make eye contact with anyone at first, and <br/>\n  then for a while wouldn&#39;t with adults but would with kids.  Within a year he <br/>\n  softened up and started to trust people and have fun.  Soon he was talking to <br/>\n  me on his own, not just giving short answers to direct questions.  <br/>\n<br/>\n  Had Jesse stayed in school, I think he would have continued to shut down <br/>\n  until he became sneaky and destructive of himself and others.  That didn&#39;t <br/>\n  happen.<br/>\n<br/>\n  Jimmie was ten at first, defensive, and hostile, and quick to blame other <br/>\n  people for anything and everything.  The slightest rejection got a BIG <br/>\n  reaction.  Other kids found him rude and whiney.  He started to soften up, <br/>\n  get more patience (which tends to come naturally with age anyway), and to see <br/>\n  other kids not as competitors or threats, but as sources and resources and <br/>\n  companions.  (He&#39;s not totally unschooling, having a nervous dad.)<br/>\n<br/>\n  Logan was zippy, jittery and self conscious, a show-off and constantly in <br/>\n  need of recognition (for just anything--clothes, jokes, knowledge, stunts) <br/>\n  and attention.  He left mid-school, found his routines weren&#39;t impressing the <br/>\n  homeschoolers, and started finding his authentic self.  I more often hear him <br/>\n  conversing to get and share information, rather than just to create <br/>\n  reactions.  <br/>\n<br/>\n  Joey&#39;s really quiet, and was in tenth grade when his mom took him out of <br/>\n  school last winter.  He has a violent, unpredictable older brother at home, <br/>\n  so he avoids home sometimes.  But in the six months since he left school he <br/>\n  has become open to the world in a visceral way.  He used to be tense and <br/>\n  small, drawing in and trying to be invisible.  That has softened up <br/>\n  noticeably.  His posture&#39;s better, he&#39;s not afraid of humor, he&#39;s not flinchy <br/>\n  the way he was.  He&#39;s unfolding.<br/>\n<br/>\n  School was hurting every one of them.  They left at all different stages, but <br/>\n  they all got better within months or a year.  Not as good as if they had <br/>\n  never been, but better than if they had stayed.<br/>\n<br/>\n  I get my kids&#39; reviews on these guys too.  When we were the host family for <br/>\n  weekly meetings, I&#39;d know for SURE which new kids were difficult and would <br/>\n  hear the details afterward.  So it wasn&#39;t just my own perceptions, but also <br/>\n  the kids&#39; reviews and progress reports from week to week, so the progress <br/>\n  showed in a &quot;three-D&quot; way.  And I also heard feedback from the moms.<br/>\n<br/>\n  But some kids are more resilient, and they take school in stride and it <br/>\n  doesn&#39;t harm them as much.  So children will react to the lack of school <br/>\n  differently.  Some do it verbally.  &quot;Starting now I don&#39;t have to do <br/>\n  schoolwork anymore and can read what I want to and do my own projects!  <br/>\n  COOL!&quot; and that&#39;s it.  They get it. Others have to feel it gradually, with <br/>\n  their schedules and emotions and responses.  <br/>\n<br/>\n  I know one boy whose life is odd, and he doesn&#39;t seem like the other <br/>\n  homeschoolers in lots of ways.  So in his case I can only think how much <br/>\n  worse it would be if he were in school.  Kids would torment him constantly.  <br/>\n  So outside he&#39;s not fully flowering into an easy-going communicator, but I <br/>\n  don&#39;t doubt that he will mature in his own time and get a job and find <br/>\n  friends with similar interests when he&#39;s older.  I remember kids like that <br/>\n  from my own childhood who showed no signs of maturity or awareness until <br/>\n  their late teens, and then they did all their growing in just a couple of <br/>\n  years and became suave, pretty-together adults.  (And they weren&#39;t even home<br/>\n  schooled, although I think in several cases getting out of school was the <br/>\n  turning point for them.)<br/>\n<br/>\n  Sandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  If you have questions, concerns or problems with this list, please email the Moderator, Joyce Fetteroll, at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a><br/>\n<br/>\n  To unsubscribe from this group, send an email to:<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-unsubscribe@yahoogroups.com\">Unschooling-dotcom-unsubscribe@yahoogroups.com</a><br/>\n<br/>\n  Visit the Unschooling website: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> <br/>\n<br/>\n  Your use of Yahoo! Groups is subject to <a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a> <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":92305498,"authorName":"llindsey","from":"&quot;llindsey&quot; &lt;llindsey@...&gt;","profile":"lllindsey","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: recovered formerly schooled kids","postDate":"1026617474","msgId":39177,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNkMzBmMDgyLjMzOWEuMTgwNDI4OTM4M0B3dC5uZXQ+"},"prevInTopic":39176,"nextInTopic":39181,"prevInTime":39176,"nextInTime":39178,"topicId":39165,"numMessagesInTopic":0,"msgSnippet":"wow.. thanks so much for posting these bits ... it is very encouraging to me.. My son, 8, is now free of school... and i, too am seeing some difference","messageBody":"<div id=\"ygrps-yiv-2116025101\">wow.. thanks so much for posting these bits ... it is very<br/>\nencouraging to me.. My son, 8, is now free of school... and<br/>\ni, too am seeing some difference already.. (and i&#39;ts still<br/>\nsummer.) i am really really trying to convince myself that<br/>\nhis obsession with wrestling and behaving just like the<br/>\ntotally offensive wrestlers on tv is not to be worried too<br/>\nmuch about.. i am sure he will eventually lose the need to<br/>\nbe so obnoxious... (please, somebody, tell me i am right...<br/>\n)<br/>\n<br/>\ni told him that the worst i would do about school is to hand<br/>\nhim the booklet that explains (in rediculously obscure<br/>\n&#39;educatoreze&#39; what fourth graders are supposed to be<br/>\nlearning in his district.. i said he could check it out and<br/>\nsee what he already knows and ck out the other stuff in case<br/>\nhe might find something he&#39;s curious about..<br/>\n<br/>\ni am really trying to keep it at that. .. (besides.. i can<br/>\ntell his dad.. oh  yeah.. we&#39;re going by this list of things<br/>\nhe&#39;s sposed to know.. )...<br/>\n<br/>\nLinda LL<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt;<br/>\n&gt;<br/>\n&gt; &lt;tt&gt;<br/>\n&gt; on 7/13/02 12:58 AM, Unschooling-dotcom@yahoogroups.com<br/>\n&gt; at&lt;BR&gt; Unschooling-dotcom@yahoogroups.com wrote:&lt;BR&gt;<br/>\n&gt; &lt;BR&gt;<br/>\n&gt; &gt; Date: Fri, 12 Jul 2002 08:08:11 -0400&lt;BR&gt;<br/>\n&gt; &gt; From: &quot;julie means&quot;<br/>\n&gt; &lt;jmeans@...&gt;&lt;BR&gt; &gt; Subject: recovered<br/>\n&gt; formerly schooled kids&lt;BR&gt; &gt; &lt;BR&gt;<br/>\n&gt; &gt; does anyone have any positive stories to tell about<br/>\n&gt; the &quot;recovery&quot;&lt;BR&gt; &gt; of kids who were sent to<br/>\n&gt; school and then unschooled?&lt;BR&gt; &gt; &lt;BR&gt;<br/>\n&gt; &lt;BR&gt;<br/>\n&gt; Hi Julie-&lt;BR&gt;<br/>\n&gt; &lt;BR&gt;<br/>\n&gt; I went back through letters we&#39;ve received and found some<br/>\n&gt; encouraging&lt;BR&gt; stories.&lt;BR&gt;<br/>\n&gt; &lt;BR&gt;<br/>\n&gt; Luz&lt;BR&gt;<br/>\n&gt; &lt;BR&gt;<br/>\n&gt; ~~~~~~~~&lt;BR&gt;<br/>\n&gt; &lt;BR&gt;<br/>\n&gt; We took our son out of third grade when his teacher began<br/>\n&gt; punishing him for&lt;BR&gt; not completing the required work;<br/>\n&gt; work that was well beneath his level. I am&lt;BR&gt; hopeful<br/>\n&gt; that the few years he spent in the educational system has<br/>\n&gt; not&lt;BR&gt; dampened his natural learning ability. ... I<br/>\n&gt; realize now that he was mostly&lt;BR&gt; just passing time. In<br/>\n&gt; the beginning of our &quot;home&quot; schooling, I thought<br/>\n&gt; he&lt;BR&gt; needed some structured time every day that was<br/>\n&gt; reserved for learning. We&lt;BR&gt; used some of the educational<br/>\n&gt; computer games from JumpStart, some educational&lt;BR&gt; videos<br/>\n&gt; from the library, and some programming from a couple of<br/>\n&gt; educational&lt;BR&gt; channels. While he was cooperative at<br/>\n&gt; first, he soon started to resist this&lt;BR&gt; forced<br/>\n&gt; education. It became obvious to me that I was going<br/>\n&gt; against his&lt;BR&gt; natural instinct to learn by requiring his<br/>\n&gt; cooperation on my timetable. I&lt;BR&gt; discovered that I was<br/>\n&gt; the one who needed to deschool!&lt;BR&gt; &lt;BR&gt;<br/>\n&gt; Since we began unschooling him, he has immersed himself in<br/>\n&gt; his video and&lt;BR&gt; computer games. He scours the internet<br/>\n&gt; looking for cheat codes and reads the&lt;BR&gt; guidebooks cover<br/>\n&gt; to cover. He most recently acquired a Gameshark device<br/>\n&gt; for&lt;BR&gt; his Nintendo 64 which allows code hacking. He<br/>\n&gt; enjoys watching amine&lt;BR&gt; cartoons, especially Digimon,<br/>\n&gt; Zoids, Sailor Moon and the like. Last night he&lt;BR&gt; told me<br/>\n&gt; he wished he possessed the power of telekinesis and<br/>\n&gt; psychic&lt;BR&gt; abilities like a character in one of those<br/>\n&gt; shows!&lt;BR&gt; &lt;BR&gt;<br/>\n&gt; ~~~~~~~~&lt;BR&gt;<br/>\n&gt; &lt;BR&gt;<br/>\n&gt; ... we&#39;ve been unschooling ever since I desperately wrote<br/>\n&gt; to you about three&lt;BR&gt; years ago when K announced that she<br/>\n&gt; hated reading.  We have been&lt;BR&gt; extremely satisfied<br/>\n&gt; and encouraged by the learning that she has undertaken&lt;BR&gt;<br/>\n&gt; all by herself (drum roll please)!&lt;BR&gt; &lt;BR&gt;<br/>\n&gt; ~~~~~~~~~~&lt;BR&gt;<br/>\n&gt; &lt;BR&gt;<br/>\n&gt; ... I had no plans to homeschool until I realized how much<br/>\n&gt; pressure school&lt;BR&gt; was putting on G (age 8), and how much<br/>\n&gt; she was being not herself in order to&lt;BR&gt; fit in. When I<br/>\n&gt; realized and really accepted how toxic  even a<br/>\n&gt; relatively&lt;BR&gt; sweet place like the school they were going<br/>\n&gt; to actually was, I didn&#39;t have&lt;BR&gt; any choice.  now I<br/>\n&gt; am looking forward so incredibly much to the entire&lt;BR&gt;<br/>\n&gt; experience, and a heavy weight has lifted from the girls<br/>\n&gt; and from me as&lt;BR&gt; well. In the week G has been home since<br/>\n&gt; school ended, the contours of her&lt;BR&gt; face have actually<br/>\n&gt; changed and relaxed.&lt;BR&gt; &lt;BR&gt;<br/>\n&gt; ~~~~~~~~~~~&lt;BR&gt;<br/>\n&gt; &lt;BR&gt;<br/>\n&gt;  I am excited about getting my wonderful caring,<br/>\n&gt; sensitive,  inquisitive,&lt;BR&gt; HAPPY (15 yr old) son<br/>\n&gt; back.  He already is happier and more relaxed.  &lt;BR&gt;<br/>\n&gt; Perhaps it is just a coincidence, but since he left public<br/>\n&gt; school one month&lt;BR&gt; ago, a read bad case of acne which<br/>\n&gt; was covering his face has cleared up&lt;BR&gt; almost<br/>\n&gt; completely!  ....  By the way, M. spend the day<br/>\n&gt; figuring out how to&lt;BR&gt; use a new digital video <br/>\n&gt; recorder that he is going to take on our coming&lt;BR&gt; trip<br/>\n&gt; to Alaska.  He will be  able to edit his footage, put<br/>\n&gt; a narration to&lt;BR&gt; it, and add music.  He couldn&#39;t <br/>\n&gt; believe that he didn&#39;t have to do algebra&lt;BR&gt; today and<br/>\n&gt; that he could spend the  whole day on the  video<br/>\n&gt; recorder project.&lt;BR&gt;  &lt;BR&gt;<br/>\n&gt; ~~~~~~~~~~~~&lt;BR&gt;<br/>\n&gt; &lt;BR&gt;<br/>\n&gt; I was deeply challenged by your talk on unschooling . As I<br/>\n&gt; said there at the&lt;BR&gt; meeting, my son is the perfect<br/>\n&gt; candidate for this way of learning and&lt;BR&gt; experiencing<br/>\n&gt; the world. That night when I got home, I went into his<br/>\n&gt; room and&lt;BR&gt; apologized to him for forcing him to stop<br/>\n&gt; doing what he loved in order to do&lt;BR&gt; workbooks. He<br/>\n&gt; laughed and said, &quot;I accept your apology. Does that<br/>\n&gt; mean you&lt;BR&gt; won&#39;t stop me from typing next time?&quot; I<br/>\n&gt; said, &quot;Yes, that&#39;s exactly what that&lt;BR&gt; means.&quot;<br/>\n&gt; And I can envision my daughter reading all day, day after<br/>\n&gt; day. She&lt;BR&gt; loves books just like her mother. What great<br/>\n&gt; adventures lie ahead for us&lt;BR&gt; all. I know it will be a<br/>\n&gt; big adjustment for me to no longer fill in the plan&lt;BR&gt;<br/>\n&gt; book for the week ahead of time, and rotate my writing to<br/>\n&gt; a form of&lt;BR&gt; recording what they have done on their<br/>\n&gt; own.&lt;BR&gt; &lt;BR&gt;<br/>\n&gt; But I already feel like a burden has been lifted in terms<br/>\n&gt; of my expectations&lt;BR&gt; and plans and need to be in control<br/>\n&gt; of the process. I look back and shake my&lt;BR&gt; head at all<br/>\n&gt; the times I stopped them from painting, reading,<br/>\n&gt; drawing,&lt;BR&gt; playing games, and doing LEGOs -- among other<br/>\n&gt; things and practically shoved&lt;BR&gt; them to the table for<br/>\n&gt; &quot;school.&quot; Ouch!!! So much to learn. So much<br/>\n&gt; to&lt;BR&gt; experience. For them and for me.&lt;BR&gt;<br/>\n&gt; &lt;BR&gt;<br/>\n&gt; ~~~~~~~~&lt;BR&gt;<br/>\n&gt; &lt;BR&gt;<br/>\n&gt;  It seems easy enough to see (8 yr old) A&#39;s journey has<br/>\n&gt; already&lt;BR&gt; begun in all the months of my NOT ball &<br/>\n&gt; chaining him to a chair with Mount&lt;BR&gt; Book-a-thon. <br/>\n&gt; He has become an incredibly pleasant person to be around<br/>\n&gt; since&lt;BR&gt; our telephone chat.  I told him his<br/>\n&gt; education was his up to him... He was&lt;BR&gt; beaming and<br/>\n&gt; caught on immediately. Sure, birds just KNOW how to<br/>\n&gt; fly!&lt;BR&gt; &lt;BR&gt;<br/>\n&gt; &lt;BR&gt;<br/>\n&gt; &lt;BR&gt;<br/>\n&gt; &lt;/tt&gt;<br/>\n&gt;<br/>\n&gt; &lt;br&gt;<br/>\n&gt;<br/>\n&gt; &lt;!-- |**|begin egp html banner|**| --&gt;<br/>\n&gt;<br/>\n&gt; &lt;table border=0 cellspacing=0 cellpadding=2&gt;<br/>\n&gt; &lt;tr bgcolor=#FFFFCC&gt;<br/>\n&gt; &lt;td alignÎnter&gt;&lt;font size=&quot;-1&quot; color=#003399&gt;&lt;b&gt;Yahoo!<br/>\n&gt; Groups Sponsor&lt;/b&gt;&lt;/font&gt;&lt;/td&gt; &lt;/tr&gt;<br/>\n&gt; &lt;tr bgcolor=#FFFFFF&gt;<br/>\n&gt; &lt;td alignÎnter widthG0&gt;&lt;img<br/>\n&gt; src=&quot;http://us.a1.yimg.com/us.yimg.com/a/le/lensexpress/le<br/>\n&gt; nsexpress_468x60b.gif&quot; width=&quot;468&quot; height=&quot;60&quot;<br/>\n&gt; usemap=&quot;#Map&quot; border=&quot;0&quot;&gt; &lt;map name=&quot;Map&quot;&gt; &lt;area<br/>\n&gt; shape=&quot;rect&quot; coords=&quot;430,15,457,42&quot;<br/>\n&gt; href=&quot;http://rd.yahoo.com/M&quot;5674.2075964.3644785.1829184<br/>\n&gt; /D=egroupweb/S\u001705081972:HM/A\u001153174/R=0/*http://www.len<br/>\n&gt; sexpress.com/tracker/trackclick.aspx?Page=Contacts&AffUrl&gt; 280&AffCode\u0015&quot; target=&quot;_blank&quot; alt=&quot;Click here for more<br/>\n&gt; selections...&quot; title=&quot;Click here for more selections...&quot;&gt;<br/>\n&gt; &lt;area shape=&quot;rect&quot; coords=&quot;3,6,162,56&quot;<br/>\n&gt; href=&quot;http://rd.yahoo.com/M&quot;5674.2075964.3644785.1829184<br/>\n&gt; /D=egroupweb/S\u001705081972:HM/A\u001153174/R=1/*http://www.len<br/>\n&gt; sexpress.com/tracker/trackclick.aspx?Page=Home Page&AffU<br/>\n&gt; rl&#39;4&AffCode\u0015&quot; target=&quot;_blank&quot; alt=&quot;Click here to<br/>\n&gt; visit LensExpress.com&quot; title=&quot;Click here to visit<br/>\n&gt; LensExpress.com&quot;&gt; &lt;area shape=&quot;rect&quot;<br/>\n&gt; coords=&quot;174,18,220,41&quot;<br/>\n&gt; href=&quot;http://rd.yahoo.com/M&quot;5674.2075964.3644785.1829184<br/>\n&gt; /D=egroupweb/S\u001705081972:HM/A\u001153174/R=2/*http://www.len<br/>\n&gt; sexpress.com/tracker/trackclick.aspx?Page¬UVUE 2 Col<br/>\n&gt; ors&AffUrl&#39;5&AffCode\u0015&quot; target=&quot;_blank&quot; alt=&quot;Avucue2<br/>\n&gt; Colours&quot; title=&quot;Avucue2 Colours&quot;&gt; &lt;area shape=&quot;rect&quot;<br/>\n&gt; coords=&quot;224,18,264,40&quot;<br/>\n&gt; href=&quot;http://rd.yahoo.com/M&quot;5674.2075964.3644785.1829184<br/>\n&gt; /D=egroupweb/S\u001705081972:HM/A\u001153174/R=3/*http://www.len<br/>\n&gt; sexpress.com/tracker/trackclick.aspx?Page¬UVUE_Disposabl<br/>\n&gt; es&AffUrl&#39;6&AffCode\u0015&quot; target=&quot;_blank&quot; alt=&quot;ACUVUE<br/>\n&gt; Disposables&quot; title=&quot;ACUVUE Disposables&quot;&gt; &lt;area<br/>\n&gt; shape=&quot;rect&quot; coords=&quot;270,17,320,41&quot;<br/>\n&gt; href=&quot;http://rd.yahoo.com/M&quot;5674.2075964.3644785.1829184<br/>\n&gt; /D=egroupweb/S\u001705081972:HM/A\u001153174/R=4/*http://www.len<br/>\n&gt; sexpress.com/tracker/trackclick.aspx?Page=FreshLook_Colorb<br/>\n&gt; lends&AffUrl&#39;7&AffCode\u0015&quot; target=&quot;_blank&quot;<br/>\n&gt; alt=&quot;FreshLook Colorblends Disposables&quot; title=&quot;FreshLook<br/>\n&gt; Colorblends Disposables&quot;&gt; &lt;area shape=&quot;rect&quot;<br/>\n&gt; coords=&quot;322,15,376,42&quot;<br/>\n&gt; href=&quot;http://rd.yahoo.com/M&quot;5674.2075964.3644785.1829184<br/>\n&gt; /D=egroupweb/S\u001705081972:HM/A\u001153174/R=5/*http://www.len<br/>\n&gt; sexpress.com/tracker/trackclick.aspx?Page=Focus_Night&Day&<br/>\n&gt; AffUrl&#39;8&AffCode\u0015&quot; target=&quot;_blank&quot; alt=&quot;Focus Night<br/>\n&gt; & Day Continous Wear&quot; title=&quot;Focus Night & Day<br/>\n&gt; Continous Wear&quot;&gt; &lt;area shape=&quot;rect&quot; coords=&quot;377,15,428,43&quot;<br/>\n&gt; href=&quot;http://rd.yahoo.com/M&quot;5674.2075964.3644785.1829184<br/>\n&gt; /D=egroupweb/S\u001705081972:HM/A\u001153174/R=6/*http://www.len<br/>\n&gt; sexpress.com/tracker/trackclick.aspx?Page=Wild_Eyes&AffUrl<br/>\n&gt; &#39;9&AffCode\u0015&quot; target=&quot;_blank&quot; alt=&quot;Get Wild... with<br/>\n&gt; Wild Eyes!&quot; title=&quot;Get Wild... with Wild Eyes!&quot;&gt;<br/>\n&gt; &lt;/map&gt;&lt;center&gt;&lt;a<br/>\n&gt; href=&quot;http://rd.yahoo.com/M&quot;5674.2075964.3644785.1829184<br/>\n&gt; /D=egroupweb/S\u001705081972:HM/A\u001153174/R=7/*http://www.len<br/>\n&gt; sexpress.com&quot;&gt;Click here to find your contact<br/>\n&gt; lenses!&lt;/a&gt;&lt;/center&gt;&lt;/td&gt; &lt;/tr&gt;<br/>\n&gt; &lt;/table&gt;<br/>\n&gt;<br/>\n&gt; &lt;!-- |**|end egp html banner|**| --&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &lt;br&gt;<br/>\n&gt; &lt;tt&gt;<br/>\n&gt; If you have questions, concerns or problems with this<br/>\n&gt; list, please email the Moderator, Joyce Fetteroll, at<br/>\n&gt; fetteroll@...&lt;BR&gt; &lt;BR&gt;<br/>\n&gt; To unsubscribe from this group, send an email to:&lt;BR&gt;<br/>\n&gt; Unschooling-dotcom-unsubscribe@yahoogroups.com&lt;BR&gt;<br/>\n&gt; &lt;BR&gt;<br/>\n&gt; Visit the Unschooling website: &lt;a<br/>\n&gt; href=&quot;http://www.unschooling.com&quot;&gt;http://www.unschooling.c<br/>\n&gt; om&lt;/a&gt;&lt;/tt&gt; &lt;br&gt;<br/>\n&gt;<br/>\n&gt; &lt;br&gt;<br/>\n&gt; &lt;tt&gt;Your use of Yahoo! Groups is subject to the &lt;a<br/>\n&gt; href=&quot;http://docs.yahoo.com/info/terms/&quot;&gt;Yahoo! Terms of<br/>\n&gt; Service&lt;/a&gt;.&lt;/tt&gt; &lt;/br&gt;<br/>\n&gt;<br/>\n&gt; &lt;/body&gt;&lt;/html&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":2300774,"authorName":"Betsy","from":"Betsy &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: recovered formerly schooled kids","postDate":"1026614100","msgId":39176,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNEMzBFMzU0LkIyREQ0OTQ2QGVhcnRobGluay5uZXQ+","referencesHeader":"PEI5NTY0RDlBLkVDRiVuZWR2YXJlQG50cGx4Lm5ldD4="},"prevInTopic":39175,"nextInTopic":39177,"prevInTime":39175,"nextInTime":39177,"topicId":39165,"numMessagesInTopic":0,"msgSnippet":"**He enjoys watching amine cartoons, especially Digimon, Zoids, Sailor Moon and the like. Last night he told me he wished he possessed the power of telekinesis","messageBody":"<div id=\"ygrps-yiv-2100733101\">**He enjoys watching amine<br/>\ncartoons, especially Digimon, Zoids, Sailor Moon and the like. Last<br/>\nnight he<br/>\ntold me he wished he possessed the power of telekinesis and psychic<br/>\nabilities like a character in one of those shows!**<br/>\n<br/>\nThis sounds a bit familiar!  My son&#39;s a big Pokemon fan, and often when<br/>\nwe get on the freeway he tells me, &quot;if we had the powers of an Abra,<br/>\nwe&#39;d be there by now!&quot;<br/>\n<br/>\nBetsy</div>","specialLinks":[]},{"userId":36888606,"authorName":"Luz Shosie and Ned Vare","from":"Luz Shosie and Ned Vare &lt;nedvare@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: recovered formerly schooled kids","postDate":"1026611936","msgId":39175,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI5NTY0RDlBLkVDRiVuZWR2YXJlQG50cGx4Lm5ldD4=","inReplyToHeader":"PDEwMjY1MzYzMTAuMjM5LjcyODg1Lm0xMkB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":39166,"nextInTopic":39176,"prevInTime":39174,"nextInTime":39176,"topicId":39165,"numMessagesInTopic":0,"msgSnippet":"on 7/13/02 12:58 AM, Unschooling-dotcom@yahoogroups.com at ... Hi Julie- I went back through letters we ve received and found some encouraging stories. Luz ","messageBody":"<div id=\"ygrps-yiv-804646394\">on 7/13/02 12:58 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a> at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Date: Fri, 12 Jul 2002 08:08:11 -0400<br/>\n&gt; From: &quot;julie means&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jmeans@...\">jmeans@...</a>&gt;<br/>\n&gt; Subject: recovered formerly schooled kids<br/>\n&gt; <br/>\n&gt; does anyone have any positive stories to tell about the &quot;recovery&quot;<br/>\n&gt; of kids who were sent to school and then unschooled?<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Hi Julie-<br/>\n<br/>\nI went back through letters we&#39;ve received and found some encouraging<br/>\nstories.<br/>\n<br/>\nLuz<br/>\n<br/>\n~~~~~~~~<br/>\n<br/>\nWe took our son out of third grade when his teacher began punishing him for<br/>\nnot completing the required work; work that was well beneath his level. I am<br/>\nhopeful that the few years he spent in the educational system has not<br/>\ndampened his natural learning ability. ... I realize now that he was mostly<br/>\njust passing time. In the beginning of our &quot;home&quot; schooling, I thought he<br/>\nneeded some structured time every day that was reserved for learning. We<br/>\nused some of the educational computer games from JumpStart, some educational<br/>\nvideos from the library, and some programming from a couple of educational<br/>\nchannels. While he was cooperative at first, he soon started to resist this<br/>\nforced education. It became obvious to me that I was going against his<br/>\nnatural instinct to learn by requiring his cooperation on my timetable. I<br/>\ndiscovered that I was the one who needed to deschool!<br/>\n<br/>\nSince we began unschooling him, he has immersed himself in his video and<br/>\ncomputer games. He scours the internet looking for cheat codes and reads the<br/>\nguidebooks cover to cover. He most recently acquired a Gameshark device for<br/>\nhis Nintendo 64 which allows code hacking. He enjoys watching amine<br/>\ncartoons, especially Digimon, Zoids, Sailor Moon and the like. Last night he<br/>\ntold me he wished he possessed the power of telekinesis and psychic<br/>\nabilities like a character in one of those shows!<br/>\n<br/>\n~~~~~~~~<br/>\n<br/>\n... we&#39;ve been unschooling ever since I desperately wrote to you about three<br/>\nyears ago when K announced that she hated reading.  We have been<br/>\nextremely satisfied and encouraged by the learning that she has undertaken<br/>\nall by herself (drum roll please)!<br/>\n<br/>\n~~~~~~~~~~<br/>\n<br/>\n... I had no plans to homeschool until I realized how much pressure school<br/>\nwas putting on G (age 8), and how much she was being not herself in order to<br/>\nfit in. When I realized and really accepted how toxic  even a relatively<br/>\nsweet place like the school they were going to actually was, I didn&#39;t have<br/>\nany choice.  now I am looking forward so incredibly much to the entire<br/>\nexperience, and a heavy weight has lifted from the girls and from me as<br/>\nwell. In the week G has been home since school ended, the contours of her<br/>\nface have actually changed and relaxed.<br/>\n<br/>\n~~~~~~~~~~~<br/>\n<br/>\n I am excited about getting my wonderful caring, sensitive,  inquisitive,<br/>\nHAPPY (15 yr old) son back.  He already is happier and more relaxed.  <br/>\nPerhaps it is just a coincidence, but since he left public school one month<br/>\nago, a read bad case of acne which was covering his face has cleared up<br/>\nalmost completely!  ....  By the way, M. spend the day figuring out how to<br/>\nuse a new digital video  recorder that he is going to take on our coming<br/>\ntrip to Alaska.  He will be  able to edit his footage, put a narration to<br/>\nit, and add music.  He couldn&#39;t  believe that he didn&#39;t have to do algebra<br/>\ntoday and that he could spend the  whole day on the  video recorder project.<br/>\n <br/>\n~~~~~~~~~~~~<br/>\n<br/>\nI was deeply challenged by your talk on unschooling . As I said there at the<br/>\nmeeting, my son is the perfect candidate for this way of learning and<br/>\nexperiencing the world. That night when I got home, I went into his room and<br/>\napologized to him for forcing him to stop doing what he loved in order to do<br/>\nworkbooks. He laughed and said, &quot;I accept your apology. Does that mean you<br/>\nwon&#39;t stop me from typing next time?&quot; I said, &quot;Yes, that&#39;s exactly what that<br/>\nmeans.&quot; And I can envision my daughter reading all day, day after day. She<br/>\nloves books just like her mother. What great adventures lie ahead for us<br/>\nall. I know it will be a big adjustment for me to no longer fill in the plan<br/>\nbook for the week ahead of time, and rotate my writing to a form of<br/>\nrecording what they have done on their own.<br/>\n<br/>\nBut I already feel like a burden has been lifted in terms of my expectations<br/>\nand plans and need to be in control of the process. I look back and shake my<br/>\nhead at all the times I stopped them from painting, reading, drawing,<br/>\nplaying games, and doing LEGOs -- among other things and practically shoved<br/>\nthem to the table for &quot;school.&quot; Ouch!!! So much to learn. So much to<br/>\nexperience. For them and for me.<br/>\n<br/>\n~~~~~~~~<br/>\n<br/>\n It seems easy enough to see (8 yr old) A&#39;s journey has already<br/>\nbegun in all the months of my NOT ball & chaining him to a chair with Mount<br/>\nBook-a-thon.  He has become an incredibly pleasant person to be around since<br/>\nour telephone chat.  I told him his education was his up to him... He was<br/>\nbeaming and caught on immediately. Sure, birds just KNOW how to fly!</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] recovered formerly schooled kids","postDate":"1026478159","msgId":39166,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0YS4xMGIyNjhkYS4yYTYwMmE0ZkBhb2wuY29tPg=="},"prevInTopic":39165,"nextInTopic":39175,"prevInTime":39165,"nextInTime":39167,"topicId":39165,"numMessagesInTopic":0,"msgSnippet":"In a message dated 7/12/02 6:02:31 AM, jmeans@ptd.net writes: ","messageBody":"<div id=\"ygrps-yiv-71456531\">In a message dated 7/12/02 6:02:31 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jmeans@...\">jmeans@...</a> writes:<br/>\n<br/>\n&lt;&lt; we are going thru this process now with kian, my 10 year old, and i just <br/>\nread some very disturbing viewpoints on another list....beginning with <br/>\npersonality change and permanent damage after 2 years of schooling; &gt;&gt;<br/>\n<br/>\nYou can&#39;t go back, though, only forward.<br/>\nIf there were no problems you probably wouldn&#39;t be taking him out of school.  <br/>\nAnd at this point your choice is keep him out or put him back in, right?  So <br/>\ndon&#39;t look back.  Don&#39;t look far into the future.  Look now.<br/>\n<br/>\nBoys hang out at our house.  One, Jesse, was an only child and came to <br/>\nhomeschooling from Montessori when he was eight.  Jesse had that look of hurt <br/>\nconfusion, was quiet and wouldn&#39;t make eye contact with anyone at first, and <br/>\nthen for a while wouldn&#39;t with adults but would with kids.  Within a year he <br/>\nsoftened up and started to trust people and have fun.  Soon he was talking to <br/>\nme on his own, not just giving short answers to direct questions.  <br/>\n<br/>\nHad Jesse stayed in school, I think he would have continued to shut down <br/>\nuntil he became sneaky and destructive of himself and others.  That didn&#39;t <br/>\nhappen.<br/>\n<br/>\nJimmie was ten at first, defensive, and hostile, and quick to blame other <br/>\npeople for anything and everything.  The slightest rejection got a BIG <br/>\nreaction.  Other kids found him rude and whiney.  He started to soften up, <br/>\nget more patience (which tends to come naturally with age anyway), and to see <br/>\nother kids not as competitors or threats, but as sources and resources and <br/>\ncompanions.  (He&#39;s not totally unschooling, having a nervous dad.)<br/>\n<br/>\nLogan was zippy, jittery and self conscious, a show-off and constantly in <br/>\nneed of recognition (for just anything--clothes, jokes, knowledge, stunts) <br/>\nand attention.  He left mid-school, found his routines weren&#39;t impressing the <br/>\nhomeschoolers, and started finding his authentic self.  I more often hear him <br/>\nconversing to get and share information, rather than just to create <br/>\nreactions.  <br/>\n<br/>\nJoey&#39;s really quiet, and was in tenth grade when his mom took him out of <br/>\nschool last winter.  He has a violent, unpredictable older brother at home, <br/>\nso he avoids home sometimes.  But in the six months since he left school he <br/>\nhas become open to the world in a visceral way.  He used to be tense and <br/>\nsmall, drawing in and trying to be invisible.  That has softened up <br/>\nnoticeably.  His posture&#39;s better, he&#39;s not afraid of humor, he&#39;s not flinchy <br/>\nthe way he was.  He&#39;s unfolding.<br/>\n<br/>\nSchool was hurting every one of them.  They left at all different stages, but <br/>\nthey all got better within months or a year.  Not as good as if they had <br/>\nnever been, but better than if they had stayed.<br/>\n<br/>\nI get my kids&#39; reviews on these guys too.  When we were the host family for <br/>\nweekly meetings, I&#39;d know for SURE which new kids were difficult and would <br/>\nhear the details afterward.  So it wasn&#39;t just my own perceptions, but also <br/>\nthe kids&#39; reviews and progress reports from week to week, so the progress <br/>\nshowed in a &quot;three-D&quot; way.  And I also heard feedback from the moms.<br/>\n<br/>\nBut some kids are more resilient, and they take school in stride and it <br/>\ndoesn&#39;t harm them as much.  So children will react to the lack of school <br/>\ndifferently.  Some do it verbally.  &quot;Starting now I don&#39;t have to do <br/>\nschoolwork anymore and can read what I want to and do my own projects!  <br/>\nCOOL!&quot; and that&#39;s it.  They get it. Others have to feel it gradually, with <br/>\ntheir schedules and emotions and responses.  <br/>\n<br/>\nI know one boy whose life is odd, and he doesn&#39;t seem like the other <br/>\nhomeschoolers in lots of ways.  So in his case I can only think how much <br/>\nworse it would be if he were in school.  Kids would torment him constantly.  <br/>\nSo outside he&#39;s not fully flowering into an easy-going communicator, but I <br/>\ndon&#39;t doubt that he will mature in his own time and get a job and find <br/>\nfriends with similar interests when he&#39;s older.  I remember kids like that <br/>\nfrom my own childhood who showed no signs of maturity or awareness until <br/>\ntheir late teens, and then they did all their growing in just a couple of <br/>\nyears and became suave, pretty-together adults.  (And they weren&#39;t even home<br/>\nschooled, although I think in several cases getting out of school was the <br/>\nturning point for them.)<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":68872153,"authorName":"julie means","from":"&quot;julie means&quot; &lt;jmeans@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"recovered formerly schooled kids","postDate":"1026475691","msgId":39165,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMjAwMWMyMjk5YyRjYjlhMjhiMCQ5YTM3MmNjZkBsNWw2YzA+"},"prevInTopic":0,"nextInTopic":39166,"prevInTime":39164,"nextInTime":39166,"topicId":39165,"numMessagesInTopic":0,"msgSnippet":"does anyone have any positive stories to tell about the recovery of kids who were sent to school and then unschooled?  we are going thru this process now","messageBody":"<div id=\"ygrps-yiv-486768942\">does anyone have any positive stories to tell about the &quot;recovery&quot;<br/>\n of kids who were sent to school and then unschooled?  we are going thru this process now with kian, my 10 year old, and i just read some very disturbing viewpoints on another list....beginning with personality change and permanent damage after 2 years of schooling; i couldn&#39;t read any further after that...very discouraging....any encouragement or happy stories would be greatly appreciated.<br/>\n<br/>\nthanks,<br/>\njulie<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":39178,"nextTopicId":39188}}