{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":78,"messages":[{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Faking interest in videogames","postDate":"1307604407","msgId":61478,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU4NzE4MS42MDAyMy5xbUB3ZWI4NzMwNS5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PGlzcDZiYSs0cGl2QGVHcm91cHMuY29tPg==","referencesHeader":"PGlzcDZiYSs0cGl2QGVHcm91cHMuY29tPg=="},"prevInTopic":61477,"nextInTopic":61479,"prevInTime":61477,"nextInTime":61479,"topicId":61427,"numMessagesInTopic":0,"msgSnippet":"________________________________ My seven year old doesn t need to have the full experience of aiming a  gun at a human, pulling then trigger, HEARING the hit","messageBody":"<div id=\"ygrps-yiv-578265999\">________________________________<br/>\nMy seven year old doesn&#39;t need to have the full experience of aiming a  gun at a <br/>\nhuman, pulling then trigger, HEARING the hit of the shrapnel  into the body <br/>\nalong with the  blood spurting, followed by, &quot; Fuckin yeah  I got him!!&quot; every 2 <br/>\nminutes for him and I to have a worthwhile,  healthy, gentle, loving, learning <br/>\nrelationship. <br/>\n<br/>\n-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------<br/>\n<br/>\n<br/>\nHas your son actually murdered someone? Really. He&#39;s got the full experience of <br/>\naiming a gun at a human? Really? And faced with that actually experience he <br/>\nkilled them and ululated over the body? Goodness, I think that&#39;s pretty scary. <br/>\nOr was he sitting in his living room, playing with some friends on-line, or <br/>\nmaybe just alone, and he made an amazing shot, a shot that he&#39;d wanted to make? <br/>\nIs the problem with separating the television from actual experience his or is <br/>\nit yours? He&#39;s not killed anyone, not any actual human. <br/>\n<br/>\n<br/>\nWhen Linnaea was 4 we stayed with her cousins. They had this game, oh I wish I <br/>\ncould remember the name, where you drove you around and did missions and killed <br/>\nparticular individuals. But it was a sandbox game, that is a game where you <br/>\ncould roam as well as follow the story line. And Linnaea really liked killing <br/>\npedestrians. She&#39;d just wander around and kill folks wandering about their daily <br/>\nlives. But she wasn&#39;t, she was playing a game in the way that she could. <br/>\n<br/>\n<br/>\nWhen she was 4 she was playing World of Warcraft. She didn&#39;t play it by doing <br/>\nthe quests, or by working on her skills. Mostly she would get me to play it and <br/>\nearn a bunch of money, move her up a few levels and then she would wander around <br/>\nand buy pets or go to the Auction House and buy pretty things. Did that mean she <br/>\nwas shopaholic? Did she have some kind of horrible addiction to shopping? Was <br/>\nher innocence gone with her desire to spend virtual money in a virtual realm? <br/>\nNope. She just liked playing WoW in the way that gave her the most pleasure at <br/>\n4. She doesn&#39;t play WoW very much these days. And when she does she runs through <br/>\ndungeons. Actually she doesn&#39;t buy much stuff these days. When she was littler <br/>\nshe wanted more things. Lots of baby dolls, lots of kitty in my pockets, lots of <br/>\nstuffed animals. It is a rare good that entices her now, at 11. In no small <br/>\npart, I think, because her desires were taken seriously when she was 4 and 5 and <br/>\n6 and 7. She wasn&#39;t needy, she isn&#39;t needy. Now she has over 60 pounds saved up <br/>\nfrom her allowance and I think the only thing she&#39;s looking at getting is a pair <br/>\nof Steampunk goggles. <br/>\n<br/>\n<br/>\nSimon plays a fair number of shoot &#39;em up games. He&#39;s got some serious skills <br/>\n(says a woman who can play in crouch for far too long). When he plays something <br/>\nlike Call of Duty he&#39;s mostly working on skills. Things like sniping or stealth. <br/>\nAnd he&#39;s less about number of kills. Linnaea plays some shoot &#39;em up games, but <br/>\nshe really likes the Fable series. And she likes to play with other people. At <br/>\nthe moment the favourite game is minecraft which is only a little bit about <br/>\nkilling. And the graphics are very unrealistic. Minecraft is really amazing. <br/>\nIt&#39;s a big part about programming, about modifying the existing game. People <br/>\nbuild the most amazing things on minecraft. Here&#39;s a trailer: <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.youtube.com/watch?v=FaMTedT6P0I.\">http://www.youtube.com/watch?v=FaMTedT6P0I.</a> Given a range of choices, a lifetime <br/>\nof experience, Simon and Linnaea are choosing, of their own free will, to play <br/>\nMinecraft instead of Halo 3 or World of Warcraft or Call of Duty or Fable 3 or <br/>\nFallout New Vegas or whatever else. And it isn&#39;t that I disapprove of any of <br/>\ntheir choices. These games are so beautiful. Borderlands is amazing in it&#39;s <br/>\nsheer volume of guns. Fable 3 has this fantastic karmic generator. Fallout 3, <br/>\nthe music, oh, I love the music. Halo 3 is funny and so fast and so sharp. And <br/>\nthe cooperative stuff, and the building stuff. Goodness. <br/>\n<br/>\n<br/>\nThe skill, the power, of killing another player, or an non playing character on <br/>\na game may be the apex of joy for your 7 year old right now and maybe that will <br/>\ncontinue for a long time. His skills will grow. His ability to see the scene, to <br/>\nread the area, like a contract archaeologist walking a line looking for evidence <br/>\nof human habitation, like a naturalist looking for the subtle movements or <br/>\nchange of light that signal the presence of a lizard or bird, will grow and will <br/>\nbe absolutely applicable to other aspects of his life. If you smother that joy, <br/>\nif you call it into check, if you make him smaller and limit him to those things <br/>\nwhich you approve of, how will that help? How will that work to produce the <br/>\nworthwhile, healthy, gentle, loving, learning relationship that you want? If <br/>\ninstead you see how hard what he is doing is, how much skill, how much focus, <br/>\nhow much work he is putting in to acquiring the skills, that seems to me a <br/>\nworthwhile, healthy, gentle, loving, learning relationship in the making. <br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[{"url":"http://www.youtube.com/embed/FaMTedT6P0I?wmode=opaque","type":"VIDEO"}]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Faking interest in videogames","postDate":"1307603651","msgId":61477,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJDMjgzNTJFLUJFNjktNDRENy1BOTE3LTQ5NUM5OEJCMzJGMkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDE3MzQzOS4yOTE5Mi5xbUB3ZWI4NzMxNS5tYWlsLmlyZC55YWhvby5jb20+","referencesHeader":"PGlzcDZiYSs0cGl2QGVHcm91cHMuY29tPiA8MTczNDM5LjI5MTkyLnFtQHdlYjg3MzE1Lm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":61476,"nextInTopic":61478,"prevInTime":61476,"nextInTime":61478,"topicId":61427,"numMessagesInTopic":0,"msgSnippet":"-=-pseudointellectualized-=- I ve been wondering what part of be nice and have fun with your kids and think of two choices and make the better one and","messageBody":"<div id=\"ygrps-yiv-3031080\">-=-pseudointellectualized-=-<br/>\n<br/>\nI&#39;ve been wondering what part of &quot;be nice&quot; and &quot;have fun with your kids&quot; and &quot;think of two choices and make the better one&quot; and &quot;breathe&quot; is the &quot;intellectualized&quot; part.   (or the pseudo-anything)<br/>\n<br/>\nFor years I&#39;ve been asking people to avoid jargon and fancy phrases in favor of simple, plain language.  <br/>\n<br/>\nI get accused of the damnedest things.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Faking interest in videogames","postDate":"1307602688","msgId":61476,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVGQ0UyQjJGLTAyNkYtNEM3MC1CRDkwLTVCRDU2Nzc0Q0YzMkBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PGlzcDZiYSs0cGl2QGVHcm91cHMuY29tPg==","referencesHeader":"PGlzcDZiYSs0cGl2QGVHcm91cHMuY29tPg=="},"prevInTopic":61475,"nextInTopic":61477,"prevInTime":61475,"nextInTime":61477,"topicId":61427,"numMessagesInTopic":0,"msgSnippet":"... But unschoolers frequently gauge their interactions with their kids in terms of the respect we might accord adults. Not so much I m the mom responses nor","messageBody":"<div id=\"ygrps-yiv-1903485872\"><blockquote><span title=\"ireply\">&gt; Sandra......we are not talking about our adult friends.<br/>\n<br/>\n </span></blockquote>But unschoolers frequently gauge their interactions with their kids in  <br/>\nterms of the respect we might accord adults. Not so much &quot;I&#39;m the mom&quot;  <br/>\nresponses nor &quot;I&#39;m your bff&quot; as giving respectful advice, help, and  <br/>\nsuggestions. Getting past our own stuff to look directly at our kids  <br/>\nand what they love (and maybe why they love it).<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My seven year old doesn&#39;t need to have the full experience of aiming  <br/>\n&gt; a gun at a human, pulling then trigger, HEARING the hit of the  <br/>\n&gt; shrapnel into the body along with the  blood spurting, followed by,  <br/>\n&gt; &quot; Fuckin yeah I got him!!&quot; every 2 minutes for him and I to have a  <br/>\n&gt; worthwhile, healthy, gentle, loving, learning relationship.<br/>\n<br/>\n </span></blockquote>I suggest anyone thinking this way read the links Sandra brought to  <br/>\nthis list about gaming:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/game/tales.html\">http://sandradodd.com/game/tales.html</a><br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/game/benefits\">http://sandradodd.com/game/benefits</a><br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/videogames\">http://sandradodd.com/videogames</a><br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/game/reading\">http://sandradodd.com/game/reading</a><br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/game/nintendogold\">http://sandradodd.com/game/nintendogold</a><br/>\n<br/>\n&gt; I can be his friend at some levels but there are times which require  <br/>\n&gt; me to be just his mother and I&#39;m about to puke over all the  <br/>\n&gt; insinuation that it somehow lessens me as a human being to act as  <br/>\n&gt; such.<br/>\n<br/>\n </span></blockquote>Spewing on the list won&#39;t help anyone learn how to better unschool. To  <br/>\nthink (and to write) like this can&#39;t be good for a parent; how much of  <br/>\nit rubs off on one&#39;s child?<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; By the way, where do you hone all of your wisdom and knowledge from?  <br/>\n&gt; Because I&#39;ve been all over the links to your name and it seems you  <br/>\n&gt; just spew Holt, although you don&#39;t practice him very well as he was  <br/>\n&gt; about loving guidance for children, and other umschooling gurus.<br/>\n<br/>\n </span></blockquote>Whatever do you mean? How can anyone be &quot;all over the links&quot; to  <br/>\nSandra&#39;s name, yet never read her own words and others&#39; on her site?  <br/>\nJohn Holt wrote about school reform and had many foundational  <br/>\nunschooling ideas, but he didn&#39;t have children. Sandra has 3 adult  <br/>\nchildren. She has experience. She&#39;s been helping people a long, long  <br/>\ntime.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I just sense an insecurity coming from you that comes out as a  <br/>\n&gt; pseudointellectualized sort of candied barb to chew on for us. Ok  <br/>\n&gt; I&#39;m done.....thanks.<br/>\n<br/>\n </span></blockquote>Wow, I just don&#39;t know what to say about that! Sandra is one of the  <br/>\nleast insecure people I know!<br/>\n<br/>\nIt&#39;s precisely because Sandra *is* secure in her knowledge and her  <br/>\nresults (if one could call 3 great kids and a happy marriage with  <br/>\nplenty of gaming, &quot;results&quot;) that some people don&#39;t want to hear her  <br/>\nspeak plainly about unschooling principles.  Some people would prefer  <br/>\nher to pat them on the back and say &quot;I know. Kids are so...(whatever  <br/>\nputdown one can think of)&quot; instead of showing them how they can better  <br/>\nrelate to their kids.<br/>\n<br/>\nAnd why diss one person&#39;s writing in a sea of thoughtful and sound  <br/>\nadvice? It&#39;s rude.<br/>\n<br/>\nI&#39;m wondering when Sandra might decide to have new members sign  <br/>\naffidavits that they have read and agree to the guidelines of this  <br/>\nlist &lt;g&gt;.<br/>\n<br/>\nRobin B.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Faking interest in videogames","postDate":"1307600371","msgId":61475,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNBQkM1OThELUQ5RkYtNDJEQi1CQzZDLTgzQzY4NkRFQkRCNUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGlzcDZiYSs0cGl2QGVHcm91cHMuY29tPg==","referencesHeader":"PGlzcDZiYSs0cGl2QGVHcm91cHMuY29tPg=="},"prevInTopic":61474,"nextInTopic":61476,"prevInTime":61474,"nextInTime":61476,"topicId":61427,"numMessagesInTopic":0,"msgSnippet":"Although this poster has been in correspondence with the moderators (complaining about me and about the list, though she wrote a sweet complimentary private","messageBody":"<div id=\"ygrps-yiv-1918860974\">Although this poster has been in correspondence with the moderators (complaining about me and about the list, though she wrote a sweet complimentary private e-mail to one moderator) and had been asked not to post for a few days, but only to read, I&#39;ve let this last post through.<br/>\n<br/>\n-=-Sandra......we are not talking about our adult friends. My seven year old doesn&#39;t need to have the full experience of aiming a gun at a human, pulling then trigger, HEARING the hit of the shrapnel into the body along with the blood spurting, followed by, &quot; Fuckin yeah I got him!!&quot; every 2 minutes for him and I to have a worthwhile, healthy, gentle, loving, learning relationship. I can be his friend at some levels but there are times which require me to be just his mother and I&#39;m about to puke over all the insinuation that it somehow lessens me as a human being to act as such. By the way, where do you hone all of your wisdom and knowledge from? Because I&#39;ve been all over the links to your name and it seems you just spew Holt, although you don&#39;t practice him very well as he was about loving guidance for children, and other umschooling gurus. I just sense an insecurity coming from you that comes out as a pseudointellectualized sort of candied barb to chew on for us. Ok I&#39;m done.....thanks.-=-<br/>\n<br/>\nI was talking about my adult friends.  I was talking about the principle of respect for others, of personal boundaries.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/rules\">http://sandradodd.com/rules</a><br/>\n<br/>\n-=-My seven year old doesn&#39;t need to have the full experience of aiming a gun at a human, pulling then trigger, HEARING the hit of the shrapnel into the body along with the blood spurting, followed by, &quot; Fuckin yeah I got him!!&quot; every 2 minutes...-=-<br/>\n<br/>\nAnd he hasn&#39;t aimed a gun at a human.  He aimed a cursor (cartooned to look like a gun) at pixels, and pressed a button on a remote control.  He heard simulated video game sounds and didn&#39;t see any real blood.   He has a mother who is harsh and unrealistic, though, and that&#39;s more real violence than is in any game.<br/>\n<br/>\n-=-I can be his friend at some levels but there are times which require me to be just his mother and I&#39;m about to puke over all the insinuation that it somehow lessens me as a human being to act as such. -=-<br/>\n<br/>\nI have three grown children.  I have never been &quot;just their mother.&quot;  I do know what that means, because I grew up with and around people who used phrases like &quot;be his parent, not his friend.&quot;  Last night my 19 year old daughter said she misses me, when she sent me some photos for Just Add Light and Stir, and some photos of her and her new boyfriend.  I know other parents whose 19 year olds won&#39;t even speak to them.   I&#39;ve spoken to both my sons (22 and 24) in the past few days, too, both of whom have recently been given new responsibilities in their lives, both of whom talked about reading novels, though they&#39;re both well equipped with all the video games they could possibly play (and have no doubt played some video games lately too).<br/>\n<br/>\n&quot;About to puke&quot; is an over-reaction to think and an insult to write.  If you have similar feelings about your son&#39;s chosen activities, it&#39;s well worth considering whether you might want to temper and balance your reactions.<br/>\n<br/>\n-=- By the way, where do you hone all of your wisdom and knowledge from?-=-<br/>\n<br/>\nI don&#39;t think you really want an answer, but that you intended to use that question as an insult.  If you really want to know more about why I believe what I believe at this point in my life, and why I believed what I believed 20 years ago when we started unschooling, and why I believed what I believed when I had my first child nearly 25 years ago, I&#39;ve been writing that whole time and sharing ideas with other moms since La Leche League days.   Before that, I was involved in various kinds of learning for fun, and I&#39;ve been a teacher, and first read John Holt in the early 1970&#39;s, before he had thought about homeschooling at all.  <br/>\n<br/>\nMuch of my knowledge of unschooling and family dynamics comes from other families I have known, and people who have written on this list and another few lists and a forum or two before that, some of whom I still haven&#39;t met in person, many of whom have had me or my kids (or both, or our whole family) stay in their homes, and many of whom have stayed in ours.  <br/>\n<br/>\n-=- Because I&#39;ve been all over the links to your name and it seems you just spew Holt, although you don&#39;t practice him very well as he was about loving guidance for children, and other umschooling gurus. -=-<br/>\n<br/>\nDoes that mean you googled me and saw &quot;John Holt&quot; in some of the descriptions?  I don&#39;t really &quot;spew&quot; much Holt directly.   And I don&#39;t &quot;practice him&quot; at all.  He  had no children and wasn&#39;t married.  He had lots of ideas, many of which you wouldn&#39;t like at all.  You probably wouldn&#39;t like &quot;Escape from Childhood&quot; very much.  It even disturbed me.  I didn&#39;t like the idea of any son of mine joining the British navy at 12 or 14, but the childless John Holt was able to romanticize 18th and 19th century English class system and naval realities full on!  He just didn&#39;t seem able to consider the relationships between parents and children as clearly.<br/>\n<br/>\n&quot;Loving guidance for children&quot; is not a problem.  John Holt&#39;s writings were more about freedom for children to explore and learn on their own.  As to &quot;other umschooling gurus,&quot; there wasn&#39;t anyone else writing  about it when John Holt wrote in the 1970&#39;s and early 80&#39;s.  <br/>\n<br/>\n-=- I just sense an insecurity coming from you that comes out as a pseudointellectualized sort of candied barb to chew on for us.-=-<br/>\n<br/>\nI think if you heard me speak or you were around any of my family members, you would not sense any insecurity.  <br/>\nI think if you met me in person you wouldn&#39;t begin to say any of the things you&#39;ve written here, either.<br/>\n<br/>\n-=-Ok I&#39;m done.....thanks.--=-<br/>\n<br/>\nYou&#39;re welcome.    <br/>\nYou&#39;re welcome to stay on the list and read (as I said in the side e-mail, which will be my last) but not welcome to post to the list unless or until you&#39;ve read more and decided to look more at a peaceful relationship with your child and with those who are offering you their years of experience with unschooling and close family relationships.   I&#39;m sure you&#39;ll be invited to other lists that appreciate your tone and attitude but that might not be as helpful in the long run with unschooling.  If you leave this list in a huff, it&#39;s okay for you to join again later if you want to.<br/>\n<br/>\nThe post above appeared on the list because I woke up and got to it before other moderators deleted it from the queue.  They would have done the poster a favor by that, but I think it can be helpful for people to see extreme responses.<br/>\n<br/>\n&quot;Puke&quot; &quot;fuck&quot; and &quot;barb&quot; (candied or otherwise) all in one post is quite negative, and negativity can and will keep peace and natural learning from taking hold in a home, in a life, in a soul.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/negativity\">http://sandradodd.com/negativity</a><br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Faking interest in videogames","postDate":"1307600260","msgId":61474,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE3MzQzOS4yOTE5Mi5xbUB3ZWI4NzMxNS5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PGlzcDZiYSs0cGl2QGVHcm91cHMuY29tPg==","referencesHeader":"PGlzcDZiYSs0cGl2QGVHcm91cHMuY29tPg=="},"prevInTopic":61473,"nextInTopic":61475,"prevInTime":61473,"nextInTime":61475,"topicId":61427,"numMessagesInTopic":0,"msgSnippet":"Presumably no one has come to your house and forced you to join this list and to ask for help. Presumably you can ignore certain people if they aren t helpful","messageBody":"<div id=\"ygrps-yiv-617878365\">Presumably no one has come to your house and forced you to join this list and to <br/>\nask for help. Presumably you can ignore certain people if they aren&#39;t helpful to <br/>\nyou and listen to others if they are. You are choosing to do that with your <br/>\nembracing of studies that aren&#39;t always replicable and that get responded to <br/>\nwith studies that demonstrate the opposite given a few different data points or <br/>\ninclusion criteria. You don&#39;t need to work to belittle someone who is choosing <br/>\nto take from her free time, her time roaming the wilds of the UK, to reach out a <br/>\nhelping hand. Even if it isn&#39;t dressed in the finery that you were hoping for, <br/>\neven if the hand isn&#39;t the hand you wanted. <br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\n<br/>\nBy the way, where do you hone all of your wisdom and knowledge from? Because <br/>\nI&#39;ve been all over the links to your name and it seems you just spew Holt, <br/>\nalthough you don&#39;t practice him very well as he was about loving guidance for <br/>\nchildren, and other umschooling gurus. I just sense an insecurity coming from <br/>\nyou that comes out as a pseudointellectualized sort of candied barb to chew on <br/>\nfor us. Ok I&#39;m done.....thanks.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":475251512,"authorName":"Deb","from":"&quot;Deb&quot; &lt;vwb777@...&gt;","profile":"vwb777","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Faking interest in videogames","postDate":"1307581610","msgId":61473,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlzcDZiYSs0cGl2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEI4NjREQTZFLTNEODctNDZGNi1BNEExLUQ1NzA2NDg4RUFDOUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":61472,"nextInTopic":61474,"prevInTime":61472,"nextInTime":61474,"topicId":61427,"numMessagesInTopic":0,"msgSnippet":"Sandra......we are not talking about our adult friends. My seven year old doesn t need to have the full experience of aiming a gun at a human, pulling then","messageBody":"<div id=\"ygrps-yiv-571941492\">Sandra......we are not talking about our adult friends. My seven year old doesn&#39;t need to have the full experience of aiming a gun at a human, pulling then trigger, HEARING the hit of the shrapnel into the body along with the  blood spurting, followed by, &quot; Fuckin yeah I got him!!&quot; every 2 minutes for him and I to have a worthwhile, healthy, gentle, loving, learning relationship. I can be his friend at some levels but there are times which require me to be just his mother and I&#39;m about to puke over all the insinuation that it somehow lessens me as a human being to act as such. By the way, where do you hone all of your wisdom and knowledge from? Because I&#39;ve been all over the links to your name and it seems you just spew Holt, although you don&#39;t practice him very well as he was about loving guidance for children, and other umschooling gurus. I just sense an insecurity coming from you that comes out as a pseudointellectualized sort of candied barb to chew on for us. Ok I&#39;m done.....thanks.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; -=-. I told him I was fine, and that I did not want to stop watching the movie. He wouldn&#39;t let up and insisted the movie would be harmful to me. It pissed me off then because I felt belittled, and I realize in retrospect that he was uncomfortable with the movie and my experience for whatever reason. He wanted me to stop watching it because it made him uneasy; it had nothing to do with me.-=-<br/>\n&gt; <br/>\n&gt; It can be a good tool, when thinking about how to respond to children, to imagine how we might treat adult friends, guests, or partners.  It helps me, anyway.  It might not have helped that boyfriend in the story about the movie. :-)<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":342163414,"authorName":"Chris Sanders","from":"Chris Sanders &lt;iowaunschoolers@...&gt;","profile":"iaunschoolers","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Faking interest in videogames","postDate":"1307579141","msgId":61472,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJDOEIwQ0QwLTM2QjYtNERCNC1BQTlFLUZERDNFOTE2MkEzRUBnbWFpbC5jb20+","inReplyToHeader":"PGlzb244bytodW9wQGVHcm91cHMuY29tPg==","referencesHeader":"PGlzb244bytodW9wQGVHcm91cHMuY29tPg=="},"prevInTopic":61470,"nextInTopic":61473,"prevInTime":61471,"nextInTime":61473,"topicId":61427,"numMessagesInTopic":0,"msgSnippet":"... What I know is that denying my child s passion for video games changed our relationship, not for the better.  My oldest wrote about it in his first college","messageBody":"<div id=\"ygrps-yiv-93277201\"><blockquote><span title=\"ireply\">&gt;  I guess my simplest gut feeling about it is that he is blessed to live in a country at peace, where he doesn&#39;t have to be lulled to sleep by the violent sounds of human beings slaughtering each other. Why would I celebrate that being brought into my living room for him to be exposed to? Something tells me that it will change him somehow....not for the better....and that he will lose the magical innocence that only comes for a short time during early childhood.<br/>\n<br/>\n </span></blockquote>What I know is that denying my child&#39;s passion for video games changed our relationship, not for the better.  My oldest wrote about it in his first college writing course.  I&#39;ve re-posted it from his blog onto mine to make it easier to read in order.  It kind of breaks my heart a little bit every time I reread it.  <a rel=\"nofollow\" target=\"_blank\" href=\"http://zamunzo.blogspot.com/2011/06/problem-and-solution.html\">http://zamunzo.blogspot.com/2011/06/problem-and-solution.html</a><br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My point is that we are talking about children. There are several studies which indicate early exposure to violent, graphic acts on television, movies, games, etc., lead to a myriad of problems.<br/>\n<br/>\n </span></blockquote>Children role played violent games long before video games were around.  In the 60&#39;s and 70&#39;s, on any given day, my friends and I may have been playing cops and robbers, cowboys and indians, or having wrestling and even punching matches. I&#39;m not aware of any problems participating in these activities caused me.  I don&#39;t know what &quot;myriad of problems&quot; you think your son might develop if you allow him to play shooting video games, but I bet there are lots of readers of this list who can&#39;t find a single problem in their child they can attribute to having let them play them.<br/>\n<br/>\nMy son is 20 now and plays a lot less than he used too.  He&#39;s spending his time with friends playing board games, watching movies, romancing his girlfriend, and studying at college.  I can&#39;t find a single thing wrong with him for which I can blame video games. My daughter has been talking about resurrecting our Xbox Live account so she can play the newest Halo with friends across the country.  She enjoys playing her dad and can beat him sometimes. She&#39;s one of the sweetest, most innocent 13 year-olds I know!<br/>\n<br/>\nChris<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Faking interest in videogames","postDate":"1307576665","msgId":61470,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc0MzlCMUI1LTNGQ0QtNDk0NC1COTkxLTVGREMzMDUwMUE0OEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGlzb3VvYytrYjRiQGVHcm91cHMuY29tPg==","referencesHeader":"PGlzb3VvYytrYjRiQGVHcm91cHMuY29tPg=="},"prevInTopic":61469,"nextInTopic":61472,"prevInTime":61469,"nextInTime":61471,"topicId":61427,"numMessagesInTopic":0,"msgSnippet":"-=-...imagine your husband wrote it to a message board about you and about something you love. Imagine him writing the subject line about faking an interest in","messageBody":"<div id=\"ygrps-yiv-613036409\">-=-...imagine your husband wrote it to a <br/>\nmessage board about you and about something you love. Imagine him <br/>\nwriting the subject line about faking an interest in your interest...<br/>\n-=-**Actually, this wouldn&#39;t surprise me, family and friends have done this, feign interest at best, to me often**-=-<br/>\n<br/>\nThe most healing thing about unschooling for me has been the &quot;reparenting&quot; I did (of myself, in part) by doing for my children what I wished had been done for me.  Rather than using your family&#39;s behaviors to justify bad habits or nonproductive choices, try to let what they did dissolve into the mists of the past by creating a vibrant present of best possible choices.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/choices\">http://sandradodd.com/choices</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":441643010,"authorName":"vicki","from":"&quot;vicki&quot; &lt;vdeleonsutter@...&gt;","profile":"vdeleonsutter","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Faking interest in videogames","postDate":"1307573836","msgId":61469,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlzb3VvYytrYjRiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDk3MjAyMDVDLTAxODQtNEIxMi1CNzM0LTkwNzAyQjJCNjFDOEB2ZXJpem9uLm5ldD4="},"prevInTopic":61468,"nextInTopic":61470,"prevInTime":61468,"nextInTime":61470,"topicId":61427,"numMessagesInTopic":0,"msgSnippet":"Reread your initial email and imagine your husband wrote it to a message board about you and about something you love. Imagine him writing the subject line","messageBody":"<div id=\"ygrps-yiv-1609975437\">&quot;Reread your initial email and imagine your husband wrote it to a <br/>\nmessage board about you and about something you love. Imagine him <br/>\nwriting the subject line about faking an interest in your interest. It <br/>\nmight feel like he cared more about a pretense than he cared about you.&quot;<br/>\nActually, this wouldn&#39;t surprise me, family and friends have done this, feign interest at best, to me often. My husband does it and it hurts, and I dont want my daughter to experience that put-down feeling from someone she loves and trusts. I could be doing a better job engaging with her and her love for RPGs which is why this topic is hitting hard and I need it to. I need to do better, I&#39;m going to ask my husband about Plants vs Zombies. (gulp)<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Joyce Fetteroll &lt;jfetteroll@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; <br/>\n&gt; On Jun 7, 2011, at 10:16 PM, antonelladallatorre wrote:<br/>\n&gt; <br/>\n&gt; &gt; Sorry, but this was harsh ans unhelpful. I disagree with your  <br/>\n&gt; &gt; interpretation of my words.<br/>\n&gt; <br/>\n&gt; The purpose of the list is to help people clear out the fuzzy ideas  <br/>\n&gt; that get in the way of being a child&#39;s partner, of creating a more  <br/>\n&gt; joyful home, of connecting with kids (and, as a side-effect, spouses  <br/>\n&gt; too!).<br/>\n&gt; <br/>\n&gt; Not every unschooler wants that. Which is why the list has all sorts  <br/>\n&gt; of warnings (front page of the group at Yahoo, emails sent on joining,  <br/>\n&gt; suggestion to read for a while) to alert people this list is different  <br/>\n&gt; than they expect, is different than they may want. That allows them to  <br/>\n&gt; bail before they get responses different than they want.<br/>\n&gt; <br/>\n&gt; If you want to connect with your child you won&#39;t be able to while  <br/>\n&gt; holding onto so many negative thoughts about his passion.<br/>\n&gt; <br/>\n&gt; Reread your initial email and imagine your husband wrote it to a  <br/>\n&gt; message board about you and about something you love. Imagine him  <br/>\n&gt; writing the subject line about faking an interest in your interest. It  <br/>\n&gt; might feel like he cared more about a pretense than he cared about you.<br/>\n&gt; <br/>\n&gt; Fears tend to not respond easily to rational thought! To get rid of  <br/>\n&gt; them it helps to want what your fear is standing in the way of more  <br/>\n&gt; than you want to hold onto the fears. And that will take conscious  <br/>\n&gt; effort.<br/>\n&gt; <br/>\n&gt; What will your fears gain you and at what price? What will getting rid  <br/>\n&gt; of fears gain you and at what price?<br/>\n&gt; <br/>\n&gt; Your fears *will* interfere with you connecting with your son. Your  <br/>\n&gt; fears are telling you to protect him from a danger. But how real are  <br/>\n&gt; those dangers? That&#39;s where you need to examine. If you damage your  <br/>\n&gt; relationship with him -- and being negative about something he loves  <br/>\n&gt; will do that -- for dangers that aren&#39;t real, what will you have gained?<br/>\n&gt; <br/>\n&gt; What are the experiences of unschooled kids who play video games?  <br/>\n&gt; *That&#39;s* the question you need to ask! :-) The fears *sound* like they  <br/>\n&gt; make sense. It sounds reasonable that playing violent games will  <br/>\n&gt; create violent adults. But what happens to unschooled kids who play  <br/>\n&gt; whatever games they want for as long as they want? Are our kids  <br/>\n&gt; sociopaths? Are the people on the list more interested in a philosophy  <br/>\n&gt; than their kids? Are our kids somehow special so they&#39;re immune to  <br/>\n&gt; violent video games?<br/>\n&gt; <br/>\n&gt; There&#39;s lots to read about video games at Sandra&#39;s site and mine. The  <br/>\n&gt; intent is not to convince you your fears are irrational. But if you  <br/>\n&gt; decide to work at letting go of your fears, the information there is  <br/>\n&gt; valuable. Even better is to look directly at your child and see the  <br/>\n&gt; joy in his eyes where he can live in a supportive, warm home and visit  <br/>\n&gt; and play in a world where the rules are different. And best of all he  <br/>\n&gt; doesn&#39;t need to give up his loving home to do that. He can shut that  <br/>\n&gt; other world off whenever he wants and live in a world where he&#39;s  <br/>\n&gt; loved. If you think he&#39;d give up the home he has to live in a world of  <br/>\n&gt; fear where he could be shot just to be able to shoot other people,  <br/>\n&gt; that&#39;s something to examine!<br/>\n&gt; <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/videogames\">http://sandradodd.com/videogames</a><br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/game/tales\">http://sandradodd.com/game/tales</a><br/>\n&gt; <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com/\">http://joyfullyrejoycing.com/</a>   Down the left hand side.<br/>\n&gt; <br/>\n&gt; Joyce<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Faking interest in videogames","postDate":"1307571093","msgId":61468,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRERUZGMzk1LjEwMzA3MDhAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PGlzb244bytodW9wQGVHcm91cHMuY29tPg==","referencesHeader":"PGlzb244bytodW9wQGVHcm91cHMuY29tPg=="},"prevInTopic":61467,"nextInTopic":61469,"prevInTime":61467,"nextInTime":61469,"topicId":61427,"numMessagesInTopic":0,"msgSnippet":"... Post the study that you find most convincing - we can discuss it. Otherwise this is just conventional spouting of the usual anti-tv/video games/etc.","messageBody":"<div id=\"ygrps-yiv-1584003714\">On 6/8/2011 1:49 PM, Deb wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; There are several studies which indicate early exposure to violent, <br/>\n&gt; graphic acts on television, movies, games, etc., lead to a myriad of <br/>\n&gt; problems.<br/>\n<br/>\n </span></blockquote>Post the study that you find most convincing - we can discuss it. <br/>\nOtherwise this is just conventional spouting of the usual anti-tv/video <br/>\ngames/etc. claptrap. One of the basic principles of unschooling is to <br/>\nthink for yourself. It is no more reasonable to buy into the usual fear <br/>\ntactics about tv and videogames than about how our kids won&#39;t learn to <br/>\nread.<br/>\n<br/>\nBut - it really is SUCH conventional wisdom that being <br/>\nanti-tv/videogames is almost synonymous with being a good parent, these <br/>\ndays.  Being pro-tv and videogames is more disturbing to more people <br/>\nthan is unschooling, in my experience.<br/>\n<br/>\n-pam<br/>\n-pam</div>","specialLinks":[]},{"userId":475251512,"authorName":"Deb","from":"&quot;Deb&quot; &lt;vwb777@...&gt;","profile":"vwb777","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Faking interest in videogames","postDate":"1307566168","msgId":61467,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlzb244bytodW9wQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlzbzB0MStwOWQ2QGVHcm91cHMuY29tPg=="},"prevInTopic":61466,"nextInTopic":61468,"prevInTime":61466,"nextInTime":61468,"topicId":61427,"numMessagesInTopic":0,"msgSnippet":"Maybe the PTSD thing was over the top and of course imrealize that my son hasn t developed it by hearing those sounds. You weren t traumatized? Many adults are","messageBody":"<div id=\"ygrps-yiv-583250019\">Maybe the PTSD thing was over the top and of course imrealize that my son hasn&#39;t developed it by hearing those sounds. You weren&#39;t traumatized? Many adults are and were. My point is that we are talking about children. There are several studies which indicate early exposure to violent, graphic acts on television, movies, games, etc., lead to a myriad of problems. I guess my simplest gut feeling about it is that he is blessed to live in a country at peace, where he doesn&#39;t have to be lulled to sleep by the violent sounds of human beings slaughtering each other. Why would I celebrate that being brought into my living room for him to be exposed to? Something tells me that it will change him somehow....not for the better....and that he will lose the magical innocence that only comes for a short time during early childhood. I do appreciate your comments by the way. And thank you sincerely for your brave service. I know I sleep free at night thanks to you.<br/>\n<br/>\nDeborah<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Jackie Sharp&quot; &lt;jackie.sharp@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; &quot;Grown men hear that in war and come back with post traumatic stress disorder.&quot;<br/>\n&gt; <br/>\n&gt; Since grown men (and women) hear these things in war along with experiencing war (IEDs, mortars, direct and indirect fire), it is impossible to tease the sounds and the actions apart in order to say that hearing that in war causes troops to come back with PTSD.  I&#39;m an Iraq vet; a game is a very different thing than actual war.  I&#39;ve never feared for my life while playing a video game.  I&#39;ve feared for my life when I was deployed.  These are two very different things, and an explosion in real life sounds and feels nothing like the way it sounds in a game.<br/>\n&gt; <br/>\n&gt; &quot;You should know his big brother is fighting in Afghanistan and my husband is retired military. I said all of that to say this. That game bothers me down to my soul. And I watched for months along with my husband and son before he left while my baby blew the brains out of countless enemies with language coming from the speakers that I&#39;m sure rivals a war zone.&quot;<br/>\n&gt; <br/>\n&gt; Perhaps your fears about what your husband experienced and what your son would be experiencing in Afghanistan spilled over into an unfounded concern about the effects of the game on your young son.  As it&#39;s been stated by others on this list and me, a game is not the same as reality.  This sounds to be much more about you and your fears.  I know it&#39;s tough as a military wife; I&#39;m a military wife too, and my husband is in a special forces unit.  I would just examine thoughts and notions about war and its perceived similarities to a game more closely, especially if I&#39;d never been to war.<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Faking interest in videogames","postDate":"1307563619","msgId":61466,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNzI2My4xOTUxNy5xbUB3ZWI4MTUwOC5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PGlzbzMxZys5dGZ0QGVHcm91cHMuY29tPg==","referencesHeader":"PGlzbWdoditvbXFsQGVHcm91cHMuY29tPiA8aXNvMzFnKzl0ZnRAZUdyb3Vwcy5jb20+"},"prevInTopic":61465,"nextInTopic":61467,"prevInTime":61465,"nextInTime":61467,"topicId":61427,"numMessagesInTopic":0,"msgSnippet":"Just because someone is uncomfortable with something doesn t give that person the right to cut someone else off from something they re enjoying. I know this","messageBody":"<div id=\"ygrps-yiv-1186862141\">&quot;Just because someone is uncomfortable with something doesn&#39;t give that <br/>\nperson the right to cut someone else off from something they&#39;re <br/>\nenjoying.&quot;<br/>\n<br/>\nI know this can be a hard one for parents. I have no problems with video games but just a couple weeks ago I had to really take a deep breath and not say something to my son and I almost blew it.<br/>\nFirst I am scared of guns, always been. Even my mom can fire a weapon but I cannot even hold one. I have always been like that. Second I am on of those that cannot kill an ant, sometimes I even feel bad killing flies and I do NOT like flies!<br/>\nMy husband showed my son how to shoot with the pellet gun and they went pigeon hunting in our farm. Pigeons and racoons are the only animals that they shoot around here, the first  carries a disease that kills calves and the second will kill any farm kitten.<br/>\nMy son came in all happy to tell me he had killed a pigeon on his first day on shooting ( thanks to video games!).<br/>\nI started going like &quot; Oh poor bird...&quot; I stopped my self and  thought about my son&#39;s excitement in being able to do it and I took a deep breath. He was happy and I was happy he was happy. <br/>\nThis morning he got up around  6 AM and went to help his dad milk and then he went pigeon hunting and got two pigeons , which they feed  to the mother cats. I was even able to cheer him today. He is so safe with the gun and conscientious about it that I feel really comfortable with him using it. If I followed my instincts I would never let him go near any kind of gun and never would want him to kill anything.<br/>\n<br/>\nAlex Polikowsky<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Faking interest in videogames","postDate":"1307558200","msgId":61465,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZERTQwNzE5LTBDQkQtNDdGMi1BRTFCLTFFRTExNTY0QzI4Q0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGlzbW0xYStjM2RjQGVHcm91cHMuY29tPg==","referencesHeader":"PGlzbW0xYStjM2RjQGVHcm91cHMuY29tPg=="},"prevInTopic":61464,"nextInTopic":61466,"prevInTime":61464,"nextInTime":61466,"topicId":61427,"numMessagesInTopic":0,"msgSnippet":"-=-This sort of exercise you performed on my writing reminded me of a time in graduate school when a professor of mine returned a draft of a paper I had","messageBody":"<div id=\"ygrps-yiv-56235447\">-=-This sort of exercise you performed on my writing reminded me of a time in graduate school when a professor of mine returned a draft of a paper I had written all marked up in red. I hadn&#39;t thought of that moment in a long time.-=-<br/>\n<br/>\nI&#39;ve taken many classes (before and during college, and some graduate classes).  The purpose of taking those classes is to get feedback.  I can remember some times that I wrote something turned it in, and got some number and letter marked up top, but no suggestions at ALL, no comments at all to help me know what I might do better next time.<br/>\n<br/>\nProfessors are paid to read carefully and critique.  Some don&#39;t, really.  They glance over and put &#39;B&#39; or something up top.  It sounds like your professor did his job in a responsible way.   <br/>\n<br/>\nThis list isn&#39;t a writing class, but as clearly as I could I have (and other moderators have helped me) provided access to details about the intentions and expectations relating to this list.  <br/>\n<br/>\nThe ideas and suggestions of lots of people are the best part of this list!  It&#39;s great for someone to put a question or situation out here for others to pull apart and examine.  When the topic is videogames, there&#39;s not another person here who knows more about what can happen if kids are given videogames and the leeway to play them than I do.  <br/>\n<br/>\n-=-What I was thinking and trying to express was simply a desire to read other people&#39;s journeys (&quot;struggles&quot;) from a lack of appreciation/knowledge about something (in this case gaming)that their kids are interested in, to an appreciation of it. Many people volunteered their experiences and gave suggestions, all of which-including yours- was helpful.-=-   (that was from a post that was returned by another moderator)<br/>\n<br/>\nThere are dozens of accounts of other people&#39;s journeys (not so many &quot;struggles&quot;; this list and my site and Joyce&#39;s exist to help people stop struggling) here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/game/tales.html\">http://sandradodd.com/game/tales.html</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/game/benefits\">http://sandradodd.com/game/benefits</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/videogames\">http://sandradodd.com/videogames</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/game/reading\">http://sandradodd.com/game/reading</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/game/nintendogold\">http://sandradodd.com/game/nintendogold</a><br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Faking interest in videogames","postDate":"1307557009","msgId":61464,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI4NjREQTZFLTNEODctNDZGNi1BNEExLUQ1NzA2NDg4RUFDOUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGlzbzMxZys5dGZ0QGVHcm91cHMuY29tPg==","referencesHeader":"PGlzbzMxZys5dGZ0QGVHcm91cHMuY29tPg=="},"prevInTopic":61463,"nextInTopic":61465,"prevInTime":61463,"nextInTime":61465,"topicId":61427,"numMessagesInTopic":0,"msgSnippet":"-=-. I told him I was fine, and that I did not want to stop watching the movie. He wouldn t let up and insisted the movie would be harmful to me. It pissed me","messageBody":"<div id=\"ygrps-yiv-1509583429\">-=-. I told him I was fine, and that I did not want to stop watching the movie. He wouldn&#39;t let up and insisted the movie would be harmful to me. It pissed me off then because I felt belittled, and I realize in retrospect that he was uncomfortable with the movie and my experience for whatever reason. He wanted me to stop watching it because it made him uneasy; it had nothing to do with me.-=-<br/>\n<br/>\nIt can be a good tool, when thinking about how to respond to children, to imagine how we might treat adult friends, guests, or partners.  It helps me, anyway.  It might not have helped that boyfriend in the story about the movie. :-)<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":371356584,"authorName":"Jackie Sharp","from":"&quot;Jackie Sharp&quot; &lt;jackie.sharp@...&gt;","profile":"jackieannsharp","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Faking interest in videogames","postDate":"1307545456","msgId":61463,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlzbzMxZys5dGZ0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlzbWdoditvbXFsQGVHcm91cHMuY29tPg=="},"prevInTopic":61462,"nextInTopic":61464,"prevInTime":61462,"nextInTime":61464,"topicId":61427,"numMessagesInTopic":0,"msgSnippet":"So listen to your maternal instinct. Sometimes no is necessary to protect our children and I promise you it will not damage your relationship. I d also like","messageBody":"<div id=\"ygrps-yiv-396001669\">&quot;So listen to your maternal instinct. Sometimes no is necessary to protect our children and I promise you it will not damage your relationship.&quot;<br/>\n<br/>\nI&#39;d also like to add that, after I got back from Iraq and got out of the Army, I dated a guy for awhile who had never served.  We were watching a movie one night about war and terrorism.  About 15-20 minutes into it he said we shouldn&#39;t watch the movie because it was going to be a trigger for me.  I was completely engrossed in the plot at this point and not at all uncomfortable or feeling any negative side effects.  I told him I was fine, and that I did not want to stop watching the movie.  He wouldn&#39;t let up and insisted the movie would be harmful to me.  It pissed me off then because I felt belittled, and I realize in retrospect that he was uncomfortable with the movie and my experience for whatever reason.  He wanted me to stop watching it because it made him uneasy; it had nothing to do with me.  Just because someone is uncomfortable with something doesn&#39;t give that person the right to cut someone else off from something they&#39;re enjoying.</div>","specialLinks":[]},{"userId":371356584,"authorName":"Jackie Sharp","from":"&quot;Jackie Sharp&quot; &lt;jackie.sharp@...&gt;","profile":"jackieannsharp","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Faking interest in videogames","postDate":"1307543265","msgId":61462,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlzbzB0MStwOWQ2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlzbWdoditvbXFsQGVHcm91cHMuY29tPg=="},"prevInTopic":61461,"nextInTopic":61463,"prevInTime":61461,"nextInTime":61463,"topicId":61427,"numMessagesInTopic":0,"msgSnippet":"Grown men hear that in war and come back with post traumatic stress disorder. Since grown men (and women) hear these things in war along with experiencing","messageBody":"<div id=\"ygrps-yiv-608201232\">&quot;Grown men hear that in war and come back with post traumatic stress disorder.&quot;<br/>\n<br/>\nSince grown men (and women) hear these things in war along with experiencing war (IEDs, mortars, direct and indirect fire), it is impossible to tease the sounds and the actions apart in order to say that hearing that in war causes troops to come back with PTSD.  I&#39;m an Iraq vet; a game is a very different thing than actual war.  I&#39;ve never feared for my life while playing a video game.  I&#39;ve feared for my life when I was deployed.  These are two very different things, and an explosion in real life sounds and feels nothing like the way it sounds in a game.<br/>\n<br/>\n&quot;You should know his big brother is fighting in Afghanistan and my husband is retired military. I said all of that to say this. That game bothers me down to my soul. And I watched for months along with my husband and son before he left while my baby blew the brains out of countless enemies with language coming from the speakers that I&#39;m sure rivals a war zone.&quot;<br/>\n<br/>\nPerhaps your fears about what your husband experienced and what your son would be experiencing in Afghanistan spilled over into an unfounded concern about the effects of the game on your young son.  As it&#39;s been stated by others on this list and me, a game is not the same as reality.  This sounds to be much more about you and your fears.  I know it&#39;s tough as a military wife; I&#39;m a military wife too, and my husband is in a special forces unit.  I would just examine thoughts and notions about war and its perceived similarities to a game more closely, especially if I&#39;d never been to war.</div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Faking interest in videogames","postDate":"1307543156","msgId":61461,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU5RTFBNzQyQTMxMDQ5MjI4MzVFMzJCMkRFREQyOTAwQGRlYm9yYWg0M2YxM2ZkPg==","referencesHeader":"PGlzbG92aCtsbmVsQGVHcm91cHMuY29tPg=="},"prevInTopic":61459,"nextInTopic":61462,"prevInTime":61460,"nextInTime":61462,"topicId":61427,"numMessagesInTopic":0,"msgSnippet":"***Perhaps, if I really wanted to be genuinely involved (and therefore more supportive of his interest), I should examine more closely the reasons of my","messageBody":"<div id=\"ygrps-yiv-504228688\">***Perhaps, if I really wanted to be genuinely involved (and therefore more supportive of his interest), I should examine more closely the reasons of my resistance, which are many. ***<br/>\n<br/>\nI don&#39;t think you need to love the games or be interested in the games.  You&#39;re interested in your son, that can be enough. <br/>\nEnjoy his enjoyment.   Admire his successes.   His game playing isn&#39;t about you. &lt;g&gt;  <br/>\n<br/>\n***I just dislike the fact that his imagination and his thought are so thoroughly colonized by this narrative.***<br/>\n<br/>\nI think your choice of words is interesting and maybe you can give it some more thought.  His imagination and thoughts have not been colonized.   He&#39;s enjoying a new game.   When it&#39;s gardening season in zone 3, as it is now, finally, I spend much of my time in the garden and yard.  I love it.  I think about vegetables and perennials and shrubs and trees and bunnies and worms and beetles and spiders.  I am not colonized by anything. (Shush, you there, in an ecstasy of typing about eyelash mites and liver flukes and indigenous biota!)   My mind has not been overtaken by a Beatrix Potter narrative.  I am still myself.  It is my season for enjoying the garden.    <br/>\n<br/>\nIt is your son&#39;s season of gaming.  It may last another year or five or a lifetime.  If he was reading Patrick O&#39;Brian&#39;s Aubrey-Maturin series would you be concerned his thoughts and imagination had been colonized?   Some people are so interested in movement and music they become dancers, choreographers.  Is that illness, brainwashing, obsession?     <br/>\n<br/>\nMy son was seven when  he started playing video games.   He liked Nocturne, Doom and some others.  He gradually lost interest sometime before he was fourteen.   I got a kind of motion sickness watching first person games but I loved watching Dylan&#39;s concentration, enthusiasm and delight.  These days he&#39;s interested in music.   I&#39;m not musical but I love listening to him play the piano and organ.  I like finding music I think he&#39;d enjoy.  <br/>\n<br/>\n I think it&#39;s possible that it&#39;s *your* imagination that&#39;s the problem. &lt;g&gt;  <br/>\n<br/>\nDeb Lewis<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Faking interest in videogames","postDate":"1307536595","msgId":61459,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk3MjAyMDVDLTAxODQtNEIxMi1CNzM0LTkwNzAyQjJCNjFDOEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGlzbW0xYStjM2RjQGVHcm91cHMuY29tPg==","referencesHeader":"PGlzbW0xYStjM2RjQGVHcm91cHMuY29tPg=="},"prevInTopic":61455,"nextInTopic":61461,"prevInTime":61458,"nextInTime":61460,"topicId":61427,"numMessagesInTopic":0,"msgSnippet":"... The purpose of the list is to help people clear out the fuzzy ideas that get in the way of being a child s partner, of creating a more joyful home, of","messageBody":"<div id=\"ygrps-yiv-1700082781\">On Jun 7, 2011, at 10:16 PM, antonelladallatorre wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Sorry, but this was harsh ans unhelpful. I disagree with your  <br/>\n&gt; interpretation of my words.<br/>\n<br/>\n </span></blockquote>The purpose of the list is to help people clear out the fuzzy ideas  <br/>\nthat get in the way of being a child&#39;s partner, of creating a more  <br/>\njoyful home, of connecting with kids (and, as a side-effect, spouses  <br/>\ntoo!).<br/>\n<br/>\nNot every unschooler wants that. Which is why the list has all sorts  <br/>\nof warnings (front page of the group at Yahoo, emails sent on joining,  <br/>\nsuggestion to read for a while) to alert people this list is different  <br/>\nthan they expect, is different than they may want. That allows them to  <br/>\nbail before they get responses different than they want.<br/>\n<br/>\nIf you want to connect with your child you won&#39;t be able to while  <br/>\nholding onto so many negative thoughts about his passion.<br/>\n<br/>\nReread your initial email and imagine your husband wrote it to a  <br/>\nmessage board about you and about something you love. Imagine him  <br/>\nwriting the subject line about faking an interest in your interest. It  <br/>\nmight feel like he cared more about a pretense than he cared about you.<br/>\n<br/>\nFears tend to not respond easily to rational thought! To get rid of  <br/>\nthem it helps to want what your fear is standing in the way of more  <br/>\nthan you want to hold onto the fears. And that will take conscious  <br/>\neffort.<br/>\n<br/>\nWhat will your fears gain you and at what price? What will getting rid  <br/>\nof fears gain you and at what price?<br/>\n<br/>\nYour fears *will* interfere with you connecting with your son. Your  <br/>\nfears are telling you to protect him from a danger. But how real are  <br/>\nthose dangers? That&#39;s where you need to examine. If you damage your  <br/>\nrelationship with him -- and being negative about something he loves  <br/>\nwill do that -- for dangers that aren&#39;t real, what will you have gained?<br/>\n<br/>\nWhat are the experiences of unschooled kids who play video games?  <br/>\n*That&#39;s* the question you need to ask! :-) The fears *sound* like they  <br/>\nmake sense. It sounds reasonable that playing violent games will  <br/>\ncreate violent adults. But what happens to unschooled kids who play  <br/>\nwhatever games they want for as long as they want? Are our kids  <br/>\nsociopaths? Are the people on the list more interested in a philosophy  <br/>\nthan their kids? Are our kids somehow special so they&#39;re immune to  <br/>\nviolent video games?<br/>\n<br/>\nThere&#39;s lots to read about video games at Sandra&#39;s site and mine. The  <br/>\nintent is not to convince you your fears are irrational. But if you  <br/>\ndecide to work at letting go of your fears, the information there is  <br/>\nvaluable. Even better is to look directly at your child and see the  <br/>\njoy in his eyes where he can live in a supportive, warm home and visit  <br/>\nand play in a world where the rules are different. And best of all he  <br/>\ndoesn&#39;t need to give up his loving home to do that. He can shut that  <br/>\nother world off whenever he wants and live in a world where he&#39;s  <br/>\nloved. If you think he&#39;d give up the home he has to live in a world of  <br/>\nfear where he could be shot just to be able to shoot other people,  <br/>\nthat&#39;s something to examine!<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/videogames\">http://sandradodd.com/videogames</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/game/tales\">http://sandradodd.com/game/tales</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com/\">http://joyfullyrejoycing.com/</a>   Down the left hand side.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Faking interest in videogames","postDate":"1307516605","msgId":61454,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBOUVDNUQxLTRBQzUtNEYwNS1CNjZBLUNCQkJDQTMyRDVCOUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGlzbWdoditvbXFsQGVHcm91cHMuY29tPg==","referencesHeader":"PGlzbWdoditvbXFsQGVHcm91cHMuY29tPg=="},"prevInTopic":61453,"nextInTopic":61455,"prevInTime":61453,"nextInTime":61455,"topicId":61427,"numMessagesInTopic":0,"msgSnippet":"-=-That game bothers me down to my soul. And I watched for months along with my husband and son before he left while my baby blew the brains out of countless","messageBody":"<div id=\"ygrps-yiv-1526706256\">-=-That game bothers me down to my soul. And I watched for months along with my husband and son before he left while my baby blew the brains out of countless enemies with language coming from the speakers that I&#39;m sure rivals a war zone. I tried to tell myself he needed it for whatever reason, that he was being a boy, that I was being controlling.....then I got it. It wasn&#39;t the game it was the blood and guts, grown up cussing and swearing, blood spurting sound that was bothering me. So I talked to my husband, he agreed and now he plays on mute.-=-<br/>\n<br/>\nYour baby didn&#39;t do anything with any enemies or brains.  He was (I&#39;m guessing) sitting in your safe home, far from a war zone, holding a plastic remote control.<br/>\n<br/>\nHe was being a boy.  You were not seeing the difference between play and reality.<br/>\n<br/>\nPlaying a game on mute isn&#39;t ideal.   Some games are fine for that, but in some you don&#39;t get the clues you need to know what&#39;s about to happen.  I hope you considered headphones for him, rather than requiring him to play only part of the game so that you would feel better.<br/>\n<br/>\n-=- I get frustrated when unschooling seems to be the ok sign to stop using our parental instincts. I bet if I asked a child therapistt, he&#39;d have some trouble with. seven year old listening to that for hours on end-=-<br/>\n<br/>\nCertainly you could ask just about any child therapist and he would say send kids to school, limit them, they&#39;re only children, set limits, tell them what to do.  There are very few child therapists who have ever met an adult who was unschooled for many years.  There are people on this list who have met dozens of them.   There is knowledge here that&#39;s unavailable other places.  <br/>\n<br/>\n-=- Grown men hear that in war and come back with post traumatic stress disorder.-=-<br/>\n<br/>\nPlease don&#39;t trivialize post traumatic stress disorder by comparing it to video game play.<br/>\nPlease don&#39;t dramatize video game play by comparing it to being in a war zone.<br/>\n<br/>\n-=-So listen to your maternal instinct.-=-<br/>\n<br/>\nMy mother&#39;s maternal instinct was to yell and spank.  <br/>\nA mother was arrested in New Mexico for trying to sell her daughter&#39;s virginity, I read in the local news (where I went to read about a big forest fire).<br/>\nMany evils are swept under the rug by claiming instinct.<br/>\n<br/>\nThere are instincts and they&#39;re hard to feel or to hear in modern culture, especially, perhaps, for Christians who are told instinct is the devil tempting them.  It is something worth considering and thinking about, but for the purposes of the Always Learning discussion, looking at what promotes good relationships between parent and child and what helps learning thrive are better to look at that justifications for controlling.<br/>\n<br/>\n<br/>\n-=- Sometimes no is necessary to protect our children and I promise you it will not damage your relationship. Sorry for taking so much time. Take are.<br/>\n<br/>\nIf &quot;no&quot; had never damaged any relationships, the world would be a paradise.<br/>\nChildren can only hear so much &quot;no&quot; before they start ignoring it.   It&#39;s good to save &quot;no&quot; for really important things, because mothers do not have unlimited power to say no.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Faking interest in videogames","postDate":"1307515956","msgId":61455,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ0QzY4MzVCLTlEOTUtNEQ1OC1BRjkzLUQ5MjQyNzhBODM4OEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGlzbWdoditvbXFsQGVHcm91cHMuY29tPg==","referencesHeader":"PGlzbWdoditvbXFsQGVHcm91cHMuY29tPg=="},"prevInTopic":61454,"nextInTopic":61459,"prevInTime":61454,"nextInTime":61456,"topicId":61427,"numMessagesInTopic":0,"msgSnippet":"-= I kind get the sense you re being hammered here for your very valid concerns and questions.-=- No one is hammering anyone. If anything, we re hammering out","messageBody":"<div id=\"ygrps-yiv-1107831053\">-= I kind get the sense you&#39;re being hammered here for your very valid concerns and questions.-=-<br/>\n<br/>\nNo one is hammering anyone.<br/>\nIf anything, we&#39;re hammering out ideas.<br/>\n<br/>\nValid concerns and questions about unschooling will be treated as just that.  Discussion of the principles of unschooling.  Not of one family or of one situation.<br/>\n<br/>\n-=-And I apologize ahead of time to those of you who are gender neutral but I happen to believe there are very distinct and necessary differences between boys and girls. As you&#39;ve seen, some of those differences come out in the wAy they play.-=-<br/>\n<br/>\nThere are differences, and there are overlaps.  They&#39;re not &quot;very distinct&quot; in the way that maybe all boys play certain games and no girls do.  there are girls who love to play Halo, and boys who don&#39;t like it.  There are girls who play soccer and boys who read Jane Austen.<br/>\n<br/>\nDifferences are real.  Expecting children to conform to a stereotype of those differences can be harmful.<br/>\n<br/>\n-=- I consider myself an unschooler and try very hard to meet my sons needs, to let him lead me in learning and other life choices, etc.-=-<br/>\n<br/>\nThere are problems with the idea of &quot;child led learning&quot; and this list.   Rather than the parent OR the child &quot;leading,&quot; it&#39;s more useful to look at the parents helping to provide and maintain an environment in which learning happens easily and constantly.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/nest\">http://sandradodd.com/nest</a><br/>\n<br/>\nfrom <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/balance\">http://sandradodd.com/balance</a> :<br/>\n<br/>\nEnergy is shared, and that&#39;s how unschooling works. Whether I&#39;m excited about something new, or my children are excited about something new, there&#39;s still newness and excitement enough to share.<br/>\n<br/>\nSome parents label unschooling as &quot;child-led learning,&quot; and so they think they&#39;re going from &quot;parent led&quot; life to &quot;child led&quot; life, but the balance point is that the family learns to live together harmoniously.<br/>\n<br/>\nHarmony makes many things easier. When there is disharmony, everyone is affected. When there is harmony, everyone is affected too. So if it is six of one or half a dozen of the other (right between none and a full dozen), go with harmony instead!<br/>\n<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Faking interest in videogames","postDate":"1307514912","msgId":61453,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlGODQ3NDI1LUFEOEMtNDlBNC1BRUMwLTg4MTJGQ0JCQTNGMEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGlzbWxiMytlYXF1QGVHcm91cHMuY29tPg==","referencesHeader":"PGlzbWxiMytlYXF1QGVHcm91cHMuY29tPg=="},"prevInTopic":61452,"nextInTopic":61454,"prevInTime":61452,"nextInTime":61454,"topicId":61427,"numMessagesInTopic":0,"msgSnippet":"-=-I recently (whoa, it s been a year already?) quit my job as an animator to stay home with my 8 1/2 month old baby, but my love of video games as a child led","messageBody":"<div id=\"ygrps-yiv-520263346\">-=-I recently (whoa, it&#39;s been a year already?) quit my job as an animator to stay home with my 8 1/2 month old baby, but my love of video games as a child led me to that job, and to so much in my life, including my husband, the father of my baby. :) I&#39;m not saying the original poster&#39;s son will definitely go into a game-related field, just that it&#39;s possible that this will shape his life in lovely, far-reaching, unforeseeable ways. I hope this helps.-=-<br/>\n<br/>\nAbsolutely similar, also without any definites or guarantees:<br/>\n<br/>\nMy oldest son played video games quite a bit from very young childhood--we had an arcade game in the house for a while, and he played &quot;Playroom&quot; on a MacIIsi as a toddler.  We got him an NES (first Nintendo system) when he was four.   We played board games and card games with him.<br/>\n<br/>\nFrom the age of 14 to 18 or so (19 maybe?) he worked at a gaming store (collectible cards, RPG and board games), and from 20-24 (he&#39;ll be 25 in July) he&#39;s worked for Blizzard Entertainment.   He did luck into those opportunities for being in the right place at the right time, but it took more than just that luck.  He also had interest and understanding and experience, and  supportive family and friends.<br/>\n<br/>\nOur honest interest in his honest interest in games helped us have nearly 25 peaceful, productive years (so far).<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Faking interest in videogames","postDate":"1307514318","msgId":61451,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRBMTlEOUY1LTM0NDctNEYyNy1CQjgzLUQ4MTc4QUQ2OTcyREBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGlzbW0xYStjM2RjQGVHcm91cHMuY29tPg==","referencesHeader":"PGlzbW0xYStjM2RjQGVHcm91cHMuY29tPg=="},"prevInTopic":61448,"nextInTopic":61452,"prevInTime":61450,"nextInTime":61452,"topicId":61427,"numMessagesInTopic":0,"msgSnippet":"-=- Sorry, but this was harsh ans unhelpful. I disagree with your interpretation of my words. This sort of exercise you performed on my writing reminded me of","messageBody":"<div id=\"ygrps-yiv-1372802695\">-=-<br/>\nSorry, but this was harsh ans unhelpful. I disagree with your interpretation of my words. This sort of exercise you performed on my writing reminded me of a time in graduate school when a professor of mine returned a draft of a paper I had written all marked up in red. I hadn&#39;t thought of that moment in a long time.-=-<br/>\n<br/>\nThere are a few thousand people on this list, and I&#39;m sure something in that post was helpful to some of them.   <br/>\n<br/>\nMy assumption was that you came to this list because you wanted to have your ideas examined in the light of unschooling.  It&#39;s the purpose of the list.<br/>\n<br/>\nIt&#39;s possible that you posted without having read here and followed the links:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/AlwaysLearning/\">http://groups.yahoo.com/group/AlwaysLearning/</a><br/>\n<br/>\nPlease read these, too.<br/>\n<br/>\nNEW MEMBERS PLEASE READ THIS: For New Members of the Always Learning List<br/>\nAbout posting to the list<br/>\n<br/>\nInformation on how and why the group is intended to work: Notes on the AlwaysLearning List<br/>\n<br/>\nIf you&#39;ve never read any John Holt, here: John Holt<br/>\nHis thoughts and writing are behind unschooling.<br/>\n<br/>\n<br/>\n<br/>\nThis isn&#39;t graduat school.  The writing isn&#39;t for practice, it&#39;s real.  It&#39;s common for people to write things they didn&#39;t realize they were thinking, and can be very useful for others to point that out.   It&#39;s also common for people to assume that groups will provide approval and soothing words for the mom, rather than taking the child&#39;s side.  This list has never been that way, which is why we ask people to read that introductory material before posting.<br/>\n<br/>\n<br/>\nSupport looks like this:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/support\">http://sandradodd.com/support</a><br/>\n<br/>\nIt&#39;s out there on many yahoo lists and homeschool forums, but it tends to serve to keep parents where they are rather than helping them move toward a better relationship with their children and a better understanding of natural learning.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":442614894,"authorName":"antonelladallatorre","from":"&quot;antonelladallatorre&quot; &lt;anto40@...&gt;","profile":"antonelladallatorre","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Faking interest in videogames","postDate":"1307499370","msgId":61447,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlzbW0xYStjM2RjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEI2NDUyODFDLTQ1MDAtNDI2MC1BODc3LUNGRkFDQTNFMjAxNEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":61435,"nextInTopic":61448,"prevInTime":61446,"nextInTime":61448,"topicId":61427,"numMessagesInTopic":0,"msgSnippet":"Sorry, but this was harsh ans unhelpful. I disagree with your interpretation of my words. This sort of exercise you performed on my writing reminded me of a","messageBody":"<div id=\"ygrps-yiv-2056138180\">Sorry, but this was harsh ans unhelpful. I disagree with your interpretation of my words. This sort of exercise you performed on my writing reminded me of a time in graduate school when a professor of mine returned a draft of a paper I had written all marked up in red. I hadn&#39;t thought of that moment in a long time.<br/>\n<br/>\nYour second comment was more generative and I thank you for the link (and the suggestion). <br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; -=-Since I am not a gamer, I have a &quot;limited&quot; appreciation for this activity, but I understand that he is passionate about it and respect this. Nevertheless, I still have to work on myself to accept it entirely and in my heart, I still don&#39;t like it. -=-<br/>\n&gt; <br/>\n&gt; Then you&#39;re faking respecting his passion, too.<br/>\n&gt; <br/>\n&gt; Rather than get advice about how to fake interest more convincingly, I hope you&#39;re really hoping for advice about how to GAIN an interest.<br/>\n&gt; <br/>\n&gt; -=-Perhaps, if I really wanted to be genuinely involved (and therefore more supportive of his interest), I should examine more closely the reasons of my resistance, which are many. I am still not convinced that playing the Wii (his technology of choice) impacts his (and our) life for the better (even if I realize that computer games are a reality that he will, at some point, encounter regardless of my choices).-=-<br/>\n&gt; <br/>\n&gt; If you look at the paragraph above, you might count the rings of distance between yourself and any possible support, interest or respect.<br/>\n&gt; <br/>\n&gt; Perhaps<br/>\n&gt; if<br/>\n&gt; really<br/>\n&gt; genuinely<br/>\n&gt; should examine<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; -=-Since the gaming began there&#39;s been a lot more talking among my kids (a boy and a girl of 5) about &quot;killing&quot; &quot;shooting&quot;and so on. I dont&#39; like that very much-=-<br/>\n&gt; <br/>\n&gt; Have they killed anything?<br/>\n&gt; Have they asked for real guns?<br/>\n&gt; <br/>\n&gt; Children are much better at knowing fantasy from reality than some moms are.  <br/>\n&gt; <br/>\n&gt; -=- I have a hard time engaging in a spontaneous, joyful conversation with them when this happens. Not that I necessarily fear that he will become violent on account of the games (which are only mildly violent compared to most videogames), but I just dislike the fact that his imagination and his thought are so thoroughly colonized by this narrative. -=-<br/>\n&gt; <br/>\n&gt; Be very wary of the word &quot;just.&quot;   <br/>\n&gt; <br/>\n&gt; And this is disdainful in a much deeper way that you probably realize:<br/>\n&gt; &quot; I just dislike the fact that his imagination and his thought are so thoroughly colonized by this narrative.&quot;<br/>\n&gt; <br/>\n&gt; It seems you dislike video games so much that you&#39;re in danger of not liking your son anymore.<br/>\n&gt; His imagination (in your estimation) is overtaken by alien narrative.<br/>\n&gt; His thought (you think) is gone.<br/>\n&gt; <br/>\n&gt; -=- if anyone is willing to volunteer their thoughts and experience with precisely this kind of struggle, I would be grateful!-=-<br/>\n&gt; <br/>\n&gt; Does it need to be *precisely* that kind of struggle?<br/>\n&gt; <br/>\n&gt; Perhaps thoughts and experience about any of the principles that help unschooling work well would be worthy of your gratitude.<br/>\n&gt; If you see this as a &quot;precise&quot; kind of &quot;struggle,&quot; you won&#39;t be looking at overarching principles, will you?<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":444547772,"authorName":"butterscotchchelsea","from":"&quot;butterscotchchelsea&quot; &lt;thurman.chelsea@...&gt;","profile":"butterscotchchelsea","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Faking interest in videogames","postDate":"1307498659","msgId":61448,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlzbWxiMytlYXF1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDhERTQwNDkyLTU1QjItNDAxMS04NjY4LURGMTZBNzFCMTcwQUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":61447,"nextInTopic":61451,"prevInTime":61447,"nextInTime":61449,"topicId":61427,"numMessagesInTopic":0,"msgSnippet":"Play Plants vs. Zombies. ... Another great game is Portal (the first one). It s a puzzle game with excellent writing and a truly unique game mechanic.  It","messageBody":"<div id=\"ygrps-yiv-774041808\">&quot;Play Plants vs. Zombies.&quot;<br/>\n<br/>\n-----------------------------<br/>\n<br/>\nAnother great game is Portal (the first one). It&#39;s a puzzle game with excellent writing and a truly unique game mechanic.  It was made by some people I went to college with and is an extremely fun game.  I am a gamer, though, and it will probably take some getting used to if you&#39;ve never played a first-person game.<br/>\n<br/>\nI went to DigiPen, one of the big video game schools (the other main one being Full Sail), and I had something of a crisis of faith while I was at school: Is it really meaningful to make games for a living?  Shouldn&#39;t I be out there working towards something REAL?  So I can understand being iffy about their value.  But ultimately I got over it and realized video games are great.  Games are a versatile medium combining storytelling, visual art, and play.  They&#39;re every bit as real and meaningful as an opera, a novel, or a painting.   <br/>\n<br/>\nI recently (whoa, it&#39;s been a year already?) quit my job as an animator to stay home with my 8 1/2 month old baby, but my love of video games as a child led me to that job, and to so much in my life, including my husband, the father of my baby.  :)  I&#39;m not saying the original poster&#39;s son will definitely go into a game-related field, just that it&#39;s possible that this will shape his life in lovely, far-reaching, unforeseeable ways.  I hope this helps.<br/>\n<br/>\n-Chelsea</div>","specialLinks":[]},{"userId":475251512,"authorName":"Deb","from":"&quot;Deb&quot; &lt;vwb777@...&gt;","profile":"vwb777","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Faking interest in videogames","postDate":"1307493759","msgId":61452,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlzbWdoditvbXFsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlzbG92aCtsbmVsQGVHcm91cHMuY29tPg=="},"prevInTopic":61451,"nextInTopic":61453,"prevInTime":61451,"nextInTime":61453,"topicId":61427,"numMessagesInTopic":0,"msgSnippet":"Let me throw my pennies in and offer you a bit of support. I kind get the sense you re being hammered here for your very valid concerns and questions. I m not","messageBody":"<div id=\"ygrps-yiv-1952850423\">Let me throw my pennies in and offer you a bit of support. I kind get the sense you&#39;re being hammered here for your very valid concerns and questions. I&#39;m not exactly new at homeschool but we had an eleven year spans between kids and this is my first time homeschooling a boy. And I apologize ahead of time to those of you who are gender neutral but I happen to believe there are very distinct and necessary differences between boys and girls. As you&#39;ve seen, some of those differences come out in the wAy they play. I consider myself an unschooler and try very hard to meet my sons needs, to let him lead me in learning and other life choices, etc. My son loves to play a particular war game. You should know his big brother is fighting in Afghanistan and my husband is retired military. I said all of that to say this. That game bothers me down to my soul. And I watched for months along with my husband and son before he left while my baby blew the brains out of countless enemies with language coming from the speakers that I&#39;m sure rivals a war zone. I tried to tell myself he needed it for whatever reason, that he was being a boy, that I was being controlling.....then I got it. It wasn&#39;t the game it was the blood and guts, grown up cussing and swearing, blood spurting sound that was bothering me. So I talked to my husband, he agreed and now he plays on mute. I&#39;m being wordy I know but I get frustrated when unschooling seems to be the ok sign to stop using our parental instincts. I bet if I asked a child therapistt, he&#39;d have some trouble  with. seven year old listening to that for hours on end. He&#39;s a child! Grown men hear that in war and come back with post traumatic stress disorder. So listen to your maternal instinct. Sometimes no is necessary to protect our children and I promise you it will not damage your relationship. Sorry for taking so much time. Take are.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;antonelladallatorre&quot; &lt;anto40@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; I am relatively new to unschooling (I discovered it about a year ago) but I have been an avid reader of this list and often come to it for inspiration and learning. I&#39;ve been interested especially in the discussions about videogames, since one of my kids (6.1/2 y.o.) is very passionate about the Wii (he played first LEgo Star Wars and now Lego BAtman).<br/>\n&gt; Since I am not a gamer, I have a &quot;limited&quot; appreciation for this activity, but I understand that he is passionate about it and respect this. Nevertheless, I still have to work on myself to accept it entirely and in my heart, I still don&#39;t like it. This is for me a bit of a roadblock because, even though I do not actively interfere with my son&#39;s play, I think that my lack of enthusiasm for the game is evident.  I don&#39;t want to fake interest (or any other emotion for that matter). I do however applaud his newly-acquired skills and rejoice with him when he finishes each level, finds a solution to a problem in the game or draws a picture of one of the villains, but I feel somewhat limited when it comes to building upon his interest. I mean, I am not very creative, utterly uninspired, in that department and feel a bit guilty for it.<br/>\n&gt; Perhaps, if I really wanted to be genuinely involved (and therefore more supportive of his interest), I should examine more closely the reasons of my resistance, which are many.  I am still not convinced that playing the Wii (his technology of choice) impacts his (and our) life  for the better (even if I realize that computer games are a reality that he will, at some point, encounter regardless of my choices).<br/>\n&gt;  Since the gaming began there&#39;s been a lot more talking among my kids (a boy and a girl of 5) about &quot;killing&quot; &quot;shooting&quot;and so on. I dont&#39; like that very much, and I have a hard time engaging in a spontaneous, joyful conversation with them when this happens. Not that I necessarily fear that he will become violent on account of the games (which are only mildly violent compared to most videogames), but I just dislike the fact that his imagination and his thought are so thoroughly colonized by this narrative. <br/>\n&gt; Mine is perhaps a somewhat &quot;old&quot; concern, that others might have already struggled with and already &quot;resolved&quot;, but if anyone is willing to volunteer their thoughts and experience with precisely this kind of struggle, I would be grateful!<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Faking interest in videogames","postDate":"1307477751","msgId":61435,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE2MTk3NS43Njk3Mi5xbUB3ZWI4MTUwNS5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PGlzbG92aCtsbmVsQGVHcm91cHMuY29tPg==","referencesHeader":"PGlzbG92aCtsbmVsQGVHcm91cHMuY29tPg=="},"prevInTopic":61431,"nextInTopic":61447,"prevInTime":61434,"nextInTime":61436,"topicId":61427,"numMessagesInTopic":0,"msgSnippet":"I should examine more closely the reasons of my resistance, which are many. What I see is someone who came to the and read that most here do embrace their","messageBody":"<div id=\"ygrps-yiv-167885801\">&quot;I should examine more closely the reasons of my resistance, which are many.&quot;<br/>\n<br/>\nWhat I see is someone who came to the and read that most here do embrace their children&#39;s video game playing and that we do not limit their play in any way so then you are not limiting your son&#39;s play BUT you have not really understood why people like me embrace our children&#39;s video game playing and why we do not limit it.<br/>\nYou have also not listed your &quot;old&quot; concerns in your post. What are they?<br/>\nWhy do you think we do not limit and and why we embrace  it?<br/>\nOne of the reasons we give the idea of the parent finding a game that they might like and play so they can understand what their children may be getting out of playing video games. There are so many different games it is amazing. Not all games have shooting and/or killing, and most look very different than Lego games!<br/>\nI am not a video gamer but I have played many games I loved and I can totally see what my son gets out of them. I embrace it. I even have my own Nintendo DS!<br/>\nI find stuff about games for him, videos on youtube, books, plush toys, gadgets, clothing, movies and many other things that are realated to what he is in right now. I hope I can save enough money to take my son to Washington DC next year to the Smithsonian&#39;s Video Game exposition and to tour all the places  around the DC area that are featured in one of his favorite games Fallout 3.<br/>\nI also have lots of Lego Star wars  that my son and I had a blast putting together  ( or one that Schuyler put together with him!)<br/>\nVideo games are amazing. Have you see all you can do with the new X-box Kinnect? have you seen the  experiments people and Universities are doing with the Kinnect technology??<br/>\nI am amazing of how much my son , soon to be 9 , has learned from video games and stuff about video games! IT is  incredible. But I am afraid you will only see it if you understand WHY and if you are open to see them and embrace it. You do not have to like playing yourself.<br/>\n<br/>\n<br/>\n<br/>\nAlex Polikowksy<br/>\n<br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Faking interest in videogames","postDate":"1307474224","msgId":61431,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk2RjhDNkQzLUIwNkEtNEM2MS05QkM5LTMzQTA4RjA2M0M1N0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGlzbG92aCtsbmVsQGVHcm91cHMuY29tPg==","referencesHeader":"PGlzbG92aCtsbmVsQGVHcm91cHMuY29tPg=="},"prevInTopic":61430,"nextInTopic":61435,"prevInTime":61430,"nextInTime":61432,"topicId":61427,"numMessagesInTopic":0,"msgSnippet":"... I assume you ve heard the adage that relationships take work. Though I think a better way to phrase it is conscious effort. Staying connected takes","messageBody":"<div id=\"ygrps-yiv-1944627343\">On Jun 7, 2011, at 2:00 PM, antonelladallatorre wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; but I just dislike the fact that his imagination and his thought are  <br/>\n&gt; so thoroughly colonized by this narrative.<br/>\n<br/>\n </span></blockquote>I assume you&#39;ve heard the adage that relationships take work.<br/>\n<br/>\nThough I think a better way to phrase it is &quot;conscious effort.&quot;  <br/>\nStaying connected takes conscious effort. Forming connections with  <br/>\nsomeone you don&#39;t have a lot of natural connections with takes  <br/>\nconscious effort. And it takes conscious effort until it feels  <br/>\nnatural. :-)<br/>\n<br/>\nIf video games were a small part of who he is, and there were lots of  <br/>\nother things you connected through, it wouldn&#39;t be a big deal to pass  <br/>\non the video games. But since it is a passion of his, there isn&#39;t a  <br/>\nshort cut.<br/>\n<br/>\nAre there games the two of you can play together? The Wii has lots of  <br/>\ngames and video sports that are good for the whole family.<br/>\n<br/>\nBut don&#39;t make it a deal of him either appreciating the games you find  <br/>\nyou like or not connecting. Find out what he loves about his games.  <br/>\nHave him show you how to play and play with him :-) Bring food to him  <br/>\nand watch him. Read about the games.<br/>\n<br/>\nThere are moms who get motion sick watching games but they find ways  <br/>\nto connect even if they can&#39;t play :-) You will need to decide which  <br/>\nis more important: connecting with your son or holding onto your  <br/>\npersonal feelings about video games because in this instance you won&#39;t  <br/>\nbe able to do both.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Faking interest in videogames","postDate":"1307473608","msgId":61430,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhERTQwNDkyLTU1QjItNDAxMS04NjY4LURGMTZBNzFCMTcwQUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGlzbG92aCtsbmVsQGVHcm91cHMuY29tPg==","referencesHeader":"PGlzbG92aCtsbmVsQGVHcm91cHMuY29tPg=="},"prevInTopic":61428,"nextInTopic":61431,"prevInTime":61429,"nextInTime":61431,"topicId":61427,"numMessagesInTopic":0,"msgSnippet":"There will be other suggestions, but I have two: Play Plants vs. Zombies.  Not get your kids to play it, but play it yourself.   It will cost $10 or less, I","messageBody":"<div id=\"ygrps-yiv-586422981\">There will be other suggestions, but I have two:<br/>\n<br/>\nPlay Plants vs. Zombies.  Not get your kids to play it, but play it yourself.   It will cost $10 or less, I think, depending what you play it on (computer or iPod touch or Nintendo DS or iPad or something).<br/>\n<br/>\nRead this:<br/>\n<br/>\nKilling Monsters: Why Children Need Fantasy, Super Heroes, and Make-Believe Violence<br/>\nby Gerard Jones<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.amazon.com/Killing-Monsters-Children-Make-Believe-Violence/dp/0465036961\">http://www.amazon.com/Killing-Monsters-Children-Make-Believe-Violence/dp/0465036961</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Faking interest in videogames","postDate":"1307472493","msgId":61428,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI2NDUyODFDLTQ1MDAtNDI2MC1BODc3LUNGRkFDQTNFMjAxNEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGlzbG92aCtsbmVsQGVHcm91cHMuY29tPg==","referencesHeader":"PGlzbG92aCtsbmVsQGVHcm91cHMuY29tPg=="},"prevInTopic":61427,"nextInTopic":61430,"prevInTime":61427,"nextInTime":61429,"topicId":61427,"numMessagesInTopic":0,"msgSnippet":"-=-Since I am not a gamer, I have a limited appreciation for this activity, but I understand that he is passionate about it and respect this. Nevertheless, I","messageBody":"<div id=\"ygrps-yiv-1663136741\">-=-Since I am not a gamer, I have a &quot;limited&quot; appreciation for this activity, but I understand that he is passionate about it and respect this. Nevertheless, I still have to work on myself to accept it entirely and in my heart, I still don&#39;t like it. -=-<br/>\n<br/>\nThen you&#39;re faking respecting his passion, too.<br/>\n<br/>\nRather than get advice about how to fake interest more convincingly, I hope you&#39;re really hoping for advice about how to GAIN an interest.<br/>\n<br/>\n-=-Perhaps, if I really wanted to be genuinely involved (and therefore more supportive of his interest), I should examine more closely the reasons of my resistance, which are many. I am still not convinced that playing the Wii (his technology of choice) impacts his (and our) life for the better (even if I realize that computer games are a reality that he will, at some point, encounter regardless of my choices).-=-<br/>\n<br/>\nIf you look at the paragraph above, you might count the rings of distance between yourself and any possible support, interest or respect.<br/>\n<br/>\nPerhaps<br/>\nif<br/>\nreally<br/>\ngenuinely<br/>\nshould examine<br/>\n<br/>\n<br/>\n-=-Since the gaming began there&#39;s been a lot more talking among my kids (a boy and a girl of 5) about &quot;killing&quot; &quot;shooting&quot;and so on. I dont&#39; like that very much-=-<br/>\n<br/>\nHave they killed anything?<br/>\nHave they asked for real guns?<br/>\n<br/>\nChildren are much better at knowing fantasy from reality than some moms are.  <br/>\n<br/>\n-=- I have a hard time engaging in a spontaneous, joyful conversation with them when this happens. Not that I necessarily fear that he will become violent on account of the games (which are only mildly violent compared to most videogames), but I just dislike the fact that his imagination and his thought are so thoroughly colonized by this narrative. -=-<br/>\n<br/>\nBe very wary of the word &quot;just.&quot;   <br/>\n<br/>\nAnd this is disdainful in a much deeper way that you probably realize:<br/>\n&quot; I just dislike the fact that his imagination and his thought are so thoroughly colonized by this narrative.&quot;<br/>\n<br/>\nIt seems you dislike video games so much that you&#39;re in danger of not liking your son anymore.<br/>\nHis imagination (in your estimation) is overtaken by alien narrative.<br/>\nHis thought (you think) is gone.<br/>\n<br/>\n-=- if anyone is willing to volunteer their thoughts and experience with precisely this kind of struggle, I would be grateful!-=-<br/>\n<br/>\nDoes it need to be *precisely* that kind of struggle?<br/>\n<br/>\nPerhaps thoughts and experience about any of the principles that help unschooling work well would be worthy of your gratitude.<br/>\nIf you see this as a &quot;precise&quot; kind of &quot;struggle,&quot; you won&#39;t be looking at overarching principles, will you?<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":442614894,"authorName":"antonelladallatorre","from":"&quot;antonelladallatorre&quot; &lt;anto40@...&gt;","profile":"antonelladallatorre","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Faking interest in videogames","postDate":"1307469617","msgId":61427,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlzbG92aCtsbmVsQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":61428,"prevInTime":61426,"nextInTime":61428,"topicId":61427,"numMessagesInTopic":0,"msgSnippet":"I am relatively new to unschooling (I discovered it about a year ago) but I have been an avid reader of this list and often come to it for inspiration and","messageBody":"<div id=\"ygrps-yiv-1194439617\">I am relatively new to unschooling (I discovered it about a year ago) but I have been an avid reader of this list and often come to it for inspiration and learning. I&#39;ve been interested especially in the discussions about videogames, since one of my kids (6.1/2 y.o.) is very passionate about the Wii (he played first LEgo Star Wars and now Lego BAtman).<br/>\nSince I am not a gamer, I have a &quot;limited&quot; appreciation for this activity, but I understand that he is passionate about it and respect this. Nevertheless, I still have to work on myself to accept it entirely and in my heart, I still don&#39;t like it. This is for me a bit of a roadblock because, even though I do not actively interfere with my son&#39;s play, I think that my lack of enthusiasm for the game is evident.  I don&#39;t want to fake interest (or any other emotion for that matter). I do however applaud his newly-acquired skills and rejoice with him when he finishes each level, finds a solution to a problem in the game or draws a picture of one of the villains, but I feel somewhat limited when it comes to building upon his interest. I mean, I am not very creative, utterly uninspired, in that department and feel a bit guilty for it.<br/>\nPerhaps, if I really wanted to be genuinely involved (and therefore more supportive of his interest), I should examine more closely the reasons of my resistance, which are many.  I am still not convinced that playing the Wii (his technology of choice) impacts his (and our) life  for the better (even if I realize that computer games are a reality that he will, at some point, encounter regardless of my choices).<br/>\n Since the gaming began there&#39;s been a lot more talking among my kids (a boy and a girl of 5) about &quot;killing&quot; &quot;shooting&quot;and so on. I dont&#39; like that very much, and I have a hard time engaging in a spontaneous, joyful conversation with them when this happens. Not that I necessarily fear that he will become violent on account of the games (which are only mildly violent compared to most videogames), but I just dislike the fact that his imagination and his thought are so thoroughly colonized by this narrative. <br/>\nMine is perhaps a somewhat &quot;old&quot; concern, that others might have already struggled with and already &quot;resolved&quot;, but if anyone is willing to volunteer their thoughts and experience with precisely this kind of struggle, I would be grateful!</div>","specialLinks":[]}],"prevTopicId":61533,"nextTopicId":61423}}