{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] test scores question","postDate":"1277874345","msgId":55520,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGlsRWg4M3VGaHlFQ0pFSjM4MlU5a3R3ZElqTzk4SEtjQWM0TWVXdUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGkwZDRrdStzamxkQGVHcm91cHMuY29tPg==","referencesHeader":"PGkwZDRrdStzamxkQGVHcm91cHMuY29tPg=="},"prevInTopic":55492,"nextInTopic":0,"prevInTime":55519,"nextInTime":55521,"topicId":55457,"numMessagesInTopic":0,"msgSnippet":"I m reading a book called The Mysterious Benedict Society. There s testing in it. And the results are interesting because it shows the many different kinds of","messageBody":"<div id=\"ygrps-yiv-14518201\">I&#39;m reading a book called The Mysterious Benedict Society. There&#39;s<br/>\ntesting in it. And the results are interesting because it shows the<br/>\nmany different kinds of intelligences people have.<br/>\n<br/>\nA page on multiple intelligences: <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/intelligences/\">http://sandradodd.com/intelligences/</a><br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 6/29/10, threegirlmama &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:stephanielabarge@...\">stephanielabarge@...</a>&gt; wrote:<br/>\n&gt; We began unschooling since January of this year and it has been a wonderful<br/>\n&gt; experience so far, and have been going through deschooling and certain<br/>\n&gt; levels of uncertainty on my part but overall taking it slowly and reading a<br/>\n&gt; lot, and I am happy with how things are going. We do live in New York where<br/>\n&gt; standardized testing is required, so my 10 year old took the PASS test last<br/>\n&gt; month and I just received the results.  She did very well, and I am pleased<br/>\n&gt; and relieved, but I also don&#39;t want to base my feelings about how she is<br/>\n&gt; learning on them at all.  I did show it to her and told her I was proud of<br/>\n&gt; her for doing well, but it got me to thinking about the future when perhaps<br/>\n&gt; she might not test as well as this time, or if her sister takes the test and<br/>\n&gt; does better or worse-- I don&#39;t want them to compare themselves to eachother<br/>\n&gt; or for me to compare them because I really do know that they don&#39;t mean that<br/>\n&gt; much, but there is still schoolishness in me that I want to let go of.  I<br/>\n&gt; want them to know that I am proud of them regardless what some test might<br/>\n&gt; say.<br/>\n&gt;<br/>\n&gt; My husband is trusting me as far as unschooling goes, however, I know that<br/>\n&gt; the test scores are more &quot;comforting&quot; to him have a &quot;statistic&quot; that shows<br/>\n&gt; our kids are learning, even though he admits to just randomly filling in<br/>\n&gt; blanks on them when he was in school because he hated them.  So, I guess<br/>\n&gt; that is a separate issue and I am hoping we are able to attend an<br/>\n&gt; unschooling event together, but it just made me think a lot about where we<br/>\n&gt; are in our unschooling journey.<br/>\n&gt;<br/>\n&gt; Well I think I may have already answered my own question about how to handle<br/>\n&gt; the scores, that I will file them and use them for the state requirements<br/>\n&gt; but otherwise not reference them, but if anyone has insight on how they have<br/>\n&gt; handled test scores, I would like to know.  Thanks.<br/>\n&gt;<br/>\n&gt; Stephanie<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ------------------------------------<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] test scores question","postDate":"1277836843","msgId":55492,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg5NTA3OS4zNTk3Ni5xbUB3ZWIxMTA0MDMubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PGkwZDRrdStzamxkQGVHcm91cHMuY29tPg==","referencesHeader":"PGkwZDRrdStzamxkQGVHcm91cHMuY29tPg=="},"prevInTopic":55462,"nextInTopic":55520,"prevInTime":55491,"nextInTime":55493,"topicId":55457,"numMessagesInTopic":0,"msgSnippet":"***She did very well, and I am pleased and relieved, but I also don t want to base my feelings about how she is learning on them at all.  I did show it to her","messageBody":"<div id=\"ygrps-yiv-1441723317\">***She did very well, and I am pleased and relieved, but I also don&#39;t want <br/>\nto base my feelings about how she is learning on them at all.  I did <br/>\nshow it to her and told her I was proud of her for doing well,***<br/>\n<br/>\nPerhaps next time don&#39;t show her the test results unless she asks.  Let her forget about it.  I wouldn&#39;t attach pride to a test score either.  Doing well on a test shouldn&#39;t a bench mark for doing well.  LOTS of school parents do that to their kids.  They see their kids as good or bad ONLY in the light of school and how well they have performed in school based on grades and tests scores.<br/>\n<br/>\nTests don&#39;t prove that learning is happening.  Tests don&#39;t show whether a child is a nice person who is kind to others.  Tests don&#39;t help a kid make honest decision for themselves.  Tests don&#39;t create happy learning.<br/>\n<br/>\nTests only scale your child on how ahead or behind they are in relation to other children of the same age on very specific schoolish bench marks.  Some kids are terrible test takers and brilliant mathematicians.  Some test questions and answers are ambiguous at best giving only a tiny parameter of various answers to a question that could be answered differently and better by a more creative individual.<br/>\n<br/>\nSo, if you must take the test, find the lowest number that your child can have and shoot for that.  Don&#39;t put any emphasis on how well a child does on it.  You don&#39;t even have to look at the test scores.  Let it be a very tiny blip on the radar of a happy life.<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: [AlwaysLearning] test scores question","postDate":"1277828966","msgId":55462,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PERBRTk2MTIyLTA4QkYtNDQxOC1BNkM3LTc4QUY2MjU3OTBCM0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGkwZDRrdStzamxkQGVHcm91cHMuY29tPg==","referencesHeader":"PGkwZDRrdStzamxkQGVHcm91cHMuY29tPg=="},"prevInTopic":55460,"nextInTopic":55492,"prevInTime":55461,"nextInTime":55463,"topicId":55457,"numMessagesInTopic":0,"msgSnippet":"You could do a combination of what your husband used to do and also comply with the law and this: http://sandradodd.com/testing/tests If you do the testing","messageBody":"<div id=\"ygrps-yiv-1896545587\">You could do a combination of what your husband used to do and also  <br/>\ncomply with the law and this:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/testing/tests\">http://sandradodd.com/testing/tests</a><br/>\n<br/>\nIf you do the testing yourself, especially, it&#39;s possible to  <br/>\ninvalidate the score so that you can&#39;t even be in danger of comparing  <br/>\nyour kids to each other or other kids their age and all that.   If the  <br/>\ntesting is done at a facility, you could coach them to make rough  <br/>\nguesses, rather than to really try hard, or maybe to make a pattern  <br/>\nwith the numbers, but stay off &quot;D&quot; which tends to be rarely really the  <br/>\nanswer.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] test scores question","postDate":"1277828280","msgId":55460,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRGNjE5Q0FELUEzQjItNENGRC1CQkRDLTk3ODk5QkU5RkJCOEBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PGkwZDRrdStzamxkQGVHcm91cHMuY29tPg==","referencesHeader":"PGkwZDRrdStzamxkQGVHcm91cHMuY29tPg=="},"prevInTopic":55457,"nextInTopic":55462,"prevInTime":55459,"nextInTime":55461,"topicId":55457,"numMessagesInTopic":0,"msgSnippet":"... The unschoolers I know whose kids are required to do testing just file the tests away without looking at them. They see testing as necessary to comply with","messageBody":"<div id=\"ygrps-yiv-2069538690\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; Well I think I may have already answered my own question about how  <br/>\n&gt; to handle the scores, that I will file them and use them for the  <br/>\n&gt; state requirements but otherwise not reference them, but if anyone  <br/>\n&gt; has insight on how they have handled test scores, I would like to  <br/>\n&gt; know.  Thanks.<br/>\n&gt;<br/>\n </span></blockquote>The unschoolers I know whose kids are required to do testing just file  <br/>\nthe tests away without looking at them. They see testing as necessary  <br/>\nto comply with the law, but not as any measure of what their kids know  <br/>\nor who their kids are.<br/>\nThat is the kind of mental shift that takes you away from schoolish  <br/>\n&quot;tests matter&quot; thinking.<br/>\n<br/>\n  Most unschoolers/homeschoolers are told that their kids will have to  <br/>\nsubmit these tests to the school, should they ever go. So far, I&#39;ve  <br/>\nnever known any school to ask for them.<br/>\n<br/>\nRobin B.</div>","specialLinks":[]},{"userId":429410180,"authorName":"threegirlmama","from":"&quot;threegirlmama&quot; &lt;stephanielabarge@...&gt;","profile":"threegirlmama","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"test scores question","postDate":"1277826526","msgId":55457,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkwZDRrdStzamxkQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":55460,"prevInTime":55456,"nextInTime":55458,"topicId":55457,"numMessagesInTopic":0,"msgSnippet":"We began unschooling since January of this year and it has been a wonderful experience so far, and have been going through deschooling and certain levels of","messageBody":"<div id=\"ygrps-yiv-444659941\">We began unschooling since January of this year and it has been a wonderful experience so far, and have been going through deschooling and certain levels of uncertainty on my part but overall taking it slowly and reading a lot, and I am happy with how things are going. We do live in New York where standardized testing is required, so my 10 year old took the PASS test last month and I just received the results.  She did very well, and I am pleased and relieved, but I also don&#39;t want to base my feelings about how she is learning on them at all.  I did show it to her and told her I was proud of her for doing well, but it got me to thinking about the future when perhaps she might not test as well as this time, or if her sister takes the test and does better or worse-- I don&#39;t want them to compare themselves to eachother or for me to compare them because I really do know that they don&#39;t mean that much, but there is still schoolishness in me that I want to let go of.  I want them to know that I am proud of them regardless what some test might say.  <br/>\n<br/>\nMy husband is trusting me as far as unschooling goes, however, I know that the test scores are more &quot;comforting&quot; to him have a &quot;statistic&quot; that shows our kids are learning, even though he admits to just randomly filling in blanks on them when he was in school because he hated them.  So, I guess that is a separate issue and I am hoping we are able to attend an unschooling event together, but it just made me think a lot about where we are in our unschooling journey.  <br/>\n<br/>\nWell I think I may have already answered my own question about how to handle the scores, that I will file them and use them for the state requirements but otherwise not reference them, but if anyone has insight on how they have handled test scores, I would like to know.  Thanks.<br/>\n<br/>\nStephanie</div>","specialLinks":[]}],"prevTopicId":55261,"nextTopicId":55393}}