{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"djedi","from":"djedi &lt;hearthen@...&gt;","replyTo":"LIST","senderId":"zjCWe-543hhw-7MHM7U1L-ez35sEzLjf-tFBxvMYiqflnJrmaRG-XYp0StRxcWXIfslx84eslHXsd3zQeQnmbaGv60BRXRQ","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: custody issue","postDate":"964720799","msgId":11661,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM5ODA3ODlELjRDMkNFODU4QHRlbHVzcGxhbmV0Lm5ldD4=","referencesHeader":"PDk2NDk1MTEzMi4yMTEzNkBlZ3JvdXBzLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":11660,"nextInTime":11662,"topicId":11661,"numMessagesInTopic":0,"msgSnippet":"... Hi Amy, Seems like a long time ago now - about 9 years! - that my son s father, Ted, decided to file for divorce. We d been living separately for over 4","messageBody":"<div id=\"ygrps-yiv-1008945426\"><blockquote><span title=\"ireply\">&gt;<br/>\n<br/>\n </span></blockquote>Hi Amy,<br/>\nSeems like a long time ago now - about 9 years! - that my son&#39;s father, Ted,<br/>\ndecided to file for divorce. We&#39;d been living separately for over 4 years; my son<br/>\nwas 5. The two had seen each other for a total of about  - oh, I&#39;d say 8 to 12<br/>\nhours in those four years. Ted wanted joint custody because he &quot;wasn&#39;t sure&quot;<br/>\nabout &quot;this homeschooling thing&quot;. He lived 300 miles away, and didn&#39;t want to<br/>\ntake over the parenting or anything, he just wanted to be able to make decisions<br/>\nabout how &quot;his son&quot; should live! He&#39;d pay for the divorce and everything, I<br/>\ndidn&#39;t have to worry about that. He&#39;d take care of it all as soon as he got back<br/>\nfrom his trip to Hawaii. (Nice of him!) Well, as you can imagine, the next day I<br/>\nwent out and got myself a lawyer and filed for divorce on my terms. His case was<br/>\na lost cause from the start, and though the lawyers tried to screw us around and<br/>\nmake it take a lot longer than it should have, and I ended up with a lot less in<br/>\nchild support than I think I should have, I have sole custody of my son, and<br/>\nwe&#39;ve been homeschooling ever since.<br/>\n<br/>\nTed never was able to handle the responsiblilty of fatherhood, and the 6 or 7<br/>\nyears of his life before my son finally divorced his dad were filled with lies<br/>\nand broken promises on Ted&#39;s part, and heartbreak, anger, hatred, guilt, fear and<br/>\nnightmares for my son. Finally, I don&#39;t remember if JL was 6 or 7, at midnight on<br/>\nNew Years Eve, we had a healing circle that included a &quot;funeral&quot; ceremony for the<br/>\nfather that JL never had, and a snuffing of his father&#39;s candle. This part was<br/>\nJL&#39;s inclusion, and it turned out to be crucial to the ceremony. In fact it had<br/>\nto be (rather gleefully) snuffed three times before it was really &quot;done&quot;. After<br/>\nthat the intensity went out of his feelings about his father, and they gradually<br/>\njust faded away. Now, at 14, he has no particular feelings toward his father (not<br/>\nconscious ones anyway), and there has been almost no contact for years (a 30<br/>\nsecond birthday phone call 2 or 3 years ago).<br/>\n<br/>\nA legally simple situation; his demand for joint custody was laughable. I hope<br/>\nall goes well in the situation you are thinking of.<br/>\n<br/>\ndjedi<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt;<br/>\n<br/>\n&gt; ________________________________________________________________________<br/>\n&gt;<br/>\n&gt; Message: 14<br/>\n&gt;    Date: Sat, 29 Jul 2000 23:46:01 EDT<br/>\n&gt;    From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AmyKCA@...\">AmyKCA@...</a><br/>\n&gt; Subject: Re: New to the list<br/>\n&gt;<br/>\n&gt; Hi!  I am new to the list, my name is Amy, and I am the proud mom of one son.<br/>\n&gt;  My ds is 7 1/2 yo, and we are unschoolers.  I also run an award winning<br/>\n&gt; In-Home Daycare for children, lead a 4-H group, and have started a local<br/>\n&gt; homeschooling support group.  Of course, I could not do all of this without<br/>\n&gt; the support of my wonderful hubby, he is the best.  My son is an Active/Alert<br/>\n&gt; child, which is sort of a combination of traits from ADD, ADHD, and ODD.<br/>\n&gt; These children are very bright, but will defy you to the ends of the earth.<br/>\n&gt; Essentially their main problem is that they have hyper-sensitive sensory<br/>\n&gt; perceptions, and therefore feel overwhelmed most of the time.  This in turn<br/>\n&gt; creates a fearful child, who tries to control this fear by controlling<br/>\n&gt; his/her environment (clear as mud?)  Anyway, I really look forward to<br/>\n&gt; exchanging ideas and stories with all of you.<br/>\n&gt;<br/>\n&gt; I do have one request:  If any of you have been involved in a custody issue<br/>\n&gt; with an ex-spouse (that involved homeschooling), and if you don&#39;t mind<br/>\n&gt; sharing your story with other homeschoolers, would you please email me<br/>\n&gt; privately?  Thanks so much.<br/>\n&gt;<br/>\n&gt; Best wishes,<br/>\n&gt; Amy Aponte </span></blockquote></div>","specialLinks":[]}],"prevTopicId":11660,"nextTopicId":7724}}