{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: &quot;Getting&quot; Games - Whether, when and how to intervene?","postDate":"1409415150","msgId":74658,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUxOTg1MjVCLUJGMEQtNDVGRC1CNDhFLTY2QzM1OTNGQkZCNUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGx0czFycysxY2VpNWMxQFlhaG9vR3JvdXBzLmNvbT4=","referencesHeader":"PENBQnhOYUI5dHVxRXFCVWZNVzIrTXppNWF0TW93cVo9QzFYQTRIZXQ5Y1h3SGstRGZPUUBtYWlsLmdtYWlsLmNvbT4gPGx0czFycysxY2VpNWMxQFlhaG9vR3JvdXBzLmNvbT4="},"prevInTopic":74655,"nextInTopic":74659,"prevInTime":74657,"nextInTime":74659,"topicId":74651,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"","specialLinks":[]},{"userId":310848040,"authorName":"Ali Zeljo","from":"Ali Zeljo &lt;azeljo@...&gt;","profile":"azeljo","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] &quot;Getting&quot; Games - Whether, when and how to intervene?","postDate":"1409410695","msgId":74659,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENENEIxODcwLThCRjEtNDc1MC05MUJBLUVDNTM3RUEzNzQ1OEBnbWFpbC5jb20+","inReplyToHeader":"PENBQnhOYUI5dHVxRXFCVWZNVzIrTXppNWF0TW93cVo9QzFYQTRIZXQ5Y1h3SGstRGZPUUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PENBQnhOYUI5dHVxRXFCVWZNVzIrTXppNWF0TW93cVo9QzFYQTRIZXQ5Y1h3SGstRGZPUUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":74658,"nextInTopic":0,"prevInTime":74658,"nextInTime":74660,"topicId":74651,"numMessagesInTopic":0,"msgSnippet":"Hi,  I have four sons who often end up in games that I can guess will end in someone hurt physically or emotionally.  I often run into the midst and call time","messageBody":"<div id=\"ygrps-yiv-720033569\">Hi,  I have four sons who often end up in games that I can guess will end in someone hurt physically or emotionally.  I often run into the midst and call time out.  I engage them in a discussion about ways they can be sure to keep having fun but make sure the big &quot;monster&quot; doesn&#39;t get hurt.  Some suggestions: only fake hitting, only using nerf weapons below the waist, if the &quot;monster&quot; feels overwhelmed he yells &quot;UNCLE&quot; and they all stop.  It doesn&#39;t hurt to stay close by to break in when needed, but still allow the fun.  <br/>\n<br/>\nAnother option that works is to offer to be the monster yourself.  The kids are less likely to beat me up, partly because I&#39;m good at setting my own limits.  There seems to be a huge urge at this age to play good v. evil games.  Moms and dads can make good bad guys, even more satisfying to the urge than when it&#39;s another kid.  They get to have a real camaraderie in figuring out how to trap you.  You can vary the fun by making up capture the flag type games.  You try to steal their treasure, and they try to steal yours.  I find that it really satisfies the urge they have deep inside, and it doesn&#39;t have to involve trapping you physically.<br/>\n<br/>\nHope this helps!!<br/>\nAli</div>","specialLinks":[]},{"userId":359203961,"authorName":"","from":"anna.black@...","profile":"annavblack99","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: &quot;Getting&quot; Games - Whether, when and how to intervene?","postDate":"1409387196","msgId":74655,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGx0czFycysxY2VpNWMxQFlhaG9vR3JvdXBzLmNvbT4=","inReplyToHeader":"PENBQnhOYUI5dHVxRXFCVWZNVzIrTXppNWF0TW93cVo9QzFYQTRIZXQ5Y1h3SGstRGZPUUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PENBQnhOYUI5dHVxRXFCVWZNVzIrTXppNWF0TW93cVo9QzFYQTRIZXQ5Y1h3SGstRGZPUUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":74651,"nextInTopic":74658,"prevInTime":74654,"nextInTime":74656,"topicId":74651,"numMessagesInTopic":0,"msgSnippet":"Does your son enjoy the games?  I couldn t quite tell from your post, My daughter is 7, and tall and strong for her age.  She has one friend in particular who","messageBody":"<div id=\"ygrps-yiv-86629160\">Does your son enjoy the games? &nbsp;I couldn&#39;t quite tell from your post,<div><br></div><div>My daughter is 7, and tall and strong for her age. &nbsp;She has one friend in particular who likes her to pick her up, sometimes she kind of climbs on to her and clings like a monkey. &nbsp;Abi doesn&#39;t mind some of this kind of play, but she gets tired of it after a while.</div><div><br></div><div>I stay nearby and when I can see she&#39;s had enough I call her over on a pretext (do you want a snack/drink of water) and ask her privately if she&#39;s enjoying the game. &nbsp;If she says no, I go back with her and suggest something else for them all to play.</div><div><br></div><div>If I see her telling the other child to stop, and she&#39;s not stopping, I step in very quickly and firmly tell her friend &quot;stop, &nbsp;Abi doesn&#39;t want to play that game&quot;. &nbsp;And then I help them choose a different game, or suggest a walk to the farm next to the park, or call over another friend, or offer any other kind of distraction. &nbsp;</div><div><br></div><div>I&#39;m not sure what principle I&#39;m working from here. &nbsp;Protecting my child from something she&#39;s not enjoying. &nbsp;Helping her navigate social situations. &nbsp;But I don&#39;t stand by ever and let her be the target of unwanted physicality, just because she&#39;s bigger than the kids she&#39;s playing with. &nbsp;</div><div><br></div><div><br></div></div>","specialLinks":[]},{"userId":560876531,"authorName":"Tara & Sky","from":"&quot;Tara & Sky&quot; &lt;wildwestsky@...&gt;","profile":"tarajoe76","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"&quot;Getting&quot; Games - Whether, when and how to intervene?","postDate":"1409341552","msgId":74651,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBQnhOYUI5dHVxRXFCVWZNVzIrTXppNWF0TW93cVo9QzFYQTRIZXQ5Y1h3SGstRGZPUUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":74655,"prevInTime":74650,"nextInTime":74652,"topicId":74651,"numMessagesInTopic":0,"msgSnippet":"(Please feel free to edit if this is too long) My son, 6, has essentially grown up as a only child. He has an adult sister who has never lived with us, and","messageBody":"<div id=\"ygrps-yiv-294607523\"><div dir=\"ltr\">(Please feel free to edit if this is too long)<div><br></div><div>My son, 6, has essentially grown up as a only child. He has an adult sister who has never lived with us, and also several cousins of similar age who lived near us (until last year) and who were raised in attachment parenting, and are now starting public school. My question is about unstructured games the kids play where 4 of them gang up on 1, and it&#39;s always the same individual being chased, attacked, or relegated to &quot;bad&quot; guy. <div>\n<br></div><div>The kids have at times been cared for together at my sister&#39;s or parents&#39; homes, and have always spent a lot of free time together. Now that we live across the country, my son and I spend long stretches of time &quot;living&quot; at my parents&#39; house when we visit. There are five big kids, three 6yo&#39;s and 2 3.5yo&#39;s. This is the first time they have all been together where the smaller kids are now big enough to participate in very physical play. </div>\n<div><br></div><div>As soon as we arrived for our visit this summer, my sister observed that her son (the oldest cousin) was initiating &quot;getting&quot; games - &quot;so-and-so is a monster, let&#39;s get him!!&quot; Or, &quot;so-and-so is a monster, let&#39;s run away!!&quot;  He would direct the other kids - &quot;get that rope, try to capture him&quot;, etc, and that my son was always delegated to be the &quot;bad guy&quot; in these games. She was uncomfortable with the competitive, labeling nature of the games. </div>\n<div><br></div><div>My son is physically bigger than the other kids, and is generally a very easy going, confident, very physical kid who LOVES being chased. I was comfortable letting the kids direct their own play, while my sister wanted to (albeit very skillfully, without being invasive or shaming) redirect them to a more collaborative and less competitive game. But she is right - eventually anyone being chased will tire and start to take it personally.</div>\n<div><br></div><div>At first, I assured her that my son was fine and it was ok to let the kids choose their own game. My interpretation is that 1) the oldest cousin (now that he is really the leader, without competition from my son and with the 3yo&#39;s now big enough to join) is used to directing the other kids in whatever project/game arises; and 2) physically, my son was the only individual capable of taking on the other 4 and having everyone play without restraint. My sister felt that it was a game that could only end badly, since there was no rotation on who was voted the &quot;bad guy&quot; and that the odds of 4:1 would eventually tire him out and someone would probably get hurt if/when he defended himself. </div>\n<div><br></div><div>The question was: whether or not to intervene in these games that seem at once very human (Peter Gray talks about chasing games being biologically human and inherent in every childhood game or adult sport) and simultaneously mean-spirited and isolating. And then, *when, and how* to intervene. My unschooling reading tells me that the answers will be: look at your child, be with your child, have a conversation, offer sparkly choices. </div>\n<div><br></div><div>What does an unschooling parent do when the child is playing the game consentually, logically understands possible consequences, and then gets either their body or their feelings hurt anyway? </div><div>\nWhat more collaborative and sparkly games might entice them to play on teams and not all gang up on one person? What principle could apply here that can be articulated simply and ahead of time to govern, in the spirit of &quot;house rules&quot;? </div>\n<div>Is it possible to redirect them without manipulating their choices?</div><div><br></div><div>I am interested in hearing the experience of other unschooling parents with these types of games and how everyone handled them. The conventional answer seems to be to call the game a &quot;mean&quot; one and just not allow kids to play them, and the terms &quot;redirect, guide&quot; feel manipulative to me (but maybe that&#39;s just me?).<br>\n</div></div></div></div>","specialLinks":[]}],"prevTopicId":74647,"nextTopicId":74635}}