{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":48651385,"authorName":"athom","from":"&quot;athom&quot; &lt;tessimal@...&gt;","profile":"tessimal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"PBS Colonial House - March 31 Deadline!!!","postDate":"1047222619","msgId":60554,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGI0ZmxncitwYzlpQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":60553,"nextInTime":60555,"topicId":60554,"numMessagesInTopic":0,"msgSnippet":"If the 1800 House and Frontier House just got you all revved up to go off to yesteryear for a stint, while the rest of the world watches your every bowel","messageBody":"<div id=\"ygrps-yiv-259304102\">If the &quot;1800 House&quot; and &quot;Frontier House&quot; just got you all revved up <br/>\nto go off to yesteryear for a stint, while the rest of the world <br/>\nwatches your every bowel movement, then never fear because &quot;Colonial <br/>\nHouse&quot; is here!  Check out all the details on recruitment for folks <br/>\nto spend five months living like colonialists in breeches and <br/>\npetticoats in New England: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.pbs.org/wnet/colonialhouse/\">http://www.pbs.org/wnet/colonialhouse/</a> <br/>\n<br/>\nIf you feel that this would appeal to you and your family and you <br/>\nhave always dreamed of living in Colonial Times, and you have <br/>\n5-6 months to sacrifice to the producers of this show, then by all <br/>\nmeans, tally ho!  I&#39;m not sure this would truly qualify as <br/>\nunschooling, since the producers and their lawyers truly have control <br/>\nover your lives during this stint.  But within the context of the <br/>\nperiod one would have no schooling regulations to adhere to, for <br/>\nsure.  And it is definitely hands-on experiential learning!  <br/>\n<br/>\nOf course, I would throw in a few notes of caution based on primary <br/>\npersonal experience. The site doesn&#39;t state who the producers of this <br/>\nversion will be, but in all likelihood it will be Simon Shaw, Beth <br/>\nHoppe and Mark Saben, or some combination of these three, the same <br/>\nproducers who have been involved in the other two PBS/WNET time <br/>\ntravel productions. If the total loss of privacy and the producers&#39; <br/>\ntendency to twist situations around, often setting folks up for all <br/>\nkinds of conflict (to boost ratings), doesn&#39;t deter you, then by all <br/>\nmeans hurry up and apply. <br/>\n<br/>\nAnd please do not count on any stipends for your six months, no <br/>\nmatter what the web site says. For those who don&#39;t know our family <br/>\nwas the runner up family for &quot;Frontier House.&quot; Our photos are still <br/>\nup on the web site. Just go to: <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.pbs.org/wnet/frontierhouse/\">http://www.pbs.org/wnet/frontierhouse/</a> <br/>\nOnce there click on &quot;The Project,&quot; then from the drop down menu, &quot;The <br/>\nSearch.&quot; Our family is in the middle of the page with the video <br/>\nclip. What we learned from our experience was that these guys were <br/>\nlooking for folks who would not only not cost them any money at all, <br/>\nbut in some cases, like the family from Los Angeles who were featured <br/>\non the Frontier House series, those who would actually help them <br/>\nunderwrite their production with generous donations. So, if you have <br/>\nfive to six months to spare, can walk away from your job without any <br/>\nhassles (they say they will help but they never offered to do so, <br/>\neven when we asked; then were a little annoyed and utterly evasive <br/>\nwhen we asked about the stipend they promised on the web site, <br/>\nstarted mumbling about their high production costs, etc.). In other <br/>\nwords they did their best to make us feel that we should be honored <br/>\nto be chosen and grateful to do it for nothing, even to donate funds <br/>\nto help them.   But if you are willing to subject yourselves <br/>\nto whatever they choose to set up for you, to be portrayed in the <br/>\nworst possible situations, for ratings purposes, of course, then by <br/>\nall means volunteer for this adventure. <br/>\n<br/>\nThe deadline has been extended to March 31, 2003. You must fill out <br/>\nthe application on the PBS web site and they will phone you if you <br/>\nare among the chosen few. We received many phone calls, with <br/>\nproducers talking to each family member individually, then visits, <br/>\nvideotaping us.  These phone calls and videotapes then went to <br/>\nproduction teams and focus groups to determine who would be the final <br/>\nthree families.  But when we were less than enthusiastic about <br/>\nsigning a contract with a British production company, relinquishing <br/>\nall rights to adjudicate anything in the United States, and giving <br/>\nover rights to anything even remotely connected with this experience, <br/>\nincluding our thoughts, our words, the lives of our family members, <br/>\nwithout consulting an attorney first, well, let&#39;s just say <br/>\nthat we were no longer at the top of their list, were demoted to <br/>\nrunners up. <br/>\n<br/>\nThey are really looking for whoever will be the easiest for them to <br/>\nwork with, those who will present no problems, either legally, <br/>\nfinancially, or those who might be upset by what they ultimately do <br/>\nto them via the finished production&#39;s portrayal of them. Otherwise <br/>\nthis is a great opportunity for the right persons, the right <br/>\nfamilies, to live the colonial reality for 5-6 months. Do check it <br/>\nout if you are interested and if you can rearrange your life to suit <br/>\ntheir needs. <br/>\n<br/>\nWe are glad that we went through the selection process during which <br/>\ntime we studied and learned a great deal about the Frontier House <br/>\nperiod. But we are even happier that we were not finalists after <br/>\nwatching the series. Many of the things that they ended up doing were <br/>\nnot things that they ever disclosed to us. Basically I felt that the <br/>\nseries lacked integrity when those who repeatedly violated the <br/>\nagreements were kept on the set (probably because they had <br/>\ncontributed so much money to the production!). But if we had been in <br/>\na financial position to just pull up and walk away for the five <br/>\nmonths of production, without threatening our futures, then we would <br/>\nhave happily done it. Basically I guess what I am saying is that <br/>\nthis sort of thing really is meant for rich folks, or folks who do <br/>\nnot have any obligations, like the young couple on Frontier House.<br/>\n<br/>\nThe parallel Canadian production, &quot;Pioneer Quest: A Year in the Real <br/>\nWest,&quot; done by the CBC, booted the couple who broke the rules <br/>\nimmediately and brought in someone else. They also did give a <br/>\nsubstantial cash payment at the end to each participant who survived <br/>\nthe year of living on the Canadian frontier, compensating them for <br/>\ntheir sacrifices. The Canadians have also done two other series <br/>\nincluding &quot;Klondike: The Quest For Gold.&quot; We feel they have handled <br/>\ntheir productions with much more honesty and integrity. Oh, well. <br/>\n<br/>\nHere&#39;s your chance to not only be in a reality series, but to learn <br/>\nabout and live in history! Why not? If you fit the bill and can <br/>\ntake off for a year, have family or someone who can pay your bills, <br/>\ntake care of your property for you, have a business or job you can <br/>\nleave for up to six months without detrimental consequences, do not <br/>\nhave very young children (too dangerous), have no health concerns <br/>\nthat would interfere with a colonial way of living, then these kinds <br/>\nof chances don&#39;t come along very often. And who better than home <br/>\neducators to understand that 6 months away from &quot;school&quot; is no big <br/>\ndeal? <br/>\n<br/>\nDo check it out if you are interested.  We were all very enthusiastic <br/>\nwhen we applied and went through the process for Frontier House.  But <br/>\nwe became less and less enthusiastic as we began to notice that we <br/>\nwere basically just props for the producers who were not being <br/>\nentirely honest with us about lots of things regarding this <br/>\nproduction.  But then, that&#39;s the theatre!  And make no mistake, this <br/>\nis theatre, but you will have to live it as real life, every day for <br/>\nfive to six months.  I asked my husband if he wanted to apply again.  <br/>\nHe said, &quot;No dear, but feel free to do it without me, if that&#39;s what <br/>\nyou really want to do!&quot;  I asked my teenage daughter if she&#39;d  be <br/>\nwilling to do it and she said, &quot;Mom!&quot;  I think that pretty much sums <br/>\nit up.<br/>\n<br/>\nTo read more about all these historical reality series visit:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.erasofelegance.com/realitytv.html\">http://www.erasofelegance.com/realitytv.html</a><br/>\n<br/>\nNorma</div>","specialLinks":[]}],"prevTopicId":60469,"nextTopicId":60556}}