{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"strandbe@aol.com","from":"strandbe@...","replyTo":"LIST","senderId":"MAW22UOTQbI3XDUweketNSNgI-8yMYzltJ5SQ3ZUyEVUgaEIO1q-vvgJSMI0X5CpJ5TTAkepxw","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Some vegetarian ideas","postDate":"963639953","msgId":11103,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{},"prevInTopic":0,"nextInTopic":0,"prevInTime":11102,"nextInTime":11104,"topicId":11103,"numMessagesInTopic":0,"msgSnippet":" You weren t askin me, Julie, but I ll jump right in","messageBody":"<div id=\"ygrps-yiv-1857002963\">&lt;&lt;Please share <br/>\nwhat you have eaten in, say the last 2-3 days, just to give us hopefulls some<br/>\nideas.&gt;&gt;<br/>\n<br/>\nYou weren&#39;t askin me, Julie, but I&#39;ll jump right in anyway!  :)  We&#39;ve been vegetarian for almost 18 years (dh mostly, two girls and I completely, with oldest dd vegan).<br/>\n<br/>\nOne recipe we really enjoy in the summer (not my vegan dd, obviously!) is CLT or PLT sandwiches, a substitute for the beloved BLT. The bacon is replaced by fried provolone cheese, which sounds strange but really works well.<br/>\n<br/>\nKraft makes sliced rounds of smoked provolone cheese, as does Sargento. Actually, I prefer Sargento&#39;s because the are sliced thinner.<br/>\n<br/>\nI put the rounds in a non-stick pan (VERY important--using a regular pan will cause a big mess) and fry them over medium heat, then drain them on a paper towel. The cheese loses most of it&#39;s fat, leaving behind crispy slices that can be broken apart and put onto sandwiches with tomatoes, lettuce and mayonnaise. In between batches of cheese, I pour off the oil and wipe the pan. My dd likes hers fried just to brown, but I like mine done really well--the crisper the cheese, the more it tastes like bacon. She&#39;s never had real bacon, so she probably isn&#39;t after a particular taste/texture.<br/>\n<br/>\nAnother product to look for is TVP (texturized vegetable protein--soy) chunks--large hunks of tvp that work really well in soups and stews and are very reminiscent of chicken. Co-ops either carry these or can probably order them.<br/>\n<br/>\nSummertime salads can be meals in themselves if they include garbanzo beans (chickpeas), toasted sunflower seeds, frozen green soybeans and, for non-vegans, hard-boiled eggs in addition to myriad veggies/fruits we put in: different kinds of lettuce, broccoli, cauliflower, radishes, carrots, jicama, avocado and tomato.<br/>\n<br/>\nMore later!<br/>\n<br/>\nSusan</div>","specialLinks":[]}],"prevTopicId":11088,"nextTopicId":11104}}