{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] an old statement about help, and new request","postDate":"1069716939","msgId":85305,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFmMC4xNDJlYzBjOS4yY2YzZWZjYkBhb2wuY29tPg=="},"prevInTopic":85300,"nextInTopic":85308,"prevInTime":85304,"nextInTime":85306,"topicId":85270,"numMessagesInTopic":0,"msgSnippet":"In a message dated 11/24/03 2:03:29 PM, dezigna@comcast.net writes: ","messageBody":"<div id=\"ygrps-yiv-644757371\">In a message dated 11/24/03 2:03:29 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dezigna@...\">dezigna@...</a> writes:<br/>\n<br/>\n&lt;&lt; Maybe there should be a standard answer that gets sent out by one of<br/>\nthe moderators: Please go to the FAQ page.  Am I just cynical? &gt;&gt;<br/>\n<br/>\nYeah, but that&#39;s okay.<br/>\n<br/>\nIf ALL we ever do is say &quot;read the rules, read the FAQ&quot; it will be as boring <br/>\nas if we discuss R-4s all the time (especially since only nine people are in <br/>\nCalifornia &lt;g&gt;).<br/>\n<br/>\nSome balance might be good, though.  A FAQ for those who are into reading <br/>\nstuff like that would give them a boost toward the deeper parts of the <br/>\ndiscussions.  They could help the rest of us answer the repetitive questions.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"dezignarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] an old statement about help, and new request","postDate":"1069703994","msgId":85300,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PDYuMWNjNWZmZDguMmNmMzVmYTRAYW9sLmNvbT4="},"prevInTopic":85270,"nextInTopic":85305,"prevInTime":85299,"nextInTime":85301,"topicId":85270,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-247632930\">&lt;&lt;We don&#39;t have a FAQ yet.  That might be nice, for newer people to the<br/>\nlist.  <br/>\nIf you guys write the questions, Joyce can write the answers!  (Okay, we <br/>\nwon&#39;t make Joyce do ALL the work.)<br/>\n<br/>\nMaybe people here could propose questions AND answers for them, for <br/>\nnewcomers. &gt;&gt; <br/>\n<br/>\n<br/>\n<br/>\nI think this could be fun to do for its own sake, but I wouldn&#39;t expect this<br/>\nto remove repetitive basic questions from some new people even if the exact<br/>\nquestion is answered. How many people seem to write &quot;I know it says to read<br/>\nfor a while before posting but, how do I get my child to read? She just sits<br/>\nall day and watches tv, unless I make her go outside.&quot;<br/>\n<br/>\nI left another list, partly because this list was better, and partly because<br/>\nI got so tired of the same endless questions about how to file an R-4 posted<br/>\ndaily, despite the introduction directing people back to the list&#39;s parent<br/>\ngroup page that has step-by-step instructions on how to do it, and FAQ<br/>\npages. Some people are lazy, some people want to feel special. I see<br/>\nsometimes people ask a silly question and get invited to read for a while<br/>\nlonger. Maybe there should be a standard answer that gets sent out by one of<br/>\nthe moderators: Please go to the FAQ page.  Am I just cynical?<br/>\n<br/>\nRobyn L. Coburn<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":77662315,"authorName":"arcarpenter2003","from":"&quot;arcarpenter2003&quot; &lt;arcarpenter@...&gt;","profile":"arcarpenter2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"We&#39;re doing it -- Thank You!  (was, &quot;an old statement . . .)","postDate":"1069698864","msgId":85308,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJwdGl2ZytvNWFzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDYuMWNjNWZmZDguMmNmMzVmYTRAYW9sLmNvbT4="},"prevInTopic":85305,"nextInTopic":0,"prevInTime":85307,"nextInTime":85309,"topicId":85270,"numMessagesInTopic":0,"msgSnippet":"... I don t ... they came for. Sandra and all, I hear your frustration, so maybe this is a good time to jump in with my story.  Fisher left first grade two","messageBody":"<div id=\"ygrps-yiv-1823989415\"><blockquote><span title=\"ireply\">&gt; It&#39;s hard helping a lot of people at once.<br/>\n&gt; It&#39;s too much for volunteers to help each person individually.<br/>\n&gt; I learn from the exchanges when we get some good ideas flowing, and<br/>\n </span></blockquote>I don&#39;t <br/>\n<blockquote><span title=\"ireply\"> &gt; want to abandon the full-list format, but sometimes it&#39;s really, truly <br/>\n&gt; frustrating to find people complaining that they didn&#39;t get what<br/>\n </span></blockquote>they came for.<br/>\n<br/>\nSandra and all,<br/>\n<br/>\nI hear your frustration, so maybe this is a good time to jump in with<br/>\nmy story.  Fisher left first grade two weeks ago and has been<br/>\nunschooling ever since.  I have gone through every conceivable<br/>\nemotion, especially during the week we made the decision and had to<br/>\ntell people.  But every time I panic, every time I think &quot;dear God,<br/>\nwhat have I done,&quot; I make myself read the posts on the web site, or go<br/>\nto SandraDodd.com, or pick up a John Holt book.  If I was on the web<br/>\nsite, I would specifically look for Sandra&#39;s posts, or Joyce&#39;s or<br/>\nPam&#39;s or some of the other long-timers -- my time is limited and I<br/>\njust wanted to get to the voices of unschooling for the moment, and<br/>\nnot to the questions -- I wanted to jump right to the &quot;answers.&quot;  &lt;G&gt;<br/>\n<br/>\nAnd it worked.  We&#39;re having a great time.  We&#39;re watching all kinds<br/>\nof TV and wondering lots of things about the shows we&#39;re watching.  We<br/>\nwrite down lists of Toys We&#39;re Interested In from the commercials.  We<br/>\nplay Pokemon and Yu-gi-oh -- the card games and pretend adventures,<br/>\nsometimes with some Dora thrown in.  Fisher made up an awesome game<br/>\nthat we played with the characters from Yu-gi-oh making up imaginary<br/>\nteams -- he threw a ball up the steps, counted which step it landed<br/>\non, divided that number in half, and that was the score for that<br/>\nplayer.  After a bunch of rounds, we added up the scores -- he worked<br/>\nwith the math because, after all, it was his game and he wanted to<br/>\nknow how to score it.  We&#39;ve run to Toys R Us to buy a Yu-gi-oh<br/>\nmonster shootout game that he saw advertised and really wanted --<br/>\nbefore we went we had a great discussion about money and how our<br/>\nhousehold finances work (since I had to make sure I had enough money<br/>\nto buy the game &lt;g&gt; -- I didn&#39;t have enough for all the extra figures,<br/>\nso he chipped in with his saved birthday/allowance money).<br/>\n<br/>\nMost of all, I have my son back.  Slowly he&#39;s coming back from being<br/>\nover-scheduled and somewhat sullen.  He has loads of time to play with<br/>\nhis baby brother, and I get more hugs and kisses than I&#39;ve gotten in<br/>\nmonths.  He got sad about missing school exactly twice, when he saw<br/>\nthe big good-bye card that his class made for him.  After that, I<br/>\nasked him if he missed school and the answer was immediate and simple: no.<br/>\n<br/>\nI still have questions that I&#39;ll bring up another time, but for right<br/>\nnow, you should know that what you&#39;re doing is helping.  I let go of<br/>\nthe side of the pool and whaddya know, the water does hold me up!  So<br/>\nthank you.<br/>\n<br/>\nPeace,<br/>\nAmy</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"an old statement about help, and new request","postDate":"1069680036","msgId":85270,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYuMWNjNWZmZDguMmNmMzVmYTRAYW9sLmNvbT4="},"prevInTopic":0,"nextInTopic":85300,"prevInTime":85269,"nextInTime":85271,"topicId":85270,"numMessagesInTopic":0,"msgSnippet":"We are here to help each other learn. A statement like the above is like a Christian man going to a Rabbi and asking for help with his faith. Then crying out","messageBody":"<div id=\"ygrps-yiv-1312930127\">&quot;We are here to help each other learn. A statement like <br/>\nthe above is like a Christian man going to a Rabbi and asking for help with <br/>\nhis faith. Then crying out *WHY didn&#39;t you help me? The advice you gave <br/>\ndoesn&#39;t apply to my Christian life!* The Rabbi can only help from his Jewish <br/>\npoint of view. We can only help from our Unschooling lives point of view. We <br/>\ncan&#39;t give advice on punishments. Other than to say we don&#39;t use them, and we <br/>\nfeel they don&#39;t work, and we feel there are more effective ways to live with <br/>\nour children.&quot;<br/>\n<br/>\nThis is a year old.  It was written by one of the wise homeschooling moms <br/>\nnamed &quot;Nancy.&quot;  Now I wish I knew which one.   But it was good, and it&#39;s still <br/>\ngood.<br/>\n<br/>\nWhen someone hates the ideas presented here, it&#39;s hard, but if we give people <br/>\nadvice they like regardless of what we really believe, we&#39;re not really going <br/>\nto be helping anybody.<br/>\n<br/>\nI was talking to Holly and Marty about people getting angry when we say &quot;eep&quot; <br/>\nabout ideas like walking away from a kid who&#39;s crying and locking him out.  <br/>\nThey both got big eyes about that story, and I wish I could magically (or <br/>\nelectronically) convey the looks on their faces.    I think they&#39;ll be really good <br/>\nparents, and if they do better than I did, WONDERFUL!  If they say &quot;I just <br/>\ndecided to be a better mom than my mom was,&quot; that would be great.  I have screwed <br/>\nup in an assortment of ways, but I keep moving toward the me I would like to <br/>\nbe.<br/>\n<br/>\nOne of the moms who left the list (but might come back, I don&#39;t know) said I <br/>\ntreated her like she wasn&#39;t smart (I don&#39;t have the exact quote here, and <br/>\nthat&#39;s okay).<br/>\n<br/>\nThat&#39;s a hard thing to answer.  If I respond to ideas on the merit of the <br/>\nidea itself, I thinying, &quot;Well this one should be cut slack or ignored because <br/>\nshe seems not to be thinking very well,&quot; that would seem to me when I was <br/>\ntreating someone as though she were less intelligent.   <br/>\n<br/>\nSo it&#39;s a problem for me.  Assuming everyone is really on equal footing may <br/>\nnot be realistic, but sorting and treating some as second-string isn&#39;t nice.<br/>\n<br/>\nOn the discussion boards someone wrote a long request for information, and <br/>\nafter I wrote a long response, she said &quot;I came here for help.  Can anyone help <br/>\nme?&quot;  (Or some such.)   Others did respond too, but although she asked me <br/>\ndirect (and seemingly snarky) questions,  I wrote this:<br/>\n<br/>\nBy Sandra Dodd (Sandradodd) on Sunday, November 23, 2003 - 04:35 pm:<br/>\n-=-I am asking for advice on unschooling. . . .Can <br/>\nanyone help me? -=- <br/>\n<br/>\nIf you came to me with a hammer in your hands <br/>\nsaying you wanted to learn to play recorder, I <br/>\nwould ask you to put down the hammer. <br/>\n<br/>\nI AM trying to help. <br/>\n<br/>\nI will lend you a recorder. I will GIVE you a <br/>\nrecorder, but you need both hands free to accept <br/>\nit. <br/>\n<br/>\nSandra <br/>\n<br/>\n-----<br/>\n<br/>\nI feel bad, because her first post was very enthusiastic, but it was <br/>\ndisdainful of her kids in a way, and clearly she doesn&#39;t want to give up making them <br/>\nread, telling them what to do, and getting &quot;results&quot; she&#39;s already foreseen.   <br/>\nBut it was (in terms of Nancy&#39;s analogy) as though she was gushing full voice <br/>\nabout what a WONDERFUL church this was and how at home she was going to be, <br/>\nand someone said &quot;it&#39;s a synagogue, but you&#39;re welcome,&quot; and she said  &quot;I came <br/>\nhere for a church, when is Mass?&quot;<br/>\n<br/>\nIt&#39;s hard helping a lot of people at once.<br/>\nIt&#39;s too much for volunteers to help each person individually.<br/>\nI learn from the exchanges when we get some good ideas flowing, and I don&#39;t <br/>\nwant to abandon the full-list format, but sometimes it&#39;s really, truly <br/>\nfrustrating to find people complaining that they didn&#39;t get what they came for.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/lists/info\">http://sandradodd.com/lists/info</a><br/>\n<br/>\nWe don&#39;t have a FAQ yet.  That might be nice, for newer people to the list.  <br/>\nIf you guys write the questions, Joyce can write the answers!  (Okay, we <br/>\nwon&#39;t make Joyce do ALL the work.)<br/>\n<br/>\nMaybe people here could propose questions AND answers for them, for <br/>\nnewcomers.  <br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":5332,"nextTopicId":85034}}