{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"adarl52357@aol.com","from":"adarl52357@...","replyTo":"LIST","senderId":"kzf1BulpN4rLxuy_f_Ff2vPCe6KzQQ-Q_MT1SdL4gEtdjPBsXSxl74dJL9oSfa_UcHHkA91j8gGr","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: late readers and umbrella groups","postDate":"972409624","msgId":13768,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY1LjNlMmFkOWYuMjcyNzI1MThAYW9sLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":13767,"nextInTime":13769,"topicId":13768,"numMessagesInTopic":0,"msgSnippet":"Dear folks, Lots of great posts on reading!  As for the question of dealing with the school district, in some places there are homeschool umbrella","messageBody":"<div id=\"ygrps-yiv-2043122728\">Dear folks, <br/>\n    Lots of great posts on reading!  As for the question of dealing with the <br/>\nschool district, in some places there are homeschool umbrella organizations <br/>\nthat are legally set up as private schools. If you enroll with one then you <br/>\ninteract with them rather than with the public school people. They are <br/>\ngenerally inexpensive as they provide only protection, support and a bit of <br/>\nrecord keeping.  Each state has it&#39;s own laws about the relationship between <br/>\nprivate and public schools. In Maryland only private religious schools are <br/>\nexempt from interference by the state (at least when I was there) in <br/>\nCalifornia it&#39;s all private schools.<br/>\n     When we were in Baltimore I signed up with the public school district. <br/>\nIt didn&#39;t work out very well. I couldn&#39;t offer them enough &quot;proof&quot; that my <br/>\ndaughter who was then 11 or 12 was doing schoolwork, Even though she was a <br/>\nvoracious reader how did I KNOW she understood what she was reading etc. They <br/>\ndecided I was not complying with the law and educating my children properly <br/>\nand scheduled another review. I then called &quot;The Learning Community&quot; an <br/>\numbrella group which was run by Manfred Smith and legally connected with some <br/>\nspiritual community and signed up. One of the most fun experiences of my life <br/>\nwas calling the school district guy and saying, &quot;I won&#39;t be keeping the <br/>\nappointment for the review. I&#39;ve signed up with TLC.&quot; He said, &quot;You can&#39;t do <br/>\nthat!&quot; and I replied, &quot; Oh yes I can, give Manfred a call and ask him.&quot; I <br/>\nmust admit I derived tremendous satisfaction from this. Manfred was one of <br/>\nthe main people involved in changing the Maryland laws about homeschooling <br/>\nand the guy knew who he was.<br/>\n    So anyway, perhaps one of these organizations might be available in your <br/>\narea. Manfred might know about these in other states. He is currently the <br/>\npresident of the Maryland Hone Education Association. His e-mail and voice <br/>\nmail info are on their website at www.mhea.com. Writing this prompted me to <br/>\nfind his website. I haven&#39;t thought about him in years, how delightful to <br/>\nremember!  <br/>\n                               Love to all, Amalia</div>","specialLinks":[]}],"prevTopicId":13763,"nextTopicId":13769}}