{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":11,"messages":[{"userId":174907773,"authorName":"Holly Selden","from":"&quot;Holly Selden&quot; &lt;HLSelden@...&gt;","profile":"holly_selden","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Regarding &quot;Laws&quot; and breaking them...","postDate":"1078857638","msgId":90835,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDYwMWM0MDYwNiQwNDZiMDczMCRkMjgzYjE0MkBuYXRlYml0Y2g+","referencesHeader":"PDRiLjM5Y2FhZTJkLjJkNWJiZmQwQGFvbC5jb20+"},"prevInTopic":90825,"nextInTopic":90846,"prevInTime":90834,"nextInTime":90836,"topicId":90795,"numMessagesInTopic":0,"msgSnippet":"The point of mentioning Joe s asking me to help him address the envelope wasn t to say I was worried about them reading late, but to point out that I want that","messageBody":"<div id=\"ygrps-yiv-1481504779\">The point of mentioning Joe&#39;s asking me to help him address the envelope wasn&#39;t to say I was worried about them reading late, but to point out that I want that kind of thing to be &quot;okay&quot; for my kids without being scared of the &quot;Big Bad School Board&quot;.  <br/>\n<br/>\nMy husband and BIL are two of the brightest young men I know.  They are smart, funny, kind, successful and happy.  I just remember thinking &quot;wow, I kind of took for granted that everyone know how to do this!!!&quot;<br/>\n<br/>\nWhen I began this adventure, I truly thought I&#39;d find some cirriculum that worked for us and that would be it.  Until I asked Madison to sit down and practice his handwriting.  The look in his eyes was like I&#39;d just slapped him in the face.  Unschooling had been my gut reaction years ago when I considered homeschooling and I reverted back to that.  So glad I did.<br/>\n<br/>\nI don&#39;t give a rat&#39;s patootie if they can recite memorized facts that they won&#39;t ever have to recite in daily life.  I just want them to live.  I want them to love life.  I want to watch them grow into the individuals that I know they are.  I want to KNOW my kids.<br/>\n<br/>\nI thank my stars every day for my DH.  He&#39;s so insightful and we have this connection that is just amazing.  I&#39;ll say something that to some people may sound so far out of left field it&#39;s almost right and he GETS it.  I love that.  And I love my MIL for giving me that gift.  :)<br/>\n<br/>\nMorgan asked me today if she could watch me do my taxes.  I said &quot;It&#39;s boring&quot;...she said &quot;So, I just want to be with you&quot;...The proof is in the pudding.  :)<br/>\n<br/>\nHolly<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a> <br/>\n  Sent: Wednesday, February 11, 2004 11:26 AM<br/>\n  Subject: Re: [UnschoolingDiscussion] Regarding &quot;Laws&quot; and breaking them...<br/>\n<br/>\n<br/>\n<br/>\n  In a message dated 2/11/04 4:15:20 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HLSelden@...\">HLSelden@...</a> writes:<br/>\n<br/>\n  &lt;&lt;  I&#39;ll never forget a 16 year old coming to me and asking me if he <br/>\n  addressed an envelope correctly.  He hadn&#39;t.  I taught him how.  &gt;&gt;<br/>\n<br/>\n  But what good does it do a ten year old to know if she doesn&#39;t have anyone to <br/>\n  write to?<br/>\n  and if someone needs to know, why can&#39;t he just look at several other <br/>\n  envelopes and copy that format?<br/>\n<br/>\n  It&#39;s SO minor a deal, and people ever only learn it once.  After that, <br/>\n  they&#39;re just reviewing, or going through the motions to satisfy yet ANOTHER teacher.<br/>\n<br/>\n  &lt;&lt;My question is...how did these families get through the system?  I know how <br/>\n  my mother in law did it.  She was (to quote my husband) &quot;on the run&quot;.  &gt;&gt;<br/>\n<br/>\n  Very few states require yearly testing.  A few require occasional.  Many <br/>\n  require none.<br/>\n<br/>\n  Floridians will have helped you out by now, I&#39;m sure, but as to the idea of <br/>\n  &quot;late,&quot; it&#39;s best to find ways to live without having to worry about it.<br/>\n<br/>\n  Sandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":174907773,"authorName":"Holly Selden","from":"&quot;Holly Selden&quot; &lt;HLSelden@...&gt;","profile":"holly_selden","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Regarding &quot;Laws&quot; and breaking them...","postDate":"1078856222","msgId":90824,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMjcwMWM0MDYwMiRiOGNiNzdlMCRkMjgzYjE0MkBuYXRlYml0Y2g+","referencesHeader":"PDRlLjI3OGZhMzdmLjJkNWI5YjJmQGFvbC5jb20+"},"prevInTopic":90810,"nextInTopic":90825,"prevInTime":90823,"nextInTime":90825,"topicId":90795,"numMessagesInTopic":0,"msgSnippet":"I think this flu/stuffiness may have been preventing the whole breathing thing.  LOL I got a couple of private emails and managed to get in contact with a","messageBody":"<div id=\"ygrps-yiv-1076432535\">I think this flu/stuffiness may have been preventing the whole breathing thing.  LOL<br/>\n<br/>\nI got a couple of private emails and managed to get in contact with a &quot;private&quot; school that is pro-unschooling.  All they do is keep attendance records and there is no charge/tuition/fees, etc.  <br/>\n<br/>\nA few people have also suggested that I start my own.  Although I&#39;m eager to help out, I&#39;m not sure I&#39;m quite ready for that just yet!!!<br/>\n<br/>\nThank you so much for the info..I was really having a panicky moment there for a few.  <br/>\n<br/>\nHolly<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jrossedd@...\">jrossedd@...</a> <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a> <br/>\n  Sent: Wednesday, February 11, 2004 8:50 AM<br/>\n  Subject: Re: [UnschoolingDiscussion] Regarding &quot;Laws&quot; and breaking them...<br/>\n<br/>\n<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HLSelden@...\">HLSelden@...</a> writes:<br/>\n<br/>\n<br/>\n         What is it they say here? Breathe!<br/>\n<br/>\n         Unschoolers in FL have answers to all these legal fear factors, with a <br/>\n  pretty good track record so far. :)<br/>\n<br/>\n         First, the legal requirement is academic progress &quot;commensurate with <br/>\n  the child&#39;s ability&quot; and that&#39;s a piece of cake for successful unschoolers, <br/>\n  imo. Always has been for us. How could a child fail to measure up to himself (an <br/>\n  unschooling child, I mean, not a schooled child being royally screwed up like <br/>\n  in the Rosemond column I posted yesterday!)<br/>\n<br/>\n         There really are certified teacher-evaluators in Florida who share the <br/>\n  unschooling philosophy and are willing to help; I&#39;ve even heard of a few <br/>\n  happy to arrange a fax or email exchange to review your child&#39;s portfolio, for <br/>\n  those who can&#39;t find an evaluator in their area they especially like. You could <br/>\n  subscribe to the yahoo group &lt;FL-HomeEducation-law&gt; for more.<br/>\n<br/>\n         Second, Florida also has a different legal option to comply with <br/>\n  compulsory attendance requirements. If the independent home education statute <br/>\n  doesn&#39;t work well for your family, for whatever reason, you can enroll in a <br/>\n  &quot;private school&quot; that matches your personal philosophy of learning and will support <br/>\n  your unschooling as you wish it to (no curriculum, tests, or organized classes) <br/>\n  -- there are  unschoolers who offer these &quot;schools&quot; free of charge, as a <br/>\n  service to others. <br/>\n<br/>\n         You could even start such a &quot;school&quot; yourself and thereby help others! <br/>\n  I know unschoolers who have done this. Some estimate that that there are more <br/>\n  FL homeschoolers using this option than the total registered under the <br/>\n  independent statute and stuck filing annual evaluations.See more at<br/>\n  &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.parentdirectededucation.org/Homeschooling%20in%20Florida.htm\">http://www.parentdirectededucation.org/Homeschooling%20in%20Florida.htm</a>&gt;<br/>\n<br/>\n         I should note that one disadvantage of the private school option over <br/>\n  independent home education is that Florida law provides broad public program <br/>\n  access for independent home ed families who wish it, like dual enrollment in <br/>\n  for-credit high school and college courses, free virtual classes, <br/>\n  extracurricular participation parttime at local schools (symphony, sports teams, et cetera.) <br/>\n  This is not available if you go the private school route instead, although <br/>\n  large &quot;regular&quot; privates often have certain access under their own agreements.<br/>\n<br/>\n         And although &quot;private school homeschooling&quot; shields you completely <br/>\n  from the school superintendent, you then do have to send your child&#39;s basic <br/>\n  identifying info, including certain medical info, and attendance records, to the <br/>\n  &quot;school&quot; office you choose. (So you can either be on file with the government or <br/>\n  some private citizens or businesspeople who are unaccountable and perhaps <br/>\n  even unknown to you! I&#39;m not crazy about either one, but there it is. Unless you <br/>\n  become a school yourself.) <br/>\n<br/>\n         Lastly -- for this post at least -- the worst that can happen to an <br/>\n  unschooler under the FL home ed statute is a sort of probation that gives you a <br/>\n  year to come into compliance -- in other words, to show the child has made <br/>\n  progress commensurate with ability, under any legal method. At the end of that <br/>\n  second year, the worst that could happen is that the Superintendent could <br/>\n  &quot;terminate&quot; your home ed program for non-compliance and say you had to put the child <br/>\n  in &quot;school.&quot;<br/>\n<br/>\n         All the scary stuff, the truancy and CPS interventions, cannot kick in <br/>\n  because of academic failure. They are for the parent&#39;s legal compliance <br/>\n  failure, things like not keeping any portfolio or reading materials list, failing <br/>\n  to turn any evaluation at all, or failure to register your child anywhere under <br/>\n  any option. You don&#39;t want anything to do with these legal problems, believe <br/>\n  me! Fortunately they are very easy to avoid because there are several fine <br/>\n  options for unschoolers. JJ (see pompous sig below in case you find it useful to <br/>\n  cite me as an authority on Florida unschooling provisions &lt;g&gt;)<br/>\n<br/>\n  JJ Ross, Ed.D.<br/>\n  Legislative and Education Resources<br/>\n  www.ParentDirectedEducation.org<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":174907773,"authorName":"Holly Selden","from":"&quot;Holly Selden&quot; &lt;HLSelden@...&gt;","profile":"holly_selden","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Regarding &quot;Laws&quot; and breaking them...","postDate":"1078828319","msgId":90795,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTIwMWM0MDVjMSRjMThhZTliMCRkMjgzYjE0MkBuYXRlYml0Y2g+"},"prevInTopic":0,"nextInTopic":90808,"prevInTime":90794,"nextInTime":90796,"topicId":90795,"numMessagesInTopic":0,"msgSnippet":"Okay, so I ve been digging.  I know the laws of my state by heart now with regards to homeschooling.  However, there are some things that just aren t clear to","messageBody":"<div id=\"ygrps-yiv-566297415\">Okay, so I&#39;ve been digging.  I know the laws of my state by heart now with regards to homeschooling.  However, there are some things that just aren&#39;t clear to me.<br/>\n<br/>\nMy children are required once a year to be tested or evaluated by a teacher/psychologist.  They should show forward progression (of what I&#39;m assuming is the SCHOOL ideal of what they should know).  <br/>\n<br/>\nOr what??  What happens if they don&#39;t fit that mold??  That&#39;s why I took them out of school in the first place.   <br/>\n<br/>\nSo, I must admit, that the fear of the unknown (being what happens if they don&#39;t fit) is bugging me.  <br/>\n<br/>\nI&#39;ve read so many articles and posts about unschooled kids that didn&#39;t learn to read until their early teens.  My brother in law was one of them.  I&#39;ll never forget a 16 year old coming to me and asking me if he addressed an envelope correctly.  He hadn&#39;t.  I taught him how.  He was also a very late reader and none the worse for the wear.  Smart guy.  Successful.  <br/>\n<br/>\nMy question is...how did these families get through the system?  I know how my mother in law did it.  She was (to quote my husband) &quot;on the run&quot;.  <br/>\n<br/>\nI don&#39;t want it to be like that.  I don&#39;t want to have to hide my kids from the world.  However, I don&#39;t want to force things down their throat just because they are expected to know it for some silly evaluation.<br/>\n<br/>\nI&#39;d really welcome any advice, especially from my fellow Floridian unschoolers.  <br/>\n<br/>\nDoes anyone have the answer to what the action is if you don&#39;t comply?  Do they take my children from me?  Do they arrest me for truancy?  <br/>\n<br/>\nHelp!<br/>\n<br/>\nHolly <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Regarding &quot;Laws&quot; and breaking them...","postDate":"1076543261","msgId":90887,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyMC4yYTQ1ZjA4Mi4yZDVjMTkxZEBhb2wuY29tPg=="},"prevInTopic":90886,"nextInTopic":0,"prevInTime":90886,"nextInTime":90888,"topicId":90795,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/11/04 3:05:03 PM, Lmanathome@msn.com writes: ","messageBody":"<div id=\"ygrps-yiv-1270481372\">In a message dated 2/11/04 3:05:03 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Lmanathome@...\">Lmanathome@...</a> writes:<br/>\n<br/>\n&lt;&lt; How have other NY unschoolers on this list dealt with tests?<br/>\nOr should i be looking this up in the archives?  oops...&lt;g&gt; &gt;&gt;<br/>\n<br/>\nBetter than archives would be google.com<br/>\n<br/>\nBut better than cold facts might be warm testimonials which are often to be <br/>\nfound at www.unschooling.com and the state folders are here:<br/>\n<br/>\nUnschooling.com&#39;s Message Boards: How do You Unschool and Meet Your State&#39;s <br/>\nRequirements?  <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com/discus/messages/40/40.html\">http://www.unschooling.com/discus/messages/40/40.html</a><br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Regarding &quot;Laws&quot; and breaking them...","postDate":"1076543070","msgId":90886,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDExMy4yZWIyZGM3ZS4yZDVjMTg1ZUBhb2wuY29tPg=="},"prevInTopic":90866,"nextInTopic":90887,"prevInTime":90885,"nextInTime":90887,"topicId":90795,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/11/04 2:59:56 PM, Lmanathome@msn.com writes:  igneous, metamorphic and sedimentary I","messageBody":"<div id=\"ygrps-yiv-753977392\">In a message dated 2/11/04 2:59:56 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Lmanathome@...\">Lmanathome@...</a> writes:<br/>\n<br/>\n&lt;&lt; Name the three different categories of rocks?   &gt;&gt;<br/>\n<br/>\nigneous, metamorphic and sedimentary<br/>\n<br/>\nI remembered it from 9th grade, and it was told to me again in college <br/>\ngeology 101.<br/>\n<br/>\nBut I live in rock-land, pretty much, where there are all three kinds of rock <br/>\nare visible, I&#39;ve laid flagstone (sedimentary), my dad worked for a mining <br/>\ncompany for years keeping their digging and crushing and sifting and packing <br/>\nmachinery in operation, but you can&#39;t help but learn what you&#39;re working with <br/>\nwhen the whole company has six employees and they&#39;re frequently out at <br/>\nprospecting sites.  That was fun for me, being around those guys sometimes.<br/>\n<br/>\n&lt;&lt;All were adults over the age of 40 - all had taken earth science in their <br/>\nschooling years. &gt;&gt;<br/>\n<br/>\nIf they lived where grass covers the earth and they never worked around rocks <br/>\nor had any interest, it was GOOD that they let that information slip. When <br/>\nthey need it they can get it back.  If they don&#39;t ever need it, they can use <br/>\nthat storage space for other better things they DO need.<br/>\n<br/>\nBeing in Albuquerque, I don&#39;t need to know the capital of South Dakota NOR <br/>\nhow to pronounce it, but I&#39;ve always kinda like trivia (and language) so I don&#39;t <br/>\nmind knowing.  But I don&#39;t fault anyone for not knowing the capital of New <br/>\nMexico who doesn&#39;t live here and has no need to know.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":94040812,"authorName":"Lisa H","from":"&quot;Lisa H&quot; &lt;Lmanathome@...&gt;","profile":"lmanathome","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Regarding &quot;Laws&quot; and breaking them...","postDate":"1076532403","msgId":90866,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTQtREFWMTU0ZzA3TUpKUTgwMDA2ZTBlZEBob3RtYWlsLmNvbT4=","referencesHeader":"PDRiLjM5Y2FhZTJkLjJkNWJiZmQwQGFvbC5jb20+IDw2NzJDQjdBMi01Q0M3LTExRDgtOUQ5Ri0wMDBBOTVFMjkyQzZAbWFjLmNvbT4="},"prevInTopic":90865,"nextInTopic":90886,"prevInTime":90865,"nextInTime":90867,"topicId":90795,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-2088150273\">&lt;&lt;They only learn it once if they &quot;learn&quot; it. If they just memorize it,  <br/>\nspit it out on a test, then forget it, they haven&#39;t &#39;learned&quot; it even  <br/>\nonce, yet.&gt;&gt;<br/>\n<br/>\nLast night my nephew telephoned to include me in a survey he was conducting for his 8th grade science class at school.  He was graphing the result of 12 persons answers to the following question.  <br/>\n<br/>\nName the three different categories of rocks?  <br/>\n<br/>\nOf the four people he had surveyed so far, none could name all three categories.  Only one knew one category.  All were adults over the age of 40 - all had taken earth science in their schooling years.  I told him I thought it would be interesting if he were to ask the ninth graders who had taken the class last year to see how many knew the answer.  btw - my nephew didn&#39;t &quot;know&quot; all three categories - he had to check his notes ;-)<br/>\n<br/>\nHe also didn&#39;t seem to know the purpose of the assignment.<br/>\n<br/>\nAnswers can be found at:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.science.ubc.ca/~geol202/petrology/rock.html\">http://www.science.ubc.ca/~geol202/petrology/rock.html</a><br/>\n<br/>\n<br/>\nLisa H.<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"pam sorooshian","from":"pam sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Regarding &quot;Laws&quot; and breaking them...","postDate":"1076527250","msgId":90846,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY3MkNCN0EyLTVDQzctMTFEOC05RDlGLTAwMEE5NUUyOTJDNkBtYWMuY29tPg==","inReplyToHeader":"PDRiLjM5Y2FhZTJkLjJkNWJiZmQwQGFvbC5jb20+","referencesHeader":"PDRiLjM5Y2FhZTJkLjJkNWJiZmQwQGFvbC5jb20+"},"prevInTopic":90835,"nextInTopic":90865,"prevInTime":90845,"nextInTime":90847,"topicId":90795,"numMessagesInTopic":0,"msgSnippet":"... They only learn it once if they learn it. If they just memorize it, spit it out on a test, then forget it, they haven t learned it even once, yet. Out","messageBody":"<div id=\"ygrps-yiv-1249106100\">On Feb 11, 2004, at 9:26 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It&#39;s SO minor a deal, and people ever only learn it once.  After that,<br/>\n&gt; they&#39;re just reviewing, or going through the motions to satisfy yet  <br/>\n&gt; ANOTHER teacher.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>They only learn it once if they &quot;learn&quot; it. If they just memorize it,  <br/>\nspit it out on a test, then forget it, they haven&#39;t &#39;learned&quot; it even  <br/>\nonce, yet.<br/>\n<br/>\nOut of context, unneeded skills are never learned, they&#39;re a waste of  <br/>\ntime OR maybe just a little trick to impress people.<br/>\n<br/>\nWanna hear what I can do in one breath?<br/>\n<br/>\n&quot;Isamarewaswerebebeingbeenhashavehaddodoesdidshallwillshouldwouldmaymigh <br/>\ntmustcancould.&quot;<br/>\n<br/>\nImpressed?<br/>\n<br/>\nIn 4th grade I had NO idea what they meant and why they were all being  <br/>\nmemorized as a group.<br/>\n<br/>\nI also memorized many many Spanish dialogs and was able to do that  <br/>\nwithout understanding the words.<br/>\n<br/>\nGood for party tricks.<br/>\n<br/>\n-pam<br/>\nNational Home Education Network<br/>\n&lt;www.NHEN.org&gt;<br/>\nServing the entire homeschooling community since 1999<br/>\nthrough information, networking and public relations.</div>","specialLinks":[]},{"userId":94040812,"authorName":"Lisa H","from":"&quot;Lisa H&quot; &lt;Lmanathome@...&gt;","profile":"lmanathome","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Regarding &quot;Laws&quot; and breaking them...","postDate":"1076527061","msgId":90865,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTQtREFWODFPUlAxdGQ4WkEwMDA0M2NhMkBob3RtYWlsLmNvbT4=","referencesHeader":"PDAwMTIwMWM0MDVjMSRjMThhZTliMCRkMjgzYjE0MkBuYXRlYml0Y2g+"},"prevInTopic":90846,"nextInTopic":90866,"prevInTime":90864,"nextInTime":90866,"topicId":90795,"numMessagesInTopic":0,"msgSnippet":"Holly wrote: ","messageBody":"<div id=\"ygrps-yiv-1410357778\">Holly wrote: <br/>\n&lt;&lt;&lt;I&#39;ve read so many articles and posts about unschooled kids that didn&#39;t learn to read until their early teens.    My question is...how did these families get through the system?&gt;&gt;&gt;<br/>\n<br/>\nGreat question, Holly.  A personal concern of mine as my daughter is not an &quot;early&quot; reader.  I live in NY had to do our first test this year.  We used the at home, homeschooler, not timed test and as much as i played it down and attempted to ease it into our routine with out much fuss and veiw it as a &quot;learning experience&quot; - it was an intrusion.  <br/>\n<br/>\nFortunately I only have to do this every other year for a few years.   But don&#39;t want to &quot;go on the run&quot; or &quot;underground.&quot;<br/>\n<br/>\nHow have other NY unschoolers on this list dealt with tests?<br/>\nOr should i be looking this up in the archives?  oops...&lt;g&gt;<br/>\nLisa H.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Regarding &quot;Laws&quot; and breaking them...","postDate":"1076520400","msgId":90825,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRiLjM5Y2FhZTJkLjJkNWJiZmQwQGFvbC5jb20+"},"prevInTopic":90824,"nextInTopic":90835,"prevInTime":90824,"nextInTime":90826,"topicId":90795,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/11/04 4:15:20 AM, HLSelden@comcast.net writes: ","messageBody":"<div id=\"ygrps-yiv-1710866955\">In a message dated 2/11/04 4:15:20 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HLSelden@...\">HLSelden@...</a> writes:<br/>\n<br/>\n&lt;&lt;  I&#39;ll never forget a 16 year old coming to me and asking me if he <br/>\naddressed an envelope correctly.  He hadn&#39;t.  I taught him how.  &gt;&gt;<br/>\n<br/>\nBut what good does it do a ten year old to know if she doesn&#39;t have anyone to <br/>\nwrite to?<br/>\nand if someone needs to know, why can&#39;t he just look at several other <br/>\nenvelopes and copy that format?<br/>\n<br/>\nIt&#39;s SO minor a deal, and people ever only learn it once.  After that, <br/>\nthey&#39;re just reviewing, or going through the motions to satisfy yet ANOTHER teacher.<br/>\n<br/>\n&lt;&lt;My question is...how did these families get through the system?  I know how <br/>\nmy mother in law did it.  She was (to quote my husband) &quot;on the run&quot;.  &gt;&gt;<br/>\n<br/>\nVery few states require yearly testing.  A few require occasional.  Many <br/>\nrequire none.<br/>\n<br/>\nFloridians will have helped you out by now, I&#39;m sure, but as to the idea of <br/>\n&quot;late,&quot; it&#39;s best to find ways to live without having to worry about it.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":77669557,"authorName":"gailbrocop@aol.com","from":"gailbrocop@...","profile":"gailbatch","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Regarding &quot;Laws&quot; and breaking them...","postDate":"1076511995","msgId":90810,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGE1LjQ1M2I3ZmRlLjJkNWI5ZWZiQGFvbC5jb20+"},"prevInTopic":90808,"nextInTopic":90824,"prevInTime":90809,"nextInTime":90811,"topicId":90795,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/11/2004 6:15:10 AM Eastern Standard Time, ... There are schools you can register with that comply with state requirements and are","messageBody":"<div id=\"ygrps-yiv-396146112\">In a message dated 2/11/2004 6:15:10 AM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HLSelden@...\">HLSelden@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; My children are required once a year to be tested or evaluated by a <br/>\n&gt; teacher/psychologist.  They should show forward progression (of what I&#39;m assuming is <br/>\n&gt; the SCHOOL ideal of what they should know).  <br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>     There are schools you can register with that comply with state <br/>\nrequirements and are unschooler friendly.   After years of doing portfolio&#39;s, I just <br/>\ndid that.  Now, I can keep pictures and related materials that the kids want to <br/>\nkeep without worrying about creating a portfolio for someone else to critique <br/>\nand decide if my children are making progress.<br/>\n<br/>\n     E-mail me off list if you would like more information about some local  <br/>\nJacksonville area schools of this type.  You can also start your own.<br/>\n<br/>\n     Another alternative is to find an unschooling friendly evaluator or a <br/>\nfriend who has a teaching certificate. <br/>\n<br/>\nGail<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":7143857,"authorName":"jrossedd@aol.com","from":"jrossedd@...","profile":"jrossedd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Regarding &quot;Laws&quot; and breaking them...","postDate":"1076511023","msgId":90808,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRlLjI3OGZhMzdmLjJkNWI5YjJmQGFvbC5jb20+"},"prevInTopic":90795,"nextInTopic":90810,"prevInTime":90807,"nextInTime":90809,"topicId":90795,"numMessagesInTopic":0,"msgSnippet":"... What is it they say here? Breathe! Unschoolers in FL have answers to all these legal fear factors, with a pretty good track record so far. :) First, the","messageBody":"<div id=\"ygrps-yiv-1648647230\"><a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HLSelden@...\">HLSelden@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; My children are required once a year to be tested or evaluated by a <br/>\n&gt; teacher/psychologist.  They should show forward progression (of what I&#39;m assuming is <br/>\n&gt; the SCHOOL ideal of what they should know).  <br/>\n&gt; <br/>\n&gt; Or what??  What happens if they don&#39;t fit that mold??  That&#39;s why I took <br/>\n&gt; them out of school in the first place.   <br/>\n&gt; <br/>\n&gt; So, I must admit, that the fear of the unknown (being what happens if they <br/>\n&gt; don&#39;t fit) is bugging me.  . . <br/>\n&gt; <br/>\n&gt; I don&#39;t want to have to hide my kids from the world.  However, I don&#39;t want <br/>\n&gt; to force things down their throat just because they are expected to know it <br/>\n&gt; for some silly evaluation.<br/>\n&gt; <br/>\n&gt; I&#39;d really welcome any advice, especially from my fellow Floridian <br/>\n&gt; unschoolers.  <br/>\n&gt; <br/>\n&gt; Does anyone have the answer to what the action is if you don&#39;t comply?  Do <br/>\n&gt; they take my children from me?  Do they arrest me for truancy?  <br/>\n&gt; <br/>\n&gt; Help!<br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>       What is it they say here? Breathe!<br/>\n<br/>\n       Unschoolers in FL have answers to all these legal fear factors, with a <br/>\npretty good track record so far. :)<br/>\n<br/>\n       First, the legal requirement is academic progress &quot;commensurate with <br/>\nthe child&#39;s ability&quot; and that&#39;s a piece of cake for successful unschoolers, <br/>\nimo. Always has been for us. How could a child fail to measure up to himself (an <br/>\nunschooling child, I mean, not a schooled child being royally screwed up like <br/>\nin the Rosemond column I posted yesterday!)<br/>\n<br/>\n       There really are certified teacher-evaluators in Florida who share the <br/>\nunschooling philosophy and are willing to help; I&#39;ve even heard of a few <br/>\nhappy to arrange a fax or email exchange to review your child&#39;s portfolio, for <br/>\nthose who can&#39;t find an evaluator in their area they especially like. You could <br/>\nsubscribe to the yahoo group &lt;FL-HomeEducation-law&gt; for more.<br/>\n<br/>\n       Second, Florida also has a different legal option to comply with <br/>\ncompulsory attendance requirements. If the independent home education statute <br/>\ndoesn&#39;t work well for your family, for whatever reason, you can enroll in a <br/>\n&quot;private school&quot; that matches your personal philosophy of learning and will support <br/>\nyour unschooling as you wish it to (no curriculum, tests, or organized classes) <br/>\n-- there are  unschoolers who offer these &quot;schools&quot; free of charge, as a <br/>\nservice to others. <br/>\n<br/>\n       You could even start such a &quot;school&quot; yourself and thereby help others! <br/>\nI know unschoolers who have done this. Some estimate that that there are more <br/>\nFL homeschoolers using this option than the total registered under the <br/>\nindependent statute and stuck filing annual evaluations.See more at<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.parentdirectededucation.org/Homeschooling%20in%20Florida.htm\">http://www.parentdirectededucation.org/Homeschooling%20in%20Florida.htm</a>&gt;<br/>\n<br/>\n       I should note that one disadvantage of the private school option over <br/>\nindependent home education is that Florida law provides broad public program <br/>\naccess for independent home ed families who wish it, like dual enrollment in <br/>\nfor-credit high school and college courses, free virtual classes, <br/>\nextracurricular participation parttime at local schools (symphony, sports teams, et cetera.) <br/>\nThis is not available if you go the private school route instead, although <br/>\nlarge &quot;regular&quot; privates often have certain access under their own agreements.<br/>\n<br/>\n       And although &quot;private school homeschooling&quot; shields you completely <br/>\nfrom the school superintendent, you then do have to send your child&#39;s basic <br/>\nidentifying info, including certain medical info, and attendance records, to the <br/>\n&quot;school&quot; office you choose. (So you can either be on file with the government or <br/>\nsome private citizens or businesspeople who are unaccountable and perhaps <br/>\neven unknown to you! I&#39;m not crazy about either one, but there it is. Unless you <br/>\nbecome a school yourself.) <br/>\n<br/>\n       Lastly -- for this post at least -- the worst that can happen to an <br/>\nunschooler under the FL home ed statute is a sort of probation that gives you a <br/>\nyear to come into compliance -- in other words, to show the child has made <br/>\nprogress commensurate with ability, under any legal method. At the end of that <br/>\nsecond year, the worst that could happen is that the Superintendent could <br/>\n&quot;terminate&quot; your home ed program for non-compliance and say you had to put the child <br/>\nin &quot;school.&quot;<br/>\n<br/>\n       All the scary stuff, the truancy and CPS interventions, cannot kick in <br/>\nbecause of academic failure. They are for the parent&#39;s legal compliance <br/>\nfailure, things like not keeping any portfolio or reading materials list, failing <br/>\nto turn any evaluation at all, or failure to register your child anywhere under <br/>\nany option. You don&#39;t want anything to do with these legal problems, believe <br/>\nme! Fortunately they are very easy to avoid because there are several fine <br/>\noptions for unschoolers. JJ (see pompous sig below in case you find it useful to <br/>\ncite me as an authority on Florida unschooling provisions &lt;g&gt;)<br/>\n<br/>\nJJ Ross, Ed.D.<br/>\nLegislative and Education Resources<br/>\nwww.ParentDirectedEducation.org<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":90876,"nextTopicId":90821}}