{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":77610158,"authorName":"Bonni Sollars","from":"Bonni Sollars &lt;BSOLLARS@...&gt;","profile":"truuluvv","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Office of Ed Horror Story - Help!","postDate":"1013095323","msgId":31946,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIwMjA3LjEwMjI1OC4tMTYyNzkzLjEuYnNvbGxhcnNAanVuby5jb20+"},"prevInTopic":31928,"nextInTopic":0,"prevInTime":31945,"nextInTime":31947,"topicId":31928,"numMessagesInTopic":0,"msgSnippet":"Carla, about your phone call.  I don t live in your area, so I don t know the details, but I would have to say it is similar to what I went through here in","messageBody":"<div id=\"ygrps-yiv-1363327730\">Carla, about your phone call.  I don&#39;t live in your area, so I don&#39;t know<br/>\nthe details, but I would have to say it is similar to what I went through<br/>\nhere in Oregon with my son.  They are just giving you a hard time because<br/>\nthey have a hard time with it, maybe they just have no idea how to<br/>\nprocess the papers.  So what if there are truancy issues?  Big deal.  You<br/>\nget some annoying phone calls of a computer saying,<br/>\n&quot;You&#39;re-eighth-grader-missed-periods-one-through-six-today&quot;.  And<br/>\noccasionally people will call saying there are options for your son since<br/>\nhe&#39;s &quot;skipping classes&quot;.  Just say, &quot;He is legally homeschooled.&quot;  Your<br/>\nson needs to be reassured that they are just b.s. ing him trying to<br/>\nintimidate him because they are ignorant and afraid of different things. <br/>\nMy best advice... If you did what was legal, write down what they say in<br/>\ncalls, but basically, ignore everything they say.  <br/>\nBonni</div>","specialLinks":[]},{"userId":90220631,"authorName":"researcher77","from":"&quot;researcher77&quot; &lt;cdcorbett@...&gt;","profile":"researcher77","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Office of Ed Horror Story - Help!","postDate":"1012960660","msgId":31928,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGEzcTJpaytmbGdvQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":31946,"prevInTime":31927,"nextInTime":31929,"topicId":31928,"numMessagesInTopic":0,"msgSnippet":"I am really distressed about a phone call I got from the Sacramento County Office of Ed in response to my sending in an R-4 affidavit. Here is a synopsis of","messageBody":"<div id=\"ygrps-yiv-2082433019\">I am really distressed about a phone call I got from the Sacramento <br/>\nCounty Office of Ed in response to my sending in an R-4 affidavit.  <br/>\nHere is a synopsis of the conversation that I noted for my records:  <br/>\n(sorry it&#39;s so long, but I wanted you all to know what they&#39;re doing <br/>\nto people filing R4s)<br/>\n<br/>\nReceived phone call from Carol Gordia of Sacramento County Office of <br/>\nEducation, Child Welfare and Attendance.<br/>\n<br/>\nShe said she had received my R-4 affadavit, and asked if I had taken <br/>\nmy son out of Horizon (the charter/home school program we were <br/>\npreviously enrolled in).  Told her yes.  She asked where he was <br/>\nenrolled.  I told her he was enrolled in the private school I had <br/>\nestablished by filing the R-4.  She said quite emphatically that the <br/>\nR-4 does not establish a private school, and that Horizon would be <br/>\nnotifying the school district that he was not enrolled any longer and <br/>\nthat if he was not enrolled in a district school, there could be <br/>\ntruancy problems.  She asked why I took him out of Horizon, and I <br/>\ntold her that it didn&#39;t meet our needs.  She wanted to know <br/>\nspecifically what it was we didn&#39;t like  I again said that it didn&#39;t <br/>\nmeet our needs.  She said there were others, I said I was aware.  <br/>\n<br/>\nHer other arguments centered around &quot;you are closing the door&quot;  if <br/>\nmy son wanted to enroll in a high school down the road, they would <br/>\ndetermine that he was in 8th grade, and the door would be closed.  I <br/>\ntold her that we considered this a stop-gap measure until we found a <br/>\nsuitable alternative, and that I had considered the implications.<br/>\n<br/>\nI told her I appreciated her concern and taking the time to call to <br/>\nmake sure I was informed, but that I had educated myself about all <br/>\nthe implications of this decision.  I asked if there was any problem <br/>\nwith the R-4 itself.  She said there wasn&#39;t, but that it could only <br/>\nbe filed in October of each year, and that my son would not be <br/>\nenrolled in school until it was filed.  She reiterated that state <br/>\ndoes nothing with the R-4 (I offered &quot;except for attendance <br/>\npurposes&quot;  she said not even that) unless the school has 10 or more <br/>\nstudents, then it is listed in a directory.<br/>\n<br/>\nI told her that I felt I had informed myself about the legal <br/>\nimplications of my decision, and that I was not doing anything that <br/>\ncontradicted legal precedence.  She said that I needed to call CDE, <br/>\nbecause there is more than one legal interpretation.  I again told <br/>\nher that I appreciated her concern and taking the time to call, but <br/>\nthat I would appreciate her doing what was legally required of her <br/>\noffice concerning the filing of the R-4, and that was all.  <br/>\n<br/>\nAt the beginning of the conversation, Ms. Gordia said that she had <br/>\ngotten my work number from my son.  After my conversation with her, I <br/>\ncalled my son to find out what, if anything she had asked him or said <br/>\nto him.  She asked him how long he had attended public school.  He <br/>\ntold her he attended through the first two weeks of 8th grade, but <br/>\nthat the school just wasn&#39;t working out for him.  She told him that <br/>\nhe had to attend a charter school if he ever wanted to go to high <br/>\nschool.  My son was quite distressed that she was telling him he had <br/>\nto join a charter school. <br/>\n<br/>\n<br/>\nThat&#39;s about it.  I&#39;ve relayed this information to the legal person <br/>\nat HSC, who reassured me when they gave me a hard time when I just <br/>\nrequested the R-4 form.  Any advice/reassurance from you wonderful, <br/>\nexperienced folks out there would be appreciated, too.<br/>\n<br/>\nThanks!<br/>\nCarla</div>","specialLinks":[]}],"prevTopicId":31930,"nextTopicId":31955}}