{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":127765949,"authorName":"thetarotworks2002","from":"&quot;thetarotworks2002&quot; &lt;thetarotworks2002@...&gt;","profile":"thetarotworks2002","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"letter of appeal","postDate":"1036037433","msgId":48858,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGFwcWFmcCttYnF0QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":48857,"nextInTime":48859,"topicId":48858,"numMessagesInTopic":0,"msgSnippet":"Letter of Appeal Hi Everyone (from Marianne Moyer), Some of you on the message boards know me and some don t. I am homeschooling my two children Katrina and","messageBody":"<div id=\"ygrps-yiv-1626102264\">Letter of Appeal<br/>\n<br/>\nHi Everyone (from Marianne Moyer),<br/>\n<br/>\nSome of you on the message boards know me and some don&#39;t. I am <br/>\nhomeschooling my two children Katrina and Sabrina, age 4 and 10. My <br/>\nhusband left me about a year and a half ago. He didn&#39;t give me any <br/>\nsupport since last December 2001. Basically he left us with nothing <br/>\nand gave us nothing, and I&#39;ve been in and out of court. I couldn&#39;t <br/>\nwork because I&#39;ve been extremely and chronically ill. I finally had <br/>\nto go on public assistance and could barely pay any of my bills. My <br/>\nfamily has helped me some but they no longer can help.<br/>\nConsequently, I&#39;m now in the situation that I&#39;m in, and I have some <br/>\nsad news. My landlord gave me an eviction letter on Oct. 24th, 2002. <br/>\nHe&#39;s giving me 30 days to vacate and at that time they&#39;re moving our <br/>\nhouse off the lot in our mobile home park. I have gotten into arrears <br/>\nin the amount of $2500 not having the money to pay for the rent on <br/>\nthe land for the last 6 months. <br/>\nI&#39;ve been a homemaker for years and don&#39;t really have any marketable <br/>\nskills even if I could work. The children and I are left with pain <br/>\nand fear, and I have many chronic health problems including visual <br/>\nproblems, chronic fatigue syndrome, breathing difficulties, etc. <br/>\nI&#39;m under the care of different doctors and have not been able to be <br/>\ndefinitively diagnosed for over 10 years. The mystery of the unknown <br/>\nis scary and I just want to be alive for my children to see them <br/>\ngrow. <br/>\nRight now I&#39;m appealing to anyone who can help us from being on the <br/>\nstreet and saving our home. I will be in the hospital in a few weeks, <br/>\nand cannot rest until I know that the children and I have our home to <br/>\nstay in and won&#39;t be put out on the cold streets. My older daughter <br/>\nand her 1 year old baby also live with us. What sadness and ills have <br/>\nbefallen us today.<br/>\nA loan, a gift, whatever you can spare would be gratefully <br/>\nappreciated. My prayers go out to you for this support, as the <br/>\nholidays are close and winter is falling upon us, an angel looks over <br/>\nall the good in this time of need...and so you shall be blessed many <br/>\ntimes over for your support in saving us from being homeless and the <br/>\nloss of so much, as all our prayers are answered... I plead for my <br/>\nchildren for they are my breath of my life... To see smiles wash away <br/>\nthe tears... I thank you for such kindness...<br/>\nIf you could just help us this one time, I think I can manage in the <br/>\nfuture. I was just awarded some child support but not enough and not <br/>\nin time, I&#39;m appealing disability and hoping to collect in the <br/>\nfuture, I&#39;ll be going for spousal support in February and I may have <br/>\nan insurance settlement in a few months. My older daughter is working <br/>\non employment as well. <br/>\nMarianne <br/>\n\t<br/>\n\tPS This is from Marianne&#39;s friend Barbara Auerbach. My idea <br/>\nis that 50 people donating $50, 100 people donating $25, $250 people <br/>\ndonating $10 would do it for Marianne. I&#39;ll put in the first $50. I&#39;m <br/>\nhoping that everyone who sees this will help put in the rest. This <br/>\nact of kindness will come back to you.</div>","specialLinks":[]}],"prevTopicId":48851,"nextTopicId":48589}}