{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":177721839,"authorName":"Angela","from":"&quot;Angela&quot; &lt;game-enthusiast@...&gt;","profile":"autonomousangela","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [UnschoolingDiscussion] Sibling Issues","postDate":"1129379239","msgId":108964,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDAwMWM1ZDE4MyRjYjVlNjgxMCQ2OTAwYThjMEBlYm9ueT4=","inReplyToHeader":"PDAwMTgwMWM1Y2I0ZCQyNWRkNTYzMCQwMjAxYThjMEBoZWF0aGVybmo4cGVuMj4="},"prevInTopic":108812,"nextInTopic":0,"prevInTime":108963,"nextInTime":108965,"topicId":108786,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-832248833\">&lt;&lt;I have been having some major sibling related issues that I am hoping<br/>\nthose of you could give me some insight on.  Basically, there is intense<br/>\ncompetition with my 6 & 7 year old - did and ds. A an example - yesterday we<br/>\nwere making a volcano - and they both fought and argued over who would do<br/>\nwhat, go first etc. &gt;&gt;<br/>\n<br/>\nFrom the time my kids were really small, we always had them take turns when<br/>\nit was something important to them.  And we kept track of whose turn it was<br/>\nto go first with something fun.  It solved a lot of potential problems<br/>\nbecause they knew we were trying to be fair.<br/>\n<br/>\n&lt;&lt;They do a lot of name calling to each other - and purposely doing or<br/>\nsaying things that will aggravate the other.&gt;&gt;<br/>\n<br/>\nIs name calling something that you model in your family?  My kids don&#39;t<br/>\ngenerally call each other unkind names and the first time they might have<br/>\ndone it, I am sure I was all over them like flies on dung.  Name calling is<br/>\nunkind and it doesn&#39;t solve anything.  I would say something similar and<br/>\nthen get to the root of the problem.  Help them to express their frustration<br/>\nwith each other (perhaps out of earshot of each other if it is too unkind)<br/>\nand then help them to phrase it in a way that is productive and kind.<br/>\n<br/>\n &lt;&lt;My usual course of action has been to separate them when they get like<br/>\nthis - and have them do something away from each other - we talk about this<br/>\nafterward and often they will then treat each other nicely for a little<br/>\nwhile. &gt;&gt;<br/>\n<br/>\nI think that is a short term solution, not a long term one.  Helping them to<br/>\nverbalize how they feel to each other esp. before they are completely<br/>\nfrustrated would be better.  Perhaps you need to be nearer to them during<br/>\ntheir play so you can help them communicate.<br/>\n<br/>\n&lt;&lt;However, inevitably something comes up again. We had just been playing<br/>\nclue Jr. My daughter will bring out a game and then say - I only want YOU to<br/>\nplay with me. This is hard, because I want to respect that about her - but<br/>\nthen my son is crying that he wants to play. If I play with her and then<br/>\nplay with my son - she has a fit that she then wants to play....&gt;&gt;<br/>\n<br/>\nThis is hard and we have this issue now and then but it usually only happens<br/>\nwhen they are frustrated with each other to begin with.  I don&#39;t have any<br/>\nhard fast rule concerning this and I play it by ear.  Sometimes I refuse to<br/>\nplay at all unless everyone is included and I try to help them find more<br/>\nsolitary things to do until they are less frustrated with each other.  Other<br/>\ntimes they are happy to know that when I am done playing with one of them, I<br/>\nwill happily oblige the other one with the activity of their choice, alone<br/>\nwith me.  <br/>\n<br/>\n&lt;&lt;I have thought that maybe this is caused by a need for attention thing -<br/>\nand do try and take them out one on one - so that each gets a little<br/>\nindividual time.&gt;&gt;<br/>\n<br/>\nI would say it is caused by a need for attention.  But time spent<br/>\nindividually with them doesn&#39;t need to be time away from home.  You can<br/>\nspend individual time with each of them throughout the day in different<br/>\nways.  My older dd gets up first and often enjoys sitting down to play a<br/>\ngame more than her younger sister.  We have these times together to connect.<br/>\nMy younger dd loves to snuggle in bed and in the morning when I wake her<br/>\n(because she wants to be woken at a certain time) we are able to spend a few<br/>\nminutes connecting and cuddling in bed before she starts her day.  There are<br/>\nalso other times during the day when I can see their need for connection and<br/>\nI can meet those needs without alienating the other child.  But often,<br/>\nsitting down together meets the need too.  Time spent on the couch with each<br/>\nchild on one side of me while I read to them helps a lot too.<br/>\n<br/>\n&lt;&lt;But what bothers me a lot is the name calling and just over all meanness<br/>\nto one another. The problem gets worse because it irritates me so much that<br/>\nI wind up getting angry and irritated about it all - that I just don&#39;t want<br/>\nto do whatever it was because of the fighting.&gt;&gt;<br/>\n<br/>\nI would just be matter of fact about it.  Would you let a stranger come into<br/>\nyour home and call your kids&#39; names or would you protect them?  It is no<br/>\ndifferent when it is their siblings.  They each deserve to be protected from<br/>\nunkindness and I would not stand by and allow that to happen.  But like I<br/>\nsaid before, it is always about communication and if you help them<br/>\ncommunicate, it won&#39;t get to name calling.<br/>\n<br/>\n&lt;&lt;Sometimes my daughter will want to play with one of my sons toys - and she<br/>\nwill ask :&quot;nicely&quot; and he will say &quot;No&quot; - for whatever reason. She will then<br/>\npitch. On the one hand I feel that he should be allowed to say &quot;No&quot; if<br/>\nsomeone asks to play with something and he doesn&#39;t want them to. But<br/>\nsometimes he will say No - just to bug her - or she will go at  his toys<br/>\njust to bother him.&gt;&gt;<br/>\n<br/>\nIf he is saying no, just to bug her, I suspect he isn&#39;t feeling like she has<br/>\nbeen very generous lately.  Maybe you could address that.  <br/>\nAngela</div>","specialLinks":[]},{"userId":188356966,"authorName":"Brandie","from":"Brandie &lt;scrapdiva73@...&gt;","profile":"scrapdiva73","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Sibling Issues","postDate":"1128904479","msgId":108812,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUxMDEwMDAzNDM5LjEyNDkwLnFtYWlsQHdlYjUxODE1Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDAwMTgwMWM1Y2I0ZCQyNWRkNTYzMCQwMjAxYThjMEBoZWF0aGVybmo4cGVuMj4="},"prevInTopic":108786,"nextInTopic":108964,"prevInTime":108811,"nextInTime":108813,"topicId":108786,"numMessagesInTopic":0,"msgSnippet":"... I have some questions -- are you unschooling?  Have the children always unschooled or did they attend traditional schooling?  Did you do school at home? ","messageBody":"<div id=\"ygrps-yiv-1437057084\">--- Heather Woodward &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:bacwoodz@...\">bacwoodz@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I have been having some major sibling related issues<br/>\n&gt; that I am hoping those of you could give me some<br/>\n&gt; insight on.  Basically, there is intense competition<br/>\n&gt; with my 6 & 7 year old - did and ds.<br/>\n<br/>\n </span></blockquote>I have some questions -- are you unschooling?  Have<br/>\nthe children always unschooled or did they attend<br/>\ntraditional schooling?  Did you do school at home? <br/>\nHave they attend daycare or preschool?  Or always been<br/>\nat home with you?<br/>\n<br/>\nBrandie <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://tableforfive.blogspot.com\">http://tableforfive.blogspot.com</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://homemadeliving.blogspot.com\">http://homemadeliving.blogspot.com</a> <br/>\n<br/>\n<br/>\n<br/>\n\t<br/>\n\t\t<br/>\n__________________________________ <br/>\nYahoo! Mail - PC Magazine Editors&#39; Choice 2005 <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.yahoo.com\">http://mail.yahoo.com</a></div>","specialLinks":[]},{"userId":239750918,"authorName":"Heather Woodward","from":"&quot;Heather Woodward&quot; &lt;bacwoodz@...&gt;","profile":"bacwoodz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"9"},"subject":"Sibling Issues","postDate":"1128696065","msgId":108786,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTgwMWM1Y2I0ZCQyNWRkNTYzMCQwMjAxYThjMEBoZWF0aGVybmo4cGVuMj4="},"prevInTopic":0,"nextInTopic":108812,"prevInTime":108785,"nextInTime":108787,"topicId":108786,"numMessagesInTopic":0,"msgSnippet":"I have been having some major sibling related issues that I am hoping those of you could give me some insight on.  Basically, there is intense competition with","messageBody":"<div id=\"ygrps-yiv-502145699\">I have been having some major sibling related issues that I am hoping those of you could give me some insight on.  Basically, there is intense competition with my 6 & 7 year old - did and ds. A an example - yesterday we were making a volcano - and they both fought and argued over who would do what, go first etc. They do a lot of name calling to each other - and purposely doing or saying things that will aggravate the other. My usual course of action has been to separate them when they get like this - and have them do something away from each other - we talk about this afterward and often they will then treat each other nicely for a little while. <br/>\n<br/>\nHowever, inevitably something comes up again. We had just been playing clue Jr. My daughter will bring out a game and then say - I only want YOU to play with me. This is hard, because I want to respect that about her - but then my son is crying that he wants to play. If I play with her and then play with my son - she has a fit that she then wants to play....<br/>\n<br/>\nI have thought that maybe this is caused by a need for attention thing - and do try and take them out one on one - so that each gets a little individual time.<br/>\n<br/>\nBut what bothers me a lot is the name calling and just over all meanness to one another. The problem gets worse because it irritates me so much that I wind up getting angry and irritated about it all - that I just don&#39;t want to do whatever it was because of the fighting.<br/>\n<br/>\nSometimes my daughter will want to play with one of my sons toys - and she will ask :&quot;nicely&quot; and he will say &quot;No&quot; - for whatever reason. She will then pitch. On the one hand I feel that he should be allowed to say &quot;No&quot; if someone asks to play with something and he doesn&#39;t want them to. But sometimes he will say No - just to bug her - or she will go at  his toys just to bother him.<br/>\n<br/>\nAnyway - I was hoping for some suggestions here. When everyone is calm and we talk about name calling and being nice vs. being mean they all seem to understand. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":108903,"nextTopicId":108972}}