{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"reading (was &quot;question for you&quot;)","postDate":"1070101658","msgId":85544,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFjZC4xNGZmMmI5Yy4yY2Y5Y2U5YUBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":85543,"nextInTime":85545,"topicId":85544,"numMessagesInTopic":0,"msgSnippet":"In a message dated 11/29/03 1:04:13 AM, jaam1224@earthlink.net writes: ","messageBody":"<div id=\"ygrps-yiv-535519876\">In a message dated 11/29/03 1:04:13 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jaam1224@...\">jaam1224@...</a> writes:<br/>\n<br/>\n&lt;&lt; But I am having a nagging feeling that it is the more the method (even<br/>\nthough she does seem to be enjoying the workbooks most days) than anything<br/>\nelse.  My goal still is to have her LOVE to learn, but I want to help her<br/>\nget where she wants to go as well.  &gt;&gt;<br/>\n<br/>\nI think you&#39;re right.<br/>\n<br/>\nKids sometimes REALLY want to learn to read (I remember my little brother <br/>\nsaying &quot;Teach me to read&quot; with a plaintive begging tone when he was too little to <br/>\nread), but they think it&#39;s something you can show them in just a few days or <br/>\nweeks.   And some parents think so too, but it&#39;s not.<br/>\n<br/>\nWhen we were kids my dad worked for a mining company in a place where horses <br/>\nsometimes grazed--totally unrelated to what he was doing.  One Saturday we and <br/>\nthe boss&#39;s kids had gone with the dads while they did something, so we could <br/>\njust goof around in the office, in the hills, wherever around there.   The <br/>\nmoms were there too.<br/>\n<br/>\nKids and adults were lounging here and there when one of the other girls, <br/>\neight or nine or so, came running in YELLING &quot;COME LOOK!!!!  COME SEE WHAT I <br/>\nTAUGHT THE HORSES TO DO!!!&quot;<br/>\n<br/>\nWe ALL ran to look.<br/>\n<br/>\nThe horses were doing what horses occasionally do, but it was circus-like to <br/>\nthe kids.   They were having exhuberant horse-sex.<br/>\n<br/>\nShe didn&#39;t teach them to do that, but she had said or done something toward <br/>\nthem, and off they went.<br/>\n<br/>\nSo it is sometimes when an adult DOES think she&#39;s taught a child to read.<br/>\n<br/>\nIf you&#39;re there about the right time and reading clicks for them, I think <br/>\nit&#39;s easy to think you taught them to do that.<br/>\n<br/>\nAnd if my slightly-younger-friend Pam had tried to get them to do that trick <br/>\nagain, or to get other horses to do that trick, she might have thought those <br/>\nhorses weren&#39;t too smart, or were uncooperative, or that she needed to tweak <br/>\nher training methods.<br/>\n<br/>\nThere are lots of things you can do to help her learn to read, but maybe the <br/>\nbest thing you can do is tell her it takes years, and she has already started <br/>\nlearning.<br/>\n<br/>\nMy daughter was frustrated to be &quot;a late reader&quot; (MAYBE) yet when she did get <br/>\nit, she zoomed away past her friends who had believed themselves to be <br/>\nreading for a year or more.   They eased into reading (or were dragged in) the <br/>\nold-timey, show-progress way, so when she was having to ask people to read her <br/>\nHarry Potter cards do her, her friends were reading their own.  Kind of.  Badly <br/>\nand with errors that affected the game sometimes.  But Holly was in awe, still, <br/>\nand embarrassed sometimes.  <br/>\n<br/>\nWhen it came to her it was like a wave that carried her past and over them, <br/>\nand now she sight reads &quot;with comprehension&quot; while they&#39;re still sounding out <br/>\nwords they don&#39;t understand.<br/>\n<br/>\nReading without comprehension, by the way, is one of the most insane school <br/>\nconcepts ever imagined.   For ANY practical purposes &quot;reading without <br/>\ncomprehension&quot; means &quot;not reading,&quot; but in school kids do it ALL the time.  They teach <br/>\nreading separate from comprehension, just about.  What is THAT!?  It&#39;s the <br/>\nepitomy of phonics.  The kind of phonics my Macintosh can do.   The Mac has no <br/>\nidea what it read, when it sounds out words with its voice simulation function.  <br/>\n Kids at school do that too, and teachers say &quot;Good!&quot;<br/>\n<br/>\nThat&#39;s not the kind of reading that helps kids read chapter books in bed at <br/>\nnight.<br/>\n<br/>\nI&#39;ve collected lots of reading accounts here:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/reading\">http://sandradodd.com/reading</a><br/>\n<br/>\nI think the easiest way to help her read is to tread lightly around <br/>\ntraditional methods.   They&#39;ve proven in the past to help MANY children fear and hate <br/>\nreading or anything that looks like reading.<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":85542,"nextTopicId":85546}}