{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":7090222,"authorName":"Pamela","from":"&quot;Pamela&quot; &lt;spcparents@...&gt;","profile":"spcparents","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"The Weather Contest of the Century","postDate":"1067116390","msgId":83240,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJuZXAxNitnbmJqQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":83239,"nextInTime":83241,"topicId":83240,"numMessagesInTopic":0,"msgSnippet":"Ok, this is an awesome educational experience which was sent by one of our FIELD TRIPS!!! families who works with the FAA (and are moving soon, grrrr, you WILL","messageBody":"<div id=\"ygrps-yiv-603232723\">Ok, this is an awesome educational experience which was sent by one <br/>\nof our FIELD TRIPS!!! families who works with the FAA (and are moving <br/>\nsoon, grrrr, you WILL be missed!!!).  Due to the fact that the <br/>\nwebsite specified that all educators had to be affiliated with <br/>\nan &quot;accredited&quot; school, I became immediately concerned.  I emailed <br/>\nthe contest coordinators and received a prompt reply.  HOME EDUCATORS <br/>\nacross the country are WELCOME and ENCOURAGED to enter this <br/>\neducational experience. Here is the response I received, and <br/>\nfollowing is the actual email describing all the ins and outs of how <br/>\nTEACHERS SIGN UP YOUR STUDENTS NOW FOR THE WEATHER CONTEST OF THE <br/>\nCENTURY!<br/>\n<br/>\nHi, Pamela....<br/>\n<br/>\nWhile designed with classroom teachers in mind, homeschool educators <br/>\nare <br/>\nabsolutely welcome to register and participate in the program.<br/>\n<br/>\nSince we are interested in tracking the number of locations where the <br/>\nprogram <br/>\nis implemented, we would prefer that each homeschool educator <br/>\nregister <br/>\nindividually.<br/>\n<br/>\nFor school name, just enter &quot;homeschool&quot; and for type of school, <br/>\nselect &quot;other&quot; from the dropdown menu.<br/>\n<br/>\nThanks for your interest in the 2003 Flight Forecast program!<br/>\nLet me know if you have any other questions.<br/>\n<br/>\nKaren Elinich<br/>\n<br/>\nThis sounds like an awesome educational experience.  This was sent to <br/>\nall<br/>\nFAA employees (of which my husband is one)  He has been working their <br/>\nsince<br/>\nSeptember 25, and really likes the job.  K Farmer<br/>\n<br/>\nSubject: COF--The weather contest of the century!<br/>\n<br/>\nPlease distribute to all employees.<br/>\n<br/>\nIf educators happen to be on your acquaintance&#39;s list,  please share <br/>\nthis<br/>\ninformation about  the weather contest of the century.  This message <br/>\nwas     prepared by The U. S. Centennial Of Flight Commission and has <br/>\nbeen<br/>\nsubmitted by Stephanie Webb, Regional AVED Outreach Program Manager,<br/>\n816-329-2420.  For any questions regarding the contest,  Contact: <br/>\nJulie<br/>\nBreissinger (804.675.8167), Christian Markow (804.675.8153)<br/>\n<br/>\nTEACHERS SIGN UP YOUR STUDENTS NOW FOR THE WEATHER CONTEST OF THE <br/>\nCENTURY!<br/>\n<br/>\nStudents Forecasting Weather for Dec. 17th Flight Re-creation at Kill<br/>\nDevil Hills, NC<br/>\n<br/>\nContact: Julie Breissinger (804.675.8167), Christian Markow <br/>\n(804.675.8153)<br/>\n<br/>\nWHAT:  <br/>\n<br/>\nStarting September 25, students in grades K-12 are being challenged <br/>\nto predict what the weather conditions at Kill Devil Hills, N.C., <br/>\nwill be on Dec. 17, 2003, the 100th anniversary of the Wright <br/>\nbrothers first powered flight. On that day, man will attempt to <br/>\nrecreate that first flight in the most accuratereproduction of the <br/>\n1903 flyer ever built.<br/>\n<br/>\nWHO:<br/>\nThe 2003 Flight Forecast program is a national contest developed by <br/>\nthe U.S. Centennial of Flight Commission and The Franklin Institute <br/>\nScience Museum. It provides teachers with fun and interactive <br/>\nactivities and historical weather data that students can analyze as a <br/>\nbasis for predicting the weather at Wright Brothers National Memorial <br/>\non Dec. 17, 2003. All of the activities align with the National <br/>\nScience Education Standards, the National Principles and Standards <br/>\nfor School Mathematics, or some combination of both.<br/>\n<br/>\nWHY: <br/>\n<br/>\nMedia around the world will be covering the attempt to re-create the <br/>\nfirst flight. This contest gives students a once-in-a-lifetime chance <br/>\nto be part of history. Additionally, the event gives students an <br/>\nexciting way to apply and learn theories of<br/>\nmathematics and science to a real-life situation.<br/>\n<br/>\nHOW: <br/>\nTeachers are asked to go online to www.centennialofflight.gov to <br/>\nregister their classes between September 25 and November 3 to <br/>\nparticipate in the program. Once on the Web site, teachers will also <br/>\nfind activities and information to help their students explore <br/>\naviation and meteorology.<br/>\n<br/>\nMORE DETAILS:   Forecasts will be collected in three grade groupings, <br/>\nK-4, 5-8 and 9-12, with the complexity of the forecast increasing at <br/>\nthe higher grade levels. Forecasts must be submitted online no later <br/>\nthan Nov. 17, 2003, and prizes will be awarded for the most accurate <br/>\nforecasters within each grade group.<br/>\n<br/>\nThe 2003 Flight Forecast program is a part of the national Centennial <br/>\nof Flight: Born of Dreams Inspired by Freedom campaign coordinated by <br/>\nthe U.S. Centennial of Flight Commission in honor of the 100th <br/>\nanniversary of the Wright brothers&#39; first powered flight. Additiona; <br/>\neducational materials and resources related to the history of flight <br/>\nare available at www.centennialofflight.gov/user/edu.htm. Teacher <br/>\nquestions about the 2003 Flight Forecast program can be sent to: <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:forecast@...\">forecast@...</a>.<br/>\n<br/>\nThe U.S. Centennial of Flight Commission was created by Congress to <br/>\nexpand national and international interest in the commemoration of <br/>\nthe centennial of powered flight. The Commission is coordinating a <br/>\nnational outreach campaign and advising<br/>\nthe President, Congress and federal agencies on the most effective <br/>\nways to encourage and promote national and international <br/>\nparticipation in 2003. Its members include the director of the <br/>\nNational Air and Space Museum, the administrators of NASA and the <br/>\nFAA, the presidents of the Experimental Aircraft Association and<br/>\nFirst Flight Centennial Foundation of North Carolina, and the <br/>\nchairman of Inventing Flight: Dayton 2003.</div>","specialLinks":[]}],"prevTopicId":83191,"nextTopicId":83241}}