{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":443923164,"authorName":"CASS KOTRBA","from":"&quot;CASS KOTRBA&quot; &lt;caskot@...&gt;","profile":"cass.kotrba","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Mom stuck or daughter stuck or both?","postDate":"1427129951","msgId":75766,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENPTDEzMC1EUzk4RTk0M0FDRDlCOTBGMUY4NDlENEM0MEQwQHBoeC5nYmw+","inReplyToHeader":"PDE3NDhBMTRGLUEzQTgtNDQ0Qi04NjA1LUQwRkJBMUEzMzUwRUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDE3NDhBMTRGLUEzQTgtNDQ0Qi04NjA1LUQwRkJBMUEzMzUwRUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":75759,"nextInTopic":0,"prevInTime":75765,"nextInTime":75767,"topicId":75759,"numMessagesInTopic":0,"msgSnippet":"-=- But I said I felt that she wasn t 100% happy right now. She agreed with me and, together, we came up with the idea of her trying some activities or hobbies","messageBody":"<div id=\"ygrps-yiv-807608751\">\n<html><head>\n \n \n<style></style>\n</head>\n\n\n\n \n<div>\n<div>-=- But I said I felt that she wasn&#39;t 100% happy right now. She agreed with \nme and, together, we came up with the idea of her trying some activities or \nhobbies - dipping her toe in the water, as it were, because she said she didn&#39;t \nknow what she wanted to do but felt that she wanted to do something. She also \nsaid she felt her shyness held her back as it&#39;s harder to find activities that \nshe can do with me present as she gets older. She then said she fancied learning \na musical instrument or to sing. I asked her if she wanted lessons, and she \nbecame quite animated. We have a piano and various other instruments - learning \nto play something would be very easy. But within ten minutes, she&#39;d gone back to \nshrugging her shoulders and saying &#39;yeah, maybe&#39; at anything I said.-=-</div>\n<div>&nbsp;</div>\n<div>&nbsp;</div>\n<div>Maybe she&#39;s desiring more&nbsp;activities outside the home or maybe she \nthinks that she &quot;should&quot; have more going on or that you&#39;d be happier if she had \nmore things going on in her life.</div>\n<div>&nbsp;</div>\n<div>\n<div>Rather than focusing on finding things outside of the house that occur on a \nregular schedule, I&#39;d try to find additional activities that she can pick up \nanytime and do at home. If you have musical instruments at home and she&#39;s shown \nan interest in that, maybe she&#39;d like an interesting video&nbsp;that she can \nturn on in the&nbsp;moment that it appeals to her. It might be more appealing to \nher&nbsp;not to have&nbsp;the big commitment to get ready, leave the house and \nbe committed to a lesson for a predetermined amount of time.&nbsp; If she&#39;s at \nhome &amp; she gets bored in 10 minutes then it&#39;s fine, she can look for \nsomething else.</div>\n<div>&nbsp;</div></div>\n<div>-=- So I suggest things, she becomes animated for about five minutes, and \nthen she goes off the idea. -=-</div>\n<div>&nbsp;</div>\n<div>Maybe she wants to please you or it sounds good&nbsp;in the moment but if \nthe interest passes then that&#39;s ok.&nbsp; I have seen my daughter show interest \nin things many times that end up being just a passing idea.&nbsp; But when she \nreally hooks onto something she becomes passionate and motivated and seems to \nhave boundless energy for that endeavor.&nbsp; Until it passes and she&#39;s onto a \nnew idea.&nbsp; Sometimes there is a period of restlessness or boredom in \nbetween and I try to help her brain storm new interests/activities.&nbsp; \nUsually she will not take my ideas but sometimes it helps trigger&nbsp;something \nelse&nbsp;in her mind.</div>\n<div>&nbsp;</div>\n<div>-=-However, she does, on some days (and I know we all do!) get a bit \n&#39;stuck&#39; (in her own words). If her friends go off-line, she sometimes finds it \ndifficult to shift off the computer so just mooches around on YouTube. Sometimes \nshe does this proactively. Sometimes this isn&#39;t a problem whether it&#39;s proactive \nor out of boredom. But sometimes, she tells me, she feels like she can&#39;t really \nget herself to do anything else and I&#39;m at a bit of a loss as to how to help \nher. -=-</div>\n<div>&nbsp;</div>\n<div>There is an incredible amount of interesting stuff on YouTube so maybe she \n&quot;just mooches around on YouTube&quot; (I&#39;m not familiar with that phrase but it does \nnot sound like a very nice description) or maybe she&#39;s finding fascinating and \ninteresting things on there.&nbsp; I suspect she&#39;s getting more out of the \nactivity than your description indicates. </div>\n<div>&nbsp;</div>\n<div>I would try to find more options for her that are easy to reach for in the \nmoment and that are appealing to an older girl but I would be careful not to say \nthings that she could perceive as pressure to do or be more than she already \nis.&nbsp; I would work within myself on being ok with the idea that she is going \nthrough a period in her life where&nbsp;she sometimes&nbsp;feels blue, restless \nor angst.&nbsp; It is part of who she is right now and may not be something mom \ncan jump in and fix.&nbsp;A warm, reassuring smile might be more welcome than \nsuggestions at times.</div>\n<div>&nbsp;</div>\n<div>-=- I feel a little like I&#39;m going round in endless circles with her; \nstuck, I guess.&nbsp; -=-</div>\n<div>Going around in circles will make you dizzy.&nbsp; Stop circling around \nher.</div>\n<div>&nbsp;</div>\n<div>-=- I think I annoy her, although she&#39;s clear that she adores me too. \n-=-</div>\n<div>Do you need her reassurance on this point?&nbsp; Asking for her reassurance \nthat you are ok and that she is ok could be annoying! :D</div>\n<div>&nbsp;</div>\n<div>-Cass</div></div></html></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Mom stuck or daughter stuck or both?","postDate":"1427072068","msgId":75759,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE3NDhBMTRGLUEzQTgtNDQ0Qi04NjA1LUQwRkJBMUEzMzUwRUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":75766,"prevInTime":75758,"nextInTime":75760,"topicId":75759,"numMessagesInTopic":0,"msgSnippet":"Someone requested that this be posted anonymously.  I wrote the subject line myself. I m concerned that I m not really meeting my 11.5 year old daughter s","messageBody":"<div id=\"ygrps-yiv-2124703694\">Someone requested that this be posted anonymously.  I wrote the subject line myself.<br/>\n<br/>\n<br/>\n<br/>\nI&#39;m concerned that I&#39;m not really meeting my 11.5 year old daughter&#39;s needs as well as I ought to be and I&#39;d be very grateful for some ideas from parents of children who&#39;ve passed this age. She is very much in adolescence now and has three younger siblings, for context. I found the thread on the facebook group about cocooning pre-teens very helpful ( <a rel=\"nofollow\" target=\"_blank\" href=\"https://www.facebook.com/groups/303347574750/permalink/10152848728039751/\">https://www.facebook.com/groups/303347574750/permalink/10152848728039751/</a> ) and have a huge amount of trust in this need my own pre-teen has to be in her room socialising online with her friends. On the most part, she is happy and proactive about this. I wrote on here a while ago concerned that she wasn&#39;t very happy, but I don&#39;t feel that is the case at all now. However, she does, on some days (and I know we all do!) get a bit &#39;stuck&#39; (in her own words). If her friends go off-line, she sometimes finds it difficult to shift off the computer so just mooches around on YouTube. Sometimes she does this proactively. Sometimes this isn&#39;t a problem whether it&#39;s proactive or out of boredom. But sometimes, she tells me, she feels like she can&#39;t really get herself to do anything else and I&#39;m at a bit of a loss as to how to help her. I do a lot of going and watching with her, snuggling in her bed with her. Sometimes she doesn&#39;t want me to do that and is really quite resistant to my presence at all. I honour that and leave her, maybe bringing her a drink later on with no pressure. This is not about me - I am not pining for her affection or anything! But, when we talk outside of the situation, she says she wishes she had more in her life. So I suggest things, she becomes animated for about five minutes, and then she goes off the idea. <br/>\n<br/>\nAn example: yesterday, after noticing that she&#39;d been a bit blue for a few days, I invited her out for a drink to a coffee shop with me and her grandma, who she&#39;s very close with. She was delighted but soon began to appear &#39;blue&#39; to me again, brushing my hand away if I touched her at all. Later, I said to her that I wanted to help her do the things she wants to do but that I can&#39;t read her mind. If she wants to play all day long online with her friends, I&#39;ll help her to do that. But I said I felt that she wasn&#39;t 100% happy right now. She agreed with me and, together, we came up with the idea of her trying some activities or hobbies - dipping her toe in the water, as it were, because she said she didn&#39;t know what she wanted to do but felt that she wanted to do something. She also said she felt her shyness held her back as it&#39;s harder to find activities that she can do with me present as she gets older. She then said she fancied learning a musical instrument or to sing. I asked her if she wanted lessons, and she became quite animated. We have a piano and various other instruments - learning to play something would be very easy. But within ten minutes, she&#39;d gone back to shrugging her shoulders and saying &#39;yeah, maybe&#39; at anything I said. Later on she came to me and said she wanted to try film-making if I could help her find somewhere she could learn that (she does some already, but wanted a course or something). But that idea quickly went off the boil too.<br/>\n<br/>\nI want to be clear that I don&#39;t want her to be interested in more things because I think she ought to be, but because she&#39;s said she wants to have other things going on in her life. She does have other things going on...but she&#39;s said she&#39;d like something regular that she can know is happening each week, or whatever. <br/>\n<br/>\nI feel a little like I&#39;m going round in endless circles with her; stuck, I guess. I&#39;m not sure she feels she really relates to me that well...I think I annoy her, although she&#39;s clear that she adores me too. I know this is also her age and maybe that&#39;s all I need to do - be with her (not necessarily physically), love her, be aware of her, and be patient for her getting through this demotivated patch. But I&#39;m concerned that maybe I&#39;m missing something; that there&#39;s something I could be doing (or doing better) that I&#39;m not. <br/>\n<br/>\nI&#39;d be very grateful for any thoughts.</div>","specialLinks":[]}],"prevTopicId":75745,"nextTopicId":75754}}