{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":21,"messages":[{"userId":333388203,"authorName":"Rinelle","from":"&quot;Rinelle&quot; &lt;rinelle@...&gt;","profile":"rinelle2011","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: spending time, sons anger & finding balance","postDate":"1341391447","msgId":68081,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFEOEVDQkJGNEFCQjQ5OUVCOEFEMzc4RDU2NDk4MkZBQFJpbmVsbGVQQz4=","inReplyToHeader":"PGpzdnN0cStqZGJjQGVHcm91cHMuY29tPg==","referencesHeader":"PGpzdnN0cStqZGJjQGVHcm91cHMuY29tPg=="},"prevInTopic":68079,"nextInTopic":0,"prevInTime":68080,"nextInTime":68082,"topicId":67778,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-986152618\">&lt;--I didn&#39;t (don&#39;t) want to be that way with my own, and so I thought having them be with me was what would be good, but I can see where it really isn&#39;t. They are afraid to be with other people, so it&#39;s going to take some time for them to be okay. ***but it doesn&#39;t come from keeping kids isolated.*** Yes, I can see that now. Again, I have to trust and be supportive of their growth and their independence. –&gt;<br/>\nAnd finding a way for kids to be with other people doesn’t mean you have to leave them.  I assume that’s what you mean when you say they are afraid to be with other people?  It is totally possible for you to take them places to hang out with other kids without leaving them.  They will be happy to be left when they are ready.  <br/>\nTamara<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":523283422,"authorName":"marlo_blake","from":"&quot;marlo_blake&quot; &lt;beingfree4meand3@...&gt;","profile":"marlo_blake","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: spending time, sons anger & finding balance","postDate":"1341355770","msgId":68079,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpzdnN0cStqZGJjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpzc2tmaCsxNXJlQGVHcm91cHMuY29tPg=="},"prevInTopic":68072,"nextInTopic":68081,"prevInTime":68078,"nextInTime":68080,"topicId":67778,"numMessagesInTopic":0,"msgSnippet":"***It s possible they re not starving for **your** attention - or not Just your attention. If they have no other social outlets at all, their lives could seem","messageBody":"<div id=\"ygrps-yiv-1370164402\">***It&#39;s possible they&#39;re not starving for **your** attention - or not Just your attention. If they have no other social outlets at all, their lives could seem very empty and small.***<br/>\n<br/>\nThis makes sense to me, and I can see how this would be - I was making it about me again, too.  I&#39;m guessing it&#39;s like tv - having friends & doing things with their friends is another thing *in Addition to* other things in their lives - it&#39;s a way of expanding the world for them.  ***Look for ways to make their lives bigger and fuller.***  Yes, I will.<br/>\n<br/>\n<br/>\n***Sometimes the hardest thing for a mom to come to grips with is that she won&#39;t always be the center of her kids&#39; worlds.***<br/>\n<br/>\n***At best, parents can provide a kind of &quot;home base&quot; a place to come back to, to feel safe and to relax. That&#39;s not to say you can&#39;t maintain a warm, comfortable relationship with your kids - some parents do that even with kids in school, but it doesn&#39;t come from keeping kids isolated. It comes from developing a relationship where kids can trust parents to be supportive as they learn about the world.*** <br/>\n<br/>\nYah, here is where I&#39;m not (wasn&#39;t) finding the balance (and maybe in the above statement as well).  My mom never really spent time with me (& my sister), and she still doesn&#39;t.  She Only comes over when I call her for help, and then she stays for only the amount of time I ask her to - she&#39;s out the door before it even opens!  So, growing up, our friends Were more important.<br/>\n<br/>\nI didn&#39;t (don&#39;t) want to be that way with my own, and so I thought having them be with me was what would be good, but I can see where it really isn&#39;t.  They are afraid to be with other people, so it&#39;s going to take some time for them to be okay.  ***but it doesn&#39;t come from keeping kids isolated.***  Yes, I can see that now.  Again, I have to trust and be supportive of their growth and their independence.<br/>\n<br/>\nthank you!</div>","specialLinks":[]},{"userId":331638196,"authorName":"Rachel","from":"Rachel &lt;athenagwis@...&gt;","profile":"athenagwis2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: spending time, sons anger & finding balance","postDate":"1341264871","msgId":68072,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBTHA1eTRnVE5EajZ2K3FacGJXSE0wMUJEQWZac2RFSGV2QzVybzhGSnBIVXY0ekF4d0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGpzcnVkZis0bmZsQGVHcm91cHMuY29tPg==","referencesHeader":"PENBT09UYVhQWStaSlVhdEFRYWdjQjcwPWZpbk84VFo5M0EwOE1BcTJHNXlPZW9QeGpHUUBtYWlsLmdtYWlsLmNvbT4JPGpzcnVkZis0bmZsQGVHcm91cHMuY29tPg=="},"prevInTopic":68070,"nextInTopic":68079,"prevInTime":68071,"nextInTime":68073,"topicId":67778,"numMessagesInTopic":0,"msgSnippet":"===Maybe this sounds silly to ask, but kids really go *off to play* with their friends at ages 5 & 7? Where do they go?=== I will pipe in on this part too.  My","messageBody":"<div id=\"ygrps-yiv-651186941\">===Maybe this sounds silly to ask, but kids really go *off to play* with<br/>\ntheir friends at ages 5 & 7? Where do they go?===<br/>\n<br/>\nI will pipe in on this part too.  My son is now 9, but since he was 5 or so<br/>\nhe would be outside playing with friends in the neighborhood.  We live in a<br/>\ncondo complex where we are the only homeschoolers.  When he was in school<br/>\nwith them (at age 5 &6), he would come home and go outside to play.  We<br/>\nhave a tennis court and some playgrounds, so they would play there.  If<br/>\nthere was one overly cautious parent, they would play in front of their<br/>\nhouse so they could keep an eye on their child (which worked good for<br/>\neveryone else too!)  Now that he is older and we homeschool, he will meet<br/>\nall his buddies at the bus stop when they get home from school and they<br/>\nwill ride bikes around the condos, skateboard, or just simply hang out.  I<br/>\njust ask that he tell me if he is going to go inside a friend&#39;s house so I<br/>\nknow where to look for him if I should need to (safety concern) and he is<br/>\nvery respectful of that.  He even introduced me (of his own accord) to two<br/>\nnew buddies that he was planning on going into their house the other day.<br/>\nIf he hasn&#39;t told me he is inside someone&#39;s house, I can generally walk out<br/>\nand find him within a couple minutes, I will do that occasionally just for<br/>\nmy own comfort (and he often doesn&#39;t see me do this and I don&#39;t do it quite<br/>\nas much now that he is older).  He loves the freedom to just play with his<br/>\nfriends and he learns a lot!! In the past few months we have discussed<br/>\nevery possible combination of families (half brother or sister, stepbrother<br/>\nor sister, divorces, etc...) because of the different types of families his<br/>\nfriends have and this is just one example of things he has learned while<br/>\nbeing with all his friends here.<br/>\n<br/>\nBe sure to never underestimate the power of free time with friends.  You<br/>\nmay not be able to imagine what they will do, but I can promise they will<br/>\nfind millions of things to do.  It is a bit sad to have your kids<br/>\nelsewhere, but I think if they have a strong foundation with you, you won&#39;t<br/>\n&quot;lose&quot; them.  I think the parents that lose their kids, never had them to<br/>\nbegin with.  My son will often come home even when all the kids are out<br/>\nstill playing just because he wants to be here instead.  He is welcome to<br/>\ngo or welcome to leave and he feels comfortable doing either.  But I will<br/>\nsay it is nice to have a couple hours in the afternoon to myself to get<br/>\nsome stuff done around here.<br/>\n<br/>\nRachel<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: spending time, sons anger & finding balance","postDate":"1341248817","msgId":68070,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpzc2tmaCsxNXJlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpzcnVkZis0bmZsQGVHcm91cHMuY29tPg=="},"prevInTopic":68069,"nextInTopic":68072,"prevInTime":68069,"nextInTime":68071,"topicId":67778,"numMessagesInTopic":0,"msgSnippet":"... ***************** It s possible they re not starving for **your** attention - or not Just your attention. If they have no other social outlets at all,","messageBody":"<div id=\"ygrps-yiv-56301919\">&quot;marlo_blake&quot; &lt;beingfree4meand3@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;They are starving for my attention and fighting over it, how could sending them away help?      <br/>\n </span></blockquote>*****************<br/>\n<br/>\nIt&#39;s possible they&#39;re not starving for **your** attention - or not Just your attention. If they have no other social outlets at all, their lives could seem very empty and small. That&#39;s not good for learning. Look for ways to make their lives bigger and fuller. If you&#39;re stuck, unable to figure out how to do that with all the kids home, it could help to enlist other resources, other people, even though doing so could come at the price of giving up on unschooling. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; I know this is *sick* thinking, and I would like help with it from this group.  I was fearful that I would lose them TO their friends.<br/>\n </span></blockquote>**************<br/>\n<br/>\nSometimes the hardest thing for a mom to come to grips with is that she won&#39;t always be the center of her kids&#39; worlds. They&#39;ll have other relationships, make other friends, learn from other people. At best, parents can provide a kind of &quot;home base&quot; a place to come back to, to feel safe and to relax. That&#39;s not to say you can&#39;t maintain a warm, comfortable relationship with your kids - some parents do that even with kids in school, but it doesn&#39;t come from keeping kids isolated. It comes from developing a relationship where kids can trust parents to be supportive as they learn about the world. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":269399205,"authorName":"Alex Polikowsy","from":"Alex Polikowsy &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: spending time, sons anger & finding balance","postDate":"1341240346","msgId":68069,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdBQUIyQTc1LTU3MzAtNDU2Mi05Qzg3LUQwMzkzOEZDMjI2MEB5YWhvby5jb20+","inReplyToHeader":"PGpzc2I2cSs5bmdxQGVHcm91cHMuY29tPg==","referencesHeader":"PGpzc2I2cSs5bmdxQGVHcm91cHMuY29tPg=="},"prevInTopic":68068,"nextInTopic":68070,"prevInTime":68068,"nextInTime":68070,"topicId":67778,"numMessagesInTopic":0,"msgSnippet":"I do not live in a neighborhood so I do a lot of playdates here or their friends house. I set up get togethers at the pool , park, any lots of other venues for","messageBody":"<div id=\"ygrps-yiv-1644062179\">I do not live in a neighborhood so I do a lot of playdates here or their friends house. I set up get togethers at the pool , park, any lots of other venues for my kids!<br/>\nThis summer we have been going to the pool at our club most everyday and we either take a friend or there are always friends there because we have been members since before they were born.<br/>\nWe also have a great and very diverse homeschool group that gets together at least once a week.<br/>\nOur kids still love to be with us and the other day my son even chose to go bike with dad than meet some other homeschool friends. <br/>\n<br/>\nSent from my iPhone<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Jul 2, 2012, at 9:28 AM, &quot;keetry&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:keetry@...\">keetry@...</a>&gt; wrote:<br/>\n<br/>\n&gt; = </span></blockquote></div>","specialLinks":[]},{"userId":332901363,"authorName":"keetry","from":"&quot;keetry&quot; &lt;keetry@...&gt;","profile":"keetry","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: spending time, sons anger & finding balance","postDate":"1341239322","msgId":68068,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpzc2I2cSs5bmdxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpzcnVkZis0bmZsQGVHcm91cHMuY29tPg=="},"prevInTopic":68067,"nextInTopic":68069,"prevInTime":68067,"nextInTime":68069,"topicId":67778,"numMessagesInTopic":0,"msgSnippet":"== kids really go *off to play* with their friends at ages 5 & 7?  Where do they go? == My boys are currently 8 and 5 (just turned in June). They go outside to","messageBody":"<div id=\"ygrps-yiv-971485658\">== kids really go *off to play* with their friends at ages 5 & 7?  Where do they go? ==<br/>\n<br/>\nMy boys are currently 8 and 5 (just turned in June). They go outside to play with other kids in the neighborhood almost every day. The only days they don&#39;t are when no one else is available. These days they mostly play in about a 4 house yard radius around our house. My 8 year old has started to venture further with his friends, like into the cul-de-sac across the street or up around the corner. <br/>\n<br/>\nWhen the 8 year old was younger, about 3-5, he would play in my or my next door neighbor&#39;s backyard with the boy who lives there who is the same age. They have been best friends for 5 years now (since we moved into this house), which is really cool. As he and his friend got older they started venturing further and further, into the front yards and then to a few other houses. My now 5 year old can venture a little further than his older brother at that age when he&#39;s with his older brother. <br/>\n<br/>\nOne of the reasons I moved the family to this house in this neighborhood was so my boys would have kids to play with. There were never any kids out playing at first place we lived here. I needed to find somewhere else for us to live where my boys could go right outside our home and find other kids to play with.<br/>\n<br/>\nAlysia</div>","specialLinks":[]},{"userId":523283422,"authorName":"marlo_blake","from":"&quot;marlo_blake&quot; &lt;beingfree4meand3@...&gt;","profile":"marlo_blake","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: spending time, sons anger & finding balance","postDate":"1341226222","msgId":68067,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpzcnVkZis0bmZsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBT09UYVhQWStaSlVhdEFRYWdjQjcwPWZpbk84VFo5M0EwOE1BcTJHNXlPZW9QeGpHUUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":67949,"nextInTopic":68068,"prevInTime":68066,"nextInTime":68068,"topicId":67778,"numMessagesInTopic":0,"msgSnippet":"It s taken me a bit to respond to any of these posts because I ve had to let things sink in & re-read, plus I ve started observing my situation & myself (some","messageBody":"<div id=\"ygrps-yiv-1869588552\">It&#39;s taken me a bit to respond to any of these posts because I&#39;ve had to let things sink in & re-read, plus I&#39;ve started observing my situation & myself (some more).  <br/>\n<br/>\n***How often do they have friends over, or go off to play with friends? From your description, you&#39;re the only person in their whole world***<br/>\n<br/>\n***And I second the idea that having lots and lots of other kids around helps.***<br/>\n<br/>\nWe NEVER have friends over.  Sad.  They have Never gone *off* to play with friends.  We Used to have friends, but they started school & we just ended up going our own ways - that was also about the same time I started living this fear-based life.  And, yes, I am the only person in their whole world - always have been.  My sister (only sibling & my husband&#39;s an only child) and her husband will have them over at their house maybe once a month or if my husband & I want to do something together - other than that it&#39;s me.  When we&#39;d go to parks they would make friends, but then again it was because I wouldn&#39;t play with them (I do now), but those friends were gone when we/they left the park.  Maybe this sounds silly to ask, but kids really go *off to play* with their friends at ages 5 & 7?  Where do they go? <br/>\n<br/>\nI know this is *sick* thinking, and I would like help with it from this group.  I was fearful that I would lose them TO their friends.  What I&#39;m trying to say is that I see (hear) our neighborhood parents (& some people in general) talk about how their (schooled) children are never home, always with their friends, how they have &quot;lost&quot; their child(ren), etc.  Okay, I have to be more specific because this isn&#39;t what I mean, but yet it is.  You know how parents of schooled children talk about things like:  &quot;you know, one day you don&#39;t even know who your children are anymore - they are off running with their friends - their friends are more important now.&quot;  One gal (parent of schooled children) even said to me that one day my children aren&#39;t even going to care about me anymore or want to be with me because their friends are going to be more important, and that us parents are just an embarrassment to teenagers.  And she said it like it was a normal part of life - the next path they take.  I don&#39;t want that.  I want a relationship with my children - I want them to come to me with their problems or if they are uncomfortable with something & not go to their friends for help - I want to be an advocate/their friend not someone who&#39;s seen as the enemy.  I Want them to have friends - without Losing them. <br/>\n<br/>\n ***I&#39;d say four days out of five per week, we&#39;re out doing something, even if it&#39;s a two-hour run around the park. And sometimes, when the squabbling gets bad, that&#39;s when I know it&#39;s time for such an outing.***<br/>\n<br/>\nI&#39;ve been doing this (& making arrangements with past friends & new) & it has made a big difference for all of us - thank you everyone.  My children are getting out - they are happy & they are getting lots of RUN time that they so need & love.  And, actually, what I&#39;ve started doing is watching Them & taking notes on what works & what doesn&#39;t for Them - this list has been very helpful.  Also, what I realized (tonight) was that during today while we were at the beach, my oldest daughter didn&#39;t want to be there because she wanted to be at a local pool where she could jump in & dive for things on the bottom.  My other two didn&#39;t want to leave, so we stayed.  What I did was validated her feelings & just hung out.  The thing was is that I didn&#39;t really want to be there either, so that energy just kept going.  So what I realized was that maybe next time something like that happens is to get myself out of that mode & do something With Her/Him to make her/his unhappy stay a bit more enjoyable.  Reading this board is helping me to see the little things that can make a big difference for Them.<br/>\n     <br/>\n<br/>\n***Honestly, I&#39;d look for a way to shake everything up - maybe in a really big way, like summer camp, or sending them to visit relatives - maybe different camps or relatives so one or two are gone at a time. It might even be better to send them to school in the fall rather than trying to dig your way out from where you are.*** <br/>\n<br/>\nYah, but wouldn&#39;t that make things almost worse?  They are starving for my attention and fighting over it, how could sending them away help?      <br/>\n<br/>\n***The problem, I&#39;d say, is in looking for *a* solution to a problem. It&#39;s like grabbing something to stuff into a hole then looking to the next without looking at the hole and other holes and what might be causing the holes and what else could be used as a plug. And keep going as things get better and better.***<br/>\n<br/>\nAnd that&#39;s what I was doing, I was wanting to fix the behavior/problem, so that everything would go away, and *I* would be happy.  I was grabbing at whatever I could find or what ever I thought was working - ***Believing something is working isn&#39;t the same as working.***  And, now I know to find the source through the behavior rather than focus on fixing the behavior & right now (but I am still watching/observing my children for clues) I think the MAIN source is that I wasn&#39;t there for them when they needed me.  I wasn&#39;t there for my oldest two when the baby was born.  I know I wasn&#39;t.  I pushed them aside like old clothes because I had this new dress to love.  They were nearly 2 1/2 yo when this began, and now they are 7 1/2.  It wasn&#39;t like I planned it; this is what happened, so I have to work from this point.  And I WANT to work from this point.  How do you make up for that lost attention?  Attention that they are starving for - all of them?  I know I can&#39;t go back, but how do you give, give, give?<br/>\n<br/>\n***There&#39;s also fear involved. There&#39;s the fear that this isn&#39;t perfect but something else might be worse so it&#39;s less scary to stick with what was better than before.***<br/>\n<br/>\n***The rest of what you wrote is about convincing yourself not to try because you fear making things worse. No one here can help you do that. You need to want to change and then seek out help.***<br/>\n<br/>\nYes, all of this is true.  I do want change, and that is why I&#39;m here - to Read/ Learn/Observe/Change/ask.  I don&#39;t Expect you all to make My life better/simpler - to fix me - I know it starts with me.  I&#39;m thankful, though, that I can come to you for help & go from there.<br/>\n<br/>\n***I suspect the advice sounded like it made sense. Where you went wrong was in looking more at the advice than at the effect it was having. The effect was feedback on whether it was working. You were a drift at sea, clinging to a rotten piece of wood with rusty nails in it because it was better than the nothing you had before. And you were determined to cling and not look around for fear of losing that piece of wood.***<br/>\n<br/>\nYes, and I&#39;m ready to let that piece of rotten wood go.  And, I&#39;m ready to trust life, myself, and my children.<br/>\n<br/>\n<br/>\n<br/>\n***Moms often feel torn. Try to be more accepting of the reality that you will feel torn - take it as a natural part of life and don&#39;t stress over it.  Keep your voice light and easygoing and relax your body on purpose - breathe full breaths, not short little panting ones.  Look RIGHT into your children&#39;s eyes - we tend to look away when we feel overwhelmed. Touch them - just a light touch on the head or back or arm - while you calmly and happily say, &quot;I&#39;ll be with you in, oh, probably about 5 minutes.&quot; When the child objects and is becoming upset - the best thing you can do for him is to NOT become tense and upset, but stay calm and say something like, &quot;Hang in there, you can do it.&quot;***<br/>\n<br/>\nI thank you for this Pam.  I never knew it was okay to feel torn, really.  Maybe it&#39;s not advisable to use scripts (not sure?), but I have to say that I have used this, and it has helped me soooo many times.  I could have lost it many times, & I hear your words & your images of breathing, looking right into their eyes & gently touching them, and doing this has helped me to remain calm.  Plus, the most wonderful/amazing part is that I see my children in a different light - I see them for who they are and where they are in that moment in time, and it helps me to focus on them, so that I can help them better.<br/>\n<br/>\nMarlo</div>","specialLinks":[]},{"userId":227835915,"authorName":"m_aduhene","from":"&quot;m_aduhene&quot; &lt;m_aduhene@...&gt;","profile":"m_aduhene","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: spending time, sons anger & finding balance","postDate":"1340651253","msgId":67949,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpzYWN0bSt2MjNwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBT09UYVhQWStaSlVhdEFRYWdjQjcwPWZpbk84VFo5M0EwOE1BcTJHNXlPZW9QeGpHUUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":67903,"nextInTopic":68067,"prevInTime":67948,"nextInTime":67950,"topicId":67778,"numMessagesInTopic":0,"msgSnippet":"pam this is just what i needed to read.  what a lovely way to respond to them.  i needed to know how to be when i felt overwhelmed by all the different asks","messageBody":"<div id=\"ygrps-yiv-582148352\">pam<br/>\nthis is just what i needed to read.  what a lovely way to respond to them.  i needed to know how to be when i felt overwhelmed by all the different asks from my children. i especially like the &quot;hang in there, you can do it&quot;.  <br/>\nblessings<br/>\nmichelle<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Pam Sorooshian &lt;pamsoroosh@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; On Fri, Jun 22, 2012 at 2:33 PM, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n&gt; <br/>\n&gt; &gt; Many parents make the mistake of talking to their children about what they<br/>\n&gt; &gt; (the mom) intend to do, and how they&#39;re doing it, and asking the children<br/>\n&gt; &gt; how it might be done differently. It&#39;s too much talk, too much<br/>\n&gt; &gt; responsibility on the kids, and too much focus on something negative.&gt;&gt;<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; And of formalizing things that would be better kept casual and natural and<br/>\n&gt; flexible.<br/>\n&gt; <br/>\n&gt; It might take a while for these little kids to forget that mommy was<br/>\n&gt; rationing her time (&quot;doing time&quot;). Life with three little kids is very<br/>\n&gt; demanding and often doesn&#39;t feel like it is going smoothly while it is<br/>\n&gt; happening. Moms often feel torn. Try to be more accepting of the reality<br/>\n&gt; that you will feel torn - take it as a natural part of life and don&#39;t<br/>\n&gt; stress over it. Handle it with a sense of ease and the kids will pick up on<br/>\n&gt; that, too, eventually. You might need to fake it for a while - fake that<br/>\n&gt; you&#39;re not stressed by it. Keep your voice light and easygoing and relax<br/>\n&gt; your body on purpose - breathe full breaths, not short little panting ones.<br/>\n&gt; Look RIGHT into your children&#39;s eyes - we tend to look away when we feel<br/>\n&gt; overwhelmed. Touch them - just a light touch on the head or back or arm -<br/>\n&gt; while you calmly and happily say, &quot;I&#39;ll be with you in, oh, probably about<br/>\n&gt; 5 minutes.&quot; When the child objects and is becoming upset - the best thing<br/>\n&gt; you can do for him is to NOT become tense and upset, but stay calm and say<br/>\n&gt; something like, &quot;Hang in there, you can do it.&quot;<br/>\n&gt; <br/>\n&gt; You be the calm centered person in the group so that the frazzled fussy<br/>\n&gt; kids take their cue from you. It won&#39;t happen right away. But at least in<br/>\n&gt; the meantime YOU are practicing calmness and centeredness under difficult<br/>\n&gt; circumstances and that will only be good for you. While you&#39;re practicing,<br/>\n&gt; you&#39;ll lose it and suddenly realize you&#39;re all anxious and stressed. As<br/>\n&gt; soon as you recognize it, that&#39;s the moment when you breathe really deep,<br/>\n&gt; put a smile on your face, look deeply into a child&#39;s eyes, give a child a<br/>\n&gt; very gentle touch.<br/>\n&gt; <br/>\n&gt; -pam<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":262715215,"authorName":"Catherine Forest","from":"&quot;Catherine Forest&quot; &lt;cforest@...&gt;","profile":"catherinemforest","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: spending time, sons anger & finding balance","postDate":"1340505270","msgId":67903,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTE1Ny1EUzNEM0Y4MEZBM0I3NDE4OUEwMUQ2N0I1RTIwQHBoeC5nYmw+"},"prevInTopic":67870,"nextInTopic":67949,"prevInTime":67902,"nextInTime":67904,"topicId":67778,"numMessagesInTopic":0,"msgSnippet":"I am in a very similar situation than you are. I have 8 yo twin girls and a 6 1/2 yo girl. It is a very unique family dynamic, I find. Just like you, I have","messageBody":"<div id=\"ygrps-yiv-396345735\">I am in a very similar situation than you are. I have 8 yo twin girls and a 6 1/2 yo girl. It is a very unique family dynamic, I find. Just like you, I have felt torn many, many times and pulled in different directions. Like you, out of my own idea, I had created special outings with mama once a week (they each had their week of the month) about 4 years ago. We did it for about 6 months and stopped since it felt forced and the girls did not ask about it. However, the younger one has always been more needy and was wanting constant attention from me, to the point where I could not have a conversation with an adult if she was not busy with someone who was giving her attention. <br/>\n<br/>\nThings changed when we stayed in Costa Rica last winter and our life rhythm changed. We were there for 5 months and I was more available than ever. I spent a lot of time in the hammock reading with one of them. The thing is I was lying there and they would come and join whenever they felt the need, instead of asking for me to be with them... <br/>\n<br/>\nI think that it is something they grow out of once tYheir cup is filled and I can see that we are going in that direction. Your children are a bit younger than mine, so yes, do more outings and social activities with them, it sure makes things easier, lay on the floor with all of them when you feel pulled in all directions and just giggles and laugh with them. Read and re-read Playful Parenting and trust that it will be easier.<br/>\n<br/>\nHugs,<br/>\n<br/>\nCatherine<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":504505579,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: spending time, sons anger & finding balance","postDate":"1340408506","msgId":67870,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBT09UYVhQWStaSlVhdEFRYWdjQjcwPWZpbk84VFo5M0EwOE1BcTJHNXlPZW9QeGpHUUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDc3NUI4NTQyLTBFMDYtNDJBRi05NjM2LTJEOUY0MkMzMUYxMEBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGpzMm10byt0aHI4QGVHcm91cHMuY29tPgk8Nzc1Qjg1NDItMEUwNi00MkFGLTk2MzYtMkQ5RjQyQzMxRjEwQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":67861,"nextInTopic":67903,"prevInTime":67869,"nextInTime":67871,"topicId":67778,"numMessagesInTopic":0,"msgSnippet":"... And of formalizing things that would be better kept casual and natural and flexible. It might take a while for these little kids to forget that mommy was ","messageBody":"<div id=\"ygrps-yiv-1052134965\">On Fri, Jun 22, 2012 at 2:33 PM, Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Many parents make the mistake of talking to their children about what they<br/>\n&gt; (the mom) intend to do, and how they&#39;re doing it, and asking the children<br/>\n&gt; how it might be done differently. It&#39;s too much talk, too much<br/>\n&gt; responsibility on the kids, and too much focus on something negative.&gt;&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>And of formalizing things that would be better kept casual and natural and<br/>\nflexible.<br/>\n<br/>\nIt might take a while for these little kids to forget that mommy was<br/>\nrationing her time (&quot;doing time&quot;). Life with three little kids is very<br/>\ndemanding and often doesn&#39;t feel like it is going smoothly while it is<br/>\nhappening. Moms often feel torn. Try to be more accepting of the reality<br/>\nthat you will feel torn - take it as a natural part of life and don&#39;t<br/>\nstress over it. Handle it with a sense of ease and the kids will pick up on<br/>\nthat, too, eventually. You might need to fake it for a while - fake that<br/>\nyou&#39;re not stressed by it. Keep your voice light and easygoing and relax<br/>\nyour body on purpose - breathe full breaths, not short little panting ones.<br/>\nLook RIGHT into your children&#39;s eyes - we tend to look away when we feel<br/>\noverwhelmed. Touch them - just a light touch on the head or back or arm -<br/>\nwhile you calmly and happily say, &quot;I&#39;ll be with you in, oh, probably about<br/>\n5 minutes.&quot; When the child objects and is becoming upset - the best thing<br/>\nyou can do for him is to NOT become tense and upset, but stay calm and say<br/>\nsomething like, &quot;Hang in there, you can do it.&quot;<br/>\n<br/>\nYou be the calm centered person in the group so that the frazzled fussy<br/>\nkids take their cue from you. It won&#39;t happen right away. But at least in<br/>\nthe meantime YOU are practicing calmness and centeredness under difficult<br/>\ncircumstances and that will only be good for you. While you&#39;re practicing,<br/>\nyou&#39;ll lose it and suddenly realize you&#39;re all anxious and stressed. As<br/>\nsoon as you recognize it, that&#39;s the moment when you breathe really deep,<br/>\nput a smile on your face, look deeply into a child&#39;s eyes, give a child a<br/>\nvery gentle touch.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: spending time, sons anger & finding balance","postDate":"1340400819","msgId":67861,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc3NUI4NTQyLTBFMDYtNDJBRi05NjM2LTJEOUY0MkMzMUYxMEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGpzMm10byt0aHI4QGVHcm91cHMuY29tPg==","referencesHeader":"PGpzMm10byt0aHI4QGVHcm91cHMuY29tPg=="},"prevInTopic":67860,"nextInTopic":67870,"prevInTime":67860,"nextInTime":67862,"topicId":67778,"numMessagesInTopic":0,"msgSnippet":"-=-I m curious--when you talk to them about this challenge in your family, what words do you use and what do they say in response? -=- No one needs to answer","messageBody":"<div id=\"ygrps-yiv-1336412356\">-=-I&#39;m curious--when you talk to them about this challenge in your family, what words do you use and what do they say in response? -=-<br/>\n<br/>\nNo one needs to answer questions like these in this discussion, and there are times when it&#39;s not helpful to even ask.<br/>\n<br/>\nMany parents make the mistake of talking to their children about what they (the mom) intend to do, and how they&#39;re doing it, and asking the children how it might be done differently.   It&#39;s too much talk, too much responsibility on the kids, and too much focus on something negative.<br/>\n<br/>\nIt&#39;s more useful for the mom to find happier, less invasive and less ponderous decisions and to live lightly and happily.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":177967425,"authorName":"teresa","from":"&quot;teresa&quot; &lt;treesock@...&gt;","profile":"treesock","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: spending time, sons anger & finding balance","postDate":"1340399352","msgId":67860,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpzMm10byt0aHI4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpydmRxays3ZzY4QGVHcm91cHMuY29tPg=="},"prevInTopic":67851,"nextInTopic":67861,"prevInTime":67859,"nextInTime":67861,"topicId":67778,"numMessagesInTopic":0,"msgSnippet":"It has helped in my family of two very active little boys who like lots of mama-attention to have frequent whole-family, out-of-the-house activities to do. On","messageBody":"<div id=\"ygrps-yiv-155637108\">It has helped in my family of two very active little boys who like lots of mama-attention to have frequent whole-family, out-of-the-house activities to do. On outings, they are less likely to fight for my attention. It&#39;s clear to them that we are doing the museum/park/hike/grocery shopping/library trip together. It&#39;s even better if I guess ahead of time what the &quot;dividers&quot; are going to be. At the museum, I&#39;ll ask them to each pick their favorite spot and we&#39;ll make sure to spend plenty of time there.  At the grocery store, they both get to pick out a box of granola bars or Ben & Jerry&#39;s flavor. At the park, it&#39;s easy for me to get right in the middle of the the playground and be part of the action. The library&#39;s a bit tougher--books take longer to read, so sometimes one or the other will get a little fussy while I&#39;m reading the book that they did not pick out, but sometimes I can placate the unhappy one by suggesting he look for an extra book or two to read at home at bedtime when I know my husband and I will be able to split them up and give them some &quot;one on one&quot; time, if that&#39;s what they still want (which often, they don&#39;t by then!). <br/>\n<br/>\nAnd I second the idea that having lots and lots of other kids around helps. I have yet to be at a play day where both boys have fought over my attention. <br/>\n<br/>\nI&#39;d say four days out of five per week, we&#39;re out doing something, even if it&#39;s a two-hour run around the park. And sometimes, when the squabbling gets bad, that&#39;s when I know it&#39;s time for such an outing.  <br/>\n<br/>\nI&#39;m curious--when you talk to them about this challenge in your family, what words do you use and what do they say in response? <br/>\n<br/>\nTeresa<br/>\nmama to Woody, 6 1/2, and Fox, 3 1/2<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;marlo_blake&quot; &lt;beingfree4meand3@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; I have a long existing concern again.  My children are 7 1/2 (twins) & 5yo.  It was suggested to me about 3 yrs back to start doing one on one time with my children because they were fighting all the time, unhappy, and they really needed to do things with me &quot;alone&quot; (because &quot;no one feels loved in a group&quot;)- which in my case, in a different part of the house or room, and that the other children couldn&#39;t talk to me when I was with another child or time would be added onto the person&#39;s time with me.  <br/>\n&gt; <br/>\n&gt; Although we did it for years, it was usually stressful.  They started fighting over how much time each one had, and they fought over who&#39;s turn it was.  Sometimes we didn&#39;t get everyone&#39;s time in for the day, and there was anger about that also.  If I was talking or sitting with one of them, someone would ask if I was doing &quot;time&quot; with that person.  It became a huge struggle & competitive thing.<br/>\n&gt; <br/>\n&gt; I stopped doing one on one over the past 4-5 months, but they seem to want me to do it again.  They will say, &quot;I want to do time&quot; - because that&#39;s what we called it &quot;time.&quot;  However, what I&#39;m trying to do instead (upon learning from this group) is to Really spend time with them Together by being present (as best I can be) & interested in the things they do.  I watch shows with them, I try to get involved or watch as they play, I help them when they ask me for it when they are making projects or building something.  I&#39;ve come up with some fun things to do (again, with the great help of this group) (and I will also say that I&#39;m not physically or mentally there all the time, and I find myself going on auto at times, and I&#39;m really working on it).  <br/>\n&gt; <br/>\n&gt; Here&#39;s what&#39;s Very hard for me.  They usually want me to do something with them at the same time - but separate activities.  We usually start out watching the computer tv (DVDs or Youtube), and then my youngest will invite me to play which I do.  There is a lot of interruption during that play as I am getting food for the other two or going with someone to the bathroom or whatever the reason may be.  But somehow it usually goes downhill from there because there is that competition thing again for my attention.  The youngest will pull me away from the other two or vise-versa.  An example:  yesterday, I invited my son (twin) to jump/play games on the trampoline with me because the other two were doing something, & he accepted and my youngest daughter came along too - great!  Well, my oldest daughter (twin), who had been watching a DVD, came out screaming that she wanted someone to be in the house with her while she watched - I did inform (& invited) her about what we were doing.  I responded that I could do that when we were done here.  She began to scream & cry that all day I was doing more with them and was doing nothing with her.  Her sharp screams almost sent me in the wrong direction, but I breathed deep, and carried her outside because at that point my son was calling for me.  She started pulling me toward the house, so I picked her up (kind of a bit firm because I almost lost it again, but then I caught myself), and I listened to her as best I could because then my son had reached his point & was screaming for me  to come & jump.  She kept asking me why I don&#39;t do anything with her.  I didn&#39;t know what to say (because in my mind I do), so I said that I would work on changing the situation so that she knows I&#39;m spending time with her also (obviously I haven&#39;t figured that out yet - that&#39;s why I&#39;m here).  While this was going on (we were next to the trampoline) my son was becoming impatient, and so he did a flip as usual, but he flipped right onto my youngest who was right in front of him.  At that point, I said Very Firmly, &quot;Get off Now!  Get Off!!  If we can&#39;t jump safely on this thing then we can&#39;t be on it!&quot;  (which I know was a traditional &quot;solution&quot;).  Tears everywhere by then, because at this point I was loosing it.  We went into the house, and by then I calmed down & we began to talk about safety while being on the trampoline.  {By the way, the trampoline is new for us - it was given to us about 2 wks ago (netting included), and when they are on their aunt&#39;s trampoline, no one usually gets hurt because usually it&#39;s the twins on it alone with their uncle while my sister is with my youngest.  I don&#39;t have the option of another person being here with me Most of the day.}  Then my oldest daughter asked me to watch with her, so I did, and then it started up again, where then my son asked me to watch a movie with him on the other tv.  So once again, I was going back & forth & no one was happy.<br/>\n&gt; <br/>\n&gt; This is ongoing.  They won&#39;t be in the house/room alone (maybe that&#39;s normal), and they won&#39;t go to the bathroom alone, they don&#39;t want to do most things alone; I tend to them, and the person that I&#39;m with gets mad.<br/>\n&gt; <br/>\n&gt; It seems like no matter what I do someone is not happy because they think I&#39;m spending more time with someone (or two) else, and I feel like I&#39;m being pulled to Choose who I&#39;m going to spend time with next.  I don&#39;t know where to find the balance.<br/>\n&gt; <br/>\n&gt; Another concern that stems from this is my son is becoming increasingly aggressive toward his little sister too because of his thoughts that I spend more time with her. He jumps on her, breaks her (their) things, throws things at her when she says no to him, and he always says he didn&#39;t see her (even though she&#39;s right there) or he &quot;didn&#39;t know&quot;, etc.  He is a very high energy little boy, and when he wants to do something to get his energy out - run, wrestle, whatever, the girls will interrupt us (because they want help with something), and then he ends up waiting until that time has past for him, and then I feel bad because he&#39;s mad.  He has all this energy, and no where to let it out! (except to hurt someone).  I help him as much as I can, but then the girls want to join, which then kinda fizzles it for him.  I want to include everyone, but someone doesn&#39;t always want others to join & I don&#39;t want it to be like &quot;time&quot; was before, so again, there is no balance.  Or, at times, I&#39;m too tired, or my lower back starts to hurt where I can&#39;t, and my husband isn&#39;t here enough or is too tired himself, and I don&#39;t know of any boys who will play rough the way he likes.  I feel badly for my son because he has never really been given the play he so desires because I (and his dad) was never Really there for him (them).   <br/>\n&gt; <br/>\n&gt; I&#39;m sorry this is so long winded, but these two concerns do seem connected to me.<br/>\n&gt; <br/>\n&gt; I&#39;m looking for a way to help them all including my son&#39;s needs/aggression, so I am Very open to suggestions.  Although I&#39;m nervous about sending this, I want change within myself, so I&#39;m ready to hear what others have to say.<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] spending time, sons anger & finding balance","postDate":"1340394049","msgId":67851,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEEyRkNEMDFCLTlCNzAtNDZBRS05N0RBLUZGM0VEQjhCODMwQ0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGpzMjN0MitxNXJ2QGVHcm91cHMuY29tPg==","referencesHeader":"PGpzMjN0MitxNXJ2QGVHcm91cHMuY29tPg=="},"prevInTopic":67818,"nextInTopic":67860,"prevInTime":67850,"nextInTime":67852,"topicId":67778,"numMessagesInTopic":0,"msgSnippet":"... Better is better. The problem, I d say, is in looking for *a* solution to a problem. It s like grabbing something to stuff into a hole then looking to the","messageBody":"<div id=\"ygrps-yiv-953368798\">On Jun 22, 2012, at 11:44 AM, marlo_blake wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; What if someone is in a bad situation/time what-have-you, and what they find is better<br/>\n<br/>\n </span></blockquote>Better is better.<br/>\n<br/>\nThe problem, I&#39;d say, is in looking for *a* solution to a problem. It&#39;s like grabbing something to stuff into a hole then looking to the next without looking at the hole and other holes and what might be causing the holes and what else could be used as a plug. And keep going as things get better and better.<br/>\n<br/>\nBeing comfortable can keep people from changing. And so can being less uncomfortable. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; What if they Believe what they are doing is right -<br/>\n<br/>\n </span></blockquote>Beliefs should match reality. (Unless you&#39;re someone who needs religion.)<br/>\n<br/>\nBelieving something is working isn&#39;t the same as working.<br/>\n<br/>\nThere&#39;s also fear involved. There&#39;s the fear that this isn&#39;t perfect but something else might be worse so it&#39;s less scary to stick with what was better than before.<br/>\n<br/>\nIt takes a willingness to try things. Where the list can help is to check over ideas for inherent pitfalls that will make situations worse. So you don&#39;t need to try out every idea that pops in your head. You can give some a trial run no the list to see the pulled apart and their innards examined to see how their working.<br/>\n<br/>\nThe more you see ideas pulled apart, the better you&#39;ll get at doing it yourself.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; what if it takes a LOT of discomfort for change because things appear &quot;fine&quot; on the surface? Or that they don&#39;t know where to turn to?<br/>\n<br/>\n </span></blockquote>Often it *does* take a lot of discomfort. People don&#39;t do something really hard to fix a little discomfort!<br/>\n<br/>\nThe rest of what you wrote is about convincing yourself not to try because you fear making things worse. No one here can help you do that. You need to want to change and then seek out help.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I Now know it was bad advice; *I* am responsible for taking it.<br/>\n<br/>\n </span></blockquote>Don&#39;t beat yourself up over it. The learning is in recognizing when things aren&#39;t working and figuring out (on your own or by asking) why. There&#39;s less learning in doing what someone said and having it work. (Though it can make things loads easier.)<br/>\n<br/>\nI suspect the advice sounded like it made sense. Where you went wrong was in looking more at the advice than at the effect it was having. The effect was feedback on whether it was working. You were a drift at sea, clinging to a rotten piece of wood with rusty nails in it because it was better than the nothing you had before. And you were determined to cling and not look around for fear of losing that piece of wood.<br/>\n<br/>\nYou have to be willing to have life be a bit chaotic as you try other things.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I don&#39;t want to be one of those bothersome moms & not be in &quot;good&quot; standing with the board/group.<br/>\n<br/>\n </span></blockquote>Even better is being in good standing with your kids. They&#39;re the ones whose opinion on how well you&#39;re doing counts.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":523283422,"authorName":"marlo_blake","from":"&quot;marlo_blake&quot; &lt;beingfree4meand3@...&gt;","profile":"marlo_blake","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: spending time, sons anger & finding balance","postDate":"1340379874","msgId":67818,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpzMjN0MitxNXJ2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQyMUQxNkEzLTJFMzYtNEYyQi1BMzUyLTY4RUE0MjFEQkQ4RkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":67791,"nextInTopic":67851,"prevInTime":67817,"nextInTime":67819,"topicId":67778,"numMessagesInTopic":0,"msgSnippet":"***Yes, but what s happened here is the car was taken to a different shop, bad advice was given **AND TAKEN,** perhaps not as it was intended, FOR YEARS!?","messageBody":"<div id=\"ygrps-yiv-1331549102\">***Yes, but what&#39;s happened here is the car was taken to a different shop, bad advice was given **AND TAKEN,** perhaps not as it was intended, FOR YEARS!?   And then the car was brought here, with a complaint that the previous repair had made things worse.***<br/>\n<br/>\n***This is important for everyone:  Do not do what you don&#39;t understand.<br/>\n<br/>\n*** If you get bad advice, and it seems bad, don&#39;t take it!<br/>\n <br/>\n***If you get a bad suggestion, and it doesn&#39;t seem to be helping, don&#39;t do it!***<br/>\n<br/>\nYes, but what if you don&#39;t know it&#39;s bad advice?  What if someone is in a bad situation/time what-have-you, and what they find is better - even though they are not completely happy, it is a &quot;better&quot; place (so they Think at the time) than what they were in, but they don&#39;t realize it was not good until it&#39;s &quot;too&quot; late or past the fact?  Even when they understand it, and it Seems to make sense at the time?<br/>\n<br/>\nWhat if they Believe what they are doing is right - what if it takes a LOT of discomfort for change because things appear &quot;fine&quot; on the surface?  Or that they don&#39;t know where to turn to?    <br/>\n<br/>\n***And then the car was brought here, with a complaint that the previous repair had made things worse.***<br/>\n<br/>\nI don&#39;t mean to complain about the &quot;previous repair.&quot;  I Now know it was bad advice; *I* am responsible for taking it.  I&#39;m here to learn/grow more, and I don&#39;t want to be one of those bothersome moms & not be in &quot;good&quot; standing with the board/group.<br/>\n<br/>\nIn another recent post, I gave examples of advice *I* believed also, not to complain, but to show living life in fear of what &quot;experts&quot; say.  Again, if it wasn&#39;t appropriate to say those things, I understand.</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: spending time, sons anger & finding balance","postDate":"1340318565","msgId":67791,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpzMDgxNStnaXVtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpydmRxays3ZzY4QGVHcm91cHMuY29tPg=="},"prevInTopic":67788,"nextInTopic":67818,"prevInTime":67790,"nextInTime":67792,"topicId":67778,"numMessagesInTopic":0,"msgSnippet":"... It s a good idea to expect a long term issue to take a while to resolve. Go slowly and take small steps. Aim for better in little increments rather than","messageBody":"<div id=\"ygrps-yiv-1112944906\">&quot;marlo_blake&quot; &lt;beingfree4meand3@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I have a long existing concern again.<br/>\n<br/>\n </span></blockquote>It&#39;s a good idea to expect a long term issue to take a while to resolve. Go slowly and take small steps. Aim for &quot;better&quot; in little increments rather than overnight perfection. <br/>\n<br/>\nIt takes some conscious attention to do that! It&#39;s easy to focus on every little blip as evidence of failure, but it&#39;s really important to notice what&#39;s working and when. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Here&#39;s what&#39;s Very hard for me.  They usually want me to do something with them at the same time - but separate activities.<br/>\n </span></blockquote>**************<br/>\n<br/>\nHow often do they have friends over, or go off to play with friends? From your description, you&#39;re the only person in their whole world - is that the case? Or are the problems only happening when there&#39;s no-one else around? It may help in a number of ways to arrange for them to play with other kids, teens, and adults on a regular basis. This is especially important with your... eldest son? Is that the one who&#39;s very high energy? He needs people bigger and stronger than he is to play with on a regular basis.  <br/>\n<br/>\nHow often do you get out and do you have the same issues? It may be that you all need to get out more! My very introverted daughter goes through phases where she&#39;s happier if we go out every day, even if only to run an errand. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It seems like no matter what I do someone is not happy<br/>\n<br/>\n </span></blockquote>You&#39;ve gotten into a pretty deep hole. Honestly, I&#39;d look for a way to shake everything up - maybe in a really big way, like summer camp, or sending them to visit relatives - maybe different camps or relatives so one or two are gone at a time. It might even be better to send them to school in the fall rather than trying to dig your way out from where you are. If you can&#39;t find ways for the kids to play with other people regularly - play dates and groups and coops and clubs and classes - it may be that you don&#39;t have the resources you need to homeschool three kids who need a lot of attention. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] spending time, sons anger & finding balance","postDate":"1340309638","msgId":67788,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCMjc1RDY0LTU5NTUtNEUxMS04MkE5LUEwMkFBNDdGNTVGN0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEE0NUE2MjZFLTJDQUMtNEU4OC04NkY2LTlFNzEwMDMwOTY3NEB2ZXJpem9uLm5ldD4=","referencesHeader":"PGpydmRxays3ZzY4QGVHcm91cHMuY29tPiA8QTQ1QTYyNkUtMkNBQy00RTg4LTg2RjYtOUU3MTAwMzA5Njc0QHZlcml6b24ubmV0Pg=="},"prevInTopic":67787,"nextInTopic":67791,"prevInTime":67787,"nextInTime":67789,"topicId":67778,"numMessagesInTopic":0,"msgSnippet":"-=- He is a very high energy little boy, and when he wants to do something to get his energy out -=-Do you have some equipment he can use without help? Like a","messageBody":"<div id=\"ygrps-yiv-14976661\">-=-&gt; He is a very high energy little boy, and when he wants to do something to get his energy out <br/>\n<br/>\n-=-Do you have some equipment he can use without help? Like a mini-trampoline. (If you search the archives for &quot;mini trampoline&quot; that may turn up ideas others have suggested in the past.)-=-<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/physicality\">http://sandradodd.com/physicality</a><br/>\nhas three new lists up top, and the original ideas below.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] spending time, sons anger & finding balance","postDate":"1340309568","msgId":67787,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyMUQxNkEzLTJFMzYtNEYyQi1BMzUyLTY4RUE0MjFEQkQ4RkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEE0NUE2MjZFLTJDQUMtNEU4OC04NkY2LTlFNzEwMDMwOTY3NEB2ZXJpem9uLm5ldD4=","referencesHeader":"PGpydmRxays3ZzY4QGVHcm91cHMuY29tPiA8QTQ1QTYyNkUtMkNBQy00RTg4LTg2RjYtOUU3MTAwMzA5Njc0QHZlcml6b24ubmV0Pg=="},"prevInTopic":67785,"nextInTopic":67788,"prevInTime":67786,"nextInTime":67788,"topicId":67778,"numMessagesInTopic":0,"msgSnippet":"-=-If someone s finding something stressful for more than a few weeks -- change obviously is stressful -- come back and let the list look at it. Sort of like","messageBody":"<div id=\"ygrps-yiv-1070674957\">-=-If someone&#39;s finding something stressful for more than a few weeks -- change obviously is stressful -- come back and let the list look at it. Sort of like fixing a car. If it&#39;s still making that noise, bring it back to the shop!-=-<br/>\n<br/>\nYes, but what&#39;s happened here is the car was taken to a different shop, bad advice was given **AND TAKEN,** perhaps not as it was intended, FOR YEARS!?   And then the car was brought here, with a complaint that the previous repair had made things worse.   <br/>\n<br/>\nThis is important for everyone:  Do not do what you don&#39;t understand.<br/>\n<br/>\nIf you get bad advice, and it seems bad, don&#39;t take it!<br/>\n<br/>\nIf you get a bad suggestion, and it doesn&#39;t seem to be helping, don&#39;t do it!<br/>\n<br/>\nRead a little, try a little, wait a while, watch.  If you&#39;re going the wrong direction, don&#39;t keep going.<br/>\n<br/>\nSanra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] spending time, sons anger & finding balance","postDate":"1340302751","msgId":67783,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE0NUE2MjZFLTJDQUMtNEU4OC04NkY2LTlFNzEwMDMwOTY3NEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGpydmRxays3ZzY4QGVHcm91cHMuY29tPg==","referencesHeader":"PGpydmRxays3ZzY4QGVHcm91cHMuY29tPg=="},"prevInTopic":67780,"nextInTopic":67785,"prevInTime":67782,"nextInTime":67784,"topicId":67778,"numMessagesInTopic":0,"msgSnippet":"... I kind of wish you had come back sooner. I can see that working as well as it has. One on one time would be taking one child off while the others are","messageBody":"<div id=\"ygrps-yiv-1183128141\">On Jun 21, 2012, at 11:15 AM, marlo_blake wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It was suggested to me about 3 yrs back to start doing one on one time with my children ...<br/>\n&gt; which in my case, in a different part of the house or room, and that the other children<br/>\n&gt; couldn&#39;t talk to me when I was with another child or time would be added onto the person&#39;s time with me<br/>\n<br/>\n </span></blockquote>I kind of wish you had come back sooner. I can see that working as well as it has.<br/>\n<br/>\nOne on one time would be taking one child off while the others are happily engaged with something else. It could be going to the grocery store with one child when the others want to stay home. It can be one parent taking two kids the other parent taking one.<br/>\n<br/>\nYou set up a group of two that you prevented the rest from joining.<br/>\n<br/>\nTry to meet a child&#39;s (and your own) needs without taking from someone else.<br/>\n<br/>\nAlthough we did it for years, it was usually stressful<br/>\n<br/>\nIf someone&#39;s finding something stressful for more than a few weeks -- change obviously is stressful -- come back and let the list look at it. Sort of like fixing a car. If it&#39;s still making that noise, bring it back to the shop!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  there is that competition thing again for my attention.<br/>\n<br/>\n<br/>\n </span></blockquote>I hope others will come along who had several kids who can give you some advice.<br/>\n<br/>\nBut I suspect it&#39;s not as bad as it would naturally be if you hadn&#39;t set up the &quot;time&quot; practice. What I&#39;m saying is that if you do spend quality time with them one on one *without* the others feeling deprived, that some of this will fade. It will be hard at first since they feel so deprived but they will eventually come to trust that there will be time to spend with you. And they will also get older so they will need less time with you.<br/>\n<br/>\nHave you read &quot;Siblings Without Rivalry&quot;? That might help you see where you may be unintentionally creating some of the competition with how you&#39;re interacting with them.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://amzn.to/JWGyuM\">http://amzn.to/JWGyuM</a><br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; They won&#39;t be in the house/room alone (maybe that&#39;s normal),<br/>\n&gt; and they won&#39;t go to the bathroom alone, they don&#39;t want to do most things alone<br/>\n<br/>\n </span></blockquote>Kathryn was much that way until 11ish. Having 3 like that would definitely be a challenge.<br/>\n<br/>\nI don&#39;t have any specific ideas, but it will help if you can make a mental shift from being the font of solutions to everyone&#39;s problems to drawing them into solving problems with you. Saying &quot;Everyone wants me at once!&quot; with a laugh to draw them into the process of coming up with ideas will help more than trying to get them to comply with what you&#39;ve decided to do.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; He is a very high energy little boy, and when he wants to do something to get his energy out <br/>\n<br/>\n </span></blockquote>Do you have some equipment he can use without help? Like a mini-trampoline. (If you search the archives for &quot;mini trampoline&quot; that may turn up ideas others have suggested in the past.)<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":523283422,"authorName":"marlo_blake","from":"&quot;marlo_blake&quot; &lt;beingfree4meand3@...&gt;","profile":"marlo_blake","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: spending time, sons anger & finding balance","postDate":"1340301676","msgId":67785,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpydm5oYytoYnZwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEZCNzc1ODVBLTYyNDYtNDM0Qi1BRTI5LTNENTQ3NDM5ODg3MUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":67783,"nextInTopic":67787,"prevInTime":67784,"nextInTime":67786,"topicId":67778,"numMessagesInTopic":0,"msgSnippet":"***I don t remember anyone on this list suggesting that  no one can feel loved in a group.  Please clarify whether the advice came from the Always Learning","messageBody":"<div id=\"ygrps-yiv-170872818\">***I don&#39;t remember anyone on this list suggesting that  no one can feel loved in a group.  Please clarify whether the advice came from the Always Learning list or somewhere else.***<br/>\n<br/>\n***If it&#39;s an exact quote (you used quotation marks) I hope it was not from this discussion.***<br/>\n<br/>\nSorry, No, the suggestion was Not from this group.  I will be clear on that from now on, sorry about the confusion.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; -=-I have a long existing concern again. My children are 7 1/2 (twins) & 5yo. It was suggested to me about 3 yrs back to start doing one on one time with my children because they were fighting all the time, unhappy, and they really needed to do things with me &quot;alone&quot; (because &quot;no one feels loved in a group&quot;)- which in my case, in a different part of the house or room, and that the other children couldn&#39;t talk to me when I was with another child or time would be added onto the person&#39;s time with me. -=-<br/>\n&gt; <br/>\n&gt; I don&#39;t remember anyone on this list suggesting that  no one can feel loved in a group.  Please clarify whether the advice came from the Always Learning list or somewhere else.<br/>\n&gt; <br/>\n&gt; If it&#39;s an exact quote (you used quotation marks) I hope it was not from this discussion.<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] spending time, sons anger & finding balance","postDate":"1340299877","msgId":67780,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEZCNzc1ODVBLTYyNDYtNDM0Qi1BRTI5LTNENTQ3NDM5ODg3MUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGpydmRxays3ZzY4QGVHcm91cHMuY29tPg==","referencesHeader":"PGpydmRxays3ZzY4QGVHcm91cHMuY29tPg=="},"prevInTopic":67778,"nextInTopic":67783,"prevInTime":67779,"nextInTime":67781,"topicId":67778,"numMessagesInTopic":0,"msgSnippet":"-=-I have a long existing concern again. My children are 7 1/2 (twins) & 5yo. It was suggested to me about 3 yrs back to start doing one on one time with my","messageBody":"<div id=\"ygrps-yiv-265760356\">-=-I have a long existing concern again. My children are 7 1/2 (twins) & 5yo. It was suggested to me about 3 yrs back to start doing one on one time with my children because they were fighting all the time, unhappy, and they really needed to do things with me &quot;alone&quot; (because &quot;no one feels loved in a group&quot;)- which in my case, in a different part of the house or room, and that the other children couldn&#39;t talk to me when I was with another child or time would be added onto the person&#39;s time with me. -=-<br/>\n<br/>\nI don&#39;t remember anyone on this list suggesting that  no one can feel loved in a group.  Please clarify whether the advice came from the Always Learning list or somewhere else.<br/>\n<br/>\nIf it&#39;s an exact quote (you used quotation marks) I hope it was not from this discussion.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":523283422,"authorName":"marlo_blake","from":"&quot;marlo_blake&quot; &lt;beingfree4meand3@...&gt;","profile":"marlo_blake","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"spending time, sons anger & finding balance","postDate":"1340291732","msgId":67778,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpydmRxays3ZzY4QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":67780,"prevInTime":67777,"nextInTime":67779,"topicId":67778,"numMessagesInTopic":0,"msgSnippet":"I have a long existing concern again.  My children are 7 1/2 (twins) & 5yo.  It was suggested to me about 3 yrs back to start doing one on one time with my","messageBody":"<div id=\"ygrps-yiv-2123453162\">I have a long existing concern again.  My children are 7 1/2 (twins) & 5yo.  It was suggested to me about 3 yrs back to start doing one on one time with my children because they were fighting all the time, unhappy, and they really needed to do things with me &quot;alone&quot; (because &quot;no one feels loved in a group&quot;)- which in my case, in a different part of the house or room, and that the other children couldn&#39;t talk to me when I was with another child or time would be added onto the person&#39;s time with me.  <br/>\n<br/>\nAlthough we did it for years, it was usually stressful.  They started fighting over how much time each one had, and they fought over who&#39;s turn it was.  Sometimes we didn&#39;t get everyone&#39;s time in for the day, and there was anger about that also.  If I was talking or sitting with one of them, someone would ask if I was doing &quot;time&quot; with that person.  It became a huge struggle & competitive thing.<br/>\n<br/>\nI stopped doing one on one over the past 4-5 months, but they seem to want me to do it again.  They will say, &quot;I want to do time&quot; - because that&#39;s what we called it &quot;time.&quot;  However, what I&#39;m trying to do instead (upon learning from this group) is to Really spend time with them Together by being present (as best I can be) & interested in the things they do.  I watch shows with them, I try to get involved or watch as they play, I help them when they ask me for it when they are making projects or building something.  I&#39;ve come up with some fun things to do (again, with the great help of this group) (and I will also say that I&#39;m not physically or mentally there all the time, and I find myself going on auto at times, and I&#39;m really working on it).  <br/>\n<br/>\nHere&#39;s what&#39;s Very hard for me.  They usually want me to do something with them at the same time - but separate activities.  We usually start out watching the computer tv (DVDs or Youtube), and then my youngest will invite me to play which I do.  There is a lot of interruption during that play as I am getting food for the other two or going with someone to the bathroom or whatever the reason may be.  But somehow it usually goes downhill from there because there is that competition thing again for my attention.  The youngest will pull me away from the other two or vise-versa.  An example:  yesterday, I invited my son (twin) to jump/play games on the trampoline with me because the other two were doing something, & he accepted and my youngest daughter came along too - great!  Well, my oldest daughter (twin), who had been watching a DVD, came out screaming that she wanted someone to be in the house with her while she watched - I did inform (& invited) her about what we were doing.  I responded that I could do that when we were done here.  She began to scream & cry that all day I was doing more with them and was doing nothing with her.  Her sharp screams almost sent me in the wrong direction, but I breathed deep, and carried her outside because at that point my son was calling for me.  She started pulling me toward the house, so I picked her up (kind of a bit firm because I almost lost it again, but then I caught myself), and I listened to her as best I could because then my son had reached his point & was screaming for me  to come & jump.  She kept asking me why I don&#39;t do anything with her.  I didn&#39;t know what to say (because in my mind I do), so I said that I would work on changing the situation so that she knows I&#39;m spending time with her also (obviously I haven&#39;t figured that out yet - that&#39;s why I&#39;m here).  While this was going on (we were next to the trampoline) my son was becoming impatient, and so he did a flip as usual, but he flipped right onto my youngest who was right in front of him.  At that point, I said Very Firmly, &quot;Get off Now!  Get Off!!  If we can&#39;t jump safely on this thing then we can&#39;t be on it!&quot;  (which I know was a traditional &quot;solution&quot;).  Tears everywhere by then, because at this point I was loosing it.  We went into the house, and by then I calmed down & we began to talk about safety while being on the trampoline.  {By the way, the trampoline is new for us - it was given to us about 2 wks ago (netting included), and when they are on their aunt&#39;s trampoline, no one usually gets hurt because usually it&#39;s the twins on it alone with their uncle while my sister is with my youngest.  I don&#39;t have the option of another person being here with me Most of the day.}  Then my oldest daughter asked me to watch with her, so I did, and then it started up again, where then my son asked me to watch a movie with him on the other tv.  So once again, I was going back & forth & no one was happy.<br/>\n<br/>\nThis is ongoing.  They won&#39;t be in the house/room alone (maybe that&#39;s normal), and they won&#39;t go to the bathroom alone, they don&#39;t want to do most things alone; I tend to them, and the person that I&#39;m with gets mad.<br/>\n<br/>\nIt seems like no matter what I do someone is not happy because they think I&#39;m spending more time with someone (or two) else, and I feel like I&#39;m being pulled to Choose who I&#39;m going to spend time with next.  I don&#39;t know where to find the balance.<br/>\n<br/>\nAnother concern that stems from this is my son is becoming increasingly aggressive toward his little sister too because of his thoughts that I spend more time with her. He jumps on her, breaks her (their) things, throws things at her when she says no to him, and he always says he didn&#39;t see her (even though she&#39;s right there) or he &quot;didn&#39;t know&quot;, etc.  He is a very high energy little boy, and when he wants to do something to get his energy out - run, wrestle, whatever, the girls will interrupt us (because they want help with something), and then he ends up waiting until that time has past for him, and then I feel bad because he&#39;s mad.  He has all this energy, and no where to let it out! (except to hurt someone).  I help him as much as I can, but then the girls want to join, which then kinda fizzles it for him.  I want to include everyone, but someone doesn&#39;t always want others to join & I don&#39;t want it to be like &quot;time&quot; was before, so again, there is no balance.  Or, at times, I&#39;m too tired, or my lower back starts to hurt where I can&#39;t, and my husband isn&#39;t here enough or is too tired himself, and I don&#39;t know of any boys who will play rough the way he likes.  I feel badly for my son because he has never really been given the play he so desires because I (and his dad) was never Really there for him (them).   <br/>\n<br/>\nI&#39;m sorry this is so long winded, but these two concerns do seem connected to me.<br/>\n<br/>\nI&#39;m looking for a way to help them all including my son&#39;s needs/aggression, so I am Very open to suggestions.  Although I&#39;m nervous about sending this, I want change within myself, so I&#39;m ready to hear what others have to say.</div>","specialLinks":[]}],"prevTopicId":68047,"nextTopicId":68090}}