{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":37,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Bedrooms","postDate":"1086627420","msgId":95335,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFkYS4yMzZhNTI4My4yZGY1Zjg1Y0Bhb2wuY29tPg=="},"prevInTopic":95320,"nextInTopic":95338,"prevInTime":95334,"nextInTime":95336,"topicId":27787,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/7/04 7:25:02 AM, tri_mom@comcast.net writes: ","messageBody":"<div id=\"ygrps-yiv-571506871\">In a message dated 6/7/04 7:25:02 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:tri_mom@...\">tri_mom@...</a> writes:<br/>\n<br/>\n&lt;&lt; IMHO, since you are going to reap any financial benefit out of it, <br/>\n<br/>\nkeeping up the home is your responsibility. You can do that <br/>\n<br/>\ngrudgingly and angrily about all that gets worn in the home, or you <br/>\n<br/>\ncan keep it up as best you can with all that you&#39;ve got going, and do <br/>\n<br/>\nit cheerfully &gt;&gt;<br/>\n<br/>\nDamage to the house is easier to repair than damage to the kids, if a parent <br/>\ncan only think of those two options.<br/>\n<br/>\nWe have a hole in the wall where Kirby kicked it, when he was 13 or so.  A <br/>\nfriend&#39;s mother was dying of cancer, he knew.  He was out of town for a few <br/>\ndays, and a couple of weeks after he got back he found out she had died and he had <br/>\nmissed the funeral.  They hadn&#39;t called him specifically.  If he had been at <br/>\nthe gaming shop he would&#39;ve heard.  He really liked that lady.  Her name was <br/>\nZandra.  He liked her kids, and after she died they moved away.  He was <br/>\nrightfully frustrated.  The hole can&#39;t be fixed easily, because there&#39;s a sliding <br/>\ndoor behind it.  It&#39;s a memorial to Zandra, and it reminds the kids not to kick <br/>\nthe walls.<br/>\n<br/>\n-=- suggestions for <br/>\n<br/>\ngetting rid of what she calls &quot;stinkin&#39; thinkin&#39; &quot; which is <br/>\n<br/>\nhousecleaning martyrdom.-=-<br/>\n<br/>\nIt&#39;s an AA term too.<br/>\n<br/>\nEven if I DID force-march my kids through the house making them mop and dust <br/>\nand sort and polish, we wouldn&#39;t have a house that looks like a showhouse.  <br/>\nIt&#39;s not that kind of house.  We have STUFF.  COOL stuff.<br/>\n<br/>\nAnd what would happen is I would have a slightly cleaner house o&#39;stuff, and <br/>\nmy kids would be profoundly unhappy.  And I bet I&#39;d be unhappy too, because I <br/>\nwould have to decide they were lazy and uncooperative and wasting my time <br/>\nmaking me march them around every day.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":7527178,"authorName":"CelticFrau@aol.com","from":"CelticFrau@...","profile":"celticfrau","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Bedrooms","postDate":"1086615572","msgId":95320,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhlLmNkNmMyNGIuMmRmNWNhMTRAYW9sLmNvbT4="},"prevInTopic":95318,"nextInTopic":95335,"prevInTime":95319,"nextInTime":95321,"topicId":27787,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/7/2004 9:24:58 AM Eastern Standard Time, ... Think of this...what are you comparing it to?  The house you grew up in?  The house of a","messageBody":"<div id=\"ygrps-yiv-1819860723\">In a message dated 6/7/2004 9:24:58 AM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:tri_mom@...\">tri_mom@...</a> writes:<br/>\n<blockquote><span title=\"ireply\"> &gt;It makes me ill when I think that our upstairs is only 5 years &lt;&lt;<br/>\n&gt; old, and it looks at least 10 years old. &lt;&lt;<br/>\n </span></blockquote>Think of this...what are you comparing it to?  The house you grew up in?  The <br/>\nhouse of a friend (that only has 2 children)?<br/>\n<br/>\nSooooooo much can happen in 5 years.  We&#39;ve only lived in our home for 5 <br/>\nyears, and the whole thing looks like it needs repainting.  5 years is a long time <br/>\nwith that many people living in the home (we have 10 people in our house, <br/>\nplus 2 cats and a dog.)  We&#39;ve had holes in walls, paint pulled off with tape, <br/>\nHUNDREDS of nail/tack holes, a gazillion scuff marks.  Not to mention the inside <br/>\nof our home is half done.  We have huge holes ripped in the linoleum where we <br/>\nmoved a table that didn&#39;t have little plastic thingies on the bottom of the <br/>\nlegs.  The banister is so rickety on the stairs now, from kids swinging around <br/>\nit, we&#39;ll probably be replacing it soon.  We&#39;ve replaced the guts of our <br/>\ntoilet (mechanical stuff) probably 5 times (a lot of flushing in a family of 10) <br/>\nand we&#39;ve went through 2 used washers, 2 used dryers, and recently bit the <br/>\nbullet and bought an expensive front loading model just so we could do larger loads!<br/>\n<br/>\nNot trying to minimize your frustration (OK, maybe I am) but don&#39;t feel so <br/>\nbad!  It&#39;s normal.  Throw a few rugs down, go over stuff once in a while with a <br/>\nbottle of 409, and spend more time with your family and reading good books.<br/>\n<br/>\nNancy B. <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":153142310,"authorName":"the_clevengers","from":"&quot;the_clevengers&quot; &lt;tri_mom@...&gt;","profile":"the_clevengers","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Bedrooms","postDate":"1086614520","msgId":95318,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNhMXE1byttdjN1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGM5c2RobytoZHM3QGVHcm91cHMuY29tPg=="},"prevInTopic":95279,"nextInTopic":95320,"prevInTime":95317,"nextInTime":95319,"topicId":27787,"numMessagesInTopic":0,"msgSnippet":"... our ... Here, it s everyone s house. Yes, we (the adults are paying for it) but we re doing so for our family. We wouldn t own this big of a house if we","messageBody":"<div id=\"ygrps-yiv-1442481507\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, &quot;Tina&quot; &lt;zoocrew@w...&gt; <br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; What I don&#39;t understand is how it&#39;s wrong to require things from <br/>\n </span></blockquote>our <br/>\n<blockquote><span title=\"ireply\"> &gt; children especially when it&#39;s OUR house.  <br/>\n<br/>\n </span></blockquote>Here, it&#39;s everyone&#39;s house. Yes, we (the adults are paying for it) <br/>\nbut we&#39;re doing so for our family. We wouldn&#39;t own this big of a <br/>\nhouse if we didn&#39;t have kids, and I&#39;m assuming that with 7 kids you <br/>\nwouldn&#39;t either. We bought our house for our family and it&#39;s our <br/>\nfamily&#39;s house. Just changing to thinking and speaking of it that way <br/>\nmight help a lot.<br/>\n<br/>\nOne of Pat&#39;s biggest <br/>\n<blockquote><span title=\"ireply\"> &gt; frustrations with our children is their lack of regard for our <br/>\n </span></blockquote>home.  <br/>\n<br/>\nIs there something specific?  With that many people in a home, wear <br/>\nand tear is just going to happen. We had a family of four share our <br/>\nhome last month for several weeks and I was amazed at just how much <br/>\ndifference it made going from 4 to 8 people, just the amount of dirt <br/>\nthat gets tracked in, dishes that have to be done, etc. etc. You have <br/>\na lot of people living in your house and it will definitely show up <br/>\nin wear over a family who has just two kids. Heck, even our dog makes <br/>\na signifigant difference. If they&#39;re doing something specific - <br/>\njumping on an antique couch that belonged to your great-grandmother <br/>\nfor instance, maybe find a good substitute. We have our king-sized <br/>\nbed in the master bedroom just sitting on the ground, no bed frame. <br/>\nThat makes it an excellent jumping platform. Our couch, OTOH, is one <br/>\nof those hideous futon things (never again) so it has no springs, <br/>\nonly a wood frame. If a kid (ours or someone else&#39;s) starts jumping <br/>\non it, we just redirect them to the bed. That way we don&#39;t have a kid <br/>\nbreaking their leg going through the wood slats of the couch, and we <br/>\nhave a bunch of happy kids bouncing on the bed. Another option would <br/>\nbe to buy a big trampoline or something. When I was growing up, it <br/>\nwas popular to have a &quot;rumpus room&quot; in the basement that was sparsely <br/>\nfurnished with ratty stuff and was basically just a kid hangout.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; When we don&#39;t require them to care for things, they get ruined.  <br/>\n<br/>\n </span></blockquote>Well, obviously some things require good care. For instance, my kids <br/>\nknow not to pick up my violin without utmost care, or bang on the <br/>\npiano keys hard enough to break them, or mess with the one piece of <br/>\nantique furniture that&#39;s from my grandparents, etc. But most stuff <br/>\ncan be pretty indestructible, and if all the furniture is too fussy <br/>\nor breakable, it might be time to put it up and buy some cheap <br/>\ndurable stuff for a few more years. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;It makes me ill when I think that our upstairs is only 5 years <br/>\n&gt; old, and it looks at least 10 years old.  <br/>\n<br/>\n </span></blockquote>Making you ill is a pretty strong term. IMHO, you can&#39;t expect 7 kids <br/>\nto live somewhere and leave it looking like another family&#39;s house <br/>\nthat has two kids - you&#39;ve got more than 3 times as many feet <br/>\ncrossing the carpet, brushing against walls, scraping cabinets, etc. <br/>\nAlso, it depends on what kinds of kids you have. Some are more rough-<br/>\nand-tumble than others. Fortunately, when the kids move out, most of <br/>\nthe wear and tear can be fixed with sanding, painting, maybe some new <br/>\ncarpet. That&#39;s why apartments always charge you a deposit - they know <br/>\nthat this stuff is just necessary. Maybe you should start putting <br/>\naside a repainting and recarpeting deposit of your own. Would knowing <br/>\nthat you have money set aside to redo the stuff that gets worn help <br/>\nyou feel better about it?? Might be a good idea.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Why is it wrong to expect <br/>\n&gt; your children to care for your things?  As their parent I don&#39;t <br/>\n&gt; mistreat their possessions.  At last check our homes are probably <br/>\n </span></blockquote>our <br/>\n<blockquote><span title=\"ireply\"> &gt; biggest financial investment.  Who wants that neglected?<br/>\n<br/>\n </span></blockquote>IMHO, since you are going to reap any financial benefit out of it, <br/>\nkeeping up the home is your responsibility. You can do that <br/>\ngrudgingly and angrily about all that gets worn in the home, or you <br/>\ncan keep it up as best you can with all that you&#39;ve got going, and do <br/>\nit cheerfully, knowing that you can redecorate when the kids are gone <br/>\n(personally, I&#39;m planning on a different color of carpet entirely :-)<br/>\n<br/>\nFlylady (flylady.net) has a bunch of good suggestions on how to <br/>\ndevelop efficient routines for housecare, as well as suggestions for <br/>\ngetting rid of what she calls &quot;stinkin&#39; thinkin&#39; &quot; which is <br/>\nhousecleaning martyrdom. Chances are, if you cheerfully go about <br/>\nkeeping things looking nice, and you ask the kids to pitch in when <br/>\nneeded, they will. We &quot;unchored&quot; a couple of years ago and the kids <br/>\nare almost always willing to help out with something when I ask them <br/>\nto. It&#39;s not always what I&#39;d want immediate help with (they&#39;re always <br/>\nglad to wash one set of windows for instance, when maybe what I need <br/>\nto do is unload the dishwasher) but they&#39;re definitely helpful! I try <br/>\nto make housecare a game - I need to do this for my own sanity <br/>\nbecause I&#39;m not a born housekeeper. So we use some of Flylady&#39;s <br/>\nsuggestions, like &quot;5 minute room rescues&quot;, &quot;27 Fling Boogies&quot; and <br/>\nsome of her other fun stuff, and it makes it way more enjoyable for <br/>\nanyone involved. For instance, I hate folding laundry, so when I have <br/>\na pile in my bedroom to fold, I just fold 5 things any time I walk <br/>\ninto the bedroom. Sometimes I&#39;ll ask the kids to just put away 5 <br/>\nthings when they walk in. That way none of us feel like we have to <br/>\nspend an hour folding or putting away clothes. It only takes 30 <br/>\nseconds to do those five things, but by the end of the day our <br/>\nlaundry mountain is moved! You can take these types of things and <br/>\napply them to any housekeeping task and make it a lot more enjoyable <br/>\nfor you, which can end up meaning much more enjoyable for the kids to <br/>\nbe around or pitch in.<br/>\n<br/>\nBlue Skies,<br/>\n-Robin-</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] unschooling discussion","postDate":"1086538612","msgId":95279,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFkNC4yMmEwMWQ3ZC4yZGY0OWQ3NEBhb2wuY29tPg=="},"prevInTopic":95270,"nextInTopic":95318,"prevInTime":95278,"nextInTime":95281,"topicId":27787,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/6/04 10:10:06 AM, ecsamhill@earthlink.net writes: ","messageBody":"<div id=\"ygrps-yiv-966920926\">In a message dated 6/6/04 10:10:06 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ecsamhill@...\">ecsamhill@...</a> writes:<br/>\n<br/>\n&lt;&lt; (Now I&#39;m going to say the same thing about 6 different ways.  If you <br/>\n<br/>\nalready get it and the repetition is bugging you, then skip some lines.  <br/>\n<br/>\nI&#39;m just trying to find different ways to say what I&#39;m thinking that <br/>\n<br/>\nwill make sense to different people.) &gt;&gt;<br/>\n<br/>\nI thought it was  HUGELY clear and helpful post and I&#39;m saving it!<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":2300774,"authorName":"Elizabeth Hill","from":"Elizabeth Hill &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] unschooling discussion","postDate":"1086535279","msgId":95270,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQwQzMzNjZGLjIwMzA0MDFAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PENENTI1QkYwLUI3NkMtMTFEOC1CNUY5LTAwMEE5NUUyOTJDNkBtYWMuY29tPg==","referencesHeader":"PGM5c3ViMSt1NHFtQGVHcm91cHMuY29tPiA8Q0Q1MjVCRjAtQjc2Qy0xMUQ4LUI1RjktMDAwQTk1RTI5MkM2QG1hYy5jb20+"},"prevInTopic":95269,"nextInTopic":95279,"prevInTime":95269,"nextInTime":95271,"topicId":27787,"numMessagesInTopic":0,"msgSnippet":"** But there are often repercussions to living an unschooling life -- there are side effects of trusting our children and living in freedom and when we","messageBody":"<div id=\"ygrps-yiv-834653226\">** But there are often &quot;repercussions&quot; to living an unschooling life --<br/>\nthere are &quot;side effects&quot; of trusting our children and living in freedom<br/>\nand when we talk about those here, they are IN the unschooling context.<br/>\nWe&#39;re NOT defining unschooling as those things and we&#39;re not turning<br/>\nthe list into a general discussion about chores or bedtimes or<br/>\nwhatever.<br/>\n<br/>\nIs this clear as mud? Although I&#39;m clear in my own head about what we<br/>\nmean - it seems to be a little hard to get it across clearly.**<br/>\n<br/>\n<br/>\n(I&#39;m going to look at just a subset of what you said.  Something that I <br/>\nthink is an assumption that new-to-the-list people make that can lead to <br/>\nconfusion.  That is this list will not tell you the step-by-step, <br/>\noptimum way to raise and educate your child.  Because top-down <br/>\ninstruction is not what this list is about.) <br/>\n<br/>\nWe discuss all kinds of parenting issues on this list and have some <br/>\nvaluable experience to share.  We think we have some information about a <br/>\nnovel form learning, *unschooling*.  This information is not commonly <br/>\navailable.  We think there is some real MISinformation in our culture <br/>\nabout how people learn, and we want to point out that some of the <br/>\nreasons for sending kids to school are not valid.  **But, the purpose of <br/>\nthis list is not to supercede the thinking process and the awareness of <br/>\nthe parent.**  The purpose of this list is to **stimulate** each <br/>\nparent&#39;s thinking and awareness about parenting and learning in her <br/>\nfamily life.<br/>\n<br/>\nThe parent is the one living with and interacting with her children.  <br/>\nShe&#39;s the one who already knows them, and has the potential to increase <br/>\nher knowledge of them every day.  This is valuable expertise, (even <br/>\nthough institutional experts like school and doctors have been known to <br/>\nunderestimate it&#39;s importance).  If a parent just followed the <br/>\nsuggestions of the list **without thinking about them** and <br/>\nexperimenting with them then an important part of the process of <br/>\ninteracting wiht her childen would be short-circuited.  And unschooling <br/>\ndoesn&#39;t work that way.<br/>\n<br/>\nWe don&#39;t want parents to throw away what they&#39;ve observed about their <br/>\nchildren and what they know about them in their hearts.  That&#39;s reall <br/>\nknowledge.  We just want them to question what they&#39;ve heard about <br/>\nchildren in some of our culture&#39;s dubious folk wisdom.  &quot;Give them an <br/>\ninch and they&#39;ll take a mile.&quot;  &quot;Don&#39;t pick up a crying baby, you&#39;ll <br/>\nspoil it.&quot;  &quot;Kids who go to publicly funded preschool don&#39;t end up in <br/>\npublicly funded prisons.&quot; <br/>\n<br/>\nUnschooling absolutely needs to be responsive to the individuality of <br/>\nthe child.  That&#39;s crucial.  We don&#39;t want to be like public school and <br/>\nexaggerate the similarities of all children to the point that we are <br/>\ntrying to pound square pegs into round holes.  Unschooling also needs to <br/>\nbe responsive to the circumstances of the family.  There&#39;s no reason to <br/>\nfind thirty other people and do what they are doing. &lt;g&gt;  I know that&#39;s <br/>\nhow most of us learned growing up, but public school is over for us <br/>\nadults.  So, be free, and find ways to free your children.<br/>\n<br/>\nUnschooling isn&#39;t a clearly marked path where what happens first is <br/>\nfollowed predictably by the next step and the next step like the years <br/>\nof public school K-12.  It doesn&#39;t start at 8:00am each weekday and stop <br/>\nat 3.  It doesn&#39;t stop in June, July and August.  It isn&#39;t over when <br/>\nyour child is 18.  What you do first isn&#39;t pre-determined for you.  <br/>\n**What you do next isn&#39;t dictated to you.**<br/>\n<br/>\n(Now I&#39;m going to say the same thing about 6 different ways.  If you <br/>\nalready get it and the repetition is bugging you, then skip some lines.  <br/>\nI&#39;m just trying to find different ways to say what I&#39;m thinking that <br/>\nwill make sense to different people.)<br/>\n<br/>\nUnschooling isn&#39;t laid out like a curriculum.  It doesn&#39;t limit itself <br/>\nto 6 or 7 subjects.  It doesn&#39;t even guarantee coverage of those <br/>\nspecific subjects that high schools think are important.<br/>\n<br/>\nUnschooling is more like an experiment and less like a recipe.  What <br/>\nyour children will do everyday is not predictable and should not be <br/>\ncontrolled.  (I mean don&#39;t treat them like marionettes.  I don&#39;t mean <br/>\nlet them run into traffic.)<br/>\n<br/>\nThis list exists to help us question the way we used to do things.  But <br/>\nit doesn&#39;t prescribe answers. <br/>\n<br/>\nThe answers to question like --&quot;What do I do now?&quot; -- are not all in <br/>\n*the book*.  There is no bible of unschooling.  There is no imposed <br/>\npenalty for violating the unschooling laws.  There is no unschooling <br/>\nTeacher&#39;s Manual with a table of contents and answers to tough questions <br/>\nin the back.<br/>\n<br/>\nWe don&#39;t tell you how to unschool.   When &quot;typical&quot; days of unschoolers <br/>\nare discussed is is not with the intention that someone copy them. <br/>\n<br/>\nI suppose this list does tell you what NOT to do, but you should only do <br/>\nthose things if you believe that they might work / will work / or will <br/>\ndo less harm than what you currently are doing.  <br/>\n<br/>\nThis list is more like therapy, where you sit on a couch and discuss <br/>\nstuff, than like boot camp where a bugle wakes you and someone orders <br/>\nyou around all day and sets your schedule for you.  (I wish I could say <br/>\nthere were no latrines to clean. &lt;g&gt;)<br/>\n<br/>\nI don&#39;t know how to make this list directly useful for a parent who <br/>\nreally wants to have a set plan to follow.  Because I think none of us <br/>\nfollows a set plan.  We follow the wishes of our children and the needs <br/>\nof our life circumstances.  If we had a plan we&#39;d have to throw it out <br/>\nafter the first half hour or get out a big red pen and edit &quot;the plan&quot; <br/>\nlike crazy.  And I don&#39;t think metaphorical big red pens belong in <br/>\nunschooling.<br/>\n<br/>\nBetsy</div>","specialLinks":[]},{"userId":172750465,"authorName":"b229d655@cs.com","from":"b229d655@...","profile":"robeyboyz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Bedrooms","postDate":"1086534466","msgId":95269,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0My4yYWY1MTgwOC4yZGY0OGQ0MkBjcy5jb20+"},"prevInTopic":95268,"nextInTopic":95270,"prevInTime":95268,"nextInTime":95270,"topicId":27787,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/6/2004 11:02:10 AM Eastern Standard Time, ... AWESOME!!!  I learned quite a bit just now, thanks for elaborating.  I thought maybe you d","messageBody":"<div id=\"ygrps-yiv-1652928528\">In a message dated 6/6/2004 11:02:10 AM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> writes: <br/>\n<blockquote><span title=\"ireply\"> &gt;   It&#39;s always fun to discuss such things, though, and for the <br/>\n&gt; local kids to see how much they knew without knowing it would be exotic <br/>\n&gt; information for anyone.<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>AWESOME!!!  I learned quite a bit just now, thanks for elaborating.  I <br/>\nthought maybe you&#39;d think I was being silly, asking such a question, but I was <br/>\nserious.  I was thinking high dust and wind type stuff.<br/>\n<br/>\nPamela<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: unschooling discussion","postDate":"1086534396","msgId":95268,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGE5LjU5ODkyYzZhLjJkZjQ4Y2ZjQGFvbC5jb20+"},"prevInTopic":95267,"nextInTopic":95269,"prevInTime":95267,"nextInTime":95269,"topicId":27787,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/6/04 12:28:34 AM, cheeps4u@yahoo.com writes:  It s likely that people","messageBody":"<div id=\"ygrps-yiv-1906558886\">In a message dated 6/6/04 12:28:34 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:cheeps4u@...\">cheeps4u@...</a> writes:<br/>\n<br/>\n&lt;&lt; People want answers <br/>\n<br/>\nnow, now, now....are they thinking enough?  &gt;&gt;<br/>\n<br/>\nIt&#39;s likely that people think unschooling is easier than it is, that it&#39;s ten <br/>\nsimple rules to follow:  no more messy thinking required.<br/>\n<br/>\nYet this list has ten simple rules which are mailed to new members, and the <br/>\nmoderators spend too much time arguing with new members and explaining those <br/>\nnew rules, even though there are two versions of them here:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/lists/info\">http://sandradodd.com/lists/info</a><br/>\n<br/>\nAND they&#39;re available at a link/URL listed at the bottom of every single <br/>\ne-mail from this group.   <br/>\n<br/>\nI guess the solution is to just keep doing what we&#39;re doing, appreciate those <br/>\ndays and weeks when the list is wonderfully smooth and and useful, and endure <br/>\nthe worse days.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Bedrooms","postDate":"1086533914","msgId":95267,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM0LmRkNDA3ZTIuMmRmNDhiMWFAYW9sLmNvbT4="},"prevInTopic":95257,"nextInTopic":95268,"prevInTime":95266,"nextInTime":95268,"topicId":27787,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/5/04 9:45:38 PM, b229d655@cs.com writes:  The reason to make the bed in New Mexico is to keep the sand out. Really?  How would it get","messageBody":"<div id=\"ygrps-yiv-1986888193\">In a message dated 6/5/04 9:45:38 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:b229d655@...\">b229d655@...</a> writes:<br/>\n<br/>\n&lt;&lt; &gt; The reason to make the bed in New Mexico is to keep the sand out.<br/>\nReally?  How would it get in? &gt;&gt;<br/>\n<br/>\nAir.<br/>\nMost wind carries dust and sand.  It the house is totally closed up, you&#39;ll <br/>\nsuffocate.  The way most houses are cooled is evaporative coolers, and even <br/>\nthat comes in with some &quot;airborne particulates,&quot; because although there are wet <br/>\npads, they&#39;re sufficiently open that &quot;live air&quot; is coming in.  And every person <br/>\nor dog who comes in from the inside is likely to bring some dust/sand on <br/>\nshoes and clothes, in hair...<br/>\n<br/>\nWe just get used to it.<br/>\n<br/>\nSome people live in wetter neighborhoods (farmland by the river).   Then they <br/>\nhave mud and (different) stickers and mosquitos.   Uphill, we have sand and <br/>\nno mosquitos.  People high enough for big pine forests and ferns on the ground <br/>\ndon&#39;t have stickers or mosquitos.  They might have bears and mountain lions <br/>\nthey didn&#39;t particularly want.  But they won&#39;t get in the bed. &lt;g&gt;<br/>\n<br/>\nA  homeschooling family moved here lately from southern California and bought <br/>\na house.  The mom is mystified by the local need for this or that, didn&#39;t get <br/>\nthe swamp cooler, has a septic tank, lives where she can irrigate.   Very <br/>\nforeign for her.  It&#39;s always fun to discuss such things, though, and for the <br/>\nlocal kids to see how much they knew without knowing it would be exotic <br/>\ninformation for anyone.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":100027905,"authorName":"TreeGoddess","from":"TreeGoddess &lt;treegoddess@...&gt;","profile":"odrade7","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Bedrooms","postDate":"1086525223","msgId":95257,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJGNDFEOTQ4LUI3QjUtMTFEOC04OUIwLTAwMDM5M0E1REE2NkBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PDFlYS4yMjVkM2FhYi4yZGYzZTM4OUBhb2wuY29tPg==","referencesHeader":"PDFlYS4yMjVkM2FhYi4yZGYzZTM4OUBhb2wuY29tPg=="},"prevInTopic":95252,"nextInTopic":95267,"prevInTime":95256,"nextInTime":95258,"topicId":27787,"numMessagesInTopic":0,"msgSnippet":"Yeah, I can see that.  Having lived in MI my whole life I ve only had to deal with sand in the bed if we ve been camping.  Does the sand there blow around or","messageBody":"<div id=\"ygrps-yiv-212567760\">Yeah, I can see that.  Having lived in MI my whole life I&#39;ve only had <br/>\nto deal with sand in the bed if we&#39;ve been camping.  Does the sand <br/>\nthere blow around or is it more from coming in with/on people and pets?<br/>\n-Tracy-<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Jun 5, 2004, at 11:03 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> wrote:<br/>\n<br/>\n&gt; In a message dated 6/5/04 7:42:49 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:treegoddess@...\">treegoddess@...</a> writes:<br/>\n&gt;<br/>\n&gt; &lt;&lt; I never saw the point in making it except when putting on fresh <br/>\n&gt; linens.  &gt;&gt;<br/>\n&gt;<br/>\n&gt; The reason to make the bed in New Mexico is to keep the sand out.<br/>\n&gt;<br/>\n&gt; Holly makes hers.   I make mine.  Kirby and Marty don&#39;t.  Sometimes <br/>\n&gt; they&#39;re sleeping in sand. &lt;g&gt; </span></blockquote></div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Bedrooms","postDate":"1086508059","msgId":95252,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJDRTg0NDVCLjI3Q0U3JWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGM5c2RobytoZHM3QGVHcm91cHMuY29tPg=="},"prevInTopic":95247,"nextInTopic":95257,"prevInTime":95251,"nextInTime":95253,"topicId":27787,"numMessagesInTopic":0,"msgSnippet":"... The reason you re having problems understanding is that you re seeing two choices: make them or be the maid. What it sounds like you did is that you made","messageBody":"<div id=\"ygrps-yiv-441235585\">on 6/5/04 8:15 AM, Tina at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:zoocrew@...\">zoocrew@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Since I&#39;ve begun my unschooling journey, the one thing<br/>\n&gt; that I have the biggest block with is the whole not requiring<br/>\n&gt; anything out of the children in the home.<br/>\n<br/>\n </span></blockquote>The reason you&#39;re having problems understanding is that you&#39;re seeing two<br/>\nchoices: make them or be the maid.<br/>\n<br/>\nWhat it sounds like you did is that you made them pick up when they were<br/>\nyounger (I assume since you say you don&#39;t get the idea) and then left them<br/>\nto their own devices with the expectation that they&#39;d care for things to<br/>\nyour standards. The first obviously didn&#39;t turn them into people who care<br/>\nfor things on their own. And the second isn&#39;t being advocated.<br/>\n<br/>\nAnother choice is to accept ownership of the household tasks and then<br/>\nsincerely ask for help (which means no is an acceptable answer) and<br/>\nsincerely thank people when they have helped (even if it isn&#39;t up to the<br/>\nstandards you would have done it or standards you think they&#39;re capable of).<br/>\n<br/>\nIt&#39;s just basic human nature that it&#39;s more rewarding to help someone who is<br/>\nworking hard at what they&#39;re doing and is appreciative of help than someone<br/>\nwho is spreading their work around and angry that no one is helping in the<br/>\nway she wants the work to be done.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":122454986,"authorName":"Sara","from":"&quot;Sara&quot; &lt;cheeps4u@...&gt;","profile":"cheeps4u","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: unschooling discussion","postDate":"1086503249","msgId":95247,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM5dWRnaCtlZGtuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENENTI1QkYwLUI3NkMtMTFEOC1CNUY5LTAwMEE5NUUyOTJDNkBtYWMuY29tPg=="},"prevInTopic":95246,"nextInTopic":95252,"prevInTime":95246,"nextInTime":95248,"topicId":27787,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-882631811\">&lt;&lt;But there are often &quot;repercussions&quot; to living an unschooling life --<br/>\n there are &quot;side effects&quot; of trusting our children and living in <br/>\nfreedom and when we talk about those here, they are IN the <br/>\nunschooling context. We&#39;re NOT defining unschooling as those things <br/>\nand we&#39;re not turning the list into a general discussion about chores <br/>\nor bedtimes or whatever.<br/>\n<br/>\n Is this clear as mud? Although I&#39;m clear in my own head about what <br/>\nwe  mean - it seems to be a little hard to get it across clearly. -<br/>\npam&gt;&gt;<br/>\n<br/>\n<br/>\nSome folks are mixing up control issues with schooling practises I <br/>\nthink. I guess having to parent and advocate a freer learning style <br/>\ncan be hard for many to integrate or instigate in their daily lives. <br/>\nI think you are very clear and if you repost the above statement <br/>\nevery few days, you&#39;d do us all a favor...<br/>\n<br/>\nSo...how many of us started out letting our children grow and explore <br/>\nwithout much restriction and encouraging independence? With the <br/>\nexception of safety issues and respect for others sanity, I let my <br/>\nkids do anything they could tackle, physically and mentally. <br/>\n<br/>\nSandra mentioned not trying to change adults when it comes to teens <br/>\nquestioning other adults....to coach the teeen to better deal with <br/>\nthose he wishes to discuss things with. Maybe some of the new <br/>\nunschoolers need to be more open to coaching from this core group <br/>\ninstead of challenging them. Maybe the constant influx of new <br/>\nunschoolers is increasing....I can see where those that maintain good <br/>\nlists get tired of saying the same things over and over. I see the <br/>\nuse of links but I wonder if they are being read. People want answers <br/>\nnow, now, now....are they thinking enough? Sara in NC</div>","specialLinks":[]},{"userId":122454986,"authorName":"Sara","from":"&quot;Sara&quot; &lt;cheeps4u@...&gt;","profile":"cheeps4u","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Bedrooms","postDate":"1086501337","msgId":95246,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM5dWJrcCtiNzg4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDdCMUYyREE3LUI3NUEtMTFEOC04MUM0LTAwMDM5M0E1REE2NkBjb21jYXN0Lm5ldD4="},"prevInTopic":95244,"nextInTopic":95247,"prevInTime":95245,"nextInTime":95247,"topicId":27787,"numMessagesInTopic":0,"msgSnippet":"You re right....and it stays unmade, I figure it airs out better anyway :) He will make it if people are over or if I ask him and if he forgets, he shuts the","messageBody":"<div id=\"ygrps-yiv-1834985926\">You&#39;re right....and it stays unmade, I figure it airs out better <br/>\nanyway :) He will make it if people are over or if I ask him and if <br/>\nhe forgets, he shuts the door. It&#39;s funny how old hang ups still ping <br/>\neven though I let them go several years ago. It still drives the DH <br/>\nbats though...</div>","specialLinks":[]},{"userId":141316284,"authorName":"pam sorooshian","from":"pam sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"unschooling discussion","postDate":"1086493893","msgId":95244,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENENTI1QkYwLUI3NkMtMTFEOC1CNUY5LTAwMEE5NUUyOTJDNkBtYWMuY29tPg==","inReplyToHeader":"PGM5c3ViMSt1NHFtQGVHcm91cHMuY29tPg==","referencesHeader":"PGM5c3ViMSt1NHFtQGVHcm91cHMuY29tPg=="},"prevInTopic":95242,"nextInTopic":95246,"prevInTime":95243,"nextInTime":95245,"topicId":27787,"numMessagesInTopic":0,"msgSnippet":"I don t know why, but it seems hard for people to undestand that this list is for us to talk and analyze and evaluate and critique what it is like for us to","messageBody":"<div id=\"ygrps-yiv-2078315767\">I don&#39;t know why, but it seems hard for people to undestand that this <br/>\nlist is for us to talk and analyze and evaluate and critique what it is <br/>\nlike for us to live an unschooling life. We&#39;re unschoolers - we&#39;re <br/>\ntalking &quot;about&quot; unschooling lifestyles. We hope that by doing this <br/>\nwe&#39;ll help each other delve ever deeper.<br/>\n<br/>\nWe talk about housework, family finances, food issues, materialism, TV <br/>\nand video games, and movies and sports and on and on - ALL in the <br/>\ncontext of living life as unschoolers.<br/>\n<br/>\nWe are not saying you have to have unlimited TV or no bedtimes or <br/>\ninclude the kids in making financial decisions or any of those things <br/>\nin order to unschool. Unschooling means not doing school in the home - <br/>\nnot having lesson plans, teacher-moments, assignments, grades, tests. <br/>\nIt means trusting kids to learn what they need to learn in their own <br/>\nway and with the help of loving attentive involved supportive parents <br/>\nwho provide an environment conducive to natural learning.<br/>\n<br/>\nBut there are often &quot;repercussions&quot; to living an unschooling life -- <br/>\nthere are &quot;side effects&quot; of trusting our children and living in freedom <br/>\nand when we talk about those here, they are IN the unschooling context. <br/>\nWe&#39;re NOT defining unschooling as those things and we&#39;re not turning <br/>\nthe list into a general discussion about chores or bedtimes or <br/>\nwhatever.<br/>\n<br/>\nIs this clear as mud? Although I&#39;m clear in my own head about what we <br/>\nmean - it seems to be a little hard to get it across clearly.<br/>\n<br/>\n-pam<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Jun 5, 2004, at 10:02 AM, Tina wrote:<br/>\n<br/>\n&gt; &lt;&lt;Nobody has to change anything in their lives because of what they<br/>\n&gt; read here.  Some like to. Some do so against their conscious will.<br/>\n&gt; &lt;bwg&gt; If you can&#39;t or don&#39;t want to, don&#39;t! It&#39;s not a part of<br/>\n&gt; unschooling. It&#39;s not a prerequisite of unschooling.  It&#39;s a part of<br/>\n&gt; a larger way of related thinking.&gt;&gt;<br/>\n&gt;<br/>\n&gt; Sandra<br/>\n&gt;<br/>\n&gt; I&#39;m SO glad you said this!  I don&#39;t feel like I HAVE TO change<br/>\n&gt; anything, but I&#39;ve been following a lot of the various threads on the<br/>\n&gt; list and somehow came to the conclusion that this was part of<br/>\n&gt; unshcooling.  That&#39;s why I mentioned not having ever read anything<br/>\n&gt; about it.  I thought I missed something somewhere about the<br/>\n&gt; unschooling philosophy.<br/>\nNational Home Education Network<br/>\n&lt;www.NHEN.org&gt;<br/>\nServing the entire homeschooling community since 1999<br/>\nthrough information, networking and public relations. </span></blockquote></div>","specialLinks":[]},{"userId":172750465,"authorName":"b229d655@cs.com","from":"b229d655@...","profile":"robeyboyz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Bedrooms","postDate":"1086493494","msgId":95242,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc3LjJiMzc2OThjLjJkZjNlZDM2QGNzLmNvbT4="},"prevInTopic":95241,"nextInTopic":95244,"prevInTime":95241,"nextInTime":95243,"topicId":27787,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/5/2004 11:41:44 PM Eastern Standard Time, ... Really?  How would it get in? Pamela [Non-text portions of this message have been removed]","messageBody":"<div id=\"ygrps-yiv-255112130\">In a message dated 6/5/2004 11:41:44 PM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> writes: <br/>\n<blockquote><span title=\"ireply\"> &gt; The reason to make the bed in New Mexico is to keep the sand out.<br/>\n </span></blockquote>Really?  How would it get in?<br/>\n<br/>\nPamela<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154033277,"authorName":"Crystal","from":"&quot;Crystal&quot; &lt;crystal.pina@...&gt;","profile":"crystalinma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Bedrooms","postDate":"1086491851","msgId":95241,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM5dTJjYitzcW4wQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDdCMUYyREE3LUI3NUEtMTFEOC04MUM0LTAwMDM5M0E1REE2NkBjb21jYXN0Lm5ldD4="},"prevInTopic":95239,"nextInTopic":95242,"prevInTime":95240,"nextInTime":95242,"topicId":27787,"numMessagesInTopic":0,"msgSnippet":"He hates for anyone to sleep in his bed now (but he still doesn t make it!:P) ... ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ Funny story then, not so funny now.","messageBody":"<div id=\"ygrps-yiv-689345497\">He hates for anyone to sleep in his bed now (but he still doesn&#39;t <br/>\nmake it!:P)<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n </span></blockquote>~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~<br/>\nFunny story then, not so funny now.  Pre-unschooling, when my middle <br/>\nson was 3 or 4 or 5, he hated to make his bed.  I only bought <br/>\ncomforters so it was just a matter of pulling it up and smoothing out <br/>\nthe wrinkles, but he even hated doing that.  So he would sleep on top <br/>\nof the comforter so he wouldn&#39;t have to make it.  That was a long, <br/>\nlong time ago.  My house hasn&#39;t seen made beds in years.  Who can be <br/>\nbothered?<br/>\n<br/>\nCrystal</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Bedrooms","postDate":"1086491017","msgId":95239,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFlYS4yMjVkM2FhYi4yZGYzZTM4OUBhb2wuY29tPg=="},"prevInTopic":95236,"nextInTopic":95241,"prevInTime":95238,"nextInTime":95240,"topicId":27787,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/5/04 7:42:49 PM, treegoddess@comcast.net writes:  The reason","messageBody":"<div id=\"ygrps-yiv-1003414359\">In a message dated 6/5/04 7:42:49 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:treegoddess@...\">treegoddess@...</a> writes:<br/>\n<br/>\n&lt;&lt; I never saw the point in making it except when putting on fresh linens.  &gt;&gt;<br/>\n<br/>\nThe reason to make the bed in New Mexico is to keep the sand out.<br/>\n<br/>\nHolly makes hers.   I make mine.  Kirby and Marty don&#39;t.  Sometimes they&#39;re <br/>\nsleeping in sand. &lt;g&gt;<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":100027905,"authorName":"TreeGoddess","from":"TreeGoddess &lt;treegoddess@...&gt;","profile":"odrade7","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Bedrooms","postDate":"1086486024","msgId":95236,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdCMUYyREE3LUI3NUEtMTFEOC04MUM0LTAwMDM5M0E1REE2NkBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PGM5c3F1dCs2NXA3QGVHcm91cHMuY29tPg==","referencesHeader":"PGM5c3F1dCs2NXA3QGVHcm91cHMuY29tPg=="},"prevInTopic":95232,"nextInTopic":95239,"prevInTime":95235,"nextInTime":95237,"topicId":27787,"numMessagesInTopic":0,"msgSnippet":"... I don t make our bed and I wouldn t expect my kids to make their beds. I never saw the point in making it except when putting on fresh linens. Besides, the","messageBody":"<div id=\"ygrps-yiv-1293184306\">On Jun 5, 2004, at 12:04 PM, Sara wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; When my son redecorated his room and bathroom, he started being<br/>\n&gt; pickier about keeping it nice. He hates for anyone to sleep in his bed<br/>\n&gt;  now (but he still doesn&#39;t make it!:P)<br/>\n<br/>\n </span></blockquote>I don&#39;t make our bed and I wouldn&#39;t expect my kids to make their beds.  <br/>\nI never saw the point in making it except when putting on fresh linens. <br/>\n  Besides, the kids love to bounce around on the bed during the day, <br/>\nmake tents or forts, or just plain take all the covers off to use <br/>\nelsewhere in the house for various things.  Making the bed would be <br/>\nrather pointless for me.  LOL<br/>\n<br/>\nIf your son&#39;s bed is truly HIS bed then it shouldn&#39;t matter to you if <br/>\nit&#39;s made or not, should it?  :)<br/>\n-Tracy-</div>","specialLinks":[]},{"userId":59925222,"authorName":"queenjane555","from":"&quot;queenjane555&quot; &lt;queenjane555@...&gt;","profile":"queenjane555","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Bedrooms","postDate":"1086463848","msgId":95232,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM5dDcxOCtwMmswQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGM5c2RobytoZHM3QGVHcm91cHMuY29tPg=="},"prevInTopic":95230,"nextInTopic":95236,"prevInTime":95231,"nextInTime":95233,"topicId":27787,"numMessagesInTopic":0,"msgSnippet":"... This is a really big pet peeve of mine...my son s father would always say to him you arent going to do that in MY house!! , it felt weird to me. I mean, i","messageBody":"<div id=\"ygrps-yiv-770301069\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, &quot;Tina&quot; &lt;zoocrew@w...&gt; <br/>\nwrote:<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; What I don&#39;t understand is how it&#39;s wrong to require things from <br/>\n&gt;our  children especially when it&#39;s OUR house. <br/>\n<br/>\n </span></blockquote>This is a really big pet peeve of mine...my son&#39;s father would always <br/>\nsay to him &quot;you arent going to do that in MY house!!&quot;, it felt weird <br/>\nto me. I mean, i think my son and i share a home, but at his father&#39;s <br/>\nhouse he is just visiting i guess. Maybe if your kids felt more <br/>\ninvested in the house, that it is THEIR house too, they would want to <br/>\nnot destroy it.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;One of Pat&#39;s biggest  frustrations with our children is their lack <br/>\n&gt;of regard for our home.  <br/>\n&gt; When we don&#39;t require them to care for things, they get ruined. <br/>\n<br/>\n </span></blockquote>I think you need to be more specific. If my son wanted to write on <br/>\nthe walls of HIS room, i would let him, and would simply paint when <br/>\nhe moved out or when he decided it was ok. If he wanted to write all <br/>\nover the walls in MY room, probably not ok. (This is a hypothetical <br/>\nsince we are renting and sharing a room, and he no longer writes on <br/>\nwalls anyway.) There is a big difference in not requiring certain <br/>\nchores, and not allowing a child to cut a big hole in the living room <br/>\ncurtains because they needed some material. There is a huge middle <br/>\nground there.<br/>\n<br/>\nDo you have a specific concern that you&#39;d like help with? Maybe a <br/>\nspecific example where we could give you alternatives to &quot;my way or <br/>\nthe highway&quot; type thinking?<br/>\n<br/>\nI only have the one kid, but i think if i had seven children, i would <br/>\nresign myself to not having a perfect &quot;new looking&quot; house. How is <br/>\nthat even possible with NINE people living in one home?<br/>\n<br/>\nKatherine</div>","specialLinks":[]},{"userId":163221353,"authorName":"Tina","from":"&quot;Tina&quot; &lt;zoocrew@...&gt;","profile":"tina010871","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Bedrooms","postDate":"1086454945","msgId":95230,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM5c3ViMSt1NHFtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY2LjQxNTYyZDE1LjJkZjM1MzQ2QGFvbC5jb20+"},"prevInTopic":95226,"nextInTopic":95232,"prevInTime":95229,"nextInTime":95231,"topicId":27787,"numMessagesInTopic":0,"msgSnippet":" If you can t or","messageBody":"<div id=\"ygrps-yiv-1543438931\">&lt;&lt;Nobody has to change anything in their lives because of what they <br/>\nread here.  Some like to. Some do so against their conscious will. <br/>\n&lt;bwg&gt; If you can&#39;t or don&#39;t want to, don&#39;t! It&#39;s not a part of <br/>\nunschooling. It&#39;s not a prerequisite of unschooling.  It&#39;s a part of <br/>\na larger way of related thinking.&gt;&gt;<br/>\n<br/>\nSandra<br/>\n<br/>\nI&#39;m SO glad you said this!  I don&#39;t feel like I HAVE TO change <br/>\nanything, but I&#39;ve been following a lot of the various threads on the <br/>\nlist and somehow came to the conclusion that this was part of <br/>\nunshcooling.  That&#39;s why I mentioned not having ever read anything <br/>\nabout it.  I thought I missed something somewhere about the <br/>\nunschooling philosophy.  I would NEVER believe something more or less <br/>\nsolely based on the fact that it was published in whatever format <br/>\nthat may be.<br/>\n<br/>\nThanks for the clarification...<br/>\n<br/>\nTina</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Bedrooms","postDate":"1086454086","msgId":95226,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY2LjQxNTYyZDE1LjJkZjM1MzQ2QGFvbC5jb20+"},"prevInTopic":95221,"nextInTopic":95230,"prevInTime":95225,"nextInTime":95227,"topicId":27787,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/5/04 10:04:35 AM, zoocrew@wideopenwest.com writes: ","messageBody":"<div id=\"ygrps-yiv-548199440\">In a message dated 6/5/04 10:04:35 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:zoocrew@...\">zoocrew@...</a> writes:<br/>\n<br/>\n&lt;&lt; Okay, I have an inquiry, and I know I&#39;m opening myself up here, but I <br/>\n<br/>\nhave to ask.  &gt;&gt;<br/>\n<br/>\nJust ask the questions without an antagonism alert.  It&#39;s less antagonistic!<br/>\n<br/>\n&lt;&lt; Since I&#39;ve begun my unschooling journey, the one thing <br/>\n<br/>\nthat I have the biggest block with is the whole not requiring <br/>\n<br/>\nanything out of the children in the home. &gt;&gt;<br/>\n<br/>\n&quot;the whole&quot;?  <br/>\nRecommendations are made and stories are told and you don&#39;t have to <br/>\nincorporate any of it whatsoever.  Take what you need and leave the rest.<br/>\n<br/>\n&lt;&lt;Maybe part of it is that I&#39;ve not come across that in a book, yet.  I&#39;ve <br/>\nbeen doing a ton of reading.&gt;&gt;<br/>\n<br/>\nIf it were in a book, you&#39;d believe it more? <br/>\nSelf-publication is going to make that a problematical philosophy to live by.<br/>\n<br/>\nI&#39;ve done a ton of reading, and it&#39;s not in a book.  It&#39;s peppered throughout <br/>\nunschooling.com over the past few years, and some of the good parts are <br/>\ncollected here:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/chores\">http://sandradodd.com/chores</a><br/>\n<br/>\n&lt;&lt; Due to the dynamics of our <br/>\n<br/>\nfamily, we may never reach this level of unschooling, since I&#39;m <br/>\n<br/>\ntechnically only unschooling one child. &gt;&gt;<br/>\n<br/>\nNobody has to change anything in their lives because of what they read here.  <br/>\nSome like to.  Some do so against their conscious will. &lt;bwg&gt;  If you can&#39;t <br/>\nor don&#39;t want to, don&#39;t!<br/>\nIt&#39;s not a part of unschooling.  It&#39;s not a prerequisite of unschooling.  <br/>\nIt&#39;s a part of a larger way of related thinking.<br/>\n<br/>\n&lt;&lt;What I don&#39;t understand is how it&#39;s wrong to require things from our <br/>\n<br/>\nchildren especially when it&#39;s OUR house. &gt;&gt;<br/>\n<br/>\nSome people like to think it&#39;s the kids&#39; house too.<br/>\n<br/>\n&lt;&lt;One of Pat&#39;s biggest <br/>\n<br/>\nfrustrations with our children is their lack of regard for our home.  &gt;&gt;<br/>\n<br/>\nIf you consider it your home (and they are visitors, or inferior beings who <br/>\nare temporarily there) then of course your priorities and principles will be <br/>\ndifferent, and that&#39;s the way priorities go.<br/>\n<br/>\n&lt;&lt;When we don&#39;t require them to care for things, they get ruined. &gt;&gt;<br/>\n<br/>\nThe things, or the kids?<br/>\n<br/>\nAnd by &quot;require them to care for things,&quot; do you mean require them to polish <br/>\nwooden tables weekly, or dissuade them from carving their names in them?  <br/>\nThere&#39;s a great range of &quot;to care for&quot; and another great range of &quot;require.&quot;<br/>\n<br/>\nIf it&#39;s your house, why don&#39;t you care for all the things yourself?  Part of <br/>\nthat might be having guidelines about who can use what how.  No jumping on the <br/>\ncouch.  No Playdoh on the carpet.  <br/>\n<br/>\n&lt;&lt;As he puts it, they will eventually move on, but we still have to live <br/>\n<br/>\nhere. &gt;&gt;<br/>\n<br/>\nOr you might die and they&#39;ll have spent those years taking care of a house <br/>\nyou weren&#39;t going to live in after they were gone after all.<br/>\n<br/>\nThat&#39;s a facetious answer, but even facetious answers could have photos in <br/>\nthe book next to them.  Not all parents outlive the childhoods of their <br/>\noffspring.<br/>\n<br/>\n-=-It makes me ill when I think that our upstairs is only 5 years <br/>\n<br/>\nold, and it looks at least 10 years old. -=-<br/>\n<br/>\nWhat does that have to do with unschooling, then, since most of your children <br/>\nare in school?<br/>\n<br/>\n-=-Why is it wrong to expect <br/>\n<br/>\nyour children to care for your things?  As their parent I don&#39;t <br/>\n<br/>\nmistreat their possessions. -=-<br/>\n<br/>\nThat would be the thing I would recommend.  Take good care of their things, <br/>\ntell them why you are, and theoretically, ideally, they will want to take care <br/>\nof YOUR things.  <br/>\n<br/>\nI don&#39;t know what caused the dynamics in your home to be what they are, but <br/>\nby your own description, it&#39;s not an unschooling matter.<br/>\n<br/>\nMy kids aren&#39;t destructive of property.<br/>\n<br/>\nHolly has a wooden box her dad made her for her medieval clothes (for SCA).  <br/>\nIt&#39;s about three feet long, and can be used as a seat or a table.  She got <br/>\nnail polish remover on it and it marred the finish.  She felt AWFUL.  And it was <br/>\nhers.  And her dad can fix it.<br/>\n<br/>\n-=-At last check our homes are probably our <br/>\n<br/>\nbiggest financial investment.  Who wants that neglected?-=-<br/>\n<br/>\nOur children are our biggest responsibility and &quot;investment.&quot;<br/>\nWe have a house so our children have a place to live, and we were happy to <br/>\nhave this particular house (which we bought six years or so ago) because it&#39;s a <br/>\ngreat house for unschooling.<br/>\n<br/>\nIf a house is bought as an investment, maybe that&#39;s a better activity for <br/>\nchildless couples.   We had neighbors for a while whose mutual hobby was buying <br/>\nhouses, fixing them up themselves and selling them for more.  After just a few <br/>\nhouses, their houses were not &quot;costing them&quot; anything--they got ahead of the <br/>\ngame.  But they were doing it for fun, and as a shared activity.  They would <br/>\ndecide &quot;this bathroom needs wooden fixtures,&quot; and would go to fleamarkets and <br/>\ngarage sales.<br/>\n<br/>\nExpecting one&#39;s children to be partners in a home-improvement or even <br/>\ninvestment-maintenance scheme seems unreasonable.  And especially if you consider it <br/>\nYOUR house, not theirs.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":40256956,"authorName":"Jennifer","from":"&quot;Jennifer&quot; &lt;jmcseals@...&gt;","profile":"sevenhavei","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Bedrooms","postDate":"1086452897","msgId":95221,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM5c3NiMSt0aTJwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGM5c2RobytoZHM3QGVHcm91cHMuY29tPg=="},"prevInTopic":95219,"nextInTopic":95226,"prevInTime":95220,"nextInTime":95222,"topicId":27787,"numMessagesInTopic":0,"msgSnippet":"... So where exactly is THEIR house?  And *require* sound awfully brute, disrespectful and controlling.  It may just be the typewritten words, but if they come","messageBody":"<div id=\"ygrps-yiv-83166959\"><blockquote><span title=\"ireply\">&gt;What I don&#39;t understand is how it&#39;s wrong to require things from our<br/>\n&gt;children especially when it&#39;s OUR house.<br/>\n<br/>\n </span></blockquote>So where exactly is THEIR house?  And *require* sound awfully brute, <br/>\ndisrespectful and controlling.  It may just be the typewritten <br/>\nwords, but if they come out at home sounding that way, you might <br/>\nhave the answer to your own question.<br/>\n<br/>\nWhen they&#39;re old enough to move out, they&#39;ll probably understand and <br/>\ncome back and help you paint and recarpet if you ask nicely.  If <br/>\nwhile they are boarding, they feel like it isn&#39;t their house, too, <br/>\nthen maybe they don&#39;t give a crap what the carpet and walls look <br/>\nlike or how well the house looks.  I mean, it isn&#39;t THEIR house <br/>\nafter all.  People tend to learn about respecting other peoples <br/>\nthings by learning how to care for their own.  (WHY didn&#39;t I apply <br/>\nthis to my wallpaper???)<br/>\n<br/>\nI have seven children, too.  All mine are home (the oldest 13, the <br/>\nrest under 8) and I&#39;m not enough to keep up after everyone&#39;s <br/>\nmesses.  They are pretty good about cleaning up after themselves.  <br/>\nIf not, it doesn&#39;t take much more than a nice request.  We make a <br/>\ngame out of it, set the timer and everyone picks up for 15 minutes.  <br/>\nSometimes, we do it a lot during the day, sometimes we only do it <br/>\nonce.  Sometimes, I forget about it and the house gets crazy-madman-<br/>\nmessy and I get mad and have to remind myself that if I can leave <br/>\nthe dishes on the counter for two days, surely they will make  <br/>\nbigger messes and forget to clean them up because they are a LOT <br/>\nyounger than I am.<br/>\n<br/>\nI&#39;m learning as I make mistakes.  Go back and read the wallpaper <br/>\nthread.  You&#39;ll learn a lot, too! The same advice applies.  :)<br/>\n<br/>\nJennifer</div>","specialLinks":[]},{"userId":122454986,"authorName":"Sara","from":"&quot;Sara&quot; &lt;cheeps4u@...&gt;","profile":"cheeps4u","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Bedrooms","postDate":"1086451485","msgId":95219,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM5c3F1dCs2NXA3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGM5c2RobytoZHM3QGVHcm91cHMuY29tPg=="},"prevInTopic":95213,"nextInTopic":95221,"prevInTime":95218,"nextInTime":95220,"topicId":27787,"numMessagesInTopic":0,"msgSnippet":"Tina, I have to ask...what things of yours do they get to ruin? I m guessing furniture? If that is one of the things then they need to go pick out some thrift","messageBody":"<div id=\"ygrps-yiv-1603392564\">Tina, I have to ask...what things of yours do they get to ruin? I&#39;m <br/>\nguessing furniture?<br/>\n<br/>\nIf that is one of the things then they need to go pick out some <br/>\nthrift store stuff they like and you may need to put yours away. When <br/>\nmy son redecorated his room and bathroom, he started being pickier <br/>\nabout keeping it nice. He hates for anyone to sleep in his bed now<br/>\n(but he still doesn&#39;t make it!:P)<br/>\n<br/>\nThe only thing I&#39;ve really asked of them is not to hurt my stuff but <br/>\nif my stuff is something they must use then I know it&#39;s going to get <br/>\nworn. Discussions of why you like your things a certain way and what <br/>\nthey might like to buy or make for themselves may be in order. Sara <br/>\nin NC</div>","specialLinks":[]},{"userId":163221353,"authorName":"Tina","from":"&quot;Tina&quot; &lt;zoocrew@...&gt;","profile":"tina010871","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Bedrooms","postDate":"1086437752","msgId":95213,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM5c2RobytoZHM3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGM5cmMyYSs1NXFyQGVHcm91cHMuY29tPg=="},"prevInTopic":95196,"nextInTopic":95219,"prevInTime":95212,"nextInTime":95214,"topicId":27787,"numMessagesInTopic":0,"msgSnippet":"Okay, I have an inquiry, and I know I m opening myself up here, but I have to ask.  Since I ve begun my unschooling journey, the one thing that I have the","messageBody":"<div id=\"ygrps-yiv-2060013851\">Okay, I have an inquiry, and I know I&#39;m opening myself up here, but I <br/>\nhave to ask.  Since I&#39;ve begun my unschooling journey, the one thing <br/>\nthat I have the biggest block with is the whole not requiring <br/>\nanything out of the children in the home.  Maybe part of it is that <br/>\nI&#39;ve not come across that in a book, yet.  I&#39;ve been doing a ton of <br/>\nreading.<br/>\n<br/>\nWe are a family of nine, seven children.  Two just graduated, two <br/>\ngraduate next year, two are in charter public school and one his at <br/>\nhome.  He&#39;s the youngest at 10 years.  Due to the dynamics of our <br/>\nfamily, we may never reach this level of unschooling, since I&#39;m <br/>\ntechnically only unschooling one child.  Not to say that my knowledge <br/>\nand practice of unschooling has no effect on the rest of the family.  <br/>\nI&#39;ve seen that it does.<br/>\n<br/>\nWhat I don&#39;t understand is how it&#39;s wrong to require things from our <br/>\nchildren especially when it&#39;s OUR house.  One of Pat&#39;s biggest <br/>\nfrustrations with our children is their lack of regard for our home.  <br/>\nWhen we don&#39;t require them to care for things, they get ruined.  As <br/>\nhe puts it, they will eventually move on, but we still have to live <br/>\nhere.  It makes me ill when I think that our upstairs is only 5 years <br/>\nold, and it looks at least 10 years old.  Why is it wrong to expect <br/>\nyour children to care for your things?  As their parent I don&#39;t <br/>\nmistreat their possessions.  At last check our homes are probably our <br/>\nbiggest financial investment.  Who wants that neglected?<br/>\n<br/>\nOkay, fire away...<br/>\n<br/>\n:):):)Tina</div>","specialLinks":[]},{"userId":142002410,"authorName":"Kristi","from":"&quot;Kristi&quot; &lt;hayes@...&gt;","profile":"morgainesmama","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Bedrooms","postDate":"1086407705","msgId":95196,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM5cmc2cCtpZHMxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGM5cmMyYSs1NXFyQGVHcm91cHMuY29tPg=="},"prevInTopic":95193,"nextInTopic":95213,"prevInTime":95195,"nextInTime":95197,"topicId":27787,"numMessagesInTopic":0,"msgSnippet":"... room. Julie, Perhaps it would help to have a discussion, either on paper or in person, about how to meet everyone s needs.  Your husband (and assumingly","messageBody":"<div id=\"ygrps-yiv-166571667\"><blockquote><span title=\"ireply\">&gt; My son is resistant to this idea. He doesn&#39;t want anyone in his <br/>\n </span></blockquote>room.<br/>\n<br/>\nJulie, <br/>\n<br/>\nPerhaps it would help to have a discussion, either on paper or in <br/>\nperson, about how to meet everyone&#39;s needs.  Your husband (and <br/>\nassumingly your own) needs are that your son&#39;s room is reasonably <br/>\nclean.  I think changing the sheets and vaccuming twice a year isn&#39;t <br/>\nan unreasnable standard of cleanliness.  :-)<br/>\n<br/>\nYour son needs his space, and to know that it&#39;s HIS.  <br/>\n<br/>\nAfter discussing it, it is likely (though not absolute) that you can <br/>\ncome up with a solution that meets everyone&#39;s needs -- either he <br/>\ndoes the basic housekeeping your husband wants to do, or takes time <br/>\nto box up personal items before someone else does the housekeeping, <br/>\nor you do it together, etc.  But if you approach it as &quot;We have a <br/>\nproblem.  Here are my needs, here are yours, how can we compromise?&quot; <br/>\nlooking for a true compromise you likely will find one.  <br/>\n<br/>\nJMO. <br/>\n<br/>\nKristi</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Bedrooms","postDate":"1086404607","msgId":95193,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFlNS4yMjFmOWI5Zi4yZGYyOTFmZkBhb2wuY29tPg=="},"prevInTopic":95191,"nextInTopic":95196,"prevInTime":95192,"nextInTime":95194,"topicId":27787,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/4/04 8:47:59 PM, julie@bravewriter.com writes: ","messageBody":"<div id=\"ygrps-yiv-116380369\">In a message dated 6/4/04 8:47:59 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:julie@...\">julie@...</a> writes:<br/>\n<br/>\n&lt;&lt; My <br/>\n<br/>\nhusband wants to clean it for him once (said he isn&#39;t out to shame our son or <br/>\nanything, <br/>\n<br/>\nbut just wants to get in there and vacuum, change the sheets, dust, wash the <br/>\nwindows, <br/>\n<br/>\netc.). He wouldn&#39;t put things away, just move them to a big box or two while <br/>\nhe cleans up. &gt;&gt;<br/>\n<br/>\nI help a kid clean up sometimes, or I&#39;ll tell Kirby I want to vacuum, and ask <br/>\nhim to clean off the floor.   Sometimes Holly and I do some straightening <br/>\nwhile he&#39;s gone, in exchane for using his computer so much.  And sometimes I <br/>\nclean his shower or toilet.<br/>\n<br/>\n-=-My husband feels that he should be free to clean it up once every six <br/>\nmonths or so since the conditon of the house matters to him.<br/>\n<br/>\n-=-Any suggestions for how to handle this?-=-<br/>\n<br/>\nPlan a project weekend to work on it as a family maybe?<br/>\nTell him that clutter&#39;s not the problem so  much as damage to the carpet or <br/>\nfloor from going too long without cleaning (or whatever).<br/>\n<br/>\nSandra<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":77522235,"authorName":"Julie Bogart","from":"&quot;Julie Bogart&quot; &lt;julie@...&gt;","profile":"juliecinci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Bedrooms","postDate":"1086403466","msgId":95191,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM5cmMyYSs1NXFyQGVHcm91cHMuY29tPg=="},"prevInTopic":28366,"nextInTopic":95193,"prevInTime":95190,"nextInTime":95192,"topicId":27787,"numMessagesInTopic":0,"msgSnippet":"We have not required that the kids maintain their bedrooms to any kind of standard. Consequently, we have a variety of bedroom conditions. There are two kids","messageBody":"<div id=\"ygrps-yiv-434996314\">We have not required that the kids maintain their bedrooms to any kind of standard. <br/>\nConsequently, we have a variety of bedroom conditions. There are two kids who love to <br/>\nkeep things neat, but the rest don&#39;t.<br/>\n<br/>\nMy oldest (almost 17) has such a messy room that you can&#39;t cross the floor without <br/>\nwalking all over things (guitar, music, CDs, books. clthes, shoes, sports gear...). My <br/>\nhusband wants to clean it for him once (said he isn&#39;t out to shame our son or anything, <br/>\nbut just wants to get in there and vacuum, change the sheets, dust, wash the windows, <br/>\netc.). He wouldn&#39;t put things away, just move them to a big box or two while he cleans up.<br/>\n<br/>\nMy son is resistant to this idea. He doesn&#39;t want anyone in his room.<br/>\n<br/>\nMy husband feels that he should be free to clean it up once every six months or so since <br/>\nthe conditon of the house matters to him.<br/>\n<br/>\nAny suggestions for how to handle this?<br/>\n<br/>\nJulie B</div>","specialLinks":[]},{"userId":0,"authorName":"Sharon Rudd","from":"Sharon Rudd &lt;bearspawprint@...&gt;","profile":"bearspawprint","replyTo":"LIST","senderId":"OK2GIShUzgLHJ5VCVs_Zfp6uHzZrp5IYUa20uWZBzmGwB2DK26OI5acklob_E-t7Qaopi2sNJvuKxm3cqJ6wBXyZHi3TJVuDSUD9kg","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Bedrooms","postDate":"1006531208","msgId":28366,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDExMTIzMTYwMDA4Ljk1NTMyLnFtYWlsQHdlYjE0MzAzLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDIwMDExMTE3LjEwMzkyMi4tOTI3ODg5LjYucnVtcGxldGVhc2VybW9tQGp1bm8uY29tPg=="},"prevInTopic":27855,"nextInTopic":95191,"prevInTime":28365,"nextInTime":28367,"topicId":27787,"numMessagesInTopic":0,"msgSnippet":"I personally think it doubled in size ... Stuff DOES have that property.  It DOES double in size while being transported.  Also furniture adds one to three","messageBody":"<div id=\"ygrps-yiv-1688618532\">I personally think it doubled in size<br/>\n<blockquote><span title=\"ireply\"> &gt; while being transported.<br/>\n<br/>\n&gt; Bridget<br/>\n<br/>\n </span></blockquote>Stuff DOES have that property.  It DOES double in size<br/>\nwhile being transported.  Also furniture adds one to<br/>\nthree inches in either width or depth, blue modifies<br/>\nto green and brown becomes purple. <br/>\n<br/>\nA feature of new homes is that helpful things like<br/>\nlight swtches seem to move around on their own.<br/>\nCupboard conntents switch with the closets and<br/>\ncommmodes only stay exactly where they were if you<br/>\nturn on the light.<br/>\n<br/>\nSharon<br/>\n<br/>\n__________________________________________________<br/>\nDo You Yahoo!?<br/>\nYahoo! GeoCities - quick and easy web site hosting, just $8.95/month.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://geocities.yahoo.com/ps/info1\">http://geocities.yahoo.com/ps/info1</a></div>","specialLinks":[]},{"userId":0,"authorName":"Bridget E Coffman","from":"Bridget E Coffman &lt;rumpleteasermom@...&gt;","profile":"rumpleteasermom","replyTo":"LIST","senderId":"6ryDE-6aI5P6y888Uq-xMT2kQgLsZJNDOhsbnjw8iD_AaMCbg5n_l_hSuOOSDLMS0JWreYhW8rlxVyjLxl9q-RqH5z4-bKjMADam_BNBMYhXmr8","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Bedrooms","postDate":"1006011540","msgId":27855,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDExMTE3LjEwMzkyMi4tOTI3ODg5LjYucnVtcGxldGVhc2VybW9tQGp1bm8uY29tPg=="},"prevInTopic":27835,"nextInTopic":28366,"prevInTime":27854,"nextInTime":27856,"topicId":27787,"numMessagesInTopic":0,"msgSnippet":"I have three kids and when we had two rooms for them, they chose who was where.  They moved around occassionally.  I used to get lots of comments from well","messageBody":"<div id=\"ygrps-yiv-1749826130\">I have three kids and when we had two rooms for them, they chose who was<br/>\nwhere.  They moved around occassionally.  I used to get lots of comments<br/>\nfrom well meaning strangers that I should put the girls in a room<br/>\ntogether and my son by himself.  Problem was my oldest really needed her<br/>\nown space some of the time.  I just let them work it out and they did.  <br/>\nHowever, I must admit it is great to be in a bigger house where everyone<br/>\nhas space.  <br/>\n<br/>\nWe all have space intensive hobbies and keeping Rachel&#39;s music and<br/>\nJenni&#39;s books and puzzles and Wyndham&#39;s trains sorted out is great.  (Not<br/>\nthat they  don&#39;t share, just that they can find it all now!)  Of course<br/>\nthen there are Ron&#39;s radios and my craft stuff (which gets &#39;borrowed&#39;<br/>\nmore than anything else in the house!  All in all, we have managed to<br/>\nfill this four 1/2 bedroom house with full walk-out basement in no time<br/>\nflat!  We moved from a house half this size and when we had about half<br/>\nthe stuff moved one of our friends can over and said, &quot;Wow, you must be<br/>\nabout done.&quot;  He was astounded when we told him how much more there was<br/>\nto move.  I personally think it doubled in size while being transported.<br/>\n<br/>\nSorry to ramble a bit!<br/>\n<br/>\nBridget<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;    Date: Fri, 16 Nov 2001 20:50:54 -0600<br/>\n&gt;    From: &quot;Allison Crilly&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AllisonC@...\">AllisonC@...</a>&gt;<br/>\n&gt; Subject: Re: Bedrooms<br/>\n&gt; <br/>\n&gt; My father was 4th of 9.  He grew up in Belfast in a tiny row house <br/>\n&gt; with 3 bedrooms, all of them about 8&#39; by 10&#39;.  The boys had one room <br/>\n&gt; (and bed,) the girls shared another room and bed, and the two <br/>\n&gt; youngest at the time slept in their parents room, the baby in bed <br/>\n&gt; (to nurse) and the toddler in a dresser drawer (the drawer was on <br/>\n&gt; the floor, though, not in the dresser! LOL)  I spent about year or <br/>\n&gt; so of my life in a drawer, my parents moved to Canada just before I <br/>\n&gt; was born, and didn&#39;t bring any baby furniture.  Since I was the 4th <br/>\n&gt; and last, they didn&#39;t want to buy a crib, so I slept in the drawer <br/>\n&gt; until I was big enough to move into my sister&#39;s bed.  <br/>\n&gt; <br/>\n&gt; My sister and I shared a room, but my brothers each had their own, <br/>\n&gt; specifically because they were boys.  Neither my sister nor I have <br/>\n&gt; gotten over this injustice, LOL.<br/>\n&gt; <br/>\n&gt; I&#39;m assuming my son will be interested in his own room when he gets <br/>\n&gt; interested in bringing someone there.  Until then, I have a <br/>\n&gt; permanent roommate.<br/>\n&gt; <br/>\n&gt; Allison<br/>\n<br/>\n </span></blockquote>^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^<br/>\n     In three words I can sum up everything I&#39;ve learned about life: it<br/>\ngoes on.<br/>\n                                                     - Robert Frost</div>","specialLinks":[]},{"userId":0,"authorName":"Allison Crilly","from":"&quot;Allison Crilly&quot; &lt;AllisonC@...&gt;","profile":"meeloca","replyTo":"LIST","senderId":"HL1Wzv_BxYd0uTSZENHDpYAG_yW6ebC4D2JAdKYIb7QYTkCVgiLsySALnLoUot0rArq0fBGeAXRxsT2fGRaKdvxTvnAhaCAkXgfAw-pFVoE1Sg","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Bedrooms","postDate":"1005965454","msgId":27835,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAyZTEwMWMxNmYxMiRhZGNiZTVjMCQ1YzRiODJkOEBzaGVycnloYW1lPg==","referencesHeader":"PDIwMDExMTE2LjA5MjMwMi4tNzUwNzI5LjMucnVtcGxldGVhc2VybW9tQGp1bm8uY29tPg=="},"prevInTopic":27787,"nextInTopic":27855,"prevInTime":27834,"nextInTime":27836,"topicId":27787,"numMessagesInTopic":0,"msgSnippet":"My father was 4th of 9.  He grew up in Belfast in a tiny row house with 3 bedrooms, all of them about 8 by 10 .  The boys had one room (and bed,) the girls","messageBody":"<div id=\"ygrps-yiv-1679169537\">My father was 4th of 9.  He grew up in Belfast in a tiny row house with 3 bedrooms, all of them about 8&#39; by 10&#39;.  The boys had one room (and bed,) the girls shared another room and bed, and the two youngest at the time slept in their parents room, the baby in bed (to nurse) and the toddler in a dresser drawer (the drawer was on the floor, though, not in the dresser! LOL)  I spent about year or so of my life in a drawer, my parents moved to Canada just before I was born, and didn&#39;t bring any baby furniture.  Since I was the 4th and last, they didn&#39;t want to buy a crib, so I slept in the drawer until I was big enough to move into my sister&#39;s bed.  <br/>\n<br/>\nMy sister and I shared a room, but my brothers each had their own, specifically because they were boys.  Neither my sister nor I have gotten over this injustice, LOL.<br/>\n<br/>\nI&#39;m assuming my son will be interested in his own room when he gets interested in bringing someone there.  Until then, I have a permanent roommate.<br/>\n<br/>\nAllison<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: Bridget E Coffman <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a> <br/>\n  Sent: Friday, November 16, 2001 8:15 AM<br/>\n  Subject: Re: [Unschooling-dotcom] Bedrooms<br/>\n<br/>\n<br/>\n  My mom was one of seven.  They had a four bedroom house.  Here was the<br/>\n  breakdown:<br/>\n  1.  Mom and dad&#39;s room<br/>\n  2.  Oldest son&#39;s room<br/>\n  3.  Two youngest boys room<br/>\n  4.  the four girls adn Aunt Gert<br/>\n  Sound fair?  So why the heck did the oldest son get his own room when<br/>\n  there were FIVE people in one room?  Because Aunt Gert insisted on it.  I<br/>\n  never understood that!<br/>\n<br/>\n  Bridget - whose kids would never would have put up with that!<br/>\n<br/>\n  &gt; <br/>\n  &gt; I had a friend who thought it was child abuse to make my kids  share<br/>\n  &gt; a room. In her words, &quot;If you can&#39;t afford a room for each kid,  then<br/>\n  you<br/>\n  &gt; can&#39;t afford the kids!&quot; Sheesh.<br/>\n  &gt; <br/>\n  ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^<br/>\n       In three words I can sum up everything I&#39;ve learned about life: it<br/>\n  goes on.<br/>\n                                                       - Robert Frost<br/>\n<br/>\n        Yahoo! Groups Sponsor <br/>\n              ADVERTISEMENT<br/>\n             <br/>\n       <br/>\n       <br/>\n<br/>\n  Message boards, timely articles, a free newsletter and more!<br/>\n  Check it all out at: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n<br/>\n  To unsubscribe, set preferences, or read archives:<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.egroups.com/group/Unschooling-dotcom\">http://www.egroups.com/group/Unschooling-dotcom</a><br/>\n<br/>\n  Another great list sponsored by Home Education Magazine!<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com\">http://www.home-ed-magazine.com</a> <br/>\n<br/>\n<br/>\n<br/>\n  Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":0,"authorName":"Bridget E Coffman","from":"Bridget E Coffman &lt;rumpleteasermom@...&gt;","profile":"rumpleteasermom","replyTo":"LIST","senderId":"-YQH2yywKJOINi7dzSEgCYJa1qow1cMCjkgKHzsFFfTCr9omyIkSmUljDqfmcBXkm4TIBosarMldUrFvKUuQcUR7iHBUy2FG1EsCXvsTIR0-Ipo","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Bedrooms","postDate":"1005920128","msgId":27787,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDExMTE2LjA5MjMwMi4tNzUwNzI5LjMucnVtcGxldGVhc2VybW9tQGp1bm8uY29tPg=="},"prevInTopic":0,"nextInTopic":27835,"prevInTime":27786,"nextInTime":27788,"topicId":27787,"numMessagesInTopic":0,"msgSnippet":"My mom was one of seven.  They had a four bedroom house.  Here was the breakdown: 1.  Mom and dad s room 2.  Oldest son s room 3.  Two youngest boys room 4.","messageBody":"<div id=\"ygrps-yiv-1609421656\">My mom was one of seven.  They had a four bedroom house.  Here was the<br/>\nbreakdown:<br/>\n1.  Mom and dad&#39;s room<br/>\n2.  Oldest son&#39;s room<br/>\n3.  Two youngest boys room<br/>\n4.  the four girls adn Aunt Gert<br/>\nSound fair?  So why the heck did the oldest son get his own room when<br/>\nthere were FIVE people in one room?  Because Aunt Gert insisted on it.  I<br/>\nnever understood that!<br/>\n<br/>\nBridget - whose kids would never would have put up with that!<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; I had a friend who thought it was child abuse to make my kids  share<br/>\n&gt; a room. In her words, &quot;If you can&#39;t afford a room for each kid,  then<br/>\n </span></blockquote>you<br/>\n<blockquote><span title=\"ireply\"> &gt; can&#39;t afford the kids!&quot; Sheesh.<br/>\n&gt; <br/>\n </span></blockquote>^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^<br/>\n     In three words I can sum up everything I&#39;ve learned about life: it<br/>\ngoes on.<br/>\n                                                     - Robert Frost</div>","specialLinks":[]}],"prevTopicId":95367,"nextTopicId":95402}}