{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":8226888,"authorName":"the_clevengers &lt;diamondair@email.msn.com&gt;","from":"&quot;the_clevengers &lt;diamondair@...&gt;&quot; &lt;diamondair@...&gt;","profile":"the_clevengers","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: new to the list and can you tell me what you did today?","postDate":"1044580658","msgId":58164,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGIxdjFmaStqNjJkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDNFNDJERjIwLkQ0OTUzOEVDQHZlcml6b24ubmV0Pg=="},"prevInTopic":58133,"nextInTopic":0,"prevInTime":58163,"nextInTime":58165,"topicId":58125,"numMessagesInTopic":0,"msgSnippet":"... Our day today (most times approximate): 6:55 - I get up, thinking I ll get some email time before the kids get up. Make tea, fire up computer 7:10 - Kids","messageBody":"<div id=\"ygrps-yiv-2092628380\"><blockquote><span title=\"ireply\">&gt;From: &quot;from Tyra&quot; &lt;mtwalte@p...&gt;<br/>\n&gt; &lt;&lt;Can you tell me what you did today?&gt;&gt;<br/>\n<br/>\n </span></blockquote>Our day today (most times approximate):<br/>\n<br/>\n6:55 - I get up, thinking I&#39;ll get some email time before the kids <br/>\nget up. Make tea, fire up computer<br/>\n7:10 - Kids get up, they play with Paintbrush on their computer while <br/>\nI finish up email<br/>\n7:30 - Kids and I make pancakes, DH heads off to work<br/>\n8:15 - Kids and I clean up kitchen after breakfast, they go off to <br/>\nplay upstairs. Son builds &quot;Transformer Dinosaur&quot; out of Legos that <br/>\nbecomes a &quot;prehistoric walking whale&quot;<br/>\n9:15 - We get dressed and ready to bicycle to the pool<br/>\n10:00 - Free play time at the pool<br/>\n10:30 - Daughter has her swim lesson, my son and I work on his <br/>\nfreestyle swimming. He jumps into the deep end and swims to the side <br/>\nfor the first time. Yay!<br/>\n11:00 - Hot tub and showers, then we have a picnic lunch on the deck <br/>\noverlooking the pool<br/>\n12:15 - Kids go into the childcare area. Daughter paints and draws, <br/>\nson builds enormous Lego castle contraption. I cycle and run<br/>\n2:00 - Pick up kids from childcare. Go to library<br/>\n3:30 - Home. Kids build &quot;Train Race Ramp&quot; on our driveway with Brio <br/>\ntrain tracks and trains. I make salad dressing, cook yams, and thaw <br/>\nTofurkey for dinner. Work in garden, kids help.<br/>\n4:00 - Kids decide to join me making yeast bread. DH home from work <br/>\nand goes for a run<br/>\n4:30 - Bread rising, I chop wood, daughter and son work together to <br/>\ncrumple newspaper and lay down kindling for fire. I light fire.<br/>\n5:00 - I check email, print out chapters I need to read for writer&#39;s <br/>\ngroup. Kids want to know how yeast works. I find a webpage with <br/>\nseveral different experiments <br/>\n5:15 - I read/edit chapters and have some tea. Son is making a &quot;Pin <br/>\nthe tail on the donkey&quot; game. Daughter is playing with toy snakes<br/>\n6:00 - I&#39;ll put the bread in the oven, finish dinner. DH and the kids <br/>\nwill eat. I&#39;ll leave for my writer&#39;s group. DH will do one of the <br/>\nyeast experiments with the kids, then he will most likely wrestle <br/>\nwith the kids and have bounce session on the bed (their favorite <br/>\nevening activity) then settle down for story reading. The kids will <br/>\nmost likely be asleep by the time I get home (10:00). DH and I will <br/>\nwatch a movie.<br/>\n<br/>\nIn general, we have no &quot;typical&quot; days, although there are days of the <br/>\nweek when we often go to the same scheduled activities (tomorrow, for <br/>\ninstance, we will go to our Homeschool group&#39;s play time at the <br/>\ngymnastics center). We also have several things that usually happen <br/>\nin any given day, like reading books is pretty much a constant. And <br/>\nsome days we try to take advantage of the weather if it&#39;s nice, <br/>\ntaking a hike or going flying or bicycling or to the snow. What the <br/>\nkids do whenever they&#39;re at home is always different, and depends on <br/>\nwhat they&#39;re into at the moment. In general, my son is very into <br/>\nLegos, and creating all sorts of experiments and projects. His <br/>\ngreatest desire is to build a RUbe Goldberg-type device, and I think <br/>\nthat&#39;s what he&#39;s turning his room into. My daughter is into music. <br/>\nShe is often listening to music on her tape player, playing it on the <br/>\npiano, recorder, harmonica, or whatever she can find, or singing. She <br/>\nsings about 8 hours a day, I swear! It sounds like Rogers & <br/>\nHammerstein around here most of the time :-)<br/>\n<br/>\nBlue Skies,<br/>\n-Robin-</div>","specialLinks":[]},{"userId":112038769,"authorName":"Shyrley","from":"Shyrley &lt;shyrley.williams@...&gt;","profile":"bobalinga","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] new to the list and can you tell me what you  did today?","postDate":"1044569889","msgId":58133,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNFNDJERjIwLkQ0OTUzOEVDQHZlcml6b24ubmV0Pg==","referencesHeader":"PEYyOEs2S0YyMTFUcHI5ZTVzVHcwMDAxMzMwNUBob3RtYWlsLmNvbT4="},"prevInTopic":58125,"nextInTopic":58164,"prevInTime":58132,"nextInTime":58134,"topicId":58125,"numMessagesInTopic":0,"msgSnippet":"... My day started unusually early. Bryn (9)  charged into my bedroom at 8 am to tell me what he learned about Venus and Mercury. He was clutching a DK Guide","messageBody":"<div id=\"ygrps-yiv-1083131367\"><blockquote><span title=\"ireply\">&gt; &gt;From: &quot;from Tyra&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mtwalte@...\">mtwalte@...</a>&gt;<br/>\n&gt;<br/>\n&gt; &lt;&lt;Can you tell me what you did today?&gt;&gt;<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>My day started unusually early. Bryn (9)  charged into my bedroom at 8 am to tell me what he learned about Venus and Mercury. He was clutching a DK Guide to Space and proceeded to read it out loud.<br/>\nHeather (10) came in an hour later to show me the new doll&#39;s dress she has sewn. I managed to get another hours doze while they went downstairs.<br/>\nOnce I got up Rhodri played on the PS while Bryn printed out maths worksheets from the web. Heather sat reading one of the endless Anne of Green Gables books (either she&#39;s re-reading them or there&#39;s an<br/>\nawful lot).<br/>\nBryn sat at the table and did the worksheets while I tidied away breakfast and drank coffee.<br/>\nRhodri got out the cuisinaire rods and made towers with them :-) while Heather played the PS. Bryn went back to his space book and then surfed the NASA web site which prevented me from reading email so<br/>\nI fixed my bicycle.<br/>\nRhodri and I then went for a walk round the neighbourhood and watched kids get on the 11.30 school bus.<br/>\nAfter lunch, we went to a homeschooling drama class at the local library. Bryn didn&#39;t want to do it so we went to the supermarket while the other two did the class.<br/>\nSince we got back I&#39;ve been playing on the PC while the kids made snowflakes out of paper and Bryn finsihed his maths (he wants to be a mission controller for NASA which is why he&#39;s hot on maths this<br/>\nweek).<br/>\n<br/>\nPretty typical day for us. Sometimes we see people (though rare as nearly everyone is a School at home type), sometimes we go to the museums in DC. Bryn wants to go to the Air and Space museum as soon<br/>\nas possible.<br/>\nBasically the kids do what they want. Sometimes that involves me, sometimes it doesn&#39;t.<br/>\n<br/>\nShyrley</div>","specialLinks":[]},{"userId":99826381,"authorName":"Mary Bianco","from":"&quot;Mary Bianco&quot; &lt;mummyone24@...&gt;","profile":"mummyone24","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] new to the list and can you tell me what you did today?","postDate":"1044568185","msgId":58125,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYyOEs2S0YyMTFUcHI5ZTVzVHcwMDAxMzMwNUBob3RtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":58133,"prevInTime":58124,"nextInTime":58126,"topicId":58125,"numMessagesInTopic":0,"msgSnippet":"...  Joseph (8) and Sierra (7) were up before Alyssa (2) and I were. They were out playing battleship for about almost","messageBody":"<div id=\"ygrps-yiv-485619175\"><blockquote><span title=\"ireply\">&gt;From: &quot;from Tyra&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mtwalte@...\">mtwalte@...</a>&gt;<br/>\n<br/>\n </span></blockquote>&lt;&lt;Can you tell me what you did today?&gt;&gt;<br/>\n<br/>\n<br/>\nJoseph (8) and Sierra (7) were up before Alyssa (2) and I were. They were <br/>\nout playing battleship for about almost an hour. Then Sierra went on the <br/>\ncomputer, Alyssa and I went outside with the dogs and Joseph went in his <br/>\nroom working on his drawings. Sierra ate at the computer and Joseph and <br/>\nAlyssa joined her, watching and eating as well. Joseph finished and went and <br/>\nwatched Stanley on TV, then back to his drawings. Alyssa and I watched <br/>\ndiscovery health, babies being born. The I read to her while Sierra was <br/>\nstill on the computer. She finished and went to play, Alyssa left with her. <br/>\nI&#39;m getting my mail, talking with my oldest Tara (17) and cleaning as usual. <br/>\nAll 3 kids have been back and forth between Joseph&#39;s room and the girls&#39; <br/>\nroom&#39;s. They have out dolls, beads, games and are playing movies. I told <br/>\nthem last night that today was a stay home day all day long. I think they <br/>\nwere looking forward to it as they have been busy and playing and pretty <br/>\nquiet. It&#39;s almost 5:00 and they have been happily playing since about 10:00 <br/>\nthis morning. TV hasn&#39;t been on since Joseph turned off Stanley. oops. just <br/>\nheard the Tv in the playroom come on. Joseph and Sierra are seeing what&#39;s on <br/>\nand Alyssa is at my side. I asked them what they were playing before and it <br/>\nturns out they both made up a card game that entails building structures and <br/>\nsaving people all at the same time.<br/>\n<br/>\nToo all my relatives and most friends, it would sound like they did <br/>\nabsolutely nothing all day. Most days of ours are like that. But we know <br/>\ndifferent!<br/>\n<br/>\n<br/>\n<br/>\n&lt;&lt;Can  you tell me your definition of unschooling?  Do you use any workbook <br/>\nat all or is that what unschooling is all about?&gt;&gt;<br/>\n<br/>\n<br/>\nJoseph and Sierra have asked for workbooks on occasion. It came from them <br/>\nasking for things to do when they were starting to read. I printed out some <br/>\nsheets from the internet and asked if that&#39;s what they wanted. It was and <br/>\nwhen we found workbooks that were similar, they would use those too. The <br/>\nlast sheet or workbook was about a year ago. Haven&#39;t picked one up since. If <br/>\nthey would ask again, I would get them but I don&#39;t go out and buy them and <br/>\nhave them laying around trying to entice. &lt;BG&gt; It&#39;s all a matter of what <br/>\nthey want and what they are interested in.<br/>\n<br/>\nMary B<br/>\n<br/>\n<br/>\n_________________________________________________________________<br/>\nProtect your PC - get McAfee.com VirusScan Online  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://clinic.mcafee.com/clinic/ibuy/campaign.asp?cid=3963\">http://clinic.mcafee.com/clinic/ibuy/campaign.asp?cid=3963</a></div>","specialLinks":[]}],"prevTopicId":58137,"nextTopicId":58166}}