{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Thoughts on grades and teaching...","postDate":"1116374789","msgId":105968,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFlMy4zYzBjMDcwMi4yZmJiZTEwNUBhb2wuY29tPg=="},"prevInTopic":105967,"nextInTopic":0,"prevInTime":105967,"nextInTime":105969,"topicId":105967,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/17/2005 5:47:40 PM Mountain Daylight Time, bacwoodz@earthlink.net writes: I also  had begun teaching myself to sew ======== Learning how","messageBody":"<div id=\"ygrps-yiv-1789414981\">In a message dated 5/17/2005 5:47:40 PM Mountain Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:bacwoodz@...\">bacwoodz@...</a> writes:<br/>\n<br/>\nI also  had begun teaching myself to sew <br/>\n<br/>\n<br/>\n========<br/>\n <br/>\nLearning how to sew? &lt;g&gt;<br/>\n <br/>\n-=- I think if I get to the point that I believe that they can really learn  <br/>\nwhatever it is that they want to perhaps I will believe that I can to - <br/>\nwithout  school..... <br/>\n-=-<br/>\n <br/>\nYou could learn yours first and then trust theirs, though.  Think back  to <br/>\nother things you&#39;ve learned on your own, for fun, joyfully, without even  <br/>\nnoticing what you were learning.  If you wait until your kids are grown and  prove <br/>\nto you that unschooling worked you&#39;ll have waited too long!<br/>\n <br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":60283004,"authorName":"Heather Woodward","from":"&quot;Heather Woodward&quot; &lt;bacwoodz@...&gt;","profile":"bacwoodz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Thoughts on grades and teaching...","postDate":"1116373320","msgId":105967,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNWYwMWM1NWIzYSQwNjI4OTFjMCRiMTUyNzlhNUBoZWF0aGVydXB4ZzZsZT4=","referencesHeader":"PDI1LjVmYTVjNjExLjJmYmJiNGRjQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":105968,"prevInTime":105966,"nextInTime":105968,"topicId":105967,"numMessagesInTopic":0,"msgSnippet":"One of the most profound thing I am learning as I am unschooling my children is how I personally still respond to the schoolish ideas wihtin myself. I have","messageBody":"<div id=\"ygrps-yiv-116557056\">One of the most profound thing I am learning as I am unschooling my children is how I personally still respond to the &quot;schoolish&quot; ideas wihtin myself. I have been having a hard time with graduate school and the whole &quot;grades&quot; issue. There are some classes where I would say that given all that I had going on in life while I was trying to take a class - a B was acceptable... then I have classes where I feel that I have learned so much and really have progressed - and still the same B. and I get frustrated -which a fellow unschooling mother pointed out is really silly when I think about how I would respond to my child in the same situation. I know how subjective grades are - and how they mean little in terms of identifying what I learned. But it has been ingrained in me that success goes with grades - etc. and because I didn&#39;t get an A - I must suck.<br/>\n<br/>\nI have been reading Grace Llewelyn&#39;s Teenage Liberation Handbook - and find it very relevant to myself as an adult. She mentions getting a test or class done so that on can move on to the things they really want to learn/read. I am feeling that way right know and enjoying Grace Llewelyn far more than Strategic Management texts. This is all causing me to have some real thought about what authentic success is and if I wish to continue this current path... <br/>\n<br/>\nI also had begun teaching myself to sew and had finally finished a skirt... and was rather happy with my progress. So I went to the fabric store and got a pattern and had my daughters pick out some fabric they liked for a dress. Well, my mil was visiting(she can sew very well), and she took over my project by &quot;showing&quot;: and &quot;doing&quot; for me rather than letting me just figure it out. I got frusterated with the forced nature of this and she basically finished - and went on to make two more dresses and a pant set for the girls. (Which are all very nice - but I&#39;ll have to wait until she leaves to try and fiugure out my dress) How often this must happen with my kids. Perhaps they just want to experiment until they figure out whatever it is they are working on.... and here I am &quot;helping&quot; them when perhaps the help wasn&#39;t asked for. It is so obvious how this can cruch the spirit or desire to learn something new if they really feel inside &quot;Just leave me alone to figure it out!&quot; Actually the interesting thing with my mil was that she shared that when she was in school she was learning to sew and her mother would undo and redo all of her projects before she handed them in at school.. ugh - I&#39;m surprised she continued to learn as well as she did.<br/>\n<br/>\nIn any case - as an adult I haven&#39;t given unschooling myself much thought. I sometimes feel that I struggle sometimes to really believe that my kids will learn what they need to. However, as I watch them playing it is amazing how much they are enjoying life and being outside, cooking and gardening. They are so enthusiastic about it all. Thankfully they have never been to school - and hopefully they won&#39;t have to go through these stupid adult grade induced feelings of inferiority with regard to learning that I do at times. I think if I get to the point that I believe that they can really learn whatever it is that they want to perhaps I will believe that I can to - without school..... <br/>\n<br/>\nHeather<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":105966,"nextTopicId":105955}}