{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":3889224,"authorName":"Genevieve Labonté","from":"=?iso-8859-1?Q?Genevieve_Labont=E9?= &lt;fihz@...&gt;","profile":"fihz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] Anneo&#39;s response to Genevieve","postDate":"1073667110","msgId":88249,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMGIwMWMzZDZkMCRlODNmNGNiMCQ2NTAxYThjMEBkZWxsNDEwMD4=","inReplyToHeader":"PDE1Yy4yYWE3ZTcxNC4yZDJmMDE0OUBhb2wuY29tPg=="},"prevInTopic":88171,"nextInTopic":0,"prevInTime":88248,"nextInTime":88250,"topicId":88167,"numMessagesInTopic":0,"msgSnippet":"Thank you Anne for taking the time to post this, it s truely beautiful! I ve read everything everyone posted about my post, and about the food issue that was","messageBody":"<div id=\"ygrps-yiv-1506273497\">Thank you Anne for taking the time to post this, it&#39;s truely beautiful!<br/>\nI&#39;ve read everything everyone posted about my post, and about the food<br/>\nissue that was following, and it&#39;s helped alot.  I guess I needed to<br/>\nhear what I was feeling but that everyone around me was going against.<br/>\nI am responding more to him, his needs and his frustrations, and things<br/>\nhave improved a lot.  I don&#39;t know if it&#39;s my perception or his<br/>\nbehavior, but it&#39;s SO good to feel the connection slowly coming back! He<br/>\nIS a glowing person, but I guess I was shading him out, just because I<br/>\ndidn&#39;t know how to take him, and everyone&#39;s great reassurance and ideas<br/>\nhave helped tremendously.<br/>\n <br/>\n <br/>\nI must say though, that we don&#39;t &quot;do&quot; school work,  and the reference to<br/>\nthe school board, is because Felix went to Kindergarten last year, and<br/>\nis listed in the school board.  I sent a letter telling his he&#39;d be<br/>\nhomeschooled this year, but am keeping what I find around the house(<br/>\nthat would otherwise end up in recycling) just in case I get asked what<br/>\ndid he do this year.  They&#39;re quite unsure about the homeschooling thing<br/>\nand our region had quite bad problems with other families (although I<br/>\ndidn&#39;t yet), so it&#39;s mostly for covering in case there&#39;s something.<br/>\nJonathan is not and WILL NOT be  listed since he won&#39;t go to school and<br/>\nwe won&#39;t have those problems... luckily!<br/>\n <br/>\nTHANK YOU, every idea is appreciated, <br/>\n <br/>\nGenevieve<br/>\n <br/>\n<br/>\n<br/>\n<br/>\nLive AS IF school does not exist.  <br/>\n<br/>\nFear must be released in order for Joy, Life, and Real Learning to<br/>\nenter.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":128695025,"authorName":"Wife2Vegman","from":"Wife2Vegman &lt;wifetovegman2002@...&gt;","profile":"wifetovegman2002","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Anneo&#39;s response to Genevieve","postDate":"1073592240","msgId":88171,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwMTA4MjAwNDAwLjI3OTY3LnFtYWlsQHdlYjQxNDA2Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDE1Yy4yYWE3ZTcxNC4yZDJmMDE0OUBhb2wuY29tPg=="},"prevInTopic":88167,"nextInTopic":88249,"prevInTime":88170,"nextInTime":88172,"topicId":88167,"numMessagesInTopic":0,"msgSnippet":"... YES!  Yes Yes YES! ... What an incredible, awesome post this is.  Genevieve isn t the only one who needed to hear this today. Thank you from the bottom of","messageBody":"<div id=\"ygrps-yiv-1242607837\">--- <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kbcdlovejo@...\">kbcdlovejo@...</a> wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Fear must be released in order for Joy, Life, and<br/>\n&gt; Real Learning to enter.<br/>\n<br/>\n </span></blockquote>YES!  Yes Yes YES!<br/>\n<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; Genevieve, what does Jonathan love to do?  Where<br/>\n&gt; does he SHINE?  When, in <br/>\n&gt; life, is he able to see himself shining in his Mom&#39;s<br/>\n&gt; eyes?  Because I&#39;m reading <br/>\n&gt; about how he is frustrating you...and I&#39;m sure there<br/>\n&gt; are times when he does <br/>\n&gt; SHINE...but it&#39;s absent from this post.<br/>\n<br/>\n<br/>\n </span></blockquote>What an incredible, awesome post this is.  Genevieve<br/>\nisn&#39;t the only one who needed to hear this today.<br/>\nThank you from the bottom of my heart.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; He needs <br/>\n&gt; to be celebrated for Who He Is, and not seen as a<br/>\n&gt; frustration.<br/>\n<br/>\n </span></blockquote>How hard it is for the mother of a spirited 5yo to see<br/>\nthis sometimes, to step back and, as Sandra says,<br/>\nbreathe.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; The cycle of frustration will end when you decide to<br/>\n&gt; let it end.  Focus on <br/>\n&gt; this child&#39;s true spirit.  Trust that he is in this<br/>\n&gt; world to bless you and teach <br/>\n&gt; you and share his gifts.  <br/>\n<br/>\n<br/>\n </span></blockquote>Ah, choices!  <br/>\n<br/>\nChoosing to focus positively instead of negatively. <br/>\nChoosing life instead of death.  Choosing a child&#39;s<br/>\ntrue spirit instead of what the world, which doesn&#39;t<br/>\nknow him at all, would say about him.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; He needs to know that he is fine just As<br/>\n&gt; He Is.  Once he feels <br/>\n&gt; loved and honored for those things that make him Who<br/>\n&gt; He Is, the rest of the <br/>\n&gt; &quot;behavior&quot; challenges will be minimized.  <br/>\n<br/>\n </span></blockquote>YES!  He is OK. <br/>\n<br/>\n<br/>\nWow, I am so incredibly blessed by this post.  I am<br/>\ngoing to print it out and leave the computer now, and<br/>\njust cherish this feeling for a while.<br/>\n<br/>\nThank you Anne.  Thank you.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n=====<br/>\n--Susan in VA<br/>\nWifetoVegman<br/>\n<br/>\nWhat is most important and valuable about the home as a base for children&#39;s growth into the world is not that it is a better school than the schools, but that it isn&#39;t a school at all.  John Holt<br/>\n<br/>\n__________________________________<br/>\nDo you Yahoo!?<br/>\nYahoo! Hotjobs: Enter the &quot;Signing Bonus&quot; Sweepstakes<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://hotjobs.sweepstakes.yahoo.com/signingbonus\">http://hotjobs.sweepstakes.yahoo.com/signingbonus</a></div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Anneo&#39;s response to Genevieve","postDate":"1073588041","msgId":88167,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1Yy4yYWE3ZTcxNC4yZDJmMDE0OUBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":88171,"prevInTime":88166,"nextInTime":88168,"topicId":88167,"numMessagesInTopic":0,"msgSnippet":"I sometimes wish that Anne would be on this list----and she s been absent lately on the boards (she just needs some time away to reconnect with her own ","messageBody":"<div id=\"ygrps-yiv-1286977543\">I sometimes wish that Anne would be on this list----and she&#39;s been absent <br/>\nlately on the boards (she just needs some time away to reconnect with her own <br/>\nfamily---BOY! Do *I* understand THAT! &lt;g&gt; I&#39;ve been taking my own break.), so I <br/>\nforwarded this message on to her for her imput. She didn&#39;t want to come here, <br/>\nbut she asked that I forward her response on.<br/>\n<br/>\n~Kelly<br/>\n<br/>\n<br/>\n***We&#39;ve been &quot;officially&quot; homeschooling since<br/>\nSeptember, but haven&#39;t really changed anything, except keep Felix&#39;s<br/>\ndrawings and all in case we get asked about them by the school board.***<br/>\n<br/>\nI was just talking about this to a woman who comes to my library program.  <br/>\nShe is a single homeschooling Mom and I usually try not to mix my unschooling <br/>\npassion with my library program, but everyone else had left and she was there <br/>\ntalking to me and I just could NOT listen to her tell me anymore about how she <br/>\nis only giving her daughter three worksheets a week instead of six, and how she <br/>\nwon&#39;t do math with her because she, the Mom, is so bad at math.<br/>\n<br/>\nI would CRINGE whenever something like that came out of her mouth, so I <br/>\nfinally said, &quot;Do you know about unschooling?&quot;  And I gave her the basic overview <br/>\nof unschooling...and she was very interested.  But she kept saying she wants <br/>\nsomething there in case the school system asks for documentation.  I told her I <br/>\nthought that wasn&#39;t very fair to her child because some states don&#39;t require <br/>\nANY homeschool reporting or documentation.  I said I would not punish my <br/>\nchildren with doing school just because we live in New York State and have to do <br/>\nquarterly reports.  She went off into a dreamy state and said she wishes she <br/>\ncould be like mutual friends of ours who homeschool underground and don&#39;t have to <br/>\nanswer to the system.  I told her she COULD.  <br/>\n<br/>\nLive AS IF school does not exist.  <br/>\n<br/>\nIf people put as much life&#39;s energy into living a rich, joyful life with <br/>\ntheir child as they put into worrying about what the schools believe our children <br/>\nshould be learning, then the children would be getting LOADS more than the <br/>\nchildren in school were getting...and in many more ways than just academia.  But <br/>\nsome parents are so consumed with comparing their children, worrying about <br/>\nreporting to the school, worrying about what their children AREN&#39;T getting, that <br/>\nthey close off that path that could be letting in so much LIFE, so much JOY, <br/>\nand so much TRUST. <br/>\n<br/>\nFear must be released in order for Joy, Life, and Real Learning to enter.<br/>\n<br/>\nGenevieve, what does Jonathan love to do?  Where does he SHINE?  When, in <br/>\nlife, is he able to see himself shining in his Mom&#39;s eyes?  Because I&#39;m reading <br/>\nabout how he is frustrating you...and I&#39;m sure there are times when he does <br/>\nSHINE...but it&#39;s absent from this post.  And if it&#39;s absent from this post, it <br/>\nmight be absent from your lives, too...and you might need a reminder to shift <br/>\nyour perspective of your son and see him for his blessings, his gifts.  He needs <br/>\nto be celebrated for Who He Is, and not seen as a frustration.  He KNOWS he&#39;s <br/>\nfrustrating you, and that&#39;s SO frustrating to him, which sets up this vicious <br/>\ncycle even more.<br/>\n<br/>\nThe cycle of frustration will end when you decide to let it end.  Focus on <br/>\nthis child&#39;s true spirit.  Trust that he is in this world to bless you and teach <br/>\nyou and share his gifts.  <br/>\n<br/>\nThis child does not need school, as he is a non-typical child who will be <br/>\ndestroyed in school by being told over and over again that he needs to change and <br/>\nconform.  He needs to know that he is fine just As He Is.  Once he feels <br/>\nloved and honored for those things that make him Who He Is, the rest of the <br/>\n&quot;behavior&quot; challenges will be minimized.  <br/>\n<br/>\nIf his behavior is bad at the dinner table, listen to that.  He&#39;s not telling <br/>\nyou in words how he feels, but he&#39;s still telling you.  Why does he have to <br/>\nbe at the dinner table?  Let him be Free.<br/>\n<br/>\nIf his behavior is bad at crowded places, PLEASE listen to that.  I have a <br/>\nchild who gets very anxious in crowded places, and we honor that about him.  We <br/>\nbelieved him when he said things like that make him nervous.  We were in the <br/>\nmall the other day, and the lights and the music in some stores made him so <br/>\nanxious.  He is 13 now and because his family has always honored him and believed <br/>\nhim (frustations, quirks and all...), he knows now that when he starts <br/>\nfeeling anxious from crowds or certain people or other things that it&#39;s OK.  He&#39;s <br/>\nstill OK.  He can walk outside and breathe.  He can shift his focus to things <br/>\nthat he loves.  Because he knows it&#39;s OK to be HimSelf...he knows that no one <br/>\nwill ask him to be any less that who he truly is, even if that includes becoming <br/>\nanxious and not understanding some things (like simple directions sometimes).<br/>\n<br/>\nWhat does Jonathan love?  What are his passions?  What does he eat up when he <br/>\nsees it (I mean his brain and his heart, not his mouth!)?  What part of the <br/>\nworld does he introduce to you?  Do you honor that and listen to that and find <br/>\nthat interesting?   <br/>\n<br/>\nAllow your child to SHINE in your eyes.  Focus on those shining moments, and <br/>\nthe frustrating moments will not completely disappear, but will be easier for <br/>\nyou will have a greater understanding of your child&#39;s spirit.  <br/>\n<br/>\nPut away the school work, lighten up the control, and focus on your child&#39;s <br/>\nheart, his passions.  See his frustrating behavior as his way of trying to tell <br/>\nyou something else.  Believe him.  Honor him.  <br/>\n<br/>\nSee the world from his eyes, from his heart, and let him take you into that <br/>\npart of the world that he loves and understands...that part of the world where <br/>\nhe sees himself Shining.<br/>\n<br/>\nI highly recommend you read &quot;The Highly Sensitive Child&quot; and see if you see <br/>\nyour son in it.  Also, raising your spirited child might be beneficiary (I&#39;ve <br/>\nnever read it, but it is recommended by others).   <br/>\n<br/>\nBe Well ~<br/>\nAnne O.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":88234,"nextTopicId":88224}}