{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":9,"messages":[{"userId":197017321,"authorName":"Tracey Inman","from":"&quot;Tracey Inman&quot; &lt;traceyi@...&gt;","profile":"tracey_inman","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"A Day----it gets worse...","postDate":"1105551533","msgId":102525,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFBKRUdJT0VEQUVQSUdCQ0FITExPR0VEQkNCQUEudHJhY2V5aUBzY2NvYXN0Lm5ldD4=","inReplyToHeader":"PDExMDUxNTM5NDYuMTMyMS45OTkyMS5tMTVAeWFob29ncm91cHMuY29tPg=="},"prevInTopic":102416,"nextInTopic":0,"prevInTime":102524,"nextInTime":102526,"topicId":102401,"numMessagesInTopic":0,"msgSnippet":"I agree with everyone....It made me sick to my stomach.  I was just sitting with my cup of coffee this morning thinking that my patience level with my girls (9","messageBody":"<div id=\"ygrps-yiv-504575728\">I agree with everyone....It made me sick to my stomach.  I was just sitting<br/>\nwith my cup of coffee this morning thinking that my patience level with my<br/>\ngirls (9 &12) has been really short lately.  I have had a lot going on in my<br/>\nlife and unfortunately I have let it spill into &quot;our lives&quot;.  I was telling<br/>\nmyself, before I read this horrific article, that I need to get a grip and<br/>\nlove on my girls today.  So, even though I too couldn&#39;t get through the<br/>\nentire second story, thank you, because it put in my face to remember not to<br/>\nlose another day......<br/>\n<br/>\nOff to enjoy the day...............<br/>\n<br/>\n~Tracey I.<br/>\n<br/>\n--<br/>\nNo virus found in this outgoing message.<br/>\nChecked by AVG Anti-Virus.<br/>\nVersion: 7.0.300 / Virus Database: 265.6.10 - Release Date: 1/10/2005</div>","specialLinks":[]},{"userId":122519133,"authorName":"Faith Pickell","from":"Faith Pickell &lt;panda@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] A Day----it gets worse...","postDate":"1105140207","msgId":102414,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIyQUQ3OThDLTYxMDMtMTFEOS1COEFELTAwMEE5NTdBMkQ5Q0B4aW9uaWMubmV0Pg==","inReplyToHeader":"PGRjLjFkNmViMmZiLjJmMTA1MzlkQGFvbC5jb20+"},"prevInTopic":102411,"nextInTopic":102416,"prevInTime":102413,"nextInTime":102415,"topicId":102401,"numMessagesInTopic":0,"msgSnippet":"Yep, this is the blog I was talking about. Faith","messageBody":"<div id=\"ygrps-yiv-947272486\">Yep, this is the blog I was talking about.<br/>\n<br/>\nFaith<br/>\n<blockquote><span title=\"qreply\"> On Friday, January 7, 2005, at 03:05 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kbcdlovejo@...\">kbcdlovejo@...</a> wrote:<br/>\n<br/>\n&gt;<br/>\n&gt; And then there&#39;s this. Poor kids.<br/>\n&gt; ~Kelly<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; SCHOOL AT MY HOUSE<br/>\n&gt; Susan Wise Bauer<br/>\n&gt; Fall of 2000: a day with a fourth  and second grader, a four-year-old <br/>\n&gt; and a<br/>\n&gt; newborn.<br/>\n&gt;<br/>\n&gt; 7:30 AM.  I  wake up because my husband has brought me a cup of coffee <br/>\n&gt; and a<br/>\n&gt; hungry  baby.  This the only way I get out of bed in the morning these <br/>\n&gt;  days,<br/>\n&gt; what with feeding new baby Emily at 11 PM and again at 2:30.   She’s <br/>\n&gt; slept<br/>\n&gt; since 2:30, though, so I’m feeling semi-human.  I sit up and  drink my <br/>\n&gt; coffee<br/>\n&gt; while feeding the baby, while Peter gets ready for  work.  Today is my <br/>\n&gt; “long<br/>\n&gt; day” with the children.  Peter and I both  work; we used to divide <br/>\n&gt; each day<br/>\n&gt; in half, but since the new baby’s arrival we  have divided our weeks <br/>\n&gt; so that<br/>\n&gt; I have the children from dawn to dusk on  Mondays and Wednesdays, <br/>\n&gt; while he<br/>\n&gt; has them on Tuesdays and Thursdays.   Fridays we split in half; he <br/>\n&gt; works in<br/>\n&gt; the morning, I work in the  afternoons.  Since Peter is schooling the <br/>\n&gt; boys in<br/>\n&gt; math, reading, and  art, he does double math and reading lessons on <br/>\n&gt; Tuesdays<br/>\n&gt; and  Thursdays.<br/>\n&gt;<br/>\n&gt; 8 AM.  Peter leaves.  He has a meeting at 8 PM that  won’t be over <br/>\n&gt; until<br/>\n&gt; midnight, so I don’t expect to see him for the rest of  the day.  I <br/>\n&gt; get up,<br/>\n&gt; change the baby’s diaper, and put her on my bed  while I dress.  I can <br/>\n&gt; hear<br/>\n&gt; the boys rattling around in their room; they  know they’re not <br/>\n&gt; supposed to<br/>\n&gt; emerge (except for necessary bathroom visits)  until I come get them.  <br/>\n&gt; When I<br/>\n&gt; ’m dressed, I go in with the baby on one  arm and tell Christopher (9) <br/>\n&gt; and<br/>\n&gt; Ben (7) to get dressed.  I put out  Daniel’s clothes; he’s four and <br/>\n&gt; going<br/>\n&gt; through a serious do-it-myself  phase.<br/>\n&gt;<br/>\n&gt; 8:15.  Christopher and Ben are running around in their  underwear and<br/>\n&gt; giggling.  Daniel has his sweatpants on upside down with  both feet <br/>\n&gt; sticking<br/>\n&gt; out of the waistband.  “Something is wrong here,” he  says.  I tell<br/>\n&gt; Christopher and Ben to STOP TALKING UNTIL ALL THEIR  CLOTHES ARE ON and<br/>\n&gt; reverse Daniel’s sweatpants.<br/>\n&gt;<br/>\n&gt; 8:30  Breakfast;  Emily was happy to lie on her mat and look at her <br/>\n&gt; mirror<br/>\n&gt; this morning, so  everyone gets scrambled eggs and toast.  On mornings <br/>\n&gt; when<br/>\n&gt; she’s fussy,  they tend to get cereal with a spoonful of peanut butter <br/>\n&gt; for<br/>\n&gt; protein  (disgusting, but effective).<br/>\n&gt;<br/>\n&gt; 8:55  I tell Christopher and Ben to  STOP TALKING UNTIL THEIR <br/>\n&gt; BREAKFAST IS<br/>\n&gt; GONE because we are due to start school  at 9 AM.<br/>\n&gt;<br/>\n&gt; 9 AM.  No one is finished eating.  I am now carrying  Emily on my <br/>\n&gt; shoulder.<br/>\n&gt; She spits up all down my back, so I go change my  shirt.<br/>\n&gt;<br/>\n&gt; 9:15  We start school.  I have a chart for each of the  older boys.<br/>\n&gt; Christopher’s says: Morning – Spelling, Grammar, Writing Strands,  <br/>\n&gt; History,<br/>\n&gt; Piano Practice.  Afternoon – Science, Latin, Penmanship, Extra  <br/>\n&gt; Reading.  Ben<br/>\n&gt; ’s says: Morning – Spelling, English for the Thoughtful  Child, <br/>\n&gt; History,<br/>\n&gt; Piano Practice, Phonics Pathways.  Afternoon – Science,  Spanish, <br/>\n&gt; Penmanship,<br/>\n&gt; Extra Reading.  We vary the order in which we do  these subjects, but <br/>\n&gt; I try<br/>\n&gt; to check them all off each day.  I tell them  that they can pick their <br/>\n&gt; first<br/>\n&gt; subject and I’ll pick the second.   Christopher decides to start with<br/>\n&gt; grammar; Ben wants to practice his  piano.  Christopher’s grammar is <br/>\n&gt; about<br/>\n&gt; principle parts.  Ben starts  playing the piano, which makes the <br/>\n&gt; principle<br/>\n&gt; parts even hard to understand,  so I tell him to go and play with <br/>\n&gt; Daniel<br/>\n&gt; until I’ve talked through  Christopher’s grammar lesson.  They <br/>\n&gt; disappear into<br/>\n&gt; the boys’ room.   Christopher and I slog through the present and <br/>\n&gt; present<br/>\n&gt; participle.   Emily starts screaming.  We take the book over to the <br/>\n&gt; sofa and<br/>\n&gt; I finish  explaining past and past participle while she nurses.<br/>\n&gt;<br/>\n&gt; 9:20   Christopher is doing his grammar exercises; he usually does two <br/>\n&gt; pages<br/>\n&gt; per  day.  I call Ben out to do his piano lesson.  Emily is still <br/>\n&gt; nursing,  so<br/>\n&gt; I tell Daniel to bring me a book.  I read to him while Ben  plays.  <br/>\n&gt; This<br/>\n&gt; raises the noise level in the house to something  approaching an <br/>\n&gt; airport<br/>\n&gt; runway.  &quot;I can&#39;t think!&quot; Christopher says.   I tell him to take his <br/>\n&gt; grammar<br/>\n&gt; book into his room to  finish.<br/>\n&gt;<br/>\n&gt; 9:30  Ben is finished with his piano (ten minutes is about  all I can <br/>\n&gt; keep<br/>\n&gt; him interested in).  I take Emily to the table to burp  her, pour <br/>\n&gt; Daniel a<br/>\n&gt; bowl of Grape Nuts (it takes him FOREVER to eat Grape  Nuts), and start<br/>\n&gt; explaining Ben’s spelling rule.  Emily begins to  scream, Daniel dumps <br/>\n&gt; out<br/>\n&gt; the Grape-Nuts, and Christopher appears in tears  because he can’t <br/>\n&gt; figure out<br/>\n&gt; his next exercise.  I tell Ben to get the  vacuum cleaner, Christopher <br/>\n&gt; to<br/>\n&gt; take a break, and Daniel to stop yelling over  the spilled cereal.  I <br/>\n&gt; sit<br/>\n&gt; down and rock Emily until she drifts off to  sleep, while Christopher <br/>\n&gt; vacuums<br/>\n&gt; and Daniel winds himself up in the vacuum  hose and yells, “A snake!  <br/>\n&gt; A snake<br/>\n&gt; is biting me!”<br/>\n&gt;<br/>\n&gt; 9:45.   Emily’s in bed.  I re-explain principle parts to Christopher <br/>\n&gt; and  give<br/>\n&gt; him a handful of chocolate chips to keep him going.  Everyone now  <br/>\n&gt; wants<br/>\n&gt; chocolate chips, so I give Daniel a little cupful of them and tell him <br/>\n&gt;  to go<br/>\n&gt; eat them in his “fort” (behind his bed).  I put Ben’s beside his  <br/>\n&gt; spelling<br/>\n&gt; book and tell him he can have one after each spelling word that he  <br/>\n&gt; writes.<br/>\n&gt;<br/>\n&gt; 10 AM  Emily is grousing again.  I know she&#39;s not ready  to get up, so <br/>\n&gt; I<br/>\n&gt; decide to wait a couple of minutes and see whether she&#39;ll go  back to <br/>\n&gt; sleep.<br/>\n&gt; This drives Ben crazy.  “Mom,” he keeps saying, “the baby  is crying!” <br/>\n&gt;  I<br/>\n&gt; get<br/>\n&gt; out his Phonics Pathways and tell him to think about  his phonics <br/>\n&gt; instead.<br/>\n&gt; He’s reading me two pages a day, as a review of phonics  and spelling <br/>\n&gt; rules.<br/>\n&gt; He reads the first two lines and then stops. &quot;Mom,&quot; he  says <br/>\n&gt; seriously, &quot;are<br/>\n&gt; you sure you know how to take care of a  baby?&quot;<br/>\n&gt;<br/>\n&gt; 10:10  Emily stops crying thirty seconds before I&#39;m ready to  go get <br/>\n&gt; her.<br/>\n&gt; When I look in at her, she’s sound asleep.  I check  Christopher’s <br/>\n&gt; grammar<br/>\n&gt; and give him his spelling book.  Today he’s doing  the second half of a<br/>\n&gt; lesson, so I don’t have to explain anything.  I  start a pot of <br/>\n&gt; coffee, sit<br/>\n&gt; Ben in front of his penmanship, and go to check on  Daniel.  He’s <br/>\n&gt; covered<br/>\n&gt; with chocolate, (so is his sheet) but he’s happy,  so I don’t wipe him <br/>\n&gt; off.<br/>\n&gt; (I ignore the sheet, on the theory that it&#39;s been  hit with worse.)<br/>\n&gt;<br/>\n&gt; 10:30  We take a snack and coffee outside for the  men working on the <br/>\n&gt; sawmill<br/>\n&gt; (I take the baby monitor with me.)   Christopher and Ben go off to <br/>\n&gt; play.  In<br/>\n&gt; five minutes they reappear with  Ben weeping.  “Christopher says he <br/>\n&gt; has to<br/>\n&gt; clean the bunny cage before he  can play with me!”  Ben wails.  <br/>\n&gt; “Christopher,<br/>\n&gt; play with Ben  first.”  “But he wants to play that we’re sweet kittens<br/>\n&gt; playing in the  woods,” Christopher says.  “Why can’t you play sweet<br/>\n&gt; kittens?” I  ask.  “Because it’s stupid,” he says, “and I want to <br/>\n&gt; pretend<br/>\n&gt; that we’re  raptors.”  “Go play kittens for ten minutes,” I say, “and <br/>\n&gt; then<br/>\n&gt; clean the  bunny cage.”<br/>\n&gt;<br/>\n&gt; 11 AM  Break is over.  I collect Daniel, who has  been in the sawdust <br/>\n&gt; pile<br/>\n&gt; and now has sawdust sticking to the chocolate on his  face.  When I <br/>\n&gt; call<br/>\n&gt; Christopher inside, he says, “But I have to clean the  bunny cage.”  <br/>\n&gt; “What<br/>\n&gt; have you been doing all this time?” I ask.   “Playing sweet kittens,” <br/>\n&gt; he<br/>\n&gt; says.  Ben adds, “Sweet kittens being hunted  by raptors.”<br/>\n&gt;<br/>\n&gt; 11:05  Christopher is upset because I told him not to  check on the <br/>\n&gt; bunny<br/>\n&gt; until lunch time (“If you don’t do it when I tell you to,  you’ll have <br/>\n&gt; to<br/>\n&gt; wait until your next break”) and he is now convinced that the  bunny <br/>\n&gt; is dying<br/>\n&gt; of thirst.  Emily is awake and crying.  I sit down  to feed Emily <br/>\n&gt; again and<br/>\n&gt; read Daniel another book while Ben plays with  Legos.<br/>\n&gt;<br/>\n&gt; 11:30  Emily is happy, so I put everyone on the sofa and  start <br/>\n&gt; history.<br/>\n&gt; Today we’re working on our Presidents Memorization Project –  we color<br/>\n&gt; pictures of two presidents from the Bellerophon coloring book,  <br/>\n&gt; Christopher<br/>\n&gt; looks them up in the encyclopedia and writes down two interesting  <br/>\n&gt; facts<br/>\n&gt; about each president, and we all chant the presidents in order.   <br/>\n&gt; We’re up to<br/>\n&gt; Andrew Jackson and Martin van Buren.  I tell Christopher and  Ben to <br/>\n&gt; STOP<br/>\n&gt; TALKING UNTIL THEIR PICTURES ARE COLORED.<br/>\n&gt;<br/>\n&gt; 12:00  I  fix lunch one-handed and call everyone to the table.<br/>\n&gt;<br/>\n&gt; 12:30  I tell  Christopher and Ben to STOP TALKING UNTIL THEIR FOOD IS <br/>\n&gt; ALL<br/>\n&gt; GONE because they  still have work to do before rest time.<br/>\n&gt;<br/>\n&gt; 12:45.  I put Emily in her  cradle and clear away lunch half-eaten.  <br/>\n&gt; Ben<br/>\n&gt; bursts into tears because  he isn’t finished.  Christopher asks for <br/>\n&gt; dessert.<br/>\n&gt; I tell Ben to sit on  his bed, Christopher that he can’t have any <br/>\n&gt; dessert,<br/>\n&gt; and Daniel to go  potty.  Emily is screaming.  “Emily is screaming!” <br/>\n&gt; Ben<br/>\n&gt; yells from  his bed.  “Do I have to do my Writing Strands?” <br/>\n&gt; Christopher asks.<br/>\n&gt; “My  pants are a little bit wet,” Daniel shouts from the bathroom.  I <br/>\n&gt; yell<br/>\n&gt; at<br/>\n&gt; the top of my lungs, “Everybody be quiet before I lose my mind!”   <br/>\n&gt; There is a<br/>\n&gt; short silence.  Daniel says politely, from the bathroom, “You  don’t <br/>\n&gt; have to<br/>\n&gt; be so loud, Mommy.”<br/>\n&gt;<br/>\n&gt; 12:50  Daniel has dry pants,  Ben is copying three exclamations from <br/>\n&gt; his<br/>\n&gt; English for the Thoughtful Child  Book, and I’m explaining <br/>\n&gt; Christopher’s<br/>\n&gt; Writing Strands exercise to him.   He takes it off to do it in his <br/>\n&gt; room.  I<br/>\n&gt; correct Ben’s penmanship and  send him and Daniel to bed for mandatory <br/>\n&gt; rest<br/>\n&gt; time.  Daniel is listening  to “How to Eat Fried Worms” on his tape <br/>\n&gt; recorder;<br/>\n&gt; Ben is listening to “The  Dark Is Rising” and playing with Legos.<br/>\n&gt; Christopher brings me his writing  exercise.  I tell him to save his <br/>\n&gt; piano<br/>\n&gt; lesson until after rest  time.<br/>\n&gt;<br/>\n&gt; 1 PM.  I leave the baby monitor with my mother (her house is  attached <br/>\n&gt; to<br/>\n&gt; ours) and go for a walk.<br/>\n&gt;<br/>\n&gt; 2 PM. I get back from my walk and  answer a couple of e-mails before <br/>\n&gt; Emily<br/>\n&gt; wakes up and wants to be  fed.<br/>\n&gt;<br/>\n&gt; 3 PM.  The boys get up.  I’ve learned not to try to leap  directly into<br/>\n&gt; school after nap time; I let them eat cookies and play for a  little <br/>\n&gt; while<br/>\n&gt; until they start to bicker.  “School time!” I say, and send  <br/>\n&gt; Christopher to<br/>\n&gt; play his piano.  I give Daniel scissors and colored  paper, and he <br/>\n&gt; promptly<br/>\n&gt; begins to make a phenomenal mess all over the kitchen  floor.  Ben <br/>\n&gt; reads to<br/>\n&gt; me from his current “Extra Reading” book – a book  that goes along with<br/>\n&gt; history or science (Peter does their imaginative reading  with them on<br/>\n&gt; Tuesdays and Thursdays). Today he’s reading Can’t You Make Them  <br/>\n&gt; Behave, King<br/>\n&gt; George?  I sit down to listen, but Emily cries, so I get up  and walk <br/>\n&gt; around<br/>\n&gt; the kitchen while Ben reads.  Halfway through the first  page, Emily <br/>\n&gt; dirties<br/>\n&gt; her diaper, my shirt, her blanket, and her sleeper.   Ben follows me <br/>\n&gt; into our<br/>\n&gt; bedroom, still reading, while Christopher bangs out  “The Bells” for <br/>\n&gt; the<br/>\n&gt; fourth time, Daniel sings along, I change the diaper, and  Emily <br/>\n&gt; screams.<br/>\n&gt; The noise level has once again reached airport level.  I  say, in an<br/>\n&gt; unnaturally calm voice, “Ben, could you please stop reading to me  <br/>\n&gt; until I’m<br/>\n&gt; finished with Emily’s diaper?”<br/>\n&gt;<br/>\n&gt; 3:30.  Emily doesn’t  want to be put down.  I had intended to do <br/>\n&gt; another<br/>\n&gt; Latin lesson with  Christopher today, but I’m starting to feel like <br/>\n&gt; I’ve HAD<br/>\n&gt; it, so I tell him  to review his vocabulary cards and then send all of <br/>\n&gt; them<br/>\n&gt; outside to run  around while I start supper.<br/>\n&gt;<br/>\n&gt; 3:45  I give up on supper and rock  Emily.<br/>\n&gt;<br/>\n&gt; 4 PM  I’m still rocking Emily.  The boys come back  in.  “Go outside <br/>\n&gt; some<br/>\n&gt; more,” I say.<br/>\n&gt;<br/>\n&gt; 4:15  I nurse Emily  again.<br/>\n&gt;<br/>\n&gt; 4:30 Still rocking Emily.  The boys come in again.  I  tell <br/>\n&gt; Christopher to<br/>\n&gt; read Daniel a book and Ben to get his penmanship book  out.<br/>\n&gt;<br/>\n&gt; 4:45  Emily is asleep.  I threaten everyone with instant  death if <br/>\n&gt; they wake<br/>\n&gt; her up.  They think this is funny and start to howl  with laughter at <br/>\n&gt; the top<br/>\n&gt; of their lungs.  Emily cries.  I go in the  bathroom, shut the door, <br/>\n&gt; and<br/>\n&gt; count to twenty.  Daniel sticks his fingers  under the door and says, <br/>\n&gt; “Look,<br/>\n&gt; Daniel fingers!”<br/>\n&gt;<br/>\n&gt; 5 PM.  I decide  that we should all walk down to the mailbox instead of<br/>\n&gt; trying to do  science.  I give Mom the monitor again, and we borrow <br/>\n&gt; three<br/>\n&gt; flashlights  from her (it’s already dark, and I have no batteries.  <br/>\n&gt; Ever.)<br/>\n&gt; The  mailbox is a quarter of a mile away, and the night is beautiful.  <br/>\n&gt; By  the<br/>\n&gt; time we get back I feel better.  I fix everybody sandwiches and  <br/>\n&gt; potato chips<br/>\n&gt; for supper.  (They think this is great).<br/>\n&gt;<br/>\n&gt; 5:50   I tell Christopher and Benjamin to STOP TALKING AND EAT or I <br/>\n&gt; will take<br/>\n&gt; their  potato chips away.  They cram all the chips into their mouths.  <br/>\n&gt;  I<br/>\n&gt; decide that we will save manners lessons until Emily is older.<br/>\n&gt;<br/>\n&gt; 6  PM.  Emily wakes up.  I get out the Science in a Nutshell kit that  <br/>\n&gt; we’re<br/>\n&gt; doing (Gears) and give everyone gears, then sit down and nurse Emily  <br/>\n&gt; while<br/>\n&gt; we go through the project.  Christopher loves to keep his Science  <br/>\n&gt; Journal,<br/>\n&gt; but Ben has to be prompted for every question and answer.  I’m  still <br/>\n&gt; writing<br/>\n&gt; them down for him, since his penmanship is very slow and  difficult; <br/>\n&gt; today my<br/>\n&gt; hands are full, so I tell him he gets the day off from  recording his<br/>\n&gt; experiments.  Daniel puts gear stickers on his head and  says, “Look, <br/>\n&gt; I’m a<br/>\n&gt; gear machine.”<br/>\n&gt;<br/>\n&gt; 7 PM  I tell Ben that we’re not  doing Spanish (again).  “We never get <br/>\n&gt; to<br/>\n&gt; Spanish,” he says.  This  is unfortunately true.  Maybe I’ll outsource <br/>\n&gt; it to<br/>\n&gt; a neighbor next  year.  I check the lists; Christopher didn’t do his <br/>\n&gt; cursive<br/>\n&gt; practice,  but I decide that his life will be complete without it.  I <br/>\n&gt; tell<br/>\n&gt; the boys  to get their pajamas on and clean up their room while I rock <br/>\n&gt; Emily,<br/>\n&gt; who is  screaming (again).<br/>\n&gt;<br/>\n&gt; 7:15  Emily gets happy and everyone wants to hold  her.  We take turns <br/>\n&gt; while<br/>\n&gt; I read to Daniel.<br/>\n&gt;<br/>\n&gt; 7:30  Daniel  goes to bed.  I play Uno with Christopher and Ben while <br/>\n&gt; Emily<br/>\n&gt; sits on my  lap.<br/>\n&gt;<br/>\n&gt; 8 PM.  I read Ben a book and put him in bed.  I rock Emily  back to <br/>\n&gt; sleep<br/>\n&gt; while Christopher sits on the sofa and reads.<br/>\n&gt;<br/>\n&gt; 8:30   I send Christopher to bed and put Emily in her cradle.  She<br/>\n&gt; immediately  wakes up and howls.  Eventually I pick her up and pretend <br/>\n&gt; I’m<br/>\n&gt; doing  aerobics, which sends back to sleep.  I put her back down and <br/>\n&gt; sneak<br/>\n&gt; out  of the room.<br/>\n&gt;<br/>\n&gt; 9 PM  Boy, it would be nice to go to  bed.<br/>\n&gt;<br/>\n&gt; 9:30  Lights out for the boys.  Daniel is asleep; I pray  with the two <br/>\n&gt; older<br/>\n&gt; boys, listen to Christopher’s worries, and answer twelve  questions <br/>\n&gt; from Ben.<br/>\n&gt; I know Emily will be up to eat again soon, so I decide to  work on <br/>\n&gt; e-mail<br/>\n&gt; again until she wakes up.<br/>\n&gt;<br/>\n&gt; AND A FINAL NOTE TO THIS  PAGE, added June, 2001:  WE DID HAVE A GOOD <br/>\n&gt; TIME<br/>\n&gt; THIS DAY!  We  played Uno, messed around with gears, went for a great <br/>\n&gt; walk in<br/>\n&gt; the dark, dug  in the sawdust and read three books that kept the boys<br/>\n&gt; enthralled.  It  was ALSO frantic and tiring; that&#39;s real life with <br/>\n&gt; four<br/>\n&gt; children under  nine.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &quot;List Posting Policies&quot; are provided in the files area of this group.<br/>\n&gt;<br/>\n&gt; Visit the Unschooling website and message boards: <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":88929938,"authorName":"Seth W Bartels","from":"Seth W Bartels &lt;ecotopian@...&gt;","profile":"lunamama3","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] A Day----it gets worse...","postDate":"1105136303","msgId":102411,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUwMTA3LjE2MTgyNC4yMzM2LjMuZWNvdG9waWFuQGp1bm8uY29tPg=="},"prevInTopic":102410,"nextInTopic":102414,"prevInTime":102410,"nextInTime":102412,"topicId":102401,"numMessagesInTopic":0,"msgSnippet":"oh my goodness!  what s with the bribing with sugar stuff? *sigh*  at least she s nursing the baby?? yuck...i feel awful! lisa On Fri, 7 Jan 2005 16:05:33 EST","messageBody":"<div id=\"ygrps-yiv-179076676\">oh my goodness!  what&#39;s with the bribing with sugar stuff?<br/>\n<br/>\n*sigh*  at least she&#39;s nursing the baby??<br/>\n<br/>\nyuck...i feel awful!  <br/>\nlisa<br/>\n<br/>\nOn Fri, 7 Jan 2005 16:05:33 EST <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kbcdlovejo@...\">kbcdlovejo@...</a> writes:<br/>\nAnd then there&#39;s this. Poor kids.<br/>\n~Kelly<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] A Day----it gets worse...","postDate":"1105136295","msgId":102410,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0LjNjM2Q2NDk5LjJmMTA2NGE3QGFvbC5jb20+"},"prevInTopic":102408,"nextInTopic":102411,"prevInTime":102409,"nextInTime":102411,"topicId":102401,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/7/05 3:15:17 PM, danielle.conger@comcast.net writes: ","messageBody":"<div id=\"ygrps-yiv-1828177002\">In a message dated 1/7/05 3:15:17 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:danielle.conger@...\">danielle.conger@...</a> writes:<br/>\n<br/>\n&lt;&lt; Stooooooppppp! Please, no more! I can&#39;t take it anymore! I refuse to <br/>\nread another thing about these people. &gt;&gt;<br/>\n<br/>\nI kinda had fun deconstructing it.  The first one was fun, but I couldn&#39;t <br/>\nread the second one.  Even though I can listen to Stephen Lynch, and South Park <br/>\nstuff, that Bauer humor was just TOO TOTALLY DISGUSTING.<br/>\n<br/>\nSandra<br/>\n(what? It wasn&#39;t HUMOR!?)</div>","specialLinks":[]},{"userId":1675643,"authorName":"Cally Brown","from":"Cally Brown &lt;mjcmbrwn@...&gt;","profile":"cally_marg","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] A Day----it gets worse...","postDate":"1105135407","msgId":102407,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxREYwNzJGLjMwODA2MDNAaWh1Zy5jby5uej4=","referencesHeader":"PGRjLjFkNmViMmZiLjJmMTA1MzlkQGFvbC5jb20+"},"prevInTopic":102402,"nextInTopic":102408,"prevInTime":102406,"nextInTime":102408,"topicId":102401,"numMessagesInTopic":0,"msgSnippet":"I couldn t read this all through - those poor poor children, and that poor poor mother who cannot Be with her chilrden.  My kids are 23, 21, 17, 14.  I feel so","messageBody":"<div id=\"ygrps-yiv-1424339378\">I couldn&#39;t read this all through - those poor poor children, and that <br/>\npoor poor mother who cannot Be with her chilrden.  My kids are 23, 21, <br/>\n17, 14.  I feel so lucky to have been able to share their lives.  So <br/>\nquickly they grow up and start moving away into their own independence <br/>\n(not necessarily physically moving away) and I miss them so, at the same <br/>\ntime as rejoicing in their independent lives.  I want to shout at this <br/>\nwoman: &quot;Just sit down and cuddle your baby while you listen to you <br/>\nlittle boy playing his piano, stop being to busy to see their Being&quot;.  I <br/>\ncan&#39;t believe:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Ben starts  playing the piano, which makes the principle<br/>\n&gt;parts even hard to understand,  so I tell him to go and play with Daniel<br/>\n&gt;until I’ve talked through  Christopher’s grammar lesson.<br/>\n&gt;<br/>\n&gt;I call Ben out to do his piano lesson.  Emily is still nursing,  so<br/>\n&gt;I tell Daniel to bring me a book.  I read to him while Ben  plays.<br/>\n&gt;<br/>\n&gt;9:30  Ben is finished with his piano (ten minutes is about  all I can keep<br/>\n&gt;him interested in). <br/>\n&gt;<br/>\n<br/>\n </span></blockquote>can&#39;t she see the connections?<br/>\n<br/>\nand all the STOP TALKING UNTIL....<br/>\n<br/>\nI feel sick :-(<br/>\n<br/>\nCAlly</div>","specialLinks":[]},{"userId":140747339,"authorName":"Jenny Altenbach","from":"Jenny Altenbach &lt;salten@...&gt;","profile":"brownaltenbach","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] A Day----it gets worse...","postDate":"1105133693","msgId":102416,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxREYwMDdELjgwMjAyMDJAY29tY2FzdC5uZXQ+","inReplyToHeader":"PGRjLjFkNmViMmZiLjJmMTA1MzlkQGFvbC5jb20+","referencesHeader":"PGRjLjFkNmViMmZiLjJmMTA1MzlkQGFvbC5jb20+"},"prevInTopic":102414,"nextInTopic":102525,"prevInTime":102415,"nextInTime":102417,"topicId":102401,"numMessagesInTopic":0,"msgSnippet":"... Yuck.  Aside from all the obvious horrible things about this, what really gets on my nerves is her delivery of the story.  It s that snarky, almost","messageBody":"<div id=\"ygrps-yiv-1982068362\"><a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kbcdlovejo@...\">kbcdlovejo@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; And then there&#39;s this. Poor kids.<br/>\n<br/>\n<br/>\n </span></blockquote>Yuck.  Aside from all the obvious horrible things about this, what <br/>\nreally gets on my nerves is her delivery of the story.  It&#39;s that <br/>\nsnarky, almost condescending way that some moms have when they describe <br/>\nhow difficult it can be to be a wife and mother.  You know, like those <br/>\ntwo women who had a tv show for a while--I think it was called &quot;The <br/>\nMommies&quot;--and they also did a bunch of commercials for aluminum foil or <br/>\nsomething.  Their &quot;bit&quot; was the sarcastic, put-out, knowing-look-giving, <br/>\nkind of thing where they complained about their kids/spouses in an <br/>\neffort to be funny.  Another one that comes to mind is Vicki Iovine, the <br/>\nauthor of &quot;The Girlfriend&#39;s Guide to Pregnancy&quot; and other books.  She&#39;s <br/>\nthe one that compared homebirth to animal slaughter (although I do have <br/>\nto admit that some of her description of pregnancy symptoms were pretty <br/>\ndarn funny).<br/>\n<br/>\nThe overall impression that I get is that this woman&#39;s homeschool is way <br/>\nmore about HER than it is about her kids.<br/>\n<br/>\nJenny</div>","specialLinks":[]},{"userId":164542605,"authorName":"Danielle Conger","from":"Danielle Conger &lt;danielle.conger@...&gt;","profile":"danielleconger","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] A Day----it gets worse...","postDate":"1105133335","msgId":102408,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxREVGRjE3LjEwMjA3MDZAY29tY2FzdC5uZXQ+","inReplyToHeader":"PGRjLjFkNmViMmZiLjJmMTA1MzlkQGFvbC5jb20+","referencesHeader":"PGRjLjFkNmViMmZiLjJmMTA1MzlkQGFvbC5jb20+"},"prevInTopic":102407,"nextInTopic":102410,"prevInTime":102407,"nextInTime":102409,"topicId":102401,"numMessagesInTopic":0,"msgSnippet":"Stooooooppppp! Please, no more! I can t take it anymore! I refuse to read another thing about these people. --Danielle ","messageBody":"<div id=\"ygrps-yiv-119362865\">Stooooooppppp! Please, no more! I can&#39;t take it anymore! I refuse to <br/>\nread another thing about these people.<br/>\n<br/>\n--Danielle<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.danielleconger.com/Homeschool/Welcomehome.html\">http://www.danielleconger.com/Homeschool/Welcomehome.html</a><br/>\n<br/>\n<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kbcdlovejo@...\">kbcdlovejo@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt;And then there&#39;s this. Poor kids.<br/>\n&gt;~Kelly<br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":78134331,"authorName":"Genant2@aol.com","from":"Genant2@...","profile":"genant04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] A Day----it gets worse...","postDate":"1105132515","msgId":102402,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFkOC4zNDI2Y2I5MC4yZjEwNTVlM0Bhb2wuY29tPg=="},"prevInTopic":102401,"nextInTopic":102407,"prevInTime":102401,"nextInTime":102403,"topicId":102401,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/7/2005 4:08:59 PM Eastern Standard Time, ... decide to wait a couple of minutes  and see whether she ll go  back to sleep. This drives Ben","messageBody":"<div id=\"ygrps-yiv-1856093629\">In a message dated 1/7/2005 4:08:59 PM Eastern Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kbcdlovejo@...\">kbcdlovejo@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;10 AM  Emily is grousing again.  I know  she&#39;s not ready  to get up, so I<br/>\n </span></blockquote>decide to wait a couple of minutes  and see whether she&#39;ll go  back to sleep.<br/>\nThis drives Ben crazy.   “Mom,” he keeps saying, “the baby  is crying!”  <br/>\n..... &quot;Mom,&quot;  he  says seriously, &quot;are you sure you know how to take care of a   <br/>\nbaby?&quot;&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nSo smart.<br/>\nPam G<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"A Day----it gets worse...","postDate":"1105131933","msgId":102401,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRjLjFkNmViMmZiLjJmMTA1MzlkQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":102402,"prevInTime":102400,"nextInTime":102402,"topicId":102401,"numMessagesInTopic":0,"msgSnippet":"And then there s this. Poor kids. ~Kelly SCHOOL AT MY HOUSE Susan Wise Bauer Fall of 2000: a day with a fourth  and second grader, a four-year-old and a ","messageBody":"<div id=\"ygrps-yiv-525808696\">And then there&#39;s this. Poor kids.<br/>\n~Kelly<br/>\n <br/>\n <br/>\nSCHOOL AT MY HOUSE<br/>\nSusan Wise Bauer<br/>\nFall of 2000: a day with a fourth  and second grader, a four-year-old and a<br/>\nnewborn.<br/>\n<br/>\n7:30 AM.  I  wake up because my husband has brought me a cup of coffee and a<br/>\nhungry  baby.  This the only way I get out of bed in the morning these  days,<br/>\nwhat with feeding new baby Emily at 11 PM and again at 2:30.   She’s slept<br/>\nsince 2:30, though, so I’m feeling semi-human.  I sit up and  drink my coffee<br/>\nwhile feeding the baby, while Peter gets ready for  work.  Today is my “long<br/>\nday” with the children.  Peter and I both  work; we used to divide each day<br/>\nin half, but since the new baby’s arrival we  have divided our weeks so that<br/>\nI have the children from dawn to dusk on  Mondays and Wednesdays, while he<br/>\nhas them on Tuesdays and Thursdays.   Fridays we split in half; he works in<br/>\nthe morning, I work in the  afternoons.  Since Peter is schooling the boys in<br/>\nmath, reading, and  art, he does double math and reading lessons on Tuesdays<br/>\nand  Thursdays.<br/>\n<br/>\n8 AM.  Peter leaves.  He has a meeting at 8 PM that  won’t be over until<br/>\nmidnight, so I don’t expect to see him for the rest of  the day.  I get up,<br/>\nchange the baby’s diaper, and put her on my bed  while I dress.  I can hear<br/>\nthe boys rattling around in their room; they  know they’re not supposed to<br/>\nemerge (except for necessary bathroom visits)  until I come get them.  When I<br/>\n’m dressed, I go in with the baby on one  arm and tell Christopher (9) and<br/>\nBen (7) to get dressed.  I put out  Daniel’s clothes; he’s four and going<br/>\nthrough a serious do-it-myself  phase.<br/>\n<br/>\n8:15.  Christopher and Ben are running around in their  underwear and<br/>\ngiggling.  Daniel has his sweatpants on upside down with  both feet sticking<br/>\nout of the waistband.  “Something is wrong here,” he  says.  I tell<br/>\nChristopher and Ben to STOP TALKING UNTIL ALL THEIR  CLOTHES ARE ON and<br/>\nreverse Daniel’s sweatpants.<br/>\n<br/>\n8:30  Breakfast;  Emily was happy to lie on her mat and look at her mirror<br/>\nthis morning, so  everyone gets scrambled eggs and toast.  On mornings when<br/>\nshe’s fussy,  they tend to get cereal with a spoonful of peanut butter for<br/>\nprotein  (disgusting, but effective).<br/>\n<br/>\n8:55  I tell Christopher and Ben to  STOP TALKING UNTIL THEIR BREAKFAST IS<br/>\nGONE because we are due to start school  at 9 AM.<br/>\n<br/>\n9 AM.  No one is finished eating.  I am now carrying  Emily on my shoulder.<br/>\nShe spits up all down my back, so I go change my  shirt.<br/>\n<br/>\n9:15  We start school.  I have a chart for each of the  older boys.<br/>\nChristopher’s says: Morning – Spelling, Grammar, Writing Strands,  History,<br/>\nPiano Practice.  Afternoon – Science, Latin, Penmanship, Extra  Reading.  Ben<br/>\n’s says: Morning – Spelling, English for the Thoughtful  Child, History,<br/>\nPiano Practice, Phonics Pathways.  Afternoon – Science,  Spanish, Penmanship,<br/>\nExtra Reading.  We vary the order in which we do  these subjects, but I try<br/>\nto check them all off each day.  I tell them  that they can pick their first<br/>\nsubject and I’ll pick the second.   Christopher decides to start with<br/>\ngrammar; Ben wants to practice his  piano.  Christopher’s grammar is about<br/>\nprinciple parts.  Ben starts  playing the piano, which makes the principle<br/>\nparts even hard to understand,  so I tell him to go and play with Daniel<br/>\nuntil I’ve talked through  Christopher’s grammar lesson.  They disappear into<br/>\nthe boys’ room.   Christopher and I slog through the present and present<br/>\nparticiple.   Emily starts screaming.  We take the book over to the sofa and<br/>\nI finish  explaining past and past participle while she nurses.<br/>\n<br/>\n9:20   Christopher is doing his grammar exercises; he usually does two pages<br/>\nper  day.  I call Ben out to do his piano lesson.  Emily is still nursing,  so<br/>\nI tell Daniel to bring me a book.  I read to him while Ben  plays.  This<br/>\nraises the noise level in the house to something  approaching an airport<br/>\nrunway.  &quot;I can&#39;t think!&quot; Christopher says.   I tell him to take his grammar<br/>\nbook into his room to  finish.<br/>\n<br/>\n9:30  Ben is finished with his piano (ten minutes is about  all I can keep<br/>\nhim interested in).  I take Emily to the table to burp  her, pour Daniel a<br/>\nbowl of Grape Nuts (it takes him FOREVER to eat Grape  Nuts), and start<br/>\nexplaining Ben’s spelling rule.  Emily begins to  scream, Daniel dumps out<br/>\nthe Grape-Nuts, and Christopher appears in tears  because he can’t figure out<br/>\nhis next exercise.  I tell Ben to get the  vacuum cleaner, Christopher to<br/>\ntake a break, and Daniel to stop yelling over  the spilled cereal.  I sit<br/>\ndown and rock Emily until she drifts off to  sleep, while Christopher vacuums<br/>\nand Daniel winds himself up in the vacuum  hose and yells, “A snake!  A snake<br/>\nis biting me!”<br/>\n<br/>\n9:45.   Emily’s in bed.  I re-explain principle parts to Christopher and  give<br/>\nhim a handful of chocolate chips to keep him going.  Everyone now  wants<br/>\nchocolate chips, so I give Daniel a little cupful of them and tell him  to go<br/>\neat them in his “fort” (behind his bed).  I put Ben’s beside his  spelling<br/>\nbook and tell him he can have one after each spelling word that he  writes.<br/>\n<br/>\n10 AM  Emily is grousing again.  I know she&#39;s not ready  to get up, so I<br/>\ndecide to wait a couple of minutes and see whether she&#39;ll go  back to sleep.<br/>\nThis drives Ben crazy.  “Mom,” he keeps saying, “the baby  is crying!”  I <br/>\nget<br/>\nout his Phonics Pathways and tell him to think about  his phonics instead.<br/>\nHe’s reading me two pages a day, as a review of phonics  and spelling rules.<br/>\nHe reads the first two lines and then stops. &quot;Mom,&quot; he  says seriously, &quot;are<br/>\nyou sure you know how to take care of a  baby?&quot;<br/>\n<br/>\n10:10  Emily stops crying thirty seconds before I&#39;m ready to  go get her.<br/>\nWhen I look in at her, she’s sound asleep.  I check  Christopher’s grammar<br/>\nand give him his spelling book.  Today he’s doing  the second half of a<br/>\nlesson, so I don’t have to explain anything.  I  start a pot of coffee, sit<br/>\nBen in front of his penmanship, and go to check on  Daniel.  He’s covered<br/>\nwith chocolate, (so is his sheet) but he’s happy,  so I don’t wipe him off.<br/>\n(I ignore the sheet, on the theory that it&#39;s been  hit with worse.)<br/>\n<br/>\n10:30  We take a snack and coffee outside for the  men working on the sawmill<br/>\n(I take the baby monitor with me.)   Christopher and Ben go off to play.  In<br/>\nfive minutes they reappear with  Ben weeping.  “Christopher says he has to<br/>\nclean the bunny cage before he  can play with me!”  Ben wails.  “Christopher,<br/>\nplay with Ben  first.”  “But he wants to play that we’re sweet kittens<br/>\nplaying in the  woods,” Christopher says.  “Why can’t you play sweet<br/>\nkittens?” I  ask.  “Because it’s stupid,” he says, “and I want to pretend<br/>\nthat we’re  raptors.”  “Go play kittens for ten minutes,” I say, “and then<br/>\nclean the  bunny cage.”<br/>\n<br/>\n11 AM  Break is over.  I collect Daniel, who has  been in the sawdust pile<br/>\nand now has sawdust sticking to the chocolate on his  face.  When I call<br/>\nChristopher inside, he says, “But I have to clean the  bunny cage.”  “What<br/>\nhave you been doing all this time?” I ask.   “Playing sweet kittens,” he<br/>\nsays.  Ben adds, “Sweet kittens being hunted  by raptors.”<br/>\n<br/>\n11:05  Christopher is upset because I told him not to  check on the bunny<br/>\nuntil lunch time (“If you don’t do it when I tell you to,  you’ll have to<br/>\nwait until your next break”) and he is now convinced that the  bunny is dying<br/>\nof thirst.  Emily is awake and crying.  I sit down  to feed Emily again and<br/>\nread Daniel another book while Ben plays with  Legos.<br/>\n<br/>\n11:30  Emily is happy, so I put everyone on the sofa and  start history.<br/>\nToday we’re working on our Presidents Memorization Project –  we color<br/>\npictures of two presidents from the Bellerophon coloring book,  Christopher<br/>\nlooks them up in the encyclopedia and writes down two interesting  facts<br/>\nabout each president, and we all chant the presidents in order.   We’re up to<br/>\nAndrew Jackson and Martin van Buren.  I tell Christopher and  Ben to STOP<br/>\nTALKING UNTIL THEIR PICTURES ARE COLORED.<br/>\n<br/>\n12:00  I  fix lunch one-handed and call everyone to the table.<br/>\n<br/>\n12:30  I tell  Christopher and Ben to STOP TALKING UNTIL THEIR FOOD IS ALL<br/>\nGONE because they  still have work to do before rest time.<br/>\n<br/>\n12:45.  I put Emily in her  cradle and clear away lunch half-eaten.  Ben<br/>\nbursts into tears because  he isn’t finished.  Christopher asks for dessert.<br/>\nI tell Ben to sit on  his bed, Christopher that he can’t have any dessert,<br/>\nand Daniel to go  potty.  Emily is screaming.  “Emily is screaming!” Ben<br/>\nyells from  his bed.  “Do I have to do my Writing Strands?” Christopher asks.<br/>\n“My  pants are a little bit wet,” Daniel shouts from the bathroom.  I yell  <br/>\nat<br/>\nthe top of my lungs, “Everybody be quiet before I lose my mind!”   There is a<br/>\nshort silence.  Daniel says politely, from the bathroom, “You  don’t have to<br/>\nbe so loud, Mommy.”<br/>\n<br/>\n12:50  Daniel has dry pants,  Ben is copying three exclamations from his<br/>\nEnglish for the Thoughtful Child  Book, and I’m explaining Christopher’s<br/>\nWriting Strands exercise to him.   He takes it off to do it in his room.  I<br/>\ncorrect Ben’s penmanship and  send him and Daniel to bed for mandatory rest<br/>\ntime.  Daniel is listening  to “How to Eat Fried Worms” on his tape recorder;<br/>\nBen is listening to “The  Dark Is Rising” and playing with Legos.<br/>\nChristopher brings me his writing  exercise.  I tell him to save his piano<br/>\nlesson until after rest  time.<br/>\n<br/>\n1 PM.  I leave the baby monitor with my mother (her house is  attached to<br/>\nours) and go for a walk.<br/>\n<br/>\n2 PM. I get back from my walk and  answer a couple of e-mails before Emily<br/>\nwakes up and wants to be  fed.<br/>\n<br/>\n3 PM.  The boys get up.  I’ve learned not to try to leap  directly into<br/>\nschool after nap time; I let them eat cookies and play for a  little while<br/>\nuntil they start to bicker.  “School time!” I say, and send  Christopher to<br/>\nplay his piano.  I give Daniel scissors and colored  paper, and he promptly<br/>\nbegins to make a phenomenal mess all over the kitchen  floor.  Ben reads to<br/>\nme from his current “Extra Reading” book – a book  that goes along with<br/>\nhistory or science (Peter does their imaginative reading  with them on<br/>\nTuesdays and Thursdays). Today he’s reading Can’t You Make Them  Behave, King<br/>\nGeorge?  I sit down to listen, but Emily cries, so I get up  and walk around<br/>\nthe kitchen while Ben reads.  Halfway through the first  page, Emily dirties<br/>\nher diaper, my shirt, her blanket, and her sleeper.   Ben follows me into our<br/>\nbedroom, still reading, while Christopher bangs out  “The Bells” for the<br/>\nfourth time, Daniel sings along, I change the diaper, and  Emily screams.<br/>\nThe noise level has once again reached airport level.  I  say, in an<br/>\nunnaturally calm voice, “Ben, could you please stop reading to me  until I’m<br/>\nfinished with Emily’s diaper?”<br/>\n<br/>\n3:30.  Emily doesn’t  want to be put down.  I had intended to do another<br/>\nLatin lesson with  Christopher today, but I’m starting to feel like I’ve HAD<br/>\nit, so I tell him  to review his vocabulary cards and then send all of them<br/>\noutside to run  around while I start supper.<br/>\n<br/>\n3:45  I give up on supper and rock  Emily.<br/>\n<br/>\n4 PM  I’m still rocking Emily.  The boys come back  in.  “Go outside some<br/>\nmore,” I say.<br/>\n<br/>\n4:15  I nurse Emily  again.<br/>\n<br/>\n4:30 Still rocking Emily.  The boys come in again.  I  tell Christopher to<br/>\nread Daniel a book and Ben to get his penmanship book  out.<br/>\n<br/>\n4:45  Emily is asleep.  I threaten everyone with instant  death if they wake<br/>\nher up.  They think this is funny and start to howl  with laughter at the top<br/>\nof their lungs.  Emily cries.  I go in the  bathroom, shut the door, and<br/>\ncount to twenty.  Daniel sticks his fingers  under the door and says, “Look,<br/>\nDaniel fingers!”<br/>\n<br/>\n5 PM.  I decide  that we should all walk down to the mailbox instead of<br/>\ntrying to do  science.  I give Mom the monitor again, and we borrow three<br/>\nflashlights  from her (it’s already dark, and I have no batteries.  Ever.)<br/>\nThe  mailbox is a quarter of a mile away, and the night is beautiful.  By  the<br/>\ntime we get back I feel better.  I fix everybody sandwiches and  potato chips<br/>\nfor supper.  (They think this is great).<br/>\n<br/>\n5:50   I tell Christopher and Benjamin to STOP TALKING AND EAT or I will take<br/>\ntheir  potato chips away.  They cram all the chips into their mouths.   I<br/>\ndecide that we will save manners lessons until Emily is older.<br/>\n<br/>\n6  PM.  Emily wakes up.  I get out the Science in a Nutshell kit that  we’re<br/>\ndoing (Gears) and give everyone gears, then sit down and nurse Emily  while<br/>\nwe go through the project.  Christopher loves to keep his Science  Journal,<br/>\nbut Ben has to be prompted for every question and answer.  I’m  still writing<br/>\nthem down for him, since his penmanship is very slow and  difficult; today my<br/>\nhands are full, so I tell him he gets the day off from  recording his<br/>\nexperiments.  Daniel puts gear stickers on his head and  says, “Look, I’m a<br/>\ngear machine.”<br/>\n<br/>\n7 PM  I tell Ben that we’re not  doing Spanish (again).  “We never get to<br/>\nSpanish,” he says.  This  is unfortunately true.  Maybe I’ll outsource it to<br/>\na neighbor next  year.  I check the lists; Christopher didn’t do his cursive<br/>\npractice,  but I decide that his life will be complete without it.  I tell<br/>\nthe boys  to get their pajamas on and clean up their room while I rock Emily,<br/>\nwho is  screaming (again).<br/>\n<br/>\n7:15  Emily gets happy and everyone wants to hold  her.  We take turns while<br/>\nI read to Daniel.<br/>\n<br/>\n7:30  Daniel  goes to bed.  I play Uno with Christopher and Ben while Emily<br/>\nsits on my  lap.<br/>\n<br/>\n8 PM.  I read Ben a book and put him in bed.  I rock Emily  back to sleep<br/>\nwhile Christopher sits on the sofa and reads.<br/>\n<br/>\n8:30   I send Christopher to bed and put Emily in her cradle.  She<br/>\nimmediately  wakes up and howls.  Eventually I pick her up and pretend I’m<br/>\ndoing  aerobics, which sends back to sleep.  I put her back down and sneak<br/>\nout  of the room.<br/>\n<br/>\n9 PM  Boy, it would be nice to go to  bed.<br/>\n<br/>\n9:30  Lights out for the boys.  Daniel is asleep; I pray  with the two older<br/>\nboys, listen to Christopher’s worries, and answer twelve  questions from Ben.<br/>\nI know Emily will be up to eat again soon, so I decide to  work on e-mail<br/>\nagain until she wakes up.<br/>\n<br/>\nAND A FINAL NOTE TO THIS  PAGE, added June, 2001:  WE DID HAVE A GOOD TIME<br/>\nTHIS DAY!  We  played Uno, messed around with gears, went for a great walk in<br/>\nthe dark, dug  in the sawdust and read three books that kept the boys<br/>\nenthralled.  It  was ALSO frantic and tiring; that&#39;s real life with four<br/>\nchildren under  nine.<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":102459,"nextTopicId":102536}}