{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":33,"messages":[{"userId":4324016,"authorName":"Kelly Lenhart","from":"&quot;Kelly Lenhart&quot; &lt;mina@...&gt;","profile":"mommamina","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] RE: re plug in drug conversation","postDate":"1049145401","msgId":62537,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA0MmMwMWMyZjdjYSRkMzc2YWRlMCQwNTAwMDAwYUBtYWJiLm5ldD4=","referencesHeader":"PDhCMEREOTFDLTYzQkItMTFENy1CNTk3LTAwMDM5M0FGNUEyRUBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":62536,"nextInTopic":62552,"prevInTime":62536,"nextInTime":62538,"topicId":62200,"numMessagesInTopic":0,"msgSnippet":"... I have a 7 and a 2 year old.  Boys.  The big one has outgrown Blues Clues and Dora, but they make good wake up material.  THe little one, of course, adores","messageBody":"<div id=\"ygrps-yiv-1148218044\"><blockquote><span title=\"ireply\">&gt;For example, I think it is really interesting that my kids have<br/>\n&gt;conversations about shows they want to watch together - they take time<br/>\n&gt;to consider each other&#39;s interests and age level and so on. They LIKE<br/>\n&gt;to have their sisters or me watch shows with them because they want to<br/>\n&gt;talk about them later.<br/>\n<br/>\n<br/>\n </span></blockquote>I have a 7 and a 2 year old.  Boys.  The big one has outgrown Blues Clues<br/>\nand Dora, but they make good wake up material.  THe little one, of course,<br/>\nadores them.  IT&#39;s great to watch them watching together.  &quot;Did you see that<br/>\nBen?  There&#39;s the clue!&quot;  &quot;Say map, Ben, say MAP!&quot;  IT&#39;s wonderful.  James<br/>\ngets to enjoy it in a whole new way.<br/>\n<br/>\nAnd I get to do dishes with a BIG SMILE on my face.<br/>\n<br/>\nKelly</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] RE: re plug in drug conversation","postDate":"1049144317","msgId":62536,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhCMEREOTFDLTYzQkItMTFENy1CNTk3LTAwMDM5M0FGNUEyRUBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDAwNGIwMWMyZjc2NCQ1MDM5MDZhMCRkYjk2MWI0MUB5b3VyNXJscDNhOTUxNj4="},"prevInTopic":62529,"nextInTopic":62537,"prevInTime":62535,"nextInTime":62537,"topicId":62200,"numMessagesInTopic":0,"msgSnippet":"... People who do not watch tv seem to have the impression that there is nothing but scary or offensive or just plain stupid reality shows, trashy daytime","messageBody":"<div id=\"ygrps-yiv-979608546\">On Monday, March 31, 2003, at 01:02 AM, Amie wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I agree 100 % with allowing kids to self regulate, but I just can&#39;t <br/>\n&gt; stand the stuff on t.v.<br/>\n<br/>\n </span></blockquote>People who do not watch tv seem to have the impression that there is <br/>\nnothing but scary or offensive or just plain stupid reality shows, <br/>\ntrashy daytime soaps, smartmouthed kids on sitcoms, and scummy talk <br/>\nshows ala Jerry Springer, all mixed in with incessant brainwashing in <br/>\nmaterialism in the form of commercials. But, that makes me wonder, if <br/>\nyou think that, what on earth do you think WE are doing actually <br/>\nwatching it and letting our kids watch it?  Do we, those of us who say <br/>\nwe watch TV and don&#39;t have restrictions placed on our kids&#39; viewing, <br/>\nreally sound like people who are of the kind of mentality that we&#39;re <br/>\ninterested watching that stuff? Do you really think that our kids have <br/>\nbecome product-worshiping I-gotta-have-that consumers and that we&#39;d be <br/>\ndefending that?<br/>\n<br/>\nPeople who have &#39;rules&#39; about TV might want to consider why they need <br/>\nthem? They might wonder about how we handle materialism - in the face <br/>\nof commercials. They might wonder how we handle the possibility that <br/>\nthe kids will see scary stuff or stuff that is too sophisticated or <br/>\nsexually explicit or cruel or demeaning to specific races or to women, <br/>\netc.<br/>\n<br/>\nIf the TV (watch it or don&#39;t) debate could just move up a step to a <br/>\nslightly higher plane of discussion, I think those who do restrict tv <br/>\ntime would discover some interesting things about those of us who do <br/>\nnot. Framed as &quot;restrict tv&quot; versus &quot;no restrictions&quot; misleads those <br/>\nwho don&#39;t really know what the alternatives to &quot;no restrictions really <br/>\nare, and picture our kids sitting zombie-like eyes glued to the tube, <br/>\nwatching whatever pops up in front of them for hours on end. It just is <br/>\nnot like that in any of the no-restrictions households that I know <br/>\nwell. I wish we could talk more about the way kids in our <br/>\nno-restrictions families DO interact with tv - it is really different <br/>\nthan in other families, in my experience, and really well worth taking <br/>\ntime to examine in depth. But we always get distracted by general <br/>\ncomments like, &quot;I just cannot stand the junk on TV,&quot; and we don&#39;t get <br/>\nbeyond it very often.<br/>\n<br/>\nFor example, I think it is really interesting that my kids have <br/>\nconversations about shows they want to watch together - they take time <br/>\nto consider each other&#39;s interests and age level and so on. They LIKE <br/>\nto have their sisters or me watch shows with them because they want to <br/>\ntalk about them later.<br/>\n<br/>\nAnother little interesting thing is how they&#39;ll tape something and <br/>\nwatch it over and over and over and over. I know this isn&#39;t uncommon <br/>\nand I&#39;d like to talk about what is going on when a kid does that - to <br/>\nan extreme.It looks like some kind of brain exercise - the mental <br/>\nequivalent of bouncing a ball against the garage door, over and over.<br/>\n<br/>\nThere are lots of things about kids who don&#39;t have specific <br/>\ntv-limits/rules that are interesting and I wish we could talk about <br/>\nthose without feeling like we have to even address the &quot;no tv/yes tv&quot; <br/>\nissue at all.<br/>\n-pam</div>","specialLinks":[]},{"userId":52496799,"authorName":"sablehs","from":"sablehs &lt;sablehs@...&gt;","profile":"sablehs","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] RE: re plug in drug conversation","postDate":"1049138079","msgId":62529,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMwMzMxMTkxNDM5LjE0NTY5LnFtYWlsQHdlYjExMDAzLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PEJBQURBMDUzLjE2MEYyJWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":62527,"nextInTopic":62536,"prevInTime":62528,"nextInTime":62530,"topicId":62200,"numMessagesInTopic":0,"msgSnippet":"Not to menton that no matter what there is no way to get a completely accurate result in any study. There are so many varibles in the lives of the people of","messageBody":"<div id=\"ygrps-yiv-1387653831\">Not to menton that no matter what there is no way to get a completely accurate result in any study. There are so many varibles in the lives of the people of both sides. <br/>\nJust as my husband and I were talking about second hand smoke but it applies to any study. Yes, they can do as much as they can to get an accurate result. but how about the guy who it seems to have had the same experiances, yet at the very least he may have lived in an area that had smog or worked near a factory that put off pollutants into the air {yes we all have this but some areas are better then others and it varies depending on the year} Or maybe his genetics carried some recessive gene that didn&#39;t show up in his family for generations. Etc... <br/>\nAnyway just an example for my take on studies. I think they are interresting but there are so many varibles that could go overlooked or missed somehow, I tend to rely personal experiances myself. :-) <br/>\nTracy {sorry, spell check on yahoo messed up again}<br/>\n Fetteroll &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a>&gt; wrote: on 3/31/03 4:02 AM, Amie at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:amiersa2@...\">amiersa2@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I have read studies about how our minds become wired one way for t.v. viewing,<br/>\n&gt; and new paths are not made while viewing other shows. It is the same path when<br/>\n&gt; we are 5 that we have when we are 25. It is a passive task to sit there. This<br/>\n&gt; is my opionion, of course.<br/>\n<br/>\n </span></blockquote>Being of a scientific bent, I&#39;m drawn to studies. But what I&#39;ve found is<br/>\nthat real people with real stories of what and how they do things are far<br/>\nmore meaningful. It&#39;s especially true with unschooling families. *All*<br/>\nstudies -- unless they&#39;re specifically about homeschooling -- are done on<br/>\nschooled kids because essentially all kids are schooled kids so that&#39;s the<br/>\nnorm. Researches have *no clue* how huge of an impact school has on<br/>\nchildren&#39;s behavior. By their nature schools are designed to separate kids<br/>\nfrom their parents and create basically a new family for them, a family of<br/>\nteachers and age-mates.<br/>\n<br/>\n<br/>\n<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\nYahoo! Platinum - Watch CBS&#39; NCAA March Madness, live on your desktop!<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141102765,"authorName":"Mary","from":"&quot;Mary&quot; &lt;mummy124@...&gt;","profile":"mummyone24","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] RE: re plug in drug conversation","postDate":"1049137028","msgId":62527,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwOWIwMWMyZjdiNyQ1NDc5MzJhMCQ2MTAxYThjMEBsYXVuY2htb2RlbS5jb20+","referencesHeader":"PDAwNGIwMWMyZjc2NCQ1MDM5MDZhMCRkYjk2MWI0MUB5b3VyNXJscDNhOTUxNj4="},"prevInTopic":62522,"nextInTopic":62529,"prevInTime":62526,"nextInTime":62528,"topicId":62200,"numMessagesInTopic":0,"msgSnippet":"From: Amie  ","messageBody":"<div id=\"ygrps-yiv-169312920\">From: &quot;Amie&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:amiersa2@...\">amiersa2@...</a>&gt;<br/>\n<br/>\n&lt;&lt;I recently said that I limited t.v. again in our house. I have to say that<br/>\nI do wish I was comfortable giving my kids free rein on the t.v. But, I<br/>\ndon&#39;t. Not because I don&#39;t trust them or want them to decide, but because I<br/>\ndo not want them exposed to the garbage that is on. Nor do I want to sit and<br/>\nwatch t.v. &gt;&gt;<br/>\n<br/>\n<br/>\nSeems like you are not trusting what your kids will do with what they see<br/>\nand hear. That&#39;s not trusting them. It&#39;s also a matter of you doing<br/>\nsomething for you children that you just don&#39;t want to do, watch tv.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n&lt;&lt;I mentioned a book once before that I find very interesting, called<br/>\nMagical Parent, Magical Child by Joseph Chilton Pearce. It includes alot of<br/>\nresearch, etc. Again, just one more tool.&gt;&gt;<br/>\n<br/>\n<br/>\nI really don&#39;t take studies and eperts to heart. I would rather listen to<br/>\npeople and what they have done and what has worked and what hasn&#39;t. Seeing<br/>\nis believing and putting it all to practical use makes much more sense to me<br/>\nthan what someone studied. Especially when all the studies are done on<br/>\nchildren I don&#39;t know, don&#39;t know how their parents are with them and who go<br/>\nto school. I know homeschooled children that make homeschooling look really<br/>\nbad. You should see how they are parented. Their behavior has nothing to do<br/>\nwith homeschooling. If someone did a study on those few, it would be<br/>\npitiful.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n&lt;&lt;I want my kids to be able to make decisions for themselves, but why would<br/>\nI let my 5 1/2 year old go see the movie Cody Banks? He really wants to see<br/>\nit, but I just can&#39;t do it. It has violence, it shows women in a demeaning<br/>\nway, etc. How can I justify that? And, I feel if I agree to see it, I am<br/>\nsaying that our values include giving money to people making those kinds of<br/>\nmovies. It makes me sick to see some of the garbage that is offered. He<br/>\nloves movies so I want to be able to say yes to all of them he wants to see,<br/>\nbut I don&#39;t want to polute his head with that junk! I totally trust him, I<br/>\ndo not trust some of the people making t.v. and movies.&gt;&gt;<br/>\n<br/>\n<br/>\nI still don&#39;t see how you can say you trust your child when you are not<br/>\ntrusting them to make good sound decisions, learn from mistakes and reason<br/>\nout for themselves what is best.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n&lt;&lt;I agree 100 % with allowing kids to self regulate, but I just can&#39;t stand<br/>\nthe stuff on t.v. They have access to watching movies and dvd&#39;s, but I do<br/>\nsay no to some of the movies they want. And we talk about why. The world is<br/>\nflooded with so much junk, I want to try and limit the amount they see  or<br/>\nat least delay it. It is inevitable in our world.&gt;&gt;<br/>\n<br/>\n<br/>\nYou can&#39;t possibly agree 100% with allowing them to self regulate when you<br/>\nonly allow them to regulate certain things. It&#39;s either you do or you don&#39;t.<br/>\nLike unschooling except for math. Makes no sense.<br/>\n<br/>\nI&#39;m just wondering if limiting them from all the junk and garbage you say tv<br/>\nand movies hold, if you wondered what will happen when they finally see it.<br/>\nAnd they will. Probably at an age of more curiousity, like in their teens.<br/>\nAgain I have to go by what I&#39;ve seen and heard, not studies. Those kids all<br/>\nof sudden exposed go nuts. They want to see it all, no matter what it is.<br/>\nIt&#39;s new and exciting at a time where exciting is more entailed than when<br/>\nthey were little.<br/>\n<br/>\nI had a friend who sheltered her son from violence and what she thought was<br/>\nattitudes demeaning to women. Her son gradually grew older and wanted to see<br/>\na Lethal Weapon movie. Not sure which one but there was a scene where you<br/>\nsaw a women and some cleavage or maybe the side or top ofher boobs. She<br/>\nwasn&#39;t even big up top and the son, in the movie theater yelled out totally<br/>\nexcited that he wanted to see more. Now I&#39;m not saying all kids do that, but<br/>\nthat reaction is very similar with children not use to it and not being able<br/>\nto ask in a very innocent way what&#39;s going on. His hormones were talking and<br/>\nhe never saw boob before. Children I know of raised like that usually get<br/>\nvery excited and want to see everything they can and will sneak to do it, or<br/>\nbecome very embarassed by it all and never ask a thing. Either way, not<br/>\nhealthy.<br/>\n<br/>\nMary B</div>","specialLinks":[]},{"userId":116722173,"authorName":"Dawn Ackroyd","from":"&quot;Dawn Ackroyd&quot; &lt;dackroyd@...&gt;","profile":"rvp4citi","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [Unschooling-dotcom] re plug in drug conversation","postDate":"1049133739","msgId":62522,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxNDMwMWMyZjdhZiRhYmNlZjYwMCRmNzc0Y2VjZEBhYi5oc2lhLnRlbHVzLm5ldD4=","inReplyToHeader":"PDAwMDAwMWMyZjZiZiQ2MTJlYWFmMCRiN2ViMTg0MUB5b3VyNmtyNHp4bGQ5MD4="},"prevInTopic":62499,"nextInTopic":62527,"prevInTime":62521,"nextInTime":62523,"topicId":62200,"numMessagesInTopic":0,"msgSnippet":"Good analogy!! ... From: Sorcha [mailto:sorcha-aisling@insight.rr.com] Sent: Sunday, March 30, 2003 6:22 AM To: Unschooling-dotcom@yahoogroups.com Subject: RE:","messageBody":"<div id=\"ygrps-yiv-573124521\">Good analogy!!<br/>\n<br/>\n-----Original Message-----<br/>\nFrom: Sorcha [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sorcha-aisling@...\">sorcha-aisling@...</a>] <br/>\nSent: Sunday, March 30, 2003 6:22 AM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a><br/>\nSubject: RE: [Unschooling-dotcom] re plug in drug conversation<br/>\n<br/>\n<br/>\nI&#39;m going to make an analogy, since I&#39;m usually able to think more<br/>\nclearly about something when I look at it from a different angle.<br/>\nInstead of television, let&#39;s say internet.  Presumably we all have<br/>\ninternet access in our homes (at least all of us who are posting).  If<br/>\nyou&#39;re posting but don&#39;t have access at home, then you&#39;re spending a lot<br/>\nof time somewhere that has internet access, so it&#39;s important enough for<br/>\nyou to do so.<br/>\n<br/>\nI think the internet was the single best invention humans ever made.<br/>\nHonestly.  There is so much information on the internet that you could<br/>\ntravel to every library in your state and spend hours per day looking<br/>\nand still not find as much as you can find in a one hour search online.<br/>\nWith the internet, people can form communities with like-minded people,<br/>\neven if some of them are in Arkansas and others in Australia.  On the<br/>\ninternet, you aren&#39;t being judged by your hairstyle or clothes or weight<br/>\nor age.<br/>\n<br/>\nMy mother wishes there was no such thing as the internet.  She hates it.<br/>\nShe&#39;s a librarian, and ever since they got the internet a few years ago,<br/>\nshe has unemployed men coming in and spending all day looking up porn.<br/>\nThere was one man who kept looking up not only porn, but also violent<br/>\nthings like how to make bombs.  One day he came into the library naked<br/>\nand screaming at the top of his lungs, wielding a huge knife.  He<br/>\nstabbed the counter over and over before the police got there.  <br/>\n<br/>\nPorn and instructions on explosives are not the only things the internet<br/>\nhas against it.  People cheat on their spouses with people they met in<br/>\nchat rooms.  People stalk other people, and perverts prey on children.<br/>\nNot to mention just the simple stupidity of some sites.  My husband had<br/>\nto work late one night and I was bored so I passed the time reading an<br/>\nentire site about farts.<br/>\n<br/>\nBut we&#39;re all here, on the internet, despite all the bad things it can<br/>\nbe used for.  We&#39;re all learning more about unschooling and probably<br/>\nlearning many more things with the internet.  I doubt any of us are<br/>\nlearning how to make bombs or preying on children.  <br/>\n<br/>\nMy mom says the thing she hates most about the internet is how people<br/>\nare on it all day.  I have a cable connection that allows my computer to<br/>\nbe online all day.  I love it.  I don&#39;t sit here staring at my computer<br/>\nall day, but anytime I want to use it for any reason, I can.  It&#39;s right<br/>\nthere in my living room, next to the TV and a bookshelf, and I can check<br/>\nmy email during the two minutes my hot pocket is microwaving and go<br/>\nabout my day.  I&#39;m on it less than the people my mom talks about coming<br/>\ninto the library when they open and sitting there until closing, just<br/>\nusing the internet.  I could be on it 24 hours a day.  I&#39;m probably on<br/>\nit 45 minutes per day.<br/>\n<br/>\nSince you&#39;re online reading this, please explain to me how the bad<br/>\nthings about TV are worse than the bad things about the internet.<br/>\n<br/>\nSorcha<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\nYahoo! Groups Sponsor\t<br/>\n<br/>\nADVERTISEMENT<br/>\n <br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://rd.yahoo.com/M=246920.2960106.4328965.1728375/D=egroupweb/S=1705\">http://rd.yahoo.com/M=246920.2960106.4328965.1728375/D=egroupweb/S=1705</a><br/>\n081972:HM/A=1513703/R=0/*<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.gotomypc.com/u/tr/yh/cpm/grp/300_06F\">http://www.gotomypc.com/u/tr/yh/cpm/grp/300_06F</a><br/>\n/g22lp?Target=mm/g22lp.tmpl&gt; \t<br/>\n <br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://us.adserver.yahoo.com/l?M=246920.2960106.4328965.1728375/D=egrou\">http://us.adserver.yahoo.com/l?M=246920.2960106.4328965.1728375/D=egrou</a><br/>\npmail/S=:HM/A=1513703/rand=728919967&gt; \t<br/>\n<br/>\n~~~~ Don&#39;t forget! If you change topics, change the subject line! ~~~~<br/>\n<br/>\nIf you have questions, concerns or problems with this list, please email<br/>\nthe moderator, Joyce Fetteroll (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a>), or the list<br/>\nowner, Helen Hegener (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Editor@...\">HEM-Editor@...</a>).<br/>\n<br/>\nTo unsubscribe from this group, click on the following link or address<br/>\nan email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-unsubscribe@yahoogroups.com\">Unschooling-dotcom-unsubscribe@yahoogroups.com</a> <br/>\n<br/>\nVisit the Unschooling website: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> <br/>\n<br/>\nYour use of Yahoo! Groups is subject to the Yahoo! Terms of Service<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a>&gt; . <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] RE: re plug in drug conversation","postDate":"1049114148","msgId":62499,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBQURBMDUzLjE2MEYyJWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDAwNGIwMWMyZjc2NCQ1MDM5MDZhMCRkYjk2MWI0MUB5b3VyNXJscDNhOTUxNj4="},"prevInTopic":62494,"nextInTopic":62522,"prevInTime":62498,"nextInTime":62500,"topicId":62200,"numMessagesInTopic":0,"msgSnippet":"... We assume when we use judgemental words like garbage that there s some universally accepted definition. Your idea of garbage isn t the same as your ","messageBody":"<div id=\"ygrps-yiv-1340141708\">on 3/31/03 4:02 AM, Amie at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:amiersa2@...\">amiersa2@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But, I don&#39;t. Not because I don&#39;t trust them or want them to decide, but<br/>\n&gt; because I do not want them exposed to the garbage that is on.<br/>\n<br/>\n </span></blockquote>We assume when we use judgemental words like garbage that there&#39;s some<br/>\nuniversally accepted definition. Your idea of garbage isn&#39;t the same as your<br/>\nchildren&#39;s idea or my idea or my husband&#39;s idea. So what&#39;s your definition?<br/>\n<br/>\nAnd why do you think your children will watch garbage? Because they don&#39;t<br/>\nknow how to change the channel? Because the pull of TV is so powerful that<br/>\nthey won&#39;t be able to change the channel even though what they&#39;re seeing<br/>\nmakes them uncomfortable? Because TV will convince them that garbage is<br/>\ngood?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I have read studies about how our minds become wired one way for t.v. viewing,<br/>\n&gt; and new paths are not made while viewing other shows. It is the same path when<br/>\n&gt; we are 5 that we have when we are 25. It is a passive task to sit there. This<br/>\n&gt; is my opionion, of course.<br/>\n<br/>\n </span></blockquote>Being of a scientific bent, I&#39;m drawn to studies. But what I&#39;ve found is<br/>\nthat real people with real stories of what and how they do things are far<br/>\nmore meaningful. It&#39;s especially true with unschooling families. *All*<br/>\nstudies -- unless they&#39;re specifically about homeschooling -- are done on<br/>\nschooled kids because essentially all kids are schooled kids so that&#39;s the<br/>\nnorm. Researches have *no clue* how huge of an impact school has on<br/>\nchildren&#39;s behavior. By their nature schools are designed to separate kids<br/>\nfrom their parents and create basically a new family for them, a family of<br/>\nteachers and age-mates.<br/>\n<br/>\nThat seems harsh but when you look at it objectively, the major portion of a<br/>\nchild&#39;s day is spent in school or preparing for school. Much of the<br/>\ninteractions between child and parent have to do with school. But even more<br/>\nimportantly, those hours spent under the influence of school are when the<br/>\nchild is presented with challenges to test their values on. They are alone<br/>\nin one sense since they don&#39;t have their parents to support them and help<br/>\nthem. And they are dependent on peers and teachers in another sense to see<br/>\nwhat values are useful and how they play out in action.<br/>\n<br/>\nAnd it&#39;s not just that peers and teachers may have values that we&#39;d rather<br/>\nour children not pick up. They have values that are unique to school. For<br/>\ninstance we value helping each other but in school that&#39;s a big taboo. And<br/>\nwhen kids get home that bond between parent and child isn&#39;t as strong as it<br/>\nshould be and kids won&#39;t share the things they&#39;re working through. They&#39;re<br/>\ngetting used to -- in fact their parents are *forcing* them to -- watching<br/>\nand figuring out solutions on their own. TV is going to be another resource<br/>\nto them of values and how those values play out for them.<br/>\n<br/>\nIt takes some powerful communication skills for families to maintain the<br/>\nclose ties they have with their kids before beginning school. Schooled kids<br/>\nare far more influenced in their values by sources outside their families.<br/>\n<br/>\nIn a loving home where children are respected and where the parents are<br/>\ninvolved with their kids lives (not glued to them but are with them and<br/>\naware of what&#39;s going on with them and what interests them) TV loses much of<br/>\nthe power that is found in homes where children are leading separate lives<br/>\nfrom their families.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I also just read another study that followed people from childhood until into<br/>\n&gt; the adult years, and the ones that watched violence, (shows like Baretta when<br/>\n&gt; they were younger), were more violent as adults. They were more likely to<br/>\n&gt; strike a spouse, be in trouble with the law, etc.<br/>\n<br/>\n </span></blockquote>And you can find studies that say the opposite. The studies only study<br/>\n*what* and not why. Did the violent shows *create* violent adults? The<br/>\nstudies imply that. Or are children who are filled with frustrated emotions<br/>\nwho don&#39;t know what to do with them, who are in danger of becoming violent,<br/>\ndrawn to violent shows?<br/>\n<br/>\nSince many peaceful people enjoy watching violence that&#39;s a huge piece of<br/>\ndata that contradict the studies. *Why* someone is drawn to something is far<br/>\nmore important than *what* they are drawn to.<br/>\n<br/>\nEven though why is a far more important influence it&#39;s very difficult to<br/>\ndesign studies to study it. So researchers stick to studying what.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I agree 100 % with allowing kids to self regulate, but I just can&#39;t stand the<br/>\n&gt; stuff on t.v.<br/>\n<br/>\n </span></blockquote>Then you don&#39;t agree 100%. You only agree to the point where your kids are<br/>\nmaking the same choices you would for them.<br/>\n<br/>\nI don&#39;t think you realize this but your opinions are saying that you feel<br/>\nthat violence and disrespect is more attractive than feeling loved so your<br/>\nkids will turn their backs on what makes them feel good in order to hurt<br/>\npeople.<br/>\n<br/>\nWhy do you think they&#39;d do that?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I want my kids to be able to make decisions for themselves, but why would I<br/>\n&gt; let my 5 1/2 year old go see the movie Cody Banks? He really wants to see it,<br/>\n&gt; but I just can&#39;t do it. It has violence, it shows women in a demeaning way,<br/>\n&gt; etc. How can I justify that?<br/>\n<br/>\n </span></blockquote>By trusting that your loving home offers his soul far more than a movie<br/>\ncould. Why would he value the values expressed in movie more than the values<br/>\nyou practice at home and the values that make him feel loved and cherished?<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: re plug in drug conversation","postDate":"1049102428","msgId":62494,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBQUQ3MjhDLjE2MEU0JWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDAwNTQwMWMyZjc2NCRjZjE2NzE2MCRkYjk2MWI0MUB5b3VyNXJscDNhOTUxNj4="},"prevInTopic":62492,"nextInTopic":62499,"prevInTime":62493,"nextInTime":62495,"topicId":62200,"numMessagesInTopic":0,"msgSnippet":"... How does it affect them? Perhaps what enjoyment they get from the food is worth the consequences they ll suffer later. Perhaps the effect is so far removed","messageBody":"<div id=\"ygrps-yiv-688279954\">on 3/31/03 4:06 AM, Amie at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:amiersa2@...\">amiersa2@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; We have talked about food and how it can affect our bodies, but they keep<br/>\n&gt; eating the stuff that makes them feel bad.<br/>\n<br/>\n </span></blockquote>How does it affect them? Perhaps what enjoyment they get from the food is<br/>\nworth the consequences they&#39;ll suffer later. Perhaps the effect is so far<br/>\nremoved in time that it doesn&#39;t seem connected. A couple of hours to a 5 yo<br/>\nmay seem like a day later. Perhaps they aren&#39;t aware enough of the change<br/>\n(if it&#39;s behavioral). From the outside hyper is a pretty dramatic change.<br/>\nFrom the inside it doesn&#39;t feel that different. They may need help in<br/>\nidentifying the subtle (to them) feelings.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":133126509,"authorName":"Amie","from":"&quot;Amie&quot; &lt;amiersa2@...&gt;","profile":"mascire2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: re plug in drug conversation","postDate":"1049101585","msgId":62492,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNTQwMWMyZjc2NCRjZjE2NzE2MCRkYjk2MWI0MUB5b3VyNXJscDNhOTUxNj4="},"prevInTopic":62490,"nextInTopic":62494,"prevInTime":62491,"nextInTime":62493,"topicId":62200,"numMessagesInTopic":0,"msgSnippet":"I also wanted to ask a question about the food subject. My kids pretty much eat what they want. However, I think they both have some food intolerances, so what","messageBody":"<div id=\"ygrps-yiv-948383396\">I also wanted to ask a question about the food subject. My kids pretty much eat what they want. However, I think they both have some food intolerances, so what do you do about this? They are both 5 1/2. We have talked about food and how it can affect our bodies, but they keep eating the stuff that makes them feel bad. I do think sometimes we crave what our bodies are allergic to. <br/>\n<br/>\nSo, how would you handle this?<br/>\n<br/>\nThanks,<br/>\nAmie<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":133126509,"authorName":"Amie","from":"&quot;Amie&quot; &lt;amiersa2@...&gt;","profile":"mascire2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: re plug in drug conversation","postDate":"1049101373","msgId":62490,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNGIwMWMyZjc2NCQ1MDM5MDZhMCRkYjk2MWI0MUB5b3VyNXJscDNhOTUxNj4="},"prevInTopic":62486,"nextInTopic":62492,"prevInTime":62489,"nextInTime":62491,"topicId":62200,"numMessagesInTopic":0,"msgSnippet":"I have not had alot of time to respond to this thread, but I am reading the posts off and on. I recently said that I limited t.v. again in our house. I have to","messageBody":"<div id=\"ygrps-yiv-342423419\">I have not had alot of time to respond to this thread, but I am reading the posts off and on.<br/>\n<br/>\nI recently said that I limited t.v. again in our house. I have to say that I do wish I was comfortable giving my kids free rein on the t.v. But, I don&#39;t. Not because I don&#39;t trust them or want them to decide, but because I do not want them exposed to the garbage that is on. Nor do I want to sit and watch t.v. <br/>\n<br/>\nI have read studies about how our minds become wired one way for t.v. viewing, and new paths are not made while viewing other shows. It is the same path when we are 5 that we have when we are 25. It is a passive task to sit there. This is my opionion, of course. I also just read another study that followed people from childhood until into the adult years, and the ones that watched violence, (shows like Baretta when they were younger), were more violent as adults. They were more likely to strike a spouse, be in trouble with the law, etc. I am not saying this is the case for all, of course, I just thought it was interesting.<br/>\n<br/>\nI mentioned a book once before that I find very interesting, called Magical Parent, Magical Child by Joseph Chilton Pearce. It includes alot of research, etc. Again, just one more tool. <br/>\n<br/>\nI want my kids to be able to make decisions for themselves, but why would I let my 5 1/2 year old go see the movie Cody Banks? He really wants to see it, but I just can&#39;t do it. It has violence, it shows women in a demeaning way, etc. How can I justify that? And, I feel if I agree to see it, I am saying that our values include giving money to people making those kinds of movies. It makes me sick to see some of the garbage that is offered. He loves movies so I want to be able to say yes to all of them he wants to see, but I don&#39;t want to polute his head with that junk! I totally trust him, I do not trust some of the people making t.v. and movies.<br/>\n<br/>\nI agree 100 % with allowing kids to self regulate, but I just can&#39;t stand the stuff on t.v. They have access to watching movies and dvd&#39;s, but I do say no to some of the movies they want. And we talk about why. The world is flooded with so much junk, I want to try and limit the amount they see  or at least delay it. It is inevitable in our world.<br/>\n<br/>\nJust my opinion...<br/>\n<br/>\nAmie <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1572768,"authorName":"Stephanie Elms","from":"&quot;Stephanie Elms&quot; &lt;stephanie.elms@...&gt;","profile":"elmsfam","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [Unschooling-dotcom] Libraries, was Re: re plug in drug conversation","postDate":"1049094749","msgId":62486,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlENkNGOUNFQTc2ODNDNEQ4RjQxNUEzRjU0RDFDMDY2MDEyRjdEOUZAZHN0cDEuZGVsdGFzb2x1dGlvbnMuY29tPg=="},"prevInTopic":62479,"nextInTopic":62490,"prevInTime":62485,"nextInTime":62487,"topicId":62200,"numMessagesInTopic":0,"msgSnippet":"... Hmmm. That is interesting...we have a great computerized library system and still have the little card in the back. :o) I love our computerized system. I","messageBody":"<div id=\"ygrps-yiv-254578410\"><blockquote><span title=\"ireply\">&gt; AFA card catalogs go, our library has a new computerized system that <br/>\n&gt; somehow manages to be infinitely slower than the old one. Hey, I&#39;m a <br/>\n&gt; big fan of technology, worked in high tech for a decade, but I&#39;m not <br/>\n&gt; sure what the point is if it makes everything harder to use and <br/>\n&gt; slower. And call me weird, but I miss having a little card in each <br/>\n&gt; book that tells me when that particular book is due (as opposed to a <br/>\n&gt; gigantic printout slip that I somehow always misplace and have to <br/>\n&gt; scroll down visually to find my books, or an online library system <br/>\n&gt; that is so dog slow from my modem that I give up before I can check <br/>\n&gt; what&#39;s due).<br/>\n&gt; To unsubscribe from this group, click on the following link <br/>\n<br/>\n </span></blockquote>Hmmm. That is interesting...we have a great computerized library system and<br/>\nstill have the little card in the back. :o) I love our computerized system.<br/>\nI can access it at home, put holds on books and they call me when they come in<br/>\n(especially handy when the book is at another library).<br/>\nOr I can look up the call number for my books at home so that I can find them<br/>\neasier (we always look up the boys books together at the library but they start<br/>\ngetting antsy when I look up books for me. Oh, I can also renew online and check<br/>\nand see what fines I have due. :o) Or identify any books that we have not returned.<br/>\n<br/>\nRight now I have a hold on the new Harry Potter book...I wonder how many people<br/>\nare before me! I hate buying hard covers but I don&#39;t want to wait for the book<br/>\nto come out in soft cover!<br/>\n<br/>\nStephanie E.</div>","specialLinks":[]},{"userId":8378727,"authorName":"zenmomma *","from":"&quot;zenmomma *&quot; &lt;zenmomma@...&gt;","profile":"zenmomma2kids","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] re plug in drug conversation","postDate":"1049080555","msgId":62479,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTEtRjQydUg1TTJCTEl0MVQwMDA1NzkwY0Bob3RtYWlsLmNvbT4="},"prevInTopic":62476,"nextInTopic":62486,"prevInTime":62478,"nextInTime":62480,"topicId":62200,"numMessagesInTopic":0,"msgSnippet":"... I don t think you raised hackles, just prompted responses and discussion. ... I don t think anyone here is out to blast anyone personally. We re all just ","messageBody":"<div id=\"ygrps-yiv-2052801803\"><blockquote><span title=\"ireply\">&gt;&gt;So, I guess I raised some hackles with my last post.&gt;&gt;<br/>\n<br/>\n </span></blockquote>I don&#39;t think you raised hackles, just prompted responses and discussion.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I&#39;m sure I&#39;ll be blasted again with anything I say as it seems that the <br/>\n&gt;&gt;dissenters on this thread have dropped off but that&#39;s OK. &gt;&gt;<br/>\n<br/>\n </span></blockquote>I don&#39;t think anyone here is out to blast anyone personally. We&#39;re all just <br/>\ntalking ideas. This particular topic is the idea that you can allow children <br/>\nmore choices than you might have previously considered. It&#39;s worth <br/>\ndiscussing here! These kinds of ideas don&#39;t get discussed in the mainstream. <br/>\nContolling children and making their &quot;big&quot; decisions for them is the norm.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;We like to watch with the kids so we can talk about what they are <br/>\n&gt;&gt;seeing.&gt;&gt;<br/>\n<br/>\n </span></blockquote>That&#39;s great. I like to know what the kids are watching too. That&#39;s why I <br/>\nlike the TV in the family room. I can hear it even if I don&#39;t watch every <br/>\nmoment. I float in and out of their show or movie as I do other things <br/>\naround the house.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I know I would have spent many hours on my butt watching idiotic shows and <br/>\n&gt;&gt;commercials.&gt;&gt;<br/>\n<br/>\n </span></blockquote>You *can&#39;t* know that. Maybe it would have become so commonplace that it <br/>\nwould have lost its mojo over you. Maybe you would have been attracted to <br/>\nonly one or two cool shows and turned it off for the rest. And you should <br/>\ngive yourself more credit. Why would you spend the majority of your time <br/>\nwith idiocy? You seem pretty intelligent to me. :o)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;With the tv out of the living space he can do that without the rest of us <br/>\n&gt;&gt;having to hear Jay Lenno or whoever is on late night now, without the rest <br/>\n&gt;&gt;of us having that junk interfere with our dreams.&gt;&gt;<br/>\n<br/>\n </span></blockquote>I&#39;ve never had Jay Leno interfere with my dreams thank goodness. Maybe I <br/>\nshould watch a good Brad Pitt movie before bed and wish real hard. &lt;g&gt;<br/>\n<br/>\nJust kidding. But I do notice a lot of really loaded words in your post like <br/>\njunk, idiotic, mindless, etc.  And now you&#39;re giving the tv potential <br/>\ncontrol of your dreams. That&#39;s a lot of negative energy right there, flowing <br/>\nfrom your words.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I know kids who have never had boundries with their parents.  They are <br/>\n&gt;&gt;allowed to have coke and cookies for breakfast adn watch r rated movies at <br/>\n&gt;&gt;age 6.  This doesn&#39;t serve the child in the long run as they feel so alone <br/>\n&gt;&gt;in their decision making.&gt;&gt;<br/>\n<br/>\n </span></blockquote>Neglect is not unschooling is not mindful parenting.<br/>\n<br/>\nI wouldn&#39;t want my children to feel alone in their decision making and <br/>\nthat&#39;s why I try to talk through decisions with them. Helping them <br/>\nunderstand the potential consequences of their decisons is way different <br/>\nfrom setting up rules and set-in-stone age limits and such.<br/>\n<br/>\nSweets in the morning won&#39;t kill a kid. Casey has had a cookie first thing <br/>\nseveral times this week because Girl Scout cookies are here. They&#39;re only <br/>\naround once a year and are very special. :o) She then goes on to have <br/>\nregular breakfast. R rated movies are decided on a case by case basis. <br/>\nShakespeare in Love got an R rating and I just love watching that with my <br/>\nkids. I&#39;m not going to turn down a movie based on ratings alone.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;Sorry to open another whole can of worms but here goes.....&gt;&gt;<br/>\n<br/>\n </span></blockquote>It&#39;s not a can of worms, it&#39;s a good discussion. :o) I think it&#39;s cool you <br/>\nbrought it up knowing you were going to be disagreed with here. To me it <br/>\nmeans you&#39;re open-minded and thinking.<br/>\n<br/>\nLife is good.<br/>\n~Mary<br/>\n<br/>\n&quot;The miracle is not to walk on water. The miracle is to walk on the green <br/>\nearth, dwelling deeply in the present moment and feeling truly alive.&quot;<br/>\n<br/>\n                      ~ Thich Nhat Hanh<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n_________________________________________________________________<br/>\nAdd photos to your e-mail with MSN 8. Get 2 months FREE*.  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://join.msn.com/?page=features/featuredemail\">http://join.msn.com/?page=features/featuredemail</a></div>","specialLinks":[]},{"userId":8226888,"authorName":"the_clevengers","from":"&quot;the_clevengers&quot; &lt;diamondair@...&gt;","profile":"the_clevengers","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Libraries, was Re: re plug in drug conversation","postDate":"1049074030","msgId":62476,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGI2ODVoZSs3cGdyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwMjgwMWMyZjcyMSQ5Y2Q1NDg0MCRlMDE5MzJkMkBtYXJrPg=="},"prevInTopic":62473,"nextInTopic":62479,"prevInTime":62475,"nextInTime":62477,"topicId":62200,"numMessagesInTopic":0,"msgSnippet":"... same ... Weird. I wonder if they have the same restrictions on their pay phones. After all, you could phone a bomb threat to the White House from there as","messageBody":"<div id=\"ygrps-yiv-1505744907\"><blockquote><span title=\"ireply\">&gt; At the first one, when they were rearranging to make room for a<br/>\n&gt; computer center, I commented to the lady checking out my books how<br/>\n&gt; neat it was that they were going to be getting all of these<br/>\n&gt; computers.  She started going on about how she&#39;s not a computer<br/>\n&gt; teacher, no one had better ask her how to use them, etc.  At the <br/>\n </span></blockquote>same<br/>\n<blockquote><span title=\"ireply\"> &gt; library, I heard that the board turned down a grant that would have<br/>\n&gt; allowed them to computerize their system.  They prefer the &quot;old<br/>\n&gt; fashioned card catalog&quot;.  They don&#39;t allow people to email anyone or<br/>\n&gt; access chat rooms or message boards using their computers.  I asked<br/>\n&gt; what their reasoning was behind that rule and they told me, &quot;Because<br/>\n&gt; someone might email a bomb threat to the white house and then it<br/>\n&gt; would come back that it happened from our computer&quot;.<br/>\n<br/>\n<br/>\n </span></blockquote>Weird. I wonder if they have the same restrictions on their pay <br/>\nphones. After all, you could phone a bomb threat to the White House <br/>\nfrom there as well. <br/>\n<br/>\nAFA card catalogs go, our library has a new computerized system that <br/>\nsomehow manages to be infinitely slower than the old one. Hey, I&#39;m a <br/>\nbig fan of technology, worked in high tech for a decade, but I&#39;m not <br/>\nsure what the point is if it makes everything harder to use and <br/>\nslower. And call me weird, but I miss having a little card in each <br/>\nbook that tells me when that particular book is due (as opposed to a <br/>\ngigantic printout slip that I somehow always misplace and have to <br/>\nscroll down visually to find my books, or an online library system <br/>\nthat is so dog slow from my modem that I give up before I can check <br/>\nwhat&#39;s due).<br/>\n<br/>\nBlue Skies,<br/>\n<br/>\n-Robin-</div>","specialLinks":[]},{"userId":139187074,"authorName":"MARK and JULIE SOLICH","from":"&quot;MARK and JULIE SOLICH&quot; &lt;mjsolich@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: re plug in drug conversation","postDate":"1049072724","msgId":62473,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMjgwMWMyZjcyMSQ5Y2Q1NDg0MCRlMDE5MzJkMkBtYXJrPg==","referencesHeader":"PGI2N2IxYSt0NGM2QGVHcm91cHMuY29tPg=="},"prevInTopic":62458,"nextInTopic":62476,"prevInTime":62472,"nextInTime":62474,"topicId":62200,"numMessagesInTopic":0,"msgSnippet":"We must have the world s greatest librarians. The one responsible  for buying new stock is always getting CD Roms too and she plays on them for awhile so that","messageBody":"<div id=\"ygrps-yiv-281551795\">We must have the world&#39;s greatest librarians. The one responsible  for<br/>\nbuying new stock is always getting CD Roms too and she plays on them for<br/>\nawhile so that she can help anyone who has problems with them. I remember<br/>\nwhen a Carmen Sandiego CDRom came in and she knew we were waiting  for it,<br/>\nshe hunted me out in the library to give it to me because she was excited<br/>\nabout sharing it!<br/>\n<br/>\nJulie<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message -----<br/>\nFrom: &quot;kayb85&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sheran@...\">sheran@...</a>&gt;<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a>&gt;<br/>\nSent: Monday, March 31, 2003 1:54 AM<br/>\nSubject: [Unschooling-dotcom] Re: re plug in drug conversation<br/>\n<br/>\n<br/>\n&gt;<br/>\n&gt; &gt; My mother wishes there was no such thing as the internet.  She<br/>\n&gt; hates it.<br/>\n&gt; &gt; She&#39;s a librarian, and ever since they got the internet a few years<br/>\n&gt; ago,<br/>\n&gt; &gt; she has unemployed men coming in and spending all day looking up<br/>\n&gt; porn.<br/>\n&gt; &gt; There was one man who kept looking up not only porn, but also<br/>\n&gt; violent<br/>\n&gt; &gt; things like how to make bombs.  One day he came into the library<br/>\n&gt; naked<br/>\n&gt; &gt; and screaming at the top of his lungs, wielding a huge knife.  He<br/>\n&gt; &gt; stabbed the counter over and over before the police got there.<br/>\n&gt;<br/>\n&gt; I know this wasn&#39;t your point in the whole analogy (and it was a good<br/>\n&gt; analogy), but I just had to comment that at the two libraries that we<br/>\n&gt; go to most often, the librarians really don&#39;t like the computers.<br/>\n&gt;<br/>\n&gt; At the first one, when they were rearranging to make room for a<br/>\n&gt; computer center, I commented to the lady checking out my books how<br/>\n&gt; neat it was that they were going to be getting all of these<br/>\n&gt; computers.  She started going on about how she&#39;s not a computer<br/>\n&gt; teacher, no one had better ask her how to use them, etc.  At the same<br/>\n&gt; library, I heard that the board turned down a grant that would have<br/>\n&gt; allowed them to computerize their system.  They prefer the &quot;old<br/>\n&gt; fashioned card catalog&quot;.  They don&#39;t allow people to email anyone or<br/>\n&gt; access chat rooms or message boards using their computers.  I asked<br/>\n&gt; what their reasoning was behind that rule and they told me, &quot;Because<br/>\n&gt; someone might email a bomb threat to the white house and then it<br/>\n&gt; would come back that it happened from our computer&quot;.<br/>\n&gt;<br/>\n&gt; At the second library we sometimes go to, they are just kind of rude<br/>\n&gt; about everything.  They seem annoyed and bothered when you ask about<br/>\n&gt; using the computers, but then again they seem annoyed and bothered<br/>\n&gt; about everything! lol<br/>\n&gt;<br/>\n&gt; Sheila<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ~~~~ Don&#39;t forget! If you change topics, change the subject line! ~~~~<br/>\n&gt;<br/>\n&gt; If you have questions, concerns or problems with this list, please email<br/>\nthe moderator, Joyce Fetteroll (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a>), or the list owner,<br/>\nHelen Hegener (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Editor@...\">HEM-Editor@...</a>).<br/>\n&gt;<br/>\n&gt; To unsubscribe from this group, click on the following link or address an<br/>\nemail to:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-unsubscribe@yahoogroups.com\">Unschooling-dotcom-unsubscribe@yahoogroups.com</a><br/>\n&gt;<br/>\n&gt; Visit the Unschooling website: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n&gt;<br/>\n&gt; Your use of Yahoo! Groups is subject to <a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a><br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":52496799,"authorName":"sablehs","from":"sablehs &lt;sablehs@...&gt;","profile":"sablehs","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] re plug in drug conversation","postDate":"1049057491","msgId":62458,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMwMzMwMjA1MTMxLjI0NDA3LnFtYWlsQHdlYjExMDAzLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDEwOC4yMTMxYmNhMC4yYmI4NzY1MEBhb2wuY29tPg=="},"prevInTopic":62452,"nextInTopic":62473,"prevInTime":62457,"nextInTime":62459,"topicId":62200,"numMessagesInTopic":0,"msgSnippet":"SandraDodd@aol.com wrote: My husband loves action adventure stuff like Die Hard.   If it has spies and bombs and helicopters, he s there.  So the kids have","messageBody":"<div id=\"ygrps-yiv-1917228208\"><a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> wrote:<br/>\n<br/>\n My husband loves action adventure stuff <br/>\nlike Die Hard.   If it has spies and bombs and helicopters, he&#39;s there.  So <br/>\nthe kids have walked in and out on stuff like that, sometimes gotten <br/>\ninterested, sometimes not.  <br/>\n<br/>\n <br/>\n<br/>\n &lt;&lt;&lt;I bought Marty an autographed copy of Jay and Silent Bob Strike back for <br/>\nChristmas, and a t-shirt to go with it.  Yet Marty is a considerate boy who <br/>\nwatches cartoons with his little sister and plays Harry Potter with her <br/>\nfriends.&gt;&gt;<br/>\n<br/>\n<br/>\nHusband and I saw that at the movies {one of the very few dates we have been on since we have been married} and then rented it so the kids could see it when it came out on video. I got my husband 2 sets of action figures {the first set was opened, by my then 2 year old, when my back was turned}. {one of the things my husband has collected is cool action figures and keeps them packaged up}<br/>\n<br/>\nWe own Mall Rats, Dogma, and Chasing Amy but haven&#39;t gotten around to own Jay and Silent Bob Strike Back yet because we have a DVD now and want to start getting that format. {and a little low of funds right now}<br/>\n<br/>\nThey watch all kinds of scary movies but I thought it was interresting to note you can never know what will be scary. Kessa {my middle daughter} has watched &quot;Freddy&quot; with her sister with no problems, but when watching Dogma, she was  scared to go to the bathroom alone for a while because of the &quot;sh*t demon&quot; {we called him the doodie monster} but after we were there with her all the time she needed us she ended up fine.<br/>\n<br/>\nWe also own some Cheech and Chong movies &lt;gasp&gt; and they think it&#39;s funny but with most of the things, like you said they come and go depending on their moods.<br/>\n<br/>\nTracy<br/>\n<br/>\n<br/>\n<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\nYahoo! Platinum - Watch CBS&#39; NCAA March Madness, live on your desktop!<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] re plug in drug conversation","postDate":"1049052597","msgId":62452,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBQUNBRkU1LjE2MDhGJWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDAwMmQwMWMyZjZkZiQ4MTZhZGY4MCQ2MTAxYThjMEBsYXVuY2htb2RlbS5jb20+"},"prevInTopic":62449,"nextInTopic":62458,"prevInTime":62451,"nextInTime":62453,"topicId":62200,"numMessagesInTopic":0,"msgSnippet":"... Meaning my daughter doesn t have older kids around who would be watching R rated stuff. I thought about it after I posted that there are horror and violent","messageBody":"<div id=\"ygrps-yiv-974185831\">on 3/30/03 12:12 PM, Mary at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mummy124@...\">mummy124@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; From: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a>&gt;<br/>\n&gt; <br/>\n&gt; In a message dated 3/30/03 5:59:36 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a> writes:<br/>\n&gt; <br/>\n&gt; &lt;&lt; Why *would* a 6 yo watch an R rated movie? &gt;&gt;<br/>\n&gt; <br/>\n&gt; &lt;&lt; Joyce wrote that and she has an only child.&gt;&gt;<br/>\n&gt; <br/>\n&gt; I&#39;m not quite sure what this means. The part about being an only child?<br/>\n<br/>\n </span></blockquote>Meaning my daughter doesn&#39;t have older kids around who would be watching R<br/>\nrated stuff. <br/>\n<br/>\nI thought about it after I posted that there are horror and violent movies<br/>\n(like Gladiator) that are rated R that some younger kids might want to<br/>\nwatch.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] re plug in drug conversation","postDate":"1049051396","msgId":62449,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFjYi42NTE0OWQzLjJiYjg5YjA0QGFvbC5jb20+"},"prevInTopic":62448,"nextInTopic":62452,"prevInTime":62448,"nextInTime":62450,"topicId":62200,"numMessagesInTopic":0,"msgSnippet":"In a message dated 3/30/03 11:01:03 AM, mummy124@bellsouth.net writes:  I m not quite sure what this means.","messageBody":"<div id=\"ygrps-yiv-962676201\">In a message dated 3/30/03 11:01:03 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mummy124@...\">mummy124@...</a> writes:<br/>\n<br/>\n&lt;&lt; &lt;&lt; Joyce wrote that and she has an only child.&gt;&gt;<br/>\n<br/>\n<br/>\n<br/>\nI&#39;m not quite sure what this means. The part about being an only child? &gt;&gt;<br/>\n<br/>\nI think it&#39;s way easier to shelter/isolate/&quot;nest&quot; an oldest or only than it <br/>\nis a child with older siblings.<br/>\n<br/>\nThat&#39;s all I meant.<br/>\n<br/>\nKirby was more solidly into stuff designed for little kids than the other two <br/>\nwere, because when Kirby moved on to other stuff, Marty did (two and a half <br/>\nyears sooner) and Holly did (five and a half years sooner), just by being <br/>\nthere.<br/>\n<br/>\nBut they&#39;re all just as willing to still watch &quot;kid stuff,&quot; and they were all <br/>\nsad when Mr. Rogers died.  <br/>\n<br/>\nWas it this list where a mom confessed liking Teletubbies?  Holly liked it <br/>\nand I&#39;ve watched it with her several times.  I love the little videos, and <br/>\nthe color stuff.  &quot;Purple!&quot;  Very still and slow and attractive.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":1352017,"authorName":"kayb85","from":"&quot;kayb85&quot; &lt;sheran@...&gt;","profile":"kayb85","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: re plug in drug conversation","postDate":"1049046890","msgId":62448,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGI2N2IxYSt0NGM2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwMDAwMWMyZjZiZiQ2MTJlYWFmMCRiN2ViMTg0MUB5b3VyNmtyNHp4bGQ5MD4="},"prevInTopic":62447,"nextInTopic":62449,"prevInTime":62447,"nextInTime":62449,"topicId":62200,"numMessagesInTopic":0,"msgSnippet":"... hates it. ... ago, ... porn. ... violent ... naked ... I know this wasn t your point in the whole analogy (and it was a good analogy), but I just had to","messageBody":"<div id=\"ygrps-yiv-1847136749\"><blockquote><span title=\"ireply\">&gt; My mother wishes there was no such thing as the internet.  She <br/>\n </span></blockquote>hates it.<br/>\n<blockquote><span title=\"ireply\"> &gt; She&#39;s a librarian, and ever since they got the internet a few years <br/>\n </span></blockquote>ago,<br/>\n<blockquote><span title=\"ireply\"> &gt; she has unemployed men coming in and spending all day looking up <br/>\n </span></blockquote>porn.<br/>\n<blockquote><span title=\"ireply\"> &gt; There was one man who kept looking up not only porn, but also <br/>\n </span></blockquote>violent<br/>\n<blockquote><span title=\"ireply\"> &gt; things like how to make bombs.  One day he came into the library <br/>\n </span></blockquote>naked<br/>\n<blockquote><span title=\"ireply\"> &gt; and screaming at the top of his lungs, wielding a huge knife.  He<br/>\n&gt; stabbed the counter over and over before the police got there.  <br/>\n<br/>\n </span></blockquote>I know this wasn&#39;t your point in the whole analogy (and it was a good <br/>\nanalogy), but I just had to comment that at the two libraries that we <br/>\ngo to most often, the librarians really don&#39;t like the computers.  <br/>\n<br/>\nAt the first one, when they were rearranging to make room for a <br/>\ncomputer center, I commented to the lady checking out my books how <br/>\nneat it was that they were going to be getting all of these <br/>\ncomputers.  She started going on about how she&#39;s not a computer <br/>\nteacher, no one had better ask her how to use them, etc.  At the same <br/>\nlibrary, I heard that the board turned down a grant that would have <br/>\nallowed them to computerize their system.  They prefer the &quot;old <br/>\nfashioned card catalog&quot;.  They don&#39;t allow people to email anyone or <br/>\naccess chat rooms or message boards using their computers.  I asked <br/>\nwhat their reasoning was behind that rule and they told me, &quot;Because <br/>\nsomeone might email a bomb threat to the white house and then it <br/>\nwould come back that it happened from our computer&quot;.  <br/>\n<br/>\nAt the second library we sometimes go to, they are just kind of rude <br/>\nabout everything.  They seem annoyed and bothered when you ask about <br/>\nusing the computers, but then again they seem annoyed and bothered <br/>\nabout everything! lol  <br/>\n<br/>\nSheila</div>","specialLinks":[]},{"userId":141102765,"authorName":"Mary","from":"&quot;Mary&quot; &lt;mummy124@...&gt;","profile":"mummyone24","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] re plug in drug conversation","postDate":"1049044332","msgId":62447,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMmQwMWMyZjZkZiQ4MTZhZGY4MCQ2MTAxYThjMEBsYXVuY2htb2RlbS5jb20+","referencesHeader":"PDEwOC4yMTMxYmNhMC4yYmI4NzY1MEBhb2wuY29tPg=="},"prevInTopic":62444,"nextInTopic":62448,"prevInTime":62446,"nextInTime":62448,"topicId":62200,"numMessagesInTopic":0,"msgSnippet":"From:  In a message dated 3/30/03 5:59:36 AM, fetteroll@earthlink.net writes:  ... ","messageBody":"<div id=\"ygrps-yiv-992665810\">From: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a>&gt;<br/>\n<br/>\n In a message dated 3/30/03 5:59:36 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a> writes:<br/>\n<br/>\n &lt;&lt; Why *would* a 6 yo watch an R rated<br/>\n movie? &gt;&gt;<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n </span></blockquote>&lt;&lt; Joyce wrote that and she has an only child.&gt;&gt;<br/>\n<br/>\n<br/>\nI&#39;m not quite sure what this means. The part about being an only child?<br/>\n<br/>\nTara was an only child for 9 years. She watched R rated movies when she was<br/>\nyoung. Before she had any kind of school stuff going on. She watched movies<br/>\nthat interested her. At that time, I watched them first. The violence and<br/>\nlanguage didn&#39;t bother me but I did moniter then the sex scenes. She always<br/>\npicked movies that had like robots or giant bugs and things in them. She<br/>\nloved Jaws. Never any kind of Jason movies where people were running around<br/>\nkilling and getting killed. My kids now pick the same kind of movies. They<br/>\nloved Lake Placid with the giant crocodile. And just recently, Joseph<br/>\nwatched Die Hard with Joe. Actually only parts of it. He would come and go<br/>\nwhile it was on, find something interesting and then leave and come back<br/>\nlater.<br/>\n<br/>\nWhen Tara started school, her friends were always talking about movies they<br/>\ncouldn&#39;t see. Tara didn&#39;t understand what the fascination was with them. She<br/>\nsaw them and they were no big deal to her. When she got older and started to<br/>\nmeet friends at the movies, she also couldn&#39;t understand why some of them<br/>\nwent off to sneak into another movie. They were R rated. Tara was going to<br/>\nsee the PG ones and the other kids were sneaking off. If she wanted to see<br/>\nthose R rated ones, she would have asked me and I would have taken her. Now<br/>\nthat&#39;s with school influence even.<br/>\n<br/>\nI don&#39;t worry about the choices the kids are making now in this house.<br/>\n<br/>\nAs a side note, last Sunday we all celebrated Tara&#39;s 17th birthday. It was<br/>\nthe only day she wasn&#39;t already booked! Anyway, we all went to see Piglet&#39;s<br/>\nBig Movie. Tara too. We all loved it. I mentioned that I wanted to take<br/>\nAlyssa to her first movie. Sierra wanted to come, then Joseph said he wanted<br/>\nto see it too. When Tara heard, she said she wanted to go with us. Even Joe<br/>\nliked it. It&#39;s all about choices that are free to be made.<br/>\n<br/>\nMary B</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] re plug in drug conversation","postDate":"1049042000","msgId":62444,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEwOC4yMTMxYmNhMC4yYmI4NzY1MEBhb2wuY29tPg=="},"prevInTopic":62432,"nextInTopic":62447,"prevInTime":62443,"nextInTime":62445,"topicId":62200,"numMessagesInTopic":0,"msgSnippet":"In a message dated 3/30/03 5:59:36 AM, fetteroll@earthlink.net writes:  Joyce wrote that and she has an only","messageBody":"<div id=\"ygrps-yiv-286471567\">In a message dated 3/30/03 5:59:36 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a> writes:<br/>\n<br/>\n&lt;&lt; Why *would* a 6 yo watch an R rated<br/>\nmovie? &gt;&gt;<br/>\n<br/>\nJoyce wrote that and she has an only child.<br/>\n<br/>\nKirby didn&#39;t watch many R rated movies, but Marty and Holly have watched more <br/>\nof them than Kirby did. <br/>\n<br/>\nThey&#39;ve never (ever) picked out a movie because of its rating, one way or the <br/>\nother.  They choose them for historical period, or having an actor they like, <br/>\nor for humor (way more humorous purpose here than any other), or for action.<br/>\n<br/>\nMy kids saw Rocky Horror at young ages, or rather they were in the house when <br/>\nI had it on for the music and humor.  My husband loves action adventure stuff <br/>\nlike Die Hard.   If it has spies and bombs and helicopters, he&#39;s there.  So <br/>\nthe kids have walked in and out on stuff like that, sometimes gotten <br/>\ninterested, sometimes not.  Same with me and some of their movies.  I still <br/>\nhaven&#39;t seen all of Shrek, but am familiar with most parts from passing <br/>\nthrough.<br/>\n<br/>\nOne aspect we habitually dodge here because it turns into religion and <br/>\npolitics is whether the parents are willing for their children to hear &quot;the f <br/>\nword.&quot;  I don&#39;t mind.  If I minded, lots of movies would be right out for our <br/>\nfamily.  Eddie Izzard&#39;s stand-up routine &quot;Dress to Kill&quot; is the main <br/>\nattraction this week.  He uses the word casually.  He used it in French <br/>\n(there&#39;s a long routine he did in France on the DVD too).   For &quot;the whole <br/>\ndamned world&quot; (paraphrase) he used &#39;tout le f***ing monde&#39; which I thought <br/>\nwas pretty funny.<br/>\n<br/>\nI bought Marty an autographed copy of Jay and Silent Bob Strike back for <br/>\nChristmas, and a t-shirt to go with it.  Yet Marty is a considerate boy who <br/>\nwatches cartoons with his little sister and plays Harry Potter with her <br/>\nfriends.<br/>\n<br/>\nAnothe factor we haven&#39;t discussed much is that unschooled kids are not on <br/>\nthe school&#39;s timetable, nor following their patterns.  In school there comes <br/>\na time when a child might stop playing with dolls or action figures, because <br/>\nhe wants to be accepted as &quot;too big&quot; for that.   And so many kids under <br/>\nschool&#39;s influence will reject a phase or interest to go to the next.  What <br/>\nthey loved last year, they decide they &quot;hate&quot; this year.  Or things will be <br/>\ndeclared &quot;that&#39;s for babies,&quot; or &quot;that&#39;s for elementary school kids.&quot;<br/>\n<br/>\nWithout that skin-shedding social behavior, a kid can watch an R rated movie <br/>\nand then go outside and play house under sheets pinned to trees and then <br/>\ncheck their e-mail and play Barbies.<br/>\n<br/>\nMaybe some of the television fear is that it would cause a child to lose <br/>\ninnocence and skip phases of play and thought.<br/>\n<br/>\nI haven&#39;t found that to be true.  On the contrary, my kids are willing to <br/>\nchoose their activities for personal and honest reasons, not because they <br/>\nwant others to think them cool.<br/>\n<br/>\nSandra<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":78134331,"authorName":"genant2@aol.com","from":"genant2@...","profile":"genant04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] re plug in drug conversation","postDate":"1049032234","msgId":62432,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1YS4xZGE0NTg0NS4yYmI4NTAyYUBhb2wuY29tPg=="},"prevInTopic":62429,"nextInTopic":62444,"prevInTime":62431,"nextInTime":62433,"topicId":62200,"numMessagesInTopic":0,"msgSnippet":"-=I know kids who have never had boundries with their parents. They are allowed to have coke and cookies for breakfast adn watch r rated movies at age 6. This","messageBody":"<div id=\"ygrps-yiv-1783560790\">-=I know kids who have never had<br/>\nboundries with their parents. They are allowed to have coke and cookies for <br/>\nbreakfast<br/>\nadn watch r rated movies at age 6. This doesn&#39;t serve the child in the long<br/>\nrun as they feel so alone in their decision making.-=-<br/>\n<br/>\n<br/>\n<br/>\nI missed the original post this was taken from Sandra&#39;s post, she quoted it, <br/>\nso not sure who said it or if it was said in jest.  If it was I apologize in <br/>\nadvance.<br/>\n<br/>\nI guess I don&#39;t set boundaries randomly for my children.  There are some <br/>\nboundaries that I have like hitting is unacceptable behavior.  My boys and I <br/>\nhave talked about this.  I do understand that sometimes they get frustrated <br/>\nand can&#39;t express themselves and lash out.  We talk about it and try to do <br/>\nbetter.  But my boys are always a part of the process.  <br/>\n<br/>\nAnd they have had coke and cookies for breakfast before.  That was their <br/>\ndecision and it doesn&#39;t always happen but if we have cake around sometimes <br/>\nthey want it for breakfast, sometimes I do to.  And sometimes they skip <br/>\nbreakfast or have cereal or an apple.  It isn&#39;t like if the cookies are <br/>\naround they will always grab them to eat.  I think that is one of the gifts I <br/>\nhave given them.  The ability to see all food as equal.  They aren&#39;t always <br/>\nasking for cake because cake has never been forbidden.  They see it as <br/>\nanother option and are just as likely to have an apple.  <br/>\n<br/>\nAlso both have seen R rated movies. (6 and 8 yo) I watch with them but if it <br/>\nis something they want to see.  If the movie is too intense in one way or <br/>\nanother then they tend to get up and walk away or ask to not watch and we <br/>\nturn it off.  I don&#39;t think the G, PG, R, etc., rating are in any way a good <br/>\nway to rate weather a movie is good or not. Or acceptable for my boys or not.<br/>\n<br/>\nAnyway just some thoughts this morning.<br/>\nPam G.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":108173680,"authorName":"Sorcha","from":"&quot;Sorcha&quot; &lt;sorcha-aisling@...&gt;","profile":"sorcha_aisling","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [Unschooling-dotcom] re plug in drug conversation","postDate":"1049030529","msgId":62429,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDAwMWMyZjZiZiQ2MTJlYWFmMCRiN2ViMTg0MUB5b3VyNmtyNHp4bGQ5MD4=","inReplyToHeader":"PDNFODYzQjI0LjI2MTMzMTZDQGNhcGl0YWwubmV0Pg=="},"prevInTopic":62427,"nextInTopic":62432,"prevInTime":62428,"nextInTime":62430,"topicId":62200,"numMessagesInTopic":0,"msgSnippet":"I m going to make an analogy, since I m usually able to think more clearly about something when I look at it from a different angle. Instead of television,","messageBody":"<div id=\"ygrps-yiv-1455832819\">I&#39;m going to make an analogy, since I&#39;m usually able to think more<br/>\nclearly about something when I look at it from a different angle.<br/>\nInstead of television, let&#39;s say internet.  Presumably we all have<br/>\ninternet access in our homes (at least all of us who are posting).  If<br/>\nyou&#39;re posting but don&#39;t have access at home, then you&#39;re spending a lot<br/>\nof time somewhere that has internet access, so it&#39;s important enough for<br/>\nyou to do so.<br/>\n <br/>\nI think the internet was the single best invention humans ever made.<br/>\nHonestly.  There is so much information on the internet that you could<br/>\ntravel to every library in your state and spend hours per day looking<br/>\nand still not find as much as you can find in a one hour search online.<br/>\nWith the internet, people can form communities with like-minded people,<br/>\neven if some of them are in Arkansas and others in Australia.  On the<br/>\ninternet, you aren&#39;t being judged by your hairstyle or clothes or weight<br/>\nor age.<br/>\n <br/>\nMy mother wishes there was no such thing as the internet.  She hates it.<br/>\nShe&#39;s a librarian, and ever since they got the internet a few years ago,<br/>\nshe has unemployed men coming in and spending all day looking up porn.<br/>\nThere was one man who kept looking up not only porn, but also violent<br/>\nthings like how to make bombs.  One day he came into the library naked<br/>\nand screaming at the top of his lungs, wielding a huge knife.  He<br/>\nstabbed the counter over and over before the police got there.  <br/>\n <br/>\nPorn and instructions on explosives are not the only things the internet<br/>\nhas against it.  People cheat on their spouses with people they met in<br/>\nchat rooms.  People stalk other people, and perverts prey on children.<br/>\nNot to mention just the simple stupidity of some sites.  My husband had<br/>\nto work late one night and I was bored so I passed the time reading an<br/>\nentire site about farts.<br/>\n <br/>\nBut we&#39;re all here, on the internet, despite all the bad things it can<br/>\nbe used for.  We&#39;re all learning more about unschooling and probably<br/>\nlearning many more things with the internet.  I doubt any of us are<br/>\nlearning how to make bombs or preying on children.  <br/>\n <br/>\nMy mom says the thing she hates most about the internet is how people<br/>\nare on it all day.  I have a cable connection that allows my computer to<br/>\nbe online all day.  I love it.  I don&#39;t sit here staring at my computer<br/>\nall day, but anytime I want to use it for any reason, I can.  It&#39;s right<br/>\nthere in my living room, next to the TV and a bookshelf, and I can check<br/>\nmy email during the two minutes my hot pocket is microwaving and go<br/>\nabout my day.  I&#39;m on it less than the people my mom talks about coming<br/>\ninto the library when they open and sitting there until closing, just<br/>\nusing the internet.  I could be on it 24 hours a day.  I&#39;m probably on<br/>\nit 45 minutes per day.<br/>\n <br/>\nSince you&#39;re online reading this, please explain to me how the bad<br/>\nthings about TV are worse than the bad things about the internet.<br/>\n <br/>\nSorcha<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] re plug in drug conversation","postDate":"1049027640","msgId":62427,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBQUM0RTY3LjE2MDVCJWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDNFODYzQjI0LjI2MTMzMTZDQGNhcGl0YWwubmV0Pg=="},"prevInTopic":62423,"nextInTopic":62429,"prevInTime":62426,"nextInTime":62428,"topicId":62200,"numMessagesInTopic":0,"msgSnippet":"... No one s angry or fearful or guarding anything. People are pointing out where your thinking could be clearer. Muddled thinking means muddled conclusions. ","messageBody":"<div id=\"ygrps-yiv-1679481184\">on 3/29/03 7:32 PM, Heidi and Brent Ricks at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:rickshei@...\">rickshei@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So, I guess I raised some hackles with my last post.<br/>\n<br/>\n </span></blockquote>No one&#39;s angry or fearful or guarding anything. People are pointing out<br/>\nwhere your thinking could be clearer. Muddled thinking means muddled<br/>\nconclusions.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I would like to talk a little more about my reasoning in limiting TV.<br/>\n<br/>\n </span></blockquote>What you&#39;ve written isn&#39;t reasoning -- as in a smooth flow of reasoned<br/>\nthought to logical conclusion -- but a set of obstacles.<br/>\n<br/>\nPeople will go to extraordinary lengths to remove obstacles in front of<br/>\nsomething they truly want. People will grasp at obstacles between them and<br/>\nsomething they don&#39;t want and say they&#39;re insurmountable. The truth isn&#39;t<br/>\nthat they *can&#39;t* surmount them. The truth is they *choose not* to surmount<br/>\nthem.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I was raised without a tv for my entire childhood and I thank my parents for<br/>\n&gt; making that decision.<br/>\n<br/>\n </span></blockquote>The ends don&#39;t justify the means. Lots of people have come out stronger from<br/>\nadversity but that doesn&#39;t justify the adversity they went through.<br/>\n<br/>\nYou *can&#39;t* know how you would have turned out if you had been given free<br/>\naccess to TV. People imagine that unless kids are made to learn they won&#39;t<br/>\nlearn anything. It makes sense from the data they have available. But<br/>\nthey&#39;re wrong.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I know I would have spent many hours on my butt<br/>\n&gt; watching idiotic shows and commercials.<br/>\n<br/>\n </span></blockquote>Why would you have chosen to watch idiotic shows? Even though I watched a<br/>\nlot of TV when I was a kid, I was still selective. I never watched anything<br/>\nthat I didn&#39;t like. There are shows I watched as a kid that I wouldn&#39;t watch<br/>\nnow, but that&#39;s because I&#39;m not that kid any more and don&#39;t have the needs<br/>\nof that kid. I&#39;m a different person.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I am definitely not a tv addict now because I didn&#39;t have a tv earlier in my<br/>\n&gt; life so that arguement doesn&#39;t wash with me.<br/>\n<br/>\n </span></blockquote>For a theory to be valid it has to explain all the data, not just the data<br/>\nthat supports it. Your theory doesn&#39;t explain why I don&#39;t watch a lot of TV<br/>\neven though I had unlimited access as a child.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My husband was raised with the tv always on.  He would chose to veg out in<br/>\n&gt; front of it much more than I<br/>\n&gt; do.<br/>\n<br/>\n </span></blockquote>Was it always on because he chose to turn it on and leave it on? Why? Or<br/>\nbecause his parents left it on all the time? What other options did he have?<br/>\nDid his parents interact with him and be with him? Why was he watching TV?<br/>\nWas he watching TV as an escape from a distant home life or pressures at<br/>\nschool?<br/>\n<br/>\nOur TV when I was a kid was on when someone was watching and off when we<br/>\nwere doing other things. I used it to relax after the forced socialization<br/>\nof school. I used it as a way of visiting other times and places. My needs<br/>\nare different now though I do still make time for things I really want to<br/>\nwatch.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; without the rest of us having that junk interfere with our dreams.<br/>\n<br/>\n </span></blockquote>If you see it as junk then its presence is going to bother you a lot more<br/>\nthan if you see it as a resource.<br/>\n<br/>\nBut stepping back objectively, if two people have needs that clash then it&#39;s<br/>\nrespectful to treat everyone&#39;s needs as important and work out a way for<br/>\neveryone to get their needs met. Everyone&#39;s needs aren&#39;t equally important<br/>\nbut if you denigrate what someone else is doing (&quot;junk&quot;) then it&#39;s going to<br/>\nfeel justifiable to just tell them they need to stop so you can do what you<br/>\nwant.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I know the emotions that the tv bring into a house are powerful.  I was most<br/>\n&gt; sensitive to this when I was pregnant but I remember how I felt then, and know<br/>\n&gt; that they are just as powerful now although I am not as<br/>\n&gt; perceptive now.  Kids are though.<br/>\n<br/>\n </span></blockquote>Not all kids. Some kids. Some people for that matter. The less we think in<br/>\nacross the board needs of some mythical general population, the easier it is<br/>\nto meet the needs of those unique inviduals we live with.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I want my kids outside<br/>\n<br/>\n </span></blockquote>What do *they* want?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; rather than in front of some mindless show.<br/>\n<br/>\n </span></blockquote>Why would they choose to watch a mindless show?<br/>\n<br/>\nThey may choose something you don&#39;t find worthwhile, but if they find it<br/>\ninteresting then it isn&#39;t mindless to them.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; they choose other things most of the time becuse the tv isn&#39;t the first thing<br/>\n&gt; they see when they get up in the morning.<br/>\n<br/>\n </span></blockquote>My daughter chooses the best options she has available. Usually it&#39;s<br/>\ndrawing. And when she wants to watch TV, she turns on the TV. And when she&#39;s<br/>\ndone with it, she turns it off.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I happen to be of the opinion that children do need some limits.<br/>\n<br/>\n </span></blockquote>How do your children feel? How do you feel when people impose limits that<br/>\nseem to make no sense to you?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I relate this to how I felt as a new EMT riding on our local volunteer rescue<br/>\n&gt; sqad.  I wanted to know that there was<br/>\n&gt; someone else at my side who had more experience adn knowledge than I had.<br/>\n<br/>\n </span></blockquote>That isn&#39;t limitations. That&#39;s support.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It was felt safer knowing that there was someone there watching and making<br/>\n&gt; sure I was doing things right and thinking things through.<br/>\n<br/>\n </span></blockquote>Presumably you were making life and death decisions. Do you think your kids<br/>\nare troubled and frightened when faced with the decision of whether to play<br/>\nwith a toy or draw or watch TV?<br/>\n<br/>\nWe *are* there to support our kids. They aren&#39;t left to make decisions in a<br/>\nvacuum and clean up the consequences. We&#39;re there by their side for them as<br/>\na sounding board and to help them pick up and start over when the outcome<br/>\nisn&#39;t what they expected.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Kids need to know there are boundries and that those bounderies will move as<br/>\n&gt; they are ready.<br/>\n<br/>\n </span></blockquote>My daughter knows there are real life limitations to life.<br/>\n<br/>\nI&#39;m here to support her, not to cage her and protect her. She knows I will<br/>\nprotect her from real dangers, just as I would protect my husband from doing<br/>\nsomething he didn&#39;t have enough information to realize would have a bad<br/>\noutcome. (Like reformatting the hard drive!)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; They are allowed to have coke and cookies for breakfast adn watch r rated<br/>\n&gt; movies at age 6.<br/>\n<br/>\n </span></blockquote>My daughter can have coke and cookies for breakfast and watch R rated<br/>\nmovies. Though she has undoubtedly had cookies for breakfast the<br/>\noverwhelming majority of time she chooses fairly standard meal type food.<br/>\n(Though not necessarily breakfast food! She&#39;s had Chinese spare ribs and<br/>\npizza for breakfast.) She can watch R rated movies but has no interest.<br/>\nThere isn&#39;t anything in an R movie that has any appeal to her whatsoever.<br/>\n<br/>\nProbably why those kids are making those choices is because they&#39;re parents<br/>\nare disconnected from them, are basically letting the kids raise themselves.<br/>\nThat isn&#39;t what we&#39;re talking about at all. If the parents are there with<br/>\ngreat choices that the kids like for breakfast it&#39;s unlikely the kids will<br/>\nchoose cookies all the time. If the parents are there watching TV with the<br/>\nkids, or at least are aware of the types of programs and other interests<br/>\nthey have, are interacting with them, there isn&#39;t a reason to choose<br/>\nprograms that don&#39;t meet their needs. Why *would* a 6 yo watch an R rated<br/>\nmovie?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; This doesn&#39;t serve the child in the long run as they feel so alone in their<br/>\n&gt; decision making.  There is no one to fall back on, to get advice from.<br/>\n<br/>\n </span></blockquote>No one is suggesting that. There&#39;s a huge world of difference between giving<br/>\na child the freedom to make their own choices and letting them loose without<br/>\nsupport.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So, yes, I think it is OK to set limits on some things.<br/>\n<br/>\n </span></blockquote>And there&#39;s a huge world of difference between supporting a child in their<br/>\ndecision making process and choosing for them.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":141102765,"authorName":"mummyone24","from":"&quot;mummyone24&quot; &lt;mummy124@...&gt;","profile":"mummyone24","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: re plug in drug conversation","postDate":"1049005294","msgId":62423,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGI2NjJkZSs4MW9vQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDlENkNGOUNFQTc2ODNDNEQ4RjQxNUEzRjU0RDFDMDY2MDEyRjdEOURAZHN0cDEuZGVsdGFzb2x1dGlvbnMuY29tPg=="},"prevInTopic":62422,"nextInTopic":62427,"prevInTime":62422,"nextInTime":62424,"topicId":62200,"numMessagesInTopic":0,"msgSnippet":"...  wrote: ","messageBody":"<div id=\"ygrps-yiv-1870674792\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a>, &quot;Stephanie Elms&quot; <br/>\n&lt;stephanie.elms@d...&gt; wrote:<br/>\n<br/>\n&lt;&lt;My kids now have the right to have cookies and coke for <br/>\nbreakfast and they do it from time to time. But I have also seen that<br/>\nthey will also ask for 3 grilled cheese sandwiches and apples more <br/>\nfrequently then before. Their diet is balancing out (my 3 yo is <br/>\nactually better about this then my 6 yo having not been controlled to <br/>\nthe same extent).&gt;&gt;<br/>\n<br/>\n<br/>\nJust want to comment on this food thing. I&#39;ve found that my kids go <br/>\nin spurts as to what and how they eat. With Tara, I worried. Then <br/>\nwith Joseph 9 years later, I forgot and worried again. I no longer <br/>\nworry. We don&#39;t restrict or limit food. I did use to really want them <br/>\nto eat what I made for dinner. That was before I joined this list. <br/>\nNow dinners are more relaxed and a kind of free for all. My kids are <br/>\nhappier, Joe and I are happier and the kids actually eat better <br/>\nmaking their own choices. <br/>\n<br/>\nI mentioned that Alyssa had pepermint patties for breakfast. One <br/>\nmorning she had pasta, chicken and meatball. Why worry about the <br/>\ncandy? Tonight she specifically asked me for pasta and chicken. She&#39;s <br/>\none very Italian child!! Sierra was wondering what to eat and I <br/>\nmentioned that I had some soft tortilla shells and could make her a <br/>\nsoft taco but different than Taco Bell. She asked what I had to put <br/>\nin it and decided to have sour cream, chicken and assorted cheeses. <br/>\nThe tortillas were bigger than taco size. I put one together and <br/>\npopped it in the micro and she loved it. Asked for another one and <br/>\nate the whole thing. Then she asked for a bowl of Cocoa Puffs, <br/>\nfinished that and had a second bowl. This is a kid who will have 2 <br/>\npieces of cinnamon raisin toast for breakfast, then a poptart and <br/>\nfinish that off with a bowl of Honey Nut Cheerios. The only thing I <br/>\nworry about is her exploding!!!!!<br/>\nWonder why she didn&#39;t want any dessert tonight???<br/>\n<br/>\nMary B</div>","specialLinks":[]},{"userId":1572768,"authorName":"Stephanie Elms","from":"&quot;Stephanie Elms&quot; &lt;stephanie.elms@...&gt;","profile":"elmsfam","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [Unschooling-dotcom] re plug in drug conversation","postDate":"1049004168","msgId":62422,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlENkNGOUNFQTc2ODNDNEQ4RjQxNUEzRjU0RDFDMDY2MDEyRjdEOURAZHN0cDEuZGVsdGFzb2x1dGlvbnMuY29tPg=="},"prevInTopic":62414,"nextInTopic":62423,"prevInTime":62421,"nextInTime":62423,"topicId":62200,"numMessagesInTopic":0,"msgSnippet":"... But my kids *do* know that I am at their side. That I am there watching and will help whenever they need it (even if they make different choices then I","messageBody":"<div id=\"ygrps-yiv-233855262\"><blockquote><span title=\"ireply\">&gt; I <br/>\n&gt; relate this to how I felt as a new EMT riding on our local <br/>\n&gt; volunteer rescue sqad.  I wanted to know that there was<br/>\n&gt; someone else at my side who had more experience adn knowledge <br/>\n&gt; than I had.  It was felt safer knowing that there was someone <br/>\n&gt; there watching and making sure I was doing things right and <br/>\n&gt; thinking things through.  As my experience grew and I felt <br/>\n&gt; more confident, then it was OK to be the one in charge but <br/>\n&gt; that transition isn&#39;t always smooth.  <br/>\n<br/>\n </span></blockquote>But my kids *do* know that I am at their side. That I am there<br/>\nwatching and will help whenever they need it (even if they make<br/>\ndifferent choices then I think they should). And I am finding that<br/>\nthey accept my advice easier when I am not forcing them to accept it.<br/>\nI have also found that Jason (6 yo) especially is starting to get<br/>\nmore self aware lately...I think that this is because he has the <br/>\nchance to make his own mistakes and to learn from these mistakes without<br/>\ngetting additional guilt from me. He is feeling safer about making those<br/>\nmistakes because he knows that I am there to help him without recrimination<br/>\nfor doing something &quot;wrong&quot;.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Kids need to know there <br/>\n&gt; are boundries and that those bounderies will move as they are <br/>\n&gt; ready.  I know kids who have never had boundries<br/>\n&gt; with their parents.  They are allowed to have coke and <br/>\n&gt; cookies for breakfast adn watch r rated movies at age 6.  <br/>\n&gt; This doesn&#39;t serve the child in the long run as they feel so <br/>\n&gt; alone in their decision making.  There is no one to fall back <br/>\n&gt; on, to get advice from.  So, yes, I think it is OK to set <br/>\n&gt; limits on some things.  Those limits are not set in stone.  <br/>\n&gt; They can and will move.<br/>\n<br/>\n </span></blockquote>I have been doing a lot of thinking about this...I think that (as has<br/>\nbeen brought up here recently) that it is more important to have <br/>\nprinciples rather then boundaries. And principles will *not* change.<br/>\nThey will remain the same because they apply to everyone, not just<br/>\nthose who have &quot;earned&quot; the right to have special privileges based<br/>\non age. My kids now have the right to have cookies and coke for <br/>\nbreakfast and they do it from time to time. But I have also seen that<br/>\nthey will also ask for 3 grilled cheese sandwiches and apples more <br/>\nfrequently then before. Their diet is balancing out (my 3 yo is actually<br/>\nbetter about this then my 6 yo having not been controlled to the same extent).<br/>\nIf it is ok to eat cookies in the afternoon, why not the morning? Not to<br/>\nmention the power struggles we now no longer have....<br/>\n<br/>\nStephanie E.</div>","specialLinks":[]},{"userId":120206043,"authorName":"averyschmidt","from":"&quot;averyschmidt&quot; &lt;patti.schmidt2@...&gt;","profile":"averyschmidt","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: re plug in drug conversation","postDate":"1048993046","msgId":62414,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGI2NW1lbStsZzR0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDNFODYzQjI0LjI2MTMzMTZDQGNhcGl0YWwubmV0Pg=="},"prevInTopic":62413,"nextInTopic":62422,"prevInTime":62413,"nextInTime":62415,"topicId":62200,"numMessagesInTopic":0,"msgSnippet":"... Perhaps the dissenters are busy thinking and changing their minds. I personally wish they d speak up if they have something to say.  I know I m open to","messageBody":"<div id=\"ygrps-yiv-261305911\"><blockquote><span title=\"ireply\">&gt;I&#39;m sure I&#39;ll be blasted again with anything I say as it seems that <br/>\n&gt;the dissenters on this thread have dropped off but that&#39;s OK.<br/>\n<br/>\n </span></blockquote>Perhaps the dissenters are busy thinking and changing their minds.<br/>\nI personally wish they&#39;d speak up if they have something to say.  I <br/>\nknow I&#39;m open to changing *my* mind if someone else&#39;s point of view <br/>\nmakes more sense to me than mine does.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Our house is a very open plan.  Therefore there is no place <br/>\n&gt;upstairs where the TV will not be seen and heard by everyone in the <br/>\n&gt;house if it is on.  I know that I am very auditory sensitive.  This <br/>\n&gt;means that with overload I get crabby.<br/>\n<br/>\n </span></blockquote>I&#39;ve never tried them myself, but I&#39;ve heard that a good solution to <br/>\nthis problem is headphones.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I was raised without a tv for my entire childhood and I thank my <br/>\n&gt;parents for making that decision.  I know I would have spent many <br/>\n&gt;hours on my butt watching idiotic shows and commercials.<br/>\n&gt;Instead I spent hours outside and working on my own projects. <br/>\n<br/>\n </span></blockquote>My children have unlimited tv and spend many more hours outside <br/>\nand &quot;working on projects&quot; than they do watching it.  Perhaps you <br/>\nmissed my post where I told how I&#39;ve at times pleaded with them to <br/>\ncome in (because I need to be outside with the youngest and <br/>\nsometimes I want to start dinner or I&#39;m cold or something) and they <br/>\nclamor to remain outside playing.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I want my kids outside rather than in front of some mindlessshow.  <br/>\n&gt;They have plenty of opportunities to watch stuff (including <br/>\n&gt;mindless shows) but they choose other things most of the time <br/>\n&gt;becuse the tv isn&#39;t the first thing they see when they get up in <br/>\n </span></blockquote>the morning.<br/>\n<br/>\nIt still wouldn&#39;t be the first thing they see when they get up in <br/>\nthe morning if you made the basement comfortable and cozy for them.<br/>\nBTW, my kids usually choose to do something else right away in the <br/>\nmorning even though the tv is right in our bedroom.  And they are <br/>\nmaking a genuine choice because they actually *have* a choice, and <br/>\nthey know that even if they *do* choose to watch tv nobody&#39;s going <br/>\nto make them feel guilty about it.<br/>\n  <br/>\n<blockquote><span title=\"ireply\"> &gt; It seems as though a part of this discussion is really about how <br/>\n&gt;we, as parents feel about limit-setting in general.  The tv is one <br/>\n&gt;of the most obvious (that and food) chances we have to look at <br/>\n&gt;where we stand on this basic facet of parenting.  I happen to be of <br/>\n&gt;the opinion that children do need some limits.<br/>\n<br/>\n </span></blockquote>We all have some limits, not just children.  Society is full of <br/>\nlimits that we are all subject to.  They don&#39;t need arbitrary limits <br/>\nset up for them so they can &quot;learn limits.&quot;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;They are allowed to have coke and cookies for breakfast adn watch r <br/>\n&gt;rated movies at age 6.  This doesn&#39;t serve the child in the long <br/>\n&gt;run as they feel so alone in their decision making.  There is no <br/>\n&gt;one to fall back on, to get advice from.<br/>\n<br/>\n </span></blockquote>This is a serious misunderstanding.  I don&#39;t think there&#39;s anyone <br/>\nhere who&#39;s saying you should leave kids alone in their decision <br/>\nmaking and refrain from giving them advice.<br/>\n<br/>\nPatti</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] re plug in drug conversation","postDate":"1048991746","msgId":62413,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE2NC4xZTI1MTNlMy4yYmI3YjIwMkBhb2wuY29tPg=="},"prevInTopic":62410,"nextInTopic":62414,"prevInTime":62412,"nextInTime":62414,"topicId":62200,"numMessagesInTopic":0,"msgSnippet":"-=-It seems as though a part of this discussion is really about how we, as parents feel about limit-setting in general.-=- That s the surface of it.  But","messageBody":"<div id=\"ygrps-yiv-1775530825\">-=-It seems as though a part of this discussion is really about how we, as <br/>\nparents<br/>\nfeel about limit-setting in general.-=-<br/>\n<br/>\nThat&#39;s the surface of it.  But underneath it&#39;s about clarity and mindfulness.<br/>\n<br/>\nNot having TV hasn&#39;t made you a peaceful, thoughtful person if your post is <br/>\ntypical.  Your descriptions included words like &quot;idiotic,&quot; &quot;mindless&quot; and <br/>\n&quot;that arguement doesn&#39;t wash with me.&quot;   Edgy and emotional kind of writing.<br/>\n<br/>\n-=- children do need some limits. <br/>\n(whoa, probably not to ppopular to say here). I relate this to how I felt as a<br/>\nnew EMT riding on our local volunteer rescue sqad. I wanted to know that there<br/>\nwas<br/>\nsomeone else at my side who had more experience adn knowledge than I had.-=-<br/>\n<br/>\nNobody here has ever left their kids in a cave alone, nor sent them out in an <br/>\nambulance all alone.  We&#39;re right where the kids are, we&#39;re right here.  <br/>\n<br/>\n-=Kids need to know there are boundries and that<br/>\nthose bounderies will move as they are ready.-=-<br/>\n<br/>\nThat doesn&#39;t mean all boundaries are equally valid.  And by &quot;valid&quot; I mean <br/>\nwell-considered and fairly applied.<br/>\n<br/>\n-=I know kids who have never had<br/>\nboundries with their parents. They are allowed to have coke and cookies for <br/>\nbreakfast<br/>\nadn watch r rated movies at age 6. This doesn&#39;t serve the child in the long<br/>\nrun as they feel so alone in their decision making.-=-<br/>\n<br/>\nIf you know children who are alone in their decision making, that&#39;s a <br/>\nsituation far different from anything being recommended to you here.    You <br/>\nseem to be recommending that children not have any part in &quot;their&quot; decision <br/>\nmaking, but the parents decide.<br/>\n<br/>\nMy children are never alone in their decision making.  Kirby (16) talks to me <br/>\nabout his girlfriend.  Marty (14) talks to me about his plans with friends.  <br/>\n<br/>\nI have children who &quot;are allowed to have coke and cookies for breakfast.&quot;<br/>\nI have children who have never chosen to have coke and cookies for breakfast.<br/>\nYou have children who have never had coke and cookies for breakfast.<br/>\nYou think it is because you haven&#39;t allowed them that choice.<br/>\n<br/>\nThe other day Kirby left the house really sleepy and I asked him to drink a <br/>\nDr Pepper on the way to driver&#39;s ed, because he was going to walk half a mile <br/>\non a really busy street and he had worked late.  He stopped drinking caffeine <br/>\nat New Year&#39;s by his own choice, but he understood my concern.  My car was in <br/>\nthe shop and I couldn&#39;t drive him.   I was afraid for him to be groggy and in <br/>\nthat situation.  He took a Dr Pepper.<br/>\n<br/>\nI have children who could watch R rated movies at age 6.  5.  4.   <br/>\nToday I had two children at 11 and 14 watching Shrek.  Sitting in a room full <br/>\nof all KINDS of videos and DVDs and they chose Shrek.   That&#39;s different from <br/>\nwatching Shrek because it&#39;s not R rated and so it&#39;s on the allowable list.<br/>\n<br/>\nThe TV&#39;s off right now.  Nobody&#39;s watching TV anywhere in the house.  Just <br/>\nbecause everyone has chosen to do various other things, not because anyone <br/>\nwas shamed or teased or told to turn it off.<br/>\n<br/>\nFor me, that&#39;s a very valuable thing.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":139187074,"authorName":"MARK and JULIE SOLICH","from":"&quot;MARK and JULIE SOLICH&quot; &lt;mjsolich@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] re plug in drug conversation","postDate":"1048989377","msgId":62410,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNjcwMWMyZjY1ZiQ4ZTZmOWFjMCRjODZkMzJkMkBtYXJrPg==","referencesHeader":"PDAwMzMwMWMyZjQ3YiRhYzU2ODAyMCQxODU1NDUxOEBjYS5zaGF3Y2FibGUubmV0PiA8M0U4NjNCMjQuMjYxMzMxNkNAY2FwaXRhbC5uZXQ+"},"prevInTopic":62406,"nextInTopic":62413,"prevInTime":62409,"nextInTime":62411,"topicId":62200,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-2067592099\">&lt;&lt; I know kids who have never had boundries<br/>\n with their parents.  They are allowed to have coke and cookies for<br/>\nbreakfast adn watch r rated movies at age 6.  This doesn&#39;t serve the child<br/>\nin the long run as they feel so alone in their decision making.  &gt;&gt;<br/>\n<br/>\nDon&#39;t you think though that the real problem for kids like this is that<br/>\ntheir parents don&#39;t want them around and use every opportunity to tell them<br/>\nto go and watch TV just to get them out of their hair? That has been my<br/>\nobservation. I don&#39;t think it is so much a lack of limits as a lack of time<br/>\nand love.<br/>\n<br/>\nJulie<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; ~~~~ Don&#39;t forget! If you change topics, change the subject line! ~~~~<br/>\n&gt;<br/>\n&gt; If you have questions, concerns or problems with this list, please email<br/>\n </span></blockquote>the moderator, Joyce Fetteroll (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a>), or the list owner,<br/>\nHelen Hegener (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Editor@...\">HEM-Editor@...</a>).<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; To unsubscribe from this group, click on the following link or address an<br/>\n </span></blockquote>email to:<br/>\n<blockquote><span title=\"qreply\"> &gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-unsubscribe@yahoogroups.com\">Unschooling-dotcom-unsubscribe@yahoogroups.com</a><br/>\n&gt;<br/>\n&gt; Visit the Unschooling website: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n&gt;<br/>\n&gt; Your use of Yahoo! Groups is subject to <a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a><br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":31889625,"authorName":"Heidi and Brent Ricks","from":"Heidi and Brent Ricks &lt;rickshei@...&gt;","profile":"twinspirit02","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] re plug in drug conversation","postDate":"1048984356","msgId":62406,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNFODYzQjI0LjI2MTMzMTZDQGNhcGl0YWwubmV0Pg==","referencesHeader":"PDAwMzMwMWMyZjQ3YiRhYzU2ODAyMCQxODU1NDUxOEBjYS5zaGF3Y2FibGUubmV0Pg=="},"prevInTopic":62233,"nextInTopic":62410,"prevInTime":62405,"nextInTime":62407,"topicId":62200,"numMessagesInTopic":0,"msgSnippet":"So, I guess I raised some hackles with my last post.  Oh well.  I have thought about a lot of the responses and all of them have something to offer and I will","messageBody":"<div id=\"ygrps-yiv-523293117\">So, I guess I raised some hackles with my last post.  Oh well.  I have thought about a lot of the responses and all of them have something to offer and I will continue to mull them over. I would like to talk a little more about my reasoning in limiting TV.  I&#39;m sure I&#39;ll be blasted again with anything I say as it seems that the dissenters on this thread have dropped off but that&#39;s OK.  There&#39;s got to be a rabble rouser in every crowd and today it seems to be me.  (yeah,<br/>\nthere&#39;s more to this story but not for publication here as we&#39;re not discussing war stuff...thank goodness)<br/>\n<br/>\nOur house is a very open plan.  Therefore there is no place upstairs where the TV will not be seen and heard by everyone in the house if it is on.  I know that I am very auditory sensitive.  This means that with overload I get crabby.  No one needs that any more than necessary!  When I said that if anyone wants to watch TV then they have to be willing to be away from the rest of the family, that was sometimes true but what usually happens is that this means we all watch TV<br/>\ntogether.  This would not happen if the tv was elsewhere.  If it was in the livingroom, we would keep on doing other activities and not tune in to what is on the tube.  I see this happen at my mil&#39;s all the time.  She turns it on and walks away and they end up watching some really inappropriate (in my opinion) things.  We like to watch with the kids so we can talk about what they are seeing.<br/>\n<br/>\nI was raised without a tv for my entire childhood and I thank my parents for making that decision.  I know I would have spent many hours on my butt watching idiotic shows and commercials.  Instead I spent hours outside and working on my own projects.  I am definitely not a tv addict now because I didn&#39;t have a tv earlier in my life so that arguement doesn&#39;t wash with me. My husband was raised with the tv always on.  He would chose to veg out in front of it much more than I<br/>\ndo.  With the tv out of the living space he can do that without the rest of us having to hear Jay Lenno or whoever is on late night now, without the rest of us having that junk interfere with our dreams.  This literally happened when the tv was in our bedroom.  I know the emotions that the tv bring into a house are powerful.  I was most sensitive to this when I was pregnant but I remember how I felt then, and know that they are just as powerful now although I am not as<br/>\nperceptive now.  Kids are though.<br/>\n<br/>\nI want my kids outside rather than in front of some mindless show.  They have plenty of opportunities to watch stuff (including mindless shows) but they choose other things most of the time becuse the tv isn&#39;t the first thing they see when they get up in the morning.<br/>\n<br/>\nIt seems as though a part of this discussion is really about how we, as parents feel about limit-setting in general.  The tv is one of the most obvious (that and food) chances we have to look at where we stand on this basic facet of parenting.  I happen to be of the opinion that children do need some limits.  (whoa, probably not to ppopular to say here).  I relate this to how I felt as a new EMT riding on our local volunteer rescue sqad.  I wanted to know that there was<br/>\nsomeone else at my side who had more experience adn knowledge than I had.  It was felt safer knowing that there was someone there watching and making sure I was doing things right and thinking things through.  As my experience grew and I felt more confident, then it was OK to be the one in charge but that transition isn&#39;t always smooth.  Kids need to know there are boundries and that those bounderies will move as they are ready.  I know kids who have never had boundries<br/>\nwith their parents.  They are allowed to have coke and cookies for breakfast adn watch r rated movies at age 6.  This doesn&#39;t serve the child in the long run as they feel so alone in their decision making.  There is no one to fall back on, to get advice from.  So, yes, I think it is OK to set limits on some things.  Those limits are not set in stone.  They can and will move.<br/>\n<br/>\nSorry to open another whole can of worms but here goes.....<br/>\n<br/>\nHeidi R</div>","specialLinks":[]},{"userId":141102765,"authorName":"Mary","from":"&quot;Mary&quot; &lt;mummy124@...&gt;","profile":"mummyone24","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] re plug in drug conversation","postDate":"1048800593","msgId":62233,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNDYwMWMyZjRhOCQwMTQ2ZGVhMCQ2MTAxYThjMEBsYXVuY2htb2RlbS5jb20+","referencesHeader":"PDAwMzMwMWMyZjQ3YiRhYzU2ODAyMCQxODU1NDUxOEBjYS5zaGF3Y2FibGUubmV0Pg=="},"prevInTopic":62200,"nextInTopic":62406,"prevInTime":62232,"nextInTime":62234,"topicId":62200,"numMessagesInTopic":0,"msgSnippet":"From: Tim and Maureen ","messageBody":"<div id=\"ygrps-yiv-1803937403\">From: Tim and Maureen <br/>\n  &lt;&lt;I have been lurking and following the tv debate for a while. I have four people at home unschooling ages 14,12,10 and 7. I have been at this unschooling process for 5 years and have had my doubts off and on about tv, whether i am providing the &#39;right&#39; learning,etc.. My heart has the answers for me and i have finally tapped into listening to myself and my children.<br/>\n  I have tried many times to do the unrestricted tv thing with my anxiety finally ending it and creating unpleasant scenes. After reading some of the emails and entertaining some new ways to view tv and my issues I have successfully dropped the tv thing.<br/>\n  Now here is the interesting thing. When I was tense and uncertain around the unrestricted tv watching my kids would spend hours and hours on the tv rarely choosing other things to do even when I left it for a month. When I freely and openly let it go  it is amazing to see the changes in how they view the tv as well. They do not only choose the tv anymore and that happened right away. Wow! and I feel great to finally be completely trusting them to make their own choices&gt;&gt;<br/>\n<br/>\n  There go again. Another one!!!<br/>\n  Thanks for the story.<br/>\n<br/>\n  Mary B<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":93802122,"authorName":"Tim and Maureen","from":"Tim and Maureen &lt;tmthomas@...&gt;","profile":"wisdom0007","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"re plug in drug conversation","postDate":"1048781552","msgId":62200,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMzMwMWMyZjQ3YiRhYzU2ODAyMCQxODU1NDUxOEBjYS5zaGF3Y2FibGUubmV0Pg=="},"prevInTopic":0,"nextInTopic":62233,"prevInTime":62199,"nextInTime":62201,"topicId":62200,"numMessagesInTopic":0,"msgSnippet":"I have been lurking and following the tv debate for a while. I have four people at home unschooling ages 14,12,10 and 7. I have been at this unschooling","messageBody":"<div id=\"ygrps-yiv-2047743507\">I have been lurking and following the tv debate for a while. I have four people at home unschooling ages 14,12,10 and 7. I have been at this unschooling process for 5 years and have had my doubts off and on about tv, whether i am providing the &#39;right&#39; learning,etc.. My heart has the answers for me and i have finally tapped into listening to myself and my children.<br/>\nI have tried many times to do the unrestricted tv thing with my anxiety finally ending it and creating unpleasant scenes. After reading some of the emails and entertaining some new ways to view tv and my issues I have successfully dropped the tv thing.<br/>\nNow here is the interesting thing. When I was tense and uncertain around the unrestricted tv watching my kids would spend hours and hours on the tv rarely choosing other things to do even when I left it for a month. When I freely and openly let it go  it is amazing to see the changes in how they view the tv as well. They do not only choose the tv anymore and that happened right away. Wow! and I feel great to finally be completely trusting them to make their own choices<br/>\nTim and Maureen Thomas<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.stillwaters.ca\">http://www.stillwaters.ca</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":62787,"nextTopicId":62815}}