{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":64,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Are you a good mom, or a bad mom?","postDate":"1242070818","msgId":44856,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE3NUEyM0ExLUUzMUMtNDcyRi1CODE1LTVGRDJFQTAxRTk5QkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGd1OWJ1YyszcDhzQGVHcm91cHMuY29tPg==","referencesHeader":"PGd1OWJ1YyszcDhzQGVHcm91cHMuY29tPg=="},"prevInTopic":44855,"nextInTopic":44858,"prevInTime":44855,"nextInTime":44857,"topicId":44816,"numMessagesInTopic":0,"msgSnippet":"-=-This whole posting made no sense to me, but I m trying to piece it together. I apologize in advance if someone else has brought this up in the replies, I","messageBody":"<div id=\"ygrps-yiv-79007561\">-=-This whole posting made no sense to me, but I&#39;m trying to piece it  <br/>\ntogether. I apologize in advance if someone else has brought this up  <br/>\nin the replies, I don&#39;t have time to read them.-=-<br/>\n<br/>\nBefore I read another word (I see there is more and much more below  <br/>\nthis), READ THIS, islandthyme/bigandlittle6<br/>\n<br/>\nIf you don&#39;t understand something, don&#39;t comment.<br/>\nIf you don&#39;t have time to read something, don&#39;t comment.<br/>\n<br/>\nPeriod.<br/>\nYou wouldn&#39;t go into a two hour meeting and ask for the microphone and  <br/>\nsay &quot;I haven&#39;t heard what&#39;s been said, but...&quot; and then walk out  <br/>\nbecause you don&#39;t have time to hear the rest.<br/>\n<br/>\nLeave the discussion to those who DO understand it.<br/>\n<br/>\n-=-I have been lurking on this list for awhile now and have been  <br/>\nfrustrated on so many occasions...-=-<br/>\n<br/>\nNot MANY occasions, because you don&#39;t have time to read and you&#39;ve  <br/>\nbeen on the list since March 30, 2009.  There are people who have been  <br/>\non this list for seven years or more.  They understand something you  <br/>\ndon&#39;t understand.  There are people who&#39;ve joined lately and wrote  <br/>\nthese thing.  You should take the time to read them:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/change\">http://sandradodd.com/change</a><br/>\n<br/>\n<br/>\nI&#39;ll read the rest and respond to the point, if there was one, after I  <br/>\nsee if others have already said what I was going to say.<br/>\n<br/>\nSandra (who signs her name to every post; doesn&#39;t require others to,  <br/>\nbut big ideas without a name are smaller right away)<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Are you a good mom, or a bad mom?","postDate":"1242070132","msgId":44854,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVDQkFDNTQxLUFFMTctNDEzQy05MkUyLUREN0M2OURDMDcxNkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGd1OTRwNisyMThqQGVHcm91cHMuY29tPg==","referencesHeader":"PGd1OTRwNisyMThqQGVHcm91cHMuY29tPg=="},"prevInTopic":44852,"nextInTopic":44855,"prevInTime":44853,"nextInTime":44855,"topicId":44816,"numMessagesInTopic":0,"msgSnippet":"-=-I have thought for a while that the principles of my religion, Unitarian Universalism, lend themselves very well to radical unschooling. For example, the","messageBody":"<div id=\"ygrps-yiv-1998419578\">-=-I have thought for a while that the principles of my religion,  <br/>\nUnitarian Universalism, lend themselves very well to radical  <br/>\nunschooling. For example, the first principle is that we believe in  <br/>\nthe inherent worth and dignity of every person. I have fantasized  <br/>\nabout holding adult education classes in my church about radical  <br/>\nunschooling, or maybe consensual living or whatever I would call it,-=-<br/>\n<br/>\nMaybe you could talk about &quot;peaceful homes&quot; and talk about choices  <br/>\nrather that &quot;have to&quot;s.  I don&#39;t see how people could balk at that.<br/>\n<br/>\nHere&#39;s a unitarian sermon that involved unschooling.  Maybe you&#39;ve  <br/>\nseen it (but others here might not have).<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/kathrynsermon\">http://sandradodd.com/kathrynsermon</a><br/>\n<br/>\n-=-I&#39;m a little bit in awe of people who &quot;put themselves out there&quot; in  <br/>\nthe unschooling world. There&#39;s a lot of misinformation and harsh  <br/>\ncriticism, and I think that&#39;s one reason why I haven&#39;t done this - I  <br/>\ndon&#39;t want to make myself a target. But it&#39;s not about me, is it? It&#39;s  <br/>\nabout the very energetic three year old, and her just-turned-five  <br/>\nsister, who deserve to be accepted and celebrated for who they are.-=-<br/>\n<br/>\nIt depends how your own family&#39;s peace is.  If you have time and peace  <br/>\nto spare, it might be worth investing some of it in other people&#39;s  <br/>\nfutures.<br/>\n<br/>\nThe older I get, the more wild criticism amuses me.  It&#39;s like a kid  <br/>\nhaving a crazed fit, only it&#39;s adults and they believe they&#39;re having  <br/>\nsome kind of rational fit.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":299867162,"authorName":"Maria","from":"&quot;Maria&quot; &lt;maria.veltman@...&gt;","profile":"trinity3857","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Are you a good mom, or a bad mom?","postDate":"1242070112","msgId":44855,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd1OXU5MCt1cWNzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDFFNzRFM0Q4LTc1OTQtNDUxMy1BMjE1LTc3MDZFMUYzRkYwMEBTYW5kcmFEb2RkLmNvbT4="},"prevInTopic":44854,"nextInTopic":44856,"prevInTime":44854,"nextInTime":44856,"topicId":44816,"numMessagesInTopic":0,"msgSnippet":"... That s basically how my husband responded when I asked him if he thought I was a good mom.  Yes, because you re trying. Our day was like a normal Sunday,","messageBody":"<div id=\"ygrps-yiv-1382698389\"><blockquote><span title=\"ireply\">&gt; My best answer is &quot;a mom trying to be a better mom all the time.&quot;<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>That&#39;s basically how my husband responded when I asked him if he thought I was a good mom.  &quot;Yes, because you&#39;re trying.&quot;<br/>\n<br/>\nOur day was like a normal Sunday, I slept in and Nate made french toast...while Seth watched TV.  Nate only remembered that it was Mother&#39;s Day after some program mentioned it and then said, &quot;Happy Mother&#39;s Day, by the way.&quot;  He did give me a massage (he&#39;s three months away from finishing Massage Therapy school), but he would have given me one anyways since he&#39;s prescribed that I get one once a week.  Yes, I realize I&#39;m &quot;spoiled.&quot; <br/>\n<br/>\nI &quot;forgot&quot; to call my mother, so a thousand hail mary&#39;s on me, I suppose. ;)  Fortunately, she has seven other children who probably didn&#39;t.<br/>\n<br/>\nIn the past, I&#39;d have used a day like this to make all kinds of unreasonable demands, but I didn&#39;t feel the need to.  Apparently, I&#39;ve grown.  And, I know that because I didn&#39;t, it freed Nate up to show me his love in his own way, and freed me from the suffering that comes from unmet expectations.  <br/>\n<br/>\nI liked Scott Noelle&#39;s Daily Groove post on &quot;Every Day is Mother&#39;s Day&quot; so much I posted it as a Facebook Note.  <br/>\n<br/>\n~Maria</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Are you a good mom, or a bad mom?","postDate":"1242068913","msgId":44852,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk0MTcxMy4yODk0NS5xbUB3ZWI4NjIxMS5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PGd1OWJ1YyszcDhzQGVHcm91cHMuY29tPg==","referencesHeader":"PGd1OWJ1YyszcDhzQGVHcm91cHMuY29tPg=="},"prevInTopic":44851,"nextInTopic":44854,"prevInTime":44851,"nextInTime":44853,"topicId":44816,"numMessagesInTopic":0,"msgSnippet":"I realized as I was reading this that I think of the word mom in a different catagory to thinking of the word child or adult . To some extent being a mom","messageBody":"<div id=\"ygrps-yiv-1558574438\">I realized as I was reading this that I think of the word &quot;mom&quot; in a<br/>\ndifferent catagory to thinking of the word &quot;child&quot; or &quot;adult&quot;. To some<br/>\nextent being a mom is as passive as growing older, you get pregnant,<br/>\nyou have a child, you are a mom. There are ways that you can stop all<br/>\nof those things happening, just as there are ways to stop from becoming<br/>\nan adult, not so much to keep you from being a child, Anyhow, there is<br/>\na you are a mom point of the outcome of a pregnancy.<br/>\nBut it is more than that. I can make a choice that is about being a<br/>\nbetter mom or I can make a choice that is about being a better career<br/>\nwoman or I can make a choice that is about being a better Greenpeace<br/>\nactivist. And while those choices aren&#39;t mutually exclusive there is a<br/>\ndefinite priority distinction going on that changes what the outcome of<br/>\nthose choices would be. <br/>\n<br/>\nI think it is hard to say if someone is a good or bad person, but you<br/>\ncan say if someone is making choices to make them a better parent in<br/>\nthe next moment. Hitting their children is not a step to being a better<br/>\nparent, putting them in a cupboard under the stairs isn&#39;t a step toward<br/>\nbetter parenting. Those may be choices made in an attempt to have a better behaving child, but they aren&#39;t ways to be a better parent. <br/>\n<br/>\nFor you using nonviolent communication techniques are a way to better communication, and yet they keep you from understanding this list and wish that people would change to accomodate you. If NVC is your priority than the communication with people outside of the paradigm will be damaged, if communicating with others is the priority the language of NVC can make that more difficult and may get sacrificed in the process. That doesn&#39;t make you a better or worse person, but it does make you a better or worse communicator.<br/>\n<br/>\nIf your goal is to be a better parent, a parent who is interested more in their children&#39;s happiness and comfort and health and well-being than they are in moving up the corporate ladder or being the most popular person in their social group, than you follow a different path than you do to attain those other goals. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: bigandlittle6 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:islandthyme@...\">islandthyme@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nSent: Monday, 11 May, 2009 3:15:40 PM<br/>\nSubject: [AlwaysLearning] Re: Are you a good mom, or a bad mom?<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My best answer is &quot;a mom trying to be a better mom all the time.&quot;<br/>\n&gt; <br/>\n&gt; This morning on CBS Sunday Morning, there was an item on mom&#39;s doubts  <br/>\n&gt; and feelings they were being good moms.  <br/>\n<br/>\n<br/>\n </span></blockquote>This whole posting made no sense to me, but I&#39;m trying to piece it together. I apologize in advance if someone else has brought this up in the replies, I don&#39;t have time to read them.<br/>\n<br/>\nHow can people keep perpetuating the idea that there is even such thing as a &quot;good&quot; mom, or a &quot;bad&quot; mom?<br/>\n<br/>\nIn practicing nonviolent communication with myself, my kids, my husband, my friends, etc.. I am trying to make any ideas of &quot;right&quot; and &quot;wrong&quot;, &quot;good&quot; and &quot;bad&quot;, non existent. As human beings, we are never &quot;one thing&quot; all the time. You can&#39;t &quot;be&quot; a good mom, or &quot;be&quot; a bad mom. Just like you would probably agree not to label any child &quot;good&quot; or &quot;bad&quot;. <br/>\n<br/>\nOn any given day, we choose to do things that meet our/our children&#39;s needs, or things that don&#39;t meet our/our children&#39;s needs. We have the power to make different choices in every moment of every day, and we&#39;re always changing what we&#39;re doing as our/our children&#39;s needs change.<br/>\n<br/>\nFor example, maybe I played with my children today more than I cleaned the house. Is that &quot;good&quot;? Not necessarily. Perhaps it met my children&#39;s needs for fun, attention, play, affection. This is wonderful. But perhaps it didn&#39;t meet my needs for order, organization, cleanliness. Is that a &quot;bad&quot; thing? Not necessarily. These are simply examples of needs that are being met and not met. The time has come to start thinking outside of the box, drop the old language and make that paradigm shift.<br/>\n<br/>\nLabeling anything &quot;good&quot; or &quot;bad&quot; is using the old, power-over, static language, that does a very ineffective job at saying what is REALLY happening. Human beings are far from static. Our feelings and needs are changing constantly. <br/>\n<br/>\nPlease, look deeper than those terms &quot;good&quot; and &quot;bad&quot;, to the underlying needs that are being met or not met in a relationship or in a situation. Then, look deeper at the reason each of us choose to do the things we do. Get empowered to move beyond simplistic judgments of each other and instead, ask what needs we are trying to meet through the choices we are observing. Then and only then can we work together to find a way to help each other find a way to meet everyone&#39;s needs (children&#39;s included), more often.<br/>\n<br/>\nAnd one last note: I hear people every single day, confusing thoughts as feelings. When a mother is saying &quot;I am a bad mom&quot;, she is not FEELING she is a bad mom, she is THINKING it. Her feelings might be: guilt, shame, depression, sadness, loneliness, disappointment.... <br/>\n<br/>\nIt&#39;s important to distinguish between our judgments of ourselves, and our FEELINGS about ourselves (which stem from those thoughts). If we are not aware of our thinking and our judgments, how can we possibly work to change them? Feelings are all valid. Judgments are something we make up in our head, they are not automatically true just because we&#39;ve tricked ourselves into thinking them. <br/>\n<br/>\nI have been lurking on this list for awhile now and have been frustrated on so many occasions because I find myself unable to connect with the language so frequently used here. I have wanted to recommend to members on this list to look into some basic nonviolent communication skills www.cnvc.org as I believe it would be really helpful for all. I am saying this because I am guessing you are a group who value learning and growth and openness, which I&#39;m guessing    <br/>\nis a big reason why you choose to &quot;unschool&quot; your children. I don&#39;t see how this life of freedom can truly continue if we are holding on to the old violent language with ourselves, each other and our families.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Are you a good mom, or a bad mom?","postDate":"1242064604","msgId":44851,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY0NzgxMy44MjkwMS5xbUB3ZWI4MTUwMy5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PGd1OWswNis4ZXM1QGVHcm91cHMuY29tPg==","referencesHeader":"PGd1OWswNis4ZXM1QGVHcm91cHMuY29tPg=="},"prevInTopic":44849,"nextInTopic":44852,"prevInTime":44850,"nextInTime":44852,"topicId":44816,"numMessagesInTopic":0,"msgSnippet":"Choosing to moralistically judge others as good or bad is merely perpetuating the same violence that you are referring to with your description of real bad","messageBody":"<div id=\"ygrps-yiv-2085620476\">Choosing to moralistically judge others as good or bad is merely perpetuating the same violence that you are referring to with your description of &quot;real bad moms&quot;.<br/>\n<br/>\nThese moms will also perpetuate their behavior when they find they are labeled by people like you. If you choose not to be part of the solution, you choose to be part of the problem. If you choose/enjoy/ insist on calling your definitions hard, fast and true about other people, be prepared to apply the same &quot;rules&quot; to yourself.<br/>\n-=-=-=-=-=-=-=-=-<br/>\n <br/>\nSo because I think it is bad to abuse your child I am perpetuating the same violence?<br/>\nHow does that work?<br/>\n <br/>\nSo moms that abuse their kids do so because people like me label them bad?<br/>\nReally? WOW.<br/>\n <br/>\nYes I do apply the same &quot;rules&quot; to myself.<br/>\nEvery day I think about how I treat my children and I strive to do better the next time. EVERY TIME. EVERYDAY.<br/>\nI do judge my actions and reactions to my kids. I don&#39;t chuck it out to &quot; I am doing the best I can&quot; or &quot; I was in pain so I inflicted pain on my children&quot;<br/>\nI don&#39;t look for excuses. When I come to lists like this I look to do better and get called on by moms I respect to do better.<br/>\nI have called friends like Kelly Lovejoy and Schuyler Waynforth to ask for help. I did not expect them to say to me I was doing my best or I was in pain or any other excuse. I know they would help me do better next time by pointing out what and how to do better not that I did my best.<br/>\nIt is not to say that moms here, much less me, are always perfect and don&#39;t go wrong at moments.<br/>\nI know I do a lot. But I DO judge what I did WRONG and I try to do BETTER and apologize to my kids for it.<br/>\n<br/>\nI think we all have a choice and if we choose to abuse our kids , no matter why we do it, it is still a choice.<br/>\nMany moms had horrible childhoods full of abuse and pain. They choose to do better with their children.<br/>\nI know a few wonderful moms like that. <br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n <br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Are you a good mom, or a bad mom?","postDate":"1242062661","msgId":44849,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRBMDg1RjQ1LjEwNDAwQG1hYy5jb20+","inReplyToHeader":"PGd1OTRwNisyMThqQGVHcm91cHMuY29tPg==","referencesHeader":"PGd1OTRwNisyMThqQGVHcm91cHMuY29tPg=="},"prevInTopic":44848,"nextInTopic":44851,"prevInTime":44848,"nextInTime":44850,"topicId":44816,"numMessagesInTopic":0,"msgSnippet":"... Sandra is much more of a target than i am, but I ve experienced some of it. Mostly people are not critical or mean directly in our face - in person, but","messageBody":"<div id=\"ygrps-yiv-1019472053\">On 5/11/2009 5:13 AM, carenkh wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m a little bit in awe of people who &quot;put themselves out there&quot; in the unschooling world. There&#39;s a lot of misinformation and harsh criticism, and I think that&#39;s one reason why I haven&#39;t done this - I don&#39;t want to make myself a target. But it&#39;s not about me, is it? It&#39;s about the very energetic three year old, and her just-turned-five sister, who deserve to be accepted and celebrated for who they are.<br/>\n&gt;    <br/>\n<br/>\n </span></blockquote>Sandra is much more of a target than i am, but I&#39;ve experienced some of <br/>\nit. Mostly people are not critical or mean directly&quot;in our face&quot; - in <br/>\nperson, but people do feel free to be that way by email. I&#39;m not really <br/>\naffected by it - for someone who spent her childhood constantly getting <br/>\n&quot;hurt feelings,&quot; I&#39;m not offended these days, that&#39;s for sure. To be <br/>\nhonest, I don&#39;t even quite understand the concept of being offended.  <br/>\nMostly I truly feel bad for the person who is living in a world where it <br/>\nmakes sense to send hateful email to me when they could just delete and <br/>\nignore. I&#39;m not imposing myself on them, ever. I always wish there was <br/>\nsomething I could say back that would help them be happier.<br/>\n<br/>\nI do try to be really clear in my in-person talk titles and descriptions <br/>\nthat I will be talking about radical unschooling. I sometimes start with <br/>\na sort of &quot;take what makes sense to you, leave the rest&quot; comment - it <br/>\ndepends on my audience, but for an audience that is most definitely not <br/>\ncomposed of people already trying to unschool - when a lot are <br/>\nconventional homeschoolers just kind of interested in hearing a little <br/>\nabout unschooling, I try to disarm them a bit so that they don&#39;t jump <br/>\nright into resistance mode.  Also, I start out always talking about <br/>\nradical unschooling in terms of the positives without dwelling much on <br/>\nthe negatives of conventional parenting.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Are you a good mom, or a bad mom?","postDate":"1242062386","msgId":44848,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PERCNDY5MTcxLTQ2NjEtNDgxOS1BMTlFLTg0QUM0OTBEN0UzRUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGd1OGZ2dCs4MXJoQGVHcm91cHMuY29tPg==","referencesHeader":"PGd1OGZ2dCs4MXJoQGVHcm91cHMuY29tPg=="},"prevInTopic":44847,"nextInTopic":44849,"prevInTime":44847,"nextInTime":44849,"topicId":44816,"numMessagesInTopic":0,"msgSnippet":"-= Wow! Shannon -=- Great big wow, on your mother s day report, Shannon. Holly asked me before she left for work whether I wanted anything else for mother s","messageBody":"<div id=\"ygrps-yiv-241082155\">-=<br/>\nWow!<br/>\nShannon -=-<br/>\n<br/>\nGreat big wow, on your mother&#39;s day report, Shannon.<br/>\n<br/>\nHolly asked me before she left for work whether I wanted anything else  <br/>\nfor mother&#39;s day.  She had done photos of us the day before, and said  <br/>\n&quot;Happy Mother&#39;s Day.&quot;  I said no, it was great, and I didn&#39;t need  <br/>\nanything.<br/>\n<br/>\nWhen she came home from work she brought me  chocolate things.   <br/>\nCookies from Germany (from Walgreen&#39;s) and truffles from Starbucks.   <br/>\nVery sweet.<br/>\n<br/>\nI think a solidly normal day can be the BEST once a mom has figured  <br/>\nhow wonderful a good normal day can be!<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny C","from":"&quot;Jenny C&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Are you a good mom, or a bad mom?","postDate":"1242061807","msgId":44847,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd1OW01ZitrMDQ1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGd1OWswNis4ZXM1QGVHcm91cHMuY29tPg=="},"prevInTopic":44845,"nextInTopic":44848,"prevInTime":44846,"nextInTime":44848,"topicId":44816,"numMessagesInTopic":0,"msgSnippet":"... perpetuating the same violence that you are referring to with your description of real bad moms . ... labeled by people like you. If you choose not to be","messageBody":"<div id=\"ygrps-yiv-352361205\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt;&gt;&gt; Choosing to moralistically judge others as good or bad is merely<br/>\n </span></blockquote>perpetuating the same violence that you are referring to with your<br/>\ndescription of &quot;real bad moms&quot;.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; These moms will also perpetuate their behavior when they find they are<br/>\n </span></blockquote>labeled by people like you. If you choose not to be part of the<br/>\nsolution, you choose to be part of the problem. If you<br/>\nchoose/enjoy/insist on calling your definitions hard, fast and true<br/>\nabout other people, be prepared to apply the same &quot;rules&quot; to<br/>\nyourself.&gt;&gt;&gt;<br/>\n<br/>\nWhoa!  Why would you assume that &quot;people like you&quot; aren&#39;t doing anything<br/>\nto be part of a solution?  Simply stating that there really are some<br/>\ntruly bad parents out there, doesn&#39;t mean that nobody here is NOT trying<br/>\nto love up some of these folks and show them better ways.<br/>\n<br/>\nI am doing just that on a regular basis.  The simple act of being the<br/>\nbest mom that I can be, and truly working on being better at it, allows<br/>\nmy own children to help others.  We are confronted regularly by hurting<br/>\npeople that we love up and help out, most of them kids from families<br/>\nwith parents that are not so great.  We are only able to do this because<br/>\nmy husband and I have found a better way to parent and bless our kids<br/>\nwith our choices to be good parents.</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny C","from":"&quot;Jenny C&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Are you a good mom, or a bad mom?","postDate":"1242057658","msgId":44842,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd1OWkzcStmM2ZlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQwMTc0Mi4xNDE3Mi5xbUB3ZWI4MTUwMS5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":44841,"nextInTopic":44845,"prevInTime":44841,"nextInTime":44843,"topicId":44816,"numMessagesInTopic":0,"msgSnippet":"... really bad moms. ... moms that let others even kill their kids. ... Yes, exactly!  I was thinking the same thing.  There really are people that do really","messageBody":"<div id=\"ygrps-yiv-310334056\"><blockquote><span title=\"ireply\">&gt; Yes there are bad moms. Not the ones who screw up here and there but<br/>\n </span></blockquote>really bad moms.<br/>\n<blockquote><span title=\"ireply\"> &gt; Moms that starve their kids,  abusive moms, moms that kill their and<br/>\n </span></blockquote>moms that let others even kill their kids.<br/>\n<blockquote><span title=\"ireply\"> &gt; To say there is not GOOD or BAD is not real.<br/>\n<br/>\n<br/>\n </span></blockquote>Yes, exactly!  I was thinking the same thing.  There really are people<br/>\nthat do really really bad things to others, some of the them parents<br/>\ndoing really bad things to their kids.  They are not good parents. <br/>\nPerhaps they are good typists or good baseball players, but certainly<br/>\nnot good parents!</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny C","from":"&quot;Jenny C&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Are you a good mom, or a bad mom?","postDate":"1242057152","msgId":44841,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd1OWhrMCtrbHB2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGd1OWJ1YyszcDhzQGVHcm91cHMuY29tPg=="},"prevInTopic":44839,"nextInTopic":44842,"prevInTime":44840,"nextInTime":44842,"topicId":44816,"numMessagesInTopic":0,"msgSnippet":"... doubts ... together. I apologize in advance if someone else has brought this up in the replies, I don t have time to read them. ... thing as a good mom,","messageBody":"<div id=\"ygrps-yiv-990860135\"><blockquote><span title=\"ireply\">&gt; &gt; My best answer is &quot;a mom trying to be a better mom all the time.&quot;<br/>\n&gt; &gt;<br/>\n&gt; &gt; This morning on CBS Sunday Morning, there was an item on mom&#39;s<br/>\n </span></blockquote>doubts<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; and feelings they were being good moms.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; This whole posting made no sense to me, but I&#39;m trying to piece it<br/>\n </span></blockquote>together. I apologize in advance if someone else has brought this up in<br/>\nthe replies, I don&#39;t have time to read them.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; How can people keep perpetuating the idea that there is even such<br/>\n </span></blockquote>thing as a &quot;good&quot; mom, or a &quot;bad&quot; mom?<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n<br/>\n </span></blockquote>Who&#39;s perpetuating this?  The answer above of &quot;a mom trying to be a<br/>\nbetter mom all the time.&quot;, would suggest exactly the opposite of<br/>\nperpetuating such things as being a &quot;good&quot; mom or a &quot;bad&quot; mom.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; In practicing nonviolent communication with myself, my kids, my<br/>\n </span></blockquote>husband, my friends, etc.. I am trying to make any ideas of &quot;right&quot; and<br/>\n&quot;wrong&quot;, &quot;good&quot; and &quot;bad&quot;, non existent. As human beings, we are never<br/>\n&quot;one thing&quot; all the time. You can&#39;t &quot;be&quot; a good mom, or &quot;be&quot; a bad mom.<br/>\nJust like you would probably agree not to label any child &quot;good&quot; or<br/>\n&quot;bad&quot;.&gt;&gt;&gt;<br/>\n<br/>\nI&#39;m sure that I agree with this assessment of human nature.  Of course<br/>\nall humans have the potential to be many many things, and even a person<br/>\non death row, may not be a &quot;bad&quot; person, but someone who&#39;s done<br/>\nsomething bad, but I have met some pretty bad parents, and the same<br/>\nmight apply to the person on death row.<br/>\n<br/>\nThese parents aren&#39;t trying to be better all the time, and perhaps<br/>\naren&#39;t really trying at all to be anything remotely close to being a<br/>\ngood parent, aren&#39;t even aware of what makes a parent good or bad. <br/>\nSure, I can feel compassion for someone that isn&#39;t &quot;getting&quot; it, they<br/>\nmay be good people that are terribly misguided in their parenting<br/>\nskills, but it doesn&#39;t make them any less a &quot;bad&quot; parent.<br/>\n<br/>\nGood and bad are polar opposite, like yin/yang, they can&#39;t exist without<br/>\nthe other for comparison, and all inbetween there are millions of other<br/>\nways to see things.  So, while most things can be seen with all the<br/>\nother millions of ways of seeing things, I do believe that good and bad<br/>\nare still equally valid descriptors, with or without looking deeper into<br/>\nthose terms.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; Please, look deeper than those terms &quot;good&quot; and &quot;bad&quot;, to the<br/>\n </span></blockquote>underlying needs that are being met or not met in a relationship or in a<br/>\nsituation. Then, look deeper at the reason each of us choose to do the<br/>\nthings we do. Get empowered to move beyond simplistic judgments of each<br/>\nother and instead, ask what needs we are trying to meet through the<br/>\nchoices we are observing. &gt;&gt;&gt;<br/>\n<br/>\nYou might be interested in a discussion chat today about judgement and<br/>\ncomparisons... <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/chats/\">http://sandradodd.com/chats/</a><br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/chats/\">http://sandradodd.com/chats/</a>&gt;<br/>\n<br/>\nIt is at 3pm mountain time, 2pm pacific, 5 eastern, and there are other<br/>\ntime zones listed on that link.<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Are you a good mom, or a bad mom?","postDate":"1242054093","msgId":44839,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQwMTc0Mi4xNDE3Mi5xbUB3ZWI4MTUwMS5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PGd1OWJ1YyszcDhzQGVHcm91cHMuY29tPg==","referencesHeader":"PGd1OWJ1YyszcDhzQGVHcm91cHMuY29tPg=="},"prevInTopic":44838,"nextInTopic":44841,"prevInTime":44838,"nextInTime":44840,"topicId":44816,"numMessagesInTopic":0,"msgSnippet":"How can people keep perpetuating the idea that there is even such thing as a good mom, or a bad mom? -=-=-=-=- Yes there are bad moms. Not the ones who","messageBody":"<div id=\"ygrps-yiv-917307807\">How can people keep perpetuating the idea that there is even such thing as a &quot;good&quot; mom, or a &quot;bad&quot; mom?<br/>\n-=-=-=-=-<br/>\n<br/>\nYes there are bad moms. Not the ones who screw up here and there but really bad moms.<br/>\nMoms that starve their kids,  abusive moms, moms that kill their and moms that let others even kill their kids.<br/>\nTo say there is not GOOD or BAD is not real.<br/>\nI have read about NVC and it has given me some tools for communicating some times.<br/>\nThere will be a live chat today on comparisons and judgment and it may be a good idea to go discuss this at that time.<br/>\n <br/>\nAlex Polikowsky<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n <br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":273211037,"authorName":"Patti","from":"Patti &lt;patti.dengler@...&gt;","profile":"patti.dengler@sbcglobal.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Are you a good mom, or a bad mom?","postDate":"1242053750","msgId":44845,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY5QThFNzczLUZDMjYtNDdFNS1CMUZFLTY0NjVENkREMzBFNkBzYmNnbG9iYWwubmV0Pg==","inReplyToHeader":"PGd1OWJ1YyszcDhzQGVHcm91cHMuY29tPg==","referencesHeader":"PGd1OWJ1YyszcDhzQGVHcm91cHMuY29tPg=="},"prevInTopic":44842,"nextInTopic":44847,"prevInTime":44843,"nextInTime":44846,"topicId":44816,"numMessagesInTopic":0,"msgSnippet":"... [Non-text portions of this message have been removed]","messageBody":"<div id=\"ygrps-yiv-1257258785\"><blockquote><span title=\"ireply\">&gt; this is kind of how i&#39;ve been feeling with this discussion.  thanks  <br/>\n&gt; for taking it on.<br/>\n&gt;<br/>\n&gt; ******In practicing nonviolent communication with myself, my kids,  <br/>\n&gt; my husband, my friends, etc.. I am trying to make any ideas of  <br/>\n&gt; &quot;right&quot; and &quot;wrong&quot;, &quot;good&quot; and &quot;bad&quot;, non existent. As human  <br/>\n&gt; beings, we are never &quot;one thing&quot; all the time. You can&#39;t &quot;be&quot; a good  <br/>\n&gt; mom, or &quot;be&quot; a bad mom. Just like you would probably agree not to  <br/>\n&gt; label any child &quot;good&quot; or &quot;bad&quot;******<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":349237537,"authorName":"bigandlittle6","from":"&quot;bigandlittle6&quot; &lt;islandthyme@...&gt;","profile":"bigandlittle6","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Are you a good mom, or a bad mom?","postDate":"1242051340","msgId":44838,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd1OWJ1YyszcDhzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDFFNzRFM0Q4LTc1OTQtNDUxMy1BMjE1LTc3MDZFMUYzRkYwMEBTYW5kcmFEb2RkLmNvbT4="},"prevInTopic":44837,"nextInTopic":44839,"prevInTime":44837,"nextInTime":44839,"topicId":44816,"numMessagesInTopic":0,"msgSnippet":"... This whole posting made no sense to me, but I m trying to piece it together. I apologize in advance if someone else has brought this up in the replies, I","messageBody":"<div id=\"ygrps-yiv-1218622113\"><blockquote><span title=\"ireply\">&gt; My best answer is &quot;a mom trying to be a better mom all the time.&quot;<br/>\n&gt; <br/>\n&gt; This morning on CBS Sunday Morning, there was an item on mom&#39;s doubts  <br/>\n&gt; and feelings they were being good moms.  <br/>\n<br/>\n<br/>\n </span></blockquote>This whole posting made no sense to me, but I&#39;m trying to piece it together. I apologize in advance if someone else has brought this up in the replies, I don&#39;t have time to read them.<br/>\n<br/>\nHow can people keep perpetuating the idea that there is even such thing as a &quot;good&quot; mom, or a &quot;bad&quot; mom?<br/>\n<br/>\nIn practicing nonviolent communication with myself, my kids, my husband, my friends, etc.. I am trying to make any ideas of &quot;right&quot; and &quot;wrong&quot;, &quot;good&quot; and &quot;bad&quot;, non existent. As human beings, we are never &quot;one thing&quot; all the time. You can&#39;t &quot;be&quot; a good mom, or &quot;be&quot; a bad mom. Just like you would probably agree not to label any child &quot;good&quot; or &quot;bad&quot;. <br/>\n<br/>\nOn any given day, we choose to do things that meet our/our children&#39;s needs, or things that don&#39;t meet our/our children&#39;s needs. We have the power to make different choices in every moment of every day, and we&#39;re always changing what we&#39;re doing as our/our children&#39;s needs change.<br/>\n<br/>\nFor example, maybe I played with my children today more than I cleaned the house. Is that &quot;good&quot;? Not necessarily. Perhaps it met my children&#39;s needs for fun, attention, play, affection. This is wonderful. But perhaps it didn&#39;t meet my needs for order, organization, cleanliness. Is that a &quot;bad&quot; thing? Not necessarily. These are simply examples of needs that are being met and not met. The time has come to start thinking outside of the box, drop the old language and make that paradigm shift.<br/>\n<br/>\nLabeling anything &quot;good&quot; or &quot;bad&quot; is using the old, power-over, static language, that does a very ineffective job at saying what is REALLY happening. Human beings are far from static. Our feelings and needs are changing constantly. <br/>\n<br/>\nPlease, look deeper than those terms &quot;good&quot; and &quot;bad&quot;, to the underlying needs that are being met or not met in a relationship or in a situation. Then, look deeper at the reason each of us choose to do the things we do. Get empowered to move beyond simplistic judgments of each other and instead, ask what needs we are trying to meet through the choices we are observing. Then and only then can we work together to find a way to help each other find a way to meet everyone&#39;s needs (children&#39;s included), more often.<br/>\n<br/>\nAnd one last note: I hear people every single day, confusing thoughts as feelings. When a mother is saying &quot;I am a bad mom&quot;, she is not FEELING she is a bad mom, she is THINKING it. Her feelings might be: guilt, shame, depression, sadness, loneliness, disappointment.... <br/>\n<br/>\nIt&#39;s important to distinguish between our judgments of ourselves, and our FEELINGS about ourselves (which stem from those thoughts). If we are not aware of our thinking and our judgments, how can we possibly work to change them? Feelings are all valid. Judgments are something we make up in our head, they are not automatically true just because we&#39;ve tricked ourselves into thinking them. <br/>\n<br/>\nI have been lurking on this list for awhile now and have been frustrated on so many occasions because I find myself unable to connect with the language so frequently used here. I have wanted to recommend to members on this list to look into some basic nonviolent communication skills www.cnvc.org as I believe it would be really helpful for all. I am saying this because I am guessing you are a group who value learning and growth and openness, which I&#39;m guessing    <br/>\nis a big reason why you choose to &quot;unschool&quot; your children. I don&#39;t see how this life of freedom can truly continue if we are holding on to the old violent language with ourselves, each other and our families.<br/>\n<br/>\n<br/>\n They talked about a website  <br/>\n<blockquote><span title=\"qreply\"> &gt; where moms leave confessions of things they&#39;ve done, called True Mom  <br/>\n&gt; Confessions.  I didn&#39;t bring the link because I&#39;m not planning to go  <br/>\n&gt; there.  I think it would be upsetting and today&#39;s a moms-be-happy day!<br/>\n&gt; <br/>\n&gt; One example they gave, though was a mom who said she didn&#39;t teach her  <br/>\n&gt; kids to tell time so she could tell them it was bedtime whenever she  <br/>\n&gt; wanted to.<br/>\n&gt; <br/>\n&gt; Then the web owner defended those kinds of confessions saying &quot;I don&#39;t  <br/>\n&gt; think there&#39;s anything to be gained from keeping a secret.&quot;<br/>\n&gt; <br/>\n&gt; Roseanne Barr was interviewed about her TV show, a bit, and about her  <br/>\n&gt; real-life mothering (she has five children, some grown).  She said of  <br/>\n&gt; course mothers feel guilty, but &quot;Most of the time, or 100% of the  <br/>\n&gt; time, the reason you feel guilty is that you have a reason to feel  <br/>\n&gt; guilty.&quot;   She wasn&#39;t being funny, she was being serious.<br/>\n&gt; <br/>\n&gt; A woman who wrote a book called Bad Mom said for every letter she got  <br/>\n&gt; saying she was a terrible mother she got ten saying thank you.  She  <br/>\n&gt; said it was a great comfort to know others had screwed up too.<br/>\n&gt; <br/>\n&gt; All that reminded me of this list, and the policy of not saying &quot;good  <br/>\n&gt; job!&quot; or &quot;don&#39;t worry&quot; when moms come and tell us they&#39;re doing things  <br/>\n&gt; they know aren&#39;t good for their kids.   And as to the quote about  <br/>\n&gt; keeping secrets above, it seems another time for one mom to absolve  <br/>\n&gt; other moms and say &quot;Don&#39;t worry; just confess and you&#39;ll be forgiven.&quot;<br/>\n&gt; <br/>\n&gt; Had the mom lived in such a way there were no secrets to keep, that  <br/>\n&gt; would be better.    In the context of that article, it seemed that  <br/>\n&gt; lies told to other mothers (or information concealed) was the sin, not  <br/>\n&gt; the lies told to children.   When she said &quot;keeping a secret,&quot; she  <br/>\n&gt; wasn&#39;t talking about the secrets the mom was keeping from her children.<br/>\n&gt; <br/>\n&gt; I know it&#39;s not Mother&#39;s Day everywhere today, but it is here, so  <br/>\n&gt; there will be a fair amount of information about idealized and  <br/>\n&gt; mainstream mothering poured out today.<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":135282288,"authorName":"Marcy","from":"&quot;Marcy&quot; &lt;sweetpackages@...&gt;","profile":"sweetpackages","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Are you a good mom, or a bad mom?","postDate":"1242050308","msgId":44837,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd1OWF1NCthNWphQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGd1OTM0NitwNTkzQGVHcm91cHMuY29tPg=="},"prevInTopic":44836,"nextInTopic":44838,"prevInTime":44836,"nextInTime":44838,"topicId":44816,"numMessagesInTopic":0,"msgSnippet":"I hope you all enjoyed your Mothers Day yesterday. I had a really nice day because I just let it be all about our family and not about what you are supposed","messageBody":"<div id=\"ygrps-yiv-1849380627\">I hope you all enjoyed your Mothers Day yesterday.<br/>\nI had a really nice day because I just let it be all about our family and not about &quot;what you are supposed to do and get&quot; on Mothers Day.<br/>\n<br/>\nI woke up with the girls to hugs and cuddles,hubby had gone out early to do the wash and when he came back ,was back for about 15 min didnt say anything about mothers day  at all and I admit I felt sad that he didnt say anything and then I felt silly because I went into the kitchen and there were 3 peach carnations,one from him and one from each of my girls and my heart just melted.<br/>\n<br/>\nwe then went to a ceramic place and they each got to make something and it was so nice to just let them paint,the owner asked them to use smocks to which they said &quot;no-we like getting paint on us&quot;,the helper in the store tried to convince them to use certain paint colors to &quot;make the picture look the way it is supposed to&quot;  to which they said &quot;No&quot; in the end we all had a blast and later found out that the owner was homeschooled herself all her life in upstate NY and thought it was great that we were doing the same.<br/>\n<br/>\nwe then went to see my parents and my grandmother for dinner. after the blow up with my sister and her husband last month,I told my Mom I would love to come see her to celebrate after they all left,she still doesnt get why I cant get over it,and be unhappy for the familys sake but she agreed and we all had a nice time. I tried to tell her Mothers Day is every day and I dont need to see her on this particular day to show her I love her,I see her every other day anyway,lol but again in the end said it would be fine for us to come in the evening when they had left. I felt so at peace for standing up for myself and requesting this.<br/>\nI hope you all had a special day</div>","specialLinks":[]},{"userId":336246301,"authorName":"carenkh","from":"&quot;carenkh&quot; &lt;dharmamama1@...&gt;","profile":"carenkh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Are you a good mom, or a bad mom?","postDate":"1242044006","msgId":44836,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd1OTRwNisyMThqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGd1OTM0NitwNTkzQGVHcm91cHMuY29tPg=="},"prevInTopic":44835,"nextInTopic":44837,"prevInTime":44835,"nextInTime":44837,"topicId":44816,"numMessagesInTopic":0,"msgSnippet":"I teach in my church s preschool RE (religious education) class. There is a family whose 2 daughters are in my class, they are just-turned-5 and 3. The","messageBody":"<div id=\"ygrps-yiv-2009961349\">I teach in my church&#39;s preschool RE (religious education) class. There is a family whose 2 daughters are in my class, they are just-turned-5 and 3. The three-year-old is delightfully energetic, she wants to play, play, play and provoke others into playing. We have a circle time where we act out a story with manipulatives, and she has a HARD time not bugging others during that time. I handle it in different ways, depending on what she&#39;s doing, what she seems to need, etc.  I&#39;ve wondered about offering the parents information about respectful, connected parenting. I couldn&#39;t think of how to do it.<br/>\n<br/>\nI have thought for a while that the principles of my religion, Unitarian Universalism, lend themselves very well to radical unschooling. For example, the first principle is that we believe in the inherent worth and dignity of every person. I have fantasized about holding adult education classes in my church about radical unschooling, or maybe consensual living or whatever I would call it, actually, because I think a lot of parents would be more willing to look at their relationship with their kids than they would look at taking their kids out of school. It&#39;s been in my mind to write up a little something about the principles and parenting, and have workshops about it. We have workshops about a very diverse range of topics throughout the year...   I&#39;ve thought about it, but never done anything about it.<br/>\n<br/>\nI got word Saturday that the five year old of that family was accidentally given a higher dose of some medication she&#39;s taking; it&#39;s highly toxic, and she was in the ICU, with some question of whether she would make it or not. I still haven&#39;t heard how she is, I&#39;m going to call her aunt (also a member of the church) later today. I&#39;m thinking no news is good news, for now.<br/>\n<br/>\nThere&#39;s something about this, that&#39;s pushing me toward moving forward with the writing and the workshops. Maybe it&#39;s... if the worst were to happen, and her parents had come to the workshop and started living the principles, her last days would have been more peaceful and connected than they might have been.<br/>\n<br/>\nI&#39;m a little bit in awe of people who &quot;put themselves out there&quot; in the unschooling world. There&#39;s a lot of misinformation and harsh criticism, and I think that&#39;s one reason why I haven&#39;t done this - I don&#39;t want to make myself a target. But it&#39;s not about me, is it? It&#39;s about the very energetic three year old, and her just-turned-five sister, who deserve to be accepted and celebrated for who they are.<br/>\n<br/>\nMy thoughts this morning - <br/>\n<br/>\nCaren</div>","specialLinks":[]},{"userId":222835102,"authorName":"Verna","from":"&quot;Verna&quot; &lt;lalow@...&gt;","profile":"lalow66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Are you a good mom, or a bad mom?","postDate":"1242042310","msgId":44835,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd1OTM0NitwNTkzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDNhOTNmZmYxMDkwNTExMDQyNXEyNTVjZGFmZm5mNWU5OTA1ZDJiYjI3MzJAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":44833,"nextInTopic":44836,"prevInTime":44834,"nextInTime":44836,"topicId":44816,"numMessagesInTopic":0,"msgSnippet":"My husband woke me up yestereday.  Brought me an omelet and the kids brought me flowers that he had helped them plant in pots with their names and cards they","messageBody":"<div id=\"ygrps-yiv-1593687408\">My husband woke me up yestereday.  Brought me an omelet and the kids brought me flowers that he had helped them plant in pots with their names and cards they had drawn.  I took a nice shower with water from our newly installed hot water heater.  It had taken a week to have it installed so I enjoyed that shower.  I straitened up the kids bedrooms, went outside and let them showoff their new tricks on the swing set, got them snacks and packed up for a picnic.  We all went to Lowes and bought a new toilet for our downstairs bathroom.  My 6 year old had also been asking for a clip on light for his bed so we got that too.<br/>\nThen we picked up KFC and headed for a nice few hours at the park.  My husband played basketball with whoever would play and everyone else just ran and ran.  It was all very nice and relaxing.<br/>\nAfter we got home I filled the car with stuff for the salvation army and took my two middle kids with me.  We droped the stuff off and went to Old Navy, armed with 2 coupons totally 15 dollars.  My daughter wanted some flip flops and my son has been wearing cut off sweatpants everywhere lately so I thought perhaps some basketball shorts might have a similiar feel and be a little more dressy for dressier times.  They both saw some superhero t shirts and my son asked if he could have a batman one.  I asked if he would rather have the shirt than the basketball outfit and he declined, saying he actually has 2 batman shirts at home.  Then they saw a Superman shirt and asked if we could get it for their little brother at home.  I thought this was a sweat request and I did know how much he would love it so we got that too.<br/>\nHe did really love the shirt.  The rest of the day was trying out the new toilet my husband installed why we were at the store, playing in the yard, watching t.v., playing roblox, ending with James Bond and carrying a couple tired boys to bed.<br/>\nGreat day!</div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Are you a good mom, or a bad mom?","postDate":"1242041122","msgId":44833,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNhOTNmZmYxMDkwNTExMDQyNXEyNTVjZGFmZm5mNWU5OTA1ZDJiYjI3MzJAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PGd1OGZ2dCs4MXJoQGVHcm91cHMuY29tPg==","referencesHeader":"PDdDRkU1ODgwLUQ1NTUtNDZGNi1CQTZDLThFQjQ0RDIyNTAyQkBTYW5kcmFkb2RkLmNvbT4JIDxndThmdnQrODFyaEBlR3JvdXBzLmNvbT4="},"prevInTopic":44831,"nextInTopic":44835,"prevInTime":44832,"nextInTime":44834,"topicId":44816,"numMessagesInTopic":0,"msgSnippet":"I had a wonderful mother s day here too.  I am visiting friends on a mini-vacation and am up early today and yesterday (my continuing sleep saga is really very","messageBody":"<div id=\"ygrps-yiv-1064406835\">I had a wonderful mother&#39;s day here too.  I am visiting friends on a<br/>\nmini-vacation and am up early today and yesterday (my continuing sleep saga<br/>\nis really very comic but that&#39;s another story).  Unfortunately Brian was<br/>\ntied up with several projects so we missed him but other than that it was<br/>\nour day just as I like it to be.<br/>\n<br/>\nKarl and I went to the park yesterday but first hit the grocery store<br/>\nbecause our friend Micki that we&#39;re staying with had a tootsie roll pop on<br/>\nher desk and I told him about blow pops (bubble gum in the middle for places<br/>\nwithout those).  We didn&#39;t find any at the store but there was bubble gum<br/>\nand I showed him how I blow bubbles and he figured out some about that and<br/>\nthe sugar was fun by itself.  I found grape soda which I haven&#39;t had in<br/>\nyears.  It was warm weather so that went down nicely.<br/>\n<br/>\nWe try to go to Hands On children&#39;s museum when we come to Johnson City TN,<br/>\none of Karl&#39;s favorite places, so we were there until closing at 4:30.  He<br/>\nhad a blast and I had fun talking with a fellow art grad from ETSU who works<br/>\nthere.  She told me the coolest story about a boy who was a regular visitor<br/>\nthere and very quiet.  Then one day she turned on some Elvis videos over the<br/>\nprojectors and the boy (then 7 years old) who has had a fascination for<br/>\nanything Elvis since he was 3, got up a did a great impression of Elvis.<br/>\nThe next time he visited, he brought a couple of his Elvis outfits and did<br/>\n12 songs with a guitar.<br/>\n<br/>\nThen Karl and I walked to the park after a short rest at Micki&#39;s.  They&#39;re<br/>\nprobably old news but I was totally bowled over by the ripboards I&#39;m seeing<br/>\nkids skating on around here.  Karl watched an older boy shooting basketball,<br/>\nwhich he seems suddenly much more interested in.  I&#39;m thinking to put up the<br/>\nhoop we have at home down low enough so he can try that whole thing out.<br/>\nThe regulation hoops being pretty high up.<br/>\n<br/>\nWe went to a birthday party and naturally I got the time totally mixed up<br/>\nand wasn&#39;t there very long at all but it was a lot of fun and I took some<br/>\npictures which were a hoot.  Then we went back to my friend&#39;s house and<br/>\nwatched some tv and talked and hung out for a while and to bed.  What a day!<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; This was my first Mother&#39;s Day with my husband.  He is a chef, and that<br/>\n </span></blockquote>means Mother&#39;s Day Brunches - early mornings, gone all day, and home<br/>\nexhausted.  Although it&#39;s always been this way, I selfishly let myself feel<br/>\nI was owed something special the second Sunday in May.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; This year, Cinqo de Mayo fell on his regular day off, and it&#39;s a Latino<br/>\n </span></blockquote>restaurant.  The trade-off for working it was today at home!<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I fantasized about French toast and sausage in bed, a picnic lunch in a<br/>\n </span></blockquote>local park with fountains, springs, streams, ducks, aple room to run, and a<br/>\ncarousel for Annalise.  Then I&#39;d get a blissful hour or two to shut myself<br/>\nin my room and write.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I was woken by a little girl who&#39;d picked me a tulip and a lilac sprig,<br/>\n </span></blockquote>and was ready to go make me a card.  Jim brought coffee in bed (he forgot to<br/>\npick up eggs and sausage, but I don&#39;t really eat when I get up, anyway).  We<br/>\nhad conversation punctuated by cuddles and tickles, then got up to do some<br/>\nfamily work.  The kids were up late last night, so there was quite a bit of<br/>\ncreative byproduct to tend to.  Jim scooped the yard, because he said I<br/>\nshouldn&#39;t need to do that on Mother&#39;s Day, and we wanted to mow.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; He played with the kids, moved their climbing dome to where they wanted<br/>\n </span></blockquote>it, and did most of the back yard while I finished up Jeremiah&#39;s quarterly<br/>\nreport.  Even that has stopped being the burden it used to be only a few<br/>\nmonths ago.  Now, I tell the school enough to satisfy them that learning is<br/>\noccurring here,although I could add so much more, as Jeremiah is blossoming<br/>\nsince TV, computer, sleep, and food controls were lifted.  I also enjoy<br/>\nseeing how he&#39;s grown since the last report, and remembering the indelible<br/>\nmoments behind the dry &quot;educationalese&quot; the school seems to need.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; That done, I went to take a turn mowing so Jim could do some motorcycle<br/>\n </span></blockquote>repair. But we were out of gas.  and, in that moment, I felt my<br/>\ndisappointment, and knew that I actually wanted to mow.  Jim, my hero, went<br/>\nto the station to get more, and I read The Gas We Pass and Fancy Nancy&#39;s A<br/>\nto Z Book of Fancy Words to an intestine, vocabulary, and fashion loving<br/>\nAnnalise, who was sad not to be going with Daddy...<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Jeremiah was taking full advantage of Mom&#39;s laptop and its Internet to<br/>\n </span></blockquote>play Qubo, Funbrain, Poptropia, and Age of Empires II, which he deemed &quot;the<br/>\ncoolest game EVER!&quot;  I mowed &quot;roads&quot; for Annalise, who likes to follow<br/>\ndirectly behind me, holding my shirttails.  She found a length of PVC pipe,<br/>\nchristened it Little Black, and rode it round and round the yard, through<br/>\nthe garage, with Corki the dog for a companion.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Annalise and I got to see the wires frying and the huge cloud of smoke<br/>\n </span></blockquote>when Jim shorted out the bike&#39;s circuitry (for the second time...he is<br/>\nfrustrated, but thinking....).  Scary-impressive.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; We ordered Chinese, and made the kids a Chinese monkey platter.  We all<br/>\n </span></blockquote>watched Star Trek, &quot;The Trouble with Tribbles&quot; because Miah wanted to, then<br/>\npart of &quot;I,Mudd&quot; (androids and miming and Mudd, oh my!) before Jim and the<br/>\nkids made me dark chocolate-dipped strawberries.  Then Jim did hugs and<br/>\ntickles and &quot;The Incredible Journey&quot; with the kids, and I did get an hour or<br/>\nso to write before I went and helped Lise put all her babies in pajamas and<br/>\nbeds, and wash and hang their laundry on the clothesline, and the boys did<br/>\nboy things.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Now Lise is asleep, Jeremiah is playing Caren Sandiego Mysteries Through<br/>\n </span></blockquote>Time and watching Friends, and Jim and I are winding down, watching<br/>\nM*A*S*H...<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I am truly blessed.....this is what it&#39;s all about, isn&#39;t it...just the<br/>\n </span></blockquote>living, joyfully, freely, and in a way that honors us all...*BWG*<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Wow!<br/>\n&gt; Shannon<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":195268684,"authorName":"Shannon D. Burton","from":"&quot;Shannon D. Burton&quot; &lt;memismommy@...&gt;","profile":"memismommy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Are you a good mom, or a bad mom?","postDate":"1242022717","msgId":44831,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd1OGZ2dCs4MXJoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDdDRkU1ODgwLUQ1NTUtNDZGNi1CQTZDLThFQjQ0RDIyNTAyQkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":44830,"nextInTopic":44833,"prevInTime":44830,"nextInTime":44832,"topicId":44816,"numMessagesInTopic":0,"msgSnippet":"... Verry entertaining! This was my first Mother s Day with my husband.  He is a chef, and that means Mother s Day Brunches - early mornings, gone all day, and","messageBody":"<div id=\"ygrps-yiv-97320714\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; -=-&gt;<br/>\n&gt;  &gt; Brett&#39;s boyfriend lives here, though the plan is for him to move out<br/>\n&gt;  &gt; within the next couple of months. They&#39;ll still &quot;be a couple.&quot;<br/>\n&gt; <br/>\n&gt; Hmmmm a little kinky..... I had no idea.....-=-<br/>\n&gt; <br/>\n&gt; OH YEAH!   I mixed people up a little.   (Sorry...)<br/>\n&gt; <br/>\n&gt; Brett, Holly&#39;s boyfriend, lives here.<br/>\n&gt; <br/>\n&gt; Sheesh.<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n<br/>\n </span></blockquote>Verry entertaining!<br/>\n<br/>\nThis was my first Mother&#39;s Day with my husband.  He is a chef, and that means Mother&#39;s Day Brunches - early mornings, gone all day, and home exhausted.  Although it&#39;s always been this way, I selfishly let myself feel I was owed something special the second Sunday in May. <br/>\n<br/>\nThis year, Cinqo de Mayo fell on his regular day off, and it&#39;s a Latino restaurant.  The trade-off for working it was today at home!<br/>\n<br/>\nI fantasized about French toast and sausage in bed, a picnic lunch in a local park with fountains, springs, streams, ducks, aple room to run, and a carousel for Annalise.  Then I&#39;d get a blissful hour or two to shut myself in my room and write.<br/>\n<br/>\nI was woken by a little girl who&#39;d picked me a tulip and a lilac sprig, and was ready to go make me a card.  Jim brought coffee in bed (he forgot to pick up eggs and sausage, but I don&#39;t really eat when I get up, anyway).  We had conversation punctuated by cuddles and tickles, then got up to do some family work.  The kids were up late last night, so there was quite a bit of creative byproduct to tend to.  Jim scooped the yard, because he said I shouldn&#39;t need to do that on Mother&#39;s Day, and we wanted to mow. <br/>\n<br/>\nHe played with the kids, moved their climbing dome to where they wanted it, and did most of the back yard while I finished up Jeremiah&#39;s quarterly report.  Even that has stopped being the burden it used to be only a few months ago.  Now, I tell the school enough to satisfy them that learning is occurring here,although I could add so much more, as Jeremiah is blossoming since TV, computer, sleep, and food controls were lifted.  I also enjoy seeing how he&#39;s grown since the last report, and remembering the indelible moments behind the dry &quot;educationalese&quot; the school seems to need. <br/>\n<br/>\nThat done, I went to take a turn mowing so Jim could do some motorcycle repair. But we were out of gas.  and, in that moment, I felt my disappointment, and knew that I actually wanted to mow.  Jim, my hero, went to the station to get more, and I read The Gas We Pass and Fancy Nancy&#39;s A to Z Book of Fancy Words to an intestine, vocabulary, and fashion loving Annalise, who was sad not to be going with Daddy...<br/>\n<br/>\nJeremiah was taking full advantage of Mom&#39;s laptop and its Internet to play Qubo, Funbrain, Poptropia, and Age of Empires II, which he deemed &quot;the coolest game EVER!&quot;  I mowed &quot;roads&quot; for Annalise, who likes to follow directly behind me, holding my shirttails.  She found a length of PVC pipe, christened it Little Black, and rode it round and round the yard, through the garage, with Corki the dog for a companion.  <br/>\n<br/>\nAnnalise and I got to see the wires frying and the huge cloud of smoke when Jim shorted out the bike&#39;s circuitry (for the second time...he is frustrated, but thinking....).  Scary-impressive. <br/>\n<br/>\nWe ordered Chinese, and made the kids a Chinese monkey platter.  We all watched Star Trek, &quot;The Trouble with Tribbles&quot; because Miah wanted to, then part of &quot;I,Mudd&quot; (androids and miming and Mudd, oh my!) before Jim and the kids made me dark chocolate-dipped strawberries.  Then Jim did hugs and tickles and &quot;The Incredible Journey&quot; with the kids, and I did get an hour or so to write before I went and helped Lise put all her babies in pajamas and beds, and wash and hang their laundry on the clothesline, and the boys did boy things.<br/>\n<br/>\nNow Lise is asleep, Jeremiah is playing Caren Sandiego Mysteries Through Time and watching Friends, and Jim and I are winding down, watching M*A*S*H...<br/>\n<br/>\nI am truly blessed.....this is what it&#39;s all about, isn&#39;t it...just the living, joyfully, freely, and in a way that honors us all...*BWG*<br/>\n<br/>\nWow!<br/>\nShannon  <br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Are you a good mom, or a bad mom?","postDate":"1241980512","msgId":44830,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdDRkU1ODgwLUQ1NTUtNDZGNi1CQTZDLThFQjQ0RDIyNTAyQkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGd1NzV2dCttbjcyQGVHcm91cHMuY29tPg==","referencesHeader":"PGd1NzV2dCttbjcyQGVHcm91cHMuY29tPg=="},"prevInTopic":44829,"nextInTopic":44831,"prevInTime":44829,"nextInTime":44831,"topicId":44816,"numMessagesInTopic":0,"msgSnippet":"-=- ... Hmmmm a little kinky..... I had no idea.....-=- OH YEAH!   I mixed people up a little.   (Sorry...) Brett, Holly s boyfriend, lives here. Sheesh. ","messageBody":"<div id=\"ygrps-yiv-263075061\">-=-&gt;<br/>\n<blockquote><span title=\"ireply\">  &gt; Brett&#39;s boyfriend lives here, though the plan is for him to move out<br/>\n &gt; within the next couple of months. They&#39;ll still &quot;be a couple.&quot;<br/>\n<br/>\n </span></blockquote>Hmmmm a little kinky..... I had no idea.....-=-<br/>\n<br/>\nOH YEAH!   I mixed people up a little.   (Sorry...)<br/>\n<br/>\nBrett, Holly&#39;s boyfriend, lives here.<br/>\n<br/>\nSheesh.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny C","from":"&quot;Jenny C&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Are you a good mom, or a bad mom?","postDate":"1241979709","msgId":44829,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd1NzV2dCttbjcyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQyQzZDRDcwLTJDNDEtNEFCMi1BNTZELTIzREEwMTdCQUJDOEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":44828,"nextInTopic":44830,"prevInTime":44828,"nextInTime":44830,"topicId":44816,"numMessagesInTopic":0,"msgSnippet":"... Hmmmm a little kinky..... I had no idea.....","messageBody":"<div id=\"ygrps-yiv-1510293429\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; Brett&#39;s boyfriend lives here, though the plan is for him to move out<br/>\n&gt; within the next couple of months. They&#39;ll still &quot;be a couple.&quot;<br/>\n<br/>\n </span></blockquote>Hmmmm a little kinky..... I had no idea.....</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Are you a good mom, or a bad mom?","postDate":"1241979194","msgId":44828,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyQzZDRDcwLTJDNDEtNEFCMi1BNTZELTIzREEwMTdCQUJDOEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGd1NzQxcitrbjl2QGVHcm91cHMuY29tPg==","referencesHeader":"PGd1NzQxcitrbjl2QGVHcm91cHMuY29tPg=="},"prevInTopic":44827,"nextInTopic":44829,"prevInTime":44827,"nextInTime":44829,"topicId":44816,"numMessagesInTopic":0,"msgSnippet":"-=-I was just having this very conversation with Chamille s boyfriend, in the car when I picked him up to come over and spend the day with us, not his mother.","messageBody":"<div id=\"ygrps-yiv-1956606451\">-=-I was just having this very conversation with Chamille&#39;s boyfriend,  <br/>\nin<br/>\nthe car when I picked him up to come over and spend the day with us, not<br/>\nhis mother. -=-<br/>\n<br/>\nYesterday when Marty was at work, his girlfriend came over to talk to  <br/>\nme, at my request.   Marty had asked me to talk to her about some  <br/>\nattitude things, and I did.  We were talking about how she could be a  <br/>\nhappier person, and about what Marty meant when he told her that every  <br/>\ntime he was with her he had chosen to be with her.   (And she had  <br/>\nresponded that yes, but every time he was NOT with her he had chosen  <br/>\nnot to be with her.)   And other problems.<br/>\n<br/>\nBut she cried some, and I felt bad, but she said she DID want to be  <br/>\nmore like Marty, and be happier.  She said the first time she came to  <br/>\nour house and saw how we were with each other she felt like she was in  <br/>\nanother universe.<br/>\n<br/>\nBrett&#39;s boyfriend lives here, though the plan is for him to move out  <br/>\nwithin the next couple of months.  They&#39;ll still &quot;be a couple.&quot;   But  <br/>\nhe got up and said &quot;Happy Mother&#39;s Day!&quot; with real feeling, and I  <br/>\nsmiled a truly big, real smile.   Probably he is obligated to take his  <br/>\nmother to dinner.  I didn&#39;t ask.  He doesn&#39;t enjoy being with his  <br/>\nmother, though.<br/>\n<br/>\nOn Wednesday, he and Holly and Marty and I are going to karaoke  <br/>\ntogether, and that&#39;s my Mother&#39;s Day outing.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny C","from":"&quot;Jenny C&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Are you a good mom, or a bad mom?","postDate":"1241977723","msgId":44827,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd1NzQxcitrbjl2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDFFNzRFM0Q4LTc1OTQtNDUxMy1BMjE1LTc3MDZFMUYzRkYwMEBTYW5kcmFEb2RkLmNvbT4="},"prevInTopic":44823,"nextInTopic":44828,"prevInTime":44826,"nextInTime":44828,"topicId":44816,"numMessagesInTopic":0,"msgSnippet":"... On the chat on Friday, Schuyler mentioned an interview on This American Life called I Didn t Ask To Be Born ","messageBody":"<div id=\"ygrps-yiv-712791615\"><blockquote><span title=\"ireply\">&gt; This morning on CBS Sunday Morning, there was an item on mom&#39;s doubts<br/>\n&gt; and feelings they were being good moms. They talked about a website<br/>\n&gt; where moms leave confessions of things they&#39;ve done, called True Mom<br/>\n&gt; Confessions.<br/>\n<br/>\n </span></blockquote>On the chat on Friday, Schuyler mentioned an interview on This American<br/>\nLife called I Didn&#39;t Ask To Be Born<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.thisamericanlife.org/Radio_Episode.aspx?sched=1288\">http://www.thisamericanlife.org/Radio_Episode.aspx?sched=1288</a>&gt;  .  I<br/>\nlistened to it because it was about teens running away, which is near<br/>\nand dear to my heart right now.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; A woman who wrote a book called Bad Mom said for every letter she got<br/>\n&gt; saying she was a terrible mother she got ten saying thank you. She<br/>\n&gt; said it was a great comfort to know others had screwed up too.<br/>\n<br/>\n </span></blockquote>The mother in the interview also wrote a book, which I haven&#39;t read and<br/>\nam still undecided as to wether I want to or not.  She&#39;s comforting lots<br/>\nof other mothers who&#39;s children have run away, but the bottom line is,<br/>\nthat every thing that I&#39;ve read about this person suggests that she<br/>\ndoesn&#39;t know what she could&#39;ve done to prevent her kids from running<br/>\naway.  She blames herself for sure, but still doesn&#39;t GET that she<br/>\ncould&#39;ve prevented it all from the beginning if she&#39;d done things<br/>\ndifferently.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Had the mom lived in such a way there were no secrets to keep, that<br/>\n&gt; would be better. In the context of that article, it seemed that<br/>\n&gt; lies told to other mothers (or information concealed) was the sin, not<br/>\n&gt; the lies told to children. When she said &quot;keeping a secret,&quot; she<br/>\n&gt; wasn&#39;t talking about the secrets the mom was keeping from her<br/>\n </span></blockquote>children.<br/>\n<br/>\nI was just having this very conversation with Chamille&#39;s boyfriend, in<br/>\nthe car when I picked him up to come over and spend the day with us, not<br/>\nhis mother.  He was telling me that the thing he dislikes most about his<br/>\nmother and the thing he has the hardest time with, is that she lies<br/>\nabout everything.  She lies and says she will do something and then drop<br/>\nthe ball, which he acknowledged that perhaps isn&#39;t an outright lie, but<br/>\nclearly not nice anyway, but also that she lies about other things,<br/>\nstupid things, everything really, to make herself look better in the<br/>\neyes of her son.  To me, these are the lies that are the worst, the lies<br/>\ntold to children, in some attempt to make themselves seem better in the<br/>\neyes of their children.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I know it&#39;s not Mother&#39;s Day everywhere today, but it is here, so<br/>\n&gt; there will be a fair amount of information about idealized and<br/>\n&gt; mainstream mothering poured out today.<br/>\n<br/>\n<br/>\n </span></blockquote>I don&#39;t want anything to do with mainstream mothering!  Cyle, Chamille&#39;s<br/>\nboyfriend, told me that Chamille doesn&#39;t say any of the things that all<br/>\nhis other friends say about their mothers.  He told me that I&#39;m a good<br/>\nmother and that it shows in lots of ways, but mostly because my kids<br/>\nthink I&#39;m a good mother, and that&#39;s what counts in motherhood!<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Are you a good mom, or a bad mom?","postDate":"1241972436","msgId":44823,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQ4QjFDQzhFLUY5QUUtNEUzMC05NzYwLTQxODIzRkY3Q0YxQ0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGd1NnFuZCtuMjhuQGVHcm91cHMuY29tPg==","referencesHeader":"PGd1NnFuZCtuMjhuQGVHcm91cHMuY29tPg=="},"prevInTopic":44822,"nextInTopic":44827,"prevInTime":44822,"nextInTime":44824,"topicId":44816,"numMessagesInTopic":0,"msgSnippet":"-=-I have no interest in sitting around, being waited on... I am going to play, feed and nurture my kids.-=- I think when families give mom a day off, it s","messageBody":"<div id=\"ygrps-yiv-947429772\">-=-I have no interest in sitting around, being waited on... I am going  <br/>\nto play, feed and nurture my kids.-=-<br/>\n<br/>\nI think when families give mom a day off, it&#39;s partly because ghe  <br/>\nassumption is that she&#39;s spent the other days doing things she &quot;had  <br/>\nto&quot; do.  It&#39;s different when it&#39;s a choice.<br/>\n<br/>\nI asked Holly to take a photo of me, her, and some ivy with a  <br/>\nhistory.   I&#39;ve put some of the photos here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.blogspot.com/2009/05/my-ivy-on-mothers-day.html\">http://sandradodd.blogspot.com/2009/05/my-ivy-on-mothers-day.html</a><br/>\n<br/>\nI figure Kirby will call me at some point.   Other than that, it will  <br/>\nbe another day with the regular good stuff.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":310514283,"authorName":"Elizabeth","from":"&quot;Elizabeth&quot; &lt;jackson@...&gt;","profile":"lilyfoil","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Are you a good mom, or a bad mom?","postDate":"1241968927","msgId":44822,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd1NnJlditpaWJsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEE4QzlCM0U5LTg3RDctNDhDRS1CRkJGLUM0MDEzMjg0OTJDMEBzYmNnbG9iYWwubmV0Pg=="},"prevInTopic":44821,"nextInTopic":44823,"prevInTime":44821,"nextInTime":44823,"topicId":44816,"numMessagesInTopic":0,"msgSnippet":"Thank you Patti & Sandra, both great posts to read this morning. -- A Lurker :)","messageBody":"<div id=\"ygrps-yiv-1225560125\">Thank you Patti & Sandra, both great posts to read this morning.<br/>\n<br/>\n<br/>\n-- A Lurker :)</div>","specialLinks":[]},{"userId":222835102,"authorName":"Verna","from":"&quot;Verna&quot; &lt;lalow@...&gt;","profile":"lalow66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Are you a good mom, or a bad mom?","postDate":"1241968173","msgId":44820,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd1NnFuZCtuMjhuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDkzNDYxMy45MjA5MC5xbUB3ZWI4NjIxMS5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":44819,"nextInTopic":44821,"prevInTime":44819,"nextInTime":44821,"topicId":44816,"numMessagesInTopic":0,"msgSnippet":"Last night, I went out to a movie with a friend.  She was listing all the things her husband and kids were going to do for her today... let her sleep late,","messageBody":"<div id=\"ygrps-yiv-728166725\">Last night, I went out to a movie with a friend.  She was listing all the things her husband and kids were going to do for her today... let her sleep late, breakfast in bed, give the kids a bath, any chores that need to be done.  Each Mother&#39;s Day, her husband takes care of everything so she can just sit around and rest.  <br/>\nWhen I got home, I, half joking, asked my husband if he was going to do all those things.  His response... I am not so and so.  So I lay in bed for a while, feeling sorry for myself, thinking of the things that need to be done today.<br/>\nWell this morning, my husband did make me breakfast and then I got on here and read the last few posts about Mother&#39;s Day and realized, I got it all wrong.  Today should be about how lucky I am to be a Mother.  How lucky I am to get to do these things for my kids and how lucky I am to spend today and everyday with the best kids in the world (my opinion anyway), doing whatever it is that needs to be done for them.  I have no interest in sitting around, being waited on... I am going to play, feed and nurture my kids.</div>","specialLinks":[]},{"userId":273211037,"authorName":"Patti","from":"Patti &lt;patti.dengler@...&gt;","profile":"patti.dengler@sbcglobal.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Are you a good mom, or a bad mom?","postDate":"1241968132","msgId":44821,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE4QzlCM0U5LTg3RDctNDhDRS1CRkJGLUM0MDEzMjg0OTJDMEBzYmNnbG9iYWwubmV0Pg==","inReplyToHeader":"PDFFNzRFM0Q4LTc1OTQtNDUxMy1BMjE1LTc3MDZFMUYzRkYwMEBTYW5kcmFEb2RkLmNvbT4=","referencesHeader":"PDFFNzRFM0Q4LTc1OTQtNDUxMy1BMjE1LTc3MDZFMUYzRkYwMEBTYW5kcmFEb2RkLmNvbT4="},"prevInTopic":44820,"nextInTopic":44822,"prevInTime":44820,"nextInTime":44822,"topicId":44816,"numMessagesInTopic":0,"msgSnippet":"I don t watch TV so I don t really know what the shows are that you are all talking about but this subject touches me. I am a person who does most things with","messageBody":"<div id=\"ygrps-yiv-1958102652\">I don&#39;t watch TV so I don&#39;t really know what the shows are that you  <br/>\nare all talking about but this subject touches me.<br/>\n<br/>\nI am a person who does most things with earnestness, including  <br/>\nmothering.  My intentions are good.  My actions are often good.   <br/>\nSometimes I mess up.  I enjoy talking about my mess ups with other  <br/>\nmoms.  And sometimes we do laugh about how crazy it can be.  It&#39;s a  <br/>\nrelief not to keep it to myself- to put it under the microscope and  <br/>\nconfess and decide what to keep and what to change, where it went  <br/>\nwrong and why.  And to know that other moms I admire have their  <br/>\nmoments too and what they did and thought.  It&#39;s good to remember that  <br/>\nwe are all human and trying and not alone in this hugely scary  <br/>\nbusiness of mothering.<br/>\n<br/>\nI never would laugh at hurting my child.  I never would make fun of my  <br/>\nchild.  I would never make fun of another mother.  I just think  <br/>\nmothering is a very serious business.  Getting it right sometimes  <br/>\nfeels exquisitely hard.  I try to hold myself to a high standard.  I  <br/>\nalso believe something someone said and I forget who- &quot;sometimes the  <br/>\nonly to cope with something deadly serious is to treat it a little  <br/>\nlightly.&quot;  Humor is one of the biggest and best tools in my tool box.<br/>\n<br/>\nI am better at being being gentle and empathic with the children in my  <br/>\nlife than myself.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On May 10, 2009, at 6:59 AM, Sandra Dodd wrote:<br/>\n<br/>\n&gt;<br/>\n&gt; This morning on CBS Sunday Morning, there was an item on mom&#39;s doubts<br/>\n&gt; and feelings they were being good moms. They talked about a website<br/>\n&gt; where moms leave confessions of things they&#39;ve done, called True Mom<br/>\n&gt; Confessions. I didn&#39;t bring the link because I&#39;m not planning to go<br/>\n&gt; there. I think it would be upsetting and today&#39;s a moms-be-happy day!<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Are you a good mom, or a bad mom?","postDate":"1241965924","msgId":44819,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkzNDYxMy45MjA5MC5xbUB3ZWI4NjIxMS5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PDkzMzUwNi41MzI1OS5xbUB3ZWI4NjIwNS5tYWlsLmlyZC55YWhvby5jb20+","referencesHeader":"PDFFNzRFM0Q4LTc1OTQtNDUxMy1BMjE1LTc3MDZFMUYzRkYwMEBTYW5kcmFEb2RkLmNvbT4gPDkzMzUwNi41MzI1OS5xbUB3ZWI4NjIwNS5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":44818,"nextInTopic":44820,"prevInTime":44818,"nextInTime":44820,"topicId":44816,"numMessagesInTopic":0,"msgSnippet":"Two missed words: you don t get hit minis , you get hit for minis and I climbed back down and moved the ladder over, not the ball or something else, I moved","messageBody":"<div id=\"ygrps-yiv-803651181\">Two missed words: <br/>\n<br/>\nyou don&#39;t &quot;get hit minis&quot;, &quot;you get hit for minis&quot; and I climbed back down and moved the ladder over, not the ball or something else, I moved the ladder over. <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Schuyler &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:s.waynforth@...\">s.waynforth@...</a>&gt;<br/>\n<br/>\nIn the car they were playing a strange modified game of slug bug, where you get hit minis and for yellow things and convertibles and bikes and lots of things, vw bugs aren&#39;t frequent enough. <br/>\n<br/>\nThey played a game of rounders (softball) and managed to hit the ball onto the top of a high hedge. I got the ladder and put it up and each of the kids climbed it and looked around and then I climbed and spotted the ball and climbed back down and moved it over and asked who wanted to get it. <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Are you a good mom, or a bad mom?","postDate":"1241965537","msgId":44818,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkzMzUwNi41MzI1OS5xbUB3ZWI4NjIwNS5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PDFFNzRFM0Q4LTc1OTQtNDUxMy1BMjE1LTc3MDZFMUYzRkYwMEBTYW5kcmFEb2RkLmNvbT4=","referencesHeader":"PDFFNzRFM0Q4LTc1OTQtNDUxMy1BMjE1LTc3MDZFMUYzRkYwMEBTYW5kcmFEb2RkLmNvbT4="},"prevInTopic":44817,"nextInTopic":44819,"prevInTime":44817,"nextInTime":44819,"topicId":44816,"numMessagesInTopic":0,"msgSnippet":"Last night Simon and Linnaea spent at a friends house, so it was just David and I at home. I missed them. It was too quiet and while David and I had a nice","messageBody":"<div id=\"ygrps-yiv-981311574\">Last night Simon and Linnaea spent at a friends house, so it was just David and I at home. I missed them. It was too quiet and while David and I had a nice evening together and cuddle on the couch and watched silly shows and chatted, the house felt so empty without them. <br/>\n<br/>\nLinnaea called this morning to say they wanted to come home early and asked if they could bring their friend and his younger brother (just 4 years old) home with them. They did. In the car they were playing a strange modified game of slug bug, where you get hit minis and for yellow things and convertibles and bikes and lots of things, vw bugs aren&#39;t frequent enough. And it was loud and both David and I were grinning and laughing and finding things and adding to their list. <br/>\n<br/>\nThey played a game of rounders (softball) and managed to hit the ball onto the top of a high hedge. I got the ladder and put it up and each of the kids climbed it and looked around and then I climbed and spotted the ball and climbed back down and moved it over and asked who wanted to get it. Their friend did and he climbed and got it and his brother squirted him with a squirt gun on his way down. As I was putting the ladder away Linnaea came up to me and said &quot;you are really good with little kids, mom&quot; and it felt so good to hear. And so sweet that she was watching and weighing and paying attention. <br/>\n<br/>\nThat&#39;s my mother&#39;s day story on the day when it isn&#39;t mother&#39;s day in the country where I live. I don&#39;t know if it marks me as a good mom or a bad mom. I think I&#39;ll just keep trying to make every moment a bit better. One day they won&#39;t be here and the house will be emptier most of the time. I figure I can do all the other stuff then. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Are you a good mom, or a bad mom?","postDate":"1241965080","msgId":44817,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY5NTgwLjUxOTgxLnFtQHdlYjgxNTAyLm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PDFFNzRFM0Q4LTc1OTQtNDUxMy1BMjE1LTc3MDZFMUYzRkYwMEBTYW5kcmFEb2RkLmNvbT4=","referencesHeader":"PDFFNzRFM0Q4LTc1OTQtNDUxMy1BMjE1LTc3MDZFMUYzRkYwMEBTYW5kcmFEb2RkLmNvbT4="},"prevInTopic":44816,"nextInTopic":44818,"prevInTime":44816,"nextInTime":44818,"topicId":44816,"numMessagesInTopic":0,"msgSnippet":"Oprah did a show that touched some of that a few weeks ago. It was more about moms complaining about motherhood. I personally was disgusted by it. Not about","messageBody":"<div id=\"ygrps-yiv-191602469\">Oprah did a show that touched some of that a few weeks ago. It was more about moms complaining about motherhood.<br/>\nI personally was disgusted by it.<br/>\n<br/>\nNot about moms saying they did not shower for a week. But all the self pity and the condescending tone when they spoke of their children.<br/>\n<br/>\nThey were confessions ....argh!<br/>\n<br/>\nBy the way., it  is also mothers day on Brazil today.<br/>\n <br/>\nAlex Polikowsky<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n <br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Are you a good mom, or a bad mom?","postDate":"1241963987","msgId":44816,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFFNzRFM0Q4LTc1OTQtNDUxMy1BMjE1LTc3MDZFMUYzRkYwMEBTYW5kcmFEb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":44817,"prevInTime":44815,"nextInTime":44817,"topicId":44816,"numMessagesInTopic":0,"msgSnippet":"(I don t know how this might apply to any individual dad.) My best answer is a mom trying to be a better mom all the time. This morning on CBS Sunday","messageBody":"<div id=\"ygrps-yiv-277326685\">(I don&#39;t know how this might apply to any individual dad.)<br/>\n<br/>\nMy best answer is &quot;a mom trying to be a better mom all the time.&quot;<br/>\n<br/>\nThis morning on CBS Sunday Morning, there was an item on mom&#39;s doubts  <br/>\nand feelings they were being good moms.   They talked about a website  <br/>\nwhere moms leave confessions of things they&#39;ve done, called True Mom  <br/>\nConfessions.  I didn&#39;t bring the link because I&#39;m not planning to go  <br/>\nthere.  I think it would be upsetting and today&#39;s a moms-be-happy day!<br/>\n<br/>\nOne example they gave, though was a mom who said she didn&#39;t teach her  <br/>\nkids to tell time so she could tell them it was bedtime whenever she  <br/>\nwanted to.<br/>\n<br/>\nThen the web owner defended those kinds of confessions saying &quot;I don&#39;t  <br/>\nthink there&#39;s anything to be gained from keeping a secret.&quot;<br/>\n<br/>\nRoseanne Barr was interviewed about her TV show, a bit, and about her  <br/>\nreal-life mothering (she has five children, some grown).  She said of  <br/>\ncourse mothers feel guilty, but &quot;Most of the time, or 100% of the  <br/>\ntime, the reason you feel guilty is that you have a reason to feel  <br/>\nguilty.&quot;   She wasn&#39;t being funny, she was being serious.<br/>\n<br/>\nA woman who wrote a book called Bad Mom said for every letter she got  <br/>\nsaying she was a terrible mother she got ten saying thank you.  She  <br/>\nsaid it was a great comfort to know others had screwed up too.<br/>\n<br/>\nAll that reminded me of this list, and the policy of not saying &quot;good  <br/>\njob!&quot; or &quot;don&#39;t worry&quot; when moms come and tell us they&#39;re doing things  <br/>\nthey know aren&#39;t good for their kids.   And as to the quote about  <br/>\nkeeping secrets above, it seems another time for one mom to absolve  <br/>\nother moms and say &quot;Don&#39;t worry; just confess and you&#39;ll be forgiven.&quot;<br/>\n<br/>\nHad the mom lived in such a way there were no secrets to keep, that  <br/>\nwould be better.    In the context of that article, it seemed that  <br/>\nlies told to other mothers (or information concealed) was the sin, not  <br/>\nthe lies told to children.   When she said &quot;keeping a secret,&quot; she  <br/>\nwasn&#39;t talking about the secrets the mom was keeping from her children.<br/>\n<br/>\nI know it&#39;s not Mother&#39;s Day everywhere today, but it is here, so  <br/>\nthere will be a fair amount of information about idealized and  <br/>\nmainstream mothering poured out today.<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":44982,"nextTopicId":45002}}