{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":2892945,"authorName":"rowan555@aol.com","from":"rowan555@...","profile":"susangilleland","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: prejudice (was: unlimited tv and computer time)","postDate":"1076539953","msgId":90875,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyYy4zYjkwYTgyNS4yZDVjMGMzMUBhb2wuY29tPg=="},"prevInTopic":90860,"nextInTopic":0,"prevInTime":90874,"nextInTime":90876,"topicId":90823,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/11/2004 1:16:13 PM Central Standard Time, UnschoolingDiscussion@yahoogroups.com writes: Don t try to live on the edge while carrying ","messageBody":"<div id=\"ygrps-yiv-878328924\">In a message dated 2/11/2004 1:16:13 PM Central Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a> writes:<br/>\nDon&#39;t try to live on the edge while carrying <br/>\naround an outdated, unreasonable prejudice.<br/>\n<br/>\nSandra<br/>\nI don&#39;t post here much (I&#39;ve been lurking for a year or so), but I just <br/>\nwanted to say that this one sentence pretty much summarizes how I felt as I was <br/>\nreading through all the tv posts.  I wouldn&#39;t have been able to articulate it <br/>\nthat well, or that succinctly!  My kids are 2 and 4, and we&#39;ve never had any <br/>\nrules about tv.  I grew up in a home where the living room television was on <br/>\npretty  much whenever we were home, even though it was often just used for <br/>\n&quot;background noise&quot; while something else was going on.  I have never felt any emotions <br/>\none way or the other about tv - I don&#39;t worship it, nor do I demonize it.  Our <br/>\ntv is no doubt turned on more than might be the case in the &quot;average&quot; home - <br/>\nbut my kids rarely just sit and watch.  They play as they watch, they talk to <br/>\neach other and to me as they watch, or sometimes they also just use it as <br/>\nbackground noise.  My kids have learned SO much from television - I could not <br/>\npossibly see it as a bad or dangerous thing, or something which must be &quot;earned&quot; <br/>\nby spending time reading or doing school work (as I have been recently reading <br/>\nabout on another email group).  <br/>\n<br/>\nMy 2 year old daughter was asking for crackers the other day, and when I <br/>\nasked her how many, she answered in Spanish.  She then said, &quot;Gracias&quot; when I <br/>\nbrought them to her.  I asked her where she learned that, and she said, &quot;Dora!&quot;  I <br/>\nasked her if she wanted to learn more, and she did.  We&#39;ve been doing little <br/>\nimpromptu Spanish &quot;lessons&quot; since then.  Likewise, things the kids have seen <br/>\non tv have served as jumping off points to study sharks, to start sponsoring a <br/>\nchild, to discuss world events, to learn more about hurricanes, etc, etc, etc. <br/>\n Television truly opens the world up to us, and it makes us aware of so many <br/>\nthings we might otherwise not know about.  For young kids, their realm of <br/>\nactual experience is so small that television gives them a chance to find out a <br/>\nlittle about so many different things they&#39;ve never even heard of - and with <br/>\ntheir parents&#39; help, they can take those bits of knowledge/awareness, and then <br/>\nlearn and explore more.<br/>\n<br/>\nI&#39;m sorry to have rambled on - I just had to chime in on all of this.<br/>\n<br/>\nSusan<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] prejudice (was: unlimited tv and computer time)","postDate":"1076534113","msgId":90860,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM4LjQyMDg5YTVlLjJkNWJmNTYxQGFvbC5jb20+"},"prevInTopic":90838,"nextInTopic":90875,"prevInTime":90859,"nextInTime":90861,"topicId":90823,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/11/04 12:13:08 PM, Lmanathome@msn.com writes: ","messageBody":"<div id=\"ygrps-yiv-401381159\">In a message dated 2/11/04 12:13:08 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Lmanathome@...\">Lmanathome@...</a> writes:<br/>\n<br/>\n&lt;&lt; My point is...if she considers some foods poisons and I consider drugs <br/>\npoison, what&#39;s the difference in my judgement of these objects versus her <br/>\njudgment of food - what is unreasonable prejudice in this case?  Who am i to judge <br/>\n&lt;g&gt;?<br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;<br/>\n<br/>\n </span></blockquote>If her reasons don&#39;t seem reasonable (literally), then you can easily judge <br/>\nher to be unreasonable.  If she has reasons to feel that way about food that <br/>\nyou can&#39;t refute from knowledge or experience, then let it lie.<br/>\n<br/>\nMy mom said some people are allergic to fish and milk together, and those who <br/>\nare will die on the spot.  So she never fed us milk and fish together just in <br/>\ncase.   I realized about a year after my favorite meal became a fish sandwich <br/>\nand a chocolate milk shake at Tastee Freeze, that I had not died.<br/>\n<br/>\nMy mom wasn&#39;t being reasonable.<br/>\n<br/>\nPeople who make claims about television which others here can refute from <br/>\nknowledge or experience will lose their argument in this forum.    They can still <br/>\ngo home and not let their children eat fish and milk together while watching <br/>\nTV.  We&#39;ll never know.  But if they come here and want us to say &quot;Good idea!&quot; <br/>\nthey will probably not get what they wanted.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":94040812,"authorName":"Lisa H","from":"&quot;Lisa H&quot; &lt;Lmanathome@...&gt;","profile":"lmanathome","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] prejudice (was: unlimited tv and computer time)","postDate":"1076525658","msgId":90838,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTQtREFWMTQ4UUZqdGxuQVEwMDA0Y2UwMUBob3RtYWlsLmNvbT4=","referencesHeader":"PDExZC4yYjExN2YzZS4yZDViYmJmN0Bhb2wuY29tPg=="},"prevInTopic":90834,"nextInTopic":90860,"prevInTime":90837,"nextInTime":90839,"topicId":90823,"numMessagesInTopic":0,"msgSnippet":"Prejudice, opinions, choices, traditions....sometimes the line is fuzzy (sometimes not). I suppose it s a matter of opinion.  And opinions, choices,","messageBody":"<div id=\"ygrps-yiv-1075954036\">Prejudice, opinions, choices, traditions....sometimes the line is fuzzy (sometimes not). I suppose it&#39;s a matter of opinion.  And opinions, choices, traditions, prejudices change.<br/>\n<br/>\nFor instance, I often here myself say, &quot;that&#39;s why there&#39;s vanilla and chocolate and strawberry and coffee and mocha chip and pistachio and well you get the idea.&quot;  This is my response when someone says they do something one way and wonder if it&#39;s wrong or right just because someone else does something another way.  Just because my neighbor does something doesn&#39;t mean that&#39;s what we do.  Different flavors for different folks.<br/>\n<br/>\nFor instance, I am not comforatable putting a christmas tree in my home.  So we decorate throughout the house with other holiday symbols, changing them seasonally, and that seems to satisfy my kids.  But it is important to me, since neither my husband or i are christian, not to have a christmas tree.  Funny though I seem to be able to put up decorations honoring other traditions and cultures...ie Kwanza, paganism...hmmm perhaps i need to rethink my prejudice? re christmas tree...ah there&#39;s one of those fuzzy lines blurring from a perceived tradition to a choice to an old and ready to discard prejudice &lt;g&gt;.  I guess I need to chew on this a bit.<br/>\n<br/>\nI also know an unschooling family that is kosher.  So the fact that they have dietary restrictions in the home is a matter of respecting the family&#39;s tradition.  And as the children are respected they don&#39;t seem to have a problem with honoring the tradition.  BTW - the restrictions are not placed on the children outside the house - they are free to choose their food items.  And are probably free to choose their own foods in the house but are asked to respect the traditions of the parents.<br/>\n<br/>\n&lt;&lt;But if I replaced it with &quot;heroin&quot; it would be kinda goofy&gt;&gt;<br/>\n<br/>\nAs for heroin or drugs in general...great analogy and one that i&#39;ve struggled with in theory only and specifically in the realm of unschooling philosphy - as i haven&#39;t had to deal directly with my kids expressing a desire to indulge in drugs.  I do know that right now I would not provide my kids with it - but they are not asking - this is not strewed around my house (opinion, judgement).  My kids are aware and are provided with lots of information on drug abuse and alcholism (unfortunately too close to home) that i am hoping that it would not occur to them to pollute their bodies with something that would imo possibly damage them.  If or when they do decide to experiment with drugs - well, first i would hope that our relationship would enable them to talk with me about it - even though they know I have a healthy respect for the dangers of drugs and alcohol abuse but that i do trust their good judgement to be safe and careful and respectful to their bodies.<br/>\n<br/>\nWhen it comes to drugs, like crossing the street, I know that we are all vulnerable and life may happen regardless of how careful, knowledgable and respectful we are of ourselves and others.  So even in &quot;safe controlled experiments&quot; accidents happen.  And I can not control everything.<br/>\n<br/>\nBut then this line of thought brings me to wonder about the food thingy.  I have a close unschooling friend who believes that certain types of foods are poisons and is very active and outspoken on the subject.  She lectures, writes and sells products based on her understanding of health and natural hygiene.  So is this opinion an unreasonable prejudice?  I know she has struggled in the past with her dd&#39;s to find a balance in respecting their choices while being comfortable with her own enviroment and her sense of responsibility as their mother.  She has come to being able to let her dd&#39;s eat whatever they want - but the reality is they know she does have judgements.  We all know.  Many people I know have a certain sefl-consciousness around her ...well i suppose that&#39;s where &quot;judgements&quot; come into play.<br/>\n<br/>\nMy point is...if she considers some foods poisons and I consider drugs poison, what&#39;s the difference in my judgement of these objects versus her judgment of food - what is unreasonable prejudice in this case?  Who am i to judge &lt;g&gt;?<br/>\n<br/>\nI have to say it&#39;s alot easier to cross the line regarding a decorated tree honoring a religious tradtion or culture other than my own than accepting something i beleive to be poison.<br/>\n<br/>\nForgive me if my rambling is getting loopy....but my kids are gone for the day...<br/>\nLisa Heyman<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":73238415,"authorName":"J. Stauffer","from":"&quot;J. Stauffer&quot; &lt;jnjstau@...&gt;","profile":"jnjstau","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] prejudice (was: unlimited tv and computer time)","postDate":"1076523267","msgId":90834,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNDUwMWMzZjBjYSRlMmVkZWY1MCQzOTgwZWU0MEB5b3VybzBrd2t3OWp3Yz4=","referencesHeader":"PDExZC4yYjExN2YzZS4yZDViYmJmN0Bhb2wuY29tPg=="},"prevInTopic":90823,"nextInTopic":90838,"prevInTime":90833,"nextInTime":90835,"topicId":90823,"numMessagesInTopic":0,"msgSnippet":"... It reminds me so much of the song in The Music Man about We got trouble....right here in River City....It starts with T that rhymes with P and that","messageBody":"<div id=\"ygrps-yiv-717501023\">&lt;&lt;&lt;&lt;&lt;There has always and might always be a prejudice about the edge of the<br/>\n<blockquote><span title=\"ireply\"> &gt; available media/technology.&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>It reminds me so much of the song in &quot;The Music Man&quot; about &quot;We got<br/>\ntrouble....right here in River City....It starts with T that rhymes with P<br/>\nand that stands for Pool&quot;.<br/>\n<br/>\nFor those of you who don&#39;t know the story, billiards was fine but then the<br/>\nnew pool table came to town.<br/>\n<br/>\nWhat is that saying &quot;One dog barking at random can start all the<br/>\nneighborhood dogs barking in earnest.&quot;<br/>\n<br/>\nJulie S.</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"prejudice (was: unlimited tv and computer time)","postDate":"1076519415","msgId":90823,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDExZC4yYjExN2YzZS4yZDViYmJmN0Bhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":90834,"prevInTime":90822,"nextInTime":90824,"topicId":90823,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/10/04 10:25:29 AM, garrisonstuber@bellsouth.net writes: ","messageBody":"<div id=\"ygrps-yiv-1803400721\">In a message dated 2/10/04 10:25:29 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:garrisonstuber@...\">garrisonstuber@...</a> writes:<br/>\n<br/>\n&lt;&lt; should an unschooling<br/>\n<br/>\nhome that doesn&#39;t have a tv to begin with invest in one (when/if) the<br/>\n<br/>\nchildren desire it? &gt;&gt;<br/>\n<br/>\nI don&#39;t really know how to answer this question.<br/>\n<br/>\nMy mind races through all the parallel kinds of questions.<br/>\n<br/>\n&quot;Should an unschooling home without books begin to invest in books when/if <br/>\nthe children desire them?&quot;<br/>\n<br/>\n&quot;Should an unschooling home without a magazine, consider investing in one if <br/>\nthe children want one?&quot;<br/>\n<br/>\n&quot;Should an unschooling home without toys begin to invest in toys when/if the <br/>\nchildren desire them?&quot;<br/>\n<br/>\n&quot;Should an unschooling home without games begin to invest in games when/if <br/>\nthe children desire them?&quot;<br/>\n<br/>\nBut if I replaced it with &quot;heroin&quot; it would be kinda goofy, and so the <br/>\nproblem is those people who for whatever reason have come to consider television <br/>\nmore like heroin than like books, games, toys and magazines.<br/>\n<br/>\nThere has always and might always be a prejudice about the edge of the <br/>\navailable media/technology.<br/>\n<br/>\nWhen I was a kid, the evil edge of publishing was comic books.   Illustrated <br/>\nchildren&#39;s books were virtuous.  Comic books were brain-rotting crap the <br/>\nteachers could and would confiscate and throw in the trash.   It didn&#39;t matter that <br/>\nthe illustrated book might be racist, sexist, worthless nonsense.  If it had <br/>\nbeen published by a reputable publisher, it MUST be good.   And it didn&#39;t <br/>\nmatter that the comic book might be about the lives of saints, or Classics <br/>\nIllustrated Treasure Island, or Little Women, it was on newsprint and people spoke in <br/>\nspeech-bubbles, and so it was going to ruin civilization.<br/>\n<br/>\nWhen my mom was a kid, it was paperback novels.  If they were hardbound, they <br/>\nwere good.  If thehe Bible if you want to read something.  Read poetry, <br/>\nphilosophy,  history, or biographies.  Not made-up stories.  (Shakespeare didn&#39;t <br/>\ncount as evil made-up stories, for some reason.)<br/>\n<br/>\nBut electronics came along.  So when I was a kid the evils branched off two <br/>\nways.  Comic books were very, very bad.   But so was most comedy on television. <br/>\n Variety shows were good. That was people developing the talents God had <br/>\ngiven them.  Western dramas and situation comedies were not as good.    <br/>\n<br/>\nMusic started being way more available because of transistor radios.   The <br/>\nfirst radio I was given, my mom gave back to my aunt and they returned it and <br/>\nbought a slip&#39;n&#39;slide.   Reason?  There wasn&#39;t a radio station we could pick up <br/>\nin our small town with a radio that small.     Within six months there was <br/>\none, but my chance at a battery-operated portable radio was gone.   That&#39;s okay, <br/>\nthough, because if it wasn&#39;t worth sitting down next to a stationary radio to <br/>\nlisten to, it was junk anyway.  <br/>\n<br/>\nSo looking at such prejudices in historical perspective, being an unschooler <br/>\nis living on the edge anyway.  Don&#39;t try to live on the edge while carrying <br/>\naround an outdated, unreasonable prejudice.<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":90784,"nextTopicId":90876}}