{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1123183,"authorName":"dacunefare@aol.com","from":"dacunefare@...","profile":"undermom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"UNSCHOOLING.COM ONLINE NEWS Mid February 2003","postDate":"1045834837","msgId":59415,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFlYi4yN2MwNTk5LjJiODc4NjU1QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":59414,"nextInTime":59416,"topicId":59415,"numMessagesInTopic":0,"msgSnippet":"... UNSCHOOLING.COM ONLINE NEWS Mid-February 2003 ... In this Issue: The Myth of Learning Growing up Unschooled What Parents Learn Web Snacks What if","messageBody":"<div id=\"ygrps-yiv-1136949737\">::::::::::::::::::::::::::::::::::::::::::::::::::<br/>\n<br/>\n<br/>\nUNSCHOOLING.COM ONLINE NEWS<br/>\n<br/>\nMid-February 2003<br/>\n<br/>\n<br/>\n::::::::::::::::::::::::::::::::::::::::::::::::::<br/>\n<br/>\n<br/>\nIn this Issue:<br/>\n<br/>\nThe Myth of &quot;Learning&quot;<br/>\nGrowing up Unschooled<br/>\nWhat Parents Learn<br/>\nWeb Snacks<br/>\nWhat if Everybody Unschooled?<br/>\nCreativity<br/>\nKeeping a Log<br/>\n<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nThe Myth of &quot;Learning&quot;<br/>\n<br/>\nThe trouble with talk about &quot;learning experiences&quot; is that it implies<br/>\nthat all experiences can be divided into two kinds, those from<br/>\nwhich we learn something, and those from which we learn nothing.<br/>\nBut there are no experiences from which we learn nothing. We<br/>\nlearn something from everything we do, and everything that<br/>\nhappens to us or is done to us. What we learn may make us more<br/>\ninformed or more ignorant, wiser or stupider, stronger or weaker,<br/>\nbut we always learn something. What it is depends on the<br/>\nexperience, and above all, on how we feel about it. A central point<br/>\nof this book is that we are very unlikely to learn anything good<br/>\nfrom experiences which do seem to us closely connected with<br/>\nwhat is interesting and important in the rest of our lives. Curiosity<br/>\nis never idle; it grows out of real concerns and real needs.<br/>\n<br/>\nJohn Holt<br/>\nfrom Instead of Education<br/>\nE. P. Dutton 1976<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nGrowing up Unschooled<br/>\n<br/>\nWhen I was younger I never had to worry about assignments with<br/>\ntime restrictions, grades or tests, because I never had them. No, I<br/>\nwasn&#39;t a school drop out. I was homeschooled. I&#39;ve never been to<br/>\nany school prior to college. People tend to act funny when I tell<br/>\nthem that. They ask “You&#39;ve never been to school?” to which I reply<br/>\n“no.” Or they ask “Well how do you make friends?” and I say “I&#39;m in<br/>\ndance, I used to be in girl scouts and if all else fails you knock on<br/>\nthe doors of your neighbors and start up a conversation.” But my<br/>\nfavorite question of all time was asked to me by a store clerk “How<br/>\ndo you learn to communicate with people outside of your family?” I<br/>\nstared at her blankly and said “I&#39;m talking to you aren&#39;t I?”. <br/>\n<br/>\nThe next thing they want to know is how many hours a day I spend<br/>\ndoing “school.” This has no easy answer. If by school they mean<br/>\nsitting down with a text book, or doing math problems, then the<br/>\nanswer is usually only one or two days out of a month (unless I&#39;ve<br/>\nbeen on an I need to go to school kick). But if by “school” they<br/>\nmean learning, then its anytime I&#39;m awake. The methods my Mom<br/>\nhas used to teach me aren&#39;t what you would call traditional. For the<br/>\nmost part she goes with the flow, letting me absorb all the rich<br/>\nknowledge around me, rather than pounding it into my head. Letting<br/>\nme ask questions and then helping me figure out answers, rather<br/>\nthan quizzing me about things I already know. For me, learning<br/>\nsomething new is an everyday experience, so my memories of<br/>\nlearning are tied in with my memories of my family and friends.... I<br/>\ndon&#39;t really remember learning how to read, or write, or do math in<br/>\nmy head. I just do it. It&#39;s like walking, I know I had to learn how to do<br/>\nit at some point, but I don&#39;t really remember learning how...<br/>\n<br/>\n...We moved to Illinois when I was six.  I made friends with the girl<br/>\nacross the street. She thought it was so cool that I was already<br/>\nhome when she got home from school. We stuck together like glue<br/>\non paper. Not everyone thought it was such a cool thing to be<br/>\nhomeschooled though. I remember my first dance class after we<br/>\nmoved to Illinois. I was six, and my shoes weren&#39;t the right color.<br/>\nWhen I lived in California my dance teacher had us wear black ballet<br/>\nshoes. They didn&#39;t show dirt like the pink ones did. But here in Illinois<br/>\nEVERYONE had pink ballet shoes and even the teacher was surprised<br/>\nthat I didn&#39;t have the right shoes. I remember sitting around in a<br/>\ncircle and taking turns telling everyone our names and where we<br/>\nwent to school. I remember how everyone looked at me funny when I<br/>\nsaid I was homeschooled. I was different from them, in two ways,<br/>\nthe color of my shoes, and my school and they didn&#39;t seem to like<br/>\nthat. <br/>\n<br/>\nFor the first time in my life I wanted to go to school. I wanted to<br/>\nbe like everyone else. I wanted to be surrounded by friends. I<br/>\nwanted to be popular. I didn&#39;t want to be different. “Is that what<br/>\nschool is supposed to be about Melissa?” my Mother had asked me.<br/>\n“No, it&#39;s not” I had said “But please I want to go to school.” I made<br/>\nup a schedule for homeschooling. I decided I was going to learn like<br/>\neveryone else. I would read about history for an hour and then<br/>\nwrite down everything I had read, then do math for an hour, then<br/>\neat lunch, then I had a half hour to read anything I wanted, then I<br/>\nwould write a story. This quickly got dull and pointless. I was doing<br/>\nmath problems not because I wanted to, but because I thought I had<br/>\nto. I was reading history I wasn&#39;t interested in, or already knew. I<br/>\nwas writing the most pointless things just for the sake of writing.<br/>\nWorst of all, I was putting a time limit on my reading. I looked at my<br/>\nfriend&#39;s math book, the one she was having problems in. It wasn&#39;t<br/>\nthat hard, it took me five minutes to solve all 50 problems.  I<br/>\ndecided I was just as smart as everyone else my age, and if I had<br/>\ngotten this smart without trying before, there wasn&#39;t any reason I<br/>\nshould change what I was doing. I told my mom I didn&#39;t want to go to<br/>\nschool after all...<br/>\n<br/>\n...I watched my friends go to high school and become zombies,<br/>\nworking on papers far into the night, studying until their eyes<br/>\nburned only to get a C on their next test. I saw one of my best<br/>\nfriends stop reading because it had become a chore associated with<br/>\nschool. Referring to a novel I had recommended she once told me “I<br/>\ndon&#39;t have to read this, so I won&#39;t read this.”  While all my friends<br/>\nwere sweating over Biology finals I was taking trips to the zoo and<br/>\nspending hours drawing the vast array of life there. While they were<br/>\ncramming for a history exam, I was taking trips to the Field Museum<br/>\nof natural history. While they were struggling to finish a book<br/>\nreport, I was talking to my parents about the latest book I had<br/>\nread...<br/>\n<br/>\nMelissa Gocek<br/>\n<br/>\nFrom the draft essay &quot;I&#39;m Just Like Everyone Else&quot; <br/>\n<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nWhat Parents Learn<br/>\n<br/>\nWe&#39;ve learned to trust our children and ourselves. Trust is not easy<br/>\nto come by, and it&#39;s made even harder by schooling which teaches<br/>\nus not to trust ourselves, or our own instincts and feelings, but to<br/>\nrely on expertise and authority instead. Schooling utilizes a top<br/>\ndown chain of command, a heirarchical student-teacher relationship,<br/>\nbut homeschooling doesn&#39;t need to replicate this hurtful pattern. <br/>\nHomeschooling encourages the development of a loving relationship<br/>\nbased on caring and trust between parent and child, and this is the<br/>\nbest possible environment for real learning to take place. Real<br/>\nlearning, like how to talk to other people about minor and major<br/>\nthings, how to determine what needs doing and the best way in which<br/>\nto get it done, how to find one&#39;s rightful place in a confusing and<br/>\ncomplex world, how to truly live a life filled with goodness and worth-<br/>\niness and love.<br/>\n<br/>\nWhile this learning is happening to our children, similar learning is<br/>\nhappening to us as parents. We begin to question long-held assump-<br/>\ntions about children and learning and our own place in the puzzle. We<br/>\nbegin to see that what we were told about certain things like educa-<br/>\ntion and earning a living and what&#39;s worth doing with our lives is not<br/>\nnecessarily true, and we find ourselves searching for answers to<br/>\nquestions we thought we already knew the answers to.<br/>\n<br/>\nAs parents for over twenty years now, we&#39;ve learned that we don&#39;t<br/>\nhave all the answers. Sometimes our children have better answers<br/>\nthan we do, especially as they&#39;ve grown older. We&#39;ve taught them to<br/>\nthink carefully, and to consider several angles and approaches to a<br/>\nsituation when necessary, but we&#39;re not as good at it as they are<br/>\nnow. We&#39;ve learned that being open to new ideas, new ways of<br/>\nlooking at things, is a valuable approach to life, but old habits and<br/>\nold ways of doing things can be difficult to let go. Our children are<br/>\nhelping us learn to let go and embrace new ways of seeing, hearing,<br/>\nand feeling.<br/>\n<br/>\nWe&#39;ve often quoted an old saying, whose author we&#39;ve long forgot-<br/>\nten, that goes something like this: &quot;We can teach our children to<br/>\nhave courage, faith and endurance; they can teach us to laugh, to<br/>\nsing, and to love.&quot; In the final analysis, these lessons are probably<br/>\nthe most important ones.<br/>\n<br/>\n<br/>\nHelen and Mark Hegener<br/>\nfrom The Homeschooling Book of Answers by Linda Dobson<br/>\nPrima 1998<br/>\n<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nWeb Snacks<br/>\n<br/>\nHow to make Lava Lamps!<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://oozinggoo.com/howto.html\">http://oozinggoo.com/howto.html</a><br/>\nDemonstration lava without heat<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.exploratorium.edu/science_explorer/volcano.html\">http://www.exploratorium.edu/science_explorer/volcano.html</a><br/>\n<br/>\nHelpful guide to thinking about writing, for teens on up<br/>\nThe Nuts and Bolts of College Writing<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://nutsandbolts.washcoll.edu/\">http://nutsandbolts.washcoll.edu/</a><br/>\n<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nWhat if Everybody Unschooled?<br/>\n<br/>\nIt all boils down to a truth quickly learned by most families who decide<br/>\nto try &quot;just partly unschooling.&quot; They may manage for a while to keep<br/>\nthe unschooling approach limited to only a few subject areas, but un-<br/>\nschooling ideas are insidious; they sneak and slither their way into<br/>\nevery part of your life. The learning theory that you meant to apply<br/>\njust to the kids is indeed highly contagious. You begin to realize that<br/>\nyou&#39;re envying your children the enthusiasm and eagerness with which<br/>\nthey explore their world, and you realize that unschooling ideas are<br/>\njust as applicable to your own life. And then, of course, you&#39;re hooked<br/>\nfor good. Once you&#39;ve unschooled your children and yourselves, you<br/>\nbegin to wonder how to apply unschooling ideas to other areas of your<br/>\nlives, to your work and your community.<br/>\n<br/>\nWe look to our communities and wonder why the ideas that seem so <br/>\nobvious to us are so strange to the rest of the population. Why does<br/>\nour society increasingly try to keep our children separate from the<br/>\nrest of society, from what will become the locus of their everyday<br/>\nlives once they reach adulthood? In our zeal to rescue children from<br/>\nexploitation, from child labor and unsafe living conditions, why have<br/>\nwe moved so far to the other extreme --- to keeping the workings of<br/>\nadult life completely out of the view of most children, even of older<br/>\nadolescents?<br/>\n<br/>\nThat so many children become lost when they reach the legal age of<br/>\nmaturity shouldn&#39;t be surprising. With all their years in school, with<br/>\nclasses and assignments scheduled throughout for them, when and<br/>\nwhere do most children get a chance to feel useful, to create a meaningful <br/>\nplace for themselves? They&#39;re considered too young, too<br/>\nimmature, too unreliable, too untrustworthy to be allowed to do much<br/>\nof any real value; it&#39;s no wonder so many turn to their peers for<br/>\naffirmation and respect. We &quot;protect&quot; them from doing anything<br/>\nmuch in the way of real, meaningful work, deny them the opportunity<br/>\nto find places where they are truly needed, and then turn around and<br/>\nblame them for never doing anything worthwhile. If school is to pre-<br/>\npare our kids for that archetypal real world, why are other schools<br/>\nthe only places in that real world that are even remotely like school?<br/>\nWhy don&#39;t we make more room for our children in every aspect of our<br/>\nsociety, welcome them into our everyday lives and work?<br/>\n<br/>\nIn many ways, unschooling can be reduced to that hoary old chestnut<br/>\nfrom the sixties --- the one you still see occasionally on bumper<br/>\nstickers today: &quot;Question Authority!&quot; Ask why we always do things<br/>\nthe way we&#39;ve always done them, but ask with an open mind. Figure<br/>\nout what works and what doesn&#39;t, and use what works.<br/>\n<br/>\nMost of us who occasionally ponder that second-most-asked question --- what <br/>\nif everybody unschooled? --- don&#39;t have any real answers.<br/>\nWhat would such a society be like? What if we did not classify and<br/>\ncategorize children according to their age and the facility with which<br/>\nthey acquire skills? What if we worked from their strengths instead of <br/>\nconcentrating on their weaknesses? What if every person dis-<br/>\ncovered and pursued at least one passion, one positive interest that<br/>\nconsumed them to the point where they became expert at it (or at<br/>\nleast found joy in the search)? What would being a part of such a<br/>\ncommunity be like?<br/>\n<br/>\nIt&#39;s certainly an intriguing idea. I intend to find out.<br/>\n<br/>\nMary Griffith<br/>\nfrom The Unschooling Handbook: How to Use the Whole World as Your<br/>\nChild&#39;s Classroom<br/>\nPrima 1998<br/>\n<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nTake your child&#39;s wacky ideas seriously. When your child tells you that<br/>\nhe believes he has psychic powers or that the moon is made of green<br/>\ncheese, don&#39;t tell him he&#39;s wrong or is being ridiculous; don&#39;t laugh at him <br/>\nor criticize him. Instead, ask him questions and discuss the idea<br/>\nwith him. Give him the chance to take the idea in another direction or<br/>\nto discover himself that it&#39;s wrong... Ideas are delicate things, and<br/>\nthey need room to grow. As easy as it is shut down the creative impulse in <br/>\nadults, it&#39;s even easier in children.<br/>\n<br/>\nRoger Schank<br/>\nfrom Coloring Outside the Lines: Raising a Smarter Kid by Breaking All<br/>\nthe Rules<br/>\nHarper-Collins 2000<br/>\n<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nKeeping a Log<br/>\n<br/>\nOne thing that has been beneficial to me as a homeschooling mom <br/>\nwho is transitioning to unschooling (since we didn&#39;t start out that <br/>\nway) is to keep a little log of what my kids do during the day. I <br/>\nhave a special calendar just for this purpose and I just jot down <br/>\n&quot;Casablanca&quot; or X-Box Halo or Discovery Channel Temple of<br/>\nArtemis. I was one of those who was worried that &quot;all my kids <br/>\nwould do all day is watch TV and play X-box left to themselves.&quot; <br/>\nWhat&#39;s been so wonderful about my little, informal log is that it is <br/>\nphysical proof *to myself* that my kids are doing far more than <br/>\nTV and X box. It also is a way for me to track the <br/>\ninterconnectedness of their learning which is uncluding TV and <br/>\nX-box. :)<br/>\n<br/>\nFor example, my kids love to watch Jackie Chan cartoon on <br/>\nSaturday mornings. Last week we were reading In the Year of <br/>\nthe Boar and Jackie Robinson aloud. Both of these have tie ins <br/>\nto China which led us to reading more about China. We went on <br/>\na binge of figuring out our Chinese birth year names. (Mine is the <br/>\nYear of the White Cow...) Then we went from that to the <br/>\nconstellations and various ways that other cultures count years <br/>\nand keep calendars (solar, lunar or solar/lunar).<br/>\n<br/>\nThen the kids got interested in the Silk Road which ends or <br/>\nbegins in China (they liked the book we found at the library <br/>\nbecause it&#39;s introduced by Yo Yo Ma, someone they respect and <br/>\nlove from having heard of him originally on Arthur, the PBS <br/>\ncartoon... do you see where this is going yet?). Anyway, we were <br/>\nreading along about China and the Silk Route and the kids <br/>\nwanted to read about cultural celebrations in China.<br/>\n<br/>\nSo we took out another book on celebrations and in it, it circled <br/>\nback to the Chinese zodiac. It wasn&#39;t until this book that I realized <br/>\nthat the Chinese zodiac is actually a 12 year cycle, not 12 <br/>\nmonths. My 8 yo boy suddenly blurts out: I know the characters of <br/>\nthe Chinese zodiac and all their powers! I was shocked. &quot;How do <br/>\nyou know that Liam?&quot; They&#39;re on Jackie Chan! Then he <br/>\nproceeded to look at the pictures and tell me all the names and <br/>\neach of their personalities. Full circle.<br/>\n<br/>\nThis interweaving of pop culture, TV, and cartoons with history, <br/>\nreligion, holidays, geography... well it literally floored me. And I&#39;m <br/>\npretty sure that if I hadn&#39;t been keeping that log, I would have <br/>\nforgotten some of the connections. For me, the log gives me a <br/>\nsense of ownership and also reassurance during the transition. <br/>\nI also think it will be easier for me at the end of the year to pull <br/>\ntogether the stuff we&#39;ve done into come kind of coherent picture <br/>\nfor the year end assessment (Ohio requires this or testing).<br/>\n<br/>\nAnyway, just wanted to share another part of my process, <br/>\nespecially since so manyare trying to make the transition from <br/>\none way of learning to this newer, more insecure world of <br/>\nunschooling. :)<br/>\n<br/>\nFrom the Unschooling-dotcom email discussion list.<br/>\nTo read more, join the list by sending a blank email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-subscribe@yahoogroups.com\">Unschooling-dotcom-subscribe@yahoogroups.com</a><br/>\nOr subscribe by visiting the yahoogroups site at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/Unschooling-dotcom\">http://groups.yahoo.com/group/Unschooling-dotcom</a><br/>\n<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\n<br/>\nUNSCHOOLING.COM ONLINE NEWS UNCLASSIFIED ADVERTISING<br/>\n<br/>\n<br/>\nFor information on purchasing advertising space in this newsletter,<br/>\nplease contact the editor at:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:newsletter@...\">newsletter@...</a><br/>\n<br/>\n________________________<br/>\n<br/>\n<br/>\nTHE RESOURCEFUL HOMESCHOOLER<br/>\n<br/>\nresourcefulhomeschooler.com<br/>\n<br/>\n<br/>\n      Looking for something to do? Why not:<br/>\n** Stage a Costume Ball from the Middle Ages **<br/>\n        **Fly Through HumanAnatomy **<br/>\n**Take a Virtual Walk through the Rainforest ** <br/>\n**Program a Robot ** Build a Computer Game **<br/>\n <br/>\n<br/>\nThe Resourceful Homeschooler carries great books, science<br/>\nmaterials and kits, learning games, and the most interesting<br/>\nsoftware. Visit <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.resourcefulhomeschooler.com\">http://www.resourcefulhomeschooler.com</a><br/>\nMaterials to involve, inspire and support independent learners<br/>\nof all ages!<br/>\n<br/>\n________________________<br/>\n<br/>\nHOME EDUCATION MAGAZINE<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com\">http://www.home-ed-magazine.com</a><br/>\n<br/>\n<br/>\nThe Jan/Feb 2003 issue of Home Education Magazine has articles on<br/>\n<br/>\nsurviving tough times, non-school recess, homeschool empowerment,<br/>\n<br/>\nmath renovation and more.  From the columnists: the Kaseman&#39;s<br/>\nkeep your privacy; Becky Rupp tells folktales; David Albert learns to<br/>\nlove math; Sandra Dodd respects children; Elizabeth McCullough<br/>\nreviews &quot;Fundamentals of Homeschooling&quot;; and Carol Narigon gets<br/>\n<br/>\ndad off your back. Other columnists include Ann Zeise, Peter<br/>\nKowalke, Linda Dobson, and Laura Weldon. HEM also offers a special<br/>\nessay by publisher Helen Hegener, classified ads, letters and<br/>\ndiscussion, pen pals and networking, and more.<br/>\n<br/>\n(<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com/HEM/201/issuecontent.html)\">http://www.home-ed-magazine.com/HEM/201/issuecontent.html)</a><br/>\n<br/>\n<br/>\nCheck out the HEM web site for a free sample issue and the best<br/>\nsubscription deals:  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com\">http://www.home-ed-magazine.com</a><br/>\n<br/>\n<br/>\nOr write Home Education Magazine, PO Box 1083, Tonasket WA 98855<br/>\n<br/>\norders: toll-free 1-800-236-3278;<br/>\nemail <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:orders@...\">orders@...</a><br/>\n<br/>\nMC/Visa/Disc cards accepted.<br/>\n<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nThe Last Word<br/>\n<br/>\nPlay with your child&#39;s ideas. It&#39;s astonishing to me that parents who<br/>\nare perfectly willing to play catch with their child are unwilling to toss<br/>\nideas back and forth.<br/>\n<br/>\nRoger Schank<br/>\n<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\n<br/>\nThanks for reading the Unschooling.com newsletter! Feel free to<br/>\nforward this newsletter to all your friends, your local support group,<br/>\nand your mother-in-law!<br/>\n<br/>\n<br/>\nTo subscribe, visit our web site at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\nor send an email to <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:majordomo@...\">majordomo@...</a> with<br/>\nthe words subscribe unschooling-newsletter followed by <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:yourname@...\">yourname@...</a> in the body of the email.<br/>\n(e.g. subscribe unschooling-newsletter youremailaddress).<br/>\n<br/>\n<br/>\nTo unsubscribe, send an email to <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:majordomo@...\">majordomo@...</a> with<br/>\nthe words unsubscribe unschooling-newsletter followed by <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:yourname@...\">yourname@...</a> in the body of the email.<br/>\n<br/>\n(e.g. unsubscribe unschooling-newsletter youremailaddress).<br/>\n<br/>\n<br/>\nTo change the address at which you receive the newsletter, unsubscribe your <br/>\nold address and then subscribe with your new one.<br/>\n<br/>\n<br/>\nSee you in March!<br/>\n<br/>\n<br/>\nDeborah A Cunefare, Newsletter Editor<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:newsletter@...\">newsletter@...</a><br/>\n<br/>\n<br/>\nUnschooling.com is a service of Home Education Magazine</div>","specialLinks":[]}],"prevTopicId":59410,"nextTopicId":59417}}