{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Sonia Ulan","from":"Sonia Ulan &lt;sulan@...&gt;","replyTo":"LIST","senderId":"nFNpAWZK0SiShGeCmn_qm6ZY1mlqsZ5RtsuSfGMLUhtvlbMadcyc0D6JQNJYl_UR3JcFbsiny4TPE9VqtPmQCTON","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Questioning doctors (was Breastfeeding) LONG","postDate":"955275577","msgId":7933,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM4RjA1OTM5LkI2MTE1NTNFQGhvbWUuY29tPg==","referencesHeader":"PGIxLjJlYjA5ZTQuMjYyMTcyNDJAYW9sLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":7932,"nextInTime":7934,"topicId":7933,"numMessagesInTopic":0,"msgSnippet":"Hi Jodye; Ohhhhh, I do love pregnancy, labour, birthing and baby stories.  No, you did not go on, I was totally absorbed with your story/situation. ","messageBody":"<div id=\"ygrps-yiv-1314079178\">Hi Jodye;<br/>\n<br/>\nOhhhhh, I do love pregnancy, labour, birthing and baby stories.  No, you<br/>\ndid not go on, I was totally absorbed with your story/situation. <br/>\nCongratulations to you for being such a fully-participatory Mom, that<br/>\nyou researched shoulder dystocia.  I had never heard of it.  Now I know,<br/>\nso thanks for the service you&#39;ve provided.  It is amazing how vulnerable<br/>\nwe are in the hospital/doctor scenario.  We are, after all, on their<br/>\nturf.  Have you tried chiropractic care at all?  I can&#39;t say I&#39;m a huge<br/>\nfan (yet) of chiropractors, but I do know a female chiropractor who does<br/>\ndo adjustments on infants.  Apparently, it&#39;s a little known fact a lot<br/>\nof infants are born out of alignment and it does affect feeding on one<br/>\nside.  I trust this woman&#39;s knowledge as she has done research and<br/>\nspecializes in women and infant care...I&#39;ve even figured what the heck,<br/>\nI&#39;ll give this stuff a try, and so far so good.  (I&#39;m not sure if this<br/>\nis helpful for you as you&#39;ve said it&#39;s a nerve-thing, but who knows.  It<br/>\nmight be worth considering.)<br/>\n<br/>\nBy the way, at the risk of flogging a dead horse, (I really hate that<br/>\nterm, but am too unimaginative to come up with something better!) I&#39;d<br/>\nreally like to take this opportunity to clarify my stance regarding the<br/>\nbreastfeeding issue.  I feel like I&#39;ve been raked over the burning hot<br/>\ncoals needlessly as I&#39;ve been grossly misunderstood...Granted, I do feel<br/>\nvery strongly about the issue, (like that wasn&#39;t obvious!) and I do<br/>\nbelieve in people informing themselves and getting the facts concerning<br/>\nALL parenting issues, (I think we owe our kids that committment to<br/>\nknowledge, from birth), however, I am also an intelligent realist who<br/>\nfully recognizes the extenuating circumstances that may exist our lives.<br/>\nAs a matter of fact, I had HORRIBLE challenges and problems with<br/>\nbreastfeeding my first-born.  He was &quot;this close&quot; to being bottle-fed<br/>\nhimself.  I was lacking in information though and thankfully found a<br/>\nphenomenal nurse who was able to get me on a different track and it made<br/>\nall the difference.  During pregnancy, I was prepared to breastfeed but<br/>\ngot so easily off-track thanks to hospital policy and &quot;well-meaning&quot;<br/>\nin-laws etc...So I just wanted to encourage those who do not have<br/>\nphysical handicaps, serious illnesses, abusive husbands, etc. that<br/>\nso-called &quot;inconveniences&quot;, challenges and other stresses can be<br/>\novercome most of the time, if we just dig deep enough to get the<br/>\navailable help.  <br/>\n<br/>\nSo I apologize at this time, to those I offended unwittingly, who<br/>\nsuffered those exceptional and rare circumstances and were unable to<br/>\nbreastfeed.  Of course there is need for bottle-feeding in the minority<br/>\nof situations.  Just like a medication, formula is a pharmaceutical. <br/>\nAnd I&#39;m happy it has been available for those who truly need it.  It was<br/>\nnot my desire to &quot;Judge&quot; bottle-feeding parents (which I don&#39;t), I did<br/>\nnot insult those who bottlefeed, nor would I ever confront anyone who<br/>\nhas made that decision.  I have had many friends/acquaintances over the<br/>\nyears who have bottlefed and I have had complete respect for them as<br/>\nparents and have never embarrassed myself or them in that way.<br/>\n<br/>\nSo I am hoping I am forgiven, as I&#39;m in a continual quest for knowledge<br/>\nlike we all are,<br/>\n<br/>\nSonia<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:JodyeB1@...\">JodyeB1@...</a> wrote:<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; I definitely learned the hard way on this one.  I can&#39;t blame the doctor<br/>\n&gt; entirely for my decision not to breastfeed.  Afterall, I like to think I&#39;m a<br/>\n&gt; fairly intelligent person - I could have looked for answers elsewhere.  Maybe<br/>\n&gt; I didn&#39;t care enough about breastfeeding at the time to make the effort - I<br/>\n&gt; really can&#39;t remember the circumstances exactly.  I do know that I was most<br/>\n&gt; certainly too trusting of doctors.  That was ten years ago, and I&#39;m sorry to<br/>\n&gt; say that I remained too trusting until 14 months ago when my youngest child<br/>\n&gt; was born.<br/>\n&gt; <br/>\n&gt;   My first daughter was delivered by c-section 12 years ago.  I wanted to<br/>\n&gt; have the next one vaginally, so I chose a doctor who would be open to that<br/>\n&gt; when I became pregnant with my second child.  The delivery went okay - major<br/>\n&gt; tearing, but my son was a healthy 8 1/2 pounder.  The next baby was also born<br/>\n&gt; vaginally.  That delivery didn&#39;t go so well - my daughter was stuck (shoulder<br/>\n&gt; dystocia) although I didn&#39;t know it at the time.  Actually, I didn&#39;t know it<br/>\n&gt; until almost five years later when my youngest was born.  Luckily, the doctor<br/>\n&gt; was able to turn her and she was delivered healthy, weighing 8lbs 6oz.  Major<br/>\n&gt; tearing again.<br/>\n&gt; <br/>\n&gt; My fourth child was born exactly 14 months ago tomorrow.  My pregnancy with<br/>\n&gt; her was pretty uneventful - I did gain a lot of weight, but the all knowing<br/>\n&gt; doctor never said anything about it, so I assumed it was no problem.  Two<br/>\n&gt; days past my due date the doctor decided to induce labor.  He had induced the<br/>\n&gt; last two because he didn&#39;t want the babies to get over 8 1/2 pounds - he<br/>\n&gt; didn&#39;t think I could deliver one any bigger.  He&#39;d already told me that the<br/>\n&gt; baby I was carrying was in the 9 pound range, so things weren&#39;t adding up.<br/>\n&gt; But I TRUSTED him, afterall he&#39;s the doctor.  My labor with the fourth one<br/>\n&gt; seemed different from the start.  At one point I heard the nurse talking to<br/>\n&gt; the doctor on the phone.  She told him that she thought he neede to come<br/>\n&gt; right away.  But did he?  NO.  He came about 45 minutes or an hour later.<br/>\n&gt; The nurse had just discovered that &quot;this baby&#39;s head is way bigger than I<br/>\n&gt; thought&quot;.  But her head wasn&#39;t the worst part - it was her shoulders.<br/>\n&gt; Shoulder dystocia again...only this time I don&#39;t remember him trying the<br/>\n&gt; fancy turns or maneuveres.  She was STUCK!  So, the doctor put a nurse on<br/>\n&gt; each side of me, to pull my legs as far back as they possibly could.  I had<br/>\n&gt; two other nurses on top of me, pushing on my belly with all their might.  And<br/>\n&gt; the doctor had the vacuum extractor hooked to my baby&#39;s head and was pulling<br/>\n&gt; so hard that later my husband told me &quot; I thought he was going to pull her<br/>\n&gt; damn head off&quot;!  He said it was the scariest thing he&#39;s ever seen.  Well, we<br/>\n&gt; got the baby out.  She weighed 9 1/2 pounds.  She was a funny blue color, and<br/>\n&gt; she didn&#39;t breathe for what seemed like forever.  I&#39;ll never forget the sound<br/>\n&gt; of her first cry, or the tears of relief in my sweet husband&#39;s eyes, or her<br/>\n&gt; wonderful new baby smell.  But somehow I failed to notice that her left arm<br/>\n&gt; was hanging limp.  I didn&#39;t even realize it until late that night.  No one<br/>\n&gt; told us she was hurt, and when we figured it out nobody would tell us what<br/>\n&gt; the problem was. We didn&#39;t fully understand what had happened until we got<br/>\n&gt; home and began our own research.  My daughter, Tess has a brachial plexus<br/>\n&gt; injury.  Maybe some of you know what that is, but I had never heard of it<br/>\n&gt; until she was born.  The brachial plexus is the bundle of nerves found in the<br/>\n&gt; shoulder area. The nerves are the ones that control muscle function in the<br/>\n&gt; arm.  The nerves that control Tess&#39;s bicep and deltoid muscles were torn.<br/>\n&gt; The tricep nerve was also injured, but not as seriously.  There is a<br/>\n&gt; wonderful clinic in Houston, Texas where they specialize in brachial plexus<br/>\n&gt; injuries.  We&#39;ve traveled there several times, and she  had surgery at Texas<br/>\n&gt; Children&#39;s Hospital last September to graft the torn nerves, using bits of<br/>\n&gt; nerve taken from her leg.  We were told by her pediatrician that there is<br/>\n&gt; nothing that can be done for nerve injuries.   We had to learn everything we<br/>\n&gt; know about it on our own.<br/>\n&gt; <br/>\n&gt; Tess also has mild hypotonia (low muscle tone)  probably due do a slight lack<br/>\n&gt; of oxygen, and hip dysplasia, which will hopefully be resolved soon.  My<br/>\n&gt; daughter was perfectly healthy up until the moment she was born.  She was<br/>\n&gt; PERFECT.  And now thanks to some know it all, egotistical, rushing to the<br/>\n&gt; golf course doctor she&#39;s injured for life.  Oh, they can fix her up (or, so<br/>\n&gt; they say)  but even with the best recovery, she&#39;ll never be the way she<br/>\n&gt; should have been.  And here&#39;s the really sad part...it all could have been<br/>\n&gt; prevented.  All the warning signs were there - previous shoulder dystocia,<br/>\n&gt; large weight gain, big baby etc...  See why I&#39;ll never again take a doctor&#39;s<br/>\n&gt; word on anything?  I&#39;ll question them every step of the way - it could be a<br/>\n&gt; matter of life and death.  What a way to learn a lesson.<br/>\n&gt; <br/>\n&gt; I know I&#39;ve gone on way too long here, and for that I&#39;m very sorry.  I&#39;m not<br/>\n&gt; even sure if I made the point I set out to make - I got kind of side tracked.<br/>\n&gt;  But it&#39;s late, and I&#39;m much too tired to change anything now.  Goodnight.<br/>\n&gt; <br/>\n&gt; Jodye<br/>\n&gt; <br/>\n&gt; ------------------------------------------------------------------------<br/>\n&gt; PERFORM CPR ON YOUR APR!<br/>\n&gt; Get a NextCard Visa, in 30 seconds!  Get rates as low as<br/>\n&gt; 0.0% Intro or 9.9% Fixed APR and no hidden fees.<br/>\n&gt; Apply NOW!<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://click.egroups.com/1/2121/7/_/448294/_/955258953/\">http://click.egroups.com/1/2121/7/_/448294/_/955258953/</a><br/>\n&gt; ------------------------------------------------------------------------<br/>\n&gt; <br/>\n&gt; Message boards, timely articles, a free newsletter and more!<br/>\n&gt; Check it all out at: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n&gt; <br/>\n&gt; To Unsubscribe: mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-unsubscribe@onelist.com\">Unschooling-dotcom-unsubscribe@onelist.com</a> </span></blockquote></div>","specialLinks":[]}],"prevTopicId":7869,"nextTopicId":7934}}