{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":11,"messages":[{"userId":324592498,"authorName":"Tori","from":"&quot;Tori&quot; &lt;tandosmama@...&gt;","profile":"tandosmama@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Woundedness (was Re: &quot;Research&quot; on Reading?","postDate":"1317256534","msgId":63220,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo2MGVnbStvdDN2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQzNjI4MTU4LUZEMkItNEVDOS1CRTAzLTM5MUNCOEZDQjNCMkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":63200,"nextInTopic":0,"prevInTime":63219,"nextInTime":63221,"topicId":63186,"numMessagesInTopic":0,"msgSnippet":"... I wrote it with my kids friends in mind who went to school, and who will describe themselves in casual conversation as learning disabled.  They re in","messageBody":"<div id=\"ygrps-yiv-147128855\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; &quot;there are kids with six years of reading instruction who 1)<br/>\n&gt; cannot read and 2) are ashamed and sneaky and horribly wounded because of it,<br/>\n&gt; learning to try to fake it or trying to survive with hostility and defensive<br/>\n&gt; actions, so schools label them in horrible, unfair ways, blaming the kids,<br/>\n&gt; blaming &quot;conditions,&quot; blaming parents, and many of those kids will NEVER, ever<br/>\n&gt; recover in their entire lives.&quot;<br/>\n&gt; <br/>\n </span></blockquote>I wrote it with my kids&#39; friends in mind who went to school, and who will describe themselves in casual conversation as &quot;learning disabled.&quot;  They&#39;re in their 20&#39;s.&quot;  <br/>\n<br/>\nThere are also adult university students, some of whom are &#39;honors&#39; students who cannot read in a way that results in comprehension. And there are others who are capable of reading, but unable to form an individual response based on their own experience and knowledge. Some can&#39;t think critically; others have learned to offer expected answers and want to earn approval.  In an honors college class (these were kids with the highest high school GPAs and SAT scores) I was informed by the majority in the class I was teaching that the students expected me to tell them &quot;what to think&quot; before expecting them to discuss assigned reading. No kidding.<br/>\n<br/>\nI&#39;m not suggesting that this is true of all students, or even most. But problems with reading, comprehension, ability to think critically and the confidence to speak with an independent voice are common.<br/>\n<br/>\nMy experience teaching, in addition to the very opposite experiences my DH and I had as students, set us in the direction of unschooling with our children before we&#39;d ever heard the term unschooling. We&#39;re so lucky to be able to connect here and learn from families who&#39;ve been there first.</div>","specialLinks":[]},{"userId":431583163,"authorName":"Stephanie","from":"&quot; Stephanie&quot; &lt;jay_steph93@...&gt;","profile":"mom_to_kbcj","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] &quot;Research&quot; on Reading?","postDate":"1317228377","msgId":63200,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg0RDQ0RTdDRjA3RjQxNTRBNzk1NzY5RjY4NUEyNTAxQGd4Mjgwc3NmM2ZjMGZlPg==","referencesHeader":"PGo1dWYycitvNnJmQGVHcm91cHMuY29tPg=="},"prevInTopic":63199,"nextInTopic":63220,"prevInTime":63199,"nextInTime":63201,"topicId":63186,"numMessagesInTopic":0,"msgSnippet":"Hi, Does anyone have any links to research to support the fact that children exposed to a text-rich environment will aquire reading when they are ready? I","messageBody":"<div id=\"ygrps-yiv-884852018\">Hi,<br/>\n<br/>\n  Does anyone have any links to &quot;research&quot; to support the fact that children exposed to a text-rich environment will aquire reading when they are ready? I have searched the archives, but can&#39;t seem to find what I am looking for. What I would like is some information that I can give to my husband that is of a more academic or research-oriented nature, and less anectodal, than what I have been able to provide him so far. He is concerned that our 6-year-old son is not yet reading.<br/>\n<br/>\n  Thanks,<br/>\n  Cheryl<br/>\n<br/>\n  *****I don&#39;t have research and I&#39;m not sure it even exists. I do have 4 unschooled kids who all learned how to read in their own way and time. If you would like that story I can share that.<br/>\n  Stephanie<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":439465581,"authorName":"Colleen","from":"&quot;Colleen&quot; &lt;3potatoes@...&gt;","profile":"trespotatoes","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: &quot;Research&quot; on Reading?","postDate":"1317222419","msgId":63199,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo1dmQ2aitvMWpmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGo1dmFrdCs4NWpvQGVHcm91cHMuY29tPg=="},"prevInTopic":63198,"nextInTopic":63200,"prevInTime":63198,"nextInTime":63200,"topicId":63186,"numMessagesInTopic":0,"msgSnippet":"===That presupposes the inability of the child to grow and mature into a well developed, morally grounded, forgiving individual with ambitions and desires to","messageBody":"<div id=\"ygrps-yiv-1978174360\">===That presupposes the inability of the child to grow and mature into a well developed, morally grounded, forgiving individual with ambitions and desires to do better than a label that was put on them in school or anywhere else for that matter.  Everyone will be &quot;wounded&quot; at some point.  It is up to each individual as to how they will allow that to effect them for the rest of their life.===  <br/>\n<br/>\nThe way I think of that, it doesn&#39;t have to do with being &quot;morally grounded&quot; and &quot;forgiving.&quot;<br/>\n<br/>\nMy husband grew up going to Catholic school, as the public schools in the inner city where he lived were (in his parents&#39; opinion) too dangerous.  The &quot;instruction&quot; he was given in reading was, from his accounts, quite detrimental instead of helpful.  The kids in his school were drilled, tested, and forced to follow a phonics program.  Phonics never made much sense to him (allowed to learn to read on his own, I&#39;m guessing he&#39;d read like my 8 year old does - from patterns and memorization and not using phonics) and he struggled with reading from the start.  He ended up receiving extra 1:1 &quot;remedial reading support instruction&quot; (his school&#39;s version of a label was to put you in the &quot;remedial&quot; category).  To this day he&#39;ll tell me &quot;I really hate reading&quot; and he says it often takes him 2 or 3 times reading through something before he really gets the meaning, which he also credits back to his schools&#39; emphasis on phonics instead of comprehension and understanding.  <br/>\n<br/>\nContrast this to my son&#39;s experiences with reading - where he is growing up surrounded by print, words, books, computers, games, etc.  He discovered words and reading on his own, based on his own desires and interests.  He&#39;s 8 now and reads fluently - however he also doesn&#39;t hesitate to ask for help when he finds a word he doesn&#39;t know.  And when he asks for help, my husband and I don&#39;t tell him &quot;sound it out&quot; - we tell him what the word is and he usually responds &quot;oh - cool!&quot; and then bounces on to finish whatever he&#39;s reading through.  There has been no shame, no drills, no tests, and no instruction involved in his relationship with words  and so his relationship is a good one!<br/>\n<br/>\nI am fairly certain that no amount of forgiveness or ambition could overcome my husband&#39;s experience with &quot;reading instruction&quot; and what that experience has done with his interest in and his ability to interact with printed words.  His ambition led him to a college degree in engineering and a career that he enjoys - but it did not lead him to a point where all those phonics drills, remedial classes, etc. no longer affect him.  If he forgave the teachers and the system for being what they were, would he become a better, happier reader?  Nope.  But our son benefits from his dad&#39;s school experiences, since &quot;I don&#39;t want my son to learn to read the way I did!&quot; gives yet more support to our decision to unschool  :-)<br/>\n<br/>\nColleen</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Woundedness (was Re: &quot;Research&quot; on Reading?","postDate":"1317221656","msgId":63198,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQzNjI4MTU4LUZEMkItNEVDOS1CRTAzLTM5MUNCOEZDQjNCMkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGo1dmFrdCs4NWpvQGVHcm91cHMuY29tPg==","referencesHeader":"PGo1dmFrdCs4NWpvQGVHcm91cHMuY29tPg=="},"prevInTopic":63197,"nextInTopic":63199,"prevInTime":63197,"nextInTime":63199,"topicId":63186,"numMessagesInTopic":0,"msgSnippet":"I wrote: Except for those who have taught 12 year olds in public school and so know firsthand that there are kids with six years of reading instruction who 1)","messageBody":"<div id=\"ygrps-yiv-1949358519\">I wrote: <br/>\n<br/>\n&quot;Except for those who have taught 12 year olds in public school and so know<br/>\nfirsthand that there are kids with six years of reading instruction who 1)<br/>\ncannot read and 2) are ashamed and sneaky and horribly wounded because of it,<br/>\nlearning to try to fake it or trying to survive with hostility and defensive<br/>\nactions, so schools label them in horrible, unfair ways, blaming the kids,<br/>\nblaming &quot;conditions,&quot; blaming parents, and many of those kids will NEVER, ever<br/>\nrecover in their entire lives.&quot;<br/>\n<br/>\nI wrote that because I taught seventh graders for four years.  The first year they gave me &quot;remedial reading.&quot;  I wasn&#39;t trained in that specialty, which was new in those days, and told the school I had no interest, but they gave me the 125 kids who scored lowest, and wanted me to teach them to read better (or at all, in the cases of half a dozen of them who couldn&#39;t sight-read or sound out).<br/>\n<br/>\nI wrote it with adults in mind, men older than I am (I&#39;m 58) who still cringe down when they tell stories about school.<br/>\n<br/>\nI wrote it with my kids&#39; friends in mind who went to school, and who will describe themselves in casual conversation as &quot;learning disabled.&quot;  They&#39;re in their 20&#39;s.  One who went to first grade at the age of five and so graduated from high school &quot;early&quot; still identifies himself as &quot;highly gifted,&quot; and expects special treatment.  He doesn&#39;t read much, or particularly well, but he identifies himself as genius in all ways.  It doesn&#39;t help him be happy.<br/>\n<br/>\nThe phrase &quot;there are kids&quot; was left out when I was quoted and told what I was presupposing.    There are children right now, today, in a school near you, who have been told they cannot read.  Not &quot;you don&#39;t read yet,&quot; but &quot;he is a non-reader.&quot;  Some of them are six.  Some are ten, and twelve.  Not maybe.   There are. Some of them (almost all boys) have failed a grade, been held back, probably in first grade.  They will &quot;be behind&quot; for the rest of their school career. They will be in school for another year when other kids their age are out going to college or getting jobs.  It will be because they weren&#39;t reading well enough to be promoted.  And what schools consider &quot;reading&quot; in the early years involves &quot;controlled readers&quot; of some sort, with words chosen to be short and phonetic.  It&#39;s not normal real-world reading.  <br/>\n<br/>\nThis part was quoted:<br/>\n**are ashamed and sneaky and horribly wounded because of it, learning to try to fake it or trying to survive with hostility and defensive actions, so schools label them in horrible, unfair ways, blaming the kids, blaming &quot;conditions,&quot; blaming parents, and many of those kids will NEVER, ever recover in their entire lives.**<br/>\n<br/>\nThis was asserted:<br/>\n-=-That presupposes the inability of the child to grow and mature into a well developed, morally grounded, forgiving individual with ambitions and desires to do better than a label that was put on them in school or anywhere else for that matter. Everyone will be &quot;wounded&quot; at some point. It is up to each individual as to how they will allow that to effect them for the rest of their life. -=-<br/>\n<br/>\n-=- the inability of the child -=-  Which child?  Every child?<br/>\nIs this &quot;the child&quot; in the sense of an ideal, perfect model child Plato-style?<br/>\nIs it &quot;the child&quot; in the Jungian archetype sense?<br/>\n<br/>\nBecause I was talking real children, in the hundreds, and thousands, and millions, who don&#39;t learn to read quickly, but are being tested, measured and compared, and wounded by it.  And some of them don&#39;t recover.  Some. I didn&#39;t say none.    Everyone will be &quot;wounded&quot; at some point, but educationally speaking, some wounds are fatal to future confidence.<br/>\n<br/>\nIf it were up to each individual to simply decide how they would allow things to affect them, the world would be a paradise.  People don&#39;t get to decide whether they will be traumatized or ashamed.  Some find help to get past that.  Some don&#39;t.  Some don&#39;t get past it with help.<br/>\n<br/>\nLots of people come through school relatively unscathed.  I did.<br/>\nThere is damage that can be done to children, though, and it can be done at home.  The idea that &quot;the child&quot; can recover from anything that comes along could cause a parent to be careless in her own decisions about how to treat a child.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: &quot;Research&quot; on Reading?","postDate":"1317221159","msgId":63197,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRENzcwQjM2LTg2RjAtNDk1Ri05RDNBLUJDN0FGRTBBRTIyNEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGo1dmFrdCs4NWpvQGVHcm91cHMuY29tPg==","referencesHeader":"PGo1dmFrdCs4NWpvQGVHcm91cHMuY29tPg=="},"prevInTopic":63195,"nextInTopic":63198,"prevInTime":63196,"nextInTime":63198,"topicId":63186,"numMessagesInTopic":0,"msgSnippet":"... She said many. How kids respond to what happens to them in school depends on their personality, the environment they re growing up in, the support they ","messageBody":"<div id=\"ygrps-yiv-833625895\">On Sep 28, 2011, at 10:23 AM, amie7amelia wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; That presupposes the inability of the child to grow ...<br/>\n<br/>\n </span></blockquote>She said many.<br/>\n<br/>\nHow kids respond to what happens to them in school depends on their  <br/>\npersonality, the environment they&#39;re growing up in, the support they  <br/>\nget, the personalities of the teachers, at what age and where their  <br/>\nheads are at when some message hits them and probably some other stuff  <br/>\ntoo.<br/>\n<br/>\nWhat many here are trying to help members with is understanding what  <br/>\ntears at relationships and people&#39;s sense of self and well being and  <br/>\nwhat builds it.<br/>\n<br/>\nHow those actions will affect a particular individual depends on the  <br/>\nabove. But what tears at humans is very unlikely to build (unless  <br/>\nthere are some other unlikely factors). What builds is very unlikely  <br/>\nto tear. And people can&#39;t make the choices that work (build rather  <br/>\nthan tear) for their particular family, their particular mix of  <br/>\npersonalities, if they aren&#39;t aware of what tears and what builds  <br/>\nhumans in general.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":212902730,"authorName":"amie7amelia","from":"&quot;amie7amelia&quot; &lt;amie7amelia@...&gt;","profile":"amie7amelia","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: &quot;Research&quot; on Reading?","postDate":"1317219805","msgId":63195,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo1dmFrdCs4NWpvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDMzQzg2NzY3LTMzRkYtNEVERS1CMDg2LTkwRTA4QTJCMkRCMkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":63193,"nextInTopic":63197,"prevInTime":63194,"nextInTime":63196,"topicId":63186,"numMessagesInTopic":0,"msgSnippet":"**are ashamed and sneaky and horribly wounded because of it, learning to try to fake it or trying to survive with hostility and defensive actions, so schools","messageBody":"<div id=\"ygrps-yiv-1687122112\">**are ashamed and sneaky and horribly wounded because of it, learning to try to fake it or trying to survive with hostility and defensive actions, so schools label them in horrible, unfair ways, blaming the kids, blaming &quot;conditions,&quot; blaming parents, and many of those kids will NEVER, ever recover in their entire lives.**<br/>\n<br/>\nThat presupposes the inability of the child to grow and mature into a well developed, morally grounded, forgiving individual with ambitions and desires to do better than a label that was put on them in school or anywhere else for that matter.  Everyone will be &quot;wounded&quot; at some point.  It is up to each individual as to how they will allow that to effect them for the rest of their life.  <br/>\n<br/>\n--Amie<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; -=-The &quot;over 12&quot; would make any mother freak if she didn&#39;t believe in the <br/>\n&gt; approach! -=-<br/>\n&gt; <br/>\n&gt; Except for those who have taught 12 year olds in public school and so know firsthand that there are kids with six years of reading instruction who 1) cannot read and 2) are ashamed and sneaky and horribly wounded because of it, learning to try to fake it or trying to survive with hostility and defensive actions, so schools label them in horrible, unfair ways, blaming the kids, blaming &quot;conditions,&quot; blaming parents, and many of those kids will NEVER, ever recover in their entire lives.<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":336246301,"authorName":"NCMama","from":"&quot;NCMama&quot; &lt;dharmamama1@...&gt;","profile":"carenkh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: &quot;Research&quot; on Reading?","postDate":"1317217630","msgId":63193,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo1djhndStrdDhyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGo1dWYycitvNnJmQGVHcm91cHMuY29tPg=="},"prevInTopic":63192,"nextInTopic":63195,"prevInTime":63192,"nextInTime":63194,"topicId":63186,"numMessagesInTopic":0,"msgSnippet":"I first became aware of the idea of reading in one s own time through reading the experiences of Sudbury Valley School, a school where kids are free to choose","messageBody":"<div id=\"ygrps-yiv-1459542138\">I first became aware of the idea of reading in one&#39;s own time through reading the experiences of Sudbury Valley School, a school where kids are free to choose what to do every day, and are also responsible for decisions for running the school. Their work is also anecdotal, but it encompasses hundreds of children over their 40+ years of existence. I trusted academic unschooling because of the things I read from them, before I was really connected with an unschooling community.<br/>\n<br/>\nA small essay about reading appears in &quot;Education in America&quot; written by Daniel Greenberg, one of the founders of the school, and can be found here: <a rel=\"nofollow\" target=\"_blank\" href=\"http://tinyurl.com/3mdguf4\">http://tinyurl.com/3mdguf4</a>  They have published many books, and have a few that deal with long-term success of their students.<br/>\n<br/>\nSudbury Valley isn&#39;t an &quot;unschooling school&quot; - I made the mistake of calling it that before I really understood unschooling - but your husband may be reassured by their experiences.<br/>\n<br/>\nTheir full site is here: <a rel=\"nofollow\" target=\"_blank\" href=\"http://sudval.org/\">http://sudval.org/</a>   and their books can be found here: <a rel=\"nofollow\" target=\"_blank\" href=\"http://sudburypress.com/\">http://sudburypress.com/</a><br/>\n<br/>\nCaren</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] &quot;Research&quot; on Reading?","postDate":"1317217131","msgId":63192,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMzQzg2NzY3LTMzRkYtNEVERS1CMDg2LTkwRTA4QTJCMkRCMkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PERFQjI0MjIyLTI4M0MtNEQ0NC05RTAzLTUzQTdFRTJFNDkxNUB2ZXJpem9uLm5ldD4=","referencesHeader":"PGo1dWYycitvNnJmQGVHcm91cHMuY29tPiA8REVCMjQyMjItMjgzQy00RDQ0LTlFMDMtNTNBN0VFMkU0OTE1QHZlcml6b24ubmV0Pg=="},"prevInTopic":63189,"nextInTopic":63193,"prevInTime":63191,"nextInTime":63193,"topicId":63186,"numMessagesInTopic":0,"msgSnippet":"-=-The over 12 would make any mother freak if she didn t believe in the approach! -=- Except for those who have taught 12 year olds in public school and so","messageBody":"<div id=\"ygrps-yiv-1595109454\">-=-The &quot;over 12&quot; would make any mother freak if she didn&#39;t believe in the <br/>\napproach! -=-<br/>\n<br/>\nExcept for those who have taught 12 year olds in public school and so know firsthand that there are kids with six years of reading instruction who 1) cannot read and 2) are ashamed and sneaky and horribly wounded because of it, learning to try to fake it or trying to survive with hostility and defensive actions, so schools label them in horrible, unfair ways, blaming the kids, blaming &quot;conditions,&quot; blaming parents, and many of those kids will NEVER, ever recover in their entire lives.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] &quot;Research&quot; on Reading?","postDate":"1317208834","msgId":63189,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PERFQjI0MjIyLTI4M0MtNEQ0NC05RTAzLTUzQTdFRTJFNDkxNUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGo1dWYycitvNnJmQGVHcm91cHMuY29tPg==","referencesHeader":"PGo1dWYycitvNnJmQGVHcm91cHMuY29tPg=="},"prevInTopic":63188,"nextInTopic":63192,"prevInTime":63188,"nextInTime":63190,"topicId":63186,"numMessagesInTopic":0,"msgSnippet":"... A few people here are good at coming up with research, so maybe they ll come through for you :-) But think about it for a moment. To study whether reading","messageBody":"<div id=\"ygrps-yiv-1646281838\">On Sep 28, 2011, at 2:32 AM, CherylSP wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Does anyone have any links to &quot;research&quot; to support the fact that  <br/>\n&gt; children exposed to a text-rich environment will aquire reading when  <br/>\n&gt; they are ready?<br/>\n<br/>\n </span></blockquote>A few people here are good at coming up with research, so maybe  <br/>\nthey&#39;ll come through for you :-)<br/>\n<br/>\nBut think about it for a moment. To study whether reading instruction  <br/>\nor being in a supportive, print-rich environment works better, you&#39;d  <br/>\nneed two sets of children. One set being instructed in reading. The  <br/>\nother not.<br/>\n<br/>\nSince most parents believe reading instruction is necessary, what  <br/>\nloving parent would allow her child to be in the second group? And how  <br/>\nmany years would she allow her child to be a guinea pig in a study for  <br/>\nsomeone&#39;s theory?<br/>\n<br/>\nAnd how would the scientists judge progress to see which approach was  <br/>\nworking better? What if the second approach works way better but takes  <br/>\nmuch longer? What if the results along the way of the second approach  <br/>\nlook nothing like the first approach, but both are judge by the  <br/>\nexpected progress of the first approach?<br/>\n<br/>\nIt&#39;s very very hard to test the progress of a process where skills are  <br/>\npicked up in a seemingly random order. If the yard stick used is  <br/>\nprogress on a linear scale (and most educators believe reading skills  <br/>\ndo need to be acquired in a specific order) the second group will  <br/>\nrepeatedly fail. They&#39;ll fail until the child is reading fluently. And  <br/>\nwhat mother would keep her child in a study that all along was  <br/>\n(seemingly) showing it wasn&#39;t working very well?<br/>\n<br/>\nThe only data we have -- can humanely have really -- is the data self- <br/>\nreported by unschoolers, people who already trust the approach will  <br/>\nwork. And by &quot;work&quot; I mean, kids can read what they need for their own  <br/>\npurposes by the time they&#39;re ready to go off on their own. (Unschooled  <br/>\nkids read much earlier! But being on their own is when reading  <br/>\nindependently comes in the most handy. :-) The typical ages for  <br/>\nunschooling kids reading are 6-10 (a bit later for boys). But the  <br/>\nrange can be 3 or 4 to over 12.<br/>\n<br/>\nThe &quot;over 12&quot; would make any mother freak if she didn&#39;t believe in the  <br/>\napproach! But what unschoolers know from experience -- as scientists  <br/>\nin our own test of the theory (the schools providing the other group  <br/>\nof kids) -- is that a child who doesn&#39;t read until 12 is learning just  <br/>\nfine without reading. They&#39;re using all sorts of different ways of  <br/>\nlearning about the world that are more natural to them. *And* once  <br/>\nthey begin reading, they aren&#39;t 6 years behind a child who began at 6.  <br/>\nThey very quickly are reading at the level of their peers. Very  <br/>\nshortly you can&#39;t tell the difference.<br/>\n<br/>\nProbably the closest you might come to scientific data is looking at  <br/>\nhow the Finns approach reading instruction. They have the highest  <br/>\nliteracy rate in the world. They don&#39;t even begin instruction until  <br/>\nkids are 7.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.oph.fi/english/sources_of_information/international_assessments/pisa/literacy_in_finland\">http://www.oph.fi/english/sources_of_information/international_assessments/pisa/literacy_in_finland</a><br/>\n<br/>\nIt&#39;s probably about as close as mass reading instruction can get to  <br/>\nthe personalized attention that unschooled kids get.<br/>\n<br/>\nIt&#39;s cool that they mention &quot;net surfing, text messages and role  <br/>\ngames&quot; as being supportive of reading. (Though then subvert it by  <br/>\nimplying that reading should be about books.)<br/>\n<br/>\nOne thing I want to point out is &quot;the ample supply of foreign films on  <br/>\ntelevision provided with Finnish sub-titles&quot; makes it sound like a big  <br/>\nfactor and without it kids wouldn&#39;t learn to read. The big factor is  <br/>\ntext the *child* finds useful for their own interests. Loads of  <br/>\nunschoolers credit video games (the text in them, and to a lesser  <br/>\nextent, the gaming guides and on line cheats) as being the largest  <br/>\nfactor in their own kids&#39; figuring out reading. Video games aren&#39;t  <br/>\nnecessary! but they do provide the factors most useful in learning  <br/>\nanything: intense interest and tools to meet needs with.<br/>\n<br/>\nKids will read whenever they are developmentally ready to read. Until  <br/>\nthey&#39;re developmentally ready, if they&#39;re experiences with print are  <br/>\npositive, they won&#39;t be pulling back from something they have negative  <br/>\nassociations with. They&#39;ll be going to it as they need it. Each time  <br/>\nit serves their own need, they&#39;ll have used it more and get better at  <br/>\nit *as a side effect*. And as they get better, they&#39;ll go to it more.  <br/>\nAnd so it progresses. Just as they did with speaking.<br/>\n<br/>\nKids who are more drawn to physical activities and less to those that  <br/>\nneed sitting will generally take longer to figure out reading. But by  <br/>\nthe time kids have hit puberty (which is later for boys) all the brain  <br/>\nareas they will draw on for decoding the printed word are way more  <br/>\nmature than they were at 6 and they won&#39;t need as much exposure to  <br/>\nfigure it out.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"1"},"subject":"Re: [AlwaysLearning] &quot;Research&quot; on Reading?","postDate":"1317207769","msgId":63188,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTcyMDc3NjkuMzE1MDYuWWFob29NYWlsUkNAd2ViODczMTUubWFpbC5pcmQueWFob28uY29tPg==","inReplyToHeader":"PGo1dWYycitvNnJmQGVHcm91cHMuY29tPg==","referencesHeader":"PGo1dWYycitvNnJmQGVHcm91cHMuY29tPg=="},"prevInTopic":63186,"nextInTopic":63189,"prevInTime":63187,"nextInTime":63189,"topicId":63186,"numMessagesInTopic":0,"msgSnippet":"Alan Thomas and Harriet Pattison have done research into how children learn within the framework of home-education. They gave a talk that was about reading at","messageBody":"<div id=\"ygrps-yiv-488244535\">Alan Thomas and Harriet Pattison have done research into how children learn <br/>\nwithin the framework of home-education. They gave a talk that was about reading <br/>\nat the LiTTLe Conferencein London this summer: <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.lttl.org.uk/download-sound-files.html\">http://www.lttl.org.uk/download-sound-files.html</a> has the sound file. I haven&#39;t <br/>\nlistened to it so don&#39;t know how it turned out, but it might not be a very good <br/>\nconverted to wireless kind of thing. They&#39;ve got a book out called How Children <br/>\nLearn at Home that talks about some of the ideas on learning, again I haven&#39;t <br/>\nread it, keep meaning to get it, maybe this pay cycle....<br/>\n<br/>\nPeter Grey has written some about how children learn to read without <br/>\ninstruction: <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.psychologytoday.com/blog/freedom-learn/201002/children-teach-themselves-read.\">http://www.psychologytoday.com/blog/freedom-learn/201002/children-teach-themselves-read.</a><br/>\n It isn&#39;t formal research, but it&#39;s examining what is out there. As well as <br/>\nacknowledging the fact that people are learning to read without being taught <br/>\nwhich means that the school model that instruction is key is false. <br/>\n<br/>\n<br/>\nMy son wasn&#39;t reading until he was 12 and now, at 14, he reads without thinking <br/>\nabout it. It&#39;s hard to be comfortable with what could be labelled as neglect in <br/>\neducation by the powers that be, but I truly believe that if I had done anything <br/>\nto push Simon&#39;s reading development I would have only harmed him and hindered <br/>\nthe process and made him feel less than. I don&#39;t know how you comfort someone <br/>\nelse in the knowledge that they can&#39;t control how or when someone else learns <br/>\nsomething. Maybe you can look at what a struggle it is to force someone to learn <br/>\nto read and how many different programs there are, but my son, without any of <br/>\nthose things, came to reading in his own time and in his own way. And that he&#39;s <br/>\none of many who&#39;ve done so. <br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: CherylSP &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:csecorap@...\">csecorap@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nSent: Wednesday, 28 September, 2011 7:32:59<br/>\nSubject: [AlwaysLearning] &quot;Research&quot; on Reading?<br/>\n<br/>\nHi,<br/>\n<br/>\nDoes anyone have any links to &quot;research&quot; to support the fact that children <br/>\nexposed to a text-rich environment will aquire reading when they are ready? I <br/>\nhave searched the archives, but can&#39;t seem to find what I am looking for. What I <br/>\nwould like is some information that I can give to my husband that is of a more <br/>\nacademic or research-oriented nature, and less anectodal, than what I have been <br/>\nable to provide him so far. He is concerned that our 6-year-old son is not yet <br/>\nreading.<br/>\n<br/>\nThanks,<br/>\nCheryl<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":406228737,"authorName":"CherylSP","from":"&quot;CherylSP&quot; &lt;csecorap@...&gt;","profile":"csecorap","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"&quot;Research&quot; on Reading?","postDate":"1317191579","msgId":63186,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo1dWYycitvNnJmQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":63188,"prevInTime":63185,"nextInTime":63187,"topicId":63186,"numMessagesInTopic":0,"msgSnippet":"Hi, Does anyone have any links to research to support the fact that children exposed to a text-rich environment will aquire reading when they are ready? I","messageBody":"<div id=\"ygrps-yiv-559745801\">Hi,<br/>\n<br/>\nDoes anyone have any links to &quot;research&quot; to support the fact that children exposed to a text-rich environment will aquire reading when they are ready? I have searched the archives, but can&#39;t seem to find what I am looking for. What I would like is some information that I can give to my husband that is of a more academic or research-oriented nature, and less anectodal, than what I have been able to provide him so far. He is concerned that our 6-year-old son is not yet reading.<br/>\n<br/>\nThanks,<br/>\nCheryl</div>","specialLinks":[]}],"prevTopicId":63045,"nextTopicId":63240}}