{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":0,"authorName":"Natrlmama@aol.com","from":"Natrlmama@...","replyTo":"LIST","senderId":"GdOR9ydcSSgyKMItYN1q-tNO0Z9U9ACO9CG_96sIjnLUXCdyp9KTwlmNsNvfxTMofScMphy7bnA","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] from unschool grad","postDate":"956249496","msgId":8262,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGFiLjI0YzYwYTAuMjYzMDhmOThAYW9sLmNvbT4="},"prevInTopic":8180,"nextInTopic":0,"prevInTime":8261,"nextInTime":8263,"topicId":8166,"numMessagesInTopic":0,"msgSnippet":"In a message dated 04/15/2000 10:15:52 PM Pacific Daylight Time, hafidha@jps.net writes: ","messageBody":"<div id=\"ygrps-yiv-1522782695\">In a message dated 04/15/2000 10:15:52 PM Pacific Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:hafidha@...\">hafidha@...</a> writes:<br/>\n<br/>\n&lt;&lt; I didn&#39;t have the ideal home/unschooling experience. I was homeschool<br/>\n from the ages of 12 to 16. At times it was extremely dull and weeks<br/>\n would go by when I don&#39;t think I did anything at all. My interaction<br/>\n with other people (of any age) was pretty limited. I think sometimes<br/>\n my parents didn&#39;t know what to do with me and my brothers. They are<br/>\n not very structured or disciplined themselves, so they were not so<br/>\n good about teaching us how to be. There was not much emphasis on<br/>\n developing serious hobbies or interests or even our talents. Still,<br/>\n they did the best they knew how, and I have no hard feelings towards<br/>\n them. I only feel like I have a lot of catching up to do as an adult<br/>\n because there are a lot of things I have an interest in that I wish I<br/>\n already knew (e.g. Latin & piano) - and that I could have learned back<br/>\n then if I&#39;d known how to be diligent. Since the age of 16, I&#39;ve been<br/>\n either in college or working. I am trying to unschool myself now as an<br/>\n adult, and the hardest thing for me is just knowing how to *finish*<br/>\n things. It&#39;s not easy to learn these skills when you&#39;re 20-something<br/>\n ... and I&#39;m something of a dilettante by nature; *my* unschooling<br/>\n experience probably reinforced that.<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;<br/>\n </span></blockquote>Thank you so much for sharing your history!  I just wanted to tell you,<br/>\ndon&#39;t feel too bad, I was in school and was terrbily bored from 12-18, when<br/>\nI got involved in smoking/drinking , the opposite sex  and later <br/>\nrecreational drugs (and still maintained an honor roll and good girl<br/>\nstatus).  At 15 I was working and still doing very well in school where<br/>\nI was biding my time.  I hung out with my business teacher and took<br/>\nall her advanced classes in addition to be an aid.  I did a few <br/>\ninteresting things, petitioning the coach to let sophomore girls in<br/>\nhis weights class (me and my gf won and paved the way for other<br/>\ngirls), was able to take archery (fun would like to do more of that<br/>\nagain when the kids grow older) and my passion, scuba diving was<br/>\noffered one quarter at my school.  So these are the things I took<br/>\naway from my school experienc.  Not a bad one?   My parents<br/>\nnever encouraged me to really do anything specific (I didn&#39;t know what<br/>\nI wanted to do anyhow) although they always told me that I could do/be <br/>\nwhatever I wanted,<br/>\nand quite frankly that has always stuck with me more than anything, the <br/>\nfact that my parents had the confidence in me and helped to instill in<br/>\nmyself that I can do whatever I set out to do.  I am not sure if I believe<br/>\nthat we can be taught or learn how to be diligent.  Certain things are<br/>\ninherent in our personalities.  I for instance, am a procrastinator, would<br/>\nrather read (books or email) than do just about anything yet I run a <br/>\nsuccessful construction business with my husband (I do take care of things <br/>\nwhen they need to be done within deadlines--but nothing I learned in <br/>\nschool prepared me for running a business--the skills I learned were typing,<br/>\nshorthand--a dead art &lt;g&gt;, and beginning computer which is nothing like<br/>\nwhat I later on taught myself at my first professional job or what I do<br/>\ntoday in business, in fact I remember my gf and I mostly telling jokes and<br/>\ngetting out of that class early LOL--if my work was done my teach would<br/>\nlet me go).  My children are <br/>\nlearning all kinds of cool stuff everyday mostly on their own, in addition<br/>\nI am running a house and being a mother.    After immersing myself for<br/>\nthe last seven years in the education and practical application of <br/>\nchildbirth, nutrition, parenting and child development,<br/>\nhomeschooling/un I am just now seeing that I may have other interests.  Not<br/>\nburning LOL but interesting just the same such as I look forward to some of <br/>\nour historical field trips as much as the children do.  (I like history, but <br/>\nremember zero--yup not one date other than 1776 from school.)  So this<br/>\nis an activity/interest that I have whether or not my children are interested<br/>\n(they are though) that I am hoping to learn more about. Geography, we<br/>\nlike to travel as well as natural science/botany.   Well, I could<br/>\ngo on all morning, but will cut myself short here!  Again, I enjoy hearing<br/>\nyour experiences : )<br/>\n<br/>\nKathy</div>","specialLinks":[]},{"userId":0,"authorName":"K WORTHEN","from":"&quot;K WORTHEN&quot; &lt;kworthen@...&gt;","replyTo":"LIST","senderId":"DTRWISnG5kYDor_lTroqD5iFCqv4u5v3lrMIL9QaX2TbmHE4-L5eyR_4G7owTZJy1v9jgnrQAzI_knv3AEGS5W5n-vGvMyP2UOs","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] from unschool grad","postDate":"955923551","msgId":8180,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMGIwMWJmYTdmMSRjYjAwMTM4MCQwMWE1ODAxOEBuZS5tZWRpYW9uZS5uZXQ+","referencesHeader":"PDAwYTYwMWJmYTc2MyQyNGJlMTBhMCQ3NzcwM2ZkMUBkZWZhdWx0PiA8MDAwNTAxYmZhN2U3JDBiZTFlMWUwJDAxYTU4MDE4QG5lLm1lZGlhb25lLm5ldD4gPDM4RkEzMzFELjU5NEZDRjdGQGhvbWUuY29tPg=="},"prevInTopic":8177,"nextInTopic":8262,"prevInTime":8179,"nextInTime":8181,"topicId":8166,"numMessagesInTopic":0,"msgSnippet":"Shannon, Thanks for the input. You certainly made some good points and I know you re right. If we try to change everything in 1 day because of something","messageBody":"<div id=\"ygrps-yiv-575467599\">Shannon,<br/>\nThanks for the input. You certainly made some good points and I know you&#39;re<br/>\nright. If we try to change everything in 1 day because of something someone<br/>\nelse says, it will prbably only last a week. But, you&#39;re also right that we<br/>\nhave been looking to make a change for a while. I need to get myself more<br/>\nmotivated and Hafidha&#39;s post just made me realize that not doing so could be<br/>\ndetramental to my kid&#39;s education.<br/>\nAmy<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message -----<br/>\nFrom: &quot;Shannon CC&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:shannoncc@...\">shannoncc@...</a>&gt;<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@egroups.com\">Unschooling-dotcom@egroups.com</a>&gt;<br/>\nSent: Sunday, April 16, 2000 5:39 PM<br/>\nSubject: Re: [Unschooling-dotcom] from unschool grad<br/>\n<br/>\n<br/>\n&gt; &gt; Things are going to  be different around here from now on.<br/>\n&gt; &gt; Amy<br/>\n&gt;<br/>\n&gt; I&#39;m not picking on Amy :-) but I just wanted to comment. I&#39;m often<br/>\n&gt; dismayed at people who change their whole way of parenting (hs-ing, etc)<br/>\n&gt; because of an off hand remark or one person&#39;s story that they&#39;ve heard<br/>\n&gt; on-line. I really appreciated Hafidha&#39;s story (tho, sadly, I saw some of<br/>\n&gt; my childhood in what she described, and I was sent to school), but I<br/>\n&gt; would urge everyone to not go against their instincts because of one<br/>\n&gt; story, which, by the way, was over-all a positive one! Children are<br/>\n&gt; different and so are parents. I don&#39;t think unschooling or parenting the<br/>\n&gt; way someone else says to will work. You have to raise your kids the way<br/>\n&gt; that works for you and your family. We can learn by other&#39;s successes<br/>\n&gt; and mistakes, and the example of others certainly gives us something to<br/>\n&gt; think about (which is one reason we&#39;re all on this list) but I don&#39;t<br/>\n&gt; think we should let ourselves have knee-jerk reactions to other people&#39;s<br/>\n&gt; experiences. Basically, we&#39;re all going to make mistakes. Whether you<br/>\n&gt; send your kids to school, or homeschool, or unschool, there are always<br/>\n&gt; going to be things you could have done better, and things you could have<br/>\n&gt; done worse. I think we should learn as much as we can from the<br/>\n&gt; experiences of others, take a good, hard look at our own families, and<br/>\n&gt; then do what our instincts tell us to do.<br/>\n&gt;<br/>\n&gt; And Amy, I&#39;m really not singling you out. I did notice you said you&#39;ve<br/>\n&gt; been worried about how it&#39;s going for your family so it&#39;s not just<br/>\n&gt; Hafidha&#39;s story that is prompting you to make a change. But I have met<br/>\n&gt; too many people online who read one story from one person and then panic<br/>\n&gt; and run out and change everything. I just thought I&#39;d comment on that.<br/>\n&gt;<br/>\n&gt; Shannon CC<br/>\n&gt;<br/>\n&gt; ------------------------------------------------------------------------<br/>\n&gt; Enjoy the award-winning journalism of The New York Times with<br/>\n&gt; convenient home delivery.  And for a limited time, get 50% off for the<br/>\n&gt; first 8 weeks by subscribing.  Pay by credit card and receive an<br/>\n&gt; additional 4 weeks at this low introductory rate.<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://click.egroups.com/1/3100/7/_/448294/_/955921315/\">http://click.egroups.com/1/3100/7/_/448294/_/955921315/</a><br/>\n&gt; ------------------------------------------------------------------------<br/>\n&gt;<br/>\n&gt; Message boards, timely articles, a free newsletter and more!<br/>\n&gt; Check it all out at: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n&gt;<br/>\n&gt; To Unsubscribe: mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-unsubscribe@onelist.com\">Unschooling-dotcom-unsubscribe@onelist.com</a><br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":0,"authorName":"K WORTHEN","from":"&quot;K WORTHEN&quot; &lt;kworthen@...&gt;","replyTo":"LIST","senderId":"Mq5lkhR0b2FrcVqeLUV79nezRVUpddlVprLUGPeuc_HC49wsrpFjVvXCL4bIwwr-ay-cyscbInZsltQLvMgnVvdOl2vimcUvJBo","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] from unschool grad","postDate":"955918935","msgId":8177,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDUwMWJmYTdlNyQwYmUxZTFlMCQwMWE1ODAxOEBuZS5tZWRpYW9uZS5uZXQ+","referencesHeader":"PDAwYTYwMWJmYTc2MyQyNGJlMTBhMCQ3NzcwM2ZkMUBkZWZhdWx0Pg=="},"prevInTopic":8174,"nextInTopic":8180,"prevInTime":8176,"nextInTime":8178,"topicId":8166,"numMessagesInTopic":0,"msgSnippet":"Dear Hafidha, Thanks so much for your enlightening post. You toughed on some of my greatest fears and I appreciate your honesty. There are many days when I ","messageBody":"<div id=\"ygrps-yiv-1584707404\">Dear Hafidha,<br/>\nThanks so much for your enlightening post. You toughed on some of my<br/>\ngreatest fears and I appreciate your honesty. There are many days when I<br/>\ngive in to my feelings of laziness and I now know that I was right to worry<br/>\nthat this would affect my kids. (In fact, Ispent all afternoon preparing a<br/>\nunit study of the Revolutionary war for this week). I&#39;m sorry to hear that<br/>\nyour situation was not ideal, but thanks to you, I hope my kids won&#39;t feel<br/>\nthe same way. Things are going to  be different around here from now on.<br/>\nAmy<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message -----<br/>\nFrom: &quot;Hafidha&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:hafidha@...\">hafidha@...</a>&gt;<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@egroups.com\">Unschooling-dotcom@egroups.com</a>&gt;<br/>\nSent: Sunday, April 16, 2000 1:17 AM<br/>\nSubject: [Unschooling-dotcom] from unschool grad<br/>\n<br/>\n<br/>\n&gt; Hello Jackie, Sonia, and Linda (and whoever else asked about being a<br/>\n&gt; former unschooler)<br/>\n&gt;<br/>\n&gt; Sorry for the delay in getting back to you about this. I wanted to<br/>\n&gt; respond, but didn&#39;t quite know where to begin. I&#39;ll try now, but<br/>\n&gt; please excuse me if this sounds scattered; it&#39;s late and it&#39;s been a<br/>\n&gt; long day. This is kind of long (I&#39;m HORRIBLY longwinded).<br/>\n&gt;<br/>\n&gt; I didn&#39;t have the ideal home/unschooling experience. I was homeschool<br/>\n&gt; from the ages of 12 to 16. At times it was extremely dull and weeks<br/>\n&gt; would go by when I don&#39;t think I did anything at all. My interaction<br/>\n&gt; with other people (of any age) was pretty limited. I think sometimes<br/>\n&gt; my parents didn&#39;t know what to do with me and my brothers. They are<br/>\n&gt; not very structured or disciplined themselves, so they were not so<br/>\n&gt; good about teaching us how to be. There was not much emphasis on<br/>\n&gt; developing serious hobbies or interests or even our talents. Still,<br/>\n&gt; they did the best they knew how, and I have no hard feelings towards<br/>\n&gt; them. I only feel like I have a lot of catching up to do as an adult<br/>\n&gt; because there are a lot of things I have an interest in that I wish I<br/>\n&gt; already knew (e.g. Latin & piano) - and that I could have learned back<br/>\n&gt; then if I&#39;d known how to be diligent. Since the age of 16, I&#39;ve been<br/>\n&gt; either in college or working. I am trying to unschool myself now as an<br/>\n&gt; adult, and the hardest thing for me is just knowing how to *finish*<br/>\n&gt; things. It&#39;s not easy to learn these skills when you&#39;re 20-something<br/>\n&gt; ... and I&#39;m something of a dilettante by nature; *my* unschooling<br/>\n&gt; experience probably reinforced that.<br/>\n&gt;<br/>\n&gt; Despite all that, I support other people&#39;s efforts to home/unschool, I<br/>\n&gt; believe in the philosophy and if I had children I would more than<br/>\n&gt; likely unschool them.  I enjoy learning and would love to be able to<br/>\n&gt; spend time with my kid(s) everyday exploring the world and learning<br/>\n&gt; with them. My main suggestion to parents (and I don&#39;t intend this to<br/>\n&gt; be AT ALL accusatory)  is to really fight the urge to be lazy.  Make<br/>\n&gt; sure your kids are really learning and engaged in life - taking<br/>\n&gt; lessons, volunteering, getting outdoors, and developing skills;<br/>\n&gt; whether they&#39;re playing an instrument, re-enacting history, sewing,<br/>\n&gt; gardening, working on computers, fixing cars, or flying planes, they<br/>\n&gt; should be experiencing things and trying things out. We don&#39;t always<br/>\n&gt; have these opportunities as adults. (We should, but we don&#39;t.)<br/>\n&gt;<br/>\n&gt; The book Grace Llewellyn edited (I believe it&#39;s called &quot;Real Lives&quot;)<br/>\n&gt; that featured essays by a dozen or so unschooling teens was excellent.<br/>\n&gt; Unschooling is only an advantage, I believe, when kids are MORE<br/>\n&gt; involved in life than they would be if they were in school. And when<br/>\n&gt; they are more in touch with themselves. I was VERY in touch with<br/>\n&gt; myself as an unschooling teen, but I wasn&#39;t immersed in life; that was<br/>\n&gt; a very serious inbalance, and seven years later it&#39;s something I&#39;m<br/>\n&gt; still trying to right.<br/>\n&gt;<br/>\n&gt; I think my parents keeping me out of school prevented me from being<br/>\n&gt; overly concerned with what other people think about me because when I<br/>\n&gt; first left school I was very, very easily hurt by others. I had low<br/>\n&gt; self esteem.  I got along with everyone, but was also easily<br/>\n&gt; intimidated and fearful of being disliked. To some degree it&#39;s part of<br/>\n&gt; my personality to want to get along and avoid confrontation, but I<br/>\n&gt; think my parents saw that school wasn&#39;t helping me in this regard;  I<br/>\n&gt; do believe I&#39;m a much stronger-willed and independent person now than<br/>\n&gt; I would have been had I stayed in junior high.<br/>\n&gt;<br/>\n&gt; Perhaps the best thing about my parents&#39; decision to unschool is that<br/>\n&gt; it exposed me to various subcultures ... different way of looking at<br/>\n&gt; things. I was alerted to alternative movements and ideas at a young<br/>\n&gt; age, and learned to view everything (especially mainstream lifestyle)<br/>\n&gt; with some skepticism, to not believe everything I was told, and to<br/>\n&gt; question convention. I can say with a fair amount of certainty that<br/>\n&gt; had I gone the normal schooling route I&#39;d be in the rat race with so<br/>\n&gt; many other people, just trying to keep up with the Joneses, trying to<br/>\n&gt; appear impressive and accomplished, and not asking myself &quot;Why am I<br/>\n&gt; doing this? Who am I doing this for?&quot;  There&#39;s a large part of me that<br/>\n&gt; can be really uptight and conservative, so unschooling was a fantastic<br/>\n&gt; counterbalance to that.<br/>\n&gt;<br/>\n&gt; If I could go back 10 years and do things differently, I would have a<br/>\n&gt; more active and fulfilling unschooling experience;  I wouldn&#39;t choose<br/>\n&gt; school.  So that&#39;s that. I hope this answered your questions. Oh, and<br/>\n&gt; I&#39;m a pretty &#39;normal&#39; adult. I work for a utility company, make decent<br/>\n&gt; money, keep my own apartment, and have some friends. Still, I really<br/>\n&gt; don&#39;t like this office work and plan to next year move to Spain to<br/>\n&gt; study Spanish for a year, and then who knows? There are so many things<br/>\n&gt; I want to do, that if one thing doesn&#39;t work out it just points me in<br/>\n&gt; another direction I was interested in anyway.<br/>\n&gt;<br/>\n&gt; Gnight,<br/>\n&gt; Hafidha<br/>\n&gt;<br/>\n&gt; Portland, OR<br/>\n&gt;<br/>\n&gt; **********************************************************************<br/>\n&gt; *********************<br/>\n&gt; &quot;The trouble with modern education is you never know how ignorant<br/>\n&gt; people are. With anyone over fifty you can be fairly confident what&#39;s<br/>\n&gt; been taught and what&#39;s been left out. But these young people have such<br/>\n&gt; an intelligent, knowledgeable surface, and then the crust suddenly<br/>\n&gt; breaks and you look down into depths of confusion you didn&#39;t know<br/>\n&gt; existed.&quot;<br/>\n&gt; ~from Brideshead Revisited, Evelyn Waugh<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ------------------------------------------------------------------------<br/>\n&gt; Avoid the lines and visit avis.com for quick and easy online<br/>\n&gt; reservations. Enjoy a compact car nationwide for only $29 a day!<br/>\n&gt; Click here for more details.<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://click.egroups.com/1/3011/7/_/448294/_/955862119/\">http://click.egroups.com/1/3011/7/_/448294/_/955862119/</a><br/>\n&gt; ------------------------------------------------------------------------<br/>\n&gt;<br/>\n&gt; Message boards, timely articles, a free newsletter and more!<br/>\n&gt; Check it all out at: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n&gt;<br/>\n&gt; To Unsubscribe: mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-unsubscribe@onelist.com\">Unschooling-dotcom-unsubscribe@onelist.com</a><br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":0,"authorName":"Hafidha","from":"&quot;Hafidha&quot;&lt;hafidha@...&gt;","replyTo":"LIST","senderId":"NChgWQuulAvmQ50KrbVHFLA_n115vRIh4bdeMU-VAOpRvKRYXn54gsWbRnDsgQDZgUgxRs_RoqFvWqc6uBZlKZo","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] from unschool grad","postDate":"955903774","msgId":8174,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM4ZjllZjFlLjViY2IuMEBqcHMubmV0Pg=="},"prevInTopic":8171,"nextInTopic":8177,"prevInTime":8173,"nextInTime":8175,"topicId":8166,"numMessagesInTopic":0,"msgSnippet":"... Yes, but I dreaded being in new situations with strangers so I would generally avoid outside activities. My mother left it up to me to make things happen","messageBody":"<div id=\"ygrps-yiv-1391327499\">Carol wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;So, as a matter of interest, were you interested in these &gt;things back then?<br/>\n<br/>\n<br/>\n </span></blockquote>Yes, but I dreaded being in new situations with strangers so I would generally<br/>\navoid outside activities. My mother left it up to me to make things happen for<br/>\nmyself; she felt that if I couldn&#39;t figure out how to then I must not have been<br/>\ntruly interested.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;What do you mean by lazy? If things are important enough to &gt;us, we will do<br/>\n </span></blockquote>them. If they aren&#39;t important enough to do &gt;them willingly, then are they really<br/>\nworth doing?<br/>\n<br/>\nBy lazy I mean the inclination to be inert. For example, I know a lot of kids<br/>\nwho only want to watch television all day. As a parent, I wouldn&#39;t allow this<br/>\neven if it was what they wanted. Some folks need no encouragement to learn or<br/>\ntry new things; others could use some hand-holding in the beginning.<br/>\n<br/>\n-hafidha</div>","specialLinks":[]},{"userId":0,"authorName":"Hafidha","from":"&quot;Hafidha&quot;&lt;hafidha@...&gt;","replyTo":"LIST","senderId":"H4lMsU0ickd6E-_qTdGel8KLgF02crQIQ-v_XIZ42adCQpn74ciP5ga51_hhl6XP5X68i41KBq2cVeki7f1kNqk","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] from unschool grad","postDate":"955899484","msgId":8171,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM4ZjlkZTVjLjRhZmMuMEBqcHMubmV0Pg=="},"prevInTopic":8169,"nextInTopic":8174,"prevInTime":8170,"nextInTime":8172,"topicId":8166,"numMessagesInTopic":0,"msgSnippet":"Hi, We did things sometimes. I had a lot of pen pals and was an avid reader. I belonged to a small Girl Scout troop; we met twice a month for about ... a year,","messageBody":"<div id=\"ygrps-yiv-372582225\">Hi,<br/>\nWe did things sometimes. I had a lot of pen pals and was an avid reader. I belonged<br/>\nto a small Girl Scout troop; we met twice a month for about ... a year, I think.<br/>\nThe meetings were held about 45 minutes away from my house (in Brooklyn; I was<br/>\non Long Island). I remember that I looked forward to these meetings. We weren&#39;t<br/>\nas active about getting badges as other troops might be; but it was just nice<br/>\nto see the other girls. I think I earned one badge. =)<br/>\n<br/>\nI had interests, but I was also very shy and didn&#39;t know how to take initiative.<br/>\nMy mom would often get mad at me because I didn&#39;t get out or do anything. I<br/>\nwanted to, but it was hard for me to be in new situations. We&#39;d moved to a new<br/>\ntown several months before we started unschooling and I literally had no friends<br/>\nthere. When I was about 13, my mom met a few other unschooling parents and we<br/>\nwould get together with them and their kids once a month or so at a local park.<br/>\nOne family we were friends with, and we&#39;d visit them at their house from time<br/>\nto time. <br/>\n<br/>\nI had a weekend paper route. We&#39;d go to the library a lot because we all liked<br/>\nreading. I enjoyed writing and would make up little stories, poems and songs.<br/>\nMost days I would just read from the time I woke up till I fell asleep that<br/>\nnight. I also slept a LOT - I would actually look forward to sleeping. I think<br/>\nthat might have been (in part) a teenage thing because my younger brother went<br/>\nthrough the same phase some years later. I spent a lot of time with my brothers.<br/>\n<br/>\n<br/>\nWhen I get home I&#39;ll take a look at my journals to see what other things I did.<br/>\n<br/>\n<br/>\n-Hafidha<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt;<br/>\n&gt;<br/>\n&gt;Thanks so much for sharing your experience with us, Hafidha.<br/>\n&gt;<br/>\n&gt;I was just curious to know WHAT you did during those unschooling years?<br/>\n&gt;Your parents did not take you anywhere?  You had no interests, hobbies,<br/>\n&gt;or outside activities?<br/>\n&gt;<br/>\n&gt;If you could give a little more detail I&#39;d find it very helpful.<br/>\n&gt;<br/>\n&gt;Thanks again,<br/>\n&gt;<br/>\n&gt;Sonia<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":0,"authorName":"kayelle42@aol.com","from":"kayelle42@...","replyTo":"LIST","senderId":"VaDFt2XjabMviMXURwDzfzcWw-nNx7DIVOUJAhhlNnLDxILmfk-jY5kmPBxsra0Yc_5_3gfB9k4","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] from unschool grad","postDate":"955890282","msgId":8169,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyLjQyYjcyYTUuMjYyYjE0NmFAYW9sLmNvbT4="},"prevInTopic":8166,"nextInTopic":8171,"prevInTime":8168,"nextInTime":8170,"topicId":8166,"numMessagesInTopic":0,"msgSnippet":"Hafidha said: ","messageBody":"<div id=\"ygrps-yiv-2025049445\">Hafidha said:<br/>\n&lt;&lt; <br/>\n <br/>\n<blockquote><span title=\"ireply\">  &gt; I only feel like I have a lot of catching up to do as an adult<br/>\n &gt; because there are a lot of things I have an interest in that I wish I<br/>\n &gt; already knew (e.g. Latin & piano) - and that I could have learned back<br/>\n &gt; then if I&#39;d known how to be diligent.<br/>\n  &gt;&gt;<br/>\n </span></blockquote>     I was not home schooled and I have often wished I had learned to play <br/>\nthe piano when I was younger.  So, at the age of 40, I started taking piano <br/>\nlessons!  I love it!  I usually practice about an hour a day and can hardly <br/>\nwalk by the piano without being drawn to it.  My unschooled daughter, on the <br/>\nother hand, has no interest at all AT THIS TIME.  My point is, learning isn&#39;t <br/>\nsomething to be accomplished while you are a child and then you go live your <br/>\n&quot;real&quot; life.  We are all &quot;unschooling&quot; from the day we are born until the day <br/>\nwe die.  First and foremost, I want my daughter to enjoy learning and to find <br/>\nthe things in life that bring her joy and passion.  Then this will be a life <br/>\nworth living.  Everything else she needs will come from this. And, it&#39;s never <br/>\ntoo late!    Jackie</div>","specialLinks":[]},{"userId":0,"authorName":"unschoolr2@aol.com","from":"unschoolr2@...","replyTo":"LIST","senderId":"xyY2_LrPa1_GmDYGaBDmUCmzIuYYGBmWrACX2fpvOOHS7EyLMeGBG02oLqAuQrEn2mb1dk86hoXP","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] from unschool grad","postDate":"955863919","msgId":8166,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhlLjNjNGE2ZWQuMjYyYWFkNmZAYW9sLmNvbT4="},"prevInTopic":0,"nextInTopic":8169,"prevInTime":8165,"nextInTime":8167,"topicId":8166,"numMessagesInTopic":0,"msgSnippet":"In a message dated 4/15/2000 10:15:50 PM Pacific Daylight Time, hafidha@jps.net writes: Hafidha, ","messageBody":"<div id=\"ygrps-yiv-1214024397\">In a message dated 4/15/2000 10:15:50 PM Pacific Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:hafidha@...\">hafidha@...</a> writes:<br/>\nHafidha,<br/>\n<br/>\n&lt;&lt; Unschooling is only an advantage, I believe, when kids are MORE<br/>\n involved in life than they would be if they were in school.  &gt;&gt;<br/>\nYes, I truly believe this. And we as unschooling parents have to make sure <br/>\nthat our children have access to the wider world. It is all well and good to <br/>\nsay that children should be responsible for their own education, but parents <br/>\nHave to help them do that. We are the ones that takes them to lessons and <br/>\nmeetings, we are the ones who make sure that they get to whatever volunteer <br/>\nopportunity they choose. Their education, has to come from us. Sheese, I am <br/>\ntired just thinking of it&lt;g&gt;<br/>\nBy the way, Hafidha, I am from the Portland area too:)<br/>\nTeri<br/>\n<br/>\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~<br/>\nTeri Brown<br/>\nSuite101 Unschooling Editor <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.suite101.com/welcome.cfm/unschooling\">http://www.suite101.com/welcome.cfm/unschooling</a><br/>\nAssistant Editor For Voices, <br/>\nThe Journal of the National Home Education Network www.nhen.org<br/>\nColumnist For The Link: A Homeschooling Newspaper<br/>\nHomeschooling - Christian Unschooling - Natural learning<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.inspirit.com.au/unschooling/\">http://www.inspirit.com.au/unschooling/</a><br/>\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~</div>","specialLinks":[]}],"prevTopicId":8260,"nextTopicId":8263}}