{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":8,"messages":[{"userId":246186758,"authorName":"Sarah","from":"&quot;Sarah&quot; &lt;yahoo@...&gt;","profile":"sarahlexis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Child care","postDate":"1311323598","msgId":61913,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGowYmNrZStqN21tQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEU2N0RERTZFLTAxMzctNDQxQS05NkYwLTQxOTQ3RDNEQkREQkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":61909,"nextInTopic":0,"prevInTime":61912,"nextInTime":61914,"topicId":61858,"numMessagesInTopic":0,"msgSnippet":"If you have stuff to do that you can t manage with an 18mo in tow then you could look into hiring someone to take some of that off your plate. Help with","messageBody":"<div id=\"ygrps-yiv-745797770\">If you have stuff to do that you can&#39;t manage with an 18mo in tow then you could look into hiring someone to take some of that off your plate. <br/>\n<br/>\nHelp with housework or your business would take some pressure off without impacting on your time together. It would also mean that you can have some time &#39;off&#39; when your child naps, rather than catching up on work... <br/>\n<br/>\nBy all means buy in help if you can, but don&#39;t assume it has to be childcare.  I have a cleaner one morning a week and that helps me enormously- not only keeping our noses above the grime, but also enabling me to ignore it sometimes and play instead.<br/>\n<br/>\nSarah</div>","specialLinks":[]},{"userId":405127085,"authorName":"Sarah","from":"Sarah &lt;septembrist@...&gt;","profile":"sarahgodoy1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Child care","postDate":"1311308753","msgId":61909,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBR1hlRDhIenRIOHVOdHNaVGNuVFhPZk1mQWFzMmlYdEhKPXdGU3plaUdDaTBfRW5qQUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":61892,"nextInTopic":61913,"prevInTime":61908,"nextInTime":61910,"topicId":61858,"numMessagesInTopic":0,"msgSnippet":"We are in a similar work situation with our daughter, who is now 2.5 years old... My husband and I alternate working and taking care of her. We are from a","messageBody":"<div id=\"ygrps-yiv-1429374598\">We are in a similar work situation with our daughter, who is now 2.5 years<br/>\nold... My husband and I alternate working and taking care of her.<br/>\n<br/>\nWe are from a mixed-culture family as my husband is from Latin America and<br/>\nI, from Canada.  We have a mexican friend whose grandmother had a saying<br/>\nthat has always resonated with us: &quot;Sus niños, *contigo*.&quot;  (&quot;Your children,<br/>\n*with you.*&quot;)<br/>\n<br/>\nSince our daughter was she was first born, my inclination has always been<br/>\nnot to leave her with anyone unless completely necessary (practically<br/>\nnever), and then only with someone who is deeply and intimately acquainted<br/>\nwith my husband and myself, and whom my daughter knows very well and<br/>\nfeels very comfortable with.  Especially because, at such a young<br/>\nage, chidlren do not have the verbal ability to explain to us if something<br/>\ngoes wrong for them while we are away - we might get a feeling about it, but<br/>\nthey won&#39;t be able to explain what actually happened.<br/>\n<br/>\nFor us, that has meant only leaving our daughter a couple of times, with her<br/>\ngrandparents when they have been here to visit, and then, only towards the<br/>\nend of their stay when my daughter has become very comfortable in their<br/>\ncompany.<br/>\n<br/>\nShe is now 2.5 years old, and just in the past few months she has happily<br/>\nspent a few short periods of time away from us in the company of other<br/>\nadults who are very close friends of ours (1 with a child of her own, 1<br/>\nwithout), and whom our daugher knows very well.<br/>\n<br/>\nIn spite of always being with us, she does get lots of time to<br/>\nsocialize with other children of various ages, from being out in the world<br/>\nwith my husband and I while we are not working.  We take her to visit<br/>\nfriends who have children, or to the beach or the playground, or shopping,<br/>\nand she plays with children wherever she finds them.  And she also gets to<br/>\nsee how we do life outside the home.<br/>\n<br/>\nThe use of daycare is quite common where we live (in Canada) and<br/>\npeople often comment to us about how very social our daughter is, how well<br/>\nshe plays with other children and how open and friendly she is.  I strongly<br/>\nbelieve that this comes from her having the opportunity to spend time with<br/>\nother adults and children, while always knowing that her Mami or her<br/>\nPapi are nearby if she needs us for any reason.<br/>\n<br/>\nI really believe that her sense of secure independence has been able<br/>\nto grow because, at the most basic level her needs are being taken care of:<br/>\nshe feels safe.<br/>\n<br/>\nI read a great book about the function of attachment in the psychological<br/>\nand emotional development of children, which gave me a lot to think when it<br/>\ncomes to daycare, etc., and I always recommend it to parents, call Hold On<br/>\nTo Your Kids, by Vancouver-based child-psychologist Dr. Gordon<br/>\nNeufeld.  It&#39;s been translated into 6 languages and so far I have given<br/>\ncopies to both Spanish and English-speaking friends.<br/>\n<br/>\nI do like the idea of a &#39;mother&#39;s helper&#39;, an older child  who can come and<br/>\nspend time with your child while you are at home, freeing you up to do<br/>\nthings you want to around the house!<br/>\n<br/>\nSarah<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":426422274,"authorName":"christinebgilbert","from":"&quot;christinebgilbert&quot; &lt;christine.gilbert@...&gt;","profile":"christinebgilbert","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Child care","postDate":"1311298258","msgId":61892,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGowYWpzaStjdnIxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGowOTJqbSszc2x2QGVHcm91cHMuY29tPg=="},"prevInTopic":61872,"nextInTopic":61909,"prevInTime":61891,"nextInTime":61893,"topicId":61858,"numMessagesInTopic":0,"msgSnippet":"Thank you everyone for your responses!  I m so glad I posted here, because I really didn t want to do it, or at least I had reservations about it, but my","messageBody":"<div id=\"ygrps-yiv-1718431717\">Thank you everyone for your responses!  I&#39;m so glad I posted here, because I really didn&#39;t want to do it, or at least I had reservations about it, but my friends/family were telling me I that it was my issue not his (as in &quot;he&#39;ll love it, it&#39;ll be hard for you, but that&#39;s because you&#39;re a new mom&quot;).  Because we travel so much (and cultures are different everywhere, for instance, there&#39;s not playgroups here Thailand -- or at least it&#39;s not common), I do worry that he&#39;s always around adults, but it&#39;s good to know he&#39;ll be okay with that at this age.</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Child care","postDate":"1311276541","msgId":61872,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTEyNzY1NDEuNTQ5MDUuWWFob29NYWlsTmVvQHdlYjExMDQwMS5tYWlsLmdxMS55YWhvby5jb20+","inReplyToHeader":"PGowOTJqbSszc2x2QGVHcm91cHMuY29tPg==","referencesHeader":"PGowOTJqbSszc2x2QGVHcm91cHMuY29tPg=="},"prevInTopic":61869,"nextInTopic":61892,"prevInTime":61871,"nextInTime":61873,"topicId":61858,"numMessagesInTopic":0,"msgSnippet":"***I have never left him with anyone else and I m quite torn about the idea that he might want me and I wouldn t be there.*** If you think he ll be anxious","messageBody":"<div id=\"ygrps-yiv-409991302\">***I have never left him with anyone else and I&#39;m quite torn about the idea that he might want me and I wouldn&#39;t be there.***<br/>\n<br/>\nIf you think he&#39;ll be anxious without you, I wouldn&#39;t do it.  There is a reason you feel torn.  I think that desire and drive to have your baby near is a really strong one.  Can you hire someone to come to your house to watch him?  Can you leave him with a trusted neighbor for a few hrs a couple days a week?  It can be hard to work with a baby around, but you guys sound like you have a system that works.<br/>\n<br/>\n ***On the other hand, I could use the free time and he could use the interaction with other children.***<br/>\n<br/>\n<br/>\nWhen my oldest was little, my husband and I ran a business out of our home.  We took turns working and then worked during naps and times when she was fine just being in her high chair for a bit.  We invited others with little kids to come over here and there and I took her out to play with other moms and babies.  Most babies don&#39;t care so much about playing with other kids, so that wasn&#39;t an issue.<br/>\n<br/>\nWhen our daughter was 4, we put her in a part time day care.  She was there for about 10 mos.  I feel as if I missed out on an entire year of her life.  I worked full time and picked her up in the afternoon.  My husband worked a later shift than I did, so took her there in the late morning.  Our daughter loved it.  It was the only thing that even remotely made it feel okay for me.  She was always excited to go and reluctant to leave, the opposite of most of the kids there.  She was just as happy to not go and stay home.  I think that was a part of her personality.  She really did love playing with other kids all day, but when we took her home, I stopped working full time and took her with me to my new work at a place with lots of kids.<br/>\n<br/>\nMy priority was to be with my daughter first, work second.  When I interviewed for the new job, I took my daughter with me and told the woman we were a package deal.  Chamille was 5 at the time, it turned out the woman hiring me was taking her 7 yr old to work with her, keeping her out of school to homeschool.  That was an amazing experience and one that I wouldn&#39;t have found if my priority had been different.<br/>\n<br/>\nThat&#39;s my experience.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Child care","postDate":"1311269887","msgId":61869,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGowOW81ditxZmF1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGowOTJqbSszc2x2QGVHcm91cHMuY29tPg=="},"prevInTopic":61863,"nextInTopic":61872,"prevInTime":61868,"nextInTime":61870,"topicId":61858,"numMessagesInTopic":0,"msgSnippet":"... ************** If you can get someone to come to your house - even an older child or a teen who can just play with your child for a little while - that can","messageBody":"<div id=\"ygrps-yiv-108538994\">&quot;christinebgilbert&quot; &lt;christine.gilbert@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Do any of you guys use any child care?  Our son is 16 mo and we&#39;re in Thailand.  My husband and I both work from home, but we take turns working, so one of us is always with our son, so we thought about getting some help.<br/>\n </span></blockquote>**************<br/>\n<br/>\nIf you can get someone to come to your house - even an older child or a teen who can just play with your child for a little while - that can be a big help. It&#39;s less helpful, in my experience, to take a toddler somewhere else so that you can get some work done - you spend so much time and energy running back and forth (not a trivial enterprise with a young child who may not transition easily) that you don&#39;t get all that much done and your more tired than if you&#39;d spent the time multi-tasking. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; And then our son will have kids to play with... which I think he would really like.<br/>\n </span></blockquote>****************<br/>\n<br/>\nThat&#39;s a whole different scenario. Little kids don&#39;t always do so well in groups (like day care or preschool) so one-on-one playdates are usually much better in terms of meeting your child&#39;s social needs. If he likes playing with random kids, playgrounds are good. Of course those are things that will likely take you away from your work, too - but that&#39;s one of the trade-offs of home/unschooling. Spending time with your kids moves to higher level of priority (especially in the toddler years) to &quot;getting things done&quot;. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I have never left him with anyone else and I&#39;m quite torn about the idea that he might want me and I wouldn&#39;t be there.<br/>\n </span></blockquote>*****************<br/>\n<br/>\nDon&#39;t commit yourself to anything that leaves you feeling boxed into a corner! You don&#39;t Have To leave your son anywhere he doesn&#39;t want to be. Find out if its possible to stay with him while he explores the space and gets to know the kids. Plan on transitioning slowly so you&#39;re not just dropping him off and leaving - that way you can have a sense if he&#39;s happy to be there without you. Lots of times kids are happy to have &quot;play groups&quot; where the parents are right there, but are very unhappy at the idea of mom leaving. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;On the other hand, I could use the free time and he could use the interaction with other children.<br/>\n </span></blockquote>****************<br/>\n<br/>\nIt could be a better idea to work on meeting those needs separately. Plan on being available to him while he&#39;s interacting with other children, but find other ways to get your own needs met. Do things while he&#39;s with his dad, for instance. It also helps to realize you can get your personal needs met in little bits, rather than in big chunks of time - it takes a shift in your expectations, though. I used to think I needed hours of personal time - but living with Ray I discovered I could take a big deep breath while he ran to go pee and revel in my moments of solitude and that would be enough. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Child care","postDate":"1311252330","msgId":61863,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2N0RERTZFLTAxMzctNDQxQS05NkYwLTQxOTQ3RDNEQkREQkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGowOTJqbSszc2x2QGVHcm91cHMuY29tPg==","referencesHeader":"PGowOTJqbSszc2x2QGVHcm91cHMuY29tPg=="},"prevInTopic":61861,"nextInTopic":61869,"prevInTime":61862,"nextInTime":61864,"topicId":61858,"numMessagesInTopic":0,"msgSnippet":"This quote popped up in my e-mail while I was thinking of what to say about child care: ++++++++++++++++++++++++++++ If you re only willing to do what is easy,","messageBody":"<div id=\"ygrps-yiv-1712996227\">This quote popped up in my e-mail while I was thinking of what to say about child care:<br/>\n<br/>\n++++++++++++++++++++++++++++<br/>\n<br/>\nIf you&#39;re only willing to do what is easy, life will be hard. If you&#39;re willing to do what is hard, life will be easy.<br/>\n<br/>\n     - Bishop Eddie L. Long<br/>\n<br/>\n++++++++++++++++++++++++++++<br/>\n<br/>\nI don&#39;t know who the guy is, but the quote is on a marriage encouragement list called Caring for Marriage.<br/>\n<br/>\nWhat it has to do with unschooling is that people look at unschooling and think unschoolers aren&#39;t doing anything.  But there is a whole lot of doing, and of conviction, and living by principles, that make it work well.<br/>\n<br/>\n-=- My husband and I both work from home, but we take turns working, so one of us is always with our son, so we thought about getting some help. Maybe daycare for a few hours a day, every other day? And then our son will have kids to play with... which I think he would really like.<br/>\n-=-<br/>\n<br/>\nI don&#39;t think a one year old needs kids to play with, but he could use being out and about where he can see people doing what people do.  I bet if the childcare parent took him out more, some of your angst would dissipate.<br/>\n<br/>\n-=-I have never left him with anyone else and I&#39;m quite torn about the idea that he might want me and I wouldn&#39;t be there. -=-<br/>\n<br/>\nGood instinct.  You could hire someone to come and play with him at your house, while you&#39;re there.  Someone  young, maybe.  A young-teens girl who could carry him around and sing to him and play with toys and distract him.    He&#39;s too little to play with other kids, but he&#39;s not too little to play with an older child or teen.<br/>\n<br/>\n-=-On the other hand, I could use the free time and he could use the interaction with other children.-=-<br/>\n<br/>\nNot such good instinct.  If you have free time, and he&#39;s in a stressful situation the &quot;free time&quot; might be way too costly.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Child care","postDate":"1311251740","msgId":61861,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRGNDNGMkY1LUFGRjQtNDdGNC1BMTU5LTBENzgyMEQ3OTZCNEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGowOTJqbSszc2x2QGVHcm91cHMuY29tPg==","referencesHeader":"PGowOTJqbSszc2x2QGVHcm91cHMuY29tPg=="},"prevInTopic":61858,"nextInTopic":61863,"prevInTime":61860,"nextInTime":61862,"topicId":61858,"numMessagesInTopic":0,"msgSnippet":"... What unschoolers do for their kids doesn t make it unschooling. What makes it unschooling is providing what *your* child enjoys. Not what some standard 18","messageBody":"<div id=\"ygrps-yiv-1659043136\">On Jul 21, 2011, at 7:29 AM, christinebgilbert wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; And then our son will have kids to play with... which I think he  <br/>\n&gt; would really like.<br/>\n<br/>\n </span></blockquote>What unschoolers do for their kids doesn&#39;t make it unschooling. What  <br/>\nmakes it unschooling is providing what *your* child enjoys. Not what  <br/>\nsome standard 18 mo kid is supposed to enjoy, but *your* 18 mo child.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I have never left him with anyone else and I&#39;m quite torn about the  <br/>\n&gt; idea that he might want me and I wouldn&#39;t be there.<br/>\n<br/>\n </span></blockquote>At 18 mos kids are often looking out at the world and curious about  <br/>\nwhat they see and touch. But they&#39;re looking out from the safety you  <br/>\nprovide. Take you out of the world even temporarily is going to be  <br/>\nupsetting for *most* 18 mos.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; he could use the interaction with other children.<br/>\n<br/>\n </span></blockquote>Big huge convention to question there.<br/>\n<br/>\nMost 18 mos don&#39;t play with other kids. They interact. Other kids can  <br/>\nbe fascinating moving toys to *some* 18 mo kids. :-) That fascination  <br/>\n*looks* like a need for interaction. But other similar age kids don&#39;t  <br/>\nrespond obediently like toys! Rather irritatingly they have their own  <br/>\nneeds and agendas that your child may periodically be seen as an  <br/>\nobstacle to. Like playing with a toy they want. Like making noises  <br/>\nthey find irritating. Like just existing ;-)<br/>\n<br/>\nWhat can work is bringing in a child of whatever age who loves playing  <br/>\nwith babies. :-)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; On the other hand, I could use the free time and<br/>\n<br/>\n </span></blockquote>Which, from your child&#39;s point of view, will feel like &quot;You&#39;re  <br/>\ninconvenient and preventing me from doing the things I really want to  <br/>\ndo.&quot;<br/>\n<br/>\nWhen he&#39;s older he will be developmentally able to understand that  <br/>\nothers have needs. And he won&#39;t fight against that concept if he feels  <br/>\nhe doesn&#39;t have to struggle to get his needs met, if he feels his  <br/>\nbucket is full to overflowing. If he feels his needs are being shoved  <br/>\naside (like being made to go to daycare on a day when he doesn&#39;t want  <br/>\nto because you have other plans, because you&#39;ve been looking forward  <br/>\nto the time away from him) for your needs, the natural human response  <br/>\nis to fight against you to get his needs met. He will embrace the  <br/>\nconcept of others having needs (when he&#39;s developmentally able) when  <br/>\nhe knows you treat his needs seriously and put effort into  <br/>\ninconveniencing him as little as possible (and sweetening the deal  <br/>\nwith something he enjoys when you do need to inconvenience him).<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Just wondering if anyone on the list has done this and if they  <br/>\n&gt; regretted it or loved it (or somewhere in between).<br/>\n<br/>\n </span></blockquote>If you asked on the list if anyone had taken their child to the zoo  <br/>\nand whether they loved it or regretted it, the answers would be as  <br/>\nvaried as kids. Some kids love or are oblivious to crowds. Some hate  <br/>\nthem. Some enjoy it for 5 minutes. Some for 3 hours. Some kids hate  <br/>\ngetting dirty. Some kids embrace their inner Pig Pen.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":426422274,"authorName":"christinebgilbert","from":"&quot;christinebgilbert&quot; &lt;christine.gilbert@...&gt;","profile":"christinebgilbert","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Child care","postDate":"1311247798","msgId":61858,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGowOTJqbSszc2x2QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":61861,"prevInTime":61857,"nextInTime":61859,"topicId":61858,"numMessagesInTopic":0,"msgSnippet":"Do any of you guys use any child care?  Our son is 16 mo and we re in Thailand.  My husband and I both work from home, but we take turns working, so one of us","messageBody":"<div id=\"ygrps-yiv-1679642015\">Do any of you guys use any child care?  Our son is 16 mo and we&#39;re in Thailand.  My husband and I both work from home, but we take turns working, so one of us is always with our son, so we thought about getting some help.  Maybe daycare for a few hours a day, every other day?  And then our son will have kids to play with... which I think he would really like.<br/>\n<br/>\nI have never left him with anyone else and I&#39;m quite torn about the idea that he might want me and I wouldn&#39;t be there.  On the other hand, I could use the free time and he could use the interaction with other children.<br/>\n<br/>\nJust wondering if anyone on the list has done this and if they regretted it or loved it (or somewhere in between).</div>","specialLinks":[]}],"prevTopicId":61845,"nextTopicId":61889}}