{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":70316959,"authorName":"AimeeL73@cs.com","from":"AimeeL73@...","profile":"aimeel73","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] had a crappy day","postDate":"1060793802","msgId":78707,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1OS4yMmY5YjkwMi4yYzZiYzdjYUBjcy5jb20+"},"prevInTopic":78695,"nextInTopic":0,"prevInTime":78706,"nextInTime":78708,"topicId":78661,"numMessagesInTopic":0,"msgSnippet":"... Hugs, Maureen.  I m sorry, not only that you had a bad day, but that your kids did, too.  Hug them a lot for me, ok? ;-) As time goes on, maybe you won t","messageBody":"<div id=\"ygrps-yiv-680203135\"><a rel=\"nofollow\" target=\"_blank\" href=\"mailto:tmthomas@...\">tmthomas@...</a> writes: <br/>\n<blockquote><span title=\"ireply\"> &gt; When I went back to pick up the other kids my other son had to leave in his <br/>\n&gt; swim gear cause his shoes and clothes were taken. Yikes!!! Having highly <br/>\n&gt; sensitive children is hard enough, being an unschooler already leaves me feeling <br/>\n&gt; different and sometimes isolated and then all this. I am sure tomorrow will <br/>\n&gt; look better but today was really a bummer.<br/>\n&gt; <br/>\n&gt; Maureen<br/>\n<br/>\n<br/>\n </span></blockquote>Hugs, Maureen.  I&#39;m sorry, not only that you had a bad day, but that your <br/>\nkids did, too.  Hug them a lot for me, ok? ;-)<br/>\n<br/>\nAs time goes on, maybe you won&#39;t feel so isolated and different.  I&#39;ve always <br/>\nstuggled with those feelings too, as I have always been a strange one, <br/>\nmyself.  We&#39;re always here on list for you, don&#39;t forget! <br/>\n<br/>\nYou&#39;ll become more confident in the path. ( This I got from my spiritual <br/>\nlife, but that lesson has leaked into unschooling)  You&#39;ll know what you are, and <br/>\nwhat you&#39;re doing, and that it&#39;s all good. Even days like you had are <br/>\nexperiences you and the kids will learn from.  That&#39;s unschooling for you, you can&#39;t <br/>\nchoose the lessons :-) <br/>\n<br/>\n I have to say, thank goodness they&#39;re not in schools, dealing with these <br/>\nkinds of situations every day.    Your kids will be safe with you at home, and <br/>\ncan process these painful experiences, and hopefully move on.  In my life, when <br/>\nI came home crying from being bullied and made fun of, my mom cried with me, <br/>\nbut sent me back to school the next day.  Blessings to you for knowing and <br/>\nacting on other options!  <br/>\n<br/>\n~Aimee<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":93802122,"authorName":"Tim and Maureen","from":"Tim and Maureen &lt;tmthomas@...&gt;","profile":"wisdom0007","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"had a crappy day","postDate":"1060791258","msgId":78695,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwM2EwMWMzNjFiNSRmMmY2MmJhMCQxODU1NDUxOEBjYS5zaGF3Y2FibGUubmV0Pg=="},"prevInTopic":78685,"nextInTopic":78707,"prevInTime":78694,"nextInTime":78696,"topicId":78661,"numMessagesInTopic":0,"msgSnippet":"Thank you for the kind and supportive replies.It is the next day and of course I feel a little bit better. My son is watching TV and just asked me how many","messageBody":"<div id=\"ygrps-yiv-1144803921\">Thank you for the kind and supportive replies.It is the next day and of course I feel a little bit better. My son is watching TV and just asked me how many days are in a year. He is trying to figure out how many hours he has been on this earth. You just never know where the learning is going to take place. This life is just so darn cool. My kids and I had a discussion about different ways we could have handled the unkindness we encountered. I confronted it and even doing that did not ensure that we were heard and respected. One daughter had different biting remarks we could have used, one son suggested just ignoring and walking away, another suggested asking the lifeguard for help....It gave us lots to think about and we concluded you had to decide what would leave you feeling the best at the end and that it might be different each time and for each person..<br/>\n<br/>\nThanks for hearing me.<br/>\n<br/>\nMaureen<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":56051484,"authorName":"grlynbl@aol.com","from":"grlynbl@...","profile":"tbb1967","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] had a crappy day","postDate":"1060783428","msgId":78685,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFhNS4xN2VjMThjZS4yYzZiOWY0NEBhb2wuY29tPg=="},"prevInTopic":78679,"nextInTopic":78695,"prevInTime":78684,"nextInTime":78686,"topicId":78661,"numMessagesInTopic":0,"msgSnippet":"That was definitely a totally crappy day.  Crappy for the whole family. Just take comfort in the fact that your children do not have to have days that suck","messageBody":"<div id=\"ygrps-yiv-974791000\">That was definitely a totally crappy day.  Crappy for the whole family.     <br/>\nJust take comfort in the fact that your children do not have to have days that <br/>\nsuck like that all the time.   I am sending warm wishes for more WONDERFUL <br/>\ndays ahead.   :-)<br/>\n<br/>\nYou know, I feel ya,  3 of my children are overweight ( as am I)  My children <br/>\nstill feel very self conscious about thier weight.. even among friends and <br/>\nfamily, they are reluctant to wear a bathing suite ( esp my 13 yo daughter)    <br/>\nAlthough they have all endured some teasing at school about thier weight, no <br/>\none has ever DARED to tease them in front of me.  Maybe they are afraid I would <br/>\nsit on them.. LOL.   That was some audacity for those kids to be so rude with <br/>\na parent accompanying the children.  Usually the bullies do all the bullying <br/>\nbehind adults&#39; backs.  I honestly do not know how I would have handled that <br/>\nsituation.  Probably not good.  some kid would probably have gotten an earful <br/>\nfrom me.   <br/>\n<br/>\nLook forward to brighter days.. soon the school kids will be back in school.. <br/>\nand you can enjoy the water park( and other kid attracting activities) to <br/>\nyour hearts content!  School started back last week here, and we all celebrated!  <br/>\nYAYYY, schools back, schools back!  LOL.. first time we have ever been  happy <br/>\nto see it come around.<br/>\n<br/>\nTeresa<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1658973,"authorName":"Barb Eaton","from":"Barb Eaton &lt;homemama@...&gt;","profile":"homesmama","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] had a crappy day","postDate":"1060782667","msgId":78679,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJCNUZCQThCLjFCODU0JWhvbWVtYW1hQGluZmluZXQuY29tPg==","inReplyToHeader":"PDAwMjUwMWMzNjE1NCRkZTc0MGI0MCQxODU1NDUxOEBjYS5zaGF3Y2FibGUubmV0Pg=="},"prevInTopic":78675,"nextInTopic":78685,"prevInTime":78678,"nextInTime":78680,"topicId":78661,"numMessagesInTopic":0,"msgSnippet":"{{{{{{Maureen & Family}}}}}}}}}}}}","messageBody":"<div id=\"ygrps-yiv-1943730182\">{{{{{{Maureen & Family}}}}}}}}}}}}</div>","specialLinks":[]},{"userId":74604204,"authorName":"Deborah Lewis","from":"Deborah Lewis &lt;ddzimlew@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] had a crappy day","postDate":"1060777464","msgId":78675,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMwODEzLjA2MzE1OC4xNjg4LjAuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":78661,"nextInTopic":78679,"prevInTime":78674,"nextInTime":78676,"topicId":78661,"numMessagesInTopic":0,"msgSnippet":"*** today was really a bummer.*** If your kids were going to school they d be faced with that kind of thing every day. Your kids will be ok because their home","messageBody":"<div id=\"ygrps-yiv-1936547261\">*** today was really a bummer.***<br/>\n<br/>\nIf your kids were going to school they&#39;d be faced with that kind of thing<br/>\nevery day.  <br/>\nYour kids will be ok because their home is a sanctuary from that sea of<br/>\nemotional injury at school.   If they were constant victims of it at<br/>\nschool it could wound them deeply, but you&#39;ve given your kids a better<br/>\nlife where they&#39;ve had minimal exposure to the meanness and harassment.  <br/>\nThey&#39;ll be ok. <br/>\n<br/>\n***I have kids sensitive to noise, lights, and crowds. They are also<br/>\nsensitive to the teasing, bullying that can happen with strangers.***<br/>\n<br/>\nAny sensible person is sensitive to those things!  You know, it should be<br/>\nconsidered normal for people to be sensitive to and upset by mean natured<br/>\nteasing and bullying from anyone, not just strangers.  Instead, at<br/>\nschool,  that behavior is considered normal.  Many of the kids taking<br/>\nthat crap at school have parents who&#39;ve told them it&#39;s normal and<br/>\neveryone goes through it.  I&#39;d say your kids are damn smart and well<br/>\nadjusted.   And a parent who recognizes that behavior as abusive and<br/>\nprotects her kids from it is too. <br/>\n<br/>\nDeb L</div>","specialLinks":[]},{"userId":93802122,"authorName":"Tim and Maureen","from":"Tim and Maureen &lt;tmthomas@...&gt;","profile":"wisdom0007","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"had a crappy day","postDate":"1060749562","msgId":78661,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMjUwMWMzNjE1NCRkZTc0MGI0MCQxODU1NDUxOEBjYS5zaGF3Y2FibGUubmV0Pg=="},"prevInTopic":0,"nextInTopic":78675,"prevInTime":78660,"nextInTime":78662,"topicId":78661,"numMessagesInTopic":0,"msgSnippet":"I am feeling low and feeling like an unschooling freak. Today we went to the swimming pool. Normally we don t go when school is out because I have kids","messageBody":"<div id=\"ygrps-yiv-178969272\">I am feeling low and feeling like an unschooling freak. Today we went to the swimming pool. Normally we don&#39;t go when school is out because I have kids sensitive to noise, lights, and crowds. They are also sensitive to the teasing, bullying that can happen with strangers. <br/>\nWe were in line for a ride on a water toy and two kids kept pushing in front of us and others. My kids and niece told them to stop then after numerous times of being ignored I stepped in. After arguing with me they finally backed down. But they were angry so they made quiet subtle remarks about my daughters weight. They were brother and sister and kept pushing each other, yelling and fighting. This became to much for my daughter(13) so she moved away. Mt son was having an unforeseen hypoglycaemic moment and was bursting into tears easily so I decided to get him out and take him home and come back for the others later. He is also overweight and this has started to be noticed by others only recently(he is 11). In the changeroom some boys from the YMCA day program came in and started laughing at him because he was naked. He held it together until we got in the car.This was painful and sad for both of us and sometimes I just get exhausted feeling from his moments of not coping well and then to have this on top of it really hit me hard today. When I went back to pick up the other kids my other son had to leave in his swim gear cause his shoes and clothes were taken. Yikes!!! Having highly sensitive children is hard enough, being an unschooler already leaves me feeling different and sometimes isolated and then all this. I am sure tomorrow will look better but today was really a bummer.<br/>\n<br/>\nMaureen<br/>\nTim and Maureen Thomas<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.stillwaters.ca\">http://www.stillwaters.ca</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":78706,"nextTopicId":78285}}