{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":7143857,"authorName":"jrossedd@aol.com","from":"jrossedd@...","profile":"jrossedd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Chores and Lessons and Limits","postDate":"1068434977","msgId":84323,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGFiLjM0OGQ1NGE5LjJjZTA2MDIxQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":84322,"nextInTime":84324,"topicId":84323,"numMessagesInTopic":0,"msgSnippet":"Okay, but isn t it true that as adults, we have to work in order to achieve material rewards? Any material reward is, after all, the fruit of previously-done","messageBody":"<div id=\"ygrps-yiv-777373900\">Okay, but isn&#39;t it true that as adults, we have to work in order to achieve <br/>\nmaterial rewards? Any material reward is, after all, the fruit of <br/>\npreviously-done labor. You have to do the work (even if it&#39;s brain-work <br/>\nrather than physical work, or the foregoing of consumption in the present <br/>\nso you can apply capital to create more wealth in the future) before the <br/>\nreward even exists -- or else you are enjoying the fruits of someone else&#39;s <br/>\nlabor (or sacrifice).<br/>\nOtherwise it seems we are teaching that manna falls from heaven and the <br/>\nworld owes us a living.<br/>\n<br/>\n<br/>\n<br/>\n       Someone asked about how to make a chores chart on our local hs list <br/>\nlast week. It started a similar discussion to this one, complete with Alfie <br/>\nKohn, unschooling and unchores Here is part of how I answered a post like Scott&#39;s:<br/>\n<br/>\n              If the main need is for a clean house and/or parental survival, <br/>\nthat&#39;s one thing, and have at it with my blessing &lt;g&gt;. I am not the FlyLady <br/>\nand far be it from me to give cleaning advice. Do what you need to do, and <br/>\nmaybe a chore list will help you keep the dirt and clutter at bay, keep the family <br/>\nfunctioning. I expect they had many lists in the Cheaper By The Dozen <br/>\nhousehold (actually, in real-life, Frank Gilbreth was an efficiency expert forever <br/>\nexperimenting on his own children, testing theories of factory productivity. The <br/>\nkids seem to have turned out okay, but he had an early heart attack and died, <br/>\nleaving them fatherless. Not very efficient in the long run imo.)<br/>\n<br/>\n       Just don&#39;t say it&#39;s all for the child&#39;s benefit, so they will be <br/>\nmoral, hygenic and mannerly dirt-haters, or obedient and God-fearing, or whatever. <br/>\nThose are very different goals that a chore list may not serve very well, imo.<br/>\n<br/>\n       All I mean is that I find parenting and learning are so often <br/>\ncounterintuitive. How did I help my children not fear the dark of their rooms at <br/>\nnight? By keeping it light and letting them feel safe rather than afraid, on their <br/>\ntimetable instead of mine. How did I equip them to trust others to hold them? <br/>\nBy holding them close as much as they wanted, staying with them and not <br/>\nforcing them on strangers. How do you get a child to share? What worked for us was <br/>\nmaking sure there was plenty of everything to go around so no one grew up <br/>\nfeeling deprived or defensive or under attack. We let them feel empowered and <br/>\nsecure, never asked or expected them to share, and they now are generous kids. By <br/>\nonly doing it when they wanted to, it felt good and they really learned to like <br/>\nit. . .<br/>\n<br/>\n       . . .We don&#39;t have to emulate schoolish survival tools if our <br/>\nchildren&#39;s learning is all we are worried about. Those silly lists of what children <br/>\nmust be made to do, to learn all the things they must be made to learn -- if it <br/>\nworked it would be one thing, but I an dubious. I&#39;d wager that about the same <br/>\npercentage of children really &quot;get&quot; algebra today as ever did, or really love <br/>\nto read, and no more. I hate worksheets and lists of things to learn or books <br/>\nto read unless they are my own, for my own purposes. Then I love them and make <br/>\nthem endlessly. &lt;g&gt;<br/>\n<br/>\n       It would be very logical (but apparently not true) to reason that if <br/>\nyou eventually want a grown man to pick up his own socks and dishes, then you <br/>\nshould make a chore chart for him as a five-year-old boy and get him in the <br/>\nhabit early. But does it actually work? What might work as well or better?<br/>\n<br/>\n       Personally, I think the real value of organizing or scheduling as a <br/>\ntool is in teaching children to make the process their own and use it for their <br/>\nown benefit. (Same with the value of the actual chores - otherwise it is <br/>\neasier to do it myself.) Like a hammer or screwdriver, any tool can be used or <br/>\nmisused, and people can benefit, get hurt, or decide never touch it or anything <br/>\nassociated with it ever again!<br/>\n<br/>\n       Polishing silver, changing sheets and pillowcases, et cetera can be <br/>\nfun and also satisfying, when we let children discover it for themselves. I used <br/>\nto love to iron my father&#39;s shirts, but I didn&#39;t have to. I only did it when <br/>\nit felt good, and the more I did it, the better I got at it, the better it <br/>\nfelt, and the more I did it! My mom of course was smart enough to milk it for all <br/>\nit was worth! :)<br/>\n<br/>\n       All wasted of course -- we live in a no-iron world now and I haven&#39;t <br/>\nironed for my own family, ever! But things run reasonably well around here, <br/>\nexcept when I spend too much time on the computer (we don&#39;t have lists and limits <br/>\nfor that either &lt;g&gt;) --  JJ</div>","specialLinks":[]}],"prevTopicId":83965,"nextTopicId":84334}}