{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":8378727,"authorName":"zenmomma2kids","from":"&quot;zenmomma2kids&quot; &lt;zenmomma@...&gt;","profile":"zenmomma2kids","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Math games waste time?","postDate":"1067790795","msgId":83629,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJvM2JrYis3c2ZkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJBMUVEODk0LTBBMkMtMTFEOC05RDYwLTAwMEE5NUUyOTJDNkBtYWMuY29tPg=="},"prevInTopic":83430,"nextInTopic":0,"prevInTime":83628,"nextInTime":83630,"topicId":83387,"numMessagesInTopic":0,"msgSnippet":"... the game more fun is also a way of examining how the game works and why it plays out the way it does and that is very interesting and useful to think","messageBody":"<div id=\"ygrps-yiv-418243725\"><blockquote><span title=\"ireply\">&gt;&gt;Everybody wants the game to be fun - fooling with the rules to make <br/>\n </span></blockquote>the game more fun is also a way of examining how the game works and <br/>\nwhy it plays out the way it does and that is very interesting and <br/>\nuseful to think about. But - I digress.... &lt;G&gt; &gt;&gt;<br/>\n<br/>\nOooh Pam! I&#39;ve been thinking about you and your suggestions about <br/>\nchanging game rules to see how the dynamics of the game change. I <br/>\nfound an alternate set of &quot;adult&quot; (yuck ;-p) rules in the directions <br/>\nof our Sorry game. It involved getting a hand of 5 cards rather than <br/>\ndrawing a card to move on each turn. This enabled, no forced, you to <br/>\nstrategize in a completely different way. It *did* change so much <br/>\nabout the game and its outcome. We LOVED it.<br/>\n<br/>\nLife is good.<br/>\n~Mary</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Math games waste time?","postDate":"1067515392","msgId":83430,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJCQzY2ODMwLjIwMzZFJWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDAxNWMwMWMzOWRmMCQwYTBkOTUwMCQyZmE3NGVkNUBST0JFUlRCQ1hHUzBGTD4="},"prevInTopic":83403,"nextInTopic":83629,"prevInTime":83429,"nextInTime":83431,"topicId":83387,"numMessagesInTopic":0,"msgSnippet":"... It isn t individuality so much as wanting to spell better which can happen with any method. If a child has a reason to spell better -- like wanting someone","messageBody":"<div id=\"ygrps-yiv-709049327\">on 10/29/03 2:41 AM, The Scanlons at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:scanlon36@...\">scanlon36@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I can see a child coming along in his spelling in the home environment, but I<br/>\n&gt; can see so many kids in school just floating on, never realizing that their<br/>\n&gt; spelling is so atrocious and that they can&#39;t really communicate in writing.<br/>\n&gt; <br/>\n&gt; Isn&#39;t it the individuality of unschooling that produces results and not just<br/>\n&gt; the kinder, gentler methods?<br/>\n<br/>\n </span></blockquote>It isn&#39;t individuality so much as wanting to spell better which can happen<br/>\nwith any method. If a child has a reason to spell better -- like wanting<br/>\nsomeone else to be able to read what they write or just the need to do it<br/>\nthe right way then they&#39;ll be motivated to figure out standard spelling.<br/>\n<br/>\nThe advantage of unschooling is that kids get to write what they want for<br/>\ntheir own purposes, and most real writing -- though not all -- has a built<br/>\nin need for standard spelling.<br/>\n<br/>\nIf a teacher can provide opportunities for those same feelings, then kids<br/>\nwill be motivated to spell better. The problem in school, though, is that<br/>\nunless a school is very enlightened, the goal isn&#39;t to provide opportunities<br/>\nfor kids to write when they need to write, but to get kids to write. So that<br/>\nartificial need to &quot;write for the sake of writing&quot; can be a big millstone<br/>\nfor kids and teachers. There isn&#39;t any motivation to improve the spelling in<br/>\nan assigment that someone doesn&#39;t want to write and doesn&#39;t see a purpose in<br/>\nwriting.<br/>\n<br/>\nJoyce<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":141316284,"authorName":"pam sorooshian","from":"pam sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Math games waste time?","postDate":"1067444822","msgId":83403,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBMUVEODk0LTBBMkMtMTFEOC05RDYwLTAwMEE5NUUyOTJDNkBtYWMuY29tPg==","inReplyToHeader":"PDAxNWMwMWMzOWRmMCQwYTBkOTUwMCQyZmE3NGVkNUBST0JFUlRCQ1hHUzBGTD4="},"prevInTopic":83396,"nextInTopic":83430,"prevInTime":83402,"nextInTime":83404,"topicId":83387,"numMessagesInTopic":0,"msgSnippet":"... Better than lecture/practice/test/grade? Yes. ... Same old same old what? Same old, to me, means teacher standing in front of class and giving a lecture on","messageBody":"<div id=\"ygrps-yiv-1834242484\">On Tuesday, October 28, 2003, at 11:41  PM, The Scanlons wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Do you think that math games and &quot;invented spelling&quot; and other <br/>\n&gt; &quot;non-conventional learning methods&quot; work well in an institutional <br/>\n&gt; environment?<br/>\n<br/>\n </span></blockquote>Better than lecture/practice/test/grade? Yes.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;   I see how they are marvelous for the one-on-one (or <br/>\n&gt; family-on-family) numbers in a household, but when you move it to <br/>\n&gt; school, don&#39;t you wind up with the same old same old?<br/>\n<br/>\n </span></blockquote>Same old same old what? Same old, to me, means teacher standing in <br/>\nfront of class and giving a lecture on how to multiply fractions by <br/>\nfirst multiplying the numerators and then the denominators. Teacher <br/>\nlectures, demonstrates, and hands out exercises to do in class and then <br/>\nhomework to do outside of class and then a test.  Most classrooms and <br/>\nmost homeschools do some variation of that, when it comes to math.<br/>\n<br/>\nTaking a different approach in which kids learn math through <br/>\ndiscussion, games, and real-life experiences is very different - <br/>\nwhether in a classroom environment or a homeschooling family <br/>\nenvironment. Not going to be the same old same old, not at all.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  Won&#39;t the kids who are ready to play the more advanced games come out <br/>\n&gt; on top and the kids who start from a lower understanding level will <br/>\n&gt; just be the constant losers in the games?<br/>\n<br/>\n </span></blockquote>I don&#39;t really want to spend too much time talking about classrooms <br/>\nhere - that&#39;s not unschooling and could lead us off into many many <br/>\nposts on classroom learning situations. But, this idea, that the people <br/>\nwho are more advanced would always win and less advanced always lose <br/>\n--- why would you think that is more true in a classroom than among <br/>\nhomeschoolers?  It isn&#39;t. Games are usually made more fun by adding an <br/>\nelement of luck, playing in teams, making questions of varying degrees <br/>\nof difficulty, including all KINDS of games so that some people are <br/>\nbetter at some types than others, finding ways of imposing handicaps on <br/>\nhighly skilled players, and so on. AND - there are many many <br/>\ncooperative games and many games that can easily be turned into <br/>\ncooperative games.  We play the game SET, for example, as a cooperative <br/>\ngame a lot of the time, by just all of us trying to find sets, not <br/>\ncompeting against each other to be the fastest to find them. We started <br/>\nthis because my middle daughter was so TERRIBLE at this game and the <br/>\nyoungest was so good at it. Now when one person is not finding any <br/>\nsets, we give them hints and when that person finally gets one we all <br/>\ncheer. OR - we made the rule that the youngest kid (the one good at it) <br/>\nhad to find sets that were of a certain type while the rest of us could <br/>\nfind any kind of set. Everybody wants the game to be fun - fooling with <br/>\nthe rules to make the game more fun is also a way of examining how the <br/>\ngame works and why it plays out the way it does and that is very <br/>\ninteresting and useful to think about. But - I digress.... &lt;G&gt; No <br/>\nreason that the kids playing games in a school setting can&#39;t do the <br/>\nsame kind of thing, though, and a teacher could easily model that and <br/>\nencourage and support it.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I used to think that invented spelling was a bunch of garbage.  What <br/>\n&gt; do you mean, let kids write stuff however they want???  Let them think <br/>\n&gt; they&#39;re doing everything a-ok??  That&#39;s nuts!  But things change when <br/>\n&gt; you look into your son&#39;s shining, expectant eyes when he&#39;s written <br/>\n&gt; something the way it sounds to him, but it is spelled completely <br/>\n&gt; wrong.  Even though you don&#39;t tell him, he figures out that he got the <br/>\n&gt; words wrong and he shuts down and doesn&#39;t write anything for a few <br/>\n&gt; months.  This gets you thinking that maybe those crazy people were <br/>\n&gt; onto something.  I can see a child coming along in his spelling in the <br/>\n&gt; home environment, but I can see so many kids in school just floating <br/>\n&gt; on, never realizing that their spelling is so atrocious and that they <br/>\n&gt; can&#39;t really communicate in writing.<br/>\n<br/>\n </span></blockquote>They don&#39;t have to correct spelling, much less GRADE on it, in school, <br/>\nto help kids learn to spell better. Kids working on real projects that <br/>\nthey care about will ask for help with spelling. Teachers can suggest <br/>\nthat kids write without worrying about spelling (for kids that DO <br/>\nworry, tell them to underline the words they aren&#39;t sure about and just <br/>\ncome back to them later) and then talk about editing for publication <br/>\nand how they can proofread before they put all their poems into books <br/>\nor before the website they created is published on the internet, etc. <br/>\nAt that point kids can go through and help each other with spelling - <br/>\nthe kids will know which other kids spell really well.  Charts of words <br/>\nthat are commonly misspelled can be put up on the wall, computers will <br/>\nspelling checkers can be available, etc.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Isn&#39;t it the individuality of unschooling that produces results and <br/>\n&gt; not just the kinder, gentler methods?<br/>\n&gt;<br/>\n </span></blockquote>Kindler gentler certainly makes for increased real learning ESPECIALLY <br/>\nwhen it is math concepts you&#39;re talking about. Rigid <br/>\nlecture/practice/test/grade methods can be highly individualized and <br/>\ncan still be completely void of discussion and not involve any &quot;playing <br/>\naround&quot; with ideas. This can result in the kind of &quot;good students&quot; I <br/>\nsee in my college classes - those who can do all the computations but <br/>\nare clueless about when to do them, what they are good for, what they <br/>\nmean, how to finesse tricky situations by changing the methods a bit, <br/>\nhow to interpret results beyond a calculated numerical answer, etc.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n </span></blockquote>pam</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Math games waste time?","postDate":"1067442719","msgId":83396,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFlMi4xMjU2YzM3My4yY2QxM2MxZkBhb2wuY29tPg=="},"prevInTopic":83387,"nextInTopic":83403,"prevInTime":83395,"nextInTime":83397,"topicId":83387,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/29/03 12:05:34 AM, scanlon36@onetel.net.uk writes: ","messageBody":"<div id=\"ygrps-yiv-709053\">In a message dated 10/29/03 12:05:34 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:scanlon36@...\">scanlon36@...</a> writes:<br/>\n<br/>\n&lt;&lt; when you move it to school, don&#39;t you wind up with the same old same old?  <br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;<br/>\n<br/>\n </span></blockquote>Depends on the teacher, depends on the kids.<br/>\nWhen I taught I used more games than not.  I never used the textbooks they <br/>\nhad for us--the boxes sat sealed in the corner.<br/>\n<br/>\nThe same old same old problem with schools is kids are there against their <br/>\nwill.<br/>\n<br/>\n&lt;&lt;Won&#39;t the kids who are ready to play the more advanced games come out on <br/>\ntop and the kids who start from a lower understanding level will just be the <br/>\nconstant losers in the games?  &gt;&gt;<br/>\n<br/>\nNot in my experience.<br/>\nYour objection is to competition, not games.  There are ways to play that <br/>\ndon&#39;t involve sorting people into winners and losers.<br/>\n<br/>\n&lt;&lt; but I can see so many kids in school just floating on, never realizing <br/>\nthat their spelling is so atrocious and that they can&#39;t really communicate in <br/>\nwriting.&gt;&gt;<br/>\n<br/>\nKids in school have the same opportunity as kids at home to see examples of <br/>\ncorrectly spelled writing, and to come on times when someone has misunderstood <br/>\nwhat they&#39;ve written.<br/>\n<br/>\nAny atrocious speller you know in your life probably went to school where <br/>\nthey were taught phonics and spelling rules.  My husband could hardly spell when <br/>\nI met him (he was 21) but he COULD communicate in writing very well.  He just <br/>\nneeded an editor.  Over the years his spelling improved, slowly but surely, <br/>\nbecause the pressure of grades and school and red pencil marks was gone and he <br/>\ncame to care.<br/>\n<br/>\n&lt;&lt;Isn&#39;t it the individuality of unschooling that produces results and not <br/>\njust the kinder, gentler methods?&gt;&gt;<br/>\n<br/>\nIt seems there&#39;s another question underneath your question.<br/>\n<br/>\nDo you think the unkind, ungentle methods would &quot;produce results&quot; if used <br/>\nindividually?<br/>\nThat&#39;s what teachers think--they say if class sizes were smaller their <br/>\nresults would be better.  That&#39;s what curriculum buyers think.  They can do school <br/>\nwith one child in one grade and it will just flow along merrily.<br/>\n<br/>\nThe word &quot;just&quot; is problematical.  &quot;Isn&#39;t it the individuality of unschooling <br/>\nthat produces results and not just the kinder, gentler methods?&quot;  &quot;JUST&quot;?<br/>\n<br/>\nI don&#39;t think anyone is claiming any one thing is &quot;just&quot; excusively the only <br/>\nfactor.   If I had to pick a factor, love might be the most important one.   <br/>\nBut if I had to pick its cousin, that would be freedom.<br/>\n<br/>\nChildren in most schools have no freedom of movement or attendance.  They <br/>\ncan&#39;t even go to the toilet in freedom.<br/>\n<br/>\nSome homeschoolers have no freedom either.  Kids do what they&#39;re told when <br/>\nthey&#39;re told.  They sit where and how they&#39;re told and they don&#39;t stop until <br/>\nthey&#39;re given permission.   Individuality only makes that worse: it makes it <br/>\npersonal.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":133144498,"authorName":"The Scanlons","from":"&quot;The Scanlons&quot; &lt;scanlon36@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Math games waste time?","postDate":"1067413277","msgId":83387,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxNWMwMWMzOWRmMCQwYTBkOTUwMCQyZmE3NGVkNUBST0JFUlRCQ1hHUzBGTD4="},"prevInTopic":0,"nextInTopic":83396,"prevInTime":83386,"nextInTime":83388,"topicId":83387,"numMessagesInTopic":0,"msgSnippet":"All, Do you think that math games and invented spelling and other non-conventional learning methods work well in an institutional environment?  I see how","messageBody":"<div id=\"ygrps-yiv-150738658\">All,<br/>\n<br/>\nDo you think that math games and &quot;invented spelling&quot; and other &quot;non-conventional learning methods&quot; work well in an institutional environment?  I see how they are marvelous for the one-on-one (or family-on-family) numbers in a household, but when you move it to school, don&#39;t you wind up with the same old same old?  Won&#39;t the kids who are ready to play the more advanced games come out on top and the kids who start from a lower understanding level will just be the constant losers in the games?  <br/>\n<br/>\nI used to think that invented spelling was a bunch of garbage.  What do you mean, let kids write stuff however they want???  Let them think they&#39;re doing everything a-ok??  That&#39;s nuts!  But things change when you look into your son&#39;s shining, expectant eyes when he&#39;s written something the way it sounds to him, but it is spelled completely wrong.  Even though you don&#39;t tell him, he figures out that he got the words wrong and he shuts down and doesn&#39;t write anything for a few months.  This gets you thinking that maybe those crazy people were onto something.  I can see a child coming along in his spelling in the home environment, but I can see so many kids in school just floating on, never realizing that their spelling is so atrocious and that they can&#39;t really communicate in writing.<br/>\n<br/>\nIsn&#39;t it the individuality of unschooling that produces results and not just the kinder, gentler methods?<br/>\n<br/>\nThanks for your insights!<br/>\n<br/>\nSandy<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":83386,"nextTopicId":83631}}