{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":126884268,"authorName":"HMSL2@aol.com","from":"HMSL2@...","profile":"dobsiedoe","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:New photos long:)","postDate":"1150942140","msgId":26155,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJjNy45YmEzNDA0LjMxY2I1NWJjQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":26154,"nextInTime":26156,"topicId":26155,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1822264247\">&lt;&lt;Ten new photos in the past week, yahoo said. I  went to see whose they were.<br/>\n<br/>\n_<a rel=\"nofollow\" target=\"_blank\" href=\"http://ph.groups.http://ph.http://ph.groupshttp://ph.grhttp://ph.g_\">http://ph.groups.http://ph.http://ph.groupshttp://ph.grhttp://ph.g_</a> <br/>\n(<a rel=\"nofollow\" target=\"_blank\" href=\"http://ph.groups.yahoo.com/group/AlwaysLearning/photos/browse/3253)\">http://ph.groups.yahoo.com/group/AlwaysLearning/photos/browse/3253)</a> <br/>\n<br/>\nTen right there. Thanks! (Tell us stories if you want  to.)<br/>\n<br/>\nSandra&gt;&gt;<br/>\n<br/>\n******************************************************************************<br/>\n***<br/>\n <br/>\n <br/>\nThose would be mine:) I added a few (11)more so this is a lil long but  <br/>\nhere&#39;s part of our past year..<br/>\n <br/>\n1 Cassidy is one showing off her new lost teeth. We read a great book about  <br/>\na sister and brother loosing teeth a few weeks ago. The older sister was <br/>\nloosing  teeth and the lil brother was sad he didn&#39;t so he pretended he lost a <br/>\ntooth (he  put corn under his pillow). The tooth fairy came and welcomed them to <br/>\nthe place  where teeth go. In the end a machine rejected the lil brothers fake <br/>\ntooth and  the tooth fairy explained that some day he too would loose his <br/>\nteeth when  they were ready. It was a tiny book but the story was interesting to <br/>\nread.<br/>\n <br/>\nThe second is my favorite shot of Dustin in his 3D glasses(Adventures Shark  <br/>\nBoy and Lava Girl movie we had seen).<br/>\n <br/>\n3 Is Cameron hamming it up in an outfit I got that was too small. I took  the <br/>\nphoto bc I knew it would be the first and last time he wore it.<br/>\n <br/>\n4 & 5 is Cassidy and Nicholas in the whelping box with puppies  from spring <br/>\nof 05. We lost the mama of those puppies two month later. She had a  tumor we <br/>\ndiscovered when we redid her OFA&#39;s. Special photo.. 5 is one of her  pups we <br/>\nsold to friends.<br/>\n <br/>\n6 is my Durango (rango) after the convention. The lettering is bad:).  I <br/>\napplied that before we left to go to Peabody then it rained during the  convention <br/>\nso I reapplied sometime after midnight not quite seeing straight...  happily <br/>\ngraffiti-ing my own vehicle :)<br/>\n <br/>\n7 is Dustin on the way back from Pinebush, NY for a business trip we  took <br/>\ntogether. Talking about communication one on one this was bliss. There  is no <br/>\nway we could have talked that in depth with a car load of toddlers on a  one way <br/>\n5+ hr road trip. The rest areas were a blast and it was so nice not  to ride <br/>\nalone. <br/>\n <br/>\n8 On 95 crossing in NH some guy on a motor cycle was doing a long  wheel-ly <br/>\nthat seemed like a good 3/4 of a mile at 70 MPH! Dustin took a few of  the <br/>\nshots. We never good a real good one but it was a sight to see. The other  photo <br/>\nmissing is of our trip to Canada.<br/>\n <br/>\n9 Is Dustin in his riding gear. Gosh he looks much older there.<br/>\n <br/>\n10 Cameron this May giving a little too much love to a  puppy:)<br/>\n <br/>\n11 Cassidy at the Peabody in the &quot;craft&quot;/ BUSY room:)<br/>\n <br/>\n12 The kids and I (me breathing deeply wishing I could poof out of there.)  <br/>\nat the gym in Maine. Not a good trip for any of us either time we went. I  <br/>\ndon&#39;t know why but none of us felt right. So hard to balance(well  generally I do <br/>\nfine but it rather sucked and rock climbing is not for us right  now). We&#39;d <br/>\nrather come and go so it&#39;s a tuff balance to explain to those field  trip <br/>\npushers...  A friend called Nicholas and Cameron whinny and bratty I  knew I had <br/>\nenough then. Thank you to unschooling I was able to regroup (focus)  and know it <br/>\nwas ok to get us out of there. Nothing food and space couldn&#39;t  solve.. I <br/>\nadded this photo bc it&#39;s sorta recent and i&#39;m in it.<br/>\n <br/>\n13,14 & 15 are of a trip to Utah.<br/>\n A photo I took of a mountain behind the flats just before Nevada. My  sister <br/>\nand I took the (3 hours from UT)kids to the casino for an all you can  eat. <br/>\nWe tried to play a few slots on the way out however it turns out with  children <br/>\nthat&#39;s illegal, whod-a thunk it? <br/>\nFunny story on this.. On the way back we had been looking for salt but  <br/>\neverything was unusually wet. We stopped at one of the Morton Salt piles on the  <br/>\nside of the road and filled a ziplock bag. A few days later I left for home  and <br/>\nhad my bags flagged for inspection. I was mortified when I realized they  <br/>\nspotted the bag of salt. All I could think is people were going to think.. me,  <br/>\nstanding there with 3 children was smuggling SALT! lol Every one stopped and  <br/>\nlooked at the ongoing inspection, ugh! Funny now but not then.. I kept looking  <br/>\nat people going, it&#39;s salt! It&#39;s only salt!<br/>\n15( is my first tumble weed sighting. I tried to ship this one how but  <br/>\neveryone thought i was nuts...<br/>\n <br/>\n16 the not so Man on the mountain in NH.<br/>\n17 & 18 are of Dustin and I&#39;s business trip to Canada in August. I  loved <br/>\nthis trip! Well, I got a speeding ticket just as I reentered the US that  was <br/>\njust wrong it was my birthday too). Dustin and I went shopping, rocked out  on <br/>\nthe ride and brought home some neat stuff. We live about 4 hrs from  Canada.<br/>\n <br/>\n19, 20 & 21 are of Cassidy, Nicholas and Cameron at the computer,  watching <br/>\nthe Incredibles (which happens to also be on right now) and Nicholas  with the <br/>\nspring 06 puppies.<br/>\n <br/>\nLaura<br/>\nUnschoolingMaine.com<br/>\nDrewsbrittanys.com <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":26150,"nextTopicId":26158}}