{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Christine Masloske","from":"&quot;Christine Masloske&quot; &lt;cmas100@...&gt;","replyTo":"LIST","senderId":"jcnmtqsiBRSLh1UwdjYDzUzf78cPyihj9jJ3d5lW__oo3gYjOSIPhzaFG9CTqLMR5A7pSjlIe-ELucynrReu5--eXluD4ltllExNQjpfZSEa","spamInfo":{"isSpam":false,"reason":"0"},"postDate":"972423533","msgId":13773,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYxNnc4azY5UktMcGdURnVyMmkwMDAwMDE1YkBob3RtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":13772,"nextInTime":13774,"topicId":13773,"numMessagesInTopic":0,"msgSnippet":"I m pleased to see mention of homeschooling and depression.  I believe that depression is quite common in women and, as I m trying to connect with others who","messageBody":"<div id=\"ygrps-yiv-1833428415\">I&#39;m pleased to see mention of homeschooling and depression.  I believe that <br/>\ndepression is quite common in women and, as I&#39;m trying to connect with <br/>\nothers who experience this, I&#39;m finding that there are many depressed hs <br/>\nmothers.<br/>\n<br/>\nClinical depression and the cycles of it can be unpredicatable, but it <br/>\nnormally is not how people who experience depression are 24/7/365.  If we&#39;re <br/>\nin this unschooling for the hundreds of reasons that my family chooses it, <br/>\nit is not the driving force behind our decisions.  Yes, it does play a part. <br/>\n  At times, it IS life for us.<br/>\n<br/>\nWe live in a through away society that seems to lack respect for human life <br/>\nand all of the conditions of it.  Isn&#39;t part of our hs experience to teach <br/>\nour children how to love, grow and nurture in a variety of &quot;real-life&quot; <br/>\nsituations?  I feel confident when I say that my 3 children have developed a <br/>\ngreat deal of compassion and understanding when Mom is depressed.  They are <br/>\namazing and loving people who know that we all have good days, bad days and <br/>\nsome in between.<br/>\n<br/>\nWho knows how many public school or private school teachers or <br/>\nadministrators suffer from this disease?  I&#39;d be interested in a statistic.  <br/>\nOr for that matter, Sunday school teachers, Scout leaders, intramurals <br/>\ncoaches, etc.?<br/>\n<br/>\nDepression has such a bad rap.  And speaking from a lifetime of experience, <br/>\nit truly is a horrible, debilitating disease that can take a life or destroy <br/>\na family.  The advice being given on the message boards, I believe, is right <br/>\non the money; love and compassion, time, help and understanding can make a <br/>\nworld of difference for the whole family.  I&#39;d also like to say that there <br/>\nare many other debilitating diseases and conditions out there, but people <br/>\nwho suffer from them should not be labelled possibly &quot;unfit&quot; or &quot;unable&quot; to <br/>\nhs their children.<br/>\n<br/>\nI have to laugh at the question, &quot;Is it unschooling or laziness?&quot;  I ask <br/>\nmyself that very thing regularly.  It is just so incredibly different than <br/>\nthe model of schooling most of us know.  I&#39;m pretty sure that most people I <br/>\nknow would consider unschooling shear laziness.  I always say &quot;the proof is <br/>\nin the pudding&quot;.  It is a shame that there are hs families out there that <br/>\nare seen as raising uncontrollable children or not educating them properly.  <br/>\nTake a look at their ps counterparts; uncontrollable? uneducated?  I would <br/>\nsuppose that&#39;s part of the reason we all choose to unschool.<br/>\n<br/>\nI have to bring up the phone call I received from a very close friend last <br/>\nnight.  She wanted to know if I was watching 20/20 Downtown because there <br/>\nwas a homeschooling family featured.  She wasn&#39;t sure, but she thought that <br/>\nthe gist of the story was going to be something crazy happening with the <br/>\nfather of the homeschoolers.  Curiousity got the better of me and I tuned <br/>\nin.  What a piece of pointless (in terms of homeschooling) journalism.  The <br/>\nfather was allegedly outrageously abusive to the children and when the <br/>\nauthorities where called by a public school teacher, that&#39;s when the father <br/>\ntook them out of ps and homeschooled them.  I quickly phoned my friend to <br/>\nsee if maybe somehow I missed the point of this piece.  I laughed about the <br/>\nreality  of our society is that practically all of the abusive or unfit <br/>\nparents send their kids to public school, not the other way around!  Yes, <br/>\nyes, yes there are exceptions to every rule, as we all know.<br/>\n<br/>\nThanks for hearing me out and letting me get some of this off of my chest!<br/>\n<br/>\nPeace and blessings,<br/>\n<br/>\nChris<br/>\n(depressed, yet wonderful mother to Jason (7-1/2), Angela (6), Daniel (3) <br/>\nand expecting #4 in March!)<br/>\n_________________________________________________________________________<br/>\nGet Your Private, Free E-mail from MSN Hotmail at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.hotmail.com\">http://www.hotmail.com</a><br/>\n<br/>\nShare information about yourself, create your own public profile at <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://profiles.msn.com\">http://profiles.msn.com</a></div>","specialLinks":[]}],"prevTopicId":13769,"nextTopicId":13724}}