{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":84504749,"authorName":"Suzanne Ackerson","from":"&quot;Suzanne Ackerson&quot; &lt;sylvanv@...&gt;","profile":"sylvanv","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"intro","postDate":"1041805324","msgId":53227,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMmUwMWMyYjUwOCRlMDIyMzgyMCQ1ZjYzMTc0NEBtc2hvbWUubmV0Pg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":53226,"nextInTime":53228,"topicId":53227,"numMessagesInTopic":0,"msgSnippet":"Hello everyone, My name is Suzanne and I ve very much enjoyed reading the posts on this list over the past few weeks. My children are 2 boys ages 21 and 10,","messageBody":"<div id=\"ygrps-yiv-1367206318\">Hello everyone,<br/>\n<br/>\nMy name is Suzanne and I&#39;ve very much enjoyed reading the posts on this list over the past few weeks.  <br/>\n<br/>\nMy children are 2 boys ages 21 and 10, and an 8 year old girl.  My 21 year old homeschooled until college.  He&#39;s done extremely well in college and will graduate in June with a double major of music and music business.  The younger children have always been homeschoolers too.  <br/>\n<br/>\nI guess our homeschooling has been  of a hybrid variety, changing with each child and changing also with their stages.    I feel more closely attuned with unschoolers but can&#39;t say that in practice we have been purely unschoolers.  I&#39;ve never bought a curriculum but seem to be a &quot;hunter and gatherer&quot; of many resources.  I was a special ed teacher before becoming a mother.<br/>\n<br/>\nAlthough I have a lot of experience I still often feel like a beginner at this unschooling/homeschooling life work that I have chosen.  My younger children are much more spirited than my oldest was and I have had to become more humble.<br/>\n<br/>\nMy younger children are much more interested in playing with other kids and establishing friendships than they are in attending classes and participating in the organized activities of our local homeschool group.  Also, when my oldest was growing up there was always another  child that he could invite over or that would invite him over.  This visiting back and forth just isn&#39;t happening now, as children seem to be so scheduled with clubs and homeschool group activites that there just isn&#39;t the time, I guess.   I&#39;m glad that my children have this time just to be kids, but we seem to have less activities outside of the home than anyone else I know.  I feel I almost need a support group for this!   My 10 year old takes one art class and a week and goes to church and that is the extent of his activities outside of the home.  My 8 year old has no classes and goes to church when she&#39;s in a compliant phase. (This comes and goes, of course).  To top it all off, people with school age children are moving out of our community and we will not be as it is affordable here.<br/>\n<br/>\nI&#39;m so proud of my childrens&#39; passion for life and thankful that they are my kids.  My husband and I celebrated our 25th wedding anniversary last July.<br/>\n<br/>\nTake care everyone,<br/>\nSuzanne<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":53223,"nextTopicId":53248}}