{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Balancing needs/wants","postDate":"1268591478","msgId":52046,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCOUQyQjc2LjgwNzA0MDNAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PDI3M0ZCRURGLUU2NzUtNDlERC1CRTlCLTIxQzM0MkY5QjRCQkBzdXBlbm4uY29tPg==","referencesHeader":"PElGRUFMQk1FRUZNSUhESUZIT0tLSUVMTEdIQUEuY2xhcmUua2lya3BhdHJpY2tAYmx1ZXlvbmRlci5jby51az4gPDI3M0ZCRURGLUU2NzUtNDlERC1CRTlCLTIxQzM0MkY5QjRCQkBzdXBlbm4uY29tPg=="},"prevInTopic":52029,"nextInTopic":0,"prevInTime":52045,"nextInTime":52047,"topicId":52015,"numMessagesInTopic":0,"msgSnippet":"... I ve been kind of a concrete thinker - when I say we need to leave at 1 pm, I have this vision of everybody getting into the car, shoes and socks on, coats","messageBody":"<div id=\"ygrps-yiv-999713340\">On 3/13/2010 5:26 PM, Su Penn wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; even then building in a little leeway into that 1:00 out-the-door time <br/>\n&gt; so _I&#39;m_ not getting cranky and impatient and stressed when he&#39;s <br/>\n&gt; moving slowly.<br/>\n<br/>\n </span></blockquote>I&#39;ve been kind of a concrete thinker - when I say we need to leave at 1 <br/>\npm, I have this vision of everybody getting into the car, shoes and <br/>\nsocks on, coats and bags in hand, at a couple of minutes before 1 pm. <br/>\nI&#39;m ashamed to admit how many times &quot;I&quot; went to the car and sat there, <br/>\nwatching the clock, while the rest of my family finished up something, <br/>\ngot a drink of water, went to the bathroom, suddenly couldn&#39;t find the <br/>\nright socks, and so on. Not a good way to start family outings - me <br/>\ngetting crankier and crankier.<br/>\n<br/>\nBut it seemed like if I didn&#39;t do something like that, my family <br/>\n(husband and kids) would always dawdle on and on. And then one day it <br/>\nhit me like a ton of bricks - they pretty much &quot;always&quot; do it. It is <br/>\npredictable. So - I switched to, &quot;We&#39;ll need to leave at 12:30,&quot; and at <br/>\n12:45 I go sit in the car with my ipod and happily give them 15 more <br/>\nminutes to get ready while I listen to a good book. Departures became <br/>\ncalm and happy. Rosie has turned out to be more like me as she got older <br/>\n- so I let her in on how I handled it, because &quot;she&quot; was getting like <br/>\nI&#39;d been, ready on the dot of the planned departure time and cranky at <br/>\nthose who weren&#39;t.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":223803785,"authorName":"Su Penn","from":"Su Penn &lt;su@...&gt;","profile":"marie101365","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Balancing needs/wants","postDate":"1268529995","msgId":52029,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI3M0ZCRURGLUU2NzUtNDlERC1CRTlCLTIxQzM0MkY5QjRCQkBzdXBlbm4uY29tPg==","inReplyToHeader":"PElGRUFMQk1FRUZNSUhESUZIT0tLSUVMTEdIQUEuY2xhcmUua2lya3BhdHJpY2tAYmx1ZXlvbmRlci5jby51az4=","referencesHeader":"PElGRUFMQk1FRUZNSUhESUZIT0tLSUVMTEdIQUEuY2xhcmUua2lya3BhdHJpY2tAYmx1ZXlvbmRlci5jby51az4="},"prevInTopic":52026,"nextInTopic":52046,"prevInTime":52028,"nextInTime":52030,"topicId":52015,"numMessagesInTopic":0,"msgSnippet":"... Eric can be like this. For him, it has to do with finding it challenging to change directions. A couple of things I ve done include making deals with him,","messageBody":"<div id=\"ygrps-yiv-885590936\">On Mar 13, 2010, at 12:53 PM, Clare Kirkpatrick wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; ISomething that helps enormously is to make our days varied.  I really like<br/>\n&gt; to take my children (who are young - 6, 5, 3 and 1) places but so often one<br/>\n&gt; or two of them (the older two usually) just don&#39;t want to go :-(.  Often<br/>\n&gt; it&#39;s places that they always enjoy when they get there, so it&#39;s doubly<br/>\n&gt; frustrating that they say they don&#39;t want to go initially.<br/>\n<br/>\n </span></blockquote>Eric can be like this. For him, it has to do with finding it challenging to change directions. A couple of things I&#39;ve done include making deals with him, like, &quot;If you&#39;ll come and make a good-faith effort, but you&#39;re still not having fun after 20 minutes, we&#39;ll leave.&quot; A couple of times my expectation that he&#39;ll enjoy himself once we get there has been wrong, and we&#39;ve left. Usually I&#39;m right, and once he gets past the transition from whatever he is doing at home to being out, he enjoys himself.<br/>\n<br/>\nIncluding something he really likes and finds it worth leaving the house for can help, too. I can&#39;t tell you how many milkshakes I&#39;ve bought for Eric on the way places! A milkshake is almost always worth getting in the car for, for him, and my buying it helps him feel like I&#39;ve taken him into account as well. Buy him a burger with it, and the protein helps him stay steady and manage himself better.<br/>\n<br/>\nHelping him manage the transition can mean planning way ahead, as Sandra said. I can&#39;t spring a 1:00 outing on him at 12:45 and expect him to cheerfully walk out the door (whereas Yehva and Carl are ready to go on a moment&#39;s notice, like firefighters). Making sure he knows about it early in the day, and reminding him throughout the morning, and then at about 12:30 saying, &quot;We&#39;re going to be leaving in about half an hour, so start looking for a stopping place,&quot; and even then building in a little leeway into that 1:00 out-the-door time so _I&#39;m_ not getting cranky and impatient and stressed when he&#39;s moving slowly.<br/>\n<br/>\nHaving a routine helps. Eric is more likely to be willing to go to a park day we go to every Wednesday than to a more occasional get-together of the same kind, because he&#39;s used to going to park day on Wednesdays. He&#39;s more willing to go on a family outing to the park than to a get-together at a park. On the other hand, he&#39;s more likely to agree to something out of the routine if it&#39;s really new and unusual and not just more of the same--even a different park we&#39;ve never been to, or haven&#39;t been to often, with an interesting piece of equipment or a stream or a trail in the woods.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  But I can&#39;t fix 25 year<br/>\n&gt; long depression overnight, and in the meantime I could really do with some<br/>\n&gt; constructive discussion to help me deal with balancing my needs to do the<br/>\n&gt; things that help me stay emotionally well (which, in turn, benefits the<br/>\n&gt; children) and the wants of my children to do the things they want to do in<br/>\n&gt; the day.<br/>\n<br/>\n </span></blockquote>Kids as young as yours probably can&#39;t see the &quot;big picture&quot; as well as you can. If getting out of the house is really that essential to your well-being, then that&#39;s important. I see one of my jobs as holding and balancing the various wants and needs of myself and my children; sometimes that means taking responsibility for a need a kid doesn&#39;t recognize--for instance, the role of sleep and protein in Eric&#39;s mood and explosiveness were obvious to me and my partner years before Eric made the connection, and we worked hard to help him get enough of both. It meant being--how did Sandra put it just today--something about using all our creative powers of persuasion. And, when that failed, firmness. Now those are things he manages for himself, usually, or asks us to help him with.<br/>\n<br/>\nAnother option is to plan for that bickery time in the afternoon. If you know it&#39;s coming every day, be ready for it. Carl used to get really fussy and wild starting at about 5 p.m., right when I was getting tired, and when we still had an hour or 90 minutes until my partner came home. I used to get cranky that he was fussy. Boy, that helped!<br/>\n<br/>\nWhat really did help was getting off my butt to get him a snack and an activity starting around 4:45. It might be a movie or a video game; it might be reading or playing a game or doing a simple project with me; it might be a walk. I found that if I could help him through that first half hour or so, he would be more internally organized and usually manage the rest of the time until dinner pretty well. The trick was to know it was coming and get busy with the solution _before_ he started getting upset. With a little planning, you may be able manage your kids&#39; transition from playing together to whatever other thing is going to happen that isn&#39;t bickering much better.<br/>\n<br/>\nI hope this helps. I don&#39;t mean to sound like a know-it-all; I could write an e-mail three times this long about all the things I&#39;ve gotten wrong. But these are some things that have helped me.<br/>\n<br/>\nSu, mom to Eric 8; Carl, almost 6; Yehva, 2.5<br/>\ntapeflags.blogspot.com</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Balancing needs/wants","postDate":"1268527446","msgId":52026,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgwQjkzNTIzLUNFNUYtNDBENC1CRUExLUQxNzdFQTcwMzg4NkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PElGRUFMQk1FRUZNSUhESUZIT0tLSUVMTEdIQUEuY2xhcmUua2lya3BhdHJpY2tAYmx1ZXlvbmRlci5jby51az4=","referencesHeader":"PElGRUFMQk1FRUZNSUhESUZIT0tLSUVMTEdIQUEuY2xhcmUua2lya3BhdHJpY2tAYmx1ZXlvbmRlci5jby51az4="},"prevInTopic":52025,"nextInTopic":52029,"prevInTime":52025,"nextInTime":52027,"topicId":52015,"numMessagesInTopic":0,"msgSnippet":"-=-Something that helps enormously is to make our days varied. I really like to take my children (who are young - 6, 5, 3 and 1) places but so often one or two","messageBody":"<div id=\"ygrps-yiv-1335233933\">-=-Something that helps enormously is to make our days varied. I  <br/>\nreally like<br/>\nto take my children (who are young - 6, 5, 3 and 1) places but so  <br/>\noften one<br/>\nor two of them (the older two usually) just don&#39;t want to go :-(. Often<br/>\nit&#39;s places that they always enjoy when they get there, so it&#39;s doubly<br/>\nfrustrating that they say they don&#39;t want to go initially.-=-<br/>\n<br/>\nIf the outings are planned in advance, it might help to remind them  <br/>\nthe day before, the night before, and then that morning.<br/>\n<br/>\nWe used to always recite what was going to happen the next day and  <br/>\nHolly did that for me just this morning, told me everything she was  <br/>\ngoing to do for the rest of the day and for Monday.  It&#39;s really  <br/>\nhelpful.<br/>\n<br/>\nMy kids rarely liked to go somewhere if it hadn&#39;t been planned in  <br/>\nadvance.  Occasionally they would go to a last-minute movie or out to  <br/>\neat, but they&#39;d much rather have a few hours or a day to plan around  <br/>\nit and plan up to it.<br/>\n<br/>\n-=-The reason I try to get us out is that being<br/>\nat home all day, every day is just too intense for me. I get bored (!)  <br/>\nas<br/>\nthey spend all day playing together.-=-<br/>\n<br/>\nFind a thing or two a day that you would like to do, that they&#39;ll want  <br/>\nto do with you.  Then you&#39;ll be cleaning up something new and  <br/>\ndifferent, and between projects or movies or music or special food  <br/>\nyou&#39;ve chosen to make all your lives richer, they can play with each  <br/>\nother.<br/>\n<br/>\n-=- I get cabin fever from having no other<br/>\nadults to talk to. And then they get antsy because they&#39;ve been in<br/>\neachother&#39;s company all day and by mid-afternoon are starting to bicker<br/>\nmore, and sometimes even ask then to go out, when it&#39;s too late. -=-<br/>\n<br/>\nCan you find some other friend-moms to do things with?<br/>\n<br/>\nWhat makes it too late?<br/>\n<br/>\nWhat if you just go out when they want to?  Why not?  Is it a control  <br/>\nthing?  Routine/schedule thing?  Can you be more flexible?<br/>\n<br/>\n-=- The feelings of isolation trigger other depressive feelings, and I  <br/>\noverreact to<br/>\ntheir bickering or, in order to avoid overreacting, ignore it, which I  <br/>\ndon&#39;t<br/>\nthink is helpful to them. -=-<br/>\n<br/>\nIt&#39;s not cool to have asked people not to discuss depression and then  <br/>\nbring it up in the middle of everything.<br/>\nBut on this list it&#39;s not cool to throw in a factor and say &quot;Discuss  <br/>\nmy issues without reference to this one aspect of it.&quot;<br/>\n<br/>\n-=- am aware that this is ^my^ issue and, as I<br/>\nsaid, I am dealing with the depression side of it. But I can&#39;t fix 25  <br/>\nyear<br/>\nlong depression overnight, and in the meantime I could really do with  <br/>\nsome<br/>\nconstructive discussion to help me deal with balancing my needs to do  <br/>\nthe<br/>\nthings that help me stay emotionally well (which, in turn, benefits the<br/>\nchildren) -=-<br/>\n<br/>\nAnd we can&#39;t ask &quot;like what&quot;--the things that help you stay  <br/>\nemotionally well.  Do they involve being inattentive or absent?  You  <br/>\nwant something (ideas, encouragement, something) without giving us all  <br/>\nthe important factors, maybe.<br/>\n<br/>\n-=-and the wants of my children to do the things they want to do in  <br/>\nthe day.-=-<br/>\n<br/>\nIf your depression is severe, would the children be better off in  <br/>\nschool?  Two or three would be home in any case.<br/>\nIf you decide they would be better off at home, then you&#39;ve taken on a  <br/>\nBIG responsibility to them.  Their happiness and learning and health  <br/>\ndepend on your attentive presence.<br/>\n<br/>\n-=-Oh, I also must add that I do already make use of friends and  <br/>\nfamily when I<br/>\ncan, so that I can take some children out and not others,-=-<br/>\n<br/>\nAre they friends you can talk to as well?<br/>\n<br/>\nI have a couple of suggestions.  One is to practice in your own head  <br/>\nrephrasing decriptions in a more positive way.  It&#39;s possible to  <br/>\ndescribe the same situation in a pouty, resentful way, and also in a  <br/>\nhopeful, grateful way.   It&#39;s possible to get in the habit of doing  <br/>\nthe more negative thing too much.  Start being aware of when you&#39;re  <br/>\nsaying &quot;always&quot; or &quot;never&quot; or &quot;can&#39;t&quot; or &quot;25 year depression,&quot; and  <br/>\npractice seeing the bright side of things.  Can all your children  <br/>\nwalk?  Talk?  Can some of them put on their own shoes and coat?  Some  <br/>\nmothers have a child who will never, ever do those things.<br/>\n<br/>\nThe other is to learn even the simplest everyday breathing techniques  <br/>\nthat will help you come back to your calm self.  Don&#39;t ignore your  <br/>\nkids.  Breathe a slow, deep breath or two while you think and respond  <br/>\nto them as they are your partners, not your adversaries.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/negativity\">http://sandradodd.com/negativity</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/breathing\">http://sandradodd.com/breathing</a><br/>\n<br/>\nEach time you feel like you&#39;ve done something better than you would&#39;ve  <br/>\nyesterday and each time you feel like a good mother, it will help you  <br/>\ncome out of depression, too.  Not all by itself, but it will help  <br/>\navoid staying there or falling back into it.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":156418579,"authorName":"dana_burdick","from":"&quot;dana_burdick&quot; &lt;DanaBurdick@...&gt;","profile":"dana_burdick","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Balancing needs/wants","postDate":"1268522187","msgId":52025,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhuaDZjYitrYzNoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PElGRUFMQk1FRUZNSUhESUZIT0tLSUVMTEdIQUEuY2xhcmUua2lya3BhdHJpY2tAYmx1ZXlvbmRlci5jby51az4="},"prevInTopic":52020,"nextInTopic":52026,"prevInTime":52024,"nextInTime":52026,"topicId":52015,"numMessagesInTopic":0,"msgSnippet":"==But I can t fix 25 year long depression overnight, and in the meantime I could really do with some constructive discussion to help me deal with balancing my","messageBody":"<div id=\"ygrps-yiv-267758163\">==But I can&#39;t fix 25 year<br/>\nlong depression overnight, and in the meantime I could really do with some<br/>\nconstructive discussion to help me deal with balancing my needs to do the<br/>\nthings that help me stay emotionally well (which, in turn, benefits the<br/>\nchildren) and the wants of my children to do the things they want to do in<br/>\nthe day.==<br/>\n<br/>\nI&#39;m sure others will have a lot of concrete suggestions, but what you said above really popped out at me. You don&#39;t experience 25 years of depression at one time, ever.  You only experience depression, _now_. And, now is so much easier to handle than the thought of 25 years.  Your challenge with four young ones sounds like enough without torturing yourself with this thought.<br/>\n<br/>\n==One of the things I find hard being an unschooling mum, is the constant<br/>\nnature of my job. It is, for me, lovely, rewarding, wonderful, fun,<br/>\nexciting but also repetetive and relentless.==<br/>\n<br/>\nHaving young ones is a challenge for anyone, depressed or not.  They are soooo busy. This really is a short time in your life.  It&#39;s hard to see the bigger picture when you feel mired in it all.  Picking up toys for the millionth time or wiping a face can seem repetitive.  These small acts really are important, though.  When my kids were young I found that I did better if I stayed focused on the task and stayed present.  The everyday, repetitive chores no longer seemed to zap my energy so much.   My children were naturally present (as kids are) with their playing and doing.  Whenever I was present with my things, I joined them in a sense, and our time together became more peaceful and enjoyable.  Without changing another thing, I suddenly felt that I had more time in my day and I became more available to my kids and husband.  And, I just became a happier person.<br/>\n<br/>\n-Dana</div>","specialLinks":[]},{"userId":294520986,"authorName":"Joanna","from":"&quot;Joanna&quot; &lt;ridingmom@...&gt;","profile":"ridingmom1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Balancing needs/wants","postDate":"1268515524","msgId":52020,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhuZ3ZzNCtzcDJzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PElGRUFMQk1FRUZNSUhESUZIT0tLSUVMTEdIQUEuY2xhcmUua2lya3BhdHJpY2tAYmx1ZXlvbmRlci5jby51az4="},"prevInTopic":52015,"nextInTopic":52025,"prevInTime":52019,"nextInTime":52021,"topicId":52015,"numMessagesInTopic":0,"msgSnippet":"One thought that strikes me is that you describe a typical day as the kids are off playing, and then they bicker in the afternoon, but by then it s too late to","messageBody":"<div id=\"ygrps-yiv-429146075\">One thought that strikes me is that you describe a typical day as the kids are off playing, and then they bicker in the afternoon, but by then it&#39;s too late to go out.  Talk with them about that.  Ask for their help with brainstorming about it.  Help them to see that pattern and then to think of things to do.  Offer ideas.  At 4:00, on some days, you could bring something new to a day at home, like blanket forts or homemade playdough, or fill a big tub with warm water in the backyard.  <br/>\n<br/>\nYou say that you pry them out of the house sometimes, knowing that everyone needs to get out, but I&#39;ll bet that you could all be on more of the same page.  What I got from your post was a sense of separateness and the helplessness on your part.  See if you can draw together to be a unit that can work more together.  But YOU are the force that binds the team together--don&#39;t wait for everyone to be on board--be the force that makes them want to jump on the train so they don&#39;t miss out on the fun.  Plan to have a little hunt at the park, race them to the car, playfully pinch the bottoms of anyone still in the house, etc.  Be a little more fun, and do some unexpected things now and then.<br/>\n<br/>\nPam has talked about having kids with very different social needs and temperaments, but that one was willing to read in the car while the others were at the park.  There is a sense of working as a team in that family that you could consider in your own.    And there are times, with four children, when someone will have to give in--but maybe you can find ways to sweeten that deal, find ways to make it work.<br/>\n<br/>\nFrom your one post, it feels like there might be too much focus on kids having individual preferences for a family your size.  I don&#39;t know--maybe you never used to give anyone a choice, and are recovering from that.  Maybe you could have &quot;free choice days&quot; or &quot;do nothing days&quot; (which is what my kids have started calling the days that have no plans--really it means they get to do all their stuff at home) interspersed with &quot;family days&quot; or &quot;out and about days&quot; or something like that.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/balance\">http://sandradodd.com/balance</a><br/>\n<br/>\n<br/>\n<br/>\nJoanna</div>","specialLinks":[]},{"userId":279436458,"authorName":"Clare Kirkpatrick","from":"&quot;Clare Kirkpatrick&quot; &lt;clare.kirkpatrick@...&gt;","profile":"claremkirkpatrick","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Balancing needs/wants","postDate":"1268502794","msgId":52015,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PElGRUFMQk1FRUZNSUhESUZIT0tLSUVMTEdIQUEuY2xhcmUua2lya3BhdHJpY2tAYmx1ZXlvbmRlci5jby51az4="},"prevInTopic":0,"nextInTopic":52020,"prevInTime":52014,"nextInTime":52016,"topicId":52015,"numMessagesInTopic":0,"msgSnippet":"I hope I phrase this right!  I m looking for help in our family. I suffer from depression.  I am working very, very hard to deal with this in very many ways","messageBody":"<div id=\"ygrps-yiv-250638348\">I hope I phrase this right!  I&#39;m looking for help in our family.<br/>\n<br/>\nI suffer from depression.  I am working very, very hard to deal with this in<br/>\nvery many ways so, I would like to ask respectfully, not for advice on that<br/>\nparticular issue.<br/>\n<br/>\nOne of the things I find hard being an unschooling mum, is the constant<br/>\nnature of my job.  It is, for me, lovely, rewarding, wonderful, fun,<br/>\nexciting but also repetetive and relentless.  I am finding more and more<br/>\nthat I am asking myself why I am doing this, and wishing I could go out to<br/>\nwork more.  I have to say, that by &#39;more and more&#39; I mean 7% of the time as<br/>\nopposed to 1% of the time in the past!  So it&#39;s not a constant feeling, just<br/>\nsomething I&#39;m feeling more often than I did in the past.<br/>\n<br/>\nSomething that helps enormously is to make our days varied.  I really like<br/>\nto take my children (who are young - 6, 5, 3 and 1) places but so often one<br/>\nor two of them (the older two usually) just don&#39;t want to go :-(.  Often<br/>\nit&#39;s places that they always enjoy when they get there, so it&#39;s doubly<br/>\nfrustrating that they say they don&#39;t want to go initially.  I am guilty of<br/>\njust saying &#39;sorry, we&#39;re going&#39; at times, and at others, I &#39;give in&#39;<br/>\n(sorry!) and we stay at home.  The reason I try to get us out is that being<br/>\nat home all day, every day is just too intense for me.  I get bored (!) as<br/>\nthey spend all day playing together.  I get cabin fever from having no other<br/>\nadults to talk to.  And then they get antsy because they&#39;ve been in<br/>\neachother&#39;s company all day and by mid-afternoon are starting to bicker<br/>\nmore, and sometimes even ask then to go out, when it&#39;s too late.  The<br/>\nfeelings of isolation trigger other depressive feelings, and I overreact to<br/>\ntheir bickering or, in order to avoid overreacting, ignore it, which I don&#39;t<br/>\nthink is helpful to them.  I am aware that this is ^my^ issue and, as I<br/>\nsaid, I am dealing with the depression side of it.  But I can&#39;t fix 25 year<br/>\nlong depression overnight, and in the meantime I could really do with some<br/>\nconstructive discussion to help me deal with balancing my needs to do the<br/>\nthings that help me stay emotionally well (which, in turn, benefits the<br/>\nchildren) and the wants of my children to do the things they want to do in<br/>\nthe day.<br/>\n<br/>\nOh, I also must add that I do already make use of friends and family when I<br/>\ncan, so that I can take some children out and not others, and I can take<br/>\njust myself out etc., but this isn&#39;t possible every day, and I need to find<br/>\na way not to be in tears and tetchy and gripy at the end of the day when it<br/>\nhasn&#39;t been possible to find childcare!<br/>\n<br/>\nThanks (and I hope that you will kindly tell me if I&#39;ve asked things<br/>\nwrongly!)<br/>\n<br/>\nClare</div>","specialLinks":[]}],"prevTopicId":52019,"nextTopicId":51988}}