{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":61,"messages":[{"userId":125185902,"authorName":"fishierich@aol.com","from":"fishierich@...","profile":"rjmjmjnj","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] television","postDate":"1066477361","msgId":16740,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY0LjM1YzUwZWRjLjJjYzI4MTMxQGFvbC5jb20+"},"prevInTopic":16739,"nextInTopic":16742,"prevInTime":16739,"nextInTime":16741,"topicId":7187,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/17/03 8:30:59 PM Eastern Daylight Time, SandraDodd@aol.com writes: You re welcome to stay in this group, but if you express your views","messageBody":"<div id=\"ygrps-yiv-962344672\">In a message dated 10/17/03 8:30:59 PM Eastern Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> writes:<br/>\nYou&#39;re welcome to stay in this group, but if you express your views they <br/>\nprobably WILL be questioned and dissected. <br/>\nWell, isn&#39;t this why I&#39;m hear to broaden my views and opinions. Which will <br/>\nhopefully make me a more open minded parent/person. I like the idea of people <br/>\ngiving honest opinions on subjects. No one said I had to agree; but I&#39;m willing <br/>\nto think about it. <br/>\nMargaret <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] television","postDate":"1066468558","msgId":16739,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJCQjY3RDBFLjFGQ0Q0JWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGY5LjMyN2ZhNGE3LjJjYzFjNDkyQGFvbC5jb20+"},"prevInTopic":16736,"nextInTopic":16740,"prevInTime":16738,"nextInTime":16740,"topicId":7187,"numMessagesInTopic":0,"msgSnippet":"... Did they turn it on themselves and watch it all day? For how many months? What other things did they have in their lives that they enjoyed doing that were","messageBody":"<div id=\"ygrps-yiv-964914473\">on 10/17/03 6:17 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fishierich@...\">fishierich@...</a> at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fishierich@...\">fishierich@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Having the television on<br/>\n&gt; all day is not something I want and I live here too.<br/>\n<br/>\n </span></blockquote>Did they turn it on themselves and watch it all day? For how many months?<br/>\nWhat other things did they have in their lives that they enjoyed doing that<br/>\nwere available to them? Did you take them out to places and were they<br/>\nunhappy and wanting to get back to the TV? How much did you watch with them?<br/>\nHow much were they left to themselves?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Having the television on<br/>\n&gt; all day is not something I want and I live here too.<br/>\n<br/>\n </span></blockquote>And if they did want it on all day and you didn&#39;t then there are two sets of<br/>\nincompatible desires. And the solution to that dilemma you&#39;re modeling for<br/>\nyour kids is that bigger, stronger people get to have what they want and<br/>\nsmaller, weaker people get the shaft.<br/>\n<br/>\nIf we spent our childhoods doing what our parents wanted us to do and we<br/>\nenter adulthood (and then parenthood) trying to fulfill the need to do what<br/>\nwe want, then we pass that legacy of neediness and unhappiness onto our<br/>\nchildren. And our relationship with our kids isn&#39;t as joyful as it could be<br/>\nbecause using our power to get our way creates an adversarial relationship<br/>\nwith them. <br/>\n<br/>\nIt&#39;s helpful in terms of building a relationship to recognize that children<br/>\nhave no power over the world. All the power they wield is what they get<br/>\nthrough us. <br/>\n<br/>\nIf our goal is to have our own way, then having kids isn&#39;t a good way to<br/>\nachieve that. If our goal is to help our kids (give them the power to) get<br/>\nwhat they want in life -- which is the goal of unschooling -- then we need<br/>\nto recognize when we&#39;re being our own roadblock to our goal.<br/>\n<br/>\nBlocking our children&#39;s access to something they like (TV) is being a<br/>\nroadblock to our goal. If you set your sights on helping them get what they<br/>\nwant out of life, then the things you want your way won&#39;t seem as important<br/>\nas they did in the past.<br/>\n<br/>\nThat doesn&#39;t mean we should set our needs aside entirely. If we don&#39;t<br/>\nrespect ourselves, our kids won&#39;t respect us either. But it doesn&#39;t help our<br/>\nrelationship if we take away our kids power (that they&#39;re getting through<br/>\nus) in order to respect ourselves.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My opinion may change as<br/>\n&gt; they grow older. They will have to make their own choices.<br/>\n<br/>\n </span></blockquote>The more help and practice they have when they&#39;re younger trying to get what<br/>\nthey want (on things that aren&#39;t dangerous), the easier it will be when they<br/>\nhave the power and freedom to do whatever they want with choices that are<br/>\ndangerous.<br/>\n<br/>\nLearning how to make choices between TV shows is much safer than learning<br/>\nhow to make choices when cars and alcohol are available.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Do you think at 4<br/>\n&gt; years my daughter should be the one deciding what shows to watch?<br/>\n<br/>\n </span></blockquote>Yes.<br/>\n<br/>\nAt 4 does she go to the adult section of the library and pull out The Joy of<br/>\nSex and full color photos of war? Those things just don&#39;t interest kids.<br/>\n<br/>\nMy daughter has always been able to choose what she wanted to watch. She<br/>\ndidn&#39;t much care about flipping through channels at 4 but by 6 she would<br/>\nsearch for the stations that had cartoons. She&#39;d pass by anything live<br/>\naction.<br/>\n<br/>\nThere isn&#39;t any reason for little kids to be watching shows that we fear<br/>\nthey&#39;ll watch. They won&#39;t want to see the news or sex or violence. It just<br/>\ndoesn&#39;t interest them. (And if it does, then it&#39;s likely there&#39;s something<br/>\nelse going on in their lives that they need help with.)<br/>\n<br/>\n(There are, though, kids who develop deep compassion early who can be upset<br/>\nby images of people being mean to each other. Rather than avoiding TV, we<br/>\ncan help them have power over TV by helping them figure out ways to get to<br/>\nwhat they want on TV while avoiding seeing the things they don&#39;t want to<br/>\nsee.)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; What about the influence of commercial TV? Do you not think that has an<br/>\n&gt; affect on the gimmes and yes I did read about &#39;Magical Thinking and Spoiled<br/>\n&gt; Children&#39; and agree completely. So does that mean I should not worry about<br/>\n&gt; commercial TV?<br/>\n<br/>\n </span></blockquote>You can talk about advertisements with them to give them power over them.<br/>\n<br/>\nI think it&#39;s more helpful to use commercials for things the kids don&#39;t want<br/>\n-- adult stuff like laundry detergent and toys that don&#39;t interest them --<br/>\nfor discussion rather than using the commercials for things they want. If we<br/>\nuse commercials for things they want the kids will recognize the agenda<br/>\nisn&#39;t commercial awarenes but is really about convincing them they&#39;re being<br/>\ndecieved and manipulated into wanting that product.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; What about the news or just the news flashes? Regular prime-time news<br/>\n&gt; coverage is not really something a 4 year old needs to hear about let alone a<br/>\n&gt; 29 year old.<br/>\n<br/>\n </span></blockquote>My daughter has told me that news flashes don&#39;t seem real to her. And we&#39;ve<br/>\ntalked about that being advertising for the news. The stations want us to<br/>\nwatch the news so they make it sound like the sky is falling so we&#39;ll feel<br/>\nlike we have to watch it.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Is there a place for me in the chat group with my views on TV or should I<br/>\n&gt; reconsider my involvement in this chat group?<br/>\n<br/>\n </span></blockquote>As in a place where people can comfortably share the walls they&#39;ve built up<br/>\naround their fears rather than examining whether those fears have<br/>\nfoundations and discussing ways to deal with the fears?<br/>\n<br/>\nBuilding and maintaining walls against what we fear is always much easier<br/>\nthan examining and dealing with fears. But walls give power to the things we<br/>\nfear beyond what they have. Knowledge helps us understand what the true<br/>\npower is of the things we fear and gives us power over them.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":63441890,"authorName":"kstjonn","from":"&quot;kstjonn&quot; &lt;kara@...&gt;","profile":"kstjonn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: television","postDate":"1066464126","msgId":16736,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJtcXMxdStwdWJjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwNjIwMWMzOTUxZiQ5MmIyNzZjMCQ5OTYxMWFkM0BtYXJrPg=="},"prevInTopic":16735,"nextInTopic":16739,"prevInTime":16735,"nextInTime":16737,"topicId":7187,"numMessagesInTopic":0,"msgSnippet":"Too long to get into but we don t have access to satellite TV.  But we have an extensive movie collection.  My nearly five yr old can get out her own DVDs and","messageBody":"<div id=\"ygrps-yiv-1668503477\">Too long to get into but we don&#39;t have access to satellite TV.  But <br/>\nwe have an extensive movie collection.  My nearly five yr old can get <br/>\nout her own DVDs and put them in whenever she wants.  And some may <br/>\nsay that it&#39;s not a real choice, since we chose the movies. But there <br/>\nagain, Soph makes the choices when we shop.  Of course, we also buy <br/>\nthings when she is not with us, so there are always lots of choices <br/>\nshe may have not even known about or seen in a store or online. My <br/>\nhusband travels a lot and always comes home with a suitcase full of <br/>\nmovies (and books and toys and .... LOL).  Yes, my daughter acts out <br/>\nwhat she sees in a movie, but she does that with books too, should I <br/>\nlimit her reading time and book choices?  She acts out things she <br/>\nsees in her everyday life. This is how she processes and learns.  She <br/>\nadds her own flavor to these scenarios and changes things around to <br/>\nget a diff. outcome.</div>","specialLinks":[]},{"userId":99944316,"authorName":"Nancy Wooton","from":"Nancy Wooton &lt;ikonstitcher@...&gt;","profile":"ikonstitcher","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Emulating Arthur (was: television)","postDate":"1066457683","msgId":16734,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJCQjYyODYyLjM2OEIyJWlrb25zdGl0Y2hlckBjb3gubmV0Pg==","inReplyToHeader":"PEI2ODFDRDZELTAwRjgtMTFEOC05MEUyLTAwMEE5NTY4QzVBRUBtYWMuY29tPg=="},"prevInTopic":16732,"nextInTopic":16735,"prevInTime":16733,"nextInTime":16735,"topicId":7187,"numMessagesInTopic":0,"msgSnippet":"... If you re leaving your kids alone to be babysat by the TV while you spend your day on the internet ;-)))  that s one thing; I think watching with them can","messageBody":"<div id=\"ygrps-yiv-810527642\">on 10/17/03 4:22 PM, M. Dalrymple-Lepore at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:si1verkitten@...\">si1verkitten@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Yeah, I&#39;ve had times when my little guy emulated the less-wonderful<br/>\n&gt; parts of Arthur.  But to be honest, I was grateful for the opportunity<br/>\n&gt; to talk to him about it.  I mean, I don&#39;t believe in sitting a 5 yr old<br/>\n&gt; down and lecturing him on sexism because I had a whim one day-- but if<br/>\n&gt; he emulates sexist behavior, suddenly it&#39;s relevant and not<br/>\n&gt; preachy/schoolish for me to explain why that might hurt someone&#39;s<br/>\n&gt; feelings (say, MINE) briefly, and go on with our lives.<br/>\n&gt; <br/>\n&gt; So that&#39;s what has worked in our house.  Your mileage may vary.<br/>\n<br/>\n </span></blockquote>If you&#39;re leaving your kids alone to be babysat by the TV while you spend<br/>\nyour day on the internet ;-)))  that&#39;s one thing; I think watching with them<br/>\ncan be a valuable introduction to issues they might not encounter as<br/>\nhomeschoolers.<br/>\n<br/>\nFor example, my dd started watching ER with me when she was about 12.  Dad<br/>\nwould play board games with ds, then about 9, while Laura and I had &quot;ER<br/>\nNight.&quot;  One episode featured a 14 y.o. who was pregnant.  This opened a<br/>\ndiscussion following Laura&#39;s wide-eyed &quot;She&#39;s *14*?&quot; which included topics<br/>\nlike compassion for young out-of-wedlock mothers (my maternal grandmother<br/>\nconceived my mom at 14), abortion, birth control, STD&#39;s, waiting until<br/>\nyou&#39;re truly ready, etc.  All during the commercial break &lt;ggg&gt;<br/>\n<br/>\nNancy  <br/>\n(but I hated that Arthur show ;-)  (and I told them if they started talking<br/>\nlike SouthPark, they couldn&#39;t watch it anymore -- then they started<br/>\nimitating Cartman so perfectly, I couldn&#39;t stop laughing long enough to nuke<br/>\n&#39;em!)</div>","specialLinks":[]},{"userId":150527288,"authorName":"Ren","from":"Ren &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"television","postDate":"1066455992","msgId":16732,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMxMDE3LjIyNDYzNi40NjY3LjE0NzI3NUB3ZWJtYWlsMjEubnljLnVudGQuY29tPg=="},"prevInTopic":16729,"nextInTopic":16734,"prevInTime":16731,"nextInTime":16733,"topicId":7187,"numMessagesInTopic":0,"msgSnippet":" Are there any other unschoolers out there that are living TV free? NO!!:) That would be like limiting music, or books, or travel, or colors, or radio, or ","messageBody":"<div id=\"ygrps-yiv-1459275736\">&quot; Are there any other unschoolers out there that are living TV <br/>\nfree?&quot;<br/>\n<br/>\nNO!!:)<br/>\nThat would be like limiting music, or books, or travel, or colors, or radio, or<br/>\n movies, or nature or....???Ack!<br/>\nWhy would an unschooler want to keep such an incredible source of information<br/>\n from their family?<br/>\n<br/>\nJust for the record, I had no tv for a time, then was rather restrictive about<br/>\n the whole thing, and now, with NO restrictions can honestly say that is BEST.<br/>\n Honest.<br/>\nMy kids have learned so very much from television and contrary to common myth,<br/>\n they do not watch all day or let tv &quot;rule&quot; their lives (althought<br/>\n they watched a TON for about 1.5 years).<br/>\nThey are avid video gamers also and we all love movies.<br/>\nLearning is everywhere. <br/>\nI would not choose to limit any method of communication from my children,<br/>\n radical unschoolers that they are, absorbing information as though by osmosis!<br/>\nGive them access to the world, don&#39;t stand in their way, and you&#39;ll be amazed<br/>\n what a wonderful, incredible tool television is.<br/>\n<br/>\nMy unlimited children will get just as excited about the periodic table of<br/>\n elements (Trevor this week) as they will about the latest episode of Cowboy<br/>\n Bebop.<br/>\nEven my unlimited 2y.o. will walk away from tv, something I wouldn&#39;t have<br/>\n believed possible many years ago. He also asks me to tuck him in when he gets<br/>\n tired, another side benefit of freedom!<br/>\nUnschooling requires that we, as parents, lose the prejudices society lays upon<br/>\n our schooled minds, and learn to see all modes of communication as worthy. In<br/>\n order to truly honor our children, they must make their own choices...which<br/>\n includes television viewing.<br/>\n<br/>\nRen</div>","specialLinks":[]},{"userId":2294225,"authorName":"freeform@juno.com","from":"freeform@...","profile":"freeform_ca","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] television","postDate":"1066447681","msgId":16729,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMxMDE3LjIwMjgwMi4zNTYuNy5mcmVlZm9ybUBqdW5vLmNvbT4="},"prevInTopic":16722,"nextInTopic":16732,"prevInTime":16728,"nextInTime":16730,"topicId":7187,"numMessagesInTopic":0,"msgSnippet":"On Fri, 17 Oct 2003 17:02:12 -0400 AM Brown  ... decades ... What are you watching? Rain sees stuff like that on SNL and Mad TV, but ","messageBody":"<div id=\"ygrps-yiv-1000736297\">On Fri, 17 Oct 2003 17:02:12 -0400 &quot;AM Brown&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ambdkf@...\">ambdkf@...</a>&gt;<br/>\nwrites:<br/>\n<blockquote><span title=\"ireply\"> &gt;  I haven&#39;t been called stupid or been told that someone hates me in <br/>\n </span></blockquote>decades<br/>\n<blockquote><span title=\"ireply\"> &gt; - since being in school!  Yet everyday on TV, children&#39;s favorite<br/>\n&gt; characters are calling people horrible names and treating them in<br/>\n&gt; unimaginable ways - so which is normal? <br/>\n<br/>\n </span></blockquote>What are you watching? Rain sees stuff like that on SNL and Mad TV, but<br/>\nshe understand that it&#39;s all humor, satire. It&#39;s *funny*. I suppose on<br/>\nCSI she sees people killing each other, which is not really normal... but<br/>\nit&#39;s interesting, sort of like a detective story. She also really loved<br/>\nreading Sherlock Holmes stories a couple of years ago, lots of murder<br/>\nthere, too. I don&#39;t think she sees it as normal. Actually, there are lots<br/>\nof books that involve characters calling other characters names, or<br/>\nhurting them - pretty much all of Dickens would be out if that was a<br/>\ncriteria, as would Archies comic books. Heck, most kids&#39; books have<br/>\ntalking animals, which aren&#39;t normal, either... but the average 3 yr old<br/>\nknows that that Brother and Sister Bear won&#39;t be moving in next door any<br/>\ntime soon...<br/>\n<br/>\nDar</div>","specialLinks":[]},{"userId":139187074,"authorName":"Julie Solich","from":"&quot;Julie Solich&quot; &lt;mjsolich@...&gt;","profile":"foxymophandlemama32","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] television","postDate":"1066444131","msgId":16735,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNjIwMWMzOTUxZiQ5MmIyNzZjMCQ5OTYxMWFkM0BtYXJrPg==","referencesHeader":"PGFhLjIzYjViODRlLjJjYzFiNWYxQGFvbC5jb20+IDwzRjkwNzIwNS4yMDEwMjAzQGVhcnRobGluay5uZXQ+"},"prevInTopic":16734,"nextInTopic":16736,"prevInTime":16734,"nextInTime":16736,"topicId":7187,"numMessagesInTopic":0,"msgSnippet":"When we watch Eastenders they are interested in why teens on that show don t speak to their parents or why pupils on Grange Hill bully each other. Shyrley I","messageBody":"<div id=\"ygrps-yiv-1650077320\">When we watch Eastenders <br/>\n  they are interested in why teens on that show don&#39;t speak to their <br/>\n  parents or why pupils on Grange Hill bully each other. <br/>\n<br/>\n  Shyrley<br/>\n  I haven&#39;t seen Grange Hill for years. Is it still going or are you talking about old repeats?<br/>\n<br/>\n  Julie<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n        Yahoo! Groups Sponsor <br/>\n       <br/>\n       <br/>\n<br/>\n  To unsubscribe from this group, send an email to:<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning-unsubscribe@yahoogroups.com\">AlwaysLearning-unsubscribe@yahoogroups.com</a><br/>\n<br/>\n<br/>\n<br/>\n  Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] television","postDate":"1066436933","msgId":16722,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGEzLjRhOGY0YjU5LjJjYzFlMzQ1QGFvbC5jb20+"},"prevInTopic":16720,"nextInTopic":16729,"prevInTime":16721,"nextInTime":16723,"topicId":7187,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/17/2003 5:46:30 PM Mountain Daylight Time, fishierich@aol.com writes: -=-Having the television on all day is not something I want and I","messageBody":"<div id=\"ygrps-yiv-541873245\">In a message dated 10/17/2003 5:46:30 PM Mountain Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fishierich@...\">fishierich@...</a> writes:<br/>\n-=-Having the television on <br/>\nall day is not something I want and I live here too. -=-<br/>\n<br/>\n<br/>\nWe don&#39;t have the television on all day.<br/>\n<br/>\nYou live there too, but if your priority is your children&#39;s learning, then <br/>\nlimiting input is going to make that more difficult.<br/>\n<br/>\n-=-Do you think at 4 <br/>\nyears my daughter should be the one deciding what shows to watch?-=-<br/>\n<br/>\nI think (from years of experience at these kinds of exchangs) that what <br/>\nyou&#39;re envisioning and what I would be talking about would be two extremely <br/>\ndifferent things.<br/>\n<br/>\nMy short answer is &quot;yes.&quot;<br/>\n<br/>\nI don&#39;t think she will even BEGIN to choose the shows you&#39;re afraid of.<br/>\n<br/>\n-=-What about the influence of commercial TV? -=-<br/>\n<br/>\n&quot;The influence&quot; so far is that they know that the broadcast is free because <br/>\nthe sponsors paid for it.  They were TINY little when we explained that <br/>\ncompanies pay for advertising on TV, radio, magazines, billboards, and newspapers.  <br/>\nWhen the boys were little they were glad to know what toys were being offered <br/>\nat which fast-food places, and they watched for those ads.  Some toys they <br/>\nweren&#39;t interested in; some they were.  They were discerning even about fast food <br/>\ntoys.<br/>\n<br/>\nSome people are teens or adults when they first realize that commercials <br/>\nappeal to fantasy and self-image.  My kids have known it since they were young, <br/>\nand so not only did they discuss it and get over it, but they&#39;ve freed up their <br/>\nminds to think of loftier things.<br/>\n<br/>\nWe got a copy of GQ (Gentleman&#39;s Quarterly) last week, for articles on three <br/>\nguys Marty really likes (The Rock, Conan O&#39;Brien and Jack Black).  That <br/>\nmagazine is mostly ads.  Holly and I looked at a few and talked about how some <br/>\nappeal to European fantasy, some to teens (not by SHOWING teens), etc.   We had an <br/>\nEnglish version (not of the same issue)brought by a travelling friend, and the <br/>\nads were really different.   <br/>\n<br/>\nThat&#39;s art, psychology, photography, commerce...<br/>\nHolly is 11.  She understands things now that I didn&#39;t understand until I was <br/>\nin college.<br/>\n<br/>\n-=-Do you not think that has an <br/>\naffect on the gimmes and yes I did read about &#39;Magical Thinking and Spoiled <br/>\nChildren&#39; and agree completely. -=-<br/>\n<br/>\nMy kids have never &quot;had the gimmes.&quot;<br/>\n<br/>\nI&#39;ve tried to even change the words in which I will think about my children <br/>\nand their environment.  There are LOTS of phrases used as put-down and <br/>\nbelittlement.  <br/>\n&quot;gimmes&quot;<br/>\nspoiled rotten<br/>\nboob tube<br/>\njunk food<br/>\nbrat<br/>\nmindless tv<br/>\nzombie<br/>\ndaydreaming (better connotation for some people than others)<br/>\n<br/>\nIt&#39;s possible to have long conversations with other parents which don&#39;t <br/>\nrequire much thought, which don&#39;t say anything original, and which are very <br/>\ndisrespectful of children as a class and as individuals.  Part of what got me where I <br/>\nam today was a conscious choice NOT to go there.<br/>\n<br/>\nMy husband was at a &quot;no children&quot; barbecue with people from work, and they <br/>\ngot to badmouthing teens.  What they were saying did NOT apply to our teens, and <br/>\nit might not even have applied to theirs.  They were just having a canned <br/>\nconversation about how irresponsible and stupid teens are, and how hard it is to <br/>\nbe the parent of a lazy teen who never thinks.  When Keith did say something <br/>\nflattering about Kirby, our oldest, one of the parents made a dismissive <br/>\ncomment and they went back to their martyrly insults of people who had been <br/>\ndisallowed from the party.<br/>\n<br/>\nParents do it without thinking. They do it about school starting, they do it <br/>\nwhen they use terms like <br/>\nrug rats<br/>\ndrape apes<br/>\njust a kid<br/>\nyoung&#39;uns (some manage to use that without insult; others intend to create <br/>\nus/them)<br/>\n<br/>\n-=-So does that mean I should not worry about commercial TV? -=-<br/>\n<br/>\nIt means I don&#39;t and lots of other people don&#39;t.  You can worry about what <br/>\nyou want to worry about, but wouldn&#39;t it be cool if your &#39;worry&#39; list could be <br/>\nshorter?<br/>\n<br/>\n-=-What about the news or just the news flashes? Regular prime-time news <br/>\ncoverage is not really something a 4 year old needs to hear about let alone a <br/>\n29 <br/>\nyear old. -=-<br/>\n<br/>\nMy kids don&#39;t watch the news.  They could if they wanted to.  They rarely <br/>\nchoose to.<br/>\n<br/>\n-=-Is there a place for me in the chat group with my views on TV or should I <br/>\nreconsider my involvement in this chat group?-=-<br/>\n<br/>\nWhat are you really asking?<br/>\nWould you feel better if people weren&#39;t honest?<br/>\nAre you looking for a group that says whatever anyone does is great and all <br/>\nparenting decisions are equally close to unschooling success?<br/>\n<br/>\nYou&#39;re welcome to stay in this group, but if you express your views they <br/>\nprobably WILL be questioned and dissected.  It&#39;s part of learning about <br/>\nunschooling for people to pick apart other parents&#39; theories and ideas and practices.<br/>\n<br/>\nSandra<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":81962961,"authorName":"M. Dalrymple-Lepore","from":"&quot;M. Dalrymple-Lepore&quot; &lt;si1verkitten@...&gt;","profile":"silverkitte1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Emulating Arthur (was: television)","postDate":"1066432922","msgId":16719,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI2ODFDRDZELTAwRjgtMTFEOC05MEUyLTAwMEE5NTY4QzVBRUBtYWMuY29tPg==","inReplyToHeader":"PDQxMC0yMjAwMzEwNTE3MjEyNzY0ODJAZWFydGhsaW5rLm5ldD4="},"prevInTopic":16717,"nextInTopic":16720,"prevInTime":16718,"nextInTime":16720,"topicId":7187,"numMessagesInTopic":0,"msgSnippet":"... ****************** Yeah, I ve had times when my little guy emulated the less-wonderful parts of Arthur.  But to be honest, I was grateful for the","messageBody":"<div id=\"ygrps-yiv-608100750\">On Friday, October 17, 2003, at 05:27  PM, AM Brown wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; We don&#39;t speak<br/>\n&gt; to each other that way, yet they were using the words they heard <br/>\n&gt; Arthur and<br/>\n&gt; Sagwa used and then fighting with each other and friends<br/>\n<br/>\n<br/>\n </span></blockquote>******************<br/>\nYeah, I&#39;ve had times when my little guy emulated the less-wonderful <br/>\nparts of Arthur.  But to be honest, I was grateful for the opportunity <br/>\nto talk to him about it.  I mean, I don&#39;t believe in sitting a 5 yr old <br/>\ndown and lecturing him on sexism because I had a whim one day-- but if <br/>\nhe emulates sexist behavior, suddenly it&#39;s relevant and not <br/>\npreachy/schoolish for me to explain why that might hurt someone&#39;s <br/>\nfeelings (say, MINE) briefly, and go on with our lives.<br/>\n<br/>\nSo that&#39;s what has worked in our house.  Your mileage may vary.<br/>\n<br/>\nMelanie</div>","specialLinks":[]},{"userId":161002657,"authorName":"AM Brown","from":"&quot;AM Brown&quot; &lt;ambdkf@...&gt;","profile":"ambdkf92","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] television","postDate":"1066431772","msgId":16717,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxMC0yMjAwMzEwNTE3MjMyNTI5NTVAZWFydGhsaW5rLm5ldD4="},"prevInTopic":16715,"nextInTopic":16719,"prevInTime":16716,"nextInTime":16718,"topicId":7187,"numMessagesInTopic":0,"msgSnippet":"... Again, I guess my question is could it be the age? (mine were 2 and 4 at the time) I happen to love tv and movies and escapism.  I would give just about","messageBody":"<div id=\"ygrps-yiv-1778262076\"><blockquote><span title=\"ireply\">&gt;. They can watch stuff <br/>\n&gt; without thinking it is &#39;ok&#39; or &#39;normal&#39; or even &#39;real&#39;.<br/>\n<br/>\n </span></blockquote>Again, I guess my question is could it be the age? (mine were 2 and 4 at<br/>\nthe time) I happen to love tv and movies and escapism.  I would give just<br/>\nabout anything for a TIVO:)  Maybe for Christmas this year.  I think it<br/>\nwould be a great way to have tv work for you.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; And if they didn&#39;t make their own choices about TV then it would be <br/>\n&gt; coercion on my part.<br/>\n<br/>\n<br/>\n </span></blockquote>Absolutely, that is why I don&#39;t make the decision for my kids.  They have<br/>\ndecided on their own.  I&#39;m not going to say they have too because I like it<br/>\nand because all the unschoolers think it is cool:)  <br/>\n<br/>\nAnna</div>","specialLinks":[]},{"userId":161002657,"authorName":"AM Brown","from":"&quot;AM Brown&quot; &lt;ambdkf@...&gt;","profile":"ambdkf92","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] television","postDate":"1066431001","msgId":16715,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxMC0yMjAwMzEwNTE3MjI1MDE0NUBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":16714,"nextInTopic":16717,"prevInTime":16714,"nextInTime":16716,"topicId":7187,"numMessagesInTopic":0,"msgSnippet":"... parents ... honest as ... It ... Do you feel like they were always like that?  When the tv thing happened with us they were 2 and 4 now 3 and 5.  I wonder","messageBody":"<div id=\"ygrps-yiv-1562652641\"><blockquote><span title=\"ireply\">&gt; My kids are pretty analytical about other people&#39;s behavior.  They don&#39;t <br/>\n&gt; emulate what they see on TV. They hang out with other families where the<br/>\n </span></blockquote>parents <br/>\n<blockquote><span title=\"ireply\"> &gt; aren&#39;t as nice to their kids, and with some other kids who aren&#39;t as<br/>\n </span></blockquote>honest as <br/>\n<blockquote><span title=\"ireply\"> &gt; they are but it doesn&#39;t make them want to be like those other families. <br/>\n </span></blockquote>It <br/>\n<blockquote><span title=\"ireply\"> &gt; makes them appreciate their own lives more.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Do you feel like they were always like that?  When the tv thing happened<br/>\nwith us they were 2 and 4 now 3 and 5.  I wonder if the difference is that<br/>\nat such a young age they take in info differently or if it is just them/me<br/>\n(i.e. personality).  Maybe we would have had a rough spell and then they<br/>\nwould have worked it out.   I just knew we couldn&#39;t go on like we were and<br/>\nstay sane.  I didn&#39;t think their solution would be to stop  watching  the<br/>\nshows but it was and they honestly haven&#39;t wanted to start back.  It would<br/>\nbe ok with me if they did, I&#39;d just want to talk about the behavior and how<br/>\nwe all feel about it.   It has been really interesting to watch and I&#39;m<br/>\nsure it will continue to change.   <br/>\n<br/>\nAnna</div>","specialLinks":[]},{"userId":154862465,"authorName":"Shyrley","from":"Shyrley &lt;shyrley@...&gt;","profile":"bobalinga","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] television","postDate":"1066430981","msgId":16714,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNGOTA3MjA1LjIwMTAyMDNAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PGFhLjIzYjViODRlLjJjYzFiNWYxQGFvbC5jb20+","referencesHeader":"PGFhLjIzYjViODRlLjJjYzFiNWYxQGFvbC5jb20+"},"prevInTopic":16713,"nextInTopic":16715,"prevInTime":16713,"nextInTime":16715,"topicId":7187,"numMessagesInTopic":0,"msgSnippet":"... Same here. My kids are aware that our lives are different from stuff they watch on TV. They don t emulate Homer Simpson or attempt to fly like Superman.","messageBody":"<div id=\"ygrps-yiv-1743985568\"><a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Tuckervill@...\">Tuckervill@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;In a message dated 10/17/2003 4:11:17 PM Central Daylight Time, <br/>\n&gt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ambdkf@...\">ambdkf@...</a> writes:<br/>\n&gt;As I mentioned in a earlier post,<br/>\n&gt;we have discussed it and my dds came up with something that works for our<br/>\n&gt;family but until we really looked at it they would have just continued on<br/>\n&gt;watching, thinking it was normal and appropriate to treat other people like<br/>\n&gt;crap.<br/>\n&gt;~~~~~~<br/>\n&gt;<br/>\n&gt;Why would they think that if it wasn&#39;t modeled in your home?<br/>\n&gt;<br/>\n&gt;I think my kids put much more stock in the way the actual people in their <br/>\n&gt;lives behave than in what they see actors and cartoons do on television.  <br/>\n&gt;<br/>\n&gt;Tuck<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n </span></blockquote>Same here. My kids are aware that our lives are different from stuff <br/>\nthey watch on TV. They don&#39;t emulate Homer Simpson or attempt to fly <br/>\nlike Superman. They know it is made up stuff. When we watch Eastenders <br/>\nthey are interested in why teens on that show don&#39;t speak to their <br/>\nparents or why pupils on Grange Hill bully each other. Watching it <br/>\ndoesn&#39;t make them want to do it but they find the shows interesting.<br/>\nIn the same way I like watching Buffy but don&#39;t feel the need to go out <br/>\nand karate bad guys. Its escapist fantasy. Sometimes its cathartic.<br/>\nIts the same with adverts. They have never yet asked to go to MacDonalds <br/>\nor buy an SUV or eat meat cos they saw it on the TV. We talk about how <br/>\npeople differ and just cos one family does something then it doesn&#39;t <br/>\nmean everyone has too.<br/>\n<br/>\nIf I wanted to keep them *pure* to my way of thinking then we&#39;d never go <br/>\nout. Most of my friends eat meat. We don&#39;t. Most of my friends coerce <br/>\nand &#39;ground&#39; their kids. We don&#39;t. etc etc.<br/>\nThey are capable of telling the difference between what goes on on TV, <br/>\nother families and our family and making choices. They can watch stuff <br/>\nwithout thinking it is &#39;ok&#39; or &#39;normal&#39; or even &#39;real&#39;.<br/>\n<br/>\nAnd if they didn&#39;t make their own choices about TV then it would be <br/>\ncoercion on my part.<br/>\n<br/>\nShyrley</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] television","postDate":"1066430373","msgId":16713,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM2LjIzYjRlMDBiLjJjYzFjOWE1QGFvbC5jb20+"},"prevInTopic":16710,"nextInTopic":16714,"prevInTime":16712,"nextInTime":16714,"topicId":7187,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/17/2003 3:30:25 PM Mountain Daylight Time, ambdkf@earthlink.net writes: -=-We don t speak to each other that way, yet they were using the","messageBody":"<div id=\"ygrps-yiv-1980042702\">In a message dated 10/17/2003 3:30:25 PM Mountain Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ambdkf@...\">ambdkf@...</a> writes:<br/>\n-=-We don&#39;t speak<br/>\nto each other that way, yet they were using the words they heard Arthur and<br/>\nSagwa used and then fighting with each other and friends. =&#92;=<br/>\n<br/>\n<br/>\nWhen someone is mean on a show like that, the characters usually react to the <br/>\nmeanness or whatever and it becomes part of the story--how to deal with <br/>\nfrustration or bullying or whatever it is.<br/>\n<br/>\nWhen my kids were little, I watched a lot of tv with them and discussed the <br/>\ncharacters&#39; motivations and personalities and what they might have done <br/>\ndifferently. A lot of our conversations are still like that.  Marty, Holly and I <br/>\nwatched The Truman Show (again) last week, and it&#39;s interesting to see their <br/>\nreactions to things as they get older and understand more.  This time, we talked <br/>\nabout the motivation and feelings of the guy who had played his dad, been put <br/>\noff the show and came back.  We talked about the advantages and disadvantages of <br/>\nbeing in a &quot;safe place&quot; as Truman was, but how is sorrow was real when his <br/>\ndad (who wasn&#39;t his real dad but he didn&#39;t know) &quot;died&quot; (in the story).<br/>\n<br/>\nA few days ago Holly was watching Last Action Hero, and I wandered by and <br/>\n&quot;stuck,&quot; and in a while Marty showed up.  It was more of the same discussion of <br/>\nthe nature of reality.<br/>\n<br/>\nI think anything that gets an 11 year old and a 14 year old hanging out with <br/>\ntheir mom talking about philosophy and psychology is a pretty good deal!!<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] television","postDate":"1066429771","msgId":16710,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE2YS4yNTM3Mzg3Yi4yY2MxYzc0YkBhb2wuY29tPg=="},"prevInTopic":16709,"nextInTopic":16713,"prevInTime":16709,"nextInTime":16711,"topicId":7187,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/17/2003 3:11:02 PM Mountain Daylight Time, ambdkf@earthlink.net writes: There are studies showing watching the negativity presented on","messageBody":"<div id=\"ygrps-yiv-1165572330\">In a message dated 10/17/2003 3:11:02 PM Mountain Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ambdkf@...\">ambdkf@...</a> writes:<br/>\nThere are studies showing watching the negativity<br/>\npresented on the evening news effects our bodies. <br/>\nI don&#39;t watch the news.  My kids don&#39;t either.  A few times when someone was <br/>\ngoing to be on we watched the whole show to tape the friend or family member, <br/>\nand that&#39;s theonly time we&#39;ve sat through news.  My husband watches it <br/>\nsometimes, mostly for the weather, but he mutes it if anyone else comes in because <br/>\ncar wrecks and dead babies make me grumpy/sad.<br/>\n<br/>\nMy kids are pretty analytical about other people&#39;s behavior.  They don&#39;t <br/>\nemulate what they see on TV. They hang out with other families where the parents <br/>\naren&#39;t as nice to their kids, and with some other kids who aren&#39;t as honest as <br/>\nthey are but it dosn&#39;t make them want to be like those other families.  It <br/>\nmakes them appreciate their own lives more.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":125185902,"authorName":"fishierich@aol.com","from":"fishierich@...","profile":"rjmjmjnj","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] television","postDate":"1066429074","msgId":16720,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY5LjMyN2ZhNGE3LjJjYzFjNDkyQGFvbC5jb20+"},"prevInTopic":16719,"nextInTopic":16722,"prevInTime":16719,"nextInTime":16721,"topicId":7187,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/17/03 1:47:30 PM Eastern Daylight Time, SandraDodd@aol.com writes: There MUST be people who are finding this list without going to my","messageBody":"<div id=\"ygrps-yiv-353671118\">In a message dated 10/17/03 1:47:30 PM Eastern Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> writes:<br/>\nThere MUST be people who are finding this list without going to my webpage <br/>\nfirst! Wow.<br/>\n<br/>\n&quot;Good for you&quot; about limiting input? <br/>\nAbout limiting freedom?<br/>\n<br/>\nI just don&#39;t understand it.<br/>\n<br/>\nSandra<br/>\nOK! I have gone and read your TV Web page and I don&#39;t disagree with what you <br/>\nand the other people have to say. I feel I am making the best decision for my <br/>\nfamily my children are only 4 years and 18 months. Having the television on <br/>\nall day is not something I want and I live here too. My opinion may change as <br/>\nthey grow older. They will have to make their own choices. Do you think at 4 <br/>\nyears my daughter should be the one deciding what shows to watch?<br/>\nWhat about the influence of commercial TV? Do you not think that has an <br/>\naffect on the gimmes and yes I did read about &#39;Magical Thinking and Spoiled <br/>\nChildren&#39; and agree completely. So does that mean I should not worry about commercial <br/>\nTV? What about the news or just the news flashes? Regular prime-time news <br/>\ncoverage is not really something a 4 year old needs to hear about let alone a 29 <br/>\nyear old. <br/>\nIs there a place for me in the chat group with my views on TV or should I <br/>\nreconsider my involvement in this chat group?<br/>\nMargaret J <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":67247159,"authorName":"Nanci Kuykendall","from":"Nanci Kuykendall &lt;aisliin@...&gt;","profile":"aisliin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"[AlwaysLearning] television","postDate":"1066426551","msgId":16709,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMxMDE3MjEzNTUxLjcwNDYucW1haWxAd2ViMTM3MDQubWFpbC55YWhvby5jb20+","inReplyToHeader":"PDEwNjY0MTI0ODcuMzA5NC4zNTU4MC5tMUB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":16708,"nextInTopic":16710,"prevInTime":16708,"nextInTime":16710,"topicId":7187,"numMessagesInTopic":0,"msgSnippet":"... We own a tv, but we get no reception out here in the mountains and we don t have cable or anything like that, nor do we want it.  For me, I have trouble","messageBody":"<div id=\"ygrps-yiv-1268021984\"><blockquote><span title=\"ireply\">&gt;For a multitide of reasons my family does not own a<br/>\n&gt;TV & we have no intention of getting one anytime<br/>\n&gt;soon.  Are there any other unschoolers out there<br/>\n&gt;that are living TV free?<br/>\n<br/>\n </span></blockquote>We own a tv, but we get no reception out here in the<br/>\nmountains and we don&#39;t have cable or anything like<br/>\nthat, nor do we want it.  For me, I have trouble with<br/>\nsorting, and the speed and obnoxiousness of commercial<br/>\nprogramming, and so does my son.  The noise alone<br/>\ngives me a headache, not to mention the video.  We do<br/>\nhave a moderate video collection, including a bunch of<br/>\nkids&#39; movies, a fair sized collection of other movies,<br/>\nand a handful of dvds.  My older son wants to be a<br/>\ndirector when he grows up, and has a serious and<br/>\nsophisticated passion for movies.  I expect one of<br/>\nthese days, when he is old enough to take care of it,<br/>\nwe&#39;ll get him digital equipment for making his own<br/>\nfilms, which he really wants.<br/>\n<br/>\nThe  kids watch 1 or 2 movies a day, sometimes more,<br/>\nsometimes less.  We occassionaly sit in with them if<br/>\nthey are watching movies we also like, and every once<br/>\nin a while hubby and I make popcorn and plan to watch<br/>\na movie in our collection we have not seen in a while,<br/>\nor even more rarely we actually rent something.  <br/>\n<br/>\nWe&#39;re not at all versed in the current sitcoms,<br/>\ncartoons or tv shows, and don&#39;t miss them at all.   <br/>\nBetween the computer, books and movies, I already have<br/>\nto tear myself away to take care of my chores and<br/>\nother obligations, and I&#39;m plenty busy with those. <br/>\nThe kids have the computer, the internet access, the<br/>\nlibrary and their video collection and don&#39;t miss the<br/>\ncommercial tv.  They occassionally catch programs at<br/>\ncousins or grandparents houses, but they never lament<br/>\nnot having them at home.<br/>\n<br/>\nNanci K.</div>","specialLinks":[]},{"userId":161002657,"authorName":"AM Brown","from":"&quot;AM Brown&quot; &lt;ambdkf@...&gt;","profile":"ambdkf92","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] television","postDate":"1066426026","msgId":16708,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxMC0yMjAwMzEwNTE3MjEyNzY0ODJAZWFydGhsaW5rLm5ldD4="},"prevInTopic":16707,"nextInTopic":16709,"prevInTime":16707,"nextInTime":16709,"topicId":7187,"numMessagesInTopic":0,"msgSnippet":"... I would have totally agreed had I not seen it in my kids.  We don t speak to each other that way, yet they were using the words they heard Arthur and Sagwa","messageBody":"<div id=\"ygrps-yiv-594278315\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; Why would they think that if it wasn&#39;t modeled in your home?<br/>\n&gt;<br/>\n&gt; I think my kids put much more stock in the way the actual people in their <br/>\n&gt; lives behave than in what they see actors and cartoons do on television.  <br/>\n&gt;<br/>\n </span></blockquote>I would have totally agreed had I not seen it in my kids.  We don&#39;t speak<br/>\nto each other that way, yet they were using the words they heard Arthur and<br/>\nSagwa used and then fighting with each other and friends.  When they<br/>\nstopped watching and were just hearing the words we, their extended family<br/>\nmembers and friends used they stopped.  I found it all fascinating.  I<br/>\nthink it is great if it is working for your family.  I&#39;m not trying to say<br/>\nanyone should do what we did.  It just happened that is what worked for us.<br/>\n<br/>\n<br/>\nI also meant to be clear in my earlier post, and I wasn&#39;t, that I think<br/>\nthis applies to adults too.  Maybe it is just sensitive adults but I am<br/>\neffected by what I see and so are my dds so maybe it is just genetic in our<br/>\ncase:)<br/>\n<br/>\nAnna</div>","specialLinks":[]},{"userId":96795689,"authorName":"Tuckervill@aol.com","from":"Tuckervill@...","profile":"tuckervill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] television","postDate":"1066425427","msgId":16707,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEwZS4yNzY1OTJiNi4yY2MxYjY1M0Bhb2wuY29tPg=="},"prevInTopic":16706,"nextInTopic":16708,"prevInTime":16706,"nextInTime":16708,"topicId":7187,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/17/2003 4:11:17 PM Central Daylight Time, ambdkf@earthlink.net writes: There are studies showing watching the negativity presented on the","messageBody":"<div id=\"ygrps-yiv-87222788\">In a message dated 10/17/2003 4:11:17 PM Central Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ambdkf@...\">ambdkf@...</a> writes:<br/>\nThere are studies showing watching the negativity<br/>\npresented on the evening news effects our bodies.     <br/>\n~~~~<br/>\nShow me a study done on unschooled adults or kids, then I&#39;ll listen.<br/>\n<br/>\n~~~~<br/>\nMy kids are &#39;amazing&#39;<br/>\nsponges and I do think it is worth a look at what things surround them.  <br/>\nNo one said they weren&#39;t taking a look at what things surround their kids.<br/>\n<br/>\nTuck<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":96795689,"authorName":"Tuckervill@aol.com","from":"Tuckervill@...","profile":"tuckervill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] television","postDate":"1066425329","msgId":16706,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGFhLjIzYjViODRlLjJjYzFiNWYxQGFvbC5jb20+"},"prevInTopic":16705,"nextInTopic":16707,"prevInTime":16705,"nextInTime":16707,"topicId":7187,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/17/2003 4:11:17 PM Central Daylight Time, ambdkf@earthlink.net writes: As I mentioned in a earlier post, we have discussed it and my dds","messageBody":"<div id=\"ygrps-yiv-17234305\">In a message dated 10/17/2003 4:11:17 PM Central Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ambdkf@...\">ambdkf@...</a> writes:<br/>\nAs I mentioned in a earlier post,<br/>\nwe have discussed it and my dds came up with something that works for our<br/>\nfamily but until we really looked at it they would have just continued on<br/>\nwatching, thinking it was normal and appropriate to treat other people like<br/>\ncrap.<br/>\n~~~~~~<br/>\n<br/>\nWhy would they think that if it wasn&#39;t modeled in your home?<br/>\n<br/>\nI think my kids put much more stock in the way the actual people in their <br/>\nlives behave than in what they see actors and cartoons do on television.  <br/>\n<br/>\nTuck<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":161002657,"authorName":"AM Brown","from":"&quot;AM Brown&quot; &lt;ambdkf@...&gt;","profile":"ambdkf92","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] television","postDate":"1066424532","msgId":16705,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxMC0yMjAwMzEwNTE3MjEyMTI0MzRAZWFydGhsaW5rLm5ldD4="},"prevInTopic":16704,"nextInTopic":16706,"prevInTime":16704,"nextInTime":16706,"topicId":7187,"numMessagesInTopic":0,"msgSnippet":"... I m always astounded when people think that surrounding kids with negative talk and images doesn t have an effect:) I haven t been called stupid or been","messageBody":"<div id=\"ygrps-yiv-1221021359\"><blockquote><span title=\"ireply\">&gt; I&#39;m always astounded that people think their kids are dumb sponges who <br/>\n&gt; will be negatively influenced by every passing image on the TV.<br/>\n&gt;<br/>\n&gt; Shyrley<br/>\n&gt;<br/>\n </span></blockquote>I&#39;m always astounded when people think that surrounding kids with negative<br/>\ntalk and images doesn&#39;t have an effect:) <br/>\n<br/>\n I haven&#39;t been called stupid or been told that someone hates me in decades<br/>\n- since being in school!  Yet everyday on TV, children&#39;s favorite<br/>\ncharacters are calling people horrible names and treating them in<br/>\nunimaginable ways - so which is normal?   As I mentioned in a earlier post,<br/>\nwe have discussed it and my dds came up with something that works for our<br/>\nfamily but until we really looked at it they would have just continued on<br/>\nwatching, thinking it was normal and appropriate to treat other people like<br/>\ncrap.  As they get older I&#39;m sure they will choose to watch all kinds of<br/>\nthings and that will be their choice (as it is now), but to think it won&#39;t<br/>\nimpact them in crazy.  There are studies showing watching the negativity<br/>\npresented on the evening news effects our bodies.     My kids are &#39;amazing&#39;<br/>\nsponges and I do think it is worth a look at what things surround them.  <br/>\nWith them I have seen living peacefully gives them strength to deal with<br/>\nthe tough times and hard issues that inevitably arise in real relationships<br/>\nnot ones dreamed up by people that have a belief that kids are mean<br/>\nspirited and can&#39;t get along with siblings or their parents.   But again,<br/>\nfor me it is not about TV good or bad, but about coercion.  We choose not<br/>\nto be coercive and figure out together how to live peacefully as a family.  <br/>\n<br/>\nAnna</div>","specialLinks":[]},{"userId":154862465,"authorName":"Shyrley","from":"Shyrley &lt;shyrley@...&gt;","profile":"bobalinga","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] television","postDate":"1066422381","msgId":16704,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNGOTA1MDZELjIwMzA3MDlAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PDE1OS4yNjY0ZmZkNy4yY2MxODQ2OUBhb2wuY29tPg==","referencesHeader":"PDE1OS4yNjY0ZmZkNy4yY2MxODQ2OUBhb2wuY29tPg=="},"prevInTopic":16703,"nextInTopic":16705,"prevInTime":16703,"nextInTime":16705,"topicId":7187,"numMessagesInTopic":0,"msgSnippet":"... I m always astounded that people think their kids are dumb sponges who will be negatively influenced by every passing image on the TV. Shyrley","messageBody":"<div id=\"ygrps-yiv-1190865579\"><a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;In a message dated 10/17/03 11:27:08 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fishierich@...\">fishierich@...</a> writes:<br/>\n&gt;<br/>\n&gt;&lt;&lt; So <br/>\n&gt;the only happy medium is no television during the day and when daddy comes <br/>\n&gt;home <br/>\n&gt;then it can be on. I&#39;m a lucky women because my husband is great; but oh the <br/>\n&gt;TV. Good for you to not have the TV influence your children or family time. &gt;&gt;<br/>\n&gt;<br/>\n&gt;There MUST be people who are finding this list without going to my webpage <br/>\n&gt;first! Wow.<br/>\n&gt;<br/>\n&gt;&quot;Good for you&quot; about limiting input? <br/>\n&gt;About limiting freedom?<br/>\n&gt;<br/>\n&gt;I just don&#39;t understand it.<br/>\n&gt;<br/>\n&gt;Sandra<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n </span></blockquote>I&#39;m always astounded that people think their kids are dumb sponges who <br/>\nwill be negatively influenced by every passing image on the TV.<br/>\n<br/>\nShyrley</div>","specialLinks":[]},{"userId":136806886,"authorName":"Dawn Bennink","from":"Dawn Bennink &lt;dbennink@...&gt;","profile":"mhbmommy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] television","postDate":"1066418559","msgId":16703,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNGOTA0MTdGLjYwMjAzQG1hZGJicy5jb20+","referencesHeader":"PDE1OS4yNjY0ZmZkNy4yY2MxODQ2OUBhb2wuY29tPg=="},"prevInTopic":16696,"nextInTopic":16704,"prevInTime":16702,"nextInTime":16704,"topicId":7187,"numMessagesInTopic":0,"msgSnippet":"I m jumping in right here, after just joining, but what the heck. I don t limit my children s tv time.  I do discuss with them shows that I don t think are","messageBody":"<div id=\"ygrps-yiv-107947154\">I&#39;m jumping in right here, after just joining, but what the heck.<br/>\n<br/>\nI don&#39;t limit my children&#39;s tv time.  I do discuss with them shows that <br/>\nI don&#39;t think are appropriate for them to watch and why, and we have had <br/>\nno issue with that.  They have decided after viewing just a few minutes <br/>\nof some shows that they have no desire to see people behaving that <br/>\nbadly, even if they are cartoon people (or animals or whatever).  I also <br/>\nlet them make the choice how much to watch, keeping in mind that there <br/>\nare so many more wonderful things to do than sit and watch tv. After <br/>\nall, it is all part of this world in which they live.  If they don&#39;t <br/>\never see the bad or make their own choices for moderation now, how will <br/>\nthey be equipped to deal with life as adults.<br/>\n<br/>\nLastly, there is so much on cable that is wonderful for kids and adults <br/>\nalike that I would hate to keep them all of from it because of some of <br/>\nthe rottenness out there.  If they are making choices to watch things <br/>\nlike Emeril Live, This Old House, Magic Schoolbus and other such <br/>\nprograms at 3 & 7, and self-limiting the time they spend doing it, how <br/>\ncan I complain too much.<br/>\n<br/>\nDawn</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] television","postDate":"1066412649","msgId":16696,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1OS4yNjY0ZmZkNy4yY2MxODQ2OUBhb2wuY29tPg=="},"prevInTopic":16692,"nextInTopic":16703,"prevInTime":16695,"nextInTime":16697,"topicId":7187,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/17/03 11:27:08 AM, fishierich@aol.com writes: ","messageBody":"<div id=\"ygrps-yiv-1824263188\">In a message dated 10/17/03 11:27:08 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fishierich@...\">fishierich@...</a> writes:<br/>\n<br/>\n&lt;&lt; So <br/>\nthe only happy medium is no television during the day and when daddy comes <br/>\nhome <br/>\nthen it can be on. I&#39;m a lucky women because my husband is great; but oh the <br/>\nTV. Good for you to not have the TV influence your children or family time. &gt;&gt;<br/>\n<br/>\nThere MUST be people who are finding this list without going to my webpage <br/>\nfirst! Wow.<br/>\n<br/>\n&quot;Good for you&quot; about limiting input? <br/>\nAbout limiting freedom?<br/>\n<br/>\nI just don&#39;t understand it.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":2300774,"authorName":"Betsy","from":"Betsy &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] television","postDate":"1066406741","msgId":16686,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNGOTAxMzU1LjgwNzAwMDFAZWFydGhsaW5rLm5ldD4=","referencesHeader":"PDFhMy4xYjk5YzRlZC4yY2MxNWUzZkBhb2wuY29tPg=="},"prevInTopic":16682,"nextInTopic":16692,"prevInTime":16685,"nextInTime":16687,"topicId":7187,"numMessagesInTopic":0,"msgSnippet":"**We don t spring for cable TV but if we weren t right down the hill from the broadcast towers we probably would.** We got satellite two weeks ago because our","messageBody":"<div id=\"ygrps-yiv-675895791\">**We don&#39;t spring for cable TV but if we weren&#39;t right down the hill <br/>\nfrom the<br/>\nbroadcast towers we probably would.**<br/>\n<br/>\nWe got satellite two weeks ago because our reception has been so <br/>\nscratchy and limited.  My son literally danced around the house singing <br/>\nHallelujah!  (Put a smile on my face.)<br/>\n<br/>\nWe&#39;re in that awkward transition period where I&#39;m still amazed how many <br/>\ntimes a day he can watch Scooby Doo, and he&#39;s probably amazed how many <br/>\ntimes a day I can watch Changing Rooms. &lt;g&gt;  (Two TVs.)<br/>\n<br/>\nToday we&#39;re off for a long day in the park with a small group of <br/>\nfriends, and an evening sleepover with an out of town friend.  So we&#39;re <br/>\nachieving a decent balance.<br/>\n<br/>\nBut any day now I&#39;m going to submit to the brainwashing power of TV and <br/>\nstart painting the house in hot colors. &lt;g&gt;<br/>\n<br/>\nBetsy<br/>\n<br/>\n**I think it&#39;s part of the text-worship of the English speaking world.<br/>\nEngland itself is not even as visually oriented as lots of other <br/>\nEuropean cultures<br/>\nwhere street performances and music are more respected and common, but <br/>\nthe U.S.<br/>\nhas that prejudice HUGELY ingrained.**<br/>\n<br/>\nYeah, a book *without* pictures is not &quot;better&quot; and more sophisticated <br/>\nthan a book with pictures.  Pictures add content and moving pictures add <br/>\nmore content.  If one wants to provoke text-loving people, ask them if <br/>\nthey think National Geographic magazine would be better without pictures.<br/>\n<br/>\nnew topic<br/>\n**When people who didn&#39;t watch the show anyway write and say &quot;I was <br/>\noffended and won&#39;t watch your program again&quot; they&#39;re lying.**<br/>\n<br/>\nWell, I didn&#39;t watch the show because I don&#39;t watch TV news much.  But I <br/>\ndid read the full transcripts and I WAS offended.  I didn&#39;t need HSLDA <br/>\nto tell me to be offended.  In my letter I said I would &quot;avoid their <br/>\nnews shows in the future&quot; because I didn&#39;t respect the thoughtfulness of <br/>\ntheir reporting.  I also said &quot;I expected better from CBS.&quot;  I didn&#39;t <br/>\nclaim to be a faithful viewer who was breaking it off with them forever.<br/>\n<br/>\nI thought about suggesting that they fire the segment producer, but I <br/>\ndecided not to be that pissy about it.</div>","specialLinks":[]},{"userId":125185902,"authorName":"fishierich@aol.com","from":"fishierich@...","profile":"rjmjmjnj","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] television","postDate":"1066406117","msgId":16692,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ4LjIzOTk3OWVmLjJjYzE2YWU1QGFvbC5jb20+"},"prevInTopic":16686,"nextInTopic":16696,"prevInTime":16691,"nextInTime":16693,"topicId":7187,"numMessagesInTopic":0,"msgSnippet":"Are there any other installers out there that are living TV Free? I wish we could be TV free. There are lots of issues my husband just goes along with in the","messageBody":"<div id=\"ygrps-yiv-1112181550\">Are there any other installers out there that are living TV <br/>\nFree?<br/>\n<br/>\nI wish we could be TV free. There are lots of issues my husband just goes <br/>\nalong with in the parenting world; but not having a TV is not one of them. I&#39;d <br/>\nalso love to get rid of cable; what I could do with the extra $42 a month. So <br/>\nthe only happy medium is no television during the day and when daddy comes home <br/>\nthen it can be on. I&#39;m a lucky women because my husband is great; but oh the <br/>\nTV. Good for you to not have the TV influence your children or family time.<br/>\nMargaret<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] television","postDate":"1066402879","msgId":16682,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFhMy4xYjk5YzRlZC4yY2MxNWUzZkBhb2wuY29tPg=="},"prevInTopic":16677,"nextInTopic":16686,"prevInTime":16681,"nextInTime":16683,"topicId":7187,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/17/03 3:06:34 AM, ndb1499@bellsouth.net writes: ","messageBody":"<div id=\"ygrps-yiv-353831807\">In a message dated 10/17/03 3:06:34 AM, ndb1499@... writes:<br/>\n<br/>\n&lt;&lt; I understand the idea <br/>\n<br/>\nof not restricting the time or content of TV if you have one, but we <br/>\n<br/>\ndon&#39;t.  Are there any other unschoolers out there that are living TV <br/>\n<br/>\nfree?<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;<br/>\n<br/>\n </span></blockquote>I just got e-mail from a mom who lives rurally in New Mexico, whose kids are <br/>\nabout my kids&#39; ages, who are feeling very isolated, who don&#39;t live near enough <br/>\nto come in to Albuquerque very often, AND she says they don&#39;t let them watch <br/>\nTV.<br/>\n<br/>\nI&#39;ve written back to ask whether they don&#39;t even allow movies, and why.<br/>\n<br/>\nThat&#39;s like closing all the windows.  Bad enough to live TRULY in the desert, <br/>\nnear where a new casino&#39;s being built and nothing more.  They jump on a <br/>\ntrampoline and play basketball, and while those two things are wonderful things, <br/>\nthey can jump on the trampoline all day and not see any Shakespeare or pictures <br/>\nof Africa or hear Japanese drummers.<br/>\n<br/>\nWe don&#39;t spring for cable TV but if we weren&#39;t right down the hill from the <br/>\nbroadcast towers we probably would.<br/>\n<br/>\nI think it&#39;s part of the text-worship of the English speaking world.   <br/>\nEngland itself is not even as visually oriented as lots of other European cultures <br/>\nwhere street performances and music are more respected and common, but the U.S. <br/>\nhas that prejudice HUGELY ingrained.<br/>\n<br/>\nFrom reading Howard Gardner&#39;s stuff on multiple intelligences in &quot;Frames of <br/>\nMind,&quot; I just totally gave up my pro-text prejudice.<br/>\n<br/>\nI was a good reader and a &quot;good student,&quot; and I accepted that I was doing a <br/>\nbetter thing by reading Poe and Dickens than just about anything else I could <br/>\nhave done.  I no longer feel that way.<br/>\n<br/>\nI thought about that really hard, about why my  kids don&#39;t like books as much <br/>\nas I did and I came to the conclusso healthy.<br/>\n<br/>\nhttp://bookandsax<br/>\n<br/>\nThere&#39;s my summary of that, though.<br/>\n<br/>\nAnd my collection of TV writings (not just mine) is here:<br/>\n<br/>\nhttp://sandradodd.com/tv<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] television","postDate":"1066391775","msgId":16677,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJCQjU1MTFGLjFGQzIyJWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGJtbm5iNStxdTVuQGVHcm91cHMuY29tPg=="},"prevInTopic":16672,"nextInTopic":16682,"prevInTime":16676,"nextInTime":16678,"topicId":7187,"numMessagesInTopic":0,"msgSnippet":"... If your whole family has decided not to have TV then is there anything to discuss? What if someone had written: For a multitide of reasons my family does","messageBody":"<div id=\"ygrps-yiv-1715893189\">on 10/16/03 11:23 PM, Kathy at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ndb1499@...\">ndb1499@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Are there any other unschoolers out there that are living TV<br/>\n&gt; free?<br/>\n<br/>\n </span></blockquote>If your whole family has decided not to have TV then is there anything to<br/>\ndiscuss?<br/>\n<br/>\nWhat if someone had written:<br/>\n<br/>\nFor a multitide of reasons my family does not own any books & we have no<br/>\nintention of getting any anytime soon. I understand the idea<br/>\nof not restricting the time or content of book reading if you have them, but<br/>\nwe don&#39;t.<br/>\n<br/>\nIf *your family* has decided they don&#39;t want TV then that&#39;s what your family<br/>\nwants.<br/>\n<br/>\nBut if by &quot;my family&quot; you mean you and your husband, then what you&#39;re<br/>\nwanting to discuss is restricting children&#39;s access to a resource. And it&#39;s<br/>\nno different than discussing restricting access to books or the internet.<br/>\n<br/>\nIf someone doesn&#39;t have TV reception and cable is beyond their means, then<br/>\nit&#39;s useful to discuss ways that kids to get access to the world beyond<br/>\ntheir horizons.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":147655303,"authorName":"Kathy","from":"&quot;Kathy&quot; &lt;ndb1499@...&gt;","profile":"ndbwgb","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"television","postDate":"1066360997","msgId":16672,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJtbm5iNStxdTVuQGVHcm91cHMuY29tPg=="},"prevInTopic":7188,"nextInTopic":16677,"prevInTime":16671,"nextInTime":16673,"topicId":7187,"numMessagesInTopic":0,"msgSnippet":"For a multitide of reasons my family does not own a TV & we have no intention of getting one anytime soon.  I have read the many posts here on TV & heard","messageBody":"<div id=\"ygrps-yiv-1556901763\">For a multitide of reasons my family does not own a TV & we have no <br/>\nintention of getting one anytime soon.  I have read the many posts <br/>\nhere on TV & heard Sandra Dodd talk about it.  I understand the idea <br/>\nof not restricting the time or content of TV if you have one, but we <br/>\ndon&#39;t.  Are there any other unschoolers out there that are living TV <br/>\nfree?</div>","specialLinks":[]},{"userId":90564959,"authorName":"starsuncloud@cs.com","from":"starsuncloud@...","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"television","postDate":"1021822571","msgId":7188,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE3ZS44ODdkOGVkLjJhMTkyMDZiQGNzLmNvbT4="},"prevInTopic":7187,"nextInTopic":16672,"prevInTime":7187,"nextInTime":7189,"topicId":7187,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/19/02 12:28:39 AM Central Daylight Time, AlwaysLearning@yahoogroups.com writes: ","messageBody":"<div id=\"ygrps-yiv-2104770383\">In a message dated 5/19/02 12:28:39 AM Central Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a> writes:<br/>\n<br/>\n&lt;&lt;  I usually rejoin with,<br/>\n &quot;Really? We watched the PowerPuff Girl Marathon last night until 2 a.m.!&quot;<br/>\n &lt;g&gt;<br/>\n <br/>\n Pam, very very bad &gt;&gt;<br/>\n<br/>\nGee Pam, I already liked you....now you&#39;re my hero!!!  Isn&#39;t it fun to watch <br/>\nthe looks of horror?<br/>\nRen</div>","specialLinks":[]},{"userId":90564959,"authorName":"starsuncloud@cs.com","from":"starsuncloud@...","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"television","postDate":"1021822470","msgId":7187,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzOC5lODI4Zjc4LjJhMTkyMDA2QGNzLmNvbT4="},"prevInTopic":0,"nextInTopic":7188,"prevInTime":7186,"nextInTime":7188,"topicId":7187,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/19/02 12:28:39 AM Central Daylight Time, AlwaysLearning@yahoogroups.com writes: ","messageBody":"<div id=\"ygrps-yiv-832422661\">In a message dated 5/19/02 12:28:39 AM Central Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a> writes:<br/>\n<br/>\n&lt;&lt; Has anyone else had to combat this pressure from society, family and <br/>\nfriends<br/>\n regarding unlimited TV?  I be really interested in hearing some stories<br/>\n about that.<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;<br/>\n<br/>\n </span></blockquote>Well....you could say the pressure in my family is like no other. I grew up <br/>\nwithout tv, everyone in our church didn&#39;t have tv. It was villified to no end <br/>\nin the entire church...still is.<br/>\nIt was implied that you were going to hell in a hand basket if you owned one. <br/>\n&quot;Wordly influence&quot; and all that jazz.<br/>\nWell, my entire family still goes to that church, and the anti-tv feelings <br/>\nrun strong. They don&#39;t give me any crap about it though. At least my Dad and <br/>\nsisters who have all loosened up considerably over the years. One sis owns a <br/>\ntv even. ooooooh.<br/>\nMy Dad will sometimes make some anti-tv remark, but never AT me, just in <br/>\ngeneral. He&#39;s  a really cool guy though, very much the type that can disagree <br/>\nbut not be negative or say anything. <br/>\nIf my one Grandmother knew how I did things from day to day, I&#39;d never hear <br/>\nthe end of it!!!<br/>\nRen</div>","specialLinks":[]}],"prevTopicId":21440,"nextTopicId":21378}}