{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":12,"messages":[{"userId":124256069,"authorName":"Bun","from":"&quot;Bun&quot; &lt;alohabun@...&gt;","profile":"alohabun","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Privacy issues in the home, saying &quot;this is private&quot;","postDate":"1270051645","msgId":52421,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhvdnJ2dCtqMTBiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDUzOTU1NS44NDQzMC5xbUB3ZWIxMTA0MTUubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":52418,"nextInTopic":0,"prevInTime":52420,"nextInTime":52422,"topicId":52387,"numMessagesInTopic":0,"msgSnippet":"I am so glad when my kids ask questions about things I am doing.  It shows they are interested in what might be going on and it usually leads to many great","messageBody":"<div id=\"ygrps-yiv-1925643041\">I am so glad when my kids ask questions about things I am doing.  It shows they are interested in what might be going on and it usually leads to many great discussions for all ages (we have a kids aged 12, 8, 4 and 1).  I find that answering quesitons is a big part of how we live in general.  <br/>\n<br/>\nI asked my daughter Katie (12) last night about this topic and what she thought.  She said that if she heard me mention something about ten oclock, she would want to ask me about it because she might feel excited that we might be doing something at that time and want to be sure she could fit it in her day (she has plans of what she likes to do during the day too!).  <br/>\n<br/>\nI know though if I am trying to concentrate sometimes, that is a time when I might feel like I want to have more quiet by me - which I sometimes might ask for too.  If I get it, great.  If not, I either postpone the activity that req&#39;d my concentration, do my best to finish quickly or let it go.  Laurie</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Privacy issues in the home, saying &quot;this is private&quot;","postDate":"1269996013","msgId":52418,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk3NDc2NS43NjI5NC5xbUB3ZWIxMTA0MDYubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PDRCQjI4ODk4LjMwNTAxQGVhcnRobGluay5uZXQ+","referencesHeader":"PDUwODUzNi4yMjE0OS5xbUB3ZWI2MDYuYml6Lm1haWwubXVkLnlhaG9vLmNvbT4gPDUzOTU1NS44NDQzMC5xbUB3ZWIxMTA0MTUubWFpbC5ncTEueWFob28uY29tPiA8NEJCMjg4OTguMzA1MDFAZWFydGhsaW5rLm5ldD4="},"prevInTopic":52417,"nextInTopic":52421,"prevInTime":52417,"nextInTime":52419,"topicId":52387,"numMessagesInTopic":0,"msgSnippet":"***Lots of adults act like kids have an obligation to share everything in their heads with any adult who asks And they act like parents have a right to know","messageBody":"<div id=\"ygrps-yiv-1141236712\">***Lots <br/>\nof adults act like kids have an obligation to share everything in their <br/>\nheads with any adult who asks And they act like parents have a right to <br/>\nknow what they&#39;re even just thinking about. That&#39;s not very respectful.***<br/>\n<br/>\nOh right!  That breaks my heart!  The enormous disrespectful invasion of privacy!  Chamille left her phone in Cyle&#39;s dad&#39;s car once and Cyle&#39;s dad, thinking it was Cyle&#39;s phone snooped into it.  He read text messages, looked at pictures, everything.  Chamille felt hugely violated.  I told him off.  But even if it had been Cyle&#39;s phone, it would&#39;ve really sucked for Cyle.  Why any parent would do that is beyond me!  Cyle&#39;s dad felt completely within his rights as a parent to do that too, actually grounded Cyle and sent him to his mom&#39;s house based on the content of some of the texts in the phone.  The whole event was horrible.  Now they erase EVERYthing on their phones, which is a good thing I guess, but really sucks to need to just because they fear one person who feels righteous in snooping.<br/>\n<br/>\nThat event sealed the deal on how Chamille feels about Cyle&#39;s dad.  She didn&#39;t like him much before, but was forgiving of the dumb things he did, angry at the mean stuff, but still open to believing that he might one day be decent.  She won&#39;t even go over to their house anymore, won&#39;t even say &quot;hello&quot; to him, nothing, complete stone wall.  She might get over it one day, but I doubt any time soon and this happened many months ago!<br/>\n<br/>\n***I think the privacy need <br/>\ngoes more in that direction than in the parents&#39; need for privacy.***<br/>\n<br/>\nI absolutely agree with this!  When I clean Chamille&#39;s room, I&#39;m really careful not to read notes and stuff.  I don&#39;t read over her shoulder when she&#39;s online or texting.  I WANT her to feel like she can hang out in the same room as me and do her thing while I do mine. <br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Privacy issues in the home, saying &quot;this is private&quot;","postDate":"1269991849","msgId":52417,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1MkYxMDBFLTJCQkMtNEU0RS1BODAwLTQyQkMyQjY0QTQyOUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDRCQjI4ODk4LjMwNTAxQGVhcnRobGluay5uZXQ+","referencesHeader":"PDUwODUzNi4yMjE0OS5xbUB3ZWI2MDYuYml6Lm1haWwubXVkLnlhaG9vLmNvbT4gPDUzOTU1NS44NDQzMC5xbUB3ZWIxMTA0MTUubWFpbC5ncTEueWFob28uY29tPiA8NEJCMjg4OTguMzA1MDFAZWFydGhsaW5rLm5ldD4="},"prevInTopic":52416,"nextInTopic":52418,"prevInTime":52416,"nextInTime":52418,"topicId":52387,"numMessagesInTopic":0,"msgSnippet":"-=-Lots of adults act like kids have an obligation to share everything in their heads with any adult who asks And they act like parents have a right to know","messageBody":"<div id=\"ygrps-yiv-1839717321\">-=-Lots<br/>\nof adults act like kids have an obligation to share everything in their<br/>\nheads with any adult who asks And they act like parents have a right to<br/>\nknow what they&#39;re even just thinking about. That&#39;s not very  <br/>\nrespectful.-=-<br/>\n<br/>\nTrue, and especially if the parents have said &quot;none of your business&quot;  <br/>\nor anything like that very much.<br/>\n<br/>\nLast night on Two and a Half Men (yeah, I know; you wouldn&#39;t think it  <br/>\nwould be a great parenting-model show), Jake (the teenaged boy) asks  <br/>\nhis dad and uncle, after they all watch a TV commercial about men&#39;s  <br/>\nurinary or prostate problems or something, whether either of them has  <br/>\nexcessive urination.  They discussed it with him, humorously, saying  <br/>\nno, but it depends what you mean by &quot;excessive&quot; (or whatever the term  <br/>\nwas) and his dad admits he goes four times a night.<br/>\n<br/>\nBut the point is they took it as a real question and answered it.  And  <br/>\nI thought about the question on this list. &lt;g&gt;<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Privacy issues in the home, saying &quot;this is private&quot;","postDate":"1269991576","msgId":52416,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCQjI4ODk4LjMwNTAxQGVhcnRobGluay5uZXQ+","inReplyToHeader":"PDUzOTU1NS44NDQzMC5xbUB3ZWIxMTA0MTUubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PDUwODUzNi4yMjE0OS5xbUB3ZWI2MDYuYml6Lm1haWwubXVkLnlhaG9vLmNvbT4gPDUzOTU1NS44NDQzMC5xbUB3ZWIxMTA0MTUubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":52415,"nextInTopic":52417,"prevInTime":52415,"nextInTime":52417,"topicId":52387,"numMessagesInTopic":0,"msgSnippet":"... I agree 100 percent. But - there are times kids, even open and talkative and not-at-all secretive kids, will want privacy - things they ll be thinking","messageBody":"<div id=\"ygrps-yiv-1930746849\">On 3/30/2010 4:21 PM, Jenny Cyphers wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I think the relationship that we have with our kids and their friends <br/>\n&gt; is a direct relation to how open and honest we&#39;ve been with them over <br/>\n&gt; the years. There are few things that are truly private.<br/>\n<br/>\n </span></blockquote>I agree 100 percent.<br/>\n<br/>\nBut - there are times kids, even open and talkative and not-at-all <br/>\nsecretive kids, will want privacy - things they&#39;ll be thinking about <br/>\nthat they&#39;re not ready to discuss with parents. I think the privacy need <br/>\ngoes more in that direction than in the parents&#39; need for privacy. Lots <br/>\nof adults act like kids have an obligation to share everything in their <br/>\nheads with any adult who asks And they act like parents have a right to <br/>\nknow what they&#39;re even just thinking about. That&#39;s not very respectful.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Privacy issues in the home, saying &quot;this is private&quot;","postDate":"1269991293","msgId":52415,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUzOTU1NS44NDQzMC5xbUB3ZWIxMTA0MTUubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PDUwODUzNi4yMjE0OS5xbUB3ZWI2MDYuYml6Lm1haWwubXVkLnlhaG9vLmNvbT4=","referencesHeader":"PDUwODUzNi4yMjE0OS5xbUB3ZWI2MDYuYml6Lm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":52405,"nextInTopic":52416,"prevInTime":52414,"nextInTime":52416,"topicId":52387,"numMessagesInTopic":0,"msgSnippet":"***Because we ve shared with our children, they ve been open to share with us.  I know things Marty s girlfriend has said that I don t think she would be happy","messageBody":"<div id=\"ygrps-yiv-573311328\">***Because we&#39;ve shared with our children, they&#39;ve been open to share with us.  I know things Marty&#39;s girlfriend has said that I don&#39;t think she would be happy to have had shared, because she&#39;s from a sneaky family, but Marty&#39;s used to being open about things.  Holly and Kirby, too.  They will talk, and I will listen and so when they&#39;ve had problems I haven&#39;t said &quot;none of my business&quot; and they haven&#39;t grown up thinking people should have a big bubble of privacy and secrecy.***<br/>\n<br/>\nChamille&#39;s boyfriend is very private and secretive and sneaky when it comes to his life and his father.  With us, it took a while to get to a place of complete honesty, but he did get there.  We know everything that goes on in their lives and the lives of their friends.  <br/>\n<br/>\nThere have been times when I would like to openly discuss things with his father, but I can&#39;t even begin to do that without breaking a lot of trust and probably getting him in loads of trouble!<br/>\n<br/>\nI think the relationship that we have with our kids and their friends is a direct relation to how open and honest we&#39;ve been with them over the years.  There are few things that are truly private.   <br/>\n<br/>\nChamille has always been a secret keeper for her friends.  I&#39;ve never tried to pry information out of her.  I&#39;ve always let her have private emails, private journals, private texting, and private phone conversations.  She&#39;s always accepted that others have needs for privacy, the same way that she does.  Some kids let everything out in the open and don&#39;t have that intense need for privacy.<br/>\n<br/>\nI think too much privacy is probably not such a good idea.  I find that uncomfortable honesty has always been better than trying to keep information from being shared.  <br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Privacy issues in the home, saying &quot;this is \tprivate&quot;","postDate":"1269917843","msgId":52405,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNhOTNmZmYxMTAwMzI5MTk1N203OTEzZjkzMW41NTkzYWJjODk4ZTI5N2NjQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDUwODUzNi4yMjE0OS5xbUB3ZWI2MDYuYml6Lm1haWwubXVkLnlhaG9vLmNvbT4=","referencesHeader":"PDc4NjBiMzFlMTAwMzI5MDYzNmk3ZmZkZGVhZXFhNTQ5ZTJkNjU3ODIwMDE0QG1haWwuZ21haWwuY29tPgkgPDUwODUzNi4yMjE0OS5xbUB3ZWI2MDYuYml6Lm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":52396,"nextInTopic":52415,"prevInTime":52404,"nextInTime":52406,"topicId":52387,"numMessagesInTopic":0,"msgSnippet":"Privacy is usually a matter of degree and personal preference. That s probably stating the obvious. ... If a parent doesn t know that a child (I m going to be","messageBody":"<div id=\"ygrps-yiv-1646700741\">Privacy is usually a matter of degree and personal preference. That&#39;s<br/>\nprobably stating the obvious.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;If we say &quot;Sure, have your privacy,&quot; it could backfire on you in relationship-openness terms.&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>If a parent doesn&#39;t know that a child (I&#39;m going to be a bit extreme<br/>\nhere), for instance, is doing something illegal, and then it comes to<br/>\na head and the child gets into trouble because of it, I don&#39;t think I<br/>\nwould care a bit about privacy between parent and child in that<br/>\nsituation. A child could hurt someone or be hurt in such a situation.<br/>\nAnd I value the openness I have with Karl because I feel pretty<br/>\nconfident, Karl being very vocal and trusting of us, that he would<br/>\ntell us or at least ask us a question that would lead to talking about<br/>\nsituations enough to head off disaster.<br/>\n<br/>\nIt would be very hard to engender that kind of trust in Karl if I<br/>\ndidn&#39;t trust in Karl enough to let him into a good many things just<br/>\nbecause, for one thing, it&#39;s life experience and children learn from<br/>\neverything. This doesn&#39;t mean that I would tell Karl absolutely<br/>\nanything at all about myself but I don&#39;t see any benefit to holding on<br/>\nto privacy to that degree. When Karl was 3 and 4 years old, he often<br/>\nasked what I was writing and couldn&#39;t read much beyond a very few<br/>\nshort words. I might not tell him everything about what I was writing<br/>\nor responding to, but I gave him the gist of it, which is all he<br/>\nwanted anyway. This doesn&#39;t mean I tell him every last thing about it<br/>\nwhich he probably isn&#39;t interested in anyway.<br/>\n<br/>\n~Katherine</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Privacy issues in the home, saying &quot;this is private&quot;","postDate":"1269886279","msgId":52396,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCQjBFRDQ3LjMwNjAxMDFAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PDc4NjBiMzFlMTAwMzI5MDYzNmk3ZmZkZGVhZXFhNTQ5ZTJkNjU3ODIwMDE0QG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDc4NjBiMzFlMTAwMzI5MDYzNmk3ZmZkZGVhZXFhNTQ5ZTJkNjU3ODIwMDE0QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":52395,"nextInTopic":52405,"prevInTime":52395,"nextInTime":52397,"topicId":52387,"numMessagesInTopic":0,"msgSnippet":"... My oldest daughter, now 24 years old, was exactly as your son sounds - always wanting to be in on and know about every conversation (why did you say that?","messageBody":"<div id=\"ygrps-yiv-2009458544\">On 3/29/2010 6:36 AM, Deborah McKee Kelly wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Is there some kind, respectful way of saying it was a private call, or <br/>\n&gt; that<br/>\n&gt; I&#39;d rather not share what we were talking about? Is it fair of me to want<br/>\n&gt; such privacy?<br/>\n<br/>\n </span></blockquote>My oldest daughter, now 24 years old, was exactly as your son sounds - <br/>\nalways wanting to be in on and know about every conversation (why did <br/>\nyou say that? what did she say? what did you mean? I heard you say 2 <br/>\no&#39;clock, what is happening then?) could be very annoying, so I really do <br/>\nunderstand (and I&#39;m not at ALL a private person - so it is probably <br/>\nharder for you).<br/>\n<br/>\nI think you&#39;ve got a child with a very very strong and intense <br/>\ninterpersonal intelligence - and he wants to soak up everything about <br/>\nwhat goes on between people. I had a couple like this and I&#39;m like this, <br/>\nso I relate to him. Others might think it is nothing but nosiness, but I <br/>\nthink it is a fascination with human behavior. I like to know and <br/>\nunderstand all that goes on between people - from the seemingly mundane <br/>\nto the earth-shatteringly significant - I find all of it endlessly <br/>\nfascinating and I always have.<br/>\n<br/>\nGuess what my oldest daughter is doing? She just got accepted to <br/>\ngraduate school to become a Marriage and Family Therapist. Makes sense, <br/>\nright?<br/>\n<br/>\nInstead of being annoyed by his incessant nosiness, find ways to support <br/>\nhis interest in people&#39;s lives - in what is going on in the world - in <br/>\nways that are appropriate for his age. Maybe he&#39;ll be a journalist. <br/>\nMaybe a novelist. Maybe a therapist. Maybe he&#39;s gathering material to <br/>\nbecome a great actor. Don&#39;t stifle or crush it - treat it sweetly and <br/>\ngently.<br/>\n<br/>\nMaybe you can get a little more analytical with him. He says, &quot;I heard <br/>\nyou say 1 pm, what&#39;s happening at 1 pm?&quot; You say whatever it is and then <br/>\nget him involved in thinking about whether that was a good time - <br/>\nthinking about scheduling, planning, etc.&quot;<br/>\n<br/>\nTake his questions as indications of his interests and feed them!<br/>\n<br/>\nCan you have any private conversations? Of course. When he&#39;s asleep or <br/>\nplaying at someone else&#39;s house are good times for that.<br/>\n<br/>\nOtherwise, I think you know you&#39;ve got a curious kid who is super <br/>\ninterested in adult conversations - so don&#39;t set up situations where <br/>\nyou&#39;d need to refuse to enlighten him. In fact, do the opposite, consult <br/>\nwith him before you make a phone call, let him be part of it with you. <br/>\nNeed to call the cable company about the bill? Tell him what you&#39;re <br/>\ngoing to say and wy and let him listen in and see how you handle it when <br/>\nyou don&#39;t get satisfaction. He wants to learn. Help him learn in his <br/>\nbest way.<br/>\n<br/>\nOf course you have a &quot;right&quot; to privacy. But when parents start talking <br/>\nabout their rights, that&#39;s always a bad sign. Try to turn it around to <br/>\nhow you can support him in ways that work for you both. You&#39;re the <br/>\nexperienced person in this relationship, so you adjust your behavior.<br/>\n<br/>\nI would say that it isn&#39;t very cool for a parent to very often be <br/>\nsaying, &quot;This is private, go away.&quot;  The kid won&#39;t know when that is <br/>\ngoing to hit him. That kind of intermittent and unpredictable response <br/>\nwill be harmful to your relationship and not nurturing and supportive of <br/>\nhis curious nature.<br/>\n<br/>\nBe as open and nonprivate as you can possibly be with your child, and <br/>\nfind ways to satisfy your own desire for privacy that don&#39;t negatively <br/>\nimpact him.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":439731658,"authorName":"Joanna","from":"&quot;Joanna&quot; &lt;ridingmom@...&gt;","profile":"ridingmom1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Privacy issues in the home, saying &quot;this is private&quot;","postDate":"1269882982","msgId":52395,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhvcW45Nis3bDJ0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDc4NjBiMzFlMTAwMzI5MDYzNmk3ZmZkZGVhZXFhNTQ5ZTJkNjU3ODIwMDE0QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":52392,"nextInTopic":52396,"prevInTime":52394,"nextInTime":52396,"topicId":52387,"numMessagesInTopic":0,"msgSnippet":"... I share almost everything with my kids when they ask.  If the situation is so sensitive that I really shouldn t then I tell them that, we talk about why,","messageBody":"<div id=\"ygrps-yiv-108033335\"><blockquote><span title=\"ireply\">&gt; But this issue has to do with his interest in looking over my shoulder as I<br/>\n&gt; write e-mails or read things from friends, and his wanting to know what my<br/>\n&gt; phone conversations are about, etc.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I share almost everything with my kids when they ask.  If the situation is so sensitive that I really shouldn&#39;t then I tell them that, we talk about why, and if/when I feel like they understand about the importance of privacy in the matter, then I usually end up sharing it with them anyway.<br/>\n<br/>\nThey learn so much about the world by watching the real workings of it in action over my shoulder that I can&#39;t imagine cutting them off from it.  I would ask yourself why you feel the need to block him from this realm--are you afraid that your son will share sensitive info--then that&#39;s a great conversation with him!  Kids want entre into the adult world, and this is one big way to get it--through your eyes and experience.  Along with that comes the responsibility and maturity to use this information properly--or NOT use it, as is generally the case, and that trust has been an important part of my relationships with both my kids.<br/>\n<br/>\nI can understand not wanting to have him read your words, because they are probably out of context when there is a background to the situation, but in most cases, why not give him the whole background if he&#39;s interested, AND able to keep private things private?  If he&#39;s not good with private information, then that&#39;s a whole different matter, but again--a very important aspect of life that growing kids need to learn about.<br/>\n<br/>\nMy son is so much better at keeping his friends secrets than any of the friends are, as far as I can tell--and he navigated the tweens better in that regard, probably because we&#39;ve had so many overt conversations about sharing information and whose information belongs to whom.  Who&#39;s story is it?  That&#39;s a hot discussion topic around here.  Is it your story to share?  If not, then don&#39;t share it if it&#39;s private.<br/>\n<br/>\nJoanna</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Privacy issues in the home, saying &quot;this is private&quot;","postDate":"1269874025","msgId":52392,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI0OEM4QTYyLTgyNEYtNDREMy04MEUxLUUyQjJBMzA0MTgyNkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDc4NjBiMzFlMTAwMzI5MDYzNmk3ZmZkZGVhZXFhNTQ5ZTJkNjU3ODIwMDE0QG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDc4NjBiMzFlMTAwMzI5MDYzNmk3ZmZkZGVhZXFhNTQ5ZTJkNjU3ODIwMDE0QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":52389,"nextInTopic":52395,"prevInTime":52391,"nextInTime":52393,"topicId":52387,"numMessagesInTopic":0,"msgSnippet":"... But a desire for privacy isn t just a mom thing. It s polite to take cues from others how deeply they want to share. So you ll be doing his future wife a","messageBody":"<div id=\"ygrps-yiv-1323790689\">On Mar 29, 2010, at 9:36 AM, Deborah McKee Kelly wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Is that a traditional parenting thing, to want the kids to &quot;mind  <br/>\n&gt; your own<br/>\n&gt; business&quot; on certain things? It sounds old-fashioned and  <br/>\n&gt; traditional -- but<br/>\n&gt; is there any merit to the idea at all?<br/>\n<br/>\n </span></blockquote>But a desire for privacy isn&#39;t just a mom thing. It&#39;s polite to take  <br/>\ncues from others how deeply they want to share. So you&#39;ll be doing  <br/>\nhis future wife a favor by helping him with understanding ;-)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; And if so, how do I talk to him<br/>\n&gt; about it without sounding / seeming / being really rude?<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>I suspect you&#39;re thinking that if he understood then he&#39;d not be so  <br/>\nnosy. That&#39;s unlikely to be true!<br/>\n<br/>\nI think if you keep the explanation simple and give him the tools to  <br/>\nhandle the situation, that will be better than hoping to change who  <br/>\nhe is with information.<br/>\n<br/>\nLet him know not everyone likes to share everything. (Not everyone  <br/>\nlikes the same TV shows. Not everyone likes hot dogs. It just is.)  <br/>\nThen tell him you&#39;d appreciate if he&#39;d ask first before he started  <br/>\nreading.<br/>\n<br/>\nIf he&#39;s a social extrovert he may understand the words but won&#39;t  <br/>\nreally &quot;get it&quot;. It could be that he&#39;ll have a hard time remembering  <br/>\nthat something that&#39;s second nature to him -- sharing life -- isn&#39;t  <br/>\ninnate to everyone. Sharing may be like breathing to him. ;-)<br/>\n<br/>\nIt could also be he&#39;s going through a stage in life where social  <br/>\nrelationships are fascinating to him. And he just needs to suck in  <br/>\neverything he can get. (If that&#39;s the case, he might find TV shows  <br/>\nand movies that revolve around relationships fascinating. Maybe some  <br/>\nfamily sit coms.)<br/>\n<br/>\nSo it might help shift your view point to see that this might be a  <br/>\nbig need, and he won&#39;t understand why the whole world isn&#39;t the way  <br/>\nhe is ;-) So you&#39;ll need a lot of patience to remind him each time.  <br/>\nReminders can be as short as just &quot;Ask!&quot; Just because he&#39;s doing  <br/>\nsomething doesn&#39;t mean he doesn&#39;t understand. The ability to catch  <br/>\nhimself before doing what&#39;s natural to him will take much longer to  <br/>\ndevelop.<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Privacy issues in the home, saying &quot;this is private&quot;","postDate":"1269873388","msgId":52389,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUwODUzNi4yMjE0OS5xbUB3ZWI2MDYuYml6Lm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PDc4NjBiMzFlMTAwMzI5MDYzNmk3ZmZkZGVhZXFhNTQ5ZTJkNjU3ODIwMDE0QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":52388,"nextInTopic":52392,"prevInTime":52388,"nextInTime":52390,"topicId":52387,"numMessagesInTopic":0,"msgSnippet":"-=-What should I say when I m sending a quick message off to a friend and he comes to stand over my shoulder and read it?-=- Only very rarely was I writing","messageBody":"<div id=\"ygrps-yiv-1635992847\">-=-What should I say when I&#39;m sending a quick message off to a friend and he<br/>\ncomes to stand over my shoulder and read it?-=-<br/>\nOnly very rarely was I writing something I didn&#39;t want my kids to read and when I was I did it privately.<br/>\nThey would ask (Holly, especially), and I would share the situation with them.  Sometimes it was boring and sometimes it led to great conversations.<br/>\nYou could say really honestly that it bothers some people more than others to have someone read over their shoulder.  And that&#39;s true.  Some people object even if another can see without leaning over whatever newspaper or magazine they&#39;re reading.  If you use that justification (though it&#39;s true), please think about whether that&#39;s a school-related irritation, that the teacher or another kid is monitoring your reading speed or activities or whatever.  If it IS a school-related irritation, it might be healthier to see that and try to get past it.<br/>\nI suppose you could have all the privacy you want, but it might be better for relationship building and for learning if you share what you know and what you&#39;re doing (short of the details of your sex life).   If I heard Keith or Marty or Holly on the phone to a relative and they said &quot;1:00&quot; I would definitely want to know what it was about--maybe they&#39;ve just agreed that we&#39;ll be home at 1:00 (which day?) or that they will do something by 1:00 (I might need to remind them).<br/>\nBecause we&#39;ve shared with our children, they&#39;ve been open to share with us.  I know things Marty&#39;s girlfriend has said that I don&#39;t think she would be happy to have had shared, because she&#39;s from a sneaky family, but Marty&#39;s used to being open about things.  Holly and Kirby, too.  They will talk, and I will listen and so when they&#39;ve had problems I haven&#39;t said &quot;none of my business&quot; and they haven&#39;t grown up thinking people should have a big bubble of privacy and secrecy.<br/>\nIf we say &quot;Sure, have your privacy,&quot; it could backfire on you in relationship-openness terms.<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":223803785,"authorName":"Su Penn","from":"Su Penn &lt;su@...&gt;","profile":"marie101365","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Privacy issues in the home, saying &quot;this is private&quot;","postDate":"1269872916","msgId":52388,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU0OTQxN0FGLUE0NjctNEVGQS1CODIxLUUxNUZCQjg4MDgxREBzdXBlbm4uY29tPg==","inReplyToHeader":"PDc4NjBiMzFlMTAwMzI5MDYzNmk3ZmZkZGVhZXFhNTQ5ZTJkNjU3ODIwMDE0QG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDc4NjBiMzFlMTAwMzI5MDYzNmk3ZmZkZGVhZXFhNTQ5ZTJkNjU3ODIwMDE0QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":52387,"nextInTopic":52389,"prevInTime":52387,"nextInTime":52389,"topicId":52387,"numMessagesInTopic":0,"msgSnippet":"... That was between me and my mom, sweetie. It s not something you need to be concerned about. Repeat as necessary. ... Why not? Is there anyone else in","messageBody":"<div id=\"ygrps-yiv-1285990169\">On Mar 29, 2010, at 9:36 AM, Deborah McKee Kelly wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Is there some kind, respectful way of saying it was a private call, or that<br/>\n&gt; I&#39;d rather not share what we were talking about?<br/>\n<br/>\n </span></blockquote>&quot;That was between me and my mom, sweetie. It&#39;s not something you need to be concerned about.&quot; Repeat as necessary.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  Is it fair of me to want<br/>\n&gt; such privacy?<br/>\n<br/>\n </span></blockquote>Why not? Is there anyone else in your life who you would think was entitled to know what was going on in a conversation you wanted to be private, or to read over your shoulder while you wrote e-mails?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  Should I instead find ways to have my phone conversations or<br/>\n&gt; write my e-mails when he&#39;s not around?  <br/>\n<br/>\n </span></blockquote>Some of this would probably help, in the short term at least.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; That&#39;s not easy, for sure!  Should I<br/>\n&gt; not feel uncomfortable about answering his questions?<br/>\n<br/>\n </span></blockquote>Some people are very private. One of my best friends is so private that he doesn&#39;t talk to me and my partner about some of the most mundane things imaginable because he just doesn&#39;t like to do that. Not quite, &quot;What&#39;d you have for dinner, Scott?&quot; &quot;Oh, food,&quot; but almost! It&#39;s something we know about him and respect.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; What should I say when I&#39;m sending a quick message off to a friend and he<br/>\n&gt; comes to stand over my shoulder and read it?<br/>\n<br/>\n </span></blockquote>&quot;Please don&#39;t read over my shoulder when I&#39;m writing on the computer.&quot; I have to say this to my partner from time to time. Even when I&#39;m writing something for public consumption like a blog post, I don&#39;t like people looking over my shoulder while I do it.<br/>\n<br/>\nAre there times when your son wants privacy? Does he not want anybody opening the door while he&#39;s on the toilet, or does he like to go into his room and close the door sometimes? I have it relatively easy with regard to my kids respecting my privacy when I ask for it because both of my sons have a high need for alone time themselves, so it&#39;s pretty easy for them to understand that I would also have things I don&#39;t want to share. But you might be able to build on his need for those times to help him understand your desire for privacy as well.<br/>\n<br/>\nSu, mom to Eric, 8; Carl, 6; Yehva, 2.5<br/>\ntapeflags.blogspot.com</div>","specialLinks":[]},{"userId":240838916,"authorName":"Deborah McKee Kelly","from":"Deborah McKee Kelly &lt;dlmckee@...&gt;","profile":"hael_harobed","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Privacy issues in the home, saying &quot;this is private&quot;","postDate":"1269869760","msgId":52387,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc4NjBiMzFlMTAwMzI5MDYzNmk3ZmZkZGVhZXFhNTQ5ZTJkNjU3ODIwMDE0QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":0,"nextInTopic":52388,"prevInTime":52386,"nextInTime":52388,"topicId":52387,"numMessagesInTopic":0,"msgSnippet":"Hi there, Just a quick question about curious kids and the unschooling approach to parental privacy. I really try to answer all my 9-year-old s questions and","messageBody":"<div id=\"ygrps-yiv-1263420170\">Hi there,<br/>\n<br/>\nJust a quick question about curious kids and the unschooling approach to<br/>\nparental privacy.<br/>\n<br/>\nI really try to answer all my 9-year-old&#39;s questions and not feel impatient<br/>\nwith his incessant questioning and curiosity.  When I know the answer, I<br/>\ntell him.  When I don&#39;t know, I tell him I&#39;m not sure and that I&#39;ll help him<br/>\nfind the answer if he wants me to help.<br/>\n<br/>\nBut this issue has to do with his interest in looking over my shoulder as I<br/>\nwrite e-mails or read things from friends, and his wanting to know what my<br/>\nphone conversations are about, etc.<br/>\n<br/>\nI&#39;ve always been a pretty private person, even when there wasn&#39;t something<br/>\nespecially &quot;private&quot; about the topic.  For instance, if I&#39;m talking on the<br/>\nphone to my mom in the kitchen while he&#39;s doing something in the other room,<br/>\nthen I get off the phone and come in the room where he is, he&#39;ll say, &quot;What<br/>\nwere you talking about?  Who were you talking to?  I heard you say something<br/>\nabout 1 o&#39;clock, what was that about?&quot;<br/>\n<br/>\nIs there some kind, respectful way of saying it was a private call, or that<br/>\nI&#39;d rather not share what we were talking about?  Is it fair of me to want<br/>\nsuch privacy?  Should I instead find ways to have my phone conversations or<br/>\nwrite my e-mails when he&#39;s not around?  That&#39;s not easy, for sure!  Should I<br/>\nnot feel uncomfortable about answering his questions?  Sometimes I don&#39;t<br/>\nmind -- like, my mom has jury duty this afternoon, and that&#39;s what we were<br/>\ntalking about, and when he asked, I told him, and explained what jury duty<br/>\nis, and then he said that sounded interesting, and then he dropped it.  No<br/>\nbiggie.  But is everything fair game for questioning and answering?  I try<br/>\nto watch my motivations for why I do or don&#39;t want to answer questions -- is<br/>\nit just me feeling impatient? (not a good reason)  Or is it valid that I<br/>\nshouldn&#39;t *have to* share about my discussion?<br/>\n<br/>\nWhat should I say when I&#39;m sending a quick message off to a friend and he<br/>\ncomes to stand over my shoulder and read it?<br/>\n<br/>\nI don&#39;t want him to worry that I&#39;m talking &quot;about&quot; him (very rarely am I<br/>\ndoing that), but I also just feel kind of private sometimes.<br/>\n<br/>\nIs that a traditional parenting thing, to want the kids to &quot;mind your own<br/>\nbusiness&quot; on certain things?  It sounds old-fashioned and traditional -- but<br/>\nis there any merit to the idea at all?  And if so, how do I talk to him<br/>\nabout it without sounding / seeming / being really rude?<br/>\n<br/>\n<br/>\n_____________________<br/>\nDeb McKee Kelly |  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dlmckee@...\">dlmckee@...</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":52369,"nextTopicId":52425}}