{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":52496799,"authorName":"sablehs","from":"sablehs &lt;sablehs@...&gt;","profile":"sablehs","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"MIL&#39;s need for my DD to master Cursive writing","postDate":"1052443049","msgId":68220,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMwNTA5MDExNzI5Ljc2MTM4LnFtYWlsQHdlYjExMDA0Lm1haWwueWFob28uY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":68219,"nextInTime":68221,"topicId":68220,"numMessagesInTopic":0,"msgSnippet":"Before, we were discussing writing and how kids , when they are ready, will master it. My dd told me that just a little ago told her she needed to learn","messageBody":"<div id=\"ygrps-yiv-1615113401\">Before, we were discussing writing and how kids , when they are ready, will master it. <br/>\nMy dd told me that just a little ago told her she needed to learn cursive writing. My dd {I think feeling she needs to make her grandmother happy} told her ok you can teach me how. <br/>\nI told her what she was getting in to. I said If you agree to that, you are just asking for her to stay on you over and over and asking for her to tell you to sit down and practice. {never being in school much I have to relate to her how others perceive &quot;teaching&quot; you to do something}<br/>\nI don&#39;t care if  she wants it, but I think she is just trying to make her GM happy. <br/>\nGranted she is &quot;trying&quot; to understand unschooling. BUT because it isn&#39;t a part of her identity and she &quot;doesn&#39;t have time&quot; to read about this stuff. {let her borrow books but don&#39;t think she read them} She lives right next door so it would be kinda like the frustration she gives Kira with biting her nails. Or her getting on the kids picking their nose, or other little nit picky things like that.  I try to be the example {after talking about why and how it works} being relaxed.<br/>\nAnyway it hasn&#39;t been the right time to talk about it. And I may not need to because I try to empower the kids to do it and speak up for themselves. And I back them. I know in the end it all bothers me much more then them because they know we are there for them and will back decisions they make. I just wanted Kira to be informed of the repercussions of her agreeing to be &quot;taught&quot;. And now that I know, it won&#39;t catch me off guard and I can think before I act.I know how scared I was to give up that control PS and society had taught me kids need. So I can imagine how hard it is for her to understand it. Though she is trying, I&#39;m not sure she will ever &#39;get it&#39;.<br/>\nTracy<br/>\n<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\nThe New Yahoo! Search - Faster. Easier. Bingo.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":68025,"nextTopicId":15544}}