{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Olivia","from":"Olivia &lt;liv2learn@...&gt;","replyTo":"LIST","senderId":"elFb6rUw_MxqC0GdSIRLIn4P92X_j3tVH6aK8oxHoisC8kgG8W7klotj0iAD01s6lgQxGscCP4cvlQhJ1eMdsKfxcQ","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] What are you doing for the World?","postDate":"978034117","msgId":14786,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUuMC4yLjEuMi4yMDAwMTIyODE0MTcyNy4wMDllOTQzMEBwb3AubWFpbC55YWhvby5jb20+","inReplyToHeader":"PDk3ODAwNTQxMy41NTg3OEBlZ3JvdXBzLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":14785,"nextInTime":14787,"topicId":14786,"numMessagesInTopic":0,"msgSnippet":"... Well, I don t know its exact name. It is some kind of bush that is often planted in subdivisions. However, it does have small, red berries in the fall","messageBody":"<div id=\"ygrps-yiv-1725322005\"><blockquote><span title=\"ireply\">&gt; &gt;My question would be: do you know the name of the<br/>\n&gt; &gt; plant outside you fron door?  Could you describe it<br/>\n&gt; &gt; now without going and looking at it? Does is shelter<br/>\n&gt; &gt; any animals? Does it have flowers.<br/>\n<br/>\n<br/>\n </span></blockquote>Well, I don&#39;t know its exact name. It is some kind of bush that is often <br/>\nplanted in subdivisions. However, it does have small, red berries in the <br/>\nfall which the birds like to eat (they picked it clean). It has small <br/>\nleaves and provides a nice shelter for the finches while they visit the <br/>\nbirdfeeder in the front yard. There are also two lovely evergreens in the <br/>\nfront yard that have become condos for the chickadees and house finches!<br/>\n<br/>\n&quot;What are you doing for the World?&quot;<br/>\n<br/>\nI love this topic because I have so far to go and would love to learn more <br/>\nfrom others. I will check out some of the sites mentioned on this list. I <br/>\nguess our homeschooling would be first on the list. We do recycle, but I <br/>\nwould like to compost and haven&#39;t yet. Last year I focused on modifying our <br/>\nfood intake. I went through all the food cabinets and cleaned out <br/>\neverything that didn&#39;t fit a more natural diet. There were a lot of canned <br/>\ngoods and mixes that we never used, so, as long as they were still fresh, <br/>\nwe gave them to a food pantry. We started buying organic whenever possible <br/>\nand began shopping at a Whole Foods store almost exclusively. I have been <br/>\ntrying to improve my son&#39;s eating habits, but he still won&#39;t eat fruits or <br/>\nmany vegetables. :-(     I am still trying. I gradually switched to organic <br/>\nversions of staple items. We also visited a naturopath for our seasonal <br/>\nallergies instead of using OTC medications and steroids (as the allergist <br/>\nrecommended). Now I am trying to work on finding non-chemical alternatives <br/>\nfor personal care and household products. For my birthday, I replaced my <br/>\nsmall number of old cosmetics with healthier versions. Soaps and shampoos <br/>\nwere easy to change, but some of the household products still need <br/>\nreplacement; I need a good dishwasher detergent that cleans well and hasn&#39;t <br/>\nany phosphates. (I am not yet ready to give up the dishwasher altogether.) <br/>\nWe are doing much better at reducing paper usage and waste. This all seems <br/>\nso little and more aimed at our family. Other than giving to charities and <br/>\ngiving away old clothing, we don&#39;t do any other community service. This <br/>\nneeds to be addressed. I still can&#39;t give up driving the car because <br/>\neverything we do these days is 30 minutes from home (especially all the <br/>\nhomeschooling activities). We have reduced our consumer activities, or at <br/>\nleast are working on being more mindful of what we buy and where. Christmas <br/>\ngifts for my husband&#39;s family included a donation to the non-profit place <br/>\nwhere my SIL works, movie tickets, restaurant gift certificates, and a <br/>\npiece of pottery made by a local artist.<br/>\n<br/>\nThe hardest part of changing family habits is convincing DS that he doesn&#39;t <br/>\nneed that Burger King toy or that it can be fun to do something that <br/>\ndoesn&#39;t involve electronics! Kids are hit hard by commercialism. Here&#39;s the <br/>\ndichotomy of our life: our car has two bumper stickers on the back; one <br/>\nsays &quot;Be Green&quot; (we got it from the organic food store), and the other says <br/>\nNASCAR racing (my son loves car racing). How do you reconcile wanting to <br/>\nlive in a more earth-friendly way when other family members like things <br/>\nthat are resource-intensive (cars, electronic gadgets) and not <br/>\nnature-friendly? I wish we had started making these changes before my son <br/>\nwas born. I guess I wasn&#39;t that far-sighted.<br/>\n<br/>\nHappy Holidays!<br/>\nOlivia</div>","specialLinks":[]}],"prevTopicId":14745,"nextTopicId":14787}}