{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] The Ultimate, Best Ever, Top 10 Do&#39;s and Don&#39;ts for Having a Long, Happy Marriage","postDate":"1218397351","msgId":37078,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgyNzk1Ljc2NzIxLnFtQHdlYjg2MjA4Lm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":37068,"nextInTopic":0,"prevInTime":37077,"nextInTime":37079,"topicId":37068,"numMessagesInTopic":0,"msgSnippet":"Sylvia just forwarded this to the Peaceful Partnerships list if anyone wants to come and see the discussion over there, or talk about ways to incorporate","messageBody":"<div id=\"ygrps-yiv-1016980616\">Sylvia just forwarded this to the Peaceful Partnerships list if anyone wants to come and see the discussion over there, or talk about ways to incorporate unschooling in a more broader fashion, to the significant other(s) in your life: <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/Peacefulpartnerships/\">http://groups.yahoo.com/group/Peacefulpartnerships/</a><br/>\n<br/>\nSchuyler<br/>\nwww.waynforth.blogspot.com<br/>\n<br/>\n----- Original Message ----<br/>\nFrom: Joyce Fetteroll &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jfetteroll@...\">jfetteroll@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nSent: Sunday, 10 August, 2008 10:56:23 AM<br/>\nSubject: [AlwaysLearning] The Ultimate, Best Ever, Top 10 Do&#39;s and Don&#39;ts for Having a Long, Happy Marriage<br/>\n<br/>\nI was looking up what other books Mira Kirshenbaum, the author of  <br/>\nParent/Teen Breakthrough, had written and found she has a  <br/>\nrelationship blog (and lists and lots of other things too.) The  <br/>\nsubject of husbands comes up a lot and how to get them to change. It  <br/>\njust feels so important to get them to see things the &quot;right&quot; way  <br/>\nthat you can lose sight of the fact that the relationship is more  <br/>\nimportant than being right. (If you end up divorced it&#39;s the judge  <br/>\nwho gets to be &quot;right&quot; and he or she is even less likely to be  <br/>\npatient with your alternative parenting and education.)<br/>\n<br/>\nI<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"The Ultimate, Best Ever, Top 10 Do&#39;s and Don&#39;ts for Having a Long, Happy Marriage","postDate":"1218362183","msgId":37068,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZCMDJGMjgwLThCM0MtNEZFMi1BOThFLTcyOEJGNjk1N0IxRkB2ZXJpem9uLm5ldD4="},"prevInTopic":0,"nextInTopic":37078,"prevInTime":37067,"nextInTime":37069,"topicId":37068,"numMessagesInTopic":0,"msgSnippet":"I was looking up what other books Mira Kirshenbaum, the author of Parent/Teen Breakthrough, had written and found she has a relationship blog (and lists and","messageBody":"<div id=\"ygrps-yiv-498556710\">I was looking up what other books Mira Kirshenbaum, the author of  <br/>\nParent/Teen Breakthrough, had written and found she has a  <br/>\nrelationship blog (and lists and lots of other things too.) The  <br/>\nsubject of husbands comes up a lot and how to get them to change. It  <br/>\njust feels so important to get them to see things the &quot;right&quot; way  <br/>\nthat you can lose sight of the fact that the relationship is more  <br/>\nimportant than being right. (If you end up divorced it&#39;s the judge  <br/>\nwho gets to be &quot;right&quot; and he or she is even less likely to be  <br/>\npatient with your alternative parenting and education.)<br/>\n<br/>\nI really like the way she writes. She sees right through a lot of the  <br/>\nemotional tangles that can screw up people&#39;s clear thinking.<br/>\n<br/>\nThe Ultimate, Best Ever, Top 10 Do&#39;s and Don&#39;ts for Having a Long,  <br/>\nHappy Marriage<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.revolutionhealth.com/blogs/mirakirshenbaum/a-first-\">http://www.revolutionhealth.com/blogs/mirakirshenbaum/a-first-</a> <br/>\nanniversary-r-9886<br/>\n<br/>\nIf you want a long, happy marriage, all you need is a bathroom  <br/>\nmirror.  Then write down these 10 do&#39;s and don&#39;ts, tape them to the  <br/>\nside of your bathroom mirror where you can see them every day, and  <br/>\nyou&#39;ll be all set.  Of course you actually have to do the do&#39;s and  <br/>\nnot do the don&#39;ts, but that&#39;s a mere detail.<br/>\n<br/>\nThe point is --- and it&#39;s a revolutionary point, when you think about  <br/>\nit --- that you don&#39;t have to be a genius or a saint for the two of  <br/>\nyou to stay happy with each other.  Love is a strong, healthy force.   <br/>\nAll you have to do is nurture it a little bit and avoid screwing it  <br/>\nup too badly.  And it will be there for you when you&#39;re in your  <br/>\ngolden years.<br/>\n<br/>\nOkay, in no particular order, here are Mira&#39;s top 10 most important  <br/>\ndo&#39;s and don&#39;ts:<br/>\n<br/>\n1.  DO get this through your sweet head: you need to accept your  <br/>\npartner as is.  The people we love are the way they are, and we&#39;ve  <br/>\ngot to love them for that.  That&#39;s what a great, long-lasting  <br/>\nmarriage is: two very imperfect people who love each other not in  <br/>\nspite of their imperfections but with their imperfections.<br/>\n<br/>\n2.  DO really listen to each other.  Making each other feel heard  <br/>\ndown to your very toes is one of the sexiest, most healthful things  <br/>\nyou can do.  It&#39;s not about being silent while the other person is  <br/>\ntalking and then saying, &quot;Yes, but...&quot; and then immediately inserting  <br/>\nyour own opinion.  Instead it&#39;s about asking questions when the other  <br/>\nperson talks, unpacking what she says, getting inside and all around  <br/>\neverything she feels about this issue.<br/>\n<br/>\n3.  DO show how much you appreciate each other.  Words are  <br/>\nimportant.  Say how much you&#39;ve valued every little thing your  <br/>\npartner does that makes your life better.  You should be saying a lot  <br/>\nmore appreciative things than criticisms.  But actions are just as  <br/>\nimportant.  A hug, a tender kiss, a small gift, a helpful hand are  <br/>\nall great ways of underlining your words of appreciation.<br/>\n<br/>\n4.  DO have fun together.  Fun is the glue of intimacy.  If you&#39;re  <br/>\nnot having fun, you&#39;re not doing it right.  Now it doesn&#39;t matter  <br/>\nwhat you do for fun --- that&#39;s different for everybody.  But know  <br/>\nwhat your fun things are and make sure you do them.<br/>\n<br/>\n5.  DO think long and hard every day about what it must be like to be  <br/>\nin a relationship with you.  Here&#39;s an example.  Think about how you  <br/>\nmust seem when you come home from work.  Would you guess you&#39;re kind  <br/>\nof grumpy?  Or maybe you act in another way that&#39;s not so fun?  Be  <br/>\nhonest.  What must it be like to have to deal with that?  This isn&#39;t  <br/>\njust about coming home from work; it&#39;s about other ways you are in  <br/>\nyour relationship.  Once you see yourself through your partner&#39;s  <br/>\neyes, that&#39;s just got to change the way you act.  If you wouldn&#39;t  <br/>\nwant to have to deal with you, why should your partner have to?<br/>\n<br/>\n6.  DON&#39;T act miserable and gloomy.  Yeah, I know, you shouldn&#39;t walk  <br/>\naround with a fake smile plastered on your face.  But complainers,  <br/>\ndowners, Mr. and Ms. Negatives make their relationship a place you  <br/>\nwant to get the heck away from.<br/>\n<br/>\n7.  DON&#39;T live in the past.  Don&#39;t dwell on the past.  Don&#39;t talk  <br/>\nabout the past.  Look, I know you&#39;ve both done things to hurt each  <br/>\nother.  But love and happiness can only die if you live in a museum  <br/>\nof past hurts.  Instead, focus on your needs in the present.<br/>\n<br/>\n8. DON&#39;T deny your most important needs.  When you identify which  <br/>\nunmet needs mean the most to you, tell your partner what they are.   <br/>\nDo it one at a time.  Make it clear what exactly your partner needs  <br/>\nto do.  Unsatisfied needs corrode love. But when you satisfy each  <br/>\nother&#39;s needs, love thrives.<br/>\n<br/>\n9.  DON&#39;T neglect touching.  The physical dimension of your  <br/>\nrelationship is like a fountain of youth.  I&#39;m not necessarily  <br/>\ntalking about sex, although that&#39;s important too.  But just as  <br/>\nimportant is hugging, kissing, snuggling, holding hands and rubbing  <br/>\neach other&#39;s feet or shoulders.  You should have some warm,  <br/>\nmeaningful physical contact every day.<br/>\n<br/>\n10.  DON&#39;T forget to have a life.  Marriage is a big deal.  It plays  <br/>\na huge role in your happiness and your sense of yourself.  But it&#39;s  <br/>\nnot everything.  It certainly can&#39;t give you what you can get for  <br/>\nyourself from having a life of your own.  If you try to make your  <br/>\nmarriage do more for you than it can, you&#39;ll end up polluting it with  <br/>\nyour disappointment.  But if you have a life along with your  <br/>\nmarriage, the two support each other.<br/>\n<br/>\nWell, that&#39;s what I believe.  I&#39;d love to hear what you think.  What  <br/>\ndo&#39;s or don&#39;ts do you want to add to mine?  Maybe your list is better  <br/>\nthan this.  I&#39;d love to find out.  Let me hear from you.  And if you  <br/>\ndon&#39;t agree with any of mine, let me know that too.  Also, vote for  <br/>\nwhich of my top 10s you think is most important.<br/>\n<br/>\nNow I have some good news for you.  I&#39;ve just started an exciting  <br/>\ngroup that will provide support and invaluable suggestions for  <br/>\npulling our relationships out of the doldrums, putting the spark back  <br/>\nin love, and fixing the most common relationship problems.  Plus  <br/>\nwe&#39;ll have a lot of fun and it could make all the difference for  <br/>\nyou!  I hope you will check out my new group and join it.  To get to  <br/>\nit, click here (<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.revolutionhealth.com/groups/from-kiss-to-\">http://www.revolutionhealth.com/groups/from-kiss-to-</a> <br/>\ncommitment).</div>","specialLinks":[]}],"prevTopicId":37060,"nextTopicId":37061}}