{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Bonknit@xxx.xxx","from":"Bonknit@...","replyTo":"LIST","senderId":"bbGavjOyvpdX4kKDcx2oPtZedd6MEoFpbKkQfbCk2XzWFerMA33IHDea1Hwy3sLnDIVD7a9z","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Something we should keep in mind","postDate":"941491390","msgId":4148,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4yNzcuNDE0OC45NTkyNjk3NDNAZUdyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":4147,"nextInTime":4149,"topicId":4148,"numMessagesInTopic":0,"msgSnippet":"This wass sent to me by a friend, though off topic thought it important. Hope no one minds.   Laura ","messageBody":"<div id=\"ygrps-yiv-66072742\">This wass sent to me by a friend, though off topic thought it important. Hope <br/>\nno one minds.   Laura<br/>\n<br/>\n&lt;&lt;  I need to share some things I have learned in my<br/>\n<blockquote><span title=\"qreply\">   &gt;  job.<br/>\n  &gt;<br/>\n  &gt;  In my job, I review criminal and psychiatric<br/>\n  &gt;  files of imprisoned sex offenders who are approaching<br/>\n  &gt;  their release date.  I decide if they are likely to<br/>\n  &gt;  re-offend based on certain criteria and then civilly commit<br/>\n  &gt;  them  to a sex offender treatment facility if I decide<br/>\n  &gt;  that they are at significant risk to re-offend<br/>\n  &gt;<br/>\n  &gt;  I have read hundreds and hundreds of files, and<br/>\n  &gt;  have taken note of some of the mistakes women make.<br/>\n  &gt;  Let me preface this by saying that a woman is NEVER<br/>\n  &gt;  EVER EVER at fault for being raped or attacked, but<br/>\n  &gt;  there are definitely ways to reduce your risk of being a<br/>\n  &gt;  victim.<br/>\n  &gt;<br/>\n  &gt;  Here are the most common mistakes women make that<br/>\n  &gt;  could result in them getting kidnapped, attacked,<br/>\n  &gt;  and/or raped:<br/>\n  &gt;<br/>\n  &gt;  1.  Getting into the attacker&#39;s car when he pulls<br/>\n  &gt;  a  gun and orders you to get into his vehicle.<br/>\n  &gt;<br/>\n  &gt;  Most attackers don&#39;t want to shoot you ... they<br/>\n  &gt;  want you to get into the car so that they can drive<br/>\n  &gt;  you to a deserted place and torture you.  Don&#39;t comply.<br/>\n  &gt;  Run screaming.  It is MUCH more likely than not that<br/>\n  &gt;  he will just move on to an easier target.<br/>\n  &gt;<br/>\n  &gt;  2.  Pulling over when a man drives alongside of<br/>\n  &gt;  you pointing at your car pretending something is<br/>\n  &gt;  wrong.<br/>\n  &gt;<br/>\n  &gt;  If this happens, drive to the nearest well-lit<br/>\n  &gt;  and populated gas station and look the car over<br/>\n  &gt;  yourself (or ask an attendant).  Never pull over.  Believe<br/>\n  &gt;  it or not, many women have fallen for this for fear<br/>\n  &gt;  of their car spontaneously exploding in the middle<br/>\n  &gt;  of the road.  Not likely.<br/>\n  &gt;<br/>\n  &gt;  3.  Not locking your doors while driving.<br/>\n  &gt;<br/>\n  &gt;  I have read several cases where the attacker<br/>\n  &gt;  simply walks up to a woman&#39;s car while she&#39;s at a<br/>\n  &gt;  traffic light and jumps in with his knife or gun drawn.<br/>\n  &gt;<br/>\n  &gt;  4.  Opening your front door when you have not<br/>\n  &gt;  positively identified who is there.<br/>\n  &gt;<br/>\n  &gt;  If you don&#39;t have a peep hole, get one.  I&#39;ve<br/>\n  &gt;  seen countless cases where the attacker gains access<br/>\n  &gt;  to his victims simply by knocking on their door.<br/>\n  &gt;  Don&#39;t let an attacker get into your home.  He<br/>\n  &gt;  then has a private, relatively soundproof place to attack<br/>\n  &gt;  you.<br/>\n  &gt;<br/>\n  &gt;  5.  Not being alert in parking lots.<br/>\n  &gt;<br/>\n  &gt;  If you go to the grocery store at night, don&#39;t be<br/>\n  &gt;  shy about asking for an escort to your car.  Far too<br/>\n  &gt;  many women are abducted from parking lots or even<br/>\n  &gt;  raped in the parking lot.<br/>\n  &gt;<br/>\n  &gt;  Look in your back seat before entering your car.<br/>\n  &gt;  Cars provide endless hiding places for attackers,<br/>\n  &gt;  both inside them and in between them.<br/>\n  &gt;<br/>\n  &gt;  Be aware of your surroundings by looking to the<br/>\n  &gt;  left and right and behind you with your head up all<br/>\n  &gt;  the time.  You may appear paranoid and look funny to<br/>\n  &gt;  others, but an attacker will think twice about<br/>\n  &gt;  approaching someone who appears so aware of<br/>\n  &gt;  what&#39;s going on.<br/>\n  &gt;<br/>\n  &gt;  6.  Trusting a clean cut, honest looking stranger.<br/>\n  &gt;<br/>\n  &gt;  I see mug shots of every sex offender in the<br/>\n  &gt;  state of Florida.  They do not look like monsters.  They<br/>\n  &gt;  oftenlook like they could be your friendly grocer,<br/>\n  &gt;  bank teller, waiter, neighbor, clergy, doctor, etc.<br/>\n  &gt;  They are every age between 15 and 90, and probably<br/>\n  &gt;  beyond.  Only a small minority actually look<br/>\n  &gt;  scary.<br/>\n  &gt;<br/>\n  &gt;  I just read a case yesterday of a man with only<br/>\n  &gt;  one leg who beat up his victim with his crutch before<br/>\n  &gt;  he raped her.  Who would have ever thought that a<br/>\n  &gt;  one-legged man could be a rapist?<br/>\n  &gt;<br/>\n  &gt;  I didn&#39;t mean to make anyone uncomfortable with<br/>\n  &gt;  this, but I am at work right now reviewing files,<br/>\n  &gt;  and realized that this email is a way I can reach<br/>\n  &gt;  many women at one time.  I have the dirty job of<br/>\n  &gt;  reading all these files, and it makes me feel good to<br/>\n  &gt;  know that I can share some inferences from what I have<br/>\n  &gt;  learned.  This is not an exhaustive list of what<br/>\n  &gt;  not to do, but just some things that I have observed<br/>\n  &gt;  more than just a few times.<br/>\n  &gt;<br/>\n  &gt;  Please pass this on to the women in your lives.<br/>\n   &gt;&gt;<br/>\n  &gt;&gt; </span></blockquote></div>","specialLinks":[]}],"prevTopicId":4137,"nextTopicId":4154}}