{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":4921770,"authorName":"Lari","from":"Lari &lt;lysandra@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"stepping out from behind the lurkers&#39; curtain","postDate":"1073518686","msgId":88113,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwODc0MzQ2LjEwNzM1MTg2OTc1MDcuSmF2YU1haWwucm9vdEBtaXNzcGlnZ3kucHNwLnBhcy5lYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":88112,"nextInTime":88114,"topicId":88113,"numMessagesInTopic":0,"msgSnippet":"Hello, My name is Lari and I have an 11 year old son, John.  I remember when I was pregnant I started reading about homeschooling and TCS.  I knew at the time","messageBody":"<div id=\"ygrps-yiv-694098083\">Hello,<br/>\n<br/>\nMy name is Lari and I have an 11 year old son, John.  I remember when I was pregnant I started reading about homeschooling and TCS.  I knew at the time that I was going to be a single parent - John&#39;s father has had no contact with us since about a year after John was born.  Being whelmed with the idea of handling this alone, I put the idea of homeschooling to the back of my mind and just carried on.<br/>\n<br/>\nAll through the time he was in public school I mentally fought with myself and often raged at what was going on.  And, just as I would be about to pull him out, something would change and it would seem that leaving him in would be best.<br/>\n<br/>\nJust before Christmas 2002 I&#39;d simply had it.  His major Christmas present that year was my promise that he&#39;d never see a public school again unless he *really* chose it for himself.  I had joined this list before that and had already decided that unschooling would be the way to go for us.<br/>\n<br/>\nIt&#39;s been an... interesting... year... For the first few months we had the nanny he had always had with him during the day (I work full-time)... but, she had some VERY strong objections to the changes and quit last May.  I have tried to find someone to be with him - but, for a variety of reasons, it just hasn&#39;t worked out.  He&#39;s been on his own at home during the day for the last couple months. (keep in mind, we talk over a dozen times a day).<br/>\n<br/>\nThe deschooling has been difficult for me mostly.  I was brought up believing that a good life was out of the question unless one did well in college.  I keep having nagging fears in the back of my mind that I&#39;m ruining his life.  Still, I truly believe that I&#39;m basically doing the right things.  I know how little of the forced education I received has stuck with me.  I know that he&#39;s learning and growing by leaps and bounds every day.  He&#39;s an excellent reader - although he&#39;ll only read video game guides at the moment.  But, then, how many of us read something we&#39;re not interested in to begin with?<br/>\n<br/>\nStill - I come to this group day in and day out and want to thank you all for the incredible support you&#39;ve given me - without even knowing it.<br/>\n<br/>\nBlessings,<br/>\n<br/>\nLari</div>","specialLinks":[]}],"prevTopicId":111,"nextTopicId":88010}}