{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":20,"messages":[{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Goal Oriented Learning","postDate":"1262986998","msgId":113343,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU1MzA0OS45Mzk1Ni5xbUB3ZWIxMTA0MDIubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PERFRjIyNEZGLUVENjEtNDUwNC1COTBDLUM5N0Q4QzY5NjhCRkBnbWFpbC5jb20+","referencesHeader":"PGhpNGd2OCtqNzYzQGVHcm91cHMuY29tPiA8RkJCNjFFNjMtQzE5Qy00NDg2LTlENEQtMjFGMzE0REUxQTQwQGdtYWlsLmNvbT4gPDI4NzA3NC42OTYzNy5xbUB3ZWIxMTA0MTYubWFpbC5ncTEueWFob28uY29tPiA8REVGMjI0RkYtRUQ2MS00NTA0LUI5MEMtQzk3RDhDNjk2OEJGQGdtYWlsLmNvbT4="},"prevInTopic":113342,"nextInTopic":0,"prevInTime":113342,"nextInTime":113344,"topicId":113299,"numMessagesInTopic":0,"msgSnippet":"... You have mixed up posts. My text above refers to what I was saying in one post. You describe what I said in a different post. The purpose of my statement","messageBody":"<div id=\"ygrps-yiv-1919783351\">This is a copy of an email sent to me, from Keith:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; ***I was recommending that people expose themselves to a wide variety of stuff, all of which they like and enjoy at the time they do it, related to their area of expertise (if they have one, and there&#39;s nothing wrong with being a generalist). This was not a strong recommendation, I simply pointed out it has merits.***<br/>\n&gt; <br/>\n&gt; No you weren&#39;t.  You were wanting specific math help<br/>\n<br/>\n </span></blockquote>You have mixed up posts. My text above refers to what I was saying in one post. You describe what I said in a different post.<br/>\n<br/>\nThe purpose of my statement above was to clarify the post it refers to, which had been misunderstood as saying something else.<br/>\n<br/>\nThis is my response:<br/>\n<br/>\nNo I don&#39;t have mixed up posts.  You say one thing, then say another.  It&#39;s all related.  If a person says they don&#39;t own any pets, and really don&#39;t want any pets in one post, then, in another post ask about how to best care for cats and what to do if they stop eating, then it DOES make a difference what someone says in each thing they post. <br/>\n<br/>\nYou are doing the same thing.  If you want to discuss math, then discuss math.  If you want to discuss how unschoolers deal with higher math, then do that, but know that it needs to be relevant.  How old are the kids in question?  That makes a BIG difference.  I won&#39;t think anything of a 2 yr old that doesn&#39;t know how to add all their fingers and toes together, but I&#39;d wonder how a 15 yr old got to be that age and not know how.  But that&#39;s even irrelevant, because you were asking about theoretical math for the sake of theoretical math and you are STILL talking about that in all of your posts.  Nobody anywhere in the entire world needs to know theoretical math for the sake of knowing theoretical math.<br/>\n<br/>\nIf an unschooled kid seemed fascinated by theoretical math, they&#39;ll have a reason and you&#39;ll know it as their parent, having seen them grow and learn.  THAT would be relevant.  Why and who and all that is important in discussing these things.  <br/>\n<br/>\nYour posts remind of measures that I vote &quot;no&quot; on because they threw in something in the middle of it that I disagree with entirely, even though most of the measure I agree with.  <br/>\n<br/>\n~~~~and here is the current portion of this ongoing thread, my portion is quoted first with Keith&#39;s response: <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; ***Surely my pointing out that learning things with no particular goal in mind, no immediate problem to solve, etc, can have unforeseen benefits, couldn&#39;t scare anyone away from an unstructured, wide learning style.***<br/>\n&gt; <br/>\n&gt; You can point that out all you want, but it&#39;s not really how unschooling works at all. My kids have never ever in all their years learned anything without a reason to learn it. While they are learning things all the time everyday, for specific reason, they pick up all sorts of other things along the way. That is how the sphere of learning widens. <br/>\n&gt; <br/>\n&gt; They never intentionally set out to learn something with no particular goal, that is a completely schooled mindset. Learning goals are all about school think. In the absence of that, there is simple living and learning. That is what I see my kids doing all the time everyday.<br/>\n<br/>\n </span></blockquote>***One day my child picked up a book to learn about something. And in the book s/he found a section on something else. S/he did not ask him/herself if this second topic was important. S/he did not wonder if s/he had a good reason to learn about it. When s/he got to that section, s/he just started reading it, with no particular goal. What&#39;s wrong with that? Sometimes when you read something with no reason in mind at the start, it tells you a reason to care in the text, or you come up with one yourself.<br/>\n<br/>\nIt would have been hard for him/her to judge that section in advance, b/c s/he didn&#39;t know about it. S/he had no information to go on. Trying it was a good way to get some sense of what it&#39;s about. Of course s/he could stop at any time if it turned out boring.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; [my kids] don&#39;t think it at all relevant to do &quot;problem solving&quot; for the sake of problem solving. There is plenty of that happening naturally, with lots of unforeseen benefits.<br/>\n<br/>\n </span></blockquote>I was saying how one doesn&#39;t have to be doing anything recognizable as problem solving. I think learning doesn&#39;t need justifications such as that it will solve some problem. Perhaps we agree here?***<br/>\n<br/>\n~~~and me now:<br/>\n<br/>\nIf your hypothetical, perhaps non-existent child picked up a book with the specific intent of learning something, they weren&#39;t picking up the book for the sake of picking up the book, there was intent and along the way new information and ideas were acquired.  This is EXACTLY what I was saying above, in which you are trying to argue against and then ask me if I agree with the very thing I JUST said!<br/>\n<br/>\nAnd just for clarification, when a kid is picking up a book to learn something specific, they aren&#39;t thinking in topics and whether or not there is a second topic.  Real natural learning doesn&#39;t happen like that, it&#39;s much more seemless and flowing.<br/>\n<br/>\nAnd here&#39;s why I put the other email in this post.... because it is in every way like a politician trying to get someone to agree with a measure that sounds all good and peachy, except for that one bit, but we&#39;ll just tuck that away and pretend that it was never out there to begin with because it SOUNDS good and peachy.<br/>\n<br/>\nIf you have kids or if you don&#39;t, I don&#39;t care.  There have been some intersting folks that understood unschooling without having kids, BUT, if you don&#39;t have a practical application, your understanding of unschooling in action will be less, and it will be more theoretical.  Based on what you&#39;ve said in all your posts, it sounds like you don&#39;t have kids.  Kids and unschooling are purely theory for you at this point.  Which is fine, just don&#39;t try to tell long time unschoolers how it SHOULD be and look like if you have absolutely no freakin idea of what you are talking about.  Maybe in your own head you know what you are talking about, but it sure doesn&#39;t come off that way in writing.<br/>\n<br/>\nI think at this point, it is starting to become relevant as to whether or not you have kids and how old they are and how long you&#39;ve been unschooling.  If you don&#39;t, tell us and we can continue the discussion with our eyes open.  If you do have kids, then perhaps a bit of information will go a long way in understanding where you are coming from.  You need not tell us their toileting schedule or even what color of eyes he/she/it has, you could even give your kid a code name like &quot;little booger&quot; and refer to he/she/it as LB.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Goal Oriented Learning","postDate":"1262983220","msgId":113342,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc2OEY0NURBLUZCOUMtNEUwNC1CRDBGLUQ2QUVBODZCNTUwQUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PERFRjIyNEZGLUVENjEtNDUwNC1COTBDLUM5N0Q4QzY5NjhCRkBnbWFpbC5jb20+","referencesHeader":"PGhpNGd2OCtqNzYzQGVHcm91cHMuY29tPiA8RkJCNjFFNjMtQzE5Qy00NDg2LTlENEQtMjFGMzE0REUxQTQwQGdtYWlsLmNvbT4gPDI4NzA3NC42OTYzNy5xbUB3ZWIxMTA0MTYubWFpbC5ncTEueWFob28uY29tPiA8REVGMjI0RkYtRUQ2MS00NTA0LUI5MEMtQzk3RDhDNjk2OEJGQGdtYWlsLmNvbT4="},"prevInTopic":113341,"nextInTopic":113343,"prevInTime":113341,"nextInTime":113343,"topicId":113299,"numMessagesInTopic":0,"msgSnippet":"-=-One day my child picked up a book to learn about something. And in the book s/he found a section on something else. S/he did not ask him/ herself if this","messageBody":"<div id=\"ygrps-yiv-1960349122\">-=-One day my child picked up a book to learn about something. And in  <br/>\nthe book s/he found a section on something else. S/he did not ask him/ <br/>\nherself if this second topic was important. S/he did not wonder if s/ <br/>\nhe had a good reason to learn about it. When s/he got to that section,  <br/>\ns/he just started reading it, with no particular goal. What&#39;s wrong  <br/>\nwith that? Sometimes when you read something with no reason in mind at  <br/>\nthe start, it tells you a reason to care in the text, or you come up  <br/>\nwith one yourself.-=-<br/>\n<br/>\nAre you not sure whether your child is male or female, or do you maybe  <br/>\nnot have a child? Is this hypothetical?<br/>\n<br/>\nHere are my children:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/kirby\">http://sandradodd.com/kirby</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/marty\">http://sandradodd.com/marty</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/holly\">http://sandradodd.com/holly</a><br/>\n<br/>\nIf you are of the TCS cult and it&#39;s against your religion to admit  <br/>\nwhether you have children or share anything concrete and personal,  <br/>\nthen you probably think me a great sinner, but having come to  <br/>\nunschooling from La Leche League, people generally saw me  <br/>\nbreastfeeding before they knew my name, and we talked about what was  <br/>\nACTUALLY happening with those babies right there, whose names were on  <br/>\nour LLL meeting nametags.  We weren&#39;t hiding behind anything.<br/>\n<br/>\nThe conventional method of discussing unschooling on this list and on  <br/>\nmany others which grew out of the same older forums involves honest,  <br/>\nopen, true-story examples.  You&#39;re purposefully and pointedly bringing  <br/>\nbehaviors to this list which are not of and for this list.  It would  <br/>\nbe like jumping up and speaking in tongues during an episcopal  <br/>\nservice.  I think you know that, and that for some reason you don&#39;t  <br/>\ncare.  Or you know it and never intended to be cooperative or  <br/>\ncourteous here.<br/>\n<br/>\n-=- And in the book s/he found a section on something else. S/he did  <br/>\nnot ask him/herself if this second topic was important. S/he did not  <br/>\nwonder if s/he had a good reason to learn about it. When s/he got to  <br/>\nthat section, s/he just started reading it, with no particular goal.  <br/>\nWhat&#39;s wrong with that? -=-<br/>\n<br/>\nNothing is wrong with that.  I&#39;ve often forgotten why I opened a  <br/>\ndictionary in the first place, or an encyclopedia, because I get  <br/>\ndistracted by something interesting.    It happens to people all the  <br/>\ntime with the internet.<br/>\n<br/>\n-=-It would have been hard for him/her to judge that section in  <br/>\nadvance, b/c s/he didn&#39;t know about it. S/he had no information to go  <br/>\non. Trying it was a good way to get some sense of what it&#39;s about. Of  <br/>\ncourse s/he could stop at any time if it turned out boring.-=-<br/>\n<br/>\nI think you&#39;ve gone from your original barely-honest example to a  <br/>\nsiding designed to get us to agree to something else, like the parents  <br/>\nhanding books to kids that the parents think the kids should check  <br/>\nout.  Perhaps you&#39;re totally unaware of the concept of strewing.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/strewing\">http://sandradodd.com/strewing</a><br/>\nPerhaps you want us to agree to some sort of manipulative parental  <br/>\nbehavior which you won&#39;t begin to be able to describe clearly, and  <br/>\nthat I&#39;m not interested in at all.<br/>\n<br/>\n-=-I was saying how one doesn&#39;t have to be doing anything recognizable  <br/>\nas problem solving. I think learning doesn&#39;t need justifications such  <br/>\nas that it will solve some problem. Perhaps we agree here?-=-<br/>\n<br/>\nPerhaps asking whether people agree with you is very foreign to the  <br/>\ntone and purpose of this list.   I&#39;m the third of the three list  <br/>\nowners; just sayin&#39;.<br/>\n<br/>\nIf someone gets interested in something and learns a ton of stuff  <br/>\nthey&#39;ll never learn, they&#39;re doing it because they want to, because it  <br/>\nhas amused them, or tied in with something, or is so new and different  <br/>\nit makes them see the world a whole new way.  For some people that  <br/>\nwill be intricate math puzzles.  For some it will be mastering a  <br/>\nnumber of musical instruments, even if they never once perform.  For  <br/>\nsome it will be collecting sample of barbed wire, and knowing hundreds  <br/>\nof cattle brands by sight, and happening through all that to have  <br/>\nlearned a great deal about the history of Texas and Kansas.<br/>\n<br/>\nThose are not, as far as I can tell, the sort of thing you were  <br/>\nthinking about when you talked about mathematics taught to college  <br/>\nseniors.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Specific Math Question","postDate":"1262965341","msgId":113341,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCNDc1MjVELjgwNTA5MDFAbWFjLmNvbT4=","inReplyToHeader":"PEQyMjczRjY1LTkwNjUtNERFNS1CQjc5LUQ4MzM4OUUxRDVBN0BnbWFpbC5jb20+","referencesHeader":"PEExQkI1NDY5LUIyNUQtNDhDMy05QjcwLTc0Q0M5NUMwREQwREBnbWFpbC5jb20+IDw0Njk5MzU3ODEwMDEwMzE1MjNsNWU1MmU0MzlzNjAwMTZiNWRjMjMxYmNhMkBtYWlsLmdtYWlsLmNvbT4gPEQ4ODI0NTkxLUY4N0ItNDM3OS1BMzA3LUE2Q0YxRDAwQzk4QkBnbWFpbC5jb20+IDxDOUJCNzk2NS03NzEzLTQ1NzQtQjlFQS0xNEI1MEZBOUFCOUZAdmVyaXpvbi5uZXQ+IDxEMjI3M0Y2NS05MDY1LTRERTUtQkI3OS1EODMzODlFMUQ1QTdAZ21haWwuY29tPg=="},"prevInTopic":113339,"nextInTopic":113342,"prevInTime":113340,"nextInTime":113342,"topicId":113299,"numMessagesInTopic":0,"msgSnippet":"I asked some questions that Keith didn t yet answer. Keith, if you want to discuss how to help kids learn higher mathematics in unconventional ways, it would","messageBody":"<div id=\"ygrps-yiv-1523239166\">I asked some questions that Keith didn&#39;t yet answer.<br/>\n<br/>\nKeith, if you want to discuss how to help kids learn higher mathematics <br/>\nin unconventional ways, it would help to know how the kid learned the <br/>\nmath he or she already knows in order to be interested in the <br/>\nhigher-level math and ready to be able to do it. How has your child, the <br/>\none that is interested in learning higher-level math in unconventional <br/>\nways, learned math up to now? Also, &quot;higher math&quot; isn&#39;t a single thing - <br/>\nthere are lots and lots of different topics. What is he/she actually <br/>\ninterested in?<br/>\n<br/>\nThese things don&#39;t come up in a vacuum - there is context and a build-up <br/>\nand there are relationships and background and it all matters.<br/>\n<br/>\nFor example, if you already have that higher math knowledge that your <br/>\nchild is interested in -- why aren&#39;t you two just working on it <br/>\ntogether, talking about it, setting up problems to analyze and solve - <br/>\nwith you as a coach, helping out just as much as your child wants?<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":426059133,"authorName":"Keith Green","from":"Keith Green &lt;popper256@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Goal Oriented Learning","postDate":"1262952012","msgId":113339,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PERFRjIyNEZGLUVENjEtNDUwNC1COTBDLUM5N0Q4QzY5NjhCRkBnbWFpbC5jb20+","inReplyToHeader":"PDI4NzA3NC42OTYzNy5xbUB3ZWIxMTA0MTYubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PGhpNGd2OCtqNzYzQGVHcm91cHMuY29tPiA8RkJCNjFFNjMtQzE5Qy00NDg2LTlENEQtMjFGMzE0REUxQTQwQGdtYWlsLmNvbT4gPDI4NzA3NC42OTYzNy5xbUB3ZWIxMTA0MTYubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":113337,"nextInTopic":113341,"prevInTime":113338,"nextInTime":113340,"topicId":113299,"numMessagesInTopic":0,"msgSnippet":"... One day my child picked up a book to learn about something. And in the book s/he found a section on something else. S/he did not ask him/herself if this","messageBody":"<div id=\"ygrps-yiv-1169363868\">On Jan 7, 2010, at 12:43 PM, Jenny Cyphers wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; ***Surely my pointing out that learning things with no particular goal in mind, no immediate problem to solve, etc, can have unforeseen benefits, couldn&#39;t scare anyone away from an unstructured, wide learning style.***<br/>\n&gt;  <br/>\n&gt; You can point that out all you want, but it&#39;s not really how unschooling works at all.  My kids have never ever in all their years learned anything without a reason to learn it.  While they are learning things all the time everyday, for specific reason, they pick up all sorts of other things along the way.  That is how the sphere of learning widens.  <br/>\n&gt;  <br/>\n&gt; They never intentionally set out to learn something with no particular goal, that is a completely schooled mindset.  Learning goals are all about school think.  In the absence of that, there is simple living and learning.  That is what I see my kids doing all the time everyday.<br/>\n<br/>\n </span></blockquote>One day my child picked up a book to learn about something. And in the book s/he found a section on something else. S/he did not ask him/herself if this second topic was important. S/he did not wonder if s/he had a good reason to learn about it. When s/he got to that section, s/he just started reading it, with no particular goal. What&#39;s wrong with that? Sometimes when you read something with no reason in mind at the start, it tells you a reason to care in the text, or you come up with one yourself.<br/>\n<br/>\nIt would have been hard for him/her to judge that section in advance, b/c s/he didn&#39;t know about it. S/he had no information to go on. Trying it was a good way to get some sense of what it&#39;s about. Of course s/he could stop at any time if it turned out boring.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; [my kids] don&#39;t think it at all relevant to do &quot;problem solving&quot; for the sake of problem solving.  There is plenty of that happening naturally, with lots of unforeseen benefits.<br/>\n<br/>\n </span></blockquote>I was saying how one doesn&#39;t have to be doing anything recognizable as problem solving. I think learning doesn&#39;t need justifications such as that it will solve some problem. Perhaps we agree here?</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce","from":"&quot;Joyce&quot; &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Specific Math Question","postDate":"1262904243","msgId":113337,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhpNW8zait2MWgxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDI4NzA3NC42OTYzNy5xbUB3ZWIxMTA0MTYubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":113336,"nextInTopic":113339,"prevInTime":113336,"nextInTime":113338,"topicId":113299,"numMessagesInTopic":0,"msgSnippet":"Keith, Participation on a list is not an invitation to privately email people. First it s rude. It s no different than following someone home because you ve","messageBody":"<div id=\"ygrps-yiv-819730993\">Keith,<br/>\nParticipation on a list is not an invitation to privately email people.<br/>\nFirst it&#39;s rude. It&#39;s no different than following someone home because<br/>\nyou&#39;ve both attended a meeting.<br/>\nSecond, we want people to feel free to post not to hesitate for fear<br/>\nthat will draw unwanted emails.  Joyce<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: Specific Math Question","postDate":"1262897007","msgId":113336,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI4NzA3NC42OTYzNy5xbUB3ZWIxMTA0MTYubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PEZCQjYxRTYzLUMxOUMtNDQ4Ni05RDRELTIxRjMxNERFMUE0MEBnbWFpbC5jb20+","referencesHeader":"PGhpNGd2OCtqNzYzQGVHcm91cHMuY29tPiA8RkJCNjFFNjMtQzE5Qy00NDg2LTlENEQtMjFGMzE0REUxQTQwQGdtYWlsLmNvbT4="},"prevInTopic":113335,"nextInTopic":113337,"prevInTime":113335,"nextInTime":113337,"topicId":113299,"numMessagesInTopic":0,"msgSnippet":"***Surely my pointing out that learning things with no particular goal in mind, no immediate problem to solve, etc, can have unforeseen benefits, couldn t","messageBody":"<div id=\"ygrps-yiv-1761166966\">***Surely my pointing out that learning things with no particular goal in mind, no immediate problem to solve, etc, can have unforeseen benefits, couldn&#39;t scare anyone away from an unstructured, wide learning style.***<br/>\n <br/>\nYou can point that out all you want, but it&#39;s not really how unschooling works at all.  My kids have never ever in all their years learned anything without a reason to learn it.  While they are learning things all the time everyday, for specific reason, they pick up all sorts of other things along the way.  That is how the sphere of learning widens.  <br/>\n <br/>\nThey never intentionally set out to learn something with no particular goal, that is a completely schooled mindset.  Learning goals are all about school think.  In the absence of that, there is simple living and learning.  That is what I see my kids doing all the time everyday.<br/>\n <br/>\nHere&#39;s the thing... my kids&#39; heads are full of thinking and full of ideas.  They absorb more things in all the time.  Since they are so occupied with their own thoughts and ideas and knowledge, they don&#39;t think it at all relevant to do &quot;problem solving&quot; for the sake of problem solving.  There is plenty of that happening naturally, with lots of unforeseen benefits.<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Specific Math Question","postDate":"1262896433","msgId":113335,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMyMDY4LjMwMTkzLnFtQHdlYjExMDQwMi5tYWlsLmdxMS55YWhvby5jb20+","inReplyToHeader":"PEQyMjczRjY1LTkwNjUtNERFNS1CQjc5LUQ4MzM4OUUxRDVBN0BnbWFpbC5jb20+","referencesHeader":"PEExQkI1NDY5LUIyNUQtNDhDMy05QjcwLTc0Q0M5NUMwREQwREBnbWFpbC5jb20+IDw0Njk5MzU3ODEwMDEwMzE1MjNsNWU1MmU0MzlzNjAwMTZiNWRjMjMxYmNhMkBtYWlsLmdtYWlsLmNvbT4gPEQ4ODI0NTkxLUY4N0ItNDM3OS1BMzA3LUE2Q0YxRDAwQzk4QkBnbWFpbC5jb20+IDxDOUJCNzk2NS03NzEzLTQ1NzQtQjlFQS0xNEI1MEZBOUFCOUZAdmVyaXpvbi5uZXQ+IDxEMjI3M0Y2NS05MDY1LTRERTUtQkI3OS1EODMzODlFMUQ1QTdAZ21haWwuY29tPg=="},"prevInTopic":113334,"nextInTopic":113336,"prevInTime":113334,"nextInTime":113336,"topicId":113299,"numMessagesInTopic":0,"msgSnippet":"***I was recommending that people expose themselves to a wide variety of stuff, all of which they like and enjoy at the time they do it, related to their area","messageBody":"<div id=\"ygrps-yiv-422154590\">***I was recommending that people expose themselves to a wide variety of stuff, all of which they like and enjoy at the time they do it, related to their area of expertise (if they have one, and there&#39;s nothing wrong with being a generalist). This was not a strong recommendation, I simply pointed out it has merits.***<br/>\n<br/>\nNo you weren&#39;t.  You were wanting specific math help for non specific reason and perhaps hypothetical children who may one day perhaps need to know some non specific hypothetical math, that turns out to not really be anything specific about math, but more theoretical math that nobody needs to know anyway!<br/>\n<br/>\nAnd NOW you are trying to tell people here that nobody really needs to know this stuff, and that you would never force it on any child anyway.  What exactly is your point?!<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyler_waynforth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: Specific Math Question","postDate":"1262872719","msgId":113334,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMxMDQ5OC4zOTE2Ni5xbUB3ZWI4NjIwMy5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PEZCQjYxRTYzLUMxOUMtNDQ4Ni05RDRELTIxRjMxNERFMUE0MEBnbWFpbC5jb20+","referencesHeader":"PGhpNGd2OCtqNzYzQGVHcm91cHMuY29tPiA8RkJCNjFFNjMtQzE5Qy00NDg2LTlENEQtMjFGMzE0REUxQTQwQGdtYWlsLmNvbT4="},"prevInTopic":113333,"nextInTopic":113335,"prevInTime":113333,"nextInTime":113335,"topicId":113299,"numMessagesInTopic":0,"msgSnippet":"Stating, on an unschooling list, that learning things with no particular goal in mind, no immediate problem to solve, etc, can have unforeseen benefits could","messageBody":"<div id=\"ygrps-yiv-24582045\">Stating, on an unschooling list, that learning things with no particular goal in mind, no immediate problem to solve, etc, can have unforeseen benefits could encourage parents to set learning tasks for their children on the off chance that the learning task will pay out in a future moment. Whether or not it is a non sequitur for you, it may not be for other people.So, yes, it can move people away from an unschooling approach to learning. Particularly given that there is no context to what you are writing about. You have consistently ignored the requests for more information about why you are asking for information or why you are pushing information on people who have not asked for a moment of your time or advice.<br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Keith Green <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:popper256@...\">popper256@...</a><br/>\n<br/>\n<br/>\n<br/>\nSurely my pointing out that learning things with no particular goal in mind, no immediate problem to solve, etc, can have unforeseen benefits, couldn&#39;t scare anyone away from an unstructured, wide learning style.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce","from":"&quot;Joyce&quot; &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Specific Math Question","postDate":"1262872055","msgId":113333,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhpNG9sbisyYnRnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEZCQjYxRTYzLUMxOUMtNDQ4Ni05RDRELTIxRjMxNERFMUE0MEBnbWFpbC5jb20+"},"prevInTopic":113332,"nextInTopic":113334,"prevInTime":113332,"nextInTime":113334,"topicId":113299,"numMessagesInTopic":0,"msgSnippet":"**** Surely my pointing out that learning things with no particular goal in mind, no immediate problem to solve, etc, can have unforeseen benefits, couldn t","messageBody":"<div id=\"ygrps-yiv-1643814504\">**** Surely my pointing out that learning things with no particular goal<br/>\nin mind, no immediate problem to solve, etc, can have unforeseen<br/>\nbenefits, couldn&#39;t scare anyone away from an unstructured, wide learning<br/>\nstyle. ****<br/>\n<br/>\nYour theory is based on what data?<br/>\n<br/>\nEveryone comes to unschooling with different baggage. Some won&#39;t be<br/>\nworried about what their kids need to learn. They&#39;ve come to unschooling<br/>\nbecause it feels right and natural. But some come to unschooling because<br/>\nthey see the damage school is doing or can do but they don&#39;t have a<br/>\ntrust in anything else. Some people *are* worried that unschooling<br/>\ndoesn&#39;t look like someone preparing someone else to be in the world.<br/>\n<br/>\nPeople who aren&#39;t worried can skip the explanations of parts that don&#39;t<br/>\nbother them. But the people who are bothered can&#39;t fill in the blanks<br/>\nthemselves. That&#39;s where more experienced unschoolers can help.<br/>\n<br/>\nI&#39;ve been explaining unschooling for 14 years. I&#39;ve probably read the<br/>\nfears and misunderstandings of a few 100o people who want to unschool.<br/>\nThat&#39;s a pretty big mass of data to draw on so that I can say with<br/>\nconfidence that, yes, hearing how  some choices an autodidact might find<br/>\nuseful *would* worry some parents when they don&#39;t see their kids making<br/>\nanything that looks like those choices.<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":426059133,"authorName":"Keith Green","from":"Keith Green &lt;popper256@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: Specific Math Question","postDate":"1262865940","msgId":113332,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEZCQjYxRTYzLUMxOUMtNDQ4Ni05RDRELTIxRjMxNERFMUE0MEBnbWFpbC5jb20+","inReplyToHeader":"PGhpNGd2OCtqNzYzQGVHcm91cHMuY29tPg==","referencesHeader":"PGhpNGd2OCtqNzYzQGVHcm91cHMuY29tPg=="},"prevInTopic":113331,"nextInTopic":113333,"prevInTime":113331,"nextInTime":113333,"topicId":113299,"numMessagesInTopic":0,"msgSnippet":"... Surely my pointing out that learning things with no particular goal in mind, no immediate problem to solve, etc, can have unforeseen benefits, couldn t","messageBody":"<div id=\"ygrps-yiv-1998456919\">On Jan 7, 2010, at 3:36 AM, Joyce wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; **** To me, it&#39;s a complete non sequitur to jump from a recommendation<br/>\n&gt; that people do X to the idea of subjecting children to X. ****<br/>\n&gt; The purpose of the list is to provide information to parents to<br/>\n&gt; facilitate *someone else&#39;s* learning. If a suggestion or idea could<br/>\n&gt; worry parents that their happily, widely exploring children aren&#39;t doing<br/>\n&gt; something the children might find beneficial down the road, that needs<br/>\n&gt; discussed.<br/>\n<br/>\n </span></blockquote>Surely my pointing out that learning things with no particular goal in mind, no immediate problem to solve, etc, can have unforeseen benefits, couldn&#39;t scare anyone away from an unstructured, wide learning style.</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce","from":"&quot;Joyce&quot; &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Specific Math Question","postDate":"1262864168","msgId":113331,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhpNGd2OCtqNzYzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEQyMjczRjY1LTkwNjUtNERFNS1CQjc5LUQ4MzM4OUUxRDVBN0BnbWFpbC5jb20+"},"prevInTopic":113330,"nextInTopic":113332,"prevInTime":113330,"nextInTime":113332,"topicId":113299,"numMessagesInTopic":0,"msgSnippet":"**** To me, it s a complete non sequitur to jump from a recommendation that people do X to the idea of subjecting children to X. **** The purpose of the list","messageBody":"<div id=\"ygrps-yiv-581282331\">**** To me, it&#39;s a complete non sequitur to jump from a recommendation<br/>\nthat people do X to the idea of subjecting children to X. ****<br/>\nThe purpose of the list is to provide information to parents to<br/>\nfacilitate *someone else&#39;s* learning. If a suggestion or idea could<br/>\nworry parents that their happily, widely exploring children aren&#39;t doing<br/>\nsomething the children might find beneficial down the road, that needs<br/>\ndiscussed.<br/>\nWhile the owners (of which I&#39;m one) are allowing the discussion, the<br/>\ndiscussion needs to serve the needs of it&#39;s intended audience not just<br/>\nanyone who comes along and thinks it&#39;s a good place to ask a question.<br/>\nIf your use of the list interferes with its purpose then the discussion<br/>\nneeds pulled back to that and information that&#39;s unhelpful to the list&#39;s<br/>\naudience needs examined to keep it focused and useful for them.<br/>\nAn autodidact forum might be more useful to you. No matter how valuable<br/>\nsomeone finds something for themselves, the purpose of the list is to<br/>\nhelp parents  support what their children value and examine where what<br/>\nthey find useful for themselves might get in the way of their children&#39;s<br/>\nexplorations.<br/>\nJoyce<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":426059133,"authorName":"Keith Green","from":"Keith Green &lt;popper256@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Specific Math Question","postDate":"1262859569","msgId":113330,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQyMjczRjY1LTkwNjUtNERFNS1CQjc5LUQ4MzM4OUUxRDVBN0BnbWFpbC5jb20+","inReplyToHeader":"PEM5QkI3OTY1LTc3MTMtNDU3NC1COUVBLTE0QjUwRkE5QUI5RkB2ZXJpem9uLm5ldD4=","referencesHeader":"PEExQkI1NDY5LUIyNUQtNDhDMy05QjcwLTc0Q0M5NUMwREQwREBnbWFpbC5jb20+IDw0Njk5MzU3ODEwMDEwMzE1MjNsNWU1MmU0MzlzNjAwMTZiNWRjMjMxYmNhMkBtYWlsLmdtYWlsLmNvbT4gPEQ4ODI0NTkxLUY4N0ItNDM3OS1BMzA3LUE2Q0YxRDAwQzk4QkBnbWFpbC5jb20+IDxDOUJCNzk2NS03NzEzLTQ1NzQtQjlFQS0xNEI1MEZBOUFCOUZAdmVyaXpvbi5uZXQ+"},"prevInTopic":113311,"nextInTopic":113331,"prevInTime":113329,"nextInTime":113331,"topicId":113299,"numMessagesInTopic":0,"msgSnippet":"... I was recommending that people expose themselves to a wide variety of stuff, all of which they like and enjoy at the time they do it, related to their area","messageBody":"<div id=\"ygrps-yiv-529495400\">On Jan 4, 2010, at 5:18 AM, Joyce Fetteroll wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; On Jan 3, 2010, at 7:22 PM, Keith Green wrote:<br/>\n&gt; <br/>\n&gt;&gt; For professional or very serious mathematicians, I think that  <br/>\n&gt;&gt; understanding math better will frequently have unexpected benefits.  <br/>\n&gt;&gt; It will just happen to turn out useful on some other math problem  <br/>\n&gt;&gt; later. So that is a good reason to learn more with no specific goal  <br/>\n&gt;&gt; or benefit in mind. But I also see that trying to solve specific  <br/>\n&gt;&gt; problems which seem useful to solve has merit, and in doing so one  <br/>\n&gt;&gt; will end up learning about math (complete with unforeseen benefits)  <br/>\n&gt;&gt; anyway.<br/>\n&gt; <br/>\n&gt; While it sounds like a reasonable argument, it&#39;s the same argument  <br/>\n&gt; that drives how schools run and why most parents are afraid not to  <br/>\n&gt; subject their kids to the rigors of a (supposedly!) &quot;prepare them to  <br/>\n&gt; be anything they want&quot; education. There probably isn&#39;t a single  <br/>\n&gt; person who hasn&#39;t benefited from something they learned in school.  <br/>\n&gt; But we can&#39;t know what any particular person will benefit from and it  <br/>\n&gt; doesn&#39;t justify subjecting everyone to the (supposedly) full spectrum.<br/>\n&gt; <br/>\n&gt; Because we can&#39;t know what anyone will find useful, exposing kids to  <br/>\n&gt; a wide variety from life is the most likely way they&#39;ll discover more  <br/>\n&gt; about their unique way of learning. Getting to know our kids helps in  <br/>\n&gt; focusing that wide variety to what they&#39;re likely to find  <br/>\n&gt; interesting. (There isn&#39;t time for everything!)<br/>\n<br/>\n </span></blockquote>I was recommending that people expose themselves to a wide variety of stuff, all of which they like and enjoy at the time they do it, related to their area of expertise (if they have one, and there&#39;s nothing wrong with being a generalist). This was not a strong recommendation, I simply pointed out it has merits.<br/>\n<br/>\nI completely disagree with the mindset that if X is desirable, then we should do X to our children. I think we should help our children, and when we think it&#39;d be good if they did something, offer it as a suggestion.<br/>\n<br/>\nTo me, it&#39;s a complete non sequitur to jump from a recommendation that people do X to the idea of subjecting children to X.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Specific Math Question","postDate":"1262627783","msgId":113311,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNBOEU1RjlCLTZDQTItNDc2NS05NEY1LTNGOTY5ODU5REIyQUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDRCNDIxQURDLjkwNDA0MDJAbWFjLmNvbT4=","referencesHeader":"PEExQkI1NDY5LUIyNUQtNDhDMy05QjcwLTc0Q0M5NUMwREQwREBnbWFpbC5jb20+IDw0QjQyMUFEQy45MDQwNDAyQG1hYy5jb20+"},"prevInTopic":113310,"nextInTopic":113330,"prevInTime":113310,"nextInTime":113312,"topicId":113299,"numMessagesInTopic":0,"msgSnippet":"Pam wrote: -=-I don t understand, Keith, why you re asking these here. Are you hoping you ll embarrass people here because they don t have the interest or ","messageBody":"<div id=\"ygrps-yiv-303326309\">Pam wrote:<br/>\n-=-I don&#39;t understand, Keith, why you&#39;re asking these here. Are you  <br/>\nhoping<br/>\nyou&#39;ll embarrass people here because they don&#39;t have the interest or<br/>\ninclination to tackle such problems?-=-<br/>\n<br/>\nI knew it was jackoff, but I didn&#39;t know it was political jackoff.   <br/>\nThat&#39;s the worst kind.<br/>\n<br/>\nI don&#39;t think I could be the least bit embarrassed with kids as happy  <br/>\nand successful as mine are.  And not one of my kids has ever spent a  <br/>\nmoment wasting other people&#39;s time that way for fun.  They&#39;re doing  <br/>\nuseful things, all the time.<br/>\n<br/>\nI made a comment in a discussion recently that I thought the greatest  <br/>\nmark of my confidence is that I help my kids go out into the world  <br/>\nunaccompanied by either parent, without coaching about what they  <br/>\nshould and shouldn&#39;t say.  At this point hundreds of other parents  <br/>\nhave met my kids (or one of them, or two) and have had opportunities  <br/>\nto see them candidly and in bad moments, and if they were shameful  <br/>\nembarrassing examples of ANYthing, no doubt it would be spread about.<br/>\n<br/>\nIt&#39;s like highwire without a net, I said.  I&#39;m kinda showing off.  But  <br/>\nmy kids didn&#39;t go to school, and they didn&#39;t &quot;do school&quot; and they are  <br/>\ndeveloping into awesome, thoughtful, courteous people beyond any guess  <br/>\nI would ever have made.  I had faith in little moments creating a good  <br/>\nbasis for future choices and paths, and tadaa!<br/>\n<br/>\nMath puzzles no one needs the answer to aren&#39;t worth a bucket of poo  <br/>\nexcept to those who want to do that for fun, and there were people  <br/>\ndoing math for fun long before there were schools of any sort.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Specific Math Question","postDate":"1262623452","msgId":113310,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCNDIxQURDLjkwNDA0MDJAbWFjLmNvbT4=","inReplyToHeader":"PEExQkI1NDY5LUIyNUQtNDhDMy05QjcwLTc0Q0M5NUMwREQwREBnbWFpbC5jb20+","referencesHeader":"PEExQkI1NDY5LUIyNUQtNDhDMy05QjcwLTc0Q0M5NUMwREQwREBnbWFpbC5jb20+"},"prevInTopic":113307,"nextInTopic":113311,"prevInTime":113309,"nextInTime":113311,"topicId":113299,"numMessagesInTopic":0,"msgSnippet":"... Are you a follower of David Deutsch and Taking Children Seriously? From what you ve written, and the popper in your email address, that s my guess. ","messageBody":"<div id=\"ygrps-yiv-1700257111\">On 1/3/2010 2:08 PM, Keith Green wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I have been asked for specifics. Here is a specific question:<br/>\n&gt;    <br/>\n </span></blockquote>Are you a follower of David Deutsch and &quot;Taking Children Seriously?&quot;  <br/>\n From what you&#39;ve written, and the &quot;popper&quot; in your email address, <br/>\nthat&#39;s my guess.<br/>\n<br/>\nWhat are you really doing here? Why are you continuing to argue even <br/>\nafter it has clearly become apparent that people here are not going to <br/>\ngive you a satisfactory (to you) answer? What are you trying to prove?<br/>\n<br/>\nWe are a bunch of unschooling parents -- how many of us do you think <br/>\nhave any interest at all in higher math? Maybe a handful? Of those, how <br/>\nmany do you think have older kids who have developed an interest in <br/>\nhigher math and have pursued it outside of college? Yeah - probably none.<br/>\n<br/>\nIf any of us have children who are interested in pursuing higher math <br/>\noutside of college, then we&#39;ll help our own real children (children who <br/>\nhave names and ages and backgrounds) pursue that interest.<br/>\n<br/>\nTo the rest of the list - frustrated yet? Welcome to the wonderful world <br/>\nof discussions with the &quot;Taking Children Seriously&quot; folks.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Consider the integers from 1 to n. How many can you select such that no three are in arithmetic progression? (The answer is not known, but even without finding it one can look for upper and lower bounds.)<br/>\n&gt;    <br/>\n </span></blockquote>I am not interested in doing this here, on this list (which I am one of <br/>\nthe owners of, by the way).  It won&#39;t help anybody here unschool and it <br/>\nvery likely is making people stop reading the list as they cringe and <br/>\nturn away because all their school-induced math anxiety is kicking in.<br/>\n<blockquote><span title=\"ireply\"> &gt; Can anyone offer:<br/>\n&gt;<br/>\n&gt; - an explanation of the general mathematical concepts suited to analyzing this problem<br/>\n&gt;<br/>\n&gt; - an explanation of the answer to this problem which is accessible to someone who isn&#39;t a professional mathematician<br/>\n&gt;<br/>\n&gt; - a book or other resource containing the above<br/>\n&gt;<br/>\n&gt; - a book or other resource containing the background knowledge appropriate to approach this problem oneself<br/>\n&gt;<br/>\n&gt; - something else even better<br/>\n&gt;<br/>\n&gt; I am not interested in being pointed to anything that can be found on Google. I know how to use Google. I ask here in hopes that someone here has learned a lot of math outside of school, or knows someone who has, and so would be able to give an expert answer.<br/>\n&gt;    <br/>\n<br/>\n </span></blockquote>Just stop it. You already KNOW that nobody has this information. How <br/>\ncould we even point you to anything that can&#39;t be found by Google? And I <br/>\nam sure that you have other places to ask it and you could google it and <br/>\nfind out absolutely anything that we could possibly tell you, anyway.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Why not ask somewhere else? Because school makes something like 80% of its students hate math and avoid it for the rest of their lives. School style math material is dangerous. Related to that, the educational philosophy behind material designed for schools is mistaken and this detracts from it, often severely. These are the kinds of issues I hope unschoolers in particular may be sensitive to.<br/>\n&gt;    <br/>\n<br/>\n </span></blockquote>I agree with the above assessment of math education. But you are asking <br/>\na group of unschooling parents to offer information about higher <br/>\nmathematics learning that they do not have and you&#39;re pushing it and <br/>\npushing it even after it has become abundantly clear that nobody has <br/>\nthis information.<br/>\n<br/>\nBy the way, as much as I agree with the description of math education at <br/>\nelementary, secondary, and even mostly at the college level, it doesn&#39;t <br/>\nfit my experience with higher mathematics at the university graduate level.<br/>\n<br/>\nIF I had a child with an interest in higher mathematics, we would, <br/>\ntogether, explore various possibilities. She might decide to take <br/>\ncollege courses - that would be one option. She might look at reviews <br/>\nand recommendations of a variety of books and choose to study from one <br/>\nor more of them. She might want to find a mentor - someone to work with <br/>\nher. There might be other options but, since I do NOT actually have a <br/>\nchild interested in pursuing high-level mathematics outside of college, <br/>\nI haven&#39;t come up with any others.<br/>\n<br/>\nI don&#39;t know what any particular individual person would choose. That <br/>\ndepends on the individual.<br/>\n<blockquote><span title=\"ireply\"> &gt; I can offer some other specific problems if anyone is at a loss over this particular problem, but thinks they&#39;d be able to help with others.<br/>\n&gt;    <br/>\n </span></blockquote>I don&#39;t understand, Keith, why you&#39;re asking these here. Are you hoping <br/>\nyou&#39;ll embarrass people here because they don&#39;t have the interest or <br/>\ninclination to tackle such problems?<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Specific Math Question","postDate":"1262611121","msgId":113307,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM5QkI3OTY1LTc3MTMtNDU3NC1COUVBLTE0QjUwRkE5QUI5RkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PEQ4ODI0NTkxLUY4N0ItNDM3OS1BMzA3LUE2Q0YxRDAwQzk4QkBnbWFpbC5jb20+","referencesHeader":"PEExQkI1NDY5LUIyNUQtNDhDMy05QjcwLTc0Q0M5NUMwREQwREBnbWFpbC5jb20+IDw0Njk5MzU3ODEwMDEwMzE1MjNsNWU1MmU0MzlzNjAwMTZiNWRjMjMxYmNhMkBtYWlsLmdtYWlsLmNvbT4gPEQ4ODI0NTkxLUY4N0ItNDM3OS1BMzA3LUE2Q0YxRDAwQzk4QkBnbWFpbC5jb20+"},"prevInTopic":113304,"nextInTopic":113310,"prevInTime":113306,"nextInTime":113308,"topicId":113299,"numMessagesInTopic":0,"msgSnippet":"... While it sounds like a reasonable argument, it s the same argument that drives how schools run and why most parents are afraid not to subject their kids to","messageBody":"<div id=\"ygrps-yiv-1125129385\">On Jan 3, 2010, at 7:22 PM, Keith Green wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; For professional or very serious mathematicians, I think that  <br/>\n&gt; understanding math better will frequently have unexpected benefits.  <br/>\n&gt; It will just happen to turn out useful on some other math problem  <br/>\n&gt; later. So that is a good reason to learn more with no specific goal  <br/>\n&gt; or benefit in mind. But I also see that trying to solve specific  <br/>\n&gt; problems which seem useful to solve has merit, and in doing so one  <br/>\n&gt; will end up learning about math (complete with unforeseen benefits)  <br/>\n&gt; anyway.<br/>\n<br/>\n </span></blockquote>While it sounds like a reasonable argument, it&#39;s the same argument  <br/>\nthat drives how schools run and why most parents are afraid not to  <br/>\nsubject their kids to the rigors of a (supposedly!) &quot;prepare them to  <br/>\nbe anything they want&quot; education. There probably isn&#39;t a single  <br/>\nperson who hasn&#39;t benefited from something they learned in school.  <br/>\nBut we can&#39;t know what any particular person will benefit from and it  <br/>\ndoesn&#39;t justify subjecting everyone to the (supposedly) full spectrum.<br/>\n<br/>\nBecause we can&#39;t know what anyone will find useful, exposing kids to  <br/>\na wide variety from life is the most likely way they&#39;ll discover more  <br/>\nabout their unique way of learning. Getting to know our kids helps in  <br/>\nfocusing that wide variety to what they&#39;re likely to find  <br/>\ninteresting. (There isn&#39;t time for everything!)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So I don&#39;t really favor 1 or 2 over the other.<br/>\n<br/>\n<br/>\n </span></blockquote>Most people would favor 2 over 1 since most people are more inclined  <br/>\nto understand the abstract after they understand the concrete. Some  <br/>\npeople like to bounce back and forth.<br/>\n<br/>\nMost people will learn quickest from playing around with a new piece  <br/>\nof equipment (concrete) and reading some of the directions  <br/>\n(abstract). Some people don&#39;t want a broader picture, though. They  <br/>\njust want to get the thing to do what they want it to do so playing  <br/>\nmight work best for them. Some people want the big picture before  <br/>\nthey use something. (It&#39;s impossible to tell how much of that is  <br/>\nnatural and how much is caused by school.)<br/>\n<br/>\nWhich is why why someone wants to know something is useful in helping  <br/>\nthem and why people keep asking why and who and what for. If one  <br/>\nanswer fit all similar surface needs then schools would work just fine.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":426059133,"authorName":"Keith Green","from":"Keith Green &lt;popper256@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Specific Math Question","postDate":"1262564527","msgId":113304,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQ4ODI0NTkxLUY4N0ItNDM3OS1BMzA3LUE2Q0YxRDAwQzk4QkBnbWFpbC5jb20+","inReplyToHeader":"PDQ2OTkzNTc4MTAwMTAzMTUyM2w1ZTUyZTQzOXM2MDAxNmI1ZGMyMzFiY2EyQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PEExQkI1NDY5LUIyNUQtNDhDMy05QjcwLTc0Q0M5NUMwREQwREBnbWFpbC5jb20+IDw0Njk5MzU3ODEwMDEwMzE1MjNsNWU1MmU0MzlzNjAwMTZiNWRjMjMxYmNhMkBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":113303,"nextInTopic":113307,"prevInTime":113303,"nextInTime":113305,"topicId":113299,"numMessagesInTopic":0,"msgSnippet":"... Cool, I (and my family) didn t know that. That doesn t sound like a very good style of creating math problems, which I think you agree with but I m not","messageBody":"<div id=\"ygrps-yiv-585831424\">On Jan 3, 2010, at 3:23 PM, Dan Lake wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Keith, consider the following statements..<br/>\n&gt; <br/>\n&gt;   1. The point of solving problems is to understand mathematics better.<br/>\n&gt;   2. The point of understanding mathematics better is to become better able<br/>\n&gt; to solve problems.<br/>\n&gt; <br/>\n&gt; The problem you described (ErdosˆTuran conjecture) was conceived using the<br/>\n&gt; Hungarian approach to mathemetics where they would propose extremely<br/>\n&gt; difficult problems with no particular application and hope that by solving<br/>\n&gt; it, some useful application would present itself.<br/>\n<br/>\n </span></blockquote>Cool, I (and my family) didn&#39;t know that. That doesn&#39;t sound like a very good style of creating math problems, which I think you agree with but I&#39;m not positive. What other styles are there? Do you know a good source of math problems with a different kind of style? <br/>\n<br/>\nOne other style I know of is the school style where they put forward a lot of similar problems in hopes that repetition will lead to memorization, and this will somehow lead to learning.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Personally, I believe that the application is primary and associate with statement #2.<br/>\n<br/>\n </span></blockquote>That&#39;s an interesting question.<br/>\n<br/>\nI think for non-professionals neither should be primary, having a nice time should be. Although if one wants to solve some math problem to accomplish some other goal, then that could be primary instead.<br/>\n<br/>\nFor professional or very serious mathematicians, I think that understanding math better will frequently have unexpected benefits. It will just happen to turn out useful on some other math problem later. So that is a good reason to learn more with no specific goal or benefit in mind. But I also see that trying to solve specific problems which seem useful to solve has merit, and in doing so one will end up learning about math (complete with unforeseen benefits) anyway. So I don&#39;t really favor 1 or 2 over the other.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nOh, by the way, if anyone is interested, there are some good math problems here:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://projecteuler.net/\">http://projecteuler.net/</a><br/>\n<br/>\nA lot of the later ones get very hard, though. Also, for better or worse, they are intended to be solved computer aided, so one would want to know some programming too.</div>","specialLinks":[]},{"userId":334795970,"authorName":"Dan Lake","from":"Dan Lake &lt;danthedad@...&gt;","profile":"dlake97123","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Specific Math Question","postDate":"1262560995","msgId":113303,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ2OTkzNTc4MTAwMTAzMTUyM2w1ZTUyZTQzOXM2MDAxNmI1ZGMyMzFiY2EyQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PEExQkI1NDY5LUIyNUQtNDhDMy05QjcwLTc0Q0M5NUMwREQwREBnbWFpbC5jb20+","referencesHeader":"PEExQkI1NDY5LUIyNUQtNDhDMy05QjcwLTc0Q0M5NUMwREQwREBnbWFpbC5jb20+"},"prevInTopic":113302,"nextInTopic":113304,"prevInTime":113302,"nextInTime":113304,"topicId":113299,"numMessagesInTopic":0,"msgSnippet":"Keith, consider the following statements.. 1. The point of solving problems is to understand mathematics better. 2. The point of understanding mathematics","messageBody":"<div id=\"ygrps-yiv-275012861\">Keith, consider the following statements..<br/>\n<br/>\n   1. The point of solving problems is to understand mathematics better.<br/>\n   2. The point of understanding mathematics better is to become better able<br/>\nto solve problems.<br/>\n<br/>\nThe problem you described (Erdos�Turan conjecture) was conceived using the<br/>\nHungarian approach to mathemetics where they would propose extremely<br/>\ndifficult problems with no particular application and hope that by solving<br/>\nit, some useful application would present itself. Personally, I believe that<br/>\nthe application is primary and associate with statement #2.<br/>\n<br/>\n~Dan<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sun, Jan 3, 2010 at 2:08 PM, Keith Green &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:popper256@...\">popper256@...</a>&gt; wrote:<br/>\n<br/>\n&gt; I have been asked for specifics. Here is a specific question:<br/>\n&gt;<br/>\n&gt; Consider the integers from 1 to n. How many can you select such that no<br/>\n&gt; three are in arithmetic progression? (The answer is not known, but even<br/>\n&gt; without finding it one can look for upper and lower bounds.)<br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Specific Math Question","postDate":"1262558069","msgId":113302,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ3MzM4Mi42Nzk2MS5xbUB3ZWIxMTA0MTEubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PEExQkI1NDY5LUIyNUQtNDhDMy05QjcwLTc0Q0M5NUMwREQwREBnbWFpbC5jb20+","referencesHeader":"PEExQkI1NDY5LUIyNUQtNDhDMy05QjcwLTc0Q0M5NUMwREQwREBnbWFpbC5jb20+"},"prevInTopic":113301,"nextInTopic":113303,"prevInTime":113301,"nextInTime":113303,"topicId":113299,"numMessagesInTopic":0,"msgSnippet":"***Consider the integers from 1 to n. How many can you select such that no three are in arithmetic progression? (The answer is not known, but even without","messageBody":"<div id=\"ygrps-yiv-939893761\">***Consider the integers from 1 to n. How many can you select such that no three are in arithmetic progression? (The answer is not known, but even without finding it one can look for upper and lower bounds.)***<br/>\n <br/>\nBUT why would anyone want or need to do this?  Seriously!  If you can&#39;t answer why YOU would want to do that, then you&#39;re not really getting how unschooling meshes with math.<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Specific Math Question","postDate":"1262558029","msgId":113301,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIzNkRCQzA3LTJCMEQtNDQ3Qi05NjZBLUM5OUFFM0I1QUVCN0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEExQkI1NDY5LUIyNUQtNDhDMy05QjcwLTc0Q0M5NUMwREQwREBnbWFpbC5jb20+","referencesHeader":"PEExQkI1NDY5LUIyNUQtNDhDMy05QjcwLTc0Q0M5NUMwREQwREBnbWFpbC5jb20+"},"prevInTopic":113299,"nextInTopic":113302,"prevInTime":113300,"nextInTime":113302,"topicId":113299,"numMessagesInTopic":0,"msgSnippet":"-=I have been asked for specifics. Here is a specific question:=- Ah. I accidentally approved this post, intending to delete it.  Apologies to the other","messageBody":"<div id=\"ygrps-yiv-1258368019\">-=I have been asked for specifics. Here is a specific question:=-<br/>\n<br/>\nAh.<br/>\nI accidentally approved this post, intending to delete it.  Apologies  <br/>\nto the other moderators and to any readers being irritated by this  <br/>\ndrawn-out off-topic thread.<br/>\n<br/>\n<br/>\nKeith Green:  The list is not about you.  It&#39;s not even about math.   <br/>\nIt&#39;s about unschooling.<br/>\n<br/>\nIf you can&#39;t or won&#39;t talk about unschooling and you refuse to answer  <br/>\ndirect questions about why you want to know what you&#39;ve asked, don&#39;t  <br/>\npost to the list.<br/>\n<br/>\nSandra Dodd, listowner<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":426059133,"authorName":"Keith Green","from":"Keith Green &lt;popper256@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Specific Math Question","postDate":"1262556497","msgId":113299,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEExQkI1NDY5LUIyNUQtNDhDMy05QjcwLTc0Q0M5NUMwREQwREBnbWFpbC5jb20+"},"prevInTopic":0,"nextInTopic":113301,"prevInTime":113298,"nextInTime":113300,"topicId":113299,"numMessagesInTopic":0,"msgSnippet":"I have been asked for specifics. Here is a specific question: Consider the integers from 1 to n. How many can you select such that no three are in arithmetic","messageBody":"<div id=\"ygrps-yiv-2077517375\">I have been asked for specifics. Here is a specific question:<br/>\n<br/>\nConsider the integers from 1 to n. How many can you select such that no three are in arithmetic progression? (The answer is not known, but even without finding it one can look for upper and lower bounds.)<br/>\n<br/>\nCan anyone offer:<br/>\n<br/>\n- an explanation of the general mathematical concepts suited to analyzing this problem<br/>\n<br/>\n- an explanation of the answer to this problem which is accessible to someone who isn&#39;t a professional mathematician<br/>\n<br/>\n- a book or other resource containing the above<br/>\n<br/>\n- a book or other resource containing the background knowledge appropriate to approach this problem oneself<br/>\n<br/>\n- something else even better<br/>\n<br/>\nI am not interested in being pointed to anything that can be found on Google. I know how to use Google. I ask here in hopes that someone here has learned a lot of math outside of school, or knows someone who has, and so would be able to give an expert answer.<br/>\n<br/>\nWhy not ask somewhere else? Because school makes something like 80% of its students hate math and avoid it for the rest of their lives. School style math material is dangerous. Related to that, the educational philosophy behind material designed for schools is mistaken and this detracts from it, often severely. These are the kinds of issues I hope unschoolers in particular may be sensitive to.<br/>\n<br/>\nI can offer some other specific problems if anyone is at a loss over this particular problem, but thinks they&#39;d be able to help with others.</div>","specialLinks":[]}],"prevTopicId":113314,"nextTopicId":113226}}