{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1123183,"authorName":"dacunefare@aol.com","from":"dacunefare@...","profile":"undermom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"UNSCHOOLING.COM ONLINE NEWS May 2003","postDate":"1053582344","msgId":70320,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyZC4yYTE0MGI4MC4yYmZkYmUwOEBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":70319,"nextInTime":70321,"topicId":70320,"numMessagesInTopic":0,"msgSnippet":"... UNSCHOOLING.COM ONLINE NEWS Mid-May 2003 ... In this Issue: Reading Roads Older Blooming Readers Benefits of Later Literacy Serious Play Web Snacks ","messageBody":"<div id=\"ygrps-yiv-717867574\">::::::::::::::::::::::::::::::::::::::::::::::::::<br/>\n<br/>\n<br/>\nUNSCHOOLING.COM ONLINE NEWS<br/>\n<br/>\nMid-May 2003<br/>\n<br/>\n<br/>\n::::::::::::::::::::::::::::::::::::::::::::::::::<br/>\n<br/>\n<br/>\nIn this Issue:<br/>\n<br/>\nReading Roads<br/>\nOlder Blooming Readers<br/>\nBenefits of Later Literacy<br/>\nSerious Play<br/>\nWeb Snacks<br/>\nUnschool Friendly Conferences<br/>\n<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nReading Roads<br/>\n<br/>\nLearning to read is like learning to ride a bicycle. Some kids are presented<br/>\nwith training wheels at an early age. Some receive formal instruction.<br/>\nSome watch older siblings. Some are given shiny new bikes for Christmas,<br/>\njust the right size, and some forage some old beat-up balloon-tired Schwinn <br/>\nfrom a neighbor&#39;s dilapidated garage. Some peddle along on the sides of <br/>\nbicycles made for adults, the only available two-wheelers, so<br/>\nlarge they can&#39;t reach their leg over the cross-bar or otherwise get to<br/>\nthe peddles. For some it takes months to get up the nerve to try. Others<br/>\njust jump on without any preparation whatsoever and ride away. Some are<br/>\nyounger, some are older; some end up loving it, and others decide they<br/>\nhave more important things to do with their time and energy.<br/>\n<br/>\nThe kids learn to read if there are lots of children&#39;s books in the house,<br/>\nadult books, or just a few old magazines. They learn to read if they are<br/>\nread aloud to from the time they can sit up, or if storytime is ignored.<br/>\nThey learn to read if they watch Sesame Street, or the X files, or if<br/>\ntelevision isn&#39;t allowed in the house. They learn to read even if they are<br/>\nobsessed with computer games that require no reading, or if all they<br/>\nseem interested in is gymnastics or dance or the succesors to Pokemon.<br/>\nThey learn to read if they have powers of concentration that would put<br/>\nadults to shame, or if they never seem to be able to sit still.<br/>\n<br/>\nDavid Albert <br/>\nfrom the new book, Homeschooling and the Voyage of Self-Discovery<br/>\nVisit him at www.skylarksings.com<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nOlder Blooming Readers<br/>\n<br/>\nIf your child shows little interest in learning to read on her own, she may<br/>\nbe an older-bloooming reader. I&#39;ll tell you not to worry, that your child will<br/>\nlearn to read in her own good time. Not worrying is not so easy, though,<br/>\nparticularly when siblings, sometimes younger siblings, or the public<br/>\nschool children across the street, are reading chapter books and your<br/>\nchild hasn&#39;t mastered a primer such as the Bob Books, and worse yet,<br/>\ndoesn&#39;t appear to have any desire to read. Try to avoid panicking, and<br/>\ndon&#39;t let your child know that you are worried.<br/>\n<br/>\nHomeschooling families can avoid the biggest disadvantage to late reading<br/>\n- feeling stupid. If your child is an older blooming reader, be happy he is<br/>\nhomeschooling and not in school being labeled learning disabled (because<br/>\nhe is not) or feeling humiliated by teachers and peers. Reassure your<br/>\nchild (if he is concerned) that he will find his own time and way of learning<br/>\nto read. Meanwhile, keep the love of reading alive. Tell him over and over<br/>\nthat you know he loves reading because he enjoys being read to. Remind<br/>\nhim that everyone is unique. Try to find an adult - someone your child<br/>\nknows and who now enjoys reading - who was also a delayed reader. It can<br/>\ngive you (and your child) some perspective.<br/>\n<br/>\nYou should also remind him that there are many other important skills to<br/>\nknow and many ways to learn besides reading. Isn&#39;t he learning all the<br/>\ntime? Many older-blooming readers are very active physically and learn<br/>\nmany difficult sports and skills. Help him make a list of all the things he<br/>\nknows how to do and subjects he has learned without the benefit of read-<br/>\ning. Remind him that everyone learns difficult skills when they are ready,<br/>\nand reading is no different.<br/>\n<br/>\nAnn Lahrson-Fisher<br/>\nfrom Fundamentals of Homeschooling: Notes on Succesful Family Living<br/>\nAvailable from Home Education Magazine<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com/catalog/index.html\">http://www.home-ed-magazine.com/catalog/index.html</a><br/>\n<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nBenefits of Later Literacy<br/>\n<br/>\nYou may wonder if late reading makes it more difficult for a child to take<br/>\nin complex materials when he does begin to read. I have found that though<br/>\nBritt read at age 4 and Maggie at age 11, by age 12 both were reading<br/>\nthe same material. Maggie has an easier time understanding what she<br/>\nreads now since she read at a later age and therefore never read any-<br/>\nthing she did not understand. It seems important that a child understand<br/>\nwhat he reads rather than just recognizing words. It makes me think of<br/>\nsomething Rosseau wrote in Emile, &quot;Books teach us to talk about things<br/>\nwe know nothing about.&quot; Many books written for young children to read to<br/>\nthemselves are filled with informational material that is not very valuable<br/>\nto them. Because of this I&#39;ve found that children might just as well wait<br/>\nuntil their understanding is such that the material they read can be <br/>\nassim-ilated and used. <br/>\n<br/>\nPenny Barker - from an article originally published in the Nov 1987 Home<br/>\nEducation Magazine, reprinted in The Homeschool Reader, second edition<br/>\nAvailable from Home Education Magazine<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com/catalog/index.html\">http://www.home-ed-magazine.com/catalog/index.html</a><br/>\n<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nSerious Play<br/>\n<br/>\nFor a healthy and active fantasy life children need time, space, and pri-<br/>\nvacy, or at least only as much companionship as they choose. Obviously<br/>\nschool, or any other large-group situation --- day care center, nursery<br/>\nschool, play group, etc. --- does not allow much of this. Perhaps worst<br/>\nof all, they are usually under the eye and control of adults who, even if<br/>\nthey will allow children a fantasy life, feel they have to watch it, under-<br/>\nstand what it means, judge it, make use of it. It was for just this reason<br/>\nthat a well-meaning and quite highly praised book, written about ten years<br/>\nago, called Fantasy and Feeling in Childhood, seemed and still seems to me <br/>\ndeeply mistaken. The gist of it (and there may well be many books like it)<br/>\nwas that if we, i.e., people who work in schools, paid enough attention to<br/>\nthe fantasy lives of children, we could learn to uderstand them and bend<br/>\nthem to our own purposes.<br/>\n<br/>\nThis would be a great mistake and a great wrong. Instead, we should be<br/>\ncontent to watch and enjoy as much of children&#39;s fantasy lives as they<br/>\nwill let us see, and to take part in them, if the children ask us to and if we<br/>\ncan do so happily and unselfconsciously. Otherwise, we should leave them<br/>\nalone. Children&#39;s fantasy is useful and important to them for many rea-<br/>\nsons, but above all because it is theirs, the one part of their lives which is<br/>\nwholly under their control. We must resist the temptation to make it<br/>\nours.<br/>\n<br/>\nWe must also resist the equally great temptation to think that this part<br/>\nof children&#39;s lives is less important than the parts where they are doing<br/>\nsomething &quot;serious&quot; --- reading, or writing, or doing schoolwork, or some-<br/>\nthing that we want them to do --- or to think that we can only allow them<br/>\ntime for fantasy after all the important work is done, as we might give<br/>\nthem a piece of candy after a meal. For children, play and fantasy are<br/>\none of the main courses of the meal. Children should be able to do them,<br/>\nnot just in what little tag ends of time remain after all the &quot;important&quot;<br/>\nwork is done, but when they are most full of energy and enthusiasm. We<br/>\ntalk these days of &quot;quality time.&quot; Children need quality time for their<br/>\nfantasy and play as much as for their reading or math. They need to play<br/>\nwell as much as they need to read well. Indeed, we would probably find if<br/>\nwe looked into it that children who are not good at playing, dreaming, fan-<br/>\ntasizing, are usually not much good at reading either.<br/>\n<br/>\nJohn Holt, writing in Teach Your Own<br/>\nJust released in a new edition from Perseus Books<br/>\n(See ad below for a special offer from F.U.N. books!)<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nNonfiction DVD rentals online<br/>\n<br/>\nHomeIsCool DVD rental store gives access to thousands of non-fiction<br/>\nDVD titles. Standard Deviants titles, PBS documentaries, Discovery<br/>\nChannel series and specials. Titles to help you learn algebra, play the<br/>\nviolin, swing dance. Meet dinosaurs, presidents, and pharoahs. Membership <br/>\nplans start at $19.95 a month.<br/>\n<br/>\n <a rel=\"nofollow\" target=\"_blank\" href=\"http://mentura.com/dvdrentals/HomeIsCool.html\">http://mentura.com/dvdrentals/HomeIsCool.html</a><br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nWeb Snacks<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.ancientscripts.com/\">http://www.ancientscripts.com/</a><br/>\nAncient Scripts - hundreds of alphabets<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.tradgames.org.uk/\">http://www.tradgames.org.uk/</a><br/>\nGuide to Traditional Games<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.paperdolls.com/pages/pdgallry.htm\">http://www.paperdolls.com/pages/pdgallry.htm</a><br/>\nLiterary paper dolls<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.nps.gov/learn/grgozone/grgozone.htm\">http://www.nps.gov/learn/grgozone/grgozone.htm</a><br/>\nActivities for kids from national park service sites<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nUnschool Friendly Conferences<br/>\n<br/>\nFeeling like a fish out of water after attending a large curriculum oriented <br/>\nhomeschool convention?  The following conferences have unschooling presenters <br/>\nand participants, including many regular posters at the unschooling.com <br/>\nwebsite and email discussion list. <br/>\n<br/>\n <br/>\nThe Unschoolers Network 26th Anniversary Conference<br/>\nKeynote Speaker - Linda Dobson<br/>\nJune 28 2003<br/>\nBrookdale Community College Linwood, NJ<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.org/unnet/conference.htm\">http://www.unschooling.org/unnet/conference.htm</a> <br/>\n<br/>\n<br/>\nFree to Learn!<br/>\nKeynote speakers - Patrick Farenga, Dr. Thomas Armstrong<br/>\nAugust 15-17, 2003<br/>\nRadisson Hotel Sacramento, CA<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://conference.hsc.org/\">http://conference.hsc.org/</a><br/>\n<br/>\nLive and Learn Unschooling Conference<br/>\nKeynote speaker - Sandra Dodd<br/>\nAugust 22-24, 2003<br/>\nColumbia, SC<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.schoolsoutsupport.org/2003conference.html\">http://www.schoolsoutsupport.org/2003conference.html</a><br/>\n<br/>\nIf you have information on other unschooling friendly conferences please <br/>\nemail the editor at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:newsletter@...\">newsletter@...</a> <br/>\n<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\n<br/>\nUNSCHOOLING.COM ONLINE NEWS UNCLASSIFIED ADVERTISING<br/>\n<br/>\n<br/>\nFor information on purchasing advertising space in this newsletter,<br/>\nplease contact the editor at:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:newsletter@...\">newsletter@...</a><br/>\n<br/>\n________________________<br/>\n<br/>\nF.U.N. Books Special<br/>\n<br/>\n<br/>\nWhen we acquired the John Holt Bookstore, we never thought we would<br/>\nhave the chance to carry a new book by John Holt (who died in 1985).<br/>\nOkay, it&#39;s not a &quot;completely&quot; new book, but it is newly revised and has lots<br/>\nof new information. Long out of print (with used copies often going for<br/>\nmuch more than the original purchase price!), the classic &quot;Teach Your<br/>\nOwn&quot; has now been updated and re-released.<br/>\n<br/>\nThe new version is entitled &quot;Teach Your Own - The John Holt Book of<br/>\nHomeschooling.&quot; Appropriately enough, it has been updated and edited by<br/>\nPatrick Farenga, the president of Holt Associates. Pat has combined<br/>\npersonal stories and the resources from his own book, &quot;The Beginners<br/>\nGuide to Homeschooling,&quot; with this classic work by the father of the<br/>\nmodern homeschooling movement. The original was published in 1981 and<br/>\nwas the source of inspiration for many parents considering homeschool.<br/>\nHolt&#39;s words are every bit as inspiring today and show a timeless common<br/>\nsense that will have you nodding your head in agreement as you read<br/>\nalong.<br/>\n<br/>\nThis book will help you avoid the trap of turning your home into a<br/>\nminiature school. Instead, you will be encouraged to take advantage of the <br/>\nflexibility homeschooling offers you to provide an educational<br/>\nexperience that is nearly impossible to duplicate in schools. If you are<br/>\nalready homeschooling but have ever had moments of self-doubt, or<br/>\nwondered how to face relatives who question your decision, then this<br/>\nbook will restore your confidence and remind you of the many benefits of<br/>\nthe path you have chosen. If you are just getting started or only<br/>\nconsidering homeschooling, then this book will help open your eyes about<br/>\nthe many possibilities and will supply you with a wealth of information and<br/>\nresources to help you on your way.<br/>\n<br/>\nLegal advice and suggestions for countering common objections to<br/>\nhomeschooling are included. An extensive bibliography and several<br/>\nappendices will provide you with information on other books,<br/>\ncorrespondence programs, curriculum suppliers, helpful private schools,<br/>\nhomeschooling organizations, learning materials, and opportunities and<br/>\nactivities. This is a &quot;must have&quot; book for every homeschooler!<br/>\n<br/>\nList price is $18.00, but for a limited time is available from FUN Books<br/>\nfor $12.50.  Go to <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.fun-books.com/specials.htm\">http://www.fun-books.com/specials.htm</a><br/>\n<br/>\n________________________<br/>\n<br/>\nHOME EDUCATION MAGAZINE<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com\">http://www.home-ed-magazine.com</a><br/>\n<br/>\n<br/>\nIn the May/June issue of Home Education Magazine, you&#39;ll enjoy<br/>\narticles on playing with Shakespeare, unchoring, detective challenges,<br/>\nreal desks for real kids, and more! Column topics include: David Albert<br/>\nreveals what he learned in school, Becky Rupp measures up, Ann Lahrson<br/>\nFishher with News and Commentary, Linda Dobson talks to herself, and<br/>\nSandra Dodd has a typical day. Other columnists include Larry and Susan<br/>\nKaseman, Laura Weldon, Ann Zeise, Elizabeth McCullough and Carol<br/>\nNarigon. HEM also offers a popular essay by publisher Helen Hegener,<br/>\nclassified ads, letters and discussion, pen pals and networking, and more.<br/>\n<br/>\nSubscriptions to Home Education Magazine are regularly $32.00 for one<br/>\nyear/6 issues; single issue $6.50. To subscribe, visit our website at <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://home-ed-magazine.com\">http://home-ed-magazine.com</a> or send a check to Home Education <br/>\nMagazine, PO Box 1083, Tonasket WA 98855; for orders: toll-free <br/>\n1-800-236-3278; email <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:orders@...\">orders@...</a>. MC/Visa accepted.<br/>\n<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nThe Last Word<br/>\n<br/>\nI wish I had a dollar for every ... defender of the schools who talks about<br/>\nReal Life; it&#39;s almost never the fascinating courses, or the challenging<br/>\nteachers - their only concern [is] that home-schooled children will miss<br/>\nthe &quot;social life&quot; of schools. And when I point out that for the most part<br/>\nthe social life of schools is mean-spirited, selfish, snobbish, conformist,<br/>\nruthless, cold-hearted and often downright cruel and violent, nobody<br/>\ndisagrees. &quot;That&#39;s Real Life.&#39;&quot; they say, ... &quot;[y]ou have to prepare children<br/>\nfor the real world. How else are they ever going to get along with<br/>\nothers?&quot; Notice that they don&#39;t mean others who treat each other with<br/>\nkindness and dignity; they can&#39;t seem to conceive of that ...<br/>\n<br/>\n<br/>\nNever before published 1981 interview with John Holt <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.rationalreview.com/archive/stevetrinward/stevetrinward042103.html\">http://www.rationalreview.com/archive/stevetrinward/stevetrinward042103.html</a><br/>\n<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\n<br/>\nThanks for reading the Unschooling.com newsletter! Feel free to<br/>\nforward this newsletter to all your friends, your local support<br/>\ngroup, and your mother-in-law!<br/>\n<br/>\n<br/>\nTo subscribe, visit our web site at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\nor send an email to <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:majordomo@...\">majordomo@...</a> with<br/>\nthe words subscribe unschooling-newsletter followed by your<br/>\nemail address in the body of the email.<br/>\n( subscribe unschooling-newsletter <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:yourname@...\">yourname@...</a>).<br/>\n<br/>\n<br/>\nTo unsubscribe, send an email to <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:majordomo@...\">majordomo@...</a> with<br/>\nthe words unsubscribe unschooling-newsletter followed by your<br/>\nemail address in the body of the email.<br/>\n<br/>\n(unsubscribe unschooling-newsletter <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:yourname@...\">yourname@...</a>)<br/>\n<br/>\n<br/>\nTo change the address at which you receive the newsletter, unsubscribe your <br/>\nold address and then subscribe with your new one.<br/>\n<br/>\n<br/>\nSee you in June!<br/>\n<br/>\n<br/>\nDeborah A Cunefare, Newsletter Editor<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:newsletter@...\">newsletter@...</a><br/>\n<br/>\n<br/>\nUnschooling.com is a service of Home Education Magazine</div>","specialLinks":[]}],"prevTopicId":70308,"nextTopicId":70311}}