{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":17,"messages":[{"userId":458624268,"authorName":"Dola Dasgupta","from":"Dola Dasgupta &lt;doladg@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Single Parent & the sadness of missing Conferences","postDate":"1344770634","msgId":68564,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBRTA1UktPaW5rUVpweExPeit1cmM5NDFNNmRXSlpqUm1fUD1fd3Rnbl9wT1g9dUpqd0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDQzREM2OUM1LTJDODAtNDYwQS05ODc0LUYyNzJCMkEyOEQ4M0B2ZXJpem9uLm5ldD4=","referencesHeader":"PDJjNzg0LjcyZTgzZGI1LjNkNTVlYzljQGFvbC5jb20+CTw0M0RDNjlDNS0yQzgwLTQ2MEEtOTg3NC1GMjcyQjJBMjhEODNAdmVyaXpvbi5uZXQ+"},"prevInTopic":68560,"nextInTopic":0,"prevInTime":68563,"nextInTime":68565,"topicId":68517,"numMessagesInTopic":0,"msgSnippet":"I am a single mom from New Delhi, India, who is unschooling two children since four years now. I am aware that things are a lot different in the USA...And in","messageBody":"<div id=\"ygrps-yiv-960239997\">I am a single mom from New Delhi, India, who is unschooling two children<br/>\nsince four years now. I am aware that things are a lot different in the<br/>\nUSA...And in your country one needs to do a lot of housework and work<br/>\noutside alone all by oneslef. In India we have house help..But I still felt<br/>\nlike sharing.<br/>\n<br/>\nAfter my marriage felt apart. I moved in with my parents. They have been<br/>\nsupportive. I worked towards making it work joyfully for myself, the kids<br/>\nand their grandparents. Since my ex-husband and I were going through a very<br/>\nrough patch during the separation, my parents pitched in with all the<br/>\nsupport for which I am very grateful. My children and I worked to integrate<br/>\nwith my parents and they also cooperated with us.<br/>\n<br/>\nI am not saying it was all without its own share of pangs.My parents and I<br/>\nhad differences which now came to broad day light. But I am fortunate and<br/>\nin gratitude that we worked it out. But I stayed committed to make it work<br/>\nfor us and my parents. As I accepted that I needed their help and support<br/>\nand they were happy to have the grandchildren and their daughter with them.<br/>\nThey are both old. And it has been a healing journey for me with my parents<br/>\nand also in many ways made me a better and patient human being that I was<br/>\nnot in my early years.<br/>\n<br/>\nWhat worked for me was to live with my parents. I had a small income from<br/>\nan apartment I had rented out. And my parents&#39; pension was there. We pooled<br/>\nin our financial resources and formed a joint kitty of money. I did some<br/>\nsmall work from home now and then. Then over some time my ex-husband<br/>\nstarted to support the children financially. But I was not relying on it<br/>\ntill it came on its own. I am not sure if that is a possibility for you?<br/>\n<br/>\nIn India where I live a lot of single moms and kids get supported like this<br/>\nby the extended family.<br/>\n<br/>\nI must add this even though it is perhaps not linked to the specific<br/>\nquestions in the mail...and am not sure if it is of any help to the<br/>\noriginal post..but here goes anyway...<br/>\n<br/>\nDuring all this my ex-husband was in another city but visited us regularly<br/>\nand slowly started to reconnect with me and the children. And we with him.<br/>\nLast year he moved back to our city and started being part of our lives<br/>\nmore than before. Today my relationship with my ex-husband is not difficult<br/>\nor tension riddled. There is a deeper sense of love and understanding for<br/>\neach other and together for the kids. And it is crazy but living like this<br/>\nwith my parents has made me more optimistic about my relationship with my<br/>\nex-husband...And we are now two different people with more love and mutual<br/>\nrespect than ever before...and we are reconnecting in new ways.<br/>\n<br/>\nDola<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Fri, Aug 10, 2012 at 5:58 PM, Joyce Fetteroll &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jfetteroll@...\">jfetteroll@...</a>&gt;wrote:<br/>\n<br/>\n&gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; On Aug 10, 2012, at 12:48 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AngelOvFaith@...\">AngelOvFaith@...</a> wrote:<br/>\n&gt;<br/>\n&gt; &gt; just trying to see if any others have tried<br/>\n&gt; &gt; navigating it alone and what the experiences are.<br/>\n&gt;<br/>\n&gt; Yes, there are some single mothers unschooling. But just being single and<br/>\n&gt; wanting to unschool isn&#39;t enough. Those who can do it have ways or have<br/>\n&gt; found ways to do what they need to continue unschooling. Those who<br/>\n&gt; couldn&#39;t, have done something else.<br/>\n&gt;<br/>\n&gt; The desire to unschool doesn&#39;t grant someone a magic wand to make<br/>\n&gt; obstacles disappear. Those who unschool have found solutions to the<br/>\n&gt; obstacles. Each story will be unique. They may be able to live with a<br/>\n&gt; parent or friend. They may have Social Security or other benefits. They may<br/>\n&gt; have a job that pays well enough. They may have a support system to care<br/>\n&gt; for their children when they&#39;re working.<br/>\n&gt;<br/>\n&gt; And, obviously, single moms have less time to be online so they aren&#39;t<br/>\n&gt; here talking about it much.<br/>\n&gt;<br/>\n&gt; Perhaps there&#39;s a job you can do with your daughter, such as running a<br/>\n&gt; small day care. Being a live-in nanny.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &gt; im just really sad to be missing conferences and wondered<br/>\n&gt; &gt; how anyone else deals with the disappointment of that<br/>\n&gt;<br/>\n&gt; It sounds like conferences may be some kind of escape from real world<br/>\n&gt; problems for you. But they&#39;re a lot of money for something that doesn&#39;t fix<br/>\n&gt; problems in your real world. They&#39;re very expensive bandaids over festering<br/>\n&gt; wounds. That doesn&#39;t seem a useful direction for your energy at the moment.<br/>\n&gt;<br/>\n&gt; It sounds like you need a plan. You&#39;re spending so much time unschooling<br/>\n&gt; you&#39;re not making time to find ways to make unschooling work. And I suspect<br/>\n&gt; your lack of confidence in being able to do it, is drawing attacks from<br/>\n&gt; others who sense your doubt which is making it more difficult. Can you<br/>\n&gt; avoid these people? Can you project more confidence so they don&#39;t sense<br/>\n&gt; your weakness?<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &gt; While I&#39;m sure we can have a life of learning while working and going to<br/>\n&gt; &gt; school, i dont feel it would be a happy one and fear us growing apart.<br/>\n&gt;<br/>\n&gt; Unschooling shouldn&#39;t be a goal. It&#39;s a vehicle that&#39;s well suited for<br/>\n&gt; getting to particular goals. Some of those goals are joyful living, whole<br/>\n&gt; children, learning through interests ...<br/>\n&gt;<br/>\n&gt; Unschooling isn&#39;t the only vehicle that can get to those goals. And those<br/>\n&gt; aren&#39;t the only goals.<br/>\n&gt;<br/>\n&gt; If using a vehicle is causing damage that you can&#39;t figure out how to<br/>\n&gt; prevent, it&#39;s better to switch vehicles. If getting to a goal is causing<br/>\n&gt; damage that you can&#39;t figure out how to prevent, it&#39;s better to switch<br/>\n&gt; goals. At least until you can figure out how to make getting there work.<br/>\n&gt;<br/>\n&gt; Unschooling is a vehicle that needs a great deal of support. It&#39;s big<br/>\n&gt; advantage is it has few side effects.<br/>\n&gt;<br/>\n&gt; Without the support, it may be easier to put the energy into easing the<br/>\n&gt; side effects of some other vehicle. It may be easier to reconnect after<br/>\n&gt; school and make up for some of the bad effects than to unschool in a box<br/>\n&gt; beneath a freeway overpass. I think Sandra gave you a link to her School<br/>\n&gt; Choice page:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/schoolchoice\">http://sandradodd.com/schoolchoice</a><br/>\n&gt;<br/>\n&gt; The biggest damage from school is because kids don&#39;t have a choice. And<br/>\n&gt; kids don&#39;t have a choice often because their parents believe it&#39;s the only<br/>\n&gt; route that will keep them from cashier at Wal-mart being their only career<br/>\n&gt; option. If you don&#39;t believe that, then there&#39;s a big chunk of school<br/>\n&gt; damage you won&#39;t be inflicting.<br/>\n&gt;<br/>\n&gt; Choosing school doesn&#39;t need to be a forever choice. It might be for 6<br/>\n&gt; months. Or a year.<br/>\n&gt;<br/>\n&gt; Maybe with a job you&#39;ll be able to shop around to schools with your<br/>\n&gt; daughter to find one that she wants to try. If she knows she can switch,<br/>\n&gt; she&#39;ll feel less trapped. If you keep her in the loop about how you&#39;re<br/>\n&gt; working towards unschooling, or working towards something better, she&#39;ll<br/>\n&gt; fell less powerless.<br/>\n&gt;<br/>\n&gt; What are your goals? If you can&#39;t have the ideal, find &quot;better.&quot; What&#39;s<br/>\n&gt; the minimum your daughter needs to be happy? Begin building from there.<br/>\n&gt;<br/>\n&gt; Joyce<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Single Parent & the sadness of missing Conferences","postDate":"1344747963","msgId":68560,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENCMDhENTc2LTQ2RUUtNEIxMC1BQjA1LUZFQjU1NTdBRjFGMEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGswNjk4ais1bDdpQGVHcm91cHMuY29tPg==","referencesHeader":"PGswNjk4ais1bDdpQGVHcm91cHMuY29tPg=="},"prevInTopic":68549,"nextInTopic":68564,"prevInTime":68559,"nextInTime":68561,"topicId":68517,"numMessagesInTopic":0,"msgSnippet":"Thanks for fixing that, Dina. I usually remember NOT to put a link right at the end of a sentence (or to put a blank space after it if I do). And to anyone who","messageBody":"<div id=\"ygrps-yiv-1630346603\">Thanks for fixing that, Dina.  <br/>\n<br/>\nI usually remember NOT to put a link right at the end of a sentence (or to put a blank space after it if I do).<br/>\n<br/>\nAnd to anyone who clicks a link and finds it not working, look at the end of it and see if something doesn&#39;t look as links should look.  Sometimes you can tell easily even if you&#39;re not an html wonk.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":311341422,"authorName":"dapsign","from":"&quot;dapsign&quot; &lt;dapsign@...&gt;","profile":"dapsign","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Single Parent & the sadness of missing Conferences","postDate":"1344710739","msgId":68549,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGswNjk4ais1bDdpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDRENTcwOTE1LTMzNkItNDc3RS1CQjNELTM1NUI4MkE2Mjk4MEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":68548,"nextInTopic":68560,"prevInTime":68548,"nextInTime":68550,"topicId":68517,"numMessagesInTopic":0,"msgSnippet":"... The above link to typical days didn t work; period at end made it wonky. http://sandradodd.com/typical It s one of my favorite pages on the site and I","messageBody":"<div id=\"ygrps-yiv-1784656780\"><blockquote><span title=\"ireply\">&gt; These are good, but were collected before blogs, and before it was easy to put photos on pages.<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/typical.\">http://sandradodd.com/typical.</a><br/>\n&gt; They still have lots of good ideas, though.<br/>\n&gt; <br/>\n <br/>\n </span></blockquote>The above link to typical days didn&#39;t work; period at end made it wonky.  <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/typical\">http://sandradodd.com/typical</a><br/>\n<br/>\nIt&#39;s one of my favorite pages on the site and I think it&#39;s incredibly helpful.  <br/>\n<br/>\nDina</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Single Parent & the sadness of missing Conferences","postDate":"1344707819","msgId":68548,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRENTcwOTE1LTMzNkItNDc3RS1CQjNELTM1NUI4MkE2Mjk4MEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGswNjVoNStxanJ1QGVHcm91cHMuY29tPg==","referencesHeader":"PGswNjVoNStxanJ1QGVHcm91cHMuY29tPg=="},"prevInTopic":68547,"nextInTopic":68549,"prevInTime":68547,"nextInTime":68549,"topicId":68517,"numMessagesInTopic":0,"msgSnippet":"-=-If you re not going to get any child support, and it stresses you out to go, why not drop it? Maybe he would be willing to make a deal to terminate his","messageBody":"<div id=\"ygrps-yiv-1716993706\">-=-If you&#39;re not going to get any child support, and it stresses you out to go, why not drop it? Maybe he would be willing to make a deal to terminate his parental rights? That doesn&#39;t mean your daughter would never get to see him again, just that he couldn&#39;t take you to court and possibly lose your ability to unschool. -=-<br/>\n<br/>\nThat&#39;s a good point, that if he&#39;s not going to be helpful, at least you could set him outside the realm of being disruptive, to some extent.<br/>\n<br/>\nYears down the line he could remarry someone who hates homeschooling and who would, as a stepmother, have rights over your child during visits.  <br/>\n<br/>\nBut there&#39;s also the gamble that he will do better, make money, and you (or the state on your behalf, maybe) could get money for your daughter&#39;s support from him.<br/>\n<br/>\n-=-The one conference we made it to, I regretted spending the money. We could have had a lot more fun with that money, or improved our lives in other ways. Making some good, local friends, unschoolers or not, is way more valuable. -=-<br/>\n<br/>\nSome conferences are better than others.  Some people make friends there, some people just get irritated.  I&#39;ve been to conferences that didn&#39;t improve my life, and some that did.   But our family wouldn&#39;t have been able to go to conferences, from New Mexico, just to go.  I went to lots, and sometimes took one of my kids with me.  Kirby has paid to go to a couple on his own, because of friends he made at conferences.  We did send Holly and Marty across the country to one of the last Live and Learn conferences, and that was expensive.  <br/>\n<br/>\nIt can be less expensive NOT to make distant friends. :-)<br/>\n<br/>\nOn the other hand, I&#39;ve gotten several nice notes after this recent HSC conference, and a couple of people talked to me there, saying that they knew about unschooling but didn&#39;t get it, or had misundertandings, and when they heard me speak their view of learning and of their children and families changed. <br/>\n<br/>\nSo I neither want to discourage people from thinkinga bout conferences, nor to suggest they&#39;re vital.  Some and some.<br/>\n<br/>\nBecause of Joyce&#39;s site, mine, this discussion and a few other places, they&#39;re not the only way to get feedback or information.  And for people who are visual and want to see pictures of families, go to blogs and read accounts of days.  These are good, but were collected before blogs, and before it was easy to put photos on pages.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/typical.\">http://sandradodd.com/typical.</a><br/>\nThey still have lots of good ideas, though.<br/>\n<br/>\nSandra<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":211875477,"authorName":"Amy","from":"&quot;Amy&quot; &lt;amylizkid1@...&gt;","profile":"amylizkid1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Single Parent & the sadness of missing Conferences","postDate":"1344706917","msgId":68547,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGswNjVoNStxanJ1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGswMXJ2NytjaWdqQGVHcm91cHMuY29tPg=="},"prevInTopic":68528,"nextInTopic":68548,"prevInTime":68546,"nextInTime":68548,"topicId":68517,"numMessagesInTopic":0,"msgSnippet":"I m a single mom with a 9 year old daughter.  It s not easy, but definitely do-able.  If you need extra money, there are unconventional jobs.  Early in our","messageBody":"<div id=\"ygrps-yiv-1395853847\">I&#39;m a single mom with a 9 year old daughter.  It&#39;s not easy, but definitely do-able.  If you need extra money, there are unconventional jobs.  Early in our journey, I worked at a country market one day a week.  I made about $200 a month, and I had help from foodstamps and HUD.  We couldn&#39;t do much that cost money, but we were able to spend lots of time together.  That was the most important thing then.  Now I work 3 days a week at an animal rehab center, still don&#39;t have a lot of money, but a good balance of being able to spend time together and do a few things, have a few things.  I try to pick jobs where I&#39;m allowed to bring my daughter with me, if needed.  I would rather not have a job at all, I don&#39;t like that time apart, but it&#39;s the best I can do right now.  It&#39;s not ideal, but it&#39;s what we&#39;ve got, so I make it the best I can.<br/>\nI re-evaluate every once in awhile what&#39;s important to me, and what&#39;s important to Emma.  So far, both of us like spending time together the most.  When she wants/needs to be around friends, I make that happen.  <br/>\n<br/>\nIf you&#39;re not going to get any child support, and it stresses you out to go, why not drop it?  Maybe he would be willing to make a deal to terminate his parental rights?  That doesn&#39;t mean your daughter would never get to see him again, just that he couldn&#39;t take you to court and possibly lose your ability to unschool.  <br/>\n<br/>\nHaving money isn&#39;t as important as removing stress.  Realize what you can do and do it joyfully.  Emma won&#39;t ever have all the things I want to give her, but she&#39;ll have me, 100% for her, as long as I&#39;m around.<br/>\n<br/>\nThe one conference we made it to, I regretted spending the money.  We could have had a lot more fun with that money, or improved our lives in other ways.  Making some good, local friends, unschoolers or not, is way more valuable.  <br/>\n<br/>\nAlso, I wouldn&#39;t hang out with anyone who dissed my way of life.  They cause too much mental stress. <br/>\n<br/>\nI didn&#39;t used to be positive and joyful, it took work -- every moment until it becomes natural, and then sometimes you need to work at it more.   <br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;angelovfaith&quot; &lt;AngelOvFaith@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; I know there may be some pretty strong opinions in either direction on this topic, and beleive me i have struggled with every one of my own. <br/>\n&gt; <br/>\n&gt; I dont want to give up, i dont want to stop unschooling and eventually have to give in and send my child back to school. yet little by little i am feeling like a failure in *some* areas and while i do read the posts here every day, i havnt always been able to contribute my thoughts as i would like, wondering if i have a right to chime in as im battling my confidence against some insecurities as a joyful parent.<br/>\n&gt; <br/>\n&gt; i did tried to salvage my marriage of ten years with 4 separations over which my ex husband cheated on me repeatedly, emotionally, mentally, economically and finally, physically abused m,e as well as harming himself, plus many inappropriate things said and done around our 8 yr daughter over the years. i feel lucky to have ended it when i did rather than the possibilities of her being harmed further.(he had not sexually abused her or hit her but the forms of other abuse were not something i wanted her to grow up with and hoped each time he returned home that he had solved some issues or grown up, but he would act the part for a bit then back to the same.) he also had children with other women while he had abandoned us, and i took him back after his pleas of change, family pressure and religious guilt that i must forgive and had taken vows.<br/>\n&gt; <br/>\n&gt; we did marriage counseling, did church classes, and many other support groups including family and friends. but i couldnt forgive. the line was crossed so many times, and i feel i saved my daughter and myself after living walking on eggshells around him. filing for divorce HAD to happen or we could be dead or i wouldve lost my child trying to defend myself. so i ask...is unschooling truly that UNrecommended for single parents? <br/>\n&gt; <br/>\n&gt; if i had to send my daughter back to a school after the divorce, she wouldve been an emotional wreck. the questions were already pouring in from other social groups. instead we got through it being strong together and attending support groups for victims of domestic violence where friends were made on both parts and my daughter has enjoyed being a caregiver towards younger children in places where she&#39;s regarded as the little helper. i see her gain a calmness from holding babies or helping other little ones. we discuss each of our groups together and are always told how lucky we are to have one another. <br/>\n&gt; <br/>\n&gt; yet now a year later after the divorce, we are really experiencing the fallout and the guilt pierces my heart with every question from people outside of those support groups.<br/>\n&gt; <br/>\n&gt; as far as security and stability, we have had to move and downsize. we are living out of many unpacked boxes and suitcases at times because of what we can no longer afford on one income and we stay at friends and loved ones places alot to have support and feel a sense of play and ease, so are not home enough to be unpacking. we made a few bins of our favorite things, books etc, for everyday carrying around and viewing pleasure and touching and playing with.<br/>\n&gt; <br/>\n&gt; as far as finacially, we could not afford to go to any of the unschooling conferences this year of which we made dear friends. ive had to take her out of her dance classes and do the free activites of the city, which arent bad but it was the first year with no dance recital which i was not used to and may be still part of my deschooling.<br/>\n&gt; <br/>\n&gt; as far as our own joy and peace, we have had to enter the Address Confidentiality Program since we are victims of domestic violence and have a 3 year stay away order from my ex. i have court every month with him for child support of which we still get none somehow and this always stresses me out to see or deal with his excuses and unaccountibility.<br/>\n&gt; <br/>\n&gt; i have no idea what the future holds and while the possibilities are endless and i could look at the cup half full instead of half empty, theres still no money to do what we really want.  <br/>\n&gt; <br/>\n&gt; as far as time spent together and money, when ive taken on small odd jobs ive lost much of our time together, even doing ebay or online things, and feel sick over it and would come home crying. we have worked on doing ebay together which is nice. i also was dating for a short time an old friend who was a single father with a young child thinking we had things in common and both wanted a family again, yet he was totally opposed to unschooling or homeschooling of any kind and it ended quite bitterly as i stuck up for my child.<br/>\n&gt; <br/>\n&gt; i beleive in finding us both joy in meeting new people and peaceful parents, and have found some who are in agreement with our lifestyle as far as emotionally for us. <br/>\n&gt; <br/>\n&gt; to not unschool seems unimaginable for me or my daughter now. im back and forth from guilt and confidence, joy of freedom and being stuck in a rut. we yearn to be at the conferences or visit friends.<br/>\n&gt; <br/>\n&gt; ive also met new people who say school and the questions and even bullying is a rite of passage and i should send her back because even if it waits til college it will still emerge in some form and she will have to experience it. ive had family members and neighbors tell me &quot;she looks sooo lonely!&quot; and i really resent it. we do things together, talking or something all the time. then im like, am i missing something? but anyone who has met her, knows she has a shy face like that. i know encouragement is something i can only do for my daughter and myself, and less than a year ago i posted my concerns over how things would affect us...so here we are. <br/>\n&gt; <br/>\n&gt; im just really sad to be missing conferences and wondered how anyone else deals with the disappointment of that, since we had planned on doing every one this past year, and felt that was the thing that really changed our life and made us truly set in our path when we began unschooling. <br/>\n&gt; <br/>\n&gt; thank you in advance.<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":342782030,"authorName":"K Pennell","from":"K Pennell &lt;mrsringsabre@...&gt;","profile":"mrsringsabre","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Single Parent & the sadness of missing Conferences","postDate":"1344642936","msgId":68528,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNDQ2NDI5MzYuNDQwODQuWWFob29NYWlsQ2xhc3NpY0B3ZWIxMjE3MDYubWFpbC5uZTEueWFob28uY29tPg==","inReplyToHeader":"PENBT09UYVhQLVowZm9PWWVOYUhaWW44PTNyb3F2QmEyamZOTjhnWm5GTmZ3SENjVnRGUUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":68527,"nextInTopic":68547,"prevInTime":68527,"nextInTime":68529,"topicId":68517,"numMessagesInTopic":0,"msgSnippet":"I had really wanted to go to an Unschooling conference this spring. We didn t have the money, and I was very disappointed. My younger son was, too, though","messageBody":"<div id=\"ygrps-yiv-430567950\">I had really wanted to go to an Unschooling conference this spring. We didn&#39;t have the money, and I was very disappointed. My younger son was, too, though mostly because he wanted to stay in a hotel. <br/>\nWe decided, with some unschooling friends, to do our own thing. We had our First Annual Camping Trip. It was great and a lot more comfortable being with friends we already had. Then one of our friends arranged our Unschool Day Camp at her house. For the two activities, and a week and a half&#39;s worth of fun, it was about $50 total for our family. Our son is already talking about &quot;next year&#39;s camping trip&quot;. So I didn&#39;t get to attend some great sounding workshops and meet new people, but we had a great time with old friends and we&#39;ve established a tradition, since the kids all want to do it again. Some new friends want to join us next time, too. In retrospect, I&#39;m kind of glad we didn&#39;t get to go to the conference. It was that disappointment that led to doing something else, which turned out to be perfect for our family.  <br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Fri, 8/10/12, Pam Sorooshian &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pamsoroosh@...\">pamsoroosh@...</a>&gt; wrote:<br/>\n<br/>\nFrom: Pam Sorooshian &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pamsoroosh@...\">pamsoroosh@...</a>&gt;<br/>\nSubject: Re: [AlwaysLearning] Single Parent & the sadness of missing Conferences<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nDate: Friday, August 10, 2012, 12:10 PM<br/>\n<br/>\nOn Fri, Aug 10, 2012 at 5:28 AM, Joyce Fetteroll &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jfetteroll@...\">jfetteroll@...</a>&gt;wrote:<br/>\n<br/>\n&gt; &gt; im just really sad to be missing conferences and wondered<br/>\n&gt; &gt; how anyone else deals with the disappointment of that<br/>\n&gt;<br/>\n<br/>\nOther kinds of get-togethers can be wonderful. They can be better. For<br/>\nexample, an unschooling speaker can be invited to someone&#39;s house. Sandra<br/>\nand I went to someone&#39;s house in Bakersfield, California, and spoke to<br/>\nabout 25 or 30 people. They brought potluck dishes. It was really nice -<br/>\njust in someone&#39;s living room. Lots of good discussion after we talked.<br/>\nThat could be even more encouraging and helpful than a conference for some<br/>\npeople - more personal.<br/>\n<br/>\nSometimes I give &quot;unschooling talks&quot; at our weekly park days - we plan them<br/>\nan hour before the park day normally gets started. People come who don&#39;t<br/>\nusually come to the park days. Again, these could be more useful than<br/>\nconferences - they are followed by hours of hanging out together with a LOT<br/>\nof time for in-depth discussion.<br/>\n<br/>\nIn general, the way to get over a disappointment of not being able to<br/>\nafford something is to put your attention on what you CAN afford. When<br/>\nyou&#39;re focused on what you are getting/doing, you&#39;re not thinking about<br/>\nwhat you&#39;re missing. It isn&#39;t complicated. Even if you can&#39;t afford the<br/>\nentire conference experience, think of some part of what you love about<br/>\nconferences and find another way to get that.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n------------------------------------<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Single Parent & the sadness of missing Conferences","postDate":"1344628653","msgId":68527,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGswM3AzZCtrNHIyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGswMXJ2NytjaWdqQGVHcm91cHMuY29tPg=="},"prevInTopic":68526,"nextInTopic":68528,"prevInTime":68526,"nextInTime":68528,"topicId":68517,"numMessagesInTopic":0,"msgSnippet":"... It might help to step back from the idea of unschooling as a lifestyle - if for no other reason than the idea is tied to a lifestyle which you aren t","messageBody":"<div id=\"ygrps-yiv-1119504051\"><blockquote><span title=\"ireply\">&gt; to not unschool seems unimaginable for me or my daughter now<br/>\n<br/>\n </span></blockquote>It might help to step back from the idea of &quot;unschooling&quot; as a lifestyle - if for no other reason than the idea is tied to a lifestyle which you aren&#39;t going to get back... and that may be part of the problem if you haven&#39;t finished grieving for the loss of what you had before. <br/>\n<br/>\n What are your principles? Your most precious values? Go from there. What sorts of things bring you and your daughter joy and harmony? Create more of those. How you do that may look very, very different than before - and that&#39;s okay. You get to have a different life, now, one that maybe you wouldn&#39;t have imagined a few years ago. My life has been through so many twists and turns... I don&#39;t think I ever could have imagined what I have now! It&#39;s nowhere in the original game-plan, that&#39;s for sure.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;little by little i am feeling like a failure in *some* areas<br/>\n<br/>\n </span></blockquote>Which areas? you mentioned conferences, but those aren&#39;t the only ways to meet people and make friends. In fact, if you have a shy kid, conferences aren&#39;t necessarily the best way to connect. If visiting and couch-surfing lets you feel connected then that may be a good option for y&#39;all, or you actually have a place of your own you could consider hosting guests - does someone have the couch surfing link? I&#39;ve heard of it (wonderful things!) but can&#39;t find the link right now. Depending on where you live, you could host unschoolers traveling to and from events and get the fun of meeting new people without the cost of the conference. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; are not home enough to be unpacking<br/>\n<br/>\n </span></blockquote>That sounds very stressful to me, but then I&#39;m a homebody and so is my daughter. We&#39;ve just cut a vacation short because we were tired of being away from home - too much New! and Different! I&#39;m ready for my own space even with all it&#39;s flaws. If being &quot;home&quot; makes you feel isolated, then it might be better to look for another place to live. Sharing a place is often more cost effective than living alone, too. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; as far as time spent together and money, when ive taken on small odd jobs ive lost much of our time together<br/>\n </span></blockquote>*************<br/>\n<br/>\nThat&#39;s the downside of work - and maybe that makes getting work a poor option if you have a little bit of income you can use to get by, at least in the short term. If it&#39;s possible, spend some time not looking for work or thinking about working. Use the time to find more creative ways to stretch what you have and spend time together. Getting your home organized and unpacked can help with that! It&#39;s easier to economize when you have a home base of some kind, it&#39;s easier to plan when you have a regular daily rhythm, and it&#39;s easier to take some time away from home (and your daughter) when you&#39;re both feeling stable and secure. <br/>\n<br/>\nI&#39;d work on &quot;stable and secure&quot; first and think of the rest as extras. School doesn&#39;t necessarily add to &quot;stable and secure&quot;. If you already have a small income, looking for work doesn&#39;t necessarily add to &quot;stable and secure&quot;. If you really can&#39;t live without more income, that&#39;s another matter! But if you can, start from there. Build a nest together with your daughter and gradually add other things to your new life. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Single Parent & the sadness of missing Conferences","postDate":"1344626865","msgId":68526,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUzNDgzQkRDLThEOTgtNDJBRi05QTRCLUFDNDFBNkU0NkUwNEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGswMXJ2NytjaWdqQGVHcm91cHMuY29tPg==","referencesHeader":"PGswMXJ2NytjaWdqQGVHcm91cHMuY29tPg=="},"prevInTopic":68525,"nextInTopic":68527,"prevInTime":68525,"nextInTime":68527,"topicId":68517,"numMessagesInTopic":0,"msgSnippet":"-=-I dont want to give up, i dont want to stop unschooling and eventually have to give in and send my child back to school. yet little by little i am feeling","messageBody":"<div id=\"ygrps-yiv-1894069500\">-=-I dont want to give up, i dont want to stop unschooling and eventually have to give in and send my child back to school. yet little by little i am feeling like a failure in *some* areas and while i do read the posts here every day, i havnt always been able to contribute my thoughts as i would like, wondering if i have a right to chime in as im battling my confidence against some insecurities as a joyful parent.-=-<br/>\n<br/>\nI looked at this again, and I see &quot;give in&quot; and &quot;battling.&quot;<br/>\n<br/>\nIt might help to relax and see what you are doing, instead of what you&#39;re not doing.  There seems to be antagonism escaping through your words.  More peace and less resistence might be helpful.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":504505579,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Single Parent & the sadness of missing Conferences","postDate":"1344615049","msgId":68525,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBT09UYVhQLVowZm9PWWVOYUhaWW44PTNyb3F2QmEyamZOTjhnWm5GTmZ3SENjVnRGUUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDQzREM2OUM1LTJDODAtNDYwQS05ODc0LUYyNzJCMkEyOEQ4M0B2ZXJpem9uLm5ldD4=","referencesHeader":"PDJjNzg0LjcyZTgzZGI1LjNkNTVlYzljQGFvbC5jb20+CTw0M0RDNjlDNS0yQzgwLTQ2MEEtOTg3NC1GMjcyQjJBMjhEODNAdmVyaXpvbi5uZXQ+"},"prevInTopic":68524,"nextInTopic":68526,"prevInTime":68524,"nextInTime":68526,"topicId":68517,"numMessagesInTopic":0,"msgSnippet":"... Other kinds of get-togethers can be wonderful. They can be better. For example, an unschooling speaker can be invited to someone s house. Sandra and I went","messageBody":"<div id=\"ygrps-yiv-1468014309\">On Fri, Aug 10, 2012 at 5:28 AM, Joyce Fetteroll &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jfetteroll@...\">jfetteroll@...</a>&gt;wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; im just really sad to be missing conferences and wondered<br/>\n&gt; &gt; how anyone else deals with the disappointment of that<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Other kinds of get-togethers can be wonderful. They can be better. For<br/>\nexample, an unschooling speaker can be invited to someone&#39;s house. Sandra<br/>\nand I went to someone&#39;s house in Bakersfield, California, and spoke to<br/>\nabout 25 or 30 people. They brought potluck dishes. It was really nice -<br/>\njust in someone&#39;s living room. Lots of good discussion after we talked.<br/>\nThat could be even more encouraging and helpful than a conference for some<br/>\npeople - more personal.<br/>\n<br/>\nSometimes I give &quot;unschooling talks&quot; at our weekly park days - we plan them<br/>\nan hour before the park day normally gets started. People come who don&#39;t<br/>\nusually come to the park days. Again, these could be more useful than<br/>\nconferences - they are followed by hours of hanging out together with a LOT<br/>\nof time for in-depth discussion.<br/>\n<br/>\nIn general, the way to get over a disappointment of not being able to<br/>\nafford something is to put your attention on what you CAN afford. When<br/>\nyou&#39;re focused on what you are getting/doing, you&#39;re not thinking about<br/>\nwhat you&#39;re missing. It isn&#39;t complicated. Even if you can&#39;t afford the<br/>\nentire conference experience, think of some part of what you love about<br/>\nconferences and find another way to get that.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":359707411,"authorName":"dezignarob","from":"&quot;dezignarob&quot; &lt;dezignarob@...&gt;","profile":"dezignarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Single Parent & the sadness of missing Conferences","postDate":"1344614726","msgId":68524,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGswM2JnNis5NnBqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDJjNzg0LjcyZTgzZGI1LjNkNTVlYzljQGFvbC5jb20+"},"prevInTopic":68523,"nextInTopic":68525,"prevInTime":68523,"nextInTime":68525,"topicId":68517,"numMessagesInTopic":0,"msgSnippet":"It s not that unschooling after divorce is unrecommended ; it s that it is much more difficult and often made impossible by the demands of the ex or a judge s","messageBody":"<div id=\"ygrps-yiv-1638178867\">It&#39;s not that unschooling after divorce is &quot;unrecommended&quot;; it&#39;s that it is much more difficult and often made impossible by the demands of the ex or a judge&#39;s determination that a child should go to school. It&#39;s the divorce that is unrecommended if a marriage can possibly be saved, and without abuse in the mix.<br/>\n<br/>\nLeaving out your need to heal after so many tumultuous years of a dysfunctional relationship, you say your biggest problem at the moment is financial.<br/>\n<br/>\nYou have what I presume is a fixed income of disability. Knowing you have an income is good.<br/>\n<br/>\nBut I am a little confused. You say you do rent a home, but you stay there so little that you haven&#39;t unpacked. This makes creating a nest difficult, and perhaps contributes to your being in the presence of people who doubt unschooling. I doubt that your friends or neighbors are seeing unschooling at its best under these conditions. <br/>\n<br/>\nAre you contributing room and board to your friends? If so can you make one of these situations more formal - like adding yourself to their lease as a roommate and become more settled? I hope you aren&#39;t staying with friends just for the company for yourself and not letting your daughter feel settled. People say she looks lonely, and you deny it. Yet other than holding babies, you never once talk about her friends or how you are filling her social needs separate from your own. <br/>\n<br/>\nYou say you have a stay away order against your husband, yet you are also seeing him regularly in court, but these court visits have proven futile in getting the child support from him that he should be paying.<br/>\n<br/>\nAccording to a quick scan of cost of living indexes online, Philadelphia is a slightly to somewhat above average expensive city in which to live, although it is certainly not in the top 10. (I do live in one of those top 10, so it seems cheaper to me.)<br/>\n<br/>\nYou may be able to make your income go a lot further if you were able to move to a less expensive locale, and actually rent a permanent home. You might then be able to find among the local home schoolers some of the community that you are missing from the conferences.(Since your ex is not paying support and has a restraining order, he can hardly complain if you move away - but you may legally have to get his permission to go to another State. I don&#39;t know how that works.)<br/>\n <br/>\n==== my half of the income which has been disability, only now pays the rent and bills. so that&#39;s about the only downside at this point. fortunately we have a  great circle of friends who we love and trust who have supported and added  to hands on the rich experience of raising a child. ===<br/>\n  <br/>\nSo these friends aren&#39;t the same ones who are saying the conventional things about school and trying to discourage you from home schooling altogether? <br/>\n<br/>\nI am glad that you have support groups to attend to help your healing. This is not an accusation but I want to caution you against turning your little girl into your emotional support. As mature and helpful as she may seem, beware that you are not burdening her with the responsibility of being your confidante. There is a lot of &quot;we&quot; in your writing, as if you were a pair. Sometimes we (here on the list) find mothers writing &quot;we&quot; about their family when the truth is that it is only mom&#39;s preference that she is expressing.<br/>\n<br/>\nRobyn L. Coburn<br/>\nwww.craft-it-easy.com<br/>\nwww.iggyjingles.etsy.com<br/>\nwww.robyncoburn.blogspot.com</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Single Parent & the sadness of missing Conferences","postDate":"1344611801","msgId":68523,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVBM0RBNDlCLTFGRDYtNEM2MS1BMzJGLTMyRkRBMkM3OTFBM0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDQzREM2OUM1LTJDODAtNDYwQS05ODc0LUYyNzJCMkEyOEQ4M0B2ZXJpem9uLm5ldD4=","referencesHeader":"PDJjNzg0LjcyZTgzZGI1LjNkNTVlYzljQGFvbC5jb20+IDw0M0RDNjlDNS0yQzgwLTQ2MEEtOTg3NC1GMjcyQjJBMjhEODNAdmVyaXpvbi5uZXQ+"},"prevInTopic":68522,"nextInTopic":68524,"prevInTime":68522,"nextInTime":68524,"topicId":68517,"numMessagesInTopic":0,"msgSnippet":"I liked Joyce s response, and added it to something by Katy Jennings here: http://sandradodd.com/singleparent","messageBody":"<div id=\"ygrps-yiv-601036042\">I liked Joyce&#39;s response, and added it to something by Katy Jennings here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/singleparent\">http://sandradodd.com/singleparent</a></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Single Parent & the sadness of missing Conferences","postDate":"1344609855","msgId":68522,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFGNzI4NkNELUE0NDgtNEQzNS04NDM4LUU3QjUwNjVFNDlBMEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDJjNzg0LjcyZTgzZGI1LjNkNTVlYzljQGFvbC5jb20+","referencesHeader":"PDJjNzg0LjcyZTgzZGI1LjNkNTVlYzljQGFvbC5jb20+"},"prevInTopic":68521,"nextInTopic":68523,"prevInTime":68521,"nextInTime":68523,"topicId":68517,"numMessagesInTopic":0,"msgSnippet":"-=-While I m sure we can have a life of learning while working and going to school, i dont feel it would be a happy one and fear us growing apart.-=- We can t","messageBody":"<div id=\"ygrps-yiv-364868696\">-=-While I&#39;m sure we can have a life of learning while working and going to <br/>\nschool, i dont feel it would be a happy one and fear us growing apart.-=-<br/>\n<br/>\nWe can&#39;t give you anything except ideas.<br/>\n<br/>\nSome people will &quot;encourage&quot; you, but if the suggestions are undoable and impractical, it become DIScouragement, doesn&#39;t it?  <br/>\n<br/>\nIf you don&#39;t feel you will be happy, then you won&#39;t be.  The largest part of happiness has to do with gratitude and joy.  Either of those can be snuffed out by the recitation of ills.  <br/>\n<br/>\nFear of growing apart can be overcome by paying attention to ways to be close, and school+job might be better than no job, no school, stress, fear, unhappiness.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Single Parent & the sadness of missing Conferences","postDate":"1344601735","msgId":68521,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQzREM2OUM1LTJDODAtNDYwQS05ODc0LUYyNzJCMkEyOEQ4M0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDJjNzg0LjcyZTgzZGI1LjNkNTVlYzljQGFvbC5jb20+","referencesHeader":"PDJjNzg0LjcyZTgzZGI1LjNkNTVlYzljQGFvbC5jb20+"},"prevInTopic":68520,"nextInTopic":68522,"prevInTime":68520,"nextInTime":68522,"topicId":68517,"numMessagesInTopic":0,"msgSnippet":"... Yes, there are some single mothers unschooling. But just being single and wanting to unschool isn t enough. Those who can do it have ways or have found","messageBody":"<div id=\"ygrps-yiv-506409916\">On Aug 10, 2012, at 12:48 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AngelOvFaith@...\">AngelOvFaith@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  just trying to see if any others have tried <br/>\n&gt; navigating it alone and what the experiences are.<br/>\n<br/>\n<br/>\n </span></blockquote>Yes, there are some single mothers unschooling. But just being single and wanting to unschool isn&#39;t enough. Those who can do it have ways or have found ways to do what they need to continue unschooling. Those who couldn&#39;t, have done something else.<br/>\n<br/>\nThe desire to unschool doesn&#39;t grant someone a magic wand to make obstacles disappear. Those who unschool have found solutions to the obstacles. Each story will be unique. They may be able to live with a parent or friend. They may have Social Security or other benefits. They may have a job that pays well enough. They may have a support system to care for their children when they&#39;re working.<br/>\n<br/>\nAnd, obviously, single moms have less time to be online so they aren&#39;t here talking about it much.<br/>\n<br/>\nPerhaps there&#39;s a job you can do with your daughter, such as running a small day care. Being a live-in nanny.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; im just really sad to be missing conferences and wondered <br/>\n&gt; how anyone else deals with the disappointment of that<br/>\n<br/>\n </span></blockquote>It sounds like conferences may be some kind of escape from real world problems for you. But they&#39;re a lot of money for something that doesn&#39;t fix problems in your real world. They&#39;re very expensive bandaids over festering wounds. That doesn&#39;t seem a useful direction for your energy at the moment.<br/>\n<br/>\nIt sounds like you need a plan. You&#39;re spending so much time unschooling you&#39;re not making time to find ways to make unschooling work. And I suspect your lack of confidence in being able to do it, is drawing attacks from others who sense your doubt which is making it more difficult. Can you avoid these people? Can you project more confidence so they don&#39;t sense your weakness?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; While I&#39;m sure we can have a life of learning while working and going to <br/>\n&gt; school, i dont feel it would be a happy one and fear us growing apart.<br/>\n<br/>\n<br/>\n </span></blockquote>Unschooling shouldn&#39;t be a goal. It&#39;s a vehicle that&#39;s well suited for getting to particular goals. Some of those goals are joyful living, whole children, learning through interests ...<br/>\n<br/>\nUnschooling isn&#39;t the only vehicle that can get to those goals. And those aren&#39;t the only goals.<br/>\n<br/>\nIf using a vehicle is causing damage that you can&#39;t figure out how to prevent, it&#39;s better to switch vehicles. If getting to a goal is causing damage that you can&#39;t figure out how to prevent, it&#39;s better to switch goals. At least until you can figure out how to make getting there work.<br/>\n<br/>\nUnschooling is a vehicle that needs a great deal of support. It&#39;s big advantage is it has few side effects.<br/>\n<br/>\nWithout the support, it may be easier to put the energy into easing the side effects of some other vehicle. It may be easier to reconnect after school and make up for some of the bad effects  than to unschool in a box beneath a freeway overpass. I think Sandra gave you a link to her School Choice page:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/schoolchoice\">http://sandradodd.com/schoolchoice</a><br/>\n<br/>\nThe biggest damage from school is because kids don&#39;t have a choice. And kids don&#39;t have a choice often because their parents believe it&#39;s the only route that will keep them from cashier at Wal-mart being their only career option. If you don&#39;t believe that, then there&#39;s a big chunk of school damage you won&#39;t be inflicting.<br/>\n<br/>\nChoosing school doesn&#39;t need to be a forever choice. It might be for 6 months. Or a year.<br/>\n<br/>\nMaybe with a job you&#39;ll be able to shop around to schools with your daughter to find one that she wants to try. If she knows she can switch, she&#39;ll feel less trapped. If you keep her in the loop about how you&#39;re working towards unschooling, or working towards something better, she&#39;ll fell less powerless.<br/>\n<br/>\nWhat are your goals? If you can&#39;t have the ideal, find &quot;better.&quot; What&#39;s the minimum your daughter needs to be happy? Begin building from there.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":197445047,"authorName":"AngelOvFaith@aol.com","from":"AngelOvFaith@...","profile":"angelovfaith","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Single Parent & the sadness of missing Conferences","postDate":"1344574108","msgId":68520,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJjNzg0LjcyZTgzZGI1LjNkNTVlYzljQGFvbC5jb20+"},"prevInTopic":68519,"nextInTopic":68521,"prevInTime":68519,"nextInTime":68521,"topicId":68517,"numMessagesInTopic":0,"msgSnippet":"While I m sure we can have a life of learning while working and going to school, i dont feel it would be a happy one and fear us growing apart. i believe  in","messageBody":"<div id=\"ygrps-yiv-867656280\">While I&#39;m sure we can have a life of learning while working and going to  <br/>\nschool, i dont feel it would be a happy one and fear us growing apart. i <br/>\nbelieve  in what we started.  just trying to see if any others have tried <br/>\nnavigating  it alone and what the experiences are.<br/>\n I just gotta add, if it didn&#39;t seem clear, my ex-husband left us, not  was <br/>\nkicked out by me, four different times. the 1st when i was pregnant,  the <br/>\n2nd when our daughter was 5 months old and was gone 3 and a half years., the  <br/>\n3rd & 4th times were last fall when the violence got really bad after  we <br/>\nreturned home from a conference. <br/>\n <br/>\ni had invited him to come. i like parenting as a single  though mom, alot. <br/>\nive kinda been doing it for all this time anyway. its sad  because he was <br/>\nsupportive of unschooling but then threw it in my face  saying he felt like a <br/>\nslave working while she got to do what she wanted. i  offered him lots i had <br/>\nheard and on the internet from the dad&#39;s panels when in  reality i dont <br/>\nthink he ever wanted the responsibility of being a father and  wanted an excuse <br/>\nout.<br/>\n <br/>\nmy half of the income which has been disability, only now pays the rent and <br/>\n bills. so that&#39;s about the only downside at this point. fortunately we <br/>\nhave a  great circle of friends who we love and trust who have supported and <br/>\nadded  to hands on the rich experience of raising a child.<br/>\n <br/>\nLynne Marie, Mom of Faith in Philadelphia PA<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Single Parent & the sadness of missing Conferences","postDate":"1344568650","msgId":68519,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQwRjI1RTBBLTI0M0YtNEExQi1CRTQ4LTlBRTEyMkFCNUNDRkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGswMXJ2NytjaWdqQGVHcm91cHMuY29tPg==","referencesHeader":"PGswMXJ2NytjaWdqQGVHcm91cHMuY29tPg=="},"prevInTopic":68518,"nextInTopic":68520,"prevInTime":68518,"nextInTime":68520,"topicId":68517,"numMessagesInTopic":0,"msgSnippet":"We re talking about what s ideal, and what s better than worse. If you do end up using school as babysitting, consider these ideas:","messageBody":"<div id=\"ygrps-yiv-1137209010\">We&#39;re talking about what&#39;s ideal, and what&#39;s better than worse.<br/>\n<br/>\nIf you do end up using school as babysitting, consider these ideas:  <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/schoolchoice\">http://sandradodd.com/schoolchoice</a><br/>\n<br/>\nI&#39;m really sorry that your wedding didn&#39;t survive, and I&#39;m lad you tried to get counselling and that your husband did try, and come back.  <br/>\n<br/>\nIf my husband was really angry with me, I would hate for him to throw me out of the house.  For others reading here, asking a dad to leave (four times?) might not be as good as trying to get help while still helping each other **IF POSSIBLE.**    It&#39;s not always possible, but when one partner is banished, it opens the door for them to get help from other people, and comfort, and assistance.<br/>\n<br/>\n-=-so i ask...is unschooling truly that UNrecommended for single parents? -=-<br/>\n<br/>\n&quot;Unschooling&quot; isn&#39;t a thing that is recommended or &quot;unrecommended.&quot;  <br/>\nIf school would be better for her, she should be in school.  If you can provide a better experience for her than school, then it&#39;s good.  <br/>\n<br/>\nYou can still have a warm, supportive relationship and a life of learning if you have a job and she goes to school.  <br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":197445047,"authorName":"angelovfaith","from":"&quot;angelovfaith&quot; &lt;AngelOvFaith@...&gt;","profile":"angelovfaith","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Single Parent & the sadness of missing Conferences","postDate":"1344566175","msgId":68518,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGswMXMydit1anVrQGVHcm91cHMuY29tPg=="},"prevInTopic":68517,"nextInTopic":68519,"prevInTime":68517,"nextInTime":68519,"topicId":68517,"numMessagesInTopic":0,"msgSnippet":"I forgot to sign my name to my previous post a second ago... Sincerely, Lynne Marie, Mom of Faith, in Philadelphia PA","messageBody":"<div id=\"ygrps-yiv-2056758060\">I forgot to sign my name to my previous post a second ago...<br/>\n<br/>\nSincerely, Lynne Marie, Mom of Faith, in Philadelphia PA</div>","specialLinks":[]},{"userId":197445047,"authorName":"angelovfaith","from":"&quot;angelovfaith&quot; &lt;AngelOvFaith@...&gt;","profile":"angelovfaith","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Single Parent & the sadness of missing Conferences","postDate":"1344566055","msgId":68517,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGswMXJ2NytjaWdqQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":68518,"prevInTime":68516,"nextInTime":68518,"topicId":68517,"numMessagesInTopic":0,"msgSnippet":"I know there may be some pretty strong opinions in either direction on this topic, and beleive me i have struggled with every one of my own. I dont want to","messageBody":"<div id=\"ygrps-yiv-272163782\">I know there may be some pretty strong opinions in either direction on this topic, and beleive me i have struggled with every one of my own. <br/>\n<br/>\nI dont want to give up, i dont want to stop unschooling and eventually have to give in and send my child back to school. yet little by little i am feeling like a failure in *some* areas and while i do read the posts here every day, i havnt always been able to contribute my thoughts as i would like, wondering if i have a right to chime in as im battling my confidence against some insecurities as a joyful parent.<br/>\n<br/>\ni did tried to salvage my marriage of ten years with 4 separations over which my ex husband cheated on me repeatedly, emotionally, mentally, economically and finally, physically abused m,e as well as harming himself, plus many inappropriate things said and done around our 8 yr daughter over the years. i feel lucky to have ended it when i did rather than the possibilities of her being harmed further.(he had not sexually abused her or hit her but the forms of other abuse were not something i wanted her to grow up with and hoped each time he returned home that he had solved some issues or grown up, but he would act the part for a bit then back to the same.) he also had children with other women while he had abandoned us, and i took him back after his pleas of change, family pressure and religious guilt that i must forgive and had taken vows.<br/>\n<br/>\nwe did marriage counseling, did church classes, and many other support groups including family and friends. but i couldnt forgive. the line was crossed so many times, and i feel i saved my daughter and myself after living walking on eggshells around him. filing for divorce HAD to happen or we could be dead or i wouldve lost my child trying to defend myself. so i ask...is unschooling truly that UNrecommended for single parents? <br/>\n<br/>\nif i had to send my daughter back to a school after the divorce, she wouldve been an emotional wreck. the questions were already pouring in from other social groups. instead we got through it being strong together and attending support groups for victims of domestic violence where friends were made on both parts and my daughter has enjoyed being a caregiver towards younger children in places where she&#39;s regarded as the little helper. i see her gain a calmness from holding babies or helping other little ones. we discuss each of our groups together and are always told how lucky we are to have one another. <br/>\n<br/>\nyet now a year later after the divorce, we are really experiencing the fallout and the guilt pierces my heart with every question from people outside of those support groups.<br/>\n<br/>\nas far as security and stability, we have had to move and downsize. we are living out of many unpacked boxes and suitcases at times because of what we can no longer afford on one income and we stay at friends and loved ones places alot to have support and feel a sense of play and ease, so are not home enough to be unpacking. we made a few bins of our favorite things, books etc, for everyday carrying around and viewing pleasure and touching and playing with.<br/>\n<br/>\nas far as finacially, we could not afford to go to any of the unschooling conferences this year of which we made dear friends. ive had to take her out of her dance classes and do the free activites of the city, which arent bad but it was the first year with no dance recital which i was not used to and may be still part of my deschooling.<br/>\n<br/>\nas far as our own joy and peace, we have had to enter the Address Confidentiality Program since we are victims of domestic violence and have a 3 year stay away order from my ex. i have court every month with him for child support of which we still get none somehow and this always stresses me out to see or deal with his excuses and unaccountibility.<br/>\n<br/>\ni have no idea what the future holds and while the possibilities are endless and i could look at the cup half full instead of half empty, theres still no money to do what we really want.  <br/>\n<br/>\nas far as time spent together and money, when ive taken on small odd jobs ive lost much of our time together, even doing ebay or online things, and feel sick over it and would come home crying. we have worked on doing ebay together which is nice. i also was dating for a short time an old friend who was a single father with a young child thinking we had things in common and both wanted a family again, yet he was totally opposed to unschooling or homeschooling of any kind and it ended quite bitterly as i stuck up for my child.<br/>\n<br/>\ni beleive in finding us both joy in meeting new people and peaceful parents, and have found some who are in agreement with our lifestyle as far as emotionally for us. <br/>\n<br/>\nto not unschool seems unimaginable for me or my daughter now. im back and forth from guilt and confidence, joy of freedom and being stuck in a rut. we yearn to be at the conferences or visit friends.<br/>\n<br/>\nive also met new people who say school and the questions and even bullying is a rite of passage and i should send her back because even if it waits til college it will still emerge in some form and she will have to experience it. ive had family members and neighbors tell me &quot;she looks sooo lonely!&quot; and i really resent it. we do things together, talking or something all the time. then im like, am i missing something? but anyone who has met her, knows she has a shy face like that. i know encouragement is something i can only do for my daughter and myself, and less than a year ago i posted my concerns over how things would affect us...so here we are. <br/>\n<br/>\nim just really sad to be missing conferences and wondered how anyone else deals with the disappointment of that, since we had planned on doing every one this past year, and felt that was the thing that really changed our life and made us truly set in our path when we began unschooling. <br/>\n<br/>\nthank you in advance.</div>","specialLinks":[]}],"prevTopicId":68498,"nextTopicId":27362}}