{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":0,"authorName":"susan","from":"susan &lt;fxfireob@...&gt;","replyTo":"LIST","senderId":"F-tCjbSYkhdbE3n7XdlU6vKsGm79YOHNLHnVAMIr9My9U1hwxEk5OE3_R1cbnuFSrmqT972isSrnbqZ3aizpVC8","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Fw: Need for advice","postDate":"954175450","msgId":7335,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM4REY4RjlGLkM1MTg5NjVEQGZsYXNoLm5ldD4=","referencesHeader":"PDAwMTcwMWJmOTQ3NCQ3ZTA1ZjRlMCQwY2QzOGFkMUB0c3VnYT4="},"prevInTopic":7253,"nextInTopic":0,"prevInTime":7334,"nextInTime":7336,"topicId":7247,"numMessagesInTopic":0,"msgSnippet":"hi, rene , my 4 1/2 yo son, went through this about a year ago (we live next door to a daycare and across the street from an elementary school:) and i was","messageBody":"<div id=\"ygrps-yiv-1026511040\">\n<html>\n \nhi,\n<p>rene&#39;, my 4 1/2 yo son, went through this about a year ago (we live\nnext door to a daycare and across the street from an elementary school:)\nand i was really hurt, upset and felt terribly guilty (i also have a chronic\nillness hence the guilt).&nbsp; how i handled it was i just let myself\nfeel this way then after about an hour of this self effacing and self pitying\ni asked myself why i wanted to unschool and i told him these reasons.&nbsp;\nlike other people have said,&nbsp; i also told him why i thought he wouldn&#39;t\nlike being a &#39;daycare kid&#39; as he phrased it.&nbsp; i talked about the loss\nof decision making, having to share toys with lots of other kids, having\nto eat and play and nap etc. when they felt he should, and that he would\nhave to go to sleep early and wake up early and he wouldn&#39;t see me or his\ndad until the sun was nearly set...\n<p>about 6 months after this he happened to be playing at a park that butted\nup against a daycare.&nbsp; he wandered in and was playing with the kids\nbut he was soon discovered and kicked out.&nbsp;&nbsp; though he had never\ntalked about going to daycare or school during the 6 months prior to this,\nhe is now openly against schools.&nbsp; recently he came to me really upset.&nbsp;&nbsp;\nit took me a little while to figure out what was bothering him, one of\nthe things he said was &#39;i don&#39;t want to go to itt tech&#39;.&nbsp;&nbsp; i&#39;m\nthinking what are you talking about but apparently there are ads on tv\nfor this tech school and they say something like &#39;you must go here&#39; and\nhe thought he could not be homeschooled anymore:)&nbsp; so as they say\n&#39;this too shall pass&#39;.&nbsp; anxiety is part of the transition once you&#39;re\nwell on they way it will fade.\n<p>personally i would caution against falling into a trap of &#39;entertaining&#39;\nyour son with lots of things outside of the family particularly at this\nage.&nbsp;&nbsp; a local group would be great, i unfortunately have no\nidea how to start one, we are luck enough to have this already in place\nfor some 20 years here in austin - inclusive to boot, but the truth is\nwe only go to parkdays once a week and if we need to skip a week he really\nisn&#39;t too upset by it but he does love his friends there.&nbsp; i&#39;m reading\nholt&#39;s <u>teach your own</u> and he says: &#39;perhaps above all, they [kids]\nneed a lot of privacy, solitude, calm, times when there&#39;s nothing to do.&#39;&nbsp;&nbsp;\nhe&#39;ll have plenty of time to be outgoing and being active no need to rush\nit, though it&#39;s tempting.&nbsp; by the way where do you live?\n<p>-susan\n<br>austin,tx\n<br>&#39;unity through diversity&#39;\n<br>&nbsp;\n<br>&nbsp;\n<blockquote><span title=\"qreply\"> <blockquote TYPE=\"CITE\">&nbsp;<font size=\"-1\">Dear fellow homeschoolers,&nbsp;&nbsp;\nToday I was faced with my son, Zain&#39;s very blunt words, and since I base\nhis learning on what he naturally inspires towards learning about, it kinda\nhit me hard. I want him to be happy in his learning environment.&nbsp;\nHe sais,&quot; Am I ever gonna go to a regular school?, and play with the toys?&quot;\n(when he was around 3 we went and viewed some schools, to get an idea of\nwhat was available besides public school, and I think he may be referrring\nto one of the schools we went to see)_I said this is a regular school,\nand you have plenty of toys(my son is 4)&nbsp; He spouts off&quot; This ain&#39;t\nNO school, This is a home!!!!&quot;&nbsp; This was very frustrating to me, as\nI feel he is expressing the need for more stimulating activites.&nbsp;\nI don&#39;t really know how to go about planning more activites. Has anyone\nelse had something like this occur. My question also being, having Never\nbeen taught in an institutional environment, I wonder why he would ASSUME\nhe would enjoy this environment more than homeschool.&nbsp; ANd why would\nhe categorize homeschool , Not as school, where does this , sounding-programmed\nattitide come from?&nbsp; It really makes my confidence in homeschooling,\nsuffer.&nbsp; I wish I had a homeschooling group, so that he could see\nother children who are also learning like this, as all his friends, and\naquaintences are in public or private schools.&nbsp; SO this is probably\nwhere he gets it.&nbsp; Any advice here?&nbsp; I want to start a playgroup\n, does anyone have any suggestions about getting one up off it&#39;s feet?\nThere are many reasons I chose to homeschool him, and they are all very\nimportant to me, but when he makes a statement such as this I wonder if\nI am giving him what he needs. Thanks.&nbsp; Michelle</font></blockquote>\n\n \n</span></blockquote></p></html>\n</div>","specialLinks":[]},{"userId":0,"authorName":"HPaulson5@aol.com","from":"HPaulson5@...","replyTo":"LIST","senderId":"QK0ZfrmRgVaMKlEJ4xK6kAvHDsglwOYRjZGajh4KSFMMmqb1fD-h0R7If7501fLZZkrl3cF6ZoM","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Fw: Need for advice","postDate":"953824188","msgId":7253,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM2LjM5Nzg2MzIuMjYwYjhkYmNAYW9sLmNvbT4="},"prevInTopic":7251,"nextInTopic":7335,"prevInTime":7252,"nextInTime":7254,"topicId":7247,"numMessagesInTopic":0,"msgSnippet":"In a message dated 3/22/00 9:06:15 PM Central Standard Time, earthmagik@mindspring.com writes: ","messageBody":"<div id=\"ygrps-yiv-1399677632\">In a message dated 3/22/00 9:06:15 PM Central Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:earthmagik@...\">earthmagik@...</a> writes:<br/>\n<br/>\n&lt;&lt; <br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;<br/>\n </span></blockquote>Dear Michelle,                                                                  <br/>\n                    Hang in there!  I have  2 sons, one is 5, and the other <br/>\nis 3.  My oldest actually went to preschool for 1 semester before I pulled <br/>\nhim out.  After being away from that environment for many months, it was <br/>\nSept., and all the advertisements were pushing &quot;back to school&quot; items.  He <br/>\nwanted to be a part of this!  This is why he thought school was supposed to <br/>\nbe so much fun-- afterall, to him it meant getting new  things- pencils, <br/>\nbookbags, lunchboxes, etc.. and it looked so  much like a big kid thing to <br/>\ndo!  And then there was the school bus issue-- so many kids see that big <br/>\nyellow bus, and it looks like a blast!  They are so innocent, and just have <br/>\nno clue what all of this stuff is about.  They do not understand that they <br/>\nare being programmed to conform and go along like everyone else does, and <br/>\nattend the institution called mass schooling.  But the pros in advertising <br/>\nknow that the key to  getting  children interested is in  making it all look <br/>\nlike the greatest thing since chocolate cake.  Once kids get into school, <br/>\nhowever, they soon learn the reality-- no chocolate cake,  and rarely even  a <br/>\ncookie.    I have personally been on both sides of this fence:  I am a mother <br/>\nof 3 that fully supports unschooling, and I am also a former teacher!  I <br/>\ndecorated my kdg. room to make them think &quot;School must be great!,  Look at <br/>\nall the Disney characters!&quot;  We as teachers go to such effort to make it so <br/>\nbeautiful to look at, but part of that is to impress parents,too.  I&#39;m sure <br/>\nmany classrooms actually were &quot;too pretty&quot; and &quot;too colorful&quot;-- such a <br/>\ndistraction for many children -- then they get in trouble for not being able <br/>\nto listen, pay attention, etc...  Anyway, my oldest son needed to be told <br/>\nwhat it was like in school.  I had him sit at the kit. table , and I told him <br/>\nthat he could not speak without raising his hand, and that he had to sit <br/>\nstill, and do what I said.  Boy, do you think he wanted to continue this <br/>\ngame?  No way!  &quot;But&quot;, I told him,  &quot;this is what you&#39;d get to do at school&quot;. <br/>\n Then I showed him so worksheets, and told him he would have to sit there and <br/>\ndo them, and that, sorry, even if he did not want to, he&#39;d have to anyway, <br/>\njust like in real school.  He soon could see that &quot;real&quot; school was not <br/>\nsounding like much fun afterall, and decided it was more fun to go outside <br/>\nand play in the sandbox.  That ended his fascination with going to &quot;real <br/>\nschool&quot;.  Another lady I know had to deal with the magical yellow bus issue.  <br/>\nShe woke up her child bright and very early and explained that he was to <br/>\nhurry up: eat, dress, brush teeth, gather a lunch, and out the door-- in time <br/>\nto meet that 7:00 am bus.  Her child realized he would rather eat at a slower <br/>\npace, rest more completely, and relax his way into the day, and it ended the <br/>\nfantasy there.    I hope you can use these ideas to show your child the best <br/>\nthing for him is to be right where he is.  My name is Karen, and I would be <br/>\nhappy to talk with you further, if you would like!  Good luck!                  <br/>\n                                                        Karen</div>","specialLinks":[]},{"userId":0,"authorName":"marbleface@aol.com","from":"marbleface@...","replyTo":"LIST","senderId":"2QITm5g2tsnN2uWDhD0Ras2tL54zkQKk465vKvikPWAe8tQEIzZ-ZgtJmxMGF0qAdoOhYU1jOwSH","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Fw: Need for advice","postDate":"953821227","msgId":7251,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZiLjM4YzExOGQuMjYwYjgyMmJAYW9sLmNvbT4="},"prevInTopic":7247,"nextInTopic":7253,"prevInTime":7250,"nextInTime":7252,"topicId":7247,"numMessagesInTopic":0,"msgSnippet":"In a message dated 03/23/2000 3:06:15 AM !!!First Boot!!!, earthmagik@mindspring.com writes: ","messageBody":"<div id=\"ygrps-yiv-1259504074\">In a message dated 03/23/2000 3:06:15 AM !!!First Boot!!!, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:earthmagik@...\">earthmagik@...</a> writes:<br/>\n<br/>\n&lt;&lt;  Has anyone else had something like this occur. My question also being, <br/>\nhaving Never been taught in an institutional environment, I wonder why he <br/>\nwould ASSUME he would enjoy this environment more than homeschool.  ANd why <br/>\nwould he categorize homeschool , Not as school, where does this , <br/>\nsounding-programmed attitide come from?  It really makes my confidence in <br/>\nhomeschooling, suffer.  I wish I had a homeschooling group, so that he could <br/>\nsee other children who are also learning like this, as all his friends, and <br/>\naquaintences are in public or private schools.  SO this is probably where he <br/>\ngets it.  Any advice here?  I want to start a playgroup , does anyone have <br/>\nany suggestions about getting one up off it&#39;s feet? There are many reasons I <br/>\nchose to homeschool him, and they are all very important to me, but when he <br/>\nmakes a statement such as this I wonder if I am giving him what he needs. <br/>\nThanks.  Michelle<br/>\n <br/>\n -------------------- &gt;&gt;<br/>\n<br/>\n<br/>\nWell, probably  the reason we haven&#39;t had that exact conversation is that my <br/>\nson had the &quot;joy&quot; of actually going to ps.  It&#39;s not all it&#39;s cracked up to <br/>\nbe and he soon found that out.  Not that I am recommending it. <br/>\n<br/>\nBut ...<br/>\n<br/>\nmaybe your son sees all his little buddies and TV characters and most of the <br/>\nrest of the world going off to school.  He&#39;s not stupid.  He knows that he is <br/>\ndoing something different from the mainstream.<br/>\n<br/>\nI would suggest that you explain that to him.  That Mommy calls it school but <br/>\nreally it is homeschool.  That Mommy wants him to get a really good education <br/>\nand this is how you are doing it.  Or whatever it is you want to explain to <br/>\nhim.  Whatever it is you want him to believe about hsing.  But, the point is, <br/>\nI think it is important to tell him, explicitly, that hsing is what you are <br/>\ngoing to be doing.  As opposed to whatever else he may see going on in the <br/>\nworld around him.  Or he might start to imagine all sorts of reasons why he&#39;s <br/>\nnot in &quot;school.&quot;<br/>\n<br/>\nGood luck.  <br/>\n<br/>\nNance (I think it is hard to know when to really explain things to kids and <br/>\nwhen you just sort of go along and they go with you; I think that line keeps <br/>\nshifting; but I think they &quot;get&quot; more than we think and need clear, truthful, <br/>\nfull explanations more than we think!)</div>","specialLinks":[]},{"userId":0,"authorName":"Natrlmama@aol.com","from":"Natrlmama@...","replyTo":"LIST","senderId":"QzXx-SS99yzopwRCfLAkxRCtCZcbmiTdpVkEpB_yMODf7MxmuafCQFZILUHd0LcFbC1K4KAOD0w","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Fw: Need for advice","postDate":"953791472","msgId":7247,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYuMzlmOTZkNi4yNjBiMGRmMEBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":7251,"prevInTime":7246,"nextInTime":7248,"topicId":7247,"numMessagesInTopic":0,"msgSnippet":"In a message dated 03/22/2000 7:06:16 PM Pacific Standard Time, earthmagik@mindspring.com writes: ","messageBody":"<div id=\"ygrps-yiv-1189513546\">In a message dated 03/22/2000 7:06:16 PM Pacific Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:earthmagik@...\">earthmagik@...</a> writes:<br/>\n<br/>\n&lt;&lt;  Am I ever gonna go to a regular school?, and play with the toys? &gt;&gt;<br/>\n<br/>\nI think most children go through this.  They get it from television (tv always<br/>\nmakes school look like fun and all they ever do is sing and play and do <br/>\ncrafts), <br/>\nchildren&#39;s books and schooled friends.  I explained to my children that <br/>\nschool is not like they show it on tv or even how friends may talk about<br/>\nit.  I told them how long they would be there (from after breakfast to before <br/>\ndinner basically) and that they would have to do school work at home after<br/>\ndinner too!  I also said that they would only be able to play with their <br/>\nfriends<br/>\nduring lunch for a short period and the rest of the time they would be <br/>\nexpected to sit at their desks, not talking and doing what the teacher says!<br/>\nWell, talk about scaring the heck out of them.  They want nothing to do<br/>\nwith that (especially doing what the teacher tells them LOL).  I think its <br/>\nimportant to find a homeschool group in your area.   Even if they are a bit<br/>\nof a drive it would be worth it.  You need the support and your son can<br/>\nsee other children &quot;just like him&quot;.  Whats really cool is that my dd tells <br/>\npeople that we don&#39;t need to go to school to learn things, we just learn<br/>\nfrom going places and doing things.  Good luck!<br/>\nKathy</div>","specialLinks":[]}],"prevTopicId":7334,"nextTopicId":7338}}