{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":14,"messages":[{"userId":359707411,"authorName":"dezignarob","from":"&quot;dezignarob&quot; &lt;dezignarob@...&gt;","profile":"dezignarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: griefing","postDate":"1305613795","msgId":61229,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlxdDRsMys3ajBkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDg1MjI0NTZELUJENUEtNDhGRi1CODg1LUU3MTYzQzRDOTQzMEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":61152,"nextInTopic":0,"prevInTime":61228,"nextInTime":61230,"topicId":61036,"numMessagesInTopic":0,"msgSnippet":"==== He said some guys become dicks over MMOs, because it s role-playing, maybe.==== Jayn plays Free Realms. You undertake sometimes lengthy quest things and","messageBody":"<div id=\"ygrps-yiv-791478430\">==== He said some guys become dicks over MMOs, because it&#39;s role-playing, maybe.====<br/>\n<br/>\n<br/>\nJayn plays Free Realms. You undertake sometimes lengthy quest things and earn special clothes for your characters. You can also choose to trade or give your garments, some of which are quite special, to your friends.<br/>\n<br/>\nAnother character friended Jayn and joined her Group. They were chatting for a while. Then the other character wanted Jayn&#39;s white capri pants (a special garment). Jayn didn&#39;t want to give them, but agreed to lend them for a while.<br/>\n<br/>\nAs soon as the other character got the pants, she (as I assume) immediately said, &quot;Ha, ha. I&#39;ve got them now&quot; and unfriended Jayn. <br/>\n<br/>\nJayn was screaming (literally - I thought she&#39;d hurt herself and raced in from the other room) with rage and betrayal and frustration - almost hysterical - she chased the other person all over the map demanding them back, until the person logged off (although she may have come back as a different character). Jayn reported the user to the admin. She told her other friends about it on Free Realms. She was distraught, crying for at least an hour, and still feels hurt and angry about it.<br/>\n<br/>\nOne of Jayn&#39;s friends felt so bad for her that she did the quest, won another pair of pants and gave them to Jayn. Jayn was grateful but she did say, later when calm, that it wasn&#39;t the same as earning them herself.<br/>\n<br/>\nSo it might all be make believe, but the hurt feelings of the wronged party can be very real and very deep. It&#39;s not the same as screwing around with a non-playable character on Sims, for example. Now I know what it&#39;s called.<br/>\n<br/>\nRobyn L. Coburn<br/>\nwww.iggyjingles.blogspot.com</div>","specialLinks":[]},{"userId":314584010,"authorName":"rainas_family","from":"&quot;rainas_family&quot; &lt;dana.and.homer@...&gt;","profile":"rainas_family","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: griefing","postDate":"1305286563","msgId":61152,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlxajUzMytsMXM4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlwcjF2YitnOWU1QGVHcm91cHMuY29tPg=="},"prevInTopic":61084,"nextInTopic":61229,"prevInTime":61151,"nextInTime":61153,"topicId":61036,"numMessagesInTopic":0,"msgSnippet":"My 5yo boy and 9yo girl have been playing minecraft for about 5 months. Why does your son want to play on multi-player? If it s for the social interaction then","messageBody":"<div id=\"ygrps-yiv-56621161\">My 5yo boy and 9yo girl have been playing minecraft for about 5 months.<br/>\n<br/>\nWhy does your son want to play on multi-player?  <br/>\n<br/>\nIf it&#39;s for the social interaction then just clarifying that if he gets banned, then he won&#39;t get to play with them anymore can help.<br/>\n<br/>\nIf he wants to have lots of stuff, then he could play single-player and use the minecraft in-game inventory editor called toomanyitems.  It&#39;s relatively easy to install and lets him have as many of any item that he wants.<br/>\n<br/>\nIf he wants to explore new worlds and blow stuff up, you can also download other people&#39;s maps and play them in single-player, then destroy things all he wants.<br/>\n<br/>\nWe had a nice side-effect from our family being so into minecraft.  My 5 year old has stopped &quot;griefing&quot; in real life, meaning he&#39;s not making messes with other people&#39;s stuff so much.  He&#39;s more comfortable letting us clean up his toys because it&#39;s like starting a new world.  He&#39;s understanding so much more about cause and effect.<br/>\n<br/>\nWe&#39;ve also set up minecraft servers for our kids to play together.  My daughter got very angry when my son was doing the griefing and would stop the server.  Next time he wanted to play with her, he had to promise not to grief.  He wanted to play with her so badly he stopped griefing.  We also set up a server on his machine so he has a place where he sets all the rules.  <br/>\n<br/>\nOverall, the griefing issue was pretty shortlived.<br/>\n<br/>\nDana Brunson</div>","specialLinks":[]},{"userId":170380942,"authorName":"Lisa","from":"&quot;Lisa&quot; &lt;lisa@...&gt;","profile":"cslisacs","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: griefing","postDate":"1304662821","msgId":61084,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlxMDN2NStsM2tvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDcwMjg2OS41NzE3Mi5xbUB3ZWI4MTUwMi5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":61059,"nextInTopic":61152,"prevInTime":61083,"nextInTime":61085,"topicId":61036,"numMessagesInTopic":0,"msgSnippet":"I m really appreciating this discussion.  Thank you everyone for your input and for asking your children - I have more that I can discuss now with my son if","messageBody":"<div id=\"ygrps-yiv-1306094810\">I&#39;m really appreciating this discussion.  Thank you everyone for your input and for asking your children - I have more that I can discuss now with my son if this comes up again, instead of just my vague discomfort.<br/>\n<br/>\nI guess I thought the answers would be more black and white and learning that they are not gives me some more insight into unschooling.  There are no &#39;rules&#39; that someone can refer to and say &quot;this is right, this is wrong.&quot;  <br/>\n<br/>\nI agree with Sandra when she says that vandalizing makes you a vandal, and that&#39;s why I was uncomfortable.  I don&#39;t want my son to see himself as a griefer in real life, or be a griefer in real life.<br/>\n<br/>\nFor those who asked, the whole thing about &#39;when I&#39;m a teenager&#39; is actually something that his friends say often.  This was the first time I&#39;ve ever heard him say it and it was probably something his friend had just said to him.<br/>\n<br/>\nI asked him why he was enjoying the stealing and he said it did give him a thrill, so I think the idea of treasure hunting within minecraft, like Mica suggested, is probably a great idea.  thank you.<br/>\n<br/>\nLisa</div>","specialLinks":[]},{"userId":147283564,"authorName":"Jill Parmer","from":"Jill Parmer &lt;jparmer@...&gt;","profile":"jparm02","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] griefing","postDate":"1304608397","msgId":61059,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQ3RTUwRDE1LUY5OUUtNDNCOS05QjI5LTk0N0NDQjc5M0I0MEBmcmlpLmNvbT4=","inReplyToHeader":"PDM2QzdDQzM2LURENEItNEI3Ni04QUZDLTQ5M0M0ODYzMkExM0BTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGlwcjF2YitnOWU1QGVHcm91cHMuY29tPiA8QkFOTGtUaT1MQ25VSl9kTUVINDNzdjF1MC01dUVrWTdyandAbWFpbC5nbWFpbC5jb20+IDw3Njc1QTQ4Qy0wMDIyLTRCQ0UtQTY3OS0wQzM4MDkyNkJDMDFAU2FuZHJhZG9kZC5jb20+IDw2QUYxOEZFRS1ENUE3LTRFNDktQUE5OC1BQUQ4ODMxODcyRUFAdmVyaXpvbi5uZXQ+IDw3MDI4NjkuNTcxNzIucW1Ad2ViODE1MDIubWFpbC5tdWQueWFob28uY29tPiA8MzZDN0NDMzYtREQ0Qi00Qjc2LThBRkMtNDkzQzQ4NjMyQTEzQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":61058,"nextInTopic":61084,"prevInTime":61058,"nextInTime":61060,"topicId":61036,"numMessagesInTopic":0,"msgSnippet":"I talked to Luke about this.  He said that there are settings in Minecraft for doors to houses, it that only the person who makes a door can open the door, and","messageBody":"<div id=\"ygrps-yiv-1657203862\">I talked to Luke about this.  He said that there are settings in Minecraft for doors to houses, it that only the person who makes a door can open the door, and something similar for chests.  So he figured that the maker of that particular server knew that stealing could happen if he didn&#39;t set certain parameters on doors and chests.   But perhaps the other people making houses on that server might not know that?  There&#39;s real disappointment and sadness when your stuff gets taken.  Because of game mechanics, a person can steal, and the consequences to the victim are a sad and disappointed player who put in the time to get those items.  <br/>\n<br/>\nI think the consequences to the kid who stole things, would be being banned and losing reputation with other players.  If identity in Minecraft goes by IP addresses rather than login name, then I&#39;d be concerned if a sibling shared that computer, because their reputation would be hurt too.<br/>\n<br/>\nIn World of Warcraft stealing can happen by people who hack into accounts to steal valuables from that character and from the guild bank if they are in a guild.  Then they use that character as a &quot;bot&quot; (robot computer program) to farm valuables and sell those gold and items for real money over the internet.  You can get these items back, but it is a pain.  You get them back because there are real people hired by Blizzard Entertainment to restore hacked accounts.<br/>\n<br/>\nWithin the game, character to character, people can steal from a guild bank, they can steal by refusing to return items that were given to them to be crafted into something.  So relationships are created by working together and you learn who you can trust.<br/>\n<br/>\nIn Minecraft stealing is taking virtual things, but those things represent time and work (proportionate to the value of the items) of a person.<br/>\n<br/>\nIt really sucks to have your stuff stolen, especially these highly involved games that take a fair amount of time.  The feelings of logging on to your character and find it &quot;naked&quot; (all your armor gone) there&#39;s a sinking dread feeling that when you go to your backpacks and bank, you&#39;re going to find them emptied (for World of Warcraft), or for Minecraft to have your house blown up or all your items gone and not be able to build whatever you planned to build, it&#39;s sad....someone has taken or ruined what you worked for.<br/>\n<br/>\nThere are ways to play bad guys.  In roleplaying in WoW, I find it pretty fun to play with evil characters, but we&#39;re all playing by consent.  Beggars can be annoying (you can put them on /ignore to not have to deal with them), but Luke made a begging character and played him so awesomely that he actually made a fair amount of gold (given by consent).  <br/>\n<br/>\nI&#39;m really curious about why this boy wanted to steal from others?  If it&#39;s some sort of thrill, there are ways to get those without taking things from others.<br/>\n<br/>\n~Jill (Luke 12)</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] griefing","postDate":"1304565544","msgId":61058,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM2QzdDQzM2LURENEItNEI3Ni04QUZDLTQ5M0M0ODYzMkExM0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDcwMjg2OS41NzE3Mi5xbUB3ZWI4MTUwMi5tYWlsLm11ZC55YWhvby5jb20+","referencesHeader":"PGlwcjF2YitnOWU1QGVHcm91cHMuY29tPiA8QkFOTGtUaT1MQ25VSl9kTUVINDNzdjF1MC01dUVrWTdyandAbWFpbC5nbWFpbC5jb20+IDw3Njc1QTQ4Qy0wMDIyLTRCQ0UtQTY3OS0wQzM4MDkyNkJDMDFAU2FuZHJhZG9kZC5jb20+IDw2QUYxOEZFRS1ENUE3LTRFNDktQUE5OC1BQUQ4ODMxODcyRUFAdmVyaXpvbi5uZXQ+IDw3MDI4NjkuNTcxNzIucW1Ad2ViODE1MDIubWFpbC5tdWQueWFob28uY29tPg=="},"prevInTopic":61057,"nextInTopic":61059,"prevInTime":61057,"nextInTime":61059,"topicId":61036,"numMessagesInTopic":0,"msgSnippet":"I talked to Kirby about it.  He says he s not familiar with Minecraft, but in World of Warcraft, it s very real. For me, I think the principle is that stealing","messageBody":"<div id=\"ygrps-yiv-860929354\">I talked to Kirby about it.  He says he&#39;s not familiar with Minecraft, but in World of Warcraft, it&#39;s very real.  <br/>\n<br/>\nFor me, I think the principle is that stealing people&#39;s time and work, and vandalizing what they&#39;ve built, is uncool no matter how &quot;real&quot; the structure is.    Is my website real?  I&#39;d be really unhappy if someone could steal pages from it and I wouldn&#39;t have them anymore.  My blog.  Same thing.  I thought about it, I spent time on it, I pay for the hosting site, I keep my computer in repair so I can work on the site, I pay for internet.  I wouldn&#39;t want anyone stealing my diamonds or html.    Nor the plants in my zen garden on plants vs. zombies.  Nor the three-star wins I have on Angry Birds.<br/>\n<br/>\nIn the SCA, where I played/worked/socialized for many years, some people will swear an oath or make an agreement and then say &quot;my persona did that, not my mundane self.&quot;   Or someone will got beyond flirting to being abusive or get so drunk that he&#39;s threatening and then make light of it because &quot;The SCA is just a game.&quot;    Perhaps so.  Civil war re-enactment isn&#39;t a real war, but there is a reality to the expensive equipment and the time people have put into making or buying their tents and cooking gear and lanterns, and if someone stole or broke any of it it wouldn&#39;t matter what the level of reality was.  <br/>\n<br/>\nPeople are dealing with their real money, time and emotions, so hurt and harm are important to consider.  And when a person vandalizes something, it makes him a vandal. <br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] griefing","postDate":"1304561099","msgId":61057,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcwMjg2OS41NzE3Mi5xbUB3ZWI4MTUwMi5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PDZBRjE4RkVFLUQ1QTctNEU0OS1BQTk4LUFBRDg4MzE4NzJFQUB2ZXJpem9uLm5ldD4=","referencesHeader":"PGlwcjF2YitnOWU1QGVHcm91cHMuY29tPiA8QkFOTGtUaT1MQ25VSl9kTUVINDNzdjF1MC01dUVrWTdyandAbWFpbC5nbWFpbC5jb20+IDw3Njc1QTQ4Qy0wMDIyLTRCQ0UtQTY3OS0wQzM4MDkyNkJDMDFAU2FuZHJhZG9kZC5jb20+IDw2QUYxOEZFRS1ENUE3LTRFNDktQUE5OC1BQUQ4ODMxODcyRUFAdmVyaXpvbi5uZXQ+"},"prevInTopic":61050,"nextInTopic":61058,"prevInTime":61056,"nextInTime":61058,"topicId":61036,"numMessagesInTopic":0,"msgSnippet":"So I asked my 8 year old about griefing  on Minecraft. He says he does not do it but that there are servers where you can do it and some that you don;t, most ","messageBody":"<div id=\"ygrps-yiv-348892179\">So I asked my 8 year old about griefing  on Minecraft.<br/>\nHe says he does not do it but that there are servers where you can do it and some that you don;t, most <br/>\nservers have the rule of not griefing allowed if you join.<br/>\nHe said he watched a video about how some guys built a fabulous place and someone went there<br/>\n and blew it all up.  He said that it must have taken those guys so much time and work to do it<br/>\nfor someone to just come and destroy it.<br/>\nHe said, for him, that light griefing and medium griefing he would not be too upset <br/>\nbut hard griefing ( like blowing up a place that took a lot of work to build) is a no no<br/>\nand he would be very upset.<br/>\nMaybe explain to your son how much work some people put into getting their stuff mined and<br/>\nbuilding their things so he understands how one would feel  if he did something to them or someone did it to him.<br/>\n<br/>\nAlex Polikowsky<br/>\n<br/>\n<br/>\n <br/>\n<br/>\nFrom: Joyce Fetteroll &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jfetteroll@...\">jfetteroll@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nSent: Wednesday, May 4, 2011 12:32 PM<br/>\nSubject: Re: [AlwaysLearning] griefing<br/>\n<br/>\n<br/>\n    <br/>\n <br/>\n<br/>\n<blockquote><span title=\"qreply\"> On May 4, 2011, at 10:40 AM, Sandra Dodd wrote:<br/>\n<br/>\n&gt; But you don&#39;t want to treat game theft exactly the same as real-life <br/>\n&gt; burglary. It is, in part, but isn&#39;t, too.<br/>\n<br/>\nAnd really not the same thing when stealing from game characters. <br/>\n(Just to make that point clear.)<br/>\n<br/>\nIt can be troubling to watch kids act in anti-social ways in games but <br/>\nthat&#39;s part of the game. It&#39;s pretend. It&#39;s &quot;Let&#39;s see what happens <br/>\nwhen ...&quot; It&#39;s role playing. It&#39;s trying out what it&#39;s like to live <br/>\nlife when the rules are different.<br/>\n<br/>\nIt can be fun to steal or be mean to characters or kill in a game <br/>\n*because* the rules are different and because it&#39;s not permanent. Kids <br/>\nknow the rules don&#39;t carry over into the real world.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n   <br/>\n     <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] griefing","postDate":"1304530332","msgId":61050,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZBRjE4RkVFLUQ1QTctNEU0OS1BQTk4LUFBRDg4MzE4NzJFQUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDc2NzVBNDhDLTAwMjItNEJDRS1BNjc5LTBDMzgwOTI2QkMwMUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGlwcjF2YitnOWU1QGVHcm91cHMuY29tPiA8QkFOTGtUaT1MQ25VSl9kTUVINDNzdjF1MC01dUVrWTdyandAbWFpbC5nbWFpbC5jb20+IDw3Njc1QTQ4Qy0wMDIyLTRCQ0UtQTY3OS0wQzM4MDkyNkJDMDFAU2FuZHJhZG9kZC5jb20+"},"prevInTopic":61049,"nextInTopic":61057,"prevInTime":61049,"nextInTime":61051,"topicId":61036,"numMessagesInTopic":0,"msgSnippet":"... And really not the same thing when stealing from game characters. (Just to make that point clear.) It can be troubling to watch kids act in anti-social","messageBody":"<div id=\"ygrps-yiv-1974231204\">On May 4, 2011, at 10:40 AM, Sandra Dodd wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But you don&#39;t want to treat game theft exactly the same as real-life  <br/>\n&gt; burglary. It is, in part, but isn&#39;t, too.<br/>\n<br/>\n </span></blockquote>And really not the same thing when stealing from game characters.  <br/>\n(Just to make that point clear.)<br/>\n<br/>\nIt can be troubling to watch kids act in anti-social ways in games but  <br/>\nthat&#39;s part of the game. It&#39;s pretend. It&#39;s &quot;Let&#39;s see what happens  <br/>\nwhen ...&quot; It&#39;s role playing. It&#39;s trying out what it&#39;s like to live  <br/>\nlife when the rules are different.<br/>\n<br/>\nIt can be fun to steal or be mean to characters or kill in a game  <br/>\n*because* the rules are different and because it&#39;s not permanent. Kids  <br/>\nknow the rules don&#39;t carry over into the real world.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] griefing","postDate":"1304529496","msgId":61049,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg1MjI0NTZELUJENUEtNDhGRi1CODg1LUU3MTYzQzRDOTQzMEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEJBTkxrVGk9TENuVUpfZE1FSDQzc3YxdTAtNXVFa1k3cmp3QG1haWwuZ21haWwuY29tPg==","referencesHeader":"PGlwcjF2YitnOWU1QGVHcm91cHMuY29tPiA8QkFOTGtUaT1MQ25VSl9kTUVINDNzdjF1MC01dUVrWTdyandAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":61044,"nextInTopic":61050,"prevInTime":61048,"nextInTime":61050,"topicId":61036,"numMessagesInTopic":0,"msgSnippet":"Marty s up and says there are fewer repercussions on the internet for bullying people, so some people don t care about being mean or being a bad guy when","messageBody":"<div id=\"ygrps-yiv-257244117\">Marty&#39;s up and says there are fewer repercussions on the internet for bullying people, so some people don&#39;t care about &quot;being mean&quot; or being a bad guy when they&#39;re just playing the bad guy.  <br/>\n<br/>\nHe said some guys become dicks over MMOs, because it&#39;s role-playing, maybe.<br/>\n<br/>\nBut he says the game Fable 2 (for computer? or XBox--maybe not computer) can be played with teams and you can play bad guys.<br/>\n<br/>\nAs to the terminology for the good/bad, Marty said there&#39;s not a name he knows of for the genre of game but some people call the measure the morality meter or karma meter, but he says there&#39;s not a real name for it.   <br/>\n<br/>\n------<br/>\nEnd of channeling Marty.<br/>\n<br/>\nBut that&#39;s another aspect to consider.  When people have &quot;a character,&quot; they might not feel that they themselves are being mean.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] griefing","postDate":"1304520009","msgId":61044,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc2NzVBNDhDLTAwMjItNEJDRS1BNjc5LTBDMzgwOTI2QkMwMUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEJBTkxrVGk9TENuVUpfZE1FSDQzc3YxdTAtNXVFa1k3cmp3QG1haWwuZ21haWwuY29tPg==","referencesHeader":"PGlwcjF2YitnOWU1QGVHcm91cHMuY29tPiA8QkFOTGtUaT1MQ25VSl9kTUVINDNzdjF1MC01dUVrWTdyandAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":61042,"nextInTopic":61049,"prevInTime":61043,"nextInTime":61045,"topicId":61036,"numMessagesInTopic":0,"msgSnippet":"Mica had a wealth of info!  Diamonds in there! :-) This is important: -=-Darcy came back later wondering whether: if a mother avoids confrontation for fear of","messageBody":"<div id=\"ygrps-yiv-876676564\">Mica had a wealth of info!  Diamonds in there! :-)<br/>\n<br/>\nThis is important:<br/>\n<br/>\n-=-Darcy came back later wondering whether: if a mother avoids confrontation<br/>\nfor fear of ruining a relationship - this might end up passively hurting the<br/>\nrelationship ... at my confusion, he explained that if after a long period<br/>\nof freedom to act as he pleased a confrontation eventually came, the<br/>\nresentment would be greater.  I tried to work how whether he was suggesting<br/>\nsome sort of earlier control-action and he denied this - was just discussing<br/>\npossibilities.  It was interesting to sort of see how he was thinking.-=-<br/>\n<br/>\nTacit approval, is the concept in play.  If you don&#39;t object, and don&#39;t object, and continue to look the other way, when you DO say something, it might be too late.  You&#39;ve already aided and abetted.  <br/>\n<br/>\nBut you don&#39;t want to treat game theft exactly the same as real-life burglary.   It is, in part, but isn&#39;t, too.   Kirby is QUITE asleep at this hour, but I&#39;m sure he&#39;s been in ethics and philosophy discussions about how real theft is in World of Warcraft, as he was for a while one of the guys who researched serious breaches of that sort, and figured out how to untangle such things.   And you have already told us people can be dropped from the server or removed from the game or something, so they consider it to be real and serious.<br/>\n<br/>\nIn working on a page, I came upon this, which was a page started and not yet finished and announced, but it might be worth thinking about:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/integrity\">http://sandradodd.com/integrity</a><br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":199045059,"authorName":"Mica","from":"Mica &lt;mica.meerbach@...&gt;","profile":"micaherself","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] griefing","postDate":"1304518673","msgId":61042,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBTkxrVGk9TENuVUpfZE1FSDQzc3YxdTAtNXVFa1k3cmp3QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGlwcjF2YitnOWU1QGVHcm91cHMuY29tPg==","referencesHeader":"PGlwcjF2YitnOWU1QGVHcm91cHMuY29tPg=="},"prevInTopic":61039,"nextInTopic":61044,"prevInTime":61041,"nextInTime":61043,"topicId":61036,"numMessagesInTopic":0,"msgSnippet":"I asked for my youngest son s opinion because he also plays Minecraft. We re not completely sure.  Darcy s first inclination was to wonder whether your son has","messageBody":"<div id=\"ygrps-yiv-443497254\">I asked for my youngest son&#39;s opinion because he also plays Minecraft.<br/>\n<br/>\nWe&#39;re not completely sure.  Darcy&#39;s first inclination was to wonder whether<br/>\nyour son has ever spent a lot of time diamond-hunting or  gathering or<br/>\nbuilding - the things that can take hours and days?  If so you might<br/>\nencourage your son to think about one of those many-hour-activities and then<br/>\nimagine someone else stealing or destroying that effort.  This might be less<br/>\nrelevant if is a privately hosted server where the host can simply create<br/>\nsuch stuff.<br/>\n<br/>\nHis second suggestion was to invite your son to his own server - although he<br/>\nwould need the networking system Hamachi.  You can email me privately to get<br/>\nDarcy&#39;s Hamachi  IP address.  When I asked, &quot;what if this kid becomes a pain<br/>\nin the neck on your server&quot; - apparently he can easily close the server and<br/>\nopen a new private one, so the thought didn&#39;t bother him.  Darcy uses his<br/>\nown server for building and designing, blowing things up etcetera.  On his<br/>\nfriend&#39;s server Darcy created elaborate systems for hiding his stores, so he<br/>\ncould do something similar to challenge your son&#39;s treasure-hunting.<br/>\n<br/>\nThe more we talked the more complicated we found ourselves thinking ... it<br/>\ndepends what kinds of discussions and ethics your family shares about<br/>\ngameplay, property ownership and care of others.<br/>\n<br/>\nDarcy has enjoyed playing the edges in games like World of Warcraft - he has<br/>\nat different times enjoyed playing at being a pain in the neck - things like<br/>\ncamping or in games like Call of Duty using excessive weaponage.  The social<br/>\naspects of multiplayer games have been fascinating to watch - although<br/>\ndifficult too.  I grew up learning one should always &quot;play nice&quot; so watching<br/>\nDarcy experiment with pesky behaviours was difficult - indeed there were<br/>\ntimes when I would cut it short - I would insist on a change of activity and<br/>\nsometimes we would discuss whatever he was feeling at the time.<br/>\n<br/>\nBefore I agreed to the first multiplayer account, I had discussed with my<br/>\nboys the variety of anti-social and pro-social behaviours I had read about -<br/>\nand they had uncles and friends talk to them about such things too - so by<br/>\nthe time they began playing online they were prepared to remember that on<br/>\nthe other end of the avatar and text was another person - as easily a little<br/>\ncousin or friend, potential eventual employer, even girlfriend (giggle). We<br/>\ndiscussed the potential consequences of being rude or a pain or nuisance -<br/>\ngetting dropped from groups/private_servers and then over time when his<br/>\nguilds debated whether or not to kick certain players, or when he or others<br/>\ndropped each other from groups or servers he would tend to discuss the<br/>\ninterplay of personalities and circumstances with me.  When the boys&#39; under<br/>\n13 yo friends would play games that required being 13yo my sons would warn<br/>\nthem that playing childishly could get them discovered and lose their<br/>\naccount.  This was something that one of the games had issued as a warning.<br/>\nThis is not the case with Minecraft I think.<br/>\n<br/>\nSandra was exploring games that enable &quot;bad guy&quot; play: Silkroad is one - of<br/>\nthe three groups of characters there were Traders, Hunters and Thieves.<br/>\n<br/>\nI asked about Knights of the Old Republic, curious whether Darcy would<br/>\nremember the name of the character parameter that measured weight of<br/>\ngood/bad actions - he couldn&#39;t but talked about it being how far along the<br/>\ncharacter was either dark path or light path of the force.<br/>\n<br/>\nThe boys loved Freelancer - but apparently there are no more servers that<br/>\nthey can find.<br/>\n<br/>\nDarcy came back later wondering whether: if a mother avoids confrontation<br/>\nfor fear of ruining a relationship - this might end up passively hurting the<br/>\nrelationship ... at my confusion, he explained that if after a long period<br/>\nof freedom to act as he pleased a confrontation eventually came, the<br/>\nresentment would be greater.  I tried to work how whether he was suggesting<br/>\nsome sort of earlier control-action and he denied this - was just discussing<br/>\npossibilities.  It was interesting to sort of see how he was thinking.<br/>\n<br/>\nHe also suggested you find a way to make the stealing boring for him.  He<br/>\nhad no suggestions how to achieve that.<br/>\n<br/>\nHave you asked your son why he enjoys it? What he gets out of it?<br/>\n<br/>\nThat taps me out, good luck<br/>\n<br/>\nMica<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Wed, May 4, 2011 at 6:15 PM, Lisa &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:lisa@...\">lisa@...</a>&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; My son is 8. He enjoys minecraft and I have hooked him up on some<br/>\n&gt; multiplayer servers. The rules on the multiplayer servers are &#39;no griefing&#39;<br/>\n&gt; which means no annoying other players - &#39;no stealing&#39; which means no taking<br/>\n&gt; items out of other people&#39;s chests, and no entering houses without<br/>\n&gt; permission. if you do these things you can be banned.<br/>\n&gt;<br/>\n&gt; My son likes to steal things from other people&#39;s chests and so far hasn&#39;t<br/>\n&gt; been caught. Him and his friend are calling each other &#39;griefers&#39; - this<br/>\n&gt; makes me uncomfortable. It&#39;s not a role I want him to play. I have said so<br/>\n&gt; to him.<br/>\n&gt;<br/>\n&gt; My son said to me &#39;if I was a teenager and you weren&#39;t here I would steal<br/>\n&gt; all 64 of those diamonds&#39;.<br/>\n&gt;<br/>\n&gt; this gave me pause - could I be hurting our relationship by asking him not<br/>\n&gt; to do this because I am uncomfortable with it? He understands he may be<br/>\n&gt; banned and is willing to take that risk. Should I try to be ok with it?<br/>\n&gt;<br/>\n&gt; what do you think? thanks, Lisa<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: griefing","postDate":"1304511837","msgId":61039,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhFNzgxREZFLThCM0ItNDFFMC1BNTlCLTgwM0ZDNDJDOUY4REBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGlwcmJiMSt2ZzdjQGVHcm91cHMuY29tPg==","referencesHeader":"PGlwcmJiMSt2ZzdjQGVHcm91cHMuY29tPg=="},"prevInTopic":61038,"nextInTopic":61042,"prevInTime":61038,"nextInTime":61040,"topicId":61036,"numMessagesInTopic":0,"msgSnippet":"-=-If he s gaming with kids from the Unschooling Gamers list, something he might want to consider is that if he wants to game with those kids on other games or","messageBody":"<div id=\"ygrps-yiv-2013337996\">-=-If he&#39;s gaming with kids from the Unschooling Gamers list, something he might want to consider is that if he wants to game with those kids on other games or game systems, they might not be interested if they feel he&#39;s going to carry that same attitude over to other games. <br/>\n<br/>\n-=-Also, he may end up getting to meet some of those kids at an unschooling conference or other unschooling get-together at some point, and how he&#39;s interacted with them in online gaming could impact their interest in wanting to hang out with him in person.-=-<br/>\n<br/>\n<br/>\nI&#39;ve reminded my kids in the past when a decision or action could limit their friendships.  Sometimes I said &quot;It would be harder to get a job,&quot; or &quot;Fewer people would be willing to marry you.&quot;  Said lightly, but intended to show that it will not enlarge them in the world, but will limit them.<br/>\n<br/>\nThe more good choices a person makes, the better the person is.   And being a good, respectable person is worth cash and valuable prizes, and friendships, and peace of mind, and trustworthiness.<br/>\n<br/>\nTrustworthy; worthy of trust.  That&#39;s important.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":67727291,"authorName":"wtexans","from":"&quot;wtexans&quot; &lt;wtexans@...&gt;","profile":"wtexans","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: griefing","postDate":"1304506529","msgId":61038,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlwcmJiMSt2ZzdjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlwcjF2YitnOWU1QGVHcm91cHMuY29tPg=="},"prevInTopic":61037,"nextInTopic":61039,"prevInTime":61037,"nextInTime":61039,"topicId":61036,"numMessagesInTopic":0,"msgSnippet":"===He understands he may be banned and is willing to take that risk.=== My son, who also plays Minecraft, did a very quick perusal of the servers and found one","messageBody":"<div id=\"ygrps-yiv-61621153\">===He understands he may be banned and is willing to take that risk.===<br/>\n<br/>\nMy son, who also plays Minecraft, did a very quick perusal of the servers and found one where stealing was allowed, but not griefing. That might be an option your son would be interested in. Or he might be able to find a server where it&#39;s no-holds-barred.<br/>\n<br/>\nIf he&#39;s gaming with kids from the Unschooling Gamers list, something he might want to consider is that if he wants to game with those kids on other games or game systems, they might not be interested if they feel he&#39;s going to carry that same attitude over to other games. <br/>\n<br/>\nAlso, he may end up getting to meet some of those kids at an unschooling conference or other unschooling get-together at some point, and how he&#39;s interacted with them in online gaming could impact their interest in wanting to hang out with him in person.<br/>\n<br/>\n<br/>\n===My son said to me &#39;if I was a teenager and you weren&#39;t here I would steal all 64 of those diamonds&#39;.===<br/>\n<br/>\nI&#39;m unclear as to why he feels there would be a difference if he was a teenager. Is he meaning you wouldn&#39;t be watching him game if he was a teenager?<br/>\n<br/>\n<br/>\n===My son likes to steal things from other people&#39;s chests and so far hasn&#39;t been caught. Him and his friend are calling each other &#39;griefers&#39; - this makes me uncomfortable.  It&#39;s not a role I want him to play. I have said so to him.===<br/>\n<br/>\nFor me, it can be tricky listening to and watching my son game with his friends because I&#39;m seeing their interactions with such a different perspective than they. There&#39;s a certain amount of trash-talking that happens, there&#39;s a certain amount of killing/stealing/etc. -- the acceptable levels are worked out between him and his friends, and it varies based on who&#39;s playing and what they&#39;re playing. <br/>\n<br/>\nThe guideline my son tends to work with is: &quot;Would I act this way if I was gaming in the same room with these people?&quot;. There have been times when I&#39;ve seen him do things or heard him say things that have resulted in me asking him, &quot;would you have done / said that if so-and-so was gaming in your room with you?&quot; -- for him, it&#39;s been a good way to be thoughtful about his actions. <br/>\n<br/>\nGlenda</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] griefing","postDate":"1304502698","msgId":61037,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PERENkREQTA4LTNGOEUtNDBGOS1CMzU1LTkyNjQ1Q0I2QTlBMkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGlwcjF2YitnOWU1QGVHcm91cHMuY29tPg==","referencesHeader":"PGlwcjF2YitnOWU1QGVHcm91cHMuY29tPg=="},"prevInTopic":61036,"nextInTopic":61038,"prevInTime":61036,"nextInTime":61038,"topicId":61036,"numMessagesInTopic":0,"msgSnippet":"-=-My son said to me if I was a teenager and you weren t here I would steal all 64 of those diamonds . -=- I m thinking of things that I might have said to","messageBody":"<div id=\"ygrps-yiv-1671938797\">-=-My son said to me &#39;if I was a teenager and you weren&#39;t here I would steal all 64 of those diamonds&#39;. -=-<br/>\n<br/>\nI&#39;m thinking of things that I might have said to one of my eight year olds in a similar circumstance, so this is just brainstorming.  Not all will be equally as valuable, and maybe in your own situation, none of them will be.<br/>\n<br/>\nMaybe....<br/>\n<br/>\nIf you even steal one diamond in the real world, you could go to jail.<br/>\nIf you were a teenager and you were paying for it with your own money, that might be different.<br/>\nI didn&#39;t find this (pay for this, whatever it is) so you could practice cheating.<br/>\nIf you cheat, it makes you a cheater, and that&#39;s not a good way to be.<br/>\nThat other player earned that, and likes that, and it&#39;s not yours.<br/>\nGames have rules, and if you can&#39;t follow the rules you shouldn&#39;t play.<br/>\n<br/>\n-=- The rules on the multiplayer servers are &#39;no griefing&#39; which means no annoying other players - &#39;no stealing&#39; which means no taking items out of other people&#39;s chests, and no entering houses without permission. if you do these things you can be banned.-=-<br/>\n<br/>\nDid he need permission to get into that game, as he&#39;s only 8?  Is he &quot;on your ticket&quot; there?  Did you or he agree to those rules?  Your team&#39;s honor is on the line (your parent/child/family).    If so, he&#39;s causing you to break your word, too.  <br/>\n<br/>\nI hope people who are familiar with Minecraft will come along.<br/>\n<br/>\nAlso, there are games where people can play as a good guy or a bad guy, and that might appeal to him, and he would be &quot;playing right&quot; to do that.  Knights of the Old Republic is the only one I can name at 4:00 in the morning with Marty asleep. :-)  I think there&#39;s a name for that genre or aspect of the game to.  Something about morality?<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":170380942,"authorName":"Lisa","from":"&quot;Lisa&quot; &lt;lisa@...&gt;","profile":"cslisacs","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"griefing","postDate":"1304496939","msgId":61036,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlwcjF2YitnOWU1QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":61037,"prevInTime":61035,"nextInTime":61037,"topicId":61036,"numMessagesInTopic":0,"msgSnippet":"My son is 8.  He enjoys minecraft and I have hooked him up on some multiplayer servers.  The rules on the multiplayer servers are no griefing which means no","messageBody":"<div id=\"ygrps-yiv-71871072\">My son is 8.  He enjoys minecraft and I have hooked him up on some multiplayer servers.  The rules on the multiplayer servers are &#39;no griefing&#39; which means no annoying other players - &#39;no stealing&#39; which means no taking items out of other people&#39;s chests, and no entering houses without permission.  if you do these things you can be banned.<br/>\n<br/>\nMy son likes to steal things from other people&#39;s chests and so far hasn&#39;t been caught.  Him and his friend are calling each other &#39;griefers&#39; - this makes me uncomfortable.  It&#39;s not a role I want him to play.  I have said so to him.<br/>\n<br/>\nMy son said to me &#39;if I was a teenager and you weren&#39;t here I would steal all 64 of those diamonds&#39;.  <br/>\n<br/>\nthis gave me pause - could I be hurting our relationship by asking him not to do this because I am uncomfortable with it?  He understands he may be banned and is willing to take that risk.  Should I try to be ok with it?  <br/>\n<br/>\nwhat do you think?  thanks, Lisa</div>","specialLinks":[]}],"prevTopicId":61156,"nextTopicId":61111}}