{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":9,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Frustrated","postDate":"1144807833","msgId":25122,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgzRjREODkxLUU5MUMtNDNCQS04OUQ3LUQzMDA2RjZERjFGQUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDcuMC4xLjAuMC4yMDA2MDQxMDE0MDM1Mi4wMWJiODJiOEBnYWlhd29sZi5vcmc+","referencesHeader":"PGUxYzh2OCtrNGpkQGVHcm91cHMuY29tPiA8Ny4wLjEuMC4wLjIwMDYwNDEwMTQwMzUyLjAxYmI4MmI4QGdhaWF3b2xmLm9yZz4="},"prevInTopic":25087,"nextInTopic":0,"prevInTime":25121,"nextInTime":25123,"topicId":25057,"numMessagesInTopic":0,"msgSnippet":"[This accidentally went to the owner address instead of the group, but it seems to have been intended for the list.] ================================== If","messageBody":"<div id=\"ygrps-yiv-1213862625\">[This accidentally went to the owner address instead of the group,  <br/>\nbut it seems to have been intended for the list.]<br/>\n<br/>\n==================================<br/>\n<br/>\nIf authoritarian parents could see into their kids, the thoughts they<br/>\nlisten in on would probably feel really awful.  I remember in college<br/>\nthinking it would be nice to be a tree.  Now that&#39;s very odd, I know.<br/>\n  It certainly raises a few questions about me huh?  ;)  I was<br/>\nstruggling hard in those days to keep my head up.  Before then, when I<br/>\nstill lived with my parents, I often wished to be invisible and<br/>\nfantasized what it would be like.  In someone else, those ideas could<br/>\nhave been interesting &quot;what if&#39;s&quot; and nothing more.  In me, they were<br/>\na desire to be elsewhere, anywhere but in my life, my body, on earth.<br/>\n   My upbringing had made existence untenable and painful.  Intro to<br/>\nLife 101, otherwise known as the School of Hard Knocks.<br/>\n<br/>\nI decided very early that I didn&#39;t want to have kids because of my<br/>\nexperience growing up.  Well, the years rolled by, I got a little<br/>\nfreer and I had my own child almost 3 years ago.  I can only say for<br/>\nsure, even now, even being freer than I&#39;ve ever been that I have so<br/>\nmuch work to do to be truly free.  *sigh*  The dance (as Marji aptly<br/>\nnames it) first learned as a child stays with a person the longest,<br/>\nhas the greatest impact on the child, and is the easiest to infect<br/>\nothers, our spouses and children, with.<br/>\n<br/>\nBy all means.  Let&#39;s learn a sweet new dance.  My parents didn&#39;t<br/>\nintend to dance cruelly but it feels cruel even today.  They thought<br/>\nthey were being loving, doing things to me for my own good.  Maybe<br/>\nthey were more loving than their own parents in some ways.  My<br/>\nsiblings could more easily mask their feelings and get on with it than<br/>\nI could.  Speaking of dances, one of my sisters the other day, after I<br/>\nasked what her son wanted to do, said quite confidently &quot;I don&#39;t care<br/>\nwhat *he* thinks.&quot;  She signed him up (accepted a hard won invitation)<br/>\nfor a cotillion-- so he can learn to dance gentleman-like.  I&#39;m sure<br/>\nmy nephew will absolutely hate it with every fiber of his being, not<br/>\nthe least because it&#39;s not really his choice.  Sis tells me that he<br/>\ndoesn&#39;t even know about it yet.  Yikes.  He&#39;s 13.<br/>\n<br/>\nAnyway, there&#39;s often one of my kind in every family.  I think that&#39;s<br/>\none too many.  In my family, there&#39;s two of my<br/>\nnot-coping-with-our-upbringing/ decisions we&#39;ve made/ etc. kind out of<br/>\nfour daughters.  I think that&#39;s WAY too many.  And way too much pain.<br/>\n<br/>\nKathe<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, marji &lt;marji@...&gt; wrote:<br/>\n<br/>\n&gt;&gt;&gt;&gt; It&#39;s interesting, you know.  Most of us parents (there are some<br/>\n&gt;&gt;&gt;&gt;<br/>\nnotable exceptions) are really trying to do the best we can with the<br/>\nknowledge we have (or most importantly, *don&#39;t* have).  Now, as I had<br/>\nmentioned earlier, my folks had a fairly punitive methodology, and my<br/>\nsibs and I got the belt or the switch or the back of a hand a<br/>\nlot.  There was a lot of yelling going on and I was sometimes so<br/>\nscared I peed in my pants!  I was very meek and never yelled back; I<br/>\ncan remember being afraid just to walk past my dad &#39;cause I just<br/>\n*knew* he would hit me (and a lot of times, he did).  Made me just<br/>\nwant to disappear.  So, when I was really little, I did the best I<br/>\ncould to stay out of the way and not call attention to myself (to the<br/>\nextent that I could).  But, when I was a teenager, I was hellish!  I<br/>\nwas still afraid of my folks, so I didn&#39;t back-talk them, but I was<br/>\ndeceptive and sneaky and just plain awful.   What I didn&#39;t realize<br/>\nthen, but do now, was that our relationship was a dance that they<br/>\nactually choreographed.  I responded to their lead, and we all did<br/>\nthe best we could.  In spite of that, it wasn&#39;t really very good.&lt;&lt;&lt;&lt; </span></blockquote></div>","specialLinks":[]},{"userId":96545052,"authorName":"marji","from":"marji &lt;marji@...&gt;","profile":"gaia10921","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Frustrated","postDate":"1144694481","msgId":25087,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcuMC4xLjAuMC4yMDA2MDQxMDE0MDM1Mi4wMWJiODJiOEBnYWlhd29sZi5vcmc+","inReplyToHeader":"PGUxYzh2OCtrNGpkQGVHcm91cHMuY29tPg==","referencesHeader":"PGUxYzh2OCtrNGpkQGVHcm91cHMuY29tPg=="},"prevInTopic":25081,"nextInTopic":25122,"prevInTime":25086,"nextInTime":25088,"topicId":25057,"numMessagesInTopic":0,"msgSnippet":"... It s obvious that you do love your children and that you re looking for help to find another way.  That s really good. ... It s interesting, you know.","messageBody":"<div id=\"ygrps-yiv-1894251448\">At 20:30 4/9/2006, you wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;You have all just made it out like i am<br/>\n&gt;selfish and don&#39;t care about my children as much as my own feelings,<br/>\n&gt;when i wouldn&#39;t be thinking i was making a mistake, or asking for<br/>\n&gt;advice, or even putting conscious thought into my parenting if i was<br/>\n&gt;just selfish and didn&#39;t care about my children.<br/>\n<br/>\n </span></blockquote>It&#39;s obvious that you do love your children and that you&#39;re looking <br/>\nfor help to find another way.  That&#39;s really good.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;If i didn&#39;t love my<br/>\n&gt;children i wouldn&#39;t be staying home with them in the first place. I<br/>\n&gt;stay home because i think it&#39;s better for my kids, not because i&#39;m<br/>\n&gt;lazy or selfish. If i didn&#39;t love my children i wouldn&#39;t be asking for<br/>\n&gt;your opinions in the first place.<br/>\n<br/>\n </span></blockquote>It&#39;s interesting, you know.  Most of us parents (there are some <br/>\nnotable exceptions) are really trying to do the best we can with the <br/>\nknowledge we have (or most importantly, *don&#39;t* have).  Now, as I had <br/>\nmentioned earlier, my folks had a fairly punitive methodology, and my <br/>\nsibs and I got the belt or the switch or the back of a hand a <br/>\nlot.  There was a lot of yelling going on and I was sometimes so <br/>\nscared I peed in my pants!  I was very meek and never yelled back; I <br/>\ncan remember being afraid just to walk past my dad &#39;cause I just <br/>\n*knew* he would hit me (and a lot of times, he did).  Made me just <br/>\nwant to disappear.  So, when I was really little, I did the best I <br/>\ncould to stay out of the way and not call attention to myself (to the <br/>\nextent that I could).  But, when I was a teenager, I was hellish!  I <br/>\nwas still afraid of my folks, so I didn&#39;t back-talk them, but I was <br/>\ndeceptive and sneaky and just plain awful.   What I didn&#39;t realize <br/>\nthen, but do now, was that our relationship was a dance that they <br/>\nactually choreographed.  I responded to their lead, and we all did <br/>\nthe best we could.  In spite of that, it wasn&#39;t really very good.<br/>\n<br/>\nBut, I was talking with my mom recently, and she saw herself as being <br/>\na really crummy mother!  (She definitely did have issues!  No doubt <br/>\nabout that!)  Anyway, her saying that was quite a revelation to <br/>\nme.  I can certainly forgive her and my dad because I know they did <br/>\ntheir best, and I know they loved me and my brother and sister, even <br/>\nif I was sure they hated me back then.  I wonder how different things <br/>\nmight have been if she could have acknowledged that when we (she and <br/>\nmy dad and my brother and my sister and I) were young enough to maybe <br/>\ntake a different path.  I had/have a lot of recovering to do from my <br/>\nkidhood days.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Excuse me for trying to figure out how to do things the right way.<br/>\n<br/>\n </span></blockquote>You&#39;re excused!  :-)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;You are all pointing fingers at me the<br/>\n&gt;way you say i do it to my children.<br/>\n<br/>\n </span></blockquote>But, did you not ask what you could do differently?  Why ask if <br/>\nyou&#39;re not willing to hear the answers?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I don&#39;t see much of a point to this.<br/>\n<br/>\n </span></blockquote>I think it&#39;s great that you asked the questions.  I hope you&#39;ll keep <br/>\nreading and keep asking.  And, don&#39;t take stuff so personally!  As <br/>\nyou pointed out, nobody here really knows you, so nothing can really <br/>\nbe meant personally.  The responses you read weren&#39;t insults or <br/>\naccusations or digs or anything like that.  Folks are just trying to <br/>\nhelp in the best way they can.  It can be really helpful to assume <br/>\nthe best in other folks, not the worst.<br/>\n<br/>\nI hope this has helped a little.<br/>\n<br/>\n~Marji <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":100494168,"authorName":"Faith Weikert","from":"&quot;Faith Weikert&quot; &lt;Weikert3@...&gt;","profile":"weikert_home","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Frustrated","postDate":"1144688453","msgId":25081,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwZGEwMWM2NWNjMCQ1NDkyYzk2MCQwMjAyYThjMEBNb21zQ29tcHV0ZXI+"},"prevInTopic":25076,"nextInTopic":25087,"prevInTime":25080,"nextInTime":25082,"topicId":25057,"numMessagesInTopic":0,"msgSnippet":"==It seems to me that most of you just want to criticize me, instead of offering better solutions. Oh love my children more, well gee that s what i m trying to","messageBody":"<div id=\"ygrps-yiv-1826440685\">==It seems to me that most of you just want to criticize me, instead of<br/>\noffering better solutions. Oh love my children more, well gee that&#39;s<br/>\nwhat i&#39;m trying to do. Listen to them, that&#39;s why i ask them<br/>\nquestions. This doesn&#39;t seem like much of a support group to me if you<br/>\naren&#39;t going to be supportive. ===<br/>\n<br/>\nThey are being supportive by offering ways for you to look at what habits you have and examine them more closely.  This is not a means to put YOU down personally, just a challenge to see if there could be a different way.<br/>\n<br/>\n===You have all just made it out like i am selfish and don&#39;t care about my children as much as my own feelings,when i wouldn&#39;t be thinking i was making a mistake, or asking foradvice, or even putting conscious thought into my parenting if i was just selfish and didn&#39;t care about my children. ===<br/>\n<br/>\nI didn&#39;t read any posts that stated you didn&#39;t care about your children.  I read that you need to learn to show them differently than you have been in the past.<br/>\n<br/>\n===I didn&#39;t post here to find a way to make my kids let me have an easier life.===<br/>\n<br/>\nBy unschooling the way being suggested here, you will find EVERYONE especially your children will have an easier life.  Not a bad thing!  :-)<br/>\n<br/>\n==I had many differnet topics relating to unschooling i wanted to ask questions<br/>\nabout. Punishment just happened to be the first thing i posted about<br/>\nbecause of the articles i had been reading. If i didn&#39;t love my<br/>\nchildren i wouldn&#39;t be staying home with them in the first place. I<br/>\nstay home because i think it&#39;s better for my kids, not because i&#39;m<br/>\nlazy or selfish. If i didn&#39;t love my children i wouldn&#39;t be asking for<br/>\nyour opinions in the first place. Excuse me for trying to figure out<br/>\nhow to do things the right way. ===<br/>\n<br/>\nRe-read the responses that were sent.  ...But only After you have taken a bubble bath or meditated or come in from gardening or any other activity you do to feed YOU.  Then be objective and see if maybe the responses are an effort to help you learn how to &#39;do things the right way&#39;.<br/>\n<br/>\n<br/>\n===You are all pointing fingers at me the way you say i do it to my children.===<br/>\n<br/>\nNo one is pointing fingers at YOU just your actions.  They are hoping to help you feel what your children may be feeling by the way they are being handled.  Sometimes the truth is painful to hear.  And change is difficult because it requires us to examine ourselves and accept our faults.<br/>\n<br/>\n<br/>\n=== I don&#39;t appreciate the accuasations: Did you look at bugs with them? Sounds like you just want them out of your hair. You don&#39;t know enough about me to assume things like that. I do things with my children. Little boys need to throw things, so let&#39;s go to the park? I don&#39;t have a car, so during the week that&#39;s not an option. i do have a backyard, and they can throw things out there all they want.===<br/>\n<br/>\nThese are not accusations.  They are questions.  <br/>\n<br/>\n=== I don&#39;t see much of a point to this. ===<br/>\n<br/>\nTry again when you can look at this from a different plane.  No problem can be solved from the place it was created.  You will have to get to a different place.  Good luck with the process and this group will support it!  <br/>\n<br/>\nFaith<br/>\n<br/>\n<br/>\n<br/>\nHealth and laughter,<br/>\n<br/>\nFaith G. Weikert<br/>\nYour Sales Director <br/>\nwith The Pampered Chef<br/>\n856/810-9912<br/>\nwww.pamperedchef.biz/faithweikert<br/>\n<br/>\n&#39;Learn to love, respect and enjoy other people.&#39;<br/>\n-- Dale Carnegie <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":197017321,"authorName":"Tracey Inman","from":"&quot;Tracey Inman&quot; &lt;traceyi@...&gt;","profile":"tracey_inman","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Frustrated","postDate":"1144678712","msgId":25076,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PE5MRUNJT0ZJS0RHSk5PUEpQS0RNSUVGQ0NIQUEuVHJhY2V5SUBzY2NvYXN0Lm5ldD4="},"prevInTopic":25068,"nextInTopic":25081,"prevInTime":25075,"nextInTime":25077,"topicId":25057,"numMessagesInTopic":0,"msgSnippet":"... Keep saying, You ve given me a lot to think about  Then think about it. It will make your life much better, and will save your children.","messageBody":"<div id=\"ygrps-yiv-839187507\"><blockquote><span title=\"ireply\">&gt;&gt;Try not to be defensive.  Take what you can manage and leave the rest.<br/>\n </span></blockquote>Keep saying, &quot;You&#39;ve given me a lot to think about&quot;  Then think about it.<br/>\nIt will make your life much better, and will save your children.&lt;&lt;<br/>\n<br/>\nI agree with this statement.  Unschooling is such a paradigm shift for most<br/>\nof us.  I still struggling with myself and how I react to my children.  I<br/>\nread a whole lot more than I post.  I read carefully and ask myself the hard<br/>\nquestions.  There are times I dont like my own answers.  We tend to get<br/>\ndefensive when there is something within us that really does need<br/>\naddressing.<br/>\n<br/>\nI realized last week that I have been hard on my 10yo dd. Why? Because I<br/>\nwant her to have better eating habits and not raise her voice while she<br/>\ncomplains that everyone is out to get her.  I could kick myself at times<br/>\nbecause I do loose my temper and say things I have to go back and apologize<br/>\nfor.  As far as the eating, she is overweight and never feels good.  Always<br/>\ncomplains of being tired.  She will spend all day on the couch if I dont<br/>\nencourage her to go outside and play or go for a walk around the hay field<br/>\nwith me and her sister, etc.  After reading A LOT on several lists I am on,<br/>\nI realized I was making way too big a deal about this eating thing.  I went<br/>\nto Costco and bought a vegetable tray and lots of fresh fruit.  I am<br/>\nbeginning to show her how to read labels when she asks me if a particular<br/>\nselection is good to eat.  I realize that her lack of self-esteem is partly<br/>\ndue to my reactions to her about several things.  Now for a mom who is<br/>\nreally trying hard to be a better parent than what she had growing up, that<br/>\nwas a hard pill to swallow.<br/>\n<br/>\nMy girls tend to argue quit a bit.  I am working on how I respond.  The main<br/>\nthing is not pouring on the guilt to get the results I want.<br/>\n<br/>\nI dont want to ramble.  I hope you will take some time to really assess<br/>\nwhere YOU are.  Perhaps journaling would help you take a better outside look<br/>\nat some of this.  When I journal and go back later to read what I wrote, I<br/>\nget a different perspective on things.  Just remember, it really isnt about<br/>\nyour children.<br/>\n<br/>\nLife is a journey.  Be patient with yourself and others around you.<br/>\n<br/>\n~Tracey I. - in S.C. (mom to Rachael 13 & Madison 10)<br/>\n<br/>\n<br/>\n--<br/>\nNo virus found in this outgoing message.<br/>\nChecked by AVG Free Edition.<br/>\nVersion: 7.1.385 / Virus Database: 268.4.0/306 - Release Date: 4/9/2006<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":121102410,"authorName":"Bling Williams","from":"Bling Williams &lt;bobalinga@...&gt;","profile":"bobalinga","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Frustrated","postDate":"1144660735","msgId":25068,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwNDEwMDkxODU1LjI0Njc3LnFtYWlsQHdlYjMzNzEzLm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PGUxYzh2OCtrNGpkQGVHcm91cHMuY29tPg=="},"prevInTopic":25065,"nextInTopic":25076,"prevInTime":25067,"nextInTime":25069,"topicId":25057,"numMessagesInTopic":0,"msgSnippet":"I think that often when you are tired or trying to change then solutions and ideas can seem like critisism and more problems. Change is hard. I remember many","messageBody":"<div id=\"ygrps-yiv-193705590\">I think that often when you are tired or trying to change then solutions and ideas can seem like critisism and more problems.<br/>\n  Change is hard.<br/>\n  I remember many years ago when I asked about punishment. I didn&#39;t want to spank so i asked about taking away their TV time or computer games and it took me ages to see that punishment like that is wrong too. It might not be spanking but it was all about imposing my adult power (I;m bigger n stronger) on kids in order to have my own way. It wasn&#39;t taking into account them at all.<br/>\n  Its much more effort to be creative and sometimes when they are squabbling I know it would be easier to yell etc rather than find out if they are bored or if somethings up.<br/>\n  Things ain&#39;t perfect by any means, We still don&#39;t like in a Walton&#39;s type house but its fairer. The kids tell me when I&#39;m being unreasonable and suggest creative ways to stop me being bored and cranky!<br/>\n   <br/>\n  S<br/>\n<br/>\nlilith_pouia &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:lilith_pouia@...\">lilith_pouia@...</a>&gt; wrote:<br/>\n  It seems to me that most of you just want to criticize me, instead of<br/>\noffering better solutions. Oh love my children more, well gee that&#39;s<br/>\nwhat i&#39;m trying to do. Listen to them, that&#39;s why i ask them<br/>\nquestions. This doesn&#39;t seem like much of a support group to me if you<br/>\naren&#39;t going to be supportive. You have all just made it out like i am<br/>\nselfish and don&#39;t care about my children as much as my own feelings,<br/>\nwhen i wouldn&#39;t be thinking i was making a mistake, or asking for<br/>\nadvice, or even putting conscious thought into my parenting if i was<br/>\njust selfish and didn&#39;t care about my children. I didn&#39;t post here to<br/>\nfind a way to make my kids let me have an easier life. I had many<br/>\ndiffernet topics relating to unschooling i wanted to ask questions<br/>\nabout. Punishment just happened to be the first thing i posted about<br/>\nbecause of the articles i had been reading. If i didn&#39;t love my<br/>\nchildren i wouldn&#39;t be staying home with them in the first place. I<br/>\nstay home because i think it&#39;s better for my kids, not because i&#39;m<br/>\nlazy or selfish. If i didn&#39;t love my children i wouldn&#39;t be asking for<br/>\nyour opinions in the first place. Excuse me for trying to figure out<br/>\nhow to do things the right way. You are all pointing fingers at me the<br/>\nway you say i do it to my children. I don&#39;t appreciate the<br/>\naccuasations: Did you look at bugs with them? Sounds like you just<br/>\nwant them out of your hair. You don&#39;t know enough about me to assume<br/>\nthings like that. I do things with my children. Little boys need to<br/>\nthrow things, so let&#39;s go to the park? I don&#39;t have a car, so during<br/>\nthe week that&#39;s not an option. i do have a backyard, and they can<br/>\nthrow things out there all they want. I don&#39;t see much of a point to<br/>\nthis. <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n    <br/>\n---------------------------------<br/>\n  YAHOO! GROUPS LINKS <br/>\n<br/>\n    <br/>\n    Visit your group &quot;AlwaysLearning&quot; on the web.<br/>\n    <br/>\n    To unsubscribe from this group, send an email to:<br/>\n <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning-unsubscribe@yahoogroups.com\">AlwaysLearning-unsubscribe@yahoogroups.com</a><br/>\n    <br/>\n    Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n    <br/>\n---------------------------------<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n&quot;Every gun that is made, every warship launched, every rocket fired, signifies in a final sense a theft from those who hunger and are not fedthose who are cold and are not clothed. This world in arms is not spending its money aloneit is spending the sweat of its laborers, the genius of its scientists, the hopes of its children.&quot; Dwight Eisenhower, Speech (1953)<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://nobravery.cf.huffingtonpost.com/\">http://nobravery.cf.huffingtonpost.com/</a><br/>\n\t\t<br/>\n---------------------------------<br/>\nBlab-away for as little as 1¢/min. Make  PC-to-Phone Calls using Yahoo! Messenger with Voice.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":116488337,"authorName":"Gold Standard","from":"&quot;Gold Standard&quot; &lt;jacki@...&gt;","profile":"jackiknouse","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] Frustrated","postDate":"1144654283","msgId":25065,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFBLRUhKR0NJR05QUEFCRlBCS0xHQ0VKTUNKQUIuamFja2lAYm9hcmRwcmVwLm5ldD4=","inReplyToHeader":"PGUxYzh2OCtrNGpkQGVHcm91cHMuY29tPg=="},"prevInTopic":25061,"nextInTopic":25068,"prevInTime":25064,"nextInTime":25066,"topicId":25057,"numMessagesInTopic":0,"msgSnippet":"... Hi Lilith, Warm hugs to you as you wade through this information :o) There isn t a person on this list who knows you in any way except the way you have","messageBody":"<div id=\"ygrps-yiv-1673212059\"><blockquote><span title=\"ireply\">&gt;&gt;It seems to me that most of you just want to criticize me, instead of<br/>\n&gt;&gt;offering better solutions.&lt;&lt;<br/>\n<br/>\n </span></blockquote>Hi Lilith,<br/>\n<br/>\nWarm hugs to you as you wade through this information :o)<br/>\n<br/>\nThere isn&#39;t a person on this list who knows you in any way except the way<br/>\nyou have described your situations and how you handle them.<br/>\n<br/>\nPeople have attacked the things that you have said and done in the<br/>\nsituations you described because the things you were saying and doing were<br/>\ndrastically away from where unschooling lives and breathes. All of the<br/>\nadvice, though on the surface may seem derogatory, are actually useful<br/>\nthings to ponder and try. Make a cup of tea, breathe deep, and read through<br/>\nthem again. Try them on for a moment. Try to read them as if they were<br/>\nwritten to someone other than you. It is not personal to you. It is directed<br/>\nat the behaviors. Just take the suggestions for change if you like, and<br/>\ndisregard the rest for now. We all know that you working through things and<br/>\ntrying to get good advice, and no one is thinking you are a monster.<br/>\n<br/>\nFWIW, my 17 yo has been breaking pencils for years. It wasn&#39;t until I broke<br/>\na few pencils myself that I saw what the attraction was. It is a very<br/>\nsatisfying feeling to break a pencil! He lately has been disassembling<br/>\npens...pen pieces all over the house sometimes. He eventually picks them up,<br/>\nif I haven&#39;t done so already. Usually.<br/>\n<br/>\nI don&#39;t get as much satisfaction out of disassembling the pens though...he<br/>\ngets something out of it. He doesn&#39;t tell me though. It&#39;s a secret :-)<br/>\n<br/>\nHe respects people deeply, and treats animals and plants with love and care.<br/>\n<br/>\nJust loves to break pencils. He bought a replacement box recently for the<br/>\nfirst time on his own. That was to replace a bunch he had used. Very<br/>\nthoughtful I thought.<br/>\n<br/>\n<br/>\nJacki, who has learned to happily appreciate the value of breaking things<br/>\n<br/>\nAndrew 17, Max 16, Hannah 13, Cameron 12</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"7"},"subject":"Re: [AlwaysLearning] Frustrated","postDate":"1144636795","msgId":25061,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU3NzAwNDlBLTE1OTctNDQ4OS1BNDVGLTU2M0I0QjQ2ODU0MkBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGUxYzh2OCtrNGpkQGVHcm91cHMuY29tPg==","referencesHeader":"PGUxYzh2OCtrNGpkQGVHcm91cHMuY29tPg=="},"prevInTopic":25060,"nextInTopic":25065,"prevInTime":25060,"nextInTime":25062,"topicId":25057,"numMessagesInTopic":0,"msgSnippet":"... We re being supportive of your stated desire to do better. We re being supportive of your children. Sandra","messageBody":"<div id=\"ygrps-yiv-1994397138\">On Apr 9, 2006, at 6:30 PM, lilith_pouia wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; This doesn&#39;t seem like much of a support group to me if you<br/>\n&gt; aren&#39;t going to be supportive.<br/>\n<br/>\n </span></blockquote>We&#39;re being supportive of your stated desire to do better.<br/>\nWe&#39;re being supportive of your children.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":202326349,"authorName":"Tami","from":"&quot;Tami&quot; &lt;atj090@...&gt;","profile":"jamitory","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] Frustrated","postDate":"1144636474","msgId":25060,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENORURKSUJIRUdGSUFEQUFQT0ROQ0VKQkNFQUEuYXRqMDkwQGdhbGF4eS5vY24ubmUuanA+","inReplyToHeader":"PGUxYzh2OCtrNGpkQGVHcm91cHMuY29tPg=="},"prevInTopic":25057,"nextInTopic":25061,"prevInTime":25059,"nextInTime":25061,"topicId":25057,"numMessagesInTopic":0,"msgSnippet":"... offering better solutions. Oh love my children more, well gee that s what i m trying to do.     You are all pointing fingers at me the way you say","messageBody":"<div id=\"ygrps-yiv-1433265497\"><blockquote><span title=\"ireply\">&gt;&gt; It seems to me that most of you just want to criticize me, instead of<br/>\n </span></blockquote>  offering better solutions. Oh love my children more, well gee that&#39;s<br/>\n  what i&#39;m trying to do.  &lt;&lt;snip&gt;&gt;   You are all pointing fingers at me the<br/>\nway you say i do it to my children. I don&#39;t appreciate the<br/>\n  accuasations: Did you look at bugs with them? Sounds like you just   want<br/>\nthem out of your hair. You don&#39;t know enough about me to assume   things<br/>\nlike that. I do things with my children. Little boys need to   throw things,<br/>\nso let&#39;s go to the park? I don&#39;t have a car, so during   the week that&#39;s not<br/>\nan option. i do have a backyard, and they can   throw things out there all<br/>\nthey want. I don&#39;t see much of a point to   this.  &lt;&lt;&lt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n   You&#39;re getting really defensive...nobody is criticizing you...people ARE<br/>\noffering suggestions.  We&#39;re asking you to step outside of yourself, away<br/>\nfrom how you&#39;ve always done things...and try something new.<br/>\n<br/>\n  We only know of you what you&#39;ve given us, and are making suggestions and<br/>\nobservations based on that information.<br/>\n<br/>\n  If you don&#39;t want suggestions, maybe don&#39;t ask for them.  This list is not<br/>\nso much a support group.  It&#39;s for discussion, and what you read here is<br/>\nSUPPOSED to challenge you to refine your relationships...with your kids,<br/>\nwith yourself maybe.<br/>\n<br/>\n  I think the most important thing that people have offered you is the<br/>\nhardest for you to accept:  we&#39;re telling you how your kids see you and your<br/>\nbehavior.  Yes, it&#39;s kind of scary.  But it doesn&#39;t have to be.  Do some<br/>\nreading at Sandra&#39;s site, and Joyce&#39;s site.  Keep reading here.  Read<br/>\n&quot;Unconditional Parenting&quot; by Alfie Kohn.<br/>\n<br/>\n  Try not to be defensive.  Take what you can manage and leave the rest.<br/>\nKeep saying, &quot;You&#39;ve given me a lot to think about&quot;  Then think about it.<br/>\nIt will make your life much better, and will save your children.<br/>\n<br/>\n  Tami, who thinks maybe you need a Pepsi and some chocolate.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":211613748,"authorName":"lilith_pouia","from":"&quot;lilith_pouia&quot; &lt;lilith_pouia@...&gt;","profile":"lilith_pouia","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Frustrated","postDate":"1144629032","msgId":25057,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGUxYzh2OCtrNGpkQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":25060,"prevInTime":25056,"nextInTime":25058,"topicId":25057,"numMessagesInTopic":0,"msgSnippet":"It seems to me that most of you just want to criticize me, instead of offering better solutions. Oh love my children more, well gee that s what i m trying to","messageBody":"<div id=\"ygrps-yiv-1392818250\">It seems to me that most of you just want to criticize me, instead of<br/>\noffering better solutions. Oh love my children more, well gee that&#39;s<br/>\nwhat i&#39;m trying to do. Listen to them, that&#39;s why i ask them<br/>\nquestions. This doesn&#39;t seem like much of a support group to me if you<br/>\naren&#39;t going to be supportive. You have all just made it out like i am<br/>\nselfish and don&#39;t care about my children as much as my own feelings,<br/>\nwhen i wouldn&#39;t be thinking i was making a mistake, or asking for<br/>\nadvice, or even putting conscious thought into my parenting if i was<br/>\njust selfish and didn&#39;t care about my children. I didn&#39;t post here to<br/>\nfind a way to make my kids let me have an easier life. I had many<br/>\ndiffernet topics relating to unschooling i wanted to ask questions<br/>\nabout. Punishment just happened to be the first thing i posted about<br/>\nbecause of the articles i had been reading. If i didn&#39;t love my<br/>\nchildren i wouldn&#39;t be staying home with them in the first place. I<br/>\nstay home because i think it&#39;s better for my kids, not because i&#39;m<br/>\nlazy or selfish. If i didn&#39;t love my children i wouldn&#39;t be asking for<br/>\nyour opinions in the first place. Excuse me for trying to figure out<br/>\nhow to do things the right way. You are all pointing fingers at me the<br/>\nway you say i do it to my children. I don&#39;t appreciate the<br/>\naccuasations: Did you look at bugs with them? Sounds like you just<br/>\nwant them out of your hair. You don&#39;t know enough about me to assume<br/>\nthings like that. I do things with my children. Little boys need to<br/>\nthrow things, so let&#39;s go to the park? I don&#39;t have a car, so during<br/>\nthe week that&#39;s not an option. i do have a backyard, and they can<br/>\nthrow things out there all they want. I don&#39;t see much of a point to<br/>\nthis.</div>","specialLinks":[]}],"prevTopicId":25114,"nextTopicId":25127}}