{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":67247159,"authorName":"Nanci Kuykendall","from":"Nanci Kuykendall &lt;aisliin@...&gt;","profile":"aisliin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"[AlwaysLearning] sleeping/bedtimes etc","postDate":"1072596225","msgId":17725,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMxMjI4MDcyMzQ1LjMzODY5LnFtYWlsQHdlYjEzNzA0Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDEwNzIyMjUxMTkuMzA0My44NjQ0NC5tMTFAeWFob29ncm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":17724,"nextInTime":17726,"topicId":17725,"numMessagesInTopic":0,"msgSnippet":"Interesting discussion. ... I think one word in this sentance says it all. Enforcing.  I certainly don t want to live in a home where I feel that other people","messageBody":"<div id=\"ygrps-yiv-1846943145\">Interesting discussion.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Now about the not enforcing a bedtime - WHY??? <br/>\n<br/>\n </span></blockquote>I think one word in this sentance says it all. <br/>\nEnforcing.  I certainly don&#39;t want to live in a home<br/>\nwhere I feel that other people are &quot;enforcing&quot; things<br/>\nupon me, and so I don&#39;t subject my children to that<br/>\nsort of behavior.  Around here we talk about issues<br/>\nwhere we might be in disagreement and try to reach<br/>\nsolutions that appease everyone.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Your kids do not need you to help them sleep and you<br/>\n&gt;being there probably actually keeps them from<br/>\n&gt;sleeping well.&lt;&lt;<br/>\n<br/>\n </span></blockquote>With one of my sons (not &quot;special needs&quot;) this is<br/>\ntrue.  He doesn&#39;t need to sleep with us and if he<br/>\nfalls asleep in our bed he will either wake up and<br/>\nmove himself to his own bed, or wake up and ask for<br/>\nhelp moving to his own bed.  He sleeps better through<br/>\nthe night in his own bed and he knows it.  He&#39;s still<br/>\nafraid of the dark though, and he still likes to fall<br/>\nasleep with us, or cuddle with us until he is very<br/>\nsleepy and then shuffle off to his own bed.  He&#39;s 5.<br/>\n<br/>\nOur older son (7) does have nightmares and night<br/>\nterrors, needs the physical comfort of being next to<br/>\none of us while he falls asleep, and sometimes needs<br/>\nto sleep with us all night.  Usually we move him to<br/>\nhis own bed after he is asleep, which he doesn&#39;t mind,<br/>\nor his Daddy lies down with him in his bed until he<br/>\ngoes to sleep.  He doesn&#39;t like for me to do that,<br/>\njust Daddy, as they have a special bond.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; It is not against the unschooling train of thought<br/>\n </span></blockquote>to insist that <br/>\nyour <br/>\nchildren be in their rooms by a certain time each<br/>\nnight.&lt;&lt;<br/>\n<br/>\nIf Unschooling (damned insufficient word) is a<br/>\nlifestyle choice, NOT an educational style, per se;<br/>\nthen I disagree with this statement.  &quot;Insisting&quot; that<br/>\nthe kids be banished to their rooms after a certain<br/>\ntime, on room arrest as it were, regardless of their<br/>\nwills, desires, or plans for the evening, is not<br/>\nrespectful of them as people.  Treating kids as second<br/>\nclass citizens and subservient members of the family,<br/>\nsubject to your whims, is not in sync with an<br/>\n&quot;unschooling train of thought.&quot;  Saying that you<br/>\n&quot;insist&quot; in the first place implies that you have some<br/>\nleverage you are using in order to bend them to your<br/>\nwill.  How will that be accomplished in a respectful<br/>\nand unschooly manner?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; We remind him about 7 everynight that it is about<br/>\n&gt;&gt;time for bed,<br/>\n<br/>\n </span></blockquote>So at seven every night he is reminded that he is not<br/>\nallowed free will in the simple act of knowing when he<br/>\nis tired and acting accordingly.  I&#39;m not trying to be<br/>\nsnipey, just translating how it would feel to ME if I<br/>\nwere in his shoes.  I HAVE often been in such a<br/>\ncircumstance as a child myself, and that IS how I<br/>\nfelt.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; he knows the routine...<br/>\n<br/>\n </span></blockquote>Routines are fine, kids often find it comforting to<br/>\nknow what comes next, and a routine can help even many<br/>\nadults wind their minds down for sleep.  But this is<br/>\nyour imposed routine, which includes the threat of not<br/>\ngetting the special time for story with you if he<br/>\nfails to toe the line.  It all sounds very scary to<br/>\nme.<br/>\n<br/>\nAround here we don&#39;t sweat the small stuff.  We try to<br/>\nmake sure teeth get brushed before hubby and I go to <br/>\nbed, because they like our help.  We also make sure<br/>\nthey have something comfortable on to sleep in before<br/>\nwe go to bed, whether that is boxer shorts, a long<br/>\nt-shirt, sweats, pajamas (they do have them) or<br/>\nwhatever.  If they are still playing or watching a<br/>\nshow or something when we are ready to crash, we tell<br/>\nthem we are headed to bed and if they want a story<br/>\nthey better come get it while they can, or we&#39;ll be<br/>\nasleep.  <br/>\n<br/>\nSometimes they choose to pile into bed with us and<br/>\nfall asleep with us.  Sometimes they choose to get a<br/>\nstory or two while the getting is good and then go<br/>\nback to their play.  Sometimes they choose to forgo<br/>\nthe story and finish their movie, or whatever.  They<br/>\nusually don&#39;t stay up long after we are in bed, but I<br/>\nimagine that will change as they get older.  My point<br/>\nin sharing this though, is that it is THEIR choice. <br/>\nWe get our needs met by going to bed when we need to,<br/>\nand they go to bed when they need to.  Sometimes it&#39;s<br/>\nthe same time, occassionally they fall asleep early<br/>\nbecause they are tired, like last night, and sometimes<br/>\nthey stay up a little later.<br/>\n<br/>\nNanci K.</div>","specialLinks":[]}],"prevTopicId":17660,"nextTopicId":13870}}