{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":67247159,"authorName":"Nanci Kuykendall","from":"Nanci Kuykendall &lt;aisliin@...&gt;","profile":"aisliin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"[AlwaysLearning] Teen Update","postDate":"1135994277","msgId":23629,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUxMjMxMDE1NzU3Ljc5MjIzLnFtYWlsQHdlYjUxOTE0Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDExMzU4MDUwNDcuMzkzLjIzNjQzLm0xOEB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":23628,"nextInTime":23630,"topicId":23629,"numMessagesInTopic":0,"msgSnippet":"Well, we sat down and had a long talk with Nicole on the same night when I first posted here about the problems we were having with her.  It was a very ","messageBody":"<div id=\"ygrps-yiv-1335460929\">Well, we sat down and had a long talk with Nicole on<br/>\nthe same night when I first posted here about the<br/>\nproblems we were having with her.  It was a very<br/>\nemotional but overall productive discussion, which<br/>\nwent on long into the night.<br/>\n<br/>\nI do think depression played a part, and I also think<br/>\nsome inability on her part to see how she was<br/>\naffecting those around her played a part.  There were<br/>\nalso some misinterpretations on our part of her<br/>\nbehaviors, where her motivations and thoughts/feelings<br/>\nwere not as selfish or negative as her actions<br/>\nappeared in some things, but her total lack of<br/>\ncommunication left us in the dark about what was<br/>\nreally going on with her. <br/>\n<br/>\nThroughout the discussion there were many tears from<br/>\nher and she expressed a great deal of remorse and<br/>\nanger with herself for having caused us pain, stress,<br/>\nand unhappiness.  During different points where we<br/>\nasked her to visualize/role play herself in our<br/>\nposition, with a friend, relative, roomate or<br/>\nwhatever, and how she would handle things, as well as<br/>\nasking what she needed herself, she repeatedly<br/>\nexpressed a desire to be pushed, encouraged, prodded,<br/>\ndirected or how she would do the same in our position.<br/>\n She asked for more specific instructions and requests<br/>\non how/when/what to do to help out, more prodding and<br/>\npushing to get her driving and working, more help and<br/>\nencouragement to get more independent.  She needs more<br/>\nstructure.  So we&#39;re working with her to that effect.<br/>\n<br/>\nWe asked her also to work on being more communicative<br/>\nand forthcoming, sharing her thoughts, spending more<br/>\nfamily time with us and volunteer information without<br/>\nneeding to be quizzed and have things pried out of<br/>\nher.  We pointed out that, as she&#39;s well aware and<br/>\nwe&#39;ve heard her say, relationships take work, and<br/>\nfamily relationships are no different, particularly<br/>\nfamily that you live with.  We talked about ways to<br/>\nhelp her have quiet time to herself when she needed<br/>\nit, as she gets overstimulated easily.<br/>\n<br/>\nShe also shared with us some of the difficulties she&#39;s<br/>\nhaving with learning to live with our special needs<br/>\nkids.  One thing she said was &quot;I don&#39;t think most<br/>\npeople have any idea how hard this is, just to live in<br/>\nthe same house with them, let alone be their parents. <br/>\nI&#39;m learning how, and I love to be with them, but it&#39;s<br/>\nhard.&quot;  As she has many of the same difficulties that<br/>\nthe boys have, she&#39;s also learning a lot about herself<br/>\nand her own needs by living with them.<br/>\n<br/>\nShe expressed an overall lethargy and trouble sleeping<br/>\nand we pointed out how these and other things she was<br/>\ndoing are symptoms of depression.  We also suggested<br/>\nshe get more physical excercise during the day as a<br/>\npossible mental/physical/chemical lift and to help her<br/>\nsleep better.  Living far North, we also pointed out<br/>\nthat lack of daylight exposure is bad for the body and<br/>\ncan lead to depression (Seasonal Affected Disorder is<br/>\ncommon here) and that staying locked a lightless room<br/>\nuntil 2PM when it get&#39;s dark at 4pm was not good for<br/>\nher in that area either.<br/>\n<br/>\nWe talked about how we thought it was unfair that so<br/>\nmuch of her energy was going into online and long<br/>\ndistance relationships and almost none was going to<br/>\nher family here that she lived with.  She thought that<br/>\nwas a fair point and has made a so far total reversal<br/>\nof that dynamic!  <br/>\n<br/>\nSandra: in answer to your question, when I mentioned<br/>\nthat she was making long distance calls it didn&#39;t have<br/>\nanything to do with expense or being irritated about<br/>\nit, I was just pointing out that she had no local<br/>\nfriends or social exchanges at all, they were all far<br/>\naway.  I don&#39;t think that&#39;s a good thing.<br/>\n<br/>\nSince we talked the other day she&#39;s asked for and been<br/>\ntaken out job hunting, made a resume, asked for and<br/>\nrecieved help filling out applications, made plans<br/>\nwith us for further job hunting forays, studied her<br/>\ndriver&#39;s test booklet and made plans to go out for<br/>\ndriving practice with us.  She&#39;s talked with us a lot<br/>\nabout good places to apply for work and has visited a<br/>\nlocal state work assistance office to get help with<br/>\nher resume, tips on interviews and job leads.  <br/>\n<br/>\nThe difference in her participation in family<br/>\nactivites and chores has also been dramatic.  She not<br/>\nonly attended Thomas&#39; birthday party, but was present<br/>\nthe entire time, conversed and socialized with the<br/>\nadults present, helped cook and clean up cheerfully. <br/>\nWe thanked her for being there and for helping out so<br/>\nmuch.  We have always thanked her for helping out but<br/>\nnow there&#39;s more to thank her for, more often.  We<br/>\nwere always open about telling her we loved her and<br/>\nbeing physically affectionate but now she&#39;s openly<br/>\nreciprocating and initiating those exchanges too!<br/>\n<br/>\nWe&#39;re planning at least a couple nights a week to play<br/>\ngames or do other social things together as a family<br/>\nwith her.  She&#39;s spending more time chatting with us. <br/>\nShe leaves the door open more at night after 8pm into<br/>\nthe study as an unspoken invitation to be more social<br/>\nwith her when she&#39;s in there.  She&#39;s getting up<br/>\ndramatically earlier too (by 9-10 AM so far) and<br/>\ntaking care of daily chores like dishes and the<br/>\nlitterbox right away in the morning.  She&#39;s smiling<br/>\nand laughing more now and we&#39;re all noticing how much<br/>\nthat was absent.  Last night she comfortably joined us<br/>\nas we all piled onto the loft to watch the movie<br/>\nThomas got from us for his birthday (Fantastic 4 =<br/>\nfun/funny confection of a superhero action movie.)<br/>\n<br/>\nNow I have felt the need to mention to her not to burn<br/>\nherself out by overdoing it, which is an ironic and<br/>\ndramatic change!  I don&#39;t want her to start feeling<br/>\nlike the cinderella of the house, but to find a happy<br/>\nmedium where everyone is feeling their needs are met. <br/>\nThings proceed well as she works to discover her place<br/>\nin the home and family and world.  Thank you to<br/>\neveryone for your thoughts and advice!<br/>\n<br/>\nNanci K.</div>","specialLinks":[]}],"prevTopicId":23627,"nextTopicId":23625}}