{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":35,"messages":[{"userId":332164648,"authorName":"Rippy and Graham Dusseldorp","from":"Rippy and Graham Dusseldorp &lt;ripgray@...&gt;","profile":"rdusseldorp","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] help supporting daughter with letting go","postDate":"1359891302","msgId":70452,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIyRjAxMkNCLURENTQtNDI3MC1CODAyLTBGMkM3RTVBNzAxNkBnbWFpbC5jb20+","inReplyToHeader":"PDI2RTYxMTZGLTE2OTQtNDg5OC1CQjc1LUM1NjAzNTY5NTJDNkBnbWFpbC5jb20+","referencesHeader":"PENBQzZTN1I3Yz03cjlkSzI5UFVLNHMxRFJRQUh2SnRQdUxWZTdlVHBRZjk3ODdXSFI3Z0BtYWlsLmdtYWlsLmNvbT4gPDI2RTYxMTZGLTE2OTQtNDg5OC1CQjc1LUM1NjAzNTY5NTJDNkBnbWFpbC5jb20+"},"prevInTopic":70450,"nextInTopic":70453,"prevInTime":70451,"nextInTime":70453,"topicId":70397,"numMessagesInTopic":0,"msgSnippet":"-=-  I struggle with anxiety. My grandmother and mom both always jump to the worst case scenario and worry about it. I do the same. A headache could be a brain","messageBody":"<div id=\"ygrps-yiv-553152405\">-=-  I struggle with anxiety. My grandmother and mom both always jump to the worst case scenario and worry about it. I do the same. A headache could be a brain tumor. Sirens in the distance must mean a loved one got into an accident.  -=-<br/>\n<br/>\nI am like this too :-/<br/>\n<br/>\nI am an INFJ according to the Myers-Briggs personality type. In Janet Penley&#39;s book, MotherStyles, the author writes that the INFJ mom has a &quot;tendency to take an isolated fact and extrapolate a catastrophic outcome&quot;. It helped me when I read that. Accepting that this is part of who I am - a person who is at times flooded with irrational thoughts - helps me move past anxiety and helps me calm myself.<br/>\n<br/>\nOne of the ways that helps me be calm is to try to recognize the absurdity of some of my thoughts. A few years ago we saw an episode of Little House on the Prairie where three year old Carrie falls into an abandoned mineshaft and everyone thinks she died. With tears streaming down my face, I had a panic attack when I realized I had not even thought of checking our neighbourhood and playgrounds for old mineshafts that could possibly trap and kill both my children. It probably took a good five minutes for me to properly calm down and assess the situation realistically. Having a sense of humor and being able to laugh at myself when thoughts go to the extreme helps.<br/>\n<br/>\nMuch like Sandra, I have tools that I use when I sense I am slipping into a pattern of depressing thoughts. I have a playlist of happy, high energy, cannot help but dance and jump around songs on my iPod. I save youtube links of favourite stand up comedians on my computer. I always make sure there are some funny shows or movies that I have easy access to. I declare war on Gianluca and Gisele and have a pillow/water gun/tickle fight with them. I play Wii Just Dance or Glee Karaoke Revolution with the children or go on long bike rides with them to the beach. I take a long bath at night with candles. I breathe deeply. I count my blessings. Sometimes when I really cannot seem to get past it, I lie down on the floor and melodramatically moan &#39;why me?&#39;. Other times, I talk to Graham about all the ways I am sure that our beautiful world is about to come to a crushing end and he listens patiently, makes me tea and gives me a foot rub. I have also taken the homeopathic Bach Rescue Remedy when I have felt really anxious. All of these things have helped me at one time or another with anxiety.<br/>\n<br/>\nWhat helps comfort me personally is my faith. I read scriptures and poetry. I pray. I listen to kirtan (Sikh hymns). I watch/read/listen to inspiring stories about people who do extraordinarily beautiful and kind things. When I was 14 years old, I asked the leader of the Sikh ashram I was visiting what to do when I am feeling blue and he told me the scriptures advise meditation, service and giving gratitude. He told me that it is also the same advice for when you are happy.<br/>\n<br/>\nThis all helps me keep my cup full. That is what works best for me - keeping my cup full of positive, inspired, happy energy as much as possible. Life has its ups and downs, but I like to focus more on the ups and put myself in the best possible position to help myself out when I am down. I am more sensitive than most people, and I feel very deeply. If I had not learned early in life how to deal with my lows, life might not have been as wonderful as it has been. <br/>\n<br/>\nOften I need to reevaluate my life to see if there is anything that is unnecessarily stressful. Sometimes for me this has meant distancing myself from friendships that are leaving me more drained than replenished. It means staying away from negative people, news, and energy. I avoid sad movies and if I do decide to watch one, I read the ending and prepare myself for all the bad stuff that is going to happen. I read up on the actors and their real life relationships and assure myself that the movie is all pretend and that they are happy and healthy people in real life. I always make sure I have a funny movie or show lined up that I can watch immediately after. If I do not do these things, I tend to soak up the world&#39;s sorrow.<br/>\n<br/>\nI have learned to be at peace with my tendency to catastrophize. I have some family and friends that know me really well that can recognize when I am having a spell of anxiety. They ask kindly (and jokingly) if I am mentally busy going through my imaginary doomsday list and I nod and smile. It usually takes a minute or two to pass. It does not stop me from living an adventurous life. I have lived on 5 continents and have gone scuba diving, white water rafting, skiing, gone on safari, and so much more. I can be anxious in one moment and carefree and confident in many other moments.<br/>\n<br/>\nI am really proactive, and generally make sure I am doing lots of positive, helpful energy nurturing activities, especially when I know I am likely to be in a situation that makes me more anxious (i.e. going for a children&#39;s medical check up). It is rare for me to have an anxiety episode that lasts a few hours. It is usually over within a minute or five. Even if I have an episode that lasts longer than a few hours, I have always been able to find my way back. This knowledge gives me a lot of strength too. Most often I have positive, happy thoughts and I am calm and peaceful. The one time in my life that I felt I was really struggling, I went to a therapist for a few weeks and it was immensely helpful.<br/>\n<br/>\nAnother thing that has helped me was learning from Jill Bolte Taylor&#39;s book, My Stroke of Insight, that anxiety (or anger, or fear, etc.) triggers a physical reaction that lasts only about 90 seconds. After the 90 seconds, it is my thoughts that power the anxiety and keep it alive in my mind and body. If I choose to redirect my thoughts, I can move past the anxiety easier. There are lots of helpful exercises for this. One is to ask myself if there is a clear and present danger right now - not with my mind, but with my senses. Do I see/hear/taste/smell/feel a danger? No? Then in all likelihood I am safe. Another exercise is using my senses to focus on the present. Listening to the sound of the wind blowing. Looking at the book in front of me and feeling the texture and noticing the colour and how the pages sit together. Feeling the warmness of the water as I am washing dishes. Holding my children close and smelling their hair.<br/>\n<br/>\nIt might help you to write down the things that help keep you happy and positive, so that you will do more of those things regularly. You can put it on the fridge, so you see the list several times a day. Maybe practice breathing deeply and do exercises that help you focus on the present moment, such as the ones above where you use your senses. If you do these sorts of things while you are happy and get into the habit of doing them, it is easier to do when you are feeling anxious. <br/>\n<br/>\n-=- Does anyone have any good resources on overcoming anxiety? I know there are lots of books out there, but I&#39;m finding the things I read on this list help more with inner growth than anything else I have read. I have felt more peace in the six months or so that I&#39;ve been learning about unschooling than I have my entire life. -=-<br/>\n<br/>\nThis list is the best resource I know. For me it is because I sense so much love, kindness and thoughtfulness in people&#39;s personal stories and advice. The list is a celebration of love and connection and life. It keeps my cup full :-) When I am focused on living the kind of life that is encouraged here, there is less and less space for my anxious thoughts.<br/>\n<br/>\nBefore I learned about unschooling, the book that helped me most was Sarah Napthali&#39;s Buddhism for Mothers. But I think reading this list and following Sandra&#39;s advice of &#39;read a little, try a little, wait a while, watch&#39; will work better. You make incremental steps in becoming a better parent and ultimately a better person.<br/>\n<br/>\nRippy<br/>\n(Gianluca 8, Gisele 6)<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] help supporting daughter with letting go","postDate":"1359788121","msgId":70450,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNTk3ODgxMjEuOTkxOTkuWWFob29NYWlsTmVvQHdlYjE4NjEwMi5tYWlsLmlyMi55YWhvby5jb20+","inReplyToHeader":"PEI3MTdGOTZGLUEyQUMtNDE5Ri1BMUI4LUY5RDVFMjAwMEFDMkBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDA0NTIwMWNkZmY1YiQ4ZGNjNWRhMCRhOTY1MThlMCRAdmVyaXpvbi5uZXQ+IDwxRTQwNkMyNy0xMTY5LTQxOEItOEI3NC0yNzZFMzk4OEUwODFAU2FuZHJhZG9kZC5jb20+IDxDQU9PVGFYTj1CLU5PeE9oXzRrN19TTER2PWJIYnpBLUpSY2pEeGJmM1JENnJrS25Nb2dAbWFpbC5nbWFpbC5jb20+IDxCNzE3Rjk2Ri1BMkFDLTQxOUYtQTFCOC1GOUQ1RTIwMDBBQzJAU2FuZHJhZG9kZC5jb20+"},"prevInTopic":70449,"nextInTopic":70452,"prevInTime":70449,"nextInTime":70451,"topicId":70397,"numMessagesInTopic":0,"msgSnippet":"http://www.guardian.co.uk/books/2011/jun/19/magpies-squirrels-and-thieves-review is the first thing that came up in a google search on Victorian Collectors.  ","messageBody":"<div id=\"ygrps-yiv-559387654\"><a rel=\"nofollow\" target=\"_blank\" href=\"http://www.guardian.co.uk/books/2011/jun/19/magpies-squirrels-and-thieves-review\">http://www.guardian.co.uk/books/2011/jun/19/magpies-squirrels-and-thieves-review</a> is the first thing that came up in a google search on Victorian Collectors. <br/>\n<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://en.wikipedia.org/wiki/Hans_Sloane\">http://en.wikipedia.org/wiki/Hans_Sloane</a> is the founder of the British Museum. <br/>\n<br/>\nThere is a book store that framed a lot of my teenage years that was founded on one estate sale of a large book collection. I have a fair few books that I am very loathe to part with and they take up bags of room. <br/>\n<br/>\n<br/>\nAn interesting, and more local to you, Sandra, collector was Richard Wetherill: <a rel=\"nofollow\" target=\"_blank\" href=\"http://en.wikipedia.org/wiki/Richard_Wetherill.%c2%a0\">http://en.wikipedia.org/wiki/Richard_Wetherill.%c2%a0</a><br/>\n<br/>\nThere are collectors of stories, oral traditions. <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.nmu.edu/archives/node/107\">http://www.nmu.edu/archives/node/107</a> is a bunch of collected stories. Collectors of music, the Folkways collection with the Smithsonian are a wonderful example. As are many of the songs that the Carter Family sang. Collectors of comics. Collectors of badges. Collectors of stamps. Collectors of leaves. Collectors of orchids.<br/>\n<br/>\nI bet the space that each of those people dedicate in their lives, not just their homes, to their collections is quite large. <br/>\n<br/>\nThere are television shows about collectors. Picker shows. <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.history.com/shows/american-pickers\">http://www.history.com/shows/american-pickers</a> fascinating excursions into people&#39;s sheds and gardens. Oh, Antiques Roadshow is about collections. Or the best thing each from people&#39;s collections. Even if they got it wrong and it was a fraud. <br/>\n<br/>\n<br/>\nMaybe something there is the kind of thing you are thinking of. <br/>\n<br/>\n<br/>\n________________________________<br/>\n From: Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt;<br/>\nThere was a time when scientific enquiry depended on people (who sometimes owned big house and had servants) to collect birds&#39; eggs, or skeletons, or nests, or animal skulls or plants or seeds.  Collections for study, correspondence with others who had collections, and having books about the things one was collecting, in the 18th and 19th centuries, led to lots of the evolutionary theory and geographical knowledge, anthropology and archeology which are now studied/taught in universities.  Museums were built from some of those personal collections.  I don&#39;t know what it would be called to look it up, but if someone does know and could bring links to something about that, it might make the parents of collectors (or collectors themselves) feel better.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] help supporting daughter with letting go","postDate":"1359779128","msgId":70449,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNTk3NzkxMjguNTc4MTkuWWFob29NYWlsTmVvQHdlYjE4NjEwNi5tYWlsLmlyMi55YWhvby5jb20+","inReplyToHeader":"PEFGM0JFRDhELUMwMkQtNDBDQS04RTVDLTIxQTMyNjYzREQ3MEBicmFkc3RhbmZvcmQuY29tPg==","referencesHeader":"PGtlYjRzcSs0bGZiQGVHcm91cHMuY29tPiA8QUYzQkVEOEQtQzAyRC00MENBLThFNUMtMjFBMzI2NjNERDcwQGJyYWRzdGFuZm9yZC5jb20+"},"prevInTopic":70440,"nextInTopic":70450,"prevInTime":70448,"nextInTime":70450,"topicId":70397,"numMessagesInTopic":0,"msgSnippet":"These series of stories about keeping treasures for children, whatever those treasures may be, is among the most beautiful things I ve read, maybe, ever. When","messageBody":"<div id=\"ygrps-yiv-200326177\">These series of stories about keeping treasures for children, whatever those treasures may be, is among the most beautiful things I&#39;ve read, maybe, ever. When I saw the suitcase that Noor&#39;s father kept for her of the little things she&#39;d brought for him, there were tears in my eyes. I cry easily, so that may be meaningless, on a relative scale, but I am tearful at the beauty of the thoughtfulness that each story describes. The way that these stories is about supporting a child to achieve what they want, to acquire and hold on to what they value. It is so very wonderful. Thank you for sharing.<br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":239922288,"authorName":"onederland1111","from":"&quot;onederland1111&quot; &lt;onederland1111@...&gt;","profile":"onederland1111","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: help supporting daughter with letting go","postDate":"1359756285","msgId":70440,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtlaGU1dCs3cGZ2QGVHcm91cHMuY29tPg=="},"prevInTopic":70439,"nextInTopic":70449,"prevInTime":70439,"nextInTime":70441,"topicId":70397,"numMessagesInTopic":0,"msgSnippet":"Hi, I have a little experience with this subject.  My daughter is 20 years old now and is one of my most favorite people in the world--never ceases to amaze me","messageBody":"<div id=\"ygrps-yiv-552416602\">Hi, I have a little experience with this subject.  My daughter is 20 years old now and is one of my most favorite people in the world--never ceases to amaze me with her poise, confidence, fearlessness in trying new things, and just plain brilliance.  <br/>\n<br/>\nAnd...when she was about your daughter&#39;s age...maybe a little bit younger...she went through a time period of about 2 years when she was doing the same thing as your daughter--she wanted to keep every used paper napkin, paper cups and straws from fast food restaurants, tissues, etc.  She didn&#39;t want to give away clothing that no longer fit her...etc.  <br/>\n<br/>\nIt brought up a LOT of fears in me and anxieties about what was going on.  My own mother was a &quot;collector&quot; or maybe some would call it a hoarder...and at the time as a young mother, I was judging this a lot and fearing seeing the behaviors in my daughter and wanting to change it in her.  Anyways...<br/>\n<br/>\nI just want to say that no amount of trying to convince her to be any way than she was being, helped.  In the end, what did help was for me to own and acknowledge all of my own fears that were coming up...to truly feel my feelings and simply work to accept my daughter completely as she was.  She had a very messy room filled with things...it would be difficult to walk in there sometimes...I just let it be.  I worked on feeling and acknowledging my own fears and feelings, and worked on fully accepting her just the way she was.  Such a lovely little girl--not hard to love and adore her, no matter what, even with the things I considered to be trash.<br/>\n<br/>\nWell, the behavior of keeping &quot;trash&quot; like used napkins and things actually ended on its own.  The behavior of collecting loads of rocks, feathers, trinkets--that lasted (and I do it too, haha).  I promised her I would never give away things without asking her first, and I stuck to that.  Eventually she was okay giving away outgrown clothing, and in her late teen years she began cleaning out her own room and giving boxes and boxes of things to the thrift stores.  <br/>\n<br/>\nIn her late teens my daughter sometimes brought up that period of time in which she couldn&#39;t throw anything away and had other fears too.  She said she was going through a time when she was very afraid of dying and felt like losing anything at all was losing a part of herself--it felt like &quot;death&quot; to her...it made her feel very anxious to lose anything during that time period.  At the time she had not been able to tell me most of what was happening with her feelings...I only knew that she was having a lot of fears and anxieties.  <br/>\n<br/>\nIn my daughter&#39;s case, it was a phase that passed.  At the time I didn&#39;t know it ever would.  But that incident and countless others with my children have taught me that whenever they are doing a behavior that brings up anxiety and fear in me (or judgment) about what they are doing, its time to simply accept them and look closely at what is coming up in ME--own my judgments, fears, and feelings, and allow the children to be as they are.  Time and time again--this has been the most healing thing possible that I could have done.  The situation *always* changed on its own, and always for the better, as soon as *I* let go of control.<br/>\n<br/>\nI just wanted to let you know that, as fearful as it might *feel* to you as the parent (I remember it so well), that it is sure to continue changing and evolving if you allow it too just &quot;be&quot;. Also--yes, maybe its messy too...but life isn&#39;t always neat. Its just something that she and you need to experience in order to continue growing, and neither of you will stop growing.  :)<br/>\n<br/>\nBest wishes,<br/>\nJulie<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;trish52101&quot;  wrote:<br/>\n&gt;<br/>\n&gt; Hi. I have a 5 1/2 year old daughter, Grace, that I am unschooling. We started out homeschooling in a mostly Waldorf way, but I felt like forcing lessons and crafts on her was taking the joy out of our days, so we stopped and have been learning about unschooling and trying to say yes more. <br/>\n&gt; <br/>\n&gt; One thing I would like some perspective and suggestions on is Grace&#39;s attachment to keeping things I would call trash. She doesn&#39;t want to throw anything away. In the past, I&#39;ve just told her that she has to throw it away or thrown stuff away myself, even if it upset her. I don&#39;t want to do that anymore. I have said that trash that comes from food (wrappers or napkins) can&#39;t be saved. We set up a shoe box for her to keep some paper or wrappings in, but soon it will be full. She wants to keep every package to toys, newspaper, and magazines. My struggle is that these items are truly important to her, but she has also kept every toy she has had since she was a baby, so we are running out of room. When we are discussing whether or not to throw something away, the phrase, &quot;one man&#39;s trash, another&#39;s treasure&quot; comes to mind. I think she feels like I&#39;m asking her to throw treasure away.<br/>\n&gt; <br/>\n&gt; It&#39;s the same way with things she draws on her chalkboard/whiteboard. She drew a picture on each side a few months ago and was crying yesterday because she wanted to draw a new picture but didn&#39;t want to erase the old one. She does that on the tablet drawing program, but I usually take a screen shot so she will have a picture of it. I took a picture of the chalkboard, but she was afraid she wouldn&#39;t be able to recreate it. <br/>\n&gt; <br/>\n&gt; I know that my fear of her becoming a hoarder is clouding my ability to come up with a solution that works, but I&#39;m not sure how to let go of that. I would like others&#39; perspective on the situation. I&#39;m not sure what my goal should be- to help her let go, or to find ways to keep more? If I should help her let go, how? We&#39;ve tried recycling and we&#39;ve started writing her name on what we recycle- she wants to see if she will ever find something with her name on it again. I know that won&#39;t happen, but it really makes her feel better so I haven&#39;t told her it won&#39;t. We also talk about how the mice at the dump could use what we are throwing away, and that seems to help a little. <br/>\n&gt; <br/>\n&gt; Thanks in advance,<br/>\n&gt; Trisha<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":528259386,"authorName":"trish52101","from":"&quot;trish52101&quot; &lt;simplycrunchy@...&gt;","profile":"trish52101","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: help supporting daughter with letting go","postDate":"1359730192","msgId":70439,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtlZ2ttZysxN2tlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIzRTg5MTg4LTMwNkItNDdFMS1BNjc0LTRGQzAwQjMwNzg0MkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":70436,"nextInTopic":70440,"prevInTime":70438,"nextInTime":70440,"topicId":70397,"numMessagesInTopic":0,"msgSnippet":"I wanted to share how much all of you have helped. I know that there will be times when my feelings of wanting to throw stuff away come up and I will need to","messageBody":"<div id=\"ygrps-yiv-234036022\">I wanted to share how much all of you have helped. I know that there will be times when my feelings of wanting to throw stuff away come up and I will need to be mindful about my attitude, but yesterday was great! Grace found a few fabric scraps (tiny ones that I would have thrown away) and asked if she could keep them. Immediately she looked ready to defend why they were not trash, but I just said, &quot;Sure, you can put them on your desk for now,&quot; She looked shocked (which made me both happy that she was happy about it and sad that this was so far from normal for her.) Then later she found half of broken coat hanger, which is something that I have made her throw away in the past. She asked to keep it and when I told her yes, the grin on her face was HUGE! She went on to tell me how she wants to teach me how to make something out of it so today she wants me to have glue and pink paper ready to make art today. She is still sleeping and I&#39;ve been looking up found object art on pinterest to show her. **Updated since I forgot to hit post before she woke up** We just looked at this site <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.bluebowerbird.co.uk/info.htm\">http://www.bluebowerbird.co.uk/info.htm</a> and she is so happy. Thank you so much everyone. I feel giddy with excitement- I&#39;m actually looking forward to going through some of her treasures and seeing she wants to make. <br/>\n<br/>\nThanks again,<br/>\nTrish</div>","specialLinks":[]},{"userId":283914803,"authorName":"jo kirby","from":"jo kirby &lt;jokirby2004@...&gt;","profile":"jokirby2004","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] help supporting daughter with letting go","postDate":"1359713670","msgId":70436,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNTk3MTM2NzAuOTQ3Ny5ZYWhvb01haWxOZW9Ad2ViMTcxMzAxLm1haWwuaXIyLnlhaG9vLmNvbT4=","inReplyToHeader":"PDEzNTk3MDUzNDAuNTgzNi5ZYWhvb01haWxOZW9Ad2ViMTcxMzA0Lm1haWwuaXIyLnlhaG9vLmNvbT4=","referencesHeader":"PENBQzZTN1I3Yz03cjlkSzI5UFVLNHMxRFJRQUh2SnRQdUxWZTdlVHBRZjk3ODdXSFI3Z0BtYWlsLmdtYWlsLmNvbT4gPDEzNTk3MDUzNDAuNTgzNi5ZYWhvb01haWxOZW9Ad2ViMTcxMzA0Lm1haWwuaXIyLnlhaG9vLmNvbT4="},"prevInTopic":70432,"nextInTopic":70439,"prevInTime":70435,"nextInTime":70437,"topicId":70397,"numMessagesInTopic":0,"msgSnippet":"Does anyone have any good resources on overcoming anxiety? My Mum had a lot of anxiety when I was growing up (and still does), which I had seriously picked","messageBody":"<div id=\"ygrps-yiv-272492116\">&#39;Does anyone have any good resources on overcoming anxiety?&#39;<br/>\n<br/>\n<br/>\n<br/>\nMy Mum had a lot of anxiety when I was growing up (and still does), which I had seriously picked up on by the time I was five. I didn&#39;t know it was anxiety of course - I just thought that something was wrong in the world.<br/>\n<br/>\nIn my opinion, the best thing you could do for your daughter would be to work on your own anxiety. But don&#39;t spend loads of time reading books about it, and if you do - keep them private! Don&#39;t have a bunch of books about anxiety around for your daughter to come across - they may add to a sense unease/danger.<br/>\n<br/>\nInstead, challenge yourself. Imagine for the day/trip/task/whatever that you are bolder than you feel and step out in that imagined confidence. To begin with, it may feel fake, but before long you will build up a catalogue of experiences where you coped, and coped well. This in turn will give you more confidence (real this time!). Imagine enjoying yourself in things that previously would have made you nervous. This could be a huge gift to your daughter.<br/>\n<br/>\nAll the best,<br/>\nJo<br/>\n<br/>\n<br/>\n________________________________<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n------------------------------------<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning-fullfeatured@yahoogroups.com\">AlwaysLearning-fullfeatured@yahoogroups.com</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":276731379,"authorName":"ehulani56","from":"&quot;ehulani56&quot; &lt;robin.bentley@...&gt;","profile":"ehulani56","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: help supporting daughter with letting go","postDate":"1359692364","msgId":70432,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtlZmZvYys0Ym9sQGVHcm91cHMuY29tPg=="},"prevInTopic":70428,"nextInTopic":70436,"prevInTime":70431,"nextInTime":70433,"topicId":70397,"numMessagesInTopic":0,"msgSnippet":"My main struggle I ... Could you rent a small storage locker/room for things she isn t using right now? You could make special trips sometimes to bring things","messageBody":"<div id=\"ygrps-yiv-1631545902\">My main struggle I<br/>\n<blockquote><span title=\"ireply\"> &gt; think, is that our space is so limited. We live with my sister so we have a<br/>\n&gt; living room, 2 bedrooms, and half the attic. The attic is mostly full<br/>\n&gt; already with plastic bins full of Grace&#39;s toys. If we had more room, I<br/>\n&gt; would still need help seeing things from her point of view, but would<br/>\n&gt; struggle less with her keeping stuff. I don&#39;t want her to just throw<br/>\n&gt; everything away or stop caring about stuff- one of my favorite things about<br/>\n&gt; her is how deeply she feels, and how much she sees beauty in everything.<br/>\n<br/>\n </span></blockquote>Could you rent a small storage locker/room for things she isn&#39;t using right now? You could make special trips sometimes to bring things back or trade stuff from the house.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I would still need help seeing things from her point of view<br/>\n<br/>\n </span></blockquote>You could start with your subject line! Change it to &quot;I need help supporting my daughter with keeping her beloved treasures.&quot; Sometimes a shift in words can help you shift your thinking.<br/>\n<br/>\nRobin B.</div>","specialLinks":[]},{"userId":474282117,"authorName":"Lisa","from":"&quot;Lisa&quot; &lt;lisakleinweber@...&gt;","profile":"cslisacs","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: help supporting daughter with letting go","postDate":"1359676080","msgId":70428,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtlZXZyZytuc2wzQGVHcm91cHMuY29tPg=="},"prevInTopic":70427,"nextInTopic":70432,"prevInTime":70427,"nextInTime":70429,"topicId":70397,"numMessagesInTopic":0,"msgSnippet":"My now-9-year-old son used to do this from ages 2 through 5 or 6.  He doesn t do it anymore.  In fact, there is not one single behavior that I have been","messageBody":"<div id=\"ygrps-yiv-1917407631\">My now-9-year-old son used to do this from ages 2 through 5 or 6.  He doesn&#39;t do it anymore.  In fact, there is not one single behavior that I have been anxious about in the last 9 years that still exists today.  <br/>\n<br/>\nHow is that for an eye-opener!  It opens my eyes to actually think about that!<br/>\n<br/>\nAnyway, we would go to the park and he would pick up bottle caps, feathers, leaves, and sticks and want to take them all home.  They lived in the shed, most of them, and when we moved he let us throw them all away (age 6).<br/>\n<br/>\nWhen we would go to the beach if there was one stick or leaf in the water he would stand on the shore and shriek until daddy jumped in and gathered everything up and brought it to the side for him.  lol.  Now those behaviors are heartwarming, fun stories - part of what makes Joe Joe.  <br/>\n<br/>\nJust like when he was scared he and his toys would go down the drain in the bath so we would have to bathe him in a large plastic container in the kitchen.  Eventually I was able to put the plastic container in the tub, and eventually from there I was able to put him in the tub with no container. <br/>\n<br/>\n.... I have a 3 month old son now, and I don&#39;t care what he finds necessary to do over the next 18 years.  I will not make that mistake of getting anxious about &quot;strange&quot; behaviors.  We will work with him and support him and enjoy them in the moment this time, instead of after the fact.  Lisa</div>","specialLinks":[]},{"userId":284087656,"authorName":"Karen","from":"&quot;Karen&quot; &lt;semajrak@...&gt;","profile":"semajrak","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: help supporting daughter with letting go","postDate":"1359671837","msgId":70427,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtlZXJtdCs0a2UwQGVHcm91cHMuY29tPg=="},"prevInTopic":70422,"nextInTopic":70428,"prevInTime":70426,"nextInTime":70428,"topicId":70397,"numMessagesInTopic":0,"msgSnippet":"... My family flew to Vancouver about three years ago.  My son was seven.  At that time, he was also saving wrappers, cans, cereal boxes, etc at home.  When we","messageBody":"<div id=\"ygrps-yiv-1404053490\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;&gt; One thing I would like some perspective and suggestions on is Grace&#39;s attachment to keeping things I would call trash. She doesn&#39;t want to throw anything away. &lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>My family flew to Vancouver about three years ago.  My son was seven.  At that time, he was also saving wrappers, cans, cereal boxes, etc at home.  When we travelled he wanted to continue to save those things.  I resisted the idea originally for what I thought were practical reasons, but could see that made him sad.  If the trip was going to be a success for all of us, I needed to make sure I met his needs too.  So, I went to a grocery store and found a medium sized box.  I told him we could put his treasures in there and I would mail them home to us before we flew back.  And, that&#39;s what we did.  I told hardly anyone about that because I was sure they would think I was crazy.  That box cost us $30 to mail home, but was worth every penny.  He felt honoured with every piece of something he put in that box.  I could see that in his expressions.  <br/>\n<br/>\nHe doesn&#39;t save that many wrappers and such any more.  A mug broke recently and he didn&#39;t want to throw it out.  I crazy glued it back together and put it on his shelf in his room.  He was happy about that.  He used to be very sad when balloons popped.  He is more at ease with that as well.  He&#39;s a very sensitive soul.  By supporting his needs I believe we are helping him cultivate his sensitivities into strengths.  That&#39;s what I am observing.  He&#39;s only ten though, so I can&#39;t speak from much experience.  <br/>\n<br/>\nSpeaking of wrappers and other everyday treasures, here&#39;s a fun video game that highlights the many things you can make out household items:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.tinkatolli.me/\">http://www.tinkatolli.me/</a><br/>\n<br/>\nHere&#39;s some fun creations other kids have made using a product called Makedo and household items:  <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"https://mymakedo.com/showcase/all\">https://mymakedo.com/showcase/all</a><br/>\n<br/>\n(Duct tape works well too!)<br/>\n<br/>\nKaren.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] help supporting daughter with letting go","postDate":"1359659749","msgId":70422,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENERDhEQzhBLTgxMDctNDY4Mi1BRTRELUUyNjJDNkY3QUE3MkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PENBQzZTN1I3Yz03cjlkSzI5UFVLNHMxRFJRQUh2SnRQdUxWZTdlVHBRZjk3ODdXSFI3Z0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PENBQzZTN1I3Yz03cjlkSzI5UFVLNHMxRFJRQUh2SnRQdUxWZTdlVHBRZjk3ODdXSFI3Z0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":70421,"nextInTopic":70427,"prevInTime":70421,"nextInTime":70423,"topicId":70397,"numMessagesInTopic":0,"msgSnippet":"-=- my mom is a very anxious person and Grace definitely picks up on it and has her own anxieties already-=- Picked up on it before she was conceived, most","messageBody":"<div id=\"ygrps-yiv-565777265\">-=- my mom is a very anxious person and Grace definitely picks up on it and has her own anxieties already-=-<br/>\n<br/>\n&quot;Picked up on it&quot; before she was conceived, most likely.   Personality traits like that are genetic.  It&#39;s the way a person&#39;s biochemistry works.<br/>\n<br/>\nBeing around stress can make it more difficult, for a stress-prone, worry-prone person.  But it won&#39;t, all by itself, create anxiety.  <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/breathing\">http://sandradodd.com/breathing</a> might help and lead to other links.<br/>\nI&#39;ve added part of your post (without a name) to this page (still working on it, so the formatting might not be as will be yet): <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/peace/becoming\">http://sandradodd.com/peace/becoming</a><br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] help supporting daughter with letting go","postDate":"1359652597","msgId":70421,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI3MTdGOTZGLUEyQUMtNDE5Ri1BMUI4LUY5RDVFMjAwMEFDMkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PENBT09UYVhOPUItTk94T2hfNGs3X1NMRHY9YkhiekEtSlJjakR4YmYzUkQ2cmtLbk1vZ0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PDA0NTIwMWNkZmY1YiQ4ZGNjNWRhMCRhOTY1MThlMCRAdmVyaXpvbi5uZXQ+IDwxRTQwNkMyNy0xMTY5LTQxOEItOEI3NC0yNzZFMzk4OEUwODFAU2FuZHJhZG9kZC5jb20+IDxDQU9PVGFYTj1CLU5PeE9oXzRrN19TTER2PWJIYnpBLUpSY2pEeGJmM1JENnJrS25Nb2dAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":70418,"nextInTopic":70422,"prevInTime":70420,"nextInTime":70422,"topicId":70397,"numMessagesInTopic":0,"msgSnippet":"-=-Do you have a hoarding problem or did you grow up with a parent who hoarded? Because that s a big giant leap to go from a little child s wonder at the","messageBody":"<div id=\"ygrps-yiv-519623531\">-=-Do you have a hoarding problem or did you grow up with a parent who<br/>\nhoarded? Because that&#39;s a big giant leap to go from a little child&#39;s wonder<br/>\nat the things she finds in the world to the psychological disorder of<br/>\nhoarding.-=-<br/>\n<br/>\nOnce you start talking about &quot;the psychological disorder of hoarding,&quot; it all seems dangerous and wrong.<br/>\n<br/>\nMuseums and libraries aren&#39;t &quot;hoarding.&quot;   <br/>\nFood banks aren&#39;t hoarding food.<br/>\nThrift stores aren&#39;t hoarding used clothes.  <br/>\n<br/>\nIf I threw things out the way some people do, I woudn&#39;t still have my letter from David Bowie, and the album I had that I wrote about, and the pictures he sent, and the newspaper, and the envelope they all came in.  (I took the stamps off years ago and gave them to a stamp-collecting friend.)<br/>\n<br/>\nAs to displays, here is something really nice to consider.  We have a set.  Holly has put some things in them and they&#39;re beautiful in the windowsill.     I made a blog post so you could see photos: <br/>\n <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.blogspot.com/2013/01/display-blocks.html\">http://sandradodd.blogspot.com/2013/01/display-blocks.html</a><br/>\n<br/>\nThere was a time when scientific enquiry depended on people (who sometimes owned big house and had servants) to collect birds&#39; eggs, or skeletons, or nests, or animal skulls or plants or seeds.  Collections for study, correspondence with others who had collections, and having books about the things one was collecting, in the 18th and 19th centuries, led to lots of the evolutionary theory and geographical knowledge, anthropology and archeology which are now studied/taught in universities.  Museums were built from some of those personal collections.  I don&#39;t know what it would be called to look it up, but if someone does know and could bring links to something about that, it might make the parents of collectors (or collectors themselves) feel better.<br/>\n<br/>\nSandra, a collector and packrat who very often has something someone else needs, and they know to ask!<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":528259386,"authorName":"Trisha Farr","from":"Trisha Farr &lt;simplycrunchy@...&gt;","profile":"trish52101","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] help supporting daughter with letting go","postDate":"1359636545","msgId":70418,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBQzZTN1I3Yz03cjlkSzI5UFVLNHMxRFJRQUh2SnRQdUxWZTdlVHBRZjk3ODdXSFI3Z0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":70416,"nextInTopic":70421,"prevInTime":70417,"nextInTime":70419,"topicId":70397,"numMessagesInTopic":0,"msgSnippet":"I hope I do this reply right- I have only posted one other time to the list so I m still learning. I cannot say thank you enough for all the replies. “Works","messageBody":"<div id=\"ygrps-yiv-1874838868\">I hope I do this reply right- I have only posted one other time to the list<br/>\nso I&#39;m still learning. I cannot say thank you enough for all the replies.<br/>\n<br/>\n�Works for her or works for you�<br/>\n<br/>\nBoth- I grew up very attached to everything I had and didn&#39;t get rid of any<br/>\nof my toys until I was in my 20s and didn&#39;t have room. My main struggle I<br/>\nthink, is that our space is so limited. We live with my sister so we have a<br/>\nliving room, 2 bedrooms, and half the attic. The attic is mostly full<br/>\nalready with plastic bins full of Grace&#39;s toys. If we had more room, I<br/>\nwould still need help seeing things from her point of view, but would<br/>\nstruggle less with her keeping stuff. I don&#39;t want her to just throw<br/>\neverything away or stop caring about stuff- one of my favorite things about<br/>\nher is how deeply she feels, and how much she sees beauty in everything.<br/>\nTyping this though, I&#39;m realizing I will do better if I focus on the<br/>\npositive that I am typing.<br/>\n<br/>\n<br/>\n�is it possible that your daughter feels very controlled? Have you limited<br/>\nher access to the tv and computer? Controlled the kinds of toys she can<br/>\nhave? Could her desire to keep everything be an attempt to exert some<br/>\ncontrol over her world?�<br/>\n<br/>\nThank you for this- it&#39;s spot on. I have in the past set a lot of limits-<br/>\nin my mind, they were reasonable (one donut a week, on Saturdays). But as I<br/>\nlearn more about unschooling, I see how random they seem from her<br/>\nperspective- why is one donut okay and two not? I&#39;ve also made too big a<br/>\ndeal about her not wanting to let go, which I know has made her cling more.<br/>\n<br/>\n<br/>\n&quot; does your daughter seem anxious and insecure? Could it be that she is<br/>\ntrying to create a sense of security through external objects, to<br/>\ncompensate for a lack of inner security? Is the environment in your home<br/>\nwarm and nurturing? Are you yourself prone to worry, and have you<br/>\ninadvertently modelled that to your daughter?&quot;<br/>\n<br/>\nWow, I never would have made this connection on my own, but thank you! I<br/>\nhave struggled with anxiety a lot- my mom is a very anxious person and<br/>\nGrace definitely picks up on it and has her own anxieties already. Does<br/>\nanyone have any good resources on overcoming anxiety? I know there are lots<br/>\nof books out there, but I&#39;m finding the things I read on this list help<br/>\nmore with inner growth than anything else I have read. I have felt more<br/>\npeace in the six months or so that I&#39;ve been learning about unschooling<br/>\nthan I have my entire life.<br/>\n<br/>\n<br/>\n<br/>\n-�Do you have a hoarding problem or did you grow up with a parent who<br/>\nhoarded? Because that&#39;s a big giant leap to go from a little child&#39;s wonder<br/>\nat the things she finds in the world to the psychological disorder of<br/>\nhoarding.�<br/>\n<br/>\nNo, there is no family history of hoarding. I think I jump to this worry<br/>\nfor several reasons. One, I struggle with anxiety. My grandmother and mom<br/>\nboth always jump to the worst case scenario and worry about it. I do the<br/>\nsame. A headache could be a brain tumor. Sirens in the distance must mean a<br/>\nloved one got into an accident. Working on being a better parent is helping<br/>\nme start to deal with this, but I have a long way to go. Also, I worried<br/>\nabout this because of how strongly she feels- how upset she gets when we<br/>\nsay she has to throw something away, how when we go for a walk she<br/>\nfrantically grabs at every acorn, the fear she talked about erasing the<br/>\nchalkboard. Now I see that her responses are a naturally passionate,<br/>\nbeautiful child who is fearful about being forced to throw away stuff. It<br/>\nmust be terrifying to have someone deciding for you what you can have. I&#39;d<br/>\nreact the same way if my husband decided that my yarn wasn&#39;t worth keeping<br/>\nand made me throw it away (and expected me to be okay with it). The third<br/>\nreason I worry about this is that I don&#39;t want to handle it completely<br/>\nwrong and create in her such insecurity that she is driven to hoarding as<br/>\nan adult because I never let her keep anything, or because I never helped<br/>\nher learn to let go. Now I see that if I help her keep as much as we<br/>\npossibly can, and on the things we can&#39;t keep (like food trash) I talk to<br/>\nher and find a way to keep parts of it or take the pictures, then she will<br/>\nprobably always have a love of stuff, but will know how to organize her<br/>\ncollections and decide for herself what she wants and doesn&#39;t want.<br/>\n<br/>\n<br/>\n I am so excited to have so many suggestions on how to save the things she<br/>\ncollects. I am especially thankful for the suggestion of flattening boxes<br/>\nor cutting out the special parts- boxes have been one of the hardest things<br/>\nbecause they are so big, it&#39;s hard to keep them. I don&#39;t know why I didn&#39;t<br/>\nthink of flattening them. After reading through all the suggestions, I&#39;m<br/>\nthinking of covering a large portion of her wall with cork board so she can<br/>\nhang up her treasures. I know that I still have a lot of work to do so that<br/>\nmy reactions when she wants to keep things don&#39;t make her feel like I am<br/>\nfrustrated or that her request is burdensome. Thanks again. This list and<br/>\nthe people on it have made such a difference in our home already.<br/>\n<br/>\nThanks,<br/>\nTrisha<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":304763189,"authorName":"Jen","from":"Jen &lt;cookiesforthree@...&gt;","profile":"jencookies43","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: help supporting daughter with letting go","postDate":"1359610046","msgId":70415,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEUwREFGQUYzLUMwOUMtNDZDNC04MDMxLUIwRTM4MEFGMUY4MUB2ZXJpem9uLm5ldD4="},"prevInTopic":70414,"nextInTopic":70416,"prevInTime":70414,"nextInTime":70416,"topicId":70397,"numMessagesInTopic":0,"msgSnippet":"I used to save a lot of things when I was young. Rocks, toys, clothes, papers, etc. I felt that these things had feelings and I needed to care for them. I","messageBody":"<div id=\"ygrps-yiv-398653644\">I used to save a lot of things when I was young. Rocks, toys, clothes, papers, etc. I felt that these things had feelings and I needed to care for them. I eventually grew out of it and I have a pretty organized and clean house now. My 11 year old son has the same attachments to things that I had. He&#39;s starting to grow out of it, but not entirely yet. That&#39;s okay. I find that we are both really compassionate people and its our personalities to nurture. I help him organize his things and we spend time reminiscing over certain items. <br/>\n<br/>\nMy husband had a beautiful burgundy dress shirt. He tore it and could no longer wear it to work. I cut it into strips, made beautiful rose buds out of the strips then hot glued it into a beautiful heart shaped wreath. My sons rock collection became a rock family with glued on googley eyes and painted on smiles. They line our entertainment center and they make me smile every time I feather dust them off. We have a wonderful bug collection in a shadow box. Papers and wrappers make excellent wreaths. We have a huge one hanging on our living room wall. We even have a rabbit skull on display that he found. Bags and bags of stuffed animals sit in the closet. <br/>\n<br/>\nHe&#39;s just starting to give some of his toys away that he has no attachment to anymore to younger kids. He loves bringing them joy with an old plastic dinosaur or an action figure he doesn&#39;t care for anymore. <br/>\n<br/>\nI think he sees the joy that people receive from my example. I have a clothing ministry where people in our community give me clothing that they don&#39;t want anymore and I find new homes for them. Sometimes we are given games and toys to find homes for. He sees my joy in giving and the receivers joy in getting and is wanting to be a part of that process. <br/>\n<br/>\nYour daughter may have entirely different reasons for hanging on to things. Maybe you could just ask her as you are playing with her what that item means to her and why she wants to keep it. Be gentle and kind. Praise her ideas and instead of worrying about the bad that can come of her keeping things, think of the good. You might only know the good of it when you really open heatedly listen to her. <br/>\n<br/>\n~Jen Smith</div>","specialLinks":[]},{"userId":399191791,"authorName":"Brandynn Stanford","from":"Brandynn Stanford &lt;brandynn@...&gt;","profile":"moglieallegra","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: [AlwaysLearning] help supporting daughter with letting go","postDate":"1359606887","msgId":70416,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFGM0JFRDhELUMwMkQtNDBDQS04RTVDLTIxQTMyNjYzREQ3MEBicmFkc3RhbmZvcmQuY29tPg==","inReplyToHeader":"PGtlYjRzcSs0bGZiQGVHcm91cHMuY29tPg==","referencesHeader":"PGtlYjRzcSs0bGZiQGVHcm91cHMuY29tPg=="},"prevInTopic":70415,"nextInTopic":70418,"prevInTime":70415,"nextInTime":70417,"topicId":70397,"numMessagesInTopic":0,"msgSnippet":"I bought this for my daughter for Christmas. Holds 40 photos on each side, but tidbits and scraps could be put in there also, so they would be visible. They","messageBody":"<div id=\"ygrps-yiv-512119691\">I bought this for my daughter for Christmas. Holds 40 photos on each side, but tidbits and scraps could be put in there also, so they would be visible. They have larger ones, too. <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.amazon.com/gp/product/B002MPPNIA/ref=oh_details_o02_s02_i00\">http://www.amazon.com/gp/product/B002MPPNIA/ref=oh_details_o02_s02_i00</a><br/>\n<br/>\nTall, plastic storage towers with drawers might be a fit. They&#39;re sort of see through so she could know what was inside. You could add neat labels. Some of the units have drawers all one size. Some scrapbooking ones have drawers of varying sizes, so she could decide which things she wants in shallow drawers, which in deeper ones.<br/>\n<br/>\nHardware organizers from the tool department - some of those things have seemingly hundreds of little drawers.<br/>\n<br/>\nFor the chalkboard, you could take a photo, get prints on Shutterfly, and clip them on a little clothesline type thing across her room or wall. They would be visible. She could also clip lightweight feathers, wrappers, scraps, along the line, too. Things she feels are pertinent to the photo.<br/>\n<br/>\nMany food wrappers can be wiped down so they&#39;l last longer.<br/>\n<br/>\nMy teenage daughter cuts interesting food wrappers into clothing shapes and creates mini-fashion pictures from them.<br/>\n<br/>\nFor wrappers that are messy, perhaps a compost pile. If she didn&#39;t consider it traumatic to see her treasures disintegrating, she might find it interesting to see how they change and break down. Or a vermicomposting bin could be a smaller scale option, for cardboard and non-glossy papers.<br/>\n<br/>\nYou could discover together different people, professions, in your town and around the world, where people practice their craft of sorting, organizing, classifying. It&#39;s a critical skill and service and many people thrive in making sense of seemingly random things. Library, grocery store shelves, pet shop, file clerks, thrift stores, detectives, urban planners. On a bigger scale I think of museum curators, The National Archives, Sotheby&#39;s.<br/>\n<br/>\nDon&#39;t push her to organize her collection. She may not be interested in that and a message of &quot;you can keep this stuff as long as it&#39;s organized&quot; would take things in the wrong direction. But if she is wanting to sort and organize her treasures, oh what a world of possibilities exists!<br/>\n<br/>\nMy husband still misses toys that his parents threw away without him knowing.<br/>\n<br/>\nI still remember my mother scoffing at things that were important to me but made no sense to her.<br/>\n<br/>\nMy parents sold my childhood home when I was 19 and I cleaned out my very full closet. I got rid of most items, happily, willingly, because I no longer needed them. Some things I couldn&#39;t even remember why they&#39;d been special. Others, I sat and remembered and touched for awhile, but was ready to let them go. A handful I took with me into adulthood. I&#39;ve always been grateful that I was the one to make those decisions.<br/>\n<br/>\n~ Brandynn</div>","specialLinks":[]},{"userId":504505579,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: help supporting daughter with letting go","postDate":"1359601790","msgId":70414,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBT09UYVhOPUItTk94T2hfNGs3X1NMRHY9YkhiekEtSlJjakR4YmYzUkQ2cmtLbk1vZ0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDFFNDA2QzI3LTExNjktNDE4Qi04Qjc0LTI3NkUzOTg4RTA4MUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDA0NTIwMWNkZmY1YiQ4ZGNjNWRhMCRhOTY1MThlMCRAdmVyaXpvbi5uZXQ+CTwxRTQwNkMyNy0xMTY5LTQxOEItOEI3NC0yNzZFMzk4OEUwODFAU2FuZHJhZG9kZC5jb20+"},"prevInTopic":70412,"nextInTopic":70415,"prevInTime":70413,"nextInTime":70415,"topicId":70397,"numMessagesInTopic":0,"msgSnippet":"... Recently I ve been shopping for a coffee table that is partitioned into little squares and has a glass top. I saw one at Ikea like that and I want that one","messageBody":"<div id=\"ygrps-yiv-314228700\">On Wed, Jan 30, 2013 at 6:49 PM, Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Having a child who wants to collect feathers or shells or little pieces of<br/>\n&gt; paper seems extremely harmless.<br/>\n<br/>\n<br/>\n </span></blockquote>Recently I&#39;ve been shopping for a coffee table that is partitioned into<br/>\nlittle squares and has a glass top. I saw one at Ikea like that and I want<br/>\nthat one but in wood and not shiny white. I want it for keeping things like<br/>\nrocks or feathers or dried leaves that I pick up. For many many years I had<br/>\na tabletop in my living room where I put stuff like that. I&#39;m sure some<br/>\npeople thought I had a tabletop of trash but they were my treasures. The<br/>\nkids collected some stuff but I collected most of it.<br/>\n<br/>\nMy suggestion is to find a way to have all those little treasures out in<br/>\nsight on display - when her space for them gets too full, she might decide<br/>\nwhich ones she wants to keep and which to toss to make space for more. Or<br/>\nshe might want to pack some up in shoeboxes or something. Take them<br/>\nseriously.<br/>\n<br/>\nShe gets some kind of sense of awe from those little bits of the world -<br/>\nthat is a very very wonderful thing and an ability most adults sadly lose.<br/>\nNurture it. That ability will continue to bring her joy throughout her<br/>\nlife.<br/>\n<br/>\nDo you have a hoarding problem or did you grow up with a parent who<br/>\nhoarded? Because that&#39;s a big giant leap to go from a little child&#39;s wonder<br/>\nat the things she finds in the world to the psychological disorder of<br/>\nhoarding.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: help supporting daughter with letting go","postDate":"1359600593","msgId":70412,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFFNDA2QzI3LTExNjktNDE4Qi04Qjc0LTI3NkUzOTg4RTA4MUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDA0NTIwMWNkZmY1YiQ4ZGNjNWRhMCRhOTY1MThlMCRAdmVyaXpvbi5uZXQ+","referencesHeader":"PDA0NTIwMWNkZmY1YiQ4ZGNjNWRhMCRhOTY1MThlMCRAdmVyaXpvbi5uZXQ+"},"prevInTopic":70411,"nextInTopic":70414,"prevInTime":70411,"nextInTime":70413,"topicId":70397,"numMessagesInTopic":0,"msgSnippet":"-=- I think she feels like I m asking her to throw treasure away.-=- If you gave her what you consider to be treasure, she might have no interest. Some","messageBody":"<div id=\"ygrps-yiv-711118716\">-=- I think she feels like I&#39;m asking her to throw treasure away.-=-<br/>\n<br/>\nIf you gave her what you consider to be &quot;treasure,&quot; she might have no interest.<br/>\n<br/>\nSome people collect Madame Alexander dolls, or Ferraris.  Then they need glass boxes and shelving, or  land with heated garages and alarm systems.<br/>\n<br/>\nHaving a child who wants to collect feathers or shells or little pieces of paper seems extremely harmless.  <br/>\n<br/>\nIf, when she&#39;s a teen, your relationship goes bad and you could restore it with a pile of feathers, shells and little pieces of paper, wouldn&#39;t that be wonderful?  Maybe make the investment now.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":278937908,"authorName":"Laura McDowell","from":"&quot;Laura McDowell&quot; &lt;la_tree@...&gt;","profile":"mcclan113","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: help supporting daughter with letting go","postDate":"1359599693","msgId":70411,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA0NTIwMWNkZmY1YiQ4ZGNjNWRhMCRhOTY1MThlMCRAdmVyaXpvbi5uZXQ+"},"prevInTopic":70410,"nextInTopic":70412,"prevInTime":70410,"nextInTime":70412,"topicId":70397,"numMessagesInTopic":0,"msgSnippet":"One thing I would like some perspective and suggestions on is Grace s attachment to keeping things I would call trash. She doesn t want to throw anything","messageBody":"<div id=\"ygrps-yiv-930135884\">&quot;One thing I would like some perspective and suggestions on is Grace&#39;s<br/>\nattachment to keeping things I would call trash. She doesn&#39;t want to throw<br/>\nanything away.<br/>\n<br/>\n <br/>\n<br/>\n  . I think she feels like I&#39;m asking her to throw treasure away.&quot;<br/>\n<br/>\n <br/>\n<br/>\nMy daughter at just about the same age suddenly  began a behavior of keeping<br/>\nthings- mostly sticks and leaves.  I also felt the fear that she wouldn&#39;t<br/>\nstop doing this if I didn&#39;t help her, but somehow eventually I just allowed<br/>\nher to keep a lot of it.   At the same time, I think** we would judiciously<br/>\nmake things disappear-  while seemingly not the fairest way or kindest way-<br/>\nour daughter wasn&#39;t particularly sitting and counting these things, going<br/>\nback, etc.  We put some of  it in  baskets etc. and a few yrs I could get<br/>\nrid of it.  Remember that each child is different, while my daughter did<br/>\ndesparately want those things when she picked them up, later she didn&#39;t so<br/>\nmuch think about them.<br/>\n<br/>\n <br/>\n<br/>\nIt sounds like the same behavior as your daughter&#39;s just at a different<br/>\ndegree and with a different mind-set. <br/>\n<br/>\n <br/>\n<br/>\nWhat worked for us and I think might do well for you is to continue to do<br/>\nyour best respecting her needs, and knowing that one day it will change, and<br/>\nit&#39;s really a beautiful aspect of who she is and who she is becoming.<br/>\n<br/>\n <br/>\n<br/>\nLaura<br/>\n<br/>\n.<br/>\n<br/>\n <br/>\n<br/>\n    <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: help supporting daughter with letting go","postDate":"1359599476","msgId":70410,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIzRTg5MTg4LTMwNkItNDdFMS1BNjc0LTRGQzAwQjMwNzg0MkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGtlY2FiZituMmZnQGVHcm91cHMuY29tPg==","referencesHeader":"PGtlY2FiZituMmZnQGVHcm91cHMuY29tPg=="},"prevInTopic":70408,"nextInTopic":70411,"prevInTime":70409,"nextInTime":70411,"topicId":70397,"numMessagesInTopic":0,"msgSnippet":"-=-She s such a young child and is finding magic in the simplest things! That s beautiful...if you can get past your own attachment to defining those things as","messageBody":"<div id=\"ygrps-yiv-1394276444\">-=-She&#39;s such a young child and is finding magic in the simplest things! That&#39;s beautiful...if you can get past your own attachment to defining those things as garbage. -=-<br/>\n<br/>\nThat&#39;s an important point.  The words you use reflect your feelings, and your feelings are readable by your children.<br/>\n<br/>\nWhen a mom calls some food &quot;junk&quot; and some TV shows &quot;crap&quot; the kids can&#39;t make real decisions, and the parents can&#39;t see their children directly.    While that&#39;s normal, legal, and most parents will tell you you&#39;re fine, and to ignore me. *if* you want to move toward unschooling in the sort of way people here are talking about, seeing your own prejudices and weeding them out for your child&#39;s sake is pivotal.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/ifilet\">http://sandradodd.com/ifilet</a><br/>\nThose are real statements from real moms, and some of that emotion might be what you&#39;re feeling.  If you let her, she will bring home all the trash in the world.<br/>\n<br/>\nHere&#39;s something about the collections of Brie&#39;s daughter, Noor:  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/briejontry/spirituality\">http://sandradodd.com/briejontry/spirituality</a><br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":240002389,"authorName":"Andrea Catalano","from":"Andrea Catalano &lt;fennel1001@...&gt;","profile":"ajcm1207","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: help supporting daughter with letting go","postDate":"1359596528","msgId":70407,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQ3OTUwODkxLUNFOTgtNDg1Ni1CNzdELTM1NUZDNDYwN0JGOUB5YWhvby5jb20+"},"prevInTopic":70406,"nextInTopic":70408,"prevInTime":70406,"nextInTime":70408,"topicId":70397,"numMessagesInTopic":0,"msgSnippet":"My son also likes to save lots of special things. We save all the boxes of his toys. I flatten them so I can store them more easily. With larger boxes or ones","messageBody":"<div id=\"ygrps-yiv-322893577\">My son also likes to save lots of special things. <br/>\n<br/>\nWe save all the boxes of his toys. I flatten them so I can store them more easily. With larger boxes or ones that are harder to store, I will use scissors to cut out the part of the box that&#39;s important to him-- usually it&#39;s the image of the toy and sometimes special instructions/descriptions on the back. Occasionally we look through them and consider they can be recycled or cut down (as above). Often, they can be cut down. I don&#39;t put pressure on him to do this. <br/>\n<br/>\nI also take lots of photos of his lego creations and drawings as well as any other thing that is important to him to document. <br/>\n<br/>\nHe keeps special jars for stems, sticks  and rocks. With any fresh plant material, we make sure they are in open containers so that they won&#39;t mold.<br/>\n<br/>\nI saw a piece on hoarding recently and one psychologist said that most hoarders suffered traumatic loss -- house fire, loss of a loved one -- that they were powerless over. This is usually what prompts the impulse to hoard. It&#39;s an extreme reaction to an extreme circumstance. That&#39;s really not what kids who collect are doing. It seems possible, however, to make collectors feel powerless by taking away their stuff or pressuring them to do it. That could make them feel anxious and want to hold on tighter than they already do.<br/>\n<br/>\nAndrea<br/>\n<br/>\nSent from my iPhone</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: help supporting daughter with letting go","postDate":"1359595474","msgId":70406,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNTk1OTU0NzQuMjU5MzQuWWFob29NYWlsTmVvQHdlYjE4MjIwMS5tYWlsLmJmMS55YWhvby5jb20+","inReplyToHeader":"PGtlY2QwOStlNWhqQGVHcm91cHMuY29tPg==","referencesHeader":"PGtlY2QwOStlNWhqQGVHcm91cHMuY29tPg=="},"prevInTopic":70405,"nextInTopic":70407,"prevInTime":70405,"nextInTime":70407,"topicId":70397,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1607750345\">&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;  I make suggestions, like &quot; you have twenty barbies,<br/>\nthats alot. Can we pick one or two to give to a little girl who dosent?<br/>\nThen she does as she will. Gentle guidance can go a long way.&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n<br/>\nTwenty Barbies is a lot for you or her?<br/>\nMy son has 51 Thomas the Tank Engine from when he was little. Some are the same characters. I think there is more than o6 THomas in there.<br/>\nMy daughter collects My little Ponies and have many many of them Some over  25 years old !<br/>\nWe have sold some duplicate ponies. We have given away some Barbies she did not really care for. But i would not tell her a certain number is too many. |Only her can decide that.<br/>\nI remember my mother in law saying  Gigi had too many My Little Ponies a couple minutes after showing me 3 outbuildings/barns full of old tractors her husband likes to collect ( collectibles not used for anything)/<br/>\nI have seen this .People that will have this huge collection of something and then they  turn around and tell their kids they have too many toys already and either will not get a new one or have to give away some.<br/>\nUnschooling will be better when the parent values what they children has and likes. Thinking it is just one more toy is really dismissive or your child and what they like and value.<br/>\n<br/>\nAlex Polikowsky ( Who gladly find places to store what kids want as long as they want - Ok I do have a big attic and I have space)<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: help supporting daughter with letting go","postDate":"1359594844","msgId":70405,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk1QzFCMTY4LUFCQTAtNDAwMy1CNEUzLTA2N0IxMzRCOUMwNkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGtlY2QwOStlNWhqQGVHcm91cHMuY29tPg==","referencesHeader":"PGtlY2QwOStlNWhqQGVHcm91cHMuY29tPg=="},"prevInTopic":70404,"nextInTopic":70406,"prevInTime":70404,"nextInTime":70406,"topicId":70397,"numMessagesInTopic":0,"msgSnippet":"-=- Can we pick one or two to give to a little girl who dosent? Then she does as she will. Gentle guidance can go a long way.-=- Too much manipulation goes","messageBody":"<div id=\"ygrps-yiv-385532904\">-=- Can we pick one or two to give to a little girl who dosent?<br/>\nThen she does as she will. Gentle guidance can go a long way.-=-<br/>\n<br/>\nToo much manipulation goes against a good relationship. Be careful of setting up a situation where there&#39;s one right answer and one wrong, bad, selfish answer and then say &quot;then she does as she will.&quot;  <br/>\n<br/>\nDon&#39;t make a child choose between keeping a Barbie doll she wants to keep, and the (false) ideas of earning her mother&#39;s love and providing a doll for a stranger.  Thrift stores are filled to overflowing with toys, Barbies among them.  A child can never get back a particular toy they knew and liked.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/barbie\">http://sandradodd.com/barbie</a>  <br/>\nThere are some unschoolers and Barbie-related activities that might surprise people who haven&#39;t seen them (but aren&#39;t likely to surprise people who know the girls in the accounts).<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: help supporting daughter with letting go","postDate":"1359594644","msgId":70404,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ0RjVENDRELTA0MDAtNDE4NC1BMkQ1LUVDQ0YxNzlDQ0M1QkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PERVQjEwMS1XMzg4RjVDOEQ2REU5NzE4RkY1RjdCM0I3MUQwQHBoeC5nYmw+","referencesHeader":"PGtlYnFuNitkZWM3QGVHcm91cHMuY29tPiA8RFVCMTAxLVczODhGNUM4RDZERTk3MThGRjVGN0IzQjcxRDBAcGh4LmdibD4="},"prevInTopic":70403,"nextInTopic":70405,"prevInTime":70403,"nextInTime":70405,"topicId":70397,"numMessagesInTopic":0,"msgSnippet":"-=-It might take up less space to store them in scrap books on shelves than in boxes-=- No, the scrap books themselves take a lot of room.  It s easier to have","messageBody":"<div id=\"ygrps-yiv-2078059638\">-=-It might take up less space to store them in scrap books on shelves than in boxes-=-<br/>\n<br/>\nNo, the scrap books themselves take a lot of room.  It&#39;s easier to have an envelope for each event and keep all the papers together in there, and if you&#39;re telling stories (or wanting to remember) about that one trip, you can pull the envelope or the little box out.   Or maybe the movie tickets are in one folder, or box, or envelope.<br/>\n<br/>\nI have papers I&#39;ve saved since I was little.  I know the problem and also the joy of having physical memories.   Having other people press me to get rid of things is like an assault to my soul.<br/>\n<br/>\nThere&#39; a book, and an audio book (which is how I got it--it takes up less space on an iPod than it would on a shelf) called Stuff<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.nytimes.com/2010/04/25/books/review/Kramer-t.html?_r=0\">http://www.nytimes.com/2010/04/25/books/review/Kramer-t.html?_r=0</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.amazon.com/Stuff-Compulsive-Hoarding-Meaning-Things/dp/0547422555\">http://www.amazon.com/Stuff-Compulsive-Hoarding-Meaning-Things/dp/0547422555</a><br/>\n<br/>\nIt&#39;s about extreme cases, and grad student assistants who helped see what the deal was.  It&#39;s very interesting.  Just reading the reviews could help a mom understand a little better.<br/>\n<br/>\nTwo things from it:  For some people, it&#39;s their history, their memories, their evidence.  <br/>\nWhen someone&#39;s stuff is cleaned out suddenly, they can die.  <br/>\n<br/>\nWeird but true.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":493351985,"authorName":"Serenity","from":"&quot;Serenity&quot; &lt;simplyserenitylmt@...&gt;","profile":"simplyserenitylmt","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: help supporting daughter with letting go","postDate":"1359591241","msgId":70403,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtlY2QwOStlNWhqQGVHcm91cHMuY29tPg=="},"prevInTopic":70402,"nextInTopic":70404,"prevInTime":70402,"nextInTime":70404,"topicId":70397,"numMessagesInTopic":0,"msgSnippet":"Something we do in our home is after birthdays or holidays we go through the playroom and put together bags for the goodwill and Hopi giving tree. My daughters","messageBody":"<div id=\"ygrps-yiv-1152887137\">Something we do in our home is after birthdays or holidays we go through<br/>\nthe playroom and put together bags for the goodwill and Hopi giving<br/>\ntree. My daughters get to choose what toys they no longer use to go in<br/>\nthe bag and they feel better knowing its going to a specific person.<br/>\n(the giving tree). I make suggestions, like &quot; you have twenty barbies,<br/>\nthats alot. Can we pick one or two to give to a little girl who dosent?<br/>\nThen she does as she will. Gentle guidance can go a long way.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Jody&quot;  wrote:<br/>\n&gt;<br/>\n&gt; My 8 year old son doesn&#39;t like to throw anything away either.  He has<br/>\nkept various &quot;souvenir&quot; wrappers, candies that looked<br/>\ninteresting/different, boxes toys came in (some are used to play with,<br/>\nothers we cut the pictures out and put up on his wall like posters - he<br/>\nwanted to do this).  He also has a nature collection that at times feels<br/>\nout of control to me - we did organize it into clear containers (he<br/>\nlikes things organized).  When he runs out of space in his room (we have<br/>\nput tons of shelves etc in his room) we do help him to sort through what<br/>\nhe wants in his room and what he doesn&#39;t anymore - but he doesn&#39;t want<br/>\nto get rid of any of it.  Some of it goes in boxes and into our storage<br/>\nroom, some of it goes in the basement to play with.  But the choice is<br/>\nreally his, I just try to come up with solutions.<br/>\n&gt;<br/>\n&gt; When he was much younger I did &quot;talk him into&quot; getting rid of things. <br/>\nIt always felt horrible, but I felt like we didn&#39;t have a choice.  I&#39;ve<br/>\nlearned that there really are choices!<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;trish52101&quot;  wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt; Hi. I have a 5 1/2 year old daughter, Grace, that I am unschooling.<br/>\nWe started out homeschooling in a mostly Waldorf way, but I felt like<br/>\nforcing lessons and crafts on her was taking the joy out of our days, so<br/>\nwe stopped and have been learning about unschooling and trying to say<br/>\nyes more.<br/>\n&gt; &gt;<br/>\n&gt; &gt; One thing I would like some perspective and suggestions on is<br/>\nGrace&#39;s attachment to keeping things I would call trash. She doesn&#39;t<br/>\nwant to throw anything away. In the past, I&#39;ve just told her that she<br/>\nhas to throw it away or thrown stuff away myself, even if it upset her.<br/>\nI don&#39;t want to do that anymore. I have said that trash that comes from<br/>\nfood (wrappers or napkins) can&#39;t be saved. We set up a shoe box for her<br/>\nto keep some paper or wrappings in, but soon it will be full. She wants<br/>\nto keep every package to toys, newspaper, and magazines. My struggle is<br/>\nthat these items are truly important to her, but she has also kept every<br/>\ntoy she has had since she was a baby, so we are running out of room.<br/>\nWhen we are discussing whether or not to throw something away, the<br/>\nphrase, &quot;one man&#39;s trash, another&#39;s treasure&quot; comes to mind. I think she<br/>\nfeels like I&#39;m asking her to throw treasure away.<br/>\n&gt; &gt;<br/>\n&gt; &gt; It&#39;s the same way with things she draws on her<br/>\nchalkboard/whiteboard. She drew a picture on each side a few months ago<br/>\nand was crying yesterday because she wanted to draw a new picture but<br/>\ndidn&#39;t want to erase the old one. She does that on the tablet drawing<br/>\nprogram, but I usually take a screen shot so she will have a picture of<br/>\nit. I took a picture of the chalkboard, but she was afraid she wouldn&#39;t<br/>\nbe able to recreate it.<br/>\n&gt; &gt;<br/>\n&gt; &gt; I know that my fear of her becoming a hoarder is clouding my ability<br/>\nto come up with a solution that works, but I&#39;m not sure how to let go of<br/>\nthat. I would like others&#39; perspective on the situation. I&#39;m not sure<br/>\nwhat my goal should be- to help her let go, or to find ways to keep<br/>\nmore? If I should help her let go, how? We&#39;ve tried recycling and we&#39;ve<br/>\nstarted writing her name on what we recycle- she wants to see if she<br/>\nwill ever find something with her name on it again. I know that won&#39;t<br/>\nhappen, but it really makes her feel better so I haven&#39;t told her it<br/>\nwon&#39;t. We also talk about how the mice at the dump could use what we are<br/>\nthrowing away, and that seems to help a little.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Thanks in advance,<br/>\n&gt; &gt; Trisha<br/>\n&gt; &gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":403767111,"authorName":"Jo Isaac","from":"Jo Isaac &lt;joanneisaac@...&gt;","profile":"joanne.isaac","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] Re: help supporting daughter with letting go","postDate":"1359590772","msgId":70402,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PERVQjEwMS1XMzg4RjVDOEQ2REU5NzE4RkY1RjdCM0I3MUQwQHBoeC5nYmw+","inReplyToHeader":"PGtlYnFuNitkZWM3QGVHcm91cHMuY29tPg==","referencesHeader":"PGtlYnFuNitkZWM3QGVHcm91cHMuY29tPg=="},"prevInTopic":70401,"nextInTopic":70403,"prevInTime":70401,"nextInTime":70403,"topicId":70397,"numMessagesInTopic":0,"msgSnippet":"Could you make scrap books that you could stick the wrappers/napkins etc into, if your daughter likes that idea? It might take up less space to store them in","messageBody":"<div id=\"ygrps-yiv-680418158\">Could you make scrap books that you could stick the wrappers/napkins etc into, if your daughter likes that idea? It might take up less space to store them in scrap books on shelves than in boxes, and it could be easier for your daughter to look through them that way too - it could be a fun thing to do together - sticking them in and admiring them as you do it!<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n    <br/>\n     <br/>\n<br/>\n    <br/>\n    <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n   \t\t \t   \t\t  <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":299099204,"authorName":"julesbox7","from":"&quot;julesbox7&quot; &lt;juliecovey@...&gt;","profile":"julesbox7","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: help supporting daughter with letting go","postDate":"1359588774","msgId":70401,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtlY2FqNitubTNsQGVHcm91cHMuY29tPg=="},"prevInTopic":70400,"nextInTopic":70402,"prevInTime":70400,"nextInTime":70402,"topicId":70397,"numMessagesInTopic":0,"msgSnippet":"Hi Trisha  I was moved to reply to this because I have two kids (currently 6 & 7) who love to collect things, too.  I wish I could show you pictures of what","messageBody":"<div id=\"ygrps-yiv-180921159\">Hi Trisha &#61514;<br/>\n<br/>\nI was moved to reply to this because I have two kids (currently 6 & 7) who love to collect things, too.  I wish I could show you pictures of what our pockets and buckets and containers look like after a trip to a rocky beach I was like, seriously, I&#39;m lugging around 10 lbs. of rocks  and my husband was worse :)  My son, after seeing the movie Real Steel, ramped up his metal bit collection thinking that he was on his way to building a robot.  My mother about freaked out when I allow him to pick up &quot;trash&quot; in parking lots.  He still has a treasure box of those things and when I find more in his pockets  I put them in his box without asking I know where they go.  He&#39;ll say &quot;MOM!! I had stuff in my pockets  where is it?!?!&quot;  I say in your treasure box and he says &quot;THANKS, you&#39;re the best!&quot;  I could go on and on.  I am not saying that it doesn&#39;t occasionally bug me  it does.  We have space issues, too.  And I don&#39;t see the beauty in all of the things they want to keep.  But that&#39;s not my decision and I do get that.  <br/>\n<br/>\nI honestly don&#39;t know if I&#39;m doing things &quot;right&quot;, but here is what we do we talk about compromise and space (these have been small conversations over time and we still work on it).  This is their space (their room and shelves in the garage) and this is my space (the rest of the house/garage).  There is also community space, of course, but you get the idea :)  I respect their space, they respect my space.  Whatever they would like to keep in their space is their decision (no food).  They organize, label and clean their space based on their needs - not my version of organized, mind you.  A couple times a year, we re-evaluate the things in their room (usually before/after a gift giving event because that is when we run out of space).  There are three places an unused item (even if I see it as &quot;trash&quot;) can go  garage sale (they keep the money), storage (our attic space if they are just not ready to let something go) or donate (and we talk about those who don&#39;t have much and how they would love a special item from them).  I would say nothing of theirs has ever gone into the trash.  As long as they have space and it won&#39;t mold, they can keep it.<br/>\n<br/>\nAnd then there are Legos.  Where do I start haha basically, I take pictures and they have an album of their creations.  Sometimes, creations hang around a long time.  I also take pictures of their drawings, print them out and we put them up (or I post on Facebook, they like to see their  stuff on the internet and see people &quot;like&quot; or comment on them).  I have containers for their drawings, creations, collages, etc. Together we put names/dates on them and put them away to be scrapbooked later.<br/>\n<br/>\nSometimes I screw up and forget to take a picture or something falls apart before being properly photographed, but for the most part, they are willing to forgive and move on because most of the time I do take care of it.  They both got an inexpensive camera for Christmas so they can take pictures of what is important and they don&#39;t seem to have the need to print stuff out as much.  I would say that, early on, they were pretty fanatical about their stuff, but over the past few years, things have eased up significantly (probably because I have eased up - hey, I&#39;m learning too).  They like earning money at garage sales, they love the idea of another little person using their item and they are willing to work with the container or the space that they have and it&#39;s really not a big deal anymore.<br/>\n<br/>\nI don&#39;t make a big deal about it.  After telling them how cool their creation is, etc., when it&#39;s time to put something away, I usually shrug and say  &quot;of course you can totally keep that, it&#39;s awesome&quot; or &quot;it&#39;s your decision :) I know you can do it&quot;, or &quot;that&#39;s all the space we have, you&#39;ll need to make a decision&quot;. <br/>\n<br/>\nI would suggest being creative about the things she wants to keep  could you make a collage out of it, photograph it and let her decide with to do with it?  Let her choose a container/bag/shelf and manage it herself?  Write her name AND a message to someone who might pick it up?  I bet if you set some healthy boundaries (that SHE helps create) for the both of you and then just let her collect freely, you&#39;d be amazed at the difference in behavior.  Be there to oooooh and awwwww over her stuff and (if you feel it&#39;s what she needs) gently help her decide the best thing to do with it - talk it through.  She might just keep everything for a while  be okay with that.  And good luck :) :) :)<br/>\n<br/>\nHope this helps in any small way,<br/>\nJulie<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Claire&quot;  wrote:<br/>\n&gt;<br/>\n&gt; As well as seconding Joyce&#39;s calm, nurturing suggestions, I wanted to pose some questions for the original poster to contemplate herself.<br/>\n&gt; I&#39;m not sure how long or how deeply you were involved with Waldorf parenting and education, but there are aspects of that philosophy that do not support the kind of partnership between parents and kids that we talk about here. Waldorf holds a lot of expectations around what children can and should do at certain ages, and also creates a schism between &#39;Mother&#39;s work&#39; and children&#39;s play.<br/>\n&gt; <br/>\n&gt; So I wanted to ask (without you having to answer on the list):<br/>\n&gt; - is it possible that your daughter feels very controlled? Have you limited her access to  the tv and computer? Controlled the kinds of toys she can have? Could her desire to keep everything be an attempt to exert some control over her world?<br/>\n&gt; <br/>\n&gt; - does your daughter seem anxious and insecure? Could it be that she is trying to create a sense of security through external objects, to compensate for a lack of inner security? Is the environment in your home warm and nurturing? Are you yourself prone to worry, and have you inadvertently modelled that to your daughter?<br/>\n&gt; <br/>\n&gt; Whether any of the above scenarios apply or not, still the approach Joyce outlined is the one that will bring you and your daughter closer together, and encourage you to fully and lovingly accept her for who she is.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Claire<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":324592498,"authorName":"Tori","from":"&quot;Tori&quot; &lt;tandosmama@...&gt;","profile":"tandosmama@bellsouth.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: help supporting daughter with letting go","postDate":"1359588527","msgId":70408,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtlY2FiZituMmZnQGVHcm91cHMuY29tPg=="},"prevInTopic":70407,"nextInTopic":70410,"prevInTime":70407,"nextInTime":70409,"topicId":70397,"numMessagesInTopic":0,"msgSnippet":"... That s my question too. Do you want her to be happy and to find her own way of making sense of the world or do you want her (and her behavior) to be more","messageBody":"<div id=\"ygrps-yiv-1470046033\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Joyce Fetteroll  wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; <br/>\n&gt; On Jan 30, 2013, at 7:49 AM, trish52101 wrote:<br/>\n&gt; <br/>\n&gt; &gt; I know that my fear of her becoming a hoarder is clouding my ability to come up with a solution that works<br/>\n&gt; <br/>\n&gt; Works for you or her?<br/>\n&gt; <br/>\n&gt; <br/>\n </span></blockquote>That&#39;s my question too. Do you want her to be happy and to find her own way of making sense of the world or do you want her (and her behavior) to be more convenient? She&#39;s such a young child and is finding magic in the simplest things! That&#39;s beautiful...if you can get past your own attachment to defining those things as garbage. <br/>\n<br/>\nMy husband and I are both artists; he&#39;s also an inventor, and we both keep all sorts of things, materials, etc that other folks would likely call garbage. We don&#39;t agree on what is worth keeping, but thankfully we can appreciate that the other might have ideas and uses for things that we can&#39;t personally envision.<br/>\n<br/>\nEach of us, when free to hang onto as much as we want, is capable of deciding when enough is enough, or when something is really better off in the trash. <br/>\n<br/>\nSome aspects of your daughter&#39;s collections are likely to be truly meaningful for her, but her need for more and more is likely connected to your need for making her let go.<br/>\n<br/>\nTori</div>","specialLinks":[]},{"userId":363518215,"authorName":"Claire","from":"&quot;Claire&quot; &lt;claire.horsley08@...&gt;","profile":"claire.horsley08","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: help supporting daughter with letting go","postDate":"1359583289","msgId":70399,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtlYzU3cCtpYXM1QGVHcm91cHMuY29tPg=="},"prevInTopic":70398,"nextInTopic":70400,"prevInTime":70398,"nextInTime":70400,"topicId":70397,"numMessagesInTopic":0,"msgSnippet":"As well as seconding Joyce s calm, nurturing suggestions, I wanted to pose some questions for the original poster to contemplate herself. I m not sure how long","messageBody":"<div id=\"ygrps-yiv-834888946\">As well as seconding Joyce&#39;s calm, nurturing suggestions, I wanted to pose some questions for the original poster to contemplate herself.<br/>\nI&#39;m not sure how long or how deeply you were involved with Waldorf parenting and education, but there are aspects of that philosophy that do not support the kind of partnership between parents and kids that we talk about here. Waldorf holds a lot of expectations around what children can and should do at certain ages, and also creates a schism between &#39;Mother&#39;s work&#39; and children&#39;s play.<br/>\n<br/>\nSo I wanted to ask (without you having to answer on the list):<br/>\n- is it possible that your daughter feels very controlled? Have you limited her access to  the tv and computer? Controlled the kinds of toys she can have? Could her desire to keep everything be an attempt to exert some control over her world?<br/>\n<br/>\n- does your daughter seem anxious and insecure? Could it be that she is trying to create a sense of security through external objects, to compensate for a lack of inner security? Is the environment in your home warm and nurturing? Are you yourself prone to worry, and have you inadvertently modelled that to your daughter?<br/>\n<br/>\nWhether any of the above scenarios apply or not, still the approach Joyce outlined is the one that will bring you and your daughter closer together, and encourage you to fully and lovingly accept her for who she is.<br/>\n<br/>\n<br/>\nClaire</div>","specialLinks":[]},{"userId":430847779,"authorName":"Jody","from":"&quot;Jody&quot; &lt;jlmccaw@...&gt;","profile":"jody.lilley","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: help supporting daughter with letting go","postDate":"1359572518","msgId":70400,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtlYnFuNitkZWM3QGVHcm91cHMuY29tPg=="},"prevInTopic":70399,"nextInTopic":70401,"prevInTime":70399,"nextInTime":70401,"topicId":70397,"numMessagesInTopic":0,"msgSnippet":"My 8 year old son doesn t like to throw anything away either.  He has kept various souvenir wrappers, candies that looked interesting/different, boxes toys","messageBody":"<div id=\"ygrps-yiv-1281229779\">My 8 year old son doesn&#39;t like to throw anything away either.  He has kept various &quot;souvenir&quot; wrappers, candies that looked interesting/different, boxes toys came in (some are used to play with, others we cut the pictures out and put up on his wall like posters - he wanted to do this).  He also has a nature collection that at times feels out of control to me - we did organize it into clear containers (he likes things organized).  When he runs out of space in his room (we have put tons of shelves etc in his room) we do help him to sort through what he wants in his room and what he doesn&#39;t anymore - but he doesn&#39;t want to get rid of any of it.  Some of it goes in boxes and into our storage room, some of it goes in the basement to play with.  But the choice is really his, I just try to come up with solutions.<br/>\n<br/>\nWhen he was much younger I did &quot;talk him into&quot; getting rid of things.  It always felt horrible, but I felt like we didn&#39;t have a choice.  I&#39;ve learned that there really are choices!<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;trish52101&quot;  wrote:<br/>\n&gt;<br/>\n&gt; Hi. I have a 5 1/2 year old daughter, Grace, that I am unschooling. We started out homeschooling in a mostly Waldorf way, but I felt like forcing lessons and crafts on her was taking the joy out of our days, so we stopped and have been learning about unschooling and trying to say yes more. <br/>\n&gt; <br/>\n&gt; One thing I would like some perspective and suggestions on is Grace&#39;s attachment to keeping things I would call trash. She doesn&#39;t want to throw anything away. In the past, I&#39;ve just told her that she has to throw it away or thrown stuff away myself, even if it upset her. I don&#39;t want to do that anymore. I have said that trash that comes from food (wrappers or napkins) can&#39;t be saved. We set up a shoe box for her to keep some paper or wrappings in, but soon it will be full. She wants to keep every package to toys, newspaper, and magazines. My struggle is that these items are truly important to her, but she has also kept every toy she has had since she was a baby, so we are running out of room. When we are discussing whether or not to throw something away, the phrase, &quot;one man&#39;s trash, another&#39;s treasure&quot; comes to mind. I think she feels like I&#39;m asking her to throw treasure away.<br/>\n&gt; <br/>\n&gt; It&#39;s the same way with things she draws on her chalkboard/whiteboard. She drew a picture on each side a few months ago and was crying yesterday because she wanted to draw a new picture but didn&#39;t want to erase the old one. She does that on the tablet drawing program, but I usually take a screen shot so she will have a picture of it. I took a picture of the chalkboard, but she was afraid she wouldn&#39;t be able to recreate it. <br/>\n&gt; <br/>\n&gt; I know that my fear of her becoming a hoarder is clouding my ability to come up with a solution that works, but I&#39;m not sure how to let go of that. I would like others&#39; perspective on the situation. I&#39;m not sure what my goal should be- to help her let go, or to find ways to keep more? If I should help her let go, how? We&#39;ve tried recycling and we&#39;ve started writing her name on what we recycle- she wants to see if she will ever find something with her name on it again. I know that won&#39;t happen, but it really makes her feel better so I haven&#39;t told her it won&#39;t. We also talk about how the mice at the dump could use what we are throwing away, and that seems to help a little. <br/>\n&gt; <br/>\n&gt; Thanks in advance,<br/>\n&gt; Trisha<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] help supporting daughter with letting go","postDate":"1359553156","msgId":70398,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI5Njk3MTExLTIzMDMtNDg0Qi05Q0JFLUFEQjU3NTJEQ0JCN0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGtlYjRzcSs0bGZiQGVHcm91cHMuY29tPg==","referencesHeader":"PGtlYjRzcSs0bGZiQGVHcm91cHMuY29tPg=="},"prevInTopic":70397,"nextInTopic":70399,"prevInTime":70397,"nextInTime":70399,"topicId":70397,"numMessagesInTopic":0,"msgSnippet":"... Works for you or her? People don t become hoarders because they never grasped the difference between trash and treasure! I d bet a lot of adult hoarders","messageBody":"<div id=\"ygrps-yiv-1073987718\">On Jan 30, 2013, at 7:49 AM, trish52101 wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I know that my fear of her becoming a hoarder is clouding my ability to come up with a solution that works<br/>\n<br/>\n </span></blockquote>Works for you or her?<br/>\n<br/>\nPeople don&#39;t become hoarders because they never grasped the difference between trash and treasure! I&#39;d bet a lot of adult hoarders grew up deprived and powerless.<br/>\n<br/>\nWork, instead, to see the world through her understanding. She&#39;s saving things that in *her* eyes are treasures. See the beauty in them. :-) Look at the colors. See the shininess. As her what she really likes about them.<br/>\n<br/>\nYou&#39;re making her feel powerless. What your&#39;e basically saying to her is that she isn&#39;t smart enough to understand what a treasure is so you need to keep telling her until she sees the world the right way like you.<br/>\n<br/>\nMy daughter Kat never met a dropped pencil or pen she didn&#39;t want to bring home with her. And we ended up with half a dozen shoeboxes of both -- that she spent many hours lovingly sorting. Her electric pencil sharpener needed replaced twice. There were also Beanie Babies. And Pokemon. Every drawing she ever made. But at 21, while she still likes to collect, she makes thoughtful decisions about what to collect. Her house does not look like a hoarder.<br/>\n<br/>\nI had a bucket she could drop rocks into that she brought home. I think the one mistake I made was putting her toy collections into the extra room that became the toy room. But she rarely went in there except to grab something so in a way it went into a black hole.<br/>\n<br/>\nTake pictures of the blackboard. <br/>\n<br/>\nTake pictures of other things like the wrappers. But *not* as a way to force her to give them up. Give her options so she can choose.<br/>\n<br/>\nLet her decide what to throw away and what to keep. Help her organize it.<br/>\n<br/>\nThe more power she has over her world, the less she&#39;ll fear she needs to keep an iron grip on what she has to keep it from being ripped from her.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":528259386,"authorName":"trish52101","from":"&quot;trish52101&quot; &lt;simplycrunchy@...&gt;","profile":"trish52101","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"help supporting daughter with letting go","postDate":"1359550170","msgId":70397,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtlYjRzcSs0bGZiQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":70398,"prevInTime":70396,"nextInTime":70398,"topicId":70397,"numMessagesInTopic":0,"msgSnippet":"Hi. I have a 5 1/2 year old daughter, Grace, that I am unschooling. We started out homeschooling in a mostly Waldorf way, but I felt like forcing lessons and","messageBody":"<div id=\"ygrps-yiv-315182431\">Hi. I have a 5 1/2 year old daughter, Grace, that I am unschooling. We started out homeschooling in a mostly Waldorf way, but I felt like forcing lessons and crafts on her was taking the joy out of our days, so we stopped and have been learning about unschooling and trying to say yes more. <br/>\n<br/>\nOne thing I would like some perspective and suggestions on is Grace&#39;s attachment to keeping things I would call trash. She doesn&#39;t want to throw anything away. In the past, I&#39;ve just told her that she has to throw it away or thrown stuff away myself, even if it upset her. I don&#39;t want to do that anymore. I have said that trash that comes from food (wrappers or napkins) can&#39;t be saved. We set up a shoe box for her to keep some paper or wrappings in, but soon it will be full. She wants to keep every package to toys, newspaper, and magazines. My struggle is that these items are truly important to her, but she has also kept every toy she has had since she was a baby, so we are running out of room. When we are discussing whether or not to throw something away, the phrase, &quot;one man&#39;s trash, another&#39;s treasure&quot; comes to mind. I think she feels like I&#39;m asking her to throw treasure away.<br/>\n<br/>\nIt&#39;s the same way with things she draws on her chalkboard/whiteboard. She drew a picture on each side a few months ago and was crying yesterday because she wanted to draw a new picture but didn&#39;t want to erase the old one. She does that on the tablet drawing program, but I usually take a screen shot so she will have a picture of it. I took a picture of the chalkboard, but she was afraid she wouldn&#39;t be able to recreate it. <br/>\n<br/>\nI know that my fear of her becoming a hoarder is clouding my ability to come up with a solution that works, but I&#39;m not sure how to let go of that. I would like others&#39; perspective on the situation. I&#39;m not sure what my goal should be- to help her let go, or to find ways to keep more? If I should help her let go, how? We&#39;ve tried recycling and we&#39;ve started writing her name on what we recycle- she wants to see if she will ever find something with her name on it again. I know that won&#39;t happen, but it really makes her feel better so I haven&#39;t told her it won&#39;t. We also talk about how the mice at the dump could use what we are throwing away, and that seems to help a little. <br/>\n<br/>\nThanks in advance,<br/>\nTrisha</div>","specialLinks":[]}],"prevTopicId":70463,"nextTopicId":70465}}