{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"The value of living in this moment","postDate":"1339147900","msgId":67556,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEMyOEJCRUE2LUVEN0EtNDAxOS1BQzg0LTY2MUUxMkUzNzQyRUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":67555,"nextInTime":67557,"topicId":67556,"numMessagesInTopic":0,"msgSnippet":"In another discussion someone mentioned, of unreliable friends, that  making plans with them lead to more frustration in our lives and interfered with us","messageBody":"<div id=\"ygrps-yiv-1884878690\">In another discussion someone mentioned, of unreliable friends, that  &quot;making plans with them lead to more frustration in our lives and interfered with us pursuing friendships with people who really would come through.&quot;<br/>\n<br/>\nI responded with all this, and have been thinking about it further:<br/>\n<br/>\n----------------------------------------------------------<br/>\nAH! I see part of your problem.<br/>\nYou were &quot;pursuing friendships.&quot;<br/>\nDon&#39;t.<br/>\n<br/>\nDo something one day. Meet at the park. Be there, at the park, with the people who are there. Not for any purpose other than being at the park, or maybe playing a game, or sharing food, or making something, or whatever the plan of the day was.<br/>\n<br/>\nWhen you meet, just meet.<br/>\nWhen you play, just play.<br/>\n<br/>\nIf it never, ever happens again, it still did really happen once. Let that be enough.<br/>\n----------------------------------------------------------<br/>\n<br/>\nYears ago, a family moved to New Mexico from Alabama.  I have mentioned them before, because their three children (their one boy, especially) were wild at our house when they came to play, because they were very controlled at their own.  <br/>\n<br/>\nThe cultures from those two parts of the U.S. are about as different as can be.<br/>\n<br/>\nBoth parents were from military families for at least two generations back--lifers on both sides.  After having been a tank commander or some such, the dad of this current family had left the army, and was working where my husband worked, and they were also in the SCA (medieval studies group), which is why we knew them.  That&#39;s only important because of the next story, which has to do with &quot;pursuing friendships.&quot;<br/>\n<br/>\nThe mom called me one day and asked if I could get a babysitter so that we could go out for coffee and talk about our relationship.  I guess the reason she wanted to talk about it was that she sensed I was keeping myself distant, and wasn&#39;t fully impressed with her, and wasn&#39;t choosing her company over that of others.   She wanted to improve the friendship, but didn&#39;t want to change the way she was.  Or at least she didn&#39;t want to make any unnecessary changes, I guess, but wanted to meet with me to see what she would need to do at a minimum to secure my closer friendship.<br/>\n<br/>\nIt kind of shocked me.  I said no, that friendships needed to develop gradually, or be politely allowed NOT to develop.  That the relationship we had WAS &quot;our relationship.&quot;  It was right where it was.<br/>\n<br/>\nShe, though, wanted to control me, and manipulate the social situation so that she was better friends with me than she was with others, and than I was with some others.  WHOA!!!<br/>\n<br/>\nI was NOT going to pay money to leave my kids with someone else, to meet with her.  But I did continue the conversation on the phone, and it turned out that one of our differences was that I spent all my years from the ages of 7 to 17 in the same house, in the same school, and learned to invest gradually in longterm friendships.   She, with her father in the military, had moved from town to town every two years or more, and her parents having done the same didn&#39;t know any different but to advise her to &quot;make friends.&quot;  <br/>\n<br/>\nShe admitted that it had always been her pattern to move in and choose her friends, contrive to make them her friends, knowing she would move away again and assuming that they could pick up where they left off with  their previous friends when she inevitably moved away.<br/>\n<br/>\nI told her I had learned to be the kind of person others wouldn&#39;t mind continuing to have in their lives for many years.  <br/>\n<br/>\nPeople like others for different kinds of reasons, too, so no amount of being the nicest person I can be can guarantee the affection of any other particular person.  Friendships work a little like romances.  Some people will just not click.<br/>\n<br/>\nBlaming another person for not being a good friend, then, seems wrong.  Friendships wax and wane.  They ebb and flow.<br/>\n<br/>\nBeing a solid, whole person remains with us, and in us, and helps our family.  It probably helps attract and keep friends, too.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":67272,"nextTopicId":67531}}