{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Gayle Bechtel","from":"&quot;Gayle Bechtel&quot; &lt;jbabi@...&gt;","replyTo":"LIST","senderId":"EIgphNiIbrkx68L2BldIVezMjXbT2bc0FrmZ7QOAtxIPCJa8uws0n62dzx8GPzxjl44cfK9nOmUXgJohrbXi_a3Rnh93G-A","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Internet myths","postDate":"952314691","msgId":6967,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMjEwMWJmODcxZiQ0MjUzZmU0MCQxNTNkMGExOEBiYXljdHkxLm1pLmhvbWUuY29tPg==","referencesHeader":"PDgxNTI0ODMuOTUxODYxMTY3NzgyLkphdmFNYWlsLmltYWlsQGRlcmJ5PiA8MDAxZDAxYmY4MzI2JDhjZTZlMDAwJGIwMGFiZWNmQGdhdGUubmV0Pg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":6966,"nextInTime":6968,"topicId":6967,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-441033182\">\n<html><head>\n \n \n<style></style>\n</head>\n \n<div>&nbsp;</div>\n<div><font face=\"Times New Roman\"></font>&nbsp;</div>\n<div><font face=\"Times New Roman\">&lt;&lt; For all of you who have gotten all of \nthose e-mails that promise wealth, <br>happiness, etc. if you send this email to \n10 billion people,&nbsp; and those <br>emails that alarm and frighten - here \nthey all are rolled into one.&nbsp; <br>&nbsp;<br>&nbsp;<br>&nbsp;I was on my \nway to the post office to pick up my case of free M&amp;M&#39;s,(sent to <br>me \nbecause I forwarded their e-mail to five other people, celebrating the <br>fact \nthat the year 2000 is &quot;MM&quot; in Roman numerals), when I ran into a friend \n<br>whose neighbor, a young man, was home recovering from having been served a \n<br>rat in his bucket of Kentucky Fried Chicken - which is predictable, since as \n<br>everyone knows, there&#39;s no actual chicken in Kentucky Fried Chicken, which \nis <br>why the government made them change their name to KFC.<br>&nbsp; \n<br>&nbsp;Anyway, one day this guy went to sleep and when he awoke he was in his \n<br>bathtub and it was full of ice and he was sore all over and when he got out \n<br>of the tub he realized that HIS KIDNEYS HAD BEEN STOLEN. He saw a note on \nhis <br>mirror that said &quot;Call 911!&quot; but he was afraid to use his phone because \nit <br>was connected to his computer, and there was a virus on his computer that \n<br>would destroy his hard drive if he opened e-mail entitled &quot;Join the \ncrew!&quot;<br>&nbsp;<br>&nbsp;He knew it wasn&#39;t a hoax because he himself was a \ncomputer programmer who <br>was working on software to prevent a global disaster \nin which all the <br>computers get together and distribute the $250.00 \nNeiman-Marcus cookie recipe <br>under the leadership of Bill Gates. (It&#39;s true - \nI read it all last week in a <br>mass e-mail from BILL GATES HIMSELF, who was \nalso promising me a free Disney <br>World vacation and $5,000 if I would forward \nthe e-mail to everyone I know.)<br>&nbsp; <br>&nbsp;The poor man then tried to \ncall 911 from a pay phone to report his missing <br>kidneys, but a voice on the \nline first asked him to press #90, which <br>unwittingly gave the bandit full \naccess to the phone line at the guy&#39;s <br>expense.<br>&nbsp; <br>&nbsp;Then, \nreaching into the coin-return slot he got jabbed with an HIV-infected <br>needle \naround which was wrapped around a note that said, &quot;Welcome to the <br>world of \nAIDS.&quot; Luckily he was only a few blocks from the hospital - the one&nbsp; \n<br>where that little boy who is dying of cancer is, the one whose last wish is \n<br>for everyone in the world to send him an e-mail and the American Cancer \n<br>Society has agreed to pay him a nickel for every e-mail he receives.&nbsp; I \nsent <br>him two e-mails and one of them was a bunch of x&#39;s and o&#39;s in the shape \nof an <br>angel (if you get it and forward it to more than 10 people, you will \nhave <br>good luck but for 10 people you will only have OK luck and if you send \nit to <br>fewer than 10 people you will have BAD LUCK FOR SEVEN \nYEARS).<br>&nbsp; <br>&nbsp;So anyway the poor guy tried to drive himself to the \nhospital, but on the <br>way he noticed another car driving without its lights \non. To be helpful, he <br>flashed his lights at him and was promptly shot as \npart of a gang initiation. <br>Send THIS to all the friends who send you their \njunk mail and you will <br>receive 4 green m&amp;ms, but if you don&#39;t the owner \nof Proctor and Gamble will <br>report you to his Satanist friends and you will \nhave more bad luck: you will <br>get cancer from the Sodium Laureth Sulfate in \nyour<br>&nbsp;shampoo, your wife will develop breast cancer from using the \nantiperspirant <br>which clogs the pores under your arms, and the government \nwill put a tax on <br>your e-mails forever. I know this is all true &#39;cause I \nread it on the <br>Internet.</font></div></html></div>","specialLinks":[]}],"prevTopicId":6963,"nextTopicId":6897}}