{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":60629766,"authorName":"heather mclean","from":"heather mclean &lt;heather_200115@...&gt;","profile":"heather_200115","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] combative mil","postDate":"1067828359","msgId":17193,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMxMTAzMDI1OTE5LjcxNjM0LnFtYWlsQHdlYjQwNzA0Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDIwMDMxMDI4MTYwMTM3LjMzMzEwLnFtYWlsQHdlYjE0MjA4Lm1haWwueWFob28uY29tPg=="},"prevInTopic":17131,"nextInTopic":0,"prevInTime":17192,"nextInTime":17194,"topicId":17103,"numMessagesInTopic":0,"msgSnippet":"Retta, Thank you so much for this.  This is just what I needed to hear.  I haven t been reading this list for awhile.  Went on a 3 and 1/2 month vacation & am ","messageBody":"<div id=\"ygrps-yiv-1967978861\">Retta,<br/>\n<br/>\nThank you so much for this.  This is just what I<br/>\nneeded to hear.  I haven&#39;t been reading this list for<br/>\nawhile.  Went on a 3 and 1/2 month vacation & am<br/>\nfinally getting back on schedule.  Anyway, I just<br/>\ncalled my parents last week & my mom told me about a<br/>\nletter she is writing to me.  She said she doesn&#39;t<br/>\nwant to alienate us BUT she has to write this<br/>\nletter... I was getting upset about it, even though I<br/>\nknew I shouldn&#39;t.  I don&#39;t even have the letter yet<br/>\nLOL!  I just wanted to say THANKS<br/>\n<br/>\nheather m<br/>\ntucson az<br/>\n<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; Welcome to the group!  This situation with your mil,<br/>\n&gt; I would make as strong as intention as possible to<br/>\n&gt; give up trying to convince her or anyone else of<br/>\n&gt; anything.  You can no more convince her of your way<br/>\n&gt; than she can convince you of hers.  Any force<br/>\n&gt; creates it&#39;s own counterforce.<br/>\n&gt;  <br/>\n&gt; I would not bring up parenting issues with her.  If<br/>\n&gt; she introduces the subject and starts trying to<br/>\n&gt; convince you, I&#39;d adopt the same attitude with her<br/>\n&gt; that I endeavor to adopt with my children.  That is,<br/>\n&gt; one of an open hearted tenderness.  Trust that if<br/>\n&gt; you allow her to be who she is, she too can unfold<br/>\n&gt; into a beautiful adult, but not by anyone trying to<br/>\n&gt; &quot;grow her.&quot;  You wouldn&#39;t put a seed into the ground<br/>\n&gt; and then dig it up to see if it&#39;s growing.  Your<br/>\n&gt; life is the seed.  Seeds must be let alone, watered,<br/>\n&gt; and trusted.<br/>\n&gt;  <br/>\n&gt; If she brings it up I&#39;d say things like, &quot;Mom, I&#39;m<br/>\n&gt; doing this because I feel in my heart that it is<br/>\n&gt; truly the right thing for me to be doing right now. <br/>\n&gt; I really don&#39;t want to talk about it.  How&#39;s your<br/>\n&gt; quilting bee coming?&quot;  If she dodges the quilting<br/>\n&gt; bee or whatever question, I&#39;d gently say again &quot;I<br/>\n&gt; don&#39;t want to talk about that&quot; or &quot;I&#39;m not going to<br/>\n&gt; talk about that.&quot;  Just stop talking and let her<br/>\n&gt; talk til she&#39;s done or talk to someone else about<br/>\n&gt; something else or stand up and leave the room.  <br/>\n&gt;  <br/>\n&gt; Kids are wonderful to start a separate conversation<br/>\n&gt; with in these situations because it is really<br/>\n&gt; joyful, plus we&#39;re modeling for them how to follow<br/>\n&gt; your own joy and not waste precious energy on power<br/>\n&gt; struggles.  Giving up that need to defend oneself<br/>\n&gt; says far more than any words.  It says I trust that<br/>\n&gt; I&#39;m doing the right thing and what anyone else<br/>\n&gt; thinks doesn&#39;t matter.  Gandhi knew this secret and<br/>\n&gt; he changed his country!  If there&#39;s nothing to push<br/>\n&gt; against, people stop pushing.<br/>\n&gt;  <br/>\n&gt; I had a friend who was a psychologist.  She used to<br/>\n&gt; go to a gym to swim.  A woman there found out she<br/>\n&gt; was a psychologist and she&#39;d start dumping on her<br/>\n&gt; about her problems at the poolside.  My friend would<br/>\n&gt; get into the pool and say, &quot;I&#39;m going under the<br/>\n&gt; water now.&quot;  A neutral statement.  We get to choose<br/>\n&gt; what we&#39;ll talk about, own our own power.  Just<br/>\n&gt; gotta give up that need to defend ourselves or<br/>\n&gt; convince anyone of anything.<br/>\n<br/>\n<br/>\n </span></blockquote>__________________________________<br/>\nDo you Yahoo!?<br/>\nExclusive Video Premiere - Britney Spears<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://launch.yahoo.com/promos/britneyspears/\">http://launch.yahoo.com/promos/britneyspears/</a></div>","specialLinks":[]},{"userId":129305212,"authorName":"Cynthia Hagedorn","from":"Cynthia Hagedorn &lt;cshagedorn@...&gt;","profile":"cshagedorn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] combative mil","postDate":"1067543904","msgId":17131,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMxMDMwMTk1ODI0LjgxMjMxLnFtYWlsQHdlYjEzMjA1Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDNGOUVGNjk0LjkwNDA4MDVAZWFydGhsaW5rLm5ldD4="},"prevInTopic":17112,"nextInTopic":17193,"prevInTime":17130,"nextInTime":17132,"topicId":17103,"numMessagesInTopic":0,"msgSnippet":"One thing that has helped me... (I suspect anyway....) My MIL  is a kindergarten teacher AND is very VERY nosey.... I have a well-selected group of books next","messageBody":"<div id=\"ygrps-yiv-1765931728\">One thing that has helped me... (I suspect anyway....) <br/>\n <br/>\nMy MIL  is a kindergarten teacher AND is very VERY nosey.... I have a well-selected group of books next to our reading chair... (Learning all the Time-Holt: Teenage Liberation Handbook: What happened to recess...among a few....)  On top of the changing pile of a few books I have a small nice frame with one word in it... Wonder.     <br/>\n <br/>\nWe call it art<br/>\n <br/>\nCynthia<br/>\nps. I love this group!!!<br/>\n<br/>\nBetsy &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ecsamhill@...\">ecsamhill@...</a>&gt; wrote:<br/>\n<br/>\n<br/>\n**<br/>\nI do that too - I say &quot;I am going to check on Liam&quot;, or &quot;I think I <br/>\nforgot something in the car&quot;. It has been brought up that I am aloof and<br/>\nnon-engaging in conversation with Helen.**<br/>\n<br/>\nHeh, so she *admits* she&#39;s been baiting you?  (Just one way of <br/>\ninterpreting her statement.)<br/>\n<br/>\nBetsy<br/>\n<br/>\n<br/>\nYahoo! Groups SponsorADVERTISEMENT<br/>\n<br/>\nTo unsubscribe from this group, send an email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning-unsubscribe@yahoogroups.com\">AlwaysLearning-unsubscribe@yahoogroups.com</a><br/>\n<br/>\n<br/>\n<br/>\nYour use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\nExclusive Video Premiere - Britney Spears<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2300774,"authorName":"Betsy","from":"Betsy &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] combative mil","postDate":"1067382420","msgId":17112,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNGOUVGNjk0LjkwNDA4MDVAZWFydGhsaW5rLm5ldD4=","referencesHeader":"PDUuMi4xLjEuMi4yMDAzMTAyODEyNTIzNy4wMTllYWU5OEBwb3AuY2hhcnRlci5uZXQ+"},"prevInTopic":17110,"nextInTopic":17131,"prevInTime":17111,"nextInTime":17113,"topicId":17103,"numMessagesInTopic":0,"msgSnippet":"** I do that too - I say I am going to check on Liam , or I think I forgot something in the car . It has been brought up that I am aloof and non-engaging in","messageBody":"<div id=\"ygrps-yiv-1275942693\">**<br/>\nI do that too - I say &quot;I am going to check on Liam&quot;, or &quot;I think I <br/>\nforgot something in the car&quot;. It has been brought up that I am aloof and<br/>\nnon-engaging in conversation with Helen.**<br/>\n<br/>\nHeh, so she *admits* she&#39;s been baiting you?  (Just one way of <br/>\ninterpreting her statement.)<br/>\n<br/>\nBetsy</div>","specialLinks":[]},{"userId":160678518,"authorName":"Flora","from":"Flora &lt;fjestice@...&gt;","profile":"fjestice_1999","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] combative mil","postDate":"1067365500","msgId":17110,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUuMi4xLjEuMi4yMDAzMTAyODEyNTIzNy4wMTllYWU5OEBwb3AuY2hhcnRlci5uZXQ+","inReplyToHeader":"PDIwMDMxMDI4MTYwMTM3LjMzMzEwLnFtYWlsQHdlYjE0MjA4Lm1haWwueWFob28uY29tPg=="},"prevInTopic":17103,"nextInTopic":17112,"prevInTime":17109,"nextInTime":17111,"topicId":17103,"numMessagesInTopic":0,"msgSnippet":"... Thanks - I don t wish to convince her - I know the proof will be in the pudding. Liam (and future munchkins) will be happy well adjusted children. I am","messageBody":"<div id=\"ygrps-yiv-1760584943\"><blockquote><span title=\"ireply\">&gt;Welcome to the group!  This situation with your mil, I would make as <br/>\n&gt;strong as intention as possible to give up trying to convince her or <br/>\n&gt;anyone else of anything.  You can no more convince her of your way than <br/>\n&gt;she can convince you of hers.  Any force creates it&#39;s own counterforce.<br/>\n<br/>\n </span></blockquote>Thanks - I don&#39;t wish to convince her - I know the proof will be in the <br/>\npudding. Liam (and future munchkins) will be happy well adjusted children. <br/>\nI am fairly confident. I just want it to be as gentle of a conversation as <br/>\npossible.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I would not bring up parenting issues with her.  If she introduces the <br/>\n&gt;subject and starts trying to convince you, I&#39;d adopt the same attitude <br/>\n&gt;with her that I endeavor to adopt with my children.  That is, one of an <br/>\n&gt;open hearted tenderness.<br/>\n<br/>\n </span></blockquote>You have a lot of love for your children. That certainly makes it easier. <br/>\nIt is hard to be kind to someone who is not - although I am working on it...<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;If she brings it up I&#39;d say things like, &quot;Mom, I&#39;m doing this because I <br/>\n&gt;feel in my heart that it is truly the right thing for me to be doing right <br/>\n&gt;now.  I really don&#39;t want to talk about it.  How&#39;s your quilting bee <br/>\n&gt;coming?&quot;  If she dodges the quilting bee or whatever question, I&#39;d gently <br/>\n&gt;say again &quot;I don&#39;t want to talk about that&quot; or &quot;I&#39;m not going to talk <br/>\n&gt;about that.&quot;  Just stop talking and let her talk til she&#39;s done or talk to <br/>\n&gt;someone else about something else or stand up and leave the room.<br/>\n<br/>\n </span></blockquote>I don&#39;t wish to change her in any way. I have started trying to do what a <br/>\nfriend suggested which is to compliment someone who is grumpy - in a <br/>\nsincere way. I tried this last time we visited when she made a comment <br/>\nabout Liam still nursing. I said &quot;Wow, Helen! You really went all out for <br/>\ndinner tonight - it smells so wonderful!&quot; It did work...for me.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Kids are wonderful to start a separate conversation with in these <br/>\n&gt;situations because it is really joyful, plus we&#39;re modeling for them how <br/>\n&gt;to follow your own joy and not waste precious energy on power struggles.<br/>\n<br/>\n&gt;Giving up that need to defend oneself says far more than any words.  It <br/>\n&gt;says I trust that I&#39;m doing the right thing and what anyone else thinks <br/>\n&gt;doesn&#39;t matter.  Gandhi knew this secret and he changed his country!  If <br/>\n&gt;there&#39;s nothing to push against, people stop pushing.<br/>\n<br/>\n </span></blockquote>That is a great quote - I will suggest that one to Sean, too. We have a <br/>\ntendency to be non combative with them, but vent in the car on the way <br/>\nhome, which is also hard - I really should just let go, which is not as <br/>\neasy for Sean - they&#39;re his parents...I think he feels kinda sad - like he <br/>\nmissed out on the connection with them. He and his father are <br/>\nre-connecting, but it seems like mother is moving further from reality. She <br/>\nis bitter about a lot of things...I think about a lot of the choices she <br/>\nmade in her life, and so is trying to justify them by defending the way she <br/>\ndid things...sorry - rambling - thanks again for the advice.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I had a friend who was a psychologist.  She used to go to a gym to <br/>\n&gt;swim.  A woman there found out she was a psychologist and she&#39;d start <br/>\n&gt;dumping on her about her problems at the poolside.  My friend would get <br/>\n&gt;into the pool and say, &quot;I&#39;m going under the water now.&quot;  A neutral <br/>\n&gt;statement.  We get to choose what we&#39;ll talk about, own our own <br/>\n&gt;power.  Just gotta give up that need to defend ourselves or convince <br/>\n&gt;anyone of anything.<br/>\n<br/>\n </span></blockquote>I do that too - I say &quot;I am going to check on Liam&quot;, or &quot;I think I forgot <br/>\nsomething in the car&quot;. It has been brought up that I am aloof and <br/>\nnon-engaging in conversation with Helen. That doesn&#39;t bother me, though. I <br/>\nguess I just wanted some sound info to bring to a conversation, that&#39;s all. <br/>\nI like to meet people where they&#39;re at. In other words, &quot;It just feels <br/>\nright to me&quot; wont go over as well as &quot;Homeschooled children scored higher <br/>\nthan public schooled children in blah blah blah&quot;. Although it does feel <br/>\nright to me, and I personally could care less about statistics, or tests. I <br/>\ndon&#39;t want to be insincere, just informative...<br/>\n<br/>\nThanks again :) <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":109501676,"authorName":"Retta","from":"Retta &lt;rettafontana@...&gt;","profile":"rettafontana","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"combative mil","postDate":"1067356897","msgId":17103,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMxMDI4MTYwMTM3LjMzMzEwLnFtYWlsQHdlYjE0MjA4Lm1haWwueWFob28uY29tPg=="},"prevInTopic":0,"nextInTopic":17110,"prevInTime":17102,"nextInTime":17104,"topicId":17103,"numMessagesInTopic":0,"msgSnippet":"Hi Flora, Welcome to the group!  This situation with your mil, I would make as strong as intention as possible to give up trying to convince her or anyone else","messageBody":"<div id=\"ygrps-yiv-755927276\">Hi Flora, <br/>\n <br/>\nWelcome to the group!  This situation with your mil, I would make as strong as intention as possible to give up trying to convince her or anyone else of anything.  You can no more convince her of your way than she can convince you of hers.  Any force creates it&#39;s own counterforce.<br/>\n <br/>\nI would not bring up parenting issues with her.  If she introduces the subject and starts trying to convince you, I&#39;d adopt the same attitude with her that I endeavor to adopt with my children.  That is, one of an open hearted tenderness.  Trust that if you allow her to be who she is, she too can unfold into a beautiful adult, but not by anyone trying to &quot;grow her.&quot;  You wouldn&#39;t put a seed into the ground and then dig it up to see if it&#39;s growing.  Your life is the seed.  Seeds must be let alone, watered, and trusted.<br/>\n <br/>\nIf she brings it up I&#39;d say things like, &quot;Mom, I&#39;m doing this because I feel in my heart that it is truly the right thing for me to be doing right now.  I really don&#39;t want to talk about it.  How&#39;s your quilting bee coming?&quot;  If she dodges the quilting bee or whatever question, I&#39;d gently say again &quot;I don&#39;t want to talk about that&quot; or &quot;I&#39;m not going to talk about that.&quot;  Just stop talking and let her talk til she&#39;s done or talk to someone else about something else or stand up and leave the room.  <br/>\n <br/>\nKids are wonderful to start a separate conversation with in these situations because it is really joyful, plus we&#39;re modeling for them how to follow your own joy and not waste precious energy on power struggles.  Giving up that need to defend oneself says far more than any words.  It says I trust that I&#39;m doing the right thing and what anyone else thinks doesn&#39;t matter.  Gandhi knew this secret and he changed his country!  If there&#39;s nothing to push against, people stop pushing.<br/>\n <br/>\nI had a friend who was a psychologist.  She used to go to a gym to swim.  A woman there found out she was a psychologist and she&#39;d start dumping on her about her problems at the poolside.  My friend would get into the pool and say, &quot;I&#39;m going under the water now.&quot;  A neutral statement.  We get to choose what we&#39;ll talk about, own our own power.  Just gotta give up that need to defend ourselves or convince anyone of anything.<br/>\n <br/>\nRetta<br/>\n <br/>\n <br/>\nHi!<br/>\n<br/>\nI am new here. I am on a few other homeschool/unschool lists. You guys <br/>\nare <br/>\ngreat! Really informative, and inspiring. I have a 2 year old son who <br/>\nis <br/>\ngoing to be unschooled. We have yet to convey this idea to my in-laws <br/>\nwho <br/>\nare pretty much against every other parenting idea we have implemented <br/>\n(co-sleeping, breastfeeding, gentle parenting, etc.). My mil thinks <br/>\nthat <br/>\nall children need &quot;training&quot;. She once said &quot;Children are god&#39;s way of <br/>\npunishing you for enjoying sex.&quot; Any ideas about how to bring up the <br/>\nidea <br/>\nwithout getting kicked out of the will? &lt;g&gt; I was thinking of <br/>\narticles/statistics...any good ones? Books are too much - I need some <br/>\nfairly quick come-backs. I was thinking of bringing up homeschooling <br/>\nfirst <br/>\nand not even broaching the idea of unschooling until I see how it <br/>\nsettles.<br/>\n<br/>\nThanks a lot!<br/>\n<br/>\n~Flora, Sean (dh) and Liam (ds)<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\nExclusive Video Premiere - Britney Spears<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":17185,"nextTopicId":17133}}