{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":522719163,"authorName":"","from":"sukaynalabboun@...","profile":"sukaynalabboun","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Older unschoolers and wanting to test for unversity/ stress","postDate":"1482363669","msgId":77598,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEUyQ0NGMkMwLTRGQzctNENENi1CMUE1LUFBMDg0RURDQURCMkB5YWhvby5jb20+","inReplyToHeader":"PDEzMTgyMjBBLUJEMUEtNEQ4Mi05RjEzLUFBMEEyODk1NTc3NEBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDRFNkY0ODA4LUI0MUQtNEVCRi1BQTkyLUU2RDdBQTE4OTM2N0B5YWhvby5jb20+IDwxMzE4MjIwQS1CRDFBLTREODItOUYxMy1BQTBBMjg5NTU3NzRAU2FuZHJhZG9kZC5jb20+"},"prevInTopic":77597,"nextInTopic":0,"prevInTime":77597,"nextInTime":77599,"topicId":77596,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-552077352\"><blockquote><span title=\"qreply\">&gt; <br/>\n&gt; If they’re aware of Khan Academy videos, for assistance with getting particular concepts, and if you say “if there’s anything I can do to help, let me know,” maybe that’s enough to give you permission to relax.    If the tests can be re-taken later, maybe encourage them to take them even before they feel fully prepared.  MAYBE they’ll pass anyway.  Maybe they will learn more about what the test is like and be calmer while preparing for a second attempt.<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; <br/>\n&gt; -<br/>\n&gt; Ok thank you. They have been using Khan Academy for fun for a while- I have also emphasized they can take the test as much as needed until passing, and that it is highly likely they will pass, all they need is to pass, etc. for admissions. I guess I need to relax and try to let them do the same. After all this deschooling, maybe I am overly sensitive to their mild-ish complaints.  I like the idea of giving myself permission to relax- to not get stressed while doing all I can to be supportive. I&#39;ll work on that 😉<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Older unschoolers and wanting to test for unversity/ stress","postDate":"1482345195","msgId":77597,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTgyMjBBLUJEMUEtNEQ4Mi05RjEzLUFBMEEyODk1NTc3NEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDRFNkY0ODA4LUI0MUQtNEVCRi1BQTkyLUU2RDdBQTE4OTM2N0B5YWhvby5jb20+","referencesHeader":"PDRFNkY0ODA4LUI0MUQtNEVCRi1BQTkyLUU2RDdBQTE4OTM2N0B5YWhvby5jb20+"},"prevInTopic":77596,"nextInTopic":77598,"prevInTime":77596,"nextInTime":77598,"topicId":77596,"numMessagesInTopic":0,"msgSnippet":"If they’re aware of Khan Academy videos, for assistance with getting particular concepts, and if you say “if there’s anything I can do to help, let me","messageBody":"<div id=\"ygrps-yiv-214599209\">If they’re aware of Khan Academy videos, for assistance with getting particular concepts, and if you say “if there’s anything I can do to help, let me know,” maybe that’s enough to give you permission to relax.    If the tests can be re-taken later, maybe encourage them to take them even before they feel fully prepared.  MAYBE they’ll pass anyway.  Maybe they will learn more about what the test is like and be calmer while preparing for a second attempt.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":522719163,"authorName":"Sukayna Labboun","from":"Sukayna Labboun &lt;sukaynalabboun@...&gt;","profile":"sukaynalabboun","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Older unschoolers and wanting to test for unversity/ stress","postDate":"1482321734","msgId":77596,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRFNkY0ODA4LUI0MUQtNEVCRi1BQTkyLUU2RDdBQTE4OTM2N0B5YWhvby5jb20+"},"prevInTopic":0,"nextInTopic":77597,"prevInTime":77595,"nextInTime":77597,"topicId":77596,"numMessagesInTopic":0,"msgSnippet":"Apologies for a somewhat schoolish question! I wanted to ask if anyone has any advice or help to offer in the case of older, teenaged unschoolers who are","messageBody":"<div id=\"ygrps-yiv-42863928\">Apologies for a somewhat schoolish question!<br/>\n<br/>\nI wanted to ask if anyone has any advice or help to offer in the case of older, teenaged unschoolers who are choosing to study for entrance exams. I will give a bit of background, bearing in mind it is indeed situational because of the requirements in our area. Universities here require a BAC 2 exam for entrance, which is easy to test for at National Exams yearly. It is a much more rigorous exam than the SAT as the math and science element are more of what is usually required to obtain a Bachelors (four year) degree in the states. There is Arabic as well, the other subjects are ones we feel very confident about and need little to no prep. My two oldest girls (18 and 15) have independently decided they want to take the exams to have them out of the way if and when they decide to attend University- we have been very careful to support them in their interests, and to frankly discuss the matter in terms of our not expecting them to follow any specific course…also, offering support in any route they choose- so I am confident they have chosen this of their own accord.<br/>\n<br/>\nThe areas of study are divided into maths and sciences or arts, so they must do more math if they choose biology (which they love, and have chosen)…so that involves a bit more book work. My husband is an engineer, math major so he is free to spend a lot of time on this patiently and it is going well- we ordered text books and study guides in the vein of being supportive. <br/>\n<br/>\nThe heart of my question is this: How can I help more on those days when it seems they are frustrated with not having enough time? Is this just part of life and I should remain sympathetic but not worry? (ex: I want to paint and go for a walk and have a goal of one hours math each day to build up to the test, but it feels like I am on a more rigid schedule and I don’t quite like it- this is what they sometimes say, summarised). So if I tell them there is all the time in the world to study for the exam, no pressure- then they might think I am not taking it seriously. If I tell them to make studies a priority, they might think I really do want them to go to college like ‘everyone else’.<br/>\n<br/>\nAlso, I am worried (inside) that societal pressure to be ‘doing something’ is behind this, and after much reassurance from them this is not the case, they still sometimes come up feeling stressed somehow. Is this just the way it is going to be, or am I missing some way to balance supporting them and not pressuring? I cannot control other peoples’ attitudes towards what teens and young adults should be doing, but the girls and I do talk a LOT about these things. I suppose I am worried about them feeling they ought to, even though I have really tried to make sure that is not the case (at least on our end, as parents). We have even taken a lot of heat from friends and family who mean well but imply we are doing them a disservice by not planning and pushing the kids (they’re smart, they should be at uni is the mantra). We (mom and dad) have calmly reassured people, in front of the girls and in private, that we do not think college is the only way to go, we are pleased with the way they’ve turned out and their interests, etc etc.<br/>\n<br/>\nI would appreciate any suggestions or thoughts from people who have been through this older unschoolers phase, or if anyone can see some way I could do better. This is not causing any major problem in our daily life, but sort of niggling away at me and I keep it to myself. Thanks</div>","specialLinks":[]}],"prevTopicId":77585,"nextTopicId":77590}}