{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":15,"messages":[{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: When toddlers mess up activities","postDate":"1295201138","msgId":58962,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlndmMxaStoaDA4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlndGxqOStqM2o5QGVHcm91cHMuY29tPg=="},"prevInTopic":58959,"nextInTopic":0,"prevInTime":58961,"nextInTime":58963,"topicId":58837,"numMessagesInTopic":0,"msgSnippet":"... ***************** So its time to think of new ways get those other things done - the strategy that worked with a baby doesn t work with a toddler. Can you","messageBody":"<div id=\"ygrps-yiv-868632349\">&quot;shirarocklin&quot; &lt;shirarocklin@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;I think the problem is that until this point I have been taking advantage of some of her independent activity times... to do some small pieces of housekeeping or prepping our food - little snippets of time.  Mostly I just stay with her. But when I walk away like that, even if I&#39;m only a few feet away in the same room, the toddler takes the opportunity to jump in on what she is doing. <br/>\n </span></blockquote>*****************<br/>\n<br/>\nSo its time to think of new ways get those other things done - the strategy that worked with a baby doesn&#39;t work with a toddler. Can you set up fun things for the little one where you are, so her sister&#39;s fun isn&#39;t the Most exciting thing around? Or bring other tasks where the kids are? Set up more arts and crafty things in the kitchen? Or look for other times - movie/tv watching times or playing-on-the-computer times. <br/>\n<br/>\nChances are, you&#39;ll find different things work at different times- some days the toddler will be thrilled to go do something grown-up and special with mommy, while other times sissy is far, far more exotic and wonderful and its better for you to put off the dishes for another couple hours or set up the same kind of fun for the little one. It may be time to look into streamlining housekeeping so that you can give even more attention to your kids. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I think we need to rework our spaces, and my attitude, and our general routines to take into account his new abilities and things will go more smoothly.<br/>\n </span></blockquote>****************<br/>\n<br/>\nI&#39;m glad you included attitude ;) Sometimes its not so much &quot;things&quot; needing to go more smoothly as thoughts and feelings needing to be readjusted to accept kids the way they are. Toddlers are veeeeerrrry busy people! The difference between feeling like you&#39;re being run ragged and that life is a marvelous high-speed adventure has as much to do with your attitude as any change of routine. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":233098946,"authorName":"Lisa E Biesemeyer","from":"Lisa E Biesemeyer &lt;l.biesemeyer@...&gt;","profile":"l.biesemeyer@sbcglobal.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: When toddlers mess up activities","postDate":"1295195038","msgId":58959,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI2MjI2MC44ODEwMi5xbUB3ZWI4MzUwNy5tYWlsLnNwMS55YWhvby5jb20+","inReplyToHeader":"PGlndGxqOStqM2o5QGVHcm91cHMuY29tPg==","referencesHeader":"PGlndGxqOStqM2o5QGVHcm91cHMuY29tPg=="},"prevInTopic":58946,"nextInTopic":58962,"prevInTime":58958,"nextInTime":58960,"topicId":58837,"numMessagesInTopic":0,"msgSnippet":" Did you mean a play yard, like those kinds that are set up directly on the floor like a fence? I use a large play yard fence to section off a portion of my","messageBody":"<div id=\"ygrps-yiv-1705121334\">&quot; Did you mean a play yard, like those kinds that are set up directly on the <br/>\nfloor like a fence?&quot;<br/>\n<br/>\nI use a large play yard fence to section off a portion of my family room, so <br/>\nthat my 4.5yo has a space for her toys and things that are either too small or <br/>\nfragile or that she doesn&#39;t want her toddler brothers (14mo) to use/play with. <br/>\nShe sits in there and plays dolls, uses play dough, and paints (to name a few <br/>\nactivities).  The boys are still too young to open the gate or climb over, so it <br/>\nworks very well.  <br/>\n<br/>\n<br/>\nLisa B<br/>\n<br/>\n Lisa Biesemeyer<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: When toddlers mess up activities","postDate":"1295147613","msgId":58946,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI5Q0Q1REI2LUYwMjUtNDlERS1CNUQzLTdEN0M0ODQ0NDQ4MEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGlndGxqOStqM2o5QGVHcm91cHMuY29tPg==","referencesHeader":"PGlndGxqOStqM2o5QGVHcm91cHMuY29tPg=="},"prevInTopic":58945,"nextInTopic":58959,"prevInTime":58945,"nextInTime":58947,"topicId":58837,"numMessagesInTopic":0,"msgSnippet":"-=--- This summer I cared for an almost 2-yr old and what worked for us was to set everything up for her, exactly as it was set up for my daughter. -- -=-I","messageBody":"<div id=\"ygrps-yiv-636538999\">-=--- This summer I cared for an almost 2-yr old and what worked for us was to set everything up for her, exactly as it was set up for my daughter. --<br/>\n<br/>\n-=-I generally have concentrate so much on him when I do something like this, that the elder becomes angry because I&#39;m not always looking right at her and paying complete attention to what she says. -=-<br/>\n<br/>\nInstead of telling us why things won&#39;t work, please try them.<br/>\n<br/>\nI&#39;ve done exactly that thing with my boys, when they were five and two, five and three, and although I had predicted it wouldn&#39;t work, it worked MANY times.  With Lego, pattern-copying, playdough, coloring, drawing.  I told the younger &quot;Kirby and I are going to do this, and you can do some too if you want, or you can do [whatever else].  So the condition of him sitting with us was to know it was Kirby&#39;s project.<br/>\n<br/>\nSometimes it was the other way around.   I was doing something with Marty, and Kirby could either watch or participate without taking it over (be #2, more passive), or he could do another, also interesting thing.<br/>\n<br/>\nIt&#39;s easy to say &quot;No, that idea.  Next?&quot;<br/>\n<br/>\nRead a little, try a little, wait a while, watch.<br/>\nThink about why people would be making these suggestions.  Think about why you&#39;re rejecting them.  Maybe try what you did before, somehow slightly differently.  Or it might look the very same, but you might introduce it differently.  Or it might look the same but your own attitude and expectations have changed.<br/>\n<br/>\n-=- I think the problem is that until this point I have been taking advantage of some of her independent activity times (like when she&#39;s busy coloring, or putting marshmallows on toothpicks, watercolor painting, for example) to do some small pieces of housekeeping or prepping our food - little snippets of time. ...I&#39;m not angry or frustrated at him or her, just more frustrated that even those tiny bits of time aren&#39;t available anymore. -=-<br/>\n<br/>\nThink how your daughter feels, though.  She gets TWO frustrations--first you leave, then the other kid shows up.  Her ability to understand doesn&#39;t compare to yours at all.<br/>\n<br/>\nMaybe find other things for the kids to do where you are, when you&#39;re prepping food or changing laundry or something.  We used music a LOT.  Familiar, favorite music they could sing to, or we all had routines to--jokes or responses, or something.  That&#39;s portable, and I could sing and do things while they were doing other things.  It created an overarching togetherness within which one child might be coloring, one might be playing with action figures, and I might be doing dishes.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":251210887,"authorName":"shirarocklin","from":"&quot;shirarocklin&quot; &lt;shirarocklin@...&gt;","profile":"shirarocklin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: When toddlers mess up activities","postDate":"1295145385","msgId":58945,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlndGxqOStqM2o5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFBTkxrVGlrRjhBUG1mQUFKaFQxOHJMVEdPMi1mc3VadEVPMWYzWmFXLUI2MUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":58933,"nextInTopic":58946,"prevInTime":58944,"nextInTime":58946,"topicId":58837,"numMessagesInTopic":0,"msgSnippet":"So far all great ideas.  I ll give the playpen a try... I m not sure it will hold her weight.  Did you mean a play yard, like those kinds that are set up","messageBody":"<div id=\"ygrps-yiv-1918304787\">So far all great ideas.  I&#39;ll give the playpen a try... I&#39;m not sure it will hold her weight.  Did you mean a play yard, like those kinds that are set up directly on the floor like a fence?<br/>\n<br/>\n-- This summer I cared for an almost 2-yr old and what worked for us was to set everything up for her, exactly as it was set up for my daughter. --<br/>\n<br/>\nI generally have concentrate so much on him when I do something like this, that the elder becomes angry because I&#39;m not always looking right at her and paying complete attention to what she says.  <br/>\n<br/>\n--Brie has a great idea with giving them similar things to play with at the same time. You can use a high chair or your lap to keep him focused on his own supplies. Make him things to take apart. Set up your place space so he can spill, and make a mess. You can get your daughter in on the fun by asking her to make things he can deconstruct and make a big deal about how much fun he&#39;s having because of her hard work.--<br/>\n<br/>\nThis made me think about it... I think the problem is that until this point I have been taking advantage of some of her independent activity times (like when she&#39;s busy coloring, or putting marshmallows on toothpicks, watercolor painting, for example) to do some small pieces of housekeeping or prepping our food - little snippets of time.  Mostly I just stay with her.  But when I walk away like that, even if I&#39;m only a few feet away in the same room, the toddler takes the opportunity to jump in on what she is doing.  I&#39;m not angry or frustrated at him or her, just more frustrated that even those tiny bits of time aren&#39;t available anymore.  <br/>\n<br/>\nI think we need to rework our spaces, and my attitude, and our general routines to take into account his new abilities and things will go more smoothly.<br/>\n<br/>\nI like the suggestions.  Thanks everyone. <br/>\n<br/>\nShira</div>","specialLinks":[]},{"userId":240002389,"authorName":"andrea catalano","from":"andrea catalano &lt;fennel1001@...&gt;","profile":"ajcm1207","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"When toddlers mess up activities","postDate":"1295025716","msgId":58933,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgxNzI1LjExMTE2LnFtQHdlYjE2MTkwOC5tYWlsLmJmMS55YWhvby5jb20+"},"prevInTopic":58930,"nextInTopic":58945,"prevInTime":58932,"nextInTime":58934,"topicId":58837,"numMessagesInTopic":0,"msgSnippet":"Hi Shira -- I might have made this suggestion the last time you posted, I m not sure. What we did in a similar situation was set my older child up in a play","messageBody":"<div id=\"ygrps-yiv-1293936487\">Hi Shira -- I might have made this suggestion the last time you posted, I&#39;m not <br/>\nsure.<br/>\n<br/>\nWhat we did in a similar situation was set my older child up in a play pen he <br/>\ncould easily get into and out of.  The baby couldn&#39;t get into it an her own and <br/>\nso it was his space to work. I sat right outside the play pen with the baby, <br/>\nplaying with her and reaching in to help my son if he needed/wanted and to talk <br/>\nwith him, too. Sometimes I read stories to both of them while he way inside <br/>\nworking on his projects. This period lasted only a short while for us but it <br/>\nseemed VERY important to my son that he have this undisturbed space for his <br/>\nwork.<br/>\n<br/>\nandrea<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: When toddlers mess up activities","postDate":"1295023348","msgId":58930,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGlrRjhBUG1mQUFKaFQxOHJMVEdPMi1mc3VadEVPMWYzWmFXLUI2MUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGlnbmtzNitoMnUyQGVHcm91cHMuY29tPg==","referencesHeader":"PGlnbjdyNitiZ2FxQGVHcm91cHMuY29tPgk8aWdua3M2K2gydTJAZUdyb3Vwcy5jb20+"},"prevInTopic":58928,"nextInTopic":58933,"prevInTime":58929,"nextInTime":58931,"topicId":58837,"numMessagesInTopic":0,"msgSnippet":"The same thing happens with only kids. Most of the time, the kids Karl plays with are outdoors at a park and there isn t much to mess up. I remember when Karl","messageBody":"<div id=\"ygrps-yiv-954062760\">The same thing happens with only kids. Most of the time, the kids Karl plays<br/>\nwith are outdoors at a park and there isn&#39;t much to mess up. I remember when<br/>\nKarl was younger and we visited his cousins for a few days though. He needed<br/>\nme to be right there to avoid him getting in trouble with messing with the<br/>\nprojects of the older kids. He needed me to play with him and the younger<br/>\nkids. Now that he&#39;s 7 1/2, the older cousins love having him play with them<br/>\nand the younger cousins are the ones wanting to play with the older kid&#39;s<br/>\nprojects. I&#39;m still playing with the younger kids.<br/>\n<br/>\nI definitely think the occasional reminder that younger kids adore and<br/>\nadmire the older kids and want to be into whatever the older kids are doing<br/>\nis a good idea. Because kids don&#39;t automatically catch onto that dynamic.<br/>\nKarl&#39;s more sympathetic than the older cousins because he&#39;s an only child<br/>\nand he knows what it feels like to wish he could play with others (I love it<br/>\nwhen we get together with others and he can play). Whereas the cousins live<br/>\ntogether and always have someone to play with unless they push each other<br/>\naway or their parents separate them.<br/>\n<br/>\nI think because of Karl&#39;s experience as an only child, he understands what I<br/>\nmean perfectly well. It&#39;s harder to see the dynamic when it is seamlessly<br/>\npart of your everyday life, where both parents and children don&#39;t see how<br/>\nmuch the younger ones just want to be part of things with older ones they<br/>\nlook up to.<br/>\n<br/>\nWhen people have an only child, and don&#39;t see the dynamic of how their child<br/>\nis looking up to the parents, that can be really rough on the kid and the<br/>\nrelationship. Of course, the same thing happens with multiple children. I<br/>\nremember how much I looked up to my parents. Maybe not everybody can<br/>\nremember that part of their lives or maybe they didn&#39;t have those feelings<br/>\nfor their parents. But I&#39;d say many kids do and it&#39;s the natural order of<br/>\nthings. Good thing to remember. A key perspective that opens up one&#39;s<br/>\nability to see how unschooling works.<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Thu, Jan 13, 2011 at 2:47 PM, HA &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:verbiosa@...\">verbiosa@...</a>&gt; wrote:<br/>\n<br/>\n&gt; You sound very annoyed with your toddler. I can sympathize. Our youngest is<br/>\n&gt; 17 months. It&#39;s tough to remember sometimes that they aren&#39;t trying to make<br/>\n&gt; a mess or steal attention. (Especially when they wind up making so many<br/>\n&gt; messes, and taking up so much of our attention.)<br/>\n&gt;<br/>\n&gt; Brie has a great idea with giving them similar things to play with at the<br/>\n&gt; same time. You can use a high chair or your lap to keep him focused on his<br/>\n&gt; own supplies. Make him things to take apart. Set up your place space so he<br/>\n&gt; can spill, and make a mess. You can get your daughter in on the fun by<br/>\n&gt; asking her to make things he can deconstruct and make a big deal about how<br/>\n&gt; much fun he&#39;s having because of her hard work.<br/>\n&gt;<br/>\n&gt; We try to point out to our older kids that the younger ones like them and<br/>\n&gt; try to be like them by doing what they&#39;re doing. I know that has a lot more<br/>\n&gt; to do with how our son acts than him wanting everyone to focus on him.<br/>\n&gt;<br/>\n&gt; Good luck,<br/>\n&gt; Hilary<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ------------------------------------<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":274801552,"authorName":"HA","from":"&quot;HA&quot; &lt;verbiosa@...&gt;","profile":"verbiosa","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: When toddlers mess up activities","postDate":"1294948038","msgId":58928,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlnbmtzNitoMnUyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlnbjdyNitiZ2FxQGVHcm91cHMuY29tPg=="},"prevInTopic":58921,"nextInTopic":58930,"prevInTime":58927,"nextInTime":58929,"topicId":58837,"numMessagesInTopic":0,"msgSnippet":"You sound very annoyed with your toddler. I can sympathize. Our youngest is 17 months. It s tough to remember sometimes that they aren t trying to make a mess","messageBody":"<div id=\"ygrps-yiv-1311634499\">You sound very annoyed with your toddler. I can sympathize. Our youngest is 17 months. It&#39;s tough to remember sometimes that they aren&#39;t trying to make a mess or steal attention. (Especially when they wind up making so many messes, and taking up so much of our attention.)<br/>\n<br/>\nBrie has a great idea with giving them similar things to play with at the same time. You can use a high chair or your lap to keep him focused on his own supplies. Make him things to take apart. Set up your place space so he can spill, and make a mess. You can get your daughter in on the fun by asking her to make things he can deconstruct and make a big deal about how much fun he&#39;s having because of her hard work.<br/>\n<br/>\nWe try to point out to our older kids that the younger ones like them and try to be like them by doing what they&#39;re doing. I know that has a lot more to do with how our son acts than him wanting everyone to focus on him. <br/>\n<br/>\nGood luck,<br/>\nHilary</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] When toddlers mess up activities","postDate":"1294937695","msgId":58921,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUxODQxNi43NzQxMC5xbUB3ZWI4NjIwMi5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PGlnbjdyNitiZ2FxQGVHcm91cHMuY29tPg==","referencesHeader":"PGlnbjdyNitiZ2FxQGVHcm91cHMuY29tPg=="},"prevInTopic":58920,"nextInTopic":58928,"prevInTime":58920,"nextInTime":58922,"topicId":58837,"numMessagesInTopic":0,"msgSnippet":"Is tandem play possible? Set up something for him and something for her in the same space. Talk  with your daughter about strategies that might work, about set","messageBody":"<div id=\"ygrps-yiv-540255735\">Is tandem play possible? Set up something for him and something for her in the <br/>\nsame space. Talk  with your daughter about strategies that might work, about set <br/>\nups that wouldn&#39;t fail for her and would also give your son something to do. Do <br/>\nyou have a laptop with games on it that he enjoys, or webpages that he likes to <br/>\ngo to so that he can play on those while you both sit near to your daughter?<br/>\n<br/>\nIt&#39;s about figuring out ways to give attention to your daughter while always <br/>\npaying attention to your son. Are there evenings when you can give your son to <br/>\nhis dad and you can just do things with your daughter? Can you make those kinds <br/>\nof dates?<br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":472480490,"authorName":"sheeboo2","from":"&quot;sheeboo2&quot; &lt;brmino@...&gt;","profile":"sheeboo2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: When toddlers mess up activities","postDate":"1294936455","msgId":58920,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlnbjlpNyt0OGp1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlnbjdyNitiZ2FxQGVHcm91cHMuY29tPg=="},"prevInTopic":58919,"nextInTopic":58921,"prevInTime":58919,"nextInTime":58921,"topicId":58837,"numMessagesInTopic":0,"msgSnippet":"This summer I cared for an almost 2-yr old and what worked for us was to set everything up for her, exactly as it was set up for my daughter. I d put things","messageBody":"<div id=\"ygrps-yiv-205595424\">This summer I cared for an almost 2-yr old and what worked for us was to set everything up for her, exactly as it was set up for my daughter. I&#39;d put things for the baby at one end of the table and things for my daughter at the other and I&#39;d sit in the middle where I could quickly redirect the baby when needed. I really had to be on my toes, paying attention, but it worked.<br/>\n<br/>\nIn our situation, It did NOT work for me to give the baby something else to do.<br/>\n<br/>\nBrie</div>","specialLinks":[]},{"userId":251210887,"authorName":"shirarocklin","from":"&quot;shirarocklin&quot; &lt;shirarocklin@...&gt;","profile":"shirarocklin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"When toddlers mess up activities","postDate":"1294934694","msgId":58919,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlnbjdyNitiZ2FxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlnZmFxYys5YTFrQGVHcm91cHMuY29tPg=="},"prevInTopic":58867,"nextInTopic":58920,"prevInTime":58918,"nextInTime":58920,"topicId":58837,"numMessagesInTopic":0,"msgSnippet":"Hi everyone, I need some ideas for a problem we are having.  My oldest, 4.5 years old, is ready and able and wanting to do so many activities (games, puzzles,","messageBody":"<div id=\"ygrps-yiv-1707860618\">Hi everyone,<br/>\n<br/>\nI need some ideas for a problem we are having.  My oldest, 4.5 years old, is ready and able and wanting to do so many activities (games, puzzles, marshmallows and toothpicks, etc) that are fun for her, but fun for her little brother to mess up, which he takes great pleasure in.  When I wrote in about this many months ago, the advice was to set her up on a table so he wouldn&#39;t be able to reach.  Now he can climb, talk, etc.  She wants me right beside her... so I can&#39;t occupy him elsewhere while she plays.  She gets extremely angry and worked up, and I think those feelings are spreading to other times as well, as she seems more volatile emotionally in general the past few months. <br/>\n<br/>\nAside from just doing more pretend play, so I can work his antics into the pretend story, I don&#39;t know what to do.  He is 2 next month.  Setting him up with his own activity doesn&#39;t work for very long... either he wants to come to me and nurse, or wander off with the markers to color on furniture, or spill the soapy water bowl, etc, so that I have to come give him attention and then she gets upset.  He doesn&#39;t nap.  <br/>\n<br/>\nLet me know if any more details would be of use in finding suggestions. <br/>\n<br/>\nThanks,<br/>\nShira</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Homeschoolers excel &quot;America&quot; Semester","postDate":"1294678891","msgId":58867,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEEyNDVDRTIzLTRBMjctNEE5QS1CMENDLTk0RTdDMDM0ODBCREB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGlnZmFxYys5YTFrQGVHcm91cHMuY29tPg==","referencesHeader":"PGlnZmFxYys5YTFrQGVHcm91cHMuY29tPg=="},"prevInTopic":58866,"nextInTopic":58919,"prevInTime":58866,"nextInTime":58868,"topicId":58837,"numMessagesInTopic":0,"msgSnippet":"... Not spam but *way* too local for an international list. Joyce [Non-text portions of this message have been removed]","messageBody":"<div id=\"ygrps-yiv-1048871107\">On Jan 10, 2011, at 11:06 AM, Sarah wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I don&#39;t know what you mean by saying this is spam?? WE joined this  <br/>\n&gt; coop last semester and really loved it. I wanted to spread the word.<br/>\n<br/>\n </span></blockquote>Not spam but *way* too local for an international list.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Homeschoolers excel &quot;America&quot; Semester","postDate":"1294678816","msgId":58866,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkwMTJBMTQxLUM5NTMtNEQ0OS1BQjI2LTc5MDUyQUFENTQyRUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGlnZmFxYys5YTFrQGVHcm91cHMuY29tPg==","referencesHeader":"PGlnZmFxYys5YTFrQGVHcm91cHMuY29tPg=="},"prevInTopic":58863,"nextInTopic":58867,"prevInTime":58865,"nextInTime":58867,"topicId":58837,"numMessagesInTopic":0,"msgSnippet":"-=I don t know what you mean by saying this is spam?? WE joined this coop last semester and really loved it. I wanted to spread the word. Last semester we","messageBody":"<div id=\"ygrps-yiv-679925473\">-=I don&#39;t know what you mean by saying this is spam?? WE joined this coop last semester and really loved it. I wanted to spread the word. Last semester we studied the Renaissance and this semester the theme is America. I have heard some talk that next semester will be Africa. -=-<br/>\n<br/>\n<br/>\nSomeone writing to the list saying it was spam was also a waste of list time and energy.   I was going to put the poster on moderation, but that&#39;s been done.  Or else the moderation isn&#39;t holding, and these came straight through.<br/>\n<br/>\nThis list is not about local co-ops, nor any local homeschooling groups.  The most local announcements ever made are conferences which are difficult for people to attend from other continents.   Local announcements are inappropriate.<br/>\n<br/>\nAnyone who was the least bit puzzled by anything above should read this, and the links there, too.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/AlwaysLearning/\">http://groups.yahoo.com/group/AlwaysLearning/</a><br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":208409596,"authorName":"Sarah","from":"&quot;Sarah&quot; &lt;sarahcrouch@...&gt;","profile":"sarahcrouch","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Homeschoolers excel &quot;America&quot; Semester","postDate":"1294675596","msgId":58863,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlnZmFxYys5YTFrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQ3OTAwMC40NjI3OS5xbUB3ZWIxMTA0MTQubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":58839,"nextInTopic":58866,"prevInTime":58862,"nextInTime":58864,"topicId":58837,"numMessagesInTopic":0,"msgSnippet":"I don t know what you mean by saying this is spam??  WE joined this coop last semester and really loved it.  I wanted to spread the word.  Last semester we","messageBody":"<div id=\"ygrps-yiv-1769196056\">I don&#39;t know what you mean by saying this is spam??  WE joined this coop last semester and really loved it.  I wanted to spread the word.  Last semester we studied the Renaissance and this semester the theme is America.  I have heard some talk that next semester will be Africa.   <br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Jenny Cyphers &lt;jenstarc4@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; SPAM!!!!!  This is an international list!<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; ________________________________<br/>\n&gt; From: Sarah &lt;sarahcrouch@...&gt;<br/>\n&gt; To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\n&gt; Sent: Sun, January 9, 2011 4:50:45 PM<br/>\n&gt; Subject: [AlwaysLearning] Homeschoolers excel &quot;America&quot; Semester<br/>\n&gt; <br/>\n&gt;   <br/>\n&gt; JUst wanted to pass on a great <br/>\n&gt; coop...<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.homeschoolersexcel.com/index.php\">http://www.homeschoolersexcel.com/index.php</a><br/>\n&gt; <br/>\n&gt; We will have field trips as a group over the spring.  This once a week day of <br/>\n&gt; classes might be the perfect supplement for your unschooler. <br/>\n&gt; <br/>\n&gt; Sarah Crouch<br/>\n&gt; <br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; <br/>\n&gt;       <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Homeschoolers excel &quot;America&quot; Semester","postDate":"1294621934","msgId":58839,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ3OTAwMC40NjI3OS5xbUB3ZWIxMTA0MTQubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PGlnZGw1NStvaWF1QGVHcm91cHMuY29tPg==","referencesHeader":"PGlnZGw1NStvaWF1QGVHcm91cHMuY29tPg=="},"prevInTopic":58837,"nextInTopic":58863,"prevInTime":58838,"nextInTime":58840,"topicId":58837,"numMessagesInTopic":0,"msgSnippet":"SPAM!!!!!  This is an international list! ________________________________ From: Sarah  To: AlwaysLearning@yahoogroups.com Sent: Sun,","messageBody":"<div id=\"ygrps-yiv-992248602\">SPAM!!!!!  This is an international list!<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Sarah &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sarahcrouch@...\">sarahcrouch@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nSent: Sun, January 9, 2011 4:50:45 PM<br/>\nSubject: [AlwaysLearning] Homeschoolers excel &quot;America&quot; Semester<br/>\n<br/>\n  <br/>\nJUst wanted to pass on a great <br/>\ncoop...<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.homeschoolersexcel.com/index.php\">http://www.homeschoolersexcel.com/index.php</a><br/>\n<br/>\nWe will have field trips as a group over the spring.  This once a week day of <br/>\nclasses might be the perfect supplement for your unschooler. <br/>\n<br/>\nSarah Crouch<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":208409596,"authorName":"Sarah","from":"&quot;Sarah&quot; &lt;sarahcrouch@...&gt;","profile":"sarahcrouch","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Homeschoolers excel &quot;America&quot; Semester","postDate":"1294620645","msgId":58837,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlnZGw1NStvaWF1QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":58839,"prevInTime":58836,"nextInTime":58838,"topicId":58837,"numMessagesInTopic":0,"msgSnippet":"JUst wanted to pass on a great coop...http://www.homeschoolersexcel.com/index.php We will have field trips as a group over the spring.  This once a week day of","messageBody":"<div id=\"ygrps-yiv-461456603\">JUst wanted to pass on a great coop...<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.homeschoolersexcel.com/index.php\">http://www.homeschoolersexcel.com/index.php</a><br/>\n<br/>\nWe will have field trips as a group over the spring.  This once a week day of classes might be the perfect supplement for your unschooler.  <br/>\nSarah Crouch</div>","specialLinks":[]}],"prevTopicId":58789,"nextTopicId":58788}}