{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Jayn as entrepreneur was OT - Jayn&#39;s Etsy Store","postDate":"1243369941","msgId":45553,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQyNzBCQUJDLUM0QkMtNEQ1MS04MzM3LUI2OTcyNTBGRjc5MUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDRCQjFEREQ2NzY5MDQwQTlBOTEzMjlERkRFQ0YzMjRDQFJvYnluUEM+","referencesHeader":"PDRCQjFEREQ2NzY5MDQwQTlBOTEzMjlERkRFQ0YzMjRDQFJvYnluUEM+"},"prevInTopic":45550,"nextInTopic":0,"prevInTime":45552,"nextInTime":45554,"topicId":45548,"numMessagesInTopic":0,"msgSnippet":"-=-What a bright and shining future we have! What a bright and shining present. -=- Wow.  Very sweet, Robyn. Whether it s something she ll be through with","messageBody":"<div id=\"ygrps-yiv-1487323807\">-=-What a bright and shining future we have! What a bright and shining  <br/>\npresent. -=-<br/>\n<br/>\nWow.  Very sweet, Robyn.<br/>\n<br/>\nWhether it&#39;s something she&#39;ll be through with before long or something  <br/>\nthat lasts fifty years doesn&#39;t change the beauty of today!<br/>\n<br/>\nI packed up some Thinking Sticks and a couple of copies of Moving a  <br/>\nPuddle this morning to mail, and was thinking all those thoughts about  <br/>\nwhether to buy more boxes, or whether to get new business cards with  <br/>\nmy current in-color trees.   Jane and I both might need office  <br/>\nmanagers. &lt;g&gt;<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Jayn as entrepreneur was OT - Jayn&#39;s Etsy Store","postDate":"1243366995","msgId":45550,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUyQUVBMDI3LTY0QjQtNDk1Ni1BOTE1LUU2RTE2QjEyNTkzREBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDRCQjFEREQ2NzY5MDQwQTlBOTEzMjlERkRFQ0YzMjRDQFJvYnluUEM+","referencesHeader":"PDRCQjFEREQ2NzY5MDQwQTlBOTEzMjlERkRFQ0YzMjRDQFJvYnluUEM+"},"prevInTopic":45548,"nextInTopic":45553,"prevInTime":45549,"nextInTime":45551,"topicId":45548,"numMessagesInTopic":0,"msgSnippet":"-=-What a bright and shining future we have! What a bright and shining present. -=- Wow.  Very sweet, Robyn. Whether it s something she ll be through with","messageBody":"<div id=\"ygrps-yiv-275727041\">-=-What a bright and shining future we have! What a bright and shining  <br/>\npresent. -=-<br/>\n<br/>\nWow.  Very sweet, Robyn.<br/>\n<br/>\nWhether it&#39;s something she&#39;ll be through with before long or something  <br/>\nthat lasts fifty years doesn&#39;t change the beauty of today!<br/>\n<br/>\nI packed up some Thinking Sticks and a couple of copies of Moving a  <br/>\nPuddle this morning to mail, and was thinking all those thoughts about  <br/>\nwhether to buy more boxes, or whether to get new business cards with  <br/>\nmy current in-color trees.   Jane and I both might need office  <br/>\nmanagers. &lt;g&gt;<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":287815876,"authorName":"Robyn L. Coburn","from":"&quot;Robyn L. Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Jayn as entrepreneur was OT - Jayn&#39;s Etsy Store","postDate":"1243363820","msgId":45548,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCQjFEREQ2NzY5MDQwQTlBOTEzMjlERkRFQ0YzMjRDQFJvYnluUEM+"},"prevInTopic":0,"nextInTopic":45550,"prevInTime":45547,"nextInTime":45549,"topicId":45548,"numMessagesInTopic":0,"msgSnippet":"Last night there was much excitement here, and this morning there is another order, that Jayn doesn t even know about yet, since she is still sleeping. I do a","messageBody":"<div id=\"ygrps-yiv-1182900591\">Last night there was much excitement here, and this morning there is another order, that Jayn doesn&#39;t even know about yet, since she is still sleeping. <br/>\n<br/>\nI do a lot of crafty stuff. Art activity is one of the foundations of our lives. Jayn has always drawn, using sketching and drawing both as a record of her ideas and as a commentary on her emotional life. A few months ago she looked at the charms that I make for dolls and decided to start making earrings. Luckily I had the means to immediately support her interest with wire, earring hooks and tools. She had her own store of beads ready to go that she has collected over time from gifts. <br/>\n<br/>\nI was surprised at Jayn&#39;s diligence. She was willing to sit and make her earrings for a couple of hours at a time. I was the lucky recipient of some of her first pairs, and she has also given some as gifts to her girl friend with pierced ears. She sold a couple of pairs at a flea marked we went to, also, and started adding up the money she was earning. <br/>\n<br/>\nI also helped Jayn by doing the computer work - formatting her cards, registering with Etsy, and photographing the earrings. I listed them for her, since the typing is definitely the boring part.  She dictated how she wished to describe her store and chose the illustration for the banner.<br/>\n<br/>\nIt seems to me that this is just like when she was younger and asked me to do the dull &quot;drill&quot; portions of games for her, so that she could do the fun tasks and mini-games. Gradually her desire to master these other parts has increased and she now asks me to do much less of the games. In the absence of unschooling I wonder if I would have expected her to complete the whole thing herself, including doing the drill and boring stuff imagining these were essential to understanding and character building. Maybe it would have deterred her from playing as much. Maybe she would have improved her abilities more slowly as a result - the opposite of the intended (not by the real me, but by this hypothetical conventional me) result.<br/>\n<br/>\nI have an expectation, the good kind based on serene trust, that Jayn will likely become more willing to take on more and more of the administrative aspect of her business. Or she may just continue to be the creative genius behind her own brand and hire people to do the grunt work. We have been watching Project Runway copycat, &quot;The Fashion Show&quot; and had a great discussion about the most recently dismissed contestant who had great ideas but low technical skills, and how that could limit his ability to realize his ideas. <br/>\n<br/>\nJayn is not always easy to work with. She has a perfectionism at times, especially when she is examining what I have done to help her. She wanted to make sure that her business cards (which the earrings hang onto) were perfect. When one batch came out of the printer with the illustration on the back upside down relative to the writing on the front, these weren&#39;t good enough for her business. We have set that 10 aside as emergency cards. Sometimes she gets snippy without hearing it in her. She is also getting better at stopping, taking a deep breath and realizing that she is being rude with her tone.<br/>\n<br/>\nJayn is saving for an expensive doll for her collection. She constantly looks to the future. Her plans have expanded from a doll collection linked to a website, to include a doll museum and an amusement park. She asked me if the amusement park dream was possible. I told her Walt Disney was just a guy who drew once upon a time, and look what he did. She keeps wanting to give stuff away - making color copies of drawings to send with her orders. As charming as this would be, there comes a point when she has to consider her costs too, and we have been able to talk about ideas about spending money and energy for advertising and marketing. <br/>\n<br/>\nThe learning is exploding, much as I would have expected for any passion. I&#39;m so glad I am able to support her and be her partner. She helps me with my doll business too, with her unbeatable and impeccable taste for color combinations and detail. She chooses all the hair combinations - and even the offbeat ones that I look at skeptically are perfect once they are on the dolls. <br/>\n<br/>\nShe&#39;s only 9. What a bright and shining future we have! What a bright and shining present. <br/>\n<br/>\n<br/>\nRobyn L. Coburn<br/>\nwww.Iggyjingles.etsy.com<br/>\nwww.iggyjingles.blogspot.com<br/>\nwww.allthingsdoll.blogspot.com<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":45530,"nextTopicId":45549}}