{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":221591978,"authorName":"Bernadette Lynn","from":"Bernadette Lynn &lt;bernadette.lynn@...&gt;","profile":"bwalyalynn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: almost-11 year old getting physical when angry","postDate":"1477458629","msgId":77548,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBTTZBM04waWRVUThvT3pzeU43am9aUF94R2s2cUFOeVhwckR1d1czX1BlRG4taVMzd0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PG51cGM1ZSsxbW1iaDNqQFlhaG9vR3JvdXBzLmNvbT4=","referencesHeader":"PG5xNHNpOCsxamU4azRyQFlhaG9vR3JvdXBzLmNvbT4gPG51cGM1ZSsxbW1iaDNqQFlhaG9vR3JvdXBzLmNvbT4="},"prevInTopic":77547,"nextInTopic":0,"prevInTime":77547,"nextInTime":77549,"topicId":77460,"numMessagesInTopic":0,"msgSnippet":"I think what I would do is take him out for the day, or an afternoon - just him and you, or him and his dad, if your toddler wouldn t cope - and make the whole","messageBody":"<div id=\"ygrps-yiv-1432418606\"><div dir=\"ltr\">I think what I would do is take him out for the day, or an afternoon - just him and you, or him and his dad, if your toddler wouldn&#39;t cope - and make the whole day about him. Doing something he likes, eating out (maybe at a buffet where he can get unlimited refills?). My eldest likes to go to craft shops with me and buy beads. My second recently enjoyed going to a book signing and comes food shopping with me every week. My third likes to go for walks with me, after dark. My youngest likes to go to McDonald&#39;s for milkshakes, and to the pet shop to look at rabbits. <br><br>If he&#39;s got something bothering him, bottled up jealousy because your time is taken up by the toddler, or frustration at his little brother being around, or whatever it is, telling him that his hormones are the problem might make things worse. It might make him feel that you&#39;re telling him that he&#39;s the problem, that you&#39;re not prepared to listen to him properly, or that you no longer like him because he&#39;s growing up. He&#39;s not hitting people or being rough because he doesn&#39;t have impulse control or because he doesn&#39;t understand that it&#39;s wrong. He&#39;s hitting people because he feels bad, miserable or scared, and hitting out relieves those feelings.<br><br>Give him space to reconnect, without younger siblings around. Listen to him talking, without interrupting or telling him he&#39;s wrong. Make him feel special and loved, not just by telling him he is but by doing special loving things for him. Maybe he&#39;d like to find a packed lunch just for him, when he opens the fridge. Sometimes when I go to bed before my son I fill a lunch box with snacks and sandwiches for him: things he can eat at the computer easily.<br><br><br>Bernadette.<div><br></div></div></div>","specialLinks":[]},{"userId":177967425,"authorName":"","from":"treesock@...","profile":"treesock","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: almost-11 year old getting physical when angry","postDate":"1477456878","msgId":77547,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PG51cGM1ZSsxbW1iaDNqQFlhaG9vR3JvdXBzLmNvbT4=","inReplyToHeader":"PG5xNHNpOCsxamU4azRyQFlhaG9vR3JvdXBzLmNvbT4=","referencesHeader":"PG5xNHNpOCsxamU4azRyQFlhaG9vR3JvdXBzLmNvbT4="},"prevInTopic":77460,"nextInTopic":77548,"prevInTime":77546,"nextInTime":77548,"topicId":77460,"numMessagesInTopic":0,"msgSnippet":"Hi, all. We had another really rough situation around this today, and I m feeling at a loss. My 10 year old is still getting physical when he gets mad. It s","messageBody":"<div id=\"ygrps-yiv-1841853235\">Hi, all. We had another really rough situation around this today, and I&#39;m feeling at a loss.&nbsp;<div><br></div><div>My 10 year old is still getting physical when he gets mad. It&#39;s pretty common now for him to throw a shoulder or elbow as he&#39;s brushing past us, after having grumped about something he found annoying. He takes things that don&#39;t belong to him when he feels entitled to have them--snatching the laptop from his little brother if he thinks it&#39;s his turn, taking my husband&#39;s packed-up lunch from out of the fridge to eat if he&#39;s hungry and doesn&#39;t like his other food options as much--and then shoves anyone who tries to take it back (his younger brother, me, his dad).&nbsp;</div><div><br></div><div>He has never been treated like this, and we&#39;ve always been clear about this kind of behavior being out of line. We&#39;ve also spent a lot of time afterward, when things are calm, working on self-control strategies and the &quot;why&quot; behind the &quot;don&#39;t hit people&quot; principle.&nbsp;</div><div><br></div><div>I really do think a lot of it is hormonal, a new challenge with impulse control, but I also feel as if this is unraveling our homeschooling. After one of his blow-ups, especially if he got physical with me, I walk around for hours like I have PTSD; it takes me a long time to recover from that kind of aggression. I can&#39;t leave the room if he and his brother are together, just like when they were little, because I don&#39;t know what&#39;s going to set him off or what he&#39;s going to do. My tools all seem to be failing me, or rather, not helping me to deal with my son&#39;s behavior and underlying needs.&nbsp;</div><div><br></div><div>What might I be missing? What would you all do?&nbsp;</div><div><br></div><div>Thanks again,</div><div><br></div><div>Teresa</div></div>","specialLinks":[]},{"userId":177967425,"authorName":"","from":"treesock@...","profile":"treesock","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"almost-11 year old getting physical when angry","postDate":"1472591240","msgId":77460,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PG5xNHNpOCsxamU4azRyQFlhaG9vR3JvdXBzLmNvbT4="},"prevInTopic":0,"nextInTopic":77547,"prevInTime":77459,"nextInTime":77461,"topicId":77460,"numMessagesInTopic":0,"msgSnippet":"Hi, all. It s been some time since I ve been on the group; unschooling has been going really well, and we had another baby, so now have three kiddos, 10","messageBody":"<div id=\"ygrps-yiv-1862858870\"><p><span>Hi, all.&nbsp;</span></p><p><span><br></span></p><p><span>It&#39;s been some time since I&#39;ve been on the group; unschooling has been going really well, and we had another baby, so now have three kiddos, 10 (almost 11), 7, and 2.</span></p><p><span><br></span></p><p><span>I&#39;ve hit a snag that I could use some perspective on.&nbsp;</span></p><p><span><br></span></p><p><span>My oldest is a big kid--5&#39;4&quot; and 140 lbs. The past six months or so, he&#39;s gotten physical when he&#39;s mad. For example, if he can&#39;t have seconds of pasta because not everyone has had firsts yet, he&#39;s yell at us that we never make enough food and throw a shoulder at me or his 7-year-old brother as he leaves the kitchen. If he&#39;s in my room on his iPad and the 7 year old comes in and jumps on the bed, the 10 year old will throw a pillow hard at his face, kick at him, and tell him he&#39;s an idiot.&nbsp;</span></p><p><span><br></span></p><p>On an intensity scale of 1-10, it seems like he goes from a 0 or 1 to a 7 or 8 really fast, far faster than I can jump in to prevent harm.&nbsp;</p><p><br></p><p>We&#39;re doing the things we know to do pre-emptively: making sure there is enough food and rest and choice, checking in with him when he&#39;s not triggered, letting him know about the specific emotional and psychological changes of puberty, etc. And in the moment, I tell him calmly but firmly that it&#39;s not OK to hurt people, and tell him what I can do to try and help him (ex., set aside the remaining pasta for him once everyone&#39;s had a bowl).&nbsp;</p><p><br></p><p>I&#39;d love to know if this is one of those things that you just stay consistent with--loving and kind and understanding, while protecting the peace of the house--or if I&#39;m missing something. I&#39;m not seeing it abating, and I&#39;m concerned.</p><p><br></p><p>Thanks for any thoughts,</p><p><br></p><p>Teresa</p></div>","specialLinks":[]}],"prevTopicId":77537,"nextTopicId":77543}}