{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":178121365,"authorName":"Laura Bourdo","from":"&quot;Laura Bourdo&quot; &lt;LauraBourdo@...&gt;","profile":"crazeemom77043","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Digest Number 4918","postDate":"1094676940","msgId":99380,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwM2UwMWM0OTVlNiQzMzhmZGYyMCQ2NjAxYThjMEBob3VzdG9uLnJyLmNvbT4=","referencesHeader":"PDEwOTQ1NjEyMjcuNzk1LjQ5Mi5tMTJAeWFob29ncm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":99379,"nextInTime":99381,"topicId":99380,"numMessagesInTopic":0,"msgSnippet":"... some standardized test they may have to take in regards to formal writing in an unschooling way. I m answering this two days late, and I don t know yet","messageBody":"<div id=\"ygrps-yiv-1254392437\"><blockquote><span title=\"ireply\">&gt;    Date: Mon, 6 Sep 2004 23:51:23 -0400<br/>\n&gt;    From: &quot;Laura Johnson&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:lauraj2@...\">lauraj2@...</a>&gt;<br/>\n&gt; Subject: a question about formal writing & unschooling<br/>\n&gt;<br/>\n&gt; I&#39;m wondering, is it possible to help a child prepare for college or even<br/>\n </span></blockquote>some standardized test they may have to take in regards to formal writing in<br/>\nan unschooling way.<br/>\n<br/>\n<br/>\nI&#39;m answering this two days late, and I don&#39;t know yet what others have<br/>\nsuggested (as I still have a lot of reading to catch up on), but here&#39;s how<br/>\nwe&#39;ve been approaching this situation.<br/>\n<br/>\nFirst and foremost, I waited until Liam expressed an interest in critical<br/>\nreading and formal writing.  For the first three years that he was at<br/>\nhome -- I pulled him from school in 8th grade -- he showed no interest at<br/>\nall, so I left it completely alone.  He read for pleasure, but not a lot.<br/>\nSchool had pretty much driven that desire out of him, and I knew that he<br/>\nwould have to rediscover that desire in his own way and time.<br/>\n<br/>\nSecond, I honestly didn&#39;t know if he would regain that desire to read or<br/>\nwould develop the desire to write formally before he went off to college<br/>\n(which he has always stated he wants to do), so I was prepared to have him<br/>\ntake remedial courses if necessary.  Don&#39;t forget that this is always an<br/>\noption.  It is a myth that high schoolers graduate ready to read and write<br/>\nat a college level.  Many, many don&#39;t, in my experience.  Almost everyone<br/>\nfrom our district&#39;s schools needs some sort of remediation, and for<br/>\nhomeschoolers to be on equal footing, a single course at the community<br/>\ncollege level can work wonders for these skills.<br/>\n<br/>\nOnce Liam did come to me and express his wish to develop these skills prior<br/>\nto college entrance, however, I told him that it wouldn&#39;t take long at all<br/>\nfor him to fine-tune these skills.  Once the internal motivation is there,<br/>\nit doesn&#39;t take much.  It&#39;s really very simple.<br/>\n<br/>\nWe began by reading together.  He chose books from an online list of college<br/>\nprep literature -- _To Kill a Mockingbird_ was the first.  Great book.<br/>\n<br/>\nI did my own research about critical reading, and explained to him the<br/>\nconcepts of symbolism, metaphor, themes, foreshadowing, etc.  Just basic<br/>\nstuff.  I asked for him to keep these concepts in mind as he read.<br/>\n<br/>\nWe meet once a week at a nearby coffee house with his favorite &#39;cool&#39; aunt,<br/>\nwho also loves literature, and we then discuss the book over lattes.  Very<br/>\ncool.  I have reviewed in advance the online SparkNotes for the text, and<br/>\nkeep these ideas in mind as we talk.  I keep it as natural a discussion as<br/>\npossible.  I don&#39;t think he&#39;s even aware of the preparation I&#39;ve done, or of<br/>\nthe ways I gently direct the conversation at times.<br/>\n<br/>\nAfter we finish the book, we try to watch a movie treatment of it.  That was<br/>\neasy with _Mockingbird_.  Great movie, too.<br/>\n<br/>\nHe had really surprised me by asking to be shown how to write a formal<br/>\npaper, but he knows how he&#39;ll be asked to do that in college, so I showed<br/>\nhim.  I asked him to think of the major themes he found in _Mockingbird_,<br/>\nthen we narrowed the list down and I helped him to write a strong thesis<br/>\nstatement from these ideas.  Then I let him run with it after explaining the<br/>\nbasic essay structure of five paragraphs, three points, etc.<br/>\n<br/>\nI did encourage him to do a rough draft, then a second, corrected draft,<br/>\nbefore producing a third.  He went along with it, but I could tell that he<br/>\nwasn&#39;t sure why it was necessary.  The next one we did, I didn&#39;t ask for the<br/>\nrough drafts, and he saw that his final product wasn&#39;t as well-developed.<br/>\n<br/>\nI also asked him if he wanted me to get involved with his grammar, spelling,<br/>\nand punctuation.  He said no.  He wanted to do it his own way.  That was<br/>\nfine.  I did tell him, though, that college professors wouldn&#39;t be so easy<br/>\non him, and that if he wants direction in this area too, I&#39;m available.<br/>\nHe&#39;ll make his own choices there, and that&#39;s fine with me.<br/>\n<br/>\nThis is the first time since he came home that I have been so directive, but<br/>\nI console myself that it is at his request.<br/>\n<br/>\nIf your kiddo hasn&#39;t started asking for this stuff yet, I would simply wait.<br/>\nHow old is s/he?  Are you even certain that s/he wants to go to college?<br/>\n<br/>\nHowever, as I&#39;ve seen myself, it doesn&#39;t take long at all to get the hang of<br/>\nit once the internal drive is there.<br/>\n<br/>\nLaura B.</div>","specialLinks":[]}],"prevTopicId":99110,"nextTopicId":99228}}