{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":87286598,"authorName":"carelia","from":"carelia &lt;carelia@...&gt;","profile":"nortoncr","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] SCA","postDate":"1093298232","msgId":98787,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYzNUIyNEFDLUY1NEYtMTFEOC04RUFFLTAwMEE5NUMzQzMzQUBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDE1LjMxMGRjN2M0LjJlNWJhNjY0QGFvbC5jb20+","referencesHeader":"PDE1LjMxMGRjN2M0LjJlNWJhNjY0QGFvbC5jb20+"},"prevInTopic":98778,"nextInTopic":0,"prevInTime":98786,"nextInTime":98788,"topicId":98751,"numMessagesInTopic":0,"msgSnippet":"... Yah I know, but the kids are the ones who suffer. :( Isn t it better to try to furnish those children with some appropriate (albeit imperfect) activities,","messageBody":"<div id=\"ygrps-yiv-1970165276\"><blockquote><span title=\"ireply\">&gt; &lt;&lt; BUT the reality is, MoC&#39;s exist, because, as you probably know, <br/>\n&gt; some people don&#39;t want kids hanging around  &gt;&gt;<br/>\n&gt; Yeah, but the reality is you don&#39;t have to aid and abet those people!<br/>\n<br/>\n </span></blockquote>Yah I know, but the kids are the ones who suffer. :( Isn&#39;t it better to <br/>\ntry to furnish those children with some appropriate (albeit imperfect) <br/>\nactivities, even if it also (by extension) &quot;helps&quot; those who don&#39;t like <br/>\nchildren? I don&#39;t provide things with the intent to aid the ones who <br/>\ndon&#39;t like kids, it just happens to be a side-product.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; With that paragraph in isolation, without you saying what you really <br/>\n&gt; love to do in the SCA, what your own involvement is, why your kids are <br/>\n&gt; there, it<br/>\n&gt; sounds as though your whole family spends the day at the children&#39;s <br/>\n&gt; area.<br/>\n&gt; YUCK!<br/>\n&gt; It could the greatest SCA children&#39;s area in the history of SCA <br/>\n&gt; children&#39;s areas (bwg), and still...   it&#39;s not unschooling, is it?  <br/>\n&gt; And it&#39;s not SCA<br/>\n&gt; participation at its ideal or even passable level either.<br/>\n<br/>\n </span></blockquote>We DO end up doing this (staying in the children&#39;s area all day) . But <br/>\nyou know what? There are events where there is literally NOTHING else <br/>\nto do except watch combat. Or where there is only one &quot;game&quot; or contest <br/>\noffered for all comers. That gets dull too, especially if it&#39;s not a <br/>\ncontest in something I am interested in (and none of us fight). At a <br/>\ntypical event, there are a few medieval-oid games (toss a gnome, pin <br/>\nthe leaf on the Green Man) and only rarely something actually REAL, <br/>\nsuch as a chance to learn anything (do anything, have fun with <br/>\nanything), that&#39;s done all at non-events (like guild meetings). If I <br/>\ndidn&#39;t bring things for the children, I&#39;d be bringing things for my own <br/>\nanyway, and watching them play all day. Plus my area of interest IS <br/>\nchildren, period toys, etc. My daughter (as I mentioned) just likes <br/>\nkids, she could care less that it&#39;s SCA. Same with my youngest, he just <br/>\nlikes to play. My older son adores boffers. My husband just became <br/>\nauthorized to be a boffer marshal. That&#39;s what we do. Yes, we&#39;re <br/>\nre-thinking our entire participation at this point, but that&#39;s hard too <br/>\n(lots of $$ and time invested, there are a few people who &quot;get it&quot; and <br/>\nthey&#39;d be personally hurt if we left - tho they&#39;d understand, we like <br/>\nthe idea of how and what it COULD be, etc.).<br/>\n<br/>\nNo, it&#39;s not good overall. It&#39;s not unschooling. It has some good <br/>\naspects, which is why we go. I&#39;m just not really sure what to do about <br/>\nit overall (that&#39;s partly why I posted ;).<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Is a tiny bit better sufficient to change things?<br/>\n<br/>\n </span></blockquote>I don&#39;t know. :) I&#39;d like to think it changes things a little for the <br/>\nchild who is participating. Maybe it&#39;s not enough to matter. The <br/>\nschooling mentality can hard to break out of.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; -=-Btw, I hate plastic rings too, but unfortunately my budget doesn&#39;t <br/>\n&gt; allow for more period toys for prizes (for ALL the time).-=-<br/>\n&gt; Thrift stores.  Metal bangle-bracelets.   Wooden beads.  Blocks.   If <br/>\n&gt; every prize is a block, they end up with lots of blocks. &lt;g&gt;<br/>\n<br/>\n </span></blockquote>I do a lot of these types of things too, when I can and when I have the <br/>\nstuff to do it with (someone gave me the rings, but you know what? I&#39;m <br/>\ngonna go get them out of my stuff, and donate them to some other group <br/>\nwhere they are more appropriate). I&#39;m moving away from plastic and <br/>\nper-oid in all possible areas. Sometimes I have to use cheaper (modern) <br/>\nsubstitutes for crafts or whatever in order to accommodate a lot of <br/>\nchildren, and tho I don&#39;t like it, it&#39;s one of the trade-offs I can <br/>\nlive with, if it means more children can participate (or makes it <br/>\nsubstantially safer).<br/>\n<br/>\nPlus, when quite a few kids show up in overalls with GameBoys, and in <br/>\nmodern strollers, and with huge toy plastic castles, and those pop-up <br/>\ntents that look like castles, and etc., plastic rings fly under the <br/>\nradar for most people. I am not saying they are good and right in this <br/>\ncontext. What I AM saying is, even tho I&#39;ll get rid of mine, they will <br/>\nstill show up as prizes.<br/>\n<br/>\nAny thoughts on those little glass counters or polished stones? ;)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It&#39;s hard to work with schooled kids in any way, I&#39;ve found.  And <br/>\n&gt; after all these years unschooling, it&#39;s even harder for me to see them <br/>\n&gt; being callous and<br/>\n&gt; crazed and to disregard so much and so many because it&#39;s not school, <br/>\n&gt; they don&#39;t have to, there&#39;s not a grade, whatever all excuses they use <br/>\n&gt; to live badly.<br/>\n&gt; When people tell children that school is their job, that school is <br/>\n&gt; their life, what does that make the REST of their life?   Recess.   <br/>\n&gt; Break.   School-prep<br/>\n&gt; time.<br/>\n&gt; It&#39;s not healthy.<br/>\n<br/>\n </span></blockquote>I agree. Some of these kids get so weird, bragging about test scores <br/>\nand such. It&#39;s sad.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Of all the learning-for-learning&#39;s-sake opportunities in the world the <br/>\n&gt; SCA used to be one of the best, and still can be for people who are <br/>\n&gt; there to learn.<br/>\n<br/>\n </span></blockquote>That assumes the ones who know are willing to teach and share. They <br/>\nmight be, but I haven&#39;t seen many who are willing to teach children, or <br/>\noutside of isolated demos. The ones that are generally dumb it down to <br/>\nthe point of being offensive.<br/>\n<br/>\nSo Sandra (or anyone else), what do YOU think, is it worthwhile trying? <br/>\nDoes it matter? Would you keep doing it? If not, what would you do <br/>\ninstead, if anything? Etc., etc., etc. It does help clarify things when <br/>\nthere is a lot of input. I know you said some of this already but it&#39;s <br/>\na lot to process, having it stated in multiple ways is helpful. :)</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Carelia (late!) was intro, food issues and a few questions (longish)","postDate":"1093291108","msgId":98778,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1LjMxMGRjN2M0LjJlNWJhNjY0QGFvbC5jb20+"},"prevInTopic":98774,"nextInTopic":98787,"prevInTime":98777,"nextInTime":98779,"topicId":98751,"numMessagesInTopic":0,"msgSnippet":"In a message dated 8/23/04 1:10:38 PM, carelia@earthlink.net writes: ","messageBody":"<div id=\"ygrps-yiv-1800872939\">In a message dated 8/23/04 1:10:38 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:carelia@...\">carelia@...</a> writes:<br/>\n<br/>\n&lt;&lt; BUT <br/>\nthe reality is, MoC&#39;s exist, because, as you probably know, some people <br/>\ndon&#39;t want kids hanging around  &gt;&gt;<br/>\n<br/>\nYeah, but the reality is you don&#39;t have to aid and abet those people!<br/>\n<br/>\n-=-I think this is what <br/>\nbothers me, the conflict between the reality and the ideal.-=-<br/>\n<br/>\nIt&#39;s worse in different places at different times.    Any one year, some SCA <br/>\ngroups will be in a heyday, a Renaissance!  Others will be grumpy and <br/>\ndecaying, and then things switch all around.  <br/>\n<br/>\n-=-With my own kids, my oldest (16) WANTS to participate with the <br/>\nchildren. She&#39;s not really interested in the historical aspects, or <br/>\ncostumes or whatever, she likes to play with kids. She&#39;s happy, I&#39;m <br/>\nhappy. My boys are free to participate or not at events. They don&#39;t <br/>\nlike events where I&#39;m not doing the children&#39;s activities (the <br/>\nactivities are too structured, boring and school-y), and they don&#39;t <br/>\nfeel welcome with the adults.-=-<br/>\n<br/>\nWith that paragraph in isolation, without you saying what you really love to <br/>\ndo in the SCA, what your own involvement is, why your kids are there, it <br/>\nsounds as though your whole family spends the day at the children&#39;s area.<br/>\n<br/>\nYUCK!<br/>\n<br/>\nIt could the greatest SCA children&#39;s area in the history of SCA children&#39;s <br/>\nareas (bwg), and still...   it&#39;s not unschooling, is it?  And it&#39;s not SCA <br/>\nparticipation at its ideal or even passable level either.<br/>\n<br/>\n-=-My point was (after all this length), I agree with what you said, and <br/>\nit IS frustrating, and I am trying to do what I can in the system to <br/>\nmake things a tiny bit better.-=-<br/>\n<br/>\nIs a tiny bit better sufficient to change things?<br/>\n<br/>\nIs a WHOLE lot better sufficient?<br/>\n<br/>\nIf so, you&#39;re doing what you want to do. <br/>\nIfour children.<br/>\n<br/>\n-=-Btw, I hate plastic rings too, but unfortunately my budget doesn&#39;t <br/>\nallow for more period toys for prizes (for ALL the time).-=-<br/>\n<br/>\nThrift stores.  Metal bangle-bracelets.   Wooden beads.  Blocks.   If every <br/>\nprize is a block, they end up with lots of blocks. &lt;g&gt;<br/>\n<br/>\nIt&#39;s hard to work with schooled kids in any way, I&#39;ve found.  And after all <br/>\nthese years unschooling, it&#39;s even harder for me to see them being callous and <br/>\ncrazed and to disregard so much and so many because it&#39;s not school, they <br/>\ndon&#39;t have to, there&#39;s not a grade, whatever all excuses they use to live badly.<br/>\n<br/>\nWhen people tell children that school is their job, that school is their <br/>\nlife, what does that make the REST of their life?   Recess.   Break.   School-prep <br/>\ntime.<br/>\n<br/>\nIt&#39;s not healthy.<br/>\n<br/>\nOf all the learning-for-learning&#39;s-sake opportunities in the world the SCA <br/>\nused to be one of the best, and still can be for people who are there to learn.<br/>\n<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":87286598,"authorName":"carelia","from":"carelia &lt;carelia@...&gt;","profile":"nortoncr","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Carelia (late!) was intro, food issues and a few questions (longish)","postDate":"1093282103","msgId":98774,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQ1ODI1MTI0LUY1MjktMTFEOC04RUFFLTAwMEE5NUMzQzMzQUBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDFhYy4yODNlZWY2Yy4yZTViNDM3OUBhb2wuY29tPg==","referencesHeader":"PDFhYy4yODNlZWY2Yy4yZTViNDM3OUBhb2wuY29tPg=="},"prevInTopic":98751,"nextInTopic":98778,"prevInTime":98773,"nextInTime":98775,"topicId":98751,"numMessagesInTopic":0,"msgSnippet":"... Sorry about that. :) ... I have, great article (I ve read most of your pages numerous times). I ll try to get some stories written down for you. ... ","messageBody":"<div id=\"ygrps-yiv-248636939\"><blockquote><span title=\"ireply\">&gt; This is a response to something many days old which at the time was <br/>\n&gt; too big<br/>\n&gt; to answer and still might be. &lt;g&gt;<br/>\n<br/>\n </span></blockquote>Sorry about that. :)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Holly&#39;s a Futurama fan.  Have you looked at my video games page?  It <br/>\n&gt; was made<br/>\n&gt; following a presentation at a conference a couple of years ago on the<br/>\n&gt; benefits of video games:<br/>\n&gt;<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/games/page\">http://sandradodd.com/games/page</a><br/>\n<br/>\n </span></blockquote>I have, great article (I&#39;ve read most of your pages numerous times). <br/>\nI&#39;ll try to get some stories written down for you.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; -=- I am the children&#39;s officer for our local SCA branch -=-<br/>\n&gt;<br/>\n&gt; All I could think of when I read that paragraph was what I&#39;ve been <br/>\n&gt; thinking<br/>\n&gt; for years about it.  The SCA shouldn&#39;t have children&#39;s officers.   As <br/>\n&gt; I could<br/>\n&gt; rant for hours, I won&#39;t even begin.<br/>\n<br/>\n </span></blockquote>&lt;lots of other really good stuff deleted&gt;<br/>\n<br/>\nI know, and I agree, the kids should be an active, vital part of <br/>\nwhatever else is going on around them. This is an excellent chance for <br/>\nthem to get involved and have a great time and learn things that are <br/>\nrelevant to them, by experiencing and talking and asking and being. BUT <br/>\nthe reality is, MoC&#39;s exist, because, as you probably know, some people <br/>\ndon&#39;t want kids hanging around (and because now we have to have them), <br/>\nand because mainstream parents are used to sending their children away <br/>\nfor large portions of a day. At my first event doing things for the <br/>\nkids, I had numerous people (NON-PARENTS) come up to me and thank me <br/>\nfor entertaining the children - so they were left alone and didn&#39;t have <br/>\nkids bothering them all day (very sad - I was left speechless, tho I am <br/>\nnot sure why it surprised me). I would LOVE to see the children just <br/>\nbeing part of things, but it doesn&#39;t happen (and not just because of <br/>\nchildren&#39;s officers - one of my big things has been trying to get the <br/>\nchildren accepted more, in court, in Arts and Sciences competitions, <br/>\netc.  - it&#39;s working a little on a local level). I think this is what <br/>\nbothers me, the conflict between the reality and the ideal.<br/>\n<br/>\nI should say as far as activities, I DO a lot of multiple station-type <br/>\nactivities, and they are just THERE (with or without a &quot;teacher&quot;, <br/>\ndepends on the activity). Children are not forced or even asked (by ME <br/>\nanyway, I have no control over their parents) to participate in any <br/>\nfashion (I prefer to use the child underground information network to <br/>\nget the word out, I don&#39;t go around ringing a bell and telling people <br/>\nnow it&#39;s time for the kids to come play - some MoC&#39;s do - ugh). If they <br/>\nshow up, ok. If they need help creating, fine, we&#39;re there to help. <br/>\nThey want to use the markers to color all over their body, no problem <br/>\n(for me anyway, I think it&#39;s cute, they look like Picts ;). We have a <br/>\nlot of running games, running around and doing nothing, props for the <br/>\nkids to make up their own games, etc. I did it for my own kids, and <br/>\nothers joined in, and our area did not have an MoC, so I started doing <br/>\nit officially. Honestly, I don&#39;t do things on that level any <br/>\ndifferently, except that I have MORE stuff and a dedicated area for it. <br/>\nI frequently have adults come over and participate because we&#39;re having <br/>\nfun. We also generally have events at parks, and if I didn&#39;t run <br/>\nactivities, 90%+  of the kids would be over on the slide and swings <br/>\nanyway (which is GREAT if that&#39;s what they want, but frequently it&#39;s <br/>\nthe only option they are given - point being they wouldn&#39;t be <br/>\nparticipating in the event activities anyway).<br/>\n<br/>\nWith my own kids, my oldest (16) WANTS to participate with the <br/>\nchildren. She&#39;s not really interested in the historical aspects, or <br/>\ncostumes or whatever, she likes to play with kids. She&#39;s happy, I&#39;m <br/>\nhappy. My boys are free to participate or not at events. They don&#39;t <br/>\nlike events where I&#39;m not doing the children&#39;s activities (the <br/>\nactivities are too structured, boring and school-y), and they don&#39;t <br/>\nfeel welcome with the adults.<br/>\n<br/>\nMy point was (after all this length), I agree with what you said, and <br/>\nit IS frustrating, and I am trying to do what I can in the system to <br/>\nmake things a tiny bit better. It&#39;s not enough, but it&#39;s not making <br/>\nthings worse. SOMEONE has to do the job. Might as well be me, and not <br/>\nan actual credentialed teacher who wants to take away ALL of the joy.<br/>\n<br/>\nBtw, I hate plastic rings too, but unfortunately my budget doesn&#39;t <br/>\nallow for more period toys for prizes (for ALL the time). I try to give <br/>\nthings like wooden tops when possible. I am always working on making <br/>\nactivities more period and less peri-oid, within some modern safety <br/>\nsensibilities (and unfortunately, budget concerns). I also have a lot <br/>\nof activities that don&#39;t require the giving of a prize.<br/>\n<br/>\nThanks for your insights. I knew you&#39;d have a strong opinion on this. ;)<br/>\n<br/>\nC.</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Carelia (late!) was intro, food issues and a few questions (longish)","postDate":"1093265785","msgId":98751,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFhYy4yODNlZWY2Yy4yZTViNDM3OUBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":98774,"prevInTime":98750,"nextInTime":98752,"topicId":98751,"numMessagesInTopic":0,"msgSnippet":"This is a response to something many days old which at the time was too big to answer and still might be.  -=-Aaron is 5, he loves his Whirly Wheels, games,","messageBody":"<div id=\"ygrps-yiv-1335233157\">This is a response to something many days old which at the time was too big <br/>\nto answer and still might be. &lt;g&gt;<br/>\n<br/>\n-=-Aaron is 5, he <br/>\n<br/>\nloves his Whirly Wheels, games, snuggling with Mom, Futurama and <br/>\n<br/>\nSpongeBob. All three love Nintendo and the computer (and I could tell <br/>\n<br/>\n100 stories of things they&#39;ve learned from them!).-=-<br/>\n<br/>\nHolly&#39;s a Futurama fan.  Have you looked at my video games page?  It was made <br/>\nfollowing a presentation at a conference a couple of years ago on the <br/>\nbenefits of video games:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/games/page\">http://sandradodd.com/games/page</a><br/>\n<br/>\nIf you want to end me some video game stories for that it would be great!<br/>\n<br/>\n-=-Now my question. I don&#39;t have the playdate problem, but I do run into <br/>\n<br/>\nissues with other children. I am the children&#39;s officer for our local <br/>\n<br/>\nSCA branch -=-<br/>\n<br/>\nAll I could think of when I read that paragraph was what I&#39;ve been thinking <br/>\nfor years about it.  The SCA shouldn&#39;t have children&#39;s officers.   As I could <br/>\nrant for hours, I won&#39;t even begin.<br/>\n<br/>\n-=- Most (probably all) of the children are in public school <br/>\n<br/>\nor daycare. I run my activities much like unschooling-=-<br/>\n<br/>\nThe problem with lack of structure when others expect structure is they don&#39;t <br/>\nget it and  they don&#39;t know how to act.<br/>\n<br/>\nIn the 60&#39;s and early 70&#39;s, educators KNEW, from research and proof in <br/>\npractice, that the open classroom worked and elminated many of the problems they <br/>\nknew school had not been able to avoid to that point.  Lots of people knew.   <br/>\n<br/>\nIn implementation in public school, it didn&#39;t work.  After all that proving, <br/>\nthey couldn&#39;t reproduce it in public schools.    The main factors seemed to <br/>\nhave been<br/>\n1) the teachers didn&#39;t get it<br/>\n2) the students didn&#39;t get it<br/>\n3) the parents didn&#39;t get it<br/>\n<br/>\nbut worse than all that, it seems, it only work when the kids want to be <br/>\nthere.<br/>\nIf the kids are there against their will, they&#39;ll balk at anything.  And once <br/>\nkids have been taught (by school, indirectly) to avoid what they&#39;re not <br/>\nforced to do, and to get away with as much wildness as possible before someone <br/>\nmakes them Sit Down and Be Quiet, it&#39;s hard to get good results without the long <br/>\nperiod of deschooling it would take for them to trust and appreciate the <br/>\nfreedom and to really want to be there.<br/>\n<br/>\n-=-One problem I have is that some children take advantage of this and <br/>\n<br/>\nhoard - materials, prizes, whatever. We&#39;ll have a game where all <br/>\n<br/>\nparticipants get a token and they&#39;ll pretend they lost it to get <br/>\n<br/>\nanother. On one hand, I don&#39;t mind this (if they really need a second <br/>\n<br/>\nplastic ring, it&#39;s just not that huge of a deal), -=-<br/>\n<br/>\nPlastic rings aren&#39;t period, and that&#39;s one of my (several) objections to <br/>\nchildren&#39;s activities.  They don&#39;t really enable children to be involved so much <br/>\nas they create a holding space where the kids do non-period, vaguely-SCA <br/>\nthings.<br/>\n<br/>\nBut other than that, when you&#39;re dealing with mainstream kids, you are.  The <br/>\nproblems of trying to do school (no matter how informal) or daycare (if the <br/>\nkids are younger) are not different in costumes.<br/>\n<br/>\n-=-The younger kids (6 and under) are SO fun, they are so creative <br/>\n<br/>\nand have no set idea of how things must be. The older kids, tho ... <br/>\n<br/>\nwill compare supplies, he got a better color, her yarn is longer, etc. <br/>\n<br/>\nWait until told exactly what to do (you may start now ... ). Have to be <br/>\n<br/>\nshown how to draw a face. Will only draw it EXACTLY the way I show them <br/>\n<br/>\n(or like the sample).-=-<br/>\n<br/>\nYou already know what the deal is.<br/>\nI can&#39;t think of anything that will make it better.<br/>\n<br/>\nIdeally, if you could have two or three stations with people doing things so <br/>\nthe kids could wander and pick and choose, that might work better.<br/>\n<br/>\nBut you won&#39;t and shouldn&#39;t have two or three teens or adults who want to <br/>\ndedicate their days to children&#39;s activities.<br/>\n<br/>\n-=-Someone had a piñata once - not my idea - and the older <br/>\n<br/>\nkids bashed it before the small kids had a chance -=-<br/>\n<br/>\nPinatas have to be carefully managed, little kids first, clear the space, <br/>\netc., or that&#39;s likely to happen anytime, anywhere.  It&#39;s not about the SCA.  <br/>\nIt&#39;s about pinatas and sticks.   &lt;g&gt;<br/>\n<br/>\n-=-Any ideas on either how to get these kids to loosen up a <br/>\n<br/>\nbit, or for me to stop worrying about it? :) -=-<br/>\n<br/>\nPhilosophical innoculation on your part, maybe.  You&#39;ve already said if you q<br/>\nuit the next person might be more schoolish.  Probably WILL be.  But meanwhile <br/>\nyou&#39;re not participating in the SCA yourself in the natal-learning way it was <br/>\nZdesigned to work, and neither are your children.<br/>\n<br/>\n-=- I mostly <br/>\n<br/>\nenjoy it, and my replacement could be more school-y and then my own <br/>\n<br/>\nkids wouldn&#39;t want to participate. -=-<br/>\n<br/>\nProbably the best thing for your children would be to not want to participate <br/>\nin organized  children&#39;s activities.    What if you just organize running <br/>\ngames, chase, jumprope, things that are easily participated in or not, and easily <br/>\nabandoned when the interest lags, and just do it on your own time, for your <br/>\nchildren&#39;s sake?<br/>\n<br/>\nThe SCA is educational because people research their own personas and create <br/>\ntheir costumes and armor.  Or at least they used to.  Now it can be bought off <br/>\nthe rack.  The SCA is a learning experience when a person wants to know more. <br/>\n  The SCA becomes a school when the groups cares more about organized classes <br/>\nand keeping kids isolated from the activities at large than about having <br/>\nevents so rich and fascinating that no energetic or curious person could possibly <br/>\nget bored.<br/>\n<br/>\nStrong opinions based on 25 years participation and having three kids grow up <br/>\nin it.  They learn more from asking questions and helping and doing real <br/>\nthings.  They are accepted as participants by participating, not by attending <br/>\nchildren&#39;s activities.<br/>\n<br/>\nWe as a kingdom (Outlands) have resisted children&#39;s activities for years, but <br/>\njust lately a corporate ruling says we have to have children&#39;s officers.   I <br/>\nthink its another move in the wrong direction.    My work at corporate level <br/>\n(I&#39;m ten years out from my last corporate office, but have held corporate <br/>\npositions up from seneschals twice and up from chroniclers twice) was always aimed <br/>\nto LESS administration, LESS bureaucracy, simple-and-pure feast and tournament <br/>\nfocus.    Ultimately, I lose.  But I held them off for a long time.<br/>\n<br/>\nSorry I couldn&#39;t respond sooner.  Too big, too close.  Too sad for me.<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":98753,"nextTopicId":98731}}