{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":2300774,"authorName":"Betsy","from":"Betsy &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] Compassionate Communication","postDate":"1058847485","msgId":77216,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNGMUNCQUZELjc2ODEzMzU2QGVhcnRobGluay5uZXQ+","referencesHeader":"PGJmaTVqbCtqdjVtQGVHcm91cHMuY29tPg=="},"prevInTopic":77208,"nextInTopic":0,"prevInTime":77215,"nextInTime":77217,"topicId":77208,"numMessagesInTopic":0,"msgSnippet":"**She will own the anger, saying, I feel angry because I want the living room to be clean and instead it s a mess. Finally, she will ask for a different","messageBody":"<div id=\"ygrps-yiv-678899322\">**She will own the anger, saying, &quot;I feel <br/>\nangry because I want the living room to be clean and instead it&#39;s a <br/>\nmess.&quot; Finally, she will ask for a different outcome: &quot;I&#39;d feel so <br/>\nmuch better if you&#39;d just put these toys away.&quot;**<br/>\n<br/>\nI read something that expanded on this idea recently (The book:<br/>\nEmotional Intelligence) and added the idea that it&#39;s not okay to say<br/>\nthings like &quot;I feel disappointed&quot; because that &quot;emotion&quot; contains a<br/>\njudgement.  The book was pushing the idea that it was important to stick<br/>\nwith primary emotions like fear and anger.<br/>\n<br/>\nBetsy<br/>\n<br/>\n**Jackals, on the other hand, view others as the source of their anger. <br/>\nIn fact, violence, whether verbal or physical, is the result of <br/>\nassuming that our feelings are caused not by what is going on inside <br/>\nus but rather by what is going on &quot;out there.&quot;**<br/>\n<br/>\nThat&#39;s a cool idea which I hadn&#39;t heard before.<br/>\n<br/>\n**In describing the situation, do so without criticizing or judging. If <br/>\nyou have come home from a busy day and your partner seems preoccupied <br/>\nwith the newspaper, simply describe the situation: &quot;When I walked in <br/>\nthe door after an especially trying day, you seemed busy reading.&quot; <br/>\nIdentify your feeling: &quot;I feel hurt.&quot; State the reason for your <br/>\nfeeling: &quot;I feel hurt because I would like to feel close to you right <br/>\nnow and instead I&#39;m feeling disconnected from you.&quot; Then state your <br/>\nrequest in do-able terms: &quot;Are you willing to take time out for a hug <br/>\nand a few moments of sharing?&quot;**<br/>\n<br/>\nWith this scenario I would find it preferable to skip the judgement and<br/>\njust feel the need for connection and ask for a hug.<br/>\n<br/>\n**If a mother has asked her daughter to please do her chores and she <br/>\nhas refused, the Giraffe dance may go something like this:**<br/>\n<br/>\nWhy are there &quot;chores&quot; out on the savannah where the giraffes are frolicing?</div>","specialLinks":[]},{"userId":151925894,"authorName":"jeva","from":"&quot;jeva&quot; &lt;pinklantern@...&gt;","profile":"thepinklantern","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Compassionate Communication","postDate":"1058838965","msgId":77208,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJmaTVqbCtqdjVtQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":77216,"prevInTime":77207,"nextInTime":77209,"topicId":77208,"numMessagesInTopic":0,"msgSnippet":"Hello all, I m posting this here as it conveys much better than I can what I was attempting to say. Dr. Rosenberg explains the importance of non- violent and","messageBody":"<div id=\"ygrps-yiv-304816400\">Hello all, <br/>\n<br/>\nI&#39;m posting this here as it conveys much better than I can what I was <br/>\nattempting to say. Dr. Rosenberg explains the importance of non-<br/>\nviolent and compassionate communication much better than I ever could.<br/>\n<br/>\nThere is also a copy of this article in the Files section.<br/>\n<br/>\nPeace to all,<br/>\nJeva<br/>\n<br/>\nCompassionate Communication<br/>\nby Marshall B. Rosenberg, Ph.D.<br/>\n <br/>\n <br/>\nAt an early age, most of us were taught to speak and think Jackal. <br/>\nThis language is from the head. It is a way of mentally classifying <br/>\npeople into varying shades of good and bad, right and wrong. <br/>\nUltimately it provokes defensiveness, resistance and counterattack. <br/>\nGiraffe bids us to speak from the heart, to talk about what is going <br/>\non for us - without judging others. In this idiom, you give people an <br/>\nopportunity to say yes, although you respect no for an answer. <br/>\nGiraffe is a language of requests; Jackal is a language of demands.<br/>\n<br/>\nHuman beings the world over say they want to contribute to the well-<br/>\nbeing of others, to connect and communicate with others in loving, <br/>\ncompassionate ways. Why then, is there so much disharmony and <br/>\nconflict?<br/>\n<br/>\nSetting out to find answers, I discovered that the language many of <br/>\nus were taught interferes with our desire to live in harmony with one <br/>\nanother. At an early age, most of us were taught to speak and think <br/>\njackal. This is a moralistic classification idiom that labels people; <br/>\nit has a splendid vocabulary for analyzing and criticizing. Jackal is <br/>\ngood for telling people what&#39;s wrong with them: &quot;Obviously, you&#39;re <br/>\nemotionally disturbed (rude, lazy, selfish).&quot;<br/>\n<br/>\nThe jackal moves close to the ground. It is so preoccupied with <br/>\ngetting its immediate needs met that it cannot see into the future. <br/>\nSimilarly, Jackal-thinking individuals believe that in quickly <br/>\nclassifying or analyzing people, they understand them. Unhappy about <br/>\nwhat&#39;s going on, a Jackal will label the people involved, <br/>\nsaying, &quot;He&#39;s an idiot&quot; or &quot;She&#39;s bad&quot; or &quot;They&#39;re culturally <br/>\ndeprived.&quot;<br/>\n<br/>\nThis language is from the head. It is a way of mentally classifying <br/>\npeople into varying shades of good and bad, right and wrong. <br/>\nUltimately, it provokes defensiveness, resistance, and counterattack.<br/>\n<br/>\nI also came upon a language of the heart, a form of interacting that <br/>\npromotes the well-being of ourselves and other people. I call this <br/>\nmeans of communicating Giraffe. The giraffe has the largest heart of <br/>\nany land animal, is tall enough to look into the future, and lives <br/>\nits life with gentility and strength. Like-wise, Giraffe bids us to <br/>\nspeak from the heart, to talk about what is going on for us - without <br/>\njudging others. In this idiom, you give people an opportunity to say <br/>\nyes, although you respect no for an answer. Giraffe is a language of <br/>\nrequests; Jackal is a language of demands.<br/>\n<br/>\nBy the time I identified these two languages, I had thoroughly <br/>\nlearned Jackal. So I set out to teach myself Giraffe. What would I <br/>\nsay, I wondered, if someone were doing something I found unpleasant <br/>\nand I wanted to influence him to change his behavior? Giraffes, I <br/>\nrealized, are aware that they cannot change others. They are not even <br/>\ninterested in changing people; rather, they are interested <br/>\n(italics) &quot;in providing opportunities for them to be willing to <br/>\nchange.&quot; One way of providing such an opportunity, I decided, would <br/>\nbe to approach the other person with a message such as: &quot;Please do <br/>\nthis, but only if you can do it willingly - in a total absence of <br/>\nfear, guilt, or shame. If you are motivated by fear, guilt, or shame, <br/>\nI lose.&quot;<br/>\n<br/>\nAs Giraffes, we make requests in terms of what we want people to do, <br/>\nnot what we want them to feel. All the while, we steer clear of <br/>\nmandates. Nothing creates more resistance than telling people <br/>\nthey &quot;should&quot; or &quot;have to&quot; or &quot;must&quot; or &quot;ought to&quot; do something. <br/>\nThese terms eliminate choice. Without the freedom to choose, life <br/>\nbecomes slave like. &quot;I had to do it,superior&#39;s orders&quot; is the <br/>\nresponse of people robbed of their free will. Prompted by directives <br/>\nand injunctions, people do not take responsibility for their actions.<br/>\n<br/>\nAs time passed, I learned much more about Giraffes. For one thing, <br/>\nthey do not make requests in the past. They do not say, or even <br/>\nthink, &quot;How nice it would have been if you had cleaned the living <br/>\nroom last night.&quot; Instead, Giraffes state clearly what they want in <br/>\nthe present. And they take responsibility for their feelings, aware <br/>\nthat their feelings are caused by their wants. If a mother is upset <br/>\nbecause her son&#39;s toys are strewn about the living room, she will <br/>\nidentify her feeling: anger. She will then get in touch with the <br/>\nunderlying want that is causing this feeling: her desire for a neat <br/>\nand orderly living room. She will own the anger, saying, &quot;I feel <br/>\nangry because I want the living room to be clean and instead it&#39;s a <br/>\nmess.&quot; Finally, she will ask for a different outcome: &quot;I&#39;d feel so <br/>\nmuch better if you&#39;d just put these toys away.&quot;<br/>\n<br/>\nWhereas Jackals say, &quot;I feel angry because you... ,&quot; Giraffes will <br/>\nsay, &quot;I feel angry because I want ... &quot; As Giraffes, we know that the <br/>\ncause of our feelings is not another person, but rather our own <br/>\nthoughts, wants, and wishes. We become angry because of the thoughts <br/>\nwe are having, not because of anything another person has done to us.<br/>\n<br/>\nJackals, on the other hand, view others as the source of their anger. <br/>\nIn fact, violence, whether verbal or physical, is the result of <br/>\nassuming that our feelings are caused not by what is going on inside <br/>\nus but rather by what is going on &quot;out there.&quot; In response, we say <br/>\nthings designed to hurt, punish, or blame the person whom we imagine <br/>\nhas hurt our feelings. Aware of this tendency, a Giraffe will <br/>\nconclude, &quot;I&#39;m angry because my expectations have not been met.&quot;<br/>\n<br/>\nAs Giraffes we take responsibility for our feelings. At the same <br/>\ntime, we attempt to give others an opportunity to act in a way that <br/>\nwill help us feel better. For example, a boy may want more respect <br/>\nfrom his father. After getting in touch with his anger over the <br/>\ndecisions his father has been making for him, he might say: &quot;Please <br/>\nask me if I want a haircut before making a barbershop appointment for <br/>\nme.&quot; Giraffes say what they do want; rather than what they don&#39;t <br/>\nwant. &quot;Stop that,&quot; &quot;Cut it out,&quot; or &quot;Quit that&quot; do not inspire <br/>\nchanged behaviors. People can&#39;t do a &quot;don&#39;t.&quot;<br/>\n<br/>\nGiraffes ultimately seek a connection in which each person feels a <br/>\nsense of well-being and no one feels forced into action by blame, <br/>\nguilt, or punishment: As such, Giraffe thinking creates harmony.<br/>\n<br/>\nStating a Request Clearly<br/>\n<br/>\nStating a request in simple Giraffe is a four-part process rooted in <br/>\nhonesty:<br/>\n<br/>\nDescribe your observation <br/>\nIdentify your feeling <br/>\nExplain the reason for your feeling in terms of your needs <br/>\nState your request <br/>\nIn describing the situation, do so without criticizing or judging. If <br/>\nyou have come home from a busy day and your partner seems preoccupied <br/>\nwith the newspaper, simply describe the situation: &quot;When I walked in <br/>\nthe door after an especially trying day, you seemed busy reading.&quot; <br/>\nIdentify your feeling: &quot;I feel hurt.&quot; State the reason for your <br/>\nfeeling: &quot;I feel hurt because I would like to feel close to you right <br/>\nnow and instead I&#39;m feeling disconnected from you.&quot; Then state your <br/>\nrequest in do-able terms: &quot;Are you willing to take time out for a hug <br/>\nand a few moments of sharing?&quot;<br/>\n<br/>\nThe same process applies if your teenager has been talking on the <br/>\nphone for hours and you are expecting a call. Describe the <br/>\nsituation: &quot;When you have the phone tied up for so long, other calls <br/>\ncan&#39;t come through.&quot; Express your feeling and the reason for it: &quot;I&#39;m <br/>\nfeeling frustrated because I&#39;ve been expecting to hear from someone.&quot; <br/>\nThen state your request: &quot;I&#39;d like you to bring your conversation to <br/>\na close if that&#39;s all right.&quot;<br/>\n<br/>\nIn a Jackal culture, feelings and wants are severely punished. People <br/>\nare expected to be docile, subservient to authority, slave like in <br/>\ntheir reactions, and alienated from their feelings and needs. In a <br/>\nGiraffe culture, we learn to express our feelings, needs, and <br/>\nrequests without passing judgment or attacking. We request, rather <br/>\nthan demand. And we are aware of the fine line of distinction between <br/>\nthese two types of statements.<br/>\n<br/>\nIn Jackal, we expect other people to prove their love for us by doing <br/>\nwhat we want. As Giraffes, we may persist in trying to persuade <br/>\nothers, but we are not influenced by guilt. We acknowledge that we <br/>\nhave no control over the other person&#39;s response. And we stay in <br/>\nGiraffe no matter what the other person says. If she or he seems <br/>\nupset or tense, we switch into listening, which allows us to hear the <br/>\nperson&#39;s feelings, needs, and wishes (italics) without hearing any <br/>\ncriticism of ourselves. Nor does a Giraffe simply say no; as Giraffes <br/>\nwe state the need that prevents us from fulfilling the request.<br/>\n<br/>\nResponding to a &quot;No&quot;<br/>\n<br/>\nResponding to a refusal is a four-part process rooted in empathy:<br/>\n<br/>\nDescribe the situation <br/>\nGuess the other person&#39;s feeling <br/>\nGuess the reason for the feeling, together with the unmet need; then <br/>\nlet the person verify whether you have correctly understood <br/>\nClarify the unmet need <br/>\nWhen people say no in a nasty way, what they invariably want is to <br/>\nprotect their autonomy. They have heard a request as a demand and are <br/>\nsaying, in effect, &quot;I want to do it when I choose to do it, and not <br/>\nbecause I am forced to do it.&quot; Sighing, sulking, or screaming can <br/>\nlikewise reflect a desire to protect one&#39;s freedom of choice, one&#39;s <br/>\nneed to act from a position of willingness. If people scream at us, <br/>\nwe do not scream back. We listen beneath the words and hear what they <br/>\nare really saying - that they have a need and want to get their need <br/>\nmet.<br/>\n<br/>\nIf a mother has asked her daughter to please do her chores and she <br/>\nhas refused, the Giraffe dance may go something like this:<br/>\n<br/>\nParent: Are you feeling annoyed right now because you want to do your <br/>\nchores at your own pace rather than being forced to do them?<br/>\n<br/>\nChild: Yeah, I&#39;m sick and tired of being a slave. [Note the defensive <br/>\nmode, indicating a need to be listened to.]<br/>\n<br/>\nParent: So, you really want to do things when it feels good to do <br/>\nthem, and you&#39;re not just avoiding them altogether?<br/>\n<br/>\nChild: You order me around! [The child still needs to be listened to. <br/>\nThe parent must keep guessing what the child is saying about feelings <br/>\nand wants.]<br/>\n<br/>\nParent: So, it&#39;s frustrating when I seem to be ordering you around <br/>\nand you have no choice about when to do your chores?<br/>\n<br/>\nChild: I don&#39;t want to do chores! They&#39;re stupid. If you want them <br/>\ndone, you do them.<br/>\n<br/>\nParent: You really hate doing chores and you would like me to do all <br/>\nof them?<br/>\n<br/>\nChild: Yeah... no... I don&#39;t know. I just don&#39;t feel like being <br/>\nbossed around. (The child is becoming vulnerable and starting to open <br/>\nup because she&#39;s feeling heard without judgment.)<br/>\n<br/>\nIf we have been Jackalish and demanding in the past, the people close <br/>\nto us may need a lot of empathy at first. So we listen and listen, <br/>\nreflecting back with guesses about what they are feeling and wanting, <br/>\nuntil they feel heard and shift out of being defensive. We don&#39;t take <br/>\nanything personally, for we know that upset, attacking, defensive <br/>\nstatements are tragic expressions of unmet needs. At some point, the <br/>\nperson&#39;s voice and body language will indicate that a shift has <br/>\noccurred.<br/>\n<br/>\nAt a meeting I attended at a mosque in a refugee camp near Jerusalem, <br/>\na man suddenly stood up and cried, &quot;Murderer!&quot; As a Giraffe, all I <br/>\nheard was &quot;Please!&quot; - that is, I heard the pain, the need that wasn&#39;t <br/>\nbeing met. That is where I focused my attention. After about 40 <br/>\nminutes of speaking, he did what most of us do when we sense we have <br/>\nbeen accurately heard and listened to: he changed. The situation was <br/>\nimmediately defused of all tension. He later invited me to dinner.<br/>\n<br/>\nIn international disputes, as well as in relationship, business, <br/>\nclassroom, and parent-child conflicts, we can learn to hear the human <br/>\nbeing behind the message, regardless of how the message is framed. We <br/>\ncan learn to hear the other person&#39;s unmet needs and requests. <br/>\nUltimately, listening empathically does not imply doing what the <br/>\nperson wants; rather, it implies showing respectful acknowledgment of <br/>\nthe individual&#39;s inner world. As we do that, we move from the <br/>\ncoercive language we have been taught to the language of the heart.<br/>\n<br/>\nSpeaking from the heart is a gesture of love; giving other people an <br/>\nopportunity to contribute to our well-being and to exercise <br/>\ngenerosity. Empathically receiving what is going on in others is a <br/>\nreciprocal gesture. Giraffes experience love as openness and <br/>\nsensitivity, with no demands, criticism, or requirements to fulfill <br/>\nrequests at either end of a dispute. And the outcome of any dialogue <br/>\nruled by love is harmony.<br/>\n<br/>\nIn the end, Jackals are simply illiterate Giraffes. Once you&#39;ve <br/>\nlearned to hear the heart behind any message, you discover that <br/>\nthere&#39;s nothing to fear in anything another person says. With that <br/>\ndiscovery, you are well on your way to compassionate communication. <br/>\nThis form of dialogue, although offering no guarantees of agreement <br/>\nbetween disputing parties, sets the stage for negotiation, <br/>\ncompromise, and most importantly, mutual understanding and respect.</div>","specialLinks":[]}],"prevTopicId":77211,"nextTopicId":77131}}