{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":121373344,"authorName":"inmdcrew","from":"&quot;inmdcrew&quot; &lt;Hatfield72@...&gt;","profile":"inmdcrew","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom]Smushed Blueberries","postDate":"1029510642","msgId":41266,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGFqajRsaSs2NnZxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDNENUNGRjFELjgwMTAzMDlAbWlkc291dGgucnIuY29tPg=="},"prevInTopic":41260,"nextInTopic":0,"prevInTime":41265,"nextInTime":41267,"topicId":41243,"numMessagesInTopic":0,"msgSnippet":"... space... whereas I would say their behavior leans to the destructive. Maybe it s all part of being kids.  I don t know... ... think ... of ... permanent ","messageBody":"<div id=\"ygrps-yiv-710315384\">--- In Unschooling-dotcom@y..., KT &lt;Tuck@m...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;The difference I see is that I am not messing up everyone else&#39;s <br/>\n </span></blockquote>space... whereas I would say their behavior leans to the destructive. <br/>\nMaybe it&#39;s all part of being kids.  I don&#39;t know...<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt;<br/>\n&gt; I&#39;d be at a loss, too.  I&#39;ve always noticed that some kids tend to <br/>\n </span></blockquote>think <br/>\n<blockquote><span title=\"ireply\"> &gt; of things to do that I or my kids would never in a million years <br/>\n&gt; actually *do*.  (We might think of it.  &lt;g&gt;)  Maybe it&#39;s a function <br/>\n </span></blockquote>of <br/>\n<blockquote><span title=\"ireply\"> &gt; impulse control.  Maybe it&#39;s a personality thing.  <br/>\n&gt; <br/>\n&gt; In my house we kinda draw the line between messes that can be <br/>\n </span></blockquote>permanent <br/>\n<blockquote><span title=\"ireply\"> &gt; and those that won&#39;t.  I&#39;m right there for the  non-permanent <br/>\n </span></blockquote>ones.  But <br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m downright COERCIVE when it comes to the permanent ones.  I <br/>\n </span></blockquote>wouldn&#39;t <br/>\n<blockquote><span title=\"ireply\"> &gt; leave a carton of blueberries accessible to a 3 yo, knowing what <br/>\n </span></blockquote>could <br/>\n<blockquote><span title=\"ireply\"> &gt; happen.  I wouldn&#39;t leave an important piece of paper on the table <br/>\n </span></blockquote>where <br/>\n<blockquote><span title=\"ireply\"> &gt; they&#39;re eating cereal.  I understand that 8 yo&#39;s can get into <br/>\n </span></blockquote>anything <br/>\n<blockquote><span title=\"ireply\"> &gt; they want.  I expect my 8 yo to know better than a 3 yo.  If he <br/>\n </span></blockquote>can&#39;t or <br/>\n<blockquote><span title=\"ireply\"> &gt; doesn&#39;t, then I take other preventative measures.<br/>\n&gt; <br/>\n&gt; There&#39;s a red Jello Jiggler stain in my dining room that was caused <br/>\n </span></blockquote>by <br/>\n<blockquote><span title=\"ireply\"> &gt; my 8 yo showing off for his friends--his lack of caution and sense <br/>\n </span></blockquote>of <br/>\n<blockquote><span title=\"ireply\"> &gt; consequence astonished me at the time.  It was an accident that it <br/>\n&gt; landed on the carpet, but it was no accident what he was doing with <br/>\n </span></blockquote>it. <br/>\n<blockquote><span title=\"ireply\"> &gt;  He knew that Jello wouldn&#39;t stand up for long.  He should have <br/>\n </span></blockquote>thought <br/>\n<blockquote><span title=\"ireply\"> &gt; to do it in the kitchen.  ;) It really wasn&#39;t like him not to think <br/>\n </span></blockquote>so.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; But that&#39;s what I mean by drawing the line.  Messy things are part <br/>\n </span></blockquote>of <br/>\n<blockquote><span title=\"ireply\"> &gt; life, and a great part of learning.   Give them a batch of pudding <br/>\n </span></blockquote>to <br/>\n<blockquote><span title=\"ireply\"> &gt; play with in the bathtub.  Hand them old broken appliances and a <br/>\n&gt; screwdriver, or a hammer and an old piece of drywall to bust <br/>\n </span></blockquote>apart.  <br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; And take your shower before they get up.  ;)<br/>\n&gt; <br/>\n&gt; Tuck<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>I&#39;m agreeing w/ you there, Tuck.  I tend to not mind &quot;constructive&quot; <br/>\nmesses.  But I draw the line at non regard to belongings.  With only <br/>\nmy husband working I teach the kids to respect their belongings.  <br/>\nTheir father works hard for the little money we get.  Money doesn&#39;t <br/>\ngrow on a tree and those blueberries that smushed cost such and such.<br/>\nThey know that their silliness is tolerated and encouraged as long as <br/>\nsomething doesn&#39;t get broken or rendered useless; and that includes <br/>\nfood.  For example, they know they can draw color to their hearts <br/>\ncontent but don&#39;t waste paper.  Not only does sketch pads cost (what <br/>\nI think is too much) but for every pad trees are being killed.<br/>\n<br/>\nI also agree that showering, devotions, meditation, whatever needs to <br/>\nbe done before they get up.  It kinda kills my sleeping in time <br/>\n(which is such a bummer- I hate to even think about it) but at least <br/>\nI&#39;ve had some time to myself and can then be ready to do whatever <br/>\nthey want.<br/>\n<br/>\nSounds like I&#39;m strict doesn&#39;t it?  Not really.  I&#39;m a very relaxed <br/>\nperson and love to lounge around.  My house isn&#39;t the cleanest and we <br/>\nhave stuff everywhere.  But like I said our money is not unlimited <br/>\nand I prefer to only have to buy that pint of blueberries once. Ha!<br/>\n<br/>\nJust my opinions-flame away<br/>\nTina</div>","specialLinks":[]},{"userId":689589,"authorName":"KT","from":"KT &lt;Tuck@...&gt;","profile":"tuckervill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom]Smushed Blueberries","postDate":"1029504797","msgId":41260,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNENUNGRjFELjgwMTAzMDlAbWlkc291dGgucnIuY29tPg==","referencesHeader":"PEI5ODFCMENGLjEzOUQlbmVkdmFyZUBudHBseC5uZXQ+IDwwMGMwMDFjMjQ0ZDQkZTkwOTk0ZjAkYzRmYTMyM2ZASGVhdGhlcj4="},"prevInTopic":41243,"nextInTopic":41266,"prevInTime":41259,"nextInTime":41261,"topicId":41243,"numMessagesInTopic":0,"msgSnippet":"... I d be at a loss, too.  I ve always noticed that some kids tend to think of things to do that I or my kids would never in a million years actually *do*.","messageBody":"<div id=\"ygrps-yiv-1575731295\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt;<br/>\n&gt;The difference I see is that I am not messing up everyone else&#39;s space... whereas I would say their behavior leans to the destructive. Maybe it&#39;s all part of being kids.  I don&#39;t know...<br/>\n&gt;<br/>\n </span></blockquote>I&#39;d be at a loss, too.  I&#39;ve always noticed that some kids tend to think <br/>\nof things to do that I or my kids would never in a million years <br/>\nactually *do*.  (We might think of it.  &lt;g&gt;)  Maybe it&#39;s a function of <br/>\nimpulse control.  Maybe it&#39;s a personality thing.  <br/>\n<br/>\nIn my house we kinda draw the line between messes that can be permanent <br/>\nand those that won&#39;t.  I&#39;m right there for the  non-permanent ones.  But <br/>\nI&#39;m downright COERCIVE when it comes to the permanent ones.  I wouldn&#39;t <br/>\nleave a carton of blueberries accessible to a 3 yo, knowing what could <br/>\nhappen.  I wouldn&#39;t leave an important piece of paper on the table where <br/>\nthey&#39;re eating cereal.  I understand that 8 yo&#39;s can get into anything <br/>\nthey want.  I expect my 8 yo to know better than a 3 yo.  If he can&#39;t or <br/>\ndoesn&#39;t, then I take other preventative measures.<br/>\n<br/>\nThere&#39;s a red Jello Jiggler stain in my dining room that was caused by <br/>\nmy 8 yo showing off for his friends--his lack of caution and sense of <br/>\nconsequence astonished me at the time.  It was an accident that it <br/>\nlanded on the carpet, but it was no accident what he was doing with it. <br/>\n He knew that Jello wouldn&#39;t stand up for long.  He should have thought <br/>\nto do it in the kitchen.  ;) It really wasn&#39;t like him not to think so.<br/>\n<br/>\nBut that&#39;s what I mean by drawing the line.  Messy things are part of <br/>\nlife, and a great part of learning.   Give them a batch of pudding to <br/>\nplay with in the bathtub.  Hand them old broken appliances and a <br/>\nscrewdriver, or a hammer and an old piece of drywall to bust apart.  <br/>\n<br/>\nAnd take your shower before they get up.  ;)<br/>\n<br/>\nTuck</div>","specialLinks":[]},{"userId":60283004,"authorName":"Heather Woodward","from":"&quot;Heather Woodward&quot; &lt;bacwoodz@...&gt;","profile":"bacwoodz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom]Smushed Blueberries","postDate":"1029468473","msgId":41243,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwYzAwMWMyNDRkNCRlOTA5OTRmMCRjNGZhMzIzZkBIZWF0aGVyPg==","referencesHeader":"PEI5ODFCMENGLjEzOUQlbmVkdmFyZUBudHBseC5uZXQ+"},"prevInTopic":0,"nextInTopic":41260,"prevInTime":41242,"nextInTime":41244,"topicId":41243,"numMessagesInTopic":0,"msgSnippet":"The message here is: Let.  Let it happen.  Watch, and trust, and help if you can, but also trust from just the right distance, not too close, not distant. I","messageBody":"<div id=\"ygrps-yiv-1304298700\">The message here is: Let.  Let it happen.  Watch, and trust, and help if you<br/>\ncan, but also trust from just the right distance, not too close, not<br/>\ndistant.<br/>\n<br/>\n<br/>\nI have a question - and it doesn&#39;t have anything to do with religion :) I grabbed the above quote from Ned because I think it incorporates a lot of what I am having a problem with. The Trust issue. Trusting my children to learn I find relatively easy. I see it happening every day. I have read the discussions on parenting that go along with unschooling. Not forcing children to clean their rooms, brush their teeth, - logical consequences will follow by themselves etc. Trusting that I am not being to lienent and that they will become responsible adults is another matter. Here&#39;s an excerpt from my day...<br/>\n<br/>\nSo, here I am taking a shower and my guys are downstairs watching Tarzan and Jane ( 8, 4, & 3) I come down to find smushed blueberries - the whole container on my floor and they are laughing - as this is obviously fun. I wonder am I doing something wrong here? maybe the key is to get up before everyone and take my shower... maybe I am not supervising enough... If I just let them do whatever, they break everything - I keep the &quot;school room&quot; our space with all our art supplies, many bookshelves etc. open. Inevitablely someone writes on the walls,  crushes playdough into the carpet, or purposely breaks someone elses toy.  My daughter famous for her &quot;adventure trips&quot; always has some sort of moldy, rotting food in a bag - stuffed under her bed or somewhere out of sight - until we can smell it.  I keep telling myself these things shall pass - and I will laugh about them - but I can&#39;t imagine my kids are alone in this behavior.  So what have your experiences been and what am I doing wrong here?  My husband thinks I am not &quot;structured&quot; and they are learning by my example not to be neat - My office is always full of books, papers, coffee cups, etc.  The difference I see is that I am not messing up everyone else&#39;s space... whereas I would say their behavior leans to the destructive. Maybe it&#39;s all part of being kids.  I don&#39;t know...<br/>\n<br/>\nI am letting it happen - I am trying to trust -  - but in the meantime it can drive me nuts!  Any ideas...<br/>\n<br/>\nBy the way, they did clean up the blueberries - to a point, there are still stains I can&#39;t seem to get out... but only after me yelling - and I hate to do that.... yelling is the worst - and it seems so hard sometimes to not yell in these circumstances.....  It&#39;s hard to imagine anyone else here as a &quot;yelling, unschooler&quot;....<br/>\n<br/>\nHeather<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":41219,"nextTopicId":41268}}