{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":158112576,"authorName":"TeresaBnNC@aol.com","from":"TeresaBnNC@...","profile":"tbb1967","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] avoid rewarding sneakiness","postDate":"1072452772","msgId":86843,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQ5LjNjNzZjZC4yZDFkYWVhNEBhb2wuY29tPg=="},"prevInTopic":86830,"nextInTopic":0,"prevInTime":86842,"nextInTime":86844,"topicId":86830,"numMessagesInTopic":0,"msgSnippet":"This type of parenting made me think of a program that has recently been started at my oldest son s high school.    A few months ago, a freshman girl was ","messageBody":"<div id=\"ygrps-yiv-1470660867\">This &quot;type&quot; of parenting made me think of a program that has recently been <br/>\nstarted at my oldest son&#39;s high school.    A few months ago, a freshman girl was <br/>\nkilled in a car accident involving a drunk driver.  She and a couple other <br/>\nfriends had got a ride with an older guy, he had been drinking, and they <br/>\nsubsequently were in an accident.   In response to this tragedy, some parents started <br/>\na service called &quot;AnnaMac&quot;   ANother Night Alive, Make A Call... Taken from <br/>\nher name, Anna McAslin.   (heres a link for the full story  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.catawba.k12.nc.us/news_info/annamacfull.htm\">http://www.catawba.k12.nc.us/news_info/annamacfull.htm</a>   The short version is that parents are <br/>\noffering a service for kids to call to get a ride home, NO QUESTIONS ASKED.. if <br/>\na kid needs a ride because they have been drinking or their ride has been <br/>\ndrinking.    OK, great idea.. I&#39;m not dissing thier efforts, anything to save a <br/>\nkids life.. BUT, it was so strikingly crystal clear to our family what the real <br/>\nproblem is.. Kids are afraid to call thier parents!  They are afraid of the <br/>\nconsequences of drinking.   They have most likley been threatened with that &quot;If <br/>\nI ever catch you, or Your better never....&quot; so, instead of calling home for a <br/>\nride, they would risk thier lives with a drunk driver or drinking and driving <br/>\nthemselves.  Landon knows, he has known since he was.. well, I can&#39;t remember <br/>\nhow young, certianly before he started going out with friends.. that he can ( <br/>\nAND SHOULD!!) call me if he needs a ride.  I will be the one that offers &quot;No <br/>\nquestions asked&quot;   He has never called me for a ride. but he has told me &quot;so <br/>\nand so had  beer, etc.. and I got a ride home with someone else&quot;   He knows I am <br/>\nnot going to lecture him about being friends with so and so, or throw <br/>\njudgement on them.    My deepest sympathies go out to this family that lost thier <br/>\ndaughter, I know it&#39;s a tremendous heartbreak.. I can&#39;t help but think that the <br/>\nguilt must be horrendous, knowing that thier daughter would be alive if she had <br/>\njust called them for a ride.<br/>\n<br/>\nTeresa<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"avoid rewarding sneakiness","postDate":"1072447949","msgId":86830,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZjLjM2MDFjMDAxLjJkMWQ5YmNkQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":86843,"prevInTime":86829,"nextInTime":86831,"topicId":86830,"numMessagesInTopic":0,"msgSnippet":"In a message dated 12/26/03 1:10:16 AM, dezigna@comcast.net writes: ","messageBody":"<div id=\"ygrps-yiv-1428759948\">In a message dated 12/26/03 1:10:16 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dezigna@...\">dezigna@...</a> writes:<br/>\n<br/>\n&lt;&lt; One<br/>\nof the earliest parenting advice articles I ever read said to beware of<br/>\n&quot;Don&#39;t let me CATCH you doing ...&quot; statements, since it was a mixed message<br/>\nthat could be taken as a challenge. &gt;&gt;<br/>\n<br/>\n&quot;I better not ever see you doing X&quot; seems like a clear message to me.  We had <br/>\nfriends who did that.  Their kids were HORRIBLE when the parents were gone, <br/>\nand statuesque when they were there.  Military &quot;yes sir/no sir&quot; statues who <br/>\nnever did anything questionable.   It was as though they were holding their <br/>\nbreath in the presence of their dad, and when they hear the engine of his car, they <br/>\nlet loose everything they had been holding in, and they weren&#39;t breaking any <br/>\nrules by doing that.   Their understanding of the rule was correct:  They <br/>\ncouldn&#39;t do it where their dad could see them.<br/>\n<br/>\nIf a child has to pay a quarter for an offense, the offense has to be proven. <br/>\n <br/>\nIf the offense can be hidden, that saves 25cents.  Bad set-up.<br/>\n<br/>\nI could have told that dad what his kids were doing at my house, but I <br/>\ndecided not to.  They would have been punished beyond what it was worth, so I just <br/>\nmade deals with them myself, and explained in my own way what it would cost <br/>\nthem in terms of behavior and consideration if they wanted to play at my house.  <br/>\nAnd they did want to, and they did things my way at my house, which also <br/>\ninvolved them saying &quot;okay&quot; and calling me Sandra instead of using their Alabama <br/>\nmanners which only reminded me that they had a whole arsenal of behavioral tools <br/>\nwhich had no room left for real consideration of why things were done how, <br/>\nand forms of address which excused them from deciding which people they REALLY <br/>\nrespected or didn&#39;t.<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":86842,"nextTopicId":86697}}