{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":87403280,"authorName":"Jeff & Kate Kerr","from":"Jeff & Kate Kerr &lt;windystreet@...&gt;","profile":"saffronwoman","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Dakini","postDate":"1040086295","msgId":51934,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNERkU3NTE2LjVGRUJCRjI4QGVhcnRobGluay5uZXQ+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":51933,"nextInTime":51935,"topicId":51934,"numMessagesInTopic":0,"msgSnippet":"I was curious too so I googled dakini and this is what I found at: http://www.dakini.demon.co.uk/ Superficially the Dakini embodies the spirit of female wrath,","messageBody":"<div id=\"ygrps-yiv-108744228\">I was curious too so I googled dakini and this is what I found at:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.dakini.demon.co.uk/\">http://www.dakini.demon.co.uk/</a><br/>\n<br/>\nSuperficially the Dakini embodies the spirit of female wrath, she<br/>\nappears to dance in a wild frenzy, bent on destruction chaos and<br/>\ntransformation. She is naked except for a necklace of skulls around her<br/>\nneck. The skulls are those of her slain victims. In her right hand she<br/>\nholds a vajra or knife. In the left she caries a skullcup, it is filled<br/>\nwith blood which she drinks. In most images of the Dakini she is seen<br/>\ndancing on the corpse of a human.<br/>\n<br/>\nInitially the images may appear repulsive and violent. For those beings<br/>\nwho are not attracted to or excited by violence they may<br/>\nlegitimately ask themselves what they are doing as a central part of one<br/>\nof the oldest world philosophies which takes very seriously the concept<br/>\nof compassion and loving kindness.<br/>\n<br/>\nFor those beings who find violence and anger attractive and are attached<br/>\nto such states they may mistakenly see in the Dakini a<br/>\nglorification of wrathful violence, particularly as manifest in the<br/>\nfemale form. To view the Dakini on either level is to miss her teaching.<br/>\n<br/>\nThe Dakini are not bent on mindless destruction or chaos for its own<br/>\nsake The wrath they embody is towards their own states of<br/>\nanger, greed and delusion, which they and their practitioners seek to<br/>\ncut out and transform. Great energy and determination is<br/>\nneeded to achieve this and the violent imagery used shows the energy<br/>\nnecessary to cut out the roots of ignorance, greed and delusion.<br/>\n<br/>\nJust as St George cuts the head of the dragon in icons throughout<br/>\nChristendom, so the Dakini severs the heads of beings who are<br/>\nnone other than her own demons. To see the Dakini as a being who revels<br/>\nin anger or violence for its own sake is to misunderstand the imagery.<br/>\nHers is not a glorification of anger and violence but a transformation<br/>\nof it.<br/>\n<br/>\nDakini are also known as Sky Dancers, and they appear in many different<br/>\nguises. The concept of the Dakini is highly developed in<br/>\nTibetan Buddhism and many images and stories of the Dakini come from<br/>\nthat culture. However the spirit of the Dakini is<br/>\ntrans-cultural and is not tied to any historic period.<br/>\n<br/>\nVery interesting.<br/>\nKate</div>","specialLinks":[]}],"prevTopicId":51932,"nextTopicId":42586}}