{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":91123469,"authorName":"The Bucknums","from":"The Bucknums &lt;ctbucknum@...&gt;","profile":"hsmamaca","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Woohoo I&#39;m so ecstatic!!","postDate":"1054584495","msgId":71825,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNDEwMWMzMjk0MiRiM2UwMmYyMCQ3MmVlNGYxOEB5b3VyemU4Y3h2cjh0dD4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":71824,"nextInTime":71826,"topicId":71825,"numMessagesInTopic":0,"msgSnippet":"HI I just wanted to say Yayhoo!  My Intentional Community project is getting somewhere!!! Warning: If you all are tired of hearing about this or simply don t","messageBody":"<div id=\"ygrps-yiv-1482869350\">HI I just wanted to say Yayhoo!  My Intentional Community project is getting somewhere!!!<br/>\n<br/>\nWarning: If you all are tired of hearing about this or simply don&#39;t care delete it now.  Or if it&#39;s not for your list email me here <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ctbucknum@...\">ctbucknum@...</a>. I will also apologize for the cross posts as I want to send the news to everyone so some of you will hear about this over and over as I know I share many lists with many people.  Also I&#39;m NOT talking about a commune but an Intentional Community. see here <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.ic.org/pnp/myths.html\">http://www.ic.org/pnp/myths.html</a><br/>\n<br/>\nWe now have a name &quot;Harmony Gardens Cooperative&quot;  I am so excited All I have to do now is get more members (the list has 14 members including couples) and start the legal wrangling, deciphering, and research.  <br/>\n<br/>\nAfter some questioning on my part, as to whether this would go anywhere because of speratic non-committal interest from such a wide variety of people I have done some research and discovered/realized that it&#39;s to be expected.  Until we have more actually down on paper and a legal footprint many people are just not confident in an &quot;idea&quot; and want to see some proof.  I can understand.  I&#39;m off to get some.  I so wish I had more knowledge of the rules and regs in this province or access to a mind that did.  (money to pay the minds I know of)   <br/>\n<br/>\nWhat we have decided, amongst other things, is that we need min 70 acres, 12-16 households,  within 55km to downtown core, some people want a condo connected to the community hall, some want single detached private housing on an acre or two.   We have figured out what our member shares, fees, and dues will be and are looking at affordability for single parents and low income households.   I&#39;m leaving the new list info below if anyone is interested we are looking for members hint hint.  No really I just needed to express my excitement so...<br/>\n<br/>\nThanks for letting me &#39;shout it from the roof tops&#39; so to speak.<br/>\n<br/>\nYippee!!!<br/>\nBless you all have a wonderful week!!<br/>\nTeresa Bucknum in Canada<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/communityliving-ed/\">http://groups.yahoo.com/group/communityliving-ed/</a><br/>\nThis list is for people interested in starting an intentional community just outside the city of Edmonton, Alberta, Canada.  Here we can discuss our plans and ideas. <br/>\n<br/>\nWe are The Harmony Gardens Cooperative* a group of mostly homeschooling families with varying backgrounds, incomes, religions, and philosophies.  We want to create a little &quot;village&quot; of our own.  A place to raise our children and grow old in, with support and security.  <br/>\n<br/>\nAs a community we are committed to the well-being of all our members, especially the children.  With a policy of consensus all members are able to discuss and vote on issues and concerns as they relate to the community.  We plan on building a low impact, environmentally friendly, and sustainable community.  With &quot;living as a community&quot; as our basic foundation we hope to build a hall which would include a kitchen, library, playroom, and exercise equipment.  This would be a place where we could gather for meetings as well as for everyday socializing.  We are also planning a communal workshop, an outdoor ice rink, and a playground.  <br/>\n<br/>\n The community garden will be a big part of our plan as it will not only help feed us, but will help us earn an income through sales at farmers markets.  Having land and pasture available for small animals like sheep and chickens will allow us to add organically grown proteins to our diet, items to our sales, and educational opportunities for adults and children alike.<br/>\n<br/>\nWe are supporting alternative building practices like straw bale, cordwood, and cob, as well as solar and gray water systems.  We want to remain feasible to persons with lower incomes as well, so we will keep building options open.<br/>\n<br/>\nWe are open to families, singles, and couples regardless of age, religion, ethnicity, disabilities, or sexual orientation.  If you are interested in living in a planned community with a sustainable lifestyle we might just have the place for you. <br/>\n<br/>\n<br/>\n*cooperative status is pending.   <br/>\n<br/>\nFor more information see here <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.ic.org/pnp/myths.html\">http://www.ic.org/pnp/myths.html</a> (as above),<br/>\nhere  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.ic.org/pnp/cdir/1995/01kozeny.html\">http://www.ic.org/pnp/cdir/1995/01kozeny.html</a><br/>\nand here <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.ic.org/pnp/cdir/1995/05quest.html\">http://www.ic.org/pnp/cdir/1995/05quest.html</a><br/>\n<br/>\nThank You for your time.  :-)<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":71820,"nextTopicId":71702}}