{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":120281009,"authorName":"thinkspringblooms","from":"&quot;thinkspringblooms&quot; &lt;muddpies@...&gt;","profile":"thinkspringblooms","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"editorial comments please?long","postDate":"1065064319","msgId":16487,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJsZzUxdis1bm5tQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":16486,"nextInTime":16488,"topicId":16487,"numMessagesInTopic":0,"msgSnippet":"Going into my local  group s newsletter.  Comments? Please avert your eyes - I m changing paradigms! I collect quotes, because it fascinates me that human","messageBody":"<div id=\"ygrps-yiv-1189743545\">Going into my local  group&#39;s newsletter.  Comments?<br/>\n<br/>\nPlease avert your eyes - I&#39;m changing paradigms!<br/>\n<br/>\n<br/>\n  I collect quotes, because it fascinates me that human minds can get <br/>\nsuch very deep and difficult ideas across so poignantly and <br/>\nsuccinctly.  I have had life-changing &quot;AHA!&quot; moments inspired by <br/>\nthese snippets of mind, so I thought I would share a couple of quotes <br/>\nI came across while collecting inspirational, pithy prose to share on <br/>\nthe SOS website, and some of my own thinking in response.<br/>\n<br/>\n  \tLaura, from Texas, wrote this on an email list:  <br/>\n\t\t &quot;One piece of advice I always give, and the thing <br/>\nthat often gets TOTALLY left out of &quot;what you need to get started&quot; is <br/>\nthat new homeschoolers should spend some time thinking about what <br/>\neducation, and &quot;being educated&quot; means to them. Where is it that <br/>\nthey&#39;re trying to go? What do they want to accomplish? What&#39;s <br/>\nimportant to them about the process? What&#39;s important to their <br/>\nchildren? What kind of life do they want to have together?. . . &quot;  <br/>\n<br/>\nI think my early formal education, and most probably that of most <br/>\nAmericans of my generation, had a pretty typical look to it:  without <br/>\nhaving to think about it, my parents sent me to catch the big yellow <br/>\nbus at the bottom of my street every morning before 9 am, from the <br/>\ntime I was five until I received my public high school diploma at age <br/>\n18.    I was lucky enough to have been born with the temperament and <br/>\ntalent to fit into that world very easily.   As an early and avid <br/>\nreader I did spend a LOT of time reading materials of my own choice <br/>\noutside of school, but as a people-pleaser, I kept that stuff to <br/>\nmyself and  found most of my self-esteem in being &quot;smart&quot; in school - <br/>\nready, able and willing to take in and spit back whatever my teachers <br/>\nrequired, pleased at the thought that I was what my mother expected <br/>\nme to be:  smart and diligent,  bringing home A+ report cards on a <br/>\nquarterly basis, for 13 years.   (Well, I&#39;ll admit there were quite a <br/>\nfew B&#39;s in the last couple of years, but that&#39;s a whole &#39;nother <br/>\nstory!) <br/>\n               When senior year came and thoughts turned to &quot;my <br/>\nfuture&quot; it went without saying that college was ahead,  though I <br/>\nreally had no particular career or direction in mind, and I just went <br/>\nbecause it was expected - I was smart, and back then (aargh! has it <br/>\nreally been twenty+ years?!?!) smart people went to college.  It was <br/>\nexpected.   This was the path through  &quot;Good Education&quot;  and out the <br/>\nother side to  &quot;Good Job.&quot;  <br/>\n             College was quite a bit tougher to slide through than my <br/>\nprevious schooling had been;  I wasn&#39;t sure why at the time, but <br/>\nsince then I&#39;ve come to realize that I had chosen many classes where <br/>\nI was required to do a lot of original thinking,  something I was  <br/>\nhardly even ALLOWED to do before.  So here I finally tasted the inner <br/>\nrewards of thinking outside the box, began to realize that all that <br/>\nlearning I had done by reading on my own was my REAL education, and <br/>\nbegan to acknowledge that fitting in the box had so very little to do <br/>\nwith who I truly was and who I might possibly become.  <br/>\n                I managed to squeak through and graduate with a BA in <br/>\nart history -- which I loved, and love, but hardly guarantees a &quot;Good <br/>\nJob&quot; manifesting itself!   I flailed, my dh flailed (his BA is in <br/>\nArt!), together we flailed around trying to figure out what to do <br/>\nwith ourselves, til we made a baby, pretty much inadvertantly, and <br/>\nmy &quot;Good Job&quot; was forever redefined as &quot;mother.&quot;   My first-born, my <br/>\nangel, my cattle-prod, my Larkin allowed for no speck more of in-the-<br/>\nbox thinking, or expectations, or living.   I now had another life, <br/>\nanother spirit I was wholly responsible for, and I would push myself <br/>\nto be the  best at it that I could be, and that meant I needed to be <br/>\nthe best me I could be, and that meant a whole heck of a lot of <br/>\nchallenged expectations!   Lucky for me, whil I was still pregnant <br/>\nwith Larkin, I came across John Holt&#39;s books and after only a few <br/>\npages I found his ideas resonating deeply within me - I remember <br/>\nthinking, I KNEW this, I KNEW this! He knew what my childhood looked <br/>\nlike, he knew about children, he knew how children learn and he knew <br/>\nwhat it means to be &quot;educated&quot;.  <br/>\n       \tWe became unschoolers at that point, saying to ourselves (and <br/>\nanyone who would listen!) that we don&#39;t need school to learn, and <br/>\nwhile adding three more young&#39;uns, have only gone further to the edge <br/>\nof the &quot;unschooling spectrum&quot; as the years have gone by.   We live <br/>\nour lives as if school didn&#39;t exist.  We&#39;ve become less and less <br/>\ninfluenced by the typical, the expected, the schooled; and more and <br/>\nmore entranced with the joy, the beauty, the possibilities, of the <br/>\nreal, natural world.  Our education is not preparation for some <br/>\nfuture &quot;real&quot; life, it IS our lives.  We learn because we can&#39;t NOT <br/>\nlearn.  We trust ourselves and each other to engage the world <br/>\njoyfully, thoughtfully, respectfully, compassionately;  we trust <br/>\nourselves and each other to learn the world&#39;s &quot;lessons&quot; as they&#39;re <br/>\nneeded and as they come into our awareness.   We trust ourselves and <br/>\neach other to be and become the self-made, self-aware, self-<br/>\nactualized persons we were each born to be.   <br/>\n\tThose are my answers to Laura&#39;s poignant questions.  So far.  <br/>\nMaybe I&#39;ll learn something next week or next year that will change my <br/>\nmind.  Life is learning.<br/>\n<br/>\n<br/>\n<br/>\nLife is good.<br/>\nLive long and prosper.<br/>\nMay the force be with you.<br/>\nNamaste.<br/>\ncris</div>","specialLinks":[]}],"prevTopicId":9818,"nextTopicId":16488}}