{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":286713246,"authorName":"Melissa Dietrick","from":"&quot;Melissa Dietrick&quot; &lt;melissa.dietrick@...&gt;","profile":"melidi7","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"*my* testing anxiety--an update...","postDate":"1213286348","msgId":35318,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZhZjJhZDY2MDgwNjEyMDg1OXUzN2NiNTc0ZngzYzc2NmI5ZTBjZmNlNDAwQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":35317,"nextInTime":35319,"topicId":35318,"numMessagesInTopic":0,"msgSnippet":"hello all, I just wanted to touch in and let all of those who gave me so many things to thinkabout and do re *my* testing anxiety, (in italy, unschooling all","messageBody":"<div id=\"ygrps-yiv-264232621\">hello all,<br/>\nI just wanted to touch in and let all of those who gave me so many things to<br/>\nthinkabout and do re *my* testing anxiety, (in italy, unschooling all by my<br/>\nlonesome) that we survived and shanti took the exam on Monday this week...<br/>\n<br/>\nI never got back to yo all as you may well imagine with 7 children, two<br/>\nfamily businesses, and a minifarm with animals  plus me trying to create<br/>\nonline community for homeschooling and attachment parenting in italy is<br/>\nkeeping me rather busy, lol.<br/>\n<br/>\nI really took to heart the suggestion that Lisa Wendell threw out to me:<br/>\n<br/>\n&#92;&#92;Would she understand if you had a conversation with her about how she has<br/>\nto<br/>\ntake this test just to keep them happy so she can continue to stay at home?<br/>\nJust make it a &quot;it&#39;s really not a big deal, you will do as well as you can<br/>\nand<br/>\nget it over with, kind of conversation.&quot; That you&#39;ll do something special<br/>\nafterwards to celebrate that it is over and she gets to stay home. Tell her<br/>\nyou&#39;d rather she not have to take the test (so she knows you are on her<br/>\nside)<br/>\nbut it is unavoidable so we will do it and not make anything of it. Let her<br/>\nknow you and dad think she is wonderful exactly where she is and you know<br/>\nshe is<br/>\ndoing well in life - living and learning through living her interests but to<br/>\ncontinue on this path they have this test - maybe not even call it a test -<br/>\njust<br/>\ncall it something different - perhaps call it &quot;they want to go over some<br/>\nthings<br/>\nwith you and ask you some questions.&quot;<br/>\n<br/>\nCould you approach it from a playful aspect: It&#39;s just a silly little rule<br/>\nthey<br/>\nhave about children that don&#39;t go to school. Skip around / dance around<br/>\nbefore<br/>\nor afterwards. Do something special together - go get an ice-cream cone (or<br/>\nwhat ever would be special to her). Put on her favorite music and have a<br/>\nparty<br/>\n/ celebration afterwards? Put the focus on FUN ? Spend a lot of time<br/>\nplanning<br/>\ntogether this special event so that she focuses on the FUN.&#92;&#92;&#92;<br/>\n<br/>\nsorry to copy it all out, but for me this was just sooo key.  *this* is<br/>\n*me*...but my fears were taking over the show...<br/>\n<br/>\nwe made an exam dress together, she doing the design, measurements and<br/>\n(modelling lol)<br/>\nwe made plans for where to go afterwards (to the local, famous pastry shop<br/>\nnear the school) and we had an end of school/finished exam party for lunch<br/>\n(as all her olders had their first day of vacation on her exam day), and we<br/>\njust relaxed. a few days later she wanted to know what might be on the test,<br/>\nand we went thru her books and I showed her what I thought they might be<br/>\ninterested in seeing... I left it up to her to cover anything in particular,<br/>\nbut I upped my playing on the computer at mathy sites and found out we have<br/>\nalot of fun together doing that!  that was it for review.  that met my needs<br/>\nfor consistancy &quot;unschooling-wise&quot;.  the last three days she set to work, on<br/>\nher own accord, to finish up a times table grid that is in one of her<br/>\nbooks...I was totally relaxed about whether she reviewed or not, that felt<br/>\nreal good.  I had really let go of the whole thing.<br/>\n<br/>\nThe day of the exam, shanti had woke up scared to go, but bit by bit we got<br/>\nup, ate, got in the car, got out, got into the school, met the teachers that<br/>\ndid the exam, waited for them to get ready, got in the room...slowly slowly<br/>\nher fear calmed and she became herself again.  They had prepared three<br/>\ntest sections,<br/>\n<br/>\nscience/geography: a couple worksheets with the cycle of life of the<br/>\nseed/plant, and the egg/chick/chicken.  another with the circle of the days<br/>\nof the week, the months the seasons...  some pics with before during and<br/>\nafter to figure out...<br/>\n<br/>\nmath: a bunch of stuff she was familiar with...the only trouble there were<br/>\nknowing the multiplications by memory: the teacher was real n ice and she<br/>\nsaw she understood the principals involved with multiplication so after<br/>\ncalculating a few like 8x9, 7x8, on her fingers<br/>\nthe teacher just waved the rest, lol.<br/>\n<br/>\nand for language some reading and answering the questions.<br/>\n<br/>\nshe was real fun to watch (we, me and her two smaller brothers were right<br/>\nthere with her, and she got to sit in my lap as long as she wished):  she<br/>\nwould look a page, say &quot;this is too easy&quot; and toss it aside!! totally normal<br/>\nlol.  the teachers would say, but no, please, fill it out, just for us? we<br/>\nreally need to have that silly piece of paper so you can just keep on doing<br/>\nschool at home...and she: &quot;okay, but its silly stuff...&quot;  LOL!<br/>\n<br/>\ntowards the end (it took about 2 hours!, I think they didnt realize how much<br/>\nstuff they had gathered for her to do) she was getting tired and the teacher<br/>\n(that later I found out is the vice principal!) was just so nice and really<br/>\nwalked her thru each thing...<br/>\n<br/>\nShana was just soo happy to have faced it and got it done.  I had made sure<br/>\nin advance no mention of grades or passing failing what not would be<br/>\nmentioned in front of her, and they really respected that.<br/>\n<br/>\nas for me?  I really figured out alot of stuff.  Like why I was so anxious.<br/>\nI hate ambiguous situations.  And here I really couldnt figure out  what was<br/>\ngoing on.  I wont go into all the details, but alot that came up for me was<br/>\nlinked with my feeling so sad that the relationship that I had had with one<br/>\nparticular teacher of my first 4 children, just went down the drain because<br/>\nof our choosing to homeschool.<br/>\n<br/>\nAlso, I found out that because of that &quot;friendship&quot; that turned out not to<br/>\nbe such a friendship, I was lacking in clarity about what I *really*<br/>\nwanted:  dh said it so well:  &quot;you got what you wanted, didnt you?&quot;  and<br/>\nme:  &quot;what did I want?&quot;  and him: &quot;you wanted to let your girl learn in<br/>\nfreedom, no?&quot;<br/>\n<br/>\nthis just about floored me because I was getting sucked back into a school<br/>\nmentality all because of my fears around this testing.  So I started reading<br/>\nthe archives here and elsewhere... and I came across this post, that sandra<br/>\nwrote recently but seems I missed:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/AlwaysLearning/message/34034\">http://groups.yahoo.com/group/AlwaysLearning/message/34034</a><br/>\n<br/>\nreading this was so grounding for some reason (just to read that someone<br/>\nelse had to deal with testing and what they did was wnderful)...and I came<br/>\naway filled with a new ...vehemence? cant find the word.  I want to find out<br/>\nmore as to why testing is so detrimental to natural learning (unschooled<br/>\nlearning???) , and to any kind of learning...<br/>\n<br/>\nArent there any articles or research on this subject?<br/>\n<br/>\nIm am also very committed now to forming a homeschooling unschooling forum<br/>\nto help  italian homeschoolers connect...we have one already but it is run<br/>\nby a religious group that is very helpful, but they moniter ruthlessly.  It<br/>\nmakes for communicating freely a bit difficult...to say the least.  (nothing<br/>\nagainst the religion, I can understand their needs to protect their<br/>\ncommunity from subversive thinking, lol like challanging the officials on<br/>\ntesting, which is something I and others are trying to explore (with lots of<br/>\nposts not going thru, unfortunately)...<br/>\n<br/>\nIm trying to figure out how to describe (radical) unschooling to people who<br/>\nhave never heard of it.  A lot of italians cannot read english worth a dime.<br/>\n<br/>\n<br/>\nI am reluctant to use the tearm &quot;unschooling&quot; so I was wondering what others<br/>\nmight think a good term would be to use (translated into italian of<br/>\ncourse!)...<br/>\n<br/>\nmaybe that shoould be another thread? Ive been here too long already, but I<br/>\nreally wanted to let you all know that we survived and are stronger for it..<br/>\nmore determined that ever!<br/>\n<br/>\nxxxmelissa<br/>\nps Sandra, I was wondering how the &quot;curriculum&quot; translation worked out for<br/>\nyou all? maybe you would prefer to have the  eng. originals in italian first<br/>\nbefore using my version? also, recently rereading it, there are a few things<br/>\nId like to change, as I noticed  that I have a few &quot;teaching&quot; POV rather<br/>\nthan learning POV that I missed.<br/>\n<br/>\nAlso, because I need to really help a few friends in particular, that I may<br/>\npost about for advice soon, what should I translate first???<br/>\nokay thats probably way too much for one thread update, lol!<br/>\nmeli<br/>\n<br/>\n<br/>\nin italy<br/>\nmamma di 7<br/>\nlucia 20yr, lidia 17yr, matteo 13yr, raffaele 10yr,<br/>\nelena shanti 7yr, giacomo leo 4yr and gioele 2y<br/>\n<br/>\n&quot;There is a Place beyond Rightness and Wrongness -- I&#39;ll meet you there.&quot;<br/>\n<br/>\nRumi<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.larimeloom.etsy.com\">http://www.larimeloom.etsy.com</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.flauto.tk\">http://www.flauto.tk</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.attachmentparenting.eu\">http://www.attachmentparenting.eu</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":35301,"nextTopicId":35336}}