{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: Relationships with teens","postDate":"1139937185","msgId":112051,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ3Q0QwQjM5LUVBMTctNDRBNy05MDE2LTg4MjY1NTA2NjJGOUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGRzdDEycCs0bnQ1QGVHcm91cHMuY29tPg==","referencesHeader":"PGRzdDEycCs0bnQ1QGVHcm91cHMuY29tPg=="},"prevInTopic":112047,"nextInTopic":0,"prevInTime":112050,"nextInTime":112052,"topicId":112015,"numMessagesInTopic":0,"msgSnippet":"... I don t think you need to know what she wants, as long as you are willing to try not to give her what she s NOT wanting right now. Maybe she just wants","messageBody":"<div id=\"ygrps-yiv-1877399544\">On Feb 14, 2006, at 9:38 AM, nrskay wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; We are trying to put her first, but she can make that very difficult<br/>\n&gt; at times.  I think it because she doesn&#39;t know what she wants either.<br/>\n<br/>\n<br/>\n </span></blockquote>I don&#39;t think you need to know what she wants, as long as you are  <br/>\nwilling to try not to give her what she&#39;s NOT wanting right now.<br/>\n<br/>\nMaybe she just wants space and time and to have drinks and food put  <br/>\nwhere she can get them without ceremonial communal meals all the  <br/>\ntime.  Maybe she would like to have her laundry delivered folded  <br/>\nwithout comment or pressure.<br/>\n<br/>\nIt&#39;s VERY hard for me to leave a child or husband or guest alone.  I  <br/>\nwant to chat and smile and tell stories and go somewhere.  Sometimes  <br/>\nwhen that seems really inappropriate with my family for some reason,  <br/>\nI find a friend I haven&#39;t talked to for a while, and we go to lunch.<br/>\n<br/>\nMaybe your daughter would like for you to go to lunch with someone  <br/>\nelse and let her have the house to herself for an hour or two.  It  <br/>\nwon&#39;t last forever.  She&#39;ll only be 11 for a year.  Girls have real  <br/>\nstuff happening in those years, and it can feel very uncomfortable at  <br/>\nseveral levels, but it doesn&#39;t last forever.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":248175779,"authorName":"nrskay","from":"&quot;nrskay&quot; &lt;k_bird@...&gt;","profile":"nrskay","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Relationships with teens","postDate":"1139935129","msgId":112047,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRzdDEycCs0bnQ1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGRzcXIyZys4bG82QGVHcm91cHMuY29tPg=="},"prevInTopic":112031,"nextInTopic":112051,"prevInTime":112046,"nextInTime":112048,"topicId":112015,"numMessagesInTopic":0,"msgSnippet":"Thank you Amy, I have a tween 11 yo dd, who has been difficult lately.  She is already gone into puberty and the emotions at times are very hard to understand.","messageBody":"<div id=\"ygrps-yiv-1481851757\">Thank you Amy, I have a tween 11 yo dd, who has been difficult <br/>\nlately.  She is already gone into puberty and the emotions at times <br/>\nare very hard to understand.<br/>\n<br/>\nI want to be the best mom, but at times no matter what I do it is the <br/>\nwrong thing.  I feel like I&#39;m living on egg shells with her, my hubby <br/>\nsays the same thing.  <br/>\n<br/>\nWe are trying to put her first, but she can make that very difficult <br/>\nat times.  I think it because she doesn&#39;t know what she wants either.<br/>\n<br/>\nKay</div>","specialLinks":[]},{"userId":79168236,"authorName":"Amy Childs","from":"&quot;Amy Childs&quot; &lt;amyc@...&gt;","profile":"aimmee36","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Relationships with teens","postDate":"1139877075","msgId":112031,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRzcjhjaiszaDQ5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDBDOEFBMzhELUU1OUQtNDYxOC05QjgyLTcyN0NBNzY2OEE5N0BzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":112020,"nextInTopic":112047,"prevInTime":112030,"nextInTime":112032,"topicId":112015,"numMessagesInTopic":0,"msgSnippet":"... struggle with teens.","messageBody":"<div id=\"ygrps-yiv-723313625\"><blockquote><span title=\"ireply\">&gt;&gt;I haven&#39;t seen many people whose kids have been unschooled for years<br/>\n </span></blockquote>struggle with teens.&lt;&lt;<br/>\n<br/>\nThis makes sense; my experience is with new unschoolers and <br/>\ndeschoolers (and schoolers).<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; moving quickly toward a life based on happiness and learning.&lt;&lt;<br/>\n<br/>\n </span></blockquote>In my post I wanted to emphasize the &quot;happiness&quot; the relationship <br/>\npart, over the concern for &quot;learning,&quot; because I&#39;ve seen that it is <br/>\neasy for parents to get sidetracked when they have their eye <br/>\non &quot;learning.&quot;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Teens are probably not going to be distracted or entertained by<br/>\n </span></blockquote>clever strewing or road trips or movie rentals.&lt;&lt; (me)<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Mine are.&lt;&lt; (Sandra)<br/>\n<br/>\n </span></blockquote>Mine are too.  This was directed at new unschoolers, deschoolers, and <br/>\npeople who are having a rough time when they focus on the &quot;learning&quot; <br/>\npart.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;A teen who has been in school and controlled by parents at home <br/>\n </span></blockquote>might not be interested in spending that time with the parents, but <br/>\nthat&#39;s another matter.&lt;&lt;<br/>\n<br/>\nThis is my main point:  that if the kids aren&#39;t having fun, don&#39;t <br/>\nwant to be with the parents, and look like they &quot;aren&#39;t learning,&quot; I <br/>\nwould encourage parents to look first at the quality of their own <br/>\nrelationship with their child, before jumping to some kind of a <br/>\nconclusion that &quot;if I did exactly what the Dodds (for example) do, my <br/>\nkids would be as cool as them, and then unschooling would be working&quot;.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;How might a teen feel accepted and supported without offers of <br/>\n </span></blockquote>things to do, have, see, visit?&lt;&lt;<br/>\n<br/>\nIf a parent is harboring distrust, judgment, desire to control or <br/>\nmold (etc), the child will likely not go along with the parents <br/>\noffers, which could be (I think) misinterpreted as &quot;unschooling isn&#39;t <br/>\nworking.&quot; I think all people (to some degree) can tell if someone who <br/>\nis claiming to be &quot;fun&quot; is actually trying to control us, and teens <br/>\nare probably the least likely to be polite about it.  So an important <br/>\nfirst step for parents is to look inside and see if they really trust <br/>\ntheir child&#39;s process and have the relationship as the top priority.  <br/>\n<br/>\nWhat will most likely happen next, when a parent gets herself and her <br/>\ninner world sorted out a bit, is she will probably want to do have <br/>\nsee and visit things together.  This will then come from a place of <br/>\nlove friendship and fun, rather than from a place of &quot;this is what <br/>\ngood unschoolers are supposed to do.&quot;  It doesn&#39;t take years to <br/>\narrive at this place, sometimes just a ten minute time-out in which <br/>\nwe breathe and remember what&#39;s the most important.  The more history <br/>\nof control a parent has, the more times she will probably have to re-<br/>\ncommit to a relationship based on love and trust instead of coercion <br/>\nand distrust.   <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Maybe I&#39;m missing the &quot;distracted and entertained&quot; angle.<br/>\n<br/>\n </span></blockquote>Maybe I wasn&#39;t clear enough that I was addressing new unschoolers and <br/>\ndeschoolers.  I have seen new unschoolers try to extract and follow <br/>\ninstructions on how to &quot;do the right thing&quot; so that unschooling <br/>\nwill &quot;work,&quot; and &quot;learning&quot; will happen, rather than focusing on <br/>\nhaving a loving and trusting relationship with their child, and <br/>\nletting it flow from there.  <br/>\n<br/>\nNot a new concept to this list by any means, but I was just in the <br/>\nmood to say it again.<br/>\n<br/>\nAmy Childs</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Relationships with teens","postDate":"1139866661","msgId":112020,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBDOEFBMzhELUU1OUQtNDYxOC05QjgyLTcyN0NBNzY2OEE5N0BzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGRzcXIyZys4bG82QGVHcm91cHMuY29tPg==","referencesHeader":"PGRzcXIyZys4bG82QGVHcm91cHMuY29tPg=="},"prevInTopic":112015,"nextInTopic":112031,"prevInTime":112019,"nextInTime":112021,"topicId":112015,"numMessagesInTopic":0,"msgSnippet":"... I haven t seen many people struggle with teens in cases in which the teens have not been in school. It seems to me that school can ruin the relationship,","messageBody":"<div id=\"ygrps-yiv-829935460\">On Feb 13, 2006, at 1:44 PM, Amy Childs wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Whatever the reason, many parents struggle with their teens,<br/>\n&gt; unschooling or not.<br/>\n<br/>\n </span></blockquote>I haven&#39;t seen many people struggle with teens in cases in which the  <br/>\nteens have not been in school.<br/>\n<br/>\nIt seems to me that school can ruin the relationship, school at home  <br/>\ncan ruin the relationship, or years of attempted control and rules  <br/>\ncan ruin it.<br/>\n<br/>\nI haven&#39;t seen many people whose kids have been unschooled for years  <br/>\nstruggle with teens.<br/>\n<br/>\nI&#39;m sure that won&#39;t make people feel good whose kids were in school  <br/>\nuntil they were teens, but it&#39;s worth saying.<br/>\n<br/>\n-=-I encourage unschooling parents who are experiencing any kind of<br/>\nconflict with or about their teen (either rumbling around inside the<br/>\nparents&#39; head, or being acted upon in real life), to make a<br/>\ncommitment to put the RELATIONSHIP with this child above everything<br/>\nelse.  (Again!)<br/>\n-=-<br/>\n<br/>\nGood point.<br/>\n<br/>\nSometimes one way to make the relationship better is to get really  <br/>\ninvolved in interesting situtations, hobbies, explorations, clubs,  <br/>\nfriendships, music groups... moving quickly toward a life based on  <br/>\nhappiness and learning.<br/>\n<br/>\nIf a parent is thinking of waiting until they feel they have a good  <br/>\nrelationship with a fourteen year old boy to start inviting him  <br/>\nout...   he&#39;ll be 19 before he goes.<br/>\n<br/>\nRelationships are based on more than words.  Sometimes too much  <br/>\ndialog makes relationships worse.  Shared experiences create  <br/>\nrelationships.<br/>\n<br/>\n-=-Teens are probably not going to be distracted or entertained by  <br/>\nclever strewing or road trips or movie rentals. -=-<br/>\n<br/>\nMine are.<br/>\n<br/>\nA teen who has been in school and controlled by parents at home might  <br/>\nnot be interested in spending that time with the parents, but that&#39;s  <br/>\nanother matter.<br/>\n<br/>\nA parent who can&#39;t find a movie rental that would interest her and  <br/>\nthe teen together, or a parent who isn&#39;t willing to watch 24 or  <br/>\nDesperate Housewives with a teen; a parent  unwilling to take a kid  <br/>\nto Denver or Dallas (choose your semi-local equivalent eight-hour- <br/>\ndrive-requiring overnight) for a major exhibition or concert or  <br/>\nsomething; a parent who cannot possibly bring something home that  <br/>\nwould be of interest to his or her own child... that parent probably  <br/>\nisn&#39;t a good candidate for unschooling.<br/>\n<br/>\n-=-f they are not feeling cherished accepted and<br/>\ntotally supported by their parents, they&#39;ll just ignore or fight with<br/>\na parent who is trying to mask an unsupportive relationship<br/>\nwith &quot;good unschooling practices.&quot;-=-<br/>\n<br/>\nHow might a teen feel accepted and supported without offers of things  <br/>\nto do, have, see, visit?<br/>\n<br/>\nMaybe I&#39;m missing the &quot;distracted and entertained&quot; angle.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":79168236,"authorName":"Amy Childs","from":"&quot;Amy Childs&quot; &lt;amyc@...&gt;","profile":"aimmee36","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Relationships with teens","postDate":"1139863440","msgId":112015,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRzcXIyZys4bG82QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":112020,"prevInTime":112014,"nextInTime":112016,"topicId":112015,"numMessagesInTopic":0,"msgSnippet":"This is in response to some of the posts I ve been reading in here about not smart enough to unschool and Dodd-kid envy , also based on my work","messageBody":"<div id=\"ygrps-yiv-2133300632\">This is in response to some of the posts I&#39;ve been reading in here <br/>\nabout &quot;not smart enough to unschool&quot; and &quot;Dodd-kid envy&quot; &lt;grin&gt;, also <br/>\nbased on my work lately with new unschooling parents of &#39;deschooling&#39; <br/>\nteens, and other of my own pensive meanderings.<br/>\n<br/>\nWhen parents are feeling worried that &quot;learning isn&#39;t happening&quot; , or <br/>\nwhen they read the great ideas from the smart parents on this list, <br/>\nor when they see heartwarming stories of the Dodd family (or others) <br/>\n(which I love by the way, and I have three amazing best-friend kind-<br/>\nhearted curious unschooling teens living with me too) - when <br/>\nunschoolers (especially new unschoolers) read those posts I have seen <br/>\nthat it easy for some people to have that feeling like &quot;I&#39;m a bad <br/>\nunschooler&quot; and/or &quot;my kids are bad unschoolers.&quot; <br/>\n<br/>\nStrewing and googling and going on adventures and relaxing about TV <br/>\nand letting go of chores (etc!) are ALL good ideas for those of us <br/>\nwho want to live fun lives of unbridled happiness and learning.  But <br/>\nit might not be the first step, it might be a distraction from the <br/>\nunderlying issue that has been mentioned many times here, but it&#39;s a <br/>\nhorse worth beating which is that<br/>\n<br/>\nRELATIONSHIPS COME FIRST.<br/>\n<br/>\nI have found, especially with parents of adolescent unschoolers, that <br/>\nmany parents don&#39;t really know how to have warm open free loving fun <br/>\nrelationships with their teen-aged children.  I suppose it has <br/>\nsomething to do with puberty and burgeoning independence, and <br/>\nprobably not having had delicious relationships with ones own parents <br/>\nas adolescents, and then reinforced by the sad fact that most people <br/>\nexpect teens to be trouble and it doesn&#39;t even occur to them that <br/>\nthey could adore their adolescent children as much as their younger <br/>\nones.<br/>\n<br/>\nWhatever the reason, many parents struggle with their teens, <br/>\nunschooling or not.<br/>\n<br/>\nFor parents who have taken on the legal responsibility of &quot;educating <br/>\ntheir children&quot; (however your state mandates it), it is a convenient <br/>\nway to express our own conflicted-ness about our teens, by worrying <br/>\nabout their &quot;education&quot; - whether they are learning enough, whether <br/>\nthey are curious or generous or busy enough , or whether we know <br/>\nenough to `teach&#39; them.   <br/>\n<br/>\nI encourage unschooling parents who are experiencing any kind of <br/>\nconflict with or about their teen (either rumbling around inside the <br/>\nparents&#39; head, or being acted upon in real life), to make a <br/>\ncommitment to put the RELATIONSHIP with this child above everything <br/>\nelse.  (Again!)<br/>\n<br/>\nI notice again and again that this is harder for parents in the <br/>\nadolescent years, and so I find it helpful for parents to renew their <br/>\nconsciousness and intention about it, before they start trying to <br/>\nfind ways to &quot;be a better unschooler&quot;.  Teens are probably not going <br/>\nto be distracted or entertained by clever strewing or road trips or <br/>\nmovie rentals.  If they are not feeling cherished accepted and <br/>\ntotally supported by their parents, they&#39;ll just ignore or fight with <br/>\na parent who is trying to mask an unsupportive relationship <br/>\nwith &quot;good unschooling practices.&quot;<br/>\n<br/>\nMy kids are fun and funny and smart and playful and interesting and <br/>\ninterested and they include me in what they are thinking and doing <br/>\nand we have a great time together and I never wonder if they are <br/>\nlearning enough. BUT I don&#39;t attribute this to my own (or their ) <br/>\nsmarts or curiosity or strewing or adventures (although I do all <br/>\nthose things too) - I believe it absolutely begins in our love for <br/>\neach other.  My relationships with my kids are based completely in <br/>\ntrust and love, which (as has already been said on this list a <br/>\nzillion times) matters WAY more than anything.  <br/>\n<br/>\nAnd FROM this loving foundation my kids continue to unfold and <br/>\nblossom into amazing human beings.  (As would anyone!)<br/>\n<br/>\nAmy Childs</div>","specialLinks":[]}],"prevTopicId":112045,"nextTopicId":112048}}