{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"unschooling and money","postDate":"1094245170","msgId":99028,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQ5LjEzYzI3NDk2LjJlNmEzNTMyQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":99027,"nextInTime":99029,"topicId":99028,"numMessagesInTopic":0,"msgSnippet":"-=-Anyhow, from an unschooling parenting point of view, what do you all think about this issue? Sorry so long, I got chatty and had lots to say about this ","messageBody":"<div id=\"ygrps-yiv-1921888895\">-=-Anyhow, from an unschooling parenting point of view, what do you all think <br/>\nabout this issue? Sorry so long, I got chatty and had lots to say about this <br/>\nissue. Thanks for sticking with me to the bottom.-=-<br/>\n<br/>\nOne problem occurs when parents give a child money and then refuse to buy him <br/>\nthings after that.   &quot;You have money, you buy it,&quot; or whatever.   When we <br/>\ngive our children money, we mean for them to decide how to use that money on <br/>\ntheir own, without having to ask.   But I might want to buy them something and I <br/>\nwill (or at least offer), or if they see something they want that would <br/>\nreasonably be part of their health, welfare, food, shelter, clothing, &quot;education,&quot; I <br/>\ncan justify that in the budget, and if we can afford it and it seems like a <br/>\ngood deal, I won&#39;t make them use their own money.<br/>\n<br/>\n-=-If you currently know enough about finances to work with your son in a<br/>\nresponsible manner, I don&#39;t think it is fair to blame your current financial<br/>\nproblems on &quot;how you were raised.&quot;-=-<br/>\n<br/>\nPeople can get stuck feeling needy in one area or another, and it can cause a <br/>\nlot of problems.  It is possible for a parent to see how not to cause the <br/>\nsame vacuum in a child, yet still find self-comfort in eating or shopping or <br/>\nsomething.<br/>\n<br/>\nIf I don&#39;t keep in mind how treatment of children can have longlasting <br/>\neffects, I might be less vigilant than I want to be.<br/>\n<br/>\nI&#39;m better with money than I used to be, but my children area already better <br/>\nthan I am.  I might be better later, but I will never be as good as they <br/>\nalready are.<br/>\n<br/>\nI have an article about this here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/spoiled\">http://sandradodd.com/spoiled</a><br/>\n<br/>\nWhile there are issues of temperament, there are many other factors that will <br/>\ndetermine a child&#39;s relationship with money and other people.   At the Dallas <br/>\nairport yesterday we had a layover.  Marty, Holly and I were in a little <br/>\nmagazine stand.  Holly wanted gummy bears, but settled for Red Vines.  Marty was <br/>\ngetting a root beer. I picked up a magazine with an article about the coming <br/>\nmovie &quot;Alexander&quot; on the cover, as that&#39;s Marty&#39;s middle name and he has an <br/>\ninterest in the historical character separate from that too.   <br/>\n<br/>\nI had a ten dollar bill out.  Two women were working there, and no one else <br/>\nwas in the shop.<br/>\n<br/>\nHolly was already at the counter, and I handed the magazine over, and the <br/>\nmoney (toward Holly) but she said, &quot;No, I&#39;m paying for this with my money.&quot;  Her <br/>\ncandy was the least expensive thing on the counter.<br/>\n<br/>\n&quot;Even my magazine?&quot;<br/>\n<br/>\n&quot;Yes.&quot;<br/>\n<br/>\nThe woman who had been stocking in the corner came over to see this child who <br/>\nwas offering to buy things for her mom and brother.  Both women commented on <br/>\nbeing glad when their kids bought them things someday.<br/>\n<br/>\nBut their kids might not.  And I don&#39;t think that&#39;s just temperament, though <br/>\ntemperament is a starting place.<br/>\n<br/>\nSome other factors are neediness, self esteem, self image, relationship with <br/>\nthose particular others, feelings of safety, trust, and probably others people <br/>\nhere could think of.<br/>\n<br/>\nIn the nature vs. nurture discussions, I always think of the crowded rats <br/>\nexperiments done in the 1960&#39;s (I think).   Rats were bred for a few <br/>\nrat-generations, some to be agressive and others to be pacifist.   Then some of both kinds <br/>\nof rats were put in spacious, interesting environments, and some of both were <br/>\nput in crowded, stark places.<br/>\n<br/>\nNice rats in bad environments acted worse than mean rats in good environments.<br/>\nNice rats in good environments acted better than mean rats in good <br/>\nenvironments.<br/>\nNice rats in bad environments acted better than mean rats in bad environments.<br/>\n<br/>\nNo one factor decides all.<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":99004,"nextTopicId":99019}}