{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"principles/rules (was True Freedom)","postDate":"1069959998","msgId":85464,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1LjFkNjU2ZTJiLjJjZjdhNTNlQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":85463,"nextInTime":85465,"topicId":85464,"numMessagesInTopic":0,"msgSnippet":"In a message dated 11/27/03 9:51:57 AM, danielle.conger@comcast.net writes: ","messageBody":"<div id=\"ygrps-yiv-713598796\">In a message dated 11/27/03 9:51:57 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:danielle.conger@...\">danielle.conger@...</a> writes:<br/>\n<br/>\n&lt;&lt; Asking permission <br/>\nbecomes a way of gauging their own sense of right and wrong because they <br/>\nknow that I will explain a no and help them come up with better <br/>\nalternatives. &gt;&gt;<br/>\n<br/>\nI really like what Danielle wrote, and it&#39;s seeming to tie right in with the <br/>\nprinciples/rules ideas.<br/>\n<br/>\nWe announce when we&#39;re going to bed.  Keith doesn&#39;t usually, but we assume if <br/>\nit&#39;s past 10:00 p.m. he&#39;s probably gone back in the back to sleep.  Even on <br/>\nvacations he usually goes to bed early.  He stayed up until 1:00 to play Encore <br/>\nwith a big group a week and a half ago, and it was notable. <br/>\n<br/>\nIf I say I&#39;m going to bed, it&#39;s kind of a last call for me to help people do <br/>\nsomething.  If Holly says &quot;I&#39;m going to bed,&quot; and I&#39;m up, it means she wants <br/>\nme to go with her and help her and tuck her in.   If Marty says &quot;I&#39;m going to <br/>\nbed&quot; it means he relinquishes the computer, and he&#39;s no longer available to <br/>\nother teen-boys as a gaming partner.  (Because of Kirby&#39;s schedule, he sometimes <br/>\nis brought home by or brings home other gamers.)   If Kirby says &quot;I&#39;m going to <br/>\nbed&quot; it might mean he&#39;s sick, because he&#39;s usually the last one down. &lt;g&gt;  <br/>\nBut it deeply means &quot;nobody gets my computer or X-Box until tomorrow.&quot;<br/>\n<br/>\nWe have a policy/rule/tradition &lt;??&gt; here of people telling where they&#39;re <br/>\ngoing and when they might be back.  We expect the kids to let us know where <br/>\nthey&#39;ll be, but it&#39;s easy for them to do, because we have always done that for <br/>\nthem.  We always leave them phone numbers where we can be reached, if I&#39;m going to <br/>\nthe movie with someone I tell them when theater I&#39;ll be in.  It just makes <br/>\nthem feel secure.  And so they have no qualms about telling us exactly where <br/>\nthey&#39;ll be, with whom, and giving us phone numbers.  It just seems natural.<br/>\n<br/>\nKeith left one day and didn&#39;t say where.  He was gone a LONG time, like three <br/>\nhours.   I was shocked.  He hadn&#39;t even gone to a movie.  He had gone to buy <br/>\nshoes, and he hates buying shoes.   So he was traumatized enough and I didn&#39;t <br/>\npress him to do better next time &lt;g&gt;.   I think he knew if he had said he was <br/>\ngoing to get shoes I would have offered to go and help, but I couldn&#39;t go that <br/>\nday anyway.  And if he declared &quot;shoes&quot; and came back without shoes, he would <br/>\nhave failed.  So he just limped away (mentally limping) and came back with <br/>\ntwo pairs of shoes, and some trauma to overcome.<br/>\n<br/>\nThe only problem was a friend of his had called and wanted to come and get <br/>\nsomething from Keith and I had said he should come over and wait, that I figured <br/>\nKeith had just gone to Lowe&#39;s or Costco and so should be back any time.  <br/>\n<br/>\nIt&#39;s minor, but it&#39;s a good indication that it&#39;s deeply ingrained habit here.<br/>\n<br/>\nInterestingly, the one way Kirby is irritating me since he has been able to <br/>\ndrive is that he doesn&#39;t leave enough and doesn&#39;t stay long as long as I expect <br/>\nhim to.  Last night he told me he would take his friends home, and this <br/>\nmorning they&#39;re still here.  I&#39;m sure they just played until it was too late and <br/>\none of them was asleep and it was past midnight and Kirby can&#39;t legally drive <br/>\nafter midnight, so they stayed.  A good decision, but I didn&#39;t expect it, and I <br/>\nfeel crowded.<br/>\n<br/>\nNot a big deal.  Kids are safe.<br/>\n<br/>\nLast night Kirby had four other teens when he got home.  We had made a <br/>\nchicken casserole and saved Kirby one serving.  Ooops.   I had no easy plan of <br/>\naction, but I had $20.  I quietly on the side told Kirby I&#39;d give him that $20 to <br/>\ntake them out for a cheap burger or pizza if he wanted, and he looked hurt!  He <br/>\nsaid &quot;Do you not want us eating those pizzas and stuff?&quot; (meaning the kid <br/>\nfreezer-food Keith keeps stocked)<br/>\n<br/>\nWhen I was a kid I NEVER turned down money from my parents. <br/>\nI NEVER turned down an offer to get out of there, or to eat elsewhere.<br/>\n<br/>\nSo I have $20 still, and Kirby&#39;s friends ate freezer-food (lean cuisine <br/>\nchicken stuff or teriyaki chicken bowls or mini pizzas).  But they didn&#39;t GO HOME!  <br/>\nLOL!<br/>\n<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":85453,"nextTopicId":85465}}