{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"peers/stages (was Re: book recommendations/reviews)","postDate":"1123270383","msgId":107695,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg1LjJkMDdhYmM1LjMwMjUxOGVmQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":107694,"nextInTime":107696,"topicId":107695,"numMessagesInTopic":0,"msgSnippet":"... Sure. And if Piaget s stages are useful at all, it s to show that there s a spectrum of developmental needs people pass through, and that none of the","messageBody":"<div id=\"ygrps-yiv-1532415430\">In a message dated 8/5/05 12:56:08 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:nellebelle@...\">nellebelle@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I think there is a spectrum.  Totally peer oriented on one end, totally <br/>\n&gt; self oriented on the other, with most people NOT on the absolute ends.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Sure.   <br/>\nAnd if Piaget&#39;s stages are useful at all, it&#39;s to show that there&#39;s a <br/>\nspectrum of developmental needs people pass through, and that none of the states will <br/>\nlast a lifetime.<br/>\n<br/>\nMarty is currently big into peers.   Kirby is coming out of that phase.   He <br/>\nstill has a lot of friends, but he&#39;s quite unlikely to change the way he <br/>\ndresses or sits to please them.    <br/>\n<br/>\nThe difference between them and kids who went to school or who weren&#39;t <br/>\nparented in so &quot;attachment&quot; a way (nursing, family bed, no pressure to leave) is <br/>\nthat they haven&#39;t had their family replaced with a pseudo family based on age and <br/>\ngeography, or private-school-of-choice.<br/>\n<br/>\nHumans have the normal primate need to belong to a group.   Families can <br/>\nsatisfy that need, or families can totally trigger the search for a group <br/>\nelsewhere in the same way enemy interaction or danger could.   If our children don&#39;t <br/>\nfeel safe with us, they will find someone who makes them feel safe.<br/>\n<br/>\nWhen schools break the bonds between children and parents, it&#39;s replaced by <br/>\ngroups of same-age kids, and maybe with a few teachers the kid likes.<br/>\n<br/>\nI didn&#39;t look long enough to find a summary that wasn&#39;t school-related <br/>\n(sorry), but if you want to look more put in &quot;piaget stages of development&quot; and <br/>\nyou&#39;ll get lots of summaries and sites.    The peer attachment here is only <br/>\nindicated by the lessening and re-appearance of &quot;egocentric thought&quot; <br/>\n(self-centeredness).<br/>\n<br/>\n<br/>\n<br/>\nStages of Cognitive Development. <br/>\nPiaget identified four stages in cognitive development:<br/>\n<br/>\n     1.      Sensorimotor stage (Infancy). In this period (which has 6 <br/>\nstages), intelligence is demonstrated through motor activity without the use of <br/>\nsymbols. Knowledge of the world is limited (but developing) because its based on <br/>\nphysical interactions / experiences. Children acquire object permanence at <br/>\nabout 7 months of age (memory). Physical development (mobility) allows the child <br/>\nto begin developing new intellectual abilities. Some symbollic (language) <br/>\nabilities are developed at the end of this stage.<br/>\n<br/>\n     2.      Pre-operational stage (Toddler and Early Childhood). In this <br/>\nperiod (which has two substages), intelligence is demonstrated through the use of <br/>\nsymbols, language use matures, and memory and imagination are developed, but <br/>\nthinking is done in a nonlogical, nonreversable manner. Egocentric thinking <br/>\npredominates<br/>\n<br/>\n     3.      Concrete operational stage (Elementary and early adolescence). <br/>\nIn this stage (characterized by 7 types of conservation: number, length, <br/>\nliquid, mass, weight, area, volume), intelligence is demonstarted through logical <br/>\nand systematic manipulation of symbols related to concrete objects. Operational <br/>\nthinking develops (mental actions that are reversible). Egocentric thought <br/>\ndiminishes.<br/>\n<br/>\n     4.      Formal operational stage (Adolescence and adulthood). In this <br/>\nstage, intelligence is demonstrated through the logical use of symbols related <br/>\nto abstract concepts. Early in the period there is a return to egocentric <br/>\nthought. Only 35% of high school graduates in industrialized countries obtain <br/>\nformal operations; many people do not think formally during adulthood.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":107588,"nextTopicId":107697}}