{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":9,"messages":[{"userId":114448576,"authorName":"Deborah Eiseman","from":"&quot;Deborah Eiseman&quot; &lt;deborah.eiseman@...&gt;","profile":"budebana","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] So I am a bad mom","postDate":"1025048122","msgId":38636,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMjEwMWMyMWNhMCRmOWQ4OTEyMCRmZDNiMmYwNEBCRVRTWT4=","referencesHeader":"PEI5M0U2MzUyLjlGRDclZmV0dGVyb2xsQGVhcnRobGluay5uZXQ+"},"prevInTopic":38634,"nextInTopic":0,"prevInTime":38635,"nextInTime":38637,"topicId":38595,"numMessagesInTopic":0,"msgSnippet":"Wow, Joyce!  I loved your post that began: These parenting discussions arise not because someone is being judged and found guilty of bad parenting and should","messageBody":"<div id=\"ygrps-yiv-1445029986\">Wow, Joyce!  I loved your post that began:<br/>\n<br/>\n  These parenting discussions arise not because someone is being judged and<br/>\n  found guilty of bad parenting and should do it the way someone else says but<br/>\n  because of the insistence that certain methods must be employed in order for<br/>\n  certain results to happen. In this case it&#39;s the insistence that coercion is<br/>\n  necessary for children to learn responsibility.<br/>\n<br/>\n  I was getting ready to try to sort the whole thing through myself - but I am so glad you beat me to it!  You did a much clearer job than I would have.  This is an issue that we have been dealing with for awhile.  My 7.5 year old is very strong willed and we have worked at respecting her autonomy - but it is a struggle sometimes to figure out how to get all of our needs met.  Anyway,   aside from books - I have had no one to learn from.  (thank goodness for books!)  I have always known there had to be better ways.  So, we are mindfully working at this.  Some days I do much better than others.  Today, fortunately seems to be one of those better days.  Anyway, thanks for your clear thinking and sharing.  I am pretty new to this list - but I have already benefitted from your previous posts.  I can tell that this list will be a valuable place for me to be.  <br/>\n<br/>\n  I also wanted to mention that for me the link to cnvc that someone (sorry... I don&#39;t remember which post) included earlier didn&#39;t work. In case others had that problem,  the general website is www.cnvc.org   but I don&#39;t know where in the site that quote is listed.   The quote was: &quot;Question number one:What do you want the child to do differently?  If we ask only that question it can certainly seem that punishment sometimes works, because certainly through the threat of punishment or application of punishment, we can at times influence a child to do what we would like the child to do.  However when we add a second question , it has been my experience that parents see that punishment (I, Deborah, think you can read this as any type of coercion) never works.  The second question is: What do we want the child&#39;s reasons to be for acting as we would like them to act? It&#39;s that question that helps us to see that punishment not only doesn&#39;t work, but it gets in the way of our children doing things for reasons that we would like to do them.&quot;<br/>\n<br/>\n  This quote is from my favorite (because for me it is an essential touchstone) parenting book. Actually it is only a 24 page booklet, by Marshall Rosenberg titled &quot;Raising Children Compassionately: Parenting the Nonviolent Communication Way&quot;.<br/>\n  Marshall&#39;s ideas are really helpful both for parenting and for all relationships.  I am pretty new to his stuff and it&#39;s going to be an uphill climb for me - but one that I KNOW will be well worth it.  If the quote interests you check out the website. <br/>\n<br/>\n  Here&#39;s one more quote from that booklet that relates to this topic:<br/>\n  &quot;When people hear demands, it looks to them as though our caring and respect and love are conditional.  It looks as though we are only going to care for them as people when they do what we want.&quot;  And, by the way, for those of you new to these ideas, I feel compelled to say that Marshall isn&#39;t recommending &quot;permissive&quot; parenting.  It&#39;s a whole different perspective.   <br/>\n<br/>\n  Anyway,hope the web link and author source is of help to someone ... and Joyce , thanks again!<br/>\n  Deborah  <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] So I am a bad mom","postDate":"1025043218","msgId":38634,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI5M0U2MzUyLjlGRDclZmV0dGVyb2xsQGVhcnRobGluay5uZXQ+","inReplyToHeader":"PGFmN2szbysyamlhQGVHcm91cHMuY29tPg=="},"prevInTopic":38608,"nextInTopic":38636,"prevInTime":38633,"nextInTime":38635,"topicId":38595,"numMessagesInTopic":0,"msgSnippet":"... These parenting discussions arise not because someone is being judged and found guilty of bad parenting and should do it the way someone else says but ","messageBody":"<div id=\"ygrps-yiv-222976231\">on 6/24/02 1:15 PM, diamond_h2o at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:diamond_h2o@...\">diamond_h2o@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Okay  everyone here has established that i am a horrible parent<br/>\n&gt; because I require that my children must put their dirty clothes<br/>\n&gt; (usually a swimsuit)  in the laundry room instead of throwing it on<br/>\n&gt; the ceiling fan<br/>\n<br/>\n </span></blockquote>These parenting discussions arise not because someone is being judged and<br/>\nfound guilty of bad parenting and should do it the way someone else says but<br/>\nbecause of the insistence that certain methods must be employed in order for<br/>\ncertain results to happen. In this case it&#39;s the insistence that coercion is<br/>\nnecessary for children to learn responsibility.<br/>\n<br/>\nIt is that assumption that gets challenged. There are people here raising<br/>\ntheir children without coercion, without insisting on chores whose children<br/>\nare growing into responsible, thoughtful people. Parenting with coercion is<br/>\na choice not a necessity.<br/>\n<br/>\nCoercion undoubtedly is necessary to get kids to conform to a standard that<br/>\narises from a parent&#39;s desires rather than natural consequences. For example<br/>\nfrom a child&#39;s point of view there are no natural bad consequences to not<br/>\nvacuuming the carpet every week (or month or ...) From a child&#39;s point of<br/>\nview there seem to be way more pros to leaving toys out than to putting them<br/>\naway.<br/>\n<br/>\nBut if a parent insists that everyone in the family must meet a certain<br/>\nstandard and the rest of the family members have different sets of standards<br/>\nthen coercion is going to be necessary for one person&#39;s standards to<br/>\noverride everyone else&#39;s. (A side lesson to this is that a really good<br/>\ntechnique to get your way -- it must be good since parents use it a lot! --<br/>\nis to be bigger and stronger and more intimidating.)<br/>\n<br/>\nBut the coercion is for the purposes of getting the parent&#39;s standard met,<br/>\n*not* because children need it to turn into decent adults.<br/>\n<br/>\n(That does *not* leave the only choice as letting the kids&#39; standards<br/>\noverrule. There *are* other choices.)<br/>\n<br/>\nCoercion is *not* the only way to get kids to help. They will do so when<br/>\nthey feel that their help is appreciated. Coercion probably is the only way<br/>\nto get them to help in a certain way with a particular amount on a specific<br/>\ntime schedule though.<br/>\n<br/>\nIf we look at family and home as our gift to our children on one hand and as<br/>\nan equal partnership (without imposing responsibilty since the children<br/>\ndidn&#39;t choose to enter the partnership) on the other hand, then they *will*<br/>\nhelp when they feel they are necessary and when they feel their help is<br/>\nappreciated and is making a contribution. (Age is also a big factor. My 10<br/>\nyo daughter voluntarily brings in bags from the car and unloads them all<br/>\nonto the table whereas last year it often seemed like I was asking her to<br/>\nclimb Mt. Everest if I suggested it. ;-) The only difference is age.)<br/>\n<br/>\nIf we treat them as conscripted labor who must help because they live here<br/>\ntoo and mom works provide the life they have, they&#39;ll respond as any adult<br/>\nwould to that attitude.<br/>\n<br/>\nThere&#39;s a huge psychic difference between &quot;Would you pick these up?&quot; when<br/>\nthe child knows that &quot;No&quot; isn&#39;t an acceptable answer and &quot;Would you help<br/>\nme?&quot; when the child knows that &quot;No&quot; is an acceptable answer. It&#39;s a lot more<br/>\npleasant to help someone out who needs your help than it is to do something<br/>\nthat you have no choice in. I&#39;ve found a few minutes of volunteered, joyful<br/>\nhelp that I express appreciation over leads to more minutes and more<br/>\nvolunteering. Though coercing help may get me longer more frequent help,<br/>\nit&#39;s only result is getting the job done, not leading to someone more eager<br/>\nto help or with whom I have a better relationship.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The next <br/>\n&gt; stop sign he slowed down  looked at me and grinned and said &quot;I guess<br/>\n&gt; you will have to take my bike&quot;  and rode thru the intersection<br/>\n&gt; without even looking to see if a car was coming.<br/>\n<br/>\n </span></blockquote>This is sounding way more like a power struggle than a lack of understanding<br/>\nof safety. He sees this as a contest of wills between your ability to<br/>\ncontrol him and his ability to not be controlled rather than a sensible<br/>\nchoice between safe and unsafe. In his mind he wins if he gets to defy your<br/>\nrules -- regardless of the consequences.<br/>\n<br/>\n*Especially* in terms of safety, I&#39;d stop playing. I see the goal as helping<br/>\nhim understand rather than obedience. (Even if it&#39;s obedience to a being<br/>\nsensible.) (I think I saw a number of suggestions by others that didn&#39;t<br/>\ninvolve power struggles.)<br/>\n<br/>\nLots of people have had good things to say about Raising Your Spirited Child<br/>\nby Mary Sheedy Kurcinka (which might be helpful). But she&#39;s also written a<br/>\nbook called Kids, Parents and Power Struggles that might be even closer to<br/>\nbeing on target.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":27496206,"authorName":"diamond_h2o","from":"&quot;diamond_h2o&quot; &lt;diamond_h2o@...&gt;","profile":"diamond_h2o","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: So I am a bad mom","postDate":"1024962685","msgId":38608,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGFmOGI5dCttYWhwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE5ZS40MzZjMWY1LjJhNDhiMmE2QGFvbC5jb20+"},"prevInTopic":38605,"nextInTopic":38634,"prevInTime":38607,"nextInTime":38609,"topicId":38595,"numMessagesInTopic":0,"msgSnippet":"My kids saw a little girl get hit by a car on a country road  near their grandparents.  They were very impressed about all the pieces for about 2 weeks (I","messageBody":"<div id=\"ygrps-yiv-303701284\">My kids saw a little girl get hit by a car on a country road  near <br/>\ntheir grandparents.  They were very impressed about all the pieces <br/>\nfor about 2 weeks (I still have nightmares about it  but they never <br/>\ndid) and then my kids decided it would never happen to them  <br/>\nbecause....  they give me 1000&#39;s of reasons why they wont die.  Our <br/>\npediatrician says that it is normal for kids to think they are <br/>\ninvincible.  My kids have seen so many dead people I would think they <br/>\nwould understand  but they don&#39;t...whereas  dead people freak me out.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In Unschooling-dotcom@y..., Unschoolingmommy@a... wrote:<br/>\n&gt; I don&#39;t think you are a bad mom.  I cannot believe he looked at you <br/>\nand went <br/>\n&gt; through the intersecion like that.  I would probably go so far to <br/>\nfind an <br/>\n&gt; article, maybe on the internet, of a child hit by a car who did <br/>\npass away.  <br/>\n&gt; Let him read the article and look at the picture of the little boy <br/>\nor girl.  <br/>\n&gt; I did this with my 12 year old because he does not treat his 4 year <br/>\nold <br/>\n&gt; brother the best all of the time.  I found a website for a little <br/>\nboy a bit <br/>\n&gt; younger then 4 who was run over by the parents car and how much <br/>\nthey missed <br/>\n&gt; him.  Each day should be lived like the last because you never <br/>\nknow.  I think <br/>\n&gt; teaching this to our kids is a good lesson.<br/>\n&gt; <br/>\n&gt; Mary </span></blockquote></div>","specialLinks":[]},{"userId":2294225,"authorName":"freeform@juno.com","from":"freeform@...","profile":"freeform_ca","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] So I am a bad mom","postDate":"1024956383","msgId":38605,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIwNjI0LjE1MjQ0OC4tMzM3MTEzLjQuZnJlZWZvcm1AanVuby5jb20+"},"prevInTopic":38603,"nextInTopic":38608,"prevInTime":38604,"nextInTime":38606,"topicId":38595,"numMessagesInTopic":0,"msgSnippet":"On Mon, 24 Jun 2002 17:15:36 -0000 diamond_h2o  ... No one said you were a horrible parent. ... Baloney. You re not letting your kids","messageBody":"<div id=\"ygrps-yiv-1718608423\">On Mon, 24 Jun 2002 17:15:36 -0000 &quot;diamond_h2o&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:diamond_h2o@...\">diamond_h2o@...</a>&gt;<br/>\nwrites:<br/>\n<blockquote><span title=\"ireply\"> &gt; Okay  everyone here has established that i am a horrible parent <br/>\n<br/>\n </span></blockquote>No one said you were a horrible parent.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;If my son really wants to watch Dexter&#39;s lab on television <br/>\n&gt; he will put his clothes in the laundry room   if he thinks clothes  on <br/>\n&gt; the ceiling fan is better then he wont put his clothes in the  laundry <br/>\n&gt; room   it is up to him.     Is that a better way of saying it.  I <br/>\n&gt; guess I don&#39;t teach my kids  I let them decide what is important  <br/>\n&gt; with hope they will see it the same way I do,  but not necessarily <br/>\n&gt; expecting that they will. <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Baloney. You&#39;re not letting your kids decide what is important, you&#39;re<br/>\nsetting up artificial situations where they&#39;re punished (e.g., not<br/>\nallowed to watch a tv show) for not doing  what you tell them to do.<br/>\n<br/>\nSomeone sent me the URL for a great website yesterday, it ties right into<br/>\nthis discussion. The URL is <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.cnvc.org/raisekds.htm,\">http://www.cnvc.org/raisekds.htm,</a> and here&#39;s<br/>\na quote that seems to address part of what&#39;s being discussed:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;. So with such a high percentage of the population believing that<br/>\n </span></blockquote>punishment is justified and necessary in the education of children, Ive<br/>\nhad plenty of opportunity over the years to discuss this issue with<br/>\nparents, and Im pleased with how people can be helped to see the<br/>\nlimitations of any kind of punishment, if theyll simply ask themselves<br/>\ntwo questions.<br/>\n<br/>\nQuestion number one: What do you want the child to do differently? If we<br/>\nask only that question, it can certainly seem that punishment sometimes<br/>\nworks, because certainly through the threat of punishment or application<br/>\nof punishment, we can at times influence a child to do what we would like<br/>\nthe child to do.<br/>\n<br/>\nHowever, when we add a second question, it has been my experience that<br/>\nparents see that punishment never works. The second question is: What do<br/>\nwe want the childs reasons to be for acting as we would like them to<br/>\nact? Its that question that helps us to see that punishment not only<br/>\ndoesnt work, but it gets in the way of our children doing things for<br/>\nreasons that we would like them to do them.&lt;&lt;&lt;<br/>\n<br/>\nDar<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] So I am a bad mom","postDate":"1024945866","msgId":38603,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNhLmQ3ZGIxMjguMmE0OGM4Y2FAYW9sLmNvbT4="},"prevInTopic":38599,"nextInTopic":38605,"prevInTime":38602,"nextInTime":38604,"topicId":38595,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-875908809\">&lt;&lt; The only thing that can make you a horrible parent is to<br/>\nsubstitute the judgment of cyber-folk who know neither you nor<br/>\nyour kids for your own informed decisions about how to raise your<br/>\nown children.  And that substitution is indeed the road to<br/>\nfailure as a kid - isn&#39;t that why they aren&#39;t in some<br/>\n&quot;educational institution&quot; in the first place? &gt;&gt;<br/>\n<br/>\nOne bad things school do is they try again and again and again to do things <br/>\nin a way that isn&#39;t working.  Then they get angry at the kids when it doesn&#39;t <br/>\nwork, and angry at the parents if their punishments don&#39;t cause school&#39;s <br/>\nmethods not to work better.<br/>\n<br/>\nInformed decisions don&#39;t come from just doing what our parents did without <br/>\nexamination.  Informed decisions don&#39;t come from batting away the experiences <br/>\nof parents whose kids ARE stopping at stop signs, who are bringing their <br/>\nclothes to be washed or are washing them themselves without threats.<br/>\n<br/>\nI don&#39;t think anyone here is against informed decisions at ALL!<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":10722572,"authorName":"Nora or Devereaux Cannon","from":"&quot;Nora or Devereaux Cannon&quot; &lt;dcannon@...&gt;","profile":"thatincase","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] So I am a bad mom","postDate":"1024942691","msgId":38599,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAyYjAwMWMyMWJhYiQ4MTI0NjljMCQ2NDIyZmVhOUBkYnE1MjBiPg==","referencesHeader":"PGFmN2szbysyamlhQGVHcm91cHMuY29tPg=="},"prevInTopic":38598,"nextInTopic":38603,"prevInTime":38598,"nextInTime":38600,"topicId":38595,"numMessagesInTopic":0,"msgSnippet":"The only thing that can make you a horrible parent is to substitute the judgment of cyber-folk who know neither you nor your kids for your own informed","messageBody":"<div id=\"ygrps-yiv-330407609\">The only thing that can make you a horrible parent is to<br/>\nsubstitute the judgment of cyber-folk who know neither you nor<br/>\nyour kids for your own informed decisions about how to raise your<br/>\nown children.  And that substitution is indeed the road to<br/>\nfailure as a kid - isn&#39;t that why they aren&#39;t in some<br/>\n&quot;educational institution&quot; in the first place?<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message -----<br/>\nFrom: &quot;diamond_h2o&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:diamond_h2o@...\">diamond_h2o@...</a>&gt;<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a>&gt;<br/>\nSent: Monday, June 24, 2002 12:15 PM<br/>\nSubject: [Unschooling-dotcom] So I am a bad mom<br/>\n<br/>\n<br/>\n| Okay  everyone here has established that i am a horrible parent </span></blockquote></div>","specialLinks":[]},{"userId":76763907,"authorName":"Unschoolingmommy@aol.com","from":"Unschoolingmommy@...","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] So I am a bad mom","postDate":"1024940198","msgId":38597,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5ZS40MzZjMWY1LjJhNDhiMmE2QGFvbC5jb20+"},"prevInTopic":38595,"nextInTopic":38598,"prevInTime":38596,"nextInTime":38598,"topicId":38595,"numMessagesInTopic":0,"msgSnippet":"I don t think you are a bad mom.  I cannot believe he looked at you and went through the intersecion like that.  I would probably go so far to find an article,","messageBody":"<div id=\"ygrps-yiv-436986279\">I don&#39;t think you are a bad mom.  I cannot believe he looked at you and went <br/>\nthrough the intersecion like that.  I would probably go so far to find an <br/>\narticle, maybe on the internet, of a child hit by a car who did pass away.  <br/>\nLet him read the article and look at the picture of the little boy or girl.  <br/>\nI did this with my 12 year old because he does not treat his 4 year old <br/>\nbrother the best all of the time.  I found a website for a little boy a bit <br/>\nyounger then 4 who was run over by the parents car and how much they missed <br/>\nhim.  Each day should be lived like the last because you never know.  I think <br/>\nteaching this to our kids is a good lesson.<br/>\n<br/>\nMary</div>","specialLinks":[]},{"userId":27496206,"authorName":"diamond_h2o","from":"&quot;diamond_h2o&quot; &lt;diamond_h2o@...&gt;","profile":"diamond_h2o","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"So I am a bad mom","postDate":"1024938936","msgId":38595,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGFmN2szbysyamlhQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":38597,"prevInTime":38594,"nextInTime":38596,"topicId":38595,"numMessagesInTopic":0,"msgSnippet":"Okay  everyone here has established that i am a horrible parent because I require that my children must put their dirty clothes (usually a swimsuit)  in the","messageBody":"<div id=\"ygrps-yiv-1850467216\">Okay  everyone here has established that i am a horrible parent <br/>\nbecause I require that my children must put their dirty clothes <br/>\n(usually a swimsuit)  in the laundry room instead of throwing it on <br/>\nthe ceiling fan,  and that they should pick their toys up off the <br/>\nfloor  so I wont catch them in the vacuum.   I work 10 hours a day <br/>\nsometimes as much as 5 days a week sometimes.  I clean houses for <br/>\npeople who never have to take responsibility for anything and I see <br/>\nhow those people are.  My kids have a privilege of watching <br/>\ntelevision (we have to have cable or satelite to watch television <br/>\nhere and we couldn&#39;t afford it until april so television is new to my <br/>\nkids).   Due to unforeseen medical bills of my youngest son we <br/>\nprobably wont have television much longer.    My youngest child was <br/>\nborn with hypospadias,  severe reflux, severe allergies  and has <br/>\nnearly died several times  because of his illnesses.   I am thankful <br/>\nfor my children, and I never hit them but I do make them think about <br/>\nwhether they want the responsibility of things they have.  Last night <br/>\nI went riding on bicycles with my kids.  My 7 year old went across a <br/>\nstreet without stopping at a stop sign and my just turned 4 yesterday <br/>\nson  tried to follow  but i made him stop.   I told my 7 year old <br/>\nthat the streets where we were riding have cars come thru them at 45 <br/>\nmiles an hour and if a car had been coming it couldn&#39;t have stopped <br/>\nand probably would have killed him.   I told him to stop and wait for <br/>\nme at the next stop sign.  He went thru the next stop sign without <br/>\nstopping.   I stopped him and told him that if he did it again he <br/>\ncould either give me $50 (which i would put in his savings account,   <br/>\nthat is the amount our police fine bicycles for not stopping at stop <br/>\nsigns)  or I would take his bike.   He then told me he didn&#39;t know he <br/>\nwas supposed to stop before the stop sign   he thought he was <br/>\nsupposed to stop on the other side of the stop sign (this kid has <br/>\nbeen going on bike rides for 4 years and never had a problem until <br/>\nlast night)  I said fine but the rules still applied   the next <br/>\nmissed stop sign (if he didn&#39;t stop infront of it) if he wasn&#39;t <br/>\nkilled by a car I would take the money or the bike.   We were one <br/>\nblock from home and not in a busy part of town anymore.   The next <br/>\nstop sign he slowed down  looked at me and grinned and said &quot;I guess <br/>\nyou will have to take my bike&quot;  and rode thru the intersection <br/>\nwithout even looking to see if a car was coming.    Now his bike is <br/>\nhanging on the wall in the garage.  When he shows he respects safety <br/>\nrules enough to ride again  he can have his bike    until then  he <br/>\nhas to walk while his friends taunt him because they saw him <br/>\ndisobeying me.  He has been to doctors and therapists and <br/>\neverything.  Most agreed that he is just a normal kid who is testing <br/>\nthe limits.   <br/>\nSo I am a bad parent---but I would take my son clean socks  if he <br/>\never wore socks.   I believe children sometimes need guidance whether <br/>\nthey actually learn from it is up to them,  but if my son really <br/>\nwants his bike or whatever  he will need to learn to accept the rules <br/>\nfirst.   If my son really wants to watch Dexter&#39;s lab on television <br/>\nhe will put his clothes in the laundry room   if he thinks clothes on <br/>\nthe ceiling fan is better then he wont put his clothes in the laundry <br/>\nroom   it is up to him.     Is that a better way of saying it.  I <br/>\nguess I don&#39;t teach my kids  I let them decide what is important  <br/>\nwith hope they will see it the same way I do,  but not necessarily <br/>\nexpecting that they will.</div>","specialLinks":[]},{"userId":90048433,"authorName":"Tamra Orr","from":"&quot;Tamra Orr&quot; &lt;writinggoddess2@...&gt;","profile":"jwoman_us","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] So I am a bad mom","postDate":"1024937074","msgId":38598,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNEMTc0QzcyLjAwMDAzMS4yNDgwM0Bob21lLmF0dGJpLmNvbT4=","referencesHeader":"PGFmN2szbysyamlhQGVHcm91cHMuY29tPg=="},"prevInTopic":38597,"nextInTopic":38599,"prevInTime":38597,"nextInTime":38599,"topicId":38595,"numMessagesInTopic":0,"msgSnippet":"Hmmm. . I am new to the list so your reputation as a horrible parent is\nnew to me. However, based on this email, I would say you are a caring,\nloving parent","messageBody":"<div id=\"ygrps-yiv-126810127\">Hmmm. . I am new to the list so your &quot;reputation&quot; as a horrible parent is<br/>\nnew to me. However, based on this email, I would say you are a caring,<br/>\nloving parent who wants her children to learn some basic safety rules and<br/>\nresponsibilities. I have 4 kids and if they had done that on their bikes,<br/>\ntheir bikes would also be put away in the attic. As far as laundry goes, we<br/>\naim for them to get it in the right place. It&#39;s not a live or death<br/>\nsituation if they don&#39;t, but it is a goal. So does this make me a horrible<br/>\nparent too? :)\r<br/>\n\r<br/>\nTami\r<br/>\n\r<br/>\n-------Original Message-------\r<br/>\n\r<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a>\r<br/>\nDate: Monday, June 24, 2002 11:15:41 AM\r<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a>\r<br/>\nSubject: [Unschooling-dotcom] So I am a bad mom\r<br/>\n\r<br/>\nOkay  everyone here has established that i am a horrible parent \r<br/>\nbecause I require that my children must put their dirty clothes \r<br/>\n(usually a swimsuit)  in the laundry room instead of throwing it on \r<br/>\nthe ceiling fan,  and that they should pick their toys up off the \r<br/>\nfloor  so I wont catch them in the vacuum.   I work 10 hours a day \r<br/>\nsometimes as much as 5 days a week sometimes.  I clean houses for \r<br/>\npeople who never have to take responsibility for anything and I see \r<br/>\nhow those people are.  My kids have a privilege of watching \r<br/>\ntelevision (we have to have cable or satelite to watch television \r<br/>\nhere and we couldn&#39;t afford it until april so television is new to my \r<br/>\nkids).   Due to unforeseen medical bills of my youngest son we \r<br/>\nprobably wont have television much longer.    My youngest child was \r<br/>\nborn with hypospadias,  severe reflux, severe allergies  and has \r<br/>\nnearly died several times  because of his illnesses.   I am thankful \r<br/>\nfor my children, and I never hit them but I do make them think about \r<br/>\nwhether they want the responsibility of things they have.  Last night \r<br/>\nI went riding on bicycles with my kids.  My 7 year old went across a \r<br/>\nstreet without stopping at a stop sign and my just turned 4 yesterday \r<br/>\nson  tried to follow  but i made him stop.   I told my 7 year old \r<br/>\nthat the streets where we were riding have cars come thru them at 45 \r<br/>\nmiles an hour and if a car had been coming it couldn&#39;t have stopped \r<br/>\nand probably would have killed him.   I told him to stop and wait for \r<br/>\nme at the next stop sign.  He went thru the next stop sign without \r<br/>\nstopping.   I stopped him and told him that if he did it again he \r<br/>\ncould either give me $50 (which i would put in his savings account,   \r<br/>\nthat is the amount our police fine bicycles for not stopping at stop \r<br/>\nsigns)  or I would take his bike.   He then told me he didn&#39;t know he \r<br/>\nwas supposed to stop before the stop sign   he thought he was \r<br/>\nsupposed to stop on the other side of the stop sign (this kid has \r<br/>\nbeen going on bike rides for 4 years and never had a problem until \r<br/>\nlast night)  I said fine but the rules still applied   the next \r<br/>\nmissed stop sign (if he didn&#39;t stop infront of it) if he wasn&#39;t \r<br/>\nkilled by a car I would take the money or the bike.   We were one \r<br/>\nblock from home and not in a busy part of town anymore.   The next \r<br/>\nstop sign he slowed down  looked at me and grinned and said &quot;I guess \r<br/>\nyou will have to take my bike&quot;  and rode thru the intersection \r<br/>\nwithout even looking to see if a car was coming.    Now his bike is \r<br/>\nhanging on the wall in the garage.  When he shows he respects safety \r<br/>\nrules enough to ride again  he can have his bike    until then  he \r<br/>\nhas to walk while his friends taunt him because they saw him \r<br/>\ndisobeying me.  He has been to doctors and therapists and \r<br/>\neverything.  Most agreed that he is just a normal kid who is testing \r<br/>\nthe limits.   \r<br/>\nSo I am a bad parent---but I would take my son clean socks  if he \r<br/>\never wore socks.   I believe children sometimes need guidance whether \r<br/>\nthey actually learn from it is up to them,  but if my son really \r<br/>\nwants his bike or whatever  he will need to learn to accept the rules \r<br/>\nfirst.   If my son really wants to watch Dexter&#39;s lab on television \r<br/>\nhe will put his clothes in the laundry room   if he thinks clothes on \r<br/>\nthe ceiling fan is better then he wont put his clothes in the laundry \r<br/>\nroom   it is up to him.     Is that a better way of saying it.  I \r<br/>\nguess I don&#39;t teach my kids  I let them decide what is important  \r<br/>\nwith hope they will see it the same way I do,  but not necessarily \r<br/>\nexpecting that they will. \r<br/>\n\r<br/>\n\r<br/>\n~~~ Don&#39;t forget! If you change the topic, change the subject line! ~~~\r<br/>\n\r<br/>\nTo unsubscribe from this group, send an email to:\r<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-unsubscribe@yahoogroups.com\">Unschooling-dotcom-unsubscribe@yahoogroups.com</a>\r<br/>\n\r<br/>\nVisit the Unschooling website:\r<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a>\r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\nYour use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":38579,"nextTopicId":38637}}