{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":2300774,"authorName":"Elizabeth Hill","from":"Elizabeth Hill &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: Unschooling well...and the authorities","postDate":"1110559109","msgId":104399,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyMzFDOTg1LjIwOTAyMDlAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PDBCODQ0NEU5LjJGNDQ4QTU2LjBCOTdBM0ZCQGFvbC5jb20+","referencesHeader":"PDBCODQ0NEU5LjJGNDQ4QTU2LjBCOTdBM0ZCQGFvbC5jb20+"},"prevInTopic":104398,"nextInTopic":0,"prevInTime":104398,"nextInTime":104400,"topicId":104398,"numMessagesInTopic":0,"msgSnippet":"**And it s been fun watching others, like Ren and Sheila make the transition from y all are a little bit nuts, but interesting to full-fledged unschooling","messageBody":"<div id=\"ygrps-yiv-501254500\">**And it&#39;s been fun watching others, like Ren and Sheila make the <br/>\ntransition from &quot;y&#39;all are a little bit nuts, but interesting&quot; to <br/>\nfull-fledged unschooling screamers! &lt;G&gt; (I still worry about Betsy, <br/>\nthough! &lt;bwg&gt;)**<br/>\n<br/>\n:-)<br/>\n<br/>\nI will encourage you to stop worrying about me -- but you don&#39;t have to stop making jokes at my expense -- keep &#39;em coming.  &lt;bwg&gt;<br/>\n<br/>\nI took my book-worshipping self to the library sale last night and scratched a little deeper to see if I could find more cool stuff.    This time I came up with Klutz&#39;s &quot;The Only Coloring-Puzzle-Game-Dot-to-Dot Activity Book You&#39;ll Ever Need&quot;,  &quot;Barf-o-rama: The Great Puke-off&quot;  (True, I swear.  Great for a kid who loves Fear Factor.)  The 25th Garfield book, &quot;The Simpsons Fun in the Sun Book&quot;, and &quot;How Do You Go To The Bathroom in Space&quot;.  This was on top of the regular haul of books with dragons and swords on the cover.  (Tamora Pierce, Lawrence Yep, Rosemary Sutcliff, etc.)<br/>\n<br/>\n(I even found a quilting book for kids, but I expect I&#39;ll give that to a friend who&#39;s child actually wants to quilt and likes learning from books.)<br/>\n<br/>\nI&#39;m paying more attention to the (itty bitty) conversations that we are having and trying to blow on the embers (metaphorically) more.  Just being aware is helping.  Noticing the occasions when he wants to talk and paying more attention to the usefulness of my responses is paying of with more interaction.<br/>\n<br/>\nIt is certainly true that the way to have James start talking to me is to sit next to him on the couch for a spell while he&#39;s watching TV.  (Good advice!)  After ten or twenty minutes he usually has something interesting to say.  He may be done after one sentence -- he may not elaborate on his ideas at the length that I (and my talkative friends) do, but he does have stuff to say.  We can still ride for an hour in the car having only sporadic occasional functional sentences uttered (mostly by me), but I have been asking him whether he wants music, or talking, or time to think.  When he asks for time to think (especially on return journeys after long days), I think I need to accept and respect that.  Perhaps it&#39;s a sign of some lack of ease in our relationship, or perhaps it&#39;s just his style.  (Perhaps his dad has been modelling &quot;men don&#39;t talk&quot; and &quot;men hate to shop&quot; a little too vehemently, and we need to revisit that.)<br/>\n<br/>\nToday we&#39;re travelling back to our old park group and going for a newt hike.  Gotta get packed.<br/>\n<br/>\nBetsy</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Unschooling well...and the authorities","postDate":"1110553715","msgId":104398,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBCODQ0NEU5LjJGNDQ4QTU2LjBCOTdBM0ZCQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":104399,"prevInTime":104397,"nextInTime":104399,"topicId":104398,"numMessagesInTopic":0,"msgSnippet":"-=-=-=-=-Kelly.. I am glad for your post.. it was an inspiration for me. -=-=-=- Well, good. Glad I could help. -=-=-=-=-I m just a bit beat down lately, and","messageBody":"<div id=\"ygrps-yiv-484556493\">-=-=-=-=-Kelly.. I am glad for your post.. it was an inspiration for me. -=-=-=-<br/>\n<br/>\nWell, good. Glad I could help.<br/>\n<br/>\n-=-=-=-=-I&#39;m just a bit beat down lately, and this last hurdle; having to deal with the juvenile dept. was scary. I have no excuse for not being more confident. -=-=-=-<br/>\n<br/>\nThey&#39;re bullies.<br/>\n<br/>\nAnd they sometimes have to be. There *are* some really crappy parents out there, and many children DO need their protection. They take that attitude with everybody because, if they didn&#39;t, they&#39;d be intimidated themselves and not get *anything* done. So I uderstand the attitude and the tenacity.<br/>\n<br/>\nBUT: You can be just as tenacious and just as cocky as they are IF you&#39;re confident in what&#39;s right.<br/>\n<br/>\nThis e-list and the unschooling.com forum have helped me tremendously over the years to find my voice and get that confidence. Saying it over and over to newbies has made it easier and easier to describe it and explain it to &quot;the authorities&quot; and nosy neighbors and strangers and in-laws and friends.   <br/>\n<br/>\nAnd it&#39;s been fun watching others, like Ren and Sheila make the transition from &quot;y&#39;all are a little bit nuts, but interesting&quot; to full-fledged unschooling screamers! &lt;G&gt; (I still worry about Betsy, though! &lt;bwg&gt;)<br/>\n<br/>\n<br/>\n-=-=-=-=-I will be at the conference in Oct, and hopefully when it&#39;s over, will feel &quot;armed to the teeth&quot; again too. Anyway I&#39;m saving what you wrote. -=-=-=-<br/>\n<br/>\nIt will really make a difference! I promise! I&#39;m looking forward to meeting you then!<br/>\n<br/>\n~Kelly</div>","specialLinks":[]}],"prevTopicId":12965,"nextTopicId":104401}}