{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Lynda","from":"&quot;Lynda&quot; &lt;lurine@...&gt;","replyTo":"LIST","senderId":"HmmJFUfpRRHPQBsSlflKC6ql_JIm15SUx-R2fRlBC0lz_hzJi8VKgVURJUFmFDOFSlYTah_ZWAuJhmyihU1Z4TozUw","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Fw: Leading Doctor&#39;s Group Votes To Oppose Mandatory Vaccinations","postDate":"973441563","msgId":13997,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwZGEwMWMwNDc0ZCQ2ZDI2ZmYyMCQ1YjVkZDFkMUBsZGlvbm5vPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":13996,"nextInTime":13998,"topicId":13997,"numMessagesInTopic":0,"msgSnippet":"Interesting. Lynda","messageBody":"<div id=\"ygrps-yiv-312590571\">Interesting.<br/>\n<br/>\nLynda<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- &gt; <br/>\n<br/>\n&gt; Date: Sat, 4 Nov 2000 20:26:53 +1100<br/>\n <br/>\n&gt;   Leading Doctors&#39; Group <br/>\n&gt;   Votes To Oppose <br/>\n&gt;   Mandatory Vaccinations<br/>\n&gt;   Dr. James Hirsen &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:hirsen@...\">hirsen@...</a>&gt;<br/>\n&gt;   <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.newsmax.com/commentarchive.shtml?a=2000/11/3/083415\">http://www.newsmax.com/commentarchive.shtml?a=2000/11/3/083415</a><br/>\n&gt;   11-3-00<br/>\n <br/>\n&gt;           A leading national physician organization is calling for a<br/>\n&gt; moratorium on all government mandated vaccines and has passed a<br/>\n&gt; resolution to that end at their annual meeting. <br/>\n&gt;            <br/>\n&gt;           Members of the Association of American Physicians and<br/>\n&gt; Surgeons (AAPS) voted this week at their 57th Annual Meeting in St.<br/>\n&gt; Louis to pass a resolution calling for an end to mandatory childhood<br/>\n&gt; vaccines. The resolution passed without a single &quot;no&quot; vote.<br/>\n&gt; (Resolution and mandatory vaccine fact sheet posted at<br/>\n&gt; www.aapsonline.org) <br/>\n&gt;            <br/>\n&gt;           &quot;Our children face the possibility of death or serious<br/>\n&gt; long-term adverse effects from mandated vaccines that aren&#39;t<br/>\n&gt; necessary or that have very limited benefits,&quot; said Jane M. Orient,<br/>\n&gt; MD, AAPS Executive Director. <br/>\n&gt;            <br/>\n&gt;           &quot;This is not a vote against vaccines,&quot; said Dr. Orient.<br/>\n&gt; &quot;This resolution only attempts to halt blanket vaccine mandates by<br/>\n&gt; government agencies and school districts that give no consideration<br/>\n&gt; for the rights of the parents or the individual medical condition of<br/>\n&gt; the child.&quot; <br/>\n&gt;            <br/>\n&gt;           Forty-two states have mandatory vaccine policies, and many<br/>\n&gt; children are required to have 22 shots before first grade. On top of<br/>\n&gt; that, as a condition for school attendance, many school districts<br/>\n&gt; require vaccination for diseases such as hepatitis B -- primarily an<br/>\n&gt; adult disease, usually spread by multiple sex partners, drug abuse or<br/>\n&gt; an occupation with exposure to blood. <br/>\n&gt;            <br/>\n&gt;           And yet, children under the age of 14 are three times more<br/>\n&gt; likely to suffer adverse effects -- including death -- following the<br/>\n&gt; hepatitis b vaccine than to catch the disease itself. <br/>\n&gt;            <br/>\n&gt;           Just last week, students in Utica, NY were sent home from<br/>\n&gt; school, and told they could not return until they had been forced to<br/>\n&gt; receive hep B vaccinations. Further, parents were threatened by Child<br/>\n&gt; Protective Services with possible seizure of their children based on<br/>\n&gt; &quot;education neglect.&quot; <br/>\n&gt;            <br/>\n&gt;           &quot;It&#39;s obscene to threaten to seize a child just because his<br/>\n&gt; parents refuse medical treatment that is obviously unnecessary and<br/>\n&gt; perhaps even dangerous,&quot; said Dr. Orient. &quot;AAPS believes that<br/>\n&gt; parents, with the advice of their doctors, should make decisions<br/>\n&gt; about their children&#39;s medical care -- not government bureaucrats.<br/>\n&gt; This Resolution affirms that position.&quot; <br/>\n&gt;            <br/>\n&gt;           (Note: AAPS is a professional association of physicians<br/>\n&gt; dedicated since 1943 to the sanctity of the patient-physician<br/>\n&gt; relationship.) _____ <br/>\n&gt;            <br/>\n&gt;           Association of American Physicians and Surgeons, Inc. 1601<br/>\n&gt; N. Tucson Blvd. Suite 9 Tucson, AZ 85716-3450 Phone: (800) 635-1196<br/>\n&gt; Hotline: (800) 419-4777 A Voice for Private Physicians Since 1943<br/>\n&gt; Omnia pro aegroto <br/>\n&gt;            <br/>\n&gt;            <br/>\n&gt;           AAPS RESOLUTION CONCERNING MANDATORY VACCINES <br/>\n&gt;            <br/>\n&gt;           &quot;Ethical Medicine&quot; AAPS Annual Meeting October 25 - 28,<br/>\n&gt; 2000 St. Louis, MO Submitted for Member approval: <br/>\n&gt;            <br/>\n&gt;           WHEREAS: The statement of Patients&#39; Freedoms adopted by the<br/>\n&gt; Assembly at the 47th annual meeting of AAPS in 1990 provides that<br/>\n&gt; &quot;Patients have the freedom to refuse medical treatment even if it is<br/>\n&gt; recommended by their physician and to be informed about their medical<br/>\n&gt; condition, the risks and benefits of treatment, and appropriate<br/>\n&gt; alternatives&quot;; and <br/>\n&gt;            <br/>\n&gt;           WHEREAS: There are increasing numbers of mandatory<br/>\n&gt; childhood vaccines, to which children are often subjected without<br/>\n&gt; meaningful informed consent, including information about potential<br/>\n&gt; adverse side effects; and <br/>\n&gt;            <br/>\n&gt;           WHEREAS: Parents who exercise their freedom to refuse one<br/>\n&gt; or more vaccines may be subjected to penalties ranging from<br/>\n&gt; deprivation of the right to enroll their child in school, to threats<br/>\n&gt; of removing the child from parental custody and forcible vaccination;<br/>\n&gt; and <br/>\n&gt;            <br/>\n&gt;           WHEREAS: Safety testing of many vaccines is limited and the<br/>\n&gt; data are unavailable for independent scrutiny, so that mass<br/>\n&gt; vaccination is equivalent to human experimentation and subject to the<br/>\n&gt; Nuremberg Code, which requires voluntary informed consent; and <br/>\n&gt;            <br/>\n&gt;           WHEREAS: The process of approving and &quot;recommending&quot;<br/>\n&gt; vaccines is tainted with conflicts of interest; <br/>\n&gt;            <br/>\n&gt;           BE IT THEREFORE RESOLVED: That AAPS calls for a moratorium<br/>\n&gt; on vaccine mandates and for physicians to insist upon truly informed<br/>\n&gt; consent for the use of vaccines. <br/>\n&gt;            <br/>\n&gt;           -------------- FACT SHEET ON MANDATORY VACCINES <br/>\n&gt;            <br/>\n&gt;           AAPS does not oppose vaccines. AAPS has never taken an<br/>\n&gt; anti-vaccine position, although opponents have tried to paint that<br/>\n&gt; picture. AAPS has only attempted to halt government or school<br/>\n&gt; districts from blanket vaccine mandates that violate parental<br/>\n&gt; informed consent. <br/>\n&gt;            <br/>\n&gt;           42 states have mandatory vaccine policies, and many<br/>\n&gt; children are required 22 shots by first grade. <br/>\n&gt;            <br/>\n&gt;           According to government statistics, children under the age<br/>\n&gt; of 14 are three times more likely to suffer adverse effects --<br/>\n&gt; including death -- following the hepatitis B vaccine than to catch<br/>\n&gt; the disease itself. <br/>\n&gt;            <br/>\n&gt;           The Centers for Disease Control admits that the reported<br/>\n&gt; number of adverse effects of vaccines is probably only 10% of actual<br/>\n&gt; adverse effects. <br/>\n&gt;            <br/>\n&gt;           The Physician&#39;s Desk Reference cites adverse reactions to<br/>\n&gt; the hepatitis B in less than 1 percent. However, if more than 70<br/>\n&gt; million American children receive the vaccine, that means more than<br/>\n&gt; 700,000 children are likely to suffer adverse reactions. <br/>\n&gt;            <br/>\n&gt;           Children are a very low risk group for hepatitis B. Primary<br/>\n&gt; risk factors are dependent on lifestyle, i.e. multiple sex partners,<br/>\n&gt; drug abuse or an occupation with exposure to blood. <br/>\n&gt;            <br/>\n&gt;           Rampant conflicts of interest in the approval process has<br/>\n&gt; been the subject of several Congressional hearings, and a recent<br/>\n&gt; Congressional report concluded that the pharmaceutical industry has<br/>\n&gt; indeed exerted undue influence on mandatory vaccine legislation<br/>\n&gt; toward its own financial interests. <br/>\n&gt;            <br/>\n&gt;           The vaccine approval process has also been contaminated by<br/>\n&gt; flawed or incomplete clinical trials, and government officials have<br/>\n&gt; chosen to ignore negative results. For example, the CDC was forced to<br/>\n&gt; withdraw its recommendation of the rotavirus vaccine within one year<br/>\n&gt; of approval. Yet public documents obtained by AAPS show that the CDC<br/>\n&gt; was aware of alarmingly high intussuception rates months before the<br/>\n&gt; vaccine was approved and recommended. <br/>\n&gt;            <br/>\n&gt;           Mandatory vaccines violate the medical ethic of informed<br/>\n&gt; consent. A case could also be made that mandates for vaccines by<br/>\n&gt; school districts and legislatures is the de facto practice of<br/>\n&gt; medicine without a license. <br/>\n&gt;            <br/>\n&gt;           The CDC&#39;s own &quot;Guide to Contraindications to Childhood<br/>\n&gt; Vaccination&quot; warns that when assessing children&#39;s common symptoms,<br/>\n&gt; &quot;if any one of them is a contraindication, DO NOT VACCINATE&quot; [caps<br/>\n&gt; added]. And yet, under legislated mandates, the vaccines are still<br/>\n&gt; required. </span></blockquote></div>","specialLinks":[]}],"prevTopicId":13996,"nextTopicId":13998}}