{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":33,"messages":[{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re:Rules and Principles","postDate":"1269882611","msgId":52394,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUxNTAxNi4yNTg3MC5xbUB3ZWI4MTUwNi5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PGhvcWo2OSthZGQ3QGVHcm91cHMuY29tPg==","referencesHeader":"PGhvcWo2OSthZGQ3QGVHcm91cHMuY29tPg=="},"prevInTopic":52393,"nextInTopic":52397,"prevInTime":52393,"nextInTime":52395,"topicId":52141,"numMessagesInTopic":0,"msgSnippet":"Gigi my 4 year old is alwasy naked. well until now  that the weather is getting nice and she wants to wear her Summer Dresses!. We dont mind at all and she","messageBody":"<div id=\"ygrps-yiv-1064816486\">Gigi my 4 year old is alwasy naked. well until now  that the weather is getting nice and she wants to wear her Summer Dresses!.<br/>\nWe dont mind at all and she can be naked all she wants but when someone comes over we ask that she put clothes  on. It has never been a problem.<br/>\nI do the same when MIL comes over because I think  she will mind.<br/>\nWhen my mom comes over is no big deal.<br/>\nGigi is a pretty strong willed but she has not have a problem putting clothes on when we have people over. <br/>\n <br/>\nAlex Polikowsky<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":335633701,"authorName":"DaBreeze21","from":"&quot;DaBreeze21&quot; &lt;susanmay15@...&gt;","profile":"DaBreeze21","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re:Rules and Principles","postDate":"1269878793","msgId":52393,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhvcWo2OSthZGQ3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDRCQTQxMTUxLjgwMTA5MDJAeWFob28uY2E+"},"prevInTopic":52190,"nextInTopic":52394,"prevInTime":52392,"nextInTime":52394,"topicId":52141,"numMessagesInTopic":0,"msgSnippet":"-=-So... nudity.  She loves to be naked... oh and touching herself ;) Regular 3 year old stuff, I hear.  But, somewhere between 2.5 and 3.5 our feelings about","messageBody":"<div id=\"ygrps-yiv-1270793741\">-=-So... nudity.  She loves to be naked... oh and touching herself ;)  <br/>\nRegular 3 year old stuff, I hear.  But, somewhere between 2.5 and 3.5 our feelings about her and public nudity changed.-=-<br/>\n<br/>\nMy daughter is 3 1/2 and also loves to be naked. Part of it is just that she &quot;runs hot&quot;. She gets warm in too many clothes quickly. She also doesn&#39;t like to where underwear yet. So we have come up with alternatives for when we are out of the house - she can wear tights, or shorts that aren&#39;t too loose, or skorts that have built in &quot;underwear&quot;. Oh, she wears these things because she almost always is wearing a dress. <br/>\n<br/>\nIn the house we don&#39;t mind if she wants to be naked. I do wonder about where the &quot;line&quot; is with nakedness though. I know that it is different for different people - my family was never very shy about nakedness so I don&#39;t think it is a big deal. But yesterday my husband was skyping with his mom on the computer (I was asleep with the baby) and Marisol was naked. His mom told him that she should have clothes on and that &quot;she&#39;s not 2 anymore.&quot;<br/>\n<br/>\nWhat are people&#39;s thoughts on situations like this? My feeling is she (Marisol) is in her own home and it doesn&#39;t make us feel uncomfortable so why can&#39;t she be naked? But my MIL is coming to visit in two weekends and I am feeling stressed already and this little comment has made me start thinking. If it makes her uncomfortable maybe we should try to talk to Marisol about that? This is where &quot;common sense&quot; seems to elude me - when it involves family and we have very different thresholds for different things. If we were at her home it would make sense to tell Marisol she needs to be dressed...<br/>\n<br/>\nThanks for any input!<br/>\n<br/>\nSusan</div>","specialLinks":[]},{"userId":366686190,"authorName":"clara_bellar","from":"&quot;clara_bellar&quot; &lt;claramont@...&gt;","profile":"clara_bellar","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Rules and Principles","postDate":"1269122706","msgId":52190,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhvM2dxaSt2b2V1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDNhOTNmZmYxMTAwMzIwMTIyMnYxOWUzZGU1OGs5MGNlNDZiYWIxY2E0YmY1QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":52187,"nextInTopic":52393,"prevInTime":52189,"nextInTime":52191,"topicId":52141,"numMessagesInTopic":0,"msgSnippet":"As I m still thinking about punishment versus consequences, here is a definition of punishment that I find helpful. From Rue Kream s book Parenting A Free","messageBody":"<div id=\"ygrps-yiv-1697945314\">As I&#39;m still thinking about punishment versus consequences, here is a definition of punishment that I find helpful. <br/>\n<br/>\nFrom Rue Kream&#39;s book &quot;Parenting A Free Child: An Unschooled Life&quot;:<br/>\n<br/>\n&quot;Any time a parent plans for something unpleasant to happen to a child so that she will learn a lesson, it is a punishment.&quot;<br/>\n<br/>\nIn my example, the parent plans for something that *may be* unpleasant (ending a play date earlier if someone gets pushed more than once) or *may be* a relief to one or both children, in order to keep the children safer - not in order to teach anybody a lesson.<br/>\n<br/>\nClara</div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Rules and Principles","postDate":"1269112955","msgId":52187,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNhOTNmZmYxMTAwMzIwMTIyMnYxOWUzZGU1OGs5MGNlNDZiYWIxY2E0YmY1QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDY4MTEzNS42NTg5NS5xbUB3ZWIxMTA0MDMubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PGhvMHUwaCs1bGxpQGVHcm91cHMuY29tPiA8NEJBNDExQjYuMzA3MDIwOEBlYXJ0aGxpbmsubmV0PgkgPDMyM0YyNzUxLTU1MDktNDMxRC05RTg4LTU2QTRGNkE0NEE4RkBTYW5kcmFkb2RkLmNvbT4JIDw0QkE0Njg3OS4zMDQwOUBlYXJ0aGxpbmsubmV0PgkgPDY4MTEzNS42NTg5NS5xbUB3ZWIxMTA0MDMubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":52184,"nextInTopic":52190,"prevInTime":52186,"nextInTime":52188,"topicId":52141,"numMessagesInTopic":0,"msgSnippet":"... I think it s conventional and cultural to expect that a parent can visit with other adults (and there s a kind of peer pressure to do so IMO) and to","messageBody":"<div id=\"ygrps-yiv-423510722\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;Even if the parents decided to continue play dates despite one kid pushing the other, it would be negative conditioning by the sheer absence of positive play interactions that the parents aren&#39;t facilitating.&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>I think it&#39;s conventional and cultural to expect that a parent can<br/>\nvisit with other adults (and there&#39;s a kind of peer pressure to do so<br/>\nIMO) and to occasionally take note where their little ones are, and as<br/>\nlong as things basically seem peaceful from the adults viewpoint<br/>\n(nobody has pushed anyone yet) then the adults continue talking.<br/>\nThat&#39;s the norm.<br/>\n<br/>\nAt first, I didn&#39;t understand how to handle things in other ways. Then<br/>\nI learned to always take something for *me* to do that Karl could join<br/>\nin with if he wanted to. He didn&#39;t general feel comfortable by himself<br/>\nwith kids he didn&#39;t know until he got around 5 1/2, and he preferred<br/>\nto hang out with me because we didn&#39;t go out that much anyway (most<br/>\ntimes he didn&#39;t want to). Usually how it worked out is Karl sat<br/>\ncontentedly beside me while I played with the stuff I brought (glue,<br/>\npipe cleaners, paper, markers, playacting clothes and props etc etc<br/>\n--- whatever I had on hand to grab and go) and the other kids would<br/>\njump in and play with these things while Karl would fiddle with one<br/>\nthing and watch what everyone was doing, mostly talking, his favorite<br/>\nthing to do. It finally dawned on me that Karl is more of a talker<br/>\nthan a run-around-active type, and he&#39;d rather tell stories or<br/>\nroleplay than anything else. No wonder he didn&#39;t understand all that<br/>\n(to him) &quot;crazy&quot; running around behavior-- he didn&#39;t know why they<br/>\ndidn&#39;t like to talk much or imagine (live out) a story out loud. Those<br/>\nare still his favorite things to do. He has finally figured out the<br/>\nfun of running wildly from place to place, racing, dashing about.<br/>\n<br/>\nSome of the conflicts that children have are these kinds of<br/>\nmisunderstandings about what&#39;s fun to do and it isn&#39;t as simple as<br/>\nletting one&#39;s children toodle along however they may until someone<br/>\npushes someone else.<br/>\n<br/>\nStaying close by is part of the unschooling thought, SO AS to get to<br/>\nknow our children in different environments and situations, as well as<br/>\nobserving our child/ren&#39;s changes from one development stage to<br/>\nanother. AND along the way, figuring out how to match children&#39;s<br/>\ncurrent style of preferred play with the environment in order to play<br/>\npeacefully with others.<br/>\n<br/>\nThe assumption that unschooling is about helping children to learn<br/>\nisn&#39;t quite accurate. To do unschooling well, the parents find out how<br/>\nto facilitate their own children by getting to know the child/ren&#39;s<br/>\nspecific styles of play/living/enjoying/learning. The parents are<br/>\nlearning and the children are learning.<br/>\n<br/>\nI think the difference between the well-acculturated idea of guiding<br/>\nchildren is very different from the unschooling thought of<br/>\nfacilitation.<br/>\n<br/>\n~Katherine</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Rules and Principles","postDate":"1269107878","msgId":52183,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY4MTEzNS42NTg5NS5xbUB3ZWIxMTA0MDMubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PDRCQTQ2ODc5LjMwNDA5QGVhcnRobGluay5uZXQ+","referencesHeader":"PGhvMHUwaCs1bGxpQGVHcm91cHMuY29tPiA8NEJBNDExQjYuMzA3MDIwOEBlYXJ0aGxpbmsubmV0PiA8MzIzRjI3NTEtNTUwOS00MzFELTlFODgtNTZBNEY2QTQ0QThGQFNhbmRyYWRvZGQuY29tPiA8NEJBNDY4NzkuMzA0MDlAZWFydGhsaW5rLm5ldD4="},"prevInTopic":52177,"nextInTopic":52184,"prevInTime":52182,"nextInTime":52184,"topicId":52141,"numMessagesInTopic":0,"msgSnippet":"***What it sounded to me like was that they were going to keep getting together, and every time one kid pushed the other, they d immediately take them home,","messageBody":"<div id=\"ygrps-yiv-1150358657\">***What it sounded to me like was that they were going to keep getting <br/>\ntogether, and every time one kid pushed the other, they&#39;d immediately <br/>\ntake them home, hoping that the kid will eventually associate pushing <br/>\nwith having to stop playing with his friend and will then stop pushing. <br/>\nNegative conditioning.***<br/>\n<br/>\nIt seems to me that the mom of the kid that is doing the pushing should be sitting right there next to her child, distracting and playing with him.  The parents might see a pattern arise.  There could be something that triggers the kid to push, but everyone&#39;s missing it because they aren&#39;t sitting right there, and they&#39;re waiting and watching for it to happen.  Instances that I remember of little ones pushing, often involve a toy being taken away or a toy that&#39;s highly desirable and not available due to another kid using it.  That is so easy to navigate with little ones by being right there and playing with.<br/>\n<br/>\nThe act of helping the kids get what they want and play together would be positive and helpful.  Even if the parents decided to continue play dates despite one kid pushing the other, it would be negative conditioning by the sheer absence of positive play interactions that the parents aren&#39;t facilitating.  Some little kids really really don&#39;t play well with other little kids too.  Chamille played well with other little kids, even at very young ages and stages, but Margaux was much better off sitting with me, right there with me helping her and playing with her whether there was another kid or not.  So often, when we went out, it was me playing with Margaux and occasionally being able to chat and be friendly with other moms.  There was only one little kid that she was able to play with when she was little, and their family mysteriously skipped town.<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":366686190,"authorName":"clara_bellar","from":"&quot;clara_bellar&quot; &lt;claramont@...&gt;","profile":"clara_bellar","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Rules and Principles","postDate":"1269105729","msgId":52184,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhvMzA4MStkdnJkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDRCQTQ2ODc5LjMwNDA5QGVhcnRobGluay5uZXQ+"},"prevInTopic":52183,"nextInTopic":52187,"prevInTime":52183,"nextInTime":52185,"topicId":52141,"numMessagesInTopic":0,"msgSnippet":"... That s what we ve been doing, and the snack & potty breaks too. The thing is it s totally random and unexpected, so it s hard to prevent or try to head it","messageBody":"<div id=\"ygrps-yiv-107703116\"><blockquote><span title=\"ireply\">&gt; Sandra Dodd wrote:<br/>\n&gt; &gt; It doesn&#39;t seem it would happen over and over. I liked the suggestion<br/>\n&gt; &gt; of the moms being right there, <br/>\n<br/>\n </span></blockquote>That&#39;s what we&#39;ve been doing, and the snack & potty breaks too. The thing is it&#39;s totally random and unexpected, so it&#39;s hard to prevent or try to head it off by planning ahead.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Pam Sorooshian wrote:<br/>\n&gt; What it sounded to me like was that they were going to keep getting <br/>\n&gt; together, and every time one kid pushed the other, they&#39;d immediately <br/>\n&gt; take them home, hoping that the kid will eventually associate pushing <br/>\n&gt; with having to stop playing with his friend and will then stop pushing. <br/>\n&gt; Negative conditioning. I guess it is calling it a rule that made me <br/>\n&gt; think that&#39;s how they were planning it out. A rule seems to imply <br/>\n&gt; something that is going to be repeated.<br/>\n<br/>\n </span></blockquote>I wrote that the play date guideline/rule (not announced as such to the children but something for that&#39;s important for the parents) was &quot;play gently&quot;. Which we could call a principle, I guess? And definitely, &quot;play gently&quot; is something that we expect to be repeated :)<br/>\n<br/>\nAnd I didn&#39;t write that every time one kid pushed the other we&#39;d immediately take them home, I wrote: &quot;His mother and I decided to end the playdate next time it happens&quot;. I was just talking about next time. Because yes, if it was to happen again, after that we would definitely wait for a bit and not do play dates together for a while. Naomi Aldort says young kids don&#39;t need to be around kids their age, that they benefit more from being with an older child and that being just with the parents is enough anyway. I can see that my son loves being around older children and doesn&#39;t really care/interact that much with kids his age. I guess for us maybe it&#39;s more about the mothers liking to get together and talk about things that come up at this particular age...<br/>\nWhich reminds me, Naomi also says that they don&#39;t need socialization until they&#39;re much older (teenagers I think), she says one best friend is enough socialization in most cases. Since the S word comes up all the time among family & friends, I was wondering if you all agree w/that. My usual answer to the S question is that unschooled kids have much more opportunities to socialize because they don&#39;t just spend the day with kids their age, they get to live with adults and kids of all ages and they get to choose their friends freely and do activities of their choice with them. I&#39;m sure each child is going to have different socialization needs and our job is to provide the environment that suits their personality and needs at any specific season of their life. Still, I&#39;m wondering if &quot;in general&quot; socialization is overstated, if it&#39;s accurate that one best friend is enough and that there&#39;s no need to be part of a group.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Sandra wrote:<br/>\n&gt; It might not be a punishment if one is ready to push and the other <br/>\n&gt; feels threatened. It might be a safety valve.<br/>\n </span></blockquote>That&#39;s exactly it. The way we envisioned it is that his mom would say &quot;we are going to go home because I need to keep Solal safe, and I am worried that he will get hurt, we&#39;ll see Solal again soon.&quot; I don&#39;t feel like there is punishment in that...<br/>\n<br/>\nClara</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Rules and Principles","postDate":"1269065849","msgId":52177,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCQTQ2ODc5LjMwNDA5QGVhcnRobGluay5uZXQ+","inReplyToHeader":"PDMyM0YyNzUxLTU1MDktNDMxRC05RTg4LTU2QTRGNkE0NEE4RkBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGhvMHUwaCs1bGxpQGVHcm91cHMuY29tPiA8NEJBNDExQjYuMzA3MDIwOEBlYXJ0aGxpbmsubmV0PiA8MzIzRjI3NTEtNTUwOS00MzFELTlFODgtNTZBNEY2QTQ0QThGQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":52173,"nextInTopic":52183,"prevInTime":52176,"nextInTime":52178,"topicId":52141,"numMessagesInTopic":0,"msgSnippet":"... What it sounded to me like was that they were going to keep getting together, and every time one kid pushed the other, they d immediately take them home,","messageBody":"<div id=\"ygrps-yiv-945486229\">On 3/19/2010 5:15 PM, Sandra Dodd wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; -=-Seems meanspirited to keep setting them up for a punishment, over<br/>\n&gt; and over.-=-<br/>\n&gt;<br/>\n&gt; It doesn&#39;t seem it would happen over and over. I liked the suggestion<br/>\n&gt; of the moms being right there, and of breaking the session up with<br/>\n&gt; snacks and potty breaks.<br/>\n<br/>\n </span></blockquote>What it sounded to me like was that they were going to keep getting <br/>\ntogether, and every time one kid pushed the other, they&#39;d immediately <br/>\ntake them home, hoping that the kid will eventually associate pushing <br/>\nwith having to stop playing with his friend and will then stop pushing. <br/>\nNegative conditioning. I guess it is calling it a rule that made me <br/>\nthink that&#39;s how they were planning it out. A rule seems to imply <br/>\nsomething that is going to be repeated.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":222835102,"authorName":"lalow66","from":"&quot;lalow66&quot; &lt;lalow@...&gt;","profile":"lalow66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Rules and Principles","postDate":"1269049250","msgId":52173,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhvMTkzMit2ZmozQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGU2OGY4YWExMDAzMTkxNzQ4djY4NDBiZjgzdTZjNTUwZWYwYTI0NGE1NUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":52171,"nextInTopic":52177,"prevInTime":52172,"nextInTime":52174,"topicId":52141,"numMessagesInTopic":0,"msgSnippet":" ... This is something I am really working on.  But it is often seemingly easier to make a rule.  For example, my youngest son seems to get into things often","messageBody":"<div id=\"ygrps-yiv-1575499008\">&quot;<br/>\n<blockquote><span title=\"ireply\"> &gt; This is why I think making rules in my house was counter-productive. It&#39;s<br/>\n&gt; all too easy to use rules to absolve yourself of the responsibility to deal<br/>\n&gt; with things as they come up and be fully aware of your children and their<br/>\n&gt; needs.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Bernadette. &quot;<br/>\n<br/>\n<br/>\n </span></blockquote>This is something I am really working on.  But it is often seemingly easier to make a rule.  For example, my youngest son seems to get into things often if he goes downstairs in the mornning when I am not up yet.<br/>\nHe broke our only t.v. we had ever bought one day when my husband and I were upstairs and he threw a drum at it.  He is 4.  He gets into other  stuff too.  Like I said he is 4.  So I made a rule, several months back and P can not go downstairs before I get up. He had to wait upstairs till i was up.  It was hard to enforce so I got mad several mornings in a row until I realized I need to get up before P and get downstairs.  If he wakes up before me, he can come get me, which he happily does.  Makes life easier and more peaceful and there is no rule attached.</div>","specialLinks":[]},{"userId":221591978,"authorName":"Bernadette Lynn","from":"Bernadette Lynn &lt;bernadette.lynn@...&gt;","profile":"bwalyalynn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Rules and Principles","postDate":"1269046106","msgId":52171,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU2OGY4YWExMDAzMTkxNzQ4djY4NDBiZjgzdTZjNTUwZWYwYTI0NGE1NUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDRCQTQxMUI2LjMwNzAyMDhAZWFydGhsaW5rLm5ldD4=","referencesHeader":"PGhvMHUwaCs1bGxpQGVHcm91cHMuY29tPiA8NEJBNDExQjYuMzA3MDIwOEBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":52170,"nextInTopic":52173,"prevInTime":52170,"nextInTime":52172,"topicId":52141,"numMessagesInTopic":0,"msgSnippet":"... This is why I think making rules in my house was counter-productive. It s all too easy to use rules to absolve yourself of the responsibility to deal with","messageBody":"<div id=\"ygrps-yiv-891127674\">On 20 March 2010 00:07, Pam Sorooshian &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pamsoroosh@...\">pamsoroosh@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; For one thing, a rule with a single imposed consequence leaves no room for<br/>\n&gt; creativity on the part of the parents. There are dozens of other options you<br/>\n&gt; might want to<br/>\n&gt; try out at different times<br/>\n&gt;<br/>\n </span></blockquote>--------------------------------<br/>\n<br/>\n<br/>\nThis is why I think making rules in my house was counter-productive. It&#39;s<br/>\nall too easy to use rules to absolve yourself of the responsibility to deal<br/>\nwith things as they come up and be fully aware of your children and their<br/>\nneeds.<br/>\n<br/>\n<br/>\nBernadette.<br/>\n-- <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.bbc.co.uk/dna/h2g2/U15459\">http://www.bbc.co.uk/dna/h2g2/U15459</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Rules and Principles","postDate":"1269044125","msgId":52170,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMyM0YyNzUxLTU1MDktNDMxRC05RTg4LTU2QTRGNkE0NEE4RkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDRCQTQxMUI2LjMwNzAyMDhAZWFydGhsaW5rLm5ldD4=","referencesHeader":"PGhvMHUwaCs1bGxpQGVHcm91cHMuY29tPiA8NEJBNDExQjYuMzA3MDIwOEBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":52169,"nextInTopic":52171,"prevInTime":52169,"nextInTime":52171,"topicId":52141,"numMessagesInTopic":0,"msgSnippet":"-=-In any case, don t fool yourself that your consequence for breaking the rule (not being allowed to continue playing together if they push) isn t a","messageBody":"<div id=\"ygrps-yiv-926849807\">-=-In any case, don&#39;t fool yourself that your consequence for breaking  <br/>\nthe<br/>\nrule (not being allowed to continue playing together if they push) isn&#39;t<br/>\na punishment. -=-<br/>\n<br/>\nIt might not be a punishment if one is ready to push and the other  <br/>\nfeels threatened.  It might be a safety valve.<br/>\n<br/>\n-=-Seems meanspirited to keep setting them up for a punishment, over  <br/>\nand over.-=-<br/>\n<br/>\nIt doesn&#39;t seem it would happen over and over.  I liked the suggestion  <br/>\nof the moms being right there, and of breaking the session up with  <br/>\nsnacks and potty breaks.<br/>\n<br/>\nKids are older all the time.  Sometimes parents seem to be looking for  <br/>\nlong-range strategies for dealing with a child of a certain age, but  <br/>\nno age lasts longer than a year.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Rules and Principles","postDate":"1269043802","msgId":52169,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCQTQxMjVBLjIwODA2QGVhcnRobGluay5uZXQ+","inReplyToHeader":"PDE1RjhCODg0LTNDMEYtNDMyOS1BRjBGLTIyNTUzQkMwQkREMEBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGhvMHUwaCs1bGxpQGVHcm91cHMuY29tPiA8MTVGOEI4ODQtM0MwRi00MzI5LUFGMEYtMjI1NTNCQzBCREQwQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":52168,"nextInTopic":52170,"prevInTime":52168,"nextInTime":52170,"topicId":52141,"numMessagesInTopic":0,"msgSnippet":"... Separate and not allow continued pushing, yes. But not-even-two-year-olds WILL push and shove a bit. They shove each other out of the way, for example. One","messageBody":"<div id=\"ygrps-yiv-1957547984\">On 3/19/2010 4:41 PM, Sandra Dodd wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; -=-Leaving the play date would be an artificial consequence to<br/>\n&gt; breaking to rule/guideline &quot;play gently&quot;. It&#39;s not a genuine<br/>\n&gt; consequence. -=-<br/>\n&gt;<br/>\n&gt; I think it&#39;s &quot;a genuine consequence.&quot; You&#39;re unwilling to wait for<br/>\n&gt; brain damage or death. So the fact that the parents will separate the<br/>\n&gt; boys is natural and good.<br/>\n<br/>\n </span></blockquote>Separate and not allow continued pushing, yes. But <br/>\nnot-even-two-year-olds WILL push and shove a bit. They shove each other <br/>\nout of the way, for example. One shove and you&#39;re out of there seems too <br/>\nmuch. Either don&#39;t set up the situation in the first place or separate <br/>\nand comfort and stay closer and more at hand. Seems meanspirited to keep <br/>\nsetting them up for a punishment, over and over.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Rules and Principles","postDate":"1269043638","msgId":52168,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCQTQxMUI2LjMwNzAyMDhAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PGhvMHUwaCs1bGxpQGVHcm91cHMuY29tPg==","referencesHeader":"PGhvMHUwaCs1bGxpQGVHcm91cHMuY29tPg=="},"prevInTopic":52167,"nextInTopic":52169,"prevInTime":52167,"nextInTime":52169,"topicId":52141,"numMessagesInTopic":0,"msgSnippet":"... I don t see the need for a rule in this case. For one thing, a rule with a single imposed consequence leaves no room for creativity on the part of the","messageBody":"<div id=\"ygrps-yiv-1782042497\">On 3/19/2010 3:31 PM, clara_bellar wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Leaving the play date would be an artificial consequence to breaking <br/>\n&gt; to rule/guideline &quot;play gently&quot;. It&#39;s not a genuine consequence. <br/>\n&gt; (Someone getting hurt as a result of the pushing would be a genuine <br/>\n&gt; consequence.) Never the less it seems necessary to me. Any thoughts?<br/>\n </span></blockquote>I don&#39;t see the need for a &quot;rule&quot; in this case. For one thing, a rule <br/>\nwith a single imposed consequence leaves no room for creativity on the <br/>\npart of the parents. There are dozens of other options you might want to <br/>\ntry out at different times. If you make a rule such as &quot;You push, we <br/>\nleave,&quot; then you lock yourself in to that one option.<br/>\n<br/>\nNot knowing these particular children, but having known LOTS and lots of <br/>\nchildren those ages, they&#39;re really young for play dates, anyway.  So if <br/>\nthey were really rough, I&#39;d say just don&#39;t have play dates at all. Wait <br/>\na while.<br/>\n<br/>\nSometimes a push means one kid needs a break - they may not need to go <br/>\nhome, just need some alone time for a while. Or it can mean you&#39;re <br/>\npushing playing together on a kid who is really not ready for that with <br/>\na same-age friend, yet.<br/>\n<br/>\nIf they like to play with each other and you like to get together with <br/>\nthe other mom, then short times together combined with separate times is <br/>\nan option. Give them 20 minutes of play together time, then take some <br/>\nfood and offer it sort of separately, so they have some time apart. Then <br/>\ngive them a bit more time together, then take one off to the potty or <br/>\nsomething.<br/>\n<br/>\nAnother option is that parents are playing with them whenever they play <br/>\n- parents right there in the midst of them.<br/>\n<br/>\nAnother option is to pay really close attention to what leads up to the <br/>\npushing and try to head it off by planning ahead with a number of <br/>\ndifferent possibilities at hand.<br/>\n<br/>\nIn any case, don&#39;t fool yourself that your consequence for breaking the <br/>\nrule (not being allowed to continue playing together if they push) isn&#39;t <br/>\na punishment. That&#39;s newspeak (ala George Orwell).<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":251210887,"authorName":"Shira Rocklin","from":"Shira Rocklin &lt;shirarocklin@...&gt;","profile":"shirarocklin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re:Rules and Principles","postDate":"1269043537","msgId":52167,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCQTQxMTUxLjgwMTA5MDJAeWFob28uY2E+"},"prevInTopic":52166,"nextInTopic":52168,"prevInTime":52166,"nextInTime":52168,"topicId":52141,"numMessagesInTopic":0,"msgSnippet":"... was the question, I think, but I don t want to confuse punishment and consequence. The regular argument was made that principle is just another word for","messageBody":"<div id=\"ygrps-yiv-140779944\">----Does a rule have to have a punishment if it&#39;s broken? &quot;Consequence&quot;<br/>\nwas the question, I think, but I don&#39;t want to confuse punishment and<br/>\nconsequence.<br/>\n<br/>\nThe regular argument was made that &quot;principle&quot; is just another word<br/>\nfor &quot;rule.&quot; I don&#39;t need help to respond to that, but as to the<br/>\ndefinition of &quot;rule,&quot; ideas before the chat could be useful.----<br/>\n<br/>\nI&#39;m not sure if a rule has to have a punishment.  I think there may be <br/>\nroom and gray areas about what&#39;s a rule, what&#39;s a principle, what is a <br/>\ncultural convention, etc.  I was trying to think about our lives and <br/>\nwhether we have &#39;rules&#39; right now... after very much adopting the <br/>\nunschooling principles and giving Temima, 3yo, lots of freedom. <br/>\n<br/>\nSo... nudity.  She loves to be naked... oh and touching herself ;)  <br/>\nRegular 3 year old stuff, I hear.  But, somewhere between 2.5 and 3.5 <br/>\nour feelings about her and public nudity changed.  She doesn&#39;t look like <br/>\na baby anymore.  And one day I glimpsed her from outside, at the window, <br/>\nand it struck me that anyone could be taking a snap shot of her like <br/>\nthat and I got scared.  And I realized we weren&#39;t keeping her safe... <br/>\neven if there was no direct damage that might be done by someone taking <br/>\npictures, it still strikes me as a dangerous thing.   So we made a <br/>\nrule... maybe based on the principle &quot;be safe&quot;?   The rule is:  If she <br/>\nis outside the apartment, or standing with her waist higher than the <br/>\nlevel of the windowsill right in front of the window, or if strangers <br/>\nare coming over (this part is still a bit loose), she must cover her <br/>\nnether-regions, at the very least.  This is often done creatively, with <br/>\nplaysilks, or dirty laundry, or out of season clothing... but we&#39;ve <br/>\nbecome strict about the being covered that way.   I can&#39;t say that its a <br/>\nprinciple... it definitely feels like a rule... we don&#39;t budge often on <br/>\nit.  Its grown out of a principle though.  Does it have punishments?  <br/>\nNot really, not punitive meaningless disconnected punishment, not anger <br/>\nor resentment, withdrawn love, or withdrawn privileges, not all the <br/>\nnegative things I associate with punishment from my childhood.  We just <br/>\ndon&#39;t go out.  We call it being safe, and just don&#39;t go out, or we close <br/>\nthe curtains of the window, etc.   I don&#39;t know, consequence sounds like <br/>\njust as bad a word as punishment (probably from how I&#39;ve seen it used in <br/>\nsome parenting books) - I think of it more as just what we do to stay safe.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Rules and Principles","postDate":"1269042079","msgId":52166,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1RjhCODg0LTNDMEYtNDMyOS1BRjBGLTIyNTUzQkMwQkREMEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhvMHUwaCs1bGxpQGVHcm91cHMuY29tPg==","referencesHeader":"PGhvMHUwaCs1bGxpQGVHcm91cHMuY29tPg=="},"prevInTopic":52165,"nextInTopic":52167,"prevInTime":52165,"nextInTime":52167,"topicId":52141,"numMessagesInTopic":0,"msgSnippet":"-=-Leaving the play date would be an artificial consequence to breaking to rule/guideline play gently . It s not a genuine consequence. -=- I think it s a","messageBody":"<div id=\"ygrps-yiv-1027366653\">-=-Leaving the play date would be an artificial consequence to  <br/>\nbreaking to rule/guideline &quot;play gently&quot;. It&#39;s not a genuine  <br/>\nconsequence. -=-<br/>\n<br/>\nI think it&#39;s &quot;a genuine consequence.&quot;  You&#39;re unwilling to wait for  <br/>\nbrain damage or death.  So the fact that the parents will separate the  <br/>\nboys is natural and good.<br/>\n<br/>\nHolly left a party the other night because the other kids weren&#39;t  <br/>\nbeing any fun.  That was a natural consequence of their behavior.   <br/>\nThey might not have minded it. &lt;G&gt;   But she came home and got in the  <br/>\nhot tub with me and Keith, to complain that she had left where she was  <br/>\nhanging out with a younger friend, who&#39;s 13, to go to this &quot;adult&quot;  <br/>\nparty which ended up being very boring.<br/>\n<br/>\nPeople don&#39;t have to stay where they are.  Because they have the  <br/>\nfreedom to leave (or to request to leave, if they&#39;re too young to get  <br/>\nup and leave), the consequence of one person&#39;s bad behavior can be  <br/>\nother people moving away from them (or worse).<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":366686190,"authorName":"clara_bellar","from":"&quot;clara_bellar&quot; &lt;claramont@...&gt;","profile":"clara_bellar","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Rules and Principles","postDate":"1269037905","msgId":52165,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhvMHUwaCs1bGxpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGU2OGY4YWExMDAzMTkxNDIwcTI5OWM3NWF4MjM0MDM0YmZjNzgyMzEzYkBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":52162,"nextInTopic":52166,"prevInTime":52164,"nextInTime":52166,"topicId":52141,"numMessagesInTopic":0,"msgSnippet":"... A 21 mo old boy, Kai, pushes my 20 mo old Solal, every time we get together. It happened once on Monday, 4-5 times on Wed, and again today. He s bigger","messageBody":"<div id=\"ygrps-yiv-2016907977\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Bernadette Lynn &lt;bernadette.lynn@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; If there are no genuine consequences to breaking a rule, why create<br/>\n&gt; artificial ones? And if there are consequences, what&#39;s the point of adding<br/>\n&gt; to them?<br/>\n<br/>\n </span></blockquote>A 21 mo old boy, Kai, pushes my 20 mo old Solal, every time we get together. It happened once on Monday, 4-5 times on Wed, and again today. He&#39;s bigger than my son and made him fall a few times. We tried different approaches, nothing worked. His mother and I decided to end the playdate next time it happens, not as a punishment (he can still play, just not w/S), but as protective measure and to clearly live up to our principle/guideline that other&#39;s bodies cannot be touched with brutality.<br/>\nLeaving the play date would be an artificial consequence to breaking to rule/guideline &quot;play gently&quot;. It&#39;s not a genuine consequence. (Someone getting hurt as a result of the pushing would be a genuine consequence.) Never the less it seems necessary to me. Any thoughts?<br/>\nClara</div>","specialLinks":[]},{"userId":221591978,"authorName":"Bernadette Lynn","from":"Bernadette Lynn &lt;bernadette.lynn@...&gt;","profile":"bwalyalynn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Rules and Principles","postDate":"1269033656","msgId":52162,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU2OGY4YWExMDAzMTkxNDIwcTI5OWM3NWF4MjM0MDM0YmZjNzgyMzEzYkBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDQ2NEVGOURBLTUxOEYtNDkwNC1BMEFELTBCODIxNkFCM0U0RUBzdXBlbm4uY29tPg==","referencesHeader":"PGhudTFocCtiaTliQGVHcm91cHMuY29tPgkgPDEzOEY4NUZELUEwQzYtNDY2Ny1BRDk2LURBMzlFREJERUIxNUBTYW5kcmFkb2RkLmNvbT4JIDxlNjhmOGFhMTAwMzE5MDM0NGhmZTk3MDBxYTg4OGUzOGVhNDE4YzA5Y0BtYWlsLmdtYWlsLmNvbT4JIDw0NjRFRjlEQS01MThGLTQ5MDQtQTBBRC0wQjgyMTZBQjNFNEVAc3VwZW5uLmNvbT4="},"prevInTopic":52161,"nextInTopic":52165,"prevInTime":52161,"nextInTime":52163,"topicId":52141,"numMessagesInTopic":0,"msgSnippet":"... Yes, that s exactly my point, though I didn t word it clearly. *** Does a rule have to have a punishment if it s broken?  Consequence was the question, I","messageBody":"<div id=\"ygrps-yiv-1969992789\">On 19 March 2010 15:59, Su Penn &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:su@...\">su@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; I think it&#39;s possible to get to this same point without using words like<br/>\n&gt; &quot;rules&quot; and &quot;punishment.&quot;<br/>\n&gt;<br/>\n&gt; But you&#39;ve gotten at something important--&quot;no food in bedrooms&quot; isn&#39;t an<br/>\n&gt; arbitrary rule at your house, it&#39;s a pest-control measure. And, as it turns<br/>\n&gt; out, it&#39;s not really a &quot;rule&quot; at all because food _can_ be taken to the<br/>\n&gt; bedrooms as long as it&#39;s done in a way that won&#39;t attract bugs and the kid<br/>\n&gt; checks in with Mom first.<br/>\n&gt;<br/>\n </span></blockquote>-----------------------<br/>\n<br/>\n<br/>\nYes, that&#39;s exactly my point, though I didn&#39;t word it clearly.<br/>\n<br/>\n<br/>\n***&quot;Does a rule have to have a punishment if it&#39;s broken?  &quot;Consequence&quot;<br/>\nwas the question, I think, but I don&#39;t want to confuse punishment and<br/>\nconsequence.&quot;***<br/>\n<br/>\n<br/>\n<br/>\nIf there are no genuine consequences to breaking a rule, why create<br/>\nartificial ones? And if there are consequences, what&#39;s the point of adding<br/>\nto them?<br/>\n<br/>\nI don&#39;t believe in punishing children. I also agree with Pam, in our family<br/>\ncreating a rule, even with good intentions, had counter-productive results.<br/>\nNot just because it led my daughter to break the rule but because it led me<br/>\nto miss seeing what she needed; she broke the rule because to her it didn&#39;t<br/>\nseem justified, and I assumed that if she didn&#39;t come down for food and<br/>\ndrink she didn&#39;t really want any, when what she really needed was a way to<br/>\neat and drink without interrupting what she was doing. If I&#39;d been more<br/>\nresponsive to my children instead of relying on rules I&#39;d have seen that<br/>\nearlier.<br/>\n<br/>\n<br/>\n<br/>\nBernadette.<br/>\n-- <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.bbc.co.uk/dna/h2g2/U15459\">http://www.bbc.co.uk/dna/h2g2/U15459</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Rules and Principles","postDate":"1269022068","msgId":52161,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCQTNCRDc0LjIwMDA0QGVhcnRobGluay5uZXQ+","inReplyToHeader":"PGU2OGY4YWExMDAzMTkwMzQ0aGZlOTcwMHFhODg4ZTM4ZWE0MThjMDljQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PGhudTFocCtiaTliQGVHcm91cHMuY29tPgkgPDEzOEY4NUZELUEwQzYtNDY2Ny1BRDk2LURBMzlFREJERUIxNUBTYW5kcmFkb2RkLmNvbT4gPGU2OGY4YWExMDAzMTkwMzQ0aGZlOTcwMHFhODg4ZTM4ZWE0MThjMDljQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":52160,"nextInTopic":52162,"prevInTime":52160,"nextInTime":52162,"topicId":52141,"numMessagesInTopic":0,"msgSnippet":"No emotionally healthy person likes to be ruled.  The really significant thing about a rule imposed on children, to me, is that there is a bit of an internal","messageBody":"<div id=\"ygrps-yiv-6188526\">No emotionally healthy person likes to be &quot;ruled.&quot;  The really <br/>\nsignificant thing about a rule imposed on children, to me, is that there <br/>\nis a bit of an internal incentive set up to &quot;get around&quot; or &quot;bend&quot; or <br/>\n&quot;break&quot; the rule. It often sets up a ruler versus ruled adversarial <br/>\nrelationship. I mean, even if people claim that their &quot;family&quot; came up <br/>\nwith the rules, I really don&#39;t believe that their little children <br/>\nthought they needed a rule for not taking food in their rooms to avoid <br/>\ngetting bug infestations. If the children understood that potentiality, <br/>\nthen why would they need a rule?<br/>\n<br/>\nIf I&#39;d set up a rule that said, &quot;No food in the bedrooms,&quot; then if they <br/>\ndid take food in their bedrooms, they&#39;d be breaking a rule. If they got <br/>\nants, they might not even admit it because it would mean admitting they <br/>\nbroke the rule. Rules very very often have counter-productive results <br/>\nlike this.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 3/19/2010 3:44 AM, Bernadette Lynn wrote:<br/>\n&gt;<br/>\n&gt; We have a rule that people don&#39;t take food up into their rooms. When <br/>\n&gt; one of<br/>\n&gt; my children broke that rule and sneaked food up to her room and hid the<br/>\n&gt; remains she got an infestation of bacon beetles (which she detests) in her<br/>\n&gt; room; finding those was enough to make her realise why I didn&#39;t want food<br/>\n&gt; upstairs and having the beetles and having her room disrupted while I<br/>\n&gt; hoovered them up and washed her carpet was more than enough <br/>\n&gt; *punishment* for<br/>\n&gt; her, though it wasn&#39;t meant as such. She still sometimes takes food up to<br/>\n&gt; her room but I don&#39;t punish her because she always now asks and makes sure<br/>\n&gt; she takes things that won&#39;t leave crumbs, and remembers to bring the<br/>\n&gt; leftovers down, so she&#39;s obeying the intention of the rule. </span></blockquote></div>","specialLinks":[]},{"userId":223803785,"authorName":"Su Penn","from":"Su Penn &lt;su@...&gt;","profile":"marie101365","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Rules and Principles","postDate":"1269014384","msgId":52160,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ2NEVGOURBLTUxOEYtNDkwNC1BMEFELTBCODIxNkFCM0U0RUBzdXBlbm4uY29tPg==","inReplyToHeader":"PGU2OGY4YWExMDAzMTkwMzQ0aGZlOTcwMHFhODg4ZTM4ZWE0MThjMDljQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PGhudTFocCtiaTliQGVHcm91cHMuY29tPiA8MTM4Rjg1RkQtQTBDNi00NjY3LUFEOTYtREEzOUVEQkRFQjE1QFNhbmRyYWRvZGQuY29tPiA8ZTY4ZjhhYTEwMDMxOTAzNDRoZmU5NzAwcWE4ODhlMzhlYTQxOGMwOWNAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":52159,"nextInTopic":52161,"prevInTime":52159,"nextInTime":52161,"topicId":52141,"numMessagesInTopic":0,"msgSnippet":"... I think it s possible to get to this same point without using words like rules and punishment. But you ve gotten at something important-- no food in","messageBody":"<div id=\"ygrps-yiv-839562979\">On Mar 19, 2010, at 6:44 AM, Bernadette Lynn wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; We have a rule that people don&#39;t take food up into their rooms. When one of<br/>\n&gt; my children broke that rule and sneaked food up to her room and hid the<br/>\n&gt; remains she got an infestation of bacon beetles (which she detests) in her<br/>\n&gt; room; finding those was enough to make her realise why I didn&#39;t want food<br/>\n&gt; upstairs and having the beetles and having her room disrupted while I<br/>\n&gt; hoovered them up and washed her carpet was more than enough *punishment* for<br/>\n&gt; her, though it wasn&#39;t meant as such. She still sometimes takes food up to<br/>\n&gt; her room but I don&#39;t punish her because she always now asks and makes sure<br/>\n&gt; she takes things that won&#39;t leave crumbs, and remembers to bring the<br/>\n&gt; leftovers down, so she&#39;s obeying the intention of the rule.<br/>\n<br/>\n </span></blockquote>I think it&#39;s possible to get to this same point without using words like &quot;rules&quot; and &quot;punishment.&quot;<br/>\n<br/>\nBut you&#39;ve gotten at something important--&quot;no food in bedrooms&quot; isn&#39;t an arbitrary rule at your house, it&#39;s a pest-control measure. And, as it turns out, it&#39;s not really a &quot;rule&quot; at all because food _can_ be taken to the bedrooms as long as it&#39;s done in a way that won&#39;t attract bugs and the kid checks in with Mom first.<br/>\n<br/>\nThat&#39;s really different from, &quot;No food in bedrooms because I said so, and if I catch you with food in your room you lose TV for a week,&quot; which is the kind of thing I see a lot of parents I know doing IRL. I don&#39;t think _most_ kids would have a problem with a &quot;rule&quot; that they could understand the good reasons for, and that was flexible if they came up with an alternative. Something like that just happened here the other day, and I&#39;m not remembering the exact details--but I had said No about something, and explained why. Eric said, &quot;But what if we did X,&quot; which addressed my concern, and then it really was OK.<br/>\n<br/>\nNot thinking in terms of rules and punishments can, it seems to me, free parents up and make it easier to ask themselves, &quot;Is there really a good reason behind this, or am I just making a knee-jerk rule because I can?&quot;, to include kids in thinking about solutions to disagreements about what&#39;s OK, and to productively deal with the aftermath of things like the food in the room so that the kid doesn&#39;t just feel resentful and blamed, but learns something useful and is a partner in thinking about how to avoid a negative outcome in the future.<br/>\n<br/>\nSu, mom to Eric 8; Carl, almost 6; Yehva, 2.5<br/>\ntapeflags.blogspot.com</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Rules and Principles","postDate":"1269012504","msgId":52158,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVBQkYzOTRGLURGMTgtNDFGOC04RTA3LTk3RTI0Nzg5MjA3MEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PERFNTAxQzI4LTRGNjAtNEUyMy1CNDE2LUJFNEI4RTZDNTU4M0B2ZXJpem9uLm5ldD4=","referencesHeader":"PDdEOUQ5MDBFLUUyOEItNDlDMS05NDQ0LUNFNzVCNkMxNTE2N0BTYW5kcmFkb2RkLmNvbT4gPERFNTAxQzI4LTRGNjAtNEUyMy1CNDE2LUJFNEI4RTZDNTU4M0B2ZXJpem9uLm5ldD4="},"prevInTopic":52157,"nextInTopic":52159,"prevInTime":52157,"nextInTime":52159,"topicId":52141,"numMessagesInTopic":0,"msgSnippet":"-=- For clarity s sake it s better for those to be called guidelines and reserve rules for times when there s imposed consequences for not going along with","messageBody":"<div id=\"ygrps-yiv-846658529\">-=- For<br/>\nclarity&#39;s sake it&#39;s better for those to be called guidelines and<br/>\nreserve rules for times when there&#39;s imposed consequences for not<br/>\ngoing along with them. Otherwise the joke from Pirates of the<br/>\nCaribbean&#39;s meaningless ;-)<br/>\n<br/>\n&quot;... the code is more what you&#39;d call &quot;guidelines&quot; than actual<br/>\nrules.&quot; -- Barbossa-=-<br/>\n<br/>\n<br/>\nThe posting guidelines for this list are recommendations, but not  <br/>\nfollowing those recommendations gets posts returned and in worst  <br/>\ncases, people trap-doored right off the list.<br/>\n<br/>\nThere can be consequences in the absence of rules. &lt;g&gt;<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":221591978,"authorName":"Bernadette Lynn","from":"Bernadette Lynn &lt;bernadette.lynn@...&gt;","profile":"bwalyalynn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Rules and Principles","postDate":"1268995463","msgId":52159,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU2OGY4YWExMDAzMTkwMzQ0aGZlOTcwMHFhODg4ZTM4ZWE0MThjMDljQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDEzOEY4NUZELUEwQzYtNDY2Ny1BRDk2LURBMzlFREJERUIxNUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGhudTFocCtiaTliQGVHcm91cHMuY29tPgkgPDEzOEY4NUZELUEwQzYtNDY2Ny1BRDk2LURBMzlFREJERUIxNUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":52158,"nextInTopic":52160,"prevInTime":52158,"nextInTime":52160,"topicId":52141,"numMessagesInTopic":0,"msgSnippet":"... In general, though I m sure there are exceptions, if breaking a rule *doesn t* have consequences then it must be a fairly arbitrary rule and I don t think","messageBody":"<div id=\"ygrps-yiv-1989381606\">On 19 March 2010 01:36, Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I<br/>\n&gt; &gt;&gt; I liked Joanna&#39;s note.  The original question was about a rule made<br/>\n&gt; &gt;&gt; by a mom for kids.  I don&#39;t want to be too particular, because<br/>\n&gt; &gt;&gt; there must be something in common for rules to be rules (definition-<br/>\n&gt; &gt;&gt; wise).<br/>\n&gt; &gt;&gt;<br/>\n&gt;<br/>\n </span></blockquote>---------------------------<br/>\n<br/>\n<br/>\nIn general, though I&#39;m sure there are exceptions, if breaking a rule<br/>\n*doesn&#39;t* have consequences then it must be a fairly arbitrary rule and I<br/>\ndon&#39;t think it would be fair to punish a child for that sort of thing. If a<br/>\nrule *does* have consequences then in most or at least many cases seeing or<br/>\nhaving those consequences explained to them should be enough for a child to<br/>\nrealise the value of the rule. If a child is too young to understand the<br/>\nconsequences they&#39;re probably too young to understand the rule and<br/>\npunishment would be a bit unfair; if they understand but don&#39;t remember in<br/>\ntime punishment is a bit pointless.<br/>\n<br/>\nIt depends largely on what people see as the point of punishment, I think?<br/>\nIs it for parents to take revenge on their children for breaking the rules?<br/>\nOr to make them remember not to break them next time?<br/>\n<br/>\nRevenge is a petty and unworthy action to take, I think, and if a rule is<br/>\nmeaningful and justified it will be as memorable with or without punishment<br/>\n(but punishment will make the memory unhappier).<br/>\n<br/>\nWe have a rule that people don&#39;t take food up into their rooms. When one of<br/>\nmy children broke that rule and sneaked food up to her room and hid the<br/>\nremains she got an infestation of bacon beetles (which she detests) in her<br/>\nroom; finding those was enough to make her realise why I didn&#39;t want food<br/>\nupstairs and having the beetles and having her room disrupted while I<br/>\nhoovered them up and washed her carpet was more than enough *punishment* for<br/>\nher, though it wasn&#39;t meant as such. She still sometimes takes food up to<br/>\nher room but I don&#39;t punish her because she always now asks and makes sure<br/>\nshe takes things that won&#39;t leave crumbs, and remembers to bring the<br/>\nleftovers down, so she&#39;s obeying the intention of the rule.<br/>\n<br/>\nWhen using the expression &quot;as a rule&quot; you imply that exceptions are<br/>\nacceptable.<br/>\n<br/>\nBernadette.<br/>\n-- <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.bbc.co.uk/dna/h2g2/U15459\">http://www.bbc.co.uk/dna/h2g2/U15459</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Rules and Principles","postDate":"1268992935","msgId":52157,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PERFNTAxQzI4LTRGNjAtNEUyMy1CNDE2LUJFNEI4RTZDNTU4M0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDdEOUQ5MDBFLUUyOEItNDlDMS05NDQ0LUNFNzVCNkMxNTE2N0BTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDdEOUQ5MDBFLUUyOEItNDlDMS05NDQ0LUNFNzVCNkMxNTE2N0BTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":52154,"nextInTopic":52158,"prevInTime":52156,"nextInTime":52158,"topicId":52141,"numMessagesInTopic":0,"msgSnippet":"... Sometimes the word rule gets used to mean a standard to measure against. Like the Golden Rule. Like the 5-second rule about food that s fallen on the","messageBody":"<div id=\"ygrps-yiv-325212770\">On Mar 18, 2010, at 12:43 PM, Sandra Dodd wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Does a rule have to have a punishment if it&#39;s broken?<br/>\n<br/>\n </span></blockquote>Sometimes the word rule gets used to mean a standard to measure  <br/>\nagainst. Like the Golden Rule. Like the 5-second rule about food  <br/>\nthat&#39;s fallen on the floor.<br/>\n<br/>\nSo that use probably affects people&#39;s connotations of &quot;rule&quot;. For  <br/>\nclarity&#39;s sake it&#39;s better for those to be called guidelines and  <br/>\nreserve rules for times when there&#39;s imposed consequences for not  <br/>\ngoing along with them. Otherwise the joke from Pirates of the  <br/>\nCaribbean&#39;s meaningless ;-)<br/>\n<br/>\n&quot;... the code is more what you&#39;d call &quot;guidelines&quot; than actual  <br/>\nrules.&quot; -- Barbossa<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":301108410,"authorName":"Marina DeLuca-Howard","from":"Marina DeLuca-Howard &lt;delucahoward@...&gt;","profile":"matedgirl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Rules and Principles","postDate":"1268975202","msgId":52154,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE3NGRmOWRjMTAwMzE4MjIwNmoxODM3Nzg0b2E5ZDRlYjlhMDZiZGEwMWJAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PDEzODkwMC45OTQwMS5xbUB3ZWI4MTUwNi5tYWlsLm11ZC55YWhvby5jb20+","referencesHeader":"PGhudWx1YythN2tnQGVHcm91cHMuY29tPgkgPDEzODkwMC45OTQwMS5xbUB3ZWI4MTUwNi5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":52153,"nextInTopic":52157,"prevInTime":52153,"nextInTime":52155,"topicId":52141,"numMessagesInTopic":0,"msgSnippet":"With social rules/etiquette I don t punish my kids, but I let them know that people will treat us differently if we break social conventions.  If we are cool","messageBody":"<div id=\"ygrps-yiv-723999528\">With social rules/etiquette I don&#39;t punish my kids, but I let them know that<br/>\npeople will treat us &quot;differently&quot; if we break social conventions.  If we<br/>\nare cool and have a &quot;different&quot; outfit/funky hair colour we might be<br/>\nadmired.  If we are not clean, dressed nicely, or polite we might not be<br/>\nserved or we might be shunned.<br/>\n<br/>\nHere&#39;s something from my past...<br/>\nI remember as a twenty-one year old stopping on the main street in our large<br/>\ncity to intervene with a man(drunk) hitting a woman in public.  They were<br/>\nboth Aboriginal people.  I broke a &quot;mind your own business rule&quot;.  Everyone<br/>\nelse had just walked by, giving them a wide berth. But my stopping created a<br/>\ndomino effect and a crowd gathered.<br/>\n<br/>\nI tried to tell the woman about shelters and other organizations that might<br/>\nprovide help(AA, addiction centres). After silence and initial surprize that<br/>\nI cared enough to stop, she rejected my attempts. She left to follow her<br/>\nmale companion.  Several people expressed sympathy to me--made some racist<br/>\ncomments and tried to console me.  A man said it was kind of me to try, but<br/>\nyou can&#39;t help people like that...He told me its better to just ignore it.<br/>\nAfter my feelings of helplessness subsided I realized I broke a social<br/>\nconvention--I saw the woman as human and needing help, so when I stopped she<br/>\nbecame human to everyone else on the street.  They were angry she rejected<br/>\nthem, but I wasn&#39;t.  The fact that so many stopped gave me faith in human<br/>\nbeings--they cared too.<br/>\n<br/>\nAs a fairly staunch atheist I startled someone who evoked god.  I wasn&#39;t<br/>\nlooking for a reward from god, or even thinking prayer would help--I really<br/>\nwanted if not to give help, then just to introduce the idea someone cared<br/>\nenough to stop.  So rules/conventions are very odd things.  I am sure if I<br/>\nstripped naked and casually sauntered down the street &quot;a punishment&quot; for<br/>\nthat social convention, which is also a law would bring punishment and I&#39;d<br/>\nbe arrested/fined or police would give me a warning:)<br/>\n<br/>\nSo conventions, practises and rules are very confusing.<br/>\n<br/>\nMarina<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Rules and Principles","postDate":"1268966533","msgId":52153,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzODkwMC45OTQwMS5xbUB3ZWI4MTUwNi5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PGhudWx1YythN2tnQGVHcm91cHMuY29tPg==","referencesHeader":"PGhudWx1YythN2tnQGVHcm91cHMuY29tPg=="},"prevInTopic":52152,"nextInTopic":52154,"prevInTime":52152,"nextInTime":52154,"topicId":52141,"numMessagesInTopic":0,"msgSnippet":"If it is  a rule then there will be some kind of punishing/consequence. Even if its not the first thing done. MD plays Roblox ( an online multiplayer game) and","messageBody":"<div id=\"ygrps-yiv-1982386073\">If it is  a rule then there will be some kind of punishing/consequence. Even if <br/>\nits not the first thing done.<br/>\nMD plays Roblox ( an online multiplayer game) and a couple years ago he <br/>\nused words that he could not while playing.<br/>\nYou cannot use words like F##K ( swearing) and people can report you and you can get banned.<br/>\nHe got reported and ROblox sent him a letter asking him to not do it again or he would be suspended or even banned<br/>\nindefinitely.<br/>\nIts under rules and guidelines and it states what is going to be the done if the person does not follow them<br/>\n (  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.roblox.com/Help/Builderman.aspx\">http://www.roblox.com/Help/Builderman.aspx</a> )<br/>\n<br/>\n<br/>\nIf I had a rule in my house: No swearing then how would it play if one of my children would swear?<br/>\n<br/>\nI don&#39;t have that rule but I have asked MD not to use swearing in front of other parents,  in public or in front of his grandparents.<br/>\nI have explained why to him.<br/>\nI know plenty of kids that have that rule at home and they still do it or are sneaky about it.<br/>\nTHere has been only one time he used it in public, he was mad and said it to me ( That F**Ked  car) but there were<br/>\npeople around and he was not really aware how loud he was.<br/>\nI talked to him when he calmed down and he apologized for saying it. <br/>\nI did not punish him and I did not create a consequence for it.<br/>\nI have told him that most parents  would not let their kids play with him if they heard him swear around them.<br/>\nThat could be the consequence for him if he chooses to swear in front of them.<br/>\nI also explained that people are offended by curse words and some could feel hurt even if he did not mean to hurt them.<br/>\n<br/>\n<br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n <br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":294520986,"authorName":"Joanna","from":"&quot;Joanna&quot; &lt;ridingmom@...&gt;","profile":"ridingmom1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Rules and Principles","postDate":"1268964108","msgId":52152,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhudWx1YythN2tnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDYwNDI3NS4yMTk5Ni5xbUB3ZWI4MTUwNy5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":52151,"nextInTopic":52153,"prevInTime":52151,"nextInTime":52153,"topicId":52141,"numMessagesInTopic":0,"msgSnippet":"... Well I think it depends on the understanding of the group--whether it was it a rule or was it a guideline.  And the patience level of the group, and how","messageBody":"<div id=\"ygrps-yiv-1502867976\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; But what if the mom still keeps bringing toys to park day ? then what?<br/>\n<br/>\n </span></blockquote>Well I think it depends on the understanding of the group--whether it was it a rule or was it a guideline.  And the patience level of the group, and how disruptive, etc.  If it was a hard and fast rule that everyone has agreed upon that one family refuses to follow, then they may/should be asked to leave the park day.  If it&#39;s a guideline, then there&#39;s more room for dithering.  &lt;g&gt;  <br/>\n<br/>\nBut in either case, &quot;enforcing&quot; the rule doesn&#39;t need to be the first, second, or even third thing that the group tries.  Or it could be if the family is obnoxious.  &lt;g&gt;<br/>\n<br/>\nJoanna<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; Alex Polikowsky<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n&gt;  <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; _,_._,___ <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Rules and Principles","postDate":"1268963228","msgId":52151,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYwNDI3NS4yMTk5Ni5xbUB3ZWI4MTUwNy5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PDEzOEY4NUZELUEwQzYtNDY2Ny1BRDk2LURBMzlFREJERUIxNUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGhudTFocCtiaTliQGVHcm91cHMuY29tPiA8MTM4Rjg1RkQtQTBDNi00NjY3LUFEOTYtREEzOUVEQkRFQjE1QFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":52150,"nextInTopic":52152,"prevInTime":52150,"nextInTime":52152,"topicId":52141,"numMessagesInTopic":0,"msgSnippet":"But what if the mom still keeps bringing toys to park day ? then what? Alex Polikowsky http://polykow.blogspot.com/ ","messageBody":"<div id=\"ygrps-yiv-1202120807\">But what if the mom still keeps bringing toys to park day ? then what?<br/>\n<br/>\n<br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n <br/>\n<br/>\n<br/>\n<br/>\n_,_._,___ <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Rules and Principles","postDate":"1268962610","msgId":52150,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzOEY4NUZELUEwQzYtNDY2Ny1BRDk2LURBMzlFREJERUIxNUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhudTFocCtiaTliQGVHcm91cHMuY29tPg==","referencesHeader":"PGhudTFocCtiaTliQGVHcm91cHMuY29tPg=="},"prevInTopic":52148,"nextInTopic":52151,"prevInTime":52149,"nextInTime":52151,"topicId":52141,"numMessagesInTopic":0,"msgSnippet":"In error, I responded just to Joanna instead of the list, but she was kind enough to send it to me and say hey... ... [Non-text portions of this message have","messageBody":"<div id=\"ygrps-yiv-1271980893\">In error, I responded just to Joanna instead of the list, but she was  <br/>\nkind enough to send it to me and say &quot;hey...&quot;<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; On Mar 18, 2010, at 2:08 PM, Sandra Dodd wrote:<br/>\n&gt;<br/>\n&gt;&gt; -=-&quot;Punishment&quot; doesn&#39;t need to be the first step if a rule is  <br/>\n&gt;&gt; broken. For instance, if there is a rule at parkday not to bring  <br/>\n&gt;&gt; any personal toys, and a family consistently brings them, causing  <br/>\n&gt;&gt; arguments about their use, then the group leader may have a private  <br/>\n&gt;&gt; conversation asking for the rule to be respected. -=-<br/>\n&gt;&gt;<br/>\n&gt;&gt; That&#39;s a good point.  I&#39;ve been in and around those kinds of  <br/>\n&gt;&gt; situations, where someone knows what the others expect and have  <br/>\n&gt;&gt; requested and go &quot;la la la&quot;ing along anyway.  Some people have a  <br/>\n&gt;&gt; charming cluelessness to them.  Some, not so charming.<br/>\n&gt;&gt;<br/>\n&gt;&gt; -=-Most people would not consider a private conversation a  <br/>\n&gt;&gt; punishment.-=-<br/>\n&gt;&gt;<br/>\n&gt;&gt; And then some people consider a dirty look &quot;violence.&quot; &lt;g&gt;<br/>\n&gt;&gt;<br/>\n&gt;&gt; I liked Joanna&#39;s note.  The original question was about a rule made  <br/>\n&gt;&gt; by a mom for kids.  I don&#39;t want to be too particular, because  <br/>\n&gt;&gt; there must be something in common for rules to be rules (definition- <br/>\n&gt;&gt; wise).<br/>\n&gt;&gt;<br/>\n&gt;&gt; Sandra<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":294520986,"authorName":"Joanna","from":"&quot;Joanna&quot; &lt;ridingmom@...&gt;","profile":"ridingmom1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Rules and Principles","postDate":"1268943225","msgId":52148,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhudTFocCtiaTliQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDdEOUQ5MDBFLUUyOEItNDlDMS05NDQ0LUNFNzVCNkMxNTE2N0BTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":52145,"nextInTopic":52150,"prevInTime":52147,"nextInTime":52149,"topicId":52141,"numMessagesInTopic":0,"msgSnippet":"... I think that if something is set up as strongly as to call it a rule, then there has to be a punishment if it s broken.  Another choice would be to create","messageBody":"<div id=\"ygrps-yiv-914305182\"><blockquote><span title=\"ireply\">&gt; Does a rule have to have a punishment if it&#39;s broken?  <br/>\n<br/>\n </span></blockquote>I think that if something is set up as strongly as to call it a rule, then there has to be a punishment if it&#39;s broken.  Another choice would be to create a guideline, which would be more of a request, or expectation of behavior without a necessary punishment if it&#39;s not followed.  <br/>\n<br/>\nHowever, in a group situation, if guidelines are established, and someone consistently makes different choices, then there will likely be a reaction from the group--but without a rule and stated &quot;punishment&quot; it would likely not look like punishment.  It would probably look more like pressure to behave more in accordance with the guidelines.  And it would be a natural consequence to someone if they consistently chose not to follow stated guidelines that some reaction would occur.  The actual reaction, though, would be something meditated--not natural.  A discussion, a request, banishment from the group, etc.<br/>\n<br/>\nIf there is no punishment to match a rule, then the rule is pointless and ineffective as such.  Or call it something different and understand that people have more acceptable choices available about how to behave.<br/>\n<br/>\nOn the other hand, one could possibly establish a rule and publish the consequences if a rule is broken--and my choice of wording is correct.  &quot;Punishment&quot; doesn&#39;t need to be the first step if a rule is broken.  For instance, if there is a rule at parkday not to bring any personal toys, and a family consistently brings them, causing arguments about their use, then the group leader may have a private conversation asking for the rule to be respected.  Most people would not consider a private conversation a punishment.  Ultimately, however, there would have to be an escalation involved if the rule is to mean anything.  If the family continues their practice, which continues the strife at the park, they may eventually be asked to leave if they refuse to comply with the rule.<br/>\n<br/>\nAnd that brings me back to yes, I think there does have to be punishment connected with a rule, if it is actually a rule--although in practice it may be rarely exercised.<br/>\n<br/>\nJoanna</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Rules and Principles","postDate":"1268934544","msgId":52145,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQ1RThENzYzLTk5NzYtNEZDMi04REUzLTBBN0YyRjFGNEZBQkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDc5YzFkMWI0MTAwMzE4MTAwOGs1YTEwMWJhMW9kNTZmM2VjMGJlMjY2MWE5QG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDdEOUQ5MDBFLUUyOEItNDlDMS05NDQ0LUNFNzVCNkMxNTE2N0BTYW5kcmFkb2RkLmNvbT4gPDc5YzFkMWI0MTAwMzE4MTAwOGs1YTEwMWJhMW9kNTZmM2VjMGJlMjY2MWE5QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":52143,"nextInTopic":52148,"prevInTime":52144,"nextInTime":52146,"topicId":52141,"numMessagesInTopic":0,"msgSnippet":"-=-Given a choice, I try to keep my statements of what will happen if the rule is not followed as close to natural consequences as possible, so it is more of","messageBody":"<div id=\"ygrps-yiv-333303070\">-=-Given a choice, I try to keep my statements of what will happen if  <br/>\nthe rule<br/>\nis not followed as close to natural consequences as possible, so it is  <br/>\nmore<br/>\nof an alert than a rule.-=-<br/>\n<br/>\nWho would give you that choice?<br/>\n(You don&#39;t need to answer that; it&#39;s rhetorical.)<br/>\n<br/>\n&quot;An alert&quot; would be a warning that something was dangerous or  <br/>\nimminent.  Still sounds like a punishment situation.<br/>\n<br/>\n-=-I try to keep my statements of what will happen if the rule<br/>\nis not followed as close to natural consequences as possible-=-<br/>\n<br/>\nThe statement of what will happen can only be an intentional, pre- <br/>\nmeditated response.<br/>\n<br/>\nNatural consequences come from nature, not from people&#39;s statements.<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":326782993,"authorName":"Vidyut Kale","from":"Vidyut Kale &lt;wide.aware@...&gt;","profile":"vidyutgore","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Rules and Principles","postDate":"1268932118","msgId":52143,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc5YzFkMWI0MTAwMzE4MTAwOGs1YTEwMWJhMW9kNTZmM2VjMGJlMjY2MWE5QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDdEOUQ5MDBFLUUyOEItNDlDMS05NDQ0LUNFNzVCNkMxNTE2N0BTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDdEOUQ5MDBFLUUyOEItNDlDMS05NDQ0LUNFNzVCNkMxNTE2N0BTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":52141,"nextInTopic":52145,"prevInTime":52142,"nextInTime":52144,"topicId":52141,"numMessagesInTopic":0,"msgSnippet":"Does a rule have to have a punishment if it s broken? Depends on how it came to be. If it was created by everyone it applies to, it may also work to see the","messageBody":"<div id=\"ygrps-yiv-1439646033\">&quot;Does a rule have to have a punishment if it&#39;s broken?&quot;<br/>\n<br/>\nDepends on how it came to be. If it was created by everyone it applies to,<br/>\nit may also work to see the breaking of the rule as a need to reassess the<br/>\nsituation. This is likely more difficult if the rule applies to people who<br/>\nhad no hand in creating it. Punishments is a rather strong word, but it may<br/>\nbe necessary to have a clear statement of what is likely to happen if it is<br/>\nviolated. That happening may impact the persons breaking it, or the whole<br/>\ngroup, or a specific person.... Generally I have found that the less the<br/>\n&#39;punishments&#39; seem like punishments, the more likely the rules are followed.<br/>\nGiven a choice, I try to keep my statements of what will happen if the rule<br/>\nis not followed as close to natural consequences as possible, so it is more<br/>\nof an alert than a rule.<br/>\n<br/>\nVidyut<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Rules and Principles","postDate":"1268930590","msgId":52141,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdEOUQ5MDBFLUUyOEItNDlDMS05NDQ0LUNFNzVCNkMxNTE2N0BTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":52143,"prevInTime":52140,"nextInTime":52142,"topicId":52141,"numMessagesInTopic":0,"msgSnippet":"On the Monday chat we were talking about rules.  I didn t save the exact wording but there were a couple of questions I d like to put to the group here: Does a","messageBody":"<div id=\"ygrps-yiv-617690757\">On the Monday chat we were talking about rules.  I didn&#39;t save the  <br/>\nexact wording but there were a couple of questions I&#39;d like to put to  <br/>\nthe group here:<br/>\n<br/>\nDoes a rule have to have a punishment if it&#39;s broken?  &quot;Consequence&quot;  <br/>\nwas the question, I think, but I don&#39;t want to confuse punishment and  <br/>\nconsequence.<br/>\n<br/>\nThe regular argument was made that &quot;principle&quot; is just another word  <br/>\nfor &quot;rule.&quot;  I don&#39;t need help to respond to that, but as to the  <br/>\ndefinition of &quot;rule,&quot; ideas before the chat could be useful.<br/>\n<br/>\nI haven&#39;t been announcing chats on this list because they&#39;re of the  <br/>\nmoment, and I like for the archives of this list to be substantial  <br/>\ndiscussion.  Someone asked why I don&#39;t announce them more broadly and  <br/>\nregularly.  There&#39;s a list for announcements, at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/ChatNote/\">http://groups.yahoo.com/group/ChatNote/</a><br/>\n<br/>\nSome people don&#39;t like chats because they move fast and slow typists  <br/>\ncan&#39;t jump in very quickly.  I totally understand that, too.  They&#39;re  <br/>\na particular sort of communication; not the best, but it can be fun.<br/>\n<br/>\n<br/>\nThe next chat:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/chats/rules\">http://sandradodd.com/chats/rules</a><br/>\n(and if you plan to come to this one, please look at that first)<br/>\n<br/>\nI would like to add some chat times, too, so if there are proposals  <br/>\nfor other times that would be good for someone who would definitely  <br/>\ncome to them, let me know.<br/>\n<br/>\ncurrent regular chat times, two per week:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/chats/regular\">http://sandradodd.com/chats/regular</a><br/>\n<br/>\n(The way I remember the chat times is that I wanted to avoid early  <br/>\nMonday and late Friday, so I put them on late Monday and early Friday.)</div>","specialLinks":[]}],"prevTopicId":52269,"nextTopicId":52364}}