{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":149995806,"authorName":"catherine aceto","from":"&quot;catherine aceto&quot; &lt;aceto3@...&gt;","profile":"cat4cat15217","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] sleeping (answer to Amy&#39;s question)","postDate":"1065705929","msgId":82578,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNTIwMWMzOGU2OCRjZjRmNGU5MCQ2NTAyYThjMEAyMDAyZGVza3RvcD4=","referencesHeader":"PDAwMDAwMWMzOGUzNiRjMzI0NzM3MCQzNDAwYThjMEByb2J5bm1hY2hpbmU+"},"prevInTopic":82567,"nextInTopic":0,"prevInTime":82577,"nextInTime":82579,"topicId":82428,"numMessagesInTopic":0,"msgSnippet":"Can you try going without electricity for a week or so in the evening?  I have read theories that the electric lights messes with the seratonin (sp?  right","messageBody":"<div id=\"ygrps-yiv-1211946034\">Can you try going without electricity for a week or so in the evening?  I have read theories that the electric lights messes with the seratonin (sp?  right neurochemical?) production in some susceptible people and messes with the sleep cycle.  Of course, it sounds like she is sleeping a normal number of hours.  But anyway FWIW, the times that we have been camping, my two nightowls got gradually sleepier as it grew dark and were asleep by the time it was fully dark (cuddled with me on a blanket by the campfire -- very sweet).  Also, it could help if your bedroom curtains were open so that she experienced the light growing in the morning (this seems to have less effect on us, but I will toss it out there.). <br/>\n<br/>\nFor us, it also makes a difference when we eat dinner (generally between 8 and midnight). I&#39;ve noticed that my 5 yo is sleepier earlier if we have dinner earlier - which certainly makes a kind of biological sense, although &quot;Dinner&quot; is mostly a social marker -- we are all at the table eating and talking together, as opposed to the individual grazing that we generallydo the rest of the time.   She often eats in the evening before and after &quot;dinner&quot; but these don&#39;t seem to influence sleep as much as the changing time of &#39;dinner&#39; does. <br/>\n<br/>\n Anyway, I&#39;ll throw it out there as a suggestion (and will start being grateful that we are all in sync to be in bed by 1:00 at the latest -- I&#39;ve never been upset by it, but I&#39;ve never really been grateful either! lol) <br/>\n<br/>\n-Cat <br/>\n<br/>\n<br/>\n  Out-of-the-box suggestions welcome, but mostly here we do have<br/>\n  acceptance of the situation, at least on my part, and James is trying<br/>\n  really hard to keep biting his tongue.<br/>\n<br/>\n  Robyn Coburn<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  [Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n        Yahoo! Groups Sponsor <br/>\n       <br/>\n       <br/>\n<br/>\n  &quot;List Posting Policies&quot; are provided in the files area of this group. <br/>\n<br/>\n  To unsubscribe from this send an email to:<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a> <br/>\n<br/>\n  Visit the Unschooling website and message boards: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> <br/>\n<br/>\n  Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"dezignarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] sleeping (answer to Amy&#39;s question)","postDate":"1065684429","msgId":82567,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDAwMWMzOGUzNiRjMzI0NzM3MCQzNDAwYThjMEByb2J5bm1hY2hpbmU+","inReplyToHeader":"PEJIRUxJQkJET0hGSkNFQ05ESEJBQ0VIRUNFQUEubG91aXNhQGJjdG9ubGluZS5jb20+"},"prevInTopic":82491,"nextInTopic":82578,"prevInTime":82566,"nextInTime":82568,"topicId":82428,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1528114404\">&lt;&lt;Last night I fell asleep at about 1 am, Jonathan konked out about an<br/>\nhour<br/>\nlater and Lanora was still on the computer when I woke up this morning<br/>\nat<br/>\n9am.  It works well because Jonathan feels insecure being awake when<br/>\neveryone else is asleep, so Lanora is still up after I&#39;m out.  I miss<br/>\nhaving<br/>\nmore &quot;awake&quot; time together with Lanora but it&#39;s only a phase, an hour<br/>\ntogether before J wakes up is good too.&gt;&gt;<br/>\n<br/>\n <br/>\n<br/>\nOur life is so turned around at the moment because of Jayn&#39;s sleeping.<br/>\nShe will be 4 next week. She was formerly (since the middle of summer I<br/>\nguess) on a kind of round the clock march - her &quot;day&quot; was 26 hours long,<br/>\nversus nature&#39;s 24. Her sleep and wake would shift slowly, until she and<br/>\nI would go to bed at 6am-7am-8am. Then she would suddenly flip flop and<br/>\ninstead of her 2-3hour nap in the middle of her &quot;afternoon&quot; she would go<br/>\nto bed and then get up at 7am. Then the slow march would begin again. I<br/>\nprefer to stay up with her because otherwise she would be spending the<br/>\nmajority of her wide-awake and full of questions time (her &quot;evening&quot;)<br/>\nalone & lonely, she gets hungry, and I miss out on being with her.<br/>\nSometimes dh has taken the morning shift, as he is an<br/>\nearly-riser/nap-in-the-afternoon-if-possible guy. <br/>\n<br/>\nFor the last month, however, to his and my dismay, she has stalled in<br/>\nthe stay up all night place. If left alone she gets up at 4pm. Usually<br/>\nnot hungry for a couple of hours. Dinner at 8-9pm is her brunch. May nap<br/>\nas early as 11 or 12 with snack of nursing, but often stays up, partly<br/>\nbecause she has gotten less exercise. Wakes between 1-2am, usually<br/>\nhungry, and then stays awake for 7 hours after she awakens - and here is<br/>\na crucial point - regardless of whether she napped for 20 minutes or 3<br/>\nhours. Sleeps a good solid 8 hours and gets up at .4pm. I have found<br/>\nthat the only way to make any change is literally to get her up and<br/>\nimmediately out the door to some activity. Her dance class is at 1pm,<br/>\nher ice-skating even earlier at 11.55am. However she pulls it back into<br/>\na longer nap to make up for the lost 4 hours. I am very tired and grumpy<br/>\nby 3-4am, and often fall asleep on the couch with her watching tv (see<br/>\nother email about tv shows). DH is staying up later and later just for<br/>\nthe sake of being around us, and is suffering consequent grumps, because<br/>\nhe still is getting up earlier than us around 10am or so. Sometimes I<br/>\ncan&#39;t sleep and get up &quot;early&quot; at noon or 1pm also, but still with the<br/>\nexpectation of being up until 6-7-8am the next morning. I have also<br/>\ntried:<br/>\n<br/>\n*disturbing her nap to make the 7 hour gap to bedtime start earlier -<br/>\nresult: negative &quot;I need more sleep&quot; - Boy does she ever like to sleep<br/>\nwhen she likes to sleep. Sample conversation - DH: &quot;Are you going to let<br/>\nher sleep now?&quot; Me: &quot;Be my guest&quot;.5 minutes later DH: &quot;I guess she<br/>\nreally wants to sleep&quot; ;<br/>\n<br/>\n*toss her in the tub to awaken her rather than have a nap (Not literal<br/>\ntoss of course) - result: her nap starts later, and creates a worsening<br/>\nsituation for sleep deprived mother, although she is usually fine. Or<br/>\nshe just forgoes the nap part that day and still goes to sleep for the<br/>\nlong sleep at 6am;<br/>\n<br/>\n*Tiring her out - eg today at the park - result - usually extends<br/>\nnaptime by starting earlier, sometimes, oh joy, goes to bed earlier but<br/>\nstill stays asleep until 4pm unless dragged out - see earlier note about<br/>\nattempting to awaken. Unfortunately, the going out often seems to result<br/>\nin coming home in the car just when a nap would be least helpful -<br/>\nnaturally Jayn loves to sleep in the car.<br/>\n<br/>\nIt is so distressing because in terms of the number of hours in her day,<br/>\nit would seem to be at 24 like everyone else. I wish she could have done<br/>\nher flip around to reasonably ordinary hours and *then* slowed her<br/>\ninternal clock. When she was little, we used to go to bed between 11 and<br/>\n12 and get up at 9-10, unless needing to get out earlier. DH used to<br/>\ncomplain that 11am was late for his breakfast - ah the good old days. We<br/>\nare missing out on doing things as a family to a great degree (upsets<br/>\ndh) and it is causing me distress by being tired and grumpier than I<br/>\nneed to be. Other than in reaction to me grumping at her, Jayn is fine,<br/>\ngrowing taller very fast, doing lots of art projects and indoor stuff,<br/>\nand seeing her friends for playdates that start around 2-3pm, and<br/>\nlargely willing to get up and out for scheduled events. On the major<br/>\nplus side, she has been still sleeping when the obnoxious neighbor has<br/>\ncome around looking to play a couple of times, so &quot;it is an ill wind<br/>\nthat brings no good at all&quot;. <br/>\n<br/>\nOut-of-the-box suggestions welcome, but mostly here we do have<br/>\nacceptance of the situation, at least on my part, and James is trying<br/>\nreally hard to keep biting his tongue.<br/>\n<br/>\nRobyn Coburn<br/>\n<br/>\n <br/>\n<br/>\n <br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":143939629,"authorName":"Kris","from":"&quot;Kris&quot; &lt;louisa@...&gt;","profile":"louisam1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] sleeping (answer to Amy&#39;s question)","postDate":"1065642481","msgId":82491,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJIRUxJQkJET0hGSkNFQ05ESEJBQ0VIRUNFQUEubG91aXNhQGJjdG9ubGluZS5jb20+","inReplyToHeader":"PGMuMTljMDgzOGMuMmNiNTBlZDZAYW9sLmNvbT4="},"prevInTopic":82441,"nextInTopic":82567,"prevInTime":82490,"nextInTime":82492,"topicId":82428,"numMessagesInTopic":0,"msgSnippet":"Last night I fell asleep at about 1 am, Jonathan konked out about an hour later and Lanora was still on the computer when I woke up this morning at 9am.  It","messageBody":"<div id=\"ygrps-yiv-244010226\">Last night I fell asleep at about 1 am, Jonathan konked out about an hour<br/>\nlater and Lanora was still on the computer when I woke up this morning at<br/>\n9am.  It works well because Jonathan feels insecure being awake when<br/>\neveryone else is asleep, so Lanora is still up after I&#39;m out.  I miss having<br/>\nmore &quot;awake&quot; time together with Lanora but it&#39;s only a phase, an hour<br/>\ntogether before J wakes up is good too.<br/>\n<br/>\nThis seems to be a regular schedule for us right now but it seems to change<br/>\nand shift, no rhyme or reason.  Lanora&#39;s friends refer to her as &quot;Vampira&quot;,<br/>\nshe makes jokes about &quot;THE LIGHT!&quot;  while hissing in mock fear.<br/>\n<br/>\nHaving bed times and trying to enforce them caused more unhappiness and<br/>\nanger than I care to remember.  I can hear my mother&#39;s voice in my head<br/>\nsometimes, &quot;The day is already gone, you&#39;ve slept it away!&quot; but I don&#39;t let<br/>\nit reverberate out my mouth to the kids.  Some people ask me about it,<br/>\nwondering how kids can function with these hours, I say, &quot;They get enough<br/>\nsleep and, for me, that&#39;s all that matters.&quot;<br/>\n<br/>\nKris</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] sleeping (answer to Amy&#39;s question)","postDate":"1065596118","msgId":82441,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGMuMTljMDgzOGMuMmNiNTBlZDZAYW9sLmNvbT4="},"prevInTopic":82434,"nextInTopic":82491,"prevInTime":82440,"nextInTime":82442,"topicId":82428,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/7/03 11:02:49 PM, HaHaMommy@aol.com writes: ","messageBody":"<div id=\"ygrps-yiv-1377633375\">In a message dated 10/7/03 11:02:49 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HaHaMommy@...\">HaHaMommy@...</a> writes:<br/>\n<br/>\n&lt;&lt; It warms my heart to know you&#39;ve made reforms in your style.  &gt;&gt;<br/>\n<br/>\nHey, I found a rudimentary chore chart a few months ago.  We tried about five <br/>\nyears ago to have daily things.  It was &quot;friendly,&quot; and had things like &quot;play <br/>\nwith the dog&quot; and &quot;put twenty things away&quot; and stuff, but it was a chart, and <br/>\nit never worked, and we didn&#39;t try long after it was obviously more <br/>\nirritation that it was worth.<br/>\n<br/>\nWe had food freedom and bedtime freedom before we considered homeschooling.  <br/>\nWe were quick to let TV be freeer than most of our friends.  Kirby was a big <br/>\nNinja Turtle fan and we watched it to see if we wanted to let him watch it (I <br/>\nthink he was three), and we laughed and decided the thing it glorified most was <br/>\nJapanese management theory.<br/>\n<br/>\nThen came unschooling (I didn&#39;t pass through curriculum, because I knew two <br/>\nunschooling families) and I guess last and lately came the change of attitude <br/>\nabout housework, thanks to things others wrote at www.unschooling.com!<br/>\n<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":4335759,"authorName":"HaHaMommy@aol.com","from":"HaHaMommy@...","profile":"dianajenner","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] sleeping (answer to Amy&#39;s question)","postDate":"1065589291","msgId":82434,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMxLjNlZTMzYmYyLjJjYjRmNDJiQGFvbC5jb20+"},"prevInTopic":82428,"nextInTopic":82441,"prevInTime":82433,"nextInTime":82435,"topicId":82428,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10-7-2003 10:39:55 PM Mountain Daylight Time, SandraDodd@aol.com writes: We used to have rules:  Everybody asleep by 5:00 a.m.  I made that","messageBody":"<div id=\"ygrps-yiv-939597089\">In a message dated 10-7-2003 10:39:55 PM Mountain Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> writes:<br/>\nWe used to have rules:  Everybody asleep by 5:00 <br/>\na.m.  I made that rule because my husband would grump if a kid was up when he <br/>\nwent to work.  Grump at me, not the kid.  Then after a while I mentioned to <br/>\nhim that they were supposed to be in bed before he went to work, and he said <br/>\n&quot;Why?&quot;  I guess over a few weeks or months he had decided it wasn&#39;t so bad, them <br/>\nbeing up playing on the computer when there was no competition to get on it.<br/>\n<br/>\nFor a while we had a policy of &quot;get up by noon,&quot; and that too was my hoping <br/>\nto keep my husband from chanelling his mother at us.   But now we have &quot;be <br/>\nquiet until noon if people are sleeping.  At noon it&#39;s okay to play music or <br/>\nvideos or to dance around or sing.  If people are woken up after noon, that&#39;s fair <br/>\nplay. <br/>\n**************************<br/>\nIt warms my heart to know you&#39;ve made reforms in your style.  Sometimes I <br/>\njust think you were born *this* mom, forgetting that you had to journey to get <br/>\nthere too!  Thanks for the inspiration!  &lt;bg&gt;<br/>\n<br/>\ndiana,<br/>\nThe wackiest widow westriver...<br/>\n&quot;You can follow your book and your map of wars, but I&#39;ll go and follow my <br/>\nkids.&quot; -- Woody Guthrie<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"sleeping (answer to Amy&#39;s question)","postDate":"1065587911","msgId":82428,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQwLjM1NGNhMzA0LjJjYjRlZWM3QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":82434,"prevInTime":82427,"nextInTime":82429,"topicId":82428,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/7/03 9:26:52 PM, arcarpenter@cs.com writes: ","messageBody":"<div id=\"ygrps-yiv-675619157\">In a message dated 10/7/03 9:26:52 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:arcarpenter@...\">arcarpenter@...</a> writes:<br/>\n<br/>\n&lt;&lt; As far as bedtime goes, do most of you just let your kids sleep when <br/>\nthey&#39;re <br/>\ntired?  (Gee, it sounds so sensible when I put it that way. &lt;g&gt;)  It&#39;s a <br/>\nbeautiful night and I love the idea of Fisher being able to enjoy it with me <br/>\n(I&#39;m a <br/>\nnight walker) . . . but I also get kind of an icky feeling when we get in the <br/>\nhabit of sleeping late in the morning.  I hate to miss the beautiful early <br/>\nmorning hours, and I guess years of socialization has taught me to feel lazy <br/>\nwhen I (or my son) sleep in. &gt;&gt;<br/>\n<br/>\nDarn that socialization.<br/>\n<br/>\nJust earlier this evening Holly was telling me a story about an Arthur <br/>\nepisode in which Muffy, whose dad sells cars (so they&#39;re one of the richest families <br/>\nin town), had rented a haunted house for Halloween--a REAL house--and the <br/>\nkids were in there telling scary stories, and then &quot;at midnight or 9:00 or <br/>\nwhenever they were supposed to go to bed...&quot; and she continued on with the story.<br/>\n<br/>\nWhen we only had Kirby, and then Kirby and Marty (2.5 years apart), people <br/>\nwould ask us &quot;When does he go to bed?&quot;  and our standard answer was &quot;about half <br/>\nan hour after he goes to sleep.&quot;<br/>\n<br/>\nWe&#39;d get them in pajamas and cleaned up early evening, if we were home, but <br/>\nwe did&#39;nt &quot;put them in bed.&quot; If someone got sleepy, I might go lie down and <br/>\nread to him, or put on his favorite tape.  Usually they&#39;d fall asleep in my lap <br/>\nor their dad&#39;s.<br/>\n<br/>\nKirby was driven to sleep for a while.   It never bothered them to wake up in <br/>\nthe bed having fallen asleep elsewhere.  That was standard for them.<br/>\n<br/>\n&lt;&lt; It&#39;s a beautiful night and I love the idea of Fisher being able to enjoy <br/>\nit with me (I&#39;m a <br/>\nnight walker) &gt;&gt;<br/>\n<br/>\nNighttime is great.  Cool, quiet, the moon...<br/>\n<br/>\nDid you see Late Night Learning?  <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/latenightlearning\">http://sandradodd.com/latenightlearning</a><br/>\n<br/>\n&lt;&lt; It&#39;s a beautiful night and I love the idea of Fisher being able to enjoy <br/>\nit with me (I&#39;m a <br/>\nnight walker) &gt;&gt;<br/>\n<br/>\nI rarely miss the early morning myself, but my advantage is that I can <br/>\nusually do with six hours of sleep.  I go through phases (short ones) of sleeping <br/>\nlonger, but &quot;long&quot; for me is nine hours.  When the kids were little they would <br/>\ncome and play on my bed if I was still asleep when they woke up (unless I was <br/>\nalready in their bed).<br/>\n<br/>\nIt bothered me at first.  We used to have rules:  Everybody asleep by 5:00 <br/>\na.m.  I made that rule because my husband would grump if a kid was up when he <br/>\nwent to work.  Grump at me, not the kid.  Then after a while I mentioned to him <br/>\nthat they were supposed to be in bed before he went to work, and he said <br/>\n&quot;Why?&quot;  I guess over a few weeks or months he had decided it wasn&#39;t so bad, them <br/>\nbeing up playing on the computer when there was no competition to get on it.<br/>\n<br/>\nFor a while we had a policy of &quot;get up by noon,&quot; and that too was my hoping <br/>\nto keep my husband from chanelling his mother at us.   But now we have &quot;be <br/>\nquiet until noon if people are sleeping.  At noon it&#39;s okay to play music or <br/>\nvideos or to dance around or sing.  If people are woken up after noon, that&#39;s fair <br/>\nplay.  <br/>\n<br/>\nTwice in the past year Kirby has done an all-nighter.  One was a sci-fi <br/>\nconvention, and one was a LAN party.  Both times he stayed up all Saturday night, <br/>\nwent to work or did whatever he needed to do on Sunday, and crashed out early <br/>\nSunday night, sleeping until 11:00 or so Monday, and was all recovered.<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":82496,"nextTopicId":82580}}