{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":141102765,"authorName":"Mary","from":"&quot;Mary&quot; &lt;mummy124@...&gt;","profile":"mummyone24","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"reading and dyslexia","postDate":"1047839399","msgId":61224,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMzAwMWMyZWJlYSQwZDIxZjhjMCQ2MTAxYThjMEBsYXVuY2htb2RlbS5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":61223,"nextInTime":61225,"topicId":61224,"numMessagesInTopic":0,"msgSnippet":"Joseph and Sierra both had trouble with those letters also. They even had a hard time with lower case Q because some books didn t even have a little tail on","messageBody":"<div id=\"ygrps-yiv-1899075783\">Joseph and Sierra both had trouble with those letters also. They even had a hard time with lower case Q because some books didn&#39;t even have a little tail on the bottom and it looked the same as a P but turned the other way. So between B, D, P and Q, it was confusing to them. This was before they were reading much. Just words really. So when I would write something for them, I would print in all caps which I always do anyway unless I force myself to do it right. &lt;bg&gt; That way they always knew what the letter was. I never printed in smaller case and the kids picked up knowing what those letters were anyway. When they would write something out, I would just mention that something was backwards. Never made a big deal out of it and they never were really frustrated with it either. If you don&#39;t see it as a big deal, they won&#39;t either. If they struggled with something, I never went through how they could remember or the differences, I would just tell them what the letter or word was. Same as when they asked me what a word was, I never made them sound it out. I use to hate that as a child. Just tell me what the freakin word is. So that&#39;s what I do with my kids. Somewhere along the way they learned. <br/>\n<br/>\nEvery now and then, Joseph or Sierra will still turn a letter or number around. And when they play Twister, I still have to watch because they get right and left confused sometimes. Mostly Joseph. He&#39;s a lefty and Sierra is a righty so if they try to see what the other is doing, that doesn&#39;t work either!!<br/>\n<br/>\nMy mom was an elementary teacher and also a nurse and she told me from the very beginning that it was very normal for kids to do that. Just keep telling your son it&#39;s no big deal and he will get the hang of it. All kids do.<br/>\n<br/>\nMary B<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":61194,"nextTopicId":61166}}