{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":223803785,"authorName":"Su Penn","from":"Su Penn &lt;su@...&gt;","profile":"marie101365","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"2 Unschooling Stories","postDate":"1241217120","msgId":44595,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQ1MTE0RDVCLTk2QzItNDk3Qy05NjUyLTdBQjU1OUVBRTJEOUBzdXBlbm4uY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":44594,"nextInTime":44596,"topicId":44595,"numMessagesInTopic":0,"msgSnippet":"One story about saying No and one story about food. A few weeks ago, the kids and I were running errands. We stopped at McDonald s for a drink, and the boys","messageBody":"<div id=\"ygrps-yiv-855333138\">One story about saying No and one story about food.<br/>\n<br/>\nA few weeks ago, the kids and I were running errands. We stopped at  <br/>\nMcDonald&#39;s for a drink, and the boys also got toys. They were  <br/>\nSpiderman toys, and the boys were very excited about them. They were  <br/>\ntalking together in the back of the van, comparing what they&#39;d gotten,  <br/>\nand so on. After a few minutes, Eric, 7, asked in a very pleasant,  <br/>\ninquiring voice, &quot;Mom, do you think we could stop at a different  <br/>\nMcDonald&#39;s after we go to Sam&#39;s Club? Carl and I really want some more  <br/>\nof these, and a different place might have different ones.&quot;<br/>\n<br/>\nI thought for a minute about time, money, and when the baby might need  <br/>\nher nap, and said, &quot;Sure, I don&#39;t see any reason we can&#39;t do that.&quot;<br/>\n<br/>\nThe boys were pleased.<br/>\n<br/>\nAfter a minute, I said, &quot;By the way, Eric, I really appreciated the  <br/>\nnice way you asked me about that.&quot;<br/>\n<br/>\nEric said, &quot;Well, I knew that you&#39;d only say No if you had a good  <br/>\nreason.&quot;<br/>\n<br/>\nNow, in case you think Eric is some kind of fantasy prodigy child and  <br/>\nnothing like this could ever happen with yours, I will tell you that  <br/>\nit is often very hard for him to hear No. He can get so fixated on  <br/>\nwhat he wants that it becomes very hard, if not impossible, for him to  <br/>\nsee or accept alternatives or delays. Asking for things can be very  <br/>\nfraught for him because even before he asks he&#39;s already sort of  <br/>\nthinking to himself, &quot;What if they say No? I can&#39;t handled it! I have  <br/>\nto have this!&quot; (though probably not in so many words).<br/>\n<br/>\nSo it&#39;s a big thing for _him_ to think it through ahead of time and  <br/>\nget to a place where, before he even asks, he&#39;s OK hearing either Yes  <br/>\nor No. But it&#39;s a big thing for _me_ because moments like this make me  <br/>\nthink, &quot;It&#39;s working! It&#39;s getting through! The way we are parenting  <br/>\nreally does make a difference!&quot; He can put it into so many words!<br/>\n<br/>\nStory 2 is from today.<br/>\n<br/>\nWe stopped at Meijer to get me some new underwear. A few days ago,  <br/>\nCarl (5) had been wishing for lollipops and I promised we would get  <br/>\nhim some the next time we were at Meijer. So, after I picked out my  <br/>\nunderwear, we headed over to the bulk candy aisle. On the way there,  <br/>\nwe had this conversation:<br/>\n<br/>\nEric: Can I get something other than lollipops?<br/>\n<br/>\nMe: Sure.<br/>\n<br/>\nCarl: Can I get lollipops, AND something other than lollipops?<br/>\n<br/>\nMe: Sure.<br/>\n<br/>\nCarl: Just two things?<br/>\n<br/>\nMe: No, you can get anything you want.<br/>\n<br/>\nSo we go to the bulk candy aisle, and, as the boys are shopping and  <br/>\nchoosing things, they ask questions and I say again more than once,  <br/>\n&quot;Whatever you want is OK. Yes, you can also get that.&quot; and so on.<br/>\n<br/>\nHere is what my two non-food-restricted boys chose when taken to a  <br/>\ncandy aisle full of bins they could grab from and told they could get  <br/>\nanything they wanted, and as much as they wanted:<br/>\n<br/>\nCarl: six suckers. One handful (about 5) gumdrop candies. 4 Willy  <br/>\nWonka chewy candies, each about 1&quot; square. [The bag of Willy Wonka  <br/>\ncandies was so light it didn&#39;t register on the scale at the checkout.]<br/>\n<br/>\nEric: double handful of chocolate coins. About a half dozen peppermint  <br/>\nhard candies. And, OK, he did pretty well stuff a bag with Voortman  <br/>\nVanilla Wafers, but he especially loves those.<br/>\n<br/>\nThen they talked about whether they should get Yehva, 21 months,  <br/>\nsomething of her own or just share with her. A conversation about what  <br/>\nYehva especially likes led to them deciding to get her some chocolate  <br/>\ncoins of her very own. &quot;But we can still share the other things with  <br/>\nher,&quot; Carl said.<br/>\n<br/>\nAt one point, I said mock-grumpily, &quot;Oh, sure, you guys get candy and  <br/>\nI get _underwear_.&quot;<br/>\n<br/>\nBoth boys immediately said, &quot;I&#39;ll share mine with you, Mom.&quot;<br/>\n<br/>\nYet another story that most of my friends would either not believe, or  <br/>\nchalk up to my kids being some kind of mutant non-sugar-loving strain  <br/>\nof humanity. But stuff like this happens all the time.<br/>\n<br/>\nSu<br/>\n<br/>\nmom of Eric, 7 (but only for 3 more weeks); Carl, 5; Yehva, 21 months</div>","specialLinks":[]}],"prevTopicId":44589,"nextTopicId":44349}}