{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":8,"messages":[{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Does Radical Unschooling always result in &quot;Good&quot; children?","postDate":"1262119290","msgId":49295,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1MTE4NC42NzY5OC5xbUB3ZWIxMTA0MTUubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PGhoYm5nais3NHJhQGVHcm91cHMuY29tPg==","referencesHeader":"PGhoYm5nais3NHJhQGVHcm91cHMuY29tPg=="},"prevInTopic":49294,"nextInTopic":49296,"prevInTime":49294,"nextInTime":49296,"topicId":49273,"numMessagesInTopic":0,"msgSnippet":"***We hear on this list, and others, and Sandra s website, and many other RUers websites, etc about all the great kids who have come through this lifestyle.","messageBody":"<div id=\"ygrps-yiv-453603262\">***We hear on this list, and others, and Sandra&#39;s website, and many other RUers websites, etc about all the great kids who have come through this lifestyle. And that is really wonderful. But critics could come along and say to me, &quot;Sure, the great cases are what&#39;s talked about... but what about the bad cases?&quot;***<br/>\n <br/>\nWhat I find really fascinating about this particular aspect, and I&#39;ve heard it too, is that most people would look at my older daughter and think &quot;bad&quot;, or as one person at a 7-11 said as she walked past, &quot;misguided&quot;.  It&#39;s an image though, one that she loves and lovingly created for herself.  If anyone takes the time to get to know her though, they&#39;d be stunned with her honesty and empathy and her altogether sweetness.  She smart and creative and deeply compassionate, but she gets kicked out of malls and security gaurds follow her in stores to make sure she doesn&#39;t steal anything.<br/>\n <br/>\nShe&#39;s admitted to stealing a gatorade at 2 am at a grocery store near our house, on her way home from playing around in the middle of the night with a friend and getting very thirsty.  They stopped at the store thinking that it was a 24 hr store and it wasn&#39;t and they had a huge pile of gatorades sitting outside of the store with no cameras pointing towards them.  I wouldn&#39;t have done that, even if I was very thirsty.  Still though, she&#39;s 15 and has never stolen anything else ever before, so if gatorade is the worst offense, then I&#39;m ok with that!  We know kids that regularly steal from stores and other people.  It&#39;s a huge problem in public schools, so much so that it&#39;s a worse offense than assaulting another student.  My mother in law, who has worked in the public schools for many years will attest to that, we just had a conversation about it the other day.  My daughter knows stealing is wrong, there was no need to lecture about it or tell her<br/>\n even, she already knows and I think part of why she told me about it was to get it off her conscience.<br/>\n<br/>\n***So, I&#39;m curious. Are there any Radically Unschooled children, who have grown up, who are not &#39;good&#39; people? Who cheat, steal, treat people badly, lie, etc...? ***<br/>\n <br/>\nI see both of my kids making good choices among many terrible ones all the time.  I truly believe that because their parents believe in them and their power to do good and be good, that they strive for that.  They mess up all the time, just like I do, and just like their dad does.  Who doesn&#39;t?  There are no gaurantees that any person will grow up without ever doing something terrible that they regret, or something stupid that they get caught doing.  <br/>\n <br/>\nI have a cousin who is older than I am who was a great kid, happy and smart, he got married and they were very happy until, while working he was severely electrocuted.  It changed the very person he was.  Everything about him changed because of that one accident.  He lives in pain all the time, his bones break easily, he lost is ability to think clearly, he lost his wife because he couldn&#39;t cope as a decent person and he barely keeps jobs.  Nobody could have perdicted that outcome.  He wasn&#39;t unschooled, but even unschooled kids are people, susceptible to the unpredictable things in life.<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":39016202,"authorName":"tealzabet","from":"&quot;tealzabet&quot; &lt;Tealzabet@...&gt;","profile":"tealzabet","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Holiday aftermath meets Radical Unschooled &quot;Good&quot; children?","postDate":"1262119149","msgId":49296,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhoZHBkZCtobmI4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDNFNkE2RUQwLUZCNEMtNDdFMy1CODE1LUMzRjA1RkQzMUIyOEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":49295,"nextInTopic":0,"prevInTime":49295,"nextInTime":49297,"topicId":49273,"numMessagesInTopic":0,"msgSnippet":"One of my most important examples in parenting/life discipline vs good children was when my cousin became addicted to pharms one summer --we can play the","messageBody":"<div id=\"ygrps-yiv-461086497\">One of my most important examples in parenting/life discipline vs &#39;good children&#39; was when my cousin became addicted to pharms one summer --we can play the  blame game  on &#39;summer people&#39; or lack of discipline or the new commercial influences in my childhood &#39;artsy back-to-the-land community&#39; that lived semi-off the grid -- but all of that isn&#39;t the point.   He got hooked and stole to feed his newly minted habit --- and then he came home, with a state trooper at the end of the summer --- <br/>\n<br/>\nand he was loved, just loved and cared for on the sofa for several months, with no pressure ----fed and warm inside and out, he began to heal --- while the state sent info pamphlets on control and the bad science of dime store behaviorists (hey I know that world too well, am one lol) and programs for tough love that were thankfully too far travel to for any beaurocrat to push --- and unlike members of many families, he was not punished for his choices and that is a huge difference.<br/>\n<br/>\nHe was loved in a way that he could feel it - and I watched my cousin heal and he is now whole and grown and so is my Aunt&#39;s family because it was never broken --  <br/>\n<br/>\n<br/>\nDo any of us wish that experience for ourselves or those we love? --of course not ---- who knows all the elements that came to play that summer that did not result in similar behaviors in any of his siblings - <br/>\n<br/>\n<br/>\nBut the key element is that there was never any question as to his &#39;goodness&#39; -- and for me that is the heart of RU.<br/>\n<br/>\n  Perhaps the question for me, is not do we break, (children and parents alike) - but how do we heal? ---<br/>\n<br/>\nBest,<br/>\n<br/>\nLiz T</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Does Radical Unschooling always result in &quot;Good&quot; children?","postDate":"1262116329","msgId":49294,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNFNkE2RUQwLUZCNEMtNDdFMy1CODE1LUMzRjA1RkQzMUIyOEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDRCM0EwMTM5LjgwMTA0MDBAdHdjbnkucnIuY29tPg==","referencesHeader":"PGhoYm5nais3NHJhQGVHcm91cHMuY29tPiA8NEIzQTAxMzkuODAxMDQwMEB0d2NueS5yci5jb20+"},"prevInTopic":49293,"nextInTopic":49295,"prevInTime":49293,"nextInTime":49295,"topicId":49273,"numMessagesInTopic":0,"msgSnippet":"-=-Having a teen that people frequently remark on as being a great kid, and who is well recieved and surprises people wherever he goes, seems to me to be a","messageBody":"<div id=\"ygrps-yiv-1391147766\">-=-Having a teen that people<br/>\nfrequently remark on as being a great kid, and who is well recieved and<br/>\nsurprises people wherever he goes, seems to me to be a really good<br/>\nstart- so I am going with it.-=-<br/>\n<br/>\nThat&#39;s a result, though, when the person&#39;s still a teen. &lt;g&gt;<br/>\n<br/>\nIn my life, two of the most frequently remarked upon teens who came  <br/>\nimmediately to mind were severely schooled.  But their parents are  <br/>\n(one of each sets of parents) some of my favorite people EVER, and so  <br/>\nthere must be some natural genetic predisposition to be so awesome I  <br/>\nwould like them for 30 years. &lt;bwg&gt;  And I got Christmas cards from  <br/>\nboth the parents.  And those two boys, last time I saw each, beamed  <br/>\nhuge smiles and said all the charmingest things to me.  They like me,  <br/>\ntoo.  Not unschooling stories.<br/>\n<br/>\n-=-I don&#39;t fool myself that my kids will never make any choices in their<br/>\nlives that could be considered bad, by others, or by them, later. What<br/>\nis different here is that I unfailingly see my kids as good people, who<br/>\nare able to learn and grow from their &quot;mistakes&quot;.-=-<br/>\n<br/>\nI suppose this is a good time to tell the follow-up to Holly&#39;s pudding- <br/>\nwrestling incident.  Was she &quot;a good child&quot; that night?  We knew where  <br/>\nshe was because I helped her find the place, and looked it up again  <br/>\nwhen she was driving around and confused in that neighborhood.  She  <br/>\nhad our car, and we knew it.  She called us when the trouble arose,  <br/>\nand she sat politely (shivering, and embarrassed) while the police  <br/>\nwaited for us to come and get her.  She cried on the way home (she  <br/>\nrode with Keith; I drove the car she had taken there).   The police  <br/>\nweren&#39;t there because people were being great kids, though.  There was  <br/>\ntoo much noise for the neighbors and they discovered a den of pudding  <br/>\n(well, a kiddie pool of pudding) and some underage drinking.<br/>\n<br/>\nWe had to go to re-education class.  Keith was out of town or we both  <br/>\nwould have gone.  Had we both gone, she would&#39;ve been the only kid  <br/>\nthere with both parents in attendance.  There were forms the kids had  <br/>\nto fill out (a questionnaire) and a test to take (not hard) at the  <br/>\nend, and each child was given paper and pencil and told to draw the  <br/>\nmost important person in his or her life.  There were graphs and  <br/>\nstatistics on drug abuse and alcohol consumption.  There were videos  <br/>\nof drug users and their ugly, awful lives.  There was a video of a car  <br/>\nwreck.  There was video of the inside of the new improved boys&#39;  <br/>\ndetention facility.  If that was the new, improved one,the old one  <br/>\nmust have been bad.  (I saw the old one, when my half brother was  <br/>\nthere years ago, 1986 or so.)  Holly teared up a couple of times  <br/>\nduring all that.  Each teen had to go up and show the picture and talk  <br/>\nabout who it was and why that person was important.  Holly drew me.   <br/>\nMost kids drew the parent who was there.  One boy&#39;s drawing was like a  <br/>\nprofessional portrait.  We could have found his mom in a big crowd  <br/>\nwith that image.  Some parents were sweet and gentle with their kids,  <br/>\nthere that night.  Some were aloof and harsh and the parent and kid  <br/>\nignored each other, it seemed, even though they were sitting together.<br/>\n<br/>\nIt was a rough few hours, and Holly leaned on me and held my hand a  <br/>\nlot, and felt awful for causing us to be there.  They had to  <br/>\nunderstand and agree to a deal that said if they didn&#39;t get in trouble  <br/>\nin the next full year or until they were 18, they could request that  <br/>\nthe charges be removed from the public record.<br/>\n<br/>\nDid unschooling fail because I had to go with my kid to a substance  <br/>\nabuse education class provided by the juvenile justice department?<br/>\n<br/>\nI think of it not as an absolute fail or succeed situation, but would  <br/>\nHolly have acted differently toward us (or in the situation, or toward  <br/>\nthe police officers)  if she had been in school all those years rather  <br/>\nthan at home?<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Does Radical Unschooling always result in &quot;Good&quot; children?","postDate":"1262110603","msgId":49288,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMxQ0IxRkJFLTkyOUEtNDZGOS1BRDZCLTVBNTdCNzk3N0I0QUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDRCM0EzQUVCLjMwODAwMDRAbWFjLmNvbT4=","referencesHeader":"PGhoYm5nais3NHJhQGVHcm91cHMuY29tPiA8MjUxMjA5NkQtMzdFQy00Qzg2LUEwNjctRDAxMTcxRDRBMDUwQHZlcml6b24ubmV0PiA8NEIzQTNBRUIuMzA4MDAwNEBtYWMuY29tPg=="},"prevInTopic":49284,"nextInTopic":49293,"prevInTime":49287,"nextInTime":49289,"topicId":49273,"numMessagesInTopic":0,"msgSnippet":"-=-Are there any Radically Unschooled children, who have grown up, who are not good people? Who cheat, steal, treat people badly, lie, etc...?-=- Are there","messageBody":"<div id=\"ygrps-yiv-1921811216\">-=-Are there any Radically Unschooled children, who have grown up, who  <br/>\nare not &#39;good&#39; people? Who cheat, steal, treat people badly, lie,  <br/>\netc...?-=-<br/>\nAre there any parents who become radical unschoolers who are not  <br/>\n&#39;good&#39; people?<br/>\n<br/>\nI think it&#39;s a fantastic question, and Joyce&#39;s answer was so cool I  <br/>\nstuck it here.  Will probably add Pam&#39;s, too.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/guarantee\">http://sandradodd.com/guarantee</a><br/>\n<br/>\nThe background is some blown glass I have, the first photo I took with  <br/>\na new camera some years ago (in case anyone&#39;s wondering).<br/>\n<br/>\nThere are some unschooling parents who are not sterling examples of  <br/>\nintegrity.  So the eternal questions involving nature and nurture  <br/>\napply to unschoolers as much as to anyone, anywhere, any time.<br/>\n<br/>\nIf there is anyone reading there who is unfamiliar with the &quot;nature  <br/>\nvs. nurture&quot; debate, I recommend the movie &quot;Trading Places.&quot;  It stars  <br/>\nDan Aykroyd and Eddie Murphy, backed up by Denholm Elliott as the  <br/>\nbutler (very good character) and Jamie Lee Curtis (25 years ago, VERY  <br/>\npretty and funny).   Two millionaire brothers make a bet about nature  <br/>\nvs. nurture.  They&#39;re played by Don Ameche and Ralph Bellamy.  Those  <br/>\nolder actors have all since died, and they were awesome and famous  <br/>\nwhen they were younger so it&#39;s fun to have seen them all in one movie,  <br/>\ntoo.   And Frank Oz plays a cop (as he played a prison officer in The  <br/>\nBlues Brothers).<br/>\n<br/>\nTo Pam&#39;s list of damaging factors, things that could easily mar a  <br/>\nperson&#39;s confidence and progress, I&#39;d like to add step parents (a by- <br/>\nproduct of divorce, and adoption.   Some step parents are awesome and  <br/>\npractically perfect in every way.  Some adoptions work out glowingly  <br/>\nfor all involved.  Not most.  Some.  Not lots.  Some.<br/>\n<br/>\nSome kids are unschooled their whole lives starting with attachment  <br/>\nparenting and breastfeeding and family bed.  Others are spanked and  <br/>\nyelled at and sent to school and told without school they&#39;ll be  <br/>\nhomeless beggars, or worse.  Then if their parents  switch to  <br/>\nunschooling and start working to make up for that, how long will it  <br/>\ntake for the child to recover from the initial ideas that the parents  <br/>\nwere wrong before and could be wrong again, or maybe that the parents  <br/>\nwere right before and don&#39;t care that the child will be a beggar in  <br/>\nprison.<br/>\n<br/>\nIt&#39;s possible to put all kinds of obstacles in a child&#39;s life, or to  <br/>\nbring all kinds of trouble home.  The question is asked about whether  <br/>\na radical unschooler could turn out bad.    ANY person could turn out  <br/>\nbad, or have a great 30 years and then factors could overwhelm them,  <br/>\nor have a terrible 30 years, and somehow rise above it to become  <br/>\nsaints of some sort.<br/>\n<br/>\nHow many obstacles can a person overcome?  It depends on the person,  <br/>\nlargely.   I can handle a lot of stress, but if I&#39;m pre-loaded with  <br/>\nstress and  deadlines and guests coming, a small thing can seem HUGE  <br/>\nto me in that moment.<br/>\n<br/>\nThis page might be worth looking at too:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/screwitup\">http://sandradodd.com/screwitup</a><br/>\n<br/>\nIf you think of what you could do to make things worse, that creates  <br/>\nan immediate set of what to do to make things better.<br/>\n<br/>\nWhen my boys were little they took swimming lessons and would recite  <br/>\nthe safety reminders in opposite terms:<br/>\nNever swim with a buddy, always swim alone.<br/>\nSwim in a storm.<br/>\nRun by the pool.<br/>\n<br/>\nBecause they could do that, I knew for certain that they did know the  <br/>\nlist.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Does Radical Unschooling always result in &quot;Good&quot; children?","postDate":"1262107371","msgId":49284,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCM0EzQUVCLjMwODAwMDRAbWFjLmNvbT4=","inReplyToHeader":"PDI1MTIwOTZELTM3RUMtNEM4Ni1BMDY3LUQwMTE3MUQ0QTA1MEB2ZXJpem9uLm5ldD4=","referencesHeader":"PGhoYm5nais3NHJhQGVHcm91cHMuY29tPiA8MjUxMjA5NkQtMzdFQy00Qzg2LUEwNjctRDAxMTcxRDRBMDUwQHZlcml6b24ubmV0Pg=="},"prevInTopic":49281,"nextInTopic":49288,"prevInTime":49283,"nextInTime":49285,"topicId":49273,"numMessagesInTopic":0,"msgSnippet":"... Unschooling families have their problems, too, that can lead to their kids having problems. If someone is looking for a guarantee that their kids will","messageBody":"<div id=\"ygrps-yiv-638143414\"><blockquote><span title=\"ireply\">&gt; So, I&#39;m curious. Are there any Radically Unschooled children, who<br/>\n&gt; &gt;  have grown up, who are not &#39;good&#39; people? Who cheat, steal, treat<br/>\n&gt; &gt;  people badly, lie, etc...?<br/>\n&gt;    <br/>\n<br/>\n </span></blockquote>Unschooling families have their problems, too, that can lead to their <br/>\nkids having problems. If someone is looking for a guarantee that their <br/>\nkids will &quot;turn out&quot; great, sorry, but there are no guarantees. First, <br/>\nlife circumstances can throw any family into turmoil. Second, <br/>\nunschooling parents can have their own baggage that impacts their <br/>\nchildren in negative ways.<br/>\n<br/>\nUnlike conventional parenting and conventional schooling, unschooling <br/>\ndoesn&#39;t set kids up to lie, cheat, and steal, though. So, other things <br/>\nequal, I like our odds.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":220041937,"authorName":"Heather","from":"Heather &lt;hbmccarty@...&gt;","profile":"heather13068","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Does Radical Unschooling always result in &quot;Good&quot; children?","postDate":"1262092601","msgId":49293,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCM0EwMTM5LjgwMTA0MDBAdHdjbnkucnIuY29tPg==","inReplyToHeader":"PGhoYm5nais3NHJhQGVHcm91cHMuY29tPg==","referencesHeader":"PGhoYm5nais3NHJhQGVHcm91cHMuY29tPg=="},"prevInTopic":49288,"nextInTopic":49294,"prevInTime":49292,"nextInTime":49294,"topicId":49273,"numMessagesInTopic":0,"msgSnippet":"It does here, so far- my kids are 16.75 and almost 13.  My sister-in-law told me that I was lucky to have such good children. Hers did all the scary bad stuff","messageBody":"<div id=\"ygrps-yiv-752086126\">It does here, so far- my kids are 16.75 and almost 13.  My sister-in-law <br/>\ntold me that I was lucky to have such good children. Hers did all the <br/>\nscary&quot;bad&quot;stuff - teen pregnancy, heroin, drug busts, etc, etc. I think <br/>\nshe is pretty aware that how she parented had something to do with it. <br/>\nShe is raising the grandchild and is trying to do better - though from <br/>\nmore of a strict christian perspective, rather than ignoring. Maybe it <br/>\nis a little better- at least she cares, and has some kind of awareness.<br/>\n<br/>\nI have a cousin who at just 18, was arrested for arson and spent 2 years <br/>\nin jail. He was able to come out, reclaim his life, and has been at MIT <br/>\nlately, and has a new job as a video game programmer, and feels really <br/>\nlucky in that he gets to do things he enjoys every day. His mom never <br/>\nhomeschooled him but had considered it, and was reading Growing Without <br/>\nSchooling- she had all the back issues from the beginning which she gave <br/>\nme. So I see her as a decent parent, though perhaps his dad wasn&#39;t. <br/>\nThere was a lot of intense stuff going on when he was a teen at home.  I <br/>\nthink having her, always believing in him, really helped.<br/>\n<br/>\nI don&#39;t fool myself that my kids will never make any choices in their <br/>\nlives that could be considered bad, by others, or by them, later. What <br/>\nis different here is that I unfailingly see my kids as good people, who <br/>\nare able to learn and grow from their &quot;mistakes&quot;. I believe that it <br/>\nmakes a huge difference, having someone in your life, even one person, <br/>\nwho sees you that way. Who trusts in your inner goodness even if you <br/>\nbehave in ways that are seen as &quot;bad.&quot; Though so far my kids haven&#39;t <br/>\nfelt the need to behave in those ways, not for a long time.<br/>\n<br/>\nThere are no guarantees, no matter what you do, in parenting. You really <br/>\nhave to do what feels right, for now. Really that is all you might have, <br/>\nanyway. Kids don&#39;t always grow up. Whether kids go to school, or not, it <br/>\nis possible that they could grow up and feel confused, or not, or <br/>\nunhappy, or not. I don&#39;t radically unschool for the results, though I <br/>\nthink they will be good, and so far they are. Having a teen that people <br/>\nfrequently remark on as being a great kid, and who is well recieved and <br/>\nsurprises people wherever he goes, seems to me to be a really good <br/>\nstart- so I am going with it.<br/>\n<br/>\nHeather (in NY)</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Does Radical Unschooling always result in &quot;Good&quot; children?","postDate":"1262085321","msgId":49281,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI1MTIwOTZELTM3RUMtNEM4Ni1BMDY3LUQwMTE3MUQ0QTA1MEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGhoYm5nais3NHJhQGVHcm91cHMuY29tPg==","referencesHeader":"PGhoYm5nais3NHJhQGVHcm91cHMuY29tPg=="},"prevInTopic":49273,"nextInTopic":49284,"prevInTime":49280,"nextInTime":49282,"topicId":49273,"numMessagesInTopic":0,"msgSnippet":"... If someone says they ve radically unschooled, have they really? While it s fairly easy to grasp what to let go of to radically unschool, one of the biggest","messageBody":"<div id=\"ygrps-yiv-852924330\">On Dec 28, 2009, at 8:54 PM, shirarocklin wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So, I&#39;m curious. Are there any Radically Unschooled children, who  <br/>\n&gt; have grown up, who are not &#39;good&#39; people? Who cheat, steal, treat  <br/>\n&gt; people badly, lie, etc...?<br/>\n<br/>\n </span></blockquote>If someone says they&#39;ve radically unschooled, have they really?<br/>\n<br/>\nWhile it&#39;s fairly easy to grasp what to let go of to radically  <br/>\nunschool, one of the biggest stumbling blocks is understanding what  <br/>\nto replace it with. Someone who says they&#39;re radically unschooling  <br/>\ncould have let go, but not done the replacing. They could be  <br/>\nunparenting.<br/>\n<br/>\nAnother stumbling block is a parent who doesn&#39;t &quot;get&quot; their kid and  <br/>\ncan&#39;t figure out how to help them.<br/>\n<br/>\nAnd there are other factors: bad biochemistry. Abuse. Divorce (not  <br/>\nmerely the act itself, but everything around it: parents tearing at  <br/>\neach other, the idea that love isn&#39;t unconditional, kids feeling  <br/>\nguilty or abandoned).<br/>\n<br/>\nWhich all sounds like words to cover unschooling&#39;s ass ;-)<br/>\n<br/>\nThe actions you&#39;ve listed are all strategies to get what someone  <br/>\nwants. So the big question is why would someone adopt those  <br/>\nstrategies that hurt people when there are strategies that can help  <br/>\nthem get what they want without hurting others?<br/>\n<br/>\nThere are understandable reasons! If a child feels he can&#39;t get what  <br/>\nhe wants except on his own, cheating and stealing and so on can be  <br/>\ngood strategies. If the child feels like the people around him put  <br/>\ntheir own agendas ahead of his, if they&#39;ve shown they aren&#39;t to be  <br/>\ntrusted to help, if they&#39;ve shown they don&#39;t respect him, why would  <br/>\nhe care to put in the effort not to hurt them?<br/>\n<br/>\nIf a child knows the parents objective is to help him get what he  <br/>\nwants, if the parent is offering strategies that are kind and safe,  <br/>\nthen the parent is creating an environment where cheating, stealing,  <br/>\netc aren&#39;t advantageous.<br/>\n<br/>\nBeing what the parent thinks is trustworthy and respectful isn&#39;t  <br/>\nenough. The parent needs to direct trustworthiness and respect to the  <br/>\nchild. The child needs to feel the parent  trusts and respects who  <br/>\nthey are. The child needs to trust the parent is someone who wants to  <br/>\nhelp them.<br/>\n<br/>\nIt&#39;s not a straight cut path to lying and stealing prevention ;-)  <br/>\nAsking how to prevent kids from lying is sort of like asking how to  <br/>\nget a steeple bell 50 feet into the air. The answer begins with  <br/>\nbuilding a foundation on the ground which hardly sounds like a way to  <br/>\nget something into the air ;-)<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":251210887,"authorName":"shirarocklin","from":"&quot;shirarocklin&quot; &lt;shirarocklin@...&gt;","profile":"shirarocklin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Does Radical Unschooling always result in &quot;Good&quot; children?","postDate":"1262051667","msgId":49273,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhoYm5nais3NHJhQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":49281,"prevInTime":49272,"nextInTime":49274,"topicId":49273,"numMessagesInTopic":0,"msgSnippet":"Ok, the title has a lot of assumptions, but that was the easiest way I could think to describe what I am asking.  I know good is not a great choice of words","messageBody":"<div id=\"ygrps-yiv-571102894\">Ok, the title has a lot of assumptions, but that was the easiest way I could think to describe what I am asking.  I know &#39;good&#39; is not a great choice of words there.  What I am trying to ask is actually this: <br/>\n<br/>\nWe hear on this list, and others, and Sandra&#39;s website, and many other RUers websites, etc about all the great kids who have come through this lifestyle.  And that is really wonderful.  But critics could come along and say to me, &quot;Sure, the great cases are what&#39;s talked about... but what about the bad cases?&quot;  And I think they ask partly because so much of this is anecdotal, unschoolers don&#39;t seem to be &#39;studied,&#39; there isn&#39;t much in the way of statistical evidence (or is there? please point me to it!).  Homeschooling study results probably don&#39;t even apply to RUers.  <br/>\n<br/>\nSo, I&#39;m curious.  Are there any Radically Unschooled children, who have grown up, who are not &#39;good&#39; people?  Who cheat, steal, treat people badly, lie, etc...?  <br/>\n<br/>\nIs it possible for someone to grow up to turn out that way with the RU set of principles in place?  With parents who are genuinely &#39;good&#39;? <br/>\n<br/>\nThanks,<br/>\nShira</div>","specialLinks":[]}],"prevTopicId":49275,"nextTopicId":17883}}