{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":24323081,"authorName":"ameyp_90","from":"&quot;ameyp_90&quot; &lt;AMEYP@...&gt;","profile":"ameyp_90","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"more from Amey re: taking on too much","postDate":"1074178160","msgId":88992,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJ1Njk5ZytubmQwQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":88991,"nextInTime":88993,"topicId":88992,"numMessagesInTopic":0,"msgSnippet":"Joyce wrote:  You were already pretty full with what your children needed and yet are adopting another child and that decision is having detrimental affects","messageBody":"<div id=\"ygrps-yiv-1589713222\">Joyce wrote:  &quot;You were already pretty full with what your<br/>\nchildren needed and yet are adopting another child and that decision<br/>\nis having detrimental affects -- as in a very pulled to the limit mom<br/>\n-- on the other children already there.&quot;<br/>\n<br/>\nActually, we didn&#39;t set out to adopt another child.  When the<br/>\nsituation with my niece first happened, we really believed that it<br/>\nwould last 2-3 months.  As time went by and we learned more, we&#39;re<br/>\nrealized that it&#39;s probably going to be forever and our family now<br/>\nthinks of our niece as one of our bio children.  I&#39;m not at<br/>\nliberty to discuss the details of the case, but I think many people<br/>\nwould make the same choice we did, if they knew the entire situation.<br/>\n<br/>\nAlso, we&#39;re not adopting our niece.  We will probably get legal<br/>\n(as opposed to permanent) custody.  This means that her parents will<br/>\nstill have some residual rights.  We would prefer adoption, but<br/>\nthat&#39;s<br/>\nnot an easy thing to getthe parents would have to sign away all<br/>\nof<br/>\ntheir rights to her, or be PROVEN to be harmful to her.  <br/>\n<br/>\nJoyce wrote:  That&#39;s not saying you&#39;re a bad mom for adopting. It&#39;s<br/>\nnot saying that you should have turned the child down. It&#39;s saying<br/>\nthere may be a pattern of looking at more ways you can help when<br/>\ntaking on more means you wont&#39; be able to give the time needed to what<br/>\nyou&#39;ve already taken on.&quot;<br/>\n<br/>\nThis, along with something Sandra wrote (see below), is REALLY<br/>\nhelpful.  Thank you both for helping me to realize that I need to take<br/>\nsome time to listen to the thoughts and feelings of my children, as<br/>\nwell as not take on too much.<br/>\n<br/>\nSandra wrote: &quot;My point at first and now was that if an oldest<br/>\nchild with or without a diagnosis of some frustration-producing<br/>\n&quot;disorder&quot; seems frustrated and the mom doesn&#39;t have time to soothe<br/>\nand calm him, the fact of the mom&#39;s lack of time IS a factor and<br/>\nshould be considered a factor.<br/>\n<br/>\nIt might be nice if he could just be TOLD to buck up and get over it,<br/>\nbut he&#39;s a kid with real kid needs.  He could be drugged, but when the<br/>\ndrugs wear off will he be in a smaller family with a happier mom?<br/>\n<br/>\nWhen parents decide kids&#39; feelings aren&#39;t justified or aren&#39;t &quot;okay,&quot;<br/>\nthat&#39;s the beginning of the end of their relationship with that<br/>\nchild.)&quot;<br/>\n<br/>\nFinally, Joyce wrote, &quot;It&#39;s suggesting you need to find ways to<br/>\nmake sacrifices to cut back so that you can get the most out of the<br/>\nenergy and time you have.&quot;<br/>\n<br/>\nThis was good advice!  You&#39;re absolutely right on this one.  We<br/>\nwere contacted yesterday about a new development involving our niece<br/>\nand we have drawn a line in the sand in order to protect our<br/>\nfamily&#39;s<br/>\nneeds and not take too much from our own family.<br/>\n<br/>\nThanks also to all of the wonderful subscribers who have given advice<br/>\nand counsel about ways to find time for myself and conserve energy. <br/>\nThanks, also, to the person who told me to stop calling myself a bad<br/>\nunschooling mother! <br/>\n<br/>\nAmey</div>","specialLinks":[]}],"prevTopicId":88987,"nextTopicId":88989}}