{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1512150,"authorName":"Peggy","from":"Peggy &lt;peggy@...&gt;","profile":"margotapple","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"NEWS: Books Often Give History a Facelift","postDate":"1034725550","msgId":46496,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNEQUNBOEFFLjVFNTdBMzVCQGxpbm1heC5zYW8uYXJpem9uYS5lZHU+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":46495,"nextInTime":46497,"topicId":46496,"numMessagesInTopic":0,"msgSnippet":"Books Often Give History a Facelift http://www.nytimes.com/2002/10/02/education/02LESS.html October 2, 2002 By RICHARD ROTHSTEIN THE Texas Board of Education","messageBody":"<div id=\"ygrps-yiv-827135678\">Books Often Give History a Facelift<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.nytimes.com/2002/10/02/education/02LESS.html\">http://www.nytimes.com/2002/10/02/education/02LESS.html</a><br/>\n<br/>\nOctober 2, 2002<br/>\nBy RICHARD ROTHSTEIN<br/>\n<br/>\nTHE Texas Board of Education will soon decide which history<br/>\ntextbooks may be used in the state. Activists on the left<br/>\nand right are lobbying the board, to influence its choices.<br/>\n<br/>\nOne text has already been withdrawn because it referred to<br/>\nprostitution in frontier towns. A board member felt this<br/>\nwas inappropriate for high school students to read.<br/>\n<br/>\nA group called the Texas Public Policy Foundation has<br/>\nattacked the simplistic glorification of minority groups<br/>\nthat is now conventional in American education.<br/>\n<br/>\nThe foundation wants texts modified to tell how African<br/>\nchieftains, not Europeans, captured slaves for sale in<br/>\nAmerica. It wants to emphasize the role of white Europeans<br/>\nin ending slavery. It objects to portrayals of President<br/>\nJohn F. Kennedy and Attorney General Robert F. Kennedy as<br/>\ncivil rights supporters, noting that the brothers refused<br/>\nto support the movement at crucial times.<br/>\n<br/>\nThe group also wants texts to say that the Constitution<br/>\nprotects an individual&#39;s right to own guns and that the<br/>\nwealthy pay a disproportionate share of income taxes.<br/>\n<br/>\nAmerican publishers sell hundreds of millions of dollars<br/>\nworth of social studies texts each year. Texas is the<br/>\nsecond-largest buyer in that market, after California.<br/>\nBecause issuing separate editions for each state is<br/>\nexpensive, changes required by Texas will affect texts<br/>\neverywhere.<br/>\n<br/>\nThere is nothing new about this. As Frances FitzGerald<br/>\nnoted in her 1979 book, &quot;America Revised,&quot; since the 1950&#39;s<br/>\n&quot;New England children, whose ancestors heartily disapproved<br/>\nof the Mexican War, have grown up with heroic tales of Davy<br/>\nCrockett and Sam Houston&quot; - not because historians felt the<br/>\nwar was justified but to appease Texans who decided if<br/>\nbooks were acceptable.<br/>\n<br/>\nNor is Texas the only place where schoolbooks have been<br/>\npawns in adult political fights.<br/>\n<br/>\nA new book by Jonathan Zimmerman, &quot;Whose America?&quot; (Harvard<br/>\nUniversity Press, 2002), develops Ms. FitzGerald&#39;s themes.<br/>\nDr. Zimmerman shows how early 20th-century texts described<br/>\nthe American Revolution as a complex event, including class<br/>\nconflict between propertied and poor colonists. Antagonism<br/>\nof colonists toward England was played down, and support<br/>\nfor independence by some Englishmen was highlighted.<br/>\n<br/>\nDr. Zimmerman says this treatment partly resulted from<br/>\ngrowing numbers of immigrants in schools at the time.<br/>\nEducators aimed to get children &quot;Americanized,&quot; defined as<br/>\nadopting Anglo-Saxon culture and identity. Demonization of<br/>\nKing George III would have undermined this goal.<br/>\n<br/>\nThe perspective was reversed in the 1920&#39;s as newly<br/>\npowerful Irish immigrant leaders demanded a more<br/>\nanti-British stance. William H. Thompson, Chicago&#39;s<br/>\nIrish-American mayor, had the city&#39;s school superintendent<br/>\ndismissed for using &quot;treasonous&quot; pro-British texts.<br/>\n<br/>\nThe country&#39;s most popular history textbook was then<br/>\nrevised to remove descriptions of protesters against the<br/>\nStamp Act as a &quot;mob&quot; and of Boston Massacre victims as<br/>\n&quot;ruffians.&quot; In New York City, politicians demanded that<br/>\nbooks portray the Revolution as a crusade of other<br/>\nnationalities against the British. Minor revolutionary<br/>\nfigures like the Poles Thaddeus Kosciusko and Casimir<br/>\nPulaski, the Jew Haym Solomon, the Frenchman the Marquis de<br/>\nLafayette and the German Friedrich von Steuben became<br/>\nheroes in the curriculum. This multicultural fable remains<br/>\na staple of history texts.<br/>\n<br/>\nToday&#39;s books, and standardized tests issued by the same<br/>\npublishers, not only portray each minority as heroic, but<br/>\nevery group (and each sex) is airbrushed to eliminate the<br/>\npossibility of stereotyping.<br/>\n<br/>\nPortrayals of African-Americans as maids or athletes<br/>\n(except for Jackie Robinson), of women as housewives, of<br/>\nMexicans as farm laborers or of Jews as businessmen are not<br/>\npermitted. This ensures that books and tests pass muster<br/>\nwithout objection from officials in Texas and other states<br/>\nthat also allow schools to buy only approved texts.<br/>\n<br/>\nAre books now more bland and mythical than before? Perhaps<br/>\nnot, but they may be more dangerous. In the past, some<br/>\nstates, districts could dissent and use books with<br/>\ndifferent slants from the one in fashion. Teachers who had<br/>\nhistorical sophistication could add their own materials or<br/>\nignore the texts altogether.<br/>\n<br/>\nBut today, curriculums are more standardized, especially as<br/>\nwe measure all students with similar tests. On the one<br/>\nhand, policy makers want teachers to have more knowledge in<br/>\nthe subjects they teach and more skill in deciding how to<br/>\nteach them. On the other, teachers have less freedom to<br/>\ndesign their lessons.<br/>\n<br/>\nIt is unclear which tendency will prevail. But if<br/>\nstandardization wins out, political fights like the one in<br/>\nTexas will become ever more influential in determining how<br/>\nthe myths and realities of history will be told.</div>","specialLinks":[]}],"prevTopicId":46492,"nextTopicId":46499}}