{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":22,"messages":[{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Different needs for deschooling?","postDate":"1288139050","msgId":57927,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGltS29NZlIwelVteU1Tem5vVUVBV0Y9THpxS1A9ZGliME0zTjVwakBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PEFFOTI2MDQ3LUNFMDItNDRFQS1CQzBFLTg4QzBCNzhEMEM0RUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PEFBTkxrVGlrdk9SWWk0YWRWRDRjRnJoeDh4TmtoTUVuLU9Ib0drcjE2MzdLTUBtYWlsLmdtYWlsLmNvbT4JPDk4NzE0LjQ0MTIucW1Ad2ViODYyMDEubWFpbC5pcmQueWFob28uY29tPgk8QUFOTGtUaWthSzFkY0Z5c25zMU9OZEZIcnFmREp5Yl9ZWF90K2tDbnd4T2k9QG1haWwuZ21haWwuY29tPgk8MzIxNDUxLjI4ODM5LnFtQHdlYjExMDQxNC5tYWlsLmdxMS55YWhvby5jb20+CTxBRTkyNjA0Ny1DRTAyLTQ0RUEtQkMwRS04OEMwQjc4RDBDNEVAU2FuZHJhZG9kZC5jb20+"},"prevInTopic":57926,"nextInTopic":0,"prevInTime":57926,"nextInTime":57928,"topicId":57832,"numMessagesInTopic":0,"msgSnippet":"... Deschooling is something people talk about with many types of homeschooling. It means something different in unschooling. It s more in depth deschooling","messageBody":"<div id=\"ygrps-yiv-1326576721\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;And parents should be willing to have their own personal immersion frenzy without concern for whether their kids have lost interest or not, because learning can&#39;t just be a thing for kids, in a successful unschooling family.&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Deschooling is something people talk about with many types of<br/>\nhomeschooling. It means something different in unschooling. It&#39;s more<br/>\nin depth deschooling than most I think.<br/>\n<br/>\nOne thing that sets unschooling apart is that even though the parents<br/>\ncan give a great deal and seem to be sacrificial in getting<br/>\nopportunities for and giving resources to their children, the emphasis<br/>\nis on a child&#39;s desires to know or experience. Rather than on a preset<br/>\nidea of what would be good for kids as opposed to what would be<br/>\ninteresting for its own sake. Assuming the child is interested, right?<br/>\n<br/>\nA huge part of getting unschooling for me was to see children as<br/>\npeople with their own ideas and interests and plans. And if it doesn&#39;t<br/>\nmatch what one might expect to see in the school child, it&#39;s because<br/>\nwhat it matches is the human being that the child is. Not the school<br/>\nchild that the person could be.<br/>\n<br/>\n~Katherine</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Different needs for deschooling?","postDate":"1288120882","msgId":57920,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMyMTQ1MS4yODgzOS5xbUB3ZWIxMTA0MTQubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PEFBTkxrVGlrYUsxZGNGeXNuczFPTmRGSHJxZkRKeWJfWVhfdCtrQ253eE9pPUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEFBTkxrVGlrdk9SWWk0YWRWRDRjRnJoeDh4TmtoTUVuLU9Ib0drcjE2MzdLTUBtYWlsLmdtYWlsLmNvbT4gPDk4NzE0LjQ0MTIucW1Ad2ViODYyMDEubWFpbC5pcmQueWFob28uY29tPiA8QUFOTGtUaWthSzFkY0Z5c25zMU9OZEZIcnFmREp5Yl9ZWF90K2tDbnd4T2k9QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":57911,"nextInTopic":57926,"prevInTime":57919,"nextInTime":57921,"topicId":57832,"numMessagesInTopic":0,"msgSnippet":"***An educated adult... his interest in architecture and learning Italian and knitting have a lot to do with things we ve been doing or seen lately. So to me","messageBody":"<div id=\"ygrps-yiv-936370813\">***An educated adult... his interest in architecture and learning Italian and<br/>\nknitting have a lot to do with things we&#39;ve been doing or seen lately. So to<br/>\nme the some of the things we have been strewing have been interesting and<br/>\nworth pursuing for a while for him! He&#39;s talking about the future &quot;When I&#39;m<br/>\na dad...&quot;, &quot;When I grow up...&quot;. I don&#39;t think he&#39;s mature enough to think<br/>\nabout the future yet in terms of education. He&#39;s still a little boy playing<br/>\nfantasy games!***<br/>\n<br/>\nThis is what I&#39;ve seen happen in new to unschooling families... They get so <br/>\nexcited about all the learning, without totally deschooling.  They get caught up <br/>\nin all of it, over schedule classes and library trips and everything that looks <br/>\nlike academic learning, school learning.  I&#39;ve seen it happen so many times, <br/>\nespecially in families with young children where at least one child has been in <br/>\nschool.<br/>\n<br/>\nIt feels good to the parents to see their children do all these &quot;educational&quot; <br/>\nendeavors.  The kids go along with it because it&#39;s what they&#39;re used to doing, <br/>\nbut a bit more fun than what they experienced in school.  The issues that I&#39;ve <br/>\nseen arise in this, is that the kids never fully deschool, the parents never <br/>\nfully deschool, and eventually they all get burned out on the schedules and <br/>\nkeeping up with all the activities.  If the family doesn&#39;t stop and slow down <br/>\nthe pace and emphasis on &quot;educational&quot; learning, the kids might end up back in <br/>\nschool.  I&#39;ve seen THAT more times than I can count.<br/>\n<br/>\nSomewhere in all that, the parents need to set a better pace and really deschool <br/>\ntheir own thoughts and actions.  Sometimes parents think they&#39;ve deschooled only <br/>\nto have some schoolish thought rear it&#39;s ugly little head months down the road. <br/>\n Most parents have been to school for over 12 yrs.  That over a full year of <br/>\ndeschooling for the parents.  The kids will get there faster, but not if the <br/>\nparents don&#39;t stop themselves from interfering with the process.<br/>\n<br/>\nAll that fun learning is exciting for sure!  Sit back and observe it for now. <br/>\n Add a little bit to it here and there.  Get to know your kids again.  Let them <br/>\nget to know themselves and each other in their new environment.  Each day <br/>\ndoesn&#39;t have to be exciting, but let exciting moments happen.  The kids will <br/>\nfind their pace and so will the parents.<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Different needs for deschooling?","postDate":"1288092844","msgId":57911,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGlrWkJWdW5MR1pNazl2YXdNK0tuRW8tZWJ1bWRDb2s2cV9hWFl2Q0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PEFBTkxrVGlrYUsxZGNGeXNuczFPTmRGSHJxZkRKeWJfWVhfdCtrQ253eE9pPUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEFBTkxrVGlrdk9SWWk0YWRWRDRjRnJoeDh4TmtoTUVuLU9Ib0drcjE2MzdLTUBtYWlsLmdtYWlsLmNvbT4JPDk4NzE0LjQ0MTIucW1Ad2ViODYyMDEubWFpbC5pcmQueWFob28uY29tPgk8QUFOTGtUaWthSzFkY0Z5c25zMU9OZEZIcnFmREp5Yl9ZWF90K2tDbnd4T2k9QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":57910,"nextInTopic":57920,"prevInTime":57910,"nextInTime":57912,"topicId":57832,"numMessagesInTopic":0,"msgSnippet":"... cool. It has certainly been the deepest interest he s ever had. I have rarely before seen him so focused and serious about anything. It s amazing that he","messageBody":"<div id=\"ygrps-yiv-915941933\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;I don&#39;t mean to belittle Alexander&#39;s interests, I think Pokemon is really<br/>\n </span></blockquote>cool. It has certainly been the deepest interest he&#39;s ever had. I have<br/>\nrarely before seen him so focused and serious about anything. It&#39;s amazing<br/>\nthat he knows all these characters&#39; names and evolution. It&#39;s just that he&#39;s<br/>\nstill so negative about a lot of other things. Alexander is much more<br/>\ndifficult to deal with, and doesn&#39;t have the drive that Daniel has.&lt;&lt;&lt;<br/>\n<br/>\n&quot;don&#39;t mean to&quot;<br/>\n&quot;still so negative&quot;<br/>\n&quot;much more difficult to deal with&quot;<br/>\n<br/>\nFor unschooling to work well and happily, and for unschooling to work:<br/>\nLook for the value in the child&#39;s interest(s), whether that&#39;s one or<br/>\nmore interests.<br/>\nSee your child&#39;s communication as accurate expressions and thus avoid<br/>\nthinking of such things to &quot;still&quot; be or to move on to meet adult<br/>\nexpectations, whether that&#39;s yours or other adults.<br/>\nFocus on what influence your child has on his/her own life, definitely<br/>\nNOT on what can be done to the child to change or direct them. Parents<br/>\ndo influence their children and seldom do they see that dynamic moving<br/>\nin the other direction, from child to parent.<br/>\n<br/>\nHere are some ways to rethink:<br/>\n&quot;Don&#39;t mean to&quot; --- wasn&#39;t aware or now realize that...<br/>\n&quot;Still so negative&quot; --- feels bad/sad/ about or doesn&#39;t like/want the<br/>\nsituation ... so what can parents change to make things or BE more<br/>\npositive themselves?<br/>\n&quot;Much more difficult to deal with&quot; --- Turn it around... In what ways<br/>\nam I difficult for my child to deal with? What is the child&#39;s<br/>\nperspective? Ask this by conversing with the child or by observation<br/>\nover time, don&#39;t assume.<br/>\n<br/>\nMuch of this is about BEing, being present, and being here right now<br/>\nwith your children.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/being/\">http://sandradodd.com/being/</a><br/>\n<br/>\nAll of the concepts at that link are good to read and think about and<br/>\nimplement. Especially &quot;being with&quot;<br/>\n<br/>\n~Katherine</div>","specialLinks":[]},{"userId":67727291,"authorName":"wtexans","from":"&quot;wtexans&quot; &lt;wtexans@...&gt;","profile":"wtexans","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Different needs for deschooling?","postDate":"1288079618","msgId":57910,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlhNjFlMit0MW10QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFBTkxrVGlrYUsxZGNGeXNuczFPTmRGSHJxZkRKeWJfWVhfdCtrQ253eE9pPUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":57909,"nextInTopic":57911,"prevInTime":57909,"nextInTime":57911,"topicId":57832,"numMessagesInTopic":0,"msgSnippet":"===I see a lot of opposition, negativity, from him. Whenever we suggest something to do, he s usually against it. Even fun things, things that we know he likes","messageBody":"<div id=\"ygrps-yiv-208648583\">===I see a lot of opposition, negativity, from him. Whenever we suggest something to do, he&#39;s usually against it. Even fun things, things that we know he likes or will like.===<br/>\n<br/>\nI&#39;m 45 years old and up until 5 or 6 years ago, my default answer to suggested things-to-do was &quot;no&quot; or &quot;not right now&quot;. Nowadays I&#39;m more apt to think a bit about a suggested idea before giving my answer, but that doesn&#39;t mean &quot;no&quot; isn&#39;t the answer that immediately pops into my head! In fact, my immediate and extended family all know the best way to get a &quot;yes&quot; answer out of me is to suggest something by email or text (so I don&#39;t feel pressured to answer right then), or to preface their idea with, &quot;think about this and we can talk more later&quot; or &quot;don&#39;t give me an answer right this second, but think about this idea&quot;.<br/>\n<br/>\nThat tends to be the way I handle things when I&#39;m suggesting something to my son, too. <br/>\n<br/>\nWe&#39;re both homebodies. We *love* being at home! We also enjoy doing things away from home, but, generally, we&#39;re not spur-of-the-moment people. We&#39;ll happily meet up with friends here or there, but &quot;happily&quot; happens a lot easier if plans have been made the night before or at least several hours before! Perhaps your son is the same way.<br/>\n<br/>\nI keep a list hanging on the wall of my home office, and on that list are ideas of local fun things to do away from home. If we find ourselves feeling restless or at loose ends and our usual outings don&#39;t sound interesting, that&#39;s when that list comes in handy. Maybe your son would be receptive if you approached him on his own turf and asked if he&#39;d brainstorm some ideas for a similar list for your household. Maybe he won&#39;t be receptive to that right now; if not, drop it for several months then ask again.<br/>\n<br/>\nGive him plenty of space. That doesn&#39;t mean to ignore him, rather I mean give him space to just be. When he&#39;s doing something, pop into his space to say &quot;hi&quot; every so often. Instead of saying, &quot;whatcha doing?&quot;, which could be seem intrusive, you could say, &quot;I just wanted to say &#39;hi&#39; and see your face!&quot;. Don&#39;t expect more from him than he&#39;s willing to give and/or able to give right now. Give him time to gain trust in things changing and being different in your household.<br/>\n<br/>\nGlenda</div>","specialLinks":[]},{"userId":67727291,"authorName":"wtexans","from":"&quot;wtexans&quot; &lt;wtexans@...&gt;","profile":"wtexans","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Different needs for deschooling?","postDate":"1288078370","msgId":57909,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlhNjA3MitzdDNkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFBTkxrVGlrYUsxZGNGeXNuczFPTmRGSHJxZkRKeWJfWVhfdCtrQ253eE9pPUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":57908,"nextInTopic":57910,"prevInTime":57908,"nextInTime":57910,"topicId":57832,"numMessagesInTopic":0,"msgSnippet":"===Alexander is much more difficult to deal with, and doesn t have the drive that Daniel has.=== AND ===On the other hand, when I talk about Alexander s","messageBody":"<div id=\"ygrps-yiv-597240822\">===Alexander is much more difficult to deal with, and doesn&#39;t have the drive that Daniel has.=== AND ===On the other hand, when I talk about Alexander&#39;s beautiful singing voice, that doesn&#39;t stop Daniel from singing away slightly off tune===<br/>\n<br/>\nI know you said that you&#39;re working on not comparing, but those two sentences jumped out at me. When you think in terms of &quot;more than&quot; or &quot;less than&quot;, that&#39;s comparing. <br/>\n<br/>\nMaybe Alexander *does* have as much drive as Daniel, but he doesn&#39;t show it in the same way as Daniel. Perhaps nothing has inspired him to use his full amount of drive thus far in his life. <br/>\n<br/>\nSome people are driven by jumping through other people&#39;s hoops; some people are driven by avoiding those hoops; some people are driven to follow the beat of their own drum.<br/>\n<br/>\nIn the second sentence I quoted above, Alexander&#39;s getting a backhanded compliment -- he sings beautifully. But, Daniel, whose voice isn&#39;t quite as lovely as Alexander&#39;s, isn&#39;t daunted by that because he&#39;s more . . . what? . . . self-assured than Alexander . . . meaning Alexander is &quot;less than&quot; Daniel yet again.<br/>\n<br/>\nIt may feel like I&#39;m picking on you, but what I&#39;m trying to do is tease out wording that you&#39;re using here, and perhaps at home, but definitely in your own thoughts, that deems one child as having more positive (to you) personality traits. When you have those thoughts, or when you write them here, think about ways you can turn those thoughts around so each child is being viewed as who they are rather than as who they are in comparison to one of their siblings.<br/>\n<br/>\nGlenda</div>","specialLinks":[]},{"userId":67727291,"authorName":"wtexans","from":"&quot;wtexans&quot; &lt;wtexans@...&gt;","profile":"wtexans","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Different needs for deschooling?","postDate":"1288076870","msgId":57908,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlhNXVvNitvbG1wQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFBTkxrVGlrYUsxZGNGeXNuczFPTmRGSHJxZkRKeWJfWVhfdCtrQ253eE9pPUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":57907,"nextInTopic":57909,"prevInTime":57907,"nextInTime":57909,"topicId":57832,"numMessagesInTopic":0,"msgSnippet":"===I m not pressuring the reading, but I do offer and I find books at the library for them all. I probably use the internet more for finding information about","messageBody":"<div id=\"ygrps-yiv-1072092505\">===I&#39;m not pressuring the reading, but I do offer and I find books at the library for them all. I probably use the internet more for finding information about whatever they&#39;re into. That&#39;s also reading, for all of us!===<br/>\n<br/>\nIf you&#39;re not already, be sure to include a variety of things other than reading materials. <br/>\n<br/>\nUsing Pokemon as an example because it was the most popular thing in our household for a number of years, I found on eBay and elsewhere on the internet Pokemon-themed: cards (for the Pokemon card game), puzzles, Monopoly, action figures, gym badges, plushes, bedding/curtains, fabric, clocks, and no telling what else that I&#39;m not thinking of at the moment.<br/>\n<br/>\nThe game guides that go along with the video games are cool, but walk-throughs or let&#39;s plays on YouTube are pretty cool, too.<br/>\n<br/>\nSeveral years ago when I was futzing around with some Shrinky Dink paper, making some earrings for a craft swap, my son asked if I&#39;d make him a necklace of Pokemons. So he chose which ones he liked most, I traced and colored them in, then shrank them and turned them into a necklace for him.<br/>\n<br/>\nWe&#39;ve made Pokemons using perler beads; you can find free patterns on the Sprite Stitch forums (<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.spritestitch.com/forum/)\">http://www.spritestitch.com/forum/)</a>. You can put magnetic tape on the back of the completed projects and stick them on the fridge or any metal your kids may have in their room, or screw a piece of metal onto a section of their wall and let them stick them up there.<br/>\n<br/>\nMy son and I used to set up elaborate areas for his Pokemon action figures -- we&#39;d have gym battles with them and he&#39;d develop stories that we played out. We did LOTS of imaginative play.<br/>\n<br/>\nOne of the ways my son learned how to budget money was to surf eBay and find Pokemons he wanted. He&#39;d have a certain amount of allowance or gift money available to spend, and he&#39;d find listings for the Pokemon he wanted and would figure out which he could afford to bid on and which he&#39;d have to wait for. <br/>\n<br/>\nHe learned how to read a timeline after receiving a Pokemon timeline in a magazine. <br/>\n<br/>\nThere are so many other ways to feed an interest in Pokemon besides books and dvds. We still have the books and dvds -- there&#39;s no shortage of love for those in our household -- but there&#39;s so much more out there to be found. Find some of those additional ways to feed that interest!<br/>\n<br/>\nGlenda</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Different needs for deschooling?","postDate":"1288075333","msgId":57907,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg3OTZDRjY3LUEzNTgtNDIzQi04MTE5LTdEQ0JGRTQ1NkQ1QkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEFBTkxrVGlrYUsxZGNGeXNuczFPTmRGSHJxZkRKeWJfWVhfdCtrQ253eE9pPUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEFBTkxrVGlrdk9SWWk0YWRWRDRjRnJoeDh4TmtoTUVuLU9Ib0drcjE2MzdLTUBtYWlsLmdtYWlsLmNvbT4gPDk4NzE0LjQ0MTIucW1Ad2ViODYyMDEubWFpbC5pcmQueWFob28uY29tPiA8QUFOTGtUaWthSzFkY0Z5c25zMU9OZEZIcnFmREp5Yl9ZWF90K2tDbnd4T2k9QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":57906,"nextInTopic":57908,"prevInTime":57906,"nextInTime":57908,"topicId":57832,"numMessagesInTopic":0,"msgSnippet":"-=-I thought deschooling would also bring some peace with it?-=- It won t until you stop looking for it.  As long as you pull the plant up by the roots to see","messageBody":"<div id=\"ygrps-yiv-1184740123\">-=-I thought deschooling would also bring some peace with it?-=-<br/>\n<br/>\nIt won&#39;t until you stop looking for it.  As long as you pull the plant  <br/>\nup by the roots to see how it&#39;s doing, the plan isn&#39;t going to be able  <br/>\nto grow in peace.<br/>\n<br/>\n-=- I<br/>\nsee a lot of opposition, negativity, from him. Whenever we suggest  <br/>\nsomething<br/>\nto do, he&#39;s usually against it. Even fun things, things that we know he<br/>\nlikes or will like. -=-<br/>\n<br/>\nThen stop making suggestions.  DESCHOOL.  Let it go.  Let it be.   <br/>\nDon&#39;t pull it up by the roots.  Let him be negative.  Take it as clear  <br/>\ncommunication.<br/>\n<br/>\n<br/>\n-=-Is it him wanting to be more in control? To be able to decide more  <br/>\non his own?-=-<br/>\n<br/>\nYes, and so is all of deschooling, and then all of unschooling.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Different needs for deschooling?","postDate":"1288075141","msgId":57906,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkzOTQ0RjU1LTZCMTUtNDBGRi1BRTBDLTY3RjQ4Q0NDOTVCMEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEFBTkxrVGlrYUsxZGNGeXNuczFPTmRGSHJxZkRKeWJfWVhfdCtrQ253eE9pPUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEFBTkxrVGlrdk9SWWk0YWRWRDRjRnJoeDh4TmtoTUVuLU9Ib0drcjE2MzdLTUBtYWlsLmdtYWlsLmNvbT4gPDk4NzE0LjQ0MTIucW1Ad2ViODYyMDEubWFpbC5pcmQueWFob28uY29tPiA8QUFOTGtUaWthSzFkY0Z5c25zMU9OZEZIcnFmREp5Yl9ZWF90K2tDbnd4T2k9QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":57905,"nextInTopic":57907,"prevInTime":57905,"nextInTime":57907,"topicId":57832,"numMessagesInTopic":0,"msgSnippet":"-=-Isn t it also a down note of his new reading interest to call it a schoolish approach?-=- It depends whether it s a schoolish approach or not. :-) Just be","messageBody":"<div id=\"ygrps-yiv-1503339384\">-=-Isn&#39;t it also a down note of his new reading interest to call it a  <br/>\nschoolish approach?-=-<br/>\n<br/>\nIt depends whether it&#39;s a schoolish approach or not. :-)<br/>\n<br/>\nJust be aware that it *could* be an indication that he still thinks  <br/>\nreading is the only cool thing.<br/>\nAnd that your own responses to it are likely an indication that YOU  <br/>\nstill value reading above other activities or inputs.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/bookworship\">http://sandradodd.com/bookworship</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/bookandsax\">http://sandradodd.com/bookandsax</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":67727291,"authorName":"wtexans","from":"&quot;wtexans&quot; &lt;wtexans@...&gt;","profile":"wtexans","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Different needs for deschooling?","postDate":"1288075021","msgId":57905,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlhNXN1ZCtzY2FqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFBTkxrVGlrYUsxZGNGeXNuczFPTmRGSHJxZkRKeWJfWVhfdCtrQ253eE9pPUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":57904,"nextInTopic":57906,"prevInTime":57904,"nextInTime":57906,"topicId":57832,"numMessagesInTopic":0,"msgSnippet":"===He s talking about the future When I m a dad... , When I grow up... . I don t think he s mature enough to think about the future yet in terms of","messageBody":"<div id=\"ygrps-yiv-1138230975\">===He&#39;s talking about the future &quot;When I&#39;m a dad...&quot;, &quot;When I grow up...&quot;. I don&#39;t think he&#39;s mature enough to think about the future yet in terms of education. He&#39;s still a little boy playing fantasy games!===<br/>\n<br/>\nThe way that last sentence is phrased is demeaning, as if the thoughts he&#39;s having about his future are not worth taking seriously *because* he&#39;s a kid. <br/>\n<br/>\nWhenever your son expresses something as &quot;when I grow up...&quot;, which is a very traditional, schooly way of thinking (think about how often schoolkids are told, &quot;when you grow up and are out in the real world...&quot;), you can help feed that interest *now* and let him know that whatever that interest may be, it doesn&#39;t have to be put on hold until some future point in time. <br/>\n<br/>\nIt&#39;s empowering to kids for their parents to help dreams be worked towards, and to not be told &quot;oh, you have to be a grown up before you can do that&quot;. They can relish being the age they are right at this very moment!<br/>\n<br/>\nAlso, pay particular attention to what he&#39;s saying he&#39;ll do when he&#39;s a dad. That&#39;s a good way to get an idea of the aspects of your parenting that he likes and the aspects that he would do differently, and that can help you fine-tune areas in which he feels his needs aren&#39;t quite being met.<br/>\n<br/>\nGlenda</div>","specialLinks":[]},{"userId":139171607,"authorName":"Katrine Clip","from":"Katrine Clip &lt;katrine@...&gt;","profile":"kaclip","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Different needs for deschooling?","postDate":"1288073346","msgId":57904,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGlrYUsxZGNGeXNuczFPTmRGSHJxZkRKeWJfWVhfdCtrQ253eE9pPUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDk4NzE0LjQ0MTIucW1Ad2ViODYyMDEubWFpbC5pcmQueWFob28uY29tPg==","referencesHeader":"PEFBTkxrVGlrdk9SWWk0YWRWRDRjRnJoeDh4TmtoTUVuLU9Ib0drcjE2MzdLTUBtYWlsLmdtYWlsLmNvbT4JPDk4NzE0LjQ0MTIucW1Ad2ViODYyMDEubWFpbC5pcmQueWFob28uY29tPg=="},"prevInTopic":57853,"nextInTopic":57905,"prevInTime":57903,"nextInTime":57905,"topicId":57832,"numMessagesInTopic":0,"msgSnippet":"I have appreciated reading all of your replies and advice. It s taken me many days to read and think and try to formulate some answers (and new questions!). I","messageBody":"<div id=\"ygrps-yiv-2138381749\">I have appreciated reading all of your replies and advice. It&#39;s taken me<br/>\nmany days to read and think and try to formulate some answers (and new<br/>\nquestions!). I hope some of it will generate even more comments from you.<br/>\nI&#39;m here to learn. Thank you!<br/>\n<br/>\n<br/>\n<br/>\n&lt;&lt;&lt;From what you&#39;ve written, your absolute joy at your son Daniel wanting to<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; explore the world in a fairly academic way and then the down note of your<br/>\n&gt; son<br/>\n&gt; Alexander not embracing academic learning, it sounds like you may need to<br/>\n&gt; deschool for a while longer as well.&gt;&gt;&gt;<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Right now, Daniel seems to be doing more academic work and that resonates<br/>\nwith what I&#39;m used to. I&#39;ve always been a big reader, finding much pleasure<br/>\nin stories. When I see him reading now and liking it so much, I&#39;m happy<br/>\nbecause I can hear and feel his pleasure in discovering this too. I&#39;m happy<br/>\nfor him that he feels quite confident in reading now. He&#39;s been having a big<br/>\nupswing in self confidence lately, he believes in himself now. Last year in<br/>\nschool he thought his memory was bad, that he was bad at math and writing<br/>\nand everything. Now he&#39;s telling me he has a photographic memory, that his<br/>\nbrain is so fast.<br/>\n<br/>\n &lt;&lt;&lt;The fact that Daniel is embracing such a schoolish approach suggests<br/>\nthat he<br/>\nstill needs a lot of deschooling. &gt;&gt;&gt;<br/>\n<br/>\nAnd I thought he was through the deschooling... You&#39;re saying this because<br/>\nreading is thought of as academic? Doesn&#39;t everybody want to learn to read?<br/>\nIt&#39;s all around us, it&#39;s a part of life... I don&#39;t think he&#39;s doing this now<br/>\nto please his parents. To me, it looks like he&#39;s pleasing himself! And<br/>\nfinding out that he can do this on his own, it&#39;s empowering. Isn&#39;t it also a<br/>\ndown note of his new reading interest to call it a schoolish approach?<br/>\n<br/>\n<br/>\n&lt;&lt;&lt;Not that you need to frown on his academic<br/>\npursuits, but he may see them as the only means to becoming an educated<br/>\nadult.<br/>\nSo breathe and relax and find fun things to do and watch and listen to and<br/>\nhang<br/>\nout near and mix it up without any pressure. &gt;&gt;&gt;<br/>\n<br/>\nAn educated adult...  his interest in architecture and learning Italian and<br/>\nknitting have a lot to do with things we&#39;ve been doing or seen lately. So to<br/>\nme the some of the things we have been strewing have been interesting and<br/>\nworth pursuing for a while for him! He&#39;s talking about the future &quot;When I&#39;m<br/>\na dad...&quot;, &quot;When I grow up...&quot;. I don&#39;t think he&#39;s mature enough to think<br/>\nabout the future yet in terms of education. He&#39;s still a little boy playing<br/>\nfantasy games!<br/>\n<br/>\nI&#39;m not pressuring the reading, but I do offer and I find books at the<br/>\nlibrary for them all. I probably use the internet more for finding<br/>\ninformation about whatever they&#39;re into. That&#39;s also reading, for all of us!<br/>\n<br/>\n<br/>\nOP:&gt; Alexander doesn&#39;t seem to have a &quot;breakthrough&quot; the way Daniel does. &lt;<br/>\n<br/>\n&lt;&lt;&lt;Couldn&#39;t being totally into a something like Pokemon be a<br/>\nbreakthrough for him?&gt;&gt;&gt;<br/>\n<br/>\nI don&#39;t mean to belittle Alexander&#39;s interests, I think Pokemon is really<br/>\ncool. It has certainly been the deepest interest he&#39;s ever had. I have<br/>\nrarely before seen him so focused and serious about anything. It&#39;s amazing<br/>\nthat he knows all these characters&#39; names and evolution. It&#39;s just that he&#39;s<br/>\nstill so negative about a lot of other things. Alexander is much more<br/>\ndifficult to deal with, and doesn&#39;t have the drive that Daniel has.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; &lt;&lt;&lt;There are<br/>\n&gt; lots of cool guide books on Pokemon. [...]  If Simon were awake<br/>\n&gt; I&#39;d ask for a recommendation. &gt;&gt;&gt;<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>We just bought a big book  &quot;Pokemon HeartGold & SoulSilver The Official<br/>\nPokemon Kanto Guide National Pokedex: Official Strategy Guide&quot;. We just<br/>\ndiscovered that it was volume 2 so now I have to find volume 1!  Daniel got<br/>\nthe game Heartgold and Soulsilver and they both need those books to study<br/>\nand understand the game.<br/>\n<br/>\nIf Simon has other recommendations, we&#39;d love to hear them!<br/>\n<br/>\n<br/>\n<br/>\nOP:&gt; I need to spend a lot more time with him, and be very<br/>\n<blockquote><span title=\"ireply\"> &gt; patient and loving because he&#39;s so sensitive.<br/>\n<br/>\n </span></blockquote>&lt;&lt;&lt;Then it&#39;s not too far a leap to understand that his deschooling<br/>\nexperience will be different! Was he the one who was labeled ADHD and<br/>\ngiven an IEP in school?&gt;&gt;&gt;<br/>\n<br/>\nNo, Daniel had an IEP ( both were diagnosed ADHD a label I totally reject<br/>\nnow) and was apparently having a harder time than Alexander in school, also<br/>\nbecause he had a bad/harsh teacher the second time around in 1st grade. By<br/>\ntrying to remember how Alexander was like a baby, I can see that he was the<br/>\none who cried most and needed most closeness. So it makes sense that he is<br/>\nstill like that!<br/>\n<br/>\n<br/>\n&lt;&lt;&lt;Deschooling takes time. He&#39;s still seeing learning as something external<br/>\nthat is done TO him, as<br/>\nopposed to learning that just is. &gt;&gt;&gt;<br/>\n<br/>\n&lt;&lt;&lt;It seems that Alexander is very very typical of what happens in<br/>\ndeschooling. He&#39;s recovering from school damage, isn&#39;t living in school<br/>\nthought and is<br/>\nexploring something he loves.&gt;&gt;&gt;<br/>\n<br/>\nThanks, that also gave me some perspective on Alexander! &quot;Isn&#39;t living in<br/>\nschool thought&quot;... yes, that would portray him. He doesn&#39;t tolerate anything<br/>\nschoolish. But I thought deschooling would also bring some peace with it? I<br/>\nsee a lot of opposition, negativity, from him. Whenever we suggest something<br/>\nto do, he&#39;s usually against it. Even fun things, things that we know he<br/>\nlikes or will like. Is it him wanting to be more in control? To be able to<br/>\ndecide more on his own?<br/>\n<br/>\n<br/>\n<br/>\nOP:&gt; I wonder if Alexander is feeling somehow in his twin brother&#39;s shadow?<br/>\n<blockquote><span title=\"ireply\"> &gt; Is he jealous? When Daniel has a drawing phase, he&#39;s not doing it.<br/>\n<br/>\n </span></blockquote>&lt;&lt;&lt;I guess it depends on how much weight *you* put on what Daniel is<br/>\ndoing.&gt;&gt;&gt;<br/>\n<br/>\nHmm, yes I have talked about Daniel&#39;s reading, about Daniel&#39;s<br/>\n&quot;accomplishments&quot;. Alexander may see that as too much praise for what<br/>\nDaniel&#39;s doing, and then he doesn&#39;t want to compete with that, in fear of<br/>\nnot measuring up, not doing as well? On the other hand, when I talk about<br/>\nAlexander&#39;s beautiful singing voice, that doesn&#39;t stop Daniel from singing<br/>\naway slightly off tune ;-)<br/>\n<br/>\n<br/>\n&lt;&lt;&lt;Even though they are twins, your boys are individuals. Are you<br/>\nexpecting Alexander to be identical in every way to Daniel, in spite<br/>\nof the differences you mention?&gt;&gt;&gt;<br/>\n<br/>\nThis is a biggie for me, something I&#39;ve been working on since they were<br/>\nbabies. No, I don&#39;t expect them to be the same. They just look very similar.<br/>\nAt the same time, there they are, exactly the same age, perfect for<br/>\ncomparisons... As it is also easy to compare them to big brother. I stopped<br/>\ndressing them in matching or identical outfits, but I did colorcode them so<br/>\nothers would know who they were. I&#39;d tell people that Alexander was wearing<br/>\ngreens and reds and Daniel blues and tan... Now, they wear whatever they<br/>\nchoose to and it&#39;s always different ;-)<br/>\n<br/>\n<br/>\n&lt;&lt;&lt; [Big brother Thomas] is the star, isn&#39;t he? The one who did wonderfully<br/>\nin school,<br/>\nthe one who&#39;s no trouble, the one who always measures up.<br/>\nBe careful not to compare your twins to him. It&#39;s already apparent<br/>\nthat there has been this dynamic amongst all the boys.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n<br/>\n </span></blockquote>Yes, I am aware of the danger of comparison, my sister keeps telling me how<br/>\nbad it was to compare herself to me, her older sister, and never feeling she<br/>\ncould measure up. The twins may feel the same about Thomas. I still often<br/>\nfall into the trap and compare them...<br/>\n<br/>\n<br/>\n&lt;&lt;&lt;Learning isn&#39;t limited to<br/>\n<blockquote><span title=\"ireply\"> &gt; reading and writing and studying a foreign language and spelling. Learning<br/>\n&gt; is<br/>\n&gt; about exploring and discovering the world.&gt;&gt;&gt;<br/>\n&gt;<br/>\n </span></blockquote>Thanks! Yes, that&#39;s what we&#39;re trying to do/live. Explore and discover, I<br/>\nlove it. I&#39;m rereading the links you sent.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Different needs for deschooling?","postDate":"1288042561","msgId":57926,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFFOTI2MDQ3LUNFMDItNDRFQS1CQzBFLTg4QzBCNzhEMEM0RUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDMyMTQ1MS4yODgzOS5xbUB3ZWIxMTA0MTQubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PEFBTkxrVGlrdk9SWWk0YWRWRDRjRnJoeDh4TmtoTUVuLU9Ib0drcjE2MzdLTUBtYWlsLmdtYWlsLmNvbT4gPDk4NzE0LjQ0MTIucW1Ad2ViODYyMDEubWFpbC5pcmQueWFob28uY29tPiA8QUFOTGtUaWthSzFkY0Z5c25zMU9OZEZIcnFmREp5Yl9ZWF90K2tDbnd4T2k9QG1haWwuZ21haWwuY29tPiA8MzIxNDUxLjI4ODM5LnFtQHdlYjExMDQxNC5tYWlsLmdxMS55YWhvby5jb20+"},"prevInTopic":57920,"nextInTopic":57927,"prevInTime":57925,"nextInTime":57927,"topicId":57832,"numMessagesInTopic":0,"msgSnippet":"-=- Sometimes parents think they ve deschooled only to have some schoolish thought rear it s ugly little head months down the road. -=- It s inevitable that","messageBody":"<div id=\"ygrps-yiv-390745159\">-=- Sometimes parents think they&#39;ve deschooled only<br/>\nto have some schoolish thought rear it&#39;s ugly little head months down  <br/>\nthe road. -=-<br/>\n<br/>\nIt&#39;s inevitable that there will be relapses as the parent&#39;s own  <br/>\nchildhood and then teen years flash subconsciously before her eyes. :-)<br/>\n<br/>\nI don&#39;t think one can fully deschool all in one swoop, though each  <br/>\nnext-level cleansing becomes easier.<br/>\n<br/>\n-=-All that fun learning is exciting for sure! Sit back and observe it  <br/>\nfor now.<br/>\nAdd a little bit to it here and there.-=-<br/>\n<br/>\nI know why that was written, and I agree with it having been written,  <br/>\nbut I think  there are unschooling parents who too great a &quot;sit back&quot;  <br/>\napproach.  I&#39;ve been an immersion learning type of person since I was  <br/>\na kid.  One book led to another, or led to drawings or questions or  <br/>\nencyclopedia visits.  We had no way to request movies; it either was  <br/>\nin the theatre or on TV or it wasn&#39;t.  But now that kids can go from  <br/>\none DVD or online resource to another all in one day, those who prefer  <br/>\nthat kind of frenzied immersion can indulge.  And if a parent has  <br/>\nnever once experienced that, the immersion could be a good unschooling  <br/>\ntool.<br/>\n<br/>\nIt&#39;s good for the parents not to take over and manage an interest, but  <br/>\nto participate in the frenzy (being careful not to commandeer it) can  <br/>\nbe pretty illuminating.  And parents should be willing to have their  <br/>\nown personal immersion frenzy without concern for whether their kids  <br/>\nhave lost interest or not, because learning can&#39;t just be a thing for  <br/>\nkids, in a successful unschooling family.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":29148328,"authorName":"t_guyonvarch","from":"&quot;t_guyonvarch&quot; &lt;titiskarweni@...&gt;","profile":"t_guyonvarch","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Different needs for deschooling?","postDate":"1287444628","msgId":57853,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk5aWxhayt1dGpoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIzRDg0RkJGLUE3MDgtNDE0MC04QzM0LThCRTYwMjU1MzYxN0Bjb21jYXN0Lm5ldD4="},"prevInTopic":57849,"nextInTopic":57904,"prevInTime":57852,"nextInTime":57854,"topicId":57832,"numMessagesInTopic":0,"msgSnippet":"... How true! I have almost always been the best at school, and once or twice when I had low mark, I was sooo beaten. Now I can easily wholeheartedly embrace","messageBody":"<div id=\"ygrps-yiv-1058091383\"><blockquote><span title=\"ireply\">&gt; That doesn&#39;t mean he wasn&#39;t adversely affected by school. Sometimes  <br/>\n&gt; it&#39;s the kids who do the best in school who suffer. They are living up  <br/>\n&gt; to people&#39;s expectations all the time, so for them to fail is an awful  <br/>\n&gt; thing.<br/>\n<br/>\n </span></blockquote>How true! I have almost always been the best at school, and once or twice when I had low mark, I was sooo beaten. <br/>\nNow I can easily wholeheartedly embrace unschooling idea (though still struggling to put it into practice). On the contrary, my husband who said always did the minimum possible at school, had to repeat a class in two occasions, is finding it harder to see the value of unschooling.</div>","specialLinks":[]},{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Different needs for deschooling?","postDate":"1287361928","msgId":57849,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIzRDg0RkJGLUE3MDgtNDE0MC04QzM0LThCRTYwMjU1MzYxN0Bjb21jYXN0Lm5ldD4=","inReplyToHeader":"PEFBTkxrVGlrdk9SWWk0YWRWRDRjRnJoeDh4TmtoTUVuLU9Ib0drcjE2MzdLTUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEFBTkxrVGlrdk9SWWk0YWRWRDRjRnJoeDh4TmtoTUVuLU9Ib0drcjE2MzdLTUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":57843,"nextInTopic":57853,"prevInTime":57848,"nextInTime":57850,"topicId":57832,"numMessagesInTopic":0,"msgSnippet":"I agree with all of what Schuyler and Jenny said.  I ll just add my thoughts. ... Even though they are twins, your boys are individuals. Are you expecting","messageBody":"<div id=\"ygrps-yiv-1180794266\">I agree with all of what Schuyler and Jenny said.  I&#39;ll just add my  <br/>\nthoughts.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; His twin brother Alexander is quite different (though they are<br/>\n&gt; identical;-)<br/>\n<br/>\n&gt; But he hasn&#39;t had a &quot;break through&quot;<br/>\n&gt; yet, he&#39;s still negative, bored, uninterested in things (except<br/>\n&gt; Pokemon).<br/>\n<br/>\n </span></blockquote>Even though they are twins, your boys are individuals. Are you  <br/>\nexpecting Alexander to be identical in every way to Daniel, in spite  <br/>\nof the differences you mention?<br/>\n<br/>\nAlexander doesn&#39;t have to have a &quot;breakthrough&quot; the way Daniel does.  <br/>\nCouldn&#39;t  being totally into a something like Pokemon be a  <br/>\nbreakthrough for him?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I need to spend a lot more time with him, and be very<br/>\n&gt; patient and loving because he&#39;s so sensitive.<br/>\n<br/>\n </span></blockquote>Then it&#39;s not too far a leap to understand that his deschooling  <br/>\nexperience will be different! Was he the one who was labeled ADHD and  <br/>\ngiven an IEP in school?<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I wonder if Alexander is feeling somehow in his twin brother&#39;s shadow?<br/>\n&gt; Is he jealous? When Daniel has a drawing phase, he&#39;s not doing it.<br/>\n<br/>\n </span></blockquote>I guess it depends on how much weight *you* put on what Daniel is doing.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Now<br/>\n&gt; that Daniel suddenly wants to read, he definitely doesn&#39;t want to even<br/>\n&gt; when I offered to buy him a book too. He didn&#39;t see any that he liked<br/>\n&gt; there when I got the book for Daniel.<br/>\n<br/>\n </span></blockquote>Does Alexander feel that you want him to do the same things as his  <br/>\ntwin? Maybe he wants you to see him as a person separate from his  <br/>\nbrother, learning in his own way.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If they had had an &quot;all about<br/>\n&gt; Pokemon characters&quot; he would have asked for it! I&#39;m looking at Amazon<br/>\n&gt; now to see if I can find that, it would be very useful for him.<br/>\n<br/>\n </span></blockquote>Not only *useful* but *important* to him. He&#39;ll see that you value  <br/>\nwhat he loves.<br/>\n<br/>\nYou might want to get familiar with gaming stores which carry Pokedex  <br/>\nand gaming strategy guides. Here&#39;s a couple of my daughter&#39;s favorite  <br/>\nonline sites: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.serebii.net/index2.shtml\">http://www.serebii.net/index2.shtml</a> and <a rel=\"nofollow\" target=\"_blank\" href=\"http://bulbapedia.bulbagarden.net/wiki/Main_Page\">http://bulbapedia.bulbagarden.net/wiki/Main_Page</a><br/>\n<br/>\nAnd what about Nintendo DS games or Wii games? Awesome stuff!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; He<br/>\n&gt; still hasn&#39;t discovered the &quot;joy of reading&quot; but he reads for<br/>\n&gt; information.<br/>\n<br/>\n </span></blockquote>But, but, but...reading for information is valuable! Don&#39;t separate  <br/>\nreading into &quot;reading for joy&quot; and &quot;reading for information.&quot; That&#39;s  <br/>\ntoo much pressure to put on anyone, especially a kid who seems to be  <br/>\nfeeling pressure to do what his brother is doing.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; And then, our 11 year old who&#39;s most recently out of school, doesn&#39;t<br/>\n&gt; seem to need deschooling like his brothers. Thomas&#39; experience in<br/>\n&gt; school has been very different too, he never struggled, he did well<br/>\n&gt; academically and was well liked by his teachers because he learned<br/>\n&gt; fast and wasn&#39;t difficult to deal with.<br/>\n<br/>\n </span></blockquote>That doesn&#39;t mean he wasn&#39;t adversely affected by school. Sometimes  <br/>\nit&#39;s the kids who do the best in school who suffer. They are living up  <br/>\nto people&#39;s expectations all the time, so for them to fail is an awful  <br/>\nthing.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  When<br/>\n&gt; he was in school last year, he told me he was worried about his<br/>\n&gt; brothers&#39; future because he saw they weren&#39;t doing school work and<br/>\n&gt; apparently weren&#39;t learning anything, how would they ever get into<br/>\n&gt; college...And he certainly did not want to homeschool and become like<br/>\n&gt; them.<br/>\n<br/>\n </span></blockquote>Uh, oh. This is school damage, right here.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; He changed his mind later though, when we told him about our<br/>\n&gt; travel plans. I actually think he would have started middle school<br/>\n&gt; with his friends if we hadn&#39;t planned to do a couple of long trips in<br/>\n&gt; the middle of the school year! And now that he IS home with us, he&#39;s<br/>\n&gt; enjoying it so much, he&#39;s never bored (a word his brothers use a lot).<br/>\n<br/>\n </span></blockquote>But he&#39;s the star, isn&#39;t he? The one who did wonderfully in school,  <br/>\nthe one who&#39;s no trouble, the one who always measures up.<br/>\n<br/>\nBe careful not to compare your twins to him. It&#39;s already apparent  <br/>\nthat there has been this dynamic amongst all the boys.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; As for my husband and I, we still have a lot of deschooling to do.<br/>\n<br/>\n </span></blockquote>I think you&#39;re right.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But I&#39;m still a little<br/>\n&gt; afraid in the back of my mind, I hope the boys will shine, that they<br/>\n&gt; will &quot;prove&quot; to their father that this is indeed the right path for<br/>\n&gt; us.<br/>\n<br/>\n </span></blockquote>By whose standards? Shine how? These are important questions to ask as  <br/>\nyou deschool.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; He values academic success, he wants them to get a college<br/>\n&gt; education, we can skip the entire school now but college is essential<br/>\n&gt; for him!<br/>\n<br/>\n </span></blockquote>Then *he* should go!<br/>\n<br/>\nI&#39;m being flippant, but really, part of deschooling is opening up to  <br/>\npossibilities. Those possibilities may or may not include college.  <br/>\nHowever, taking it one moment at at time is more important right now.  <br/>\nCollege is a long way off, in the scheme of things.<br/>\n<br/>\nSandra&#39;s words apply here: &quot;Read a little, try a little, wait a while,  <br/>\nwatch.&quot; Especially for the boys. They really need as much time as they  <br/>\nneed and it will be different for each one of them.<br/>\n<br/>\nFor you, I&#39;d suggest a lot more reading <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/deschooling\">http://sandradodd.com/deschooling</a> <br/>\n  (including all the links), plus Sandra&#39;s unschooling videos (some  <br/>\nYouTube and other links here: <a rel=\"nofollow\" target=\"_blank\" href=\"http://unschoolingmovie.info/\">http://unschoolingmovie.info/</a> ) to speed  <br/>\nup your deschooling. Sometimes re-reading and re-watching can make it  <br/>\nall sink in further.<br/>\n<br/>\nRobin B.</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Different needs for deschooling?","postDate":"1287349846","msgId":57843,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5Njc4MC42MDg5LnFtQHdlYjExMDQwOS5tYWlsLmdxMS55YWhvby5jb20+","inReplyToHeader":"PDg0NjU0MS43NzczOS5xbUB3ZWIxMTA0MTEubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PEFBTkxrVGlrdk9SWWk0YWRWRDRjRnJoeDh4TmtoTUVuLU9Ib0drcjE2MzdLTUBtYWlsLmdtYWlsLmNvbT4gPDg0NjU0MS43NzczOS5xbUB3ZWIxMTA0MTEubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":57842,"nextInTopic":57849,"prevInTime":57842,"nextInTime":57844,"topicId":57832,"numMessagesInTopic":0,"msgSnippet":"***Pokemon is just one thing a kid could have a passion for, it could happen with anything. A while back, we did this brainstorming for fashion... here The","messageBody":"<div id=\"ygrps-yiv-815741749\">***Pokemon is just one thing a kid could have a passion for, it could happen <br/>\nwith <br/>\nanything. A while back, we did this brainstorming for fashion... here<br/>\nThe idea is also related to this***<br/>\n<br/>\nSorry about that!  Here&#39;s the links I was looking for.  One of which Schuyler <br/>\nput up.  The design one is fun though, and I love thinking in those terms <br/>\nbecause it really helps to see how natural learning can progress from one thing <br/>\nto the next and to the next and onward and forward!<br/>\n<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/connections/design\">http://sandradodd.com/connections/design</a><br/>\n<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/connections/\">http://sandradodd.com/connections/</a><br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Different needs for deschooling?","postDate":"1287349431","msgId":57842,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg0NjU0MS43NzczOS5xbUB3ZWIxMTA0MTEubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PEFBTkxrVGlrdk9SWWk0YWRWRDRjRnJoeDh4TmtoTUVuLU9Ib0drcjE2MzdLTUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEFBTkxrVGlrdk9SWWk0YWRWRDRjRnJoeDh4TmtoTUVuLU9Ib0drcjE2MzdLTUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":57841,"nextInTopic":57843,"prevInTime":57841,"nextInTime":57843,"topicId":57832,"numMessagesInTopic":0,"msgSnippet":"***He tells me every day about all the classes he wants to take to learn everything he s interested in. And that next year, he wants to go to school. Hm. I m ","messageBody":"<div id=\"ygrps-yiv-827508798\">***He tells me every day<br/>\nabout all the classes he wants to take to learn everything he&#39;s<br/>\ninterested in. And that next year, he wants to go to school. Hm. I&#39;m<br/>\ntelling him that I can teach him knitting, I&#39;ve ordered an Italian<br/>\ncourse for both of us to learn together, and there are lots of classes<br/>\noffered in our homeschool community so he can learn the other things<br/>\nhe wants to.***<br/>\n<br/>\nIt&#39;s really exciting to have a child excited about learning!  Deschooling takes <br/>\ntime.  He&#39;s still seeing learning as something external that is done TO him, as <br/>\nopposed to learning that just is.  Compare that to your other two children for a <br/>\nsecond....<br/>\n<br/>\n***He reads about Pokemon characters on<br/>\npokemon.com and wants to watch every episode of Pokemon there and on<br/>\nYouTube (with his twin brother). But he hasn&#39;t had a &quot;break through&quot;<br/>\nyet, he&#39;s still negative, bored, uninterested in things (except<br/>\nPokemon). ***<br/>\n<br/>\nAND<br/>\n<br/>\n***It doesn&#39;t seem to me that my oldest son is deschooling,<br/>\nhe seems to have gone straight to unschooling. He&#39;s doing great, he&#39;s<br/>\nfollowing his interests, his relationship with his brothers has never<br/>\nbeen better (they used to fight MUCH more when he was in school). When<br/>\nhe was in school last year, he told me he was worried about his<br/>\nbrothers&#39; future because he saw they weren&#39;t doing school work and<br/>\napparently weren&#39;t learning anything, how would they ever get into<br/>\ncollege... And he certainly did not want to homeschool and become like<br/>\nthem. He changed his mind later though, when we told him about our<br/>\ntravel plans.***<br/>\n<br/>\nIt seems that Alexander is very very typical of what happens in deschooling. <br/>\n He&#39;s recovering from school damage, isn&#39;t living in school thought and is <br/>\nexploring something he loves.<br/>\n<br/>\nThe oldest, while his experience in school was a good one, and perhaps he <br/>\nintends to go back, doesn&#39;t seem to be deschooling at all.  He&#39;s still got <br/>\nschool in the back of his mind.  After a year of playing and traveling, he might <br/>\nbe in a whole different place than he is right now.<br/>\n<br/>\nOne of the best things about unschooling is how relationships change within a <br/>\nfamily!  Kids get along better, it&#39;s really wonderful!<br/>\n<br/>\nSchuyler beat me to it, but what she said about about you needing to do some <br/>\ndeschooling is really important!  If ALL learning is viewed as learning then <br/>\nnatural learning can unfold.  If some learning is better than other learning, it <br/>\nstops that from happening.  Parents can get in the way of that process if they <br/>\nare looking for learning that looks like school.  If everything is divided up in <br/>\na person&#39;s mind, where one thing is educational and one way of learning it is <br/>\nbetter than another, it will stunt seeing natural learning happening.<br/>\n<br/>\nPokemon is one of those things that can lead to everything else in the whole <br/>\nwide world!  It amazes me all the time just how much Pokemon has impacted our <br/>\nlives in so many positive ways.  There is so much learning in Pokemon, just the <br/>\ngame itself has strategy, math, memorization, art, story, and just so much to <br/>\nit.  The way it works though, is that Pokemon will lead a person&#39;s thought to <br/>\nanother thing, and another experience can be related to Pokemon.  A kid can <br/>\nwatch a youtube video and catch a reference to Pokemon, get it, and connect it <br/>\nto something else.  All those little connections happen all day long, every day. <br/>\n The more a kid can experience that and grow and change and learn and add to it, <br/>\nthe more they will know and relate to the world.  I can see how Pokemon is at <br/>\nthe base of EVERYthing that my older daughter knows and loves, from loving <br/>\nanimals, to being a vegetarian, to anime, to horror movies, to makeup, to <br/>\ncostuming, to cutting hair, to ALL of it.  It left a trail of ideas that I can <br/>\nfollow all the way back to when she was 4 and first started watching Pokemon.<br/>\n<br/>\nPokemon is just one thing a kid could have a passion for, it could happen with <br/>\nanything.  A while back, we did this brainstorming for fashion... here<br/>\nThe idea is also related to this<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Different needs for deschooling?","postDate":"1287345526","msgId":57841,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk0MTg0My40NzE5MC5xbUB3ZWI4NjIwMS5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PDQwMjQwMTRBLTkzMTMtNDdGMS1BOEZFLTUyRDNFMzY5MUFBQkBjb21jYXN0Lm5ldD4=","referencesHeader":"PEFBTkxrVGlrdk9SWWk0YWRWRDRjRnJoeDh4TmtoTUVuLU9Ib0drcjE2MzdLTUBtYWlsLmdtYWlsLmNvbT4gPDk4NzE0LjQ0MTIucW1Ad2ViODYyMDEubWFpbC5pcmQueWFob28uY29tPiA8OENEM0MzNjkyQUFEODc1LTg5OC0xQjkxN0B3ZWJtYWlsLWQwMzEuc3lzb3BzLmFvbC5jb20+IDw0MDI0MDE0QS05MzEzLTQ3RjEtQThGRS01MkQzRTM2OTFBQUJAY29tY2FzdC5uZXQ+"},"prevInTopic":57840,"nextInTopic":57842,"prevInTime":57840,"nextInTime":57842,"topicId":57832,"numMessagesInTopic":0,"msgSnippet":"http://sandradodd.com/game/pokemon.html works fine for me. Maybe it came through with the period attached in your e-mail box. Schuyler ","messageBody":"<div id=\"ygrps-yiv-2093421577\"><a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/game/pokemon.html\">http://sandradodd.com/game/pokemon.html</a> works fine for me. Maybe it came through <br/>\nwith the period attached in your e-mail box. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Robin Bentley &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:robin.bentley@...\">robin.bentley@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nSent: Sunday, 17 October, 2010 20:50:06<br/>\nSubject: Re: [AlwaysLearning] Different needs for deschooling?<br/>\n<br/>\nThe link works for me. But you can try this alternate route:<br/>\n<br/>\nGo to <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/unschooling\">http://sandradodd.com/unschooling</a><br/>\n<br/>\nScroll down to the Google site search and type in Pokemon. The fourth  <br/>\nlink down is the article Schuyler&#39;s referring to. You&#39;ll find many  <br/>\nmore links, too.<br/>\n<br/>\nRobin B.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Different needs for deschooling?","postDate":"1287345006","msgId":57840,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQwMjQwMTRBLTkzMTMtNDdGMS1BOEZFLTUyRDNFMzY5MUFBQkBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PDhDRDNDMzY5MkFBRDg3NS04OTgtMUI5MTdAd2VibWFpbC1kMDMxLnN5c29wcy5hb2wuY29tPg==","referencesHeader":"PEFBTkxrVGlrdk9SWWk0YWRWRDRjRnJoeDh4TmtoTUVuLU9Ib0drcjE2MzdLTUBtYWlsLmdtYWlsLmNvbT4gPDk4NzE0LjQ0MTIucW1Ad2ViODYyMDEubWFpbC5pcmQueWFob28uY29tPiA8OENEM0MzNjkyQUFEODc1LTg5OC0xQjkxN0B3ZWJtYWlsLWQwMzEuc3lzb3BzLmFvbC5jb20+"},"prevInTopic":57839,"nextInTopic":57841,"prevInTime":57839,"nextInTime":57841,"topicId":57832,"numMessagesInTopic":0,"msgSnippet":"The link works for me. But you can try this alternate route: Go to http://sandradodd.com/unschooling Scroll down to the Google site search and type in Pokemon.","messageBody":"<div id=\"ygrps-yiv-971061064\">The link works for me. But you can try this alternate route:<br/>\n<br/>\nGo to <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/unschooling\">http://sandradodd.com/unschooling</a><br/>\n<br/>\nScroll down to the Google site search and type in Pokemon. The fourth  <br/>\nlink down is the article Schuyler&#39;s referring to. You&#39;ll find many  <br/>\nmore links, too.<br/>\n<br/>\nRobin B.</div>","specialLinks":[]},{"userId":67727291,"authorName":"wtexans","from":"&quot;wtexans&quot; &lt;wtexans@...&gt;","profile":"wtexans","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Different needs for deschooling?","postDate":"1287344690","msgId":57839,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk5ZmpuaSs4b3BhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDhDRDNDMzY5MkFBRDg3NS04OTgtMUI5MTdAd2VibWFpbC1kMDMxLnN5c29wcy5hb2wuY29tPg=="},"prevInTopic":57838,"nextInTopic":57840,"prevInTime":57838,"nextInTime":57840,"topicId":57832,"numMessagesInTopic":0,"msgSnippet":"===Drats the link to the PokeMon isn t working, do you have another link for it?=== This may be what Schuyler was referring to:","messageBody":"<div id=\"ygrps-yiv-581070413\">===Drats the link to the PokeMon isn&#39;t working, do you have another link for it?===<br/>\n<br/>\nThis may be what Schuyler was referring to: <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/schuyler/tv.\">http://sandradodd.com/schuyler/tv.</a><br/>\n<br/>\nGlenda</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Different needs for deschooling?","postDate":"1287342489","msgId":57837,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk5ZmhpcCtqbmN0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFBTkxrVGlrdk9SWWk0YWRWRDRjRnJoeDh4TmtoTUVuLU9Ib0drcjE2MzdLTUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":57834,"nextInTopic":57838,"prevInTime":57836,"nextInTime":57838,"topicId":57832,"numMessagesInTopic":0,"msgSnippet":"... If you haven t found them, yet, look at graphic novels - there are a bunch of pokemon books. Also if y all don t have them yet, look for the strategy","messageBody":"<div id=\"ygrps-yiv-363519185\">Katrine Clip &lt;katrine@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;If they had had an &quot;all about<br/>\n&gt; Pokemon characters&quot; he would have asked for it!<br/>\n<br/>\n </span></blockquote>If you haven&#39;t found them, yet, look at graphic novels - there are a bunch of pokemon books. Also if y&#39;all don&#39;t have them yet, look for the strategy guides for the various games. Does he have a pokedex? There are some online...Mo likes this one:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://pokemondb.net/pokedex\">http://pokemondb.net/pokedex</a><br/>\n<br/>\nDon&#39;t wait for him to ask for things! Offer things you&#39;ve seen him interested in. If you&#39;re at a bookstore, take the time to find the pokemon books - ask a salesperson. If they don&#39;t have any, stop at another bookstore, maybe. See offering as a kind of pampering, though - not as a way to push an agenda of &quot;its good to do xyz&quot; on him. If he doesn&#39;t want a book, how about a milkshake?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My question about deschooling is then: does everybody need<br/>\n&gt; deschooling? It doesn&#39;t seem to me that my oldest son is deschooling,<br/>\n&gt; he seems to have gone straight to unschooling.<br/>\n<br/>\n </span></blockquote>Every person is different, and the deschooling &quot;formula&quot; is just a guideline so that parents don&#39;t panic eight weeks or three months in and say &quot;OMG its Not Working&quot; - well, &quot;it&quot; hasn&#39;t started yet. Transitioning away from school is different for everyone, though - think about different people&#39;s experiences when they first go to college, or first get a job, or first get married. There are generalities, but some people are more different than others. <br/>\n<br/>\nYour son has dived into a passion - that&#39;s great! Likely he still has some school baggage to deschool from, but its possible that will happen gradually, painlessly. Or, he could panic in a couple years, wondering if he should try high school or take some classes for his own good - questions like that can lurk in the back of people&#39;s minds and you really won&#39;t know until later. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;he&#39;s never bored (a word his brothers use a lot).<br/>\n<br/>\n </span></blockquote>If they&#39;re saying they&#39;re bored then they need more engagement. They may not know how to discover what interests them at this point, so offer fun things, goofy things, light things.... If you&#39;re in the northern hemisphere, see if they want to do silly fall things like go to corn mazes or haunted houses. At 9, they may feel like they need some permission to still like little kid stuff - 9yos do, but school teaches them to be cynical about all that, so they may need support being goofy and childish sometimes.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":286002181,"authorName":"Sunnyoneof1@aol.com","from":"Sunnyoneof1@...","profile":"sunny1of1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Different needs for deschooling?","postDate":"1287335961","msgId":57838,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDRDNDMzY5MkFBRDg3NS04OTgtMUI5MTdAd2VibWFpbC1kMDMxLnN5c29wcy5hb2wuY29tPg==","inReplyToHeader":"PDk4NzE0LjQ0MTIucW1Ad2ViODYyMDEubWFpbC5pcmQueWFob28uY29tPg==","referencesHeader":"PEFBTkxrVGlrdk9SWWk0YWRWRDRjRnJoeDh4TmtoTUVuLU9Ib0drcjE2MzdLTUBtYWlsLmdtYWlsLmNvbT4gPDk4NzE0LjQ0MTIucW1Ad2ViODYyMDEubWFpbC5pcmQueWFob28uY29tPg=="},"prevInTopic":57837,"nextInTopic":57839,"prevInTime":57837,"nextInTime":57839,"topicId":57832,"numMessagesInTopic":0,"msgSnippet":"Schuyler, Drats the link to the PokeMon isn t working, do you have another link for it? We just started playing PokeMon. Thanks Cheryl ... From: Schuyler","messageBody":"<div id=\"ygrps-yiv-2032978582\">Schuyler,<br/>\nDrats the link to the PokeMon isn&#39;t working, do you have another link for it? We just started playing PokeMon. Thanks Cheryl<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n-----Original Message-----<br/>\nFrom: Schuyler &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:s.waynforth@...\">s.waynforth@...</a>&gt;<br/>\nTo: AlwaysLearning &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>&gt;<br/>\nSent: Sun, Oct 17, 2010 12:40 am<br/>\nSubject: Re: [AlwaysLearning] Different needs for deschooling?<br/>\n<br/>\n<br/>\n  <br/>\n    <br/>\n                  <br/>\nFrom what you&#39;ve written, your absolute joy at your son Daniel wanting to <br/>\nexplore the world in a fairly academic way and then the down note of your son <br/>\nAlexander not embracing academic learning, it sounds like you may need to <br/>\ndeschool for a while longer as well. Kelly Lovejoy wrote about the stages of <br/>\nunschooling which may give you some greater perspective on the <br/>\napproach <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/kellylovejoy/stages.\">http://sandradodd.com/kellylovejoy/stages.</a> Learning isn&#39;t limited to <br/>\nreading and writing and studying a foreign language and spelling. Learning is <br/>\nabout exploring and discovering the world. And the tools that are used to do <br/>\nthat vary from person to person and moment to moment. It may help you to explore <br/>\nsome of Howard Gardener&#39;s stuff on multiple intelligence. Sandra has gathered <br/>\ntogether and narrated a nice page on it <br/>\nhere: <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/intelligences/.\">http://sandradodd.com/intelligences/.</a> I would recommend that you spend <br/>\ntime just hanging with your boys and not worrying about what they are doing so <br/>\nmuch. See each day as a fantastic opportunity to be together and don&#39;t look for <br/>\nsome end product other than, maybe, the joy of a day well enjoyed. <br/>\n<br/>\nUnschooling isn&#39;t about replicating school without the pressure. It&#39;s about <br/>\nrecognizing that school is a construct that has a fairly narrow vision of what <br/>\nan education entails. There is a video going around facebook at the moment that <br/>\nThe RSA did around the words of Sir Ken <br/>\nRobinson: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.youtube.com/watch?v=zDZFcDGpL4U&feature=player_embedded.\">http://www.youtube.com/watch?v=zDZFcDGpL4U&feature=player_embedded.</a> <br/>\nSir Robinson talks in very sweeping ways about the structure of school and the <br/>\nhistory of school and how it isn&#39;t fit to purpose any more because the purpose <br/>\nthat it originated with isn&#39;t fit to modern life. John Taylor Gatto has written <br/>\na lot as well about the history of, at least, the Eastern seaboard&#39;s education <br/>\nsystem. And you can probably look up how the King of Prussia originally set up <br/>\npublic schools as an indoctrination tool (or I <br/>\ncan: <a rel=\"nofollow\" target=\"_blank\" href=\"http://en.wikipedia.org/wiki/Prussian_education_system)\">http://en.wikipedia.org/wiki/Prussian_education_system)</a>. <br/>\n<br/>\nPokemon are really cool. They cover so much of the world. I wrote something <br/>\nabout Pokemon ages ago that Sandra kept <br/>\nhere: <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/game/pokemon.html.\">http://sandradodd.com/game/pokemon.html.</a> I can remember spending a day <br/>\nmeasuring out the height of each Pokemon so that Simon could better imagine <br/>\nwalking alongside them, or battling with them. Ultimately, I suppose, it gave <br/>\nhim a better sense of feet and inches, or centimetres and metres, but <br/>\nproximately it was fun and engaging and a cool way to explore Pokemon. There are <br/>\nlots of cool guide books on Pokemon. We have many of them. The favourite for a <br/>\nlong time was one we picked up at a used bookstore. It was only the first 101, <br/>\nmaking it to Mew 2, but it had lots of details and a poster. If Simon were awake <br/>\nI&#39;d ask for a recommendation. Actually the walkthrough books for the games have <br/>\na lot of detail which might be something that he would enjoy. It helps to see <br/>\nhow humans look for patterns and connections. If you feel your child is stuck <br/>\nwith one interest think about the connectedness of ideas and how one thing can <br/>\nbe a tool for exploring so much of the world. Again, turning to Sandra&#39;s <br/>\nfantastic labyrinthine site (with a search <br/>\ntool) <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/connections/\">http://sandradodd.com/connections/</a> may help you to see the truth of that. <br/>\nHere&#39;s Jenny Cyphers writing about the world of learning that dance opened up <br/>\nfor her: <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/jennycyphers/dance.\">http://sandradodd.com/jennycyphers/dance.</a> Here&#39;s Elvis as a tour guide <br/>\nto the world: <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/dot/elvis.\">http://sandradodd.com/dot/elvis.</a> The melange of a life leading to <br/>\na point, kind of, instead of a single idea to pivot out <br/>\nfrom: <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/dot/hypotenuse.\">http://sandradodd.com/dot/hypotenuse.</a> <br/>\nShakespeare: <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/strew/shakespeare.\">http://sandradodd.com/strew/shakespeare.</a> Ah, and this, the <br/>\ncenterpiece: <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/connections/design,\">http://sandradodd.com/connections/design,</a> a study by many voices in <br/>\nhow connected the world is if you just start from one point and pivot out. <br/>\n<br/>\nLearning is vast. And the resources available now are absolutely amazing and so <br/>\noften just at your fingertips. I&#39;ve been learning the ukulele and while I&#39;m not <br/>\nbrilliant at it I&#39;m moving toward a kind of competence. I&#39;ve had no tuition <br/>\nother than exploring the internet and watching the way people strum in videos <br/>\nand finding fantastically helpful sites. And the only thing that&#39;s kept me going <br/>\nis my own engagement. It&#39;s without a goal, just amusement. But because of it I <br/>\nhave a greater understanding of musical timing and chord families and tuning and <br/>\nstructure and a better ear. David&#39;s wearying a bit of the song Ukulele Lady so I <br/>\ntry and only play that one when he&#39;s at work or asleep or in another room. But <br/>\notherwise it&#39;s a fairly unlimited pursuit. <br/>\n<br/>\nYou asked if there are degrees of needing to deschool and I think you may need <br/>\nthe most. If it&#39;s a month for every year in school, you&#39;ve probably banked the <br/>\ngreatest indoctrination into the belief that school is a valuable means to an <br/>\nend. And remember, every single time you look to school methods for the answers <br/>\nyou have to start again. Stay with the idea of a vacation. Keep looking for <br/>\nthings that each of your children may enjoy without expecting them too and offer <br/>\nthem without strings. For those with interests in Pokemon get some games, the <br/>\nboard games are fun, get books, or costumes, or cards, or videos, or explore <br/>\nsome of the Ghibli studios stuff and see if your kids like Howl&#39;s Moving Castle <br/>\nor the fantastic Totoro or Kiki&#39;s Delivery Service. Find pleasure in the day <br/>\ninstead of learning opportunities. Architecture is everywhere, archery, with <br/>\nenough space, can be a cool backyard activity. You could get nerf guns and set <br/>\nup pokemon figures and shoot them down. We used to have the best B&#39;damen battles <br/>\nwith lots of figures and marbles flying at them on the building block forts. I <br/>\nfound this via Christine <br/>\nYablonski: <a rel=\"nofollow\" target=\"_blank\" href=\"http://store.sportswordstore.com/fiflfoar.html\">http://store.sportswordstore.com/fiflfoar.html</a> that could be a nice <br/>\nmeans to target practice. <br/>\n<br/>\nThe fact that Daniel is embracing such a schoolish approach suggests that he <br/>\nstill needs a lot of deschooling. Not that you need to frown on his academic <br/>\npursuits, but he may see them as the only means to becoming an educated adult. <br/>\nSo breathe and relax and find fun things to do and watch and listen to and hang <br/>\nout near and mix it up without any pressure. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n    <br/>\n             <br/>\n<br/>\n  <br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[{"url":"http://www.youtube.com/embed/zDZFcDGpL4U?wmode=opaque","type":"VIDEO"}]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Different needs for deschooling?","postDate":"1287308410","msgId":57834,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk4NzE0LjQ0MTIucW1Ad2ViODYyMDEubWFpbC5pcmQueWFob28uY29tPg==","inReplyToHeader":"PEFBTkxrVGlrdk9SWWk0YWRWRDRjRnJoeDh4TmtoTUVuLU9Ib0drcjE2MzdLTUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEFBTkxrVGlrdk9SWWk0YWRWRDRjRnJoeDh4TmtoTUVuLU9Ib0drcjE2MzdLTUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":57832,"nextInTopic":57837,"prevInTime":57833,"nextInTime":57835,"topicId":57832,"numMessagesInTopic":0,"msgSnippet":"From what you ve written, your absolute joy at your son Daniel wanting to explore the world in a fairly academic way and then the down note of your son ","messageBody":"<div id=\"ygrps-yiv-181129555\">From what you&#39;ve written, your absolute joy at your son Daniel wanting to <br/>\nexplore the world in a fairly academic way and then the down note of your son <br/>\nAlexander not embracing academic learning, it sounds like you may need to <br/>\ndeschool for a while longer as well. Kelly Lovejoy wrote about the stages of <br/>\nunschooling which may give you some greater perspective on the <br/>\napproach <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/kellylovejoy/stages.\">http://sandradodd.com/kellylovejoy/stages.</a> Learning isn&#39;t limited to <br/>\nreading and writing and studying a foreign language and spelling. Learning is <br/>\nabout exploring and discovering the world. And the tools that are used to do <br/>\nthat vary from person to person and moment to moment. It may help you to explore <br/>\nsome of Howard Gardener&#39;s stuff on multiple intelligence. Sandra has gathered <br/>\ntogether and narrated a nice page on it <br/>\nhere: <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/intelligences/.\">http://sandradodd.com/intelligences/.</a> I would recommend that you spend <br/>\ntime just hanging with your boys and not worrying about what they are doing so <br/>\nmuch. See each day as a fantastic opportunity to be together and don&#39;t look for <br/>\nsome end product other than, maybe, the joy of a day well enjoyed. <br/>\n<br/>\nUnschooling isn&#39;t about replicating school without the pressure. It&#39;s about <br/>\nrecognizing that school is a construct that has a fairly narrow vision of what <br/>\nan education entails. There is a video going around facebook at the moment that <br/>\nThe RSA did around the words of Sir Ken <br/>\nRobinson: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.youtube.com/watch?v=zDZFcDGpL4U&feature=player_embedded.\">http://www.youtube.com/watch?v=zDZFcDGpL4U&feature=player_embedded.</a> <br/>\nSir Robinson talks in very sweeping ways about the structure of school and the <br/>\nhistory of school and how it isn&#39;t fit to purpose any more because the purpose <br/>\nthat it originated with isn&#39;t fit to modern life. John Taylor Gatto has written <br/>\na lot as well about the history of, at least, the Eastern seaboard&#39;s education <br/>\nsystem. And you can probably look up how the King of Prussia originally set up <br/>\npublic schools as an indoctrination tool (or I <br/>\ncan: <a rel=\"nofollow\" target=\"_blank\" href=\"http://en.wikipedia.org/wiki/Prussian_education_system)\">http://en.wikipedia.org/wiki/Prussian_education_system)</a>. <br/>\n<br/>\nPokemon are really cool. They cover so much of the world. I wrote something <br/>\nabout Pokemon ages ago that Sandra kept <br/>\nhere: <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/game/pokemon.html.\">http://sandradodd.com/game/pokemon.html.</a> I can remember spending a day <br/>\nmeasuring out the height of each Pokemon so that Simon could better imagine <br/>\nwalking alongside them, or battling with them. Ultimately, I suppose, it gave <br/>\nhim a better sense of feet and inches, or centimetres and metres, but <br/>\nproximately it was fun and engaging and a cool way to explore Pokemon. There are <br/>\nlots of cool guide books on Pokemon. We have many of them. The favourite for a <br/>\nlong time was one we picked up at a used bookstore. It was only the first 101, <br/>\nmaking it to Mew 2, but it had lots of details and a poster. If Simon were awake <br/>\nI&#39;d ask for a recommendation. Actually the walkthrough books for the games have <br/>\na lot of detail which might be something that he would enjoy. It helps to see <br/>\nhow humans look for patterns and connections. If you feel your child is stuck <br/>\nwith one interest think about the connectedness of ideas and how one thing can <br/>\nbe a tool for exploring so much of the world. Again, turning to Sandra&#39;s <br/>\nfantastic labyrinthine site (with a search <br/>\ntool) <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/connections/\">http://sandradodd.com/connections/</a> may help you to see the truth of that. <br/>\nHere&#39;s Jenny Cyphers writing about the world of learning that dance opened up <br/>\nfor her: <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/jennycyphers/dance.\">http://sandradodd.com/jennycyphers/dance.</a> Here&#39;s Elvis as a tour guide <br/>\nto the world: <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/dot/elvis.\">http://sandradodd.com/dot/elvis.</a> The melange of a life leading to <br/>\na point, kind of, instead of a single idea to pivot out <br/>\nfrom: <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/dot/hypotenuse.\">http://sandradodd.com/dot/hypotenuse.</a> <br/>\nShakespeare: <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/strew/shakespeare.\">http://sandradodd.com/strew/shakespeare.</a> Ah, and this, the <br/>\ncenterpiece: <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/connections/design,\">http://sandradodd.com/connections/design,</a> a study by many voices in <br/>\nhow connected the world is if you just start from one point and pivot out. <br/>\n<br/>\nLearning is vast. And the resources available now are absolutely amazing and so <br/>\noften just at your fingertips. I&#39;ve been learning the ukulele and while I&#39;m not <br/>\nbrilliant at it I&#39;m moving toward a kind of competence. I&#39;ve had no tuition <br/>\nother than exploring the internet and watching the way people strum in videos <br/>\nand finding fantastically helpful sites. And the only thing that&#39;s kept me going <br/>\nis my own engagement. It&#39;s without a goal, just amusement. But because of it I <br/>\nhave a greater understanding of musical timing and chord families and tuning and <br/>\nstructure and a better ear. David&#39;s wearying a bit of the song Ukulele Lady so I <br/>\ntry and only play that one when he&#39;s at work or asleep or in another room. But <br/>\notherwise it&#39;s a fairly unlimited pursuit. <br/>\n<br/>\nYou asked if there are degrees of needing to deschool and I think you may need <br/>\nthe most. If it&#39;s a month for every year in school, you&#39;ve probably banked the <br/>\ngreatest indoctrination into the belief that school is a valuable means to an <br/>\nend. And remember, every single time you look to school methods for the answers <br/>\nyou have to start again. Stay with the idea of a vacation. Keep looking for <br/>\nthings that each of your children may enjoy without expecting them too and offer <br/>\nthem without strings. For those with interests in Pokemon get some games, the <br/>\nboard games are fun, get books, or costumes, or cards, or videos, or explore <br/>\nsome of the Ghibli studios stuff and see if your kids like Howl&#39;s Moving Castle <br/>\nor the fantastic Totoro or Kiki&#39;s Delivery Service. Find pleasure in the day <br/>\ninstead of learning opportunities. Architecture is everywhere, archery, with <br/>\nenough space, can be a cool backyard activity. You could get nerf guns and set <br/>\nup pokemon figures and shoot them down. We used to have the best B&#39;damen battles <br/>\nwith lots of figures and marbles flying at them on the building block forts. I <br/>\nfound this via Christine <br/>\nYablonski: <a rel=\"nofollow\" target=\"_blank\" href=\"http://store.sportswordstore.com/fiflfoar.html\">http://store.sportswordstore.com/fiflfoar.html</a> that could be a nice <br/>\nmeans to target practice. <br/>\n<br/>\nThe fact that Daniel is embracing such a schoolish approach suggests that he <br/>\nstill needs a lot of deschooling. Not that you need to frown on his academic <br/>\npursuits, but he may see them as the only means to becoming an educated adult. <br/>\nSo breathe and relax and find fun things to do and watch and listen to and hang <br/>\nout near and mix it up without any pressure. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[{"url":"http://www.youtube.com/embed/zDZFcDGpL4U?wmode=opaque","type":"VIDEO"}]},{"userId":139171607,"authorName":"Katrine Clip","from":"Katrine Clip &lt;katrine@...&gt;","profile":"kaclip","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Different needs for deschooling?","postDate":"1287268143","msgId":57832,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGlrdk9SWWk0YWRWRDRjRnJoeDh4TmtoTUVuLU9Ib0drcjE2MzdLTUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":57834,"prevInTime":57831,"nextInTime":57833,"topicId":57832,"numMessagesInTopic":0,"msgSnippet":"It s been a year since we pulled our twin boys (now 9) out of school in 2nd grade. Our oldest son (11) finished 5th grade last school year and has been home","messageBody":"<div id=\"ygrps-yiv-77742055\">It&#39;s been a year since we pulled our twin boys (now 9) out of school<br/>\nin 2nd grade. Our oldest son (11) finished 5th grade last school year<br/>\nand has been home since then! The twins struggled with school and<br/>\nexpectations, repeated 1st grade, had lots of tutoring and one of them<br/>\nhad an IEP because of the ADHD label. We have been<br/>\ndeschooling/unschooling for a year now with them.<br/>\n<br/>\nI&#39;m seeing one of my twins really coming out of his deschooling the<br/>\nlast few weeks. Daniel is now a happy, sunny child, curious about<br/>\neverything and wanting to learn about everything around him. He wants<br/>\nto read and write again, wants to learn Italian, architecture,<br/>\narchery, knitting..... Last week he picked up a &quot;Diary of a Wimpy Kid&quot;<br/>\nbook and read it all in a few days. He&#39;s never read a book before!<br/>\nNow, he&#39;s using my computer a lot to write a diary like the book. He&#39;s<br/>\nasking for spelling and I&#39;m delighted to help! He tells me every day<br/>\nabout all the classes he wants to take to learn everything he&#39;s<br/>\ninterested in. And that next year, he wants to go to school. Hm. I&#39;m<br/>\ntelling him that I can teach him knitting, I&#39;ve ordered an Italian<br/>\ncourse for both of us to learn together, and there are lots of classes<br/>\noffered in our homeschool community so he can learn the other things<br/>\nhe wants to.<br/>\n<br/>\nHis twin brother Alexander is quite different (though they are<br/>\nidentical;-) : His interests are Pokemon, like his brothers, and<br/>\nfantasy games involving Pokemon. He reads about Pokemon characters on<br/>\npokemon.com and wants to watch every episode of Pokemon there and on<br/>\nYouTube (with his twin brother). But he hasn&#39;t had a &quot;break through&quot;<br/>\nyet, he&#39;s still negative, bored, uninterested in things (except<br/>\nPokemon). I need to spend a lot more time with him, and be very<br/>\npatient and loving because he&#39;s so sensitive.<br/>\n<br/>\nI wonder if Alexander is feeling somehow in his twin brother&#39;s shadow?<br/>\nIs he jealous? When Daniel has a drawing phase, he&#39;s not doing it. Now<br/>\nthat Daniel suddenly wants to read, he definitely doesn&#39;t want to even<br/>\nwhen I offered to buy him a book too. He didn&#39;t see any that he liked<br/>\nthere when I got the book for Daniel. If they had had an &quot;all about<br/>\nPokemon characters&quot; he would have asked for it! I&#39;m looking at Amazon<br/>\nnow to see if I can find that, it would be very useful for him. He<br/>\nstill hasn&#39;t discovered the &quot;joy of reading&quot; but he reads for<br/>\ninformation.<br/>\n<br/>\nAnd then, our 11 year old who&#39;s most recently out of school, doesn&#39;t<br/>\nseem to need deschooling like his brothers. Thomas&#39; experience in<br/>\nschool has been very different too, he never struggled, he did well<br/>\nacademically and was well liked by his teachers because he learned<br/>\nfast and wasn&#39;t difficult to deal with. Since the beginning of summer,<br/>\nhe&#39;s been into everything Pokemon, he&#39;s living, breathing, dreaming,<br/>\ntalking, writing Pokemon. It&#39;s wonderful to see that he has all the<br/>\ntime he needs for his interest now. His dream is to become a Pokemon<br/>\nchampion, to participate in competitions world wide. He&#39;s writing<br/>\narticles and submitting to blogs and discussing with others on forums.<br/>\nHe&#39;s so happy. Luckily, my husband is playing and battling with the<br/>\nboys and learning about the strategies too. So he&#39;s able to understand<br/>\nwhat&#39;s going on, I&#39;m mostly an onlooker! And I see that there&#39;s an<br/>\nincredible amount of strategy and thought and focus needed to do what<br/>\nthey do.<br/>\n<br/>\nMy question about deschooling is then: does everybody need<br/>\ndeschooling? It doesn&#39;t seem to me that my oldest son is deschooling,<br/>\nhe seems to have gone straight to unschooling. He&#39;s doing great, he&#39;s<br/>\nfollowing his interests, his relationship with his brothers has never<br/>\nbeen better (they used to fight MUCH more when he was in school). When<br/>\nhe was in school last year, he told me he was worried about his<br/>\nbrothers&#39; future because he saw they weren&#39;t doing school work and<br/>\napparently weren&#39;t learning anything, how would they ever get into<br/>\ncollege... And he certainly did not want to homeschool and become like<br/>\nthem. He changed his mind later though, when we told him about our<br/>\ntravel plans. I actually think he would have started middle school<br/>\nwith his friends if we hadn&#39;t planned to do a couple of long trips in<br/>\nthe middle of the school year! And now that he IS home with us, he&#39;s<br/>\nenjoying it so much, he&#39;s never bored (a word his brothers use a lot).<br/>\n<br/>\nAs for my husband and I, we still have a lot of deschooling to do. I&#39;m<br/>\nso grateful we went to the conference in Sacramento in August, it<br/>\nhelped my husband understand more about unschooling and the need for<br/>\ndeschooling. He&#39;s been incredibly supportive since then. And he&#39;s<br/>\nwriting about it on Facebook and Twitter quite often! I&#39;m amazed at<br/>\nhow well things are going after a rough start when I wanted to<br/>\nhomeschool and unschool and he was against it. But I&#39;m still a little<br/>\nafraid in the back of my mind, I hope the boys will shine, that they<br/>\nwill &quot;prove&quot; to their father that this is indeed the right path for<br/>\nus. He values academic success, he wants them to get a college<br/>\neducation, we can skip the entire school now but college is essential<br/>\nfor him!<br/>\n<br/>\nThank you,<br/>\nKatrine</div>","specialLinks":[]}],"prevTopicId":57880,"nextTopicId":57928}}