{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":9,"messages":[{"userId":141316284,"authorName":"pam sorooshian","from":"pam sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] unschooling lifestyle","postDate":"1065120652","msgId":81936,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU4QjcyNDJDLUY1MDktMTFENy1BRUVFLTAwMEE5NUUyOTJDNkBtYWMuY29tPg==","inReplyToHeader":"PEJCQTFBM0ZGLjFGMjVBJWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":81904,"nextInTopic":0,"prevInTime":81935,"nextInTime":81937,"topicId":81844,"numMessagesInTopic":0,"msgSnippet":"... Most things that are considered sins are not religious in nature. Can you use sin and adultery in the same sentence? Sin and murder? Sin and","messageBody":"<div id=\"ygrps-yiv-1155972572\">On Thursday, October 2, 2003, at 06:44  AM, Fetteroll wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; The article which was referred to that listed &quot;unschooling as sin&quot;.  I<br/>\n&gt;&gt; totally disagreed with that statement.  The author is mixing a <br/>\n&gt;&gt; religious term<br/>\n&gt;&gt; with<br/>\n&gt;&gt; an &quot;educational method&quot;.  There is no way &quot;unschooling&quot; and &quot;sin&quot; can <br/>\n&gt;&gt; be used<br/>\n&gt;&gt; in the same phrase!!!<br/>\n<br/>\n </span></blockquote>Most things that are considered &quot;sins&quot; are not &quot;religious&quot; in nature. <br/>\nCan you use &quot;sin&quot; and adultery in the same sentence? &quot;Sin&quot; and murder? <br/>\n&quot;Sin&quot; and dishonesty? Unschooling is like adultery in some people&#39;s <br/>\nminds. It is not living up to what God demands of us - not obeying the <br/>\ncommands of God in regard to how to be married/how to raise children.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] unschooling lifestyle","postDate":"1065103842","msgId":81904,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc4LjQ4NGNjMDI0LjJjYWQ4YmUyQGFvbC5jb20+"},"prevInTopic":81902,"nextInTopic":81936,"prevInTime":81903,"nextInTime":81905,"topicId":81844,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/2/03 12:44:09 AM, spcparents@aol.com writes: ","messageBody":"<div id=\"ygrps-yiv-201098529\">In a message dated 10/2/03 12:44:09 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:spcparents@...\">spcparents@...</a> writes:<br/>\n<br/>\n&lt;&lt; I am not stating that one is bigger than the other, just that both sides <br/>\nare <br/>\n<br/>\noutspoken on this issue.  Neither are without their wrongdoings. &gt;&gt;<br/>\n<br/>\nRegarding the politics of homeschooling in the English speaking world, what <br/>\nwould you say are the &quot;wrongdoings&quot; of unschoolers?  Of secular homeschoolers?<br/>\n<br/>\n&lt;&lt;The article which was referred to that listed &quot;unschooling as sin&quot;.  I <br/>\n<br/>\ntotally disagreed with that statement.  The author is mixing a religious term <br/>\nwith <br/>\n<br/>\nan &quot;educational method&quot;.  There is no way &quot;unschooling&quot; and &quot;sin&quot; can be used <br/>\n<br/>\nin the same phrase!!!&gt;&gt;<br/>\n<br/>\nLots of people have done it, and explained their reasoning with Bible <br/>\nreferences.<br/>\n<br/>\n&lt;&lt;They&#39;re teaching <br/>\n<br/>\nrevisionist and particularly written-for-Christians history and science.<br/>\n<br/>\n<br/>\n&lt;&lt;What do we, unschoolers, care what anybody chooses for their &quot;teaching <br/>\n<br/>\ntools&quot;?? &gt;&gt;<br/>\n<br/>\nAs to teaching, I don&#39;t much care.<br/>\n<br/>\nAs to politics, they make us look stupid.  (They make themselves look stupid, <br/>\nand other homeschoolers by extension.)<br/>\n<br/>\nAs to the social ramificatons, my children will grow up and live side by <br/>\nsidewith people who have been fed a pack of lies their whole lives, AND part of <br/>\nthe package is that anyone who disputes anything they&#39;ve been taught is speaking <br/>\nwith the voice of Satan to test their faith and tempt their soul.  But that&#39;s <br/>\nnot what we&#39;ve been talking about here at all.  We&#39;ve been talking about the <br/>\npolitics of homes schooling, and the realities.<br/>\n<br/>\n&lt;&lt;HSLDA completely agrees that the govt should NOT have any say about what <br/>\n<br/>\ncurriculum is used within home education families. &gt;&gt;<br/>\n<br/>\nRight.  As long as they&#39;re using a curriculum.<br/>\n<br/>\n&lt;&lt; The bottom line, if anything happens <br/>\n<br/>\nand we call them for representation, we need to give them whatever we can <br/>\nthat <br/>\n<br/>\n&quot;proves&quot; our kid has received their home education. &gt;&gt;<br/>\n<br/>\nThey won&#39;t represent unschoolers.<br/>\n<br/>\n&lt;&lt; They know what &quot;unschooling&quot; is.  They also give full credit <br/>\n<br/>\nto Mr. Holt and unschoolers for &quot;spearheading&quot; the home education movement.  <br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;<br/>\n<br/>\n </span></blockquote>Cite something to prove this statement, please.<br/>\nQuote something, show us a website, or something.  Because what I&#39;ve seen in <br/>\nwriting from them is that Christian Homeschoolers made homeschooling legal in <br/>\nevery state.  It&#39;s a lie, but they tell it.<br/>\n<br/>\n&lt;&lt;Please do not get on the tangent about the cons of HSLDA. &gt;&gt;<br/>\n<br/>\nIt&#39;s central, not tangential.  It&#39;s at the core of what all homeschoolers <br/>\nneed to have at least a passing awareness of, if they intend to speak for <br/>\nhomeschooelrs in general at any level.  And it helps just for their own awareness so <br/>\nwhen they&#39;re in a rough conversation about homeschooling they&#39;re not caught <br/>\ndeer-in-the-headlights.<br/>\n<br/>\n&lt;&lt; I remember awhile back, Sandra there was an <br/>\n<br/>\n&quot;unschooling&quot; guide for use if you needed it to show the state as part of <br/>\nrecordkeeping.&gt;&gt;<br/>\n<br/>\nMaybe you mean Carol Narigon&#39;s sample for the state of Ohio.  It&#39;s here:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/unschoolingcurriculum\">http://sandradodd.com/unschoolingcurriculum</a><br/>\n<br/>\nI seriously doubt HSLDA would think much of it.   And it wasn&#39;t for <br/>\nrecordkeeping, it was for showing the state what a family intended to &quot;cover.&quot;<br/>\n<br/>\n&lt;&lt; This is what we basically developed and showed HSLDA, and that was fine.  <br/>\nIt <br/>\n<br/>\nwas sketchy, but it was an outline of the main goals.  Bottom line, if we <br/>\n<br/>\nneed them to represent them, they want &quot;something&quot; to show that judge.&gt;&gt;<br/>\n<br/>\nSo are you signed up with HSLDA?  Is that why you&#39;re trying to get people not <br/>\nto look at it, not to discuss it?<br/>\n<br/>\n&lt;&lt;How in the world does this affect <br/>\n<br/>\nunschoolers?? Unschoolers are brave enough to stand on their own 2 feet and <br/>\ncontinue <br/>\n<br/>\ntheir journey. &gt;&gt;<br/>\n<br/>\nWe&#39;ve been trying to tell you how it affects unschoolers and ALL <br/>\nhomeschoolers.<br/>\n<br/>\nSpc in Mo, how long have you been an unschooler, if you are an unschooler?<br/>\nHow old are your children?<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":77522235,"authorName":"Julie Bogart","from":"&quot;Julie Bogart&quot; &lt;julie@...&gt;","profile":"juliecinci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: unschooling lifestyle","postDate":"1065103095","msgId":81902,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJsaGF0bitnNmd1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJCQTFBM0ZGLjFGMjVBJWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":81901,"nextInTopic":81904,"prevInTime":81901,"nextInTime":81903,"topicId":81844,"numMessagesInTopic":0,"msgSnippet":"Joyce: The wording of petitions against the UN Children s Rights is designed to appeal to people beyond fundamentalist Christianity so they can tap voting","messageBody":"<div id=\"ygrps-yiv-1381816140\">Joyce: The wording of<br/>\npetitions against the UN Children&#39;s Rights is designed to appeal <br/>\nto people<br/>\nbeyond fundamentalist Christianity so they can tap voting power <br/>\nthat&#39;s<br/>\ngreater than their numbers. They&#39;re savvy, heavily funded, and <br/>\nwell<br/>\norganized. The opposing stance isn&#39;t. So which stance holds <br/>\nsway?<br/>\n<br/>\n--<br/>\n<br/>\nI had to read this twice. The Christian right always maintains tht <br/>\nis is the *other* side that is heavily-funded, orgbanzied and savvy <br/>\nwhile the Christina right is asleep to their duty to God and not <br/>\ngenerous enough in their pocketbooks or active enough <br/>\npolitically. Wonder which is truer?<br/>\n<br/>\nI enjoyed your whole post Joyce. What&#39;s amazing to me is that <br/>\nthere is anyone who homeschools who *isn&#39;t* aware of the <br/>\nChristian fundamentalist homeschooling world. <br/>\n<br/>\nThe other day, I rec&#39;d an invitation to hear a &quot;well-known&quot; speaker <br/>\n(never heard of him) defend our right to spank our children and <br/>\nhow the government is interfering with that right. He plans to <br/>\nprovide humorous situations that resulted from spanking in <br/>\nfamilies and cite statistics proving that spanked children are <br/>\nbetter-behaved than those who aren&#39;t. Finally, he plans to explain <br/>\nhow the government is opposing our freedom to parent as we <br/>\nwish. He&#39;s been on national TV shows where people are <br/>\nstunned by his radical approach to parenting.<br/>\n<br/>\nI rec&#39;d this flyer at a homeschool co-op that is deliberately <br/>\ninclusive of all Christian faiths, though not inclusive of all faiths. <br/>\nThe leadership didn&#39;t see a problem with the distribution of this <br/>\nflyer to all the constituents (not realizing that not every Christian <br/>\nspanks). But I&#39;ve been around this form of homeschooling my <br/>\nentier homeschooling life so it wasn&#39;t so shocking as it was a <br/>\nreminder that that part of homeschooling is alive and well and <br/>\noften, dominant.<br/>\n<br/>\nJulie B</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] unschooling lifestyle","postDate":"1065102271","msgId":81901,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJCQTFBM0ZGLjFGMjVBJWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGEzLjQ5OTg5OTU3LjJjYWQxMmFlQGFvbC5jb20+"},"prevInTopic":81887,"nextInTopic":81902,"prevInTime":81900,"nextInTime":81902,"topicId":81844,"numMessagesInTopic":0,"msgSnippet":"... There seem to be two separate discussions going on here. The arguments you re using to support your position are irrelevant to the discussion I m having. ","messageBody":"<div id=\"ygrps-yiv-1339366104\">on 10/2/03 1:33 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:spcparents@...\">spcparents@...</a> at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:spcparents@...\">spcparents@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I am not stating that one is bigger than the other, just that both sides are<br/>\n&gt; outspoken on this issue.  Neither are without their wrongdoings.<br/>\n<br/>\n </span></blockquote>There seem to be two separate discussions going on here. The arguments<br/>\nyou&#39;re using to support your position are irrelevant to the discussion I&#39;m<br/>\nhaving.<br/>\n<br/>\nThe discussion I&#39;m still having is passing on information about a political<br/>\nmovement within homeschooling that is invisible to many unschoolers and that<br/>\nit is important to be aware of for 2 reasons: 1) so people can be aware that<br/>\nnot all people who seem to be working for homeschooling rights -- like HSLDA<br/>\n-- are working towards what is best for all homeschoolers. They are working<br/>\ntowards what is best for their religious and political agenda, 2) so people<br/>\ncan offer informed opinions on the broad spectrum of what the word<br/>\nhomeschooling encompasses.<br/>\n<br/>\nYou seem to be arguing that divisions between people are wrong. No one here<br/>\nis supporting *creating* division or keeping separate from other<br/>\nhomeschoolers. <br/>\n<br/>\nYou seem to be arguing that not all fundamentalist Christians want to be<br/>\nseparate. No one here has said that.<br/>\n<br/>\nYou seem to be arguing that informing people of a political movement will<br/>\nserve to further divide us when we should be trying to work together. Well,<br/>\n1) I know the Christian Homeschooling movement doesn&#39;t want to work *with*<br/>\nme. But they do want me to believe they&#39;re working *for* me. 2) They want<br/>\nthe division to protect themselves. Why would I force a desire for working<br/>\ntogether towards a common goal on them? That would be rude.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Neither are without their wrongdoings.<br/>\n<br/>\n </span></blockquote>What kind of wrongdoings are you referring to?<br/>\n<br/>\nI think it&#39;s important for people to recognize the *effects* the Christian<br/>\nHomeschool movement could have on their own ability to homeschool. I would<br/>\nlabel Christian Homeschoolers manipulating wording in political activities<br/>\nso that it implies they&#39;re representing all homeschoolers as wrong doing.<br/>\n<br/>\nIf they&#39;d clearly represent their political actions as *only* representing<br/>\nthe Christian Homeschooling movement, then -- other than helping people<br/>\nunderstand the breadth of practices that the word homeschooling encompasses<br/>\n-- there&#39;d be little reason to discuss them.<br/>\n<br/>\nPeople often need a place to vent their frustrations with homeschooling<br/>\ngroups they thought were inclusive but turned out to exclusivistic (is that<br/>\na word?) Christian. It&#39;s sad that people get hurt but exclusive groups have<br/>\na right to exist. Being informed is the best cure. So people can avoid such<br/>\ngroups in the first place or at least go in knowing that their intent is to<br/>\nexclude.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I understand what &quot;secular&quot; means.  That is what was so odd about getting<br/>\n&gt; banned from that group.  When I joined it, I &quot;assumed&quot; unschoolers might be<br/>\n&gt; more <br/>\n&gt; prevalant (? on spelling) in a &quot;secular&quot; group!!! Surprise, surprise, need I<br/>\n&gt; say more!!!<br/>\n<br/>\n </span></blockquote>So it seems you don&#39;t know what secular means. Secular means not religiously<br/>\nbased. It says nothing about homeschooling style or how else they might<br/>\ndecide to separate themselves from other homeschooling groups.<br/>\n<br/>\nOn the other hand an inclusive group should be inclusive of styles as well<br/>\nas race and religion. If it isn&#39;t, then the people running are ignorant<br/>\nabout the breadth of styles that homeschooling encompasses and are perhaps<br/>\nassuming homeschooling is only the range they&#39;re familiar with.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I don&#39;t even refer to &quot;secular&quot; or &quot;christian&quot; in FIELD TRIPS!!!.  We&#39;re<br/>\n&gt; simply home educators and home education families. Just a bunch of Kids (ages<br/>\n&gt; preborn-?)<br/>\n<br/>\n </span></blockquote>Good for you!<br/>\n<br/>\nBut what does that have to do with the discussion about the existence of a<br/>\npolitically motivated Christian Homeschooling movement?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The article which was referred to that listed &quot;unschooling as sin&quot;.  I<br/>\n&gt; totally disagreed with that statement.  The author is mixing a religious term<br/>\n&gt; with <br/>\n&gt; an &quot;educational method&quot;.  There is no way &quot;unschooling&quot; and &quot;sin&quot; can be used<br/>\n&gt; in the same phrase!!!<br/>\n<br/>\n </span></blockquote>It is irrelevant whether you agree or not. The person who wrote it does<br/>\nagree and is part of a political group of people who also agree. People<br/>\nexist in large numbers who agree with the statement regardless of whether<br/>\nyou agree or not.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; What do we, unschoolers, care what anybody chooses for their &quot;teaching<br/>\n&gt; tools&quot;?? Let them, isn&#39;t that part of freedom to home education!!!<br/>\n<br/>\n </span></blockquote>Then you missed the point of why Sandra mentioned the types of science and<br/>\nhistory they teach. She isn&#39;t bringing it up because it&#39;s wrong for them to<br/>\ndo what they do. She brought it up because it&#39;s *why* they don&#39;t want the<br/>\ngovernment to look closely at what they do. I&#39;d also add in that they want<br/>\nto limit how far the government can look at what they do because they want<br/>\nto be able to parent in ways that the general population would frown on.<br/>\n<br/>\nIf we don&#39;t understand the goals of a group and why they&#39;re doing what<br/>\nthey&#39;re doing then it&#39;s harder to see the ramifications of legislation they<br/>\nmay try to get passed.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The issue <br/>\n&gt; I <br/>\n&gt; don&#39;t want is when the govt sticks its head in and says &quot;be under a certain<br/>\n&gt; curriculum/umbrella or don&#39;t home educate&quot;.<br/>\n<br/>\n </span></blockquote>Most people would willing to back legislation that ensures that freedom.<br/>\nMost people don&#39;t like to be politically involved. They like to support<br/>\nfellow homeschoolers who will doing the boring dull work for them. But they<br/>\nshould be aware that there are agendas homeschooling rights that are driving<br/>\nhomeschooling legislation.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; HSLDA completely agrees that the govt should NOT have any say about what<br/>\n&gt; curriculum is used within home education families.  HSLDA only asks that each<br/>\n&gt; family have a &quot;plan&quot;.<br/>\n<br/>\n </span></blockquote>On their application it says that the person signing it agrees:<br/>\n<br/>\nTo exercise diligence in teaching our children in a responsible way.<br/>\nTo use a clearly organized program of education to instruct our children.<br/>\nTo keep records of each child&#39;s educational progress.<br/>\n<br/>\nand<br/>\n<br/>\nThat all the information presented on this form to be best of our knowledge<br/>\nis true and accurate.<br/>\n<br/>\nThe first is vague and could be interpreted in whatever way HSLDA wants. It<br/>\nwould be a stretch for the second to describe unschooling. The third is<br/>\ndoable if necessary.<br/>\n<br/>\nCould an unschooler claim that it&#39;s true and accurate to describe<br/>\nunschooling as a &quot;clearly organized program&quot;? If HSLDA deems that your case<br/>\nwould harm their goal of keeping out government intrusion they can point to<br/>\nthat clause and say you misrepresented yourself.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I personally spoke, in person, with the attorney who<br/>\n&gt; represents Missouri concerning this &quot;plan&quot;.  The bottom line, if anything<br/>\n&gt; happens <br/>\n&gt; and we call them for representation, we need to give them whatever we can that<br/>\n&gt; &quot;proves&quot; our kid has received their home education.  Its simply giving them<br/>\n&gt; &quot;evidence&quot; that they can show a judge, if need be, to BACK off and get out of<br/>\n&gt; our <br/>\n&gt; HOME EDUCATION.  They know what &quot;unschooling&quot; is.  They also give full credit<br/>\n&gt; to Mr. Holt and unschoolers for &quot;spearheading&quot; the home education movement.<br/>\n<br/>\n </span></blockquote>They also state clearly somewhere that they can pick and choose who to<br/>\nrepresent. HSLDA is not legal insurance. They will choose which cases will<br/>\nfurther their own agenda. They will decide how to present a case that will<br/>\nhelp their political movement the most which may conflict with the needs of<br/>\nthe client.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Please do not get on the tangent about the cons of HSLDA.<br/>\n<br/>\n </span></blockquote>If you don&#39;t see how HSLDA ties in and that their political agenda is the<br/>\nsame political agenda driving the Christian Homeschooling movement, then you<br/>\naren&#39;t understanding what the discussion is about.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Bottom line, if we<br/>\n&gt; need them to represent them, they want &quot;something&quot; to show that judge.<br/>\n<br/>\n </span></blockquote>Obviously they want paper work to create a case from. But if your style of<br/>\nhomeschooling would hurt their agenda then they can decline to represent<br/>\nyou. They have no interest in helping unschoolers have an easier time<br/>\nhomeschooling. They only care about keeping the government out of the<br/>\nfamilies who hold the same views as they do. If your case would help them<br/>\nfurther that, then they&#39;d represent you. But if it hurt their goals, they&#39;d<br/>\nrefuse.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I understand this fact concerning a portion of the Christian Homeschooling<br/>\n&gt; Group.  They have made this choice.  How in the world does this affect<br/>\n&gt; unschoolers??<br/>\n<br/>\n </span></blockquote>Big money behind a big political movement that extends far beyond<br/>\nhomeschooling. Homeschooling is just the intersection between our lives and<br/>\ntheirs that we happen to be aware of. But there are lots of groups promoting<br/>\n&quot;family values&quot; that are also part of the political movement. The wording of<br/>\npetitions against the UN Children&#39;s Rights is designed to appeal to people<br/>\nbeyond fundamentalist Christianity so they can tap voting power that&#39;s<br/>\ngreater than their numbers. They&#39;re savvy, heavily funded, and well<br/>\norganized. The opposing stance isn&#39;t. So which stance holds sway?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Unschoolers are brave enough to stand on their own 2 feet and<br/>\n&gt; continue <br/>\n&gt; their journey.  Some unschoolers have chosen they do not want to join groups<br/>\n&gt; that require these statements.  If they wanted to, and they tried, when they<br/>\n&gt; knew <br/>\n&gt; they would not be accepted, why join?  Find another group.  What&#39;s the deal??<br/>\n&gt; I&#39;m confused on this one.<br/>\n<br/>\n </span></blockquote>Some people join perfectly fine groups that then turn Statement of Faith.<br/>\n<br/>\nSome people assume that any homeschooling group is all inclusive and it<br/>\ntakes time to pick up the clues. Even a statement of faith may seem<br/>\ninnocuous.<br/>\n<br/>\nSome people don&#39;t have a choice about groups and being beginners they want<br/>\nothers to help them. Most people, sadly -- and I think school plays a big<br/>\npart -- are used to leaning on others to point them in the right direction.<br/>\nMost people aren&#39;t used to seeing a problem -- lack of support for<br/>\nunschooling -- and creating a solution -- creating their own group.<br/>\n<br/>\nPeople should drop out of groups that don&#39;t suit them. They should start<br/>\ntheir own.<br/>\n<br/>\nBut we can offer at least compassion (and help on starting their own groups)<br/>\nwhen they are burned by something that they didn&#39;t even realize could get<br/>\nhot.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":7090222,"authorName":"spcparents@aol.com","from":"spcparents@...","profile":"spcparents","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"unschooling lifestyle","postDate":"1065072814","msgId":81887,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGEzLjQ5OTg5OTU3LjJjYWQxMmFlQGFvbC5jb20+"},"prevInTopic":81859,"nextInTopic":81901,"prevInTime":81886,"nextInTime":81888,"topicId":81844,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/1/2003 5:19:50 PM Central Standard Time, ... I am not stating that one is bigger than the other, just that both sides are outspoken on","messageBody":"<div id=\"ygrps-yiv-62991433\">In a message dated 10/1/2003 5:19:50 PM Central Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If you think those &quot;sides&quot; are of equal weight, you haven&#39;t looked into <br/>\n&gt; what <br/>\n&gt; we&#39;re writing about.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I am not stating that one is bigger than the other, just that both sides are <br/>\noutspoken on this issue.  Neither are without their wrongdoings.<br/>\n<br/>\n&lt;I <br/>\nI doubt you have the kinds of families we&#39;re talking about.<br/>\n<br/>\nYep, all types.  One day, I would actually like to meet you Sandra.  <br/>\n<br/>\n<br/>\n&lt;I <br/>\nThere are families whose reason for homeschooling is to keep away from people <br/>\n<br/>\nwho aren&#39;t of their religion (their very narrow definition of their religion, <br/>\n<br/>\nwhich is the purpose for the statement of faith HOMESCHOOL groups--you talked <br/>\n<br/>\nabout church statements of faith, which is not the same thing).<br/>\n<br/>\n<br/>\nYep, met these folks too.  They are an interesting bunch to &quot;explore&quot; with, <br/>\nespecially down in the Missouri caves!!<br/>\n<br/>\n&lt;I <br/>\nThe families I&#39;m talking about don&#39;t check out &quot;the awesome world.&quot;  They <br/>\nonly check out the Bible and things written and spoken by people in their <br/>\ngroups.<br/>\n<br/>\nDo you doubt those groups exist?<br/>\nDid you look at any of the links I sent yesterday?<br/>\nDo you not WANT to know?<br/>\n<br/>\nI understand exactly whom you are referring to.  I do not doubt in the <br/>\nslightest about their existence.  I&#39;ve met them.  Again, quite interesting people to <br/>\nmeet.  They liked the visiting the synagogue trip.<br/>\n<br/>\n&lt;I <br/>\nWhat do you think &quot;secular&quot; means?<br/>\nI&#39;m guessing because you wrote this, that your current group is not <br/>\n&quot;secular.&quot;<br/>\n<br/>\nI understand what &quot;secular&quot; means.  That is what was so odd about getting <br/>\nbanned from that group.  When I joined it, I &quot;assumed&quot; unschoolers might be more <br/>\nprevalant (? on spelling) in a &quot;secular&quot; group!!! Surprise, surprise, need I <br/>\nsay more!!!<br/>\n<br/>\nI don&#39;t even refer to &quot;secular&quot; or &quot;christian&quot; in FIELD TRIPS!!!.  We&#39;re <br/>\nsimply home educators and home education families. Just a bunch of Kids (ages <br/>\npreborn-?)<br/>\n<br/>\n&lt;I <br/>\n&lt;&lt;The bottom line is &quot;sin&quot; is a term used in religion.  It is not an <br/>\neducational methodology, such as &quot;unschooling is sin&quot;.&gt;&gt;<br/>\n<br/>\nThe article which was referred to that listed &quot;unschooling as sin&quot;.  I <br/>\ntotally disagreed with that statement.  The author is mixing a religious term with <br/>\nan &quot;educational method&quot;.  There is no way &quot;unschooling&quot; and &quot;sin&quot; can be used <br/>\nin the same phrase!!!<br/>\n<br/>\n&lt;I <br/>\n&lt;I <br/>\nThey&#39;re teaching <br/>\nrevisionist and particularly written-for-Christians history and science.<br/>\n<br/>\nWhat do we, unschoolers, care what anybody chooses for their &quot;teaching <br/>\ntools&quot;?? Let them, isn&#39;t that part of freedom to home education!!!  The issue I <br/>\ndon&#39;t want is when the govt sticks its head in and says &quot;be under a certain <br/>\ncurriculum/umbrella or don&#39;t home educate&quot;.  <br/>\n<br/>\nHSLDA completely agrees that the govt should NOT have any say about what <br/>\ncurriculum is used within home education families.  HSLDA only asks that each <br/>\nfamily have a &quot;plan&quot;.  I personally spoke, in person, with the attorney who <br/>\nrepresents Missouri concerning this &quot;plan&quot;.  The bottom line, if anything happens <br/>\nand we call them for representation, we need to give them whatever we can that <br/>\n&quot;proves&quot; our kid has received their home education.  Its simply giving them <br/>\n&quot;evidence&quot; that they can show a judge, if need be, to BACK off and get out of our <br/>\nHOME EDUCATION.  They know what &quot;unschooling&quot; is.  They also give full credit <br/>\nto Mr. Holt and unschoolers for &quot;spearheading&quot; the home education movement.  <br/>\n<br/>\nPlease do not get on the tangent about the cons of HSLDA.  Believe me, I&#39;ve <br/>\nread many a links, ect.  I remember awhile back, Sandra there was an <br/>\n&quot;unschooling&quot; guide for use if you needed it to show the state as part of recordkeeping. <br/>\n This is what we basically developed and showed HSLDA, and that was fine.  It <br/>\nwas sketchy, but it was an outline of the main goals.  Bottom line, if we <br/>\nneed them to represent them, they want &quot;something&quot; to show that judge.<br/>\n&lt;I <br/>\nThat doesn&#39;t change the fact that lots don&#39;t <br/>\nand don&#39;t WANT to.<br/>\n<br/>\nI understand this fact concerning a portion of the Christian Homeschooling <br/>\nGroup.  They have made this choice.  How in the world does this affect <br/>\nunschoolers?? Unschoolers are brave enough to stand on their own 2 feet and continue <br/>\ntheir journey.  Some unschoolers have chosen they do not want to join groups <br/>\nthat require these statements.  If they wanted to, and they tried, when they knew <br/>\nthey would not be accepted, why join?  Find another group.  What&#39;s the deal?? <br/>\nI&#39;m confused on this one.<br/>\n<br/>\nOk, I know I missed a few in those long posts.  Not intentional.  No, I was <br/>\nnot ignoring you all, I get the digest version.  Just the opposite, I enjoy a <br/>\nhealthy dose of communication.<br/>\n<br/>\nSpc in Mo<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] unschooling lifestyle","postDate":"1065029498","msgId":81859,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMwLjQ3ZDMzMmJkLjJjYWM2OTdhQGFvbC5jb20+"},"prevInTopic":81852,"nextInTopic":81887,"prevInTime":81858,"nextInTime":81860,"topicId":81844,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/30/03 11:03:31 PM, spcparents@aol.com writes: ","messageBody":"<div id=\"ygrps-yiv-193620376\">In a message dated 9/30/03 11:03:31 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:spcparents@...\">spcparents@...</a> writes:<br/>\n<br/>\n&lt;&lt;  Therefore, the &quot;fence&quot; has both sides.  Both <br/>\nsides go overboard on religious and unschooling, to a point. &gt;&gt;<br/>\n<br/>\nIf you think those &quot;sides&quot; are of equal weight, you haven&#39;t looked into what <br/>\nwe&#39;re writing about.<br/>\n<br/>\n&lt;&lt; Yes, we have all types of families who participate. &gt;&gt;<br/>\n<br/>\nI doubt you have the kinds of families we&#39;re talking about.<br/>\nThere are families whose reason for homeschooling is to keep away from people <br/>\nwho aren&#39;t of their religion (their very narrow definition of their religion, <br/>\nwhich is the purpose for the statement of faith HOMESCHOOL groups--you talked <br/>\nabout church statements of faith, which is not the same thing).<br/>\n<br/>\n&lt;&lt;We&#39;re checking out the <br/>\nawesome world and gaining knowledge and using it however we choose within our <br/>\nown families. &gt;&gt;<br/>\n<br/>\nThe families I&#39;m talking about don&#39;t check out &quot;the awesome world.&quot;  They <br/>\nonly check out the Bible and things written and spoken by people in their groups.<br/>\n<br/>\nDo you doubt those groups exist?<br/>\nDid you look at any of the links I sent yesterday?<br/>\nDo you not WANT to know?<br/>\n<br/>\n&lt;&lt;The parents have a deep quest for knowledge and this eager <br/>\nanticipation is from &quot;ideas&quot; from our kids, and we all dig together and glean <br/>\nwhat <br/>\nwe can.&gt;&gt;<br/>\n<br/>\nI could find sites saying kids &quot;ideas&quot; are worthless, only what the parents <br/>\ntell them to think is of value.  Those are the people who are speaking for <br/>\nunschoolers in general, working to change laws and to take over the government.  <br/>\nDo I think they&#39;ll succeed in the latter?   No.  They&#39;ve already succeeded in <br/>\nthe former in some states.  Do I think it&#39;s embarrassing and frustrating that <br/>\nthey&#39;re speaking for all homeschoolers.<br/>\n<br/>\nYes.<br/>\n<br/>\nAlso embarrassed there are people on an unschooling list who COULD be <br/>\nlearning from the world around them who prefer to say LA LA LA LA you can&#39;t make me <br/>\nknow this.  LA LA LA LA I&#39;m not looking at those websites.<br/>\n<br/>\n&lt;&lt;Our kids thirst after deeper learning environments <br/>\nand than they thrive in directions we never thought would&#39;ve ever enter into <br/>\nour minds, as adults :)  We watch them grow and develop into lifelong <br/>\nlearners <br/>\npersuing their goals in life.&gt;&gt;<br/>\n<br/>\nSure lots of homeschoolers do.  That doesn&#39;t change the fact that lots don&#39;t <br/>\nand don&#39;t WANT to.<br/>\n<br/>\n&lt;&lt;I&#39;ve met so many families who share the same educational philosophy--the <br/>\nlifelong learning of unschooling. &gt;&gt;<br/>\n<br/>\nI&#39;ve met unschoolers too.<br/>\n<br/>\nWhat does that have to do with the Christian Homeschooling Movement which <br/>\nremains staunchly critical of unschooling?<br/>\n<br/>\n&lt;&lt;Do I have an educational &quot;plan&quot; for my kids? <br/>\nYep, they are going to be encouraged to pursue their goals, and their <br/>\ncritical <br/>\nthinking minds. &gt;&gt;<br/>\n<br/>\nThen you&#39;re obviously not one of the members of that Christian Homeschooling <br/>\nMovement.<br/>\n<br/>\n&lt;&lt;A statement of faith is a list of doctrine/religious beliefs which a <br/>\nperson chooses to follow or not follow.  Usually this is a document which <br/>\nserves as <br/>\na basis or the basis for a house of worship.  There IS freedom of religion <br/>\nand if a person chooses to do this, FINE!!! &gt;&gt;<br/>\n<br/>\nThis statement entirely misses the point of the discussion.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":150527288,"authorName":"Ren","from":"Ren &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"unschooling lifestyle","postDate":"1065021321","msgId":81852,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMxMDAxLjExMTU1MC4yMjA2Ny4yMzE4OUB3ZWJtYWlsMDQubnljLnVudGQuY29tPg=="},"prevInTopic":81846,"nextInTopic":81859,"prevInTime":81851,"nextInTime":81853,"topicId":81844,"numMessagesInTopic":0,"msgSnippet":"4) I believe strongly that home education families CAN bind together, unite and do stuff together.  I ve personally have seen this happen here in Missouri ","messageBody":"<div id=\"ygrps-yiv-1556684436\">&quot;4) I believe strongly that home education families CAN bind together, unite <br/>\nand do stuff together.  I&#39;ve personally have seen this happen here in Missouri&quot;<br/>\n<br/>\nNobody is saying they can&#39;t! We&#39;re saying that the type of Christians WE are talking about wouldn&#39;t DARE hang out with the likes of a Pagan or a Buddhist or an atheist or.....<br/>\nI run an inclusive group. I know exactly how home/unschoolers of all faiths and backgrounds can come together for mutual support. But the Christians in our group are not the type of Christians we&#39;re talking about here. Those folks have shown up occasionally and never, ever come back after they see our kids playing Yu-gi-oh, talking about certain movies and figure out that we have atheist and Pagan members.<br/>\n<br/>\nYou&#39;re preaching to the choir. We KNOW that homeschoolers can come together, we also know that there is a brand of homeschooler called &quot;Christian homeschoolers&quot; that want nothing to do with a truly inclusive group.<br/>\nThe local very organized, very powerful homeschooling support group is Christian based. Their statement of faith weeds out even semi-liberal Christians with the very first item...&quot;I believe that the Bible is the INFALLIBLE word of God, blah, blah, blah&quot;<br/>\nNot exactly inclusive.<br/>\nIt IS intolerant.<br/>\n<br/>\nI go as far as to say you can&#39;t truly unschool if you&#39;re children aren&#39;t allowed to form their own beliefs. But that&#39;s me.<br/>\n<br/>\nRen</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] unschooling lifestyle","postDate":"1065008447","msgId":81846,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJCQTAzNTdFLjFGMUJCJWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDEzMi4yNTNiNjMzNi4yY2FiYjk5NkBhb2wuY29tPg=="},"prevInTopic":81844,"nextInTopic":81852,"prevInTime":81845,"nextInTime":81847,"topicId":81844,"numMessagesInTopic":0,"msgSnippet":"... In fundamentalist Christian homeschooling groups statements of faith are used to clearly lay out what beliefs the members of the group hold. They are also","messageBody":"<div id=\"ygrps-yiv-662063187\">on 10/1/03 1:01 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:spcparents@...\">spcparents@...</a> at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:spcparents@...\">spcparents@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; 1) A statement of faith is a list of doctrine/religious beliefs which a<br/>\n&gt; person chooses to follow or not follow.&gt; There IS freedom of religion<br/>\n<br/>\n </span></blockquote>In fundamentalist Christian homeschooling groups statements of faith are<br/>\nused to clearly lay out what beliefs the members of the group hold. They are<br/>\nalso a message to those who don&#39;t hold those beliefs that their acceptance<br/>\ninto the group very probably won&#39;t be as all encompassing as those who do<br/>\nhold the beliefs.<br/>\n<br/>\nThat practice is something people should be aware of. People should also be<br/>\naware of *why* the groups choose to set themselves up that way. And it&#39;s not<br/>\nbecause they want everyone who homeschools to be all one big happy family.<br/>\n<br/>\nWould you feel comfortable signing a statement of faith that said you<br/>\nbelieved we are all reincarnated until we reach Enlightenment and are<br/>\nwelcomed into the heavens with Buddha?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; and if a person chooses to do this, FINE!!! That&#39;s their American God-given<br/>\n&gt; right.  This is not being &quot;intolerant&quot;.  This is a choice.<br/>\n<br/>\n </span></blockquote>I think you&#39;re reading more into what&#39;s being discussed. The discussion<br/>\nisn&#39;t aimed at convincing anyone that fundmenatlist Christians don&#39;t have a<br/>\nright separate from the rest of us, or run exclusive groups, or believe in<br/>\nthings that many people disagree with. They do have the right.<br/>\n<br/>\nWhat&#39;s being discussed is the extent and existence of this very large group<br/>\nof homeschoolers that is practically invisible to many homeschoolers,<br/>\nespecially unschoolers.<br/>\n<br/>\nThe negative experiences with the Christian support groups that people are<br/>\nexpressing are, I believe, in response to the idea that the label is<br/>\ncreating a division between secular homeschoolers and Christian<br/>\nhomeschoolers. But in fact it&#39;s the Christian Homeschoolers themselves who<br/>\n*want* the division. The experiences, I believe, were meant to illustrate<br/>\nthat Christian Homeschoolers want to be separate from the rest of us, not in<br/>\nhow wrong and hurtful the groups are for existing or that they should not be<br/>\nallowed to exist.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; 2) &quot;Christian&quot; is a term or label for one who follows the person and<br/>\n&gt; teachings of Jesus Christ.  This is a religious choice.  Remember, freedom of<br/>\n&gt; religion.<br/>\n<br/>\n </span></blockquote>Depends who is defining Christianity. Yours is a very inclusive definition.<br/>\nMany Christians define Christianity more narrowly. It&#39;s their right to do<br/>\nso. But in terms of being able to express informed opinions about<br/>\nhomeschoolers as a group, it&#39;s useful to be aware that there is a large<br/>\nchunk of Christians who are homeschooling who don&#39;t agree with your<br/>\ndefinition. Their definition excludes a goodly chunk of people who consider<br/>\nthemselves Christian.<br/>\n<br/>\nThat is both reality and their right to do so. And people should be aware of<br/>\nthat reality or the opinions they express about homeschooling in general --<br/>\noften from an unschooling point of view -- can be very very wrong.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; 4) Why don&#39;t we all just settle and worship &quot;God?&quot; Because the 1 and only 1<br/>\n&gt; major factor is different--the belief in the individual religions concerning<br/>\n&gt; the personhood, humanity, and authenticity of Jesus Christ.<br/>\n<br/>\n </span></blockquote>No, that&#39;s very very wrong. There are few mainstream Christian faiths that<br/>\nquestion whether Jesus was son of God or that he existed. Some admit that we<br/>\ncan&#39;t know about the son of God aspect and allow individuals to doubt.<br/>\n(United Church of Christ comes to mind, but even within the UCC individual<br/>\nchurches can be very different in their doctrine.)<br/>\n<br/>\nIf you&#39;re talking about something else, I&#39;m totally missing the point. But<br/>\nif I&#39;ve understood, your information about the doctrine of Christianity<br/>\nbeyond your own set of beliefs is way off.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; 4) I believe strongly that home education families CAN bind together, unite<br/>\n&gt; and do stuff together.  I&#39;ve personally have seen this happen here in<br/>\n&gt; Missouri. <br/>\n&gt; The religious basis is NOT used as the basis for the organization structure.<br/>\n<br/>\n </span></blockquote>It seems you&#39;re saying that those of us who aren&#39;t fundamentalist Christians<br/>\nare the ones who are desiring the separation from the Christian groups and<br/>\nwe&#39;re causing the rifts.<br/>\n<br/>\nPerhaps it&#39;s different in your little pocket of Missouri. But you also say<br/>\nyou&#39;re a Christian which is perhaps like a white person commenting on the<br/>\nstate of race relations. Does your group have Pagans and Buddhists and<br/>\nfamilies with same sex partners and Asians and Hispanics and African<br/>\nAmericans? And what do they honestly say about how included they feel?<br/>\n<br/>\nThere are many areas of the country where very specific Christian beliefs<br/>\nare used as a determining factor on who the families in the group should<br/>\nallow into the group. They *choose* to do this because they *don&#39;t* want to<br/>\n&quot;bind together, unite and do stuff together.&quot; They want to make sure they<br/>\nare only uniting with those whose beliefs match theirs.<br/>\n<br/>\nIt&#39;s their right to do so and I understand why they want it that way. Heck,<br/>\nI wouldn&#39;t want to mix with a group of White Separatist Movement<br/>\nhomeschoolers (should such a group exist).<br/>\n<br/>\nPeople should be aware that fundamentalist Christians who don&#39;t want to mix<br/>\nwith unschoolers and people who aren&#39;t their brand of Christianity. People<br/>\nshould also be aware of *why* they want to limit who their children are<br/>\nexposed to.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I won&#39;t apologize if my lifestyle is different.<br/>\n<br/>\n </span></blockquote>No one&#39;s asking anyone to apologize for their beliefs. We&#39;re presenting<br/>\ninformation about the homeschooling movement that many people, including<br/>\nyou, don&#39;t seem to be aware of.<br/>\n<br/>\nNo one&#39;s asking the fundamentlists to stop doing what they&#39;re doing. But<br/>\npeople should be aware that fundamentalist Christian Homeschoolers exist and<br/>\nwhat their beliefs are and what their goals for homeschooling are because<br/>\nthey are a large politically active group. The legislation they may push for<br/>\n-- that may on the surface seem to be good -- could hamper how we as<br/>\nunschoolers can homeschool.<br/>\n<br/>\nThey don&#39;t care about the unschoolers&#39; need to have freedom to help their<br/>\nchildren learn in anyway that&#39;s best for them. Their goal is to have as<br/>\nlittle government interference as possible. Which sounds good! But they --<br/>\nsince the core who are pushing their political agenda -- are school at<br/>\nhomers. And they are willing to allow legislation -- even encourage<br/>\nlegislation -- that requires some formal assessment. They recognize that<br/>\ntests or the like -- since they know they can get their kids to do well on<br/>\ntests -- will keep the government from looking into what they&#39;re doing.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":7090222,"authorName":"spcparents@aol.com","from":"spcparents@...","profile":"spcparents","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"unschooling lifestyle","postDate":"1064984470","msgId":81844,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMi4yNTNiNjMzNi4yY2FiYjk5NkBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":81846,"prevInTime":81843,"nextInTime":81845,"topicId":81844,"numMessagesInTopic":0,"msgSnippet":"Ok, I ve waded through a bunch of digest versions of this egroup, and now I m jumpin in on this Christian unschooling Bob Jones discussion. 1) A statement","messageBody":"<div id=\"ygrps-yiv-1041253357\">Ok, I&#39;ve waded through a bunch of digest versions of this egroup, and now I&#39;m <br/>\njumpin&#39; in on this &quot;Christian unschooling&quot; &quot;Bob Jones&quot; discussion.<br/>\n<br/>\n1) A statement of faith is a list of doctrine/religious beliefs which a <br/>\nperson chooses to follow or not follow.  Usually this is a document which serves as <br/>\na basis or the basis for a house of worship.  There IS freedom of religion <br/>\nand if a person chooses to do this, FINE!!! That&#39;s their American God-given <br/>\nright.  This is not being &quot;intolerant&quot;.  This is a choice.  What a person does <br/>\nwith that choice IS another issue in itself.  Some religions are extremely <br/>\nlegalistic, others are extremely liberal.<br/>\n<br/>\n2) &quot;Christian&quot; is a term or label for one who follows the person and <br/>\nteachings of Jesus Christ.  This is a religious choice.  Remember, freedom of <br/>\nreligion.<br/>\n<br/>\n3) A person has the choice of how to conduct one&#39;s attitudes, personality, <br/>\nlifestyle.  A person also has the choice of how to react to different attitudes, <br/>\npersonality, and lifestyles.  Therefore, the &quot;fence&quot; has both sides.  Both <br/>\nsides go overboard on religious and unschooling, to a point.<br/>\n<br/>\n4) Why don&#39;t we all just settle and worship &quot;God?&quot; Because the 1 and only 1 <br/>\nmajor factor is different--the belief in the individual religions concerning <br/>\nthe personhood, humanity, and authenticity of Jesus Christ.  This belief <br/>\nliterally spans the spectrum of total belief in who He said He was, and those who do <br/>\nnot believe He was who He professed to be, and all those in between.  The 2 <br/>\nends of the spectrum cannot mix--belief wise, the definition of &quot;God&quot; is exactly <br/>\nthe opposite from each other.  Whew, glad to get that typed out.<br/>\n<br/>\n4) I believe strongly that home education families CAN bind together, unite <br/>\nand do stuff together.  I&#39;ve personally have seen this happen here in Missouri. <br/>\n The religious basis is NOT used as the basis for the organization structure. <br/>\n Yes, we have all types of families who participate. Yes, the families talk <br/>\nto each other on all topics.  What keeps us together??  We&#39;re checking out the <br/>\nawesome world and gaining knowledge and using it however we choose within our <br/>\nown families.  The parents have a deep quest for knowledge and this eager <br/>\nanticipation is from &quot;ideas&quot; from our kids, and we all dig together and glean what <br/>\nwe can.  We facilitate and model &quot;learning&quot; on the topics/issues, whatever <br/>\nour kids want to dig into!!! Our kids thirst after deeper learning environments <br/>\nand than they thrive in directions we never thought would&#39;ve ever enter into <br/>\nour minds, as adults :)  We watch them grow and develop into lifelong learners <br/>\npersuing their goals in life.<br/>\n<br/>\n5) Yes, I hold strong religious, &quot;Christian&quot; personal beliefs.  Yes, if <br/>\nasked, I&#39;ll share.  I&#39;ll also shut up.  I won&#39;t apologize if my lifestyle is <br/>\ndifferent.  One thing for sure, I am having the time of my life as a home educator.  <br/>\nI&#39;ve met so many families who share the same educational philosophy--the <br/>\nlifelong learning of unschooling.  Do I have an educational &quot;plan&quot; for my kids? <br/>\nYep, they are going to be encouraged to pursue their goals, and their critical <br/>\nthinking minds.  I am looked upon as either totally &quot;right on&quot; or &quot;nuts&quot; by my <br/>\npeers.  I don&#39;t care.  I&#39;m not hurting anyone, that&#39;s their problem.  I&#39;m not <br/>\ngoing to be bothered by such childish tactics.  <br/>\n<br/>\nHowever, I&#39;ve made personal religious choices, and I&#39;ll live by my <br/>\nconvictions.  <br/>\n<br/>\nIn some beliefs this involves dress, schooling type, and curriculum choices. <br/>\nIf you want to make a religious choice, that&#39;s your choice!  Unschooling is a <br/>\nlifestyle, not a religious belief.<br/>\n<br/>\nThanks for listening.<br/>\n<br/>\nSpc in Mo<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":81899,"nextTopicId":5185}}