{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":14,"messages":[{"userId":0,"authorName":"Tracy Oldfield","from":"&quot;Tracy Oldfield&quot; &lt;tracy.oldfield@...&gt;","replyTo":"LIST","senderId":"hoSNIpORNJcKIT0pDMS9KhivlJ0ov3BcOF8LHY6hpQ9llG-UyPJhUul-mVwYwjLsBb3hdwCD8KFJsvebJc1My5pJQ51SufQorBFtSovTpUAqvgBB4Q","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: Homeschool or not homeschool","postDate":"991242975","msgId":22242,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNCMTUzOEVGLjUyOTguMTU2OEM1NUBsb2NhbGhvc3Q+","inReplyToHeader":"PDhjLjc1Y2Y2NTAuMjg0NjY5NDlAYW9sLmNvbT4="},"prevInTopic":22235,"nextInTopic":0,"prevInTime":22241,"nextInTime":22243,"topicId":22193,"numMessagesInTopic":0,"msgSnippet":"\u000f I totally agree with your entire post. We did the same thing when our oldest \u000f was younger. (She is 17 now) We did not give her the option when she turned 5","messageBody":"<div id=\"ygrps-yiv-1368558235\">I totally agree with your entire post. We did the same <br/>\nthing when our oldest \u000f<br/>\nwas younger. (She is 17 now) We did not give her the <br/>\noption when she turned 5 \u000f<br/>\nto go to school. Your posts reflect the way I felt at <br/>\nthe time perfectly. \u000f<br/>\nWhen my oldest turned 8 she said she wanted to go to <br/>\nschool. She was \u000f<br/>\ndetermined. Later she told me that her Aunt, who was in <br/>\nhigh school at the \u000f<br/>\ntime, told her she was missing tons of fun and of <br/>\ncourse all her friends were \u000f<br/>\nthere. We still did not let her go. Instead we let her <br/>\njoin a karate club, \u000f<br/>\nand she was also in dance and gymnastics. We pointed <br/>\nout to her that she \u000f<br/>\nwould not be able to do those extra activities if she <br/>\nwas in school because \u000f<br/>\nthere would not be enough time. ( this was true as all <br/>\nactivities were out of \u000f<br/>\ntown) She decided the activities were worth missing <br/>\nschool for. Now that she \u000f<br/>\nis 17 she says that she is glad that we never sent her <br/>\nto school and she can \u000f<br/>\ntalk to her friends and see how much they dislike it. <br/>\nShe is glad that we did \u000f<br/>\nnot give in to her request but stood by our beliefs <br/>\nthat public school is not \u000f<br/>\nan option for us. \u000f<br/>\nOur other three children never wanted to go to school. \u000f<br/>\n\u000f<br/>\nCandy\u000f<br/>\n\u000f<br/>\nWell, maybe I didn&#39;t clarify myself in my post.  I think that if a <br/>\nchild says he wants to go to school, he shouldn&#39;t &#39;just go&#39; without a <br/>\nlot of discussion, about what school is and does and what people <br/>\ndo there, and why they want to go and what they think they&#39;ll get <br/>\nout of it.  If it&#39;s possible to find a compromise between what the <br/>\nchild wants (the activities or time with other children, or the ride <br/>\non the bus...) and what the parent wants, ie the freedom as a <br/>\nfamily to come and go and do stuff together, then fair enough, if <br/>\nthe child, once all the pros and cons have been thoroughly (and for <br/>\nsomething like this, I mean thoroughly) explored still wants to <br/>\nexperience school, then there could be ways (like flexi-schooling, <br/>\nfor one) to facilitate this without impingeing too much on the rest <br/>\nof the family&#39;s freedom.  Organising ways for the child (depending <br/>\non age) to get himself up (pre-made breakfast? alarm-clock? <br/>\nclothes sorted in advance?) without disturbing one or all family <br/>\nmembers isn&#39;t impossible, and transportation to and from school <br/>\nmay not be difficult to sort out in a similar fashion.  The idea that <br/>\nonce a child&#39;s enrolled in a school they can&#39;t decide when they do <br/>\nand don&#39;t go has already been disproved by Nicki&#39;s son, &#39;being ill&#39; <br/>\nwhen he just doesn&#39;t want to go, though honestly saying &#39;I don&#39;t <br/>\nwant to go today&#39; would be preferable to me!  I understand that <br/>\nthe school board might not like it much, but they might be <br/>\namenable to a fixed-day part-time arrangement...<br/>\n<br/>\nI&#39;m not actually arguing for school, btw, just that the child can <br/>\nexperience it without placing as much restriction on family-life as <br/>\nmost folk assume.  And that the child can make such a decision, <br/>\ngiven all the info that the parents can offer and anyone else he <br/>\nmight ask.<br/>\n<br/>\nAs a counterpoint, how many people take their children to <br/>\nactivities which are run in ways they (the parents) disagree with?  <br/>\nWould they stop the child from going?  I have permission to <br/>\nforward this from the author, she sent it to a UK home-ed list <br/>\ntoday:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;X adores swimming club, it&#39;s definitely the thing he looks forward <br/>\n </span></blockquote>to most. At his stage, he trains with the club 3.25 hours per week. <br/>\nThe swimming when it hurts bit doesn&#39;t happen often, to be fair, <br/>\nonly during races or in T10&#39;s (an assessment where they are <br/>\nrecorded on how far they can swim in a continous 10 minute swim, <br/>\nand there&#39;s a coach at each end nagging them if they&#39;re too tired to <br/>\ntumble-turn at the ends!). I think if you&#39;re a certain sort of person, <br/>\nthere&#39;s a great satisfaction in pushing yourself to do well in spite of <br/>\ndiscomfort, as well as the feel-good factor of endorphins!<br/>\n<br/>\nOf course, you meet a fair proportion of pushy parents at a <br/>\ncompetetive swimming club :0( - mostly of slightly older children <br/>\nwho are already swimming in national or regional races. People <br/>\nwho say that sometimes their child doesn&#39;t want to come, is too <br/>\ntired to train, but mum/dad insist that it has to be done. Other <br/>\nparents who are angry if their child does poorly in a race and <br/>\ninsists on talking them through it stroke by stroke telling them <br/>\nwhere they went wrong. Parents living out their own thwarted <br/>\nambitions through their children.<br/>\n<br/>\nIMO, the emphasis is too much on speed and competition even in <br/>\nthe D (development) squads that C is in. They get timed at each <br/>\ntraining session on one stoke at one distance, and this all gets <br/>\nrecorded and a graph printed monthly showing how each child&#39;s <br/>\ntimes are coming down.  Unfortunately, at this stage this does very <br/>\nlittle for good stroke development, and you see children sacrificing <br/>\neverything they have been taught about good strokework in their <br/>\nquest to beat the child in the next lane. Also, the slower children <br/>\nare not popular amongst the squad members, generally.&lt;&lt;<br/>\n<br/>\nThis mother goes on to say that while he&#39;s interested and enjoying <br/>\nit, she&#39;ll be taking him.  I feel similarly about a class my children go <br/>\nto, there are aspects I don&#39;t like but they enjoy it and so they go.<br/>\n<br/>\nSo what&#39;s the difference between this and school, apart from the <br/>\namount of time involved??  <br/>\n<br/>\nTracy</div>","specialLinks":[]},{"userId":0,"authorName":"Tracy Oldfield","from":"&quot;Tracy Oldfield&quot; &lt;tracy.oldfield@...&gt;","replyTo":"LIST","senderId":"AU1PLd6qKJwmybUw9Og2qoFdTgJk03G5azD_KLQpSBmi5jlLQFMiiKemPwjjftmvS1hEzVO_RXsNu13JUPlpTONDoRCz1MhC9EgoDYJM41Y4lodThg","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [Unschooling-dotcom] Homeschool or not homeschool","postDate":"991238575","msgId":22235,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNCMTUyN0JGLjIzOTg2LjExMzY4RDBAbG9jYWxob3N0Pg==","inReplyToHeader":"PEFFRU1JTUFDSUxPTUlMTERHTklORUVKTUNQQUEubmlja2lAZGV0cm9pdG1hbWEuY29tPg==","referencesHeader":"PDNCMTQ0REJELjE5MzAxLjI2QzkwQTFAbG9jYWxob3N0Pg=="},"prevInTopic":22231,"nextInTopic":22242,"prevInTime":22234,"nextInTime":22236,"topicId":22193,"numMessagesInTopic":0,"msgSnippet":"I always left more\u000f angry than I did when I came in. I can relate to this, I go through phases of feeling this way with my mum sometimes!  You have tried, ","messageBody":"<div id=\"ygrps-yiv-837194072\">I always left more\u000f<br/>\nangry than I did when I came in.<br/>\n<br/>\nI can relate to this, I go through phases of feeling <br/>\nthis way with my mum sometimes!  You have tried, <br/>\nobviously, and reached the limit of your resources with <br/>\nthis woman.  I guess I&#39;d be saying to my son (on a good <br/>\nday, this is!!  *grin*) &#39;I don&#39;t like it, I don&#39;t like <br/>\nthe way this teacher behaves, but I&#39;m too tired of <br/>\nfighting her attitudes to go any further with this.  If <br/>\nyou want to do &#39;x&#39; at home, that&#39;s fine by me, and what <br/>\nyou want is much more important to me than anything <br/>\nthis teacher wants.&#39;  But that would be on a good day...<br/>\n<br/>\nI think you&#39;re doing the best you can, and that&#39;s all <br/>\nany of us can do.  I&#39;m sorry if this thread has brought <br/>\nup painful memories for you, though sometimes they can <br/>\nhelp in clarifying why we behave the way we do now, as <br/>\nyou say.  You&#39;re certainly not a failure!<br/>\n<br/>\nDid you mention that she won&#39;t be teaching your son <br/>\nnext year?  Take the summer off, then if your son still <br/>\nwants to be in school, see what the new teacher&#39;s like, <br/>\nand use all those skills you have in store &#39;from <br/>\nscratch.&#39;  I agree with Sandra that it&#39;s not likely to <br/>\nbe beneficial if you&#39;re fighting about home-ed to start <br/>\nwith...<br/>\n<br/>\nHow much longer do you have to put up with this woman?<br/>\n<br/>\nTracy</div>","specialLinks":[]},{"userId":0,"authorName":"discovery6@aol.com","from":"discovery6@...","replyTo":"LIST","senderId":"rLhX47ZFUtpl2_H4--qGrSpeYdEytvsK_Cuh4C8mw-n1NFMVjIuJwRpZrK_oACPVksPA-nzwVuQl","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: Homeschool or not homeschool","postDate":"991235913","msgId":22231,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhjLjc1Y2Y2NTAuMjg0NjY5NDlAYW9sLmNvbT4="},"prevInTopic":22228,"nextInTopic":22235,"prevInTime":22230,"nextInTime":22232,"topicId":22193,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/30/2001 10:02:21 AM Central Daylight Time, diamondair@email.msn.com writes: ","messageBody":"<div id=\"ygrps-yiv-1488194231\">In a message dated 5/30/2001 10:02:21 AM Central Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:diamondair@...\">diamondair@...</a> writes:<br/>\n<br/>\n&lt;&lt;  I&#39;ve been thinking on this one and I have to say for me and my <br/>\n family I disagree with this. Unschooling is a life choice that my DH <br/>\n and I have made for our family. Right now, at the ripe old age of <br/>\n almost 5, my son doesn&#39;t have the decision to go to school placed in <br/>\n his hands. &gt;&gt;<br/>\n<br/>\nI totally agree with your entire post. We did the same thing when our oldest <br/>\nwas younger. (She is 17 now) We did not give her the option when she turned 5 <br/>\nto go to school. Your posts reflect the way I felt at the time perfectly. <br/>\nWhen my oldest turned 8 she said she wanted to go to school. She was <br/>\ndetermined. Later she told me that her Aunt, who was in high school at the <br/>\ntime, told her she was missing tons of fun and of course all her friends were <br/>\nthere. We still did not let her go. Instead we let her join a karate club, <br/>\nand she was also in dance and gymnastics. We pointed out to her that she <br/>\nwould not be able to do those extra activities if she was in school because <br/>\nthere would not be enough time. ( this was true as all activities were out of <br/>\ntown) She decided the activities were worth missing school for. Now that she <br/>\nis 17 she says that she is glad that we never sent her to school and she can <br/>\ntalk to her friends and see how much they dislike it. She is glad that we did <br/>\nnot give in to her request but stood by our beliefs that public school is not <br/>\nan option for us. <br/>\nOur other three children never wanted to go to school. <br/>\n<br/>\nCandy</div>","specialLinks":[]},{"userId":0,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","replyTo":"LIST","senderId":"Jo0f1Filk4N75a0wy8iRSu3kICjJqu03aFcldUkDuz24dte8dbnAHoHL7v8B1YDQ3PCUmNnmqIrV","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Homeschool or not homeschool","postDate":"991235113","msgId":22228,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdjLjE2OGY5Zjg4LjI4NDY2NjI5QGFvbC5jb20+"},"prevInTopic":22226,"nextInTopic":22231,"prevInTime":22227,"nextInTime":22229,"topicId":22193,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/30/01 6:56:15 AM, nicki@detroitmama.com writes: ","messageBody":"<div id=\"ygrps-yiv-2112542793\">In a message dated 5/30/01 6:56:15 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:nicki@...\">nicki@...</a> writes:<br/>\n<br/>\n&lt;&lt; I wonder what the legal disadvantages are with putting in writing that I<br/>\nplan to homeschool. I chose not to send back my &quot;letter of intent&quot; last<br/>\nmonth that was sent out to all parents. &gt;&gt;<br/>\n<br/>\nYou could just say &quot;My child will not be returning to your school.&quot;<br/>\n<br/>\n&lt;&lt;So my only reservation about<br/>\nsending a letter is that it would be forwarded to the school board as legal<br/>\nproof of my intent.&gt;&gt;<br/>\n<br/>\nOH no it wouldn&#39;t.  It would be put in a filing cabinet and hidden because <br/>\nboth the teacher and principal could be in trouble if the school board <br/>\nthought they were wrong.  School boards are the boss.<br/>\n<br/>\nBut if the principal had other complaints on that teacher and he/she chose to <br/>\nsend the letter on with a complaint, the board wouldn&#39;t see it as a letter of <br/>\nintent or a letter about you or your child, but as a letter of complaint <br/>\nagainst someone they hired and were paying.<br/>\n<br/>\n&lt;&lt;This teacher has just accepted another teaching position within the district<br/>\nat another Elem. school so I&#39;m not sure my copying others of importance<br/>\nwould have any bearing.&gt;&gt;<br/>\n<br/>\nWHY is she leaving?  Were they unhappy with her?  Or is it just closer to her <br/>\nhouse, or she wasn&#39;t getting along with co-workers or what?  (Just curious, <br/>\nor wanting you to consider...<br/>\n<br/>\nIf it&#39;s the same district, it&#39;s the same school board.  Send a copy to the <br/>\nnew school&#39;s principal too, if you want want!  GO for it.  You should get <br/>\nsome satisfaction out of the deal.<br/>\n<br/>\n-=-Ultimately, though, none of this is my true reason for homeschooling. I&#39;m<br/>\nhomeschooling because I CAN. These things just further my resolution that it<br/>\nis in my child&#39;s best interest.-=-<br/>\n<br/>\nEven if it just caused you to take your child to another school or private <br/>\nschool, they still need to know you were dissatisfied.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":0,"authorName":"diamondair@email.msn.com","from":"diamondair@...","replyTo":"LIST","senderId":"tI4wviiI8s-QdYG2-niA6d-_hMfq_Zdct-q5hOyupzTNz8BsdERA6K1dTRW1jjaEnBZWO1I63XDJLryAvsDL","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Homeschool or not homeschool","postDate":"991234778","msgId":22226,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlmMzFzcSsxMDJnN0BlR3JvdXBzLmNvbT4=","inReplyToHeader":"PDNCMTQ0NDcyLjkwNTIuMjQ4NDEzOUBsb2NhbGhvc3Q+"},"prevInTopic":22219,"nextInTopic":22228,"prevInTime":22225,"nextInTime":22227,"topicId":22193,"numMessagesInTopic":0,"msgSnippet":"... Hmmmm, I ve been thinking on this one and I have to say for me and my family I disagree with this. Unschooling is a life choice that my DH and I have made","messageBody":"<div id=\"ygrps-yiv-2119356887\">--- In Unschooling-dotcom@y..., &quot;Tracy Oldfield&quot; <br/>\n&lt;tracy.oldfield@n...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I disagree (but my toes are fine, thanks!  LOL)  <br/>\n&gt; Unschooling is about children taking their own <br/>\n&gt; decisions, and being supported by their parents.  We <br/>\n&gt; make the decision to support this, but that&#39;s as far as <br/>\n&gt; it goes.  YMobviouslyV!!  If he wants to go to school, <br/>\n&gt; that&#39;s up to him.  <br/>\n<br/>\n<br/>\n </span></blockquote>Hmmmm, I&#39;ve been thinking on this one and I have to say for me and my <br/>\nfamily I disagree with this. Unschooling is a life choice that my DH <br/>\nand I have made for our family. Right now, at the ripe old age of <br/>\nalmost 5, my son doesn&#39;t have the decision to go to school placed in <br/>\nhis hands. If he did, it&#39;s possible that he might want to do it. Half <br/>\nof his friends are going to go to kindergarten next year, the whole <br/>\nculture supports, promotes, and expects it, it seems thrilling and <br/>\nexciting to ride a big yellow bus and go sit with his friends. <br/>\nUnfortunately, I think it would also be emotionally and mentally <br/>\ndamaging and so it&#39;s not an option we&#39;re giving him. I also wouldn&#39;t <br/>\nlet him walk into the middle of a busy highway to retrieve a quarter. <br/>\nHonestly, that&#39;s sort of what it feels like to me - he&#39;d be reaching <br/>\nfor something small and shiny (the &quot;good&quot; experiences of school), and <br/>\nget hit by a bus (the rest of the crap that comes with it). <br/>\nAdditionally, we&#39;d have to go through registering him with the system <br/>\n(bleh), doing the whole immunization crap (double bleh) or filing a <br/>\nreligious exemption, exposing our whole family to the system. That&#39;s <br/>\nnot something we&#39;re going to be doing.<br/>\n<br/>\nOthers may disagree, but I see Unschooling as a family decision and <br/>\none that (right now) my husband and I are making. As the kids get <br/>\nolder and have a bit more life experience and resilience to what <br/>\nothers have to say, they&#39;ll have the option to go to school. But at <br/>\nthis magical age of taking in the world, they don&#39;t. I also don&#39;t put <br/>\nmy son in daycare just because when we drive by a daycare center with <br/>\na pretty play structure he asks to go, FWIW.<br/>\n<br/>\n<br/>\nBlue Skies!<br/>\n   -Robin-<br/>\nMom to Mackenzie (8/28/96) &quot;A bee is pollinating my eye&quot;<br/>\nand Asa (10/5/99) &quot;Asa eat buggy&quot;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.geocities.com/the_clevengers\">http://www.geocities.com/the_clevengers</a>   Flying Clevenger Family</div>","specialLinks":[]},{"userId":0,"authorName":"Nicki Clark","from":"&quot;Nicki Clark&quot; &lt;nicki@...&gt;","replyTo":"LIST","senderId":"33lMV2oIen4Qm6FXd5bgI05PO4F7uAJJbYNLlyNZ2rFglKdoJ_dH0JRpCbiBI_BN76Y8DONYTAwIfbN4gYAqX_r5ZUKrHd4HKw6Naw","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [Unschooling-dotcom] Homeschool or not homeschool","postDate":"991226996","msgId":22219,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFFRU1JTUFDSUxPTUlMTERHTklORUVLTkNQQUEubmlja2lAZGV0cm9pdG1hbWEuY29tPg==","inReplyToHeader":"PGUzLjE1NmZkZDg0LjI4NDY0MmQxQGFvbC5jb20+"},"prevInTopic":22217,"nextInTopic":22226,"prevInTime":22218,"nextInTime":22220,"topicId":22193,"numMessagesInTopic":0,"msgSnippet":" This is a GREAT idea! I think I will do it - even if I don t","messageBody":"<div id=\"ygrps-yiv-542160918\">&lt;&lt;It might make you feel better to write a letter to that teacher with a<br/>\ncopy<br/>\nto the principal. &gt;&gt;<br/>\n<br/>\nThis is a GREAT idea! I think I will do it - even if I don&#39;t end up sending<br/>\nit.<br/>\n<br/>\nI wonder what the legal disadvantages are with putting in writing that I<br/>\nplan to homeschool. I chose not to send back my &quot;letter of intent&quot; last<br/>\nmonth that was sent out to all parents. I just really do not want to be<br/>\n&quot;listed&quot; unless/until I absolutely have to. So my only reservation about<br/>\nsending a letter is that it would be forwarded to the school board as legal<br/>\nproof of my intent. Maybe it&#39;s worth it and my fears are unjustified? I<br/>\ndon&#39;t know, it makes me a little nervous.<br/>\n<br/>\nThis teacher has just accepted another teaching position within the district<br/>\nat another Elem. school so I&#39;m not sure my copying others of importance<br/>\nwould have any bearing. My reason for including others would mostly be to<br/>\nexplain my choices and the effect of this behavior on some parents.<br/>\nUltimately, though, none of this is my true reason for homeschooling. I&#39;m<br/>\nhomeschooling because I CAN. These things just further my resolution that it<br/>\nis in my child&#39;s best interest.<br/>\n<br/>\nNicki</div>","specialLinks":[]},{"userId":0,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","replyTo":"LIST","senderId":"4nJQZd-7SYfFY7wBFkd_WLfht4iRvhr07MCfHPDr5ui6dxX1P3hAixi4JCHVJBfUe7YELH6NhqZE","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Homeschool or not homeschool","postDate":"991226065","msgId":22217,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGUzLjE1NmZkZDg0LjI4NDY0MmQxQGFvbC5jb20+"},"prevInTopic":22216,"nextInTopic":22219,"prevInTime":22216,"nextInTime":22218,"topicId":22193,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/29/01 7:00:27 PM, nicki@detroitmama.com writes: ","messageBody":"<div id=\"ygrps-yiv-234534278\">In a message dated 5/29/01 7:00:27 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:nicki@...\">nicki@...</a> writes:<br/>\n<br/>\n&lt;&lt; She simply does not want to hear what I have to say.<br/>\nMANY times my son has been present during these conversations and I have<br/>\nalways tried to leave before it is too obvious that this woman cares nothing<br/>\nfor what I have to say. Finally I&#39;ve given up. Maybe that makes me a weak<br/>\nmother or just plain a failure. &gt;&gt;<br/>\n<br/>\nIt might make you feel better to write a letter to that teacher with a copy <br/>\nto the principal.  Summarize, starting with that first incident.  Tell how it <br/>\nmade you feel to be dismissed.  Try to keep the whole thing to one page.  We <br/>\ncould help you edit it.<br/>\n<br/>\nIt will make a difference in her treatment of others in the future.  And it <br/>\nwill be an official &quot;mark&quot; on her at the school that you cared enough to <br/>\ndocument your unhappiness, and that you took your child out.<br/>\n<br/>\nThe teacher probably wouldn&#39;t respond, for legal reasons if nothing else.  <br/>\nMaybe the principal would write a soothing something.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":0,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","replyTo":"LIST","senderId":"QohlSi6mAsa3hSwsWUNLOvPc2qROuBI3OlebhiEDCJYybUvO2Q4U-cPD1_lrrTtKs2-lkkXLAOLU","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Homeschool or not homeschool","postDate":"991225495","msgId":22216,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg3LmI0MmYwMmIuMjg0NjQwOTdAYW9sLmNvbT4="},"prevInTopic":22210,"nextInTopic":22217,"prevInTime":22215,"nextInTime":22217,"topicId":22193,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/29/01 5:03:49 PM, tgraves@solucient.com writes: ","messageBody":"<div id=\"ygrps-yiv-228130947\">In a message dated 5/29/01 5:03:49 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:tgraves@...\">tgraves@...</a> writes:<br/>\n<br/>\n&lt;&lt;  I have to still convince my dh of this as ps is still very<br/>\nmuch a part of him and is hard to break him of (still cannot understand why,<br/>\nwhen both he and I hated it so much).  &gt;&gt;<br/>\n<br/>\nWhen something&#39;s painful and we had no choice sometimes we justify why it was <br/>\nimportant and good for us.  And we cling to those justifications, because <br/>\notherwise we might get really angry at our parents or whoever did that to us, <br/>\nor inflicted the thing on us, or made us continue.  <br/>\n<br/>\n(Seems to me, anyway, that people can justify their own or others&#39; drinking; <br/>\nbeing hit and yelled at; being left alone too much; having been given yucky <br/>\nmedicine or made to go to bed when they weren&#39;t sleepy or much, much worse.)<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":0,"authorName":"Nicki Clark","from":"&quot;Nicki Clark&quot; &lt;nicki@...&gt;","replyTo":"LIST","senderId":"IGDhFlhxn6qsNMIR9vUVf6EfO4gLX5jdB6OccPBACcCcqMH64dNJkz5A3GH55R2LjAvQ6rsIufEJY_fwHUTokWuEeqcB3Lvo_itjlg","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [Unschooling-dotcom] Homeschool or not homeschool","postDate":"991184073","msgId":22210,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFFRU1JTUFDSUxPTUlMTERHTklORUVKTUNQQUEubmlja2lAZGV0cm9pdG1hbWEuY29tPg==","inReplyToHeader":"PDNCMTQ0REJELjE5MzAxLjI2QzkwQTFAbG9jYWxob3N0Pg=="},"prevInTopic":22209,"nextInTopic":22216,"prevInTime":22209,"nextInTime":22211,"topicId":22193,"numMessagesInTopic":0,"msgSnippet":" Ugh Tracy, I am way too afraid to ask. Maybe in a few years. This was the same day said","messageBody":"<div id=\"ygrps-yiv-879287495\">&lt;&lt;I wonder what your children really think about that<br/>\nepisode...&gt;&gt;<br/>\n<br/>\nUgh Tracy, I am way too afraid to ask. Maybe in a few years.<br/>\n<br/>\n This was the same day said grandfather kicked his son and my children out<br/>\nof their house and onto the street with no car, no money and no where to go.<br/>\nI finally got a collect call at work at the end of my work day - they&#39;d<br/>\nspent all day on the streets. Oh - and they were escorted away by the<br/>\npolice. This was a big reason I wanted my children to witness me being<br/>\nproactive with the police. They had just been forced to leave their father&#39;s<br/>\nhome by police escorts who KNEW they&#39;d be homeless and transportationless<br/>\nand did not even offer my ex a chance to call me or make arrangements<br/>\notherwise. My kids were 18 months and 4.5 at the time. My kids have<br/>\nwitnessed way too much and been through way too much. I don&#39;t *think* they<br/>\nsense my feelings about this because most of my decisions are based on these<br/>\nreasons on more of a subconscious level. It&#39;s only when I start thinking and<br/>\nwriting about it that I realize how much of our past affects my parenting<br/>\ndecisions now and it makes more sense (if only to me! &lt;grin&gt;) why I have<br/>\nmade the decisions that I have and why I&#39;m so on the fence about things. I<br/>\nused to have such conviction and now I&#39;ve seen the hurt that my convictions<br/>\nhave cast on my children and it&#39;s made me very cautious. I&#39;m FINALLY<br/>\nstarting to see the hurt that being so cautious has created (small stuff<br/>\ncompared to the rest but even small stuff is significant). And I&#39;m just<br/>\ntrying to wade through and find a middle ground. Cautiously optimistic, I<br/>\nthink it&#39;s called :)<br/>\n<br/>\nI really do try to stand up for them. In other realms this comes naturally.<br/>\nIt USED to come naturally in his classroom as well. I hope I am not coming<br/>\nacross as one of those pushover inactive parents. I guess I have finally<br/>\ngiven up. I spent the better part of the school year making daily<br/>\nappearances, phone calls, letters ....all with gently-worded clarifications<br/>\nabout my expectations, concerns, etc. I KNOW all the little tricks to being<br/>\nassertive and making myself clear as day. I&#39;ve done it a million times<br/>\nbefore in other situations. I&#39;ve counseled other Mothers on being assertive<br/>\nwith their families and doctors. It is second-nature to me. But I was<br/>\nconstantly belittled, pacified, etc. by this teacher.  I always left more<br/>\nangry than I did when I came in. The VERY first day of school there was a<br/>\nbullying incident and I jumped on it right away and was literally told by<br/>\nthis teacher that my child was perhaps reacting to how different he felt<br/>\nbecause of his age (he was only 5 when he started first grade). That she was<br/>\nnot present during the episode but it seemed to stem from my own child&#39;s<br/>\nfrustration at not being able to keep up with the other kids - not actual<br/>\nbullying from other kids. No attempts by me to firmly clarify that my child<br/>\nrelayed incidences of name-calling, restricted access on the playground, etc<br/>\nmade this woman reconsider her own stand. She&#39;d drawn a conclusion and stuck<br/>\nto it. She does not want to hear what I have to say. From the start her<br/>\nreaction to confrontation has been to clearly repeat her own stand until I<br/>\nback down or give up. She simply does not want to hear what I have to say.<br/>\nMANY times my son has been present during these conversations and I have<br/>\nalways tried to leave before it is too obvious that this woman cares nothing<br/>\nfor what I have to say. Finally I&#39;ve given up. Maybe that makes me a weak<br/>\nmother or just plain a failure. Maybe I am dismissing  an opportunity to<br/>\npossibly create a strong memory for him to take into adulthood. But I&#39;m<br/>\ntired and I hate the system and I could care less what all the other<br/>\nchildren learn or don&#39;t learn from this woman anymore. All I care about is<br/>\nMY child and my rally for change has to start at home. At least for this<br/>\nissue.<br/>\n<br/>\nNicki</div>","specialLinks":[]},{"userId":0,"authorName":"Tracy Oldfield","from":"&quot;Tracy Oldfield&quot; &lt;tracy.oldfield@...&gt;","replyTo":"LIST","senderId":"LwjPbaB6CbmvDmHxQqCVgTeUCj2szmlFSMmkN6VgFbKUUWW10IyJ1KB2vbifRdoX0aGXJmWH1pii9SrFHh8mXQiQ6HtlzURcZVVLv8pzmaTELrAyBA","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [Unschooling-dotcom] Homeschool or not homeschool","postDate":"991182765","msgId":22209,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNCMTQ0REJELjE5MzAxLjI2QzkwQTFAbG9jYWxob3N0Pg==","inReplyToHeader":"PEFFRU1JTUFDSUxPTUlMTERHTklOR0VKS0NQQUEubmlja2lAZGV0cm9pdG1hbWEuY29tPg==","referencesHeader":"PDNCMTQ0NDcyLjkwNTIuMjQ4NDEzOUBsb2NhbGhvc3Q+"},"prevInTopic":22208,"nextInTopic":22210,"prevInTime":22208,"nextInTime":22210,"topicId":22193,"numMessagesInTopic":0,"msgSnippet":"\u000f \u000f Well, I would NEVER do this. It is a great and valid suggestion so I truly\u000f ","messageBody":"<div id=\"ygrps-yiv-1562221251\">&lt;&lt;facing the teacher down\u000f<br/>\nwith him present would be a useful experience &gt;&gt;\u000f<br/>\n\u000f<br/>\nWell, I would NEVER do this. It is a great and valid <br/>\nsuggestion so I truly\u000f<br/>\nappreciate it. But our past history has taught me to be <br/>\nEXTREMELY cautious\u000f<br/>\nat what I choose to expose my child/ren to under the <br/>\npremise that they will\u000f<br/>\nlearn something valuable. Unless I am very very sure <br/>\nthat the outcome will\u000f<br/>\nbe to my liking (i.e the teacher will admit that what <br/>\nrules we have at our\u000f<br/>\nhouse can not be dictated by her, that it&#39;s wrong, that <br/>\nshe&#39;s sorry she\u000f<br/>\nunderestimated my child, etcetc), my experience is <br/>\nthese types of situations\u000f<br/>\ndo more harm than good. Or at very least that the harm <br/>\nthat can be done is\u000f<br/>\nway too damaging to risk it.\u000f<br/>\n<br/>\n<br/>\nOK, I get your point, it&#39;s not possible to know what <br/>\nthe outcome of this would be, but I still think that <br/>\nhaving his mother spell out to said teacher why it&#39;s <br/>\nimportant for your son to learn in his own sweet way <br/>\nwould get the message across to him more than telling <br/>\nhim directly, and the fact that you&#39;re willing to take <br/>\nsuch a stand for him would be impressive.  But this is <br/>\nmy thoughts on it, so what you do is up to you.<br/>\n<br/>\nThat&#39;s a scary story, btw.  On the other hand, my <br/>\nbrother told me this story about my mum, who usually <br/>\ndoesn&#39;t say boo to a goose and could have &#39;anything for <br/>\nan easy life&#39; tattoed on her face, she says it so <br/>\noften.  Db has something about his teeth that cause <br/>\nthem to fur up when he drinks milk.  One day he was <br/>\ngoing to the dentist (he was about 8yo I think) and the <br/>\ndentist started having a go at him for not brushing.  <br/>\nMum stood up, for once, and told the guy that he had <br/>\nbrushed his teeth, she&#39;d watched him do it, and if he <br/>\nwas going to call them liars she&#39;d go somewhere else.  <br/>\nMum doesn&#39;t think she can stand up to authority <br/>\nfigures, but she can and I&#39;ve told her so (from this <br/>\nand other things) so don&#39;t underestimate the power of a <br/>\nchild&#39;s memory!  You can use the situation to your <br/>\nadvantage, don&#39;t let it get confrontational, just say <br/>\nyour piece and leave.  Don&#39;t let &#39;em grind you down!<br/>\n<br/>\nI wonder what your children really think about that <br/>\nepisode...<br/>\n<br/>\nTracy</div>","specialLinks":[]},{"userId":0,"authorName":"Nicki Clark","from":"&quot;Nicki Clark&quot; &lt;nicki@...&gt;","replyTo":"LIST","senderId":"SKRC-SVlZ2zeTrM2jIH6-4fI8wLeIa72DaVnSbcpI-2JvUYj-FNVZyVUrZCXvijtbrTN_AT4eTzBDYDDHUtx5RtcZ18kgDsQJlhByQ","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [Unschooling-dotcom] Homeschool or not homeschool","postDate":"991181698","msgId":22208,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFFRU1JTUFDSUxPTUlMTERHTklOR0VKS0NQQUEubmlja2lAZGV0cm9pdG1hbWEuY29tPg==","inReplyToHeader":"PDNCMTQ0NDcyLjkwNTIuMjQ4NDEzOUBsb2NhbGhvc3Q+"},"prevInTopic":22205,"nextInTopic":22209,"prevInTime":22207,"nextInTime":22209,"topicId":22193,"numMessagesInTopic":0,"msgSnippet":" Well, I would NEVER do this. It is a great and valid suggestion so I truly ","messageBody":"<div id=\"ygrps-yiv-727293763\">&lt;&lt;facing the teacher down<br/>\nwith him present would be a useful experience &gt;&gt;<br/>\n<br/>\nWell, I would NEVER do this. It is a great and valid suggestion so I truly<br/>\nappreciate it. But our past history has taught me to be EXTREMELY cautious<br/>\nat what I choose to expose my child/ren to under the premise that they will<br/>\nlearn something valuable. Unless I am very very sure that the outcome will<br/>\nbe to my liking (i.e the teacher will admit that what rules we have at our<br/>\nhouse can not be dictated by her, that it&#39;s wrong, that she&#39;s sorry she<br/>\nunderestimated my child, etcetc), my experience is these types of situations<br/>\ndo more harm than good. Or at very least that the harm that can be done is<br/>\nway too damaging to risk it.<br/>\n<br/>\nCase in point - two years ago after I separated from my ex and he was living<br/>\nwith his parents and watching my children during the day  my kids&#39; paternal<br/>\ngrandfather decided to get physically abusive on me. He did this in front of<br/>\nmy children. I was really shocked but not terribly hurt. I weighed my<br/>\noptions and decided that because my children SAW what happened I needed to<br/>\nbe proactive and take them with me to file a report against this man.<br/>\nPrevious years experience taught me (unfortunately) that assault and battery<br/>\nwas pretty easy to file - especially being a woman, a mother, and having<br/>\nwitnesses. I felt like it would be wise to show my children that at no costs<br/>\nis it appropriate to tolerate physical abuse, that the police are there to<br/>\nhelp keep us safe and protect us from people who try to harm us. I took them<br/>\nbecause I felt it was important for them to see me being proactive about<br/>\nthis situation. In the end, the police LAUGHED me out of the station,<br/>\nliterally telling me that they had &quot;real&quot; crime to fight and that I couldn&#39;t<br/>\nbe a &quot;nutsy woman&quot; and expect them to do ANYTHING about this situation. They<br/>\nsaid all of this in front of my children. I even said to them that I&#39;d hoped<br/>\nthey&#39;d be more responsive to the situation, if only for my children&#39;s<br/>\nbenefit and they told me something about my children  learning early that<br/>\nthere is real crime and then there are family squabbles. Oh - not to mention<br/>\nthat I was totally berated for breastfeeding my toddler there. Doesn&#39;t<br/>\nmatter that the law is on my side when I&#39;m IN the police station.<br/>\n<br/>\nI can not tell you how much this experience has tainted my belief that we<br/>\nshould drag our kids through these situations with us. I am way way way too<br/>\nfearful that this teacher would accuse my child of being delayed, behind, a<br/>\npoor reader, a poor student and accuse me and homeschooling of making that<br/>\nhappen. It has happened in the past and that is NOT something I want my<br/>\nchild to hear from the person he already listens to more than his own<br/>\nmother! It would accomplish exactly the opposite and further alienate<br/>\nhimself from me and homeschooling as a concept.<br/>\n<br/>\nNicki</div>","specialLinks":[]},{"userId":0,"authorName":"Tracy Oldfield","from":"&quot;Tracy Oldfield&quot; &lt;tracy.oldfield@...&gt;","replyTo":"LIST","senderId":"-KKPi73BzEziR8ZnEQ9p94qm9uuLr2ztgPVKe19qdtcfrAWRiDEAOUV6TmSutpnEti3hFzyXnpaJ8QK0VCFyLeV7mZfi7wmq7l5lljad4CigG4CDfg","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Homeschool or not homeschool","postDate":"991180386","msgId":22205,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNCMTQ0NDcyLjkwNTIuMjQ4NDEzOUBsb2NhbGhvc3Q+","inReplyToHeader":"PDlmMHU4cytldWdqQGVHcm91cHMuY29tPg=="},"prevInTopic":22195,"nextInTopic":22208,"prevInTime":22204,"nextInTime":22206,"topicId":22193,"numMessagesInTopic":0,"msgSnippet":"Nikki,\u000f \u000f You have to make the decision to homeschool or public school.\u000e \u000f Everyone on this list made the decision to unschool, homeschool, \u000f private/public","messageBody":"<div id=\"ygrps-yiv-344644901\">Nikki,\u000f<br/>\n\u000f<br/>\nYou have to make the decision to homeschool or public <br/>\nschool.\u000e \u000f<br/>\nEveryone on this list &quot;made&quot; the decision to unschool, <br/>\nhomeschool, \u000f<br/>\nprivate/public school their children.\u000e What you can do <br/>\nis let him \u000f<br/>\nhelp you pick his curriculum.\u000e But at six years old, <br/>\nyou as the adult \u000f<br/>\nshould be making the schooling decision.\u000e If he likes <br/>\nto play soccer, \u000f<br/>\nsign him up for a soccer league.\u000e Maybe the homeschool <br/>\ngroup has a \u000f<br/>\nteam.\u000e Take him to homeschool functions.\u000e He will make <br/>\nfriends very \u000f<br/>\neasy.\u000e He is very young.\u000e That is my opinion.\u000e I <br/>\nprobably stepped on \u000f<br/>\na toe or two and I apologize in advance.\u000e \u000f<br/>\n\u000f<br/>\nMolly\u000f<br/>\n<br/>\n<br/>\nI disagree (but my toes are fine, thanks!  LOL)  <br/>\nUnschooling is about children taking their own <br/>\ndecisions, and being supported by their parents.  We <br/>\nmake the decision to support this, but that&#39;s as far as <br/>\nit goes.  YMobviouslyV!!  If he wants to go to school, <br/>\nthat&#39;s up to him.  What he gets from it will vary <br/>\ndepending on the attitude of everyone around him, which <br/>\nis why I said that I thought facing the teacher down <br/>\nwith him present would be a useful experience *grin*  <br/>\nNow one of mine said on the way to the home-ed fes we <br/>\nwere camping at that they wanted to go to school so we <br/>\nshouldn&#39;t be going, but it hasn&#39;t been mentioned <br/>\nsince...  Don&#39;t know what exactly I&#39;d do about it if <br/>\nshe did decide to go, but that&#39;s not the point, it&#39;s <br/>\nlike Sandra said, it&#39;s about personal power, choice, <br/>\nfreedom.<br/>\n<br/>\nMy 2p worth<br/>\nTracy</div>","specialLinks":[]},{"userId":0,"authorName":"elmamahnke@yahoo.com","from":"elmamahnke@...","replyTo":"LIST","senderId":"CvjUW987ka_9Q8c0Hk5t-h8H8rZls6pwjPHobc2t3YxExiRi4ZCDpu3TUIGkjNJjyWLtaz-f-wJFfcE","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Homeschool or not homeschool","postDate":"991165532","msgId":22193,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlmMHU4cytldWdqQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":22195,"prevInTime":22192,"nextInTime":22194,"topicId":22193,"numMessagesInTopic":0,"msgSnippet":"Nikki, You have to make the decision to homeschool or public school. Everyone on this list made the decision to unschool, homeschool, private/public school","messageBody":"<div id=\"ygrps-yiv-1066475995\">Nikki,<br/>\n<br/>\nYou have to make the decision to homeschool or public school.  <br/>\nEveryone on this list &quot;made&quot; the decision to unschool, homeschool, <br/>\nprivate/public school their children.  What you can do is let him <br/>\nhelp you pick his curriculum.  But at six years old, you as the adult <br/>\nshould be making the schooling decision.  If he likes to play soccer, <br/>\nsign him up for a soccer league.  Maybe the homeschool group has a <br/>\nteam.  Take him to homeschool functions.  He will make friends very <br/>\neasy.  He is very young.  That is my opinion.  I probably stepped on <br/>\na toe or two and I apologize in advance.  <br/>\n<br/>\nMolly</div>","specialLinks":[]},{"userId":0,"authorName":"Tammy Graves","from":"&quot;Tammy Graves&quot; &lt;tgraves@...&gt;","replyTo":"LIST","senderId":"Mxo2w-ln6DRtuj31uy0oX4TTCx8JnaYdR7eqgDJKq2KwYflQgWJ2MzvCIhwmRWllrYJumG-mi-c6TM1v0YZ-Dhqe_ww9xYqJzbJVqt0","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Homeschool or not homeschool","postDate":"991165282","msgId":22195,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg1MjU2QTVCLjAwNkNEMzBGLjAwQG5vdGVzLmJhLmhjaWEuY29tPg=="},"prevInTopic":22193,"nextInTopic":22205,"prevInTime":22194,"nextInTime":22196,"topicId":22193,"numMessagesInTopic":0,"msgSnippet":"Ouch... my toes. I m ok though now. fyi - I have not taken my dd s out of ps yet. I am using this post site as a place to learn about the best ways to go about","messageBody":"<div id=\"ygrps-yiv-47871738\">Ouch... my toes. I&#39;m ok though now.<br/>\nfyi - I have not taken my dd&#39;s out of ps yet. I am using this post site as a<br/>\nplace to learn about the best ways to go about it and  to really understand what<br/>\nit is to unschool. I have to still convince my dh of this as ps is still very<br/>\nmuch a part of him and is hard to break him of (still cannot understand why,<br/>\nwhen both he and I hated it so much). There are a few things we must get in<br/>\ncontrol of and feel comfortable with before we can take the full plunge. I have<br/>\nbegun attending the hs group that meets sort of near by monthly as well. I would<br/>\nhope that I can still voice my opinions and questions to this group even though<br/>\nI have not pulled them out yet.<br/>\n<br/>\nI can understand Nicki&#39;s pain. Understand too that a 6 yo will change their<br/>\nminds quite often and what they like now, they may not tomorrow and visa versa.</div>","specialLinks":[]}],"prevTopicId":22116,"nextTopicId":22246}}