{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":82126585,"authorName":"KimBaker","from":"&quot;KimBaker&quot; &lt;azhom@...&gt;","profile":"azhom2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Checking in/Checking Out","postDate":"1016945922","msgId":33626,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMGYwMWMxZDJmMCQ5Mjc2NjA2MCQ5MGRkMTNkMEAwMDE4NzIwODg1Pg==","referencesHeader":"PDEwMTY5NDI5MjguMTQ0MS4xMDgyNi5tNkB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":33625,"nextInTime":33627,"topicId":33626,"numMessagesInTopic":0,"msgSnippet":"What will it take for everyone to stop this????? This list is quickly becoming nothing but a waste of time? You all have so much information to give and share,","messageBody":"<div id=\"ygrps-yiv-1851962639\">What will it take for everyone to stop this????? This list is quickly<br/>\nbecoming nothing but a waste of time? You all have so much information to<br/>\ngive and share, but all the sarcasm and nonsense is starting to outweigh<br/>\nthat. AND THAT IS A SHAME! :-(<br/>\n<br/>\nKIM in MO   Dylan 12 Jacob 11 Noah 2<br/>\n<br/>\nMessage: 24<br/>\n   Date: Sat, 23 Mar 2002 18:48:08 -0800<br/>\n   From: Tia Leschke &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:leschke@...\">leschke@...</a>&gt;<br/>\nSubject: Re: Checking in/checking out<br/>\n<br/>\nWas this what you were looking for, Sarah?<br/>\nTia<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt;Dear friends and listmembers,<br/>\n&gt;<br/>\n&gt;I wish there was a quick, easy and convenient way to let you all know<br/>\n&gt;what I&#39;m thinking and feeling this morning. Unfortunately, this email<br/>\n&gt;mode of communication doesn&#39;t really do much more than give us a way<br/>\n&gt;to exchange writings. For me, that becomes even more limiting because<br/>\n&gt;I&#39;ve had trouble with carpal tunnel syndrome for the last few years<br/>\n&gt;and so I try to limit the time I spend on keyboards these days. What<br/>\n&gt;I might have at one time spent many paragraphs trying to explain will<br/>\n&gt;now need to be presented much more concisely than I&#39;d normally<br/>\n&gt;prefer. Also, because we&#39;re in deadline for our May/June issue of<br/>\n&gt;HEM, I need to spend more time on non-list related projects, so I<br/>\n&gt;*really* can&#39;t write as much as I&#39;d like to on this whole topic. And<br/>\n&gt;if that&#39;s not enough, our oldest son and his family are here visiting<br/>\n&gt;from Alaska for only a few days, and I&#39;d much rather be spending time<br/>\n&gt;with them than sorting out the mess on this list. Anyway, all of that<br/>\n&gt;to say this:<br/>\n&gt;<br/>\n&gt;It&#39;s a major disappointment to see this list fall back into the same<br/>\n&gt;kind of downward spiral we experienced a few weeks (or was it<br/>\n&gt;months?) ago. I needed to be gone unexpectedly for a couple of days,<br/>\n&gt;so I stayed up last night long after everyone here had gone to bed,<br/>\n&gt;reading and trying to make sense of what was going on with this list.<br/>\n&gt;I finally fell asleep, got back up early this morning and started<br/>\n&gt;reading again, missed breakfast with the family in trying to sort<br/>\n&gt;this out... and have finally caught up with the posts. Now I sit here<br/>\n&gt;wondering why I spent all that time reading and trying to make some<br/>\n&gt;sense of all the accusations, defenses, proclamations, and so on and<br/>\n&gt;so forth. It was truly discouraging to see the disparaging remarks<br/>\n&gt;about our magazine in the middle of this discussion - even a threat<br/>\n&gt;to reconsider an HEM subscription - because as far as I&#39;m concerned<br/>\n&gt;this list has absolutely nothing to do with the publication we<br/>\n&gt;produce for homeschoolers. To see our magazine called into question<br/>\n&gt;because of what someone who happens to write for us does on this list<br/>\n&gt;was probably the final straw for me.<br/>\n&gt;<br/>\n&gt;We - the publishers of Home Education Magazine - &quot;sponsor&quot; this list,<br/>\n&gt;and many others, because we feel it&#39;s important for homeschoolers to<br/>\n&gt;discuss issues with each other, to offer support and encouragement,<br/>\n&gt;to have places for communication and networking. I think once upon a<br/>\n&gt;time that might have been a valid approach, but, unfortunately, after<br/>\n&gt;what I&#39;ve read here, I think lists like this one are more of a<br/>\n&gt;liability to our publication than an asset.<br/>\n&gt;<br/>\n&gt;I&#39;ll be blunt. I do not have the time nor the interest in being<br/>\n&gt;involved with the kinds of dynamics I&#39;ve read here in the last few<br/>\n&gt;hours. I&#39;m not even interested in longwinded discussions any more. I<br/>\n&gt;just need to do my job as Managing Editor of HEM, and this list has<br/>\n&gt;become a major impediment to that. For that reason, I am removing all<br/>\n&gt;references to HEM from this list, turning this list over to the<br/>\n&gt;moderators, unsubscribing, and getting on with what needs doing in my<br/>\n&gt;life. I wish you all the best in finding appropriate resolutions.<br/>\n&gt;<br/>\n&gt;Helen </span></blockquote></div>","specialLinks":[]}],"prevTopicId":33441,"nextTopicId":33588}}