{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":0,"authorName":"Sharon Rudd","from":"Sharon Rudd &lt;bearspawprint@...&gt;","replyTo":"LIST","senderId":"cB9LJIiHtku1I8M75ilwqw7poTXuEvJ7rF80KW-qrEscTHzxjrZcePYJU70LYJpFo1QjBLlqMSCOeSUnXzbhRp7-0o9ogD1WbuSLkg","spamInfo":{"isSpam":false,"reason":"0"},"subject":"some comments re:  Knok News","postDate":"990557409","msgId":21733,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDEwNTIyMTg1MDA5LjI2Nzk0LnFtYWlsQHdlYjE0MzAxLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDIwMDEwNTIyMDY1Ny5QQUExNjM5MEBzbXRwMy5kdGkubmUuanA+"},"prevInTopic":21687,"nextInTopic":0,"prevInTime":21732,"nextInTime":21734,"topicId":21687,"numMessagesInTopic":0,"msgSnippet":"... Greetings, Thank you for posting the newsletter on the unschooling list. I might never have seen it, otherwise. I spent almost a year in Urawa prefecture.","messageBody":"<div id=\"ygrps-yiv-2042801051\"><blockquote><span title=\"ireply\">&gt;                      * * * *  KnoK NEWS  * * * *<br/>\n&gt;          -- Views from the world of learning in<br/>\n&gt; Japan --<br/>\n&gt; <br/>\n </span></blockquote>Greetings,<br/>\n<br/>\nThank you for posting the newsletter on the<br/>\nunschooling list. I might never have seen it,<br/>\notherwise.<br/>\n<br/>\nI spent almost a year in Urawa prefecture. At the time<br/>\nmy sons were 8, 5, and not yet 1.  They are now 27,<br/>\n25, and 20.  I have a 7 year old boy who is now an<br/>\nun/home-schooler. I do recall the rigidity of the<br/>\nschool system. I was fortunate that my boys, being<br/>\nAmerican, did not have to attend.  My husband<br/>\ninsisted, though, that, the 5 year old attend<br/>\nkindergarten for 1 month (&quot;just to see&quot;), while I<br/>\ntaught several classes of parents American English<br/>\nConversation.  It was an awful experience for him. <br/>\nAfter the month, I continued to teach, (I taught other<br/>\nJuku, also) for pay, but what a relief to get my<br/>\nlittle boy away from that cultural wasteland!  The<br/>\nolder one was allowed to &quot;go to&quot; public school, but<br/>\nmostly he wandered the halls to escape.  They asked if<br/>\nhis ego or actual learning was more important. I opted<br/>\nfor ego.  He learned at home. Fortunately this didn&#39;t<br/>\nstart until almost the end of the school year, so it<br/>\nwas only a few weeks.  <br/>\n<br/>\nAn actual refusal to go to school by teachers and<br/>\nstudents didn&#39;t seem possible at that time.  Yet it<br/>\nmust have been inevitable.....everyone could not keep<br/>\nup the pace!! Juku after school and school all day and<br/>\nhomework. Maybe a few could do it, but not everybody! <br/>\nI hope there are some worthwhile reforms soon, before,<br/>\nbefore ? what? <br/>\n<br/>\nThank you for all you have done<br/>\nSharon, now in Florida<br/>\n  <br/>\n<br/>\n__________________________________________________<br/>\nDo You Yahoo!?<br/>\nYahoo! Auctions - buy the things you want at great prices<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://auctions.yahoo.com/\">http://auctions.yahoo.com/</a></div>","specialLinks":[]},{"userId":0,"authorName":"Covert","from":"Covert &lt;covert@...&gt;","replyTo":"LIST","senderId":"OC78BNR3yhBxVdCiwWG3_YtqQKiQMgEgBuSZbbyIPa_-WGpwxVwm3afb7Wv3p5PWxmDnRD52cmZ77OcGAIH1nAHyZw8cEA","spamInfo":{"isSpam":false,"reason":"0"},"subject":"KnoK NEWS for 22 May 2001 (pt. 1)","postDate":"990514947","msgId":21687,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDEwNTIyMDY1Ny5QQUExNjM5MEBzbXRwMy5kdGkubmUuanA+"},"prevInTopic":0,"nextInTopic":21733,"prevInTime":21686,"nextInTime":21688,"topicId":21687,"numMessagesInTopic":0,"msgSnippet":"* * * *  KnoK NEWS  * * * * -- Views from the world of learning in Japan -- Welcome to the 22 May 2001 edition of KnoK (pronounced knock ) NEWS, an informal","messageBody":"<div id=\"ygrps-yiv-612860386\">* * * *  KnoK NEWS  * * * *<br/>\n         -- Views from the world of learning in Japan --<br/>\n<br/>\n<br/>\nWelcome to the 22 May 2001 edition of KnoK (pronounced &quot;knock&quot;) NEWS, an <br/>\ninformal and periodic bulletin concerning issues of learning in Japan. It <br/>\nis brought to you by the Covert family -- Kazumi, Kenya and Brian -- a <br/>\nmulticultural, homelearning family in Osaka, Japan.<br/>\n<br/>\nKnoK stands for *Kodomo no Kokoro*, meaning &quot;Heart of a Child&quot; in <br/>\nJapanese. It is our belief that the heart of any child is indeed at the <br/>\ncenter of true learning, wherever and however such learning may take <br/>\nplace. <br/>\n<br/>\n<br/>\n<br/>\n             &lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;  &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n<br/>\n<br/>\nEDITOR&#39;S GREETINGS:  Hello again, to all our friends around the world. <br/>\nWe&#39;re back again with a very special, pre-summer (and in Japan, pre-rainy <br/>\nseason) edition of KnoK NEWS.<br/>\n<br/>\nIf you&#39;ve been following us and other news sources from Japan, you have <br/>\nheard that, like other countries around the globe, Japan continues to see <br/>\na rise in the numbers of students who refuse to attend school. This goes <br/>\ndeeper than just cutting classes -- many of these Japanese students are <br/>\nundergoing emotional trauma from the pressures of rote memorizing, <br/>\nhellish exams, forced socialization and bullying. But it seems children <br/>\naren&#39;t the only victims of *gakko hokai* (school breakdown).<br/>\n<br/>\nWe&#39;ve been hearing more and more recently about &quot;school-refusing <br/>\nteachers&quot; in Japanese society. These are mostly public schoolteachers who <br/>\nare suffering emotional breakdowns under the massive burden of <br/>\n&quot;educating&quot; Japan&#39;s schoolchildren in an academic system that demands <br/>\nconformity at all costs. <br/>\n<br/>\nThere was one educator in Japan, believe it or not, who saw this whole <br/>\nsorry state of affairs coming -- about one hundred years ago. This <br/>\nvisionary offered possible solutions and alternatives to just the kinds <br/>\nof educational problems that parents, students and teachers alike are <br/>\nfacing in modern-day Japan. His name was Tsunesaburo Makiguchi <br/>\n(1871-1944), and it is to him that we devote this double-edition of KnoK <br/>\nNEWS.<br/>\n<br/>\nWhat made Makiguchi special was that he recognized children to be <br/>\nnatural-born learners, and family and community to be the cornerstones of <br/>\nlifelong learning for young people. Schoolteachers, he believed, best <br/>\nserved their roles in offering guidance and advice to youths only when <br/>\nneeded, and that force-feeding facts into the heads of students was a <br/>\nmistake that would someday come back to haunt Japan. Makiguchi was right <br/>\non time in his analysis.<br/>\n<br/>\nHis beliefs may all seem like common sense today, but in the late <br/>\n1800s/early 1900s, such views bordered on heresy and blasphemy. Japan had <br/>\njust begun opening its borders to the world after a few hundred years of <br/>\nself-imposed isolation. Industrialization was the order of the day in <br/>\nthis new Meiji era (1868-1912), and along with it, the enforcement of a <br/>\nconcept called *gimu kyoiku*, or &quot;compulsory education,&quot; that was already <br/>\nspreading in Europe and North America.<br/>\n<br/>\nWhile Makiguchi was truly a far-seeing yet practical educator, he <br/>\nremained mostly unknown to the Japanese public in his day. But times are <br/>\nchanging. A steadily increasing recognition of Tsunesaburo Makiguchi&#39;s <br/>\nlife and work, especially in the West, has come about. This is due in no <br/>\nsmall part to the efforts of holistic educator and author Dr. Dayle <br/>\nBethel, our guest columnist this time, who has written an article <br/>\nexclusively for KnoK NEWS.<br/>\n<br/>\nA pioneer of sorts in his own right, Bethel established The International <br/>\nUniversity Kyoto Learning Center (http://www.tiu-asiapacific.org) in <br/>\nKyoto, Japan, back in 1975 -- a time when the concept of community-based <br/>\nlearning was still a far more &quot;bizarre&quot; idea in Japanese society than it <br/>\nis today.<br/>\n<br/>\nThe Kyoto Learning Center is a branch of The International University <br/>\n(http://www.tiu.com) in Independence, Missouri, US, and offers <br/>\nalternative education to university students here in Japan. The Kyoto <br/>\nCenter&#39;s voice seems small compared to the cacophony of mainstream <br/>\nJapanese university education -- with its blaring emphasis on preparing <br/>\nJapanese students to be good &quot;company soldiers&quot; in the battlefields of <br/>\nthe business world. Be that as it may, the Kyoto Center does continue to <br/>\nkeep the light of community-based learning shining both in Japan and at <br/>\nits sister-center in Hawaii.<br/>\n<br/>\n(By way of disclaimer, KnoK NEWS has no affiliation or connection with <br/>\nT.I.U. Kyoto Learning Center, other than offering our full moral support <br/>\nfor the educational mission of the Center and its work for greater <br/>\neducational choices in Japan and around the world.)<br/>\n<br/>\nBethel himself has been researching and writing books and articles on <br/>\nMakiguchi since the early 1970s, and in doing so, helped to renew <br/>\nMakiguchi&#39;s legacy in Japan and abroad. We can only hope that the life <br/>\nand work of this remarkable Japanese educator/philosopher will hold a <br/>\npermanent and respected place in the international field of learning in <br/>\nthe future.<br/>\n<br/>\nThere are already positive signs of that happening, in fact. As this <br/>\nedition of KnoK NEWS was going to press, quite coincidentally we found <br/>\nthat a widely circulated Japanese print magazine this month is featuring <br/>\na hefty cover story on Makiguchi and his contributions to grassroots <br/>\nlearning in Japan. So, the word does seem to be getting out.<br/>\n<br/>\nA profile before we get into the main article:<br/>\n<br/>\nTsunesaburo Makiguchi was born into poverty in a rural village in Niigata <br/>\nPrefecture, northern Japan, in 1871 (three years after the Meiji-era <br/>\nopening of Japan had begun). As a child he was abandoned first by his <br/>\nfather, then his mother, and was brought up mostly by relatives. As a <br/>\nyoung man he moved to Japan&#39;s northernmost island of Hokkaido, where he <br/>\ncontinued his studies and became a schoolteacher, specializing in <br/>\ngeography. He married Kuma Makiguchi, a distant cousin, and they would go <br/>\non to have eight children in all.<br/>\n<br/>\nMakiguchi and his family eventually moved down south to the capital city <br/>\nof Tokyo, and he worked as a teacher and principal at several primary <br/>\nschools. Makiguchi apparently was a thorn in the side of school <br/>\nadministrators, teachers and parents alike, because of his rejection of <br/>\nfactory-type public education and his unwavering faith in the natural <br/>\nabilities of learning among children.<br/>\n<br/>\nHe published his most famous work, *Jinsei Chirigaku* (A Geography of <br/>\nHuman Life), in 1903 and he had hoped it would serve as a new, more <br/>\nhumanistic guide for Japanese teachers in the area of childhood learning. <br/>\nHe was later forced to retire from the education field, and devoted <br/>\nhimself to Buddhism, in particular his own ethics philosophy of &quot;creating <br/>\nvalues&quot; in society.<br/>\n<br/>\nAs World War II raged on, Makiguchi found himself imprisoned in 1943 by <br/>\nthe Fascism-adherent military authorities in Japan -- not for his <br/>\neducational beliefs, ironically, but because he and other scholars of the <br/>\nday refused to recognize the state-imposed version of Japan&#39;s indigenous <br/>\nShinto religion. By the time he was serving his wartime prison sentence, <br/>\nMakiguchi had outlived five of his own eight children.<br/>\n<br/>\nMakiguchi himself died of malnutrition in Tokyo&#39;s Sugamo Prison in 1944, <br/>\na year before Japan&#39;s surrender in the war. He was 73 years old.<br/>\n<br/>\nHaving died behind bars, Makiguchi was never to see the direction Japan&#39;s <br/>\neducational system would take: Just two years after the end of the war, <br/>\nunder pressure from the U.S. occupation forces, the Japanese government <br/>\nadopted in March 1947 the *Kyoiku Kihon Ho* (Fundamental Law of <br/>\nEducation), which essentially took education out of the divine realm of <br/>\nthe Japanese emperor and placed it in the hands of the Japanese public. <br/>\nAround the same time, Japan also adopted the *Gakko Kyoiku Ho* (School <br/>\nEducation Law), which set up, for better or worse, an &quot;American-style&quot; <br/>\n6-3-3 structure of compulsory public education. These two laws remain, to <br/>\nthis day, the pillars of Japan&#39;s education system -- and both laws <br/>\ncontinue to be sources of heated controversy in Japanese society.<br/>\n<br/>\n(One of Makiguchi&#39;s proteges, it turns out, went on to establish a <br/>\nBuddhist-offshoot organization called Soka Gakkai, based on the <br/>\n&quot;value-creating&quot; ethics philosophy of Makiguchi during his early years as <br/>\nan educator. In the five decades since the end of World War II, Soka <br/>\nGakkai has grown into a somewhat controversial organization, wielding <br/>\nconsiderable religious, political and economic influence in Japan. But <br/>\nthat is another story for another time.)<br/>\n<br/>\nMakiguchi predicted way back in the early 1900s that schoolteachers who <br/>\nstuck to the crazy notion of cramming blocks of unrelated &quot;knowledge&quot; <br/>\ninto their students&#39; heads would someday be in danger of losing their <br/>\njobs. This has come to be, although for slightly different reasons, <br/>\nperhaps, than Makiguchi foresaw. As it turns out, Japan&#39;s growing ranks <br/>\nof &quot;school-refusing teachers&quot; in these modern times do indeed hold a <br/>\ntenuous grip on their jobs -- and their sanity too.<br/>\n<br/>\nIn these days of educational crisis the world over, the beliefs and <br/>\npractices of people like Tsunesaburo Makiguchi serve to remind all of us <br/>\nparents, children and teachers once again that the idea of natural, <br/>\ninterconnected, lifelong learning is a universal one -- a human one, in <br/>\nwhich we all have a place. May this idea continue to take root and bloom <br/>\nin the years to come.<br/>\n<br/>\nWe are sending this edition of KnoK NEWS to you in two parts (sorry about <br/>\nthe length!). Feel free, as always, to pass this around and share it with <br/>\nothers.<br/>\n<br/>\nEnjoy,<br/>\n<br/>\nBrian Covert<br/>\nOsaka, Japan<br/>\n<br/>\n<br/>\n                              *   *   *   *<br/>\n<br/>\n<br/>\n<br/>\n                  ON THE WEB WITH JAPANESE HOMELEARNERS<br/>\n <br/>\n--Here we introduce yet another new homelearning-related website in Japan:<br/>\n<br/>\nSATO-KUN-CHI NO HOME SCHOOL<br/>\n[lit.: &quot;Home School of Young Mr. Sato&#39;s Family&quot;]<br/>\n--&gt;  http://www3.ocn.ne.jp/~satokun/<br/>\nWebsite of the Sato family of Niigata Prefecture, northern Japan, and the <br/>\nhomelearning adventures of their 10-year-old son. Includes sections on <br/>\ndaily homelearning activities, recommendations on books to read, and a <br/>\ndiary of the many places young Mr. Sato has visited. The whole site is in <br/>\nJapanese, but don&#39;t let that deter you if you don&#39;t have the software or <br/>\naren&#39;t familiar with the language: There are plenty of great photos of <br/>\nthe young Sato&#39;s favorite hobbies -- raising Japanese *medaka* <br/>\n(killifish) and growing his own vegetables. Check it out!<br/>\n<br/>\n<br/>\n<br/>\n                               *   *   *   *<br/>\n<br/>\n<br/>\n<br/>\n                            SAVING OUR CHILDREN:<br/>\n                            A JAPANESE APPROACH<br/>\n<br/>\n<br/>\n                              by Dayle Bethel<br/>\n<br/>\n<br/>\n<br/>\n&quot;[I]t is astounding to realize how quick are most people, and teachers in <br/>\nparticular, to neglect the marvelous and valuable lessons all around us <br/>\nin the natural world and in our home communities and just stick to books, <br/>\nusing all their energy in memorizing, forgetting what they have read, so <br/>\nstarting to read again, forgetting, reading, forgetting, reading...and on <br/>\nand on.&quot;<br/>\n<br/>\n--Tsunesaburo Makiguchi, 1903\t<br/>\n<br/>\n  <br/>\n<br/>\nAn educational revolution is underway in the world. This revolution is <br/>\nbeginning to liberate thousands of children and young people in many <br/>\ndifferent countries from the oppressive, personality-stifling tyranny and <br/>\nmind-numbing boredom of industrial capitalism&#39;s factory schools.<br/>\n<br/>\nThe fascinating thing to note about this revolution is that it is <br/>\nemerging in country after country spontaneously, without any one source <br/>\nof leadership, without planning, without design, and largely without <br/>\nnotice by the general public. Spurred by rapidly growing homeschooling <br/>\nmovements, alternative schools and other self-learning initiatives, this <br/>\nrevolution in education is a microcosm of the larger progressive, <br/>\nalternative and transformational movements that are emerging worldwide.<br/>\n<br/>\nThe roots of the presently accelerating revolution in education can be <br/>\ntraced back to a long line of dissident educators, most important of <br/>\nwhom, for our purposes, are several who lived and worked during the first <br/>\nhalf of the 20th century, particularly John Dewey, Lewis Mumford, Mahatma <br/>\nGandhi, Rudolf Steiner and Maria Montessori. In a very real sense, <br/>\ntoday&#39;s educational revolutionaries stand on the shoulders of these early <br/>\n20th-century philosopher/educator/practitioners. <br/>\n<br/>\nIn this article, I would like to discuss the contribution of another of <br/>\nthese 20th-century revolutionary educators who is much less well-known. I <br/>\nrefer to Tsunesaburo Makiguchi (1871-1944), a Japanese <br/>\neducator/geographer who lived and worked in Japan during the first four <br/>\ndecades of the 20th century. During the last quarter of the century, <br/>\nMakiguchi&#39;s ideas, educational proposals and practical experiments have <br/>\njoined with the rich legacy of Dewey, Gandhi and others to become a part <br/>\nof a swelling global stream of revolutionary ideas and practices in human <br/>\nlearning that is helping to transform educational systems in nearly every <br/>\ncountry in the world. <br/>\n<br/>\nMakiguchi&#39;s writings provide a unique perception of industrial society <br/>\nfrom the viewpoint of one who lived and worked in Japan during the early <br/>\nyears of the 20th century. Makiguchi placed great hope in modernization. <br/>\nHe shared the high expectations of industrialism and the potential <br/>\nabundance it promised, which was prevalent throughout much of the world <br/>\nat that time. However, like his fellow dissident educators in other <br/>\ncultures around the world, Makiguchi foresaw the dangers and tragic <br/>\nconsequences of the social and educational policies taking shape in <br/>\nindustrial societies.<br/>\n<br/>\nHe warned against tendencies he observed developing in Japan: reckless <br/>\ndisregard for the environment, the sacrifice of traditional values in <br/>\npursuit of profits, and the isolating of children and young people day <br/>\nafter day in schools -- severing their ties with the natural environment <br/>\nas well as with their families and communities and forcing them to learn <br/>\nmasses of fragmented, unrelated facts. It was this development in Japan <br/>\nof the American system of factory schools which especially concerned him. <br/>\n<br/>\nMakiguchi feared that the ultimate outcome of these imported values and <br/>\npolicies would be disastrous for Japan, and he worked tirelessly during <br/>\nthe first four decades of the century, both through education and through <br/>\nhis writing, in formulating and promoting what he believed was a more <br/>\nconstructive and sustainable approach to industrial development. The key <br/>\nelement in creating such a society would be, he believed, the developing <br/>\nof what he called a &quot;value-creating&quot; educational system based on <br/>\nscientific principles of human learning and oriented to local communities <br/>\nand their immediate environments. <br/>\n<br/>\n<br/>\n                         (continued in part 2)</div>","specialLinks":[]}],"prevTopicId":21723,"nextTopicId":21724}}