{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":177721839,"authorName":"Angela","from":"&quot;Angela&quot; &lt;game-enthusiast@...&gt;","profile":"autonomousangela","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Fun in Violence","postDate":"1080052280","msgId":92218,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwMzIzMTQzMTE2LkNZSEgxNDM4Lm10YTExLmFkZWxwaGlhLm5ldEBsZWlnaD4=","inReplyToHeader":"PElORU5MQU5QUENKSEFJUE9NRklPRUVKQUNFQUEua3Jpc3VsYW1AdmVyaXpvbi5uZXQ+"},"prevInTopic":92205,"nextInTopic":0,"prevInTime":92217,"nextInTime":92219,"topicId":92205,"numMessagesInTopic":0,"msgSnippet":"Hi Everyone, When my girls were really little (say 3 and 5) they brought their dollies to the library one day and one of them spanked the doll and told her she","messageBody":"<div id=\"ygrps-yiv-1007960972\">Hi Everyone, <br/>\n <br/>\n <br/>\nWhen my girls were really little (say 3 and 5) they brought their dollies to<br/>\nthe library one day and one of them spanked the doll and told her she was<br/>\nbad.  I almost died because back before I had children, if I had seen that<br/>\nbehavior, I would have assumed they were mimicking what they had learned at<br/>\nhome.  Well, they certainly didn&#39;t get that from me and I was horrified to<br/>\nthink that someone might think that.  Well, now I don&#39;t worry so much about<br/>\nwhat other people think unless it is a friend and something the girls do<br/>\nmakes them feel uncomfortable.  That is the case concerning the following<br/>\nbehaviors that I would like some insight on.<br/>\n <br/>\n My sweet little girls (ages 7 and 9) have a bit of an off sense of humor.<br/>\n(ok, a lot of an off sense of humor! LOL!)  For instance, when we first got<br/>\nthe Sims games, while playing, a Sim accidentally caught on fire while it<br/>\nwas cooking and it died.  They thought it was a riot that the grim reaper<br/>\ncame and from that point on they purposely caught their sims on fire.  (made<br/>\nsure they had No cooking skill points so the fires would happen.)  They<br/>\nthought it was a riot and anything like this just cracks them up.  Of<br/>\ncourse, they shared this information with their friend who is 9 and she<br/>\nthought it was hilarious too and she started doing the same thing.  I have<br/>\ncommented to the girls, as they burn their Sims, that &quot;that is just awful.&quot;<br/>\n(image running through my head of children growing up lacking empathy for<br/>\nothers and other horrible thoughts.)  It does make me feel bad that they<br/>\nthink it&#39;s fun to torture their computer people but I figure that is my<br/>\nissue so after several comments to the effect that I thought it was awful, I<br/>\nstopped commenting on it and really let it go.  I know they like to get a<br/>\nrise out of me and that is part of the fun of doing these things but I don&#39;t<br/>\nthink that is their driving force..they just truly think it is funny.<br/>\n <br/>\nAlong the same lines, they have these beanie babies that they love and play<br/>\nwith *every* day. (and have for three years)  But they think it is really<br/>\nfunny to do torturous things to them.  When I am brushing their hair, if I<br/>\nsnag a not, they punch Pellet (the beanie)  and laugh.  And when they are<br/>\nplaying with their friend they make their Pellets do things that are against<br/>\nsocieties expectations (like steal or kill) and then they punch them or beat<br/>\nthem and tell them they are bad.  Both of the girls and their friend think<br/>\nthis is *so* funny.  It does make me squirm inside sometimes but I just bite<br/>\nmy tongue and find something else to do other than focus on it because they<br/>\nare really sweet girls and I know they would never even cut in line, let<br/>\nalone hurt someone.  <br/>\n <br/>\nMy friend has told me that she feels uncomfortable with this type of play.<br/>\nShe asked me to help her come to grips with it as she realizes the reason<br/>\nshe feels uncomfortable are her issues.  I really don&#39;t know what to tell<br/>\nher since it really makes me uncomfortable too.  My kids have re-assured me<br/>\nthat they would never do that to someone in real life and that Pellet isn&#39;t<br/>\nreal and the Sims aren&#39;t real.  And they would never even do it to the<br/>\nstuffed animals that they take comfort in and cuddle.  <br/>\n <br/>\nMy girls are generally seen by outsiders as quiet, shy girls.  They adore<br/>\nanimals and we have many pets. They are gentle with all animals and<br/>\nchildren.   They do like getting a rise or a laugh out of  people they are<br/>\ncomfortable with and that is part of the reason they do what they do.  (Can<br/>\nwe shock Auntie? Or can we make Suzie laugh?)  I talk to my girls about<br/>\nEVERYTHING and we don&#39;t have any hard fast rules at our house.  They do<br/>\nrespect what I say and if I sat them down and told them that it really made<br/>\nmy friend uncomfortable, I am sure they would try and stop doing it. (even<br/>\nthough they might not understand her concern)  BUT, they really have a lot<br/>\nof fun doing these things and I hate to be a the poop in the punch bowl when<br/>\nthey are just having fun and it really isn&#39;t hurting anyone. At the same<br/>\ntime, I adore my friend and I want her to be comfortable hanging out with<br/>\nus.  So, do you have any advice I can share with my friend to help her<br/>\nthrough these feelings or do you feel that I should talk to the girls about<br/>\nhow it is making my friend uncomfortable? <br/>\n <br/>\n <br/>\n <br/>\nAngela <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:game-enthusiast@...\">game-enthusiast@...</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154422553,"authorName":"Krisula Moyer","from":"&quot;Krisula Moyer&quot; &lt;krisulam@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE:re:son has the blahs","postDate":"1080023396","msgId":92205,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PElORU5MQU5QUENKSEFJUE9NRklPRUVKQUNFQUEua3Jpc3VsYW1AdmVyaXpvbi5uZXQ+","inReplyToHeader":"PDEwNzk5ODcyMzMuODA4OS4zMzU4OC5tN0B5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":92218,"prevInTime":92204,"nextInTime":92206,"topicId":92205,"numMessagesInTopic":0,"msgSnippet":"Thank you guys for the wonderful suggestions.  Pam, I m going to print yours out so I can try some of these ideas as we go.  I m excited thinking about it.  To","messageBody":"<div id=\"ygrps-yiv-105764720\">Thank you guys for the wonderful suggestions.  Pam, I&#39;m going to print yours<br/>\nout so I can try some of these ideas as we go.  I&#39;m excited thinking about<br/>\nit.  To answer Betsy - He has unschooled for the last (almost) 3 years and<br/>\nis just in a slump or really it&#39;s more of a social growth spurt really that<br/>\nour lives and schedules haven&#39;t caught up to.  Pam&#39;s post makes me think of<br/>\nthe problem differently.  I think I had it upside down.  He does crave more<br/>\nsocial interaction but he&#39;s very choosy about what sort.  So I will try to<br/>\nengage his friends in some activities they might all enjoy and let you know<br/>\nwhat happens.</div>","specialLinks":[]}],"prevTopicId":92211,"nextTopicId":92056}}