{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":180234378,"authorName":"Sylvia Toyama","from":"Sylvia Toyama &lt;sylgt04@...&gt;","profile":"sylgt04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] question about &quot;presentation&quot; of issues","postDate":"1137998168","msgId":111374,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwMTIzMDYzNjA4Ljg0NjgzLnFtYWlsQHdlYjUzODAxLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDhDN0VEQTZCNDhENjAyNS0xRjI0LTEyM0VEQG1ibGtuLW0xMS5zeXNvcHMuYW9sLmNvbT4="},"prevInTopic":111362,"nextInTopic":0,"prevInTime":111373,"nextInTime":111375,"topicId":111358,"numMessagesInTopic":0,"msgSnippet":"Since eliminating contact with these family members is not possible, does anyone have any suggestions on how I can minimize the effects of these lectures on","messageBody":"<div id=\"ygrps-yiv-1306379249\">Since eliminating contact with these family members is not possible, does anyone have any suggestions on how I can minimize the effects of these &quot;lectures&quot; on the boys?<br/>\n   <br/>\n  *****<br/>\n  As someone who has cut off all contact with members of my own extended family, I would encourage you to consider whether or not you really can cut them off.  If you decide you can&#39;t do that, here&#39;s what I did with my Dad (I was tempted to cut him off, but offered him a choice first).  On a visit to my home (he&#39;d driven 2,000 miles) he launched into some political rant, in front of my then 4yo.  I told him to stop, that his opinions weren&#39;t welcome.  He replied by saying he didn&#39;t know I &#39;felt this way&#39; he&#39;d never heard me talk this way before.  I explained that when I was a girl, living in his home, I didn&#39;t argue because it was his home and not worth the fight.  Now it was my home, and my child and I will decide what behaviors/words will be welcome around my child in our home.  Further, if he couldn&#39;t get his act together and do as I wished, he wouldn&#39;t be invited to be part of my son&#39;s life, whether in our home or anywhere else.  Surprisingly, his behavior improved considerably.<br/>\n He doesn&#39;t argue politics or anything else with me, anywhere.  It&#39;s rare he even brings it up at all.  Of course, you have to be willing to play the grandchildren card, and ready to back it up if pushed.  <br/>\n   <br/>\n  Sylvia<br/>\n<br/>\n\t\t<br/>\n---------------------------------<br/>\nYahoo! Photos  Showcase holiday pictures in hardcover<br/>\n Photo Books. You design it and well bind it!<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] question about &quot;presentation&quot; of issues","postDate":"1137967284","msgId":111362,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ4ODAyNjYxLUQ0MzEtNENBOS04OTZCLTQzQ0RFRDFGMjY1NEBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDhDN0VEQTZCNDhENjAyNS0xRjI0LTEyM0VEQG1ibGtuLW0xMS5zeXNvcHMuYW9sLmNvbT4=","referencesHeader":"PDhDN0VEQTZCNDhENjAyNS0xRjI0LTEyM0VEQG1ibGtuLW0xMS5zeXNvcHMuYW9sLmNvbT4="},"prevInTopic":111358,"nextInTopic":111374,"prevInTime":111361,"nextInTime":111363,"topicId":111358,"numMessagesInTopic":0,"msgSnippet":"... As I was reading your post, I had a great idea.  I don t know if you have the...   personality to pull it off (I don t know the family dynamics) but maybe","messageBody":"<div id=\"ygrps-yiv-797870942\">On Jan 22, 2006, at 1:08 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:leobellalace@...\">leobellalace@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; -=-My boys are fairly young (8, 3, 1) so understanding the  <br/>\n&gt; difference between belief and proven fact is difficult for them as  <br/>\n&gt; yet.-=-<br/>\n<br/>\n<br/>\n </span></blockquote>As I was reading your post, I had a great idea.  I don&#39;t know if you  <br/>\nhave the...   personality to pull it off (I don&#39;t know the family  <br/>\ndynamics) but maybe you could make a form letter.  Use it as often as  <br/>\nyou need, changing one phrase in each paragraph as the situation  <br/>\nrequires, and at the bottom clearly indicate that you&#39;ve saved a copy  <br/>\nand put the date on it.   It could say something like:<br/>\n<br/>\nDear ____________   (and I would do it on the computer instead of a  <br/>\nreal fill-in-the-blanks; add these things in in a Word file):<br/>\n<br/>\n<br/>\nBecause we are intent on helping our children learn to think  <br/>\nlogically, rationally and critically, I hope you will refrain in the  <br/>\nfuture from telling them that [the earth is flat, or queers will burn  <br/>\nin hell, or Black people are afraid of dogs, or whatever it was that  <br/>\ntime].    If you would like for me to discuss that topic with them,  <br/>\nplease send me your research/documentation and I&#39;ll share that with  <br/>\nthem.<br/>\n<br/>\nThanks for [taking them to lunch, having them over, whatever good  <br/>\nthing you can say].<br/>\n<br/>\nSincerely,<br/>\n<br/>\nYou<br/>\n<br/>\ncc:  files/homeschooling<br/>\n<br/>\n=====================<br/>\n<br/>\nPerhaps in such cases as &quot;dating anyone of a different race or the  <br/>\nsame gender &quot;should be killed where they stand&quot;&quot;  you could quote the  <br/>\nphrase your child repeats and say &quot;Perhaps Bobby misunderstood you,  <br/>\nbut he thought you said lesbians should be killed where they stand,  <br/>\nand I&#39;m sure you wouldn&#39;t have said anything so ignorant and violent  <br/>\nto  my son.&quot;<br/>\n<br/>\nAnd as the years go by, your collection of letters (IN WRITING, at  <br/>\ntheir house and at yours, and they can share them around among the  <br/>\nother relatives all they want, to YOUR advantage) would be a very  <br/>\neducational souvenir for your kids, as they get older.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":163488104,"authorName":"leobellalace@netscape.net","from":"leobellalace@...","profile":"leobellalace","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"question about &quot;presentation&quot; of issues","postDate":"1137960491","msgId":111358,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDN0VEQTZCNDhENjAyNS0xRjI0LTEyM0VEQG1ibGtuLW0xMS5zeXNvcHMuYW9sLmNvbT4="},"prevInTopic":0,"nextInTopic":111362,"prevInTime":111357,"nextInTime":111359,"topicId":111358,"numMessagesInTopic":0,"msgSnippet":"I am having a *very* big problem with people (mostly relatives) presenting personal beliefs as complete fact and calling anyone who disagrees (including me)","messageBody":"<div id=\"ygrps-yiv-1998671433\">I am having a *very* big problem with people (mostly relatives) presenting personal beliefs as complete fact and calling anyone who disagrees (including me) stupid and (literally!!) hellbound.  My boys are fairly young (8, 3, 1) so understanding the difference between belief and proven fact is difficult for them as yet.<br/>\n <br/>\nThis is **not** simply a difference in religious beliefs - it goes MUCH further than that.  I strongly feel that tolerance to differences is one of the most important things the boys need to understand, but with such strongly presented oppositional views, it seems like the kids are struggling with what is &quot;true&quot; and what is &quot;not&quot;.<br/>\n <br/>\nFor instance, one side of the family is extremely prejudiced against anyone different, be it religion, political view, sexual orientation, race, personal appearance, education, attitude toward money, moral/value systems, even attitudes toward pets.  Some of the &quot;gems&quot; the boys have come to me in confusion include:  certain races &quot;are all terrifed of dogs&quot;; anyone not of their religious belief is going to hell; dating anyone of a different race or the same gender &quot;should be killed where they stand&quot;; (most) jobs/life responsibilities are strictly spread among girl/boy lines and are never to be crossed, etc.  My decision to pull my oldest out of school really raised hackles, but since he isn&#39;t blood-related to them, they can&#39;t force the issue, other than in attitudes/words, etc.<br/>\n <br/>\nSince eliminating contact with these family members is not possible, does anyone have any suggestions on how I can minimize the effects of these &quot;lectures&quot; on the boys?  I don&#39;t have a problem with presenting information, I have a problem with the way it is being presented, as if there is no other approach to anything.  I can negate the more offensive subjects simply by discussing them (with my oldest, anyway - the little ones don&#39;t really seem to get the lectures too much yet) but it is upsetting when he comes home from a visit and is spouting something I&#39;d expect from a white-supremacy group.<br/>\n___________________________________________________<br/>\nTry the New Netscape Mail Today!<br/>\nVirtually Spam-Free | More Storage | Import Your Contact List<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.netscape.com\">http://mail.netscape.com</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":111346,"nextTopicId":111200}}