{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":55326806,"authorName":"rumpleteasermom","from":"&quot;rumpleteasermom&quot; &lt;rumpleteasermom@...&gt;","profile":"rumpleteasermom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Anyone have an opinion about this?","postDate":"1009912769","msgId":30537,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGEwdDI0MStnZHNsQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":30536,"nextInTime":30538,"topicId":30537,"numMessagesInTopic":0,"msgSnippet":"http://www.ohio.com/bj/editorial_pages/docs_editorial/024453.htm Once upon a grim reality . . . BY MAUREEN DOWD New York Times columnist NEW YORK: When I was","messageBody":"<div id=\"ygrps-yiv-1778658902\"><a rel=\"nofollow\" target=\"_blank\" href=\"http://www.ohio.com/bj/editorial_pages/docs_editorial/024453.htm\">http://www.ohio.com/bj/editorial_pages/docs_editorial/024453.htm</a><br/>\n<br/>\nOnce upon a grim reality . . .<br/>\nBY MAUREEN DOWD <br/>\nNew York Times columnist <br/>\n<br/>\nNEW YORK: When I was little, I was a Grimms girl. Not a Hans <br/>\nChristian Andersen girl. I much preferred the more grisly Grimms&#39; <br/>\nfairy tales, where people got hands chopped off and hearts and <br/>\ntongues cut out, to the sunnier ones by the Dane.<br/>\n<br/>\nThe nuns made us climb under our desks for air-raid drills, and cried <br/>\nand sent us home early the day JFK was shot. We knew the world wasn&#39;t <br/>\na big ice-skating rink.<br/>\n<br/>\nSo I can appreciate the surprise popularity, ballooning since Sept. <br/>\n11, of Lemony Snicket&#39;s epic saga about the wretched Baudelaire <br/>\norphans, whose cascading woes make Oliver Twist seem blessed.<br/>\n<br/>\nAfter 9-11, the great chatterers predicted that adults would want to <br/>\nescape with light romantic movies. But instead, rentals of blow-&#39;em-<br/>\nup and terrorism movies spiked. Just so, many kids seem in the mood <br/>\nfor something a bit darker.<br/>\n<br/>\nThe very first thing that happens to the Baudelaires is that a family <br/>\nfriend, Mr. Poe, comes down to the beach to tell them their parents <br/>\nhave perished in a fire, and their mansion is destroyed. Everything <br/>\nto come, the narrator cautions, is ``rife with misfortune, misery, <br/>\nand despair.&#39;&#39;<br/>\n<br/>\nOn the New York Times&#39; best-seller list for children on Sept. 30, <br/>\nreflecting sales the week of the terrorist attacks, the new Lemony <br/>\nSnicket, The Hostile Hospital, trumped Harry Potter at No. 1, with <br/>\nfour Snickets matching four Potters in the top 10.<br/>\n<br/>\nThe man behind the sour nom de plume, Daniel Handler, has been <br/>\npopping up in the Times, the Washington Post, NPR and ABC explaining <br/>\nhow the real terrible can be soothed by the pretend terrible.<br/>\n<br/>\nHis eight-book series, dubbed A Series of Unfortunate Events, plays <br/>\nout in places like Lousy Lane and Grim River and features such <br/>\ncharacters as the Quagmires, who also lost their parents in a <br/>\nterrible fire.<br/>\n<br/>\nThe tone is a combination of mock-Victorian and modern-day mocking. <br/>\nConsider this observation from The Reptile Room: ``When somebody is a <br/>\nlittle bit wrong -- say, when a waiter puts nonfat milk in your <br/>\nespresso macchiato, instead of lowfat milk -- it is often quite easy <br/>\nto explain to them how and why they are wrong.&#39;&#39;<br/>\n<br/>\n``The books are definitely popular,&#39;&#39; says Clarissa Cooke, a <br/>\nlibrarian at the 67th Street branch of the New York Public Library. <br/>\n``They&#39;re like Edward Gorey for children.&#39;&#39;<br/>\n<br/>\nHandler was asked by Terry Gross on NPR to list some of the ordeals <br/>\nthat befall the Baudelaire siblings. ``They meet Count Olaf, who is a <br/>\ndistant relative, who is only after the fortune that their parents <br/>\nhave left behind,&#39;&#39; he rattled off. ``They go to stay with their <br/>\nkindly Uncle Monty who&#39;s murdered. They go to stay with their Aunt <br/>\nJosephine, who throws herself out of a window or at least so it <br/>\nappears. They&#39;re forced to work in a lumber mill. . . . They stay <br/>\nwith rich people and find themselves falling down an elevator shaft. <br/>\nThey&#39;re driven out of town by an angry mob, you know, with torches <br/>\nand barking dogs. And then in the most recent volume, they find <br/>\nthemselves prepared for unnecessary surgery in the hospital.&#39;&#39;<br/>\n<br/>\nHandler wrote in the Times that children had been sending him letters <br/>\nasking whether Count Olaf was a terrorist or the children had been <br/>\nnear the World Trade Center.<br/>\n<br/>\nIn The Uses of Enchantment, Bruno Bettelheim wrote that gruesome <br/>\nfairy tales helped children develop by teaching them to ``meet <br/>\ndanger, do battle.&#39;&#39; Alison Lurie, the author and Cornell professor <br/>\nof children&#39;s literature, has a similar theory. ``Children know the <br/>\nworld is not an absolutely safe place,&#39;&#39; she said, speaking from her <br/>\nIthaca, N.Y., home. ``If they&#39;re living in an affluent society and <br/>\ntheir parents try to protect them from everything, they sense this <br/>\nisn&#39;t the way the world really is. So books that admit bad things <br/>\nhappen are very restful to them, and seem more real.<br/>\n<br/>\n``What do we do about Sept. 11? Are we going to pretend it never <br/>\nhappened, tell kids to forget about that, it didn&#39;t count? They know <br/>\nthat&#39;s a lie. It&#39;s better to have books that admit the world has <br/>\ndangers and at the same time reassure kids, if they stick together <br/>\nthey can survive.&#39;&#39;<br/>\n<br/>\nWhen last spied, the Baudelaires were locked in the villain&#39;s trunk. <br/>\n``Count Olaf&#39;s trunk would have to do,&#39;&#39; the children told <br/>\nthemselves, ``until something better came along.&#39;&#39;<br/>\n<br/>\nThe triumph of hope over experience. A valuable lesson at any age.<br/>\nDowd is a New York Times columnist.<br/>\n<br/>\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~<br/>\nBridget</div>","specialLinks":[]}],"prevTopicId":30531,"nextTopicId":28032}}