{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":73238415,"authorName":"Julie Stauffer","from":"&quot;Julie Stauffer&quot; &lt;jnjstau@...&gt;","profile":"jnjstau","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"What a difference a docent makes!!","postDate":"1022520089","msgId":37530,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMGIwMWMyMDVhMiRmOWEyNGY4MCQ1YzgwZWU0MEBkZWZhdWx0Pg==","referencesHeader":"PDEwMjI1MDc5NTYuMzAwLjU5NzE2Lm0xMkB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":37529,"nextInTime":37531,"topicId":37530,"numMessagesInTopic":0,"msgSnippet":"Yesterday, kind of spur of the moment, we decided to go for a family outing to some Texas History sites to which we had never been.  Dh, me and 5 kids (11, 8,","messageBody":"<div id=\"ygrps-yiv-1795370676\">Yesterday, kind of spur of the moment, we decided to go for a family outing<br/>\nto some Texas History sites to which we had never been.  Dh, me and 5 kids<br/>\n(11, 8, 5, 3 and 2) took off.<br/>\n<br/>\nFirst place we went was a living history center with lots of old cabins,<br/>\netc..  We were pretty much the only ones there.  Initially, the kids balked<br/>\nbut as we went, unguided from building to building, the kids able to walk<br/>\ninside the cabins and see how they were used, climb the stairs to see in the<br/>\nsleeping loft, etc., the excitement began to build with the kids running<br/>\n(not in an obnoxious, unruly way, but in a joyful &quot;isn&#39;t this fun&quot; way) from<br/>\nbuilding to building, pointing out interesting items, talking about how they<br/>\nwere used, making connections to things they had seen before. As we were<br/>\nleaving we stopped in the little shop and the old lady docent talked with us<br/>\nand the kids about the museum, where she was raised, demonstrations they put<br/>\non, etc.,  Kids rated the place as &quot;cool&quot;.<br/>\n<br/>\nSecond place we stopped was a small museum with everything behind glass.<br/>\nAgain, we were pretty much the only ones there.  The kids were having a good<br/>\ntime looking at the different things, making comments or asking questions.<br/>\nThe 3yo pointed to an antique toy and asked if we could buy it.  This<br/>\napparently sent the docent off her rocker.  She came running across to the<br/>\nkids, calling for them to stop what they were doing and proceeded to lecture<br/>\nthem that museums were places for LEARNING, they needed to focus on LEARNING<br/>\nwhile they were there.  We kind of rounded up the kids and went outside to a<br/>\nlarge wall-like monument with metal ramps and stairs going around to the<br/>\nbackside.  The little guys took off running to see what was behind the<br/>\nmonument.  Again, here comes the docent yelling she doesn&#39;t allow people<br/>\nback there so I round the kids up explaining it was against the rules to go<br/>\nback there.  Then the docent says they can go back there as long as they<br/>\nFOLLOW HER IN AN ORDERLY MANNER.  The kids are willing and begin to follow<br/>\nher.  The 3yo walks about 2 steps in front of the lady and she starts<br/>\nsnapping her fingers at him telling him to get behind her.....to go down<br/>\nsome cement steps in an amphitheater.  what a nut.  I had had it and the<br/>\nkids were looking at her like she was nuts....so we just left....with the<br/>\ndocent still hollering at us about how the kids have to LEARN about being in<br/>\nline at some point.<br/>\n<br/>\nLater we stopped at Dairy Queen for some icecream and we all teased each<br/>\nother to make sure we were LEARNING, not just enjoying ourselves.<br/>\n<br/>\nI hope the kids aren&#39;t permanently put off museums now  LOL.<br/>\n<br/>\nJulie</div>","specialLinks":[]}],"prevTopicId":37529,"nextTopicId":37538}}