{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":183249217,"authorName":"Traci Escher","from":"&quot;Traci Escher&quot; &lt;dtrjj@...&gt;","profile":"hestiashearth3","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Sleeping arrangments","postDate":"1138948100","msgId":24279,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRydXQ2NCtwOTk0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDlCNkJDQUYyLUIxNjgtNEJCQS04MTZELTlGMzRFQUI1NjgyQ0BzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":24273,"nextInTopic":0,"prevInTime":24278,"nextInTime":24280,"topicId":24268,"numMessagesInTopic":0,"msgSnippet":"My husband is a very light sleeper, he has also been the one who wakes up every morning at 5:00 am to go to work, so that I can stay home with our children. I","messageBody":"<div id=\"ygrps-yiv-208248802\">My husband is a very light sleeper, he has also been the one who <br/>\nwakes up every morning at 5:00 am to go to work, so that I can stay <br/>\nhome with our children. I have tried to keep that in mind when <br/>\nmaking our sleeping arrangements over the past 15 years. Mostly it <br/>\nhas involved me sleeping with the kids in a shared bed, then popping <br/>\nback to my bed for a snuggle with my husband, then back to the other <br/>\nroom when someone needed me.<br/>\n<br/>\nMy boys are now 15,13 and 10. I still lay down with my 10 year old, <br/>\nusually fall asleep, wake up, and tip toe to my own room between <br/>\n12:00 and 1:00 am. My husband would really love me to go to bed with <br/>\nhim at 10:00 however, that just doesn&#39;t fit RIGHT NOW. I know there <br/>\nwill be a time when I just tuck them in with a kiss and go to my own <br/>\nbed, you will too.<br/>\n<br/>\nI am sorry for the loss of your son. I hope you find a solution that <br/>\nworks for all of you.<br/>\n<br/>\nMany Blessings,<br/>\nTraci<br/>\nMom to Ryan-15 Jake-13 Justin-10</div>","specialLinks":[]},{"userId":177721839,"authorName":"Angela S.","from":"&quot;Angela S.&quot; &lt;game-enthusiast@...&gt;","profile":"autonomousangela","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] Sleeping arrangments","postDate":"1138925276","msgId":24273,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDYwMWM2Mjg1NSRlMzAxOTIyMCQ2NTAwYThjMEBlYm9ueT4=","inReplyToHeader":"PDlCNkJDQUYyLUIxNjgtNEJCQS04MTZELTlGMzRFQUI1NjgyQ0BzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":24270,"nextInTopic":24279,"prevInTime":24272,"nextInTime":24274,"topicId":24268,"numMessagesInTopic":0,"msgSnippet":"Like others have said, just think outside the box and find something that works for all of you. Our sleeping arrangements have gone back and forth over the","messageBody":"<div id=\"ygrps-yiv-1331170424\">Like others have said, just think outside the box and find something that<br/>\nworks for all of you. <br/>\n<br/>\nOur sleeping arrangements have gone back and forth over the years.  At times<br/>\nI&#39;ve slept in the kids&#39; beds.  At times they&#39;ve slept in mine.  At one<br/>\npoint, the kids shared a room and I lay with them while they went to sleep<br/>\nand snuck out at some point in the night to sleep in my own bed with dh.  <br/>\n<br/>\nMy 9 yo was sleeping alone for the past year but recently decided to move<br/>\nback into my room.  Dh travels a lot and when he is out of town she shares<br/>\nmy bed and when he is in town she either takes a spot on the floor or sleeps<br/>\nin her own room.  <br/>\n<br/>\nMy 11 yo, who always liked to sleep in her own room, but liked me to lay<br/>\nwith her while she went to sleep recently began taking forever to go to<br/>\nsleep and it was really frustrating me.  I&#39;d fall asleep and she&#39;d thrash<br/>\nabout and wake me so many times that eventually I couldn&#39;t sleep at all for<br/>\nthe rest of the night.  I finally told her I would stay for half an hour and<br/>\nif she wasn&#39;t asleep, then she could choose to sleep on my floor or stay in<br/>\nher own bed.  She chose my floor, so now we have 4 of us in the room at<br/>\ntimes when dh is home.<br/>\n<br/>\nHe actually doesn&#39;t seem to mind as long as we keep a path clear to his side<br/>\nof the bed so he doesn&#39;t kill himself on his way in late at night.<br/>\n<br/>\nI hope you find some way to keep all of you fairly happy. <br/>\n<br/>\nAngela<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:game-enthusiast@...\">game-enthusiast@...</a></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Sleeping arrangments","postDate":"1138898876","msgId":24270,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlCNkJDQUYyLUIxNjgtNEJCQS04MTZELTlGMzRFQUI1NjgyQ0BzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGRydDdpaCtyZTkwQGVHcm91cHMuY29tPg==","referencesHeader":"PGRydDdpaCtyZTkwQGVHcm91cHMuY29tPg=="},"prevInTopic":24268,"nextInTopic":24273,"prevInTime":24269,"nextInTime":24271,"topicId":24268,"numMessagesInTopic":0,"msgSnippet":"... Can you go to sleep with them in another room (not yours), even if you have to get another big bed?  And then when your husband gets home, get up and go to","messageBody":"<div id=\"ygrps-yiv-161340678\">On Feb 2, 2006, at 8:13 AM, Joanna Wilkinson wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m thinking I should just take a stand here.  Usually it blows<br/>\n&gt; over, sometimes I make a little effort but end up back to our usual,<br/>\n&gt; all going to sleep in my bed together, he accepts it&#39;s not happening<br/>\n&gt; and we continue to all sleep in the room.<br/>\n<br/>\n<br/>\n </span></blockquote>Can you go to sleep with them in another room (not yours), even if  <br/>\nyou have to get another big bed?  And then when your husband gets  <br/>\nhome, get up and go to bed with him?     Sleeping together doesn&#39;t  <br/>\nhave to be in your bed, and it doesn&#39;t have to be all night.<br/>\n<br/>\nIf your kids aren&#39;t really little, you could just simply say &quot;Dad&#39;s  <br/>\nnot having fun with everyone in the same bed anymore, so we need to  <br/>\ngive him more privacy.&quot;     Maybe you CAN take a stand, but take it  <br/>\nin his favor, and also still sleep with the kids a lot.<br/>\n<br/>\n-=-So am I being wrong or stubborn or lazy or a clingy mother here?-=-<br/>\n<br/>\nInflexible?  Not lazy.  Just seeing it as two choices:  all in your  <br/>\nbed, or them in individual beds.  Find another big-nest option  <br/>\nelsewhere.<br/>\n<br/>\n-=-Should I put his wants over ours? -=-<br/>\n<br/>\nNow that sounds bad.  Quite &quot;us&quot; against Him.<br/>\nOne of your wants should be finding a way for him to be happy,  <br/>\nright?  Isn&#39;t there an &quot;us&quot; that includes him?<br/>\n<br/>\nDid you throw that old king mattress out?  Maybe if the bed was worn  <br/>\nout, the mattress on a floor would still be okay.<br/>\nHolly uses the queen bed Keith and I had for a long time.  It&#39;s too  <br/>\nworn out for me and Keith, but she&#39;s small and light, and for her  <br/>\nalone it&#39;s plenty comfortable.  She likes that it&#39;s the bed in which  <br/>\nshe and Marty were conceived.  (Kirby&#39;s Day One involved a water bed  <br/>\nin Boulder, at a friend&#39;s house.)<br/>\n<br/>\nYou don&#39;t have to come up with One Big Plan either, but could go a  <br/>\nfew weeks sleeping in the den on futons, while you think about a  <br/>\nlonger-range plan, maybe.<br/>\n<br/>\nCostco has three-fold futons.  The current set has camouflage  <br/>\nmaterial on it.  There&#39;s a Japanese name for those but I forget it.   <br/>\nThey&#39;re not the little chair-looking things that fold out into a kid- <br/>\nbed.  They&#39;re adult size, and fold in thirds and will stack flat.   <br/>\nMaybe you could get three of those you could make into a wide yet  <br/>\ntemporary/moveable bed.  It wouldn&#39;t always have to be in the same room.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":244242275,"authorName":"Joanna Wilkinson","from":"&quot;Joanna Wilkinson&quot; &lt;jbwilkinson6@...&gt;","profile":"joanna514","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Sleeping arrangments","postDate":"1138893201","msgId":24268,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRydDdpaCtyZTkwQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":24270,"prevInTime":24267,"nextInTime":24269,"topicId":24268,"numMessagesInTopic":0,"msgSnippet":"Hi all I haven t posted here (or anywhere) in quite a while.  I need some perspective.  My kids have always slept in our room.  As babies it was something I","messageBody":"<div id=\"ygrps-yiv-637960825\">Hi all<br/>\nI haven&#39;t posted here (or anywhere) in quite a while.  I need some <br/>\nperspective.  My kids have always slept in our room.  As babies it <br/>\nwas something I insisted on, when I discovered the sleep benefits.  <br/>\nAs they grew older I tried getting them to sleep in their own rooms, <br/>\nwith the idea of &quot;that&#39;s how it&#39;s suppose to be&quot;, not because I <br/>\nminded them in our bed.  My dh has never been thrilled with the <br/>\nidea.  He accepted the babies, because he knew it really did help me <br/>\nget more rest, but as they grew, he always made comments of them <br/>\nsleeping in their own rooms.  The kids always fought the idea and <br/>\nalways ended up in our bed sometime in the night.  My dh didn&#39;t seem <br/>\nto mind that.  He wanted them to atleast start out in their own room <br/>\nthough( alone time for us was his idea)  It was always a huge <br/>\nstruggle.  Lots of time for me getting them into bed, lots of <br/>\ngetting out of bed, being scared and eventually they would be in our <br/>\nroom anyway at some point in the night.  3 years ago, our son died.  <br/>\nFrom that point on, we all slept in one room.  My now 15 yo stopped <br/>\nafter a couple of months (she had been sleeping in her own room <br/>\nwillingly from about the age of 10-11).<br/>\nMy now 9yo son and 6yo dd don&#39;t seem to have any desire to sleep in <br/>\ntheir own rooms. They would sleep in the same room if they did go <br/>\nupstairs, so it&#39;s not a matter of being completely alone.<br/>\nI have no desire for them to leave.  My dh isn&#39;t home at night <br/>\nusually 3 nights of the week til about 2 a.m.  In the summer it&#39;s 6 <br/>\nnights a week.  We just downsized to a queen(it was free and our <br/>\nking was really bad) and the kids sleep on cushions on the floor <br/>\nnext to the bed.  I thought this would make dh happier because he <br/>\natleast isn&#39;t crowded out of the bed anymore.  But it still is <br/>\nbothering him.  He usually doesn&#39;t make a big deal.  Just snide <br/>\ncomments here and there.  But every once in a while he has a fit <br/>\nabout it in front of the kids and is mad that I&#39;m not backing him <br/>\nup.  I remain calm and do see his side, but I also feel I &#39;m the one <br/>\nthat really has to make the effort and it seems futile anyway.  And <br/>\nit&#39;s not something I want to do.  He&#39;s not willing to really go <br/>\nthrough the process of putting them to be.  He thinks they should be <br/>\nsent to bed and stay there, like he did as a child (or atleast <br/>\nthat&#39;s what he wishes could happen).  That never worked in the past, <br/>\nbut he doesn&#39;t want to hear logic or opinions, he just wants it to <br/>\nbe easy and done.<br/>\nI&#39;m thinking I should just take a stand here.  Usually it blows <br/>\nover, sometimes I make a little effort but end up back to our usual, <br/>\nall going to sleep in my bed together, he accepts it&#39;s not happening <br/>\nand we continue to all sleep in the room.  <br/>\nI&#39;m thinking they will naturally want to sleep in their own rooms at <br/>\nsome point (like my oldest did)  My 9yo seems to want to, but gets <br/>\nscared being alone still.  My 6 yo has no desire.<br/>\nAlso, my oldest went to high school and goes to sleep earlier than <br/>\neveryone else.  The kids rooms are upstairs and they would keep her <br/>\nawake if they were up there.<br/>\nI make an effort for dh and I to have &quot;alone time&quot; at other times <br/>\nthan night.  Dh usually sleeps in late and we can have &quot;alone time&quot; <br/>\nmid morning while the kids are busy doing thier own things, so I <br/>\nreally don&#39;t think that should be an issue with him.  I&#39;m way to <br/>\ntired at night usually, anyway. (Especially if I&#39;ve just spent a lot <br/>\nof energy getting the kids in their own rooms.)<br/>\nSo am I being wrong or stubborn or lazy or a clingy mother here?<br/>\nShould I put his wants over ours?  How can I do that without being <br/>\nresentful.<br/>\nShould i ask him to accept this and realize it is temporary (though <br/>\nnot short term)<br/>\nI would really like to let the kids choose when they are ready.  I <br/>\nwould like them to feel completely welcome by both of us.<br/>\nI think I should really take a stand here, but wanted some <br/>\nperspective first.<br/>\nThanks<br/>\nJoanna</div>","specialLinks":[]}],"prevTopicId":24277,"nextTopicId":24258}}