{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":53685616,"authorName":"Bronwen","from":"&quot;Bronwen&quot; &lt;felesina@...&gt;","profile":"bronwen67","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [RUL] Digest Number 1931","postDate":"1066892927","msgId":83148,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMjYwMWMzOTkzNCQ5NTE0NzFjMCQ5NjhiNTE0MkBmZWxlc2luYT4=","referencesHeader":"PDEwNjY4ODQwMTEuMjE2NS4xMzczOS5tMTZAeWFob29ncm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":83147,"nextInTime":83149,"topicId":83148,"numMessagesInTopic":0,"msgSnippet":"-- Take Action -- Help Home-education in Holland -- -- Sample mails on http://www.thuisonderwijs.net/support-nl/#samplemail -- Background In The Netherlands","messageBody":"<div id=\"ygrps-yiv-110708366\">-- Take Action -- Help Home-education in Holland --<br/>\n-- Sample mails on <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.thuisonderwijs.net/support-nl/#samplemail\">http://www.thuisonderwijs.net/support-nl/#samplemail</a> --<br/>\n<br/>\nBackground<br/>\nIn The Netherlands home education as such is currently not a legal option.<br/>\nYou may try to get an exemption from school registration, but only for<br/>\ndeeply felt religious or philosophical reasons. These exemptions are<br/>\nrecognised with great reluctance, for your child is not considered to be<br/>\neducated effectively without school attendance. Once your child has attended<br/>\na school even this option is barred; taking a child from school as a result<br/>\nof a change of your opinion about life is in fact prohibited.<br/>\n<br/>\nNow only the parents of about a 100 children have been able to avoid this<br/>\ntrap to secure their freedom. Many more families would like to home-educate<br/>\ntheir kids but are not able to get their way without years filled with<br/>\ncourtcases and child protection investigations.<br/>\n<br/>\nSince some courtcases have been won rather unexpectedly by home-educators<br/>\nthis year, Maria van der Hoeven, the Dutch minister of Education wants to<br/>\nmake life even more difficult for them. Despite the fact that the current<br/>\nlaw does not consider home-education to be an effective option next to<br/>\nschooling, she wants to put us under tight educational supervision. The<br/>\nEducational Committee of the Second Chamber, the Dutch House of<br/>\nRepresentatives, will have a debate on her plan on October 30, at 10.00 AM.<br/>\nIt can be read in English on<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.thuisonderwijs.net/support-nl/notice-english.html\">http://www.thuisonderwijs.net/support-nl/notice-english.html</a><br/>\n<br/>\nSince only a 100 Dutch children are exempted from school registration, most<br/>\npoliticians do not consider this important. The debate has been postponed<br/>\ntwice already, and now it has even been put into a 1 hour shorter schedule<br/>\nthan before. But from the attention this small group has drawn in the past<br/>\nfew years, one might think that the potential interest in home-education is<br/>\nfar, far greater. Thousands of children are known to be damaged by their<br/>\nschool-attendance, many more children do not attend school for numerous<br/>\nreasons. Many of those would be helped out of if their parents would only be<br/>\nentitled to home-educate them.<br/>\n<br/>\nWe, a group of home-educating parents in the Netherlands, want<br/>\nhome-education to become a legal option, its effectivity recognised by the<br/>\nauthorities, and most of all we want parents to exercise a free choice for<br/>\nand with their children without unnecessary state interference.<br/>\n<br/>\nThat is why we ask for your input. We know some members of parliament<br/>\nsympathise with us, after having sent them tens of pages of arguments<br/>\nagainst the minister&#39;s view, but all this input has come from a small group<br/>\nof activists so far.<br/>\n<br/>\nSo, after having sent them lots of info about reseach and different<br/>\nlegislative possibilities we need a lot of your messages to reach the hearts<br/>\nof those MPs! Let them know that home-education has become an indication for<br/>\nrespect of human rights! Let them find out that home-education has grown to<br/>\na worldwide grass-roots movement of responsible families!<br/>\n<br/>\nReading English is no problem for most Dutch people, knowledge of French and<br/>\nGerman is also wide-spread here, so don&#39;t hesitate to express yourself in<br/>\nyour mother tongue. Perhaps you can include an English summary.<br/>\n<br/>\nSend mail<br/>\nYou can tell the Dutch legislators your own story and opinion using the URLs<br/>\nyou can find on <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.thuisonderwijs.net/support-nl/#samplemail\">http://www.thuisonderwijs.net/support-nl/#samplemail</a> . Or<br/>\nyou can answer one or more survey questions like these:<br/>\n<br/>\n    - How and why does home-education work for you?<br/>\n    - Is it a real and viable option in education? Why?<br/>\n    - Does it work for you family? How?<br/>\n    - Do you think a teaching certificate is necessary or useful for<br/>\nhome-educating parents?<br/>\n    - Do you consider routinely held inspections useful or necessary?<br/>\n    - What has been your own experience with inspections on your<br/>\nhome-education, if any?<br/>\n<br/>\nQuick Sample Mail<br/>\nIf you don&#39;t have the opportunity to write down your opinion in detail (we<br/>\nknow how busy home-educators always are!), then you can use our quick sample<br/>\nemail which includes the following text:<br/>\n<br/>\n    subject=Debate about home-education<br/>\n<br/>\n    Dear madam Minister, dear Committee members,<br/>\n<br/>\nThrough this message we want to express our concern with the way how<br/>\nhome-education has been misjudged in The Netherlands so far. We urge you to<br/>\ncorrect this judgement and to remove any obstacles in your law that still<br/>\nprevent parents from exercising their responsibilities freely, with or<br/>\nwithout the use of schools.<br/>\n<br/>\nAllowing home-education as such has become an indication of respect for<br/>\nhuman rights and fundamental freedoms of both parents and children, since<br/>\nits effectiveness has become clear beyond reasonable doubt. Please act in<br/>\naccordance with this understanding.<br/>\n<br/>\nSincerely,<br/>\nyour name and country<br/>\n<br/>\n<br/>\nEmail addresses<br/>\nMails should be sent at the same time to the Educational committee of the<br/>\nDutch parliament and to the Minister of Education. A CC goes to our mail<br/>\naction address, so that we can make a compilation of your messages and<br/>\npresent this to the Dutch press. Your efforts won&#39;t be lost! Click this to<br/>\nstart your mail:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:info@...\">info@...</a>;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:cie.ocw@...\">cie.ocw@...</a>?cc=<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:home-education@...\">home-education@...</a><br/>\n<br/>\nIf you want to keep your identity or e-mail address confidential, please<br/>\nsend your mail to<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:home-education@...\">home-education@...</a>?subject=support-nl-confidential, and we&#39;ll forward<br/>\nyour message without sensitive data.<br/>\n<br/>\nAny further questions or remarks? Mail us at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:home-education@...\">home-education@...</a>?subject=support-nl-question<br/>\n<br/>\nA thousand times thanks from the current and future home-educators in<br/>\nHolland!<br/>\n<br/>\nKind regards from the NVvTO, the Netherlands Association for Home-Education<br/>\n<br/>\nInformation and updates on this action can be found on<br/>\nwww.thuisonderwijs.net/support-nl/</div>","specialLinks":[]}],"prevTopicId":83108,"nextTopicId":83136}}