{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":173,"messages":[{"userId":67247159,"authorName":"Nanci K.","from":"&quot;Nanci K.&quot; &lt;aisliin@...&gt;","profile":"aisliin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Labels","postDate":"1136965683","msgId":23953,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRxMmQ3aitxN3UzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDI0NTkxRTE2LTExQzItNEE0OC1CMjlBLTUyQTM1OTVBODhEOUBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":23952,"nextInTopic":23954,"prevInTime":23952,"nextInTime":23954,"topicId":5062,"numMessagesInTopic":0,"msgSnippet":"... This confuses me.  Is it an analogy?  What is the contract we re referring to?  I thought she was referring to life and social interaction when she said we","messageBody":"<div id=\"ygrps-yiv-580371880\"><blockquote><span title=\"ireply\">&gt; One who never can figure out what the contract says should not be  <br/>\n&gt; signing contracts.<br/>\n<br/>\n </span></blockquote>This confuses me.  Is it an analogy?  What is the contract we&#39;re <br/>\nreferring to?  I thought she was referring to life and social <br/>\ninteraction when she said we were still trying to figure out what <br/>\nthe contract says.  By not entering into the contract, should we <br/>\nhave arranged not to have been born?  Or should we commit suicide?  <br/>\nI&#39;m not being flippant, really, I am confused and would like to <br/>\nunderstand what this means.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; MY EXAMPLES are adding to lack of understanding?<br/>\n&gt; MY EXAMPLES are adding to intolerance?<br/>\n<br/>\n </span></blockquote>I think she meant that your examples illustrate a common lack of <br/>\nunderstanding about autism.  I think.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If someone can&#39;t take analogies and see them as the parallels <br/>\n&gt;they  are intended to be rather than literal news, then that person <br/>\n </span></blockquote>won&#39;t be participating in a discussion  as fully as the discussion <br/>\n<blockquote><span title=\"ireply\"> &gt;deserves.<br/>\n<br/>\n </span></blockquote>That&#39;s true.  But unfortunately being much too literal is a common <br/>\nautistic failing.  I would like to continue this discussion later, <br/>\nbut I have to get to bed now.  I hope this is not considered too off <br/>\ntopic or contentious.  One of the reasons I think there is a lack of <br/>\nunderstanding about autism is that it&#39;s not alright to discuss it <br/>\nanywhere but among autism &quot;groups&quot; or similar forums, where they <br/>\nalready know what youknow and there isn&#39;t anyone there who isn&#39;t <br/>\nalready touched by it in their lives.  That doesn&#39;t help.  I would <br/>\nlike to think that discussing the different ways neurology can vary <br/>\nand lead to these different issues among how people percieve things <br/>\nand react to things and interact with each other is a topic that can <br/>\nbe looked at in a lot of ways and have positive repercussions on an <br/>\nunschooling journey and spin off into other topics.<br/>\n<br/>\nNanci K.</div>","specialLinks":[]},{"userId":67247159,"authorName":"Nanci K.","from":"&quot;Nanci K.&quot; &lt;aisliin@...&gt;","profile":"aisliin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Labels","postDate":"1136965178","msgId":23952,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRxMmNucSt1MXMwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDI0NTkxRTE2LTExQzItNEE0OC1CMjlBLTUyQTM1OTVBODhEOUBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":23951,"nextInTopic":23953,"prevInTime":23951,"nextInTime":23953,"topicId":5062,"numMessagesInTopic":0,"msgSnippet":"... If by structured learning situation she meant one structured by one s self or as an assist to your self process, than no, it is not possible to learn","messageBody":"<div id=\"ygrps-yiv-1406854814\"><blockquote><span title=\"ireply\">&gt;The principle<br/>\n&gt;of qualified statements being potentially true while absolute<br/>\n&gt;statements are more likely to be untrue is something that can be<br/>\n&gt;learned, demonstrated, discussed, and experimented with without a<br/>\n&gt;structured learning situation.<br/>\n&gt;Sandra<br/>\n<br/>\n </span></blockquote>If by &quot;structured learning situation&quot; she meant one structured by <br/>\none&#39;s self or as an assist to your self process, than no, it is not <br/>\npossible to learn those things without that structure if you are <br/>\nautistic, in my experience.  or at least it&#39;s really, really hard <br/>\nwithout the structure.  That&#39;s internally structured that I mean, not <br/>\nclassroom structured, not schoolish structure.  The structured <br/>\nenvironment of mailing lists are what taught me that very principle of <br/>\nwhich you speak, AND then helped me learn to recognize the difference <br/>\nbetween an &quot;absolute statement&quot; and what is a &quot;qualified statement.&quot;<br/>\n<br/>\nNanci K.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Labels","postDate":"1136964408","msgId":23951,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI0NTkxRTE2LTExQzItNEE0OC1CMjlBLTUyQTM1OTVBODhEOUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PFBLRUhKR0NJR05QUEFCRlBCS0xHSUVDSkFOQUIuamFja2lAYm9hcmRwcmVwLm5ldD4=","referencesHeader":"PFBLRUhKR0NJR05QUEFCRlBCS0xHSUVDSkFOQUIuamFja2lAYm9hcmRwcmVwLm5ldD4="},"prevInTopic":23950,"nextInTopic":23952,"prevInTime":23950,"nextInTime":23952,"topicId":5062,"numMessagesInTopic":0,"msgSnippet":"... =============== Only into safe and acceptable parts.  They probably shouldn t go into psychotherapy or grief counselling. Into society is a really big","messageBody":"<div id=\"ygrps-yiv-204991042\">On Jan 10, 2006, at 10:15 PM, Gold Standard wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Are you saying if you don&#39;t know how to communicate  <br/>\n&gt; &quot;appropriately&quot;, as in<br/>\n&gt; the way society has created thus far, you should not go into  <br/>\n&gt; society? That&#39;s<br/>\n&gt; what this analogy says to me.<br/>\n<br/>\n </span></blockquote>===============<br/>\n<br/>\nOnly into safe and acceptable parts.  They probably shouldn&#39;t go into  <br/>\npsychotherapy or grief counselling.<br/>\n<br/>\n&quot;Into society&quot; is a really big place, and there are parts that  <br/>\nrequire certain kinds of responses and skills, and few to no people  <br/>\nare welcome everywhere.  If we include single-sex toilets, then  <br/>\nnobody&#39;s welcome everywhere.<br/>\n<br/>\n-=-Again, this is apples and oranges Sandra. A person with a  <br/>\nneurological<br/>\ncondition is not doing something intentionally wrong, or breaking a<br/>\ncontract. In our situation, they are still figuring out what the damn<br/>\ncontract says!-=-<br/>\n<br/>\nOne who never can figure out what the contract says should not be  <br/>\nsigning contracts.<br/>\n<br/>\n-=-Your examples only add to the lack of understanding and the  <br/>\nintolerance of our society,<br/>\nimho.-=-<br/>\n<br/>\nMY EXAMPLES are adding to lack of understanding?<br/>\nMY EXAMPLES are adding to intolerance?<br/>\n<br/>\nIf people can&#39;t even look at what problems might look like, we can&#39;t  <br/>\ndiscuss labels.<br/>\nIf someone can&#39;t take analogies and see them as the parallels they  <br/>\nare intended to be rather than literal news, then that person won&#39;t  <br/>\nbe participating in a discussion  as fully as the discussion deserves.<br/>\n<br/>\n-=-Yes, we should all work toward treating each other well. AND yes some<br/>\npeople are way behind the curve in that area...(they are way ABOVE  <br/>\nthe curve<br/>\nin other areas though...and my guess is that because they are so  <br/>\nsmart in<br/>\ncertain isolated areas [think Mozart, Einstein], their social  <br/>\ndevelopment<br/>\nsuffers) but that is no excuse for US to not be understanding about  <br/>\nit.-=-<br/>\n<br/>\nNot every single person is way above the curve in some area.  This  <br/>\nsounds like rhetoric and platitude.<br/>\nWhere natural learning is concerned the curve isn&#39;t an issue.  Where  <br/>\nunschooling is concerned it doesn&#39;t matter if someone somewhere  <br/>\nconsiders a child to be gifted or better or worse than some other  <br/>\nchild or group of children.<br/>\nIt does not matter.<br/>\n<br/>\n-=-Talking in these generalities has little meaning to me.-=-<br/>\n<br/>\nThen when a post doesn&#39;t make sense, just let it flow by like water  <br/>\nunder a bridge.  Responding to something that makes no sense to you  <br/>\ndoesn&#39;t add to the discussion of ideas.<br/>\n<br/>\n-=-This is part of why a list that has lots of people with this kind of<br/>\nsituation in their homes IS helpful...not to give excuses for  <br/>\nbehavior or<br/>\npromote &quot;self-fulfilling prophecies&quot;, but to talk about our ACTUAL<br/>\nexperiences. Otherwise, it is often theory and assumptive and  <br/>\nguesswork. And<br/>\ncan be SO non-understanding and, well, offensive, as I have found  <br/>\nsome of<br/>\nthis post to be.-=-<br/>\n<br/>\nI was asked to explain why I made the statement that some use it as  <br/>\nan excuse and I explained.  Don&#39;t now complain that explanations were  <br/>\nmade and examples were given.<br/>\n<br/>\n-=-That said, I do think it is important to maintain an &quot;I can do  <br/>\nanything&quot;<br/>\nattitude no matter what &quot;condition&quot; one might have. That is a given  <br/>\nin my<br/>\nhouse.-=-<br/>\n<br/>\nRather than claim that one can do anything, I try to go with each  <br/>\nchild&#39;s interests, talents and abilities and help them do things they  <br/>\nreally find interesting and doable.    &quot;Anything&quot; creates a huge  <br/>\nfield of potential failure.  If a kid with bad eyesight wants to be a  <br/>\ntest pilot, parents will do him a disservice by saying &quot;you can do  <br/>\nanything.&quot;  He might like video game flight simulators; he might like  <br/>\nresearch on corrective eye surgery.  There are tons of related  <br/>\nthings.   A narrow goal creates more failure than a broad goal.<br/>\n<br/>\nThere is American mythology that says all men are created equal.   <br/>\nThat is not literally true.  It is poetically true.  It is, in  <br/>\ncontrast to the 18th century view of layers of society and classes of  <br/>\npeople, a radical and beautiful idea, but even those who wrote it  <br/>\nmeant all white male land-owners, not just every human who&#39;s born or  <br/>\nmoves to the U.S.<br/>\n<br/>\n-=-&gt;&gt;&quot;It seems<br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;to me&quot; or &quot;I feel that...&quot; is generally a better way to preface a<br/>\n &gt;&gt;statement&lt;&lt;<br/>\n<br/>\n </span></blockquote>-=-Yes a good suggestion that we&#39;ve figured out here. Softening the<br/>\nsentences...it is a structured learning thing. -=-<br/>\n<br/>\nWhy does it have to be &quot;a structured learning thing&quot;?  The principle  <br/>\nof qualified statements being potentially true while absolute  <br/>\nstatements are more likely to be untrue is something that can be  <br/>\nlearned, demonstrated, discussed, and experimented with without a  <br/>\nstructured learning situation.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":67247159,"authorName":"Nanci K.","from":"&quot;Nanci K.&quot; &lt;aisliin@...&gt;","profile":"aisliin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Labels","postDate":"1136963943","msgId":23950,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRxMmJoNytrbnBhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PFBLRUhKR0NJR05QUEFCRlBCS0xHSUVDSkFOQUIuamFja2lAYm9hcmRwcmVwLm5ldD4="},"prevInTopic":23949,"nextInTopic":23951,"prevInTime":23949,"nextInTime":23951,"topicId":5062,"numMessagesInTopic":0,"msgSnippet":"Do you (hypothetical public at large you being used here) know why autism is so little understood and has such a lot of confusion around it?  I think it s","messageBody":"<div id=\"ygrps-yiv-1195560162\">Do you (hypothetical public at large &quot;you&quot; being used here) know why <br/>\nautism is so little understood and has such a lot of confusion <br/>\naround it?  I think it&#39;s largely because people who are <br/>\nneurologically typical have a very hard time wrapping their minds <br/>\naround the very different place that autistics are coming from.  <br/>\nThere is a general public perception that they could be just like <br/>\neveryone else if they wanted to be.  Trying to understand that what <br/>\ncomes easily to most (like learning social behaviors by natural <br/>\nmodeling, or relating to others in a normal human/primate social <br/>\nway) is not easy at all for autistics must be really tough.  That&#39;s <br/>\nwhy it&#39;s called a &quot;Social Disorder&quot; often.  If we really were <br/>\nchimpanzees or something we autistics would probably be driven out <br/>\nor beaten to death or something for our social failings.<br/>\n<br/>\nAutistics have a very hard time understanding that other people may <br/>\nnot think what they think.  They/We have a very hard time reading <br/>\nbody language and responding appropriately.  Autistics generally <br/>\nhave a very hard time dissembling or knowing what &quot;not to say.&quot;  <br/>\nThey often fall apart in stress and do the exact opposite of <br/>\nsomething helpful to the situation.  Stress can be translated as <br/>\nsomething as simple as the checker asks you something while you are <br/>\ntrying to write a check and then a car honks loudly and your <br/>\nchildren start fighting.  That&#39;s enough to make me turn &quot;deer in the <br/>\nheadlights&quot; forget how to write a check or write my own name, not <br/>\nregister anything I am hearing (people talking sounds like &quot;Bla, bla <br/>\nbla bla bla..blablablablablabla&quot; sensory input starts flashing, I <br/>\nforget what I am doing and I just want everything to stop for about <br/>\n30 seconds so that I can reset.  <br/>\n<br/>\nDoes knowing all this mean that I can automatically correct it?  <br/>\nGod, don&#39;t I wish!!  I work hard at it, but I still sometimes go to <br/>\nbed at night mentally berating myself for doing and saying &quot;wrong&quot; <br/>\nthings.  I ask those around me, friends and loved ones, if I am <br/>\ndoing or saying the appropriate things, or if I have responded <br/>\nappropriately.  Knowing that there is a disconnect helps me to <br/>\nunderstand myself better, and to find helpful information on how to <br/>\nchange this, and to find people who are supportive and <br/>\nundertstanding and helpful to this process.  An Autistic will never <br/>\n*not* be autistic, but they can learn (slowly, methodically) how to <br/>\ndeal with different things in life.<br/>\n<br/>\nAutistics often work in their lives from a script, a learned set of <br/>\ncause and effect actions or step by step actions.  When life <br/>\ndeviates from the script it can be very upsetting.  A lot of <br/>\nlearning to cope with the world of other people for an autistic is <br/>\nlearning fallback scripts (alternate emergency contingencies) for <br/>\ndealing with when the script fails.  <br/>\n<br/>\nA lot of learning to cope with the world in a non-social way is <br/>\nlearning coping mechanisms for various physical needs or challenges, <br/>\nlike sensory integration problems.  An example:  Thomas needs to <br/>\nclose his eyes and splay his fingers and make a certain noise in the <br/>\nback of his throat while I brush his teeth in order to tone down his <br/>\ntongue seeking to aggressivley eject the toothbrush from his mouth <br/>\nas a sensory defense.  It took a lot of work to get to this point in <br/>\nteeth brushing and for some reason that set of stims (behaviors to <br/>\nhelp self sooth during stimulation) allow him to barely tolerate <br/>\nteeth brushing.  He wants to brush his teeth, by the way, it&#39;s not <br/>\nus forcing him against his will.  That works for now, mostly, but he <br/>\nwill eventually need to learn other coping strategies to make it <br/>\npossible for him to brush his teeth on his own.  Thomas also has <br/>\nmotor delays and so he has a lot of trouble using silverware still.  <br/>\nEven soup is mostly eaten with his hands.  Mostly that&#39;s ok at home <br/>\nand he rarely eats anywhere else, but we have to encourage him to <br/>\nuse napkins so he isn&#39;t wearing most of his food every day and we <br/>\nmake a daily practice of trying to model better table manners and <br/>\nencourage him to practice improving.  He doesn&#39;t want to gross his <br/>\nfriends out, but sometimes he does and is mortified by it.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; A person who knows enough to say he is sometimes impolite or <br/>\n&gt;inappropriate does not necessarily AT ALL know right then how to <br/>\n&gt;make it NOT so. <br/>\n<br/>\n </span></blockquote>bingo.  They know they are sometimes impolite because other people <br/>\nhave told them so, and other people have gotten upset with them for <br/>\nit.  They don&#39;t know it because they see it when it happens.  They <br/>\ndon&#39;t see it.  They are warning others because they want to avoid <br/>\nugly scenes again, which generally distress the autistics more than <br/>\nthe people they have offended.  They are also warning others because <br/>\nthey want to learn, they are working on it, and they want people to <br/>\nlike them and to like people in return.  They are giving people a <br/>\nchance to give them the benefit of the doubt and say &quot;Hey, maybe I <br/>\nam misunderstanding what you are saying, but that sounds offensive <br/>\nin this way...etc&quot;<br/>\n<blockquote><span title=\"ireply\"> &gt; &quot;I see your mad. Whatever I did, I didn&#39;t mean to make you mad. <br/>\n </span></blockquote>What did I do?&quot; followed by &quot;I am autistic and still learning <br/>\ncertain social things. I&#39;m sorry to have offended you.&quot; has made a <br/>\n<blockquote><span title=\"ireply\"> &gt;huge difference in dh&#39;s life. No excuses, just explanations.<br/>\n<br/>\n </span></blockquote>Right, just like that.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;But that doesn&#39;t mean because they don&#39;t want to, they <br/>\n&gt;automatically know how not to.<br/>\n<br/>\n </span></blockquote>Right exactly.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Are you saying if you don&#39;t know how to <br/>\n&gt;communicate &quot;appropriately&quot;, as in the way society has created thus <br/>\n </span></blockquote>far, you should not go into society? That&#39;s what this analogy says <br/>\n<blockquote><span title=\"ireply\"> &gt;to me.<br/>\n<br/>\n </span></blockquote>Me too, I don&#39;t understand that analogy.  It&#39;s hard to learn if <br/>\nwe&#39;re not allowed to try.  Lots of people don&#39;t like us and reject <br/>\nus because they don&#39;t understand us.  That hurts but it&#39;s reality <br/>\nand I live with it.  But we still try every day to learn to move <br/>\nthrough society better.  I try hard to not be offensive and to <br/>\nhandle things better.  I have strict scripts about what it means to <br/>\nbe a good host, be a good guest, be a good driver, be a good <br/>\ncitizen, be a good friend, be a good camper, etc. and I get really <br/>\nupset when other people don&#39;t fulfill their roles in that or don&#39;t <br/>\nlive up to those standards.  That&#39;s an autistic black and white view <br/>\nand I try to be more flexible about it than I used to be, and accept <br/>\nother people&#39;s differing definitions of those roles.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; A person with a neurological condition is not doing something <br/>\n&gt;intentionally wrong, or breaking a contract.<br/>\n<br/>\n </span></blockquote>Right.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Let me tell you, my husband would probably have given his right <br/>\n&gt;arm to not have gone through the tortures of being <br/>\n&gt;an &quot;inappropriate&quot; person in this world. <br/>\n<br/>\n </span></blockquote>Oh I feel that hurt.  I won&#39;t dwell on this past or it will make me <br/>\nhurt about things gone and not live in the now, but I so totally <br/>\nunderstand wht it means to be an inappropriate person in the world <br/>\ndespite all the effort you can give.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;To this day he often does not know when the truth should or <br/>\n&gt;shouldn&#39;t be told. <br/>\n<br/>\n </span></blockquote>I just in recent years finally *groked* the idea that there are <br/>\ntruths that should not be told.  It hit me like a brick wall one <br/>\nday, stunningly and with finality.  I still struggle with which <br/>\nthings qualify in which situations for this.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Yes a good suggestion that we&#39;ve figured out here. Softening the<br/>\n&gt; sentences...it is a structured learning thing. And the more that <br/>\n&gt;you want people to not be mad at you, the more you want to learn <br/>\n&gt;this and other lessons.<br/>\n<br/>\n </span></blockquote>I learned this on the internet.  I didn&#39;t understand what people <br/>\nmeant when they said I was &quot;stating my opinions like facts&quot; or why <br/>\npeople got upset with me or said I &quot;thought I knew everything&quot; or <br/>\nthat I acted like I was always right.  God, I feel like I know <br/>\nnothing, not everything!  I constantly question myself, and change <br/>\nideas and listen to what other people say.  I learn from everyone <br/>\naround me, or try to.  How could they get such a wrong opinion of <br/>\nme?!  I learned to try to soften my language (still forget sometimes <br/>\nas Sandra reminded me in that recent post.)   I understand now that <br/>\nmy written, and sometimes my spoken voice, can be pendantic and seem <br/>\npreachy.  I learned that what I am really doing is verbally stimming <br/>\nand processing and that I am repetitive while I do this <br/>\n(particularly in spoken language) and am learning to do this under <br/>\nmy breath instead of out loud because other people find it annoying <br/>\nor worse.  I learned that I have a tendancy to analyze people and <br/>\nlife in general in my attempt to understand them, generally outloud <br/>\n(oops!)  This is not polite or preferrable either I now understand, <br/>\nso I am trying consciously not to do this.  By the way that&#39;s <br/>\nsomething I learned from my neice Nicole.  I have a hard time just <br/>\nlistening and not offering my thoughts and opinions, and I realize <br/>\nthey are not always wanted and that listening is sometimes all that <br/>\nis wanted and needed.  Even a friend with a problem may not want to <br/>\nhear my possible solutions and I need to remember to ask before I <br/>\noffer them.  This is added to my script then listening to friends <br/>\nproblems:  Ask before offering advice.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;...learning that the other person may think very differently. It <br/>\n&gt;takes a kind of mental energy to go this distance <br/>\n<br/>\n </span></blockquote>Oh boy does it...<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;They WORK over time to understand this and are at varying degrees <br/>\n </span></blockquote>of understanding it, and like many learned skills, it<br/>\n<blockquote><span title=\"ireply\"> &gt; can come and go.<br/>\n<br/>\n </span></blockquote>Sounds familiar.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; And in the meantime, it can be useful to say, &quot;I&#39;m autistic<br/>\n&gt; and working on this.&quot; <br/>\n&gt; Jacki<br/>\n<br/>\n </span></blockquote>Thanks Jacki, that was great!</div>","specialLinks":[]},{"userId":128461194,"authorName":"Susan McGlohn","from":"Susan McGlohn &lt;wifeto.vegman@...&gt;","profile":"wifetovegman2002","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Labels","postDate":"1136963832","msgId":23949,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYuMS4xLjEuMi4yMDA2MDExMTAyMDYyNS4wMWI4M2IxOEBpbmNvbWluZy52ZXJpem9uLm5ldD4=","inReplyToHeader":"PDdCRjQ3RENGLTVFOTEtNDBBNi04ODdCLTZEM0MxNTAxQ0JEQ0BzYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PFBLRUhKR0NJR05QUEFCRlBCS0xHTUVMTkFNQUIuamFja2lAYm9hcmRwcmVwLm5ldD4gPDdCRjQ3RENGLTVFOTEtNDBBNi04ODdCLTZEM0MxNTAxQ0JEQ0BzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":23948,"nextInTopic":23950,"prevInTime":23948,"nextInTime":23950,"topicId":5062,"numMessagesInTopic":0,"msgSnippet":"... Amen to that! Being right there, helping Aaron to negotiate the playground etiquette, was really important when he was younger, as I posted before.   Once","messageBody":"<div id=\"ygrps-yiv-1928235159\">At 21:12 1/10/2006, you wrote:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;The parent should help keep the child out of situations he can&#39;t<br/>\n&gt;handle.  Maybe his MOST special need would be to have his mom nearby<br/>\n&gt;until...  until he didn&#39;t need her anymore. &lt;g&gt;   Same with any<br/>\n&gt;child.  The parent of any child should keep him out of situations he<br/>\n&gt;can&#39;t handle, and be nearby aytime he might need her nearby.<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Amen to that!<br/>\n<br/>\nBeing right there, helping Aaron to negotiate the playground etiquette, was <br/>\nreally important when he was younger, as I posted before.   Once we <br/>\nrealized he lacked that intuitive way of connecting with other kids, and <br/>\nneeded more help to initiate play, it was really imperative that I be right <br/>\nnext to him for the beginning.   For a long while I had to do the <br/>\ninitiating and introductions and invitation to play for him.  Now I can <br/>\njust coach him before we walk over from the car.  Someday I might not even <br/>\nhave to do that.<br/>\n<br/>\n<br/>\nSusan (in VA)<br/>\nwife to VegMan (aka Ted) since 12/86<br/>\nmomma to Sarah (10/89), Andrew (6/91), and Aaron (3/98)<br/>\n<br/>\n&quot;It&#39;s a small world....but a BIG life!&quot;  ~ Aaron, age 6<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://radicalchristianunschool.homestead.com/index.html\">http://radicalchristianunschool.homestead.com/index.html</a><br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":128461194,"authorName":"Susan McGlohn","from":"Susan McGlohn &lt;wifeto.vegman@...&gt;","profile":"wifetovegman2002","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Labels","postDate":"1136963126","msgId":23948,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYuMS4xLjEuMi4yMDA2MDExMTAxMzk1Ny4wMWI4NjNhOEBpbmNvbWluZy52ZXJpem9uLm5ldD4=","inReplyToHeader":"PEUxQkRCNTg1LTEyRkEtNDEwRi04RjYxLTdENDZBQjkxRDM3RUBzYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PFBLRUhKR0NJR05QUEFCRlBCS0xHS0VMSkFNQUIuamFja2lAYm9hcmRwcmVwLm5ldD4gPEUxQkRCNTg1LTEyRkEtNDEwRi04RjYxLTdENDZBQjkxRDM3RUBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":23947,"nextInTopic":23949,"prevInTime":23947,"nextInTime":23949,"topicId":5062,"numMessagesInTopic":0,"msgSnippet":"... Autistic people are usually not aware they are being blunt or inappropriate when they speak, and are not aware that the other person has been offended ","messageBody":"<div id=\"ygrps-yiv-1193027872\">At 20:40 1/10/2006, you wrote:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Do those questions cause him to try not to mumble so much?<br/>\n&gt;Is that a thing that&#39;s a challenge for him?<br/>\n&gt;<br/>\n&gt;If not, it seems he&#39;s using a condition as an excuse.<br/>\n<br/>\n<br/>\n </span></blockquote>Autistic people are usually not aware they are being blunt or inappropriate <br/>\nwhen they speak, and are not aware that the other person has been offended <br/>\nunless that person tells them, and then they really don&#39;t understand <br/>\nwhy.  Although they can be coached to say, &quot;I&#39;m sorry I hurt your feelings, <br/>\nI didn&#39;t mean to.&quot; they usually really don&#39;t ever get why the person was <br/>\noffended.<br/>\n<br/>\nWhen Aaron was younger and we would go to restaurants that had play areas <br/>\nor to the playground, on the way there he would be so excited with <br/>\nanticipation of playing in the tubes or on the equipment with the other <br/>\nchildren there.  He would already have a game going in his head, and he <br/>\nwould already be in character when we arrived.<br/>\n<br/>\nHe would enter the play area and start roaring like a dinosaur.  He would <br/>\nhave his fingers crooked like a T-rex&#39;s forelegs and be roaring at these <br/>\nother children and run right up to them.  On two different occasions he got <br/>\npunched in the face by slightly older boys who didn&#39;t appreciate being <br/>\n&quot;attacked&quot; by a strange kid.   He never connected the way he approached <br/>\nthese children with the punches, though.   Even after it being explained to <br/>\nhim in various ways.  Even after the second time it happened.<br/>\n<br/>\nIt took lots of coaching on my part for many months, lots of &quot;briefing&quot; <br/>\nabout how to approach the children at the playground each time on the way <br/>\nto the place, before he would go up to them and say, &quot;I&#39;m Aaron.  Would you <br/>\nlike to pretend to be a dinosaur with me?&quot;  For a long time I had to be <br/>\nright there next to him, and do it for him, because he couldn&#39;t even break <br/>\nout of his dinosaur mode to do it himself.<br/>\n<br/>\nHe still thinks it is really weird that he has to do it that way.  He <br/>\ndoesn&#39;t really get that other people are not thinking the exact same things <br/>\nhe is.<br/>\n<br/>\nAaron still makes animal noises rather than answer people&#39;s questions if he <br/>\ndoesn&#39;t understand what they are saying.  Even a, &quot;How did you like the <br/>\nmovie?&quot; is sometimes way too general a question and he will just look at <br/>\nthem and quack.  We&#39;re still working on that one.<br/>\n<br/>\n<br/>\nSusan (in VA)<br/>\nwife to VegMan (aka Ted) since 12/86<br/>\nmomma to Sarah (10/89), Andrew (6/91), and Aaron (3/98)<br/>\n<br/>\n&quot;It&#39;s a small world....but a BIG life!&quot;  ~ Aaron, age 6<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://radicalchristianunschool.homestead.com/index.html\">http://radicalchristianunschool.homestead.com/index.html</a><br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":128461194,"authorName":"Susan McGlohn","from":"Susan McGlohn &lt;wifeto.vegman@...&gt;","profile":"wifetovegman2002","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Labels","postDate":"1136961414","msgId":23947,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYuMS4xLjEuMi4yMDA2MDExMTAxMTUwOS4wMWI4MzNkMEBpbmNvbWluZy52ZXJpem9uLm5ldD4=","inReplyToHeader":"PEEwMEYzRTc5LUFFQzctNDAxOS05MjdCLTk4Mjc5NjkzM0M2OEBzYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PFBLRUhKR0NJR05QUEFCRlBCS0xHQ0VMREFNQUIuamFja2lAYm9hcmRwcmVwLm5ldD4gPEEwMEYzRTc5LUFFQzctNDAxOS05MjdCLTk4Mjc5NjkzM0M2OEBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":23946,"nextInTopic":23948,"prevInTime":23946,"nextInTime":23948,"topicId":5062,"numMessagesInTopic":0,"msgSnippet":"... Wait...are you saying it s okay for people to treat a child with down s syndrome, autism, aspergers, diminutive size, etc. differently than other children?","messageBody":"<div id=\"ygrps-yiv-779060913\">At 20:31 1/10/2006, you wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;And is seems sometimes that people<br/>\n&gt;confuse a school&#39;s requirement to provide services to every child in<br/>\n&gt;the school district with some imagined requirement of every neighbor<br/>\n&gt;and stranger to treat their child the same as that person would treat<br/>\n&gt;any other child.<br/>\n<br/>\n </span></blockquote>Wait...are you saying it&#39;s okay for people to treat a child with down&#39;s <br/>\nsyndrome, autism, aspergers, diminutive size, etc. differently than other <br/>\nchildren?<br/>\n<br/>\nI thought the discussion was that they shouldn&#39;t be labeled or treated any <br/>\ndifferently.  I must be misunderstanding what you are saying here, Sandra.<br/>\n<br/>\n<br/>\n<br/>\nSusan (in VA)<br/>\nwife to VegMan (aka Ted) since 12/86<br/>\nmomma to Sarah (10/89), Andrew (6/91), and Aaron (3/98)<br/>\n<br/>\n&quot;It&#39;s a small world....but a BIG life!&quot;  ~ Aaron, age 6<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://radicalchristianunschool.homestead.com/index.html\">http://radicalchristianunschool.homestead.com/index.html</a><br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":116488337,"authorName":"Gold Standard","from":"&quot;Gold Standard&quot; &lt;jacki@...&gt;","profile":"jackiknouse","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] Labels","postDate":"1136959790","msgId":23946,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFBLRUhKR0NJR05QUEFCRlBCS0xHRUVEQkFOQUIuamFja2lAYm9hcmRwcmVwLm5ldD4=","inReplyToHeader":"PDIwMDYwMTExMDMxODE5LjQ1MTI2LnFtYWlsQHdlYjUxOTAzLm1haWwueWFob28uY29tPg=="},"prevInTopic":23945,"nextInTopic":23947,"prevInTime":23945,"nextInTime":23947,"topicId":5062,"numMessagesInTopic":0,"msgSnippet":"Nanci, I really appreciate your post. ... Yes, same here. It makes a difference when you have tools...using them beneficially to their potential for our","messageBody":"<div id=\"ygrps-yiv-549614951\">Nanci, I really appreciate your post.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;But we have the tools that we have, and I<br/>\n&gt;&gt;try to use them to their potential.&lt;&lt;<br/>\n<br/>\n </span></blockquote>Yes, same here. It makes a difference when you have tools...using them<br/>\nbeneficially to their potential for our children.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Few families of ANY unschooled kid will go long<br/>\n </span></blockquote>without &gt;thinking or saying that the parents are crazy<br/>\nor bad or the kid &gt;is a brat.  That will pass, but it<br/>\nhappens to most unschooled &gt;kids and parents.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Yes, I&#39;ve seen this.  But with kids like mine, the<br/>\n&gt;&gt;differences in behavior can be strong enough that even<br/>\n&gt;&gt;other unschooling families are really weirded out and<br/>\n&gt;&gt;judgemental about it unless they have a better<br/>\n&gt;&gt;understanding of what they are dealing with.  Having<br/>\n&gt;&gt;that sort of social background information that allows<br/>\n&gt;&gt;you to know where the behaviors of another person are<br/>\n&gt;&gt;coming from is really helpful, for them and for us.&lt;&lt;<br/>\n<br/>\n </span></blockquote>God you said this so much better than I&#39;ve been able to. Thank you.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I think looking for differences is less helpful on a<br/>\n </span></blockquote>list like &gt;this than looking at similarities.<br/>\n<blockquote><span title=\"ireply\"> &gt;Sandra<br/>\n<br/>\n&gt;&gt;Fortunately I wasn&#39;t looking for differences but was<br/>\n&gt;&gt;just sharing information on a topic (Unschooling kids<br/>\n&gt;&gt;who are &quot;atypical&quot;) that people were responding to<br/>\n&gt;&gt;with interest.&lt;&lt;<br/>\n<br/>\n </span></blockquote>That&#39;s where I started to come from as well...than felt lured into a<br/>\ndefensive place. Granted, I am the only one who can make myself feel<br/>\ndefensive...gotta work on that...<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Were I to refuse to acknowledge<br/>\n&gt;&gt;however that my family do es have some challenges and<br/>\n&gt;&gt;differences from *most* people I would not be doing<br/>\n&gt;&gt;anyone any favors, least of all us.&lt;&lt;<br/>\n<br/>\n </span></blockquote>Yes, I said something similar earlier. What is wrong with seeing the<br/>\ndifferences? Celebrating the differences? Recognizing and helping with the<br/>\nchallenges? It would shortchange our children otherwise.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;It&#39;s not unusual<br/>\n&gt;&gt;for kids with undiagnosed &quot;differences&quot; to be horribly<br/>\n&gt;&gt;depressed and have a much harder time dealing with the<br/>\n&gt;&gt;world, both because they don&#39;t understand why things<br/>\n&gt;&gt;that come to others are so much harder for them&lt;&lt;<br/>\n<br/>\n </span></blockquote>Oh Nanci, I&#39;m so glad you brought this up. My dh was deeply depressed for a<br/>\nlong time. He started to come around when he found information that helped<br/>\nhim understand himself better. I really meant it when I said it completely<br/>\nturned his life around. We shared this label with ds Andrew when he was<br/>\ndeeply depressed. What a difference it made for him.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I guess I don&#39;t understand why someone (can&#39;t remember<br/>\n&gt;&gt;who, sorry!) pointing out in a previous post that<br/>\n&gt;&gt;their husband had a problem that he was relieved to<br/>\n&gt;&gt;find was associated with his functional developmental<br/>\n&gt;&gt;differences (autism/aspergers I believe)&lt;&lt;<br/>\n<br/>\n </span></blockquote>That was me. Dh and Asperger&#39;s.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;made people<br/>\n&gt;&gt;close up, shut off the potential for assosciating<br/>\n&gt;&gt;themselves or connecting themselves with that<br/>\n&gt;&gt;behavior.  They said something like &quot;Oh I really<br/>\n&gt;&gt;realted to that, until that word was said...&quot;  Why was<br/>\n&gt;&gt;that so scary and alien?  Why couldn&#39;t the other list<br/>\n&gt;&gt;members still feel that connection to another human<br/>\n&gt;&gt;who has a similar problem to themselves, but perhaps<br/>\n&gt;&gt;for a different reason, and maybe to a different level<br/>\n&gt;&gt;or degree?&lt;&lt;<br/>\n<br/>\n </span></blockquote>Well that was certainly my response as well to those posts, but I was a<br/>\nlittle too close to the situation to feel comfortable responding about it.<br/>\nWe all have different tendencies at varying degrees which makes us more<br/>\nalike than different. However when it strongly negatively impacts one&#39;s<br/>\nlife, it may be more than more typical tendencies.<br/>\n<br/>\nI would love for people to see that reacting negatively to a label only<br/>\ncontinues a negative stigma. Kinda like the stigma some carry about<br/>\nunschoolers. No need to disconnect because one unschools.<br/>\n<br/>\nI understand the desire to end all labels, and maybe that is where the<br/>\ndisconnect came. If you think labels are bad, when one is associated with<br/>\nbehaviors you have, then suddenly disconnecting makes sense. But we aren&#39;t<br/>\ntalking about labels...we are talking about people.<br/>\n<br/>\nWe can individually decide that a label will or will not cause a disconnect<br/>\nwith another person. If we&#39;re talking about a person, what difference does<br/>\nit make that they choose to utilize a label to help them in their lives?<br/>\n<br/>\nJacki</div>","specialLinks":[]},{"userId":116488337,"authorName":"Gold Standard","from":"&quot;Gold Standard&quot; &lt;jacki@...&gt;","profile":"jackiknouse","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] Labels","postDate":"1136957394","msgId":23945,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFBLRUhKR0NJR05QUEFCRlBCS0xHQUVEQUFOQUIuamFja2lAYm9hcmRwcmVwLm5ldD4=","inReplyToHeader":"PDdCRjQ3RENGLTVFOTEtNDBBNi04ODdCLTZEM0MxNTAxQ0JEQ0BzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":23944,"nextInTopic":23946,"prevInTime":23944,"nextInTime":23946,"topicId":5062,"numMessagesInTopic":0,"msgSnippet":"... Another potentially tricky one. My guy is turning 17 in a couple of weeks. Not wanting mama around so much. More learning from the world. And it is ","messageBody":"<div id=\"ygrps-yiv-806023083\"><blockquote><span title=\"ireply\">&gt;&gt;The parent of any child should keep him out of situations he<br/>\n&gt;&gt;can&#39;t handle, and be nearby aytime he might need her nearby.&lt;&lt;<br/>\n<br/>\n </span></blockquote>Another potentially tricky one. My guy is turning 17 in a couple of weeks.<br/>\nNot wanting mama around so much. More learning from the world. And it is<br/>\nfabulous and painful and scary and fun. Fortunately, we process a whole lot.<br/>\n<br/>\nBut when he was 11 (I think that the pool girl&#39;s age) I was nearby most of<br/>\nthe time.<br/>\n<br/>\nI do hate though to talk about other people&#39;s remote situation though, and<br/>\njudge without knowing much about it, as with the girl in the pool. Maybe<br/>\nthat was the only time it happened. Maybe she was playing with some ideas<br/>\nshe&#39;d been exposed to. Maybe she was screaming for those girls to set her<br/>\nstraight and tell her to cut it out. Maybe she was terrified that she really<br/>\ndid have special needs and she wanted those girls to verify that she didn&#39;t.<br/>\n<br/>\nI think of the things my kids have said and done in isolated situations over<br/>\nthe years, and there would be no way an unknowing group of emailers could<br/>\nhave enough information to make judgments about it.<br/>\n<br/>\nJacki</div>","specialLinks":[]},{"userId":116488337,"authorName":"Gold Standard","from":"&quot;Gold Standard&quot; &lt;jacki@...&gt;","profile":"jackiknouse","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] Labels","postDate":"1136956915","msgId":23944,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFBLRUhKR0NJR05QUEFCRlBCS0xHSUVDUEFOQUIuamFja2lAYm9hcmRwcmVwLm5ldD4=","inReplyToHeader":"PEUxQkRCNTg1LTEyRkEtNDEwRi04RjYxLTdENDZBQjkxRDM3RUBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":23943,"nextInTopic":23945,"prevInTime":23943,"nextInTime":23945,"topicId":5062,"numMessagesInTopic":0,"msgSnippet":"-=-My oldest son every now and then will say, It s because I m autistic ...but it is usually an informational statement for whoever he is talking to (I heard","messageBody":"<div id=\"ygrps-yiv-2037374882\">-=-My oldest son every now and then will say, &quot;It&#39;s because I&#39;m<br/>\nautistic&quot;...but<br/>\nit is usually an informational statement for whoever he is talking to (I<br/>\nheard him answer someone who asked, &quot;Dude...why do you mumble so<br/>\nmuch?&quot;) not<br/>\nso much why he CAN&#39;T do something. But why he is the way he is in this<br/>\ncurrent moment. He works pretty hard to get better at things that are<br/>\nchallenges to him.-=-<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Do those questions cause him to try not to mumble so much?<br/>\n&gt;&gt;Is that a thing that&#39;s a challenge for him?&lt;&lt;<br/>\n<br/>\n </span></blockquote>These questions do indeed cause him to try not to mumble. He&#39;s been working<br/>\non that one since he had an interest in people. And it is very much a<br/>\nchallenge for him. He has come SO far with this.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Parents using excuses are modelling using excuses.&lt;&lt;<br/>\n<br/>\n </span></blockquote>Well...yeah. But I think the differentiation is whether a parent IS using an<br/>\nexcuse. I don&#39;t see it very often in the circles I&#39;m in.<br/>\n<br/>\nJacki</div>","specialLinks":[]},{"userId":116488337,"authorName":"Gold Standard","from":"&quot;Gold Standard&quot; &lt;jacki@...&gt;","profile":"jackiknouse","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] Labels","postDate":"1136956517","msgId":23943,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFBLRUhKR0NJR05QUEFCRlBCS0xHSUVDSkFOQUIuamFja2lAYm9hcmRwcmVwLm5ldD4=","inReplyToHeader":"PEEwMEYzRTc5LUFFQzctNDAxOS05MjdCLTk4Mjc5NjkzM0M2OEBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":23942,"nextInTopic":23944,"prevInTime":23942,"nextInTime":23944,"topicId":5062,"numMessagesInTopic":0,"msgSnippet":"... Well this makes sense in THEORY, but it isn t accurate. A person who knows enough to say he is sometimes impolite or inappropriate does not necessarily AT","messageBody":"<div id=\"ygrps-yiv-1459654596\">-----Original Message-----<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Someone said something like that she was proud of her son because he<br/>\n&gt;&gt;went to his [boss? leader-of-something?] and said that he was<br/>\n&gt;&gt;thus&#39;n&#39;such a way, and that meant he would be blunt and say what he<br/>\n&gt;&gt;thought and just tell the truth.*&lt;&lt;<br/>\n<br/>\n&gt;&gt;If a person knows enough to know that sometimes he says too much or<br/>\n&gt;&gt;says it impolitely or inappropriately, then saying &quot;I&#39;m going to do<br/>\n&gt;&gt;this because I can&#39;t help it,&quot; and expecting the other person to just<br/>\n&gt;&gt;live with tactlessness is using a condition/disability/syndrome as an<br/>\n&gt;&gt;excuse.&lt;&lt;<br/>\n<br/>\n </span></blockquote>Well this makes sense in THEORY, but it isn&#39;t accurate. A person who knows<br/>\nenough to say he is sometimes impolite or inappropriate does not necessarily<br/>\nAT ALL know right then how to make it NOT so. It shows that they at least<br/>\nhave that figured out. There is an assumption in the paragraph above that<br/>\nthis person was saying like, &quot;nah nah nah nah nah, I&#39;m this way and you have<br/>\nto suffer for it.&quot; That may be how an observer perceived the situation. It<br/>\nCOULD be that the person was explaining a behavior that they are working on,<br/>\nlike I see my ds occasionally (very occasionally) do. When ds is in a<br/>\nsituation where he is having to explain that he can&#39;t help whatever he did,<br/>\nor didn&#39;t mean whatever he did, he is usually mortified that he has gotten<br/>\nin this position. Intense internal angst. He is trying to reach out to the<br/>\nother person for some understanding. And he learns. And he moves forward<br/>\nwith another little piece that hopefully helps him next time.<br/>\n<br/>\nMy husband talks about knowing that people would get pissed at him, and him<br/>\nbeing SO clueless as to what he did wrong. Utilizing this label &quot;Asperger&#39;s&quot;<br/>\nallowed them to unlock some major puzzle pieces for himself. We lived<br/>\nwithout the labels for most of dh&#39;s and ds&#39;s lives, and only used the label<br/>\nfor information initially. But being able to say, &quot;I see your mad. Whatever<br/>\nI did, I didn&#39;t mean to make you mad. What did I do?&quot; followed by &quot;I am<br/>\nautistic and still learning certain social things. I&#39;m sorry to have<br/>\noffended you.&quot; has made a huge difference in dh&#39;s life. No excuses, just<br/>\nexplanations.<br/>\n<br/>\nNow they can at least say &quot;I am not an asshole. I am trying to learn this<br/>\nstuff but it takes time. My heart is pure gold and if I do something to<br/>\noffend you, please know it is not my intention&quot; because at least for my two<br/>\nguys here, I have never seen them intentionally offend another person, or<br/>\nwant to be impolite. But that doesn&#39;t mean because they don&#39;t want to, they<br/>\nautomatically know how not to.<br/>\n<br/>\nBefore the label, we had meetings with dh&#39;s co-workers to say, &quot;Hey look,<br/>\nhe&#39;s going to probably be more blunt than you are used to, but his intention<br/>\nis to give you this information, not to offend you. Let him know if you are<br/>\nfeeling offended. He won&#39;t see it on his own&quot; along with telling them about<br/>\nother seemingly &quot;inappropriate&quot; behaviors. They still got mad and assumed he<br/>\nhad complete control over it. *I* knew his struggle. He knew his struggle.<br/>\nBut others did not.<br/>\n<br/>\nIt has been so much more effective to say, &quot;He is at the tail end of a long<br/>\nlife with autism. He&#39;s figured lots of things out socially, but every now<br/>\nand then may say something that seems too blunt or offensive. Tell him when<br/>\nthat happens. He will probably immediately apologize and set it straight.&quot;<br/>\nWhich is what he does, and he ALWAYS feels bad when it happens. As does my<br/>\nds. They would NEVER arrogantly say, &quot;I have autism. I am rude. Deal with<br/>\nit.&quot; They are mortified when they&#39;ve gotten themselves in situations like<br/>\nthat.<br/>\n<br/>\nDh does not for a second lean on this label. Most information out there<br/>\nabout it gives great help with reducing the typical difficult symptoms,<br/>\nwhich is often the goal. He has cognitively worked on this for years, and<br/>\nmaybe I&#39;m sheltered and naive about this, but I don&#39;t see our label<br/>\nsituation as being used as a crutch. That makes me think many others<br/>\nprobably aren&#39;t either.<br/>\n<br/>\nJust to move for a second to the positive, lest it sound like we focus on<br/>\nthis challenging stuff all the time, my two guys are amazing! Their amazing<br/>\ncreative writings, incredible inventive ideas, humor like no others in my<br/>\nlife...those are the things we typically focus on. These little challenges<br/>\nare just part of an ever-evolving package.<br/>\n<br/>\nIronically, at least in how this is presented in the theory above, having<br/>\nthe label helped dh LESSEN being inappropriate and impolite.<br/>\n<br/>\nIn the example I gave of my son in an earlier post, he said to his drama<br/>\nteacher, &quot;&quot;Oh. You&#39;re probably wondering why I am so blunt about what I<br/>\nthink. You see, I am working on making that easier on people around me,...&quot;<br/>\nthat last part was a very important part of the sentence. He IS working on<br/>\nmaking that easier on people around him. He&#39;s not sitting around saying &quot;I&#39;m<br/>\nautistic and you guys are just going to have to deal with it. He WANTS to be<br/>\nacceptable and polite to people.<br/>\n<br/>\nFor Andrew, he sees with more clarity his impoliteness or inappropriateness<br/>\nnow than he ever did before he heard the word &quot;autism&quot;. And he&#39;s figuring<br/>\nout what he is doing wrong and changing it. He doesn&#39;t like people pissed at<br/>\nhim. Who does? And while he learns how to get better and better at being<br/>\nmore &quot;appropriate&quot; and &quot;polite&quot; it is dang useful to give people a heads-up<br/>\nwhen you start to see that they are getting confused about your behavior.<br/>\nHell, I&#39;m excited as a pig and poop that he even noticed that his drama<br/>\nteacher was getting annoyed! That is a HUGE step for him...to notice WHEN<br/>\nsomeone was getting irritated. And seeing that doesn&#39;t make his body then<br/>\nbecome normal and act appropriate...it shows that SOMETHING he is doing is<br/>\nbothering the other person...often not sure what...but to be able to<br/>\nsay...&quot;okay, I know something is wrong here, don&#39;t know exactly what it is,<br/>\nbut I am autistic and that is at least part of the problem&quot; IS helpful to<br/>\nall involved. NOT an excuse. He WANTS to fix it. Can you imagine that<br/>\ninternal struggle? It is intense and filled with anxiety. It can be like<br/>\nfinding your way through an intricate gargantuan maze in the dark without a<br/>\nflashlight.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;If I were a one-eyed driver and said &quot;Because I don&#39;t have binocular<br/>\n&gt;&gt;vision and I&#39;m not good at spatial reasoning, I will damage your<br/>\n&gt;&gt;truck and other vehicles more than your other employees do,&quot; that<br/>\n&gt;&gt;would be quite an unreasonable excuse.  Not everyone gets to drive.&lt;&lt;<br/>\n<br/>\n </span></blockquote>Are you saying if you don&#39;t know how to communicate &quot;appropriately&quot;, as in<br/>\nthe way society has created thus far, you should not go into society? That&#39;s<br/>\nwhat this analogy says to me.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;If a gambler told the landlord &quot;I will probably be behind on the<br/>\n&gt;&gt;rent, because I have a serious gambling problem, that would not be a<br/>\n&gt;&gt;good excuse.  Landlords make contracts with rentors&lt;&lt;<br/>\n<br/>\n </span></blockquote>Again, this is apples and oranges Sandra. A person with a neurological<br/>\ncondition is not doing something intentionally wrong, or breaking a<br/>\ncontract. In our situation, they are still figuring out what the damn<br/>\ncontract says!<br/>\n<br/>\nAnd if they are in the process of LEARNING how to cope and behave in<br/>\nsociety, it makes sense that they let people know that. Let me tell you, my<br/>\nhusband would probably have given his right arm to not have gone through the<br/>\ntortures of being an &quot;inappropriate&quot; person in this world. Your examples<br/>\nonly add to the lack of understanding and the intolerance of our society,<br/>\nimho. Yes, we should all work toward treating each other well. AND yes some<br/>\npeople are way behind the curve in that area...(they are way ABOVE the curve<br/>\nin other areas though...and my guess is that because they are so smart in<br/>\ncertain isolated areas [think Mozart, Einstein], their social development<br/>\nsuffers) but that is no excuse for US to not be understanding about it.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;It seems sometimes in discussions of children&#39;s special abilities or<br/>\n&gt;&gt;special needs, the parents confuse finding them opportunities to play<br/>\n&gt;&gt;and participate as children with some sort of lifelong license to<br/>\n&gt;&gt;participate &quot;equally&quot; forever.    And is seems sometimes that people<br/>\n&gt;&gt;confuse a school&#39;s requirement to provide services to every child in<br/>\n&gt;&gt;the school district with some imagined requirement of every neighbor<br/>\n&gt;&gt;and stranger to treat their child the same as that person would treat<br/>\n&gt;&gt;any other child.&lt;&lt;<br/>\n<br/>\n </span></blockquote>When this happens, can you give an example? Talking in these generalities<br/>\nhas little meaning to me. I&#39;ve been talking about the real life things that<br/>\nhappen in my family. When you say something like this statement above, it is<br/>\nclear to me that you are detached and distanced from the actual experience<br/>\nof living with someone who is beyond the parameters of societal norms...NOT<br/>\npublic school norms...but society&#39;s norms. The kind of norms that keep<br/>\npeople able to work and live together well.<br/>\n<br/>\nThis is part of why a list that has lots of people with this kind of<br/>\nsituation in their homes IS helpful...not to give excuses for behavior or<br/>\npromote &quot;self-fulfilling prophecies&quot;, but to talk about our ACTUAL<br/>\nexperiences. Otherwise, it is often theory and assumptive and guesswork. And<br/>\ncan be SO non-understanding and, well, offensive, as I have found some of<br/>\nthis post to be.<br/>\n<br/>\nThat said, I do think it is important to maintain an &quot;I can do anything&quot;<br/>\nattitude no matter what &quot;condition&quot; one might have. That is a given in my<br/>\nhouse. Being confined by a label is not helpful. My friend has a son who is<br/>\nparalyzed from the waist down. Born with Cerebral Palsy. At age 11 he still<br/>\nattends weekly physical therapy to keep his limbs healthy, but also to<br/>\ncontinue working on walking. His label and diagnosis only help them get his<br/>\nneeds met...the labels do not make him or his parents think he&#39;ll never<br/>\nwalk, though that is what they are told.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;in the real world there&#39;s<br/>\n&gt;&gt;rarely anything resembling a special education department.  Maybe<br/>\n&gt;&gt;occupational therapists or social workers qualify in that way.&lt;&lt;<br/>\n<br/>\n </span></blockquote>In the real world there is the internet. YAY!!!!!!!!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;And on a tangent from the star *, the idea that someone can just say<br/>\n&gt;&gt;&quot;I will tell the truth&quot;  can be an excuse.&lt;&lt;<br/>\n<br/>\n </span></blockquote>There are people who can not help themselves but to tell the truth. My<br/>\nhusband is one of them. To this day he often does not know when the truth<br/>\nshould or shouldn&#39;t be told. That is a skill that MOST of us have and SOME<br/>\nof us don&#39;t. It is not something that is easy to learn if you don&#39;t have<br/>\nthat piece in your brain. Dh continues to try, but still gets very confused<br/>\nabout this...(&quot;Why wasn&#39;t I supposed to tell Sue that you didn&#39;t want to go<br/>\nto her party? You said you didn&#39;t want to go.&quot; Or &quot;Why is she mad at me?<br/>\nBecause I said she smelled? She DID smell! Doesn&#39;t she want to know that?&quot;)<br/>\nVery confusing. Literal, truthful life...what could be wrong with that? A<br/>\nlot can end up being wrong with that.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Someone who&#39;s not good at<br/>\n&gt;&gt;knowing what&#39;s good to say when and to whom might want to consider<br/>\n&gt;&gt;that his perceptions might not be &quot;the truth&quot; every time.&lt;&lt;<br/>\n&gt;&gt;&quot;It seems<br/>\n&gt;&gt;to me&quot; or &quot;I feel that...&quot; is generally a better way to preface a<br/>\n&gt;&gt;statement&lt;&lt;<br/>\n<br/>\n </span></blockquote>Yes a good suggestion that we&#39;ve figured out here. Softening the<br/>\nsentences...it is a structured learning thing. And the more that you want<br/>\npeople to not be mad at you, the more you want to learn this and other<br/>\nlessons.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;than &quot;I will tell you the truth.&quot;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Well for us, dh and ds don&#39;t start their sentences that way...they just say<br/>\nwhat they are thinking, or they answer a question. But it will be stated as<br/>\na statement, not as an opinion.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&quot;I was just telling the<br/>\n&gt;&gt;truth&quot; doesn&#39;t cover over a difference of opinion or a need to<br/>\n&gt;&gt;understand that the other person in the situation might have a<br/>\n&gt;&gt;different perception and that his perception might be more objective,<br/>\n&gt;&gt;or more important.&lt;&lt;<br/>\n<br/>\n </span></blockquote>Yes, this is one of the pieces of learning that I&#39;ve seen happen<br/>\nhere...learning that the other person may think very differently. It takes a<br/>\nkind of mental energy to go this distance (not for you or me, but definitely<br/>\nfor them). We see it, we do it. They WORK over time to understand this and<br/>\nare at varying degrees of understanding it, and like many learned skills, it<br/>\ncan come and go. And in the meantime, it can be useful to say, &quot;I&#39;m autistic<br/>\nand working on this.&quot;<br/>\n<br/>\nJacki</div>","specialLinks":[]},{"userId":67247159,"authorName":"Nanci Kuykendall","from":"Nanci Kuykendall &lt;aisliin@...&gt;","profile":"aisliin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"[AlwaysLearning] Labels","postDate":"1136954689","msgId":23942,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwMTExMDQ0NDQ5LjM3NTkwLnFtYWlsQHdlYjUxOTEwLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDExMzY4NTExMzkuMzgwLjQ3MzA1Lm0xOEB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":23941,"nextInTopic":23943,"prevInTime":23941,"nextInTime":23943,"topicId":5062,"numMessagesInTopic":0,"msgSnippet":"... No Kidding, what a tragedy.  Of course labels can be misused and abused, like anything.  What s a label anyway?  When does it go from being a piece of ","messageBody":"<div id=\"ygrps-yiv-634465365\"><blockquote><span title=\"ireply\">&gt;Great example Pam! Thanks!<br/>\n<br/>\n </span></blockquote>No Kidding, what a tragedy.  Of course labels can be<br/>\nmisused and abused, like anything.  What&#39;s a label<br/>\nanyway?  When does it go from being a piece of<br/>\npotentially helpful information to a hurtful word? <br/>\nObviously the word &quot;label&quot; causes a visceral emotional<br/>\nreaction for some people.<br/>\n<br/>\nThis thread just keeps getting better.  I have been<br/>\nsoaking up all the stories from folks who were<br/>\n&quot;labeled children.&quot;  Very interesting stuff.  I&#39;ve<br/>\noften said that I am thankful that my kids have been<br/>\nunschooled since birth and have escaped all those<br/>\nschool labels and aggressive interventions.  Thomas in<br/>\nparticular would have a ton of them.  They don&#39;t get<br/>\ndragged around to many professionals to &quot;figure out<br/>\nwhat&#39;s wrong with them&quot; nor do they get discussed in<br/>\nterms of &quot;this is my (label) child.&quot;  I mainly handle<br/>\ntherapies myself when they are struggling with things<br/>\nand need help.  <br/>\n<br/>\nNeither of them have ever said anything to the effect<br/>\nof &quot;You have to be nice to me because I&#39;m special&quot; or<br/>\nacted that way, nor do they think of themselves as<br/>\nessentially different from other people that I can<br/>\ntell at all.  In fact when they have a hard time (for<br/>\ninstance) with having appropriate behavior I let them<br/>\nknow that &quot;If something like this is hard for you<br/>\n(doesn&#39;t matter why), that just means you have to work<br/>\nharder to accomplish it, that doesn&#39;t excuse you from<br/>\ndoing it.&quot;  An example would be, not running and<br/>\nscreaming in a restaurant or store or climbing on the<br/>\nshelving, etc.  They were doing this today (the<br/>\nrunning, screaming, and climbing on the shelves) in a<br/>\nstore and after asking them to stop multiple times in<br/>\na 10 minute period I had to ask them to wait for me<br/>\noutside because I was trying to get in line and leave<br/>\nthe store.  Just a reminder, they are 9 and almost 8. <br/>\nFortunately they could actually go outside where there<br/>\nwas a large pavement area and an empty bike rack thing<br/>\n(big steel upside down U&#39;s coming out of the concrete)<br/>\nto mess with and climb on and where I could see them<br/>\nfrom the big glass doors of the store and was very<br/>\nnearby.  It was a small store.  They asked to go with<br/>\nme and they had their own money to get things and we<br/>\nwere not there that long, so it&#39;s not like I was<br/>\ndragging them around on my boring errands or<br/>\nsomething.  So we had to talk in the car about trying<br/>\nharder to have appropriate behaviors, what ways I<br/>\ncould help them, how they could help me, and what was<br/>\nand was not ok to do in a store, and then we tried<br/>\nagain at the little local toy shop they asked me to<br/>\ntake them to after that, to spend their nickels and<br/>\ndimes.<br/>\n<br/>\nMy boys certainly don&#39;t show any signs of depression<br/>\nor image or self esteem problems.  They just joyfully<br/>\n*ARE* and part of who they are happens to include<br/>\nsomething that professional people like to call<br/>\nautism, and which happens to affect multiple<br/>\ngenerations of their family to some degree.  There&#39;s<br/>\nnothing evil about it, any more than having redheads<br/>\nin the family or being tall is evil.  It just is. <br/>\nSometimes it helps a lot though to know it, and to be<br/>\nable to examine how it affects how we see and hear and<br/>\nfeel and react to things.  Helps a lot in fact.  It<br/>\ndoes for me.  It helps me to know myself better, and<br/>\nto not have as much anxiety about where my feelings<br/>\nare coming from, and to be a better mom and spouse and<br/>\nfriend and to understand those weird &quot;neurologically<br/>\ntypical&quot; folks better. <br/>\n<br/>\nNanci K.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Labels","postDate":"1136950578","msgId":23941,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFCQTFFNUI5LTdBMzgtNEY0RS1CQjVELThDN0YxRTM3MUVEREBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDIwMDYwMTExMDMxODE5LjQ1MTI2LnFtYWlsQHdlYjUxOTAzLm1haWwueWFob28uY29tPg==","referencesHeader":"PDIwMDYwMTExMDMxODE5LjQ1MTI2LnFtYWlsQHdlYjUxOTAzLm1haWwueWFob28uY29tPg=="},"prevInTopic":23940,"nextInTopic":23942,"prevInTime":23940,"nextInTime":23942,"topicId":5062,"numMessagesInTopic":0,"msgSnippet":"... No one labelled me an unschooler against my will. -=- Labels are not big evil boogiemen if they are not allowed to get bigger or more important than they ","messageBody":"<div id=\"ygrps-yiv-1294979755\">On Jan 10, 2006, at 8:18 PM, Nanci Kuykendall wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The label Unschooler connects<br/>\n&gt; people on this list, defines them partially in some<br/>\n&gt; ways.<br/>\n<br/>\n<br/>\n </span></blockquote>No one labelled me an unschooler against my will.<br/>\n<br/>\n<br/>\n-=- Labels are not big evil boogiemen if they are<br/>\nnot allowed to get bigger or more important than they<br/>\nshould be.-=-<br/>\n<br/>\n&quot;Should&quot; isn&#39;t very powerful once the label&#39;s out there.<br/>\nThings like test scores rarely go away, no matter how much parents  <br/>\nswear the score won&#39;t matter, and labels are much like test scores in  <br/>\nthat way.<br/>\n<br/>\nA child labelled against his will doesn&#39;t have a choice, and whether  <br/>\nthat label is a boogieman or not is not up to the parents.<br/>\n<br/>\nIf a parent doesn&#39;t know she might&#39;ve had an option not to use (seek/ <br/>\nwant) a label, then she might feel she has no option but to get that  <br/>\nlabel and base life around it from then on.  But once the label is  <br/>\nthere, there&#39;s no option to have lived without it.<br/>\n<br/>\n<br/>\nIf someone tries unschooling without sending a child to kindergarten,  <br/>\nhe might avoid all the unschooling it will take to recover.<br/>\nIf someone tries unschooling without labelling kids, he might avoid  <br/>\nall the (probably impossible) recovery from having been officially  <br/>\ndeclared faulty/problematical/difficult/whatever.<br/>\n<br/>\nIf someone tries unschooling and it doesn&#39;t work, school is still an  <br/>\noption.<br/>\nIf someone tries unschooling without labels and it doesn&#39;t work,  <br/>\nlabelling is still an option.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":67247159,"authorName":"Nanci Kuykendall","from":"Nanci Kuykendall &lt;aisliin@...&gt;","profile":"aisliin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"[AlwaysLearning] Labels","postDate":"1136949499","msgId":23940,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwMTExMDMxODE5LjQ1MTI2LnFtYWlsQHdlYjUxOTAzLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDExMzY3OTcyNjMuNzk5Mi4xNzU1OS5tMTVAeWFob29ncm91cHMuY29tPg=="},"prevInTopic":23939,"nextInTopic":23941,"prevInTime":23939,"nextInTime":23941,"topicId":5062,"numMessagesInTopic":0,"msgSnippet":"... -=---------------- ... be careful to qualify your statements.  You can t speak for everyone or every situation. Sorry, I wasn t meaning to.  I as","messageBody":"<div id=\"ygrps-yiv-2067675702\"><blockquote><span title=\"ireply\">&gt;&gt;   A diagnosis or label does not become an excuse<br/>\n </span></blockquote>-=----------------<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Sometimes it does become an excuse.<br/>\n&gt;So when you talk about things in broad terms, please<br/>\n </span></blockquote>be careful &gt;to qualify your statements.  You can&#39;t<br/>\nspeak for everyone or &gt;every situation.<br/>\n<br/>\nSorry, I wasn&#39;t meaning to.  I as speaking from my own<br/>\nexperience with my own family and others I&#39;ve known,<br/>\nnot meaning to make a statement about everyone,<br/>\neverywhere.  It didn&#39;t even occur to me that it would<br/>\nbe read that way.  I could have said &quot;A label doesn&#39;t<br/>\nneed (or have) to become an excuse.&quot;  But I think that<br/>\nfor myself there was never any question of using a<br/>\nlabel in that way, so I just thought about it, and so<br/>\nsaid it, differently.<br/>\n<br/>\n-=-It&#39;s VERY common for extended families<br/>\nor other peripheral people in your life to have a<br/>\ncomplete turnaround in their attitude and behavior<br/>\ntowards (for instance) your high functioning autistic<br/>\nchild when they understand that this is real, no they<br/>\nare not just &quot;a brat&quot; and you are not a bad parent or<br/>\ncrazy or something.-=-<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;That&#39;s fine, but unschooling will still work .<br/>\n<br/>\n </span></blockquote>Of course!  I certainly didn&#39;t mean to imply that it<br/>\nwouldn&#39;t.  I was just sharing ways in which a label<br/>\ncan be used positively.  The label Unschooler connects<br/>\npeople on this list, defines them partially in some<br/>\nways.  Labels are not big evil boogiemen if they are<br/>\nnot allowed to get bigger or more important than they<br/>\nshould be.  Labels can be very important tools, even<br/>\nthough they are defined (in the case of<br/>\nmedical/developmental labels) by someone else and are<br/>\nimperfect ways to communicate an idea.  Words and<br/>\nlanguage are imperfect too for that matter, and maybe<br/>\ndirect brain to brain wordless sharing complete with<br/>\npoint of view and emotion and so forth would be the<br/>\nonly way to truly, really communicate fully.  Vulcan<br/>\nMind Melds?  But we have the tools that we have, and I<br/>\ntry to use them to their potential.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Few families of ANY unschooled kid will go long<br/>\n </span></blockquote>without &gt;thinking or saying that the parents are crazy<br/>\nor bad or the kid &gt;is a brat.  That will pass, but it<br/>\nhappens to most unschooled &gt;kids and parents.<br/>\n<br/>\nYes, I&#39;ve seen this.  But with kids like mine, the<br/>\ndifferences in behavior can be strong enough that even<br/>\nother unschooling families are really weirded out and<br/>\njudgemental about it unless they have a better<br/>\nunderstanding of what they are dealing with.  Having<br/>\nthat sort of social background information that allows<br/>\nyou to know where the behaviors of another person are<br/>\ncoming from is really helpful, for them and for us. <br/>\nIt doesn&#39;t matter whether the behavior is a cultural<br/>\ndifference, a developmental difference or something<br/>\nelse.  There are not a lot of people in this world who<br/>\nare flexible enough to just roll with radically<br/>\ndifferent stuff than they are used to without some<br/>\nhelp assimilating and understanding it.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I think looking for differences is less helpful on a<br/>\n </span></blockquote>list like &gt;this than looking at similarities.<br/>\n<blockquote><span title=\"ireply\"> &gt;Sandra<br/>\n<br/>\n </span></blockquote>Fortunately I wasn&#39;t looking for differences but was<br/>\njust sharing information on a topic (Unschooling kids<br/>\nwho are &quot;atypical&quot;) that people were responding to<br/>\nwith interest.  Were I to refuse to acknowledge<br/>\nhowever that my family do es have some challenges and<br/>\ndifferences from *most* people I would not be doing<br/>\nanyone any favors, least of all us.  It&#39;s not unusual<br/>\nfor kids with undiagnosed &quot;differences&quot; to be horribly<br/>\ndepressed and have a much harder time dealing with the<br/>\nworld, both because they don&#39;t understand why things<br/>\nthat come to others are so much harder for them and by<br/>\nnot being able to benefit from a whole world of<br/>\nexperienced folks who went before and can offer tools,<br/>\nadvice and assistance.  There are extremes to<br/>\neverything of course and climbing into a label like a<br/>\nnew suit of skin isn&#39;t helpful either.  <br/>\n<br/>\nWould reinventing the wheel with unschooling all over<br/>\nagain in each and every family, rediscovering what<br/>\nworks, redefining what it is, standing alone against<br/>\nthe world feeling like the only unschooler on the<br/>\nplanet, and struggling with the bits that many others<br/>\nbefore you had already solved and could offer great<br/>\nassistance to you with, be better than gleaning from<br/>\nthe experience and knowledge of others on lists,<br/>\nforums and in books?  People are all different and I<br/>\nthink that acknowledging and learning from those<br/>\ndifferences is beneficial, at least as beneficial as<br/>\nlearning from our similarlities.  Not every child&#39;s<br/>\nunschooling journey looks the same and those<br/>\ndifferences add up to a lot of valuable information<br/>\nfor others, a goldmine of resources to draw from in my<br/>\nopinion.  Different ways that different people<br/>\ndiscover the same truths.  Just because my child&#39;s (or<br/>\nmy) behavior may or may not be something-or-other<br/>\nthat&#39;s typical of X-Y-Z label, doesn&#39;t mean that<br/>\nanother parent couldn&#39;t learn something valuable for<br/>\ntheir own unschooling journey from it.<br/>\n<br/>\nI guess I don&#39;t understand why someone (can&#39;t remember<br/>\nwho, sorry!) pointing out in a previous post that<br/>\ntheir husband had a problem that he was relieved to<br/>\nfind was associated with his functional developmental<br/>\ndifferences (autism/aspergers I believe) made people<br/>\nclose up, shut off the potential for assosciating<br/>\nthemselves or connecting themselves with that<br/>\nbehavior.  They said something like &quot;Oh I really<br/>\nrealted to that, until that word was said...&quot;  Why was<br/>\nthat so scary and alien?  Why couldn&#39;t the other list<br/>\nmembers still feel that connection to another human<br/>\nwho has a similar problem to themselves, but perhaps<br/>\nfor a different reason, and maybe to a different level<br/>\nor degree?  <br/>\n<br/>\nAutism is often described as being mostly normal type<br/>\nbehaviors, but *more than* normal, more extreme, more<br/>\nintense, etc.  Most of the behaviors could be found in<br/>\nregular folks without autism, but not to the same<br/>\ndegree or extent.  That&#39;s the main defining<br/>\ncharacteristic.  I&#39;m just curious, and learning from<br/>\nthis exploration of the emotions and ideas wrapped up<br/>\nin these apparently powerful words.  I&#39;m not judging<br/>\nanyone, in case it came out that way.<br/>\n<br/>\nNanci K.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Labels","postDate":"1136945547","msgId":23939,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdCRjQ3RENGLTVFOTEtNDBBNi04ODdCLTZEM0MxNTAxQ0JEQ0BzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PFBLRUhKR0NJR05QUEFCRlBCS0xHTUVMTkFNQUIuamFja2lAYm9hcmRwcmVwLm5ldD4=","referencesHeader":"PFBLRUhKR0NJR05QUEFCRlBCS0xHTUVMTkFNQUIuamFja2lAYm9hcmRwcmVwLm5ldD4="},"prevInTopic":23938,"nextInTopic":23940,"prevInTime":23938,"nextInTime":23940,"topicId":5062,"numMessagesInTopic":0,"msgSnippet":"... ======================== I thought they were pretty sweet in that situation too, but is that good?  If people made allowances for her and didn t say You","messageBody":"<div id=\"ygrps-yiv-366179337\">On Jan 9, 2006, at 10:45 AM, Gold Standard wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It sounds like your daughter and friends handled this girl really  <br/>\n&gt; well...she<br/>\n&gt; probably would have gotten far less patience with most people.<br/>\n<br/>\n </span></blockquote>========================<br/>\n<br/>\nI thought they were pretty sweet in that situation too, but is that  <br/>\ngood?  If people made allowances for her and didn&#39;t say &quot;You can  <br/>\nstill be nice,&quot; did they just help reinforce her idea that she didn&#39;t  <br/>\nneed to even TRY to be courteous and give other kids space and  <br/>\nopportunities?<br/>\n<br/>\n-=-Who knows when a parent should stop talking about &quot;special needs&quot;  <br/>\nbecause of<br/>\nchemotherapy?-=-<br/>\n<br/>\nThe parent should help keep the child out of situations he can&#39;t  <br/>\nhandle.  Maybe his MOST special need would be to have his mom nearby  <br/>\nuntil...  until he didn&#39;t need her anymore. &lt;g&gt;   Same with any  <br/>\nchild.  The parent of any child should keep him out of situations he  <br/>\ncan&#39;t handle, and be nearby aytime he might need her nearby.  School  <br/>\ndoesn&#39;t allow for that.  Unschooling does.<br/>\n<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Labels","postDate":"1136943630","msgId":23938,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEUxQkRCNTg1LTEyRkEtNDEwRi04RjYxLTdENDZBQjkxRDM3RUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PFBLRUhKR0NJR05QUEFCRlBCS0xHS0VMSkFNQUIuamFja2lAYm9hcmRwcmVwLm5ldD4=","referencesHeader":"PFBLRUhKR0NJR05QUEFCRlBCS0xHS0VMSkFNQUIuamFja2lAYm9hcmRwcmVwLm5ldD4="},"prevInTopic":23937,"nextInTopic":23939,"prevInTime":23937,"nextInTime":23939,"topicId":5062,"numMessagesInTopic":0,"msgSnippet":"... ================ This isn t applicable to unschooling. -=-My oldest son every now and then will say, It s because I m autistic ...but it is usually an","messageBody":"<div id=\"ygrps-yiv-1332448692\">On Jan 8, 2006, at 11:47 PM, Gold Standard wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; -=-I wonder in your example of your own life Barbara, if you had  <br/>\n&gt; known about<br/>\n&gt; dyslexia before your twenties if that would have been helpful or  <br/>\n&gt; not while<br/>\n&gt; you tried to navigate through a system that required you to read  <br/>\n&gt; potentially<br/>\n&gt; before you ready to.-=-<br/>\n<br/>\n </span></blockquote>================<br/>\n<br/>\nThis isn&#39;t applicable to unschooling.<br/>\n<br/>\n-=-My oldest son every now and then will say, &quot;It&#39;s because I&#39;m  <br/>\nautistic&quot;...but<br/>\nit is usually an informational statement for whoever he is talking to (I<br/>\nheard him answer someone who asked, &quot;Dude...why do you mumble so  <br/>\nmuch?&quot;) not<br/>\nso much why he CAN&#39;T do something. But why he is the way he is in this<br/>\ncurrent moment. He works pretty hard to get better at things that are<br/>\nchallenges to him.-=-<br/>\n<br/>\nDo those questions cause him to try not to mumble so much?<br/>\nIs that a thing that&#39;s a challenge for him?<br/>\n<br/>\nIf not, it seems he&#39;s using a condition as an excuse.<br/>\n<br/>\n-=-I thought Sandra&#39;s statement about using labels as an excuse was  <br/>\nmore geared<br/>\ntoward parents using the label as an excuse why their kids couldn&#39;t do<br/>\nsomething. That&#39;s what confused me.-=-<br/>\n<br/>\nParents using excuses are modelling using excuses.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Labels","postDate":"1136943064","msgId":23937,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEEwMEYzRTc5LUFFQzctNDAxOS05MjdCLTk4Mjc5NjkzM0M2OEBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PFBLRUhKR0NJR05QUEFCRlBCS0xHQ0VMREFNQUIuamFja2lAYm9hcmRwcmVwLm5ldD4=","referencesHeader":"PFBLRUhKR0NJR05QUEFCRlBCS0xHQ0VMREFNQUIuamFja2lAYm9hcmRwcmVwLm5ldD4="},"prevInTopic":23926,"nextInTopic":23938,"prevInTime":23936,"nextInTime":23938,"topicId":5062,"numMessagesInTopic":0,"msgSnippet":"... ============================================================ There was an example on this list, and I don t remember whose story it was.  I don t need to","messageBody":"<div id=\"ygrps-yiv-196887313\">On Jan 8, 2006, at 10:45 PM, Gold Standard wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt;&gt;Sometimes it does become an excuse.&lt;&lt;<br/>\n&gt;<br/>\n&gt; Do you have an example of this Sandra? My circles tend not to use  <br/>\n&gt; their<br/>\n&gt; children&#39;s challenges as an excuse, and I&#39;m having a hard time  <br/>\n&gt; imagining<br/>\n&gt; this.<br/>\n<br/>\n </span></blockquote>============================================================<br/>\n<br/>\nThere was an example on this list, and I don&#39;t remember whose story  <br/>\nit was.  I don&#39;t need to know who it was, so for those of you who  <br/>\nknow exactly who it was, I would very much prefer for you not to say  <br/>\n&quot;it was me&quot; or &quot;her.&quot;  It shouldn&#39;t matter who it was.<br/>\n<br/>\nSomeone said something like that she was proud of her son because he  <br/>\nwent to his [boss? leader-of-something?] and said that he was  <br/>\nthus&#39;n&#39;such a way, and that meant he would be blunt and say what he  <br/>\nthought and just tell the truth.*<br/>\n<br/>\nI know that&#39;s short and I know that&#39;s a paraphrase.<br/>\n<br/>\nIf a person knows enough to know that sometimes he says too much or  <br/>\nsays it impolitely or inappropriately, then saying &quot;I&#39;m going to do  <br/>\nthis because I can&#39;t help it,&quot; and expecting the other person to just  <br/>\nlive with tactlessness is using a condition/disability/syndrome as an  <br/>\nexcuse.  It was saying &quot;I must be excused for doing things that  <br/>\nothers would not do, or for what in others would be considered  <br/>\npurposeful insubordination&quot; (or whatever--still in the paraphrase and  <br/>\nexample-mode).<br/>\n<br/>\n<br/>\nIf I were a one-eyed driver and said &quot;Because I don&#39;t have binocular  <br/>\nvision and I&#39;m not good at spatial reasoning, I will damage your  <br/>\ntruck and other vehicles more than your other employees do,&quot; that  <br/>\nwould be quite an unreasonable excuse.  Not everyone gets to drive.<br/>\n<br/>\nIf a gambler told the landlord &quot;I will probably be behind on the  <br/>\nrent, because I have a serious gambling problem, that would not be a  <br/>\ngood excuse.  Landlords make contracts with rentors<br/>\n<br/>\n<br/>\nIt seems sometimes in discussions of children&#39;s special abilities or  <br/>\nspecial needs, the parents confuse finding them opportunities to play  <br/>\nand participate as children with some sort of lifelong license to  <br/>\nparticipate &quot;equally&quot; forever.    And is seems sometimes that people  <br/>\nconfuse a school&#39;s requirement to provide services to every child in  <br/>\nthe school district with some imagined requirement of every neighbor  <br/>\nand stranger to treat their child the same as that person would treat  <br/>\nany other child.<br/>\n<br/>\nSome adults just won&#39;t like my children because they&#39;re quick to  <br/>\nrespond, they aren&#39;t as likely as some to say &quot;Sir&quot; or &quot;Ma&#39;am,&quot; they  <br/>\nmight sing rude songs, they wear smart-aleck t-shirts sometimes  <br/>\n(often about homeschooling).  Lots of people like them.  Some people  <br/>\ndon&#39;t.  Some people would very likely prefer for them to stay away  <br/>\nfrom their school-invested children who have to do homework and go to  <br/>\nbed early or they might be grounded (etc....)<br/>\n<br/>\nI can&#39;t dictate to other people how to respond to my children or how  <br/>\nto treat my children.  If they were in public school, I could agitate  <br/>\nfor them to get special attention, but in the real world there&#39;s  <br/>\nrarely anything resembling a special education department.  Maybe  <br/>\noccupational therapists or social workers qualify in that way.<br/>\n<br/>\nAnd on a tangent from the star *, the idea that someone can just say  <br/>\n&quot;I will tell the truth&quot;  can be an excuse.  Someone who&#39;s not good at  <br/>\nknowing what&#39;s good to say when and to whom might want to consider  <br/>\nthat his perceptions might not be &quot;the truth&quot; every time.   &quot;It seems  <br/>\nto me&quot; or &quot;I feel that...&quot; is generally a better way to preface a  <br/>\nstatement than &quot;I will tell you the truth.&quot;   &quot;I was just telling the  <br/>\ntruth&quot; doesn&#39;t cover over a difference of opinion or a need to  <br/>\nunderstand that the other person in the situation might have a  <br/>\ndifferent perception and that his perception might be more objective,  <br/>\nor more important.  It happens.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":116488337,"authorName":"Gold Standard","from":"&quot;Gold Standard&quot; &lt;jacki@...&gt;","profile":"jackiknouse","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] Labels","postDate":"1136856257","msgId":23926,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFBLRUhKR0NJR05QUEFCRlBCS0xHSUVNS0FNQUIuamFja2lAYm9hcmRwcmVwLm5ldD4=","inReplyToHeader":"PHAwNjExMDQ1NmJmZTg2NDk2YTE4OUBbMTkyLjE2OC4yLjRdPg=="},"prevInTopic":23924,"nextInTopic":23937,"prevInTime":23925,"nextInTime":23927,"topicId":5062,"numMessagesInTopic":0,"msgSnippet":"... Here here!! I loved your horse analogy Barbara...made a real clear picture for me. Thanks, Jacki","messageBody":"<div id=\"ygrps-yiv-1822026096\"><blockquote><span title=\"ireply\">&gt;&gt;The best for me would have been no school at all...&lt;&lt;<br/>\n<br/>\n </span></blockquote>Here here!!<br/>\n<br/>\nI loved your horse analogy Barbara...made a real clear picture for me.  <br/>\n<br/>\nThanks,<br/>\nJacki</div>","specialLinks":[]},{"userId":41664632,"authorName":"Barbara Chase","from":"Barbara Chase &lt;bc@...&gt;","profile":"bc_avn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Labels","postDate":"1136843026","msgId":23924,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PHAwNjExMDQ1YmJmZTg4ODI3MDc4YUBbMTkyLjE2OC4yLjRdPg==","inReplyToHeader":"PGRwdWhpOCtrOHFwQGVHcm91cHMuY29tPg==","referencesHeader":"PGRwdWhpOCtrOHFwQGVHcm91cHMuY29tPg=="},"prevInTopic":23923,"nextInTopic":23926,"prevInTime":23923,"nextInTime":23925,"topicId":5062,"numMessagesInTopic":0,"msgSnippet":"... Yes, that does make sense and just reinforces my own thought that using labels because of comparisons to what others can do - whether genetically different","messageBody":"<div id=\"ygrps-yiv-468198172\"><blockquote><span title=\"ireply\">&gt;Yes, but I think there are people that DO display dyslexic tendencies<br/>\n&gt;that don&#39;t have a genetic difference like yourself.<br/>\n&gt;I think school and all their methods &quot;see&quot; dyslexia when no difference<br/>\n&gt;really exists...it causes symptoms because of the methods, not a<br/>\n&gt;difference in visual processing for the learner.<br/>\n&gt;Does that make sense?<br/>\n&gt;<br/>\n&gt;I&#39;m sure there ARE people with a genetic &quot;difference&quot; in the<br/>\n&gt;processing...but there are also a lot of symptoms being caused by<br/>\n&gt;their lame methods, where no real difference existed at all. The child<br/>\n&gt;just needed more time and freedom.<br/>\n<br/>\n </span></blockquote>Yes, that does make sense and just reinforces my own thought that using<br/>\nlabels because of comparisons to what others can do - whether genetically<br/>\ndifferent or not - just gets in the way of real learning.  We really are<br/>\nall different, and imho the more I support and nurture those differences<br/>\nthe more fun I have.<br/>\n<br/>\n<br/>\nBarbara<br/>\n<br/>\nMahalo - May you be in Divine Breath</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Labels","postDate":"1136839048","msgId":23923,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRwdWhpOCtrOHFwQGVHcm91cHMuY29tPg=="},"prevInTopic":23921,"nextInTopic":23924,"prevInTime":23922,"nextInTime":23924,"topicId":5062,"numMessagesInTopic":0,"msgSnippet":"I haven t read the studies, probably never will. But I don t buy into this conclusion. What feels more right in my own experience is that I have always been","messageBody":"<div id=\"ygrps-yiv-544552243\">&quot;I haven&#39;t read the studies, probably never will. But I don&#39;t buy into<br/>\nthis conclusion. What feels more right in my own experience is that I<br/>\nhave always been &quot;different&quot; in the way I process visual information.<br/>\nBeing pushed to read early (and being forced to use a reading method<br/>\nwhich didn&#39;t suite me at all) just made the difference more noticeable<br/>\ncompared to other kids.&quot;<br/>\n<br/>\nYes, but I think there are people that DO display dyslexic tendencies<br/>\nthat don&#39;t have a genetic difference like yourself.<br/>\nI think school and all their methods &quot;see&quot; dyslexia when no difference<br/>\nreally exists...it causes symptoms because of the methods, not a<br/>\ndifference in visual processing for the learner.<br/>\nDoes that make sense?<br/>\n<br/>\nI&#39;m sure there ARE people with a genetic &quot;difference&quot; in the<br/>\nprocessing...but there are also a lot of symptoms being caused by<br/>\ntheir lame methods, where no real difference existed at all. The child<br/>\njust needed more time and freedom.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":41664632,"authorName":"Barbara Chase","from":"Barbara Chase &lt;bc@...&gt;","profile":"bc_avn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] Labels","postDate":"1136834927","msgId":23921,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PHAwNjExMDQ1NmJmZTg2NDk2YTE4OUBbMTkyLjE2OC4yLjRdPg==","inReplyToHeader":"PFBLRUhKR0NJR05QUEFCRlBCS0xHS0VMSkFNQUIuamFja2lAYm9hcmRwcmVwLm5ldD4=","referencesHeader":"PFBLRUhKR0NJR05QUEFCRlBCS0xHS0VMSkFNQUIuamFja2lAYm9hcmRwcmVwLm5ldD4="},"prevInTopic":23919,"nextInTopic":23923,"prevInTime":23920,"nextInTime":23922,"topicId":5062,"numMessagesInTopic":0,"msgSnippet":"... No, not helpful.  I was thinking about his, and came up w/ a very strange analogy (if that s the right word...) Imagine a horse being raised in a two","messageBody":"<div id=\"ygrps-yiv-255771116\"><blockquote><span title=\"ireply\">&gt;I wonder in your example of your own life Barbara, if you had known about<br/>\n&gt;dyslexia before your twenties if that would have been helpful or not while<br/>\n&gt;you tried to navigate through a system that required you to read potentially<br/>\n&gt;before you ready to.<br/>\n<br/>\n </span></blockquote>No, not helpful.  I was thinking about his, and came up w/ a very strange<br/>\nanalogy (if that&#39;s the right word...)<br/>\n<br/>\nImagine a horse being raised in a two legged society, and everyone is<br/>\ntrying to figure out how to help the poor horse stand on two feet.  They<br/>\ncome up with all sorts of strategies to make it easier, devices to help<br/>\nsupport the back legs (because, after all, the horse was born w/ this<br/>\ndisability.)  And, most of the time the horse can stand on two feet... they<br/>\nget by.  That&#39;s how I view the labels and the treatments, especially for<br/>\ndyslexia.<br/>\n<br/>\nYes, the intervention helps the poor horse stand on two feet.  Yes, the<br/>\nintervention helps the poor child read they way they are &quot;supposed&quot; to.<br/>\nBut that&#39;s not what I would have wanted in my life.... I wanted to run!<br/>\n<br/>\nThe best for me would have been no school at all... but the next best for<br/>\nme was being able to find my own path, being able to figure out how to work<br/>\naround the system, being able to figure out that I was a horse and that<br/>\nrunning on four legs was what felt the best for me.  A label and all of the<br/>\nintervention that goes along with that would have probably stifled me for<br/>\nlife.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;There are studies, none of which I have my hands on currently, that dyslexia<br/>\n&gt;can actually be caused from forcing the brain to read before it is ready.<br/>\n<br/>\n </span></blockquote>I haven&#39;t read the studies, probably never will.  But I don&#39;t buy into this<br/>\nconclusion.  What feels more right in my own experience is that I have<br/>\nalways been &quot;different&quot; in the way I process visual information.  Being<br/>\npushed to read early (and being forced to use a reading method which didn&#39;t<br/>\nsuite me at all) just made the difference more noticeable compared to other<br/>\nkids.  That&#39;s why I think that labels based on comparisons with others just<br/>\nget in the way of noticing and being who we are, or noticing and connection<br/>\nwith who our kids are, allowing each of us to uniquely flourish.<br/>\n<br/>\n<br/>\nBarbara<br/>\n<br/>\nMahalo - May you be in Divine Breath</div>","specialLinks":[]},{"userId":116488337,"authorName":"Gold Standard","from":"&quot;Gold Standard&quot; &lt;jacki@...&gt;","profile":"jackiknouse","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] Labels","postDate":"1136828757","msgId":23919,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFBLRUhKR0NJR05QUEFCRlBCS0xHTUVMTkFNQUIuamFja2lAYm9hcmRwcmVwLm5ldD4=","inReplyToHeader":"PDZCRUI5NEQ5LTQyQjgtNEExNy05NzE4LUEyQjY5MDU5OTA5QkBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":23918,"nextInTopic":23921,"prevInTime":23918,"nextInTime":23920,"topicId":5062,"numMessagesInTopic":0,"msgSnippet":"Great example Pam! Thanks! ... This is SUCH an incredibly sad story. I can t even imagine how that mixed things up for that family. When my oldest had his","messageBody":"<div id=\"ygrps-yiv-763279815\">Great example Pam! Thanks!<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;There is a long story behind this child&#39;s problems - she&#39;d had<br/>\n&gt;&gt;leukemia at 6 years old. &lt;snip&gt; But she&#39;d had massive<br/>\n&gt;&gt;amounts of chemotherapy AND she&#39;d developed a secondary bone disease<br/>\n&gt;&gt;that had been treated with additional very strong meds -- and they&#39;d<br/>\n&gt;&gt;had an impact on her learning ability.&lt;&lt;<br/>\n<br/>\n </span></blockquote>This is SUCH an incredibly sad story. I can&#39;t even imagine how that mixed<br/>\nthings up for that family.<br/>\n<br/>\nWhen my oldest had his third open-heart surgery a year and a half ago at 15,<br/>\na procedure that went bad...lost him on the table for a bit...loss of oxygen<br/>\nbecause of it...took 9 hours to complete what was supposed to take 4...it<br/>\ntook over a year (well, it&#39;s only been a year and a half since it happened,<br/>\nso maybe we&#39;re still in recovery) for our guy to seem healthy again, and be<br/>\nmore himself. He was very confused often about the changes in his body and<br/>\nmind from that surgery...he had pretty awful long-term side effects. He was<br/>\nalso deeply depressed for a while.<br/>\n<br/>\nAs a parent in this situation, I can tell you that there is no clear line<br/>\nbetween when you say, &quot;It seems to be one of the effects of the procedure&quot;<br/>\nwhich I would say when he was feeling so badly about not being able to do<br/>\nsomething and it was most likely because of the procedure, and when you say,<br/>\n&quot;Suck it up. Move on.&quot; (a term my whole extended family uses and I<br/>\npersonally hate). I understand it is our job to keep it real with our kids<br/>\nas they learn about how to function in the world, but when you are thrown<br/>\nthese unexpected sharp curve balls, the standard navigation in parenting<br/>\nchanges dramatically. Much less charted waters to draw from.<br/>\n<br/>\nThat time was the most intensely painful experience any of my family&#39;s<br/>\nlives. The healing comes slowly over time, and knowing exactly how to handle<br/>\nall the changes in our lives because of it was very difficult. Who knows<br/>\nwhen a parent should stop talking about &quot;special needs&quot; because of<br/>\nchemotherapy? I sure don&#39;t. And I can see how easy it would be to be<br/>\nconfused about that. It seems like at that moment in time, that girl was<br/>\nusing a label in a negative way. Hopefully, someone helped to balance it out<br/>\nfor her.<br/>\n<br/>\nIt sounds like your daughter and friends handled this girl really well...she<br/>\nprobably would have gotten far less patience with most people. These outside<br/>\nexperiences will be some of the ways she learns about her behavior, I bet.<br/>\nMy son continues to learn from these outside experiences as well.<br/>\n<br/>\nThough I am happy to say that he is just thriving now, and doesn&#39;t even look<br/>\nback to the hard times!<br/>\n<br/>\nThanks,<br/>\nJacki</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Labels","postDate":"1136825853","msgId":23918,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZCRUI5NEQ5LTQyQjgtNEExNy05NzE4LUEyQjY5MDU5OTA5QkBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PFBLRUhKR0NJR05QUEFCRlBCS0xHQ0VMREFNQUIuamFja2lAYm9hcmRwcmVwLm5ldD4=","referencesHeader":"PFBLRUhKR0NJR05QUEFCRlBCS0xHQ0VMREFNQUIuamFja2lAYm9hcmRwcmVwLm5ldD4="},"prevInTopic":23915,"nextInTopic":23919,"prevInTime":23917,"nextInTime":23919,"topicId":5062,"numMessagesInTopic":0,"msgSnippet":"I ve told before about the girl who was playing in the swimming pool with two of my girls and her two sisters -- she was doing annoying things, messing up the","messageBody":"<div id=\"ygrps-yiv-1177349593\">I&#39;ve told before about the girl who was playing in the swimming pool  <br/>\nwith two of my girls and her two sisters -- she was doing annoying  <br/>\nthings, messing up the game they were trying to play by splashing  <br/>\nreally big, etc. (She wasn&#39;t the youngest of the kids, by the way,  <br/>\nshe was 9 and the kids ranged in age from 6 to 11.)<br/>\n<br/>\nSo - they were being pretty patient with her - her own sisters were  <br/>\nfirmly saying things like &quot;Lacey please stop doing that.&quot; One of my  <br/>\ndaughters pulled out a pool toy and said, &quot;Lacy if you take it a  <br/>\nlittle ways away, you can play with this.&quot; Anyway - they were making  <br/>\nan effort to make it clear to her they wanted her to stop and they  <br/>\noffered her an alternative - they&#39;d already tried to include her in  <br/>\nseveral ways.<br/>\n<br/>\nWell - finally their voices were starting get a little impatient  <br/>\nsounding - they&#39;re all VERY sweet girls - they were truly not being  <br/>\nmean or harsh with her -- but I heard her say to them, &quot;You KNOW I&#39;m  <br/>\nspecial needs and you have to be nice and let me do what I want.&quot;<br/>\n<br/>\nThere is a long story behind this child&#39;s problems - she&#39;d had  <br/>\nleukemia at 6 years old. Before that she was in school and reading  <br/>\nreally well and clearly very bright. All five of her siblings were  <br/>\nschool successes, if you know what I mean. But she&#39;d had massive  <br/>\namounts of chemotherapy AND she&#39;d developed a secondary bone disease  <br/>\nthat had been treated with additional very strong meds -- and they&#39;d  <br/>\nhad an impact on her learning ability. After a year and a half out of  <br/>\nschool, she went back and had lots of trouble and was diagnosed with  <br/>\nall kinds of learning disabilities.<br/>\n<br/>\nAnyway - yes, I heard her MANY times use &quot;I am special needs&quot; as an  <br/>\nexcuse for being rude and demanding and so on. I don&#39;t know how that  <br/>\nwas being nurtured in her family, but it clearly was happening.<br/>\n<br/>\nThat is just one example - but it was very extreme and specific.<br/>\n<br/>\n-pam<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Jan 8, 2006, at 9:45 PM, Gold Standard wrote:<br/>\n<br/>\n&gt;&gt;   A diagnosis or label does not become<br/>\n&gt;&gt; an excuse<br/>\n&gt;<br/>\n&gt;&gt;&gt; Sometimes it does become an excuse.&lt;&lt;<br/>\n&gt;<br/>\n&gt; Do you have an example of this Sandra? My circles tend not to use  <br/>\n&gt; their<br/>\n&gt; children&#39;s challenges as an excuse, and I&#39;m having a hard time  <br/>\n&gt; imagining<br/>\n&gt; this.<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":116488337,"authorName":"Gold Standard","from":"&quot;Gold Standard&quot; &lt;jacki@...&gt;","profile":"jackiknouse","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] Labels","postDate":"1136789231","msgId":23915,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFBLRUhKR0NJR05QUEFCRlBCS0xHS0VMSkFNQUIuamFja2lAYm9hcmRwcmVwLm5ldD4=","inReplyToHeader":"PHAwNjExMDQ1M2JmZTdhYWJlNTExM0BbMTkyLjE2OC4yLjRdPg=="},"prevInTopic":23914,"nextInTopic":23918,"prevInTime":23914,"nextInTime":23916,"topicId":5062,"numMessagesInTopic":0,"msgSnippet":"... I think this is a really great example of self-fulfilling prophecy . And at the same time it is hard to isolate it away from schooling too, as you ","messageBody":"<div id=\"ygrps-yiv-1123252735\"><blockquote><span title=\"ireply\">&gt;&gt;I&#39;ve known three teenagers who are dyslexic, and each of<br/>\n&gt;&gt;them do use this label as a reason why they *can&#39;t* do things,&lt;&lt;<br/>\n<br/>\n </span></blockquote>I think this is a really great example of &quot;self-fulfilling prophecy&quot;. And at<br/>\nthe same time it is hard to isolate it away from schooling too, as you<br/>\nmentioned.<br/>\n<br/>\nI wonder in your example of your own life Barbara, if you had known about<br/>\ndyslexia before your twenties if that would have been helpful or not while<br/>\nyou tried to navigate through a system that required you to read potentially<br/>\nbefore you ready to.<br/>\n<br/>\nThere are studies, none of which I have my hands on currently, that dyslexia<br/>\ncan actually be caused from forcing the brain to read before it is ready.<br/>\nSchool is REALLY good at that!<br/>\n<br/>\nMy oldest son every now and then will say, &quot;It&#39;s because I&#39;m autistic&quot;...but<br/>\nit is usually an informational statement for whoever he is talking to (I<br/>\nheard him answer someone who asked, &quot;Dude...why do you mumble so much?&quot;) not<br/>\nso much why he CAN&#39;T do something. But why he is the way he is in this<br/>\ncurrent moment. He works pretty hard to get better at things that are<br/>\nchallenges to him.<br/>\n<br/>\nIf he was in school and was told he was autistic, it may have had a very<br/>\ndifferent effect on him, and may have given some of that &quot;self-fulfilling<br/>\nprophecy&quot;. Eww.<br/>\n<br/>\nI thought Sandra&#39;s statement about using labels as an excuse was more geared<br/>\ntoward parents using the label as an excuse why their kids couldn&#39;t do<br/>\nsomething. That&#39;s what confused me.<br/>\n<br/>\nThanks!<br/>\nJacki</div>","specialLinks":[]},{"userId":116488337,"authorName":"Gold Standard","from":"&quot;Gold Standard&quot; &lt;jacki@...&gt;","profile":"jackiknouse","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] Labels","postDate":"1136788178","msgId":23914,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFBLRUhKR0NJR05QUEFCRlBCS0xHT0VMSUFNQUIuamFja2lAYm9hcmRwcmVwLm5ldD4=","inReplyToHeader":"PHAwNjExMDQ1M2JmZTdhYWJlNTExM0BbMTkyLjE2OC4yLjRdPg=="},"prevInTopic":23913,"nextInTopic":23915,"prevInTime":23913,"nextInTime":23915,"topicId":5062,"numMessagesInTopic":0,"msgSnippet":"Thanks Barbara! Jacki ... From: AlwaysLearning@yahoogroups.com [mailto:AlwaysLearning@yahoogroups.com]On Behalf Of Barbara Chase Sent: Sunday, January 08, 2006","messageBody":"<div id=\"ygrps-yiv-947496527\">Thanks Barbara! <br/>\n<br/>\nJacki<br/>\n<br/>\n-----Original Message-----<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\n[mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>]On Behalf Of Barbara Chase<br/>\nSent: Sunday, January 08, 2006 11:14 PM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nSubject: RE: [AlwaysLearning] Labels<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;   A diagnosis or label does not become an excuse<br/>\n&gt;<br/>\n&gt;&gt;&gt;Sometimes it does become an excuse.&lt;&lt;<br/>\n&gt;<br/>\n&gt;Do you have an example of this Sandra? My circles tend not to use their<br/>\n&gt;children&#39;s challenges as an excuse, and I&#39;m having a hard time imagining<br/>\n&gt;this.<br/>\n<br/>\n </span></blockquote>I have an example... but I&#39;m wondering if it&#39;s an example of the label or<br/>\nthe schooling.  I&#39;ve known three teenagers who are dyslexic, and each of<br/>\nthem do use this label as a reason why they *can&#39;t* do things, like learn<br/>\nor read or even to be motivated to do something really fun which is a bit<br/>\nchallenging.<br/>\n<br/>\nNow I happen to be dyslexic too, but I didn&#39;t know anything about it until<br/>\nI was in my mid 20s.  When I struggled to read, instead of leaning on an<br/>\nexcuse I found ways to do the school assignments without reading.  I became<br/>\ncreative and inventive and worked around the system, while still being<br/>\nstuck in it.  I didn&#39;t know that I couldn&#39;t...  I also didn&#39;t know that I<br/>\n*could* read well until my mid 30s, which is when the school&#39;s method<br/>\nfinally left me.  But that&#39;s definitely a schooling issue...<br/>\n<br/>\nSo I guess it depends on how much school history a person still has<br/>\ninfluencing them.  Even though we are all unschoolers, some of us still<br/>\nhave the school thinking coming through more strongly...  In other words,<br/>\nif the unschooling parent is still struggling w/ some of the school<br/>\nthinking then a label like dyslexia might be hard for them to ignore.  They<br/>\nmight be inclined to &quot;help&quot; their child w/ intervention and programs for<br/>\ndyslexics so that their child won&#39;t be at a disadvantage (all of which are<br/>\nprobably designed for the sole purpose of having the schooled child stay on<br/>\ntrack w/ all of the other schooled children.)  Someone who is farther on<br/>\nthe unschooling path, who has been able to shed more of those school<br/>\nthoughts wouldn&#39;t be as phased by the label.  For them, it probably won&#39;t<br/>\nbecome an excuse.  It probably won&#39;t even come up at all, unless they want<br/>\nto get the relatives off their backs.<br/>\n<br/>\n<br/>\nBarbara<br/>\n<br/>\nMahalo - May you be in Divine Breath<br/>\n<br/>\n<br/>\n <br/>\nYahoo! Groups Links</div>","specialLinks":[]},{"userId":41664632,"authorName":"Barbara Chase","from":"Barbara Chase &lt;bc@...&gt;","profile":"bc_avn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] Labels","postDate":"1136787261","msgId":23913,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PHAwNjExMDQ1M2JmZTdhYWJlNTExM0BbMTkyLjE2OC4yLjRdPg==","inReplyToHeader":"PFBLRUhKR0NJR05QUEFCRlBCS0xHQ0VMREFNQUIuamFja2lAYm9hcmRwcmVwLm5ldD4=","referencesHeader":"PFBLRUhKR0NJR05QUEFCRlBCS0xHQ0VMREFNQUIuamFja2lAYm9hcmRwcmVwLm5ldD4="},"prevInTopic":23911,"nextInTopic":23914,"prevInTime":23912,"nextInTime":23914,"topicId":5062,"numMessagesInTopic":0,"msgSnippet":"... I have an example... but I m wondering if it s an example of the label or the schooling.  I ve known three teenagers who are dyslexic, and each of them do","messageBody":"<div id=\"ygrps-yiv-1916231451\"><blockquote><span title=\"ireply\">&gt;&gt;   A diagnosis or label does not become an excuse<br/>\n&gt;<br/>\n&gt;&gt;&gt;Sometimes it does become an excuse.&lt;&lt;<br/>\n&gt;<br/>\n&gt;Do you have an example of this Sandra? My circles tend not to use their<br/>\n&gt;children&#39;s challenges as an excuse, and I&#39;m having a hard time imagining<br/>\n&gt;this.<br/>\n<br/>\n </span></blockquote>I have an example... but I&#39;m wondering if it&#39;s an example of the label or<br/>\nthe schooling.  I&#39;ve known three teenagers who are dyslexic, and each of<br/>\nthem do use this label as a reason why they *can&#39;t* do things, like learn<br/>\nor read or even to be motivated to do something really fun which is a bit<br/>\nchallenging.<br/>\n<br/>\nNow I happen to be dyslexic too, but I didn&#39;t know anything about it until<br/>\nI was in my mid 20s.  When I struggled to read, instead of leaning on an<br/>\nexcuse I found ways to do the school assignments without reading.  I became<br/>\ncreative and inventive and worked around the system, while still being<br/>\nstuck in it.  I didn&#39;t know that I couldn&#39;t...  I also didn&#39;t know that I<br/>\n*could* read well until my mid 30s, which is when the school&#39;s method<br/>\nfinally left me.  But that&#39;s definitely a schooling issue...<br/>\n<br/>\nSo I guess it depends on how much school history a person still has<br/>\ninfluencing them.  Even though we are all unschoolers, some of us still<br/>\nhave the school thinking coming through more strongly...  In other words,<br/>\nif the unschooling parent is still struggling w/ some of the school<br/>\nthinking then a label like dyslexia might be hard for them to ignore.  They<br/>\nmight be inclined to &quot;help&quot; their child w/ intervention and programs for<br/>\ndyslexics so that their child won&#39;t be at a disadvantage (all of which are<br/>\nprobably designed for the sole purpose of having the schooled child stay on<br/>\ntrack w/ all of the other schooled children.)  Someone who is farther on<br/>\nthe unschooling path, who has been able to shed more of those school<br/>\nthoughts wouldn&#39;t be as phased by the label.  For them, it probably won&#39;t<br/>\nbecome an excuse.  It probably won&#39;t even come up at all, unless they want<br/>\nto get the relatives off their backs.<br/>\n<br/>\n<br/>\nBarbara<br/>\n<br/>\nMahalo - May you be in Divine Breath</div>","specialLinks":[]},{"userId":116488337,"authorName":"Gold Standard","from":"&quot;Gold Standard&quot; &lt;jacki@...&gt;","profile":"jackiknouse","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] Labels","postDate":"1136785509","msgId":23911,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFBLRUhKR0NJR05QUEFCRlBCS0xHQ0VMREFNQUIuamFja2lAYm9hcmRwcmVwLm5ldD4=","inReplyToHeader":"PEM1MDM0RTlGLTg1MjItNDg5NS1BMjlFLUIxNENCNTkzRTcxOEBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":23909,"nextInTopic":23913,"prevInTime":23910,"nextInTime":23912,"topicId":5062,"numMessagesInTopic":0,"msgSnippet":"... Do you have an example of this Sandra? My circles tend not to use their children s challenges as an excuse, and I m having a hard time imagining this. ... ","messageBody":"<div id=\"ygrps-yiv-1901165064\">On Jan 8, 2006, at 6:44 PM, Nanci Kuykendall wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;   A diagnosis or label does not become<br/>\n&gt; an excuse<br/>\n<br/>\n&gt;&gt;Sometimes it does become an excuse.&lt;&lt;<br/>\n<br/>\n </span></blockquote>Do you have an example of this Sandra? My circles tend not to use their<br/>\nchildren&#39;s challenges as an excuse, and I&#39;m having a hard time imagining<br/>\nthis.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;That&#39;s fine, but unschooling will still work .&lt;&lt;<br/>\n<br/>\n </span></blockquote>Yes! Yes! I can vouch for this (as can many I&#39;m sure)! Unschooling kept all<br/>\nfour of my children whole and shining as who they are. I hope nobody reading<br/>\nthis thread or any of the posts here would think because their child may<br/>\nhave some extra kind of attention/physical/emotional needs, that they<br/>\ncouldn&#39;t unschool! It is SOOOO the opposite! Unschooling rocks for all!<br/>\n<br/>\nThanks,<br/>\nJacki</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Labels","postDate":"1136774203","msgId":23909,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM1MDM0RTlGLTg1MjItNDg5NS1BMjlFLUIxNENCNTkzRTcxOEBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDIwMDYwMTA5MDE0NDIyLjY1OTk3LnFtYWlsQHdlYjUxOTAxLm1haWwueWFob28uY29tPg==","referencesHeader":"PDIwMDYwMTA5MDE0NDIyLjY1OTk3LnFtYWlsQHdlYjUxOTAxLm1haWwueWFob28uY29tPg=="},"prevInTopic":23907,"nextInTopic":23911,"prevInTime":23908,"nextInTime":23910,"topicId":5062,"numMessagesInTopic":0,"msgSnippet":"... -=---------------- Sometimes it does become an excuse. So when you talk about things in broad terms, please be careful to qualify your statements.  You","messageBody":"<div id=\"ygrps-yiv-1357992863\">On Jan 8, 2006, at 6:44 PM, Nanci Kuykendall wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;   A diagnosis or label does not become<br/>\n&gt; an excuse<br/>\n<br/>\n </span></blockquote>-=----------------<br/>\n<br/>\nSometimes it does become an excuse.<br/>\nSo when you talk about things in broad terms, please be careful to  <br/>\nqualify your statements.  You can&#39;t speak for everyone or every  <br/>\nsituation.<br/>\n<br/>\n-=-It&#39;s VERY common for extended families<br/>\nor other peripheral people in your life to have a<br/>\ncomplete turnaround in their attitude and behavior<br/>\ntowards (for instance) your high functioning autistic<br/>\nchild when they understand that this is real, no they<br/>\nare not just &quot;a brat&quot; and you are not a bad parent or<br/>\ncrazy or something.-=-<br/>\n<br/>\nThat&#39;s fine, but unschooling will still work .<br/>\n<br/>\nFew families of ANY unschooled kid will go long without thinking or  <br/>\nsaying that the parents are crazy or bad or the kid is a brat.  That  <br/>\nwill pass, but it happens to most unschooled kids and parents.<br/>\n<br/>\nI think looking for differences is less helpful on a list like this  <br/>\nthan looking at similarities.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":67247159,"authorName":"Nanci Kuykendall","from":"Nanci Kuykendall &lt;aisliin@...&gt;","profile":"aisliin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"[AlwaysLearning] Labels","postDate":"1136771062","msgId":23907,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwMTA5MDE0NDIyLjY1OTk3LnFtYWlsQHdlYjUxOTAxLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDExMzY3NDg5NjQuNTM1Ljg3Mjc4Lm0xOEB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":5062,"nextInTopic":23909,"prevInTime":23906,"nextInTime":23908,"topicId":5062,"numMessagesInTopic":0,"msgSnippet":"... so you have some information on the side.  It s not something adoption and lots of love can overcome entirely. ... This is the same reason that","messageBody":"<div id=\"ygrps-yiv-66087064\"><blockquote><span title=\"ireply\">&gt;It&#39;s worth reading about Fetal Alcohol Syndrome just<br/>\n </span></blockquote>so you &gt;have some information on the side.  It&#39;s not<br/>\nsomething adoption &gt;and lots of love can overcome<br/>\nentirely.<br/>\n<blockquote><span title=\"ireply\"> &gt;Sandra<br/>\n<br/>\n </span></blockquote>This is the same reason that identification (labeling)<br/>\nof developmental or other differences can and does<br/>\nprovide a lot of help, for those they are applied to<br/>\nand for those they live with.  As a parent it gives<br/>\nyou a whole new toolbox to look into, new places to<br/>\nlook for ideas and answers to behaviors that may be<br/>\ntotally baffling to you and are hurting your life or<br/>\nrelationship with the person affected or in question. <br/>\nIt gives you a way to connect yourself to others who<br/>\nare struggling with similar challenges to network and<br/>\nhelp each other, or just find understanding friends. <br/>\nIt&#39;s a huge relief also to know that your child&#39;s<br/>\nchallenges are not because you&#39;re doing a horrible job<br/>\nas a parent.  The hard work you do of parenting<br/>\ndifferently challenged kids can be recognized and<br/>\nacknowledged as well, even if just in your own heart. <br/>\n<br/>\n<br/>\nFor a person to whom the lables might apply they help<br/>\nyou to understand yourself and your own needs better,<br/>\nhelp you to meet those needs better and create coping<br/>\nmechanisms that are healthy and positive while not<br/>\nthinking you are broken or stupid or what have you. <br/>\nKnowing there is a reason for your thoughts, feelings<br/>\nor actions can be extremely reassuring and emotionally<br/>\na huge relief.  A diagnosis or label does not become<br/>\nan excuse, but it is a *reason* that can be looked at<br/>\nand studied and addressed.  It&#39;s a starting point.<br/>\n<br/>\nFor dealing with other, including extended families,<br/>\nhaving some labels can help you to lead them to<br/>\ninformation to help them understand the affected<br/>\nperson better and to be more tolerant and accepting of<br/>\ntheir needs.  It&#39;s VERY common for extended families<br/>\nor other peripheral people in your life to have a<br/>\ncomplete turnaround in their attitude and behavior<br/>\ntowards (for instance) your high functioning autistic<br/>\nchild when they understand that this is real, no they<br/>\nare not just &quot;a brat&quot; and you are not a bad parent or<br/>\ncrazy or something.  While there is something to be<br/>\nsaid for writing off those unwilling to accept and<br/>\nlove your family as they are, there is also much to be<br/>\nsaid to meet them halfway by providing information<br/>\nthey can understand and allowing them to learn through<br/>\nthat method what you have learned by living with the<br/>\naffected person(s.)<br/>\n<br/>\nAfter all, even a ton of &quot;normal&quot; social behaviors can<br/>\nlook totally bizarre and have an adverse affect on<br/>\npeople socially if you don&#39;t have background<br/>\ninformation about the behaviors or about the person<br/>\ndoing them.<br/>\n<br/>\nNanci K.</div>","specialLinks":[]},{"userId":73238415,"authorName":"Julie Stauffer","from":"&quot;Julie Stauffer&quot; &lt;jnjstau@...&gt;","profile":"jnjstau","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Labels","postDate":"1014313093","msgId":5062,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMGYwMWMxYmFmZSQ5MmE5MWFhMCRjNWE2YjFkOEBkZWZhdWx0Pg==","referencesHeader":"PDEwMTQyMzU1NTMuNTQzOC42NjQ4Lm0xMEB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":23907,"prevInTime":5061,"nextInTime":5063,"topicId":5062,"numMessagesInTopic":0,"msgSnippet":" I did that this summer for Marsie (5) who really wants to learn to read. The kids looked at them for a couple of days.  We played","messageBody":"<div id=\"ygrps-yiv-1048869890\">&lt;&lt;Labels everywhere&gt;&gt;<br/>\n<br/>\nI did that this summer for Marsie (5) who really wants to learn to read.<br/>\nThe kids looked at them for a couple of days.  We played treasure hunt with<br/>\nclues taking you from label to label, etc..  Then the kids didn&#39;t seem to<br/>\npay any attention to them at all.<br/>\n<br/>\nI was gone with Adriane and Zach to a stock show over the weekend and when I<br/>\ngot back, Dh had removed all labels, declaring that his compulsive heart<br/>\ncouldn&#39;t stand the clutter anymore.  He had asked Marsie if it was OK with<br/>\nher and she said sure, that she could now read (this was news to us).  Dh<br/>\nheld up a card and asked her what it said and she gave him the correct<br/>\nresponse.<br/>\n<br/>\nApparently she was soaking it up even if it didn&#39;t look like it.<br/>\n<br/>\nJulie</div>","specialLinks":[]}],"prevTopicId":38110,"nextTopicId":38063}}