{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":46,"messages":[{"userId":141316284,"authorName":"pam sorooshian","from":"pam sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] A cry for perspective....","postDate":"1075914248","msgId":90249,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI1NUNFMTFDLTU3MzQtMTFEOC1BM0RFLTAwMEE5NUUyOTJDNkBtYWMuY29tPg==","inReplyToHeader":"PGFhLjI3YjM3ZjRlLjJkNTExZjk5QGFvbC5jb20+","referencesHeader":"PGFhLjI3YjM3ZjRlLjJkNTExZjk5QGFvbC5jb20+"},"prevInTopic":90248,"nextInTopic":90250,"prevInTime":90248,"nextInTime":90250,"topicId":90172,"numMessagesInTopic":0,"msgSnippet":"... It sounds pretty normal to me. Kids who are the better players get to play more on competitive sports teams. If he played recreational AYSO soccer, they d","messageBody":"<div id=\"ygrps-yiv-1347134675\">On Feb 3, 2004, at 8:00 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:BonKnit@...\">BonKnit@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My DH thinks I should let it go, I am gagging on it. I do not want to <br/>\n&gt; call<br/>\n&gt; and scream at them, I want to call and explain how this all looks from <br/>\n&gt; another<br/>\n&gt; POV.  My son has signed up to play baseball with pretty much the same <br/>\n&gt; people<br/>\n&gt; and I am trying to find a way to get through this.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>It sounds pretty normal to me. Kids who are the better players get to <br/>\nplay more on competitive sports teams.<br/>\n<br/>\nIf he played recreational AYSO soccer, they&#39;d always let him play half <br/>\nthe game (and probably 3/4 of the game). That&#39;s a rule and the motto of <br/>\nthe organization, &quot;Everyone plays.&quot;<br/>\n<br/>\nBut the reason they HAVE that rule and that motto is in response to <br/>\nother sports organizations where that is pretty much never true.<br/>\n<br/>\nAnd sitting out more because he missed that week&#39;s practices is also <br/>\nnormal. I think if you think of this from the point of view of the <br/>\ncoach who can&#39;t &quot;coach&quot; kids who aren&#39;t at practice, that it&#39;ll make <br/>\nsense to you that kids who come to games but not practices shouldn&#39;t <br/>\nget as much play time.<br/>\n<br/>\nI&#39;m sorry that the coach favors his own kid, but sometimes there are <br/>\nthings you don&#39;t know. For example, isn&#39;t it nice that he&#39;s letting his <br/>\nkid have a chance to cry in private? I&#39;m always happy to see a coach be <br/>\nKIND to a kid, not think the kid needs to &quot;get tough.&quot; And that he <br/>\npulls the weaker players in and out as subs when his kid needs to get <br/>\nout for a few minutes, to cry or recover his composure, makes perfect <br/>\nsense to me. That&#39;s how sports are - stronger players get more play <br/>\ntime, weaker players are used as subs.<br/>\n<br/>\nI would pull my kids off sports teams when the coach was too harsh, too <br/>\nverbally insulting and my child was unhappy. I pulled my oldest <br/>\ndaughter off a soccer team once when the coach had them run around and <br/>\naround a track before every practice and insulted my daughter <br/>\nthroughout the whole ordeal, yelling, &quot;Sorooshian, get your butt in <br/>\ngear,&quot; and &quot;Sorooshian, they&#39;re lapping you AGAIN!!!&quot;<br/>\n<br/>\nMy daughter was about 9 and kind of pudgy and NOT fast at running. She <br/>\nwas a really good soccer player and loved it, and was known as &#39;big <br/>\nfoot&#39; for her great kicks. This coach was under the impression that <br/>\nmaking fun of her and humiliating her because she couldn&#39;t keep up when <br/>\nthe team was running would encourage her to run more and lose some <br/>\nweight and become an even better player. What it did was make her <br/>\nmiserable enough to decide to quit playing soccer altogether.<br/>\n<br/>\nThere are quite a few really bad coaches around, but I&#39;d be careful as <br/>\na mom, about making that call FOR my kid. You&#39;re talking about actual <br/>\ncoaching decisions and that ought to be left up to the coach, within <br/>\nthe rules of the organization. You didn&#39;t say he is being abusive in <br/>\nany way, just letting stronger players play more and kids who miss <br/>\npractice play less. That&#39;s absolutely normal for sports teams. Kids on <br/>\na team usually can totally accept that the strongest players play more <br/>\n- they are usually very realistic about their own skills relative to <br/>\nothers on the team. In fact, isn&#39;t that part of learning from being on <br/>\na team - to contribute your part, to learn from those who have more <br/>\nskills, etc?<br/>\n<br/>\nIf you talk to the coach about this, I think you&#39;d be out of line and <br/>\nyou&#39;ll either be ignored or resented. Worst case is that some of that <br/>\nresentment will be taken out on your child.<br/>\n<br/>\nON the other hand, if you son is complaining that he wants to play <br/>\nmore, there is nothing wrong with HIM discussing that with the coach, <br/>\nsaying he is committed to the team and intends to show that by working <br/>\nhard in practices (has to BE there to work hard) and that he hopes that <br/>\nby showing that commitment to improving his skills that he&#39;ll get more <br/>\nplay time too. A coach would be much more inclined to respond <br/>\npositively to that kind of approach than to a mom complaining that her <br/>\nson isn&#39;t getting to play enough.<br/>\n<br/>\nAlso, I&#39;d add to this, LISTEN to your husband when it comes to this <br/>\nstuff. Dads sometimes have a much better grasp on the reality of sports <br/>\nteams than moms do. (NOT always, I know....)<br/>\n<br/>\nMaybe to help yourself see things a bit differently, you need to list, <br/>\nfor yourself, the learning he gets from being on the team. It isn&#39;t all <br/>\nabout getting to play, I bet.<br/>\n<br/>\n-pam<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n </span></blockquote>National Home Education Network<br/>\n&lt;www.NHEN.org&gt;<br/>\nServing the entire homeschooling community since 1999<br/>\nthrough information, networking and public relations.</div>","specialLinks":[]},{"userId":73238415,"authorName":"J. Stauffer","from":"&quot;J. Stauffer&quot; &lt;jnjstau@...&gt;","profile":"jnjstau","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] A cry for perspective....","postDate":"1075908838","msgId":90248,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMWIwMWMzZWIzNCQ0ZjQzZGM2MCQ5NDgwZWU0MEB5b3VybzBrd2t3OWp3Yz4=","referencesHeader":"PDFjNi4xNGIyNTc3MC4yZDUxNWNkM0Bhb2wuY29tPg=="},"prevInTopic":90245,"nextInTopic":90249,"prevInTime":90247,"nextInTime":90249,"topicId":90172,"numMessagesInTopic":0,"msgSnippet":"... pro sport.   One thing our Little League does around here that I like, is that they have 2 seasons.  Fall Ball is super fair, little pressure to","messageBody":"<div id=\"ygrps-yiv-1945781802\">&lt;&lt;&lt;&lt; Being on<br/>\n<blockquote><span title=\"ireply\"> &gt; different tracks.  For some kids it is their ultimate dream to play some<br/>\n </span></blockquote>pro sport.  &gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nOne thing our Little League does around here that I like, is that they have<br/>\n2 seasons.  Fall Ball is super fair, little pressure to perform to a<br/>\nstandard, just everybody learn and have fun.....The coaches think of it as<br/>\nan instructional league.<br/>\n<br/>\nSpring Ball is Little League in all its glory and gore, everybody plays but<br/>\nsome may only play an inning.  You miss practice, you sit.  You goof around<br/>\n, you sit, .....those kinds of things.<br/>\n<br/>\nThen we also have what we call competitive teams.  These are the kids that<br/>\nLIVE baseball.  They travel to different towns, many have batting cages at<br/>\ntheir homes, etc..<br/>\n<br/>\nThis way people can choose their track.<br/>\n<br/>\nJulie S.</div>","specialLinks":[]},{"userId":8151304,"authorName":"rubyprincesstsg@aol.com","from":"rubyprincesstsg@...","profile":"rubyprincesstsg","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] A cry for perspective....","postDate":"1075905796","msgId":90244,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGMuMjE2ZDU0ODkuMmQ1MjVmMDRAYW9sLmNvbT4="},"prevInTopic":90243,"nextInTopic":90245,"prevInTime":90243,"nextInTime":90245,"topicId":90172,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/3/2004 10:14:23 PM Eastern Standard Time, ddzimlew@juno.com writes: He d think me a more than a little strange if I hated to sit there but","messageBody":"<div id=\"ygrps-yiv-29737390\">In a message dated 2/3/2004 10:14:23 PM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ddzimlew@...\">ddzimlew@...</a> writes:<br/>\nHe&#39;d think me<br/>\na more than a little strange if I hated to sit there but did it anyway<br/>\nand made sure I told him it was because I loved him.   That would be<br/>\nmanipulative and warped and he understands that right now and would have<br/>\nfour years ago, too. <br/>\n<br/>\n<br/>\n<br/>\nFirst, I didn&#39;t HATE to be there.  I LOVE watching my son doing something he <br/>\nabsolutely loves.  He knows this.  I didn&#39;t sit at practices which I&#39;m <br/>\nguessing would be like the Martial Art classes.  I&#39;m sure you wouldn&#39;t miss one of <br/>\nhis meets(?) if you could help it, if it was important to your son.  Even if you <br/>\ndid, he might not be the one that remembers you not being there years later.  <br/>\nMaybe because to my son, baseball is his passion.  He&#39;s been pretty much one <br/>\ntracked about that since, I guess before he was three. <br/>\n<br/>\nMy other children have a variety of things they do.  John has played <br/>\nbasketball but he never really cared much if I was there or not, it just wasn&#39;t <br/>\nimportant.<br/>\n<br/>\nI don&#39;t think in his mind it was about where I was or why, to him I just wasn&#39;<br/>\nt there.  It isn&#39;t about manipulation at all.  He&#39;s not trying to manipulate <br/>\nanything.  In the heat of anger he&#39;s thinking of something to say to hurt me <br/>\nor let me know he&#39;s really angry.  He used to RAGE when he was little.  He <br/>\ndoesn&#39;t do that so much anymore, if at all.<br/>\n<br/>\nSome children just scream out &quot;I HATE YOU&quot;, to their parent.  I know I wanted <br/>\nto say it to my parents when I was young.  Some say other things when they <br/>\nare angry, some say nothing and sulk.<br/>\n<br/>\nI&#39;m guessing that if he tried really hard he could come up with lots of <br/>\nthings other than missing baseball games that have hurt him. I think to him it&#39;s a <br/>\nsymbol of sorts to say this thing to me.  I know he&#39;s needing more of my <br/>\nattention and that I need to stop and really hear him.  Sometimes when are children <br/>\nare nearly grown (he&#39;s 19) and fairly independent and yet he still needs to <br/>\nfeel connected at a basic level, sometimes more than others.  The basics of <br/>\ngrowing up and pulling away and then learning to come back.  He hasn&#39;t had that <br/>\n&quot;going away&quot; part yet.  He still lives at home and goes to Community College. <br/>\n<br/>\nSaying I missed two baseball games is really about a lot more than just <br/>\nbaseball games.  If we were having just a regular conversation he would find it <br/>\njust as irrational as most everyone here does.  Most times these days it&#39;s about <br/>\nI&#39;m really angry and I think I just need a hug and a good cry, a reconnection <br/>\nof sorts.  Something 19 year old boys sometimes have a hard time expressing.<br/>\n<br/>\nI do appreciate all the comments I&#39;ve gotten from everyone.  I&#39;ve thought <br/>\nabout it a lot more than usual and while I KNOW it was never really about the <br/>\nmissed games, today I&#39;m going to ask him about those two games and what he <br/>\nremembers about those days (besides me not being there) and really HEAR about them.  <br/>\n<br/>\nThanks again,<br/>\n<br/>\nglena <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":8151304,"authorName":"rubyprincesstsg@aol.com","from":"rubyprincesstsg@...","profile":"rubyprincesstsg","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] A cry for perspective....","postDate":"1075903619","msgId":90245,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFkOS4xOWE0MzQxMy4yZDUyNTY4M0Bhb2wuY29tPg=="},"prevInTopic":90244,"nextInTopic":90248,"prevInTime":90244,"nextInTime":90246,"topicId":90172,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/3/2004 11:33:42 PM Eastern Standard Time, SandraDodd@aol.com writes: It seems perhaps you re saying that a mother who doesn t go to every","messageBody":"<div id=\"ygrps-yiv-12158499\">In a message dated 2/3/2004 11:33:42 PM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> writes:<br/>\nIt seems perhaps you&#39;re saying that a mother who doesn&#39;t go to every game, or <br/>\nat least sit in the car the day after giving birth, doesn&#39;t love her children <br/>\nand doesn&#39;t care what&#39;s important to thim.  I don&#39;t think that&#39;s at all true<br/>\n<br/>\n<br/>\n<br/>\nThat&#39;s not true at all.  There are many reasons parents can&#39;t be at games.  <br/>\nI&#39;ve missed games.  Sometimes it can&#39;t be helped.  I also know some children <br/>\nwho REALLY don&#39;t want their parents at their games.  It&#39;s THEIR time.  I know <br/>\nsome children who cry because they mom or dad SAID they would be there and <br/>\ndidn&#39;t show up.<br/>\n<br/>\nFor some children sports are just another part of many things they do, it&#39;s <br/>\nnot that important, or at least not one of the top important things in their <br/>\nlives.  To some children it is very important and they want to share it with <br/>\ntheir parents.<br/>\n<br/>\nI think a parent is the best judge of their own child.  I certainly do not <br/>\nbelieve that if a parent misses a child&#39;s baseball or football game or whatever <br/>\nevent that the parent doesn&#39;t love their children or care what&#39;s important to <br/>\nthem.  The way my son uses that as a weapon when he&#39;s angry would seem to <br/>\nindicate that he feels I let him down or missed out on something really important <br/>\nin his childhood those two days.  Those two days stick out in his mind vividly.<br/>\n<br/>\nI think I will ask him today what happened on those days besides me not <br/>\n&quot;seeing&quot; him play.  Even though I got play by plays at the time from him.  Maybe <br/>\nthere is more he&#39;d like to tell me.  He does seemed pained by this and he is 19, <br/>\nthere must be something more than me just missing the game.<br/>\n<br/>\nglena<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":8151304,"authorName":"rubyprincesstsg@aol.com","from":"rubyprincesstsg@...","profile":"rubyprincesstsg","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] A cry for perspective....","postDate":"1075902760","msgId":90243,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQzLjI3NmIwMTE1LjJkNTI1MzI4QGFvbC5jb20+"},"prevInTopic":90241,"nextInTopic":90244,"prevInTime":90242,"nextInTime":90244,"topicId":90172,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/4/2004 7:16:53 AM Eastern Standard Time, fetteroll@earthlink.net writes: That is *not* healthy. He has somehow picked up that he s","messageBody":"<div id=\"ygrps-yiv-536296118\">In a message dated 2/4/2004 7:16:53 AM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a> writes:<br/>\nThat is *not* healthy. He has somehow picked up that he&#39;s entitled to you<br/>\nserving him.<br/>\n<br/>\n<br/>\nYou are right, it&#39;s not healthy I am sure.  I suppose maybe he does feel it&#39;s <br/>\nsomething he&#39;s entitled to, my presence at things that are important to him.  <br/>\nI&#39;ve always done it with ease and with great pleasure.  I did miss basketball <br/>\ngames once when I was in the hospital but he doesn&#39;t care at all about those <br/>\napparently.  Just the baseball games.  Guess they are more important to him.<br/>\n<br/>\nI think I know he will say the things about the two games in anger because he <br/>\nknows that I always take a breath to know that I did pain him by not being <br/>\nthere.  <br/>\n<br/>\nMy older daughter and DH always say to me, well if that is the WORST thing he <br/>\ncan say about you when he&#39;s angry, then you should just consider that you&#39;ve <br/>\nbeen a wonderful mother to him!<br/>\n<br/>\nI have rearranged every step of my life for motherhood.  Something I really <br/>\nnever thought I wanted until I had it.  I didn&#39;t want to miss a second of it, <br/>\nespecially since I know it can be taken from you in a blink of an eye.<br/>\n<br/>\nA doctor did once tell me when this same son was seven months old that it <br/>\nwasn&#39;t &quot;healthy&quot; for him to be so attached to me.  What if I did, the child would <br/>\ngo crazy with grief.  I think he&#39;d have been more resilient than that if he <br/>\nhad to be, but I&#39;m glad I could be there with him every single second.<br/>\n<br/>\nSome of my greatest joys in life are seeing that very same young man stand on <br/>\nthe pitchers mound, roll that baseball around in his hand, I see the finger <br/>\nplacement, I see the grip, I see his mind counting the stitches, I see him <br/>\nbring his glove to his chest, I see him lift his leg, I see him  bend his back and <br/>\npoint his toe towards the heavens and I hear the ball whiz right by the <br/>\nbatter who wonders where it came from, I see the joy in my son&#39;s face.  I love that <br/>\nboy.  <br/>\n<br/>\nHe&#39;s right, I wish I hadn&#39;t missed ANY of his games.  Who wants to miss a <br/>\nsecond of seeing their child&#39;s dream happen and come to life?  But life happens, <br/>\nand sometimes you miss a bit or two or even more and then one morning you <br/>\nbring your child juice into his room and there is a grown man laying in his bed <br/>\nand you wonder how did THIS happen?<br/>\n<br/>\nUnschooling is great, it affords you almost ALL those moments in between.  <br/>\n<br/>\nglena<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":164542605,"authorName":"Danielle Conger","from":"&quot;Danielle Conger&quot; &lt;danielle.conger@...&gt;","profile":"danielleconger","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] A cry for perspective....","postDate":"1075901494","msgId":90241,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMjgwMWMzZWIyMyQzNTUxZWM5MCQ2NTAxYThjMEBqZ2s2OTAwPg==","referencesHeader":"PDlhLjI4NDZmNjcuMmQ1MWQwZGZAYW9sLmNvbT4="},"prevInTopic":90237,"nextInTopic":90243,"prevInTime":90240,"nextInTime":90242,"topicId":90172,"numMessagesInTopic":0,"msgSnippet":"He said it in a voice that couldn t have been his own.  I can only assume his mother must have said things like that to him many times and he was just speaking","messageBody":"<div id=\"ygrps-yiv-394750759\">He said it in a voice that couldn&#39;t have been his own.  I can only assume his <br/>\n  mother must have said things like that to him many times and he was just <br/>\n  speaking the language of love as he had learned it.  <br/>\n<br/>\n  Sandra<br/>\n  ============================================================================<br/>\nOr the father regularly uses this with the mother. Or the child has heard this at school or in friends&#39; houses and has learned what a great tool it can be to get his own way. Schools and daycares are filled with &quot;If you don&#39;t do x, then I won&#39;t be your friend anymore&quot; or &quot;If you do x, I&#39;ll be your best friend.&quot; Not a big leap to &quot;If you love me, then you&#39;ll do x.&quot; <br/>\n<br/>\nDefinitely a learned behavior, but the mother&#39;s not the only plausible source.  Definitely disturbing no matter what the source.<br/>\n<br/>\n--danielle<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] A cry for perspective....","postDate":"1075897408","msgId":90237,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJDNDY0RTcwLjI0NDYwJWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDdlLjQ2MTEzOTExLjJkNTE1MzIxQGFvbC5jb20+"},"prevInTopic":90236,"nextInTopic":90241,"prevInTime":90236,"nextInTime":90238,"topicId":90172,"numMessagesInTopic":0,"msgSnippet":"... That is *not* healthy. He has somehow picked up that he s entitled to you serving him. I think I would tell him that my being at his games was a gift I was","messageBody":"<div id=\"ygrps-yiv-595513434\">on 2/3/04 2:40 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:rubyprincesstsg@...\">rubyprincesstsg@...</a> at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:rubyprincesstsg@...\">rubyprincesstsg@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My 19 year old has played on teams since he was three, every year, every<br/>\n&gt; season.  When he gets angry at me and wants to throw something at me to<br/>\n&gt; &quot;prove&quot; I&#39;ve been a neglectful mother in some way, he will still say, remember<br/>\n&gt; those two times you didn&#39;t come to my games?  I&#39;ll remind him it was only one<br/>\n&gt; game I&#39;ve missed in sixteen years. He&#39;ll remind me the game I sat in the car<br/>\n&gt; and watched in the freezing rain the day I was released from the hospital<br/>\n&gt; after giving birth counts as NOT being at the game because he couldn&#39;t see or<br/>\n&gt; hear me, although I could see him play.<br/>\n<br/>\n </span></blockquote>That is *not* healthy. He has somehow picked up that he&#39;s entitled to you<br/>\nserving him.<br/>\n<br/>\nI think I would tell him that my being at his games was a gift I was gladly<br/>\ngiving to him because it brought enjoyment to both of us. The gift of my<br/>\npresence was *not* something he was entitled to demand from me.<br/>\n<br/>\nIf he didn&#39;t apprecitate the 2000 gifts I&#39;d given and resented the 2 times<br/>\nhe hadn&#39;t gotten a gift, he needed to do some serious thinking. And since I<br/>\nnow knew how he saw my gifts, I would be getting less enjoyment out of<br/>\ngiving them and he&#39;d be getting them less frequently.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] A cry for perspective....","postDate":"1075895784","msgId":90236,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJDNDY0ODE3LjI0NDVGJWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDFjNS4xM2ZlMTYzNS4yZDUxMjZjYkBhb2wuY29tPg=="},"prevInTopic":90233,"nextInTopic":90237,"prevInTime":90235,"nextInTime":90237,"topicId":90172,"numMessagesInTopic":0,"msgSnippet":"... Yes. Sometimes we need to see aspects of something we re participating in as like rain. We can be angry that it s raining or we can just accept that ","messageBody":"<div id=\"ygrps-yiv-789405638\">on 2/3/04 11:31 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &quot;Happy&quot; is the main one.  If your so is happy, he will still go.  If he&#39;s not<br/>\n&gt; happy, don&#39;t press him to go.<br/>\n&gt; <br/>\n&gt; You can&#39;t change church.  You can&#39;t change teams.<br/>\n<br/>\n </span></blockquote>Yes. Sometimes we need to see aspects of something we&#39;re participating in as<br/>\nlike rain. We can be angry that it&#39;s raining or we can just accept that<br/>\nthere&#39;s nothing we can do about it and enjoy what we can.<br/>\n<br/>\nYou could speak to someone who is bothering you -- as you could speak to the<br/>\nsky. ;-) But you can&#39;t control them. If they change it&#39;s up to them. Their<br/>\nchanging is out of our control.<br/>\n<br/>\nIf someone doesn&#39;t realize they&#39;re doing something that&#39;s hurtful, giving<br/>\nthem the information could be helpful to them. If they&#39;re doing something<br/>\ndeliberately or they don&#39;t see a problem (which is probably the case), they<br/>\nhave no reason to change.<br/>\n<br/>\nWe can be a catalyst of change (by offering information) but we can&#39;t<br/>\ncontrol the change (by somehow making people behave the way we want them<br/>\nto.)<br/>\n<br/>\nHelp your son see what choices he does have rather than being upset with<br/>\nthings that are beyond his control. He can choose not to play volleyball. He<br/>\ncould find some other team. He could put up with the &quot;rain&quot; and enjoy<br/>\nhimself despite the weather.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] A cry for perspective....","postDate":"1075869407","msgId":90233,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlhLjI4NDZmNjcuMmQ1MWQwZGZAYW9sLmNvbT4="},"prevInTopic":90232,"nextInTopic":90236,"prevInTime":90232,"nextInTime":90234,"topicId":90172,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/3/04 8:14:38 PM, ddzimlew@juno.com writes: ","messageBody":"<div id=\"ygrps-yiv-67588924\">In a message dated 2/3/04 8:14:38 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ddzimlew@...\">ddzimlew@...</a> writes:<br/>\n<br/>\n&lt;&lt; If one of them<br/>\ndoes poorly in school, gets in trouble, doesn&#39;t want to do the dishes<br/>\nwhen she asks, she feels they don&#39;t love her.   She&#39;s used this<br/>\nmanipulation on them until they&#39;ve learned to use it on her.  <br/>\n<br/>\n&lt;&lt;It&#39;s a strange and unhealthy thing.   &gt;&gt;<br/>\n<br/>\nThe other day at Target Holly and I were hanging out, and a boy about six or <br/>\nseven said to his mother, of his younger sister:  &quot;If you love me, you&#39;ll make <br/>\nher stay away from me.&quot;<br/>\n<br/>\n We just looked at each other and I wrote it down on the envelope I keep my <br/>\ndebit card in.<br/>\n<br/>\nHe said it in a voice that couldn&#39;t have been his own.  I can only assume his <br/>\nmother must have said things like that to him many times and he was just <br/>\nspeaking the language of love as he had learned it.  <br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] A cry for perspective....","postDate":"1075869071","msgId":90232,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFkOC4xOWJiMWU5Yy4yZDUxY2Y4ZkBhb2wuY29tPg=="},"prevInTopic":90228,"nextInTopic":90233,"prevInTime":90231,"nextInTime":90233,"topicId":90172,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/3/04 7:41:07 PM, rubyprincesstsg@aol.com writes: ","messageBody":"<div id=\"ygrps-yiv-1577277862\">In a message dated 2/3/04 7:41:07 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:rubyprincesstsg@...\">rubyprincesstsg@...</a> writes:<br/>\n<br/>\n&lt;&lt;  I&#39;d ask my child if it was important to them that I be at their <br/>\ngames.  Most times it is very important to them. &gt;&gt;<br/>\n<br/>\nYes, but if the mom is so upset she can&#39;t be helpful, useful and supportive, <br/>\nit might be better for her not to go.<br/>\n<br/>\nIf a child wants a mom to do something and it&#39;s not something the mother can <br/>\nin good conscience do or support, the kid might be better off with the dad <br/>\nthere than the mom.<br/>\n<br/>\n&lt;&lt;It&#39;s the times that I wasn&#39;t there <br/>\nthat stick out most in his mind.<br/>\n<br/>\n&lt;&lt;I&#39;m sorry it hurts him so much to remember me not being there. &gt;&gt;<br/>\n<br/>\nThis sounds totally unreasonable to me.  He should get over it.<br/>\n<br/>\n&lt;&lt;Oh, and many times it IS hard to watch as a mother, but I do it because I <br/>\nlove him and it&#39;s important to him.&gt;&gt;<br/>\n<br/>\nIt seems perhaps you&#39;re saying that a mother who doesn&#39;t go to every game, or <br/>\nat least sit in the car the day after giving birth, doesn&#39;t love her children <br/>\nand doesn&#39;t care what&#39;s important to thim.  I don&#39;t think that&#39;s at all true.<br/>\n<br/>\n&lt;&lt; I&#39;m sorry for those children the coach has less faith in. &gt;&gt;<br/>\n<br/>\nFaith is based on something real, like ability and trust.  It doesn&#39;t make <br/>\nsense to expect a coach to have equal faith in every child.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":74604204,"authorName":"Deborah Lewis","from":"Deborah Lewis &lt;ddzimlew@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] A cry for perspective....","postDate":"1075864216","msgId":90228,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwMjAzLjIwMTAxNy4xNzA4LjIuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":90227,"nextInTopic":90232,"prevInTime":90227,"nextInTime":90229,"topicId":90172,"numMessagesInTopic":0,"msgSnippet":"***When he gets angry at me and wants to throw something at me to prove I ve been a neglectful mother in some way, he will still say, remember those two ","messageBody":"<div id=\"ygrps-yiv-1868590859\">***When he gets angry at me and wants to throw something at me to &quot;prove&quot;<br/>\n<br/>\nI&#39;ve been a neglectful mother in some way, he will still say, remember<br/>\nthose two <br/>\ntimes you didn&#39;t come to my games?***<br/>\n<br/>\nThis seems strange. <br/>\nI realize you haven&#39;t always been unschoolers but this strikes me as<br/>\nmanipulative and unhealthy.<br/>\n<br/>\nI have a friend whose really terrible childhood has affected every part<br/>\nof her life including, sadly, her parenting.   In her mind her children&#39;s<br/>\nlove for her is directly related to their performance.  If one of them<br/>\ndoes poorly in school, gets in trouble, doesn&#39;t want to do the dishes<br/>\nwhen she asks, she feels they don&#39;t love her.   She&#39;s used this<br/>\nmanipulation on them until they&#39;ve learned to use it on her.  <br/>\n<br/>\nIt&#39;s a strange and unhealthy thing.  <br/>\n<br/>\nLittle kids like their parents around, but big kids who love sports want<br/>\nto play whether their parents can come or not.   Why wouldn&#39;t a kid<br/>\nunderstand if a parent couldn&#39;t be there once or twice?   Punishment and<br/>\nguilt and manipulation are learned.   This post disturbs me. <br/>\n<br/>\n***He&#39;ll remind me the game I sat in the car and <br/>\nwatched in the freezing rain the day I was released from the hospital<br/>\nafter giving <br/>\nbirth counts as NOT being at the game because he couldn&#39;t see or hear me,<br/>\n<br/>\nalthough I could see him play. ***<br/>\n<br/>\nWhy would he do this to you?  What kind of relationship allows for<br/>\nunhealthy grudge holding and guilty manipulation.  <br/>\n<br/>\n***The other game I missed, I was in the middle of giving birth, no<br/>\nchance I <br/>\ncould be there. ***<br/>\n<br/>\nAnd he guilts you about it?   <br/>\n<br/>\n***I&#39;m sorry it hurts him so much to remember me not being there.***<br/>\n<br/>\nI&#39;m sorry I&#39;m having a hard time believing this whole thing.  He was<br/>\ntotally unable to understand two day&#39;s you missed in his entire career in<br/>\nkid sports?  <br/>\n<br/>\nI went to Dylan&#39;s martial arts classes until he was comfortable there,<br/>\nand because I liked to be there.  By the time he was nine he wanted to be<br/>\nthere and was so busy and involved there he would have been fine without<br/>\nme.   There is no insecurity in him, no belief that my absence from his<br/>\nclass would in any way be related to how much I love him.   He&#39;d think me<br/>\na more than a little strange if I hated to sit there but did it anyway<br/>\nand made sure I told him it was because I loved him.   That would be<br/>\nmanipulative and warped and he understands that right now and would have<br/>\nfour years ago, too. <br/>\n<br/>\nDeb L<br/>\n<br/>\n&quot;When we try to pick out anything by itself, we find it hitched to<br/>\neverything else in the universe.&quot; <br/>\n~John Muir~</div>","specialLinks":[]},{"userId":6770123,"authorName":"BonKnit@aol.com","from":"BonKnit@...","profile":"pampmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] A cry for perspective....","postDate":"1075863458","msgId":90227,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFkZi4xOGI3M2NjMi4yZDUxYjlhMkBhb2wuY29tPg=="},"prevInTopic":90226,"nextInTopic":90228,"prevInTime":90226,"nextInTime":90228,"topicId":90172,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/3/2004 8:30:09 PM Central Standard Time, ... Swimming is good as is snowboarding or skiing. My 12yro also likes bowling and just joined a","messageBody":"<div id=\"ygrps-yiv-1758330\">In a message dated 2/3/2004 8:30:09 PM Central Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:litlrooh@...\">litlrooh@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; One good sport to try is swimming...although I&#39;m sure that can have some of <br/>\n&gt; the same problems, depending on the coach.<br/>\n<br/>\n </span></blockquote>Swimming is good as is snowboarding or skiing. My 12yro also likes bowling <br/>\nand just joined a brand new league set up for hser&#39;s. I don&#39;t necessarily look <br/>\nfor hser only activities but this is nice as it meets during the day.<br/>\nLaura<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":147376218,"authorName":"liza sabater","from":"liza sabater &lt;listdiva@...&gt;","profile":"lm_sabater","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: A cry for perspective....","postDate":"1075853685","msgId":90216,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIzMjI2QzhELTU2QTctMTFEOC04ODcwLTAwMDM5M0I4NEZCNkBjdWx0dXJla2l0Y2hlbi5jb20+","inReplyToHeader":"PDExNi4yZTNhZThiMC4yZDUxNDM2M0Bhb2wuY29tPg=="},"prevInTopic":90210,"nextInTopic":90219,"prevInTime":90215,"nextInTime":90217,"topicId":90172,"numMessagesInTopic":0,"msgSnippet":"... That s why I ve enjoyed SO MUCH watching the videos of Tony Hawk s Gigantic Skate Park Tour and reading about his life. Talk about an amazingly gifted guy","messageBody":"<div id=\"ygrps-yiv-405709141\">On Tuesday, February 3, 2004, at 01:33  PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:BonKnit@...\">BonKnit@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; One thing I have truly enjoyed is watching one boy who is what I would <br/>\n&gt; call<br/>\n&gt; just gifted in this game, I would bet he is good at other sports as <br/>\n&gt; well. What<br/>\n&gt; I so much enjoyed in this kid is that he was not a starliner, he <br/>\n&gt; played well,<br/>\n&gt; with grace and natural ability that can&#39;t be faked. He was also one of <br/>\n&gt; the<br/>\n&gt; most generous kids on the team, while the coaches son rarely passed <br/>\n&gt; the ball to<br/>\n&gt; my son this kid did not have the &quot;team&quot; mindset, he had not played <br/>\n&gt; with this<br/>\n&gt; particular group of boys before so he didn&#39;t have the &quot;game  plan&quot; so <br/>\n&gt; to speak<br/>\n&gt; in his mind, in other words he did not know my son&#39;s &quot;place&quot; on the <br/>\n&gt; team and<br/>\n&gt; consistantly passed my son the ball, which allowed my son in one game <br/>\n&gt; to make an<br/>\n&gt; excellent play, a lay-up which he would have never been allowed to try<br/>\n&gt; normally. It was one of those rare moments.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>That&#39;s why I&#39;ve enjoyed SO MUCH watching the videos of Tony Hawk&#39;s <br/>\nGigantic Skate Park Tour and reading about his life. Talk about an <br/>\namazingly gifted guy who can be competitive and generous all at the <br/>\nsame time. He&#39;s the &quot;king&quot; but the guys of extreme sports are all a <br/>\nvery different kind of athlete. They&#39;ll compete against each other to <br/>\nlater get together as teams. They&#39;ll cheer each other even after being <br/>\nbeaten out of a medal. It&#39;s really just lovely to see the dynamics <br/>\nbetween these guys. Another good video is the 2000 X Games (it has the <br/>\nevent that propelled Tony Hawk into god-like status).<br/>\n<br/>\nl i z a<br/>\n=========================<br/>\nwww.culturekitchen.com<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":6770123,"authorName":"BonKnit@aol.com","from":"BonKnit@...","profile":"pampmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] A cry for perspective....","postDate":"1075846253","msgId":90210,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNiLjQzMTI5YWNkLjJkNTE3NjZkQGFvbC5jb20+"},"prevInTopic":90207,"nextInTopic":90216,"prevInTime":90209,"nextInTime":90211,"topicId":90172,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/3/2004 3:01:51 PM Central Standard Time, ... I am fully aware of that, I also fill volunteer positions in life. ","messageBody":"<div id=\"ygrps-yiv-1534201309\">In a message dated 2/3/2004 3:01:51 PM Central Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jnjstau@...\">jnjstau@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; First, I would remember that these coaches are volunteers.  Nobody is <br/>\n&gt; paying<br/>\n&gt; them to be there for your son or anyone else.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I am fully aware of that, I also fill volunteer positions in life.<br/>\n<br/>\n&lt;Second, I would remember that lots of coaches&#39; kids are star players.  Not<br/>\nnecessarily because the coach is unfair but because the parent is a coach as<br/>\na way of supporting their kids&#39; interest in that sport.&gt;<br/>\n<br/>\nI also understand this, however, in taking the position he agreed to coach <br/>\nall of the kids on the team. We also try to do our part whenever we can, we paid <br/>\nfor the team party last year and we help out when we are needed. We attend <br/>\nall of the games also while a good many of the parents don&#39;t.<br/>\n<br/>\n&lt;Third, I would ask my son how he feels about what is going on before I poked<br/>\nmy nose in it.  After all, it is about him right?  Not about your sense of<br/>\nfairness.&gt;<br/>\n<br/>\nWhich is exactly why I have not done anything up to this point. I have been <br/>\nthinking on it a long time. I don&#39;t usually act rashly, this is no exception. <br/>\nWhat I was asking for in part was a way to look at this differently in order to <br/>\nfind a way to live with it so that I can go on supporting my son. I also <br/>\nvented a bit and feel better for having done so, thanks for letting me.<br/>\n<br/>\n&lt;Fourth, I would volunteer to coach next year.&gt;<br/>\n<br/>\n<br/>\nLOL, that would be hilarious! I assure you they would not have me, I am <br/>\nbasketball impaired, it would be an interesting proposition though.<br/>\nLaura<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":166495566,"authorName":"Have a Nice Day!","from":"&quot;Have a Nice Day!&quot; &lt;litlrooh@...&gt;","profile":"rooh_","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] A cry for perspective....","postDate":"1075845173","msgId":90221,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMzcwMWMzZWFhMCQxNWU1NmQxMCQwMjAxYThjMEBhby5sb3AuY29tPg==","referencesHeader":"PDE1LjIxYjY3Mjc0LjJkNTE2ZjZiQGFvbC5jb20+"},"prevInTopic":90219,"nextInTopic":90225,"prevInTime":90220,"nextInTime":90222,"topicId":90172,"numMessagesInTopic":0,"msgSnippet":"I actually got cheers from the kids!  This happened to me too one day when all the kids were standing in a long long line to get refreshments at the pool.","messageBody":"<div id=\"ygrps-yiv-295017806\">I actually got cheers from <br/>\nthe kids! &lt;g&gt;<br/>\n<br/>\n<br/>\nThis happened to me too one day when all the kids were standing in a long long line to get refreshments at the pool.  It was an &quot;adult only&quot; swim break and the concession stand only opened ONE window even though there were 3 girls working in there.<br/>\n<br/>\nAs one little boy bought his treat, he left and didn&#39;t take his change.  I was right behind him when the girl behind the counter (probably about 14 or 15) said &quot;stupid kid&quot;.  That was IT.  I told her &quot;he is NOT stupid, he is YOUNG&quot;, and then went on to why don&#39;t they open both windows instead of making these kids wait forever, it is hot after all.  I also told them they could not count change to save their lives and that I was going to call the manager, which I did.<br/>\n<br/>\nAll the kids behind me were cheering LOL.<br/>\n<br/>\nIt was worth every single second of looking like a bitch/mama.  LOL<br/>\n<br/>\nKristen<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":166495566,"authorName":"Have a Nice Day!","from":"&quot;Have a Nice Day!&quot; &lt;litlrooh@...&gt;","profile":"rooh_","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] A cry for perspective....","postDate":"1075844663","msgId":90219,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMWYwMWMzZWE5ZSRlNjZmMWRjMCQwMjAxYThjMEBhby5sb3AuY29tPg==","referencesHeader":"PGFhLjI3YjM3ZjRlLjJkNTExZjk5QGFvbC5jb20+IDxCQVk1LURBVjk0WU1PN2dZdlByMDAwMDUxNTJAaG90bWFpbC5jb20+"},"prevInTopic":90216,"nextInTopic":90221,"prevInTime":90218,"nextInTime":90220,"topicId":90172,"numMessagesInTopic":0,"msgSnippet":"One good sport to try is swimming...although I m sure that can have some of the same problems, depending on the coach. We have found that even if our kids","messageBody":"<div id=\"ygrps-yiv-634999716\">One good sport to try is swimming...although I&#39;m sure that can have some of the same problems, depending on the coach.<br/>\n<br/>\nWe have found that even if our kids aren&#39;t swimming live heats, they can improve their own times, which is a success in and of itself.  Its both an individual sport and a team sport.<br/>\n<br/>\nI had my daughter on a soccer team.  It was AWFUL.  The coach was very &quot;win&quot; oriented and was rude to the kids.  Some of the parents were worse than the coach.  I hated it.  My daughter hated it, and we quit.<br/>\n<br/>\nWe are trying cheerleading next.  I&#39;m hoping that this cheering squad is what its portrayed to be:  inclusive and non-competitive.  They do actually compete in the fall, but not in the spring.  Spring is mostly for learning.  So, I hope it works out.<br/>\n<br/>\nKristen<br/>\nKristen<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: Wendy Carr <br/>\n  To: UnschoolingDiscussion@yahoogroups.com <br/>\n  Sent: Tuesday, February 03, 2004 11:19 AM<br/>\n  Subject: Re: [UnschoolingDiscussion] A cry for perspective....<br/>\n<br/>\n<br/>\n  This is one reason I have never put my son in sports! This stuff happens all the time, and I just don&#39;t want to deal with it. I hope you figure this out, and soon! Good luck!<br/>\n<br/>\n    ----- Original Message ----- <br/>\n    From: BonKnit@...&lt;mailto:BonKnit@...&gt; <br/>\n    To: unschoolingdiscussion@yahoogroups.com&lt;mailto:unschoolingdiscussion@yahoogroups.com&gt; <br/>\n    Sent: Tuesday, February 03, 2004 11:00 AM<br/>\n    Subject: [UnschoolingDiscussion] A cry for perspective....<br/>\n<br/>\n<br/>\n           I am not sure this would fall under any unschooling topic but I hope a <br/>\n    few of you can offer me a few options on how I might handle this.<br/>\n<br/>\n    I am angry, I was hoping that it would pass but it is not. My 12yro plays <br/>\n    basketball on our church team, he has played different sports with the same kids <br/>\n    (and coaches) for the last several years. He likes to participate and has <br/>\n    always been very happy with being a team player. I have let a number of issues <br/>\n    pass because he has not had a problem I have. As in most organizations there are <br/>\n    a few fathers that always coach, they have the time and the interest and from <br/>\n    observation I can see how their kids perform is very important to them. The <br/>\n    mothers are exactly the same, they know every sport intimately and can get quite <br/>\n    riled though they keep it within acceptable (so they don&#39;t get thrown out <br/>\n    acceptable) limits. <br/>\n<br/>\n    Except for volleyball which has a mother coaching who is wonderful and fair <br/>\n    my son sits out a good bit. He is a good player but I guess he is not a &quot;star&quot; <br/>\n    player. (I also think how the coach plays a player and the message he sends <br/>\n    affects a persons playing, we live up or down to others expectations but that is <br/>\n    another post)<br/>\n<br/>\n    Both coaches sons are &quot;star&quot; players, there are a number of very good players <br/>\n    on the team. My son missed both practices last week and was therefore <br/>\n    relegated to playing just a few minutes of one quarter. It was never put into words <br/>\n    but a comment made at team picture day Sunday confirmed what we already <br/>\n    thought, sitting out longer than usual was a punitive measure. What really hurt was <br/>\n    that one of our older boys came and also one of my son&#39;s friends. <br/>\n<br/>\n    This is getting wordy, please bear with me. <br/>\n<br/>\n    I am having a real problem with all of this because even if my son went to <br/>\n    both practices he only ever gets to play a quarter at most. I might even be able <br/>\n    to swallow that had I not witnessed this. The assistant Coaches son has a <br/>\n    hard time staying calm, when he is getting stressed because they are behind or he <br/>\n    has made a mistake he does something so that he can act like he is injured so <br/>\n    he can go sit down and cry, when he is finished crying he wants right back in <br/>\n    the game. I watched a few weeks ago this whole scenario and watched him get <br/>\n    back up and say something to his father who right away reached over (they were <br/>\n    having a time out) and tap my son on the shoulder, my son&#39;s face dropped, he <br/>\n    too knew what was going on. This happend every time.<br/>\n<br/>\n    I watched it happen again this week with a different kid since my son was <br/>\n    benched anyhow.<br/>\n<br/>\n    My DH thinks I should let it go, I am gagging on it. I do not want to call <br/>\n    and scream at them, I want to call and explain how this all looks from another <br/>\n    POV.  My son has signed up to play baseball with pretty much the same people <br/>\n    and I am trying to find a way to get through this. <br/>\n<br/>\n    Should I call the coach about the inconsistencies I see or should I let it <br/>\n    go? If I should let it go I need to find a way to look at the situation that <br/>\n    does now appall me.<br/>\n    Help!<br/>\n    Laura<br/>\n<br/>\n<br/>\n    [Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n    &quot;List Posting Policies&quot; are provided in the files area of this group. <br/>\n<br/>\n    To unsubscribe from this send an email to:<br/>\n    UnschoolingDiscussion-unsubscribe@yahoogroups.com <br/>\n<br/>\n    Visit the Unschooling website and message boards: http://www.unschooling.com&lt;http://www.unschooling.com/&gt; <br/>\n<br/>\n<br/>\n          Yahoo! Groups Sponsor <br/>\n                ADVERTISEMENT<br/>\n                 &lt;http://rd.yahoo.com/SIG=12cusoors/M=243273.4510124.5685162.1261774/D=egroupweb/S=1705081972:HM/EXP=1075910460/A=1750744/R=0/*http://servedby.advertising.com/click/site=552006/bnum=1075824060640360&gt; <br/>\n         <br/>\n         <br/>\n<br/>\n<br/>\n  ------------------------------------------------------------------------------<br/>\n    Yahoo! Groups Links<br/>\n<br/>\n      a.. To visit your group on the web, go to:<br/>\n      http://groups.yahoo.com/group/UnschoolingDiscussion/&lt;http://groups.yahoo.com/group/UnschoolingDiscussion/&gt;<br/>\n        <br/>\n      b.. To unsubscribe from this group, send an email to:<br/>\n      UnschoolingDiscussion-unsubscribe@yahoogroups.com&lt;mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com?subject=Unsubscribe&gt;<br/>\n        <br/>\n      c.. Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service&lt;http://docs.yahoo.com/info/terms/&gt;. <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  [Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  &quot;List Posting Policies&quot; are provided in the files area of this group. <br/>\n<br/>\n  To unsubscribe from this send an email to:<br/>\n  UnschoolingDiscussion-unsubscribe@yahoogroups.com <br/>\n<br/>\n  Visit the Unschooling website and message boards: http://www.unschooling.com <br/>\n<br/>\n<br/>\n<br/>\n------------------------------------------------------------------------------<br/>\n  Yahoo! Groups Links<br/>\n<br/>\n    a.. To visit your group on the web, go to:<br/>\n    http://groups.yahoo.com/group/UnschoolingDiscussion/<br/>\n      <br/>\n    b.. To unsubscribe from this group, send an email to:<br/>\n    UnschoolingDiscussion-unsubscribe@yahoogroups.com<br/>\n      <br/>\n    c.. Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] A cry for perspective....","postDate":"1075844459","msgId":90207,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1LjIxYjY3Mjc0LjJkNTE2ZjZiQGFvbC5jb20+"},"prevInTopic":90205,"nextInTopic":90210,"prevInTime":90206,"nextInTime":90208,"topicId":90172,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/3/2004 4:06:50 PM Eastern Standard Time, jnjstau@gvtc.com writes: Same at our house.  Zach (10) had a yelling coach last year in baseball.","messageBody":"<div id=\"ygrps-yiv-341966046\">In a message dated 2/3/2004 4:06:50 PM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jnjstau@...\">jnjstau@...</a> writes:<br/>\nSame at our house.  Zach (10) had a yelling coach last year in baseball.  He<br/>\nyelled at kids, at refs, whoever.  I couldn&#39;t hardly stand it but Zach<br/>\nseemed unfazed.<br/>\n<br/>\nI asked Zach about it, telling him that I was troubled but wanted to get his<br/>\nfeel on it.  Zach said it didn&#39;t bother him, he felt the kids deserved to<br/>\nget yelled at (things like not coming to practice, not coming on time,<br/>\nmissing easy plays and then goofing off during practice), that he wasn&#39;t<br/>\ngetting yelled at....no problem.&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\nI refused to suck it up. ALL the parents were sitting on the sidelines <br/>\n(baseball) and bitching all through the games and practices about what a jerk he was <br/>\nand what an awful coach. Of course they said nothing.<br/>\n<br/>\nFirst I went through all the &quot;chains of command&quot;: I talked (sweetly! I *AM* <br/>\nSouthern, ya&#39; know!) to the coach. Then to the next guy up, the next, and the <br/>\nnext. Finally I was at the top of the pile, and still nothing was being <br/>\ndone---although each said he would talk to the coach and work it out. Eventually I <br/>\nstarted yelling on the sidelines. <br/>\n<br/>\nThe final straw came when he scheduled an extra &quot;optional&quot; practice on a <br/>\nSaturday afternoon. June in Columbia! Guys, it&#39;s HOT! They practiced from <br/>\n12:00-3:00 with ONE water break----and then had a game at 4:00. (This jerk sat in the <br/>\nshade, yelling the whole time---showing NO respect to these kids). THEN he got <br/>\nmad when they weren&#39;t hustling at the game from 4:00 to 6:00.<br/>\n<br/>\nThe jerk actually told my husband that Ben needed to get control over ME! &lt;g&gt; <br/>\nWell, that didn&#39;t go over too well. Ben told him that if he had a problem <br/>\nwith me, that HE needed to deal with me himself, if he&#39;s man enough. &lt;g&gt;<br/>\n<br/>\nCameron liked baseball until this coach. Cameron (and all the other boys on <br/>\nthe team) were glad that I was standing up for them because they had no other <br/>\noptions. THEY couldn&#39;t; their parents wouldn&#39;t. Sad. I actually got cheers from <br/>\nthe kids! &lt;g&gt;<br/>\n<br/>\nAt one of his stupid practices, Cameron shattered his index finger----broke <br/>\nit into four-five pieces. Three pins to repair it. He was out the second half <br/>\nof the season.<br/>\n<br/>\nThis idiot actually had the gall to call me the next year to try to get me to <br/>\nhave Cameron play for him again, &quot;I&#39;ll let bygones be bygones...&quot; crap. I <br/>\nflat out told him he was a horrible coach, a horrible person, and that he should <br/>\nnever be allowed near any children EVER. I followed it up with a letter to the <br/>\nPark & Recs about how horrible he was and about how I wasn&#39;t listened to all <br/>\nseason.<br/>\n<br/>\nWhich leads me to now! &lt;g&gt; Duncan wants to play baseball this spring! UGH!<br/>\n<br/>\n~Kelly<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":73238415,"authorName":"J. Stauffer","from":"&quot;J. Stauffer&quot; &lt;jnjstau@...&gt;","profile":"jnjstau","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] A cry for perspective....","postDate":"1075841294","msgId":90205,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNDcwMWMzZWE5NyQwYjkxOWY0MCQzMTg1ZWU0MEB5b3VybzBrd2t3OWp3Yz4=","referencesHeader":"PGIwLjQ0MTA0ZjJmLjJkNTE1M2M3QGFvbC5jb20+"},"prevInTopic":90201,"nextInTopic":90207,"prevInTime":90204,"nextInTime":90206,"topicId":90172,"numMessagesInTopic":0,"msgSnippet":"... Same at our house.  Zach (10) had a yelling coach last year in baseball.  He yelled at kids, at refs, whoever.  I couldn t hardly stand it but Zach seemed","messageBody":"<div id=\"ygrps-yiv-442537400\">&lt;&lt;&lt;&lt;They may get mad<br/>\n<blockquote><span title=\"ireply\"> &gt; at the infairness sometimes but I can see I am the one who has the bigger<br/>\n&gt; issues, LOL&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>Same at our house.  Zach (10) had a yelling coach last year in baseball.  He<br/>\nyelled at kids, at refs, whoever.  I couldn&#39;t hardly stand it but Zach<br/>\nseemed unfazed.<br/>\n<br/>\nI asked Zach about it, telling him that I was troubled but wanted to get his<br/>\nfeel on it.  Zach said it didn&#39;t bother him, he felt the kids deserved to<br/>\nget yelled at (things like not coming to practice, not coming on time,<br/>\nmissing easy plays and then goofing off during practice), that he wasn&#39;t<br/>\ngetting yelled at....no problem.<br/>\n<br/>\nSo I sucked it up and let him play.<br/>\n<br/>\nJulie S.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- <br/>\nFrom: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:BonKnit@...\">BonKnit@...</a>&gt;<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>&gt;<br/>\nSent: Tuesday, February 03, 2004 1:43 PM<br/>\nSubject: Re: [UnschoolingDiscussion] A cry for perspective....<br/>\n<br/>\n<br/>\n&gt; In a message dated 2/3/2004 12:52:29 PM Central Standard Time,<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:WendyWCarr@...\">WendyWCarr@...</a> writes:<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &gt; This is one reason I have never put my son in sports! This stuff happens<br/>\n&gt; &gt; all the time, and I just don&#39;t want to deal with it. I hope you figure<br/>\nthis<br/>\n&gt; &gt; out, and soon! Good luck!<br/>\n&gt; &gt;<br/>\n&gt;<br/>\n&gt; Actually I do feel better after being able to talk about it. If it were my<br/>\n&gt; decision I would not have my kids play sports but they like it. They may<br/>\nget mad<br/>\n&gt; at the infairness sometimes but I can see I am the one who has the bigger<br/>\n&gt; issues, LOL<br/>\n&gt; Laura<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &quot;List Posting Policies&quot; are provided in the files area of this group.<br/>\n&gt;<br/>\n&gt; To unsubscribe from this send an email to:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a><br/>\n&gt;<br/>\n&gt; Visit the Unschooling website and message boards:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt; To visit your group on the web, go to:<br/>\n&gt;  <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/UnschoolingDiscussion/\">http://groups.yahoo.com/group/UnschoolingDiscussion/</a><br/>\n&gt;<br/>\n&gt; To unsubscribe from this group, send an email to:<br/>\n&gt;  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a><br/>\n&gt;<br/>\n&gt; Your use of Yahoo! Groups is subject to:<br/>\n&gt;  <a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":73238415,"authorName":"J. Stauffer","from":"&quot;J. Stauffer&quot; &lt;jnjstau@...&gt;","profile":"jnjstau","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] A cry for perspective....","postDate":"1075840174","msgId":90201,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTkwMWMzZWE5NCQ3MDIyZTNlMCQzMTg1ZWU0MEB5b3VybzBrd2t3OWp3Yz4=","referencesHeader":"PGFhLjI3YjM3ZjRlLjJkNTExZjk5QGFvbC5jb20+"},"prevInTopic":90200,"nextInTopic":90205,"prevInTime":90200,"nextInTime":90202,"topicId":90172,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1378650571\">&lt;&lt;&lt; Should I call the coach about the inconsistencies I see or should I let<br/>\nit<br/>\n<blockquote><span title=\"ireply\"> &gt; go? If I should let it go I need to find a way to look at the situation<br/>\n </span></blockquote>that<br/>\n<blockquote><span title=\"ireply\"> &gt; does now appall me.&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>First, I would remember that these coaches are volunteers.  Nobody is paying<br/>\nthem to be there for your son or anyone else.<br/>\n<br/>\nSecond, I would remember that lots of coaches&#39; kids are star players.  Not<br/>\nnecessarily because the coach is unfair but because the parent is a coach as<br/>\na way of supporting their kids&#39; interest in that sport.<br/>\n<br/>\nThird, I would ask my son how he feels about what is going on before I poked<br/>\nmy nose in it.  After all, it is about him right?  Not about your sense of<br/>\nfairness.<br/>\n<br/>\nFourth, I would volunteer to coach next year.<br/>\n<br/>\nJulie S.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- <br/>\nFrom: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:BonKnit@...\">BonKnit@...</a>&gt;<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingdiscussion@yahoogroups.com\">unschoolingdiscussion@yahoogroups.com</a>&gt;<br/>\nSent: Tuesday, February 03, 2004 10:00 AM<br/>\nSubject: [UnschoolingDiscussion] A cry for perspective....<br/>\n<br/>\n<br/>\n&gt;        I am not sure this would fall under any unschooling topic but I<br/>\nhope a<br/>\n&gt; few of you can offer me a few options on how I might handle this.<br/>\n&gt;<br/>\n&gt; I am angry, I was hoping that it would pass but it is not. My 12yro plays<br/>\n&gt; basketball on our church team, he has played different sports with the<br/>\nsame kids<br/>\n&gt; (and coaches) for the last several years. He likes to participate and has<br/>\n&gt; always been very happy with being a team player. I have let a number of<br/>\nissues<br/>\n&gt; pass because he has not had a problem I have. As in most organizations<br/>\nthere are<br/>\n&gt; a few fathers that always coach, they have the time and the interest and<br/>\nfrom<br/>\n&gt; observation I can see how their kids perform is very important to them.<br/>\nThe<br/>\n&gt; mothers are exactly the same, they know every sport intimately and can get<br/>\nquite<br/>\n&gt; riled though they keep it within acceptable (so they don&#39;t get thrown out<br/>\n&gt; acceptable) limits.<br/>\n&gt;<br/>\n&gt; Except for volleyball which has a mother coaching who is wonderful and<br/>\nfair<br/>\n&gt; my son sits out a good bit. He is a good player but I guess he is not a<br/>\n&quot;star&quot;<br/>\n&gt; player. (I also think how the coach plays a player and the message he<br/>\nsends<br/>\n&gt; affects a persons playing, we live up or down to others expectations but<br/>\nthat is<br/>\n&gt; another post)<br/>\n&gt;<br/>\n&gt; Both coaches sons are &quot;star&quot; players, there are a number of very good<br/>\nplayers<br/>\n&gt; on the team. My son missed both practices last week and was therefore<br/>\n&gt; relegated to playing just a few minutes of one quarter. It was never put<br/>\ninto words<br/>\n&gt; but a comment made at team picture day Sunday confirmed what we already<br/>\n&gt; thought, sitting out longer than usual was a punitive measure. What really<br/>\nhurt was<br/>\n&gt; that one of our older boys came and also one of my son&#39;s friends.<br/>\n&gt;<br/>\n&gt; This is getting wordy, please bear with me.<br/>\n&gt;<br/>\n&gt; I am having a real problem with all of this because even if my son went to<br/>\n&gt; both practices he only ever gets to play a quarter at most. I might even<br/>\nbe able<br/>\n&gt; to swallow that had I not witnessed this. The assistant Coaches son has a<br/>\n&gt; hard time staying calm, when he is getting stressed because they are<br/>\nbehind or he<br/>\n&gt; has made a mistake he does something so that he can act like he is injured<br/>\nso<br/>\n&gt; he can go sit down and cry, when he is finished crying he wants right back<br/>\nin<br/>\n&gt; the game. I watched a few weeks ago this whole scenario and watched him<br/>\nget<br/>\n&gt; back up and say something to his father who right away reached over (they<br/>\nwere<br/>\n&gt; having a time out) and tap my son on the shoulder, my son&#39;s face dropped,<br/>\nhe<br/>\n&gt; too knew what was going on. This happend every time.<br/>\n&gt;<br/>\n&gt; I watched it happen again this week with a different kid since my son was<br/>\n&gt; benched anyhow.<br/>\n&gt;<br/>\n&gt; My DH thinks I should let it go, I am gagging on it. I do not want to call<br/>\n&gt; and scream at them, I want to call and explain how this all looks from<br/>\nanother<br/>\n&gt; POV.  My son has signed up to play baseball with pretty much the same<br/>\npeople<br/>\n&gt; and I am trying to find a way to get through this.<br/>\n&gt;<br/>\n&gt;&gt; Help!<br/>\n&gt; Laura<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &quot;List Posting Policies&quot; are provided in the files area of this group.<br/>\n&gt;<br/>\n&gt; To unsubscribe from this send an email to:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a><br/>\n&gt;<br/>\n&gt; Visit the Unschooling website and message boards:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt; To visit your group on the web, go to:<br/>\n&gt;  <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/UnschoolingDiscussion/\">http://groups.yahoo.com/group/UnschoolingDiscussion/</a><br/>\n&gt;<br/>\n&gt; To unsubscribe from this group, send an email to:<br/>\n&gt;  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a><br/>\n&gt;<br/>\n&gt; Your use of Yahoo! Groups is subject to:<br/>\n&gt;  <a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":8151304,"authorName":"rubyprincesstsg@aol.com","from":"rubyprincesstsg@...","profile":"rubyprincesstsg","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] A cry for perspective....","postDate":"1075839699","msgId":90226,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFjNi4xNGIyNTc3MC4yZDUxNWNkM0Bhb2wuY29tPg=="},"prevInTopic":90225,"nextInTopic":90227,"prevInTime":90225,"nextInTime":90227,"topicId":90172,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/3/2004 1:25:15 PM Eastern Standard Time, BonKnit@aol.com writes: I feel sorry for their kids too even if they seem to enjoy it. It is all","messageBody":"<div id=\"ygrps-yiv-123785831\">In a message dated 2/3/2004 1:25:15 PM Eastern Standard Time, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:BonKnit@...\">BonKnit@...</a> <br/>\nwrites:<br/>\nI feel sorry for their kids too <br/>\neven if they seem to enjoy it. It is all done towards a goal, I am sure they <br/>\nare <br/>\nlooking to high school and the college scholarships and we are just not on <br/>\nthat track. It is hard when we are playing for different reasons. <br/>\nLaura<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nLaura,<br/>\n<br/>\nOne thing did come to mind as I read and re-read your post.  Being on <br/>\ndifferent tracks.  For some kids it is their ultimate dream to play some pro sport.  <br/>\nThey never miss a practice, they work at home, they read books, heck some <br/>\nsleep with their baseball glove or a football or whatever.  It&#39;s their dream.  <br/>\nThey see it on TV or wherever and they WANT it for themselves.  Some parents work <br/>\nhard to help their child achieve whatever dreams they have.  Buying expensive <br/>\nequipment (did you know some baseball bats are $500.00?), driving them to and <br/>\nfrom practice, making arrangements to be at games.  Whatever they can think <br/>\nof to support their son or daughter.<br/>\n<br/>\nOther parents have children that just want to play a sport.  Just for the fun <br/>\nof it, just to be a part of a team and around other children.  They have no <br/>\nintense desire to make it a life long goal of achievement, they know this, <br/>\ntheir parents know this.  They play on a different level.  Practice really isn&#39;t <br/>\nthat important to them, because the &quot;game&quot; (as in general not as in one <br/>\nparticular day of seven innings or whatever), it&#39;s just a PART of what makes them <br/>\nhappy and who they are.<br/>\n<br/>\nSo two children and two (or four or six) parents come to the same game with <br/>\nthe same coaches with completely different agendas.  <br/>\n<br/>\nPersonally if a child misses practice, they sit, no matter who.  Even the <br/>\n&quot;star&quot; would sit the first half or first innings.  As a coach, you recognize that <br/>\neveryone has other &quot;stuff&quot; to do, some make practice a priority and some <br/>\ndon&#39;t.  The one&#39;s who do, obviously want to play.  Now if there is a funeral or <br/>\nwedding or something other than then child just choosing to not come, that&#39;s <br/>\ndifferent.<br/>\n<br/>\nI still believe that every child who commits to being on a team should be <br/>\ntreated as a team member and be given playing time.  Should every child get the <br/>\nexact same number of innings/quarters?  I firmly believe that in the younger <br/>\nages, maybe nine and younger that should be true.  Most often around here that&#39;s <br/>\nhow it goes.  Everyone plays the same number of innings/quarters, for the <br/>\nmost part.  If you miss practice however, that means you sit, regardless.  The <br/>\nolder teams don&#39;t do that fairness, number of innings thing, they do sit you if <br/>\nyou don&#39;t practice.<br/>\n<br/>\nShould they base playing time on ability?  Maybe dedication to the team?  <br/>\nMaybe who&#39;s dad coaches?  Most likely it&#39;s going to be based on putting the best <br/>\nnine or five or twelve on the field to win the game.  But in any given game, <br/>\nin any given play, ANY child should be able to be considered one of the best, <br/>\nfive, nine or twelve on the field/court.<br/>\n<br/>\nI have always respected the child that comes to me personally and told me <br/>\nthey felt they could do more to help the team out, by being on the field more, <br/>\nplaying more innings and were willing to do whatever it took to get into the <br/>\ngame more.  I&#39;ve never much been affected by the parent who comes to me with the <br/>\nsame concerns.<br/>\n<br/>\nMaybe have your son approach the coach and tell him he&#39;s wants to step up his <br/>\nplay to the next level, to play more and sit less and what could he do to <br/>\naccomplish that goal?<br/>\n<br/>\nI hope your son has a great time with basketball AND baseball, my very <br/>\nfavorite sport!<br/>\n<br/>\nglena<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":6770123,"authorName":"BonKnit@aol.com","from":"BonKnit@...","profile":"pampmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] A cry for perspective....","postDate":"1075837383","msgId":90200,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGIwLjQ0MTA0ZjJmLjJkNTE1M2M3QGFvbC5jb20+"},"prevInTopic":90195,"nextInTopic":90201,"prevInTime":90199,"nextInTime":90201,"topicId":90172,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/3/2004 12:52:29 PM Central Standard Time, ... Actually I do feel better after being able to talk about it. If it were my decision I would","messageBody":"<div id=\"ygrps-yiv-2062616779\">In a message dated 2/3/2004 12:52:29 PM Central Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:WendyWCarr@...\">WendyWCarr@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; This is one reason I have never put my son in sports! This stuff happens <br/>\n&gt; all the time, and I just don&#39;t want to deal with it. I hope you figure this <br/>\n&gt; out, and soon! Good luck!<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Actually I do feel better after being able to talk about it. If it were my <br/>\ndecision I would not have my kids play sports but they like it. They may get mad <br/>\nat the infairness sometimes but I can see I am the one who has the bigger <br/>\nissues, LOL<br/>\nLaura<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":8151304,"authorName":"rubyprincesstsg@aol.com","from":"rubyprincesstsg@...","profile":"rubyprincesstsg","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] A cry for perspective....","postDate":"1075837217","msgId":90225,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdlLjQ2MTEzOTExLjJkNTE1MzIxQGFvbC5jb20+"},"prevInTopic":90221,"nextInTopic":90226,"prevInTime":90224,"nextInTime":90226,"topicId":90172,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/3/2004 11:37:43 AM Eastern Standard Time, SandraDodd@aol.com writes: There are options, though.  Maybe you don t have to be at every game.","messageBody":"<div id=\"ygrps-yiv-882302083\">In a message dated 2/3/2004 11:37:43 AM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> writes:<br/>\nThere are options, though.  Maybe you don&#39;t have to be at every game.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\nI&#39;ve coached lots of teams, my children have played on lots more.  I&#39;ve seen <br/>\nthe faces and heard the words of the kids who have parents who do NOT come to <br/>\ntheir games.  I&#39;d ask my child if it was important to them that I be at their <br/>\ngames.  Most times it is very important to them.<br/>\n<br/>\nMy 19 year old has played on teams since he was three, every year, every <br/>\nseason.  When he gets angry at me and wants to throw something at me to &quot;prove&quot; <br/>\nI&#39;ve been a neglectful mother in some way, he will still say, remember those two <br/>\ntimes you didn&#39;t come to my games?  I&#39;ll remind him it was only one game I&#39;ve <br/>\nmissed in sixteen years. He&#39;ll remind me the game I sat in the car and <br/>\nwatched in the freezing rain the day I was released from the hospital after giving <br/>\nbirth counts as NOT being at the game because he couldn&#39;t see or hear me, <br/>\nalthough I could see him play.<br/>\n<br/>\nThe other game I missed, I was in the middle of giving birth, no chance I <br/>\ncould be there.  Sometimes it&#39;s VERY important to them.  He rarely remembers I <br/>\nrescheduled surgery three times one spring so I could see his play off games <br/>\nwhen he had pro scouts watching him pitch.  It&#39;s the times that I wasn&#39;t there <br/>\nthat stick out most in his mind.<br/>\n<br/>\nI&#39;m sorry it hurts him so much to remember me not being there. <br/>\n<br/>\n I definitely would ask.<br/>\n<br/>\nOh, and many times it IS hard to watch as a mother, but I do it because I <br/>\nlove him and it&#39;s important to him.<br/>\n<br/>\nI also think that it&#39;s up to a coach to find a way to win games including the <br/>\nteam.  If one or two players playing part of a ballgame of any kind cause you <br/>\nto not win, then as a coach you aren&#39;t really coaching very well, in my <br/>\nopinion.  You win as a team, you loose as a team, but I know it doesn&#39;t always work <br/>\nout that way, I&#39;m sorry for those children the coach has less faith in.  They <br/>\nsurprise you most sometimes I think.  Great heart always wins with me over <br/>\ngreat talent with attitude...<br/>\n<br/>\nIf you did talk to the coach, maybe mentioning very calmly that your child <br/>\nwould be so lifted up by getting in the game a little more and he feels he <br/>\nreally needs to contribute to the team more than he currently is doing.  I&#39;d leave <br/>\nit at that.  Make it seem like it&#39;s all about your child, not the coach&#39;s <br/>\ncoaching style.  After all isn&#39;t it supposed to be about the KIDS anyway?<br/>\n<br/>\nBest of luck with this situation.<br/>\n<br/>\nglena<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":6770123,"authorName":"BonKnit@aol.com","from":"BonKnit@...","profile":"pampmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: A cry for perspective....","postDate":"1075834130","msgId":90195,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFjMi4xNDhjMWI4My4yZDUxNDcxMkBhb2wuY29tPg=="},"prevInTopic":90194,"nextInTopic":90200,"prevInTime":90194,"nextInTime":90196,"topicId":90172,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/3/2004 11:48:46 AM Central Standard Time, ... Yes, you are right and that is why I have held back. I don t want to make the situation","messageBody":"<div id=\"ygrps-yiv-1289899548\">In a message dated 2/3/2004 11:48:46 AM Central Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:garrisonstuber@...\">garrisonstuber@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; You could call the coach, but I hasten to discourage you--the coach is<br/>\n&gt; not inconsistent within his premise &quot;play the &quot;star&quot; players to win<br/>\n&gt; the game&quot;--the inconsistency is between his premise and yours.  (Which<br/>\n&gt; is not to say that I don&#39;t completely agree with yours: I do.  I just<br/>\n&gt; think the conversation will be fruitless and frustrating).<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Yes, you are right and that is why I have held back. I don&#39;t want to make the <br/>\nsituation worse. I just need to get some distance from it.<br/>\n<br/>\n&lt;You may want to have some conversations with your kid along the lines<br/>\nof what you consider important (being part of the team, giving 100%<br/>\neven if you&#39;re only called .05% of the time, practicing to become a<br/>\nbetter player, the value of sportsmanship). &gt;<br/>\n<br/>\nWe have had this conversation before and we just had it again. I don&#39;t care <br/>\nif you play or not but if you play here are the rules of the team. If you <br/>\nchoose not to follow them all, or not all of the time then you need to understand <br/>\nwhat the consequences are. <br/>\n<br/>\nHe did not want to go do the team picture Sunday because he was still mad but <br/>\nI explained that the baseball team is made up of the same kids and a mix of <br/>\nthe same coaches and they will not forget if you mess up their team picture. I <br/>\nlet it be his choice whether to go or not but made sure he understood that <br/>\nthere might be repercussions. He decided to go...with dad, LOL<br/>\nLaura<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":6770123,"authorName":"BonKnit@aol.com","from":"BonKnit@...","profile":"pampmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: A cry for perspective....","postDate":"1075833187","msgId":90190,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDExNi4yZTNhZThiMC4yZDUxNDM2M0Bhb2wuY29tPg=="},"prevInTopic":90187,"nextInTopic":90194,"prevInTime":90189,"nextInTime":90191,"topicId":90172,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/3/2004 12:09:45 PM Central Standard Time, ... One thing I have truly enjoyed is watching one boy who is what I would call just gifted in","messageBody":"<div id=\"ygrps-yiv-105770226\">In a message dated 2/3/2004 12:09:45 PM Central Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Probably the coaches&#39; kids are better because of genetics and opportunity.  <br/>\n&gt; <br/>\n&gt; They were good before the dads decided to coach, probably, rather than the <br/>\n&gt; other way around.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>One thing I have truly enjoyed is watching one boy who is what I would call <br/>\njust gifted in this game, I would bet he is good at other sports as well. What <br/>\nI so much enjoyed in this kid is that he was not a starliner, he played well, <br/>\nwith grace and natural ability that can&#39;t be faked. He was also one of the <br/>\nmost generous kids on the team, while the coaches son rarely passed the ball to <br/>\nmy son this kid did not have the &quot;team&quot; mindset, he had not played with this <br/>\nparticular group of boys before so he didn&#39;t have the &quot;game  plan&quot; so to speak <br/>\nin his mind, in other words he did not know my son&#39;s &quot;place&quot; on the team and <br/>\nconsistantly passed my son the ball, which allowed my son in one game to make an <br/>\nexcellent play, a lay-up which he would have never been allowed to try <br/>\nnormally. It was one of those rare moments.<br/>\n<br/>\nI just thought of another thing that I realize has been working on me. It&#39;s <br/>\nhow whenever my son would do something good the coach moms would always make <br/>\nsure to tell me what a good job he did. They don&#39;t reassure each other when <br/>\ntheir boys do something good. I guess that has always made me feel singled out as <br/>\nthough my son doing something good was really something to shout about. Just <br/>\nodd things that stick in ones crawl.I think these are also things that are <br/>\naffecting the way I feel. (I would never have said to the one coach mom, It&#39;s so <br/>\ngood to see K make it through the game this week w/o falling apart, he must be <br/>\nmaturing, you must be proud.)<br/>\n<br/>\n  Laura<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":6770123,"authorName":"BonKnit@aol.com","from":"BonKnit@...","profile":"pampmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] A cry for perspective....","postDate":"1075831922","msgId":90187,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE2Yy4yOTRkZDdkZC4yZDUxM2U3MkBhb2wuY29tPg=="},"prevInTopic":90185,"nextInTopic":90190,"prevInTime":90186,"nextInTime":90188,"topicId":90172,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/3/2004 10:37:32 AM Central Standard Time, ... I do agree and as 12yro is my 6th son I have seen a good many teams, I do know how they work","messageBody":"<div id=\"ygrps-yiv-257089561\">In a message dated 2/3/2004 10:37:32 AM Central Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Teams always have and always will have problems.  Either they&#39;re run <br/>\n&gt; &quot;fairly&quot; <br/>\n&gt; and they stink, or they&#39;re run to win, and that stinks for those who don&#39;t <br/>\n&gt; feel it was fair.  That problem has existed since people said &quot;let&#39;s share.&quot;<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I do agree and as 12yro is my 6th son I have seen a good many teams, I do <br/>\nknow how they work (or don&#39;t work for everyone as the case may be). I won&#39;t <br/>\npretend I like it at least in the younger age groups. I was always under the <br/>\nimpression that the younger teams were developmental teams which I took to mean &quot;we <br/>\nare learning the game in a fun, safe environment for all&quot;. I learned long ago <br/>\nthat while I may come across a good team/coach just as I came across good <br/>\ncaring teachers when my kids were in school that I shouldn&#39;t come to expect that <br/>\nas the norm cause it just wasn&#39;t so. It has been my experience for the most <br/>\npart that as one thing you mentioned &quot;They are in it to win&quot;, the kids feelings <br/>\nbe damned.<br/>\n<br/>\n&lt;And part of your complaint is the overinvolvement of parents.  Don&#39;t become <br/>\none&gt;<br/>\n<br/>\nI don&#39;t intend to which is why I wrote asking for help with perspective. I <br/>\ndid ask my DH to go in for picture day because I didn&#39;t feel up to going in and <br/>\nmaking nice.  <br/>\n<br/>\n&lt;If YOUR happiness depends on your son&#39;s happiness, that&#39;s co-dependency.  <br/>\nYou&#39;re not on the team.  You&#39;re not even on the team of coach-supporting, <br/>\nkid-pushing moms, it doesn&#39;t sound like.<br/>\n<br/>\nIf you&#39;re freaking out on the side, will your son be trying to decide what to <br/>\n<br/>\ndo based in part on whether it will make you happy?   That&#39;s too much <br/>\nresponsibility for him.&gt;<br/>\n<br/>\nNo, I don&#39;t give him my feelings. Last week he walked out at the end of the <br/>\ngame and did not want to go to the end of game coach huddle thing, we did not <br/>\nforce him, he was angry and upset and we just let him have that. I love that my <br/>\nDH is very OK with who our kids are though he sees what I see.<br/>\n<br/>\n&lt;<br/>\nMaybe you can just tell him once a week or less &quot;You don&#39;t have to go if you <br/>\ndon&#39;t want to.&quot; But if the not going involves practices, that will cost him <br/>\nat <br/>\ngames.&gt;<br/>\n<br/>\nWe did talk about it and I let the decision to go to practice or not be his, <br/>\nI don&#39;t think he realized they would be punitive about it though. Now he <br/>\nknows. <br/>\n<br/>\nJust talking it out or writing it out has helped I can pinpoint my problem, I <br/>\nam just angry at the inconsistency and what I perceive as smugness on their <br/>\npart in letting my son know &quot;the rules.&quot; As my mother would so aptly put it I <br/>\nwant to rip their masks off.<br/>\n<br/>\n&lt;How does your son feel?&gt;<br/>\n<br/>\nI try hard not to give him my anger, that is too much to deal with. <br/>\n<br/>\n&lt;&lt;I <br/>\nIf you really want to do anything, put it in writing.  Then you can polish it <br/>\n<br/>\nand say your whole piece without the coach interrupting or justifying.  Print <br/>\n<br/>\nit out.  Make a copy.  Sign it in pretty ink.  Give it to him in writing so <br/>\nhe can&#39;t forget or misquote or ignore.   <br/>\n<br/>\nIt probably won&#39;t help him, but it might help you.&gt;<br/>\n<br/>\nGood idea, yes, I admit this is all about me and my anger at them. <br/>\n<br/>\n&lt;&lt;I <br/>\nThere are options, though.  Maybe you don&#39;t have to be at every game.&gt;<br/>\n<br/>\nI have skipped a couple of basketball games and I may have to sit out a few <br/>\nbaseball. In a way it is almost a sad thing to sit back from this and see how <br/>\nimportant these sports are to these people. I feel sorry for their kids too <br/>\neven if they seem to enjoy it. It is all done towards a goal, I am sure they are <br/>\nlooking to high school and the college scholarships and we are just not on <br/>\nthat track. It is hard when we are playing for different reasons. <br/>\nLaura<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: A cry for perspective....","postDate":"1075830992","msgId":90185,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5ZC4yMDA2MThjOC4yZDUxM2FkMEBhb2wuY29tPg=="},"prevInTopic":90184,"nextInTopic":90187,"prevInTime":90184,"nextInTime":90186,"topicId":90172,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/3/04 10:48:53 AM, garrisonstuber@bellsouth.net writes: ","messageBody":"<div id=\"ygrps-yiv-1796498651\">In a message dated 2/3/04 10:48:53 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:garrisonstuber@...\">garrisonstuber@...</a> writes:<br/>\n<br/>\n&lt;&lt; You&#39;re dead on about self-fulfilling prophecies (&quot;poor&quot; players play<br/>\n<br/>\n&quot;poorly&quot;--well, duh, with less attention and fewer opportunities . .<br/>\n<br/>\n.), and I think that very much factors in here. &gt;&gt;<br/>\n<br/>\nIf Howard Gardner&#39;s right (and why wouldn&#39;t he be? &lt;g&gt;) then there is an <br/>\nintelligence that covers physical ability (kinesthetic).  More than one for sports <br/>\n(kinesthetic, spatial, logical, interpersonal).<br/>\n<br/>\nSome kids WILL have more than others, whether they spend the whole game <br/>\nplaying or on the bench, whether they go to 40 practices or none.<br/>\n<br/>\nProbably the coaches&#39; kids are better because of genetics and opportunity.  <br/>\nThey were good before the dads decided to coach, probably, rather than the <br/>\nother way around.<br/>\n<br/>\n&lt;&lt;However, that the team(s) are<br/>\n<br/>\nassociated with the church may give you room to speak with the pastor<br/>\n<br/>\nabout your premise and theirs, and s/he may have some perspective on<br/>\n<br/>\nthe whole thing, as well.&gt;&gt;<br/>\n<br/>\nStill, though, if the majority of the kids are enjoying it, it wouldn&#39;t make <br/>\nsense to change the system for one or two kids.<br/>\n<br/>\nVery cool story, Jen.  I&#39;d want to work with him too!<br/>\n<br/>\n-=-On sportsmanship in the face of unfairness:<br/>\n<br/>\nThe other day I was watching &quot;The Apprentice&quot; (the &quot;reality&quot; show<br/>\n<br/>\nwhere D. Trump is &quot;interviewing&quot; for someone to run one of his<br/>\n<br/>\ncompanies for a year).  A fellow named Bowie was chucked (I think<br/>\n<br/>\nbecause he waffled on his answer of who was the worst player), but in<br/>\n<br/>\nhis cab ride of shame, instead of insulting Trump, the other players,<br/>\n<br/>\nor the process, he thanked Trump, the show, and his fellow players,<br/>\n<br/>\nand wished them the best.  If I had a company, I&#39;d have been calling<br/>\n<br/>\nthe guy that night--there&#39;s one classy fellow.  (I&#39;m betting we *DO*<br/>\n<br/>\nsee him hired on by a firm).-=-<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":128695025,"authorName":"Wife2Vegman","from":"Wife2Vegman &lt;wifetovegman2002@...&gt;","profile":"wifetovegman2002","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: A cry for perspective....","postDate":"1075830526","msgId":90184,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwMjAzMTc0ODQ2LjQ2NjQ2LnFtYWlsQHdlYjQxNDE0Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PGJ2b2owbCtsOGIwQGVHcm91cHMuY29tPg=="},"prevInTopic":90179,"nextInTopic":90185,"prevInTime":90182,"nextInTime":90185,"topicId":90172,"numMessagesInTopic":0,"msgSnippet":"... We had a similar experience this past fall with volleyball.  Sarah was playing on a private school s team.  The year before the emphasis had been on fun, ","messageBody":"<div id=\"ygrps-yiv-277018021\">--- Jen Garrison Stuber &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:garrisonstuber@...\">garrisonstuber@...</a>&gt;<br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; The inconsistency is between your premise of team<br/>\n&gt; sports (working as a<br/>\n&gt; team, rotation, fairness, collaboration), and the<br/>\n&gt; coachs&#39; (and other<br/>\n&gt; parents&#39;) premise of team sports (play the &quot;star&quot;<br/>\n&gt; players to win the<br/>\n&gt; game).<br/>\n&gt; <br/>\n&gt; You&#39;re dead on about self-fulfilling prophecies<br/>\n&gt; (&quot;poor&quot; players play<br/>\n&gt; &quot;poorly&quot;--well, duh, with less attention and fewer<br/>\n&gt; opportunities . .<br/>\n&gt; .), and I think that very much factors in here.<br/>\n<br/>\n<br/>\n </span></blockquote>We had a similar experience this past fall with<br/>\nvolleyball.  Sarah was playing on a private school&#39;s<br/>\nteam.  The year before the emphasis had been on fun,<br/>\ngaining experience, and team work.  It was the first<br/>\nyear the school had a team.<br/>\n<br/>\nThis year it was on winning.  <br/>\n<br/>\nThe coach asked the girls if winning was important and<br/>\nif she should play them all equally or put the best<br/>\nplayers in to win.<br/>\n<br/>\nOf course the girls all said to play the best players,<br/>\nbecause who wants to be accused of causing the team to<br/>\nlose and disappoint everyone else, just because of<br/>\ntheir &quot;selfish&quot; desire to play?  Sheesh...<br/>\n<br/>\nThey were still expected to come to all the practices<br/>\nthough, and put in as much effort as the star players.<br/>\n<br/>\n<br/>\n<br/>\n=====<br/>\n--Susan in VA<br/>\nWifetoVegman<br/>\n<br/>\nWhat is most important and valuable about the home as a base for children&#39;s growth into the world is not that it is a better school than the schools, but that it isn&#39;t a school at all.  John Holt<br/>\n<br/>\n__________________________________<br/>\nDo you Yahoo!?<br/>\nYahoo! SiteBuilder - Free web site building tool. Try it!<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://webhosting.yahoo.com/ps/sb/\">http://webhosting.yahoo.com/ps/sb/</a></div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] A cry for perspective....","postDate":"1075825867","msgId":90179,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFjNS4xM2ZlMTYzNS4yZDUxMjZjYkBhb2wuY29tPg=="},"prevInTopic":90172,"nextInTopic":90184,"prevInTime":90178,"nextInTime":90180,"topicId":90172,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/3/04 9:08:04 AM, BonKnit@aol.com writes: ","messageBody":"<div id=\"ygrps-yiv-1236858679\">In a message dated 2/3/04 9:08:04 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:BonKnit@...\">BonKnit@...</a> writes:<br/>\n<br/>\n&lt;&lt; I am angry, I was hoping that it would pass but it is not. My 12yro plays <br/>\nbasketball on our church team, he has played different sports with the same <br/>\nkids <br/>\n(and coaches) for the last several years. He likes to participate and has <br/>\nalways been very happy with being a team player. &gt;&gt;<br/>\n<br/>\nI want to pick three words out of this and tell you what my first impression <br/>\nwas:<br/>\n<br/>\nchurch<br/>\nteam<br/>\nhappy<br/>\n<br/>\n<br/>\nChurches always have and always will have social problems.  Some of them ARE <br/>\nsocial problems.<br/>\n<br/>\nTeams always have and always will have problems.  Either they&#39;re run &quot;fairly&quot; <br/>\nand they stink, or they&#39;re run to win, and that stinks for those who don&#39;t <br/>\nfeel it was fair.  That problem has existed since people said &quot;let&#39;s share.&quot;<br/>\n<br/>\n&quot;Happy&quot; is the main one.  If your so is happy, he will still go.  If he&#39;s not <br/>\nhappy, don&#39;t press him to go.<br/>\n<br/>\nYou can&#39;t change church.  You can&#39;t change teams.<br/>\n<br/>\nAnd part of your complaint is the overinvolvement of parents.  Don&#39;t become <br/>\none.  <br/>\n<br/>\nIf YOUR happiness depends on your son&#39;s happiness, that&#39;s co-dependency.  <br/>\nYou&#39;re not on the team.  You&#39;re not even on the team of coach-supporting, <br/>\nkid-pushing moms, it doesn&#39;t sound like.<br/>\n<br/>\nIf you&#39;re freaking out on the side, will your son be trying to decide what to <br/>\ndo based in part on whether it will make you happy?   That&#39;s too much <br/>\nresponsibility for him.<br/>\n<br/>\nMaybe you can just tell him once a week or less &quot;You don&#39;t have to go if you <br/>\ndon&#39;t want to.&quot; But if the not going involves practices, that will cost him at <br/>\ngames.  <br/>\n<br/>\nNot all kids are great athletes or singers or actors or swimmers, and in a <br/>\ncase in which a team is trying to fulfill a goal, that goal is rarely to give <br/>\neveryone a chance.<br/>\n<br/>\n&lt;&lt;My DH thinks I should let it go, I am gagging on it. &gt;&gt;<br/>\n<br/>\nHow does your son feel?<br/>\n<br/>\n&lt;&lt;I do not want to call <br/>\nand scream at them,&gt;&gt;<br/>\n<br/>\nGood!<br/>\n<br/>\n&lt;&lt; I want to call and explain how this all looks from another POV.&gt;&gt;<br/>\n<br/>\nIf you really want to do anything, put it in writing.  Then you can polish it <br/>\nand say your whole piece without the coach interrupting or justifying.  Print <br/>\nit out.  Make a copy.  Sign it in pretty ink.  Give it to him in writing so <br/>\nhe can&#39;t forget or misquote or ignore.   <br/>\n<br/>\nIt probably won&#39;t help him, but it might help you.<br/>\n<br/>\n&lt;&lt;If I should let it go I need to find a way to look at the situation that <br/>\ndoes now appall me.&gt;&gt;<br/>\n<br/>\nDo you have to go to the games yourself?   Really.  Marty wants to play ice <br/>\nhockey again this coming year.  We bought him skates on Saturday.   We went to <br/>\nthe rink and picked up the schedule.  He would be on the dregs team (our term, <br/>\nnot theirs) for being a homeschooler, with kids from high schools not big <br/>\nenough to have a team, but that&#39;s fine.  But if he does play, I intend to solicit <br/>\nhockey-fan friends of ours to go and cheer him on.  I do NOT want to watch <br/>\nhim play.  I watched him when he was 8/9 and it was not easy.  His dad was in <br/>\nMinneapolis working and so I was the one to take him to games.  I care SO much <br/>\nmore about Marty&#39;s safety and his pretty face than I do about hockey.  It&#39;s so <br/>\nstressful for me that I&#39;m a detriment.<br/>\n<br/>\nDo you think maybe if watching the games makes you a bundle of motherly <br/>\nfrustration that you could just go shopping during games or maybe stay home and <br/>\ncook him his very favorite foods so when he gets home he can tell you the good <br/>\nparts of the game without you editorializing what he says because you saw what <br/>\none of the other dads looked like or heard what one of the moms said?  It seems <br/>\nlike what&#39;s smallish to him is huge to you, perhaps.<br/>\n<br/>\nThere are options, though.  Maybe you don&#39;t have to be at every game.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":160969203,"authorName":"Wendy Carr","from":"&quot;Wendy Carr&quot; &lt;WendyWCarr@...&gt;","profile":"wendycarrga","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] A cry for perspective....","postDate":"1075825173","msgId":90194,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTUtREFWOTRZTU83Z1l2UHIwMDAwNTE1MkBob3RtYWlsLmNvbT4=","referencesHeader":"PGFhLjI3YjM3ZjRlLjJkNTExZjk5QGFvbC5jb20+"},"prevInTopic":90190,"nextInTopic":90195,"prevInTime":90193,"nextInTime":90195,"topicId":90172,"numMessagesInTopic":0,"msgSnippet":"This is one reason I have never put my son in sports! This stuff happens all the time, and I just don t want to deal with it. I hope you figure this out, and","messageBody":"<div id=\"ygrps-yiv-954977631\">This is one reason I have never put my son in sports! This stuff happens all the time, and I just don&#39;t want to deal with it. I hope you figure this out, and soon! Good luck!<br/>\n<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: BonKnit@...&lt;mailto:BonKnit@...&gt; <br/>\n  To: unschoolingdiscussion@yahoogroups.com&lt;mailto:unschoolingdiscussion@yahoogroups.com&gt; <br/>\n  Sent: Tuesday, February 03, 2004 11:00 AM<br/>\n  Subject: [UnschoolingDiscussion] A cry for perspective....<br/>\n<br/>\n<br/>\n         I am not sure this would fall under any unschooling topic but I hope a <br/>\n  few of you can offer me a few options on how I might handle this.<br/>\n<br/>\n  I am angry, I was hoping that it would pass but it is not. My 12yro plays <br/>\n  basketball on our church team, he has played different sports with the same kids <br/>\n  (and coaches) for the last several years. He likes to participate and has <br/>\n  always been very happy with being a team player. I have let a number of issues <br/>\n  pass because he has not had a problem I have. As in most organizations there are <br/>\n  a few fathers that always coach, they have the time and the interest and from <br/>\n  observation I can see how their kids perform is very important to them. The <br/>\n  mothers are exactly the same, they know every sport intimately and can get quite <br/>\n  riled though they keep it within acceptable (so they don&#39;t get thrown out <br/>\n  acceptable) limits. <br/>\n<br/>\n  Except for volleyball which has a mother coaching who is wonderful and fair <br/>\n  my son sits out a good bit. He is a good player but I guess he is not a &quot;star&quot; <br/>\n  player. (I also think how the coach plays a player and the message he sends <br/>\n  affects a persons playing, we live up or down to others expectations but that is <br/>\n  another post)<br/>\n<br/>\n  Both coaches sons are &quot;star&quot; players, there are a number of very good players <br/>\n  on the team. My son missed both practices last week and was therefore <br/>\n  relegated to playing just a few minutes of one quarter. It was never put into words <br/>\n  but a comment made at team picture day Sunday confirmed what we already <br/>\n  thought, sitting out longer than usual was a punitive measure. What really hurt was <br/>\n  that one of our older boys came and also one of my son&#39;s friends. <br/>\n<br/>\n  This is getting wordy, please bear with me. <br/>\n<br/>\n  I am having a real problem with all of this because even if my son went to <br/>\n  both practices he only ever gets to play a quarter at most. I might even be able <br/>\n  to swallow that had I not witnessed this. The assistant Coaches son has a <br/>\n  hard time staying calm, when he is getting stressed because they are behind or he <br/>\n  has made a mistake he does something so that he can act like he is injured so <br/>\n  he can go sit down and cry, when he is finished crying he wants right back in <br/>\n  the game. I watched a few weeks ago this whole scenario and watched him get <br/>\n  back up and say something to his father who right away reached over (they were <br/>\n  having a time out) and tap my son on the shoulder, my son&#39;s face dropped, he <br/>\n  too knew what was going on. This happend every time.<br/>\n<br/>\n  I watched it happen again this week with a different kid since my son was <br/>\n  benched anyhow.<br/>\n<br/>\n  My DH thinks I should let it go, I am gagging on it. I do not want to call <br/>\n  and scream at them, I want to call and explain how this all looks from another <br/>\n  POV.  My son has signed up to play baseball with pretty much the same people <br/>\n  and I am trying to find a way to get through this. <br/>\n<br/>\n  Should I call the coach about the inconsistencies I see or should I let it <br/>\n  go? If I should let it go I need to find a way to look at the situation that <br/>\n  does now appall me.<br/>\n  Help!<br/>\n  Laura<br/>\n<br/>\n<br/>\n  [Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n  &quot;List Posting Policies&quot; are provided in the files area of this group. <br/>\n<br/>\n  To unsubscribe from this send an email to:<br/>\n  UnschoolingDiscussion-unsubscribe@yahoogroups.com <br/>\n<br/>\n  Visit the Unschooling website and message boards: http://www.unschooling.com&lt;http://www.unschooling.com/&gt; <br/>\n<br/>\n<br/>\n        Yahoo! Groups Sponsor <br/>\n              ADVERTISEMENT<br/>\n               &lt;http://rd.yahoo.com/SIG=12cusoors/M=243273.4510124.5685162.1261774/D=egroupweb/S=1705081972:HM/EXP=1075910460/A=1750744/R=0/*http://servedby.advertising.com/click/site=552006/bnum=1075824060640360&gt; <br/>\n       <br/>\n       <br/>\n<br/>\n<br/>\n------------------------------------------------------------------------------<br/>\n  Yahoo! Groups Links<br/>\n<br/>\n    a.. To visit your group on the web, go to:<br/>\n    http://groups.yahoo.com/group/UnschoolingDiscussion/&lt;http://groups.yahoo.com/group/UnschoolingDiscussion/&gt;<br/>\n      <br/>\n    b.. To unsubscribe from this group, send an email to:<br/>\n    UnschoolingDiscussion-unsubscribe@yahoogroups.com&lt;mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com?subject=Unsubscribe&gt;<br/>\n      <br/>\n    c.. Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service&lt;http://docs.yahoo.com/info/terms/&gt;. <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":6770123,"authorName":"BonKnit@aol.com","from":"BonKnit@...","profile":"pampmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"A cry for perspective....","postDate":"1075824025","msgId":90172,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGFhLjI3YjM3ZjRlLjJkNTExZjk5QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":90179,"prevInTime":90171,"nextInTime":90173,"topicId":90172,"numMessagesInTopic":0,"msgSnippet":"I am not sure this would fall under any unschooling topic but I hope a few of you can offer me a few options on how I might handle this. I am angry, I was","messageBody":"<div id=\"ygrps-yiv-328924132\">I am not sure this would fall under any unschooling topic but I hope a <br/>\nfew of you can offer me a few options on how I might handle this.<br/>\n<br/>\nI am angry, I was hoping that it would pass but it is not. My 12yro plays <br/>\nbasketball on our church team, he has played different sports with the same kids <br/>\n(and coaches) for the last several years. He likes to participate and has <br/>\nalways been very happy with being a team player. I have let a number of issues <br/>\npass because he has not had a problem I have. As in most organizations there are <br/>\na few fathers that always coach, they have the time and the interest and from <br/>\nobservation I can see how their kids perform is very important to them. The <br/>\nmothers are exactly the same, they know every sport intimately and can get quite <br/>\nriled though they keep it within acceptable (so they don&#39;t get thrown out <br/>\nacceptable) limits. <br/>\n<br/>\nExcept for volleyball which has a mother coaching who is wonderful and fair <br/>\nmy son sits out a good bit. He is a good player but I guess he is not a &quot;star&quot; <br/>\nplayer. (I also think how the coach plays a player and the message he sends <br/>\naffects a persons playing, we live up or down to others expectations but that is <br/>\nanother post)<br/>\n<br/>\nBoth coaches sons are &quot;star&quot; players, there are a number of very good players <br/>\non the team. My son missed both practices last week and was therefore <br/>\nrelegated to playing just a few minutes of one quarter. It was never put into words <br/>\nbut a comment made at team picture day Sunday confirmed what we already <br/>\nthought, sitting out longer than usual was a punitive measure. What really hurt was <br/>\nthat one of our older boys came and also one of my son&#39;s friends. <br/>\n<br/>\nThis is getting wordy, please bear with me. <br/>\n<br/>\nI am having a real problem with all of this because even if my son went to <br/>\nboth practices he only ever gets to play a quarter at most. I might even be able <br/>\nto swallow that had I not witnessed this. The assistant Coaches son has a <br/>\nhard time staying calm, when he is getting stressed because they are behind or he <br/>\nhas made a mistake he does something so that he can act like he is injured so <br/>\nhe can go sit down and cry, when he is finished crying he wants right back in <br/>\nthe game. I watched a few weeks ago this whole scenario and watched him get <br/>\nback up and say something to his father who right away reached over (they were <br/>\nhaving a time out) and tap my son on the shoulder, my son&#39;s face dropped, he <br/>\ntoo knew what was going on. This happend every time.<br/>\n<br/>\nI watched it happen again this week with a different kid since my son was <br/>\nbenched anyhow.<br/>\n<br/>\nMy DH thinks I should let it go, I am gagging on it. I do not want to call <br/>\nand scream at them, I want to call and explain how this all looks from another <br/>\nPOV.  My son has signed up to play baseball with pretty much the same people <br/>\nand I am trying to find a way to get through this. <br/>\n<br/>\nShould I call the coach about the inconsistencies I see or should I let it <br/>\ngo? If I should let it go I need to find a way to look at the situation that <br/>\ndoes now appall me.<br/>\nHelp!<br/>\nLaura<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":90265,"nextTopicId":90280}}