{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"what kids might/could go (was full time moms or something)","postDate":"1082826945","msgId":93115,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY0LjNhMjRlYWI3LjJkYmJmYWMxQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":93114,"nextInTime":93116,"topicId":93115,"numMessagesInTopic":0,"msgSnippet":"The title got lost, and I m veering away anyway. ","messageBody":"<div id=\"ygrps-yiv-1593595156\">The title got lost, and I&#39;m veering away anyway.<br/>\n<br/>\n&lt;&lt; I suppose it would then be a question of which is more damaging for each <br/>\nchild&#39;s situation...school or a bad home-life. &gt;&gt;<br/>\n<br/>\nBut even a so-so homelife can be worse than school for some kids.  Depends on <br/>\nthe kids.  Depends on the school.<br/>\n<br/>\nI was much better off in school than I would have been home with my mom.  <br/>\n<br/>\nI was thinking this morning at the grocery store that if I couldn&#39;t <br/>\nhomeschool anymore for some reason, Holly wouldn&#39;t mind a bit going to school.   <br/>\nKirby&#39;s too old to matter anymore.  Marty&#39;s almost legal drop-out age (or maybe is) <br/>\nso he&#39;s on the cusp.  And my thoughts wandered on over to the range of <br/>\nhomeschoolers, the stereotypes (and all stereotypes are based on something, they <br/>\ndon&#39;t come out of nowhere), and what school would do to my kids or vice versa.<br/>\n<br/>\nAll my kids would have been good students.  Marty would have been better in <br/>\nsports and math than language-related stuff, probably; same as his dad, <br/>\ndyslexic leftie.  Holly would have been popular and succeeded in music and sports if <br/>\nshe had an interest in either, and probably be a straight A student.<br/>\n<br/>\nSchool hurts even kids like that, but because it wouldn&#39;t crush the life out <br/>\nof them, I could live with them going to school, and it wouldn&#39;t be as bad <br/>\nbecause they wouldn&#39;t have me and their dad shoving from the other side saying <br/>\n&quot;The teachers are right&quot; and &quot;No allowance until your grades are up&quot; or &quot;No <br/>\nmusic or TV until your homework is done.&quot;   We could buffer their experiences.<br/>\n<br/>\nBut if I had a child who was physically handicapped, or had a serious speech <br/>\ndefect, or was even an FLK (funny-looking-kid, used by special ed teachers of <br/>\nkids with head deformations from forceps or injury or fetal alcohol syndrome; <br/>\nnot all of them are brain damaged, but sometimes there are brain damage <br/>\nsituatios that show in the formation of the head),  I would not subject him to that <br/>\nhall of doom.    <br/>\n<br/>\nOne of the saddest things I ever hear (and I&#39;ve heard or read it lots) is in <br/>\nan account of a child who is terminally ill or has a condition that shortens <br/>\nlife, it seems they always work in before the article or interview is over that <br/>\nthe child is going to go to school so his life can be as normal as possible.<br/>\n<br/>\nWhy go to school if you&#39;re about to die?  Why not Italy?  The Bahamas?  <br/>\nDisney World?<br/>\n<br/>\nAnd then the question is why go to school if you&#39;re going to live?  <br/>\n<br/>\nBut given all imaginable factors, unschooling isn&#39;t for everyone and school <br/>\nwon&#39;t destroy EVERY child.<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":93110,"nextTopicId":92840}}