{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":99936689,"authorName":"mozafamily","from":"&quot;mozafamily&quot; &lt;mozafamily@...&gt;","profile":"mozafamily","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Help with legalities","postDate":"1095183711","msgId":20794,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNpN2FnditoZG5xQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGQxLjE2YWFiMGYxLjJlNzgzMjEwQGFvbC5jb20+"},"prevInTopic":20788,"nextInTopic":0,"prevInTime":20793,"nextInTime":20795,"topicId":20783,"numMessagesInTopic":0,"msgSnippet":"I m not sure if it would help but I bought one just so I could look at it - The Life is Learning Curriculum guides- even the author admits it s unnecessary for","messageBody":"<div id=\"ygrps-yiv-921907638\">I&#39;m not sure if it would help but I bought one just so I could look <br/>\nat it - The Life is Learning Curriculum guides- even the author <br/>\nadmits it&#39;s unnecessary for those who &quot;get&quot; unschooling, but for <br/>\nthose starting out or for someone who HAS to have a curriculum to <br/>\nmeet some requirement it could be helpful and it does <br/>\nprovide &quot;lists&quot; of things children should be doing around certain <br/>\ngrade levels and give ideas for kids to learn concepts without <br/>\nschool. It&#39;s availabe through the www.FUN-books.com website. <br/>\nDefinately look for more resources in your own country though - I <br/>\ncan&#39;t stress that enough. Moza</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Help with legalities","postDate":"1095161872","msgId":20788,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQxLjE2YWFiMGYxLjJlNzgzMjEwQGFvbC5jb20+"},"prevInTopic":20787,"nextInTopic":20794,"prevInTime":20787,"nextInTime":20789,"topicId":20783,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/14/2004 2:54:24 AM Eastern Daylight Time, sward@xtra.co.nz writes: As  you  can see not exactly friendly to unschoolers.  How can I tone","messageBody":"<div id=\"ygrps-yiv-759774035\">In a message dated 9/14/2004 2:54:24 AM Eastern Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sward@...\">sward@...</a> writes:<br/>\n<br/>\nAs  you  can see not exactly friendly to unschoolers.  How can I tone it  <br/>\ndown, argue for its exclusion or advise unschoolers how to cope with  it?<br/>\n<br/>\nAny and all suggestions gratefully  received.&lt;&lt;&lt;<br/>\n <br/>\nHave you seen Carol Narigon&#39;s curriculum? It might fit the bill.<br/>\n <br/>\n_<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/unschoolingcurriculum_\">http://sandradodd.com/unschoolingcurriculum_</a> <br/>\n(<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/unschoolingcurriculum)\">http://sandradodd.com/unschoolingcurriculum)</a> <br/>\n <br/>\n <br/>\n    <br/>\nCAROL NARIGON&#39;S UNSCHOOLING CURRICULUM<br/>\n<br/>\nIn case an unschooler is required to submit a curriculum, here  is one Carol <br/>\nwrote, and has generously offered as a model for other families  in need. <br/>\nThere are variations on this, using California  requirements, below. <br/>\nBrandon will use a developmentally-appropriate, integrated curriculum. We  <br/>\nwill plan his learning together, based on his interests, so I can&#39;t state in  <br/>\nadvance which specific topical areas we will cover, however we expect to cover  <br/>\nthe following subjects. <br/>\nHe will read from self-chosen and parent-chosen literature on a daily basis.  <br/>\nHe will engage in reflection on those literature pieces in one or many of the <br/>\n following ways: journal writing, book reviews, conversations, drama based on <br/>\nthe  books, book clubs. My goal is for Brandon to continue to enjoy reading, <br/>\nto read  for pleasure, to gain exposure to a wide variety of genres, and to be <br/>\nable to  reflect critically on what he reads.  <br/>\nBrandon will read content-area non-fiction materials as needed to support his <br/>\n chosen areas of interest. He will reflect on these pieces in one, or many, <br/>\nof  the following ways: journal writing, writing an article for submission to a <br/>\n magazine, discussions, development of a scrapbook in an area of interest. My <br/>\n goal is for Brandon to learn to read critically for information, to <br/>\nunderstand  and be able to reflect on the materials he reads and to be able to compare <br/>\nthem  to other sources of information, and to learn how and where to find <br/>\nwritten  resources as needed. <br/>\nBrandon will study science as it relates to the areas of his interests by  <br/>\nwatching science videos, reading related written materials, conducting  <br/>\nscientific experiments, gardening, keeping journals, making and recording  <br/>\nobservations, visiting scientists in their work places, taking classes at the  Dayton <br/>\nMuseum of Discovery, participating in science fairs, earning science  merit <br/>\nbadges through Boy Scouts, visiting museums such as COSI and the  Indianapolis <br/>\nChildren’s Museum and through cooperative classes with our  homeschool group. My <br/>\ngoal is for Brandon to experience a wide range of  scientific exposure in his <br/>\nareas of interest, to develop a positive interest in  science, to learn to <br/>\nthink scientifically, to develop a respect for the work  scientists do and to <br/>\nunderstand the importance science has in his daily  life. <br/>\nWriting, spelling and grammar will be covered as part of Brandon&#39;s writing  <br/>\nprocesses. He expects to write creatively, to write letters and lists, to <br/>\ncreate  and write drama pieces, etc. He will also write in conjunction with Boy <br/>\nScout  merit badges. My goal is for Brandon to enjoy writing, to gain skills in <br/>\nboth  the writing process and in technical skills required of an edited piece, <br/>\nand to  develop a sense of power over the written word. <br/>\nHistory and geography will follow the same plan outlined for the above  <br/>\nsubjects. Brandon will read historical fiction and non-fiction, participating in  <br/>\nfield trips such as the Renaissance Festival, Carillon Park, Union Station in  <br/>\nCincinnati and the Fair at New Boston. We expect to integrate history and  <br/>\ngeography into our study of other subjects through one or many or the following  <br/>\nways: the use of time lines and maps, discussion, journal writing, cooking,  <br/>\nplays, road trips, invention building, Scout camping trips and art. My goal is  <br/>\nfor Brandon to appreciate the nuances and fluidity of history, to recognize <br/>\nhis  place in history, and to enjoy and understand the importance of his <br/>\nknowledge of  history. <br/>\nHealth, physical education and safety will be continued as a part of our  <br/>\ndaily living skills. Brandon will learn to care for his body and his physical  <br/>\nenvironment through one or many of the following ways: shopping for and  <br/>\npreparing food, discussing the necessity of a healthy diet, participation in  fire <br/>\ndrills and other emergency preparedness, exercise both as play and as part  of a <br/>\nstructured group experience, and through Boy Scout camping, merit badges  and <br/>\nclasses. My goal is for Brandon to appreciate the necessity of a healthy  <br/>\nbody and to learn to care for his body&#39;s needs as he understands them. <br/>\nBrandon will learn art and music through both self-chosen and structured  <br/>\nmethods including one, or many, of the following: art classes at Rosewood, DAI,  <br/>\nor the K-12 Gallery, piano and guitar lessons, choral singing, listening to  <br/>\nvarious styles of music, learning through reading and videos about the people  <br/>\nwho have influenced music through history, and working on self-chosen art  <br/>\nprojects and Boy Scout badges that relate to music and art. He has been and will  <br/>\ncontinue to be active as an actor and performer in various community theaters <br/>\nin  the Dayton area. My goal is for Brandon to appreciate a wide variety of <br/>\nart and  music experiences, including performance, while understanding the <br/>\nimportance of  art and music as it pertains to history. In addition, he will be <br/>\nspending time  at our family framing and print store where he will meet a <br/>\nvariety of artists  and learn about many facets of the art business. <br/>\nBrandon will learn math through participation in daily living—cooking,  <br/>\nbuilding, shopping, etc. In addition, he will continue using the Key to…math  <br/>\nseries for algebra and geometry as well as Mathematics a Human Endeavor and  <br/>\nAlgebra by Harold Jacobs. My goal is for Brandon to gain conceptual knowledge of  <br/>\nmathematics as well as an appreciation for the daily application of math in his  <br/>\nlife.  <br/>\nList of basic teaching materials.  <br/>\n    *   encyclopedias  <br/>\n    *   dictionaries  <br/>\n    *   atlases  <br/>\n    *   reference books and materials ( such as textbooks, field guides, <br/>\ngrammar  books, timelines, globe maps, etc.)  <br/>\n    *   newspapers  <br/>\n    *   magazines (including Muse, Zillions, Boys Life, Reader’s Digest, <br/>\nNewsweek,  Scientific American Frontiers)  <br/>\n    *   library loan books, tapes, magazines, etc.  <br/>\n    *   educational games  <br/>\n    *   educational computer software and on-line services  <br/>\n    *   calculating and measuring tools and utensils  <br/>\n    *   art, craft and writing supplies  <br/>\n    *   musical instruments  <br/>\n    *   audio-visual equipment and materials  <br/>\n    *   religious materials  <br/>\n    *   science lab equipment  <br/>\n    *   sports equipment  <br/>\n    *   kitchen equipment  <br/>\n    *   gardening tools  <br/>\n    *   carpentry tools  <br/>\n    *   home maintenance equipment  <br/>\n    *   community resources (such as museums, stage performances, sports <br/>\nprograms,  private lessons, volunteer opportunities)  <br/>\n    *   Boy Scout materials  <br/>\n    *   live animals—dog, rats, horses, etc  <br/>\n    *   garden and yard <br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [AlwaysLearning] Help with legalities","postDate":"1095158568","msgId":20787,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PDAwMGMwMWM0OWEyNyQ4NTA4MWQwMCQwMjAxYThjMEBXYXJkMj4="},"prevInTopic":20783,"nextInTopic":20788,"prevInTime":20786,"nextInTime":20788,"topicId":20783,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1973372771\">&lt;&lt;&lt;&lt;&quot;Whatever source of curriculum guidance you select, you should be<br/>\nspecific about the skills you want your child to learn and you should be<br/>\nclear about the maturity level and abilities of your child in relation to<br/>\nyour curriculum.&quot;<br/>\n<br/>\nAs you  can see not exactly friendly to unschoolers.  How can I tone it<br/>\ndown, argue for its exclusion or advise unschoolers how to cope with it?&gt;&gt;&gt;&gt;<br/>\n<br/>\nIt seems to me that what you might really need is some legal advice from<br/>\nqualified people familiar with the education statutes in NZ. They can check<br/>\nthat the law actually did change, and not just some civil servant&#39;s<br/>\ndefinition of it within the Department. Sometimes here in California the<br/>\nDepartment of Education sends out intimidating sounding letters that are<br/>\nactually outside of the statutes, and make excessive demands. Knowing the<br/>\nlaw allows us to just not respond to what is more than the law requires. <br/>\n<br/>\nI guess in the States here that have reporting, the parents translate the<br/>\ndaily ordinary living activities into eduationese for their reports, but<br/>\ndon&#39;t actually make any demands on their children to alter their ways of<br/>\nlearning. Sometimes people use the education statutes as their curriculum<br/>\nguidance for paperwork purposes because of the fantastic word &quot;offer&quot;. They<br/>\nmust &quot;offer&quot; instruction in various areas - but there is no compulsion on<br/>\nanyone to take what is offered!<br/>\n<br/>\nLooking at this again, I wonder if that statement can be taken as the<br/>\nEducation department trying to protect kids from being pushed too far, or<br/>\nmade to do too much work, rather than as a trawling expedition to catch<br/>\nUnschoolers.<br/>\n<br/>\nUnschoolers&#39; sources of curriculum guidance are the diverse interests,<br/>\nmercurial passions, and personal goals of our individual children. The<br/>\nskills we would expect them to attain and master are those which enhance<br/>\ntheir abilities to pursue those interests. While always supported in<br/>\nstretching their skills and facilitated in expanding their understanding of<br/>\ntheir areas of enthusiasm, no Unschooler would be expected to advance in any<br/>\narea beyond their individual comfort level, nor on any timetable set by<br/>\nanyone other than the learner him or herself.<br/>\n<br/>\nThat&#39;s how I might answer the question - provided I could do so legally.<br/>\n<br/>\nRobyn L. Coburn <br/>\n<br/>\n<br/>\n---<br/>\nOutgoing mail is certified Virus Free.<br/>\nChecked by AVG anti-virus system (http://www.grisoft.com).<br/>\nVersion: 6.0.752 / Virus Database: 503 - Release Date: 9/3/2004</div>","specialLinks":[]},{"userId":7858840,"authorName":"Julie W","from":"&quot;Julie W&quot; &lt;sward@...&gt;","profile":"snoozem404","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Help with legalities","postDate":"1095144799","msgId":20783,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMGMwMWM0OWEyNyQ4NTA4MWQwMCQwMjAxYThjMEBXYXJkMj4="},"prevInTopic":0,"nextInTopic":20787,"prevInTime":20782,"nextInTime":20784,"topicId":20783,"numMessagesInTopic":0,"msgSnippet":"Hi, Generally I lurk here and soak up ideas but I need a bit for help from some experienced and articulate unschoolers. In New Zealand we are required to apply","messageBody":"<div id=\"ygrps-yiv-1178712277\">Hi,<br/>\n<br/>\nGenerally I lurk here and soak up ideas but I need a bit for help from some experienced and articulate unschoolers.  <br/>\n<br/>\nIn New Zealand we are required to apply to the government for an exemption from compulsory schooling in order to keep our children out of school.  The Ministry of Education puts out guidelines for applying and we gather it does refuse up to 10 per cent of applicants.  We are trying to deal with changes to the application pack - or avert the worst aspects of it - and I am struggling to deal with this thorny little clause in the application pack.<br/>\n<br/>\n&quot;Whatever source of curriculum guidance you select, you should be specific about the skills you want your child to learn and you should be clear about the maturity level and abilities of your child in relation to your curriculum.&quot;<br/>\n<br/>\nAs you  can see not exactly friendly to unschoolers.  How can I tone it down, argue for its exclusion or advise unschoolers how to cope with it?<br/>\n<br/>\nAny and all suggestions gratefully received.<br/>\n<br/>\nThanks,<br/>\n<br/>\nJulie W<br/>\nWellington, New Zealand<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":20752,"nextTopicId":20790}}