{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":117187741,"authorName":"unolist@aol.com","from":"unolist@...","profile":"unolist","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Spanking for us","postDate":"1050611028","msgId":65323,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5MS4xODU1ZmYyNy4yYmQwNjc1NEBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":65322,"nextInTime":65324,"topicId":65323,"numMessagesInTopic":0,"msgSnippet":"Last night was an unbelievable night. My 10yo daughter Megan accidentally put her hand on a stove burner that had been cooling down after being very hot for a","messageBody":"<div id=\"ygrps-yiv-2001929414\">Last night was an unbelievable night. My 10yo daughter Megan accidentally put <br/>\nher hand on a stove burner that had been cooling down after being very hot <br/>\nfor a period of time. Dh thought she was fine, and just wanted her to go to <br/>\nbed. We tried that. She said her fingers were hurting worse and turning <br/>\nwhite. <br/>\n<br/>\nWe ended up in the ER all night treating second-degree burns on her left <br/>\nhand, three of her fingertips. She is glad it is her left and not her right, <br/>\nshe is right handed. But she will have to stop teaching herself chords on the <br/>\nguitar for a while I think. Dh was tired and he knew we would be in for a <br/>\nlate night, and he&#39;d rather I not make such a fuss. I don&#39;t think he believed <br/>\nit was as bad as it was. But after the conversation we had I am about to talk <br/>\nabout, he wouldn&#39;t fight me. <br/>\n<br/>\nAnyway, my 3yo Ashlyn was visibly upset by my older daughter&#39;s pain, before <br/>\nwe tried going to bed. I don&#39;t think my dh caught on. She was then playing in <br/>\nthe sandbox on our back screenporch (it was late, she was tired and upset) <br/>\nand she bit her little 1yo brother. Her daddy immediately grabbed her and <br/>\nspanked her butt and sent her to the corner. <br/>\n<br/>\nI then said that is it. No more. From either of us. He was defensive at <br/>\nfirst, but I had to talk him through it. I reminded him of a conversation a <br/>\nfew weeks ago he had with Megan, saying that he hates to spank her and <br/>\nsometimes she just needs her reset button hit. I reminded him that he said <br/>\nthat &quot;Mommy doesn&#39;t like spanking, she read all these books when you were a <br/>\nbaby, about time out and other things instead. So it takes a lot for her to <br/>\nlet me spank you.&quot;  I reminded him of the conversation last week where I said <br/>\nAshlyn is already lying, in fear of getting spanked or punished. I think just <br/>\nknowing Megan gets spanked causes her to be afraid. <br/>\n<br/>\nI told him that we spanked because we simply didn&#39;t know what else to do. <br/>\nThat we have been wrong about a lot of things, like school and obedience and <br/>\npunishment, and that it won&#39;t continue. <br/>\n<br/>\nI told him that he didn&#39;t know the 3yo&#39;s personality as well as I did, and <br/>\nthat upset him. I had to rephrase it to I know her temperament differently <br/>\nthan you do. And I never wanted the day to come that she would get spanked, <br/>\njust like with Megan.<br/>\n<br/>\nHe wasn&#39;t in the car the day before when this child, my 3yo cried for 45 <br/>\nminutes that she didn&#39;t like my sister (her favorite aunt) anymore because <br/>\nshe didn&#39;t like a toy she gave her. Instead of berating her for being a <br/>\nselfish brat, I let her go on and on until I understood what she was saying. <br/>\nShe meant she thought she liked her, but she must not since she treated her <br/>\nbadly, and she was upset that she acted that way. She felt bad for acting <br/>\nlike she didn&#39;t like her, that&#39;s why she cried that she didn&#39;t like her for <br/>\n45 minutes. <br/>\n<br/>\n I spanked Ashlyn once a few weeks ago and immediately hugged her and <br/>\napologized. I knew it was wrong. I knew that allowing spanking with Megan to <br/>\ncontinue was wrong. I hated it. He thought it was necessary. I made him take <br/>\nher out of sight of the other kids, it wasn&#39;t fair to upset them. <br/>\n<br/>\nWhy I let it continue as long as I did, I&#39;ll always regret. Just like I&#39;ll <br/>\nregret forcing her to go to school as long as I did. I still lose my temper <br/>\nand yell and scold, but it gets better every day. I am not the tyrant I used <br/>\nto be. I knew being yelled at and verbally berated was wrong and hurtful, <br/>\nthat&#39;s how I grew up. But it seemed to be the programmed response in me. <br/>\n<br/>\nIt has taken a lot to change those reflexive behaviors, and a lot to admit <br/>\nsome of it on an email list. But if it can help break the cycle for someone <br/>\nelse or show how much a simple homeschooling method can change lives, I have <br/>\nnothing to hide. <br/>\n<br/>\nThe fact that my daughter somehow still trusts me, knows that I love her, and <br/>\ndoesn&#39;t want to escape me and go to school is more than I can wrap my mind <br/>\naround. Our family is growing stronger every day, sometimes by trial, but we <br/>\nhelp each other get through it. Wow. <br/>\n<br/>\nAng <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":65308,"nextTopicId":65310}}