{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":0,"authorName":"Lynda","from":"&quot;Lynda&quot; &lt;lurine@...&gt;","replyTo":"LIST","senderId":"3j1shyBiXDCSeqmAJjIbY-PsYWvAdGrfONKOuLfR6PJDhJgfl9TAPJi-9F-COlUdWtV_xiKzKFrLWSVQe6WAViZE8Q","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] request for input (long)","postDate":"982455827","msgId":16539,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAyZjAwMWMwOTk0NCQ5ZjE1YjY0MCQyNjVkZDFkMUBsZGlvbm5vPg==","referencesHeader":"PE1BQkJMUERKSUpQS0RERUxFSkZOQ0VPRUNCQUEuc25tYW5uc0BhdHRjYW5hZGEuY2E+"},"prevInTopic":16532,"nextInTopic":0,"prevInTime":16538,"nextInTime":16540,"topicId":16531,"numMessagesInTopic":0,"msgSnippet":"Hello, Nicoletta, With the program I use to work with (ICWA), we immediately asked the court to appoint CASA or an attorney for the child.  The child should","messageBody":"<div id=\"ygrps-yiv-1112030623\">Hello, Nicoletta,<br/>\n<br/>\nWith the program I use to work with (ICWA), we immediately asked the court<br/>\nto appoint CASA or an attorney for the child.  The child should have an<br/>\nattorney or advocacy group of his own, independent of SS (ever wonder if the<br/>\ninitials are a freudian slip?) and be sure that the family be given a number<br/>\nto choose between so that you can be sure the attorney has not been a SS<br/>\nadvocate in the past.<br/>\n<br/>\nAlmost all states require this but it is rarely followed through on because<br/>\nthe families don&#39;t know that the law has an option for this.  You can also<br/>\nget the court to order an independent psych to do an eval as SS&#39;s are<br/>\nbiased.  You also want an independent psych eval for your nephew.<br/>\n<br/>\nIf you can set something up in Canada (work, house/apartment, etc.) for the<br/>\nmother in advance, that is also another plus.<br/>\n<br/>\nI wouldn&#39;t have any contact with Social Services at all.  Deal directly with<br/>\nthe court because anything you say/do with SS is usually twisted to meet<br/>\ntheir perverted needs.<br/>\n<br/>\nLynda<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message -----<br/>\nFrom: &quot;Nicoletta Manns&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:snmanns@...\">snmanns@...</a>&gt;<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:snmanns@...\">snmanns@...</a>&gt;<br/>\nSent: Saturday, February 17, 2001 9:06 AM<br/>\nSubject: [Unschooling-dotcom] request for input (long)<br/>\n<br/>\n<br/>\n&gt; Below I have added a couple of communications between myself and James W.<br/>\n&gt; Prescott (www.violence.de).  If anyone has anything to offer besides what<br/>\n&gt; Jim said, I would appreciate the input.<br/>\n&gt;<br/>\n&gt; ~Nicoletta<br/>\n&gt; *********************************************************<br/>\n&gt; &quot;It is paradoxical, yet true: Children are the most in<br/>\n&gt; need of loving attention when they act the least<br/>\n&gt; deserving of it!&quot;<br/>\n&gt;                      by Aletha Solter, 1998<br/>\n&gt;     from the article &quot;Why Children Misbehave&quot;<br/>\n&gt;                   www.awareparenting.com<br/>\n&gt; *********************************************************<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Dear Jim,<br/>\n&gt;<br/>\n&gt; I am faced with a situation where I would like some input, before I decide<br/>\n&gt; to jump in; something I very much want to, since it involves my<br/>\n&gt; eight-year-old nephew and his mother, my half-sister.<br/>\n&gt;<br/>\n&gt; James (that is my nephew) was taken away from his mom (Maya) by social<br/>\n&gt; services during the first week of November of 2000. The events leading up<br/>\nto<br/>\n&gt; this were as follows (according to my sister): they had just moved to a<br/>\n&gt; different district (New York area) and James had just gone to school for<br/>\n&gt; three days. On the fourth day, a Friday, James (and his whole school) was<br/>\n&gt; dismissed early; something his mother was not made aware of; she is a<br/>\nsingle<br/>\n&gt; working mom. When nobody was present to receive James from the school bus<br/>\n&gt; that day (because he wasn&#39;t expected until an hour later), the bus driver<br/>\n&gt; took him back to school, the principal called social services, social<br/>\n&gt; services checked their records and found that my sister had been involved<br/>\n&gt; with them on previous occasion in 1997. Therefore social services called<br/>\nthe<br/>\n&gt; police to show up at my sister&#39;s house, while they took James and placed<br/>\nhim<br/>\n&gt; in foster care. Social Services claims that James is not well enough<br/>\n&gt; supervised while in Maya&#39;s care; he is not being abused, she doesn&#39;t do<br/>\n&gt; drugs or anything of that nature. The only thing they have against her is<br/>\n&gt; that in their (social services) opinion, Maya is not supervising James<br/>\n&gt; enough. Maya was &quot;forced&quot; to attend counselling with a psychiatrist chosen<br/>\n&gt; by social services. After three hours spread out over several sessions,<br/>\n&gt; costing Maya $ 25 a session, this psychiatrist determined that Maya &quot;does<br/>\n&gt; not have the ability to know when her son might be in danger&quot;. As a result<br/>\n&gt; of this testimony, the judge ruled against Maya getting James back. He has<br/>\n&gt; been through two foster homes and three different schools in less than<br/>\nthree<br/>\n&gt; months. Maya has seen once or twice, talks to him on the phone whenever<br/>\nshe<br/>\n&gt; can. James cries to her every time she calls; he wants to be with her,<br/>\n&gt; misses her terribly and she him. Maya says that one way that she could get<br/>\n&gt; him back would be for a family member to apply for temporary guardianship<br/>\nof<br/>\n&gt; James; if accepted James would be released into the guardian&#39;s care and<br/>\nthen<br/>\n&gt; Maya could take it from there, i.e. get James back from the guardian and<br/>\nget<br/>\n&gt; on with their lives.<br/>\n&gt;<br/>\n&gt; Maya is a Canadian citizen, James has dual citizenship<br/>\n&gt; US/Canadian (born in the US). Maya has been in trouble in the past, a<br/>\nresult<br/>\n&gt; of having been abandoned herself by her own mother at age 9 (given up for<br/>\n&gt; adoption), moving through several foster homes, group homes, etc. Since<br/>\nshe<br/>\n&gt; has had James, however, I have witnessed her making a great effort to turn<br/>\n&gt; her life around. She has raised this child for eight years on her own.<br/>\n&gt;<br/>\n&gt; I am a German citizen with Canadian landed immigrant status, my husband is<br/>\na<br/>\n&gt; US citizen with Canadian landed immigrant status. We both love James very<br/>\n&gt; much, have had him stay with us several times; and we want to help Maya<br/>\nand<br/>\n&gt; James get re-united. Maya wants to get James out of where he is now, and<br/>\n&gt; move back to Canada and start over. Besides myself she only has an elderly<br/>\n&gt; grandmother and another sister who is single and running a business of her<br/>\n&gt; own. I am really the only suitable candidate to apply for this<br/>\nguardianship<br/>\n&gt; of James and I want to very much, just to get him out of the situation he<br/>\nis<br/>\n&gt; in and to make sure he sees his mom.<br/>\n&gt;<br/>\n&gt; Those are the bare bones of the situation and I would imagine you need<br/>\nmore<br/>\n&gt; to give any real suggestions or advice or feedback; and I would be more<br/>\nthan<br/>\n&gt; happy to provide more info, once I get more. I am going to talk to Maya&#39;s<br/>\n&gt; lawyer today to find out more.<br/>\n&gt;<br/>\n&gt; Is there anything at all you could offer at this point?<br/>\n&gt;<br/>\n&gt; Sincerely,<br/>\n&gt;<br/>\n&gt; ~Nicoletta<br/>\n&gt; *********************************************************<br/>\n&gt; &quot;It is paradoxical, yet true: Children are the most in<br/>\n&gt; need of loving attention when they act the least<br/>\n&gt; deserving of it!&quot;<br/>\n&gt;                      by Aletha Solter, 1998<br/>\n&gt;     from the article &quot;Why Children Misbehave&quot;<br/>\n&gt;                   www.awareparenting.com<br/>\n&gt; *********************************************************<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; 13 February 2001<br/>\n&gt;<br/>\n&gt; Dear Nicoletta,<br/>\n&gt;<br/>\n&gt; I am indeed sorry to hear about the separation of your nephew from<br/>\n&gt; his mother and from what you have described is totally unwarranted.<br/>\n&gt; You do need to consult with her attorney on how best to proceed and<br/>\n&gt; your suggestion to obtain guardianship is a good one.<br/>\n&gt;<br/>\n&gt; You should have Maya contact the Canadian Embassy immediately for any<br/>\n&gt; help that they can provide, as she and her son are Canadian citizens.<br/>\n&gt;<br/>\n&gt; Contact The New York Times with your story and for help. A person to<br/>\n&gt; email your story to: Laurel Graeber Columnist, Family Fare<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:graeber@...\">graeber@...</a><br/>\n&gt;<br/>\n&gt; If she cannot be of help, ask her who on the NYT would be willing to<br/>\n&gt; take up Maya&#39;s struggle to have her son returned to her, as there is<br/>\n&gt; no evidence of abuse and neglect nor harm or injury inflicted upon<br/>\n&gt; the child. Single moms are being continually punished by various<br/>\n&gt; elements of our society including the Social Services Administration,<br/>\n&gt; which is exploiting a situation created by the Public School system,<br/>\n&gt; as I understand the facts and which is inflicting serious emotional<br/>\n&gt; harm on the child by wrongfully removing him from his mother.  Such<br/>\n&gt; removal of child from mother, under these circumstances, constitutes<br/>\n&gt; &quot;child emotional endangerment&quot; by the SSA, which is supposed to<br/>\n&gt; protect children not harm them.<br/>\n&gt;<br/>\n&gt; Let me know what happens and I wish that I could be of more help to<br/>\n&gt; you. You might want to reference some of my studies posted at<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.violence.de\">http://www.violence.de</a> which documents the harmful effects of<br/>\n&gt; mother-infant/child separation upon the child, particularly the film<br/>\n&gt; documentary at: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.violence.de/tv/rockabye.html\">http://www.violence.de/tv/rockabye.html</a><br/>\n&gt;<br/>\n&gt; Michael Mendizza of Touch the Future might also be of help and I am<br/>\n&gt; copying this email to him.<br/>\n&gt;<br/>\n&gt; Keep fighting--<br/>\n&gt;<br/>\n&gt; jim<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Dear Jim,<br/>\n&gt;<br/>\n&gt; thank you very much for your support. Below is an article that came to me<br/>\n&gt; just two days after I found out about what happened to my sister and her<br/>\n&gt; son. Isn&#39;t THAT ironic!! I will send this and whatever info I have to the<br/>\n&gt; person you suggested at the New York Times. And I will keep you up to date<br/>\n&gt; on what happens.<br/>\n&gt;<br/>\n&gt; ~Nicoletta<br/>\n&gt; *********************************************************<br/>\n&gt; &quot;It is paradoxical, yet true: Children are the most in<br/>\n&gt; need of loving attention when they act the least<br/>\n&gt; deserving of it!&quot;<br/>\n&gt;                      by Aletha Solter, 1998<br/>\n&gt;     from the article &quot;Why Children Misbehave&quot;<br/>\n&gt;                   www.awareparenting.com<br/>\n&gt; *********************************************************<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &lt;&lt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.cpswatch.com/reports/treasure.htm\">http://www.cpswatch.com/reports/treasure.htm</a><br/>\n&gt;<br/>\n&gt;  Treasure Chest of Misery<br/>\n&gt;<br/>\n&gt;   by Doug Quirmbach<br/>\n&gt;<br/>\n&gt;  State child protective agencies are increasingly removing children<br/>\n&gt;  from their homes to take advantage of federal funding programs,<br/>\n&gt;  according to nationally recognized child welfare experts.<br/>\n&gt;<br/>\n&gt;  Recent studies conducted by child advocacy organizations and<br/>\n&gt;  governmental agencies disclose that caseworkers are opting to<br/>\n&gt;  forcibly take children from their parents rather than providing<br/>\n&gt;  family preservation services.  The Center on Child Abuse Prevention<br/>\n&gt;  Research (1998) reported that &quot;the number of children who<br/>\n&gt;  received<br/>\n&gt;  services at home declined from 1,244,400 in 1977 to 493,100 in<br/>\n&gt;  1994&quot;<br/>\n&gt;  (p. 6).  During the same period, the amount of children taken out of<br/>\n&gt;  their homes skyrocketed -- 502,000 children were in foster care<br/>\n&gt;  placement in 1994.<br/>\n&gt;<br/>\n&gt;  &quot;While 30% of the children served by the system in 1977 were<br/>\n&gt;  placed<br/>\n&gt;  in foster care, that percentage has risen to 50% today,&quot; the<br/>\n&gt;  researchers reported. &quot;Despite the good intentions of reformers,<br/>\n&gt;  this<br/>\n&gt;  service system (CPS) is increasingly relying upon foster care<br/>\n&gt;  placement . . . .&quot; (Center on Child Abuse Prevention Research,<br/>\n&gt;  1998:6).<br/>\n&gt;<br/>\n&gt;  Parents face increasing risk of losing their children because of the<br/>\n&gt;  way federal funds are categorized and funneled to the states.  Each<br/>\n&gt;  entitlement category is earmarked for specific purposes.<br/>\n&gt;<br/>\n&gt;  &quot;Without clear direction, states provided those services that were<br/>\n&gt;  most &#39;fungible,&#39; that is, generated the most matching revenue from<br/>\n&gt;  the federal Government,&quot; explain child welfare experts Lela B.<br/>\n&gt;  Costin, Howard Jacob Karger and David Stoesz (1996:152).<br/>\n&gt;<br/>\n&gt;  &quot;Because most of the funding for child abuse and neglect is derived<br/>\n&gt;  from Title IV-B and Title XX, both of which are capped, states must<br/>\n&gt;  rely on other child welfare components in order to mount child<br/>\n&gt;  protection efforts,&quot; Costin and her co-authors write (1996:152).<br/>\n&gt;  Therefore, the experts say, foster care has &quot;become the ex post facto<br/>\n&gt;  response to child abuse.&quot;<br/>\n&gt;<br/>\n&gt;  Limitless funds are available to the states through Title IV-E,<br/>\n&gt;  earmarked for out-of-home placement.  State agencies increase their<br/>\n&gt;  overall revenue by removing children from their homes since money<br/>\n&gt;  from Title IV-E is channeled to the states in direct proportion to<br/>\n&gt;  how many children they incarcerate into the system.<br/>\n&gt;<br/>\n&gt;  &quot;In either case, federal funding [for Title IV-E] is open-ended; once<br/>\n&gt;  the state appropriates revenues for child welfare, the federal match<br/>\n&gt;  is essentially demand-driven and therefore guaranteed (Costin, et<br/>\n&gt;  al., 1996). &quot;This arrangement, of course, creates an enormous<br/>\n&gt;  incentive for states to maximize the amount of money that can be<br/>\n&gt;  extracted from the federal government.&quot;<br/>\n&gt;<br/>\n&gt;  The Children&#39;s Defense fund (1988) reports that 77% of combined<br/>\n&gt;  funding for child welfare prevention services went for foster care<br/>\n&gt;  and adoption services (CDF, 1988). The percentage has since<br/>\n&gt;  increased.  Kathleen Faller told Congress last year that 9 out of 10<br/>\n&gt;  federal child welfare dollars flow to the states through foster care<br/>\n&gt;  entitlements.<br/>\n&gt;<br/>\n&gt;  Federal and state taxpayer funds are just the tip of the treasure<br/>\n&gt;  chest available to agencies once they remove a child.<br/>\n&gt;<br/>\n&gt;  After federal and state funds have been collected for foster care,<br/>\n&gt;  the agency then &quot;double dips&quot; by charging the parents for the same<br/>\n&gt;  care. Once the child is in state custody, the agency can then claim<br/>\n&gt;  the child&#39;s SDI benefits, effectively robbing from the child&#39;s<br/>\n&gt;  future. &quot;Victim Compensation&quot; funds are collected by the child&#39;s new<br/>\n&gt;  caretaker -- the state -- along with other entitlements.<br/>\n&gt;<br/>\n&gt;  Training expenses under IV-E is open-ended and pays a return of<br/>\n&gt;  75%. &quot;Independent Learning&quot; programs for those unfortunate children<br/>\n&gt;  who have struggled under state custody is reimbursed at 100% with no<br/>\n&gt;  state participation at all (Green Book, 1993). Adoption assistance<br/>\n&gt;  for foster kids under Title IV-E is open-ended and the contribution<br/>\n&gt;  is limited only to Medicaid rates (Green Book, 1993).<br/>\n&gt;<br/>\n&gt;  Over 3.2 million reports of child abuse and neglect were made to<br/>\n&gt;  child protective hot lines in 1996.  Two-thirds of the reports, often<br/>\n&gt;  made anonymously by disgruntled neighbors or parties involved in<br/>\n&gt;  custody disputes, were unfounded (NCANDS, 1998).  While only 3 to 5%<br/>\n&gt;  of the reports that are substantiated by child protective services<br/>\n&gt;  involve serious child maltreatment, CCAPR discovered that children<br/>\n&gt;  were removed from their homes in 50% of the cases.<br/>\n&gt;<br/>\n&gt;  The San Diego Grand Jury determined that funding arrangements<br/>\n&gt;  contributed to overzealous CPS caseworkers wrongfully yanking<br/>\n&gt;  children from their parents.  The Los Angeles County Board of<br/>\n&gt;  Supervisors investigated foster care practices in that county and<br/>\n&gt;  issued a scathing report. Mr. Digre, who departed as director after<br/>\n&gt;  the investigation, seemed to scapegoat the federal grant programs as<br/>\n&gt;  contributing to DSS&#39;s horrendous treatment of its tiny wards.<br/>\n&gt;<br/>\n&gt;  Yet California is not at all unique. State agencies throughout the<br/>\n&gt;  country incarcerate children because it pays to do so.<br/>\n&gt;<br/>\n&gt;  Agencies get considerably more federal and state funds for removing a<br/>\n&gt;  child from his home than they do in making reasonable efforts to<br/>\n&gt;  preserve the family. For the child welfare agency, the choice is<br/>\n&gt;  obvious. Any bureaucracy can be expected to consider first continuing<br/>\n&gt;  its own interests.<br/>\n&gt;<br/>\n&gt;  But what about the interests of our tinniest, most vulnerable of<br/>\n&gt;  citizens?<br/>\n&gt;<br/>\n&gt;  Certainly, the tragic personal costs to a child wrongfully removed<br/>\n&gt;  from her loving home overwhelms any dollar amount we can ever<br/>\n&gt;  determine. The damage done to a child through institutional child<br/>\n&gt;  abuse is irreparable.<br/>\n&gt;<br/>\n&gt;  Children and their families desperately need advocates willing to<br/>\n&gt;  voice their opposition to the wholesale, governmental kidnapping of<br/>\n&gt;  this nation&#39;s kids.  But children and their families are not<br/>\n&gt;  given a<br/>\n&gt;  voice because, of course, it doesn&#39;t pay.<br/>\n&gt;<br/>\n&gt;  -------<br/>\n&gt;  References<br/>\n&gt;<br/>\n&gt;  Center on Child Abuse Prevention Research. (1998). Current Trends in<br/>\n&gt;  Child Abuse Reporting and Fatalities: The Results of the 1997 Fifty<br/>\n&gt;  State Survey.  Chicago: Prevent Child Abuse America.<br/>\n&gt;<br/>\n&gt;  Children&#39;s Defense Fund. (1988). A children&#39;s defense budget, fiscal<br/>\n&gt;  year 1989: An Analysis of our nation&#39;s investment in children.<br/>\n&gt;  Washington, DC: (Author).<br/>\n&gt;<br/>\n&gt;  Costin, Lela, Karger, Howard J., Stoesz, David. (1996). The politics<br/>\n&gt;  of child abuse in America. New York: Oxford University Press.<br/>\n&gt;<br/>\n&gt;  US Department of Health and Human Services. (1998).  Child<br/>\n&gt;  Maltreatment 1996: Reports from the states to the National Child<br/>\n&gt;  Abuse and Neglect Data System.  Washington, DC: US Government<br/>\n&gt;  Printing Office<br/>\n&gt;<br/>\n&gt;  US House of Representatives, Committee on Ways and Means. (1993).<br/>\n&gt;<br/>\n&gt;  Overview of entitlement programs, 1993 green book. Washington, DC: US<br/>\n&gt;  Government Printing Office.<br/>\n&gt;<br/>\n&gt; *********************************<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Message boards, timely articles, a free newsletter and more!<br/>\n&gt; Check it all out at: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n&gt;<br/>\n&gt; Addresses:<br/>\n&gt; Post message: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@egroups.com\">Unschooling-dotcom@egroups.com</a><br/>\n&gt; Unsubscribe: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-unsubscribe@egroups.com\">Unschooling-dotcom-unsubscribe@egroups.com</a><br/>\n&gt; List owner: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-owner@egroups.com\">Unschooling-dotcom-owner@egroups.com</a><br/>\n&gt; List settings page: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.egroups.com/group/Unschooling-dotcom\">http://www.egroups.com/group/Unschooling-dotcom</a><br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":0,"authorName":"Nicoletta Manns","from":"&quot;Nicoletta Manns&quot; &lt;snmanns@...&gt;","replyTo":"LIST","senderId":"7FfD2mMhzyyqFxb_tg3l-gSvEZ7kpsJ5uRwlqlmmzIK2TNQUbuYUyNTK3FAZUvBzgrW05ZtlmvcT0MXIf86QkXiK8vv-Jx1xCMIEPtROUg","spamInfo":{"isSpam":false,"reason":"0"},"subject":"request for input (long)","postDate":"982429607","msgId":16531,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PE1BQkJMUERKSUpQS0RERUxFSkZOQ0VPRUNCQUEuc25tYW5uc0BhdHRjYW5hZGEuY2E+"},"prevInTopic":0,"nextInTopic":16532,"prevInTime":16530,"nextInTime":16532,"topicId":16531,"numMessagesInTopic":0,"msgSnippet":"Below I have added a couple of communications between myself and James W. Prescott (www.violence.de).  If anyone has anything to offer besides what Jim said, I","messageBody":"<div id=\"ygrps-yiv-72242047\">Below I have added a couple of communications between myself and James W.<br/>\nPrescott (www.violence.de).  If anyone has anything to offer besides what<br/>\nJim said, I would appreciate the input.<br/>\n<br/>\n~Nicoletta<br/>\n*********************************************************<br/>\n&quot;It is paradoxical, yet true: Children are the most in<br/>\nneed of loving attention when they act the least<br/>\ndeserving of it!&quot;<br/>\n                     by Aletha Solter, 1998<br/>\n    from the article &quot;Why Children Misbehave&quot;<br/>\n                  www.awareparenting.com<br/>\n*********************************************************<br/>\n<br/>\n<br/>\n<br/>\nDear Jim,<br/>\n<br/>\nI am faced with a situation where I would like some input, before I decide<br/>\nto jump in; something I very much want to, since it involves my<br/>\neight-year-old nephew and his mother, my half-sister.<br/>\n<br/>\nJames (that is my nephew) was taken away from his mom (Maya) by social<br/>\nservices during the first week of November of 2000. The events leading up to<br/>\nthis were as follows (according to my sister): they had just moved to a<br/>\ndifferent district (New York area) and James had just gone to school for<br/>\nthree days. On the fourth day, a Friday, James (and his whole school) was<br/>\ndismissed early; something his mother was not made aware of; she is a single<br/>\nworking mom. When nobody was present to receive James from the school bus<br/>\nthat day (because he wasn&#39;t expected until an hour later), the bus driver<br/>\ntook him back to school, the principal called social services, social<br/>\nservices checked their records and found that my sister had been involved<br/>\nwith them on previous occasion in 1997. Therefore social services called the<br/>\npolice to show up at my sister&#39;s house, while they took James and placed him<br/>\nin foster care. Social Services claims that James is not well enough<br/>\nsupervised while in Maya&#39;s care; he is not being abused, she doesn&#39;t do<br/>\ndrugs or anything of that nature. The only thing they have against her is<br/>\nthat in their (social services) opinion, Maya is not supervising James<br/>\nenough. Maya was &quot;forced&quot; to attend counselling with a psychiatrist chosen<br/>\nby social services. After three hours spread out over several sessions,<br/>\ncosting Maya $ 25 a session, this psychiatrist determined that Maya &quot;does<br/>\nnot have the ability to know when her son might be in danger&quot;. As a result<br/>\nof this testimony, the judge ruled against Maya getting James back. He has<br/>\nbeen through two foster homes and three different schools in less than three<br/>\nmonths. Maya has seen once or twice, talks to him on the phone whenever she<br/>\ncan. James cries to her every time she calls; he wants to be with her,<br/>\nmisses her terribly and she him. Maya says that one way that she could get<br/>\nhim back would be for a family member to apply for temporary guardianship of<br/>\nJames; if accepted James would be released into the guardian&#39;s care and then<br/>\nMaya could take it from there, i.e. get James back from the guardian and get<br/>\non with their lives.<br/>\n<br/>\nMaya is a Canadian citizen, James has dual citizenship<br/>\nUS/Canadian (born in the US). Maya has been in trouble in the past, a result<br/>\nof having been abandoned herself by her own mother at age 9 (given up for<br/>\nadoption), moving through several foster homes, group homes, etc. Since she<br/>\nhas had James, however, I have witnessed her making a great effort to turn<br/>\nher life around. She has raised this child for eight years on her own.<br/>\n<br/>\nI am a German citizen with Canadian landed immigrant status, my husband is a<br/>\nUS citizen with Canadian landed immigrant status. We both love James very<br/>\nmuch, have had him stay with us several times; and we want to help Maya and<br/>\nJames get re-united. Maya wants to get James out of where he is now, and<br/>\nmove back to Canada and start over. Besides myself she only has an elderly<br/>\ngrandmother and another sister who is single and running a business of her<br/>\nown. I am really the only suitable candidate to apply for this guardianship<br/>\nof James and I want to very much, just to get him out of the situation he is<br/>\nin and to make sure he sees his mom.<br/>\n<br/>\nThose are the bare bones of the situation and I would imagine you need more<br/>\nto give any real suggestions or advice or feedback; and I would be more than<br/>\nhappy to provide more info, once I get more. I am going to talk to Maya&#39;s<br/>\nlawyer today to find out more.<br/>\n<br/>\nIs there anything at all you could offer at this point?<br/>\n<br/>\nSincerely,<br/>\n<br/>\n~Nicoletta<br/>\n*********************************************************<br/>\n&quot;It is paradoxical, yet true: Children are the most in<br/>\nneed of loving attention when they act the least<br/>\ndeserving of it!&quot;<br/>\n                     by Aletha Solter, 1998<br/>\n    from the article &quot;Why Children Misbehave&quot;<br/>\n                  www.awareparenting.com<br/>\n*********************************************************<br/>\n<br/>\n<br/>\n<br/>\n13 February 2001<br/>\n<br/>\nDear Nicoletta,<br/>\n<br/>\nI am indeed sorry to hear about the separation of your nephew from<br/>\nhis mother and from what you have described is totally unwarranted.<br/>\nYou do need to consult with her attorney on how best to proceed and<br/>\nyour suggestion to obtain guardianship is a good one.<br/>\n<br/>\nYou should have Maya contact the Canadian Embassy immediately for any<br/>\nhelp that they can provide, as she and her son are Canadian citizens.<br/>\n<br/>\nContact The New York Times with your story and for help. A person to<br/>\nemail your story to: Laurel Graeber\tColumnist, Family Fare<br/>\n\t<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:graeber@...\">graeber@...</a><br/>\n<br/>\nIf she cannot be of help, ask her who on the NYT would be willing to<br/>\ntake up Maya&#39;s struggle to have her son returned to her, as there is<br/>\nno evidence of abuse and neglect nor harm or injury inflicted upon<br/>\nthe child. Single moms are being continually punished by various<br/>\nelements of our society including the Social Services Administration,<br/>\nwhich is exploiting a situation created by the Public School system,<br/>\nas I understand the facts and which is inflicting serious emotional<br/>\nharm on the child by wrongfully removing him from his mother.  Such<br/>\nremoval of child from mother, under these circumstances, constitutes<br/>\n&quot;child emotional endangerment&quot; by the SSA, which is supposed to<br/>\nprotect children not harm them.<br/>\n<br/>\nLet me know what happens and I wish that I could be of more help to<br/>\nyou. You might want to reference some of my studies posted at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.violence.de\">http://www.violence.de</a> which documents the harmful effects of<br/>\nmother-infant/child separation upon the child, particularly the film<br/>\ndocumentary at: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.violence.de/tv/rockabye.html\">http://www.violence.de/tv/rockabye.html</a><br/>\n<br/>\nMichael Mendizza of Touch the Future might also be of help and I am<br/>\ncopying this email to him.<br/>\n<br/>\nKeep fighting--<br/>\n<br/>\njim<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nDear Jim,<br/>\n<br/>\nthank you very much for your support. Below is an article that came to me<br/>\njust two days after I found out about what happened to my sister and her<br/>\nson. Isn&#39;t THAT ironic!! I will send this and whatever info I have to the<br/>\nperson you suggested at the New York Times. And I will keep you up to date<br/>\non what happens.<br/>\n<br/>\n~Nicoletta<br/>\n*********************************************************<br/>\n&quot;It is paradoxical, yet true: Children are the most in<br/>\nneed of loving attention when they act the least<br/>\ndeserving of it!&quot;<br/>\n                     by Aletha Solter, 1998<br/>\n    from the article &quot;Why Children Misbehave&quot;<br/>\n                  www.awareparenting.com<br/>\n*********************************************************<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n&lt;&lt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.cpswatch.com/reports/treasure.htm\">http://www.cpswatch.com/reports/treasure.htm</a><br/>\n<br/>\n Treasure Chest of Misery<br/>\n<br/>\n  by Doug Quirmbach<br/>\n<br/>\n State child protective agencies are increasingly removing children<br/>\n from their homes to take advantage of federal funding programs,<br/>\n according to nationally recognized child welfare experts.<br/>\n<br/>\n Recent studies conducted by child advocacy organizations and<br/>\n governmental agencies disclose that caseworkers are opting to<br/>\n forcibly take children from their parents rather than providing<br/>\n family preservation services.  The Center on Child Abuse Prevention<br/>\n Research (1998) reported that &quot;the number of children who<br/>\n received<br/>\n services at home declined from 1,244,400 in 1977 to 493,100 in<br/>\n 1994&quot;<br/>\n (p. 6).  During the same period, the amount of children taken out of<br/>\n their homes skyrocketed -- 502,000 children were in foster care<br/>\n placement in 1994.<br/>\n<br/>\n &quot;While 30% of the children served by the system in 1977 were<br/>\n placed<br/>\n in foster care, that percentage has risen to 50% today,&quot; the<br/>\n researchers reported. &quot;Despite the good intentions of reformers,<br/>\n this<br/>\n service system (CPS) is increasingly relying upon foster care<br/>\n placement . . . .&quot; (Center on Child Abuse Prevention Research,<br/>\n 1998:6).<br/>\n<br/>\n Parents face increasing risk of losing their children because of the<br/>\n way federal funds are categorized and funneled to the states.  Each<br/>\n entitlement category is earmarked for specific purposes.<br/>\n<br/>\n &quot;Without clear direction, states provided those services that were<br/>\n most &#39;fungible,&#39; that is, generated the most matching revenue from<br/>\n the federal Government,&quot; explain child welfare experts Lela B.<br/>\n Costin, Howard Jacob Karger and David Stoesz (1996:152).<br/>\n<br/>\n &quot;Because most of the funding for child abuse and neglect is derived<br/>\n from Title IV-B and Title XX, both of which are capped, states must<br/>\n rely on other child welfare components in order to mount child<br/>\n protection efforts,&quot; Costin and her co-authors write (1996:152).<br/>\n Therefore, the experts say, foster care has &quot;become the ex post facto<br/>\n response to child abuse.&quot;<br/>\n<br/>\n Limitless funds are available to the states through Title IV-E,<br/>\n earmarked for out-of-home placement.  State agencies increase their<br/>\n overall revenue by removing children from their homes since money<br/>\n from Title IV-E is channeled to the states in direct proportion to<br/>\n how many children they incarcerate into the system.<br/>\n<br/>\n &quot;In either case, federal funding [for Title IV-E] is open-ended; once<br/>\n the state appropriates revenues for child welfare, the federal match<br/>\n is essentially demand-driven and therefore guaranteed (Costin, et<br/>\n al., 1996). &quot;This arrangement, of course, creates an enormous<br/>\n incentive for states to maximize the amount of money that can be<br/>\n extracted from the federal government.&quot;<br/>\n<br/>\n The Children&#39;s Defense fund (1988) reports that 77% of combined<br/>\n funding for child welfare prevention services went for foster care<br/>\n and adoption services (CDF, 1988). The percentage has since<br/>\n increased.  Kathleen Faller told Congress last year that 9 out of 10<br/>\n federal child welfare dollars flow to the states through foster care<br/>\n entitlements.<br/>\n<br/>\n Federal and state taxpayer funds are just the tip of the treasure<br/>\n chest available to agencies once they remove a child.<br/>\n<br/>\n After federal and state funds have been collected for foster care,<br/>\n the agency then &quot;double dips&quot; by charging the parents for the same<br/>\n care. Once the child is in state custody, the agency can then claim<br/>\n the child&#39;s SDI benefits, effectively robbing from the child&#39;s<br/>\n future. &quot;Victim Compensation&quot; funds are collected by the child&#39;s new<br/>\n caretaker -- the state -- along with other entitlements.<br/>\n<br/>\n Training expenses under IV-E is open-ended and pays a return of<br/>\n 75%. &quot;Independent Learning&quot; programs for those unfortunate children<br/>\n who have struggled under state custody is reimbursed at 100% with no<br/>\n state participation at all (Green Book, 1993). Adoption assistance<br/>\n for foster kids under Title IV-E is open-ended and the contribution<br/>\n is limited only to Medicaid rates (Green Book, 1993).<br/>\n<br/>\n Over 3.2 million reports of child abuse and neglect were made to<br/>\n child protective hot lines in 1996.  Two-thirds of the reports, often<br/>\n made anonymously by disgruntled neighbors or parties involved in<br/>\n custody disputes, were unfounded (NCANDS, 1998).  While only 3 to 5%<br/>\n of the reports that are substantiated by child protective services<br/>\n involve serious child maltreatment, CCAPR discovered that children<br/>\n were removed from their homes in 50% of the cases.<br/>\n<br/>\n The San Diego Grand Jury determined that funding arrangements<br/>\n contributed to overzealous CPS caseworkers wrongfully yanking<br/>\n children from their parents.  The Los Angeles County Board of<br/>\n Supervisors investigated foster care practices in that county and<br/>\n issued a scathing report. Mr. Digre, who departed as director after<br/>\n the investigation, seemed to scapegoat the federal grant programs as<br/>\n contributing to DSS&#39;s horrendous treatment of its tiny wards.<br/>\n<br/>\n Yet California is not at all unique. State agencies throughout the<br/>\n country incarcerate children because it pays to do so.<br/>\n<br/>\n Agencies get considerably more federal and state funds for removing a<br/>\n child from his home than they do in making reasonable efforts to<br/>\n preserve the family. For the child welfare agency, the choice is<br/>\n obvious. Any bureaucracy can be expected to consider first continuing<br/>\n its own interests.<br/>\n<br/>\n But what about the interests of our tinniest, most vulnerable of<br/>\n citizens?<br/>\n<br/>\n Certainly, the tragic personal costs to a child wrongfully removed<br/>\n from her loving home overwhelms any dollar amount we can ever<br/>\n determine. The damage done to a child through institutional child<br/>\n abuse is irreparable.<br/>\n<br/>\n Children and their families desperately need advocates willing to<br/>\n voice their opposition to the wholesale, governmental kidnapping of<br/>\n this nation&#39;s kids.  But children and their families are not<br/>\n given a<br/>\n voice because, of course, it doesn&#39;t pay.<br/>\n<br/>\n -------<br/>\n References<br/>\n<br/>\n Center on Child Abuse Prevention Research. (1998). Current Trends in<br/>\n Child Abuse Reporting and Fatalities: The Results of the 1997 Fifty<br/>\n State Survey.  Chicago: Prevent Child Abuse America.<br/>\n<br/>\n Children&#39;s Defense Fund. (1988). A children&#39;s defense budget, fiscal<br/>\n year 1989: An Analysis of our nation&#39;s investment in children.<br/>\n Washington, DC: (Author).<br/>\n<br/>\n Costin, Lela, Karger, Howard J., Stoesz, David. (1996). The politics<br/>\n of child abuse in America. New York: Oxford University Press.<br/>\n<br/>\n US Department of Health and Human Services. (1998).  Child<br/>\n Maltreatment 1996: Reports from the states to the National Child<br/>\n Abuse and Neglect Data System.  Washington, DC: US Government<br/>\n Printing Office<br/>\n<br/>\n US House of Representatives, Committee on Ways and Means. (1993).<br/>\n<br/>\n Overview of entitlement programs, 1993 green book. Washington, DC: US<br/>\n Government Printing Office.<br/>\n<br/>\n*********************************</div>","specialLinks":[]},{"userId":0,"authorName":"Kerry Kibort","from":"Kerry Kibort &lt;kkibort@...&gt;","replyTo":"LIST","senderId":"ZwZ9XFrr1FcllZaohhSQfzf02pU3qKpvk1r_LUWG0MzawqAtzK4rIobHWLrwbHV5J1SUgfGvgwzQ2Umn3uExbR2aw64wip8","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] request for input (long)","postDate":"982420916","msgId":16532,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDEwMjE3MTQ0MTU2LjYwNjU4LnFtYWlsQHdlYjkwMDcubWFpbC55YWhvby5jb20+","inReplyToHeader":"PE1BQkJMUERKSUpQS0RERUxFSkZOQ0VPRUNCQUEuc25tYW5uc0BhdHRjYW5hZGEuY2E+"},"prevInTopic":16531,"nextInTopic":16539,"prevInTime":16531,"nextInTime":16533,"topicId":16531,"numMessagesInTopic":0,"msgSnippet":"For what its worth, go with your heart and make this work out. Of course, waiting on lawyers to fix it will take a long time, while he rots way in foster car, ","messageBody":"<div id=\"ygrps-yiv-1911677774\">For what its worth, go with your heart and make this<br/>\nwork out. Of course, waiting on lawyers to fix it will<br/>\ntake a long time, while he rots way in foster car,<br/>\npossibly being abused. Take him home, take her home,<br/>\ndo whatever you can to make this family whole again. A<br/>\nsimilar situation happened last year in my family, and<br/>\nwhile we waited on the courts, my dear cousin was<br/>\nfound dead, of natural causes , at 4 years old, in<br/>\nfoster care. I know this is not always the case, but<br/>\neven if it is SOMETIMES the case, isnt it worth it to<br/>\ntake charge yourself?<br/>\nKerry</div>","specialLinks":[]}],"prevTopicId":16527,"nextTopicId":16564}}