{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":170364620,"authorName":"we3deeves@aol.com","from":"we3deeves@...","profile":"emmasmama99","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [LAUnschoolers] Re: advice for Derek to learn his electronics math (thanks!!","postDate":"1110127052","msgId":104207,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFhOS4zMzE1NDM0My4yZjVjOGJjY0Bhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":104206,"nextInTime":104208,"topicId":104207,"numMessagesInTopic":0,"msgSnippet":"LAUnschooler, Louise, wanted to say THANKS! Thanks  for all of the advice in this email, and from the several others  I received.  Some things we ve already","messageBody":"<div id=\"ygrps-yiv-1127450373\">LAUnschooler, Louise, wanted to say THANKS!<br/>\n<br/>\nThanks  for all of the advice in this email, and from the several others  I<br/>\nreceived.  Some things we&#39;ve already done in the past for Derek and  they<br/>\ntruly have been a benefit.  We give him old appliances and  gadgets all the<br/>\ntime, and before we throw out any large appliances we let  him explore it for<br/>\nawhile.  He has electronic kits and digital books  and experiments daily with<br/>\nthose.  He frequently is &quot;frankensteining&quot;  bits and pieces he takes from old<br/>\nappliances and has made an electronic  fan, an toy airboat, a small plane<br/>\nthat moves across the floor with LED  lights that flash, and a motorized car.<br/>\nANd he&#39;s always coming to me with  conversations about amp&#39;s and wattage and<br/>\nother stuff I have zero knowledge  about.  This past week he has built his<br/>\nown workshop in the backyard  and it&#39;s a solid building built with much<br/>\nprecision, and he next gets to  install electricity in it. To boot, he&#39;s<br/>\nalready been commissioned to build  a similar workshop for a homeschooling<br/>\nfamily we know and stands to make  some good money from it! (this workshop is<br/>\nimpressive).  I know he  understands much of the math involved with<br/>\nelectronics just from seeing the  stuff he builds.  And if he starts making<br/>\nmoney from his endeavors, I  suppose he&#39;ll learn the math that I struggle<br/>\nwith daily (budgets, finances,  taxes, etc.:-)<br/>\n<br/>\nFor his next stage of electronics that he has eagerly  expressed a wanting to<br/>\nlearn, we are going to combine a few things from  others advice and our own.<br/>\nWe&#39;re going to acquire some advanced math books  (thanks for the ones<br/>\nsuggested!) that explain formula&#39;s and such and have  them available to Derek<br/>\nwhen he&#39;s ready to pour through them.  We&#39;re  also going to purchase Derek a<br/>\nmore advanced calculator than the basic one  he has.  He uses it frequently,<br/>\nso I am pretty sure he&#39;ll appreciate  the more advanced one that works<br/>\nformula&#39;s and such.  I&#39;ll also look  for those electronic know-how video&#39;s<br/>\nsuggested.  In addition, his  father has said he needs about two hours this<br/>\nweek to spend one-on-one with  Derek to show him the math he&#39;s needing as it<br/>\nrelates directly to the  electronics he&#39;s wanting to learn about.  After this<br/>\napproach we&#39;ll  see if we need to hire a tutor as well, but I&#39;ll start<br/>\nlooking now so I  have a few resources if the time comes. In the meantime,<br/>\nDerek is enjoying  the math computer games, and the cooking he gets to do.<br/>\n(we enjoy his  cooking too!).<br/>\nThis plan brings me a big sigh of relief because we have  never followed a<br/>\ncurriculum and embrace letting Derek explore his interests  at his own pace.<br/>\nI knew I would get some great ideas from the LAUnschooling  group that didn&#39;t<br/>\ninvolve that nasty &quot;C&quot; word. (I was a bit surprised to  get one advice to<br/>\nfollow a curriculum from a radical unschooler  group).   Anywho, many THANKS<br/>\nagain for the wonderful  advice.  At least now when our babies get older and<br/>\nwant to learn this  stuff, I can tell them &quot;Go see Derek!!&quot;.<br/>\n<br/>\nCiao!<br/>\nLouise<br/>\n<br/>\n-----  Original Message -----<br/>\n<br/>\nGosh....what horrible advice!  Math doesn&#39;t have to be  taught<br/>\n<blockquote><span title=\"ireply\"> &gt; incrementally, and doesn&#39;t have to be taught with  textbooks.  Blech!<br/>\n&gt;<br/>\n&gt; Suggestions:<br/>\n&gt;<br/>\n&gt;  1)   Visit a tv repair shop when it isn&#39;t busy and talk to the  guy<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":104153,"nextTopicId":104212}}