{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":150527288,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Learning joyfully","postDate":"1081438310","msgId":19262,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM1M3I5NitxNHRxQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":19261,"nextInTime":19263,"topicId":19262,"numMessagesInTopic":0,"msgSnippet":"We ve had so many really great experiences and happy learning going on lately, I wanted to write about a couple cool moments. We live with a wetlands butting","messageBody":"<div id=\"ygrps-yiv-685103411\">We&#39;ve had so many really great experiences and happy learning going <br/>\non lately, I wanted to write about a couple cool moments.<br/>\n<br/>\nWe live with a wetlands butting up to our property, a smallish pond <br/>\nwith turtles, fish and even occasional herons or hawks dropping <br/>\nin....yes, right in the middle of town.  The pond has provided a lot <br/>\nof interest all along, but a couple of weeks ago, the pond moved into <br/>\nour yard in the form of an egg laying turtle.<br/>\nShe hiked all the way from the pond in the back of the house, to the <br/>\nfront yard (almost to the sidewalk) and started digging a hole. Dh <br/>\nsaw her and called us out to watch. She began depositing eggs in the <br/>\nhole as we observed, really cool! So now we&#39;re anxiously watching the <br/>\narea and hoping to see baby turtled heading for the pond at some <br/>\npoint.<br/>\nI set up a water garden not far from the pond and the kids have been <br/>\nhappily trying to gater tadpoles and fish to live in our water <br/>\ngarden. It&#39;s trickier than it would seem. They&#39;ve had a bucket, a <br/>\npole and a shovel at different times, trying to scoop and scare <br/>\nthings into being caught. So far, mostly failure. But we&#39;ve had fun <br/>\nand I managed to gather three tadpoles yesterday. Jared said &quot;those <br/>\naren&#39;t new tadpoles, I think they&#39;re in stage three already&quot;. He <br/>\nknows the stages of tadpoles? Cripes, where do they learn this stuff?<br/>\n<br/>\nA local storyteller invited us to his performance at Jazzfest on <br/>\nSunday, so Sierra, Jalen and I headed down to watch, while Mark and <br/>\nthe boys went up to the college track for some frisbee and golf <br/>\npractice.<br/>\nWe spread our blanket out under a big oak tree and listened to a band <br/>\nperform before Mike came on. Jalen was boogeying, running in circles <br/>\ngetting the blanket all dirty and hiding in some bushes behind us.<br/>\nWhen Mike started, the kids all gathered around his feet and helped <br/>\nwith the performance. It was so cute to see Jalen and Sierra jamming <br/>\non kazoos and harmonicas...I think Jalen got more spit flowing than <br/>\nsound! :)<br/>\n<br/>\nYesterday was a cool moment too....even though we just hung out at <br/>\nhome and mostly stayed in due to rain (except for pond ventures). Our <br/>\nPlaystation had quit working about 1.5 weeks ago, I figured all of <br/>\nour electronic equipment was going to start dying or something! <br/>\nTrevor had taken it apart himself and tried to clean it and make sure <br/>\nit wasn&#39;t just dust. Didn&#39;t work.<br/>\nSo last night, he decided to research typical Playstation problems <br/>\nand how to fix it yourself. He was determined. He spent about 45 <br/>\nminutes online trying to find the info. he needed...most of the &quot;fix <br/>\nit yourself&quot; type guides cost about $35 and he&#39;d decided it was going <br/>\nto be free. His determination paid off and he went back to his room <br/>\nand took the durn thing apart again. I saw him in their with about 50 <br/>\nQ-tips, cleaning the laser and various parts he&#39;d read about.<br/>\nAnd it worked! The Playstation that they were ready to ditch is <br/>\nworking fine, and he has the satisfaction of knowing that he figured <br/>\nit out himself. Even my dh didn&#39;t have a clue how to deal with the <br/>\nthing. Unschooling rocks.<br/>\n<br/>\nRen</div>","specialLinks":[]}],"prevTopicId":19261,"nextTopicId":19263}}