{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":76178688,"authorName":"jennifer.neary","from":"&quot;jennifer.neary&quot; &lt;pcjen@...&gt;","profile":"jennifer.neary","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: and now for something completely different.....","postDate":"1264256531","msgId":49907,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhqZjBtaitzdmJrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDRCNThDMDEzLjMwMzA1MDhAZWFydGhsaW5rLm5ldD4="},"prevInTopic":49861,"nextInTopic":0,"prevInTime":49906,"nextInTime":49908,"topicId":49850,"numMessagesInTopic":0,"msgSnippet":"Hey!  He forgot unschooling!! I couldn t get that Shouting in a Monotone Voice of a Drill Sergeant out of my head while I was reading this.  This is incredible","messageBody":"<div id=\"ygrps-yiv-558619572\">Hey!  He forgot unschooling!!<br/>\n<br/>\nI couldn&#39;t get that Shouting in a Monotone Voice of a Drill Sergeant out of my head while I was reading this.  This is incredible and a real reminder and wake up call(via bugle)that we unschoolers are certainly forging a different, and better, path.<br/>\n<br/>\nFavorite part: &quot;Make your bed immediately after the feet hit the floor. Put away sleeping attire and then dress appropriately for the day.&quot;  (Sleeping attire??  As Bill Murray said in Stripes, &quot;Don&#39;t you think this guy&#39;s overdoing it a bit?&quot;)<br/>\n<br/>\nJennie <br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Pam Sorooshian &lt;pamsoroosh@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; EFFECTIVE HOME SCHOOLING IS LIKE GOOD MILITARY STRATEGY<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] and now for something completely different.....","postDate":"1264111924","msgId":49861,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcxNzg3Qjc1LURGODEtNDE3Qy1CNTk0LTdFQjc0NTU0RTgxMUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDQzODA5My44Mzg1Mi5xbUB3ZWI4MTUwNy5tYWlsLm11ZC55YWhvby5jb20+","referencesHeader":"PDRCNThDMDEzLjMwMzA1MDhAZWFydGhsaW5rLm5ldD4gPDQzODA5My44Mzg1Mi5xbUB3ZWI4MTUwNy5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":49853,"nextInTopic":49907,"prevInTime":49860,"nextInTime":49862,"topicId":49850,"numMessagesInTopic":0,"msgSnippet":"-=-SO he wanted to  raise soldiers not kids right?-=- Yes, Ma am! [from another thread] -=-I m a he. -=- Sorry, Sir! Sandra [Non-text portions of this message","messageBody":"<div id=\"ygrps-yiv-1022294422\">-=-SO he wanted to  raise soldiers not kids right?-=-<br/>\n<br/>\nYes, Ma&#39;am!<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[from another thread]<br/>\n<br/>\n-=-I&#39;m a he. -=-<br/>\n<br/>\nSorry, Sir!<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] and now for something completely different.....","postDate":"1264108683","msgId":49853,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQzODA5My44Mzg1Mi5xbUB3ZWI4MTUwNy5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PDRCNThDMDEzLjMwMzA1MDhAZWFydGhsaW5rLm5ldD4=","referencesHeader":"PDRCNThDMDEzLjMwMzA1MDhAZWFydGhsaW5rLm5ldD4="},"prevInTopic":49852,"nextInTopic":49861,"prevInTime":49852,"nextInTime":49854,"topicId":49850,"numMessagesInTopic":0,"msgSnippet":"SO he wanted to  raise soldiers not kids right?   Alex Polikowsky http://polykow.blogspot.com/ http://groups.yahoo.com/group/unschoolingmn/ [Non-text","messageBody":"<div id=\"ygrps-yiv-1348356420\">SO he wanted to  raise soldiers not kids right?<br/>\n <br/>\nAlex Polikowsky<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":240358028,"authorName":"Kristi","from":"&quot;Kristi&quot; &lt;foehn_jye@...&gt;","profile":"foehn_jye","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: and now for something completely different.....","postDate":"1264108361","msgId":49852,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhqYWcwOStzbjBlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDRCNThDMDEzLjMwMzA1MDhAZWFydGhsaW5rLm5ldD4="},"prevInTopic":49850,"nextInTopic":49853,"prevInTime":49851,"nextInTime":49853,"topicId":49850,"numMessagesInTopic":0,"msgSnippet":"Ack!  Sound of gagging........","messageBody":"<div id=\"ygrps-yiv-821617751\">Ack!  Sound of gagging........</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"and now for something completely different.....","postDate":"1264107539","msgId":49850,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCNThDMDEzLjMwMzA1MDhAZWFydGhsaW5rLm5ldD4="},"prevInTopic":0,"nextInTopic":49852,"prevInTime":49849,"nextInTime":49851,"topicId":49850,"numMessagesInTopic":0,"msgSnippet":"EFFECTIVE HOME SCHOOLING IS LIKE GOOD MILITARY STRATEGY By Ronald E. Johnson, C.Ph.D. Lt. Colonel Bushue (SAC) taught me a valuable life lesson: identify what ","messageBody":"<div id=\"ygrps-yiv-1195955378\">EFFECTIVE HOME SCHOOLING IS LIKE GOOD MILITARY STRATEGY<br/>\n<br/>\nBy Ronald E. Johnson, C.Ph.D.<br/>\n<br/>\nLt. Colonel Bushue (SAC) taught me a valuable life lesson: identify what <br/>\nyou want to do, assess options, make a plan, outline your steps to get <br/>\nthere, obtain needed resources, and focus on daily priorities that lead <br/>\nto goal achievement.  That is the strategy for most successful military <br/>\noperations.  An effective home school program follows a similar <br/>\nprescription.  Without a clearly defined home school plan, life can <br/>\nquickly &quot;turn south&quot;, especially with teenagers.<br/>\n<br/>\n  Here are some practical strategies my wife and I applied with our <br/>\nseven children.  Had these procedures not been in operation, my family <br/>\nwould have experienced unnecessary stress and disappointment in our home <br/>\nschool efforts.especially during the extended times when I was required <br/>\nto be away from home.<br/>\n<br/>\n1.       First, decide how you want to conduct your home school.  You <br/>\nhave  five basic options:<br/>\n<br/>\na.       Virtual schools  These are via the internet and can be <br/>\nexpensive and frustrating if you have multiple age-grade levels among <br/>\nyour children who need access to the internet and computer.  Some <br/>\nvirtual school providers offer turn-key packages.  Others offer <br/>\nbasically on-line guidance and assistance for standard textbooks.<br/>\n<br/>\nb.      Packaged programs  These are school-in-a-box products: <br/>\neverything you need to complete specified courses, some of which require <br/>\na great deal of academic expertise from Mom.  The range of &quot;Mom <br/>\nfriendliness&quot; varies dramatically!<br/>\n<br/>\nc.       Eclectic   This simply means that the parents pick and chose <br/>\ncurriculum from a wide range of resources, including encyclopedias, <br/>\nliterature books, magazines, CDs, unit studies, field trips, <br/>\nconferences, and hardback textbooks.  The advantage is that students <br/>\nexperience a great deal of emotional and academic stimulation.  The <br/>\ndisadvantage is that students are often victims of lack of parental <br/>\norganization and scheduling.<br/>\n<br/>\nd.      Lock-step  This means that children are taught in grade level <br/>\ntextbooks and/or computer software as in public schools.  Mom prepares <br/>\nlesson plans for each course for each child (usually very late at <br/>\nnight), and &quot;teaches&quot; lessons during the day.  The advantage is <br/>\navailability of a planned scope and sequence.  The disadvantage is that <br/>\nMom has to give constant, step-by-step, hands-on, undivided attention to <br/>\neach child.<br/>\n<br/>\ne.      Guided individualized learning   This approach allows the <br/>\nparents to plan the academic prescription for each child.  Then, place <br/>\nthem in curriculum that is designed to be completed with minimum <br/>\nparental, hands-on oversight.  The advantages are that the mother is <br/>\nfree to supervise multiple grade levels and subjects simultaneously, <br/>\nstudents experience accelerated learning, and Mom is relieved from the <br/>\nrequirement to be an academic expert in subjects that are challenging to <br/>\nher knowledge, skills and confidence.  The disadvantage is that the <br/>\nstudents must exercise a great deal of self-discipline to stay focused <br/>\non print or computer software that requires the students to &quot;figure it out.&quot;<br/>\n<br/>\n<br/>\n<br/>\n2.      The second decision concerns values you want to incorporate in <br/>\nthe instructional materials for each child.  Your options are basically <br/>\nthese:<br/>\n<br/>\na.       Secular textbooks/software, as used in public schools<br/>\n<br/>\nb.      Religious textbooks/software, as used in church schools<br/>\n<br/>\nc.       Virtue-based books/software, as used in both religious and <br/>\nsecular schools.<br/>\n<br/>\n<br/>\n<br/>\n3.      The third area concerns the system you will implement in your <br/>\nhome.  Your options are these:<br/>\n<br/>\na.       Hire a service organization to order your preferred materials <br/>\nand keep all student records for a fee.<br/>\n<br/>\nb.      Work with a home school support group regarding book procurement <br/>\nand records.<br/>\n<br/>\nc.       Set up your own program in which you order materials, keep <br/>\nrecords, provide guidance, and maintain transcripts.<br/>\n<br/>\n<br/>\n<br/>\n4.      The fourth concern is to asses your strengths and skills to <br/>\nimplement an effective home school program that fits your home (rather <br/>\nthan the homes of friends).  You should consider the following questions:<br/>\n<br/>\na.       Do you feel confident and capable of preparing and teaching <br/>\ndaily lessons in all subjects for all the grade levels of your children? <br/>\n  If not, select individualized materials.<br/>\n<br/>\nb.      Do you want to use the internet?  If so, each child will need <br/>\naccess to a computer.<br/>\n<br/>\nc.       Do you want to use programmed curriculum that does not require <br/>\nyou to plan or teach each lesson to each child?  If so, you may use the <br/>\ncomputer and/or individualized books.<br/>\n<br/>\nd.      Do you plan to provide hands-on instruction for each child every <br/>\nmorning and/or afternoon?  If so, be sure you are a person with great <br/>\norganizational skills and can multi-task without stress!<br/>\n<br/>\ne.      Do you want/need guidelines for a daily system that provides <br/>\nacademic oversight of your children?  If so, you must be prepared to pay <br/>\nfor outside services that are either on a one-time or on-going basis.<br/>\n<br/>\nf.        Do you want/need to belong to a local home-school support <br/>\ngroup that provides assistance with book procurement, tutorials, field <br/>\ntrips, graduation ceremonies, report cards and transcripts?   (highly <br/>\nrecommended!)  Check the internet for &quot;home school support groups&quot; in <br/>\nyour geographic area. These are usually listed under city, county or <br/>\nstate classifications.<br/>\n<br/>\ng.      Do you want an eclectic approach in which you provide oversight <br/>\nwhile your children read specific books, participate in field trips, <br/>\nengage in tutorials, take lessons from other teachers (music, art, <br/>\nchemistry lab, archery, etc)?  If so, be prepared to make adjustments <br/>\nfor inefficiency, lack of self-discipline, and boredom.  The eclectic <br/>\napproach is sometimes beneficial for specific periods of a child&#39;s <br/>\ndevelopment, but if it is the primary system, it often results in <br/>\nstudents not being prepared for the rigors of college studies.  Nor does <br/>\nit allow the student to transfer course credits to regular schools in <br/>\nthe event the home school experience is no longer an option.<br/>\n<br/>\n<br/>\n<br/>\n5.      The fifth concern (and perhaps the most important one) is <br/>\nselection of curriculum.  Be sure you select curriculum appropriate for <br/>\neach student in the home.  One size and format usually does not fit all <br/>\nchildren!  One will need almost constant hands-on attention.  Others <br/>\nneed only to be pointed in the right direction and turned lose to <br/>\ncomplete academic prescriptions. Children are usually predominately <br/>\ncholeric, sanguine, phlegmatic, or melancholy, and either right or left <br/>\nbrain-dominant. Thus, they will perform more effectively when allowed to <br/>\nlearn from the curriculum and a system that &quot;caters to&quot; their <br/>\ntemperament and brain dominance.  Right brain students tend to do better <br/>\nin hands-on systems that allow a variety, mobility, and freedom to set <br/>\nsome priorities.  Caution: sanguine and right-brain children tend to get <br/>\nside-tracked easily and often, therefore need/require parental oversight <br/>\nthat ascertains completion of specific daily lessons.  Phlegmatic <br/>\nchildren tend to be laid back and easy going.never getting too concerned <br/>\nabout completing daily school assignments. Left-brain dominant students <br/>\n(often choleric and melancholy) usually do well with structured <br/>\ncurriculum that allows the student freedom to set specific daily pages, <br/>\nprojects, lessons and assignments with minimum parental oversight. <br/>\nThus, one particular type of curriculum may not be adequate for all the <br/>\nchildren in the family.<br/>\n<br/>\n<br/>\n<br/>\n6.      Another concern is that of keeping students focused.  Most <br/>\nchildren need at least four hours per day of focused learning.  Stretch <br/>\nand/or &quot;chore breaks&quot; of ten to fifteen minutes every hour help break up <br/>\nthe day, and avoid the tendency for boredom and fatigue.  Soothing <br/>\ninstrumental music played softly in the room reduces anxiety and impact <br/>\nof distractive noises (vacuum cleaner, highway traffic, crying baby). <br/>\nLoud talking or media noise should be avoided.  Using an academic <br/>\ncontract and daily goal chart helps the student learn to set his/her <br/>\ndaily pace to ascertain that course work is completed by pre-determined <br/>\ntimes and dates.  Parents should be available to monitor student <br/>\nbehavior and progress, and to teach or tutor specific lessons or <br/>\nsubjects as needed or scheduled.  A good reminder is &quot;A child left to <br/>\nhimself will bring his mother shame.&quot;<br/>\n<br/>\n<br/>\n<br/>\nMy boot camp sergeant taught me a valuable sequence that has kept me <br/>\nfocused throughout life.  Here are his requirements which I recommend <br/>\nthat parents establish in their home-school program:<br/>\n<br/>\na.      Get up at a set time each morning,<br/>\n<br/>\nb.      Make your bed immediately after the feet hit the floor,<br/>\n<br/>\nc.       Put away sleeping attire and then dress appropriately for the day,<br/>\n<br/>\nd.      Line up shoes under the bed and hang excess garments on the <br/>\nclothes rack,<br/>\n<br/>\ne.      Report to breakfast at a set time, participate in appropriate <br/>\ndiscussions, eat quietly, put away dirty dishes, and write down orders <br/>\nfor the day,<br/>\n<br/>\nf.        Report for duty promptly, fulfill responsibilities and address <br/>\nneeds that develop.<br/>\n<br/>\nThese concerns are legitimate.  However, they are not to be viewed as <br/>\nbarriers to parents who are timed about attempting to home educate their <br/>\nchildren.  My wife and I home-schooled our seven children at various <br/>\ntimes during their lives.  We have not regretted that decision to be in <br/>\ncontrol of their education.  Every day was not necessarily easy or even <br/>\npleasant.  But the final result was worth the effort.<br/>\n<br/>\n___________________________<br/>\n<br/>\nDr. Johnson served with the Strategic Air Command in Arizona and Alaska. <br/>\n  He graduated from the University of Arizona with a BA, M.Ed, Ed,S., <br/>\nand earned a C.Ph.D. from the International Institute after completing <br/>\npost-graduate studies at the University of Illinois and Southwest Texas <br/>\nState University.  He and his wife, Nancy, live on their ranch in <br/>\nZephyr, Texas.  He is founder and president of Paradigm Accelerated <br/>\nCharter Schools and Curriculum.<br/>\n<br/>\n<br/>\n<br/>\nFor more information about Paradigm home school curriculum and programs, <br/>\nvisit www.pacworks.com or correspond with Dr. Johnson at <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Learn@...\">Learn@...</a>, P.O. Box 3159, Early, Texas 76802 or PH:325-649-0976.</div>","specialLinks":[]}],"prevTopicId":49905,"nextTopicId":49896}}