{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"John O. Andersen","from":"&quot;John O. Andersen&quot; &lt;andersen@...&gt;","replyTo":"LIST","senderId":"-Isk_YsVjC0eQKGeeP3AbK1RmtSn13Y1Bde5WBG1AylJ_7L7C1mlzosWDrofTKVMITpCtOiHRf1I0Q_4_QE67jfHpfYaCWSy6Um4Ci6mAVl_rQ","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Great advice from bestselling author","postDate":"944929812","msgId":5256,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4zMzcuNTI1Ni45NTkyNjk3NDRAZUdyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":5255,"nextInTime":5257,"topicId":5256,"numMessagesInTopic":0,"msgSnippet":"I ve got a great book on child-rearing and education here.  From what I understand, it was a bestseller in it s day. The author:                   Jean","messageBody":"<div id=\"ygrps-yiv-1180487774\">I&#39;ve got a great book on child-rearing and education here.  From what I<br/>\nunderstand, it was a &#39;bestseller&#39; in it&#39;s day.<br/>\n<br/>\nThe author:                   Jean Jacques Rousseau (yep, the same guy who<br/>\ndeveloped the idea of the Social Contract--a key concept in 18th century<br/>\nrevolutionary France.)<br/>\nThe publication date:    1762<br/>\nThe title:                        Emile<br/>\n<br/>\n(I&#39;m using the William Boyd translation from 1956).<br/>\n<br/>\n<br/>\nON THE ART OF LIVING:<br/>\n<br/>\n&quot;It is not enough merely to keep children alive.  They should be fitted to<br/>\ntake care of themselves when they grow up.  They should learn to bear the<br/>\nblows of fortune; to meet either wealth or poverty, to live if need be in<br/>\nthe frosts of Iceland or on the sweltering rock of Malta.  The important<br/>\nthing is not to ward off death, but to make sure they really live.  Life is<br/>\nnot just breathing: it is action, the functioning of organs, senses,<br/>\nfaculties, every part of us that gives the consciousness of existence.  The<br/>\nman who gets the most out of life is not the one who has lived longest, but<br/>\nthe one who has felt life the most deeply.&quot;  pg. 15<br/>\n<br/>\nI would add: Life is not just stay in school, graduate, get a &quot;good&quot; job,<br/>\nlive the American dream, retire, yada, yada, yada.  It&#39;s much much deeper<br/>\nthan that.<br/>\n<br/>\nThis sort of reminds me of the line from the movie &quot;Dead Poets Society&quot;<br/>\nwhich goes something like this:<br/>\n<br/>\n&quot;We don&#39;t read and write poetry because its cute. We read and write poetry<br/>\nbecause we are members of the human race. And the human race is full of<br/>\npassion. Medicine, law, business, engineering: these are noble pursuits<br/>\nnecessary to sustain life but poetry, beauty, romance, love. These are what<br/>\nwe stay alive for.&quot;<br/>\n<br/>\n<br/>\nON THE DUTIES OF FATHERS:<br/>\n<br/>\n&quot;A father has only done a third of his duty when he begets children and<br/>\nmakes provision for them.  To his species he owes men; to society he owes<br/>\nsocial beings; to the state he owes citizens.  Every person who fails to pay<br/>\nthis triple debt is blameworthy, even more so if he only pays it in part.<br/>\nThe man who cannot fulfill a father&#39;s duties has no right to become a<br/>\nfather.  Neither poverty nor business nor concern for public opinion exempts<br/>\nhim from the obligation to look after his children and educate them<br/>\nhimself.&quot;  pg. 19<br/>\n<br/>\n<br/>\nON HAPPINESS:<br/>\n<br/>\n&quot;We can never know absolute good or evil.  Everything in this life is mixed.<br/>\nWe never experience pure sentiment, or remain in the same state for two<br/>\nsuccessive moments.  Weal and woe are common to us all, but in differing<br/>\nmeasure.  The happiest man is the one who suffers least: the most miserable<br/>\nthe one who has least pleasure.  Always the sufferings outweigh the<br/>\nenjoyments.  The felicity of man here below is therefore a negative state,<br/>\nto be measured by the fewness of his ills.  Every feeling of pain is<br/>\ninseparable from the desire to escape from it: every idea of pleasure<br/>\ninseparable from the desire for its enjoyment.  Privation is implicit in<br/>\ndesire, and all privations are painful.  Consequently unhappiness consists<br/>\nin the excess of desire over power.  A conscious being whose powers equalled<br/>\nhis desires would be absolutely happy.&quot;  pg. 34<br/>\n<br/>\n<br/>\nON LEARNING TO READ:<br/>\n<br/>\n&quot;Great stress is laid on finding better methods of teaching children to<br/>\nread.  Reading cases and cards have been invented, and the child&#39;s room has<br/>\nbeen turned into a printer&#39;s shop.  Locke suggested the use of dice.  Fancy<br/>\nall this elaborate contrivance!  A surer way that nobody thinks of is to<br/>\ncreate the desire to read.  Give the child this desire and have done with<br/>\nthe gadgets and any method will be good.&quot;  pg. 51-52.<br/>\n<br/>\nJohn<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://members.xoom.com/joandersen\">http://members.xoom.com/joandersen</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nJohn<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://members.xoom.com/joandersen\">http://members.xoom.com/joandersen</a><br/>\n<br/>\nUsually it&#39;s easier to be a success than to be a human.</div>","specialLinks":[]}],"prevTopicId":5255,"nextTopicId":5258}}