{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Tolkien/Christian commentary","postDate":"1032795750","msgId":9541,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMy4xNGMwNGEwNy4yYWMwOTA2NkBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":9540,"nextInTime":9542,"topicId":9541,"numMessagesInTopic":0,"msgSnippet":"While the Potter works prompted Christians to write works like Harry Potter and the Bible: the Menace Behind the Magick and What s a Christian to do with","messageBody":"<div id=\"ygrps-yiv-910317292\">While the Potter works prompted Christians to write works like &quot;Harry Potter <br/>\nand the Bible: the Menace Behind the Magick&quot; and &quot;What&#39;s a Christian to do <br/>\nwith Harry Potter?&quot;, Christians have written positive books about the Tolkien <br/>\ntrilogy such as &quot;Finding God in &#39;The Lord of the Rings&#39; &quot; by Kurt Bruner and <br/>\nJim Ware.<br/>\n&quot;I think one main difference between the two is that J.R.R. Tolkien develops <br/>\nan entire world, Middle-earth, that you understand does not exist,&quot; Stewart <br/>\nsaid. &quot;Rowling does not make the same thing obvious with Harry Potter. You <br/>\ncan&#39;t look at Harry Potter as fantasy because she confuses the lines between <br/>\nreality and make-believe.&quot;<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.cesnur.org/tolkien/033.htm\">http://www.cesnur.org/tolkien/033.htm</a>  <br/>\n(I can&#39;t believe such a nice-looking site didn&#39;t put breaks between <br/>\nparagraphs.)<br/>\n<br/>\n---------------<br/>\nAnother nice-looking webpage.<br/>\n<br/>\nSomeone can be really slow-thinking and still make a nice webpage, it seems:<br/>\n<br/>\n-=-Is the Lord of the Rings harmless fantasy or perhaps even a wholesome <br/>\nChristian allegory? We think not. I read The Hobbit and the three volumes of <br/>\nThe Lord of the Rings in 1971 when I was in Vietnam with the U.S. Army. I was <br/>\nnot saved at the time, and, in fact, I was very antagonistic to the Christian <br/>\nfaith; and had the books contained even a hint of Bible truth, I can asse <br/>\ndetails of the books, I can recall very vividly that they are filled with <br/>\noccultic imagery. The books were published in inexpensive paperback editions <br/>\nin the late 1960s, and they became very popular with that generation of drug <br/>\nheaded hippies. -=-<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://logosresourcepages.org/rings.htm\">http://logosresourcepages.org/rings.htm</a><br/>\n<br/>\nFrom that same article:<br/>\n he remained a Catholic throughout his life. In his last interview, two years <br/>\nbefore his death, he unhesitatingly testified, &quot;I’m a devout Roman Catholic.&quot; <br/>\nJ.R. Tolkien married his childhood sweetheart, Edith, and they had four <br/>\nchildren. He wrote them letters each year as if from Santa Claus, and a <br/>\nselection of these was published in 1976 as &quot;The Father Christmas Letters.&quot; <br/>\nOne of Tolkien’s sons became a Catholic priest. Tolkien was an advisor for <br/>\nthe translation of the Roman Catholic Jerusalem Bible.<br/>\n. . . .<br/>\n<br/>\nOne of Tolkien’s drinking buddies was the famous C.S. Lewis. They and some <br/>\nother Oxford associates formed a group called the &quot;Inklings&quot; and met <br/>\nregularly at an Oxford pub to drink beer and regale about literary and other <br/>\nmatters. Tolkien, in fact, is credited with influencing Lewis to become a <br/>\nChristian of sorts. Like Tolkien, though, Lewis did not accept the Bible as <br/>\nthe infallible Word of God and he picked and chose what he would believe <br/>\nabout the New Testament apostolic faith. . . .<br/>\n<br/>\n(Proof he wasn&#39;t REALLY a Christian...)<br/>\n<br/>\nThough the aforementioned reviewers would have us believe that Tolkien’s <br/>\nbooks contain simple allegories of good vs. evil, Tolkien portrays wizards <br/>\nand witches and wizardry as both good and evil. There is white magic and <br/>\nblack magic in Tolkien’s fantasies. For example, a wizard named Gandalf is <br/>\nportrayed as a good person who convinces Bilbo Baggins in The Hobbit to take <br/>\na journey to recover stolen treasure. The books depict the calling up of the <br/>\ndead to assist the living, which is plainly condemned in the Scriptures. <br/>\nThough not as overtly and sympathetically occultic as the Harry Potter <br/>\nseries, Tolkien’s fantasies are unscriptural and present a very dangerous <br/>\nmessage.<br/>\n<br/>\n- - - -<br/>\n<br/>\nn his last interview in 1971, Tolkien plainly stated that he did not intend <br/>\nThe Lord of the Rings as a Christian allegory and that Christ is not depicted <br/>\nin his fantasy novels. When asked about the efforts of the trilogy’s hero, <br/>\nFrodo, to struggle on and destroy the ring, Tolkien said, &quot;But that seems I <br/>\nsuppose more like an allegory of the human race. I’ve always been impressed <br/>\nthat we’re here surviving because of the indomitable courage of quite small <br/>\npeople against impossible odds: jungles, volcanoes, wild beasts... they <br/>\nstruggle on, almost blindly in a way&quot; (Interview by Dennis Gerrolt; it was <br/>\nfirst broadcast in January 1971 on BBC Radio 4 program &quot;Now Read On…&quot;). That <br/>\ndoesn’t sound like the gospel to me. When Gerrolt asked Tolkien, &quot;Is the book <br/>\nto be considered as an allegory?&quot; the author replied, &quot;No. I dislike allegory <br/>\nwhenever I smell it.&quot;<br/>\nThus, the author of The Lord of the Rings denied the very thing that some <br/>\nChristians today are claiming, that these fantasies are an allegory of <br/>\nChrist’s victory over the devil. <br/>\n---------------</div>","specialLinks":[]}],"prevTopicId":9539,"nextTopicId":9543}}