{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":23,"messages":[{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Marriage-problem, request for ideas","postDate":"1307199076","msgId":61410,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlzZGdwNCtpNGViQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJBTkxrVGk9a3l1aG5KOVNreWE4Qm93ZVNrK3VIUGZSSlhnQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":61408,"nextInTopic":0,"prevInTime":61409,"nextInTime":61411,"topicId":61336,"numMessagesInTopic":0,"msgSnippet":"... ***************** That kind of thinking is a good way to get sucked further into a dysfunctional dynamic, though. The impaired partner may not be ready to","messageBody":"<div id=\"ygrps-yiv-439802292\">dola dasgupta-banerji &lt;doladg@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Then trying and working it out as two human beings &#39;could be&#39; the next step.<br/>\n </span></blockquote>*****************<br/>\n<br/>\nThat kind of thinking is a good way to get sucked further into a dysfunctional dynamic, though. The impaired partner may not be ready to work Anything out, may very well give lip service to the idea of working things out while actively undermining that very process - that&#39;s a biiiiiiig part of how dysfunctional relationships are perpetuated. The impaired person appologises, promises to work things out, makes some steps forward, and then everything falls apart again. It&#39;s Not a process of two people working together in that sense, any more than a parent soothing a young child having a meltdown is two people working together. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I am sure the addiction<br/>\n&gt; issue is not the same as physical abuse...<br/>\n<br/>\n </span></blockquote>Addiction, abuse and untreated mental illness all create similar dynamics in families, though. They&#39;re all issues that are covered up factually (hide the evidence, don&#39;t talk about it, make excuses) and emotionally (don&#39;t think about it, don&#39;t feel). The cycle of hurt-appologize-hurt and the sense of helplessness from other members of the family exist in any of those kinds of situations. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":458624268,"authorName":"dola dasgupta-banerji","from":"dola dasgupta-banerji &lt;doladg@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Marriage-problem, request for ideas","postDate":"1307181182","msgId":61408,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBTkxrVGk9a3l1aG5KOVNreWE4Qm93ZVNrK3VIUGZSSlhnQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGlzYXU5bStlNzJqQGVHcm91cHMuY29tPg==","referencesHeader":"PDJDM0FDN0YxLUJDOTktNEYwMC1BNzM5LUJDREI2MTI1OTA2NUBTYW5kcmFEb2RkLmNvbT4JPGlzYXU5bStlNzJqQGVHcm91cHMuY29tPg=="},"prevInTopic":61407,"nextInTopic":61410,"prevInTime":61407,"nextInTime":61409,"topicId":61336,"numMessagesInTopic":0,"msgSnippet":"I have just kept quiet through all the discussion mostly because I have been myself dealing with physical abuse in my family...I am sure the addiction issue is","messageBody":"<div id=\"ygrps-yiv-104385419\">I have just kept quiet through all the discussion mostly because I have been<br/>\nmyself dealing with physical abuse in my family...I am sure the addiction<br/>\nissue is not the same as physical abuse...But both can happen together as<br/>\nwell...<br/>\n<br/>\nAnyways besides what I had suggested in an earlier post to this thread, if I<br/>\nmay suggest that accepting that there is a problem is a very proactive place<br/>\nto be in.<br/>\n<br/>\nThen trying and working it out as two human beings &#39;could be&#39; the next step.<br/>\nThings sometimes might not work out when we take the roles of &#39;husband&#39; and<br/>\n&#39;wife&#39; too seriously.. There are too many complicated emotions which then<br/>\nstart to creep into it...TRY AND BE TWO HUMAN BEINGS HELPING EACH OTHER...<br/>\n<br/>\nAnd this is only my opinion....please do not take it as some mantra...<br/>\n<br/>\nNot tolerating &#39;violence&#39; could be another....<br/>\n<br/>\nBy this I don&#39;t mean divorce...<br/>\n<br/>\nI would like to add here..think of it as &#39;what if it was your son or<br/>\ndaughter having the addiction problem and not your husband...&quot; How would you<br/>\nhave dealt with it then....It is surprising that no one in their sanest mind<br/>\nwill ask you to leave you son or daughter but they will do so with husband<br/>\nor wife...<br/>\n<br/>\nEquanimity might be a good practice..You might want to try and see...<br/>\n<br/>\nSome of the things I learnt over the last two years...Special thanks to<br/>\nSandra...<br/>\n<br/>\nDola<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nOn Fri, Jun 3, 2011 at 8:53 PM, plaidpanties666<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:plaidpanties666@...\">plaidpanties666@...</a>&gt;wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; Something that occurs to me, reading through this thread, is that whatever<br/>\n&gt; else you decide you can work on helping your daughter have the skills and<br/>\n&gt; insight to heal from her childhood. Unschooling can&#39;t fix everything.<br/>\n&gt;<br/>\n&gt; Going to Al-anon and ACOA type meetings (friends and family of addicts&#39;<br/>\n&gt; meetings) is part of that - those are great places to learn about the<br/>\n&gt; dynamics of dysfunctional families so that you can talk about that with your<br/>\n&gt; daughter. I&#39;m a generation removed from addiction, but it helped *me* to<br/>\n&gt; hear what my mother was learning in ACOA meetings. Knowing those dynamics<br/>\n&gt; makes it easier to step back from some kinds of knee-jerk reactions.<br/>\n&gt;<br/>\n&gt; Another way you can help your daughter is to make sure she has as rich and<br/>\n&gt; varied a social life as she could want - school could be a part of that but<br/>\n&gt; it doesn&#39;t have to be. One of the tricks of a dysfunctional family is that<br/>\n&gt; kids don&#39;t have the perspective to know their lives are messed up. Meeting<br/>\n&gt; other kids and socializing with other families who aren&#39;t dysfunctional can<br/>\n&gt; become a kind of life-line to kids in dysfunctional families. That&#39;s why<br/>\n&gt; school is a refuge for some kids - its provides the perspectives some kids<br/>\n&gt; need to start healing.<br/>\n&gt;<br/>\n&gt; At some point it could become important for your daughter to have a<br/>\n&gt; special, adult mentor Who Is Not You. That could be a counsellor of some<br/>\n&gt; kind, or just a friend, but its worth thinking about and starting to look<br/>\n&gt; around. It might be something that would go easier if your daughter was in<br/>\n&gt; school - or not, but that&#39;s another consideration. Schools come with<br/>\n&gt; &quot;services&quot; which may not be available if money is tight.<br/>\n&gt;<br/>\n&gt; ---Meredith<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":138778570,"authorName":"catfish_friend","from":"catfish_friend &lt;catfish_friend@...&gt;","profile":"catfish_friend","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Marriage-problem, request for ideas","postDate":"1307139298","msgId":61407,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEExQ0U3OUQzLTQyOTgtNDM0OC05RjA1LUMxQjFCRDQ4ODVFRkB5YWhvby5jb20+","inReplyToHeader":"PDJDM0FDN0YxLUJDOTktNEYwMC1BNzM5LUJDREI2MTI1OTA2NUBTYW5kcmFEb2RkLmNvbT4=","referencesHeader":"PDJDM0FDN0YxLUJDOTktNEYwMC1BNzM5LUJDREI2MTI1OTA2NUBTYW5kcmFEb2RkLmNvbT4="},"prevInTopic":61406,"nextInTopic":61408,"prevInTime":61406,"nextInTime":61408,"topicId":61336,"numMessagesInTopic":0,"msgSnippet":"... I want to respond to the OP s questions. Question #1:  Is trust as important in a marriage as I m making it out to be? Making it out reeks of","messageBody":"<div id=\"ygrps-yiv-527472237\">----------<br/>\n<blockquote><span title=\"ireply\"> &gt; Is trust as important in a marriage as I&#39;m making it out to be? Can addicts change without hitting bottom? Will he not hit bottom if I don&#39;t throw him out? Do I support him through this. if so, how? What would you/have you done in this kind of situation? I know I&#39;m asking for a lot, please, if anyone has anything to say about any of this, I&#39;m listening. I trust and respect you all immensely.<br/>\n </span></blockquote>----------<br/>\n<br/>\nI want to respond to the OP&#39;s questions.<br/>\n<br/>\nQuestion #1:  &quot;Is trust as important in a marriage as I&#39;m making it out to be?&quot;<br/>\n<br/>\n&quot;Making it out&quot; reeks of self-doubt to me.  How important is trust to the OP?  How does the OP define marriage?  There is a second guessing of oneself in this question and I think it is worth examining and clarifying to herself as she is the only one who could know.<br/>\n<br/>\nAnother way to explore this question might be to think of the Unschooling relationship to her child.  Marriage and motherhood are not the same, but just as sometimes it helps to consider what&#39;s helpful in a spousal relationship in how to approach the parental relationship, in this instance, it may be helpful to flip that around.<br/>\n<br/>\nQuestions 2-4:  &quot;Can addicts change without hitting bottom? Will he not hit bottom if I don&#39;t throw him out? Do I support him through this. if so, how?&quot;<br/>\n<br/>\n5 questions were asked in the OP, these 3, to me, seemed to focus on the addict, the addict&#39;s needs and possible consequences.  Where are the questions that focus on the OP, the OP&#39;s needs and possible consequences?  While it may seem the OP is asking these questions for herself, the &quot;if I don&#39;t throw him out&quot; question seems focused on what the end result *for the addict* might be of the OP&#39;s choice of action rather than about the OP making a thoughtful choice of action.  In that sense, I think the OP sees herself as having some kind of control over the addict&#39;s outcome.<br/>\n<br/>\nThe following question about supporting the addict, while it seems to come from a place of compassion, in the context of the OP having such great influence and/or control over the addict&#39;s outcome based on whether or not the OP throws out the addict -- I almost read the question more as &quot;how do I support my addict husband to get the outcome I want?&quot;<br/>\n<br/>\nI read into the OP&#39;s questions this way because when I went through my situation with alcohol abuse in our family, my answer to OP&#39;s question #5: &quot;What would you/have you done in this kind of situation?&quot;<br/>\n<br/>\nI did the same as the OP -- focused on the addict&#39;s behavior, the addict&#39;s needs, the addict&#39;s outcome.  The dramatic shift for me came as I focused on my behavior, my needs and my desired outcome.  I slowed down and focused on what I was doing in the moment -- paused long enough to recognize what needs I had in the moment, if any, and feeding myself literally and figuratively first, so that I could make a thoughtful response towards the outcome I desired -- serenity for now and for later.<br/>\n<br/>\nThere was a period I let go of what the end outcome might be -- marriage, divorce, separation.  I made the choice that I wanted and needed serenity and for me, that meant working on the broken communication I had with my spouse, inviting him to do the same (which he chose to do) while preparing practically for any marital outcome and setting boundaries for relating to the kids only while sober.<br/>\n<br/>\nBy taking care of myself, knowing what it took to care of myself, I was better able to respond to the stresses of alcoholism in the family dynamic.  I was making better choices more and more frequently regarding the kids, friends, spouse and myself.  Practical preparations for marriage or separation or divorce gave me security so I could make thoughtful choices more often than ones out of fear for difficult finances or uncertainty about future stepparents.<br/>\n<br/>\nAt some point, after some effort and positive feedback that things were improving, I stopped preparing for separation and focused more on building the marriage back up again.<br/>\n<br/>\nI see now, my participation in the breakdown of the marriage and the family at that time.  It was humbling, as I originally only saw it as the fault of my husband and/or his drinking.<br/>\n<br/>\nOne of the gifts of Unschooling for me is the paradigm shift to everyone in the family being on the same team and everyone &quot;winning&quot;.  If I had known about Unschooling before coming into contact with alcoholism, I wonder if I would have struggled as much with my family as I did.<br/>\n<br/>\nWhile our family struggled through it together and emerged stronger for it, I was prepared for the outcome where that would not happen, but that I could still have serenity knowing that I was making thoughtful, better choices more and more, protecting the children as best I could and recognizing that each human being has the right to make his/her own choices and live out the consequences of his/her choices alone.<br/>\n<br/>\nIronically, my family&#39;s struggle prepared me for Unschooling and Unschooling reminds me of the principles and lessons I learned struggling with dysfunction.<br/>\n<br/>\nMy hope for the OP is that this will be embraced as an opportunity for growth -- for all of you.<br/>\n<br/>\nBest,<br/>\nCeci</div>","specialLinks":[]},{"userId":443673909,"authorName":"shannahans5","from":"&quot;shannahans5&quot; &lt;meshannahan@...&gt;","profile":"shannahans5","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Marriage-problem, request for ideas","postDate":"1307116385","msgId":61406,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlzYjAxMSsxdmlpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDc5NEEzOTAxLTY1MTktNEIzNS04MTk4LUQ3Qzc5QTM3NkUzRkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":61405,"nextInTopic":61407,"prevInTime":61405,"nextInTime":61407,"topicId":61336,"numMessagesInTopic":0,"msgSnippet":"... Yes! Absolutely!  The original post gave me the impression that the wife was struggling with how much to expect.  Some people may advise her to stay","messageBody":"<div id=\"ygrps-yiv-939324811\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; -=-It is difficult to seperate behavior from the person especially when you are counting on their contribution to the relationship to be reciprocal and equal. You count on him to co-parent and to provide for your family emotionally and financially. Addicts are emotionally unavailable and often otherwise unable to &quot;be there&quot; for others.-=-<br/>\n&gt; <br/>\n&gt; When behavior involves choices, it&#39;s impossible to separate behavior from the person.   But substances can overwhelm a person.  Alcohol (the addiction with which I&#39;m most familiar, because of my mom) will take over like an conquering alien and defend its own self, it seems.   <br/>\n&gt; <br/>\n&gt; But all that said, and even without addiction being involved, expecting contributions to any relationship or project to be &quot;reciprocal and equal&quot; will lead to frustration and failure.    Each person should give what he or she can, and aim at more than what they gauge to be &quot;half.&quot;    Anyone who&#39;s only willing to give &quot;equal&quot; (50%) will end up giving less and less, to &quot;match&quot; what they perceive the other person is giving, who will be giving less as the other partner begins to withhold service/attention/love/responses&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>Yes! Absolutely!  The original post gave me the impression that the wife was struggling with how much to expect.  Some people may advise her to stay married and expect nothing from the husband.  Others may advise her to issue an ultimatum and expect him to contribute equally or divorce.  In my experience, there were days when I gave 100% and there were other days that I was angry and distraught and felt like I was drowning.  I was a young wife and mother at the time and had a lot of pre-conceived ideas about marriage and family.  Ultimately, I treated my husband like a good friend who could use another good friend who wanted to help him and wanted him to have a good life.  This happened to work for us.  It doesn&#39;t work for every addict in every situation.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Divorce is easy, because people all around will say &#39;just get divorced.&#39;  <br/>\n&gt; Divorce is hard, because those people who said &#39;just get divorced&#39; are rarely around to be supportive afterwards.  And in the case of those being couple, sometimes the newly divorced woman finds herself somewhat excluded because the other wives realize she&#39;s &#39;available&#39; and sometimes don&#39;t trust the situation anymore.<br/>\n<br/>\n </span></blockquote>Your post indicated that this woman was turning to the list for alternatives because her family and friends would tell her to get divorced.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; -=-I also want to encourage you. You have many options and none of them have anything to do with what anyone else &quot;thinks&quot; you should do; nor should you spend much time thinking about what other people &quot;think&quot; of you and your choices.-=-<br/>\n&gt; <br/>\n&gt; Some people care more about what others think than others.  Everyone&#39;s decisions have *some*thing to do with what *some* others think.  Their children, their partners.  Those they might need to call on for assistance later.    Someone could potentially declare she doesn&#39;t care what anyone else thinks and find that she&#39;s alienated everyone else to the point that they really don&#39;t care what she does anymore.  That&#39;s not a more peaceful place, nor an easier way to make decisions.&gt;&gt;<br/>\n<br/>\n </span></blockquote>Yeah, I agree with what you&#39;re saying here.  She stated that she didn&#39;t want to go to family and friends because they would tell her to get divorced.  I got the impression she felt judged by her family and friends and that it was bothering her, a lot.  I jumped to the conclusion that she was obsessing about these judgments.  <br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; -=-Sometimes the pain of childhood is released a little at a time. As we grow we&#39;re not analyzing too much. When we become parents we begin to make decisions about how we want to raise our kids. This is usually when the crappy stuff from our childhood rises to the surface. Our childhood becomes a contrast and comparison which usually has to be addressed. <br/>\n&gt; -=-<br/>\n&gt; <br/>\n&gt; As children reach different ages, parents have different memories and emotions stirred up.  Even if unschooling is going really well, a child might reach an age where one of the parents had trauma, and that parent might have mysterious reactions.<br/>\n&gt; <br/>\n&gt; -=-As we grow we&#39;re not analyzing too much.-=-<br/>\n&gt; <br/>\n&gt; I was.  Holly has always been analytical.  If Howard Gardner is right (and it seems to me he is), there is an &quot;intrapersonal intelligence&quot; that some people have more of than others, and those who have that self-knowing as one of their talents or ways of thinking and seeing the world have probably been analyzing their own place in the world and their relationships with others since they were children.&gt;&gt;<br/>\n<br/>\n </span></blockquote>Again, I made a blanket statement. My husband, in particular, did not analyze his childhood and the effect that it had on the decisions he made as an adult, husband, and parent.  In my analysis, as it pertains to my experience with addiction, his new nuclear family gave him a contrast to his childhood that magnified his baggage and therefore did not keep him from using drugs.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; -=-&quot;Even though I&#39;ve never been too bothered by the thought that he may have slept with someone else a few times, as long as he didn&#39;t have a relationship with one, it doesn&#39;t really bother me. But the thought of him remarrying or getting involved with someone who would be in a parental role in our child&#39;s life, is terrifying, especially if he continues to make choices from his junkie perspective. I&#39;ve always felt that if I really and truly left him, he would self-destruct and our daughter would loose her father.&quot;<br/>\n&gt; <br/>\n&gt; -=-You&#39;re thinking things through and wondering what the outcome will be if you choose to do one thing or the other. You have options and you want to make the best choice for you, your marriage and your family. You are also asking what-ifs. Again, you have enough realities to work through. Start with what you know to be true instead of feeling guilty about something that may never happen.-=-<br/>\n&gt; <br/>\n&gt; I didn&#39;t see it as &quot;guilty,&quot; but as the consideration of potential future step-parents (official or un-).  That seems to be the thing people didn&#39;t consider when they agreed to divorce, and agreed to co-parent, and agreed to continue to unschool, or on a school, or whatever.  Other people come along and get involved and can be very persuasive and disruptive.  Other people come along who can end up with the legal right to be alone with your children, and you didn&#39;t get to choose or approve them.<br/>\n&gt;&gt;<br/>\n </span></blockquote>I reacted to the last line: &quot;I&#39;ve always felt that if I really and truly left him, he would self-destruct and our daughter would loose her father.&quot;<br/>\n<br/>\nThis sounded to me like she was willing to take the blame for her husbands possible self-destruction.  It was as if she was saying it would be her fault.  As for other future possiblities---I agree that they are important considerations.<br/>\n<br/>\nMarilyn</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Marriage-problem, request for ideas","postDate":"1307114613","msgId":61405,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlzYXU5bStlNzJqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDJDM0FDN0YxLUJDOTktNEYwMC1BNzM5LUJDREI2MTI1OTA2NUBTYW5kcmFEb2RkLmNvbT4="},"prevInTopic":61404,"nextInTopic":61406,"prevInTime":61404,"nextInTime":61406,"topicId":61336,"numMessagesInTopic":0,"msgSnippet":"Something that occurs to me, reading through this thread, is that whatever else you decide you can work on helping your daughter have the skills and insight to","messageBody":"<div id=\"ygrps-yiv-1356804125\">Something that occurs to me, reading through this thread, is that whatever else you decide you can work on helping your daughter have the skills and insight to heal from her childhood. Unschooling can&#39;t fix everything.<br/>\n<br/>\nGoing to Al-anon and ACOA type meetings (friends and family of addicts&#39; meetings) is part of that - those are great places to learn about the dynamics of dysfunctional families so that you can talk about that with your daughter. I&#39;m a generation removed from addiction, but it helped *me* to hear what my mother was learning in ACOA meetings. Knowing those dynamics makes it easier to step back from some kinds of knee-jerk reactions. <br/>\n<br/>\nAnother way you can help your daughter is to make sure she has as rich and varied a social life as she could want - school could be a part of that but it doesn&#39;t have to be. One of the tricks of a dysfunctional family is that kids don&#39;t have the perspective to know their lives are messed up. Meeting other kids and socializing with other families who aren&#39;t dysfunctional can become a kind of life-line to kids in dysfunctional families. That&#39;s why school is a refuge for some kids - its provides the perspectives some kids need to start healing. <br/>\n<br/>\nAt some point it could become important for your daughter to have a special, adult mentor Who Is Not You. That could be a counsellor of some kind, or just a friend, but its worth thinking about and starting to look around. It might be something that would go easier if your daughter was in school - or not, but that&#39;s another consideration. Schools come with &quot;services&quot; which may not be available if money is tight.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Marriage-problem, request for ideas","postDate":"1307088657","msgId":61404,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc5NEEzOTAxLTY1MTktNEIzNS04MTk4LUQ3Qzc5QTM3NkUzRkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGlzOWc2ais5anJhQGVHcm91cHMuY29tPg==","referencesHeader":"PGlzOWc2ais5anJhQGVHcm91cHMuY29tPg=="},"prevInTopic":61403,"nextInTopic":61405,"prevInTime":61403,"nextInTime":61405,"topicId":61336,"numMessagesInTopic":0,"msgSnippet":"-=-It is difficult to seperate behavior from the person especially when you are counting on their contribution to the relationship to be reciprocal and equal.","messageBody":"<div id=\"ygrps-yiv-136370053\">-=-It is difficult to seperate behavior from the person especially when you are counting on their contribution to the relationship to be reciprocal and equal. You count on him to co-parent and to provide for your family emotionally and financially. Addicts are emotionally unavailable and often otherwise unable to &quot;be there&quot; for others.-=-<br/>\n<br/>\nWhen behavior involves choices, it&#39;s impossible to separate behavior from the person.   But substances can overwhelm a person.  Alcohol (the addiction with which I&#39;m most familiar, because of my mom) will take over like an conquering alien and defend its own self, it seems.   <br/>\n<br/>\nBut all that said, and even without addiction being involved, expecting contributions to any relationship or project to be &quot;reciprocal and equal&quot; will lead to frustration and failure.    Each person should give what he or she can, and aim at more than what they gauge to be &quot;half.&quot;    Anyone who&#39;s only willing to give &quot;equal&quot; (50%) will end up giving less and less, to &quot;match&quot; what they perceive the other person is giving, who will be giving less as the other partner begins to withhold service/attention/love/responses.<br/>\n<br/>\nDivorce is easy, because people all around will say &#39;just get divorced.&#39;  <br/>\nDivorce is hard, because those people who said &#39;just get divorced&#39; are rarely around to be supportive afterwards.  And in the case of those being couple, sometimes the newly divorced woman finds herself somewhat excluded because the other wives realize she&#39;s &#39;available&#39; and sometimes don&#39;t trust the situation anymore.<br/>\n<br/>\n-=-I also want to encourage you. You have many options and none of them have anything to do with what anyone else &quot;thinks&quot; you should do; nor should you spend much time thinking about what other people &quot;think&quot; of you and your choices.-=-<br/>\n<br/>\nSome people care more about what others think than others.  Everyone&#39;s decisions have *some*thing to do with what *some* others think.  Their children, their partners.  Those they might need to call on for assistance later.    Someone could potentially declare she doesn&#39;t care what anyone else thinks and find that she&#39;s alienated everyone else to the point that they really don&#39;t care what she does anymore.  That&#39;s not a more peaceful place, nor an easier way to make decisions.<br/>\n<br/>\n-=-Sometimes the pain of childhood is released a little at a time. As we grow we&#39;re not analyzing too much. When we become parents we begin to make decisions about how we want to raise our kids. This is usually when the crappy stuff from our childhood rises to the surface. Our childhood becomes a contrast and comparison which usually has to be addressed. <br/>\n-=-<br/>\n<br/>\nAs children reach different ages, parents have different memories and emotions stirred up.  Even if unschooling is going really well, a child might reach an age where one of the parents had trauma, and that parent might have mysterious reactions.<br/>\n<br/>\n-=-As we grow we&#39;re not analyzing too much.-=-<br/>\n<br/>\nI was.  Holly has always been analytical.  If Howard Gardner is right (and it seems to me he is), there is an &quot;intrapersonal intelligence&quot; that some people have more of than others, and those who have that self-knowing as one of their talents or ways of thinking and seeing the world have probably been analyzing their own place in the world and their relationships with others since they were children.<br/>\n<br/>\n-=-&quot;Even though I&#39;ve never been too bothered by the thought that he may have slept with someone else a few times, as long as he didn&#39;t have a relationship with one, it doesn&#39;t really bother me. But the thought of him remarrying or getting involved with someone who would be in a parental role in our child&#39;s life, is terrifying, especially if he continues to make choices from his junkie perspective. I&#39;ve always felt that if I really and truly left him, he would self-destruct and our daughter would loose her father.&quot;<br/>\n<br/>\n-=-You&#39;re thinking things through and wondering what the outcome will be if you choose to do one thing or the other. You have options and you want to make the best choice for you, your marriage and your family. You are also asking what-ifs. Again, you have enough realities to work through. Start with what you know to be true instead of feeling guilty about something that may never happen.-=-<br/>\n<br/>\nI didn&#39;t see it as &quot;guilty,&quot; but as the consideration of potential future step-parents (official or un-).  That seems to be the thing people didn&#39;t consider when they agreed to divorce, and agreed to co-parent, and agreed to continue to unschool, or on a school, or whatever.  Other people come along and get involved and can be very persuasive and disruptive.  Other people come along who can end up with the legal right to be alone with your children, and you didn&#39;t get to choose or approve them.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":443673909,"authorName":"shannahans5","from":"&quot;shannahans5&quot; &lt;meshannahan@...&gt;","profile":"shannahans5","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Marriage-problem, request for ideas","postDate":"1307067411","msgId":61403,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlzOWc2ais5anJhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDJDM0FDN0YxLUJDOTktNEYwMC1BNzM5LUJDREI2MTI1OTA2NUBTYW5kcmFEb2RkLmNvbT4="},"prevInTopic":61386,"nextInTopic":61404,"prevInTime":61402,"nextInTime":61404,"topicId":61336,"numMessagesInTopic":0,"msgSnippet":"First, let me assure you that I speak from experience and can empathize. I know the nature of this list isn t to save marriages from the brink of divorce.","messageBody":"<div id=\"ygrps-yiv-1788516567\">First, let me assure you that I speak from experience and can empathize.<br/>\n<br/>\n &quot;I know the nature of this list &quot;isn&#39;t to save marriages from the brink of divorce.&quot; But I have no one else to turn to. I know from past experience that my family and friends are so steeped in divorce culture that if I were to share any of this with them, they would expect me to leave my husband and not look back.&quot; <br/>\n<br/>\nI also want to encourage you.  You have many options and none of them have anything to do with what anyone else &quot;thinks&quot; you should do; nor should you spend much time thinking about what other people &quot;think&quot; of you and your choices.<br/>\n<br/>\n&quot; Last night I found out my husband of 10 years has been using cocaine once-twice a week.  I actually thought he was having an affair, because sometimes he&#39;ll leave for work (he works evenings) all sweet and connected but then not answer my calls or texts and not come home until the morning.  He texted me this morning that he is &quot;a junkie&quot; and that he&#39;s been doing lines all night at work and after for the past year. I can understand his desire to numb it, but I had hoped that our loving family was doing that.&quot;<br/>\n<br/>\nSometimes the pain of childhood is released a little at a time. As we grow we&#39;re not analyzing too much.  When we become parents we begin to make decisions about how we want to raise our kids.  This is usually when the crappy stuff from our childhood rises to the surface. Our childhood becomes a contrast and comparison which usually has to be addressed.  <br/>\n<br/>\n&quot;I am mostly upset about the deception and the fact that he has deceived me before.&quot;<br/>\n<br/>\nYes, this is truly painful.  I hate to be lied to, but what I&#39;ve come to accept is that people lie to protect themselves.  In my situation, my husband didn&#39;t want to tell me that he was an addict.  He didn&#39;t want to admit that he was making decisions that were going to harm our family. He loved us.  He wanted to fix himself before I found out.  He lied to himself.  That&#39;s the problem with being an addict--the addict is not stronger than his/her addiction.<br/>\n<br/>\n  &quot;I left him for a year and a half a few years ago because he was drinking a lot, lying about all kinds of things, and very, very mean. We didn&#39;t divorce; we lived 2 miles away from each other, and did a really good job of not having our separation physically impact our child&#39;s life.  Although I honestly kept waiting for it to get easier on her, for it to become &#39;normal&#39; (she was 4 at the start), it never did.  She asked daily for us to all be together again. It was torturous for her, and she wasn&#39;t nearly as attached to him then as she is now at almost 8.&quot;<br/>\n<br/>\nWatching kids suffer while parents figure things out is excruciating.  Some of their sadness was helped by my compassion, softness and by my focusing on their needs.  I turned to friends and counselors for support.  Therefore, I reiterated to my children that they could come to me with their sorrows and anger.  I did not cry on their shoulder.  I always let them cry on mine.  This was also one of my requests of my husband.  Addicts are focused on themselves and their problems.  He had a lot of self-pity and guilt.  I didn&#39;t want him to make our kids his counselors.  He could pick them up from friends houses (sober), he could play games with them, eat dinner with them, and answer their questions but I requested that he not make them feel sorry for him.  His choices were not a direct result of anything they did.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; &quot;Partially, unschooling is what helped us get back together.  I realized that I had never forgiven him for an earlier betrayal and that if I just loved him up, trusted him, and assumed good intentions, he&#39;d rise to the occasion.&quot;<br/>\n&gt; <br/>\n </span></blockquote>I get this.  Unschooling is about mindful living in addition to mindful parenting.  However, you are not the answer to all of his problems.  You can forgive him, love him, trust him and he may still do things that are self-destructive nonetheless.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&quot; In some ways it worked, although with each new transgression (they kept happening), it became harder for me to respect him, to see him as honorable&quot; <br/>\n<br/>\n </span></blockquote>It is difficult to seperate behavior from the person especially when you are counting on their contribution to the relationship to be reciprocal and equal. You count on him to co-parent and to provide for your family emotionally and financially.  Addicts are emotionally unavailable and often otherwise unable to &quot;be there&quot; for others.<br/>\n<br/>\n&quot;(I cannot get my mind around why that is so important to me, but it is).&quot; <br/>\n<br/>\nThis is a very important relationship.  Relationships aren&#39;t maintained by one person.  <br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&quot; I do not know what to do.  Except for this relationship, I&#39;ve never been in the &quot;victim&quot; role.  I&#39;ve always picked up and gotten out, immediately, when things got tough. I&#39;ve never been a mom before, either, though.&quot;<br/>\n<br/>\n </span></blockquote>Your child will be linked to this man forever.  You are aware of this reality.  Even if you decide to get a divorce, this does not mean that your child does not have a father---absentee or not. This is a difficult situation.  It&#39;s heartbreaking.  However, you are not alone and you probably should get advice from professionals.  Besides talking through some of your emotions with a counselor, it may also be helpful to get practical help about child care, employment and finances. If your husband is admitting to his addiction, he may want to get counseling or go to rehab.  My husband and I went to counseling together and seperate.  He also went to AA and NA meetings by himself.<br/>\n<br/>\n &quot;My parents had one of the most fucked up divorces people could have, complete with international kidnapping and all other kinds of yuck.  I didn&#39;t really fare too badly.  I made some (poor) choices as a result, but I&#39;m fairly sane.  My brother didn&#39;t fare as well, and the divorce happened for him when he was the same age as our child is now. That haunts me.&quot;<br/>\n<br/>\nEveryone has a past.  This situation is not identical to your past and your daughter is not your brother.  You are going to handle things differently than your parents and your daughter may handle this differently than your brother.  You cannot predict the outcome.  You can only predict how you are going to help your daughter through this.  Besides, divorce is one of your choices not necessarily THE choice.  Many people have traveled the road you&#39;re on and ended up with stronger and better marriages.  Again, that is not a certainty, but is certainly a possibility.  <br/>\n<br/>\n&quot;I don&#39;t want to get divorced but I don&#39;t know that he can really change, become trustworthy.&quot;<br/>\n<br/>\nNo.  You don&#39;t know when he will change or if he will change.<br/>\n<br/>\n&quot;If he were to get busted with drugs, we&#39;d lose the right to homeschool in our state (I guess we could always move).  But I don&#39;t want that kind (this kind) of life.&quot;<br/>\n<br/>\nThis is an uncertain possibility.  You have plenty on your plate now.  Take one thing at a time.<br/>\n<br/>\n  Financially, we&#39;re barely surviving. He could never support two households on his income. I can find a job and there are extended family who can help with childcare, but that doesn&#39;t make for ideal unschooling, either.&quot;<br/>\n<br/>\nCould you put her in school temporarily?<br/>\nCould you sell things or maybe find ways of saving money that would help you through this time.<br/>\n<br/>\n&quot;Even though I&#39;ve never been too bothered by the thought that he may have slept with someone else a few times, as long as he didn&#39;t have a relationship with one, it doesn&#39;t really bother me. But the thought of him remarrying or getting involved with someone who would be in a parental role in our child&#39;s life, is terrifying, especially if he continues to make choices from his junkie perspective. I&#39;ve always felt that if I really and truly left him, he would self-destruct and our daughter would loose her father.&quot;<br/>\n<br/>\nYou&#39;re thinking things through and wondering what the outcome will be if you choose to do one thing or the other.  You have options and you want to make the best choice for you, your marriage and your family.  You are also asking what-ifs.  Again, you have enough realities to work through.  Start with what you know to be true instead of feeling guilty about something that may never happen.<br/>\n<br/>\n&quot;Is trust as important in a marriage as I&#39;m making it out to be?  <br/>\n<br/>\nIn order to have a relationship, do you need to trust someone?<br/>\n<br/>\n&quot;Can addicts change without hitting bottom?&quot;  Sometimes.  It&#39;s their choice.<br/>\n<br/>\n&quot;Will he not hit bottom if I don&#39;t throw him out?&quot;  Maybe, maybe not.<br/>\n<br/>\nDo I support him through this. if so, how? What would you/have you done in this kind of situation?&quot; <br/>\n<br/>\nWhat kind of support is he asking for? <br/>\n<br/>\nI went to meetings with my husband.  I would not keep secrets for him.  I told his parents and his friends.  I was honest with people and asked for help when I needed it.  I did have requests:  No drugs in the house.  Being around the kids was okay when he was sober.  He went to counseling.  I took it one day at a time.  He took it one day a time.  He made choices that included spending less time with certain friends and more time with family and also more time with me.<br/>\n<br/>\nMany of your questions can only be answered by you.  I think that unschooling has given me and my family a wonderful life but a healthy marriage has been a needed foundation in our unschooled lives.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Marriage-problem, request for ideas","postDate":"1306914646","msgId":61386,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZCOEM1MkY2LUFFNEEtNDYwQS1CQjE5LTYzRTVGNDNERkJFOEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEVCNkQ0NjFDQjYwRjQ1NDhBMkU4MTg3MzQ3RkExOUI3QEplZmZIUD4=","referencesHeader":"PGlzMmpmMytyODNhQGVHcm91cHMuY29tPiA8RUI2RDQ2MUNCNjBGNDU0OEEyRTgxODczNDdGQTE5QjdASmVmZkhQPg=="},"prevInTopic":61385,"nextInTopic":61403,"prevInTime":61385,"nextInTime":61387,"topicId":61336,"numMessagesInTopic":0,"msgSnippet":"-=-He tried some of the 12 step programs and the group meetings but he said they made him feel even more powerless and even more worthless. -=- People can t be","messageBody":"<div id=\"ygrps-yiv-568556934\">-=-He tried some of the 12 step programs and the group meetings but he said they made him feel even more powerless and even more worthless. -=-<br/>\n<br/>\nPeople can&#39;t be more powerless than &quot;powerless.&quot;  That&#39;s at the center of the 12 step programs. :-)<br/>\n<br/>\nWhat creates power and worth is taking single, conscious steps toward being the kind of person one would like to be.  Making better choices.  That&#39;s what all this attachment parenting/unschooling/peaceful parenting/being partners is about.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Marriage-problem, request for ideas","postDate":"1306913993","msgId":61385,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY3ODUzNzE2LUYzN0MtNEFGOS04QTEwLUQxRUQwRDY0NjUzQUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEJBTkxrVGltaVJFM049S0Jpb011T1BYPTR0alAtR29uVjdnQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDJDM0FDN0YxLUJDOTktNEYwMC1BNzM5LUJDREI2MTI1OTA2NUBTYW5kcmFEb2RkLmNvbT4gPEZFQzNENkM0LTQ5OTgtNEI2RC1BRTUwLTY4QkU0QzI0RTk5NUBkcml6emxlLmNvbT4gPDUyQUI3MEZCLTZERjktNDE3MC05RjI3LUQwODgzNTVBNTI5RUBTYW5kcmFkb2RkLmNvbT4gPEJBTkxrVGltaVJFM049S0Jpb011T1BYPTR0alAtR29uVjdnQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":61379,"nextInTopic":61386,"prevInTime":61384,"nextInTime":61386,"topicId":61336,"numMessagesInTopic":0,"msgSnippet":"This is a good idea, I think.   It depends on other details, but as an in-general idea, there is merit. 1. One way that could be tried out is to send the","messageBody":"<div id=\"ygrps-yiv-1875530398\">This is a good idea, I think.   It depends on other details, but as an in-general idea, there is merit.<br/>\n<br/>\n<br/>\n1. One way that could be tried out is to send the children back to school.<br/>\n<br/>\n2. Then have more time and energy at hand to talk and spend time with your<br/>\nspouse and give this a full hearted shot.<br/>\n<br/>\n==========<br/>\n<br/>\nPart of the problem with drug and alcohol dependence/abuse, in the U.S. especially, is that it&#39;s seen as sin.  If a husband had cancer or a head injury or became a paraplegic and the mom took care of him many hours a day, he would be seen as a dad who would being more helpful and independent if he could be, and the mom would be seen as being a good partner fulfilling her marriage vows.<br/>\n<br/>\nI think an intact family is more important to a child,and even to an adult who has the chance to visit his parents together in the same house, than school-or-not-school is.<br/>\n<br/>\nEven better is an intact family and unschooling. :-)<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":458624268,"authorName":"dola dasgupta-banerji","from":"dola dasgupta-banerji &lt;doladg@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Marriage-problem, request for ideas","postDate":"1306901470","msgId":61379,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBTkxrVGltaVJFM049S0Jpb011T1BYPTR0alAtR29uVjdnQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDUyQUI3MEZCLTZERjktNDE3MC05RjI3LUQwODgzNTVBNTI5RUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDJDM0FDN0YxLUJDOTktNEYwMC1BNzM5LUJDREI2MTI1OTA2NUBTYW5kcmFEb2RkLmNvbT4JPEZFQzNENkM0LTQ5OTgtNEI2RC1BRTUwLTY4QkU0QzI0RTk5NUBkcml6emxlLmNvbT4JPDUyQUI3MEZCLTZERjktNDE3MC05RjI3LUQwODgzNTVBNTI5RUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":61377,"nextInTopic":61385,"prevInTime":61378,"nextInTime":61380,"topicId":61336,"numMessagesInTopic":0,"msgSnippet":"If I may say something to the original post.. 1. One way that could be tried out is to send the children back to school. 2. Then have more time and energy at","messageBody":"<div id=\"ygrps-yiv-674252515\">If I may say something to the original post..<br/>\n<br/>\n1. One way that could be tried out is to send the children back to school.<br/>\n<br/>\n2. Then have more time and energy at hand to talk and spend time with your<br/>\nspouse and give this a full hearted shot.<br/>\n<br/>\n3. Keeping in mind what Joyce said , the intention is your husband&#39;s. But if<br/>\nyou are clear that your intention is to save the marriage and &#39;not punish<br/>\nhim for some old betrayal and for being untrustworthy&#39;, then all might work<br/>\nout.<br/>\n<br/>\n4. The children can come back to unschooling later anytime....<br/>\n<br/>\n5. Get into this with a open mind and faith....<br/>\n<br/>\nAll the best.<br/>\n<br/>\nDola<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Tue, May 31, 2011 at 1:59 PM, Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; -=-My personal decision would be different than yours. I wouldn&#39;t even be<br/>\n&gt; writing to a list asking whether or not I should stay. But since you&#39;ve<br/>\n&gt; stated that you don&#39;t want to walk away for many reasons...-=-<br/>\n&gt;<br/>\n&gt; I don&#39;t think she wanted the list to vote and make a decision for her, or<br/>\n&gt; even to recommend a final decision, but to share experiences, ideas, and<br/>\n&gt; possible options to help her think about it herself.<br/>\n&gt;<br/>\n&gt; There are MANY people who will say, always, &quot;leave.&quot; The considerations<br/>\n&gt; when children are involved should be larger, and slower, than if it&#39;s a<br/>\n&gt; childless woman leaving a man. A mother can&#39;t leave the father of her<br/>\n&gt; children without having made an irreparable change in all their lives.<br/>\n&gt;<br/>\n&gt; And on top of that, the kind of thinking one might do without ever having<br/>\n&gt; been involved with unschooling might not apply to someone who has moved<br/>\n&gt; toward making decisions for different kinds of reasons, and in a different<br/>\n&gt; way.<br/>\n&gt;<br/>\n&gt; Sandra<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar","from":"&quot;otherstar&quot; &lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Marriage-problem, request for ideas","postDate":"1306886014","msgId":61377,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVCNkQ0NjFDQjYwRjQ1NDhBMkU4MTg3MzQ3RkExOUI3QEplZmZIUD4=","inReplyToHeader":"PGlzMmpmMytyODNhQGVHcm91cHMuY29tPg==","referencesHeader":"PGlzMmpmMytyODNhQGVHcm91cHMuY29tPg=="},"prevInTopic":61375,"nextInTopic":61379,"prevInTime":61376,"nextInTime":61378,"topicId":61336,"numMessagesInTopic":0,"msgSnippet":"... Remember the message in star wars? Something like fighting the dark side with light. Light will win. Give him the love and warmth and connection he needs.","messageBody":"<div id=\"ygrps-yiv-262017792\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;Do you love him? Can you love him? He needs love. I know many addicts in recovery who have had many years, (some decades) clean from drugs and alcohol. A great deal of them have raised kids in happy marriages. <br/>\n </span></blockquote>Remember the message in star wars? Something like fighting the dark side with light. Light will win. Give him the love and warmth and connection he needs. He is sick and needs help.&lt;&lt;&lt;<br/>\n<br/>\nLots of addicts are able to recover. When I read this, I am reminded of the addicts that dont know what love is and when somebody tries to give it to them, they subconsciously push that person away. I know somebody that is probably an alcoholic. I say probably because she is very good at hiding it and excusing it away. No matter how much warmth and connection I try to give that person, she eventually pushes me away. She finds something to be mad about. She finds some reason to ridicule me or put me down. She doesnt know what she needs and when people try to talk to her about it, she shuts down. Luckily, I dont live with this person and I can take really long breaks from talking to her. The idea that a person is sick and needs help is noble but it does not address whether or not the person wants to be honest with himself and whether or not the person actually wants to change. Some addicts build a neat little cocoon around themselves to protect themselves from the hurt and the pain. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;What is your part in this? Addiction is a family disease. Maybe it&#39;s about finding forgiveness, compassion, understanding, connection? It&#39;s easy to not look at your part when consumed by the drama of the addict.&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>I dont recall if the original post gave much background on the history of the addiction. I know somebody that unknowingly married an addict. She didnt know it until they had been married 3 or 4 years and he called her from work and said that he lost his job because of it. She had no idea. I am wondering how you can look at your part in something when you didnt even know it existed. The guy seemed unhappy with his job and was a bit withdrawn but there are so many things that could have explained his behavior. She knew he wasnt happy with his job so she supported him changing jobs. She helped him pursue his passions and interests but none of that could erase some of the stuff that happened to him as a child. It took him losing his job before he admitted his addiction to anybody, most importantly himself. The couple didnt have insurance and there was no way they could afford rehab or anything like that. The wife was able to help him through it because he wanted to change and she was willing to work with him. She told me that the key for her was to not take anything personally. She sat and listened to him without judgment and without blame. If he slipped up, she held his hand through it and helped him create a plan of action to keep it from happening again. He tried some of the 12 step programs and the group meetings but he said they made him feel even more powerless and even more worthless. <br/>\n<br/>\nConnie<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":362824197,"authorName":"Myrna Doshier","from":"Myrna Doshier &lt;kdoshier@...&gt;","profile":"kdoshier@att.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Marriage-problem, request for ideas","postDate":"1306877593","msgId":61374,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQwNzA4Mi45MjY2NC5xbUB3ZWI4MzgxNi5tYWlsLnNwMS55YWhvby5jb20+","inReplyToHeader":"PDhGODkyQUJDLTVGRjctNDZDRS1BMjAzLTg5RTFDMjkxNzhCM0B5YWhvby5jb20+","referencesHeader":"PDJDM0FDN0YxLUJDOTktNEYwMC1BNzM5LUJDREI2MTI1OTA2NUBTYW5kcmFEb2RkLmNvbT4gPDhGODkyQUJDLTVGRjctNDZDRS1BMjAzLTg5RTFDMjkxNzhCM0B5YWhvby5jb20+"},"prevInTopic":61373,"nextInTopic":61375,"prevInTime":61373,"nextInTime":61375,"topicId":61336,"numMessagesInTopic":0,"msgSnippet":"What ever you end up having to do to keep your children safe, just remember divorce it not necessarily permanent. Don t let a lawyer talk you into damage that","messageBody":"<div id=\"ygrps-yiv-643312051\">What ever you end up having to do to keep your children safe, just remember <br/>\ndivorce it not necessarily permanent. Don&#39;t let a lawyer talk you into damage <br/>\nthat is unnecessary or selfish &quot;for the sake of the children&quot;. I have also used <br/>\nthe services mentioned below in addition to the help of my church and was <br/>\nvery successful. My husband and I divorced and  have remarried each other after <br/>\nsome solid recovery time and have a marriage to be envied. <br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: catfish_friend &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:catfish_friend@...\">catfish_friend@...</a>&gt;<br/>\nTo: &quot;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>&gt;<br/>\nSent: Mon, May 30, 2011 1:20:46 PM<br/>\nSubject: Re: [AlwaysLearning] Marriage-problem, request for ideas<br/>\n<br/>\n  <br/>\n------------<br/>\n<blockquote><span title=\"ireply\"> &gt; I know the nature of this list &quot;isn&#39;t to save marriages from the brink of <br/>\n&gt;divorce.&quot; But I have no one else to turn to. I know from past experience that my <br/>\n&gt;family and friends are so steeped in divorce culture that if I were to share any <br/>\n&gt;of this with them, they would expect me to leave my husband and not look back. I <br/>\n&gt;need less knee-jerk insight right now, and feel like no one else, except for <br/>\n&gt;unschoolers, can really understand how complex this is.<br/>\n </span></blockquote>-------------<br/>\n<br/>\nMy husband and I come from alcoholic families.  There was a time I became <br/>\nconcerned with my husband&#39;s drinking and related behavior.  Here is what helped <br/>\nme and ultimately helped our family:<br/>\n<br/>\n1). Therapy with a professional specializing in addiction and recovery<br/>\n<br/>\n2). Al-Anon on-line groups (finding time to go in person was near impossible)<br/>\n<br/>\n3). AIR (Assistance in Recovery) -- I did not pursue them beyond exploring this <br/>\nas an alternative to intervention and traditional rehab -- it was the road I <br/>\nwould have taken had the first two not worked for our family.<br/>\n<br/>\nThere are many therapists who will work for little money if you are resourceful.  <br/>\nI found a person who was a specialist in recovery and who was expensive, met <br/>\nwith her once with the understanding that she would give me more affordable <br/>\nresources.  She sent me to an intern who is to this day the most amazing <br/>\ntherapist I have worked with (and I&#39;ve had at least 8 not including her since <br/>\nI&#39;ve been an adult!).  She also recommended Al-Anon to me.<br/>\n<br/>\nAl-Anon is free(!) and in an online format worked well for me since I could <br/>\nparticipate as I had the time and or need.  Like many online groups, each has <br/>\nits own culture, so you may also want to lurk a bit before becoming too <br/>\ninvested.  There I found many who understood my challenges and at the same time <br/>\nrecognized that each person&#39;s situation is unique and only the person involved <br/>\ncan make the best choices for herself.  There I learned that advice is not as <br/>\nvaluable as hearing about other&#39;s experiences and then being left alone to <br/>\nponder what might be best for me.  There I learned to take personal <br/>\nresponsibility for the choices I was (and am) making.<br/>\n<br/>\nAiR was a referral I was given and it is an interesting alternative to rehab <br/>\nbecause the family stays intact and regular counseling and drug-testing are <br/>\nincorporated.  I made the decision to try to keep our family intact after much <br/>\nreflection and work on my day-to-day choices (as opposed to filing for divorce <br/>\nor separation).  Fortunately, DH also wanted our family to stay intact and we <br/>\nall wanted to be a peaceful, loving family, so we all worked hard at finding a <br/>\nsolution and found we didn&#39;t need AiR.  Relative to divorce or traditional <br/>\nrehab, AiR is a bargain and from what I can tell, very effective.<br/>\n<br/>\nIt took a lot of time and effort and money but I am proud of our family.  There <br/>\nare people I am not frequently in touch with and they are amazed at the <br/>\nturnaround that has occurred.  People who have no idea what we went through see <br/>\nus as some kind of ideal family.  Given that we emerged from the depths of <br/>\ndespair, joyful and happy to be together, I think we have an ideal family, too <br/>\n:)<br/>\n<br/>\nIt is hard to articulate, but what I have come to understand is along the lines <br/>\nof -- the path is the destination.  For me, the path was choosing serenity, and <br/>\nby making that my goal, it was also the path, the choice I had to make moment to <br/>\nmoment.  It made me a much more pleasant person to be around -- thoughtful <br/>\nrather than reactionary and it started a small ripple in our family pond.  <br/>\nFamily dynamics change when one person changes...<br/>\n<br/>\nDealing with addiction for me is less about the substance and more about the <br/>\npsychological baggage that is the precursor for it.  Dr. Gabor Mate has an angle <br/>\non this that the root of addiction comes from the need for secure attachment.  <br/>\nIn this sense, already being an Unschooling family gives you a leg-up on the <br/>\nparadigm shift needed to live with addiction in your family.  One can prune <br/>\ndiseased branches but if the illness is in the roots, that needs to be <br/>\naddressed, too.<br/>\n<br/>\nI empathize with the OP.  I can only say that reaching out is a bold and brave <br/>\nstep forward.  Good for you.  Please feel free to contact me offlist if you have <br/>\nany questions about what I&#39;ve written here.<br/>\n<br/>\nBest,<br/>\nCeci <br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":396505467,"authorName":"Marcella","from":"&quot;Marcella &quot; &lt;marcelladufault@...&gt;","profile":"marciedp","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] Marriage-problem, request for ideas","postDate":"1306868000","msgId":61375,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNDUwMWNjMWZjNCQwNjcxOTVhMCQxMzU0YzBlMCRAbmV0Pg==","inReplyToHeader":"PDJDM0FDN0YxLUJDOTktNEYwMC1BNzM5LUJDREI2MTI1OTA2NUBTYW5kcmFEb2RkLmNvbT4=","referencesHeader":"PDJDM0FDN0YxLUJDOTktNEYwMC1BNzM5LUJDREI2MTI1OTA2NUBTYW5kcmFEb2RkLmNvbT4="},"prevInTopic":61374,"nextInTopic":61377,"prevInTime":61374,"nextInTime":61376,"topicId":61336,"numMessagesInTopic":0,"msgSnippet":"There has been quite a bit of discussion here.. My son and I are survivors of Domestic Abuse fueled by alcohol and pornography addiction. It took me a","messageBody":"<div id=\"ygrps-yiv-1132534907\">There has been quite a bit of discussion here..<br/>\n<br/>\n <br/>\n<br/>\nMy son and I are survivors of Domestic Abuse fueled by alcohol and<br/>\npornography addiction. It took me a tremendous amount of time and courage to<br/>\nleave after years of trial and error, support, unsuccessful interventions,<br/>\ntherapy, silence and isolation. No knee-jerk decisions on my part. I stayed<br/>\nfor years &quot;for our son&#39;s sake&quot; so I thought. I kept hoping for change, I<br/>\ntried to adjust our relationship to &quot;fit&quot; in an effort to create and<br/>\nstabilize harmony in the home for all&#39;s sake. I thought I owed it to my<br/>\nson&#39;s dad to stay &quot;since he fathered&quot; our child. Our son is a miracle; I was<br/>\nnever supposed to be able to get pregnant.after years of infertility, and I<br/>\nonly have him. I reasoned myself into staying for 8 years. In hindsight, 8<br/>\nyears too long. It is only my opinion that far too often, we make decisions<br/>\nfor our families based upon what we believe is for the good of our kids, but<br/>\nin reality may be detrimental to the health, safety and well-being of our<br/>\nchildren. And, our kids know and feel what is good or bad, reckless or<br/>\nharmonious, nurturing or harmful. Parents cannot pretend everything is ok<br/>\nfor the sake of their children. Children know better and only desire happy<br/>\nparents - no matter what their family dynamic looks like. <br/>\n<br/>\n <br/>\n<br/>\nIronically, our unschooling  journey took shape and flight after the<br/>\nseparation. Moreover, my son&#39;s father entered rehab after separation as well<br/>\nand has been clean and sober ever since. And to be quite honest, I do not<br/>\nknow if my actions prompted his entry into rehab or his bosses at the time.<br/>\nHis boss certainly was the one who  provided the ultimatum. (You will or<br/>\nelse lose your job.) It has been a long road to recovery for all of us, but<br/>\nI have/had been determined to create a &quot;happy, yet divided family&quot; free from<br/>\nresentment, anger, or ire for our son&#39;s sake. At times it seemed almost<br/>\nimpossible to achieve as I worked my way through the court system and<br/>\nbeyond. My son&#39;s father is also a pathological liar stemming from a<br/>\nchildhood of severe abuse; beyond what most of us could imagine. Lying has<br/>\nbecome his coping mechanism. Therapy did not work for him. I work &quot;around<br/>\nthat&quot;, &quot;through that&quot; with patience and cautious vigilance. I do what I do<br/>\nfor our son. <br/>\n<br/>\n <br/>\n<br/>\nOur son has a clear and conscious worldview of his surroundings. I have<br/>\nalways been honest and open with him. I am not trying to &quot;toot my own horn&quot;<br/>\n- but rather communicate that the path towards sobriety, harmony and balance<br/>\nwithin our family has come at a price: irreparable change, yes, but change<br/>\nthat has become our new foundation towards a &quot;happy, yet divided&quot; sober<br/>\nfamily. My son and I are the &quot;New Poor&quot;, we make sacrifices every day so<br/>\nthat we may reap the rewards that follow.  We have downsized; we live a<br/>\nvoluntary simplistic lifestyle. I am not saying that it is easy, but it is<br/>\ndoable for us. And an unschooling way of life has been the glue that has<br/>\nheld my son and I together bringing us closer than ever before!.<br/>\n<br/>\n <br/>\n<br/>\nOur change did not happen overnight; and our lives continue to evolve. I am<br/>\nso proud of our son! At 12 years old now, I am so happy of the young man he<br/>\nis becoming and of the courageous boy he had been through the long nightmare<br/>\nof our past. <br/>\n<br/>\n <br/>\n<br/>\nPlease pass along to this parent, that simply by posting, by sharing and<br/>\nreaching out to others, by raising questions and seeking answers that she<br/>\ntoo is on her way to a happier, more wholesome life experience for all of<br/>\nher family members. Unschooling is just a part of a very complex human<br/>\njourney. <br/>\n<br/>\n <br/>\n<br/>\nYou, and any other victims of domestic violence may contact me off-list if<br/>\nyou&#39;d like. Together we can end the cycle of addiction and violence.<br/>\n<br/>\n <br/>\n<br/>\nWarm Regards,<br/>\n<br/>\n <br/>\n<br/>\nMarcie<br/>\n<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a> [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>]<br/>\nOn Behalf Of Sandra Dodd<br/>\nSent: Sunday, May 29, 2011 2:13 PM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nSubject: [AlwaysLearning] Marriage-problem, request for ideas<br/>\n<br/>\n <br/>\n<br/>\n  <br/>\n<br/>\nThis was sent with a request for me to post it anonymously.<br/>\nMy first thought is to find someone involved in rehabilitation, and find out<br/>\nhow to stage an intervention (and whether there&#39;s insurance or something to<br/>\npay for a stay in rehab).<br/>\n<br/>\n----------------------------------------------<br/>\n<br/>\nI know the nature of this list &quot;isn&#39;t to save marriages from the brink of<br/>\ndivorce.&quot; But I have no one else to turn to. I know from past experience<br/>\nthat my family and friends are so steeped in divorce culture that if I were<br/>\nto share any of this with them, they would expect me to leave my husband and<br/>\nnot look back. I need less knee-jerk insight right now, and feel like no one<br/>\nelse, except for unschoolers, can really understand how complex this is.<br/>\n<br/>\nLast night I found out my husband of 10 years has been using cocaine<br/>\nonce-twice a week. I actually thought he was having an affair, because<br/>\nsometimes he&#39;ll leave for work (he works evenings) all sweet and connected<br/>\nbut then not answer my calls or texts and not come home until the morning.<br/>\nHe texted me this morning that he is &quot;a junkie&quot; and that he&#39;s been doing<br/>\nlines all night at work and after for the past year.<br/>\n<br/>\nI&#39;m not puritanical. We used drugs together (hallucinogens) before we had<br/>\nchildren. I believe (lots of) people can use them in meaningful and<br/>\nnon-addictive ways. But he isn&#39;t one of them. He had one of the worst<br/>\nchildhoods I&#39;ve ever heard of and comes from a long line of drug and alcohol<br/>\nabusers. He carries lots of pain, I know that. I can understand his desire<br/>\nto numb it, but I had hoped that our loving family was doing that.<br/>\n<br/>\nI am mostly upset about the deception and the fact that he has deceived me<br/>\nbefore.<br/>\n<br/>\nI left him for a year and a half a few years ago because he was drinking a<br/>\nlot, lying about all kinds of things, and very, very mean. We didn&#39;t<br/>\ndivorce; we lived 2 miles away from each other, and did a really good job of<br/>\nnot having our separation physically impact our child&#39;s life. Although I<br/>\nhonestly kept waiting for it to get easier on her, for it to become &#39;normal&#39;<br/>\n(she was 4 at the start), it never did. She asked daily for us to all be<br/>\ntogether again. It was torturous for her, and she wasn&#39;t nearly as attached<br/>\nto him then as she is now at almost 8.<br/>\n<br/>\nPartially, unschooling is what helped us get back together. I realized that<br/>\nI had never forgiven him for an earlier betrayal and that if I just loved<br/>\nhim up, trusted him, and assumed good intentions, he&#39;d rise to the occasion.<br/>\n<br/>\nIn some ways it worked, although with each new transgression (they kept<br/>\nhappening), it became harder for me to respect him, to see him as honorable<br/>\n(I cannot get my mind around why that is so important to me, but it is). I<br/>\nwas/am cold to him quite often.<br/>\n<br/>\nI do not know what to do. Except for this relationship, I&#39;ve never been in<br/>\nthe &quot;victim&quot; role. I&#39;ve always picked up and gotten out, immediately, when<br/>\nthings got tough. I&#39;ve never been a mom before, either, though.<br/>\n<br/>\nMy parents had one of the most fucked up divorces people could have,<br/>\ncomplete with international kidnapping and all other kinds of yuck. I didn&#39;t<br/>\nreally fare too badly. I made some (poor) choices as a result, but I&#39;m<br/>\nfairly sane. My brother didn&#39;t fare as well, and the divorce happened for<br/>\nhim when he was the same age as our child is now. That haunts me.<br/>\n<br/>\nI don&#39;t want to get divorced but I don&#39;t know that he can really change,<br/>\nbecome trustworthy. If he were to get busted with drugs, we&#39;d lose the right<br/>\nto homeschool in our state (I guess we could always move). But I don&#39;t want<br/>\nthat kind (this kind) of life. Financially, we&#39;re barely surviving. He could<br/>\nnever support two households on his income. I can find a job and there are<br/>\nextended family who can help with childcare, but that doesn&#39;t make for ideal<br/>\nunschooling, either.<br/>\n<br/>\nEven though I&#39;ve never been too bothered by the thought that he may have<br/>\nslept with someone else a few times, as long as he didn&#39;t have a<br/>\nrelationship with one, it doesn&#39;t really bother me. But the thought of him<br/>\nremarrying or getting involved with someone who would be in a parental role<br/>\nin our child&#39;s life, is terrifying, especially if he continues to make<br/>\nchoices from his junkie perspective. I&#39;ve always felt that if I really and<br/>\ntruly left him, he would self-destruct and our daughter would loose her<br/>\nfather.<br/>\n<br/>\nHe is a wonderful father, but makes terrible (and often dangerous) choices<br/>\nwhen he&#39;s drunk, or otherwise in a downward spiral.<br/>\n<br/>\nIs trust as important in a marriage as I&#39;m making it out to be? Can addicts<br/>\nchange without hitting bottom? Will he not hit bottom if I don&#39;t throw him<br/>\nout? Do I support him through this. if so, how? What would you/have you done<br/>\nin this kind of situation? I know I&#39;m asking for a lot, please, if anyone<br/>\nhas anything to say about any of this, I&#39;m listening. I trust and respect<br/>\nyou all immensely.<br/>\n<br/>\nWise women, please, lay it on me.........<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":359600026,"authorName":"maryann","from":"&quot;maryann&quot; &lt;maryannh@...&gt;","profile":"maryannhh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Marriage-problem, request for ideas","postDate":"1306859414","msgId":61362,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlzMzUybStob3J1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDUyQUI3MEZCLTZERjktNDE3MC05RjI3LUQwODgzNTVBNTI5RUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":61361,"nextInTopic":61373,"prevInTime":61361,"nextInTime":61363,"topicId":61336,"numMessagesInTopic":0,"msgSnippet":"... That was no small step.  Probably, for the person revealing he has a problem and for his wife, the original poster, it was a HUGE step. There will be more","messageBody":"<div id=\"ygrps-yiv-2096997946\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;He&#39;s made a small step by confessing to you, but where will that go? Who knows.&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>That was no small step.  Probably, for the person revealing he has a problem and for his wife, the original poster, it was a HUGE step.  <br/>\nThere will be more steps along the way, for sure.   Seeing every step as valuable, rather than diminishing them, can help lead to more steps.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;In the last six years I can count on one hand the people who I sincerely thought would make it, but remember that I work with people who are tightly in the grips of addiction. So can addicts change? I don&#39;t know.&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>People can recover from addiction.  It absolutely can and does happen.  There are recovery programs whose success rates are due to people who want to change having the support of professionals who believe that change is indeed possible.<br/>\n<br/>\nThere are many recovery programs with very low success rates.   Seek out the best facilites, programs, and counselors available to you.  Seek out professsionals who view people as individuals, and who will work with the nuances of your unschooling family.  <br/>\n<br/>\nSeek out professionals who sincerely believe your husband has good chances of &quot;making it&quot;, and who have experience helping others recover from addiction.<br/>\n<br/>\n<br/>\nmaryann</div>","specialLinks":[]},{"userId":240002389,"authorName":"Andrea Catalano","from":"Andrea Catalano &lt;fennel1001@...&gt;","profile":"ajcm1207","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Marriage-problem, request for ideas","postDate":"1306859248","msgId":61361,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM3NUI4N0U1LUNCRUEtNDU4Qi04NkI4LUVBN0JFNjRCQTZFREB5YWhvby5jb20+"},"prevInTopic":61350,"nextInTopic":61362,"prevInTime":61360,"nextInTime":61362,"topicId":61336,"numMessagesInTopic":0,"msgSnippet":"I have a close relative who was addicted to alcohol and drank for years and years. Although she always tried to stop, she wasn t able to for any length of","messageBody":"<div id=\"ygrps-yiv-1033569130\">I have a close relative who was addicted to alcohol and drank for years and years. Although she always tried to stop, she wasn&#39;t able to for any length of time. She had a few stints in rehab, none of which helped for long. Her family stayed together although there was considerable discord in the home and unhappiness for all of them, including the kids. <br/>\n<br/>\nOnce the kids were grown, she and her husband decided to move from their long-time home. It was that radical change in her life that prompted a change in how she managed her addition. She said it was due, in part, to having the sense if a &quot;clean slate&quot; and the chance to establish new patterns. That, and she found  a very stable and consistent support group (AA) in her new town. She hadn&#39;t had that in the old town although she did attend meetings regularly.<br/>\n<br/>\nIt&#39;s 15+ years since the move and the family is still intact and the mom has a mostly positive relationship with the grown children. Her relationship with her husband weathered the years of mistrust and they were able to move on from their troubled past together.<br/>\n<br/>\nandrea<br/>\n<br/>\nSent from my iPhone</div>","specialLinks":[]},{"userId":374082408,"authorName":"Messyfish","from":"&quot;Messyfish&quot; &lt;messy_fish@...&gt;","profile":"messy_fish","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Marriage-problem, request for ideas","postDate":"1306841379","msgId":61373,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlzMmpmMytyODNhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDJDM0FDN0YxLUJDOTktNEYwMC1BNzM5LUJDREI2MTI1OTA2NUBTYW5kcmFEb2RkLmNvbT4="},"prevInTopic":61362,"nextInTopic":61374,"prevInTime":61372,"nextInTime":61374,"topicId":61336,"numMessagesInTopic":0,"msgSnippet":"Do you love him? Can you love him? He needs love. I know many addicts in recovery who have had many years, (some decades) clean from drugs and alcohol. A great","messageBody":"<div id=\"ygrps-yiv-141445586\">Do you love him? Can you love him? He needs love. I know many addicts in recovery who have had many years, (some decades) clean from drugs and alcohol. A great deal of them have raised kids in happy marriages. <br/>\nRemember the message in star wars? Something like fighting the dark side with light. Light will win. Give him the love and warmth and connection he needs. He  is sick and needs help. <br/>\nWhat is your part in this? Addiction is a family disease. Maybe it&#39;s about finding forgiveness, compassion, understanding, connection? It&#39;s easy to not look at your part when consumed by the drama of the addict. <br/>\nKind regards<br/>\nAnna</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Marriage-problem, request for ideas","postDate":"1306830568","msgId":61350,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUyQUI3MEZCLTZERjktNDE3MC05RjI3LUQwODgzNTVBNTI5RUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEZFQzNENkM0LTQ5OTgtNEI2RC1BRTUwLTY4QkU0QzI0RTk5NUBkcml6emxlLmNvbT4=","referencesHeader":"PDJDM0FDN0YxLUJDOTktNEYwMC1BNzM5LUJDREI2MTI1OTA2NUBTYW5kcmFEb2RkLmNvbT4gPEZFQzNENkM0LTQ5OTgtNEI2RC1BRTUwLTY4QkU0QzI0RTk5NUBkcml6emxlLmNvbT4="},"prevInTopic":61347,"nextInTopic":61361,"prevInTime":61349,"nextInTime":61351,"topicId":61336,"numMessagesInTopic":0,"msgSnippet":"-=-My personal decision would be different than yours. I wouldn t even be writing to a list asking whether or not I should stay. But since you ve stated that","messageBody":"<div id=\"ygrps-yiv-1754587101\">-=-My personal decision would be different than yours. I wouldn&#39;t even be writing to a list asking whether or not I should stay. But since you&#39;ve stated that you don&#39;t want to walk away for many reasons...-=-<br/>\n<br/>\nI don&#39;t think she wanted the list to vote and make a decision for her, or even to recommend a final decision, but to share experiences, ideas, and possible options to help her think about it herself.<br/>\n<br/>\nThere are MANY people who will say, always, &quot;leave.&quot;   The considerations when children are involved should be larger, and slower, than if it&#39;s a childless woman leaving a man.   A mother can&#39;t leave the father of her children without having made an irreparable change in all their lives.  <br/>\n<br/>\nAnd on top of that, the kind of thinking one might do without ever having been involved with unschooling might not apply to someone who has moved toward making decisions for different kinds of reasons, and in a different way.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":146052230,"authorName":"Sacha Davis","from":"Sacha Davis &lt;sacha@...&gt;","profile":"sacha_pie","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: [AlwaysLearning] Marriage-problem, request for ideas","postDate":"1306808774","msgId":61347,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEZFQzNENkM0LTQ5OTgtNEI2RC1BRTUwLTY4QkU0QzI0RTk5NUBkcml6emxlLmNvbT4=","inReplyToHeader":"PDJDM0FDN0YxLUJDOTktNEYwMC1BNzM5LUJDREI2MTI1OTA2NUBTYW5kcmFEb2RkLmNvbT4=","referencesHeader":"PDJDM0FDN0YxLUJDOTktNEYwMC1BNzM5LUJDREI2MTI1OTA2NUBTYW5kcmFEb2RkLmNvbT4="},"prevInTopic":61345,"nextInTopic":61350,"prevInTime":61346,"nextInTime":61348,"topicId":61336,"numMessagesInTopic":0,"msgSnippet":"Hi all - first a brief intro.  My name is Sacha.  I live in Seattle and am unschooling my two kids, Finn (4) and Zivia (9 mos).  I occasionally post on the","messageBody":"<div id=\"ygrps-yiv-1055821699\">Hi all - first a brief intro.  My name is Sacha.  I live in Seattle and am unschooling my two kids, Finn (4) and Zivia (9 mos).  I occasionally post on the unschooling basics list.  We probably are heading toward radical unschooling but it&#39;s a process.<br/>\n<br/>\nI&#39;m an RN and I work inpatient with addicts, so because of this I have one particular world view on drug use.  There is not one moment at my job that I kid myself that addiction is something simple or easy to resolve.  In the last six years I can count on one hand the people who I sincerely thought would make it, but remember that I work with people who are tightly in the grips of addiction.  So can addicts change?  I don&#39;t know.  <br/>\n<br/>\nI admire that you&#39;re trying to find a way to stay present through this, and I can&#39;t imagine the shame your husband must feel, to be so out of control and in pain.  He still needs to get to a place where he choses to feel the pain instead of numbing it, and that&#39;s the big question.  I agree with everyone who said that it&#39;s got to be his decision, from his heart and soul, not from external pressure.  He&#39;s made a small step by confessing to you, but where will that go?  Who knows.  <br/>\n<br/>\nMy personal decision would be different than yours.  I wouldn&#39;t even be writing to a list asking whether or not I should stay.  But since you&#39;ve stated that you don&#39;t want to walk away for many reasons, I think your best bet is to have a good plan and to have good support around you.  Get counseling, go to AlAnon, find some good friends you can confide in who will be straight with you but not judge.  Know your limits, be clear with your husband what they are, stick to them.  I highly recommend reading Gabor Mate&#39;s book In the Realm of Hungry Ghosts.  He&#39;s an MD who works with the addicted population in Vancouver, BC and he&#39;s a strong advocate for harm reduction.  His view on addiction changed my practice as an RN and my MIL found the book inspirational.  <br/>\n<br/>\nBest of luck.  What a terrible thing to go through.  Sometimes if I step back I can see a clear path through all the muck.  I&#39;ll be thinking of you.<br/>\n<br/>\nSacha<br/>\n__________________________________<br/>\nSacha (40), mommy to Finn (4) & Zivia (0) and wife to Megan (38)<br/>\n<br/>\nLivin&#39; la vida loca in Georgetown, Seattle<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On May 29, 2011, at 2:13 PM, Sandra Dodd wrote:<br/>\n<br/>\n&gt; This was sent with a request for me to post it anonymously.<br/>\n&gt; My first thought is to find someone involved in rehabilitation, and find out how to stage an intervention (and whether there&#39;s insurance or something to pay for a stay in rehab).<br/>\n&gt; <br/>\n&gt; ----------------------------------------------<br/>\n&gt; <br/>\n&gt; I know the nature of this list &quot;isn&#39;t to save marriages from the brink of divorce.&quot; But I have no one else to turn to. I know from past experience that my family and friends are so steeped in divorce culture that if I were to share any of this with them, they would expect me to leave my husband and not look back. I need less knee-jerk insight right now, and feel like no one else, except for unschoolers, can really understand how complex this is.<br/>\n&gt; <br/>\n&gt; Last night I found out my husband of 10 years has been using cocaine once-twice a week. I actually thought he was having an affair, because sometimes he&#39;ll leave for work (he works evenings) all sweet and connected but then not answer my calls or texts and not come home until the morning. He texted me this morning that he is &quot;a junkie&quot; and that he&#39;s been doing lines all night at work and after for the past year.<br/>\n&gt; <br/>\n&gt; I&#39;m not puritanical. We used drugs together (hallucinogens) before we had children. I believe (lots of) people can use them in meaningful and non-addictive ways. But he isn&#39;t one of them. He had one of the worst childhoods I&#39;ve ever heard of and comes from a long line of drug and alcohol abusers. He carries lots of pain, I know that. I can understand his desire to numb it, but I had hoped that our loving family was doing that.<br/>\n&gt; <br/>\n&gt; I am mostly upset about the deception and the fact that he has deceived me before.<br/>\n&gt; <br/>\n&gt; I left him for a year and a half a few years ago because he was drinking a lot, lying about all kinds of things, and very, very mean. We didn&#39;t divorce; we lived 2 miles away from each other, and did a really good job of not having our separation physically impact our child&#39;s life. Although I honestly kept waiting for it to get easier on her, for it to become &#39;normal&#39; (she was 4 at the start), it never did. She asked daily for us to all be together again. It was torturous for her, and she wasn&#39;t nearly as attached to him then as she is now at almost 8.<br/>\n&gt; <br/>\n&gt; Partially, unschooling is what helped us get back together. I realized that I had never forgiven him for an earlier betrayal and that if I just loved him up, trusted him, and assumed good intentions, he&#39;d rise to the occasion.<br/>\n&gt; <br/>\n&gt; In some ways it worked, although with each new transgression (they kept happening), it became harder for me to respect him, to see him as honorable (I cannot get my mind around why that is so important to me, but it is). I was/am cold to him quite often.<br/>\n&gt; <br/>\n&gt; I do not know what to do. Except for this relationship, I&#39;ve never been in the &quot;victim&quot; role. I&#39;ve always picked up and gotten out, immediately, when things got tough. I&#39;ve never been a mom before, either, though.<br/>\n&gt; <br/>\n&gt; My parents had one of the most fucked up divorces people could have, complete with international kidnapping and all other kinds of yuck. I didn&#39;t really fare too badly. I made some (poor) choices as a result, but I&#39;m fairly sane. My brother didn&#39;t fare as well, and the divorce happened for him when he was the same age as our child is now. That haunts me.<br/>\n&gt; <br/>\n&gt; I don&#39;t want to get divorced but I don&#39;t know that he can really change, become trustworthy. If he were to get busted with drugs, we&#39;d lose the right to homeschool in our state (I guess we could always move). But I don&#39;t want that kind (this kind) of life. Financially, we&#39;re barely surviving. He could never support two households on his income. I can find a job and there are extended family who can help with childcare, but that doesn&#39;t make for ideal unschooling, either.<br/>\n&gt; <br/>\n&gt; Even though I&#39;ve never been too bothered by the thought that he may have slept with someone else a few times, as long as he didn&#39;t have a relationship with one, it doesn&#39;t really bother me. But the thought of him remarrying or getting involved with someone who would be in a parental role in our child&#39;s life, is terrifying, especially if he continues to make choices from his junkie perspective. I&#39;ve always felt that if I really and truly left him, he would self-destruct and our daughter would loose her father.<br/>\n&gt; <br/>\n&gt; He is a wonderful father, but makes terrible (and often dangerous) choices when he&#39;s drunk, or otherwise in a downward spiral.<br/>\n&gt; <br/>\n&gt; Is trust as important in a marriage as I&#39;m making it out to be? Can addicts change without hitting bottom? Will he not hit bottom if I don&#39;t throw him out? Do I support him through this. if so, how? What would you/have you done in this kind of situation? I know I&#39;m asking for a lot, please, if anyone has anything to say about any of this, I&#39;m listening. I trust and respect you all immensely.<br/>\n&gt; <br/>\n&gt; Wise women, please, lay it on me.........<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":138778570,"authorName":"catfish_friend","from":"catfish_friend &lt;catfish_friend@...&gt;","profile":"catfish_friend","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Marriage-problem, request for ideas","postDate":"1306786846","msgId":61345,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhGODkyQUJDLTVGRjctNDZDRS1BMjAzLTg5RTFDMjkxNzhCM0B5YWhvby5jb20+","inReplyToHeader":"PDJDM0FDN0YxLUJDOTktNEYwMC1BNzM5LUJDREI2MTI1OTA2NUBTYW5kcmFEb2RkLmNvbT4=","referencesHeader":"PDJDM0FDN0YxLUJDOTktNEYwMC1BNzM5LUJDREI2MTI1OTA2NUBTYW5kcmFEb2RkLmNvbT4="},"prevInTopic":61341,"nextInTopic":61347,"prevInTime":61344,"nextInTime":61346,"topicId":61336,"numMessagesInTopic":0,"msgSnippet":"... My husband and I come from alcoholic families.  There was a time I became concerned with my husband s drinking and related behavior.  Here is what helped","messageBody":"<div id=\"ygrps-yiv-1546020810\">------------<br/>\n<blockquote><span title=\"ireply\"> &gt; I know the nature of this list &quot;isn&#39;t to save marriages from the brink of divorce.&quot; But I have no one else to turn to. I know from past experience that my family and friends are so steeped in divorce culture that if I were to share any of this with them, they would expect me to leave my husband and not look back. I need less knee-jerk insight right now, and feel like no one else, except for unschoolers, can really understand how complex this is.<br/>\n </span></blockquote>-------------<br/>\n<br/>\nMy husband and I come from alcoholic families.  There was a time I became concerned with my husband&#39;s drinking and related behavior.  Here is what helped me and ultimately helped our family:<br/>\n<br/>\n1). Therapy with a professional specializing in addiction and recovery<br/>\n<br/>\n2). Al-Anon on-line groups (finding time to go in person was near impossible)<br/>\n<br/>\n3). AIR (Assistance in Recovery) -- I did not pursue them beyond exploring this as an alternative to intervention and traditional rehab -- it was the road I would have taken had the first two not worked for our family.<br/>\n<br/>\n<br/>\nThere are many therapists who will work for little money if you are resourceful.  I found a person who was a specialist in recovery and who was expensive, met with her once with the understanding that she would give me more affordable resources.  She sent me to an intern who is to this day the most amazing therapist I have worked with (and I&#39;ve had at least 8 not including her since I&#39;ve been an adult!).  She also recommended Al-Anon to me.<br/>\n<br/>\nAl-Anon is free(!) and in an online format worked well for me since I could participate as I had the time and or need.  Like many online groups, each has its own culture, so you may also want to lurk a bit before becoming too invested.  There I found many who understood my challenges and at the same time recognized that each person&#39;s situation is unique and only the person involved can make the best choices for herself.  There I learned that advice is not as valuable as hearing about other&#39;s experiences and then being left alone to ponder what might be best for me.  There I learned to take personal responsibility for the choices I was (and am) making.<br/>\n<br/>\nAiR was a referral I was given and it is an interesting alternative to rehab because the family stays intact and regular counseling and drug-testing are incorporated.  I made the decision to try to keep our family intact after much reflection and work on my day-to-day choices (as opposed to filing for divorce or separation).  Fortunately, DH also wanted our family to stay intact and we all wanted to be a peaceful, loving family, so we all worked hard at finding a solution and found we didn&#39;t need AiR.  Relative to divorce or traditional rehab, AiR is a bargain and from what I can tell, very effective.<br/>\n<br/>\nIt took a lot of time and effort and money but I am proud of our family.  There are people I am not frequently in touch with and they are amazed at the turnaround that has occurred.  People who have no idea what we went through see us as some kind of ideal family.  Given that we emerged from the depths of despair, joyful and happy to be together, I think we have an ideal family, too :)<br/>\n<br/>\nIt is hard to articulate, but what I have come to understand is along the lines of -- the path is the destination.  For me, the path was choosing serenity, and by making that my goal, it was also the path, the choice I had to make moment to moment.  It made me a much more pleasant person to be around -- thoughtful rather than reactionary and it started a small ripple in our family pond.  Family dynamics change when one person changes...<br/>\n<br/>\nDealing with addiction for me is less about the substance and more about the psychological baggage that is the precursor for it.  Dr. Gabor Mate has an angle on this that the root of addiction comes from the need for secure attachment.  In this sense, already being an Unschooling family gives you a leg-up on the paradigm shift needed to live with addiction in your family.  One can prune diseased branches but if the illness is in the roots, that needs to be addressed, too.<br/>\n<br/>\nI empathize with the OP.  I can only say that reaching out is a bold and brave step forward.  Good for you.  Please feel free to contact me offlist if you have any questions about what I&#39;ve written here.<br/>\n<br/>\nBest,<br/>\nCeci</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Marriage-problem, request for ideas","postDate":"1306753148","msgId":61341,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEZEQkRBRTVELTVCRTQtNEU0Ri1CRDFFLUU4RUQyMUFCMkVFNkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDJDM0FDN0YxLUJDOTktNEYwMC1BNzM5LUJDREI2MTI1OTA2NUBTYW5kcmFEb2RkLmNvbT4=","referencesHeader":"PDJDM0FDN0YxLUJDOTktNEYwMC1BNzM5LUJDREI2MTI1OTA2NUBTYW5kcmFEb2RkLmNvbT4="},"prevInTopic":61339,"nextInTopic":61345,"prevInTime":61340,"nextInTime":61342,"topicId":61336,"numMessagesInTopic":0,"msgSnippet":"... That s part of addiction, though. If someone s trying to soothe a hurt or fill an emptiness in ways that others don t approve, they re going to lie about","messageBody":"<div id=\"ygrps-yiv-700290885\"><blockquote><span title=\"ireply\">&gt; I am mostly upset about the deception and the fact that he has  <br/>\n&gt; deceived me before.<br/>\n<br/>\n </span></blockquote>That&#39;s part of addiction, though. If someone&#39;s trying to soothe a hurt  <br/>\nor fill an emptiness in ways that others don&#39;t approve, they&#39;re going  <br/>\nto lie about it.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  if I just loved him up, trusted him, and assumed good intentions,  <br/>\n&gt; he&#39;d rise to the occasion.<br/>\n<br/>\n<br/>\n </span></blockquote>That will work much better than anger or nagging! It can provide a  <br/>\nnest to work from. It can provide a reason to work.<br/>\n<br/>\n*If* he can figure out how to fix what&#39;s broken, though. If not, and  <br/>\nit sounds like he hasn&#39;t, he needs professionals to help him. *And* he  <br/>\nneeds to be the one wanting to fix what&#39;s broken. He needs to be the  <br/>\none wanting the nest more than the soothing of the hurt.<br/>\n<br/>\nIn the Rat Park studies that Schuyler has brought up, the researcher  <br/>\nshowed that it was the environment that caused the rats to want drugs,  <br/>\nnot the drugs. If the rats were in a dull, sucky environment, drugs  <br/>\nwere more appealing. If the rats were given a great rat environment,  <br/>\ndrugs didn&#39;t appeal to them.<br/>\n<br/>\nIt sounds like you tried to provide a &quot;rat park&quot; for your husband but  <br/>\nhe probably carries the sucky environment of his childhood with him.  <br/>\nSo it&#39;s still there inside of him even if outwardly it&#39;s gone. Some  <br/>\npeople&#39;s personalities let them leave the past behind. Some people&#39;s  <br/>\ndon&#39;t and they need help letting go. But they need to be the ones  <br/>\nwanting to let go.<br/>\n<br/>\nYou can&#39;t make him want better. You can provide a better he could  <br/>\nwant. You can support him in getting help. But that&#39;s as far as you  <br/>\ncan help. The rest he needs to do himself.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Will he not hit bottom if I don&#39;t throw him out?<br/>\n<br/>\n<br/>\n </span></blockquote>Bottom will look different to each person. For one person it may be  <br/>\nwaking up in an alley. For another it may be the reality of losing  <br/>\ntheir family.<br/>\n<br/>\nPeople do need to be uncomfortable in order to change because it takes  <br/>\nwork to change and fix things. They need to be in a position where  <br/>\nstaying on the path they&#39;re on is worse -- is heading for or at the  <br/>\nbottom -- than working to change.<br/>\n<br/>\nAnd unfortunately your &quot;rat park&quot; also makes soothing the hurt inside  <br/>\nhim easier than fixing it.<br/>\n<br/>\nThe reason there are no easy answers is because the outcome depends on  <br/>\nhis needs and his personality. And, with a sucky childhood, he may not  <br/>\nbe clear on what he needs.<br/>\n<br/>\nOn another list I mentioned that support seems like a good thing. It&#39;s  <br/>\nlike a warm hug when we&#39;re hurting. But the problem is that support  <br/>\n*for where people are* helps them stay stuck, helps where they are  <br/>\nfeel more comfortable. Change requires discomfort with the situation.  <br/>\nChange also requires a desire to get rid of the discomfort. Support  <br/>\nfor change someone&#39;s trying to make is a good thing. Help to change is  <br/>\na good thing. But the desire to do the work to change can only come  <br/>\nfrom inside him.<br/>\n<br/>\nI don&#39;t know if any of that helps. Maybe clarifies things a bit?<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":359600026,"authorName":"maryann","from":"&quot;maryann&quot; &lt;maryannh@...&gt;","profile":"maryannhh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Marriage-problem, request for ideas","postDate":"1306747356","msgId":61339,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlydm5rcythc3ZsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDRERTJGQjhBLjEwOTA5MDNAZWFydGhsaW5rLm5ldD4="},"prevInTopic":61338,"nextInTopic":61341,"prevInTime":61338,"nextInTime":61340,"topicId":61336,"numMessagesInTopic":0,"msgSnippet":"I am so, so sorry you are going through this. A few years ago, a close family member of mine was similarly in a downward spiral addicted to cocaine and","messageBody":"<div id=\"ygrps-yiv-1706187050\">I am so, so sorry you are going through this.<br/>\n<br/>\nA few years ago, a close family member of mine was similarly in a downward spiral addicted to cocaine and alcohol.  He was in his twenties and single with no children at the time.  He hid it from his parents (not unschoolers) but when they finally found out, they decided to offer to pay for rehab at a reputable private inpatient center they had found online that was out of state.  He accepted and spent months of hard work, and is doing very well still 6-7 years later.  <br/>\n<br/>\nFor him, rehab was the first therapy he ever accepted, and has said that being there with other people whose stories were terrible (but that he could relate to) and with counselors who told him what great chances he had for success (because of his loving family and lack of bad record, etc.) helped him tremendously.  <br/>\n<br/>\nFor him it was also huge having his parents offer rehab with a very serious and sincere &quot;We love you and want you to *live* and we believe in you and know you can beat this.&quot;  He has said that having his family members&#39; support was really important.  We all wanted the best for him and just told him how much we loved him and were proud that he was trying and knew he could do it.  <br/>\n<br/>\nWith rehab, then halfway house, then being on his own while still meeting regularly with a counselor, he was gone (states away, someplace in Florida) about a year and a half.  When he moved back, he no longer associated with any of his former friends or coworkers who had anything to do with the bad times he went through.  He would not have come back here at all if it weren&#39;t for his family.  And I don&#39;t think he would have remained anywhere in the area had he not met his partner who is from here and wants to stay near her own family.  They live in a different town nearby now.  I&#39;m sure moving away would have been easier than actively avoiding former drug-related friends who live just a couple towns away, but they both prefer having extended family in their childrens&#39; lives, so they&#39;re making it work.<br/>\n<br/>\nI hope your husband is at a point where he is ready to get help.  He really could be another rehab success story. All is not lost, and I completely agree with you that this is not a time to talk divorce.  The lying goes hand in hand with the addiction.<br/>\n<br/>\nIt will be a long road for all of you, and my heart goes out to you.  <br/>\n<br/>\nTake care,<br/>\nmaryann</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Marriage-problem, request for ideas","postDate":"1306721162","msgId":61338,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRERTJGQjhBLjEwOTA5MDNAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PDJDM0FDN0YxLUJDOTktNEYwMC1BNzM5LUJDREI2MTI1OTA2NUBTYW5kcmFEb2RkLmNvbT4=","referencesHeader":"PDJDM0FDN0YxLUJDOTktNEYwMC1BNzM5LUJDREI2MTI1OTA2NUBTYW5kcmFEb2RkLmNvbT4="},"prevInTopic":61336,"nextInTopic":61339,"prevInTime":61337,"nextInTime":61339,"topicId":61336,"numMessagesInTopic":0,"msgSnippet":"... What does he want? What is he saying about it all? -pam","messageBody":"<div id=\"ygrps-yiv-108193593\">On 5/29/2011 2:13 PM, Sandra Dodd wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I know the nature of this list &quot;isn&#39;t to save marriages from the brink <br/>\n&gt; of divorce.&quot;<br/>\n<br/>\n </span></blockquote>What does he want? What is he saying about it all?<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Marriage-problem, request for ideas","postDate":"1306703605","msgId":61336,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJDM0FDN0YxLUJDOTktNEYwMC1BNzM5LUJDREI2MTI1OTA2NUBTYW5kcmFEb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":61338,"prevInTime":61335,"nextInTime":61337,"topicId":61336,"numMessagesInTopic":0,"msgSnippet":"This was sent with a request for me to post it anonymously. My first thought is to find someone involved in rehabilitation, and find out how to stage an","messageBody":"<div id=\"ygrps-yiv-342070771\">This was sent with a request for me to post it anonymously.<br/>\nMy first thought is to find someone involved in rehabilitation, and find out how to stage an intervention (and whether there&#39;s insurance or something to pay for a stay in rehab).<br/>\n<br/>\n----------------------------------------------<br/>\n<br/>\nI know the nature of this list &quot;isn&#39;t to save marriages from the brink of divorce.&quot; But I have no one else to turn to. I know from past experience that my family and friends are so steeped in divorce culture that if I were to share any of this with them, they would expect me to leave my husband and not look back.  I need less knee-jerk insight right now, and feel like no one else, except for unschoolers, can really understand how complex this is.<br/>\n<br/>\nLast night I found out my husband of 10 years has been using cocaine once-twice a week.  I actually thought he was having an affair, because sometimes he&#39;ll leave for work (he works evenings) all sweet and connected but then not answer my calls or texts and not come home until the morning.  He texted me this morning that he is &quot;a junkie&quot; and that he&#39;s been doing lines all night at work and after for the past year.<br/>\n<br/>\nI&#39;m not puritanical.  We used drugs together (hallucinogens) before we had children.  I believe (lots of) people can use them in meaningful and non-addictive ways.  But he isn&#39;t one of them.  He had one of the worst childhoods I&#39;ve ever heard of and comes from a long line of drug and alcohol abusers. He carries lots of pain, I know that. I can understand his desire to numb it, but I had hoped that our loving family was doing that.<br/>\n<br/>\nI am mostly upset about the deception and the fact that he has deceived me before.<br/>\n<br/>\nI left him for a year and a half a few years ago because he was drinking a lot, lying about all kinds of things, and very, very mean. We didn&#39;t divorce; we lived 2 miles away from each other, and did a really good job of not having our separation physically impact our child&#39;s life.  Although I honestly kept waiting for it to get easier on her, for it to become &#39;normal&#39; (she was 4 at the start), it never did.  She asked daily for us to all be together again. It was torturous for her, and she wasn&#39;t nearly as attached to him then as she is now at almost 8.<br/>\n<br/>\nPartially, unschooling is what helped us get back together.  I realized that I had never forgiven him for an earlier betrayal and that if I just loved him up, trusted him, and assumed good intentions, he&#39;d rise to the occasion.<br/>\n<br/>\nIn some ways it worked, although with each new transgression (they kept happening), it became harder for me to respect him, to see him as honorable (I cannot get my mind around why that is so important to me, but it is). I was/am cold to him quite often.<br/>\n<br/>\nI do not know what to do.  Except for this relationship, I&#39;ve never been in the &quot;victim&quot; role.  I&#39;ve always picked up and gotten out, immediately, when things got tough. I&#39;ve never been a mom before, either, though.<br/>\n<br/>\nMy parents had one of the most fucked up divorces people could have, complete with international kidnapping and all other kinds of yuck.  I didn&#39;t really fare too badly.  I made some (poor) choices as a result, but I&#39;m fairly sane.  My brother didn&#39;t fare as well, and the divorce happened for him when he was the same age as our child is now. That haunts me.<br/>\n<br/>\nI don&#39;t want to get divorced but I don&#39;t know that he can really change, become trustworthy. If he were to get busted with drugs, we&#39;d lose the right to homeschool in our state (I guess we could always move).  But I don&#39;t want that kind (this kind) of life.  Financially, we&#39;re barely surviving. He could never support two households on his income. I can find a job and there are extended family who can help with childcare, but that doesn&#39;t make for ideal unschooling, either.<br/>\n<br/>\nEven though I&#39;ve never been too bothered by the thought that he may have slept with someone else a few times, as long as he didn&#39;t have a relationship with one, it doesn&#39;t really bother me. But the thought of him remarrying or getting involved with someone who would be in a parental role in our child&#39;s life, is terrifying, especially if he continues to make choices from his junkie perspective. I&#39;ve always felt that if I really and truly left him, he would self-destruct and our daughter would loose her father.<br/>\n<br/>\nHe is a wonderful father, but makes terrible (and often dangerous) choices when he&#39;s drunk, or otherwise in a downward spiral.<br/>\n<br/>\nIs trust as important in a marriage as I&#39;m making it out to be?  Can addicts change without hitting bottom?  Will he not hit bottom if I don&#39;t throw him out?  Do I support him through this. if so, how? What would you/have you done in this kind of situation? I know I&#39;m asking for a lot, please, if anyone has anything to say about any of this, I&#39;m listening. I trust and respect you all immensely.<br/>\n<br/>\nWise women, please, lay it on me.........</div>","specialLinks":[]}],"prevTopicId":61305,"nextTopicId":61409}}