{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":45,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: allowances (was Re: [AlwaysLearning] Re: Mums and computers","postDate":"1311629515","msgId":62015,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVCOTgwMzBELTY0QTktNDMxNy1BNThELTQ4MjVCQTFDNEUyMUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGowa2h1NSttMWtkQGVHcm91cHMuY29tPg==","referencesHeader":"PGowa2h1NSttMWtkQGVHcm91cHMuY29tPg=="},"prevInTopic":62013,"nextInTopic":62039,"prevInTime":62014,"nextInTime":62016,"topicId":61966,"numMessagesInTopic":0,"msgSnippet":"-=- What I am having trouble on is if it is ever okay to draw the line? -=- What s not okay is to ask vague, unanswerable questions in cliche form. :-) If we","messageBody":"<div id=\"ygrps-yiv-1653234861\">-=- What I am having trouble on is if it is ever okay to draw the line? -=-<br/>\n<br/>\nWhat&#39;s not okay is to ask vague, unanswerable questions in cliche form. :-)<br/>\n<br/>\nIf we say &quot;no&quot; it&#39;s a stupid answer, and if we say &quot;yes&quot; we don&#39;t have any idea what &quot;draw the line&quot; picture you have in your head (if any).<br/>\n<br/>\nSometimes when people ask cliche questions, they don&#39;t know either.<br/>\n<br/>\nPeople will ask &quot;What about writing?&quot;  without knowing what they&#39;re thinking when they ask.  <br/>\n<br/>\n-=- Lately when we go to the store my girls and I have been cruising the different isles for me to get a better idea of what they find interesting( again something that had been off limits before). If we have the money they get what interests them, like right now my 5 year old is into Barbie, something they were not able to have previously. I do have (because of our budget)to set a limit to the funds they have available though. -=-<br/>\n<br/>\nDon&#39;t cruise stores, then.  Try to get an invite to a Discovery Toys party.  Those who sell those know exactly what formal-language learning can be induced with each and every toy.  Go to thrift stores.  Ask on Craig&#39;s List or freecycle for Barbie stuff.<br/>\n<br/>\n-=- He does not like clutter and feels they already have more than enough toys( we have a very small house). He does not believe they should just get anything they want.-=-<br/>\n<br/>\nSeparate clutter from &quot;anything they want.&quot;<br/>\nHe&#39;s speaking in cliches too.  Don&#39;t ask him to change.   Do it yourself first, and maybe ask him what he means.<br/>\n<br/>\nIf he thinks unschooling is free, that&#39;s not a good way to consider it.  If he thinks the house will be a tidy as if you had never had children, I hope he can afford a housekeeper.  Unschooling is going to be at least as messy as a classroom.  Maybe as messy as several classrooms.<br/>\n<br/>\n-=-Please point me in the direction to better understand how to explain this to him. -=-<br/>\n<br/>\nExplain it to him might not be the next move.  You can back off of spending anything for a while, and let him have time to think.  Take turns making a move, don&#39;t try to play the whole chessgame and checkmate him while he does nothing but say &quot;I said I don&#39;t want to play.&quot;<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":338201201,"authorName":"dkjsv05","from":"&quot;dkjsv05&quot; &lt;dkjsv05@...&gt;","profile":"dkjsv05@att.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"allowances (was Re: [AlwaysLearning] Re: Mums and computers","postDate":"1311623941","msgId":62013,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGowa2h1NSttMWtkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDk2RDA0OEU1LTM2MkItNDNFMC1CREUyLTAyNTNFM0FENTI0NEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":62009,"nextInTopic":62015,"prevInTime":62012,"nextInTime":62014,"topicId":61966,"numMessagesInTopic":0,"msgSnippet":"Still being fairly new to unschooling and coming from a very non materialistic,open ended, natural toys only background, I am truly enjoying this thread. My","messageBody":"<div id=\"ygrps-yiv-181229241\">Still being fairly new to unschooling and coming from a very non materialistic,open ended, natural toys only background, I am truly enjoying this thread. My mind had been opened to see so much that I have done with my children as far as chores, allowances, and what might be considered things for learning. What I am having trouble on is if it is ever okay to draw the line? <br/>\n<br/>\nMy husband and I have been discussing this and he does not see toys as a learning necessity. Lately when we go to the store my girls and I have been cruising the different isles for me to get a better idea of what they find interesting( again something that had been off limits before). If we have the money they get what interests them, like right now my 5 year old is into Barbie, something they were not able to have previously. I do have (because of our budget)to set a limit to the funds they have available though. This however is not going over well with my husband. He does not like clutter and feels they already have more than enough toys( we have a very small house). He does not believe they should just get anything they want.<br/>\n<br/>\nPlease point me in the direction to better understand how to explain this to him. <br/>\n<br/>\nThanks in advance, Kim</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: allowances (was Re: [AlwaysLearning] Re: Mums and computers","postDate":"1311612125","msgId":62009,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEMxOTQyODQ5LTZCQUUtNDQzNS1CRTYyLUU1M0Q0NzRDQ0NBOEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEEzQUVEQzJELTVCNTQtNDgwMS05RDlELTNBRjk4QzYyODQwNUB2ZXJpem9uLm5ldD4=","referencesHeader":"PDE3NTc5OTgzLjEzMTE0MzI5NTc5NDguSmF2YU1haWwucm9vdEB3YW11aS1oYXppcmFuLmF0bC5zYS5lYXJ0aGxpbmsubmV0PiA8NkE5RUE3MjctRDMxQi00REZDLTk4QjctOTc2QzkxNzZBRUI1QFNhbmRyYWRvZGQuY29tPiA8Q0FNdWptZHVxYWdjQlh5Mz16Z2phMTlwRGhmeEs1MDBoRnFQeEh6UmZxeHo5ck1xcE9BQG1haWwuZ21haWwuY29tPiA8OEEzMTE0NjktRTUwQy00MUQ3LTlDRjUtMEVCRDA1RDM5NjRCQHZlcml6b24ubmV0PiA8NUJBNUZFQ0MtQzZDNy00RUY0LThDOTUtMDRBN0I0NEFDMkMwQFNhbmRyYWRvZGQuY29tPiA8QTNBRURDMkQtNUI1NC00ODAxLTlEOUQtM0FGOThDNjI4NDA1QHZlcml6b24ubmV0Pg=="},"prevInTopic":62008,"nextInTopic":62013,"prevInTime":62008,"nextInTime":62010,"topicId":61966,"numMessagesInTopic":0,"msgSnippet":"-=-Now I m picturing a kid thumbing through the book for the family role- playing game trying to decide what predefined character to play! ;-)-=- Maybe he","messageBody":"<div id=\"ygrps-yiv-685467853\">-=-Now I&#39;m picturing a kid thumbing through the book for the family role- <br/>\nplaying game trying to decide what predefined character to play! ;-)-=-<br/>\n<br/>\nMaybe he could roll dice.  Roll for a role. :-)<br/>\n<br/>\nMaybe we could make some moms-roll-dice dice.  Have things like patience and love and compassion and have them roll to see how much of each they will have that day.  Engagement with children.  Awareness.  <br/>\n<br/>\nI would hope they would reject the whole idea in favor of picturing themselves with high levels of all of those things.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] allowances","postDate":"1311608641","msgId":62008,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENCOTlDMTBCLUUyOUMtNEQ4RS1BMkI5LUE1NkM3QUYxOTNDNEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDEzMTE1ODgyNjEuNjA3MS5ZYWhvb01haWxSQ0B3ZWI4NzMxMy5tYWlsLmlyZC55YWhvby5jb20+","referencesHeader":"PENBTXVqbWR1cWFnY0JYeTM9emdqYTE5cERoZnhLNTAwaEZxUHhIelJmcXh6OXJNcXBPQUBtYWlsLmdtYWlsLmNvbT4gPGowaDR1Nitva2IyQGVHcm91cHMuY29tPiA8Q0FNdWptZHY3aGVvS0Z4X2s2RmtUSlZCQXBhczZEZkowYWRaOVlacXVBeGJKbld0SDh3QG1haWwuZ21haWwuY29tPiA8MTMxMTU4ODI2MS42MDcxLllhaG9vTWFpbFJDQHdlYjg3MzEzLm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":62005,"nextInTopic":62009,"prevInTime":62007,"nextInTime":62009,"topicId":61966,"numMessagesInTopic":0,"msgSnippet":"I m glad Schuyler wrote what she wrote about teaching.   I know it seems like just semantics to people new to ideas about natural learning, but those who","messageBody":"<div id=\"ygrps-yiv-476688280\">I&#39;m glad Schuyler wrote what she wrote about teaching.   I know it seems like &quot;just semantics&quot; to people new to ideas about natural learning, but those who ignore the concept won&#39;t become good unschoolers.  They can&#39;t and won&#39;t.  I&#39;ve never seen a good, longterm unschooler who clung to the idea of teaching.  I&#39;ve seen people say &quot;that&#39;s just semantics&quot; and wander away to buy a curriculum or to put their kids in school after a while.<br/>\n<br/>\n-=- Learning happens all the time and it&#39;s really hard to frame, to pin down, to limit, to focus. -=-<br/>\n<br/>\nIt can&#39;t be firmly predicted and it can&#39;t be controlled.<br/>\n<br/>\n-=-Learning is this vast series of connections that begin and grow and grow <br/>\nwith bits and pieces coming together in ways that can sometimes completely <br/>\nchange the view. But those connections, that learning is all internal.-=-<br/>\n<br/>\nWhen I speak to a group (which I did three times this weekend), I know that each person there will take something different away.  And if each person takes five things away, the chance that any two people will take the same five things is very small.  And if someone takes the talk as a HUGE amount of inspiring information, that&#39;s because he or she was ripe to understand it.  There were ideas, experiences and thought-hooks to hang all those stories and pithy inspirational phrases to.  It shed light on a bunch of ideas they had already piled up.  It fertilized seeds they already had in them.<br/>\n<br/>\nWhen someone hears me and sits resistant, waiting for the proof that I&#39;m wrong, that doesn&#39;t hurt me, and it doesn&#39;t hurt the other people in the room.  I don&#39;t mind.  I used to see it as a distraction, and then a challenge, but now I just think of those people as sad rocks in a fast-moving stream, who might have their hardness eroded a little bit, but that can&#39;t keep the ideas from flowing past and through other people in the room.<br/>\n<br/>\nWhen I was teaching, I had a responsibility to the department, to the school, to the state, to the students, to their parents.  I was required to be able to justify whatever I did within the state and district requirements for that subject at that grade level.  I could do it, anytime of the day or night, but it was like having a net thrown over me.  I was creative, still, but couldn&#39;t &quot;reach&quot; or inspire every student, for an array of reasons, few to do with me myself.<br/>\n<br/>\nWhen I first spoke about unschooling I thought each presentation had to be complete, comprehensive, a proper overview, nothing important left out.  I vaguely thought that if someone came there and then left without understanding unschooling, I would have failed.  That&#39;s how I felt in 1996, when Kirby was nine years old and I spoke in Albuquerque a couple of times and California a couple of times.  He turned ten before that last talk.<br/>\n<br/>\nNow when I speak I know I could never say everything, and that I have a website to send people to if they want more, and the pressure is off of me to feel that one hour of sitting and listening needs to be IT for a person.  It might be just frosting first and cake later, and that&#39;s fine.  It might be I&#39;m just giving them a really pretty plate that they like enough to hold on to until they get to the buffet.  It might be I&#39;m talking to them about sleep, and telling them an inspiring bedtime story so they can go elsewhere to sleep and dream and wake up with new thoughts and attitudes.<br/>\n<br/>\nIf children are to learn from money, all they need is the money and some time to think about it, and some chances to spend it frivolously without the voiceover of parents, and to save and spend it wisely another time without the voiceover of parents then either.  Give them the money and let them do what they want to with it.  You don&#39;t know, you can&#39;t know, you don&#39;t need to know, what they will learn from that and what they will do with that.   I&#39;m speaking as an unschooler to unschoolers.  Anyone who has read this far down and is thinking &quot;yeah, but...&quot; (which means &quot;NO&quot;) then I guess you prefer control and teaching.  No crime.  It&#39;s just not cool to share that control-and-teaching advice and justification on the Always Learning list, because people come here to discuss unschooling with unschoolers.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: allowances (was Re: [AlwaysLearning] Re: Mums and computers","postDate":"1311592898","msgId":62005,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEEzQUVEQzJELTVCNTQtNDgwMS05RDlELTNBRjk4QzYyODQwNUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDVCQTVGRUNDLUM2QzctNEVGNC04Qzk1LTA0QTdCNDRBQzJDMEBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDE3NTc5OTgzLjEzMTE0MzI5NTc5NDguSmF2YU1haWwucm9vdEB3YW11aS1oYXppcmFuLmF0bC5zYS5lYXJ0aGxpbmsubmV0PiA8NkE5RUE3MjctRDMxQi00REZDLTk4QjctOTc2QzkxNzZBRUI1QFNhbmRyYWRvZGQuY29tPiA8Q0FNdWptZHVxYWdjQlh5Mz16Z2phMTlwRGhmeEs1MDBoRnFQeEh6UmZxeHo5ck1xcE9BQG1haWwuZ21haWwuY29tPiA8OEEzMTE0NjktRTUwQy00MUQ3LTlDRjUtMEVCRDA1RDM5NjRCQHZlcml6b24ubmV0PiA8NUJBNUZFQ0MtQzZDNy00RUY0LThDOTUtMDRBN0I0NEFDMkMwQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":62004,"nextInTopic":62008,"prevInTime":62004,"nextInTime":62006,"topicId":61966,"numMessagesInTopic":0,"msgSnippet":"... Thanks for clearing that up :-) Now I m picturing a kid thumbing through the book for the family role- playing game trying to decide what predefined","messageBody":"<div id=\"ygrps-yiv-2098177662\">On Jul 24, 2011, at 5:57 PM, Sandra Dodd wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If parents interact with children just as they interact with other  <br/>\n&gt; humans, and choices and options are real and abundant, the child  <br/>\n&gt; will be being himself rather than choosing a role.<br/>\n<br/>\n </span></blockquote>Thanks for clearing that up :-)<br/>\n<br/>\nNow I&#39;m picturing a kid thumbing through the book for the family role- <br/>\nplaying game trying to decide what predefined character to play! ;-)<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"1"},"subject":"Re: [AlwaysLearning] allowances","postDate":"1311588261","msgId":62004,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTE1ODgyNjEuNjA3MS5ZYWhvb01haWxSQ0B3ZWI4NzMxMy5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PENBTXVqbWR2N2hlb0tGeF9rNkZrVEpWQkFwYXM2RGZKMGFkWjlZWnF1QXhiSm5XdEg4d0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PENBTXVqbWR1cWFnY0JYeTM9emdqYTE5cERoZnhLNTAwaEZxUHhIelJmcXh6OXJNcXBPQUBtYWlsLmdtYWlsLmNvbT4gPGowaDR1Nitva2IyQGVHcm91cHMuY29tPiA8Q0FNdWptZHY3aGVvS0Z4X2s2RmtUSlZCQXBhczZEZkowYWRaOVlacXVBeGJKbld0SDh3QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":62003,"nextInTopic":62005,"prevInTime":62003,"nextInTime":62005,"topicId":61966,"numMessagesInTopic":0,"msgSnippet":"... management and we did not learn on our own.  We are still struggling to fix the mistakes that we have made with our finances and develop good money habits.","messageBody":"<div id=\"ygrps-yiv-67502426\"><blockquote><span title=\"ireply\">&gt;&gt;My husband and I did not have good teaching or modeling about money<br/>\n </span></blockquote>management and we did not learn on our own.  We are still struggling to fix<br/>\nthe mistakes that we have made with our finances and develop good money<br/>\nhabits.  The world does not give you a second chance with your credit<br/>\nrating.  The way that we are teaching our children is mainly by transparency<br/>\nand honesty around our own finances.   :P&lt;&lt;<br/>\n<br/>\nFirst, teaching is a term that can bite you in the butt. You may be teaching one <br/>\nthing, but the learning that is going on may be entirely different. Teaching is <br/>\na fascinating word, it is an action that only successfully occurs when someone <br/>\nelse plays their role properly. I&#39;m not phrasing that well. <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.sandradodd.com/teaching/\">http://www.sandradodd.com/teaching/</a> is such a wonderful series of understandings <br/>\nabout the word teach versus learn.<br/>\n<br/>\nIt also paints a picture of the role expectations play in unschooling. Or, maybe <br/>\nhow your expectations are often completely irrelevant in unschooling. Learning <br/>\nhappens all the time and it&#39;s really hard to frame, to pin down, to limit, to <br/>\nfocus. Learning is this vast series of connections that begin and grow and grow <br/>\nwith bits and pieces coming together in ways that can sometimes completely <br/>\nchange the view. But those connections, that learning is all internal. It isn&#39;t <br/>\nmoderator driven, it isn&#39;t taught. It&#39;s one of the real problems that schools <br/>\nsuffer, they may be working to make sure that all of their pupils are &quot;exposed&quot; <br/>\nto the same information, but they are in no way capable of ensuring that they <br/>\nderive the same connections. Whatever you are teaching, your children may or may <br/>\nnot be learning. <br/>\n<br/>\n<br/>\nThe second thing is about money. I have discovered in my own life that I have a <br/>\nneedy relationship with gifts and goods. I want stuff. And I want stuff simply <br/>\nbecause I believe that getting the stuff makes me better, more worthy, a good <br/>\nand well loved person. Actually, that&#39;s not totally true. I used to feel that <br/>\nway. So you can kind of past tense all that stuff. <br/>\n<br/>\n<br/>\nI have a cardigan, or I had a cardigan, I cut it up to make other things with it <br/>\nrecently, but I had a sweater that I found at this little, posh, boutique shop <br/>\nin Durham. David got a jumper that day and I really wanted this cardigan, or <br/>\nsomething, to make it equal, or something. It was really cool colours, a rich <br/>\nblue with fringes of multi-coloured yarn around the cuffs and collar. But it was <br/>\nitchy and it was heavier than I tend to like cardigans. Almost immediately after <br/>\nbuying it and leaving the store, I realised that the value of that cardigan had <br/>\nbeen inflated by own sense that I needed that cardigan. It wasn&#39;t a brilliant <br/>\ncardigan, I never actually wore it very much. The jumper that David got, the <br/>\nlovely soft wool turtleneck that he got, he wore out. But that cardigan was like <br/>\nnew when I cut it up to use in other things. <br/>\n<br/>\n<br/>\nThat cardigan became a cautionary tale cardigan for me. It helped me to see that <br/>\nI wasn&#39;t really looking at the value of something in terms of it&#39;s usefulness, <br/>\nor lastingness, instead I was looking at it through these needy, wanting to be <br/>\nvalidated with presents kind of glasses. My birthday still gives me pause, my <br/>\nneed to be appreciated overwhelming me at the one time when gifts were possible <br/>\nin my childhood. Although this year I had the most amazing birthday. Simon and <br/>\nLinnaea get an allowance. They get an allowance because I wanted to not have my <br/>\nnos be the last word on what they could get at a store or otherwise. I didn&#39;t <br/>\nwant the buck to stop with me. And without every being required to, they mostly <br/>\nhave money in their allowance bank (I write it on the calendar and subtract and <br/>\nadd to it there). This year they asked David to come upstairs and they said that <br/>\nthey wanted to buy a ukulele to give to me for my birthday. David covered half <br/>\nof the cost and they used a fair chunk of their money to pay for the other bit. <br/>\nIt&#39;s a beautiful mahogany ukulele that sounds so sweet whenever I play it, no <br/>\nmatter how limited my playing is. <br/>\n<br/>\n<br/>\nSimon and Linnaea make generous choices a lot of the time. They offer to buy <br/>\nthings for David or for me when we may be feeling the pinch of a month. And they <br/>\nboth amaze me with their discernment in shopping, with their lack of neediness. <br/>\nI have offered both of them games and clothes and things when we are out and <br/>\nthey have both turned me down if it wasn&#39;t something that they really wanted. At <br/>\n11 and 14 my need was so great, I would accept any gift, any offer of money from <br/>\nmy mom or dad or brother or grandparent or aunt or uncle. I would never have <br/>\nthought of weighing and measuring the value of the purchase against the money <br/>\nspent. But they both do. And they both err on the side of savings. <br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: allowances (was Re: [AlwaysLearning] Re: Mums and computers","postDate":"1311585829","msgId":62003,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTE1ODU4MjkuMzk3NDQuWWFob29NYWlsUkNAd2ViODczMTkubWFpbC5pcmQueWFob28uY29tPg==","inReplyToHeader":"PENBTXVqbWRzRDZqRmh0K0haMXhNdUJ4b1pGN2pmV3dYelRqOGhwMWhrOGU2U05tPWpTQUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PDE3NTc5OTgzLjEzMTE0MzI5NTc5NDguSmF2YU1haWwucm9vdEB3YW11aS1oYXppcmFuLmF0bC5zYS5lYXJ0aGxpbmsubmV0PiA8Q0FNdWptZHNENmpGaHQrSFoxeE11QnhvWkY3amZXd1h6VGo4aHAxaGs4ZTZTTm09alNBQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":62002,"nextInTopic":62004,"prevInTime":62002,"nextInTime":62004,"topicId":61966,"numMessagesInTopic":0,"msgSnippet":"... of what they get (and my husband and I match their savings). ","messageBody":"<div id=\"ygrps-yiv-1468925765\"><blockquote><span title=\"ireply\">&gt;&gt;and are asked to save half<br/>\n<br/>\n </span></blockquote>of what they get (and my husband and I match their savings). &lt;&lt;<br/>\n<br/>\nThat seems an odd instructional tool approach to money. Why aren&#39;t you just <br/>\nputting the money that you want them to save in a savings account. Every two <br/>\nweeks, 3 times their ages in savings from you and 1.5 times their ages as <br/>\nallowance. If you are making them do something (you aren&#39;t asking, right? you <br/>\nare requiring) it seems better just to take that hurdle out of the picture and <br/>\ntuck the savings directly in the bank, or however you work it. <br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] allowances","postDate":"1311572233","msgId":62002,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYzOTlDOUEwLTdBRkUtNDVEMC1CREY5LTk3NTBGNDFDMTkyOUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PENBTXVqbWR2N2hlb0tGeF9rNkZrVEpWQkFwYXM2RGZKMGFkWjlZWnF1QXhiSm5XdEg4d0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PENBTXVqbWR1cWFnY0JYeTM9emdqYTE5cERoZnhLNTAwaEZxUHhIelJmcXh6OXJNcXBPQUBtYWlsLmdtYWlsLmNvbT4gPGowaDR1Nitva2IyQGVHcm91cHMuY29tPiA8Q0FNdWptZHY3aGVvS0Z4X2s2RmtUSlZCQXBhczZEZkowYWRaOVlacXVBeGJKbld0SDh3QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":62000,"nextInTopic":62003,"prevInTime":62001,"nextInTime":62003,"topicId":61966,"numMessagesInTopic":0,"msgSnippet":"-=- We also try to be sensitive to the amount of stuff we put into the waste stream. We are great believers in small simple joys, like always having small","messageBody":"<div id=\"ygrps-yiv-229141164\">-=- We also try to be sensitive to the amount of stuff we put into the<br/>\nwaste stream. We are great believers in small simple joys, like always<br/>\nhaving small games on hand to play when waiting for something, somewhere.-=-<br/>\n<br/>\nPlease try to distinguish between the &quot;we&quot; that means &quot;my husband and I&quot; or &quot;I&quot; and the &quot;we&quot; that means your family.  Your family is unlikely to have all the same sensitivities and beliefs, and it will make it more difficult for you to see and think about what you&#39;re doing (and to describe and share it with others on this list) if you&#39;re speaking for everyone as a group.<br/>\n<br/>\n-=-As for setting up life lessons... well no, not really. I will communicate<br/>\nexpectations around certain tasks, like household things. I will make<br/>\nsuggestions about certain things, like how to plan and save. We have some<br/>\nvery basic rules in the house that apply to everybody. We are all capable<br/>\nof keeping the house clean and happy to be in and we are all expected to<br/>\ncontribute to that goal. We all have a responsibility to save and plan for<br/>\nthe future financially, as per our development and age. We aren&#39;t setting<br/>\nup things for the kids that we do not do for ourselves.-=-<br/>\n<br/>\nYou said lessons before, didn&#39;t you?  (You did say &quot;teach them...&quot;)    I think you said chores.<br/>\n<br/>\n-=-Everyone chooses the activity (I hate to say chore--it just makes a task<br/>\nsound unpleasant) that they will do to keep the house livable. I do have to<br/>\nremind some folks about their choices. Sometimes, I am reminded of mine.-=-<br/>\n<br/>\nIt doesn&#39;t matter whether you use the word &quot;chore,&quot; if there are rules and charts and requirements and reminders and the inability to opt out.<br/>\n<br/>\n-=- We have some very basic rules in the house that apply to everybody.-=-<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/rules\">http://sandradodd.com/rules</a><br/>\n<br/>\nIt&#39;s not a problem to have rules.  It&#39;s legal, it&#39;s moral, most families want them and praise other families for having them.<br/>\n<br/>\nIn light of moving from a traditional, conservative, default way of living to a mindful unschooling way of living, though, it&#39;s important to look at rules, and where they come from and whether they can be replaced with non-arbitrary ways of making decisions.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] allowances","postDate":"1311567772","msgId":62000,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYwNEUwNzczLTlFOEItNDBGOS04NUU0LTU3NDNFNjNERUNBNEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PENBTXVqbWR2N2hlb0tGeF9rNkZrVEpWQkFwYXM2RGZKMGFkWjlZWnF1QXhiSm5XdEg4d0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PENBTXVqbWR1cWFnY0JYeTM9emdqYTE5cERoZnhLNTAwaEZxUHhIelJmcXh6OXJNcXBPQUBtYWlsLmdtYWlsLmNvbT4gPGowaDR1Nitva2IyQGVHcm91cHMuY29tPiA8Q0FNdWptZHY3aGVvS0Z4X2s2RmtUSlZCQXBhczZEZkowYWRaOVlacXVBeGJKbld0SDh3QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":61998,"nextInTopic":62002,"prevInTime":61999,"nextInTime":62001,"topicId":61966,"numMessagesInTopic":0,"msgSnippet":"-=-Sorry for the poor grammar and phrasing, It should have been, We have used our allowance plan to teach about budgeting and saving and what money means in","messageBody":"<div id=\"ygrps-yiv-1184339627\">-=-Sorry for the poor grammar and phrasing, It should have been, &quot;We have used<br/>\nour allowance plan to teach about budgeting and saving and what money means<br/>\nin society. There is no &quot;have to&quot;, -=-<br/>\n<br/>\nPeople&#39;s objection wasn&#39;t about grammar or phrasing.  You very likely said exactly what you meant, which was that there were &quot;have-to&quot; style requirements, and they were of your own device.  <br/>\n<br/>\nIf you are using anything in your lives specifically with the idea of &quot;teaching,&quot; then unschooling will not work as well in your family as it could.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/wordswords\">http://sandradodd.com/wordswords</a><br/>\n<br/>\n-=-There is no &quot;have to&quot;, but a vague hope that my children will<br/>\nbe better at managing money than their father and I-=-<br/>\n<br/>\nWhen children aren&#39;t given them the opportunity to succeed or fail on their own,  they might resent restriction, which could make them behave in a reactionary way.  Practicing with small amounts of money is wonderful.  Practicing choices in minor situations gives kids years of decision-making help before they&#39;re old enough to make larger, more life-and-death decisions.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":231415297,"authorName":"chris ester","from":"chris ester &lt;chris.homeschool@...&gt;","profile":"chris_e_bear","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] allowances","postDate":"1311550767","msgId":61998,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBTXVqbWR2N2hlb0tGeF9rNkZrVEpWQkFwYXM2RGZKMGFkWjlZWnF1QXhiSm5XdEg4d0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGowaDR1Nitva2IyQGVHcm91cHMuY29tPg==","referencesHeader":"PENBTXVqbWR1cWFnY0JYeTM9emdqYTE5cERoZnhLNTAwaEZxUHhIelJmcXh6OXJNcXBPQUBtYWlsLmdtYWlsLmNvbT4JPGowaDR1Nitva2IyQGVHcm91cHMuY29tPg=="},"prevInTopic":61997,"nextInTopic":62000,"prevInTime":61997,"nextInTime":61999,"topicId":61966,"numMessagesInTopic":0,"msgSnippet":"On Sun, Jul 24, 2011 at 8:58 AM, plaidpanties666 ... Sorry for the poor grammar and phrasing, It should have been, We have used our allowance plan to teach","messageBody":"<div id=\"ygrps-yiv-1761135786\">On Sun, Jul 24, 2011 at 8:58 AM, plaidpanties666<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:plaidpanties666@...\">plaidpanties666@...</a>&gt;wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; chris ester &lt;chris.homeschool@...&gt; wrote:<br/>\n&gt; &gt;We have used the<br/>\n&gt; &gt; allowance plan that we have to learn about budgeting and saving, and what<br/>\n&gt; &gt; money means in society.<br/>\n&gt;<br/>\n<br/>\n&gt; &gt;&gt;&gt;&quot;Have to learn&quot; is a good phrase to examine. It&#39;s rooted in the idea<br/>\n&gt; that people won&#39;t learn the *right* things on their own. When you step away<br/>\n&gt; from have tos and clandestine teaching tools, kids still learn about the<br/>\n&gt; world. Kids given money freely, no strings attached, still learn about<br/>\n&gt; budgets and &quot;the value of money&quot;. &lt;&lt;&lt;<br/>\n&gt;<br/>\n </span></blockquote>Sorry for the poor grammar and phrasing, It should have been, &quot;We have used<br/>\nour allowance plan to teach about budgeting and saving and what money means<br/>\nin society.  There is no &quot;have to&quot;, but a vague hope that my children will<br/>\nbe better at managing money than their father and I.  Their allowance is no<br/>\nstrings attached, they are given a task to complete with the money, which is<br/>\nto save a certain amount.  I guess that we could give them a lower amount<br/>\nand just save for them, but it seems like a better idea that they get into<br/>\nthe habit of putting away money themselves for themselves.  They can also<br/>\nchange when they save, so if they have a use for the money this pay, they<br/>\ncan put it away next pay.<br/>\n<br/>\nMy husband and I did not have good teaching or modeling about money<br/>\nmanagement and we did not learn on our own.  We are still struggling to fix<br/>\nthe mistakes that we have made with our finances and develop good money<br/>\nhabits.  The world does not give you a second chance with your credit<br/>\nrating.  The way that we are teaching our children is mainly by transparency<br/>\nand honesty around our own finances.   :P<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; &gt;&gt;they almost never ask for frivolous<br/>\n&gt; &gt; things<br/>\n&gt;<br/>\n&gt; &gt;&gt;&gt;What&#39;s a frivolous thing? It&#39;s something to think about, not necessarily<br/>\n&gt; answer here. Pegging some interests as frivolous devalues a person&#39;s<br/>\n&gt; feelings. It&#39;s a way of shutting someone down when he or she expresses joy<br/>\n&gt; in small, simple pleasures. There&#39;s cultural baggage and a surprising amount<br/>\n&gt; of internalized sexism in the idea of &quot;frivolous things&quot;. One of the very<br/>\n&gt; common complaints against unschooling as a philosophy is that it values<br/>\n&gt; frivolous things like joy over serious things like discipline. &lt;&lt;&lt;&lt;<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>By &quot;frivolous&quot; I mean something that is usually low cost, poorly made (and<br/>\nso easily broken), and brings little joy.  We value joy in this family.  So<br/>\nI have been know to buy a $1 pack of super bouncy balls to play with the<br/>\ncats with.  It brings the entire family joy--the two legged and four legged<br/>\nfolks.   We also try to be sensitive to the amount of stuff we put into the<br/>\nwaste stream.  We are great believers in small simple joys, like always<br/>\nhaving small games on hand to play when waiting for something, somewhere.<br/>\n<br/>\nMy parents were often bemused and bewildered by the amount of money and<br/>\neffort that we put into games of all sorts, the number of pets that we have<br/>\nand the time that we spend on all of the above.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; &gt; if it seems like a purchase that fits into our unschooling life or if<br/>\n&gt; &gt; it seems like a really good idea for the household, then the adults pay<br/>\n&gt; for<br/>\n&gt; &gt; it.<br/>\n&gt;<br/>\n&gt; &gt;&gt;But frivolous things like video games and lip-gloss Do, absolutely, fit<br/>\n&gt; into an unschooling life. So why not offer to buy those, too?&lt;&lt;&lt;<br/>\n&gt;<br/>\n </span></blockquote>Oh, we do and have bought those things, but there is also a point where the<br/>\nmoney only goes so far and if it is something that is not necessary for life<br/>\nand limb or we already have a bunch AND it is only used by one person, then<br/>\nthat person  buys it for themselves.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt;&gt;Lovliness and enjoyment *are* valuable additions to a household.&lt;&lt;&lt;<br/>\n&gt;<br/>\n </span></blockquote>We have NO shortage of loveliness and  enjoyment in this household.  Those<br/>\nwere only two examples of my children buying something for themselves that<br/>\nthey already have several of.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt;&gt;&gt;You&#39;re still thinking in terms of molding kids in a particular direction<br/>\n&gt; rather than supporting their interests with the understanding that learning<br/>\n&gt; Is happening. &lt;&lt;&lt;<br/>\n&gt;<br/>\n </span></blockquote>Again, supporting my children&#39;s interests can only go so far financially.<br/>\nIsn&#39;t it better to allow them their own money to buy what they want, when<br/>\nthey want without asking me or my husband for it?  They seem to love the<br/>\nfreedom to do so. My daughter loves to shop, I do not.  I take her to the<br/>\nmall to meet with her friends and I hang out in a coffee shop while they go<br/>\noff shopping.  We do go shopping together, but I am not as interested in<br/>\nsome fashions as my girl and her friends.   If I see them buying something<br/>\nthat I feel is more of my responsibility (food, even junk food often falls<br/>\ninto this category, or with my daughter, clothing), then I offer to buy it.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt;&gt;&gt;You aren&#39;t trusting your kids to grow into thoughtful, responsible<br/>\n&gt; people without weighing their choices for them. You&#39;re valuing a kind of<br/>\n&gt; right answer over the process of thoughtful decision making. &lt;&lt;<br/>\n&gt;<br/>\n </span></blockquote>Actually, at 13 and 15, they are very thoughtful, responsible people who<br/>\nthink and decide in a deliberative way, while still not being paralyzed by<br/>\nany fear of making the wrong decision.  And yes, I have shared my values<br/>\nwith my children.  They are amazing kids with their own views and values.<br/>\nBelieve me, they are their own person.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; &gt;&gt;And it seems like your kids have figured out how to give you the kind of<br/>\n&gt; answers you want. That&#39;s not a terrible thing, but you&#39;re describing a kind<br/>\n&gt; of teaching, of setting up &quot;life lessons&quot; rather than striving to be your<br/>\n&gt; kids&#39; partner in discovery.<br/>\n&gt;<br/>\n&gt; ---Meredith&lt;&lt;&lt;<br/>\n&gt;<br/>\n </span></blockquote>Actually, they will both tell me that they know what I want them<br/>\nsay/do/decide and then they tell me what they are going to do.  I get to be<br/>\nopen and honest in my opinions with my kids, just like they get to tell me<br/>\nwhat they think about something.  One of the things that I am proudest of is<br/>\nthat my kids will both look me and/or their father in the eye and disagree<br/>\nwith us in fairly respectful but firm tones.<br/>\n<br/>\nAs for setting up life lessons... well no, not really.  I will communicate<br/>\nexpectations around certain tasks, like household things.  I will make<br/>\nsuggestions about certain things, like how to plan and save.  We have some<br/>\nvery basic rules in the house that apply to everybody.  We are all capable<br/>\nof keeping the house clean and happy to be in and we are all expected to<br/>\ncontribute to that goal.  We all have a responsibility to save and plan for<br/>\nthe future financially, as per our development and age.  We aren&#39;t setting<br/>\nup things for the kids that we do not do for ourselves.<br/>\n<br/>\nEveryone chooses the activity (I hate to say chore--it just makes a task<br/>\nsound unpleasant) that they will do to keep the house livable.  I do have to<br/>\nremind some folks about their choices.  Sometimes, I am reminded of mine.<br/>\n<br/>\nGiven their ages, they tend to go out and discover and then come back and<br/>\nshare now.  I do the same.  Sometimes we go out together and play and<br/>\ndiscover.   I have to admit to sometimes worrying that they could get hurt,<br/>\nbut I don&#39;t share that.  I just say a quiet prayer and smile and wave as<br/>\nthey go off on their own.<br/>\nChris<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":301108410,"authorName":"Marina DeLuca-Howard","from":"Marina DeLuca-Howard &lt;delucahoward@...&gt;","profile":"matedgirl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: allowances (was Re: [AlwaysLearning] Re: Mums and computers","postDate":"1311548717","msgId":61997,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBUENTNkFYSEFzS3dndWNjNFNRK25DRnFLRTNxNG9DNTFFKy1IaWoxNEIwYzV6UE44QUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDk2RDA0OEU1LTM2MkItNDNFMC1CREUyLTAyNTNFM0FENTI0NEBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDIzNTc5NjI4LjEzMTE1MTEwMjgzNzYuSmF2YU1haWwucm9vdEB3YW11aS1qdW5pby5hdGwuc2EuZWFydGhsaW5rLm5ldD4JPENBUENTNkFWZitXM0FCS3d2NFMtMl9IOXVSVVkzK0dEYmNTLW1pRmE3Snk4RjVGPTVRQUBtYWlsLmdtYWlsLmNvbT4JPDk2RDA0OEU1LTM2MkItNDNFMC1CREUyLTAyNTNFM0FENTI0NEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":61996,"nextInTopic":61998,"prevInTime":61996,"nextInTime":61998,"topicId":61966,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1512091982\">&lt;&lt;I with you wouldn&#39;t say &quot;junkfood.&quot; Everytime that name is spoken it makes<br/>\nit seem more legitimate, but the term itself is a problem.&gt;&gt;<br/>\n<br/>\nYou are right.  I&#39;m doing a discussion circle at an unschooling conference<br/>\non Natural Parenting and parenting naturally in part because people refer to<br/>\nsome food as &quot;junkfood&quot; and other food as natural.  Really, there are sorts<br/>\nof issues besides food entwined with natural--clothes, plastic toys,<br/>\ncomputers, television, and all sorts of &quot;Natural&quot; with a capital &quot;N&quot; that I<br/>\nhave been looking at more closely.  You know &quot;Natural consequences&quot; that<br/>\ncome from a parent&#39;s dark place that result in preventable losses if the<br/>\nparent acts or sadness for the child.<br/>\n<br/>\nFinances seep into all sorts of transactions--including television, sleep<br/>\nand computers.  Does the child&#39;s computer get to be the best you can afford,<br/>\ndo their hours on it get governed by the cost of electricity?  I see<br/>\nfinances as seeping into all sorts of rules, just as rather invisible<br/>\nconsiderations.  And I don&#39;t mean income level restrictions.<br/>\n<br/>\nThere are lots of parents in debt because of private schools or large<br/>\npurchases.  Debt in the western world in the form of personal debt is high.<br/>\n Some of that debt while not child-led is purchases for children--perhaps<br/>\nnot unschoolers, but in the regular parenting world people are charging<br/>\ntutoring services and special classes for kids on credit cards.  I have<br/>\ngotten into discussions about that with parents who are paying someone large<br/>\namounts of cash to spend time with their child so they can get &quot;ahead&quot; in<br/>\nthe world of school.  I have met these parents who are in debt over private<br/>\nschools, swimming pools and horses they wanted to provide for their kids.<br/>\n Losing everything and declaring personal bankruptcy may be too much<br/>\nhyperbole:) on my part though and humour and irony do get lost on occasion.<br/>\n<br/>\nMarina<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: allowances (was Re: [AlwaysLearning] Re: Mums and computers","postDate":"1311544670","msgId":61996,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVCQTVGRUNDLUM2QzctNEVGNC04Qzk1LTA0QTdCNDRBQzJDMEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDhBMzExNDY5LUU1MEMtNDFENy05Q0Y1LTBFQkQwNUQzOTY0QkB2ZXJpem9uLm5ldD4=","referencesHeader":"PDE3NTc5OTgzLjEzMTE0MzI5NTc5NDguSmF2YU1haWwucm9vdEB3YW11aS1oYXppcmFuLmF0bC5zYS5lYXJ0aGxpbmsubmV0PiA8NkE5RUE3MjctRDMxQi00REZDLTk4QjctOTc2QzkxNzZBRUI1QFNhbmRyYWRvZGQuY29tPiA8Q0FNdWptZHVxYWdjQlh5Mz16Z2phMTlwRGhmeEs1MDBoRnFQeEh6UmZxeHo5ck1xcE9BQG1haWwuZ21haWwuY29tPiA8OEEzMTE0NjktRTUwQy00MUQ3LTlDRjUtMEVCRDA1RDM5NjRCQHZlcml6b24ubmV0Pg=="},"prevInTopic":61995,"nextInTopic":61997,"prevInTime":61995,"nextInTime":61997,"topicId":61966,"numMessagesInTopic":0,"msgSnippet":"-=-For radical unschooling purposes, the child chooses the role they want to play.-=- I loved everything in Joyce s post up to that point. There will be people","messageBody":"<div id=\"ygrps-yiv-929373513\">-=-For radical unschooling purposes, the child chooses the role they want to play.-=-<br/>\n<br/>\nI loved everything in Joyce&#39;s post up to that point.<br/>\n<br/>\nThere will be people who read something like that and then turn to a child and say &quot;You get to choose the role you want to play.  So what will that be?&quot;<br/>\n<br/>\nIf parents interact with children just as they interact with other humans, and choices and options are real and abundant, the child will be being himself rather than choosing a role.<br/>\n<br/>\nBecause I know Joyce, I think I know what she meant.<br/>\nBecause I&#39;ve met many confused unschoolers (and confused homeschoolers who have rejected the idea of unschooling because they&#39;ve heard spooky rumors and misinformation), that statement jumped out at me honking.<br/>\n<br/>\n-=-If they don&#39;t feel the extra isn&#39;t adding much value to them, if they <br/>\nfeel they can reject the information, if they feel the parent is <br/>\nfocused on helping with the child&#39;s goal rather than focused on the <br/>\nadult&#39;s goal of teaching them the right way to think about something, <br/>\nthey&#39;re more likely to give thoughtful consideration to the information.<br/>\n<br/>\n-=-If it&#39;s a way of view that&#39;s imposed on them as how they need to think <br/>\nabout something, they&#39;re more likely to reject it without thought just <br/>\nto feel in control.-=-<br/>\n<br/>\nI think those were good to repeat.  They both have to do with there being a winner and a loser, in a situation.  Antagonism.  Adversarial stances.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/partners/child\">http://sandradodd.com/partners/child</a><br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: allowances (was Re: [AlwaysLearning] Re: Mums and computers","postDate":"1311543865","msgId":61995,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTE1NDM4NjUuNzI4MDcuWWFob29NYWlsTmVvQHdlYjExMDQwMi5tYWlsLmdxMS55YWhvby5jb20+","inReplyToHeader":"PENBTXVqbWRzRDZqRmh0K0haMXhNdUJ4b1pGN2pmV3dYelRqOGhwMWhrOGU2U05tPWpTQUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PDE3NTc5OTgzLjEzMTE0MzI5NTc5NDguSmF2YU1haWwucm9vdEB3YW11aS1oYXppcmFuLmF0bC5zYS5lYXJ0aGxpbmsubmV0PiA8Q0FNdWptZHNENmpGaHQrSFoxeE11QnhvWkY3amZXd1h6VGo4aHAxaGs4ZTZTTm09alNBQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":61994,"nextInTopic":61996,"prevInTime":61994,"nextInTime":61996,"topicId":61966,"numMessagesInTopic":0,"msgSnippet":" ***As far as chores , everyone is a part of the household and is expected to participate in maintaining the household, we do not necessarily get paid for","messageBody":"<div id=\"ygrps-yiv-1982531454\"> ***As far as &#39;chores&#39;, everyone is a part<br/>\nof the household and is expected to participate in maintaining the<br/>\nhousehold, we do not necessarily get paid for cleaning or cooking because<br/>\nthis is our home and we have to maintain it.***<br/>\n<br/>\n<br/>\nI know plenty of parents who feel that way.  One mom I know certainly felt that way strongly enough that her expectation of such things ruled the house and everything her daughter did or wanted to do.  If the daughter wanted to spend her small amount of free time playing, she HAD TO do her household expectations first.  That girl ran away from home twice.  She grew to hate her mother and spent the last 10 months in a mother appointed rehab center, living away from home, learning how to be a good daughter that follows the rules and appreciates her mother&#39;s expectations.<br/>\n<br/>\nI hope you don&#39;t do that, but people do.  It&#39;s not a thought that goes in the direction of happy peaceful unschooling.<br/>\n<br/>\n_._,___<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: allowances (was Re: [AlwaysLearning] Re: Mums and computers","postDate":"1311542997","msgId":61994,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTE1NDI5OTcuNjk2My5ZYWhvb01haWxOZW9Ad2ViMTEwNDE0Lm1haWwuZ3ExLnlhaG9vLmNvbT4=","inReplyToHeader":"PDk2RDA0OEU1LTM2MkItNDNFMC1CREUyLTAyNTNFM0FENTI0NEBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDIzNTc5NjI4LjEzMTE1MTEwMjgzNzYuSmF2YU1haWwucm9vdEB3YW11aS1qdW5pby5hdGwuc2EuZWFydGhsaW5rLm5ldD4gPENBUENTNkFWZitXM0FCS3d2NFMtMl9IOXVSVVkzK0dEYmNTLW1pRmE3Snk4RjVGPTVRQUBtYWlsLmdtYWlsLmNvbT4gPDk2RDA0OEU1LTM2MkItNDNFMC1CREUyLTAyNTNFM0FENTI0NEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":61993,"nextInTopic":61995,"prevInTime":61993,"nextInTime":61995,"topicId":61966,"numMessagesInTopic":0,"msgSnippet":"***In all the years I ve been writing with/to/for unschoolers, finances is miniature compared to television and food. Sleep is smaller than television and","messageBody":"<div id=\"ygrps-yiv-1633452530\">***In all the years I&#39;ve been writing with/to/for unschoolers, finances is miniature compared to television and food. Sleep is smaller than television and bigger than money.***<br/>\n<br/>\n<br/>\nThe food issue seems to be the biggest, in my experience!  The food issue is often tied to the money issue!  Locally, it&#39;s caused the most unrest and confusion on unschooling lists.  There are LOTS of unschoolers who control food.  I doubt they will post on a list like this because they don&#39;t want it questioned.  It&#39;s the great big divide, it seems between unschooling academics and radical unschooling.  Media of all kinds, TV included, comes into play right in there with the unschooling academics.  Since many people do not see media as valuable in education, they won&#39;t include it in their academic unschooling.  <br/>\n<br/>\nBut the food issue, THAT one is HUGE!  I&#39;ve attempted to parse it out for myself over and over and over.  I&#39;ve avoided passing it on to my kids.  My best knowledge of food comes straight from my own experience as a child with food limitations and force, so even IF my kids had been in school all these years, I would still not be limiting and forcing food, but I might have limited media usage and money would be parsed out differently for sure, and sleep would need to be on a schedule to match school.  My personal opinion is that food is such a big issue for people because it is directly linked to nourishment, both mentally and physically, and it&#39;s completely necessary for survival.  Media and money are a whole different thing and sleep happens whether we try to force it or not.<br/>\n<br/>\nIt seems weird that food gets linked into unschooling, but it does.  It is really only an unschooling issue in so far as control and placing limits aren&#39;t optimal for unschooling to flourish the way it does beautifully when those things don&#39;t come into play.  Media and money and sleep are exactly the same in that regard.  Once a person starts questioning assumptions about why control is necessary, or why anything is necessary, it only seems natural to question everything.  I don&#39;t think I will ever truly understand those that unschool only academics.  Even when we first started unschooling, it made sense to me to extend unschooling to life outside of &quot;subjects&quot; and &quot;necessary&quot;.  It made sense that it would move straight on into everything else like when and what to eat and when to sleep and how to occupy one&#39;s time with media and how to meet the needs of everyone in the family within our monetary means.<br/>\n<br/>\nThe most helpful bit of advice, or idea about money that I got from unschooling was the idea of money belonging to the family unit, not simply the ones earning the money.  Once I was able to see that buying a seemingly necessary item for myself was the exact same thing as buying something that one of my children deemed necessary, it changed my ability to be a better partner for my kids.  When I buy something specifically for myself, I recognize it for what it is, it is a selfish act.  There isn&#39;t anything wrong with thinking of oneself or using money to buy something for yourself.  The difference is that a lot of parents do it automatically and dismiss completely something a child wants as selfish and unnecessary, ignoring the very fact that they have just done for themselves something that a child can&#39;t do.  Parents do that with food too, and that is why the food issue often is tied to money.<br/>\n<br/>\nThere is a part in the movie Matilda, where the mean aunt takes a piece of chocolate from the chocolate box and eats it in front of the little girl and says, &quot;much too good for children&quot;, while that girl is remembering how her own father would take a chocolate out of the box and split it in half to share it as a gift.  It&#39;s an attitude shift.  Parents can be greedy and selfish or they can share with an act of servitude and graciousness.  <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: allowances (was Re: [AlwaysLearning] Re: Mums and computers","postDate":"1311542965","msgId":61993,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA2MUE4NzlGLURFMjUtNDg2Ny04NjlFLUE4QTI0NjQ5RkNDNkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PENBTXVqbWR1cWFnY0JYeTM9emdqYTE5cERoZnhLNTAwaEZxUHhIelJmcXh6OXJNcXBPQUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PDE3NTc5OTgzLjEzMTE0MzI5NTc5NDguSmF2YU1haWwucm9vdEB3YW11aS1oYXppcmFuLmF0bC5zYS5lYXJ0aGxpbmsubmV0PiA8NkE5RUE3MjctRDMxQi00REZDLTk4QjctOTc2QzkxNzZBRUI1QFNhbmRyYWRvZGQuY29tPiA8Q0FNdWptZHVxYWdjQlh5Mz16Z2phMTlwRGhmeEs1MDBoRnFQeEh6UmZxeHo5ck1xcE9BQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":61992,"nextInTopic":61994,"prevInTime":61992,"nextInTime":61994,"topicId":61966,"numMessagesInTopic":0,"msgSnippet":"-=. It is their money and they may spend it any way that they want to, with the caveat that the purchase is legal of course.-=- Why do you need that caveat? No","messageBody":"<div id=\"ygrps-yiv-511068442\">-=. It is their money and they may<br/>\nspend it any way that they want to, with the caveat that the purchase is<br/>\nlegal of course.-=-<br/>\n<br/>\nWhy do you need that caveat?<br/>\nNo parents have the right to allow illegal purchases.<br/>\n<br/>\nUnschooling doesn&#39;t somehow give people a pass to ignore laws.<br/>\n<br/>\nAnd if you ask them to put half in savings because they don&#39;t have to pay rent, it might be better not to say it&#39;s their money and they can spend it any way they want to.  Except.  But.<br/>\n<br/>\n-=-We recently<br/>\nrealized that we may have to put a limit on that as my son is thinking about<br/>\ngetting a job outside of the house.-=-<br/>\n<br/>\nPlease proofread your posts before sending them to the list, and if a post contains &quot;have to,&quot; think about whether that can be rephrased.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: allowances (was Re: [AlwaysLearning] Re: Mums and computers","postDate":"1311542350","msgId":61992,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk2REIzMzQ0LTU2MEMtNDdBRi1CQzAwLTA4RDZDQ0JFOUY2OUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PENBTXVqbWRzRDZqRmh0K0haMXhNdUJ4b1pGN2pmV3dYelRqOGhwMWhrOGU2U05tPWpTQUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PDE3NTc5OTgzLjEzMTE0MzI5NTc5NDguSmF2YU1haWwucm9vdEB3YW11aS1oYXppcmFuLmF0bC5zYS5lYXJ0aGxpbmsubmV0PiA8Q0FNdWptZHNENmpGaHQrSFoxeE11QnhvWkY3amZXd1h6VGo4aHAxaGs4ZTZTTm09alNBQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":61990,"nextInTopic":61993,"prevInTime":61991,"nextInTime":61993,"topicId":61966,"numMessagesInTopic":0,"msgSnippet":"Don t put chores in quotation marks if they are real chores in the spirit of things that have to be done and aren t optional.   They re not so called","messageBody":"<div id=\"ygrps-yiv-582355385\">Don&#39;t put &quot;chores&quot; in quotation marks if they are real chores in the spirit of things that &quot;have to&quot; be done and aren&#39;t optional.   They&#39;re not &quot;so called chores&quot; then but regular old chores.<br/>\n<br/>\n-=-As far as &#39;chores&#39;, everyone is a part<br/>\nof the household and is expected to participate in maintaining the<br/>\nhousehold, we do not necessarily get paid for cleaning or cooking because<br/>\nthis is our home and we have to maintain it. It is not unheard of that<br/>\npeople get paid to do someone else&#39;s usual job. And as for jobs or chores,<br/>\nthe kids pick out what they want to do off of a list of things that need to<br/>\nbe done. I make the lists and provide guidance and reminders when needed.-=-<br/>\n<br/>\n&quot;Everyone is expected...&quot; is arbitrary and the expectation isn&#39;t naturally occurring.  YOU expect it, which means you decided and you enforce.<br/>\n<br/>\n-=-... because this is our home and we have to maintain it. -=-<br/>\n<br/>\n&quot;Have to&quot; is a fallacy.  <br/>\n&quot;I make them&quot; would be more honest.  Not nearer to understanding how children would learn about such things, but more honest.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/chores\">http://sandradodd.com/chores</a><br/>\n<br/>\nOf course no family &quot;has to&quot; read or do those things, but for the purpose of this list and the discussion of unschooling, I want to point out that there ARE other ways to see that, and that &quot;have to&quot; will put a plug in the flow of one&#39;s understanding of choices.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/haveto\">http://sandradodd.com/haveto</a><br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: allowances (was Re: [AlwaysLearning] Re: Mums and computers","postDate":"1311538089","msgId":61989,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk2RDA0OEU1LTM2MkItNDNFMC1CREUyLTAyNTNFM0FENTI0NEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PENBUENTNkFWZitXM0FCS3d2NFMtMl9IOXVSVVkzK0dEYmNTLW1pRmE3Snk4RjVGPTVRQUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PDIzNTc5NjI4LjEzMTE1MTEwMjgzNzYuSmF2YU1haWwucm9vdEB3YW11aS1qdW5pby5hdGwuc2EuZWFydGhsaW5rLm5ldD4gPENBUENTNkFWZitXM0FCS3d2NFMtMl9IOXVSVVkzK0dEYmNTLW1pRmE3Snk4RjVGPTVRQUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":61987,"nextInTopic":61990,"prevInTime":61988,"nextInTime":61990,"topicId":61966,"numMessagesInTopic":0,"msgSnippet":"-=-But in practice I don t like the nickel and diming or micromanagment of kids adults do just because they can. I don t think adults should risk homelessness","messageBody":"<div id=\"ygrps-yiv-1809988412\">-=-But in practice I don&#39;t like the nickel and diming or micromanagment<br/>\nof kids adults do just because they can. I don&#39;t think adults should<br/>\nrisk homelessness or malnourishment to furnish computers and amusement<br/>\npark outings; however, doling out money in a miserly fashion cuz they<br/>\ngotta learn doesn&#39;t really ring true as &quot;partnering&quot; with your child<br/>\nand sharing as much abundance as there is too be shared. Finances is<br/>\na big touchstone for many--not television, nor junkfood, nor computers<br/>\nnor sleep.-=-<br/>\n<br/>\nIn all the years I&#39;ve been writing with/to/for unschoolers, finances is miniature compared to television and food.  Sleep is smaller than television and bigger than money.<br/>\n<br/>\nI with you wouldn&#39;t say &quot;junkfood.&quot;  Everytime that name is spoken it makes it seem more legitimate, but the term itself is a problem.<br/>\n<br/>\n-=- I don&#39;t think adults should risk homelessness or malnourishment to furnish computers and amusement park outings; however,...-=-<br/>\n<br/>\nI&#39;ve never known anyone to recommend that someone risk homelessness nor to buy computers instead of food.<br/>\nI&#39;ve never known anyone to do it.  <br/>\nUsing that as a contrasting position in a discussion like this seems to me to be too extreme, and I don&#39;t want any newer readers thinking that any such recommendation or expectation has ever been on the table.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":287391473,"authorName":"hamsder clan","from":"hamsder clan &lt;hamsder@...&gt;","profile":"hamsder","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: allowances (was Re: [AlwaysLearning] Re: Mums and computers","postDate":"1311537815","msgId":61990,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBQ0NtVENnbVJYdlVWVlpIY3g1RTZoQ1lXaTM4ZEJIcWVhU0hGWGdfdGlPNUVWQUs3UUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGowaDNkMSs5ZWo4QGVHcm91cHMuY29tPg==","referencesHeader":"PDE3NTc5OTgzLjEzMTE0MzI5NTc5NDguSmF2YU1haWwucm9vdEB3YW11aS1oYXppcmFuLmF0bC5zYS5lYXJ0aGxpbmsubmV0Pgk8ajBoM2QxKzllajhAZUdyb3Vwcy5jb20+"},"prevInTopic":61989,"nextInTopic":61992,"prevInTime":61989,"nextInTime":61991,"topicId":61966,"numMessagesInTopic":0,"msgSnippet":"On Sun, Jul 24, 2011 at 5:32 AM, plaidpanties666 ... We recently started giving our kids (ages 4 and 6) an allowance, and one part of the reason is exactly","messageBody":"<div id=\"ygrps-yiv-954457771\">On Sun, Jul 24, 2011 at 5:32 AM, plaidpanties666<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:plaidpanties666@...\">plaidpanties666@...</a>&gt;wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; **<br/>\n&gt;<br/>\n&gt; If you&#39;re inclined to balk at certain purchases it can be helpful to give<br/>\n&gt; kids some money of their own - really their own, so they can make decisions<br/>\n&gt; without having to wade through your issues and baggage.<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>We recently started giving our kids (ages 4 and 6) an allowance, and one<br/>\npart of the reason is exactly what Meredith touched on here. I sometimes<br/>\nbalk at certain purchases and with an allowance the kids have recourse when<br/>\nI&#39;m mis-judging how important a purchase is to them relative to our<br/>\navailable funds. As a bit of a disclaimer, I want to say up front that we<br/>\nare lucky enough to have pretty generous available funds. :) On the other<br/>\nhand, my husband and I are both by nature somewhat stingy (fiscally<br/>\nconservative?) and that is something we&#39;ve had to work on in our early<br/>\nunschooling adventure.<br/>\n<br/>\nThe other reason we started giving them an allowance is because they asked<br/>\nus to. :)<br/>\n<br/>\nI have really enjoyed seeing how they spend their money-- it has given me<br/>\nlots of ideas for how I can be enriching their lives in ways that they will<br/>\nenjoy.<br/>\n<br/>\nAn example that took me completely by surprise involved hair cuts. My<br/>\ndaughter has always loved having her hair cut at a salon. I always washed<br/>\nher hair before we went so we didn&#39;t have to pay for a shampoo there. When<br/>\nwe first started doing allowances, the first thing my daughter said she<br/>\nwanted to save for was a shampoo the next time she got her hair cut. I had<br/>\nno idea she had been wishing for that so we have made the salon shampoo part<br/>\nof her regular routine.<br/>\n<br/>\nI&#39;ve found that the kids having their own money has made it easy to figure<br/>\nout what purchases are really important to them. I don&#39;t say no often, but<br/>\nif I do and they decide to use their own money it&#39;s a big ol&#39; sign to me<br/>\nthat it was important enough that I should have bought it in the first<br/>\nplace. In fact, my no often turns to a yes in those cases and their money<br/>\nusually gets spent on special purpose trips to a toy or craft store.<br/>\n<br/>\nOn a practical note, they each have a money purse that stays in the car.<br/>\nAfter one was lost (we think it was left near the car door and fell out when<br/>\nthe door was opened), they asked me to keep them in the glove compartment<br/>\nuntil they were ready to use them. I add money to their purses every week (I<br/>\nmark it on a calendar or I would forget) without mentioning it to them--<br/>\nthey&#39;re often pleasantly surprised to discover how much they have to spend<br/>\nwhen they&#39;re ready to make a purchase.<br/>\n<br/>\nThat&#39;s how allowances have worked out for our family-- it&#39;s been fun. :)<br/>\n<br/>\n--jenny (Larkin 6, Finn 4)<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":301108410,"authorName":"Marina DeLuca-Howard","from":"Marina DeLuca-Howard &lt;delucahoward@...&gt;","profile":"matedgirl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: allowances (was Re: [AlwaysLearning] Re: Mums and computers","postDate":"1311530964","msgId":61987,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBUENTNkFWZitXM0FCS3d2NFMtMl9IOXVSVVkzK0dEYmNTLW1pRmE3Snk4RjVGPTVRQUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDIzNTc5NjI4LjEzMTE1MTEwMjgzNzYuSmF2YU1haWwucm9vdEB3YW11aS1qdW5pby5hdGwuc2EuZWFydGhsaW5rLm5ldD4=","referencesHeader":"PDIzNTc5NjI4LjEzMTE1MTEwMjgzNzYuSmF2YU1haWwucm9vdEB3YW11aS1qdW5pby5hdGwuc2EuZWFydGhsaW5rLm5ldD4="},"prevInTopic":61986,"nextInTopic":61989,"prevInTime":61986,"nextInTime":61988,"topicId":61966,"numMessagesInTopic":0,"msgSnippet":"I don t know--parents are odd about finances in most families. Today Rowan and two of his friends went to the zoo.  I overheard his friend Zac say he had","messageBody":"<div id=\"ygrps-yiv-433297242\">I don&#39;t know--parents are odd about &quot;finances&quot; in most families.<br/>\nToday Rowan and two of his friends went to the zoo.  I overheard his<br/>\nfriend Zac say he had more money than he&#39;s ever carried--$50.00.  I<br/>\ncalled down to Rowan that my purse was in the hallway and to help<br/>\nhimself to some cash.  I think all he took was some change for the bus<br/>\nbecause I had 50 dollars in bills and it is still there.<br/>\n<br/>\n<br/>\nI checked because Martin wants to buy a yoyo and wanted some extra<br/>\ncash for other expenses.  Martin wants his own business.  We have a<br/>\nsmall garden and he is determined to sell our berries.  It hasn&#39;t<br/>\npanned out so far--though I bought some of the strawberries.  It<br/>\nwasn&#39;t him doing a chore for money.<br/>\n<br/>\nThe kids contribute their labour to household duties because they see<br/>\na need.  Martin is keen to compost fruit and put dishes in the<br/>\ndishwasher now because he wants to avoid fruit-flies and bugs.  He<br/>\ndoesn&#39;t like bugs and he has noticed during a heat-wave if you leave a<br/>\nplate next to you with watermelon rinds it gets covered in fruit-flies<br/>\nquickly.  They have all been putting things away to help out--not for<br/>\nmoney nor praise.<br/>\n<br/>\n I don&#39;t know how much money Rowan had on him, but he thought it was<br/>\nenough and with the freedom to take what he needed he took only some<br/>\nchange for the bus.  We aren&#39;t well off by any stretch and I&#39;m<br/>\nconstantly revamping our budget to find more money for the kids.  I do<br/>\nthis because I love them and I want them to be comfortable.  I don&#39;t<br/>\nfeel deprived because I don&#39;t buy into the &quot;treat&quot; yourself mindset or<br/>\nthat moms are martyrs who need spa visits and to pamper themselves to<br/>\nmake up for the joyless task of childrearing;)  My treat is a vase of<br/>\nflowers from our garden, some fresh seasonal fruit and coffee and<br/>\ndessert in my own kitchen tastes just as good:)<br/>\n<br/>\nI don&#39;t go on shopping splurges for clothes, but I try to look clean<br/>\nand presentable.  If I go to sales with my sil we wait for the big<br/>\nreductions.  Our aim is not to wear stained ripped worn out clothes<br/>\nbecause as homeschooling mothers people look at us and our kids<br/>\nclosely.  If the kids aren&#39;t always impeccably groomed then the moms<br/>\nshould be just to avoid the attention of child protection folks, but<br/>\nalso to live in the real world.<br/>\n<br/>\nWhen I was childless I looked very &quot;alternative&quot; and cool with clothes<br/>\nripped just so--now I look respectable and mom-like.  I use the tv<br/>\nsitcom moms as a guide because that&#39;s what the guy at the grocery<br/>\nstore see as &quot;normal&quot;--not the dysfunctional ones from reality shows<br/>\nof course:)  The tv moms are always well-groomed and funny articulate<br/>\npeople, but without wardrobe and scripts I just wing it:)<br/>\n<br/>\nThe other day a woman with cancer with her meds strapped to her<br/>\nstarted chatting with me about her four year old starting school. I<br/>\ngive off experienced mom vibes and have such perfect angels with me<br/>\nthat other moms looking for reassurance often start conversations;)  I<br/>\nnever told her I was a homeschooler, let alone an unschooler. The<br/>\nadvantage of summer is all the kids are loose!  She was telling me<br/>\nabout the trauma coming next September for her youngest child.<br/>\n<br/>\nI remarked that a need met in childhood gets extinguished and just<br/>\nthrough gentle prodding ended up with the discussion being there is no<br/>\nreason teachers or parents have to treat children like chattel to be<br/>\npicked up and bent to their will.  It was very subtle.  I mentioned I<br/>\nnever left my children crying in a kindergarten class and mused that I<br/>\nwouldn&#39;t leave my husband if he was alone and scared in a strange<br/>\nplace so why would I leave my kids who don&#39;t have the same coping<br/>\nskills as an adult yet.  My kids all tried kindergarten, though and I<br/>\nwas prepared to support their choices.  When they chose not to go I<br/>\nsupported that choice, when they wanted to sit in my lap outside the<br/>\nclassroom I supported that choice.  Some teachers think that&#39;s<br/>\n&quot;spoiling&quot; and they say so.  Maybe it was the cancer but suddenly the<br/>\nwoman who was anxious was talking about parental rights to protect the<br/>\nkids and how wrong the mean teachers are to rip crying children from<br/>\ntheir moms.<br/>\n<br/>\nShe and the others who drifted into the conversation were not ready<br/>\nfor protecting and treating the child&#39;s emotional needs as &quot;real&quot; or<br/>\ntheir autonomy as important.  But she was ready to think about the<br/>\npossibility that its in nobody&#39;s best interest to be mistreated and<br/>\nhave his or her feelings ignored or trivialized.<br/>\n<br/>\nIt was obvious that this was an acceptable practice--ripping kids from<br/>\ntheir mothers and she was echoing the teacher&#39;s sentiments &quot;its for<br/>\ntheir own good&quot; to be separated. By the end of the discussion she was<br/>\nquestioning everything and so was a mom in the same boat with a child<br/>\nstarting school next September.  This was her first child.  I stopped<br/>\nwhile I was ahead and we didn&#39;t get into more &quot;alternative&quot; parenting<br/>\nchildrearing ideas.  But speaking the lingo and looking the part of<br/>\nthe mainstream mother definitely helps me advocate for my kids and<br/>\nkids in general.<br/>\n<br/>\nBut in practice I don&#39;t like the nickel and diming or micromanagment<br/>\nof kids adults do just because they can.  I don&#39;t think adults should<br/>\nrisk homelessness or malnourishment to furnish computers and amusement<br/>\npark outings; however, doling out money in a miserly fashion cuz they<br/>\ngotta learn doesn&#39;t really ring true as &quot;partnering&quot; with your child<br/>\nand sharing as much abundance as there is too be shared.  Finances is<br/>\na big touchstone for many--not television, nor junkfood, nor computers<br/>\nnor sleep.<br/>\n<br/>\nMarina<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 24/07/2011, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:michmag5@...\">michmag5@...</a> &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:michmag5@...\">michmag5@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; -----Original Message-----<br/>\n&gt;&gt;From: plaidpanties666 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:plaidpanties666@...\">plaidpanties666@...</a>&gt;<br/>\n&gt;<br/>\n&gt;&gt;I&#39;ve paid Ray to do things I&#39;d hire someone to do. I&#39;ve paid when I&#39;ve had<br/>\n&gt;&gt; work to do at home (paying work, I mean) and can find a way for the kids<br/>\n&gt;&gt; to help. I&#39;ve been a subcontractor and think of kid-labor in those terms -<br/>\n&gt;&gt; they get a &quot;cut of the action&quot;. But it seems disingenuous to me to &quot;pay&quot;<br/>\n&gt;&gt; for extra work if I have extra money, rather than saying &quot;hey, there&#39;s<br/>\n&gt;&gt; extra in the budget this week!&quot; and figuring out how to spread it around.<br/>\n&gt;&gt; &lt;<br/>\n&gt;<br/>\n&gt; What&#39;s happening with George is that he&#39;s rejected my offers of paying for<br/>\n&gt; certain things, really wanting to earn the money himself.<br/>\n&gt;<br/>\n&gt; Michelle<br/>\n&gt;<br/>\n&gt; Wife to Bob<br/>\n&gt; Momma to George (13yo), Theo (9 1/2), Eli (6 3/4), and Ollie (closing in on<br/>\n&gt; 2yo!)<br/>\n&gt;<br/>\n&gt; If my life wasn&#39;t funny, it would just be true, and that&#39;s unacceptable.<br/>\n&gt;                                                             -- Carrie Fisher<br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n-- <br/>\n&quot;Insomnia is almost an oasis in which those who have to think or suffer<br/>\ndarkly take refuge.&quot; --Colette--<br/>\nRent our cottage:  <a rel=\"nofollow\" target=\"_blank\" href=\"http://davehoward.ca/cottage/\">http://davehoward.ca/cottage/</a> </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] allowances","postDate":"1311515608","msgId":61984,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQ1QTdBN0Y1LTkyNjktNEU0OC05RDEzLTY3RkM4MjM1RjY0NEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGowaDR1Nitva2IyQGVHcm91cHMuY29tPg==","referencesHeader":"PGowaDR1Nitva2IyQGVHcm91cHMuY29tPg=="},"prevInTopic":61983,"nextInTopic":61986,"prevInTime":61983,"nextInTime":61985,"topicId":61966,"numMessagesInTopic":0,"msgSnippet":"... I read it that way too initially. Actually the meaning she intended was: We have used the allowance plan we have [in order] to learn ... Which has other","messageBody":"<div id=\"ygrps-yiv-1897566957\">On Jul 24, 2011, at 8:58 AM, plaidpanties666 wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt;We have used the<br/>\n&gt; &gt; allowance plan that we have to learn about budgeting and saving,  <br/>\n&gt; and what<br/>\n&gt; &gt; money means in society.<br/>\n&gt;<br/>\n&gt; &quot;Have to learn&quot; is a good phrase to examine.<br/>\n<br/>\n </span></blockquote>I read it that way too initially. Actually the meaning she intended  <br/>\nwas: &quot;We have used the allowance plan we have [in order] to learn ...&quot;<br/>\n<br/>\nWhich has other issues that interfere with the smooth flow of  <br/>\nunschooling ;-)<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: allowances (was Re: [AlwaysLearning] Re: Mums and computers","postDate":"1311514531","msgId":61983,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhBMzExNDY5LUU1MEMtNDFENy05Q0Y1LTBFQkQwNUQzOTY0QkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PENBTXVqbWR1cWFnY0JYeTM9emdqYTE5cERoZnhLNTAwaEZxUHhIelJmcXh6OXJNcXBPQUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PDE3NTc5OTgzLjEzMTE0MzI5NTc5NDguSmF2YU1haWwucm9vdEB3YW11aS1oYXppcmFuLmF0bC5zYS5lYXJ0aGxpbmsubmV0PiA8NkE5RUE3MjctRDMxQi00REZDLTk4QjctOTc2QzkxNzZBRUI1QFNhbmRyYWRvZGQuY29tPiA8Q0FNdWptZHVxYWdjQlh5Mz16Z2phMTlwRGhmeEs1MDBoRnFQeEh6UmZxeHo5ck1xcE9BQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":61982,"nextInTopic":61984,"prevInTime":61982,"nextInTime":61984,"topicId":61966,"numMessagesInTopic":0,"msgSnippet":"While I can picture what you re doing as running smoothly for you and working for the goals you ve created, the problem with Here s what works for us type","messageBody":"<div id=\"ygrps-yiv-2084184146\">While I can picture what you&#39;re doing as running smoothly for you and  <br/>\nworking for the goals you&#39;ve created, the problem with &quot;Here&#39;s what  <br/>\nworks for us&quot; type ideas is that it&#39;s like the instructions of a  <br/>\nrecipe but without the ingredients. The instructions are the steps you  <br/>\ndo. The ingredients are your family: the personalities, culture and  <br/>\nskills you each have.<br/>\n<br/>\nThe instructions create an apple pie you like in your family because  <br/>\nyour personalities, culture and skills are apples, flour, butter and  <br/>\nsweet spices. If you hand those instructions to someone&#39;s whose family  <br/>\nis rice, tomatoes and beans it wont &quot;work&quot;, eg, won&#39;t create an apple  <br/>\npie.<br/>\n<br/>\n&quot;Work&quot; for this list is defined as nurturing great relationships with  <br/>\nthem (and between them and the world they live in), living and  <br/>\nlearning joyfully. And what the list tries to help people get a grasp  <br/>\nof is not the instructions for apple pies but the chemistry and  <br/>\nphysics that create the type of synergy this list focuses on, eg,  <br/>\nradical unschooling (as defined on this list) that &quot;works&quot; (as defined  <br/>\npreviously).<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; We have used the<br/>\n&gt; allowance plan that we have to learn about budgeting and saving, and  <br/>\n&gt; what<br/>\n&gt; money means in society.<br/>\n<br/>\n </span></blockquote>Two physics/chemistry ideas that help unschooling work:<br/>\n<br/>\nFirst, seeing the family as a collection of unique individuals with  <br/>\nunique wants and needs who occasionally have the same feelings and  <br/>\noutlook. You&#39;ve used &quot;we&quot; to mean both you and your husband and the  <br/>\nwhole family. You have referred to that &quot;we&quot; as having thoughts and  <br/>\nneeds.<br/>\n<br/>\nIn families with similar personalities it can be easy to fall into the  <br/>\ntrap of focusing on where you all overlap on tastes and goals. It&#39;s  <br/>\ngood to keep front and center the idea that the overlap is more of a  <br/>\nchance connection than a goal of unschooling. It&#39;s cool -- and  <br/>\nconvenient! :-) -- when people in the family have similar tastes. It  <br/>\nhelps unschooling flourish, though, when we recognize how seeing our  <br/>\nsimilarities can lock our focus too much onto our overlap and get in  <br/>\nthe way seeing each person as an individual with unique outlook,  <br/>\ninterests and goals.<br/>\n<br/>\nMaybe this helps: Carl, Kat and I love Buffy: The Vampire Slayer. My  <br/>\nhusband likes it for the humor and personalities. I like that too but  <br/>\nalso love the bigger story it all creates. So when &quot;we&quot; decide to  <br/>\nwatch Buffy he really means the 1st 3 seasons and I mean all 7. (Kat  <br/>\ncan go either way ;-) So when we get up to season 4 I need to keep in  <br/>\nmind that while the overlaps allows us to enjoy Buffy together, what  <br/>\nlies beneath that overlap is different and we do have differences that  <br/>\nneed respected to grow healthy relationships.<br/>\n<br/>\nSecond, for unschooling to work -- nurture relationships, learn  <br/>\njoyfully -- it helps to mentally shift away from what kids will learn  <br/>\nand, instead, think in terms of them experiencing a wide variety of  <br/>\nideas and *trusting* they will learn a variety of things. *What* kids  <br/>\nwill learn is not in our control. And it can lead to frustration if we  <br/>\nexpect them to learn certain ideas and they aren&#39;t showing they are.  <br/>\nTrust that kids are thinking beings. Trust that if an idea is a good  <br/>\none, kids *will* embrace it. But they have their own schedule. They  <br/>\nmay be exploring a totally different aspect of life and the &quot;lesson&quot;  <br/>\nyou want them to learn isn&#39;t important to them right now.<br/>\n<br/>\nTrust also that they are their own beings. It&#39;s unlikely they&#39;ll  <br/>\nembrace as adults all the ideas we think are good. But they&#39;re far  <br/>\nmore likely to have pleasant associations with our ideas if their  <br/>\nexperiences with them are positive and as having helped them reach  <br/>\ntheir own goals. They&#39;re more likely to reject ideas (in what seems  <br/>\nlike knee-jerk, thoughtless ways) that are imposed on them as lessons  <br/>\nthey need to learn just because they finally have the ability to  <br/>\nchoose and want to show in a very in your face way that they have the  <br/>\npower to make their own choices.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; We treat money in our family as one of the family<br/>\n&gt; resources and so everyone gets a share in the resources and  <br/>\n&gt; responsibilities<br/>\n&gt; of our little nuclear cooperative.<br/>\n<br/>\n </span></blockquote>Adult responsibilities and kid &quot;responsibilities&quot; are often treated as  <br/>\nthough they were the same but they aren&#39;t. And because kids see the  <br/>\ndifference that adults don&#39;t, adults get flabbergasted when they see  <br/>\nkids &quot;shirk their responsibilities&quot; when really kids are rejecting  <br/>\nchoices that aren&#39;t *to them* *yet* worth their time and energy.<br/>\n<br/>\nResponsibilities are what we&#39;ve chosen to take on. We decide for our  <br/>\nown selves what level of care we want to give those tasks. We make  <br/>\nthat determination based on what consequences we want from a task or  <br/>\nare willing to put up with.<br/>\n<br/>\nThe &quot;responsibilities&quot; that adults decide belong to kids have none of  <br/>\nthat. Kids don&#39;t get to decide whether they want the task or not.  <br/>\n(Choosing from a list of tasks isn&#39;t a true choice. Adults can choose  <br/>\n&quot;None of the above.&quot; Kids don&#39;t get that choice.) They don&#39;t get to  <br/>\ndetermine the level of care they want to give a task. They aren&#39;t  <br/>\nmaking decisions based on what they want to achieve or avoid for  <br/>\nthemselves or others. They have to do the task or suffer the adult- <br/>\nimposed consequences. And, unlike natural consequences, the adult- <br/>\nimposed ones get ramped up until the child does the task. (Or the  <br/>\nadult gives in ;-) Which is a choice for the adult! It&#39;s not about  <br/>\nresponsibilities at all. It&#39;s a battle over who has control over a  <br/>\nchunk of the child&#39;s time.)<br/>\n<br/>\nMany many people see responsibilities as &quot;have tos&quot; when really they  <br/>\nare &quot;choose tos because the other options have consequences I really  <br/>\nreally don&#39;t want.&quot; Even taking care of your children is not a have  <br/>\nto. It&#39;s hugely freeing when someone realizes she&#39;s *choosing* to care  <br/>\nfor her kids, (stay with a marriage, clean a toilet, pay bills, make  <br/>\ndinner from scratch) because she wants a, b, and c and really doesn&#39;t  <br/>\nwant x, y and z. And she&#39;s totally completely free to choose what  <br/>\nlevel of care she wants to give to each and what level of consequences  <br/>\nshe wants to put up with.<br/>\n<br/>\nSandra has a great collection of writings on the idea of &quot;have to&quot;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/haveto\">http://sandradodd.com/haveto</a><br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Each to his own ability and role.<br/>\n<br/>\n </span></blockquote>But who assigns the role?<br/>\n<br/>\nFor radical unschooling purposes, the child chooses the role they want  <br/>\nto play. Unschooling parents invite the kids into their world to play  <br/>\n(at various real world tasks and parents&#39; interests) while tailoring  <br/>\nit to the child&#39;s ability and interest since the adult&#39;s goal is for  <br/>\nthe child to enjoy being with the parent. But (to build the  <br/>\nrelationship) the child is allowed to say &quot;No, thanks! I&#39;ve got other  <br/>\n(important to me) things to do!&quot;<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Both of my children are pretty savvy consumers.<br/>\n<br/>\n </span></blockquote>As is my daughter without most of what you did in order (supposedly)  <br/>\nfor your kids to learn. Kat prefers to spend as little as possible on  <br/>\nan item because she wants to get the most out of her money. It&#39;s a  <br/>\npretty obvious idea and not something kids need to be taught! What  <br/>\nkids need from our greater storehouse of knowledge is exposure to the  <br/>\nvarious places where they can find what they want cheaply and the  <br/>\nfreedom to choose and make decisions. And that freedom includes  <br/>\nchoosing to pay full price when the pros outweigh the cons for the  <br/>\nchild.  (Like getting a video game or TV series on DVD someone has  <br/>\nbeen looking forward to that was just released.)<br/>\n<br/>\nThe goal is making thoughtful decisions, not learning to be  your  <br/>\ndefinition of savvy consumers, if you see the difference.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; As for spending their own money, the family adults only comment on a<br/>\n&gt; purchase if it seems that the quality or price is less than optimal<br/>\n<br/>\n<br/>\n </span></blockquote>It&#39;s not as useful for unschooling when stated as a rule.<br/>\n<br/>\nWhat&#39;s a more useful way of seeing this for unschooling is as sharing  <br/>\nour knowledge to help them get what they want while giving them ideas  <br/>\non how they could also achieve other goals they might find valuable.<br/>\n<br/>\nIf they don&#39;t feel the extra isn&#39;t adding much value to them, if they  <br/>\nfeel they can reject the information, if they feel the parent is  <br/>\nfocused on helping with the child&#39;s goal rather than focused on the  <br/>\nadult&#39;s goal of teaching them the right way to think about something,  <br/>\nthey&#39;re more likely to give thoughtful consideration to the information.<br/>\n<br/>\nIf it&#39;s a way of view that&#39;s imposed on them as how they need to think  <br/>\nabout something, they&#39;re more likely to reject it without thought just  <br/>\nto feel in control.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"allowances","postDate":"1311512326","msgId":61982,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGowaDR1Nitva2IyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBTXVqbWR1cWFnY0JYeTM9emdqYTE5cERoZnhLNTAwaEZxUHhIelJmcXh6OXJNcXBPQUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":61981,"nextInTopic":61983,"prevInTime":61981,"nextInTime":61983,"topicId":61966,"numMessagesInTopic":0,"msgSnippet":"... Have to learn is a good phrase to examine. It s rooted in the idea that people won t learn the *right* things on their own. When you step away from have","messageBody":"<div id=\"ygrps-yiv-306084950\">chris ester &lt;chris.homeschool@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;We have used the<br/>\n&gt; allowance plan that we have to learn about budgeting and saving, and what<br/>\n&gt; money means in society.<br/>\n<br/>\n </span></blockquote>&quot;Have to learn&quot; is a good phrase to examine. It&#39;s rooted in the idea that people won&#39;t learn the *right* things on their own. When you step away from have tos and clandestine teaching tools, kids still learn about the world. Kids given money freely, no strings attached, still learn about budgets and &quot;the value of money&quot;.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;they almost never ask for frivolous<br/>\n&gt; things<br/>\n<br/>\n </span></blockquote>What&#39;s a frivolous thing? It&#39;s something to think about, not necessarily answer here. Pegging some interests as frivolous devalues a person&#39;s feelings. It&#39;s a way of shutting someone down when he or she expresses joy in small, simple pleasures. There&#39;s cultural baggage and a surprising amount of internalized sexism in the idea of &quot;frivolous things&quot;. One of the very common complaints against unschooling as a philosophy is that it values frivolous things like joy over serious things like discipline. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; if it seems like a purchase that fits into our unschooling life or if<br/>\n&gt; it seems like a really good idea for the household, then the adults pay for<br/>\n&gt; it.<br/>\n<br/>\n </span></blockquote>But frivolous things like video games and lip-gloss Do, absolutely, fit into an unschooling life. So why not offer to buy those, too? Lovliness and enjoyment *are* valuable additions to a household. You&#39;re still thinking in terms of molding kids in a particular direction rather than supporting their interests with the understanding that learning Is happening. You aren&#39;t trusting your kids to grow into thoughtful, responsible people without weighing their choices for them. You&#39;re valuing a kind of right answer over the process of thoughtful decision making. <br/>\n<br/>\nAnd it seems like your kids have figured out how to give you the kind of answers you want. That&#39;s not a terrible thing, but you&#39;re describing a kind of teaching, of setting up &quot;life lessons&quot; rather than striving to be your kids&#39; partner in discovery. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":112891150,"authorName":"michmag5@earthlink.net","from":"michmag5@...","profile":"michelle_baum","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: allowances (was Re: [AlwaysLearning] Re: Mums and computers","postDate":"1311511028","msgId":61986,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIzNTc5NjI4LjEzMTE1MTEwMjgzNzYuSmF2YU1haWwucm9vdEB3YW11aS1qdW5pby5hdGwuc2EuZWFydGhsaW5rLm5ldD4="},"prevInTopic":61984,"nextInTopic":61987,"prevInTime":61985,"nextInTime":61987,"topicId":61966,"numMessagesInTopic":0,"msgSnippet":"... What s happening with George is that he s rejected my offers of paying for certain things, really wanting to earn the money himself. Michelle Wife to Bob ","messageBody":"<div id=\"ygrps-yiv-1460076526\">-----Original Message-----<br/>\n<blockquote><span title=\"ireply\"> &gt;From: plaidpanties666 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:plaidpanties666@...\">plaidpanties666@...</a>&gt;<br/>\n<br/>\n&gt;I&#39;ve paid Ray to do things I&#39;d hire someone to do. I&#39;ve paid when I&#39;ve had work to do at home (paying work, I mean) and can find a way for the kids to help. I&#39;ve been a subcontractor and think of kid-labor in those terms - they get a &quot;cut of the action&quot;. But it seems disingenuous to me to &quot;pay&quot; for extra work if I have extra money, rather than saying &quot;hey, there&#39;s extra in the budget this week!&quot; and figuring out how to spread it around. &lt;<br/>\n<br/>\n </span></blockquote>What&#39;s happening with George is that he&#39;s rejected my offers of paying for certain things, really wanting to earn the money himself. <br/>\n<br/>\nMichelle<br/>\n<br/>\nWife to Bob<br/>\nMomma to George (13yo), Theo (9 1/2), Eli (6 3/4), and Ollie (closing in on 2yo!)<br/>\n<br/>\nIf my life wasn&#39;t funny, it would just be true, and that&#39;s unacceptable.<br/>\n                                                            -- Carrie Fisher</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"allowances (was Re: [AlwaysLearning] Re: Mums and computers","postDate":"1311510753","msgId":61981,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGowaDNkMSs5ZWo4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE3NTc5OTgzLjEzMTE0MzI5NTc5NDguSmF2YU1haWwucm9vdEB3YW11aS1oYXppcmFuLmF0bC5zYS5lYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":61980,"nextInTopic":61982,"prevInTime":61980,"nextInTime":61982,"topicId":61966,"numMessagesInTopic":0,"msgSnippet":"... ******************** If you re inclined to balk at certain purchases it can be helpful to give kids some money of their own - really their own, so they can","messageBody":"<div id=\"ygrps-yiv-790576128\">michmag5@... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I&#39;d like to hear more about the role of an allowance at all...my kids have one from my dad, who just started giving them five bucks a week because he wanted to. Otherwise, we&#39;d just used our family money for everything. I do see them enjoying having their own money in their wallets, though, and thinking about what to buy and what not to buy. And my eldest is really finding satisfaction in earning money doing bigger jobs around here.<br/>\n </span></blockquote>********************<br/>\n<br/>\nIf you&#39;re inclined to balk at certain purchases it can be helpful to give kids some money of their own - really their own, so they can make decisions without having to wade through your issues and baggage. It can also be more convenient for kids to have money in their pockets, especially if they&#39;re able to go to the store on their own, or go with friends. But it can also work just to hand a child money going out the door, or leave a &quot;pot&quot; of spending money somewhere everyone can dip into at need. <br/>\n<br/>\nHow much to give depends a lot on the family budget - I personally know one unschooling family which allocates something like $2 a week to their tweens because that&#39;s how tight the family budget is and another which gives something closer to $30 a week. Kelly Lovejoy suggests giving kids enough that they can spend some and save some if they want, which has always made good sense to me, but my own budget is pretty slim. I divvy up whatever is left over after bills and sometimes allocate most of my own &quot;pocket money&quot; to buying something for the kids. I feel good when I buy for them. <br/>\n<br/>\nCurrently I work for a facet of the construction industry and my partner is self-employed so we don&#39;t have a terribly consistent income. That&#39;s not a good setup for a regular allowance so I try to be as tranparent as I can about the family finances without giving more information than the kids want. Mo, especially, doesn&#39;t want all the gory details of our finances, she wants to know how much is available to her. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;And my eldest is really finding satisfaction in earning money doing bigger jobs around here.<br/>\n </span></blockquote>****************<br/>\n<br/>\nI&#39;ve paid Ray to do things I&#39;d hire someone to do. I&#39;ve paid when I&#39;ve had work to do at home (paying work, I mean) and can find a way for the kids to help. I&#39;ve been a subcontractor and think of kid-labor in those terms - they get a &quot;cut of the action&quot;. But it seems disingenuous to me to &quot;pay&quot; for extra work if I have extra money, rather than saying &quot;hey, there&#39;s extra in the budget this week!&quot; and figuring out how to spread it around. It&#39;s not always a matter of dividing things up perfectly evenly, especially when we get a big chunk of money all at once. Then I tend to look at the big purchases on our various wish lists and go by that. So over the winter we chipped in to help Ray buy a car (he has a couple part-time jobs) while in the spring we got a new robotics program for Mo. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":231415297,"authorName":"chris ester","from":"chris ester &lt;chris.homeschool@...&gt;","profile":"chris_e_bear","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: allowances (was Re: [AlwaysLearning] Re: Mums and computers","postDate":"1311489551","msgId":61978,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBTXVqbWRzRDZqRmh0K0haMXhNdUJ4b1pGN2pmV3dYelRqOGhwMWhrOGU2U05tPWpTQUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDE3NTc5OTgzLjEzMTE0MzI5NTc5NDguSmF2YU1haWwucm9vdEB3YW11aS1oYXppcmFuLmF0bC5zYS5lYXJ0aGxpbmsubmV0Pg==","referencesHeader":"PDE3NTc5OTgzLjEzMTE0MzI5NTc5NDguSmF2YU1haWwucm9vdEB3YW11aS1oYXppcmFuLmF0bC5zYS5lYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":61974,"nextInTopic":61980,"prevInTime":61977,"nextInTime":61979,"topicId":61966,"numMessagesInTopic":0,"msgSnippet":"... and thinking about what to buy and what not to buy. And my eldest is really finding satisfaction in earning money doing bigger jobs around here. I d like","messageBody":"<div id=\"ygrps-yiv-72771357\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;I do see them enjoying having their own money in their wallets, though,<br/>\n </span></blockquote>and thinking about what to buy and what not to buy. And my eldest is really<br/>\nfinding satisfaction in earning money doing bigger jobs around here.<br/>\n<br/>\nI&#39;d like to hear it if anyone would share if you do allowances and how that<br/>\nplays out in your family.<br/>\n<br/>\nMichelle&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\nAs I have said elsewhere, everyone in our family gets an allowance as part<br/>\nof the family budget.  I get the household expense money in my allowance<br/>\nbecause I am the &quot;chief procurement officer&quot; (I buy the groceries and<br/>\neverything else), my husband gets a sum of money for lunches at work (when<br/>\nhe doesn&#39;t pack a lunch) and miscellaneous, our kids get a sum that is 3<br/>\ntimes their age every pay day (every two weeks) and are asked to save half<br/>\nof what they get (and my husband and I match their savings).  They have the<br/>\nopportunity to earn more money around the house for doing jobs above and<br/>\nbeyond their usual responsibilities.  As far as &#39;chores&#39;, everyone is a part<br/>\nof the household and is expected to participate in maintaining the<br/>\nhousehold, we do not necessarily get paid for cleaning or cooking because<br/>\nthis is our home and we have to maintain it.  It is not unheard of that<br/>\npeople get paid to do someone else&#39;s usual job.  And as for jobs or chores,<br/>\nthe kids pick out what they want to do off of a list of things that need to<br/>\nbe done.  I make the lists and provide guidance and reminders when needed.<br/>\n<br/>\nWe are a family full of absent minded people who are not particularly good<br/>\nat being organized.  Because of our own limitations around keeping track of<br/>\nthings, my husband and I both carry a purse.  He started carrying a purse<br/>\nwhen we were in college and he had lost his wallet for a third time in as<br/>\nmany months.  Now, many years later, his purse isn&#39;t organized but<br/>\neverything he needs is in there....<br/>\n<br/>\nBoth of our children, either through genetics or modeling (probably both),<br/>\nare also organizationally challenged.  My son is worse than my daughter, but<br/>\nwe (the family) decided that everyone would carry a purse.  Everyone has a<br/>\ncell phone, which was acquired using a good deal of the family&#39;s resources<br/>\nand so needs to be kept track of, not to mention money and other valuables<br/>\nthat go into the purse.   My son&#39;s purse is really more of a wallet on a<br/>\nstring that he chose with a little help for me, my daughter carries a big<br/>\npurse with lots of stuff in it.  Since an incident last year of a nearly<br/>\nlost allowance, I do not give out money (I am the family payroll clerk)<br/>\nunless they have their purse or wallet.  We have been working on everyone<br/>\nremembering their purse when we leave the house.  We also are working on<br/>\nthings going into the purse that belongs there.  Organizational skills are a<br/>\nbig part of our unschooling &quot;program&quot;--read;something that the entire family<br/>\nworks on almost all of the time.<br/>\n<br/>\nAs for money management and consumer skills; my kids (now 13 and 15) are<br/>\npretty consumer savvy and know how to shop online and in thrift shops and<br/>\nCraigslist, freecycle and the like.  I can often send them with a list to<br/>\nthe grocery store and they do a great job.  They both have a general savings<br/>\nthat is for the future as well as a savings for stuff that they want to get<br/>\nfor themselves.  Right now they do not have bank accounts, but they do each<br/>\nhave a investing account that we set up for them to put their savings into.<br/>\nThey have jars in their rooms to keep their savings in.  Both keep track of<br/>\ntheir money in a little notebook.  This was an idea that they had.  I helped<br/>\nthem set their budget books up.<br/>\nchris<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":231415297,"authorName":"chris ester","from":"chris ester &lt;chris.homeschool@...&gt;","profile":"chris_e_bear","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: allowances (was Re: [AlwaysLearning] Re: Mums and computers","postDate":"1311487094","msgId":61980,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBTXVqbWR1cWFnY0JYeTM9emdqYTE5cERoZnhLNTAwaEZxUHhIelJmcXh6OXJNcXBPQUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDZBOUVBNzI3LUQzMUItNERGQy05OEI3LTk3NkM5MTc2QUVCNUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDE3NTc5OTgzLjEzMTE0MzI5NTc5NDguSmF2YU1haWwucm9vdEB3YW11aS1oYXppcmFuLmF0bC5zYS5lYXJ0aGxpbmsubmV0Pgk8NkE5RUE3MjctRDMxQi00REZDLTk4QjctOTc2QzkxNzZBRUI1QFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":61978,"nextInTopic":61981,"prevInTime":61979,"nextInTime":61981,"topicId":61966,"numMessagesInTopic":0,"msgSnippet":"My children have received an allowance--just like my husband and I do, since they were old enough to ask for things in a store.  We have used the allowance","messageBody":"<div id=\"ygrps-yiv-1367892616\">My children have received an allowance--just like my husband and I do, since<br/>\nthey were old enough to ask for things in a store.  We have used the<br/>\nallowance plan that we have to learn about budgeting and saving, and what<br/>\nmoney means in society.  We treat money in our family as one of the family<br/>\nresources and so everyone gets a share in the resources and responsibilities<br/>\nof our little nuclear cooperative.  Each to his own ability and role.  The<br/>\nadults make most of the decisions, because of advanced experience and<br/>\ndevelopment, legal liability, and because they have the lion&#39;s share of the<br/>\nresponsibility.  Everyone gets a say and a vote on most things.  This<br/>\nincludes investing as well.  Both of my children are pretty savvy consumers.<br/>\n<br/>\nNeither of my children suffer from a shortage of stuff, but when we are in a<br/>\nstore doing the usual shopping, they almost never ask for frivolous<br/>\nthings--they buy what they want with their money.  They never &quot;beg&quot; or<br/>\ncomplain if they do ask and we don&#39;t have the money for whatever it is.  And<br/>\nyes, if it seems like a purchase that fits into our unschooling life or if<br/>\nit seems like a really good idea for the household, then the adults pay for<br/>\nit.<br/>\n<br/>\nThinking about this, I think that my children know that I am not just saying<br/>\nno to say no; we only have a finite amount of money in our budget and so we<br/>\nall have to thoroughly consider what we spend money on.  This applies to the<br/>\nentire family, not just children.<br/>\n<br/>\nAs for spending their own money, the family adults only comment on a<br/>\npurchase if it seems that the quality or price is less than optimal.  This<br/>\nis no less than we would do for any other adult.  Otherwise, I try to share<br/>\nin the joy that my kids get from whatever it is that they have purchased and<br/>\nkeep my misgivings to myself (another video game?  Sparkly lip gloss?!?!<br/>\n--thoughts that I have kept to myself).  It is their money and they may<br/>\nspend it any way that they want to, with the caveat that the purchase is<br/>\nlegal of course.<br/>\n<br/>\nThrough the years they have both learned to shop and compare prices and<br/>\nevaluate the quality and value of an item.  I really think that this is due<br/>\nin large part to their having spending power of their own.<br/>\n<br/>\nAs to savings, we ask our children to save 50% of any regular income, since<br/>\nthey do not have to pay rent or utilities, or any other actual living<br/>\nexpense.  Gift money of course is theirs to do with as they please. To<br/>\nencourage saving, my husband and I match what they save.  We recently<br/>\nrealized that we may have to put a limit on that as my son is thinking about<br/>\ngetting a job outside of the house.<br/>\n<br/>\nChris<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sat, Jul 23, 2011 at 11:35 AM, Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; wrote:<br/>\n<br/>\n&gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Some notes from prior discussions:<br/>\n&gt;<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/money\">http://sandradodd.com/money</a><br/>\n&gt;<br/>\n&gt; In some places, &quot;allowance&quot; is called &quot;pocket money.&quot; Are there other terms<br/>\n&gt; for a regular dispensing of some personal funds to children?<br/>\n&gt;<br/>\n&gt; We did it, but if they wanted something that seemed like an expense of our<br/>\n&gt; decision to unschool, I would buy it. The allowance was for things they<br/>\n&gt; didn&#39;t need to discuss with anyone.<br/>\n&gt;<br/>\n&gt; I&#39;ve seen some families &quot;give&quot; an allowance with all kinds of restrictions<br/>\n&gt; about what percentage must be saved or given to the church. I don&#39;t like<br/>\n&gt; that. The parents could have just put some savings somewhere for the child<br/>\n&gt; every week, and extra offering, and only give the child the amount that WAS<br/>\n&gt; actually his.<br/>\n&gt;<br/>\n&gt; Allowance shouldn&#39;t be a test a child can fail.<br/>\n&gt;<br/>\n&gt; Sandra<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":442033011,"authorName":"Gwen Montoya","from":"Gwen Montoya &lt;lifeisjustthis@...&gt;","profile":"willow_selene","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: allowances (was Re: [AlwaysLearning] Re: Mums and computers","postDate":"1311458526","msgId":61974,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBTWc9SHBkZj1EMThDclo5eFM5YnlXU1dSeUYxQWpPdTJ1VmlMeU9wSGtNdj1CTFA3Z0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDZBOUVBNzI3LUQzMUItNERGQy05OEI3LTk3NkM5MTc2QUVCNUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDE3NTc5OTgzLjEzMTE0MzI5NTc5NDguSmF2YU1haWwucm9vdEB3YW11aS1oYXppcmFuLmF0bC5zYS5lYXJ0aGxpbmsubmV0Pgk8NkE5RUE3MjctRDMxQi00REZDLTk4QjctOTc2QzkxNzZBRUI1QFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":61968,"nextInTopic":61978,"prevInTime":61973,"nextInTime":61975,"topicId":61966,"numMessagesInTopic":0,"msgSnippet":"This is similar to what I do also. We went to an art supply store this week to pick up tracing paper for my oldest. While we were there I found some other","messageBody":"<div id=\"ygrps-yiv-1741539022\">This is similar to what I do also.<br/>\n<br/>\nWe went to an art supply store this week to pick up tracing paper for my<br/>\noldest. While we were there I found some other paper (watercolor & spiral<br/>\nbound sketching paper). Megan (almost 10) wanted to use her allowance to buy<br/>\nthe tracing paper and I bought the other paper. Sometimes she&#39;s ok with me<br/>\nbuying it for her and sometimes she wants to use her money. And I almost<br/>\nalways cover the cost of what we find at the thrift store because it is just<br/>\na couple of dollars and I can usually cover that.<br/>\n<br/>\nIn the past she&#39;s bought DS games and other things that used up her entire<br/>\nallowance fairly quickly, but over the past couple of months she&#39;s buying<br/>\nsmaller things. She&#39;s tried subscriptions to several online games and has<br/>\ndiscontinued them. Sometimes they lasted months and sometimes only a month.<br/>\n<br/>\nMy youngest (five in October) gets an allowance also. Hers is much smaller,<br/>\nbut still enough to buy a new toy. Sometimes what she finds is a little more<br/>\nexpensive ($5 or so) than her allowance - so if I have the extra money I<br/>\nchip in so she has enough. Or if I know the place she wants to go, like<br/>\nBuild-a-Bear, is going to be way out of her price range I try to avoid it<br/>\nunless/until I know I have enough extra to make it a fun trip.<br/>\n<br/>\nWe&#39;ve also talked about finding things on freecycle or craigslist or amazon<br/>\nor half.com or the thrift store - all the places that can make their money<br/>\nstretch a little farther.<br/>\n<br/>\nMy husband and I recently separated so money may be a little tighter, but I<br/>\ntreat my kids&#39; allowances as bills that need to be paid (if money gets<br/>\nreally tight, I&#39;ll have to revisit that, but until then...that&#39;s how I see<br/>\nit)<br/>\n<br/>\nGwen<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sat, Jul 23, 2011 at 8:35 AM, Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; wrote:<br/>\n<br/>\n&gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; We did it, but if they wanted something that seemed like an expense of our<br/>\n&gt; decision to unschool, I would buy it. The allowance was for things they<br/>\n&gt; didn&#39;t need to discuss with anyone.<br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: allowances (was Re: [AlwaysLearning] Re: Mums and computers","postDate":"1311435630","msgId":61968,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI4NUQ0Qjc0LUZBNjUtNDk2Ny1CQTdFLTU1NDIwRDFBNDlCM0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDZBOUVBNzI3LUQzMUItNERGQy05OEI3LTk3NkM5MTc2QUVCNUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDE3NTc5OTgzLjEzMTE0MzI5NTc5NDguSmF2YU1haWwucm9vdEB3YW11aS1oYXppcmFuLmF0bC5zYS5lYXJ0aGxpbmsubmV0PiA8NkE5RUE3MjctRDMxQi00REZDLTk4QjctOTc2QzkxNzZBRUI1QFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":61967,"nextInTopic":61974,"prevInTime":61967,"nextInTime":61969,"topicId":61966,"numMessagesInTopic":0,"msgSnippet":"Oh wait!  that link was mostly my writing.  It links to the writings of many other unschoolers, on blogs, as part of a blog carnival about allowances (I","messageBody":"<div id=\"ygrps-yiv-1100450234\">Oh wait!  that link was mostly my writing.  It links to the writings of many other unschoolers, on blogs, as part of a blog carnival about allowances (I think).<br/>\n<br/>\nI can&#39;t vouch for all those but they&#39;ll all have ideas!<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: allowances (was Re: [AlwaysLearning] Re: Mums and computers","postDate":"1311435337","msgId":61967,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZBOUVBNzI3LUQzMUItNERGQy05OEI3LTk3NkM5MTc2QUVCNUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDE3NTc5OTgzLjEzMTE0MzI5NTc5NDguSmF2YU1haWwucm9vdEB3YW11aS1oYXppcmFuLmF0bC5zYS5lYXJ0aGxpbmsubmV0Pg==","referencesHeader":"PDE3NTc5OTgzLjEzMTE0MzI5NTc5NDguSmF2YU1haWwucm9vdEB3YW11aS1oYXppcmFuLmF0bC5zYS5lYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":61966,"nextInTopic":61968,"prevInTime":61966,"nextInTime":61968,"topicId":61966,"numMessagesInTopic":0,"msgSnippet":"Some notes from prior discussions: http://sandradodd.com/money In some places, allowance is called pocket money.  Are there other terms for a regular","messageBody":"<div id=\"ygrps-yiv-1548650078\">Some notes from prior discussions:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/money\">http://sandradodd.com/money</a><br/>\n<br/>\nIn some places, &quot;allowance&quot; is called &quot;pocket money.&quot;  Are there other terms for a regular dispensing of some personal funds to children?<br/>\n<br/>\nWe did it, but if they wanted something that seemed like an expense of our decision to unschool, I would buy it.  The allowance was for things they didn&#39;t need to discuss with anyone.<br/>\n<br/>\nI&#39;ve seen some families &quot;give&quot; an allowance with all kinds of restrictions about what percentage must be saved or given to the church.   I don&#39;t like that.  The parents could have just put some savings somewhere for the child every week,  and extra offering,  and only give the child the amount that WAS actually his.  <br/>\n<br/>\nAllowance shouldn&#39;t be a test a child can fail.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":112891150,"authorName":"michmag5@earthlink.net","from":"michmag5@...","profile":"michelle_baum","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"allowances (was Re: [AlwaysLearning] Re: Mums and computers","postDate":"1311432957","msgId":61966,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE3NTc5OTgzLjEzMTE0MzI5NTc5NDguSmF2YU1haWwucm9vdEB3YW11aS1oYXppcmFuLmF0bC5zYS5lYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":0,"nextInTopic":61967,"prevInTime":61965,"nextInTime":61967,"topicId":61966,"numMessagesInTopic":0,"msgSnippet":"... Just to clarify, I m not the original poster. I just wanted some more thoughts on the ideas around allowances and how we choose to allocate the money a","messageBody":"<div id=\"ygrps-yiv-392909623\">-----Original Message-----<br/>\n<blockquote><span title=\"ireply\"> &gt;From: plaidpanties666 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:plaidpanties666@...\">plaidpanties666@...</a>&gt;<br/>\n<br/>\n&gt;<br/>\n&gt;Probably on some level you were thinking that if your son spent the money, it would teach him something about responsibility, but teaching never guarantees learning. He could just as well learn that adults are selfish and avoid responsibility whenever possible. Fortunately, learning is rarely a &quot;once and for all&quot; thing and you&#39;ll have plenty of chances to be gracious and helpful and giving. <br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Just to clarify, I&#39;m not the original poster. I just wanted some more thoughts on the ideas around allowances and how we choose to allocate the money a family has.<br/>\n<br/>\nI think we do well getting our kids the things they want, even those things I have to get past my judgment about (Club Penguin membership, for example).  The longer I&#39;ve been reading this list, the more I&#39;ve been noticing those judgments and letting them go. They still pop up, but I&#39;m recognizing it.<br/>\n<br/>\nI appreciate the comments on this. It&#39;s really helping me to look deeper at my own behavior around money and seeing those places where I&#39;m not honoring their interests when it comes down to paying for things.<br/>\n<br/>\nI&#39;d like to hear more about the role of an allowance at all...my kids have one from my dad, who just started giving them five bucks a week because he wanted to. Otherwise, we&#39;d just used our family money for everything. I do see them enjoying having their own money in their wallets, though, and thinking about what to buy and what not to buy. And my eldest is really finding satisfaction in earning money doing bigger jobs around here.<br/>\n<br/>\nI&#39;d like to hear it if anyone would share if you do allowances and how that plays out in your family.<br/>\n<br/>\nMichelle<br/>\n<br/>\nWife to Bob<br/>\nMomma to George (13yo), Theo (9 1/2), Eli (6 3/4), and Ollie (closing in on 2yo!)<br/>\n<br/>\nIf my life wasn&#39;t funny, it would just be true, and that&#39;s unacceptable.<br/>\n                                                            -- Carrie Fisher</div>","specialLinks":[]}],"prevTopicId":62037,"nextTopicId":62116}}