{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":10,"messages":[{"userId":0,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","senderId":"NAmuBkjjTfDvpCkLMMk4dw4-5U90wBpL4wMlmowa65bkMhZUC9fu-gEMLzHQ4HudvwOah_AqqXtJ","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Nuttier Than A Bag Of Nuts At A Nut Festival","postDate":"1005056218","msgId":27439,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDljLjE1YzdhYmZhLjI5MTk0YWRhQGFvbC5jb20+"},"prevInTopic":27436,"nextInTopic":0,"prevInTime":27438,"nextInTime":27440,"topicId":27398,"numMessagesInTopic":0,"msgSnippet":" I think here again you re ... I think kids do. I also think lots of kids eventually learn not to.  Sometimes the teacher doesn t know the answer, or","messageBody":"<div id=\"ygrps-yiv-394733838\">&lt;&lt; &gt; I think here again you&#39;re<br/>\n<blockquote><span title=\"ireply\"> &gt; assuming kids aren&#39;t smart enough to ask &quot; why would anyone do this?&quot;<br/>\n<br/>\n </span></blockquote>I think kids do. I also think lots of kids eventually learn not to. &gt;&gt;<br/>\n<br/>\nSometimes the teacher doesn&#39;t know the answer, or it&#39;s too complicated, or <br/>\nthe other kids wouldn&#39;t be interested in it and so &quot;classroom order&quot; would be <br/>\ndisrupted.<br/>\n<br/>\nI was pretty stubborn  myself, but I remember lots of &quot;why?&quot;  or &quot;How do they <br/>\nknow this?&quot; and &quot;what&#39;s this good for?&quot; questions being answered with &quot;That <br/>\nwon&#39;t be on the test,&quot; and &quot;you&#39;ll cover that next year&quot; and &quot;that&#39;s just how <br/>\nit is.&quot;  If I were on the edge of discouragement, that could have taught me <br/>\nnot to ask.  <br/>\n<br/>\nAnd some families and schools have worse put-downs and insults for kids who <br/>\nare &quot;smart-alecky&quot; enough to question simple plain truth.   It&#39;s talking <br/>\nback, disobedience, disrespect, wasting the time of people more important <br/>\nthan they are, etc.  <br/>\n<br/>\n&lt;&lt; &gt; I think here again you&#39;re<br/>\n<blockquote><span title=\"ireply\"> &gt; assuming kids aren&#39;t smart enough to ask &quot; why would anyone do this?&quot;<br/>\n<br/>\n </span></blockquote>&lt;&lt;I think kids do. I also think lots of kids eventually learn not to. &gt;&gt;<br/>\n<br/>\nSome kids learn not to be smart.<br/>\n<br/>\nSome people say to them, &quot;Don&#39;t be a smart-mouth,&quot; or &quot;Don&#39;t get smart with <br/>\nme.&quot;<br/>\n<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n&quot;Everything counts.&quot;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://expage.com/SandraDoddArticles\">http://expage.com/SandraDoddArticles</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://expage.com/SandraDodd\">http://expage.com/SandraDodd</a></div>","specialLinks":[]},{"userId":0,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"avnhighsky","replyTo":"LIST","senderId":"VmLWHTrsqBW6X74_IDfA36lqr0qKX03zmtkoLj45lM2xVZbguoYMs_Dp5CTC8ns50HMfAHDsou8f7uHZ7--B5vKfzZZv5kmGUDk","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Nuttier Than A Bag Of Nuts At A Nut\tFestival","postDate":"1005051183","msgId":27436,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI4MEQ0NzVFLjIwMkYlZmV0dGVyb2xsQGVhcnRobGluay5uZXQ+","inReplyToHeader":"PDlhLjFjNDQ2N2MyLjI5MTgwMDcyQGFvbC5jb20+"},"prevInTopic":27435,"nextInTopic":27439,"prevInTime":27435,"nextInTime":27437,"topicId":27398,"numMessagesInTopic":0,"msgSnippet":"... No, doesn t match my experience. It s also possible that since you re drawn to fuzzier stuff, as literature is generally presented, and I m drawn to right","messageBody":"<div id=\"ygrps-yiv-1266138720\">on 11/5/01 9:47 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I have sometimes thought my own school experience might have been freakishly<br/>\n&gt; good, but we WERE taught more than one viewpoint.  We were told not everyone<br/>\n&gt; believes in evolution, and that not even all scientists consider it<br/>\n&gt; scientifically proven, so it&#39;s an ongoing investigation.  In math we were<br/>\n&gt; doing &quot;twelve&quot; in all its permutations, above and below.  (20-8, 8+4...)  And<br/>\n&gt; several of my teachers, but 7th grade math especially, went into other number<br/>\n&gt; systems and said base 10 was fairly arbitrary, except for people&#39;s fingers,<br/>\n&gt; but that base 12 was all around us too, in dozens and grosses and geometrical<br/>\n&gt; 60&#39;s and 180&#39;s.  And we used to goof with base 2, binary.  (I was pretty<br/>\n&gt; grumpy when I got put out of the 6th grade regional spelling bee for spelling<br/>\n&gt; &quot;woolly&quot; the Brit way, which was the way it was on my &quot;Animal Rummy&quot; deck of<br/>\n&gt; cards.)<br/>\n<br/>\n </span></blockquote>No, doesn&#39;t match my experience.<br/>\n<br/>\nIt&#39;s also possible that since you&#39;re drawn to fuzzier stuff, as literature<br/>\nis generally presented, and I&#39;m drawn to &quot;right answer&quot; stuff, as math and<br/>\nscience is generally presented, then perhaps the things from school that<br/>\nmade the most impression on each of us is what matched what we were looking<br/>\nfor. I do remember those types of things being presented, but my impression<br/>\nof how they were presented is more process oriented: do this, this always<br/>\nhappens. Did the fuzzier kid sitting in the same room come away with a<br/>\ntotally different impression? It would be interesting to know!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I read in an old Utne reader the other day about a letter that some<br/>\n&gt; environmentalists (Ralph Nader&#39;s name was on it, I think, for name<br/>\n&gt; recognition) which had gone (some years back) to thousands of churches<br/>\n&gt; offering them information on ecology in hopes that they would become more<br/>\n&gt; involved and teach the kids in their churches about it.  It was designed to<br/>\n&gt; support ecology with Biblical teachings.  They mentioned the creation and<br/>\n&gt; naming the creatures, and they mentioned Noah&#39;s Ark.   They were proud of the<br/>\n&gt; high number of positive responses, in the form of requests for the full info<br/>\n&gt; packet.<br/>\n<br/>\n </span></blockquote>There is a Green Christian (fundamentalist) movement I&#39;ve stumbled across<br/>\nevery once in a while. Christian environmentalism on Google turns up some<br/>\npro information. So environmentalism isn&#39;t just for pagan tree huggers<br/>\nanymore :-)<br/>\n<br/>\nJoyce <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":0,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"avnhighsky","replyTo":"LIST","senderId":"BuruXMO81ITAWsx8evtUGqJxJzRn5BjN3IC8mKiTSrvwSCaFVYarPuks-1KkSt4Xhw_46MOdIMJT0iDU_ox0s3rABtqy9cY3p1c","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Nuttier Than A Bag Of Nuts At A Nut\tFestival","postDate":"1005050258","msgId":27435,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI4MEQ0M0MxLjIwMkYlZmV0dGVyb2xsQGVhcnRobGluay5uZXQ+","inReplyToHeader":"PDIwMDExMTA1LjA0NTgwMi4tOTYxNTQ1LjAuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":27414,"nextInTopic":27436,"prevInTime":27434,"nextInTime":27436,"topicId":27398,"numMessagesInTopic":0,"msgSnippet":"... Because *they* are choosing to limit the information they take in or because *someone else* is choosing to limit it for them to just what they need to ","messageBody":"<div id=\"ygrps-yiv-1724419145\">on 11/5/01 6:55 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ddzimlew@...\">ddzimlew@...</a> at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ddzimlew@...\">ddzimlew@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Most adults vote on a single view point.  Most adults align themselves<br/>\n&gt; with a party and do not listen to, with any kind of open mind for growth<br/>\n&gt; or change, any other point of view.<br/>\n<br/>\n </span></blockquote>Because *they* are choosing to limit the information they take in or because<br/>\n*someone else* is choosing to limit it for them to &quot;just what they need to<br/>\nknow&quot;?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Young people deserve a little more credit.  There are certainly more than<br/>\n&gt; a few who will not stop asking &quot;why&quot;  and wondering how things might be<br/>\n&gt; changed for the better.  And in my personal experience, when we talk<br/>\n&gt; about ps kids,  those are usually the kids with the * liberal * ( acid<br/>\n&gt; rain )  school experience.<br/>\n<br/>\n </span></blockquote>As Sandra said, I was talking about the teachers and those who choose the<br/>\ntextbooks.<br/>\n<br/>\nIf someone is fed deliberately limited information, even if they ask the<br/>\nright questions, they&#39;re going to get a limited answer.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Some may not like it, but it&#39;s<br/>\n&gt; certainly not the best argument for not taking children seriously.<br/>\n<br/>\n </span></blockquote>What I take even more seriously is the concept that school is the place to<br/>\nbe fed the information one needs to know. (Obviously not a widely held<br/>\nconcept here! ;-) But we&#39;re discussing schooled kids and public school<br/>\nparents.) Parents -- and probably a lot of educators too -- treat school as<br/>\nif that were true. Kids come to believe it.<br/>\n<br/>\nI respect whatever opinion children come up with. They often (though by no<br/>\nmeans always) are operating on limited information that has wandered into<br/>\ntheir lives by chance. (Adults do too!) Just because an opinion is based on<br/>\nlimited information doesn&#39;t mean the thought that went into arriving at it<br/>\nis to be denigrated.<br/>\n<br/>\nBut it&#39;s a different thing when that information is *deliberately* limited<br/>\nby someone with special interests and presented as though it were complete.<br/>\n<br/>\nAnd, yes, I think it&#39;s a positive thing for the kids to be encouraged to<br/>\nwrite their congressional representative. From their point of view they have<br/>\nlooked fully at the issue, thought about it and come up with an opinion on<br/>\nit.<br/>\n<br/>\nFrom an objective point of view, the process of feeding kids a limited body<br/>\nof information from *any* special interest view point, leading them to a<br/>\npredetermined conclusion and then encouraging them to write based on that is<br/>\na power that could be exploited. *That&#39;s* what this guy is seeing.<br/>\n<br/>\nOf course, as Sandra pointed out, he&#39;s also seeing a point of view presented<br/>\nto the kids that is counter to and undermines his own so he&#39;s not objecting<br/>\non purely philosophical grounds as I&#39;m trying to do ;-) But I think if we<br/>\nperceive those we disagree with as operating purely from a selfish position<br/>\n(and we, of course, are purely objective and seeing both sides) then we are<br/>\ndestined to misunderstand and underestimate them. We will see them as myopic<br/>\nand ignorant of the real issues. (Though that is true of many people on both<br/>\nsides of any issue!)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Would it really be so incredibly horrible if we all remembered we are not<br/>\n&gt; the only creatures nor the last people who will try to live on this<br/>\n&gt; planet?  The other view point being, if we can all make a little money,<br/>\n&gt; we have the right to do anything?<br/>\n<br/>\n </span></blockquote>Actually I&#39;m not defending or opposing either the liberal or conservative<br/>\nview on the environment. I am defending being upset because someone<br/>\nperceives that there is a single point of view being fed to all the children<br/>\nin the state.<br/>\n<br/>\nOf course *his* solution isn&#39;t to give the kids more points of view but to<br/>\neliminate the idea he disagrees with which would allow the prevailing<br/>\nattitude in Texas to continue.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I think here again you&#39;re<br/>\n&gt; assuming kids aren&#39;t smart enough to ask &quot; why would anyone do this?&quot;<br/>\n<br/>\n </span></blockquote>I think kids do. I also think lots of kids eventually learn not to. It isn&#39;t<br/>\ncool to show interest. Too many instances of questions set aside (We&#39;ll get<br/>\nto that later, We can talk about that after class if you like, I meant<br/>\nquestions about the topic, There&#39;s some really good books in the library if<br/>\nyou want to persue that further and so on.)<br/>\n<br/>\nAnyone who realizes that process and can gain access to the power to control<br/>\nit, can exploit it for their own interests. Having one group of people<br/>\ndecide what all the kids in the state (and I think it&#39;s also true in<br/>\nCalifornia?) will learn is an incredible power. From a liberal point of<br/>\nview, having the kids learn about acid rain is giving them the complete<br/>\npicture. From a conservative point of view it isn&#39;t.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; And you may be assuming a science teacher wouldn&#39;t say,  &quot; why, do you<br/>\n&gt; think &quot;<br/>\n<br/>\n </span></blockquote>I think lots of teachers would love to do this. I also think that time<br/>\npressures to get through a set amount of material in a limited period of<br/>\ntime don&#39;t allow them the time for questions that could pull the focus off<br/>\ntopic.<br/>\n<br/>\nIn an ideal world, schools would be places of exchanging ideas, where<br/>\nteachers and students could talk about anything from all points of view, go<br/>\nin any direction that fired their imaginations. But schools are assembly<br/>\nlines. They&#39;re designed to get kids from point A to point Z. If point F is<br/>\nmore of a fuzzy area it still needs treated as a point.<br/>\n<br/>\nAnd that design allows anyone with the power to decide what gets taught to<br/>\nhave their viewpoint as just another point to pass through.<br/>\n<br/>\nMaybe a good example of fuzzy areas being treated as points is science<br/>\ntreated as mechanical processes, causes and effects. Vinegar + baking soda<br/>\nyield carbon dioxide. It&#39;s treated abstractly like math problems. If you do<br/>\nthis, that happens. But real science *does* impact life in numerous ways.<br/>\nIt&#39;s perhaps a trivial example but every time the experiment is done, the<br/>\nCO2 level rises, the processes that brought the vinegar and baking soda to<br/>\nyour kitchen have impacted the environment and economy in a variety of ways,<br/>\nand the end result needs disposed of and will impact the environment. If we<br/>\nhad to think about all that everytime we did anything, we&#39;d never get<br/>\nanything done, of course ;-) But because that *type* of global thinking,<br/>\nless trivial of course ;-) isn&#39;t integrated into the teaching of science, it<br/>\nisn&#39;t a part of the thinking of science.<br/>\n<br/>\nScience isn&#39;t just about finding solutions to problems that exist. The<br/>\nresults and practice of science itself have impacts. The thinking about what<br/>\nthe impact is isn&#39;t integrated into sciecne teaching. If it gets discussed,<br/>\nit&#39;s a separate course in college. And if it&#39;s separate in teaching, it<br/>\nwon&#39;t get integrated in practice.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It happens all the time.  Kids here have been taking hunter safety<br/>\n&gt; courses, which teach them about the constitutionality of owning guns.<br/>\n&gt; The timber industry has &quot; forest stewardship&quot;   classes at the schools, a<br/>\n&gt; whole weeks worth,  where they show videos of the wonderful things the<br/>\n&gt; timber industry does for the world.  The cattleman&#39;s associations has<br/>\n&gt; their turn,  they get two days a year to convince little kids killing<br/>\n&gt; stuff is their great American right, and their duty to the world.<br/>\n<br/>\n </span></blockquote>Those are all special interest groups and it&#39;s a useful skill for kids to be<br/>\nable to perceive the bias behind the information.<br/>\n<br/>\nWhich is the point. Schools are *percieved* as places where the information<br/>\nbeing fed to kids is unbiased. I think the overall prevailing atmosphere for<br/>\nthe kids learning is that they don&#39;t need to question what they&#39;re being<br/>\ntold. I think what schools provide is a rough structure of what there is to<br/>\nknow but it gets perceived as the full picture. Not because kids are too<br/>\ndumb, but because of the atmosphere of &quot;do what we tell you to do and we&#39;ll<br/>\nget you where you need to go&quot; that kids (and parents) absorb that message.<br/>\n<br/>\nYou can tell kids numerous times they should question everything but if the<br/>\nwhole atmosphere is structured otherwise, actions do speak louder than<br/>\nwords.<br/>\n<br/>\nJoyce <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":0,"authorName":"ddzimlew@juno.com","from":"ddzimlew@...","profile":"mom2zimmy","replyTo":"LIST","senderId":"yqLT-MCL_R98lYuLs7rDajA7KKR0J0Ty-VjVwYMJS_T2mrx78ArnH9gBUXS7Dxkfqqd8zIp1nFQ","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Nuttier Than A Bag Of Nuts At A Nut Festival","postDate":"1004975005","msgId":27414,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDExMTA1LjA4NTE1MS4tOTU3MTQ5LjAuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":27413,"nextInTopic":27435,"prevInTime":27413,"nextInTime":27415,"topicId":27398,"numMessagesInTopic":0,"msgSnippet":"... Yes, I got that.   The implication seemed --- since the system wasn t designed for these things, they would not happen.   Don t forget the very important","messageBody":"<div id=\"ygrps-yiv-596765879\"><blockquote><span title=\"ireply\">&gt; She wasn&#39;t referring to young people, but to the schools and their <br/>\n&gt; textbooks.<br/>\n<br/>\n </span></blockquote>Yes, I got that.   The implication seemed --- since the system wasn&#39;t<br/>\ndesigned for these things, they would not happen.   Don&#39;t forget the very<br/>\nimportant factor of the kids, that&#39;s all.<br/>\n<br/>\nDeb L</div>","specialLinks":[]},{"userId":0,"authorName":"Lynda","from":"&quot;Lynda&quot; &lt;lurine@...&gt;","profile":"anoydami","replyTo":"LIST","senderId":"iJHcSBHbG9nFRQP5IRTQmsmIqlS083U2GuepJAEb1TX09lq7l2Kx0GkuLMrT29o7UDlVyueAj-G8cnC3Qmn5tIfmTA","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Nuttier Than A Bag Of Nuts At A Nut Festival","postDate":"1004974409","msgId":27413,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNzgwMWMxNjYwZiQ4NTc1OGE2MCQzMTVkZDFkMUBqaWRhMzU+","referencesHeader":"PDIwMDExMTA1LjA0NTgwMi4tOTYxNTQ1LjAuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":27410,"nextInTopic":27414,"prevInTime":27412,"nextInTime":27414,"topicId":27398,"numMessagesInTopic":0,"msgSnippet":"No, but the most polluted city in the world might stand a chance of being cleaned up  Lynda ... From:  To:","messageBody":"<div id=\"ygrps-yiv-1106609633\">No, but the most polluted city in the world might stand a chance of being<br/>\ncleaned up &lt;g&gt;<br/>\n<br/>\nLynda<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message -----<br/>\nFrom: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ddzimlew@...\">ddzimlew@...</a>&gt;<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a>&gt;<br/>\nSent: Monday, November 05, 2001 3:55 AM<br/>\nSubject: Re: [Unschooling-dotcom] Nuttier Than A Bag Of Nuts At A Nut<br/>\nFestival<br/>\n<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &gt; As for the kids not being qualified, he has a point. Are the kids<br/>\n&gt; &gt; being<br/>\n&gt; &gt; presented with opposing viewpoints on environmental issues so they<br/>\n&gt; &gt; can<br/>\n&gt; &gt; decide for themselves or are they being fed a single viewpoint?<br/>\n&gt;<br/>\n&gt; Most adults vote on a single view point.  Most adults align themselves<br/>\n&gt; with a party and do not listen to, with any kind of open mind for growth<br/>\n&gt; or change, any other point of view.  Some may not like it, but it&#39;s<br/>\n&gt; certainly not the best argument for not taking children seriously.<br/>\n&gt;<br/>\n&gt; Would it really be so incredibly horrible if we all remembered we are not<br/>\n&gt; the only creatures nor the last people who will try to live on this<br/>\n&gt; planet?  The other view point being, if we can all make a little money,<br/>\n&gt; we have the right to do anything?<br/>\n&gt;<br/>\n&gt; &gt; To someone who feels environmentalism is too obvious to be<br/>\n&gt; &gt; questioned,<br/>\n&gt; &gt; presenting kids with the causes of acid rain and the effects of acid<br/>\n&gt; &gt; rain<br/>\n&gt; &gt; would seem to be giving them a complete picture. Since it&#39;s a science<br/>\n&gt; class they can&#39;t discuss the economic<br/>\n&gt; &gt; or<br/>\n&gt; &gt; political aspects of the issue. Those must be confined to separate<br/>\n&gt; &gt; classes.)<br/>\n&gt;<br/>\n&gt; If someone was pouring poison in your backyard would you stop to consider<br/>\n&gt; their economic or political perspective?  I think here again you&#39;re<br/>\n&gt; assuming kids aren&#39;t smart enough to ask &quot; why would anyone do this?&quot;<br/>\n&gt; And you may be assuming a science teacher wouldn&#39;t say,  &quot; why, do you<br/>\n&gt; think &quot;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &gt; But if the kids were being presented with an obvious conservative<br/>\n&gt; &gt; point in<br/>\n&gt; &gt; government class, such as gun ownership is a constitutionally<br/>\n&gt; &gt; mandated right<br/>\n&gt; &gt; clearly stated in the second amendment, and it was suggested they<br/>\n&gt; &gt; all write<br/>\n&gt; &gt; to their congressional representative about preserving that right, I<br/>\n&gt; &gt; suspect<br/>\n&gt; &gt; liberals would find it appalling.<br/>\n&gt;<br/>\n&gt; It happens all the time.  Kids here have been taking hunter safety<br/>\n&gt; courses, which teach them about the constitutionality of owning guns.<br/>\n&gt; The timber industry has &quot; forest stewardship&quot;   classes at the schools, a<br/>\n&gt; whole weeks worth,  where they show videos of the wonderful things the<br/>\n&gt; timber industry does for the world.  The cattleman&#39;s associations has<br/>\n&gt; their turn,  they get two days a year to convince little kids killing<br/>\n&gt; stuff is their great American right, and their duty to the world.   And<br/>\n&gt; the character building classes that<br/>\n&gt; are taught by the local ( Christian ) church hot shots.  Yeah, it would<br/>\n&gt; be absolutely unfair if they heard about acid rain<br/>\n&gt; .<br/>\n&gt; &gt; But anytime kids are fed a single viewpoint it&#39;s scary.<br/>\n&gt;<br/>\n&gt;  I agree.<br/>\n&gt;<br/>\n&gt; &gt;They<br/>\n&gt; &gt; weren&#39;t designed to teach kids how to think, how to weigh issues,<br/>\n&gt; &gt; how to<br/>\n&gt; &gt; come to their own conclusions.<br/>\n&gt;<br/>\n&gt; Young people deserve a little more credit.  There are certainly more than<br/>\n&gt; a few who will not stop asking &quot;why&quot;  and wondering how things might be<br/>\n&gt; changed for the better.  And in my personal experience, when we talk<br/>\n&gt; about ps kids,  those are usually the kids with the * liberal * ( acid<br/>\n&gt; rain )  school experience.<br/>\n&gt;<br/>\n&gt; Around here we&#39;re growing plenty of the chop it down, kill it, make a<br/>\n&gt; buck, go to church,  kind.  If a couple of the acid rain kind came out of<br/>\n&gt; Texas, I don&#39;t think the universe would be thrown into turmoil.<br/>\n&gt;<br/>\n&gt; Deb L<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Message boards, timely articles, a free newsletter and more!<br/>\n&gt; Check it all out at: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n&gt;<br/>\n&gt; To unsubscribe, set preferences, or read archives:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.egroups.com/group/Unschooling-dotcom\">http://www.egroups.com/group/Unschooling-dotcom</a><br/>\n&gt;<br/>\n&gt; Another great list sponsored by Home Education Magazine!<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com\">http://www.home-ed-magazine.com</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Your use of Yahoo! Groups is subject to <a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a><br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":0,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","senderId":"MLkOSCpGjAZn81iQ0vCxCAlXEXZUduhITKqb4Dw9xC-2LWJmg5ODbyOg7WCDMpq3dUOHLa8Jhi52","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Nuttier Than A Bag Of Nuts At A Nut Festival","postDate":"1004971736","msgId":27410,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYuMWU5Y2FlYzIuMjkxODAwZDhAYW9sLmNvbT4="},"prevInTopic":27409,"nextInTopic":27413,"prevInTime":27409,"nextInTime":27411,"topicId":27398,"numMessagesInTopic":0,"msgSnippet":"In a message dated 11/5/01 5:08:33 AM, ddzimlew@juno.com writes: They ... Young people deserve a little more credit.  There are certainly more than a few","messageBody":"<div id=\"ygrps-yiv-1219836644\">In a message dated 11/5/01 5:08:33 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ddzimlew@...\">ddzimlew@...</a> writes:<br/>\n<br/>\n&lt;&lt; &gt;They<br/>\n<blockquote><span title=\"ireply\"> &gt; weren&#39;t designed to teach kids how to think, how to weigh issues, <br/>\n&gt; how to<br/>\n&gt; come to their own conclusions. <br/>\n<br/>\n </span></blockquote>Young people deserve a little more credit.  There are certainly more than<br/>\na few who will not stop asking &quot;why&quot;  and wondering how things might be<br/>\nchanged for the better. &gt;&gt;<br/>\n<br/>\nShe wasn&#39;t referring to young people, but to the schools and their textbooks.<br/>\n<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n&quot;Everything counts.&quot;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://expage.com/SandraDoddArticles\">http://expage.com/SandraDoddArticles</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://expage.com/SandraDodd\">http://expage.com/SandraDodd</a></div>","specialLinks":[]},{"userId":0,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","senderId":"Ty3hsKnRpNUMJutPKBbrgtMBk-CZJ5yHcagx_4oQd9IRGDf9nqWXxjAynr0xnk3ompMU-J0HwGQB","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Nuttier Than A Bag Of Nuts At A Nut Festival","postDate":"1004971634","msgId":27409,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlhLjFjNDQ2N2MyLjI5MTgwMDcyQGFvbC5jb20+"},"prevInTopic":27407,"nextInTopic":27410,"prevInTime":27408,"nextInTime":27410,"topicId":27398,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1068037457\">&lt;&lt; But anytime kids are fed a single viewpoint it&#39;s scary. Unfortunately<br/>\nschools weren&#39;t designed to offer information with more than one view point.<br/>\nHow many viewpoints can their be to 5+12 and here&#39;s how to spell &quot;cat&quot;? They<br/>\nweren&#39;t designed to teach kids how to think, how to weigh issues, how to<br/>\ncome to their own conclusions. &gt;&gt;<br/>\n<br/>\nI have sometimes thought my own school experience might have been freakishly <br/>\ngood, but we WERE taught more than one viewpoint.  We were told not everyone <br/>\nbelieves in evolution, and that not even all scientists consider it <br/>\nscientifically proven, so it&#39;s an ongoing investigation.  In math we were <br/>\ndoing &quot;twelve&quot; in all its permutations, above and below.  (20-8, 8+4...)  And <br/>\nseveral of my teachers, but 7th grade math especially, went into other number <br/>\nsystems and said base 10 was fairly arbitrary, except for people&#39;s fingers, <br/>\nbut that base 12 was all around us too, in dozens and grosses and geometrical <br/>\n60&#39;s and 180&#39;s.  And we used to goof with base 2, binary.  (I was pretty <br/>\ngrumpy when I got put out of the 6th grade regional spelling bee for spelling <br/>\n&quot;woolly&quot; the Brit way, which was the way it was on my &quot;Animal Rummy&quot; deck of <br/>\ncards.)<br/>\n<br/>\nI do understand the objection, though--both Joyce&#39;s and the Texas dad&#39;s.  <br/>\nBaptist families invest a lot in telling their kids what simply IS and they <br/>\ndon&#39;t want to have to fight over homework and teachers&#39; assignements and <br/>\ntextbooks which tell other ways.  <br/>\n<br/>\nI read in an old Utne reader the other day about a letter that some <br/>\nenvironmentalists (Ralph Nader&#39;s name was on it, I think, for name <br/>\nrecognition) which had gone (some years back) to thousands of churches <br/>\noffering them information on ecology in hopes that they would become more <br/>\ninvolved and teach the kids in their churches about it.  It was designed to <br/>\nsupport ecology with Biblical teachings.  They mentioned the creation and <br/>\nnaming the creatures, and they mentioned Noah&#39;s Ark.   They were proud of the <br/>\nhigh number of positive responses, in the form of requests for the full info <br/>\npacket.<br/>\n<br/>\nI know the Baptist point of view on those.  For one thing they would want <br/>\nNOTHING of liberal, non-Baptist interpretation of any Biblical texts.  And <br/>\nboth those stories are used to teach man&#39;s supremecy over animals.  Animals <br/>\nare NOT respected on the same level with humans.  Man is in God&#39;s image; <br/>\nanimals are for man to use (God told Adam).  And the point of the flood was <br/>\nthat Noah&#39;s family would re-people the earth and use the animals God had <br/>\narranged for them to save, and never would God destroy the world by water <br/>\nagain which is the promise of the rainbow.   When Jesus comes again and the <br/>\nworld is destroyed, it will be by fire.<br/>\n<br/>\nSo the conclusion of all that is that to care about the physical state of the <br/>\nworld shows a lack of faith in God.  It&#39;s God&#39;s world, God is all-powerful <br/>\nand his will prevails.  It is the job of people (i.e. Baptists and other <br/>\nright-thinking people) to bring more souls to Jesus in preparation for the <br/>\ntime that Jesus will take them straight to heaven.   This planet is temporary <br/>\nand expendable, and animals aren&#39;t going to heaven.<br/>\n<br/>\nTo spend time and money on the &quot;theory&quot; that the world is old and will be <br/>\nhere after we&#39;re going is tantamount to blasphemy.<br/>\n<br/>\nFor the benefit of people new to this list, I don&#39;t personally believe this, <br/>\nbut I have relatives who do, and Texas is a BIG place with lots of people, <br/>\nmaybe half or more of whom feel that way.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":0,"authorName":"ddzimlew@juno.com","from":"ddzimlew@...","profile":"mom2zimmy","replyTo":"LIST","senderId":"rP2lrIClzYNQ0g3rTzh27rKlWpPEe-_cEnoDggVWfOCisbwQi1oWO32-UrMCbU3QqCcdqkMr6jc","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Nuttier Than A Bag Of Nuts At A Nut Festival","postDate":"1004961326","msgId":27407,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDExMTA1LjA0NTgwMi4tOTYxNTQ1LjAuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":27406,"nextInTopic":27409,"prevInTime":27406,"nextInTime":27408,"topicId":27398,"numMessagesInTopic":0,"msgSnippet":"... Most adults vote on a single view point.  Most adults align themselves with a party and do not listen to, with any kind of open mind for growth or change,","messageBody":"<div id=\"ygrps-yiv-1547712611\"><blockquote><span title=\"ireply\">&gt; As for the kids not being qualified, he has a point. Are the kids <br/>\n&gt; being<br/>\n&gt; presented with opposing viewpoints on environmental issues so they <br/>\n&gt; can<br/>\n&gt; decide for themselves or are they being fed a single viewpoint?<br/>\n<br/>\n </span></blockquote>Most adults vote on a single view point.  Most adults align themselves<br/>\nwith a party and do not listen to, with any kind of open mind for growth<br/>\nor change, any other point of view.  Some may not like it, but it&#39;s<br/>\ncertainly not the best argument for not taking children seriously.<br/>\n<br/>\nWould it really be so incredibly horrible if we all remembered we are not<br/>\nthe only creatures nor the last people who will try to live on this<br/>\nplanet?  The other view point being, if we can all make a little money,<br/>\nwe have the right to do anything?  <br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; To someone who feels environmentalism is too obvious to be <br/>\n&gt; questioned,<br/>\n&gt; presenting kids with the causes of acid rain and the effects of acid <br/>\n&gt; rain<br/>\n&gt; would seem to be giving them a complete picture. Since it&#39;s a science<br/>\n </span></blockquote>class they can&#39;t discuss the economic <br/>\n<blockquote><span title=\"ireply\"> &gt; or<br/>\n&gt; political aspects of the issue. Those must be confined to separate <br/>\n&gt; classes.)<br/>\n<br/>\n </span></blockquote>If someone was pouring poison in your backyard would you stop to consider<br/>\ntheir economic or political perspective?  I think here again you&#39;re<br/>\nassuming kids aren&#39;t smart enough to ask &quot; why would anyone do this?&quot; <br/>\nAnd you may be assuming a science teacher wouldn&#39;t say,  &quot; why, do you<br/>\nthink &quot;  <br/>\n<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; But if the kids were being presented with an obvious conservative <br/>\n&gt; point in<br/>\n&gt; government class, such as gun ownership is a constitutionally <br/>\n&gt; mandated right<br/>\n&gt; clearly stated in the second amendment, and it was suggested they <br/>\n&gt; all write<br/>\n&gt; to their congressional representative about preserving that right, I <br/>\n&gt; suspect<br/>\n&gt; liberals would find it appalling.<br/>\n<br/>\n </span></blockquote>It happens all the time.  Kids here have been taking hunter safety<br/>\ncourses, which teach them about the constitutionality of owning guns. <br/>\nThe timber industry has &quot; forest stewardship&quot;   classes at the schools, a<br/>\nwhole weeks worth,  where they show videos of the wonderful things the<br/>\ntimber industry does for the world.  The cattleman&#39;s associations has<br/>\ntheir turn,  they get two days a year to convince little kids killing<br/>\nstuff is their great American right, and their duty to the world.   And<br/>\nthe character building classes that  <br/>\nare taught by the local ( Christian ) church hot shots.  Yeah, it would<br/>\nbe absolutely unfair if they heard about acid rain<br/>\n.<br/>\n<blockquote><span title=\"ireply\"> &gt; But anytime kids are fed a single viewpoint it&#39;s scary.<br/>\n <br/>\n </span></blockquote> I agree.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;They<br/>\n&gt; weren&#39;t designed to teach kids how to think, how to weigh issues, <br/>\n&gt; how to<br/>\n&gt; come to their own conclusions. <br/>\n<br/>\n </span></blockquote>Young people deserve a little more credit.  There are certainly more than<br/>\na few who will not stop asking &quot;why&quot;  and wondering how things might be<br/>\nchanged for the better.  And in my personal experience, when we talk<br/>\nabout ps kids,  those are usually the kids with the * liberal * ( acid<br/>\nrain )  school experience.<br/>\n<br/>\nAround here we&#39;re growing plenty of the chop it down, kill it, make a<br/>\nbuck, go to church,  kind.  If a couple of the acid rain kind came out of<br/>\nTexas, I don&#39;t think the universe would be thrown into turmoil. <br/>\n<br/>\nDeb L</div>","specialLinks":[]},{"userId":0,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"avnhighsky","replyTo":"LIST","senderId":"GButpWNAN4oNKYZA62_H7On2i7JfWQuZ231cGObO8CGCtuGYqXsnRivPgfq88ragOW3Lf_aeYLMBdDRWm2bRIKqBW6-A_81s2X0","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Nuttier Than A Bag Of Nuts At A Nut\tFestival","postDate":"1004954710","msgId":27406,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI4MEJDRTg1LjFGRjklZmV0dGVyb2xsQGVhcnRobGluay5uZXQ+","inReplyToHeader":"PDAxNDUwMWMxNjU4NiQ0MGI5Njc0MCQ2OTVkZDFkMUBqaWRhMzU+"},"prevInTopic":27398,"nextInTopic":27407,"prevInTime":27405,"nextInTime":27407,"topicId":27398,"numMessagesInTopic":0,"msgSnippet":"on 11/4/01 6:12 PM, Lynda at lurine@softcom.net wrote: Anyone in Texas know if this nut got his bonfire? I think Texas is one of the states where the state","messageBody":"<div id=\"ygrps-yiv-1740546595\">on 11/4/01 6:12 PM, Lynda at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:lurine@...\">lurine@...</a> wrote:<br/>\n<br/>\nAnyone in Texas know if this nut got his bonfire?<br/>\n<br/>\nI think Texas is one of the states where the state board of education<br/>\nchooses the textbooks for the whole state so someone who can convince those<br/>\ndoing the choosing can influence a whole humongous state -- and the thinking<br/>\nof a whole passle of future voters.<br/>\n<br/>\nEnvironmentalism is a hot point with conservatives since conservatives are<br/>\ngenerally for strong local government and minimal national government. And<br/>\nenvironmental policies are generally a national government issue. So more<br/>\nenvironmentalism means more national control.<br/>\n<br/>\nAs for the kids not being qualified, he has a point. Are the kids being<br/>\npresented with opposing viewpoints on environmental issues so they can<br/>\ndecide for themselves or are they being fed a single viewpoint?<br/>\n<br/>\nTo someone who feels environmentalism is too obvious to be questioned,<br/>\npresenting kids with the causes of acid rain and the effects of acid rain<br/>\nwould seem to be giving them a complete picture. (Of course, since schools<br/>\ndivide information into neat compartments, it *is* a complete *science*<br/>\npicture. Since it&#39;s a science class they can&#39;t discuss the economic or<br/>\npolitical aspects of the issue. Those must be confined to separate classes.)<br/>\n<br/>\nBut if the kids were being presented with an obvious conservative point in<br/>\ngovernment class, such as gun ownership is a constitutionally mandated right<br/>\nclearly stated in the second amendment, and it was suggested they all write<br/>\nto their congressional representative about preserving that right, I suspect<br/>\nliberals would find it appalling. It would look like mind control. It would<br/>\nlook like a state trying to mold an entire generation of future voters<br/>\ntowards a single viewpoint. It wouldn&#39;t look at all like kids asking their<br/>\ncongressional representative to represent them. It would look like someone<br/>\ngetting all the kids in the state to follow a single political agenda. It<br/>\nwould look really really scary.<br/>\n<br/>\nBut anytime kids are fed a single viewpoint it&#39;s scary. Unfortunately<br/>\nschools weren&#39;t designed to offer information with more than one view point.<br/>\nHow many viewpoints can their be to 5+12 and here&#39;s how to spell &quot;cat&quot;? They<br/>\nweren&#39;t designed to teach kids how to think, how to weigh issues, how to<br/>\ncome to their own conclusions. The were designed to give kids a basic<br/>\nframework of practical math, reading, writing, some history.<br/>\n<br/>\nThe information schools impart has expanded well beyond that, but the &quot;just<br/>\nmemorize the facts&quot; approach and mentality hasn&#39;t changed.<br/>\n<br/>\nAnd I bet you were expecting a slew of &quot;Boy, I agree with you, what a nut<br/>\ncase!&quot; ;-)<br/>\n<br/>\nJoyce <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":0,"authorName":"Lynda","from":"&quot;Lynda&quot; &lt;lurine@...&gt;","profile":"anoydami","replyTo":"LIST","senderId":"IeseyXm__OG7mbAH1TzpmWOfDKry7wPSQH4DAoQaVX6hSaWHznI2JcNYEthwU4mm3mA4CV7QYTE7s7axER_1vxMAmA","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Nuttier Than A Bag Of Nuts At A Nut Festival","postDate":"1004915574","msgId":27398,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxNDUwMWMxNjU4NiQ0MGI5Njc0MCQ2OTVkZDFkMUBqaWRhMzU+"},"prevInTopic":0,"nextInTopic":27406,"prevInTime":27397,"nextInTime":27399,"topicId":27398,"numMessagesInTopic":0,"msgSnippet":"Anyone in Texas know if this nut got his bonfire? Lynda Nuttier than a bag of nuts at a nut festival, Michael Franks (a member of the Texas Republican","messageBody":"<div id=\"ygrps-yiv-339907936\">Anyone in Texas know if this nut got his bonfire?<br/>\n<br/>\nLynda<br/>\n<br/>\nNuttier than a bag of nuts at a nut festival, Michael Franks (a member of<br/>\nthe Texas Republican Executive Committee) earns a spot on the list this week<br/>\nwith his interesting take on the evils of. um, school textbooks. Apparently<br/>\nthe conservative group &quot;Texas Citizens for a Sound Economy&quot; have got a beef<br/>\nwith the Texas State Board of Education over some ideas about global warming<br/>\nand acid rain which have cropped up in new middle-school science textbooks.<br/>\nYes, it would seem that those evil scientists will stop at nothing to<br/>\nindoctrinate our kids with environmentalist whacko thinking. And horror of<br/>\nhorrors, they even found a teacher&#39;s guide which suggests that students<br/>\nwrite to their congressional representatives about environmental issues, if<br/>\nyou can believe that. At a recent hearing, one of the speakers ranted,<br/>\n&quot;These kids are not qualified to advise on national energy policy or to<br/>\nwrite their congressman, for God&#39;s sake.&quot; Yes, allowing kids to think that<br/>\ntheir representative should actually represent them could be a surefire<br/>\ndisaster for this country&#39;s future. So how does Michael Franks fit into all<br/>\nthis? Well, he thinks that the books should be gotten rid of. And how?<br/>\nFranks said, &quot;I think we&#39;ve found the alternative fuel source that everyone<br/>\nis looking for and that is burning these.&quot; Mr. Franks, Hitler would be<br/>\nproud.</div>","specialLinks":[]}],"prevTopicId":27372,"nextTopicId":27394}}