{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":200184763,"authorName":"Heidi Here","from":"&quot;Heidi Here&quot; &lt;kleincrew@...&gt;","profile":"kleincrew","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Writing for no reason WAS Reassuranceand support","postDate":"1101991098","msgId":101457,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMjUwMWM0ZDg2YiRjZGZlYmFhMCQ5MDI3MjYwY0BNb20+","referencesHeader":"PEJERDQ3MjU1LjJFRTk2JWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":101456,"nextInTime":101458,"topicId":101457,"numMessagesInTopic":0,"msgSnippet":"Joyce, WOW they are both so very very good I want to read MORE!! VERY proud of your daughter! Tell her I want to read the whole thing! Now maybe I will Take","messageBody":"<div id=\"ygrps-yiv-603169966\">Joyce, WOW they are both so very very good I want to read MORE!! VERY proud of your daughter! Tell her I want to read the whole thing!<br/>\n Now maybe I will Take the plunge! I have always wanted to write a book, even took a class once a long time ago , the teacher was &quot;Fern Michaels&quot; and the main person in my book was named &quot;Makayla&quot; well she told me that was a very Harsh name and to change it...well after so many years later I now have a 6.5 yold DD named...Makayla..I loved it then and I love it now...well that just goes to show how a teacher could make you think you aren&#39;t &quot;good enough&quot;, I never tried writing again ( I know dumb on my part but life also took over ) Well thanks so much for sharing your &quot;books&quot; I really did LOVE them both.<br/>\nHeidi<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: Fetteroll <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a> <br/>\n  Sent: Thursday, December 02, 2004 7:18 AM<br/>\n  Subject: Re: [UnschoolingDiscussion] Writing for no reason WAS Reassuranceand support<br/>\n<br/>\n<br/>\n  on 12/1/04 9:39 PM, Heidi Here at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kleincrew@...\">kleincrew@...</a> wrote:<br/>\n<br/>\n  &gt; I must have missed something!! What are you guys taking about , what kind of<br/>\n  &gt; book writing?<br/>\n  &gt; Thanks for letting me know<br/>\n<br/>\n  November is National Novel Writers Month. There&#39;s an organization called<br/>\n  NaNoWriMo.org that challenges everyone who has ever thought about writing to<br/>\n  write a 50,000 word novel in 30 days -- between Nov 1 and midnight Nov 30.<br/>\n<br/>\n  The basic idea is that we&#39;re each our biggest roadblocks to writing. We want<br/>\n  our writing to be great so we think about it too much and put it off or edit<br/>\n  too much trying to get something perfect. So the challenge is to just write<br/>\n  without concern for quality. It&#39;s *quantity* that counts in November, not<br/>\n  quality. :-)<br/>\n<br/>\n  And by not caring about quality people can produce some pretty good writing<br/>\n  :-) I remember reading in a book on writing that several authors basically<br/>\n  do write that way. Their goal is to produce 1000 words a day. And one was<br/>\n  quoted as saying that some days he produces what feels like great stuff and<br/>\n  some days he produces what feels like crap but then when he reads it later<br/>\n  they&#39;re both equally good.<br/>\n<br/>\n  My daughter Kathryn (13) and I participated this year. (And completed it!<br/>\n  Yeah! :-) Hers is done. Mine is still going. (50,000 is the minimum for a<br/>\n  published novel.) (I probably couldn&#39;t have done it if Kathryn wasn&#39;t too<br/>\n  since she was perfectly content to write for several hours a day which gave<br/>\n  me time to also. And also that we didn&#39;t have visitors for Thanksgiving!)<br/>\n<br/>\n  And I&#39;d definitely not say writing for NaNoWriMo is &quot;writing for no reason&quot;!<br/>\n  It was writing for fun! :-)<br/>\n<br/>\n  ===========Here&#39;s a bit of Kathryn&#39;s:<br/>\n  [Hers takes place in this world she&#39;s developed over many years.]<br/>\n<br/>\n  Bane&#39;s Awakening<br/>\n<br/>\n  Story premise recap thing (just so you get the idea of what&#39;s going on):<br/>\n<br/>\n  Avn Hisky is a pearly pink cat that can walk upright like a human. She lives<br/>\n  in an enormous gigantic company called Katzah Korp. with her friends, Spot,<br/>\n  Tiger, Pachiki and her little sister Star. And along with about fifty<br/>\n  thousand other cats. Katzah Korp. is owned by the never seen Mr. Katzah who<br/>\n  holds classes where the cats in his company make products. Such as comic<br/>\n  books and comic strips, origami ornaments for all kinds of occasions,<br/>\n  pottery and other things he can sell at a high price. Mostly, the cats enjoy<br/>\n  it in Katzah Korp. but try to get back at Mr. Katzah for various reasons.<br/>\n  Such as, he is an overly powerful rich moron who thinks he&#39;s better than<br/>\n  everyone else and likes money. But, Mr. Katzah does like one cat. His name<br/>\n  is Richard Richmond. He has almost as much money as Mr. Katzah does.<br/>\n<br/>\n  Chapter one: The first chapter of many (well, this isn&#39;t actually a chapter<br/>\n  so much as it is a devisor between the prologue and the actual story)<br/>\n<br/>\n  Avn woke up to a chilly Autumn morning. She pulled herself out of her bed<br/>\n  and slid into her fuzzy, warm and brown football slippers. She then went<br/>\n  over to her closet and pulled on a leopard patterned winter robe. Once she<br/>\n  was ready, Avn headed down stairs to the enormous Breakfast Hall. (Which was<br/>\n  also the Lunch and Dinner Hall, but anyway).<br/>\n<br/>\n  Avn stared up at the 54 different things that were on the breakfast menu.<br/>\n  Cats would give ideas and then usually the food ideas would go on the menu.<br/>\n  There was a new item on the menu called &quot;Bob and Larry&#39;s seafood chili&quot;. For<br/>\n  some unknown reason, when new items were added, they were added to all of<br/>\n  the menus. Maybe it was to see for which meal it was usually ordered, then<br/>\n  the menu person (whomever that may be) would put it on that menu.<br/>\n<br/>\n  &quot;What are you going to get?&quot; asked Avn&#39;s best friend Spot as he walked into<br/>\n  the Breakfast Hall.<br/>\n<br/>\n  &quot;Not &#39;Bob and Larry&#39;s seafood chili&#39;,&quot; Avn replied.<br/>\n<br/>\n  &quot;Same with me. But that narrows the choice of breakfast down to fifty<br/>\n  three,&quot; said Spot.<br/>\n<br/>\n  &quot;Exactly. How about Pineapple Fruit Bowl?&quot; asked Avn.<br/>\n<br/>\n  &quot;Huh? Never heard of that one. What is it?&quot; Spot asked in return.<br/>\n<br/>\n  &quot;It&#39;s a pineapple cut in half lengthwise with some of the fruit scooped out<br/>\n  to make sort of a bowl. The fruit that was scooped out is then diced and<br/>\n  mixed together with grapes and other diced fruits like melons, apples and<br/>\n  oranges and such and then put inside the pineapple half. It&#39;s really good&quot;<br/>\n  replied Avn.<br/>\n<br/>\n  &quot;Sounds yummy! I&#39;ll try it!&quot; Said Spot.<br/>\n<br/>\n  They ordered two Pineapple Fruit Bowls and sat down with their breakfasts at<br/>\n  one of the many many gray plastic tables in the Breakfast Hall.<br/>\n<br/>\n  Then, two of Avn and Spot&#39;s friends walked into the Breakfast Hall, ordered<br/>\n  breakfast, came over and sat down with Avn and Spot.<br/>\n<br/>\n  &quot;Yo peeps! How ya doin&#39;?&quot; said the tiger striped one, whose name was Tiger.<br/>\n  Tiger believed that martians were going to take over the planet and suck out<br/>\n  everyone&#39;s souls and eat them on their toast.<br/>\n<br/>\n  &quot;We&#39;re doing good! As long as we don&#39;t eat a bowl of Bob and Larry&#39;s seafood<br/>\n  chili.&quot; Said Avn.<br/>\n<br/>\n  &quot;I hear that!&quot; said Tiger raising his glass of ruby red grapefruit juice.<br/>\n<br/>\n  &quot;Attention! Attention!&quot; Boomed a loud, commanding and all too familiar voice<br/>\n  over the loud speaker. It was the voice of Mr. Katzah. &quot;I have a special<br/>\n  delivery for anyone who can take care of and wants one! Meet me in the Main<br/>\n  Hall as soon as you can. I&#39;ll be there or I&#39;ll have someone stationed there<br/>\n  all day. That is all.&quot;<br/>\n<br/>\n  &quot;I wonder what &#39;It&#39; could be?&quot; Avn mused.<br/>\n<br/>\n  &quot;Probably the world&#39;s largest Jolly Rancher. Or a living ball of fluffy pink<br/>\n  and/or blue cotton candy! Ah, heaven...&quot; sighed Tiger.<br/>\n<br/>\n  &quot;Uh, yeah. But, knowing Mr. Katzah, it might just be. Who knows?&quot; said<br/>\n  Pachiki sipping her Fruit Soup.<br/>\n<br/>\n  &quot;What&#39;s in that stuff anyway? I&#39;ve thought about trying it. Is it good?&quot; Avn<br/>\n  asked Pachiki, pointing at her Fruit Soup.<br/>\n<br/>\n  &quot;Fruit juices and the syrup stuff that&#39;s in the cans of fruit for the broth,<br/>\n  and chopped up fruit and chopped up canned fruit. It&#39;s sweet, but very<br/>\n  good,&quot; replied Pachiki.<br/>\n<br/>\n  &quot;Well, once I&#39;m done with my Ham and Cheese Scone, I&#39;m going to go see what<br/>\n  &#39;It&#39; is! Anyone want to join me?&quot; asked Tiger.<br/>\n<br/>\n  &quot;Sure! I&#39;ll be done with my breakfast soon too,&quot; said Spot.<br/>\n<br/>\n  ========= And a bit of my fantasy titled &quot;Flight&quot;:<br/>\n<br/>\n  &quot;I will rip his eyeballs out and impale them on a spit and roast them until<br/>\n  they burst. I will rip his nose off and season it with fire pepper and feed<br/>\n  it to Tagira. I will rip his lips off andS&quot; dark haired Magla chanted into<br/>\n  the warm wind rushing into her as the massive orange tiger beneath her<br/>\n  bounded over ragged rocks and scrubby scrouse bushes.<br/>\n<br/>\n  Kaya rode near Magla on the back of a jewel blue dragon, its powerful wings<br/>\n  thrusting rider and mount just a few hand breadths above the ground. This<br/>\n  was going downward in more ways than one, Kaya thought and tuned out her<br/>\n  clanmate. Not that Kaya didn&#39;t agree with the sentiment. She just didn&#39;t<br/>\n  need to hear it graphically spelled out.<br/>\n<br/>\n  Tagira the tiger, carrying her small, spewing rider, leapt over the<br/>\n  outcropping and dropped down to the dusty rocky path that led around the<br/>\n  side of the mountain. Chengdo, Kaya&#39;s dragon, banked gracefully to follow<br/>\n  Tagira, then abruptly plummeted down the side of the mountain.<br/>\n<br/>\n  &quot;Cheeennngggdooooo!&quot; Kaya screamed pulling at the emerald green reins<br/>\n  attached to the ruby red halter. But the dragon was oblivious to external<br/>\n  commands for spilling out of a split in the side of the mountain was a tam<br/>\n  bush, laden with fat purple berries. A sinuous twist to face upward and the<br/>\n  dragon slammed into the rocky cliff, golden claws splayed feeling for tiny<br/>\n  cracks and miniscule crevices. And her dragon began to feed on the one food<br/>\n  dragons could never resist. Kaya clung to the neck of the dragon, settling<br/>\n  her bottom on the backrest of the tooled leather dragon saddle, specially<br/>\n  designed for this inevitable occurrence. She buried her face in the soft<br/>\n  blue feathery scales of the dragon&#39;s neck and prepared to wait.<br/>\n<br/>\n  &quot;Kaaaayaaaa!&quot; Magla called from above.<br/>\n<br/>\n  &quot;Down here!&quot; called Kaya. &quot;Chengdo spotted tam berries.&quot; She didn&#39;t need to<br/>\n  say more. Magla&#39;s deep sigh drifted down to her. &quot;Go on without me.&quot;<br/>\n<br/>\n  &quot;No, I can&#39;t. This is an insult to both of us. We must confront the beast of<br/>\n  a monk together.&quot;<br/>\n<br/>\n  Which was true. Her fist thudded against the dragon&#39;s neck in frustration<br/>\n  but the dragon paid no heed to her. She could feel the muscles beneath the<br/>\n  scales working as the dragon stripped the berries from the bush and worked<br/>\n  them rhythmically into a pulp with his tongue. Chengdo&#39;s breath rumbled<br/>\n  deeply in his chest like the purring of a contented cat.<br/>\n<br/>\n  Kaya breathed deeply as she&#39;d been taught, letting go of the air and the<br/>\n  tension and the desire to control what was uncontrollable. After 50 deep<br/>\n  slow breaths she felt the dragon&#39;s grip relax. Chengdo pushed himself away<br/>\n  from the craggy cliff. He thrust out his leathery wings catching huge scoops<br/>\n  of the late spring air to twist acrobatically around until the two of them<br/>\n  were hovering above Magla and Tagira.<br/>\n<br/>\n  A gentle nudge from Magla and Tagira twisted as gracefully as Chengdo as<br/>\n  though the two were adversaries in some fall athletic competition. Tagira<br/>\n  bounded up the mountain, catching purchase where no earthbound creature<br/>\n  should be able to go. Chengdo followed easily, now a complementary partner<br/>\n  in their powerful dance across the mountainous terrain.<br/>\n<br/>\n  The two pairs of riders and mounts reached the peak and paused to look down<br/>\n  at the rock carved monastery and village of the herding people. The tiger<br/>\n  stood proudly atop the stone perch as the dragon settled next to him.<br/>\n<br/>\n  After a few moments of deep admiration for the patch of emerald green<br/>\n  nestled in a rocky bowl of the mountain range, Kaya called, &quot;Find Xan.&quot; The<br/>\n  tiger&#39;s ears flicked back as it caught the familiar name. Then the tiger and<br/>\n  dragon locked in a contest to be the first to spot the monk.<br/>\n<br/>\n  The tiger won by an eye blink and bounded down the mountain. The dragon<br/>\n  launched outward twisting and stretching into a banking circle high over the<br/>\n  curving patch of vegetation, its golden eyes locked onto the one the friends<br/>\n  sought. With a gathering of wings, Chengdo dropped like hawk after a rabbit.<br/>\n  This would be no contest for the dragon could drop through the air faster<br/>\n  than the tiger could bound down the cliff.<br/>\n<br/>\n  Joyce<br/>\n<br/>\n<br/>\n<br/>\n  &quot;List Posting Policies&quot; are provided in the files area of this group. <br/>\n<br/>\n  Visit the Unschooling website and message boards: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> <br/>\n<br/>\n<br/>\n        Yahoo! Groups Sponsor <br/>\n              ADVERTISEMENT<br/>\n             <br/>\n       <br/>\n       <br/>\n<br/>\n<br/>\n------------------------------------------------------------------------------<br/>\n  Yahoo! Groups Links<br/>\n<br/>\n    a.. To visit your group on the web, go to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/UnschoolingDiscussion/\">http://groups.yahoo.com/group/UnschoolingDiscussion/</a><br/>\n      <br/>\n    b.. To unsubscribe from this group, send an email to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a><br/>\n      <br/>\n    c.. Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]}],"prevTopicId":101430,"nextTopicId":101445}}