{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":60,"messages":[{"userId":126919745,"authorName":"Pam Sorooshian","from":"&quot;Pam Sorooshian&quot; &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] Re: Ways around resentment?","postDate":"1266691873","msgId":50919,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxYjMwMWNhYjI1ZCRhZDI4YjdmMCQwNzdhMjdkMCRAbmV0Pg==","inReplyToHeader":"PDhDQzgwNERDNDQzRDI5OC02ODQwLTkwQjBAd2VibWFpbC1tMDIxLnN5c29wcy5hb2wuY29tPg==","referencesHeader":"PDhDQzgwNERDNDQzRDI5OC02ODQwLTkwQjBAd2VibWFpbC1tMDIxLnN5c29wcy5hb2wuY29tPg=="},"prevInTopic":50911,"nextInTopic":50923,"prevInTime":50918,"nextInTime":50920,"topicId":50865,"numMessagesInTopic":0,"msgSnippet":"This is only one example out of a hundred. He is rude and disrespectful to me constantly but he expects me to be respectful to him at all times. You have an","messageBody":"<div id=\"ygrps-yiv-782838608\">This is only one example out of a hundred. He is rude and disrespectful to<br/>\nme constantly but he expects me to be respectful to him at all times.&gt;&gt;<br/>\n<br/>\n <br/>\n<br/>\nYou have an adversarial relationship right now. You are each trying to prove<br/>\nyourself to be in the right. You&#39;re like a couple of really petty attorneys.<br/>\nIt does NOT have to be like that, but you are the one who will have to<br/>\nchange and then you&#39;ll have to be patient enough to wait for the change in<br/>\nyou to change the atmosphere enough to impact his attitude, too. It could<br/>\ntake a year. Can you be the generous and respectful person you want him to<br/>\nbe? Can you focus on your own behavior and stop trying to manage his?<br/>\n<br/>\n <br/>\n<br/>\nMaking a phone call when your children are right there in the room with you?<br/>\nWhat a lost opportunity to be having a conversation with them, to be finding<br/>\nout what they&#39;re doing hanging out there with you and what you could be<br/>\ndoing for them. You have a 15 yo and a 7 year old with you in the same room<br/>\nand you tell them to be quiet so you can make a phone call? From now on -<br/>\ntake every opportunity to look them in the eyes, to make loving eye contact.<br/>\nTake every opportunity to show interest in what&#39;s going on with them. Take<br/>\nmany opportunities to touch them (especially the 15 yo son, because parents<br/>\noften cut out all loving physical contact with teenagers). All too soon he<br/>\nwas going to go back to his room to listen to his own music. You had the<br/>\nchance to spend a few minutes with him and you totally rejected it (and<br/>\nmaybe it felt like rejection to him.) You could have offered to fix him<br/>\nsomething to eat, you could have just said, casually, &quot;How&#39;re things in your<br/>\nworld?&quot; You could have talked about plans for later that day or the weekend.<br/>\nYou could have asked &quot;So, how was that movie you guys saw the other day?&quot;<br/>\nAnd never ever shame your child - I felt the pain in my own heart when you<br/>\nsaid you&#39;d (sarcastically) told the stranger on the phone you had to go tell<br/>\nyour 15 yo to be quiet. Stop defending yourself and think about how that<br/>\nfelt to him. EVEN when a child does something wrong, don&#39;t shame him about<br/>\nit. Be sensitive and kind to him - be the one person in the world he can<br/>\ncount on to never ever purposely hurt him like that, to know that if he<br/>\nscrews up that you won&#39;t rub his nose in it.<br/>\n<br/>\n <br/>\n<br/>\nFirst things first. And your children should always come first. Turn your<br/>\nattention toward them. Think more about what you can do for them right now.<br/>\nThink about how you can show interest in their inner and outer lives. Think<br/>\nabout being attentive and fully &quot;present&quot; in the zen sense of the word, not<br/>\njust the physical sense.<br/>\n<br/>\n <br/>\n<br/>\n(And, if you&#39;ve thought, while reading this, &quot;But that phone call was for my<br/>\ndaughter, I was putting my children first,&quot; then you are being defensive and<br/>\nnot listening to learn, but still trying to prove you&#39;re in the right,<br/>\nrather than opening up to ways you can be happier, instead.)<br/>\n<br/>\n <br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":143043046,"authorName":"Ed Wendell","from":"&quot;Ed Wendell&quot; &lt;ewendell@...&gt;","profile":"zelco123","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Ways around resentment?","postDate":"1266678791","msgId":50911,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIyMzgyRUNGQjExQjQ0MThBNEQ3Njk2NjdDODc2NUIyQEVkUEM+","inReplyToHeader":"PDhDQzgwNERDNDQzRDI5OC02ODQwLTkwQjBAd2VibWFpbC1tMDIxLnN5c29wcy5hb2wuY29tPg==","referencesHeader":"PDhDQzgwNERDNDQzRDI5OC02ODQwLTkwQjBAd2VibWFpbC1tMDIxLnN5c29wcy5hb2wuY29tPg=="},"prevInTopic":50910,"nextInTopic":50919,"prevInTime":50910,"nextInTime":50912,"topicId":50865,"numMessagesInTopic":0,"msgSnippet":"Yesterday was trash/recycle day - The night before we had gathered it all and placed it by the garage door on the inside.  I had agreed to put the trash out on","messageBody":"<div id=\"ygrps-yiv-1950010844\">Yesterday was trash/recycle day - The night before we had gathered it all and placed it by the garage door on the inside.  I had agreed to put the trash out on my way to work the next morning.  However, when It was time for me to leave, it was pouring rain - which meant I would get soaked trying to put the trash and recycle bins out.  We have a long drive with gates at the end which means multiple trips to the end of the drive, opening double gates, putting the trash/recycle outside the gates by the street, returning for the vehicle, driving the vehicle out and then shutting gates.  I would have skipped it altogether but we missed trash day the week before because I was running late, forgot and didn&#39;t want to wake anybody to do it.  Anyway, I asked Zac (15) if he would please do it for me so I would not get wet and he did it.  He got out of bed to do it (he&#39;d only been in bed about 30 minutes and was just falling asleep).  He did grump and complain, but he did it for me - I acknowledged the fact that I knew he did not want to do it but did it for me and how much I appreciated it.   7 AM trash runs are not something I&#39;ve ever asked for before and I hesitated to ask (7 AM & pouring rain) but I did ask and he did it.  <br/>\n<br/>\nI truly feel that all our filling his cup (so to speak) helps when we sincerely ask for help.<br/>\n<br/>\nLisa W. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Ways around resentment?","postDate":"1266678636","msgId":50908,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM0M0I4QUUxLTFFQkYtNDgyMi04MjM3LUMwQzFGRjQ3RDIwQUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDhDQzgwNERDNDQzRDI5OC02ODQwLTkwQjBAd2VibWFpbC1tMDIxLnN5c29wcy5hb2wuY29tPg==","referencesHeader":"PDhDQzgwNERDNDQzRDI5OC02ODQwLTkwQjBAd2VibWFpbC1tMDIxLnN5c29wcy5hb2wuY29tPg=="},"prevInTopic":50907,"nextInTopic":50910,"prevInTime":50907,"nextInTime":50909,"topicId":50865,"numMessagesInTopic":0,"msgSnippet":"-=-Later, I told my son that it was disrespectful of him to make so much noise when I told him that I was going to be on the phone for a few minutes. He told","messageBody":"<div id=\"ygrps-yiv-948618075\">-=-Later, I told my son that it was disrespectful of him to make so  <br/>\nmuch noise when I told him that I was going to be on the phone for a  <br/>\nfew minutes. He told me that I disrespected him by telling the woman  <br/>\non the phone that I was sorry that I had to tell my 15 year old to be  <br/>\nquiet while I was on the phone. I told him that I didn&#39;t mean to be  <br/>\ndisrespectful to him but that he was disrespectful to me by not  <br/>\nkeeping it down as I asked him to before I made the call.-=-<br/>\n<br/>\nToo many words.<br/>\n<br/>\nI wouldn&#39;t apologize for telling the truth.<br/>\n<br/>\nI wouldnt&#39; have said &quot;it was disrespectful of you to make so much  <br/>\nnoise.&quot;  I more likely would have said &quot;What is your problem!?&quot; but  <br/>\nthat&#39;s because if one of my kids did that they would really trying to  <br/>\nbe communicating something to me, I guess.<br/>\n<br/>\n-=-I told my 15 year old son and my 7 year old daughter that I needed  <br/>\nto make a phone call to the cell phone company regarding my 17 year  <br/>\nold daughter&#39;s cell phone not working-=-<br/>\n<br/>\nDoes the 15 year old son have a cell phone too?<br/>\nIf not, I&#39;d guess that&#39;s why he was cranky about the call.<br/>\n<br/>\nIf so, why didn&#39;t you get him to call the cell phone company?  Or why  <br/>\ndidn&#39;t your 17 year old daughter call them?<br/>\n<br/>\n-=-Then my son started bouncing this huge exercise ball we have over  <br/>\nand over again as loud as he could on the kitchen floor.-=-<br/>\n<br/>\nYou could have put your hand on the ball and put it between you and  <br/>\nthe corner of the cabinet, silently, while you spoke.<br/>\n<br/>\n-=- I motioned to him to please stop bouncing the ball. -=-<br/>\n<br/>\n&quot;Please&quot;?  It was an option?  That&#39;s not the time for an option.<br/>\n<br/>\n-=-When I came back inside, he had gone back upstairs. My youngest  <br/>\ndaughter told me that he told her that it was all her fault that I  <br/>\nwent outside. -=-<br/>\n<br/>\nIs there something he&#39;s wanting that he&#39;s not getting?  Is he bored  <br/>\nand needs to have more friends over?  Does he need to get out more?   <br/>\nHe has a sister on either side and... what could you do to make him  <br/>\nfeel more whole, more grown, more manly?  Not words.  Too many words.   <br/>\nOpportunities.<br/>\n<br/>\n-=-Later, I told my son that it was disrespectful of him to ...-=-<br/>\n<br/>\nRespect doesn&#39;t come from words.   He really truly WAS being  <br/>\ndisrespectful.  Telling him he should be respectful doesn&#39;t address  <br/>\nthe root of the problem.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/respect\">http://sandradodd.com/respect</a><br/>\n<br/>\n-=- So even though I have changed my parenting a lot, they seem to  <br/>\nstill think of me as the same parent that I once was. -=-<br/>\n<br/>\nThat will involve a long time of making up for past damage.  If you  <br/>\nturned too quickly from controls to the idea that you should let them  <br/>\ndo whatever they want (which it seems perhaps you&#39;re feeling, much  <br/>\nmore than I do &lt;g&gt;), he might think you&#39;ve gone nuts.  Or he might be  <br/>\ntesting to see if you&#39;ve really changed.  I don&#39;t know enough to  <br/>\nguess.  It doesn&#39;t matter, in a big way.  You just need to make more  <br/>\ndecisions in the moment, and fewer in the vague longterm way, I think.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/gradualchange\">http://sandradodd.com/gradualchange</a>  (gradual change, something by  <br/>\nJoyce there)<br/>\n<br/>\n-=-I know that some of the responses will be that I should have waited  <br/>\nfor him to go back upstairs to make the call or I should have went  <br/>\noutside in the first place. That does make sense.-=-<br/>\n<br/>\nI hope those won&#39;t be the responses.<br/>\n<br/>\nHow long have you been unschooling?<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":330448208,"authorName":"KaitKalKenz3@aol.com","from":"KaitKalKenz3@...","profile":"kaitkalkenz3","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Ways around resentment?","postDate":"1266677511","msgId":50910,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDQzgwNTM1RjI1MkIxOC02ODQwLTk2ODZAd2VibWFpbC1tMDIxLnN5c29wcy5hb2wuY29tPg=="},"prevInTopic":50908,"nextInTopic":50911,"prevInTime":50909,"nextInTime":50911,"topicId":50865,"numMessagesInTopic":0,"msgSnippet":"After I sent my e-mail off a little while ago, I heard Sandra s voice in my head saying that I should read the links that she provides before e-mailing. Sorry,","messageBody":"<div id=\"ygrps-yiv-1422571179\">After I sent my e-mail off a little while ago, I heard Sandra&#39;s voice in my head saying that I should read the links that she provides before e-mailing. Sorry, Sandra, I didn&#39;t read them first but now I have. I went to Sandra&#39;s site and read her pages on respect including the one with comments from Robyn. I also went to Joyce&#39;s site and read her pages on respect as well. These all had many good points and examples. They are helping me to understand why this is more my issue than my son&#39;s. Thank you all for such great information on your sites and in this list. It&#39;s been really helpful to my family in their unschooling journey and their lives. I still look forward to hearing any comments or suggestions to my earlier post. Thank you.<br/>\n<br/>\nTake care,<br/>\nSherri<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Ways around resentment?","postDate":"1266675182","msgId":50906,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY0Mjk2QUFGLTFFNjgtNEQ4MC1BREU3LUVENjA2OTg1OUE4QkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDAxMjIwMWNhYjFmMyQ0NTlmY2JiMCRkMGRmNjMxMCRAbmV0Pg==","referencesHeader":"PGhsbXVoYSs0dmpxQGVHcm91cHMuY29tPiA8OTUzNTQ5Ljg5ODA1LnFtQHdlYjExMTgxMy5tYWlsLmdxMS55YWhvby5jb20+IDwwMTIyMDFjYWIxZjMkNDU5ZmNiYjAkZDBkZjYzMTAkQG5ldD4="},"prevInTopic":50905,"nextInTopic":50907,"prevInTime":50905,"nextInTime":50907,"topicId":50865,"numMessagesInTopic":0,"msgSnippet":"-=- Have you spent the past 13 years being a model of unconditional giving? Have you behaved or indicated that you resented giving? Have you demanded that she","messageBody":"<div id=\"ygrps-yiv-1734664281\">-=-<br/>\nHave you spent the past 13 years being a model of unconditional  <br/>\ngiving? Have<br/>\nyou behaved or indicated that you resented giving? Have you demanded  <br/>\nthat<br/>\nshe &quot;give?&quot; Have you bribed, cajoled, threatened, punished, gotten  <br/>\nangry? -=-<br/>\n<br/>\nIf the answers to those questions aren&#39;t ideal, that doesn&#39;t mean  <br/>\n&quot;it&#39;s too late now.&quot;  There&#39;s a reality no words can erase.  Until the  <br/>\nmother learns to give without martyrdom, without counting the times,  <br/>\nuntil she learns to dedicate her thoughts and her intentions and her  <br/>\ntime and patience to her children, and then does it consistently for a  <br/>\nlong time (months, years), the children will still be reacting to the  <br/>\ntimes they were bossed and shamed and punished.<br/>\n<br/>\nIt will never be enough for a mother to say &quot;I&#39;ve changed.&quot;  She has  <br/>\nto actually and truly change.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":330448208,"authorName":"KaitKalKenz3@aol.com","from":"KaitKalKenz3@...","profile":"kaitkalkenz3","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Ways around resentment?","postDate":"1266675104","msgId":50907,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDQzgwNERDNDQzRDI5OC02ODQwLTkwQjBAd2VibWFpbC1tMDIxLnN5c29wcy5hb2wuY29tPg=="},"prevInTopic":50906,"nextInTopic":50908,"prevInTime":50906,"nextInTime":50908,"topicId":50865,"numMessagesInTopic":0,"msgSnippet":"I loved both Sandra s and Joyce s comments to this topic. It really put things into perspective for me as I have felt resentful in the past of all that I do","messageBody":"<div id=\"ygrps-yiv-1039829925\">I loved both Sandra&#39;s and Joyce&#39;s comments to this topic. It really put things into perspective for me as I have felt resentful in the past of all that I do for my three children when it seems that not much is reciprocated.<br/>\n<br/>\nSandra wrote: &quot;It&#39;s not a reciprocal relationship, though. You&#39;re his mom. He&#39;s not your mom or dad.&quot;<br/>\n <br/>\n~~ That is so true! I shouldn&#39;t expect them to do things the way that I would or when or how or even to do it at all.<br/>\n <br/>\n<br/>\nSandra wrote: &quot;The longer you&#39;re nice to them, I think, the more willing they&#39;ll be to help you in an emergency.&quot;<br/>\n <br/>\n~~ This is also so true! I know that this is true because I have noticed that when I am nicer to them, they are more willing to help.<br/>\n <br/>\nSandra wrote: &quot;If I&#39;ve set up a predicament where I&#39;m going to be late I say so. &quot;I know I should have done this before, but I&#39;m going to be late. Will you please help me?&quot; And then I thank them profusely then, and again later.&quot;<br/>\n <br/>\n~~ This is another great statement. I also like the way that you asked them for help. I can see how someone would be more willing to help if you worded it like that rather than just yelling, acting like a lunatic because you are late, and ordering them to help. I think that a lot has to do with how things are worded.<br/>\n <br/>\nJoyce wrote: &quot;It helps to see what you do for them as a gift rather than a favor. <br/>\nGifts come with no strings attached. Favors tend to feel like they <br/>\nneed to be 50-50.&quot;<br/>\n <br/>\n~~ This statement was really helpful. Sometimes I do tend to feel like I&#39;m doing them favors and they never do me any favors. I am going to try to start thinking of everything as a gift with no strings attached. Thank you for this statement, Joyce. Would you mind if I quoted this on my facebook page? I will give you credit for the quote. :)<br/>\n <br/>\n&quot;I think where most parents get off track is they put all the maintenance stuff that they do for their families: cleaning, cooking, washing, errands on the list of stuff they do for their kids. And as <br/>\nthe kids grow, the kids get deeper and deeper into emotional debt to their parents without realizing what&#39;s silently going on. Then when the parents get upset that the debt isn&#39;t being repaid, the kids are <br/>\ntotally confused! From the kids&#39; point of view *all* those things are choices the parents have made. Very little of that have the kids asked for and if they had been asked, they&#39;d probably have said &quot;Do <br/>\nwhatever you want.&quot; ;-)&quot;<br/>\n <br/>\n~~ This is another amazing statement which really made me think about things from my children&#39;s perspective.<br/>\n <br/>\n&quot;A lot of help with resentment is mental shift. Pulling thoughts away from doing because you have to and turning the thoughts to doing because you want them warm and safe and fed and loved.&quot;<br/>\n <br/>\n~~ I like this statement a lot too. I am going to try to remember this one when I start feeling resentful. I&#39;m doing things for them because I love and care about them, not because I have to.<br/>\n <br/>\n~~ I do have one question though. The posts on this topic seem to have been mostly about feeling resentful because the parent is doing for the children such physical things like household chores, etc. and the children aren&#39;t reciprocating. What about something that doesn&#39;t have anything to do with doing a chore but rather just being respectful? <br/>\n <br/>\nExample: I told my 15 year old son and my 7 year old daughter that I needed to make a phone call to the cell phone company regarding my 17 year old daughter&#39;s cell phone not working. I asked them to keep it down for a few minutes. My son had his heavy metal music blaring upstairs but he had just come downstairs. The music was muffled so it wasn&#39;t really going to bother my call. My youngest daughter had Spongebob on the tv but it wasn&#39;t too loud so it didn&#39;t bother the call either. So I placed the call. <br/>\n <br/>\nThen my son started bouncing this huge exercise ball we have over and over again as loud as he could on the kitchen floor. I went into the living room. He continues doing this. I am having a hard time concentrating talking to the cell phone company. I motioned to him to please stop bouncing the ball. He just smiles and bounces it higher and louder. I apologized to the woman on the phone, told her to hang on, told my son to please stop while I was on the phone. Again, he smiles and continues. I opened the front door and went out on the porch to finish the call telling the woman on the phone that I was sorry that I had to tell my 15 year old to be quiet while I was on the phone.<br/>\n <br/>\nI was very disappointed that he couldn&#39;t have been respectful enough to be quiet until I got off of the phone. I wouldn&#39;t expect a 5 year old to be quiet but he&#39;s 15. When I came back inside, he had gone back upstairs. My youngest daughter told me that he told her that it was all her fault that I went outside. My daughter hadn&#39;t made any noise while I was on the phone.<br/>\n <br/>\nLater, I told my son that it was disrespectful of him to make so much noise when I told him that I was going to be on the phone for a few minutes. He told me that I disrespected him by telling the woman on the phone that I was sorry that I had to tell my 15 year old to be quiet while I was on the phone. I told him that I didn&#39;t mean to be disrespectful to him but that he was disrespectful to me by not keeping it down as I asked him to before I made the call.<br/>\n <br/>\nThis is only one example out of a hundred. He is rude and disrespectful to me constantly but he expects me to be respectful to him at all times. I try. Believe me, I do try. Even when I am being respectful, he still is not. How do I handle this? This has nothing to do with doing chores or anything physical for me. It has to do with respect and compassion for human beings in general.<br/>\n <br/>\nI know that some of the responses will be that I should have waited for him to go back upstairs to make the call or I should have went outside in the first place. That does make sense. I will do that next time. But as I said, this is only one example of many. <br/>\n <br/>\nHow do any of you handle it if your children are just rude or disrespectful in general? I want to have relationships with my children like Sandra has with hers. She started out doing everything right though. My problem is that I didn&#39;t parent the right way from the beginning. So even though I have changed my parenting a lot, they seem to still think of me as the same parent that I once was. <br/>\n <br/>\nI do want to say though that our relationships are much better now that they are unschooling than when they were in public school and even online public school. Unschooling is the best thing that ever happened to us. I am just trying more and more each day to improve our relationships. Any comments will be appreciated. Thank you.<br/>\n <br/>\nTake care,<br/>\nSherri<br/>\n <br/>\n<br/>\n <br/>\n&quot;I think where most parents get off track is they put all the maintenance stuff that they do for their families: cleaning, cooking, washing, errands on the list of stuff they do for their kids. And as <br/>\nthe kids grow, the kids get deeper and deeper into emotional debt to their parents without realizing what&#39;s silently going on. Then when the parents get upset that the debt isn&#39;t being repaid, the kids are <br/>\ntotally confused! From the kids&#39; point of view *all* those things are choices the parents have made. Very little of that have the kids asked for and if they had been asked, they&#39;d probably have said &quot;Do <br/>\nwhatever you want.&quot; ;-)&quot;<br/>\n <br/>\n~~ This is another amazing statement which really made me think about things from my children&#39;s perspective.<br/>\n <br/>\n&quot;A lot of help with resentment is mental shift. Pulling thoughts away from doing because you have to and turning the thoughts to doing because you want them warm and safe and fed and loved.&quot;<br/>\n <br/>\n~~ I like this statement a lot too. I am going to try to remember this one when I start feeling resentful. I&#39;m doing things for them because I love and care about them, not because I have to.<br/>\n <br/>\n~~ I do have one question though. The posts on this topic seem to have been mostly about feeling resentful because the parent is doing for the children such physical things like household chores, etc. and the children aren&#39;t reciprocating. What about something that doesn&#39;t have anything to do with doing a chore but rather just being respectful? <br/>\n <br/>\nExample: I told my 15 year old son and my 7 year old daughter that I needed to make a phone call to the cell phone company regarding my 17 year old daughter&#39;s cell phone not working. I asked them to keep it down for a few minutes. My son had his heavy metal music blaring upstairs but he had just come downstairs. The music was muffled so it wasn&#39;t really going to bother my call. My youngest daughter had Spongebob on the tv but it wasn&#39;t too loud so it didn&#39;t bother the call either. So I placed the call. <br/>\n <br/>\nThen my son started bouncing this huge exercise ball we have over and over again as loud as he could on the kitchen floor. I went into the living room. He continues doing this. I am having a hard time concentrating talking to the cell phone company. I motioned to him to please stop bouncing the ball. He just smiles and bounces it higher and louder. I apologized to the woman on the phone, told her to hang on, told my son to please stop while I was on the phone. Again, he smiles and continues. I opened the front door and went out on the porch to finish the call telling the woman on the phone that I was sorry that I had to tell my 15 year old to be quiet while I was on the phone.<br/>\n <br/>\nI was very disappointed that he couldn&#39;t have been respectful enough to be quiet until I got off of the phone. I wouldn&#39;t expect a 5 year old to be quiet but he&#39;s 15. When I came back inside, he had gone back upstairs. My youngest daughter told me that he told her that it was all her fault that I went outside. My daughter hadn&#39;t made any noise while I was on the phone.<br/>\n <br/>\nLater, I told my son that it was disrespectful of him to make so much noise when I told him that I was going to be on the phone for a few minutes. He told me that I disrespected him by telling the woman on the phone that I was sorry that I had to tell my 15 year old to be quiet while I was on the phone. I told him that I didn&#39;t mean to be disrespectful to him but that he was disrespectful to me by not keeping it down as I asked him to before I made the call.<br/>\n <br/>\nThis is only one example out of a hundred. He is rude and disrespectful to me constantly but he expects me to be respectful to him at all times. I try. Believe me, I do try. Even when I am being respectful, he still is not. How do I handle this? This has nothing to do with doing chores or anything physical for me. It has to do with respect and compassion for human beings in general.<br/>\n <br/>\nI know that some of the responses will be that I should have waited for him to go back upstairs to make the call or I should have went outside in the first place. That does make sense. I will do that next time. But as I said, this is only one example of many. <br/>\n <br/>\nHow do any of you handle it if your children are just rude or disrespectful in general? I want to have relationships with my children like Sandra has with hers. She started out doing everything right though. My problem is that I didn&#39;t parent the right way from the beginning. So even though I have changed my parenting a lot, they seem to still think of me as the same parent that I once was. <br/>\n <br/>\nI do want to say though that our relationships are much better now that they are unschooling than when they were in public school and even online public school. Unschooling is the best thing that ever happened to us. I am just trying more and more each day to improve our relationships. Any comments will be appreciated. Thank you.<br/>\n <br/>\nTake care,<br/>\nSherri<br/>\n <br/>\n<br/>\n <br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"&quot;Pam Sorooshian&quot; &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] Re: Ways around resentment?","postDate":"1266646173","msgId":50905,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxMjIwMWNhYjFmMyQ0NTlmY2JiMCRkMGRmNjMxMCRAbmV0Pg==","inReplyToHeader":"PDk1MzU0OS44OTgwNS5xbUB3ZWIxMTE4MTMubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PGhsbXVoYSs0dmpxQGVHcm91cHMuY29tPiA8OTUzNTQ5Ljg5ODA1LnFtQHdlYjExMTgxMy5tYWlsLmdxMS55YWhvby5jb20+"},"prevInTopic":50904,"nextInTopic":50906,"prevInTime":50904,"nextInTime":50906,"topicId":50865,"numMessagesInTopic":0,"msgSnippet":"I had to be somewhere in 15 minutes...within that time (I was hoping/expecting) my 13 year old daughter to help me get out the door.  I needed something done","messageBody":"<div id=\"ygrps-yiv-996766923\">I had to be somewhere in 15 minutes...within that time (I was<br/>\nhoping/expecting) my 13 year old daughter to help me get out the door.  I<br/>\nneeded something done for me right then and there so I wouldn&#39;t be<br/>\nlate....she said no(I won&#39;t get into to the reason she couldn&#39;t/didn&#39;t want<br/>\nto help). &gt;&gt;<br/>\n<br/>\n <br/>\n<br/>\nHave you spent the past 13 years being a model of unconditional giving? Have<br/>\nyou behaved or indicated that you resented giving? Have you demanded that<br/>\nshe &quot;give?&quot; Have you bribed, cajoled, threatened, punished, gotten angry? <br/>\n<br/>\n <br/>\n<br/>\nWhy were you were in that situation? Is there any way you could have planned<br/>\nahead better?  There is an expression - &quot;Your failure to plan ahead does not<br/>\nconstitute an emergency on my part.&quot; Not so nice, but you might think about<br/>\nit if you get into frantic &quot;I&#39;m late so you should stop everything and help<br/>\nme&quot; situations very often. <br/>\n<br/>\n <br/>\n<br/>\nAnd - I&#39;m wondering why the reasons she said &quot;no&quot; were left out as if they<br/>\nwere the very least important part of the entire scenario. <br/>\n<br/>\n <br/>\n<br/>\nToday I drove about 50 miles to go have lunch with my middle daughter at her<br/>\nschool, because she&#39;s feeling a little lonely and won&#39;t be able to come home<br/>\nfor the next month. It wasn&#39;t especially convenient, I had a lot of other<br/>\nthings to do, but I miss her, too, and so I squeezed it in. She appreciated<br/>\nit and we had a nice time. While I was gone, my 19 yo  daughter cleaned up<br/>\nthe dining room and living room a bit - it was quite a big mess and she<br/>\ncleaned up quite a lot. I knew her boyfriend was waiting for her, so I was<br/>\nespecially grateful that she took the time to do that.  I called to tell her<br/>\nsomething and she cheerfully asked, &quot;How did you like the clean-up job?&quot; She<br/>\nwas picturing my surprise and delight when I walked in the door and found<br/>\nthe house cleaned up and she was getting her own pleasure out of it. <br/>\n<br/>\n <br/>\n<br/>\nI just want to say that there have been MANY times that I&#39;ve suggested<br/>\nsomeone clean up and I&#39;ve come home and it hasn&#39;t been done. I take it in<br/>\nstride because I think about the MANY times I tell MYSELF I&#39;m going to clean<br/>\nup something or do something and then I end up doing other things, instead.<br/>\nI tend to say things like, &quot;If you have time, could you unload the<br/>\ndishwasher?&quot; If they do, I&#39;m grateful and I thank them. If they don&#39;t, I<br/>\ncheerfully do it when I have time. Over the years, they&#39;ve gotten more and<br/>\nmore and more likely to step up and do things, but, still there are times I<br/>\nsuggest it and they just don&#39;t get to it. I know they have good intentions.<br/>\nSometimes they&#39;re playing video games - and I can imagine some parents would<br/>\nthink that playing a game isn&#39;t a good reason not to do what a parent asked.<br/>\nBut, there are LOTS of times that I am online and talking to friends or<br/>\nplaying a game or writing on the AlwaysLearning list and I don&#39;t do things<br/>\nthat I&#39;d told myself I was going to do. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Ways around resentment?","postDate":"1266636260","msgId":50904,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk0M0FGQzlDLTFEMTktNEM1RS1BNkI3LTg3QzRBMkY4RUJFQkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDk1MzU0OS44OTgwNS5xbUB3ZWIxMTE4MTMubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PGhsbXVoYSs0dmpxQGVHcm91cHMuY29tPiA8OTUzNTQ5Ljg5ODA1LnFtQHdlYjExMTgxMy5tYWlsLmdxMS55YWhvby5jb20+"},"prevInTopic":50903,"nextInTopic":50905,"prevInTime":50903,"nextInTime":50905,"topicId":50865,"numMessagesInTopic":0,"msgSnippet":"... It s good that you re catching yourself. :-) And It will help to back up so that you don t need to think clearly through all that resentment. Drop the","messageBody":"<div id=\"ygrps-yiv-1297460220\">On Feb 19, 2010, at 8:36 PM, Ana Maria Bruce wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I was disappointed that he wasn&#39;t willing to just stop and serve me  <br/>\n&gt; like I stop to serve him.   I chose to recognize that he didn&#39;t ask  <br/>\n&gt; me to serve him and make a<br/>\n&gt; breakfast, that was my choice, I shouldn&#39;t have expected him to  <br/>\n&gt; clean up the mess, even though it would have been nice.<br/>\n </span></blockquote>It&#39;s good that you&#39;re catching yourself. :-) And It will help to back  <br/>\nup so that you don&#39;t need to think clearly through all that  <br/>\nresentment. Drop the &quot;even though it would have been nice&quot;. It&#39;s  <br/>\nkeeping the expectation of a return favor alive in your thoughts.<br/>\n<br/>\nIt helps to see what you do for them as a gift rather than a favor.  <br/>\nGifts come with no strings attached. Favors tend to feel like they  <br/>\nneed to be 50-50.<br/>\n<br/>\nI think where most parents get off track is they put all the  <br/>\nmaintenance stuff that they do for their families: cleaning, cooking,  <br/>\nwashing, errands on the list of stuff they do for their kids. And as  <br/>\nthe kids grow, the kids get deeper and deeper into emotional debt to  <br/>\ntheir parents without realizing what&#39;s silently going on. Then when  <br/>\nthe parents get upset that the debt isn&#39;t being repaid, the kids are  <br/>\ntotally confused! From the kids&#39; point of view *all* those things are  <br/>\nchoices the parents have made. Very little of that have the kids  <br/>\nasked for and if they had been asked, they&#39;d probably have said &quot;Do  <br/>\nwhatever you want.&quot; ;-)<br/>\n<br/>\nSo none of that feels like gifts to them. It feels like stuff you  <br/>\nwant to do.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I felt a bit resentful, since I am so available to her when and if  <br/>\n&gt; she needs me, and I stop what I am doing to help her.<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>If you&#39;re sacrificing your time for her, that will build up  <br/>\nresentment. Maybe it will help to see you&#39;ve brought her into a world  <br/>\nwhere she&#39;s handicapped by age. She can&#39;t get what she wants without  <br/>\nyour help. It&#39;s cruel to resent her handicap. It&#39;s not something she  <br/>\nasked for!<br/>\n<br/>\nThink in terms of you *get to* do things for your daughter. She&#39;s  <br/>\nhealthy and whole. Many kids don&#39;t make it to 13 intact.<br/>\n<br/>\nWhen was the last time you brought her something spontaneously just  <br/>\nbecause you love her? Just to see her smile?<br/>\n<br/>\nA lot of help with resentment is mental shift. Pulling thoughts away  <br/>\nfrom doing because you have to and turning the thoughts to doing  <br/>\nbecause you want them warm and safe and fed and loved.<br/>\n<br/>\nI don&#39;t know if Sandra posted her link to her &quot;Have to&quot; page on this  <br/>\nthread yet, but it&#39;s useful for turning thinking around. And mine has  <br/>\nsome similar ideas.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/haveto\">http://sandradodd.com/haveto</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com/commitments%20obligation%20responsi/\">http://joyfullyrejoycing.com/commitments%20obligation%20responsi/</a> <br/>\nhaveto.html<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Ways around resentment?","postDate":"1266632826","msgId":50903,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQ4NjAzQUJFLTkyQkMtNDAzMi05OTk1LURFNzA3REE4MjhENkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDk1MzU0OS44OTgwNS5xbUB3ZWIxMTE4MTMubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PGhsbXVoYSs0dmpxQGVHcm91cHMuY29tPiA8OTUzNTQ5Ljg5ODA1LnFtQHdlYjExMTgxMy5tYWlsLmdxMS55YWhvby5jb20+"},"prevInTopic":50901,"nextInTopic":50904,"prevInTime":50902,"nextInTime":50904,"topicId":50865,"numMessagesInTopic":0,"msgSnippet":"-=-I had to be somewhere in 15 minutes...within that time (I was hoping/expecting) my 13 year old daughter to help me get out the door.  I needed something","messageBody":"<div id=\"ygrps-yiv-2017330696\">-=-I had to be somewhere in 15 minutes...within that time (I was  <br/>\nhoping/expecting) my 13 year old daughter to help me get out the  <br/>\ndoor.  I needed something done for me right then and there so I  <br/>\nwouldn&#39;t be late....she said no(I won&#39;t get into to the reason she  <br/>\ncouldn&#39;t/didn&#39;t want to help).  I want to focus on (my response) to  <br/>\nher not willing to help me.  I felt a bit resentful, since I am so  <br/>\navailable to her when and if she needs me, and I stop what I am doing  <br/>\nto help her.  The thing is, I got myself in this predicament...-=-<br/>\n<br/>\nThe longer you&#39;re nice to them, I think, the more willing they&#39;ll be  <br/>\nto help you in an emergency.<br/>\n<br/>\nYou said you &quot;needed&quot; something done, but you didn&#39;t say how you asked  <br/>\nher.    &quot;Will you please&quot; is way better than &quot;I need you to...&quot;<br/>\n<br/>\n-=-I made my son 16,  a hearty breakfast of homemade tortillas, beans  <br/>\nand papitas(fried potatoes), I was excited to bless him and his  <br/>\nfriend.  I had left the house before he woke up so when I got back,   <br/>\nthe mess was still there....I asked him to clean it all up right now -=-<br/>\n<br/>\nWas it &quot;will you please?&quot;   Doesn&#39;t sound like it, from &quot;all up right  <br/>\nnow.&quot;<br/>\n<br/>\n-=-I was disappointed that he wasn&#39;t willing to just stop and serve me  <br/>\nlike I stop to serve him.   I chose to recognize that he didn&#39;t ask me  <br/>\nto serve him and make a breakfast, that was my choice, I shouldn&#39;t  <br/>\nhave expected him to clean up the mess, even though it would have been  <br/>\nnice.-=-<br/>\n<br/>\nIt&#39;s not a reciprocal relationship, though.  You&#39;re his mom.  He&#39;s not  <br/>\nyour mom or dad.   I know there are a million people who would balk  <br/>\nand object to what I&#39;m writing, but I bet sight unseen I have a better  <br/>\nrelationship with my kids than they do.  All million of them.<br/>\n<br/>\nOne of the best thoughts I ever had when I was deciding how to talk to  <br/>\nmy kids was that I when I needed to decide how to be, I would treat  <br/>\nthem as I would treat guests in my home.  That&#39;s helped a great deal.<br/>\n<br/>\nIf I&#39;ve set up a predicament where I&#39;m going to be late I say so.  &quot;I  <br/>\nknow I should have done this before, but I&#39;m going to be late.  Will  <br/>\nyou please help me?&quot;  And then I thank them profusely then, and again  <br/>\nlater.<br/>\n<br/>\nIt would be easy to find people who would say I&#39;m stupid.  Nothing  <br/>\nthey say would change my kids&#39; happiness.  Both Holly and Marty have  <br/>\nhelped me today, and cheerfully.  I&#39;ve helped them too.  I just wrote  <br/>\na letter Marty needed, and scanned some things.  He borrowed my van  <br/>\ntoday, because my husband borrowed Marty&#39;s jeep.  Give and give until  <br/>\nthey&#39;re full, and then they can give some back.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":402609764,"authorName":"Ana Maria Bruce","from":"Ana Maria Bruce &lt;bittersweetanamaria@...&gt;","profile":"bittersweetanamaria","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Ways around resentment?","postDate":"1266629805","msgId":50901,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk1MzU0OS44OTgwNS5xbUB3ZWIxMTE4MTMubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PGhsbXVoYSs0dmpxQGVHcm91cHMuY29tPg==","referencesHeader":"PGhsbXVoYSs0dmpxQGVHcm91cHMuY29tPg=="},"prevInTopic":50900,"nextInTopic":50903,"prevInTime":50900,"nextInTime":50902,"topicId":50865,"numMessagesInTopic":0,"msgSnippet":"here is a scenerio that just happened so it is fresh in my mind :) I had to be somewhere in 15 minutes...within that time (I was hoping/expecting) my 13 year","messageBody":"<div id=\"ygrps-yiv-1879351229\">here is a scenerio that just happened so it is fresh in my mind :)<br/>\n<br/>\nI had to be somewhere in 15 minutes...within that time (I was hoping/expecting) my 13 year old daughter to help me get out the door.  I needed something done for me right then and there so I wouldn&#39;t be late....she said no(I won&#39;t get into to the reason she couldn&#39;t/didn&#39;t want to help).  I want to focus on (my response) to her not willing to help me.  I felt a bit resentful, since I am so available to her when and if she needs me, and I stop what I am doing to help her.  The thing is, I got myself in this predicament....I didn&#39;t allow myself enough time to do what I needed to do. In the process of doing what I was hoping she would help me with, I was disappointed that she wasn&#39;t willing to help me and a bit resentful that she doesn&#39;t respond the way I expect when I need help sometimes.  Afterall I have sacrificed so much since she was born.  Right after she said no to me,  she came into the room bouncing and smiling &quot;hey can I use your<br/>\n flat iron&quot;.....of course my initial thought was &quot;no, if you can&#39;t help me than I am not going to help you.&quot;  I chose to recognize that it wasn&#39;t her responsibility to get me out of my predicament, even though it would have been refreshing to get a positive &quot;of course I will serve you Mom&quot;, and she does plenty of that.<br/>\n<br/>\nAnother one today....I made my son 16,  a hearty breakfast of homemade tortillas, beans and papitas(fried potatoes), I was excited to bless him and his friend.  I had left the house before he woke up so when I got back,  the mess was still there....I asked him to clean it all up right now so I can start making lunch for myself.   He was just about to get in the shower and said &quot;after my shower&quot;....well it was already late and I couldn&#39;t wait so I asked him to just do it before the shower....&quot;I didn&#39;t make the big mess&quot; he said.  In this case I caught myself feeling a bit resentful that he couldn&#39;t serve me after all I blessed him.  While he was in the shower, I decided to just clean up the mess, but as I thought through all that happened, he was right I did leave a mess.  I was disappointed that he wasn&#39;t willing to just stop and serve me like I stop to serve him.   I chose to recognize that he didn&#39;t ask me to serve him and make a<br/>\n breakfast, that was my choice, I shouldn&#39;t have expected him to clean up the mess, even though it would have been nice.  <br/>\n<br/>\nsometimes it helps when you find others struggle with the same things........I don&#39;t always respond right away the way I should .  It has helped me to recognize when I have false expectations.<br/>\n<br/>\nKeep on serving!  AnaMaria<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":291337950,"authorName":"almadoing","from":"&quot;almadoing&quot; &lt;almadoing@...&gt;","profile":"almadoing","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Ways around resentment?","postDate":"1266613610","msgId":50900,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhsbXVoYSs0dmpxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhsamZsMytidG9vQGVHcm91cHMuY29tPg=="},"prevInTopic":50897,"nextInTopic":50901,"prevInTime":50899,"nextInTime":50901,"topicId":50865,"numMessagesInTopic":0,"msgSnippet":"... Since discovering unschooling two years ago I have had a running commentary going on in my head which is constantly trying to work out what I could have","messageBody":"<div id=\"ygrps-yiv-566318142\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;dvdsn_christine&quot; &lt;ravenmv111@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; It&#39;s not that I want to blame anyone... At times, and not all the time but obviously enough to bother me, I resent that the problem always seems to come back to something I didn&#39;t do or something I didn&#39;t see or can`t figure out. So yes at times I`d like a break from that responsibility but that doesn&#39;t mean I want to throw it on my boys. I want another alternative, a better way of thinking and seeing how to be so that I can make it past this rut because I can feel it holding us back from more fun times. <br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Since discovering unschooling two years ago I have had a running commentary going on in my head which is constantly trying to work out what I could have done better in any given situation. I used to find this inner voice demoralising and exhausting - it seemed critical and made me feel constantly inadequate. After a while though I came to welcome it as a sort of inner guidance on my parental/unschooling quest because in fact this inner voice has been very good for us all. I don&#39;t blame/shame my kids anymore. I now am much better at working out what I could do better. I avoid so many previous pitfalls. Life is so much more harmonious as I do more and more. Now I see that voice more as a supportive friend and guide. <br/>\n<br/>\n<br/>\n<br/>\nAlison<br/>\n(DS7 and DS4)</div>","specialLinks":[]},{"userId":294520986,"authorName":"Joanna","from":"&quot;Joanna&quot; &lt;ridingmom@...&gt;","profile":"ridingmom1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Ways around resentment?","postDate":"1266604137","msgId":50897,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhsbWw5OStmdGljQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhsamZsMytidG9vQGVHcm91cHMuY29tPg=="},"prevInTopic":50891,"nextInTopic":50900,"prevInTime":50896,"nextInTime":50898,"topicId":50865,"numMessagesInTopic":0,"msgSnippet":"I realize now that I ve thought that if a person has their needs consistently met in a pleasant manner that doesn t happen. So the idea that they can be in a","messageBody":"<div id=\"ygrps-yiv-347851467\">&quot;I realize now that I&#39;ve thought that if a person has their needs consistently met in a pleasant manner that doesn&#39;t happen. So the idea that they can be in a bad mood just because they are hasn&#39;t seemed like a possibility. Is it? My automatic reaction has been to give them space because that&#39;s what I do to work out of it when I&#39;m foul. I see now that they probably need the opposite,...&quot; <br/>\n<br/>\nAs your kids grow and differentiate, you&#39;ll probably find that they have different reactions and have different needs.  I know that when my son is sad he needs to talk.  If he&#39;s angry, he wants a few minutes to calm down and then to hash it out right away.  If he goes silent, then that&#39;s not a good thing and he&#39;s shutting down.  My daughter, on the other hand, rarely wants to talk about deep sadness.  If she&#39;s angry, she wants to be left completely alone until she&#39;s not anymore.  Then we can exchange apologies, or strategies about what happened if it&#39;s with someone outside of the family.  They have very different rhythms. <br/>\n<br/>\nOh--another big one around here is that my son has always gotten furious if someone tries to lighten an angry mood with laughter.  He feels trivialized.  My daughter will appreciate it and get silly, at the right time, and it will help to diffuse the situation.<br/>\n<br/>\nSee what works with your kids, and don&#39;t be afraid to do some experimenting.  And see if you can become more of an investigator--observing the &quot;rotten&quot; instead of feeling anything about it at all--guilty, responsible, etc.  Then maybe you can see where you can step in and help the situation.  Maybe take some breaths in the middle of it and quiet your own self rather than plunging ahead with force. <br/>\n<br/>\nIt&#39;s like if someone is angry, and the person they&#39;re angry with gets angry because the first person is angry with them, then you have layers of angry and can&#39;t deal with the situation cleanly--don&#39;t put your layers of emotion on your kids.  Then you become a smother mother, and they&#39;ll eventually feel guilty for upsetting you--rather than getting help from you in sorting their own stuff out.  Do you see the difference?<br/>\n<br/>\nYou owe it to them and yourself to see if you can find a place of neutral--and if you don&#39;t, the other thing that will happen is that they will all fight over you--trying to get you on their side.  And then you&#39;ve got sibling rivalry up the ying yang!  Try to see their interactions as just that--complex interactions between siblings.  It&#39;s hard, sometimes, not to take sides, because sometimes it looks like someone clearly started it--and that could well be the case, but chances are someone else started it the next day, and there is carryover, etc.  I try to call &#39;em like I see &#39;em and suggest ways that they can make things better right now.  Sometimes they take suggestions, and other times they come up with their own ways to work things out.<br/>\n<br/>\nAt my house I have to remember that the day before, it was usually the other one that started it, and today might be some residual from that, etc. etc.  My kids are older and are starting to see that for themselves.  Especially the 14 yo--he&#39;ll stop &quot;negotiations&quot; in the middle, sometimes, and say something like, &quot;O.k., I was annoying her because I was still mad about xyz from the other day.&quot;  And then they resolve that themselves.  I can take less and less of a role.  <br/>\n<br/>\nAnd because I&#39;m rarely invested in these things (I just expect negative stuff to come up, because I know their personalities and where they rub each other the wrong way) understandings can be reached and apologies made without too much fuss.<br/>\n<br/>\nJoanna</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Ways around resentment?","postDate":"1266512600","msgId":50890,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg2OEQzODI3LURDRkQtNDNBRS04NzFCLUU5NTMxMDA5RDQ3RkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDc5YzFkMWI0MTAwMjE4MDcwNnYyNjllMDczNnM0ZmExYTkzNGZlNGFiZWRkQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PGhsaXJtZys4a21iQGVHcm91cHMuY29tPiA8NzQyOTI4LjQwNjQzLnFtQHdlYjUzOTAxLm1haWwucmUyLnlhaG9vLmNvbT4gPDc5YzFkMWI0MTAwMjE4MDcwNnYyNjllMDczNnM0ZmExYTkzNGZlNGFiZWRkQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":50889,"nextInTopic":50891,"prevInTime":50889,"nextInTime":50891,"topicId":50865,"numMessagesInTopic":0,"msgSnippet":"-=- For example, a son wanting to be held vertical all night is a common experience for me as Nisarga often has bouts of gas, and he only prefers vertical and","messageBody":"<div id=\"ygrps-yiv-1273260878\">-=- For example, a son wanting to be held<br/>\nvertical all night is a common experience for me as Nisarga often has  <br/>\nbouts<br/>\nof gas, and he only prefers vertical and in mommy&#39;s arms then. I have  <br/>\nheard<br/>\nmany parents whine about this. I don&#39;t &#39;get it&#39;. I can&#39;t change it. My  <br/>\nsleep<br/>\nis not going to happen. What else is there?-=-<br/>\n<br/>\nSleep in a chair so he can be vertical. &lt;g&gt;<br/>\n<br/>\nThere are almost always more than two options.<br/>\n<br/>\n-=-I can &#39;fool&#39; myself into looking at<br/>\nsomething else that is working.-=-<br/>\n<br/>\nOr you can skip the part where you think of yourself as a fool and a  <br/>\ntrickster or a contortionist, and just look directly at something  <br/>\nthat&#39;s working. &lt;g&gt;<br/>\n<br/>\n-=-I think it works because when I run into a wall of problem,  <br/>\nresentment,<br/>\nfrustration, etc, I prefer to shift to &quot;what&#39;s great about this?&quot; and go<br/>\nright around the wall. It may be denial, but hey, it gets me through<br/>\nsmiling. That&#39;s precious.-=-<br/>\n<br/>\nIt&#39;s not denial at all.<br/>\nIt&#39;s being.  Acceptance.  Joy.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Ways around resentment?","postDate":"1266510115","msgId":50888,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU1NTI2OTk5LTM5M0QtNDJGOC1BRjAzLUUyNjhBMkZCQkY4OEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDE4NGMwMWNhYjBiMyQ1Y2VlYWEyMCQxNmNiZmU2MCRAbmV0Pg==","referencesHeader":"PGhsZ3NqNStmYmZiQGVHcm91cHMuY29tPiA8aGxqZmwzK2J0b29AZUdyb3Vwcy5jb20+IDwxODRjMDFjYWIwYjMkNWNlZWFhMjAkMTZjYmZlNjAkQG5ldD4="},"prevInTopic":50886,"nextInTopic":50889,"prevInTime":50887,"nextInTime":50889,"topicId":50865,"numMessagesInTopic":0,"msgSnippet":"-=- I don t want to go so far as to say be glad when those times happen, but when they do, they do offer opportunity for you and your kids to develop new and","messageBody":"<div id=\"ygrps-yiv-2093250700\">-=- I don&#39;t want to go so<br/>\nfar as to say be glad when those times happen, but when they do, they do<br/>\noffer opportunity for you and your kids to develop new and valuable  <br/>\ninter<br/>\nand intrapersonal skills. -=-<br/>\n<br/>\nThose two terms are usually a reference to &quot;multiple intelligences&quot;  <br/>\nand there are notes here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/intelligences\">http://sandradodd.com/intelligences</a><br/>\n<br/>\nSome families and most schools focus on math and language, use music,  <br/>\nsports and games as &quot;incentives&quot; (extra/dessert), and either ignore or  <br/>\ndiscourage inter-and intrapersonals.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Ways around resentment?","postDate":"1266509145","msgId":50885,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEUyQTQzNDdCLTM4QzAtNEJEMC1CMDkwLUM2OTZGOUM1RjlENUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhsamZsMytidG9vQGVHcm91cHMuY29tPg==","referencesHeader":"PGhsamZsMytidG9vQGVHcm91cHMuY29tPg=="},"prevInTopic":50883,"nextInTopic":50886,"prevInTime":50884,"nextInTime":50886,"topicId":50865,"numMessagesInTopic":0,"msgSnippet":"-=- I want it to be ok to not always be successful at creating a peaceful happy home and not feel like I have failed when things deteriorate and then resent","messageBody":"<div id=\"ygrps-yiv-1014489499\">-=- I want it to be ok to not always be successful at creating a  <br/>\npeaceful happy home and not feel like I have failed when things  <br/>\ndeteriorate and then resent that my efforts aren&#39;t enough.-=-<br/>\n<br/>\nYou can find a thousand women--strangers, in person, online, anywhere-- <br/>\nwho will tell you not to worry if your kids aren&#39;t happy.<br/>\n<br/>\nA large part of the purpose of this list is for parents to find ways  <br/>\nto make their children happy.  It&#39;s a different angle.  I don&#39;t want  <br/>\nto encourage you to slack off and settle for deterioration.<br/>\n<br/>\nIf you &quot;resent&quot; that your efforts aren&#39;t enough instead of backing up  <br/>\nand using different efforts, where are you aiming the resentment?  At  <br/>\nyour kids, I think.<br/>\n<br/>\nIf things are deteriorating socially, emotionally, who else can  <br/>\npossibly have been able to make that better than the mom?  I&#39;m serious.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"&quot;Pam Sorooshian&quot; &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] Re: Ways around resentment?","postDate":"1266508773","msgId":50886,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE4NGMwMWNhYjBiMyQ1Y2VlYWEyMCQxNmNiZmU2MCRAbmV0Pg==","inReplyToHeader":"PGhsamZsMytidG9vQGVHcm91cHMuY29tPg==","referencesHeader":"PGhsZ3NqNStmYmZiQGVHcm91cHMuY29tPiA8aGxqZmwzK2J0b29AZUdyb3Vwcy5jb20+"},"prevInTopic":50885,"nextInTopic":50888,"prevInTime":50885,"nextInTime":50887,"topicId":50865,"numMessagesInTopic":0,"msgSnippet":"... didn t do or something I didn t see or can`t figure out. So yes at times I`d like a break from that responsibility but that doesn t mean I want to throw it","messageBody":"<div id=\"ygrps-yiv-1466617902\"><blockquote><span title=\"ireply\">&gt;&gt; .. I resent that the problem always seems to come back to something I<br/>\n </span></blockquote>didn&#39;t do or something I didn&#39;t see or can`t figure out. So yes at times I`d<br/>\nlike a break from that responsibility but that doesn&#39;t mean I want to throw<br/>\nit on my boys. I want another alternative, a better way of thinking and<br/>\nseeing how to be so that I can make it past this rut&gt;&gt;<br/>\n<br/>\n <br/>\n<br/>\nGot it. So - I think you have the idea that if you are the perfect mom, the<br/>\nkids will be the perfect kids.  When the kids behave badly, it means you<br/>\nscrewed up? This is not how it works - the kids will behave in all kinds of<br/>\nways that aren&#39;t the greatest. They&#39;ll fight. They will be selfish. They&#39;ll<br/>\nbe demanding. They&#39;ll be unhelpful. They&#39;ll be unreasonable and cranky and<br/>\neven mean and sometimes maybe vicious (maybe with words, maybe physically).<br/>\nAll those are predictable and normal in the sense that they are physically,<br/>\nmentally, and emotionally very young. You can&#39;t change that fact of nature<br/>\nby being the most perfect parent in the world. They will go through the<br/>\nprocess of maturing, just like every other person. Your job isn&#39;t to be the<br/>\nperfect parent to avoid the maturing process, your job is to be with them<br/>\nthroughout it, guiding and loving and supporting the best in them, in spite<br/>\nof how they sometimes behave. You can&#39;t make kids just &quot;be&quot; mature - that<br/>\nisn&#39;t possible. <br/>\n<br/>\n <br/>\n<br/>\nAlso, part of your job is to learn along with them. You can&#39;t make sure all<br/>\nthe roads ahead of you will be smooth, but you can learn from each bump in<br/>\nthe road, you can learn how to better avoid the bumps, how to get over them<br/>\nmore easily, how to see them as just a momentary bump and not the whole<br/>\nroad, and how to recover from hitting them.<br/>\n<br/>\n <br/>\n<br/>\nIf things go badly - the kids fight, you yell, things fall apart - that&#39;s<br/>\nsad, but it is also time for you all to learn to recover from the bad.<br/>\nThat&#39;s an important ability, too. Really important. I don&#39;t want to go so<br/>\nfar as to say be glad when those times happen, but when they do, they do<br/>\noffer opportunity for you and your kids to develop new and valuable inter<br/>\nand intrapersonal skills. And, you can expect those opportunities will arise<br/>\n- so maybe don&#39;t be &quot;glad&quot; when they do, but be more accepting that they are<br/>\nto be expected. <br/>\n<br/>\n <br/>\n<br/>\nUnschooling really does, in my experience and observation, result in more<br/>\nharmonious and joyful family lives.  It doesn&#39;t guarantee no difficulties,<br/>\nbut gives us principles to guide us when difficulties arise, so that our<br/>\nlives with our families get better and better, not worse and worse.<br/>\n<br/>\n <br/>\n<br/>\n-pam<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":402609764,"authorName":"Ana Maria Bruce","from":"Ana Maria Bruce &lt;bittersweetanamaria@...&gt;","profile":"bittersweetanamaria","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Ways around resentment?","postDate":"1266508450","msgId":50891,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc3MTg3Ny44OTY3OS5xbUB3ZWIxMTE4MDQubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PDc0MjkyOC40MDY0My5xbUB3ZWI1MzkwMS5tYWlsLnJlMi55YWhvby5jb20+","referencesHeader":"PGhsaXJtZys4a21iQGVHcm91cHMuY29tPiA8NzQyOTI4LjQwNjQzLnFtQHdlYjUzOTAxLm1haWwucmUyLnlhaG9vLmNvbT4="},"prevInTopic":50890,"nextInTopic":50897,"prevInTime":50890,"nextInTime":50892,"topicId":50865,"numMessagesInTopic":0,"msgSnippet":"We are all so different, some of this post hopefully will be an encouragement to someone:  I lived in other countries that gave me a different perspective of","messageBody":"<div id=\"ygrps-yiv-1892511617\">We are all so different, some of this post hopefully will be an encouragement to someone:  I lived in other countries that gave me a different perspective of &quot;mom&#39;s&quot; place in the home.  For one thing, the rich or poor alike seemed to always(generally speaking) have a helper.  Whether it was a mother, mother-in-law, servant, etc.   I just couldn&#39;t get myself to the &quot;justification&quot; of hiring someone to help me.  Afterall &quot;I could handle it myself!&quot; plus I just didn&#39;t get the &quot;servant thing&quot;.  Ha ha, my local friends thought I was crazy that I did everything, and I thought they were too good to do the things that the servant was doing&quot;  At the time I was cleaning our clothes by hand(it was a wonderful challenging experience at the time, including cloth diapers!), All the older women thought my husband was a saint because he helped with everything.  The local men joked that he was being a bad influence on their wives!  We were sweeping mopping<br/>\n tile floors, going to the open market for food;  attachment parenting, etc.  I loved my life overseas and every moment was an adventure and the simplicty of life was an incredible experience. ...but it was him that realized with #2 coming, it would be too much work even for the two of us.  &quot;Why don&#39;t we hire someone?&quot;  I resisted and had to finally admit that I was trying to prove something to myself and others.  <br/>\n<br/>\nI got alot of tips from those early years...that I applied to my life of chores, meals and such in the States if anyone wants to e-mail me privately that help in this busy season with little ones.<br/>\n<br/>\nA support network is important especially if you don&#39;t have local family that is supportive of your lifestyle.  There are so many people that are truly looking to help others.  People like me at 51 that remember the challenges.  Our youngest is 13.  I have found her many opportunities to be a &quot;mother&#39;s helper&quot;, since she was 10 she has been doing this and loves it. Senior citizens are so hungry for relationship as well....I had a lovely neighbor at one point that loved when I sent my little ones to play in her yard with her.  In the early years when I would get together with friends...I started noticing that we would be behind our chores...so I came up with an idea and each time we got together...while the kids were happy playing together we helped with chores in each of our homes...even help prepare dinner together so when I/she left she was ready when hubby came home from work...and he didn&#39;t have to try to figure out why a homemaker is home<br/>\n all day and doesn&#39;t get anything done in the house hee hee!<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":326782993,"authorName":"Vidyut Kale","from":"Vidyut Kale &lt;wide.aware@...&gt;","profile":"vidyutgore","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Ways around resentment?","postDate":"1266505579","msgId":50889,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc5YzFkMWI0MTAwMjE4MDcwNnYyNjllMDczNnM0ZmExYTkzNGZlNGFiZWRkQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDc0MjkyOC40MDY0My5xbUB3ZWI1MzkwMS5tYWlsLnJlMi55YWhvby5jb20+","referencesHeader":"PGhsaXJtZys4a21iQGVHcm91cHMuY29tPgkgPDc0MjkyOC40MDY0My5xbUB3ZWI1MzkwMS5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":50888,"nextInTopic":50890,"prevInTime":50888,"nextInTime":50890,"topicId":50865,"numMessagesInTopic":0,"msgSnippet":"I find that when things get tough, I can fool myself into looking at something else that is working. For example, a son wanting to be held vertical all night","messageBody":"<div id=\"ygrps-yiv-1260828485\">I find that when things get tough, I can &#39;fool&#39; myself into looking at<br/>\nsomething else that is working. For example, a son wanting to be held<br/>\nvertical all night is a common experience for me as Nisarga often has bouts<br/>\nof gas, and he only prefers vertical and in mommy&#39;s arms then. I have heard<br/>\nmany parents whine about this. I don&#39;t &#39;get it&#39;. I can&#39;t change it. My sleep<br/>\nis not going to happen. What else is there? What is there about this<br/>\nsituation that I like? And I suddenly start feeling &quot;what is not to like?<br/>\nThe world is quiet. Everything is at peace, sleeping. Stars outside the<br/>\nwindow, the moon, breeze. My beloved son in my arms, making tiny sounds,<br/>\nwaking briefly to look up at me and falling back to sleep reassured that all<br/>\nis well with his world. No one has paid me such a huge compliment till this<br/>\nguy - that my presence makes their world all right. Baby smell right under<br/>\nmy nose. Soft, limp, finding such peace in my arms as no other place will<br/>\ngive him right now. A whole world open and awake to give me company through<br/>\nmy computer. I can read or work on my website without ANY disturbance (that<br/>\nis near impossible these days). I just EXPERIENCE him in my arms, and enjoy<br/>\nevery minute of it&quot;.<br/>\n<br/>\nI don&#39;t know why I don&#39;t feel any resentment for long, but I am able to<br/>\nlaugh wryly at myself and the situation when I make silly &#39;fuzzy focus&#39;<br/>\ngoofs after two nights like this. I never even tried to force my son to &#39;get<br/>\nused&#39; to anyone else. He wants vertical, and a couple of nights a month, we<br/>\nhave very special nights - just mother and son in an asleep world. Uh...<br/>\nasleep son too, actually. He only wakes if I put him down.<br/>\n<br/>\nI think it works because when I run into a wall of problem, resentment,<br/>\nfrustration, etc, I prefer to shift to &quot;what&#39;s great about this?&quot; and go<br/>\nright around the wall. It may be denial, but hey, it gets me through<br/>\nsmiling. That&#39;s precious.<br/>\n<br/>\nVidyut<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":129999023,"authorName":"John and Amanda Slater","from":"John and Amanda Slater &lt;fourslaterz@...&gt;","profile":"fourslaterz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Ways around resentment?","postDate":"1266504380","msgId":50882,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc0MjkyOC40MDY0My5xbUB3ZWI1MzkwMS5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PGhsaXJtZys4a21iQGVHcm91cHMuY29tPg==","referencesHeader":"PGhsaXJtZys4a21iQGVHcm91cHMuY29tPg=="},"prevInTopic":50881,"nextInTopic":50883,"prevInTime":50881,"nextInTime":50883,"topicId":50865,"numMessagesInTopic":0,"msgSnippet":"make sure your own needs are being met and then it will magically disappear ***** I find meeting all our needs at the same time works best.  Finding the","messageBody":"<div id=\"ygrps-yiv-687332492\">&quot;make sure your own needs are being met and then it will magically disappear&quot; <br/>\n <br/>\n<br/>\n*****<br/>\nI find meeting all our needs at the same time works best.  Finding the activities that we all enjoy and doing more of them.  My boys are 7 and 8.  We might go bowling or roller skating or to a movie or play the wii or jump on the trampoline.  When they were younger it was going to the playground or reading a book or just being in the yard.  While many of these are things I might not choose to do alone, doing them with my kids made them fun.  Knowing we had some fun planned soon, made it easy to get through the rough patches.<br/>\n<br/>\nMy boys do not like to be apart from us, so our focus is on recharging without separating.  <br/>\n<br/>\n<br/>\nAmanda<br/>\nEli 8, Samuel 7<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Ways around resentment?","postDate":"1266504260","msgId":50881,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdCRTRDRkZBLTY0OEQtNDM5Ny04NjJGLTdCNUYyRTFGRThBMUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhsaW43OCtpdGppQGVHcm91cHMuY29tPg==","referencesHeader":"PGhsaW43OCtpdGppQGVHcm91cHMuY29tPg=="},"prevInTopic":50879,"nextInTopic":50882,"prevInTime":50880,"nextInTime":50882,"topicId":50865,"numMessagesInTopic":0,"msgSnippet":"-=This is great! I too have learned to let go of the mindset that a certain household task needs to be done right now. So what if the wet washing sits in the","messageBody":"<div id=\"ygrps-yiv-1604967212\">-=This is great! I too have learned to let go of the mindset that a  <br/>\ncertain household task needs to be done right now. So what if the wet  <br/>\nwashing sits in the basket for a few hours! I&#39;d much rather have fun  <br/>\nwith the kids playing dinosaurs.-=-<br/>\n<br/>\nIf they&#39;ve watched Land Before Time movies, you could all go on a  <br/>\nquest (take a dinosaur with you, each of you, or two...) and move all  <br/>\nthose (wet cloth) boulders, quickly, before it&#39;s too late!!  And have  <br/>\nthe dinosaurs climb up on that (square metal) mountain and sit.  And  <br/>\nwhen you turn the dryer on, &quot;EARTHSHAKE!!!!&quot; and you can grab up the  <br/>\ndinosaurs and run back to where you were playing.<br/>\n<br/>\nClaire also wrote:  &quot;Resentment comes from a feeling of powerlessness.  <br/>\n From your post it sounds like you feel trapped in this huge web of  <br/>\nresponsibility for 3 young kids. Turn away from the mindset of burdens  <br/>\nand heaviness and instead choose to be playful and loving. Resentment  <br/>\nfades in the face of powerful choices.&quot;<br/>\n<br/>\nThat&#39;s big.  That&#39;s central.  You don&#39;t &quot;have to&quot; take care of your  <br/>\nkids.  Think of it as a &quot;get to,&quot; and it&#39;s the sunny side of the same  <br/>\ncoin, it&#39;s &quot;just semantics,&quot; some will say, but what it is is a whole  <br/>\ndifferent side of your biochemistry.  Relief, not resentment.   <br/>\nGratitude, not anger.<br/>\n<br/>\n<br/>\nOne more thing.  Although it seems the fashion in the greater &quot;radical  <br/>\nunschooling community&quot; for people to lift the words of others  <br/>\nuncredited and claim to know things they&#39;re only reciting....    I  <br/>\nneed to credit this:  &quot; I remember Sandra&#39;s wise words - &#39;there are no  <br/>\nbad days, only bad moments&#39;.&quot;   I need to, but I don&#39;t remember who  <br/>\nfirst brought that fantastic, perfect tool to an unschooling  <br/>\ndiscussion years ago.  I&#39;ve kept it polished and at hand, but when I  <br/>\nsay that, I&#39;m lifting the words of someone whose name I should have  <br/>\nkept.<br/>\n<br/>\nI didn&#39;t know that some of the coolest writers and happiest moms  <br/>\nwouldn&#39;t stay around forever helping other unschoolers. &lt;bwg&gt;<br/>\nNow I know that.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":119677098,"authorName":"dvdsn_christine","from":"&quot;dvdsn_christine&quot; &lt;ravenmv111@...&gt;","profile":"dvdsn_christine","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Ways around resentment?","postDate":"1266500067","msgId":50883,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhsamZsMytidG9vQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhsZ3NqNStmYmZiQGVHcm91cHMuY29tPg=="},"prevInTopic":50882,"nextInTopic":50885,"prevInTime":50882,"nextInTime":50884,"topicId":50865,"numMessagesInTopic":0,"msgSnippet":"-=Do you mean you resent feeling that you could make the situation better? You would rather blame them?=- It s not that I want to blame anyone.  I want it to","messageBody":"<div id=\"ygrps-yiv-1367035909\">-=Do you mean you resent feeling that you could make the situation better?<br/>\nYou would rather blame them?=-<br/>\n<br/>\nIt&#39;s not that I want to blame anyone.  I want it to be ok to not always be successful at creating a peaceful happy home and not feel like I have failed when things deteriorate and then resent that my efforts aren&#39;t enough. At times, and not all the time but obviously enough to bother me, I resent that the problem always seems to come back to something I didn&#39;t do or something I didn&#39;t see or can`t figure out. So yes at times I`d like a break from that responsibility but that doesn&#39;t mean I want to throw it on my boys. I want another alternative, a better way of thinking and seeing how to be so that I can make it past this rut because I can feel it holding us back from more fun times. If I wanted it to be their fault I&#39;d just blame them and be done with it but that wouldn&#39;t get us anywhere in the long run and would be detrimental to our relationship which is not a goal. <br/>\n<br/>\n-=Maybe keeping the house clean isn&#39;t hanging you up--maybe it&#39;s keeping the<br/>\nemotions clean. :-) <br/>\nYou might be taking on too much responsibility, in a sense, that isn&#39;t really<br/>\nyour job, and then feeling guilty and overwhelmed when things don&#39;t work out<br/>\nright. I&#39;m not sure if I can explain myself very well, but I as I ponder the<br/>\nabove statement I get the feeling that you are spinning your wheels trying to<br/>\nmake sure everyone stays happy all the time--like there is a state of<br/>\n&quot;perfection&quot; that is a delicate balance, and if anyone tips any one way too far,<br/>\nthen something will break and it will be all your fault. Like keeping all the<br/>\nplates spinning at the same time.=-<br/>\n<br/>\nThis is it *exactly*. I let go of a tidy house a while ago, I clean it when and because I enjoy a space where the kids and I can find things and aren&#39;t stepping on them and breaking them. Not because it&#39;s what I&#39;m supposed to do (although that voice isn&#39;t totally gone it&#39;s appearance is a warning that I need to recenter my focus and evaluate just what is important like others have said). I do feel that making sure everyone is as happy as possible is my job as their mom and that&#39;s where I&#39;m having problems seeing just where to draw the line.<br/>\n<br/>\n-=Maybe your job isn&#39;t really to do that. Maybe your job is more like the person<br/>\nhelping someone to learn to spin their plate. When the plate falls you can help<br/>\nthem figure out why--but you don&#39;t have to scurry around trying to catch it and<br/>\nmake sure nothing gets broken. I&#39;m sure there&#39;s some saying in Chinese that<br/>\nmeans that in order to learn to spin plates, you have to break a few. &lt;g&gt;=-<br/>\n<br/>\nI&#39;ve never thought of it in quite those terms. It&#39;s frustrating when I&#39;ve gone through the list of needs that I can think of and they&#39;re still grumpy (which is what I had in mind when I used the word rotten, when they&#39;re in a foul mood and lashing out because of it.) Sometimes I&#39;m rotten and there doesn&#39;t seem to be a reason for why I feel that way; I realize now that I&#39;ve thought that if a person has their needs consistently met in a pleasant manner that doesn&#39;t happen. So the idea that they can be in a bad mood just because they are hasn&#39;t seemed like a possibility. Is it? My automatic reaction has been to give them space because that&#39;s what I do to work out of it when I&#39;m foul. I see now that they probably need the opposite, looking back I think we&#39;ve done that by accident in the past it just never clicked that it might be a tool to really help and the thing to do first.<br/>\n<br/>\n-=I&#39;ve only found that I then put MORE focus on &quot;meeting<br/>\nmy needs,&quot; which might mean more &quot;me&quot; time, etc. And then I feel like I have<br/>\neven less and there&#39;s less to go around. It has the opposite effect. =-<br/>\n<br/>\nThis has been my experience as well so thus far I have been thinking I&#39;m either doing it wrong or just haven&#39;t found the thing that I really enjoy. Not that I focus on one right way to do things but there are things I definitely want not to do. Hence the reaching out to have my horizons pried open for a better perspective as uncomfortable as that may be.<br/>\n<br/>\nThank you for every response they&#39;ve all given me a lot to reflect on and to keep thinking about. I will look at the links that were posted and look for that thread I missed. To respond to some other questions that were asked of me.<br/>\n<br/>\nThe boys do have a lot of physical energy and we don&#39;t have a play set outside but we do have a climber and slides in the house as well as just goofing off and wrestling. Our house has a route for them to ride their toys and scooter around the downstairs like a race track, running laps chasing each other is a favorite as well, so they do get a lot of their wiggles out even when we can&#39;t get outside. Even with all that it does get a bit overwhelming for me at times with the noise and I think it can get to them too. We&#39;re moving in a few weeks and the new house will have more spaces for people to go have quiet, I think that might help as well.<br/>\n<br/>\nI do know several other unschooling families in the area but really only get to see one in action. I&#39;m working on getting to know more as there are many in our area. <br/>\n<br/>\n-=Turn away from the mindset of burdens and heaviness and instead choose to be playful and loving. Resentment fades in the face of powerful choices.=-<br/>\n<br/>\nIt helps to have the idea in these words, thank you for them.</div>","specialLinks":[]},{"userId":294520986,"authorName":"Joanna","from":"&quot;Joanna&quot; &lt;ridingmom@...&gt;","profile":"ridingmom1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Ways around resentment?","postDate":"1266479632","msgId":50878,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhsaXJtZys4a21iQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhsZ3NqNStmYmZiQGVHcm91cHMuY29tPg=="},"prevInTopic":50877,"nextInTopic":50879,"prevInTime":50877,"nextInTime":50879,"topicId":50865,"numMessagesInTopic":0,"msgSnippet":"... These aren t the only two choices.  I ve been thinking about what you said here, and what I keep thinking is that you are either blaming them for the","messageBody":"<div id=\"ygrps-yiv-307395351\"><blockquote><span title=\"ireply\">&gt;&quot; Sometimes I just want them to be acting like rotten kids because they&#39;re rotten kids not because I didn&#39;t figure out a need that therefore wasn&#39;t met.&quot;<br/>\n<br/>\n </span></blockquote>These aren&#39;t the only two choices.  I&#39;ve been thinking about what you said here, and what I keep thinking is that you are either blaming them for the &quot;rotten&quot; moments, or you&#39;re blaming yourself for not having prevented them.  Somewhere outside of that is just living with each other, which has its good times and its bad times.  Sure, we work to minimize the bad--go through the checklist of hungry, tired, needs sleep, needs..., but maybe there&#39;s some room in your &quot;mental arsenal&quot; to let go of needing to control the emotional life in your house.  Some of the most beautiful moments between my two have come about because of a fight.  And sometimes someone has to wait way longer than they would like because I was already helping someone else--but they also get the security of knowing that when it&#39;s their turn, they&#39;ll have my attention.<br/>\n<br/>\nMaybe keeping the house clean isn&#39;t hanging you up--maybe it&#39;s keeping the emotions clean.  :-)<br/>\n<br/>\nYou might be taking on too much responsibility, in a sense, that isn&#39;t really your job, and then feeling guilty and overwhelmed when things don&#39;t work out right.  I&#39;m not sure if I can explain myself very well, but I as I ponder the above statement I get the feeling that you are spinning your wheels trying to make sure everyone stays happy all the time--like there is a state of &quot;perfection&quot; that is a delicate balance, and if anyone tips any one way too far, then something will break and it will be all your fault.  Like keeping all the plates spinning at the same time.  <br/>\n<br/>\nMaybe your job isn&#39;t really to do that.  Maybe your job is more like the person helping someone to learn to spin their plate.  When the plate falls you can help them figure out why--but you don&#39;t have to scurry around trying to catch it and make sure nothing gets broken.  I&#39;m sure there&#39;s some saying in Chinese that means that in order to learn to spin plates, you have to break a few.  &lt;g&gt;<br/>\n<br/>\n &quot;make sure your own needs are being met and then it will magically disappear&quot; <br/>\n<br/>\nMeeting my own needs has never helped my kids.  I think the idea is that then mom will be happier and be in a better position to help her kids, but I&#39;ve never found that to be true.  I&#39;ve only found that I then put MORE focus on &quot;meeting my needs,&quot; which might mean more &quot;me&quot; time, etc.  And then I feel like I have even less and there&#39;s less to go around.  It has the opposite effect.  I like Pam&#39;s advice--put more energy into the thing that can REALLY pay back--your relationships with your kids.  When I&#39;m cranky, they&#39;re more cranky.  When I muster more sweetness, I get back more sweetness.  <br/>\n<br/>\nJoanna<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nSo for those of you who have made it past this, if in fact you&#39;ve ever been at this stage, what are some things that help you get your mind back in a place of understanding instead of reaction. I&#39;ve read what&#39;s written on websites and blogs etc. but haven&#39;t been able to find anything that really speaks to me on this point. <br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; For background on what our house looks like, we started out with attachment parenting which has morphed into unschooling as they&#39;ve aged. We don&#39;t restrict things but I do point out if what they&#39;re choosing to do is disrespectful of others and give them alternatives, like playing loud games when someone else has chosen to go to bed. The oldest is getting to a point where he will come up with his own alternatives as well. I know that they didn&#39;t choose to be here, or to be so many so close together, that I&#39;m the mom and this is my role; I&#39;m just looking for tools to help me be better at it. Maybe this is just a matter of not getting burned out but I&#39;d like to hear if there&#39;s another answer out there aside from, &quot;make sure your own needs are being met and then it will magically disappear&quot; which is the advice I&#39;ve gotten so far from another RUer and I do the best I can with that but there are only so many hours in a day and so much energy in this body. So I&#39;d like to see if there are any other approaches. <br/>\n&gt; <br/>\n&gt; Thank you for your time.<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":363518215,"authorName":"Claire","from":"&quot;Claire&quot; &lt;claire.horsley08@...&gt;","profile":"claire.horsley08","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Ways around resentment?","postDate":"1266475048","msgId":50877,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhsaW43OCtpdGppQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhsaG1mYStibXVyQGVHcm91cHMuY29tPg=="},"prevInTopic":50873,"nextInTopic":50878,"prevInTime":50876,"nextInTime":50878,"topicId":50865,"numMessagesInTopic":0,"msgSnippet":"... This is great!  I too have learned to let go of the mindset that a certain household task needs to be done right now.  So what if the wet washing sits in","messageBody":"<div id=\"ygrps-yiv-1213450839\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Erika&quot; &lt;ejcmassage@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I stop take a breath, look at them, and decide what I need to do to &gt;&gt;make the situation better. <br/>\n<br/>\n<br/>\n </span></blockquote>This is great!  I too have learned to let go of the mindset that a certain household task needs to be done right now.  So what if the wet washing sits in the basket for a few hours!  I&#39;d much rather have fun with the kids playing dinosaurs.  Because the mood of our house is generally peaceful and I am generally available, on those few occasions when I am struggling a bit, I find I can take a quick break - a quick recharge as Jenny put it, and it&#39;s enough to dissipate any negative feelings building in me.<br/>\n<br/>\nAlso, the computer is in the same room as the tv, so if the kids are watching something I can be right with them and even half-watching while also getting online (like I am right now!).<br/>\n<br/>\nWith 3 boys aged 5 and under, I can imagine that their energy levels are high.  Do you have an outdoor play space at your house? Most boys I know of that age are very active and enjoy spending quite a bit of time outside. Sometimes it&#39;s not a matter of coming up with ways to &#39;meet everyone&#39;s needs&#39;, but rather not to block the natural expression of their energy and interests.<br/>\n<br/>\nDo you regularly meet up with other unschooling families? With your husband away a lot, is there a way to spend time with other adults while the kids play?<br/>\n<br/>\nI have truly found that over time, actively being calm, loving and present with my kids, has changed me inside. I don&#39;t feel the same anger I used to feel. When the kids are fighting or both in tears, I remember Sandra&#39;s wise words - &#39;there are no bad days, only bad moments&#39;. I comfort my kids and hold them close. Then in 5 minutes the fight is all forgotten and we are having fun again.<br/>\n<br/>\nResentment comes from a feeling of powerlessness. From your post it sounds like you feel trapped in this huge web of responsibility for 3 young kids. Turn away from the mindset of burdens and heaviness and instead choose to be playful and loving. Resentment fades in the face of powerful choices.<br/>\n<br/>\nClaire</div>","specialLinks":[]},{"userId":430148316,"authorName":"Joy","from":"Joy &lt;whatismyusername@...&gt;","profile":"whatismyusername@ymail.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Ways around resentment?","postDate":"1266469917","msgId":50879,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk3NjQ4Mi43MDE3My5xbUB3ZWIxMTQwMDcubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":50878,"nextInTopic":50881,"prevInTime":50878,"nextInTime":50880,"topicId":50865,"numMessagesInTopic":0,"msgSnippet":"I feel the same way about pam s response. Instead of pulling away from my kids I tried to join in whatever they were doing and all of us had a great time. The","messageBody":"<div id=\"ygrps-yiv-396712307\">I feel the same way about pam&#39;s response. Instead of pulling away from my kids I tried to join in whatever they were doing and all of us had a great time. The main change was to put other things aside and make the children top top priority. The end result is everybody happy and I also get 80% of the things done. The other 20% unfinished is ok. For example no big deal if I didn&#39;t make the bed or whatever. <br/>\n<br/>\nI wish I had 25 hours a day and realized nothing would change since I would just add more things on the list. After that realization I truly understand how to slow down: cut down my to do list. <br/>\n<br/>\nJoy ds 4.25 dd 1.25<br/>\n<br/>\nSent from my iPhone<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Feb 17, 2010, at 3:18 PM, &quot;Erika&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ejcmassage@...\">ejcmassage@...</a>&gt; wrote:<br/>\n<br/>\nI have a 3 year old and a 5 month old, and have been feeling very similar lately. Resentful that I can&#39;t do the things I &quot;need&quot; to, and all around burnt out.<br/>\n<br/>\nI kept thinking I needed some alone time or a mom&#39;s night out, but then I would think &quot;and then what?&quot; I&#39;d be okay for a day or two and then I&#39;d feel the same way again.<br/>\n<br/>\nThen Pam wrote a wonderful post here (I wish I had time to look for it, it was a few weeks ago that she posted it), that suggested when a mom is feeling burnt out to do more. Turn towards your kids and do something more for them. And I had an &quot;ah ha&quot; moment! The dishes do not need me, the laundry doesn&#39;t need me, my kids do! I was feeling resentful because I was resisting my childrens needs, and making other things (my to-do list) more important that moment than them.<br/>\n<br/>\nWhat I&#39;m trying to do now, is when I feel that resistance building, when they start to need me at the &quot;wrong&quot; time, and I&#39;m feeling the &quot;will you just let me finish/do this&quot; creep in; I stop take a breath, look at them, and decide what I need to do to make the situation better. So far my kids have always been the key to making the situation better; doing the dishes, sweeping, cleaning etc. hasn&#39;t. <br/>\n<br/>\n~Erika<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":305807807,"authorName":"Erika","from":"&quot;Erika&quot; &lt;ejcmassage@...&gt;","profile":"ejcmassage","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Ways around resentment?","postDate":"1266441514","msgId":50873,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhsaG1mYStibXVyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhsZ3NqNStmYmZiQGVHcm91cHMuY29tPg=="},"prevInTopic":50871,"nextInTopic":50877,"prevInTime":50872,"nextInTime":50874,"topicId":50865,"numMessagesInTopic":0,"msgSnippet":"I have a 3 year old and a 5 month old, and have been feeling very similar lately.  Resentful that I can t do the things I need to, and all around burnt out. ","messageBody":"<div id=\"ygrps-yiv-706606797\">I have a 3 year old and a 5 month old, and have been feeling very similar lately.  Resentful that I can&#39;t do the things I &quot;need&quot; to, and all around burnt out.<br/>\n<br/>\nI kept thinking I needed some alone time or a mom&#39;s night out, but then I would think &quot;and then what?&quot;  I&#39;d be okay for a day or two and then I&#39;d feel the same way again.<br/>\n<br/>\nThen Pam wrote a wonderful post here (I wish I had time to look for it, it was a few weeks ago that she posted it), that suggested when a mom is feeling burnt out to do more.  Turn towards your kids and do something more for them.  And I had an &quot;ah ha&quot; moment! The dishes do not need me, the laundry doesn&#39;t need me, my kids do!  I was feeling resentful because I was resisting my childrens needs, and making other things (my to-do list) more important that moment than them.<br/>\n<br/>\nWhat I&#39;m trying to do now, is when I feel that resistance building, when they start to need me at the &quot;wrong&quot; time, and I&#39;m feeling the &quot;will you just let me finish/do this&quot; creep in; I stop take a breath, look at them, and decide what I need to do to make the situation better.  So far my kids have always been the key to making the situation better; doing the dishes, sweeping, cleaning etc. hasn&#39;t. <br/>\n<br/>\n~Erika</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Ways around resentment?","postDate":"1266437156","msgId":50871,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMzMjEyMi44OTUyMC5xbUB3ZWIxMTA0MDIubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PGhsZ3NqNStmYmZiQGVHcm91cHMuY29tPg==","referencesHeader":"PGhsZ3NqNStmYmZiQGVHcm91cHMuY29tPg=="},"prevInTopic":50869,"nextInTopic":50873,"prevInTime":50870,"nextInTime":50872,"topicId":50865,"numMessagesInTopic":0,"msgSnippet":"***Maybe this is just a matter of not getting burned out but I d like to hear if there s another answer out there aside from, make sure your own needs are","messageBody":"<div id=\"ygrps-yiv-1093946354\">***Maybe this is just a matter of not getting burned out but I&#39;d like to hear if there&#39;s another answer out there aside from, &quot;make sure your own needs are being met and then it will magically disappear&quot; which is the advice I&#39;ve gotten so far from another RUer and I do the best I can with that but there are only so many hours in a day and so much energy in this body. So I&#39;d like to see if there are any other approaches. ***<br/>\n<br/>\nWhat I&#39;ve done, is to acknowledge my discomfort and be at peace with it.  If I&#39;m tired I will let everyone know that I&#39;m getting really tired and that I&#39;m going to do my very best to not be cranky, but to please be gentle with me so that it&#39;ll be easier for me to stay calm and peaceful while I&#39;m tired.  If I know that I&#39;m not likely to be &quot;off&quot; duty with mom stuff, for a good while, I may take a quick 10 min breather by myself to be at peace and put things in perspective.  It&#39;s like a quick charge on your cell phone that you forgot to charge, but you&#39;ve got to leave the house in 10 min and you need the phone with you.  That charge will last long enough to get to a place to charge it for real.<br/>\n<br/>\nIt helps, while in my quick recharge mode, to think about what I can bring back to the &quot;table&quot;.  Sometimes I&#39;ll remember something that I stashed away for later, or I&#39;ll grab the stash of markers and paper and scissors, or I&#39;ll bring a fun little snack, or an interesting thing to touch and play with.  So, I&#39;m like a &quot;new&quot; mom with a &quot;new&quot; idea, and already the house is more peaceful because I&#39;m more peaceful and whatever new idea I&#39;ve brought, will likely allow more peace for me too, as it redirects kid energy.<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Ways around resentment?","postDate":"1266424914","msgId":50869,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgzQUFEQ0U1LTMwMUYtNDVENC1CMzA0LTdDN0ExMjkwNTY1RUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDg5NjAyMy44MjE2My5xbUB3ZWI1MzkwNS5tYWlsLnJlMi55YWhvby5jb20+","referencesHeader":"PGhsZ3NqNStmYmZiQGVHcm91cHMuY29tPiA8ODk2MDIzLjgyMTYzLnFtQHdlYjUzOTA1Lm1haWwucmUyLnlhaG9vLmNvbT4="},"prevInTopic":50868,"nextInTopic":50871,"prevInTime":50868,"nextInTime":50870,"topicId":50865,"numMessagesInTopic":0,"msgSnippet":"THIS IS AWESOME: Thinking about my situation honestly helps. I ask my husband Why isn t there a government program that would take these kids off my hands for","messageBody":"<div id=\"ygrps-yiv-350759315\">THIS IS AWESOME:<br/>\n<br/>\nThinking about my situation honestly helps. I ask my husband &quot;Why  <br/>\nisn&#39;t there a government program that would take these kids off my  <br/>\nhands for a few hours a day?&quot;<br/>\n<br/>\nOf course there is. They send 6 buses past my house everyday!  <br/>\nRemembering that I am choosing to spend this much time with my kids  <br/>\nhelps.<br/>\n<br/>\nAmanda<br/>\nEli 8, Samuel 7<br/>\n------------------------------------------------------<br/>\n<br/>\nTHAT is the kind of choice that changes lives.  Having choices.   <br/>\nSeeing we&#39;ve made them.<br/>\n<br/>\nNot living out of fear or avoidance or &quot;have to,&quot; but out of &quot;could&quot;  <br/>\nand &quot;didn&#39;t have to&quot; and &quot;chose to.&quot;<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":129999023,"authorName":"John and Amanda Slater","from":"John and Amanda Slater &lt;fourslaterz@...&gt;","profile":"fourslaterz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Ways around resentment?","postDate":"1266420557","msgId":50868,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg5NjAyMy44MjE2My5xbUB3ZWI1MzkwNS5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PGhsZ3NqNStmYmZiQGVHcm91cHMuY29tPg==","referencesHeader":"PGhsZ3NqNStmYmZiQGVHcm91cHMuY29tPg=="},"prevInTopic":50867,"nextInTopic":50869,"prevInTime":50867,"nextInTime":50869,"topicId":50865,"numMessagesInTopic":0,"msgSnippet":"Thinking about my situation honestly helps.  I ask my husband Why isn t there a government program that would take these kids off my hands for a few hours a","messageBody":"<div id=\"ygrps-yiv-1335337455\">Thinking about my situation honestly helps.  I ask my husband &quot;Why isn&#39;t there a government program that would take these kids off my hands for a few hours a day?&quot;  <br/>\n<br/>\nOf course there is.  They send 6 buses past my house everyday!  Remembering that I am choosing to spend this much time with my kids helps.<br/>\n<br/>\n<br/>\nAmanda<br/>\nEli 8, Samuel 7<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Ways around resentment?","postDate":"1266419157","msgId":50867,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PERGQThFRDcyLTkwRDQtNDk2NC1BQzQ2LUY3Q0E1NzBEQTUxMkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhsZ3NqNStmYmZiQGVHcm91cHMuY29tPg==","referencesHeader":"PGhsZ3NqNStmYmZiQGVHcm91cHMuY29tPg=="},"prevInTopic":50865,"nextInTopic":50868,"prevInTime":50866,"nextInTime":50868,"topicId":50865,"numMessagesInTopic":0,"msgSnippet":"-=-Sometimes I just want them to be acting like rotten kids because they re rotten kids not because I didn t figure out a need that therefore wasn t met.-=- Do","messageBody":"<div id=\"ygrps-yiv-1945684080\">-=-Sometimes I just want them to be acting like rotten kids because  <br/>\nthey&#39;re rotten kids not because I didn&#39;t figure out a need that  <br/>\ntherefore wasn&#39;t met.-=-<br/>\n<br/>\nDo you mean you resent feeling that you could make the situation better?<br/>\nYou would rather blame them?<br/>\n<br/>\nIt seemed harsh, the &quot;rotten kids&quot; statement, so I wondered if you  <br/>\ncould rephrase it.<br/>\n<br/>\n-=-So for those of you who have made it past this, if in fact you&#39;ve  <br/>\never been at this stage, what are some things that help you get your  <br/>\nmind back in a place of understanding instead of reaction. I&#39;ve read  <br/>\nwhat&#39;s written on websites and blogs etc. but haven&#39;t been able to  <br/>\nfind anything that really speaks to me on this point. -=-<br/>\n<br/>\nHolly was just five when Keith took a temporary six month assignment  <br/>\nin Minneapolis.  That turned gradually into four years.  He was home  <br/>\none week a month.  I had the three kids.<br/>\n<br/>\nUnschooling is what will save you, I think.  Living by principles and  <br/>\nhaving learning and joy be priorities.<br/>\n<br/>\n-=-I know that they didn&#39;t choose to be here, or to be so many so  <br/>\nclose together, that I&#39;m the mom and this is my role; I&#39;m just looking  <br/>\nfor tools to help me be better at it.-=-<br/>\n<br/>\nSometimes what makes it hard is the mom wanting to clean house first  <br/>\nand be with kids later.  Sometimes it&#39;s the mom having the voices in  <br/>\nher head about what children SHOULD be, want, do, and what women  <br/>\nSHOULD be, want, do, instead of accepting her own children as the  <br/>\nwhole people they are.  Your kids aren&#39;t &quot;just kids.&quot;  They&#39;re the  <br/>\nsweet, early stages of men.  What you do will matter to them, their  <br/>\nfuture friends, possible wives, potential children.  Take that  <br/>\nseriously, and also take it lightly.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/playing\">http://sandradodd.com/playing</a><br/>\n<br/>\n-=-I&#39;d like to hear if there&#39;s another answer out there aside from,  <br/>\n&quot;make sure your own needs are being met and then it will magically  <br/>\ndisappear&quot; which is the advice I&#39;ve gotten so far from another RUer -=-<br/>\n<br/>\nI&#39;ll trade you a TON of better answers in exchange for you not using  <br/>\n&#39;RUer&#39; on this list.  Use &quot;unschooling&quot; or &quot;parenting&quot; but let&#39;s not  <br/>\nnounify or verbitize unnecessarily.  Plain English will help with  <br/>\nclear thinking.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/parentingpeacefully\">http://sandradodd.com/parentingpeacefully</a><br/>\n<br/>\nThere&#39;s a sound file, a conference presentation down there.  You can  <br/>\nlisten to it either from your computer or from one of the links below  <br/>\nthere, I hope.  Lots of people say they&#39;ve been helped by those ideas.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/being\">http://sandradodd.com/being</a><br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":119677098,"authorName":"dvdsn_christine","from":"&quot;dvdsn_christine&quot; &lt;ravenmv111@...&gt;","profile":"dvdsn_christine","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Ways around resentment?","postDate":"1266415013","msgId":50865,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhsZ3NqNStmYmZiQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":50867,"prevInTime":50864,"nextInTime":50866,"topicId":50865,"numMessagesInTopic":0,"msgSnippet":"I m the mother to three amazing boys, the oldest just turned 5 and the youngest are twins, they turn 3 tomorrow. I m having a problem of hitting patches of","messageBody":"<div id=\"ygrps-yiv-1142975192\">I&#39;m the mother to three amazing boys, the oldest just turned 5 and the youngest are twins, they turn 3 tomorrow. I&#39;m having a problem of hitting patches of time where I resent that I always have to be the one to figure out everyone&#39;s needs and see that they&#39;re met. My husband has an erratic schedule and is only home about 3 hours a day and then is gone for a week or two every other month or so. When he&#39;s here he&#39;s wonderfully supportive but most of the time I&#39;m parenting solo. <br/>\n<br/>\nSometimes I just want them to be acting like rotten kids because they&#39;re rotten kids not because I didn&#39;t figure out a need that therefore wasn&#39;t met. So for those of you who have made it past this, if in fact you&#39;ve ever been at this stage, what are some things that help you get your mind back in a place of understanding instead of reaction. I&#39;ve read what&#39;s written on websites and blogs etc. but haven&#39;t been able to find anything that really speaks to me on this point. <br/>\n<br/>\nFor background on what our house looks like, we started out with attachment parenting which has morphed into unschooling as they&#39;ve aged. We don&#39;t restrict things but I do point out if what they&#39;re choosing to do is disrespectful of others and give them alternatives, like playing loud games when someone else has chosen to go to bed. The oldest is getting to a point where he will come up with his own alternatives as well. I know that they didn&#39;t choose to be here, or to be so many so close together, that I&#39;m the mom and this is my role; I&#39;m just looking for tools to help me be better at it. Maybe this is just a matter of not getting burned out but I&#39;d like to hear if there&#39;s another answer out there aside from, &quot;make sure your own needs are being met and then it will magically disappear&quot; which is the advice I&#39;ve gotten so far from another RUer and I do the best I can with that but there are only so many hours in a day and so much energy in this body. So I&#39;d like to see if there are any other approaches. <br/>\n<br/>\nThank you for your time.</div>","specialLinks":[]}],"prevTopicId":51066,"nextTopicId":51111}}