{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":84504749,"authorName":"Suzanne Ackerson","from":"&quot;Suzanne Ackerson&quot; &lt;sylvanv@...&gt;","profile":"sylvanv","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Sibling seperation and HSing families","postDate":"1042486026","msgId":54780,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNGYwMWMyYmIzOSRjMjY0YTE2MCQyNzJiMTc0NEBtc2hvbWUubmV0Pg==","referencesHeader":"PDEwNDIzMzgwMDMuMTM4OS42ODY4MC5tMTBAeWFob29ncm91cHMuY29tPiA8MDAyNzAxYzJiOWViJGI5N2JkOWYwJGY1OGYzNTE4QGRpbm5pbmdyb29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":54779,"nextInTime":54781,"topicId":54780,"numMessagesInTopic":0,"msgSnippet":"Brenda Rose, Thanks so much for you suggestions on keeping the siblings close when the oldest moves away. There are so many really neat things about having a","messageBody":"<div id=\"ygrps-yiv-802924060\">Brenda Rose,<br/>\n<br/>\nThanks so much for you suggestions on keeping the siblings close when the oldest moves away.  <br/>\n<br/>\nThere are so many really neat things about having a grown up son and young ones at home.  It sure helps give some perspective on what kids go through growing up and that maturity is simply inevitable.  When I look at my 21 year old, whatever tough times he had growing up seem to melt right out of my memory.  He is truly a terrific young man.  <br/>\n<br/>\nYour &quot;kids&quot; seem to be very close too.  Although a mixture of eclectic and unschooling has worked for us, with different kids and at different times,  I think the most important thing is the simple fact that we are all together and love and respect one another.  This can occur with many different homeschooling styles.  I imagine there are as many styles as there are families.  <br/>\n<br/>\nThanks again,<br/>\nSuzanne<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: Brenda Rose <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a> <br/>\n  Sent: Saturday, January 11, 2003 9:35 PM<br/>\n  Subject: [Unschooling-dotcom] Going to Japan/Sibling Separation<br/>\n<br/>\n<br/>\n  Suzanne,<br/>\n<br/>\n  Even though two of my kids are married and the third is away at college, so<br/>\n  far no one has gone &quot;really far away.&quot;  My 22 yod lives about ten miles from<br/>\n  us.  My 24 yos was away at college (4 hour drive) for one year, then came<br/>\n  back home.  When he got married he lived 20 miles, then 50 miles, and, as of<br/>\n  last April, now 200 miles away.  What is neat is that he is going to grad<br/>\n  school in the same town his 20yos is at college, so even tho she is in a<br/>\n  dorm, they are there for each other.  And she will get to play with the baby<br/>\n  a lot more than I will when it comes (due in Feb.).<br/>\n<br/>\n  All of my kids are close, and there is great excitement when one of the big<br/>\n  ones calls or comes home.  The 20yo just went back to school yesterday.  We<br/>\n  already miss her!  But I think it helps that the 3 boys have each other to<br/>\n  play with ( and fight with) so at least they don&#39;t feel alone.  Also, even<br/>\n  though their big brother is far (we see him about every 2 months or more)<br/>\n  they like their BIL just about as much.  He plays with them and they model<br/>\n  after him (wear caps the same way, etc.).  They see him every 1-2 weeks.<br/>\n<br/>\n  We all stay in touch, but are also very independent.  We&#39;ve never called or<br/>\n  visited daily like some families.  When the two got married, we wanted to<br/>\n  give them their space.  We only go over to visit when invited, no drop ins.<br/>\n  Both my DIL and my dd have told me they appreciate that.  The other mothers<br/>\n  are a bit different - there more often, not always invited, and not always<br/>\n  appreciated when they just &quot;stop by.&quot;  But if any of us needs anything - to<br/>\n  talk, money, a favor, whatever - we&#39;re all there for each other and we all<br/>\n  know it.  The younger boys see that, too.<br/>\n<br/>\n  How long will son #1 be gone?  That might make a difference in how they feel<br/>\n  about it.  Will he be able to come home for visits, like on holidays?<br/>\n<br/>\n  When mine have just gone on trips (2-3weeks) they have always sent<br/>\n  postcards, brought back souvenirs, and called and talked with everyone.<br/>\n  Maybe your family can do things to try and *be* together - like have same<br/>\n  meals, try out some of the customs, share as much as you can long-distance.<br/>\n  Also, let son #2 express his feelings, then do constructive things to try to<br/>\n  feel better - write, e-mail, make a gift, anything that connects him with<br/>\n  his brother (watch *their* favorite movie, play a game, etc.).  These are<br/>\n  some of the things we did when the baby died - we let the boys play with the<br/>\n  baby&#39;s toys, gave them their own framed and wallet pictures of Joel, let<br/>\n  them buy him things.  This lasted for about the first year, then tapered<br/>\n  off.  If your son has strong feelings of loss, there are books that will<br/>\n  give more ideas.<br/>\n<br/>\n  Finally, help them enjoy their time together now!<br/>\n<br/>\n  Brenda Rose<br/>\n<br/>\n<br/>\n        Yahoo! Groups Sponsor <br/>\n              ADVERTISEMENT<br/>\n                <br/>\n       <br/>\n       <br/>\n<br/>\n  ~~~~ Don&#39;t forget! If you change topics, change the subject line! ~~~~<br/>\n<br/>\n  If you have questions, concerns or problems with this list, please email the moderator, Joyce Fetteroll (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a>), or the list owner, Helen Hegener (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Editor@...\">HEM-Editor@...</a>).<br/>\n<br/>\n  To unsubscribe from this group, click on the following link or address an email to:<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-unsubscribe@yahoogroups.com\">Unschooling-dotcom-unsubscribe@yahoogroups.com</a> <br/>\n<br/>\n  Visit the Unschooling website: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> <br/>\n<br/>\n  Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]}],"prevTopicId":54777,"nextTopicId":54787}}