{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":83585663,"authorName":"Alicia Knight","from":"Alicia Knight &lt;superdiva@...&gt;","profile":"superdiva58us","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"cleaning","postDate":"1046883402","msgId":60188,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNFNjYyQzRBLjIwODAwMDhAYWRlbHBoaWEubmV0Pg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":60187,"nextInTime":60189,"topicId":60188,"numMessagesInTopic":0,"msgSnippet":"pam wrote: ","messageBody":"<div id=\"ygrps-yiv-1905989819\">pam wrote:<br/>\n<br/>\n&lt;&lt;&lt;&lt;&lt;&lt;Maybe what we need is the same kind of email list encouragement/reminders and a system - that is more in tune with being respectful of the so-called junk which is really somebody&#39;s &quot;stuff.&quot; I know I could use encouragement and some sort of system to <br/>\nget me moving.&gt;&gt;&gt;&gt;&gt;<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>There is the Organizer Lady -- she seems a bit less intense than the Fly Lady.  She sends out email reminders everyday -- I haven&#39;t yet seen one where it says to throw your kids stuff away.  <br/>\n<br/>\nBTW, when my kids were much younger, if I observed that toys were being scattered about and left around -- I knew it was time to change out the toys.  While they were sleeping, I would quietly pack them up and put the old ones in storage and bring out the &quot;new&quot; ones   from storage. I would set up a game or a toy in a prominent place (i.e. breakfast table) so when they woke up they would see the &quot;new&quot; toys like it was Christmas all over again.    They would be so happy playing with all different toys they&#39;d forgotten about.                        A lot of times I would add in something truly new to them which might have been a yard sale find.  I would also observe after a toy change that their play was a lot more focused and intense -- and there were fewer arguments as well.  If a special favorite toy got accidently put away in the change-out -- I would just pretend it was &quot;lost&quot; temporarily -- then get it out at night after they were asleep so it would be &quot;found&quot; the next day.  <br/>\n<br/>\nI also found that toy shelves with picture labels for where things go -- instead of toy boxes --  encouraged the children to pick up after themselves.  It really is like magic -- they  just seem to automatically take the stuff back to the shelf when they&#39;re done.                         Make it easy for them to be successful. <br/>\n<br/>\nFor small toys like Legos, I would cut hole in the top of the Lego bucket.  Especially the little ones would love to push the Duplos pieces through the hole and hear the Duplos drop to the bottom.  For other maipulatives, I use clear baskets and other see-through containers when then go on the shelves.  I had a friend who took the time to outline  each shape on the block set on the shelves and her children would carefully arrange the blocks on the shelves according to the shapes, but this seemed OTT for me.  We just throw  the blocks in baskets.              <br/>\n<br/>\nAnother trick is to use photos -- take pictures when the room is clean and tidy.  Then post the picture on the wall of the room with a sign that says &quot;This room should look like this picture.&quot; (Or parts of the room.) Children who aren&#39;t reading yet will be curious to know what it says. Or they will intuit what to do and go around putting things back in the proper place according to the picture.  You can do this with any room and it even works for older kids.  Clean the bathroom then take a picture of it.  Hang the picture on the bathroom wall with the sign. They might think you&#39;re crazy -- but the bathroom stays remarkably clean -- as if by magic.  (Have clean-up wipes, etc. readily accessible and it will happen.) A Polaroid or digital camera is really good for this. <br/>\n<br/>\nI am not a neat-nik but these tips have helped me. ~ Alicia             <br/>\n<br/>\n   <br/>\n<br/>\n<br/>\n<br/>\n_____________________________</div>","specialLinks":[]}],"prevTopicId":60123,"nextTopicId":60190}}