{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Sheri Piersol","from":"&quot;Sheri Piersol&quot; &lt;sheri@...&gt;","replyTo":"LIST","senderId":"5BICxaXRPLagcDPwTwfEZhpUkVlIkoLnSVS3SAXvL1WtrxXdUPpYzO3oZZz_x3BH69mQLphmuVOzoMCgQw2QDru1FSkFspWc-lun","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Capitalism, Communism, Socialism...ect.","postDate":"1000478155","msgId":25613,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJHRUlJSVBPS0hORk5LRUtOSU1IT0VLR0NHQUEuc2hlcmlAbWFpbmUucnIuY29tPg==","inReplyToHeader":"PDEwMDA0NjA3NzYuMjkzLjgyODA0LmwxMEB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":25612,"nextInTime":25614,"topicId":25613,"numMessagesInTopic":0,"msgSnippet":"Interesting conversations going on here. I need a break from the current events, so here I go with my opinions. I believe in democracy, I believe capitalism","messageBody":"<div id=\"ygrps-yiv-692850169\">Interesting conversations going on here. I need a break from the current<br/>\nevents, so here I go with my opinions.<br/>\n<br/>\nI believe in democracy, I believe capitalism has it&#39;s faults but overall is<br/>\nthe better choice. Now let me explain. Every concept is born out of<br/>\nidealism, what &quot;could be&quot;. It often does not properly account for human<br/>\nnature. People are greedy and selfish by nature and it is wrong (in my<br/>\nopinion) to try and deny it individuals and society. That greed can be used<br/>\nto help fuel the whole. On the other hand we are also generous and selfless,<br/>\nand that can be used to help the whole.<br/>\n<br/>\n&quot; We do<br/>\nknow that communism works in small groups.&quot;<br/>\n<br/>\nThis is very true, a small example is even in the Bible, with the early<br/>\nchurch. However, I believe it breaks down in larger groups because we can<br/>\nnot eliminate the eliment of greed and those who desire power in all.<br/>\n<br/>\n&quot;The basic premise of communism is give by commitment, take by need.  To<br/>\ngive<br/>\nby commitment, people must believe that their society, commune, family,<br/>\nwhatever the group is important to them and they are important to it.&quot;<br/>\n<br/>\nWhich is why it can work in small groups, but begins to fall apart in larger<br/>\ngroups. Not all people hold the same beliefs and cna not be forced to.<br/>\n<br/>\n&quot;In communism, the society must meet the needs of the people.&quot;<br/>\n<br/>\nEven in communism there must be a group of people &quot;in charge&quot; who must<br/>\ndecide the needs of the many....so the choices of the individual are taken<br/>\naway and a small group of individuals can not meet the needs of the masses.<br/>\nMuch the same way a teacher can not meet all the needs of her students in a<br/>\nlarge classroom.<br/>\n<br/>\n &quot;It cannot be<br/>\ndictated by the few or the powerful or the entire society would fall apart.&quot;<br/>\n<br/>\nThis makes no sense to me, who decides where the resources go? Even the most<br/>\nkind hearted person can turn greedy when faced with shortage. They people<br/>\ndeemed most needed by the society will get fed, clothed, medical attention,<br/>\nect. before those that deemed less needed.<br/>\n<br/>\n<br/>\n&quot;That is why it cannot move through socialism and that is why<br/>\n&quot;communism-lite&quot;, as I think of the common perception in the U.S. of<br/>\ncommunism, is unworkable.&quot;<br/>\n<br/>\nTo me communism on a large scale is unworkable even in it&#39;s pure form. Human<br/>\nkind is fallable.<br/>\n<br/>\n&quot; Also, communism isn&#39;t about &quot;social programs&quot;.  It is about getting rid of<br/>\nwages all together.&quot;<br/>\n<br/>\nAah...much like Star Trek NG, haha, I am a scifi nut. The big problem with<br/>\nthis is that no one desires to clean the toilets. No one wants to do the<br/>\nugly jobs. In our society we do it to earn the money. However take the money<br/>\nequation out and who does the nasty jobs? If you can not get people to scrub<br/>\ntoilets or whatever then how is it handled? Do you force people into<br/>\nundesirable jobs? Even more freedom would be taken from the individual. Do<br/>\nyou entice with &quot;extra benefits&quot;? This could cause serious problems with the<br/>\ntheory of equality for all.<br/>\n<br/>\n<br/>\n&quot;do and be more....what?&quot;<br/>\n<br/>\nWhatever they strive to be... in this country an out of work maid can become<br/>\nthe owner of her own company. (my mother) I am a housewife and mother, which<br/>\nin my readings  isn&#39;t desirable in communism because it isn&#39;t for the<br/>\ngreater good. I desire to be more and plan to open my own business. I am<br/>\nstriving to be more than I am, but enjoying being all that I am, too.<br/>\n<br/>\nWell, there you have it, my thoughts. Communism is idealistic and works on<br/>\nsmall scales, but can not work on larger scales because it doesn&#39;t account<br/>\nfor the way we humans really are. Socialism is another issue, I might<br/>\ncomment on later...but this is too long as it is. :)<br/>\n<br/>\n~Sheri</div>","specialLinks":[]}],"prevTopicId":25427,"nextTopicId":25598}}