{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":21,"messages":[{"userId":78282269,"authorName":"soggyboysmom","from":"&quot;soggyboysmom&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Food that pleases","postDate":"1098218832","msgId":100709,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNsM3VnZys4aGlnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGNrcTNmMSs4c2ZhQGVHcm91cHMuY29tPg=="},"prevInTopic":100670,"nextInTopic":0,"prevInTime":100708,"nextInTime":100710,"topicId":100646,"numMessagesInTopic":0,"msgSnippet":"... expensive that I can t keep enough around to feed them this all the time. When we travel we like to have trail mix on hand too - it handles travel well and","messageBody":"<div id=\"ygrps-yiv-1664225262\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, &quot;Julie Bogart&quot; <br/>\n&lt;julie@b...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; They will eat trail mix or yogurt too, but these are so much more <br/>\n </span></blockquote>expensive that I can&#39;t keep enough around to feed them this all the <br/>\ntime.<br/>\n<br/>\nWhen we travel we like to have trail mix on hand too - it handles <br/>\ntravel well and is filling and all. We usually hit Sam&#39;s (or other <br/>\nbulk place) and pick out big packs of raisins, nuts, chocolate <br/>\nchips, other dried fruit, crunchy cereals, etc. and mix up our own <br/>\ntrail mix - we get tons of stuff for way less than the prepackaged <br/>\nkind and we can mix it to suit ourselves. For a while I was <br/>\nmaking &quot;ogre mix&quot; for DS - instead of mixing the ingredients I&#39;d <br/>\nleave them in layers! He loved it!<br/>\n<br/>\nWe also buy the big store brand plain yogurt and then mix it on a <br/>\nper serving basis with honey, fruit, jams & preserves, crunchy <br/>\nstuff, whatever. That way there&#39;s no buying tons of this or that <br/>\nflavor for each individual - just one base and lots of toppings.<br/>\n<br/>\nI can&#39;t really add much else to the discussion - there&#39;s only 3 of <br/>\nus (DS is 6) and he eats about anything. We do take his ideas into <br/>\nconsideration and try to arrange things to suit all of us. For <br/>\ninstance, I can&#39;t eat eggs unless they are baked into something - <br/>\nthat rules out scrambled, fried, quiche, even some soft French <br/>\ntoast. DS currently loves cheese omelettes (4 egg omelettes no <br/>\nless!) So, sometimes for dinner (yes dinner), he and DH will have <br/>\ncheese omelettes, bacon, toast and juice. I&#39;ll have the juice, <br/>\nbacon, and put the cheese on my toast to make a nice cheese <br/>\nsandwich. Ends up being less cooking that way rather than more. As <br/>\nhas already been mentioned, we often have mix&#39;n&#39;match meals with the <br/>\npasta, sauce, cheese, meat, etc. all separate and mixed &quot;to order&quot; <br/>\nbut without much additional cooking.</div>","specialLinks":[]},{"userId":154575365,"authorName":"Laura Johnson","from":"&quot;Laura Johnson&quot; &lt;lauraj2@...&gt;","profile":"imakebelieve2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Food that pleases","postDate":"1098039799","msgId":100670,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwYjEwMWM0YjQ3YiRmNzc4NzQyMCQ2ZjYzMDgwNEB5b3VybzBrd2t3OWp3Yz4=","referencesHeader":"PGNrcGwxbCtodm5kQGVHcm91cHMuY29tPiA8NDVjZjIzYjA0MTAxNTIxNTY3MjA0YmU0ZkBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":100667,"nextInTopic":100709,"prevInTime":100669,"nextInTime":100671,"topicId":100646,"numMessagesInTopic":0,"msgSnippet":"I don t know if anyone else suggested it, but can you have them help plan and prepare meals?  Maybe if they get to plan a meal, shop for it and help prepare","messageBody":"<div id=\"ygrps-yiv-1466107917\">I don&#39;t know if anyone else suggested it, but can you have them help plan and prepare meals?  Maybe if they get to plan a meal, shop for it and help prepare it, then they will be open to other things.  They could take turns.   If not, I usually have something in the fridge to offer up with my uhm, discriminating eater.  I get sick of his food too.  So, often I buy him a frozen kid meal and we eat something we like.  It&#39;s easier with one, I&#39;m sure it is much more challenging with more kids.<br/>\nLaura J<br/>\nI like the idea of having different cultures and serving food from those places.  That might be fun, you could find recipes together and plan a special night once a week.  <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":74604204,"authorName":"Deb Lewis","from":"Deb Lewis &lt;ddzimlew@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Food that pleases","postDate":"1098022355","msgId":100667,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQxMDE3LjA4MTIzNi4yMTk2LjAuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":100666,"nextInTopic":100670,"prevInTime":100666,"nextInTime":100668,"topicId":100646,"numMessagesInTopic":0,"msgSnippet":"***And now that my dd is vegetarian, she can t eat almost anything I make.*** Dylan doesn t eat meat and he likes sandwiches made with hummus or Baba Ganoush","messageBody":"<div id=\"ygrps-yiv-2138946533\">***And now that my dd is vegetarian, she can&#39;t eat almost anything I<br/>\nmake.***<br/>\n<br/>\nDylan doesn&#39;t eat meat and he likes sandwiches made with hummus or Baba<br/>\nGanoush or tempeh.   All of these can be prepared and stored in the<br/>\nfridge for a few days.  <br/>\n<br/>\nDylan likes a salad (like chicken salad) made with tempeh.  <br/>\nHe also likes scrambled tofu rolled up in a tortilla with olives and<br/>\nsalsa. <br/>\n<br/>\n***She doesn&#39;t complain really, but she is half starving all the time and<br/>\nends up eating Ritz crackers and ice cream.***<br/>\n<br/>\nWill she eat cheese with the crackers?   If she doesn&#39;t like peanut<br/>\nbutter what about cashew butter or almond butter?  <br/>\nDoes she like nuts?   You can add them to salads and stir fry, oat meal,<br/>\ngranola, yogurt. <br/>\n<br/>\nMaybe she&#39;d like to Google vegetarian recipes and try something exotic<br/>\nthat you&#39;d enjoy helping her make.  (on a night when the others have<br/>\nleftover beans and rice.&lt;g&gt;)<br/>\n<br/>\nDeb Lewis</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Food that pleases","postDate":"1098010972","msgId":100666,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgyLjE4ZWNlOTI4LjJlYTNhYjVjQGFvbC5jb20+"},"prevInTopic":100665,"nextInTopic":100667,"prevInTime":100665,"nextInTime":100667,"topicId":100646,"numMessagesInTopic":0,"msgSnippet":"I hadn t made chicken and dumplings since I had had children (and years before that) but I did make it a couple of months ago and they really liked it, all of","messageBody":"<div id=\"ygrps-yiv-1399314013\">I hadn&#39;t made chicken and dumplings since I had had children (and years <br/>\nbefore that) but I did make it a couple of months ago and they really liked it, all <br/>\nof them.  I&#39;ve made it three more times. &lt;g&gt;  They&#39;ll get tired of it, but <br/>\nit&#39;s cheap and easy and makes the house smell good.<br/>\n<br/>\nI&#39;ve been using the chicken strips you can get at Costco (so all white meat <br/>\nand easy to prepare).  I cook it a bit first and then cut it up, but if you <br/>\njust simmer it for several hours it will fall apart on its own.    I start with <br/>\nonion and garlic in a little oil, add water (used chicken broth a couple of <br/>\ntimes, but that&#39;s not necessary), salt and pepper.   Chicken.  When the chicken <br/>\nis cooked, add balls of biscuit dough.  I&#39;ve made my own and used canned and <br/>\nthe family doesn&#39;t care one way or another so far, it seems).<br/>\n<br/>\nLet those be there at least an hour.  The broth will get thick after a while.<br/>\n<br/>\nIt&#39;s good leftover, you can freeze it in small portions, and if you run out <br/>\nof dumplings (Holly pretty much only likes that part) you might put leftover <br/>\nrice in it.  That worked here. &lt;g&gt;<br/>\n<br/>\nA platter of things to eat with toothpicks has been well received here over <br/>\nthe years, if the kids are bored and haven&#39;t had much variety.  Little cubes  <br/>\nof meat maybe, or sections of hot dog, but for sure chunks of pineapple, cheese <br/>\nand apple.   Maybe grapes or cherries (cut in half if you want them to get to <br/>\nuse the toothpicks).  <br/>\n<br/>\nPlatters of sandwiches cut in quarters seem less intimidating than a whole <br/>\nbig sandwich to which a child has to feel a commitment (or pass-or-play).  A <br/>\nquarter of a sandwich isn&#39;t too daunting, and if it&#39;s good they&#39;ll get more, and <br/>\nif not the adults can finish it off.  <br/>\n<br/>\nCream cheese goes well with unexpected things.  Keith taught me peanut <br/>\nbutter, cream cheese and honey sandwiches (plain cream cheese cut thin from blocks) <br/>\nand I added sliced green grapes, for summer sandwiches).   Kirby created a mix <br/>\nwhen he was a kid that still appears from time to time here:  tuna mixed with <br/>\npineapple cream cheese.  Sounds gross but is truly good for sandwiches or on <br/>\ncrackers.<br/>\n<br/>\nLittle open-faced English-muffin things with melted cheese can be fun.  <br/>\n&quot;Pizzas&quot; kind of.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":77522235,"authorName":"Julie Bogart","from":"&quot;Julie Bogart&quot; &lt;julie@...&gt;","profile":"juliecinci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Food that pleases","postDate":"1097983398","msgId":100665,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNrc29qNitncXIwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwMDcwMWM0YjM0MyRkZmQ5NTcwMCQ2NDAyYThjMEAyMDAyZGVza3RvcD4="},"prevInTopic":100664,"nextInTopic":100666,"prevInTime":100664,"nextInTime":100666,"topicId":100646,"numMessagesInTopic":0,"msgSnippet":"... the moms in my playgroup (8 of us) once a month for vegetarian potluck for dinner.  It is a chance to go all out for someone who will actually appreciate","messageBody":"<div id=\"ygrps-yiv-1120685910\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, &quot;catherine aceto&quot; &lt;aceto3@v...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Also can you find some way to cook for an appreciative audience?  I get together with <br/>\n </span></blockquote>the moms in my playgroup (8 of us) once a month for vegetarian potluck for dinner.  It is a <br/>\nchance to go all out for someone who will actually appreciate it.   (Although my kids do <br/>\nmostly eat what we eat and like it - if not there are only 2 of them and always something <br/>\nelse in the refrigerator they like like pasta or beans/rice). <br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; -Cat  <br/>\n<br/>\n </span></blockquote>I just love this idea! I must remember to do this more often.<br/>\n<br/>\nTonight my husband had over some of his students from college. I was so excited to have <br/>\nthem here to enjoy our cooking!<br/>\n<br/>\nWhen I read your post I realized that this is what has been missing for some time: <br/>\nentertaining. And ironically, my kids were so entertained by our guests, they never once <br/>\ncomplained of hunger or over what food was available. And for all I know, they ate it!<br/>\n<br/>\nThe guests had a great time and my husband cooked the pork loin in a slow cooker on his <br/>\nWebber Grill. It was delicious.<br/>\n<br/>\nJust eating something I like perked me up.<br/>\n<br/>\nJulie B</div>","specialLinks":[]},{"userId":77522235,"authorName":"Julie Bogart","from":"&quot;Julie Bogart&quot; &lt;julie@...&gt;","profile":"juliecinci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Food that pleases","postDate":"1097983253","msgId":100664,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNrc29lbCtyamVqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwMDMwMWM0YjMzMSQ2ODllZTYzMCQwMjBiYThjMEBHYXRld2F5NjAwPg=="},"prevInTopic":100663,"nextInTopic":100665,"prevInTime":100663,"nextInTime":100665,"topicId":100646,"numMessagesInTopic":0,"msgSnippet":"... This reminds me of when my oldest was a toddler. I made pumpkin pie from fresh acorn squash almost every week. He loved it and would eat it even if we had","messageBody":"<div id=\"ygrps-yiv-696293418\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, &quot;AlysonRR&quot; &lt;AlysonRR@c...&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  <br/>\n&gt; Grain, fruit, dairy - a complete meal by my calculation ;-)  Maybe try a<br/>\n&gt; sausage (or gimme lean veggie sausage) and egg pie?  Cornish pasties?<br/>\n&gt; Quiche?  Pumpkin is a squash, so how about a nice full meal of squash<br/>\n&gt; (vegetable!) pie?<br/>\n&gt;  <br/>\n&gt; Alyson<br/>\n&gt;  <br/>\n&gt;  <br/>\n </span></blockquote>This reminds me of when my oldest was a toddler. I made pumpkin pie from fresh acorn <br/>\nsquash almost every week. He loved it and would eat it even if we had other foods for <br/>\ndinner he didn&#39;t like. I felt great knowing he was getting his veggies. :)<br/>\n<br/>\nMaybe I ought to try exotic desserts for dinner and offer meat for dessert? ;-) At least <br/>\nthem I wouldn&#39;t feel like I was wasting the &quot;whole&quot; meal.<br/>\n<br/>\nYou&#39;ve all been so sweet to understand the frustration and offer truly practical tips. I&#39;m <br/>\nreally grateful and feel I have some new ideas to help me get going again.<br/>\n<br/>\nThanks!<br/>\n<br/>\nJulie B</div>","specialLinks":[]},{"userId":200850584,"authorName":"Cyndi","from":"&quot;Cyndi&quot; &lt;mermaidcoven@...&gt;","profile":"littlefaeriesflyingx3","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Food that pleases","postDate":"1097967215","msgId":100663,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNrczhwZit0YTI0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGNrcGwxbCtodm5kQGVHcm91cHMuY29tPg=="},"prevInTopic":100661,"nextInTopic":100664,"prevInTime":100662,"nextInTime":100664,"topicId":100646,"numMessagesInTopic":0,"msgSnippet":"Hi Julie: Sounds like you were having a rough day when you wrote this! Maybe you re trying to hard to find common ground instead of looking at it as","messageBody":"<div id=\"ygrps-yiv-1566983785\">Hi Julie:<br/>\n<br/>\nSounds like you were having a rough day when you wrote this! Maybe <br/>\nyou&#39;re trying to hard to find common ground instead of looking at it <br/>\nas reorganizing the way you plan your families meals.<br/>\n<br/>\nOne thing I try to do is to plan my menu for the week.  I call all <br/>\nthe kids in to go over the menu.  This gives me an idea of who is <br/>\ngoing to eat what so I don&#39;t have a big surprise at the dinner <br/>\ntable.  And I think that you just have to accept that on any given <br/>\nnight there will be one or two who aren&#39;t going to eat what&#39;s <br/>\nprepared, so I ask them what they would like in substitute that <br/>\nnight.  We also try to cover all the times that they will need <br/>\nsnacks or brownbag meals outside of the house and what they want.  <br/>\nIt&#39;s almost like I get a mini-shopping list from each of the kids <br/>\nand it works out really well.  That way I&#39;m not guessing what they <br/>\nwant and there isn&#39;t as much waste or want.  So I guess what I&#39;m <br/>\nadvising is that you take some of the pressure off yourself and get <br/>\nyour kids more involved in making the weekly menu planning choices.<br/>\n<br/>\nIt&#39;s kind of like a food diary when you are dieting - you don&#39;t <br/>\nactually see what you are eating sometimes till you write it down.  <br/>\nWith the menu planning, you sometimes see what the kids WON&#39;T be <br/>\neating and you can adjust accordingly.<br/>\n<br/>\nI also find that making a few staples ahead of time, say on Sunday, <br/>\nlike stew, chili, a homemade salsa, a big precut salad selection in <br/>\nseperate containers and a big tomato gravy (with meatballs) and <br/>\ncontainer of pasta will generally fill in all the gaps for everyone <br/>\nat some point during the week (and take care of dinner that night, <br/>\ntoo).  And if you get good and organized about it, it doesn&#39;t take <br/>\nthat long to put all that together in one afternoon, it&#39;s even a <br/>\ngood chance to get some of the kids that like cooking in the <br/>\nkitchen, too.<br/>\n<br/>\nPeace,<br/>\nCyndi</div>","specialLinks":[]},{"userId":149995806,"authorName":"catherine aceto","from":"&quot;catherine aceto&quot; &lt;aceto3@...&gt;","profile":"cat4cat15217","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Food that pleases","postDate":"1097905756","msgId":100658,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDcwMWM0YjM0MyRkZmQ5NTcwMCQ2NDAyYThjMEAyMDAyZGVza3RvcD4=","referencesHeader":"PGNrcTMxMis3ZjA2QGVHcm91cHMuY29tPg=="},"prevInTopic":100657,"nextInTopic":100661,"prevInTime":100657,"nextInTime":100659,"topicId":100646,"numMessagesInTopic":0,"msgSnippet":"Also can you find some way to cook for an appreciative audience?  I get together with the moms in my playgroup (8 of us) once a month for vegetarian potluck","messageBody":"<div id=\"ygrps-yiv-1839586497\">Also can you find some way to cook for an appreciative audience?  I get together with the moms in my playgroup (8 of us) once a month for vegetarian potluck for dinner.  It is a chance to go all out for someone who will actually appreciate it.   (Although my kids do mostly eat what we eat and like it - if not there are only 2 of them and always something else in the refrigerator they like like pasta or beans/rice). <br/>\n<br/>\n-Cat  <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":197785614,"authorName":"Lars Hedbor","from":"Lars Hedbor &lt;lhedbor@...&gt;","profile":"lhedbor","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Food that pleases","postDate":"1097902572","msgId":100661,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ1Y2YyM2IwNDEwMTUyMTU2NzIwNGJlNGZAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PGNrcGwxbCtodm5kQGVHcm91cHMuY29tPg==","referencesHeader":"PGNrcGwxbCtodm5kQGVHcm91cHMuY29tPg=="},"prevInTopic":100658,"nextInTopic":100663,"prevInTime":100660,"nextInTime":100662,"topicId":100646,"numMessagesInTopic":0,"msgSnippet":"... Hi, Julie.  It sounds like somewhere along the line to an unschooling lifestyle, you got appointed to be the family kitchen servant. Perhaps my approach is","messageBody":"<div id=\"ygrps-yiv-714737254\">On Fri, 15 Oct 2004 23:04:21 -0000, Julie Bogart &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:julie@...\">julie@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; <br/>\n&gt; I&#39;m about sick to death of our repeated meals (the five that please most of the family). <br/>\n </span></blockquote>...<br/>\n<blockquote><span title=\"ireply\"> &gt; Sorry to whine, but food prep takes up such a huge percentage of my life and I hate that I<br/>\n&gt; can&#39;t please a critical mass of people more often. Some days it just drains my enthusiasm<br/>\n&gt; for the other hours of the day.<br/>\n<br/>\n<br/>\n </span></blockquote>Hi, Julie.  It sounds like somewhere along the line to an unschooling<br/>\nlifestyle, you got appointed to be the family kitchen servant. <br/>\nPerhaps my approach is less unschool, and more old school, but it<br/>\nworks pretty well for us, most of the time.<br/>\n<br/>\nI love cooking -- and I love to explore different cuisines.  My<br/>\nfeelings aren&#39;t hurt if somebody doesn&#39;t like what I&#39;ve made, and I&#39;m<br/>\noften my own harshest critic.  I do usually ask that the kids all at<br/>\nleast try what I&#39;ve made, before they make faces and declare &quot;yuck!&quot;<br/>\n<br/>\nIf they can&#39;t abide what I&#39;ve cooked, they&#39;re welcome to head off to<br/>\nthe kitchen to make themselves a PBJ or nuke a hot dog or whatever. <br/>\nBut I don&#39;t run a restaurant, and I don&#39;t much take dinner orders.  I<br/>\ndo try to shape the menu around the preferences of my family members,<br/>\nbut if someone&#39;s trying out vegetarian, they may get to fend for<br/>\nthemselves if dw and/or I get a hankering for steak.<br/>\n<br/>\nWe host exchange students, so we get a variety of food preferences<br/>\nover the years.  One year we hosted a Muslim, so I avoided pork, out<br/>\nof respect for her sensitivity to its smell.  The next year, we had a<br/>\nstudent who was avoiding beef, being fresh from the European mad cow<br/>\nsituation.  I adapted and adjusted.<br/>\n<br/>\nUnschooling has to work for everyone in the family -- and that doesn&#39;t<br/>\nmean that it should make *you* work for everyone in the family.<br/>\n<br/>\nThe funny thing about my approach is that, while we eat a pretty<br/>\nwidely varied (and usually very healthy) diet, I hardly ever see<br/>\nsomeone flatly refuse what I&#39;ve made (even the five-year-old), and do<br/>\nthe PBJ routine.  (There have been a few spectacular failures that<br/>\nhave been set aside by unanimous consent, but those are pretty rare. <br/>\n;-)<br/>\n<br/>\nBest of all, I get to enjoy sharing my hobby with the family, and they<br/>\nget a sense of how people in other parts of the world might eat.  (I<br/>\ndo remind them that much of what we sample from other cuisines is<br/>\nfeast food, and that they probably don&#39;t eat this way very often.) <br/>\nCooking is not a chore, but a joy, and mealtimes are less a struggle<br/>\nthan what you&#39;re describing.<br/>\n<br/>\n- Lars D. H. Hedbor<br/>\n  Oregon City, Oregon</div>","specialLinks":[]},{"userId":156911268,"authorName":"AlysonRR","from":"&quot;AlysonRR&quot; &lt;AlysonRR@...&gt;","profile":"alysonrr","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] Re: Food that pleases","postDate":"1097897820","msgId":100657,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDMwMWM0YjMzMSQ2ODllZTYzMCQwMjBiYThjMEBHYXRld2F5NjAwPg==","inReplyToHeader":"PGNrcTNjcSs0ZWMwQGVHcm91cHMuY29tPg=="},"prevInTopic":100656,"nextInTopic":100658,"prevInTime":100656,"nextInTime":100658,"topicId":100646,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-294159074\">&lt;&lt;&lt;Julie B wrote, in part:  I did buck up and make Warm Fall Pear and<br/>\nPlum Streusel for dessert with vanilla ice cream <br/>\nand it was a hit so at least everyone ate that. :)&gt;&gt;&gt;<br/>\n<br/>\n<br/>\n <br/>\nGrain, fruit, dairy - a complete meal by my calculation ;-)  Maybe try a<br/>\nsausage (or gimme lean veggie sausage) and egg pie?  Cornish pasties?<br/>\nQuiche?  Pumpkin is a squash, so how about a nice full meal of squash<br/>\n(vegetable!) pie?<br/>\n <br/>\nAlyson<br/>\n <br/>\n <br/>\nAlyson Ruff-Roberts<br/>\nAsk me about Stampin&#39; Up for cards, crafts, and scrapbooks<br/>\nStampin&#39; Up Independent Demonstrator<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlysonRR@...\">AlysonRR@...</a><br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":77522235,"authorName":"Julie Bogart","from":"&quot;Julie Bogart&quot; &lt;julie@...&gt;","profile":"juliecinci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Food that pleases","postDate":"1097896225","msgId":100655,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNrcTNmMSs4c2ZhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQxNzA3MDJELjQwOTAwMDFAZWFydGhsaW5rLm5ldD4="},"prevInTopic":100654,"nextInTopic":100656,"prevInTime":100654,"nextInTime":100656,"topicId":100646,"numMessagesInTopic":0,"msgSnippet":"... Great idea! ... Convenience and it fills their tummies up. They will eat trail mix or yogurt too, but these are so much more expensive that I can t keep","messageBody":"<div id=\"ygrps-yiv-286159782\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, Elizabeth Hill &lt;ecsamhill@e...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; ** Dinner is becoming such a depressing time for me. How many times a <br/>\n&gt; week can we eat<br/>\n&gt; Mexican, pizza and black beans with rice?**<br/>\n&gt; <br/>\n&gt; It does sound tough.<br/>\n&gt; <br/>\n&gt; What comes to mind for me is that apparently the kids don&#39;t mind <br/>\n&gt; repetition the way you do.  Therefore, I&#39;d be inclined to feed them <br/>\n&gt; leftover black beans and rice or pizza on some nights on which you cook <br/>\n&gt; what you like for yourself.  If your kids are eating these foods and <br/>\n&gt; maybe some fruit (or even juice) then they are probably covering their <br/>\n&gt; nutritional needs.<br/>\n<br/>\n </span></blockquote>Great idea!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Is it the salt that makes the popcorn so appealing?  Or the butter?  <br/>\n&gt; Would putting more salt and butter in other foods help &quot;sell&quot; them?<br/>\n<br/>\n </span></blockquote>Convenience and it fills their tummies up.<br/>\n<br/>\nThey will eat trail mix or yogurt too, but these are so much more expensive that I can&#39;t <br/>\nkeep enough around to feed them this all the time.<br/>\n<br/>\nJulie B</div>","specialLinks":[]},{"userId":77522235,"authorName":"Julie Bogart","from":"&quot;Julie Bogart&quot; &lt;julie@...&gt;","profile":"juliecinci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Food that pleases","postDate":"1097896154","msgId":100654,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNrcTNjcSs0ZWMwQGVHcm91cHMuY29tPg=="},"prevInTopic":100653,"nextInTopic":100655,"prevInTime":100653,"nextInTime":100655,"topicId":100646,"numMessagesInTopic":0,"msgSnippet":"... Maybe you could have more of that ... I need to do this more. I m probably just over-reacting to Mexican, but being from LA myself and now transplanted","messageBody":"<div id=\"ygrps-yiv-1895235261\"><blockquote><span title=\"qreply\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, &quot;Robyn Coburn&quot; &lt;dezigna@c...&gt; wrote:<br/>\n<br/>\n Maybe you could have more of that<br/>\n&gt; available that the older kids could at least toss in the microwave if they<br/>\n&gt; didn&#39;t like the meal you are cooking for dh and yourself.<br/>\n<br/>\nI need to do this more. I&#39;m probably just over-reacting to Mexican, but being from LA <br/>\nmyself and now transplanted into Ohio, the Mexican just isn&#39;t the same. :) although we are <br/>\ngetting our own Trader Joe&#39;s in town in November so that will be a big help! As it is, we eat <br/>\nburritos at least once a week for dinner and Quesadillas for lunch most days!<br/>\n<br/>\n&gt; <br/>\n&gt; I want to suggest that it might help to turn responsibility for their own<br/>\n&gt; food over to the two older ones. They are old enough to do at least some of<br/>\n&gt; their own cooking surely. <br/>\n<br/>\nThey are, but they won&#39;t. My oldest will just not eat or eat cereal. And the vegetarian <br/>\ndaughter doesn&#39;t like vegetables! (Of all things). She&#39;s perfectly willing to microwave her <br/>\nstuff, but she just isn&#39;t eating very well so I get concerned over that. Both don&#39;t like <br/>\ncooking at all.<br/>\n<br/>\nWhat if they went with you to the store and had<br/>\n&gt; their own buggies that they could use to buy the food that they will eat -<br/>\n&gt; perhaps hand them the portion of the family budget that would encompass<br/>\n&gt; their meals normally as the way for them to pay.<br/>\n<br/>\nThat might be interesting!<br/>\n<br/>\n Then they get to choose it<br/>\n&gt; and deal with it at home. I expect microwave meals might take up a good<br/>\n&gt; proportion of it - at least at first. <br/>\n&gt; <br/>\n&gt; If it works out that they love this arrangement at least part of your<br/>\n&gt; problem is solved. If it works out that this becomes really difficult, then<br/>\n&gt; at least they might gain an appreciation for the efforts you have been<br/>\n&gt; making! <br/>\n<br/>\nLol! At least that sounds like a win-win.<br/>\n<br/>\n&gt; <br/>\n&gt; &lt;&lt;&lt;&lt;&lt;I still have to contend with hungry <br/>\n&gt; people who forage through my cupboards and complain all day that they are<br/>\n&gt; hungry.&gt;&gt;&gt;&gt;<br/>\n&gt; <br/>\n&gt; Aren&#39;t they their cupboards too? <br/>\n<br/>\nI knew when I typed that someone on this list would remind me of that principle! &lt;bwg&gt;<br/>\n<br/>\nI hope you can find some detachment to<br/>\n&gt; their complaints.<br/>\n<br/>\nNow you&#39;ve got what was behind it. I feel like it&#39;s my hard work that is being judged every <br/>\ntime they look for what they want to eat and don&#39;t find it. It&#39;s not that I don&#39;t buy them <br/>\nwhat they enjoy. It&#39;s that since they aren&#39;t eating decent meals, all the &quot;snack&quot; foods don&#39;t <br/>\nlast between trips to the store. So there is a rummaging effect that drains me.<br/>\n<br/>\n&gt; <br/>\n&gt; (((((Julie)))))<br/>\n&gt; As someone who is a mediocre cook at best, I would love the opportunity to<br/>\n&gt; not cook. I wish you could come over here and cook for me - believe me you<br/>\n&gt; would get enormous amounts of appreciation!!<br/>\n<br/>\nOh I wish I could! Would love to meet you. &lt;g&gt;<br/>\n<br/>\nI did buck up and make Warm Fall Pear and Plum Streusel for dessert with vanilla ice cream <br/>\nand it was a hit so at least everyone ate that. :)<br/>\n<br/>\nThanks for your encouragement.<br/>\n<br/>\nJulie B </span></blockquote></div>","specialLinks":[]},{"userId":8151304,"authorName":"rubyprincesstsg@aol.com","from":"rubyprincesstsg@...","profile":"rubyprincesstsg","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Food that pleases","postDate":"1097895800","msgId":100656,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhjLjE3MDJiNTRmLjJlYTFlOTc4QGFvbC5jb20+"},"prevInTopic":100655,"nextInTopic":100657,"prevInTime":100655,"nextInTime":100657,"topicId":100646,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/15/2004 11:00:50 PM Eastern Daylight Time, julie@bravewriter.com writes: Hey I  like this idea. It does sound like work, but what","messageBody":"<div id=\"ygrps-yiv-909814542\">In a message dated 10/15/2004 11:00:50 PM Eastern Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:julie@...\">julie@...</a> writes:<br/>\n<br/>\nHey I  like this idea. It does sound like work, but what difference is it if <br/>\nI work  on meals <br/>\nthey won&#39;t eat anyway now?<br/>\n<br/>\nThank you.<br/>\n<br/>\nJulie  B<br/>\n<br/>\n<br/>\n<br/>\nOnce the initial polling of potential eaters is compiled, you could just  use <br/>\nthe same menu each week or alternate it a bit as plans evolve.<br/>\n <br/>\nglena<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":77522235,"authorName":"Julie Bogart","from":"&quot;Julie Bogart&quot; &lt;julie@...&gt;","profile":"juliecinci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Food that pleases","postDate":"1097895778","msgId":100653,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNrcTMxMis3ZjA2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PE5IQkJLT1BDS0xHR0NQQUlOREpES0VHS0ZOQUEuYWJtb3JyaXMyM0Bjb21jYXN0Lm5ldD4="},"prevInTopic":100652,"nextInTopic":100654,"prevInTime":100652,"nextInTime":100654,"topicId":100646,"numMessagesInTopic":0,"msgSnippet":"... That is the attitude I ve tried to sustain. I am glad to be reminded of it again. I realized in talking to dh tonight that part of the problem is that he","messageBody":"<div id=\"ygrps-yiv-1275963366\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, &quot;April M&quot; &lt;abmorris23@c...&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I also consider it a success if at least three of us like whatever I make.<br/>\n<br/>\n </span></blockquote>That is the attitude I&#39;ve tried to sustain. I am glad to be reminded of it again. I realized in <br/>\ntalking to dh tonight that part of the problem is that he was diagnosed diabetic in the last <br/>\n24 months and has been pretty strictly Atkins ever since. So I don&#39;t even have him eating <br/>\nwith me (and he needs meats made for him separate).<br/>\n<br/>\nSo when I realized that I really have multiple different eating situations to deal with in a <br/>\nddition to typical pickiness, it&#39;s not wonder I&#39;m sick of this situation.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If I&#39;m going to make a roast or soup, I just make sure I have some good<br/>\n&gt; bread and veggies and cheese available on the side.  <br/>\n<br/>\n </span></blockquote>I really like this idea too. Good bread. Check. I need to remember to have bread at all the <br/>\nmeals. That is missing currently.<br/>\n<br/>\nThanks for your other ideas too.<br/>\n<br/>\nJulie B</div>","specialLinks":[]},{"userId":77522235,"authorName":"Julie Bogart","from":"&quot;Julie Bogart&quot; &lt;julie@...&gt;","profile":"juliecinci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Food that pleases","postDate":"1097895613","msgId":100652,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNrcTJydCtjaG81QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGRjLjE2ZGQ3ZDE4LjJlYTFkZTQxQGFvbC5jb20+"},"prevInTopic":100651,"nextInTopic":100653,"prevInTime":100651,"nextInTime":100653,"topicId":100646,"numMessagesInTopic":0,"msgSnippet":"... Hey I like this idea. It does sound like work, but what difference is it if I work on meals they won t eat anyway now? Thank you. Julie B","messageBody":"<div id=\"ygrps-yiv-673711565\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, rubyprincesstsg@a... wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Could you ask each family member to come up with five meals that they would  <br/>\n&gt; eat?  Full meals, not just the entree.  Then compile them, make a list  and <br/>\n&gt; let each family member say what they absolutely would not eat under any  <br/>\n&gt; circumstances.<br/>\n&gt;  <br/>\n&gt; Then use the pared down list (assuming you will get more than five meal  <br/>\n&gt; choices), then post a weekly menu of sorts so that each person knows what you  <br/>\n&gt; will be serving.  If it&#39;s someone&#39;s favorite and another simply is not  going to <br/>\n&gt; eat it, then there might be a way of having a side dish that is filling  for <br/>\n&gt; that person, or have them make themselves a simple meal they will  enjoy.<br/>\n&gt;  <br/>\n&gt; I&#39;m sure it is extra hard when there are so many dislikes but maybe if they  <br/>\n&gt; feel they have a part in the planning they&#39;ll be more inclined to eat the <br/>\n&gt; meals,  even if it isn&#39;t their favorite.<br/>\n<br/>\n </span></blockquote>Hey I like this idea. It does sound like work, but what difference is it if I work on meals <br/>\nthey won&#39;t eat anyway now?<br/>\n<br/>\nThank you.<br/>\n<br/>\nJulie B</div>","specialLinks":[]},{"userId":8151304,"authorName":"rubyprincesstsg@aol.com","from":"rubyprincesstsg@...","profile":"rubyprincesstsg","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Food that pleases","postDate":"1097892929","msgId":100651,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRjLjE2ZGQ3ZDE4LjJlYTFkZTQxQGFvbC5jb20+"},"prevInTopic":100650,"nextInTopic":100652,"prevInTime":100650,"nextInTime":100652,"topicId":100646,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/15/2004 7:40:43 PM Eastern Daylight Time, julie@bravewriter.com writes: Sorry to  whine, but food prep takes up such a huge percentage of","messageBody":"<div id=\"ygrps-yiv-1224400482\">In a message dated 10/15/2004 7:40:43 PM Eastern Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:julie@...\">julie@...</a> writes:<br/>\n<br/>\nSorry to  whine, but food prep takes up such a huge percentage of my life and <br/>\nI hate  that I <br/>\ncan&#39;t please a critical mass of people more often. Some days it  just drains <br/>\nmy enthusiasm <br/>\nfor the other hours of the  day.<br/>\n<br/>\nJulie<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nCould you ask each family member to come up with five meals that they would  <br/>\neat?  Full meals, not just the entree.  Then compile them, make a list  and <br/>\nlet each family member say what they absolutely would not eat under any  <br/>\ncircumstances.<br/>\n <br/>\nThen use the pared down list (assuming you will get more than five meal  <br/>\nchoices), then post a weekly menu of sorts so that each person knows what you  <br/>\nwill be serving.  If it&#39;s someone&#39;s favorite and another simply is not  going to <br/>\neat it, then there might be a way of having a side dish that is filling  for <br/>\nthat person, or have them make themselves a simple meal they will  enjoy.<br/>\n <br/>\nI&#39;m sure it is extra hard when there are so many dislikes but maybe if they  <br/>\nfeel they have a part in the planning they&#39;ll be more inclined to eat the <br/>\nmeals,  even if it isn&#39;t their favorite.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2300774,"authorName":"Elizabeth Hill","from":"Elizabeth Hill &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Food that pleases","postDate":"1097887789","msgId":100650,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxNzA3MDJELjQwOTAwMDFAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PGNrcGwxbCtodm5kQGVHcm91cHMuY29tPg==","referencesHeader":"PGNrcGwxbCtodm5kQGVHcm91cHMuY29tPg=="},"prevInTopic":100649,"nextInTopic":100651,"prevInTime":100649,"nextInTime":100651,"topicId":100646,"numMessagesInTopic":0,"msgSnippet":"** Dinner is becoming such a depressing time for me. How many times a week can we eat Mexican, pizza and black beans with rice?** It does sound tough. What","messageBody":"<div id=\"ygrps-yiv-1618938582\">** Dinner is becoming such a depressing time for me. How many times a <br/>\nweek can we eat<br/>\nMexican, pizza and black beans with rice?**<br/>\n<br/>\nIt does sound tough.<br/>\n<br/>\nWhat comes to mind for me is that apparently the kids don&#39;t mind <br/>\nrepetition the way you do.  Therefore, I&#39;d be inclined to feed them <br/>\nleftover black beans and rice or pizza on some nights on which you cook <br/>\nwhat you like for yourself.  If your kids are eating these foods and <br/>\nmaybe some fruit (or even juice) then they are probably covering their <br/>\nnutritional needs.<br/>\n<br/>\nIs it the salt that makes the popcorn so appealing?  Or the butter?  <br/>\nWould putting more salt and butter in other foods help &quot;sell&quot; them?<br/>\n<br/>\nBetsy<br/>\n<br/>\n** For what it&#39;s worth....here&#39;s what works for our family, which <br/>\nincludes one<br/>\nvegetarian teen and a hubby who can&#39;t eat tomato sauces.**<br/>\n<br/>\nAlmost all my favorite foods have tomato in them, so when my husband <br/>\nstarted having heartburn and avoiding tomatoes my desire to cook really <br/>\nplummeted.</div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] Food that pleases","postDate":"1097887496","msgId":100649,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PGNrcGwxbCtodm5kQGVHcm91cHMuY29tPg=="},"prevInTopic":100648,"nextInTopic":100650,"prevInTime":100648,"nextInTime":100650,"topicId":100646,"numMessagesInTopic":0,"msgSnippet":"Julie, how frustrating for you! After Jayn started eating solids, I became irritated by having to prepare only three different things (and hers were nothing)","messageBody":"<div id=\"ygrps-yiv-788954963\">Julie, how frustrating for you!<br/>\n<br/>\nAfter Jayn started eating solids, I became irritated by having to prepare<br/>\nonly three different things (and hers were nothing) as I was a vegetarian<br/>\nbut dh was not. I have a small inkling of what you are feeling, although by<br/>\nno means did I have as much to deal with. I ended up changing my eating to<br/>\nfit with him, just because it was simpler for me.<br/>\n<br/>\n&lt;&lt;&lt;&lt;&lt;I&#39;m about sick to death of our repeated meals (the five that please<br/>\nmost of the family). And <br/>\neven within that five, there are only two that everyone in the family will<br/>\neat (Mexican and <br/>\nblack beans/or lentils with rice).&gt;&gt;&gt;&gt;<br/>\n<br/>\nWhere I live in Los Angeles there are so many options for Mexican food<br/>\navailable in the supermarket including almost instant refried beans, and<br/>\nlots of frozen stuff and takeouts. Maybe you could have more of that<br/>\navailable that the older kids could at least toss in the microwave if they<br/>\ndidn&#39;t like the meal you are cooking for dh and yourself.<br/>\n<br/>\n&lt;&lt;&lt;&lt;They will end up eating microwave popcorn if I <br/>\nhave it or chips. I can&#39;t afford to have chips and popcorn as their primary<br/>\nfood stuff!&gt;&gt;&gt;<br/>\n<br/>\nJayn goes through periods when she wants to eat microwave popcorn several<br/>\ntimes a day. The same with chips. I find it only lasts a few days. I get the<br/>\nsnack size packs, which still make a sizeable portion, and there is less<br/>\nwaste. If anyone knows of a way to &quot;keep&quot; the popped popcorn fresh I would<br/>\nlove to hear it.<br/>\n<br/>\n&lt;&lt;&lt;&lt;Dinner is becoming such a depressing time for me. How many times a week<br/>\ncan we eat <br/>\nMexican, pizza and black beans with rice? They do love these foods and will<br/>\neat them. But <br/>\nI&#39;m so sick of them. If I make chicken, my 17 yr old won&#39;t eat it. Chicken<br/>\nand potatoes is a <br/>\nsure fire way for him to starve..... snip..... <br/>\nAnd now that my dd is vegetarian, she can&#39;t eat almost anything I make. I<br/>\nend up having to <br/>\nmake her different food every night. She hardly eats lunch any more (she<br/>\nwon&#39;t eat sandwiches like PB and J or cream cheese and ?). She will eat some<br/>\nof the meatless frozen stuff but gets bored easily. She doesn&#39;t complain<br/>\nreally, but she is half starving all the time and ends up eating Ritz<br/>\ncrackers and ice cream. Hardly a healthy diet!&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nA short period of a less than optimum diet won&#39;t really hurt these older<br/>\nkids, especially if they take some vitamins.<br/>\n<br/>\nI want to suggest that it might help to turn responsibility for their own<br/>\nfood over to the two older ones. They are old enough to do at least some of<br/>\ntheir own cooking surely. What if they went with you to the store and had<br/>\ntheir own buggies that they could use to buy the food that they will eat -<br/>\nperhaps hand them the portion of the family budget that would encompass<br/>\ntheir meals normally as the way for them to pay. Then they get to choose it<br/>\nand deal with it at home. I expect microwave meals might take up a good<br/>\nproportion of it - at least at first. <br/>\n<br/>\nIf it works out that they love this arrangement at least part of your<br/>\nproblem is solved. If it works out that this becomes really difficult, then<br/>\nat least they might gain an appreciation for the efforts you have been<br/>\nmaking! <br/>\n<br/>\n&lt;&lt;&lt;&lt;&lt;I still have to contend with hungry <br/>\npeople who forage through my cupboards and complain all day that they are<br/>\nhungry.&gt;&gt;&gt;&gt;<br/>\n<br/>\nAren&#39;t they their cupboards too? I hope you can find some detachment to<br/>\ntheir complaints. My dh gets complaining like that sometimes - he is pretty<br/>\npicky, compared to me anyway - so I know it is hard not to take it as some<br/>\nkind of personal criticism. <br/>\n<br/>\n&lt;&lt;&lt;&lt;I&#39;m really angry tonight. I made a really tasty meal and no one ate it.<br/>\nWhat a waste of shopping, money and effort. I was going to make dessert but<br/>\nI don&#39;t have the heart to create something tasty to have everyone opt for<br/>\nice cream and turn their noses up at what I prepare.&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n(((((Julie)))))<br/>\nAs someone who is a mediocre cook at best, I would love the opportunity to<br/>\nnot cook. I wish you could come over here and cook for me - believe me you<br/>\nwould get enormous amounts of appreciation!!<br/>\n<br/>\nRobyn L. Coburn<br/>\n<br/>\n<br/>\n<br/>\n---<br/>\nOutgoing mail is certified Virus Free.<br/>\nChecked by AVG anti-virus system (http://www.grisoft.com).<br/>\nVersion: 6.0.773 / Virus Database: 520 - Release Date: 10/5/2004</div>","specialLinks":[]},{"userId":119145590,"authorName":"April M","from":"&quot;April M&quot; &lt;abmorris23@...&gt;","profile":"klkb624","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] Food that pleases","postDate":"1097884967","msgId":100648,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PE5IQkJLT1BDS0xHR0NQQUlOREpES0VHS0ZOQUEuYWJtb3JyaXMyM0Bjb21jYXN0Lm5ldD4=","inReplyToHeader":"PGNrcGwxbCtodm5kQGVHcm91cHMuY29tPg=="},"prevInTopic":100647,"nextInTopic":100649,"prevInTime":100647,"nextInTime":100649,"topicId":100646,"numMessagesInTopic":0,"msgSnippet":"For what it s worth....here s what works for our family, which includes one vegetarian teen and a hubby who can t eat tomato sauces. I always have lots of","messageBody":"<div id=\"ygrps-yiv-2094594128\">For what it&#39;s worth....here&#39;s what works for our family, which includes one<br/>\nvegetarian teen and a hubby who can&#39;t eat tomato sauces.<br/>\nI always have lots of cheap do-it-yourself options available (mac & cheese,<br/>\nbagels, ramen soup, instant potatoes, cans of soup)...as long as there&#39;s no<br/>\nmess for me and no one says anything negative about my food, they are free<br/>\nto make something else.  I encourage the younger ones to at least taste what<br/>\nI make.<br/>\n<br/>\nI do a lot of prep and let the family do the final fixings. For example, for<br/>\ntacos I have soft and hard shells, meat, beans and the usual fixings all in<br/>\nbowls. Everyone makes their favorites.<br/>\nSpaghetti: I make pasta of some kind, Open a jar of regular sauce, a jar of<br/>\nwhite sauce, a bowl of pre-cooked meatballs or ground meat, shredded<br/>\ncheese...everyone puts together their own plate.<br/>\nPizza: I use English muffins, I put sauce on (except for hubby&#39;s), and have<br/>\nbowls of fixings...everyone comes and makes however many they want, with<br/>\nwhat they want. I get the works (onions, pepperoni, gr. peppers, olives,<br/>\ngarlic....)<br/>\nI do salads the same way. Throw the lettuce in a bowl and have fixings on<br/>\nthe side.<br/>\n<br/>\nI also consider it a success if at least three of us like whatever I make.<br/>\nIf I&#39;m going to make a roast or soup, I just make sure I have some good<br/>\nbread and veggies and cheese available on the side.   And since I would<br/>\nnever want to be forced to eat something I don&#39;t like, I don&#39;t force my<br/>\nkids...and try not to be bothered. It&#39;s easier now.  They are all pretty<br/>\nself-sufficient and willing to try new things. And finally after years of<br/>\nthinking it wouldn&#39;t happen they mostly appreciate the cooking that I do (on<br/>\nthe other hand...maybe they&#39;re just glad I cook some days.....I can get<br/>\npretty bad about it some weeks!)  They also do some of the cooking which<br/>\ntakes the pressure off of me.<br/>\n~April<br/>\nMom to Kate-18, Lisa-15, Karl-13, & Ben-9.<br/>\n*REACH Homeschool Group, an inclusive group meeting throughout Oakland<br/>\nCounty.. <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.homeschoolingonashoestring.com/REACH_home.html\">http://www.homeschoolingonashoestring.com/REACH_home.html</a><br/>\n*Michigan Youth Theater...Acting On Our Dreams...<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.michiganyouththeater.org/\">http://www.michiganyouththeater.org/</a>&gt;<br/>\n&quot;Life is 10% what happens to us and 90% how we react to it.&quot; ~~ Dennis P.<br/>\nKimbro<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  -----Original Message-----<br/>\n  From: Julie Bogart [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:julie@...\">julie@...</a>]<br/>\n  Sent: Friday, October 15, 2004 7:04 PM<br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a><br/>\n  Subject: [UnschoolingDiscussion] Food that pleases<br/>\n<br/>\n<br/>\n<br/>\n  I&#39;m about sick to death of our repeated meals (the five that please most<br/>\nof the family). And<br/>\n  even within that five, there are only two that everyone in the family will<br/>\neat (Mexican and<br/>\n  black beans/or lentils with rice).<br/>\n<br/>\n  I am not an exotic cook. We&#39;re talking kids who won&#39;t eat baked potatoes,<br/>\nspaghetti, oven<br/>\n  baked chicken and tonight, meatloaf!<br/>\n<br/>\n  I want so much to make interesting food again (like I did when we were<br/>\nyounger and my<br/>\n  kids were either toddler eaters or breastfeeders). I miss flavor and<br/>\nvariety. My kids are just<br/>\n  driving me batty. They won&#39;t even eat sandwiches and yet every single week<br/>\nwe go to a co-<br/>\n  op that requires a bagged lunch. I started making my old stand-by (pasta<br/>\nsalad) which is a<br/>\n  favorite with the family... except my 10 yr old. So he never wants that<br/>\nfor Monday lunch.<br/>\n  Even during the week, I cook lunch every day because no one will eat the<br/>\nnormal American<br/>\n  lunch foods.<br/>\n<br/>\n  For co-op, they basically take chips and a drink. Isn&#39;t that pathetic!? If<br/>\nI make pasta salad,<br/>\n  then the 13 yr old will take it but the 8 yr old will take it and not eat<br/>\nit. We get home from<br/>\n  co-op and they are understandably ravenous. They complain all afternoon<br/>\nuntil dinner<br/>\n  which they sometimes barely eat. I might put out cheese and apple slices,<br/>\npeanut butter<br/>\n  and crackers. Nope. Not good enough. They will end up eating microwave<br/>\npopcorn if I<br/>\n  have it or chips. I can&#39;t afford to have chips and popcorn as their<br/>\nprimary food stuff!<br/>\n<br/>\n  Dinner is becoming such a depressing time for me. How many times a week<br/>\ncan we eat<br/>\n  Mexican, pizza and black beans with rice? They do love these foods and<br/>\nwill eat them. But<br/>\n  I&#39;m so sick of them. If I make chicken, my 17 yr old won&#39;t eat it. Chicken<br/>\nand potatoes is a<br/>\n  sure fire way for him to starve. If I make chicken soup, the younger two<br/>\nwon&#39;t eat it. If I<br/>\n  make stir-fry, two fo the boys won&#39;t eat it. If I make anything with too<br/>\nmany vegetables,<br/>\n  none of them will eat it. I make chili once a week to help me on Thursday<br/>\nnights when I go<br/>\n  to grad school, I have to make a special kind for my vegetarian daughter<br/>\n(15) and my 10 yr<br/>\n  old boy won&#39;t eat either kind.<br/>\n<br/>\n  I&#39;m tearing my hair out.<br/>\n<br/>\n  I love to make stew in winter, but only Jon and I will eat that.<br/>\n<br/>\n  Even something simple like over fried chicken and french fries isn&#39;t<br/>\nuniversally received.<br/>\n  And now that my dd is vegetarian, she can&#39;t eat almost anything I make. I<br/>\nend up having to<br/>\n  make her different food every night. She hardly eats lunch any more (she<br/>\nwon&#39;t eat<br/>\n  sandwiches like PB and J or cream cheese and ?). She will eat some of the<br/>\nmeatless frozen<br/>\n  stuff but gets bored easily. She doesn&#39;t complain really, but she is half<br/>\nstarving all the time<br/>\n  and ends up eating Ritz crackers and ice cream. Hardly a healthy diet!<br/>\n<br/>\n  I&#39;m so discouraged and sick to death of our meals. When my mom was here I<br/>\nmade this<br/>\n  gorgeous Nicoise salad with real Ahi tuna and felt I had died and gone to<br/>\nheaven. If I put<br/>\n  all the effort in to make that meal, I will be the only person in the<br/>\nwhole family to eat it<br/>\n  and be full. I know I can &quot;cook what I want to eat&quot; but I still have to<br/>\ncontend with hungry<br/>\n  people who forage through my cupboards and complain all day that they are<br/>\nhungry.<br/>\n<br/>\n  Anyone else struggle with the food factor?<br/>\n<br/>\n  I&#39;m really angry tonight. I made a really tasty meal and no one ate it.<br/>\nWhat a waste of<br/>\n  shopping, money and effort. I was going to make dessert but I don&#39;t have<br/>\nthe heart to<br/>\n  create something tasty to have everyone opt for ice cream and turn their<br/>\nnoses up at what<br/>\n  I prepare.<br/>\n<br/>\n  Sorry to whine, but food prep takes up such a huge percentage of my life<br/>\nand I hate that I<br/>\n  can&#39;t please a critical mass of people more often. Some days it just<br/>\ndrains my enthusiasm<br/>\n  for the other hours of the day.<br/>\n<br/>\n  Julie<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  &quot;List Posting Policies&quot; are provided in the files area of this group.<br/>\n<br/>\n  Visit the Unschooling website and message boards:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n<br/>\n<br/>\n        Yahoo! Groups Sponsor<br/>\n              ADVERTISEMENT<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n----------------------------------------------------------------------------<br/>\n--<br/>\n  Yahoo! Groups Links<br/>\n<br/>\n    a.. To visit your group on the web, go to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/UnschoolingDiscussion/\">http://groups.yahoo.com/group/UnschoolingDiscussion/</a><br/>\n<br/>\n    b.. To unsubscribe from this group, send an email to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a><br/>\n<br/>\n    c.. Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service.<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":122454986,"authorName":"Sara","from":"&quot;Sara&quot; &lt;cheeps4u@...&gt;","profile":"cheeps4u","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Food that pleases","postDate":"1097882004","msgId":100647,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNrcGxpayt1YjRhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGNrcGwxbCtodm5kQGVHcm91cHMuY29tPg=="},"prevInTopic":100646,"nextInTopic":100648,"prevInTime":100646,"nextInTime":100648,"topicId":100646,"numMessagesInTopic":0,"msgSnippet":"Julie....I hear your anger and pain. Somewhere along the line, we ve become short order cooks and it s killing me too. Now that my kids are older, I quit","messageBody":"<div id=\"ygrps-yiv-14498047\">Julie....I hear your anger and pain. Somewhere along the line, we&#39;ve <br/>\nbecome short order cooks and it&#39;s killing me too. Now that my kids <br/>\nare older, I quit cooking because of the same problem you <br/>\nhave....they wouldn&#39;t eat what I fixed and would not have it as a <br/>\nleftover the next meal or day. <br/>\n<br/>\nI feel so badly about this but I&#39;m tired of wasting food. <br/>\n<br/>\nI thought we were the only ones to eat microwave popcorn for a meal. <br/>\nThis is so not funny. Sara in NC</div>","specialLinks":[]},{"userId":77522235,"authorName":"Julie Bogart","from":"&quot;Julie Bogart&quot; &lt;julie@...&gt;","profile":"juliecinci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Food that pleases","postDate":"1097881461","msgId":100646,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNrcGwxbCtodm5kQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":100647,"prevInTime":100645,"nextInTime":100647,"topicId":100646,"numMessagesInTopic":0,"msgSnippet":"I m about sick to death of our repeated meals (the five that please most of the family). And even within that five, there are only two that everyone in the","messageBody":"<div id=\"ygrps-yiv-1982075859\">I&#39;m about sick to death of our repeated meals (the five that please most of the family). And <br/>\neven within that five, there are only two that everyone in the family will eat (Mexican and <br/>\nblack beans/or lentils with rice).<br/>\n<br/>\nI am not an exotic cook. We&#39;re talking kids who won&#39;t eat baked potatoes, spaghetti, oven <br/>\nbaked chicken and tonight, meatloaf!<br/>\n<br/>\nI want so much to make interesting food again (like I did when we were younger and my <br/>\nkids were either toddler eaters or breastfeeders). I miss flavor and variety. My kids are just <br/>\ndriving me batty. They won&#39;t even eat sandwiches and yet every single week we go to a co-<br/>\nop that requires a bagged lunch. I started making my old stand-by (pasta salad) which is a <br/>\nfavorite with the family... except my 10 yr old. So he never wants that for Monday lunch. <br/>\nEven during the week, I cook lunch every day because no one will eat the normal American <br/>\nlunch foods.<br/>\n<br/>\nFor co-op, they basically take chips and a drink. Isn&#39;t that pathetic!? If I make pasta salad, <br/>\nthen the 13 yr old will take it but the 8 yr old will take it and not eat it. We get home from <br/>\nco-op and they are understandably ravenous. They complain all afternoon until dinner <br/>\nwhich they sometimes barely eat. I might put out cheese and apple slices, peanut butter <br/>\nand crackers. Nope. Not good enough. They will end up eating microwave popcorn if I <br/>\nhave it or chips. I can&#39;t afford to have chips and popcorn as their primary food stuff!<br/>\n<br/>\nDinner is becoming such a depressing time for me. How many times a week can we eat <br/>\nMexican, pizza and black beans with rice? They do love these foods and will eat them. But <br/>\nI&#39;m so sick of them. If I make chicken, my 17 yr old won&#39;t eat it. Chicken and potatoes is a <br/>\nsure fire way for him to starve. If I make chicken soup, the younger two won&#39;t eat it. If I <br/>\nmake stir-fry, two fo the boys won&#39;t eat it. If I make anything with too many vegetables, <br/>\nnone of them will eat it. I make chili once a week to help me on Thursday nights when I go <br/>\nto grad school, I have to make a special kind for my vegetarian daughter (15) and my 10 yr <br/>\nold boy won&#39;t eat either kind.<br/>\n<br/>\nI&#39;m tearing my hair out.<br/>\n<br/>\nI love to make stew in winter, but only Jon and I will eat that.<br/>\n<br/>\nEven something simple like over fried chicken and french fries isn&#39;t universally received. <br/>\nAnd now that my dd is vegetarian, she can&#39;t eat almost anything I make. I end up having to <br/>\nmake her different food every night. She hardly eats lunch any more (she won&#39;t eat <br/>\nsandwiches like PB and J or cream cheese and ?). She will eat some of the meatless frozen <br/>\nstuff but gets bored easily. She doesn&#39;t complain really, but she is half starving all the time <br/>\nand ends up eating Ritz crackers and ice cream. Hardly a healthy diet!<br/>\n<br/>\nI&#39;m so discouraged and sick to death of our meals. When my mom was here I made this <br/>\ngorgeous Nicoise salad with real Ahi tuna and felt I had died and gone to heaven. If I put <br/>\nall the effort in to make that meal, I will be the only person in the whole family to eat it <br/>\nand be full. I know I can &quot;cook what I want to eat&quot; but I still have to contend with hungry <br/>\npeople who forage through my cupboards and complain all day that they are hungry.<br/>\n<br/>\nAnyone else struggle with the food factor?<br/>\n<br/>\nI&#39;m really angry tonight. I made a really tasty meal and no one ate it. What a waste of <br/>\nshopping, money and effort. I was going to make dessert but I don&#39;t have the heart to <br/>\ncreate something tasty to have everyone opt for ice cream and turn their noses up at what <br/>\nI prepare.<br/>\n<br/>\nSorry to whine, but food prep takes up such a huge percentage of my life and I hate that I <br/>\ncan&#39;t please a critical mass of people more often. Some days it just drains my enthusiasm <br/>\nfor the other hours of the day.<br/>\n<br/>\nJulie</div>","specialLinks":[]}],"prevTopicId":100705,"nextTopicId":100703}}