{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":8151304,"authorName":"rubyprincesstsg@aol.com","from":"rubyprincesstsg@...","profile":"rubyprincesstsg","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] long exchange about a teen (longest post EVER)","postDate":"1116888000","msgId":106127,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFmMS4zYzM3OTc0Yi4yZmMzYjVjMEBhb2wuY29tPg=="},"prevInTopic":106123,"nextInTopic":0,"prevInTime":106126,"nextInTime":106128,"topicId":106116,"numMessagesInTopic":0,"msgSnippet":"I have a son who will be 21 at the end of August.  He graduated from traditional high school.  He tried different parts of three semesters of  community ","messageBody":"<div id=\"ygrps-yiv-1096458993\">I have a son who will be 21 at the end of August.  He graduated from  <br/>\ntraditional high school.  He tried different parts of three semesters of  community <br/>\ncollege, only finishing one of them.<br/>\n <br/>\nHe&#39;s been &quot;in the basement&quot; for a year.  Trying to figure things out,  mostly <br/>\nwithin himself.<br/>\n <br/>\nHe took meds for depression and I saw a dramatic improvement.  He felt  <br/>\nbetter so he stopped taking them.  Another downward spiral.<br/>\n <br/>\nAll his friends are in college away from home.  All his friends are  doing <br/>\nthis or that.  All his friends...  I remind him often that I  love him, that I <br/>\nwill help him if he needs/wants it.<br/>\n <br/>\nI also ran interference with the dad who would ask daily about John and if  <br/>\nhe planned to get a job or go to school or what...<br/>\n <br/>\nI said to him (and others that asked), with dead seriousness;  &quot;you  all KNOW <br/>\nJohn is training to be a cage fighter&quot;.  That never failed to  lighten the <br/>\nmood and change the subject.<br/>\n <br/>\nHe is working a job now doing landscaping for a local golf course.   He&#39;s <br/>\nseeming to like it and feel better about himself.  I think he might  have needed <br/>\na little push/pull/lift to get out more but he resisted all manner  of <br/>\nanything I offered.<br/>\n <br/>\nI felt he needed that time to himself and was there if he needed me.   It&#39;s a <br/>\nhard time for boys/men/nearly men.  I&#39;d be depressed too if I  thought the <br/>\nworld expected me to run out and get a job and work every single day  for the <br/>\nrest of my life and do something important with myself.<br/>\n <br/>\nEven though we can reassure our children we don&#39;t expect the same things,  <br/>\nsometimes they put inner expectations on themselves based on their  friends.  <br/>\nOften their friends have really pushy parents that have lots of  expectations.<br/>\n <br/>\nI just wanted to let you know that even kids who graduate from a  traditional <br/>\nhigh school sometimes go through the same thing as your son.<br/>\n <br/>\nI can&#39;t say how it all ends up yet, the story is still being written, by  <br/>\nJohn, as he goes.<br/>\n <br/>\nglena<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] restless periods was  long exchange about teen","postDate":"1116880586","msgId":106123,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFjOC4yOTVjZDk1OC4yZmMzOThjYUBhb2wuY29tPg=="},"prevInTopic":106122,"nextInTopic":106127,"prevInTime":106122,"nextInTime":106124,"topicId":106116,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/23/2005 1:43:27 PM Mountain Daylight Time, arcarpenter@gmail.com writes: -=-_When  Things Fall Apart:  Heart Advice for Difficult Times_","messageBody":"<div id=\"ygrps-yiv-1141973534\">In a message dated 5/23/2005 1:43:27 PM Mountain Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:arcarpenter@...\">arcarpenter@...</a> writes:<br/>\n<br/>\n-=-_When  Things Fall Apart:  Heart Advice for Difficult Times_ by the<br/>\nAmerican  Buddhist nun, Pema Chodron.  It sounds like it&#39;s  about<br/>\nearth-shattering tragedy, from the title, but she&#39;s really  talking<br/>\nabout how things come together and fall apart, over and over again.  <br/>\nAnd how we keep stepping out of the moment to find resolution for<br/>\nthat,  when there&#39;s not actual resolution to be had.-=-<br/>\n<br/>\n<br/>\n<br/>\n======<br/>\n <br/>\nSometimes I have a feeling like something going to happen, and like people  <br/>\nare thinking about me behind my back.&lt;g&gt;  It will last a week or so  and then <br/>\nsomething all new and different will happen.  It&#39;s happened half a  dozen times <br/>\nover the past fifteen years or so.  It&#39;s a little like  cocooning up and then <br/>\nbutterflying out.  But during the still time I get an  almost creepy, scary <br/>\nfeeling, like I&#39;ll never do anything right or interesting  or useful again, <br/>\nEVER, in my Whole LIFE!   And then it flutters on out  of me.<br/>\n <br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2300774,"authorName":"Elizabeth Hill","from":"Elizabeth Hill &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] long exchange about a teen (longest post EVER)","postDate":"1116880577","msgId":106122,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyOTIzRUMxLjYwOTAyMDFAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PDI1LjYwMDVmODA1LjJmYzM3NTZhQGFvbC5jb20+","referencesHeader":"PDI1LjYwMDVmODA1LjJmYzM3NTZhQGFvbC5jb20+"},"prevInTopic":106121,"nextInTopic":106123,"prevInTime":106121,"nextInTime":106123,"topicId":106116,"numMessagesInTopic":0,"msgSnippet":"** The money for the  teeth (of which we will pay $2000 regardless of insurance) threw me for a  total loop and worried me... I wondered what it meant instead","messageBody":"<div id=\"ygrps-yiv-1534238907\">**<br/>\n<br/>\nThe money for the  teeth (of which we will pay $2000 regardless of <br/>\ninsurance) threw me for a  total loop and worried me... I wondered what <br/>\nit meant instead of just  figuring out how to pay for it.**<br/>\n<br/>\nI&#39;ve had screw-ups like this myself.  One December, we were transitioning from Cobra to no dental insurance (I think), something where we had no coverage after 12/31 and I went in earlier in the month of December for a cleaning and discovered unexpected work that needed to be done, and the dentist had planned to be on vacation for the last two weeks of the year and couldn&#39;t fit me in.  (At the time, I was kicking myself too hard to think of going to a different dentist, but now my thoughts are clearer.)<br/>\n<br/>\nMoral:  the kicking of oneself or others in the ass and the hand-wringing about bad newsdon&#39;t contribute much to solving the problem or preventing future problems.<br/>\n<br/>\nBetsy</div>","specialLinks":[]},{"userId":2300774,"authorName":"Elizabeth Hill","from":"Elizabeth Hill &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] long exchange about a teen (longest post EVER)","postDate":"1116880326","msgId":106121,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyOTIzREM2LjYwNTA4MDVAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PDI1LjYwMDVmODA1LjJmYzM3NTZhQGFvbC5jb20+","referencesHeader":"PDI1LjYwMDVmODA1LjJmYzM3NTZhQGFvbC5jb20+"},"prevInTopic":106120,"nextInTopic":106122,"prevInTime":106120,"nextInTime":106122,"topicId":106116,"numMessagesInTopic":0,"msgSnippet":"I know this has got to be hard for you. Try to let go of making comparisons.  That includes comparisons with real 18 year olds that you know (esp. his","messageBody":"<div id=\"ygrps-yiv-1194829037\">I know this has got to be hard for you. Try to let go of making <br/>\ncomparisons.  That includes comparisons with real 18 year olds that you <br/>\nknow (esp. his siblings), and comparisons with the imaginary 18 year old <br/>\nthat you thought he might become.  Set that aside and just look at <br/>\nwhether he is making progress from year to year.  If he is unhappier and <br/>\nless functional now than he was last year, that might reveal a problem.  <br/>\nIs he mostly happy?  Can he discuss his unhappiness with a more neutral <br/>\nparty?<br/>\n<br/>\n**He complains of feeling like he&#39;s never accomplished anything, he <br/>\nthinks he isn&#39;t capable like students in school (not true - his natural <br/>\nintelligence is high and he does surprisingly well on the ACT/SAT <br/>\ntests), and he talks like he isn&#39;t ever going to be able to hold down a <br/>\njob or sustain work in a classroom format. He believes he can&#39;t sustain <br/>\nhis attention unless he is riveted and even then, he needs lots of <br/>\nbreaks and changes of pace to keep from getting too bored. He says that <br/>\nthe Internet is like an addiction.**<br/>\n<br/>\nThe paragraph above suggest ADD, and sounds really familiar to me.<br/>\n<br/>\nThe paragraph below suggests *depression*.<br/>\n<br/>\n**<br/>\nYesterday we attended a graduation  party for our best friend&#39;s youngest <br/>\ndaughter. He realized that he hasn&#39;t  had a party like this (had said he <br/>\ndidn&#39;t want one back when we discussed  it) and then started saying how <br/>\nhe wouldn&#39;t have enough friends to come to  something like this and that <br/>\nhe hasn&#39;t achieved anything and has nowhere to  go next. Yet even as we <br/>\ntalk, he ends up resisting any ideas for direction  or steps to take in <br/>\nthe meantime.**<br/>\n<br/>\n<br/>\nI can relate to your 18 year old son, because I sometimes sit around and think &quot;blah, blahbety blah, I haven&#39;t accomplished anything with my life.&quot;  (I get both distracted easily and tired easily.)  (And washing clothes just *doesn&#39;t* feel like an accomplishment.)  Part of what I struggle with is figuring out which of my interests (or tasks) is most important.  My tendency is to do just a little bit of several things, preferably simultaneously. &lt;g&gt;<br/>\n<br/>\nA book that I like about learning differences, that includes having scattered mental energy (as one of the learning issues) is Mel Levine&#39;s book -- The Myth of Laziness.  (Heck, just the title might make your son feel better.)<br/>\n<br/>\nA book that I like about depression is Feeling Good, the New Mood Therapy, by David Burns.  (Although I&#39;m sure there are better books specifically focused on depression.)  In my experience, the majority of people who are depressed can&#39;t perceive that they are and deny it.  But when people are unhappy with themselves, that&#39;s a strong sign that they may be depressed.  (Being unhappy with life events is somewhat.)  There are online quizzes for assessing depression, if that would help create motivation to seek treatment.  My one question assessment is does someone agree with the following statement &quot;I am worthless&quot; or &quot;I am shit&quot;.  That pretty much ices it!<br/>\n<br/>\nBut in addition to the two diagnostic labels that I&#39;ve thrown out, I agree with Sandra.  It doesn&#39;t sound like all the comparisons and sense of himself as failing comparing to others are coming from him.  Backing off on your judgements and desire that he grow up and get serious may really help.  Even as an adult, I&#39;m personally very resistant when my mom wants me to do something for my own good.  It takes all the fun out of it.  I really don&#39;t like being pushed to do things just to help someone else, especially when it conflicts with what I would prefer to do.  (I would particularly prefer to make my own decisions.)<br/>\n<br/>\nI just started reading Parent Teen Breakthrough which is a relationship-oriented book for parents of teens.  Some of the ideas in there may help you get back to the relationship you want to have.<br/>\n<br/>\n(Par for the course, I just recommended three books.  Obviously I&#39;m stuck on books.)<br/>\n<br/>\nPlaying around with something is the best way to learn it.  Rote memorization has been shown to be not very effective.  Drudgery may seem like the path to success but I doubt that it is the path to happiness.<br/>\n<br/>\nBetsy<br/>\n<br/>\n<br/>\nPS  Stray thought --<br/>\n<br/>\nMaybe he likes learning Klingon because so few people know it that he&#39;s <br/>\ndistancing himself from potential competition?<br/>\n<br/>\nPPS  I have a childhood friend who at 18 went to a very prestigious <br/>\ncollege, then law school and then discovered he didn&#39;t LIKE being a <br/>\nlawyer!!!  I bet his mom didn&#39;t take back all of the bragging that she <br/>\nhad done when he was on the &quot;fast track&quot; to success. &lt;g&gt;<br/>\n<br/>\nPPPS  Final disclaimer: I don&#39;t have a teenager so I haven&#39;t really been <br/>\nin your shoes.  But my 11 year old son loves videogaming above pretty <br/>\nmuch any academic sounding interest.  I hope when my son is 18, you&#39;ll <br/>\nbe there to hold my hand and tell me that your son is happily engaged <br/>\nwith life.</div>","specialLinks":[]},{"userId":201436708,"authorName":"arcarpenter2003","from":"&quot;arcarpenter2003&quot; &lt;arcarpenter@...&gt;","profile":"arcarpenter2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"restless periods was  long exchange about teen","postDate":"1116877283","msgId":106120,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQ2dGJsNCtjYjZ0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDI1LjYwMDVmODA1LjJmYzM3NTZhQGFvbC5jb20+"},"prevInTopic":106116,"nextInTopic":106121,"prevInTime":106119,"nextInTime":106121,"topicId":106116,"numMessagesInTopic":0,"msgSnippet":"... ==Haven t you or your husband ever had restless, angsty periods of time where ... uncomfortable? == I am currently reading a book that I m finding very","messageBody":"<div id=\"ygrps-yiv-1285976464\"><blockquote><span title=\"qreply\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, SandraDodd@a... wrote:<br/>\n==Haven&#39;t you or your husband ever had restless, angsty periods of<br/>\ntime where  <br/>\n&gt; you didn&#39;t know what was going to happen next and it was<br/>\nuncomfortable? ==<br/>\n<br/>\nI am currently reading a book that I&#39;m finding very helpful about<br/>\nthose restless, uncomfortable times.<br/>\n<br/>\n_When Things Fall Apart:  Heart Advice for Difficult Times_ by the<br/>\nAmerican Buddhist nun, Pema Chodron.  It sounds like it&#39;s about<br/>\nearth-shattering tragedy, from the title, but she&#39;s really talking<br/>\nabout how things come together and fall apart, over and over again. <br/>\nAnd how we keep stepping out of the moment to find resolution for<br/>\nthat, when there&#39;s not actual resolution to be had.<br/>\n<br/>\nPeace,<br/>\nAmy </span></blockquote></div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"long exchange about a teen (longest post EVER)","postDate":"1116871530","msgId":106116,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI1LjYwMDVmODA1LjJmYzM3NTZhQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":106120,"prevInTime":106115,"nextInTime":106117,"topicId":106116,"numMessagesInTopic":0,"msgSnippet":"[INTRO:  I m not saying this is about an unschooled teen, but it s a  teen in an unschooling family.  I ve tried to take out identifying stuff,  so if you know","messageBody":"<div id=\"ygrps-yiv-1048276336\">[INTRO:  I&#39;m not saying this is about an unschooled teen, but it&#39;s a  teen in <br/>\nan unschooling family.  I&#39;ve tried to take out identifying stuff,  so if you <br/>\nknow who it is, don&#39;t blurt that out; it&#39;s not a contest to identify  the <br/>\nauthor. &lt;g&gt;   If anyone responds, oh PLEASE, please don&#39;t  quote the whole thing <br/>\npost accidentally or on purpose either.]<br/>\n+++++++++++++++++++++++++++++++++++++++++++++++++++<br/>\n[a mom wrote:]<br/>\n<br/>\nWe&#39;ve been following the unschooling lifestyle for two and a half years  <br/>\nnow. For [all but one of my several kids], I am at peace. I see fruit in  <br/>\ntheir <br/>\nlives and they are also satisfied with how they are learning. It&#39;s  been <br/>\na rich lifestyle.<br/>\n<br/>\nWhat&#39;s odd is that the kid who sort of  propelled me in that direction <br/>\nis the one I&#39;m most worried about as an  unschooler.<br/>\n<br/>\nIt&#39;s [the oldest boy]. He&#39;s almost 18. This last year he  decided to work, <br/>\nact in a <br/>\nplay, play Magic and spend time online learning  Klingon. He didn&#39;t do <br/>\nanything schooly at all (even though he had been told  to take chemistry <br/>\nand language for college admissions). I was cool with  that. Felt he <br/>\nwould come to the decision to take them or not as he gained  clarity. In <br/>\naddition, he plays around a bit on the guitar and the piano. He  reads <br/>\nsome, though not nearly as much or as widely as he did a year or two  <br/>\nago. And he&#39;s devoted to the X box. :)<br/>\n<br/>\nWe set no curfew but asked him  to call to let us know where and when he <br/>\nwas anywhere. He&#39;s been great about  that. He did, however, flip his <br/>\nschedule and we saw him very little as he  tended to stay up all night <br/>\nand sleep during the days. He was often out with  friends much older <br/>\nthan him (early twenties). His job sometimes required him  to work in <br/>\nthe mornings and so did Shakespeare rehearsals so when those  happened, <br/>\nhe&#39;d get sick from not sleeping enough. He depended on caffeine to  keep <br/>\nhim going.<br/>\n<br/>\nIn the last several months, a few things have  occurred that give me <br/>\nangst. I remember you once said about Kirby that you  hoped he didn&#39;t <br/>\nbecome an unschooler who went on to be a bum. :) That rang  true here.<br/>\n<br/>\n[Kid&#39;s name...] has made some not very good decisions  this year... ....<br/>\n[censored  part, nothing illegal, just sensitive info], <br/>\ngot a speeding <br/>\nticket that resulted in a one month suspension of his  license plus a <br/>\nrestricted license for two weeks (he got this ticket on his  way to <br/>\n&quot;break up&quot; with that girl), he became addicted to Mountain Dew (seven  a <br/>\nday) and after having had no cavities for his whole life, now has $2700  <br/>\nworth of restoration work ahead of him (something like fifteen  <br/>\ncavities). Our insurance will cover $800 of it, we pay the rest. And  <br/>\nthen his wisdom teeth have to come out (after he&#39;s off insurance at <br/>\n18).  He was supposed to go to the dentist all year but kept putting it <br/>\noff, even  when I tried to schedule it for him, something always came <br/>\nup.<br/>\n<br/>\nHis  room is the typical teen disaster and we&#39;ve left it to him. But he <br/>\nstates  repeatedly that while he doesn&#39;t mind (on the one hand) he then <br/>\nblames his  room for not being able to do things he says he wants to do <br/>\n(like writing an  application essay for a college he said he wanted to <br/>\ngo to). As far as we&#39;re  concerned, he doesn&#39;t have to go to college. <br/>\nBut we do need him to have some  kind of interest or drive that gives <br/>\nevidence to a future (or at least a  meantime plan).<br/>\n<br/>\nHe complains of feeling like he&#39;s never accomplished  anything, he <br/>\nthinks he isn&#39;t capable like students in school (not true - his  natural <br/>\nintelligence is high and he does surprisingly well on the ACT/SAT  <br/>\ntests), and he talks like he isn&#39;t ever going to be able to hold down a  <br/>\njob or sustain work in a classroom format. He believes he can&#39;t sustain  <br/>\nhis attention unless he is riveted and even then, he needs lots of  <br/>\nbreaks and changes of pace to keep from getting too bored. He says that  <br/>\nthe Internet is like an addiction.<br/>\n<br/>\nYesterday we attended a graduation  party for our best friend&#39;s youngest <br/>\ndaughter. He realized that he hasn&#39;t  had a party like this (had said he <br/>\ndidn&#39;t want one back when we discussed  it) and then started saying how <br/>\nhe wouldn&#39;t have enough friends to come to  something like this and that <br/>\nhe hasn&#39;t achieved anything and has nowhere to  go next. Yet even as we <br/>\ntalk, he ends up resisting any ideas for direction  or steps to take in <br/>\nthe meantime.<br/>\n<br/>\nIt feels like his life ran out of  control this year and at the end, he <br/>\ndoesn&#39;t see himself as having anything  to show for it. Yet even with <br/>\nhis tears and depressed reports, he is also  not motivated to change <br/>\nanything about his life. He says he would be fine  just going on this <br/>\nway.<br/>\n<br/>\nI am completely flummoxed on what to do next.  We can&#39;t simply continue <br/>\nas is. But I also only hear suggestions from  parents who come from a <br/>\nvery different approach. If you have any insight for  me, I&#39;d sorely <br/>\nappreciate it<br/>\n==========================================<br/>\nI sent two e-mails in a row late last night:<br/>\n==========================================<br/>\n   <br/>\nThe same kinds of things happen with kids who graduated from high school,  <br/>\nand the same kinds of things (and much much worse) happen to kids who&#39;ve gotten  <br/>\ninto college on scholarships and take a tailspin for some reason.  <br/>\n <br/>\n-=- We can&#39;t simply continue as is.-=-<br/>\n <br/>\nFor how long and why not?<br/>\nHe&#39;s 18.  He&#39;s not 23.<br/>\n <br/>\nMy husband got his degree at 30.  Just as with late reading, nobody  would <br/>\nknow who works with him.  An earlier degree doesn&#39;t make a better  engineer.<br/>\n <br/>\nI think you&#39;re worrying too hard too early.   The dental stuff is  a bummer.  <br/>\nWhy isn&#39;t he still on insurance at 18?  Would enrolling in  school fulltime <br/>\nget him back on insurance?  Can you clean his room for  him?<br/>\n <br/>\nI offered a couple of Kirby&#39;s friends money to help him clean his  room when <br/>\nhe was 17.   They did a big re-org.  Could he  trade rooms with another kid or <br/>\nwith a less-used room so that a full move was  require and he could <br/>\nreorganize as it went?<br/>\n <br/>\nCould you and he make a list of things he wants to do?  Some people  love <br/>\nlists.  Some don&#39;t.<br/>\n <br/>\nWisdom teeth have to come out of most people and that&#39;s not an unschooling  <br/>\nissue.  I got mine out late in my last year of college to get it on my  dad&#39;s <br/>\ninsurance, and it wasn&#39;t a good time as far as tests and finals  went.<br/>\n <br/>\nCan you get your son out away from the house and the phone and the X-Box  for <br/>\nhalf a day or a day or two so you can talk?<br/>\n <br/>\nSandra<br/>\n================and the 2nd one from me===================<br/>\nI thought of something else:<br/>\n <br/>\n <br/>\n-=-We&#39;ve  been following the unschooling lifestyle for two and a half years <br/>\nnow. For  four of my five kids, I am at peace. I see fruit in their <br/>\nlives and they  are also satisfied with how they are learning. It&#39;s been <br/>\na rich  lifestyle.<br/>\n<br/>\n-=-What&#39;s odd is that the kid who sort of propelled me in  that direction <br/>\nis the one I&#39;m most worried about as an  unschooler.-=-<br/>\n<br/>\nBecause he was in school/schooled so long, unschooling might not have  really <br/>\ntaken, deep inside him.  He&#39;s probably looking at himself as a  dropout <br/>\nrather than a full-on unschooler.  That probably can&#39;t be  helped.  <br/>\n <br/>\nBut there are tons of dropouts who do well, so even if he continues to feel  <br/>\nhe might&#39;ve, should&#39;ve done differently, that doesn&#39;t mean something cool and  <br/>\ninteresting won&#39;t come along.  And cool and interesting things ARE in his  <br/>\nlife, right?<br/>\n <br/>\nDo you feel he would have done better by staying in school?<br/>\nIf not, start there and run your simulations and scenarios, not from last  <br/>\nweek.  <br/>\n <br/>\nWhat were your options and what will the results of your choices be?   Are <br/>\nyou expecting him to be back on, or parallel to,  the assembly line you  took <br/>\nhim off of?<br/>\n <br/>\nSandra<br/>\n<br/>\n <br/>\n=========================================<br/>\n<br/>\n <br/>\nSandra, thanks for this. I&#39;m mulling it over.<br/>\n<br/>\nI feel like we&#39;ve  talked endlessly with [him], alone, together, with <br/>\nopenness and  love. [DH] took him away for a weekend to see [a band] out <br/>\nof  town and they talked the whole time. I spend hours with [my son] going  <br/>\nover these kinds of issues. And it&#39;s not just me bringing them up. This  <br/>\nlast time it was him, sort of bad talking himself and comparing himself  <br/>\nto our best friends. It breaks my heart. If I felt he was happy, I <br/>\nthink  I could bear it all. I have been all year. But now things are <br/>\nhitting the  skids.<br/>\n<br/>\nHe&#39;s our most consuming child. He was in school for three classes  total <br/>\nout of the rest of his life over a two year period. He decided against  <br/>\nthat this year and has not done anything school related, even lacrosse.  <br/>\nWe have had him on less of a schedule than any of the other kids all  <br/>\nalong. He loved the whole concept of unschooling and embraced it  <br/>\nimmediately. What he has had a hard time with, though, is that he does  <br/>\ncompare himself to his friends (Magic, other homeschooled kids, kids  <br/>\nfrom his old lacrosse team) and sees himself as not having accomplished  <br/>\nanything. Even when I discuss with him what I see as his  <br/>\naccomplishments, he dismisses them saying he never really makes  <br/>\nprogress, never completes anything, just investigates until the urge  <br/>\nwears off. And if it gets too hard, he quits.<br/>\n<br/>\nWe have had friends  come and clean out his room. I&#39;ve cleaned it. His <br/>\ndad has cleaned it. It  returns to the previous state quickly. I have <br/>\nnot nagged. Ironically as a  kid (under 12), he was a total neat nik and <br/>\nwould work really hard to keep  his collections perfectly displayed, <br/>\nhe&#39;d spend hours listening to books on  tape and organizing his room. He <br/>\nhad to have everything in its right place.  Not sure what changed. <br/>\nNeither is he.<br/>\n<br/>\nHe is calling himself a  drop-out, that&#39;s for sure. My attempts to help <br/>\nhim see himself differently  don&#39;t seem to be working.<br/>\n<br/>\nI thought cool and interesting things were in  his life.<br/>\n<br/>\nFor instance, he is in this Shakespeare play. He&#39;s been in  rehearsals <br/>\nfor a full year every week, once a week. Yet he told me yesterday  that <br/>\nhe still doesn&#39;t have his lines nailed (even though the performances  <br/>\nare in ten days). I ask why. He says he just forgets. But when he comes  <br/>\nhome from rehearsals, he is the happiest person alive. He absolutely  <br/>\nloves it.<br/>\n<br/>\nI remind him to study lines. He says, &quot;Okay!&quot; Then he goes  upstairs and <br/>\nforgets everything. It drives me bananas.<br/>\n<br/>\nHe love Magic  for the deck assembly and plays, but it&#39;s been like a <br/>\nmoney hole for him. He  drafts, he rarely wins or moves past the first <br/>\nround, said he wanted to be a  judge, started down that road and then <br/>\nhas dropped it.<br/>\n<br/>\nHe likes  invented languages. He studies them, sort of. I have thought <br/>\nhe&#39;s done more  than he has. He tells me that in fact he is more playing <br/>\nwith them.<br/>\n<br/>\nI  just don&#39;t know Sandra.<br/>\n<br/>\nI don&#39;t want him on an assembly line. What I want  is to see that he is <br/>\nhappy (right now he is not), that he is meaningfully  engaged in his own <br/>\nlife (whatever he chooses), that he has some kind of  understanding of <br/>\nthe future beyond three days out (this can include college  or not, <br/>\nworking fulltime at [the convenience store] or choosing to  invest his time <br/>\nin some <br/>\ninterest that he wants to develop).<br/>\n<br/>\nRight  now, it looks more like he is withdrawing from life in favor of <br/>\ndistraction  for safety (to not have to grow up). And he tells me he <br/>\ncan&#39;t imagine ever  getting there.<br/>\n<br/>\nI know you&#39;re busy so if you have said all you meant to,  that&#39;s fine. I <br/>\nam going to think through your comments again. I want to  explore what <br/>\nother ways of being 18 might be cool with us and with  him.<br/>\n===============================================<br/>\n(me to her)<br/>\n   <br/>\n <br/>\nIn a message dated 5/23/2005 6:44:09 AM Mountain Daylight Time,  <br/>\n[correspondent] writes:<br/>\n<br/>\nHe&#39;s our  most consuming child. He was in school for three classes total <br/>\nout of the  rest of his life over a two year period. He decided against <br/>\nthat this year  and has not done anything school related,<br/>\n<br/>\n<br/>\nSo really he&#39;s never been out of school until this last year?  <br/>\nThen this doesn&#39;t count at all (in my opinion, with limited knowledge) as  an <br/>\nunschooling situation.<br/>\n <br/>\n-=-If I felt he was happy, I <br/>\nthink I could bear it all. I have been all  year. But now things are <br/>\nhitting the skids.<br/>\n-=-<br/>\n <br/>\nHe&#39;s in a play. He has a job.  He&#39;s addicted to...  crack?  heroin?  alcohol?<br/>\nNo, you said Mountain Dew.<br/>\n <br/>\n-=-He loved the whole concept of unschooling and embraced it  <br/>\nimmediately. What he has had a hard time with, though, is that he does  <br/>\ncompare himself -=-<br/>\n <br/>\nWell then he liked the idea, &quot;the whole concept,&quot; but he was still in  <br/>\nschool, and is still seeing himself as one of those (a failed &quot;one of  those&quot;).<br/>\n <br/>\nYou can&#39;t back up and live it again.  You have to live through  it.<br/>\n <br/>\nTalking to him isn&#39;t helping.  Maybe try NOT talking to him about  it.  Talk <br/>\nto him about other, real things.  I have the feeling your  displeasure and <br/>\nworry is oozing out.<br/>\n <br/>\n-=-Even when I discuss with him what I see as his <br/>\naccomplishments, he  dismisses them saying he never really makes <br/>\nprogress, never completes  anything, just investigates until the urge <br/>\nwears off. And if it gets too  hard, he quits.=-<br/>\n <br/>\nI do that.  Lots of people do that.  The VAST majority of them  are over 18.<br/>\n <br/>\nSome people have held ten or twenty different jobs in their lives.   It&#39;s not <br/>\na crime.  It makes their conversations fascinating and they often  know how <br/>\nto fix their own plumbing and cars and electricity because they didn&#39;t  spend <br/>\ntheir whole lives refolding the sweaters at JCPenney&#39;s.<br/>\n <br/>\nStability is overrated.  &quot;Purpose&quot; is overrated.  They have to  evolve <br/>\nnaturally, and poking them and talking to them doesn&#39;t help.<br/>\n <br/>\n-=-We have had friends come and clean out his room. I&#39;ve cleaned it. His  <br/>\ndad has cleaned it. It returns to the previous state quickly. I have <br/>\nnot  nagged. Ironically as a kid (under 12), he was a total neat nik and <br/>\nwould  work really hard to keep his collections perfectly displayed, <br/>\nhe&#39;d spend  hours listening to books on tape and organizing his room. He <br/>\nhad to have  everything in its right place. Not sure what changed. <br/>\n-=-<br/>\n <br/>\nPuberty and maturity?  If there were not a natural desire to find  one&#39;s <br/>\nparents&#39; home crowding and limiting, everyone would live with his  parents.  Maybe <br/>\nwhen he was 12 it really felt like his big space, and now  it feels like his <br/>\nlittle old dusty nest that he needs to grow out of.  <br/>\n <br/>\n-=-<br/>\nHe is calling himself a drop-out, that&#39;s for sure. My attempts to  help <br/>\nhim see himself differently don&#39;t seem to be working.-=-<br/>\n <br/>\nThey  might be making it worse.<br/>\n <br/>\n-=-I thought cool and interesting things were in his life.-=-<br/>\n <br/>\nIf they were a little while back, they will be again.<br/>\nI think you&#39;re standing too close and rocking and talking instead of  backing <br/>\nup, being still, looking at the sky, having some tea, singing happy  songs, <br/>\nand letting a day pass.  And then live a full week, as peacefully  and as <br/>\nhappily as you can.  <br/>\n <br/>\nMy mom went to AA for nine years before she decided to just blow it off and  <br/>\ndrink for the rest of her life.  One thing they say there that sounds funny  <br/>\nand horrible at first is profoundly true.  If someone in a meeting is going  on <br/>\nand on about the past and the future, someone will say &quot;You have one foot in  <br/>\nthe past and one foot in the future and you&#39;re pissing all over today.&quot;<br/>\n <br/>\nRough image, but looking at your e-mail it&#39;s all about how much better  <br/>\nthings were and how awful they&#39;re going to be.<br/>\n <br/>\n-=-I remind him to study lines. He says, &quot;Okay!&quot; Then he goes upstairs and  <br/>\nforgets everything-=-<br/>\n <br/>\n&quot;Study&quot; in that schoolish way that doesn&#39;t work?<br/>\nYou remind him, and he goes upstairs and forgets to do something  fruitless?  <br/>\n <br/>\nRead through with him and see what parts he does know and what he  doesn&#39;t.<br/>\nPhotocopy the script so you or he (or both) can mark up a practice  copy.  <br/>\nWhere there&#39;s a scene he really doesn&#39;t know, maybe record it through,  <br/>\nreading the other parts, and have him read farther from the microphone than you  do <br/>\nso he can play that back and try to fill in his own lines.<br/>\nMaybe that&#39;s not what will work for him, but what you&#39;ve done so far for a  <br/>\nyear didn&#39;t do it.<br/>\n <br/>\n-=-He love Magic for the deck assembly and plays, but it&#39;s been like a  <br/>\nmoney hole for him. He drafts, he rarely wins or moves past the first  <br/>\nround, said he wanted to be a judge, started down that road and then <br/>\nhas  dropped it.-=-<br/>\n <br/>\nSome people buy every book in a series, or collect comics, or ski, or  <br/>\nmaintain expensive bikes or skate boards, or collect pewter miniatures, or Avon  <br/>\nbottles, or action figures.  If he LOVES any aspect of it, why would being  a <br/>\njudge be better than just playing?<br/>\n <br/>\nWhat is better to put money into than something he loves, that provides him  <br/>\nsocial activity, that involves really complex thought...<br/>\n <br/>\n-=-He likes invented languages. He studies them, sort of. I have thought  <br/>\nhe&#39;s done more than he has. He tells me that in fact he is more playing  <br/>\nwith them.-=-<br/>\n <br/>\nYou should be discussing these things on the list, honestly.  I hate  to do <br/>\nall this writing and it not go to a larger group.  And you would get  ideas <br/>\nfrom lots of people, not just one.<br/>\n <br/>\n-=-He likes invented languages. He studies them, sort of. I have thought  <br/>\nhe&#39;s done more than he has. He tells me that in fact he is more playing  <br/>\nwith them.-=-<br/>\n <br/>\nThis is very, very bad.<br/>\nIt&#39;s bad that you think playing is not learning.<br/>\nYou think &quot;study&quot; has to be more than &quot;sort of.&quot;  <br/>\nYou think MORE messing around with Klingon or Elvish would be better than  <br/>\nless.<br/>\n <br/>\nYou think MORE Magic playing would be better than less.<br/>\n <br/>\n-=-What I want is to see that he is <br/>\nhappy (right now he is  not),-=-<br/>\n <br/>\nIt might be telling to see that you don&#39;t want him to BE happy, as much as  <br/>\nyou state that you (yourself) want to see (yourself) that he is happy.  You  <br/>\ncan say I&#39;m being picky or that that&#39;s not what you mean, but I think a lot of  <br/>\nthe communication is about you, and yet (as with the lines for the play, or as <br/>\n with his room not being clean enough for essay writing) you&#39;re not actively  <br/>\nhelping, but just reminding him.<br/>\n <br/>\n-=- I want is to see that he is <br/>\nhas some kind of understanding of  <br/>\nthe future beyond three days out -=-<br/>\n <br/>\nHe is eighteen years old.  Back off.<br/>\nYou&#39;re going by the clock and calendar instead of by his actual  readiness.  <br/>\nIf he were fifteen and not ready, you wouldn&#39;t be pressuring  him.  He&#39;s <br/>\neighteen so the pressure is on.   You have him on an  assembly line with a big <br/>\ntimer and you&#39;re denying it.<br/>\n <br/>\n-=-(this can include college or not, <br/>\nworking fulltime at Speedway or  choosing to invest his time in some <br/>\ninterest that he wants to  develop).-=-<br/>\n <br/>\nWhat if he invests his time in interests in the moment?<br/>\nIf he should only invest his time in interests he wants to develop, you  <br/>\ncripple him and misjudge his fleeting interests.  (Or at least you JUDGE  them, <br/>\nmis- or not.)<br/>\n <br/>\n-=-Right now, it looks more like he is withdrawing from life in favor of  <br/>\ndistraction for safety (to not have to grow up). -=-<br/>\n <br/>\nWhen kids are not ready to use the toilet, are they withdrawing to not have  <br/>\nto grow up?<br/>\nWhen Holly didn&#39;t read at the age of ten, was she withdrawing to not have  to <br/>\ngrow up?<br/>\nWhen Keith my husband didn&#39;t finish college at 22, was he withdrawing from  <br/>\nlive to not have to grow up?<br/>\n <br/>\n-=-I want to explore what other ways of being 18 might be cool with us and  <br/>\nwith him.<br/>\n-=-<br/>\n <br/>\nBut you are not 18.<br/>\nYou would probably do MUCH, much better to accept the way of being himself  <br/>\nthat is happening this moment.  If he&#39;s asleep, that is a way of  being.  <br/>\nEveryone should sleep.  I wish I had slept LOTS more last  night.  You shouldn&#39;t be <br/>\nexploring ways to be 18.  You should be  living a rich life and smiling at <br/>\nhim and giving him good food and rent movies  he likes and let him live through <br/>\nwhatever he&#39;s living through, because that&#39;s  all people can do.  Pressure <br/>\nfrom the outside makes the inside angst feel  worse.  <br/>\n <br/>\nDistraction can be a virtue, but you&#39;ve condemned the distracting  things <br/>\nhe&#39;s doing as not what YOU are cool with.<br/>\n <br/>\n-=-In other words, I know we can come up with the extra money for  <br/>\ninsurance, he can live with us, we can still pay for most of his life,  <br/>\neven his mistake of rotting fifteen teeth. Mistakes happen.=-<br/>\n <br/>\nThis fifteen teeth thing isn&#39;t about unschooling whatsoever, and you know  <br/>\nthat.<br/>\nFor one thing, he wasn&#39;t unschooled.  For another thing, if he has  fifteen <br/>\ncavities, when&#39;s the last time you took him to the dentist, or bought  him a <br/>\ncool new toothbrush and some new toothpaste?  They have orange  flavored now.  <br/>\nCavities might not even BE from not brushing, though.   He might have systemic <br/>\nproblems.  Does he take vitamins?  Could you  spend some of your nervous <br/>\nmom-energy looking up alternative theories on  teeth?<br/>\n <br/>\nIf you can pay extra to keep him on insurance or buy him insurance and you  <br/>\nKNOW a big bill is coming up, why are you talking to me?<br/>\n <br/>\n-=-If he continues to live the life he&#39;s living as he is, is there a time  <br/>\nto worry that he&#39;s needing to go beyond that world of X box, Internet  <br/>\nand shallow friendships? Is his self-reporting about not being able to  <br/>\nfocus or imagine a future ever a concern we should address?-=-<br/>\n <br/>\nHaven&#39;t you or your husband ever had restless, angsty periods of time where  <br/>\nyou didn&#39;t know what was going to happen next and it was uncomfortable?   <br/>\nThink back as clearly as you can about that, and if you have no memories to  think <br/>\nback on, consider what would keep you from remembering your teen  years.  <br/>\nSome people block out HUGE chunks of their lives.  But if you  can remember, <br/>\nweren&#39;t there times you were jittery and felt like you were  spinning your wheels? <br/>\n Does a background noise about what you should be  doing help?<br/>\n <br/>\n-=-If he continues to live the life he&#39;s living as he is, is there a time  <br/>\nto worry that he&#39;s needing to go beyond that world of X box, Internet  <br/>\nand shallow friendships?=-<br/>\n <br/>\nYou seem to feel the time is now.<br/>\nSome people don&#39;t even have shallow friendships.<br/>\n <br/>\nHave you done much reading about codependency?  Your life seems to be  <br/>\nsucking because you(yourself) don&#39;t like the level or quality of your son&#39;s  <br/>\nfriendships.<br/>\n <br/>\nAnd &quot;the world of internet&quot; is the whole big world.  There are people  and <br/>\nideas, art and music there.  <br/>\n <br/>\nSandra<br/>\n <br/>\n<br/>\n===============================================<br/>\n(her to me)<br/>\n <br/>\nThanks so much. Really.<br/>\n<br/>\nI am forwarding all you said to my husband.  I think you have given me <br/>\ninsight into myself that I hadn&#39;t seen. So thank  you. Really.<br/>\n<br/>\n[mom&#39;s name pulled, and don&#39;t EVEN try to guess  &lt;bwg&gt;]<br/>\n<br/>\n------------------------------------<br/>\nP.S. If you want to forward this discussion to the list, that&#39;s fine  <br/>\nwith me. I haven&#39;t had the time to be able to keep up with all the  <br/>\ndirections it would go. I&#39;m about to go out of town.<br/>\n<br/>\nA few things  stand out to me from your email which I reread several <br/>\ntimes  already.<br/>\n<br/>\nI am too busy.<br/>\n<br/>\nI am too worried and communicate  it.<br/>\n<br/>\nI have bought into a timeline for adulthood.<br/>\n<br/>\nThe money for the  teeth (of which we will pay $2000 regardless of <br/>\ninsurance) threw me for a  total loop and worried me... I wondered what <br/>\nit meant instead of just  figuring out how to pay for it.<br/>\n<br/>\nI need to back off again and  fill [his] life with affirming love, and <br/>\njoy in his interests, not with  worry and talks.<br/>\n<br/>\nIt seems obvious when you write it, but not so obvious  when I live it.<br/>\n<br/>\nAgain, thank you.<br/>\n<br/>\n===============<br/>\n   <br/>\n <br/>\nIn a message dated 5/23/2005 9:30:24 AM Mountain Daylight Time, [same mom]  <br/>\nwrites:<br/>\n<br/>\nIt seems  obvious when you write it, but not so obvious when I live  it.<br/>\n<br/>\n<br/>\nBut I&#39;m far away from it and you were dropping all those glaring verbal  <br/>\nclues. &lt;g&gt; <br/>\n <br/>\nMaybe the best longterm thing you can do is to practice whatever tricks  work <br/>\nfor you for being more objective about what&#39;s happening in your own  life.  I <br/>\ndon&#39;t like to be objective about the way I treat my husband  sometimes, and <br/>\njust realizing that I&#39;m blocking that from my objective view  tells me I&#39;m <br/>\nfeeling guilty or grouchy or something, and that&#39;s valuable  information too.     <br/>\nSo if you can keep building tricks for  scanning your life &quot;from a distance&quot; <br/>\n(somehow) you can find your own glaring  clues.<br/>\n <br/>\nI might take some of the anonymous looking stuff and post it.  I don&#39;t  want <br/>\nto post it from the beginning, because you wrote just to me and that would  <br/>\nseem cruel.  You can go in and fess up later that it was you if that would  seem <br/>\nhelpful to others, or just let it be there as is.  I&#39;ll probably just  put a <br/>\nbit of the last stuff, at unschooling.com, and thanks for okaying  that.<br/>\n=========================================<br/>\n===============<br/>\nback to this list, end of quotes:<br/>\n <br/>\nI left that last paragraph just for balance. &lt;g&gt;  When I looked  back <br/>\nthrough, it didn&#39;t seem so harsh as a full set, and I think the situation  will get <br/>\nbetter with the family really soon (probably already has), so other  than <br/>\nediting out all the names (I HOPE) and pulling one story, the full set  seems <br/>\nbetter than the end only.<br/>\n <br/>\nThe only clarification I want to make is that it might&#39;ve seemed I was  <br/>\nsuggesting less Klingon or less Magic cards would be better than more.  I&#39;m  not.  <br/>\nNeither is more better than less.  He should do just as much of  either as he <br/>\nwants to, without the mom&#39;s happiness and hopes hingeing on  it.<br/>\n <br/>\nSandra<br/>\n <br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":106125,"nextTopicId":106117}}