{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":332901363,"authorName":"keetry","from":"&quot;keetry&quot; &lt;keetry@...&gt;","profile":"keetry","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Sibling Relations","postDate":"1273191480","msgId":53907,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhydm03bytxc2ptQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhydWpqNys4cnB0QGVHcm91cHMuY29tPg=="},"prevInTopic":53900,"nextInTopic":0,"prevInTime":53906,"nextInTime":53908,"topicId":53881,"numMessagesInTopic":0,"msgSnippet":"== I know she also talked about talking with each kid separately about how it is hard having siblings and really empathizing in that way.== My 6 year old likes","messageBody":"<div id=\"ygrps-yiv-1693088538\">== I know she also talked about talking with each kid separately about how it is hard having siblings and really empathizing in that way.==<br/>\n<br/>\nMy 6 year old likes to control the play. If his almost 3 year old brother doesn&#39;t follow his rules, he gets very angry. First, he tries to get little brother to do what he wants. When that doesn&#39;t work he says that his little brother has to go to another room to play. Explaining to my 6 year old that his little brother doesn&#39;t quite understand or that big bro could play around little bro didn&#39;t seem to help. <br/>\n<br/>\nToday when they got into a dispute, I asked both of them what had happened. I just listened to them, back and forth, until they were both done. I didn&#39;t respond. I didn&#39;t even have to empathize. Once they got it out, they worked it out. They went back to playing together in the same room.<br/>\n<br/>\nAlysia</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Sibling Relations","postDate":"1273179022","msgId":53900,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCRTMyQjhFLjQwMDA0MDNAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PGhydWpqNys4cnB0QGVHcm91cHMuY29tPg==","referencesHeader":"PGhydWpqNys4cnB0QGVHcm91cHMuY29tPg=="},"prevInTopic":53883,"nextInTopic":53907,"prevInTime":53899,"nextInTime":53901,"topicId":53881,"numMessagesInTopic":0,"msgSnippet":"... I had a sudden memory of catching Roya s eye, and laughing with her as she tried unsuccessfully to get Roxana to do something, saying, It would be nice if","messageBody":"<div id=\"ygrps-yiv-1659148051\">On 5/6/2010 7:26 AM, DaBreeze21 wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Also I guess I can help her with a different tone - not getting <br/>\n&gt; annoyed but also helping her understand that she can&#39;t control <br/>\n&gt; everything, little brother included.<br/>\n<br/>\n </span></blockquote>I had a sudden memory of catching Roya&#39;s eye, and laughing with her as <br/>\nshe tried unsuccessfully to get Roxana to do something, saying, &quot;It <br/>\nwould be nice if she was a doll, right? That you could control? Instead <br/>\nof a real person?&quot;<br/>\n<br/>\nI remember that moment - that I suddenly had the feeling Roya hadn&#39;t <br/>\nreally thought of the baby as a real person, yet. It made a big <br/>\nimpression on her and Roya repeated it multiple times after that --- <br/>\n&quot;She&#39;s a real person so she needs to eat, right?&quot;<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Sibling Relations","postDate":"1273156550","msgId":53883,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Mjc1NUNFLThGRDctNDUzNC05MEU3LTNENDI1OEM3RTFGN0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhydWpqNys4cnB0QGVHcm91cHMuY29tPg==","referencesHeader":"PGhydWpqNys4cnB0QGVHcm91cHMuY29tPg=="},"prevInTopic":53881,"nextInTopic":53900,"prevInTime":53882,"nextInTime":53884,"topicId":53881,"numMessagesInTopic":0,"msgSnippet":"-=-I do find myself becoming impatient with her though when *I* think she is being unreasonable. Not just with sharing, but wanting to control things like","messageBody":"<div id=\"ygrps-yiv-1491715021\">-=-I do find myself becoming impatient with her though when *I* think  <br/>\nshe is being unreasonable. Not just with sharing, but wanting to  <br/>\ncontrol things like where he pulls up and things he touches etc. My  <br/>\nthought is that in some ways I am expecting too much from her and to  <br/>\nset her up for success as much as possible. -=-<br/>\n<br/>\nPeace and safety again!<br/>\nIs she helping him be safer, or just being controlling?<br/>\n<br/>\nMaybe instead of talking about it in terms of how she is affecting  <br/>\nhim, in such a case, you could talk about what kind of decisions she&#39;s  <br/>\nmaking.  Is she being helpful?  That&#39;s good!  Is she keeping him from  <br/>\nlearning?  That&#39;s not so good.<br/>\n<br/>\nI love the trading suggestion.<br/>\n&quot;I also ask her not to grab things from him and work on &quot;trading&quot; when  <br/>\nhe has something she wants - getting something for him.&quot;<br/>\n<br/>\nMore parents should know that.  Too many wrest things away from babies  <br/>\nwhen they could just offer something pretty and jingly and the kid  <br/>\nwould drop the other thing without another thought.<br/>\n<br/>\nSometimes it might work with a four year old too, offering her  <br/>\nsomething she wants and distracting her that way.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":335633701,"authorName":"DaBreeze21","from":"&quot;DaBreeze21&quot; &lt;susanmay15@...&gt;","profile":"DaBreeze21","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Sibling Relations","postDate":"1273156007","msgId":53881,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhydWpqNys4cnB0QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":53883,"prevInTime":53880,"nextInTime":53882,"topicId":53881,"numMessagesInTopic":0,"msgSnippet":"Hi- I ve had a question brewing concerning my almost 4 yo daughter and 9 month old son. We made it through our initial transition of adding a new person to","messageBody":"<div id=\"ygrps-yiv-195461888\">Hi-<br/>\n<br/>\nI&#39;ve had a question brewing concerning my almost 4 yo daughter and 9 month old son. We made it through our initial &quot;transition&quot; of adding a new person to the family after a few months and then we had a nice &quot;lull&quot; where things were very peaceful. Gerry wasn&#39;t moving yet and Marisol loves him a lot. I knew that things would change once he was moving and I realize that their relationship will always be evolving and changing, that it isn&#39;t a &quot;one shot&quot; deal as far as getting used to having a little brother for Marisol and that&#39;s that.<br/>\n<br/>\nAnyways, Gerry is crawling, pulling up, and all of that fun stuff now! Marisol does not like to share much at all yet. I am struggling with the best ways to help them both get what they want.<br/>\n<br/>\nThings that we have done:<br/>\n<br/>\nCreated a large, safe area for the baby where mostly his toys are and an area where big sister can put her stuff out of his reach. (Although already he is wanting to expand and really crawl all over the apartment - I am finding time for him to do that and also time when we are in the &quot;closed in&quot; space)<br/>\n<br/>\nAlso I try to help her get to places where she can play out of his reach if he seems to be bothering her - like up on a bed.<br/>\n<br/>\nI also ask her not to grab things from him and work on &quot;trading&quot; when he has something she wants - getting something for him.<br/>\n<br/>\nI do find myself becoming impatient with her though when *I* think she is being unreasonable. Not just with sharing, but wanting to control things like where he pulls up and things he touches etc. My thought is that in some ways I am expecting too much from her and to set her up for success as much as possible. Also I guess I can help her with a different tone - not getting annoyed but also helping her understand that she can&#39;t control everything, little brother included. I am trying to find the best balance of meeting both their needs and any input on how others have done this with siblings would be greatly appreciated! I remember Jenny saying before that something that has been really helpful for her family is creating space for both of them (not expecting them to be friends or together all the time) - I guess this will be more relevant when they are a little older, but for now trying to figure out how that can apply to little people too!<br/>\n<br/>\nI also keep in mind some of Sandra&#39;s words about how she felt when she became a big sister and am working hard to keep my relationship with Marisol positive. I know she also talked about talking with each kid separately about how it is hard having siblings and really empathizing in that way. I guess I am looking for some concrete strategies or words to use and other ideas people have about little kids sharing.<br/>\n<br/>\nThanks!<br/>\n<br/>\nSusan</div>","specialLinks":[]}],"prevTopicId":53786,"nextTopicId":53912}}